{"id":"2407.18827","title":"Human-artificial intelligence teaming for scientific information\n  extraction from data-driven additive manufacturing research using large\n  language models","authors":"Mutahar Safdar, Jiarui Xie, Andrei Mircea and Yaoyao Fiona Zhao","authorsParsed":[["Safdar","Mutahar",""],["Xie","Jiarui",""],["Mircea","Andrei",""],["Zhao","Yaoyao Fiona",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 15:43:52 GMT"}],"updateDate":"2024-07-29","timestamp":1722008632000,"abstract":"  Data-driven research in Additive Manufacturing (AM) has gained significant\nsuccess in recent years. This has led to a plethora of scientific literature to\nemerge. The knowledge in these works consists of AM and Artificial Intelligence\n(AI) contexts that have not been mined and formalized in an integrated way. It\nrequires substantial effort and time to extract scientific information from\nthese works. AM domain experts have contributed over two dozen review papers to\nsummarize these works. However, information specific to AM and AI contexts\nstill requires manual effort to extract. The recent success of foundation\nmodels such as BERT (Bidirectional Encoder Representations for Transformers) or\nGPT (Generative Pre-trained Transformers) on textual data has opened the\npossibility of expediting scientific information extraction. We propose a\nframework that enables collaboration between AM and AI experts to continuously\nextract scientific information from data-driven AM literature. A demonstration\ntool is implemented based on the proposed framework and a case study is\nconducted to extract information relevant to the datasets, modeling, sensing,\nand AM system categories. We show the ability of LLMs (Large Language Models)\nto expedite the extraction of relevant information from data-driven AM\nliterature. In the future, the framework can be used to extract information\nfrom the broader design and manufacturing literature in the engineering\ndiscipline.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}