{"id":"2407.11011","title":"Toward Availability Attacks in 3D Point Clouds","authors":"Yifan Zhu, Yibo Miao, Yinpeng Dong, Xiao-Shan Gao","authorsParsed":[["Zhu","Yifan",""],["Miao","Yibo",""],["Dong","Yinpeng",""],["Gao","Xiao-Shan",""]],"versions":[{"version":"v1","created":"Wed, 26 Jun 2024 08:13:30 GMT"}],"updateDate":"2024-07-17","timestamp":1719389610000,"abstract":"  Despite the great progress of 3D vision, data privacy and security issues in\n3D deep learning are not explored systematically. In the domain of 2D images,\nmany availability attacks have been proposed to prevent data from being\nillicitly learned by unauthorized deep models. However, unlike images\nrepresented on a fixed dimensional grid, point clouds are characterized as\nunordered and unstructured sets, posing a significant challenge in designing an\neffective availability attack for 3D deep learning. In this paper, we\ntheoretically show that extending 2D availability attacks directly to 3D point\nclouds under distance regularization is susceptible to the degeneracy,\nrendering the generated poisons weaker or even ineffective. This is because in\nbi-level optimization, introducing regularization term can result in update\ndirections out of control. To address this issue, we propose a novel Feature\nCollision Error-Minimization (FC-EM) method, which creates additional shortcuts\nin the feature space, inducing different update directions to prevent the\ndegeneracy of bi-level optimization. Moreover, we provide a theoretical\nanalysis that demonstrates the effectiveness of the FC-EM attack. Extensive\nexperiments on typical point cloud datasets, 3D intracranial aneurysm medical\ndataset, and 3D face dataset verify the superiority and practicality of our\napproach. Code is available at https://github.com/hala64/fc-em.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"805YOyMJb0qvNSy-LexPLA8ckvsiJTVKQcrPw-QWFew","pdfSize":"2211414"}
