{"id":"2407.17380","title":"2D and 3D Deep Learning Models for MRI-based Parkinson's Disease\n  Classification: A Comparative Analysis of Convolutional Kolmogorov-Arnold\n  Networks, Convolutional Neural Networks, and Graph Convolutional Networks","authors":"Salil B Patel, Vicky Goh, James F FitzGerald, Chrystalina A Antoniades","authorsParsed":[["Patel","Salil B",""],["Goh","Vicky",""],["FitzGerald","James F",""],["Antoniades","Chrystalina A",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 16:04:18 GMT"}],"updateDate":"2024-07-25","timestamp":1721837058000,"abstract":"  Early and accurate diagnosis of Parkinson's Disease (PD) remains challenging.\nThis study compares deep learning architectures for MRI-based PD\nclassification, introducing the first three-dimensional (3D) implementation of\nConvolutional Kolmogorov-Arnold Networks (ConvKANs), a new approach that\ncombines convolution layers with adaptive, spline-based activations. We\nevaluated Convolutional Neural Networks (CNNs), ConvKANs, and Graph\nConvolutional Networks (GCNs) using three open-source datasets; a total of 142\nparticipants (75 with PD and 67 age-matched healthy controls). For 2D analysis,\nwe extracted 100 axial slices centred on the midbrain from each T1-weighted\nscan. For 3D analysis, we used the entire volumetric scans. ConvKANs integrate\nlearnable B-spline functions with convolutional layers. GCNs represent MRI data\nas graphs, theoretically capturing structural relationships that may be\noverlooked by traditional approaches. Interpretability visualizations,\nincluding the first ConvKAN spline activation maps, and projections of graph\nnode embeddings, were depicted. ConvKANs demonstrated high performance across\ndatasets and dimensionalities, achieving the highest 2D AUROC (0.98) in one\ndataset and matching CNN peak 3D performance (1.00). CNN models performed well,\nwhile GCN models improved in 3D analyses, reaching up to 0.97 AUROC. 3D\nimplementations yielded higher AUROC values compared to 2D counterparts across\nall models. ConvKAN implementation shows promise for MRI analysis in PD\nclassification, particularly in the context of early diagnosis. The improvement\nin 3D analyses highlights the value of volumetric data in capturing subtle\nPD-related changes. While MRI is not currently used for PD diagnosis, these\nfindings suggest its potential as a component of a multimodal diagnostic\napproach, especially for early detection.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Ko8J_o1h5FAxYNjxd9A0ikrKNkRvYMANFH4iYnAofiA","pdfSize":"874534","objectId":"0x3d8ab0d860ab99066ee4cbf6c36b73dc7cc4560b4f070c51ee0fed0f70a5e3d5","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
