{"id":"2407.00944","title":"Diffusion Transformer Model With Compact Prior for Low-dose PET\n  Reconstruction","authors":"Bin Huang, Xubiao Liu, Lei Fang, Qiegen Liu and Bingxuan Li","authorsParsed":[["Huang","Bin",""],["Liu","Xubiao",""],["Fang","Lei",""],["Liu","Qiegen",""],["Li","Bingxuan",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 03:54:43 GMT"}],"updateDate":"2024-07-02","timestamp":1719806083000,"abstract":"  Positron emission tomography (PET) is an advanced medical imaging technique\nthat plays a crucial role in non-invasive clinical diagnosis. However, while\nreducing radiation exposure through low-dose PET scans is beneficial for\npatient safety, it often results in insufficient statistical data. This\nscarcity of data poses significant challenges for accurately reconstructing\nhigh-quality images, which are essential for reliable diagnostic outcomes. In\nthis research, we propose a diffusion transformer model (DTM) guided by joint\ncompact prior (JCP) to enhance the reconstruction quality of low-dose PET\nimaging. In light of current research findings, we present a pioneering PET\nreconstruction model that integrates diffusion and transformer models for joint\noptimization. This model combines the powerful distribution mapping abilities\nof diffusion models with the capacity of transformers to capture long-range\ndependencies, offering significant advantages for low-dose PET reconstruction.\nAdditionally, the incorporation of the lesion refining block and penalized\nweighted least squares (PWLS) enhance the recovery capability of lesion regions\nand preserves detail information, solving blurring problems in lesion areas and\ntexture details of most deep learning frameworks. Experimental results\ndemonstrate the effectiveness of DTM in enhancing image quality and preserving\ncritical clinical information for low-dose PET scans. Our approach not only\nreduces radiation exposure risks but also provides a more reliable PET imaging\ntool for early disease detection and patient management.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}