{"id":"2407.13838","title":"Temperature Distribution Prediction in Laser Powder Bed Fusion using\n  Transferable and Scalable Graph Neural Networks","authors":"Riddhiman Raut, Amit Kumar Ball, Amrita Basak","authorsParsed":[["Raut","Riddhiman",""],["Ball","Amit Kumar",""],["Basak","Amrita",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 18:14:47 GMT"}],"updateDate":"2024-07-22","timestamp":1721326487000,"abstract":"  This study presents novel predictive models using Graph Neural Networks\n(GNNs) for simulating thermal dynamics in Laser Powder Bed Fusion (L-PBF)\nprocesses. By developing and validating Single-Laser GNN (SL-GNN) and\nMulti-Laser GNN (ML-GNN) surrogates, the research introduces a scalable\ndata-driven approach that learns fundamental physics from small-scale Finite\nElement Analysis (FEA) simulations and applies them to larger domains.\nAchieving a Mean Absolute Percentage Error (MAPE) of 3.77% with the baseline\nSL-GNN model, GNNs effectively learn from high-resolution simulations and\ngeneralize well across larger geometries. The proposed models capture the\ncomplexity of the heat transfer process in L-PBF while significantly reducing\ncomputational costs. For example, a thermomechanical simulation for a 2 mm x 2\nmm domain typically requires about 4 hours, whereas the SL-GNN model can\npredict thermal distributions almost instantly. Calibrating models to larger\ndomains enhances predictive performance, with significant drops in MAPE for 3\nmm x 3 mm and 4 mm x 4 mm domains, highlighting the scalability and efficiency\nof this approach. Additionally, models show a decreasing trend in Root Mean\nSquare Error (RMSE) when tuned to larger domains, suggesting potential for\nbecoming geometry-agnostic. The interaction of multiple lasers complicates heat\ntransfer, necessitating larger model architectures and advanced feature\nengineering. Using hyperparameters from Gaussian process-based Bayesian\noptimization, the best ML-GNN model demonstrates a 46.4% improvement in MAPE\nover the baseline ML-GNN model. In summary, this approach enables more\nefficient and flexible predictive modeling in L-PBF additive manufacturing.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}