{"id":"2407.21641","title":"Enhancing the Harrow-Hassidim-Lloyd (HHL) algorithm in systems with\n  large condition numbers","authors":"Peniel Bertrand Tsemo, Akshaya Jayashankar, K. Sugisaki, Nishanth\n  Baskaran, Sayan Chakraborty, and V. S. Prasannaa","authorsParsed":[["Tsemo","Peniel Bertrand",""],["Jayashankar","Akshaya",""],["Sugisaki","K.",""],["Baskaran","Nishanth",""],["Chakraborty","Sayan",""],["Prasannaa","V. S.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 14:41:30 GMT"}],"updateDate":"2024-08-01","timestamp":1722436890000,"abstract":"  Although the Harrow-Hassidim-Lloyd (HHL) algorithm offers an exponential\nspeedup in system size for treating linear equations of the form\n$A\\vec{x}=\\vec{b}$ on quantum computers when compared to their traditional\ncounterparts, it faces a challenge related to the condition number\n($\\mathcal{\\kappa}$) scaling of the $A$ matrix. In this work, we address the\nissue by introducing the post-selection-improved HHL (Psi-HHL) approach that\ninvolves a simple yet effective modification of the HHL algorithm to extract a\nfeature of $|x\\rangle$, and which leads to achieving optimal behaviour in\n$\\mathcal{\\kappa}$ (linear scaling) for large condition number situations. This\nhas the important practical implication of having to use substantially fewer\nshots relative to the traditional HHL algorithm. We carry out two sets of\nsimulations, where we go up to 26-qubit calculations, to demonstrate the\nability of Psi-HHL to handle situations involving large $\\mathcal{\\kappa}$\nmatrices via: (a) a set of toy matrices, for which we go up to size $64 \\times\n64$ and $\\mathcal{\\kappa}$ values of up to $\\approx$ 1 million, and (b) a\ndeep-dive into quantum chemistry, where we consider matrices up to size $256\n\\times 256$ that reach $\\mathcal{\\kappa}$ of about 466. The molecular systems\nthat we consider are Li$_{\\mathrm{2}}$, RbH, and CsH. Although the feature of\n$|x\\rangle$ considered in our examples is an overlap between the input and\noutput states of the HHL algorithm, our approach is general and can be applied\nin principle to any transition matrix element involving $|x\\rangle$.\n","subjects":["Physics/Atomic Physics","Physics/Chemical Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Y27uTS3P2_LaLG1jyYq_kcJuyCNkv0CYGZU41-bO0Dk","pdfSize":"5923110"}
