{"id":"2407.04739","title":"Classification of Power Quality Disturbances Using Resnet with Channel\n  Attention Mechanism","authors":"Su Pan, Xingyang Nie, Xiaoyu Zhai, Biao Wang, Huilin Ge, Cheng He and\n  Zhenping Ding","authorsParsed":[["Pan","Su",""],["Nie","Xingyang",""],["Zhai","Xiaoyu",""],["Wang","Biao",""],["Ge","Huilin",""],["He","Cheng",""],["Ding","Zhenping",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 12:25:50 GMT"}],"updateDate":"2024-07-09","timestamp":1719923150000,"abstract":"  The detection and classification of power quality disturbances (PQDs) carries\nsignificant importance for power systems. In response to this imperative,\nnumerous intelligent diagnostic methods have been developed. However, existing\nidentification methods usually concentrate on single-type signals or on complex\nsignals with two types, rendering them susceptible to noisy labels and\nenvironmental effects. This study proposes a novel method for the\nclassification of PQDs, termed ST-GSResNet, which utilizes the S-Transform and\nan improved residual neural network (ResNet) with a channel attention\nmechanism. The ST-GSResNet approach initially uses the S-Transform to transform\na time-series signal into a 2D time-frequency image for feature enhancement.\nThen, an improved ResNet model is introduced, which employs grouped convolution\ninstead of the traditional convolution operation. This improvement aims to\nfacilitate learning with a block-diagonal structured sparsity on the channel\ndimension, the highly-correlated filters are learned in a more structured way\nin the networks with filter groups. By reducing the number of parameters in the\nnetwork in this significant manner, the model becomes less prone to\noverfitting. Furthermore, the SE module concentrates on primary components,\nwhich enhances the model's robustness in recognition and immunity to noise.\nExperimental results demonstrate that, compared to existing deep learning\nmodels, our approach has advantages in computational efficiency and\nclassification accuracy.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}