{"id":"2407.08552","title":"Authenticity and exclusion: social media recommendation algorithms and\n  the dynamics of belonging in professional networks","authors":"Nil-Jana Akpinar and Sina Fazelpour","authorsParsed":[["Akpinar","Nil-Jana",""],["Fazelpour","Sina",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:36:58 GMT"}],"updateDate":"2024-07-12","timestamp":1720708618000,"abstract":"  Homophily - the attraction of similarity - profoundly influences social\ninteractions, affecting associations, information disclosure, and the dynamics\nof social exchanges. Organizational studies reveal that when professional and\npersonal boundaries overlap, individuals from minority backgrounds often\nencounter a dilemma between authenticity and inclusion due to these\nhomophily-driven dynamics: if they disclose their genuine interests, they risk\nexclusion from the broader conversation. Conversely, to gain inclusion, they\nmight feel pressured to assimilate. How might the nature and design of social\nmedia platforms, where different conversational contexts frequently collapse,\nand the recommender algorithms that are at the heart of these platforms, which\ncan prioritize content based on network structure and historical user\nengagement, impact these dynamics? In this paper, we employ agent-based\nsimulations to investigate this question. Our findings indicate a decline in\nthe visibility of professional content generated by minority groups, a trend\nthat is exacerbated over time by recommendation algorithms. Within these\nminority communities, users who closely resemble the majority group tend to\nreceive greater visibility. We examine the philosophical and design\nimplications of our results, discussing their relevance to questions of\ninformational justice, inclusion, and the epistemic benefits of diversity.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}