{"id":"2407.04230","title":"A Physical Model-Guided Framework for Underwater Image Enhancement and\n  Depth Estimation","authors":"Dazhao Du, Enhan Li, Lingyu Si, Fanjiang Xu, Jianwei Niu, Fuchun Sun","authorsParsed":[["Du","Dazhao",""],["Li","Enhan",""],["Si","Lingyu",""],["Xu","Fanjiang",""],["Niu","Jianwei",""],["Sun","Fuchun",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 03:10:13 GMT"}],"updateDate":"2024-07-08","timestamp":1720149013000,"abstract":"  Due to the selective absorption and scattering of light by diverse aquatic\nmedia, underwater images usually suffer from various visual degradations.\nExisting underwater image enhancement (UIE) approaches that combine underwater\nphysical imaging models with neural networks often fail to accurately estimate\nimaging model parameters such as depth and veiling light, resulting in poor\nperformance in certain scenarios. To address this issue, we propose a physical\nmodel-guided framework for jointly training a Deep Degradation Model (DDM) with\nany advanced UIE model. DDM includes three well-designed sub-networks to\naccurately estimate various imaging parameters: a veiling light estimation\nsub-network, a factors estimation sub-network, and a depth estimation\nsub-network. Based on the estimated parameters and the underwater physical\nimaging model, we impose physical constraints on the enhancement process by\nmodeling the relationship between underwater images and desired clean images,\ni.e., outputs of the UIE model. Moreover, while our framework is compatible\nwith any UIE model, we design a simple yet effective fully convolutional UIE\nmodel, termed UIEConv. UIEConv utilizes both global and local features for\nimage enhancement through a dual-branch structure. UIEConv trained within our\nframework achieves remarkable enhancement results across diverse underwater\nscenes. Furthermore, as a byproduct of UIE, the trained depth estimation\nsub-network enables accurate underwater scene depth estimation. Extensive\nexperiments conducted in various real underwater imaging scenarios, including\ndeep-sea environments with artificial light sources, validate the effectiveness\nof our framework and the UIEConv model.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}