{"id":"2407.09338","title":"Nationwide frequency-dependent seismic site amplification models for\n  Iceland","authors":"Atefe Darzi, Benedikt Halldorsson, Fabrice Cotton, Sahar Rahpeyma","authorsParsed":[["Darzi","Atefe",""],["Halldorsson","Benedikt",""],["Cotton","Fabrice",""],["Rahpeyma","Sahar",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 15:15:06 GMT"}],"updateDate":"2024-07-15","timestamp":1720797306000,"abstract":"  Seismic wave amplification due to localized site conditions is an important\naspect of regional seismic hazard assessment. Without systematic studies of\nfrequency-dependent site-effects during strong Icelandic earthquakes, various\nlocal site proxies of large-scale studies in other seismic regions have been\nused in Iceland. Recently, earthquake site-effects were rigorously quantified\nfor 34 stations in Southwest Iceland for the first time and correlated to\ndistinct Icelandic geological units of hard rock, rock, lava rock, and\nsedimentary soil. These units are prevalent throughout Iceland and herein we\npresent 1) nationwide maps of proxies (slope, Vs30, geological units) that may\ncontribute to a better estimation of site effects and associated, 2)\nfrequency-dependent site-amplification maps of Iceland. The frequency-dependent\nsite factors for each geological unit are presented at 1-30 Hz and PGA.\nFinally, we generate site amplification maps based on recent large-scale models\ndeveloped in other seismic regions (ESRM20) and various site proxies they are\nbased on (geology- and slope-based inferred Vs30, geomorphological sedimentary\nthickness). We compare site-proxy maps and amplification maps from both\nIcelandic and large-scale, non-Icelandic, models. Neither spatial patterns nor\namplification levels in either proxy or amplification maps from large-scale\nnon-Icelandic studies resemble those observed from local quantitative\nstrong-motion research as presented in this study. We attribute the discrepancy\nprimarily to the young geology of Iceland and its formation history.\nAdditionally, we compare model performance across frequencies by assessing the\nbias of model predictions against empirical site amplifications in the South\nIceland Seismic Zone, accounting for site-to-site variability of residuals\nindicating the superior performance of the local amplification model.\n","subjects":["Physics/Geophysics","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}