{"id":"2407.00160","title":"Multi-Phase Thermal Structure & The Origin of the Broad-Line Region,\n  Torus, and Corona in Magnetically-Dominated Accretion Disks","authors":"Philip F. Hopkins","authorsParsed":[["Hopkins","Philip F.",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 18:00:25 GMT"}],"updateDate":"2024-07-02","timestamp":1719597625000,"abstract":"  Recent simulations have demonstrated the formation of 'flux-frozen' and\nhyper-magnetized disks, qualitatively distinct from both classical $\\alpha$\ndisks and magnetically-arrested disks, as a natural consequence of fueling gas\nto supermassive black holes in galactic nuclei. We previously showed that the\ndynamical structure of said disks can be approximated by simple analytic\nsimilarity models. Here we study the thermal properties of these models over a\nwide range of physical scales and accretion rates. We show there are several\ncharacteristic zones: a dusty 'torus'-like region, a multi-phase neutral and\nthen multi-phase ionized, broad line-emitting region interior to the\nsublimation radius, before finally a transition to a thermal accretion disk\nwith a warm Comptonizing layer. The disks are strongly-flared with large scale\nheights, and reprocess and/or scatter an order-one fraction of the central disk\nemission. As a result, this simple accretion disk model predicts phenomena\nincluding the existence of a dusty torus and its covering factor, geometry,\nclumpiness, and dust temperatures; a broad-line-region (BLR) with its\ncharacteristic sizes and luminosities and ionization properties; extended\nscattering/reprocessing surfaces producing cooler disk continuum and apparently\nlarge observed disk sizes; and existence of warm Comptonizing layers and hard\ncoronal gas. Remarkably, these properties emerge without our having to\nintroduce new components or parameters: they are all part of the accretion flow\nif the disks are in the hyper-magnetized limit.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6prgDgq56mA5uvsdPc6epISp1w98miNkBhNRy9gWd1A","pdfSize":"6693716"}
