{"id":"2407.01302","title":"Robot Instance Segmentation with Few Annotations for Grasping","authors":"Moshe Kimhi, David Vainshtein, Chaim Baskin, Dotan Di Castro","authorsParsed":[["Kimhi","Moshe",""],["Vainshtein","David",""],["Baskin","Chaim",""],["Di Castro","Dotan",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:58:32 GMT"}],"updateDate":"2024-07-02","timestamp":1719842312000,"abstract":"  The ability of robots to manipulate objects relies heavily on their aptitude\nfor visual perception. In domains characterized by cluttered scenes and high\nobject variability, most methods call for vast labeled datasets, laboriously\nhand-annotated, with the aim of training capable models. Once deployed, the\nchallenge of generalizing to unfamiliar objects implies that the model must\nevolve alongside its domain. To address this, we propose a novel framework that\ncombines Semi-Supervised Learning (SSL) with Learning Through Interaction\n(LTI), allowing a model to learn by observing scene alterations and leverage\nvisual consistency despite temporal gaps without requiring curated data of\ninteraction sequences. As a result, our approach exploits partially annotated\ndata through self-supervision and incorporates temporal context using\npseudo-sequences generated from unlabeled still images. We validate our method\non two common benchmarks, ARMBench mix-object-tote and OCID, where it achieves\nstate-of-the-art performance. Notably, on ARMBench, we attain an\n$\\text{AP}_{50}$ of $86.37$, almost a $20\\%$ improvement over existing work,\nand obtain remarkable results in scenarios with extremely low annotation,\nachieving an $\\text{AP}_{50}$ score of $84.89$ with just $1 \\%$ of annotated\ndata compared to $72$ presented in ARMBench on the fully annotated counterpart.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"4Ns57CZqcP3QdS-Qigo2Lgn4F0h8ACZmNq77ZjIKmII","pdfSize":"3806140"}
