{"id":"2407.20707","title":"Circularly polarized high harmonic beams carrying self-torque or\n  time-dependent orbital angular momentum","authors":"Alba de las Heras, Julio San Rom\\'an, Javier Serrano, Luis Plaja and\n  Carlos Hern\\'andez-Garc\\'ia","authorsParsed":[["Heras","Alba de las",""],["Román","Julio San",""],["Serrano","Javier",""],["Plaja","Luis",""],["Hernández-García","Carlos",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 10:02:57 GMT"}],"updateDate":"2024-07-31","timestamp":1722333777000,"abstract":"  In the rapidly evolving field of structured light, the self-torque has been\nrecently defined as an intrinsic property of light beams carrying\ntime-dependent orbital angular momentum. In particular, extreme-ultraviolet\n(EUV) beams with self-torque -- exhibiting a topological charge that\ncontinuously varies on the subfemtosecond timescale -- are naturally produced\nin high-order harmonic generation (HHG) when driven by two time-delayed intense\ninfrared vortex beams with different topological charges. Until now, the\npolarization state of such EUV beams carrying self-torque has been restricted\nto linear states due to the drastic reduction in the harmonic up-conversion\nefficiency with increasing the ellipticity of the driving field. In this work,\nwe theoretically demonstrate how to control the polarization state of EUV beams\ncarrying self-torque, from linear to circular. The extremely high sensitivity\nof HHG to the properties of the driving beam allows us to propose two different\ndriving schemes to circumvent the current limitations to manipulate the\npolarization state of EUV beams with self-torque. Our advanced numerical\nsimulations are complemented with the derivation of selection rules of angular\nmomentum conservation, which enable precise tunability over the angular\nmomentum properties of the harmonics with self-torque. The resulting high-order\nharmonic emission, carrying time-dependent orbital angular momentum with a\ncustom polarization state, can expand the applications of ultrafast\nlight-matter interactions, particularly in areas where dichroic or chiral\nproperties are crucial, such as magnetic materials or chiral molecules.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FEkL2mKZOXvaHznSgikmJECcaG-AA3qZbNHq8vWJFhs","pdfSize":"16048639"}
