{"id":"2407.12097","title":"Radio afterglows from tidal disruption events: An unbiased sample from\n  ASKAP RACS","authors":"Akash Anumarlapudi, Dougal Dobie, David L. Kaplan, Tara Murphy, Assaf\n  Horesh, Emil Lenc, Laura N. Driessen, Stefan W. Duchesne, Ms. Hannah Dykaar,\n  Bryan M. Gaensler, Timothy J. Galvin, J. A. Grundy, George Heald, Aidan\n  Hotan, Minh Huynh, James Leung, David McConnell, Vanessa A. Moss, Joshua\n  Pritchard, Wasim Raja, Kovi Rose, Gregory R. Sivakoff, Yuanming Wang, Ziteng\n  Wang, Mark Wieringa, M. T. Whiting","authorsParsed":[["Anumarlapudi","Akash",""],["Dobie","Dougal",""],["Kaplan","David L.",""],["Murphy","Tara",""],["Horesh","Assaf",""],["Lenc","Emil",""],["Driessen","Laura N.",""],["Duchesne","Stefan W.",""],["Dykaar","Ms. Hannah",""],["Gaensler","Bryan M.",""],["Galvin","Timothy J.",""],["Grundy","J. A.",""],["Heald","George",""],["Hotan","Aidan",""],["Huynh","Minh",""],["Leung","James",""],["McConnell","David",""],["Moss","Vanessa A.",""],["Pritchard","Joshua",""],["Raja","Wasim",""],["Rose","Kovi",""],["Sivakoff","Gregory R.",""],["Wang","Yuanming",""],["Wang","Ziteng",""],["Wieringa","Mark",""],["Whiting","M. T.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 18:05:39 GMT"}],"updateDate":"2024-07-18","timestamp":1721153139000,"abstract":"  Late-time ($\\sim$ year) radio follow-up of optically-discovered tidal\ndisruption events (TDEs) is increasingly resulting in detections at radio\nwavelengths, and there is growing evidence for this late-time radio activity to\nbe common to the broad class of sub-relativistic TDEs. Detailed studies of some\nof these TDEs at radio wavelengths are also challenging the existing models for\nradio emission. Using all-sky multi-epoch data from the Australian Square\nKilometre Array Pathfinder (ASKAP), taken as a part of the Rapid ASKAP\nContinuum Survey (RACS), we searched for radio counterparts to a sample of\noptically-discovered TDEs. We detected late-time emission at RACS frequencies\n(742-1032\\,MHz) in five TDEs, reporting the independent discovery of radio\nemission from TDE AT2019ahk and extending the time baseline out to almost\n3000\\,days for some events. Overall, we find that at least $22^{+15}_{-11}$\\%\nof the population of optically-discovered TDEs has detectable radio emission in\nthe RACS survey, while also noting that the true fraction can be higher given\nthe limited cadence (2 epochs separated by $\\sim 3\\,$ years) of the survey.\nFinally, we project that the ongoing higher-cadence ($\\sim 2$\\,months) ASKAP\nVariable and Slow Transients (VAST) survey can detect $\\sim 20$ TDEs in its\noperational span (4\\,yrs), given the current rate from optical surveys.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"p6rbsCpvxp4cQpP-VslxWSkzXtM0Pb7jbzIf_sWW4yk","pdfSize":"908204"}
