{"id":"2407.01393","title":"POLygraph: Polish Fake News Dataset","authors":"Daniel Dzienisiewicz, Filip Grali\\'nski, Piotr Jab{\\l}o\\'nski, Marek\n  Kubis, Pawe{\\l} Sk\\'orzewski, Piotr Wierzcho\\'n","authorsParsed":[["Dzienisiewicz","Daniel",""],["Graliński","Filip",""],["Jabłoński","Piotr",""],["Kubis","Marek",""],["Skórzewski","Paweł",""],["Wierzchoń","Piotr",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 15:45:21 GMT"}],"updateDate":"2024-07-02","timestamp":1719848721000,"abstract":"  This paper presents the POLygraph dataset, a unique resource for fake news\ndetection in Polish. The dataset, created by an interdisciplinary team, is\ncomposed of two parts: the \"fake-or-not\" dataset with 11,360 pairs of news\narticles (identified by their URLs) and corresponding labels, and the\n\"fake-they-say\" dataset with 5,082 news articles (identified by their URLs) and\ntweets commenting on them. Unlike existing datasets, POLygraph encompasses a\nvariety of approaches from source literature, providing a comprehensive\nresource for fake news detection. The data was collected through manual\nannotation by expert and non-expert annotators. The project also developed a\nsoftware tool that uses advanced machine learning techniques to analyze the\ndata and determine content authenticity. The tool and dataset are expected to\nbenefit various entities, from public sector institutions to publishers and\nfact-checking organizations. Further dataset exploration will foster fake news\ndetection and potentially stimulate the implementation of similar models in\nother languages. The paper focuses on the creation and composition of the\ndataset, so it does not include a detailed evaluation of the software tool for\ncontent authenticity analysis, which is planned at a later stage of the\nproject.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-I_h6zaOG_RKHR3G7C5whp7c-F4tzoV9qYJ4eVcdxIs","pdfSize":"343781"}
