{"id":"2407.01109","title":"Orbital cluster-based network modelling","authors":"Antonio Colanera, Nan Deng, Matteo Chiatto, Luigi de Luca and Bernd R.\n  Noack","authorsParsed":[["Colanera","Antonio",""],["Deng","Nan",""],["Chiatto","Matteo",""],["de Luca","Luigi",""],["Noack","Bernd R.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 09:19:44 GMT"}],"updateDate":"2024-07-02","timestamp":1719825584000,"abstract":"  We propose a novel reduced-order methodology to describe complex\nmulti-frequency fluid dynamics from time-resolved snapshot data. Starting point\nis the Cluster-based Network Model (CNM) thanks to its fully automatable\ndevelopment and human interpretability. Our key innovation is to model the\ntransitions from cluster to cluster much more accurately by replacing snapshot\nstates with short-term trajectories (\"orbits\") over multiple clusters, thus\navoiding nonphysical intra-cluster diffusion in the dynamic reconstruction. The\nproposed orbital CNM (oCNM) employs functional clustering to coarse-grain the\nshort-term trajectories. Specifically, different filtering techniques,\nresulting in different temporal basis expansions, demonstrate the versatility\nand capability of the oCNM to adapt to diverse flow phenomena. The oCNM is\nillustrated on the Stuart-Landau oscillator and its post-transient solution\nwith time-varying parameters to test its ability to capture the amplitude\nselection mechanism and multi-frequency behaviours. Then, the oCNM is applied\nto the fluidic pinball across varying flow regimes at different Reynolds\nnumbers, including the periodic, quasi-periodic, and chaotic dynamics. This\norbital-focused perspective enhances the understanding of complex temporal\nbehaviours by incorporating high-frequency behaviour into the kinematics of\nshort-time trajectories while modelling the dynamics of the lower frequencies.\nIn analogy to Spectral Proper Orthogonal Decomposition, which marked the\ntransition from spatial-only modes to spatio-temporal ones, this work advances\nfrom analysing temporal local states to examining piecewise short-term\ntrajectories, or orbits. By merging advanced analytical methods, such as the\nfunctional representation of short-time trajectories with CNM, this study paves\nthe way for new approaches to dissect the complex dynamics characterising\nturbulent systems.\n","subjects":["Physics/Fluid Dynamics","Nonlinear Sciences/Chaotic Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}