{"id":"2407.13779","title":"Leveraging Latent Evolutionary Optimization for Targeted Molecule\n  Generation","authors":"Siddartha Reddy N, Sai Prakash MV, Varun V, Vishal Vaddina,\n  Saisubramaniam Gopalakrishnan","authorsParsed":[["N","Siddartha Reddy",""],["MV","Sai Prakash",""],["V","Varun",""],["Vaddina","Vishal",""],["Gopalakrishnan","Saisubramaniam",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 13:42:21 GMT"}],"updateDate":"2024-07-22","timestamp":1719927741000,"abstract":"  Lead optimization is a pivotal task in the drug design phase within the drug\ndiscovery lifecycle. The primary objective is to refine the lead compound to\nmeet specific molecular properties for progression to the subsequent phase of\ndevelopment. In this work, we present an innovative approach, Latent\nEvolutionary Optimization for Molecule Generation (LEOMol), a generative\nmodeling framework for the efficient generation of optimized molecules. LEOMol\nleverages Evolutionary Algorithms, such as Genetic Algorithm and Differential\nEvolution, to search the latent space of a Variational AutoEncoder (VAE). This\nsearch facilitates the identification of the target molecule distribution\nwithin the latent space. Our approach consistently demonstrates superior\nperformance compared to previous state-of-the-art models across a range of\nconstrained molecule generation tasks, outperforming existing models in all\nfour sub-tasks related to property targeting. Additionally, we suggest the\nimportance of including toxicity in the evaluation of generative models.\nFurthermore, an ablation study underscores the improvements that our approach\nprovides over gradient-based latent space optimization methods. This\nunderscores the effectiveness and superiority of LEOMol in addressing the\ninherent challenges in constrained molecule generation while emphasizing its\npotential to propel advancements in drug discovery.\n","subjects":["Quantitative Biology/Biomolecules","Computing Research Repository/Machine Learning","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}