{"id":"2407.21159","title":"Embedding Space Selection for Detecting Memorization and Fingerprinting\n  in Generative Models","authors":"Jack He, Jianxing Zhao, Andrew Bai, Cho-Jui Hsieh","authorsParsed":[["He","Jack",""],["Zhao","Jianxing",""],["Bai","Andrew",""],["Hsieh","Cho-Jui",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 19:52:49 GMT"}],"updateDate":"2024-08-01","timestamp":1722369169000,"abstract":"  In the rapidly evolving landscape of artificial intelligence, generative\nmodels such as Generative Adversarial Networks (GANs) and Diffusion Models have\nbecome cornerstone technologies, driving innovation in diverse fields from art\ncreation to healthcare. Despite their potential, these models face the\nsignificant challenge of data memorization, which poses risks to privacy and\nthe integrity of generated content. Among various metrics of memorization\ndetection, our study delves into the memorization scores calculated from\nencoder layer embeddings, which involves measuring distances between samples in\nthe embedding spaces. Particularly, we find that the memorization scores\ncalculated from layer embeddings of Vision Transformers (ViTs) show an notable\ntrend - the latter (deeper) the layer, the less the memorization measured. It\nhas been found that the memorization scores from the early layers' embeddings\nare more sensitive to low-level memorization (e.g. colors and simple patterns\nfor an image), while those from the latter layers are more sensitive to\nhigh-level memorization (e.g. semantic meaning of an image). We also observe\nthat, for a specific model architecture, its degree of memorization on\ndifferent levels of information is unique. It can be viewed as an inherent\nproperty of the architecture. Building upon this insight, we introduce a unique\nfingerprinting methodology. This method capitalizes on the unique distributions\nof the memorization score across different layers of ViTs, providing a novel\napproach to identifying models involved in generating deepfakes and malicious\ncontent. Our approach demonstrates a marked 30% enhancement in identification\naccuracy over existing baseline methods, offering a more effective tool for\ncombating digital misinformation.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dQujfrhUfWRhLsAkxGuNknM76C8Rd-RwEeOju2WIkgM","pdfSize":"961671"}
