{"id":"2407.12279","title":"ER-FSL: Experience Replay with Feature Subspace Learning for Online\n  Continual Learning","authors":"Huiwei Lin","authorsParsed":[["Lin","Huiwei",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 03:00:05 GMT"}],"updateDate":"2024-07-18","timestamp":1721185205000,"abstract":"  Online continual learning (OCL) involves deep neural networks retaining\nknowledge from old data while adapting to new data, which is accessible only\nonce. A critical challenge in OCL is catastrophic forgetting, reflected in\nreduced model performance on old data. Existing replay-based methods mitigate\nforgetting by replaying buffered samples from old data and learning current\nsamples of new data. In this work, we dissect existing methods and empirically\ndiscover that learning and replaying in the same feature space is not conducive\nto addressing the forgetting issue. Since the learned features associated with\nold data are readily changed by the features related to new data due to data\nimbalance, leading to the forgetting problem. Based on this observation, we\nintuitively explore learning and replaying in different feature spaces.\nLearning in a feature subspace is sufficient to capture novel knowledge from\nnew data while replaying in a larger feature space provides more feature space\nto maintain historical knowledge from old data. To this end, we propose a novel\nOCL approach called experience replay with feature subspace learning (ER-FSL).\nFirstly, ER-FSL divides the entire feature space into multiple subspaces, with\neach subspace used to learn current samples. Moreover, it introduces a subspace\nreuse mechanism to address situations where no blank subspaces exist. Secondly,\nER-FSL replays previous samples using an accumulated space comprising all\nlearned subspaces. Extensive experiments on three datasets demonstrate the\nsuperiority of ER-FSL over various state-of-the-art methods.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}