{"id":"2407.03014","title":"Dielectric Fano Nanoantennas for Enabling Sub-Nanosecond Lifetimes in\n  NV-based Single Photon Emitters","authors":"Shu An, Dmitry Kalashnikov, Wenqiao Shi, Zackaria Mahfoud, Ah Bian\n  Chew, Yan Liu, Jing Wu, Di Zhu, Weibo Gao, Cheng-Wei Qiu, Victor Leong,\n  Zhaogang Dong","authorsParsed":[["An","Shu",""],["Kalashnikov","Dmitry",""],["Shi","Wenqiao",""],["Mahfoud","Zackaria",""],["Chew","Ah Bian",""],["Liu","Yan",""],["Wu","Jing",""],["Zhu","Di",""],["Gao","Weibo",""],["Qiu","Cheng-Wei",""],["Leong","Victor",""],["Dong","Zhaogang",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 11:15:59 GMT"}],"updateDate":"2024-07-04","timestamp":1720005359000,"abstract":"  Solid-state quantum emitters are essential sources of single photons, and\nenhancing their emission rates is of paramount importance for applications in\nquantum communications, computing, and metrology. One approach is to couple\nquantum emitters with resonant photonic nanostructures, where the emission rate\nis enhanced due to the Purcell effect. Dielectric nanoantennas are promising as\nthey provide strong emission enhancement compared to plasmonic ones, which\nsuffer from high Ohmic loss. Here, we designed and fabricated a dielectric Fano\nresonator based on a pair of silicon (Si) ellipses and a disk, which supports\nthe mode hybridization between quasi-bound-states-in-the-continuum (quasi-BIC)\nand Mie resonance. We demonstrated the performance of the developed resonant\nsystem by interfacing it with single photon emitters (SPEs) based on\nnitrogen-vacancy (NV-) centers in nanodiamonds (NDs). We observed that the\ninterfaced emitters have a Purcell enhancement factor of ~10, with sub-ns\nemission lifetime and a polarization contrast of 9. Our results indicate a\npromising method for developing efficient and compact single-photon sources for\nintegrated quantum photonics applications.\n","subjects":["Physics/Optics","Physics/Applied Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}