{"id":"2407.06105","title":"Colloquium: Synthetic quantum matter in non-standard geometries","authors":"Tobias Grass, Dario Bercioux, Utso Bhattacharya, Maciej Lewenstein,\n  Hai Son Nguyen, Christof Weitenberg","authorsParsed":[["Grass","Tobias",""],["Bercioux","Dario",""],["Bhattacharya","Utso",""],["Lewenstein","Maciej",""],["Nguyen","Hai Son",""],["Weitenberg","Christof",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 16:44:29 GMT"}],"updateDate":"2024-07-09","timestamp":1720457069000,"abstract":"  Quantum simulation is making a significant impact on scientific research. The\nprevailing tendency of the field is to build quantum simulators that get closer\nto real-world systems of interest, in particular electronic materials. However,\nprogress in the microscopic design also provides an opportunity for an\northogonal research direction: building quantum many-body systems beyond\nreal-world limitations. This colloquium takes this perspective: Concentrating\non synthetic quantum matter in non-standard lattice geometries, such as fractal\nlattices or quasicrystals, higher-dimensional or curved spaces, it aims at\nproviding a fresh introduction to the field of quantum simulation aligned with\nrecent trends across various quantum simulation platforms, including atomic,\nphotonic, and electronic devices. We also shine light on the novel phenomena\nwhich arise from these geometries: Condensed matter physicists may appreciate\nthe variety of different localization properties as well as novel topological\nphases which are offered by such exotic quantum simulators. But also in the\nsearch of quantum models for gravity and cosmology, quantum simulators of\ncurved spaces can provide a useful experimental tool.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Quantum Gases","Physics/General Relativity and Quantum Cosmology","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}