{"id":"2407.04243","title":"Exploration of Class Center for Fine-Grained Visual Classification","authors":"Hang Yao, Qiguang Miao, Peipei Zhao, Chaoneng Li, Xin Li, Guanwen Feng\n  and Ruyi Liu","authorsParsed":[["Yao","Hang",""],["Miao","Qiguang",""],["Zhao","Peipei",""],["Li","Chaoneng",""],["Li","Xin",""],["Feng","Guanwen",""],["Liu","Ruyi",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 04:11:09 GMT"}],"updateDate":"2024-07-08","timestamp":1720152669000,"abstract":"  Different from large-scale classification tasks, fine-grained visual\nclassification is a challenging task due to two critical problems: 1) evident\nintra-class variances and subtle inter-class differences, and 2) overfitting\nowing to fewer training samples in datasets. Most existing methods extract key\nfeatures to reduce intra-class variances, but pay no attention to subtle\ninter-class differences in fine-grained visual classification. To address this\nissue, we propose a loss function named exploration of class center, which\nconsists of a multiple class-center constraint and a class-center label\ngeneration. This loss function fully utilizes the information of the class\ncenter from the perspective of features and labels. From the feature\nperspective, the multiple class-center constraint pulls samples closer to the\ntarget class center, and pushes samples away from the most similar nontarget\nclass center. Thus, the constraint reduces intra-class variances and enlarges\ninter-class differences. From the label perspective, the class-center label\ngeneration utilizes classcenter distributions to generate soft labels to\nalleviate overfitting. Our method can be easily integrated with existing\nfine-grained visual classification approaches as a loss function, to further\nboost excellent performance with only slight training costs. Extensive\nexperiments are conducted to demonstrate consistent improvements achieved by\nour method on four widely-used fine-grained visual classification datasets. In\nparticular, our method achieves state-of-the-art performance on the\nFGVC-Aircraft and CUB-200-2011 datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}