{"id":"2407.05364","title":"PTaRL: Prototype-based Tabular Representation Learning via Space\n  Calibration","authors":"Hangting Ye, Wei Fan, Xiaozhuang Song, Shun Zheng, He Zhao, Dandan\n  Guo, Yi Chang","authorsParsed":[["Ye","Hangting",""],["Fan","Wei",""],["Song","Xiaozhuang",""],["Zheng","Shun",""],["Zhao","He",""],["Guo","Dandan",""],["Chang","Yi",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 13:32:03 GMT"},{"version":"v2","created":"Mon, 15 Jul 2024 08:37:49 GMT"}],"updateDate":"2024-07-16","timestamp":1720359123000,"abstract":"  Tabular data have been playing a mostly important role in diverse real-world\nfields, such as healthcare, engineering, finance, etc. With the recent success\nof deep learning, many tabular machine learning (ML) methods based on deep\nnetworks (e.g., Transformer, ResNet) have achieved competitive performance on\ntabular benchmarks. However, existing deep tabular ML methods suffer from the\nrepresentation entanglement and localization, which largely hinders their\nprediction performance and leads to performance inconsistency on tabular tasks.\nTo overcome these problems, we explore a novel direction of applying prototype\nlearning for tabular ML and propose a prototype-based tabular representation\nlearning framework, PTaRL, for tabular prediction tasks. The core idea of PTaRL\nis to construct prototype-based projection space (P-Space) and learn the\ndisentangled representation around global data prototypes. Specifically, PTaRL\nmainly involves two stages: (i) Prototype Generation, that constructs global\nprototypes as the basis vectors of P-Space for representation, and (ii)\nPrototype Projection, that projects the data samples into P-Space and keeps the\ncore global data information via Optimal Transport. Then, to further acquire\nthe disentangled representations, we constrain PTaRL with two strategies: (i)\nto diversify the coordinates towards global prototypes of different\nrepresentations within P-Space, we bring up a diversification constraint for\nrepresentation calibration; (ii) to avoid prototype entanglement in P-Space, we\nintroduce a matrix orthogonalization constraint to ensure the independence of\nglobal prototypes. Finally, we conduct extensive experiments in PTaRL coupled\nwith state-of-the-art deep tabular ML models on various tabular benchmarks and\nthe results have shown our consistent superiority.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}