{"id":"2407.10298","title":"Dynamics of fluid-driven fractures across material heterogeneities","authors":"Sri Savya Tanikella, Marie C Sigallon, Emilie Dressaire","authorsParsed":[["Tanikella","Sri Savya",""],["Sigallon","Marie C",""],["Dressaire","Emilie",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 19:21:58 GMT"}],"updateDate":"2024-07-16","timestamp":1720984918000,"abstract":"  Fracture propagation is highly sensitive to the conditions at the crack tip.\nIn heterogeneous materials, microscale obstacles can cause propagation\ninstabilities. Macroscopic heterogeneities modify the stress field over scales\nlarger than the tip region. Here, we experimentally investigate the propagation\nof fluid-driven fractures through multilayered materials. We focus on analyzing\nfracture profiles formed upon injection of a low-viscosity fluid into a\ntwo-layer hydrogel block. Experimental observations highlight the influence of\nthe originating layer on fracture dynamics. Fractures that form in the softer\nlayer are confined, with no penetration in the stiffer layer. Conversely,\nfractures initiated within the stiffer layer experience rapid fluid transfer\ninto the softer layer when reaching the interface. We report the propagation\ndynamics and show that they are controlled by the toughness contrast between\nneighboring layers, which drives fluid flow. We model the coupling between\nelastic deformation, material toughness, and volume conservation. After a short\ntransient regime, scaling arguments capture the dependence of the fracture\ngeometry on material properties, injection parameters, and time. These results\nshow that stiffness contrast can accelerate fracture propagation and\ndemonstrate the importance of macroscopic scale heterogeneities on fracture\ndynamics. These results have implications for climate mitigation strategies\ninvolving the storage of heat and carbon dioxide in stratified underground rock\nformations.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}