{"id":"2407.20606","title":"Evidence for Two-dimensional Weyl Fermions in Air-Stable Monolayer\n  PtTe$_{1.75}$","authors":"Zhihao Cai, Haijun Cao, Haohao Sheng, Xuegao Hu, Zhenyu Sun, Qiaoxiao\n  Zhao, Jisong Gao, Shin-ichiro Ideta, Kenya Shimada, Jiawei Huang, Peng Cheng,\n  Lan Chen, Yugui Yao, Sheng Meng, Kehui Wu, Zhijun Wang, Baojie Feng","authorsParsed":[["Cai","Zhihao",""],["Cao","Haijun",""],["Sheng","Haohao",""],["Hu","Xuegao",""],["Sun","Zhenyu",""],["Zhao","Qiaoxiao",""],["Gao","Jisong",""],["Ideta","Shin-ichiro",""],["Shimada","Kenya",""],["Huang","Jiawei",""],["Cheng","Peng",""],["Chen","Lan",""],["Yao","Yugui",""],["Meng","Sheng",""],["Wu","Kehui",""],["Wang","Zhijun",""],["Feng","Baojie",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 07:32:11 GMT"}],"updateDate":"2024-07-31","timestamp":1722324731000,"abstract":"  The Weyl semimetals represent a distinct category of topological materials\nwherein the low-energy excitations appear as the long-sought Weyl fermions.\nExotic transport and optical properties are expected because of the chiral\nanomaly and linear energy-momentum dispersion. While three-dimensional Weyl\nsemimetals have been successfully realized, the quest for their two-dimensional\n(2D) counterparts is ongoing. Here, we report the realization of 2D Weyl\nfermions in monolayer PtTe$_{1.75}$, which has strong spin-orbit coupling and\nlacks inversion symmetry, by combined angle-resolved photoemission\nspectroscopy, scanning tunneling microscopy, second harmonic generation, X-ray\nphotoelectron spectroscopy measurements, and first-principles calculations. The\ngiant Rashba splitting and band inversion lead to the emergence of three pairs\nof critical Weyl cones. Moreover, monolayer PtTe$_{1.75}$ exhibits excellent\nchemical stability in ambient conditions, which is critical for future device\napplications. The discovery of 2D Weyl fermions in monolayer PtTe$_{1.75}$\nopens up new possibilities for designing and fabricating novel spintronic\ndevices.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}