{"id":"2407.17118","title":"Coherent Phonons and Quasiparticle Renormalization in Semimetals from\n  First Principles","authors":"C. Emeis, S. Jauernik, S. Dahiya, Y. Pan, C. E. Jensen, P. Hein, M.\n  Bauer, F. Caruso","authorsParsed":[["Emeis","C.",""],["Jauernik","S.",""],["Dahiya","S.",""],["Pan","Y.",""],["Jensen","C. E.",""],["Hein","P.",""],["Bauer","M.",""],["Caruso","F.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 09:26:35 GMT"}],"updateDate":"2024-07-25","timestamp":1721813195000,"abstract":"  Coherent phonons, light-induced coherent lattice vibrations in solids,\nprovide a powerful route to engineer structural and electronic degrees of\nfreedom using light. In this manuscript, we formulate an ab initio theory of\nthe displacive excitation of coherent phonons (DECP), the primary mechanism for\nlight-induced structural control in semimetals. Our study - based on the ab\ninitio simulations of the ultrafast electron and coherent-phonon dynamics in\npresence of electron-phonon interactions - establishes a predictive\ncomputational framework for describing the emergence of light-induced\nstructural changes and the ensuing transient band-structure renormalization\narising from the DECP mechanism. We validate this framework via a combined\ntheoretical and experimental investigation of coherent phonons in the elemental\nsemimetal antimony. Via a Fourier analysis of time- and angle-resolved\nphotoemission spectroscopy (tr-ARPES) measurements, we retrieve information\nabout transient spectral features and quasiparticle renormalization arising\nfrom the coherent A1g phonon as a function of momentum, energy, time, and\nfluence. The qualitative and quantitative agreement between experiment and\ntheory corroborates the first-principles approach formulated in this study.\nBesides advancing the fundamental understanding of electron-phonon interactions\nmediated by coherent phonons, this study opens new opportunities for\npredictively engineering structural and electronic degrees of freedom in\nsemimetals via the DECP mechanism.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}