{"id":"2407.19980","title":"Vacuum Energy of Non-Supersymmetric $\\mathbf{\\tilde{S}}$ Heterotic\n  String Models","authors":"Luke A. Detraux, Alonzo R. Diaz Avalos, Alon E. Faraggi, and Benjamin\n  Percival","authorsParsed":[["Detraux","Luke A.",""],["Avalos","Alonzo R. Diaz",""],["Faraggi","Alon E.",""],["Percival","Benjamin",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 13:12:11 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 17:41:35 GMT"}],"updateDate":"2024-08-08","timestamp":1722258731000,"abstract":"  We use the free fermionic formulation of the heterotic-string in four\ndimensions to study the vacuum structure and energy of non-supersymmetric\ntachyon free models that correspond to compactifications of tachyonic vacua of\nthe ten dimensional heterotic-string. We explore the class of heterotic\n$SO(10)$ non-supersymmetric models constructed from the $\\tilde{S}$-model in\nthe Free Fermionic Formalism, and investigate the dependence of the potential\non the geometric moduli. This paper will explore a sample of $ 10^{9}$ string\nvacua to find the frequency of viable models, classifying these vacua by the\nfollowing fertility criteria: tachyon presence; number of spinorial\n$\\boldsymbol{16/\\overline{16}}$ representations; vectorial $\\boldsymbol{10}$\nstates; Top Quark Mass Coupling compatibility. Of these we find those that\nmimic supersymmetric models with equal number of bosons and fermions at the\nmassless level - $a_{00} = 0$. Tachyon free models occur with a frequency of\n$5.309\\times10^{-3}$. Furthermore, models that fulfil the rest of the\nphenomenological fertility conditions and the additional condition on $a_{00}$\noccur with probability $4.0 \\times 10^{-9}$ We analyse the partition functions\nand study the moduli dependence of such models, finding that almost all fertile\nmodels have finite, positive potential at the Free Fermionic Point, with $2$\nout of $84$ of the fertile cores having negative, finite potential. We\ndemonstratate that the Free Fermionic Point is not necessarily a minimum in the\npotential. This work provides further evidence that supersymmetry may not be a\nnecessary ingredient of phenomenological models, recreating many of the\ndesirable features of such models without employing supersymmetry.\n","subjects":["Physics/High Energy Physics - Theory","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}