{"id":"2407.16081","title":"PECAN: Personalizing Robot Behaviors through a Learned Canonical Space","authors":"Heramb Nemlekar, Robert Ramirez Sanchez and Dylan P. Losey","authorsParsed":[["Nemlekar","Heramb",""],["Sanchez","Robert Ramirez",""],["Losey","Dylan P.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 22:59:26 GMT"}],"updateDate":"2024-07-24","timestamp":1721689166000,"abstract":"  Robots should personalize how they perform tasks to match the needs of\nindividual human users. Today's robot achieve this personalization by asking\nfor the human's feedback in the task space. For example, an autonomous car\nmight show the human two different ways to decelerate at stoplights, and ask\nthe human which of these motions they prefer. This current approach to\npersonalization is indirect: based on the behaviors the human selects (e.g.,\ndecelerating slowly), the robot tries to infer their underlying preference\n(e.g., defensive driving). By contrast, our paper develops a learning and\ninterface-based approach that enables humans to directly indicate their desired\nstyle. We do this by learning an abstract, low-dimensional, and continuous\ncanonical space from human demonstration data. Each point in the canonical\nspace corresponds to a different style (e.g., defensive or aggressive driving),\nand users can directly personalize the robot's behavior by simply clicking on a\npoint. Given the human's selection, the robot then decodes this canonical style\nacross each task in the dataset -- e.g., if the human selects a defensive\nstyle, the autonomous car personalizes its behavior to drive defensively when\ndecelerating, passing other cars, or merging onto highways. We refer to our\nresulting approach as PECAN: Personalizing Robot Behaviors through a Learned\nCanonical Space. Our simulations and user studies suggest that humans prefer\nusing PECAN to directly personalize robot behavior (particularly when those\nusers become familiar with PECAN), and that users find the learned canonical\nspace to be intuitive and consistent. See videos here:\nhttps://youtu.be/wRJpyr23PKI\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}