{"id":"2407.14887","title":"Small Signal Capacitance in Ferroelectric HZO: Mechanisms and Physical\n  Insights","authors":"Revanth Koduru, Atanu K. Saha, Martin M. Frank and Sumeet K. Gupta","authorsParsed":[["Koduru","Revanth",""],["Saha","Atanu K.",""],["Frank","Martin M.",""],["Gupta","Sumeet K.",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 14:29:54 GMT"}],"updateDate":"2024-07-23","timestamp":1721485794000,"abstract":"  This study presents a theoretical investigation of the physical mechanisms\ngoverning small signal capacitance in ferroelectrics, focusing on Hafnium\nZirconium Oxide. Utilizing a time-dependent Ginzburg Landau formalism-based 2D\nmulti-grain phase-field simulation framework, we simulate the capacitance of\nmetal-ferroelectric-insulator-metal (MFIM) capacitors. Our simulation\nmethodology closely mirrors the experimental procedures for measuring\nferroelectric small signal capacitance, and the outcomes replicate the\ncharacteristic butterfly capacitance-voltage behavior. We delve into the\ncomponents of the ferroelectric capacitance associated with the dielectric\nresponse and polarization switching, discussing the primary physical mechanisms\n- domain bulk response and domain wall response - contributing to the butterfly\ncharacteristics. We explore their interplay and relative contributions to the\ncapacitance and correlate them to the polarization domain characteristics.\nAdditionally, we investigate the impact of increasing domain density with\nferroelectric thickness scaling, demonstrating an enhancement in the\npolarization capacitance component (in addition to the dielectric component).\nWe further analyze the relative contributions of the domain bulk and domain\nwall responses across different ferroelectric thicknesses. Lastly, we establish\nthe relation of polarization capacitance components to the capacitive memory\nwindow (for memory applications) and reveal a non-monotonic dependence of the\nmaximum memory window on HZO thickness.\n","subjects":["Condensed Matter/Materials Science","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}