{"id":"2407.00506","title":"ShapG: new feature importance method based on the Shapley value","authors":"Chi Zhao, Jing Liu, Elena Parilina","authorsParsed":[["Zhao","Chi",""],["Liu","Jing",""],["Parilina","Elena",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 18:19:55 GMT"}],"updateDate":"2024-07-02","timestamp":1719685195000,"abstract":"  With wide application of Artificial Intelligence (AI), it has become\nparticularly important to make decisions of AI systems explainable and\ntransparent. In this paper, we proposed a new Explainable Artificial\nIntelligence (XAI) method called ShapG (Explanations based on Shapley value for\nGraphs) for measuring feature importance. ShapG is a model-agnostic global\nexplanation method. At the first stage, it defines an undirected graph based on\nthe dataset, where nodes represent features and edges are added based on\ncalculation of correlation coefficients between features. At the second stage,\nit calculates an approximated Shapley value by sampling the data taking into\naccount this graph structure. The sampling approach of ShapG allows to\ncalculate the importance of features efficiently, i.e. to reduce computational\ncomplexity. Comparison of ShapG with other existing XAI methods shows that it\nprovides more accurate explanations for two examined datasets. We also compared\nother XAI methods developed based on cooperative game theory with ShapG in\nrunning time, and the results show that ShapG exhibits obvious advantages in\nits running time, which further proves efficiency of ShapG. In addition,\nextensive experiments demonstrate a wide range of applicability of the ShapG\nmethod for explaining complex models. We find ShapG an important tool in\nimproving explainability and transparency of AI systems and believe it can be\nwidely used in various fields.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}