{"id":"2407.04315","title":"Gradient-based Regularization for Action Smoothness in Robotic Control\n  with Reinforcement Learning","authors":"I Lee, Hoang-Giang Cao, Cong-Tinh Dao, Yu-Cheng Chen, I-Chen Wu","authorsParsed":[["Lee","I",""],["Cao","Hoang-Giang",""],["Dao","Cong-Tinh",""],["Chen","Yu-Cheng",""],["Wu","I-Chen",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 07:35:32 GMT"}],"updateDate":"2024-07-08","timestamp":1720164932000,"abstract":"  Deep Reinforcement Learning (DRL) has achieved remarkable success, ranging\nfrom complex computer games to real-world applications, showing the potential\nfor intelligent agents capable of learning in dynamic environments. However,\nits application in real-world scenarios presents challenges, including the\njerky problem, in which jerky trajectories not only compromise system safety\nbut also increase power consumption and shorten the service life of robotic and\nautonomous systems. To address jerky actions, a method called conditioning for\naction policy smoothness (CAPS) was proposed by adding regularization terms to\nreduce the action changes. This paper further proposes a novel method, named\nGradient-based CAPS (Grad-CAPS), that modifies CAPS by reducing the difference\nin the gradient of action and then uses displacement normalization to enable\nthe agent to adapt to invariant action scales. Consequently, our method\neffectively reduces zigzagging action sequences while enhancing policy\nexpressiveness and the adaptability of our method across diverse scenarios and\nenvironments. In the experiments, we integrated Grad-CAPS with different\nreinforcement learning algorithms and evaluated its performance on various\nrobotic-related tasks in DeepMind Control Suite and OpenAI Gym environments.\nThe results demonstrate that Grad-CAPS effectively improves performance while\nmaintaining a comparable level of smoothness compared to CAPS and Vanilla\nagents.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zzdAOkbvpZID5zjAm_8nM0LtG9Jnt3I__nT8lo3Oz7c","pdfSize":"1675882"}
