{"id":"2407.08957","title":"High throughput screening, crystal structure prediction, and carrier\n  mobility calculations of organic molecular semiconductors as hole transport\n  layer materials in perovskite solar cells","authors":"Md Omar Faruque, Suchona Akter, Dil K. Limbu, Kathleen Kilway,\n  Zhonghua Peng, and Mohammad R. Momeni","authorsParsed":[["Faruque","Md Omar",""],["Akter","Suchona",""],["Limbu","Dil K.",""],["Kilway","Kathleen",""],["Peng","Zhonghua",""],["Momeni","Mohammad R.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 03:18:47 GMT"}],"updateDate":"2024-07-15","timestamp":1720754327000,"abstract":"  Using a representative translational dimer model, high throughput\ncalculations are implemented for fast screening of a total of 74\ndiacenaphtho-extended heterocycle (DAH) derivatives as hole transport layer\n(HTL) materials in perovskite solar cells (PVSCs). Different electronic\nproperties, including band structures, band gaps, and band edges compared to\nmethylammonium and formamidinium lead iodide perovskites, along with\nreorganization energies, electronic couplings, and hole mobilities are\ncalculated in order to decipher the effects of different parameters, including\nthe polarity, steric and pi-conjugation, as well as the presence of explicit\nhydrogen bond interactions on the computed carrier mobilities of the studied\nmaterials. Full crystal structure predictions and hole mobility calculations of\nthe top candidates resulted in some mobilities exceeding 10 cm2/V.s, further\nvalidating the employed translational dimer model as a robust approach for\ninverse design and fast high throughput screening of new HTL organic\nsemiconductors with superior properties. The studied models and simulations\nperformed in this work are instructive in designing next-generation HTL\nmaterials for higher-performance PVSCs.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bkvtIPDlsKhzjZBMlwprqpfhwI85tTqeO36JGZbyHgA","pdfSize":"3786785"}
