{"id":"2407.17584","title":"Theorizing neuro-induced relationships between cognitive diversity,\n  motivation, grit and academic performance in multidisciplinary engineering\n  education context","authors":"Duy Duong-Tran, Siqing Wei, Li Shen","authorsParsed":[["Duong-Tran","Duy",""],["Wei","Siqing",""],["Shen","Li",""]],"versions":[{"version":"v1","created":"Mon, 13 May 2024 14:21:11 GMT"}],"updateDate":"2024-07-26","timestamp":1715610071000,"abstract":"  Nowadays, engineers need to tackle many unprecedented challenges that are\noften complex, and, most importantly, cannot be exhaustively compartmentalized\ninto a single engineering discipline. In other words, most engineering problems\nneed to be solved from a multidisciplinary approach. However, conventional\nengineering programs usually adopt pedagogical approaches specifically tailored\nto traditional, niched engineering disciplines, which become increasingly\ndeviated from the industry needs as those programs are typically designed and\ntaught by instructors with highly specialized engineering training and\ncredentials. To reduce the gap, more multidisciplinary engineering programs\nemerge by systematically stretching across all engineering fibers, and\nchallenge the sub-optimal traditional pedagogy crowded in engineering\nclassrooms. To further advance future-oriented pedagogy, in this work, we\nhypothesized neuro-induced linkages between how cognitively different learners\nare and how the linkages would affect learners in the knowledge acquisition\nprocess. We situate the neuro-induced linkages in the context of\nmultidisciplinary engineering education and propose possible pedagogical\napproaches to actualize the implications of this conceptual framework. Our\nstudy, based on the innovative concept of brain fingerprint, would serve as a\npioneer model to theorize key components of learner-centered multidisciplinary\nengineering pedagogy which centers on the key question: how do we motivate\nengineering students of different backgrounds from a neuro-inspired\nperspective?\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}