{"id":"2407.00859","title":"Statistical inference on partially shape-constrained function-on-scalar\n  linear regression models","authors":"Kyunghee Han, Yeonjoo Park, Soo-Young Kim","authorsParsed":[["Han","Kyunghee",""],["Park","Yeonjoo",""],["Kim","Soo-Young",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 00:03:23 GMT"}],"updateDate":"2024-07-02","timestamp":1719792203000,"abstract":"  We consider functional linear regression models where functional outcomes are\nassociated with scalar predictors by coefficient functions with shape\nconstraints, such as monotonicity and convexity, that apply to sub-domains of\ninterest. To validate the partial shape constraints, we propose testing a\ncomposite hypothesis of linear functional constraints on regression\ncoefficients. Our approach employs kernel- and spline-based methods within a\nunified inferential framework, evaluating the statistical significance of the\nhypothesis by measuring an $L^2$-distance between constrained and unconstrained\nmodel fits. In the theoretical study of large-sample analysis under mild\nconditions, we show that both methods achieve the standard rate of convergence\nobserved in the nonparametric estimation literature. Through numerical\nexperiments of finite-sample analysis, we demonstrate that the type I error\nrate keeps the significance level as specified across various scenarios and\nthat the power increases with sample size, confirming the consistency of the\ntest procedure under both estimation methods. Our theoretical and numerical\nresults provide researchers the flexibility to choose a method based on\ncomputational preference. The practicality of partial shape-constrained\ninference is illustrated by two data applications: one involving clinical\ntrials of NeuroBloc in type A-resistant cervical dystonia and the other with\nthe National Institute of Mental Health Schizophrenia Study.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}