{"id":"2407.01552","title":"High Spectral-Efficiency, Ultra-low MIMO SDM Transmission over a\n  Field-Deployed Multi-Core OAM Fiber","authors":"Junyi Liu, Zengquan Xu, Shuqi Mo, Yuming Huang, Yining Huang, Zhenhua\n  Li, Yuying Guo, Lei Shen, Shuo Xu, Ran Gao, Cheng Du, Qian Feng, Jie Luo, Jie\n  Liu, and Siyuan Yu","authorsParsed":[["Liu","Junyi",""],["Xu","Zengquan",""],["Mo","Shuqi",""],["Huang","Yuming",""],["Huang","Yining",""],["Li","Zhenhua",""],["Guo","Yuying",""],["Shen","Lei",""],["Xu","Shuo",""],["Gao","Ran",""],["Du","Cheng",""],["Feng","Qian",""],["Luo","Jie",""],["Liu","Jie",""],["Yu","Siyuan",""]],"versions":[{"version":"v1","created":"Mon, 29 Apr 2024 09:28:40 GMT"}],"updateDate":"2024-07-03","timestamp":1714382920000,"abstract":"  Few-mode multi-core fiber (FM-MCF) based Space-Division Multiplexing (SDM)\nsystems possess the potential to maximize the number of multiplexed spatial\nchannels per fiber by harnessing both the space (fiber cores) and mode (optical\nmode per core) dimensions. However, to date, no SDM transmissions over\nfield-deployed FM-MCFs in realistic outdoor settings have been reported, which\ncontrasts with SDM schemes demonstrated using single-mode multi-core fibers\n(SM-MCFs) installed in practical fiber cable ducts. In this paper, we present\nthe successful demonstration of bidirectional SDM transmission over a 5-km\nfield-deployed seven ring-core fiber (7-RCF) with a cladding diameter of 178\n${\\mu}$m, achieving a Spectral Efficiency (SE) of 2$\\times$201.6 bit/s/Hz. This\nwork establishes a new record for the highest SE attained in SDM demonstrations\nutilizing field-deployed fiber cables, achieving an approximate 10x increase\ncompared to the SE of reported field-deployed optical fiber cable transmission\nsystems. Notably, these results are realized through the utilization of\nsmall-scale modular 4$\\times$4 multiple-input multiple-output (MIMO) processing\nwith a time-domain equalization (TDE) tap number not exceeding 15, maintaining\na complexity per unit capacity comparable to that of MIMO equalization in SDM\ndemonstrations employing weakly coupled SM-MCF cables. These results underscore\nthe significant potential for achieving heightened SE and expanding capacity\nper individual fiber using SDM techniques in practical applications.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}