{"id":"2407.12214","title":"VideoClusterNet: Self-Supervised and Adaptive Face Clustering For Videos","authors":"Devesh Walawalkar and Pablo Garrido","authorsParsed":[["Walawalkar","Devesh",""],["Garrido","Pablo",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 23:34:55 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 16:18:29 GMT"}],"updateDate":"2024-09-19","timestamp":1721172895000,"abstract":"  With the rise of digital media content production, the need for analyzing\nmovies and TV series episodes to locate the main cast of characters precisely\nis gaining importance.Specifically, Video Face Clustering aims to group\ntogether detected video face tracks with common facial identities. This problem\nis very challenging due to the large range of pose, expression, appearance, and\nlighting variations of a given face across video frames. Generic pre-trained\nFace Identification (ID) models fail to adapt well to the video production\ndomain, given its high dynamic range content and also unique cinematic style.\nFurthermore, traditional clustering algorithms depend on hyperparameters\nrequiring individual tuning across datasets. In this paper, we present a novel\nvideo face clustering approach that learns to adapt a generic face ID model to\nnew video face tracks in a fully self-supervised fashion. We also propose a\nparameter-free clustering algorithm that is capable of automatically adapting\nto the finetuned model's embedding space for any input video. Due to the lack\nof comprehensive movie face clustering benchmarks, we also present a\nfirst-of-kind movie dataset: MovieFaceCluster. Our dataset is handpicked by\nfilm industry professionals and contains extremely challenging face ID\nscenarios. Experiments show our method's effectiveness in handling difficult\nmainstream movie scenes on our benchmark dataset and state-of-the-art\nperformance on traditional TV series datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"5qHsFznPicb8s49rkKxEENCfLISUJaad_oPX_HkwKIo","pdfSize":"30984731"}
