{"id":"2407.14461","title":"Describe Data to get Science-Data-Ready Tooling: Awkward as a Target for\n  Kaitai Struct YAML","authors":"Manasvi Goyal, Andrea Zonca, Amy Roberts, Jim Pivarski, Ianna Osborne","authorsParsed":[["Goyal","Manasvi",""],["Zonca","Andrea",""],["Roberts","Amy",""],["Pivarski","Jim",""],["Osborne","Ianna",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 17:03:37 GMT"}],"updateDate":"2024-07-22","timestamp":1721408617000,"abstract":"  In some fields, scientific data formats differ across experiments due to\nspecialized hardware and data acquisition systems. Researchers need to develop,\ndocument, and maintain experiment-specific analysis software to interact with\nthese data formats. These software are often tightly coupled with a particular\ndata format. This proliferation of custom data formats has been a prominent\nchallenge for small to mid-scale experiments. The widespread adoption of ROOT\nhas largely mitigated this problem for the Large Hadron Collider experiments.\nHowever, many smaller experiments continue to use custom data formats to meet\nspecific research needs. Therefore, simplifying the process of accessing a\nunique data format for analysis holds immense value for scientific communities\nwithin HEP. We have added Awkward Arrays as a target language for Kaitai Struct\nfor this purpose. Researchers can describe their custom data format in the\nKaitai Struct YAML (KSY) language. The Kaitai Struct Compiler generates C++\ncode to fill the LayoutBuilder buffers using the KSY format. In a few steps,\nthe Kaitai Struct Awkward Runtime API can convert the generated C++ code into a\ncompiled Python module. Finally, the raw data can be passed to the module to\nproduce Awkward Arrays. This paper introduces the Awkward Target for the Kaitai\nStruct Compiler and the Kaitai Struct Awkward Runtime API. It also demonstrates\nthe conversion of a given KSY for a specific custom file format to Awkward\nArrays.\n","subjects":["Computing Research Repository/Programming Languages"],"license":"http://creativecommons.org/licenses/by/4.0/"}