{"id":"2407.04033","title":"Exploring control of the emergent exciton insulator state in 1T-TiSe$_2$\n  monolayer by state-of-the-art theory models","authors":"Hong Tang, Li Yin, G\\'abor I. Csonka, and Adrienn Ruzsinszky","authorsParsed":[["Tang","Hong",""],["Yin","Li",""],["Csonka","Gábor I.",""],["Ruzsinszky","Adrienn",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 16:18:08 GMT"}],"updateDate":"2024-07-08","timestamp":1720109888000,"abstract":"  The layered transition metal dichalcogenide 1T-TiSe$_2$ is of great research\ninterest, having intriguing properties of charge density waves (CDW) and\nsuperconductivity under doping or pressurizing. The monolayer form of\n1T-TiSe$_2$ also shows a CDW with a higher transition temperature T_c than the\nbulk, indicating a stronger CDW interaction. By using the meta-generalized\ngradient approximation (metaGGA)-based model Bethe-Salpeter Equation (BSE) and\nmany-body perturbation GW+BSE methods, we calculate the exciton binding\nenergies and electron energy loss spectrum (EELS) for the 1T-TiSe$_2$ monolayer\nunder different in-plane biaxial strains. We find that even without strain the\n1T-TiSe$_2$ monolayer can have negative exciton energies at the Brillouin zone\nboundary point M, with a binding energy larger than the gap. The calculated\nEELS reinforces this picture, indicating EI (exciton insulator) states in\n1T-TiSe$_2$ monolayer even without strain. The Wannier-Mott formula\ncalculations of exciton binding energy corroborate results from GW+BSE. Small\ncompressive strains enhance the EI state, and for tensile strains slightly less\nthan 3%, the EI state in this monolayer persists. At large tensile strains, the\nmaterial makes a transition to a normal semiconductor. Our results provide\nimportant information for understanding the quantum nature of this\ntwo-dimensional (2D) material. Our results from the standard G0W0@PBE+SOC+U+BSE\napproach are not qualitatively different from those of a more computationally\nefficient metaGGA-based SCAN+SOC+U+mBSE+$f_{xc}^{loc}$ approach that employs a\nmodel BSE.\n","subjects":["Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}