{"id":"2407.01325","title":"Ab initio description of monopole resonances in light- and medium-mass\n  nuclei: IV. Angular momentum projection and rotation-vibration coupling","authors":"Andrea Porro, Thomas Duguet, Jean-Paul Ebran, Mikael Frosini, Robert\n  Roth and Vittorio Som\\`a","authorsParsed":[["Porro","Andrea",""],["Duguet","Thomas",""],["Ebran","Jean-Paul",""],["Frosini","Mikael",""],["Roth","Robert",""],["Somà","Vittorio",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 14:30:29 GMT"}],"updateDate":"2024-07-02","timestamp":1719844229000,"abstract":"  Giant Resonances are, with nuclear rotations, the most evident expression of\ncollectivity in finite nuclei. These two categories of excitations, however,\nare traditionally described within different formal schemes, such that\nvibrational and rotational degrees of freedom are separately treated and\ncoupling effects between those are often neglected. The present work puts\nforward an approach aiming at a consitent treatment of vibrations and\nrotations. Specifically, this paper is the last in a series of four dedicated\nto the investigation of the giant monopole resonance in doubly open-shell\nnuclei via the ab initio Projected Generator Coordinate Method (PGCM). The\npresent focus is on the treatment and impact of angular momentum restoration\nwithin such calculations. The PGCM being based on the use of deformed\nmean-field states, the angular-momentum restoration is performed when solving\nthe secular equation to extract vibrational excitations. In this context, it is\nshown that performing the angular momentum restoration only after solving the\nsecular equation contaminates the monopole response with an unphysical coupling\nto the rotational motion, as was also shown recently for (quasi-particle)\nrandom phase approximation calculations based on a deformed reference state.\nEventually, the present work based on the PGCM confirms that an a priori\nangular momentum restoration is necessary to handle consistently both\ncollective motions at the same time. This further pleads in favor of\nimplementing the full-fledged projected (quasi-particle) random phase\napproximation in the future.\n","subjects":["Physics/Nuclear Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}