{"id":"2407.11096","title":"Static and multivariate-temporal attentive fusion transformer for\n  readmission risk prediction","authors":"Zhe Sun, Runzhi Li, Jing Wang, Gang Chen, Siyu Yan and Lihong Ma","authorsParsed":[["Sun","Zhe",""],["Li","Runzhi",""],["Wang","Jing",""],["Chen","Gang",""],["Yan","Siyu",""],["Ma","Lihong",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 03:42:44 GMT"}],"updateDate":"2024-07-17","timestamp":1721014964000,"abstract":"  Background: Accurate short-term readmission prediction of ICU patients is\nsignificant in improving the efficiency of resource assignment by assisting\nphysicians in making discharge decisions. Clinically, both individual static\nstatic and multivariate temporal data collected from ICU monitors play critical\nroles in short-term readmission prediction. Informative static and multivariate\ntemporal feature representation capturing and fusion present challenges for\naccurate readmission prediction. Methods:We propose a novel static and\nmultivariate-temporal attentive fusion transformer (SMTAFormer) to predict\nshort-term readmission of ICU patients by fully leveraging the potential of\ndemographic and dynamic temporal data. In SMTAFormer, we first apply an MLP\nnetwork and a temporal transformer network to learn useful static and temporal\nfeature representations, respectively. Then, the well-designed static and\nmultivariate temporal feature fusion module is applied to fuse static and\ntemporal feature representations by modeling intra-correlation among\nmultivariate temporal features and constructing inter-correlation between\nstatic and multivariate temporal features. Results: We construct a readmission\nrisk assessment (RRA) dataset based on the MIMIC-III dataset. The extensive\nexperiments show that SMTAFormer outperforms advanced methods, in which the\naccuracy of our proposed method is up to 86.6%, and the area under the receiver\noperating characteristic curve (AUC) is up to 0.717. Conclusion: Our proposed\nSMTAFormer can efficiently capture and fuse static and multivariate temporal\nfeature representations. The results show that SMTAFormer significantly\nimproves the short-term readmission prediction performance of ICU patients\nthrough comparisons to strong baselines.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}