{"id":"2407.10678","title":"Confining strings in three-dimensional gauge theories beyond the\n  Nambu--Got\\=o approximation","authors":"Michele Caselle, Nicodemo Magnoli, Alessandro Nada, Marco Panero,\n  Dario Panfalone and Lorenzo Verzichelli","authorsParsed":[["Caselle","Michele",""],["Magnoli","Nicodemo",""],["Nada","Alessandro",""],["Panero","Marco",""],["Panfalone","Dario",""],["Verzichelli","Lorenzo",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 12:51:08 GMT"}],"updateDate":"2024-09-04","timestamp":1721047868000,"abstract":"  We carry out a systematic study of the effective bosonic string describing\nconfining flux tubes in $\\mathrm{SU}(N)$ Yang--Mills theories in three\nspacetime dimensions. While their low-energy properties are known to be\nuniversal and are described well by the Nambu--Got\\=o action, a non-trivial\ndependence on the gauge group is encoded in a series of undetermined subleading\ncorrections in an expansion around the limit of an arbitrarily long string. We\nquantify the first two of these corrections by means of high-precision Monte\nCarlo simulations of Polyakov-loop correlators in the lattice regularization.\nWe compare the results of novel lattice simulations for theories with $N=3$ and\n$6$ color charges, and report an improved estimate for the $N=2$ case,\ndiscussing the approach to the large-$N$ limit. Our results are compatible with\nanalytical bounds derived from the S-matrix bootstrap approach. In addition, we\nalso present a new test of the Svetitsky--Yaffe conjecture for the\n$\\mathrm{SU}(3)$ theory in three dimensions, finding that the lattice results\nfor the Polyakov-loop correlation function are in excellent agreement with the\npredictions of the Svetitsky--Yaffe mapping, which are worked out\nquantitatively applying conformal perturbation theory to the three-state Potts\nmodel in two dimensions. The implications of these results are discussed.\n","subjects":["Physics/High Energy Physics - Lattice","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}