{"id":"2407.17302","title":"The integration of the SOXS control electronics towards the PAE","authors":"Mirko Colapietro and Sergio D'Orsi and Giulio Capasso and Salvatore\n  Savarese and Pietro Schipani and Laurent Marty and Ricardo Zanmar Sanchez and\n  Matteo Aliverti and Federico Battaini and Simone Di Filippo and Kalyan Kumar\n  Radhakrishnan Santhakumari and Davide Ricci and Bernardo Salasnich and Sergio\n  Campana and Riccardo Claudi and Jose Araiza-Duran and Andrea Baruffolo and\n  Sagi Ben Ami and Alex Bichkovsky and Anna Brucalassi and Rosario Cosentino\n  and Francesco D'Alessio and Paolo D'Avanzo and Rosario Di Benedetto and\n  Matteo Genoni and Ofir Hershko and Hanindyo Kuncarayakti and Luigi Lessio and\n  Eugenio Martinetti and Antonio Micciche and Gaetano Nicotra and Giuliano\n  Pignata and Adam Rubin and Salvatore Scuderi and Fabrizio Vitali and Jani\n  Achren and Iair Arcavi and Laura Asquini and Rachel Bruch and Enrico\n  Cappellaro and Massimo Della Valle and Avishay Gal-Yam and Marcos Hernandez\n  Diaz and Jari Kotilainen and Marco Landoni and Gianluca Li Causi and Seppo\n  Mattila and Matteo Munari and Hector Perez Ventura and Michael Rappaport and\n  Marco Riva and Steven Smartt and Maximilian Stritzinger and David Young","authorsParsed":[["Colapietro","Mirko",""],["D'Orsi","Sergio",""],["Capasso","Giulio",""],["Savarese","Salvatore",""],["Schipani","Pietro",""],["Marty","Laurent",""],["Sanchez","Ricardo Zanmar",""],["Aliverti","Matteo",""],["Battaini","Federico",""],["Di Filippo","Simone",""],["Santhakumari","Kalyan Kumar Radhakrishnan",""],["Ricci","Davide",""],["Salasnich","Bernardo",""],["Campana","Sergio",""],["Claudi","Riccardo",""],["Araiza-Duran","Jose",""],["Baruffolo","Andrea",""],["Ami","Sagi Ben",""],["Bichkovsky","Alex",""],["Brucalassi","Anna",""],["Cosentino","Rosario",""],["D'Alessio","Francesco",""],["D'Avanzo","Paolo",""],["Di Benedetto","Rosario",""],["Genoni","Matteo",""],["Hershko","Ofir",""],["Kuncarayakti","Hanindyo",""],["Lessio","Luigi",""],["Martinetti","Eugenio",""],["Micciche","Antonio",""],["Nicotra","Gaetano",""],["Pignata","Giuliano",""],["Rubin","Adam",""],["Scuderi","Salvatore",""],["Vitali","Fabrizio",""],["Achren","Jani",""],["Arcavi","Iair",""],["Asquini","Laura",""],["Bruch","Rachel",""],["Cappellaro","Enrico",""],["Della Valle","Massimo",""],["Gal-Yam","Avishay",""],["Diaz","Marcos Hernandez",""],["Kotilainen","Jari",""],["Landoni","Marco",""],["Causi","Gianluca Li",""],["Mattila","Seppo",""],["Munari","Matteo",""],["Ventura","Hector Perez",""],["Rappaport","Michael",""],["Riva","Marco",""],["Smartt","Steven",""],["Stritzinger","Maximilian",""],["Young","David",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 14:16:12 GMT"}],"updateDate":"2024-07-25","timestamp":1721830572000,"abstract":"  SOXS (Son Of X-Shooter) is the new single object spectrograph for the ESO New\nTechnology Telescope (NTT) at the La Silla Observatory, able to cover\nsimultaneously both the UV-VIS and NIR bands (350-2000 nm). The instrument is\ncurrently in the integration and test phase, approaching the Preliminary\nAcceptance in Europe (PAE) before shipment to Chile for commissioning. After\nthe assembly and preliminary test of the control electronics at INAF -\nAstronomical Observatory of Capodimonte (Napoli), the two main control cabinets\nof SOXS are now hosted in Padova, connected to the real hardware. This\ncontribution describes the final electronic cabinets layout, the control\nstrategy and the different integration phases, waiting for the Preliminary\nAcceptance in Europe and the installation of the instrument in Chile.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}