{"id":"2407.11566","title":"TGIF: Text-Guided Inpainting Forgery Dataset","authors":"Hannes Mareen, Dimitrios Karageorgiou, Glenn Van Wallendael, Peter\n  Lambert, Symeon Papadopoulos","authorsParsed":[["Mareen","Hannes",""],["Karageorgiou","Dimitrios",""],["Van Wallendael","Glenn",""],["Lambert","Peter",""],["Papadopoulos","Symeon",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 10:19:14 GMT"}],"updateDate":"2024-07-17","timestamp":1721125154000,"abstract":"  Digital image manipulation has become increasingly accessible and realistic\nwith the advent of generative AI technologies. Recent developments allow for\ntext-guided inpainting, making sophisticated image edits possible with minimal\neffort. This poses new challenges for digital media forensics. For example,\ndiffusion model-based approaches could either splice the inpainted region into\nthe original image, or regenerate the entire image. In the latter case,\ntraditional image forgery localization (IFL) methods typically fail. This paper\nintroduces the Text-Guided Inpainting Forgery (TGIF) dataset, a comprehensive\ncollection of images designed to support the training and evaluation of image\nforgery localization and synthetic image detection (SID) methods. The TGIF\ndataset includes approximately 80k forged images, originating from popular\nopen-source and commercial methods; SD2, SDXL, and Adobe Firefly. Using this\ndata, we benchmark several state-of-the-art IFL and SID methods. Whereas\ntraditional IFL methods can detect spliced images, they fail to detect\nregenerated inpainted images. Moreover, traditional SID may detect the\nregenerated inpainted images to be fake, but cannot localize the inpainted\narea. Finally, both types of methods fail when exposed to stronger compression,\nwhile they are less robust to modern compression algorithms, such as WEBP. As\nsuch, this work demonstrates the inefficiency of state-of-the-art detectors on\nlocal manipulations performed by modern generative approaches, and aspires to\nhelp with the development of more capable IFL and SID methods. The dataset can\nbe downloaded at https://github.com/IDLabMedia/tgif-dataset.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Cryptography and Security","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}