{"id":"2407.19738","title":"Magnetic Penrose Process and Kerr Black Hole Mimickers","authors":"Divyesh P. Viththani (1), Tapobroto Bhanja (1), Vishva Patel (1) and\n  Pankaj S. Joshi (2) ((1) PDPIAS, Charusat University, Anand, Guj, India, (2)\n  International Centre for Space and Cosmology, Ahmedabad University,\n  Ahmedabad, GUJ, India)","authorsParsed":[["Viththani","Divyesh P.",""],["Bhanja","Tapobroto",""],["Patel","Vishva",""],["Joshi","Pankaj S.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 07:02:37 GMT"}],"updateDate":"2024-07-30","timestamp":1722236557000,"abstract":"  The present study investigates the negative energy orbits and energy\nextraction efficiency using the magnetic Penrose process in various regular\nblack hole geometries surrounded by electromagnetic fields. Utilizing numerical\nsimulations, we analyze the efficiency of this process in Kerr and\nSimpson-Visser geometries, focusing on extremal black holes. Interestingly, our\nstudy demonstrates that the energy extraction efficiency remains\nindistinguishable between Kerr and Simpson-Visser geometries, regardless of the\nregularization parameter ($l$); this trend is consistent with previous studies\nof the Penrose process and superradiance. Additionally, we present results for\nthe rotating Hayward black hole, showing that efficiency is influenced by spin\nand deviation parameters ($g$), as well as the induced magnetic field and\ncharge of the compact object. Notably, we observe that energy extraction\nefficiency is highest in the rotating Hayward black hole compared to Kerr and\nSimpson-Visser geometries, particularly in scenarios where the magnetic field\nand charge are minimal. Our study highlights the significant role of spin,\ncharge and magnetic field characteristics in maximizing energy extraction\nefficiency, particularly in the rotating Hayward black hole context.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/"}