{"id":"2407.16260","title":"DreamDissector: Learning Disentangled Text-to-3D Generation from 2D\n  Diffusion Priors","authors":"Zizheng Yan, Jiapeng Zhou, Fanpeng Meng, Yushuang Wu, Lingteng Qiu,\n  Zisheng Ye, Shuguang Cui, Guanying Chen, Xiaoguang Han","authorsParsed":[["Yan","Zizheng",""],["Zhou","Jiapeng",""],["Meng","Fanpeng",""],["Wu","Yushuang",""],["Qiu","Lingteng",""],["Ye","Zisheng",""],["Cui","Shuguang",""],["Chen","Guanying",""],["Han","Xiaoguang",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 07:59:57 GMT"}],"updateDate":"2024-07-24","timestamp":1721721597000,"abstract":"  Text-to-3D generation has recently seen significant progress. To enhance its\npracticality in real-world applications, it is crucial to generate multiple\nindependent objects with interactions, similar to layer-compositing in 2D image\nediting. However, existing text-to-3D methods struggle with this task, as they\nare designed to generate either non-independent objects or independent objects\nlacking spatially plausible interactions. Addressing this, we propose\nDreamDissector, a text-to-3D method capable of generating multiple independent\nobjects with interactions. DreamDissector accepts a multi-object text-to-3D\nNeRF as input and produces independent textured meshes. To achieve this, we\nintroduce the Neural Category Field (NeCF) for disentangling the input NeRF.\nAdditionally, we present the Category Score Distillation Sampling (CSDS),\nfacilitated by a Deep Concept Mining (DCM) module, to tackle the concept gap\nissue in diffusion models. By leveraging NeCF and CSDS, we can effectively\nderive sub-NeRFs from the original scene. Further refinement enhances geometry\nand texture. Our experimental results validate the effectiveness of\nDreamDissector, providing users with novel means to control 3D synthesis at the\nobject level and potentially opening avenues for various creative applications\nin the future.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}