{"id":"2407.09838","title":"Background Adaptation with Residual Modeling for Exemplar-Free\n  Class-Incremental Semantic Segmentation","authors":"Anqi Zhang, Guangyu Gao","authorsParsed":[["Zhang","Anqi",""],["Gao","Guangyu",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 10:24:28 GMT"}],"updateDate":"2024-07-16","timestamp":1720866268000,"abstract":"  Class Incremental Semantic Segmentation~(CISS), within Incremental Learning\nfor semantic segmentation, targets segmenting new categories while reducing the\ncatastrophic forgetting on the old categories.Besides, background shifting,\nwhere the background category changes constantly in each step, is a special\nchallenge for CISS. Current methods with a shared background classifier\nstruggle to keep up with these changes, leading to decreased stability in\nbackground predictions and reduced accuracy of segmentation. For this special\nchallenge, we designed a novel background adaptation mechanism, which\nexplicitly models the background residual rather than the background itself in\neach step, and aggregates these residuals to represent the evolving background.\nTherefore, the background adaptation mechanism ensures the stability of\nprevious background classifiers, while enabling the model to concentrate on the\neasy-learned residuals from the additional channel, which enhances background\ndiscernment for better prediction of novel categories. To precisely optimize\nthe background adaptation mechanism, we propose Pseudo Background Binary\nCross-Entropy loss and Background Adaptation losses, which amplify the\nadaptation effect. Group Knowledge Distillation and Background Feature\nDistillation strategies are designed to prevent forgetting old categories. Our\napproach, evaluated across various incremental scenarios on Pascal VOC 2012 and\nADE20K datasets, outperforms prior exemplar-free state-of-the-art methods with\nmIoU of 3.0% in VOC 10-1 and 2.0% in ADE 100-5, notably enhancing the accuracy\nof new classes while mitigating catastrophic forgetting. Code is available in\nhttps://andyzaq.github.io/barmsite/.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}