{"id":"2407.19710","title":"Why could a new-born active region produce coronal mass ejections?","authors":"Hanzhao Yang and Lijuan Liu","authorsParsed":[["Yang","Hanzhao",""],["Liu","Lijuan",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 05:22:51 GMT"}],"updateDate":"2024-07-30","timestamp":1722230571000,"abstract":"  Solar active regions (ARs) are the main sources of flares and coronal mass\nejections (CMEs). NOAA AR 12089, which emerged on 2014 June 10, produced two\nC-class flares accompanied by CMEs within five hours after its emergence. When\nproducing the two eruptive flares, the total unsigned magnetic flux\n($\\Phi_{\\text{AR}}$) and magnetic free energy ($E_f$) of the AR are much\nsmaller than the common CME-producing ARs. Why can this extremely small AR\nproduce eruptive flares so early? We compare the AR magnetic environment for\nthe eruptive flares to that for the largest confined flare from the AR. Besides\nthe $\\Phi_{\\text{AR}}$ and $E_f$, we calculate the ratio between the mean\ncharacteristic twist parameter ($\\alpha_{\\text{FPIL}}$) within the flaring\npolarity inversion line (FPIL) region and $\\Phi_{\\text{AR}}$, a parameter\nconsidering both background magnetic field constraint and non-potentiality of\nthe core region, for the three flares. We find higher\n$\\alpha_{\\text{FPIL}}/{\\Phi_{\\text{AR}}}$ values during the eruptive flares\nthan during the confined flare. Furthermore, we compute the decay index along\nthe polarity inversion line, revealing values of 1.69, 3.45, and 0.98 before\nthe two eruptive and the confined flares, respectively. Finally, nonlinear\nforce-free field extrapolation indicates that a flux rope was repeatedly formed\nalong the FPIL before eruptive flares, which ejected out and produced CMEs. No\nflux rope was found before the confined flare. Our research suggests that even\na newly emerged, extremely small AR can produce eruptive flares if it has\nsufficiently weak background field constraint and strong non-potentiality in\nthe core region.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}