{"id":"2407.10091","title":"Enhancing Emotion Prediction in News Headlines: Insights from ChatGPT\n  and Seq2Seq Models for Free-Text Generation","authors":"Ge Gao, Jongin Kim, Sejin Paik, Ekaterina Novozhilova, Yi Liu, Sarah\n  T. Bonna, Margrit Betke, and Derry Tanti Wijaya","authorsParsed":[["Gao","Ge",""],["Kim","Jongin",""],["Paik","Sejin",""],["Novozhilova","Ekaterina",""],["Liu","Yi",""],["Bonna","Sarah T.",""],["Betke","Margrit",""],["Wijaya","Derry Tanti",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 06:04:11 GMT"}],"updateDate":"2024-07-16","timestamp":1720937051000,"abstract":"  Predicting emotions elicited by news headlines can be challenging as the task\nis largely influenced by the varying nature of people's interpretations and\nbackgrounds. Previous works have explored classifying discrete emotions\ndirectly from news headlines. We provide a different approach to tackling this\nproblem by utilizing people's explanations of their emotion, written in\nfree-text, on how they feel after reading a news headline. Using the dataset\nBU-NEmo+ (Gao et al., 2022), we found that for emotion classification, the\nfree-text explanations have a strong correlation with the dominant emotion\nelicited by the headlines. The free-text explanations also contain more\nsentimental context than the news headlines alone and can serve as a better\ninput to emotion classification models. Therefore, in this work we explored\ngenerating emotion explanations from headlines by training a\nsequence-to-sequence transformer model and by using pretrained large language\nmodel, ChatGPT (GPT-4). We then used the generated emotion explanations for\nemotion classification. In addition, we also experimented with training the\npretrained T5 model for the intermediate task of explanation generation before\nfine-tuning it for emotion classification. Using McNemar's significance test,\nmethods that incorporate GPT-generated free-text emotion explanations\ndemonstrated significant improvement (P-value < 0.05) in emotion classification\nfrom headlines, compared to methods that only use headlines. This underscores\nthe value of using intermediate free-text explanations for emotion prediction\ntasks with headlines.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}