{"id":"2407.15064","title":"Turbulent convection in rotating slender cells","authors":"Ambrish Pandey and Katepalli R. Sreenivasan","authorsParsed":[["Pandey","Ambrish",""],["Sreenivasan","Katepalli R.",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 05:42:52 GMT"}],"updateDate":"2024-07-23","timestamp":1721540572000,"abstract":"  Turbulent convection in the interiors of the Sun and the Earth occurs at high\nRayleigh numbers $Ra$, low Prandtl numbers $Pr$, and different levels of\nrotation rates. To understand the combined effects better, we study rotating\nturbulent convection for $Pr = 0.021$ (for which some laboratory data\ncorresponding to liquid metals are available), and varying Rossby numbers $Ro$,\nusing direct numerical simulations (DNS) in a slender cylinder of aspect ratio\n0.1; this confinement allows us to attain high enough Rayleigh numbers. We are\nmotivated by the earlier finding in the absence of rotation that heat transport\nat high enough $Ra$ is similar between confined and extended domains. We make\ncomparisons with higher aspect ratio data where possible. We study the effects\nof rotation on the global transport of heat and momentum as well as flow\nstructures (a) for increasing rotation at a few fixed values of $Ra$ and (b)\nfor increasing $Ra$ (up to $10^{10}$) at the fixed, low Ekman number of $1.45\n\\times 10^{-6}$. We compare the results with those from unity $Pr$ simulations\nfor the same range of $Ra$ and $Ro$, and with the non-rotating case over the\nsame range of $Ra$ and low $Pr$. We find that the effects of rotation diminish\nwith increasing $Ra$. These results and comparison studies suggest that, for\nhigh enough $Ra$, rotation alters convective flows in a similar manner for\nsmall and large aspect ratios, and so useful insights on the effects of high\nthermal forcing on convection can be obtained by considering slender domains.\n","subjects":["Physics/Fluid Dynamics","Physics/Atmospheric and Oceanic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}