{"id":"2407.05869","title":"PORCA: Root Cause Analysis with Partially Observed Data","authors":"Chang Gong, Di Yao, Jin Wang, Wenbin Li, Lanting Fang, Yongtao Xie,\n  Kaiyu Feng, Peng Han, Jingping Bi","authorsParsed":[["Gong","Chang",""],["Yao","Di",""],["Wang","Jin",""],["Li","Wenbin",""],["Fang","Lanting",""],["Xie","Yongtao",""],["Feng","Kaiyu",""],["Han","Peng",""],["Bi","Jingping",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 12:31:12 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 01:28:49 GMT"}],"updateDate":"2024-07-15","timestamp":1720441872000,"abstract":"  Root Cause Analysis (RCA) aims at identifying the underlying causes of system\nfaults by uncovering and analyzing the causal structure from complex systems.\nIt has been widely used in many application domains. Reliable diagnostic\nconclusions are of great importance in mitigating system failures and financial\nlosses. However, previous studies implicitly assume a full observation of the\nsystem, which neglect the effect of partial observation (i.e., missing nodes\nand latent malfunction). As a result, they fail in deriving reliable RCA\nresults. In this paper, we unveil the issues of unobserved confounders and\nheterogeneity in partial observation and come up with a new problem of root\ncause analysis with partially observed data. To achieve this, we propose PORCA,\na novel RCA framework which can explore reliable root causes under both\nunobserved confounders and unobserved heterogeneity. PORCA leverages magnified\nscore-based causal discovery to efficiently optimize acyclic directed mixed\ngraph under unobserved confounders. In addition, we also develop a\nheterogeneity-aware scheduling strategy to provide adaptive sample weights.\nExtensive experimental results on one synthetic and two real-world datasets\ndemonstrate the effectiveness and superiority of the proposed framework.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}