{"id":"2407.11952","title":"Young Black Holes Have Smooth Horizons: A Swampland Argument","authors":"Chethan Krishnan, Ranjini Mondol","authorsParsed":[["Krishnan","Chethan",""],["Mondol","Ranjini",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 17:46:03 GMT"}],"updateDate":"2024-07-17","timestamp":1721151963000,"abstract":"  It has been suggested that black hole microstates in string theory may have\n\"no interiors\". The arguments of arXiv:2312.14108 suggest that even if this\nwere the case, conventional bulk EFT should be valid at the horizon for black\nholes that are not too old. Here, we explore the validity of bulk EFT for young\nblack holes from a different perspective, by considering the gravitational\ncollapse of scalar moduli. This builds on arXiv:2003.05488, which studied the\nnumerical collapse of a scalar field in a Choptuik-like set up. Evidence was\npresented there for two observations -- (a) For every scalar profile that\nresults in collapse, the scalar field undergoes trans-Planckian variation, (b)\nEvery trans-Planckian scalar motion is hidden behind an apparent horizon. The\nresults of arXiv:2003.05488 were mostly obtained in regimes close to critical\ncollapse, where scale-separation was difficult to achieve. In this paper, we\nstudy the same system in super-critical regimes. This allows us to study the\nlocalization properties of scalar variations inside the apparent horizon by\nseparating the horizon and singularity scales. We find strong evidence that the\n$\\mathcal{O}(1)$ scalar variation is localized around the curvature divergence,\nand is hierarchically well-separated from the apparent horizon. Because\n$\\mathcal{O}(1)$ scalar movement is associated to the breakdown of bulk EFT\naccording to the swampland distance conjecture, this is an indication that bulk\nEFT is well-behaved in the interiors of young black holes. Our results suggest\nthe perspective that cosmic censorship is a mechanism for preserving bulk EFT\nbetween the horizon and the singularity.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}