{"id":"2407.02916","title":"How does a low surface brightness galaxy form spiral arms?","authors":"Ganesh Narayanan, Anagha A. G. and Arunima Banerjee","authorsParsed":[["Narayanan","Ganesh",""],["G.","Anagha A.",""],["Banerjee","Arunima",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 08:45:50 GMT"}],"updateDate":"2024-07-04","timestamp":1719996350000,"abstract":"  The formation and evolution of spiral arms in low surface brightness galaxies\n(LSBs) are not well-understood. We study the dynamics of spiral arms in two\nprototypical LSBs, F568-VI and F568-01, using both analytical models and N-body\n+ hydrodynamical simulations. We first consider the disk as a 2-component\nsystem of gravitationally-coupled stars and gas in the force field of a\n\\emph{spherical} dark matter halo, subjected to local, non-axisymmetric\nperturbations. However, no local spirals are formed. We next assume the disk to\nbe a 1-component system of stars in the net gravitational potential of a galaxy\nwith a \\emph{spherical} dark matter halo perturbed by a global $m=2$\ninstability. In this case, the growth time for spiral formation was low, equal\nto 0.78 and 0.96 Gyrs, respectively, corresponding to a few dynamical times of\nthe galaxies. Finally, we simulate the LSBs using the N-body + hydrodynamical\nsimulation code RAMSES. \\emph{Our results show that a quadrupolar field\nassociated with an oblate halo with an axial ratio of 0.7} is necessary to\ndrive a long-lived global spiral in the LSB disks. Further, feedback\ncorresponding to a supernova mass fraction of $\\sim$ 0.05 is essential to\ncomply with the observed stellar surface density. The simulated spirals\nsurvives for about ten dynamical times and the average pattern speed lies\nbetween 10 - 15 $\\rm{kms^{-1}{kpc}^{-1}}$. The spiral arm thus formed is\ntherefore a transient global pattern driven by the tidal field of the oblate\ndark matter halo.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}