{"id":"2407.14458","title":"AudioInsight: Detecting Social Contexts Relevant to Social Anxiety from\n  Speech","authors":"Varun Reddy, Zhiyuan Wang, Emma Toner, Max Larrazabal, Mehdi\n  Boukhechba, Bethany A. Teachman and Laura E. Barnes","authorsParsed":[["Reddy","Varun",""],["Wang","Zhiyuan",""],["Toner","Emma",""],["Larrazabal","Max",""],["Boukhechba","Mehdi",""],["Teachman","Bethany A.",""],["Barnes","Laura E.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 17:01:12 GMT"}],"updateDate":"2024-07-22","timestamp":1721408472000,"abstract":"  During social interactions, understanding the intricacies of the context can\nbe vital, particularly for socially anxious individuals. While previous\nresearch has found that the presence of a social interaction can be detected\nfrom ambient audio, the nuances within social contexts, which influence how\nanxiety provoking interactions are, remain largely unexplored. As an\nalternative to traditional, burdensome methods like self-report, this study\npresents a novel approach that harnesses ambient audio segments to detect\nsocial threat contexts. We focus on two key dimensions: number of interaction\npartners (dyadic vs. group) and degree of evaluative threat (explicitly\nevaluative vs. not explicitly evaluative). Building on data from a Zoom-based\nsocial interaction study (N=52 college students, of whom the majority N=45 are\nsocially anxious), we employ deep learning methods to achieve strong detection\nperformance. Under sample-wide 5-fold Cross Validation (CV), our model\ndistinguished dyadic from group interactions with 90\\% accuracy and detected\nevaluative threat at 83\\%. Using a leave-one-group-out CV, accuracies were 82\\%\nand 77\\%, respectively. While our data are based on virtual interactions due to\npandemic constraints, our method has the potential to extend to diverse\nreal-world settings. This research underscores the potential of passive sensing\nand AI to differentiate intricate social contexts, and may ultimately advance\nthe ability of context-aware digital interventions to offer personalized mental\nhealth support.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Q2-MjokYqM9BvxYXlQBKZSHPxnEbPGOPTzlpdLokMB4","pdfSize":"750046"}
