{"id":"2407.04108","title":"Future Events as Backdoor Triggers: Investigating Temporal\n  Vulnerabilities in LLMs","authors":"Sara Price, Arjun Panickssery, Sam Bowman, Asa Cooper Stickland","authorsParsed":[["Price","Sara",""],["Panickssery","Arjun",""],["Bowman","Sam",""],["Stickland","Asa Cooper",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 18:24:09 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 18:45:46 GMT"}],"updateDate":"2024-07-19","timestamp":1720117449000,"abstract":"  Backdoors are hidden behaviors that are only triggered once an AI system has\nbeen deployed. Bad actors looking to create successful backdoors must design\nthem to avoid activation during training and evaluation. Since data used in\nthese stages often only contains information about events that have already\noccurred, a component of a simple backdoor trigger could be a model recognizing\ndata that is in the future relative to when it was trained. Through prompting\nexperiments and by probing internal activations, we show that current large\nlanguage models (LLMs) can distinguish past from future events, with probes on\nmodel activations achieving 90% accuracy. We train models with backdoors\ntriggered by a temporal distributional shift; they activate when the model is\nexposed to news headlines beyond their training cut-off dates. Fine-tuning on\nhelpful, harmless and honest (HHH) data does not work well for removing simpler\nbackdoor triggers but is effective on our backdoored models, although this\ndistinction is smaller for the larger-scale model we tested. We also find that\nan activation-steering vector representing a model's internal representation of\nthe date influences the rate of backdoor activation. We take these results as\ninitial evidence that, at least for models at the modest scale we test,\nstandard safety measures are enough to remove these backdoors.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}