{"id":"2407.05487","title":"Multi-level Reliability Interface for Semantic Communications over\n  Wireless Networks","authors":"Tze-Yang Tung, Homa Esfahanizadeh, Jinfeng Du, Harish Viswanathan","authorsParsed":[["Tung","Tze-Yang",""],["Esfahanizadeh","Homa",""],["Du","Jinfeng",""],["Viswanathan","Harish",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 20:15:10 GMT"}],"updateDate":"2024-07-09","timestamp":1720383310000,"abstract":"  Semantic communication, when examined through the lens of joint\nsource-channel coding (JSCC), maps source messages directly into channel input\nsymbols, where the measure of success is defined by end-to-end distortion\nrather than traditional metrics such as block error rate. Previous studies have\nshown significant improvements achieved through deep learning (DL)-driven JSCC\ncompared to traditional separate source and channel coding. However, JSCC is\nimpractical in existing communication networks, where application and network\nproviders are typically different entities connected over general-purpose\nTCP/IP links. In this paper, we propose designing the source and channel\nmappings separately and sequentially via a novel multi-level reliability\ninterface. This conceptual interface enables semi-JSCC at both the learned\nsource and channel mappers and achieves many of the gains observed in existing\nDL-based JSCC work (which would require a fully joint design between the\napplication and the network), such as lower end-to-end distortion and graceful\ndegradation of distortion with channel quality. We believe this work represents\nan important step towards realizing semantic communications in wireless\nnetworks.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}