{"id":"2407.13771","title":"Training-Free Model Merging for Multi-target Domain Adaptation","authors":"Wenyi Li, Huan-ang Gao, Mingju Gao, Beiwen Tian, Rong Zhi, Hao Zhao","authorsParsed":[["Li","Wenyi",""],["Gao","Huan-ang",""],["Gao","Mingju",""],["Tian","Beiwen",""],["Zhi","Rong",""],["Zhao","Hao",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:59:57 GMT"}],"updateDate":"2024-07-19","timestamp":1721325597000,"abstract":"  In this paper, we study multi-target domain adaptation of scene understanding\nmodels. While previous methods achieved commendable results through\ninter-domain consistency losses, they often assumed unrealistic simultaneous\naccess to images from all target domains, overlooking constraints such as data\ntransfer bandwidth limitations and data privacy concerns. Given these\nchallenges, we pose the question: How to merge models adapted independently on\ndistinct domains while bypassing the need for direct access to training data?\nOur solution to this problem involves two components, merging model parameters\nand merging model buffers (i.e., normalization layer statistics). For merging\nmodel parameters, empirical analyses of mode connectivity surprisingly reveal\nthat linear merging suffices when employing the same pretrained backbone\nweights for adapting separate models. For merging model buffers, we model the\nreal-world distribution with a Gaussian prior and estimate new statistics from\nthe buffers of separately trained models. Our method is simple yet effective,\nachieving comparable performance with data combination training baselines,\nwhile eliminating the need for accessing training data. Project page:\nhttps://air-discover.github.io/ModelMerging\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ewYh0KRdvNZIsQLe7OiY5LVEgXvas_qYAX5c2KNJbyM","pdfSize":"2089868","objectId":"0x1ec45dcceca7639149efe82aa55921075a4304c05ea885d455a532059b960a4d","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
