{"id":"2407.13775","title":"Lessons in Cooperation: A Qualitative Analysis of Driver Sentiments\n  towards Real-Time Advisory Systems from a Driving Simulator User Study","authors":"Aamir Hasan, Neeloy Chakraborty, Haonan Chen, Cathy Wu, Katherine\n  Driggs-Campbell","authorsParsed":[["Hasan","Aamir",""],["Chakraborty","Neeloy",""],["Chen","Haonan",""],["Wu","Cathy",""],["Driggs-Campbell","Katherine",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 23:21:42 GMT"}],"updateDate":"2024-07-22","timestamp":1719703302000,"abstract":"  Real-time Advisory (RTA) systems, such as navigational and eco-driving\nassistants, are becoming increasingly ubiquitous in vehicles due to their\nbenefits for users and society. Until autonomous vehicles mature, such advisory\nsystems will continue to expand their ability to cooperate with drivers,\nenabling safer and more eco-friendly driving practices while improving user\nexperience. However, the interactions between these systems and drivers have\nnot been studied extensively. To this end, we conduct a driving simulator study\n(N=16) to capture driver reactions to a Cooperative RTA system. Through a case\nstudy with a congestion mitigation assistant, we qualitatively analyze the\nsentiments of drivers towards advisory systems and discuss driver preferences\nfor various aspects of the interaction. We comment on how the advice should be\ncommunicated, the effects of the advice on driver trust, and how drivers adapt\nto the system. We present recommendations to inform the future design of\nCooperative RTA systems.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nmldjuNLiSo7x-zdIIWG-CVHcPuXLGf7PVO50sirfYE","pdfSize":"46014497","objectId":"0x1af200c185ca0e332f3b0e710020181e9bced1bd7dc374ca8af126c0f613cb55","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
