{"id":"2407.07420","title":"Question-Score Identity Detection (Q-SID): A Statistical Algorithm to\n  Detect Collusion Groups with Error Quantification from Exam Question Scores","authors":"Guanao Yan, Jingyi Jessica Li, Mark D. Biggin","authorsParsed":[["Yan","Guanao",""],["Li","Jingyi Jessica",""],["Biggin","Mark D.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 07:21:44 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 05:44:02 GMT"}],"updateDate":"2024-07-15","timestamp":1720596104000,"abstract":"  Collusion between students in online exams is a major problem that undermines\nthe integrity of the exam results. Although there exist methods that use exam\ndata to identify pairs of students who have likely copied each other's answers,\nthese methods are restricted to specific formats of multiple-choice exams. Here\nwe present a statistical algorithm, Q-SID, that efficiently detects groups of\nstudents who likely have colluded, i.e., collusion groups, with error\nquantification. Q-SID uses graded numeric question scores only, so it works for\nmany formats of multiple-choice and non-multiple-choice exams. Q-SID reports\ntwo false-positive rates (FPRs) for each collusion group: (1) empirical FPR,\nwhose null data are from 36 strictly proctored exam datasets independent of the\nuser-input exam data and (2) synthetic FPR, whose null data are simulated from\na copula-based probabilistic model, which is first fitted to the user-input\nexam data and then modified to have no collusion. On 34 unproctored exam\ndatasets, including two benchmark datasets with true positives and negatives\nverified by textural analysis, we demonstrate that Q-SID is a collusion\ndetection algorithm with powerful and robust performance across exam formats,\nnumbers of questions and students, and exam complexity.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"_jlZTyQ5FdVtE146Zug2g4eHp6O7IvmzOc9TgSh-thY","pdfSize":"4684899","objectId":"0x76434cc3a15386bb97b1f4f4b26897e52cd318ab91f28e375376dca5d7633ddf","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
