{"id":"2407.11625","title":"Beware of Validation by Eye: Visual Validation of Linear Trends in\n  Scatterplots","authors":"Daniel Braun, Remco Chang, Michael Gleicher, Tatiana von Landesberger","authorsParsed":[["Braun","Daniel",""],["Chang","Remco",""],["Gleicher","Michael",""],["von Landesberger","Tatiana",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 11:41:24 GMT"},{"version":"v2","created":"Fri, 6 Sep 2024 07:56:21 GMT"}],"updateDate":"2024-09-09","timestamp":1721130084000,"abstract":"  Visual validation of regression models in scatterplots is a common practice\nfor assessing model quality, yet its efficacy remains unquantified. We\nconducted two empirical experiments to investigate individuals' ability to\nvisually validate linear regression models (linear trends) and to examine the\nimpact of common visualization designs on validation quality. The first\nexperiment showed that the level of accuracy for visual estimation of slope\n(i.e., fitting a line to data) is higher than for visual validation of slope\n(i.e., accepting a shown line). Notably, we found bias toward slopes that are\n\"too steep\" in both cases. This lead to novel insights that participants\nnaturally assessed regression with orthogonal distances between the points and\nthe line (i.e., ODR regression) rather than the common vertical distances (OLS\nregression). In the second experiment, we investigated whether incorporating\ncommon designs for regression visualization (error lines, bounding boxes, and\nconfidence intervals) would improve visual validation. Even though error lines\nreduced validation bias, results failed to show the desired improvements in\naccuracy for any design. Overall, our findings suggest caution in using visual\nmodel validation for linear trends in scatterplots.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics","Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}