{"id":"2407.07758","title":"Scalable improvement of the generalized Toffoli gate realization using\n  trapped-ion-based qutrits","authors":"Anastasiia S. Nikolaeva, Ilia V. Zalivako, Alexander S. Borisenko,\n  Nikita V. Semenin, Kristina P. Galstyan, Andrey E. Korolkov, Evgeniy O.\n  Kiktenko, Ksenia Yu. Khabarova, Ilya A. Semerikov, Aleksey K. Fedorov, and\n  Nikolay N. Kolachevsky","authorsParsed":[["Nikolaeva","Anastasiia S.",""],["Zalivako","Ilia V.",""],["Borisenko","Alexander S.",""],["Semenin","Nikita V.",""],["Galstyan","Kristina P.",""],["Korolkov","Andrey E.",""],["Kiktenko","Evgeniy O.",""],["Khabarova","Ksenia Yu.",""],["Semerikov","Ilya A.",""],["Fedorov","Aleksey K.",""],["Kolachevsky","Nikolay N.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 15:34:56 GMT"}],"updateDate":"2024-07-11","timestamp":1720625696000,"abstract":"  An efficient implementation of the Toffoli gate is of conceptual importance\nfor running various quantum algorithms, including Grover's search and Shor's\ninteger factorization. However, direct realizations of the Toffoli gate require\neither a prohibitive growth of the number of two-qubit gates or using ancilla\nqubits, whereas both of these resources are limited in the current generation\nof noisy intermediate-scale quantum devices. Here we experimentally demonstrate\na scalable improvement of the realization of the Toffoli gate using\n$^{171}$Yb$^{+}$ trapped-ion-based dual-type optic-microwave qutrits ($d=3$)\nfor the cases of three-, four-qubit and five-qubit versions of the Toffoli\ngate. With the use of the Molmer-Sorensen gate as a basic two-particle\noperation, we compare the standard qubit decomposition with the qutrit\napproach, where upper levels are used as ancillas. The presented decomposition\nrequires only global control of the ancilla levels, which simplifies\nexperimental implementation of the proposed approach. We present an estimation\nof the scalable improvement of our approach in the case of multi-qubit gates.\nAs we expect, by combining this approach with the leveraging qudits ($d\\geq4$)\nas a set of qubits, our approach may lead to a more efficient realization of\nvarious quantum algorithms. With qutrit-based decomposition in Grover's search\nwith three ions, we experimentally demonstrate the 10\\% increase in the average\nalgorithm performance.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}