{"id":"2407.00486","title":"Towards Massive Multilingual Holistic Bias","authors":"Xiaoqing Ellen Tan and Prangthip Hansanti and Carleigh Wood and Bokai\n  Yu and Christophe Ropers and Marta R. Costa-juss\\`a","authorsParsed":[["Tan","Xiaoqing Ellen",""],["Hansanti","Prangthip",""],["Wood","Carleigh",""],["Yu","Bokai",""],["Ropers","Christophe",""],["Costa-jussà","Marta R.",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 16:26:27 GMT"}],"updateDate":"2024-07-02","timestamp":1719678387000,"abstract":"  In the current landscape of automatic language generation, there is a need to\nunderstand, evaluate, and mitigate demographic biases as existing models are\nbecoming increasingly multilingual. To address this, we present the initial\neight languages from the MASSIVE MULTILINGUAL HOLISTICBIAS (MMHB) dataset and\nbenchmark consisting of approximately 6 million sentences representing 13\ndemographic axes. We propose an automatic construction methodology to further\nscale up MMHB sentences in terms of both language coverage and size, leveraging\nlimited human annotation. Our approach utilizes placeholders in multilingual\nsentence construction and employs a systematic method to independently\ntranslate sentence patterns, nouns, and descriptors. Combined with human\ntranslation, this technique carefully designs placeholders to dynamically\ngenerate multiple sentence variations and significantly reduces the human\ntranslation workload. The translation process has been meticulously conducted\nto avoid an English-centric perspective and include all necessary morphological\nvariations for languages that require them, improving from the original English\nHOLISTICBIAS. Finally, we utilize MMHB to report results on gender bias and\nadded toxicity in machine translation tasks. On the gender analysis, MMHB\nunveils: (1) a lack of gender robustness showing almost +4 chrf points in\naverage for masculine semantic sentences compared to feminine ones and (2) a\npreference to overgeneralize to masculine forms by reporting more than +12 chrf\npoints in average when evaluating with masculine compared to feminine\nreferences. MMHB triggers added toxicity up to 2.3%.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}