{"id":"2407.01293","title":"Applying the Ego Network Model to Cross-Target Stance Detection","authors":"Jack Tacchi, Parisa Jamadi Khiabani, Arkaitz Zubiaga, Chiara Boldrini,\n  Andrea Passarella","authorsParsed":[["Tacchi","Jack",""],["Khiabani","Parisa Jamadi",""],["Zubiaga","Arkaitz",""],["Boldrini","Chiara",""],["Passarella","Andrea",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:47:22 GMT"}],"updateDate":"2024-07-02","timestamp":1719841642000,"abstract":"  Understanding human interactions and social structures is an incredibly\nimportant task, especially in such an interconnected world. One task that\nfacilitates this is Stance Detection, which predicts the opinion or attitude of\na text towards a target entity. Traditionally, this has often been done mainly\nvia the use of text-based approaches, however, recent work has produced a model\n(CT-TN) that leverages information about a user's social network to help\npredict their stance, outperforming certain cross-target text-based approaches.\nUnfortunately, the data required for such graph-based approaches is not always\navailable. This paper proposes two novel tools for Stance Detection: the Ego\nNetwork Model (ENM) and the Signed Ego Network Model (SENM). These models are\nfounded in anthropological and psychological studies and have been used within\nthe context of social network analysis and related tasks (e.g., link\nprediction). Stance Detection predictions obtained using these features achieve\na level of accuracy similar to the graph-based features used by CT-TN while\nrequiring less and more easily obtainable data. In addition to this, the\nperformances of the inner and outer circles of the ENM, representing stronger\nand weaker social ties, respectively are compared. Surprisingly, the outer\ncircles, which contain more numerous but less intimate connections, are more\nuseful for predicting stance.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}