{"id":"2407.05983","title":"Towards A Comprehensive Visual Saliency Explanation Framework for\n  AI-based Face Recognition Systems","authors":"Yuhang Lu, Zewei Xu, Touradj Ebrahimi","authorsParsed":[["Lu","Yuhang",""],["Xu","Zewei",""],["Ebrahimi","Touradj",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 14:25:46 GMT"}],"updateDate":"2024-07-09","timestamp":1720448746000,"abstract":"  Over recent years, deep convolutional neural networks have significantly\nadvanced the field of face recognition techniques for both verification and\nidentification purposes. Despite the impressive accuracy, these neural networks\nare often criticized for lacking explainability. There is a growing demand for\nunderstanding the decision-making process of AI-based face recognition systems.\nSome studies have investigated the use of visual saliency maps as explanations,\nbut they have predominantly focused on the specific face verification case. The\ndiscussion on more general face recognition scenarios and the corresponding\nevaluation methodology for these explanations have long been absent in current\nresearch. Therefore, this manuscript conceives a comprehensive explanation\nframework for face recognition tasks. Firstly, an exhaustive definition of\nvisual saliency map-based explanations for AI-based face recognition systems is\nprovided, taking into account the two most common recognition situations\nindividually, i.e., face verification and identification. Secondly, a new\nmodel-agnostic explanation method named CorrRISE is proposed to produce\nsaliency maps, which reveal both the similar and dissimilar regions between any\ngiven face images. Subsequently, the explanation framework conceives a new\nevaluation methodology that offers quantitative measurement and comparison of\nthe performance of general visual saliency explanation methods in face\nrecognition. Consequently, extensive experiments are carried out on multiple\nverification and identification scenarios. The results showcase that CorrRISE\ngenerates insightful saliency maps and demonstrates superior performance,\nparticularly in similarity maps in comparison with the state-of-the-art\nexplanation approaches.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}