{"id":"2407.09571","title":"ImPORTance -- Machine Learning-Driven Analysis of Global Port\n  Significance and Network Dynamics for Improved Operational Efficiency","authors":"Emanuele Carlini, Domenico Di Gangi, Vinicius Monteiro de Lira, Hanna\n  Kavalionak, Gabriel Spadon, Amilcar Soares","authorsParsed":[["Carlini","Emanuele",""],["Di Gangi","Domenico",""],["de Lira","Vinicius Monteiro",""],["Kavalionak","Hanna",""],["Spadon","Gabriel",""],["Soares","Amilcar",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 22:49:45 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 12:58:04 GMT"}],"updateDate":"2024-07-17","timestamp":1720651785000,"abstract":"  Seaports play a crucial role in the global economy, and researchers have\nsought to understand their significance through various studies. In this paper,\nwe aim to explore the common characteristics shared by important ports by\nanalyzing the network of connections formed by vessel movement among them. To\naccomplish this task, we adopt a bottom-up network construction approach that\ncombines three years' worth of AIS (Automatic Identification System) data from\naround the world, constructing a Ports Network that represents the connections\nbetween different ports. Through such representation, we use machine learning\nto measure the relative significance of different port features. Our model\nexamined such features and revealed that geographical characteristics and the\ndepth of the port are indicators of a port's significance to the Ports Network.\nAccordingly, this study employs a data-driven approach and utilizes machine\nlearning to provide a comprehensive understanding of the factors contributing\nto ports' importance. The outcomes of our work are aimed to inform\ndecision-making processes related to port development, resource allocation, and\ninfrastructure planning in the industry.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}