{"id":"2407.05204","title":"Leveraging Persistent Homology Features for Accurate Defect Formation\n  Energy Predictions via Graph Neural Networks","authors":"Zhenyao Fang, Qimin Yan","authorsParsed":[["Fang","Zhenyao",""],["Yan","Qimin",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 23:07:59 GMT"}],"updateDate":"2024-07-09","timestamp":1720307279000,"abstract":"  Accurate predictions of defect formation energies are crucial to\nunderstanding defect properties in materials, such as favorable defect types\nand concentration, and to investigating the interplay between defects and other\nfunctional properties of materials. To overcome the computational expense of\ndensity-functional theory calculations in large supercells, several graph\nneural network (GNN) models were proposed to predict the defect formation\nenergies. However, their performance is limited due to the fact that defect\nformation energies depend strongly on the local atomic configurations near the\ndefect sites and to the over-smoothing problem of GNN. Herein, we demonstrate\nthat persistent homology features, which characterize the topological structure\nof the local chemical environment around each atomic site, encode the\nstructural information of defects (such as vacancies and substitutions),\nincluding the size of the defects, the number of defects near each atom, and\nthe distance to those defects. Using the dataset comprising a wide spectrum of\nO-based perovskites with vacancies of various elemental type as an example, we\nconstruct and train the GNN models to predict the neutral vacancy formation\nenergies, and show that incorporating the persistent homology features, along\nwith proper choices of the graph pooling operations, significantly increases\nthe prediction accuracy and overcomes the non-convergence issue with respect to\nthe supercell size in previous GNN models. Furthermore, using defective BaTiO3\nwith multiple substitutions and multiple vacancies as examples, our GNN model\ncan also predict the defect-defect interaction energies accurately. These\nresults suggest that persistent homology features are highly effective in\npredicting defect-related properties and can be integrated into the vast family\nof advanced graph neural network models for future defect studies.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1LVxykB8tSx_2f1LCKOAnqHW7uBdtNrcTEo9aOVEyWY","pdfSize":"1172455"}
