{"id":"2407.17224","title":"Changing the paradigm in f-containing cold molecules: the impact of\n  spin-orbit coupling and f-d transitions on quasi-bound vibrational states","authors":"Marta Ga{\\l}y\\'nska and Matheus M. F. de Moraes and Pawe{\\l} Tecmer\n  and Katharina Boguslawski","authorsParsed":[["Gałyńska","Marta",""],["de Moraes","Matheus M. F.",""],["Tecmer","Paweł",""],["Boguslawski","Katharina",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 12:24:44 GMT"}],"updateDate":"2024-07-25","timestamp":1721823884000,"abstract":"  Present-day state-of-the-art ab initio many-body calculations on f-block\ncontaining cold molecules heavily focus on perturbative approaches for\nspin-orbit coupling and exclude a substantial part of the atomic transitions in\nthe $f$- and $d$-shell. Here, we demonstrate the cruciality of a proper\nrelativistic treatment of the $f$- and $d$-shell in Yb-containing diatomics and\nthe inclusion of $f\\rightarrow d$ transitions to obtain physically sound\nelastic scatterings and pre-dissociation lifetimes. We focus on\nstate-of-the-art relativistic many-body calculations for the Yb atom's ground-\nand excited-state and the YbLi$^+$ potential energy surface. For that purpose,\nwe exploit various quantum many-body methods, namely a spin-free and\nfour-component implementation of the coupled cluster singles and doubles (CCSD)\nmodel and its equation of motion extensions, spin-free complete active space\nself-consistent field, and internally contracted multi-reference (MR)\nconfiguration interaction approaches, and spin-free MRCCSD with a perturbative\nand full triples correction. We oppose scalar relativistic calculations to\nfour-component variants to support the reliability of our EOM-CCSD study and\nshed new light on the interplay between these systems' spin-orbit coupling and\nthe proper treatment of relativistic effects. Most importantly, we observe a\nsignificant shift in the electronic spectra of the $f\\rightarrow d$ excitation\nblock. We also provide new reference potential energy surfaces for ground and\nexcited states for which theoretically sound elastic scattering and\npre-dissociation lifetimes are calculated.\n","subjects":["Physics/Atomic Physics","Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}