{"id":"2407.17875","title":"Overcoming Binary Adversarial Optimisation with Competitive Coevolution","authors":"Per Kristian Lehre and Shishen Lin","authorsParsed":[["Lehre","Per Kristian",""],["Lin","Shishen",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 08:44:23 GMT"}],"updateDate":"2024-07-26","timestamp":1721897063000,"abstract":"  Co-evolutionary algorithms (CoEAs), which pair candidate designs with test\ncases, are frequently used in adversarial optimisation, particularly for binary\ntest-based problems where designs and tests yield binary outcomes. The\neffectiveness of designs is determined by their performance against tests, and\nthe value of tests is based on their ability to identify failing designs, often\nleading to more sophisticated tests and improved designs. However, CoEAs can\nexhibit complex, sometimes pathological behaviours like disengagement. Through\nruntime analysis, we aim to rigorously analyse whether CoEAs can efficiently\nsolve test-based adversarial optimisation problems in an expected polynomial\nruntime.\n  This paper carries out the first rigorous runtime analysis of $(1,\\lambda)$\nCoEA for binary test-based adversarial optimisation problems. In particular, we\nintroduce a binary test-based benchmark problem called \\Diagonal problem and\ninitiate the first runtime analysis of competitive CoEA on this problem. The\nmathematical analysis shows that the $(1,\\lambda)$-CoEA can efficiently find an\n$\\varepsilon$ approximation to the optimal solution of the \\Diagonal problem,\ni.e. in expected polynomial runtime assuming sufficiently low mutation rates\nand large offspring population size. On the other hand, the standard\n$(1,\\lambda)$-EA fails to find an $\\varepsilon$ approximation to the optimal\nsolution of the \\Diagonal problem in polynomial runtime. This suggests the\npromising potential of coevolution for solving binary adversarial optimisation\nproblems.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by/4.0/"}