{"id":"2407.13567","title":"Hyp2Nav: Hyperbolic Planning and Curiosity for Crowd Navigation","authors":"Guido Maria D'Amely di Melendugno, Alessandro Flaborea, Pascal Mettes,\n  Fabio Galasso","authorsParsed":[["di Melendugno","Guido Maria D'Amely",""],["Flaborea","Alessandro",""],["Mettes","Pascal",""],["Galasso","Fabio",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 14:40:33 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 07:29:19 GMT"},{"version":"v3","created":"Fri, 6 Sep 2024 10:16:17 GMT"}],"updateDate":"2024-09-09","timestamp":1721313633000,"abstract":"  Autonomous robots are increasingly becoming a strong fixture in social\nenvironments. Effective crowd navigation requires not only safe yet fast\nplanning, but should also enable interpretability and computational efficiency\nfor working in real-time on embedded devices. In this work, we advocate for\nhyperbolic learning to enable crowd navigation and we introduce Hyp2Nav.\nDifferent from conventional reinforcement learning-based crowd navigation\nmethods, Hyp2Nav leverages the intrinsic properties of hyperbolic geometry to\nbetter encode the hierarchical nature of decision-making processes in\nnavigation tasks. We propose a hyperbolic policy model and a hyperbolic\ncuriosity module that results in effective social navigation, best success\nrates, and returns across multiple simulation settings, using up to 6 times\nfewer parameters than competitor state-of-the-art models. With our approach, it\nbecomes even possible to obtain policies that work in 2-dimensional embedding\nspaces, opening up new possibilities for low-resource crowd navigation and\nmodel interpretability. Insightfully, the internal hyperbolic representation of\nHyp2Nav correlates with how much attention the robot pays to the surrounding\ncrowds, e.g. due to multiple people occluding its pathway or to a few of them\nshowing colliding plans, rather than to its own planned route. The code is\navailable at https://github.com/GDam90/hyp2nav.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}