{"id":"2407.20303","title":"Polarization Saturation in Multi-layered Interfacial Ferroelectrics","authors":"Wei Cao, Swarup Deb, Maayan Vizner Stern, Noam Raab, Michael Urbakh,\n  Oded Hod, Leeor Kronik, Moshe Ben Shalom","authorsParsed":[["Cao","Wei",""],["Deb","Swarup",""],["Stern","Maayan Vizner",""],["Raab","Noam",""],["Urbakh","Michael",""],["Hod","Oded",""],["Kronik","Leeor",""],["Shalom","Moshe Ben",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 12:17:33 GMT"}],"updateDate":"2024-07-31","timestamp":1722255453000,"abstract":"  Van der Waals (vdW) polytypes of broken inversion and mirror symmetries were\nrecently shown to exhibit switchable electric polarization even at the ultimate\ntwo-layer thin limit. Their out-of-plane polarization was found to accumulate\nin a ladder-like fashion with each successive layer, offering 2D building\nblocks for the bottom-up construction of 3D ferroelectrics. Here, we\ndemonstrate experimentally that beyond a critical stack thickness, the\naccumulated polarization in rhombohedral polytypes of molybdenum disulfide\n(r-MoS2) saturates. The underlying saturation mechanism, deciphered via DFT and\nself-consistent Poisson-Schr\\\"odinger calculations, point to a purely\nelectronic redistribution involving: (1) polarization-induced bandgap closure\nthat allows for cross-stack charge transfer and the emergence of free surface\ncharge; (2) reduction of the polarization saturation value, as well as the\ncritical thickness at which it is obtained, by the presence of free carriers.\nThe resilience of polar layered structures to atomic surface reconstruction,\nwhich is essentially unavoidable in polar 3D crystals, potentially allows for\nthe design of new devices with mobile surface charges. Our findings, which are\nof general nature, should be accounted for when designing switching and/or\nconductive devices based on ferroelectric layered materials.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}