{"id":"2407.02679","title":"Enhancing Scalability of Optimal Kron-based Reduction of Networks\n  (Opti-KRON) via Decomposition with Community Detection","authors":"Omid Mokhtari, Samuel Chevalier, and Mads Almassalkhi","authorsParsed":[["Mokhtari","Omid",""],["Chevalier","Samuel",""],["Almassalkhi","Mads",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 21:40:25 GMT"}],"updateDate":"2024-07-04","timestamp":1719956425000,"abstract":"  Electrical networks contain thousands of interconnected nodes and edges,\nwhich leads to computational challenges in some power system studies. To\naddress these challenges, we contend that network reductions can serve as a\nframework to enable scalable computing in power systems. By building upon a\nprior AC \"Opti-KRON\" formulation, this paper presents a DC power flow\nformulation for finding network reductions that are optimal within the context\nof large transmission analysis. Opti-KRON previously formulated optimal\nKron-based network reductions as a mixed integer linear program (MILP), where\nthe number of binary variables scaled with the number of nodes. To improve the\nscalability of the Opti-KRON approach, we augment the MILP formulation with a\ncommunity detection (CD) technique that segments a large network into smaller,\ndisjoint, but contiguous sub-graphs (i.e., communities). For each sub-graph, we\nthen (in parallel) apply MILP-based along with a new cutting plane constraint,\nthus, enhancing scalability. Ultimately, the new DC-based Opti-KRON method can\nachieve a 80-95\\% reduction of networks (in terms of nodes) while statistically\noutperforming other CD- and Kron-based methods. We present simulation results\nfor the IEEE RTS-96 and the 2383-bus Polish networks.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DHp21TmRQz-dXRWiaQFKcNHIdVp9FjFxqNYRvjz8ibA","pdfSize":"606525"}
