{"id":"2407.10883","title":"Innovation Resistance Theory in Action: Unveiling Barriers to Open\n  Government Data Adoption by Public Organizations to Unlock Open Data\n  Innovation","authors":"Anastasija Nikiforova, Antoine Clarinval, Anneke Zuiderwijk, Daniel\n  Rudmark, Petar Milic, Katrin Rajam\\\"ae-Soosaar","authorsParsed":[["Nikiforova","Anastasija",""],["Clarinval","Antoine",""],["Zuiderwijk","Anneke",""],["Rudmark","Daniel",""],["Milic","Petar",""],["Rajamäe-Soosaar","Katrin",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 16:35:38 GMT"}],"updateDate":"2024-07-16","timestamp":1721061338000,"abstract":"  Open Government Data (OGD) plays a pivotal role in fostering data-driven\ninnovation and sustainability across various sectors. Despite its potential,\nmany public organizations are reluctant to share their data openly. While\nexisting research has explored factors impacting the public organizations\nintention to share OGD, there is a paucity of research applying theoretical\nmodels to investigate the resistance by public organizations to making\ngovernment data publicly available. This study addresses the gap by developing\nan Innovation Resistance Theory (IRT) model tailored to OGD that allows\nidentifying predictors of resistance among public agencies. We develop an\ninitial model based on literature and refine it through interviews with 21\npublic agencies across six countries. The final model describes 39 barriers\nrelated to usage, value, risks, tradition, and image. The findings contribute\nto the literature by adapting IRT to the context of OGD, an area where its\napplication has been notably limited. As such, this study addresses the growing\ndemand for novel theoretical frameworks to examine OGD adoption barriers.\nPractical insights are provided to support policymakers in creating data\necosystems that encourage data openness and address challenges in OGD adoption.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Databases","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}