{"id":"2407.07873","title":"Dynamical Measure Transport and Neural PDE Solvers for Sampling","authors":"Jingtong Sun, Julius Berner, Lorenz Richter, Marius Zeinhofer,\n  Johannes M\\\"uller, Kamyar Azizzadenesheli, Anima Anandkumar","authorsParsed":[["Sun","Jingtong",""],["Berner","Julius",""],["Richter","Lorenz",""],["Zeinhofer","Marius",""],["Müller","Johannes",""],["Azizzadenesheli","Kamyar",""],["Anandkumar","Anima",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 17:39:50 GMT"}],"updateDate":"2024-07-11","timestamp":1720633190000,"abstract":"  The task of sampling from a probability density can be approached as\ntransporting a tractable density function to the target, known as dynamical\nmeasure transport. In this work, we tackle it through a principled unified\nframework using deterministic or stochastic evolutions described by partial\ndifferential equations (PDEs). This framework incorporates prior\ntrajectory-based sampling methods, such as diffusion models or Schr\\\"odinger\nbridges, without relying on the concept of time-reversals. Moreover, it allows\nus to propose novel numerical methods for solving the transport task and thus\nsampling from complicated targets without the need for the normalization\nconstant or data samples. We employ physics-informed neural networks (PINNs) to\napproximate the respective PDE solutions, implying both conceptional and\ncomputational advantages. In particular, PINNs allow for simulation- and\ndiscretization-free optimization and can be trained very efficiently, leading\nto significantly better mode coverage in the sampling task compared to\nalternative methods. Moreover, they can readily be fine-tuned with Gauss-Newton\nmethods to achieve high accuracy in sampling.\n","subjects":["Computing Research Repository/Machine Learning","Mathematics/Dynamical Systems","Mathematics/Optimization and Control","Mathematics/Probability","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}