{"id":"2407.21056","title":"What Matters in Explanations: Towards Explainable Fake Review Detection\n  Focusing on Transformers","authors":"Md Shajalal, Md Atabuzzaman, Alexander Boden, Gunnar Stevens, Delong\n  Du","authorsParsed":[["Shajalal","Md",""],["Atabuzzaman","Md",""],["Boden","Alexander",""],["Stevens","Gunnar",""],["Du","Delong",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 13:26:02 GMT"}],"updateDate":"2024-08-01","timestamp":1721827562000,"abstract":"  Customers' reviews and feedback play crucial role on electronic\ncommerce~(E-commerce) platforms like Amazon, Zalando, and eBay in influencing\nother customers' purchasing decisions. However, there is a prevailing concern\nthat sellers often post fake or spam reviews to deceive potential customers and\nmanipulate their opinions about a product. Over the past decade, there has been\nconsiderable interest in using machine learning (ML) and deep learning (DL)\nmodels to identify such fraudulent reviews. Unfortunately, the decisions made\nby complex ML and DL models - which often function as \\emph{black-boxes} - can\nbe surprising and difficult for general users to comprehend. In this paper, we\npropose an explainable framework for detecting fake reviews with high precision\nin identifying fraudulent content with explanations and investigate what\ninformation matters most for explaining particular decisions by conducting\nempirical user evaluation. Initially, we develop fake review detection models\nusing DL and transformer models including XLNet and DistilBERT. We then\nintroduce layer-wise relevance propagation (LRP) technique for generating\nexplanations that can map the contributions of words toward the predicted\nclass. The experimental results on two benchmark fake review detection datasets\ndemonstrate that our predictive models achieve state-of-the-art performance and\noutperform several existing methods. Furthermore, the empirical user evaluation\nof the generated explanations concludes which important information needs to be\nconsidered in generating explanations in the context of fake review\nidentification.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Information Retrieval","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"PQaTfVNwLzzoq8HXzEMpUbZm1w6XixIV7JXk4pRS32s","pdfSize":"449559"}
