{"id":"2407.08134","title":"Highway Networks for Improved Surface Reconstruction: The Role of\n  Residuals and Weight Updates","authors":"A. Noorizadegan, Y.C. Hon, D.L. Young, C.S. Chen","authorsParsed":[["Noorizadegan","A.",""],["Hon","Y. C.",""],["Young","D. L.",""],["Chen","C. S.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 02:15:21 GMT"}],"updateDate":"2024-07-12","timestamp":1720664121000,"abstract":"  Surface reconstruction from point clouds is a fundamental challenge in\ncomputer graphics and medical imaging. In this paper, we explore the\napplication of advanced neural network architectures for the accurate and\nefficient reconstruction of surfaces from data points. We introduce a novel\nvariant of the Highway network (Hw) called Square-Highway (SqrHw) within the\ncontext of multilayer perceptrons and investigate its performance alongside\nplain neural networks and a simplified Hw in various numerical examples. These\nexamples include the reconstruction of simple and complex surfaces, such as\nspheres, human hands, and intricate models like the Stanford Bunny. We analyze\nthe impact of factors such as the number of hidden layers, interior and\nexterior points, and data distribution on surface reconstruction quality. Our\nresults show that the proposed SqrHw architecture outperforms other neural\nnetwork configurations, achieving faster convergence and higher-quality surface\nreconstructions. Additionally, we demonstrate the SqrHw's ability to predict\nsurfaces over missing data, a valuable feature for challenging applications\nlike medical imaging. Furthermore, our study delves into further details,\ndemonstrating that the proposed method based on highway networks yields more\nstable weight norms and backpropagation gradients compared to the Plain Network\narchitecture. This research not only advances the field of computer graphics\nbut also holds utility for other purposes such as function interpolation and\nphysics-informed neural networks, which integrate multilayer perceptrons into\ntheir algorithms.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mq_zrPiAPJPGdVPmHX6Vu1POgMEslfMLESQ0FIMx-tg","pdfSize":"2355828"}
