{"id":"2407.08685","title":"An \"ultimate\" coupled cluster method based entirely on $T_2$","authors":"Zachary W. Windom, Ajith Perera, Rodney J. Bartlett","authorsParsed":[["Windom","Zachary W.",""],["Perera","Ajith",""],["Bartlett","Rodney J.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 17:24:23 GMT"}],"updateDate":"2024-07-12","timestamp":1720718663000,"abstract":"  Electronic structure methods built around double-electron excitations have a\nrich history in quantum chemistry. However, it seems to be the case that such\nmethods are only suitable in particular situations and are not naturally\nequipped to simultaneously handle the variety of electron correlations that\nmight be present in chemical systems. To this end, the current work seeks a\ncomputationally efficient, low-rank, \"ultimate\" coupled cluster method based\nexclusively on $T_2$ and its products which can effectively emulate more\n\"complete\" methods that explicitly consider higher-rank, $T_{2m}$ operators. We\nintroduce a hierarchy of methods designed to systematically account for higher,\neven order cluster operators - like $T_4, T_6, \\cdots, T_{2m}$ - by invoking\ntenets of the factorization theorem of perturbation theory and\nexpectation-value coupled cluster theory. It is shown that each member within\nthis methodological hierarchy is defined such that both the wavefunction and\nenergy are correct through some order in many-body perturbation theory (MBPT),\nand can be extended up to arbitrarily high orders in $T_2$. The efficacy of\nsuch approximations are determined by studying the potential energy surface of\nseveral prototypical systems that are chosen to represent both non-dynamic,\nstatic, and dynamic correlation regimes. We find that the proposed hierarchy of\naugmented $T_2$ methods essentially reduce to standard CCD for problems where\ndynamic electron correlations dominate, but offer improvements in situations\nwhere non-dynamic and static correlations become relevant. A notable highlight\nof this work is that the cheapest methods in this hierarchy - which are correct\nthrough fifth-order in MBPT - consistently emulate the behavior of the\n$\\mathcal{O}(N^{10})$ CCDQ method, yet only require a $\\mathcal{O}(N^{6})$\nalgorithm by virtue of factorized intermediates.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"37epUGOS4buVphkTrnlArzHlwIL-CR0eEepIgJqZS9k","pdfSize":"3619615"}
