{"id":"2407.16748","title":"The dispersion measure and rotation measure from fast radio burst host\n  galaxies based on the IllustrisTNG50 simulation","authors":"Timea Orsolya Kovacs, Sui Ann Mao, Aritra Basu, Yik Ki Ma, Laura G.\n  Spitler, Charles R. H. Walker","authorsParsed":[["Kovacs","Timea Orsolya",""],["Mao","Sui Ann",""],["Basu","Aritra",""],["Ma","Yik Ki",""],["Spitler","Laura G.",""],["Walker","Charles R. H.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-25","timestamp":1721757601000,"abstract":"  Fast radio bursts (FRB) will become important cosmological tools, as the\nnumber of observed FRBs is increasing rapidly with more surveys being carried\nout. A large sample of FRBs with dispersion measures (DM) and rotation measures\n(RM) can be used to study the intergalactic magnetic field. However, the\nobserved DM and RM of FRBs have multiple contributors which must be quantified\nto obtain the intergalactic medium's (IGM) DM and RM. In this paper, we\nestimate one such contribution to DM and RM: that of FRB host galaxies. We show\nhow it changes with redshift, galaxy type, and the stellar mass of the\ngalaxies, inclination, and FRB's projected offset. Using the IllustrisTNG50\nsimulations, we selected 16500 galaxies at redshifts of 0<=z<=2, with stellar\nmasses in the range 9<=log(M*/Msun)<=12. In each galaxy, we calculate the DM\nand RM contributions of 1000 sightlines, and construct DM and RM probability\ndensity functions. We find that the rest frame DM distributions of all galaxies\nat a given redshift can be fitted by a lognormal function, and the rest frame\nRM distribution is symmetric around 0 rad m$^{-2}$, and can be fitted by the\ncombination of a Lorentzian and two Gaussian functions. The parameters of these\nfunctions change for different subsets of galaxies with different redshift,\nstellar mass, inclination, and FRB offset. These changes are due to an\nincreasing $n_e$ with redshift, SFR, and stellar mass, and we find a more\nordered B field at lower z compared to higher z, suggested by more galaxies\nwith B field reversals and B fields dominated by random B field at higher z. We\nestimate the FRB host DM and RM contributions, which can be used in the future\nto isolate the IGM's contribution from the observed DM and RM of FRBs. We\npredict that to constrain an $\\sigma_{\\rm RM,IGM}$ of 2 rad m$^{-2}$ to 95%\nconfidence level we need to observe 95000 FRBs at z=0.5, but only 9500 FRBs at\nz=2.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}