{"id":"2407.20977","title":"2D Skyrmion topological charge of spin textures with arbitrary boundary\n  conditions: a two-component spinorial BEC as a case study","authors":"S. S\\'anchez-Res\\'endiz, E. Neri, S. Gonz\\'alez-Hern\\'andez, and V.\n  Romero-Roch\\'in","authorsParsed":[["Sánchez-Reséndiz","S.",""],["Neri","E.",""],["González-Hernández","S.",""],["Romero-Rochín","V.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 17:13:54 GMT"}],"updateDate":"2024-07-31","timestamp":1722359634000,"abstract":"  We derive the most general expression for the Skyrmion topological charge for\na two-dimensional spin texture, valid for any type of boundary conditions or\nfor any arbitrary spatial region within the texture. It reduces to the usual\none $Q = 1/4\\pi \\iint \\vec f \\cdot \\left(\\partial_x \\vec f \\times \\partial_y\n\\vec f\\right)$ for the appropriate boundary conditions, with $\\vec f$ the spin\ntexture. The general expression resembles the Gauss-Bonet theorem for the\nEuler-Poincar\\'e characteristic of a 2D surface, but it has definite\ndifferences, responsible for the assignment of the proper signs of the Skyrmion\ncharges. Additionally, we show that the charge of a single Skyrmion is the\nproduct of the value of the normal component of the spin texture at the\nsingularity times the Index or winding number of the transverse texture, a\ngeneralization of a Poincar\\'e theorem. We illustrate our general results\nanalyzing in detail a two-component spinor Bose-Einstein condensate in 2D in\nthe presence of an external magnetic field, via the Gross-Pitaevskii equation.\nThe condensate spin textures present Skyrmions singularities at the spatial\nlocations where the transverse magnetic field vanishes. We show that the\nensuing superfluid vortices and Skyrmions have the same value for their\ncorresponding topological charges, in turn due to the structure of the magnetic\nfield.\n","subjects":["Condensed Matter/Quantum Gases","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}