{"id":"2407.20558","title":"Robust CNN Multi-Nested-LSTM Framework with Compound Loss for\n  Patch-based Multi-Push Ultrasound Shear Wave Imaging and Segmentation","authors":"Md. Jahin Alam, Ahsan Habib and Md. Kamrul Hasan","authorsParsed":[["Alam","Md. Jahin",""],["Habib","Ahsan",""],["Hasan","Md. Kamrul",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 05:24:42 GMT"}],"updateDate":"2024-07-31","timestamp":1722317082000,"abstract":"  Ultrasound Shear Wave Elastography (SWE) is a noteworthy tool for in-vivo\nnoninvasive tissue pathology assessment. State-of-the-art techniques can\ngenerate reasonable estimates of tissue elasticity, but high-quality and\nnoise-resiliency in SWE reconstruction have yet to demonstrate advancements. In\nthis work, we propose a two-stage DL pipeline producing reliable\nreconstructions and denoise said reconstructions to obtain lower noise\nprevailing elasticity mappings. The reconstruction network consists of a\nResnet3D Encoder to extract temporal context from the sequential multi-push\ndata. The encoded features are sent to multiple Nested CNN LSTMs which process\nthem in a temporal attention-guided windowing basis and map the 3D features to\n2D using FFT-attention, which are then decoded into an elasticity map as\nprimary reconstruction. The 2D maps from each multi-push region are merged and\ncleaned using a dual-decoder denoiser network, which independently denoises\nforeground and background before fusion. The post-denoiser generates a\nhigher-quality reconstruction and an inclusion-segmentation mask. A\nmulti-objective loss is designed to accommodate the denoising, fusing, and\nsegmentation processes. The method is validated on sequential multi-push SWE\nmotion data with multiple overlapping regions. A patch-based training procedure\nis introduced with network modifications to handle data scarcity. Evaluations\nproduce 32.66dB PSNR, 43.19dB CNR in noisy simulation, and 22.44dB PSNR,\n36.88dB CNR in experimental data, across all test samples. Moreover, IoUs\n(0.909 and 0.781) were quite satisfactory in the datasets. After comparing with\nother reported deep-learning approaches, our method proves quantitatively and\nqualitatively superior in dealing with noise influences in SWE data. From a\nperformance point of view, our deep-learning pipeline has the potential to\nbecome utilitarian in the clinical domain.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Quantitative Biology/Quantitative Methods"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}