{"id":"2407.15640","title":"Impacts of dark energy on weighing neutrinos after DESI BAO","authors":"Guo-Hong Du, Peng-Ju Wu, Tian-Nuo Li, Xin Zhang","authorsParsed":[["Du","Guo-Hong",""],["Wu","Peng-Ju",""],["Li","Tian-Nuo",""],["Zhang","Xin",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 13:59:21 GMT"}],"updateDate":"2024-07-23","timestamp":1721656761000,"abstract":"  Recently, DESI has released baryon acoustic oscillation (BAO) data, and DES\nhas also published its five-year supernova (SN) data. These observations,\ncombined with cosmic microwave background (CMB) data, support a dynamically\nevolving dark energy at a high confidence level. When using cosmological\nobservations to weigh neutrinos, the results of weighing neutrinos will be\nsignificantly affected by the measurement of dark energy due to the degeneracy\nbetween neutrino mass and the dark-energy equation of state. Therefore, we need\nto understand how the dynamical evolution of dark energy in the current\nsituation will affect the measurement of neutrino mass. In this work, we\nutilize these latest observations and other additional distance measurements to\ndiscuss the mutual influence between neutrinos and dark energy, then calculate\nthe Bayes factor to compare models. We consider three neutrino mass hierarchies\nincluding degenerate hierarchy (DH), normal hierarchy (NH), and inverted\nhierarchy (IH), as well as three dark energy models including $\\Lambda \\rm\nCDM$, $w\\rm CDM$, and $w_0w_a \\rm CDM$ models. Cosmological data combined with\nthe prior of particle physics experiments can provide strong to decisive\nevidence favoring the $w_0w_a {\\rm CDM}+\\sum m_\\nu$ model with NH. In the\n$w_0w_a \\rm CDM$ model, using the CMB+DESI+DESY5 data, we obtain constraints on\nthe total neutrino mass, $\\sum m_\\nu<0.171\\ \\rm eV,\\ 0.204\\ \\rm eV,\\ 0.220\\ \\rm\neV$, for DH, NH, and IH, respectively. Furthermore, taking into account the\nneutrino hierarchy or incorporating additional distance measurements results in\na more pronounced deviation from the $\\Lambda$CDM model for dark energy. The\nlatter, particularly, exhibits a deviation at a confidence level that surpasses\n$4\\sigma$.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}