{"id":"2407.00698","title":"NourishNet: Proactive Severity State Forecasting of Food Commodity\n  Prices for Global Warning Systems","authors":"Sydney Balboni, Grace Ivey, Brett Storoe, John Cisler, Tyge Plater,\n  Caitlyn Grant, Ella Bruce, Benjamin Paulson","authorsParsed":[["Balboni","Sydney",""],["Ivey","Grace",""],["Storoe","Brett",""],["Cisler","John",""],["Plater","Tyge",""],["Grant","Caitlyn",""],["Bruce","Ella",""],["Paulson","Benjamin",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 13:43:26 GMT"}],"updateDate":"2024-07-02","timestamp":1719755006000,"abstract":"  Price volatility in global food commodities is a critical signal indicating\npotential disruptions in the food market. Understanding forthcoming changes in\nthese prices is essential for bolstering food security, particularly for\nnations at risk. The Food and Agriculture Organization of the United Nations\n(FAO) previously developed sophisticated statistical frameworks for the\nproactive prediction of food commodity prices, aiding in the creation of global\nearly warning systems. These frameworks utilize food security indicators to\nproduce accurate forecasts, thereby facilitating preparations against potential\nfood shortages. Our research builds on these foundations by integrating robust\nprice security indicators with cutting-edge deep learning (DL) methodologies to\nreveal complex interdependencies. DL techniques examine intricate dynamics\namong diverse factors affecting food prices. Through sophisticated time-series\nforecasting models coupled with a classification model, our approach enhances\nexisting models to better support communities worldwide in advancing their food\nsecurity initiatives.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Numerical Analysis","Economics/General Economics","Mathematics/Numerical Analysis","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/"}