{"id":"2407.21684","title":"Hyperspectral near infrared imaging using a tunable spectral phasor","authors":"Jan Stegemann (1,2), Franziska Gr\\\"oniger (2), Krisztian Neutsch (1),\n  Han Li (3,4), Benjamin Flavel (5), Justus Tom Metternich (1,2), Luise\n  Erpenbeck (6), Poul Petersen (1), Per Niklas Hedde (7), Sebastian Kruss (1,2)\n  ((1) Department of Chemistry and Biochemistry, Bochum University, Bochum,\n  Germany, (2) Fraunhofer Institute for Microelectronic Circuits and Systems,\n  Duisburg, Germany, (3) Department of Mechanical and Materials Engineering,\n  University of Turku, Turku, Finland, (4) Turku Collegium for Science,\n  Medicine and Technology, University of Turku, Turku, Finland, (5) Institute\n  of Nanotechnology, Karlsruhe Institute of Technology, Karlsruhe, Germany, (6)\n  Department of Dermatology, University Hospital M\\\"unster, M\\\"unster, Germany,\n  (7) Beckman Laser Institute & Medical Clinic, University of California,\n  Irvine, CA, USA)","authorsParsed":[["Stegemann","Jan",""],["Gröniger","Franziska",""],["Neutsch","Krisztian",""],["Li","Han",""],["Flavel","Benjamin",""],["Metternich","Justus Tom",""],["Erpenbeck","Luise",""],["Petersen","Poul",""],["Hedde","Per Niklas",""],["Kruss","Sebastian",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:27:25 GMT"}],"updateDate":"2024-08-01","timestamp":1722439645000,"abstract":"  Hyperspectral imaging captures both spectral and spatial information from a\nsample. The near infrared (NIR, > 800 nm) is advantageous for biomedical\nimaging as it falls into the tissue transparency window but also contains\nvibrational overtone and combination modes useful for molecular fingerprinting.\nHere, we demonstrate hyperspectral NIR imaging using a spectral phasor\ntransformation (HyperNIR). This method employs a liquid crystal variable\nretarder (LCVR) for tunable, wavelength-dependent sine-, cosine and no\nfiltering that transforms optical signals into phasor space. Spectral\ninformation is thus obtained with just three images. The LCVR can be adjusted\nto cover a spectral range from 900 nm to 1600 nm in windows tunable from 50 nm\nto 700 nm. This approach enables distinguishing NIR fluorophores with emission\npeaks less than 5 nm apart. Furthermore, we demonstrate label-free\nhyperspectral NIR reflectance imaging to identify plastic polymers and to\nmonitor in vivo plant health. The approach uses the full camera resolution and\nreaches hyperspectral frame rates of 0.2 per second, limited only by the\nswitching rate of the LCVR. HyperNIR facilitates straightforward hyperspectral\nimaging with standard NIR cameras for applications in biomedical imaging and\nenvironmental monitoring.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EUY0LS7tcZnQMmJm0zJCr3yHINLYSmZIL9HPJcK3qQc","pdfSize":"9955424"}
