{"id":"2407.01342","title":"Structural and Magnetic properties of Ge0.5Mn0.5Co2O4 using neutron\n  diffraction","authors":"Pooja Jain, Benny Schundelmier, Chin-Wei Wang, Poonam Yadav, Kaya Wei,\n  N. P. Lalla, Shivani Sharma","authorsParsed":[["Jain","Pooja",""],["Schundelmier","Benny",""],["Wang","Chin-Wei",""],["Yadav","Poonam",""],["Wei","Kaya",""],["Lalla","N. P.",""],["Sharma","Shivani",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 14:50:14 GMT"}],"updateDate":"2024-07-02","timestamp":1719845414000,"abstract":"  The structural and magnetic properties of Ge0.5Mn0.5Co2O4 (GMCO) have been\ninvestigated in detail utilizing neutron powder diffraction (NPD), x-ray\ndiffraction (XRD), DC magnetometry, and heat capacity analysis and compared\nwith GeCo2O4. Despite both compounds exhibiting a cubic structure at room\ntemperature, a substantial difference on low temperature structural properties\nhave been observed for GMCO, indicating the effect of Mn substitution on\ncrystal structure. The magnetic and heat capacity data reveal a ferrimagnetic\nordering around 108 K in GMCO. A minor secondary phase is confirmed which\nundergoes long range AFM ordering at further lower temperatures. This secondary\nphase remains undetected in XRD due to identical lattice parameters.\nFurthermore, the analysis of heat capacity data indicates a broadening of the\nhigh-temperature transition, attributing to the short-range correlation\npersisting up to higher temperatures. The estimated magnetic entropy amounts is\n63% of the value expected for GMCO. The missing entropy is likely linked with\nthe short-range magnetic correlations persisting well above the transition\ntemperature. Cation distribution at the A and B sites has been estimated in\nGMCO using NPD. Magnetic structures are also confirmed in the main phase as\nwell as in the secondary phase using NPD analysis. The high-temperature\ntransition corresponds to the ferrimagnetic ordering of A and B site cations in\nthe main phase. A collinear ferrimagnetic arrangement of A and B site spins\naligned parallel to c axis is observed. The average values of A and B site\nmoments in the ferrimagnetic phase at 5 K are 2.31(3) and 1.82(3)mB,\nrespectively, with the temperature dependence of moments following the expected\npower law behavior. The low-temperature ordering is attributed to the\nantiferromagnetic ordering of B site ions associated with the secondary phase,\nsomething similar to GeCo2O4.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}