{"id":"2407.11687","title":"Observation of Aerosolization-induced Morphological Changes in Viral\n  Capsids","authors":"Abhishek Mall, Anna Munke, Zhou Shen, Parichita Mazumder, Johan\n  Bielecki, Juncheng E, Armando Estillore, Chan Kim, Romain Letrun, Jannik\n  L\\\"ubke, Safi Rafie-Zinedine, Adam Round, Ekaterina Round, Michael R\\\"utten,\n  Amit K. Samanta, Abhisakh Sarma, Tokushi Sato, Florian Schulz, Carolin\n  Seuring, Tamme Wollweber, Lena Worbs, Patrik Vagovic, Richard Bean, Adrian P.\n  Mancuso, Ne-Te Duane Loh, Tobias Beck, Jochen K\\\"upper, Filipe R.N.C. Maia,\n  Henry N. Chapman, and Kartik Ayyer","authorsParsed":[["Mall","Abhishek",""],["Munke","Anna",""],["Shen","Zhou",""],["Mazumder","Parichita",""],["Bielecki","Johan",""],["E","Juncheng",""],["Estillore","Armando",""],["Kim","Chan",""],["Letrun","Romain",""],["Lübke","Jannik",""],["Rafie-Zinedine","Safi",""],["Round","Adam",""],["Round","Ekaterina",""],["Rütten","Michael",""],["Samanta","Amit K.",""],["Sarma","Abhisakh",""],["Sato","Tokushi",""],["Schulz","Florian",""],["Seuring","Carolin",""],["Wollweber","Tamme",""],["Worbs","Lena",""],["Vagovic","Patrik",""],["Bean","Richard",""],["Mancuso","Adrian P.",""],["Loh","Ne-Te Duane",""],["Beck","Tobias",""],["Küpper","Jochen",""],["Maia","Filipe R. N. C.",""],["Chapman","Henry N.",""],["Ayyer","Kartik",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 13:04:14 GMT"}],"updateDate":"2024-07-17","timestamp":1721135054000,"abstract":"  Single-stranded RNA viruses co-assemble their capsid with the genome and\nvariations in capsid structures can have significant functional relevance. In\nparticular, viruses need to respond to a dehydrating environment to prevent\ngenomic degradation and remain active upon rehydration. Theoretical work has\npredicted low-energy buckling transitions in icosahedral capsids which could\nprotect the virus from further dehydration. However, there has been no direct\nexperimental evidence, nor molecular mechanism, for such behaviour. Here we\nobserve this transition using X-ray single particle imaging of MS2\nbacteriophages after aerosolization. Using a combination of machine learning\ntools, we classify hundreds of thousands of single particle diffraction\npatterns to learn the structural landscape of the capsid morphology as a\nfunction of time spent in the aerosol phase. We found a previously unreported\ncompact conformation as well as intermediate structures which suggest an\nincoherent buckling transition which does not preserve icosahedral symmetry.\nFinally, we propose a mechanism of this buckling, where a single 19-residue\nloop is destabilised, leading to the large observed morphology change. Our\nresults provide experimental evidence for a mechanism by which viral capsids\nprotect themselves from dehydration. In the process, these findings also\ndemonstrate the power of single particle X-ray imaging and machine learning\nmethods in studying biomolecular structural dynamics.\n","subjects":["Quantitative Biology/Biomolecules","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}