{"id":"2407.12043","title":"The Art of Saying No: Contextual Noncompliance in Language Models","authors":"Faeze Brahman, Sachin Kumar, Vidhisha Balachandran, Pradeep Dasigi,\n  Valentina Pyatkin, Abhilasha Ravichander, Sarah Wiegreffe, Nouha Dziri,\n  Khyathi Chandu, Jack Hessel, Yulia Tsvetkov, Noah A. Smith, Yejin Choi,\n  Hannaneh Hajishirzi","authorsParsed":[["Brahman","Faeze",""],["Kumar","Sachin",""],["Balachandran","Vidhisha",""],["Dasigi","Pradeep",""],["Pyatkin","Valentina",""],["Ravichander","Abhilasha",""],["Wiegreffe","Sarah",""],["Dziri","Nouha",""],["Chandu","Khyathi",""],["Hessel","Jack",""],["Tsvetkov","Yulia",""],["Smith","Noah A.",""],["Choi","Yejin",""],["Hajishirzi","Hannaneh",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 07:12:51 GMT"}],"updateDate":"2024-07-18","timestamp":1719904371000,"abstract":"  Chat-based language models are designed to be helpful, yet they should not\ncomply with every user request. While most existing work primarily focuses on\nrefusal of \"unsafe\" queries, we posit that the scope of noncompliance should be\nbroadened. We introduce a comprehensive taxonomy of contextual noncompliance\ndescribing when and how models should not comply with user requests. Our\ntaxonomy spans a wide range of categories including incomplete, unsupported,\nindeterminate, and humanizing requests (in addition to unsafe requests). To\ntest noncompliance capabilities of language models, we use this taxonomy to\ndevelop a new evaluation suite of 1000 noncompliance prompts. We find that most\nexisting models show significantly high compliance rates in certain previously\nunderstudied categories with models like GPT-4 incorrectly complying with as\nmany as 30% of requests. To address these gaps, we explore different training\nstrategies using a synthetically-generated training set of requests and\nexpected noncompliant responses. Our experiments demonstrate that while direct\nfinetuning of instruction-tuned models can lead to both over-refusal and a\ndecline in general capabilities, using parameter efficient methods like low\nrank adapters helps to strike a good balance between appropriate noncompliance\nand other capabilities.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rRu0iSOM8qPZNFJFUDLvqWFzYcjxHRY3ZcJFIxG15_U","pdfSize":"755336"}
