{"id":"2407.11340","title":"Different influence of gas accretion on the evolution of star-forming\n  and non-star-forming galaxies","authors":"Min Bao, Wenlong Zhao, Qirong Yuan","authorsParsed":[["Bao","Min",""],["Zhao","Wenlong",""],["Yuan","Qirong",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 03:14:07 GMT"}],"updateDate":"2024-07-17","timestamp":1721099647000,"abstract":"  Using integral field spectroscopic data from the Mapping Nearby Galaxies at\nApache Point Observatory survey, we investigate the spatially resolved\nproperties and empirical relations of a star-forming galaxy and a\nnon-star-forming galaxy hosting counter-rotating stellar disks (CRDs). The DESI\n$g, r, z$ color images reveal no evidence of merger remnants in either galaxy,\nsuggesting that gas accretion fuels the formation of CRDs. Based on the visible\ncounter-rotation in the stellar velocity field, we can fit a spatial boundary\nto distinguish the inner and outer regions dominated by two stellar disks in\neach galaxy. In the inner region of the star-forming CRDs, stars are\nco-rotating with ionized gas, and the stellar population is younger. Comparison\nof the star-forming main sequence relations between the inner and outer regions\nreveals enhanced star formation in the inner region. Given the abundant\npre-existing gas in the star-forming galaxy, collisions between pre-existing\nand external gas efficiently consume angular momentum, triggering star\nformation in the inner region. Conversely, in the outer region of the\nnon-star-forming CRDs, stars are co-rotating with ionized gas, and the stellar\npopulation is younger. Comparison of the stellar mass-metallicity relations\nbetween the inner and outer regions indicates enriched gas-phase metallicity in\nthe outer region. Considering the less abundant pre-existing gas in the\nnon-star-forming galaxy, external gas could preserve angular momentum, fueling\nstar formation in the outer region. Overall, gas accretion exhibits different\ninfluence on the evolution of star-forming and non-star-forming galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"T6Gzi3xFprNxzqKuo9Zib-PDQVsBC66eavoKpfRO3Zg","pdfSize":"2628534"}
