{"id":"2407.00200","title":"Formation of Wind-Fed Black Hole High-mass X-ray Binaries: The Role of\n  Roche-lobe-Overflow Post Black-Hole Formation","authors":"Zepei Xing, Tassos Fragos, Emmanouil Zapartas, Tom M. Kwan, Lixin Dai,\n  Ilya Mandel, Matthias U. Kruckow, Max Briel, Jeff J. Andrews, Simone S.\n  Bavera, Seth Gossage, Konstantinos Kovlakas, Kyle A. Rocha, Meng Sun, Philipp\n  M. Srivastava","authorsParsed":[["Xing","Zepei",""],["Fragos","Tassos",""],["Zapartas","Emmanouil",""],["Kwan","Tom M.",""],["Dai","Lixin",""],["Mandel","Ilya",""],["Kruckow","Matthias U.",""],["Briel","Max",""],["Andrews","Jeff J.",""],["Bavera","Simone S.",""],["Gossage","Seth",""],["Kovlakas","Konstantinos",""],["Rocha","Kyle A.",""],["Sun","Meng",""],["Srivastava","Philipp M.",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 19:12:46 GMT"}],"updateDate":"2024-07-02","timestamp":1719601966000,"abstract":"  The three dynamically confirmed wind-fed black hole high-mass X-ray binaries\n(BH-HMXBs) are suggested to all contain a highly spinning black hole (BH).\nHowever, based on the theories of efficient angular momentum transport inside\nthe stars, we expect that the first-born BHs in binary systems should have low\nspins, which is consistent with gravitational-wave observations. As a result,\nthe origin of the high BH spins measured in wind-fed BH-HMXBs remains a\nmystery. In this paper, we conduct a binary population synthesis study on\nwind-fed BH-HMXBs at solar metallicity with the use of the newly developed code\nPOSYDON, considering three scenarios for BH accretion: Eddington-limited,\nmoderately super-Eddington, and fully conservative accretion. Taking into\naccount the conditions for accretion-disk formation, we find that regardless of\nthe accretion model, these systems are more likely to have already experienced\na phase of Roche-lobe overflow after the BH formation. To account for the\nextreme BH spins, highly conservative accretion onto BHs is required, when\nassuming the accreted material carries the specific angular momentum at the\ninnermost stable orbit. Besides, in our simulations we found that the systems\nwith donor stars within the mass range of $10-20\\,M_{\\odot}$ are prevalent,\nposing a challenge in explaining simultaneously all observed properties of the\nBH-HMXB in our Galaxy, Cygnus X-1, and potentially hinting that the accretion\nefficiency onto non-degenerate stars, before the formation of the BH, is also\nmore conservative than assumed in our simulations.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"I6wN_ZJCAF4yxFBM3LctHRvtRYNanLGBLg8CzS06NKc","pdfSize":"4252265"}
