{"id":"2407.01791","title":"{\\mu}-Bench: A Vision-Language Benchmark for Microscopy Understanding","authors":"Alejandro Lozano, Jeffrey Nirschl, James Burgess, Sanket Rajan Gupte,\n  Yuhui Zhang, Alyssa Unell, Serena Yeung-Levy","authorsParsed":[["Lozano","Alejandro",""],["Nirschl","Jeffrey",""],["Burgess","James",""],["Gupte","Sanket Rajan",""],["Zhang","Yuhui",""],["Unell","Alyssa",""],["Yeung-Levy","Serena",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 20:30:26 GMT"}],"updateDate":"2024-07-03","timestamp":1719865826000,"abstract":"  Recent advances in microscopy have enabled the rapid generation of terabytes\nof image data in cell biology and biomedical research. Vision-language models\n(VLMs) offer a promising solution for large-scale biological image analysis,\nenhancing researchers' efficiency, identifying new image biomarkers, and\naccelerating hypothesis generation and scientific discovery. However, there is\na lack of standardized, diverse, and large-scale vision-language benchmarks to\nevaluate VLMs' perception and cognition capabilities in biological image\nunderstanding. To address this gap, we introduce {\\mu}-Bench, an expert-curated\nbenchmark encompassing 22 biomedical tasks across various scientific\ndisciplines (biology, pathology), microscopy modalities (electron,\nfluorescence, light), scales (subcellular, cellular, tissue), and organisms in\nboth normal and abnormal states. We evaluate state-of-the-art biomedical,\npathology, and general VLMs on {\\mu}-Bench and find that: i) current models\nstruggle on all categories, even for basic tasks such as distinguishing\nmicroscopy modalities; ii) current specialist models fine-tuned on biomedical\ndata often perform worse than generalist models; iii) fine-tuning in specific\nmicroscopy domains can cause catastrophic forgetting, eroding prior biomedical\nknowledge encoded in their base model. iv) weight interpolation between\nfine-tuned and pre-trained models offers one solution to forgetting and\nimproves general performance across biomedical tasks. We release {\\mu}-Bench\nunder a permissive license to accelerate the research and development of\nmicroscopy foundation models.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fDCKB9n2vJEWUHk_djAQByuO0aoi85eycRQIpnvInKw","pdfSize":"31931719"}
