{"id":"2407.17808","title":"Dissipative Quintessential Cosmic Inflation","authors":"Kourosh Nozari, Fateme Rajabi and Narges Rashidi","authorsParsed":[["Nozari","Kourosh",""],["Rajabi","Fateme",""],["Rashidi","Narges",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 06:34:48 GMT"}],"updateDate":"2024-07-26","timestamp":1721889288000,"abstract":"  In this paper we construct a dissipative quintessential cosmic inflation. For\nthis purpose, we add a multiplicative dissipative term in the standard\nquintessence field Lagrangian. We consider the specific form of dissipation as\nthe time integral including the Hubble parameter and an arbitrary function that\ndescribes the dissipative properties of the quintessential scalar field.\nInflation parameters and observables are calculated under slow-roll\napproximations and a detailed calculation of the cosmological perturbations is\nperformed in this setup. We consider different forms of potentials and\ncalculate the scalar spectral index and tensor-to-scalar ratio for a constant\nas well as variable dissipation function. To check the reliability of this\nmodel, a numerical analysis on the model parameters space is done in\nconfrontation with recent observational data. By comparing the results with\nobservational joint datasets at 68% and 95% confidence levels, we obtain some\nconstraints on the model parameters space, specially the dissipation factor\nwith e-folds numbers N = 55 and N = 60. As some specific results, we show that\nthe power-law potential with a constant dissipation factor and N = 60 is mildly\nconsistent with observational data in some restricted domains of the model\nparameter space with very small and negative dissipation factor and a\nnegligible tensor-toscalar ratio. But this case with N = 55 is consistent with\nobservation considerably. For power-law potential and variable dissipation\nfactor as $Q = {\\alpha}\\phi^n$, the consistency with observation is also\nconsiderable with a reliable tensor-to-scalar ratio. The quadratic and quartic\npotentials with variable dissipation function as $Q = {\\alpha}\\phi^n$ are\nconsistent with Planck2018 TT, TE, EE+lowE+lensing data at the 68% and 95%\nlevels of confidence for some intervals of the parameter n.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"mPqKU30YB3xCHNFNoj10eRnVTIWf6f2q8LEBktMLDA8","pdfSize":"3165170"}
