{"id":"2407.11051","title":"Exploring the 6G Potentials: Immersive, Hyper Reliable, and Low-Latency\n  Communication","authors":"Afsoon Alidadi Shamsabadi, Animesh Yadav, Yasser Gadallah, and Halim\n  Yanikomeroglu","authorsParsed":[["Shamsabadi","Afsoon Alidadi",""],["Yadav","Animesh",""],["Gadallah","Yasser",""],["Yanikomeroglu","Halim",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 06:10:59 GMT"}],"updateDate":"2024-07-17","timestamp":1720505459000,"abstract":"  The transition towards the sixth-generation (6G) wireless telecommunications\nnetworks introduces significant challenges for researchers and industry\nstakeholders. The 6G technology aims to enhance existing usage scenarios,\nparticularly supporting innovative applications requiring stringent performance\nmetrics. Among the key performance indicators (KPIs) for 6G, immersive\nthroughput, hyper-reliability, and hyper-low latency must be achieved\nsimultaneously in some critical applications to achieve the application\nrequirements. However, this is challenging due to the conflicting nature of\nthese KPIs. This article proposes a new service class of 6G as immersive, hyper\nreliable, and low-latency communication (IHRLLC), and introduces a potential\nnetwork architecture to achieve the associated KPIs. Specifically, technologies\nsuch as ultra-massive multiple-input multiple-output (umMIMO)-aided terahertz\n(THz) communications, and reconfigurable intelligent surfaces (RIS) are viewed\nas the key enablers for achieving immersive data rate and hyper reliability.\nGiven the computational complexity involved in employing these technologies,\nand the challenges encountered in designing real-time algorithms for efficient\nresource allocation and management strategies as well as dynamic beamforming\nand tracking techniques, we also propose the involvement of other potential\nenabling technologies such as non-terrestrial networks (NTN), learn-to-optimize\n(L2O) and generative-AI (GenAI) technologies, quantum computing, and network\ndigital twin (NDT) for limiting the latency.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}