{"id":"2407.07604","title":"H-FCBFormer Hierarchical Fully Convolutional Branch Transformer for\n  Occlusal Contact Segmentation with Articulating Paper","authors":"Ryan Banks, Bernat Rovira-Lastra, Jordi Martinez-Gomis, Akhilanand\n  Chaurasia, Yunpeng Li","authorsParsed":[["Banks","Ryan",""],["Rovira-Lastra","Bernat",""],["Martinez-Gomis","Jordi",""],["Chaurasia","Akhilanand",""],["Li","Yunpeng",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 12:42:39 GMT"}],"updateDate":"2024-08-02","timestamp":1720615359000,"abstract":"  Occlusal contacts are the locations at which the occluding surfaces of the\nmaxilla and the mandible posterior teeth meet. Occlusal contact detection is a\nvital tool for restoring the loss of masticatory function and is a mandatory\nassessment in the field of dentistry, with particular importance in\nprosthodontics and restorative dentistry. The most common method for occlusal\ncontact detection is articulating paper. However, this method can indicate\nsignificant medically false positive and medically false negative contact\nareas, leaving the identification of true occlusal indications to clinicians.\nTo address this, we propose a multiclass Vision Transformer and Fully\nConvolutional Network ensemble semantic segmentation model with a combination\nhierarchical loss function, which we name as Hierarchical Fully Convolutional\nBranch Transformer (H-FCBFormer). We also propose a method of generating\nmedically true positive semantic segmentation masks derived from expert\nannotated articulating paper masks and gold standard masks. The proposed model\noutperforms other machine learning methods evaluated at detecting medically\ntrue positive contacts and performs better than dentists in terms of accurately\nidentifying object-wise occlusal contact areas while taking significantly less\ntime to identify them. Code is available at\nhttps://github.com/Banksylel/H-FCBFormer.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}