{"id":"2407.09196","title":"Testing volume integrals of travel-time sensitivity kernels for flows","authors":"Michal Svanda (1 and 2), Daniel Chmurny (1) ((1) Astronomical\n  Institute, Charles University, Prague, Czech Republic (2) Astronomical\n  Institute, Academy of Sciences of the Czech Republic, Ondrejov, Czech\n  Republic)","authorsParsed":[["Svanda","Michal","","1 and 2"],["Chmurny","Daniel",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 11:52:43 GMT"}],"updateDate":"2024-07-15","timestamp":1720785163000,"abstract":"  Context: Helioseismic inversions rely largely on sensitivity kernels, 3-D\nspatial functions describing how do the changes in the solar interior translate\ninto the changes of helioseismic observables. These sensitivity kernels come in\nmost cases from the forward modelling utilising state-of-the-art solar models.\n  Aims: We aim to test the sensitivity kernels by comparing their volume\nintegrals with measured values from helioseismic travel times.\n  Methods: By manipulating the tracking rate, we mimic the additional zonal\nvelocity present in the Dopplergram datacubes. These datacubes are then\nprocessed by a standard travel-time measurements pipeline. We investigate the\ndependence of the east--west travel time averaged over a box around the disc\ncentre on the implanted tracking velocity. The slope of this dependence is\ndirectly proportional to the total volume integral of the sensitivity kernel\ncorresponding to the used travel-time geometry.\n  Results: We find a very good to acceptable agreement between measurements and\nmodels for travel times with ridge filtering applied. The sought dependence\nindeed resembles a linear function and the slope of it agrees with the expected\nvolume integral from the forward-modelled sensitivity kernel. The agreement is\nless optimistic for the phase-speed filtered datacubes. A disagreement is\nparticularly large for smallest phase speeds (filters td1--td4), for the larger\nphase speeds, our result indicate that the measured kernel integrals are\nsystematically larger than expected from the forward modelling. We admit that\nfor large phase-speeds and higher radial modes our testing procedure does not\nhave to be appropriate.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0L5Yi6J0mP1lH7cf3zX6wATAKZQ7-KJiHgumDT9Xprs","pdfSize":"1863484"}
