{"id":"2407.17756","title":"Preliminary Results of Neuromorphic Controller Design and a Parkinson's\n  Disease Dataset Building for Closed-Loop Deep Brain Stimulation","authors":"Ananna Biswas, Hongyu An","authorsParsed":[["Biswas","Ananna",""],["An","Hongyu",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 04:10:15 GMT"}],"updateDate":"2024-07-26","timestamp":1721880615000,"abstract":"  Parkinson's Disease afflicts millions of individuals globally. Emerging as a\npromising brain rehabilitation therapy for Parkinson's Disease, Closed-loop\nDeep Brain Stimulation (CL-DBS) aims to alleviate motor symptoms. The CL-DBS\nsystem comprises an implanted battery-powered medical device in the chest that\nsends stimulation signals to the brains of patients. These electrical\nstimulation signals are delivered to targeted brain regions via electrodes,\nwith the magnitude of stimuli adjustable. However, current CL-DBS systems\nutilize energy-inefficient approaches, including reinforcement learning, fuzzy\ninterface, and field-programmable gate array (FPGA), among others. These\napproaches make the traditional CL-DBS system impractical for implanted and\nwearable medical devices. This research proposes a novel neuromorphic approach\nthat builds upon Leaky Integrate and Fire neuron (LIF) controllers to adjust\nthe magnitude of DBS electric signals according to the various severities of PD\npatients. Our neuromorphic controllers, on-off LIF controller, and dual LIF\ncontroller, successfully reduced the power consumption of CL-DBS systems by 19%\nand 56%, respectively. Meanwhile, the suppression efficiency increased by 4.7%\nand 6.77%. Additionally, to address the data scarcity of Parkinson's Disease\nsymptoms, we built Parkinson's Disease datasets that include the raw neural\nactivities from the subthalamic nucleus at beta oscillations, which are typical\nphysiological biomarkers for Parkinson's Disease.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"hvwtEqXxzY4Y_sn6D06HvsohSgbwd79htrccBDQWLEY","pdfSize":"686845"}
