{"id":"2407.11225","title":"(De)Noise: Moderating the Inconsistency Between Human Decision-Makers","authors":"Nina Grgi\\'c-Hla\\v{c}a, Junaid Ali, Krishna P. Gummadi, Jennifer\n  Wortman Vaughan","authorsParsed":[["Grgić-Hlača","Nina",""],["Ali","Junaid",""],["Gummadi","Krishna P.",""],["Vaughan","Jennifer Wortman",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 20:24:36 GMT"}],"updateDate":"2024-07-17","timestamp":1721075076000,"abstract":"  Prior research in psychology has found that people's decisions are often\ninconsistent. An individual's decisions vary across time, and decisions vary\neven more across people. Inconsistencies have been identified not only in\nsubjective matters, like matters of taste, but also in settings one might\nexpect to be more objective, such as sentencing, job performance evaluations,\nor real estate appraisals. In our study, we explore whether algorithmic\ndecision aids can be used to moderate the degree of inconsistency in human\ndecision-making in the context of real estate appraisal. In a large-scale\nhuman-subject experiment, we study how different forms of algorithmic\nassistance influence the way that people review and update their estimates of\nreal estate prices. We find that both (i) asking respondents to review their\nestimates in a series of algorithmically chosen pairwise comparisons and (ii)\nproviding respondents with traditional machine advice are effective strategies\nfor influencing human responses. Compared to simply reviewing initial estimates\none by one, the aforementioned strategies lead to (i) a higher propensity to\nupdate initial estimates, (ii) a higher accuracy of post-review estimates, and\n(iii) a higher degree of consistency between the post-review estimates of\ndifferent respondents. While these effects are more pronounced with traditional\nmachine advice, the approach of reviewing algorithmically chosen pairs can be\nimplemented in a wider range of settings, since it does not require access to\nground truth data.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}