{"id":"2407.20656","title":"Efficient Multi-Objective Neural Architecture Search via Pareto\n  Dominance-based Novelty Search","authors":"An Vo, Ngoc Hoang Luong","authorsParsed":[["Vo","An",""],["Luong","Ngoc Hoang",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 08:52:10 GMT"}],"updateDate":"2024-08-01","timestamp":1722329530000,"abstract":"  Neural Architecture Search (NAS) aims to automate the discovery of\nhigh-performing deep neural network architectures. Traditional objective-based\nNAS approaches typically optimize a certain performance metric (e.g.,\nprediction accuracy), overlooking large parts of the architecture search space\nthat potentially contain interesting network configurations. Furthermore,\nobjective-driven population-based metaheuristics in complex search spaces often\nquickly exhaust population diversity and succumb to premature convergence to\nlocal optima. This issue becomes more complicated in NAS when performance\nobjectives do not fully align with the actual performance of the candidate\narchitectures, as is often the case with training-free metrics. While\ntraining-free metrics have gained popularity for their rapid performance\nestimation of candidate architectures without incurring computation-heavy\nnetwork training, their effective incorporation into NAS remains a challenge.\nThis paper presents the Pareto Dominance-based Novelty Search for\nmulti-objective NAS with Multiple Training-Free metrics (MTF-PDNS). Unlike\nconventional NAS methods that optimize explicit objectives, MTF-PDNS promotes\npopulation diversity by utilizing a novelty score calculated based on multiple\ntraining-free performance and complexity metrics, thereby yielding a broader\nexploration of the search space. Experimental results on standard NAS benchmark\nsuites demonstrate that MTF-PDNS outperforms conventional methods driven by\nexplicit objectives in terms of convergence speed, diversity maintenance,\narchitecture transferability, and computational costs.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mUu7fj9uMJezsBO9FvyqroNb1vYBobS7pIDc83Mb78I","pdfSize":"3698992"}
