{"id":"2407.04211","title":"TimeLDM: Latent Diffusion Model for Unconditional Time Series Generation","authors":"Jian Qian, Bingyu Xie, Biao Wan, Minhao Li, Miao Sun, Patrick Yin\n  Chiang","authorsParsed":[["Qian","Jian",""],["Xie","Bingyu",""],["Wan","Biao",""],["Li","Minhao",""],["Sun","Miao",""],["Chiang","Patrick Yin",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 01:47:20 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 03:58:20 GMT"}],"updateDate":"2024-09-16","timestamp":1720144040000,"abstract":"  Time series generation is a crucial research topic in the area of\ndecision-making systems, which can be particularly important in domains like\nautonomous driving, healthcare, and, notably, robotics. Recent approaches focus\non learning in the data space to model time series information. However, the\ndata space often contains limited observations and noisy features. In this\npaper, we propose TimeLDM, a novel latent diffusion model for high-quality time\nseries generation. TimeLDM is composed of a variational autoencoder that\nencodes time series into an informative and smoothed latent content and a\nlatent diffusion model operating in the latent space to generate latent\ninformation. We evaluate the ability of our method to generate synthetic time\nseries with simulated and real-world datasets and benchmark the performance\nagainst existing state-of-the-art methods. Qualitatively and quantitatively, we\nfind that the proposed TimeLDM persistently delivers high-quality generated\ntime series. For example, TimeLDM achieves new state-of-the-art results on the\nsimulated benchmarks and an average improvement of 55% in Discriminative score\nwith all benchmarks. Further studies demonstrate that our method yields more\nrobust outcomes across various lengths of time series data generation.\nEspecially, for the Context-FID score and Discriminative score, TimeLDM\nrealizes significant improvements of 80% and 50%, respectively. The code will\nbe released after publication.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}