{"id":"2407.14005","title":"The impact of the microvascular resistance on the measures of stenosis\n  severity","authors":"Tam Atkins, Navid Freidoonimehr, John Beltrame, Christopher Zeitz and\n  Maziar Arjomandi","authorsParsed":[["Atkins","Tam",""],["Freidoonimehr","Navid",""],["Beltrame","John",""],["Zeitz","Christopher",""],["Arjomandi","Maziar",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 03:34:16 GMT"}],"updateDate":"2024-07-22","timestamp":1721360056000,"abstract":"  The relationship between measures of stenosis and microvascular resistance is\nof importance due to medical decisions being based on these values. This\nresearch investigates the impact of varying microvascular resistance on\nfractional flow reserve (FFR) and hyperaemic stenosis resistance (hSR).\nMicrovascular resistance is classified using hyperaemic microvascular\nresistance (hMR). Additionally, hMR using the upstream pressure value (hMRPa)\nhas also been calculated and is compared to hMR measured conventionally. Tests\nwere conducted at three different degrees of stenosis (quantified by percent\narea) in a coronary flow circuit with varying downstream resistance to simulate\nthe microvasculature. Pressure and flow values are recorded across the stenosed\nsection, allowing for calculation of the diagnostic indexes. Results indicate\nthat for a constant degree of stenosis, FFR would increase with increasing\nmicrovascular resistance while hSR would remain almost constant. hMRPa was\nfound to approach hMR as the stenosis severity decreased, and the pressure\ngradient decreased. In the results shown here, with sufficiently high\ndownstream resistance, an 84% stenosis could produce an FFR value over 0.8.\nThis result suggests that there is the potential for misdiagnosis of the\nseverity of stenosis when combined with elevated microvascular resistance.\nConsequently, decisions on the clinical significance of a stenosis, classified\nby FFR, need to consider the effect of the microvascular resistance.\n","subjects":["Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}