{"id":"2407.00788","title":"InstantStyle-Plus: Style Transfer with Content-Preserving in\n  Text-to-Image Generation","authors":"Haofan Wang, Peng Xing, Renyuan Huang, Hao Ai, Qixun Wang and Xu Bai","authorsParsed":[["Wang","Haofan",""],["Xing","Peng",""],["Huang","Renyuan",""],["Ai","Hao",""],["Wang","Qixun",""],["Bai","Xu",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 18:05:33 GMT"}],"updateDate":"2024-07-02","timestamp":1719770733000,"abstract":"  Style transfer is an inventive process designed to create an image that\nmaintains the essence of the original while embracing the visual style of\nanother. Although diffusion models have demonstrated impressive generative\npower in personalized subject-driven or style-driven applications, existing\nstate-of-the-art methods still encounter difficulties in achieving a seamless\nbalance between content preservation and style enhancement. For example,\namplifying the style's influence can often undermine the structural integrity\nof the content. To address these challenges, we deconstruct the style transfer\ntask into three core elements: 1) Style, focusing on the image's aesthetic\ncharacteristics; 2) Spatial Structure, concerning the geometric arrangement and\ncomposition of visual elements; and 3) Semantic Content, which captures the\nconceptual meaning of the image. Guided by these principles, we introduce\nInstantStyle-Plus, an approach that prioritizes the integrity of the original\ncontent while seamlessly integrating the target style. Specifically, our method\naccomplishes style injection through an efficient, lightweight process,\nutilizing the cutting-edge InstantStyle framework. To reinforce the content\npreservation, we initiate the process with an inverted content latent noise and\na versatile plug-and-play tile ControlNet for preserving the original image's\nintrinsic layout. We also incorporate a global semantic adapter to enhance the\nsemantic content's fidelity. To safeguard against the dilution of style\ninformation, a style extractor is employed as discriminator for providing\nsupplementary style guidance. Codes will be available at\nhttps://github.com/instantX-research/InstantStyle-Plus.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}