{"id":"2407.09550","title":"CAPM: Fast and Robust Verification on Maxpool-based CNN via Dual Network","authors":"Jia-Hau Bai, Chi-Ting Liu, Yu Wang, Fu-Chieh Chang, Pei-Yuan Wu","authorsParsed":[["Bai","Jia-Hau",""],["Liu","Chi-Ting",""],["Wang","Yu",""],["Chang","Fu-Chieh",""],["Wu","Pei-Yuan",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 14:43:06 GMT"}],"updateDate":"2024-07-16","timestamp":1719499386000,"abstract":"  This study uses CAPM (Convex Adversarial Polytope for Maxpool-based CNN) to\nimprove the verified bound for general purpose maxpool-based convolutional\nneural networks (CNNs) under bounded norm adversarial perturbations. The\nmaxpool function is decomposed as a series of ReLU functions to extend the\nconvex relaxation technique to maxpool functions, by which the verified bound\ncan be efficiently computed through a dual network. The experimental results\ndemonstrate that this technique allows the state-of-the-art verification\nprecision for maxpool-based CNNs and involves a much lower computational cost\nthan current verification methods, such as DeepZ, DeepPoly and PRIMA. This\nmethod is also applicable to large-scale CNNs, which previous studies show to\nbe often computationally prohibitively expensive. Under certain circumstances,\nCAPM is 40-times, 20-times or twice as fast and give a significantly higher\nverification bound (CAPM 98% vs. PRIMA 76%/DeepPoly 73%/DeepZ 8%) as compared\nto PRIMA/DeepPoly/DeepZ. Furthermore, we additionally present the time\ncomplexity of our algorithm as $O(W^2NK)$, where $W$ is the maximum width of\nthe neural network, $N$ is the number of neurons, and $K$ is the size of the\nmaxpool layer's kernel.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VS3bp7JGKwdcwRVpkEUTGgWoPaQhDuw9aM8fZzxoemA","pdfSize":"8497548"}
