{"id":"2407.00249","title":"Efficient state preparation for the quantum simulation of molecules in\n  first quantization","authors":"William J. Huggins, Oskar Leimkuhler, Torin F. Stetina, K. Birgitta\n  Whaley","authorsParsed":[["Huggins","William J.",""],["Leimkuhler","Oskar",""],["Stetina","Torin F.",""],["Whaley","K. Birgitta",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 22:46:01 GMT"}],"updateDate":"2024-07-02","timestamp":1719614761000,"abstract":"  The quantum simulation of real molecules and materials is one of the most\nhighly anticipated applications of quantum computing. Algorithms for simulating\nelectronic structure using a first-quantized plane wave representation are\nespecially promising due to their asymptotic efficiency. However, previous\nproposals for preparing initial states for these simulation algorithms scale\npoorly with the size of the basis set. We address this shortcoming by showing\nhow to efficiently map states defined in a Gaussian type orbital basis to a\nplane wave basis with a scaling that is logarithmic in the number of plane\nwaves. Our key technical result is a proof that molecular orbitals constructed\nfrom Gaussian type basis functions can be compactly represented in a plane wave\nbasis using matrix product states. While we expect that other approaches could\nachieve the same logarithmic scaling with respect to basis set size, our\nproposed state preparation technique is also highly efficient in practice. For\nexample, in a series of numerical experiments on small molecules, we find that\nour approach allows us to prepare an approximation to the Hartree-Fock state\nusing orders of magnitude fewer non-Clifford gates than a naive approach. By\nresolving the issue of state preparation, our work allows for the first quantum\nsimulation of molecular systems whose end-to-end complexity is truly sublinear\nin the basis set size.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}