{"id":"2407.09161","title":"Encoding arbitrary Ising Hamiltonians on Spatial Photonic Ising Machines","authors":"Jason Sakellariou, Alexis Askitopoulos, Georgios Pastras, Symeon I.\n  Tsintzos","authorsParsed":[["Sakellariou","Jason",""],["Askitopoulos","Alexis",""],["Pastras","Georgios",""],["Tsintzos","Symeon I.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 10:54:07 GMT"}],"updateDate":"2024-07-16","timestamp":1720781647000,"abstract":"  Photonic Ising Machines constitute an emergent new paradigm of computation,\ngeared towards tackling combinatorial optimization problems that can be reduced\nto the problem of finding the ground state of an Ising model. Spatial Photonic\nIsing Machines have proven to be advantageous for simulating fully connected\nlarge-scale spin systems. However, fine control of a general interaction matrix\n$J$ has so far only been accomplished through eigenvalue decomposition methods\nthat either limit the scalability or increase the execution time of the\noptimization process. We introduce and experimentally validate a SPIM instance\nthat enables direct control over the full interaction matrix, enabling the\nencoding of Ising Hamiltonians with arbitrary couplings and connectivity. We\ndemonstrate the conformity of the experimentally measured Ising energy with the\ntheoretically expected values and then proceed to solve both the unweighted and\nweighted graph partitioning problems, showcasing a systematic convergence to an\noptimal solution via simulated annealing. Our approach greatly expands the\napplicability of SPIMs for real-world applications without sacrificing any of\nthe inherent advantages of the system, and paves the way to encoding the full\nrange of NP problems that are known to be equivalent to Ising models, on SPIM\ndevices.\n","subjects":["Physics/Optics","Condensed Matter/Disordered Systems and Neural Networks","Computing Research Repository/Emerging Technologies","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"LCn1oL-eYhHhmtQH9t4_422qOqDV5px53y-6UnItZ2I","pdfSize":"1217503"}
