{"id":"2407.02964","title":"FSM: A Finite State Machine Based Zero-Shot Prompting Paradigm for\n  Multi-Hop Question Answering","authors":"Xiaochen Wang, Junqing He, Zhe yang, Yiru Wang, Xiangdi Meng, Kunhao\n  Pan, Zhifang Sui","authorsParsed":[["Wang","Xiaochen",""],["He","Junqing",""],["yang","Zhe",""],["Wang","Yiru",""],["Meng","Xiangdi",""],["Pan","Kunhao",""],["Sui","Zhifang",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 10:01:01 GMT"}],"updateDate":"2024-07-04","timestamp":1720000861000,"abstract":"  Large Language Models (LLMs) with chain-of-thought (COT) prompting have\ndemonstrated impressive abilities on simple nature language inference tasks.\nHowever, they tend to perform poorly on Multi-hop Question Answering (MHQA)\ntasks due to several challenges, including hallucination, error propagation and\nlimited context length. We propose a prompting method, Finite State Machine\n(FSM) to enhance the reasoning capabilities of LLM for complex tasks in\naddition to improved effectiveness and trustworthiness. Different from COT\nmethods, FSM addresses MHQA by iteratively decomposing a question into\nmulti-turn sub-questions, and self-correcting in time, improving the accuracy\nof answers in each step. Specifically, FSM addresses one sub-question at a time\nand decides on the next step based on its current result and state, in an\nautomaton-like format. Experiments on benchmarks show the effectiveness of our\nmethod. Although our method performs on par with the baseline on relatively\nsimpler datasets, it excels on challenging datasets like Musique. Moreover,\nthis approach mitigates the hallucination phenomenon, wherein the correct final\nanswer can be recovered despite errors in intermediate reasoning. Furthermore,\nour method improves LLMs' ability to follow specified output format\nrequirements, significantly reducing the difficulty of answer interpretation\nand the need for reformatting.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}