{"id":"2407.12979","title":"Leveraging Environment Interaction for Automated PDDL Generation and\n  Planning with Large Language Models","authors":"Sadegh Mahdavi, Raquel Aoki, Keyi Tang, Yanshuai Cao","authorsParsed":[["Mahdavi","Sadegh",""],["Aoki","Raquel",""],["Tang","Keyi",""],["Cao","Yanshuai",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 19:50:51 GMT"}],"updateDate":"2024-07-19","timestamp":1721245851000,"abstract":"  Large Language Models (LLMs) have shown remarkable performance in various\nnatural language tasks, but they often struggle with planning problems that\nrequire structured reasoning. To address this limitation, the conversion of\nplanning problems into the Planning Domain Definition Language (PDDL) has been\nproposed as a potential solution, enabling the use of automated planners.\nHowever, generating accurate PDDL files typically demands human inputs or\ncorrection, which can be time-consuming and costly. In this paper, we propose a\nnovel approach that leverages LLMs and environment feedback to automatically\ngenerate PDDL domain and problem description files without the need for human\nintervention. Our method introduces an iterative refinement process that\ngenerates multiple problem PDDL candidates and progressively refines the domain\nPDDL based on feedback obtained from interacting with the environment. To guide\nthe refinement process, we develop an Exploration Walk (EW) metric, which\nprovides rich feedback signals for LLMs to update the PDDL file. We evaluate\nour approach on PDDL environments. We achieve an average task solve rate of 66%\ncompared to a 29% solve rate by GPT-4's intrinsic planning with\nchain-of-thought prompting. Our work enables the automated modeling of planning\nenvironments using LLMs and environment feedback, eliminating the need for\nhuman intervention in the PDDL generation process and paving the way for more\nreliable LLM agents in challenging problems.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}