{"id":"2407.08251","title":"Determination of five-parameter grain boundary characteristics in\n  nanocrystalline Ni-W by Scanning Precession Electron Diffraction Tomography","authors":"E.F. Rauch (SIMaP), Patrick Harrison (SIMaP), Saurabh Mohan Das,\n  William Goncalves (MATEIS), Alessandra Da Silva, Xinren Chen, Nicola Vigan\\`o\n  (MATEIS, ESRF), Christian H. Liebscher, Wolfgang Ludwig (MATEIS), Xuyang Zhou","authorsParsed":[["Rauch","E. F.","","SIMaP"],["Harrison","Patrick","","SIMaP"],["Das","Saurabh Mohan","","MATEIS"],["Goncalves","William","","MATEIS"],["Da Silva","Alessandra","","MATEIS, ESRF"],["Chen","Xinren","","MATEIS, ESRF"],["Viganò","Nicola","","MATEIS, ESRF"],["Liebscher","Christian H.","","MATEIS"],["Ludwig","Wolfgang","","MATEIS"],["Zhou","Xuyang",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 07:53:36 GMT"}],"updateDate":"2024-07-12","timestamp":1720684416000,"abstract":"  Determining the full five-parameter grain boundary characteristics from\nexperiments is essential for understanding grain boundaries impact on material\nproperties, improving related models, and designing advanced alloys. However,\nachieving this is generally challenging, in particular at nanoscale, due to\ntheir 3D nature. In our study, we successfully determined the grain boundary\ncharacteristics of an annealed nickel-tungsten alloy (NiW) nanocrystalline\nneedle-shaped specimen (tip) containing twins using Scanning Precession\nElectron Diffraction (SPED) Tomography. The presence of annealing twins in this\nface-centered cubic (fcc) material gives rise to common reflections in the SPED\ndiffraction patterns, which challenges the reconstruction of\norientation-specific virtual dark field (VDF) images required for tomographic\nreconstruction of the 3D grain shapes. To address this, an automated\npost-processing step identifies and deselects these shared reflections prior to\nthe reconstruction of the VDF images. Combined with appropriate intensity\nnormalization and projection alignment procedures, this approach enables\nhigh-fidelity 3D reconstruction of the individual grains contained in the\nneedle-shaped sample volume. To probe the accuracy of the resulting boundary\ncharacteristics, the twin boundary surface normal directions were extracted\nfrom the 3D voxelated grain boundary map using a 3D Hough transform. For the\nsub-set of coherent Sigma 3 boundaries, the expected {111} grain boundary plane\nnormals were obtained with an angular error of less than 3{\\textdegree} for\nboundary sizes down to 400 nm${}^2$. This work advances our ability to\nprecisely characterize and understand the complex grain boundaries that govern\nmaterial properties.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}