{"id":"2407.01220","title":"Fast and Efficient: Mask Neural Fields for 3D Scene Segmentation","authors":"Zihan Gao, Lingling Li, Licheng Jiao, Fang Liu, Xu Liu, Wenping Ma,\n  Yuwei Guo, Shuyuan Yang","authorsParsed":[["Gao","Zihan",""],["Li","Lingling",""],["Jiao","Licheng",""],["Liu","Fang",""],["Liu","Xu",""],["Ma","Wenping",""],["Guo","Yuwei",""],["Yang","Shuyuan",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 12:07:26 GMT"}],"updateDate":"2024-07-02","timestamp":1719835646000,"abstract":"  Understanding 3D scenes is a crucial challenge in computer vision research\nwith applications spanning multiple domains. Recent advancements in distilling\n2D vision-language foundation models into neural fields, like NeRF and 3DGS,\nenables open-vocabulary segmentation of 3D scenes from 2D multi-view images\nwithout the need for precise 3D annotations. While effective, however, the\nper-pixel distillation of high-dimensional CLIP features introduces ambiguity\nand necessitates complex regularization strategies, adding inefficiencies\nduring training. This paper presents MaskField, which enables fast and\nefficient 3D open-vocabulary segmentation with neural fields under weak\nsupervision. Unlike previous methods, MaskField distills masks rather than\ndense high-dimensional CLIP features. MaskFields employ neural fields as binary\nmask generators and supervise them with masks generated by SAM and classified\nby coarse CLIP features. MaskField overcomes the ambiguous object boundaries by\nnaturally introducing SAM segmented object shapes without extra regularization\nduring training. By circumventing the direct handling of high-dimensional CLIP\nfeatures during training, MaskField is particularly compatible with explicit\nscene representations like 3DGS. Our extensive experiments show that MaskField\nnot only surpasses prior state-of-the-art methods but also achieves remarkably\nfast convergence, outperforming previous methods with just 5 minutes of\ntraining. We hope that MaskField will inspire further exploration into how\nneural fields can be trained to comprehend 3D scenes from 2D models.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}