{"id":"2407.10265","title":"Unraveling the birthplaces of NGC2070's massive stars, tracked with MUSE\n  and revealed with JWST","authors":"N. Castro (1 and 2) ((1) Leibniz-Institut f\\\"ur Astrophysik Potsdam,\n  (2) Georg-August-Universit\\\"at G\\\"ottingen)","authorsParsed":[["Castro","N.","","1 and 2"]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 16:14:35 GMT"}],"updateDate":"2024-07-16","timestamp":1720973675000,"abstract":"  The formation of massive O-type stars cannot be simply explained as a\nscaled-up version of the accretion mechanisms observed in lower-mass stars.\nUnderstanding these processes necessitates systematic studies of their early\nstages. Forming massive stars remain embedded in their dense nursery clouds,\nand IR instruments with high spatial resolution capabilities are needed to\nbetter observe them. Despite these challenges, MUSE optical observations of the\nmassive cluster NGC 2070 successfully detected potential star-forming regions\nthrough spatially resolved electron density maps. To further explore these\nregions, the JWST utilized its NIRCam and MIRI instruments to penetrate\noptically obscured areas. This study examines two specific regions in the\nsoutheast part of the NGC 2070 MUSE density map, where tracks of highly dense\npoint sources were identified. NIRCam, partially overlapped with MIRI, resolved\nthese MUSE findings, revealing a procession of stellar point sources in the\nprojected images. The detections are associated with elongated clouds,\nsuggesting greater proper motions compared to the surrounding interstellar\nmedium. These findings may indicate the presence of runaway candidates in the\nearly stages of their evolution that are following common escape routes. This\nwould support the notion that dynamical ejection is an efficient mechanism for\nthe formation of massive runaway stars during early stages and likely plays a\nsignificant role in the origin of O-type field stars. However, additional data\nare required to confirm this scenario and rule out other ionizing feedback\nmechanisms, such as those observed in the formation of pillar-like structures\naround HII regions in the Milky Way. MUSE electron density mapping effectively\ncaptures the complexity of NGC 2070's interstellar medium and highlights\ntargets for subsequent spectroscopic follow-ups.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}