{"id":"2407.12620","title":"Harnessing the Power of Artificial Intelligence to Vitalize Endangered\n  Indigenous Languages: Technologies and Experiences","authors":"Claudio Pinhanez and Paulo Cavalin and Luciana Storto and Thomas\n  Finbow and Alexander Cobbinah and Julio Nogima and Marisa Vasconcelos and\n  Pedro Domingues and Priscila de Souza Mizukami and Nicole Grell and Majo\\'i\n  Gongora and Isabel Gon\\c{c}alves","authorsParsed":[["Pinhanez","Claudio",""],["Cavalin","Paulo",""],["Storto","Luciana",""],["Finbow","Thomas",""],["Cobbinah","Alexander",""],["Nogima","Julio",""],["Vasconcelos","Marisa",""],["Domingues","Pedro",""],["Mizukami","Priscila de Souza",""],["Grell","Nicole",""],["Gongora","Majoí",""],["Gonçalves","Isabel",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:46:37 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 17:19:43 GMT"}],"updateDate":"2024-07-30","timestamp":1721227597000,"abstract":"  Since 2022 we have been exploring application areas and technologies in which\nArtificial Intelligence (AI) and modern Natural Language Processing (NLP), such\nas Large Language Models (LLMs), can be employed to foster the usage and\nfacilitate the documentation of Indigenous languages which are in danger of\ndisappearing. We start by discussing the decreasing diversity of languages in\nthe world and how working with Indigenous languages poses unique ethical\nchallenges for AI and NLP. To address those challenges, we propose an\nalternative development AI cycle based on community engagement and usage. Then,\nwe report encouraging results in the development of high-quality machine\nlearning translators for Indigenous languages by fine-tuning state-of-the-art\n(SOTA) translators with tiny amounts of data and discuss how to avoid some\ncommon pitfalls in the process. We also present prototypes we have built in\nprojects done in 2023 and 2024 with Indigenous communities in Brazil, aimed at\nfacilitating writing, and discuss the development of Indigenous Language Models\n(ILMs) as a replicable and scalable way to create spell-checkers, next-word\npredictors, and similar tools. Finally, we discuss how we envision a future for\nlanguage documentation where dying languages are preserved as interactive\nlanguage models.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"N2smWO_FY2p-MroimAf_7vgefQ00Aj1hJoi0FdHI-k0","pdfSize":"4121538"}
