{"id":"2407.19018","title":"On the suppression of giant planet formation around low-mass stars in\n  clustered environments","authors":"Shuo Huang, Simon Portegies Zwart, and Maite J. C. Wilhelm","authorsParsed":[["Huang","Shuo",""],["Zwart","Simon Portegies",""],["Wilhelm","Maite J. C.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 18:01:38 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 13:58:53 GMT"}],"updateDate":"2024-08-05","timestamp":1722016898000,"abstract":"  Context: Current exoplanet formation studies tend to overlook the birth\nenvironment of stars in clustered environments. The effect of this environment\non the planet-formation process, however, is important, especially in the\nearliest stage. Aims: We investigate the differences in planet populations\nforming in star-cluster environments through pebble accretion and compare these\nresults with the planet formation around isolated stars. We try to provide\npotential signatures on the young planetary systems to guide future\nobservation. Methods: We design and present a new planet population synthesis\ncode for clustered environments. The planet formation model is based on pebble\naccretion and includes migration in the circumstellar disk. The disk's gas and\ndust are evolved in 1D simulations considering the effects of photo-evaporation\nof the nearby stars. Results: Planetary systems in a clustered environment are\ndifferent than those born in isolation; the environmental effects are important\nfor a wide range of observable parameters and the eventual architecture of the\nplanetary systems. Planetary systems born in a clustered environment lack cold\nJupiters compared to isolated planetary systems. This effect is more pronounced\nfor low-mass stars ($\\lesssim$0.2 $M_\\odot$). On the other hand, planetary\nsystems born in clusters show an excess of cold Neptune around these low-mass\nstars. Conclusions: In future observations, finding an excess of cold Neptunes\nand a lack of cold Jupiters could be used to constrain the birth environments\nof these planetary systems. Exploring the dependence of cold Jupiter's\nintrinsic occurrence rate on stellar mass provides insights into the birth\nenvironment of their proto-embryos.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}