{"id":"2407.18642","title":"GERry: A Code to Optimise the Hunt for the Electromagnetic Counter-parts\n  to Gravitational Wave Events","authors":"David O'Neill, Joseph Lyman, Kendall Ackley, Danny Steeghs, Duncan\n  Galloway, Vik Dhillon, Paul O'Brien, Gavin Ramsay, Kanthanakorn Noysena,\n  Rubina Kotak, Rene Breton, Laura Nuttall, Enric Pall\\'e, Don Pollacco,\n  Krzysztof Ulaczyk, Martin Dyer, Felipe Jim\\'enez-Ibarra, Tom Killestein, Amit\n  Kumar, Lisa Kelsey, Ben Godson, Dan Jarvis","authorsParsed":[["O'Neill","David",""],["Lyman","Joseph",""],["Ackley","Kendall",""],["Steeghs","Danny",""],["Galloway","Duncan",""],["Dhillon","Vik",""],["O'Brien","Paul",""],["Ramsay","Gavin",""],["Noysena","Kanthanakorn",""],["Kotak","Rubina",""],["Breton","Rene",""],["Nuttall","Laura",""],["Pallé","Enric",""],["Pollacco","Don",""],["Ulaczyk","Krzysztof",""],["Dyer","Martin",""],["Jiménez-Ibarra","Felipe",""],["Killestein","Tom",""],["Kumar","Amit",""],["Kelsey","Lisa",""],["Godson","Ben",""],["Jarvis","Dan",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 10:20:19 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 05:50:49 GMT"}],"updateDate":"2024-07-30","timestamp":1721989219000,"abstract":"  The search for the electromagnetic counterparts to gravitational wave (GW)\nevents has been rapidly gathering pace in recent years thanks to the increasing\nnumber and capabilities of both gravitational wave detectors and wide field\nsurvey telescopes. Difficulties remain, however, in detecting these\ncounterparts due to their inherent scarcity, faintness and rapidly evolving\nnature. To find these counterparts, it is important that one optimises the\nobserving strategy for their recovery. This can be difficult due to the large\nnumber of potential variables at play. Such follow-up campaigns are also\ncapable of detecting hundreds or potentially thousands of unrelated transients,\nparticularly for GW events with poor localisation. Even if the observations are\ncapable of detecting a counterpart, finding it among the numerous contaminants\ncan prove challenging. Here we present the Gravitational wave Electromagnetic\nRecovRY code (GERry) to perform detailed analysis and survey-agnostic\nquantification of observing campaigns attempting to recover electromagnetic\ncounterparts. GERry considers the campaign's spatial, temporal and wavelength\ncoverage, in addition to Galactic extinction and the expected counterpart light\ncurve evolution from the GW 3D localisation volume. It returns quantified\nstatistics that can be used to: determine the probability of having detected\nthe counterpart, identify the most promising sources, and assess and refine\nstrategy. Here we demonstrate the code to look at the performance and parameter\nspace probed by current and upcoming wide-field surveys such as GOTO & VRO.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}