{"id":"2407.06691","title":"OFDM Achieves the Lowest Ranging Sidelobe Under Random ISAC Signaling","authors":"Fan Liu, Ying Zhang, Yifeng Xiong, Shuangyang Li, Weijie Yuan, Feifei\n  Gao, Shi Jin, Giuseppe Caire","authorsParsed":[["Liu","Fan",""],["Zhang","Ying",""],["Xiong","Yifeng",""],["Li","Shuangyang",""],["Yuan","Weijie",""],["Gao","Feifei",""],["Jin","Shi",""],["Caire","Giuseppe",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 09:07:07 GMT"}],"updateDate":"2024-07-10","timestamp":1720516027000,"abstract":"  This paper aims to answer a fundamental question in the area of Integrated\nSensing and Communications (ISAC): What is the optimal communication-centric\nISAC waveform for ranging? Towards that end, we first established a generic\nframework to analyze the sensing performance of communication-centric ISAC\nwaveforms built upon orthonormal signaling bases and random data symbols. Then,\nwe evaluated their ranging performance by adopting both the periodic and\naperiodic auto-correlation functions (P-ACF and A-ACF), and defined the\nexpectation of the integrated sidelobe level (EISL) as a sensing performance\nmetric. On top of that, we proved that among all communication waveforms with\ncyclic prefix (CP), the orthogonal frequency division multiplexing (OFDM)\nmodulation is the only globally optimal waveform that achieves the lowest\nranging sidelobe for quadrature amplitude modulation (QAM) and phase shift\nkeying (PSK) constellations, in terms of both the EISL and the sidelobe level\nat each individual lag of the P-ACF. As a step forward, we proved that among\nall communication waveforms without CP, OFDM is a locally optimal waveform for\nQAM/PSK in the sense that it achieves a local minimum of the EISL of the A-ACF.\nFinally, we demonstrated by numerical results that under QAM/PSK\nconstellations, there is no other orthogonal communication-centric waveform\nthat achieves a lower ranging sidelobe level than that of the OFDM, in terms of\nboth P-ACF and A-ACF cases.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}