{"id":"2407.09844","title":"Teaching Design Science as a Method for Effective Research Development","authors":"Oscar Pastor (1), Mmatshuene Anna Segooa (2) and Jose Ignacio Panach\n  (3)","authorsParsed":[["Pastor","Oscar",""],["Segooa","Mmatshuene Anna",""],["Panach","Jose Ignacio",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 10:43:06 GMT"}],"updateDate":"2024-07-16","timestamp":1720867386000,"abstract":"  Applying Design Science Research (DSR) methodology is becoming a popular\nworking resource for most Information Systems (IS) and Software engineering\nstudies. The research and/or practical design problems that must be faced aim\nto answer the question of how to create or investigate an artifact in a given\ncontext. Precisely characterizing both artifact and context is essential for\neffective research development. While various design science guidelines and\nframeworks have been created by experts in IS engineering, emerging researchers\nand postgraduate students still find it challenging to apply this research\nmethodology correctly. There is limited literature and materials that guide and\nsupport teaching novice researchers about the types of artifacts that can be\ndeveloped to address a particular problem and decision-making in DSR. To\naddress this gap in DSR, in this chapter, we explore DSR from an educational\nperspective, explaining both the concept of DSR and an effective method for\nteaching it. This chapter includes examples of DSR, a teaching methodology,\nlearning objectives, and recommendations. Moreover, we have created a survey\nartifact intended to gather data on the experiences of design science users.\nThe goal is to discover insights into contemporary issues and needs for DSR\nbest practices (and, in consequence, evaluate the methodology we aim to teach).\nOur survey results offer a comprehensive overview of participants' experiences\nwith DSR in the SE and IS Engineering domain, highlighting broad engagement\nprimarily initiated during PhD studies and driven by supervisory guidance and\nresearch problems. We finally disclose the artifact to the community so that it\ncan be used by other educators as a preparation when planning to teach DSR in\ntune with the experiences of their target audience.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}