{"id":"2407.02641","title":"Learning Graph Structures and Uncertainty for Accurate and Calibrated\n  Time-series Forecasting","authors":"Harshavardhan Kamarthi, Lingkai Kong, Alexander Rodriguez, Chao Zhang,\n  B Aditya Prakash","authorsParsed":[["Kamarthi","Harshavardhan",""],["Kong","Lingkai",""],["Rodriguez","Alexander",""],["Zhang","Chao",""],["Prakash","B Aditya",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 20:14:32 GMT"}],"updateDate":"2024-07-04","timestamp":1719951272000,"abstract":"  Multi-variate time series forecasting is an important problem with a wide\nrange of applications. Recent works model the relations between time-series as\ngraphs and have shown that propagating information over the relation graph can\nimprove time series forecasting. However, in many cases, relational information\nis not available or is noisy and reliable. Moreover, most works ignore the\nunderlying uncertainty of time-series both for structure learning and deriving\nthe forecasts resulting in the structure not capturing the uncertainty\nresulting in forecast distributions with poor uncertainty estimates. We tackle\nthis challenge and introduce STOIC, that leverages stochastic correlations\nbetween time-series to learn underlying structure between time-series and to\nprovide well-calibrated and accurate forecasts. Over a wide-range of benchmark\ndatasets STOIC provides around 16% more accurate and 14% better-calibrated\nforecasts.\n  STOIC also shows better adaptation to noise in data during inference and\ncaptures important and useful relational information in various benchmarks.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"L88wle6S3g5VH72aGO0I6vc88WnpERLfFI_2rjEaYRw","pdfSize":"1125273","objectId":"0x529668f7232f6f3be86b21931e32c295a6dac03303665c4251c9e561b3fd7be9","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
