{"id":"2407.01294","title":"A Collaborative, Human-Centred Taxonomy of AI, Algorithmic, and\n  Automation Harms","authors":"Gavin Abercrombie, Djalel Benbouzid, Paolo Giudici, Delaram\n  Golpayegani, Julio Hernandez, Pierre Noro, Harshvardhan Pandit, Eva\n  Paraschou, Charlie Pownall, Jyoti Prajapati, Mark A. Sayre, Ushnish Sengupta,\n  Arthit Suriyawongkul, Ruby Thelot, Sofia Vei, Laura Waltersdorfer","authorsParsed":[["Abercrombie","Gavin",""],["Benbouzid","Djalel",""],["Giudici","Paolo",""],["Golpayegani","Delaram",""],["Hernandez","Julio",""],["Noro","Pierre",""],["Pandit","Harshvardhan",""],["Paraschou","Eva",""],["Pownall","Charlie",""],["Prajapati","Jyoti",""],["Sayre","Mark A.",""],["Sengupta","Ushnish",""],["Suriyawongkul","Arthit",""],["Thelot","Ruby",""],["Vei","Sofia",""],["Waltersdorfer","Laura",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:47:53 GMT"}],"updateDate":"2024-07-10","timestamp":1719841673000,"abstract":"  This paper introduces a collaborative, human-centered taxonomy of AI,\nalgorithmic and automation harms. We argue that existing taxonomies, while\nvaluable, can be narrow, unclear, typically cater to practitioners and\ngovernment, and often overlook the needs of the wider public. Drawing on\nexisting taxonomies and a large repository of documented incidents, we propose\na taxonomy that is clear and understandable to a broad set of audiences, as\nwell as being flexible, extensible, and interoperable. Through iterative\nrefinement with topic experts and crowdsourced annotation testing, we propose a\ntaxonomy that can serve as a powerful tool for civil society organisations,\neducators, policymakers, product teams and the general public. By fostering a\ngreater understanding of the real-world harms of AI and related technologies,\nwe aim to increase understanding, empower NGOs and individuals to identify and\nreport violations, inform policy discussions, and encourage responsible\ntechnology development and deployment.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"JiIxJoRkLXOsouFPu3KhHzs4i2emLZsqxW9P-Nbe0iQ","pdfSize":"1126263","objectId":"0x8a803e55c53b2c62e97f5406636755e9d98048a2f4fcb63471f53076e5c377cb","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
