{"id":"2407.16499","title":"Chiral emission of vortex microlasers enabled by collective modes of\n  guided resonances","authors":"Ye Chen (1), Mingjin Wang (2,4 and 5), Jiahao Si (2), Zixuan Zhang\n  (1), Xuefan Yin (1), Jingxuan Chen (2), NianYuan Lv (1), Chenyan Tang (2),\n  Wanhua Zheng (2,4,5,6 and 7), Yuri Kivshar (3), Chao Peng (1 and 8) ((1)\n  State Key Laboratory of Advanced Optical Communication Systems and Networks,\n  School of Electronics \\& Frontiers Science Center for Nano-optoelectronics,\n  Peking University, Beijing, China, (2) Laboratory of Solid State\n  Optoelectronics Information Technology, Institute of Semiconductors, CAS,\n  Beijing, China, (3) Nonlinear Physics Centre, Research School of Physics, The\n  Australian National University, Canberra ACT, Australia, (4) State Key\n  Laboratory on Integrated Optoelectronics, Institute of Semiconductors, CAS,\n  Beijing, China, (5) Hangzhou Institute for Advanced Study, University of\n  Chinese Academy of Sciences, Hangzhou, China, (6) College of Future\n  Technology, University of Chinese Academy of Sciences, Beijing, China, (7)\n  Center of Materials Science and Optoelectronics Engineering, University of\n  Chinese Academy of Sciences, Beijing, China, (8) Peng Cheng Laboratory,\n  Shenzhen, China)","authorsParsed":[["Chen","Ye","","2,4 and 5"],["Wang","Mingjin","","2,4 and 5"],["Si","Jiahao","","2,4,5,6 and 7"],["Zhang","Zixuan","","2,4,5,6 and 7"],["Yin","Xuefan","","2,4,5,6 and 7"],["Chen","Jingxuan","","2,4,5,6 and 7"],["Lv","NianYuan","","2,4,5,6 and 7"],["Tang","Chenyan","","2,4,5,6 and 7"],["Zheng","Wanhua","","2,4,5,6 and 7"],["Kivshar","Yuri","","1 and 8"],["Peng","Chao","","1 and 8"]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:14:07 GMT"}],"updateDate":"2024-07-24","timestamp":1721744047000,"abstract":"  Vortex lasers have attracted substantial attention in recent years owing to\ntheir wide array of applications such as micromanipulation, optical\nmultiplexing, and quantum cryptography. In this work, we propose and\ndemonstrate chiral emission of vortex microlaser leveraging the collective\nmodes from omnidirectionally hybridizing the guided mode resonances (GMRs)\nwithin photonic crystal (PhC) slabs. Specifically, we encircle a central\nuniform PhC with a heterogeneous PhC that features a circular lateral boundary.\nConsequently, the bulk GMRs hybridize into a series of collective modes due to\nboundary scatterings, resulting in a vortex pattern in real space with a spiral\nphase front in its radiation. Benefiting from the long lifetime of GMRs as\nquasi-bound state in the continuum and using asymmetric pumping to lift the\nchiral symmetry, we demonstrate stable single-mode lasing oscillation with a\nlow optical pumping threshold of $18~\\mathrm{kW/cm^2}$ at room temperature. We\nidentify the real-space vortex through polarization-resolved imaging and\nself-interference patterns, showing a vivid example of applying collective\nmodes to realize compact and energy-efficient vortex microlasers.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/"}