{"id":"2407.07922","title":"Vulnerability Detection in Smart Contracts: A Comprehensive Survey","authors":"Christopher De Baets, Basem Suleiman, Armin Chitizadeh and Imran\n  Razzak","authorsParsed":[["De Baets","Christopher",""],["Suleiman","Basem",""],["Chitizadeh","Armin",""],["Razzak","Imran",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 11:51:15 GMT"}],"updateDate":"2024-07-12","timestamp":1720439475000,"abstract":"  In the growing field of blockchain technology, smart contracts exist as\ntransformative digital agreements that execute transactions autonomously in\ndecentralised networks. However, these contracts face challenges in the form of\nsecurity vulnerabilities, posing significant financial and operational risks.\nWhile traditional methods to detect and mitigate vulnerabilities in smart\ncontracts are limited due to a lack of comprehensiveness and effectiveness,\nintegrating advanced machine learning technologies presents an attractive\napproach to increasing effective vulnerability countermeasures. We endeavour to\nfill an important gap in the existing literature by conducting a rigorous\nsystematic review, exploring the intersection between machine learning and\nsmart contracts. Specifically, the study examines the potential of machine\nlearning techniques to improve the detection and mitigation of vulnerabilities\nin smart contracts. We analysed 88 articles published between 2018 and 2023\nfrom the following databases: IEEE, ACM, ScienceDirect, Scopus, and Google\nScholar. The findings reveal that classical machine learning techniques,\nincluding KNN, RF, DT, XG-Boost, and SVM, outperform static tools in\nvulnerability detection. Moreover, multi-model approaches integrating deep\nlearning and classical machine learning show significant improvements in\nprecision and recall, while hybrid models employing various techniques achieve\nnear-perfect performance in vulnerability detection accuracy.\n  By integrating state-of-the-art solutions, this work synthesises current\nmethods, thoroughly investigates research gaps, and suggests directions for\nfuture studies. The insights gathered from this study are intended to serve as\na seminal reference for academics, industry experts, and bodies interested in\nleveraging machine learning to enhance smart contract security.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}