{"id":"2407.01547","title":"Forecasting Mortality Rates: Unveiling Patterns with a PCA-GEE Approach","authors":"Reza Dastranj, Martin Kolar","authorsParsed":[["Dastranj","Reza",""],["Kolar","Martin",""]],"versions":[{"version":"v1","created":"Wed, 24 Apr 2024 17:24:29 GMT"}],"updateDate":"2024-07-03","timestamp":1713979469000,"abstract":"  Principal Component Analysis (PCA) is a widely used technique in exploratory\ndata analysis, visualization, and data preprocessing, leveraging the concept of\nvariance to identify key dimensions in datasets. In this study, we focus on the\nfirst principal component, which represents the direction maximizing the\nvariance of projected data. We extend the application of PCA by treating its\nfirst principal component as a covariate and integrating it with Generalized\nEstimating Equations (GEE) for analyzing age-specific death rates (ASDRs) in\nlongitudinal datasets. GEE models are chosen for their robustness in handling\ncorrelated data, particularly suited for situations where traditional models\nassume independence among observations, which may not hold true in longitudinal\ndata. We propose distinct GEE models tailored for single and multipopulation\nASDRs, accommodating various correlation structures such as independence,\nAR(1), and exchangeable, thus offering a comprehensive evaluation of model\nefficiency. Our study critically evaluates the strengths and limitations of GEE\nmodels in mortality forecasting, providing empirical evidence through detailed\nmodel specifications and practical illustrations. We compare the forecast\naccuracy of our PCA-GEE approach with the Li-Lee and Lee-Carter models,\ndemonstrating its superior predictive performance. Our findings contribute to\nan enhanced understanding of the nuanced capabilities of GEE models in\nmortality rate prediction, highlighting the potential of integrating PCA with\nGEE for improved forecasting accuracy and reliability.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}