{"id":"2407.12664","title":"Realistic wave-optics simulation of X-ray dark-field imaging at a human\n  scale","authors":"Yongjin Sung, Brandon Nelson, Rajiv Gupta","authorsParsed":[["Sung","Yongjin",""],["Nelson","Brandon",""],["Gupta","Rajiv",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 15:48:17 GMT"}],"updateDate":"2024-07-18","timestamp":1721231297000,"abstract":"  Background: X-ray dark-field imaging (XDFI) has been explored to provide\nsuperior performance over the conventional X-ray imaging for the diagnosis of\nmany pathologic conditions. A simulation tool to reliably predict clinical XDFI\nimages at a human scale, however, is currently missing. Purpose: In this paper,\nwe demonstrate XDFI simulation at a human scale for the first time to the best\nof our knowledge. Using the developed simulation tool, we demonstrate the\nstrengths and limitations of XDFI for the diagnosis of emphysema, fibrosis,\natelectasis, edema, and pneumonia.\n  Methods: We augment the XCAT phantom with Voronoi grids to simulate alveolar\nsubstructure, responsible for the dark-field signal from lungs, assign material\nproperties to each tissue type, and simulate X-ray wave propagation through the\naugmented XCAT phantom using a multi-layer wave-optics propagation. Altering\nthe density and thickness of the Voronoi grids as well as the material\nproperties, we simulate XDFI images of normal and diseased lungs.\n  Results: Our simulation framework can generate realistic XDFI images of a\nhuman chest with normal or diseased lungs. The simulation confirms that the\nnormal, emphysematous, and fibrotic lungs show clearly distinct dark-field\nsignals. It also shows that alveolar fluid accumulation in pneumonia, wall\nthickening in interstitial edema, and deflation in atelectasis result in a\nsimilar reduction in dark-field signal.\n  Conclusions: It is feasible to augment XCAT with pulmonary substructure and\ngenerate realistic XDFI images using multi-layer wave optics. By providing the\nmost realistic XDFI images of lung pathologies, the developed simulation\nframework will enable in-silico clinical trials and the optimization of both\nhardware and software for XDFI.\n","subjects":["Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hCkIGHxTO8DyxP8rP3Vq031HF2Lgfyz7SP7SbYlLpBk","pdfSize":"983075"}
