{"id":"2407.19120","title":"Multi-phonon Fock state heralding with single-photon detection","authors":"Andrew J. Shepherd and Ryan O. Behunin","authorsParsed":[["Shepherd","Andrew J.",""],["Behunin","Ryan O.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 22:51:53 GMT"}],"updateDate":"2024-07-30","timestamp":1722034313000,"abstract":"  Recognized as a potential resource for quantum technologies and a possible\ntestbed for fundamental physics, the control and preparation of nonclassical\nstates of mechanical oscillators has been explored extensively. Within\noptomechanics, quantum state synthesis can be realized by entangling photonic\nand phononic degrees of freedom followed by optical detection. Single-photon\ndetection enables one of the most powerful forms of such heralded quantum state\npreparation, permitting the creation of single phonon states when applied to\nconventional cavity optomechanical systems. As the complexity of optomechanical\nsystems increases, single-photon detection may provide heralded access to a\nlarger class of exotic quantum states. Here, we examine the quantum dynamics of\noptomechanical systems that permit forward Brillouin scattering, where a single\nphonon mode mediates transitions between a collection of equally spaced optical\nresonances. Solving both the Schrodinger equation and the Lindblad master\nequation for this system, we find that initial states comprised of single\nphotons or weak laser pulses evolve into complex quantum states where the\nfrequency of single photon states and the phonon occupation number are\nentangled. Physically, these interactions permit a single photon to scatter to\nlower frequencies, where phonon excitation occurs for each scattering event.\nCombining this result with frequency filtering, we show how single-photon\ndetection can herald selected multi-phonon Fock states, even in the presence of\noptical losses. We also present an approach for quantum tomography of the\nheralded phonon states.\n","subjects":["Physics/Quantum Physics","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}