{"id":"2407.00319","title":"A slightly oblate dark matter halo revealed by a retrograde precessing\n  Galactic disk warp","authors":"Yang Huang, Qikang Feng, Tigran Khachaturyants, Huawei Zhang, Jifeng\n  Liu, Juntai Shen, Timothy C. Beers, Youjun Lu, Song Wang, Haibo Yuan","authorsParsed":[["Huang","Yang",""],["Feng","Qikang",""],["Khachaturyants","Tigran",""],["Zhang","Huawei",""],["Liu","Jifeng",""],["Shen","Juntai",""],["Beers","Timothy C.",""],["Lu","Youjun",""],["Wang","Song",""],["Yuan","Haibo",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 05:00:39 GMT"}],"updateDate":"2024-07-02","timestamp":1719637239000,"abstract":"  The shape of the dark matter (DM) halo is key to understanding the\nhierarchical formation of the Galaxy. Despite extensive efforts in recent\ndecades, however, its shape remains a matter of debate, with suggestions\nranging from strongly oblate to prolate. Here, we present a new constraint on\nits present shape by directly measuring the evolution of the Galactic disk warp\nwith time, as traced by accurate distance estimates and precise age\ndeterminations for about 2,600 classical Cepheids. We show that the Galactic\nwarp is mildly precessing in a retrograde direction at a rate of $\\omega = -2.1\n\\pm 0.5 ({\\rm statistical}) \\pm 0.6 ({\\rm systematic})$ km s$^{-1}$ kpc$^{-1}$\nfor the outer disk over the Galactocentric radius [$7.5, 25$] kpc, decreasing\nwith radius. This constrains the shape of the DM halo to be slightly oblate\nwith a flattening (minor axis to major axis ratio) in the range $0.84 \\le\nq_{\\Phi} \\le 0.96$. Given the young nature of the disk warp traced by Cepheids\n(less than 200 Myr), our approach directly measures the shape of the\npresent-day DM halo. This measurement, combined with other measurements from\nolder tracers, could provide vital constraints on the evolution of the DM halo\nand the assembly history of the Galaxy.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}