{"id":"2407.21554","title":"Conditioned Prompt-Optimization for Continual Deepfake Detection","authors":"Francesco Laiti, Benedetta Liberatori, Thomas De Min, Elisa Ricci","authorsParsed":[["Laiti","Francesco",""],["Liberatori","Benedetta",""],["De Min","Thomas",""],["Ricci","Elisa",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 12:22:57 GMT"}],"updateDate":"2024-08-01","timestamp":1722428577000,"abstract":"  The rapid advancement of generative models has significantly enhanced the\nrealism and customization of digital content creation. The increasing power of\nthese tools, coupled with their ease of access, fuels the creation of\nphotorealistic fake content, termed deepfakes, that raises substantial concerns\nabout their potential misuse. In response, there has been notable progress in\ndeveloping detection mechanisms to identify content produced by these advanced\nsystems. However, existing methods often struggle to adapt to the continuously\nevolving landscape of deepfake generation. This paper introduces Prompt2Guard,\na novel solution for exemplar-free continual deepfake detection of images, that\nleverages Vision-Language Models (VLMs) and domain-specific multimodal prompts.\nCompared to previous VLM-based approaches that are either bounded by prompt\nselection accuracy or necessitate multiple forward passes, we leverage a\nprediction ensembling technique with read-only prompts. Read-only prompts do\nnot interact with VLMs internal representation, mitigating the need for\nmultiple forward passes. Thus, we enhance efficiency and accuracy in detecting\ngenerated content. Additionally, our method exploits a text-prompt conditioning\ntailored to deepfake detection, which we demonstrate is beneficial in our\nsetting. We evaluate Prompt2Guard on CDDB-Hard, a continual deepfake detection\nbenchmark composed of five deepfake detection datasets spanning multiple\ndomains and generators, achieving a new state-of-the-art. Additionally, our\nresults underscore the effectiveness of our approach in addressing the\nchallenges posed by continual deepfake detection, paving the way for more\nrobust and adaptable solutions in deepfake detection.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"lh9CtOCNaj_0oUyHvAwtQpycrCOVmFPQAH-42WyXYT4","pdfSize":"8652696"}
