{"id":"2407.09519","title":"Putting GPT-4o to the Sword: A Comprehensive Evaluation of Language,\n  Vision, Speech, and Multimodal Proficiency","authors":"Sakib Shahriar, Brady Lund, Nishith Reddy Mannuru, Muhammad Arbab\n  Arshad, Kadhim Hayawi, Ravi Varma Kumar Bevara, Aashrith Mannuru, Laiba\n  Batool","authorsParsed":[["Shahriar","Sakib",""],["Lund","Brady",""],["Mannuru","Nishith Reddy",""],["Arshad","Muhammad Arbab",""],["Hayawi","Kadhim",""],["Bevara","Ravi Varma Kumar",""],["Mannuru","Aashrith",""],["Batool","Laiba",""]],"versions":[{"version":"v1","created":"Wed, 19 Jun 2024 19:00:21 GMT"}],"updateDate":"2024-07-16","timestamp":1718823621000,"abstract":"  As large language models (LLMs) continue to advance, evaluating their\ncomprehensive capabilities becomes significant for their application in various\nfields. This research study comprehensively evaluates the language, vision,\nspeech, and multimodal capabilities of GPT-4o. The study employs standardized\nexam questions, reasoning tasks, and translation assessments to assess the\nmodel's language capability. Additionally, GPT-4o's vision and speech\ncapabilities are tested through image classification and object recognition\ntasks, as well as accent classification. The multimodal evaluation assesses the\nmodel's performance in integrating visual and linguistic data. Our findings\nreveal that GPT-4o demonstrates high accuracy and efficiency across multiple\ndomains in language and reasoning capabilities, excelling in tasks that require\nfew-shot learning. GPT-4o also provides notable improvements in multimodal\ntasks compared to its predecessors. However, the model shows variability and\nfaces limitations in handling complex and ambiguous inputs, particularly in\naudio and vision capabilities. This paper highlights the need for more\ncomprehensive benchmarks and robust evaluation frameworks, encompassing\nqualitative assessments involving human judgment as well as error analysis.\nFuture work should focus on expanding datasets, investigating prompt-based\nassessment, and enhancing few-shot learning techniques to test the model's\npractical applicability and performance in real-world scenarios.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}