{"id":"2407.16900","title":"Regulating AI Adaptation: An Analysis of AI Medical Device Updates","authors":"Kevin Wu, Eric Wu, Kit Rodolfa, Daniel E. Ho, James Zou","authorsParsed":[["Wu","Kevin",""],["Wu","Eric",""],["Rodolfa","Kit",""],["Ho","Daniel E.",""],["Zou","James",""]],"versions":[{"version":"v1","created":"Sat, 22 Jun 2024 19:44:47 GMT"}],"updateDate":"2024-07-25","timestamp":1719085487000,"abstract":"  While the pace of development of AI has rapidly progressed in recent years,\nthe implementation of safe and effective regulatory frameworks has lagged\nbehind. In particular, the adaptive nature of AI models presents unique\nchallenges to regulators as updating a model can improve its performance but\nalso introduce safety risks. In the US, the Food and Drug Administration (FDA)\nhas been a forerunner in regulating and approving hundreds of AI medical\ndevices. To better understand how AI is updated and its regulatory\nconsiderations, we systematically analyze the frequency and nature of updates\nin FDA-approved AI medical devices. We find that less than 2% of all devices\nreport having been updated by being re-trained on new data. Meanwhile, nearly a\nquarter of devices report updates in the form of new functionality and\nmarketing claims. As an illustrative case study, we analyze pneumothorax\ndetection models and find that while model performance can degrade by as much\nas 0.18 AUC when evaluated on new sites, re-training on site-specific data can\nmitigate this performance drop, recovering up to 0.23 AUC. However, we also\nobserved significant degradation on the original site after re-training using\ndata from new sites, providing insight from one example that challenges the\ncurrent one-model-fits-all approach to regulatory approvals. Our analysis\nprovides an in-depth look at the current state of FDA-approved AI device\nupdates and insights for future regulatory policies toward model updating and\nadaptive AI.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}