{"id":"2407.20803","title":"A discussion on the critical electric Rayleigh number for AC\n  electrokinetic flow of binary fluids in a divergent microchannel","authors":"Jinan Pang, Yu Han, Bo Sun, Wei Zhao","authorsParsed":[["Pang","Jinan",""],["Han","Yu",""],["Sun","Bo",""],["Zhao","Wei",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 13:10:13 GMT"}],"updateDate":"2024-07-31","timestamp":1722345013000,"abstract":"  Electrokinetic (EK) flow is a type of flow driven or manipulated by electric\nbody forces, influenced by various factors such as electric field intensity,\nelectric field form, frequency, electric permittivity/conductivity, fluid\nviscosity and etc. The diversity of dimensionless control parameters, such as\nthe electric Rayleigh number, complicates the comparison of EK flow stability.\nConsequently, comparing the performance and cost of micromixers or reactors\nbased on EK flow is challenging, posing an obstacle to their industrial and\nengineering applications. In this investigation, we theoretically derived a new\nelectric Rayleigh number ($Ra_e$) that quantifies the relationship among\nelectric body forces, fluid viscosity, and ion diffusivity, based on a tanh\nmodel of electric conductivity distribution. The calculation results indicate\nthat the new $Ra_e$ exhibits richer variation with the control parameters and\nbetter consistency with previous experimental reports. We further conducted\nexperimental studies on the critical electric Rayleigh number ($Ra_{ec}$) of AC\nEK flow of binary fluids in a divergent microchannel. The experimental\nvariations align well with the theoretical predictions, particularly the\nexistence of an optimal AC frequency and electric conductivity ratio,\ndemonstrating that the tanh model can better elucidate the underlying physics\nof EK flow. With the new electric Rayleigh number, we found that EK flow in the\ndesigned divergent microchannel has a much smaller $Ra_{ec}$ than previously\nreported, indicating that EK flow is more unstable and thus more suitable for\napplications in micromixers or reactors in industry and engineering.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}