{"id":"2407.14278","title":"Fragment quantum embedding using the Householder transformation: a\n  multi-state extension based on ensembles","authors":"Filip Cernatic, Emmanuel Fromager, and Saad Yalouz","authorsParsed":[["Cernatic","Filip",""],["Fromager","Emmanuel",""],["Yalouz","Saad",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 13:00:23 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 20:33:56 GMT"}],"updateDate":"2024-09-04","timestamp":1721394023000,"abstract":"  In recent works by Yalouz et al. (J. Chem. Phys. 157, 214112, 2022) and\nSekaran et al. (Phys. Rev. B 104, 035121, 2021; Computation 10, 45, 2022),\nDensity Matrix Embedding Theory (DMET) has been reformulated through the use of\nthe Householder transformation as a novel tool to embed a fragment within\nextended systems. The transformation was applied to a reference non-interacting\none-electron reduced density matrix to construct fragments' bath orbitals,\nwhich are crucial for subsequent ground state calculations. In the present\nwork, we expand upon these previous developments and extend the utilization of\nthe Householder transformation to the description of multiple electronic\nstates, including ground and excited states. Based on an ensemble\nnoninteracting density matrix, we demonstrate the feasibility of achieving\nexact fragment embedding through successive Householder transformations,\nresulting in a larger set of bath orbitals. We analytically prove that the\nnumber of additional bath orbitals scales directly with the number of\nfractionally occupied natural orbitals in the reference ensemble density\nmatrix. A connection with the regular DMET bath construction is also made.\nThen, we illustrate the use of this ensemble embedding tool in single-shot DMET\ncalculations to describe both ground and first excited states in a Hubbard\nlattice model and an ab initio hydrogen system. Lastly, we discuss avenues for\nenhancing ensemble embedding through self-consistency and explore potential\nfuture directions.\n","subjects":["Physics/Chemical Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}