{"id":"2407.17333","title":"Global Confidence Degree Based Graph Neural Network for Financial Fraud\n  Detection","authors":"Jiaxun Liu, Yue Tian, Guanjun Liu","authorsParsed":[["Liu","Jiaxun",""],["Tian","Yue",""],["Liu","Guanjun",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 14:55:37 GMT"},{"version":"v2","created":"Sun, 18 Aug 2024 06:39:56 GMT"}],"updateDate":"2024-08-20","timestamp":1721832937000,"abstract":"  Graph Neural Networks (GNNs) are widely used in financial fraud detection due\nto their excellent ability on handling graph-structured financial data and\nmodeling multilayer connections by aggregating information of neighbors.\nHowever, these GNN-based methods focus on extracting neighbor-level information\nbut neglect a global perspective. This paper presents the concept and\ncalculation formula of Global Confidence Degree (GCD) and thus designs\nGCD-based GNN (GCD-GNN) that can address the challenges of camouflage in\nfraudulent activities and thus can capture more global information. To obtain a\nprecise GCD for each node, we use a multilayer perceptron to transform features\nand then the new features and the corresponding prototype are used to eliminate\nunnecessary information. The GCD of a node evaluates the typicality of the node\nand thus we can leverage GCD to generate attention values for message\naggregation. This process is carried out through both the original GCD and its\ninverse, allowing us to capture both the typical neighbors with high GCD and\nthe atypical ones with low GCD. Extensive experiments on two public datasets\ndemonstrate that GCD-GNN outperforms state-of-the-art baselines, highlighting\nthe effectiveness of GCD. We also design a lightweight GCD-GNN\n(GCD-GNN$_{light}$) that also outperforms the baselines but is slightly weaker\nthan GCD-GNN on fraud detection performance. However, GCD-GNN$_{light}$\nobviously outperforms GCD-GNN on convergence and inference speed.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}