{"id":"2407.21467","title":"Deep Learning-Based Longitudinal Prediction of Childhood Myopia\n  Progression Using Fundus Image Sequences and Baseline Refraction Data","authors":"Mengtian Kang, Yansong Hu, Shuo Gao, Yuanyuan Liu, Hongbei Meng,\n  Xuemeng Li, Xuhang Chen, Hubin Zhao, Jing Fu, Guohua Hu, Wei Wang, Yanning\n  Dai, Arokia Nathan, Peter Smielewski, Ningli Wang, Shiming Li","authorsParsed":[["Kang","Mengtian",""],["Hu","Yansong",""],["Gao","Shuo",""],["Liu","Yuanyuan",""],["Meng","Hongbei",""],["Li","Xuemeng",""],["Chen","Xuhang",""],["Zhao","Hubin",""],["Fu","Jing",""],["Hu","Guohua",""],["Wang","Wei",""],["Dai","Yanning",""],["Nathan","Arokia",""],["Smielewski","Peter",""],["Wang","Ningli",""],["Li","Shiming",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 09:26:20 GMT"}],"updateDate":"2024-08-01","timestamp":1722417980000,"abstract":"  Childhood myopia constitutes a significant global health concern. It exhibits\nan escalating prevalence and has the potential to evolve into severe,\nirreversible conditions that detrimentally impact familial well-being and\ncreate substantial economic costs. Contemporary research underscores the\nimportance of precisely predicting myopia progression to enable timely and\neffective interventions, thereby averting severe visual impairment in children.\nSuch predictions predominantly rely on subjective clinical assessments, which\nare inherently biased and resource-intensive, thus hindering their widespread\napplication. In this study, we introduce a novel, high-accuracy method for\nquantitatively predicting the myopic trajectory and myopia risk in children\nusing only fundus images and baseline refraction data. This approach was\nvalidated through a six-year longitudinal study of 3,408 children in Henan,\nutilizing 16,211 fundus images and corresponding refractive data. Our method\nbased on deep learning demonstrated predictive accuracy with an error margin of\n0.311D per year and AUC scores of 0.944 and 0.995 for forecasting the risks of\ndeveloping myopia and high myopia, respectively. These findings confirm the\nutility of our model in supporting early intervention strategies and in\nsignificantly reducing healthcare costs, particularly by obviating the need for\nadditional metadata and repeated consultations. Furthermore, our method was\ndesigned to rely only on fundus images and refractive error data, without the\nneed for meta data or multiple inquiries from doctors, strongly reducing the\nassociated medical costs and facilitating large-scale screening. Our model can\neven provide good predictions based on only a single time measurement.\nConsequently, the proposed method is an important means to reduce medical\ninequities caused by economic disparities.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}