{"id":"2407.06629","title":"Collision and Obstacle Avoidance for Industrial Autonomous Vehicles --\n  Simulation and Experimentation Based on a Cooperative Approach","authors":"Juliette Grosset (ECAM, IMT Atlantique - SRCD, IRISA),\n  Alain-J\\'er\\^ome Foug\\`eres (ECAM), M Djoko-Kouam (ECAM, IETR), C Couturier,\n  Jean-Marie Bonnin (IMT Atlantique - SRCD, IRISA)","authorsParsed":[["Grosset","Juliette","","ECAM, IMT Atlantique - SRCD, IRISA"],["Fougères","Alain-Jérôme","","ECAM"],["Djoko-Kouam","M","","ECAM, IETR"],["Couturier","C","","IMT Atlantique - SRCD, IRISA"],["Bonnin","Jean-Marie","","IMT Atlantique - SRCD, IRISA"]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 07:53:46 GMT"}],"updateDate":"2024-07-10","timestamp":1720511626000,"abstract":"  One of the challenges of Industry 4.0, is to determine and optimize the flow\nof data, products and materials in manufacturing companies. To realize these\nchallenges, many solutions have been defined such as the utilization of\nautomated guided vehicles (AGVs). However, being guided is a handicap for these\nvehicles to fully meet the requirements of Industry 4.0 in terms of\nadaptability and flexibility: the autonomy of vehicles cannot be reduced to\npredetermined trajectories. Therefore, it is necessary to develop their\nautonomy. This will be possible by designing new generations of industrial\nautonomous vehicles (IAVs), in the form of intelligent and cooperative\nautonomous mobile robots.In the field of road transport, research is very\nactive to make the car autonomous. Many algorithms, solving problematic traffic\nsituations similar to those that can occur in an industrial environment, can be\ntransposed in the industrial field and therefore for IAVs. The technologies\nstandardized in dedicated bodies (e.g., ETSI TC ITS), such as those concerning\nthe exchange of messages between vehicles to increase their awareness or their\nability to cooperate, can also be transposed to the industrial context. The\ndeployment of intelligent autonomous vehicle fleets raises several challenges:\nacceptability by employees, vehicle location, traffic fluidity, vehicle\nperception of changing environments (dynamic), vehicle-infrastructure\ncooperation, or vehicles heterogeneity. In this context, developing the\nautonomy of IAVs requires a relevant working method. The identification of\nreusable or adaptable algorithms to the various problems raised by the increase\nin the autonomy of IAVs is not sufficient, it is also necessary to be able to\nmodel, to simulate, to test and to experiment with the proposed solutions.\nSimulation is essential since it allows both to adapt and to validate the\nalgorithms, but also to design and to prepare the experiments.To improve the\nautonomy of a fleet, we consider the approach relying on a collective\nintelligence to make the behaviours of vehicles adaptive. In this chapter, we\nwill focus on a class of problems faced by IAVs related to collision and\nobstacle avoidance. Among these problems, we are particularly interested when\ntwo vehicles need to cross an intersection at the same time, known as a\ndeadlock situation. But also, when obstacles are present in the aisles and need\nto be avoided by the vehicles safely.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}