{"id":"2407.21559","title":"Self-Sovereign Identity for Consented and Content-Based Access to\n  Medical Records using Blockchain","authors":"Marie Tcholakian and Karolina Gorna and Maryline Laurent and Hella\n  Kaffel Ben Ayed and Montassar Naghmouchi","authorsParsed":[["Tcholakian","Marie",""],["Gorna","Karolina",""],["Laurent","Maryline",""],["Ayed","Hella Kaffel Ben",""],["Naghmouchi","Montassar",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 12:27:31 GMT"}],"updateDate":"2024-08-01","timestamp":1722428851000,"abstract":"  Electronic Health Records (EHRs) and Medical Data are classified as personal\ndata in every privacy law, meaning that any related service that includes\nprocessing such data must come with full security, confidentiality, privacy and\naccountability. Solutions for health data management, as in storing it, sharing\nand processing it, are emerging quickly and were significantly boosted by the\nCovid-19 pandemic that created a need to move things online. EHRs makes a\ncrucial part of digital identity data, and the same digital identity trends --\nas in self sovereign identity powered by decentralized ledger technologies like\nBlockchain, are being researched or implemented in contexts managing digital\ninteractions between health facilities, patients and health professionals. In\nthis paper, we propose a blockchain-based solution enabling secure exchange of\nEHRs between different parties powered by a self-sovereign identity (SSI)\nwallet and decentralized identifiers. We also make use of a consortium IPFS\nnetwork for off-chain storage and attribute-based encryption (ABE) to ensure\ndata confidentiality and integrity. Through our solution, we grant users full\ncontrol over their medical data, and enable them to securely share it in total\nconfidentiality over secure communication channels between user wallets using\nencryption. We also use DIDs for better user privacy and limit any possible\ncorrelations or identification by using pairwise DIDs. Overall, combining this\nset of technologies guarantees secure exchange of EHRs, secure storage and\nmanagement along with by-design features inherited from the technological\nstack.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/"}