{"id":"2407.13724","title":"Electrically Controlled Interfacial Charge Transfer Induced Excitons in\n  MoSe2-WSe2 Lateral Heterostructure","authors":"Baisali Kundu (1), Priyanka Mondal (1,2), David Tebbe (2), Md. Nur\n  Hassan (3), Suman Kumar Chakraborty (1), Marvin Metzelaars (4), Paul\n  K\\\"ogerler (4), Debjani Karmakar (3,5,6), Christoph Stampfer (2), Bernd\n  Beschoten (2), Lutz Waldecker (2), Prasana Kumar Sahoo (1) ((1)Materials\n  Science Centre, Indian Institute of Technology, Kharagpur 721302, India (2)\n  2nd Institute of Physics and JARA-FIT, RWTH Aachen University, Aachen 52056,\n  Germany (3) Department of Physics and Astronomy, Uppsala University, Uppsala\n  75120, Sweden (4) Institute of Inorganic Chemistry, RWTH Aachen University,\n  52074 Aachen, Germany (5) Technical Physics Division, Bhabha Atomic Research\n  Centre, Mumbai 400085, India (6) Homi Bhabha National Institute, Trombay,\n  Mumbai 400094, India)","authorsParsed":[["Kundu","Baisali",""],["Mondal","Priyanka",""],["Tebbe","David",""],["Hassan","Md. Nur",""],["Chakraborty","Suman Kumar",""],["Metzelaars","Marvin",""],["Kögerler","Paul",""],["Karmakar","Debjani",""],["Stampfer","Christoph",""],["Beschoten","Bernd",""],["Waldecker","Lutz",""],["Sahoo","Prasana Kumar",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:23:35 GMT"}],"updateDate":"2024-07-19","timestamp":1721323415000,"abstract":"  Controlling excitons and their transport in two-dimensional (2D) transition\nmetal dichalcogenides (TMDs) heterostructures is central to advancing photonics\nand electronics on-chip integration. We investigate the controlled generation\nand manipulation of excitons and their complexes in monolayer (1L) MoSe2-WSe2\nlateral heterostructure (LHS), directly grown via water-assisted chemical vapor\ndeposition. Using a field-effect transistor design by incorporating a few-layer\ngraphene back gate, single-layer graphene edge contact and encapsulation with\nfew-layer hexagonal boron nitride, we achieve precise electrical tuning of\nexciton complexes and their transfer across 1D interfaces. At cryogenic\ntemperatures (4 K), photoluminescence and photocurrent maps reveal the\nsynergistic effect of local electric field and interface phenomena in the\nmodulation of excitons, trions, and free carriers. We observe spatial\nvariations in exciton and trion densities driven by exciton-trion conversion\nunder electrical manipulation. The first-principle density functional theory\ncalculation reveals significant band modification at the lateral interfaces and\ngraphene-TMDs contact region. Furthermore, we demonstrate the versatility of 2D\nTMDS LHS in hosting and manipulating quantum emitters, achieving precise\ncontrol over narrow-band emissions through modulating carrier injection and\nelectrical biasing. This work extends the boundary of the present understanding\nof excitonic behaviour within lateral heterojunctions, highlighting the\npotential for controlled exciton manipulation across 1D interfaces and paving\nthe way for next-generation electro-optical quantum devices.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9wHo6ktgcp3NjImI5LZHo7h-IlbAsVzucI3AUmDzYIQ","pdfSize":"1927916"}
