{"id":"2407.10871","title":"The instrumentation program at the Large Binocular Telescope Observatory\n  in 2024","authors":"Joseph C. Shields, Jason Chu, Albert Conrad, Jonathan Crass, Justin R.\n  Crepp, Steve Ertel, Jacopo Farinato, Ilya Ilyin, Olga Kuhn, Luca Marafatto,\n  Fernando Pedichini, Roberto Piazzesi, Richard W. Pogge, Jennifer Power, Sam\n  Ragland, Robert Reynolds, James Riedl, Mark Smithwright, Klaus G.\n  Strassmeier, and David Thompson","authorsParsed":[["Shields","Joseph C.",""],["Chu","Jason",""],["Conrad","Albert",""],["Crass","Jonathan",""],["Crepp","Justin R.",""],["Ertel","Steve",""],["Farinato","Jacopo",""],["Ilyin","Ilya",""],["Kuhn","Olga",""],["Marafatto","Luca",""],["Pedichini","Fernando",""],["Piazzesi","Roberto",""],["Pogge","Richard W.",""],["Power","Jennifer",""],["Ragland","Sam",""],["Reynolds","Robert",""],["Riedl","James",""],["Smithwright","Mark",""],["Strassmeier","Klaus G.",""],["Thompson","David",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 16:18:18 GMT"}],"updateDate":"2024-07-16","timestamp":1721060298000,"abstract":"  The Large Binocular Telescope, with its expansive collecting area, angular\nresolving power, and advanced optical design, provides a robust platform for\ndevelopment and operation of advanced instrumentation for astronomical\nresearch. The LBT currently hosts a mature suite of instruments for\nspectroscopy and imaging at optical through mid-infrared wavelengths, supported\nby sophisticated adaptive optics systems. This contribution summarizes the\ncurrent state of instrumentation, including upgrades to existing instruments\nand commissioning of second generation instruments now in progress. The LBT is\nsoliciting proposals for next generation instrument concepts, with\nparticipation open to consortium members and others interested in participation\nin the Observatory.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}