{"id":"2407.05648","title":"Simultaneous Polarization Conversion and Anomalous Reflection with\n  Anisotropic Printed-Circuit-Board (PCB) Metagratings","authors":"Sharon Elad and Ariel Epstein","authorsParsed":[["Elad","Sharon",""],["Epstein","Ariel",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 06:19:48 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 11:57:07 GMT"}],"updateDate":"2024-08-30","timestamp":1720419588000,"abstract":"  We present a semianalytical synthesis scheme for designing realistic\nprinted-circuit-board- (PCB) based metagratings (MGs), capable of simultaneous\nbeam steering and polarization conversion. These low-profile structures,\ncomprised of sparse periodic arrangements of subwavelength polarizable\nparticles (meta-atoms), oriented by insightful analytical models leading to\nfabrication-ready designs, have gained growing interest in recent years,\ndemonstrating exceptional diffraction engineering capabilities with very high\nefficiencies. Herein, to facilitate cross-polarization coupling, we introduce a\ntilted dogbone meta-atom, going beyond the popular vertical (loaded wire) or\nrecently proposed horizontal (dipole) configurations used in common PCB MG\nmanifestations at microwaves, strictly susceptible to either transverse\nelectric (TE) or transverse magnetic (TM) fields, respectively. As shown, the\nanisotropy introduced by the in-plane rotation of the dogbones, integrated into\nthe MG analytical model in the form of a rotated dipole line, serves as an\nadditional degree of freedom that can be leveraged to nonlocally manipulate the\npolarization and trajectory of the incident fields. Verified experimentally,\nthe resultant semianalytical synthesis framework enables valuable physical\ninsights, opening the door to integration of efficient anisotropic MGs in\napplications requiring both polarization and wavefront control, such as\nsatellite, radar and advanced antenna systems.\n","subjects":["Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}