{"id":"2407.07202","title":"Quantum Approximate Optimization: A Computational Intelligence\n  Perspective","authors":"Christo Meriwether Keller, Satyajayant Misra, Andreas B\\\"artschi,\n  Stephan Eidenbenz","authorsParsed":[["Keller","Christo Meriwether",""],["Misra","Satyajayant",""],["Bärtschi","Andreas",""],["Eidenbenz","Stephan",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 19:40:23 GMT"}],"updateDate":"2024-07-11","timestamp":1720554023000,"abstract":"  Quantum computing is an emerging field on the multidisciplinary interface\nbetween physics, engineering, and computer science with the potential to make a\nlarge impact on computational intelligence (CI). The aim of this paper is to\nintroduce quantum approximate optimization methods to the CI community because\nof direct relevance to solving combinatorial problems. We introduce quantum\ncomputing and variational quantum algorithms (VQAs). VQAs are an effective\nmethod for the near-term implementation of quantum solutions on noisy\nintermediate-scale quantum (NISQ) devices with less reliable qubits and\nearly-stage error correction. Then, we explain Farhi et al.'s quantum\napproximate optimization algorithm (Farhi's QAOA, to prevent confusion). This\nVQA is generalized by Hadfield et al. to the quantum alternating operator\nansatz (QAOA), which is a nature-inspired (particularly, adiabatic) quantum\nmetaheuristic for approximately solving combinatorial optimization problems on\ngate-based quantum computers. We discuss connections of QAOA to relevant\ndomains, such as computational learning theory and genetic algorithms,\ndiscussing current techniques and known results regarding hybrid\nquantum-classical intelligence systems. We present a schematic of how QAOA is\nconstructed, and also discuss how CI techniques can be used to improve QAOA. We\nconclude with QAOA implementations for the well-known maximum cut, maximum\nbisection, and traveling salesperson problems, which can serve as templates for\nCI practitioners interested in using QAOA.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}