{"id":"2407.16201","title":"RadioSED I: Bayesian inference of radio SEDs from inhomogeneous surveys","authors":"Emily F. Kerrison, James R. Allison, Vanessa A. Moss, Elaine M. Sadler\n  and Glen A. Rees","authorsParsed":[["Kerrison","Emily F.",""],["Allison","James R.",""],["Moss","Vanessa A.",""],["Sadler","Elaine M.",""],["Rees","Glen A.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 06:06:41 GMT"}],"updateDate":"2024-07-24","timestamp":1721714801000,"abstract":"  We present here RadioSED, a Bayesian inference framework tailored to\nmodelling and classifying broadband radio spectral energy distributions (SEDs)\nusing only data from publicly-released, large-area surveys. We outline the\nfunctionality of RadioSED, with its focus on broadband radio emissions which\ncan trace kiloparsec-scale absorption within both the radio jets and the\ncircumgalactic medium of Active Galactic Nuclei (AGN). In particular, we\ndiscuss the capability of RadioSED to advance our understanding of AGN physics\nand composition within youngest and most compact sources, for which high\nresolution imaging is often unavailable. These young radio AGN typically\nmanifest as peaked spectrum (PS) sources which, before RadioSED, were difficult\nto identify owing to the large, broadband frequency coverage typically\nrequired, and yet they provide an invaluable environment for understanding AGN\nevolution and feedback. We discuss the implementation details of RadioSED, and\nwe validate our approach against both synthetic and observational data. Since\nthe surveys used are drawn from multiple epochs of observation, we also\nconsider the output from RadioSED in the context of AGN variability. Finally,\nwe show that RadioSED recovers the expected SED shapes for a selection of\nwell-characterised radio sources from the literature, and we discuss avenues\nfor further study of these and other sources using radio SED fitting as a\nstarting point. The scalability and modularity of this framework make it an\nexciting tool for multiwavelength astronomers as next-generation telescopes\nbegin several all-sky surveys. Accordingly, we make the code for RadioSED,\nwhich is written in Python, available on Github.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}