{"id":"2407.03928","title":"Quantum dynamics of frustrated Josephson junction arrays embedded in a\n  transmission line: an effective XX spin chain with long-range interaction","authors":"Benedikt J.P. Pernack, Mikhail V. Fistul and Ilya M. Eremin","authorsParsed":[["Pernack","Benedikt J. P.",""],["Fistul","Mikhail V.",""],["Eremin","Ilya M.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 13:40:08 GMT"}],"updateDate":"2024-07-10","timestamp":1720100408000,"abstract":"  We study theoretically a variety of collective quantum phases occurring in\nfrustrated saw-tooth chains of Josephson junctions embedded in a\ndissipationless transmission line. The basic element of a system, i.e., the\ntriangular superconducting cell, contains two $0$- and one $\\pi$- Josephson\njunctions characterized by $E_J$ and $\\alpha E_J$ Josephson energies,\naccordingly. In the frustrated regime the low energy quantum dynamics of a\nsingle cell is determined by anticlockwise or clockwise flowing persistent\ncurrents (vortex/antivortex). The direct embedding of $\\pi$-Josephson junctions\nin a transmission line allows to establish a short/long-range interaction\nbetween (anti)vortices of well separated cells. By making use of the\nvariational approach, we map the superconducting circuit Hamiltonian to an\neffective $XX$ spin model with an exchange spin-spin interaction decaying with\nthe distance $x$ as $x^{-\\beta}$, and the local $\\hat \\sigma_{x,n}$-terms\ncorresponding to the coherent quantum beats between vortex and antivortex in a\nsingle cell. We obtain that in long arrays as $N \\gg \\ell_0 \\simeq\n\\sqrt{C/C_0}$, where $C$ and $C_0$ are capacitances of $0$-Josephson junction\nand transmission line, accordingly, the amplitude of quantum beats is strongly\nsuppressed. By means of exact numerical diagonalization, we study the interplay\nbetween the coherent quantum beats and the exchange spin-spin interaction\nleading to the appearance of various collective quantum phases such as the\nparamagnetic ($P$), compressible superfluid ($CS$) and weakly compressible\nsuperfluid ($w$-$CS$) states.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Statistical Mechanics","Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/"}