{"id":"2407.02349","title":"System identification based on characteristic curves: a mathematical\n  connection between power series and Fourier analysis for first-order\n  nonlinear systems","authors":"Federico Javier Gonzalez","authorsParsed":[["Gonzalez","Federico Javier",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 15:15:32 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 11:51:44 GMT"}],"updateDate":"2024-07-04","timestamp":1719933332000,"abstract":"  Recently, the sinosoidal output response in power series (SORPS) formalism\nwas presented for system identification and simulation. Based on the concept of\ncharacteristic curves (CCs), it establishes a mathematical connection between\npower series and Fourier series for a first-order nonlinear system [F. J.\nGonzalez, Sci. Rep. 13, 1955, (2023)]. However, the system identification\nprocedure discussed there, based on fast Fourier transform (FFT), presents the\nlimitations of requiring a sinusoidal single tone for the dynamical variable\nand equally spaced time steps for the input-output dataset (DS). These\nlimitations are here addressed by introducing a different approach: we use a\npower series-based model for system modeling using two hyperparameters\n$\\hat{A}_0$ and $\\hat{A}_1$ optimally defined depending on the DS. Overall,\nthis work expands the applicability of the SORPS formalism to arbitrary DSs and\nrepresents a groundbreaking contribution for the concept of CCs. The method of\nCCs is complementary to the commonly used approaches of NARMAX-models and\nsparse regression techniques, which emphasize the estimation of the individual\nparameter values of the model. However, the CCs-based methods emphasize the\ncomputation of the CCs as a whole, thus presenting the advantages that the\nsystem identification is uniquely defined, and that it can be applied for any\nsystem without additional algebraic operations. Thus, the parsimonious\nprinciple defined by the NARMAX-philosophy is extended from the concept of a\nmodel with as few parameters as possible to the concept of finding the lowest\nmodel order that correctly describe the input-output DS. This opens up a wide\nvariety of potential applications in vibration analysis, structural dynamics,\nviscoelastic materials, nonlinear electric circuits, voltammetry techniques,\nstructural health monitoring, and fault diagnosis.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Physics/Mathematical Physics","Mathematics/Dynamical Systems","Mathematics/Mathematical Physics","Nonlinear Sciences/Chaotic Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}