{"id":"2407.00577","title":"FALCON: Fast Autonomous Aerial Exploration using Coverage Path Guidance","authors":"Yichen Zhang, Xinyi Chen, Chen Feng, Boyu Zhou, and Shaojie Shen","authorsParsed":[["Zhang","Yichen",""],["Chen","Xinyi",""],["Feng","Chen",""],["Zhou","Boyu",""],["Shen","Shaojie",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 03:38:23 GMT"}],"updateDate":"2024-07-02","timestamp":1719718703000,"abstract":"  This paper introduces FALCON, a novel Fast Autonomous expLoration framework\nusing COverage path guidaNce, which aims at setting a new performance benchmark\nin the field of autonomous aerial exploration. Despite recent advancements in\nthe domain, existing exploration planners often suffer from inefficiencies such\nas frequent revisitations of previously explored regions. FALCON effectively\nharnesses the full potential of online generated coverage paths in enhancing\nexploration efficiency. The framework begins with an incremental\nconnectivity-aware space decomposition and connectivity graph construction,\nwhich facilitate efficient coverage path planning. Subsequently, a hierarchical\nplanner generates a coverage path spanning the entire unexplored space, serving\nas a global guidance. Then, a local planner optimizes the frontier visitation\norder, minimizing traversal time while consciously incorporating the intention\nof the global guidance. Finally, minimum-time smooth and safe trajectories are\nproduced to visit the frontier viewpoints. For fair and comprehensive benchmark\nexperiments, we introduce a lightweight exploration planner evaluation\nenvironment that allows for comparing exploration planners across a variety of\ntesting scenarios using an identical quadrotor simulator. Additionally, a VECO\ncriteria is proposed for an in-depth analysis of FALCON's significant\nperformance in comparison with the state-of-the-art exploration planners.\nExtensive ablation studies demonstrate the effectiveness of each component in\nthe proposed framework. Real-world experiments conducted fully onboard further\nvalidate FALCON's practical capability in complex and challenging environments.\nThe source code of both the exploration planner FALCON and the exploration\nplanner evaluation environment will be released to benefit the community.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}