{"id":"2407.21723","title":"Coordinating Decisions via Quantum Telepathy","authors":"Dawei Ding, Liang Jiang","authorsParsed":[["Ding","Dawei",""],["Jiang","Liang",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 16:18:15 GMT"},{"version":"v2","created":"Tue, 10 Sep 2024 13:33:02 GMT"}],"updateDate":"2024-09-11","timestamp":1722442695000,"abstract":"  Quantum telepathy is the phenomenon where two non-communicating parties can\nexhibit correlated behaviors that are impossible to achieve using classical\nmechanics. This is also known as Bell inequality violation and is made possible\nby quantum entanglement. In this work, we present a conceptual framework for\napplying quantum telepathy to real-world problems. In general, the problems\ninvolve coordinating decisions given a set of observations without being able\nto communicate. We argue this inability is actually quite prevalent in the\nmodern era where the decision-making timescales of computer processors are so\nshort that the speed of light delay is actually quite appreciable in\ncomparison. We highlight the example of high-frequency trading (HFT), where\ntrades are made at microsecond timescales, but the speed of light delay between\ndifferent exchanges can range from the order of 100 microseconds to 10\nmilliseconds. Due to the maturity of Bell inequality violation experiments,\nexperimental realization of quantum telepathy schemes that can attain a quantum\nadvantage for real-world problems $\\textit{is already almost immediately\npossible}$. We demonstrate this by conducting a case study for a concrete HFT\nscenario that gives rise to a generalization of the CHSH game and evaluate\ndifferent possible physical implementations for achieving a quantum advantage.\nIt is well known that Bell inequality violation is a rigorous mathematical\nproof of a quantum advantage over any classical strategy and does not need any\ncomplexity-theoretic assumptions such as $\\text{BQP}\\neq\\text{BPP}$. Moreover,\nfault tolerance is not necessary to realize a quantum advantage: for example,\nviolating the CHSH inequality only requires single-qubit gates applied on two\nentangled physical qubits.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}