{"id":"2407.09522","title":"UQE: A Query Engine for Unstructured Databases","authors":"Hanjun Dai, Bethany Yixin Wang, Xingchen Wan, Bo Dai, Sherry Yang,\n  Azade Nova, Pengcheng Yin, Phitchaya Mangpo Phothilimthana, Charles Sutton,\n  Dale Schuurmans","authorsParsed":[["Dai","Hanjun",""],["Wang","Bethany Yixin",""],["Wan","Xingchen",""],["Dai","Bo",""],["Yang","Sherry",""],["Nova","Azade",""],["Yin","Pengcheng",""],["Phothilimthana","Phitchaya Mangpo",""],["Sutton","Charles",""],["Schuurmans","Dale",""]],"versions":[{"version":"v1","created":"Sun, 23 Jun 2024 06:58:55 GMT"}],"updateDate":"2024-07-16","timestamp":1719125935000,"abstract":"  Analytics on structured data is a mature field with many successful methods.\nHowever, most real world data exists in unstructured form, such as images and\nconversations. We investigate the potential of Large Language Models (LLMs) to\nenable unstructured data analytics. In particular, we propose a new Universal\nQuery Engine (UQE) that directly interrogates and draws insights from\nunstructured data collections. This engine accepts queries in a Universal Query\nLanguage (UQL), a dialect of SQL that provides full natural language\nflexibility in specifying conditions and operators. The new engine leverages\nthe ability of LLMs to conduct analysis of unstructured data, while also\nallowing us to exploit advances in sampling and optimization techniques to\nachieve efficient and accurate query execution. In addition, we borrow\ntechniques from classical compiler theory to better orchestrate the workflow\nbetween sampling methods and foundation model calls. We demonstrate the\nefficiency of UQE on data analytics across different modalities, including\nimages, dialogs and reviews, across a range of useful query types, including\nconditional aggregation, semantic retrieval and abstraction aggregation.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}