{"id":"2407.21275","title":"FreqTSF: Time Series Forecasting Via Capturing Intra- and Inter-Variable\n  Variations in the frequency domain","authors":"Rujia Shen, Yaoxion Lin, Liangliang Liu, Boran Wang, Yi Guan, Yang\n  Yang and Jingchi Jiang","authorsParsed":[["Shen","Rujia",""],["Lin","Yaoxion",""],["Liu","Liangliang",""],["Wang","Boran",""],["Guan","Yi",""],["Yang","Yang",""],["Jiang","Jingchi",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 01:50:39 GMT"},{"version":"v2","created":"Thu, 19 Sep 2024 17:35:03 GMT"}],"updateDate":"2024-09-20","timestamp":1722390639000,"abstract":"  Time series forecasting (TSF) is immensely important in extensive\napplications, such as electricity transformation, medical monitoring, and smart\nagriculture. Although deep learning methods have been proposed to handle time\nseries data and achieved superior performances, their ability to predict\nlong-term time series is limited due to overlooking intra- and inter-variable\nvariations in the frequency domain. To address this problem, we propose the\nFreqBlock, where we obtain frequency representations through the Frequency\nTransform Module. Subsequently, inspired by the inherent Kramer-Kronig\nrelations (KKRs) in the frequency domain, the Frequency Cross Attention between\nthe real and imaginary parts is designed to obtian enhanced frequency\nrepresentations and capture intra-variable variations. And then we use\ninception blocks to mix information to capture correlations between variables.\nOur backbone network, FreqTSF, adopts a residual structure by concatenating\nmultiple FreqBlocks to avoid degradation problems. On a theoretical level, we\ndemonstrate that the proposed two modules can significantly reduce the time and\nmemory complexity from $\\mathcal{O}(L^2)$ to $\\mathcal{O}(L)$ for each\nFreqBlock computation. Empirical studies on three benchmark datasets show that\nFreqTSF achieves an overall relative MSE reduction of 15\\% and an overall\nrelative MAE reduction of 11\\% compared to the state-of-the-art methods. The\ncode is available at \\url{https://github.com/HITshenrj/FreqTSF}.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}