{"id":"2407.18306","title":"Design and demonstration of an operating system for executing\n  applications on quantum network nodes","authors":"Carlo Delle Donne, Mariagrazia Iuliano, Bart van der Vecht, Guilherme\n  Maciel Ferreira, Hana Jirovsk\\'a, Thom van der Steenhoven, Axel Dahlberg,\n  Matt Skrzypczyk, Dario Fioretto, Markus Teller, Pavel Filippov, Alejandro\n  Rodr\\'iguez-Pardo Montblanch, Julius Fischer, Benjamin van Ommen, Nicolas\n  Demetriou, Dominik Leichtle, Luka Music, Harold Ollivier, Ingmar te Raa,\n  Wojciech Kozlowski, Tim Taminiau, Przemys{\\l}aw Pawe{\\l}czak, Tracy Northup,\n  Ronald Hanson, Stephanie Wehner","authorsParsed":[["Donne","Carlo Delle",""],["Iuliano","Mariagrazia",""],["van der Vecht","Bart",""],["Ferreira","Guilherme Maciel",""],["Jirovská","Hana",""],["van der Steenhoven","Thom",""],["Dahlberg","Axel",""],["Skrzypczyk","Matt",""],["Fioretto","Dario",""],["Teller","Markus",""],["Filippov","Pavel",""],["Montblanch","Alejandro Rodríguez-Pardo",""],["Fischer","Julius",""],["van Ommen","Benjamin",""],["Demetriou","Nicolas",""],["Leichtle","Dominik",""],["Music","Luka",""],["Ollivier","Harold",""],["Raa","Ingmar te",""],["Kozlowski","Wojciech",""],["Taminiau","Tim",""],["Pawełczak","Przemysław",""],["Northup","Tracy",""],["Hanson","Ronald",""],["Wehner","Stephanie",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 18:00:08 GMT"}],"updateDate":"2024-07-29","timestamp":1721930408000,"abstract":"  The goal of future quantum networks is to enable new internet applications\nthat are impossible to achieve using solely classical communication. Up to now,\ndemonstrations of quantum network applications and functionalities on quantum\nprocessors have been performed in ad-hoc software that was specific to the\nexperimental setup, programmed to perform one single task (the application\nexperiment) directly into low-level control devices using expertise in\nexperimental physics. Here, we report on the design and implementation of the\nfirst architecture capable of executing quantum network applications on quantum\nprocessors in platform-independent high-level software. We demonstrate the\narchitecture's capability to execute applications in high-level software, by\nimplementing it as a quantum network operating system -- QNodeOS -- and\nexecuting test programs including a delegated computation from a client to a\nserver on two quantum network nodes based on nitrogen-vacancy (NV) centers in\ndiamond. We show how our architecture allows us to maximize the use of quantum\nnetwork hardware, by multitasking different applications on a quantum network\nfor the first time. Our architecture can be used to execute programs on any\nquantum processor platform corresponding to our system model, which we\nillustrate by demonstrating an additional driver for QNodeOS for a trapped-ion\nquantum network node based on a single $^{40}\\text{Ca}^+$ atom. Our\narchitecture lays the groundwork for computer science research in the domain of\nquantum network programming, and paves the way for the development of software\nthat can bring quantum network technology to society.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Operating Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}