{"id":"2407.12184","title":"The object detection method aids in image reconstruction evaluation and\n  clinical interpretation of meniscal abnormalities","authors":"Natalia Konovalova, Aniket Tolpadi, Felix Liu, Zehra Akkaya, Felix\n  Gassert, Paula Giesler, Johanna Luitjens, Misung Han, Emma Bahroos, Sharmila\n  Majumdar and Valentina Pedoia","authorsParsed":[["Konovalova","Natalia",""],["Tolpadi","Aniket",""],["Liu","Felix",""],["Akkaya","Zehra",""],["Gassert","Felix",""],["Giesler","Paula",""],["Luitjens","Johanna",""],["Han","Misung",""],["Bahroos","Emma",""],["Majumdar","Sharmila",""],["Pedoia","Valentina",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 21:25:28 GMT"}],"updateDate":"2024-07-18","timestamp":1721165128000,"abstract":"  This study investigates the relationship between deep learning (DL) image\nreconstruction quality and anomaly detection performance, and evaluates the\nefficacy of an artificial intelligence (AI) assistant in enhancing\nradiologists' interpretation of meniscal anomalies on reconstructed images. A\nretrospective study was conducted using an in-house reconstruction and anomaly\ndetection pipeline to assess knee MR images from 896 patients. The original and\n14 sets of DL-reconstructed images were evaluated using standard reconstruction\nand object detection metrics, alongside newly developed box-based\nreconstruction metrics. Two clinical radiologists reviewed a subset of 50\npatients' images, both original and AI-assisted reconstructed, with subsequent\nassessment of their accuracy and performance characteristics. Results indicated\nthat the structural similarity index (SSIM) showed a weaker correlation with\nanomaly detection metrics (mAP, r=0.64, p=0.01; F1 score, r=0.38, p=0.18),\nwhile box-based SSIM had a stronger association with detection performance\n(mAP, r=0.81, p<0.01; F1 score, r=0.65, p=0.01). Minor SSIM fluctuations did\nnot affect detection outcomes, but significant changes reduced performance.\nRadiologists' AI-assisted evaluations demonstrated improved accuracy (86.0%\nwithout assistance vs. 88.3% with assistance, p<0.05) and interrater agreement\n(Cohen's kappa, 0.39 without assistance vs. 0.57 with assistance). An\nadditional review led to the incorporation of 17 more lesions into the dataset.\nThe proposed anomaly detection method shows promise in evaluating\nreconstruction algorithms for automated tasks and aiding radiologists in\ninterpreting DL-reconstructed MR images.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}