{"id":"2407.14209","title":"Unlearning Concepts from Text-to-Video Diffusion Models","authors":"Shiqi Liu, Yihua Tan","authorsParsed":[["Liu","Shiqi",""],["Tan","Yihua",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 11:15:02 GMT"}],"updateDate":"2024-07-22","timestamp":1721387702000,"abstract":"  With the advancement of computer vision and natural language processing,\ntext-to-video generation, enabled by text-to-video diffusion models, has become\nmore prevalent. These models are trained using a large amount of data from the\ninternet. However, the training data often contain copyrighted content,\nincluding cartoon character icons and artist styles, private portraits, and\nunsafe videos. Since filtering the data and retraining the model is\nchallenging, methods for unlearning specific concepts from text-to-video\ndiffusion models have been investigated. However, due to the high computational\ncomplexity and relative large optimization scale, there is little work on\nunlearning methods for text-to-video diffusion models. We propose a novel\nconcept-unlearning method by transferring the unlearning capability of the text\nencoder of text-to-image diffusion models to text-to-video diffusion models.\nSpecifically, the method optimizes the text encoder using few-shot unlearning,\nwhere several generated images are used. We then use the optimized text encoder\nin text-to-video diffusion models to generate videos. Our method costs low\ncomputation resources and has small optimization scale. We discuss the\ngenerated videos after unlearning a concept. The experiments demonstrates that\nour method can unlearn copyrighted cartoon characters, artist styles, objects\nand people's facial characteristics. Our method can unlearn a concept within\nabout 100 seconds on an RTX 3070. Since there was no concept unlearning method\nfor text-to-video diffusion models before, we make concept unlearning feasible\nand more accessible in the text-to-video domain.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}