{"id":"2407.17876","title":"A Large-Scale Sensitivity Analysis on Latent Embeddings and\n  Dimensionality Reductions for Text Spatializations","authors":"Daniel Atzberger, Tim Cech, Willy Scheibel, J\\\"urgen D\\\"ollner,\n  Michael Behrisch, Tobias Schreck","authorsParsed":[["Atzberger","Daniel",""],["Cech","Tim",""],["Scheibel","Willy",""],["Döllner","Jürgen",""],["Behrisch","Michael",""],["Schreck","Tobias",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 08:46:49 GMT"}],"updateDate":"2024-07-26","timestamp":1721897209000,"abstract":"  The semantic similarity between documents of a text corpus can be visualized\nusing map-like metaphors based on two-dimensional scatterplot layouts. These\nlayouts result from a dimensionality reduction on the document-term matrix or a\nrepresentation within a latent embedding, including topic models. Thereby, the\nresulting layout depends on the input data and hyperparameters of the\ndimensionality reduction and is therefore affected by changes in them.\nFurthermore, the resulting layout is affected by changes in the input data and\nhyperparameters of the dimensionality reduction. However, such changes to the\nlayout require additional cognitive efforts from the user. In this work, we\npresent a sensitivity study that analyzes the stability of these layouts\nconcerning (1) changes in the text corpora, (2) changes in the hyperparameter,\nand (3) randomness in the initialization. Our approach has two stages: data\nmeasurement and data analysis. First, we derived layouts for the combination of\nthree text corpora and six text embeddings and a grid-search-inspired\nhyperparameter selection of the dimensionality reductions. Afterward, we\nquantified the similarity of the layouts through ten metrics, concerning local\nand global structures and class separation. Second, we analyzed the resulting\n42817 tabular data points in a descriptive statistical analysis. From this, we\nderived guidelines for informed decisions on the layout algorithm and highlight\nspecific hyperparameter settings. We provide our implementation as a Git\nrepository at\nhttps://github.com/hpicgs/Topic-Models-and-Dimensionality-Reduction-Sensitivity-Study\nand results as Zenodo archive at https://doi.org/10.5281/zenodo.12772898.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}