{"id":"2407.15796","title":"Weight update in ferroelectric memristors with identical and\n  non-identical pulses","authors":"Suzanne Lancaster and Maximilien Remillieux and Moritz Engl and Viktor\n  Havel and Claudia Silva and Xuetao Wang and Thomas Mikolajick and Stefan\n  Slesazeck","authorsParsed":[["Lancaster","Suzanne",""],["Remillieux","Maximilien",""],["Engl","Moritz",""],["Havel","Viktor",""],["Silva","Claudia",""],["Wang","Xuetao",""],["Mikolajick","Thomas",""],["Slesazeck","Stefan",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 16:52:44 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 09:11:09 GMT"}],"updateDate":"2024-08-09","timestamp":1721667164000,"abstract":"  Ferroelectric tunnel junctions (FTJs) are a class of memristor which promise\nlow-power, scalable, field-driven analog operation. In order to harness their\nfull potential, operation with identical pulses is targeted. In this paper,\nseveral weight update schemes for FTJs are investigated, using either\nnon-identical or identical pulses, and with time delays between the pulses\nranging from 1 us to 10 s. Experimentally, a method for achieving non-linear\nweight update with identical pulses at long programming delays is demonstrated\nby limiting the switching current via a series resistor. Simulations show that\nthis concept can be expanded to achieve weight update in a 1T1C cell by\nlimiting the switching current through a transistor operating in sub-threshold\nor saturation mode. This leads to a maximum linearity in the weight update of\n86% for a dynamic range (maximum switched polarization) of 30 {\\mu}C/cm2. It is\nfurther demonstrated via simulation that engineering the device to achieve a\nnarrower switching peak increases the linearity in scaled devices to >93 % for\nthe same range.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2o96ZhFjRvYDWtVKo3WZOn51viMyqqYl3bqMZ7sCzNQ","pdfSize":"2048408"}
