{"id":"2407.00501","title":"Aeroengine performance prediction using a physical-embedded data-driven\n  method","authors":"Tong Mo, Shiran Dai, An Fu, Xiaomeng Zhu, Shuxiao Li","authorsParsed":[["Mo","Tong",""],["Dai","Shiran",""],["Fu","An",""],["Zhu","Xiaomeng",""],["Li","Shuxiao",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 17:56:58 GMT"}],"updateDate":"2024-07-02","timestamp":1719683818000,"abstract":"  Accurate and efficient prediction of aeroengine performance is of paramount\nimportance for engine design, maintenance, and optimization endeavours.\nHowever, existing methodologies often struggle to strike an optimal balance\namong predictive accuracy, computational efficiency, modelling complexity, and\ndata dependency. To address these challenges, we propose a strategy that\nsynergistically combines domain knowledge from both the aeroengine and neural\nnetwork realms to enable real-time prediction of engine performance parameters.\nLeveraging aeroengine domain knowledge, we judiciously design the network\nstructure and regulate the internal information flow. Concurrently, drawing\nupon neural network domain expertise, we devise four distinct feature fusion\nmethods and introduce an innovative loss function formulation. To rigorously\nevaluate the effectiveness and robustness of our proposed strategy, we conduct\ncomprehensive validation across two distinct datasets. The empirical results\ndemonstrate :(1) the evident advantages of our tailored loss function; (2) our\nmodel's ability to maintain equal or superior performance with a reduced\nparameter count; (3) our model's reduced data dependency compared to\ngeneralized neural network architectures; (4)Our model is more interpretable\nthan traditional black box machine learning methods.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}