{"id":"2407.21405","title":"3D Variational Inference-Based Double-Difference Seismic Tomography\n  Method and Application to the SAFOD Site, California","authors":"Hao Yang, Xin Zhang, Haijiang Zhang","authorsParsed":[["Yang","Hao",""],["Zhang","Xin",""],["Zhang","Haijiang",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 07:47:02 GMT"}],"updateDate":"2024-08-01","timestamp":1722412022000,"abstract":"  Seismic tomography is a crucial technique used to image subsurface structures\nat various scales, accomplished by solving a nonlinear and nonunique inverse\nproblem. It is therefore important to quantify velocity model uncertainties for\naccurate earthquake locations and geological interpretations. Monte Carlo\nsampling techniques are usually used for this purpose, but those methods are\ncomputationally intensive, especially for large datasets or high-dimensional\nparameter spaces. In comparison, Bayesian variational inference provides a more\nefficient alternative by delivering probabilistic solutions through\noptimization. The method has been proven to be efficient in 2D tomographic\nproblems. In this study, we apply variational inference to solve 3D\ndouble-difference (DD) seismic tomographic system using both absolute and\ndifferential travel time data. Synthetic tests demonstrate that the new method\ncan produce more accurate velocity models than the original DD tomography\nmethod by avoiding regularization constraints, and at the same time provides\nmore reliable uncertainty estimates. Compared to traditional checkerboard\nresolution tests, the resulting uncertainty estimates measure more accurately\nthe reliability of the solution. We further apply the new method to data\nrecorded by a local dense seismic array around the San Andreas Fault\nObservatory at Depth (SAFOD) site along the San Andreas Fault (SAF) at\nParkfield. Similar to other researches, the obtained velocity models show\nsignificant velocity contrasts across the fault. More importantly, the new\nmethod produces velocity uncertainties of less than 0.34 km/s for Vp and 0.23\nkm/s for Vs. We therefore conclude that variational inference provides a\npowerful and efficient tool for solving 3D seismic tomographic problems and\nquantifying model uncertainties.\n","subjects":["Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"41QGP4GniVFBkPK4l93yinXzHDu69RDMr1yXtaTYGUs","pdfSize":"3723891"}
