{"id":"2407.11407","title":"Accounting for Work Zone Disruptions in Traffic Flow Forecasting","authors":"Yuanjie Lu, Amarda Shehu, David Lattanzi","authorsParsed":[["Lu","Yuanjie",""],["Shehu","Amarda",""],["Lattanzi","David",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 05:48:24 GMT"}],"updateDate":"2024-07-17","timestamp":1721108904000,"abstract":"  Traffic speed forecasting is an important task in intelligent transportation\nsystem management. The objective of much of the current computational research\nis to minimize the difference between predicted and actual speeds, but\ninformation modalities other than speed priors are largely not taken into\naccount. In particular, though state of the art performance is achieved on\nspeed forecasting with graph neural network methods, these methods do not\nincorporate information on roadway maintenance work zones and their impacts on\npredicted traffic flows; yet, the impacts of construction work zones are of\nsignificant interest to roadway management agencies, because they translate to\nimpacts on the local economy and public well-being. In this paper, we build\nover the convolutional graph neural network architecture and present a novel\n``Graph Convolutional Network for Roadway Work Zones\" model that includes a\nnovel data fusion mechanism and a new heterogeneous graph aggregation\nmethodology to accommodate work zone information in spatio-temporal\ndependencies among traffic states. The model is evaluated on two data sets that\ncapture traffic flows in the presence of work zones in the Commonwealth of\nVirginia. Extensive comparative evaluation and ablation studies show that the\nproposed model can capture complex and nonlinear spatio-temporal relationships\nacross a transportation corridor, outperforming baseline models, particularly\nwhen predicting traffic flow during a workzone event.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}