{"id":"2407.17018","title":"ACA CO(J=2-1) Mapping of the Nearest Spiral Galaxy M33. II. Exploring\n  the Evolution of Giant Molecular Clouds","authors":"Ayu Konishi, Kazuyuki Muraoka, Kazuki Tokuda, Shinji Fujita, Yasuo\n  Fukui, Rin I. Yamada, Fumika Demachi, Kengo Tachihara, Masato I. N.\n  Kobayashi, Nario Kuno, Kisetsu Tsuge, Hidetoshi Sano, Rie E. Miura, Akiko\n  Kawamura, Toshikazu Onishi","authorsParsed":[["Konishi","Ayu",""],["Muraoka","Kazuyuki",""],["Tokuda","Kazuki",""],["Fujita","Shinji",""],["Fukui","Yasuo",""],["Yamada","Rin I.",""],["Demachi","Fumika",""],["Tachihara","Kengo",""],["Kobayashi","Masato I. N.",""],["Kuno","Nario",""],["Tsuge","Kisetsu",""],["Sano","Hidetoshi",""],["Miura","Rie E.",""],["Kawamura","Akiko",""],["Onishi","Toshikazu",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 05:58:03 GMT"}],"updateDate":"2024-08-30","timestamp":1721800683000,"abstract":"  The evolution of giant molecular clouds (GMCs), the main sites of high-mass\nstar formation, is an essential process to unravel the galaxy evolution. Using\na GMC catalogue of M33 from ALMA-ACA survey, we classified 848 GMCs into three\ntypes based on the association with HII regions and their H$\\alpha$\nluminosities $\\textit{L}$(H$\\alpha$): Type I is associated with no HII regions;\nType II with HII regions of $\\textit{L}$(H$\\alpha$) $<$ 10$^{37.5}$ erg\ns$^{-1}$; and Type III with HII regions of $\\textit{L}$(H$\\alpha$) $\\geqq$\n10$^{37.5}$ erg s$^{-1}$. These criteria yield 224 Type I GMCs, 473 Type II\nGMCs, and 151 Type III GMCs. GMCs show changes in their physical properties\naccording to the types; mass, radius, velocity dispersion, and $^{13}$CO\ndetection rate of GMCs systematically increase from Type I to Type III, and\nadditionally, Type III GMCs are closest to virial equilibrium. Type III GMCs\nshow the highest spatial correlation with clusters younger than 10 Myr, Type II\nGMCs moderate correlation, and Type I GMCs are almost uncorrelated. We\ninterpret that these types indicate an evolutionary sequence from Type I to\nType II, and then to Type III with timescales of 4 Myr, 13 Myr, and 5 Myr,\nrespectively, indicating the GMC lifetime of 22 Myr by assuming that Type II\nGMC has the same timescale as the Large Magellanic Cloud. The evolved GMCs\nconcentrate on the spiral arms, while the younger GMCs are apart from the arm\nboth to the leading and trailing sides. This indicated that GMCs collide with\neach other by the spiral potential, leading to the compression of GMCs and the\ntriggering of high-mass star formation, which may support the dynamic spiral\nmodel. Overall, we suggest that the GMC evolution concept helps illuminate the\ngalaxy evolution, including the spiral arm formation.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}