{"id":"2407.12093","title":"Relevance of Anisotropy in the Kondo Effect -- Lessons From the\n  Symplectic Case","authors":"Matan Lotem, Sarath Sankar, Tianhao Ren, Moshe Goldstein, Elio. J.\n  K\\\"onig, Andreas Weichselbaum, Eran Sela, and Alexei M. Tsvelik","authorsParsed":[["Lotem","Matan",""],["Sankar","Sarath",""],["Ren","Tianhao",""],["Goldstein","Moshe",""],["König","Elio. J.",""],["Weichselbaum","Andreas",""],["Sela","Eran",""],["Tsvelik","Alexei M.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 18:01:18 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 08:35:49 GMT"}],"updateDate":"2024-08-07","timestamp":1721152878000,"abstract":"  A Kondo model with symplectic symmetry was recently put forward as the\neffective low-energy theory of a superconducting-island device coupled to\nmultiple leads. This model, which possesses non-Fermi liquid physics and\neffective anyons, was argued to belong to the class of topological Kondo\neffects. Here, we clarify the extent of stability of its exotic fixed point\nusing perturbative and numerical renormalization group in conjunction with\nbosonization and conformal field theory. In contrast to previous claims, we\nshow that asymmetry in the coupling to the leads destabilizes the non-Fermi\nliquid. Other destabilizing perturbations include asymmetry in the\nsuperconducting pairing or internal energy of the individual quantum dots in\nthe island. Nevertheless, these perturbations all generate the same relevant\noperators. Thus, only a small number of couplings need to be tuned\nindividually, and these can be selected according to experimental convenience.\nOur results highlight a common misconception that anisotropy in the Kondo\ncoupling is always irrelevant. As demonstrated, relevant terms will emerge\nwhenever the group generators do not span the full space of impurity operators.\nThis calls for a more detailed inspection of models that exhibit this property,\nsuch as large-spin impurities and SO(M) Kondo models\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}