{"id":"2407.18723","title":"LLASP: Fine-tuning Large Language Models for Answer Set Programming","authors":"Erica Coppolillo, Francesco Calimeri, Giuseppe Manco, Simona Perri and\n  Francesco Ricca","authorsParsed":[["Coppolillo","Erica",""],["Calimeri","Francesco",""],["Manco","Giuseppe",""],["Perri","Simona",""],["Ricca","Francesco",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 13:18:42 GMT"}],"updateDate":"2024-07-29","timestamp":1721999922000,"abstract":"  Recently, Large Language Models (LLMs) have showcased their potential in\nvarious natural language processing tasks, including code generation. However,\nwhile significant progress has been made in adapting LLMs to generate code for\nseveral imperative programming languages and tasks, there remains a notable gap\nin their application to declarative formalisms, such as Answer Set Programming\n(ASP). In this paper, we move a step towards exploring the capabilities of LLMs\nfor ASP code generation. First, we perform a systematic evaluation of several\nstate-of-the-art LLMs. Despite their power in terms of number of parameters,\ntraining data and computational resources, empirical results demonstrate\ninadequate performances in generating correct ASP programs. Therefore, we\npropose LLASP, a fine-tuned lightweight model specifically trained to encode\nfundamental ASP program patterns. To this aim, we create an ad-hoc dataset\ncovering a wide variety of fundamental problem specifications that can be\nencoded in ASP. Our experiments demonstrate that the quality of ASP programs\ngenerated by LLASP is remarkable. This holds true not only when compared to the\nnon-fine-tuned counterpart but also when compared to the majority of eager LLM\ncandidates, particularly from a semantic perspective. All the code and data\nused to perform the experiments are publicly available at\nhttps://anonymous.4open.science/r/LLASP-D86C/.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Logic in Computer Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"nqpSFBRgrYnX4GUGrajg4GGQ5aB3XWErJSnJWtkwT04","pdfSize":"442694"}
