{"id":"2407.14931","title":"POGEMA: A Benchmark Platform for Cooperative Multi-Agent Navigation","authors":"Alexey Skrynnik, Anton Andreychuk, Anatolii Borzilov, Alexander\n  Chernyavskiy, Konstantin Yakovlev, Aleksandr Panov","authorsParsed":[["Skrynnik","Alexey",""],["Andreychuk","Anton",""],["Borzilov","Anatolii",""],["Chernyavskiy","Alexander",""],["Yakovlev","Konstantin",""],["Panov","Aleksandr",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 16:37:21 GMT"}],"updateDate":"2024-07-23","timestamp":1721493441000,"abstract":"  Multi-agent reinforcement learning (MARL) has recently excelled in solving\nchallenging cooperative and competitive multi-agent problems in various\nenvironments with, mostly, few agents and full observability. Moreover, a range\nof crucial robotics-related tasks, such as multi-robot navigation and obstacle\navoidance, that have been conventionally approached with the classical\nnon-learnable methods (e.g., heuristic search) is currently suggested to be\nsolved by the learning-based or hybrid methods. Still, in this domain, it is\nhard, not to say impossible, to conduct a fair comparison between classical,\nlearning-based, and hybrid approaches due to the lack of a unified framework\nthat supports both learning and evaluation. To this end, we introduce POGEMA, a\nset of comprehensive tools that includes a fast environment for learning, a\ngenerator of problem instances, the collection of pre-defined ones, a\nvisualization toolkit, and a benchmarking tool that allows automated\nevaluation. We introduce and specify an evaluation protocol defining a range of\ndomain-related metrics computed on the basics of the primary evaluation\nindicators (such as success rate and path length), allowing a fair multi-fold\ncomparison. The results of such a comparison, which involves a variety of\nstate-of-the-art MARL, search-based, and hybrid methods, are presented.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by/4.0/"}