{"id":"2407.01177","title":"Towards characterising rocky worlds: Trends in chemical make-ups of M\n  dwarfs versus GK dwarfs","authors":"Haiyang S. Wang, Sascha P. Quanz, Suvrath Mahadevan, and Morgan Deal","authorsParsed":[["Wang","Haiyang S.",""],["Quanz","Sascha P.",""],["Mahadevan","Suvrath",""],["Deal","Morgan",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 11:01:09 GMT"}],"updateDate":"2024-08-28","timestamp":1719831669000,"abstract":"  Elemental abundances of Sun-like stars are crucial for understanding the\ndetailed properties of their planets. However, measuring elemental abundances\nin M stars is challenging due to their faintness and pervasive molecular\nfeatures in optical spectra. To address this, elemental abundances of Sun-like\nstars have been proposed to constrain those of M stars by scaling [X/H] with\nmeasured [Fe/H]. This study tests the robustness of this practice using M- and\nGK-dwarf stellar abundances and rigorous statistical methods. We compile\nelemental abundances for 43 M dwarfs for 10 major rock-forming elements (Fe, C,\nO, Mg, Si, Al, Ca, Na, Ni, and Ti) from high-resolution near-infrared stellar\nsurveys. We perform bootstrap-based linear regressions on the M dwarfs to\ndetermine the trends of [X/H] vs. [Fe/H] and compare them with GK dwarfs. A\n2-sample, multivariate Mahalanobis Distance test is applied to assess the\nsignificance of differences in [X/H]--[Fe/H] trends for individual elemental\npairs between M and GK dwarfs. The null hypothesis of no significant difference\nin chemical trends between M and GK dwarfs is strongly rejected for all\nelements except Si, for which rejection is marginal, and Na and Ni, for which\nresults are inconclusive. This suggests that assuming no difference may lead to\nbiased results and inaccurate constraints on rocky planets around M dwarfs.\nTherefore, it is crucial for both the stellar and exoplanet communities to\nrecognise these differences. To better understand these differences, we\nadvocate for dedicated modelling techniques for M dwarf atmospheres and more\nhomogeneous abundance analyses. Our statistically constrained trends of\n[X/H]--[Fe/H] for M dwarfs offer a new constraint on estimating M-dwarf\nelemental abundances given measured [Fe/H], aiding in characterising the\nproperties of M dwarf-hosted rocky worlds.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lbMvncEMRrgMwd9brQXdUoNciyWgETqqXp1DaNp-7O4","pdfSize":"4613625"}
