{"id":"2407.10275","title":"Cross-Lingual Multi-Hop Knowledge Editing -- Benchmarks, Analysis and a\n  Simple Contrastive Learning based Approach","authors":"Aditi Khandelwal, Harman Singh, Hengrui Gu, Tianlong Chen, Kaixiong\n  Zhou","authorsParsed":[["Khandelwal","Aditi",""],["Singh","Harman",""],["Gu","Hengrui",""],["Chen","Tianlong",""],["Zhou","Kaixiong",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 17:18:16 GMT"}],"updateDate":"2024-07-16","timestamp":1720977496000,"abstract":"  Large language models are often expected to constantly adapt to new sources\nof knowledge and knowledge editing techniques aim to efficiently patch the\noutdated model knowledge, with minimal modification. Most prior works focus on\nmonolingual knowledge editing in English, even though new information can\nemerge in any language from any part of the world. We propose the Cross-Lingual\nMulti-Hop Knowledge Editing paradigm, for measuring and analyzing the\nperformance of various SoTA knowledge editing techniques in a cross-lingual\nsetup. Specifically, we create a parallel cross-lingual benchmark,\nCROLIN-MQUAKE for measuring the knowledge editing capabilities. Our extensive\nanalysis over various knowledge editing techniques uncover significant gaps in\nperformance between the cross-lingual and English-centric setting. Following\nthis, we propose a significantly improved system for cross-lingual multi-hop\nknowledge editing, CLEVER-CKE. CLEVER-CKE is based on a retrieve, verify and\ngenerate knowledge editing framework, where a retriever is formulated to recall\nedited facts and support an LLM to adhere to knowledge edits. We develop\nlanguage-aware and hard-negative based contrastive objectives for improving the\ncross-lingual and fine-grained fact retrieval and verification process used in\nthis framework. Extensive experiments on three LLMs, eight languages, and two\ndatasets show CLEVER-CKE's significant gains of up to 30% over prior methods.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}