{"id":"2407.10936","title":"Coupling Fluid Plasma and Kinetic Neutral Models using Correlated Monte\n  Carlo Methods","authors":"Gregory J. Parker, Maxim V. Umansky, Benjamin D. Dudson","authorsParsed":[["Parker","Gregory J.",""],["Umansky","Maxim V.",""],["Dudson","Benjamin D.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:36:38 GMT"}],"updateDate":"2024-07-16","timestamp":1721064998000,"abstract":"  While boundary plasmas in present day tokamaks generally fall in a fluid\nregime, neutral species near the boundary often require kinetic models due to\nlong mean-free-paths compared to characteristic spatial scales in the region.\nMonte-Carlo (MC) methods provide a complete, high-fidelity approach to solving\nkinetic models, and must be coupled to fluid plasma models to simulate the full\nplasma-neutrals system. The statistical nature of MC methods, however, prevents\nconvergence of coupled fluid-kinetic simulations to an exact self-consistent\nsteady-state. Moreover, this forces the use of explicit methods that can suffer\nfrom numerical errors and require huge computational resources.\n  Correlated Monte-Carlo (CMC) methods are expected to alleviate these issues,\nbut have historically enjoyed only mixed success. Here, a fully implicit method\nfor coupled plasma-neutral systems is demonstrated in 1D using the UEDGE plasma\ncode and a homemade CMC code. In particular, it is shown that ensuring the CMC\nmethod is a differentiable function of the background plasma is sufficient to\nemploy a Jacobian-Free Newton-Krylov solver for implicit time steps. The\nconvergence of the implicit coupling method is explored and compared with\nexplicit coupling and uncorrelated methods. It is shown that ensuring\ndifferentiability by controlling random seeds in the MC is sufficient to\nachieve convergence, and that the use of implicit time-stepping methods has the\npotential for improved stability and runtimes over explicit coupling methods.\n","subjects":["Physics/Plasma Physics","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}