{"id":"2407.14562","title":"Thought-Like-Pro: Enhancing Reasoning of Large Language Models through\n  Self-Driven Prolog-based Chain-of-Thought","authors":"Xiaoyu Tan (1), Yongxin Deng (2), Xihe Qiu (2), Weidi Xu (1), Chao Qu\n  (1), Wei Chu (1), Yinghui Xu (3), Yuan Qi (3) ((1) INF Technology (Shanghai)\n  Co., Ltd., (2) Shanghai University of Engineering Science, (3) Fudan\n  University)","authorsParsed":[["Tan","Xiaoyu",""],["Deng","Yongxin",""],["Qiu","Xihe",""],["Xu","Weidi",""],["Qu","Chao",""],["Chu","Wei",""],["Xu","Yinghui",""],["Qi","Yuan",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 18:52:10 GMT"},{"version":"v2","created":"Sat, 10 Aug 2024 06:54:20 GMT"}],"updateDate":"2024-08-13","timestamp":1721328730000,"abstract":"  Large language models (LLMs) have shown exceptional performance as\ngeneral-purpose assistants, excelling across a variety of reasoning tasks. This\nachievement represents a significant step toward achieving artificial general\nintelligence (AGI). Despite these advancements, the effectiveness of LLMs often\nhinges on the specific prompting strategies employed, and there remains a lack\nof a robust framework to facilitate learning and generalization across diverse\nreasoning tasks. To address these challenges, we introduce a novel learning\nframework, THOUGHT-LIKE-PRO In this framework, we utilize imitation learning to\nimitate the Chain-of-Thought (CoT) process which is verified and translated\nfrom reasoning trajectories generated by a symbolic Prolog logic engine. This\nframework proceeds in a self-driven manner, that enables LLMs to formulate\nrules and statements from given instructions and leverage the symbolic Prolog\nengine to derive results. Subsequently, LLMs convert Prolog-derived successive\nreasoning trajectories into natural language CoT for imitation learning. Our\nempirical findings indicate that our proposed approach substantially enhances\nthe reasoning abilities of LLMs and demonstrates robust generalization across\nout-of-distribution reasoning tasks.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}