{"id":"2407.12024","title":"Leveraging Large Language Models for enhanced personalised user\n  experience in Smart Homes","authors":"Jordan Rey-Jouanchicot (IRIT-ELIPSE, LAAS), Andr\\'e Bottaro, Eric\n  Campo (LAAS-S4M), Jean-L\\'eon Bouraoui, Nadine Vigouroux (IRIT-ELIPSE),\n  Fr\\'ed\\'eric Vella (IRIT-ELIPSE)","authorsParsed":[["Rey-Jouanchicot","Jordan","","IRIT-ELIPSE, LAAS"],["Bottaro","André","","LAAS-S4M"],["Campo","Eric","","LAAS-S4M"],["Bouraoui","Jean-Léon","","IRIT-ELIPSE"],["Vigouroux","Nadine","","IRIT-ELIPSE"],["Vella","Frédéric","","IRIT-ELIPSE"]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 07:08:20 GMT"}],"updateDate":"2024-07-18","timestamp":1719558500000,"abstract":"  Smart home automation systems aim to improve the comfort and convenience of\nusers in their living environment. However, adapting automation to user needs\nremains a challenge. Indeed, many systems still rely on hand-crafted routines\nfor each smart object.This paper presents an original smart home architecture\nleveraging Large Language Models (LLMs) and user preferences to push the\nboundaries of personalisation and intuitiveness in the home environment.This\narticle explores a human-centred approach that uses the general knowledge\nprovided by LLMs to learn and facilitate interactions with the environment.The\nadvantages of the proposed model are demonstrated on a set of scenarios, as\nwell as a comparative analysis with various LLM implementations. Some metrics\nare assessed to determine the system's ability to maintain comfort, safety, and\nuser preferences. The paper details the approach to real-world implementation\nand evaluation.The proposed approach of using preferences shows up to 52.3%\nincrease in average grade, and with an average processing time reduced by 35.6%\non Starling 7B Alpha LLM. In addition, performance is 26.4% better than the\nresults of the larger models without preferences, with processing time almost\n20 times faster.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}