{"id":"2407.20560","title":"Invariant deep neural networks under the finite group for solving\n  partial differential equations","authors":"Zhi-Yong Zhang, Jie-Ying Li, Lei-Lei Guo","authorsParsed":[["Zhang","Zhi-Yong",""],["Li","Jie-Ying",""],["Guo","Lei-Lei",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 05:28:10 GMT"}],"updateDate":"2024-07-31","timestamp":1722317290000,"abstract":"  Utilizing physics-informed neural networks (PINN) to solve partial\ndifferential equations (PDEs) becomes a hot issue and also shows its great\npowers, but still suffers from the dilemmas of limited predicted accuracy in\nthe sampling domain and poor prediction ability beyond the sampling domain\nwhich are usually mitigated by adding the physical properties of PDEs into the\nloss function or by employing smart techniques to change the form of loss\nfunction for special PDEs. In this paper, we design a symmetry-enhanced deep\nneural network (sDNN) which makes the architecture of neural networks invariant\nunder the finite group through expanding the dimensions of weight matrixes and\nbias vectors in each hidden layers by the order of finite group if the group\nhas matrix representations, otherwise extending the set of input data and the\nhidden layers except for the first hidden layer by the order of finite group.\nHowever, the total number of training parameters is only about one over the\norder of finite group of the original PINN size due to the symmetric\narchitecture of sDNN. Furthermore, we give special forms of weight matrixes and\nbias vectors of sDNN, and rigorously prove that the architecture itself is\ninvariant under the finite group and the sDNN has the universal approximation\nability to learn the function keeping the finite group. Numerical results show\nthat the sDNN has strong predicted abilities in and beyond the sampling domain\nand performs far better than the vanilla PINN with fewer training points and\nsimpler architecture.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}