{"id":"2407.19029","title":"The winds, metallicity, rotational velocities and mass loss rate of the\n  hot, contact binary TU Muscae (HD100213)","authors":"Raymond J. Pfeiffer","authorsParsed":[["Pfeiffer","Raymond J.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 18:14:05 GMT"}],"updateDate":"2024-07-30","timestamp":1722017645000,"abstract":"  A model of the TU Muscae binary system has been developed by a study of 23\nSWP spectrophotometric images obtained with the IUE satellite telescope and\ndownloaded from the IUE Archive. The images are well distributed in Keplerian\norbital phase thereby permitting a simultaneous fitting of the C IV wind-line\nprofile by the SEI method and the light curve for the same bandpass by means of\na program similar to that of Wilson and Devinney. The result is a set of\nparameters characterizing the physical and geometric properties of the wind\nenvelopes surrounding the stars.\n  Surprisingly, there is no evidence for a P Cygni profile or strong,\ndistinguishable shock front in the system, as has been found for similar\ninvestigations of EM Carinae and HD159176. This is probably a result of the\ncontact nature of the binary and the high temperature environment of such a\nshock. That is, most of the carbon ions in the shock are more highly ionized.\nBased on the parameters for the SEI fit to the C IV profile, the value for the\nionization fraction of C IV in the wind was calculated to be 10-4. With this\nvalue, the mass loss rate calculated from two independent equations, was found\nto be about 10-6 solar masses/yr. The line blanketing or metallicity was found\nto be erratically variable with orbital phase and time, indicating a variable\namount of fast moving, dense clouds in the winds and/or a great amount of\nturbulence. The meaning of rotational velocities for the stars is problematic\nand depends on what point on the photospheres one is considering.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ehBn7ekZDsRWflWlVHbJPpge_1RYNmSQjivBHHvAnXI","pdfSize":"782516"}
