{"id":"2407.08261","title":"The OPNV Data Collection: A Dataset for Infrastructure-Supported\n  Perception Research with Focus on Public Transportation","authors":"Marcel Vosshans, Alexander Baumann, Matthias Drueppel, Omar Ait-Aider,\n  Ralf Woerner, Youcef Mezouar, Thao Dang and Markus Enzweiler","authorsParsed":[["Vosshans","Marcel",""],["Baumann","Alexander",""],["Drueppel","Matthias",""],["Ait-Aider","Omar",""],["Woerner","Ralf",""],["Mezouar","Youcef",""],["Dang","Thao",""],["Enzweiler","Markus",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 08:00:46 GMT"}],"updateDate":"2024-07-12","timestamp":1720684846000,"abstract":"  This paper we present our vision and ongoing work for a novel dataset\ndesigned to advance research into the interoperability of intelligent vehicles\nand infrastructure, specifically aimed at enhancing cooperative perception and\ninteraction in the realm of public transportation. Unlike conventional datasets\ncentered on ego-vehicle data, this approach encompasses both a stationary\nsensor tower and a moving vehicle, each equipped with cameras, LiDARs, and\nGNSS, while the vehicle additionally includes an inertial navigation system.\nOur setup features comprehensive calibration and time synchronization, ensuring\nseamless and accurate sensor data fusion crucial for studying complex, dynamic\nscenes. Emphasizing public transportation, the dataset targets to include\nscenes like bus station maneuvers and driving on dedicated bus lanes,\nreflecting the specifics of small public buses. We introduce the open-source\n\".4mse\" file format for the new dataset, accompanied by a research kit. This\nkit provides tools such as ego-motion compensation or LiDAR-to-camera\nprojection enabling advanced research on intelligent vehicle-infrastructure\nintegration. Our approach does not include annotations; however, we plan to\nimplement automatically generated labels sourced from state-of-the-art public\nrepositories. Several aspects are still up for discussion, and timely feedback\nfrom the community would be greatly appreciated. A sneak preview on one data\nframe will be available at a Google Colab Notebook. Moreover, we will use the\nrelated GitHub Repository to collect remarks and suggestions.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/"}