{"id":"2407.03802","title":"Beyond Gaussian fluctuations of quantum anharmonic nuclei","authors":"Antonio Siciliano, Lorenzo Monacelli, Francesco Mauri","authorsParsed":[["Siciliano","Antonio",""],["Monacelli","Lorenzo",""],["Mauri","Francesco",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 10:14:34 GMT"}],"updateDate":"2024-07-08","timestamp":1720088074000,"abstract":"  The Self-Consistent Harmonic Approximation (SCHA) describes atoms in solids,\nincluding quantum fluctuations and anharmonic effects, in a non-perturbative\nway. It computes ionic free energy variationally, constraining the atomic\nquantum-thermal fluctuations to be Gaussian. Consequently, the entropy is\nanalytical; there is no need for thermodynamic integration or heavy\ndiagonalization to include finite temperature effects. In addition, as the\nprobability distribution is fixed, SCHA solves all the equations with Monte\nCarlo integration without employing Metropolis sampling of the quantum phase\nspace. Unfortunately, the Gaussian approximation breaks down for rotational\nmodes and tunneling effects. We show how to describe these non-Gaussian\nfluctuations using the quantum variational principle at finite temperatures,\nkeeping the main advantage of SCHA: direct access to free energy. Our method,\nnonlinear SCHA (NLSCHA), employs an invertible nonlinear transformation to map\nCartesian coordinates into an auxiliary manifold parametrized by a finite set\nof variables. So, we adopt a Gaussian \\textit{ansatz} for the density matrix in\nthis new coordinate system. The nonlinearity of the mapping ensures that NLSCHA\nenlarges the SCHA variational subspace, and its invertibility conserves the\ninformation encoded in the density matrix. We evaluate the entropy in the\nauxiliary space, where it has a simple analytical form. As in the SCHA, the\nvariational principle allows for optimizing free parameters to minimize free\nenergy. Finally, we show that, for the first time, NLSCHA gives direct access\nto the entropy of a crystal with non-Gaussian degrees of freedom.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lLMYMt1Yl1pQ1VEun3kdGHTzVPyZjw_ktpMch5uv0xo","pdfSize":"7121965"}
