{"id":"2407.01811","title":"Active Human Pose Estimation via an Autonomous UAV Agent","authors":"Jingxi Chen, Botao He, Chahat Deep Singh, Cornelia Fermuller, Yiannis\n  Aloimonos","authorsParsed":[["Chen","Jingxi",""],["He","Botao",""],["Singh","Chahat Deep",""],["Fermuller","Cornelia",""],["Aloimonos","Yiannis",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 21:20:52 GMT"}],"updateDate":"2024-07-03","timestamp":1719868852000,"abstract":"  One of the core activities of an active observer involves moving to secure a\n\"better\" view of the scene, where the definition of \"better\" is task-dependent.\nThis paper focuses on the task of human pose estimation from videos capturing a\nperson's activity. Self-occlusions within the scene can complicate or even\nprevent accurate human pose estimation. To address this, relocating the camera\nto a new vantage point is necessary to clarify the view, thereby improving 2D\nhuman pose estimation. This paper formalizes the process of achieving an\nimproved viewpoint. Our proposed solution to this challenge comprises three\nmain components: a NeRF-based Drone-View Data Generation Framework, an On-Drone\nNetwork for Camera View Error Estimation, and a Combined Planner for devising a\nfeasible motion plan to reposition the camera based on the predicted errors for\ncamera views. The Data Generation Framework utilizes NeRF-based methods to\ngenerate a comprehensive dataset of human poses and activities, enhancing the\ndrone's adaptability in various scenarios. The Camera View Error Estimation\nNetwork is designed to evaluate the current human pose and identify the most\npromising next viewing angles for the drone, ensuring a reliable and precise\npose estimation from those angles. Finally, the combined planner incorporates\nthese angles while considering the drone's physical and environmental\nlimitations, employing efficient algorithms to navigate safe and effective\nflight paths. This system represents a significant advancement in active 2D\nhuman pose estimation for an autonomous UAV agent, offering substantial\npotential for applications in aerial cinematography by improving the\nperformance of autonomous human pose estimation and maintaining the operational\nsafety and efficiency of UAVs.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}