{"id":"2407.18172","title":"Chip-scale sensor for spectroscopic metrology","authors":"Chunhui Yao, Wanlu Zhang, Peng Bao, Jie Ma, Wei Zhuo, Minjia Chen,\n  Zhitian Shi, Jingwen Zhou, Yuxiao Ye, Liang Ming, Ting Yan, Richard Penty,\n  and Qixiang Cheng","authorsParsed":[["Yao","Chunhui",""],["Zhang","Wanlu",""],["Bao","Peng",""],["Ma","Jie",""],["Zhuo","Wei",""],["Chen","Minjia",""],["Shi","Zhitian",""],["Zhou","Jingwen",""],["Ye","Yuxiao",""],["Ming","Liang",""],["Yan","Ting",""],["Penty","Richard",""],["Cheng","Qixiang",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 16:34:10 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 07:40:11 GMT"},{"version":"v3","created":"Mon, 12 Aug 2024 08:27:53 GMT"},{"version":"v4","created":"Sat, 14 Sep 2024 23:18:56 GMT"}],"updateDate":"2024-09-17","timestamp":1721925250000,"abstract":"  Miniaturized spectrometers hold great promise for in situ, in vitro, and even\nin vivo sensing applications. However, their size reduction imposes vital\nperformance constraints in meeting the rigorous demands of spectroscopy,\nincluding fine resolution, high accuracy, and ultra-wide observation window.\nThe prevailing view in the community holds that miniaturized spectrometers are\nmost suitable for the coarse identification of signature peaks. In this paper,\nwe present an integrated reconstructive spectrometer that enables near-infrared\n(NIR) spectroscopic metrology, and demonstrate a fully packaged sensor with\nauxiliary electronics. Such a sensor operates over a 520 nm bandwidth together\nwith a resolution of less than 8 pm, which translates into a record-breaking\nbandwidth-to-resolution ratio of over 65,000. The classification of different\ntypes of solid substances and the concentration measurement of aqueous and\norganic solutions are performed, all achieving approximately 100% accuracy.\nNotably, the detection limit of our sensor matches that of the commercial\nbenchtop counterparts, which is as low as 0.1% (i.e. 100 mg/dL) for identifying\nthe concentration of glucose solution.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5GUrOQIW7q-9vjbiWkX9i9NEFeEh5i_n1ktkvlWjCgI","pdfSize":"5191065"}
