{"id":"2407.04531","title":"Neutral atomic and molecular gas dynamics in the nearby spiral galaxies\n  NGC 1512, NGC 4535, and NGC 7496","authors":"Sebastian Laudage, Cosima Eibensteiner, Frank Bigiel, Adam K. Leroy,\n  Sharon Meidt, Eva Schinnerer, W.J.G. de Blok, Miguele Querejeta, Sophia\n  Stuber, Dario Colombo, Erik Rosolowsky, D.J. Pisano, Dyas Utomo, Rebecca C.\n  Levy, Ralf Klessen, Yixian Cao, Eric W. Koch, Sushma Kurapati, Patricia\n  Sanchez-Blazquez, Justus Neumann, Lukas Neumann, Hsi-An Pan, Thomas G.\n  Williams","authorsParsed":[["Laudage","Sebastian",""],["Eibensteiner","Cosima",""],["Bigiel","Frank",""],["Leroy","Adam K.",""],["Meidt","Sharon",""],["Schinnerer","Eva",""],["de Blok","W. J. G.",""],["Querejeta","Miguele",""],["Stuber","Sophia",""],["Colombo","Dario",""],["Rosolowsky","Erik",""],["Pisano","D. J.",""],["Utomo","Dyas",""],["Levy","Rebecca C.",""],["Klessen","Ralf",""],["Cao","Yixian",""],["Koch","Eric W.",""],["Kurapati","Sushma",""],["Sanchez-Blazquez","Patricia",""],["Neumann","Justus",""],["Neumann","Lukas",""],["Pan","Hsi-An",""],["Williams","Thomas G.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 14:18:50 GMT"}],"updateDate":"2024-07-08","timestamp":1720189130000,"abstract":"  Neutral atomic gas (HI) effectively traces galactic dynamics across mid to\nlarge galactocentric radii. However, its limitations in observing small-scale\nchanges within the central few kiloparsecs, coupled with the often observed HI\ndeficit in galactic centers, necessitates using molecular gas emission as a\npreferred tracer in these regions. Understanding the dynamics of both neutral\natomic and molecular gas is crucial for a more complete understanding of how\ngalaxies evolve, funnel gas from the outer disk into their central parts, and\neventually form stars. In this work we aim to quantify the dynamics of both,\nthe neutral atomic and molecular gas, in the nearby spiral galaxies NGC 1512,\nNGC 4535, and NGC 7496 using new MeerKAT-HI observations together with ALMA CO\n(2-1) observations from the PHANGS collaboration. We use the analysis tool\n3D-Barolo to fit tilted ring models to the HI and CO observations. A combined\napproach of using the HI to constrain the true disk orientation parameters\nbefore applying these to the CO datasets is tested. This paper sets\nexpectations for the results of the upcoming high-resolution HI coverage of\nmany galaxies in the PHANGS-ALMA sample using MeerKAT or VLA, to establish a\nrobust methodology for characterizing galaxy orientations and deriving dynamics\nfrom combining new HI with existing CO data.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}