{"id":"2407.08058","title":"Geometric Approach and Closed Exact Formulae for the Lasso","authors":"Vladimir Dragovi\\'c and Borislav Gaji\\'c","authorsParsed":[["Dragović","Vladimir",""],["Gajić","Borislav",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 21:39:24 GMT"}],"updateDate":"2024-07-12","timestamp":1720647564000,"abstract":"  We provide a geometric approach to the lasso. We study the tangency of the\nlevel sets of the least square objective function with the polyhedral boundary\nsets $B(t)$ of the parameters in $\\mathbb R^p$ with the $\\ell_1$ norm equal to\n$t$. Here $t$ decreases from the value $\\hat t$, which corresponds to the\nactual, nonconstrained minimizer of the least square objective function,\ndenoted by $\\hat\\beta$. We derive closed exact formulae for the solution of the\nlasso under the full rank assumption. Our method does not assume iterative\nnumerical procedures and it is, thus, computationally more efficient than the\nexisting algorithms for solving the lasso. We also establish several important\ngeneral properties of the solutions of the lasso. We prove that each lasso\nsolution form a simple polygonal chain in $\\mathbb{R}^p$ with $\\hat\\beta$ and\nthe origin as the endpoints. There are no two segments of the polygonal chain\nthat are parallel. We prove that such a polygonal chain can intersect interiors\nof more than one orthant in $\\mathbb{R}^p$, but it cannot intersect interiors\nof more than $p$ orthants, which is, in general, the best possible estimate for\nnon-normalized data. We prove that if a polygonal chain passes from the\ninterior of one to the interior of another orthant, then it never again returns\nto the interior of the former. The intersection of a chain and the interior of\nan orthant coincides with a segment minus its end points, which belongs to a\nray having $\\hat\\beta$ as its initial point. We illustrate the results using\nreal data examples as well as especially crafted examples with hypothetical\ndata. Already in $p=2$ case we show a striking difference in the maximal number\nof quadrants a polygonal chain of a lasso solution can intersect in the case of\nnormalized data, which is $1$ vs. nonnormalized data, which is $2$.\n","subjects":["Mathematics/Optimization and Control","Mathematics/Metric Geometry","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}