{"id":"2407.05572","title":"Reducing Total Trip Time and Vehicle Emission through Park-and-Ride --\n  methods and case-study","authors":"Ayane Nakamura and Fabiana Ferracina and Naoki Sakata and Takahiro\n  Noguchi and Hiroyasu Ando","authorsParsed":[["Nakamura","Ayane",""],["Ferracina","Fabiana",""],["Sakata","Naoki",""],["Noguchi","Takahiro",""],["Ando","Hiroyasu",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 03:04:59 GMT"}],"updateDate":"2024-07-09","timestamp":1720407899000,"abstract":"  Serious traffic congestion and emission by excessive usage of private cars\nare crucial issues in our modern society. As one solution for these, a concept\nof Park-and-Ride (PnR) where people stop their private cars (i.e.\nsingle-occupancy vehicles) at stations and ride on public vehicles (i.e. mass\ntransportation) are receiving wide attention recently. In this paper, we\npropose a comprehensive mathematical model which can evaluate waiting times and\ntraveling times of customers, and the total emission of vehicles for various\nusage ratio of PnR and operation policies of public transportation. Using a\nsystem of queues integrated with an emissions model we perform a case-study of\nTsukuba city, in Japan. We indicate an intriguing trade-off between the waiting\ntime of customers for the PnR and the long traveling time due to the traffic\ncongestion (leading to high emissions) caused by private cars depending on the\nusage ratio through some numerical experiments. Moreover, we study the total\ncost to society caused by total trip times and pollution, in which the decision\nvariables are the capacities and frequencies of the public transportation for\nthe PnR system. Our numerical results showed a significant reduction in the\ntotal social cost under the optimal transit policy for the current high usage\nrate of single-occupancy vehicles. Furthermore, we show that further reduction\nin the total social cost can be revealed by considering the reduction on the\nuse of private cars compared to the current state implying the social\nimportance of promoting car-free movement.\n","subjects":["Statistics/Computation","Statistics/Other Statistics"],"license":"http://creativecommons.org/licenses/by/4.0/"}