{"id":"2407.06483","title":"Composable Interventions for Language Models","authors":"Arinbjorn Kolbeinsson, Kyle O'Brien, Tianjin Huang, Shanghua Gao,\n  Shiwei Liu, Jonathan Richard Schwarz, Anurag Vaidya, Faisal Mahmood, Marinka\n  Zitnik, Tianlong Chen, Thomas Hartvigsen","authorsParsed":[["Kolbeinsson","Arinbjorn",""],["O'Brien","Kyle",""],["Huang","Tianjin",""],["Gao","Shanghua",""],["Liu","Shiwei",""],["Schwarz","Jonathan Richard",""],["Vaidya","Anurag",""],["Mahmood","Faisal",""],["Zitnik","Marinka",""],["Chen","Tianlong",""],["Hartvigsen","Thomas",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 01:17:44 GMT"}],"updateDate":"2024-07-10","timestamp":1720487864000,"abstract":"  Test-time interventions for language models can enhance factual accuracy,\nmitigate harmful outputs, and improve model efficiency without costly\nretraining. But despite a flood of new methods, different types of\ninterventions are largely developing independently. In practice, multiple\ninterventions must be applied sequentially to the same model, yet we lack\nstandardized ways to study how interventions interact. We fill this gap by\nintroducing composable interventions, a framework to study the effects of using\nmultiple interventions on the same language models, featuring new metrics and a\nunified codebase. Using our framework, we conduct extensive experiments and\ncompose popular methods from three emerging intervention categories --\nKnowledge Editing, Model Compression, and Machine Unlearning. Our results from\n310 different compositions uncover meaningful interactions: compression hinders\nediting and unlearning, composing interventions hinges on their order of\napplication, and popular general-purpose metrics are inadequate for assessing\ncomposability. Taken together, our findings showcase clear gaps in\ncomposability, suggesting a need for new multi-objective interventions. All of\nour code is public:\nhttps://github.com/hartvigsen-group/composable-interventions.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}