{"id":"2407.21115","title":"Fragmentation and aggregation of cyanobacterial colonies","authors":"Yuri Z. Sinzato, Robert Uittenbogaard, Petra M. Visser, Jef Huisman\n  and Maziyar Jalaal","authorsParsed":[["Sinzato","Yuri Z.",""],["Uittenbogaard","Robert",""],["Visser","Petra M.",""],["Huisman","Jef",""],["Jalaal","Maziyar",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 18:13:59 GMT"}],"updateDate":"2024-08-01","timestamp":1722363239000,"abstract":"  Fluid flow has a major effect on the aggregation and fragmentation of\nbacterial colonies. Yet, a generic framework to understand and predict how\nhydrodynamics affects colony size remains elusive. This study investigates how\nfluid flow affects the formation and maintenance of large colonial structures\nin cyanobacteria. We performed experiments on laboratory cultures and lake\nsamples of the cyanobacterium Microcystis, while their colony size distribution\nwas measured simultaneously by direct microscopic imaging. We demonstrate that\nEPS-embedded cells formed by cell division exhibit significant mechanical\nresistance to shear forces. However, at elevated hydrodynamic stress levels\n(exceeding those typically generated by surface wind mixing) these colonies\nexperience fragmentation through an erosion process. We also show that single\ncells can aggregate into small colonies due to fluid flow. However, the\nstructural integrity of these flow-induced colonies is weaker than that of\ncolonies formed by cell division. We provide a mathematical analysis to support\nthe experiments and demonstrate that a population model with two categories of\ncolonies describes the measured size distributions. Our results shed light on\nthe specific conditions wherein flow-induced fragmentation and aggregation of\ncyanobacteria are decisive and indicate that colony formation under natural\nconditions is mainly driven by cell division, although flow-induced aggregation\ncould play a role in dense bloom events. These findings can be used to improve\nprediction models and mitigation strategies for toxic cyanobacterial blooms and\nalso offer potential applications in other areas such as algal biotechnology or\nmedical settings where the dynamics of biological aggregates play a significant\nrole.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Biological Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}