{"id":"2407.16886","title":"GPT-4's One-Dimensional Mapping of Morality: How the Accuracy of\n  Country-Estimates Depends on Moral Domain","authors":"Pontus Strimling, Joel Krueger and Simon Karlsson","authorsParsed":[["Strimling","Pontus",""],["Krueger","Joel",""],["Karlsson","Simon",""]],"versions":[{"version":"v1","created":"Wed, 5 Jun 2024 12:58:45 GMT"}],"updateDate":"2024-07-25","timestamp":1717592325000,"abstract":"  Prior research demonstrates that Open AI's GPT models can predict variations\nin moral opinions between countries but that the accuracy tends to be\nsubstantially higher among high-income countries compared to low-income ones.\nThis study aims to replicate previous findings and advance the research by\nexamining how accuracy varies with different types of moral questions. Using\nresponses from the World Value Survey and the European Value Study, covering 18\nmoral issues across 63 countries, we calculated country-level mean scores for\neach moral issue and compared them with GPT-4's predictions. Confirming\nprevious findings, our results show that GPT-4 has greater predictive success\nin high-income than in low-income countries. However, our factor analysis\nreveals that GPT-4 bases its predictions primarily on a single dimension,\npresumably reflecting countries' degree of conservatism/liberalism. Conversely,\nthe real-world moral landscape appears to be two-dimensional, differentiating\nbetween personal-sexual and violent-dishonest issues. When moral issues are\ncategorized based on their moral domain, GPT-4's predictions are found to be\nremarkably accurate in the personal-sexual domain, across both high-income (r =\n.77) and low-income (r = .58) countries. Yet the predictive accuracy\nsignificantly drops in the violent-dishonest domain for both high-income (r =\n.30) and low-income (r = -.16) countries, indicating that GPT-4's\none-dimensional world-view does not fully capture the complexity of the moral\nlandscape. In sum, this study underscores the importance of not only\nconsidering country-specific characteristics to understand GPT-4's moral\nunderstanding, but also the characteristics of the moral issues at hand.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iqMWseAjzhRCi44MnBGaV5pyrXANFVRfopAVfq2FQ88","pdfSize":"1270468"}
