{"id":"2407.13524","title":"Enhancing Source-Free Domain Adaptive Object Detection with\n  Low-confidence Pseudo Label Distillation","authors":"Ilhoon Yoon, Hyeongjun Kwon, Jin Kim, Junyoung Park, Hyunsung Jang,\n  Kwanghoon Sohn","authorsParsed":[["Yoon","Ilhoon",""],["Kwon","Hyeongjun",""],["Kim","Jin",""],["Park","Junyoung",""],["Jang","Hyunsung",""],["Sohn","Kwanghoon",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 13:58:42 GMT"}],"updateDate":"2024-07-19","timestamp":1721311122000,"abstract":"  Source-Free domain adaptive Object Detection (SFOD) is a promising strategy\nfor deploying trained detectors to new, unlabeled domains without accessing\nsource data, addressing significant concerns around data privacy and\nefficiency. Most SFOD methods leverage a Mean-Teacher (MT) self-training\nparadigm relying heavily on High-confidence Pseudo Labels (HPL). However, these\nHPL often overlook small instances that undergo significant appearance changes\nwith domain shifts. Additionally, HPL ignore instances with low confidence due\nto the scarcity of training samples, resulting in biased adaptation toward\nfamiliar instances from the source domain. To address this limitation, we\nintroduce the Low-confidence Pseudo Label Distillation (LPLD) loss within the\nMean-Teacher based SFOD framework. This novel approach is designed to leverage\nthe proposals from Region Proposal Network (RPN), which potentially encompasses\nhard-to-detect objects in unfamiliar domains. Initially, we extract HPL using a\nstandard pseudo-labeling technique and mine a set of Low-confidence Pseudo\nLabels (LPL) from proposals generated by RPN, leaving those that do not overlap\nsignificantly with HPL. These LPL are further refined by leveraging\nclass-relation information and reducing the effect of inherent noise for the\nLPLD loss calculation. Furthermore, we use feature distance to adaptively\nweight the LPLD loss to focus on LPL containing a larger foreground area. Our\nmethod outperforms previous SFOD methods on four cross-domain object detection\nbenchmarks. Extensive experiments demonstrate that our LPLD loss leads to\neffective adaptation by reducing false negatives and facilitating the use of\ndomain-invariant knowledge from the source model. Code is available at\nhttps://github.com/junia3/LPLD.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}