{"id":"2407.20966","title":"High-order limiting methods using maximum principle bounds derived from\n  the Boltzmann equation I: Euler equations","authors":"Tarik Dzanic and Luigi Martinelli","authorsParsed":[["Dzanic","Tarik",""],["Martinelli","Luigi",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 16:48:11 GMT"}],"updateDate":"2024-07-31","timestamp":1722358091000,"abstract":"  The use of limiting methods for high-order numerical approximations of\nhyperbolic conservation laws generally requires defining an admissible\nregion/bounds for the solution. In this work, we present a novel approach for\ncomputing solution bounds and limiting for the Euler equations through the\nkinetic representation provided by the Boltzmann equation, which allows for\nextending limiters designed for linear advection directly to the Euler\nequations. Given an arbitrary set of solution values to compute bounds over\n(e.g., numerical stencil) and a desired linear advection limiter, the proposed\napproach yields an analytic expression for the admissible region of particle\ndistribution function values, which may be numerically integrated to yield a\nset of bounds for the density, momentum, and total energy. These solution\nbounds are shown to preserve positivity of density/pressure/internal energy\nand, when paired with a limiting technique, can robustly resolve strong\ndiscontinuities while recovering high-order accuracy in smooth regions without\nany ad hoc corrections (e.g., relaxing the bounds). This approach is\ndemonstrated in the context of an explicit unstructured high-order\ndiscontinuous Galerkin/flux reconstruction scheme for a variety of difficult\nproblems in gas dynamics, including cases with extreme shocks and shock-vortex\ninteractions. Furthermore, this work presents a foundation for limiting\ntechniques for more complex macroscopic governing equations that can be derived\nfrom an underlying kinetic representation for which admissible solution bounds\nare not well-understood.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}