{"id":"2407.16083","title":"Self-driving lab discovers principles for steering spontaneous emission","authors":"Saaketh Desai, Sadhvikas Addamane, Jeffery Y. Tsao, Igal Brener, Remi\n  Dingreville, Prasad P. Iyer","authorsParsed":[["Desai","Saaketh",""],["Addamane","Sadhvikas",""],["Tsao","Jeffery Y.",""],["Brener","Igal",""],["Dingreville","Remi",""],["Iyer","Prasad P.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 23:04:49 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 16:45:29 GMT"}],"updateDate":"2024-07-25","timestamp":1721689489000,"abstract":"  We developed an autonomous experimentation platform to accelerate\ninterpretable scientific discovery in ultrafast nanophotonics, targeting a\nnovel method to steer spontaneous emission from reconfigurable semiconductor\nmetasurfaces. Controlling spontaneous emission is crucial for clean-energy\nsolutions in illumination, thermal radiation engineering, and remote sensing.\nDespite the potential of reconfigurable semiconductor metasurfaces with\nembedded sources for spatiotemporal control, achieving arbitrary far-field\ncontrol remains challenging. Here, we present a self-driving lab (SDL) platform\nthat addresses this challenge by discovering the governing equations for\npredicting the far-field emission profile from light-emitting metasurfaces. We\ndiscover that both the spatial gradient (grating-like) and the curvature\n(lens-like) of the local refractive index are key factors in steering\nspontaneous emission. The SDL employs a machine-learning framework comprising:\n(1) a variational autoencoder for generating complex spatial refractive index\nprofiles, (2) an active learning agent for guiding experiments with real-time\nclosed-loop feedback, and (3) a neural network-based equation learner to\nuncover structure-property relationships. The SDL demonstrated a four-fold\nenhancement in peak emission directivity (up to 77%) over a 72{\\deg} field of\nview within ~300 experiments. Our findings reveal that combinations of positive\ngratings and lenses are as effective as negative lenses and gratings for all\nemission angles, offering a novel strategy for controlling spontaneous emission\nbeyond conventional Fourier optics.\n","subjects":["Physics/Optics","Condensed Matter/Materials Science","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JP5PoZXB-_uNRojU9BrZ-CPXv0O4TIZ-kYtEtrHOo6c","pdfSize":"2179186","objectId":"0x4317ed880cd89d5feb356401df477d2501584e436476f63ab6310117ed658f0a","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
