{"id":"2407.11600","title":"A two-step surrogate method for sequential uncertainty quantification in\n  high-dimensional inverse problems","authors":"Ningxin Yang, Truong Le, Lidija Zdravkovi\\'c, David M. Potts","authorsParsed":[["Yang","Ningxin",""],["Le","Truong",""],["Zdravković","Lidija",""],["Potts","David M.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 10:56:40 GMT"}],"updateDate":"2024-07-17","timestamp":1721127400000,"abstract":"  Predictive estimation, which comprises model calibration, model prediction,\nand validation, is a common objective when performing inverse uncertainty\nquantification (UQ) in diverse scientific applications. These techniques\ntypically require thousands to millions of realisations of the forward model,\nleading to high computational costs. Surrogate models are often used to\napproximate these simulations. However, many surrogate models suffer from the\nfundamental limitation of being unable to estimate plausible high-dimensional\noutputs, inevitably compromising their use in the UQ framework. To address this\nchallenge, this study introduces an efficient surrogate modelling workflow\ntailored for high-dimensional outputs. Specifically, a two-step approach is\ndeveloped: (1) a dimensionality reduction technique is used for extracting data\nfeatures and mapping the original output space into a reduced space; and (2) a\nmultivariate surrogate model is constructed directly on the reduced space. The\ncombined approach is shown to improve the accuracy of the surrogate model while\nretaining the computational efficiency required for UQ inversion. The proposed\nsurrogate method, combined with Bayesian inference, is evaluated for a civil\nengineering application by performing inverse analyses on a laterally loaded\npile problem. The results demonstrate the superiority of the proposed framework\nover traditional surrogate methods in dealing with high-dimensional outputs for\nsequential inversion analysis.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}