{"id":"2407.18846","title":"Cosmological implications of the Gaia Milky Way declining rotation curve","authors":"Even Coquery, Alain Blanchard","authorsParsed":[["Coquery","Even",""],["Blanchard","Alain",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 16:11:59 GMT"}],"updateDate":"2024-07-29","timestamp":1722010319000,"abstract":"  Although the existence of dark matter has been widely acknowledged in the\ncosmology community, it is as yet unknown in nature, despite decades of\nresearch, which questions its very existence. This never-ending search for dark\nmatter leads to consider alternatives. Since increasing the enclosed mass is\nthe only way to explain the flat appearance of galaxies rotation curves in a\nNewtonian framework, the MOND theory proposed to modify Newton's dynamics when\nthe acceleration is around or below a threshold value, a_0. Observed rotation\ncurves, generally flat at large distances, are then usually well reproduced by\nMOND with a_0 ~ 1.2 10^{-10} m/s^2. However, the recent Gaia evidence of a\ndecline in the Milky Way rotation curve is a distinct behavior. Therefore, we\nexamine whether LCDM and MOND can accommodate the Gaia declining rotation curve\nof the Milky Way. We first depict a standard model to describe the Milky Way's\nbaryonic components. Secondly, we show that a NFW model is able to fit the\ndecline, assuming a scale radius R_s of the order of 4 kpc. In a third step, we\nshow that the usual MOND paradigm is not able to reproduce the declining part\nfor a standard baryonic model. Finally, we examine whether the MOND theory can\naccommodate the declining part of the rotation curve when relaxing the\ncharacteristics of the baryonic components. To do so we use a MCMC method on\nthe characteristics of the stellar and the HI disk, including their mass. We\nfound that the stellar disk should be massive, of the order of 10^{11} M_\\odot.\nThe HI disk mass is capped at nearly 1.8 10^{11} M_\\odot but could also be\nnegligible. Finally, a_0 is consistent with 0, with an upper limit of 0.53\n10^{-10} m/s^{2} (95\\%), a value much lower than the above mentioned value\nusually advocated to explain standard flat rotation curves in MOND theory.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_GT3HcGV-r2GwkacD4mavoULoWLyoYtB4sDjCs-QFQ0","pdfSize":"1005296"}
