{"id":"2407.11168","title":"Efficient Unsupervised Visual Representation Learning with Explicit\n  Cluster Balancing","authors":"Ioannis Maniadis Metaxas, Georgios Tzimiropoulos, Ioannis Patras","authorsParsed":[["Metaxas","Ioannis Maniadis",""],["Tzimiropoulos","Georgios",""],["Patras","Ioannis",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:44:17 GMT"}],"updateDate":"2024-07-17","timestamp":1721069057000,"abstract":"  Self-supervised learning has recently emerged as the preeminent pretraining\nparadigm across and between modalities, with remarkable results. In the image\ndomain specifically, group (or cluster) discrimination has been one of the most\nsuccessful methods. However, such frameworks need to guard against heavily\nimbalanced cluster assignments to prevent collapse to trivial solutions.\nExisting works typically solve this by reweighing cluster assignments to\npromote balance, or with offline operations (e.g. regular re-clustering) that\nprevent collapse. However, the former typically requires large batch sizes,\nwhich leads to increased resource requirements, and the latter introduces\nscalability issues with regard to large datasets. In this work, we propose\nExCB, a framework that tackles this problem with a novel cluster balancing\nmethod. ExCB estimates the relative size of the clusters across batches and\nbalances them by adjusting cluster assignments, proportionately to their\nrelative size and in an online manner. Thereby, it overcomes previous methods'\ndependence on large batch sizes and is fully online, and therefore scalable to\nany dataset. We conduct extensive experiments to evaluate our approach and\ndemonstrate that ExCB: a) achieves state-of-the-art results with significantly\nreduced resource requirements compared to previous works, b) is fully online,\nand therefore scalable to large datasets, and c) is stable and effective even\nwith very small batch sizes.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"GJOqV93jaDYGrwHSKxzs1aNgFHgpj2f7pdjHckTCaQM","pdfSize":"5947613"}
