{"id":"2407.07087","title":"CopyBench: Measuring Literal and Non-Literal Reproduction of\n  Copyright-Protected Text in Language Model Generation","authors":"Tong Chen, Akari Asai, Niloofar Mireshghallah, Sewon Min, James\n  Grimmelmann, Yejin Choi, Hannaneh Hajishirzi, Luke Zettlemoyer, Pang Wei Koh","authorsParsed":[["Chen","Tong",""],["Asai","Akari",""],["Mireshghallah","Niloofar",""],["Min","Sewon",""],["Grimmelmann","James",""],["Choi","Yejin",""],["Hajishirzi","Hannaneh",""],["Zettlemoyer","Luke",""],["Koh","Pang Wei",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 17:58:18 GMT"}],"updateDate":"2024-07-10","timestamp":1720547898000,"abstract":"  Evaluating the degree of reproduction of copyright-protected content by\nlanguage models (LMs) is of significant interest to the AI and legal\ncommunities. Although both literal and non-literal similarities are considered\nby courts when assessing the degree of reproduction, prior research has focused\nonly on literal similarities. To bridge this gap, we introduce CopyBench, a\nbenchmark designed to measure both literal and non-literal copying in LM\ngenerations. Using copyrighted fiction books as text sources, we provide\nautomatic evaluation protocols to assess literal and non-literal copying,\nbalanced against the model utility in terms of the ability to recall facts from\nthe copyrighted works and generate fluent completions. We find that, although\nliteral copying is relatively rare, two types of non-literal copying -- event\ncopying and character copying -- occur even in models as small as 7B\nparameters. Larger models demonstrate significantly more copying, with literal\ncopying rates increasing from 0.2% to 10.5% and non-literal copying from 2.3%\nto 6.9% when comparing Llama3-8B and 70B models, respectively. We further\nevaluate the effectiveness of current strategies for mitigating copying and\nshow that (1) training-time alignment can reduce literal copying but may\nincrease non-literal copying, and (2) current inference-time mitigation methods\nprimarily reduce literal but not non-literal copying.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}