{"id":"2407.14443","title":"Temperature-induced changes in optical properties of cubic\n  CH$_3$NH$_3$SnI$_3$ using phonopy-FHI-aims","authors":"Hassan Abdulsalam, Fatima Musa Lariski, Habiba Garba Ahmad and Hassana\n  Muhammad Shuwa","authorsParsed":[["Abdulsalam","Hassan",""],["Lariski","Fatima Musa",""],["Ahmad","Habiba Garba",""],["Shuwa","Hassana Muhammad",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 16:18:35 GMT"}],"updateDate":"2024-07-22","timestamp":1721405915000,"abstract":"  This research explores how temperature influences the optical characteristics\nof Cubic Methylammonium Tin Iodide (CH$_3$NH$_3$SnI$_3$), a material showing\ngreat promise for solar cell technology. The variations in the optical\nabsorption coefficient, refractive index, extinction coefficient, reflectivity,\nand optical conductivity was examined over a range of temperatures and\ncrystallographic orientations ([100], [010], [001]). The findings indicate that\nas temperature rises, there is a general decrease observed in the absorption\ncoefficient, refractive index, extinction coefficient, and optical\nconductivity. Similarly, reflectivity also tends to decrease with increasing\ntemperature. These findings suggest that Cubic CH$_3$NH$_3$SnI$_3$ exhibits\nconsistent transparency, a stable refractive index, and relatively high\nreflectivity across different temperature conditions. Its low optical\nconductivity, typical of semiconductor materials, indicates its suitability for\nfacilitating efficient charge separation and transport within solar cells. This\nresearch significantly adds to our comprehension of optical properties of\nCH$_3$NH$_3$SnI$_3$, paving the way for its potential use in solar cell\napplications.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LuQMg6FA0Ifyhacg9aXT_baUbz5DN_DhsErywj8kmWA","pdfSize":"763763","objectId":"0xfbdae79fc86fc12d70607d0bf14bb4ffaf2391ceef0f20f385ef865af84a7be9","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
