{"id":"2407.17534","title":"Extension of W-method and A-learner for multiple binary outcomes","authors":"Shintaro Yuki, Kensuke Tanioka, Hiroshi Yadohisa","authorsParsed":[["Yuki","Shintaro",""],["Tanioka","Kensuke",""],["Yadohisa","Hiroshi",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 04:53:55 GMT"}],"updateDate":"2024-07-26","timestamp":1721796835000,"abstract":"  In this study, we compared two groups, in which subjects were assigned to\neither the treatment or the control group. In such trials, if the efficacy of\nthe treatment cannot be demonstrated in a population that meets the eligibility\ncriteria, identifying the subgroups for which the treatment is effective is\ndesirable. Such subgroups can be identified by estimating heterogeneous\ntreatment effects (HTE). In recent years, methods for estimating HTE have\nincreasingly relied on complex models. Although these models improve the\nestimation accuracy, they often sacrifice interpretability. Despite significant\nadvancements in the methods for continuous or univariate binary outcomes,\nmethods for multiple binary outcomes are less prevalent, and existing\ninterpretable methods, such as the W-method and A-learner, while capable of\nestimating HTE for a single binary outcome, still fail to capture the\ncorrelation structure when applied to multiple binary outcomes. We thus propose\ntwo methods for estimating HTE for multiple binary outcomes: one based on the\nW-method and the other based on the A-learner. We also demonstrate that the\nconventional A-learner introduces bias in the estimation of the treatment\neffect. The proposed method employs a framework based on reduced-rank\nregression to capture the correlation structure among multiple binary outcomes.\nWe correct for the bias inherent in the A-learner estimates and investigate the\nimpact of this bias through numerical simulations. Finally, we demonstrate the\neffectiveness of the proposed method using a real data application.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}