{"id":"2407.04670","title":"Neutrinoless Double Beta Decay from Scalar Leptoquarks: Interplay with\n  Neutrino Mass and Flavor Physics","authors":"P. S. Bhupal Dev, Srubabati Goswami, Chayan Majumdar, Debashis Pachhar","authorsParsed":[["Dev","P. S. Bhupal",""],["Goswami","Srubabati",""],["Majumdar","Chayan",""],["Pachhar","Debashis",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 17:24:51 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 13:14:19 GMT"}],"updateDate":"2024-09-19","timestamp":1720200291000,"abstract":"  We perform a comprehensive analysis of neutrinoless double beta decay and its\ninterplay with low-energy flavor observables in a radiative neutrino mass model\nwith scalar leptoquarks $S_1(\\bar{3},1,1/3)$ and $\\widetilde{R}_2(3,2,1/6)$. We\ncarve out the parameter region consistent with constraints from neutrino mass\nand mixing, collider searches, as well as measurements of several flavor\nobservables, such as muon and electron anomalous magnetic moments, charged\nlepton flavor violation and rare (semi)leptonic kaon and $B$-meson decays,\nincluding the recent anomalies in $R_{D^{(*)}}$ and $B\\to K\\nu\\bar{\\nu}$\nobservables. We perform a global analysis to all existing constraints and show\nthe (anti)correlations between all relevant Yukawa couplings satisfying these\nrestrictions. We find that the most stringent constraint on the parameter space\ncomes from $\\mu \\to e$ conversion in nuclei and $K^{+} \\rightarrow\\, \\pi^{+}\\nu\n\\bar{\\nu}$ decay. We also point out a tension between the muon and electron\n$(g-2)$ anomalies in this context. Taking benchmark points from the combined\nallowed regions, we study the implications for neutrinoless double beta decay\nincluding both the canonical light neutrino and the leptoquark contributions.\nWe find that for normal ordering of neutrino masses, the leptoquark\ncontribution removes the cancellation region that occurs for the canonical\ncase. The effective mass in presence of leptoquarks can lie in the desert\nregion between the standard normal and inverted ordering cases, and this can be\nprobed in future ton-scale experiments like LEGEND-1000 and nEXO.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/"}