{"id":"2407.07770","title":"Challenges in modeling the dark matter halo of NGC 1052-DF2: Cored\n  versus cuspy halo models","authors":"K. Aditya","authorsParsed":[["Aditya","K.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 15:46:15 GMT"}],"updateDate":"2024-07-11","timestamp":1720626375000,"abstract":"  The discovery of NGC 1052-DF2 and subsequent modeling have shown that NGC\n1052-DF2 is deficient in dark matter and is in conflict with the standard\nstellar-to-halo mass ratio. In this work, we aim to resolve the degeneracy\nbetween the dynamical models on the mass estimate of the NGC 1052-DF2.We\nconstructed mass models of NGC 1052-DF2 using an anisotropic distribution\nfunction with a radially varying anisotropy parameter and studied the effect of\nthe various model parameters on the dark matter estimates. We used the observed\nstellar photometry as an input parameter to construct the distribution function\nand employed a Markov Chain Monte Carlo (MCMC) method to estimate the dark\nmatter model parameters.We find that mass models with a cuspy dark matter halo\nhave comparable $\\chi^{2}$ to models with zero dark matter. Moreover, the cuspy\ndark matter halo fails to consistently account for the observed velocity\ndispersion in the inner and outer regions of the galaxy. Consequently, we rule\nout the possibility of a cuspy dark matter halo for describing the mass models\nof NGC 1052 - DF2. Our study shows that the cored dark matter halo model with a\ntotal mass of $\\log(M_{DM}/M_{\\odot})=10.5$ explains the observed kinematics\nbut requires an extraordinarily large scale length (20kpc) and an outer cutoff\nradius (26kpc). While the cored mass model provides a comparatively better fit,\nour findings emphasize that the mass models are largely unconstrained by the\navailable kinematic data. Our results suggest that NGC 1052 - DF2 may not only\nhave an ultra-diffuse stellar distribution but that it can, within\nuncertainties in the available kinematic data, potentially host an\nultra-diffuse dark matter distribution compatible with the standard\nstellar-to-halo mass relation (SHMR) predicted by galaxy formation and\nevolution models\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}