{"id":"2407.12995","title":"How the physics culture shapes the experiences of undergraduate women\n  physics majors: A comparative case study of three physics departments","authors":"Lisabeth Marie Santana and Chandralekha Singh","authorsParsed":[["Santana","Lisabeth Marie",""],["Singh","Chandralekha",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 20:23:40 GMT"}],"updateDate":"2024-07-19","timestamp":1721247820000,"abstract":"  We present comparative case study of three physics department culture from\ndifferent institutions using the experiences undergraduate women. The three\nstudies conducted in the United States include Johnson's 2020 study in a small\nphysics department at a small predominantly White liberal arts college, Santana\nand Singh's 2023 study at a large predominantly White research institution, and\nSantana and Singh's 2024 study in a medium-sized physics department at a small\npredominantly White private liberal arts college. Using synergistic frameworks\nsuch as Standpoint Theory, Domains of Power, and the Holistic Ecosystem for\nLearning Physics in an Inclusive and Equitable Environment and reflections from\nundergraduate women, we aim to understand how those in the position of power,\ne.g., instructors, have important roles in establishing and maintaining safe,\nequitable, and inclusive environments for undergraduate students. Their\naccounts help us contrast the experiences of undergraduate women in physics\ndepartments with very different cultures. This comparative analysis is\nespecially important for reflecting upon what can be done to improve the\nphysics culture so that historically marginalized students such as women and\nethnic and racial minority students in physics feel supported and thrive. In\nparticular, this comparative case study can be invaluable to understand the\npositive and negative aspects of the physics culture as they impact\nundergraduate women majoring in physics within these three departments. This\nanalysis can help other physics departments contemplate strategies to improve\nthe physics culture so that all undergraduate physics majors have validating\nexperiences while navigating their physics journey regardless of their\nidentities.\n","subjects":["Physics/Physics Education"],"license":"http://creativecommons.org/licenses/by/4.0/"}