{"id":"2407.18277","title":"Online Social Network Data-Driven Early Detection on Short-Form Video\n  Addiction","authors":"Fang-Yu Kuo","authorsParsed":[["Kuo","Fang-Yu",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 02:47:09 GMT"}],"updateDate":"2024-07-29","timestamp":1721789229000,"abstract":"  Short-form video (SFV) has become a globally popular form of entertainment in\nrecent years, appearing on major social media platforms. However, current\nresearch indicate that short video addiction can lead to numerous negative\neffects on both physical and psychological health, such as decreased attention\nspan and reduced motivation to learn. Additionally, Short-form Video Addiction\n(SFVA) has been linked to other issues such as a lack of psychological support\nin real life, family or academic pressure, and social anxiety. Currently, the\ndetection of SFVA typically occurs only after users experience negative\nconsequences. Therefore, we aim to construct a short video addiction dataset\nbased on social network behavior and design an early detection framework for\nSFVA. Previous mental health detection research on online social media has\nmostly focused on detecting depression and suicidal tendency. In this study, we\npropose the first early detection framework for SFVA EarlySD. We first\nintroduce large language models (LLMs) to address the common issues of sparsity\nand missing data in graph datasets. Meanwhile, we categorize social network\nbehavior data into different modalities and design a heterogeneous social\nnetwork structure as the primary basis for detecting SFVA. We conduct a series\nof quantitative analysis on short video addicts using our self-constructed\ndataset, and perform extensive experiments to validate the effectiveness of our\nmethod EarlySD, using social data and heterogeneous social graphs in the\ndetection of short video addiction.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Computers and Society","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}