{"id":"2407.18419","title":"Non-intrusive model reduction of advection-dominated hyperbolic problems\n  using neural network shift augmented manifold transformations","authors":"Harshith Gowrachari, Nicola Demo, Giovanni Stabile and Gianluigi Rozza","authorsParsed":[["Gowrachari","Harshith",""],["Demo","Nicola",""],["Stabile","Giovanni",""],["Rozza","Gianluigi",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 22:35:11 GMT"},{"version":"v2","created":"Tue, 10 Sep 2024 06:33:30 GMT"}],"updateDate":"2024-09-11","timestamp":1721946911000,"abstract":"  Advection-dominated problems are commonly noticed in nature, engineering\nsystems, and a wide range of industrial processes. For these problems, linear\napproximation methods (proper orthogonal decomposition and reduced basis\nmethod) are not suitable, as the Kolmogorov $n$-width decay is slow, leading to\ninefficient and inaccurate reduced order models. There are few non-linear\napproaches to accelerate the Kolmogorov $n$-width decay. In this work, we use a\nneural-network shift augmented transformation technique, that employs\nautomatic-shit detection and detects the optimal non-linear transformation of\nthe full-order model solution manifold $\\mathcal{M}$. We exploit a\ndeep-learning framework to derive parameter-dependent bijective mapping between\nthe manifold $\\mathcal{M}$ and the transformed manifold $\\tilde{\\mathcal{M}}$.\nIt consists of two neural networks, 1) ShiftNet, to employ automatic-shift\ndetection by learning the shift-operator, which finds the optimal shifts for\nnumerous snapshots of the full-order solution manifold, to accelerate the\nKolmogorov $n$-width decay, and 2) InterpNet, which learns the reference\nconfiguration and can reconstruct the field values of the same, for each\nshifted grid distribution. We construct non-intrusive reduced order models on\nthe resulting transformed linear subspaces and employ automatic-shift detection\nfor predictions. We test our methodology on advection-dominated problems, such\nas 1D travelling waves, 2D isentropic convective vortex and 2D two-phase flow\ntest cases. This work leads to the development of the complete NNsPOD-ROM\nalgorithm for model reduction of advection-dominated problems, comprising both\noffline-online stages.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}