{"id":"2407.08278","title":"Structuring, Sequencing, Staging, Selecting: the 4S method for the\n  longitudinal analysis of multidimensional measurement scales in chronic\n  diseases","authors":"Tiphaine Saulnier, Wassilios G. Meissner, Margherita Fabbri, Alexandra\n  Foubert-Samier, C\\'ecile Proust-Lima","authorsParsed":[["Saulnier","Tiphaine",""],["Meissner","Wassilios G.",""],["Fabbri","Margherita",""],["Foubert-Samier","Alexandra",""],["Proust-Lima","Cécile",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 08:27:08 GMT"}],"updateDate":"2024-07-12","timestamp":1720686428000,"abstract":"  In clinical studies, measurement scales are often collected to report\ndisease-related manifestations from clinician or patient perspectives. Their\nanalysis can help identify relevant manifestations throughout the disease\ncourse, enhancing knowledge of disease progression and guiding clinicians in\nproviding appropriate support. However, the analysis of measurement scales in\nhealth studies is not straightforward as made of repeated, ordinal, and\npotentially multidimensional item data. Their sum-score summaries may\nconsiderably reduce information and impend interpretation, their change over\ntime occurs along clinical progression, and as many other longitudinal\nprocesses, their observation may be truncated by events. This work establishes\na comprehensive strategy in four consecutive steps to leverage repeated data\nfrom multidimensional measurement scales. The 4S method successively (1)\nidentifies the scale structure into subdimensions satisfying three calibration\nassumptions (unidimensionality, conditional independence, increasing\nmonotonicity), (2) describes each subdimension progression using a joint latent\nprocess model which includes a continuous-time item response theory model for\nthe longitudinal subpart, (3) aligns each subdimension's progression with\ndisease stages through a projection approach, and (4) identifies the most\ninformative items across disease stages using the Fisher's information. The\nmethod is comprehensively illustrated in multiple system atrophy (MSA), an\nalpha-synucleinopathy, with the analysis of daily activity and motor\nimpairments over disease progression. The 4S method provides an effective and\ncomplete analytical strategy for any measurement scale repeatedly collected in\nhealth studies.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}