{"id":"2407.14271","title":"Modified-Improved Fitness Dependent Optimizer for Complex and\n  Engineering Problems","authors":"Hozan K. Hamarashid, Bryar A. Hassan, Tarik A. Rashid","authorsParsed":[["Hamarashid","Hozan K.",""],["Hassan","Bryar A.",""],["Rashid","Tarik A.",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 07:47:23 GMT"}],"updateDate":"2024-07-22","timestamp":1719474443000,"abstract":"  Fitness dependent optimizer (FDO) is considered one of the novel swarm\nintelligent algorithms. Recently, FDO has been enhanced several times to\nimprove its capability. One of the improvements is called improved FDO (IFDO).\nHowever, according to the research findings, the variants of FDO are\nconstrained by two primary limitations that have been identified. Firstly, if\nthe number of agents employed falls below five, it significantly diminishes the\nalgorithm's precision. Secondly, the efficacy of FDO is intricately tied to the\nquantity of search agents utilized. To overcome these limitations, this study\nproposes a modified version of IFDO, called M-IFDO. The enhancement is\nconducted by updating the location of the scout bee to the IFDO to move the\nscout bees to achieve better performance and optimal solutions. More\nspecifically, two parameters in IFDO, which are alignment and cohesion, are\nremoved. Instead, the Lambda parameter is replaced in the place of alignment\nand cohesion. To verify the performance of the newly introduced algorithm,\nM-IFDO is tested on 19 basic benchmark functions, 10 IEEE Congress of\nEvolutionary Computation (CEC-C06 2019), and five real-world problems. M-IFDO\nis compared against five state-of-the-art algorithms: Improved Fitness\nDependent Optimizer (IFDO), Improving Multi-Objective Differential Evolution\nalgorithm (IMODE), Hybrid Sampling Evolution Strategy (HSES), Linear\nSuccess-History based Parameter Adaptation for Differential Evolution (LSHADE)\nand CMA-ES Integrated with an Occasional Restart Strategy and Increasing\nPopulation Size and An Iterative Local Search (NBIPOP-aCMAES). The verification\ncriteria are based on how well the algorithm reaches convergence, memory usage,\nand statistical results. The results show that M-IFDO surpasses its competitors\nin several cases on the benchmark functions and five real-world problems.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tsxHD46XgqOg_jZCGjSeCVqD6N8YDboJMbroVvBSVMY","pdfSize":"1734376"}
