{"id":"2407.15691","title":"Multi-Objective Distributed Beamforming Using High-Accuracy\n  Synchronization and Localization","authors":"Ahona Bhattacharyya and Jeffrey A. Nanzer","authorsParsed":[["Bhattacharyya","Ahona",""],["Nanzer","Jeffrey A.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:59:22 GMT"}],"updateDate":"2024-07-23","timestamp":1721660362000,"abstract":"  We present a multi-node, multi-objective open-loop microwave distributed\nbeamforming system based on high-accuracy wireless synchronization and\nlocalization. Distributed beamforming requires accurate coordination of the\nspatial and electrical states of the individual elements within the array to\nachieve and maintain coherent beamforming at intended destinations. Of the\nbasic coordination aspects, time synchronization and localization of the\nelements are among the most critical to support beamforming of modulated\nwaveforms to destinations in both the near-field and far-field of the array. In\nthis work, we demonstrate multi-objective distributed beamforming from a\nthree-node distributed phased array consisting of software-defined radios that\nleverages high-accuracy wireless time coordination for both time\nsynchronization and two-dimensional localization of the elements. We use a\nspectrally-sparse two-tone waveform for high-accuracy inter-node range\nestimation combined with a linear-frequency modulated waveform to mitigate\nmultipath interference. Localization is performed in a centralized format,\nwhere one node is designated as the origin and the remaining nodes build the\narray geometry relative to the origin, from which we obtain localization\naccuracy of less than 1 cm. We implement a near-field multi-objective\nbeamformer based on the location estimates, which enables the simultaneous\nsteering of a beam and a null to two receiving antennas. Multi-objective\nbeamforming of pulsed waveforms at a carrier frequency of 2.1 GHz is\ndemonstrated in cases where one of the nodes in the distributed antenna array\nis moved, and where the targets (the two receiving antennas) are moved.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}