{"id":"2407.18940","title":"LitSearch: A Retrieval Benchmark for Scientific Literature Search","authors":"Anirudh Ajith, Mengzhou Xia, Alexis Chevalier, Tanya Goyal, Danqi\n  Chen, Tianyu Gao","authorsParsed":[["Ajith","Anirudh",""],["Xia","Mengzhou",""],["Chevalier","Alexis",""],["Goyal","Tanya",""],["Chen","Danqi",""],["Gao","Tianyu",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 18:00:03 GMT"}],"updateDate":"2024-07-30","timestamp":1720634403000,"abstract":"  Literature search questions, such as \"where can I find research on the\nevaluation of consistency in generated summaries?\" pose significant challenges\nfor modern search engines and retrieval systems. These questions often require\na deep understanding of research concepts and the ability to reason over entire\narticles. In this work, we introduce LitSearch, a retrieval benchmark\ncomprising 597 realistic literature search queries about recent ML and NLP\npapers. LitSearch is constructed using a combination of (1) questions generated\nby GPT-4 based on paragraphs containing inline citations from research papers\nand (2) questions about recently published papers, manually written by their\nauthors. All LitSearch questions were manually examined or edited by experts to\nensure high quality. We extensively benchmark state-of-the-art retrieval models\nand also evaluate two LLM-based reranking pipelines. We find a significant\nperformance gap between BM25 and state-of-the-art dense retrievers, with a\n24.8% difference in absolute recall@5. The LLM-based reranking strategies\nfurther improve the best-performing dense retriever by 4.4%. Additionally,\ncommercial search engines and research tools like Google Search perform poorly\non LitSearch, lagging behind the best dense retriever by 32 points. Taken\ntogether, these results show that LitSearch is an informative new testbed for\nretrieval systems while catering to a real-world use case.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Digital Libraries","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}