{"id":"2407.04029","title":"Robust Learning under Hybrid Noise","authors":"Yang Wei, Shuo Chen, Shanshan Ye, Bo Han, Chen Gong","authorsParsed":[["Wei","Yang",""],["Chen","Shuo",""],["Ye","Shanshan",""],["Han","Bo",""],["Gong","Chen",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 16:13:25 GMT"}],"updateDate":"2024-07-08","timestamp":1720109605000,"abstract":"  Feature noise and label noise are ubiquitous in practical scenarios, which\npose great challenges for training a robust machine learning model. Most\nprevious approaches usually deal with only a single problem of either feature\nnoise or label noise. However, in real-world applications, hybrid noise, which\ncontains both feature noise and label noise, is very common due to the\nunreliable data collection and annotation processes. Although some results have\nbeen achieved by a few representation learning based attempts, this issue is\nstill far from being addressed with promising performance and guaranteed\ntheoretical analyses. To address the challenge, we propose a novel unified\nlearning framework called \"Feature and Label Recovery\" (FLR) to combat the\nhybrid noise from the perspective of data recovery, where we concurrently\nreconstruct both the feature matrix and the label matrix of input data.\nSpecifically, the clean feature matrix is discovered by the low-rank\napproximation, and the ground-truth label matrix is embedded based on the\nrecovered features with a nuclear norm regularization. Meanwhile, the feature\nnoise and label noise are characterized by their respective adaptive matrix\nnorms to satisfy the corresponding maximum likelihood. As this framework leads\nto a non-convex optimization problem, we develop the non-convex Alternating\nDirection Method of Multipliers (ADMM) with the convergence guarantee to solve\nour learning objective. We also provide the theoretical analysis to show that\nthe generalization error of FLR can be upper-bounded in the presence of hybrid\nnoise. Experimental results on several typical benchmark datasets clearly\ndemonstrate the superiority of our proposed method over the state-of-the-art\nrobust learning approaches for various noises.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}