{"id":"2407.20838","title":"Exact boundary-value solution for an electromagnetic wave propagating in\n  a linearly-varying index of refraction","authors":"N. A. Lopez","authorsParsed":[["Lopez","N. A.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 14:09:51 GMT"}],"updateDate":"2024-07-31","timestamp":1722348591000,"abstract":"  The propagation of electromagnetic waves in a linearly-varying index of\nrefraction is a fundamental problem in wave physics, being relevant in fusion\nscience for describing certain wave-based heating and diagnostic schemes. Here,\nan exact solution is obtained for a given incoming wavefield specified on the\nboundary transverse to the direction of inhomogeneity by performing a spectral,\nrather than asymptotic, matching. Two case studies are then presented: a\nGaussian beam at oblique incidence and a speckled wavefield at normal\nincidence. For the Gaussian beam, it is shown that when the waist $W$ is\nsufficiently large, oblique incidence manifests simply as rigid translation and\nfocal shift of the corresponding diffraction pattern at normal incidence. The\ndestruction of the hyperbolic umbilic caustic (corresponding to a critically\nfocused beam) as $W$ is reduced is then demonstrated. The caustic disappears\nonce $W \\lesssim \\delta_a \\sqrt{L}$ ($L$ being the medium lengthscale\nnormalized by the Airy skin depth $\\delta_a$), at which point the wave behavior\nis increasingly described by Airy functions, but experiences less focusing as a\nresult. To maximize the intensity of a launched Gaussian beam at a turning\npoint, one should therefore minimize the imaginary part of the launched complex\nbeam parameter while having the real part satisfy critical focusing. For the\nspeckled wavefield, it is shown that the transverse speckle pattern only\ncouples to the Airy longitudinal pattern when the coupling parameter $\\eta =\n\\sqrt{L}/f_\\#$ is large, with $f_\\#$ being the f-number of the launching\naperture. When $\\eta \\ll 1$, a reduced description of the total wavefield can\nbe obtained by simply multiplying the incoming speckle pattern with the Airy\nswelling.\n","subjects":["Physics/Optics","Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}