{"id":"2407.11973","title":"Preliminary Study of the Impact of AI-Based Interventions on Health and\n  Behavioral Outcomes in Maternal Health Programs","authors":"Arpan Dasgupta, Niclas Boehmer, Neha Madhiwalla, Aparna Hedge, Bryan\n  Wilder, Milind Tambe, Aparna Taneja","authorsParsed":[["Dasgupta","Arpan",""],["Boehmer","Niclas",""],["Madhiwalla","Neha",""],["Hedge","Aparna",""],["Wilder","Bryan",""],["Tambe","Milind",""],["Taneja","Aparna",""]],"versions":[{"version":"v1","created":"Thu, 23 May 2024 10:18:20 GMT"}],"updateDate":"2024-07-18","timestamp":1716459500000,"abstract":"  Automated voice calls are an effective method of delivering maternal and\nchild health information to mothers in underserved communities. One method to\nfight dwindling listenership is through an intervention in which health workers\nmake live service calls. Previous work has shown that we can use AI to identify\nbeneficiaries whose listenership gets the greatest boost from an intervention.\nIt has also been demonstrated that listening to the automated voice calls\nconsistently leads to improved health outcomes for the beneficiaries of the\nprogram. These two observations combined suggest the positive effect of\nAI-based intervention scheduling on behavioral and health outcomes. This study\nanalyzes the relationship between the two. Specifically, we are interested in\nmothers' health knowledge in the post-natal period, measured through survey\nquestions. We present evidence that improved listenership through AI-scheduled\ninterventions leads to a better understanding of key health issues during\npregnancy and infancy. This improved understanding has the potential to benefit\nthe health outcomes of mothers and their babies.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"n9B-hTAUzEv04wg7i8xef49hae6WSFrs6orZhiX-ogQ","pdfSize":"2014496"}
