{"id":"2407.04479","title":"A spectroscopic and kinematic survey of fast hot subdwarfs","authors":"S. Geier, U. Heber, A. Irrgang, M.Dorsch, A. Bastian, P. Neunteufel,\n  T. Kupfer, S. Bloemen, S. Kreuzer, L. M\\\"oller, M. Schindewolf, D. Schneider,\n  E. Ziegerer, I. Pelisoli, V. Schaffenroth, B.N. Barlow, R. Raddi, S.J. Geier,\n  N. Reindl, T. Rauch, P. Nemeth, B.T. G\\\"ansicke","authorsParsed":[["Geier","S.",""],["Heber","U.",""],["Irrgang","A.",""],["Dorsch","M.",""],["Bastian","A.",""],["Neunteufel","P.",""],["Kupfer","T.",""],["Bloemen","S.",""],["Kreuzer","S.",""],["Möller","L.",""],["Schindewolf","M.",""],["Schneider","D.",""],["Ziegerer","E.",""],["Pelisoli","I.",""],["Schaffenroth","V.",""],["Barlow","B. N.",""],["Raddi","R.",""],["Geier","S. J.",""],["Reindl","N.",""],["Rauch","T.",""],["Nemeth","P.",""],["Gänsicke","B. T.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 12:57:29 GMT"}],"updateDate":"2024-07-08","timestamp":1720184249000,"abstract":"  Hot subdwarfs (sdO/B) are the stripped helium cores of red giants formed by\nbinary interactions. Close hot subdwarf binaries with massive white dwarf\ncompanions have been proposed as possible progenitors of thermonuclear\nsupernovae type Ia (SN Ia). If the supernova is triggered by stable mass\ntransfer from the helium star, the companion should survive the explosion and\nshould be accelerated to high velocities. The hypervelocity star US 708 is\nregarded as the prototype for such an ejected companion. To find more of those\nobjects we conducted an extensive spectroscopic survey. Candidates for such\nfast stars have been selected from the spectroscopic database of the Sloan\nDigital Sky Survey (SDSS) and several ground-based proper motion surveys.\nFollow-up spectroscopy has been obtained with several 4m- to 10m-class\ntelescopes. Combining the results from quantitative spectroscopic analyses with\nspace-based astrometry from \\textit{Gaia} Early Data Release 3 (EDR3) we\ndetermined the atmospheric and kinematic parameters of 53 fast hot subdwarf\nstars. None of these stars is unbound to the Galaxy, although some have\nGalactic restframe velocities close to the Galactic escape velocity. 21 stars\nare apparently single objects, which crossed the Galactic disc within their\nlifetimes in the sdO/B stage and could be regarded as potential candidates for\nthe SN Ia ejection scenario. However, the properties of the full sample are\nmore consistent with a pure old Galactic halo population. We therefore conclude\nthat the fast sdO/B stars we found are likely to be extreme halo stars.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}