{"id":"2407.16928","title":"From Sands to Mansions: Enabling Automatic Full-Life-Cycle Cyberattack\n  Construction with LLM","authors":"Lingzhi Wang, Jiahui Wang, Kyle Jung, Kedar Thiagarajan, Emily Wei,\n  Xiangmin Shen, Yan Chen, Zhenyuan Li","authorsParsed":[["Wang","Lingzhi",""],["Wang","Jiahui",""],["Jung","Kyle",""],["Thiagarajan","Kedar",""],["Wei","Emily",""],["Shen","Xiangmin",""],["Chen","Yan",""],["Li","Zhenyuan",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 01:33:57 GMT"}],"updateDate":"2024-07-25","timestamp":1721784837000,"abstract":"  The escalating battles between attackers and defenders in cybersecurity make\nit imperative to test and evaluate defense capabilities from the attackers'\nperspective. However, constructing full-life-cycle cyberattacks and performing\nred team emulations requires significant time and domain knowledge from\nsecurity experts. Existing cyberattack simulation frameworks face challenges\nsuch as limited technical coverage, inability to conduct full-life-cycle\nattacks, and the need for manual infrastructure building. These limitations\nhinder the quality and diversity of the constructed attacks. In this paper, we\nleveraged the capabilities of Large Language Models (LLMs) in summarizing\nknowledge from existing attack intelligence and generating executable machine\ncode based on human knowledge. we proposed AURORA, an automatic end-to-end\ncyberattack construction and emulation framework. AURORA can autonomously build\nmulti-stage cyberattack plans based on Cyber Threat Intelligence (CTI) reports,\nconstruct the emulation infrastructures, and execute the attack procedures. We\nalso developed an attack procedure knowledge graph to integrate knowledge about\nattack techniques throughout the full life cycle of advanced cyberattacks from\nvarious sources. We constructed and evaluated more than 20 full-life-cycle\ncyberattacks based on existing CTI reports. Compared to previous attack\nsimulation frameworks, AURORA can construct multi-step attacks and the\ninfrastructures in several minutes without human intervention. Furthermore,\nAURORA incorporates a wider range (40% more) of attack techniques into the\nconstructed attacks in a more efficient way than the professional red teams. To\nbenefit further research, we open-sourced the dataset containing the execution\nfiles and infrastructures of 20 emulated cyberattacks.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}