{"id":"2407.14676","title":"On Learning Discriminative Features from Synthesized Data for\n  Self-Supervised Fine-Grained Visual Recognition","authors":"Zihu Wang, Lingqiao Liu, Scott Ricardo Figueroa Weston, Samuel Tian,\n  Peng Li","authorsParsed":[["Wang","Zihu",""],["Liu","Lingqiao",""],["Weston","Scott Ricardo Figueroa",""],["Tian","Samuel",""],["Li","Peng",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 21:43:19 GMT"}],"updateDate":"2024-07-23","timestamp":1721425399000,"abstract":"  Self-Supervised Learning (SSL) has become a prominent approach for acquiring\nvisual representations across various tasks, yet its application in\nfine-grained visual recognition (FGVR) is challenged by the intricate task of\ndistinguishing subtle differences between categories. To overcome this, we\nintroduce an novel strategy that boosts SSL's ability to extract critical\ndiscriminative features vital for FGVR. This approach creates synthesized data\npairs to guide the model to focus on discriminative features critical for FGVR\nduring SSL. We start by identifying non-discriminative features using two main\ncriteria: features with low variance that fail to effectively separate data and\nthose deemed less important by Grad-CAM induced from the SSL loss. We then\nintroduce perturbations to these non-discriminative features while preserving\ndiscriminative ones. A decoder is employed to reconstruct images from both\nperturbed and original feature vectors to create data pairs. An encoder is\ntrained on such generated data pairs to become invariant to variations in\nnon-discriminative dimensions while focusing on discriminative features,\nthereby improving the model's performance in FGVR tasks. We demonstrate the\npromising FGVR performance of the proposed approach through extensive\nevaluation on a wide variety of datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}