{"id":"2407.11262","title":"From Prediction to Experimental Realization of Ferroelectric Wurtzite\n  Al$_{1-x}$Gd$_{x}$N Alloys","authors":"Cheng-Wei Lee, Rebecca W. Smaha, Geoff L. Brennecka, Nancy Haegel,\n  Prashun Gorai, Keisuke Yazawa","authorsParsed":[["Lee","Cheng-Wei",""],["Smaha","Rebecca W.",""],["Brennecka","Geoff L.",""],["Haegel","Nancy",""],["Gorai","Prashun",""],["Yazawa","Keisuke",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 22:01:30 GMT"}],"updateDate":"2024-07-17","timestamp":1721080890000,"abstract":"  AlN-based alloys find widespread application in high-power microelectronics,\noptoelectronics, and electromechanics. The realization of ferroelectricity in\nwurtzite AlN-based heterostructural alloys has opened up the possibility of\ndirectly integrating ferroelectrics with conventional microelectronics based on\ntetrahedral semiconductors such as Si, SiC and III-Vs, enabling\ncompute-in-memory architectures, high-density data storage, and more. The\ndiscovery of AlN-based wurtzite ferroelectrics has been driven to date by\nchemical intuition and empirical explorations. Here, we demonstrate the\ncomputationally-guided discovery and experimental demonstration of new\nferroelectric wurtzite Al$_{1-x}$Gd$_x$N alloys. First-principles calculations\nindicate that the minimum energy pathway for switching changes from a\ncollective to an individual switching process with a lower overall energy\nbarrier, at a rare-earth fraction $x$ of $x>$ 0.10$-$0.15. Experimentally,\nferroelectric switching is observed at room temperature in Al$_{1-x}$Gd$_x$N\nfilms with $x>$ 0.12, which strongly supports the switching mechanisms in\nwurtzite ferroelectrics proposed previously (Lee et al., $\\textit{Science\nAdvances}$ 10, eadl0848, 2024). This is also the first demonstration of\nferroelectricity in an AlN-based alloy with a magnetic rare-earth element,\nwhich could pave the way for additional functionalities such as multiferroicity\nand opto-ferroelectricity in this exciting class of AlN-based materials.\n","subjects":["Condensed Matter/Materials Science","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}