{"id":"2407.19392","title":"AndroCon: Conning Location Services in Android","authors":"Soham Nag and Smruti R. Sarangi","authorsParsed":[["Nag","Soham",""],["Sarangi","Smruti R.",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 04:20:26 GMT"}],"updateDate":"2024-07-30","timestamp":1722140426000,"abstract":"  Mobile device hackers often target ambient sensing, human activity\nidentification, and interior floor mapping. In addition to overt signals like\nmicrophones and cameras, covert channels like WiFi, Bluetooth, and augmented\nGPS signal strengths have been employed to gather this information. Until date,\npassive, receive-only satellite GPS sensing relied solely on signal strength\nand location information. This paper demonstrates that semi-processed GPS data\n(39 features) accessible to apps since Android 7 with precise location\npermissions can be used as a highly accurate leaky channel for sensing ambient,\nrecognising human activity, and mapping indoor spaces (99%+ accuracy). This\nreport describes a longitudinal research that used semi-processed GPS readings\nfrom mobile devices throughout a 40,000 sq. km region for a year. Data was\nacquired from aeroplanes, cruise ships, and high-altitude places. To retain\ncrucial information, we analyse all satellite GPS signals and select the best\ncharacteristics using cross-correlation analysis. Our work, AndroCon, combines\nlin-ear discriminant analysis, unscented Kalman filtering, gradient boosting,\nand random forest learning to provide an accurate ambient and human activity\nsensor. At AndroCon, basic ML algorithms are used for discreet and somewhat\nexplainable outcomes. We can readily recognise challenging situations, such as\nbeing in a subway, when someone is waving a hand in front of a mobile device,\nin front of a stairway, or with others present (not always carrying phones).\nThis is the most extensive study on satellite GPS-based sensing as of yet.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}