{"id":"2407.10229","title":"Exploring fluorine chemical evolution in the Galactic disk: the open\n  cluster perspective","authors":"Shilpa Bijavara Seshashayana, Henrik J\\\"onsson, Valentina D'Orazi,\n  Nicoletta Sanna, Gloria Andreuzzi, Govind Nandakumar, Angela Bragaglia,\n  Donatella Romano, Emanuele Spitoni","authorsParsed":[["Seshashayana","Shilpa Bijavara",""],["Jönsson","Henrik",""],["D'Orazi","Valentina",""],["Sanna","Nicoletta",""],["Andreuzzi","Gloria",""],["Nandakumar","Govind",""],["Bragaglia","Angela",""],["Romano","Donatella",""],["Spitoni","Emanuele",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 14:49:21 GMT"}],"updateDate":"2024-09-11","timestamp":1720968561000,"abstract":"  Open clusters are ideal tools for tracing the abundances of different\nelements because their stars are expected to have the same age, distance, and\nmetallicity. Therefore, they serve as very powerful tracers for investigating\nthe cosmic origins of elements. This paper expands on a recent study by us,\nwhere the element Fluorine was studied in seven previously open clusters,\nadding six open clusters as well as eight field stars. The primary objective is\nto determine the abundance of fluorine (F) to gain insight into its production\nand evolution. The magnesium (Mg) abundances were derived to categorize the\nfield stars into high and low alpha disk populations. Additionally, cerium (Ce)\nabundances are determined to better understand the interplay between F and\ns-process elements. The spectra were obtained from the high-resolution\nnear-infra-red GIANO-B instrument at the Telescopio Nazionale Galileo (TNG).\nFor the derivation of the stellar parameters and abundances, the Python version\nof Spectroscopy Made Easy (PySME) was used. OH, CN, and CO molecular lines and\nband heads along with Fe I lines were used to determine the stellar parameters\nin the H-band region. Two HF lines in the K-band ({\\lambda}{\\lambda} 2.28, 2.33\n{\\mu}m), three K-band Mg I lines ({\\lambda}{\\lambda} 2.10, 2.11, 2.15 {\\mu}m),\nand two Ce II lines in the H-band ({\\lambda}{\\lambda} 1.66, and 1.71 {\\mu}m)\nwere used to derive the abundances of F, Mg, and Ce, respectively. F, Mg, and\nCe abundances were derived for 14 stars from 6 OCs, as well as 8 field stars.\nThe F and Ce abundances were investigated as a function of metallicity, age,\nand Galactocentric distances. Our results indicate that asymptotic giant branch\nstars and massive stars, including a subset of fast rotators (whose rotation\nspeed likely increases as metallicity decreases), are necessary to explain the\ncosmic origin of F.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BrzFHJy0XjyuR2m2ZNBy7543rP0pdXfxg-p1cnxnbQw","pdfSize":"557261","objectId":"0xf4f3ad2c2251bae700e24f81d8fcd09b99590162e16d3bdd34ffaad15e63c568","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
