{"id":"2407.21213","title":"A phase-field model for wet snow metamorphism","authors":"Adrian Moure and Xiaojing Fu","authorsParsed":[["Moure","Adrian",""],["Fu","Xiaojing",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 21:54:25 GMT"}],"updateDate":"2024-08-01","timestamp":1722376465000,"abstract":"  The microstructure of snow determines its fundamental properties such as the\nmechanical strength, reflectivity, or the thermo-hydraulic properties. Snow\nundergoes continuous microstructural changes due to local gradients in\ntemperature, humidity or curvature, in a process known as snow metamorphism. In\nthis work, we focus on wet snow metamorphism, which occurs when temperature is\nclose to the melting point and involves phase transitions amongst liquid water,\nwater vapor, and solid ice. We propose a pore-scale phase-field model that\nsimultaneously captures the three relevant phase-change phenomena: sublimation\n(deposition), evaporation (condensation), and melting (solidification). The\nphase-field formulation allows one to track the temperature evolution amongst\nthe three phases and the water vapor concentration in the air. Our three-phase\nmodel recovers the corresponding two-phase transition model when one phase is\nnot present in the system. 2D simulations of the model unveils the impact of\nhumidity and temperature on the dynamics of wet snow metamorphism at the pore\nscale. We also explore the role of liquid melt content in controlling the\ndynamics of snow metamorphism in contrast to the dry regime, before percolation\nonsets. The model can be readily extended to incorporate two-phase flow and may\nbe the basis for investigating other problems involving water phase transitions\nin a vapor-solid-liquid system such as airplane icing or thermal spray coating.\n","subjects":["Physics/Fluid Dynamics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"K5lTTXnYrL4vSBkps9VedbnffvG2tuqw8n8hjOMnei4","pdfSize":"10289480","objectId":"0x5c34ffaae9ce504385a91a5f7f6cc122e4632f66123f4fdc148e93bc1f394eef","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
