{"id":"2407.16534","title":"Energy cascade and \"Burgulence\" in the Fermi-Pasta-Ulam-Tsingou chain","authors":"Matteo Gallone, Antonio Ponno, Stefano Ruffo","authorsParsed":[["Gallone","Matteo",""],["Ponno","Antonio",""],["Ruffo","Stefano",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:46:43 GMT"}],"updateDate":"2024-07-24","timestamp":1721746003000,"abstract":"  The dynamics of initial long-wavelength excitations of the\nFermi-Pasta-Ulam-Tsingou chain has been the subject of intense investigations\nsince the pioneering work of Fermi and collaborators. We have recently found a\nnew regime where the spectrum of the Fourier modes decays with a power-law and\nwe have interpreted this regime as a transient turbulence associated with the\nBurgers equation. In this paper we present the full derivation of the latter\nequation from the lattice dynamics using a newly developed infinite dimensional\nHamiltonian perturbation theory. This theory allows us to relate the time\nevolution of the Fourier spectrum $E_k$ of the Burgers equation to the one of\nthe Fermi-Pasta-Ulam-Tsingou chain. As a consequence, we derive analytically\nboth the shock time and the power-law $-8/3$ of the spectrum at this time.\nUsing the shock time as a unit, we follow numerically the time-evolution of the\nspectrum and observe the persistence of the power $-2$ over an extensive time\nwindow. The exponent $-2$ has been widely discussed in the literature on the\nBurgers equation. The analysis of the Burgers equation in Fourier space also\ngives information on the time evolution of the energy of each single mode\nwhich, at short time, is also a power-law depending on the $k$-th wavenumber\n$E_k \\sim t^{2k-2}$. This approach to the FPUT dynamics opens the way to a\nwider study of scaling regimes arising from more general initial conditions.\n","subjects":["Condensed Matter/Statistical Mechanics","Physics/Mathematical Physics","Mathematics/Dynamical Systems","Mathematics/Mathematical Physics","Nonlinear Sciences/Exactly Solvable and Integrable Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}