{"id":"2407.11965","title":"UrbanWorld: An Urban World Model for 3D City Generation","authors":"Yu Shang, Jiansheng Chen, Hangyu Fan, Jingtao Ding, Jie Feng, Yong Li","authorsParsed":[["Shang","Yu",""],["Chen","Jiansheng",""],["Fan","Hangyu",""],["Ding","Jingtao",""],["Feng","Jie",""],["Li","Yong",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 17:59:29 GMT"}],"updateDate":"2024-07-17","timestamp":1721152769000,"abstract":"  Cities, as the most fundamental environment of human life, encompass diverse\nphysical elements such as buildings, roads and vegetation with complex\ninterconnection. Crafting realistic, interactive 3D urban environments plays a\ncrucial role in constructing AI agents capable of perceiving, decision-making,\nand acting like humans in real-world environments. However, creating\nhigh-fidelity 3D urban environments usually entails extensive manual labor from\ndesigners, involving intricate detailing and accurate representation of complex\nurban features. Therefore, how to accomplish this in an automatical way remains\na longstanding challenge. Toward this problem, we propose UrbanWorld, the first\ngenerative urban world model that can automatically create a customized,\nrealistic and interactive 3D urban world with flexible control conditions.\nUrbanWorld incorporates four key stages in the automatical crafting pipeline:\n3D layout generation from openly accessible OSM data, urban scene planning and\ndesigning with a powerful urban multimodal large language model (Urban MLLM),\ncontrollable urban asset rendering with advanced 3D diffusion techniques, and\nfinally the MLLM-assisted scene refinement. The crafted high-fidelity 3D urban\nenvironments enable realistic feedback and interactions for general AI and\nmachine perceptual systems in simulations. We are working on contributing\nUrbanWorld as an open-source and versatile platform for evaluating and\nimproving AI abilities in perception, decision-making, and interaction in\nrealistic urban environments.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}