{"id":"2407.06566","title":"Robust and Explainable Framework to Address Data Scarcity in Diagnostic\n  Imaging","authors":"Zehui Zhao, Laith Alzubaidi, Jinglan Zhang, Ye Duan, Usman Naseem,\n  Yuantong Gu","authorsParsed":[["Zhao","Zehui",""],["Alzubaidi","Laith",""],["Zhang","Jinglan",""],["Duan","Ye",""],["Naseem","Usman",""],["Gu","Yuantong",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 05:48:45 GMT"}],"updateDate":"2024-07-10","timestamp":1720504125000,"abstract":"  Deep learning has significantly advanced automatic medical diagnostics and\nreleased the occupation of human resources to reduce clinical pressure, yet the\npersistent challenge of data scarcity in this area hampers its further\nimprovements and applications. To address this gap, we introduce a novel\nensemble framework called `Efficient Transfer and Self-supervised Learning\nbased Ensemble Framework' (ETSEF). ETSEF leverages features from multiple\npre-trained deep learning models to efficiently learn powerful representations\nfrom a limited number of data samples. To the best of our knowledge, ETSEF is\nthe first strategy that combines two pre-training methodologies (Transfer\nLearning and Self-supervised Learning) with ensemble learning approaches.\nVarious data enhancement techniques, including data augmentation, feature\nfusion, feature selection, and decision fusion, have also been deployed to\nmaximise the efficiency and robustness of the ETSEF model. Five independent\nmedical imaging tasks, including endoscopy, breast cancer, monkeypox, brain\ntumour, and glaucoma detection, were tested to demonstrate ETSEF's\neffectiveness and robustness. Facing limited sample numbers and challenging\nmedical tasks, ETSEF has proved its effectiveness by improving diagnostics\naccuracies from 10\\% to 13.3\\% when compared to strong ensemble baseline models\nand up to 14.4\\% improvements compared with published state-of-the-art methods.\nMoreover, we emphasise the robustness and trustworthiness of the ETSEF method\nthrough various vision-explainable artificial intelligence techniques,\nincluding Grad-CAM, SHAP, and t-SNE. Compared to those large-scale deep\nlearning models, ETSEF can be deployed flexibly and maintain superior\nperformance for challenging medical imaging tasks, showing the potential to be\napplied to more areas that lack training data\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"t5e4Ly_yPBJn3oXF1uIZUWHUICbXPWC5En0FUs7RzpA","pdfSize":"22357761"}
