{"id":"2407.17911","title":"ReCorD: Reasoning and Correcting Diffusion for HOI Generation","authors":"Jian-Yu Jiang-Lin, Kang-Yang Huang, Ling Lo, Yi-Ning Huang, Terence\n  Lin, Jhih-Ciang Wu, Hong-Han Shuai, Wen-Huang Cheng","authorsParsed":[["Jiang-Lin","Jian-Yu",""],["Huang","Kang-Yang",""],["Lo","Ling",""],["Huang","Yi-Ning",""],["Lin","Terence",""],["Wu","Jhih-Ciang",""],["Shuai","Hong-Han",""],["Cheng","Wen-Huang",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 10:06:26 GMT"}],"updateDate":"2024-07-26","timestamp":1721901986000,"abstract":"  Diffusion models revolutionize image generation by leveraging natural\nlanguage to guide the creation of multimedia content. Despite significant\nadvancements in such generative models, challenges persist in depicting\ndetailed human-object interactions, especially regarding pose and object\nplacement accuracy. We introduce a training-free method named Reasoning and\nCorrecting Diffusion (ReCorD) to address these challenges. Our model couples\nLatent Diffusion Models with Visual Language Models to refine the generation\nprocess, ensuring precise depictions of HOIs. We propose an interaction-aware\nreasoning module to improve the interpretation of the interaction, along with\nan interaction correcting module to refine the output image for more precise\nHOI generation delicately. Through a meticulous process of pose selection and\nobject positioning, ReCorD achieves superior fidelity in generated images while\nefficiently reducing computational requirements. We conduct comprehensive\nexperiments on three benchmarks to demonstrate the significant progress in\nsolving text-to-image generation tasks, showcasing ReCorD's ability to render\ncomplex interactions accurately by outperforming existing methods in HOI\nclassification score, as well as FID and Verb CLIP-Score. Project website is\navailable at https://alberthkyhky.github.io/ReCorD/ .\n","subjects":["Computing Research Repository/Multimedia","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}