{"id":"2407.04238","title":"Simulating carbon mineralization at pore scale in capillary networks of\n  digital rock","authors":"David A. Lazo Vasquez, Jaione Tirapu Azpiroz, Rodrigo Neumann Barros\n  Ferreira, Ronaldo Giro, Manuela Fernandes Blanco Rodriguez, Matheus Esteves\n  Ferreira, Mathias B. Steiner","authorsParsed":[["Vasquez","David A. Lazo",""],["Azpiroz","Jaione Tirapu",""],["Ferreira","Rodrigo Neumann Barros",""],["Giro","Ronaldo",""],["Rodriguez","Manuela Fernandes Blanco",""],["Ferreira","Matheus Esteves",""],["Steiner","Mathias B.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 03:45:52 GMT"}],"updateDate":"2024-07-08","timestamp":1720151152000,"abstract":"  Predicting the geometrical evolution of the pore space in geological\nformations due to fluid-solid interactions has applications in reservoir\nengineering, oil recovery, and geological storage of carbon dioxide. However,\nmodeling frameworks that combine fluid flow with physical and chemical\nprocesses at a rock's pore scale are scarce. Here, we report a method for\nmodeling a rock's pore space as a network of connected capillaries and to\nsimulate the capillary diameter modifications caused by reactive flow\nprocesses. Specifically, we model mineral erosion, deposition, dissolution, and\nprecipitation processes by solving the transport equations iteratively,\ncomputing diameter changes within each capillary of the network simultaneously.\nOur automated modeling framework enables simulations on digital rock samples as\nlarge as (1.125mm)$^3$ with 125$\\times 10^6$ voxels within seconds of CPU time\nper iteration. As an application of the computational method, we have simulated\nbrine injection and calcium carbonate precipitation in sandstone. For\nquantitatively comparing simulation results obtained with models predicting\neither a constant or a flow-rate dependent precipitation, we track the\ntime-dependent capillary diameter distribution as well as the permeability of\nthe connected pore space. For validation and reuse, we have made the automated\nsimulation workflow, the reactive flow model library, and the digital rock\nsamples available in public repositories.\n","subjects":["Physics/Applied Physics","Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}