{"id":"2407.07307","title":"Dual-stage Hyperspectral Image Classification Model with Spectral\n  Supertoken","authors":"Peifu Liu, Tingfa Xu, Jie Wang, Huan Chen, Huiyan Bai, Jianan Li","authorsParsed":[["Liu","Peifu",""],["Xu","Tingfa",""],["Wang","Jie",""],["Chen","Huan",""],["Bai","Huiyan",""],["Li","Jianan",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 01:58:30 GMT"},{"version":"v2","created":"Sat, 13 Jul 2024 08:12:06 GMT"}],"updateDate":"2024-07-16","timestamp":1720576710000,"abstract":"  Hyperspectral image classification, a task that assigns pre-defined classes\nto each pixel in a hyperspectral image of remote sensing scenes, often faces\nchallenges due to the neglect of correlations between spectrally similar\npixels. This oversight can lead to inaccurate edge definitions and difficulties\nin managing minor spectral variations in contiguous areas. To address these\nissues, we introduce the novel Dual-stage Spectral Supertoken Classifier\n(DSTC), inspired by superpixel concepts. DSTC employs spectrum-derivative-based\npixel clustering to group pixels with similar spectral characteristics into\nspectral supertokens. By projecting the classification of these tokens onto the\nimage space, we achieve pixel-level results that maintain regional\nclassification consistency and precise boundary. Moreover, recognizing the\ndiversity within tokens, we propose a class-proportion-based soft label. This\nlabel adaptively assigns weights to different categories based on their\nprevalence, effectively managing data distribution imbalances and enhancing\nclassification performance. Comprehensive experiments on WHU-OHS, IP, KSC, and\nUP datasets corroborate the robust classification capabilities of DSTC and the\neffectiveness of its individual components. Code will be publicly available at\nhttps://github.com/laprf/DSTC.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}