{"id":"2407.14107","title":"Approximate Relational Reasoning for Higher-Order Probabilistic Programs","authors":"Philipp G. Haselwarter, Kwing Hei Li, Alejandro Aguirre, Simon\n  Oddershede Gregersen, Joseph Tassarotti, Lars Birkedal","authorsParsed":[["Haselwarter","Philipp G.",""],["Li","Kwing Hei",""],["Aguirre","Alejandro",""],["Gregersen","Simon Oddershede",""],["Tassarotti","Joseph",""],["Birkedal","Lars",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 08:22:10 GMT"}],"updateDate":"2024-07-22","timestamp":1721377330000,"abstract":"  Properties such as provable security and correctness for randomized programs\nare naturally expressed relationally as approximate equivalences. As a result,\na number of relational program logics have been developed to reason about such\napproximate equivalences of probabilistic programs. However, existing\napproximate relational logics are mostly restricted to first-order programs\nwithout general state.\n  In this paper we develop Approxis, a higher-order approximate relational\nseparation logic for reasoning about approximate equivalence of programs\nwritten in an expressive ML-like language with discrete probabilistic sampling,\nhigher-order functions, and higher-order state. The Approxis logic recasts the\nconcept of error credits in the relational setting to reason about relational\napproximation, which allows for expressive notions of modularity and\ncomposition, a range of new approximate relational rules, and an\ninternalization of a standard limiting argument for showing exact probabilistic\nequivalences by approximation. We also use Approxis to develop a logical\nrelation model that quantifies over error credits, which can be used to prove\nexact contextual equivalence. We demonstrate the flexibility of our approach on\na range of examples, including the PRP/PRF switching lemma, IND\\$-CPA security\nof an encryption scheme, and a collection of rejection samplers. All of the\nresults have been mechanized in the Coq proof assistant and the Iris separation\nlogic framework.\n","subjects":["Computing Research Repository/Logic in Computer Science","Computing Research Repository/Programming Languages"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"i2O_pmsIwCfGVfHQ8u6spdJHC-hAqQGHrQprCjncoAM","pdfSize":"841314"}
