{"id":"2407.19289","title":"Atmospheric heating and magnetism driven by $^{22}$Ne distillation in\n  isolated white dwarfs","authors":"A. F. Lanza (INAF-Catania, Italy), N. Z. Rui (TAPIR, Caltech, US), J.\n  Farihi (Dept. of Physics and Astronomy, UCL, UK), J. D. Landstreet (Univ. of\n  Western Ontario, Canada), S. Bagnulo (Armagh Observatory, UK)","authorsParsed":[["Lanza","A. F.","","INAF-Catania, Italy"],["Rui","N. Z.","","TAPIR, Caltech, US"],["Farihi","J.","","Dept. of Physics and Astronomy, UCL, UK"],["Landstreet","J. D.","","Univ. of\n  Western Ontario, Canada"],["Bagnulo","S.","","Armagh Observatory, UK"]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 16:03:00 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 10:48:26 GMT"},{"version":"v3","created":"Wed, 31 Jul 2024 05:43:51 GMT"}],"updateDate":"2024-08-01","timestamp":1722096180000,"abstract":"  The origin of atmospheric heating in the cool, magnetic white dwarf GD 356\nremains unsolved nearly 40 years after its discovery. This once idiosyncratic\nstar with $T_{\\rm eff}\\approx7500$ K, yet Balmer lines in Zeeman-split emission\nis now part of a growing class of white dwarfs exhibiting similar features, and\nwhich are tightly clustered in the HR diagram suggesting an intrinsic power\nsource. This paper proposes that convective motions associated with an internal\ndynamo can power electric currents along magnetic field lines that heat the\natmosphere via Ohmic dissipation. Such currents would require a dynamo driven\nby core $^{22}$Ne distillation, and would further corroborate magnetic field\ngeneration in white dwarfs by this process. The model predicts that the heating\nwill be highest near the magnetic poles, and virtually absent toward the\nequator, in agreement with observations. This picture is also consistent with\nthe absence of X-ray or extreme ultraviolet emission, because the resistivity\nwould decrease by several orders of magnitude at the typical coronal\ntemperatures. The proposed model suggests that i) DAHe stars are mergers with\nenhanced $^{22}$Ne that enables distillation and may result in significant\ncooling delays; and ii) any mergers that distill neon will generate magnetism\nand chromospheres. The predicted chromospheric emission is consistent with the\ntwo known massive DQe white dwarfs.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}