{"id":"2407.18888","title":"Semistructured Merge with Language-Specific Syntactic Separators","authors":"Guilherme Cavalcanti, Paulo Borba, Leonardo dos Anjos and Jonatas\n  Clementino","authorsParsed":[["Cavalcanti","Guilherme",""],["Borba","Paulo",""],["Anjos","Leonardo dos",""],["Clementino","Jonatas",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:40:29 GMT"}],"updateDate":"2024-07-29","timestamp":1722015629000,"abstract":"  Structured merge tools exploit programming language syntactic structure to\nenhance merge accuracy by reducing spurious conflicts reported by unstructured\ntools. By creating and handling full ASTs, structured tools are\nlanguage-specific and harder to implement. They can also be computationally\nexpensive when merging large files.To reduce these drawbacks, semistructured\nmerge tools work with partial ASTs that use strings to represent lower level\nsyntactic structures such as method bodies, and rely on unstructured tools to\nmerge them. This, however, results in merge accuracy loss. To improve accuracy\nwithout compromising semistructured merge benefits, we propose a tool that\nleverages language-specific syntactic separators to infer structure without\nparsing. We still resort to an unstructured tool to merge lower level\nstructures, but only after preprocessing the code so that text in between\nseparators such as curly braces appear in separate lines. This way we emulate\nthe capabilities of structured merge tools while avoiding their drawbacks. By\ncomparing our tool with a robust implementation of semistructured merge, we\nfind that our tool substantially reduces the number of spurious conflicts. We\nalso observe significant but less substantial reductions on the overall number\nof reported conflicts, and of files with conflicts. However, similar to\nstructured tools, our tool lets more merge conflicts go undetected. Our tool\nshows significant improvements over unstructured tools widely used in practice.\nFinally we observe that exploiting language-specific syntactic separators\nintroduces unique textual alignment challenges.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}