{"id":"2407.18489","title":"Mini-Batch Gradient-Based MCMC for Decentralized Massive MIMO Detection","authors":"Xingyu Zhou, Le Liang, Jing Zhang, Chao-Kai Wen, Shi Jin","authorsParsed":[["Zhou","Xingyu",""],["Liang","Le",""],["Zhang","Jing",""],["Wen","Chao-Kai",""],["Jin","Shi",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 03:45:27 GMT"}],"updateDate":"2024-07-29","timestamp":1721965527000,"abstract":"  Massive multiple-input multiple-output (MIMO) technology has significantly\nenhanced spectral and power efficiency in cellular communications and is\nexpected to further evolve towards extra-large-scale MIMO. However, centralized\nprocessing for massive MIMO faces practical obstacles, including excessive\ncomputational complexity and a substantial volume of baseband data to be\nexchanged. To address these challenges, decentralized baseband processing has\nemerged as a promising solution. This approach involves partitioning the\nantenna array into clusters with dedicated computing hardware for parallel\nprocessing. In this paper, we investigate the gradient-based Markov chain Monte\nCarlo (MCMC) method -- an advanced MIMO detection technique known for its\nnear-optimal performance in centralized implementation -- within the context of\na decentralized baseband processing architecture. This decentralized design\nmitigates the computation burden at a single processing unit by utilizing\ncomputational resources in a distributed and parallel manner. Additionally, we\nintegrate the mini-batch stochastic gradient descent method into the proposed\ndecentralized detector, achieving remarkable performance with high efficiency.\nSimulation results demonstrate substantial performance gains of the proposed\nmethod over existing decentralized detectors across various scenarios.\nMoreover, complexity analysis reveals the advantages of the proposed\ndecentralized strategy in terms of computation delay and interconnection\nbandwidth when compared to conventional centralized detectors.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}