{"id":"2407.07779","title":"Correlation of srf performance to oxygen diffusion length of medium\n  temperature heat treated cavities","authors":"C. Bate, K. Kasprzak, D. Reschke, L. Steder, L. Trelle, H. Weise, M.\n  Wiencek, J. Wolff","authorsParsed":[["Bate","C.",""],["Kasprzak","K.",""],["Reschke","D.",""],["Steder","L.",""],["Trelle","L.",""],["Weise","H.",""],["Wiencek","M.",""],["Wolff","J.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 15:53:26 GMT"}],"updateDate":"2024-07-11","timestamp":1720626806000,"abstract":"  This comprehensive study, being part of the European XFEL R\\&D effort,\nelucidates the influence of medium temperature (mid-T) heat treatments between\n250{\\deg}C and 350{\\deg}C on the performance of 1.3~GHz superconducting\nradiofrequency (SRF) niobium cavities. Utilizing a refurbished niobium retort\nfurnace equipped with an inter-vacuum chamber and cryopumps at DESY, we have\nembarked on an investigation to enhance the state-of-the-art SRF cavity\ntechnology. Our research reveals that mid-T heat treatments significantly boost\nthe quality factor ($Q_0$) of the cavities, achieving values between\n$2\\cdot10^{10}$ to $5\\cdot10^{10}$ at field strengths around 16~MV/m, while the\nmaximum field strengths are limited to 25-35~MV/m and enhanced sensitivity to\ntrapped magnetic flux is observed. Moreover, we delve into the effects of\nsurface impurity concentration changes, particularly the diffusion of oxygen\ncontent, and its impact on performance enhancements. By categorizing treatments\nbased on calculated diffusion lengths using the whole temperature profile, we\nrecognize patterns that suggest an optimal diffusion length conducive to\noptimizing cavity performance. SIMS results from samples confirm the calculated\noxygen diffusion lengths in most instances. Deviations are primarily attributed\nto grain boundaries in fine-grain materials, necessitating repeated\nmeasurements on single-crystal materials to further investigate this\nphenomenon. Investigations into cooling rates and the resulting spatial\ntemperature gradients across the cavities ranging from 0.04 to 0.2~K/mm reveal\nno significant correlation with performance following a mid-T heat treatment.\nHowever, the increased sensitivity to trapped magnetic flux leads to new\nchallenges in the quest for next-generation accelerator technologies since the\nrequirement for magnetic hygiene gets stricter.\n","subjects":["Physics/Accelerator Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"u-w18UCNXLUUR3oKD1UK9dRqLMKBpePPF-QLsh8PFyo","pdfSize":"13438227","objectId":"0x3183a283bc1c355644c516231bfded1af6a7c808866556529f91cdf809819c17","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
