{"id":"2407.12797","title":"CEBench: A Benchmarking Toolkit for the Cost-Effectiveness of LLM\n  Pipelines","authors":"Wenbo Sun, Jiaqi Wang, Qiming Guo, Ziyu Li, Wenlu Wang, Rihan Hai","authorsParsed":[["Sun","Wenbo",""],["Wang","Jiaqi",""],["Guo","Qiming",""],["Li","Ziyu",""],["Wang","Wenlu",""],["Hai","Rihan",""]],"versions":[{"version":"v1","created":"Thu, 20 Jun 2024 21:36:00 GMT"}],"updateDate":"2024-07-19","timestamp":1718919360000,"abstract":"  Online Large Language Model (LLM) services such as ChatGPT and Claude 3 have\ntransformed business operations and academic research by effortlessly enabling\nnew opportunities. However, due to data-sharing restrictions, sectors such as\nhealthcare and finance prefer to deploy local LLM applications using costly\nhardware resources. This scenario requires a balance between the effectiveness\nadvantages of LLMs and significant financial burdens. Additionally, the rapid\nevolution of models increases the frequency and redundancy of benchmarking\nefforts. Existing benchmarking toolkits, which typically focus on\neffectiveness, often overlook economic considerations, making their findings\nless applicable to practical scenarios. To address these challenges, we\nintroduce CEBench, an open-source toolkit specifically designed for\nmulti-objective benchmarking that focuses on the critical trade-offs between\nexpenditure and effectiveness required for LLM deployments. CEBench allows for\neasy modifications through configuration files, enabling stakeholders to\neffectively assess and optimize these trade-offs. This strategic capability\nsupports crucial decision-making processes aimed at maximizing effectiveness\nwhile minimizing cost impacts. By streamlining the evaluation process and\nemphasizing cost-effectiveness, CEBench seeks to facilitate the development of\neconomically viable AI solutions across various industries and research fields.\nThe code and demonstration are available in\n\\url{https://github.com/amademicnoboday12/CEBench}.\n","subjects":["Computing Research Repository/Performance","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}