{"id":"2407.04324","title":"Flow fields around active droplets squeezing through tight confinements","authors":"Subhasish Guchhait, Smita Sontakke, Shubhadeep Mandal, Ranabir Dey","authorsParsed":[["Guchhait","Subhasish",""],["Sontakke","Smita",""],["Mandal","Shubhadeep",""],["Dey","Ranabir",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 07:48:52 GMT"}],"updateDate":"2024-07-08","timestamp":1720165732000,"abstract":"  Biological microswimmers, like euglena, deform their body shape to swim\nthrough tight confinements having length scales comparable to the microswimmer\nlength scale. Recently, it was shown that self-propelling active droplets can\nalso squeeze through tight microconfinements by elongating their shape.\nHowever, the evolution of the hydrodynamic signature, or the velocity field,\ngenerated by the active droplet, as it deforms its shape to swim through\nincreasingly tight microconfinements, has remained scarcely studied. Using\nhigh-resolution fluorescence microscopy and $\\mu$-Particle Image Velocimetry\n(PIV) analysis, we show here that as the swimming active droplet deforms from a\nspherical shape to a `stadium'-like shape, and eventually to an elongated\n`capsule'-like shape in increasingly tighter microchannels, its hydrodynamic\nsignature changes from a `pusher'-like velocity field to a `puller'-like\nvelocity field, and finally to an asymmetric velocity field. We characterize\nsuch alterations in the active droplet dynamics using the distributions of the\nlocal velocity magnitude, axial and transverse components of the local flow\nvelocity, vorticity, and the filled micelle concentration. Finally, we use\nfinite-element based numerical simulations to explain the aforementioned\nevolution of the velocity field stemming from the underlying physico-chemical\nhydrodynamics in the presence of a thin lubrication film between the swimming\nactive droplet and the tight microconfinement walls. The present work provides\na comprehensive understanding of the chemo-hydrodynamic characteristics of\nactive droplets navigating extreme confined spaces, which can be beneficial for\nmany autonomous cargo-delivery applications.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}