{"id":"2407.17241","title":"Walking with SOXS towards the transient sky","authors":"P. Schipani, S. Campana, R. Claudi, M. Aliverti, A. Baruffolo, S.\n  Ben-Ami, G. Capasso, M. Colapietro, R. Cosentino, F. D'Alessio, P. D'Avanzo,\n  M. Genoni, O. Hershko, H. Kuncarayakti, M. Landoni, M. Munari, G. Pignata, K.\n  Radhakrishnan, D. Ricci, A. Rubin, S. Scuderi, F. Vitali, D. Young, M.\n  Accardo, J. Achr\\'en, J. A. Araiza-Dur\\'an, I. Arcavi, L. Asquini, F.\n  Battaini, A. Bichkovsky, A. Brucalassi, R. Bruch, L. Cabona, E. Cappellaro,\n  M. Della Valle, S. Di Filippo, R. Di Benedetto, S. D'Orsi, A. Gal-Yam, M.\n  Hernandez, D. Ives, H.-U.Kaeufl, J. Kotilainen, G. Li Causi, L. Lessio, L.\n  Marty, S. Mattila, L. Mehrgan, L. Pasquini, E. Pompei, M. Rappaport, M. Riva,\n  B. Salasnich, S. Savarese, I. Saviane, M. Sch\\\"oller, A.Silber, S. Smartt, R.\n  Zanmar Sanchez, M. Stritzinger, A. Sulich, H. Ventura","authorsParsed":[["Schipani","P.",""],["Campana","S.",""],["Claudi","R.",""],["Aliverti","M.",""],["Baruffolo","A.",""],["Ben-Ami","S.",""],["Capasso","G.",""],["Colapietro","M.",""],["Cosentino","R.",""],["D'Alessio","F.",""],["D'Avanzo","P.",""],["Genoni","M.",""],["Hershko","O.",""],["Kuncarayakti","H.",""],["Landoni","M.",""],["Munari","M.",""],["Pignata","G.",""],["Radhakrishnan","K.",""],["Ricci","D.",""],["Rubin","A.",""],["Scuderi","S.",""],["Vitali","F.",""],["Young","D.",""],["Accardo","M.",""],["Achrén","J.",""],["Araiza-Durán","J. A.",""],["Arcavi","I.",""],["Asquini","L.",""],["Battaini","F.",""],["Bichkovsky","A.",""],["Brucalassi","A.",""],["Bruch","R.",""],["Cabona","L.",""],["Cappellaro","E.",""],["Della Valle","M.",""],["Di Filippo","S.",""],["Di Benedetto","R.",""],["D'Orsi","S.",""],["Gal-Yam","A.",""],["Hernandez","M.",""],["Ives","D.",""],["Kaeufl","H. -U.",""],["Kotilainen","J.",""],["Causi","G. Li",""],["Lessio","L.",""],["Marty","L.",""],["Mattila","S.",""],["Mehrgan","L.",""],["Pasquini","L.",""],["Pompei","E.",""],["Rappaport","M.",""],["Riva","M.",""],["Salasnich","B.",""],["Savarese","S.",""],["Saviane","I.",""],["Schöller","M.",""],["Silber","A.",""],["Smartt","S.",""],["Sanchez","R. Zanmar",""],["Stritzinger","M.",""],["Sulich","A.",""],["Ventura","H.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 13:00:00 GMT"}],"updateDate":"2024-07-25","timestamp":1721826000000,"abstract":"  SOXS (Son Of X-Shooter) is the new ESO instrument that is going to be\ninstalled on the 3.58-m New Technology Telescope at the La Silla Observatory.\nSOXS is a single object spectrograph offering a wide simultaneous spectral\ncoverage from U- to H-band. Although such an instrument may have potentially a\nlarge variety of applications, the consortium designed it with a clear science\ncase: it is going to provide the spectroscopic counterparts to the ongoing and\nupcoming imaging surveys, becoming one of the main follow-up instruments in the\nSouthern hemisphere for the classification and characterization of transients.\nThe NTT+SOXS system is specialized to observe all transients and variable\nsources discovered by imaging surveys with a flexible schedule maintained by\nthe consortium, based on a remote scheduler which will interface with the\nobservatory software infrastructure. SOXS is realized timely to be highly\nsynergic with transients discovery machines like the Vera C. Rubin Observatory.\nThe instrument has been integrated and tested in Italy, collecting and\nassembling subsystems coming from all partners spread over six countries in\nthree continents. The first preparatory activities in Chile have been completed\nat the telescope. This article gives an updated status of the project before\nthe shipping of the instrument to Chile.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mnhuw82hAl6jndbWaTyShYn7lC_SgIZd4RdyoaYCT_o","pdfSize":"10218349"}
