{"id":"2407.07277","title":"Lifestyle-Informed Personalized Blood Biomarker Prediction via Novel\n  Representation Learning","authors":"A. Ali Heydari, Naghmeh Rezaei, Javier L. Prieto, Shwetak N. Patel,\n  Ahmed A. Metwally","authorsParsed":[["Heydari","A. Ali",""],["Rezaei","Naghmeh",""],["Prieto","Javier L.",""],["Patel","Shwetak N.",""],["Metwally","Ahmed A.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 23:52:53 GMT"}],"updateDate":"2024-07-11","timestamp":1720569173000,"abstract":"  Blood biomarkers are an essential tool for healthcare providers to diagnose,\nmonitor, and treat a wide range of medical conditions. Current reference values\nand recommended ranges often rely on population-level statistics, which may not\nadequately account for the influence of inter-individual variability driven by\nfactors such as lifestyle and genetics. In this work, we introduce a novel\nframework for predicting future blood biomarker values and define personalized\nreferences through learned representations from lifestyle data (physical\nactivity and sleep) and blood biomarkers. Our proposed method learns a\nsimilarity-based embedding space that captures the complex relationship between\nbiomarkers and lifestyle factors. Using the UK Biobank (257K participants), our\nresults show that our deep-learned embeddings outperform traditional and\ncurrent state-of-the-art representation learning techniques in predicting\nclinical diagnosis. Using a subset of UK Biobank of 6440 participants who have\nfollow-up visits, we validate that the inclusion of these embeddings and\nlifestyle factors directly in blood biomarker models improves the prediction of\nfuture lab values from a single lab visit. This personalized modeling approach\nprovides a foundation for developing more accurate risk stratification tools\nand tailoring preventative care strategies. In clinical settings, this\ntranslates to the potential for earlier disease detection, more timely\ninterventions, and ultimately, a shift towards personalized healthcare.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}