{"id":"2407.18117","title":"The temperature influence on the brightening of neutral and charged dark\n  excitons in WSe$_2$ monolayer","authors":"{\\L}. Kipczak, N. Zawadzka, D. Jana, I. Antoniazzi, M. Grzeszczyk, M.\n  Zinkiewicz, K. Watanabe, T. Taniguchi, M. Potemski, C. Faugeras, A.\n  Babi\\'nski and M. R. Molas","authorsParsed":[["Kipczak","Ł.",""],["Zawadzka","N.",""],["Jana","D.",""],["Antoniazzi","I.",""],["Grzeszczyk","M.",""],["Zinkiewicz","M.",""],["Watanabe","K.",""],["Taniguchi","T.",""],["Potemski","M.",""],["Faugeras","C.",""],["Babiński","A.",""],["Molas","M. R.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 15:25:36 GMT"}],"updateDate":"2024-07-26","timestamp":1721921136000,"abstract":"  The optically dark states play an important role in the electronic and\noptical properties of monolayers (MLs) of semiconducting transition metal\ndichalcogenides. The effect of temperature on the in-plane-field activation of\nthe neutral and charged dark excitons is investigated in a WSe$_2$ ML\nencapsulated in hexagonal BN flakes. The brightening rates of the neutral dark\n(X$^D$) and grey (X$^G$) excitons and the negative dark trion (T$^D$) differ\nsubstantially at a particular temperature. More importantly, they vanish\nconsiderably by about 3 -- 4 orders of magnitude with the temperature increased\nfrom 4.2 K to 100 K. The quenching of the dark-related emissions is accompanied\nby the two-order-of-magnitude increase in the emissions of their neutral bright\ncounterparts, $i.e.$ neutral bright exciton (X$^B$) and spin-singlet (T$^S$)\nand spin-triplet (T$^T$) negative trions, due to the thermal activations of\ndark states. Furthermore, the energy splittings between the dark X$^D$ and\nT$^D$ complexes and the corresponding bright X$^B$, T$^S$, and T$^T$ ones vary\nwith temperature rises from 4.2 K to 100 K. This can be explained in terms of\nthe different exciton-phonon couplings for the bright and dark excitons\nstemming from their distinct symmetry properties.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ltN3IiwWpplWtUMNPawlA9EL5YhMJpy4Vkm53D4oPhU","pdfSize":"881846"}
