{"id":"2407.00172","title":"Zooming in on the Circumgalactic Medium with GIBLE: Tracing the Origin\n  and Evolution of Cold Clouds","authors":"Rahul Ramesh, Dylan Nelson, Drummond Fielding and Marcus Br\\\"uggen","authorsParsed":[["Ramesh","Rahul",""],["Nelson","Dylan",""],["Fielding","Drummond",""],["Brüggen","Marcus",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 18:21:31 GMT"}],"updateDate":"2024-07-02","timestamp":1719598891000,"abstract":"  We use the GIBLE suite of cosmological zoom-in simulations of Milky Way-like\ngalaxies with additional super-Lagrangian refinement in the circumgalactic\nmedium (CGM) to quantify the origin and evolution of CGM cold gas clouds. The\norigin of $z$\\,$=$\\,$0$ clouds can be traced back to recent\n($\\lesssim$\\,$2$\\,Gyr) outflows from the central galaxy ($\\sim$\\,45\\,$\\%$),\ncondensation out of the hot phase of the CGM in the same time frame\n($\\sim$\\,45\\,$\\%$), and to a lesser degree to satellite galaxies\n($\\lesssim$\\,5\\,$\\%$). We find that in-situ condensation results from rapid\ncooling around local over-densities primarily seeded by the dissolution of the\nprevious generation of clouds into the hot halo. About $\\lesssim$\\,10\\,$\\%$ of\nthe cloud population is long lived, with their progenitors having already\nassembled $\\sim$\\,$2$\\,Gyr ago. Collective cloud-cloud dynamics are crucial to\ntheir evolution, with coalescence and fragmentation events occurring frequently\n($\\gtrsim$\\,20\\,Gyr$^{-1}$). These interactions are modulated by non-vanishing\npressure imbalances between clouds and their interface layers. The gas content\nof clouds is in a constant state of flux, with clouds and their surroundings\nexchanging mass at a rate of \\mbox{$\\gtrsim$\\,$10^3$\\,M$_\\odot$\\,Myr$^{-1}$},\ndepending on cloud relative velocity and interface vorticity. Furthermore, we\nfind that a net magnetic tension force acting against the density gradient is\ncapable of inhibiting cloud-background mixing. Our results show that capturing\nthe distinct origins of cool CGM clouds, together with their physical\nevolution, requires high-resolution, cosmological galaxy formation simulations\nwith both stellar and supermassive black hole feedback-driven outflows.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}