{"id":"2407.13322","title":"Fully Test-Time rPPG Estimation via Synthetic Signal-Guided Feature\n  Learning","authors":"Pei-Kai Huang, Tzu-Hsien Chen, Ya-Ting Chan, Kuan-Wen Chen, Chiou-Ting\n  Hsu","authorsParsed":[["Huang","Pei-Kai",""],["Chen","Tzu-Hsien",""],["Chan","Ya-Ting",""],["Chen","Kuan-Wen",""],["Hsu","Chiou-Ting",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 09:22:40 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 05:47:36 GMT"},{"version":"v3","created":"Thu, 15 Aug 2024 14:27:51 GMT"}],"updateDate":"2024-08-16","timestamp":1721294560000,"abstract":"  Many remote photoplethysmography (rPPG) estimation models have achieved\npromising performance in the training domain but often fail to accurately\nestimate physiological signals or heart rates (HR) in the target domains.\nDomain generalization (DG) or domain adaptation (DA) techniques are therefore\nadopted during the offline training stage to adapt the model to either\nunobserved or observed target domains by utilizing all available source domain\ndata. However, in rPPG estimation problems, the adapted model usually\nencounters challenges in estimating target data with significant domain\nvariation. In contrast, Test-Time Adaptation (TTA) enables the model to\nadaptively estimate rPPG signals in various unseen domains by online adapting\nto unlabeled target data without referring to any source data. In this paper,\nwe first establish a new TTA-rPPG benchmark that encompasses various domain\ninformation and HR distributions to simulate the challenges encountered in\nreal-world rPPG estimation. Next, we propose a novel synthetic signal-guided\nrPPG estimation framework to address the forgetting issue during the TTA stage\nand to enhance the adaptation capability of the pre-trained rPPG model. To this\nend, we develop a synthetic signal-guided feature learning method by\nsynthesizing pseudo rPPG signals as pseudo ground truths to guide a conditional\ngenerator in generating latent rPPG features. In addition, we design an\neffective spectral-based entropy minimization technique to encourage the rPPG\nmodel to learn new target domain information. Both the generated rPPG features\nand synthesized rPPG signals prevent the rPPG model from overfitting to target\ndata and forgetting previously acquired knowledge, while also broadly covering\nvarious heart rate (HR) distributions. Our extensive experiments on the\nTTA-rPPG benchmark show that the proposed method achieves superior performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}