{"id":"2407.13059","title":"Prioritizing High-Consequence Biological Capabilities in Evaluations of\n  Artificial Intelligence Models","authors":"Jaspreet Pannu, Doni Bloomfield, Alex Zhu, Robert MacKnight, Gabe\n  Gomes, Anita Cicero, Thomas V. Inglesby","authorsParsed":[["Pannu","Jaspreet",""],["Bloomfield","Doni",""],["Zhu","Alex",""],["MacKnight","Robert",""],["Gomes","Gabe",""],["Cicero","Anita",""],["Inglesby","Thomas V.",""]],"versions":[{"version":"v1","created":"Sat, 25 May 2024 16:29:17 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 01:08:25 GMT"}],"updateDate":"2024-07-24","timestamp":1716654557000,"abstract":"  As a result of rapidly accelerating AI capabilities, over the past year,\nnational governments and multinational bodies have announced efforts to address\nsafety, security and ethics issues related to AI models. One high priority\namong these efforts is the mitigation of misuse of AI models. Many biologists\nhave for decades sought to reduce the risks of scientific research that could\nlead, through accident or misuse, to high-consequence disease outbreaks.\nScientists have carefully considered what types of life sciences research have\nthe potential for both benefit and risk (dual-use), especially as scientific\nadvances have accelerated our ability to engineer organisms and create novel\nvariants of pathogens. Here we describe how previous experience and study by\nscientists and policy professionals of dual-use capabilities in the life\nsciences can inform risk evaluations of AI models with biological capabilities.\nWe argue that AI model evaluations should prioritize addressing\nhigh-consequence risks (those that could cause large-scale harm to the public,\nsuch as pandemics), and that these risks should be evaluated prior to model\ndeployment so as to allow potential biosafety and/or biosecurity measures.\nScientists' experience with identifying and mitigating dual-use biological\nrisks can help inform new approaches to evaluating biological AI models.\nIdentifying which AI capabilities post the greatest biosecurity and biosafety\nconcerns is necessary in order to establish targeted AI safety evaluation\nmethods, secure these tools against accident and misuse, and avoid impeding\nimmense potential benefits.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}