{"id":"2407.19135","title":"Bayesian Mapping of Mortality Clusters","authors":"Andrea Sottosanti, Pietro Belloni, Enrico Bovo, Giovanna Boccuzzo","authorsParsed":[["Sottosanti","Andrea",""],["Belloni","Pietro",""],["Bovo","Enrico",""],["Boccuzzo","Giovanna",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 00:51:03 GMT"}],"updateDate":"2024-07-30","timestamp":1722041463000,"abstract":"  Disease mapping analyses the distribution of several diseases within a\nterritory. Primary goals include identifying areas with unexpected changes in\nmortality rates, studying the relation among multiple diseases, and dividing\nthe analysed territory into clusters based on the observed levels of disease\nincidence or mortality. In this work, we focus on detecting spatial mortality\nclusters, that occur when neighbouring areas within a territory exhibit similar\nmortality levels due to one or more diseases. When multiple death causes are\nexamined together, it is relevant to identify both the spatial boundaries of\nthe clusters and the diseases that lead to their formation. However, existing\nmethods in literature struggle to address this dual problem effectively and\nsimultaneously. To overcome these limitations, we introduce Perla, a\nmultivariate Bayesian model that clusters areas in a territory according to the\nobserved mortality rates of multiple death causes, also exploiting the\ninformation of external covariates. Our model incorporates the spatial data\nstructure directly into the clustering probabilities by leveraging the\nstick-breaking formulation of the multinomial distribution. Additionally, it\nexploits suitable global-local shrinkage priors to ensure that the detection of\nclusters is driven by concrete differences across mortality levels while\nexcluding spurious differences. We propose an MCMC algorithm for posterior\ninference that consists of closed-form Gibbs sampling moves for nearly every\nmodel parameter, without requiring complex tuning operations. This work is\nprimarily motivated by a case study on the territory of the local unit ULSS6\nEuganea within the Italian public healthcare system. To demonstrate the\nflexibility and effectiveness of our methodology, we also validate Perla with a\nseries of simulation experiments and an extensive case study on mortality\nlevels in U.S. counties.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"8Da-eUdbE-H-V3SAMXFdoqXyn559Mw7lX5atR1L-eS0","pdfSize":"3535196"}
