{"id":"2407.16422","title":"A new problem qualification based on approximate KKT conditions for\n  Lipschitzian optimization with application to bilevel programming","authors":"Isabella K\\\"aming, Andreas Fischer, Alain B. Zemkoho","authorsParsed":[["Käming","Isabella",""],["Fischer","Andreas",""],["Zemkoho","Alain B.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 12:12:43 GMT"}],"updateDate":"2024-07-24","timestamp":1721736763000,"abstract":"  When dealing with general Lipschitzian optimization problems, there are many\nproblem classes where standard constraint qualifications fail at local\nminimizers. In contrast to a constraint qualification, a problem qualification\ndoes not only rely on the constraints but also on the objective function to\nguarantee that a local minimizer is a Karush-Kuhn-Tucker (KKT) point. For\nexample, calmness in the sense of Clarke is a problem qualification. In this\narticle, we introduce the Subset Mangasarian-Fromovitz Condition (subMFC). This\nnew problem qualification is based on a nonsmooth version of the approximate\nKKT conditions, which hold at every local minimizer without further\nassumptions. A comparison with existing constraint qualifications and problem\nqualifications for the given problem class reveals that subMFC is strictly\nweaker than quasinormality and can hold even if the local error bound\ncondition, the cone-continuity property, Guignard's constraint qualification\nand calmness in the sense of Clarke are violated. Further, we emphasize the\npower of the new problem qualification within the context of bilevel\noptimization. More precisely, under mild assumptions on the problem data, we\nsuggest a version of subMFC that is tailored to the lower-level value function\nreformulation. It turns out that this new condition can be satisfied even if\nthe widely used partial calmness condition does not hold.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"HOgCfMtQtO0IpNj6fnR6ounJObZvajOyzWFZlgtIPqo","pdfSize":"359202"}
