{"id":"2407.14749","title":"Adaptive-Frequency Model Learning and Predictive Control for Dynamic\n  Maneuvers on Legged Robots","authors":"Chuong Nguyen, Abdullah Altawaitan, Thai Duong, Nikolay Atanasov, and\n  Quan Nguyen","authorsParsed":[["Nguyen","Chuong",""],["Altawaitan","Abdullah",""],["Duong","Thai",""],["Atanasov","Nikolay",""],["Nguyen","Quan",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 05:03:55 GMT"}],"updateDate":"2024-07-23","timestamp":1721451835000,"abstract":"  Achieving both target accuracy and robustness in dynamic maneuvers with long\nflight phases, such as high or long jumps, has been a significant challenge for\nlegged robots. To address this challenge, we propose a novel learning-based\ncontrol approach consisting of model learning and model predictive control\n(MPC) utilizing an adaptive frequency scheme. Compared to existing MPC\ntechniques, we learn a model directly from experiments, accounting not only for\nleg dynamics but also for modeling errors and unknown dynamics mismatch in\nhardware and during contact. Additionally, learning the model with adaptive\nfrequency allows us to cover the entire flight phase and final jumping target,\nenhancing the prediction accuracy of the jumping trajectory. Using the learned\nmodel, we also design an adaptive-frequency MPC to effectively leverage\ndifferent jumping phases and track the target accurately. In hardware\nexperiments with a Unitree A1 robot, we demonstrate that our approach\noutperforms baseline MPC using a nominal model, reducing the jumping distance\nerror up to 8 times. We achieve jumping distance errors of less than 3 percent\nduring continuous jumping on uneven terrain with randomly-placed perturbations\nof random heights (up to 4 cm or 27 percent of the robot's standing height).\nOur approach obtains distance errors of 1-2 cm on 34 single and continuous\njumps with different jumping targets and model uncertainties.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}