{"id":"2407.02000","title":"Sub-millisecond electric field sensing with an individual rare-earth\n  doped ferroelectric nanocrystal","authors":"Athulya Muraleedharan, Jingye Zou, Maxime Vallet, Abdelali Zaki,\n  Christine Bogicevic, Charles Paillard, Karen Perronet and Fran\\c{c}ois\n  Treussart","authorsParsed":[["Muraleedharan","Athulya",""],["Zou","Jingye",""],["Vallet","Maxime",""],["Zaki","Abdelali",""],["Bogicevic","Christine",""],["Paillard","Charles",""],["Perronet","Karen",""],["Treussart","François",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 07:15:40 GMT"}],"updateDate":"2024-07-03","timestamp":1719904540000,"abstract":"  Understanding the dynamics of electrical signals within neuronal assemblies\nis crucial to unraveling complex brain function. Despite recent advances in\nemploying optically active nanostructures in transmembrane potential sensing,\nthere remains room for improvement in terms of response time and sensitivity.\nHere, we report the development of such a nanosensor capable of detecting\nelectric fields with a submillisecond response time at the single particle\nlevel. We achieve this by using ferroelectric nanocrystals doped with rare\nearth ions producing upconversion (UC). When such a nanocrystal experiences a\nvariation of surrounding electric potential, its surface charge density\nchanges, inducing electric polarization modifications that vary, via converse\npiezoelectric effect, the crystal field around the ions. The latter variation\nis finally converted into UC spectral changes, enabling optical detection of\nelectric potential. To develop such a sensor, we synthesized erbium and\nytterbium-doped barium titanate crystals of size $\\approx160$ nm. We observed\ndistinct changes in the UC spectrum when individual nanocrystals were subjected\nto an external field via a conductive AFM tip, with a response time of 100\n$\\mu$s. Furthermore, our sensor exhibits a sensitivity to electric fields of\nonly 4.8 kV/cm/$\\sqrt{\\rm Hz}$, making possible the time-resolved detection of\na neuron action potential.\n","subjects":["Physics/Optics","Condensed Matter/Other Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZVwxtw0K2kF2TISGaKZEDLJ3jRFhCdUrhDMnyVn0GTI","pdfSize":"5127730"}
