{"id":"2407.08113","title":"FYI: Flip Your Images for Dataset Distillation","authors":"Byunggwan Son, Youngmin Oh, Donghyeon Baek, Bumsub Ham","authorsParsed":[["Son","Byunggwan",""],["Oh","Youngmin",""],["Baek","Donghyeon",""],["Ham","Bumsub",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 01:08:41 GMT"}],"updateDate":"2024-07-12","timestamp":1720660121000,"abstract":"  Dataset distillation synthesizes a small set of images from a large-scale\nreal dataset such that synthetic and real images share similar behavioral\nproperties (e.g, distributions of gradients or features) during a training\nprocess. Through extensive analyses on current methods and real datasets,\ntogether with empirical observations, we provide in this paper two important\nthings to share for dataset distillation. First, object parts that appear on\none side of a real image are highly likely to appear on the opposite side of\nanother image within a dataset, which we call the bilateral equivalence.\nSecond, the bilateral equivalence enforces synthetic images to duplicate\ndiscriminative parts of objects on both the left and right sides of the images,\nlimiting the recognition of subtle differences between objects. To address this\nproblem, we introduce a surprisingly simple yet effective technique for dataset\ndistillation, dubbed FYI, that enables distilling rich semantics of real images\ninto synthetic ones. To this end, FYI embeds a horizontal flipping technique\ninto distillation processes, mitigating the influence of the bilateral\nequivalence, while capturing more details of objects. Experiments on\nCIFAR-10/100, Tiny-ImageNet, and ImageNet demonstrate that FYI can be\nseamlessly integrated into several state-of-the-art methods, without modifying\ntraining objectives and network architectures, and it improves the performance\nremarkably.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}