{"id":"2407.20643","title":"Generalizing AI-driven Assessment of Immunohistochemistry across\n  Immunostains and Cancer Types: A Universal Immunohistochemistry Analyzer","authors":"Biagio Brattoli, Mohammad Mostafavi, Taebum Lee, Wonkyung Jung,\n  Jeongun Ryu, Seonwook Park, Jongchan Park, Sergio Pereira, Seunghwan Shin,\n  Sangjoon Choi, Hyojin Kim, Donggeun Yoo, Siraj M. Ali, Kyunghyun Paeng,\n  Chan-Young Ock, Soo Ick Cho, and Seokhwi Kim","authorsParsed":[["Brattoli","Biagio",""],["Mostafavi","Mohammad",""],["Lee","Taebum",""],["Jung","Wonkyung",""],["Ryu","Jeongun",""],["Park","Seonwook",""],["Park","Jongchan",""],["Pereira","Sergio",""],["Shin","Seunghwan",""],["Choi","Sangjoon",""],["Kim","Hyojin",""],["Yoo","Donggeun",""],["Ali","Siraj M.",""],["Paeng","Kyunghyun",""],["Ock","Chan-Young",""],["Cho","Soo Ick",""],["Kim","Seokhwi",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 08:39:30 GMT"}],"updateDate":"2024-07-31","timestamp":1722328770000,"abstract":"  Despite advancements in methodologies, immunohistochemistry (IHC) remains the\nmost utilized ancillary test for histopathologic and companion diagnostics in\ntargeted therapies. However, objective IHC assessment poses challenges.\nArtificial intelligence (AI) has emerged as a potential solution, yet its\ndevelopment requires extensive training for each cancer and IHC type, limiting\nversatility. We developed a Universal IHC (UIHC) analyzer, an AI model for\ninterpreting IHC images regardless of tumor or IHC types, using training\ndatasets from various cancers stained for PD-L1 and/or HER2. This multi-cohort\ntrained model outperforms conventional single-cohort models in interpreting\nunseen IHCs (Kappa score 0.578 vs. up to 0.509) and consistently shows superior\nperformance across different positive staining cutoff values. Qualitative\nanalysis reveals that UIHC effectively clusters patches based on expression\nlevels. The UIHC model also quantitatively assesses c-MET expression with MET\nmutations, representing a significant advancement in AI application in the era\nof personalized medicine and accumulating novel biomarkers.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}