{"id":"2407.03372","title":"Physics-informed Neural Networks for Heterogeneous Poroelastic Media","authors":"Sumanta Roy, Chandrasekhar Annavarapu, Pratanu Roy, Dakshina Murthy\n  Valiveti","authorsParsed":[["Roy","Sumanta",""],["Annavarapu","Chandrasekhar",""],["Roy","Pratanu",""],["Valiveti","Dakshina Murthy",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 06:15:11 GMT"},{"version":"v2","created":"Tue, 9 Jul 2024 08:52:01 GMT"},{"version":"v3","created":"Mon, 2 Sep 2024 19:02:32 GMT"}],"updateDate":"2024-09-04","timestamp":1719814511000,"abstract":"  This study presents a novel physics-informed neural network (PINN) framework\nfor modeling poroelasticity in heterogeneous media with material interfaces.\nThe approach introduces a composite neural network (CoNN) where separate neural\nnetworks predict displacement and pressure variables for each material. While\nsharing identical activation functions, these networks are independently\ntrained for all other parameters. To address challenges posed by heterogeneous\nmaterial interfaces, the CoNN is integrated with the Interface-PINNs or I-PINNs\nframework (Sarma et al. 2024, https://dx.doi.org/10.1016/j.cma.2024.117135),\nallowing different activation functions across material interfaces. This\nensures accurate approximation of discontinuous solution fields and gradients.\nPerformance and accuracy of this combined architecture were evaluated against\nthe conventional PINNs approach, a single neural network (SNN) architecture,\nand the eXtended PINNs (XPINNs) framework through two one-dimensional benchmark\nexamples with discontinuous material properties. The results show that the\nproposed CoNN with I-PINNs architecture achieves an RMSE that is two orders of\nmagnitude better than the conventional PINNs approach and is at least 40 times\nfaster than the SNN framework. Compared to XPINNs, the proposed method achieves\nan RMSE at least one order of magnitude better and is 40% faster.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}