{"id":"2407.14481","title":"Observation of paramagnetic spin-degeneracy lifting in EuZn2Sb2","authors":"Milo X. Sprague, Sabin Regmi, Barun Ghosh, Anup Pradhan Sakhya,\n  Mazharul Islam Mondal, Iftakhar Bin Elius, Nathan Valadez, Bahadur Singh,\n  Tetiana Romanova, Dariusz Kaczorowski, Arun Bansil, Madhab Neupane","authorsParsed":[["Sprague","Milo X.",""],["Regmi","Sabin",""],["Ghosh","Barun",""],["Sakhya","Anup Pradhan",""],["Mondal","Mazharul Islam",""],["Elius","Iftakhar Bin",""],["Valadez","Nathan",""],["Singh","Bahadur",""],["Romanova","Tetiana",""],["Kaczorowski","Dariusz",""],["Bansil","Arun",""],["Neupane","Madhab",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 17:34:29 GMT"}],"updateDate":"2024-07-22","timestamp":1721410469000,"abstract":"  Taken together, time-reversal and spatial inversion symmetries impose a\ntwo-fold spin degeneracy of the electronic states in crystals. In\ncentrosymmetric materials, this degeneracy can be lifted by introducing\nmagnetism, either via an externally applied field or through internal\nmagnetization. However, a correlated alignment of spins, even in the\nparamagnetic phase, can lift the spin degeneracy of electronic states. Here, we\nreport an in-depth study of the electronic band structure of the Eu-ternary\npnictide EuZn2Sb2 through a combination of high-resolution angle-resolved\nphotoemission spectroscopy measurements and first principles calculations. An\nanalysis of the photoemission lineshapes over a range of incident photon\nenergies and sample temperatures is shown to reveal the presence of band spin\ndegeneracy-lifting in the paramagnetic phase. Our ARPES results are in good\nagreement with theoretical ferromagnetic-phase calculations, which indicates\nthe importance of ferromagnetic fluctuations in the system. Through our\ncalculations, we predict that spin-polarized bands in EuZn2Sb2 generate a\nsingle pair of Weyl nodes. Our observation of band-splitting in EuZn2Sb2\nprovides a key step toward realizing time-reversal symmetry breaking physics in\nthe absence of long-range magnetic order.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XzNd7sHMoC5A72kXTZlvmjVqh-nMmsd47SLXANe09Vw","pdfSize":"4977829"}
