{"id":"2407.19696","title":"Cross-Layer Feature Pyramid Transformer for Small Object Detection in\n  Aerial Images","authors":"Zewen Du, Zhenjiang Hu, Guiyu Zhao, Ying Jin, and Hongbin Ma","authorsParsed":[["Du","Zewen",""],["Hu","Zhenjiang",""],["Zhao","Guiyu",""],["Jin","Ying",""],["Ma","Hongbin",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 04:40:18 GMT"}],"updateDate":"2024-07-30","timestamp":1722228018000,"abstract":"  Object detection in aerial images has always been a challenging task due to\nthe generally small size of the objects. Most current detectors prioritize\nnovel detection frameworks, often overlooking research on fundamental\ncomponents such as feature pyramid networks. In this paper, we introduce the\nCross-Layer Feature Pyramid Transformer (CFPT), a novel upsampler-free feature\npyramid network designed specifically for small object detection in aerial\nimages. CFPT incorporates two meticulously designed attention blocks with\nlinear computational complexity: the Cross-Layer Channel-Wise Attention (CCA)\nand the Cross-Layer Spatial-Wise Attention (CSA). CCA achieves cross-layer\ninteraction by dividing channel-wise token groups to perceive cross-layer\nglobal information along the spatial dimension, while CSA completes cross-layer\ninteraction by dividing spatial-wise token groups to perceive cross-layer\nglobal information along the channel dimension. By integrating these modules,\nCFPT enables cross-layer interaction in one step, thereby avoiding the semantic\ngap and information loss associated with element-wise summation and\nlayer-by-layer transmission. Furthermore, CFPT incorporates global contextual\ninformation, which enhances detection performance for small objects. To further\nenhance location awareness during cross-layer interaction, we propose the\nCross-Layer Consistent Relative Positional Encoding (CCPE) based on inter-layer\nmutual receptive fields. We evaluate the effectiveness of CFPT on two\nchallenging object detection datasets in aerial images, namely VisDrone2019-DET\nand TinyPerson. Extensive experiments demonstrate the effectiveness of CFPT,\nwhich outperforms state-of-the-art feature pyramid networks while incurring\nlower computational costs. The code will be released at\nhttps://github.com/duzw9311/CFPT.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}