{"id":"2407.04661","title":"MIRI MRS Observations of Beta Pictoris II. The Spectroscopic Case for a\n  Recent Giant Collision","authors":"Christine H. Chen, Cicero X. Lu, Kadin Worthen, David R. Law, B. A.\n  Sargent, Amaya Moro-Martin, G. C. Sloan, Carey M. Lisse, Dan M. Watson,\n  Julien H. Girard, Yiwei Chai, Dean C. Hines, Jens Kammerer, Alexis Li,\n  Marshall Perrin, Laurent Pueyo, Isabel Rebollido, Karl R. Stapelfeldt,\n  Christopher Stark, and Michael W. Werner","authorsParsed":[["Chen","Christine H.",""],["Lu","Cicero X.",""],["Worthen","Kadin",""],["Law","David R.",""],["Sargent","B. A.",""],["Moro-Martin","Amaya",""],["Sloan","G. C.",""],["Lisse","Carey M.",""],["Watson","Dan M.",""],["Girard","Julien H.",""],["Chai","Yiwei",""],["Hines","Dean C.",""],["Kammerer","Jens",""],["Li","Alexis",""],["Perrin","Marshall",""],["Pueyo","Laurent",""],["Rebollido","Isabel",""],["Stapelfeldt","Karl R.",""],["Stark","Christopher",""],["Werner","Michael W.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 17:18:21 GMT"}],"updateDate":"2024-07-08","timestamp":1720199901000,"abstract":"  Modeling observations of the archetypal debris disk around $\\beta$ Pic,\nobtained in 2023 January with the MIRI MRS on board JWST, reveals significant\ndifferences compared with that obtained with the IRS on board Spitzer. The\nbright 5 - 15 $\\mu$m continuum excess modeled using a $\\sim$600 K black body\nhas disappeared. The previously prominent 18 and 23 $\\mu$m crystalline\nforsterite emission features, arising from cold dust ($\\sim$100 K) in the\nRayleigh limit, have disappeared and been replaced by very weak features\narising from the hotter 500 K dust population. Finally, the shape of the 10\n$\\mu$m silicate feature has changed, consistent with a shift in the temperature\nof the warm dust population from $\\sim$300 K to $\\sim$500 K and an increase in\nthe crystalline fraction of the warm, silicate dust. Stellar radiation pressure\nmay have blown both the hot and the cold crystalline dust particles observed in\nthe Spitzer spectra out of the planetary system during the intervening 20 years\nbetween the Spitzer and JWST observations. These results indicate that the\n$\\beta$ Pic system has a dynamic circumstellar environment, and that periods of\nenhanced collisions can create large clouds of dust that sweep through the\nplanetary system.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}