{"id":"2407.08020","title":"Interactive Segmentation Model for Placenta Segmentation from 3D\n  Ultrasound images","authors":"Hao Li, Baris Oguz, Gabriel Arenas, Xing Yao, Jiacheng Wang, Alison\n  Pouch, Brett Byram, Nadav Schwartz, Ipek Oguz","authorsParsed":[["Li","Hao",""],["Oguz","Baris",""],["Arenas","Gabriel",""],["Yao","Xing",""],["Wang","Jiacheng",""],["Pouch","Alison",""],["Byram","Brett",""],["Schwartz","Nadav",""],["Oguz","Ipek",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 19:58:26 GMT"}],"updateDate":"2024-07-12","timestamp":1720641506000,"abstract":"  Placenta volume measurement from 3D ultrasound images is critical for\npredicting pregnancy outcomes, and manual annotation is the gold standard.\nHowever, such manual annotation is expensive and time-consuming. Automated\nsegmentation algorithms can often successfully segment the placenta, but these\nmethods may not consistently produce robust segmentations suitable for\npractical use. Recently, inspired by the Segment Anything Model (SAM), deep\nlearning-based interactive segmentation models have been widely applied in the\nmedical imaging domain. These models produce a segmentation from visual prompts\nprovided to indicate the target region, which may offer a feasible solution for\npractical use. However, none of these models are specifically designed for\ninteractively segmenting 3D ultrasound images, which remain challenging due to\nthe inherent noise of this modality. In this paper, we evaluate publicly\navailable state-of-the-art 3D interactive segmentation models in contrast to a\nhuman-in-the-loop approach for the placenta segmentation task. The Dice score,\nnormalized surface Dice, averaged symmetric surface distance, and 95-percent\nHausdorff distance are used as evaluation metrics. We consider a Dice score of\n0.95 a successful segmentation. Our results indicate that the human-in-the-loop\nsegmentation model reaches this standard. Moreover, we assess the efficiency of\nthe human-in-the-loop model as a function of the amount of prompts. Our results\ndemonstrate that the human-in-the-loop model is both effective and efficient\nfor interactive placenta segmentation. The code is available at\n\\url{https://github.com/MedICL-VU/PRISM-placenta}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mmzkfb_Xm22pxMdkjqz-h4iVBWzj19iU7bGhIgFqJsw","pdfSize":"2084166"}
