{"id":"2407.06425","title":"Precision frequency tuning of tunable transmon qubits using\n  alternating-bias assisted annealing","authors":"Xiqiao Wang, Joel Howard, Eyob A. Sete, Greg Stiehl, Cameron Kopas,\n  Stefano Poletto, Xian Wu, Mark Field, Nicholas Sharac, Christopher Eckberg,\n  Hilal Cansizoglu, Raja Katta, Josh Mutus, Andrew Bestwick, Kameshwar\n  Yadavalli, and David P. Pappas","authorsParsed":[["Wang","Xiqiao",""],["Howard","Joel",""],["Sete","Eyob A.",""],["Stiehl","Greg",""],["Kopas","Cameron",""],["Poletto","Stefano",""],["Wu","Xian",""],["Field","Mark",""],["Sharac","Nicholas",""],["Eckberg","Christopher",""],["Cansizoglu","Hilal",""],["Katta","Raja",""],["Mutus","Josh",""],["Bestwick","Andrew",""],["Yadavalli","Kameshwar",""],["Pappas","David P.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 22:14:05 GMT"}],"updateDate":"2024-07-10","timestamp":1720476845000,"abstract":"  Superconducting quantum processors are one of the leading platforms for\nrealizing scalable fault-tolerant quantum computation (FTQC). The recent\ndemonstration of post-fabrication tuning of Josephson junctions using\nalternating-bias assisted annealing (ABAA) technique and a reduction in\njunction loss after ABAA illuminates a promising path towards precision tuning\nof qubit frequency while maintaining high coherence. Here, we demonstrate\nprecision tuning of the maximum $|0\\rangle\\rightarrow |1\\rangle$ transition\nfrequency ($f_{01}^{\\rm max}$) of tunable transmon qubits by performing ABAA at\nroom temperature using commercially available test equipment. We characterize\nthe impact of junction relaxation and aging on resistance spread after tuning,\nand demonstrate a frequency equivalent tuning precision of 7.7 MHz ($0.17\\%$)\nbased on targeted resistance tuning on hundreds of qubits, with a resistance\ntuning range up to $18.5\\%$. Cryogenic measurements on tuned and untuned qubits\nshow evidence of improved coherence after ABAA with no significant impact on\ntunability. Despite a small global offset, we show an empirical $f_{01}^{\\rm\nmax}$ tuning precision of 18.4 MHz by tuning a set of multi-qubit processors\ntargeting their designed Hamiltonians. We experimentally characterize\nhigh-fidelity parametric resonance iSWAP gates on two ABAA-tuned 9-qubit\nprocessors with fidelity as high as $99.51\\pm 0.20\\%$. On the best-performing\ndevice, we measured across the device a median fidelity of $99.22\\%$ and an\naverage fidelity of $99.13\\pm 0.12 \\%$. Yield modeling analysis predicts high\ndetuning-edge-yield using ABAA beyond the 1000-qubit scale. These results\ndemonstrate the cutting-edge capability of frequency targeting using ABAA and\nopen up a new avenue to systematically improving Hamiltonian targeting and\noptimization for scaling high-performance superconducting quantum processors.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Condensed Matter/Superconductivity","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}