{"id":"2407.03845","title":"Noise analysis of a quasi-phase-matched quantum frequency converter and\n  higher-order counter-propagating SPDC","authors":"Felix Mann, Helen M. Chrzanowski, Felipe Gewers, Marlon Placke and\n  Sven Ramelow","authorsParsed":[["Mann","Felix",""],["Chrzanowski","Helen M.",""],["Gewers","Felipe",""],["Placke","Marlon",""],["Ramelow","Sven",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 11:27:57 GMT"}],"updateDate":"2024-07-08","timestamp":1720092477000,"abstract":"  Quantum frequency conversion (QFC) will be an indispensable ingredient in\nfuture quantum technologies. For example, large-scale fibre-based quantum\nnetworks will require QFC to interconnect heterogeneous building blocks like\nemitters, channels, memories and detectors. The performance of existing QFC\ndevices - typically realised in periodically-poled nonlinear crystals - is\noften severely limited by parasitic noise that arises when the pump wavelength\nlies between the wavelengths which are inter-converted. Here we investigate the\nnoise spectrum of a frequency converter pumped by a CW 1064 nm laser. The\nconverter was realised as a monolithic bulk pump enhancement cavity made from a\nperiodically-poled potassium titanyl phosphate (ppKTP) crystal -\nquasi-phase-matched for the conversion of 637 nm to 1587 nm. In the range from\n1140 nm to 1330 nm (up to 60 THz from the pump) Stokes-Raman resonances can be\nidentified as the dominant noise source while the noise in the range from 1330\nnm to 1650 nm can be attributed mainly to parasitic spontaneous parametric\ndown-conversion (SPDC). Further, a succession of narrow-band peaks is observed\nin the spectrum originating from higher-order counter-propagating SPDC. Both\ntypes of counter-propagation, where either the lower-energy idler photon or the\nhigher-energy signal photon counter-propagate relative to the pump beam, are\nobserved, with narrow-band peaks corresponding to 10th to 44th order\nquasi-phase-matching.\n","subjects":["Physics/Quantum Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/"}