{"id":"2407.14230","title":"ETSCL: An Evidence Theory-Based Supervised Contrastive Learning\n  Framework for Multi-modal Glaucoma Grading","authors":"Zhiyuan Yang, Bo Zhang, Yufei Shi, Ningze Zhong, Johnathan Loh, Huihui\n  Fang, Yanwu Xu and Si Yong Yeo","authorsParsed":[["Yang","Zhiyuan",""],["Zhang","Bo",""],["Shi","Yufei",""],["Zhong","Ningze",""],["Loh","Johnathan",""],["Fang","Huihui",""],["Xu","Yanwu",""],["Yeo","Si Yong",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 11:57:56 GMT"}],"updateDate":"2024-07-22","timestamp":1721390276000,"abstract":"  Glaucoma is one of the leading causes of vision impairment. Digital imaging\ntechniques, such as color fundus photography (CFP) and optical coherence\ntomography (OCT), provide quantitative and noninvasive methods for glaucoma\ndiagnosis. Recently, in the field of computer-aided glaucoma diagnosis,\nmulti-modality methods that integrate the CFP and OCT modalities have achieved\ngreater diagnostic accuracy compared to single-modality methods. However, it\nremains challenging to extract reliable features due to the high similarity of\nmedical images and the unbalanced multi-modal data distribution. Moreover,\nexisting methods overlook the uncertainty estimation of different modalities,\nleading to unreliable predictions. To address these challenges, we propose a\nnovel framework, namely ETSCL, which consists of a contrastive feature\nextraction stage and a decision-level fusion stage. Specifically, the\nsupervised contrastive loss is employed to enhance the discriminative power in\nthe feature extraction process, resulting in more effective features. In\naddition, we utilize the Frangi vesselness algorithm as a preprocessing step to\nincorporate vessel information to assist in the prediction. In the\ndecision-level fusion stage, an evidence theory-based multi-modality classifier\nis employed to combine multi-source information with uncertainty estimation.\nExtensive experiments demonstrate that our method achieves state-of-the-art\nperformance. The code is available at\n\\url{https://github.com/master-Shix/ETSCL}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}