{"id":"2407.19635","title":"The Class 0 protostars in Orion: Characterizing the properties of their\n  magnetized envelopes","authors":"B. Huang, J. M. Girart, I. W. Stephens, M. Fernandez-Lopez, J. J.\n  Tobin, P. Cortes, N. M. Murillo, P. C. Myers, S. Sadavoy, Q. Zhang, H. G.\n  Arce, J. M. Carpenter, W. Kwon, V. J. M. Le Gouellec, Z.-Y. Li, L. W. Looney,\n  T. Megeath, E. G. Cox, N. Karnath, D. Segura-Cox","authorsParsed":[["Huang","B.",""],["Girart","J. M.",""],["Stephens","I. W.",""],["Fernandez-Lopez","M.",""],["Tobin","J. J.",""],["Cortes","P.",""],["Murillo","N. M.",""],["Myers","P. C.",""],["Sadavoy","S.",""],["Zhang","Q.",""],["Arce","H. G.",""],["Carpenter","J. M.",""],["Kwon","W.",""],["Gouellec","V. J. M. Le",""],["Li","Z. -Y.",""],["Looney","L. W.",""],["Megeath","T.",""],["Cox","E. G.",""],["Karnath","N.",""],["Segura-Cox","D.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 01:35:32 GMT"}],"updateDate":"2024-07-30","timestamp":1722216932000,"abstract":"  We present a study connecting the physical properties of protostellar\nenvelopes to the morphology of the envelope-scale magnetic field. We use the\nALMA polarization observations of 55 young prtostars at 0.87 mm on\n$\\sim400-3000$ au scales from the {\\em B}-field Orion Protostellar Survey\n(BOPS) to infer the envelope-scale magnetic field and both dust and gas\nemission on comparable scales to measure the envelope properties. We find that\nthe protostellar envelopes with compact polarized dust emission tend to have\nlower envelope masses, than the sources with more extended envelopes. We also\nfind that protostars showing hourglass-field morphologies tend to have lower\nvelocity dispersions in their envelopes, whereas systems with spiral-field\nmorphologies have higher velocity dispersion. Combining with the disk\nproperties taken from the Orion VLA/ALMA Nascent Disk and Multiplicity (VANDAM)\nsurvey, we connect envelope properties to fragmentation. Our results suggest\nthat envelope mass may not correlate with fragmentation, whereas turbulence\nappears to promote fragmentation. On the other hand, we find that fragmentation\nis suppressed in systems with pinched magnetic fields, suggesting that the\nmagnetic field play a role on providing additional support against\ngravitational collapse, and the formation of an hourglass-like field may\ncoincide with enhanced magnetic braking that removes angular momentum and\nhinders the formation of embedded disks. Nevertheless, significant misalignment\nbetween magnetic field and outflow axes tends to reduce magnetic braking,\nleading to the formation of larger disks.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}