{"id":"2407.14930","title":"Athermal package for OH suppression filters in astronomy part 1: design","authors":"Carlos Enrique Rordriguez Alvarez, Aashia Rahman, Hakan \\\"Onel, Frank\n  Dionies, Jens Paschke, Svend-Marian Bauer","authorsParsed":[["Alvarez","Carlos Enrique Rordriguez",""],["Rahman","Aashia",""],["Önel","Hakan",""],["Dionies","Frank",""],["Paschke","Jens",""],["Bauer","Svend-Marian",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 16:34:17 GMT"}],"updateDate":"2024-09-12","timestamp":1721493257000,"abstract":"  We present the design of an athermal package for fiber Bragg grating\n(FBG)filters fabricated at our Institute for use in ground-based near-infrared\n(NIR) telescopes. Aperiodic multichannel FBG filters combined with photonic\nlanterns can effectively filter out extremely bright atmospheric hydroxyl (OH)\nemission lines that severely hinder ground-based NIR observations. While FBGs\nhave the capability of filtering specific wavelengths with high precision, due\nto their sensitivity to temperature variations, the success in their\nperformance as OH suppression filters depends on a suitable athermal package\nthat can maintain the deviations of the FBG wavelengths from that of the OH\nemission lines within sub-picometer accuracy over a temperature range of about\n40 K. (i.e. 263 K to 303 K). We aim to develop an athermal package over the\naforementioned temperature range for an optical fiber consisting of\nmultichannel FBGs for a maximum filter length of 110 mm. In this work, we\ndemonstrate the complete design methodology of such a package. First, we\ndeveloped a custom-built test rig to study a wide range of critical physical\nproperties of the fiber, such as strain and temperature sensitivities, elastic\nmodulus, optimum fiber pre-tension, and adhesion performance.Next, we used\nthese data to confirm the athermal response of an FBG bonded on the test rig\nfrom room temperature to 313 K. Based on this study, we developed a\ncomputer-aided design (CAD) model of the package and analyzed its athermal\ncharacteristics with a suitable selection of materials and their nominal\ndimensions using finite element analysis (FEA). We finally discuss the novel\naspects of the design to achieve high-precision thermal stabilization of these\nfilters in the temperature range of interest.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}