{"id":"2407.00560","title":"DCI: An Accurate Quality Assessment Criteria for Protein Complex\n  Structure Models","authors":"Wenda Wang, Jiaqi Zhai, He Huang, Xinqi Gong","authorsParsed":[["Wang","Wenda",""],["Zhai","Jiaqi",""],["Huang","He",""],["Gong","Xinqi",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 02:02:04 GMT"}],"updateDate":"2024-07-02","timestamp":1719712924000,"abstract":"  The structure of proteins is the basis for studying protein function and drug\ndesign. The emergence of AlphaFold 2 has greatly promoted the prediction of\nprotein 3D structures, and it is of great significance to give an overall and\naccurate evaluation of the predicted models, especially the complex models.\nAmong the existing methods for evaluating multimer structures, DockQ is the\nmost commonly used. However, as a more suitable metric for complex docking,\nDockQ cannot provide a unique and accurate evaluation in the non-docking\nsituation. Therefore, it is necessary to propose an evaluation strategy that\ncan directly evaluate the whole complex without limitation and achieve good\nresults. In this work, we proposed DCI score, a new evaluation strategy for\nprotein complex structure models, which only bases on distance map and CI\n(contact-interface) map, DCI focuses on the prediction accuracy of the contact\ninterface based on the overall evaluation of complex structure, is not inferior\nto DockQ in the evaluation accuracy according to CAPRI classification, and is\nable to handle the non-docking situation better than DockQ. Besides, we\ncalculated DCI score on CASP datasets and compared it with CASP official\nassessment, which obtained good results. In addition, we found that DCI can\nbetter evaluate the overall structure deviation caused by interface prediction\nerrors in the case of multi-chains. Our DCI is available at\n\\url{https://gitee.com/WendaWang/DCI-score.git}, and the online-server is\navailable at \\url{http://mialab.ruc.edu.cn/DCIServer/}.\n","subjects":["Quantitative Biology/Biomolecules","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}