{"id":"2407.15758","title":"Breather gas fission from elliptic potentials in self-focusing media","authors":"Gino Biondini, Gennady A. El, Xu-Dan Luo, Jeffrey Oregero and\n  Alexander Tovbis","authorsParsed":[["Biondini","Gino",""],["El","Gennady A.",""],["Luo","Xu-Dan",""],["Oregero","Jeffrey",""],["Tovbis","Alexander",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 16:09:19 GMT"}],"updateDate":"2024-08-02","timestamp":1721664559000,"abstract":"  We present an analytical model of integrable turbulence in the focusing\nnonlinear Schr\\\"odinger (fNLS) equation, generated by a one-parameter family of\nfinite-band elliptic potentials in the semiclassical limit. We show that the\nspectrum of these potentials exhibits a thermodynamic band/gap scaling\ncompatible with that of soliton and breather gases depending on the value of\nthe elliptic parameter m of the potential. We then demonstrate that, upon\naugmenting the potential by a small random noise (which is inevitably present\nin real physical systems), the solution of the fNLS equation evolves into a\nfully randomized, spatially homogeneous breather gas, a phenomenon we call\nbreather gas fission. We show that the statistical properties of the breather\ngas at large times are determined by the spectral density of states generated\nby the unperturbed initial potential. We analytically compute the kurtosis of\nthe breather gas as a function of the elliptic parameter m, and we show that it\nis greater than 2 for all non-zero m, implying non-Gaussian statistics.\nFinally, we verify the theoretical predictions by comparison with direct\nnumerical simulations of the fNLS equation. These results establish a link\nbetween semiclassical limits of integrable systems and the statistical\ncharacterization of their soliton and breather gases.\n","subjects":["Nonlinear Sciences/Exactly Solvable and Integrable Systems","Nonlinear Sciences/Pattern Formation and Solitons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ypKlfB6FCKhGi3Jvv2XWtzp6cwDWEzgrfxu8yUGpl7c","pdfSize":"1881741","objectId":"0xc6683cd3fd131678a578c3699056dbc5b0a563f8dc8384b88346adf23ee224b6","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
