{"id":"2407.17697","title":"Superior Scoring Rules for Probabilistic Evaluation of Single-Label\n  Multi-Class Classification Tasks","authors":"Rouhollah Ahmadian and Mehdi Ghatee and Johan Wahlstr\\\"om","authorsParsed":[["Ahmadian","Rouhollah",""],["Ghatee","Mehdi",""],["Wahlström","Johan",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 01:46:05 GMT"}],"updateDate":"2024-07-26","timestamp":1721871965000,"abstract":"  This study introduces novel superior scoring rules called Penalized Brier\nScore (PBS) and Penalized Logarithmic Loss (PLL) to improve model evaluation\nfor probabilistic classification. Traditional scoring rules like Brier Score\nand Logarithmic Loss sometimes assign better scores to misclassifications in\ncomparison with correct classifications. This discrepancy from the actual\npreference for rewarding correct classifications can lead to suboptimal model\nselection. By integrating penalties for misclassifications, PBS and PLL modify\ntraditional proper scoring rules to consistently assign better scores to\ncorrect predictions. Formal proofs demonstrate that PBS and PLL satisfy\nstrictly proper scoring rule properties while also preferentially rewarding\naccurate classifications. Experiments showcase the benefits of using PBS and\nPLL for model selection, model checkpointing, and early stopping. PBS exhibits\na higher negative correlation with the F1 score compared to the Brier Score\nduring training. Thus, PBS more effectively identifies optimal checkpoints and\nearly stopping points, leading to improved F1 scores. Comparative analysis\nverifies models selected by PBS and PLL achieve superior F1 scores. Therefore,\nPBS and PLL address the gap between uncertainty quantification and accuracy\nmaximization by encapsulating both proper scoring principles and explicit\npreference for true classifications. The proposed metrics can enhance model\nevaluation and selection for reliable probabilistic classification.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}