{"id":"2407.08175","title":"Generalized Diffusive Epidemic Process with Permanent Immunity in Two\n  Dimensions","authors":"V. R. Carvalho, T. F. A. Alves, G. A. Alves, D. S. M. Alencar, F. W.\n  S. Lima, A. Macedo-Filho, R. S. Ferreira","authorsParsed":[["Carvalho","V. R.",""],["Alves","T. F. A.",""],["Alves","G. A.",""],["Alencar","D. S. M.",""],["Lima","F. W. S.",""],["Macedo-Filho","A.",""],["Ferreira","R. S.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 04:38:37 GMT"},{"version":"v2","created":"Mon, 15 Jul 2024 15:06:29 GMT"}],"updateDate":"2024-07-16","timestamp":1720672717000,"abstract":"  We introduce the generalized diffusive epidemic process, which is a\nmetapopulation model for an epidemic outbreak where a non-sedentary population\nof walkers can jump along lattice edges with diffusion rates $D_S$ or $D_I$ if\nthey are susceptible or infected, respectively, and recovered individuals\npossess permanent immunity. Individuals can be contaminated with rate $\\mu_c$\nif they share the same lattice node with an infected individual and recover\nwith rate $\\mu_r$, being removed from the dynamics. Therefore, the model does\nnot have the conservation of the active particles composed of susceptible and\ninfected individuals. The reaction-diffusion dynamics are separated into two\nstages: (i) Brownian diffusion, where the particles can jump to neighboring\nnodes, and (ii) contamination and recovery reactions. The dynamics are mapped\ninto a growing process by activating lattice nodes with successful\ncontaminations where activated nodes are interpreted as infection sources. In\nall simulations, the epidemic starts with one infected individual in a lattice\nfilled with susceptibles. Our results indicate a phase transition in the\ndynamic percolation universality class controlled by the population size,\nirrespective of diffusion rates $D_S$ and $D_I$ and a subexponential growth of\nthe epidemics in the percolation threshold.\n","subjects":["Condensed Matter/Statistical Mechanics","Physics/Physics and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}