{"id":"2407.12699","title":"Mechanism Design via the Interim Relaxation","authors":"Kshipra Bhawalkar, Marios Mertzanidis, Divyarthi Mohan, Alexandros\n  Psomas","authorsParsed":[["Bhawalkar","Kshipra",""],["Mertzanidis","Marios",""],["Mohan","Divyarthi",""],["Psomas","Alexandros",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 16:21:46 GMT"}],"updateDate":"2024-07-18","timestamp":1721233306000,"abstract":"  We study revenue maximization for agents with additive preferences, subject\nto downward-closed constraints on the set of feasible allocations. In seminal\nwork, Alaei~\\cite{alaei2014bayesian} introduced a powerful multi-to-single\nagent reduction based on an ex-ante relaxation of the multi-agent problem. This\nreduction employs a rounding procedure which is an online contention resolution\nscheme (OCRS) in disguise, a now widely-used method for rounding fractional\nsolutions in online Bayesian and stochastic optimization problems. In this\npaper, we leverage our vantage point, 10 years after the work of Alaei, with a\nrich OCRS toolkit and modern approaches to analyzing multi-agent mechanisms; we\nintroduce a general framework for designing non-sequential and sequential\nmulti-agent, revenue-maximizing mechanisms, capturing a wide variety of\nproblems Alaei's framework could not address. Our framework uses an\n\\emph{interim} relaxation, that is rounded to a feasible mechanism using what\nwe call a two-level OCRS, which allows for some structured dependence between\nthe activation of its input elements. For a wide family of constraints, we can\nconstruct such schemes using existing OCRSs as a black box; for other\nconstraints, such as knapsack, we construct such schemes from scratch. We\ndemonstrate numerous applications of our framework, including a sequential\nmechanism that guarantees a $\\frac{2e}{e-1} \\approx 3.16$ approximation to the\noptimal revenue for the case of additive agents subject to matroid feasibility\nconstraints. We also show how our framework can be easily extended to\nmulti-parameter procurement auctions, where we provide an OCRS for Stochastic\nKnapsack that might be of independent interest.\n","subjects":["Computing Research Repository/Computer Science and Game Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"29EunyKz9sY0bHGpaMK4cHauD4yFxCUZsSPdHqzPEmc","pdfSize":"716316"}
