{"id":"2407.17600","title":"Climate Transition to Temperate Nightside at High Atmosphere Mass","authors":"Evelyn Macdonald, Kristen Menou, Christopher Lee, Adiv Paradise","authorsParsed":[["Macdonald","Evelyn",""],["Menou","Kristen",""],["Lee","Christopher",""],["Paradise","Adiv",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 19:14:11 GMT"}],"updateDate":"2024-07-26","timestamp":1721848451000,"abstract":"  Our recent work shows how M-Earth climates and transmission spectra depend on\nthe amount of ice-free ocean on the planet's dayside and the mass of N2 in its\natmosphere. M-Earths with more ice-free ocean and thicker atmospheres are\nhotter and more humid, and have larger water vapour features in their\ntransmission spectra. In this paper, we describe a climate transition in\nhigh-pN2 simulations from the traditional ``eyeball\" M-Earth climate, in which\nonly the substellar region is temperate, to a ``temperate nightside\" regime in\nwhich both the dayside and the nightside are entirely ice-free. Between these\ntwo states, there is a ``transition\" regime with partial nightside ice cover.\nWe use 3D climate simulations to describe the climate transition from frozen to\ndeglaciated nightsides. We attribute this transition to increased advection and\nheat transport by water vapour in thicker atmospheres. We find that the\nnightside transitions smoothly back and forth between frozen and ice-free when\nthe instellation or pCO2 is perturbed, with no hysteresis. We also find an\nanalogous transition in colder planets: those with thin atmospheres can have a\ndayside hotspot when the instellation is low, whereas those with more massive\natmospheres are more likely to be in the ``snowball\" regime, featuring a\ncompletely frozen dayside, due to the increased advection of heat away from the\nsubstellar point. We show how both of these climate transitions are sensitive\nto instellation, land cover, and atmosphere mass. We generate synthetic\ntransmission spectra and phase curves for the range of climates in our\nsimulations.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}