{"id":"2407.00337","title":"Physics-informed active learning with simultaneous weak-form latent\n  space dynamics identification","authors":"Xiaolong He, April Tran, David M. Bortz, Youngsoo Choi","authorsParsed":[["He","Xiaolong",""],["Tran","April",""],["Bortz","David M.",""],["Choi","Youngsoo",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 06:52:59 GMT"},{"version":"v2","created":"Sat, 20 Jul 2024 19:21:42 GMT"}],"updateDate":"2024-07-23","timestamp":1719643979000,"abstract":"  The parametric greedy latent space dynamics identification (gLaSDI) framework\nhas demonstrated promising potential for accurate and efficient modeling of\nhigh-dimensional nonlinear physical systems. However, it remains challenging to\nhandle noisy data. To enhance robustness against noise, we incorporate the\nweak-form estimation of nonlinear dynamics (WENDy) into gLaSDI. In the proposed\nweak-form gLaSDI (WgLaSDI) framework, an autoencoder and WENDy are trained\nsimultaneously to discover intrinsic nonlinear latent-space dynamics of\nhigh-dimensional data. Compared to the standard sparse identification of\nnonlinear dynamics (SINDy) employed in gLaSDI, WENDy enables variance reduction\nand robust latent space discovery, therefore leading to more accurate and\nefficient reduced-order modeling. Furthermore, the greedy physics-informed\nactive learning in WgLaSDI enables adaptive sampling of optimal training data\non the fly for enhanced modeling accuracy. The effectiveness of the proposed\nframework is demonstrated by modeling various nonlinear dynamical problems,\nincluding viscous and inviscid Burgers' equations, time-dependent radial\nadvection, and the Vlasov equation for plasma physics. With data that contains\n5-10% Gaussian white noise, WgLaSDI outperforms gLaSDI by orders of magnitude,\nachieving 1-7% relative errors. Compared with the high-fidelity models, WgLaSDI\nachieves 121 to 1,779x speed-up.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Machine Learning","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}