{"id":"2407.14682","title":"Electronically Amplified Electron-Phonon Interaction and Metal-Insulator\n  Transition in Perovskite Nickelates","authors":"Yong Zhong, Kyuho Lee, Regan Bhatta, Yonghun Lee, Martin Gonzalez,\n  Jiarui Li, Ruohan Wang, Makoto Hashimoto, Donghui Lu, Sung-Kwan Mo, Chunjing\n  Jia, Harold Y. Hwang, and Zhi-Xun Shen","authorsParsed":[["Zhong","Yong",""],["Lee","Kyuho",""],["Bhatta","Regan",""],["Lee","Yonghun",""],["Gonzalez","Martin",""],["Li","Jiarui",""],["Wang","Ruohan",""],["Hashimoto","Makoto",""],["Lu","Donghui",""],["Mo","Sung-Kwan",""],["Jia","Chunjing",""],["Hwang","Harold Y.",""],["Shen","Zhi-Xun",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 21:56:03 GMT"}],"updateDate":"2024-07-23","timestamp":1721426163000,"abstract":"  The relative role of electron-electron and electron-lattice interactions in\ndriving the metal-insulator transition in perovskite nickelates opens a rare\nwindow into the non-trivial interplay of the two important degrees of freedom\nin solids. The most promising solution is to extract the electronic and lattice\ncontributions during the phase transition by performing high-resolution\nspectroscopy measurements. Here, we present a three-dimensional electronic\nstructure study of Nd1-xSrxNiO3 (x = 0 and 0.175) thin films with unprecedented\naccuracy, in which the low energy fermiology has a quantitative agreement with\nmodel simulations and first-principles calculations. Two characteristic\nphonons, the octahedral rotational and breathing modes, are illustrated to be\ncoupled with the electron dynamics in the metallic phase, showing a kink\nstructure along the band dispersion, as well as a hump feature in the energy\nspectrum. Entering the insulating state, the electron-phonon interaction is\namplified by strong electron correlations, transforming the mobile large\npolarons at high temperatures to localized small polarons in the ground state.\nMoreover, the analysis of quasiparticle residue enables us to establish a\ntransport-spectroscopy correspondence in Nd1-xSrxNiO3 thin films. Our findings\ndemonstrate the essential role of electron-lattice interaction enhanced by the\nelectronic correlation to stabilize the insulating phase in the perovskite\nnickelates.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"L02WIVZ1nmWMr6-R2LT7uZhbmE3fEVMpGiJTSad0g4g","pdfSize":"4503083"}
