{"id":"2407.19404","title":"Non-equilibrium States and Interactions in the Topological Insulator and\n  Topological Crystalline Insulator Phases of NaCd4As3","authors":"Tika R Kafle, Yingchao Zhang, Yi-yan Wang, Xun Shi, Na Li, Richa\n  Sapkota, Jeremy Thurston, Wenjing You, Shunye Gao, Qingxin Dong, Kai\n  Rossnagel, Gen-Fu Chen, James K Freericks, Henry C Kapteyn, Margaret M\n  Murnane","authorsParsed":[["Kafle","Tika R",""],["Zhang","Yingchao",""],["Wang","Yi-yan",""],["Shi","Xun",""],["Li","Na",""],["Sapkota","Richa",""],["Thurston","Jeremy",""],["You","Wenjing",""],["Gao","Shunye",""],["Dong","Qingxin",""],["Rossnagel","Kai",""],["Chen","Gen-Fu",""],["Freericks","James K",""],["Kapteyn","Henry C",""],["Murnane","Margaret M",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 05:23:24 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 04:52:52 GMT"}],"updateDate":"2024-08-21","timestamp":1722144204000,"abstract":"  Topological materials are of great interest because they can support metallic\nedge or surface states that are robust against perturbations, with the\npotential for technological applications. Here we experimentally explore the\nlight-induced non-equilibrium properties of two distinct topological phases in\nNaCd4As3: a topological crystalline insulator (TCI) phase and a topological\ninsulator (TI) phase. This material has surface states that are protected by\nmirror symmetry in the TCI phase at room temperature, while it undergoes a\nstructural phase transition to a TI phase below 200 K. After exciting the TI\nphase by an ultrafast laser pulse, we observe a leading band edge shift of >150\nmeV, that slowly builds up and reaches a maximum after ~0.6 ps, and that\npersists for ~8 ps. The slow rise time of the excited electron population and\nelectron temperature suggests that the electronic and structural orders are\nstrongly coupled in this TI phase. It also suggests that the directly excited\nelectronic states and the probed electronic states are weakly coupled. Both\ncouplings are likely due to a partial relaxation of the lattice distortion,\nwhich is known to be associated with the TI phase. In contrast, no distinct\nexcited state is observed in the TCI phase immediately or after\nphotoexcitation, which we attribute to the low density of states and phase\nspace available near the Fermi level. Our results show how ultrafast laser\nexcitation can reveal the distinct excited states and interactions in\nphase-rich topological materials.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}