{"id":"2407.14890","title":"Rate Splitting Multiple Access: Optimal Beamforming Structure and\n  Efficient Optimization Algorithms","authors":"Tianyu Fang and Yijie Mao","authorsParsed":[["Fang","Tianyu",""],["Mao","Yijie",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 14:42:37 GMT"}],"updateDate":"2024-07-23","timestamp":1721486557000,"abstract":"  Joint optimization for common rate allocation and beamforming design have\nbeen widely studied in rate splitting multiple access (RSMA) empowered\nmultiuser multi-antenna transmission networks. Due to the highly coupled\noptimization variables and non-convexity of the joint optimization problems,\nemerging algorithms such as weighted minimum mean square error (WMMSE) and\nsuccessive convex approximation (SCA) have been applied to RSMA which typically\napproximate the original problem with a sequence of disciplined convex\nsubproblems and solve each subproblem by an optimization toolbox. While these\napproaches are capable of finding a viable solution, they are unable to offer a\ncomprehensive understanding of the solution structure and are burdened by high\ncomputational complexity. In this work, for the first time, we identify the\noptimal beamforming structure and common rate allocation for the weighted\nsum-rate (WSR) maximization problem of RSMA. We then propose a computationally\nefficient optimization algorithm that jointly optimizes the beamforming and\ncommon rate allocation without relying on any toolbox. Specifically, we first\napproximate the original WSR maximization problem with a sequence of convex\nsubproblems based on fractional programming (FP). Numerical results show that\nthe proposed algorithm achieves the same performance but takes only 0.5\\% or\nless simulation time compared with the state-of-the-art WMMSE, SCA, and FP\nalgorithms. Experimental results show that the proposed two methods have\nsimilar mean square error (MSE) performance compared with traditional method\nusing CVX optimization tool, however, computational complexities are greatly\nreduced. The proposed algorithms pave the way for the practical and efficient\noptimization algorithm design for RSMA and its applications in 6G.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}