{"id":"2407.17291","title":"How Good (Or Bad) Are LLMs at Detecting Misleading Visualizations?","authors":"Leo Yu-Ho Lo and Huamin Qu","authorsParsed":[["Lo","Leo Yu-Ho",""],["Qu","Huamin",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 14:02:20 GMT"}],"updateDate":"2024-07-25","timestamp":1721829740000,"abstract":"  In this study, we address the growing issue of misleading charts, a prevalent\nproblem that undermines the integrity of information dissemination. Misleading\ncharts can distort the viewer's perception of data, leading to\nmisinterpretations and decisions based on false information. The development of\neffective automatic detection methods for misleading charts is an urgent field\nof research. The recent advancement of multimodal Large Language Models (LLMs)\nhas introduced a promising direction for addressing this challenge. We explored\nthe capabilities of these models in analyzing complex charts and assessing the\nimpact of different prompting strategies on the models' analyses. We utilized a\ndataset of misleading charts collected from the internet by prior research and\ncrafted nine distinct prompts, ranging from simple to complex, to test the\nability of four different multimodal LLMs in detecting over 21 different chart\nissues. Through three experiments--from initial exploration to detailed\nanalysis--we progressively gained insights into how to effectively prompt LLMs\nto identify misleading charts and developed strategies to address the\nscalability challenges encountered as we expanded our detection range from the\ninitial five issues to 21 issues in the final experiment. Our findings reveal\nthat multimodal LLMs possess a strong capability for chart comprehension and\ncritical thinking in data interpretation. There is significant potential in\nemploying multimodal LLMs to counter misleading information by supporting\ncritical thinking and enhancing visualization literacy. This study demonstrates\nthe applicability of LLMs in addressing the pressing concern of misleading\ncharts.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OP1SiZ5yP_iEZI1qoBjsz9n5rOuIjtmy7n3XR-_VrrU","pdfSize":"877495","objectId":"0x8b7427f0f1c6de1916f29388223c6f5b47d3f5d5412031dcab1c15356cf07045","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
