{"id":"2407.09986","title":"Curriculum Is More Influential Than Haptic Information During\n  Reinforcement Learning of Object Manipulation Against Gravity","authors":"Pegah Ojaghi, Romina Mir, Ali Marjaninejad, Andrew Erwin, Michael\n  Wehner, Francisco J Valero-Cueva","authorsParsed":[["Ojaghi","Pegah",""],["Mir","Romina",""],["Marjaninejad","Ali",""],["Erwin","Andrew",""],["Wehner","Michael",""],["Valero-Cueva","Francisco J",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 19:23:11 GMT"}],"updateDate":"2024-07-16","timestamp":1720898591000,"abstract":"  Learning to lift and rotate objects with the fingertips is necessary for\nautonomous in-hand dexterous manipulation. In our study, we explore the impact\nof various factors on successful learning strategies for this task.\nSpecifically, we investigate the role of curriculum learning and haptic\nfeedback in enabling the learning of dexterous manipulation. Using model-free\nReinforcement Learning, we compare different curricula and two haptic\ninformation modalities (No-tactile vs. 3D-force sensing) for lifting and\nrotating a ball against gravity with a three-fingered simulated robotic hand\nwith no visual input. Note that our best results were obtained when we used a\nnovel curriculum-based learning rate scheduler, which adjusts the\nlinearly-decaying learning rate when the reward is changed as it accelerates\nconvergence to higher rewards. Our findings demonstrate that the choice of\ncurriculum greatly biases the acquisition of different features of dexterous\nmanipulation. Surprisingly, successful learning can be achieved even in the\nabsence of tactile feedback, challenging conventional assumptions about the\nnecessity of haptic information for dexterous manipulation tasks. We\ndemonstrate the generalizability of our results to balls of different weights\nand sizes, underscoring the robustness of our learning approach. This work,\ntherefore, emphasizes the importance of the choice curriculum and challenges\nlong-held notions about the need for tactile information to autonomously learn\nin-hand dexterous manipulation.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}