{"id":"2407.05409","title":"Effect of a shear flow on the Darrieus-Landau instability in a Hele-Shaw\n  channel","authors":"Prabakaran Rajamanickam, Joel Daou","authorsParsed":[["Rajamanickam","Prabakaran",""],["Daou","Joel",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 15:24:55 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 19:59:15 GMT"},{"version":"v3","created":"Thu, 15 Aug 2024 10:58:24 GMT"}],"updateDate":"2024-08-16","timestamp":1720365895000,"abstract":"  The Darrieus--Landau instability of premixed flames propagating in a narrow\nHele-Shaw channel in the presence of a strong shear flow is investigated,\nincorporating also the Rayleigh--Taylor and diffusive-thermal instabilities.\nThe flow induces shear-enhanced diffusion (Taylor dispersion) in the streamwise\ndirection, but not in the spanwise direction and this leads to anisotropic\ndiffusion and flame propagation. To understand how such anisotropies affect\nflame stability, two important cases are considered. These correspond to\ninitial unperturbed conditions pertaining to a planar flame propagating in the\nstreamwise or spanwise directions. The analysis is based on a two-dimensional\nmodel derived by asymptotic methods and solved numerically. These address the\ninfluence of the shear-flow strength (or Peclet number $Pe$), preferential\ndiffusion (or Lewis number $Le$) and gravity (or Rayleigh number $Ra$).\nDispersion curves characterizing the perturbation growth rate are computed for\nselected values of $Pe$, $Le$ and $Ra$. Taylor dispersion induced by strong\nshear flows is found to suppress the Darrieus--Landau instability and to weaken\nthe flame wrinkling when the flame propagates in the streamwise direction. In\ncontrast, when the flame propagates in the spanwise direction, the flame is\nstabilized in $Le<1$ mixtures, but destabilized in $Le>1$ mixtures. In the\nlatter case, Taylor dispersion coupled with gas expansion facilitates flame\nwrinkling in an unusual manner. Specifically, stagnation points and\ncounter-rotating vortices are encountered in the flame close to the unburnt gas\nside. More generally, an original finding is the demonstration that vorticity\ncan be produced by a curved flame in a Hele-Shaw channel even in the absence of\ngravity, whenever $Pe \\neq 0$, and that the vorticity remains confined to the\nflame preheat and reaction zones.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}