{"id":"2407.18392","title":"A Reference-Based 3D Semantic-Aware Framework for Accurate Local Facial\n  Attribute Editing","authors":"Yu-Kai Huang, Yutong Zheng, Yen-Shuo Su, Anudeepsekhar Bolimera, Han\n  Zhang, Fangyi Chen, Marios Savvides","authorsParsed":[["Huang","Yu-Kai",""],["Zheng","Yutong",""],["Su","Yen-Shuo",""],["Bolimera","Anudeepsekhar",""],["Zhang","Han",""],["Chen","Fangyi",""],["Savvides","Marios",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 20:55:23 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 03:09:02 GMT"}],"updateDate":"2024-07-30","timestamp":1721940923000,"abstract":"  Facial attribute editing plays a crucial role in synthesizing realistic faces\nwith specific characteristics while maintaining realistic appearances. Despite\nadvancements, challenges persist in achieving precise, 3D-aware attribute\nmodifications, which are crucial for consistent and accurate representations of\nfaces from different angles. Current methods struggle with semantic\nentanglement and lack effective guidance for incorporating attributes while\nmaintaining image integrity. To address these issues, we introduce a novel\nframework that merges the strengths of latent-based and reference-based editing\nmethods. Our approach employs a 3D GAN inversion technique to embed attributes\nfrom the reference image into a tri-plane space, ensuring 3D consistency and\nrealistic viewing from multiple perspectives. We utilize blending techniques\nand predicted semantic masks to locate precise edit regions, merging them with\nthe contextual guidance from the reference image. A coarse-to-fine inpainting\nstrategy is then applied to preserve the integrity of untargeted areas,\nsignificantly enhancing realism. Our evaluations demonstrate superior\nperformance across diverse editing tasks, validating our framework's\neffectiveness in realistic and applicable facial attribute editing.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Fzvbv2DwwGDzWHw1bMfPlWcqq2eHe2xb2j25a0K4nuw","pdfSize":"5548356","objectId":"0x0cd835f0afe035ed216c77076d92735412873e7aae41528f1121d1793ae70ba7","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
