{"id":"2407.19934","title":"Graph Fourier Transform Enhancement through Envelope Extensions","authors":"Ali Bagheri Bardi, Taher Yazdanpanah, Milos Dakovic, Ljubisa Stankovic","authorsParsed":[["Bardi","Ali Bagheri",""],["Yazdanpanah","Taher",""],["Dakovic","Milos",""],["Stankovic","Ljubisa",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 12:10:42 GMT"}],"updateDate":"2024-07-30","timestamp":1722255042000,"abstract":"  Many real-world networks are characterized by directionality; however, the\nabsence of an appropriate Fourier basis hinders the effective implementation of\ngraph signal processing techniques.\n  Inspired by discrete signal processing, where embedding a line digraph into a\ncycle digraph facilitates the powerful Discrete Fourier Transform for signal\nanalysis, addressing the structural complexities of general digraphs can help\novercome the limitations of the Graph Fourier Transform (GFT) and unlock its\npotential.\n  The Discrete Fourier Transform (DFT) serves as a Graph Fourier Transform for\nboth cycle graphs and Cayley digraphs on the finite cyclic groups\n$\\mathbb{Z}_N$. We propose a systematic method to identify a class of such\nCayley digraphs that can encompass a given directed graph. By embedding the\ndirected graph into these Cayley digraphs and opting for envelope extensions\nthat naturally support the Graph Fourier Transform, the GFT functionalities of\nthese extensions can be harnessed for signal analysis.\n  Among the potential envelopes, optimal performance is achieved by selecting\none that meets key properties. This envelope's structure closely aligns with\nthe characteristics of the original digraph. The Graph Fourier Transform of\nthis envelope is reliable in terms of numerical stability, and its columns\napproximately form an eigenbasis for the adjacency matrix associated with the\noriginal digraph.\n  It is shown that the envelope extensions possess a convolution product, with\ntheir GFT fulfilling the convolution theorem. Additionally, shift-invariant\ngraph filters (systems) are described as the convolution operator, analogous to\nthe classical case. This allows the utilization of systems for signal analysis.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xRt9jmQsMKv9uokKgaz0yucvnyRoQMsi5YnfK4v95Fo","pdfSize":"1583409","objectId":"0xdabaacb5e0c5f65def8519c8a03cc733ae1081ab54b980e8010e5178646cceb7","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
