{"id":"2407.19976","title":"MambaGesture: Enhancing Co-Speech Gesture Generation with Mamba and\n  Disentangled Multi-Modality Fusion","authors":"Chencan Fu, Yabiao Wang, Jiangning Zhang, Zhengkai Jiang, Xiaofeng\n  Mao, Jiafu Wu, Weijian Cao, Chengjie Wang, Yanhao Ge, Yong Liu","authorsParsed":[["Fu","Chencan",""],["Wang","Yabiao",""],["Zhang","Jiangning",""],["Jiang","Zhengkai",""],["Mao","Xiaofeng",""],["Wu","Jiafu",""],["Cao","Weijian",""],["Wang","Chengjie",""],["Ge","Yanhao",""],["Liu","Yong",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 13:09:26 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 13:01:06 GMT"}],"updateDate":"2024-08-29","timestamp":1722258566000,"abstract":"  Co-speech gesture generation is crucial for producing synchronized and\nrealistic human gestures that accompany speech, enhancing the animation of\nlifelike avatars in virtual environments. While diffusion models have shown\nimpressive capabilities, current approaches often overlook a wide range of\nmodalities and their interactions, resulting in less dynamic and contextually\nvaried gestures. To address these challenges, we present MambaGesture, a novel\nframework integrating a Mamba-based attention block, MambaAttn, with a\nmulti-modality feature fusion module, SEAD. The MambaAttn block combines the\nsequential data processing strengths of the Mamba model with the contextual\nrichness of attention mechanisms, enhancing the temporal coherence of generated\ngestures. SEAD adeptly fuses audio, text, style, and emotion modalities,\nemploying disentanglement to deepen the fusion process and yield gestures with\ngreater realism and diversity. Our approach, rigorously evaluated on the\nmulti-modal BEAT dataset, demonstrates significant improvements in Fr\\'echet\nGesture Distance (FGD), diversity scores, and beat alignment, achieving\nstate-of-the-art performance in co-speech gesture generation. Project website:\n$\\href{https://fcchit.github.io/mambagesture/}{\\textit{https://fcchit.github.io/mambagesture/}}$.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}