{"id":"2407.12361","title":"Generalisation of the Navier-slip boundary condition to arbitrary\n  directions: Application to 3D oblique geodynamic simulations","authors":"Anthony Jourdon, Dave A. May, Alice-Agnes Gabriel","authorsParsed":[["Jourdon","Anthony",""],["May","Dave A.",""],["Gabriel","Alice-Agnes",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 07:37:39 GMT"}],"updateDate":"2024-07-18","timestamp":1721201859000,"abstract":"  Although boundary conditions are mandatory to solve partial differential\nequations, they also represent a transfer of information between the domain\nbeing modelled and its surroundings. In the case of isolated or closed systems,\nthese can be formulated using free- or no-slip conditions. However, for open\nsystems, the information transferred through the boundaries is essential to the\ndynamics of the system and can have a first order impact on its evolution. This\nwork addresses regional geodynamic modelling simulating the evolution of an\nEarth's piece over millions of years by solving non-linear Stokes flow. In this\nopen system, we introduce a new approach to impose oblique boundary conditions\ngeneralising the Navier-slip boundary conditions to arbitrary directions in 3D.\nThe method requires defining both slip and stress constraints. The stress\nconstraint is imposed utilising a coordinate transformation to redefine the\nstress tensor along the boundaries according to the arbitrary direction chosen\nwhile for the slip constraint we utilise Nitsche's method in the context of the\nfinite element method, resulting in a symmetrised and penalised weak form. We\nvalidate our approach through a series of numerical experiments of increasing\ncomplexity, starting with 2D and 3D linear models. Then, we apply those\nboundary conditions to a 3D non-linear geodynamic model of oblique extension\nthat we compare with a standard model utilising Dirichlet boundary conditions.\nOur results show that using Dirichlet boundary conditions strongly influences\nthe evolution of the system and generates artefacts near and along the\nboundaries. In comparison, the model using the generalised Navier-slip boundary\nconditions behaves closely to a model with an unbounded domain, providing a\nphysically interpretable solution near and along the boundaries.\n","subjects":["Physics/Geophysics","Physics/Computational Physics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"bMI5fvd21l4DNsjkXwEvs_f7hOM80Pj2gn-QLtaxx9w","pdfSize":"39897610"}
