{"id":"2407.16979","title":"Chemical tracers of a highly eccentric AGB-main sequence star binary","authors":"T. Danilovich, J. Malfait, M. Van de Sande, M. Montarg\\`es, P.\n  Kervella, F. De Ceuster, A. Coenegrachts, T. J. Millar, A. M. S. Richards, L.\n  Decin, C. A. Gottlieb, C. Pinte, E. De Beck, D. J. Price, K. T. Wong, J.\n  Bolte, K. M. Menten, A. Baudry, A. de Koter, S. Etoka, D. Gobrecht, M. Gray,\n  F. Herpin, M. Jeste, E. Lagadec, S. Maes, I. McDonald, L. Marinho, H. S. P.\n  M\\\"uller, B. Pimpanuwat, J. M. C. Plane, R. Sahai, S. H. J. Wallstr\\\"om, J.\n  Yates, and A. Zijlstra","authorsParsed":[["Danilovich","T.",""],["Malfait","J.",""],["Van de Sande","M.",""],["Montargès","M.",""],["Kervella","P.",""],["De Ceuster","F.",""],["Coenegrachts","A.",""],["Millar","T. J.",""],["Richards","A. M. S.",""],["Decin","L.",""],["Gottlieb","C. A.",""],["Pinte","C.",""],["De Beck","E.",""],["Price","D. J.",""],["Wong","K. T.",""],["Bolte","J.",""],["Menten","K. M.",""],["Baudry","A.",""],["de Koter","A.",""],["Etoka","S.",""],["Gobrecht","D.",""],["Gray","M.",""],["Herpin","F.",""],["Jeste","M.",""],["Lagadec","E.",""],["Maes","S.",""],["McDonald","I.",""],["Marinho","L.",""],["Müller","H. S. P.",""],["Pimpanuwat","B.",""],["Plane","J. M. C.",""],["Sahai","R.",""],["Wallström","S. H. J.",""],["Yates","J.",""],["Zijlstra","A.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 03:51:58 GMT"}],"updateDate":"2024-07-25","timestamp":1721793118000,"abstract":"  Binary interactions have been proposed to explain a variety of circumstellar\nstructures seen around evolved stars, including asymptotic giant branch (AGB)\nstars and planetary nebulae. Studies resolving the circumstellar envelopes of\nAGB stars have revealed spirals, discs and bipolar outflows, with shaping\nattributed to interactions with a companion. For the first time, we have used a\ncombined chemical and dynamical analysis to reveal a highly eccentric and\nlong-period orbit for W Aquilae, a binary system containing an AGB star and a\nmain sequence companion. Our results are based on anisotropic SiN emission, the\nfirst detections of NS and SiC towards an S-type star, and density structures\nobserved in the CO emission. These features are all interpreted as having\nformed during periastron interactions. Our astrochemistry-based method can\nyield stringent constraints on the orbital parameters of long-period binaries\ncontaining AGB stars, and will be applicable to other systems.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}