{"id":"2407.21266","title":"DDU-Net: A Domain Decomposition-based CNN for High-Resolution Image\n  Segmentation on Multiple GPUs","authors":"Corn\\'e Verburg, Alexander Heinlein, Eric C. Cyr","authorsParsed":[["Verburg","Corné",""],["Heinlein","Alexander",""],["Cyr","Eric C.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 01:07:21 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 01:59:58 GMT"}],"updateDate":"2024-08-02","timestamp":1722388041000,"abstract":"  The segmentation of ultra-high resolution images poses challenges such as\nloss of spatial information or computational inefficiency. In this work, a\nnovel approach that combines encoder-decoder architectures with domain\ndecomposition strategies to address these challenges is proposed. Specifically,\na domain decomposition-based U-Net (DDU-Net) architecture is introduced, which\npartitions input images into non-overlapping patches that can be processed\nindependently on separate devices. A communication network is added to\nfacilitate inter-patch information exchange to enhance the understanding of\nspatial context. Experimental validation is performed on a synthetic dataset\nthat is designed to measure the effectiveness of the communication network.\nThen, the performance is tested on the DeepGlobe land cover classification\ndataset as a real-world benchmark data set. The results demonstrate that the\napproach, which includes inter-patch communication for images divided into\n$16\\times16$ non-overlapping subimages, achieves a $2-3\\,\\%$ higher\nintersection over union (IoU) score compared to the same network without\ninter-patch communication. The performance of the network which includes\ncommunication is equivalent to that of a baseline U-Net trained on the full\nimage, showing that our model provides an effective solution for segmenting\nultra-high-resolution images while preserving spatial context. The code is\navailable at https://github.com/corne00/HiRes-Seg-CNN.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}