{"id":"2407.01733","title":"AquaMILR: Mechanical intelligence simplifies control of undulatory\n  robots in cluttered fluid environments","authors":"Tianyu Wang, Nishanth Mankame, Matthew Fernandez, Velin Kojouharov,\n  Daniel I. Goldman","authorsParsed":[["Wang","Tianyu",""],["Mankame","Nishanth",""],["Fernandez","Matthew",""],["Kojouharov","Velin",""],["Goldman","Daniel I.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 19:07:10 GMT"}],"updateDate":"2024-07-03","timestamp":1719860830000,"abstract":"  While undulatory swimming of elongate limbless robots has been extensively\nstudied in open hydrodynamic environments, less research has been focused on\nlimbless locomotion in complex, cluttered aquatic environments. Motivated by\nthe concept of mechanical intelligence, where controls for obstacle navigation\ncan be offloaded to passive body mechanics in terrestrial limbless locomotion,\nwe hypothesize that principles of mechanical intelligence can be extended to\ncluttered hydrodynamic regimes. To test this, we developed an untethered\nlimbless robot capable of undulatory swimming on water surfaces, utilizing a\nbilateral cable-driven mechanism inspired by organismal muscle actuation\nmorphology to achieve programmable anisotropic body compliance. We demonstrated\nthrough robophysical experiments that, similar to terrestrial locomotion, an\nappropriate level of body compliance can facilitate emergent swim through\ncomplex hydrodynamic environments under pure open-loop control. Moreover, we\nfound that swimming performance depends on undulation frequency, with effective\nlocomotion achieved only within a specific frequency range. This contrasts with\nhighly damped terrestrial regimes, where inertial effects can often be\nneglected. Further, to enhance performance and address the challenges posed by\nnondeterministic obstacle distributions, we incorporated computational\nintelligence by developing a real-time body compliance tuning controller based\non cable tension feedback. This controller improves the robot's robustness and\noverall speed in heterogeneous hydrodynamic environments.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}