{"id":"2407.19773","title":"Unmasking unlearnable models: a classification challenge for biomedical\n  images without visible cues","authors":"Shivam Kumar, Samrat Chatterjee","authorsParsed":[["Kumar","Shivam",""],["Chatterjee","Samrat",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 08:12:42 GMT"}],"updateDate":"2024-07-30","timestamp":1722240762000,"abstract":"  Predicting traits from images lacking visual cues is challenging, as\nalgorithms are designed to capture visually correlated ground truth. This\nproblem is critical in biomedical sciences, and their solution can improve the\nefficacy of non-invasive methods. For example, a recent challenge of predicting\nMGMT methylation status from MRI images is critical for treatment decisions of\nglioma patients. Using less robust models poses a significant risk in these\ncritical scenarios and underscores the urgency of addressing this issue.\nDespite numerous efforts, contemporary models exhibit suboptimal performance,\nand underlying reasons for this limitation remain elusive. In this study, we\ndemystify the complexity of MGMT status prediction through a comprehensive\nexploration by performing benchmarks of existing models adjoining transfer\nlearning. Their architectures were further dissected by observing gradient flow\nacross layers. Additionally, a feature selection strategy was applied to\nimprove model interpretability. Our finding highlighted that current models are\nunlearnable and may require new architectures to explore applications in the\nreal world. We believe our study will draw immediate attention and catalyse\nadvancements in predictive modelling with non-visible cues.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"VQHwKXD8uJ4CAMP0UOF9sv_ipDg01kbFTbdYs2-1Jtk","pdfSize":"1910181"}
