{"id":"2407.09711","title":"Data Analysis of Decision Support for Sustainable Welfare in The\n  Presence of GDP Threshold Effects: A Case Study of Interactive Data\n  Exploration","authors":"Fahimeh Asgari, Seyedeh Gol Ara Ghoreishi, Matin Khajavi, Ali Foozoni,\n  Ali Ala, Ahmad Gholizadeh Lonbar","authorsParsed":[["Asgari","Fahimeh",""],["Ghoreishi","Seyedeh Gol Ara",""],["Khajavi","Matin",""],["Foozoni","Ali",""],["Ala","Ali",""],["Lonbar","Ahmad Gholizadeh",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 22:30:24 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 01:55:51 GMT"},{"version":"v3","created":"Sun, 4 Aug 2024 22:51:30 GMT"}],"updateDate":"2024-08-06","timestamp":1720823424000,"abstract":"  Energy usage and GDP have been the subject of numerous studies over the past\ndecades. It has been overlooked by previous studies that energy consumption\ncorrelates with economic growth in relation to GDP. This study uses threshold\nregression and Granger causality testing to identify GDP-dependent causality in\nten OECD countries over the last 10 years. There is a significant correlation\nbetween economic growth and energy consumption. Energy consumption and\nshort-term economic growth are statistically significantly correlated. There is\na significant positive effect of energy consumption (EC) on GDP in the short\nrun below the threshold of $10,936 USD since the coefficient is 3.34 and the\np-value is 0.0252. There is a -0.0127-correlation coefficient and a 0.0327\np-value associated with GDP Granger-cause EC over the long run. EC and GDP are\nnot causally related for GDP per capita above $10,936 USD. In the long run, GDP\nGranger causes EC with a coefficient of -0.1638 and a p-value of 0.0675.\nAccording to the study, sustainable development requires sustainable use of\nnatural resources, technological investment, foreign direct investment, and\ngross fixed capital formation. Economic growth can be boosted while adhering to\nsustainability goals by implementing these recommendations.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}