{"id":"2407.13136","title":"The single-particle spectral function of the extended Peierls-Hubbard\n  model at half-filling and quarter-filling","authors":"Ren-He Xu, Hantao Lu, Takami Tohyama, and Can Shao","authorsParsed":[["Xu","Ren-He",""],["Lu","Hantao",""],["Tohyama","Takami",""],["Shao","Can",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 03:47:46 GMT"}],"updateDate":"2024-07-19","timestamp":1721274466000,"abstract":"  By utilizing the twisted boundary conditions in the exact diagonalization\nmethod, we investigate the single-particle spectral function of the extended\nPeierls-Hubbard model at both half-filling and quarter filling. In\none-dimensional (1D) interacting systems, the spin-charge separation can\ntypically be identified in the single-particle spectral function by observing\nthe distinct spinon and holon bands. At half filling, starting from the pure 1D\nHubbard model with the on-site interaction $U=10$, we observe that the band\nstructure indicative of the spin-charge separation gradually transitions to\nfour individual bands as the Peierls instability $\\delta$ increases. At $U=10$\nand $\\delta=0.2$ where the spin-charge separation is still observable,\nincreasing the nearest-neighbor interaction $V$ can drive the system to a\ncharge-density-wave (CDW) state when $V\\gtrsim U/2$, without the obeservation\nof spinon and holon bands. At quarter-filling, on the other hand, the ground\nstate of Peierls-Hubbard model manifests an antiferromagnetic Mott insulator in\nunits of dimers. Increasing $U$ results in only a very small gap in the\nsingle-particle spectrum because even for $U=+\\infty$, with the model\ntransforming into a noninteracting half-filled dimerized tight-binding model,\nits gap determined by the Peierls instability $\\delta$ remains small.\nConversely, increasing $V$ can effectively open the single-particle gap and\nmake the spinon and holon bands more prominent.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}