{"id":"2407.21588","title":"A Bayesian Bootstrap Approach for Dynamic Borrowing for Minimizing Mean\n  Squared Error","authors":"Jixian Wang and Ram Tiwari","authorsParsed":[["Wang","Jixian",""],["Tiwari","Ram",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 13:20:31 GMT"}],"updateDate":"2024-08-01","timestamp":1722432031000,"abstract":"  For dynamic borrowing to leverage external data to augment the control arm of\nsmall RCTs, the key step is determining the amount of borrowing based on the\nsimilarity of the outcomes in the controls from the trial and the external data\nsources. A simple approach for this task uses the empirical Bayesian approach,\nwhich maximizes the marginal likelihood (maxML) of the amount of borrowing,\nwhile a likelihood-independent alternative minimizes the mean squared error\n(minMSE). We consider two minMSE approaches that differ from each other in the\nway of estimating the parameters in the minMSE rule. The classical one adjusts\nfor bias due to sample variance, which in some situations is equivalent to the\nmaxML rule. We propose a simplified alternative without the variance\nadjustment, which has asymptotic properties partially similar to the maxML\nrule, leading to no borrowing if means of control outcomes from the two data\nsources are different and may have less bias than that of the maxML rule. In\ncontrast, the maxML rule may lead to full borrowing even when two datasets are\nmoderately different, which may not be a desirable property. For inference, we\npropose a Bayesian bootstrap (BB) based approach taking the uncertainty of the\nestimated amount of borrowing and that of pre-adjustment into account. The\napproach can also be used with a pre-adjustment on the external controls for\npopulation difference between the two data sources using, e.g., inverse\nprobability weighting. The proposed approach is computationally efficient and\nis implemented via a simple algorithm. We conducted a simulation study to\nexamine properties of the proposed approach, including the coverage of 95 CI\nbased on the Bayesian bootstrapped posterior samples, or asymptotic normality.\nThe approach is illustrated by an example of borrowing controls for an AML\ntrial from another study.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}