{"id":"2407.14939","title":"Dynamical dark energy confronted with multiple CMB missions","authors":"Mahdi Najafi, Supriya Pan, Eleonora Di Valentino, Javad T. Firouzjaee","authorsParsed":[["Najafi","Mahdi",""],["Pan","Supriya",""],["Di Valentino","Eleonora",""],["Firouzjaee","Javad T.",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 17:12:45 GMT"}],"updateDate":"2024-07-23","timestamp":1721495565000,"abstract":"  The measurements of the cosmic microwave background (CMB) have played a\nsignificant role in understanding the nature of dark energy. In this article,\nwe investigate the dynamics of the dark energy equation of state, utilizing\nhigh-precision CMB data from multiple experiments. We begin by examining the\nChevallier-Polarski-Linder (CPL) parametrization, a commonly used and\nrecognized framework for describing the dark energy equation of state. We then\nexplore the general Exponential parametrization, which incorporates CPL as its\nfirst-order approximation, and extensions of this parametrization that\nincorporate nonlinear terms. We constrain these scenarios using CMB data from\nvarious missions, including the Planck 2018 legacy release, the Wilkinson\nMicrowave Anisotropy Probe (WMAP), the Atacama Cosmology Telescope (ACT), and\nthe South Pole Telescope (SPT), as well as combinations with low-redshift\ncosmological probes such as Baryon Acoustic Oscillations (BAO) and the Pantheon\nsample. While the $\\Lambda$CDM cosmology remains consistent within the 68\\%\nconfidence level, we observe that the extensions of the CPL parametrization are\nindistinguishable for Planck data. However, for ACT and SPT data, the inclusion\nof additional terms begins to reveal a peak in $w_{\\rm a, DE}$ that was\npreviously unconstrained.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CQUJj7yFuFB269seJyuv1e4lInTiqSt1jqhlK6GUol8","pdfSize":"3797608"}
