{"id":"2407.04765","title":"Resonant and Ultra-short-period Planet Systems are at Opposite Ends of\n  the Exoplanet Age Distribution","authors":"Stephen P. Schmidt, Kevin C. Schlaufman, Jacob H. Hamer","authorsParsed":[["Schmidt","Stephen P.",""],["Schlaufman","Kevin C.",""],["Hamer","Jacob H.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-09","timestamp":1720202400000,"abstract":"  Exoplanet systems are thought to evolve on secular timescales over billions\nof years. This evolution is impossible to directly observe on human timescales\nin most individual systems. While the availability of accurate and precise age\ninferences for individual exoplanet host stars with ages $\\tau$ in the interval\n$1~\\text{Gyr}\\lesssim~\\tau~\\lesssim10~\\text{Gyr}$ would constrain this\nevolution, accurate and precise age inferences are difficult to obtain for\nisolated field dwarfs like the host stars of most exoplanets. The Galactic\nvelocity dispersion of a thin disk stellar population monotonically grows with\ntime, and the relationship between age and velocity dispersion in a given\nGalactic location can be calibrated by a stellar population for which accurate\nand precise age inferences are possible. Using a sample of subgiants with\nprecise age inferences, we calibrate the age--velocity dispersion relation in\nthe Kepler field. Applying this relation to the Kepler field's planet\npopulations, we find that Kepler-discovered systems plausibly in second-order\nmean-motion resonances have $1~\\text{Gyr}\\lesssim~\\tau~\\lesssim2~\\text{Gyr}$.\nThe same is true for systems plausibly in first-order mean-motion resonances,\nbut only for systems likely affected by tidal dissipation inside their\ninnermost planets. These observations suggest that many planetary systems\ndiffuse away from initially resonant configurations on secular timescales. Our\ncalibrated relation also indicates that ultra-short-period (USP) planet systems\nhave typical ages in the interval\n$5~\\text{Gyr}\\lesssim~\\tau~\\lesssim6~\\text{Gyr}$. We propose that USP planets\ntidally migrated from initial periods in the range\n$1~\\text{d}\\lesssim~P~\\lesssim2~\\text{d}$ to their observed locations at\n$P<1~\\text{d}$ over billions of years and trillions of cycles of secular\neccentricity excitation and inside-planet damping.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"uuE2fGeD5MhdWrW1VvV8wRTkQQe3jtwKaUYr3EH1UKk","pdfSize":"1246318"}
