{"id":"2407.20694","title":"Detecting Causality in the Frequency Domain with Cross-Mapping Coherence","authors":"Zsigmond Benk\\H{o}, B\\'alint Varga, Marcell Stippinger, Zolt\\'an\n  Somogyv\\'ari","authorsParsed":[["Benkő","Zsigmond",""],["Varga","Bálint",""],["Stippinger","Marcell",""],["Somogyvári","Zoltán",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 09:43:35 GMT"}],"updateDate":"2024-07-31","timestamp":1722332615000,"abstract":"  Understanding causal relationships within a system is crucial for uncovering\nits underlying mechanisms. Causal discovery methods, which facilitate the\nconstruction of such models from time-series data, hold the potential to\nsignificantly advance scientific and engineering fields.\n  This study introduces the Cross-Mapping Coherence (CMC) method, designed to\nreveal causal connections in the frequency domain between time series. CMC\nbuilds upon nonlinear state-space reconstruction and extends the Convergent\nCross-Mapping algorithm to the frequency domain by utilizing coherence metrics\nfor evaluation. We tested the Cross-Mapping Coherence method using simulations\nof logistic maps, Lorenz systems, Kuramoto oscillators, and the Wilson-Cowan\nmodel of the visual cortex. CMC accurately identified the direction of causal\nconnections in all simulated scenarios. When applied to the Wilson-Cowan model,\nCMC yielded consistent results similar to spectral Granger causality.\n  Furthermore, CMC exhibits high sensitivity in detecting weak connections,\ndemonstrates sample efficiency, and maintains robustness in the presence of\nnoise.\n  In conclusion, the capability to determine directed causal influences across\ndifferent frequency bands allows CMC to provide valuable insights into the\ndynamics of complex, nonlinear systems.\n","subjects":["Computing Research Repository/Machine Learning","Nonlinear Sciences/Chaotic Dynamics","Physics/Data Analysis, Statistics and Probability","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rwFiCTfCOvPewsI9C7zCq6eYE0cd0fZ_55pcE-dZOPs","pdfSize":"4323815"}
