{"id":"2407.09509","title":"Brain Dialogue Interface (BDI): A User-Friendly fMRI Model for\n  Interactive Brain Decoding","authors":"Heng Huang, Lin Zhao, Zihao Wu, Xiaowei Yu, Jing Zhang, Xintao Hu,\n  Dajiang Zhu, Tianming Liu","authorsParsed":[["Huang","Heng",""],["Zhao","Lin",""],["Wu","Zihao",""],["Yu","Xiaowei",""],["Zhang","Jing",""],["Hu","Xintao",""],["Zhu","Dajiang",""],["Liu","Tianming",""]],"versions":[{"version":"v1","created":"Mon, 17 Jun 2024 04:38:19 GMT"}],"updateDate":"2024-07-16","timestamp":1718599099000,"abstract":"  Brain decoding techniques are essential for understanding the neurocognitive\nsystem. Although numerous methods have been introduced in this field,\naccurately aligning complex external stimuli with brain activities remains a\nformidable challenge. To alleviate alignment difficulties, many studies have\nsimplified their models by employing single-task paradigms and establishing\ndirect links between brain/world through classification strategies. Despite\nimprovements in decoding accuracy, this strategy frequently encounters issues\nwith generality when adapting these models to various task paradigms. To\naddress this issue, this study introduces a user-friendly decoding model that\nenables dynamic communication with the brain, as opposed to the static decoding\napproaches utilized by traditional studies. The model functions as a brain\nsimulator, allowing for interactive engagement with the brain and enabling the\ndecoding of a subject's experiences through dialogue-like queries. Uniquely,\nour model is trained in a completely unsupervised and task-free manner. Our\nexperiments demonstrate the feasibility and versatility of our proposed method.\nNotably, our model demonstrates exceptional capabilities in signal compression,\nsuccessfully representing the entire brain signal of approximately 185,751\nvoxels with just 32 signals. Furthermore, we show how our model can integrate\nseamlessly with multimodal models, thus enhancing the potential for controlling\nbrain decoding through textual or image inputs.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}