{"id":"2407.13332","title":"Joint OAM Multiplexing and OFDM in Sparse Multipath Environments","authors":"Liping Liang, Wenchi Cheng, Wei Zhang and Hailin Zhang","authorsParsed":[["Liang","Liping",""],["Cheng","Wenchi",""],["Zhang","Wei",""],["Zhang","Hailin",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 09:31:38 GMT"}],"updateDate":"2024-07-19","timestamp":1721295098000,"abstract":"  The emerging orbital angular momentum (OAM) based wireless communication is\nexpected to be a high spectrum-efficiency communication paradigm to solve the\ngrowing transmission data rate and limited bandwidth problem. Academic\nresearchers mainly concentrate on the OAM-based line-of-sight (LoS)\ncommunications. However, there exist some surroundings around the transceiver\nin most practical wireless communication scenarios, thus forming multipath\ntransmission. In this paper, a hybrid orthogonal division multiplexing (HODM)\nscheme by using OAM multiplexing and orthogonal frequency division multiplexing\n(OFDM) in conjunction is proposed to achieve high-capacity wireless\ncommunications in sparse multipath environments, where the scatterers are\nsparse. We first build the OAM-based wireless channel in a LoS path and several\nreflection paths combined sparse multipath environments. We concentrate on less\nthan or equal to three-time reflection paths because of the severe energy\nattenuation. The phase difference among the channel amplitude gains of the LoS\nand reflection paths, which is caused by the reflection paths, makes it\ndifficult to decompose the OAM signals. We propose the phase difference\ncompensation to handle this problem and then calculate the corresponding\ncapacity in radio vortex wireless communications. Numerical results illustrate\nthat the capacity of wireless communications by using our proposed HODM scheme\ncan be drastically increased in sparse multipath environments.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}