{"id":"2407.04877","title":"Leveraging Data Mining, Active Learning, and Domain Adaptation in a\n  Multi-Stage, Machine Learning-Driven Approach for the Efficient Discovery of\n  Advanced Acidic Oxygen Evolution Electrocatalysts","authors":"Rui Ding, Jianguo Liu, Kang Hua, Xuebin Wang, Xiaoben Zhang, Minhua\n  Shao, Yuxin Chen and Junhong Chen","authorsParsed":[["Ding","Rui",""],["Liu","Jianguo",""],["Hua","Kang",""],["Wang","Xuebin",""],["Zhang","Xiaoben",""],["Shao","Minhua",""],["Chen","Yuxin",""],["Chen","Junhong",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 22:14:55 GMT"}],"updateDate":"2024-07-09","timestamp":1720217695000,"abstract":"  Developing advanced catalysts for acidic oxygen evolution reaction (OER) is\ncrucial for sustainable hydrogen production. This study introduces a novel,\nmulti-stage machine learning (ML) approach to streamline the discovery and\noptimization of complex multi-metallic catalysts. Our method integrates data\nmining, active learning, and domain adaptation throughout the materials\ndiscovery process. Unlike traditional trial-and-error methods, this approach\nsystematically narrows the exploration space using domain knowledge with\nminimized reliance on subjective intuition. Then the active learning module\nefficiently refines element composition and synthesis conditions through\niterative experimental feedback. The process culminated in the discovery of a\npromising Ru-Mn-Ca-Pr oxide catalyst. Our workflow also enhances theoretical\nsimulations with domain adaptation strategy, providing deeper mechanistic\ninsights aligned with experimental findings. By leveraging diverse data sources\nand multiple ML strategies, we establish an efficient pathway for\nelectrocatalyst discovery and optimization. This comprehensive, data-driven\napproach represents a paradigm shift and potentially new benchmark in\nelectrocatalysts research.\n","subjects":["Condensed Matter/Materials Science","Computing Research Repository/Machine Learning","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AChkQaS66SLeeOn6O-TdL61yC9StPpuhrTnpoDDu6gM","pdfSize":"50580905"}
