{"id":"2407.05391","title":"Interference Management in MIMO-ISAC Systems: A Transceiver Design\n  Approach","authors":"Yangyang Niu, Zhiqing Wei, Dingyou Ma, Xiaoyu Yang, Huici Wu, Zhiyong\n  Feng, Jianhua Yuan","authorsParsed":[["Niu","Yangyang",""],["Wei","Zhiqing",""],["Ma","Dingyou",""],["Yang","Xiaoyu",""],["Wu","Huici",""],["Feng","Zhiyong",""],["Yuan","Jianhua",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 14:37:43 GMT"}],"updateDate":"2024-07-09","timestamp":1720363063000,"abstract":"  The integrated sensing and communication (ISAC) system under multi-input\nmulti-output (MIMO) architecture achieves dual functionalities of sensing and\ncommunication on the same platform by utilizing spatial gain, which provides a\nfeasible paradigm facing spectrum congestion. However, the dual functionalities\nof sensing and communication operating simultaneously in the same platform\nbring severe interference in the ISAC systems. Facing this challenge, we\npropose a joint optimization framework for transmit beamforming and receive\nfilter design for ISAC systems with MIMO architecture. We aim to maximize the\nsignal-to-clutter-plus-noise ratio (SCNR) at the receiver while considering\nvarious constraints such as waveform similarity, power budget, and\ncommunication performance requirements to ensure the integration of the dual\nfunctionalities. In particular, the overall transmit beamforming is refined\ninto sensing beamforming and communication beamforming, and a quadratic\ntransformation (QT) is introduced to relax and convert the complex non-convex\noptimization objective. An efficient algorithm based on covariance matrix\ntapers (CMT) is proposed to restructure the clutter covariance matrix\nconsidering the mismatched steering vector, thereby improving the robustness of\nthe ISAC transceiver design. Numerical simulations are provided to demonstrate\nthe effectiveness of the proposed algorithm.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}