{"id":"2407.00115","title":"Instance Temperature Knowledge Distillation","authors":"Zhengbo Zhang, Yuxi Zhou, Jia Gong, Jun Liu, Zhigang Tu","authorsParsed":[["Zhang","Zhengbo",""],["Zhou","Yuxi",""],["Gong","Jia",""],["Liu","Jun",""],["Tu","Zhigang",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 14:00:05 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 02:17:26 GMT"},{"version":"v3","created":"Sun, 7 Jul 2024 15:25:05 GMT"}],"updateDate":"2024-07-09","timestamp":1719496805000,"abstract":"  Knowledge distillation (KD) enhances the performance of a student network by\nallowing it to learn the knowledge transferred from a teacher network\nincrementally. Existing methods dynamically adjust the temperature to enable\nthe student network to adapt to the varying learning difficulties at different\nlearning stages of KD. KD is a continuous process, but when adjusting the\ntemperature, these methods consider only the immediate benefits of the\noperation in the current learning phase and fail to take into account its\nfuture returns. To address this issue, we formulate the adjustment of\ntemperature as a sequential decision-making task and propose a method based on\nreinforcement learning, termed RLKD. Importantly, we design a novel state\nrepresentation to enable the agent to make more informed action (i.e. instance\ntemperature adjustment). To handle the problem of delayed rewards in our method\ndue to the KD setting, we explore an instance reward calibration approach. In\naddition,we devise an efficient exploration strategy that enables the agent to\nlearn valuable instance temperature adjustment policy more efficiently. Our\nframework can serve as a plug-and-play technique to be inserted into various KD\nmethods easily, and we validate its effectiveness on both image classification\nand object detection tasks. Our project is at\nhttps://www.zayx.me/ITKD.github.io/.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"r7C61PlYbeFZ_h4SLFff8Js_wUz-ANxSjpMGFLzvl9U","pdfSize":"540207","objectId":"0xce04fc12c0bbe4b55c541566a85f4cf65d0585cbb7428f250d1807bd006aee04","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
