{"id":"2407.08778","title":"Mass Modeling and Kinematics of Galaxy Clusters in Modified Gravity","authors":"Lorenzo Pizzuti, Yacer Boumechta, Sandeep Haridasu, Alexandre M.\n  Pombo, Sofia Dossena, Minahil Adil Butt, Francesco Benetti, Carlo Baccigalupi\n  and Andrea Lapi","authorsParsed":[["Pizzuti","Lorenzo",""],["Boumechta","Yacer",""],["Haridasu","Sandeep",""],["Pombo","Alexandre M.",""],["Dossena","Sofia",""],["Butt","Minahil Adil",""],["Benetti","Francesco",""],["Baccigalupi","Carlo",""],["Lapi","Andrea",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 18:00:02 GMT"}],"updateDate":"2024-07-15","timestamp":1720720802000,"abstract":"  The chameleon screening mechanism has been constrained many a time using\ndynamic and kinematic galaxy cluster observables. Current constraints are,\nhowever, insensitive to different mass components within galaxy clusters and\nhave been mainly focused on a single mass density profile, the\nNavarro-Frenk-While mass density model. In this work, we extend the study of\nthe Chameleon screening mechanism in galaxy clusters by considering a series of\nmass density models, namely: generalized-Navarro-Frenk-While,\nb-Navarro-Frenk-While, Burket, Isothermal and Einasto. The coupling strength\n($\\beta$) and asymptotic value of the chameleon field ($\\phi_\\infty$) are\nconstrained by using kinematics analyses of simulated galaxy clusters,\ngenerated both assuming General Relativity and a strong chameleon scenario. By\nimplementing a Bayesian analysis we comprehensively show that the biases\nintroduced due to an incorrect assumption of the mass model are minimal.\nSimilarly, we also demonstrate that a spurious detection of evidence for\nmodifications to gravity is highly unlikely when utilizing the kinematics of\ngalaxy clusters.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7HuyMg44zK6hPexO58l9XFbDv7URG029jFt4qG7ix08","pdfSize":"3463063"}
