{"id":"2407.02420","title":"Geophysical Observations of the 24 September 2023 OSIRIS-REx Sample\n  Return Capsule Re-Entry","authors":"Elizabeth A. Silber, Daniel C. Bowman, Chris G. Carr, David P.\n  Eisenberg, Brian R. Elbing, Benjamin Fernando, Milton A. Garc\\'es, Robert\n  Haaser, Siddharth Krishnamoorthy, Charles A. Langston, Yasuhiro Nishikawa,\n  Jeremy Webster, Jacob F. Anderson, Stephen Arrowsmith, Sonia Bazargan, Luke\n  Beardslee, Brant Beck, Jordan W. Bishop, Philip Blom, Grant Bracht, David L.\n  Chichester, Anthony Christe, Kenneth Cummins, James Cutts, Lisa Danielson,\n  Carly Donahue, Kenneth Eack, Michael Fleigle, Douglas Fox, Ashish Goel, David\n  Green, Yuta Hasumi, Chris Hayward, Dan Hicks, Jay Hix, Stephen Horton, Emalee\n  Hough, David P. Huber, Madeline A. Hunt, Jennifer Inman, S. M. Ariful Islam,\n  Jacob Izraelevitz, Jamey D. Jacob, Jacob Clarke, James Johnson, Real J. KC,\n  Attila Komjathy, Eric Lam, Justin LaPierre, Kevin Lewis, Richard D. Lewis,\n  Patrick Liu, L\\'eo Martire, Meaghan McCleary, Elisa A. McGhee, Ipsita Mitra,\n  Amitabh Nag, Luis Ocampo Giraldo, Karen Pearson, Mathieu Plaisir, Sarah K.\n  Popenhagen, Hamid Rassoul, Miro Ronac Giannone, Mirza Samnani, Nicholas\n  Schmerr, Kate Spillman, Girish Srinivas, Samuel K. Takazawa, Alex Tempert,\n  Reagan Turley, Cory Van Beek, Lo\\\"ic Viens, Owen A. Walsh, Nathan Weinstein,\n  Robert White, Brian Williams, Trevor C. Wilson, Shirin Wyckoff, Masa-yuki\n  Yamamoto, Zachary Yap, Tyler Yoshiyama, Cleat Zeiler","authorsParsed":[["Silber","Elizabeth A.",""],["Bowman","Daniel C.",""],["Carr","Chris G.",""],["Eisenberg","David P.",""],["Elbing","Brian R.",""],["Fernando","Benjamin",""],["Garcés","Milton A.",""],["Haaser","Robert",""],["Krishnamoorthy","Siddharth",""],["Langston","Charles A.",""],["Nishikawa","Yasuhiro",""],["Webster","Jeremy",""],["Anderson","Jacob F.",""],["Arrowsmith","Stephen",""],["Bazargan","Sonia",""],["Beardslee","Luke",""],["Beck","Brant",""],["Bishop","Jordan W.",""],["Blom","Philip",""],["Bracht","Grant",""],["Chichester","David L.",""],["Christe","Anthony",""],["Cummins","Kenneth",""],["Cutts","James",""],["Danielson","Lisa",""],["Donahue","Carly",""],["Eack","Kenneth",""],["Fleigle","Michael",""],["Fox","Douglas",""],["Goel","Ashish",""],["Green","David",""],["Hasumi","Yuta",""],["Hayward","Chris",""],["Hicks","Dan",""],["Hix","Jay",""],["Horton","Stephen",""],["Hough","Emalee",""],["Huber","David P.",""],["Hunt","Madeline A.",""],["Inman","Jennifer",""],["Islam","S. M. Ariful",""],["Izraelevitz","Jacob",""],["Jacob","Jamey D.",""],["Clarke","Jacob",""],["Johnson","James",""],["KC","Real J.",""],["Komjathy","Attila",""],["Lam","Eric",""],["LaPierre","Justin",""],["Lewis","Kevin",""],["Lewis","Richard D.",""],["Liu","Patrick",""],["Martire","Léo",""],["McCleary","Meaghan",""],["McGhee","Elisa A.",""],["Mitra","Ipsita",""],["Nag","Amitabh",""],["Giraldo","Luis Ocampo",""],["Pearson","Karen",""],["Plaisir","Mathieu",""],["Popenhagen","Sarah K.",""],["Rassoul","Hamid",""],["Giannone","Miro Ronac",""],["Samnani","Mirza",""],["Schmerr","Nicholas",""],["Spillman","Kate",""],["Srinivas","Girish",""],["Takazawa","Samuel K.",""],["Tempert","Alex",""],["Turley","Reagan",""],["Van Beek","Cory",""],["Viens","Loïc",""],["Walsh","Owen A.",""],["Weinstein","Nathan",""],["White","Robert",""],["Williams","Brian",""],["Wilson","Trevor C.",""],["Wyckoff","Shirin",""],["Yamamoto","Masa-yuki",""],["Yap","Zachary",""],["Yoshiyama","Tyler",""],["Zeiler","Cleat",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 16:44:59 GMT"}],"updateDate":"2024-07-03","timestamp":1719938699000,"abstract":"  Sample Return Capsules (SRCs) entering Earth's atmosphere at hypervelocity\nfrom interplanetary space are a valuable resource for studying meteor\nphenomena. The 24 September 2023 arrival of the OSIRIS-REx (Origins, Spectral\nInterpretation, Resource Identification, and Security-Regolith Explorer) SRC\nprovided an unprecedented chance for geophysical observations of a\nwell-characterized source with known parameters, including timing and\ntrajectory. A collaborative effort involving researchers from 16 institutions\nexecuted a carefully planned geophysical observational campaign at\nstrategically chosen locations, deploying over 400 ground-based sensors\nencompassing infrasound, seismic, distributed acoustic sensing (DAS), and GPS\ntechnologies. Additionally, balloons equipped with infrasound sensors were\nlaunched to capture signals at higher altitudes. This campaign (the largest of\nits kind so far) yielded a wealth of invaluable data anticipated to fuel\nscientific inquiry for years to come. The success of the observational campaign\nis evidenced by the near-universal detection of signals across instruments,\nboth proximal and distal. This paper presents a comprehensive overview of the\ncollective scientific effort, field deployment, and preliminary findings. The\nearly findings have the potential to inform future space missions and\nterrestrial campaigns, contributing to our understanding of meteoroid\ninteractions with planetary atmospheres. Furthermore, the dataset collected\nduring this campaign will improve entry and propagation models as well as\naugment the study of atmospheric dynamics and shock phenomena generated by\nmeteoroids and similar sources.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}