{"id":"2407.06150","title":"PanDORA: Casual HDR Radiance Acquisition for Indoor Scenes","authors":"Mohammad Reza Karimi Dastjerdi, Fr\\'ed\\'eric Fortier-Chouinard,\n  Yannick Hold-Geoffroy, Marc H\\'ebert, Claude Demers, Nima Kalantari,\n  Jean-Fran\\c{c}ois Lalonde","authorsParsed":[["Dastjerdi","Mohammad Reza Karimi",""],["Fortier-Chouinard","Frédéric",""],["Hold-Geoffroy","Yannick",""],["Hébert","Marc",""],["Demers","Claude",""],["Kalantari","Nima",""],["Lalonde","Jean-François",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 17:22:27 GMT"}],"updateDate":"2024-07-09","timestamp":1720459347000,"abstract":"  Most novel view synthesis methods such as NeRF are unable to capture the true\nhigh dynamic range (HDR) radiance of scenes since they are typically trained on\nphotos captured with standard low dynamic range (LDR) cameras. While the\ntraditional exposure bracketing approach which captures several images at\ndifferent exposures has recently been adapted to the multi-view case, we find\nsuch methods to fall short of capturing the full dynamic range of indoor\nscenes, which includes very bright light sources. In this paper, we present\nPanDORA: a PANoramic Dual-Observer Radiance Acquisition system for the casual\ncapture of indoor scenes in high dynamic range. Our proposed system comprises\ntwo 360{\\deg} cameras rigidly attached to a portable tripod. The cameras\nsimultaneously acquire two 360{\\deg} videos: one at a regular exposure and the\nother at a very fast exposure, allowing a user to simply wave the apparatus\ncasually around the scene in a matter of minutes. The resulting images are fed\nto a NeRF-based algorithm that reconstructs the scene's full high dynamic\nrange. Compared to HDR baselines from previous work, our approach reconstructs\nthe full HDR radiance of indoor scenes without sacrificing the visual quality\nwhile retaining the ease of capture from recent NeRF-like approaches.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}