{"id":"2407.16266","title":"Beyond Binary Gender: Evaluating Gender-Inclusive Machine Translation\n  with Ambiguous Attitude Words","authors":"Yijie Chen, Yijin Liu, Fandong Meng, Jinan Xu, Yufeng Chen and Jie\n  Zhou","authorsParsed":[["Chen","Yijie",""],["Liu","Yijin",""],["Meng","Fandong",""],["Xu","Jinan",""],["Chen","Yufeng",""],["Zhou","Jie",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 08:13:51 GMT"}],"updateDate":"2024-07-24","timestamp":1721722431000,"abstract":"  Gender bias has been a focal point in the study of bias in machine\ntranslation and language models. Existing machine translation gender bias\nevaluations are primarily focused on male and female genders, limiting the\nscope of the evaluation. To assess gender bias accurately, these studies often\nrely on calculating the accuracy of gender pronouns or the masculine and\nfeminine attributes of grammatical gender via the stereotypes triggered by\noccupations or sentiment words ({\\em i.e.}, clear positive or negative\nattitude), which cannot extend to non-binary groups. This study presents a\nbenchmark AmbGIMT (Gender-Inclusive Machine Translation with Ambiguous attitude\nwords), which assesses gender bias beyond binary gender. Meanwhile, we propose\na novel process to evaluate gender bias based on the Emotional Attitude Score\n(EAS), which is used to quantify ambiguous attitude words. In evaluating three\nrecent and effective open-source LLMs and one powerful multilingual\ntranslation-specific model, our main observations are: (1) The translation\nperformance within non-binary gender contexts is markedly inferior in terms of\ntranslation quality and exhibits more negative attitudes than binary-gender\ncontexts. (2) The analysis experiments indicate that incorporating constraint\ncontext in prompts for gender identity terms can substantially reduce\ntranslation bias, while the bias remains evident despite the presence of the\nconstraints. The code is publicly available at\n\\url{https://github.com/pppa2019/ambGIMT}.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}