{"id":"2407.19099","title":"Sponsored is the New Organic: Implications of Sponsored Results on\n  Quality of Search Results in the Amazon Marketplace","authors":"Abhisek Dash, Saptarshi Ghosh, Animesh Mukherjee, Abhijnan\n  Chakraborty, Krishna P. Gummadi","authorsParsed":[["Dash","Abhisek",""],["Ghosh","Saptarshi",""],["Mukherjee","Animesh",""],["Chakraborty","Abhijnan",""],["Gummadi","Krishna P.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 21:33:57 GMT"}],"updateDate":"2024-07-30","timestamp":1722029637000,"abstract":"  Interleaving sponsored results (advertisements) amongst organic results on\nsearch engine result pages (SERP) has become a common practice across multiple\ndigital platforms. Advertisements have catered to consumer satisfaction and\nfostered competition in digital public spaces; making them an appealing gateway\nfor businesses to reach their consumers. However, especially in the context of\ndigital marketplaces, due to the competitive nature of the sponsored results\nwith the organic ones, multiple unwanted repercussions have surfaced affecting\ndifferent stakeholders. From the consumers' perspective the sponsored\nads/results may cause degradation of search quality and nudge consumers to\npotentially irrelevant and costlier products. The sponsored ads may also affect\nthe level playing field of the competition in the marketplaces among sellers.\nTo understand and unravel these potential concerns, we analyse the Amazon\ndigital marketplace in four different countries by simulating 4,800 search\noperations. Our analyses over SERPs consisting 2M organic and 638K sponsored\nresults show items with poor organic ranks (beyond 100th position) appear as\nsponsored results even before the top organic results on the first page of\nAmazon SERP. Moreover, we also observe that in majority of the cases, these top\nsponsored results are costlier and are of poorer quality than the top organic\nresults. We believe these observations can motivate researchers for further\ndeliberation to bring in more transparency and guard rails in the advertising\npractices followed in digital marketplaces.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}