{"id":"2407.20356","title":"Homomorphic data compression for real time photon correlation analysis","authors":"Sebastian Strempfer, Zichao Wendy Di, Kazutomo Yoshii, Yue Cao,\n  Qingteng Zhang, Eric M. Dufresne, Mathew Cherukara, Suresh Narayanan, Martin\n  V. Holt, Antonino Miceli, Tao Zhou","authorsParsed":[["Strempfer","Sebastian",""],["Di","Zichao Wendy",""],["Yoshii","Kazutomo",""],["Cao","Yue",""],["Zhang","Qingteng",""],["Dufresne","Eric M.",""],["Cherukara","Mathew",""],["Narayanan","Suresh",""],["Holt","Martin V.",""],["Miceli","Antonino",""],["Zhou","Tao",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:14:50 GMT"}],"updateDate":"2024-07-31","timestamp":1722276890000,"abstract":"  The construction of highly coherent x-ray sources has enabled new research\nopportunities across the scientific landscape. The maximum raw data rate per\nbeamline now exceeds 40 GB/s, posing unprecedented challenges for the online\nprocessing and offline storage of the big data. Such challenge is particularly\nprominent for x-ray photon correlation spectroscopy (XPCS), where real time\nanalyses require simultaneous calculation on all the previously acquired data\nin the time series. We present a homomorphic compression scheme to effectively\nreduce the computational time and memory space required for XPCS analysis.\nLeveraging similarities in the mathematical expression between a matrix-based\ncompression algorithm and the correlation calculation, our approach allows\ndirect operation on the compressed data without their decompression. The lossy\ncompression reduces the computational time by a factor of 10,000, enabling real\ntime calculation of the correlation functions at kHz framerate. Our\ndemonstration of a homomorphic compression of scientific data provides an\neffective solution to the big data challenge at coherent light sources. Beyond\nthe example shown in this work, the framework can be extended to facilitate\nreal-time operations directly on a compressed data stream for other techniques.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Physics/Data Analysis, Statistics and Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}