{"id":"2407.04183","title":"Seeing Like an AI: How LLMs Apply (and Misapply) Wikipedia Neutrality\n  Norms","authors":"Joshua Ashkinaze, Ruijia Guan, Laura Kurek, Eytan Adar, Ceren Budak,\n  Eric Gilbert","authorsParsed":[["Ashkinaze","Joshua",""],["Guan","Ruijia",""],["Kurek","Laura",""],["Adar","Eytan",""],["Budak","Ceren",""],["Gilbert","Eric",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 23:05:58 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 14:07:07 GMT"},{"version":"v3","created":"Sat, 14 Sep 2024 21:28:20 GMT"}],"updateDate":"2024-09-17","timestamp":1720134358000,"abstract":"  Large language models (LLMs) are trained on broad corpora and then used in\ncommunities with specialized norms. Is providing LLMs with community rules\nenough for models to follow these norms? We evaluate LLMs' capacity to detect\n(Task 1) and correct (Task 2) biased Wikipedia edits according to Wikipedia's\nNeutral Point of View (NPOV) policy. LLMs struggled with bias detection,\nachieving only 64% accuracy on a balanced dataset. Models exhibited contrasting\nbiases (some under- and others over-predicted bias), suggesting distinct priors\nabout neutrality. LLMs performed better at generation, removing 79% of words\nremoved by Wikipedia editors. However, LLMs made additional changes beyond\nWikipedia editors' simpler neutralizations, resulting in high-recall but\nlow-precision editing. Interestingly, crowdworkers rated AI rewrites as more\nneutral (70%) and fluent (61%) than Wikipedia-editor rewrites. Qualitative\nanalysis found LLMs sometimes applied NPOV more comprehensively than Wikipedia\neditors but often made extraneous non-NPOV-related changes (such as grammar).\nLLMs may apply rules in ways that resonate with the public but diverge from\ncommunity experts. While potentially effective for generation, LLMs may reduce\neditor agency and increase moderation workload (e.g., verifying additions).\nEven when rules are easy to articulate, having LLMs apply them like community\nmembers may still be difficult.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}