{"id":"2407.10962","title":"Benchmarking neutrino interaction models via a comparative analysis of\n  kinematic imbalance measurements from the T2K, MicroBooNE and MINERvA\n  experiments","authors":"Wissal Filali, Laura Munteanu, Stephen Dolan","authorsParsed":[["Filali","Wissal",""],["Munteanu","Laura",""],["Dolan","Stephen",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:57:03 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 17:04:00 GMT"}],"updateDate":"2024-07-22","timestamp":1721066223000,"abstract":"  Recent neutrino-nucleus cross-section measurements of observables\ncharacterising kinematic imbalance from the T2K, MicroBooNE and MINERvA\nexperiments are used to benchmark predictions from widely used neutrino\ninteraction event generators. Given the different neutrino energy spectra and\nnuclear targets employed by the three experiments, comparisons of model\npredictions to their measurements breaks degeneracies that would be present in\nany single measurement. In particular, the comparison of T2K and MINERvA\nmeasurements offers a probe of energy dependence, whilst a comparison of T2K\nand MicroBooNE investigates scaling with nuclear target. In order to isolate\nthe impact of individual nuclear effects, model comparisons are made following\nsystematic alterations to: the nuclear ground state; final state interactions\nand multi-nucleon interaction strength. The measurements are further compared\nto the generators used as an input to DUNE/SBN and T2K/Hyper-K analyses. Whilst\nno model is able to quantitatively describe all the measurements, evidence is\nfound for mis-modelling of A-scaling in multi-nucleon interactions and it is\nfound that tight control over how energy is distributed among hadrons following\nfinal state interactions is likely to be crucial to achieving improved\nagreement. Overall, this work provides a novel characterisation of neutrino\ninteractions whilst offering guidance for refining existing generator\npredictions.\n","subjects":["Physics/High Energy Physics - Experiment","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"a25Gj-WGeugvZJ-dyTJuBVp1UGlkp62YabkYuxXloa0","pdfSize":"4864206"}
