{"id":"2407.06312","title":"Limits and Powers of Koopman Learning","authors":"Matthew J. Colbrook, Igor Mezi\\'c, Alexei Stepanenko","authorsParsed":[["Colbrook","Matthew J.",""],["Mezić","Igor",""],["Stepanenko","Alexei",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:24:48 GMT"}],"updateDate":"2024-07-10","timestamp":1720463088000,"abstract":"  Dynamical systems provide a comprehensive way to study complex and changing\nbehaviors across various sciences. Many modern systems are too complicated to\nanalyze directly or we do not have access to models, driving significant\ninterest in learning methods. Koopman operators have emerged as a dominant\napproach because they allow the study of nonlinear dynamics using linear\ntechniques by solving an infinite-dimensional spectral problem. However,\ncurrent algorithms face challenges such as lack of convergence, hindering\npractical progress. This paper addresses a fundamental open question:\n\\textit{When can we robustly learn the spectral properties of Koopman operators\nfrom trajectory data of dynamical systems, and when can we not?} Understanding\nthese boundaries is crucial for analysis, applications, and designing\nalgorithms. We establish a foundational approach that combines computational\nanalysis and ergodic theory, revealing the first fundamental barriers --\nuniversal for any algorithm -- associated with system geometry and complexity,\nregardless of data quality and quantity. For instance, we demonstrate\nwell-behaved smooth dynamical systems on tori where non-trivial eigenfunctions\nof the Koopman operator cannot be determined by any sequence of (even\nrandomized) algorithms, even with unlimited training data. Additionally, we\nidentify when learning is possible and introduce optimal algorithms with\nverification that overcome issues in standard methods. These results pave the\nway for a sharp classification theory of data-driven dynamical systems based on\nhow many limits are needed to solve a problem. These limits characterize all\nprevious methods, presenting a unified view. Our framework systematically\ndetermines when and how Koopman spectral properties can be learned.\n","subjects":["Mathematics/Dynamical Systems","Computing Research Repository/Machine Learning","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis","Mathematics/Optimization and Control","Mathematics/Spectral Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}