{"id":"2407.05261","title":"Disciplined Geodesically Convex Programming","authors":"Andrew Cheng, Vaibhav Dixit and Melanie Weber","authorsParsed":[["Cheng","Andrew",""],["Dixit","Vaibhav",""],["Weber","Melanie",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 05:13:51 GMT"}],"updateDate":"2024-07-09","timestamp":1720329231000,"abstract":"  Convex programming plays a fundamental role in machine learning, data\nscience, and engineering. Testing convexity structure in nonlinear programs\nrelies on verifying the convexity of objectives and constraints.\n\\citet{grant2006disciplined} introduced a framework, Disciplined Convex\nProgramming (DCP), for automating this verification task for a wide range of\nconvex functions that can be decomposed into basic convex functions (atoms)\nusing convexity-preserving compositions and transformations (rules). However,\nthe restriction to Euclidean convexity concepts can limit the applicability of\nthe framework. For instance, many notable instances of statistical estimators\nand matrix-valued (sub)routines in machine learning applications are Euclidean\nnon-convex, but exhibit geodesic convexity through a more general Riemannian\nlens. In this work, we extend disciplined programming to this setting by\nintroducing Disciplined Geodesically Convex Programming (DGCP). We determine\nconvexity-preserving compositions and transformations for geodesically convex\nfunctions on general Cartan-Hadamard manifolds, as well as for the special case\nof symmetric positive definite matrices, a common setting in matrix-valued\noptimization. For the latter, we also define a basic set of atoms. Our paper is\naccompanied by a Julia package SymbolicAnalysis.jl, which provides\nfunctionality for testing and certifying DGCP-compliant expressions. Our\nlibrary interfaces with manifold optimization software, which allows for\ndirectly solving verified geodesically convex programs.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Machine Learning","Computing Research Repository/Mathematical Software","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kJL07J598piE5IIzLI4aPzVqeJFSZXDeQD9bIbljups","pdfSize":"763952"}
