{"id":"2407.12266","title":"An emission state switching radio transient with a 54 minute period","authors":"M. Caleb, E. Lenc, D. L. Kaplan, T. Murphy, Y. P. Men, R. M. Shannon,\n  L. Ferrario, K. M. Rajwade, T. E. Clarke, S. Giacintucci, N. Hurley-Walker,\n  S. D. Hyman, M. E. Lower, Sam McSweeney, V. Ravi, E. D. Barr, S. Buchner, C.\n  M. L. Flynn, J. W. T. Hessels, M. Kramer, J. Pritchard and B. W. Stappers","authorsParsed":[["Caleb","M.",""],["Lenc","E.",""],["Kaplan","D. L.",""],["Murphy","T.",""],["Men","Y. P.",""],["Shannon","R. M.",""],["Ferrario","L.",""],["Rajwade","K. M.",""],["Clarke","T. E.",""],["Giacintucci","S.",""],["Hurley-Walker","N.",""],["Hyman","S. D.",""],["Lower","M. E.",""],["McSweeney","Sam",""],["Ravi","V.",""],["Barr","E. D.",""],["Buchner","S.",""],["Flynn","C. M. L.",""],["Hessels","J. W. T.",""],["Kramer","M.",""],["Pritchard","J.",""],["Stappers","B. W.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 02:33:04 GMT"}],"updateDate":"2024-07-18","timestamp":1721183584000,"abstract":"  Long-period radio transients are an emerging class of extreme astrophysical\nevents of which only three are known. These objects emit highly polarised,\ncoherent pulses of typically a few tens of seconds duration and minutes to\nhour-long periods. While magnetic white dwarfs and magnetars, either isolated\nor in binary systems, have been invoked to explain these objects, a consensus\nhas not emerged. Here we report on the discovery of ASKAP J193505.1+214841.0\n(henceforth ASKAPJ1935+2148) with a period of 53.8 minutes exhibiting three\ndistinct emission states - a bright pulse state with highly linearly polarised\npulses with widths of 10-50 seconds; a weak pulse state which is about 26 times\nfainter than the bright state with highly circularly polarised pulses of widths\nof approximately 370 milliseconds; and a quiescent or quenched state with no\npulses. The first two states have been observed to progressively evolve over\nthe course of 8 months with the quenched state interspersed between them\nsuggesting physical changes in the region producing the emission. A constraint\non the radius of the source for the observed period rules out a magnetic white\ndwarf origin. Unlike other long-period sources, ASKAPJ1935+2148 is the first to\nexhibit drastic variations in emission modes reminiscent of neutron stars.\nHowever, its radio properties challenge our current understanding of neutron\nstar emission and evolution.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}