{"id":"2407.21040","title":"Towards Automated Data Sciences with Natural Language and SageCopilot:\n  Practices and Lessons Learned","authors":"Yuan Liao, Jiang Bian, Yuhui Yun, Shuo Wang, Yubo Zhang, Jiaming Chu,\n  Tao Wang, Kewei Li, Yuchen Li, Xuhong Li, Shilei Ji, Haoyi Xiong","authorsParsed":[["Liao","Yuan",""],["Bian","Jiang",""],["Yun","Yuhui",""],["Wang","Shuo",""],["Zhang","Yubo",""],["Chu","Jiaming",""],["Wang","Tao",""],["Li","Kewei",""],["Li","Yuchen",""],["Li","Xuhong",""],["Ji","Shilei",""],["Xiong","Haoyi",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 08:58:18 GMT"}],"updateDate":"2024-08-01","timestamp":1721552298000,"abstract":"  While the field of NL2SQL has made significant advancements in translating\nnatural language instructions into executable SQL scripts for data querying and\nprocessing, achieving full automation within the broader data science pipeline\n- encompassing data querying, analysis, visualization, and reporting - remains\na complex challenge. This study introduces SageCopilot, an advanced,\nindustry-grade system system that automates the data science pipeline by\nintegrating Large Language Models (LLMs), Autonomous Agents (AutoAgents), and\nLanguage User Interfaces (LUIs). Specifically, SageCopilot incorporates a\ntwo-phase design: an online component refining users' inputs into executable\nscripts through In-Context Learning (ICL) and running the scripts for results\nreporting & visualization, and an offline preparing demonstrations requested by\nICL in the online phase. A list of trending strategies such as Chain-of-Thought\nand prompt-tuning have been used to augment SageCopilot for enhanced\nperformance. Through rigorous testing and comparative analysis against\nprompt-based solutions, SageCopilot has been empirically validated to achieve\nsuperior end-to-end performance in generating or executing scripts and offering\nresults with visualization, backed by real-world datasets. Our in-depth\nablation studies highlight the individual contributions of various components\nand strategies used by SageCopilot to the end-to-end correctness for data\nsciences.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Databases","Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}