{"id":"2407.18527","title":"Integration of Quantum Accelerators into HPC: Toward a Unified Quantum\n  Platform","authors":"Amr Elsharkawy, Xiaorang Guo, Martin Schulz","authorsParsed":[["Elsharkawy","Amr",""],["Guo","Xiaorang",""],["Schulz","Martin",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 06:17:09 GMT"}],"updateDate":"2024-07-29","timestamp":1721974629000,"abstract":"  To harness the power of quantum computing (QC) in the near future, tight and\nefficient integration of QC with high performance computing (HPC)\ninfrastructure (both on the software (SW) and the hardware (HW) level) is\ncrucial. This paper addresses the development of a unified quantum platform\n(UQP) and how it is being integrated into the HPC ecosystem. It builds on the\nconcepts of hybrid high performance computing - quantum computing (HPCQC)\nworkflows and a unified HPCQC toolchain, introduced in our previous work and\nmakes the next needed step: it unifies the low-level interface between the\nexisting classical HPC systems and the emerging quantum hardware technologies,\nincluding but not limited to machines based on superconducting qubits, neutral\natoms or trapped ions. The UQP consists of three core components: a runtime\nlibrary, an instruction set architecture (ISA) and a quantum control processor\n(QCP) micro-architecture. In particular, this work contributes a unified HPCQC\nruntime library that bridges the gap between programming systems built on\nquantum intermediate representation (QIR) standard with a novel, unified hybrid\nISA. It then introduces the initial extension of an ISA and QCP\nmicro-architecture to be platform and technology agnostic and enables it as an\nefficient execution platform. The UQP has been verified to ensure correctness.\nFurther, our performance analysis shows that the execution time and memory\nrequirements of the runtime library scale super-linearly with number of qubits,\nwhich is critical to support scalability efforts in QC hardware.\n","subjects":["Computing Research Repository/Emerging Technologies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}