{"id":"2407.17761","title":"Towards the Blockchain Massive Adoption with Permissionless Storage","authors":"Jia Kan","authorsParsed":[["Kan","Jia",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 04:28:52 GMT"}],"updateDate":"2024-07-26","timestamp":1721881732000,"abstract":"  Blockchain technology emerged with the advent of Bitcoin and rapidly\ndeveloped over the past few decades, becoming widely accepted and known by the\npublic. However, in the past decades, the massive adoption of blockchain\ntechnology has yet to come. Rather than the scalability issue, the blockchain\napplication is challenged by its expensive usage cost. However, the high cost\nof blockchain usage is deeply connected with the blockchain consensus and\nsecurity mechanism. The permissionless blockchain must maintain its high cost\nfor security against the 51% Attack. Chain users indirectly cover the cost as\ncoins are appointed for blockchain usage fees. This conflict prevents the\nmassive adoption of blockchain. Thus, blockchain must be improved to solve\nthose problems: 1. The cost of blockchain usage should be low enough. 2. The\nblockchain should remain decentralized. 3. The scalability of blockchain must\nmeet the demand.\n  In my thesis, new approaches are applied to solve the issues above. The key\ncontribution is the discovery of the useful PoW. It extends the Nakamoto PoW\nwith another usage of file data encoding during the same Nakamoto Consensus\ncomputation to prove honest data preservation. Based on this theory, a\npermissionless storage network is proposed as the new security engine for the\nblockchain. It bridges the high blockchain security cost to the storage users\nwith real demands who are willing to pay for the storage resource. On the other\nhand, the chain users can benefit from the low transaction fee. Meanwhile, we\nalso provide a scalability solution to shard the blockchain. It enables high\nTPS and keeps decentralization. The solutions in this thesis provide the\nanswers to all the dependencies of the massive adoption.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}