{"id":"2407.04100","title":"C$^3$DG: Conditional Domain Generalization for Hyperspectral Imagery\n  Classification with Convergence and Constrained-risk Theories","authors":"Zhe Gao, Bin Pan, Zhenwei Shi","authorsParsed":[["Gao","Zhe",""],["Pan","Bin",""],["Shi","Zhenwei",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 18:03:45 GMT"}],"updateDate":"2024-07-08","timestamp":1720116225000,"abstract":"  Hyperspectral imagery (HSI) classification may suffer the challenge of\nhyperspectral-monospectra, where different classes present similar spectra.\nJoint spatial-spectral feature extraction is a popular solution for the\nproblem, but this strategy tends to inflate accuracy since test pixels may\nexist in training patches. Domain generalization methods show promising\npotential, but they still fail to distinguish similar spectra across varying\ndomains, in addition, the theoretical support is usually ignored. In this\npaper, we only rely on spectral information to solve the\nhyperspectral-monospectra problem, and propose a Convergence and\nError-Constrained Conditional Domain Generalization method for Hyperspectral\nImagery Classification (C$^3$DG). The major contributions of this paper include\ntwo aspects: the Conditional Revising Inference Block (CRIB), and the\ncorresponding theories for model convergence and generalization errors. CRIB is\nthe kernel structure of the proposed method, which employs a shared encoder and\nmulti-branch decoders to fully leverage the conditional distribution during\ntraining, achieving a decoupling that aligns with the generation mechanisms of\nHSI. Moreover, to ensure model convergence and maintain controllable error, we\npropose the optimization convergence theorem and risk upper bound theorem. In\nthe optimization convergence theorem, we ensure the model convergence by\ndemonstrating that the gradients of the loss terms are not contradictory. In\nthe risk upper bound theorem, our theoretical analysis explores the\nrelationship between test-time training and recent related work to establish a\nconcrete bound for error. Experimental results on three benchmark datasets\nindicate the superiority of C$^3$DG.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}