{"id":"2407.10773","title":"Quantifying distribution system resilience from utility data: large\n  event risk and benefits of investments","authors":"Arslan Ahmad, Ian Dobson","authorsParsed":[["Ahmad","Arslan",""],["Dobson","Ian",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 14:54:08 GMT"},{"version":"v2","created":"Sat, 20 Jul 2024 14:46:47 GMT"}],"updateDate":"2024-07-23","timestamp":1721055248000,"abstract":"  We focus on large blackouts in electric distribution systems caused by\nextreme winds. Such events have a large cost and impact on customers. To\nquantify resilience to these events, we formulate large event risk and show how\nto calculate it from the historical outage data routinely collected by\nutilities' outage management systems. Risk is defined using an event cost\nexceedance curve. The tail of this curve and the large event risk is described\nby the probability of a large cost event and the slope magnitude of the tail on\na log-log plot. Resilience can be improved by planned investments to upgrade\nsystem components or speed up restoration. The benefits that these investments\nwould have had if they had been made in the past can be quantified by\n\"rerunning history\" with the effects of the investment included, and then\nrecalculating the large event risk to find the improvement in resilience. An\nexample using utility data shows a 12% and 22% reduction in the probability of\na large cost event due to 10% wind hardening and 10% faster restoration\nrespectively. This new data-driven approach to quantify resilience and\nresilience investments is realistic and much easier to apply than complicated\napproaches based on modeling all the phases of resilience. Moreover, an appeal\nto improvements to past lived experience may well be persuasive to customers\nand regulators in making the case for resilience investments.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control","Quantitative Finance/Risk Management","Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}