{"id":"2407.20745","title":"Broadband THz wave generation and detection in organic crystal PNPA at\n  MHz repetition rates","authors":"Lukasz A. Sterczewski, Jakub Mnich, Jaroslaw Sotor","authorsParsed":[["Sterczewski","Lukasz A.",""],["Mnich","Jakub",""],["Sotor","Jaroslaw",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 11:29:30 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 16:04:45 GMT"}],"updateDate":"2024-08-07","timestamp":1722338970000,"abstract":"  Organic nonlinear optical (NLO) crystals have emerged as efficient\nroom-temperature emitters of broadband THz radiation with high electric field\nstrengths. Although initially confined to high-pulse-energy excitation in the\nmillijoule range with kHz rates, recent efforts have focused on tailoring the\nphysical properties of organic NLO materials for compatibility with popular\nMHz-rate telecommunication wavelength lasers emitting nanojoule energy pulses.\nThis is motivated by the large potential of such crystals for more portable and\nuser-safe spectroscopic systems, additionally complemented by their\nroom-temperature field-sensitive THz detection capabilities. In this work, we\ndemonstrate the MHz-rate operation of the organic crystal PNPA\n((E)-4-((4-nitrobenzylidene)amino)-$N$-phenylaniline), which was recently\ndiscovered through data mining algorithms and reported to surpass the\nconversion efficiency of rivaling NLO crystals at 1 kHz repetition rate. Using\na compact 200 mW Er:fiber laser producing 18 fs pulses at 50 MHz repetition\nrate, we demonstrate the THz field generation and detection capabilities of\nPNPA via performing gas phase spectroscopy in the 1.3-8.5 THz range. We obtain\na dynamic range of 40 dB over 3.6 s and 70 dB over 2 hours. Our work extends\nthe family of organic crystals compatible with telecommunication-wavelength\nexcitation using nJ pulses for spectroscopy beyond 5 THz.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"TxvP-_otkTorq7WqTonoQLtZDsAdY225yJra2OsuKyQ","pdfSize":"1449272"}
