{"id":"2407.17661","title":"ACACIAS I: Element abundance labels for 192 stars in the dwarf galaxy\n  NGC 6822","authors":"Melissa K. Ness, J. Trevor Mendel, Sven Buder, Adam Wheeler, Alexander\n  P. Ji, Luka Mijnarends, Kim Venn, Else Starkenburg, Ryan Leaman, Kathryn\n  Grasha, Sarah Aquilina","authorsParsed":[["Ness","Melissa K.",""],["Mendel","J. Trevor",""],["Buder","Sven",""],["Wheeler","Adam",""],["Ji","Alexander P.",""],["Mijnarends","Luka",""],["Venn","Kim",""],["Starkenburg","Else",""],["Leaman","Ryan",""],["Grasha","Kathryn",""],["Aquilina","Sarah",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 22:10:40 GMT"}],"updateDate":"2024-07-26","timestamp":1721859040000,"abstract":"  The element abundances of local group galaxies connect enrichment mechanisms\nto galactic properties and serve to contextualise the Milky Way's abundance\ndistributions. Individual stellar spectra in nearby galaxies can be extracted\nfrom Integral Field Unit (IFU) data, and provide a means to take an abundance\ncensus of the local group. We introduce a program that leverages $R=1800$,\n$\\mathrm{SNR}=15$, IFU resolved spectra from the Multi Unit Spectroscopic\nExplorer (MUSE). We deploy the data-driven modelling approach for labelling\nstellar spectra with stellar parameters and abundances, of The Cannon, on\nresolved stars in NGC 6822. We construct our model for The Cannon using\n$\\approx$19,000 Milky Way LAMOST spectra with APOGEE labels. We report six\ninferred abundance labels (denoted $\\ell_\\mathrm{X}$), for 192 NGC 6822 disk\nstars, precise to $\\approx$$0.15$ dex. We validate our generated spectral\nmodels provide a good fit the data, including at individual atomic line\nfeatures. We infer mean abundances of $\\ell_\\mathrm{[Fe/H]} = -0.90 \\pm 0.03$,\n$\\ell_\\mathrm{[Mg/Fe]} = -0.01 \\pm 0.01$, $\\ell_\\mathrm{[Mn/Fe]} = -0.22 \\pm\n0.02$, $\\ell_\\mathrm{[Al/Fe]} = -0.33 \\pm 0.03$, $\\ell_\\mathrm{[C/Fe]} =-0.43\n\\pm 0.03$, $\\ell_\\mathrm{[N/Fe]} =0.18 \\pm 0.03$. These abundance labels are\nsimilar to dwarf galaxies observed by APOGEE, and the lower enhancements for\nNGC 6822 compared to the Milky Way are consistent with expectations. This\napproach supports a new era in extra-galactic archaeology of characterising the\nlocal group enrichment diversity using low-resolution, low-SNR IFU resolved\nspectra.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}