{"id":"2407.03488","title":"Failures of Compositionality: A Short Note on Cohomology, Sheafification\n  and Lavish Presheaves","authors":"Benjamin Merlin Bumpus, Matteo Capucci, James Fairbanks, Daniel Rosiak","authorsParsed":[["Bumpus","Benjamin Merlin",""],["Capucci","Matteo",""],["Fairbanks","James",""],["Rosiak","Daniel",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 20:31:59 GMT"}],"updateDate":"2024-07-08","timestamp":1720038719000,"abstract":"  In many sciences one often builds large systems out of smaller constituent\nparts. Mathematically, to study these systems, one can attach data to the\ncomponent pieces via a functor F. This is of great practical use if F admits a\ncompositional structure which is compatible with that of the system under study\n(i.e. if the local data defined on the pieces can be combined into global\ndata). However, sometimes this does not occur. Thus one can ask: (1) Does F\nfail to be compositional? (2) If so, can this failure be quantified? and (3)\nAre there general tools to fix failures of compositionality? The kind of\ncompositionality we study in this paper is one in which one never fails to\ncombine local data into global data. This is formalized via the understudied\nnotion of what we call a lavish presheaf: one that satisfies the existence\nrequirement of the sheaf condition, but not uniqueness. Adapting \\v{C}ech\ncohomology to presheaves, we show that a presheaf has trivial zeroth\npresheaf-\\v{C}ech cohomology if and only if it is lavish. In this light,\ncohomology is a measure of the failure of compositionality. The key\ncontribution of this paper is to show that, in some instances, cohomology can\nitself display compositional structure. Formally, we show that, given any\nAbelian presheaf F : C^op --> A and any Grothendieck pretopology J, if F is\nflasque and separated, then the zeroth cohomology functor H^0(-,F) : C^op --> A\nis lavish. This follows from observation that, for separated presheaves,\nH^0(-,F) can be written as a cokernel of the unit of the adjunction given by\nsheafification. This last fact is of independent interest since it shows that\ncohomology is a measure of ``distance'' between separated presheaves and their\nclosest sheaves (their sheafifications). On the other hand, the fact that\nH^0(-,F) is a lavish presheaf has unexpected algorithmic consequences.\n","subjects":["Mathematics/Commutative Algebra","Mathematics/Category Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}