{"id":"2407.21286","title":"Large-scale Epidemiological modeling: Scanning for Mosquito-Borne\n  Diseases Spatio-temporal Patterns in Brazil","authors":"Eduardo C. Araujo, Claudia T. Code\\c{c}o, Sandro Loch, Lu\\~a B.\n  Vacaro, La\\'is P. Freitas, Raquel M. Lana, Leonardo S. Bastos, Iasmim F. de\n  Almeida, Fernanda Valente, Luiz M. Carvalho, and Fl\\'avio C. Coelho","authorsParsed":[["Araujo","Eduardo C.",""],["Codeço","Claudia T.",""],["Loch","Sandro",""],["Vacaro","Luã B.",""],["Freitas","Laís P.",""],["Lana","Raquel M.",""],["Bastos","Leonardo S.",""],["de Almeida","Iasmim F.",""],["Valente","Fernanda",""],["Carvalho","Luiz M.",""],["Coelho","Flávio C.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 02:20:48 GMT"}],"updateDate":"2024-08-01","timestamp":1722392448000,"abstract":"  The influence of climate on mosquito-borne diseases like dengue and\nchikungunya is well-established, but comprehensively tracking long-term spatial\nand temporal trends across large areas has been hindered by fragmented data and\nlimited analysis tools. This study presents an unprecedented analysis, in terms\nof breadth, estimating the SIR transmission parameters from incidence data in\nall 5,570 municipalities in Brazil over 14 years (2010-2023) for both dengue\nand chikungunya. We describe the Episcanner computational pipeline, developed\nto estimate these parameters, producing a reusable dataset describing all\ndengue and chikungunya epidemics that have taken place in this period, in\nBrazil. The analysis reveals new insights into the climate-epidemic nexus: We\nidentify distinct geographical and temporal patterns of arbovirus disease\nincidence across Brazil, highlighting how climatic factors like temperature and\nprecipitation influence the timing and intensity of dengue and chikungunya\nepidemics. The innovative Episcanner tool empowers researchers and public\nhealth officials to explore these patterns in detail, facilitating targeted\ninterventions and risk assessments. This research offers a new perspective on\nthe long-term dynamics of climate-driven mosquito-borne diseases and their\ngeographical specificities linked to the effects of global temperature\nfluctuations such as those captured by the ENSO index.\n","subjects":["Quantitative Biology/Populations and Evolution","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Xqizcfx8Dn10AHLPDVpusjoirkXJ7-4cGeAkgSJAyLw","pdfSize":"10767764"}
