{"id":"2407.01020","title":"Rapid cargo verification with cosmic ray muon scattering and absorption\n  tomography","authors":"Anzori Sh. Georgadze","authorsParsed":[["Georgadze","Anzori Sh.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 07:11:41 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 08:18:15 GMT"}],"updateDate":"2024-07-30","timestamp":1719817901000,"abstract":"  Cosmic ray muon tomography is considered a promising method for the\nnon-invasive inspection of shipping containers and trucks. It utilizes highly\npenetrating cosmic-ray muons and their interactions with various materials to\ngenerate three-dimensional images of large and dense, like inter-modal shipping\ncontainers, typically not transparent with conventional X-ray radiography\ntechnique. The commonly used methods for imaging with muons are based on muon\nscattering or absorption-transmission data analysis. Due to large thickness of\ncargo material in shipping container substantial scattering and absorption\noccur when muons passing through cargo.\n  One of the key tasks of customs and border security is to verify shipping\ncontainer declarations to prevent illegal trafficking, and muon tomography\ncould be a viable choice for this task. In this paper, we demonstrate through\nMonte Carlo simulations using the GEANT4 toolkit that a combined analysis of\nmuon scattering and absorption data can improve the identification of cargo\nmaterials compared to using scattering or absorption data alone. The\nstatistical differences in scattering and absorption data for several cargo\nmaterials are quantified. For a particular smuggling scenario where tobacco\ndeclared as paper towel rolls, it is demonstrated that the combined analysis\ncan accurately distinguish between tobacco and paper towel rolls with\n5.5$\\sigma$ accuracy for detector spatial resolution (FWHM) of 0.235 mm,\n4.5$\\sigma$ for 1.175 mm resolution (FWHM), and 3.5$\\sigma$ accuracy for 2.35\nmm spatial resolution (FWHM), in a short scanning time of 10 seconds. This\nrapid detection capability has significant implications for anti-smuggling\nefforts and cargo inspection.\n","subjects":["Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}