{"id":"2407.17204","title":"The Questionable Influence of Entanglement in Quantum Optimisation\n  Algorithms","authors":"Tobias Rohe, Dani\\\"elle Schuman, Jonas N\\\"u{\\ss}lein, Leo S\\\"unkel,\n  Jonas Stein, Claudia Linnhoff-Popien","authorsParsed":[["Rohe","Tobias",""],["Schuman","Daniëlle",""],["Nüßlein","Jonas",""],["Sünkel","Leo",""],["Stein","Jonas",""],["Linnhoff-Popien","Claudia",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 12:04:00 GMT"}],"updateDate":"2024-07-25","timestamp":1721822640000,"abstract":"  The performance of the Variational Quantum Eigensolver (VQE) is promising\ncompared to other quantum algorithms, but also depends significantly on the\nappropriate design of the underlying quantum circuit. Recent research by\nBowles, Ahmend \\& Schuld, 2024 [1] raises questions about the effectiveness of\nentanglement in circuits for quantum machine learning algorithms. In our paper\nwe want to address questions about the effectiveness of state preparation via\nHadamard gates and entanglement via CNOT gates in the realm of quantum\noptimisation. We have constructed a total of eight different circuits, varying\nin implementation details, solving a total of 100 randomly generated MaxCut\nproblems. Our results show no improvement with Hadamard gates applied at the\nbeginning of the circuits. Furthermore, also entanglement shows no positive\neffect on the solution quality in our small scale experiments. In contrast, the\ninvestigated circuits that used entanglement generally showed lower, as well as\ndeteriorating results when the number of circuit layers is increased. Based on\nour results, we hypothesise that entanglement can play a coordinating role,\nsuch that changes in individual parameters are distributed across multiple\nqubits in quantum circuits, but that this positive effect can quickly be\noverdosed and turned negative. The verification of this hypothesis represents a\nchallenge for future research and can have a considerable influence on the\ndevelopment of new hybrid algorithms.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AwuUjYq-c5HkkvmPYe81yUs4qnpvoax5uW1f6xUgl4c","pdfSize":"440754"}
