{"id":"2407.05123","title":"Irregular Fixation II: The orbits of irregular satellites","authors":"Evgeni Grishin","authorsParsed":[["Grishin","Evgeni",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 16:17:12 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 09:36:37 GMT"}],"updateDate":"2024-07-18","timestamp":1720282632000,"abstract":"  Irregular satellites (IS) are believed to have been captured during the Solar\nsystem's dynamical history and provide clues for the Solar system's formation\nand evolution. IS occupy a large fraction of the Hill sphere of their host\nplanet and their orbits are highly perturbed by the Sun. We use a novel\nformalism developed in paper I to characterise their orbits in terms of an\neffective secular Hamiltonian (the Brown Hamiltonian) that accounts for their\nlarge orbital separations. We find that prograde satellites generally follow\nthe Brown Hamiltonian, while retrograde satellites (which extend further)\ndeviate more significantly. Nevertheless, the phase portrait is much better\ndescribed by the Brown Hamiltonian for all satellites. We construct a\nsemi-analytic criterion that predicts the librating orbit based on the\neffective energy due to the Brown Hamiltonian. We also check our results with\nhighly accurate N-body integrations of satellite orbits, where initial\nconditions are loaded directly from the updated ephemeris from the NASA\nHorizons database. Although the retrograde librating orbits occupy more area in\nthe parameter space, the vast majority of librating IS are prograde. Using our\nmethod we find $13$ librating satellites, $8$ of them previously known to\nlibrate, and the rest shown to librate for the first time. Further observations\nof existing and new satellites could shed more light on the dynamical history\nof the Solar system and satellite formation and test our results.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics","Mathematics/Dynamical Systems"],"license":"http://creativecommons.org/licenses/by/4.0/"}