{"id":"2407.13500","title":"FADE: A Task-Agnostic Upsampling Operator for Encoder-Decoder\n  Architectures","authors":"Hao Lu, Wenze Liu, Hongtao Fu, Zhiguo Cao","authorsParsed":[["Lu","Hao",""],["Liu","Wenze",""],["Fu","Hongtao",""],["Cao","Zhiguo",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 13:32:36 GMT"}],"updateDate":"2024-07-19","timestamp":1721309556000,"abstract":"  The goal of this work is to develop a task-agnostic feature upsampling\noperator for dense prediction where the operator is required to facilitate not\nonly region-sensitive tasks like semantic segmentation but also\ndetail-sensitive tasks such as image matting. Prior upsampling operators often\ncan work well in either type of the tasks, but not both. We argue that\ntask-agnostic upsampling should dynamically trade off between semantic\npreservation and detail delineation, instead of having a bias between the two\nproperties. In this paper, we present FADE, a novel, plug-and-play,\nlightweight, and task-agnostic upsampling operator by fusing the assets of\ndecoder and encoder features at three levels: i) considering both the encoder\nand decoder feature in upsampling kernel generation; ii) controlling the\nper-point contribution of the encoder/decoder feature in upsampling kernels\nwith an efficient semi-shift convolutional operator; and iii) enabling the\nselective pass of encoder features with a decoder-dependent gating mechanism\nfor compensating details. To improve the practicality of FADE, we additionally\nstudy parameter- and memory-efficient implementations of semi-shift\nconvolution. We analyze the upsampling behavior of FADE on toy data and show\nthrough large-scale experiments that FADE is task-agnostic with consistent\nperformance improvement on a number of dense prediction tasks with little extra\ncost. For the first time, we demonstrate robust feature upsampling on both\nregion- and detail-sensitive tasks successfully. Code is made available at:\nhttps://github.com/poppinace/fade\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}