{"id":"2407.17715","title":"Differential equations and recursive solutions for cosmological\n  amplitudes","authors":"Song He, Xuhang Jiang, Jiahao Liu, Qinglin Yang and Yao-Qi Zhang","authorsParsed":[["He","Song",""],["Jiang","Xuhang",""],["Liu","Jiahao",""],["Yang","Qinglin",""],["Zhang","Yao-Qi",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 02:28:45 GMT"}],"updateDate":"2024-07-26","timestamp":1721874525000,"abstract":"  Recently considerable efforts have been devoted to computing cosmological\ncorrelators and the corresponding wavefunction coefficients, as well as\nunderstanding their analytical structures. In this note, we revisit the\ncomputation of these ``cosmological amplitudes\" associated with any tree or\nloop graph for conformal scalars with time-dependent interactions in the\npower-law FRW universe, directly in terms of iterated time integrals. We start\nby decomposing any such cosmological amplitude (for loop graph, the\n``integrand\" prior to loop integrations) as a linear combination of {\\it basic\ntime integrals}, one for each {\\it directed graph}. We derive remarkably simple\nfirst-order differential equations involving such time integrals with edges\n``contracted\" one at a time, which can be solved recursively and the solution\ntakes the form of Euler-Mellin integrals/generalized hypergeometric functions.\nBy combining such equations, we then derive a complete system of differential\nequations for all time integrals needed for a given graph. Our method works for\nany graph: for a tree graph with $n$ nodes, this system can be transformed into\nthe {\\it canonical differential equations} of size $4^{n{-}1}$ quivalent to the\ngraphic rules derived recently%so-called ``kinematic flow\", and we also derive\nthe system of differential equations for loop integrands {\\it e.g.} of all-loop\ntwo-site graphs and one-loop $n$-gon graphs. Finally, we show how the\ndifferential equations truncate for the de Sitter (dS) case (in a way similar\nto differential equations for Feynman integrals truncate for integer\ndimensions), which immediately yields the complete symbol for the dS amplitude\nwith interesting structures {\\it e.g.} for $n$-site chains and $n$-gon cases.\n","subjects":["Physics/High Energy Physics - Theory","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}