{"id":"2407.16194","title":"First Direct Search for Light Dark Matter Using the NEON Experiment at a\n  Nuclear Reactor","authors":"J. J. Choi, C. Ha, E. J. Jeon, J. Y. Kim, K. W. Kim, S. H. Kim, S. K.\n  Kim, Y. D. Kim, Y. J. Ko, B. C. Koh, S. H. Lee, I. S. Lee, H. Lee, H. S. Lee,\n  J. S. Lee, Y. M. Oh, and B. J. Park","authorsParsed":[["Choi","J. J.",""],["Ha","C.",""],["Jeon","E. J.",""],["Kim","J. Y.",""],["Kim","K. W.",""],["Kim","S. H.",""],["Kim","S. K.",""],["Kim","Y. D.",""],["Ko","Y. J.",""],["Koh","B. C.",""],["Lee","S. H.",""],["Lee","I. S.",""],["Lee","H.",""],["Lee","H. S.",""],["Lee","J. S.",""],["Oh","Y. M.",""],["Park","B. J.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 05:39:53 GMT"}],"updateDate":"2024-07-24","timestamp":1721713193000,"abstract":"  We report new results from the Neutrino Elastic Scattering Observation with\nNaI (NEON) experiment in the search for light dark matter (LDM) using 2,636\nkg$\\cdot$days of NaI(Tl) exposure. The experiment employs an array of NaI(Tl)\ncrystals with a total mass of 16.7 kg, located 23.7 meters away from a 2.8 GW\nthermal power nuclear reactor. We investigated LDM produced by the\n$\\textit{invisible decay}$ of dark photons generated by high-flux photons\nduring reactor operation. The energy spectra collected during reactor-on and\nreactor-off periods were compared within the LDM signal region of $1-10$ keV.\nNo signal consistent with LDM interaction with electrons was observed, allowing\nus to set 90% confidence level exclusion limits for the dark matter-electron\nscattering cross-section ($\\sigma_e$) across dark matter masses ranging from 1\nkeV/c$^2$ to 1 MeV/c$^2$. Our results set a 90% confidence level upper limit of\n$\\sigma_e = 3.17\\times10^{-35}~\\mathrm{cm^2}$ for a dark matter mass of 100\nkeV/c$^2$, marking the best laboratory result in this mass range. Additionally,\nour search extends the coverage of LDM below 100 keV/c$^2$ first time.\n","subjects":["Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bAZC0vNOyTiNOUVXiAuxxHHg73nMPU2AONHjtOPg7j4","pdfSize":"416717"}
