{"id":"2407.04565","title":"Super-resolution imaging of nanoscale inhomogeneities in hBN-covered and\n  encapsulated few-layer graphene","authors":"Lina J\\\"ackering, Konstantin G. Wirth, Lukas Conrads, Jonas B. Profe,\n  Alexander Rothstein, Hristiyana Kyoseva, Kenji Watanabe, Takashi Taniguchi,\n  Dante M. Kennes, Christoph Stampfer, Lutz Waldecker, Thomas Taubner","authorsParsed":[["Jäckering","Lina",""],["Wirth","Konstantin G.",""],["Conrads","Lukas",""],["Profe","Jonas B.",""],["Rothstein","Alexander",""],["Kyoseva","Hristiyana",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Kennes","Dante M.",""],["Stampfer","Christoph",""],["Waldecker","Lutz",""],["Taubner","Thomas",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 14:56:49 GMT"},{"version":"v2","created":"Mon, 8 Jul 2024 14:52:18 GMT"}],"updateDate":"2024-07-09","timestamp":1720191409000,"abstract":"  Encapsulating few-layer graphene (FLG) in hexagonal boron nitride (hBN) can\ncause nanoscale inhomogeneities in the FLG, including changes in stacking\ndomains and topographic defects. Due to the diffraction limit, characterizing\nthese inhomogeneities is challenging. Recently, the visualization of stacking\ndomains in encapsulated four-layer graphene (4LG) has been demonstrated with\nphonon polariton (PhP)-assisted near-field imaging. However, the underlying\ncoupling mechanism and ability to image subdiffractional-sized inhomogeneities\nremain unknown. Here, we retrieve direct replicas and magnified images of\nsubdiffractional-sized inhomogeneities in hBN-covered trilayer graphene (TLG)\nand encapsulated 4LG, enabled by the hyperlensing effect. This hyperlensing\neffect is mediated by hBN's hyperbolic PhP that couple to the FLG's plasmon\npolaritons. Using near-field microscopy, we identify the coupling by\ndetermining the polariton dispersion in hBN-covered TLG to be\nstacking-dependent. Our work demonstrates super-resolution and magnified\nimaging of inhomogeneities, paving the way for the realization of homogeneous\nencapsulated FLG transport samples to study correlated physics.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}