{"id":"2407.17805","title":"Resistance standards with calculable, nearly negligible AC-DC difference\n  at frequencies up to 2 MHz for the calibration of precision LCR meters","authors":"J\\\"urgen Schurr, Rolf H. Judaschke and Shakil A. Awan","authorsParsed":[["Schurr","Jürgen",""],["Judaschke","Rolf H.",""],["Awan","Shakil A.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 06:24:17 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 10:41:14 GMT"},{"version":"v3","created":"Thu, 15 Aug 2024 04:54:43 GMT"}],"updateDate":"2024-08-16","timestamp":1721888657000,"abstract":"  We have developed novel impedance standards based on thin-film\nsurface-mount-device (SMD) resistors. Due to the small dimensions of such\nresistors, the quantities determining their frequency dependence are very small\nand can be either measured or numerically calculated. A series connection of\nthin-film SMD resistors allows us to further improve the DC and the AC\nproperties. The nominal resistance value of our application is 12.906 kohm but\nother values are just as possible. At frequencies up to 2 MHz, the calculated\nfrequency dependence amounts to only a few parts per million of the DC value,\nwhich is about four orders of magnitude smaller than for all conventional\ncalculable AC-DC resistors having a similar nominal DC value. To measure the\nfrequency dependence, we use a precision inductance-capacitance-resistance\n(LCR) meter at frequencies up to 2 MHz that has a reproducibility of a few\nparts per million but a systematic uncertainty which is specified by the\nmanufacturer to increase from 300 parts per million in the lower frequency\nrange to 3000 parts per million at 2 MHz. Measurements of two very different\nSMD-based resistance standards allow verification of the model calculation as\nwell as the calibration of the precision LCR meter, both with a relative\nuncertainty of a few parts per million in the whole frequency range. This boost\nin precision enables new applications in this frequency range such as the\nverification of conventional calculable resistance standards, the calibration\nof impedance standards, and future measurements of the quantum Hall resistance.\n","subjects":["Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_dAO41Rh39c_KlIx0k5i0mrcEAjExiiCNU39Ob3-zc8","pdfSize":"1651945"}
