{"id":"2407.16532","title":"Propulsion Contribution from Individual Filament in Flagellar Bundle","authors":"Jin Zhu, Yateng Qiao, Lingchun Yan, Yan Zeng, Yibo Wu, Hongyi Bian,\n  Yidi Huang, Yuxin Ye, Yingyue Huang, Russell Hii Ching Wei, Yinuo Teng,\n  Yunlong Guo, Gaojin Li, Zijie Qu","authorsParsed":[["Zhu","Jin",""],["Qiao","Yateng",""],["Yan","Lingchun",""],["Zeng","Yan",""],["Wu","Yibo",""],["Bian","Hongyi",""],["Huang","Yidi",""],["Ye","Yuxin",""],["Huang","Yingyue",""],["Wei","Russell Hii Ching",""],["Teng","Yinuo",""],["Guo","Yunlong",""],["Li","Gaojin",""],["Qu","Zijie",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:44:05 GMT"}],"updateDate":"2024-07-24","timestamp":1721745845000,"abstract":"  Flagellated microorganisms overcome the low-Reynolds-number time\nreversibility by rotating helical flagella. For peritrichous bacteria, such as\nEscherichia coli, the randomly distributed flagellar filaments align along the\nsame direction to form a bundle, facilitating complex locomotive strategies. To\nunderstand the process of flagella bundling, especially the propulsion force,\nwe develop a multi-functional macroscopic experimental system and employ\nadvanced numerical simulations for verification. Flagella arrangements and\nphase differences between helices are investigated, revealing the variation in\npropulsion contribution from the individual helix. Numerically, we build a\ntime-dependent model to match the bundling process and study the influence of\nhydrodynamic interactions. Surprisingly, it is found that the total propulsion\ngenerated by a bundle of two filaments is constant at various phase differences\nbetween the helices. However, the difference between the propulsion from each\nhelix is significantly affected by the phase difference, and only one of the\nhelices is responsible for the total propulsion at a phase difference equals to\npi. Through our experimental and computational results, we provide a new model\nconsidering the propulsion contribution of each filament to better understand\nmicrobial locomotion mechanisms, especially on the wobbling behavior of the\ncell. Our work also sheds light on the design and control of artificial\nmicroswimmers.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}