{"id":"2407.20885","title":"Early Planet Formation in Embedded Disks (eDisk) XVI: An asymmetric dust\n  disk driving a multi-component molecular outflow in the young Class 0\n  protostar GSS30 IRS3","authors":"Alejandro Santamaria-Miranda, Itziar de Gregorio-Monsalvo, Nagayoshi\n  Ohashi, John J. Tobin, Jinshi Sai, Jes K. Jorgensen, Yusuke Aso, Zhe-Yu\n  Daniel Lin, Christian Flores, Miyu Kido, Patrick M. Koch, Woojin Kwon, Chang\n  Won Lee, Zhi-Yun Li, Leslie W. Looney, Adele L. Plunkett, Shigehisa Takakuwa,\n  Merel L.R van t Hoff, Jonathan P. Williams, and Hsi-Wei Yen","authorsParsed":[["Santamaria-Miranda","Alejandro",""],["de Gregorio-Monsalvo","Itziar",""],["Ohashi","Nagayoshi",""],["Tobin","John J.",""],["Sai","Jinshi",""],["Jorgensen","Jes K.",""],["Aso","Yusuke",""],["Lin","Zhe-Yu Daniel",""],["Flores","Christian",""],["Kido","Miyu",""],["Koch","Patrick M.",""],["Kwon","Woojin",""],["Lee","Chang Won",""],["Li","Zhi-Yun",""],["Looney","Leslie W.",""],["Plunkett","Adele L.",""],["Takakuwa","Shigehisa",""],["Hoff","Merel L. R van t",""],["Williams","Jonathan P.",""],["Yen","Hsi-Wei",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 15:00:04 GMT"}],"updateDate":"2024-07-31","timestamp":1722351604000,"abstract":"  We present the results of the ALMA Large Program Early Planet Formation in\nEmbedded disks observations of the Class 0 protostar GSS30 IRS3. Our\nobservations included 1.3 mm continuum with a resolution of 0.''05 (7.8 au) and\nseveral molecular species including $^{12}$CO, $^{13}$CO, C$^{18}$O, H$_{2}$CO\nand c-C$_{3}$H$_{2}$. The dust continuum analysis unveiled a disk-shaped\nstructure with a major axis size of $\\sim$200 au. We observed an asymmetry in\nthe minor axis of the continuum emission suggesting that the emission is\noptically thick and the disk is flared. On the other hand, we identified two\nprominent bumps along the major axis located at distances of 26 and 50 au from\nthe central protostar. The origin of the bumps remains uncertain and might be\ndue to an embedded substructure within the disk or the result of the\ntemperature distribution instead of surface density due to optically thick\ncontinuum emission. The $^{12}$CO emission reveals a molecular outflow\nconsisting of three distinct components: a collimated one, an intermediate\nvelocity component exhibiting an hourglass shape, and a wider angle\nlow-velocity component. We associate these components with the coexistence of a\njet and a disk-wind. The C$^{18}$O emission traces both a Keplerian rotating\ncircumstellar disk and the infall of the rotating envelope. We measured a\nstellar dynamical mass of 0.35$\\pm$0.09 M$_{\\odot}$.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}