{"id":"2407.14396","title":"Machine learning meets the CHSH scenario","authors":"Gabriel Pereira Alves, Nicolas Gigena and J\\k{e}drzej Kaniewski","authorsParsed":[["Alves","Gabriel Pereira",""],["Gigena","Nicolas",""],["Kaniewski","Jędrzej",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:16:31 GMT"}],"updateDate":"2024-07-22","timestamp":1721402191000,"abstract":"  In this work, we perform a comprehensive study of the machine learning (ML)\nmethods for the purpose of characterising the quantum set of correlations. As\nour main focus is on assessing the usefulness and effectiveness of the ML\napproach, we focus exclusively on the CHSH scenario, both the 4-dimensional\nvariant, for which an analytical solution is known, and the 8-dimensional\nvariant, for which no analytical solution is known, but numerical approaches\nare relatively well understood. We consider a wide selection of approaches,\nranging from simple data science models to dense neural networks. The two\nclasses of models that perform well are support vector machines and dense\nneural networks, and they are the main focus of this work. We conclude that\nwhile it is relatively easy to achieve good performance on average, it is hard\nto train a model that performs well on the \"hard\" cases, i.e., points in the\nvicinity of the boundary of the quantum set. Sadly, these are precisely the\ncases which are interesting from the academic point of view. In order to\nimprove performance on hard cases one must, especially for the 8-dimensional\nproblem, resort to a tailored choice of training data, which means that we are\nimplicitly feeding our intuition and biases into the model. We feel that this\nis an important and often overlooked aspect of applying ML models to academic\nproblems, where data generation or data selection is performed according to\nsome implicit subjective criteria. In this way, it is possible to unconsciously\nsteer our model, so that it exhibits features that we are interested in seeing.\nHence, special care must be taken while determining whether ML methods can be\nconsidered objective and unbiased in the context of academic problems.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}