{"id":"2407.03042","title":"Impact of Large-Scale Structure Formation on the Global Information\n  Budget","authors":"Suman Sarkar","authorsParsed":[["Sarkar","Suman",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 12:06:59 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 06:34:45 GMT"}],"updateDate":"2024-08-28","timestamp":1720008419000,"abstract":"  This paper offers an original theoretical framework to quantify the\ninformation content associated with cosmological structure formation. By taking\ninto account the growth in perturbations for the matter density field, we are\nable to calculate the relative reduction in the information entropy from the\nprojection for a fully homogeneous setting. An analytical study is carried out\nto track back the evolution of global information content up to $z=20$, where a\nlog-normal density distribution with redshift-dependent variance, skewness, and\nkurtosis is used to mimic the observable Universe. We report a $0.004\\%$ drop\nin the information entropy of the Universe, that is caused by the formation of\nlarge-scale structures in the present universe. The accelerated expansion of\nthe Universe is suspected as a countermeasure by nature to override the\nexponential growth in this entropic drop. We also analyse how the scale factor,\nexpansion rate and growth rate of structure formation are connected with the\nentropic drop, taking the $\\Lambda CDM$ model into account. The formalism is\nfurther developed and employed to study the spectrum of information underlying\nthe galaxy distribution in the observable Universe. Using data from SDSS DR18\nwe also quantify the information sharing across different parts of the studied\nvolume. An attempt to validate the assumption of cosmic homogeneity is made,\nwhich rules out the presence of a Universal scale of uniformity below 130\n$h^{-1}$ Mpc.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}