{"id":"2407.10589","title":"The Medium is the Message: How Secure Messaging Apps Leak Sensitive Data\n  to Push Notification Services","authors":"Nikita Samarin, Alex Sanchez, Trinity Chung, Akshay Dan Bhavish\n  Juleemun, Conor Gilsenan, Nick Merrill, Joel Reardon, and Serge Egelman","authorsParsed":[["Samarin","Nikita",""],["Sanchez","Alex",""],["Chung","Trinity",""],["Juleemun","Akshay Dan Bhavish",""],["Gilsenan","Conor",""],["Merrill","Nick",""],["Reardon","Joel",""],["Egelman","Serge",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 10:13:30 GMT"}],"updateDate":"2024-07-16","timestamp":1721038410000,"abstract":"  Like most modern software, secure messaging apps rely on third-party\ncomponents to implement important app functionality. Although this practice\nreduces engineering costs, it also introduces the risk of inadvertent privacy\nbreaches due to misconfiguration errors or incomplete documentation. Our\nresearch investigated secure messaging apps' usage of Google's Firebase Cloud\nMessaging (FCM) service to send push notifications to Android devices. We\nanalyzed 21 popular secure messaging apps from the Google Play Store to\ndetermine what personal information these apps leak in the payload of push\nnotifications sent via FCM. Of these apps, 11 leaked metadata, including user\nidentifiers (10 apps), sender or recipient names (7 apps), and phone numbers (2\napps), while 4 apps leaked the actual message content. Furthermore, none of the\ndata we observed being leaked to FCM was specifically disclosed in those apps'\nprivacy disclosures. We also found several apps employing strategies to\nmitigate this privacy leakage to FCM, with varying levels of success. Of the\nstrategies we identified, none appeared to be common, shared, or\nwell-supported. We argue that this is fundamentally an economics problem:\nincentives need to be correctly aligned to motivate platforms and SDK providers\nto make their systems secure and private by default.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}