{"id":"2407.01481","title":"LLload: Simplifying Real-Time Job Monitoring for HPC Users","authors":"Chansup Byun, Julia Mullen, Albert Reuther, William Arcand, William\n  Bergeron, David Bestor, Daniel Burrill, Vijay Gadepally, Michael Houle,\n  Matthew Hubbell, Hayden Jananthan, Michael Jones, Peter Michaleas, Guillermo\n  Morales, Andrew Prout, Antonio Rosa, Charles Yee, Jeremy Kepner, and Lauren\n  Milechin","authorsParsed":[["Byun","Chansup",""],["Mullen","Julia",""],["Reuther","Albert",""],["Arcand","William",""],["Bergeron","William",""],["Bestor","David",""],["Burrill","Daniel",""],["Gadepally","Vijay",""],["Houle","Michael",""],["Hubbell","Matthew",""],["Jananthan","Hayden",""],["Jones","Michael",""],["Michaleas","Peter",""],["Morales","Guillermo",""],["Prout","Andrew",""],["Rosa","Antonio",""],["Yee","Charles",""],["Kepner","Jeremy",""],["Milechin","Lauren",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 17:11:43 GMT"}],"updateDate":"2024-07-02","timestamp":1719853903000,"abstract":"  One of the more complex tasks for researchers using HPC systems is\nperformance monitoring and tuning of their applications. Developing a practice\nof continuous performance improvement, both for speed-up and efficient use of\nresources is essential to the long term success of both the HPC practitioner\nand the research project. Profiling tools provide a nice view of the\nperformance of an application but often have a steep learning curve and rarely\nprovide an easy to interpret view of resource utilization. Lower level tools\nsuch as top and htop provide a view of resource utilization for those familiar\nand comfortable with Linux but a barrier for newer HPC practitioners. To expand\nthe existing profiling and job monitoring options, the MIT Lincoln Laboratory\nSupercomputing Center created LLoad, a tool that captures a snapshot of the\nresources being used by a job on a per user basis. LLload is a tool built from\nstandard HPC tools that provides an easy way for a researcher to track resource\nusage of active jobs. We explain how the tool was designed and implemented and\nprovide insight into how it is used to aid new researchers in developing their\nperformance monitoring skills as well as guide researchers in their resource\nrequests.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Performance"],"license":"http://creativecommons.org/licenses/by/4.0/"}