{"id":"2407.05726","title":"Gait Patterns as Biomarkers: A Video-Based Approach for Classifying\n  Scoliosis","authors":"Zirui Zhou, Junhao Liang, Zizhao Peng, Chao Fan, Fengwei An, Shiqi Yu","authorsParsed":[["Zhou","Zirui",""],["Liang","Junhao",""],["Peng","Zizhao",""],["Fan","Chao",""],["An","Fengwei",""],["Yu","Shiqi",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 08:29:02 GMT"},{"version":"v2","created":"Tue, 9 Jul 2024 08:19:24 GMT"},{"version":"v3","created":"Fri, 23 Aug 2024 18:09:55 GMT"}],"updateDate":"2024-08-27","timestamp":1720427342000,"abstract":"  Scoliosis presents significant diagnostic challenges, particularly in\nadolescents, where early detection is crucial for effective treatment.\nTraditional diagnostic and follow-up methods, which rely on physical\nexaminations and radiography, face limitations due to the need for clinical\nexpertise and the risk of radiation exposure, thus restricting their use for\nwidespread early screening. In response, we introduce a novel video-based,\nnon-invasive method for scoliosis classification using gait analysis,\neffectively circumventing these limitations. This study presents Scoliosis1K,\nthe first large-scale dataset specifically designed for video-based scoliosis\nclassification, encompassing over one thousand adolescents. Leveraging this\ndataset, we developed ScoNet, an initial model that faced challenges in\nhandling the complexities of real-world data. This led to the development of\nScoNet-MT, an enhanced model incorporating multi-task learning, which\ndemonstrates promising diagnostic accuracy for practical applications. Our\nfindings demonstrate that gait can serve as a non-invasive biomarker for\nscoliosis, revolutionizing screening practices through deep learning and\nsetting a precedent for non-invasive diagnostic methodologies. The dataset and\ncode are publicly available at https://zhouzi180.github.io/Scoliosis1K/.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}