{"id":"2407.15718","title":"Integrating AI Tutors in a Programming Course","authors":"Iris Ma, Alberto Krone Martins, Cristina Videira Lopes","authorsParsed":[["Ma","Iris",""],["Martins","Alberto Krone",""],["Lopes","Cristina Videira",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 00:42:39 GMT"}],"updateDate":"2024-07-23","timestamp":1720917759000,"abstract":"  RAGMan is an LLM-powered tutoring system that can support a variety of\ncourse-specific and homework-specific AI tutors. RAGMan leverages Retrieval\nAugmented Generation (RAG), as well as strict instructions, to ensure the\nalignment of the AI tutors' responses. By using RAGMan's AI tutors, students\nreceive assistance with their specific homework assignments without directly\nobtaining solutions, while also having the ability to ask general\nprogramming-related questions.\n  RAGMan was deployed as an optional resource in an introductory programming\ncourse with an enrollment of 455 students. It was configured as a set of five\nhomework-specific AI tutors. This paper describes the interactions the students\nhad with the AI tutors, the students' feedback, and a comparative grade\nanalysis. Overall, about half of the students engaged with the AI tutors, and\nthe vast majority of the interactions were legitimate homework questions. When\nstudents posed questions within the intended scope, the AI tutors delivered\naccurate responses 98% of the time. Within the students used AI tutors, 78%\nreported that the tutors helped their learning. Beyond AI tutors' ability to\nprovide valuable suggestions, students reported appreciating them for fostering\na safe learning environment free from judgment.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Information Retrieval","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"v17ePpwPYZDDPiNeWojDlXZqB5HVnlVAFYaiOIbZszc","pdfSize":"519942"}
