{"id":"2407.10125","title":"When Pedestrian Detection Meets Multi-Modal Learning: Generalist Model\n  and Benchmark Dataset","authors":"Yi Zhang, Wang Zeng, Sheng Jin, Chen Qian, Ping Luo, Wentao Liu","authorsParsed":[["Zhang","Yi",""],["Zeng","Wang",""],["Jin","Sheng",""],["Qian","Chen",""],["Luo","Ping",""],["Liu","Wentao",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 09:16:49 GMT"}],"updateDate":"2024-07-16","timestamp":1720948609000,"abstract":"  Recent years have witnessed increasing research attention towards pedestrian\ndetection by taking the advantages of different sensor modalities (e.g. RGB,\nIR, Depth, LiDAR and Event). However, designing a unified generalist model that\ncan effectively process diverse sensor modalities remains a challenge. This\npaper introduces MMPedestron, a novel generalist model for multimodal\nperception. Unlike previous specialist models that only process one or a pair\nof specific modality inputs, MMPedestron is able to process multiple modal\ninputs and their dynamic combinations. The proposed approach comprises a\nunified encoder for modal representation and fusion and a general head for\npedestrian detection. We introduce two extra learnable tokens, i.e. MAA and\nMAF, for adaptive multi-modal feature fusion. In addition, we construct the\nMMPD dataset, the first large-scale benchmark for multi-modal pedestrian\ndetection. This benchmark incorporates existing public datasets and a newly\ncollected dataset called EventPed, covering a wide range of sensor modalities\nincluding RGB, IR, Depth, LiDAR, and Event data. With multi-modal joint\ntraining, our model achieves state-of-the-art performance on a wide range of\npedestrian detection benchmarks, surpassing leading models tailored for\nspecific sensor modality. For example, it achieves 71.1 AP on COCO-Persons and\n72.6 AP on LLVIP. Notably, our model achieves comparable performance to the\nInternImage-H model on CrowdHuman with 30x smaller parameters. Codes and data\nare available at https://github.com/BubblyYi/MMPedestron.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"s8sMjJ-t7Wk7ymRMSZtIKXkz-rSHC9c-Ygonu7ecBNs","pdfSize":"25635116"}
