{"id":"2407.19019","title":"Eight Years of Light from ASASSN-15oi: Towards Understanding the\n  Late-time Evolution of TDEs","authors":"A. Hajela (U. of Copenhagen), K. D. Alexander, R. Margutti, R.\n  Chornock, M. Bietenholz, C. T. Christy, M. Stroh, G. Terreran, R. Saxton, S.\n  Komossa, J. S. Bright, E. Ramirez-Ruiz, D. L. Coppejans, J. K. Leung, Y.\n  Cendes, E. Wiston, T. Laskar, A. Horesh, G. Schroeder, Nayana A. J., M. H.\n  Wieringa, N. Velez, E. Berger, P. K. Blanchard, T. Eftekhari, S. Gomez, M.\n  Nicholl, H. Sears, and B. A. Zauderer","authorsParsed":[["Hajela","A.","","U. of Copenhagen"],["Alexander","K. D.",""],["Margutti","R.",""],["Chornock","R.",""],["Bietenholz","M.",""],["Christy","C. T.",""],["Stroh","M.",""],["Terreran","G.",""],["Saxton","R.",""],["Komossa","S.",""],["Bright","J. S.",""],["Ramirez-Ruiz","E.",""],["Coppejans","D. L.",""],["Leung","J. K.",""],["Cendes","Y.",""],["Wiston","E.",""],["Laskar","T.",""],["Horesh","A.",""],["Schroeder","G.",""],["J.","Nayana A.",""],["Wieringa","M. H.",""],["Velez","N.",""],["Berger","E.",""],["Blanchard","P. K.",""],["Eftekhari","T.",""],["Gomez","S.",""],["Nicholl","M.",""],["Sears","H.",""],["Zauderer","B. A.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 18:02:59 GMT"}],"updateDate":"2024-07-30","timestamp":1722016979000,"abstract":"  We present the results from an extensive follow-up campaign of the Tidal\nDisruption Event (TDE) ASASSN-15oi spanning $\\delta t \\sim 10 - 3000$ d,\noffering an unprecedented window into the multiwavelength properties of a TDE\nduring its first $\\approx 8$ years of evolution. ASASSN-15oi is one of the few\nTDEs with strong detections at X-ray, optical/UV, and radio wavelengths and\nfeatured two delayed radio flares at $\\delta t \\sim 180$ d and $\\delta t \\sim\n1400$ d. Our observations at $> 1400$ d reveal an absence of thermal X-rays, a\nlate-time variability in the non-thermal X-ray emission, and sharp declines in\nthe non-thermal X-ray and radio emission at $\\delta t \\sim 2800$ d and $\\sim\n3000$ d, respectively. The UV emission shows no significant evolution at $>400$\nd and remains above the pre-TDE level. We show that a cooling envelope model\ncan explain the thermal emission consistently across all epochs. We also find\nthat a scenario involving episodic ejection of material due to stream-stream\ncollisions is conducive to explaining the first radio flare. Given the peculiar\nspectral and temporal evolution of the late-time emission, however,\nconstraining the origins of the second radio flare and the non-thermal X-rays\nremains challenging. Our study underscores the critical role of long-term,\nmultiwavelength follow-up.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}