{"id":"2407.18054","title":"LKCell: Efficient Cell Nuclei Instance Segmentation with Large\n  Convolution Kernels","authors":"Ziwei Cui and Jingfeng Yao and Lunbin Zeng and Juan Yang and Wenyu Liu\n  and Xinggang Wang","authorsParsed":[["Cui","Ziwei",""],["Yao","Jingfeng",""],["Zeng","Lunbin",""],["Yang","Juan",""],["Liu","Wenyu",""],["Wang","Xinggang",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 14:07:49 GMT"}],"updateDate":"2024-07-26","timestamp":1721916469000,"abstract":"  The segmentation of cell nuclei in tissue images stained with the blood dye\nhematoxylin and eosin (H$\\&$E) is essential for various clinical applications\nand analyses. Due to the complex characteristics of cellular morphology, a\nlarge receptive field is considered crucial for generating high-quality\nsegmentation. However, previous methods face challenges in achieving a balance\nbetween the receptive field and computational burden. To address this issue, we\npropose LKCell, a high-accuracy and efficient cell segmentation method. Its\ncore insight lies in unleashing the potential of large convolution kernels to\nachieve computationally efficient large receptive fields. Specifically, (1) We\ntransfer pre-trained large convolution kernel models to the medical domain for\nthe first time, demonstrating their effectiveness in cell segmentation. (2) We\nanalyze the redundancy of previous methods and design a new segmentation\ndecoder based on large convolution kernels. It achieves higher performance\nwhile significantly reducing the number of parameters. We evaluate our method\non the most challenging benchmark and achieve state-of-the-art results (0.5080\nmPQ) in cell nuclei instance segmentation with only 21.6% FLOPs compared with\nthe previous leading method. Our source code and models are available at\nhttps://github.com/hustvl/LKCell.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"dufXPJ1BYBObNXVqO7gr7bfasyA62U6P33nbAuE8o_o","pdfSize":"2279724"}
