{"id":"2407.11143","title":"General Relativistic Hydrodynamic Simulations of binary strange star\n  mergers","authors":"Francesco Grippa, Aviral Prakash, Domenico Logoteta, David Radice,\n  Ignazio Bombaci","authorsParsed":[["Grippa","Francesco",""],["Prakash","Aviral",""],["Logoteta","Domenico",""],["Radice","David",""],["Bombaci","Ignazio",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:08:31 GMT"}],"updateDate":"2024-07-17","timestamp":1721066911000,"abstract":"  We perform fully general-relativistic simulations of binary strange star\nmergers considering two different approaches for thermal effects. The first\nuses a cold equation of state (EOS) derived from a modified version of the MIT\nbag model which is then supplemented by a $\\Gamma$-law correction. The second\napproach employs a microphysical description of the finite-temperature effects.\nWe describe results obtained with the two treatments, highlighting the\ninfluence of thermal effects. We find that the postmerger dynamics differs\nsignificantly in the two cases, leading to quantitative differences in the\npostmerger gravitational-wave spectrum and ejecta mass. The peak frequency of\nthe postmerger gravitational-wave emission is consistent with the established\nquasi-universal relations for binary neutron star mergers and as a result, our\nsimulations cannot distinguish between mergers of neutron stars and those of\nstrange stars. Our models with realistic treatment of finite-temperature\neffects produce a significant amount of ejecta $\\gtrsim 0.02\\ M_{\\odot}$. The\nresulting flux of strangelets near the Earth, computed assuming that all\nneutron star mergers are in fact strange-stars mergers and that the binary\nconsidered here is representative, is in tension with experimental upper\nlimits. As such, our results tentatively disfavor a scenario in which\nstrange-quark matter is the lowest energy state of matter.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}