{"id":"2407.21430","title":"ABCDE: Application-Based Cluster Diff Evals","authors":"Stephan van Staden, Alexander Grubb","authorsParsed":[["van Staden","Stephan",""],["Grubb","Alexander",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 08:29:35 GMT"}],"updateDate":"2024-08-01","timestamp":1722414575000,"abstract":"  This paper considers the problem of evaluating clusterings of very large\npopulations of items. Given two clusterings, namely a Baseline clustering and\nan Experiment clustering, the tasks are twofold: 1) characterize their\ndifferences, and 2) determine which clustering is better. ABCDE is a novel\nevaluation technique for accomplishing that. It aims to be practical: it allows\nitems to have associated importance values that are application-specific, it is\nfrugal in its use of human judgements when determining which clustering is\nbetter, and it can report metrics for arbitrary slices of items, thereby\nfacilitating understanding and debugging. The approach to measuring the delta\nin the clustering quality is novel: instead of trying to construct an expensive\nground truth up front and evaluating the each clustering with respect to that,\nwhere the ground truth must effectively pre-anticipate clustering changes,\nABCDE samples questions for judgement on the basis of the actual diffs between\nthe clusterings. ABCDE builds upon the pointwise metrics for clustering\nevaluation, which make the ABCDE metrics intuitive and simple to understand.\nThe mathematical elegance of the pointwise metrics equip ABCDE with rigorous\nyet practical ways to explore the clustering diffs and to estimate the quality\ndelta.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tsWmOTW2cxR0ii63ZktR_KPhH19vw33ZmMIQ5UYmKbA","pdfSize":"238855","objectId":"0xfb4da0ca2c685dc94299e99ccd1998ae3004ae75c95277a4a4713325957917b7","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
