{"id":"2407.01066","title":"Spin chain techniques for angular momentum quasicharacters","authors":"P D Jarvis, G Rudolph","authorsParsed":[["Jarvis","P D",""],["Rudolph","G",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 08:16:35 GMT"}],"updateDate":"2024-07-02","timestamp":1719821795000,"abstract":"  We study the ring of invariant functions over the $N$-fold Cartesian product\nof copies of the compact Lie group $G=SU(2)$, modulo the action of conjugation\nby the diagonal subgroup, generalizing the group character ring. For $N=1$, an\northonormal basis for the space of invariant functions is given by the\nirreducible characters, and the structure constants under pointwise\nmultiplication are the coefficients of the Clebsch-Gordan series for the\nreduction of angular momentum tensor products ($3j$ coefficients). For $N \\ge\n2$, the structure constants under pointwise multiplication of the corresponding\ninvariants, which we term irreducible quasicharacters, are Racah $3(2N\\!-\\!1)j$\nrecoupling coefficients, which can be decomposed as products of $9j$\ncoefficients (for $N=2$, they are squares thereof). We identify the irreducible\nquasicharacters for $\\times^N\\! SU(2)$ with traces of representations of group\nelements, over totally coupled angular momentum states labelled by binary\ncoupling trees $T$ with $N$ leaves, $N\\!-\\!1$ internal vertices and associated\nintermediate edge labels. Using concrete spin chain realizations and projection\ntechniques, we give explicit constructions for some low degree $N=2, 3$ and $4$\nquasicharacters. In the case $N=2$, related methods are used to work out the\nexpansions of products of generic, with elementary spin-$\\textstyle{\\frac 12}$,\nquasicharacters (equivalent to an \\emph{ab initio} evaluation of certain basic\n$9j$ coefficients). We provide an appendix which summarizes formal properties\nof the quasicharacter calculus known from our previous work for both $SU(2)$\nand for compact $G$ (J Math Phys 59 (8) 083505 (2018) and 62(3) 033514 (2021).\nIn particular, we provide an explicit derivation for the $N=2$ angular momentum\nquasicharacter product rule.\n","subjects":["Physics/Mathematical Physics","Physics/High Energy Physics - Theory","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}