{"id":"2407.11153","title":"Neutron stars and the dense matter equation of state: from microscopic\n  theory to macroscopic observations","authors":"Katerina Chatziioannou, H. Thankful Cromartie, Stefano Gandolfi, Ingo\n  Tews, David Radice, Andrew W. Steiner, Anna L. Watts","authorsParsed":[["Chatziioannou","Katerina",""],["Cromartie","H. Thankful",""],["Gandolfi","Stefano",""],["Tews","Ingo",""],["Radice","David",""],["Steiner","Andrew W.",""],["Watts","Anna L.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:22:14 GMT"}],"updateDate":"2024-07-17","timestamp":1721067734000,"abstract":"  The past years have witnessed tremendous progress in understanding the\nproperties of neutron stars and of the dense matter in their cores, made\npossible by electromagnetic observations of neutron stars and the detection of\ngravitational waves from their mergers. These observations provided novel\nconstraints on neutron-star structure, that is intimately related to the\nproperties of dense neutron-rich matter described by the nuclear equation of\nstate. Nevertheless, constraining the equation of state over the wide range of\ndensities probed by astrophysical observations is still challenging, as the\nphysics involved is very broad and the system spans many orders of magnitude in\ndensities. Here, we review theoretical approaches to calculate and model the\nneutron-star equation of state in various regimes of densities, and discuss the\nrelated consequent properties of neutron stars. We describe how the equation of\nstate can be calculated from nuclear interactions that are constrained and\nbenchmarked by nuclear experiments. We review neutron-star observations, with\nparticular emphasis on information provided by gravitational-wave signals and\nelectromagnetic observations. Finally, we discuss future challenges and\nopportunities in the field.\n","subjects":["Physics/Nuclear Theory","Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}