{"id":"2407.19188","title":"AO3k at Subaru: First on-sky results of the facility extreme-AO","authors":"Julien Lozi, Kyohoon Ahn, Hannah Blue, Alicia Chun, Christophe\n  Clergeon, Vincent Deo, Olivier Guyon, Takashi Hattori, Yosuke Minowa, Shogo\n  Nishiyama, Yoshito Ono, Shin Oya, Yuhei Takagi, Sebastien Vievard, Maria\n  Vincent","authorsParsed":[["Lozi","Julien",""],["Ahn","Kyohoon",""],["Blue","Hannah",""],["Chun","Alicia",""],["Clergeon","Christophe",""],["Deo","Vincent",""],["Guyon","Olivier",""],["Hattori","Takashi",""],["Minowa","Yosuke",""],["Nishiyama","Shogo",""],["Ono","Yoshito",""],["Oya","Shin",""],["Takagi","Yuhei",""],["Vievard","Sebastien",""],["Vincent","Maria",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 06:11:40 GMT"}],"updateDate":"2024-07-30","timestamp":1722060700000,"abstract":"  The facility adaptive optics of the Subaru Telescope AO188 recently received\nsome long-awaited upgrades: a new 3224-actuator deformable mirror (DM) from\nALPAO (hence the name change to AO3000 or AO3k), an upgraded GPU-based\nreal-time computer, a visible nonlinear curvature wavefront sensor and a\nnear-infrared wavefront sensor (NIR WFS), closing the loop at up to 2~kHz. The\nwavefront sensors were added in 2023, while the DM will be installed at the\nbeginning of 2024. With these new features, AO3k will provide extreme-AO level\nof correction to all the instruments on the IR Nasmyth platform: The NIR-MIR\ncamera and spectrograph IRCS, the high-resolution Doppler spectrograph IRD, and\nthe high-contrast instrument SCExAO. AO3k will also support laser tomography\n(LTAO), delivering high Strehl ratio imaging with large sky coverage.\n  The high Strehl will especially benefit SCExAO for high-contrast imaging,\nboth in infrared and visible. The second stage extreme AO will no longer have\nto chase large residual atmospheric turbulence, and will focus on truly\nhigh-contrast techniques to create and stabilize dark holes, as well as\ncoherent differential imaging techniques. We will finally be able to leverage\nthe several high performance coronagraphs tested in SCExAO, even in the\nvisible.\n  AO3k will answer crucial questions as a precursor for future adaptive optics\nsystems for ELTs, especially as a technology demonstrator for the HCI Planetary\nSystems Imager on the Thirty Meter Telescope. A lot of questions are still\nunanswered on the on-sky behavior of high actuator counts DMs, NIR wavefront\nsensing, the effect of rolling shutters or persistence.\n  We present here the first on-sky results of AO3k, before the system gets\nfully offered to the observers in the second half of 2024. These results give\nus some insight on the great scientific results we hope to achieve in the\nfuture.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ahn5xBbkPcnMM3nezneqHP8w3EzDu5ZkAzMGgxH0Hz0","pdfSize":"3277274"}
