{"id":"2407.03217","title":"MHNet: Multi-view High-order Network for Diagnosing Neurodevelopmental\n  Disorders Using Resting-state fMRI","authors":"Yueyang Li, Weiming Zeng, Wenhao Dong, Luhui Cai, Lei Wang, Hongyu\n  Chen, Hongjie Yan, Lingbin Bian and Nizhuan Wang","authorsParsed":[["Li","Yueyang",""],["Zeng","Weiming",""],["Dong","Wenhao",""],["Cai","Luhui",""],["Wang","Lei",""],["Chen","Hongyu",""],["Yan","Hongjie",""],["Bian","Lingbin",""],["Wang","Nizhuan",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 15:45:48 GMT"}],"updateDate":"2024-07-04","timestamp":1720021548000,"abstract":"  Background: Deep learning models have shown promise in diagnosing\nneurodevelopmental disorders (NDD) like ASD and ADHD. However, many models\neither use graph neural networks (GNN) to construct single-level brain\nfunctional networks (BFNs) or employ spatial convolution filtering for local\ninformation extraction from rs-fMRI data, often neglecting high-order features\ncrucial for NDD classification. Methods: We introduce a Multi-view High-order\nNetwork (MHNet) to capture hierarchical and high-order features from multi-view\nBFNs derived from rs-fMRI data for NDD prediction. MHNet has two branches: the\nEuclidean Space Features Extraction (ESFE) module and the Non-Euclidean Space\nFeatures Extraction (Non-ESFE) module, followed by a Feature Fusion-based\nClassification (FFC) module for NDD identification. ESFE includes a Functional\nConnectivity Generation (FCG) module and a High-order Convolutional Neural\nNetwork (HCNN) module to extract local and high-order features from BFNs in\nEuclidean space. Non-ESFE comprises a Generic Internet-like Brain Hierarchical\nNetwork Generation (G-IBHN-G) module and a High-order Graph Neural Network\n(HGNN) module to capture topological and high-order features in non-Euclidean\nspace. Results: Experiments on three public datasets show that MHNet\noutperforms state-of-the-art methods using both AAL1 and Brainnetome Atlas\ntemplates. Extensive ablation studies confirm the superiority of MHNet and the\neffectiveness of using multi-view fMRI information and high-order features. Our\nstudy also offers atlas options for constructing more sophisticated\nhierarchical networks and explains the association between key brain regions\nand NDD. Conclusion: MHNet leverages multi-view feature learning from both\nEuclidean and non-Euclidean spaces, incorporating high-order information from\nBFNs to enhance NDD classification performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}