{"id":"2407.14426","title":"Controllable and Efficient Multi-Class Pathology Nuclei Data\n  Augmentation using Text-Conditioned Diffusion Models","authors":"Hyun-Jic Oh, Won-Ki Jeong","authorsParsed":[["Oh","Hyun-Jic",""],["Jeong","Won-Ki",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:53:44 GMT"}],"updateDate":"2024-07-22","timestamp":1721404424000,"abstract":"  In the field of computational pathology, deep learning algorithms have made\nsignificant progress in tasks such as nuclei segmentation and classification.\nHowever, the potential of these advanced methods is limited by the lack of\navailable labeled data. Although image synthesis via recent generative models\nhas been actively explored to address this challenge, existing works have\nbarely addressed label augmentation and are mostly limited to single-class and\nunconditional label generation. In this paper, we introduce a novel two-stage\nframework for multi-class nuclei data augmentation using text-conditional\ndiffusion models. In the first stage, we innovate nuclei label synthesis by\ngenerating multi-class semantic labels and corresponding instance maps through\na joint diffusion model conditioned by text prompts that specify the label\nstructure information. In the second stage, we utilize a semantic and\ntext-conditional latent diffusion model to efficiently generate high-quality\npathology images that align with the generated nuclei label images. We\ndemonstrate the effectiveness of our method on large and diverse pathology\nnuclei datasets, with evaluations including qualitative and quantitative\nanalyses, as well as assessments of downstream tasks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"PajZGHonrs3qCCugwa-4wX1GulLJwVXadoamwH0MchY","pdfSize":"978667","objectId":"0xdedc135f96ac4c5b416030726b974d53e937d220a83c6505c0e116a086654016","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
