{"id":"2407.02037","title":"Saving Private WAN: Using Internet Paths to Offload WAN Traffic in\n  Conferencing Services","authors":"Bhaskar Kataria, Palak LNU, Rahul Bothra, Rohan Gandhi, Debopam\n  Bhattacherjee, Venkata N. Padmanabhan, Irena Atov, Sriraam Ramakrishnan,\n  Somesh Chaturmohta, Chakri Kotipalli, Rui Liang, Ken Sueda, Xin He, Kevin\n  Hinton","authorsParsed":[["Kataria","Bhaskar",""],["LNU","Palak",""],["Bothra","Rahul",""],["Gandhi","Rohan",""],["Bhattacherjee","Debopam",""],["Padmanabhan","Venkata N.",""],["Atov","Irena",""],["Ramakrishnan","Sriraam",""],["Chaturmohta","Somesh",""],["Kotipalli","Chakri",""],["Liang","Rui",""],["Sueda","Ken",""],["He","Xin",""],["Hinton","Kevin",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 08:10:18 GMT"}],"updateDate":"2024-07-03","timestamp":1719907818000,"abstract":"  Large-scale video conferencing services incur significant network cost while\nserving surging global demands. Our work systematically explores the\nopportunity to offload a fraction of this traffic to the Internet, a cheaper\nrouting option offered already by cloud providers, from WAN without drop in\napplication performance. First, with a large-scale latency measurement study\nwith 3.5 million data points per day spanning 241K source cities and 21 data\ncenters across the globe, we demonstrate that Internet paths perform comparable\nto or better than the private WAN for parts of the world (e.g., Europe and\nNorth America). Next, we present Titan, a live (12+ months) production system\nthat carefully moves a fraction of the conferencing traffic to the Internet\nusing the above observation. Finally, we propose Titan-Next, a research\nprototype that jointly assigns the conferencing server and routing option\n(Internet or WAN) for individual calls. With 5 weeks of production data, we\nshow Titan-Next reduces the sum of peak bandwidth on WAN links that defines the\noperational network cost by up to 61% compared to state-of-the-art baselines.\nWe will open-source parts of the measurement data.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0z9lC5Zx-X7Q-iwcT4NkD6F9ME3kFOIcE2X9V2PiIGg","pdfSize":"2469692"}
