{"id":"2407.18900","title":"How Polarized are Online Conversations about Childhood?","authors":"Breanna E. Green and William R. Hobbs","authorsParsed":[["Green","Breanna E.",""],["Hobbs","William R.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:52:04 GMT"}],"updateDate":"2024-07-29","timestamp":1722016324000,"abstract":"  2020 through 2023 were unusually tumultuous years for children in the United\nStates, and children's welfare was prominent in political debate. Theories in\nmoral psychology suggest that political parties would treat concerns for\nchildren using different moral frames, and that moral conflict might drive\nsubstantial polarization in discussions about children. However, such partisan\nframes may still differ very little if there is limited underlying disagreement\nabout moral issues and everyday concerns in childhood when not explicitly\nreferencing politics. We evaluate claims of universality and division in moral\nlanguage using tweets from 2019-2023 linked to U.S. voter records, focusing on\nexpressed morality. Our results show that mentions of children by Republicans\nand Democrats are usually similar, differing no more than mentions by women and\nmen, and tend to contain no large differences in accompanying moral words. To\nthe extent that mentions of children did differ across parties, these\ndifferences were constrained to topics polarized well before the pandemic --\nand slightly heightened when co-mentioned with `kids' or `children'. These\ntopics reflected a small fraction of conversations about children. Overall,\npolarization of online discussion around childhood appears to reflect escalated\npolarization on lines of existing partisan conflicts rather than concerns\noriginating from new concerns about the welfare of children during and after\nthe pandemic.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"x2F3hM0eTdfdHT64uy1sqipyWgWOQlHZZHNOTfsY8Qs","pdfSize":"244355"}
