{"id":"2407.00116","title":"Generative AI for Synthetic Data Across Multiple Medical Modalities: A\n  Systematic Review of Recent Developments and Challenges","authors":"Mahmoud Ibrahim, Yasmina Al Khalil, Sina Amirrajab, Chang Sun, Marcel\n  Breeuwer, Josien Pluim, Bart Elen, Gokhan Ertaylan, Michel Dumontier","authorsParsed":[["Ibrahim","Mahmoud",""],["Khalil","Yasmina Al",""],["Amirrajab","Sina",""],["Sun","Chang",""],["Breeuwer","Marcel",""],["Pluim","Josien",""],["Elen","Bart",""],["Ertaylan","Gokhan",""],["Dumontier","Michel",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 14:00:11 GMT"},{"version":"v2","created":"Tue, 2 Jul 2024 06:51:09 GMT"}],"updateDate":"2024-07-03","timestamp":1719496811000,"abstract":"  This paper presents a comprehensive systematic review of generative models\n(GANs, VAEs, DMs, and LLMs) used to synthesize various medical data types,\nincluding imaging (dermoscopic, mammographic, ultrasound, CT, MRI, and X-ray),\ntext, time-series, and tabular data (EHR). Unlike previous narrowly focused\nreviews, our study encompasses a broad array of medical data modalities and\nexplores various generative models. Our search strategy queries databases such\nas Scopus, PubMed, and ArXiv, focusing on recent works from January 2021 to\nNovember 2023, excluding reviews and perspectives. This period emphasizes\nrecent advancements beyond GANs, which have been extensively covered\npreviously.\n  The survey reveals insights from three key aspects: (1) Synthesis\napplications and purpose of synthesis, (2) generation techniques, and (3)\nevaluation methods. It highlights clinically valid synthesis applications,\ndemonstrating the potential of synthetic data to tackle diverse clinical\nrequirements. While conditional models incorporating class labels, segmentation\nmasks and image translations are prevalent, there is a gap in utilizing prior\nclinical knowledge and patient-specific context, suggesting a need for more\npersonalized synthesis approaches and emphasizing the importance of tailoring\ngenerative approaches to the unique characteristics of medical data.\nAdditionally, there is a significant gap in using synthetic data beyond\naugmentation, such as for validation and evaluation of downstream medical AI\nmodels. The survey uncovers that the lack of standardized evaluation\nmethodologies tailored to medical images is a barrier to clinical application,\nunderscoring the need for in-depth evaluation approaches, benchmarking, and\ncomparative studies to promote openness and collaboration.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"s74jSYd6TlDY-d01JsuT7yFKzpm0a5ILdg4bMhukH-o","pdfSize":"10904277","objectId":"0xec9b777e063ba04b2e8a4a9008543eee52c8b3f852d797d08208a133632392de","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
