{"id":"2407.12115","title":"Shape-morphing membranes augment the performance of oscillating foil\n  energy harvesting turbines","authors":"Ilan M. L. Upfal, Yuanhang Zhu, Eric Handy-Cardenas, and Kenneth\n  Breuer","authorsParsed":[["Upfal","Ilan M. L.",""],["Zhu","Yuanhang",""],["Handy-Cardenas","Eric",""],["Breuer","Kenneth",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 18:54:05 GMT"}],"updateDate":"2024-07-18","timestamp":1721156045000,"abstract":"  Oscillating foil turbines (OFTs) can be used to produce power from rivers and\ntides by synchronizing their heaving motion with the strong lift force of\nvortices shed at their leading edge. Prior work has shown that compliant\nmembrane OFTs, which passively camber, exhibit enhanced leading edge vortex\n(LEV) stability and improved lift and power compared with rigid foil OFTs for\nspecific kinematics. This work seeks to understand a) the performance of\ncompliant membrane OFTs over their full kinematic parameter space and b)\nseparate the roles of membrane camber and extensibility in LEV stabilization.\nWe characterize the performance of a compliant membrane OFT over a wide range\nof kinematic parameters through prescribed motion experiments in a free-surface\nwater flume. The optimal frequency of the compliant membrane OFT is found to be\nlower than that of a rigid foil OFT due to the enhanced LEV stability of the\nmembrane. The lift and power of compliant and inextensible membrane foils are\nthen compared to determine whether camber alone is effective for LEV\nstabilization or if extensibility plays an important stabilizing role. The\ndeformation of the compliant membrane OFT is measured using laser imaging. We\nobserve that the role of extensibility changes for different angles of attack.\nAt low angles of attack, membrane deformation is consistent through the half\ncycle coinciding with similar performance to the inextensible foil. At higher\nangles of attack, the compliant foil has a larger deformation and dynamically\ndecambers corresponding with delayed stall and enhanced lift and power.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}