{"id":"2407.20920","title":"SSPA: Split-and-Synthesize Prompting with Gated Alignments for\n  Multi-Label Image Recognition","authors":"Hao Tan, Zichang Tan, Jun Li, Jun Wan, Zhen Lei, Stan Z. Li","authorsParsed":[["Tan","Hao",""],["Tan","Zichang",""],["Li","Jun",""],["Wan","Jun",""],["Lei","Zhen",""],["Li","Stan Z.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 15:58:25 GMT"}],"updateDate":"2024-07-31","timestamp":1722355105000,"abstract":"  Multi-label image recognition is a fundamental task in computer vision.\nRecently, Vision-Language Models (VLMs) have made notable advancements in this\narea. However, previous methods fail to effectively leverage the rich knowledge\nin language models and often incorporate label semantics into visual features\nunidirectionally. To overcome these problems, we propose a Split-and-Synthesize\nPrompting with Gated Alignments (SSPA) framework to amplify the potential of\nVLMs. Specifically, we develop an in-context learning approach to associate the\ninherent knowledge from LLMs. Then we propose a novel Split-and-Synthesize\nPrompting (SSP) strategy to first model the generic knowledge and downstream\nlabel semantics individually and then aggregate them carefully through the\nquaternion network. Moreover, we present Gated Dual-Modal Alignments (GDMA) to\nbidirectionally interact visual and linguistic modalities while eliminating\nredundant cross-modal information, enabling more efficient region-level\nalignments. Rather than making the final prediction by a sharp manner in\nprevious works, we propose a soft aggregator to jointly consider results from\nall image regions. With the help of flexible prompting and gated alignments,\nSSPA is generalizable to specific domains. Extensive experiments on nine\ndatasets from three domains (i.e., natural, pedestrian attributes and remote\nsensing) demonstrate the state-of-the-art performance of SSPA. Further analyses\nverify the effectiveness of SSP and the interpretability of GDMA. The code will\nbe made public.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}