{"id":"2407.06748","title":"iASiS: Towards Heterogeneous Big Data Analysis for Personalized Medicine","authors":"Anastasia Krithara, Fotis Aisopos, Vassiliki Rentoumi, Anastasios\n  Nentidis, Konstantinos Bougatiotis, Maria-Esther Vidal, Ernestina Menasalvas,\n  Alejandro Rodriguez-Gonzalez, Eleftherios G. Samaras, Peter Garrard, Maria\n  Torrente, Mariano Provencio Pulla, Nikos Dimakopoulos, Rui Mauricio, Jordi\n  Rambla De Argila, Gian Gaetano Tartaglia, George Paliouras","authorsParsed":[["Krithara","Anastasia",""],["Aisopos","Fotis",""],["Rentoumi","Vassiliki",""],["Nentidis","Anastasios",""],["Bougatiotis","Konstantinos",""],["Vidal","Maria-Esther",""],["Menasalvas","Ernestina",""],["Rodriguez-Gonzalez","Alejandro",""],["Samaras","Eleftherios G.",""],["Garrard","Peter",""],["Torrente","Maria",""],["Pulla","Mariano Provencio",""],["Dimakopoulos","Nikos",""],["Mauricio","Rui",""],["De Argila","Jordi Rambla",""],["Tartaglia","Gian Gaetano",""],["Paliouras","George",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 10:52:19 GMT"}],"updateDate":"2024-07-10","timestamp":1720522339000,"abstract":"  The vision of IASIS project is to turn the wave of big biomedical data\nheading our way into actionable knowledge for decision makers. This is achieved\nby integrating data from disparate sources, including genomics, electronic\nhealth records and bibliography, and applying advanced analytics methods to\ndiscover useful patterns. The goal is to turn large amounts of available data\ninto actionable information to authorities for planning public health\nactivities and policies. The integration and analysis of these heterogeneous\nsources of information will enable the best decisions to be made, allowing for\ndiagnosis and treatment to be personalised to each individual. The project\noffers a common representation schema for the heterogeneous data sources. The\niASiS infrastructure is able to convert clinical notes into usable data,\ncombine them with genomic data, related bibliography, image data and more, and\ncreate a global knowledge base. This facilitates the use of intelligent methods\nin order to discover useful patterns across different resources. Using semantic\nintegration of data gives the opportunity to generate information that is rich,\nauditable and reliable. This information can be used to provide better care,\nreduce errors and create more confidence in sharing data, thus providing more\ninsights and opportunities. Data resources for two different disease categories\nare explored within the iASiS use cases, dementia and lung cancer.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Databases"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}