{"id":"2407.00380","title":"Particle acceleration at the bow shock of runaway star LS 2355:\n  non-thermal radio emission but no $\\gamma$-ray counterpart","authors":"J. van den Eijnden, S. Mohamed, F. Carotenuto, S. Motta, P. Saikia, D.\n  R. A. Williams-Baldwin","authorsParsed":[["Eijnden","J. van den",""],["Mohamed","S.",""],["Carotenuto","F.",""],["Motta","S.",""],["Saikia","P.",""],["Williams-Baldwin","D. R. A.",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 09:26:31 GMT"}],"updateDate":"2024-07-02","timestamp":1719653191000,"abstract":"  Massive stars that travel at supersonic speeds can create bow shocks as their\nstellar winds interact with the surrounding interstellar medium. These bow\nshocks - prominent sites for mechanical feedback of individual massive stars -\nare predominantly observed in the infrared band. Confirmed high-energy emission\nfrom stellar bow shocks has remained elusive and confirmed radio counterparts,\nwhile rising in recent years, remain rare. Here, we present an in-depth\nmulti-wavelength exploration of the bow shock driven by LS 2355, focusing on\nits non-thermal properties. Using the most-recent Fermi source catalogue, we\nrule out its previously-proposed association with an unidentified $\\gamma$-ray\nsource. Furthermore, we use deep ASKAP observations from the Rapid ASKAP\nContinuum Survey and the Evolutionary Map of the Universe survey to identify a\nnon-thermal radio counterpart: the third spectrally confirmed non-thermal bow\nshock counterpart after BD +43$^{\\rm o}$ 3654 and BD +60$^{\\rm o}$ 2522. We\nfinally use WISE IR data and Gaia to study the surrounding ISM and update the\nmotion of LS 2355. Specifically, we derive a substantially reduced stellar\nvelocity, $v_* = 7.0\\pm2.5$ km/s, compared to previous estimates. The observed\nnon-thermal properties of the bow shock can be explained by an interaction\nbetween the wind of LS 2355 and a dense HII region, at a magnetic field close\nto the maximum magnetic field strength allowed by the compressibility of the\nISM. Similar to earlier works, we find that the thermal radio emission of the\nshocked ISM is likely to be substantially suppressed for it to be consistent\nwith the observed radio spectrum.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}