{"id":"2407.14100","title":"ParamsDrag: Interactive Parameter Space Exploration via Image-Space\n  Dragging","authors":"Guan Li, Yang Liu, Guihua Shan, Shiyu Cheng, Weiqun Cao, Junpeng Wang,\n  Ko-Chih Wang","authorsParsed":[["Li","Guan",""],["Liu","Yang",""],["Shan","Guihua",""],["Cheng","Shiyu",""],["Cao","Weiqun",""],["Wang","Junpeng",""],["Wang","Ko-Chih",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 08:12:41 GMT"}],"updateDate":"2024-07-22","timestamp":1721376761000,"abstract":"  Numerical simulation serves as a cornerstone in scientific modeling, yet the\nprocess of fine-tuning simulation parameters poses significant challenges.\nConventionally, parameter adjustment relies on extensive numerical simulations,\ndata analysis, and expert insights, resulting in substantial computational\ncosts and low efficiency. The emergence of deep learning in recent years has\nprovided promising avenues for more efficient exploration of parameter spaces.\nHowever, existing approaches often lack intuitive methods for precise parameter\nadjustment and optimization. To tackle these challenges, we introduce\nParamsDrag, a model that facilitates parameter space exploration through direct\ninteraction with visualizations. Inspired by DragGAN, our ParamsDrag model\noperates in three steps. First, the generative component of ParamsDrag\ngenerates visualizations based on the input simulation parameters. Second, by\ndirectly dragging structure-related features in the visualizations, users can\nintuitively understand the controlling effect of different parameters. Third,\nwith the understanding from the earlier step, users can steer ParamsDrag to\nproduce dynamic visual outcomes. Through experiments conducted on real-world\nsimulations and comparisons with state-of-the-art deep learning-based\napproaches, we demonstrate the efficacy of our solution.\n","subjects":["Computing Research Repository/Graphics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}