{"id":"2407.00984","title":"Individual brain parcellation: Review of methods, validations and\n  applications","authors":"Chengyi Li, Shan Yu, Yue Cui","authorsParsed":[["Li","Chengyi",""],["Yu","Shan",""],["Cui","Yue",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 05:48:05 GMT"}],"updateDate":"2024-07-02","timestamp":1719812885000,"abstract":"  Individual brains vary greatly in morphology, connectivity and organization.\nThe applicability of group-level parcellations is limited by the rapid\ndevelopment of precision medicine today because they do not take into account\nthe variation of parcels at the individual level. Accurate mapping of brain\nfunctional regions at the individual level is pivotal for a comprehensive\nunderstanding of the variations in brain function and behaviors, early and\nprecise identification of brain abnormalities, as well as personalized\ntreatments for neuropsychiatric disorders. With the development of neuroimaging\nand machine learning techniques, studies on individual brain parcellation are\nbooming. In this paper, we offer an overview of recent advances in the\nmethodologies of individual brain parcellation, including optimization- and\nlearning-based methods. Comprehensive evaluation metrics to validate individual\nbrain mapping have been introduced. We also review the studies of how\nindividual brain mapping promotes neuroscience research and clinical medicine.\nFinally, we summarize the major challenges and important future directions of\nindividualized brain parcellation. Collectively, we intend to offer a thorough\noverview of individual brain parcellation methods, validations, and\napplications, along with highlighting the current challenges that call for an\nurgent demand for integrated platforms that integrate datasets, methods, and\nvalidations.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}