{"id":"2407.02655","title":"Ultrasoft state of microquasar Cygnus X-3: X-ray polarimetry reveals the\n  geometry of astronomical puzzle","authors":"Alexandra Veledina, Juri Poutanen, Anastasiia Bocharova, Alessandro Di\n  Marco, Sofia V. Forsblom, Fabio La Monaca, Jakub Podgorny, Sergey S.\n  Tsygankov, Andrzej A. Zdziarski, Varpu Ahlberg, David A. Green, Fabio Muleri,\n  Lauren Rhodes, Stefano Bianchi, Enrico Costa, Michal Dovciak, Vladislav\n  Loktev, Michael McCollough, Paolo Soffitta, and Rashid Sunyaev","authorsParsed":[["Veledina","Alexandra",""],["Poutanen","Juri",""],["Bocharova","Anastasiia",""],["Di Marco","Alessandro",""],["Forsblom","Sofia V.",""],["La Monaca","Fabio",""],["Podgorny","Jakub",""],["Tsygankov","Sergey S.",""],["Zdziarski","Andrzej A.",""],["Ahlberg","Varpu",""],["Green","David A.",""],["Muleri","Fabio",""],["Rhodes","Lauren",""],["Bianchi","Stefano",""],["Costa","Enrico",""],["Dovciak","Michal",""],["Loktev","Vladislav",""],["McCollough","Michael",""],["Soffitta","Paolo",""],["Sunyaev","Rashid",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 20:38:43 GMT"}],"updateDate":"2024-08-14","timestamp":1719952723000,"abstract":"  Cygnus X-3 is an enigmatic X-ray binary, that is both an exceptional\naccreting system and a cornerstone for the population synthesis studies.\nProminent X-ray and radio properties follow a well-defined pattern, yet the\nphysical reasons for the state changes observed in this system are not known.\nRecently, the presence of an optically thick envelope around the central source\nin the hard state was revealed using the X-ray polarization data obtained with\nImaging X-ray Polarimetry Explorer (IXPE). In this work, we analyse IXPE data\nobtained in the ultrasoft (radio quenched) state of the source. The average\npolarization degree (PD) of $11.9\\pm0.5\\%$ at a polarization angle (PA) of\n$94^{\\circ}\\pm1^{\\circ}$ is inconsistent with the simple geometry of the\naccretion disc viewed at an intermediate inclination. The high PD, the\nblackbody-like spectrum, and the weakness of fluorescent iron line imply that\nthe central source is hidden behind the optically thick outflow and its beamed\nradiation is scattered towards our line of sight. In this picture the observed\nPD is directly related to the source inclination, which we conservatively\ndetermine to lie in the range $26^{\\circ}<i<28^{\\circ}$. Using the new\npolarimetric properties, we propose the scenario that can be responsible for\nthe cyclic behaviour of the state changes in the binary.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}