{"id":"2407.20741","title":"Improving PINNs By Algebraic Inclusion of Boundary and Initial\n  Conditions","authors":"Mohan Ren, Zhihao Fang, Keren Li and Anirbit Mukherjee","authorsParsed":[["Ren","Mohan",""],["Fang","Zhihao",""],["Li","Keren",""],["Mukherjee","Anirbit",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 11:19:48 GMT"}],"updateDate":"2024-07-31","timestamp":1722338388000,"abstract":"  \"AI for Science\" aims to solve fundamental scientific problems using AI\ntechniques. As most physical phenomena can be described as Partial Differential\nEquations (PDEs) , approximating their solutions using neural networks has\nevolved as a central component of scientific-ML. Physics-Informed Neural\nNetworks (PINNs) is the general method that has evolved for this task but its\ntraining is well-known to be very unstable. In this work we explore the\npossibility of changing the model being trained from being just a neural\nnetwork to being a non-linear transformation of it - one that algebraically\nincludes the boundary/initial conditions. This reduces the number of terms in\nthe loss function than the standard PINN losses. We demonstrate that our\nmodification leads to significant performance gains across a range of benchmark\ntasks, in various dimensions and without having to tweak the training\nalgorithm. Our conclusions are based on conducting hundreds of experiments, in\nthe fully unsupervised setting, over multiple linear and non-linear PDEs set to\nexactly solvable scenarios, which lends to a concrete measurement of our\nperformance gains in terms of order(s) of magnitude lower fractional errors\nbeing achieved, than by standard PINNs. The code accompanying this manuscript\nis publicly available at,\nhttps://github.com/MorganREN/Improving-PINNs-By-Algebraic-Inclusion-of-Boundary-and-Initial-Conditions\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Numerical Analysis","Mathematics/Dynamical Systems","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}