{"id":"2407.19764","title":"Utility of High-Order Scheme for Unsteady Flow Simulations: Comparison\n  with Second-Order Tool","authors":"Peng Jiang, Yichen Huang, Yong Cao, Shijun Liao, Bin Xie","authorsParsed":[["Jiang","Peng",""],["Huang","Yichen",""],["Cao","Yong",""],["Liao","Shijun",""],["Xie","Bin",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 07:56:36 GMT"}],"updateDate":"2024-07-30","timestamp":1722239796000,"abstract":"  The objective of this work is to investigate the utility and effectiveness of\nthe high-order scheme for simulating unsteady turbulent flows. To achieve it,\nthe studies were conducted from two perspectives: (i) the ability of different\nnumerical schemes for turbulence problems under the same set of meshes; and\n(ii) the accuracy and stability of higher-order schemes for solving turbulence\nstatistics for different mesh types (hexahedral, tetrahedral, and polyhedral\ncells). The simulations employ the third-order scheme for spatial\ndiscretization of the governing equations, while a widely-used second-order\nsolver, namely pisoFoam, was employed for comparison. This study considers the\ncanonical cases of the Taylor-Green vortex (TGV) problem at Re=100, 1600 and\nflow past a sphere at Re=10000 to address the aforementioned two key issues.\nFor the TGV case, the high-order model significantly improves the numerical\naccuracy with convergence rates and reduces the numerical dissipation of nearly\n1/10 of pisoFoam. In the latter case, the high-order scheme with large-eddy\nsimulation (LES) accurately predicts the vortex structures and the flow\ninstability, regardless of grid type. However, pisoFoam is found to be\nsensitive to mesh types, which results in numerous non-physical structures in\nthe flow field due to numerical noise rather than flow physics, particularly\nfor tetrahedral cells. Furthermore, for the typical low- and high-order flow\nstatistics, the numerical results predicted by the present model show better\nagreement with the reference data and have less dependence on the type of grids\ncompared with the conventional scheme. In addition, the obtained energy\nspectrum by the high-order solver accurately captures the Kelvin-Helmholtz\n(K-H) instability and the vortex shedding frequency, while these important\nfeatures are less pronounced by the traditional low-order model.\n","subjects":["Physics/Fluid Dynamics","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}