{"id":"2407.14431","title":"Diagonalization of large many-body Hamiltonians on a quantum processor","authors":"Nobuyuki Yoshioka, Mirko Amico, William Kirby, Petar Jurcevic, Arkopal\n  Dutt, Bryce Fuller, Shelly Garion, Holger Haas, Ikko Hamamura, Alexander\n  Ivrii, Ritajit Majumdar, Zlatko Minev, Mario Motta, Bibek Pokharel, Pedro\n  Rivero, Kunal Sharma, Christopher J. Wood, Ali Javadi-Abhari, Antonio\n  Mezzacapo","authorsParsed":[["Yoshioka","Nobuyuki",""],["Amico","Mirko",""],["Kirby","William",""],["Jurcevic","Petar",""],["Dutt","Arkopal",""],["Fuller","Bryce",""],["Garion","Shelly",""],["Haas","Holger",""],["Hamamura","Ikko",""],["Ivrii","Alexander",""],["Majumdar","Ritajit",""],["Minev","Zlatko",""],["Motta","Mario",""],["Pokharel","Bibek",""],["Rivero","Pedro",""],["Sharma","Kunal",""],["Wood","Christopher J.",""],["Javadi-Abhari","Ali",""],["Mezzacapo","Antonio",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 16:02:03 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 05:36:13 GMT"}],"updateDate":"2024-09-06","timestamp":1721404923000,"abstract":"  The estimation of low energies of many-body systems is a cornerstone of\ncomputational quantum sciences. Variational quantum algorithms can be used to\nprepare ground states on pre-fault-tolerant quantum processors, but their lack\nof convergence guarantees and impractical number of cost function estimations\nprevent systematic scaling of experiments to large systems. Alternatives to\nvariational approaches are needed for large-scale experiments on\npre-fault-tolerant devices. Here, we use a superconducting quantum processor to\ncompute eigenenergies of quantum many-body systems on two-dimensional lattices\nof up to 56 sites, using the Krylov quantum diagonalization algorithm, an\nanalog of the well-known classical diagonalization technique. We construct\nsubspaces of the many-body Hilbert space using Trotterized unitary evolutions\nexecuted on the quantum processor, and classically diagonalize many-body\ninteracting Hamiltonians within those subspaces. These experiments show that\nquantum diagonalization algorithms are poised to complement their classical\ncounterpart at the foundation of computational methods for quantum systems.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}