{"id":"2407.20250","title":"Riemannian Geometry-Based EEG Approaches: A Literature Review","authors":"Imad Eddine Tibermacine, Samuele Russo, Ahmed Tibermacine, Abdelaziz\n  Rabehi, Bachir Nail, Kamel Kadri, Christian Napoli","authorsParsed":[["Tibermacine","Imad Eddine",""],["Russo","Samuele",""],["Tibermacine","Ahmed",""],["Rabehi","Abdelaziz",""],["Nail","Bachir",""],["Kadri","Kamel",""],["Napoli","Christian",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 13:28:29 GMT"}],"updateDate":"2024-07-31","timestamp":1721395709000,"abstract":"  The application of Riemannian geometry in the decoding of brain-computer\ninterfaces (BCIs) has swiftly garnered attention because of its\nstraightforwardness, precision, and resilience, along with its aptitude for\ntransfer learning, which has been demonstrated through significant achievements\nin global BCI competitions. This paper presents a comprehensive review of\nrecent advancements in the integration of deep learning with Riemannian\ngeometry to enhance EEG signal decoding in BCIs. Our review updates the\nfindings since the last major review in 2017, comparing modern approaches that\nutilize deep learning to improve the handling of non-Euclidean data structures\ninherent in EEG signals. We discuss how these approaches not only tackle the\ntraditional challenges of noise sensitivity, non-stationarity, and lengthy\ncalibration times but also introduce novel classification frameworks and signal\nprocessing techniques to reduce these limitations significantly. Furthermore,\nwe identify current shortcomings and propose future research directions in\nmanifold learning and riemannian-based classification, focusing on practical\nimplementations and theoretical expansions, such as feature tracking on\nmanifolds, multitask learning, feature extraction, and transfer learning. This\nreview aims to bridge the gap between theoretical research and practical,\nreal-world applications, making sophisticated mathematical approaches\naccessible and actionable for BCI enhancements.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}