{"id":"2407.12955","title":"Symmetry-breaking of turbulent flow due to asymmetric vortex shedding in\n  periodic porous media","authors":"Vishal Srikanth and Andrey V. Kuznetsov","authorsParsed":[["Srikanth","Vishal",""],["Kuznetsov","Andrey V.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 18:56:44 GMT"}],"updateDate":"2024-07-19","timestamp":1721242604000,"abstract":"  In this paper, we report new insight into a symmetry-breaking phenomenon that\noccurs for turbulent flow in periodic porous media composed of cylindrical\nsolid obstacles with circular cross-section. We have used Large Eddy Simulation\nto investigate the symmetry-breaking phenomenon by varying the porosity\n(0.57-0.99) and the pore scale Reynolds number (37-1,000). Asymmetrical flow\ndistribution is observed in the intermediate porosity flow regime for values of\nporosities between 0.8 and 0.9, which is characterized by the formation of\nalternating low and high velocity flow channels above and below the solid\nobstacles. These channels are parallel to the direction of the flow.\nCorrespondingly, the microscale vortices formed behind the solid obstacles\nexhibit a bias in the shedding direction. The transition from symmetric to\nasymmetric flow occurs in between the Reynolds numbers of 37 (laminar) and 100\n(turbulent). A Hopf bifurcation resulting in unsteady oscillatory laminar flow\nmarks the origin of a secondary flow instability arising from the interaction\nof the shear layers around the solid obstacle. When turbulence emerges,\nstochastic phase difference in the vortex wake oscillations caused by the\nsecondary flow instability results in flow symmetry breaking. We note that\nsymmetry breaking does not occur for cylindrical solid obstacles with square\ncross-section due to the presence of sharp vertices in the solid obstacle\nsurface. At the macroscale level, symmetry-breaking results in residual\ntransverse drag force components acting on the solid obstacle surfaces.\nSymmetry-breaking promotes attached flow on the solid obstacle surface, which\nis potentially beneficial for improving transport properties at the solid\nobstacle surface such as convection heat flux.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}