{"id":"2407.11254","title":"Conquering images and the basis of transformative action","authors":"Hunter Priniski","authorsParsed":[["Priniski","Hunter",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 21:45:52 GMT"}],"updateDate":"2024-07-17","timestamp":1721079952000,"abstract":"  Our rapid immersion into online life has made us all ill. Through the\ngeneration, personalization, and dissemination of enchanting imagery,\nartificial technologies commodify the minds and hearts of the masses with\nnauseating precision and scale. Online networks, artificial intelligence (AI),\nsocial media, and digital news feeds fine-tune our beliefs and pursuits by\nestablishing narratives that subdivide and polarize our communities and\nidentities. Meanwhile those commanding these technologies conquer the final\nfrontiers of our interior lives, social relations, earth, and cosmos. In the\nAttention Economy, our agency is restricted and our vitality is depleted for\ntheir narcissistic pursuits and pleasures. Generative AI empowers the forces\nthat homogenize and eradicate life, not through some stupid \"singularity\"\nevent, but through devaluing human creativity, labor, and social life. Using a\nfractured lens, we will examine how narratives and networks influence us on\nmental, social, and algorithmic levels. We will discuss how atomizing imagery\n-- ideals and pursuits that alienate, rather than invigorate the individual --\nhijack people's agency to sustain the forces that destroy them. We will\ndiscover how empires build digital networks that optimize society and embolden\nnarcissists to enforce social binaries that perpetuate the ceaseless expansion\nof consumption, exploitation, and hierarchy. Structural hierarchy in the world\nis reified through hierarchy in our beliefs and thinking. Only by seeing images\nas images and appreciating the similarity shared by opposing narratives can we\nfacilitate transformative action and break away from the militaristic systems\nplaguing our lives.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Emerging Technologies","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/"}