{"id":"2407.19429","title":"FTF-ER: Feature-Topology Fusion-Based Experience Replay Method for\n  Continual Graph Learning","authors":"Jinhui Pang, Changqing Lin, Xiaoshuai Hao, Rong Yin, Zixuan Wang,\n  Zhihui Zhang, Jinglin He, Huang Tai Sheng","authorsParsed":[["Pang","Jinhui",""],["Lin","Changqing",""],["Hao","Xiaoshuai",""],["Yin","Rong",""],["Wang","Zixuan",""],["Zhang","Zhihui",""],["He","Jinglin",""],["Sheng","Huang Tai",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 08:39:28 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 07:15:15 GMT"},{"version":"v3","created":"Thu, 8 Aug 2024 07:56:48 GMT"}],"updateDate":"2024-08-09","timestamp":1722155968000,"abstract":"  Continual graph learning (CGL) is an important and challenging task that aims\nto extend static GNNs to dynamic task flow scenarios. As one of the mainstream\nCGL methods, the experience replay (ER) method receives widespread attention\ndue to its superior performance. However, existing ER methods focus on\nidentifying samples by feature significance or topological relevance, which\nlimits their utilization of comprehensive graph data. In addition, the\ntopology-based ER methods only consider local topological information and add\nneighboring nodes to the buffer, which ignores the global topological\ninformation and increases memory overhead. To bridge these gaps, we propose a\nnovel method called Feature-Topology Fusion-based Experience Replay (FTF-ER) to\neffectively mitigate the catastrophic forgetting issue with enhanced\nefficiency. Specifically, from an overall perspective to maximize the\nutilization of the entire graph data, we propose a highly complementary\napproach including both feature and global topological information, which can\nsignificantly improve the effectiveness of the sampled nodes. Moreover, to\nfurther utilize global topological information, we propose Hodge Potential\nScore (HPS) as a novel module to calculate the topological importance of nodes.\nHPS derives a global node ranking via Hodge decomposition on graphs, providing\nmore accurate global topological information compared to neighbor sampling. By\nexcluding neighbor sampling, HPS significantly reduces buffer storage costs for\nacquiring topological information and simultaneously decreases training time.\nCompared with state-of-the-art methods, FTF-ER achieves a significant\nimprovement of 3.6% in AA and 7.1% in AF on the OGB-Arxiv dataset,\ndemonstrating its superior performance in the class-incremental learning\nsetting.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}