{"id":"2407.02832","title":"Style Alignment based Dynamic Observation Method for UAV-View\n  Geo-localization","authors":"Jie Shao and LingHao Jiang","authorsParsed":[["Shao","Jie",""],["Jiang","LingHao",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 06:19:42 GMT"}],"updateDate":"2024-07-04","timestamp":1719987582000,"abstract":"  The task of UAV-view geo-localization is to estimate the localization of a\nquery satellite/drone image by matching it against a reference dataset\nconsisting of drone/satellite images. Though tremendous strides have been made\nin feature alignment between satellite and drone views, vast differences in\nboth inter and intra-class due to changes in viewpoint, altitude, and lighting\nremain a huge challenge. In this paper, a style alignment based dynamic\nobservation method for UAV-view geo-localization is proposed to meet the above\nchallenges from two perspectives: visual style transformation and surrounding\nnoise control. Specifically, we introduce a style alignment strategy to\ntransfrom the diverse visual style of drone-view images into a unified\nsatellite images visual style. Then a dynamic observation module is designed to\nevaluate the spatial distribution of images by mimicking human observation\nhabits. It is featured by the hierarchical attention block (HAB) with a\ndual-square-ring stream structure, to reduce surrounding noise and geographical\ndeformation. In addition, we propose a deconstruction loss to push away\nfeatures of different geo-tags and squeeze knowledge from unmatched images by\ncorrelation calculation. The experimental results demonstrate the\nstate-of-the-art performance of our model on benchmarked datasets. In\nparticular, when compared to the prior art on University-1652, our results\nsurpass the best of them (FSRA), while only requiring 2x fewer parameters. Code\nwill be released at https://github.com/Xcco1/SA\\_DOM\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}