{"id":"2407.18340","title":"Phase transitions in (2 + 1)D subsystem-symmetric monitored quantum\n  circuits","authors":"Cole Kelson-Packer and Akimasa Miyake","authorsParsed":[["Kelson-Packer","Cole",""],["Miyake","Akimasa",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 19:00:28 GMT"}],"updateDate":"2024-07-29","timestamp":1721934028000,"abstract":"  The interplay of unitary evolution and projective measurements is a modern\ninterest in the study of many-body entanglement. On the one hand, the\ncompetition between these two processes leads to the recently-discovered\nmeasurement-induced phase transition (MIPT). On the other, measurement-based\nquantum computation (MBQC) is a well-known computational model studying how\nmeasurements simulate unitary evolution utilizing the entanglement of special\nresources such as the 2D cluster state. The entanglement properties enabling\nMBQC may be attributed to symmetry-protected topological (SPT) orders,\nparticularly subsystem symmetric (SSPT) orders. It was recently found that the\n1D cluster state may be associated with an SPT phase in random circuits\nrespecting a global $Z_2 \\times Z_2$ symmetry, and furthermore that all phase\ntransitions in this scenario belong to the same universality class. As\nresources with greater computational power feature greater symmetry, it is\nfruitful to investigate further any relationship between levels of symmetry in\nMIPTs and MBQC. In this paper we investigate MIPTs on a torus with three levels\nof symmetry-respecting unitary evolution interspersed by measurements. Although\nwe find two area-law phases and one volume-law phase with distinct entanglement\nstructures for each ensemble, the phase transition from the volume-law phase to\nthe area-law phase associated with the 2D cluster state has variable\ncorrelation length exponent $\\nu$. Whereas $\\nu\\approx 0.90$ for unconstrained\nClifford unitaries and $\\nu\\approx 0.83$ for globally-symmetric Cliffords,\nsubsystem-symmetric Cliffords feature a much smaller value $\\nu\\approx 0.38$.\nIt is speculated that the hierarchy of distinct transitions seen in these\nrandom monitored quantum circuit models might have consequences for\ncomputational universality in MBQC.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/"}