{"id":"2407.17922","title":"Yetter-Drinfeld post-Hopf algebras and Yetter-Drinfeld relative\n  Rota-Baxter operators","authors":"Andrea Sciandra","authorsParsed":[["Sciandra","Andrea",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 10:16:17 GMT"}],"updateDate":"2024-07-26","timestamp":1721902577000,"abstract":"  Recently, Li, Sheng and Tang introduced post-Hopf algebras and relative\nRota-Baxter operators (on cocommutative Hopf algebras), providing an adjunction\nbetween the respective categories under the assumption that the structures\ninvolved are cocommutative. We introduce Yetter-Drinfeld post-Hopf algebras,\nwhich become usual post-Hopf algebras in the cocommutative setting. In analogy\nwith the correspondence between cocommutative post-Hopf algebras and\ncocommutative Hopf braces, the category of Yetter-Drinfeld post-Hopf algebras\nis isomorphic to the category of Yetter-Drinfeld braces introduced by the\nauthor in a joint work with D. Ferri. This allows to explore the connection\nwith matched pairs of actions and provide examples of Yetter-Drinfeld post-Hopf\nalgebras. Moreover, we prove that the category of Yetter-Drinfeld post-Hopf\nalgebras is equivalent to a subcategory of Yetter-Drinfeld relative Rota-Baxter\noperators. The latter structures coincide with the inverse maps of\nYetter-Drinfeld 1-cocycles introduced by the author and D. Ferri, and\ngeneralise bijective relative Rota-Baxter operators on cocommutative Hopf\nalgebras. Hence the previous equivalence passes to cocommutative post-Hopf\nalgebras and bijective relative Rota-Baxter operators. Once the surjectivity of\nthe Yetter-Drinfeld relative Rota-Baxter operators is removed, the equivalence\nis replaced by an adjunction and one can recover the result of Li, Sheng and\nTang in the cocommutative case.\n","subjects":["Mathematics/Quantum Algebra","Mathematics/Category Theory","Mathematics/Rings and Algebras","Mathematics/Representation Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}