{"id":"2407.20519","title":"DuA: Dual Attentive Transformer in Long-Term Continuous EEG Emotion\n  Analysis","authors":"Yue Pan, Qile Liu, Qing Liu, Li Zhang, Gan Huang, Xin Chen, Fali Li,\n  Peng Xu, Zhen Liang","authorsParsed":[["Pan","Yue",""],["Liu","Qile",""],["Liu","Qing",""],["Zhang","Li",""],["Huang","Gan",""],["Chen","Xin",""],["Li","Fali",""],["Xu","Peng",""],["Liang","Zhen",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 03:31:03 GMT"}],"updateDate":"2024-07-31","timestamp":1722310263000,"abstract":"  Affective brain-computer interfaces (aBCIs) are increasingly recognized for\ntheir potential in monitoring and interpreting emotional states through\nelectroencephalography (EEG) signals. Current EEG-based emotion recognition\nmethods perform well with short segments of EEG data. However, these methods\nencounter significant challenges in real-life scenarios where emotional states\nevolve over extended periods. To address this issue, we propose a Dual\nAttentive (DuA) transformer framework for long-term continuous EEG emotion\nanalysis. Unlike segment-based approaches, the DuA transformer processes an\nentire EEG trial as a whole, identifying emotions at the trial level, referred\nto as trial-based emotion analysis. This framework is designed to adapt to\nvarying signal lengths, providing a substantial advantage over traditional\nmethods. The DuA transformer incorporates three key modules: the\nspatial-spectral network module, the temporal network module, and the transfer\nlearning module. The spatial-spectral network module simultaneously captures\nspatial and spectral information from EEG signals, while the temporal network\nmodule detects temporal dependencies within long-term EEG data. The transfer\nlearning module enhances the model's adaptability across different subjects and\nconditions. We extensively evaluate the DuA transformer using a\nself-constructed long-term EEG emotion database, along with two benchmark EEG\nemotion databases. On the basis of the trial-based leave-one-subject-out\ncross-subject cross-validation protocol, our experimental results demonstrate\nthat the proposed DuA transformer significantly outperforms existing methods in\nlong-term continuous EEG emotion analysis, with an average enhancement of\n5.28%.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}