{"id":"2407.14163","title":"Subspace-Based Local Compilation of Variational Quantum Circuits for\n  Large-Scale Quantum Many-Body Simulation","authors":"Shota Kanasugi, Yuichiro Hidaka, Yuya O. Nakagawa, Shoichiro Tsutsui,\n  Norifumi Matsumoto, Kazunori Maruyama, Hirotaka Oshima, Shintaro Sato","authorsParsed":[["Kanasugi","Shota",""],["Hidaka","Yuichiro",""],["Nakagawa","Yuya O.",""],["Tsutsui","Shoichiro",""],["Matsumoto","Norifumi",""],["Maruyama","Kazunori",""],["Oshima","Hirotaka",""],["Sato","Shintaro",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 09:50:01 GMT"}],"updateDate":"2024-07-22","timestamp":1721382601000,"abstract":"  Simulation of quantum many-body systems is a promising application of quantum\ncomputers. However, implementing the time-evolution operator as a quantum\ncircuit efficiently on near-term devices with limited resources is challenging.\nStandard approaches like Trotterization often require deep circuits, making\nthem impractical. This paper proposes a hybrid quantum-classical algorithm\ncalled Local Subspace Variational Quantum Compilation (LSVQC) for compiling the\ntime-evolution operator. The LSVQC uses variational optimization to reproduce\nthe action of the target time-evolution operator within a physically reasonable\nsubspace. Optimization is performed on small local subsystems based on the\nLieb-Robinson bound, allowing for cost function evaluation using small-scale\nquantum devices or classical computers. Numerical simulations on a spin-lattice\nmodel and an $\\mathit{\\text{ab initio}}$ effective model of strongly correlated\nmaterial Sr$_2$CuO$_3$ demonstrate the algorithm's effectiveness. It is shown\nthat the LSVQC achieves a 95% reduction in circuit depth compared to\nTrotterization while maintaining accuracy. The subspace restriction also\nreduces resource requirements and improves accuracy. Furthermore, we estimate\nthe gate count needed to execute the quantum simulations using the LSVQC on\nnear-term quantum computing architectures in the noisy intermediate-scale or\nearly fault-tolerant quantum computing era. Our estimation suggests that the\nacceptable physical gate error rate for the LSVQC can be significantly larger\nthan for Trotterization.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}