{"id":"2407.13962","title":"Beam Stacking Experiment at a Fixed Field Alternating Gradient\n  Accelerator","authors":"T. Uesugi (1), Y. Ishi (1), Y. Kuriyama (1), Y. Mori (1), C. Jolly\n  (2), D. J. Kelliher (2), J. -B. Lagrange (2), A. P. Letchford (2), S. Machida\n  (2), D. W. Poshuma de Boer (2), C. T. Rogers (2), E. Yamakawa (2), M.\n  Topp-Mugglestone (3) ((1) Institute for Integrated Radiation and Nuclear\n  Science, Kyoto University, (2) STFC ISIS Department, (3) John Adams\n  Institute, University of Oxford)","authorsParsed":[["Uesugi","T.",""],["Ishi","Y.",""],["Kuriyama","Y.",""],["Mori","Y.",""],["Jolly","C.",""],["Kelliher","D. J.",""],["Lagrange","J. -B.",""],["Letchford","A. P.",""],["Machida","S.",""],["de Boer","D. W. Poshuma",""],["Rogers","C. T.",""],["Yamakawa","E.",""],["Topp-Mugglestone","M.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 00:42:22 GMT"}],"updateDate":"2024-07-22","timestamp":1721349742000,"abstract":"  A key challenge in particle accelerators is to achieve high peak intensity.\nSpace charge is particularly strong at lower energy such as during injection\nand typically limits achievable peak intensity. The beam stacking technique can\novercome this limitation by accumulating a beam at high energy where space\ncharge is weaker. In beam stacking, a bunch of particles is injected and\naccelerated to high energy. This bunch continues to circulate, while a second\nand subsequent bunches are accelerated to merge into the first. It also allows\nthe user cycle and acceleration cycles to be separated which is often valuable.\nBeam stacking is not possible in a time varying magnetic field, but a fixed\nfield machine such as an Fixed Field Alternating Gradient Accelerator (FFA)\ndoes not sweep the magnetic field. In this paper, we describe experimental\ndemonstration of beam stacking of two beams at KURNS FFA in Kyoto University.\nThe momentum spread and intensity of the beam was analysed by study of the\nSchottky signal, demonstrating stacking with only a slight increase of momentum\nspread of the combined beams. The intensity of the first beam was, however,\nsignificantly reduced. RF knock-out is the suspected source of the beam loss.\n","subjects":["Physics/Accelerator Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}