{"id":"2407.11007","title":"Panacea: A foundation model for clinical trial search, summarization,\n  design, and recruitment","authors":"Jiacheng Lin, Hanwen Xu, Zifeng Wang, Sheng Wang, Jimeng Sun","authorsParsed":[["Lin","Jiacheng",""],["Xu","Hanwen",""],["Wang","Zifeng",""],["Wang","Sheng",""],["Sun","Jimeng",""]],"versions":[{"version":"v1","created":"Tue, 25 Jun 2024 21:29:25 GMT"}],"updateDate":"2024-07-17","timestamp":1719350965000,"abstract":"  Clinical trials are fundamental in developing new drugs, medical devices, and\ntreatments. However, they are often time-consuming and have low success rates.\nAlthough there have been initial attempts to create large language models\n(LLMs) for clinical trial design and patient-trial matching, these models\nremain task-specific and not adaptable to diverse clinical trial tasks. To\naddress this challenge, we propose a clinical trial foundation model named\nPanacea, designed to handle multiple tasks, including trial search, trial\nsummarization, trial design, and patient-trial matching. We also assemble a\nlarge-scale dataset, named TrialAlign, of 793,279 trial documents and 1,113,207\ntrial-related scientific papers, to infuse clinical knowledge into the model by\npre-training. We further curate TrialInstruct, which has 200,866 of instruction\ndata for fine-tuning. These resources enable Panacea to be widely applicable\nfor a range of clinical trial tasks based on user requirements.\n  We evaluated Panacea on a new benchmark, named TrialPanorama, which covers\neight clinical trial tasks. Our method performed the best on seven of the eight\ntasks compared to six cutting-edge generic or medicine-specific LLMs.\nSpecifically, Panacea showed great potential to collaborate with human experts\nin crafting the design of eligibility criteria, study arms, and outcome\nmeasures, in multi-round conversations. In addition, Panacea achieved 14.42%\nimprovement in patient-trial matching, 41.78% to 52.02% improvement in trial\nsearch, and consistently ranked at the top for five aspects of trial\nsummarization. Our approach demonstrates the effectiveness of Panacea in\nclinical trials and establishes a comprehensive resource, including training\ndata, model, and benchmark, for developing clinical trial foundation models,\npaving the path for AI-based clinical trial development.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PecRKEVsi_4xKLmSHDSPg4tS0S1TwRX5eIim5acLWlk","pdfSize":"7808610"}
