{"id":"2407.17829","title":"Image Segmentation via Divisive Normalization: dealing with\n  environmental diversity","authors":"Pablo Hern\\'andez-C\\'amara, Jorge Vila-Tom\\'as, Paula Dauden-Oliver,\n  Nuria Alabau-Bosque, Valero Laparra, Jes\\'us Malo","authorsParsed":[["Hernández-Cámara","Pablo",""],["Vila-Tomás","Jorge",""],["Dauden-Oliver","Paula",""],["Alabau-Bosque","Nuria",""],["Laparra","Valero",""],["Malo","Jesús",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 07:38:27 GMT"}],"updateDate":"2024-07-26","timestamp":1721893107000,"abstract":"  Autonomous driving is a challenging scenario for image segmentation due to\nthe presence of uncontrolled environmental conditions and the eventually\ncatastrophic consequences of failures. Previous work suggested that a\nbiologically motivated computation, the so-called Divisive Normalization, could\nbe useful to deal with image variability, but its effects have not been\nsystematically studied over different data sources and environmental factors.\nHere we put segmentation U-nets augmented with Divisive Normalization to work\nfar from training conditions to find where this adaptation is more critical. We\ncategorize the scenes according to their radiance level and dynamic range\n(day/night), and according to their achromatic/chromatic contrasts. We also\nconsider video game (synthetic) images to broaden the range of environments. We\ncheck the performance in the extreme percentiles of such categorization. Then,\nwe push the limits further by artificially modifying the images in\nperceptually/environmentally relevant dimensions: luminance, contrasts and\nspectral radiance. Results show that neural networks with Divisive\nNormalization get better results in all the scenarios and their performance\nremains more stable with regard to the considered environmental factors and\nnature of the source. Finally, we explain the improvements in segmentation\nperformance in two ways: (1) by quantifying the invariance of the responses\nthat incorporate Divisive Normalization, and (2) by illustrating the adaptive\nnonlinearity of the different layers that depends on the local activity.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}