{"id":"2407.20027","title":"Graphical tools for detection and control of selection bias with\n  multiple exposures and samples","authors":"Patrick M. Schnell and Eben Kenah","authorsParsed":[["Schnell","Patrick M.",""],["Kenah","Eben",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 14:03:39 GMT"}],"updateDate":"2024-07-30","timestamp":1722261819000,"abstract":"  Among recent developments in definitions and analysis of selection bias is\nthe potential outcomes approach of Kenah (Epidemiology, 2023), which allows\nnon-parametric analysis using single-world intervention graphs, linking\nselection of study participants to identification of causal effects. Mohan &\nPearl (JASA, 2021) provide a framework for missing data via directed acyclic\ngraphs augmented with nodes indicating missingness for each sometimes-missing\nvariable, which allows for analysis of more general missing data problems but\ncannot easily encode scenarios in which different groups of variables are\nobserved in specific subsamples. We give an alternative formulation of the\npotential outcomes framework based on conditional separable effects and\nindicators for selection into subsamples. This is practical for problems\nbetween the single-sample scenarios considered by Kenah and the variable-wise\nmissingness considered by Mohan & Pearl. This simplifies identification\nconditions and admits generalizations to scenarios with multiple, potentially\nnested or overlapping study samples, as well as multiple or time-dependent\nexposures. We give examples of identifiability arguments for case-cohort\nstudies, multiple or time-dependent exposures, and direct effects of selection.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pH0qpUa0jq1AZCGkVbk7Qp-J-P6TICz-45KCW5sHOl8","pdfSize":"266955","objectId":"0xd10ab6e569c518cfdb94f6457b8238884bac118fa5a5b7106b58ea0b1dc44f55","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
