{"id":"2407.15908","title":"The Genomic Code: The genome instantiates a generative model of the\n  organism","authors":"Kevin J. Mitchell and Nick Cheney","authorsParsed":[["Mitchell","Kevin J.",""],["Cheney","Nick",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 16:41:25 GMT"}],"updateDate":"2024-07-24","timestamp":1721666485000,"abstract":"  How does the genome encode the form of the organism? What is the nature of\nthis genomic code? Common metaphors, such as a blueprint or program, fail to\ncapture the complex, indirect, and evolutionarily dynamic relationship between\nthe genome and organismal form, or the constructive, interactive processes that\nproduce it. Such metaphors are also not readily formalised, either to treat\nempirical data or to simulate genomic encoding of form in silico. Here, we\npropose a new analogy, inspired by recent work in machine learning and\nneuroscience: that the genome encodes a generative model of the organism. In\nthis scheme, by analogy with variational autoencoders, the genome does not\nencode either organismal form or developmental processes directly, but\ncomprises a compressed space of latent variables. These latent variables are\nthe DNA sequences that specify the biochemical properties of encoded proteins\nand the relative affinities between trans-acting regulatory factors and their\ntarget sequence elements. Collectively, these comprise a connectionist network,\nwith weights that get encoded by the learning algorithm of evolution and\ndecoded through the processes of development. The latent variables collectively\nshape an energy landscape that constrains the self-organising processes of\ndevelopment so as to reliably produce a new individual of a certain type,\nproviding a direct analogy to Waddingtons famous epigenetic landscape. The\ngenerative model analogy accounts for the complex, distributed genetic\narchitecture of most traits and the emergent robustness and evolvability of\ndevelopmental processes. It also provides a new way to explain the independent\nselectability of specific traits, drawing on the idea of multiplexed\ndisentangled representations observed in artificial and neural systems and\nlends itself to formalisation.\n","subjects":["Quantitative Biology/Other Quantitative Biology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1cdbLlswYV-QMeDvjwS0EWp95u8xuIQGoVsb-ILZ6Ss","pdfSize":"3356427"}
