{"id":"2407.01820","title":"Exploring the Role of Randomization on Belief Rigidity in Online Social\n  Networks","authors":"Adiba Mahbub Proma, Neeley Pate, Raiyan Abdul Baten, Sifeng Chen,\n  James Druckman, Gourab Ghoshal, and Ehsan Hoque","authorsParsed":[["Proma","Adiba Mahbub",""],["Pate","Neeley",""],["Baten","Raiyan Abdul",""],["Chen","Sifeng",""],["Druckman","James",""],["Ghoshal","Gourab",""],["Hoque","Ehsan",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 21:40:44 GMT"}],"updateDate":"2024-07-03","timestamp":1719870044000,"abstract":"  People often stick to their existing beliefs, ignoring contradicting evidence\nor only interacting with those who reinforce their views. Social media\nplatforms often facilitate such tendencies of homophily and echo-chambers as\nthey promote highly personalized content to maximize user engagement. However,\nincreased belief rigidity can negatively affect real-world policy decisions\nsuch as leading to climate change inaction and increased vaccine hesitancy. To\nunderstand and effectively tackle belief rigidity on online social networks,\ndesigning and evaluating various intervention strategies is crucial, and\nincreasing randomization in the network can be considered one such\nintervention. In this paper, we empirically quantify the effects of a\nrandomized social network structure on belief rigidity, specifically examining\nthe potential benefits of introducing randomness into the network. We show that\nindividuals' beliefs are positively influenced by peer opinions, regardless of\nwhether those opinions are similar to or differ from their own by passively\nsensing belief rigidity through our experimental framework. Moreover, people\nincorporate a slightly higher variety of different peers (based on their\nopinions) into their networks when the recommendation algorithm provides them\nwith diverse content, compared to when it provides them with similar content.\nOur results indicate that in some cases, there might be benefits to\nrandomization, providing empirical evidence that a more randomized network\ncould be a feasible way of helping people get out of their echo-chambers. Our\nfindings have broader implications in computing and platform design of social\nmedia, and can help combat overly rigid beliefs in online social networks.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/"}