{"id":"2407.00736","title":"Quantum Circuit Synthesis and Compilation Optimization: Overview and\n  Prospects","authors":"Yan Ge, Wu Wenjie, Chen Yuheng, Pan Kaisen, Lu Xudong, Zhou Zixiang,\n  Wang Yuhan, Wang Ruocheng, Yan Junchi","authorsParsed":[["Ge","Yan",""],["Wenjie","Wu",""],["Yuheng","Chen",""],["Kaisen","Pan",""],["Xudong","Lu",""],["Zixiang","Zhou",""],["Yuhan","Wang",""],["Ruocheng","Wang",""],["Junchi","Yan",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 15:50:10 GMT"}],"updateDate":"2024-07-02","timestamp":1719762610000,"abstract":"  Quantum computing is regarded as a promising paradigm that may overcome the\ncurrent computational power bottlenecks in the post-Moore era. The increasing\nmaturity of quantum processors, especially superconducting ones, provides more\npossibilities for the development and implementation of quantum algorithms. As\nthe crucial stages for quantum algorithm implementation, the logic circuit\ndesign and quantum compiling have also received significant attention, which\ncovers key technologies such as quantum logic circuit synthesis (also widely\nknown as quantum architecture search) and optimization, as well as qubit\nmapping and routing. Recent studies suggest that the scale and precision of\nrelated algorithms are steadily increasing, especially with the integration of\nartificial intelligence methods. In this survey, we systematically review and\nsummarize a vast body of literature, exploring the feasibility of an integrated\ndesign and optimization scheme that spans from the algorithmic level to quantum\nhardware, combining the steps of logic circuit design and compilation\noptimization. Leveraging the exceptional cognitive and learning capabilities of\nAI algorithms, one can reduce manual design costs, enhance the precision and\nefficiency of execution, and facilitate the implementation and validation of\nthe superiority of quantum algorithms on hardware.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Emerging Technologies","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}