{"id":"2407.12287","title":"CDFL: Efficient Federated Human Activity Recognition using Contrastive\n  Learning and Deep Clustering","authors":"Ensieh Khazaei, Alireza Esmaeilzehi, Bilal Taha, Dimitrios Hatzinakos","authorsParsed":[["Khazaei","Ensieh",""],["Esmaeilzehi","Alireza",""],["Taha","Bilal",""],["Hatzinakos","Dimitrios",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 03:17:53 GMT"}],"updateDate":"2024-07-18","timestamp":1721186273000,"abstract":"  In the realm of ubiquitous computing, Human Activity Recognition (HAR) is\nvital for the automation and intelligent identification of human actions\nthrough data from diverse sensors. However, traditional machine learning\napproaches by aggregating data on a central server and centralized processing\nare memory-intensive and raise privacy concerns. Federated Learning (FL) has\nemerged as a solution by training a global model collaboratively across\nmultiple devices by exchanging their local model parameters instead of local\ndata. However, in realistic settings, sensor data on devices is\nnon-independently and identically distributed (Non-IID). This means that data\nactivity recorded by most devices is sparse, and sensor data distribution for\neach client may be inconsistent. As a result, typical FL frameworks in\nheterogeneous environments suffer from slow convergence and poor performance\ndue to deviation of the global model's objective from the global objective.\nMost FL methods applied to HAR are either designed for overly ideal scenarios\nwithout considering the Non-IID problem or present privacy and scalability\nconcerns. This work addresses these challenges, proposing CDFL, an efficient\nfederated learning framework for image-based HAR. CDFL efficiently selects a\nrepresentative set of privacy-preserved images using contrastive learning and\ndeep clustering, reduces communication overhead by selecting effective clients\nfor global model updates, and improves global model quality by training on\nprivacy-preserved data. Our comprehensive experiments carried out on three\npublic datasets, namely Stanford40, PPMI, and VOC2012, demonstrate the\nsuperiority of CDFL in terms of performance, convergence rate, and bandwidth\nusage compared to state-of-the-art approaches.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}