{"id":"2407.21636","title":"Properties of the diffuse gas component in filaments detected in the\n  Dianoga cosmological simulations","authors":"Samo Ilc, Dunja Fabjan, Elena Rasia, Stefano Borgani and Klaus Dolag","authorsParsed":[["Ilc","Samo",""],["Fabjan","Dunja",""],["Rasia","Elena",""],["Borgani","Stefano",""],["Dolag","Klaus",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 14:35:46 GMT"}],"updateDate":"2024-08-01","timestamp":1722436546000,"abstract":"  Hydrodynamical cosmological simulations are ideal laboratories where the\nevolution of the cosmic web can be studied. This allows for easier insight into\nthe nature of the filaments. We investigate how the intrinsic properties of\nfilaments are evolving in areas extracted from a larger cosmological\nsimulation. We aim to identify significant trends in the properties of Warm-Hot\nIntergalactic Medium (WHIM) and suggest possible explanations. To study the\nfilaments and their contents, we select a subset of regions from the Dianoga\nsimulation. We analysed these regions that were simulated with different baryon\nphysics, namely with and without the AGN feedback. We construct the cosmic web\nusing the Sub-space Constrained Mean Shift (SCMS) algorithm and the Sequential\nChain Algorithm for Resolving Filaments (SCARF). We examined the basic physical\nproperties of filaments (length, shape, mass, radius) and analysed different\ngas phases (hot, WHIM and colder gas components) within those structures. The\nevolution of the global filament properties and the properties of the gas\nphases were studied in the redshift range $0 < z < 1.48$. Within our\nsimulations, the detected filaments have, on average, lengths below $9$ Mpc.\nThe filaments' shape correlates with their length; the longer they are, the\nmore likely they are curved. We find that the scaling relation between mass $M$\nand length $L$ of the filaments is well described by the power law $M \\propto\nL^{1.7}$. The radial density profile is widening with redshift, meaning that\nthe radius of the filaments is getting larger over time. The fraction of gas\nmass in the WHIM phase does not depend on the model and is rising towards lower\nredshifts. However, the included baryon physics has a strong impact on the\nmetallicity of gas in filaments, indicating that the AGN feedback impacts the\nmetal content already at redshifts of $z \\sim 2$.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2RqqmDYEm50coOMOdGylWpIfiKu8IY7N_tOlQ38JMuU","pdfSize":"3092247"}
