{"id":"2407.12821","title":"AutoFlow: Automated Workflow Generation for Large Language Model Agents","authors":"Zelong Li, Shuyuan Xu, Kai Mei, Wenyue Hua, Balaji Rama, Om Raheja,\n  Hao Wang, He Zhu, Yongfeng Zhang","authorsParsed":[["Li","Zelong",""],["Xu","Shuyuan",""],["Mei","Kai",""],["Hua","Wenyue",""],["Rama","Balaji",""],["Raheja","Om",""],["Wang","Hao",""],["Zhu","He",""],["Zhang","Yongfeng",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 21:05:02 GMT"}],"updateDate":"2024-07-19","timestamp":1719867902000,"abstract":"  Recent advancements in Large Language Models (LLMs) have shown significant\nprogress in understanding complex natural language. One important application\nof LLM is LLM-based AI Agent, which leverages the ability of LLM as well as\nexternal tools for complex-task solving. To make sure LLM Agents follow an\neffective and reliable procedure to solve the given task, manually designed\nworkflows are usually used to guide the working mechanism of agents. However,\nmanually designing the workflows requires considerable efforts and domain\nknowledge, making it difficult to develop and deploy agents on massive scales.\nTo address these issues, we propose AutoFlow, a framework designed to\nautomatically generate workflows for agents to solve complex tasks. AutoFlow\ntakes natural language program as the format of agent workflow and employs a\nworkflow optimization procedure to iteratively optimize the workflow quality.\nBesides, this work offers two workflow generation methods: fine-tuning-based\nand in-context-based methods, making the AutoFlow framework applicable to both\nopen-source and closed-source LLMs. Experimental results show that our\nframework can produce robust and reliable agent workflows. We believe that the\nautomatic generation and interpretation of workflows in natural language\nrepresent a promising paradigm for solving complex tasks, particularly with the\nrapid development of LLMs. The source code of this work is available at\nhttps://github.com/agiresearch/AutoFlow.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}