{"id":"2407.16258","title":"Telecommand Rejection Probability for CCSDS-compliant LDPC-Coded\n  Transmissions with Tail Sequence","authors":"Rebecca Giuliani, Massimo Battaglioni, Marco Baldi, Franco Chiaraluce,\n  and Nicola Maturo","authorsParsed":[["Giuliani","Rebecca",""],["Battaglioni","Massimo",""],["Baldi","Marco",""],["Chiaraluce","Franco",""],["Maturo","Nicola",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 07:51:01 GMT"}],"updateDate":"2024-07-24","timestamp":1721721061000,"abstract":"  According to the Consultative Committee for Space Data Systems (CCSDS)\nrecommendation for TeleCommand (TC) synchronization and coding, the\nCommunications Link Transmission Unit (CLTU) consists of a start sequence,\nfollowed by coded data, and a tail sequence, which might be optional depending\non the employed coding scheme. With regard to the latter, these transmissions\ntraditionally use a modified Bose-Chaudhuri-Hocquenghem (BCH) code, to which\ntwo state-of-the-art Low-Density Parity-Check (LDPC) codes were later added. As\na lightweight technique to detect the presence of the tail sequence, an\napproach based on decoding failure has traditionally been used, choosing a\nnon-correctable string as the tail sequence. This works very well with the BCH\ncode, for which bounded-distance decoders are employed. When the same approach\nis employed with LDPC codes, it is necessary to design the tail sequence as a\nnon-correctable string for the case of iterative decoders based on belief\npropagation. Moreover, the tail sequence might be corrupted by noise,\npotentially converting it into a correctable pattern. It is therefore important\nthat the tail sequence is chosen to be as much distant as possible, according\nto some metric, from any legitimate codeword. In this paper we study such\nproblem, and analyze the TC rejection probability both theoretically and\nthrough simulations. Such a performance figure, being the rate at which the\nCLTU is discarded, should clearly be minimized. Our analysis is performed\nconsidering many different choices of the system parameters (e.g., length of\nthe CLTU, decoding algorithm, maximum number of decoding iterations).\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"U5h0f0JW6gDDWhx8_ijvmU1dxTteYIH5ikTLHycUT5s","pdfSize":"458604"}
