{"id":"2407.16255","title":"Self-Reasoning Assistant Learning for non-Abelian Gauge Fields Design","authors":"Jinyang Sun, Xi Chen, Xiumei Wang, Dandan Zhu, Xingping Zhou","authorsParsed":[["Sun","Jinyang",""],["Chen","Xi",""],["Wang","Xiumei",""],["Zhu","Dandan",""],["Zhou","Xingping",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 07:49:35 GMT"}],"updateDate":"2024-07-24","timestamp":1721720975000,"abstract":"  Non-Abelian braiding has attracted substantial attention because of its\npivotal role in describing the exchange behaviour of anyons, in which the input\nand outcome of non-Abelian braiding are connected by a unitary matrix.\nImplementing braiding in a classical system can assist the experimental\ninvestigation of non-Abelian physics. However, the design of non-Abelian gauge\nfields faces numerous challenges stemmed from the intricate interplay of group\nstructures, Lie algebra properties, representation theory, topology, and\nsymmetry breaking. The extreme diversity makes it a powerful tool for the study\nof condensed matter physics. Whereas the widely used artificial intelligence\nwith data-driven approaches has greatly promoted the development of physics,\nmost works are limited on the data-to-data design. Here we propose a\nself-reasoning assistant learning framework capable of directly generating\nnon-Abelian gauge fields. This framework utilizes the forward diffusion process\nto capture and reproduce the complex patterns and details inherent in the\ntarget distribution through continuous transformation. Then the reverse\ndiffusion process is used to make the generated data closer to the distribution\nof the original situation. Thus, it owns strong self-reasoning capabilities,\nallowing to automatically discover the feature representation and capture more\nsubtle relationships from the dataset. Moreover, the self-reasoning eliminates\nthe need for manual feature engineering and simplifies the process of model\nbuilding. Our framework offers a disruptive paradigm shift to parse complex\nphysical processes, automatically uncovering patterns from massive datasets.\n","subjects":["Computing Research Repository/Machine Learning","Condensed Matter/Mesoscale and Nanoscale Physics","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nkGw65erLmj5hrJ-bzNUuMby7VfAsNglHC1xH-ZX1Io","pdfSize":"1663931"}
