{"id":"2407.09637","title":"Role of symmetry in the correlated orientational disordered phase of\n  entropic crystals","authors":"Sumitava Kundu, Kaustav Chakraborty, Avisek Das","authorsParsed":[["Kundu","Sumitava",""],["Chakraborty","Kaustav",""],["Das","Avisek",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 18:52:25 GMT"},{"version":"v2","created":"Sat, 20 Jul 2024 11:49:13 GMT"}],"updateDate":"2024-07-23","timestamp":1720810345000,"abstract":"  The crystalline solids with lack of orientational ordering serve the purpose\nof studying the disordered systems with many fundamental applications in\ncontemporary research. Despite the orientational disorder, the constituent\nparticles sometime follow some conserved laws or correlation while maintaining\nthe translational order depicted by the crystal structure. Such phase is called\n``correlated orientational disordered'' phase in the crystal. Polyhedral\nparticles in the presence of hard-core interaction provide a great opportunity\nto study the orientational order and disorder in entropy driven self-assembly.\nWe report the computational evidence of the role of symmetry of the polyhedral\nparticles and cubic crystalline structures exhibiting the correlated disordered\nphases, which are obtained from the simulations of single-component systems.\nThe point groups of the particle and crystal structure appear to be directly\nconnected with the existence of multiple unique orientations satisfying a few\nother orientational features. In this phase, the systems exhibit\norientationally frozen states at sufficiently higher packing fractions and\ndiscrete orientational hopping at comparatively lower ones while all the\nsignatures of the correlation are preserved. This symmetry relationship appears\nto control all the aspects of orientational correlation in the crystalline\nsolids which might be useful to draw fundamental insights about the disordered\nphases with orientational correlation as well as designing the disorder in the\ncrystals.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Materials Science","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UlowPqQowEFiJi_7mPhdnHmBOusCCDqgkFw05kPv5_s","pdfSize":"22613666","objectId":"0xa66115fb4c6acb7930cf1c210f4a6a4e48a8cc578f58559fd88f63398a2eca5f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
