{"id":"2407.08645","title":"Local electrochemical characterization of active Mg-Fe materials: from\n  pure Mg to Mg50-Fe composites","authors":"No\\'emie Ott, Aur\\'elien Tournier Fillon, Oliver Renk, Thomas Kremmer,\n  Stefan Pogatscher, Thomas Suter and Patrik Schmutz","authorsParsed":[["Ott","Noémie",""],["Fillon","Aurélien Tournier",""],["Renk","Oliver",""],["Kremmer","Thomas",""],["Pogatscher","Stefan",""],["Suter","Thomas",""],["Schmutz","Patrik",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 16:25:03 GMT"}],"updateDate":"2024-07-12","timestamp":1720715103000,"abstract":"  This study demonstrates the applicability of the scanning electrochemical\nnanocapillary (SEN) technique to characterize the local surface reactivity of\nactive systems, such as Mg-based materials. Owing to its confined electrolyte\nconfiguration, one undeniable strength of the method is to provide with\nunprecedented resolution direct visualization and assessment of the presence,\ndistribution and nobility of different phases. High lateral resolution\nopen-circuit potential (OCP) scans on single Fe-rich particles in Mg confirms\nthat these particles serve as local cathodes while evidencing enhanced surface\nactivation at the interfacial area between the particle and the Mg matrix.\nValuable insights about nanoscale galvanic coupling within an intermetallic\nparticle can therefore be retrieved, which are otherwise not accessible. On\nmore complex systems, such as Mg50-Fe composites, the SEN technique allows\nindividual assessment of the reactivity of the different microscale phases. By\ncombining OCP scans and local potentiodynamic polarization measurements, we\nreveal that changes in surface reactivity and stability of Mg-rich phases in\nthese composites are directly correlated to their different microstructure,\ni.e. phase spacing and composition, which are intrinsically linked to their\nprocessing parameters. The SEN technique is therefore an excellent tool to help\nus refine our mechanistic understanding of initial stages of corrosion in\nheterogeneous materials.\n","subjects":["Condensed Matter/Materials Science","Physics/Instrumentation and Detectors"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}