{"id":"2407.14894","title":"A Holistic Optimization Framework for Energy Efficient UAV-assisted Fog\n  Computing: Attitude Control, Trajectory Planning and Task Assignment","authors":"Shuaijun Liu, Jinqiu Du, Yaxin Zheng, Jiaying Yin, Yuhui Deng, Jingjin\n  Wu","authorsParsed":[["Liu","Shuaijun",""],["Du","Jinqiu",""],["Zheng","Yaxin",""],["Yin","Jiaying",""],["Deng","Yuhui",""],["Wu","Jingjin",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 14:55:11 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 14:13:39 GMT"}],"updateDate":"2024-08-06","timestamp":1721487311000,"abstract":"  Unmanned Aerial Vehicles (UAVs) have significantly enhanced fog computing by\nacting as both flexible computation platforms and communication mobile relays.\nIn this paper, we propose a holistic framework that jointly optimizes the total\nlatency and energy consumption for UAV-assisted fog computing in a\nthree-dimensional spatial domain with varying terrain elevations and dynamic\ntask generations. Our proposed framework considers three important and\ninterdependent modules: attitude control, trajectory planning, and task\nassignment. We first establish a fuzzy proportional-integral-derivative control\nmodel to determine the UAV's attitude. Then, we propose an enhanced Ant Colony\nSystem (ACS) based algorithm, that includes a safety value and a decoupling\nmechanism to overcome the convergence issue in classical ACS, to compute the\noptimal UAV trajectory. Finally, we design an algorithm based on the Particle\nSwarm Optimization technique, to determine where each offloaded task should be\nexecuted. Under our proposed framework, the outcome of one module would affect\nthe decision-making in one other, providing a holistic perspective of the\nsystem and thus leading to improved solutions. We demonstrate by extensive\nsimulation results that our proposed framework can significantly improve the\noverall performance, measured by latency and energy consumption, compared to\nexisting baseline approaches.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}