{"id":"2407.15694","title":"Counter Turing Test ($CT^2$): Investigating AI-Generated Text Detection\n  for Hindi -- Ranking LLMs based on Hindi AI Detectability Index ($ADI_{hi}$)","authors":"Ishan Kavathekar, Anku Rani, Ashmit Chamoli, Ponnurangam Kumaraguru,\n  Amit Sheth, Amitava Das","authorsParsed":[["Kavathekar","Ishan",""],["Rani","Anku",""],["Chamoli","Ashmit",""],["Kumaraguru","Ponnurangam",""],["Sheth","Amit",""],["Das","Amitava",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 15:00:23 GMT"}],"updateDate":"2024-07-23","timestamp":1721660423000,"abstract":"  The widespread adoption of large language models (LLMs) and awareness around\nmultilingual LLMs have raised concerns regarding the potential risks and\nrepercussions linked to the misapplication of AI-generated text, necessitating\nincreased vigilance. While these models are primarily trained for English,\ntheir extensive training on vast datasets covering almost the entire web,\nequips them with capabilities to perform well in numerous other languages.\nAI-Generated Text Detection (AGTD) has emerged as a topic that has already\nreceived immediate attention in research, with some initial methods having been\nproposed, soon followed by the emergence of techniques to bypass detection. In\nthis paper, we report our investigation on AGTD for an indic language Hindi.\nOur major contributions are in four folds: i) examined 26 LLMs to evaluate\ntheir proficiency in generating Hindi text, ii) introducing the AI-generated\nnews article in Hindi ($AG_{hi}$) dataset, iii) evaluated the effectiveness of\nfive recently proposed AGTD techniques: ConDA, J-Guard, RADAR, RAIDAR and\nIntrinsic Dimension Estimation for detecting AI-generated Hindi text, iv)\nproposed Hindi AI Detectability Index ($ADI_{hi}$) which shows a spectrum to\nunderstand the evolving landscape of eloquence of AI-generated text in Hindi.\nWe will make the codes and datasets available to encourage further research.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"Nb9FtmXyCmZ3F0Dpxl0IXx_TzhgTTijR_Hwwd4ilztk","pdfSize":"2707455"}
