{"id":"2407.09191","title":"From Easy to Hard: Learning Curricular Shape-aware Features for Robust\n  Panoptic Scene Graph Generation","authors":"Hanrong Shi and Lin Li and Jun Xiao and Yueting Zhuang and Long Chen","authorsParsed":[["Shi","Hanrong",""],["Li","Lin",""],["Xiao","Jun",""],["Zhuang","Yueting",""],["Chen","Long",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 11:48:33 GMT"}],"updateDate":"2024-07-15","timestamp":1720784913000,"abstract":"  Panoptic Scene Graph Generation (PSG) aims to generate a comprehensive\ngraph-structure representation based on panoptic segmentation masks. Despite\nremarkable progress in PSG, almost all existing methods neglect the importance\nof shape-aware features, which inherently focus on the contours and boundaries\nof objects. To bridge this gap, we propose a model-agnostic Curricular\nshApe-aware FEature (CAFE) learning strategy for PSG. Specifically, we\nincorporate shape-aware features (i.e., mask features and boundary features)\ninto PSG, moving beyond reliance solely on bbox features. Furthermore, drawing\ninspiration from human cognition, we propose to integrate shape-aware features\nin an easy-to-hard manner. To achieve this, we categorize the predicates into\nthree groups based on cognition learning difficulty and correspondingly divide\nthe training process into three stages. Each stage utilizes a specialized\nrelation classifier to distinguish specific groups of predicates. As the\nlearning difficulty of predicates increases, these classifiers are equipped\nwith features of ascending complexity. We also incorporate knowledge\ndistillation to retain knowledge acquired in earlier stages. Due to its\nmodel-agnostic nature, CAFE can be seamlessly incorporated into any PSG model.\nExtensive experiments and ablations on two PSG tasks under both robust and\nzero-shot PSG have attested to the superiority and robustness of our proposed\nCAFE, which outperforms existing state-of-the-art methods by a large margin.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}