{"id":"2407.15480","title":"Error correction for encoded quantum annealing revisited","authors":"Yoshihiro Nambu","authorsParsed":[["Nambu","Yoshihiro",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 08:47:00 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 15:26:49 GMT"}],"updateDate":"2024-07-24","timestamp":1721638020000,"abstract":"  F. Pastawski and J. Preskill discussed error correction of quantum annealing\n(QA) based on a parity-encoded spin system, known as the\nSourlas-Lechner-Hauke-Zoller (SLHZ) system. They pointed out that the SLHZ\nsystem is closely related to a classical low-density parity-check (LDPC) code\nand demonstrated its error-correcting capability through a belief propagation\n(BP) algorithm assuming independent random spin-flip errors. In contrast,\nAblash et al. suggested that the SLHZ system does not receive the benefits of\npost-readout decoding. The reason is that independent random spin-flips are not\nthe most relevant error arising from sampling excited states during the\nannealing process, whether in closed or open system cases. In this work, we\nrevisit this issue: we propose a very simple decoding algorithm to eliminate\nerrors in the readout of SLHZ systems and show experimental evidence suggesting\nthat SLHZ system exhibits error-correcting capability in decoding annealing\nreadouts. Our new algorithm can be thought of as a bit-flipping algorithm for\nLDPC codes. Assuming an independent and identical noise model, we found that\nthe performance of our algorithm is comparable to that of the BP algorithm. The\nerror correcting-capability for the sampled readouts was investigated using\nMonte Carlo calculations that simulate the final time distribution of QA. The\nresults show that the algorithm successfully eliminates errors in the sampled\nreadouts under conditions where error-free state or even code state is not\nsampled at all. Our simulation suggests that decoding of annealing readouts\nwill be successful if the correctable states can be sampled by annealing, and\nannealing can be considered to play a role as a pre-process of the classical\ndecoding process. This knowledge will be useful for designing and developing\npractical QA based on the SLHZ system in the near future.\n","subjects":["Physics/Quantum Physics","Physics/Applied Physics","Physics/Data Analysis, Statistics and Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}