{"id":"2407.17620","title":"CoMoTo: Unpaired Cross-Modal Lesion Distillation Improves Breast Lesion\n  Detection in Tomosynthesis","authors":"Muhammad Alberb, Marawan Elbatel, Aya Elgebaly, Ricardo\n  Montoya-del-Angel, Xiaomeng Li, Robert Mart\\'i","authorsParsed":[["Alberb","Muhammad",""],["Elbatel","Marawan",""],["Elgebaly","Aya",""],["Montoya-del-Angel","Ricardo",""],["Li","Xiaomeng",""],["Martí","Robert",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 20:17:05 GMT"}],"updateDate":"2024-07-26","timestamp":1721852225000,"abstract":"  Digital Breast Tomosynthesis (DBT) is an advanced breast imaging modality\nthat offers superior lesion detection accuracy compared to conventional\nmammography, albeit at the trade-off of longer reading time. Accelerating\nlesion detection from DBT using deep learning is hindered by limited data\navailability and huge annotation costs. A possible solution to this issue could\nbe to leverage the information provided by a more widely available modality,\nsuch as mammography, to enhance DBT lesion detection. In this paper, we present\na novel framework, CoMoTo, for improving lesion detection in DBT. Our framework\nleverages unpaired mammography data to enhance the training of a DBT model,\nimproving practicality by eliminating the need for mammography during\ninference. Specifically, we propose two novel components, Lesion-specific\nKnowledge Distillation (LsKD) and Intra-modal Point Alignment (ImPA). LsKD\nselectively distills lesion features from a mammography teacher model to a DBT\nstudent model, disregarding background features. ImPA further enriches LsKD by\nensuring the alignment of lesion features within the teacher before distilling\nknowledge to the student. Our comprehensive evaluation shows that CoMoTo is\nsuperior to traditional pretraining and image-level KD, improving performance\nby 7% Mean Sensitivity under low-data setting. Our code is available at\nhttps://github.com/Muhammad-Al-Barbary/CoMoTo .\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}