{"id":"2407.14859","title":"Enhancing High-Energy Particle Physics Collision Analysis through Graph\n  Data Attribution Techniques","authors":"A. Verdone, A. Devoto, C. Sebastiani, J. Carmignani, M. D'Onofrio, S.\n  Giagu, S. Scardapane and M. Panella","authorsParsed":[["Verdone","A.",""],["Devoto","A.",""],["Sebastiani","C.",""],["Carmignani","J.",""],["D'Onofrio","M.",""],["Giagu","S.",""],["Scardapane","S.",""],["Panella","M.",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 12:40:03 GMT"}],"updateDate":"2024-07-23","timestamp":1721479203000,"abstract":"  The experiments at the Large Hadron Collider at CERN generate vast amounts of\ncomplex data from high-energy particle collisions. This data presents\nsignificant challenges due to its volume and complex reconstruction,\nnecessitating the use of advanced analysis techniques for analysis. Recent\nadvancements in deep learning, particularly Graph Neural Networks, have shown\npromising results in addressing the challenges but remain computationally\nexpensive. The study presented in this paper uses a simulated particle\ncollision dataset to integrate influence analysis inside the graph\nclassification pipeline aiming at improving the accuracy and efficiency of\ncollision event prediction tasks. By using a Graph Neural Network for initial\ntraining, we applied a gradient-based data influence method to identify\ninfluential training samples and then we refined the dataset by removing\nnon-contributory elements: the model trained on this new reduced dataset can\nachieve good performances at a reduced computational cost. The method is\ncompletely agnostic to the specific influence method: different influence\nmodalities can be easily integrated into our methodology. Moreover, by\nanalyzing the discarded elements we can provide further insights about the\nevent classification task. The novelty of integrating data attribution\ntechniques together with Graph Neural Networks in high-energy physics tasks can\noffer a robust solution for managing large-scale data problems, capturing\ncritical patterns, and maximizing accuracy across several high-data demand\ndomains.\n","subjects":["Computing Research Repository/Machine Learning","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yBGdfKxO7KaAtqCMCnYNRHKMdYjgiqijn9sMi7RmXgA","pdfSize":"586475"}
