{"id":"2407.12409","title":"Modified gravity in the presence of matter creation: scenario for the\n  late Universe","authors":"Giovanni Montani, Nakia Carlevaro, Mariaveronica De Angelis","authorsParsed":[["Montani","Giovanni",""],["Carlevaro","Nakia",""],["De Angelis","Mariaveronica",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 08:40:05 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 09:17:31 GMT"}],"updateDate":"2024-08-06","timestamp":1721205605000,"abstract":"  We consider a dynamic scenario for characterizing the late Universe\nevolution, aiming to mitigate the Hubble tension. Specifically, we consider a\nmetric $f(R)$ gravity in the Jordan frame which is implemented to the dynamics\nof a flat isotropic Universe. This cosmological model incorporates a matter\ncreation process, due to the time variation of the cosmological gravitational\nfield. We model particle creation by representing the isotropic Universe\n(specifically, a given fiducial volume) as an open thermodynamic system. The\nresulting dynamical model involves four unknowns: the Hubble parameter, the\nnon-minimally coupled scalar field, its potential, and the energy density of\nthe matter component. We impose suitable conditions to derive a closed system\nfor these functions of the redshift. In this model, the vacuum energy density\nof the present Universe is determined by the scalar field potential, in line\nwith the modified gravity scenario. Hence, we construct a viable model,\ndetermining the form of the $f(R)$ theory a posteriori and appropriately\nconstraining the phenomenological parameters of the matter creation process to\neliminate tachyon modes. Finally, by analyzing the allowed parameter space, we\ndemonstrate that the Planck evolution of the Hubble parameter can be reconciled\nwith the late Universe dynamics, thus alleviating the Hubble tension.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}