{"id":"2407.02078","title":"MARLIN: A Cloud Integrated Robotic Solution to Support Intralogistics in\n  Retail","authors":"Dennis Mronga, Andreas Bresser, Fabian Maas, Adrian Danzglock, Simon\n  Stelter, Alina Hawkin, Hoang Giang Nguyen, Michael Beetz, Frank Kirchner","authorsParsed":[["Mronga","Dennis",""],["Bresser","Andreas",""],["Maas","Fabian",""],["Danzglock","Adrian",""],["Stelter","Simon",""],["Hawkin","Alina",""],["Nguyen","Hoang Giang",""],["Beetz","Michael",""],["Kirchner","Frank",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 09:12:54 GMT"}],"updateDate":"2024-07-03","timestamp":1719911574000,"abstract":"  In this paper, we present the service robot MARLIN and its integration with\nthe K4R platform, a cloud system for complex AI applications in retail. At its\ncore, this platform contains so-called semantic digital twins, a semantically\nannotated representation of the retail store. MARLIN continuously exchanges\ndata with the K4R platform, improving the robot's capabilities in perception,\nautonomous navigation, and task planning. We exploit these capabilities in a\nretail intralogistics scenario, specifically by assisting store employees in\nstocking shelves. We demonstrate that MARLIN is able to update the digital\nrepresentation of the retail store by detecting and classifying obstacles,\nautonomously planning and executing replenishment missions, adapting to\nunforeseen changes in the environment, and interacting with store employees.\nExperiments are conducted in simulation, in a laboratory environment, and in a\nreal store. We also describe and evaluate a novel algorithm for autonomous\nnavigation of articulated tractor-trailer systems. The algorithm outperforms\nthe manufacturer's proprietary navigation approach and improves MARLIN's\nnavigation capabilities in confined spaces.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"KPbgAAsbunQ0yuVZ6rWk3X1k_opN_fLLfEzESHYveu8","pdfSize":"39085487","objectId":"0x2afcb52f791c443d3b8fd2473d7db3d56f5f00d3487b3a102ce6a8529d18ae8f","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
