{"id":"2407.03896","title":"Specification-guided temporal logic control for stochastic systems: a\n  multi-layered approach","authors":"Birgit C. van Huijgevoort, Ruohan Wang, Sadegh Soudjani and Sofie\n  Haesaert","authorsParsed":[["van Huijgevoort","Birgit C.",""],["Wang","Ruohan",""],["Soudjani","Sadegh",""],["Haesaert","Sofie",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 12:43:35 GMT"}],"updateDate":"2024-07-08","timestamp":1720097015000,"abstract":"  Designing controllers to satisfy temporal requirements has proven to be\nchallenging for dynamical systems that are affected by uncertainty. This is\nmainly due to the states evolving in a continuous uncountable space, the\nstochastic evolution of the states, and infinite-horizon temporal requirements\non the system evolution, all of which makes closed-form solutions generally\ninaccessible. A promising approach for designing provably correct controllers\non such systems is to utilize the concept of abstraction, which is based on\nbuilding simplified abstract models that can be used to approximate optimal\ncontrollers with provable closeness guarantees. The available abstraction-based\nmethods are further divided into discretization-based approaches that build a\nfinite abstract model by discretizing the continuous space of the system, and\ndiscretization-free approaches that work directly on the continuous state space\nwithout the need for building a finite space. To reduce the conservatism in the\nsub-optimality of the designed controller originating from the abstraction\nstep, this paper develops an approach that naturally has the flexibility to\ncombine different abstraction techniques from the aforementioned classes and to\ncombine the same abstraction technique with different parameters. First, we\ndevelop a multi-layered discretization-based approach with variable precision\nby combining abstraction layers with different precision parameters. Then, we\nexploit the advantages of both classes of abstraction-based methods by\nextending this multi-layered approach guided by the specification to\ncombinations of layers with respectively discretization-based and\ndiscretization-free abstractions. We achieve an efficient implementation that\nis less conservative and improves the computation time and memory usage. We\nillustrate the benefits of the proposed multi-layered approach on several case\nstudies.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}