{"id":"2407.08621","title":"FlexCross: High-Speed and Flexible Packet Processing via a\n  Crosspoint-Queued Crossbar","authors":"Klajd Zyla, Marco Liess, Thomas Wild, Andreas Herkersdorf","authorsParsed":[["Zyla","Klajd",""],["Liess","Marco",""],["Wild","Thomas",""],["Herkersdorf","Andreas",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 15:58:08 GMT"}],"updateDate":"2024-07-12","timestamp":1720713488000,"abstract":"  The fast pace at which new online services emerge leads to a rapid surge in\nthe volume of network traffic. A recent approach that the research community\nhas proposed to tackle this issue is in-network computing, which means that\nnetwork devices perform more computations than before. As a result, processing\ndemands become more varied, creating the need for flexible packet-processing\narchitectures. State-of-the-art approaches provide a high degree of flexibility\nat the expense of performance for complex applications, or they ensure high\nperformance but only for specific use cases. In order to address these\nlimitations, we propose FlexCross. This flexible packet-processing design can\nprocess network traffic with diverse processing requirements at over 100 Gbit/s\non FPGAs. Our design contains a crosspoint-queued crossbar that enables the\nexecution of complex applications by forwarding incoming packets to the\nrequired processing engines in the specified sequence. The crossbar consists of\ndistributed logic blocks that route incoming packets to the specified targets\nand resolve contentions for shared resources, as well as memory blocks for\npacket buffering. We implemented a prototype of FlexCross in Verilog and\nevaluated it via cycle-accurate register-transfer level simulations. We also\nconducted test runs with real-world network traffic on an FPGA. The evaluation\nresults demonstrate that FlexCross outperforms state-of-the-art flexible\npacket-processing designs for different traffic loads and scenarios. The\nsynthesis results show that our prototype consumes roughly 21% of the resources\non a Virtex XCU55 UltraScale+ FPGA.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"98QjltcenYR2AI01gpblAk5TlLaSoHlJlAL9mTRPnPg","pdfSize":"244791"}
