{"id":"2407.02600","title":"Macroscopic uniform 2D moir\\'e superlattices with controllable angles","authors":"Gregory Zaborski Jr., Paulina E. Majchrzak, Samuel Lai, Amalya C.\n  Johnson, Ashley P. Saunders, Ziyan Zhu, Yujun Deng, Donghui Lu, Makoto\n  Hashimoto, Z-X Shen, Fang Liu","authorsParsed":[["Zaborski","Gregory","Jr."],["Majchrzak","Paulina E.",""],["Lai","Samuel",""],["Johnson","Amalya C.",""],["Saunders","Ashley P.",""],["Zhu","Ziyan",""],["Deng","Yujun",""],["Lu","Donghui",""],["Hashimoto","Makoto",""],["Shen","Z-X",""],["Liu","Fang",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 18:37:52 GMT"}],"updateDate":"2024-07-04","timestamp":1719945472000,"abstract":"  Moir\\'e superlattices, engineered through precise stacking of van der Waals\n(vdW) layers, hold immense promise for exploring strongly correlated and\ntopological phenomena. However, these applications have been held back by the\ncommon preparation method: tear-and-stack of Scotch tape exfoliated monolayers.\nIt has low efficiency and reproducibility, along with challenges of twist angle\ninhomogeneity, interfacial contamination, micrometer sizes, and a tendency to\nuntwist at elevated temperatures. Here we report an effective strategy to\nconstruct highly consistent vdW moir\\'e structures with high production\nthroughput, near-unity yield, pristine interfaces, precisely controlled twist\nangles, and macroscopic scale (up to centimeters) with enhanced thermal\nstability. We further demonstrate the versatility across various vdW materials\nincluding transition metal dichalcogenides, graphene, and hBN. The expansive\nsize and high quality of moir\\'e structures enables high-resolution mapping of\nthe reciprocal space back-folded lattices and moir\\'e mini band structures with\nlow energy electron diffraction (LEED) and angle-resolved photoemission\nspectroscopy (ARPES). This technique will have broad applications in both\nfundamental studies and mass production of twistronic devices.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}