{"id":"2407.01659","title":"Host Galaxy Demographics Of Individually Detectable Supermassive\n  Black-hole Binaries with Pulsar Timing Arrays","authors":"Katharine Cella, Stephen R. Taylor, Luke Zoltan Kelley","authorsParsed":[["Cella","Katharine",""],["Taylor","Stephen R.",""],["Kelley","Luke Zoltan",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-03","timestamp":1719856800000,"abstract":"  Massive black hole binaries (MBHBs) produce gravitational waves (GWs) that\nare detectable with pulsar timing arrays. We determine the properties of the\nhost galaxies of simulated MBHBs at the time they are producing detectable GW\nsignals. The population of MBHB systems we evaluate is from the Illustris\ncosmological simulations taken in tandem with post processing semi-analytic\nmodels of environmental factors in the evolution of binaries. Upon evolving to\nthe GW frequency regime accessible by pulsar timing arrays, we calculate the\ndetection probability of each system using a variety of different values for\npulsar noise characteristics in a plausible near-future International Pulsar\nTiming Array dataset. We find that detectable systems have host galaxies that\nare clearly distinct from the overall binary population and from most galaxies\nin general. With conservative noise factors, we find that host stellar\nmetallicity, for example, peaks at twice solar metallicity as opposed to the\ntotal population of galaxies which peaks at ~0.6 solar metallicity.\nAdditionally, the most detectable systems are much brighter in magnitude and\nmore red in color than the overall population, indicating their likely identity\nas large ellipticals with diminished star formation. These results can be used\nto develop effective search strategies for identifying host galaxies and\nelectromagnetic counterparts following GW detection by pulsar timing arrays.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5AJUZkfT_OoTjCDRs_egP05GpptknPrsZwL3wCkzH7E","pdfSize":"1259053"}
