{"id":"2407.02928","title":"A new heuristic approach for contextuality degree estimates and its\n  four- to six-qubit portrayals","authors":"Axel Muller, Metod Saniga, Alain Giorgetti, Fr\\'ed\\'eric Holweck, and\n  Colm Kelleher","authorsParsed":[["Muller","Axel",""],["Saniga","Metod",""],["Giorgetti","Alain",""],["Holweck","Frédéric",""],["Kelleher","Colm",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 08:59:30 GMT"}],"updateDate":"2024-07-04","timestamp":1719997170000,"abstract":"  We introduce and describe a new heuristic method for finding an upper bound\non the degree of contextuality and the corresponding unsatisfied part of a\nquantum contextual configuration with three-element contexts (i.e., lines)\nlocated in a multi-qubit symplectic polar space of order two. While the\npreviously used method based on a SAT solver was limited to three qubits, this\nnew method is much faster and more versatile, enabling us to also handle four-\nto six-qubit cases. The four-qubit unsatisfied configurations we found are\nquite remarkable. That of an elliptic quadric features 315 lines and has in its\ncore three copies of the split Cayley hexagon of order two having a\nHeawood-graph-underpinned geometry in common. That of a hyperbolic quadric also\nhas 315 lines but, as a point-line incidence structure, is isomorphic to the\ndual $\\mathcal{DW}(5,2)$ of $\\mathcal{W}(5,2)$. Finally, an unsatisfied\nconfiguration with 1575 lines associated with all the lines/contexts of the\nfour-qubit space contains a distinguished $\\mathcal{DW}(5,2)$ centered on a\npoint-plane incidence graph of PG$(3,2)$. The corresponding configurations\nfound in the five-qubit space exhibit a considerably higher degree of\ncomplexity, except for a hyperbolic quadric, whose 6975 unsatisfied contexts\nare compactified around the point-hyperplane incidence graph of PG$(4,2)$. The\nmost remarkable unsatisfied patterns discovered in the six-qubit space are a\ncouple of disjoint split Cayley hexagons (for the full space) and a subgeometry\nunderpinned by the complete bipartite graph $K_{7,7}$ (for a hyperbolic\nquadric).\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Discrete Mathematics","Physics/Mathematical Physics","Mathematics/Combinatorics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cV8S1TUBB8G4kl6-kOAYpNKKsO14yT4sb7bDqjlhqqQ","pdfSize":"868883"}
