{"id":"2407.00891","title":"ZeroDDI: A Zero-Shot Drug-Drug Interaction Event Prediction Method with\n  Semantic Enhanced Learning and Dual-Modal Uniform Alignment","authors":"Ziyan Wang, Zhankun Xiong, Feng Huang, Xuan Liu, Wen Zhang","authorsParsed":[["Wang","Ziyan",""],["Xiong","Zhankun",""],["Huang","Feng",""],["Liu","Xuan",""],["Zhang","Wen",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 01:28:14 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 07:51:56 GMT"}],"updateDate":"2024-08-01","timestamp":1719797294000,"abstract":"  Drug-drug interactions (DDIs) can result in various pharmacological changes,\nwhich can be categorized into different classes known as DDI events (DDIEs). In\nrecent years, previously unobserved/unseen DDIEs have been emerging, posing a\nnew classification task when unseen classes have no labelled instances in the\ntraining stage, which is formulated as a zero-shot DDIE prediction (ZS-DDIE)\ntask. However, existing computational methods are not directly applicable to\nZS-DDIE, which has two primary challenges: obtaining suitable DDIE\nrepresentations and handling the class imbalance issue. To overcome these\nchallenges, we propose a novel method named ZeroDDI for the ZS-DDIE task.\nSpecifically, we design a biological semantic enhanced DDIE representation\nlearning module, which emphasizes the key biological semantics and distills\ndiscriminative molecular substructure-related semantics for DDIE representation\nlearning. Furthermore, we propose a dual-modal uniform alignment strategy to\ndistribute drug pair representations and DDIE semantic representations\nuniformly in a unit sphere and align the matched ones, which can mitigate the\nissue of class imbalance. Extensive experiments showed that ZeroDDI surpasses\nthe baselines and indicate that it is a promising tool for detecting unseen\nDDIEs. Our code has been released in https://github.com/wzy-Sarah/ZeroDDI.\n","subjects":["Computing Research Repository/Machine Learning","Quantitative Biology/Biomolecules"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}