{"id":"2407.13305","title":"Hybridization of terahertz phonons and magnons in disparate and\n  spatially-separated material specimens","authors":"Marcin Bia{\\l}ek, Yanko Todorov, Kamil Stelmaszczyk, Dorota\n  Szwagierczak, Beata Synkiewicz-Musialska, Jan Kulawik, Norbert Palka, Marek\n  Potemski, Wojciech Knap","authorsParsed":[["Białek","Marcin",""],["Todorov","Yanko",""],["Stelmaszczyk","Kamil",""],["Szwagierczak","Dorota",""],["Synkiewicz-Musialska","Beata",""],["Kulawik","Jan",""],["Palka","Norbert",""],["Potemski","Marek",""],["Knap","Wojciech",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 09:07:29 GMT"}],"updateDate":"2024-07-19","timestamp":1721293649000,"abstract":"  The interaction between light and matter in condensed matter excitations and\nelectromagnetic resonators serves as a rich playground for fundamental research\nand lies at the core of photonic and quantum technologies. Herein, we present\ncomprehensive experimental and theoretical studies of the photon-mediated\nhybridization of magnons and phonons in the terahertz (THz) range. We\ndemonstrate the intriguing concept of composite states formed by distinct\nelectric and magnetic quasiparticles strongly coupled to the same optical\ncavity modes. Specifically, we explore magnons excited in a slab of an\nantiferromagnetic crystal and phonons excited in a distinct specimen of an\ninsulating material. The crystal slabs form an optical cavity with\nFabry-P\\'erot oscillations in the THz range. We demonstrate hybridized\nphonon-magnon polariton modes and their tunability by adjusting the distance\nbetween the slabs, showing that hybridization persists even at separations up\nto several millimeters. The experimental results are interpreted using both\nclassical and quantum electrodynamical models. The quantum description allows\nus to quantify the degree of hybridization that is linked to a topological\nbehavior of the electric field phasor, in agreement with the classical\nelectrodynamics expectations. Importantly, the presented results refer to\ntemperature conditions and cavities of millimeter size, paving the way for\nengineering realistic, frequency-tunable THz devices through the hybridization\nof electric (phononics) and magnetic (spintronics) elementary excitations of\nmatter.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}