{"id":"2407.11120","title":"Evolution of Jupiter and Saturn with helium rain","authors":"Saburo Howard, Simon M\\\"uller, Ravit Helled","authorsParsed":[["Howard","Saburo",""],["Müller","Simon",""],["Helled","Ravit",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:00:01 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 07:51:01 GMT"}],"updateDate":"2024-08-28","timestamp":1721066401000,"abstract":"  Phase separation between hydrogen and helium at high pressures and\ntemperatures leads to the rainout of helium in the deep interiors of Jupiter\nand Saturn. This process, also known as \"helium rain\", affects their long-term\nevolution. Therefore, modelling the evolution and internal structure of Jupiter\nand Saturn (and giant exoplanets) relies on the phase diagram of hydrogen and\nhelium. In this work, we simulate the evolution of Jupiter and Saturn with\nhelium rain by applying different phase diagrams of hydrogen and helium. We\nfind that consistency between Jupiter s evolution and the Galileo measurement\nof its atmospheric helium abundance is achieved only if a shift in temperature\nin the existing phase diagrams is applied (-1250 K, +350 K or -3850 K depending\non the used phase diagram). We next use the shifted phase diagrams to model\nSaturn s evolution and find consistent solutions for both planets. We confirm\nthat demixing in Jupiter is modest while in Saturn, the process of helium rain\nis significant. We find that Saturn has a large helium gradient and a helium\nocean. Saturn s atmospheric helium mass fraction is estimated to be between\n0.13 and 0.16. We also investigate how the used hydrogen-helium equation of\nstate and atmospheric model affect the planetary evolution and find that the\npredicted cooling times can change by several hundred million years.\nConstraining the level of super-adiabaticity in the helium gradient formed in\nJupiter and Saturn remains challenging and should be investigated in detail in\nfuture research. We conclude that further explorations of the immiscibility\nbetween hydrogen and helium are valuable as this knowledge directly affects the\nevolution and current-state structure of Jupiter and Saturn. Finally, we argue\nthat measuring Saturn s atmospheric helium content is crucial for constraining\nSaturn s evolution as well as the hydrogen-helium phase diagram.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}