{"id":"2407.17044","title":"The Rise of UAV Fleet Technologies for Emergency Wireless Communications\n  in Harsh Environments","authors":"Zhuohui Yao, Wenchi Cheng, Wei Zhang, Tao Zhang, Hailin Zhang","authorsParsed":[["Yao","Zhuohui",""],["Cheng","Wenchi",""],["Zhang","Wei",""],["Zhang","Tao",""],["Zhang","Hailin",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 07:06:53 GMT"}],"updateDate":"2024-07-25","timestamp":1721804813000,"abstract":"  For unforeseen emergencies, such as natural disasters and pandemic events, it\nis highly demanded to cope with the explosive growth of mobile data traffic in\nextremely critical environments. An Unmanned aerial vehicle (UAV) fleet is an\neffective way to facilitate the Emergency wireless COmmunication NETwork\n(EcoNet). In this article, a MUlti-tier Heterogeneous UAV Network (MuHun),\nwhich is with different UAV fleets in different altitudes, is proposed to\nflexibly serve various emergencies. We refresh the key performance indicators\nof full coverage, network capacity, low latency, and energy efficiency in harsh\nenvironments. Then, we present the special challenges regarding\nshadowing-dominated complex channel model, energy supply limited\nshort-endurance, various communication mechanisms coexistence, and\ncommunication island for underground users in UAV-based EcoNet, followed by the\nMuHun-based EcoNet architecture and its advantages. Furthermore, some potential\nsolutions such as the new hybrid-channel adapted resource allocation,\nreconfigurable intelligent surface assisted UAV communications, competitive\nheterogenous-networks, and magnetic induction based air-to-ground/underground\ncommunications are discussed to effectively achieve full coverage, high\ncapacity, high energy efficiency, and diverse qualities of services for EcoNets\nin harsh environments.\n","subjects":["Computing Research Repository/Emerging Technologies","Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}