{"id":"2407.13575","title":"With or Without Replacement? Improving Confidence in Fourier Imaging","authors":"Frederik Hoppe, Claudio Mayrink Verdun, Felix Krahmer, Marion I.\n  Menzel and Holger Rauhut","authorsParsed":[["Hoppe","Frederik",""],["Verdun","Claudio Mayrink",""],["Krahmer","Felix",""],["Menzel","Marion I.",""],["Rauhut","Holger",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 15:15:19 GMT"}],"updateDate":"2024-07-19","timestamp":1721315719000,"abstract":"  Over the last few years, debiased estimators have been proposed in order to\nestablish rigorous confidence intervals for high-dimensional problems in\nmachine learning and data science. The core argument is that the error of these\nestimators with respect to the ground truth can be expressed as a Gaussian\nvariable plus a remainder term that vanishes as long as the dimension of the\nproblem is sufficiently high. Thus, uncertainty quantification (UQ) can be\nperformed exploiting the Gaussian model. Empirically, however, the remainder\nterm cannot be neglected in many realistic situations of moderately-sized\ndimensions, in particular in certain structured measurement scenarios such as\nMagnetic Resonance Imaging (MRI). This, in turn, can downgrade the advantage of\nthe UQ methods as compared to non-UQ approaches such as the standard LASSO. In\nthis paper, we present a method to improve the debiased estimator by sampling\nwithout replacement. Our approach leverages recent results of ours on the\nstructure of the random nature of certain sampling schemes showing how a\ntransition between sampling with and without replacement can lead to a weighted\nreconstruction scheme with improved performance for the standard LASSO. In this\npaper, we illustrate how this reweighted sampling idea can also improve the\ndebiased estimator and, consequently, provide a better method for UQ in Fourier\nimaging.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Information Theory","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing","Mathematics/Information Theory","Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}