{"id":"2407.00823","title":"Semi-implicit hybrid finite volume/finite element method for the GPR\n  model of continuum mechanics","authors":"Saray Busto, Laura R\\'io-Mart\\'in","authorsParsed":[["Busto","Saray",""],["Río-Martín","Laura",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 20:37:28 GMT"}],"updateDate":"2024-07-02","timestamp":1719779848000,"abstract":"  We present a new hybrid semi-implicit finite volume / finite element\nnumerical scheme for the solution of incompressible and weakly compressible\nmedia. From the continuum mechanics model proposed by Godunov, Peshkov and\nRomenski (GPR), we derive the incompressible GPR formulation as well as a\nweakly compressible GPR system. As for the original GPR model, the new\nformulations are able to describe different media, from elastoplastic solids to\nviscous fluids, depending on the values set for the model's relaxation\nparameters. Then, we propose a new numerical method for the solution of both\nmodels based on the splitting of the original systems into three subsystems:\none containing the convective part and non-conservative products, a second\nsubsystem for the source terms of the distortion tensor and heat flux equations\nand, finally, a pressure subsystem. In the first stage of the algorithm, the\ntransport subsystem is solved by employing an explicit finite volume method,\nwhile the source terms are solved implicitly. Next, the pressure subsystem is\nimplicitly discretised using finite elements. Within this methodology,\nunstructured grids are employed, with the pressure defined in the primal grid\nand the rest of the variables computed in the dual grid. To evaluate the\nperformance of the proposed scheme, a numerical convergence analysis is carried\nout, which confirms the second order of accuracy in space. A wide range of\nbenchmarks is reproduced for the incompressible and weakly compressible cases,\nconsidering both solid and fluid media. These results demonstrate the good\nbehaviour and robustness of the proposed scheme in a variety of scenarios and\nconditions.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}