{"id":"2407.19281","title":"How to define temperature in active systems","authors":"Lukas Hecht, Lorenzo Caprini, Hartmut L\\\"owen, Benno Liebchen","authorsParsed":[["Hecht","Lukas",""],["Caprini","Lorenzo",""],["Löwen","Hartmut",""],["Liebchen","Benno",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 15:28:12 GMT"}],"updateDate":"2024-07-30","timestamp":1722094092000,"abstract":"  We are used to measure temperature with a thermometer and we know from\neveryday life that different types of thermometers measure the same\ntemperature. This experience can be based on equilibrium thermodynamics, which\nexplains the equivalence of different possibilities to define temperature. In\ncontrast, for systems out of equilibrium such as active matter, measurements\nperformed with different thermometers can generally lead to different\ntemperature values. In the present work, we systematically compare different\npossibilities to define temperature for active systems. Based on simulations\nand theory for inertial active Brownian particles, we find that different\ntemperatures generally lead to different temperature values, as expected.\nRemarkably, however, we find that different temperatures not only lead to the\nsame values near equilibrium (low P\\'eclet number or high particle mass), but\neven far from equilibrium and in cases where entropy production is large,\nseveral different temperatures approximately coincide. In particular, we find\nthat the kinetic temperature, the configurational temperature, and temperatures\nbased on higher moments of the velocity distribution constitute a class of\ntemperatures that all assume very similar values over a wide parameter range.\nThe effective temperature also leads to similar temperature values but only in\na limited parameter regime. Notably, temperatures exploiting the virial\ntheorem, the Stokes-Einstein relation, or a harmonic confinement form a second\nclass of temperatures whose values approximately coincide with each other but\nwhich strongly differ from those of the first class. Finally, we identify\nadvantages and disadvantages of the different possibilities to define\ntemperature and discuss their relevance for measuring the temperature of an\nactive system.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Statistical Mechanics","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}