{"id":"2407.04516","title":"G-Adaptive mesh refinement -- leveraging graph neural networks and\n  differentiable finite element solvers","authors":"James Rowbottom, Georg Maierhofer, Teo Deveney, Katharina Schratz,\n  Pietro Li\\`o, Carola-Bibiane Sch\\\"onlieb, Chris Budd","authorsParsed":[["Rowbottom","James",""],["Maierhofer","Georg",""],["Deveney","Teo",""],["Schratz","Katharina",""],["Liò","Pietro",""],["Schönlieb","Carola-Bibiane",""],["Budd","Chris",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 13:57:35 GMT"}],"updateDate":"2024-07-08","timestamp":1720187855000,"abstract":"  We present a novel, and effective, approach to the long-standing problem of\nmesh adaptivity in finite element methods (FEM). FE solvers are powerful tools\nfor solving partial differential equations (PDEs), but their cost and accuracy\nare critically dependent on the choice of mesh points. To keep computational\ncosts low, mesh relocation (r-adaptivity) seeks to optimise the position of a\nfixed number of mesh points to obtain the best FE solution accuracy. Classical\napproaches to this problem require the solution of a separate nonlinear\n\"meshing\" PDE to find the mesh point locations. This incurs significant cost at\nremeshing and relies on certain a-priori assumptions and guiding heuristics for\noptimal mesh point location. Recent machine learning approaches to r-adaptivity\nhave mainly focused on the construction of fast surrogates for such classical\nmethods. Our new approach combines a graph neural network (GNN) powered\narchitecture, with training based on direct minimisation of the FE solution\nerror with respect to the mesh point locations. The GNN employs graph neural\ndiffusion (GRAND), closely aligning the mesh solution space to that of\nclassical meshing methodologies, thus replacing heuristics with a learnable\nstrategy, and providing a strong inductive bias. This allows for rapid and\nrobust training and results in an extremely efficient and effective GNN\napproach to online r-adaptivity. This method outperforms classical and prior ML\napproaches to r-adaptive meshing on the test problems we consider, in\nparticular achieving lower FE solution error, whilst retaining the significant\nspeed-up over classical methods observed in prior ML work.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}