{"id":"2407.19660","title":"Towards a Knowledge guided Multimodal Foundation Model for\n  Spatio-Temporal Remote Sensing Applications","authors":"Praveen Ravirathinam, Ankush Khandelwal, Rahul Ghosh, Vipin Kumar","authorsParsed":[["Ravirathinam","Praveen",""],["Khandelwal","Ankush",""],["Ghosh","Rahul",""],["Kumar","Vipin",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 02:49:55 GMT"}],"updateDate":"2024-07-30","timestamp":1722221395000,"abstract":"  In recent years, there is increased interest in foundation models for\ngeoscience due to vast amount of earth observing satellite imagery. Existing\nremote sensing foundation models make use of the various sources of spectral\nimagery to create large models pretrained on masked reconstruction task. The\nembeddings from these foundation models are then used for various downstream\nremote sensing applications. In this paper we propose a foundational modeling\nframework for remote sensing geoscience applications, that goes beyond these\ntraditional single modality masked autoencoder family of foundation models.\nThis framework leverages the knowledge guided principles that the spectral\nimagery captures the impact of the physical drivers on the environmental\nsystem, and that the relationship between them is governed by the\ncharacteristics of the system. Specifically, our method, called MultiModal\nVariable Step Forecasting (MM-VSF), uses mutlimodal data (spectral imagery and\nweather) as its input and a variable step forecasting task as its pretraining\nobjective. In our evaluation we show forecasting of satellite imagery using\nweather can be used as an effective pretraining task for foundation models. We\nfurther show the effectiveness of the embeddings from MM-VSF on the downstream\ntask of pixel wise crop mapping, when compared with a model trained in the\ntraditional setting of single modality input and masked reconstruction based\npretraining.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}