{"id":"2407.08868","title":"Generalizable Physics-Informed Learning for Stochastic Safety-Critical\n  Systems","authors":"Zhuoyuan Wang, Albert Chern, Yorie Nakahira","authorsParsed":[["Wang","Zhuoyuan",""],["Chern","Albert",""],["Nakahira","Yorie",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 21:10:03 GMT"},{"version":"v2","created":"Mon, 15 Jul 2024 16:47:42 GMT"},{"version":"v3","created":"Tue, 13 Aug 2024 18:53:03 GMT"},{"version":"v4","created":"Sun, 18 Aug 2024 20:37:23 GMT"}],"updateDate":"2024-08-20","timestamp":1720732203000,"abstract":"  Accurate estimate of long-term risk is critical for safe decision-making, but\nsampling from rare risk events and long-term trajectories can be prohibitively\ncostly. Risk gradient can be used in many first-order techniques for learning\nand control methods, but gradient estimate is difficult to obtain using Monte\nCarlo (MC) methods because the infinitesimal divisor may significantly amplify\nsampling noise. Motivated by this gap, we propose an efficient method to\nevaluate long-term risk probabilities and their gradients using short-term\nsamples without sufficient risk events. We first derive that four types of\nlong-term risk probability are solutions of certain partial differential\nequations (PDEs). Then, we propose a physics-informed learning technique that\nintegrates data and physics information (aforementioned PDEs). The physics\ninformation helps propagate information beyond available data and obtain\nprovable generalization beyond available data, which in turn enables long-term\nrisk to be estimated using short-term samples of safe events. Finally, we\ndemonstrate in simulation that the proposed technique has improved sample\nefficiency, generalizes well to unseen regions, and adapts to changing system\nparameters.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}