{"id":"2407.15386","title":"Super-Earth formation with slow migration from a ring in an evolving\n  peaked disk compatible with terrestrial planet formation","authors":"Masahiro Ogihara, Alessandro Morbidelli, Masanobu Kunitomo","authorsParsed":[["Ogihara","Masahiro",""],["Morbidelli","Alessandro",""],["Kunitomo","Masanobu",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 05:28:43 GMT"}],"updateDate":"2024-07-23","timestamp":1721626123000,"abstract":"  For the origin of the radially concentrated solar system's terrestrial\nplanets, planet formation from a ring of solids at about 1 au from the Sun with\nconvergent/suppressed type I migration is preferred. On the other hand, many\nsuper-Earths and sub-Neptunes are found in the close-in region with orbital\nperiods of 10-100 days, so that planet formation from rings in the 1-au region\nwould require some degree of inward migration. One way to realize these\ndifferent formation scenarios is to use different gas disk models. In this\nstudy we investigate whether different scenarios can be realized within a\nsingle framework. We consider a disk model that evolves via disk winds and\ndevelops a density peak, and study planet formation and orbital evolution using\nN-body simulations. Planets with masses less than an Earth mass formed from a\nlow-mass ring resembling the solar system do not migrate inward even in the\nevolving disk and remain near 1-au orbits, maintaining a high radial mass\nconcentration. On the other hand, planets with masses greater than an Earth\nmass formed from a massive ring slowly migrate inward above the outward\nmigration region. As a result, the innermost planet can move to an orbit of\nabout 10 days. The simulation results also reproduce the characteristics (e.g.,\nmass distribution, eccentricity, orbital separation) of the solar system and\nsuper-Earth/sub-Neptune systems. Our model predicts that Earths and sub-Earths\nformed by migration from rings at near the 1-au region are less abundant in the\nclose-in region.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}