{"id":"2407.15692","title":"Impact of electron correlations on two-particle charge response in\n  electron- and hole-doped cuprates","authors":"Abhishek Nag, Luciano Zinni, Jaewon Choi, J. Li, Sijia Tu, A. C.\n  Walters, S. Agrestini, S. M. Hayden, Mat\\'ias Bejas, Zefeng Lin, H. Yamase,\n  Kui Jin, M. Garc\\'ia-Fern\\'andez, J. Fink, Andr\\'es Greco, Ke-Jin Zhou","authorsParsed":[["Nag","Abhishek",""],["Zinni","Luciano",""],["Choi","Jaewon",""],["Li","J.",""],["Tu","Sijia",""],["Walters","A. C.",""],["Agrestini","S.",""],["Hayden","S. M.",""],["Bejas","Matías",""],["Lin","Zefeng",""],["Yamase","H.",""],["Jin","Kui",""],["García-Fernández","M.",""],["Fink","J.",""],["Greco","Andrés",""],["Zhou","Ke-Jin",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:59:24 GMT"}],"updateDate":"2024-07-23","timestamp":1721660364000,"abstract":"  Estimating many-body effects that deviate from an independent particle\napproach, has long been a key research interest in condensed matter physics.\nLayered cuprates are prototypical systems, where electron-electron interactions\nare found to strongly affect the dynamics of single-particle excitations. It is\nhowever, still unclear how the electron correlations influence charge\nexcitations, such as plasmons, which have been variously treated with either\nweak or strong correlation models. In this work, we demonstrate the hybridised\nnature of collective valence charge fluctuations leading to dispersing\nacoustic-like plasmons in hole-doped La$_{1.84}$Sr$_{0.16}$CuO$_{4}$ and\nelectron-doped La$_{1.84}$Ce$_{0.16}$CuO$_{4}$ using the two-particle probe,\nresonant inelastic x-ray scattering. We then describe the plasmon dispersions\nin both systems, within both the weak mean-field Random Phase Approximation\n(RPA) and strong coupling $t$-$J$-$V$ models. The $t$-$J$-$V$ model, which\nincludes the correlation effects implicitly, accurately describes the plasmon\ndispersions as resonant excitations outside the single-particle intra-band\ncontinuum. In comparison, a quantitative description of the plasmon dispersion\nin the RPA approach is obtained only upon explicit consideration of\nre-normalized electronic band parameters. Our comparative analysis shows that\nelectron correlations significantly impact the low-energy plasmon excitations\nacross the cuprate doping phase diagram, even at long wavelengths. Thus,\ncomplementary information on the evolution of electron correlations, influenced\nby the rich electronic phases in condensed matter systems, can be extracted\nthrough the study of two-particle charge response.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}