{"id":"2407.14446","title":"Electric Bus Scheduling with Non-Linear Charging, Power Grid\n  Bottlenecks, and Dynamic Recharge Rates","authors":"Fabian L\\\"obel and Ralf Bornd\\\"orfer and Steffen Weider","authorsParsed":[["Löbel","Fabian",""],["Borndörfer","Ralf",""],["Weider","Steffen",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 16:31:04 GMT"}],"updateDate":"2024-07-22","timestamp":1721406664000,"abstract":"  Public transport operators are gradually electrifying their bus fleets,\npredominantly with battery-powered drive trains. These buses commonly have to\nbe scheduled to recharge in-service, which gives rise to a number of\nchallenges. A major problem is that the relationship between charging time and\nreplenished driving range is non-linear, which is often approximately modeled.\nWe examine the associated approximation error and show how it can result in a\ngross over- or underestimation of the fleet size. Moreover, we demonstrate that\ncommonly used piecewise linear underestimations of the charge curve do not\nresult in an underestimation of the predicted charge states in electric vehicle\nscheduling and routing models.\n  Furthermore, since power grid upgrades are currently not keeping up with an\never growing electricity demand, operators are introducing active charge\nmanagement tools to dynamically adjust the charging speed depending on the\namount of available energy. It is therefore imperative to extend electric bus\nscheduling models to account for these developments.\n  We propose a novel mixed-integer programming formulation for the electric bus\nscheduling problem featuring an improved approximation of the non-linear\nbattery charging behavior as well as dynamic recharge speeds to accommodate\ngrid load limits. The idea is to linearly interpolate what we call the charge\nincrement function, which is closely related to the derivative of the commonly\nused charge curve. This provides very good error control and integrates easily\ninto integer programming models. We demonstrate the practical usefulness of our\nmodel on a diverse library of real-life instances.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}