{"id":"2407.07917","title":"Non-Cooperative Backdoor Attacks in Federated Learning: A New Threat\n  Landscape","authors":"Tuan Nguyen, Dung Thuy Nguyen, Khoa D Doan, Kok-Seng Wong","authorsParsed":[["Nguyen","Tuan",""],["Nguyen","Dung Thuy",""],["Doan","Khoa D",""],["Wong","Kok-Seng",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 22:03:13 GMT"}],"updateDate":"2024-07-12","timestamp":1720216993000,"abstract":"  Despite the promise of Federated Learning (FL) for privacy-preserving model\ntraining on distributed data, it remains susceptible to backdoor attacks. These\nattacks manipulate models by embedding triggers (specific input patterns) in\nthe training data, forcing misclassification as predefined classes during\ndeployment. Traditional single-trigger attacks and recent work on cooperative\nmultiple-trigger attacks, where clients collaborate, highlight limitations in\nattack realism due to coordination requirements. We investigate a more alarming\nscenario: non-cooperative multiple-trigger attacks. Here, independent\nadversaries introduce distinct triggers targeting unique classes. These\nparallel attacks exploit FL's decentralized nature, making detection difficult.\nOur experiments demonstrate the alarming vulnerability of FL to such attacks,\nwhere individual backdoors can be successfully learned without impacting the\nmain task. This research emphasizes the critical need for robust defenses\nagainst diverse backdoor attacks in the evolving FL landscape. While our focus\nis on empirical analysis, we believe it can guide backdoor research toward more\nrealistic settings, highlighting the crucial role of FL in building robust\ndefenses against diverse backdoor threats. The code is available at\n\\url{https://anonymous.4open.science/r/nba-980F/}.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}