{"id":"2407.15145","title":"Janus MoSSe nanotubes on one-dimensional SWCNT-BNNT van der Waals\n  heterostructures","authors":"Chunxia Yang, Qingyun Lin, Yuta Sato, Yanlin Gao, Yongjia Zheng,\n  Tianyu Wang, Yicheng Ma, Mina Maruyama, Susumu Okada, Kazu Suenaga, Shigeo\n  Maruyama, Rong Xiang","authorsParsed":[["Yang","Chunxia",""],["Lin","Qingyun",""],["Sato","Yuta",""],["Gao","Yanlin",""],["Zheng","Yongjia",""],["Wang","Tianyu",""],["Ma","Yicheng",""],["Maruyama","Mina",""],["Okada","Susumu",""],["Suenaga","Kazu",""],["Maruyama","Shigeo",""],["Xiang","Rong",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 12:39:03 GMT"}],"updateDate":"2024-07-23","timestamp":1721565543000,"abstract":"  2D Janus TMDC layers with broken mirror symmetry exhibit giant Rashba\nsplitting and unique excitonic behavior. For their 1D counterparts, the Janus\nnanotubes possess curvature, which introduce an additional degree of freedom to\nbreak the structural symmetry. This could potentially enhance these effects or\neven give rise to novel properties. In addition, Janus MSSe nanotubes (M=W,\nMo), with diameters surpassing 4 nm and Se positioned externally, consistently\ndemonstrate lower energy states than their Janus monolayer counterparts.\nHowever, there have been limited studies on the preparation of Janus nanotubes,\ndue to the synthesis challenge and limited sample quality. Here we first\nsynthesized MoS2 nanotubes based on SWCNT-BNNT heterostructure and then\nexplored the growth of Janus MoSSe nanotubes from MoS2 nanotubes with the\nassistance of H2 plasma at room temperature. The successful formation of the\nJanus structure was confirmed via Raman spectroscopy, and microscopic\nmorphology and elemental distribution of the grown samples were further\ncharacterized. The synthesis of Janus MoSSe nanotubes based on SWCNT-BNNT\nenables the further exploration of novel properties in Janus TMDC nanotubes.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}