{"id":"2407.14988","title":"On the boundedness and Schatten class property of noncommutative\n  martingale paraproducts and operator-valued commutators","authors":"Zhenguo Wei, Hao Zhang","authorsParsed":[["Wei","Zhenguo",""],["Zhang","Hao",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 21:44:50 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 19:21:01 GMT"}],"updateDate":"2024-09-05","timestamp":1721511890000,"abstract":"  We study the Schatten class membership of semicommutative martingale\nparaproducts and use the transference method to describe Schatten class\nmembership of purely noncommutative martingale paraproducts, especially for CAR\nalgebras and $\\mathop{\\otimes}\\limits_{k=1}^{\\infty}\\mathbb{M}_{d}$ in terms of\nmartingale Besov spaces.\n  Using Hyt\\\"{o}nen's dyadic martingale technique, we also obtain sufficient\nconditions on the Schatten class membership and the boundedness of\noperator-valued commutators involving general singular integral operators.\n  We establish the complex median method, which is applicable to complex-valued\nfunctions. We apply it to get the optimal necessary conditions on the Schatten\nclass membership of operator-valued commutators associated with non-degenerate\nkernels in Hyt\\\"{o}nen's sense. This resolves the problem on the\ncharacterization of Schatten class membership of operator-valued commutators.\nOur results are new even in the scalar case.\n  Our new approach is built on Hyt\\\"{o}nen's dyadic martingale technique and\nthe complex median method. Compared with all the previous ones, this new one is\nmore powerful in several aspects: $(a)$ it permits us to deal with more general\nsingular integral operators with little smoothness; $(b)$ it allows us to deal\nwith commutators with complex-valued kernels; $(c)$ it goes much further beyond\nthe scalar case and can be applied to the semicommutative setting.\n  By a weak-factorization type decomposition, we get some necessary but not\noptimal conditions on the boundedness of operator-valued commutators. In\naddition, we give a new proof of the boundedness of commutators still involving\ngeneral singular integral operators concerning $BMO$ spaces in the commutative\nsetting.\n","subjects":["Mathematics/Functional Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}