{"id":"2407.18512","title":"SPOLRE: Semantic Preserving Object Layout Reconstruction for Image\n  Captioning System Testing","authors":"Yi Liu, Guanyu Wang, Xinyi Zheng, Gelei Deng, Kailong Wang, Yang Liu\n  and Haoyu Wang","authorsParsed":[["Liu","Yi",""],["Wang","Guanyu",""],["Zheng","Xinyi",""],["Deng","Gelei",""],["Wang","Kailong",""],["Liu","Yang",""],["Wang","Haoyu",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 04:46:31 GMT"}],"updateDate":"2024-07-29","timestamp":1721969191000,"abstract":"  Image captioning (IC) systems, such as Microsoft Azure Cognitive Service,\ntranslate image content into descriptive language but can generate inaccuracies\nleading to misinterpretations. Advanced testing techniques like MetaIC and ROME\naim to address these issues but face significant challenges. These methods\nrequire intensive manual labor for detailed annotations and often produce\nunrealistic images, either by adding unrelated objects or failing to remove\nexisting ones. Additionally, they generate limited test suites, with MetaIC\nrestricted to inserting specific objects and ROME limited to a narrow range of\nvariations. We introduce SPOLRE, a novel automated tool for semantic-preserving\nobject layout reconstruction in IC system testing. SPOLRE leverages four\ntransformation techniques to modify object layouts without altering the image's\nsemantics. This automated approach eliminates the need for manual annotations\nand creates realistic, varied test suites. Our tests show that over 75% of\nsurvey respondents find SPOLRE-generated images more realistic than those from\nstate-of-the-art methods. SPOLRE excels in identifying caption errors,\ndetecting 31,544 incorrect captions across seven IC systems with an average\nprecision of 91.62%, surpassing other methods which average 85.65% accuracy and\nidentify 17,160 incorrect captions. Notably, SPOLRE identified 6,236 unique\nissues within Azure, demonstrating its effectiveness against one of the most\nadvanced IC systems.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}