{"id":"2407.08506","title":"Imitation Learning for Robotic Assisted Ultrasound Examination of Deep\n  Venous Thrombosis using Kernelized Movement Primitives","authors":"Diego Dall'Alba, Lorenzo Busellato, Thiusius Rajeeth Savarimuthu,\n  Zhuoqi Cheng, I\\~nigo Iturrate","authorsParsed":[["Dall'Alba","Diego",""],["Busellato","Lorenzo",""],["Savarimuthu","Thiusius Rajeeth",""],["Cheng","Zhuoqi",""],["Iturrate","Iñigo",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 13:44:41 GMT"}],"updateDate":"2024-07-12","timestamp":1720705481000,"abstract":"  Deep Vein Thrombosis (DVT) is a common yet potentially fatal condition, often\nleading to critical complications like pulmonary embolism. DVT is commonly\ndiagnosed using Ultrasound (US) imaging, which can be inconsistent due to its\nhigh dependence on the operator's skill. Robotic US Systems (RUSs) aim to\nimprove diagnostic test consistency but face challenges with the complex\nscanning pattern needed for DVT assessment, where precise control over US probe\npressure is crucial for indirectly detecting occlusions. This work introduces\nan imitation learning method, based on Kernelized Movement Primitives (KMP), to\nstandardize DVT US exams by training an autonomous robotic controller using\nsonographer demonstrations. A new recording device design enhances\ndemonstration ergonomics, integrating with US probes and enabling seamless\nforce and position data recording. KMPs are used to capture scanning skills,\nlinking scan trajectory and force, enabling generalization beyond the\ndemonstrations. Our approach, evaluated on synthetic models and volunteers,\nshows that the KMP-based RUS can replicate an expert's force control and image\nquality in DVT US examination. It outperforms previous methods using manually\ndefined force profiles, improving exam standardization and reducing reliance on\nspecialized sonographers.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}