{"id":"2407.19189","title":"Exploring the soft pinning effect in the dynamics and the structure\n  dynamics correlation in multicomponent supercooled liquids","authors":"Ehtesham Anwar, Palak Patel, Mohit Sharma, Sarika Maitra Bhattacharyya","authorsParsed":[["Anwar","Ehtesham",""],["Patel","Palak",""],["Sharma","Mohit",""],["Bhattacharyya","Sarika Maitra",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 06:47:59 GMT"}],"updateDate":"2024-07-30","timestamp":1722062879000,"abstract":"  We study multicomponent liquids by increasing the mass of $15\\%$ of the\nparticles in a binary Kob-Andersen model. We find that the heavy particles have\ndual effects on the lighter particles. At higher temperatures, there is a\nsignificant decoupling of the dynamics between heavier and lighter particles,\nwith the former resembling a pinned particle to the latter. The dynamics of the\nlighter particles slow down due to the excluded volume around the nearly\nimmobile heavier particles. Conversely, at lower temperatures, there is a\ncoupling between the dynamics of the heavier and lighter particles. The heavier\nparticles' mass slows down the dynamics of both types of particles. This makes\nthe soft pinning effect of the heavy particles questionable in this regime. We\ndemonstrate that as the mass of the heavy particles increases, the coupling of\nthe dynamics between the lighter and heavier particles weakens. Consequently,\nthe heavier the mass of the heavy particles, the more effectively they act as\nsoft pinning centres in both high and low-temperature regimes. A key finding is\nthat akin to the pinned system, the self and collective dynamics of the lighter\nparticles decouple from each other as the mass of the heavy particles has a\nmore pronounced impact on the latter. We analyze the structure dynamics\ncorrelation by considering the system under the binary and modified quaternary\nframework, the latter describing the pinned system. Our findings indicate that\nwhenever the heavy mass particles function as soft pinning centres, the\nmodified quaternary framework predicts a higher correlation.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Statistical Mechanics","Physics/Computational Physics","Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}