{"id":"2407.13161","title":"How to quantify an examination? Evidence from physics examinations via\n  complex networks","authors":"Min Xia, Zhu Su, Weibing Deng, Xiumei Feng and Benwei Zhang","authorsParsed":[["Xia","Min",""],["Su","Zhu",""],["Deng","Weibing",""],["Feng","Xiumei",""],["Zhang","Benwei",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 05:06:18 GMT"}],"updateDate":"2024-07-19","timestamp":1721279178000,"abstract":"  Given the untapped potential for continuous improvement of examinations,\nquantitative investigations of examinations could guide efforts to considerably\nimprove learning efficiency and evaluation and thus greatly help both learners\nand educators. However, there is a general lack of quantitative methods for\ninvestigating examinations. To address this gap, we propose a new metric via\ncomplex networks; i.e., the knowledge point network (KPN) of an examination is\nconstructed by representing the knowledge points (concepts, laws, etc.) as\nnodes and adding links when these points appear in the same question. Then, the\ntopological quantities of KPNs, such as degree, centrality, and community, can\nbe employed to systematically explore the structural properties and evolution\nof examinations. In this work, 35 physics examinations from the NCEE\nexamination spanning from 2006 to 2020 were investigated as an evidence. We\nfound that the constructed KPNs are scale-free networks that show strong\nassortativity and small-world effects in most cases. The communities within the\nKPNs are obvious, and the key nodes are mainly related to mechanics and\nelectromagnetism. Different question types are related to specific knowledge\npoints, leading to noticeable structural variations in KPNs. Moreover, changes\nin the KPN topology between examinations administered in different years may\noffer insights guiding college entrance examination reforms. Based on\ntopological quantities such as the average degree, network density, average\nclustering coefficient, and network transitivity, the Fd is proposed to\nevaluate examination difficulty. All the above results show that our approach\ncan comprehensively quantify the knowledge structures and examination\ncharacteristics. These networks may elucidate comprehensive examination\nknowledge graphs for educators and guide improvements in teaching.\n","subjects":["Physics/Physics and Society","Computing Research Repository/Computers and Society","Physics/Physics Education"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}