{"id":"2407.12086","title":"Crossing the desert: Towards predictions for SMEFT coefficients from\n  quantum gravity","authors":"Lydia Brenner, Abhishek Chikkaballi, Astrid Eichhorn, Shouryya Ray","authorsParsed":[["Brenner","Lydia",""],["Chikkaballi","Abhishek",""],["Eichhorn","Astrid",""],["Ray","Shouryya",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 18:00:02 GMT"}],"updateDate":"2024-07-18","timestamp":1721152802000,"abstract":"  The SMEFT provides a general framework to search for new physics beyond the\ncurrent reach of direct detection. One such form of new physics is quantum\ngravity. Based on dimensional analysis, one would expect the prediction that\nthe quantum-gravity contribution to the SMEFT coefficients is unmeasurably tiny\nat LHC scales. In this paper, we test this expectation in a specific framework\nfor quantum gravity, namely the asymptotic safety framework. In this framework,\nWilson coefficients can be calculated in relatively straightforward manner,\nmaking a connection between quantum gravity and LHC tests of the SMEFT\nachievable. We work in a toy model of the Standard Model fermion sector to\ninvestigate four-fermion couplings. We find three scenarios in this toy model,\nbased on three distinct fixed points of the Renormalization Group flow. In the\nfirst scenario, the expectation from dimensional analysis is borne out and\nWilson coefficients are Planck-scale suppressed. In the second and third\nscenarios, the Wilson coefficients are significantly larger than expected by\ndimensional analysis, due to interacting fixed points which generate an\neffective new-physics scale that lies between the LHC scale and the Planck\nscale. We comment on the implications of these results for the testability of\nasymptotically safe gravity within the SMEFT framework at the LHC.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}