{"id":"2407.10294","title":"Inhomogeneous terminators on the exoplanet WASP-39 b","authors":"N\\'estor Espinoza, Maria E. Steinrueck, James Kirk, Ryan J. MacDonald,\n  Arjun B. Savel, Kenneth Arnold, Eliza M.-R. Kempton, Matthew M. Murphy,\n  Ludmila Carone, Maria Zamyatina, David A. Lewis, Dominic Samra, Sven Kiefer,\n  Emily Rauscher, Duncan Christie, Nathan Mayne, Christiane Helling, Zafar\n  Rustamkulov, Vivien Parmentier, Erin M. May, Aarynn L. Carter, Xi Zhang,\n  Mercedes L\\'opez-Morales, Natalie Allen, Jasmina Blecic, Leen Decin, Luigi\n  Mancini, Karan Molaverdikhani, Benjamin V. Rackham, Enric Palle, Shang-Min\n  Tsai, Eva-Maria Ahrer, Jacob L. Bean, Ian J. M. Crossfield, David Haegele,\n  Eric H\\'ebrard, Laura Kreidberg, Diana Powell, Aaron D. Schneider, Luis\n  Welbanks, Peter Wheatley, Rafael Brahm and Nicolas Crouzet","authorsParsed":[["Espinoza","Néstor",""],["Steinrueck","Maria E.",""],["Kirk","James",""],["MacDonald","Ryan J.",""],["Savel","Arjun B.",""],["Arnold","Kenneth",""],["Kempton","Eliza M. -R.",""],["Murphy","Matthew M.",""],["Carone","Ludmila",""],["Zamyatina","Maria",""],["Lewis","David A.",""],["Samra","Dominic",""],["Kiefer","Sven",""],["Rauscher","Emily",""],["Christie","Duncan",""],["Mayne","Nathan",""],["Helling","Christiane",""],["Rustamkulov","Zafar",""],["Parmentier","Vivien",""],["May","Erin M.",""],["Carter","Aarynn L.",""],["Zhang","Xi",""],["López-Morales","Mercedes",""],["Allen","Natalie",""],["Blecic","Jasmina",""],["Decin","Leen",""],["Mancini","Luigi",""],["Molaverdikhani","Karan",""],["Rackham","Benjamin V.",""],["Palle","Enric",""],["Tsai","Shang-Min",""],["Ahrer","Eva-Maria",""],["Bean","Jacob L.",""],["Crossfield","Ian J. M.",""],["Haegele","David",""],["Hébrard","Eric",""],["Kreidberg","Laura",""],["Powell","Diana",""],["Schneider","Aaron D.",""],["Welbanks","Luis",""],["Wheatley","Peter",""],["Brahm","Rafael",""],["Crouzet","Nicolas",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 18:59:36 GMT"}],"updateDate":"2024-07-16","timestamp":1720983576000,"abstract":"  Transmission spectroscopy has been a workhorse technique over the past two\ndecades to constrain the physical and chemical properties of exoplanet\natmospheres. One of its classical key assumptions is that the portion of the\natmosphere it probes -- the terminator region -- is homogeneous. Several works\nin the past decade, however, have put this into question for highly irradiated,\nhot ($T_{eq}\\gtrsim 1000$ K) gas giant exoplanets both empirically and via\n3-dimensional modelling. While models predict clear differences between the\nevening (day-to-night) and morning (night-to-day) terminators, direct\nmorning/evening transmission spectra in a wide wavelength range has not been\nreported for an exoplanet to date. Under the assumption of precise and accurate\norbital parameters on WASP-39 b, here we report the detection of inhomogeneous\nterminators on the exoplanet WASP-39 b, which allows us to retrieve its morning\nand evening transmission spectra in the near-infrared ($2-5\\ \\mu$m) using JWST.\nWe observe larger transit depths in the evening which are, on average, $405 \\pm\n88$ ppm larger than the morning ones, also having qualitatively larger features\nthan the morning spectrum. The spectra are best explained by models in which\nthe evening terminator is hotter than the morning terminator by\n$177^{+65}_{-57}$ K with both terminators having C/O ratios consistent with\nsolar. General circulation models (GCMs) predict temperature differences\nbroadly consistent with the above value and point towards a cloudy morning\nterminator and a clearer evening terminator.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}