{"id":"2407.01678","title":"A magnetized strongly turbulent corona as the source of neutrinos from\n  NGC 1068","authors":"Damiano F. G. Fiorillo, Luca Comisso, Enrico Peretti, Maria\n  Petropoulou, Lorenzo Sironi","authorsParsed":[["Fiorillo","Damiano F. G.",""],["Comisso","Luca",""],["Peretti","Enrico",""],["Petropoulou","Maria",""],["Sironi","Lorenzo",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 18:00:03 GMT"}],"updateDate":"2024-07-04","timestamp":1719856803000,"abstract":"  The cores of active galactic nuclei (AGN) are potential accelerators of\n10-100 TeV cosmic rays, in turn producing high-energy neutrinos. This picture\nwas confirmed by the compelling evidence of a TeV neutrino signal from the\nnearby active galaxy NGC 1068, leaving open the question of which is the site\nand mechanism of cosmic ray acceleration. One candidate is the magnetized\nturbulence surrounding the central supermassive black hole. Recent\nparticle-in-cell simulations of magnetized turbulence indicate that stochastic\ncosmic ray acceleration is non-resonant, in contrast to the assumptions of\nprevious studies. We show that this has important consequences on a\nself-consistent theory of neutrino production in the corona, leading to a more\nrapid cosmic ray acceleration than previously considered. The turbulent\nmagnetic field fluctuations needed to explain the neutrino signal are\nconsistent with a magnetically powered corona. We find that strong turbulence,\nwith turbulent magnetic energy density higher than $1\\%$ of the rest mass\nenergy density, naturally explains the normalization of the IceCube neutrino\nflux, in addition to the neutrino spectral shape. Only a fraction of the\nprotons in the corona, which can be directly inferred from the neutrino signal,\nare accelerated to high energies. Thus, in this framework, the neutrino signal\nfrom NGC 1068 provides a testbed for particle acceleration in magnetized\nturbulence.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}