{"id":"2407.07789","title":"Raising the Ceiling: Conflict-Free Local Feature Matching with Dynamic\n  View Switching","authors":"Xiaoyong Lu and Songlin Du","authorsParsed":[["Lu","Xiaoyong",""],["Du","Songlin",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 16:06:32 GMT"},{"version":"v2","created":"Sun, 14 Jul 2024 09:43:55 GMT"}],"updateDate":"2024-07-16","timestamp":1720627592000,"abstract":"  Current feature matching methods prioritize improving modeling capabilities\nto better align outputs with ground-truth matches, which are the theoretical\nupper bound on matching results, metaphorically depicted as the \"ceiling\".\nHowever, these enhancements fail to address the underlying issues that directly\nhinder ground-truth matches, including the scarcity of matchable points in\nsmall scale images, matching conflicts in dense methods, and the\nkeypoint-repeatability reliance in sparse methods. We propose a novel feature\nmatching method named RCM, which Raises the Ceiling of Matching from three\naspects. 1) RCM introduces a dynamic view switching mechanism to address the\nscarcity of matchable points in source images by strategically switching image\npairs. 2) RCM proposes a conflict-free coarse matching module, addressing\nmatching conflicts in the target image through a many-to-one matching strategy.\n3) By integrating the semi-sparse paradigm and the coarse-to-fine architecture,\nRCM preserves the benefits of both high efficiency and global search,\nmitigating the reliance on keypoint repeatability. As a result, RCM enables\nmore matchable points in the source image to be matched in an exhaustive and\nconflict-free manner in the target image, leading to a substantial 260%\nincrease in ground-truth matches. Comprehensive experiments show that RCM\nexhibits remarkable performance and efficiency in comparison to\nstate-of-the-art methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}