{"id":"2407.04016","title":"Mitigating Low-Frequency Bias: Feature Recalibration and Frequency\n  Attention Regularization for Adversarial Robustness","authors":"Kejia Zhang, Juanjuan Weng, Yuanzheng Cai, Zhiming Luo, Shaozi Li","authorsParsed":[["Zhang","Kejia",""],["Weng","Juanjuan",""],["Cai","Yuanzheng",""],["Luo","Zhiming",""],["Li","Shaozi",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 15:46:01 GMT"}],"updateDate":"2024-07-08","timestamp":1720107961000,"abstract":"  Ensuring the robustness of computer vision models against adversarial attacks\nis a significant and long-lasting objective. Motivated by adversarial attacks,\nresearchers have devoted considerable efforts to enhancing model robustness by\nadversarial training (AT). However, we observe that while AT improves the\nmodels' robustness against adversarial perturbations, it fails to improve their\nability to effectively extract features across all frequency components. Each\nfrequency component contains distinct types of crucial information:\nlow-frequency features provide fundamental structural insights, while\nhigh-frequency features capture intricate details and textures. In particular,\nAT tends to neglect the reliance on susceptible high-frequency features. This\nlow-frequency bias impedes the model's ability to effectively leverage the\npotentially meaningful semantic information present in high-frequency features.\nThis paper proposes a novel module called High-Frequency Feature\nDisentanglement and Recalibration (HFDR), which separates features into\nhigh-frequency and low-frequency components and recalibrates the high-frequency\nfeature to capture latent useful semantics. Additionally, we introduce\nfrequency attention regularization to magnitude the model's extraction of\ndifferent frequency features and mitigate low-frequency bias during AT.\nExtensive experiments showcase the immense potential and superiority of our\napproach in resisting various white-box attacks, transfer attacks, and\nshowcasing strong generalization capabilities.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}