{"id":"2407.15412","title":"Visible Photonic Lantern integration, characterization and on-sky\n  testing on Subaru/SCExAO","authors":"S\\'ebastien Vievard, Manon Lallement, Sergio Leon-Saval, Olivier\n  Guyon, Nemanja Jovanovic, Elsa Huby, Sylvestre Lacour, Julien Lozi, Vincent\n  Deo, Kyohoon Ahn, Miles Lucas, Thayne Currie, Steph Sallum, Michael P.\n  Fitzgerald, Chris Betters, Barnaby Norris, Rodrigo Amezcua-Correa, Stephanos\n  Yerolatsitis, Jon Lin, Yoo-Jung Kim, Pradip Gatkine, Takayuki Kotani,\n  Motohide Tamura, Guillermo Martin, Harry-Dean Kenchington Goldsmith, Guy\n  Perrin","authorsParsed":[["Vievard","Sébastien",""],["Lallement","Manon",""],["Leon-Saval","Sergio",""],["Guyon","Olivier",""],["Jovanovic","Nemanja",""],["Huby","Elsa",""],["Lacour","Sylvestre",""],["Lozi","Julien",""],["Deo","Vincent",""],["Ahn","Kyohoon",""],["Lucas","Miles",""],["Currie","Thayne",""],["Sallum","Steph",""],["Fitzgerald","Michael P.",""],["Betters","Chris",""],["Norris","Barnaby",""],["Amezcua-Correa","Rodrigo",""],["Yerolatsitis","Stephanos",""],["Lin","Jon",""],["Kim","Yoo-Jung",""],["Gatkine","Pradip",""],["Kotani","Takayuki",""],["Tamura","Motohide",""],["Martin","Guillermo",""],["Goldsmith","Harry-Dean Kenchington",""],["Perrin","Guy",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 06:39:21 GMT"}],"updateDate":"2024-07-23","timestamp":1721630361000,"abstract":"  A Photonic Lantern (PL) is a novel device that efficiently converts a\nmulti-mode fiber into several single-mode fibers. When coupled with an extreme\nadaptive optics (ExAO) system and a spectrograph, PLs enable high throughput\nspectroscopy at high angular resolution. The Subaru Coronagraphic Extreme\nAdaptive Optics (SCExAO) system of the Subaru Telescope recently acquired a PL\nthat converts its multi-mode input into 19 single-mode outputs. The single mode\noutputs feed a R~4,000 spectrograph optimized for the 600 to 760 nm wavelength\nrange. We present here the integration of the PL on SCExAO, and study the\ndevice performance in terms of throughput, field of view, and spectral\nreconstruction. We also present the first on-sky demonstration of a Visible PL\ncoupled with an ExAO system, showing a significant improvement of x12 in\nthroughput compared to the use of a sole single-mode fiber. This work paves the\nway towards future high throughput photonics instrumentation at small angular\nresolution.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}