{"id":"2407.20116","title":"Modelling vitamin D food fortification among Aboriginal and Torres\n  Strait Islander peoples in Australia","authors":"Belinda Neo, Noel Nannup, Dale Tilbrook, Eleanor Dunlop, John Jacky,\n  Carol Michie, Cindy Prior, Brad Farrant, Carrington C.J. Shepherd and Lucinda\n  J. Black","authorsParsed":[["Neo","Belinda",""],["Nannup","Noel",""],["Tilbrook","Dale",""],["Dunlop","Eleanor",""],["Jacky","John",""],["Michie","Carol",""],["Prior","Cindy",""],["Farrant","Brad",""],["Shepherd","Carrington C. J.",""],["Black","Lucinda J.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 15:47:00 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 02:07:41 GMT"}],"updateDate":"2024-07-31","timestamp":1722268020000,"abstract":"  Background: Low vitamin D intake and high prevalence of vitamin D deficiency\n(serum 25-hydroxyvitamin D concentration < 50 nmol/L) among Aboriginal and\nTorres Strait Islander peoples highlight a need for public health strategies to\nimprove vitamin D status. As few foods contain naturally occurring vitamin D,\nfortification strategies may be needed to improve vitamin D intake and status\namong Aboriginal and Torres Strait Islander peoples. Objective: We aimed to\nmodel vitamin D food fortification scenarios among Aboriginal and Torres Strait\nIslander peoples. Methods: We used nationally representative food consumption\ndata (n=4,109) and vitamin D food composition data to model four food\nfortification scenarios. The modelling for Scenario 1 included foods and\nmaximum vitamin D concentrations permitted for fortification in Australia: i)\ndairy products and alternatives, ii) butter/margarine/oil spreads, iii)\nformulated beverages, and iv) selected ready-to-eat breakfast cereals. The\nmodelling for Scenarios 2a-c included some vitamin D concentrations higher than\npermitted in Australia; Scenario 2c included bread, which is not permitted for\nvitamin D fortification in Australia. Scenario 2a: i) dairy products and\nalternatives, ii) butter/margarine/oil spreads, iii) formulated beverages.\nScenario 2b: as per Scenario 2a plus selected ready-to-eat breakfast cereals.\nScenario 2c: as per Scenario 2b plus bread. Results: Vitamin D fortification of\na range of staple foods could potentially increase vitamin D intake among\nAboriginal and Torres Strait Islander peoples by ~ 3-6 {\\mu}g/day. Scenario 2c\nshowed the highest potential median vitamin D intake increase to ~ 8\n{\\mu}g/day. Across all modelled scenarios, none of the participants had vitamin\nD intake above the Australian upper level of intake of 80 {\\mu}g/day.\n","subjects":["Quantitative Biology/Other Quantitative Biology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}