{"id":"2407.04196","title":"Traveling waves at the surface of active liquid crystals","authors":"Paarth Gulati, Fernando Caballero, Itamar Kolvin, Zhihong You and M.\n  Cristina Marchetti","authorsParsed":[["Gulati","Paarth",""],["Caballero","Fernando",""],["Kolvin","Itamar",""],["You","Zhihong",""],["Marchetti","M. Cristina",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 00:48:48 GMT"},{"version":"v2","created":"Mon, 9 Sep 2024 19:34:51 GMT"}],"updateDate":"2024-09-11","timestamp":1720140528000,"abstract":"  Active liquid crystals exert nonequilibrium stresses on their surroundings\nthrough constant consumption of energy, giving rise to dynamical steady states\nnot present in equilibrium. The paradigmatic example of an active liquid\ncrystal is a suspension of microtubule bundles powered by kinesin motor\nproteins, which exhibits self-sustained spatiotemporal chaotic flows. This\nsystem has been modelled using continuum theories that couple the microtubule\norientation to active flows. Recently the focus has shifted to the interfacial\nproperties of mixtures of active liquid crystals and passive fluids.\nActive/passive interfaces have been shown to support propagating capillary\nwaves in the absence of inertia and offer a promising route for relating\nexperimental parameters to those of the continuum theory. In this paper we\nreport the derivation of a minimal model that captures the linear dynamics of\nthe interface between an active liquid crystal and a passive fluid. We show\nthat the dynamics of the interface, although powered by active flows throughout\nthe bulk, is qualitatively captured by equations that couple non-reciprocally\ninterface height and nematic director at the interface. This minimal model\nreproduces the dynamical structure factor evaluated from numerical simulations\nand the qualitative form of the wave dispersion relation seen in experiments.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Biological Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}