{"id":"2407.09233","title":"An impulsive geomagnetic effect from an early-impulsive flare","authors":"Hugh S. Hudson, Edward. W. Cliver, Lyndsay Fletcher, Declan A. Diver,\n  Peter T. Gallagher, Ying Li, Christopher M.J. Osborne, Craig Stark, and Yang\n  Su","authorsParsed":[["Hudson","Hugh S.",""],["Cliver","Edward. W.",""],["Fletcher","Lyndsay",""],["Diver","Declan A.",""],["Gallagher","Peter T.",""],["Li","Ying",""],["Osborne","Christopher M. J.",""],["Stark","Craig",""],["Su","Yang",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 12:53:46 GMT"}],"updateDate":"2024-07-15","timestamp":1720788826000,"abstract":"  The geomagnetic \"solar flare effect\" (SFE) results from excess ionization in\nthe Earth's ionosphere, famously first detected at the time of the Carrington\nflare in 1859. This indirect detection of a flare constituted one of the first\ncases of \"multimessenger astronomy,\" whereby solar ionizing radiation\nstimulates ionospheric currents. Well-observed SFEs have few-minute time scales\nand perturbations of >10 nT, with the greatest events reaching above 100 nT. In\npreviously reported cases the SFE time profiles tend to resemble those of solar\nsoft X-ray emission, which ionizes the D-region; there is also a\nless-well-studied contribution from Lyman-alpha. We report here a specific\ncase, from flare SOL2024-03-10 (M7.4), in which an impulsive SFE deviated from\nthis pattern. This flare contained an \"early impulsive\" component of\nexceptionally hard radiation, extending up to gamma-ray energies above 1 MeV,\ndistinctly before the bulk of the flare soft X-ray emission. We can\ncharacterize the spectral distribution of this early-impulsive component in\ndetail, thanks to the modern extensive wavelength coverage. A more typical\ngradual SFE occurred during the flare's main phase. We suggest that events of\nthis type warrant exploration of the solar physics in the \"impulse response\"\nlimit of very short time scales.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}