{"id":"2407.00738","title":"Engineering an Efficient Object Tracker for Non-Linear Motion","authors":"Momir Ad\\v{z}emovi\\'c, Predrag Tadi\\'c, Andrija Petrovi\\'c, Mladen\n  Nikoli\\'c","authorsParsed":[["Adžemović","Momir",""],["Tadić","Predrag",""],["Petrović","Andrija",""],["Nikolić","Mladen",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 15:50:54 GMT"}],"updateDate":"2024-07-02","timestamp":1719762654000,"abstract":"  The goal of multi-object tracking is to detect and track all objects in a\nscene while maintaining unique identifiers for each, by associating their\nbounding boxes across video frames. This association relies on matching motion\nand appearance patterns of detected objects. This task is especially hard in\ncase of scenarios involving dynamic and non-linear motion patterns. In this\npaper, we introduce DeepMoveSORT, a novel, carefully engineered multi-object\ntracker designed specifically for such scenarios. In addition to standard\nmethods of appearance-based association, we improve motion-based association by\nemploying deep learnable filters (instead of the most commonly used Kalman\nfilter) and a rich set of newly proposed heuristics. Our improvements to\nmotion-based association methods are severalfold. First, we propose a new\ntransformer-based filter architecture, TransFilter, which uses an object's\nmotion history for both motion prediction and noise filtering. We further\nenhance the filter's performance by careful handling of its motion history and\naccounting for camera motion. Second, we propose a set of heuristics that\nexploit cues from the position, shape, and confidence of detected bounding\nboxes to improve association performance. Our experimental evaluation\ndemonstrates that DeepMoveSORT outperforms existing trackers in scenarios\nfeaturing non-linear motion, surpassing state-of-the-art results on three such\ndatasets. We also perform a thorough ablation study to evaluate the\ncontributions of different tracker components which we proposed. Based on our\nstudy, we conclude that using a learnable filter instead of the Kalman filter,\nalong with appearance-based association is key to achieving strong general\ntracking performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pqfhv78c4VnDlMDcF7rl5NsP1lmvawwH2Irl7Da9KKY","pdfSize":"1265763","objectId":"0xf3f9950009c56d9cd0bece34e06836b2b4b0bdee2ba9419bdb3d0c40054d79cb","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
