{"id":"2407.20353","title":"Optimal Algorithms for Quantifying Spectral Size with Applications to\n  Quasicrystals","authors":"Matthew J. Colbrook, Mark Embree, Jake Fillman","authorsParsed":[["Colbrook","Matthew J.",""],["Embree","Mark",""],["Fillman","Jake",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:06:42 GMT"}],"updateDate":"2024-07-31","timestamp":1722276402000,"abstract":"  We introduce computational strategies for measuring the ``size'' of the\nspectrum of bounded self-adjoint operators using various metrics such as the\nLebesgue measure, fractal dimensions, the number of connected components (or\ngaps), and other spectral characteristics. Our motivation comes from the study\nof almost-periodic operators, particularly those that arise as models of\nquasicrystals. Such operators are known for intricate hierarchical patterns and\noften display delicate spectral properties, such as Cantor spectra, which are\nsignificant in studying quantum mechanical systems and materials science. We\npropose a series of algorithms that compute these properties under different\nassumptions and explore their theoretical implications through the Solvability\nComplexity Index (SCI) hierarchy. This approach provides a rigorous framework\nfor understanding the computational feasibility of these problems, proving\nalgorithmic optimality, and enhancing the precision of spectral analysis in\npractical settings. For example, we show that our methods are optimal by\nproving certain lower bounds (impossibility results) for the class of\nlimit-periodic Schr\\\"odinger operators. We demonstrate our methods through\nstate-of-the-art computations for aperiodic systems in one and two dimensions,\neffectively capturing these complex spectral characteristics. The results\ncontribute significantly to connecting theoretical and computational aspects of\nspectral theory, offering insights that bridge the gap between abstract\nmathematical concepts and their practical applications in physical sciences and\nengineering. Based on our work, we conclude with conjectures and open problems\nregarding the spectral properties of specific models.\n","subjects":["Mathematics/Spectral Theory","Computing Research Repository/Numerical Analysis","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}