{"id":"2407.21135","title":"Physical Modelling and Cancellation of External Passive Intermodulation\n  in FDD MIMO","authors":"Stanislav Krikunov, Viacheslav Zemlyakov, Andrey Ivanov","authorsParsed":[["Krikunov","Stanislav",""],["Zemlyakov","Viacheslav",""],["Ivanov","Andrey",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 18:54:35 GMT"}],"updateDate":"2024-08-01","timestamp":1722365675000,"abstract":"  In this paper, the physical approach to model external (air-induced) passive\nintermodulation (PIM) is presented in a frequency-division duplexing (FDD)\nmultiple-input multiple-output (MIMO) system with an arbitrary number of\ntransceiver chains. The external PIM is a special case of intermodulation\ndistortion (IMD), mainly generated by metallic objects possessing nonlinear\nproperties (\"rusty bolt\" effect). Typically, such sources are located in the\nnear-field or transition region of the antenna array. PIM products may fall\ninto the receiver band of the FDD system, negatively affecting the uplink\nsignal. In contrast to other works, this one directly simulates the physical\nexternal PIM. The system includes models of a point-source external PIM, a\nfinite-length dipole antenna, a MIMO antenna array, and a baseband multicarrier\n5G NR OFDM signal. The Channel coefficients method for multi-PIM-source\ncompensation is replicated to verify the proposed external PIM modelling\napproach. Simulation results of artificially generated PIM cancellation show\nsimilar performance as real-life experiments. Therefore, the proposed approach\nallows testing PIM compensation algorithms on large systems with many antennas\nand arbitrary array structures. This eliminates the need for experiments with\nreal hardware at the development stage of the PIM cancellation algorithm.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}