{"id":"2407.16741","title":"OpenDevin: An Open Platform for AI Software Developers as Generalist\n  Agents","authors":"Xingyao Wang, Boxuan Li, Yufan Song, Frank F. Xu, Xiangru Tang,\n  Mingchen Zhuge, Jiayi Pan, Yueqi Song, Bowen Li, Jaskirat Singh, Hoang H.\n  Tran, Fuqiang Li, Ren Ma, Mingzhang Zheng, Bill Qian, Yanjun Shao, Niklas\n  Muennighoff, Yizhe Zhang, Binyuan Hui, Junyang Lin, Robert Brennan, Hao Peng,\n  Heng Ji, Graham Neubig","authorsParsed":[["Wang","Xingyao",""],["Li","Boxuan",""],["Song","Yufan",""],["Xu","Frank F.",""],["Tang","Xiangru",""],["Zhuge","Mingchen",""],["Pan","Jiayi",""],["Song","Yueqi",""],["Li","Bowen",""],["Singh","Jaskirat",""],["Tran","Hoang H.",""],["Li","Fuqiang",""],["Ma","Ren",""],["Zheng","Mingzhang",""],["Qian","Bill",""],["Shao","Yanjun",""],["Muennighoff","Niklas",""],["Zhang","Yizhe",""],["Hui","Binyuan",""],["Lin","Junyang",""],["Brennan","Robert",""],["Peng","Hao",""],["Ji","Heng",""],["Neubig","Graham",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 17:50:43 GMT"}],"updateDate":"2024-07-26","timestamp":1721757043000,"abstract":"  Software is one of the most powerful tools that we humans have at our\ndisposal; it allows a skilled programmer to interact with the world in complex\nand profound ways. At the same time, thanks to improvements in large language\nmodels (LLMs), there has also been a rapid development in AI agents that\ninteract with and affect change in their surrounding environments. In this\npaper, we introduce OpenDevin, a platform for the development of powerful and\nflexible AI agents that interact with the world in similar ways to those of a\nhuman developer: by writing code, interacting with a command line, and browsing\nthe web. We describe how the platform allows for the implementation of new\nagents, safe interaction with sandboxed environments for code execution,\ncoordination between multiple agents, and incorporation of evaluation\nbenchmarks. Based on our currently incorporated benchmarks, we perform an\nevaluation of agents over 15 challenging tasks, including software engineering\n(e.g., SWE-Bench) and web browsing (e.g., WebArena), among others. Released\nunder the permissive MIT license, OpenDevin is a community project spanning\nacademia and industry with more than 1.3K contributions from over 160\ncontributors and will improve going forward.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}