{"id":"2407.17780","title":"HF-Fed: Hierarchical based customized Federated Learning Framework for\n  X-Ray Imaging","authors":"Tajamul Ashraf and Tisha Madame","authorsParsed":[["Ashraf","Tajamul",""],["Madame","Tisha",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 05:21:48 GMT"}],"updateDate":"2024-07-26","timestamp":1721884908000,"abstract":"  In clinical applications, X-ray technology is vital for noninvasive\nexaminations like mammography, providing essential anatomical information.\nHowever, the radiation risk associated with X-ray procedures raises concerns.\nX-ray reconstruction is crucial in medical imaging for detailed visual\nrepresentations of internal structures, aiding diagnosis and treatment without\ninvasive procedures. Recent advancements in deep learning (DL) have shown\npromise in X-ray reconstruction, but conventional DL methods often require\ncentralized aggregation of large datasets, leading to domain shifts and privacy\nissues. To address these challenges, we introduce the Hierarchical\nFramework-based Federated Learning method (HF-Fed) for customized X-ray\nimaging. HF-Fed tackles X-ray imaging optimization by decomposing the problem\ninto local data adaptation and holistic X-ray imaging. It employs a\nhospital-specific hierarchical framework and a shared common imaging network\ncalled Network of Networks (NoN) to acquire stable features from diverse data\ndistributions. The hierarchical hypernetwork extracts domain-specific\nhyperparameters, conditioning the NoN for customized X-ray reconstruction.\nExperimental results demonstrate HF-Fed's competitive performance, offering a\npromising solution for enhancing X-ray imaging without data sharing. This study\nsignificantly contributes to the literature on federated learning in\nhealthcare, providing valuable insights for policymakers and healthcare\nproviders. The source code and pre-trained HF-Fed model are available at\n\\url{https://tisharepo.github.io/Webpage/}.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}