{"id":"2407.04508","title":"Layer-Dependent Charge State Lifetime of Single Se Vacancies in WSe$_2$","authors":"Laric Bobzien, Jonas Allerbeck, Nils Krane, Andres Ortega-Guerrero,\n  Zihao Wang, Daniel E. Cintron Figueroa, Chengye Dong, Carlo A. Pignedoli,\n  Joshua A. Robinson, Bruno Schuler","authorsParsed":[["Bobzien","Laric",""],["Allerbeck","Jonas",""],["Krane","Nils",""],["Ortega-Guerrero","Andres",""],["Wang","Zihao",""],["Figueroa","Daniel E. Cintron",""],["Dong","Chengye",""],["Pignedoli","Carlo A.",""],["Robinson","Joshua A.",""],["Schuler","Bruno",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 13:48:12 GMT"}],"updateDate":"2024-07-08","timestamp":1720187292000,"abstract":"  Defect engineering in two-dimensional semiconductors has been exploited to\ntune the optoelectronic properties and introduce new quantum states in the band\ngap. Chalcogen vacancies in transition metal dichalcogenides in particular have\nbeen found to strongly impact charge carrier concentration and mobility in 2D\ntransistors as well as feature sub-gap emission and single-photon response. In\nthis letter, we investigate the layer-dependent charge state lifetime of Se\nvacancies in WSe$_2$. In one monolayer WSe$_2$, we observe ultrafast charge\ntransfer from the lowest unoccupied orbital of the top Se vacancy to the\ngraphene substrate within (1.0 $\\pm$ 0.2) ps measured via the current\nsaturation in scanning tunneling approach curves. For Se vacancies decoupled by\nTMD multilayers, we find a sub-exponential increase of the charge lifetime from\n(62 $\\pm$ 14) ps in bilayer to few nanoseconds in four-layer WSe$_2$, alongside\na reduction of the defect state binding energy. Additionally, we attribute the\ncontinuous suppression and energy shift of the dI/dV in-gap defect state\nresonances at very close tip--sample distances to a current saturation effect.\nOur results provide a key measure of the layer-dependent charge transfer rate\nof chalcogen vacancies in TMDs.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6oTtuQ9D7GJmxiYyZ3yRWe7uHryHif1qPi9OqHFaSHk","pdfSize":"27496412"}
