{"id":"2407.16821","title":"Fin ray-inspired, Origami, Small Scale Actuator for Fin Manipulation in\n  Aquatic Bioinspired Robots","authors":"Minh Vu, Revathy Ravuri, Angus Muir, Charles Mackie, Andrew Weightman,\n  Simon Watson, Tim J. Echtermeyer","authorsParsed":[["Vu","Minh",""],["Ravuri","Revathy",""],["Muir","Angus",""],["Mackie","Charles",""],["Weightman","Andrew",""],["Watson","Simon",""],["Echtermeyer","Tim J.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 20:22:12 GMT"}],"updateDate":"2024-07-25","timestamp":1721766132000,"abstract":"  Fish locomotion is enabled by fin rays-actively deformable boney rods, which\nmanipulate the fin to facilitate complex interaction with surrounding water and\nenable propulsion. Replicating the performance and kinematics of the biological\nfin ray from an engineering perspective is a challenging task and has not been\nrealised thus far. This work introduces a prototype of a fin ray-inspired\norigami electromagnetic tendon-driven (FOLD) actuator, designed to emulate the\nfunctional dynamics of fish fin rays. Constructed in minutes using\norigami/kirigami and paper joinery techniques from flat laser-cut polypropylene\nfilm, this actuator is low-cost at {\\pounds}0.80 (\\$1), simple to assemble, and\ndurable for over one million cycles. We leverage its small size to embed eight\ninto two fin membranes of a 135 mm long cuttlefish robot capable of four\ndegrees of freedom swimming. We present an extensive kinematic and swimming\nparametric study with 1015 data points from 7.6 hours of video, which has been\nused to determine optimal kinematic parameters and validate theoretical\nconstants observed in aquatic animals. Notably, the study explores the nuanced\ninterplay between undulation patterns, power distribution, and locomotion\nefficiency, underscoring the potential of the actuator as a model system for\nthe investigation of energy-efficient propulsion and control of bioinspired\nsystems. The versatility of the actuator is further demonstrated by its\nintegration into a fish and a jellyfish.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/"}