{"id":"2407.15682","title":"Comment on \"Reconsidering the nonlinear emergent inductance:\n  time-varying Joule heating and its impact on the AC electrical response\"","authors":"Tomoyuki Yokouchi, Aki Kitaori, Daiki Yamaguchi, Naoya Kanazawa, Max\n  Hirschberger, Naoto Nagaosa, Yoshinori Tokura","authorsParsed":[["Yokouchi","Tomoyuki",""],["Kitaori","Aki",""],["Yamaguchi","Daiki",""],["Kanazawa","Naoya",""],["Hirschberger","Max",""],["Nagaosa","Naoto",""],["Tokura","Yoshinori",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:51:25 GMT"}],"updateDate":"2024-07-23","timestamp":1721659885000,"abstract":"  When non-collinear spin textures are driven by current, an emergent electric\nfield arises due to the emergent electromagnetic induction. So far, this\nphenomenon has been reported in several materials, manifesting the\ncurrent-nonlinear imaginary part of the complex impedance. Recently, Furuta et\nal. proposed a time-varying temperature increase due to Joule heating as an\nalternative explanation for these current-nonlinear complex impedances\n[arXiv:2407.00309v1]. In this study, we re-examine the nonlinear complex\nimpedance in GdRuAl12 and YMn6Sn6, specifically addressing the impact of the\ntime-varying temperature increase. Our findings reveal that the magnetic-field\nangle, frequency, and temperature dependence of nonlinear complex impedances in\nthese two materials cannot be explained by the time-varying temperature\nincrease. Instead, these dependencies of the imaginary part of the nonlinear\nimpedance are consistent with the expected behaviour in the theory of emergent\nelectromagnetic induction. Moreover, we observe a significant real part of the\nnonlinear complex impedance, likely resulting from the dissipation associated\nwith the current-driven motion of helices and domain walls. Our findings\nhighlight the diverse current-nonlinear transport phenomena of spin dynamical\norigin in helimagnets.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}