{"id":"2407.04070","title":"Behavioural gap assessment of human-vehicle interaction in real and\n  virtual reality-based scenarios in autonomous driving","authors":"Sergio. Mart\\'in Serrano, Rub\\'en Izquierdo, Iv\\'an Garc\\'ia Daza,\n  Miguel \\'Angel Sotelo, D. Fern\\'andez Llorca","authorsParsed":[["Serrano","Sergio. Martín",""],["Izquierdo","Rubén",""],["Daza","Iván García",""],["Sotelo","Miguel Ángel",""],["Llorca","D. Fernández",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 17:20:17 GMT"}],"updateDate":"2024-07-08","timestamp":1720113617000,"abstract":"  In the field of autonomous driving research, the use of immersive virtual\nreality (VR) techniques is widespread to enable a variety of studies under safe\nand controlled conditions. However, this methodology is only valid and\nconsistent if the conduct of participants in the simulated setting mirrors\ntheir actions in an actual environment. In this paper, we present a first and\ninnovative approach to evaluating what we term the behavioural gap, a concept\nthat captures the disparity in a participant's conduct when engaging in a VR\nexperiment compared to an equivalent real-world situation. To this end, we\ndeveloped a digital twin of a pre-existed crosswalk and carried out a field\nexperiment (N=18) to investigate pedestrian-autonomous vehicle interaction in\nboth real and simulated driving conditions. In the experiment, the pedestrian\nattempts to cross the road in the presence of different driving styles and an\nexternal Human-Machine Interface (eHMI). By combining survey-based and\nbehavioural analysis methodologies, we develop a quantitative approach to\nempirically assess the behavioural gap, as a mechanism to validate data\nobtained from real subjects interacting in a simulated VR-based environment.\nResults show that participants are more cautious and curious in VR, affecting\ntheir speed and decisions, and that VR interfaces significantly influence their\nactions.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}