{"id":"2407.14621","title":"Fast and Flexible Inference Framework for Continuum Reverberation\n  Mapping using Simulation-based Inference with Deep Learning","authors":"Jennifer I-Hsiu Li, Sean D. Johnson, Camille Avestruz, Sreevani\n  Jarugula, Yue Shen, Elise Kesler, Zhuoqi Will Liu, Nishant Mishra","authorsParsed":[["Li","Jennifer I-Hsiu",""],["Johnson","Sean D.",""],["Avestruz","Camille",""],["Jarugula","Sreevani",""],["Shen","Yue",""],["Kesler","Elise",""],["Liu","Zhuoqi Will",""],["Mishra","Nishant",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 18:29:51 GMT"}],"updateDate":"2024-07-23","timestamp":1721413791000,"abstract":"  Continuum reverberation mapping (CRM) of active galactic nuclei (AGN)\nmonitors multiwavelength variability signatures to constrain accretion disk\nstructure and supermassive black hole (SMBH) properties. The upcoming Vera\nRubin Observatory's Legacy Survey of Space and Time (LSST) will survey tens of\nmillions of AGN over the next decade, with thousands of AGN monitored with\nalmost daily cadence in the deep drilling fields. However, existing CRM\nmethodologies often require long computation time and are not designed to\nhandle such large amount of data. In this paper, we present a fast and flexible\ninference framework for CRM using simulation-based inference (SBI) with deep\nlearning to estimate SMBH properties from AGN light curves. We use a\nlong-short-term-memory (LSTM) summary network to reduce the high-dimensionality\nof the light curve data, and then use a neural density estimator to estimate\nthe posterior of SMBH parameters. Using simulated light curves, we find SBI can\nproduce more accurate SMBH parameter estimation with $10^3-10^5$ times speed up\nin inference efficiency compared to traditional methods. The SBI framework is\nparticularly suitable for wide-field RM surveys as the light curves will have\nidentical observing patterns, which can be incorporated into the SBI\nsimulation. We explore the performance of our SBI model on light curves with\nirregular-sampled, realistic observing cadence and alternative variability\ncharacteristics to demonstrate the flexibility and limitation of the SBI\nframework.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}