{"id":"2407.05383","title":"Learning Motion Blur Robust Vision Transformers with Dynamic Early Exit\n  for Real-Time UAV Tracking","authors":"You Wu, Xucheng Wang, Dan Zeng, Hengzhou Ye, Xiaolan Xie, Qijun Zhao,\n  and Shuiwang Li","authorsParsed":[["Wu","You",""],["Wang","Xucheng",""],["Zeng","Dan",""],["Ye","Hengzhou",""],["Xie","Xiaolan",""],["Zhao","Qijun",""],["Li","Shuiwang",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 14:10:04 GMT"}],"updateDate":"2024-07-09","timestamp":1720361404000,"abstract":"  Recently, the surge in the adoption of single-stream architectures utilizing\npre-trained ViT backbones represents a promising advancement in the field of\ngeneric visual tracking. By integrating feature extraction and fusion into a\ncohesive framework, these architectures offer improved performance, efficiency,\nand robustness. However, there has been limited exploration into optimizing\nthese frameworks for UAV tracking. In this paper, we boost the efficiency of\nthis framework by tailoring it into an adaptive computation framework that\ndynamically exits Transformer blocks for real-time UAV tracking. The motivation\nbehind this is that tracking tasks with fewer challenges can be adequately\naddressed using low-level feature representations. Simpler tasks can often be\nhandled with less demanding, lower-level features. This approach allows the\nmodel use computational resources more efficiently by focusing on complex tasks\nand conserving resources for easier ones. Another significant enhancement\nintroduced in this paper is the improved effectiveness of ViTs in handling\nmotion blur, a common issue in UAV tracking caused by the fast movements of\neither the UAV, the tracked objects, or both. This is achieved by acquiring\nmotion blur robust representations through enforcing invariance in the feature\nrepresentation of the target with respect to simulated motion blur. The\nproposed approach is dubbed BDTrack. Extensive experiments conducted on five\ntracking benchmarks validate the effectiveness and versatility of our approach,\nestablishing it as a cutting-edge solution in real-time UAV tracking. Code is\nreleased at: https://github.com/wuyou3474/BDTrack.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}