{"id":"2407.01586","title":"Spectral evolution of RX J0440.9+4431 during the 2022-2023 giant\n  outburst observed with Insight-HXMT","authors":"P. P. Li, Peter A. Becker, and L. Tao","authorsParsed":[["Li","P. P.",""],["Becker","Peter A.",""],["Tao","L.",""]],"versions":[{"version":"v1","created":"Fri, 21 Jun 2024 06:31:56 GMT"}],"updateDate":"2024-07-03","timestamp":1718951516000,"abstract":"  In 2022-2023, the X-ray pulsar RX J0440.9+4431 underwent a Type II giant\noutburst, reaching a peak luminosity L_x ~ 4*10^{37} erg/s. In this work, we\nutilize Insight-HXMT data to analyze the spectral evolution of RX J0440.9+4431\nduring the giant outburst. By analysing the variation of the X-ray spectrum\nduring the outburst using standard phenomenological models, we find that as the\nluminosity approaches the critical luminosity, the spectrum became flatter,\nwith the photon enhancement predominantly concentrated around ~ 2 keV and 20-40\nkeV. The same behavior has also been noted in Type II outbursts from other\nsources. While the phenomenological models provide good fits to the spectrum,\nthis approach is sometimes difficult to translate into direct insight into the\ndetails of the fundamental accretion physics. Hence we have also analyzed\nspectra obtained during high and low phases of the outburst using a new,\nrecently-developed physics-based theoretical model, which allows us to study\nthe variations of physical parameters such as temperature, density, and\nmagnetic field strength during the outburst. Application of the theoretical\nmodel reveals that the observed spectrum is dominated by Comptonized\nbremsstrahlung emission emitted from the column walls in both the high and low\nstates. We show that the spectral flattening observed at high luminosities\nresults from a decrease in the electron temperature, combined with a\ncompactification of the emission zone, which reduces the efficiency of bulk\nComptonization. We also demonstrate that when the source is at maximum\nluminosity, the spectrum tends to harden around the peak of the pulse profile,\nand we discuss possible theoretical explanations for this behavior. We argue\nthat the totality of the behavior in this source can be explained if the\naccretion column is in a quasi-critical state when at the maximum luminosity\nobserved during the outburst.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}