{"id":"2407.00256","title":"One Prompt is not Enough: Automated Construction of a Mixture-of-Expert\n  Prompts","authors":"Ruochen Wang and Sohyun An and Minhao Cheng and Tianyi Zhou and Sung\n  Ju Hwang and Cho-Jui Hsieh","authorsParsed":[["Wang","Ruochen",""],["An","Sohyun",""],["Cheng","Minhao",""],["Zhou","Tianyi",""],["Hwang","Sung Ju",""],["Hsieh","Cho-Jui",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 23:05:08 GMT"}],"updateDate":"2024-07-02","timestamp":1719615908000,"abstract":"  Large Language Models (LLMs) exhibit strong generalization capabilities to\nnovel tasks when prompted with language instructions and in-context demos.\nSince this ability sensitively depends on the quality of prompts, various\nmethods have been explored to automate the instruction design. While these\nmethods demonstrated promising results, they also restricted the searched\nprompt to one instruction. Such simplification significantly limits their\ncapacity, as a single demo-free instruction might not be able to cover the\nentire complex problem space of the targeted task. To alleviate this issue, we\nadopt the Mixture-of-Expert paradigm and divide the problem space into a set of\nsub-regions; Each sub-region is governed by a specialized expert, equipped with\nboth an instruction and a set of demos. A two-phase process is developed to\nconstruct the specialized expert for each region: (1) demo assignment: Inspired\nby the theoretical connection between in-context learning and kernel\nregression, we group demos into experts based on their semantic similarity; (2)\ninstruction assignment: A region-based joint search of an instruction per\nexpert complements the demos assigned to it, yielding a synergistic effect. The\nresulting method, codenamed Mixture-of-Prompts (MoP), achieves an average win\nrate of 81% against prior arts across several major benchmarks.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tktnKBgwPvXQJJ2hIc4ZN8hzOo7g_mWBSfS5RRawkAQ","pdfSize":"4927582"}
