{"id":"2407.09607","title":"A$^3$COSMOS: the dust mass function and dust mass density at $0.5<z<6$","authors":"A. Traina, B. Magnelli, C. Gruppioni, I. Delvecchio, M. Parente, F.\n  Calura, L. Bisigello, A. Feltre, F. Pozzi, L. Vallini","authorsParsed":[["Traina","A.",""],["Magnelli","B.",""],["Gruppioni","C.",""],["Delvecchio","I.",""],["Parente","M.",""],["Calura","F.",""],["Bisigello","L.",""],["Feltre","A.",""],["Pozzi","F.",""],["Vallini","L.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 18:00:03 GMT"}],"updateDate":"2024-07-16","timestamp":1720807203000,"abstract":"  Context. Although dust in galaxies represents only a few percent of the total\nbaryonic mass, it plays a crucial role in the physical processes occurring in\ngalaxies. Studying the dust content of galaxies, particularly at high$-z$, is\ntherefore crucial to understand the link between dust production, obscured star\nformation and the build-up of galaxy stellar mass.\n  Aims. To study the dust properties (mass and temperature) of the largest\nAtacama Large Millimeter/submillimeter Array (ALMA)-selected sample of\nstar-forming galaxies available from the archive (A$^3$COSMOS) and derive the\ndust mass function and dust mass density of galaxies from $z=0.5\\,-\\,6$.\n  Methods. We performed spectral energy distribution (SED) fitting with the\nCIGALE code to constrain the dust mass and temperature of the A$^3$COSMOS\ngalaxy sample, thanks to the UV-to-near-infrared photometric coverage of each\ngalaxies combined with the ALMA (and Herschel when available) coverage of the\nRayleigh-Jeans tail of their dust-continuum emission. We then computed and\nfitted the dust mass function by combining the A$^3$COSMOS and state-of-the-art\n{\\it Herschel} samples, in order to obtain the best estimate of the integrated\ndust mass density up to $z \\sim 6$.\n  Results. Galaxies in \\a3 have dust masses between $\\sim 10^8$ and $\\sim\n10^{9.5}$ M$_{\\odot}$. From the SED fitting, we were also able to derive a dust\ntemperature, finding that the distribution of the dust temperature peaks at\n$\\sim 30-35$K. The dust mass function at $z=0.5\\,-\\,6$ evolves with an increase\nof $M^*$ and decrease of the number density ($\\Phi ^*$) and is in good\nagreement with literature estimates. The dust mass density shows a smooth\ndecrease in its evolution from $z \\sim 0.5$ to $z \\sim 6$, which is steeper\nthan what is found by models at $z \\gtrsim 2$.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}