{"id":"2407.18488","title":"Conversational Dueling Bandits in Generalized Linear Models","authors":"Shuhua Yang, Hui Yuan, Xiaoying Zhang, Mengdi Wang, Hong Zhang,\n  Huazheng Wang","authorsParsed":[["Yang","Shuhua",""],["Yuan","Hui",""],["Zhang","Xiaoying",""],["Wang","Mengdi",""],["Zhang","Hong",""],["Wang","Huazheng",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 03:43:10 GMT"}],"updateDate":"2024-07-29","timestamp":1721965390000,"abstract":"  Conversational recommendation systems elicit user preferences by interacting\nwith users to obtain their feedback on recommended commodities. Such systems\nutilize a multi-armed bandit framework to learn user preferences in an online\nmanner and have received great success in recent years. However, existing\nconversational bandit methods have several limitations. First, they only enable\nusers to provide explicit binary feedback on the recommended items or\ncategories, leading to ambiguity in interpretation. In practice, users are\nusually faced with more than one choice. Relative feedback, known for its\ninformativeness, has gained increasing popularity in recommendation system\ndesign. Moreover, current contextual bandit methods mainly work under linear\nreward assumptions, ignoring practical non-linear reward structures in\ngeneralized linear models. Therefore, in this paper, we introduce relative\nfeedback-based conversations into conversational recommendation systems through\nthe integration of dueling bandits in generalized linear models (GLM) and\npropose a novel conversational dueling bandit algorithm called ConDuel.\nTheoretical analyses of regret upper bounds and empirical validations on\nsynthetic and real-world data underscore ConDuel's efficacy. We also\ndemonstrate the potential to extend our algorithm to multinomial logit bandits\nwith theoretical and experimental guarantees, which further proves the\napplicability of the proposed framework.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Information Theory","Mathematics/Information Theory","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"7Qmp7cDXFfZNGanLnBao2IkTF38Fmw-E4DyFkgXUJ7k","pdfSize":"4415557"}
