{"id":"2407.21287","title":"Hyperoptimized approximate contraction of tensor networks for\n  rugged-energy-landscape spin glasses on periodic square and cubic lattices","authors":"Adil A. Gangat and Johnnie Gray","authorsParsed":[["Gangat","Adil A.",""],["Gray","Johnnie",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 02:21:42 GMT"}],"updateDate":"2024-08-01","timestamp":1722392502000,"abstract":"  Obtaining the low-energy configurations of spin glasses that have rugged\nenergy landscapes is of direct relevance to combinatorial optimization and\nfundamental science. Search-based heuristics have difficulty with this task due\nto the existence of many local minima that are far from optimal. The work of\n[M. M. Rams et al., Phys. Rev. E 104, 025308 (2021)] demonstrates an\nalternative that can bypass this issue for spin glasses with planar or\nquasi-planar geometry: sampling the Boltzmann distribution via approximate\ncontractions of tensor networks. The computational complexity of this approach\nis due only to the complexity of contracting the network, and is therefore\nindependent of landscape ruggedness. Here we initiate an investigation of how\nto take this approach beyond (quasi-)planar geometry by utilizing\nhyperoptimized approximate contraction of tensor networks [J. Gray and G. K.-L.\nChan, Phys. Rev. X 14, 011009 (2024)]. We perform tests on the periodic square-\nand cubic-lattice, planted-solution Ising spin glasses generated with tile\nplanting [F. Hamze et al., Phys. Rev. E 97, 043303 (2018)] for up to 2304\n(square lattice) and 216 (cubic lattice) spins. For a fixed bond dimension, the\ntime complexity is quadratic. With a bond dimension of only four, over the\ntested system sizes the average solution quality in the most rugged instance\nclass remains at ~1% (square lattice) or ~10% (cubic lattice) of optimal. These\nresults encourage further investigation of tensor network contraction for\nrugged-energy-landscape spin-glass problems, especially given that this\napproach is not limited to the Ising (i.e., binary) or two-body (i.e.,\nquadratic) settings.\n","subjects":["Condensed Matter/Disordered Systems and Neural Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}