{"id":"2407.20773","title":"UpDown: Programmable fine-grained Events for Scalable Performance on\n  Irregular Applications","authors":"Andronicus Rajasukumar, Jiya Su, Yuqing (Ivy) Wang, Tianshuo Su,\n  Marziyeh Nourian, Jose M Monsalve Diaz, Tianchi Zhang, Jianru Ding, Wenyi\n  Wang, Ziyi Zhang, Moubarak Jeje, Henry Hoffmann, Yanjing Li, Andrew A. Chien","authorsParsed":[["Rajasukumar","Andronicus","","Ivy"],["Su","Jiya","","Ivy"],["Yuqing","","","Ivy"],["Wang","",""],["Su","Tianshuo",""],["Nourian","Marziyeh",""],["Diaz","Jose M Monsalve",""],["Zhang","Tianchi",""],["Ding","Jianru",""],["Wang","Wenyi",""],["Zhang","Ziyi",""],["Jeje","Moubarak",""],["Hoffmann","Henry",""],["Li","Yanjing",""],["Chien","Andrew A.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 12:16:39 GMT"}],"updateDate":"2024-07-31","timestamp":1722341799000,"abstract":"  Applications with irregular data structures, data-dependent control flows and\nfine-grained data transfers (e.g., real-world graph computations) perform\npoorly on cache-based systems. We propose the UpDown accelerator that supports\nfine-grained execution with novel architecture mechanisms - lightweight\nthreading, event-driven scheduling, efficient ultra-short threads, and\nsplit-transaction DRAM access with software-controlled synchronization. These\nhardware primitives support software programmable events, enabling high\nperformance on diverse data structures and algorithms. UpDown also supports\nscalable performance; hardware replication enables programs to scale up\nperformance. Evaluation results show UpDown's flexibility and scalability\nenable it to outperform CPUs on graph mining and analytics computations by up\nto 116-195x geomean speedup and more than 4x speedup over prior accelerators.\nWe show that UpDown generates high memory parallelism (~4.6x over CPU) required\nfor memory intensive graph computations. We present measurements that attribute\nthe performance of UpDown (23x architectural advantage) to its individual\narchitectural mechanisms. Finally, we also analyze the area and power cost of\nUpDown's mechanisms for software programmability.\n","subjects":["Computing Research Repository/Hardware Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}