{"id":"2407.04827","title":"Massive White Dwarfs in the 100 pc Sample: Magnetism, Rotation,\n  Pulsations, and the Merger Fraction","authors":"Gracyn Jewett, Mukremin Kilic, Pierre Bergeron, Adam Moss, Simon\n  Blouin, Warren R. Brown, Alekzander Kosakowski, Silvia Toonen, Marcel A.\n  Ag\\\"ueros","authorsParsed":[["Jewett","Gracyn",""],["Kilic","Mukremin",""],["Bergeron","Pierre",""],["Moss","Adam",""],["Blouin","Simon",""],["Brown","Warren R.",""],["Kosakowski","Alekzander",""],["Toonen","Silvia",""],["Agüeros","Marcel A.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 19:28:22 GMT"}],"updateDate":"2024-07-09","timestamp":1720207702000,"abstract":"  We present a detailed model atmosphere analysis of massive white dwarfs with\n$M > 0.9~M_\\odot$ and $T_{\\rm eff}\\geq11,000$ K in the Montreal White Dwarf\nDatabase 100 pc sample and the Pan-STARRS footprint. We obtained follow-up\noptical spectroscopy of 109 objects with no previous spectral classification in\nthe literature. Our spectroscopic follow-up is now complete for all 204 objects\nin the sample. We find 118 normal DA white dwarfs, including 45 massive DAs\nnear the ZZ Ceti instability strip. There are no normal massive DBs: the six\nDBs in the sample are strongly magnetic and/or rapidly rotating. There are 20\nmassive DQ white dwarfs in our sample, and all are found in the crystallization\nsequence. In addition, 66 targets are magnetic (32% of the sample). We use\nmagnetic white dwarf atmosphere models to constrain the field strength and\ngeometry using offset dipole models. We also use magnetism, kinematics, and\nrotation measurements to constrain the fraction of merger remnant candidates\namong this population. The merger fraction of this sample increases from 25%\nfor 0.9-$1~M_{\\odot}$ white dwarfs to 49% for 1.2-$1.3~M_{\\odot}$. However,\nthis fraction is as high as $78_{-7}^{+4}$% for 1.1-$1.2~M_{\\odot}$ white\ndwarfs. Previous works have demonstrated that 5-9% of high-mass white dwarfs\nstop cooling for $\\sim8$ Gyr due to the $^{22}$Ne distillation process, which\nleads to an overdensity of Q-branch stars in the solar neighborhood. We\ndemonstrate that the over-abundance of the merger remnant candidates in our\nsample is likely due to the same process.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}