{"id":"2407.12530","title":"One-dimensional gas-fueled nuclear reactor with thermal feedback","authors":"Mathis Caprais, Kacim Fran\\c{c}ois-Elie, Daniele Tomatis","authorsParsed":[["Caprais","Mathis",""],["François-Elie","Kacim",""],["Tomatis","Daniele",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 13:12:01 GMT"}],"updateDate":"2024-07-18","timestamp":1721221921000,"abstract":"  This study explores a simplified one-dimensional subchannel of a\ngraphite-moderated nuclear reactor operating with a gaseous core in\nsteady-state conditions, reproducing a neutronic-thermal-fluid-dynamics coupled\nproblem with thermal feedback. The fuel gas, consisting of a homogeneous\nmixture of uranium hexfluoride (\\ce{UF_6}) and helium, is assumed to be ideal,\nwith simplifications made to its thermodynamic state. Due to the high thermal\nexpansion of the fuel, a possible interesting strong coupling is anticipated.\nThe discrete ordinates' method is used to compute the one group scalar flux,\nthe effective multiplication factor and the power released by the core. Six\ngroups of Delayed Neutron Precursors (DNPs) are used to take into account the\nfuel motion drift. Compressible Euler equations are solved with a monolithic\napproach and the two-physics problem is treated with Picard iterations. As\nexpected, the effective multiplication factor of a subchannel is shown to\nincrease with the inlet pressure. The critical pressure, representing the\nthreshold at which the system achieves criticality, changes as the fuel mixture\nchanges. High thermal feedback coefficients are observed due to the high\nthermal expansion of the fuel. The amount of helium in the mixture greatly\naffects the temperature at core outlet in critical configurations. This study\nshows that a gaseous fuel reactor can be brought to criticality varying the\ninlet pressure. The thermal feedback is strong and should be taken into account\nin the design of the system.\n","subjects":["Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}