{"id":"2407.04737","title":"Hierarchical Decoupling Capacitor Optimization for Power Distribution\n  Network of 2.5D ICs with Co-Analysis of Frequency and Time Domains Based on\n  Deep Reinforcement Learning","authors":"Yuanyuan Duan, Haiyang Feng, Zhiping Yu, Hanming Wu, Leilai Shao,\n  Xiaolei Zhu","authorsParsed":[["Duan","Yuanyuan",""],["Feng","Haiyang",""],["Yu","Zhiping",""],["Wu","Hanming",""],["Shao","Leilai",""],["Zhu","Xiaolei",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 06:12:55 GMT"}],"updateDate":"2024-07-09","timestamp":1719900775000,"abstract":"  With the growing need for higher memory bandwidth and computation density,\n2.5D design, which involves integrating multiple chiplets onto an interposer,\nemerges as a promising solution. However, this integration introduces\nsignificant challenges due to increasing data rates and a large number of I/Os,\nnecessitating advanced optimization of the power distribution networks (PDNs)\nboth on-chip and on-interposer to mitigate the small signal noise and\nsimultaneous switching noise (SSN). Traditional PDN optimization strategies in\n2.5D systems primarily focus on reducing impedance by integrating decoupling\ncapacitors (decaps) to lessen small signal noises. Unfortunately, relying\nsolely on frequency-domain analysis has been proven inadequate for addressing\ncoupled SSN, as indicated by our experimental results. In this work, we\nintroduce a novel two-phase optimization flow using deep reinforcement learning\nto tackle both the on-chip small signal noise and SSN. Initially, we optimize\nthe impedance in the frequency domain to maintain the small signal noise within\nacceptable limits while avoiding over-design. Subsequently, in the time domain,\nwe refine the PDN to minimize the voltage violation integral (VVI), a more\naccurate measure of SSN severity. To the best of our knowledge, this is the\nfirst dual-domain optimization strategy that simultaneously addresses both the\nsmall signal noise and SSN propagation through strategic decap placement in\non-chip and on-interposer PDNs, offering a significant step forward in the\ndesign of robust PDNs for 2.5D integrated systems.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}