{"id":"2407.11444","title":"Milky Way-mass disc galaxies with low-mass stellar haloes have diverse\n  merger histories","authors":"Katy L. Proctor, Aaron D. Ludlow, Claudia del P. Lagos, Aaron S. G.\n  Robotham","authorsParsed":[["Proctor","Katy L.",""],["Ludlow","Aaron D.",""],["Lagos","Claudia del P.",""],["Robotham","Aaron S. G.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 07:23:50 GMT"}],"updateDate":"2024-07-17","timestamp":1721114630000,"abstract":"  We use the Eagle simulation to study the relationship between the stellar\nhaloes of Milky-Way-mass galaxies and their recent merger histories. The\nstellar mass ratio of the most massive merger that occurred since $z=1$ is\nstrongly correlated with the $z=0$ fraction of ex situ stars in the galaxy,\n$f_{\\rm ex\\ situ}$, but is weakly correlated with stellar halo mass fraction,\n$f_{\\rm SH}$, particularly for disc galaxies. Contrary to common belief, our\nresults suggest that disc galaxies with low mass stellar haloes do not\nnecessarily have quiescent merger histories; in fact, roughly one quarter have\nexperienced a merger with stellar mass ratio $> 0.1$ since $z=1$. We\ndemonstrate that the population of disc galaxies with low $f_{\\rm SH}$ and\nactive merger histories undergo mergers with satellites whose orbits are more\ncircular than average and are approximately co-planar with the disc; instead of\ncontributing significantly to the stellar halo, these mergers lead to discs\nthat contain a substantial fraction of ex situ stellar mass and are thicker and\nmore extended than those of quiescent galaxies. Such mergers also supply fuel\nthat often incites a significant episode of in situ star formation in the disc.\nOur results suggest that seemingly quiescent disc galaxies with low-mass\nstellar haloes actually have diverse merger histories, which limits the extent\nto which stellar haloes alone can act as observable tracers of the hierarchical\nassembly of galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}