{"id":"2407.17623","title":"SAfEPaTh: A System-Level Approach for Efficient Power and Thermal\n  Estimation of Convolutional Neural Network Accelerator","authors":"Yukai Chen, Simei Yang, Debjyoti Bhattacharjee, Francky Catthoor,\n  Arindam Mallik","authorsParsed":[["Chen","Yukai",""],["Yang","Simei",""],["Bhattacharjee","Debjyoti",""],["Catthoor","Francky",""],["Mallik","Arindam",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 20:29:52 GMT"}],"updateDate":"2024-07-26","timestamp":1721852992000,"abstract":"  The design of energy-efficient, high-performance, and reliable Convolutional\nNeural Network (CNN) accelerators involves significant challenges due to\ncomplex power and thermal management issues. This paper introduces SAfEPaTh, a\nnovel system-level approach for accurately estimating power and temperature in\ntile-based CNN accelerators. By addressing both steady-state and\ntransient-state scenarios, SAfEPaTh effectively captures the dynamic effects of\npipeline bubbles in interlayer pipelines, utilizing real CNN workloads for\ncomprehensive evaluation. Unlike traditional methods, it eliminates the need\nfor circuit-level simulations or on-chip measurements. Our methodology\nleverages TANIA, a cutting-edge hybrid digital-analog tile-based accelerator\nfeaturing analog-in-memory computing cores alongside digital cores. Through\nrigorous simulation results using the ResNet18 model, we demonstrate SAfEPaTh's\ncapability to accurately estimate power and temperature within 500 seconds,\nencompassing CNN model accelerator mapping exploration and detailed power and\nthermal estimations. This efficiency and accuracy make SAfEPaTh an invaluable\ntool for designers, enabling them to optimize performance while adhering to\nstringent power and thermal constraints. Furthermore, SAfEPaTh's adaptability\nextends its utility across various CNN models and accelerator architectures,\nunderscoring its broad applicability in the field. This study contributes\nsignificantly to the advancement of energy-efficient and reliable CNN\naccelerator designs, addressing critical challenges in dynamic power and\nthermal management.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Performance"],"license":"http://creativecommons.org/licenses/by/4.0/"}