{"id":"2407.18196","title":"Thermal pressure on ultrarelativistic bubbles from a semiclassical\n  formalism","authors":"Andrew J. Long and Jessica Turner","authorsParsed":[["Long","Andrew J.",""],["Turner","Jessica",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 16:59:38 GMT"}],"updateDate":"2024-07-26","timestamp":1721926778000,"abstract":"  We study a planar bubble wall that is traveling at an ultrarelativistic speed\nthrough a thermal plasma. This situation may arise during a first order\nelectroweak phase transition in the early universe. As particles cross the\nwall, it is assumed that their mass grows from $m_a$ to $m_b$, and they are\ndecelerated causing them to emit massless radiation. We are interested in the\nmomentum transfer to the wall, the thermal pressure felt by the wall, and the\nresultant terminal velocity of the wall. We employ the semiclassical current\nradiation (SCR) formalism to perform these calculations. An incident charged\nparticle is treated as a point-like classical electromagnetic current, and the\nspectrum of quantum electromagnetic radiation (photons) is derived by\ncalculating appropriate matrix elements. To understand how the spectrum depends\non the thickness of the wall, we explore simplified models for the current\ncorresponding to an abrupt and a gradual deceleration. For the model of abrupt\ndeceleration, we find that the SCR formalism can reproduce the\n$P_\\mathrm{therm} \\propto \\gamma_w^0$ scaling found in earlier work by assuming\nthat the emission is soft, but if the emission is not soft the SCR formalism\ncan be used to obtain $P_\\mathrm{therm} \\propto \\gamma_w^2$ instead. For the\nmodel of gradual deceleration, we find that the wall thickness $L_w$ enters to\ncutoff the otherwise log-flat radiation spectrum above a momentum of $\\sim\n\\gamma_w^2 / L_w$, and we discuss the connections with classical\nelectromagnetic bremsstrahlung.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}