{"id":"2407.19484","title":"Error Correction Decoding Algorithms of RS Codes Based on An Earlier\n  Termination Algorithm to Find The Error Locator Polynomial","authors":"Zhengyi Jiang, Hao Shi, Zhongyi Huang, Linqi Song, Bo Bai, Gong Zhang,\n  Hanxu Hou","authorsParsed":[["Jiang","Zhengyi",""],["Shi","Hao",""],["Huang","Zhongyi",""],["Song","Linqi",""],["Bai","Bo",""],["Zhang","Gong",""],["Hou","Hanxu",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 12:32:07 GMT"}],"updateDate":"2024-07-30","timestamp":1722169927000,"abstract":"  Reed-Solomon (RS) codes are widely used to correct errors in storage systems.\nFinding the error locator polynomial is one of the key steps in the error\ncorrection procedure of RS codes. Modular Approach (MA) is an effective\nalgorithm for solving the Welch-Berlekamp (WB) key-equation problem to find the\nerror locator polynomial that needs $2t$ steps, where $t$ is the error\ncorrection capability. In this paper, we first present a new MA algorithm that\nonly requires $2e$ steps and then propose two fast decoding algorithms for RS\ncodes based on our MA algorithm, where $e$ is the number of errors and $e\\leq\nt$. We propose Improved-Frequency Domain Modular Approach (I-FDMA) algorithm\nthat needs $2e$ steps to solve the error locator polynomial and present our\nfirst decoding algorithm based on the I-FDMA algorithm. We show that, compared\nwith the existing methods based on MA algorithms, our I-FDMA algorithm can\neffectively reduce the decoding complexity of RS codes when $e<t$. Furthermore,\nwe propose the $t_0$-Shortened I-FDMA ($t_0$-SI-FDMA) algorithm ($t_0$ is a\npredetermined even number less than $2t-1$) based on the new termination\nmechanism to solve the error number $e$ quickly. We propose our second decoding\nalgorithm based on the SI-FDMA algorithm for RS codes and show that the\nmultiplication complexity of our second decoding algorithm is lower than our\nfirst decoding algorithm (the I-FDMA decoding algorithm) when $2e<t_0+1$.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}