{"id":"2407.21340","title":"Diffractive Waveguides","authors":"Yuntian Wang, Yuhang Li, Tianyi Gan, Kun Liao, Mona Jarrahi, Aydogan\n  Ozcan","authorsParsed":[["Wang","Yuntian",""],["Li","Yuhang",""],["Gan","Tianyi",""],["Liao","Kun",""],["Jarrahi","Mona",""],["Ozcan","Aydogan",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 05:14:44 GMT"}],"updateDate":"2024-08-01","timestamp":1722402884000,"abstract":"  Waveguide design is crucial in developing efficient light delivery systems,\nrequiring meticulous material selection, precise manufacturing, and rigorous\nperformance optimization, including dispersion engineering. Here, we introduce\nuniversal diffractive waveguide designs that can match the performance of any\nconventional dielectric waveguide and achieve various functionalities.\nOptimized using deep learning, our diffractive waveguide designs can be\ncascaded to each other to form any desired length and are comprised of\ntransmissive diffractive surfaces that permit the propagation of desired guided\nmodes with low loss and high mode purity. In addition to guiding the targeted\nmodes along the propagation direction through cascaded diffractive units, we\nalso developed various waveguide components and introduced bent diffractive\nwaveguides, rotating the direction of mode propagation, as well as programmable\nmode filtering and mode splitting diffractive waveguide designs, showcasing the\nversatility of this platform. This diffractive waveguide framework was\nexperimentally validated in the terahertz (THz) spectrum using 3D-printed\ndiffractive layers to selectively pass certain spatial modes while rejecting\nothers. Diffractive waveguides can be scaled to operate at different\nwavelengths, including visible and infrared parts of the spectrum, without the\nneed for material dispersion engineering, providing an alternative to\ntraditional waveguide components. This advancement will have potential\napplications in telecommunications, imaging, sensing and spectroscopy, among\nothers.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}