{"id":"2407.08634","title":"RTMW: Real-Time Multi-Person 2D and 3D Whole-body Pose Estimation","authors":"Tao Jiang, Xinchen Xie, Yining Li","authorsParsed":[["Jiang","Tao",""],["Xie","Xinchen",""],["Li","Yining",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 16:15:47 GMT"}],"updateDate":"2024-07-12","timestamp":1720714547000,"abstract":"  Whole-body pose estimation is a challenging task that requires simultaneous\nprediction of keypoints for the body, hands, face, and feet. Whole-body pose\nestimation aims to predict fine-grained pose information for the human body,\nincluding the face, torso, hands, and feet, which plays an important role in\nthe study of human-centric perception and generation and in various\napplications. In this work, we present RTMW (Real-Time Multi-person Whole-body\npose estimation models), a series of high-performance models for 2D/3D\nwhole-body pose estimation. We incorporate RTMPose model architecture with FPN\nand HEM (Hierarchical Encoding Module) to better capture pose information from\ndifferent body parts with various scales. The model is trained with a rich\ncollection of open-source human keypoint datasets with manually aligned\nannotations and further enhanced via a two-stage distillation strategy. RTMW\ndemonstrates strong performance on multiple whole-body pose estimation\nbenchmarks while maintaining high inference efficiency and deployment\nfriendliness. We release three sizes: m/l/x, with RTMW-l achieving a 70.2 mAP\non the COCO-Wholebody benchmark, making it the first open-source model to\nexceed 70 mAP on this benchmark. Meanwhile, we explored the performance of RTMW\nin the task of 3D whole-body pose estimation, conducting image-based monocular\n3D whole-body pose estimation in a coordinate classification manner. We hope\nthis work can benefit both academic research and industrial applications. The\ncode and models have been made publicly available at:\nhttps://github.com/open-mmlab/mmpose/tree/main/projects/rtmpose\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}