{"id":"2407.00717","title":"Learning System Dynamics without Forgetting","authors":"Xikun Zhang, Dongjin Song, Yushan Jiang, Yixin Chen, Dacheng Tao","authorsParsed":[["Zhang","Xikun",""],["Song","Dongjin",""],["Jiang","Yushan",""],["Chen","Yixin",""],["Tao","Dacheng",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 14:55:18 GMT"}],"updateDate":"2024-07-02","timestamp":1719759318000,"abstract":"  Predicting the trajectories of systems with unknown dynamics (\\textit{i.e.}\nthe governing rules) is crucial in various research fields, including physics\nand biology. This challenge has gathered significant attention from diverse\ncommunities. Most existing works focus on learning fixed system dynamics within\none single system. However, real-world applications often involve multiple\nsystems with different types of dynamics or evolving systems with\nnon-stationary dynamics (dynamics shifts). When data from those systems are\ncontinuously collected and sequentially fed to machine learning models for\ntraining, these models tend to be biased toward the most recently learned\ndynamics, leading to catastrophic forgetting of previously observed/learned\nsystem dynamics. To this end, we aim to learn system dynamics via continual\nlearning. Specifically, we present a novel framework of Mode-switching Graph\nODE (MS-GODE), which can continually learn varying dynamics and encode the\nsystem-specific dynamics into binary masks over the model parameters. During\nthe inference stage, the model can select the most confident mask based on the\nobservational data to identify the system and predict future trajectories\naccordingly. Empirically, we systematically investigate the task configurations\nand compare the proposed MS-GODE with state-of-the-art techniques. More\nimportantly, we construct a novel benchmark of biological dynamic systems,\nfeaturing diverse systems with disparate dynamics and significantly enriching\nthe research field of machine learning for dynamic systems.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}