{"id":"2407.09750","title":"Prospects for the Detection of the Sgr A* Photon Ring with\n  next-generation Event Horizon Telescope Polarimetry","authors":"Kaitlyn M. Shavelle and Daniel C. M. Palumbo","authorsParsed":[["Shavelle","Kaitlyn M.",""],["Palumbo","Daniel C. M.",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 02:54:53 GMT"}],"updateDate":"2024-07-16","timestamp":1720839293000,"abstract":"  The Event Horizon Telescope (EHT) has imaged two supermassive black holes,\nMessier 87* (M87*) and Sagittarius A* (Sgr A*), using very-long-baseline\ninterferometry (VLBI). The theoretical analyses of each source suggest\nmagnetically arrested disk (MAD) accretion viewed at modest inclination. These\nMADs exhibit rotationally symmetric polarization of synchrotron emission caused\nby symmetries of their ordered magnetic fields. We leverage these symmetries to\nstudy the detectability of the black hole photon ring, which imposes known\nantisymmetries in polarization. In this letter, we propose a novel\nobservational strategy based on coherent baseline-averaging of polarization\nratios in a rotating basis to detect the photon ring with 345 GHz VLBI from the\nEarth's surface. Using synthetic observations from a likely future EHT, we find\na reversal in polarimetric phases on long baselines that reveals the presence\nof the Sgr\\,A* photon ring in a MAD system at 345 GHz, a critical frequency for\nlengthening baselines and overcoming interstellar scattering. We use our\nsynthetic data and analysis pipeline to estimate requirements for the EHT using\na new metric: ${\\rm SNR}_{\\rm PR}$, the signal-to-noise ratio of this\npolarimetric reversal signal. We identify long, coherent integrations using\nfrequency phase transfer as a critical enabling technique for the detection of\nthe photon ring, and predict a ${\\rm SNR}_{\\rm PR} \\sim 2-3$ detection using\nproposed ngEHT parameters and currently-favored models for the Sgr A* accretion\nflow. We find that higher sensitivity, rather than denser Fourier sampling, is\nthe most critical requirement for polarimetric detection of the photon ring.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}