{"id":"2407.10833","title":"MoE-DiffIR: Task-customized Diffusion Priors for Universal Compressed\n  Image Restoration","authors":"Yulin Ren, Xin Li, Bingchen Li, Xingrui Wang, Mengxi Guo, Shijie Zhao,\n  Li Zhang, Zhibo Chen","authorsParsed":[["Ren","Yulin",""],["Li","Xin",""],["Li","Bingchen",""],["Wang","Xingrui",""],["Guo","Mengxi",""],["Zhao","Shijie",""],["Zhang","Li",""],["Chen","Zhibo",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 15:43:27 GMT"}],"updateDate":"2024-07-16","timestamp":1721058207000,"abstract":"  We present MoE-DiffIR, an innovative universal compressed image restoration\n(CIR) method with task-customized diffusion priors. This intends to handle two\npivotal challenges in the existing CIR methods: (i) lacking adaptability and\nuniversality for different image codecs, e.g., JPEG and WebP; (ii) poor texture\ngeneration capability, particularly at low bitrates. Specifically, our\nMoE-DiffIR develops the powerful mixture-of-experts (MoE) prompt module, where\nsome basic prompts cooperate to excavate the task-customized diffusion priors\nfrom Stable Diffusion (SD) for each compression task. Moreover, the\ndegradation-aware routing mechanism is proposed to enable the flexible\nassignment of basic prompts. To activate and reuse the cross-modality\ngeneration prior of SD, we design the visual-to-text adapter for MoE-DiffIR,\nwhich aims to adapt the embedding of low-quality images from the visual domain\nto the textual domain as the textual guidance for SD, enabling more consistent\nand reasonable texture generation. We also construct one comprehensive\nbenchmark dataset for universal CIR, covering 21 types of degradations from 7\npopular traditional and learned codecs. Extensive experiments on universal CIR\nhave demonstrated the excellent robustness and texture restoration capability\nof our proposed MoE-DiffIR. The project can be found at\nhttps://renyulin-f.github.io/MoE-DiffIR.github.io/.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"BCw9uQ7AtxWydiASMa2xryEWWy54PnwexCsQV-KsgqI","pdfSize":"71126772"}
