{"id":"2407.09073","title":"Open Vocabulary Multi-Label Video Classification","authors":"Rohit Gupta, Mamshad Nayeem Rizve, Jayakrishnan Unnikrishnan, Ashish\n  Tawari, Son Tran, Mubarak Shah, Benjamin Yao, Trishul Chilimbi","authorsParsed":[["Gupta","Rohit",""],["Rizve","Mamshad Nayeem",""],["Unnikrishnan","Jayakrishnan",""],["Tawari","Ashish",""],["Tran","Son",""],["Shah","Mubarak",""],["Yao","Benjamin",""],["Chilimbi","Trishul",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 07:53:54 GMT"}],"updateDate":"2024-07-15","timestamp":1720770834000,"abstract":"  Pre-trained vision-language models (VLMs) have enabled significant progress\nin open vocabulary computer vision tasks such as image classification, object\ndetection and image segmentation. Some recent works have focused on extending\nVLMs to open vocabulary single label action classification in videos. However,\nprevious methods fall short in holistic video understanding which requires the\nability to simultaneously recognize multiple actions and entities e.g., objects\nin the video in an open vocabulary setting. We formulate this problem as open\nvocabulary multilabel video classification and propose a method to adapt a\npre-trained VLM such as CLIP to solve this task. We leverage large language\nmodels (LLMs) to provide semantic guidance to the VLM about class labels to\nimprove its open vocabulary performance with two key contributions. First, we\npropose an end-to-end trainable architecture that learns to prompt an LLM to\ngenerate soft attributes for the CLIP text-encoder to enable it to recognize\nnovel classes. Second, we integrate a temporal modeling module into CLIP's\nvision encoder to effectively model the spatio-temporal dynamics of video\nconcepts as well as propose a novel regularized finetuning technique to ensure\nstrong open vocabulary classification performance in the video domain. Our\nextensive experimentation showcases the efficacy of our approach on multiple\nbenchmark datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}