{"id":"2407.00529","title":"Detecting and Identifying Selection Structure in Sequential Data","authors":"Yujia Zheng, Zeyu Tang, Yiwen Qiu, Bernhard Sch\\\"olkopf, Kun Zhang","authorsParsed":[["Zheng","Yujia",""],["Tang","Zeyu",""],["Qiu","Yiwen",""],["Schölkopf","Bernhard",""],["Zhang","Kun",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 20:56:34 GMT"}],"updateDate":"2024-07-02","timestamp":1719694594000,"abstract":"  We argue that the selective inclusion of data points based on latent\nobjectives is common in practical situations, such as music sequences. Since\nthis selection process often distorts statistical analysis, previous work\nprimarily views it as a bias to be corrected and proposes various methods to\nmitigate its effect. However, while controlling this bias is crucial, selection\nalso offers an opportunity to provide a deeper insight into the hidden\ngeneration process, as it is a fundamental mechanism underlying what we\nobserve. In particular, overlooking selection in sequential data can lead to an\nincomplete or overcomplicated inductive bias in modeling, such as assuming a\nuniversal autoregressive structure for all dependencies. Therefore, rather than\nmerely viewing it as a bias, we explore the causal structure of selection in\nsequential data to delve deeper into the complete causal process. Specifically,\nwe show that selection structure is identifiable without any parametric\nassumptions or interventional experiments. Moreover, even in cases where\nselection variables coexist with latent confounders, we still establish the\nnonparametric identifiability under appropriate structural conditions.\nMeanwhile, we also propose a provably correct algorithm to detect and identify\nselection structures as well as other types of dependencies. The framework has\nbeen validated empirically on both synthetic data and real-world music.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing","Mathematics/Statistics Theory","Statistics/Machine Learning","Statistics/Statistics Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}