{"id":"2407.12251","title":"Performance Analysis and Blocklength Minimization of Uplink RSMA for\n  Short Packet Transmissions in URLLC","authors":"Yixin Zhang, Wenchi Cheng, Jingqing Wang, Wei Zhang","authorsParsed":[["Zhang","Yixin",""],["Cheng","Wenchi",""],["Wang","Jingqing",""],["Zhang","Wei",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 01:36:27 GMT"}],"updateDate":"2024-07-18","timestamp":1721180187000,"abstract":"  Rate splitting multiple access (RSMA) is one of the most promising techniques\nfor ultra-reliable and low-latency communications (URLLC) with stringent\nrequirements on delay and reliability of multiple access. To fully explore the\ndelay performance enhancement brought by uplink RSMA to URLLC, in this paper,\nwe evaluate the performance of two-user uplink RSMA and propose the\ncorresponding blocklength minimization problem. We analyze the impact of finite\nblocklength (FBL) code on the achievable rate region and the effective\nthroughput of uplink RSMA. On this basis, we propose the problem of minimizing\nthe blocklength for uplink RSMA with power allocation under constrained\nreliability and effective throughput. Then, we present an alternating\noptimization method to solve this non-convex problem. Simulation results show\nthat different from the infinite blocklength (IBL) regime, the achievable rate\nregion of the uplink RSMA is not always larger than that of uplink\nnon-orthogonal multiple access (NOMA) in the FBL regime. But with the help of\nour proposed blocklength minimization scheme, uplink RSMA can achieve the same\nachievable rate with a smaller blocklength compared to uplink NOMA, frequency\ndivision multiple access (FDMA), and time division multiple access (TDMA)\nwithout the need for time sharing in the FBL regime, showing the potential of\nuplink RSMA to achieve low delay for URLLC.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}