{"id":"2407.18319","title":"Gravitational wave surrogate model for spinning, intermediate mass ratio\n  binaries based on perturbation theory and numerical relativity","authors":"Katie Rink, Ritesh Bachhar, Tousif Islam, Nur E. M. Rifat, Kevin\n  Gonzalez-Quesada, Scott E. Field, Gaurav Khanna, Scott A. Hughes, and Vijay\n  Varma","authorsParsed":[["Rink","Katie",""],["Bachhar","Ritesh",""],["Islam","Tousif",""],["Rifat","Nur E. M.",""],["Gonzalez-Quesada","Kevin",""],["Field","Scott E.",""],["Khanna","Gaurav",""],["Hughes","Scott A.",""],["Varma","Vijay",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 18:19:06 GMT"}],"updateDate":"2024-07-29","timestamp":1721931546000,"abstract":"  We present BHPTNRSur2dq1e3, a reduced order surrogate model of gravitational\nwaves emitted from binary black hole (BBH) systems in the comparable to large\nmass ratio regime with aligned spin ($\\chi_1$) on the heavier mass ($m_1$). We\ntrained this model on waveform data generated from point particle black hole\nperturbation theory (ppBHPT) with mass ratios varying from $3 \\leq q \\leq 1000$\nand spins from $-0.8 \\leq \\chi_1 \\leq 0.8$. The waveforms are $13,500 \\ m_1$\nlong and include all spin-weighted spherical harmonic modes up to $\\ell = 4$\nexcept the $(4,1)$ and $m = 0$ modes. We find that for binaries with $\\chi_1\n\\lesssim -0.5$, retrograde quasi-normal modes are significantly excited,\nthereby complicating the modeling process. To overcome this issue, we introduce\na domain decomposition approach to model the inspiral and merger-ringdown\nportion of the signal separately. The resulting model can faithfully reproduce\nppBHPT waveforms with a median time-domain mismatch error of $8 \\times\n10^{-5}$. We then calibrate our model with numerical relativity (NR) data in\nthe comparable mass regime $(3 \\leq q \\leq 10)$. By comparing with spin-aligned\nBBH NR simulations at $q = 15$, we find that the dominant quadrupolar\n(subdominant) modes agree to better than $\\approx 10^{-3} \\ (\\approx 10^{-2})$\nwhen using a time-domain mismatch error, where the largest source of\ncalibration error comes from the transition-to-plunge and ringdown\napproximations of perturbation theory. Mismatch errors are below $\\approx\n10^{-2}$ for systems with mass ratios between $6 \\leq q \\leq 15$ and typically\nget smaller at larger mass ratio. Our two models - both the ppBHPT waveform\nmodel and the NR-calibrated ppBHPT model - will be publicly available through\ngwsurrogate and the Black Hole Perturbation Toolkit packages.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4NRgdFcMx1tfJ_xHbCq6usf7Yi1-pJRN-1D7f598QsM","pdfSize":"1426185"}
