{"id":"2407.06465","title":"The impact of microwave phase noise on diamond quantum sensing","authors":"Andris Berzins, Maziar Saleh Ziabari, Yaser Silani, Ilja Fescenko,\n  Joshua T. Damron, John F. Barry, Andrey Jarmola, Pauli Kehayias, Bryan A.\n  Richards, Janis Smits, Victor M. Acosta","authorsParsed":[["Berzins","Andris",""],["Ziabari","Maziar Saleh",""],["Silani","Yaser",""],["Fescenko","Ilja",""],["Damron","Joshua T.",""],["Barry","John F.",""],["Jarmola","Andrey",""],["Kehayias","Pauli",""],["Richards","Bryan A.",""],["Smits","Janis",""],["Acosta","Victor M.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 00:08:33 GMT"}],"updateDate":"2024-07-10","timestamp":1720483713000,"abstract":"  Precision optical measurements of the electron-spin precession of\nnitrogen-vacancy (NV) centers in diamond form the basis of numerous\napplications. The most sensitivity-demanding applications, such as femtotesla\nmagnetometry, require the ability to measure changes in GHz spin transition\nfrequencies at the sub-millihertz level, corresponding to a fractional\nresolution of better than 10^{-12}. Here we study the impact of microwave (MW)\nphase noise on the response of an NV sensor. Fluctuations of the phase of the\nMW waveform cause undesired rotations of the NV spin state. These fluctuations\nare imprinted in the optical readout signal and, left unmitigated, are\nindistinguishable from magnetic field noise. We show that the phase noise of\nseveral common commercial MW generators results in an effective pT\ns^{1/2}-range noise floor that varies with the MW carrier frequency and the\ndetection frequency of the pulse sequence. The data are described by a\nfrequency domain model incorporating the MW phase noise spectrum and the\nfilter-function response of the sensing protocol. For controlled injection of\nwhite and random-walk phase noise, the observed NV magnetic noise floor is\ndescribed by simple analytic expressions that accurately capture the scaling\nwith pulse sequence length and the number of pi pulses. We outline several\nstrategies to suppress the impact of MW phase noise and implement a version,\nbased on gradiometry, that realizes a >10-fold suppression. Our study\nhighlights an important challenge in the pursuit of sensitive diamond quantum\nsensors and is applicable to other qubit systems with a large transition\nfrequency.\n","subjects":["Physics/Quantum Physics","Physics/Applied Physics","Physics/Atomic Physics","Physics/Instrumentation and Detectors","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}