{"id":"2407.17487","title":"Explainable Natural Language Processing for Corporate Sustainability\n  Analysis","authors":"Keane Ong, Rui Mao, Ranjan Satapathy, Ricardo Shirota Filho, Erik\n  Cambria, Johan Sulaeman and Gianmarco Mengaldo","authorsParsed":[["Ong","Keane",""],["Mao","Rui",""],["Satapathy","Ranjan",""],["Filho","Ricardo Shirota",""],["Cambria","Erik",""],["Sulaeman","Johan",""],["Mengaldo","Gianmarco",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 08:27:51 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 02:35:37 GMT"}],"updateDate":"2024-08-01","timestamp":1719995271000,"abstract":"  Sustainability commonly refers to entities, such as individuals, companies,\nand institutions, having a non-detrimental (or even positive) impact on the\nenvironment, society, and the economy. With sustainability becoming a synonym\nof acceptable and legitimate behaviour, it is being increasingly demanded and\nregulated. Several frameworks and standards have been proposed to measure the\nsustainability impact of corporations, including United Nations' sustainable\ndevelopment goals and the recently introduced global sustainability reporting\nframework, amongst others. However, the concept of corporate sustainability is\ncomplex due to the diverse and intricate nature of firm operations (i.e.\ngeography, size, business activities, interlinks with other stakeholders). As a\nresult, corporate sustainability assessments are plagued by subjectivity both\nwithin data that reflect corporate sustainability efforts (i.e. corporate\nsustainability disclosures) and the analysts evaluating them. This subjectivity\ncan be distilled into distinct challenges, such as incompleteness, ambiguity,\nunreliability and sophistication on the data dimension, as well as limited\nresources and potential bias on the analyst dimension. Put together,\nsubjectivity hinders effective cost attribution to entities non-compliant with\nprevailing sustainability expectations, potentially rendering sustainability\nefforts and its associated regulations futile. To this end, we argue that\nExplainable Natural Language Processing (XNLP) can significantly enhance\ncorporate sustainability analysis. Specifically, linguistic understanding\nalgorithms (lexical, semantic, syntactic), integrated with XAI capabilities\n(interpretability, explainability, faithfulness), can bridge gaps in analyst\nresources and mitigate subjectivity problems within data.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9wsKBwxp-wNJDDf3WLDIws661TD2R9obTMwMeLscWMw","pdfSize":"921568"}
