{"id":"2407.14797","title":"From Underground Mines to Offices: A Versatile and Robust Framework for\n  Range-Inertial SLAM","authors":"Lorenzo Montano-Oliv\\'an, Julio A. Placed, Luis Montano, and Mar\\'ia\n  T. L\\'azaro","authorsParsed":[["Montano-Oliván","Lorenzo",""],["Placed","Julio A.",""],["Montano","Luis",""],["Lázaro","María T.",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 07:56:24 GMT"}],"updateDate":"2024-07-23","timestamp":1721462184000,"abstract":"  Simultaneous Localization and Mapping (SLAM) is an essential component of\nautonomous robotic applications and self-driving vehicles, enabling them to\nunderstand and operate in their environment. Many SLAM systems have been\nproposed in the last decade, but they are often complex to adapt to different\nsettings or sensor setups. In this work, we present LiDAR Graph-SLAM (LG-SLAM),\na versatile range-inertial SLAM framework that can be adapted to different\ntypes of sensors and environments, from underground mines to offices with\nminimal parameter tuning. Our system integrates range, inertial and GNSS\nmeasurements into a graph-based optimization framework. We also use a refined\nsubmap management approach and a robust loop closure method that effectively\naccounts for uncertainty in the identification and validation of putative loop\nclosures, ensuring global consistency and robustness. Enabled by a parallelized\narchitecture and GPU integration, our system achieves pose estimation at LiDAR\nframe rate, along with online loop closing and graph optimization. We validate\nour system in diverse environments using public datasets and real-world data,\nconsistently achieving an average error below 20 cm and outperforming other\nstate-of-the-art algorithms.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"RoBNPX-FCtT2xIjlSKn-9gKbTy5FVyuL6BDiw-AejTk","pdfSize":"23412568","objectId":"0x0ead3022bfb2f22a83f9f2087fcd57e31d0c628e4e5cdf107823ec448ba6037c","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
