{"id":"2407.08076","title":"Circumnuclear Dust in Luminous Early-Type Galaxies -- I. Sample\n  Properties and Stellar Luminosity Models","authors":"Jared R. Davidson, Benjamin D. Boizelle, Jonelle L. Walsh, Aaron J.\n  Barth, Emma Rasmussen, Andrew J. Baker, David A. Buote, Jeremy Darling, Luis\n  C. Ho, Kyle M. Kabasares, Jonathan H. Cohn","authorsParsed":[["Davidson","Jared R.",""],["Boizelle","Benjamin D.",""],["Walsh","Jonelle L.",""],["Barth","Aaron J.",""],["Rasmussen","Emma",""],["Baker","Andrew J.",""],["Buote","David A.",""],["Darling","Jeremy",""],["Ho","Luis C.",""],["Kabasares","Kyle M.",""],["Cohn","Jonathan H.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 22:41:59 GMT"}],"updateDate":"2024-07-12","timestamp":1720651319000,"abstract":"  Dusty circumnuclear disks (CNDs) in luminous early-type galaxies (ETGs) show\nregular, dynamically cold molecular gas kinematics. For a growing number of\nETGs, Atacama Large Millimeter/sub-millimeter Array (ALMA) CO imaging and\ndetailed gas-dynamical modeling facilitate moderate-to-high precision black\nhole (BH) mass ($M_{BH}$) determinations. From the ALMA archive, we identified\na subset of 26 ETGs with estimated $M_{BH}/M_{\\odot} \\gtrsim 10^8$ to a few\n$\\times$10$^9$ and clean CO kinematics but that previously did not have\nsufficiently high angular resolution near-IR observations to mitigate dust\nobscuration when constructing stellar luminosity models. We present new optical\nand near-IR Hubble Space Telescope (HST) images of this sample to supplement\nthe archival HST data, detailing the sample properties and data analysis\ntechniques. After masking the most apparent dust features, we measure stellar\nsurface brightness profiles and model the luminosities using the multi-Gaussian\nexpansion (MGE) formalism. Some of these MGEs have already been used in CO\ndynamical modeling efforts to secure quality \\mbh\\ determinations, and the\nremaining ETG targets here are expected to significantly improve the high-mass\nend of the current BH census, facilitating new scrutiny of local BH mass-host\ngalaxy scaling relationships. We also explore stellar isophotal behavior and\ngeneral dust properties, finding these CNDs generally become optically thick in\nthe near-IR ($A_H \\gtrsim 1$ mag). These CNDs are typically well-aligned with\nthe larger-scale stellar photometric axes with a few notable exceptions.\nUncertain dust impact on the MGE often dominates the BH mass error budget, so\nextensions of this work will focus on constraining CND dust attenuation.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jomNzsO0VZu0w5FTCjACFDTkNlXUIMOE4D9kAuE4cyQ","pdfSize":"19120428"}
