{"id":"2407.17036","title":"A Bayesian modelling framework for health care resource use and costs in\n  trial-based economic evaluations","authors":"Andrea Gabrio","authorsParsed":[["Gabrio","Andrea",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 06:49:40 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 08:13:38 GMT"}],"updateDate":"2024-07-31","timestamp":1721803780000,"abstract":"  Individual-level effectiveness and healthcare resource use (HRU) data are\nroutinely collected in trial-based economic evaluations. While effectiveness is\noften expressed in terms of utility scores derived from some health-related\nquality of life instruments (e.g.~EQ-5D questionnaires), different types of HRU\nmay be included. Costs are usually generated by applying unit prices to HRU\ndata and statistical methods have been traditionally implemented to analyse\ncosts and utilities or after combining them into aggregated variables (e.g.\nQuality-Adjusted Life Years). When outcome data are not fully observed, e.g.\nsome patients drop out or only provided partial information, the validity of\nthe results may be hindered both in terms of efficiency and bias. Often,\npartially-complete HRU data are handled using \"ad-hoc\" methods, implicitly\nrelying on some assumptions (e.g. fill-in a zero) which are hard to justify\nbeside the practical convenience of increasing the completion rate. We present\na general Bayesian framework for the modelling of partially-observed HRUs which\nallows a flexible model specification to accommodate the typical complexities\nof the data and to quantify the impact of different types of uncertainty on the\nresults. We show the benefits of using our approach using a motivating example\nand compare the results to those from traditional analyses focussed on the\nmodelling of cost variables after adopting some ad-hoc imputation strategy for\nHRU data.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}