{"id":"2407.04582","title":"Converse Techniques for Identification via Channels","authors":"Larissa Br\\\"uche, Marcel A. Mross, Yaning Zhao, Wafa Labidi, Christian\n  Deppe, Eduard A. Jorswieck","authorsParsed":[["Brüche","Larissa",""],["Mross","Marcel A.",""],["Zhao","Yaning",""],["Labidi","Wafa",""],["Deppe","Christian",""],["Jorswieck","Eduard A.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 15:25:50 GMT"}],"updateDate":"2024-07-08","timestamp":1720193150000,"abstract":"  There is a growing interest in models that extend beyond Shannon's classical\ntransmission scheme, renowned for its channel capacity formula $C$. One such\npromising direction is message identification via channels, introduced by\nAhlswede and Dueck. Unlike in Shannon's classical model, where the receiver\naims to determine which message was sent from a set of $M$ messages, message\nidentification focuses solely on discerning whether a specific message $m$ was\ntransmitted. The encoder can operate deterministically or through\nrandomization, with substantial advantages observed particularly in the latter\napproach. While Shannon's model allows transmission of $M = 2^{nC}$ messages,\nAhlswede and Dueck's model facilitates the identification of $M = 2^{2^{nC}}$\nmessages, exhibiting a double exponential growth in block length. In their\nseminal paper, Ahlswede and Dueck established the achievability and introduced\na \"soft\" converse bound. Subsequent works have further refined this,\nculminating in a strong converse bound, applicable under specific conditions.\nWatanabe's contributions have notably enhanced the applicability of the\nconverse bound. The aim of this survey is multifaceted: to grasp the formalism\nand proof techniques outlined in the aforementioned works, analyze Watanabe's\nconverse, trace the evolution from earlier converses to Watanabe's, emphasizing\nkey similarities and differences that underpin the enhancements. Furthermore,\nwe explore the converse proof for message identification with feedback, also\npioneered by Ahlswede and Dueck. By elucidating how their approaches were\ninspired by preceding proofs, we provide a comprehensive overview. This\noverview paper seeks to offer readers insights into diverse converse techniques\nfor message identification, with a focal point on the seminal works of Hayashi,\nWatanabe, and, in the context of feedback, Ahlswede and Dueck.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}