{"id":"2407.14904","title":"Large-vocabulary forensic pathological analyses via prototypical\n  cross-modal contrastive learning","authors":"Chen Shen, Chunfeng Lian, Wanqing Zhang, Fan Wang, Jianhua Zhang,\n  Shuanliang Fan, Xin Wei, Gongji Wang, Kehan Li, Hongshu Mu, Hao Wu, Xinggong\n  Liang, Jianhua Ma, Zhenyuan Wang","authorsParsed":[["Shen","Chen",""],["Lian","Chunfeng",""],["Zhang","Wanqing",""],["Wang","Fan",""],["Zhang","Jianhua",""],["Fan","Shuanliang",""],["Wei","Xin",""],["Wang","Gongji",""],["Li","Kehan",""],["Mu","Hongshu",""],["Wu","Hao",""],["Liang","Xinggong",""],["Ma","Jianhua",""],["Wang","Zhenyuan",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 15:34:52 GMT"}],"updateDate":"2024-07-23","timestamp":1721489692000,"abstract":"  Forensic pathology is critical in determining the cause and manner of death\nthrough post-mortem examinations, both macroscopic and microscopic. The field,\nhowever, grapples with issues such as outcome variability, laborious processes,\nand a scarcity of trained professionals. This paper presents SongCi, an\ninnovative visual-language model (VLM) designed specifically for forensic\npathology. SongCi utilizes advanced prototypical cross-modal self-supervised\ncontrastive learning to enhance the accuracy, efficiency, and generalizability\nof forensic analyses. It was pre-trained and evaluated on a comprehensive\nmulti-center dataset, which includes over 16 million high-resolution image\npatches, 2,228 vision-language pairs of post-mortem whole slide images (WSIs),\nand corresponding gross key findings, along with 471 distinct diagnostic\noutcomes. Our findings indicate that SongCi surpasses existing multi-modal AI\nmodels in many forensic pathology tasks, performs comparably to experienced\nforensic pathologists and significantly better than less experienced ones, and\nprovides detailed multi-modal explainability, offering critical assistance in\nforensic investigations. To the best of our knowledge, SongCi is the first VLM\nspecifically developed for forensic pathological analysis and the first\nlarge-vocabulary computational pathology (CPath) model that directly processes\ngigapixel WSIs in forensic science.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}