{"id":"2407.12487","title":"Application of Prompt Learning Models in Identifying the Collaborative\n  Problem Solving Skills in an Online Task","authors":"Mengxiao Zhu, Xin Wang, Xiantao Wang, Zihang Chen, Wei Huang","authorsParsed":[["Zhu","Mengxiao",""],["Wang","Xin",""],["Wang","Xiantao",""],["Chen","Zihang",""],["Huang","Wei",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 11:12:02 GMT"}],"updateDate":"2024-07-18","timestamp":1721214722000,"abstract":"  Collaborative problem solving (CPS) competence is considered one of the\nessential 21st-century skills. To facilitate the assessment and learning of CPS\ncompetence, researchers have proposed a series of frameworks to conceptualize\nCPS and explored ways to make sense of the complex processes involved in\ncollaborative problem solving. However, encoding explicit behaviors into\nsubskills within the frameworks of CPS skills is still a challenging task.\nTraditional studies have relied on manual coding to decipher behavioral data\nfor CPS, but such coding methods can be very time-consuming and cannot support\nreal-time analyses. Scholars have begun to explore approaches for constructing\nautomatic coding models. Nevertheless, the existing models built using machine\nlearning or deep learning techniques depend on a large amount of training data\nand have relatively low accuracy. To address these problems, this paper\nproposes a prompt-based learning pre-trained model. The model can achieve high\nperformance even with limited training data. In this study, three experiments\nwere conducted, and the results showed that our model not only produced the\nhighest accuracy, macro F1 score, and kappa values on large training sets, but\nalso performed the best on small training sets of the CPS behavioral data. The\napplication of the proposed prompt-based learning pre-trained model contributes\nto the CPS skills coding task and can also be used for other CSCW coding tasks\nto replace manual coding.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}