{"id":"2407.17622","title":"Towards Neural Network based Cognitive Models of Dynamic Decision-Making\n  by Humans","authors":"Changyu Chen, Shashank Reddy Chirra, Maria Jos\\'e Ferreira, Cleotilde\n  Gonzalez, Arunesh Sinha, Pradeep Varakantham","authorsParsed":[["Chen","Changyu",""],["Chirra","Shashank Reddy",""],["Ferreira","Maria José",""],["Gonzalez","Cleotilde",""],["Sinha","Arunesh",""],["Varakantham","Pradeep",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 20:28:03 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 15:52:47 GMT"}],"updateDate":"2024-09-06","timestamp":1721852883000,"abstract":"  Modeling human cognitive processes in dynamic decision-making tasks has been\nan endeavor in AI for a long time because such models can help make AI systems\nmore intuitive, personalized, mitigate any human biases, and enhance training\nin simulation. Some initial work has attempted to utilize neural networks (and\nlarge language models) but often assumes one common model for all humans and\naims to emulate human behavior in aggregate. However, the behavior of each\nhuman is distinct, heterogeneous, and relies on specific past experiences in\ncertain tasks. For instance, consider two individuals responding to a phishing\nemail: one who has previously encountered and identified similar threats may\nrecognize it quickly, while another without such experience might fall for the\nscam. In this work, we build on Instance Based Learning (IBL) that posits that\nhuman decisions are based on similar situations encountered in the past.\nHowever, IBL relies on simple fixed form functions to capture the mapping from\npast situations to current decisions. To that end, we propose two new\nattention-based neural network models to have open form non-linear functions to\nmodel distinct and heterogeneous human decision-making in dynamic settings. We\nexperiment with two distinct datasets gathered from human subject experiment\ndata, one focusing on detection of phishing email by humans and another where\nhumans act as attackers in a cybersecurity setting and decide on an attack\noption. We conducted extensive experiments with our two neural network models,\nIBL, and GPT3.5, and demonstrate that the neural network models outperform IBL\nsignificantly in representing human decision-making, while providing similar\ninterpretability of human decisions as IBL. Overall, our work yields promising\nresults for further use of neural networks in cognitive modeling of human\ndecision making.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_pY3skiSsA-n4aGMWXtAHp6rvNA36lWjabfT-URdjWg","pdfSize":"1918147"}
