{"id":"2407.20190","title":"Prospects of using closure traces directly for imaging in Very Long\n  Baseline Interferometry","authors":"Hendrik M\\\"uller","authorsParsed":[["Müller","Hendrik",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 17:16:25 GMT"}],"updateDate":"2024-07-30","timestamp":1722273385000,"abstract":"  The reconstruction of the polarization of a source in radio interferometry is\na challenging calibration problem since the reconstruction strongly depends on\nthe gains and leakages that need to be inferred along with the image. This is\nparticularly true for the Event Horizon Telescope (EHT) due to its small number\nof antennas, small signal-to-noise ratio and large gain corruptions. To recover\nlinear polarization, one either has to infer the leakages and gains together\nwith the image structure, or rely completely on calibration independent closure\nquantities. While the first approach has been explored in Very Long Baseline\nInterferometry (VLBI) for a long time, the later one has been less studied for\npolarimetry. Closure traces are a recently proposed concept of closure\nquantities that, in contrast to closure phases and closure amplitudes, are\nindependent against both gains and leakages and carry the relevant information\nabout the polarization of the source. Here we explore, how closure traces could\nbe directly fitted to create an image and point out an imaging pipeline that\nsucceeds in the direct imaging from closure traces. Since closure traces have a\nnumber of inherent degeneracies, multiple local image modes that can fit the\ndata are detected. Therefore, a multiobjective imaging technique is needed to\ncorrectly sample this multimodality. Closure traces are not constraining enough\nfor the EHT configuration in 2017 to recover an image directly, mainly due to\nthe small number of antennas. For planned successors of the EHT however (with a\nsignificantly larger number of antennas), this option becomes feasible and\nperforms competitive to the imaging with residual leakages.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}