{"id":"2407.13087","title":"Forecasting Supernova Observations with the CSST: I. Photometric Samples","authors":"Chengqi Liu, Youhua Xu, Xianmin Meng, Xin Zhang, Shi-Yu Li, Yuming Fu,\n  Xiaofeng Wang, Shufei Liu, Zun Luo, Guanghuan Wang, Hu Zhan","authorsParsed":[["Liu","Chengqi",""],["Xu","Youhua",""],["Meng","Xianmin",""],["Zhang","Xin",""],["Li","Shi-Yu",""],["Fu","Yuming",""],["Wang","Xiaofeng",""],["Liu","Shufei",""],["Luo","Zun",""],["Wang","Guanghuan",""],["Zhan","Hu",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 01:23:39 GMT"}],"updateDate":"2024-09-17","timestamp":1721265819000,"abstract":"  The China Space Station Telescope (CSST, also known as Xuntian) is a\nserviceable two-meter-aperture wide-field telescope operating in the same orbit\nas the China Space Station. The CSST plans to survey a sky area of 17,500\ndeg$^2$ of the medium-to-high Galactic latitude to a depth of 25-26 AB mag in\nat least 6 photometric bands over 255-1000 nm. Within such a large sky area,\nslitless spectra will also be taken over the same wavelength range as the\nimaging survey. Even though the CSST survey is not dedicated to time-domain\nstudies, it would still detect a large number of transients, such as supernovae\n(SNe). In this paper, we simulate photometric SN observations based on a\nstrawman survey plan using the Sncosmo package. During its 10-year survey, the\nCSST is expected to observe about 5 million SNe of various types. With quality\ncuts, we obtain a \"gold\" sample that comprises roughly 7,400 SNe Ia, 2,200 SNe\nIbc, and 6,500 SNe II candidates with correctly classified percentages reaching\n91%, 63%, and 93% (formally defined as classification precision), respectively.\nThe same survey can also trigger alerts for the detection of about 15,500 SNe\nIa (precision 61%) and 2,100 SNe II (precision 49%) candidates at least two\ndays before the light maxima. Moreover, the near-ultraviolet observations of\nthe CSST will be able to catch hundreds of shock-cooling events serendipitously\nevery year. These results demonstrate that the CSST can make a potentially\nsignificant contribution to SN studies.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}