{"id":"2407.20733","title":"Current Correlations and Conductivity in SYK-Like Systems: An Analytical\n  Study","authors":"Rishabh Jha, Stefan Kehrein, Jan C. Louw","authorsParsed":[["Jha","Rishabh",""],["Kehrein","Stefan",""],["Louw","Jan C.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 14:21:30 GMT"}],"updateDate":"2024-07-31","timestamp":1722262890000,"abstract":"  We present a functional-based approach to compute thermal expectation values\nfor actions expressed in the $G-\\Sigma$ formalism, applicable to any time\nsequence ordering. Utilizing this framework, we analyze the linear response to\nan electric field in various Sachdev-Ye-Kitaev (SYK) chains. We consider the\nSYK chain where each dot is a complex $q/2$-body interacting SYK model, and we\nallow for $r/2$-body nearest-neighbor hopping where $r=\\kappa q$. We find exact\nanalytical expressions in the large-$q$ limit for conductivities across all\ntemperatures at leading order in $1/q$ for three cases, namely $\\kappa = \\{\n1/2, 1, 2\\}$. When $\\kappa = \\{1/2, 1\\}$, we observe linear-in-temperature $T$\nresistivities at low temperatures, indicative of strange metal behavior.\nConversely, when $\\kappa = 2$, the resistivity diverges as a power law at low\ntemperatures, namely as $1/T^2$, resembling insulating behavior. As $T$\nincreases, there is a crossover to Fermi liquid behavior ($\\sim T^2$) at the\nminimum resistivity. Beyond this, another crossover occurs to strange metal\nbehavior ($\\sim T$). In comparison to previous linear-in-$T$ results in the\nliterature, we also show that the resistivity behavior exists even below the\nMIR bound, indicating a true strange metal instead of a bad metal. In\nparticular, we find for the $\\kappa = 2$ case a smooth crossover from an\ninsulating phase to a Fermi liquid behavior to a true strange metal and\neventually becoming a bad metal as temperature increases. We extend and\ngeneralize previously known results on resistivities to all temperatures, do a\ncomparative analysis across the three models where we highlight the universal\nfeatures and invoke scaling arguments to create a physical picture out of our\nanalyses. Remarkably, we find a universal maximum DC conductivity across all\nthree models when the hopping coupling strength becomes large.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}