{"id":"2407.05521","title":"Accelerating MRI Uncertainty Estimation with Mask-based Bayesian Neural\n  Network","authors":"Zehuan Zhang, Matej Genci, Hongxiang Fan, Andreas Wetscherek, and\n  Wayne Luk","authorsParsed":[["Zhang","Zehuan",""],["Genci","Matej",""],["Fan","Hongxiang",""],["Wetscherek","Andreas",""],["Luk","Wayne",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 23:57:40 GMT"}],"updateDate":"2024-07-09","timestamp":1720396660000,"abstract":"  Accurate and reliable Magnetic Resonance Imaging (MRI) analysis is\nparticularly important for adaptive radiotherapy, a recent medical advance\ncapable of improving cancer diagnosis and treatment. Recent studies have shown\nthat IVIM-NET, a deep neural network (DNN), can achieve high accuracy in MRI\nanalysis, indicating the potential of deep learning to enhance diagnostic\ncapabilities in healthcare. However, IVIM-NET does not provide calibrated\nuncertainty information needed for reliable and trustworthy predictions in\nhealthcare. Moreover, the expensive computation and memory demands of IVIM-NET\nreduce hardware performance, hindering widespread adoption in realistic\nscenarios. To address these challenges, this paper proposes an\nalgorithm-hardware co-optimization flow for high-performance and reliable MRI\nanalysis. At the algorithm level, a transformation design flow is introduced to\nconvert IVIM-NET to a mask-based Bayesian Neural Network (BayesNN),\nfacilitating reliable and efficient uncertainty estimation. At the hardware\nlevel, we propose an FPGA-based accelerator with several hardware\noptimizations, such as mask-zero skipping and operation reordering.\nExperimental results demonstrate that our co-design approach can satisfy the\nuncertainty requirements of MRI analysis, while achieving 7.5 times and 32.5\ntimes speedup on an Xilinx VU13P FPGA compared to GPU and CPU implementations\nwith reduced power consumption.\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}