{"id":"2407.13028","title":"Anomalous Nernst effect based near field imaging of magnetic\n  nanostructures","authors":"Atul Pandey, Jitul Deka, Jiho Yoon, Chris Koerner, Rouven Dreyer,\n  James M. Taylor, Stuart S. P. Parkin, Georg Woltersdorf","authorsParsed":[["Pandey","Atul",""],["Deka","Jitul",""],["Yoon","Jiho",""],["Koerner","Chris",""],["Dreyer","Rouven",""],["Taylor","James M.",""],["Parkin","Stuart S. P.",""],["Woltersdorf","Georg",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 21:35:07 GMT"}],"updateDate":"2024-07-19","timestamp":1721252107000,"abstract":"  The anomalous Nernst effect (ANE) gives rise to an electrical response\ntransverse to the magnetization and an applied temperature gradient in a\nmagnetic metal. A nanoscale temperature gradient can be generated by the use of\na laser beam applied to the apex of an atomic force microscope tip, thereby\nallowing for spatially-resolved ANE measurements beyond the optical diffraction\nlimit. Such a method has been used previously to map in-plane magnetized\nmagnetic textures. However, the spatial distribution of the out-of-plane\ntemperature gradient, which is needed to fully interpret such an ANE-based\nimaging, was not studied. We therefore use a well-known magnetic texture, a\nmagnetic vortex core, to demonstrate the reliability of the ANE method for the\nimaging of magnetic domains with nanoscale resolution. Moreover, since the ANE\nsignal is directly proportional to the temperature gradient, we can also\nconsider the inverse problem and deduce information about the nanoscale\ntemperature distribution. Our results together with finite element modeling\nindicate that besides the out-of-plane temperature gradients, there are even\nlarger in-plane temperature gradients. Thus we extend the ANE imaging to study\nout-of-plane magnetization in a racetrack nano-wire by detecting the ANE signal\ngenerated by in-plane temperature gradients. In all cases, a spatial resolution\nof about 80 nm is obtained. These results are significant for the rapidly\ngrowing field of thermo-electric imaging of antiferromagnetic spintronic device\nstructures.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JaxZ6G6K5pOyJEP9jBysNuIbzVFQhAHWasHxXZqPw0E","pdfSize":"13239526","objectId":"0x1ac1a6f4cf7493b2f05ecb91399bc011922d7a72b2ee2f9873bd1a8a890db49a","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
