{"id":"2407.09909","title":"Spatio-temporal areal models to support small area estimation: An\n  application to national-scale forest carbon monitoring","authors":"Elliot S. Shannon, Andrew O. Finley, Paul B. May, Grant M. Domke,\n  Hans-Erik Andersen, George C. Gaines III, Sudipto Banerjee","authorsParsed":[["Shannon","Elliot S.",""],["Finley","Andrew O.",""],["May","Paul B.",""],["Domke","Grant M.",""],["Andersen","Hans-Erik",""],["Gaines","George C.","III"],["Banerjee","Sudipto",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 14:59:02 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 14:12:59 GMT"}],"updateDate":"2024-07-31","timestamp":1720882742000,"abstract":"  National Forest Inventory (NFI) programs can provide vital information on the\nstatus, trend, and change in forest parameters. These programs are being\nincreasingly asked to provide forest parameter estimates for spatial and\ntemporal extents smaller than their current design and accompanying\ndesign-based methods can deliver with desired levels of uncertainty. Many NFI\ndesigns and estimation methods focus on status and are not well equipped to\nprovide acceptable estimates for trend and change parameters, especially over\nsmall spatial domains and/or short time periods. Fine-scale space-time indexed\nestimates are critical to a variety of environmental, ecological, and economic\nmonitoring efforts. Estimates for forest carbon status, trend, and change are\nof particular importance to international initiatives to track carbon dynamics.\nModel-based small area estimation (SAE) methods for NFI and similar ecological\nmonitoring data typically pursue inference on status within small spatial\ndomains, with few demonstrated methods that account for spatio-temporal\ndependence needed for trend and change estimation. We propose a spatio-temporal\nBayesian model framework that delivers statistically valid estimates with full\nuncertainty quantification for status, trend, and change. The framework\naccommodates a variety of space and time dependency structures, and we detail\nmodel configurations for different settings. Through analysis of simulated\ndatasets, we compare the relative performance of candidate models and a\ntraditional direct estimator. We then apply candidate models to a large-scale\nNFI dataset to demonstrate the utility of the proposed framework for providing\nunique quantification of forest carbon dynamics in the contiguous United\nStates. We also provide computationally efficient algorithms, software, and\ndata to reproduce our results and for benchmarking.\n","subjects":["Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}