{"id":"2407.05404","title":"iSign: A Benchmark for Indian Sign Language Processing","authors":"Abhinav Joshi and Romit Mohanty and Mounika Kanakanti and Andesha\n  Mangla and Sudeep Choudhary and Monali Barbate and Ashutosh Modi","authorsParsed":[["Joshi","Abhinav",""],["Mohanty","Romit",""],["Kanakanti","Mounika",""],["Mangla","Andesha",""],["Choudhary","Sudeep",""],["Barbate","Monali",""],["Modi","Ashutosh",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 15:07:35 GMT"}],"updateDate":"2024-07-09","timestamp":1720364855000,"abstract":"  Indian Sign Language has limited resources for developing machine learning\nand data-driven approaches for automated language processing. Though\ntext/audio-based language processing techniques have shown colossal research\ninterest and tremendous improvements in the last few years, Sign Languages\nstill need to catch up due to the need for more resources. To bridge this gap,\nin this work, we propose iSign: a benchmark for Indian Sign Language (ISL)\nProcessing. We make three primary contributions to this work. First, we release\none of the largest ISL-English datasets with more than 118K\nvideo-sentence/phrase pairs. To the best of our knowledge, it is the largest\nsign language dataset available for ISL. Second, we propose multiple\nNLP-specific tasks (including SignVideo2Text, SignPose2Text, Text2Pose, Word\nPrediction, and Sign Semantics) and benchmark them with the baseline models for\neasier access to the research community. Third, we provide detailed insights\ninto the proposed benchmarks with a few linguistic insights into the workings\nof ISL. We streamline the evaluation of Sign Language processing, addressing\nthe gaps in the NLP research community for Sign Languages. We release the\ndataset, tasks, and models via the following website:\nhttps://exploration-lab.github.io/iSign/\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}