{"id":"2407.15899","title":"Spatial-Temporal Cross-View Contrastive Pre-training for Check-in\n  Sequence Representation Learning","authors":"Letian Gong, Huaiyu Wan, Shengnan Guo, Xiucheng Li, Yan Lin, Erwen\n  Zheng, Tianyi Wang, Zeyu Zhou and Youfang Lin","authorsParsed":[["Gong","Letian",""],["Wan","Huaiyu",""],["Guo","Shengnan",""],["Li","Xiucheng",""],["Lin","Yan",""],["Zheng","Erwen",""],["Wang","Tianyi",""],["Zhou","Zeyu",""],["Lin","Youfang",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 10:20:34 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 05:05:53 GMT"},{"version":"v3","created":"Thu, 25 Jul 2024 07:18:05 GMT"}],"updateDate":"2024-07-26","timestamp":1721643634000,"abstract":"  The rapid growth of location-based services (LBS) has yielded massive amounts\nof data on human mobility. Effectively extracting meaningful representations\nfor user-generated check-in sequences is pivotal for facilitating various\ndownstream services. However, the user-generated check-in data are\nsimultaneously influenced by the surrounding objective circumstances and the\nuser's subjective intention. Specifically, the temporal uncertainty and spatial\ndiversity exhibited in check-in data make it difficult to capture the\nmacroscopic spatial-temporal patterns of users and to understand the semantics\nof user mobility activities. Furthermore, the distinct characteristics of the\ntemporal and spatial information in check-in sequences call for an effective\nfusion method to incorporate these two types of information. In this paper, we\npropose a novel Spatial-Temporal Cross-view Contrastive Representation (STCCR)\nframework for check-in sequence representation learning. Specifically, STCCR\naddresses the above challenges by employing self-supervision from \"spatial\ntopic\" and \"temporal intention\" views, facilitating effective fusion of spatial\nand temporal information at the semantic level. Besides, STCCR leverages\ncontrastive clustering to uncover users' shared spatial topics from diverse\nmobility activities, while employing angular momentum contrast to mitigate the\nimpact of temporal uncertainty and noise. We extensively evaluate STCCR on\nthree real-world datasets and demonstrate its superior performance across three\ndownstream tasks.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bQ5ZW_WwtHv4ZrZx1T2Ig5Lxn-sZsVs4MbUkEvXp07U","pdfSize":"11529109"}
