{"id":"2407.17688","title":"Examining the Influence of Political Bias on Large Language Model\n  Performance in Stance Classification","authors":"Lynnette Hui Xian Ng, Iain Cruickshank, Roy Ka-Wei Lee","authorsParsed":[["Ng","Lynnette Hui Xian",""],["Cruickshank","Iain",""],["Lee","Roy Ka-Wei",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 01:11:38 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 12:47:13 GMT"}],"updateDate":"2024-07-29","timestamp":1721869898000,"abstract":"  Large Language Models (LLMs) have demonstrated remarkable capabilities in\nexecuting tasks based on natural language queries. However, these models,\ntrained on curated datasets, inherently embody biases ranging from racial to\nnational and gender biases. It remains uncertain whether these biases impact\nthe performance of LLMs for certain tasks. In this study, we investigate the\npolitical biases of LLMs within the stance classification task, specifically\nexamining whether these models exhibit a tendency to more accurately classify\npolitically-charged stances. Utilizing three datasets, seven LLMs, and four\ndistinct prompting schemes, we analyze the performance of LLMs on politically\noriented statements and targets. Our findings reveal a statistically\nsignificant difference in the performance of LLMs across various politically\noriented stance classification tasks. Furthermore, we observe that this\ndifference primarily manifests at the dataset level, with models and prompting\nschemes showing statistically similar performances across different stance\nclassification datasets. Lastly, we observe that when there is greater\nambiguity in the target the statement is directed towards, LLMs have poorer\nstance classification accuracy.\n  Code & Dataset: http://doi.org/10.5281/zenodo.12938478\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"vTn23yOHrvxUiJZo-7IFVAlaegTAfVtF40TxxixHzMc","pdfSize":"1035978","objectId":"0xaf32a9b69897a24254b7ab4a8584462d486a5a8212b543e81e950a5e4fcc5db8","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
