{"id":"2407.13930","title":"RT-Pose: A 4D Radar Tensor-based 3D Human Pose Estimation and\n  Localization Benchmark","authors":"Yuan-Hao Ho, Jen-Hao Cheng, Sheng Yao Kuan, Zhongyu Jiang, Wenhao\n  Chai, Hsiang-Wei Huang, Chih-Lung Lin, Jenq-Neng Hwang","authorsParsed":[["Ho","Yuan-Hao",""],["Cheng","Jen-Hao",""],["Kuan","Sheng Yao",""],["Jiang","Zhongyu",""],["Chai","Wenhao",""],["Huang","Hsiang-Wei",""],["Lin","Chih-Lung",""],["Hwang","Jenq-Neng",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 22:46:35 GMT"}],"updateDate":"2024-07-22","timestamp":1721342795000,"abstract":"  Traditional methods for human localization and pose estimation (HPE), which\nmainly rely on RGB images as an input modality, confront substantial\nlimitations in real-world applications due to privacy concerns. In contrast,\nradar-based HPE methods emerge as a promising alternative, characterized by\ndistinctive attributes such as through-wall recognition and privacy-preserving,\nrendering the method more conducive to practical deployments. This paper\npresents a Radar Tensor-based human pose (RT-Pose) dataset and an open-source\nbenchmarking framework. The RT-Pose dataset comprises 4D radar tensors, LiDAR\npoint clouds, and RGB images, and is collected for a total of 72k frames across\n240 sequences with six different complexity-level actions. The 4D radar tensor\nprovides raw spatio-temporal information, differentiating it from other radar\npoint cloud-based datasets. We develop an annotation process using RGB images\nand LiDAR point clouds to accurately label 3D human skeletons. In addition, we\npropose HRRadarPose, the first single-stage architecture that extracts the\nhigh-resolution representation of 4D radar tensors in 3D space to aid human\nkeypoint estimation. HRRadarPose outperforms previous radar-based HPE work on\nthe RT-Pose benchmark. The overall HRRadarPose performance on the RT-Pose\ndataset, as reflected in a mean per joint position error (MPJPE) of 9.91cm,\nindicates the persistent challenges in achieving accurate HPE in complex\nreal-world scenarios. RT-Pose is available at\nhttps://huggingface.co/datasets/uwipl/RT-Pose.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}