{"id":"2407.20362","title":"Generalized Ellipsoids","authors":"Amir Ali Ahmadi, Abraar Chaudhry, Cemil Dibek","authorsParsed":[["Ahmadi","Amir Ali",""],["Chaudhry","Abraar",""],["Dibek","Cemil",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:22:58 GMT"}],"updateDate":"2024-07-31","timestamp":1722277378000,"abstract":"  We introduce a family of symmetric convex bodies called generalized\nellipsoids of degree $d$ (GE-$d$s), with ellipsoids corresponding to the case\nof $d=0$. Generalized ellipsoids (GEs) retain many geometric, algebraic, and\nalgorithmic properties of ellipsoids. We show that the conditions that the\nparameters of a GE must satisfy can be checked in strongly polynomial time, and\nthat one can search for GEs of a given degree by solving a semidefinite program\nwhose size grows only linearly with dimension. We give an example of a GE which\ndoes not have a second-order cone representation, but show that every GE has a\nsemidefinite representation whose size depends linearly on both its dimension\nand degree. In terms of expressiveness, we prove that for any integer $m\\geq\n2$, every symmetric full-dimensional polytope with $2m$ facets and every\nintersection of $m$ co-centered ellipsoids can be represented exactly as a\nGE-$d$ with $d \\leq 2m-3$. Using this result, we show that every symmetric\nconvex body can be approximated arbitrarily well by a GE-$d$ and we quantify\nthe quality of the approximation as a function of the degree $d$. Finally, we\npresent applications of GEs to several areas, such as time-varying portfolio\noptimization, stability analysis of switched linear systems, robust-to-dynamics\noptimization, and robust polynomial regression.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Numerical Analysis","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Mathematics/Algebraic Geometry","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}