{"id":"2407.11203","title":"The Life Cycle of Large Language Models: A Review of Biases in Education","authors":"Jinsook Lee, Yann Hicke, Renzhe Yu, Christopher Brooks, Ren\\'e F.\n  Kizilcec","authorsParsed":[["Lee","Jinsook",""],["Hicke","Yann",""],["Yu","Renzhe",""],["Brooks","Christopher",""],["Kizilcec","René F.",""]],"versions":[{"version":"v1","created":"Mon, 3 Jun 2024 18:00:28 GMT"}],"updateDate":"2024-07-17","timestamp":1717437628000,"abstract":"  Large Language Models (LLMs) are increasingly adopted in educational contexts\nto provide personalized support to students and teachers. The unprecedented\ncapacity of LLM-based applications to understand and generate natural language\ncan potentially improve instructional effectiveness and learning outcomes, but\nthe integration of LLMs in education technology has renewed concerns over\nalgorithmic bias which may exacerbate educational inequities. In this review,\nbuilding on prior work on mapping the traditional machine learning life cycle,\nwe provide a holistic map of the LLM life cycle from the initial development of\nLLMs to customizing pre-trained models for various applications in educational\nsettings. We explain each step in the LLM life cycle and identify potential\nsources of bias that may arise in the context of education. We discuss why\ncurrent measures of bias from traditional machine learning fail to transfer to\nLLM-generated content in education, such as tutoring conversations because the\ntext is high-dimensional, there can be multiple correct responses, and\ntailoring responses may be pedagogically desirable rather than unfair. This\nreview aims to clarify the complex nature of bias in LLM applications and\nprovide practical guidance for their evaluation to promote educational equity.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ZGrq7zFtGXOlBDp1JCclIUC8qjz7MCdeS4WXJDq26K8","pdfSize":"426092","objectId":"0xf3abced0c74730a38cec7a8e135eef61b89ac312547e3d9864b970682e6ad93e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
