{"id":"2407.07178","title":"Uniaxial plasmon polaritons $\\textit{via}$ charge transfer at the\n  graphene/CrSBr interface","authors":"Daniel J. Rizzo, Eric Seewald, Fangzhou Zhao, Jordan Cox, Kaichen Xie,\n  Rocco A. Vitalone, Francesco L. Ruta, Daniel G. Chica, Yinming Shao, Sara\n  Shabani, Evan J. Telford, Matthew C. Strasbourg, Thomas P. Darlington, Suheng\n  Xu, Siyuan Qiu, Aravind Devarakonda, Takashi Taniguchi, Kenji Watanabe,\n  Xiaoyang Zhu, P. James Schuck, Cory R. Dean, Xavier Roy, Andrew J. Millis,\n  Ting Cao, Angel Rubio, Abhay N. Pasupathy, D.N. Basov","authorsParsed":[["Rizzo","Daniel J.",""],["Seewald","Eric",""],["Zhao","Fangzhou",""],["Cox","Jordan",""],["Xie","Kaichen",""],["Vitalone","Rocco A.",""],["Ruta","Francesco L.",""],["Chica","Daniel G.",""],["Shao","Yinming",""],["Shabani","Sara",""],["Telford","Evan J.",""],["Strasbourg","Matthew C.",""],["Darlington","Thomas P.",""],["Xu","Suheng",""],["Qiu","Siyuan",""],["Devarakonda","Aravind",""],["Taniguchi","Takashi",""],["Watanabe","Kenji",""],["Zhu","Xiaoyang",""],["Schuck","P. James",""],["Dean","Cory R.",""],["Roy","Xavier",""],["Millis","Andrew J.",""],["Cao","Ting",""],["Rubio","Angel",""],["Pasupathy","Abhay N.",""],["Basov","D. N.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 18:46:01 GMT"}],"updateDate":"2024-07-11","timestamp":1720550761000,"abstract":"  Graphene is a privileged 2D platform for hosting confined light-matter\nexcitations known as surface plasmon-polaritons (SPPs), as it possesses low\nintrinsic losses with a high degree of optical confinement. However, the\ninherently isotropic optical properties of graphene limit its ability to guide\nand focus SPPs, making it less suitable than anisotropic elliptical and\nhyperbolic materials as a platform for polaritonic lensing and canalization.\nHere, we present the graphene/CrSBr heterostructure as an engineered 2D\ninterface that hosts highly anisotropic SPP propagation over a wide range of\nfrequencies in the mid-infrared and terahertz. Using a combination of scanning\ntunneling microscopy (STM), scattering-type scanning near-field optical\nmicroscopy (s-SNOM), and first-principles calculations, we demonstrate mutual\ndoping in excess of 10$^{13}$ cm$^{-2}$ holes/electrons between the interfacial\nlayers of graphene/CrSBr heterostructures. SPPs in graphene activated by charge\ntransfer interact with charge-induced anisotropic intra- and interband\ntransitions in the interfacial doped CrSBr, leading to preferential SPP\npropagation along the quasi-1D chains that compose each CrSBr layer. This\nmultifaceted proximity effect both creates SPPs and endows them with\nanisotropic transport and propagation lengths that differ by an\norder-of-magnitude between the two in-plane crystallographic axes of CrSBr.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/"}