{"id":"2407.16973","title":"Simulation study of performance of the Very Large Area gamma-ray Space\n  Telescope","authors":"Xu Pan, Wei Jiang, Chuan Yue, Shi-Jun Lei, Yu-Xin Cui, Qiang Yuan","authorsParsed":[["Pan","Xu",""],["Jiang","Wei",""],["Yue","Chuan",""],["Lei","Shi-Jun",""],["Cui","Yu-Xin",""],["Yuan","Qiang",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 03:43:13 GMT"}],"updateDate":"2024-09-02","timestamp":1721792593000,"abstract":"  The Very Large Area gamma-ray Space Telescope (VLAST) is a mission concept\nproposed to detect gamma-ray photons through both the Compton scattering and\nelectron-positron pair production mechanisms, enabling the detection of photons\nwith energies ranging from MeV to TeV. This project aims to conduct a\ncomprehensive survey of the gamma-ray sky from a low Earth orbit using an\nanti-coincidence detector, a tracker detector that also serves as a low energy\ncalorimeter, and a high energy imaging calorimeter. We developed a Monte Carlo\nsimulation application of the detector with the GEANT4 toolkit to evaluate the\ninstrument performance including the effective area, angular resolution and\nenergy resolution, as well as explored specific optimizations of the detector\nconfiguration. Our simulation-based analysis indicates that the VLAST's current\ndesign is physically feasible, with an acceptance larger than 10~$\\rm m^2\\ sr$\nwhich is four times larger than Fermi-LAT, an energy resolution better than 2\\%\nat 10~GeV, and an angular resolution better than 0.2 degrees at 10~GeV. The\nVLAST project is expected to make significant contribution to the field of\ngamma-ray astronomy and to enhance our understanding of the cosmos.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Experiment","Physics/High Energy Physics - Phenomenology","Physics/Instrumentation and Detectors"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}