{"id":"2407.01367","title":"Domain Influence in MRI Medical Image Segmentation: spatial versus\n  k-space inputs","authors":"Erik G\\\"osche, Reza Eghbali, Florian Knoll and Andreas M Rauschecker","authorsParsed":[["Gösche","Erik",""],["Eghbali","Reza",""],["Knoll","Florian",""],["Rauschecker","Andreas M",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 15:21:41 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 09:11:54 GMT"},{"version":"v3","created":"Mon, 5 Aug 2024 06:58:01 GMT"}],"updateDate":"2024-08-06","timestamp":1719847301000,"abstract":"  Transformer-based networks applied to image patches have achieved\ncutting-edge performance in many vision tasks. However, lacking the built-in\nbias of convolutional neural networks (CNN) for local image statistics, they\nrequire large datasets and modifications to capture relationships between\npatches, especially in segmentation tasks. Images in the frequency domain might\nbe more suitable for the attention mechanism, as local features are represented\nglobally. By transforming images into the frequency domain, local features are\nrepresented globally. Due to MRI data acquisition properties, these images are\nparticularly suitable. This work investigates how the image domain (spatial or\nk-space) affects segmentation results of deep learning (DL) models, focusing on\nattention-based networks and other non-convolutional models based on MLPs. We\nalso examine the necessity of additional positional encoding for\nTransformer-based networks when input images are in the frequency domain. For\nevaluation, we pose a skull stripping task and a brain tissue segmentation\ntask. The attention-based models used are PerceiverIO and a vanilla Transformer\nencoder. To compare with non-attention-based models, an MLP and ResMLP are also\ntrained and tested. Results are compared with the Swin-Unet, the\nstate-of-the-art medical image segmentation model. Experimental results show\nthat using k-space for the input domain can significantly improve segmentation\nresults. Also, additional positional encoding does not seem beneficial for\nattention-based networks if the input is in the frequency domain. Although none\nof the models matched the Swin-Unet's performance, the less complex models\nshowed promising improvements with a different domain choice.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}