{"id":"2407.17795","title":"Enhancing Diversity in Multi-objective Feature Selection","authors":"Sevil Zanjani Miyandoab, Shahryar Rahnamayan, Azam Asilian Bidgoli,\n  Sevda Ebrahimi, Masoud Makrehchi","authorsParsed":[["Miyandoab","Sevil Zanjani",""],["Rahnamayan","Shahryar",""],["Bidgoli","Azam Asilian",""],["Ebrahimi","Sevda",""],["Makrehchi","Masoud",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 06:09:44 GMT"},{"version":"v2","created":"Sun, 18 Aug 2024 04:46:21 GMT"}],"updateDate":"2024-08-20","timestamp":1721887784000,"abstract":"  Feature selection plays a pivotal role in the data preprocessing and\nmodel-building pipeline, significantly enhancing model performance,\ninterpretability, and resource efficiency across diverse domains. In\npopulation-based optimization methods, the generation of diverse individuals\nholds utmost importance for adequately exploring the problem landscape,\nparticularly in highly multi-modal multi-objective optimization problems. Our\nstudy reveals that, in line with findings from several prior research papers,\ncommonly employed crossover and mutation operations lack the capability to\ngenerate high-quality diverse individuals and tend to become confined to\nlimited areas around various local optima. This paper introduces an\naugmentation to the diversity of the population in the well-established\nmulti-objective scheme of the genetic algorithm, NSGA-II. This enhancement is\nachieved through two key components: the genuine initialization method and the\nsubstitution of the worst individuals with new randomly generated individuals\nas a re-initialization approach in each generation. The proposed\nmulti-objective feature selection method undergoes testing on twelve real-world\nclassification problems, with the number of features ranging from 2,400 to\nnearly 50,000. The results demonstrate that replacing the last front of the\npopulation with an equivalent number of new random individuals generated using\nthe genuine initialization method and featuring a limited number of features\nsubstantially improves the population's quality and, consequently, enhances the\nperformance of the multi-objective algorithm.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}