{"id":"2407.11820","title":"Stepping Stones: A Progressive Training Strategy for Audio-Visual\n  Semantic Segmentation","authors":"Juncheng Ma, Peiwen Sun, Yaoting Wang, Di Hu","authorsParsed":[["Ma","Juncheng",""],["Sun","Peiwen",""],["Wang","Yaoting",""],["Hu","Di",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 15:08:30 GMT"},{"version":"v2","created":"Mon, 9 Sep 2024 16:43:34 GMT"},{"version":"v3","created":"Thu, 12 Sep 2024 09:20:26 GMT"}],"updateDate":"2024-09-13","timestamp":1721142510000,"abstract":"  Audio-Visual Segmentation (AVS) aims to achieve pixel-level localization of\nsound sources in videos, while Audio-Visual Semantic Segmentation (AVSS), as an\nextension of AVS, further pursues semantic understanding of audio-visual\nscenes. However, since the AVSS task requires the establishment of audio-visual\ncorrespondence and semantic understanding simultaneously, we observe that\nprevious methods have struggled to handle this mashup of objectives in\nend-to-end training, resulting in insufficient learning and sub-optimization.\nTherefore, we propose a two-stage training strategy called \\textit{Stepping\nStones}, which decomposes the AVSS task into two simple subtasks from\nlocalization to semantic understanding, which are fully optimized in each stage\nto achieve step-by-step global optimization. This training strategy has also\nproved its generalization and effectiveness on existing methods. To further\nimprove the performance of AVS tasks, we propose a novel framework Adaptive\nAudio Visual Segmentation, in which we incorporate an adaptive audio query\ngenerator and integrate masked attention into the transformer decoder,\nfacilitating the adaptive fusion of visual and audio features. Extensive\nexperiments demonstrate that our methods achieve state-of-the-art results on\nall three AVS benchmarks. The project homepage can be accessed at\nhttps://gewu-lab.github.io/stepping_stones/.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}