{"id":"2407.06717","title":"Acoustic axes conditions revised","authors":"Yakov Itin","authorsParsed":[["Itin","Yakov",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 09:44:51 GMT"}],"updateDate":"2024-07-10","timestamp":1720518291000,"abstract":"  The explanation of the basic acoustic properties of crystals requires a\nrecognition of the acoustic axes. To derive the acoustic axes in a given\nmaterial, one requires both a workable method and the necessary and sufficient\ncriteria for the existence of the acoustic axes in a partial propagation\ndirection. We apply the reduced form of the acoustic tensor to the acoustic\naxis conditions in the present work. Using this tensor, we obtain in a compact\nform, allowing for qualitative analysis, the necessary and sufficient criteria\nfor the existence of the acoustic axis. Furthermore, the well-known Khatkevich\ncriteria and their variants are recast in terms of the reduced acoustic tensor.\nThis paper's primary input is an alternate minimal polynomial-based system of\nacoustic axes conditions. In this approach, we derive an additional\ncharacteristic of acoustic axes: the directions in which the minimal polynomial\nof the third order is reduced to that of the second order. Next, we offer a\ngeneral solution to the second-order minimum polynomial equation, that utilizes\na scalar and a unit vector for defining the acoustic tensor along the acoustic\naxis. It is shown that the scalar matches the eigenvalue of the reduced\nacoustic tensor, and the vector corresponds to the polarization into the single\neigenvalue direction. We use the minimal polynomial construction to demonstrate\nthe equivalence of different acoustic axis criteria. We demonstrate the\napplicability of this approach to actual computations of the acoustic axes and\ntheir fundamental properties (phase speeds and polarizations) for high symmetry\ncases, such as isotropic materials and RTHC crystals.\n","subjects":["Physics/Mathematical Physics","Mathematics/Mathematical Physics","Physics/Classical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ISaEF2vFvMITPTJxuHJCCWbSIREb7y6QRsysAXNUth4","pdfSize":"1101184"}
