{"id":"2407.14441","title":"Computing ground states of spin-2 Bose-Einstein condensates by the\n  normalized gradient flow","authors":"Weizhu Bao, Qinglin Tang, Yongjun Yuan","authorsParsed":[["Bao","Weizhu",""],["Tang","Qinglin",""],["Yuan","Yongjun",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 16:13:59 GMT"}],"updateDate":"2024-07-22","timestamp":1721405639000,"abstract":"  We propose and analyze an efficient and accurate numerical method for\ncomputing ground states of spin-2 Bose-Einstein condensates (BECs) by using the\nnormalized gradient flow (NGF). In order to successfully extend the NGF to\nspin-2 BECs which has five components in the vector wave function but with only\ntwo physical constraints on total mass conservation and magnetization\nconservation, two important techniques are introduced for designing the\nproposed numerical method. The first one is to systematically investigate the\nground state structure and property of spin-2 BECs within a spatially uniform\nsystem, which can be used on how to properly choose initial data in the NGF for\ncomputing ground states of spin-2 BECs. The second one is to introduce three\nadditional projection conditions based on the relations between the chemical\npotentials, together with the two existing physical constraints, such that the\nfive projection parameters used in the projection step of the NGF can be\nuniquely determined. Then a backward-forward Euler finite difference method is\nadapted to discretize the NGF. We prove rigorously that there exists a unique\nsolution of the nonlinear system for determining the five projection parameters\nin the full discretization of the NGF under a mild condition on the time step\nsize. Extensive numerical results on ground states of spin-2 BECs with\nferromagnetic/nematic/cyclic phase and harmonic/optical lattice/box potential\nin one/two dimensions are reported to show the efficiency and accuracy of the\nproposed numerical method and to demonstrate several interesting physical\nphenomena on ground states of spin-2 BECs.\n","subjects":["Mathematics/Numerical Analysis","Condensed Matter/Quantum Gases","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"Ylqv014d62ApvyG-UbPH2QPvx-9OzsaIJvjGWtosh-E","pdfSize":"3518844","objectId":"0x3b8ae274a6bccab59afb4064910269d67d2127793ae8ad0431f3199bb4a34a8c","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
