{"id":"2407.05437","title":"Enhancing Computer Programming Education with LLMs: A Study on Effective\n  Prompt Engineering for Python Code Generation","authors":"Tianyu Wang, Nianjun Zhou, Zhixiong Chen","authorsParsed":[["Wang","Tianyu",""],["Zhou","Nianjun",""],["Chen","Zhixiong",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 16:41:07 GMT"}],"updateDate":"2024-07-09","timestamp":1720370467000,"abstract":"  Large language models (LLMs) and prompt engineering hold significant\npotential for advancing computer programming education through personalized\ninstruction. This paper explores this potential by investigating three critical\nresearch questions: the systematic categorization of prompt engineering\nstrategies tailored to diverse educational needs, the empowerment of LLMs to\nsolve complex problems beyond their inherent capabilities, and the\nestablishment of a robust framework for evaluating and implementing these\nstrategies. Our methodology involves categorizing programming questions based\non educational requirements, applying various prompt engineering strategies,\nand assessing the effectiveness of LLM-generated responses. Experiments with\nGPT-4, GPT-4o, Llama3-8b, and Mixtral-8x7b models on datasets such as LeetCode\nand USACO reveal that GPT-4o consistently outperforms others, particularly with\nthe \"multi-step\" prompt strategy. The results show that tailored prompt\nstrategies significantly enhance LLM performance, with specific strategies\nrecommended for foundational learning, competition preparation, and advanced\nproblem-solving. This study underscores the crucial role of prompt engineering\nin maximizing the educational benefits of LLMs. By systematically categorizing\nand testing these strategies, we provide a comprehensive framework for both\neducators and students to optimize LLM-based learning experiences. Future\nresearch should focus on refining these strategies and addressing current LLM\nlimitations to further enhance educational outcomes in computer programming\ninstruction.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}