{"id":"2407.10311","title":"Sora and V-JEPA Have Not Learned The Complete Real World Model -- A\n  Philosophical Analysis of Video AIs Through the Theory of Productive\n  Imagination","authors":"Jianqiu Zhang","authorsParsed":[["Zhang","Jianqiu",""]],"versions":[{"version":"v1","created":"Mon, 6 May 2024 18:18:13 GMT"}],"updateDate":"2024-07-16","timestamp":1715019493000,"abstract":"  Sora from Open AI has shown exceptional performance, yet it faces scrutiny\nover whether its technological prowess equates to an authentic comprehension of\nreality. Critics contend that it lacks a foundational grasp of the world, a\ndeficiency V-JEPA from Meta aims to amend with its joint embedding approach.\nThis debate is vital for steering the future direction of Artificial General\nIntelligence(AGI). We enrich this debate by developing a theory of productive\nimagination that generates a coherent world model based on Kantian philosophy.\nWe identify three indispensable components of the coherent world model capable\nof genuine world understanding: representations of isolated objects, an a\npriori law of change across space and time, and Kantian categories. Our\nanalysis reveals that Sora is limited because of its oversight of the a priori\nlaw of change and Kantian categories, flaws that are not rectifiable through\nscaling up the training. V-JEPA learns the context-dependent aspect of the a\npriori law of change. Yet it fails to fully comprehend Kantian categories and\nincorporate experience, leading us to conclude that neither system currently\nachieves a comprehensive world understanding. Nevertheless, each system has\ndeveloped components essential to advancing an integrated AI productive\nimagination-understanding engine. Finally, we propose an innovative training\nframework for an AI productive imagination-understanding engine, centered\naround a joint embedding system designed to transform disordered perceptual\ninput into a structured, coherent world model. Our philosophical analysis\npinpoints critical challenges within contemporary video AI technologies and a\npathway toward achieving an AI system capable of genuine world understanding,\nsuch that it can be applied for reasoning and planning in the future.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}