{"id":"2407.07046","title":"CorMulT: A Semi-supervised Modality Correlation-aware Multimodal\n  Transformer for Sentiment Analysis","authors":"Yangmin Li, Ruiqi Zhu, Wengen Li","authorsParsed":[["Li","Yangmin",""],["Zhu","Ruiqi",""],["Li","Wengen",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 17:07:29 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 06:15:55 GMT"}],"updateDate":"2024-08-30","timestamp":1720544849000,"abstract":"  Multimodal sentiment analysis is an active research area that combines\nmultiple data modalities, e.g., text, image and audio, to analyze human\nemotions and benefits a variety of applications. Existing multimodal sentiment\nanalysis methods can be classified as modality interaction-based methods,\nmodality transformation-based methods and modality similarity-based methods.\nHowever, most of these methods highly rely on the strong correlations between\nmodalities, and cannot fully uncover and utilize the correlations between\nmodalities to enhance sentiment analysis. Therefore, these methods usually\nachieve bad performance for identifying the sentiment of multimodal data with\nweak correlations. To address this issue, we proposed a two-stage\nsemi-supervised model termed Correlation-aware Multimodal Transformer (CorMulT)\nwhich consists pre-training stage and prediction stage. At the pre-training\nstage, a modality correlation contrastive learning module is designed to\nefficiently learn modality correlation coefficients between different\nmodalities. At the prediction stage, the learned correlation coefficients are\nfused with modality representations to make the sentiment prediction. According\nto the experiments on the popular multimodal dataset CMU-MOSEI, CorMulT\nobviously surpasses state-of-the-art multimodal sentiment analysis methods.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}