{"id":"2407.16063","title":"Hierarchical Machine Learning Classification of Parkinsonian Disorders\n  using Saccadic Eye Movements: A Development and Validation Study","authors":"Salil B Patel, Oliver B Bredemeyer, James J FitzGerald, Chrystalina A\n  Antoniades","authorsParsed":[["Patel","Salil B",""],["Bredemeyer","Oliver B",""],["FitzGerald","James J",""],["Antoniades","Chrystalina A",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 21:41:04 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 11:24:54 GMT"}],"updateDate":"2024-07-25","timestamp":1721684464000,"abstract":"  Discriminating between Parkinson's Disease (PD) and Progressive Supranuclear\nPalsy (PSP) is difficult due to overlapping symptoms, especially early on.\nSaccades (rapid conjugate eye movements between fixation points) are affected\nby both diseases but conventional saccade analyses exhibit group level\ndifferences only. We hypothesized analyzing entire saccade raw time series\nwaveforms would permit superior individual level discrimination between PD,\nPSP, and healthy controls (HC). 13,309 saccadic eye movements from 127\nparticipants were analyzed using a novel, calibration-free waveform analysis\nand hierarchical machine learning framework. Individual saccades were\nclassified based on which trained model could reconstruct each waveform with\nminimum error, indicating the most likely condition. A hierarchical classifier\nthen predicted overall status (recently diagnosed and medication-naive 'de\nnovo' PD, 'established' PD on antiparkinsonian medication, PSP, and healthy\ncontrols) by combining each participant's saccade results. This approach\nsubstantially outperformed conventional metrics, achieving high AUROCs\ndistinguishing de novo PD from PSP (0.92-0.97), de novo PD from HC (0.72-0.89),\nand PSP from HC (0.90-0.95), while the conventional model showed limited\nperformance (AUROC range: 0.45-0.75). This calibration-free waveform analysis\nsets a new standard for precise saccadic classification of PD, PSP, and HC,\nincreasing potential for clinical adoption, remote monitoring, and screening.\n","subjects":["Quantitative Biology/Quantitative Methods","Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}