{"id":"2407.10675","title":"Imaging Coulomb interactions and migrating Dirac cones in twisted\n  graphene by local quantum oscillations","authors":"Matan Bocarsly, Indranil Roy, Vishal Bhardwaj, Matan Uzan, Patrick\n  Ledwith, Gal Shavit, Nasrin Banu, Yaozhang Zhou, Yuri Myasoedov, Kenji\n  Watanabe, Takashi Taniguchi, Yuval Oreg, Dan Parker, Yuval Ronen, and Eli\n  Zeldov","authorsParsed":[["Bocarsly","Matan",""],["Roy","Indranil",""],["Bhardwaj","Vishal",""],["Uzan","Matan",""],["Ledwith","Patrick",""],["Shavit","Gal",""],["Banu","Nasrin",""],["Zhou","Yaozhang",""],["Myasoedov","Yuri",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Oreg","Yuval",""],["Parker","Dan",""],["Ronen","Yuval",""],["Zeldov","Eli",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 12:47:22 GMT"}],"updateDate":"2024-07-16","timestamp":1721047642000,"abstract":"  Flat band moir\\'e graphene systems have emerged as a quintessential platform\nto investigate correlated phases of matter. A plethora of interaction-driven\nground states have been proposed, and yet despite extensive experimental\neffort, there has been little direct evidence that distinguishes between the\nvarious phases, in particular near charge neutrality point. Here, we use a\nnanoscale scanning superconducting quantum interference device to image the\nlocal thermodynamic quantum oscillations in alternating-twist trilayer graphene\nat magnetic fields as low as 56 mT, which reveal ultrafine details of the\ndensity of states and of the renormalization of the single-particle band\nstructure by Coulomb interactions. We find that the charging self-energy due to\noccupied electronic states, is critical in explaining the high carrier density\nphysics. At half-filling of the conduction flat band, we observe a Stoner-like\nsymmetry breaking, suggesting that it is the most robust mechanism in the\nhierarchy of phase transitions. On approaching charge neutrality, where the\ncharging energy is negligible and exchange energy is dominant, we find the\nground state to be a nematic semimetal which is favored over gapped states in\nthe presence of heterostrain. In the revealed semimetallic phase, the flat-band\nDirac cones migrate towards the mini-Brillouin zone center, spontaneously\nbreaking the C_3 rotational symmetry. Our low-field local quantum oscillations\ntechnique presents an alluring avenue to explore the ground states of diverse\nstrongly interacting van der Waals systems.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Quantum Gases","Condensed Matter/Strongly Correlated Electrons","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JnxMZvNItvwptSJ2c-mVEODIy0-h9uuTkM_-nWmG_uk","pdfSize":"13353629"}
