{"id":"2407.17132","title":"Exploring Covid-19 Spatiotemporal Dynamics: Non-Euclidean Spatially\n  Aware Functional Registration","authors":"Luke A. Barratt (1) and John A. D. Aston (1) ((1) Statistical\n  Laboratory, DPMMS, University of Cambridge, UK)","authorsParsed":[["Barratt","Luke A.",""],["Aston","John A. D.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 10:09:21 GMT"}],"updateDate":"2024-07-25","timestamp":1721815761000,"abstract":"  When it came to Covid-19, timing was everything. This paper considers the\nspatiotemporal dynamics of the Covid-19 pandemic via a developed methodology of\nnon-Euclidean spatially aware functional registration. In particular, the daily\nSARS-CoV-2 incidence in each of 380 local authorities in the UK from March to\nJune 2020 is analysed to understand the phase variation of the waves when\nconsidered as curves. This is achieved by adapting a traditional registration\nmethod (that of local variation analysis) to account for the clear spatial\ndependencies in the data. This adapted methodology is shown via simulation\nstudies to perform substantially better for the estimation of the registration\nfunctions than the non-spatial alternative. Moreover, it is found that the\ndriving time between locations represents the spatial dependency in the\nCovid-19 data better than geographical distance. However, since driving time is\nnon-Euclidean, the traditional spatial frameworks break down; to solve this, a\nmethodology inspired by multidimensional scaling is developed to approximate\nthe driving times by a Euclidean distance which enables the established theory\nto be applied. Finally, the resulting estimates of the registration/warping\nprocesses are analysed by taking functionals to understand the qualitatively\nobservable earliness/lateness and sharpness/flatness of the Covid-19 waves\nquantitatively.\n","subjects":["Statistics/Applications","Physics/Physics and Society","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Oi0tkBwxfOzNmdDADWNQBYPwlYzPsAQOh0qsGuz-QE0","pdfSize":"38922296"}
