{"id":"2407.01630","title":"A survey on the impact of AI-based recommenders on human behaviours:\n  methodologies, outcomes and future directions","authors":"Luca Pappalardo, Emanuele Ferragina, Salvatore Citraro, Giuliano\n  Cornacchia, Mirco Nanni, Giulio Rossetti, Gizem Gezici, Fosca Giannotti,\n  Margherita Lalli, Daniele Gambetta, Giovanni Mauro, Virginia Morini,\n  Valentina Pansanella, Dino Pedreschi","authorsParsed":[["Pappalardo","Luca",""],["Ferragina","Emanuele",""],["Citraro","Salvatore",""],["Cornacchia","Giuliano",""],["Nanni","Mirco",""],["Rossetti","Giulio",""],["Gezici","Gizem",""],["Giannotti","Fosca",""],["Lalli","Margherita",""],["Gambetta","Daniele",""],["Mauro","Giovanni",""],["Morini","Virginia",""],["Pansanella","Valentina",""],["Pedreschi","Dino",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 14:34:32 GMT"}],"updateDate":"2024-07-03","timestamp":1719671672000,"abstract":"  Recommendation systems and assistants (in short, recommenders) are ubiquitous\nin online platforms and influence most actions of our day-to-day lives,\nsuggesting items or providing solutions based on users' preferences or\nrequests. This survey analyses the impact of recommenders in four human-AI\necosystems: social media, online retail, urban mapping and generative AI\necosystems. Its scope is to systematise a fast-growing field in which\nterminologies employed to classify methodologies and outcomes are fragmented\nand unsystematic. We follow the customary steps of qualitative systematic\nreview, gathering 144 articles from different disciplines to develop a\nparsimonious taxonomy of: methodologies employed (empirical, simulation,\nobservational, controlled), outcomes observed (concentration, model collapse,\ndiversity, echo chamber, filter bubble, inequality, polarisation,\nradicalisation, volume), and their level of analysis (individual, item, model,\nand systemic). We systematically discuss all findings of our survey\nsubstantively and methodologically, highlighting also potential avenues for\nfuture research. This survey is addressed to scholars and practitioners\ninterested in different human-AI ecosystems, policymakers and institutional\nstakeholders who want to understand better the measurable outcomes of\nrecommenders, and tech companies who wish to obtain a systematic view of the\nimpact of their recommenders.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society","Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}