{"id":"2407.20181","title":"Blockchain for Large Language Model Security and Safety: A Holistic\n  Survey","authors":"Caleb Geren, Amanda Board, Gaby G. Dagher, Tim Andersen, Jun Zhuang","authorsParsed":[["Geren","Caleb",""],["Board","Amanda",""],["Dagher","Gaby G.",""],["Andersen","Tim",""],["Zhuang","Jun",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 15:24:01 GMT"}],"updateDate":"2024-07-30","timestamp":1722007441000,"abstract":"  With the advent of accessible interfaces for interacting with large language\nmodels, there has been an associated explosion in both their commercial and\nacademic interest. Consequently, there has also been an sudden burst of novel\nattacks associated with large language models, jeopardizing user data on a\nmassive scale. Situated at a comparable crossroads in its development, and\nequally prolific to LLMs in its rampant growth, blockchain has emerged in\nrecent years as a disruptive technology with the potential to redefine how we\napproach data handling. In particular, and due to its strong guarantees about\ndata immutability and irrefutability as well as inherent data provenance\nassurances, blockchain has attracted significant attention as a means to better\ndefend against the array of attacks affecting LLMs and further improve the\nquality of their responses. In this survey, we holistically evaluate current\nresearch on how blockchains are being used to help protect against LLM\nvulnerabilities, as well as analyze how they may further be used in novel\napplications. To better serve these ends, we introduce a taxonomy of blockchain\nfor large language models (BC4LLM) and also develop various definitions to\nprecisely capture the nature of different bodies of research in these areas.\nMoreover, throughout the paper, we present frameworks to contextualize broader\nresearch efforts, and in order to motivate the field further, we identify\nfuture research goals as well as challenges present in the blockchain for large\nlanguage model (BC4LLM) space.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Jih99ZeDqefFXgq6eDJ6iw55lDhqnw2XChl6e0-agBM","pdfSize":"873137"}
