{"id":"2407.10963","title":"Induction of non-Fermi liquids by critical cavity photons at the onset\n  of superradiance","authors":"Ipsita Mandal","authorsParsed":[["Mandal","Ipsita",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:58:03 GMT"},{"version":"v2","created":"Sun, 21 Jul 2024 09:47:25 GMT"}],"updateDate":"2024-07-23","timestamp":1721066283000,"abstract":"  We investigate the emergence of a non-Fermi liquid (NFL) at a putative\nquantum critical point signalling the onset of superradiance, in a set-up\ninvolving cavity quantum electrodynamics. Although the finiteness of the\ncavity, being bounded by reflecting mirrors, endows the cavity photons with an\neffective mass, they become massless at the continuous phase transition point.\nWe consider the matter part coming from the fermions hopping on a honeycomb\nlattice near half-filling, featuring doped Dirac cones at two sets of\ninequivalent valleys. This choice is dictated by the presence of a\nfermion-boson interaction vertex which can give rise to Landau damping of the\ncritical bosons, eventually leading to an NFL phase for the fermions. To set up\nthe quantum effective action, we identify the hot spots of the generically\nanisotropic (trigonally-warped) Fermi surfaces, which are the set of points\nhaving parallel/antiparallel tangent vectors. The cavity photons act as charge\ndensity wave (CDW) order parameters, connecting pairs of hot spots belonging to\nthe Fermi surface of a single valley. With these ingredients, we have set upon\nidentifying NFL phases, using the tools of dimensional regularization and\nrenormalization-group-flow equations. Our final results indicate that stable\nNFL phases exist in the low-energy limit, for the projections of the flows\nalong the CDW coupling constant.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Quantum Gases","Physics/High Energy Physics - Theory","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}