{"id":"2407.16320","title":"Differential cross-section measurements of Higgs boson production in the\n  $H\\to\\tau^+\\tau^-$ decay channel in $pp$ collisions at $\\sqrt{s}=13$ TeV with\n  the ATLAS detector","authors":"ATLAS Collaboration","authorsParsed":[["ATLAS Collaboration","",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 09:16:47 GMT"}],"updateDate":"2024-07-24","timestamp":1721726207000,"abstract":"  Differential measurements of Higgs boson production in the $\\tau$-lepton-pair\ndecay channel are presented in the gluon fusion, vector-boson fusion (VBF),\n$VH$ and $t\\bar{t}H$ associated production modes, with particular focus on the\nVBF production mode. The data used to perform the measurements correspond to\n140 fb$^{-1}$ of proton-proton collisions collected by the ATLAS experiment at\nthe LHC. Two methods are used to perform the measurements: the Simplified\nTemplate Cross-Section (STXS) approach and an Unfolded Fiducial Differential\nmeasurement considering only the VBF phase space. For the STXS measurement,\nevents are categorized by their production mode and kinematic properties such\nas the Higgs boson's transverse momentum ($p^{\\text{H}}_\\text{T}$), the number\nof jets produced in association with the Higgs boson, or the invariant mass of\nthe two leading jets ($m_{jj}$). For the VBF production mode, the ratio of the\nmeasured cross-section to the Standard Model prediction for $m_{jj}>1.5$ TeV\nand $p^{\\text{H}}_\\text{T}>200$ GeV ($p^{\\text{H}}_\\text{T}<200$ GeV) is\n${1.29}^{+0.39}_{-0.34}$ (${0.12}^{+0.34}_{-0.33}$). This is the first VBF\nmeasurement for the higher-$p^{\\text{H}}_\\text{T}$ criteria, and the most\nprecise for the lower-$p^{\\text{H}}_\\text{T}$ criteria. The fiducial\ncross-section measurements, which only consider the kinematic properties of the\nevent, are performed as functions of variables characterizing the VBF topology,\nsuch as the signed $\\Delta\\phi_{jj}$ between the two leading jets. The\nmeasurements have a precision of 30%-50% and agree well with the Standard Model\npredictions. These results are interpreted in the SMEFT framework, and place\nthe strongest constraints to date on the CP-odd Wilson coefficient\n$c_{H\\tilde{W}}$.\n","subjects":["Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/"}