{"id":"2407.21675","title":"Toward Spectrum Coexistence: First Demonstration of the Effectiveness of\n  Boresight Avoidance between the NRAO Green Bank Telescope and Starlink\n  Satellites","authors":"Bang D. Nhan, Christopher G. De Pree, Matt Iverson, Brenne Gregory,\n  Daniel Dueri, Anthony Beasley, and Brian Schepis","authorsParsed":[["Nhan","Bang D.",""],["De Pree","Christopher G.",""],["Iverson","Matt",""],["Gregory","Brenne",""],["Dueri","Daniel",""],["Beasley","Anthony",""],["Schepis","Brian",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:14:36 GMT"}],"updateDate":"2024-08-01","timestamp":1722438876000,"abstract":"  NRAO and SpaceX have been engaged in coordinated testing efforts since Fall\n2021, including conducting experiments on different interference avoidance\nschemes for the Karl G. Jansky Very Large Array (VLA) in New Mexico, and the\nGreen Bank Telescope (GBT) inside the National Radio Quiet Zone (NRQZ) in West\nVirginia. The Starlink system is capable of avoiding direct illumination of\ntelescope sites with their adaptive tasking to place downlink beams far away.\nNevertheless, even satellites operating in this mode can potentially present\nstrong signals into the telescope's receiver system if they pass close to the\ntelescope's main beam at the boresight. For additional protection, Starlink\nsatellites can either momentarily redirect or completely disable their downlink\nchannels while they pass within some minimum angular separation threshold from\nthe telescope's boresight, methods that are referred to as \"telescope boresight\navoidance\". In two separate experiments conducted since Fall 2023, NRAO and\nSpaceX arranged to have the GBT observe a fixed RA/Dec position in the sky,\nchosen to have a large number of close-to-boresight Starlink passages.\nPreliminary analysis from these two experiments illustrate the feasibility of\nthese avoidance methods to significantly reduce, if not eliminate, the negative\nimpact of close-to-boresight satellite passages. Importantly, these experiments\ndemonstrate the value of continuing cooperative efforts between NRAO and\nSpaceX, and expanding cooperation between the radio astronomy and satellite\ncommunities more generally.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"5PgiQNXCC2JWx6IvTE0jH8S5Kgu4gJfqCpl2uQp6tJg","pdfSize":"6424235"}
