{"id":"2407.18894","title":"Uncovering the Timescales of Spin Reorientation in $TbMn_{6}Sn_{6}$","authors":"Sin\\'ead A. Ryan, Anya Grafov, Na Li, Hans T. Nembach, Justin M. Shaw,\n  Hari Bhandari, Tika Kafle, Richa Sapkota, Henry C. Kapteyn, Nirmal J.\n  Ghimire, Margaret M. Murnane","authorsParsed":[["Ryan","Sinéad A.",""],["Grafov","Anya",""],["Li","Na",""],["Nembach","Hans T.",""],["Shaw","Justin M.",""],["Bhandari","Hari",""],["Kafle","Tika",""],["Sapkota","Richa",""],["Kapteyn","Henry C.",""],["Ghimire","Nirmal J.",""],["Murnane","Margaret M.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:43:31 GMT"}],"updateDate":"2024-07-29","timestamp":1722015811000,"abstract":"  $TbMn_{6}Sn_{6}$ is a ferrimagnetic material which exhibits a highly unusual\nphase transition near room temperature where spins remain collinear while the\ntotal magnetic moment rotates from out-of-plane to in-plane. The mechanisms\nunderlying this phenomenon have been studied in the quasi-static limit and the\nreorientation has been attributed to the competing anisotropies of Tb and Mn,\nwhose magnetic moments have very different temperature dependencies. In this\nwork, we present the first measurement of the spin-reorientation transition in\n$TbMn_{6}Sn_{6}$. By probing very small signals with the transverse\nmagneto-optical Kerr effect (TMOKE) at the Mn M-edge, we show that the\nre-orientation timescale spans from 12 ps to 24 ps, depending on the laser\nexcitation fluence. We then verify these data with a simple model of spin\nprecession with a temperature-dependent magnetocrystalline anisotropy field to\nshow that the spin reorientation timescale is consistent with the reorientation\nbeing driven by very large anisotropies energies on approximately $\\approx$ meV\nscales. Promisingly, the model predicts a possibility of 180o reorientation of\nthe out-of-plane moment over a range of excitation fluences. This could\nfacilitate optically controlled magnetization switching between very stable\nground states, which could have useful applications in spintronics or data\nstorage.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}