{"id":"2407.03548","title":"HiDiff: Hybrid Diffusion Framework for Medical Image Segmentation","authors":"Tao Chen and Chenhui Wang and Zhihao Chen and Yiming Lei and Hongming\n  Shan","authorsParsed":[["Chen","Tao",""],["Wang","Chenhui",""],["Chen","Zhihao",""],["Lei","Yiming",""],["Shan","Hongming",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 23:59:09 GMT"}],"updateDate":"2024-07-08","timestamp":1720051149000,"abstract":"  Medical image segmentation has been significantly advanced with the rapid\ndevelopment of deep learning (DL) techniques. Existing DL-based segmentation\nmodels are typically discriminative; i.e., they aim to learn a mapping from the\ninput image to segmentation masks. However, these discriminative methods\nneglect the underlying data distribution and intrinsic class characteristics,\nsuffering from unstable feature space. In this work, we propose to complement\ndiscriminative segmentation methods with the knowledge of underlying data\ndistribution from generative models. To that end, we propose a novel hybrid\ndiffusion framework for medical image segmentation, termed HiDiff, which can\nsynergize the strengths of existing discriminative segmentation models and new\ngenerative diffusion models. HiDiff comprises two key components:\ndiscriminative segmentor and diffusion refiner. First, we utilize any\nconventional trained segmentation models as discriminative segmentor, which can\nprovide a segmentation mask prior for diffusion refiner. Second, we propose a\nnovel binary Bernoulli diffusion model (BBDM) as the diffusion refiner, which\ncan effectively, efficiently, and interactively refine the segmentation mask by\nmodeling the underlying data distribution. Third, we train the segmentor and\nBBDM in an alternate-collaborative manner to mutually boost each other.\nExtensive experimental results on abdomen organ, brain tumor, polyps, and\nretinal vessels segmentation datasets, covering four widely-used modalities,\ndemonstrate the superior performance of HiDiff over existing medical\nsegmentation algorithms, including the state-of-the-art transformer- and\ndiffusion-based ones. In addition, HiDiff excels at segmenting small objects\nand generalizing to new datasets. Source codes are made available at\nhttps://github.com/takimailto/HiDiff.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}