{"id":"2407.08467","title":"Exotic edge states of C3 high-fold fermions in honeycomb lattices","authors":"L. Madail, R. G. Dias, J. Fern\\'andez-Rossier","authorsParsed":[["Madail","L.",""],["Dias","R. G.",""],["Fernández-Rossier","J.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 13:02:06 GMT"}],"updateDate":"2024-07-12","timestamp":1720702926000,"abstract":"  A generalization of the graphene honeycomb model to the case where each site\nin the honeycomb lattice contains a $n-$fold degenerate set of eigenstates of\nthe $C_3$ symmetry has been recently proposed to describe several systems,\nincluding triangulene crystals and photonic lattices. These generalized\nhoneycomb models are defined by $(n_a,n_b)$, the number $C_3$ eigenstates in\nthe $a$ and $b$ sites of the unit cell, resulting in $n_a+n_b$ bands. Thus, the\n$(1,1)$ case gives the coventional honeycomb model that describes the two\nlow-energy bands in graphene. Generalizations, such as $(2,1)$, $(2,2)$ and\n$(3,3)$ display several non-trivial features, such as coexisting graphene-like\nDirac cones with flat-bands, both at zero and finite-energy, as well as robust\ndegeneracy points where a flat-band and a parabolic band meet at the\n$\\Gamma$-point. Here, we explore the edge states of this class of crystals,\nusing as reference triangulene crystals, and we find several types of edge\nstates absent in the conventional $(1,1)$ honeycomb case, associated to the\nnon-trivial features of the two-dimensional (2D) bands of the high-fold case.\nFirst, we find dispersive edge states associated to the finite-energy\nflat-bands, that occur both at the armchair and zigzag termination. Second, in\nthe case of non-centrosymmetric triangulene crystals that lead to a $S=1$ Dirac\nband, we have a bonding-antibonding pair of dispersive edge states, localized\nin the same edge so that their energy splitting is reduced as their\nlocalization increases, opposite to the conventional behavior of pairs of\nstates localized in opposite edges. Third, for the $(3,3)$ case, that hosts a\ngap separating a pair of flat conduction and valence bands, we find\nnon-dispersive edge states with $E=0$ in all edge terminations.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gc2ZK0Q2ogrvbOhMAK1pW_P7aRqBtgMq1S6WyvzqXuw","pdfSize":"7540403","objectId":"0xfc0d4aa309ba33817330fc610e9b9ed73280e79beeef65a49d9ea9453f8d4462","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
