{"id":"2407.06861","title":"Window-to-Window BEV Representation Learning for Limited FoV Cross-View\n  Geo-localization","authors":"Lei Cheng, Teng Wang, Lingquan Meng and Changyin Sun","authorsParsed":[["Cheng","Lei",""],["Wang","Teng",""],["Meng","Lingquan",""],["Sun","Changyin",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 13:48:28 GMT"}],"updateDate":"2024-07-10","timestamp":1720532908000,"abstract":"  Cross-view geo-localization confronts significant challenges due to large\nperspective changes, especially when the ground-view query image has a limited\nfield of view with unknown orientation. To bridge the cross-view domain gap, we\nfor the first time explore to learn a BEV representation directly from the\nground query image. However, the unknown orientation between ground and aerial\nimages combined with the absence of camera parameters led to ambiguity between\nBEV queries and ground references. To tackle this challenge, we propose a novel\nWindow-to-Window BEV representation learning method, termed W2W-BEV, which\nadaptively matches BEV queries to ground reference at window-scale.\nSpecifically, predefined BEV embeddings and extracted ground features are\nsegmented into a fixed number of windows, and then most similar ground window\nis chosen for each BEV feature based on the context-aware window matching\nstrategy. Subsequently, the cross-attention is performed between the matched\nBEV and ground windows to learn the robust BEV representation. Additionally, we\nuse ground features along with predicted depth information to initialize the\nBEV embeddings, helping learn more powerful BEV representations. Extensive\nexperimental results on benchmark datasets demonstrate significant superiority\nof our W2W-BEV over previous state-of-the-art methods under challenging\nconditions of unknown orientation and limited FoV. Specifically, on the CVUSA\ndataset with limited Fov of 90 degree and unknown orientation, the W2W-BEV\nachieve an significant improvement from 47.24% to 64.73 %(+17.49%) in R@1\naccuracy.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}