{"id":"2407.21188","title":"Obliquity Constraints for the Extremely Eccentric Sub-Saturn Kepler-1656\n  b","authors":"Ryan A. Rubenzahl, Andrew W. Howard, Samuel Halverson, Cristobal\n  Petrovich, Isabel Angelo, Gu{\\dh}mundur Stef\\'ansson, Fei Dai, Aaron\n  Householder, Benjamin Fulton, Steven R. Gibson, Arpita Roy, Abby P. Shaum,\n  Howard Isaacson, Max Brodheim, William Deich, Grant M. Hill, Bradford Holden,\n  Daniel Huber, Russ R. Laher, Kyle Lanclos, Joel N. Payne, Erik A. Petigura,\n  Christian Schwab, Josh Walawender, Sharon X. Wang, Lauren M. Weiss, Joshua N.\n  Winn, Jason T. Wright","authorsParsed":[["Rubenzahl","Ryan A.",""],["Howard","Andrew W.",""],["Halverson","Samuel",""],["Petrovich","Cristobal",""],["Angelo","Isabel",""],["Stefánsson","Guðmundur",""],["Dai","Fei",""],["Householder","Aaron",""],["Fulton","Benjamin",""],["Gibson","Steven R.",""],["Roy","Arpita",""],["Shaum","Abby P.",""],["Isaacson","Howard",""],["Brodheim","Max",""],["Deich","William",""],["Hill","Grant M.",""],["Holden","Bradford",""],["Huber","Daniel",""],["Laher","Russ R.",""],["Lanclos","Kyle",""],["Payne","Joel N.",""],["Petigura","Erik A.",""],["Schwab","Christian",""],["Walawender","Josh",""],["Wang","Sharon X.",""],["Weiss","Lauren M.",""],["Winn","Joshua N.",""],["Wright","Jason T.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 20:53:41 GMT"}],"updateDate":"2024-08-01","timestamp":1722372821000,"abstract":"  The orbits of close-in exoplanets provide clues to their formation and\nevolutionary history. Many close-in exoplanets likely formed far out in their\nprotoplanetary disks and migrated to their current orbits, perhaps via\nhigh-eccentricity migration (HEM), a process that can also excite obliquities.\nA handful of known exoplanets are perhaps caught in the act of HEM, as they are\nobserved on highly eccentric orbits with tidal circularization timescales\nshorter than their ages. One such exoplanet is Kepler-1656 b, which is also the\nonly known non-giant exoplanet (<100 $M_\\oplus$) with an extreme eccentricity\n(e=0.84). We measured the sky-projected obliquity of Kepler-1656 b by observing\nthe Rossiter-McLaughlin effect during a transit with the Keck Planet Finder.\nOur data are consistent with an aligned orbit, but are also consistent with\nmoderate misalignment with $\\lambda < 50$ deg at 95% confidence, with the most\nlikely solution of $35^{+14.9}_{-21.6}$ deg. A low obliquity would be an\nunlikely outcome of most eccentricity-exciting scenarios, but we show that the\nproperties of the outer companion in the system are consistent with the\ncoplanar HEM mechanism. Alternatively, if the system is not relatively coplanar\n(<20 deg mutual inclination), Kepler-1656 b may be presently at a rare snapshot\nof long-lived eccentricity oscillations that do not induce migration.\nKepler-1656 b is only the fourth exoplanet with e>0.8 to have its obliquity\nconstrained; expanding this population will help establish the degree to which\norbital misalignment accompanies migration. Future work that constrains the\nmutual inclinations of outer perturbers will be key for distinguishing\nplausible mechanisms.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3GrJt5gIm9CDZ3Bt77brosvxTyNu3iU3sTAN0Fvwyec","pdfSize":"1365934"}
