{"id":"2407.12494","title":"Diffusion of fast and slow excitons with an exchange in\n  quasi-two-dimensional systems","authors":"Oluwafemi P. Adejumobi, Vladimir N. Mantsevich and Vladimir V.\n  Palyulin","authorsParsed":[["Adejumobi","Oluwafemi P.",""],["Mantsevich","Vladimir N.",""],["Palyulin","Vladimir V.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 11:21:01 GMT"}],"updateDate":"2024-07-18","timestamp":1721215261000,"abstract":"  By means of analytical calculations and numerical simulations we study the\ndiffusion properties in quasi-two-dimensional structures with two exciton\nsubsystems with an exchange between them. The experimental realisation is\npossible in systems where fast and slow exciton subsystems appear. For\nsubstantially different diffusion coefficients of the species the negative\ndiffusion can be observed, if one measures the transport properties of only a\nsingle subsystem, just as was obtained in experimental studies for\nquasi-two-dimensional semiconductor systems. The initial transition from a fast\nsubsystem to a slow one results in a delayed release of fast excitons in the\narea close to the original excitation spot. Hence, the signal from the fast\nexcitons alone includes the delayed replenishment from the transition of slow\nquasi-particles. This is seen as the narrowing of the exciton density profile\nor decrease of mean-squared displacement which is then interpreted as a\nnegative diffusion. The average diffusion coefficients for the combined\npopulation are analytically expressed through the diffusion coefficients of\nfast and slow excitons. Simple analytical expressions for effective diffusion\ncoefficients obtained in limiting cases are of interest both for theoretical\nand experimental analysis of not only the exciton transport, but also for a\nvariety of systems, where fast and slow moving subsystems are present.\n","subjects":["Condensed Matter/Statistical Mechanics","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}