{"id":"2407.11674","title":"Effect Heterogeneity with Earth Observation in Randomized Controlled\n  Trials: Exploring the Role of Data, Model, and Evaluation Metric Choice","authors":"Connor T. Jerzak and Ritwik Vashistha and Adel Daoud","authorsParsed":[["Jerzak","Connor T.",""],["Vashistha","Ritwik",""],["Daoud","Adel",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 12:51:14 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 15:23:57 GMT"}],"updateDate":"2024-07-25","timestamp":1721134274000,"abstract":"  Many social and environmental phenomena are associated with macroscopic\nchanges in the built environment, captured by satellite imagery on a global\nscale and with daily temporal resolution. While widely used for prediction,\nthese images and especially image sequences remain underutilized for causal\ninference, especially in the context of randomized controlled trials (RCTs),\nwhere causal identification is established by design. In this paper, we develop\nand compare a set of general tools for analyzing Conditional Average Treatment\nEffects (CATEs) from temporal satellite data that can be applied to any RCT\nwhere geographical identifiers are available. Through a simulation study, we\nanalyze different modeling strategies for estimating CATE in sequences of\nsatellite images. We find that image sequence representation models with more\nparameters generally yield a greater ability to detect heterogeneity. To\nexplore the role of model and data choice in practice, we apply the approaches\nto two influential RCTs -- Banerjee et al. (2015), a poverty study in Cusco,\nPeru, and Bolsen et al. (2014), a water conservation experiment in Georgia,\nUSA. We benchmark our image sequence models against image-only, tabular-only,\nand combined image-tabular data sources, summarizing practical implications for\ninvestigators in a multivariate analysis. Land cover classifications over\nsatellite images facilitate interpretation of what image features drive\nheterogeneity. We also show robustness to data and model choice of\nsatellite-based generalization of the RCT results to larger geographical areas\noutside the original. Overall, this paper shows how satellite sequence data can\nbe incorporated into the analysis of RCTs, and provides evidence about the\nimplications of data, model, and evaluation metric choice for causal analysis.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"KwQ4q1HIw7NufEnLuioX2fUitR-Cw4ARRJQkifNKRnk","pdfSize":"27695428","objectId":"0x4006caf6b03b256a3dd05e8f1059bc77eefde28665cc8f292a9b6970580f812a","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
