{"id":"2407.03215","title":"Streaming Large-Scale Electron Microscopy Data to a Supercomputing\n  Facility","authors":"Samuel S. Welborn, Chris Harris, Stephanie M. Ribet, Georgios\n  Varnavides, Colin Ophus, Bjoern Enders, Peter Ercius","authorsParsed":[["Welborn","Samuel S.",""],["Harris","Chris",""],["Ribet","Stephanie M.",""],["Varnavides","Georgios",""],["Ophus","Colin",""],["Enders","Bjoern",""],["Ercius","Peter",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 15:42:19 GMT"}],"updateDate":"2024-07-04","timestamp":1720021339000,"abstract":"  Data management is a critical component of modern experimental workflows. As\ndata generation rates increase, transferring data from acquisition servers to\nprocessing servers via conventional file-based methods is becoming increasingly\nimpractical. The 4D Camera at the National Center for Electron Microscopy\n(NCEM) generates data at a nominal rate of 480 Gbit/s (87,000 frames/s)\nproducing a 700 GB dataset in fifteen seconds. To address the challenges\nassociated with storing and processing such quantities of data, we developed a\nstreaming workflow that utilizes a high-speed network to connect the 4D\nCamera's data acquisition (DAQ) system to supercomputing nodes at the National\nEnergy Research Scientific Computing Center (NERSC), bypassing intermediate\nfile storage entirely. In this work, we demonstrate the effectiveness of our\nstreaming pipeline in a production setting through an hour-long experiment that\ngenerated over 10 TB of raw data, yielding high-quality datasets suitable for\nadvanced analyses. Additionally, we compare the efficacy of this streaming\nworkflow against the conventional file-transfer workflow by conducting a\npost-mortem analysis on historical data from experiments performed by real\nusers. Our findings show that the streaming workflow significantly improves\ndata turnaround time, enables real-time decision-making, and minimizes the\npotential for human error by eliminating manual user interactions.\n","subjects":["Physics/Instrumentation and Detectors","Condensed Matter/Materials Science","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}