{"id":"2407.07958","title":"Bayesian Detector Combination for Object Detection with Crowdsourced\n  Annotations","authors":"Zhi Qin Tan, Olga Isupova, Gustavo Carneiro, Xiatian Zhu, Yunpeng Li","authorsParsed":[["Tan","Zhi Qin",""],["Isupova","Olga",""],["Carneiro","Gustavo",""],["Zhu","Xiatian",""],["Li","Yunpeng",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 18:00:54 GMT"}],"updateDate":"2024-07-12","timestamp":1720634454000,"abstract":"  Acquiring fine-grained object detection annotations in unconstrained images\nis time-consuming, expensive, and prone to noise, especially in crowdsourcing\nscenarios. Most prior object detection methods assume accurate annotations; A\nfew recent works have studied object detection with noisy crowdsourced\nannotations, with evaluation on distinct synthetic crowdsourced datasets of\nvarying setups under artificial assumptions. To address these algorithmic\nlimitations and evaluation inconsistency, we first propose a novel Bayesian\nDetector Combination (BDC) framework to more effectively train object detectors\nwith noisy crowdsourced annotations, with the unique ability of automatically\ninferring the annotators' label qualities. Unlike previous approaches, BDC is\nmodel-agnostic, requires no prior knowledge of the annotators' skill level, and\nseamlessly integrates with existing object detection models. Due to the\nscarcity of real-world crowdsourced datasets, we introduce large synthetic\ndatasets by simulating varying crowdsourcing scenarios. This allows consistent\nevaluation of different models at scale. Extensive experiments on both real and\nsynthetic crowdsourced datasets show that BDC outperforms existing\nstate-of-the-art methods, demonstrating its superiority in leveraging\ncrowdsourced data for object detection. Our code and data are available at\nhttps://github.com/zhiqin1998/bdc.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TCDh9xQhL6WCQ3LMvLIrckFHt9Q7m01L01TQByWd1oM","pdfSize":"6499452"}
