{"id":"2407.11489","title":"A Meta-Learning Approach for Multi-Objective Reinforcement Learning in\n  Sustainable Home Environments","authors":"Junlin Lu, Patrick Mannion, Karl Mason","authorsParsed":[["Lu","Junlin",""],["Mannion","Patrick",""],["Mason","Karl",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 08:23:20 GMT"}],"updateDate":"2024-07-17","timestamp":1721118200000,"abstract":"  Effective residential appliance scheduling is crucial for sustainable living.\nWhile multi-objective reinforcement learning (MORL) has proven effective in\nbalancing user preferences in appliance scheduling, traditional MORL struggles\nwith limited data in non-stationary residential settings characterized by\nrenewable generation variations. Significant context shifts that can invalidate\npreviously learned policies. To address these challenges, we extend\nstate-of-the-art MORL algorithms with the meta-learning paradigm, enabling\nrapid, few-shot adaptation to shifting contexts. Additionally, we employ an\nauto-encoder (AE)-based unsupervised method to detect environment context\nchanges. We have also developed a residential energy environment to evaluate\nour method using real-world data from London residential settings. This study\nnot only assesses the application of MORL in residential appliance scheduling\nbut also underscores the effectiveness of meta-learning in energy management.\nOur top-performing method significantly surpasses the best baseline, while the\ntrained model saves 3.28% on electricity bills, a 2.74% increase in user\ncomfort, and a 5.9% improvement in expected utility. Additionally, it reduces\nthe sparsity of solutions by 62.44%. Remarkably, these gains were accomplished\nusing 96.71% less training data and 61.1% fewer training steps.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"kY1bcs-jxQf-CNu3_mHSf-QVTy6cnxfCzxgTbi8Tlmw","pdfSize":"867697"}
