{"id":"2407.19183","title":"Graph Memory Learning: Imitating Lifelong Remembering and Forgetting of\n  Brain Networks","authors":"Jiaxing Miao, Liang Hu, Qi Zhang, and Longbing Cao","authorsParsed":[["Miao","Jiaxing",""],["Hu","Liang",""],["Zhang","Qi",""],["Cao","Longbing",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 05:50:54 GMT"}],"updateDate":"2024-07-30","timestamp":1722059454000,"abstract":"  Graph data in real-world scenarios undergo rapid and frequent changes, making\nit challenging for existing graph models to effectively handle the continuous\ninflux of new data and accommodate data withdrawal requests. The approach to\nfrequently retraining graph models is resource intensive and impractical. To\naddress this pressing challenge, this paper introduces a new concept of graph\nmemory learning. Its core idea is to enable a graph model to selectively\nremember new knowledge but forget old knowledge. Building on this approach, the\npaper presents a novel graph memory learning framework - Brain-inspired Graph\nMemory Learning (BGML), inspired by brain network dynamics and\nfunction-structure coupling strategies. BGML incorporates a multi-granular\nhierarchical progressive learning mechanism rooted in feature graph grain\nlearning to mitigate potential conflict between memorization and forgetting in\ngraph memory learning. This mechanism allows for a comprehensive and\nmulti-level perception of local details within evolving graphs. In addition, to\ntackle the issue of unreliable structures in newly added incremental\ninformation, the paper introduces an information self-assessment ownership\nmechanism. This mechanism not only facilitates the propagation of incremental\ninformation within the model but also effectively preserves the integrity of\npast experiences. We design five types of graph memory learning tasks: regular,\nmemory, unlearning, data-incremental, and class-incremental to evaluate BGML.\nIts excellent performance is confirmed through extensive experiments on\nmultiple real-world node classification datasets.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}