{"id":"2407.00651","title":"A new technique to measure gravitational mass of ultra-cold matter and\n  its implications for antimatter studies","authors":"Boaz Raz, Gavriel Fleurov, Roi Holtzman, Nir Davidson and Eli Sarid","authorsParsed":[["Raz","Boaz",""],["Fleurov","Gavriel",""],["Holtzman","Roi",""],["Davidson","Nir",""],["Sarid","Eli",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 10:40:17 GMT"}],"updateDate":"2024-07-02","timestamp":1719744017000,"abstract":"  Measuring the effect of gravity on antimatter is a longstanding problem in\nphysics that has significant implications for our understanding of the\nfundamental nature of the universe. Here, we present a technique to measure the\ngravitational mass of atoms, motivated by a recent measurement of antimatter\natoms in CERN [1]. We demonstrate the results on ultra-cold atoms by measuring\nthe surviving fraction of atoms gradually released from a quadrupole magnetic\ntrap, which is tilted due to gravitational potential. We compare our\nmeasurements with a Monte Carlo simulation to extract the value of the\ngravitational constant. The difference between the literature value for g, the\nlocal acceleration due to gravity, and the measured value is $(-1.9 \\pm\n12^{stat} \\pm 5^{syst}) \\times 10^{- 4} g$. We demonstrate the importance of\nvarious design parameters in the experiment setup, and estimate their\ncontribution to the achievable accuracy in future experiments. Our method\ndemonstrates simplicity, precision, and reliability, paving the way for future\nprecision studies of the gravitational force on antimatter. It also enables a\nprecise calibration of atom traps based on the known gravitational attraction\nof normal matter to Earth.\n","subjects":["Physics/Atomic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JMlK4mF0fWxb-m417h73tOd2kyrina5fHxEUwBNhBdo","pdfSize":"2327060","objectId":"0xe852a322fb9a88f32e0bda4885e6c6723a0d65885850c526790cabd091699b86","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
