{"id":"2407.00587","title":"Development of Rotating Target with Ferrofluid Seal for ILC\n  Electron-Driven Positron Source","authors":"Tsunehiko Omori, Kaoru Yokoya, Junji Urakawa, Tohru Takahashi, Masao\n  Kuriki, Masakazu Washio, Masaru Kuribayashi, Masaaki Yamakata, Chie Nakaishi","authorsParsed":[["Omori","Tsunehiko",""],["Yokoya","Kaoru",""],["Urakawa","Junji",""],["Takahashi","Tohru",""],["Kuriki","Masao",""],["Washio","Masakazu",""],["Kuribayashi","Masaru",""],["Yamakata","Masaaki",""],["Nakaishi","Chie",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 04:33:19 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 11:36:03 GMT"},{"version":"v3","created":"Wed, 24 Jul 2024 05:22:49 GMT"}],"updateDate":"2024-07-25","timestamp":1719721999000,"abstract":"  In the ILC electron-driven positron source, acceleration tubes are located\nimmediately downstream of the positron generation target to capture the\ngenerated positrons, necessitating high vacuum for their operation. We designed\na rotating target using a ferrofluid rotating vacuum seal that can stably\nmaintain a vacuum of $10^{-6}$ Pa and a tangential velocity of 5 m/sec, which\nmeets the requirements of the ILC positron source. We fabricated a full-scale\nprototype and confirmed the compatibility of rotation and stable vacuum\nmaintenance. Various tests on the radiation resistance of the ferrofluid\ndemonstrated its ability to withstand six years of radiation exposure in normal\nILC operation without degradation and to continue exhibiting vacuum sealing\nperformance. Radiation exposure tests on a small-scale target with a structure\nand material similar to the full-scale target confirmed its operability after\ntwo years of radiation exposure in normal ILC operation. The design, including\nthermal load, stress analysis, and cooling, led to the conclusion of an\nestimated lifespan of the target of over one year, based on comparison with the\nSLC target. These results demonstrate and establish the technology of positron\ngeneration targets in the ILC electron-driven positron source.\n","subjects":["Physics/Accelerator Physics","Physics/Instrumentation and Detectors"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}