{"id":"2407.13323","title":"Optimizing VGOS observations using an SNR-based scheduling approach","authors":"Matthias Schartner, Bill Petrachenko, Mike Titus, Hana Kr\\'asn\\'a,\n  John Barrett, Dan Hoak, Dhiman Mondal, Minghui Xu, Benedikt Soja","authorsParsed":[["Schartner","Matthias",""],["Petrachenko","Bill",""],["Titus","Mike",""],["Krásná","Hana",""],["Barrett","John",""],["Hoak","Dan",""],["Mondal","Dhiman",""],["Xu","Minghui",""],["Soja","Benedikt",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 09:22:52 GMT"}],"updateDate":"2024-07-19","timestamp":1721294572000,"abstract":"  The geodetic and astrometric VLBI community is in the process of upgrading\nits existing infrastructure with VGOS. The primary objective of VGOS is to\nsubstantially boost the number of scans per hour for enhanced parameter\nestimation. However, the current observing strategy results in fewer scans than\nanticipated. During 2022, six 24-hour VGOS R&D sessions were conducted to\ndemonstrate a proof-of-concept aimed at addressing this shortcoming. The new\nobservation strategy centers around a signal-to-noise (SNR)-based scheduling\napproach combined with eliminating existing overhead times in existing VGOS\nsessions. Two SNR-based scheduling approaches were tested during these\nsessions: one utilizing inter-/extrapolation of existing S/X source flux\ndensity models and another based on a newly derived source flux density catalog\nat VGOS frequencies. Both approaches proved effective, leading to a 2.3-fold\nincrease in the number of scheduled scans per station and a 2.6-fold increase\nin the number of observations per station, while maintaining a high observation\nsuccess rate of approximately 90-95%. Consequently, both strategies succeeded\nin the main objective of these sessions by successfully increasing the number\nof scans per hour. The strategies described in this work can be easily applied\nto operational VGOS observations. Besides outlining and discussing the\nobservation strategy, we further provide insight into the resulting\nsignal-to-noise ratios, and discuss the impact on the precision of the\nestimated geodetic parameters. Monte Carlo simulations predicted a roughly 50%\nincrease in geodetic precision compared to operational VGOS sessions. The\nanalysis confirmed that the formal errors in estimated station coordinates were\nreduced by 40-50%. Additionally, Earth orientation parameters showed\nsignificant improvement, with a 40-50% reduction in formal errors.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}