{"id":"2407.18746","title":"Mitigating Losses of Superconducting Qubits Strongly Coupled to Defect\n  Modes","authors":"Dante Colao Zanuz, Quentin Ficheux, Laurent Michaud, Alexei Orekhov,\n  Kilian Hanke, Alexander Flasby, Mohsen Bahrami Panah, Graham J. Norris,\n  Michael Kerschbaum, Ants Remm, Fran\\c{c}ois Swiadek, Christoph Hellings,\n  Stefania Laz\\u{a}r, Colin Scarato, Nathan Lacroix, Sebastian Krinner,\n  Christopher Eichler, Andreas Wallraff and Jean-Claude Besse","authorsParsed":[["Zanuz","Dante Colao",""],["Ficheux","Quentin",""],["Michaud","Laurent",""],["Orekhov","Alexei",""],["Hanke","Kilian",""],["Flasby","Alexander",""],["Panah","Mohsen Bahrami",""],["Norris","Graham J.",""],["Kerschbaum","Michael",""],["Remm","Ants",""],["Swiadek","François",""],["Hellings","Christoph",""],["Lazăr","Stefania",""],["Scarato","Colin",""],["Lacroix","Nathan",""],["Krinner","Sebastian",""],["Eichler","Christopher",""],["Wallraff","Andreas",""],["Besse","Jean-Claude",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 14:02:57 GMT"}],"updateDate":"2024-07-29","timestamp":1722002577000,"abstract":"  The dominant contribution to the energy relaxation of state-of-the-art\nsuperconducting qubits is often attributed to their coupling to an ensemble of\nmaterial defects which behave as two-level systems. These defects have varying\nmicroscopic characteristics which result in a large range of observable defect\nproperties such as resonant frequencies, coherence times and coupling rates to\nqubits $g$. Here, we investigate strategies to mitigate losses to the family of\ndefects that strongly couple to qubits ($g/2\\pi\\ge$ 0.5 MHz). Such strongly\ncoupled defects are particularly detrimental to the coherence of qubits and to\nthe fidelities of operations relying on frequency excursions, such as\nflux-activated two-qubit gates. To assess their impact, we perform swap\nspectroscopy on 92 frequency-tunable qubits and quantify the spectral density\nof these strongly coupled modes. We show that the frequency configuration of\nthe defects is rearranged by warming up the sample to room temperature, whereas\nthe total number of defects on a processor tends to remain constant. We then\nexplore methods for fabricating qubits with a reduced number of strongly\ncoupled defect modes by systematically measuring their spectral density for\ndecreasing Josephson junction dimensions and for various surface cleaning\nmethods. Our results provide insights into the properties of strongly coupled\ndefect modes and show the benefits of minimizing Josephson junction dimensions\nto improve qubit properties.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}