{"id":"2407.17072","title":"An Efficient Procedure for Computing Bayesian Network Structure Learning","authors":"Hongming Huang and Joe Suzuki","authorsParsed":[["Huang","Hongming",""],["Suzuki","Joe",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 07:59:18 GMT"}],"updateDate":"2024-07-25","timestamp":1721807958000,"abstract":"  We propose a globally optimal Bayesian network structure discovery algorithm\nbased on a progressively leveled scoring approach. Bayesian network structure\ndiscovery is a fundamental yet NP-hard problem in the field of probabilistic\ngraphical models, and as the number of variables increases, memory usage grows\nexponentially. The simple and effective method proposed by Silander and\nMyllym\\\"aki has been widely applied in this field, as it incrementally\ncalculates local scores to achieve global optimality. However, existing methods\nthat utilize disk storage, while capable of handling networks with a larger\nnumber of variables, introduce issues such as latency, fragmentation, and\nadditional overhead associated with disk I/O operations. To avoid these\nproblems, we explore how to further enhance computational efficiency and reduce\npeak memory usage using only memory. We introduce an efficient hierarchical\ncomputation method that requires only a single traversal of all local\nstructures, retaining only the data and information necessary for the current\ncomputation, thereby improving efficiency and significantly reducing memory\nrequirements. Experimental results indicate that our method, when using only\nmemory, not only reduces peak memory usage but also improves computational\nefficiency compared to existing methods, demonstrating good scalability for\nhandling larger networks and exhibiting stable experimental results.\nUltimately, we successfully achieved the processing of a Bayesian network with\n28 variables using only memory.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}