{"id":"2407.17501","title":"PatchEX: High-Quality Real-Time Temporal Supersampling through\n  Patch-based Parallel Extrapolation","authors":"Akanksha Dixit and Smruti R. Sarangi","authorsParsed":[["Dixit","Akanksha",""],["Sarangi","Smruti R.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 13:59:05 GMT"}],"updateDate":"2024-07-26","timestamp":1720187945000,"abstract":"  High-refresh rate displays have become very popular in recent years due to\nthe need for superior visual quality in gaming, professional displays and\nspecialized applications like medical imaging. However, high-refresh rate\ndisplays alone do not guarantee a superior visual experience; the GPU needs to\nrender frames at a matching rate. Otherwise, we observe disconcerting visual\nartifacts such as screen tearing and stuttering. Temporal supersampling is an\neffective technique to increase frame rates by predicting new frames from other\nrendered frames. There are two methods in this space: interpolation and\nextrapolation. Interpolation-based methods provide good image quality at the\ncost of a higher latency because they also require the next rendered frame. On\nthe other hand, extrapolation methods are much faster at the cost of quality.\nThis paper introduces PatchEX, a novel frame extrapolation method that aims to\nprovide the quality of interpolation at the speed of extrapolation. It smartly\npartitions the extrapolation task into sub-tasks and executes them in parallel\nto improve both quality and latency. It then uses a patch-based inpainting\nmethod and a custom shadow prediction approach to fuse the generated\nsub-frames. This approach significantly reduces the overall latency while\nmaintaining the quality of the output. Our results demonstrate that PatchEX\nachieves a 65.29% and 48.46% improvement in PSNR over the latest extrapolation\nmethods ExtraNet and ExtraSS, respectively, while being 6x and 2x faster,\nrespectively.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}