{"id":"2407.17841","title":"Two-Timescale Design for Movable Antenna Array-Enabled Multiuser Uplink\n  Communications","authors":"Guojie Hu, Qingqing Wu, Donghui Xu, Kui Xu, Jiangbo Si, Yunlong Cai,\n  Naofal Al-Dhahir","authorsParsed":[["Hu","Guojie",""],["Wu","Qingqing",""],["Xu","Donghui",""],["Xu","Kui",""],["Si","Jiangbo",""],["Cai","Yunlong",""],["Al-Dhahir","Naofal",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 07:55:38 GMT"}],"updateDate":"2024-07-26","timestamp":1721894138000,"abstract":"  Movable antenna (MA) technology can flexibly reconfigure wireless channels by\nadjusting antenna positions in a local region, thus owing great potential for\nenhancing communication performance. This letter investigates MA technology\nenabled multiuser uplink communications over general Rician fading channels,\nwhich consist of a base station (BS) equipped with the MA array and multiple\nsingle-antenna users. Since it is practically challenging to collect all\ninstantaneous channel state information (CSI) by traversing all possible\nantenna positions at the BS, we instead propose a two-timescale scheme for\nmaximizing the ergodic sum rate. Specifically, antenna positions at the BS are\nfirst optimized using only the statistical CSI. Subsequently, the receiving\nbeamforming at the BS (for which we consider the three typical zero-forcing\n(ZF), minimum mean-square error (MMSE) and MMSE with successive interference\ncancellation (MMSE-SIC) receivers) is designed based on the instantaneous CSI\nwith optimized antenna positions, thus significantly reducing practical\nimplementation complexities. The formulated problems are highly non-convex and\nwe develop projected gradient ascent (PGA) algorithms to effectively handle\nthem. Simulation results illustrate that compared to conventional\nfixed-position antenna (FPA) array, the MA array can achieve significant\nperformance gains by reaping an additional spatial degree of freedom.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}