{"id":"2407.14439","title":"Token-level Correlation-guided Compression for Efficient Multimodal\n  Document Understanding","authors":"Renshan Zhang, Yibo Lyu, Rui Shao, Gongwei Chen, Weili Guan, Liqiang\n  Nie","authorsParsed":[["Zhang","Renshan",""],["Lyu","Yibo",""],["Shao","Rui",""],["Chen","Gongwei",""],["Guan","Weili",""],["Nie","Liqiang",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 16:11:15 GMT"}],"updateDate":"2024-07-22","timestamp":1721405475000,"abstract":"  Cropping high-resolution document images into multiple sub-images is the most\nwidely used approach for current Multimodal Large Language Models (MLLMs) to do\ndocument understanding. Most of current document understanding methods preserve\nall tokens within sub-images and treat them equally. This neglects their\ndifferent informativeness and leads to a significant increase in the number of\nimage tokens. To perform a more adaptive and efficient document understanding,\nwe propose Token-level Correlation-guided Compression, a parameter-free and\nplug-and-play methodology to optimize token processing. Firstly, we propose an\ninnovative approach for assessing the pattern repetitiveness based on the\ncorrelation between each patch tokens. This method identifies redundant tokens,\nallowing for the determination of the sub-image's information density.\nSecondly, we present a token-level sampling method that efficiently captures\nthe most informative tokens by delving into the correlation between the [CLS]\ntoken and patch tokens. By integrating these strategies, we develop a\nplug-and-play adaptive compressor module that can be seamlessly incorporated\ninto MLLMs utilizing cropping techniques. This module not only enhances the\nprocessing speed during training and inference but also maintains comparable\nperformance. We conduct experiments with the SOTA document understanding model\nmPLUG-DocOwl1.5 and the effectiveness is demonstrated through extensive\ncomparisons with other compression methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}