{"id":"2407.19913","title":"Cell Culture Assistive Application for Precipitation Image Diagnosis","authors":"Takato Yasuno","authorsParsed":[["Yasuno","Takato",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 11:42:32 GMT"}],"updateDate":"2024-07-30","timestamp":1722253352000,"abstract":"  In regenerative medicine research, we experimentally design the composition\nof chemical medium. We add different components to 384-well plates and culture\nthe biological cells. We monitor the condition of the cells and take time-lapse\nbioimages for morphological assay. In particular, precipitation can appear as\nartefacts in the image and contaminate the noise in the imaging assay.\nInspecting precipitates is a tedious task for the observer, and differences in\nexperience can lead to variations in judgement from person to person. The\nmachine learning approach will remove the burden of human inspection and\nprovide consistent inspection. In addition, precipitation features are as small\nas 10-20 {\\mu}m. A 1200 pixel square well image resized under a resolution of\n2.82 {\\mu}m/pixel will result in a reduction in precipitation features.\nDividing the well images into 240-pixel squares and learning without resizing\npreserves the resolution of the original image. In this study, we developed an\napplication to automatically detect precipitation on 384-well plates utilising\noptical microscope images. We apply MN-pair contrastive clustering to extract\nprecipitation classes from approximately 20,000 patch images. To detect\nprecipitation features, we compare deeper FCDDs detectors with optional\nbackbones and build a machine learning pipeline to detect precipitation from\nthe maximum score of quadruplet well images using isolation Forest algorithm,\nwhere the anomaly score is ranged from zero to one. Furthermore, using this\napplication we can visualise precipitation situ heatmap on a 384-well plate.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}