{"id":"2407.04775","title":"The first catalogue of candidate white dwarf-main sequence binaries in\n  open star clusters: A new window into common envelope evolution","authors":"Steffani M. Grondin, Maria R. Drout, Jason Nordhaus, Philip S.\n  Muirhead, Joshua S. Speagle, Ryan Chornock","authorsParsed":[["Grondin","Steffani M.",""],["Drout","Maria R.",""],["Nordhaus","Jason",""],["Muirhead","Philip S.",""],["Speagle","Joshua S.",""],["Chornock","Ryan",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 18:00:02 GMT"}],"updateDate":"2024-07-09","timestamp":1720202402000,"abstract":"  Close binary systems are the progenitors to both Type Ia supernovae and the\ncompact object mergers that can be detected via gravitational waves. To achieve\na binary with a small radial separation, it is believed that the system likely\nundergoes common envelope (CE) evolution. Despite its importance, CE evolution\nmay be one of the largest uncertainties in binary evolution due to a\ncombination of computational challenges and a lack of observed benchmarks where\nboth the post-CE and pre-CE conditions are known. Identifying post-CE systems\nin star clusters can partially circumvent this second issue by providing an\nindependent age constraint on the system. For the first time, we conduct a\nsystematic search for white dwarf (WD) and main-sequence (MS) binary systems in\n299 Milky Way open star clusters. Coupling Gaia DR3 photometry and kinematics\nwith multi-band photometry from Pan-STARRS1 and 2MASS, we apply a machine\nlearning based approach and find 52 high-probability candidates in 38 open\nclusters. For a subset of our systems, we present follow-up spectroscopy from\nthe Gemini and Lick Observatories and archival light curves from TESS,\nKepler/K2 and the Zwicky Transient Facility. Examples of M-dwarfs with hot\ncompanions are spectroscopically observed, along with regular system\nvariability. While the kinematics of our candidates are consistent with their\nhost clusters, some systems have spatial positions offset relative to their\nhosts, potentially indicative of natal kicks. Ultimately, this catalogue is a\nfirst step to obtaining a set of observational benchmarks to better link\npost-CE systems to their pre-CE progenitors.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}