{"id":"2407.00510","title":"Stochastic stem bucking using mixture density neural networks","authors":"Simon Schmiedel","authorsParsed":[["Schmiedel","Simon",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 18:44:49 GMT"}],"updateDate":"2024-07-02","timestamp":1719686689000,"abstract":"  Poor bucking decisions made by forest harvesters can have a negative effect\non the products that are generated from the logs. Making the right bucking\ndecisions is not an easy task because harvesters must rely on predictions of\nthe stem profile for the part of the stems that is not yet measured. The goal\nof this project is to improve the bucking decisions made by forest harvesters\nwith a stochastic bucking method. We developed a Long Short-Term Memory (LSTM)\nneural network that predicted the parameters of a Gaussian distribution\nconditioned on the known part of the stem, enabling the creation of multiple\nsamples of stem profile predictions for the unknown part of the stem. The\nbucking decisions could then be optimized using a novel stochastic bucking\nalgorithm which used all the stem profiles generated to choose the logs to\ngenerate from the stem. The stochastic bucking algorithm was compared to two\nbenchmark models: A polynomial model that could not condition its predictions\non more than one diameter measurement, and a deterministic LSTM neural network.\nAll models were evaluated on stem profiles of four coniferous species prevalent\nin eastern Canada. In general, the best bucking decisions were taken by the\nstochastic LSTM models, demonstrating the usefulness of the method. The\nsecond-best results were mostly obtained by the deterministic LSTM model and\nthe worst results by the polynomial model, corroborating the usefulness of\nconditioning the stem curve predictions on multiple measurements.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}