{"id":"2407.07295","title":"Deformation-Recovery Diffusion Model (DRDM): Instance Deformation for\n  Image Manipulation and Synthesis","authors":"Jian-Qing Zheng, Yuanhan Mo, Yang Sun, Jiahua Li, Fuping Wu, Ziyang\n  Wang, Tonia Vincent, Bart{\\l}omiej W. Papie\\.z","authorsParsed":[["Zheng","Jian-Qing",""],["Mo","Yuanhan",""],["Sun","Yang",""],["Li","Jiahua",""],["Wu","Fuping",""],["Wang","Ziyang",""],["Vincent","Tonia",""],["Papież","Bartłomiej W.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 01:26:48 GMT"},{"version":"v2","created":"Sun, 21 Jul 2024 04:48:16 GMT"}],"updateDate":"2024-07-23","timestamp":1720574808000,"abstract":"  In medical imaging, the diffusion models have shown great potential in\nsynthetic image generation tasks. However, these models often struggle with the\ninterpretable connections between the generated and existing images and could\ncreate illusions. To address these challenges, our research proposes a novel\ndiffusion-based generative model based on deformation diffusion and recovery.\nThis model, named Deformation-Recovery Diffusion Model (DRDM), diverges from\ntraditional score/intensity and latent feature-based approaches, emphasizing\nmorphological changes through deformation fields rather than direct image\nsynthesis. This is achieved by introducing a topological-preserving deformation\nfield generation method, which randomly samples and integrates a set of\nmulti-scale Deformation Vector Fields (DVF). DRDM is trained to learn to\nrecover unreasonable deformation components, thereby restoring each randomly\ndeformed image to a realistic distribution. These innovations facilitate the\ngeneration of diverse and anatomically plausible deformations, enhancing data\naugmentation and synthesis for further analysis in downstream tasks, such as\nfew-shot learning and image registration. Experimental results in cardiac MRI\nand pulmonary CT show DRDM is capable of creating diverse, large (over 10\\%\nimage size deformation scale), and high-quality (negative rate of the Jacobian\nmatrix's determinant is lower than 1\\%) deformation fields. The further\nexperimental results in downstream tasks, 2D image segmentation and 3D image\nregistration, indicate significant improvements resulting from DRDM, showcasing\nthe potential of our model to advance image manipulation and synthesis in\nmedical imaging and beyond.\n  Project page: https://jianqingzheng.github.io/def_diff_rec/\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}