{"id":"2407.07777","title":"Multipoint study of the rapid filament evolution during a confined C2\n  flare on 28 March 2022, leading to eruption","authors":"Stefan Purkhart, Astrid M. Veronig, Bernhard Kliem, Robert Jarolim,\n  Karin Dissauer, Ewan C. M. Dickson, Tatiana Podladchikova, S\\\"am Krucker","authorsParsed":[["Purkhart","Stefan",""],["Veronig","Astrid M.",""],["Kliem","Bernhard",""],["Jarolim","Robert",""],["Dissauer","Karin",""],["Dickson","Ewan C. M.",""],["Podladchikova","Tatiana",""],["Krucker","Säm",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 15:51:26 GMT"}],"updateDate":"2024-07-11","timestamp":1720626686000,"abstract":"  We studied the rapid filament evolution in AR 12975 during a confined C2\nflare on 28 March 2022, which led to an eruptive M4 flare 1.5 h later. It is\ncharacterized by the breakup of the filament, the disappearance of its southern\nhalf, and the flow of the remaining plasma into a longer channel with a\ntopology similar to an EUV hot channel during the flare. Our multipoint study\ntakes advantage of Solar Orbiter's position at 0.33 AU and 83. 5{\\deg} west of\nthe Sun-Earth line. STIX and EUI onboard Solar Orbiter observed the event at\nthe limb. AIA and HMI onboard SDO provided on-disk observations from which we\nderived DEM maps and NLFF magnetic field extrapolations. We find that both\nfilament channels likely existed in close proximity before the flare. Based on\nfield structures associated with AIA 1600 {\\AA} flare ribbons and kernels, we\npropose a loop-loop reconnection scenario between field lines that surround and\npass beneath the shorter filament channel, and field lines following a portion\nof the longer channel. Reconnection occurs in an essentially vertical current\nsheet at a PIL below the breakup region, leading to the formation of the flare\nloop arcade and the EUV hot channel. The scenario is supported by concentrated\ncurrents and free magnetic energy built up by antiparallel flows along the PIL\nbefore the flare. The reconnection probably propagated to involve the original\nfilament itself, leading to its breakup and reformation. The reconnection\ngeometry provides a general mechanism for the formation of the long filament\nchannel and realizes the concept of tether cutting, which was active throughout\nthe filament's rise phase, lasting from at least 30 min before the C2 flare\nuntil the eruption. The C2 flare represents a period of fast reconnection\nduring this otherwise more steady process, during which most of the original\nfilament was reconnected and joined the longer channel.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}