{"id":"2407.02479","title":"Mixing effects on spectroscopy and partonic observables of mesons with\n  logarithmic confining potential in a light-front quark model","authors":"Bhoomika Pandya, Bheemsehan Gurjar, Dipankar Chakrabarti, Ho-Meoyng\n  Choi and Chueng-Ryong Ji","authorsParsed":[["Pandya","Bhoomika",""],["Gurjar","Bheemsehan",""],["Chakrabarti","Dipankar",""],["Choi","Ho-Meoyng",""],["Ji","Chueng-Ryong",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 17:56:38 GMT"}],"updateDate":"2024-07-03","timestamp":1719942998000,"abstract":"  Using the variational principle, we systematically investigate the mass\nspectra and wave functions of both $1S$ and $2S$ state heavy pseudoscalar $(P)$\nand vector $(V)$ mesons within the light-front quark model. This approach\nincorporates a Coulomb plus logarithmic confinement potential to accurately\ndescribe the constituent quark and antiquark dynamics. Additionally, spin\nhyperfine interactions are introduced perturbatively to compute the masses of\npseudoscalar and vector mesons. The present analyses of the $1S$ and $2S$\nstates require the consideration of mixing between them to account for\nempirical constraints. These constraints include the mass gap $\\Delta M_{P} >\n\\Delta M_{V}$, where $\\Delta M_{P(V)} = M^{2S}_{P(V)} - M^{1S}_{P(V)}$ and the\nhierarchy of the decay constants $f_{1S} > f_{2S}$. We find the optimal value\nof the mixing angle to be $\\theta = 18^{\\circ}$, significantly enhancing the\nconsistency between our spectroscopic predictions and the experimental data\ncompiled by the Particle Data Group (PDG). Furthermore, based on the predicted\nmass, the newly observed resonance $B_J(5840)$ could be assigned as a $2^1S_0$\nstate in the $B$ meson family. The study also reports various pertinent\nobservables, including twist-2 distribution amplitudes, electromagnetic form\nfactors, charge radii, $\\xi$ moments, and transition form factors which are\nfound to be consistent with both available lattice simulations and experimental\ndata. In addition, our predicted branching ratios for the channels of $B^+\n\\rightarrow \\tau^+ \\nu_{\\tau}$ as well as rare decays of $B^0$ and $B_s^0$\nappear in accordance with experimental data.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}