{"id":"2407.20054","title":"Visual Support for the Loop Grafting Workflow on Proteins","authors":"Filip Op\\'alen\\'y, Pavol Ulbrich, Joan Planas-Iglesias, Jan By\\v{s}ka,\n  Jan \\v{S}toura\\v{c}, David Bedn\\'a\\v{r}, Katar\\'ina Furmanov\\'a, Barbora\n  Kozl\\'ikov\\'a","authorsParsed":[["Opálený","Filip",""],["Ulbrich","Pavol",""],["Planas-Iglesias","Joan",""],["Byška","Jan",""],["Štourač","Jan",""],["Bednář","David",""],["Furmanová","Katarína",""],["Kozlíková","Barbora",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 14:40:15 GMT"}],"updateDate":"2024-07-30","timestamp":1722264015000,"abstract":"  In understanding and redesigning the function of proteins in modern\nbiochemistry, protein engineers are increasingly focusing on exploring regions\nin proteins called loops. Analyzing various characteristics of these regions\nhelps the experts design the transfer of the desired function from one protein\nto another. This process is denoted as loop grafting. We designed a set of\ninteractive visualizations that provide experts with visual support through all\nthe loop grafting pipeline steps. The workflow is divided into several phases,\nreflecting the steps of the pipeline. Each phase is supported by a specific set\nof abstracted 2D visual representations of proteins and their loops that are\ninteractively linked with the 3D View of proteins. By sequentially passing\nthrough the individual phases, the user shapes the list of loops that are\npotential candidates for loop grafting. Finally, the actual in-silico insertion\nof the loop candidates from one protein to the other is performed, and the\nresults are visually presented to the user. In this way, the fully\ncomputational rational design of proteins and their loops results in newly\ndesigned protein structures that can be further assembled and tested through\nin-vitro experiments. We showcase the contribution of our visual support design\non a real case scenario changing the enantiomer selectivity of the engineered\nenzyme. Moreover, we provide the readers with the experts' feedback.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2lBmbGWS7yMk0agerXMhkc17bdH-4jFI0kmqQ-SWi4M","pdfSize":"5255964"}
