{"id":"2407.17564","title":"An Analytic Characterization of the Limb Asymmetry -- Transit Time\n  Degeneracy","authors":"Matthew M. Murphy, Thomas G. Beatty, Daniel Apai","authorsParsed":[["Murphy","Matthew M.",""],["Beatty","Thomas G.",""],["Apai","Daniel",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 18:00:07 GMT"}],"updateDate":"2024-07-26","timestamp":1721844007000,"abstract":"  Atmospheres are not spatially homogeneous. This is particularly true for hot,\ntidally locked exoplanets with large day-to-night temperature variations, which\ncan yield significant differences between the morning and evening terminators\n-- known as limb asymmetry. Current transit observations with the James Webb\nSpace Telescope (JWST) are precise enough to disentangle the separate\ncontributions of these morning and evening limbs to the overall transmission\nspectrum in certain circumstances. However, the signature of limb asymmetry in\na transit light curve is highly degenerate with uncertainty in the planet's\ntime of conjunction. This raises the question of how precisely transit times\nmust be measured to enable accurate studies of limb asymmetry, particularly\nwith JWST. Although this degeneracy has been discussed in the literature, a\ngeneral description of it has not been presented. In this work, we show how\nthis degeneracy results from apparent changes in the transit contact times when\nthe planetary disk has asymmetric limb sizes. We derive a general formula\nrelating the magnitude of limb asymmetry to the amount which it would cause the\napparent time of conjunction to vary, which can reach tens of seconds.\nComparing our formula to simulated observations, we find that numerical fitting\ntechniques add additional bias to the measured time, of generally less than a\nsecond, resulting from the occultation geometry. We also derive an analytical\nformula for this extra numerical bias. These formulae can be applied to\nplanning new observations or interpreting literature measurements, and we show\nexamples for commonly studied exoplanets.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}