{"id":"2407.03221","title":"Modelling the BOSS void-galaxy cross-correlation function using a\n  neural-network emulator","authors":"Tristan S. Fraser, Enrique Paillas, Will J. Percival, Seshadri\n  Nadathur, Sla{\\dj}ana Radinovi\\'c, and Hans A. Winther","authorsParsed":[["Fraser","Tristan S.",""],["Paillas","Enrique",""],["Percival","Will J.",""],["Nadathur","Seshadri",""],["Radinović","Slađana",""],["Winther","Hans A.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 15:48:17 GMT"}],"updateDate":"2024-07-04","timestamp":1720021697000,"abstract":"  We introduce an emulator-based method to model the cross-correlation between\ncosmological voids and galaxies. This allows us to model the effect of\ncosmology on void finding and on the shape of the void-galaxy cross-correlation\nfunction, improving on previous template-based methods. We train a neural\nnetwork using the AbacusSummit simulation suite and fit to data from the Sloan\nDigital Sky Survey Baryon Oscillation Spectroscopic Survey sample. We recover\ninformation on the growth of structure through redshift-space distortions\n(RSD), and the geometry of the Universe through the Alcock-Paczy\\'nski (AP)\neffect, measuring $\\Omega_{\\rm m} = 0.330\\pm 0.020$ and $\\sigma_8 =\n0.777^{+0.047}_{-0.062}$ for a $\\Lambda \\rm{CDM}$ cosmology. Comparing to\nresults from a template-based method, we find that fitting the shape of the\nvoid-galaxy cross-correlation function provides more information and leads to\nan improvement in constraining power. In contrast, we find that errors on the\nAP measurements were previously underestimated if void centres were assumed to\nhave the same response to the AP effect as galaxies - a common simplification.\nOverall, we recover a $28\\%$ reduction in errors for $\\Omega_{\\rm{m}}$ and\nsimilar errors on $\\sigma_8$ with our new, more comprehensive, method. Given\nthe statistical power of future surveys including DESI and Euclid, we expect\nthe method presented to become the new baseline for the analysis of voids in\nthese data.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}