{"id":"2407.01065","title":"Improve ROI with Causal Learning and Conformal Prediction","authors":"Meng Ai, Zhuo Chen, Jibin Wang, Jing Shang, Tao Tao, Zhen Li","authorsParsed":[["Ai","Meng",""],["Chen","Zhuo",""],["Wang","Jibin",""],["Shang","Jing",""],["Tao","Tao",""],["Li","Zhen",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 08:16:25 GMT"}],"updateDate":"2024-07-02","timestamp":1719821785000,"abstract":"  In the commercial sphere, such as operations and maintenance, advertising,\nand marketing recommendations, intelligent decision-making utilizing data\nmining and neural network technologies is crucial, especially in resource\nallocation to optimize ROI. This study delves into the Cost-aware Binary\nTreatment Assignment Problem (C-BTAP) across different industries, with a focus\non the state-of-the-art Direct ROI Prediction (DRP) method. However, the DRP\nmodel confronts issues like covariate shift and insufficient training data,\nhindering its real-world effectiveness. Addressing these challenges is\nessential for ensuring dependable and robust predictions in varied operational\ncontexts.\n  This paper presents a robust Direct ROI Prediction (rDRP) method, designed to\naddress challenges in real-world deployment of neural network-based uplift\nmodels, particularly under conditions of covariate shift and insufficient\ntraining data. The rDRP method, enhancing the standard DRP model, does not\nalter the model's structure or require retraining. It utilizes conformal\nprediction and Monte Carlo dropout for interval estimation, adapting to model\nuncertainty and data distribution shifts. A heuristic calibration method,\ninspired by a Kaggle competition, combines point and interval estimates. The\neffectiveness of these approaches is validated through offline tests and online\nA/B tests in various settings, demonstrating significant improvements in target\nrewards compared to the state-of-the-art method.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}