{"id":"2407.14189","title":"Temporal Evolution of Defects and Related Electric Properties in\n  He-Irradiated YBa$_{2}$Cu$_{3}$O$_{7-\\delta}$ Thin Films","authors":"Sandra Keppert, Bernd Aichner, Philip Rohringer, Marius-Aurel Bodea,\n  Benedikt M\\\"uller, Max Karrer, Reinhold Kleiner, Edward Goldobin, Dieter\n  Koelle, Johannes D. Pedarnig, Wolfgang Lang","authorsParsed":[["Keppert","Sandra",""],["Aichner","Bernd",""],["Rohringer","Philip",""],["Bodea","Marius-Aurel",""],["Müller","Benedikt",""],["Karrer","Max",""],["Kleiner","Reinhold",""],["Goldobin","Edward",""],["Koelle","Dieter",""],["Pedarnig","Johannes D.",""],["Lang","Wolfgang",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 10:37:41 GMT"}],"updateDate":"2024-07-22","timestamp":1721385461000,"abstract":"  Thin films of the superconductor YBa$_2$Cu$_3$O$_{7-\\delta}$ (YBCO) were\nmodified by low-energy light-ion irradiation employing collimated or focused\nHe$^+$ beams, and the long-term stability of irradiation-induced defects was\ninvestigated. For films irradiated with collimated beams, the resistance was\nmeasured in situ during and after irradiation and analyzed using a\nphenomenological model. The formation and stability of irradiation-induced\ndefects are highly influenced by temperature. Thermal annealing experiments\nconducted in an Ar atmosphere at various temperatures demonstrated a decrease\nin resistivity and allowed us to determine diffusion coefficients and the\nactivation energy $\\Delta E = (0.31 \\pm 0.03)$ eV for diffusive oxygen\nrearrangement within the YBCO unit cell basal plane. Additionally, thin YBCO\nfilms, nanostructured by focused He$^+$-beam irradiation into vortex pinning\narrays, displayed significant commensurability effects in magnetic fields.\nDespite the strong modulation of defect densities in these pinning arrays,\noxygen diffusion during room-temperature annealing over almost six years did\nnot compromise the signatures of vortex matching, which remained precisely at\ntheir magnetic fields predicted by the pattern geometry. Moreover, the critical\ncurrent increased substantially within the entire magnetic field range after\nlong-term storage in dry air. These findings underscore the potential of ion\nirradiation in tailoring the superconducting properties of thin YBCO films.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}