{"id":"2407.20708","title":"Integer-Valued Training and Spike-Driven Inference Spiking Neural\n  Network for High-performance and Energy-efficient Object Detection","authors":"Xinhao Luo, Man Yao, Yuhong Chou, Bo Xu, and Guoqi Li","authorsParsed":[["Luo","Xinhao",""],["Yao","Man",""],["Chou","Yuhong",""],["Xu","Bo",""],["Li","Guoqi",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 10:04:16 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 03:35:50 GMT"},{"version":"v3","created":"Mon, 5 Aug 2024 05:53:55 GMT"}],"updateDate":"2024-08-06","timestamp":1722333856000,"abstract":"  Brain-inspired Spiking Neural Networks (SNNs) have bio-plausibility and\nlow-power advantages over Artificial Neural Networks (ANNs). Applications of\nSNNs are currently limited to simple classification tasks because of their poor\nperformance. In this work, we focus on bridging the performance gap between\nANNs and SNNs on object detection. Our design revolves around network\narchitecture and spiking neuron. First, the overly complex module design causes\nspike degradation when the YOLO series is converted to the corresponding\nspiking version. We design a SpikeYOLO architecture to solve this problem by\nsimplifying the vanilla YOLO and incorporating meta SNN blocks. Second, object\ndetection is more sensitive to quantization errors in the conversion of\nmembrane potentials into binary spikes by spiking neurons. To address this\nchallenge, we design a new spiking neuron that activates Integer values during\ntraining while maintaining spike-driven by extending virtual timesteps during\ninference. The proposed method is validated on both static and neuromorphic\nobject detection datasets. On the static COCO dataset, we obtain 66.2% mAP@50\nand 48.9% mAP@50:95, which is +15.0% and +18.7% higher than the prior\nstate-of-the-art SNN, respectively. On the neuromorphic Gen1 dataset, we\nachieve 67.2% mAP@50, which is +2.5% greater than the ANN with equivalent\narchitecture, and the energy efficiency is improved by 5.7*. Code:\nhttps://github.com/BICLab/SpikeYOLO\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"k896_8uhFOJDrQJSN9t5LZyzJHHFypq93za4wCKWskM","pdfSize":"2976867"}
