{"id":"2407.15463","title":"Integrated Access and Backhaul (IAB) in Low Altitude Platforms","authors":"Reza Ghasemi Alavicheh, S. Mohammad Razavizadeh, Halim Yanikomeroglu","authorsParsed":[["Alavicheh","Reza Ghasemi",""],["Razavizadeh","S. Mohammad",""],["Yanikomeroglu","Halim",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 08:21:30 GMT"},{"version":"v2","created":"Sun, 28 Jul 2024 16:35:46 GMT"}],"updateDate":"2024-07-30","timestamp":1721636490000,"abstract":"  In this paper, we explore the problem of utilizing Integrated Access and\nBackhaul (IAB) technology in Non-Terrestrial Networks (NTN), with a particular\nfocus on aerial access networks. We consider an Uncrewed Aerial Vehicle\n(UAV)-based wireless network comprised of two layers of UAVs: (a) a lower layer\nconsisting a number of flying users and a UAV Base Station (BS) that provides\ncoverage for terrestrial users and, (b) an upper layer designated to provide\nboth wireless access for flying users and backhaul connectivity for UAV BS. By\nadopting IAB technology, the backhaul and access links collaboratively share\ntheir resources, enabling aerial backhauling and the utilization of the same\ninfrastructure and frequency resources for access links. A sum-rate\nmaximization problem is formulated by considering aerial backhaul constraints\nto optimally allocate the frequency spectrum between aerial and terrestrial\nnetworks. We decompose the resulting non-convex optimization problem into two\nsub-problems of beamforming and spectrum allocation and then propose efficient\nsolutions for each. Numerical results in different scenarios yield insightful\nfindings about the effectiveness of using the IAB technique in aerial networks.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Cc5fITE3ap37O9DfzoNXMipfE0W3P0K6fohn-bOUftc","pdfSize":"1378202","objectId":"0xcf1a0792ccbea3ab541f15d615b0c3ae4a1a7191fa6c1b8146bb68c845da4aec","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
