{"id":"2407.21542","title":"Fisher-Rao distance between truncated distributions and robustness\n  analysis in uncertainty quantification","authors":"Baalu Belay Ketema (EDF R\\&D PRISME, IMT), Nicolas Bousquet (EDF R\\&D\n  PRISME, LPSM (UMR\\_8001), SINCLAIR AI Lab), Francesco Costantino (IMT),\n  Fabrice Gamboa (IMT), Bertrand Iooss (EDF R\\&D PRISME, IMT, SINCLAIR AI Lab),\n  Roman Sueur (EDF R\\&D PRISME)","authorsParsed":[["Ketema","Baalu Belay","","EDF R\\&D PRISME, IMT"],["Bousquet","Nicolas","","EDF R\\&D\n  PRISME, LPSM"],["Costantino","Francesco","","IMT"],["Gamboa","Fabrice","","IMT"],["Iooss","Bertrand","","EDF R\\&D PRISME, IMT, SINCLAIR AI Lab"],["Sueur","Roman","","EDF R\\&D PRISME"]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 12:02:15 GMT"}],"updateDate":"2024-08-01","timestamp":1722427335000,"abstract":"  Input variables in numerical models are often subject to several levels of\nuncertainty, usually modeled by probability distributions. In the context of\nuncertainty quantification applied to these models, studying the robustness of\noutput quantities with respect to the input distributions requires: (a)\ndefining variational classes for these distributions; (b) calculating boundary\nvalues for the output quantities of interest with respect to these variational\nclasses. The latter should be defined in a way that is consistent with the\ninformation structure defined by the ``baseline'' choice of input\ndistributions. Considering parametric families, the variational classes are\ndefined using the geodesic distance in their Riemannian manifold, a generic\napproach to such problems. Theoretical results and application tools are\nprovided to justify and facilitate the implementation of such robustness\nstudies, in concrete situations where these distributions are truncated -- a\nsetting frequently encountered in applications. The feasibility of our approach\nis illustrated in a simplified industrial case study.\n","subjects":["Mathematics/Metric Geometry","Mathematics/Optimization and Control","Mathematics/Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}