{"id":"2407.10858","title":"Engineering Efficient Light Sources for Silicon Photonics: III-V\n  Nano-heterostructures Monolithically Grown on Silicon","authors":"Alisha Nanwani, Pawe{\\l} Wyborski, Michael S. Seifner, Shima\n  Kadkhodazadeh, Grzegorz S\\k{e}k, Pawe{\\l} Holewa, Kresten Yvind, Elizaveta\n  Semenova","authorsParsed":[["Nanwani","Alisha",""],["Wyborski","Paweł",""],["Seifner","Michael S.",""],["Kadkhodazadeh","Shima",""],["Sęk","Grzegorz",""],["Holewa","Paweł",""],["Yvind","Kresten",""],["Semenova","Elizaveta",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 16:08:40 GMT"}],"updateDate":"2024-07-16","timestamp":1721059720000,"abstract":"  The demand for advanced photonics technology is increasing rapidly, fueled by\nthe necessity for high-performance and cost-effective optical information\nprocessing systems extending into the quantum domain. Silicon, benefiting from\nits mature fabrication processes, stands as an ideal platform. However, its\ninherent indirect bandgap leads to inefficient light emission. To overcome this\ndrawback, the integration of III-V materials has proven essential. These\nmaterials are recognized for their efficient light emission and superior\nbandgap engineering capabilities, making them indispensable in photonics and\nbeyond. Here, we present the monolithic integration of small-volume III-V\nnano-heterostructures with silicon via selective area epitaxy in the pyramidal\nopenings etched in (100)-oriented silicon substrate. The precise positioning of\nthe nano-heterostructures is achieved using electron beam lithography. Our\natomic resolution imaging and chemical analysis confirm the epitaxial nature of\nInP growth, revealing well-defined heterointerfaces. Each structure\nincorporates an InAsP quantum dot-like active medium. Optical characterization\nand eight-band kp calculations demonstrate energy level quantization in three\nspatial dimensions. The heterostructures can be engineered to cover the entire\ntelecom wavelength range. Consequently, these InAsP/InP nano-heterostructures\ncould serve as a gain medium for silicon-based hybrid nano-lases and nanoLED as\nwell as quantum light sources in the telecom wavelength range.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}