{"id":"2407.03935","title":"Expected insights on type Ia supernovae from LISA's gravitational wave\n  observations","authors":"Valeriya Korol, Riccardo Buscicchio, Ruediger Pakmor, Javier\n  Mor\\'an-Fraile, Christopher J. Moore, and Selma E. de Mink","authorsParsed":[["Korol","Valeriya",""],["Buscicchio","Riccardo",""],["Pakmor","Ruediger",""],["Morán-Fraile","Javier",""],["Moore","Christopher J.",""],["de Mink","Selma E.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 13:51:57 GMT"}],"updateDate":"2024-07-08","timestamp":1720101117000,"abstract":"  The nature of progenitors of type Ia supernovae have long been debated,\nprimarily due to the elusiveness of the progenitor systems to traditional\nelectromagnetic observation methods. We argue that gravitational wave\nobservations with the upcoming Laser Interferometer Space Antenna (LISA) offer\nthe most promising way to test one of the leading progenitor scenarios - the\ndouble-degenerate scenario, which involves a binary system of two white dwarf\nstars. In this study, we review published results, supplementing them with\nadditional calculations for the context of type Ia supernovae. We discuss that\nLISA will be able to provide a complete sample of double white dwarf type Ia\nsupernova progenitors with orbital period less than 16-11 minutes\n(gravitational wave frequencies above 2-3 milli-Hertz). Such a sample will\nenable a statistical validation of the double-degenerate scenario by simply\ncounting whether LISA detects enough double white dwarf binaries to account the\nmeasured type Ia merger rate in Milky Way-like galaxies. Additionally, we\nillustrate how LISA's capability to measure the chirp mass will set lower\nbounds on the primary mass, revealing whether detected double white dwarf\nbinaries will eventually result in a type Ia supernova. We estimate that the\nexpected LISA constraints on the type Ia merger rate for the Milky Way will be\n4-9%. We also discuss the potential gravitational wave signal from a type Ia\nsupernova assuming a double detonation mechanism and explore how\nmulti-messenger observations could significantly advance our understanding of\nthese transient phenomena.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}