{"id":"2407.09530","title":"Optimization of Autonomous Driving Image Detection Based on RFAConv and\n  Triplet Attention","authors":"Zhipeng Ling, Qi Xin, Yiyu Lin, Guangze Su, Zuwei Shui","authorsParsed":[["Ling","Zhipeng",""],["Xin","Qi",""],["Lin","Yiyu",""],["Su","Guangze",""],["Shui","Zuwei",""]],"versions":[{"version":"v1","created":"Tue, 25 Jun 2024 08:59:33 GMT"}],"updateDate":"2024-07-16","timestamp":1719305973000,"abstract":"  YOLOv8 plays a crucial role in the realm of autonomous driving, owing to its\nhigh-speed target detection, precise identification and positioning, and\nversatile compatibility across multiple platforms. By processing video streams\nor images in real-time, YOLOv8 rapidly and accurately identifies obstacles such\nas vehicles and pedestrians on roadways, offering essential visual data for\nautonomous driving systems. Moreover, YOLOv8 supports various tasks including\ninstance segmentation, image classification, and attitude estimation, thereby\nproviding comprehensive visual perception for autonomous driving, ultimately\nenhancing driving safety and efficiency. Recognizing the significance of object\ndetection in autonomous driving scenarios and the challenges faced by existing\nmethods, this paper proposes a holistic approach to enhance the YOLOv8 model.\nThe study introduces two pivotal modifications: the C2f_RFAConv module and the\nTriplet Attention mechanism. Firstly, the proposed modifications are elaborated\nupon in the methodological section. The C2f_RFAConv module replaces the\noriginal module to enhance feature extraction efficiency, while the Triplet\nAttention mechanism enhances feature focus. Subsequently, the experimental\nprocedure delineates the training and evaluation process, encompassing training\nthe original YOLOv8, integrating modified modules, and assessing performance\nimprovements using metrics and PR curves. The results demonstrate the efficacy\nof the modifications, with the improved YOLOv8 model exhibiting significant\nperformance enhancements, including increased MAP values and improvements in PR\ncurves. Lastly, the analysis section elucidates the results and attributes the\nperformance improvements to the introduced modules. C2f_RFAConv enhances\nfeature extraction efficiency, while Triplet Attention improves feature focus\nfor enhanced target detection.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}