{"id":"2407.20049","title":"Systematic study of complete fusion suppression for 6,7 Li nuclei using\n  artificial neural network","authors":"D. Chattopadhyay","authorsParsed":[["Chattopadhyay","D.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 14:32:09 GMT"}],"updateDate":"2024-07-30","timestamp":1722263529000,"abstract":"  In recent decades, there has been a significant increase in the measurement\nof complete fusion cross-sections for various reactions, with particular\nemphasis on the reactions involving weakly bound projectile. It has been well\nestablished that the complete fusion cross-section involving weakly bound\nnuclei is suppressed at above barrier energies due to the breakup effect.\nAccurate determination of suppression factor is essential to understand the\neffect of breakup on complete fusion suppression. In this study, Feedforward\nArtificial Neural Network (ANN) methods based on Multilayer Perceptron is\nutilized to estimate the complete fusion suppression factor for reactions\ninvolving 6,7 Li projectile from the comparison of ANN predicted reduced fusion\nfunctions (F (x)) with the Universal Fusion Function(F0 (x)). Average\nsuppression factor has been estimated as 0.68 and 0.74 for 6 Li and 7 Li\ninduced reactions respectively. Normalized Mean Squared Error(NMSE) has been\ncalculated as 1.85% for training and 1.92% for testing data of ANN for 6 Li\ncase, while for 7 Li cases, the same is for 3.73% and 6.48% respectively.\nPresent results have been compared with three other alternative methods Support\nVector Regression, Random Forest Regression and Gaussian Process Regression.\nRelevant performance matrices has been estimated. It has been observed that,\nANN algorithm is giving the better accuracy as compared with other. This\nresults indicate that ANN might be an alternative tool for estimation of\ncomplete fusion suppression factor for weakly bound projectile.\n","subjects":["Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pwzmC7roQUgqGqP26EPE6IiC4UQKIvgxkiJHWU0yuJU","pdfSize":"1497061"}
