{"id":"2407.03804","title":"Multi-Time Scale Service Caching and Pricing in MEC Systems with Dynamic\n  Program Popularity","authors":"Yiming Chen, Xingyuan Hu, Bo Gu, Shimin Gong and Zhou Su","authorsParsed":[["Chen","Yiming",""],["Hu","Xingyuan",""],["Gu","Bo",""],["Gong","Shimin",""],["Su","Zhou",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 10:23:56 GMT"}],"updateDate":"2024-07-08","timestamp":1720088636000,"abstract":"  In mobile edge computing systems, base stations (BSs) equipped with edge\nservers can provide computing services to users to reduce their task execution\ntime. However, there is always a conflict of interest between the BS and users.\nThe BS prices the service programs based on user demand to maximize its own\nprofit, while the users determine their offloading strategies based on the\nprices to minimize their costs. Moreover, service programs need to be\npre-cached to meet immediate computing needs. Due to the limited caching\ncapacity and variations in service program popularity, the BS must dynamically\nselect which service programs to cache. Since service caching and pricing have\ndifferent needs for adjustment time granularities, we propose a two-time scale\nframework to jointly optimize service caching, pricing and task offloading. For\nthe large time scale, we propose a game-nested deep reinforcement learning\nalgorithm to dynamically adjust service caching according to the estimated\npopularity information. For the small time scale, by modeling the interaction\nbetween the BS and users as a two-stage game, we prove the existence of the\nequilibrium under incomplete information and then derive the optimal pricing\nand offloading strategies. Extensive simulations based on a real-world dataset\ndemonstrate the efficiency of the proposed approach.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}