{"id":"2407.19471","title":"On the Evaluation Consistency of Attribution-based Explanations","authors":"Jiarui Duan, Haoling Li, Haofei Zhang, Hao Jiang, Mengqi Xue, Li Sun,\n  Mingli Song, Jie Song","authorsParsed":[["Duan","Jiarui",""],["Li","Haoling",""],["Zhang","Haofei",""],["Jiang","Hao",""],["Xue","Mengqi",""],["Sun","Li",""],["Song","Mingli",""],["Song","Jie",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 11:49:06 GMT"}],"updateDate":"2024-07-30","timestamp":1722167346000,"abstract":"  Attribution-based explanations are garnering increasing attention recently\nand have emerged as the predominant approach towards \\textit{eXplanable\nArtificial Intelligence}~(XAI). However, the absence of consistent\nconfigurations and systematic investigations in prior literature impedes\ncomprehensive evaluations of existing methodologies. In this work, we introduce\n{Meta-Rank}, an open platform for benchmarking attribution methods in the image\ndomain. Presently, Meta-Rank assesses eight exemplary attribution methods using\nsix renowned model architectures on four diverse datasets, employing both the\n\\textit{Most Relevant First} (MoRF) and \\textit{Least Relevant First} (LeRF)\nevaluation protocols. Through extensive experimentation, our benchmark reveals\nthree insights in attribution evaluation endeavors: 1) evaluating attribution\nmethods under disparate settings can yield divergent performance rankings; 2)\nalthough inconsistent across numerous cases, the performance rankings exhibit\nremarkable consistency across distinct checkpoints along the same training\ntrajectory; 3) prior attempts at consistent evaluation fare no better than\nbaselines when extended to more heterogeneous models and datasets. Our findings\nunderscore the necessity for future research in this domain to conduct rigorous\nevaluations encompassing a broader range of models and datasets, and to\nreassess the assumptions underlying the empirical success of different\nattribution methods. Our code is publicly available at\n\\url{https://github.com/TreeThree-R/Meta-Rank}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_CFcdxsapVN-RRtxfITt9kvit9pmpYpo6cA0wK4GsvU","pdfSize":"3239016"}
