{"id":"2407.05815","title":"Metallicity of RR Lyrae stars from the Gaia Data Release 3 catalogue\n  computed with Machine Learning algorithms","authors":"Tatiana Muraveva, Andrea Giannetti, Gisella Clementini, Alessia\n  Garofalo and Lorenzo Monti","authorsParsed":[["Muraveva","Tatiana",""],["Giannetti","Andrea",""],["Clementini","Gisella",""],["Garofalo","Alessia",""],["Monti","Lorenzo",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 10:51:41 GMT"}],"updateDate":"2024-07-09","timestamp":1720435901000,"abstract":"  We present new $P -\\phi_{31}-{\\rm [Fe/H]}$ and $P -\\phi_{31}- A_2 - {\\rm\n[Fe/H]}$ relations for fundamental-mode (RRab) and first-overtone mode (RRc) RR\nLyrae stars (RRLs), respectively. The relations were calibrated based on\npulsation periods and Fourier parameters of the RRL light curves in the Gaia\n$G$-band published in the Gaia Data Release 3 (DR3), and accurate\nspectroscopically measured metallicities available in the literature. We apply\nthe feature selection algorithm to identify the most relevant parameters for\nthe determination of metallicity. To fit the relations, we used the Bayesian\napproach, which allowed us to carefully take into account uncertainties in\nvarious parameters and the intrinsic scatter of the relations. The root mean\nsquared errors of the predicted metallicity values in the training samples are\n0.28 dex and 0.21 dex for RRab and RRc stars, respectively, comparable with the\ntypical uncertainty of low/intermediate resolution spectroscopic metallicity\nmeasurements. We applied the new relations to measure individual metallicities\nand distances to $\\sim$ 134,000 RRLs from the Gaia DR3 catalogue, as well as\nmean metallicities and distances to 38 Milky Way globular clusters. We also\nestimate the mean metallicity and distance to the Large Magellanic Cloud (LMC)\nand Small Magellanic Cloud (SMC): ${\\rm [Fe/H]_{LMC} = -1.63\\pm0.36}$ and\n$\\mu_{\\rm LMC}=18.55\\pm0.18$~mag, ${\\rm [Fe/H]_{SMC}=-1.86\\pm0.36}$~dex and\n$\\mu_{\\rm SMC}=19.01\\pm 0.17$~mag, respectively, in excellent agreement with\nprevious measurements.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}