{"id":"2407.03202","title":"Clifford Circuits Augmented Time-Dependent Variational Principle","authors":"Xiangjian Qian, Jiale Huang and Mingpu Qin","authorsParsed":[["Qian","Xiangjian",""],["Huang","Jiale",""],["Qin","Mingpu",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 15:34:15 GMT"}],"updateDate":"2024-07-04","timestamp":1720020855000,"abstract":"  The recently proposed Clifford Circuits Augmented Matrix Product States\n(CA-MPS) (arXiv:2405.09217) seamlessly augments Density Matrix Renormalization\nGroup with Clifford circuits. In CA-MPS, the entanglement from stabilizers is\ntransferred to the Clifford circuits which can be easily handled according to\nthe Gottesman-Knill theorem. As a result, MPS needs only to deal with the\nnon-stabilizer entanglement, which largely reduce the bond dimension and the\nresource required for the accurate simulation of many-body systems. In this\nwork, we generalize CA-MPS to the framework of Time-Dependent Variational\nPrinciple (TDVP) for time evolution simulations. In this method, we apply\nClifford circuits to the resulting MPS in each TDVP step with a two-site\nsweeping process similar as in DMRG, aiming at reducing the entanglement\nentropy in the MPS, and the Hamiltonian is transformed accordingly using the\nchosen Clifford circuits. Similar as in CA-MPS, the Clifford circuits doesn't\nincrease the number of terms in the Hamiltonian which makes the overhead very\nsmall in the new method. We test this method in both XXZ chain and two\ndimensional Heisenberg model. The results show that the Clifford circuits\naugmented TDVP method can reduce the entanglement entropy in the time evolution\nprocess and hence makes the simulation reliable for longer time. The Clifford\ncircuits augmented Time-Dependent Variational Principle provides a useful tool\nfor the simulation of time evolution process of many-body systems in the\nfuture.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}