{"id":"2407.19821","title":"Distilling High Diagnostic Value Patches for Whole Slide Image\n  Classification Using Attention Mechanism","authors":"Tianhang Nan, Hao Quan, Yong Ding, Xingyu Li, Kai Yang, Xiaoyu Cui","authorsParsed":[["Nan","Tianhang",""],["Quan","Hao",""],["Ding","Yong",""],["Li","Xingyu",""],["Yang","Kai",""],["Cui","Xiaoyu",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 09:14:21 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 10:23:55 GMT"}],"updateDate":"2024-08-19","timestamp":1722244461000,"abstract":"  Multiple Instance Learning (MIL) has garnered widespread attention in the\nfield of Whole Slide Image (WSI) classification as it replaces pixel-level\nmanual annotation with diagnostic reports as labels, significantly reducing\nlabor costs. Recent research has shown that bag-level MIL methods often yield\nbetter results because they can consider all patches of the WSI as a whole.\nHowever, a drawback of such methods is the incorporation of more redundant\npatches, leading to interference. To extract patches with high diagnostic value\nwhile excluding interfering patches to address this issue, we developed an\nattention-based feature distillation multi-instance learning (AFD-MIL)\napproach. This approach proposed the exclusion of redundant patches as a\npreprocessing operation in weakly supervised learning, directly mitigating\ninterference from extensive noise. It also pioneers the use of attention\nmechanisms to distill features with high diagnostic value, as opposed to the\ntraditional practice of indiscriminately and forcibly integrating all patches.\nAdditionally, we introduced global loss optimization to finely control the\nfeature distillation module. AFD-MIL is orthogonal to many existing MIL\nmethods, leading to consistent performance improvements. This approach has\nsurpassed the current state-of-the-art method, achieving 91.47% ACC (accuracy)\nand 94.29% AUC (area under the curve) on the Camelyon16 (Camelyon Challenge\n2016, breast cancer), while 93.33% ACC and 98.17% AUC on the TCGA-NSCLC (The\nCancer Genome Atlas Program: non-small cell lung cancer). Different feature\ndistillation methods were used for the two datasets, tailored to the specific\ndiseases, thereby improving performance and interpretability.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Quantitative Biology/Tissues and Organs"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"rCrI9s37XmDfBHYyLWvz4wJPgrlNTLpxfhniq14x1sw","pdfSize":"1371708","objectId":"0x0313230a3389e42c5889c42dff81822e7d6ef7f3031f909094e95b6f5e3f7515","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
