{"id":"2407.17059","title":"Fuzzy Dark Matter Constraints from the Hubble Frontier Fields","authors":"Jackson Sipple, Adam Lidz, Daniel Grin, Guochao Sun","authorsParsed":[["Sipple","Jackson",""],["Lidz","Adam",""],["Grin","Daniel",""],["Sun","Guochao",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 07:37:05 GMT"}],"updateDate":"2024-07-25","timestamp":1721806625000,"abstract":"  In fuzzy dark matter (FDM) cosmologies, the dark matter consists of\nultralight bosons ($m\\lesssim10^{-20}$ eV). The astrophysically large de\nBroglie wavelengths of such particles hinder the formation of low-mass dark\nmatter halos. This implies a testable prediction: a corresponding suppression\nin the faint-end of the ultraviolet luminosity function (UVLF) of galaxies.\nNotably, recent estimates of the faint-end UVLF at $z\\sim5-9$ in the Hubble\nFrontier Fields, behind foreground lensing clusters, probe up to five\nmagnitudes fainter than typical (\"blank-field\") regions. These measurements\nthus far disfavor prominent turnovers in the UVLF at low luminosity, implying\nbounds on FDM. We fit a semi-empirical model to these and blank-field UVLF\ndata, including the FDM particle mass as a free parameter. This fit excludes\ncases where the dark matter is entirely a boson of mass $m<1.5\\times10^{-21}$\neV (with $2\\sigma$ confidence). We also present a less stringent bound deriving\nsolely from the requirement that the total observed abundance of galaxies,\nintegrated over all luminosities, must not exceed the total halo abundance in\nFDM. This more model-agnostic bound disfavors $m<5\\times10^{-22}$ eV\n($2\\sigma$). We forecast that future UVLF measurements from JWST lensing fields\nmay probe masses several times larger than these bounds, although we\ndemonstrate this is subject to theoretical uncertainties in modeling the FDM\nhalo mass function.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}