{"id":"2407.13982","title":"Reexamining Racial Disparities in Automatic Speech Recognition\n  Performance: The Role of Confounding by Provenance","authors":"Changye Li, Trevor Cohen, Serguei Pakhomov","authorsParsed":[["Li","Changye",""],["Cohen","Trevor",""],["Pakhomov","Serguei",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 02:14:17 GMT"}],"updateDate":"2024-07-22","timestamp":1721355257000,"abstract":"  Automatic speech recognition (ASR) models trained on large amounts of audio\ndata are now widely used to convert speech to written text in a variety of\napplications from video captioning to automated assistants used in healthcare\nand other domains. As such, it is important that ASR models and their use is\nfair and equitable. Prior work examining the performance of commercial ASR\nsystems on the Corpus of Regional African American Language (CORAAL)\ndemonstrated significantly worse ASR performance on African American English\n(AAE). The current study seeks to understand the factors underlying this\ndisparity by examining the performance of the current state-of-the-art neural\nnetwork based ASR system (Whisper, OpenAI) on the CORAAL dataset. Two key\nfindings have been identified as a result of the current study. The first\nconfirms prior findings of significant dialectal variation even across\nneighboring communities, and worse ASR performance on AAE that can be improved\nto some extent with fine-tuning of ASR models. The second is a novel finding\nnot discussed in prior work on CORAAL: differences in audio recording practices\nwithin the dataset have a significant impact on ASR accuracy resulting in a\n``confounding by provenance'' effect in which both language use and recording\nquality differ by study location. These findings highlight the need for further\nsystematic investigation to disentangle the effects of recording quality and\ninherent linguistic diversity when examining the fairness and bias present in\nneural ASR models, as any bias in ASR accuracy may have negative downstream\neffects on disparities in various domains of life in which ASR technology is\nused.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}