{"id":"2407.05147","title":"Measurement of microwave photon correlations at millikelvin with a\n  thermal detector","authors":"Aarne Ker\\\"anen, Qi-Ming Chen, Andr\\'as Gunyh\\'o, Priyank Singh, Jian\n  Ma, Visa Vesterinen, Joonas Govenius, Mikko M\\\"ott\\\"onen","authorsParsed":[["Keränen","Aarne",""],["Chen","Qi-Ming",""],["Gunyhó","András",""],["Singh","Priyank",""],["Ma","Jian",""],["Vesterinen","Visa",""],["Govenius","Joonas",""],["Möttönen","Mikko",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 18:15:08 GMT"}],"updateDate":"2024-07-09","timestamp":1720289708000,"abstract":"  Microwave photons are important carriers of quantum information in many\npromising platforms for quantum computing. They can be routinely generated,\ncontrolled, and teleported in experiments, indicating a variety of applications\nin quantum technology. However, observation of quantum statistical properties\nof microwave photons remains demanding: The energy of several microwave photons\nis considerably smaller than the thermal fluctuation of any room-temperature\ndetector, while amplification necessarily induces noise. Here, we present a\nmeasurement technique with a nanobolometer that directly measures the photon\nstatistics at millikelvin and overcomes this trade-off. We apply our method to\nthermal states generated by a blackbody radiator operating in the regime of\ncircuit quantum electrodynamics. We demonstrate the photon number resolvedness\nof the nanobolometer, and reveal the n(n+1)-scaling law of the photon number\nvariance as indicated by the Bose--Einstein distribution. By engineering the\ncoherent and incoherent proportions of the input field, we observe the\ntransition between super-Poissonian and Poissonian statistics of the microwave\nphotons from the bolometric second-order correlation measurement. This\ntechnique is poised to serve in fundamental tests of quantum mechanics with\nmicrowave photons and function as a scalable readout solution for a quantum\ninformation processor.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}