{"id":"2407.16014","title":"Political Elites in the Attention Economy: Visibility Over Civility and\n  Credibility?","authors":"Ahana Biswas, Yu-Ru Lin, Yuehong Cassandra Tai, Bruce A. Desmarais","authorsParsed":[["Biswas","Ahana",""],["Lin","Yu-Ru",""],["Tai","Yuehong Cassandra",""],["Desmarais","Bruce A.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 19:46:10 GMT"}],"updateDate":"2024-07-24","timestamp":1721677570000,"abstract":"  Elected officials have privileged roles in public communication. In contrast\nto national politicians, whose posting content is more likely to be closely\nscrutinized by a robust ecosystem of nationally focused media outlets,\nsub-national politicians are more likely to openly disseminate harmful content\nwith limited media scrutiny. In this paper, we analyze the factors that explain\nthe online visibility of over 6.5K unique state legislators in the US and how\ntheir visibility might be impacted by posting low-credibility or uncivil\ncontent. We conducted a study of posting on Twitter and Facebook (FB) during\n2020-21 to analyze how legislators engage with users on these platforms. The\nresults indicate that distributing content with low-credibility information\nattracts greater attention from users on FB and Twitter for Republicans.\nConversely, posting content that is considered uncivil on Twitter receives less\nattention. A noticeable scarcity of posts containing uncivil content was\nobserved on FB, which may be attributed to the different communication patterns\nof legislators on these platforms. In most cases, the effect is more pronounced\namong the most ideologically extreme legislators. Our research explores the\ninfluence exerted by state legislators on online political conversations, with\nTwitter and FB serving as case studies. Furthermore, it sheds light on the\ndifferences in the conduct of political actors on these platforms. This study\ncontributes to a better understanding of the role that political figures play\nin shaping online political discourse.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}