{"id":"2407.04397","title":"Efficient detection of chaos through the computation of the Generalized\n  Alignment Index (GALI) by the multi-particle method","authors":"Bertin Many Manda, Malcolm Hillebrand and Charalampos Skokos","authorsParsed":[["Manda","Bertin Many",""],["Hillebrand","Malcolm",""],["Skokos","Charalampos",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 10:10:48 GMT"}],"updateDate":"2024-07-08","timestamp":1720174248000,"abstract":"  We present a thorough analysis of computing the Generalized Alignment Index\n(GALI), a rapid and effective chaos indicator, through a simple multi-particle\napproach, which avoids the use of variational equations. We develop a\ntheoretical leading-order estimation of the error in the computed GALI for both\nthe variational method (VM) and the multi-particle method (MPM), and confirm\nits predictions through extensive numerical simulations of two well-known\nHamiltonian models: the H\\'enon-Heiles and the $\\beta$-Fermi-Pasta-Ulam-Tsingou\nsystems. For these models the GALIs of several orders are computed and the MPM\nresults are compared to the VM outcomes. The dependence of the accuracy of the\nMPM on the renormalization time, integration time step, as well as the\ndeviation vector size, is studied in detail. We find that the implementation if\nthe MPM in double machine precision ($\\varepsilon \\approx 10^{-16}$) is\nreliable for deviation vector magnitudes centred around $d_0\\approx\n\\varepsilon^{1/2}$, renormalization times $\\tau \\lesssim 1$, and relative\nenergy errors $E_r \\lesssim \\varepsilon^{1/2}$. These results are valid for\nsystems with many degrees of freedom and for several orders of the GALIs, with\nthe MPM particularly capturing very accurately the $\\textrm{GALI}_2$ behavior.\nOur results show that the computation of the GALIs by the MPM is a robust and\nefficient method for investigating the global chaotic dynamics of autonomous\nHamiltonian systems, something which is of distinct importance in cases where\nit is difficult to explicitly write the system's variational equation or when\nthese equations are too cumbersome.\n","subjects":["Nonlinear Sciences/Chaotic Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}