{"id":"2407.04095","title":"Gravitational self-lensing of Fast Radio Bursts in neutron star\n  magnetospheres: I. The model","authors":"Simone Dall'Osso, Riccardo La Placa, Luigi Stella, Pavel Bakala,\n  Andrea Possenti","authorsParsed":[["Dall'Osso","Simone",""],["La Placa","Riccardo",""],["Stella","Luigi",""],["Bakala","Pavel",""],["Possenti","Andrea",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 18:00:02 GMT"}],"updateDate":"2024-07-08","timestamp":1720116002000,"abstract":"  Fast Radio Bursts (FRBs) are cosmological sub-second bursts of coherent radio\nemission, whose source is still unknown. To date, the galactic magnetar SGR\n1935+2154 is the only astrophysical object known to emit radio bursts akin to\nFRBs, albeit less powerful, supporting suggestions that FRBs originate from\nmagnetars. Many remarkable properties of FRBs, e.g. the dichotomy between\nrepeaters and one-off sources, and their power-law energy distributions (with\ntypical index $\\sim 2-3$), are not well understood yet. Moreover, the huge\nradio power released by the most active repeaters is challenging even for the\nmagnetic energy reservoir of magnetars. Here we assume that FRBs originate from\nco-rotating hot-spots anchored in neutron star magnetospheres and get\noccasionally amplified by large factors via gravitational self-lensing in the\nstrong NS field. We evaluate the probability of amplification and show that (i)\na power-law energy distribution of events $\\propto E^{-(2- 3)}$ is generally\nexpected, (ii) all FRB sources may be regarded as repeating, their appearance\nas one-off sources or repeaters being determined by the critical dependence of\nthe amplification probability on the emission geometry and source orientation\nrelative to Earth and (iii) the most active repeaters, in particular,\ncorrespond to extremely rare and finely-tuned orientations ($\\sim$ one in\n$10^6$), leading to large probabilities of amplification which make their\nbursts frequently detectable. At the same time, their power release appears\nenhanced, typically by factors $\\gtrsim 10$, easing their energy budget\nproblem.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"-OCieXQqZ9YhjNhAsHyVCJ_BvQ7QSdqpH_EIOTGwNRo","pdfSize":"5619319"}
