{"id":"2407.20268","title":"Utilizing Generative Adversarial Networks for Image Data Augmentation\n  and Classification of Semiconductor Wafer Dicing Induced Defects","authors":"Zhining Hu, Tobias Schlosser, Michael Friedrich, Andr\\'e Luiz Vieira e\n  Silva, Frederik Beuth, Danny Kowerko","authorsParsed":[["Hu","Zhining",""],["Schlosser","Tobias",""],["Friedrich","Michael",""],["Silva","André Luiz Vieira e",""],["Beuth","Frederik",""],["Kowerko","Danny",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 20:44:16 GMT"}],"updateDate":"2024-07-31","timestamp":1721853856000,"abstract":"  In semiconductor manufacturing, the wafer dicing process is central yet\nvulnerable to defects that significantly impair yield - the proportion of\ndefect-free chips. Deep neural networks are the current state of the art in\n(semi-)automated visual inspection. However, they are notoriously known to\nrequire a particularly large amount of data for model training. To address\nthese challenges, we explore the application of generative adversarial networks\n(GAN) for image data augmentation and classification of semiconductor wafer\ndicing induced defects to enhance the variety and balance of training data for\nvisual inspection systems. With this approach, synthetic yet realistic images\nare generated that mimic real-world dicing defects. We employ three different\nGAN variants for high-resolution image synthesis: Deep Convolutional GAN\n(DCGAN), CycleGAN, and StyleGAN3. Our work-in-progress results demonstrate that\nimproved classification accuracies can be obtained, showing an average\nimprovement of up to 23.1 % from 65.1 % (baseline experiment) to 88.2 % (DCGAN\nexperiment) in balanced accuracy, which may enable yield optimization in\nproduction.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}