{"id":"2407.08349","title":"Spine Vision X-Ray Image based GUI Planning of Pedicle Screws Using\n  Enhanced YOLOv5 for Vertebrae Segmentation","authors":"Yashwanth Rao, Gaurisankar S, Durga R, Aparna Purayath, Vivek Maik,\n  Manojkumar Lakshmanan, and Mohanasankar Sivaprakasm","authorsParsed":[["Rao","Yashwanth",""],["S","Gaurisankar",""],["R","Durga",""],["Purayath","Aparna",""],["Maik","Vivek",""],["Lakshmanan","Manojkumar",""],["Sivaprakasm","Mohanasankar",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 09:59:43 GMT"}],"updateDate":"2024-07-12","timestamp":1720691983000,"abstract":"  In this paper, we propose an innovative Graphical User Interface (GUI) aimed\nat improving preoperative planning and intra-operative guidance for precise\nspinal screw placement through vertebrae segmentation. The methodology\nencompasses both front-end and back-end computations. The front end comprises a\nGUI that allows surgeons to precisely adjust the placement of screws on X-Ray\nimages, thereby improving the simulation of surgical screw insertion in the\npatient's spine. On the other hand, the back-end processing involves several\nsteps, including acquiring spinal X-ray images, performing pre-processing\ntechniques to reduce noise, and training a neural network model to achieve\nreal-time segmentation of the vertebrae. The integration of vertebral\nsegmentation in the GUI ensures precise screw placement, reducing complications\nlike nerve injury and ultimately improving surgical outcomes. The Spine-Vision\nprovides a comprehensive solution with innovative features like synchronous\nAP-LP planning, accurate screw positioning via vertebrae segmentation,\neffective screw visualization, and dynamic position adjustments. This X-ray\nimage-based GUI workflow emerges as a valuable tool, enhancing precision and\nsafety in spinal screw placement and planning procedures.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}