{"id":"2407.06908","title":"Divine LLaMAs: Bias, Stereotypes, Stigmatization, and Emotion\n  Representation of Religion in Large Language Models","authors":"Flor Miriam Plaza-del-Arco, Amanda Cercas Curry, Susanna Paoli, Alba\n  Curry, Dirk Hovy","authorsParsed":[["Plaza-del-Arco","Flor Miriam",""],["Curry","Amanda Cercas",""],["Paoli","Susanna",""],["Curry","Alba",""],["Hovy","Dirk",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 14:45:15 GMT"}],"updateDate":"2024-07-10","timestamp":1720536315000,"abstract":"  Emotions play important epistemological and cognitive roles in our lives,\nrevealing our values and guiding our actions. Previous work has shown that LLMs\ndisplay biases in emotion attribution along gender lines. However, unlike\ngender, which says little about our values, religion, as a socio-cultural\nsystem, prescribes a set of beliefs and values for its followers. Religions,\ntherefore, cultivate certain emotions. Moreover, these rules are explicitly\nlaid out and interpreted by religious leaders. Using emotion attribution, we\nexplore how different religions are represented in LLMs. We find that: Major\nreligions in the US and European countries are represented with more nuance,\ndisplaying a more shaded model of their beliefs. Eastern religions like\nHinduism and Buddhism are strongly stereotyped. Judaism and Islam are\nstigmatized -- the models' refusal skyrocket. We ascribe these to cultural bias\nin LLMs and the scarcity of NLP literature on religion. In the rare instances\nwhere religion is discussed, it is often in the context of toxic language,\nperpetuating the perception of these religions as inherently toxic. This\nfinding underscores the urgent need to address and rectify these biases. Our\nresearch underscores the crucial role emotions play in our lives and how our\nvalues influence them.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YNGV3Ou9QUGfbuvLeQ_ohW6PSEAI7sKa_lxDJx0v6AI","pdfSize":"2561360"}
