{"id":"2407.11994","title":"Evaluating Contextually Personalized Programming Exercises Created with\n  Generative AI","authors":"Evanfiya Logacheva, Arto Hellas, James Prather, Sami Sarsa, Juho\n  Leinonen","authorsParsed":[["Logacheva","Evanfiya",""],["Hellas","Arto",""],["Prather","James",""],["Sarsa","Sami",""],["Leinonen","Juho",""]],"versions":[{"version":"v1","created":"Tue, 11 Jun 2024 12:59:52 GMT"}],"updateDate":"2024-07-18","timestamp":1718110792000,"abstract":"  Programming skills are typically developed through completing various\nhands-on exercises. Such programming problems can be contextualized to\nstudents' interests and cultural backgrounds. Prior research in educational\npsychology has demonstrated that context personalization of exercises\nstimulates learners' situational interests and positively affects their\nengagement. However, creating a varied and comprehensive set of programming\nexercises for students to practice on is a time-consuming and laborious task\nfor computer science educators. Previous studies have shown that large language\nmodels can generate conceptually and contextually relevant programming\nexercises. Thus, they offer a possibility to automatically produce personalized\nprogramming problems to fit students' interests and needs. This article reports\non a user study conducted in an elective introductory programming course that\nincluded contextually personalized programming exercises created with GPT-4.\nThe quality of the exercises was evaluated by both the students and the\nauthors. Additionally, this work investigated student attitudes towards the\ncreated exercises and their engagement with the system. The results demonstrate\nthat the quality of exercises generated with GPT-4 was generally high. What is\nmore, the course participants found them engaging and useful. This suggests\nthat AI-generated programming problems can be a worthwhile addition to\nintroductory programming courses, as they provide students with a practically\nunlimited pool of practice material tailored to their personal interests and\neducational needs.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}