{"id":"2407.03559","title":"On Finite Fields and Higher Reciprocity","authors":"Matias Carl Relyea","authorsParsed":[["Relyea","Matias Carl",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 01:12:24 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 23:02:31 GMT"},{"version":"v3","created":"Sat, 3 Aug 2024 05:08:18 GMT"}],"updateDate":"2024-08-06","timestamp":1720055544000,"abstract":"  Cubic and biquadratic reciprocity have long since been referred to as \"the\nforgotten reciprocity laws\", largely since they provide special conditions that\nare widely considered to be unnecessary in the study of number theory. In this\nexposition of finite fields and higher reciprocity, we will begin by\nintroducing concepts in abstract algebra and elementary number theory. This\nwill motivate our approach toward understanding the structure and then\nexistence of finite fields, especially with a focus on understanding the\nmultiplicative group $\\mathbb{F}^{*}$. While surveying finite fields we will\nprovide another proof of quadratic reciprocity. We will proceed to investigate\nproperties of the general multiplicative character, covering the concept of a\ngeneral Gauss sum as well as basic notions of the Jacobi sum. From there we\nwill begin laying the foundations for the cubic reciprocity law, beginning with\na classification of the primes and units of the Eisenstein integers, denoted\n$\\mathbb{Z}[\\omega]$, and further investigations into the residue class ring\n$\\mathbb{Z}[\\omega]/\\pi\\mathbb{Z}[\\omega]$ for $\\pi$ prime, which is\npredominantly the world in which cubic reciprocity lies. We then define the\ncubic residue character and state the full law of cubic reciprocity. We will\nfinish the section on cubic reciprocity with a brief survey of the cubic\nresidue character of the even prime $2$ and state a significant result due to\nGauss that summarizes the conditions for $2$ to be a cubic residue. We conclude\nwith a brief survey of the law of biquadratic reciprocity.\n","subjects":["Mathematics/Number Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}