{"id":"2407.13430","title":"Star and Planet Formation with the Single Aperture Large Telescope for\n  Universe Studies (SALTUS) Space Observatory","authors":"Kamber Schwarz, Alexander Tielens, Joan Najita, Jennifer Bergner,\n  Quentin Kral, Carrie Anderson, Gordon Chin, David Leisawitz, David Wilner,\n  Peter Roelfsema, Floris van der Tak, Erick Young, Christopher Walker","authorsParsed":[["Schwarz","Kamber",""],["Tielens","Alexander",""],["Najita","Joan",""],["Bergner","Jennifer",""],["Kral","Quentin",""],["Anderson","Carrie",""],["Chin","Gordon",""],["Leisawitz","David",""],["Wilner","David",""],["Roelfsema","Peter",""],["van der Tak","Floris",""],["Young","Erick",""],["Walker","Christopher",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 11:54:58 GMT"}],"updateDate":"2024-07-19","timestamp":1721303698000,"abstract":"  The Single Aperture Large Telescope for Universe Studies (SALTUS) is a\nfar-infrared space mission concept with unprecedented spatial and spectral\nresolution. Saltus consists of a 14-m inflatable primary, providing 16 times\nthe sensitivity and 4 times the angular resolution of Herschel, and two\ncryogenic detectors spanning a wavelength range of 34-660 microns and spectral\nresolving power of 300 - 1e7. Spectroscopic observations in the far-infrared\noffer many unique windows into the processes of star and planet formation.\nThese include observations of low energy water transitions, the H2 mass tracer\nHD, many CHONS constraining molecules such as NH3 and H2S, and emission lines\nfrom the phonon modes of molecular ices. Observing these species will allow us\nto build a statistical sample of protoplanetary disk masses, characterize the\nwater snowline, identify Kuiper Belt like debris rings around other stars, and\ntrace the evolution CHONS from prestellar cores, through to protoplanetary\ndisks and debris disks. This paper details details several key star and planet\nformation science goals achievable with SALTUS.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}