{"id":"2407.19113","title":"VIMs: Virtual Immunohistochemistry Multiplex staining via Text-to-Stain\n  Diffusion Trained on Uniplex Stains","authors":"Shikha Dubey, Yosep Chong, Beatrice Knudsen, Shireen Y. Elhabian","authorsParsed":[["Dubey","Shikha",""],["Chong","Yosep",""],["Knudsen","Beatrice",""],["Elhabian","Shireen Y.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 22:23:45 GMT"}],"updateDate":"2024-07-30","timestamp":1722032625000,"abstract":"  This paper introduces a Virtual Immunohistochemistry Multiplex staining\n(VIMs) model designed to generate multiple immunohistochemistry (IHC) stains\nfrom a single hematoxylin and eosin (H&E) stained tissue section. IHC stains\nare crucial in pathology practice for resolving complex diagnostic questions\nand guiding patient treatment decisions. While commercial laboratories offer a\nwide array of up to 400 different antibody-based IHC stains, small biopsies\noften lack sufficient tissue for multiple stains while preserving material for\nsubsequent molecular testing. This highlights the need for virtual IHC\nstaining. Notably, VIMs is the first model to address this need, leveraging a\nlarge vision-language single-step diffusion model for virtual IHC multiplexing\nthrough text prompts for each IHC marker. VIMs is trained on uniplex paired H&E\nand IHC images, employing an adversarial training module. Testing of VIMs\nincludes both paired and unpaired image sets. To enhance computational\nefficiency, VIMs utilizes a pre-trained large latent diffusion model fine-tuned\nwith small, trainable weights through the Low-Rank Adapter (LoRA) approach.\nExperiments on nuclear and cytoplasmic IHC markers demonstrate that VIMs\noutperforms the base diffusion model and achieves performance comparable to\nPix2Pix, a standard generative model for paired image translation. Multiple\nevaluation methods, including assessments by two pathologists, are used to\ndetermine the performance of VIMs. Additionally, experiments with different\nprompts highlight the impact of text conditioning. This paper represents the\nfirst attempt to accelerate histopathology research by demonstrating the\ngeneration of multiple IHC stains from a single H&E input using a single model\ntrained solely on uniplex data.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}