{"id":"2407.12780","title":"Hallucination Index: An Image Quality Metric for Generative\n  Reconstruction Models","authors":"Matthew Tivnan, Siyeop Yoon, Zhennong Chen, Xiang Li, Dufan Wu,\n  Quanzheng Li","authorsParsed":[["Tivnan","Matthew",""],["Yoon","Siyeop",""],["Chen","Zhennong",""],["Li","Xiang",""],["Wu","Dufan",""],["Li","Quanzheng",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 17:57:50 GMT"}],"updateDate":"2024-07-18","timestamp":1721239070000,"abstract":"  Generative image reconstruction algorithms such as measurement conditioned\ndiffusion models are increasingly popular in the field of medical imaging.\nThese powerful models can transform low signal-to-noise ratio (SNR) inputs into\noutputs with the appearance of high SNR. However, the outputs can have a new\ntype of error called hallucinations. In medical imaging, these hallucinations\nmay not be obvious to a Radiologist but could cause diagnostic errors.\nGenerally, hallucination refers to error in estimation of object structure\ncaused by a machine learning model, but there is no widely accepted method to\nevaluate hallucination magnitude. In this work, we propose a new image quality\nmetric called the hallucination index. Our approach is to compute the Hellinger\ndistance from the distribution of reconstructed images to a zero hallucination\nreference distribution. To evaluate our approach, we conducted a numerical\nexperiment with electron microscopy images, simulated noisy measurements, and\napplied diffusion based reconstructions. We sampled the measurements and the\ngenerative reconstructions repeatedly to compute the sample mean and\ncovariance. For the zero hallucination reference, we used the forward diffusion\nprocess applied to ground truth. Our results show that higher measurement SNR\nleads to lower hallucination index for the same apparent image quality. We also\nevaluated the impact of early stopping in the reverse diffusion process and\nfound that more modest denoising strengths can reduce hallucination. We believe\nthis metric could be useful for evaluation of generative image reconstructions\nor as a warning label to inform radiologists about the degree of hallucinations\nin medical images.\n","subjects":["Physics/Medical Physics","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}