{"id":"2407.17800","title":"Design of a LYSO Crystal Electromagnetic Calorimeter for DarkSHINE\n  Experiment","authors":"Zhiyu Zhao, Qibin Liu, Jiyuan Chen, Jing Chen, Junfeng Chen, Xiang\n  Chen, Changbo Fu, Jun Guo, Kim Siang Khaw, Liang Li, Shu Li, Danning Liu, Kun\n  Liu, Siyuan Song, Tong Sun, Jiannan Tang, Yufeng Wang, Zhen Wang, Weihao Wu,\n  Haijun Yang, Yuming Lin, Rui Yuan, Yulei Zhang, Yunlong Zhang, Baihong Zhou,\n  Xuliang Zhu, Yifan Zhu","authorsParsed":[["Zhao","Zhiyu",""],["Liu","Qibin",""],["Chen","Jiyuan",""],["Chen","Jing",""],["Chen","Junfeng",""],["Chen","Xiang",""],["Fu","Changbo",""],["Guo","Jun",""],["Khaw","Kim Siang",""],["Li","Liang",""],["Li","Shu",""],["Liu","Danning",""],["Liu","Kun",""],["Song","Siyuan",""],["Sun","Tong",""],["Tang","Jiannan",""],["Wang","Yufeng",""],["Wang","Zhen",""],["Wu","Weihao",""],["Yang","Haijun",""],["Lin","Yuming",""],["Yuan","Rui",""],["Zhang","Yulei",""],["Zhang","Yunlong",""],["Zhou","Baihong",""],["Zhu","Xuliang",""],["Zhu","Yifan",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 06:17:58 GMT"}],"updateDate":"2024-07-26","timestamp":1721888278000,"abstract":"  This paper presents the design and optimization of a LYSO crystal-based\nelectromagnetic calorimeter (ECAL) for the DarkSHINE experiment, which aims to\nsearch for dark photon as potential dark force mediator. The ECAL design has\nbeen meticulously evaluated through comprehensive simulations, focusing on\noptimizing dimensions, material choices, and placement within the detector\narray to enhance sensitivity in search for dark photon signatures while\nbalancing cost and performance. The concluded ECAL design, comprising\n2.5$\\times$2.5$\\times$4 cm$^3$ LYSO crystals arranged in a\n52.5$\\times$52.5$\\times$44 cm$^3$ structure, ensures high energy resolution and\neffective energy containment. The study also explored the energy distribution\nacross different ECAL regions and established a dynamic range for energy\nmeasurements, with a 4 GeV limit per crystal deemed sufficient. Additionally,\nthe radiation tolerance of ECAL components was assessed, confirming the\nsustainability of LYSO crystals and radiation-resistant silicon sensors.\n","subjects":["Physics/Instrumentation and Detectors","Physics/High Energy Physics - Experiment"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}