{"id":"2407.05588","title":"A consistent, volume preserving, and adaptive mesh refinement-based\n  framework for modeling non-isothermal gas-liquid-solid flows with phase\n  change","authors":"Ramakrishnan Thirumalaisamy, Amneet Pal Singh Bhalla","authorsParsed":[["Thirumalaisamy","Ramakrishnan",""],["Bhalla","Amneet Pal Singh",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 03:49:41 GMT"}],"updateDate":"2024-07-09","timestamp":1720410581000,"abstract":"  This work expands on our recently introduced low Mach enthalpy method [1] for\nsimulating the melting and solidification of a phase change material (PCM)\nalongside (or without) an ambient gas phase. The method captures PCM's volume\nchange (shrinkage or expansion) by accounting for density change-induced flows.\nWe present several improvements to the original work. First, we introduce\nconsistent time integration schemes for the mass, momentum, and enthalpy\nequations, which enhance the method stability. Demonstrating the effectiveness\nof this scheme, we show that a system free of external forces and heat sources\ncan conserve its initial mass, momentum, enthalpy, and phase composition. This\nallows the system to transition from a non-isothermal, non-equilibrium,\nphase-changing state to an isothermal, equilibrium state without exhibiting\nunrealistic behavior. Furthermore, we show that the low Mach enthalpy method\naccurately simulates thermocapillary flows without introducing spurious phase\nchanges. We propose an analytical model to validate advanced CFD codes for\nsimulating metal manufacturing processes like welding and 3D printing. These\nprocesses involve a heat source melting metal or alloy in an inert gas\nenvironment. Traditionally, validation relied on manipulating material\nproperties to match complex experiments. Our model uses the Stefan problem with\na density jump to provide a straightforward method for validating multiphysics\nsimulations involving heat sources and phase changes in three-phase\nflows.Lastly, we demonstrate the practical utility of the method in modeling\nporosity defects (gas bubble trapping) during metal solidification. A field\nextension technique is used to accurately apply surface tension forces in a\nthree-phase flow situation. This is where part of the bubble surface is trapped\nwithin the (moving) solidification front.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}