{"id":"2407.00368","title":"Recovery of synchronized oscillations on multiplex networks by tuning\n  dynamical time scales","authors":"Aiwin T Vadakkan, Umesh Kumar Verma and G. Ambika","authorsParsed":[["Vadakkan","Aiwin T",""],["Verma","Umesh Kumar",""],["Ambika","G.",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 08:34:04 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 11:19:17 GMT"}],"updateDate":"2024-08-21","timestamp":1719650044000,"abstract":"  The heterogeneity among interacting dynamical systems or variations in the\npattern of their interactions occur naturally in many real complex systems.\nOften they lead to partially synchronized states like chimeras or oscillation\nsuppressed states like in-homogeneous or homogeneous steady states. In such\ncases, it is a challenge to get synchronized oscillations in spite of\nprevailing heterogeneity. In this study, we present a formalism for controlling\nmulti layer, multi timescale systems and show how synchronized oscillations can\nbe restored by tuning the dynamical time scales between the layers.\nSpecifically, we use the model of a multiplex network, where the first layer of\ncoupled oscillators is multiplexed with an environment layer, that can generate\nvarious types of chimera states and suppressed states. We show that by tuning\nthe time scale mismatch between the layers, we can revive the synchronized\noscillations. We analyse the nature of the transition of the system to\nsynchronization from various dynamical states and the role of time scale\nmismatch and strength of inter layer coupling in this scenario. We also\nconsider a three layer multiplex system, where two system layers interact with\nthe common environment layer. In this case, we observe anti synchronization and\nin-homogeneous steady states on the system layers and by tuning their time\nscale difference with the environment layer, they undergo transition to\nsynchronized oscillations.\n","subjects":["Nonlinear Sciences/Adaptation and Self-Organizing Systems","Nonlinear Sciences/Chaotic Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"DrFGe8cbEbvDjQ0KPWku3mwlhbW1B-MBO7ICV4Wpsc8","pdfSize":"533420"}
