{"id":"2407.13108","title":"UCIP: A Universal Framework for Compressed Image Super-Resolution using\n  Dynamic Prompt","authors":"Xin Li, Bingchen Li, Yeying Jin, Cuiling Lan, Hanxin Zhu, Yulin Ren,\n  Zhibo Chen","authorsParsed":[["Li","Xin",""],["Li","Bingchen",""],["Jin","Yeying",""],["Lan","Cuiling",""],["Zhu","Hanxin",""],["Ren","Yulin",""],["Chen","Zhibo",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 02:36:39 GMT"}],"updateDate":"2024-07-19","timestamp":1721270199000,"abstract":"  Compressed Image Super-resolution (CSR) aims to simultaneously super-resolve\nthe compressed images and tackle the challenging hybrid distortions caused by\ncompression. However, existing works on CSR usually focuses on a single\ncompression codec, i.e., JPEG, ignoring the diverse traditional or\nlearning-based codecs in the practical application, e.g., HEVC, VVC, HIFIC,\netc. In this work, we propose the first universal CSR framework, dubbed UCIP,\nwith dynamic prompt learning, intending to jointly support the CSR distortions\nof any compression codecs/modes. Particularly, an efficient dynamic prompt\nstrategy is proposed to mine the content/spatial-aware task-adaptive contextual\ninformation for the universal CSR task, using only a small amount of prompts\nwith spatial size 1x1. To simplify contextual information mining, we introduce\nthe novel MLP-like framework backbone for our UCIP by adapting the Active Token\nMixer (ATM) to CSR tasks for the first time, where the global information\nmodeling is only taken in horizontal and vertical directions with offset\nprediction. We also build an all-in-one benchmark dataset for the CSR task by\ncollecting the datasets with the popular 6 diverse traditional and\nlearning-based codecs, including JPEG, HEVC, VVC, HIFIC, etc., resulting in 23\ncommon degradations. Extensive experiments have shown the consistent and\nexcellent performance of our UCIP on universal CSR tasks. The project can be\nfound in https://lixinustc.github.io/UCIP.github.io\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}