{"id":"2407.19037","title":"Designing a Universal Quantum Switch for Arbitrary Quantum Dynamics","authors":"Priya Ghosh, Kornikar Sen, and Ujjwal Sen","authorsParsed":[["Ghosh","Priya",""],["Sen","Kornikar",""],["Sen","Ujjwal",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 18:34:48 GMT"}],"updateDate":"2024-07-30","timestamp":1722018888000,"abstract":"  A quantum switch is a superoperator that, in general, creates a superposition\nof various causal orders of two or more quantum dynamics that are all divisible\nin the complete positivity (CP) sense. We introduce a process that we term as\nthe universal quantum switch (UQS), which unlike conventional quantum switches,\nallows for the construction of a quantum switch that can superpose different\ncausal orders of any set of quantum dynamics, regardless of their\nCP-divisibility. Our approach also enables the construction of a quantum switch\nwhile considering a single environment connected with the system, in contrast\nto the traditional one. Moreover, we show the UQS provides more advantages in\nperformance for a certain state discrimination task compared to traditional\nquantum switches. The next question that we address is the following: What is\nthe CP-divisibility characteristic of a dynamics built by acting a quantum\nswitch on CP-divisible or -indivisible dynamics? In this regard, an example is\npresented where the dynamics created by the action of the UQS on two\nCP-indivisible dynamics is CP-indivisible. Additionally, we prove a necessary\nand sufficient condition for the channel created by acting the traditional\nquantum switch on two CP-divisible dynamics to be CP-divisible. Furthermore, we\npresent some examples of CP-divisible dynamics on which, when the usual quantum\nswitch is operated, the resulting dynamics not only becomes CP-indivisible but\nalso turns into P-indivisible. Our findings demonstrate that quantum switches\ncan build CP-divisible, CP-indivisible, and even P-indivisible dynamics from\nCP-divisible dynamics, underscoring the versatility of this technique.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}