{"id":"2407.00866","title":"Silver Linings in the Shadows: Harnessing Membership Inference for\n  Machine Unlearning","authors":"Nexhi Sula, Abhinav Kumar, Jie Hou, Han Wang, Reza Tourani","authorsParsed":[["Sula","Nexhi",""],["Kumar","Abhinav",""],["Hou","Jie",""],["Wang","Han",""],["Tourani","Reza",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 00:20:26 GMT"},{"version":"v2","created":"Fri, 5 Jul 2024 18:01:16 GMT"}],"updateDate":"2024-07-09","timestamp":1719793226000,"abstract":"  With the continued advancement and widespread adoption of machine learning\n(ML) models across various domains, ensuring user privacy and data security has\nbecome a paramount concern. In compliance with data privacy regulations, such\nas GDPR, a secure machine learning framework should not only grant users the\nright to request the removal of their contributed data used for model training\nbut also facilitates the elimination of sensitive data fingerprints within\nmachine learning models to mitigate potential attack - a process referred to as\nmachine unlearning. In this study, we present a novel unlearning mechanism\ndesigned to effectively remove the impact of specific data samples from a\nneural network while considering the performance of the unlearned model on the\nprimary task. In achieving this goal, we crafted a novel loss function tailored\nto eliminate privacy-sensitive information from weights and activation values\nof the target model by combining target classification loss and membership\ninference loss. Our adaptable framework can easily incorporate various privacy\nleakage approximation mechanisms to guide the unlearning process. We provide\nempirical evidence of the effectiveness of our unlearning approach with a\ntheoretical upper-bound analysis through a membership inference mechanism as a\nproof of concept. Our results showcase the superior performance of our approach\nin terms of unlearning efficacy and latency as well as the fidelity of the\nprimary task, across four datasets and four deep learning architectures.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}