{"id":"2407.15661","title":"DriveDiTFit: Fine-tuning Diffusion Transformers for Autonomous Driving","authors":"Jiahang Tu, Wei Ji, Hanbin Zhao, Chao Zhang, Roger Zimmermann, Hui\n  Qian","authorsParsed":[["Tu","Jiahang",""],["Ji","Wei",""],["Zhao","Hanbin",""],["Zhang","Chao",""],["Zimmermann","Roger",""],["Qian","Hui",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:18:52 GMT"}],"updateDate":"2024-07-23","timestamp":1721657932000,"abstract":"  In autonomous driving, deep models have shown remarkable performance across\nvarious visual perception tasks with the demand of high-quality and\nhuge-diversity training datasets. Such datasets are expected to cover various\ndriving scenarios with adverse weather, lighting conditions and diverse moving\nobjects. However, manually collecting these data presents huge challenges and\nexpensive cost. With the rapid development of large generative models, we\npropose DriveDiTFit, a novel method for efficiently generating autonomous\nDriving data by Fine-tuning pre-trained Diffusion Transformers (DiTs).\nSpecifically, DriveDiTFit utilizes a gap-driven modulation technique to\ncarefully select and efficiently fine-tune a few parameters in DiTs according\nto the discrepancy between the pre-trained source data and the target driving\ndata. Additionally, DriveDiTFit develops an effective weather and lighting\ncondition embedding module to ensure diversity in the generated data, which is\ninitialized by a nearest-semantic-similarity initialization approach. Through\nprogressive tuning scheme to refined the process of detail generation in early\ndiffusion process and enlarging the weights corresponding to small objects in\ntraining loss, DriveDiTFit ensures high-quality generation of small moving\nobjects in the generated data. Extensive experiments conducted on driving\ndatasets confirm that our method could efficiently produce diverse real driving\ndata. The source codes will be available at\nhttps://github.com/TtuHamg/DriveDiTFit.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}