{"id":"2407.00679","title":"Multi-Task Learning for Affect Analysis","authors":"Fazeel Asim","authorsParsed":[["Asim","Fazeel",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 12:36:37 GMT"}],"updateDate":"2024-07-02","timestamp":1719750997000,"abstract":"  This Project was my Undergraduate Final Year dissertation, supervised by\nDimitrios Kollias This research delves into the realm of affective computing\nfor image analysis, aiming to enhance the efficiency and effectiveness of\nmulti-task learning in the context of emotion recognition. This project\ninvestigates two primary approaches: uni-task solutions and a multi-task\napproach to the same problems. Each approach undergoes testing, exploring\nvarious formulations, variations, and initialization strategies to come up with\nthe best configuration. The project utilizes existing a neural network\narchitecture, adapting it for multi-task learning by modifying output layers\nand loss functions. Tasks encompass 7 basic emotion recognition, action unit\ndetection, and valence-arousal estimation. Comparative analyses involve\nuni-task models for each individual task, facilitating the assessment of\nmulti-task model performance. Variations within each approach, including, loss\nfunctions, and hyperparameter tuning, undergo evaluation. The impact of\ndifferent initialization strategies and pre-training techniques on model\nconvergence and accuracy is explored. The research aspires to contribute to the\nburgeoning field of affective computing, with applications spanning healthcare,\nmarketing, and human-computer interaction. By systematically exploring\nmulti-task learning formulations, this research aims to contribute to the\ndevelopment of more accurate and efficient models for recognizing and\nunderstanding emotions in images. The findings hold promise for applications in\ndiverse industries, paving the way for advancements in affective computing\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}