{"id":"2407.16943","title":"McGAN: Generating Manufacturable Designs by Embedding Manufacturing\n  Rules into Conditional Generative Adversarial Network","authors":"Zhichao Wang, Xiaoliang Yan, Shreyes Melkote, David Rosen","authorsParsed":[["Wang","Zhichao",""],["Yan","Xiaoliang",""],["Melkote","Shreyes",""],["Rosen","David",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 02:23:02 GMT"}],"updateDate":"2024-07-25","timestamp":1721787782000,"abstract":"  Generative design (GD) methods aim to automatically generate a wide variety\nof designs that satisfy functional or aesthetic design requirements. However,\nresearch to date generally lacks considerations of manufacturability of the\ngenerated designs. To this end, we propose a novel GD approach by using deep\nneural networks to encode design for manufacturing (DFM) rules, thereby\nmodifying part designs to make them manufacturable by a given manufacturing\nprocess. Specifically, a three-step approach is proposed: first, an instance\nsegmentation method, Mask R-CNN, is used to decompose a part design into\nsubregions. Second, a conditional generative adversarial neural network (cGAN),\nPix2Pix, transforms unmanufacturable decomposed subregions into manufacturable\nsubregions. The transformed subregions of designs are subsequently reintegrated\ninto a unified manufacturable design. These three steps, Mask-RCNN, Pix2Pix,\nand reintegration, form the basis of the proposed Manufacturable conditional\nGAN (McGAN) framework. Experimental results show that McGAN can transform\nexisting unmanufacturable designs to generate their corresponding\nmanufacturable counterparts automatically that realize the specified\nmanufacturing rules in an efficient and robust manner. The effectiveness of\nMcGAN is demonstrated through two-dimensional design case studies of an\ninjection molding process.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}