{"id":"2407.01872","title":"Referring Atomic Video Action Recognition","authors":"Kunyu Peng, Jia Fu, Kailun Yang, Di Wen, Yufan Chen, Ruiping Liu,\n  Junwei Zheng, Jiaming Zhang, M. Saquib Sarfraz, Rainer Stiefelhagen, Alina\n  Roitberg","authorsParsed":[["Peng","Kunyu",""],["Fu","Jia",""],["Yang","Kailun",""],["Wen","Di",""],["Chen","Yufan",""],["Liu","Ruiping",""],["Zheng","Junwei",""],["Zhang","Jiaming",""],["Sarfraz","M. Saquib",""],["Stiefelhagen","Rainer",""],["Roitberg","Alina",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 01:13:05 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 23:52:05 GMT"}],"updateDate":"2024-07-12","timestamp":1719882785000,"abstract":"  We introduce a new task called Referring Atomic Video Action Recognition\n(RAVAR), aimed at identifying atomic actions of a particular person based on a\ntextual description and the video data of this person. This task differs from\ntraditional action recognition and localization, where predictions are\ndelivered for all present individuals. In contrast, we focus on recognizing the\ncorrect atomic action of a specific individual, guided by text. To explore this\ntask, we present the RefAVA dataset, containing 36,630 instances with manually\nannotated textual descriptions of the individuals. To establish a strong\ninitial benchmark, we implement and validate baselines from various domains,\ne.g., atomic action localization, video question answering, and text-video\nretrieval. Since these existing methods underperform on RAVAR, we introduce\nRefAtomNet -- a novel cross-stream attention-driven method specialized for the\nunique challenges of RAVAR: the need to interpret a textual referring\nexpression for the targeted individual, utilize this reference to guide the\nspatial localization and harvest the prediction of the atomic actions for the\nreferring person. The key ingredients are: (1) a multi-stream architecture that\nconnects video, text, and a new location-semantic stream, and (2) cross-stream\nagent attention fusion and agent token fusion which amplify the most relevant\ninformation across these streams and consistently surpasses standard\nattention-based fusion on RAVAR. Extensive experiments demonstrate the\neffectiveness of RefAtomNet and its building blocks for recognizing the action\nof the described individual. The dataset and code will be made publicly\navailable at https://github.com/KPeng9510/RAVAR.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}