{"id":"2407.18302","title":"Conduction band resonant states absorption for quantum dot infrared\n  detectors operating at room temperature","authors":"Stefano Vichi, Shigeo Asahi, Sergio Bietti, Artur Tuktamyshev, Alexey\n  Fedorov, Takashi Kita and Stefano Sanguinetti","authorsParsed":[["Vichi","Stefano",""],["Asahi","Shigeo",""],["Bietti","Sergio",""],["Tuktamyshev","Artur",""],["Fedorov","Alexey",""],["Kita","Takashi",""],["Sanguinetti","Stefano",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 18:00:02 GMT"}],"updateDate":"2024-07-29","timestamp":1721930402000,"abstract":"  Long Wavelenght infrared devices, despite growing interest due to a wide\nrange of applications in commercial, public, and academic sectors, are still\nstruggling to achieve significant improvements over well-established\ntechnologies like HgCdTe detectors. Devices based on quantum nanostructures\nremain non competitive due to unresolved drawbacks, the most significant being\nthe need to cool down to liquid nitrogen temperatures to improve the\nsignal-to-noise ratio. In this work, we demonstrate an innovative solution to\nsurpass the current generation of quantum dot-based detectors by exploiting the\nabsorption from quantum dot localized states to resonant states in the\ncontinuum, that is states in the semiconductor conduction band with an enhanced\nprobability density in the quantum dot region. This unprecedented approach\ntakes advantage of the unique properties of such states to massively enhance\ncarrier extraction, allowing to overcome one of the most crucial drawbacks of\nquantum dot-based infrared detectors. This innovative solution is discussed\nhere from both theoretical and experimental perspectives. The measured room\ntemperature operation with high detectivity demonstrates that exploiting\nresonant states absorption in quantum dots offers the long-sought solution for\nthe next generation of infrared photodetectors.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}