{"id":"2407.13989","title":"Enhancing Graph Neural Networks with Limited Labeled Data by Actively\n  Distilling Knowledge from Large Language Models","authors":"Quan Li, Tianxiang Zhao, Lingwei Chen, Junjie Xu, Suhang Wang","authorsParsed":[["Li","Quan",""],["Zhao","Tianxiang",""],["Chen","Lingwei",""],["Xu","Junjie",""],["Wang","Suhang",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 02:34:10 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 02:17:51 GMT"},{"version":"v3","created":"Wed, 4 Sep 2024 17:52:37 GMT"}],"updateDate":"2024-09-05","timestamp":1721356450000,"abstract":"  Graphs are pervasive in the real-world, such as social network analysis,\nbioinformatics, and knowledge graphs. Graph neural networks (GNNs) have great\nability in node classification, a fundamental task on graphs. Unfortunately,\nconventional GNNs still face challenges in scenarios with few labeled nodes,\ndespite the prevalence of few-shot node classification tasks in real-world\napplications. To address this challenge, various approaches have been proposed,\nincluding graph meta-learning, transfer learning, and methods based on Large\nLanguage Models (LLMs). However, traditional meta-learning and transfer\nlearning methods often require prior knowledge from base classes or fail to\nexploit the potential advantages of unlabeled nodes. Meanwhile, LLM-based\nmethods may overlook the zero-shot capabilities of LLMs and rely heavily on the\nquality of generated contexts. In this paper, we propose a novel approach that\nintegrates LLMs and GNNs, leveraging the zero-shot inference and reasoning\ncapabilities of LLMs and employing a Graph-LLM-based active learning paradigm\nto enhance GNNs' performance. Extensive experiments demonstrate the\neffectiveness of our model in improving node classification accuracy with\nconsiderably limited labeled data, surpassing state-of-the-art baselines by\nsignificant margins.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}