{"id":"2407.04726","title":"Data-Driven Prediction and Uncertainty Quantification of PWR\n  Crud-Induced Power Shift Using Convolutional Neural Networks","authors":"Aidan Furlong, Farah Alsafadi, Scott Palmtag, Andrew Godfrey, Xu Wu","authorsParsed":[["Furlong","Aidan",""],["Alsafadi","Farah",""],["Palmtag","Scott",""],["Godfrey","Andrew",""],["Wu","Xu",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 15:04:24 GMT"}],"updateDate":"2024-07-09","timestamp":1719500664000,"abstract":"  The development of Crud-Induced Power Shift (CIPS) is an operational\nchallenge in Pressurized Water Reactors that is due to the development of crud\non the fuel rod cladding. The available predictive tools developed previously,\nusually based on fundamental physics, are computationally expensive and have\nshown differing degrees of accuracy. This work proposes a completely top-down\napproach to predict CIPS instances on an assembly level with reactor-specific\ncalibration built-in. Built using artificial neural networks, this work uses a\nthree-dimensional convolutional approach to leverage the image-like layout of\nthe input data. As a classifier, the convolutional neural network model\npredicts whether a given assembly will experience CIPS as well as the time of\noccurrence during a given cycle. This surrogate model is both trained and\ntested using a combination of calculated core model parameters and measured\nplant data from Unit 1 of the Catawba Nuclear Station. After the evaluation of\nits performance using various metrics, Monte Carlo dropout is employed for\nextensive uncertainty quantification of the model predictions. The results\nindicate that this methodology could be a viable approach in predicting CIPS\nwith an assembly-level resolution across both clean and afflicted cycles, while\nusing limited computational resources.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}