{"id":"2407.17604","title":"Multi-layer anti-reflection coats using ePTFE membrane for mm-wavelength\n  plastic optics","authors":"Miranda Eiben, Keara Carter, Marion Dierickx, Brodi Elwood, Paul\n  Grimes, John Kovac, Matthew Miller, Matthew A. Petroff, Annie Polish, Clara\n  Verg\\`es","authorsParsed":[["Eiben","Miranda",""],["Carter","Keara",""],["Dierickx","Marion",""],["Elwood","Brodi",""],["Grimes","Paul",""],["Kovac","John",""],["Miller","Matthew",""],["Petroff","Matthew A.",""],["Polish","Annie",""],["Vergès","Clara",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 19:27:34 GMT"}],"updateDate":"2024-07-26","timestamp":1721849254000,"abstract":"  Future millimeter wavelength experiments aim to both increase aperture\ndiameters and broaden bandwidths to increase the sensitivity of the receivers.\nThese changes produce a challenging anti-reflection (AR) design problem for\nrefracting and transmissive optics. The higher frequency plastic optics require\nconsistently thin polymer coats across a wide area, while wider bandwidths\nrequire multilayer designs. We present multilayer AR coats for plastic optics\nof the high frequency BICEP Array receiver (200-300 GHz) utilizing an expanded\npolytetrafluoroethylene (ePTFE) membrane, layered and compressively heat-bonded\nto itself. This process allows for a range of densities (from 0.3g/cc to 1g/cc)\nand thicknesses (>0.05mm) over a wide radius (33cm), opening the parameter\nspace of potential AR coats in interesting directions. The layered ePTFE\nmembrane has been combined with other polymer layers to produce band average\nreflections between 0.2% and 0.6% on high density polyethylene and a thin high\nmodulus polyethylene window, respectively.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"R0I0gxBtZfRidEA5xeI8EAazFPiAod6gSOR-RilHRJ4","pdfSize":"4647402","objectId":"0x9576258bf6b8518ae2c58a53672cf1417cedc09b93ca5c2cac595bbed3dac600","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
