{"id":"2407.21492","title":"Bounding adapted Wasserstein metrics","authors":"Jose Blanchet, Martin Larsson, Jonghwa Park, Johannes Wiesel","authorsParsed":[["Blanchet","Jose",""],["Larsson","Martin",""],["Park","Jonghwa",""],["Wiesel","Johannes",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 10:02:52 GMT"}],"updateDate":"2024-08-01","timestamp":1722420172000,"abstract":"  The Wasserstein distance $\\mathcal{W}_p$ is an important instance of an\noptimal transport cost. Its numerous mathematical properties as well as\napplications to various fields such as mathematical finance and statistics have\nbeen well studied in recent years. The adapted Wasserstein distance\n$\\mathcal{A}\\mathcal{W}_p$ extends this theory to laws of discrete time\nstochastic processes in their natural filtrations, making it particularly well\nsuited for analyzing time-dependent stochastic optimization problems.\n  While the topological differences between $\\mathcal{A}\\mathcal{W}_p$ and\n$\\mathcal{W}_p$ are well understood, their differences as metrics remain\nlargely unexplored beyond the trivial bound $\\mathcal{W}_p\\lesssim\n\\mathcal{A}\\mathcal{W}_p$. This paper closes this gap by providing upper bounds\nof $\\mathcal{A}\\mathcal{W}_p$ in terms of $\\mathcal{W}_p$ through investigation\nof the smooth adapted Wasserstein distance. Our upper bounds are explicit and\nare given by a sum of $\\mathcal{W}_p$, Eder's modulus of continuity and a term\ncharacterizing the tail behavior of measures. As a consequence, upper bounds on\n$\\mathcal{W}_p$ automatically hold for $\\mathcal{AW}_p$ under mild regularity\nassumptions on the measures considered. A particular instance of our findings\nis the inequality $\\mathcal{A}\\mathcal{W}_1\\le C\\sqrt{\\mathcal{W}_1}$ on the\nset of measures that have Lipschitz kernels.\n  Our work also reveals how smoothing of measures affects the adapted weak\ntopology. In fact, we find that the topology induced by the smooth adapted\nWasserstein distance exhibits a non-trivial interpolation property, which we\ncharacterize explicitly: it lies in between the adapted weak topology and the\nweak topology, and the inclusion is governed by the decay of the smoothing\nparameter.\n","subjects":["Mathematics/Probability","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}