{"id":"2407.10200","title":"Shape2Scene: 3D Scene Representation Learning Through Pre-training on\n  Shape Data","authors":"Tuo Feng, Wenguan Wang, Ruijie Quan, Yi Yang","authorsParsed":[["Feng","Tuo",""],["Wang","Wenguan",""],["Quan","Ruijie",""],["Yang","Yi",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 13:42:05 GMT"}],"updateDate":"2024-07-16","timestamp":1720964525000,"abstract":"  Current 3D self-supervised learning methods of 3D scenes face a data desert\nissue, resulting from the time-consuming and expensive collecting process of 3D\nscene data. Conversely, 3D shape datasets are easier to collect. Despite this,\nexisting pre-training strategies on shape data offer limited potential for 3D\nscene understanding due to significant disparities in point quantities. To\ntackle these challenges, we propose Shape2Scene (S2S), a novel method that\nlearns representations of large-scale 3D scenes from 3D shape data. We first\ndesign multiscale and high-resolution backbones for shape and scene level 3D\ntasks, i.e., MH-P (point-based) and MH-V (voxel-based). MH-P/V establishes\ndirect paths to highresolution features that capture deep semantic information\nacross multiple scales. This pivotal nature makes them suitable for a wide\nrange of 3D downstream tasks that tightly rely on high-resolution features. We\nthen employ a Shape-to-Scene strategy (S2SS) to amalgamate points from various\nshapes, creating a random pseudo scene (comprising multiple objects) for\ntraining data, mitigating disparities between shapes and scenes. Finally, a\npoint-point contrastive loss (PPC) is applied for the pre-training of MH-P/V.\nIn PPC, the inherent correspondence (i.e., point pairs) is naturally obtained\nin S2SS. Extensive experiments have demonstrated the transferability of 3D\nrepresentations learned by MH-P/V across shape-level and scene-level 3D tasks.\nMH-P achieves notable performance on well-known point cloud datasets (93.8% OA\non ScanObjectNN and 87.6% instance mIoU on ShapeNetPart). MH-V also achieves\npromising performance in 3D semantic segmentation and 3D object detection.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}