{"id":"2407.20825","title":"Precise synchronization of a free-running Rubidium atomic clock with GPS\n  Time for applications in experimental particle physics","authors":"Claire Dalmazzone (1), Mathieu Guigue (1), Lucile Mellet (1 and 2),\n  Boris Popov (1), Stefano Russo (1), Vincent Voisin (1), Michel Abgrall (3),\n  Baptiste Chupin (3), Caroline B. Lim (3), Paul-\\'Eric Pottie (3), Pierre\n  Ulrich (3) ((1) Laboratoire de Physique Nucl\\'eaire et des Hautes \\'Energies,\n  Sorbonne Universit\\'e, CNRS/IN2P3, (2) Now at Michigan State University,\n  Department of Physics and Astronomy, (3) LNE-SYRTE, Observatoire de Paris,\n  Universit\\'e PSL, CNRS, Sorbonne Universit\\'e)","authorsParsed":[["Dalmazzone","Claire","","1 and 2"],["Guigue","Mathieu","","1 and 2"],["Mellet","Lucile","","1 and 2"],["Popov","Boris",""],["Russo","Stefano",""],["Voisin","Vincent",""],["Abgrall","Michel",""],["Chupin","Baptiste",""],["Lim","Caroline B.",""],["Pottie","Paul-Éric",""],["Ulrich","Pierre",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 13:45:32 GMT"},{"version":"v2","created":"Fri, 6 Sep 2024 11:55:38 GMT"}],"updateDate":"2024-09-09","timestamp":1722347132000,"abstract":"  We present results of our study devoted to the development of a time\ncorrection algorithm needed to precisely synchronize a free-running Rubidium\natomic clock with the Coordinated Universal Time (UTC). This R&D is performed\nin view of the Hyper-Kamiokande (HK) experiment currently under construction in\nJapan, which requires a synchronization with UTC and between its different\nexperimental sites with a precision better than $100$ ns. We use a Global\nNavigation Satellite System (GNSS) receiver to compare a PPS and a $10$ MHz\nsignal, generated by a free-running Rubidium clock, to the Global Positioning\nSystem (GPS) Time signal. We use these comparisons to correct the time series\n(time stamps) provided by the Rubidium clock signal. We fit the difference\nbetween Rubidium and GPS Time with polynomial functions of time over a certain\nintegration time window to extract a correction of the Rubidium time stamps in\noffline or online mode. In online mode, the latest fit results are used for the\ncorrection until a new comparison to GPS Time becomes available. We show that\nwith an integration time window of around $10^4$ seconds, we can correct the\ntime stamps drift, caused by the frequency random walk noise and the\ndeterministic frequency drift of the free running Rubidium clock, so that the\ntime difference with respect to GPS Time stays within a $\\pm5$ ns range in both\noffline or online correction mode. Presented results could be of interest for\nother experiments in the field of neutrino physics and multi-messenger\nastrophysics.\n","subjects":["Physics/Instrumentation and Detectors"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}