{"id":"2407.07418","title":"Dynamics of asymmetrically deformed skyrmion driven by internal forces\n  and strain force in a flower-shaped magnetic nanostructure","authors":"Zhen-Yu Tan, Ji-Pei Chen, Yu-Ke Shi, Yuan Chen, Ming-Hui Qin, Xing-Sen\n  Gao and Jun-Ming Liu","authorsParsed":[["Tan","Zhen-Yu",""],["Chen","Ji-Pei",""],["Shi","Yu-Ke",""],["Chen","Yuan",""],["Qin","Ming-Hui",""],["Gao","Xing-Sen",""],["Liu","Jun-Ming",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 07:19:24 GMT"}],"updateDate":"2024-07-11","timestamp":1720595964000,"abstract":"  Magnetic skyrmions emerge as promising quasi-particles for encoding\ninformation in nextgeneration spintronic devices. Their innate flexibility in\nshape is essential for the applications although they were often ideally\ntreated as rigid particles. In this work, we investigated the voltagecontrolled\nuniform strain mediated dynamics of deformed skyrmions in heterostructures with\na flower-shaped magnetic nanostructure, using micromagnetic simulations. The\nsimulated results revealed the possible states of isolated skyrmion nucleated\nin the nanostructure, which can be mutually switched by applying suitable\nin-plane strain pulses. In addition, it was found that the skyrmion motions are\ndriven by the emerging internal forces and strain force, which originate from\nthe asymmetric deformation of skyrmion structures. Furthermore, an analytical\nmodel of deformed skyrmions was proposed to interpret the dependences of\ninternal forces and strain force on the asymmetric deformation of skyrmion,\nwith some formulae derived for these forces in a semi-analytical approach.\nFurther calculations based on these formulae verified the forces appearing in\nthe skyrmion motion, with the resulting forces showing consistence with the\nsimulated data. This suggested that our semi-analytical model successfully\ncaptures the main physics responsible for the motion of deformed skyrmion in\nthe nanostructure. Our work extends the understanding of the mechanics emerging\nin deformed skyrmion, and provides an effective approach for deterministic\nmanipulation of deformed skyrmion motion via strain forces and internal forces,\nwhich may be instructive to design of skyrmion-based spintronic devices.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}