{"id":"2407.07347","title":"MNeRV: A Multilayer Neural Representation for Videos","authors":"Qingling Chang, Haohui Yu, Shuxuan Fu, Zhiqiang Zeng and Chuangquan\n  Chen","authorsParsed":[["Chang","Qingling",""],["Yu","Haohui",""],["Fu","Shuxuan",""],["Zeng","Zhiqiang",""],["Chen","Chuangquan",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 03:57:29 GMT"}],"updateDate":"2024-07-11","timestamp":1720583849000,"abstract":"  As a novel video representation method, Neural Representations for Videos\n(NeRV) has shown great potential in the fields of video compression, video\nrestoration, and video interpolation. In the process of representing videos\nusing NeRV, each frame corresponds to an embedding, which is then reconstructed\ninto a video frame sequence after passing through a small number of decoding\nlayers (E-NeRV, HNeRV, etc.). However, this small number of decoding layers can\neasily lead to the problem of redundant model parameters due to the large\nproportion of parameters in a single decoding layer, which greatly restricts\nthe video regression ability of neural network models. In this paper, we\npropose a multilayer neural representation for videos (MNeRV) and design a new\ndecoder M-Decoder and its matching encoder M-Encoder. MNeRV has more encoding\nand decoding layers, which effectively alleviates the problem of redundant\nmodel parameters caused by too few layers. In addition, we design MNeRV blocks\nto perform more uniform and effective parameter allocation between decoding\nlayers. In the field of video regression reconstruction, we achieve better\nreconstruction quality (+4.06 PSNR) with fewer parameters. Finally, we showcase\nMNeRV performance in downstream tasks such as video restoration and video\ninterpolation. The source code of MNeRV is available at\nhttps://github.com/Aaronbtb/MNeRV.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}