{"id":"2407.11968","title":"mochi_class: Modelling Optimisation to Compute Horndeski In class","authors":"Matteo Cataneo and Emilio Bellini","authorsParsed":[["Cataneo","Matteo",""],["Bellini","Emilio",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 17:59:51 GMT"},{"version":"v2","created":"Fri, 6 Sep 2024 08:24:03 GMT"}],"updateDate":"2024-09-10","timestamp":1721152791000,"abstract":"  We introduce mochi_class, an extension of the Einstein-Boltzmann solver\nhi_class, designed to unlock the full phenomenological potential of Horndeski\ngravity. This extension allows for general input functions of time without the\nneed for hard-coded parametrisations or covariant Lagrangians. By replacing the\ntraditional $\\alpha$-parametrisation with a set of stable basis functions,\nmochi_class ensures that the resulting effective theories are inherently free\nfrom gradient and ghost instabilities. Additionally, mochi_class features a\nquasi-static approximation implemented at the level of modified metric\npotentials, enhancing prediction accuracy, especially for models transitioning\nbetween a super- and sub-Compton regime. mochi_class can robustly handle a wide\nrange of models without fine-tuning, and introduces a new approximation scheme\nthat activates modifications to the standard cosmology deep in the\nmatter-dominated era. Furthermore, it incorporates viability conditions on the\nequation of motion for the scalar field fluctuations, aiding in the\nidentification of numerical instabilities. Through comprehensive validation\nagainst other Einstein-Boltzmann solvers, mochi_class demonstrates excellent\nperformance and accuracy, broadening the scope of hi_class by facilitating the\nstudy of specific modified gravity models and enabling exploration of\npreviously inaccessible regions of the Horndeski landscape. The code is\npublicly available at https://github.com/mcataneo/mochi_class_public\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rw6RI6SQ6yMPWXfKnz1H62TYUlr-GYzNiKHdm5NTuVA","pdfSize":"1945095","objectId":"0x76e69886108917f10e31a70df5f069fabddb99b532999fe9cb245b0136174f0e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
