{"id":"2407.20078","title":"Background Semantics Matter: Cross-Task Feature Exchange Network for\n  Clustered Infrared Small Target Detection With Sky-Annotated Dataset","authors":"Yimian Dai and Mengxuan Xiao and Yiming Zhu and Huan Wang and Kehua\n  Guo and Jian Yang","authorsParsed":[["Dai","Yimian",""],["Xiao","Mengxuan",""],["Zhu","Yiming",""],["Wang","Huan",""],["Guo","Kehua",""],["Yang","Jian",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 15:03:27 GMT"}],"updateDate":"2024-07-30","timestamp":1722265407000,"abstract":"  Infrared small target detection poses unique challenges due to the scarcity\nof intrinsic target features and the abundance of similar background\ndistractors. We argue that background semantics play a pivotal role in\ndistinguishing visually similar objects for this task. To address this, we\nintroduce a new task -- clustered infrared small target detection, and present\nDenseSIRST, a novel benchmark dataset that provides per-pixel semantic\nannotations for background regions, enabling the transition from sparse to\ndense target detection. Leveraging this dataset, we propose the\nBackground-Aware Feature Exchange Network (BAFE-Net), which transforms the\ndetection paradigm from a single task focused on the foreground to a multi-task\narchitecture that jointly performs target detection and background semantic\nsegmentation. BAFE-Net introduces a cross-task feature hard-exchange mechanism\nto embed target and background semantics between the two tasks. Furthermore, we\npropose the Background-Aware Gaussian Copy-Paste (BAG-CP) method, which\nselectively pastes small targets into sky regions during training, avoiding the\ncreation of false alarm targets in complex non-sky backgrounds. Extensive\nexperiments validate the effectiveness of BAG-CP and BAFE-Net in improving\ntarget detection accuracy while reducing false alarms. The DenseSIRST dataset,\ncode, and trained models are available at https://github.com/GrokCV/BAFE-Net.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}