{"id":"2407.17065","title":"PatchFinder: A Two-Phase Approach to Security Patch Tracing for\n  Disclosed Vulnerabilities in Open-Source Software","authors":"Kaixuan Li, Jian Zhang, Sen Chen, Han Liu, Yang Liu, Yixiang Chen","authorsParsed":[["Li","Kaixuan",""],["Zhang","Jian",""],["Chen","Sen",""],["Liu","Han",""],["Liu","Yang",""],["Chen","Yixiang",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 07:46:24 GMT"}],"updateDate":"2024-07-25","timestamp":1721807184000,"abstract":"  Open-source software (OSS) vulnerabilities are increasingly prevalent,\nemphasizing the importance of security patches. However, in widely used\nsecurity platforms like NVD, a substantial number of CVE records still lack\ntrace links to patches. Although rank-based approaches have been proposed for\nsecurity patch tracing, they heavily rely on handcrafted features in a\nsingle-step framework, which limits their effectiveness. In this paper, we\npropose PatchFinder, a two-phase framework with end-to-end correlation learning\nfor better-tracing security patches. In the **initial retrieval** phase, we\nemploy a hybrid patch retriever to account for both lexical and semantic\nmatching based on the code changes and the description of a CVE, to narrow down\nthe search space by extracting those commits as candidates that are similar to\nthe CVE descriptions. Afterwards, in the **re-ranking** phase, we design an\nend-to-end architecture under the supervised fine-tuning paradigm for learning\nthe semantic correlations between CVE descriptions and commits. In this way, we\ncan automatically rank the candidates based on their correlation scores while\nmaintaining low computation overhead. We evaluated our system against 4,789\nCVEs from 532 OSS projects. The results are highly promising: PatchFinder\nachieves a Recall@10 of 80.63% and a Mean Reciprocal Rank (MRR) of 0.7951.\nMoreover, the Manual Effort@10 required is curtailed to 2.77, marking a 1.94\ntimes improvement over current leading methods. When applying PatchFinder in\npractice, we initially identified 533 patch commits and submitted them to the\nofficial, 482 of which have been confirmed by CVE Numbering Authorities.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}