{"id":"2407.14880","title":"A New Dataset and Framework for Real-World Blurred Images\n  Super-Resolution","authors":"Rui Qin, Ming Sun, Chao Zhou, Bin Wang","authorsParsed":[["Qin","Rui",""],["Sun","Ming",""],["Zhou","Chao",""],["Wang","Bin",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 14:07:03 GMT"}],"updateDate":"2024-07-23","timestamp":1721484423000,"abstract":"  Recent Blind Image Super-Resolution (BSR) methods have shown proficiency in\ngeneral images. However, we find that the efficacy of recent methods obviously\ndiminishes when employed on image data with blur, while image data with\nintentional blur constitute a substantial proportion of general data. To\nfurther investigate and address this issue, we developed a new super-resolution\ndataset specifically tailored for blur images, named the Real-world Blur-kept\nSuper-Resolution (ReBlurSR) dataset, which consists of nearly 3000 defocus and\nmotion blur image samples with diverse blur sizes and varying blur intensities.\nFurthermore, we propose a new BSR framework for blur images called\nPerceptual-Blur-adaptive Super-Resolution (PBaSR), which comprises two main\nmodules: the Cross Disentanglement Module (CDM) and the Cross Fusion Module\n(CFM). The CDM utilizes a dual-branch parallelism to isolate conflicting blur\nand general data during optimization. The CFM fuses the well-optimized prior\nfrom these distinct domains cost-effectively and efficiently based on model\ninterpolation. By integrating these two modules, PBaSR achieves commendable\nperformance on both general and blur data without any additional inference and\ndeployment cost and is generalizable across multiple model architectures. Rich\nexperiments show that PBaSR achieves state-of-the-art performance across\nvarious metrics without incurring extra inference costs. Within the widely\nadopted LPIPS metrics, PBaSR achieves an improvement range of approximately\n0.02-0.10 with diverse anchor methods and blur types, across both the ReBlurSR\nand multiple common general BSR benchmarks. Code here:\nhttps://github.com/Imalne/PBaSR.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}