{"id":"2407.04292","title":"Corki: Enabling Real-time Embodied AI Robots via Algorithm-Architecture\n  Co-Design","authors":"Yiyang Huang, Yuhui Hao, Bo Yu, Feng Yan, Yuxin Yang, Feng Min, Yinhe\n  Han, Lin Ma, Shaoshan Liu, Qiang Liu, Yiming Gan","authorsParsed":[["Huang","Yiyang",""],["Hao","Yuhui",""],["Yu","Bo",""],["Yan","Feng",""],["Yang","Yuxin",""],["Min","Feng",""],["Han","Yinhe",""],["Ma","Lin",""],["Liu","Shaoshan",""],["Liu","Qiang",""],["Gan","Yiming",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 06:54:26 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 13:15:21 GMT"},{"version":"v3","created":"Fri, 2 Aug 2024 01:59:22 GMT"}],"updateDate":"2024-08-05","timestamp":1720162466000,"abstract":"  Embodied AI robots have the potential to fundamentally improve the way human\nbeings live and manufacture. Continued progress in the burgeoning field of\nusing large language models to control robots depends critically on an\nefficient computing substrate. In particular, today's computing systems for\nembodied AI robots are designed purely based on the interest of algorithm\ndevelopers, where robot actions are divided into a discrete frame-basis. Such\nan execution pipeline creates high latency and energy consumption. This paper\nproposes Corki, an algorithm-architecture co-design framework for real-time\nembodied AI robot control. Our idea is to decouple LLM inference, robotic\ncontrol and data communication in the embodied AI robots compute pipeline.\nInstead of predicting action for one single frame, Corki predicts the\ntrajectory for the near future to reduce the frequency of LLM inference. The\nalgorithm is coupled with a hardware that accelerates transforming trajectory\ninto actual torque signals used to control robots and an execution pipeline\nthat parallels data communication with computation. Corki largely reduces LLM\ninference frequency by up to 8.0x, resulting in up to 3.6x speed up. The\nsuccess rate improvement can be up to 17.3%. Code is provided for\nre-implementation. https://github.com/hyy0613/Corki\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}