{"id":"2407.12112","title":"A Benchmark for Fairness-Aware Graph Learning","authors":"Yushun Dong, Song Wang, Zhenyu Lei, Zaiyi Zheng, Jing Ma, Chen Chen,\n  Jundong Li","authorsParsed":[["Dong","Yushun",""],["Wang","Song",""],["Lei","Zhenyu",""],["Zheng","Zaiyi",""],["Ma","Jing",""],["Chen","Chen",""],["Li","Jundong",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 18:43:43 GMT"}],"updateDate":"2024-07-18","timestamp":1721155423000,"abstract":"  Fairness-aware graph learning has gained increasing attention in recent\nyears. Nevertheless, there lacks a comprehensive benchmark to evaluate and\ncompare different fairness-aware graph learning methods, which blocks\npractitioners from choosing appropriate ones for broader real-world\napplications. In this paper, we present an extensive benchmark on ten\nrepresentative fairness-aware graph learning methods. Specifically, we design a\nsystematic evaluation protocol and conduct experiments on seven real-world\ndatasets to evaluate these methods from multiple perspectives, including group\nfairness, individual fairness, the balance between different fairness criteria,\nand computational efficiency. Our in-depth analysis reveals key insights into\nthe strengths and limitations of existing methods. Additionally, we provide\npractical guidance for applying fairness-aware graph learning methods in\napplications. To the best of our knowledge, this work serves as an initial step\ntowards comprehensively understanding representative fairness-aware graph\nlearning methods to facilitate future advancements in this area.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computers and Society","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wRbdxyg4SO46A6nrGxcwB1fxeLUvarUwTW0UvohhtwQ","pdfSize":"973049","objectId":"0x80e97800f51fda8149048d41d4a003f39536652e49aeb99bf8caba87f76173dd","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
