{"id":"2407.06074","title":"Quantum decoherence dynamics in stochastically fluctuating environments","authors":"Xiangji Cai, Yanyan Feng, Jing Ren, Yonggang Peng and Yujun Zheng","authorsParsed":[["Cai","Xiangji",""],["Feng","Yanyan",""],["Ren","Jing",""],["Peng","Yonggang",""],["Zheng","Yujun",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 16:15:21 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 00:43:21 GMT"}],"updateDate":"2024-07-26","timestamp":1720455321000,"abstract":"  We theoretically study the decoherence of a two-level quantum system coupled\nto noisy environments exhibiting linear and quadratic fluctuations within the\nframework of a stochastic Liouville equation. It is shown that the intrinsic\nenergy levels of the quantum system renormalize under either the linear or\nquadratic influence of the environmental noise. In the case of quadratic\ndependence, the renormalization of the energy levels of the system emerges even\nif the environmental noise exhibits stationary statistical properties. This is\nin contrast to the case under linear influence, where the intrinsic energy\nlevels of the system renormalize only if the environmental noise displays\nnonstationary statistics. We derive the analytical expressions of the\ndecoherence function in the cases where the fluctuation of the frequency\ndifference depends linearly and quadratically on the nonstationary\nOrnstein-Uhlenbeck noise (OUN) and random telegraph noise (RTN) processes,\nrespectively. In the case of the linear dependence of the OUN, the\nenvironmental nonstationary statistical property can enhance the dynamical\ndecoherence. However, the nonstationary statistics of the environmental noise\ncan suppress the quantum decoherence in this case under the quadratic influence\nof the OUN. In the presence of the RTN, the quadratic influence of the\nenvironmental noise does not give rise to decoherence but only causes a\ndeterminate frequency renormalization in dynamical evolution. The environmental\nnonstationary statistical property can suppress the quantum decoherence of the\ncase under the linear influence of the RTN.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}