{"id":"2407.00149","title":"Tidal Disruption of a Star on a Nearly Circular Orbit","authors":"Itai Linial and Eliot Quataert","authorsParsed":[["Linial","Itai",""],["Quataert","Eliot",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 18:00:00 GMT"}],"updateDate":"2024-07-02","timestamp":1719597600000,"abstract":"  We consider Roche lobe overflow (RLO) from a low-mass star on a nearly\ncircular orbit, onto a supermassive black hole (SMBH). If mass transfer is\nunstable, its rate accelerates in a runaway process, resulting in highly\nsuper-Eddington mass accretion rates, accompanied by an optically-thick outflow\nemanating from the SMBH vicinity. This produces a week-month long, bright\noptical/Ultraviolet flare, accompanied by a year-decade long X-ray precursor\nand post-cursor emitted from the accretion flow onto the SMBH. Such ``Circular\nTidal Disruption Events (TDEs)\" represent a new class of nuclear transients,\noccurring at up to $1-10\\%$ of the canonical parabolic tidal disruption event\nrate. Near breakup rotation and strong tidal deformation of the star prior to\ndisruption could lead to strong magnetic fields, making circular-TDEs possible\nprogenitors of jetted TDEs. Outflows prior to the final stellar disruption\nproduce a circum-nuclear environment (CNM) with $\\sim \\rm 10^{-2} \\, M_\\odot$\nat distances of $\\sim 0.01-0.1 \\, \\rm pc$, likely leading to bright radio\nemission, and also similar to the CNM inferred for jetted TDEs. We discuss\nbroader connections between circular TDEs and other recently identified classes\nof transients associated with galactic nuclei, such as repeating-TDEs and\nQuasi-Periodic X-ray Eruptions, as well as possible connections to luminous\nfast blue optical transients such as AT2018cow. We also discuss observational\nsignatures of the analogous RLO of a white dwarf around an intermediate mass\nBH, which may be a multi-messenger source in the LISA era.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}