{"id":"2407.11753","title":"A Channel Attention-Driven Hybrid CNN Framework for Paddy Leaf Disease\n  Detection","authors":"Pandiyaraju V, Shravan Venkatraman, Abeshek A, Pavan Kumar S,\n  Aravintakshan S A, Senthil Kumar A M, Kannan A","authorsParsed":[["V","Pandiyaraju",""],["Venkatraman","Shravan",""],["A","Abeshek",""],["S","Pavan Kumar",""],["A","Aravintakshan S",""],["M","Senthil Kumar A",""],["A","Kannan",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 14:17:26 GMT"}],"updateDate":"2024-07-17","timestamp":1721139446000,"abstract":"  Farmers face various challenges when it comes to identifying diseases in rice\nleaves during their early stages of growth, which is a major reason for poor\nproduce. Therefore, early and accurate disease identification is important in\nagriculture to avoid crop loss and improve cultivation. In this research, we\npropose a novel hybrid deep learning (DL) classifier designed by extending the\nSqueeze-and-Excitation network architecture with a channel attention mechanism\nand the Swish ReLU activation function. The channel attention mechanism in our\nproposed model identifies the most important feature channels required for\nclassification during feature extraction and selection. The dying ReLU problem\nis mitigated by utilizing the Swish ReLU activation function, and the\nSqueeze-andExcitation blocks improve information propagation and cross-channel\ninteraction. Upon evaluation, our model achieved a high F1-score of 99.76% and\nan accuracy of 99.74%, surpassing the performance of existing models. These\noutcomes demonstrate the potential of state-of-the-art DL techniques in\nagriculture, contributing to the advancement of more efficient and reliable\ndisease detection systems.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}