{"id":"2407.20507","title":"Neutrino Oscillation Effects on the Luminosity of Neutrino-Dominated\n  Accretion Flows Around Black Holes","authors":"Chitipat Deesamer, Poemwai Chainakun, Warintorn Sreethawong","authorsParsed":[["Deesamer","Chitipat",""],["Chainakun","Poemwai",""],["Sreethawong","Warintorn",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 02:52:01 GMT"}],"updateDate":"2024-07-31","timestamp":1722307921000,"abstract":"  The stellar-mass black hole surrounded by the neutrino-dominated accretion\nflow (NDAF) is proposed to be the central engine of the gamma-ray burst (GRB).\nIn this work, we investigate the neutrino/anti-neutrino luminosity and\nannihilation luminosity from the NDAF and pair-annihilation model, taking into\naccount the neutrino oscillation above the accretion disk. The disk\nhydrodynamical properties are modelled using the empirical solution previously\nderived with boundary conditions including the effect of electron degeneracy\nand neutrino trapping. Our key parameters are the mass accretion rate and the\nblack hole spin given in the range of $\\dot{M} = 0.1$ - $10$ $M_\\odot$ s$^{-1}$\nand $ 0 \\le a < 1$, respectively. Without neutrino oscillation, the obtained\nneutrino/anti-neutrino luminosity is $\\sim 10^{51}$ - $10^{53}$ $\\textrm{erg\ns}^{-1}$, while the neutrino annihilation luminosity is found to be $\\sim\n10^{46}$ - $10^{51}$ $\\textrm{erg s}^{-1}$. In the presence of neutrino\noscillation in the vacuum limit, the electron neutrino annihilation luminosity\ndecreases by $\\lesssim 22\\%$ through the flavor transformation, while the muon-\nand tau-neutrino luminosity can increase up to $\\sim 45\\%$ and $ 60\\%$,\nrespectively. As a result, the total annihilation luminosity can be reduced up\nto $\\sim 19\\%$ due to the oscillation process above the disk. Finally, we also\ninvestigate the case whereby the CP-violating phase is changed from $\\delta\n\\textrm{CP} =$ $0^{\\circ}$ to $245^{\\circ}$. However, our results reveal that\nthe CP-violating phase has minimal impact on neutrino annihilation luminosity.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}