{"id":"2407.01251","title":"QUEEN: Query Unlearning against Model Extraction","authors":"Huajie Chen, Tianqing Zhu, Lefeng Zhang, Bo Liu, Derui Wang, Wanlei\n  Zhou, Minhui Xue","authorsParsed":[["Chen","Huajie",""],["Zhu","Tianqing",""],["Zhang","Lefeng",""],["Liu","Bo",""],["Wang","Derui",""],["Zhou","Wanlei",""],["Xue","Minhui",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:01:41 GMT"}],"updateDate":"2024-07-02","timestamp":1719838901000,"abstract":"  Model extraction attacks currently pose a non-negligible threat to the\nsecurity and privacy of deep learning models. By querying the model with a\nsmall dataset and usingthe query results as the ground-truth labels, an\nadversary can steal a piracy model with performance comparable to the original\nmodel. Two key issues that cause the threat are, on the one hand, accurate and\nunlimited queries can be obtained by the adversary; on the other hand, the\nadversary can aggregate the query results to train the model step by step. The\nexisting defenses usually employ model watermarking or fingerprinting to\nprotect the ownership. However, these methods cannot proactively prevent the\nviolation from happening. To mitigate the threat, we propose QUEEN (QUEry\nunlEarNing) that proactively launches counterattacks on potential model\nextraction attacks from the very beginning. To limit the potential threat,\nQUEEN has sensitivity measurement and outputs perturbation that prevents the\nadversary from training a piracy model with high performance. In sensitivity\nmeasurement, QUEEN measures the single query sensitivity by its distance from\nthe center of its cluster in the feature space. To reduce the learning accuracy\nof attacks, for the highly sensitive query batch, QUEEN applies query\nunlearning, which is implemented by gradient reverse to perturb the softmax\noutput such that the piracy model will generate reverse gradients to worsen its\nperformance unconsciously. Experiments show that QUEEN outperforms the\nstate-of-the-art defenses against various model extraction attacks with a\nrelatively low cost to the model accuracy. The artifact is publicly available\nat https://anonymous.4open.science/r/queen implementation-5408/.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"B4DKsDbMdnObcvUTbNZ4lIbRvxlHwmOHehsrwFPMci4","pdfSize":"2261766","objectId":"0x89bddafa07ffded7029ffcf2f3ef15bd40d3f6be210b414d78239dc8ddbe4a3b","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
