{"id":"2407.04499","title":"Mapping Cardinality-based Feature Models to Weighted Automata over\n  Featured Multiset Semirings (Extended Version)","authors":"Robert M\\\"uller and Mathis Wei{\\ss} and Malte Lochau","authorsParsed":[["Müller","Robert",""],["Weiß","Mathis",""],["Lochau","Malte",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 13:40:25 GMT"}],"updateDate":"2024-07-08","timestamp":1720186825000,"abstract":"  Cardinality-based feature models permit to select multiple copies of the same\nfeature, thus generalizing the notion of product configurations from subsets of\nBoolean features to multisets of feature instances. This increased\nexpressiveness shapes a-priori infinite and non-convex configuration spaces,\nwhich renders established solution-space mappings based on Boolean presence\nconditions insufficient for cardinality-based feature models. To address this\nissue, we propose weighted automata over featured multiset semirings as a novel\nbehavioral variability modeling formalism for cardinality-based feature models.\nThe formalism uses multisets over features as a predefined semantic domain for\ntransition weights. It permits to use any algebraic structure forming a proper\nsemiring on multisets to aggregate the weights traversed along paths to map\naccepted words to multiset configurations. In particular, tropical semirings\nconstitute a promising sub-class with a reasonable trade-off between\nexpressiveness and computational tractability of canonical analysis problems.\nThe formalism is strictly more expressive than featured transition systems, as\nit enables upper-bound multiplicity constraints depending on the length of\nwords. We provide a tool implementation of the behavioral variability model and\npresent preliminary experimental results showing applicability and\ncomputational feasibility of the proposed approach.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}