{"id":"2407.14395","title":"Outflow Driven by a Protoplanet Embedded in the TW Hya Disk","authors":"Tomohiro C. Yoshida, Hideko Nomura, Charles J. Law, Richard Teague,\n  Yuhito Shibaike, Kenji Furuya, and Takashi Tsukagoshi","authorsParsed":[["Yoshida","Tomohiro C.",""],["Nomura","Hideko",""],["Law","Charles J.",""],["Teague","Richard",""],["Shibaike","Yuhito",""],["Furuya","Kenji",""],["Tsukagoshi","Takashi",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:16:28 GMT"}],"updateDate":"2024-07-22","timestamp":1721402188000,"abstract":"  Gas giant planets are formed by gas accretion onto planetary cores in\nprotoplanetary disks. However, direct evidence of this process is still\nlacking, limiting our understanding of planetary formation processes. During\nmass accretion, planet-driven outflows may be launched, which could be\nobservable by shock tracers such as sulfur monoxide (SO). We report the\ndetection of SO gas in the protoplanetary disk around TW Hya in archival\nAtacama Large Millimeter/sub-millimeter Array (ALMA) observations. The $\\rm SO\\\nJ=8_7 - 7_6\\ $ emission line is detected at a $6\\sigma$ significance and\nlocalized to the southeast region of the disk with an arc-like morphology. The\nline center is red-shifted with respect to the systemic velocity by $\\sim5\\ \\rm\nkm\\ s^{-1}$. The starting point of the SO emission is located at a\nplanet-carved dust gap at $42$ au. We attribute this to an outflow driven by an\nembedded protoplanet. Indeed, the observed morphology is well reproduced by a\nballistic outflow model. The outflow velocity suggests that the outflow\nlaunching source has a mass of $\\sim 4 M_\\oplus\\ (0.012 M_{\\rm Jup})$ and the\nmass-loss rate is $3\\times10^{-8} - 1\\times10^{-6}\\ M_{\\rm Jup}\\ {\\rm\nyr^{-1}}$. With the relation of mass-loss and mass-accretion rates established\nfor protostars, we estimated the mass-accretion rate onto the protoplanet to be\n$3\\times10^{-7} - 1\\times10^{-5}\\ M_{\\rm Jup}\\ {\\rm yr^{-1}}$, which matches\ntheoretical predictions for a $\\sim 4 M_\\oplus$ planet at this separation. The\ndetection of planet-driven outflow provides us a unique opportunity to directly\nprobe the earliest phase of gas giant planet formation.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}