{"id":"2407.04760","title":"SPINEX: Similarity-based Predictions with Explainable Neighbors\n  Exploration for Anomaly and Outlier Detection","authors":"MZ Naser, Ahmed Z Naser","authorsParsed":[["Naser","MZ",""],["Naser","Ahmed Z",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 17:42:09 GMT"}],"updateDate":"2024-07-09","timestamp":1720201329000,"abstract":"  This paper presents a novel anomaly and outlier detection algorithm from the\nSPINEX (Similarity-based Predictions with Explainable Neighbors Exploration)\nfamily. This algorithm leverages the concept of similarity and higher-order\ninteractions across multiple subspaces to identify outliers. A comprehensive\nset of experiments was conducted to evaluate the performance of SPINEX. This\nalgorithm was examined against 21 commonly used anomaly detection algorithms,\nnamely, namely, Angle-Based Outlier Detection (ABOD), Connectivity-Based\nOutlier Factor (COF), Copula-Based Outlier Detection (COPOD), ECOD, Elliptic\nEnvelope (EE), Feature Bagging with KNN, Gaussian Mixture Models (GMM),\nHistogram-based Outlier Score (HBOS), Isolation Forest (IF), Isolation Neural\nNetwork Ensemble (INNE), Kernel Density Estimation (KDE), K-Nearest Neighbors\n(KNN), Lightweight Online Detector of Anomalies (LODA), Linear Model\nDeviation-based Detector (LMDD), Local Outlier Factor (LOF), Minimum Covariance\nDeterminant (MCD), One-Class SVM (OCSVM), Quadratic MCD (QMCD), Robust\nCovariance (RC), Stochastic Outlier Selection (SOS), and Subspace Outlier\nDetection (SOD), and across 39 synthetic and real datasets from various domains\nand of a variety of dimensions and complexities. Furthermore, a complexity\nanalysis was carried out to examine the complexity of the proposed algorithm.\nOur results demonstrate that SPINEX achieves superior performance, outperforms\ncommonly used anomaly detection algorithms, and has moderate complexity (e.g.,\nO(n log n d)). More specifically, SPINEX was found to rank at the top of\nalgorithms on the synthetic datasets and the 7th on the real datasets. Finally,\na demonstration of the explainability capabilities of SPINEX, along with future\nresearch needs, is presented.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}