{"id":"2407.10186","title":"Toward Explainable Reasoning in 6G: A Proof of Concept Study on Radio\n  Resource Allocation","authors":"Farhad Rezazadeh, Sergio Barrachina-Mu\\~noz, Hatim Chergui, Josep\n  Mangues, Mehdi Bennis, Dusit Niyato, Houbing Song, and Lingjia Liu","authorsParsed":[["Rezazadeh","Farhad",""],["Barrachina-Muñoz","Sergio",""],["Chergui","Hatim",""],["Mangues","Josep",""],["Bennis","Mehdi",""],["Niyato","Dusit",""],["Song","Houbing",""],["Liu","Lingjia",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 13:09:49 GMT"},{"version":"v2","created":"Thu, 19 Sep 2024 12:17:49 GMT"}],"updateDate":"2024-09-20","timestamp":1720962589000,"abstract":"  The move toward artificial intelligence (AI)-native sixth-generation (6G)\nnetworks has put more emphasis on the importance of explainability and\ntrustworthiness in network management operations, especially for\nmission-critical use-cases. Such desired trust transcends traditional post-hoc\nexplainable AI (XAI) methods to using contextual explanations for guiding the\nlearning process in an in-hoc way. This paper proposes a novel graph\nreinforcement learning (GRL) framework named TANGO which relies on a symbolic\nsubsystem. It consists of a Bayesian-graph neural network (GNN) Explainer,\nwhose outputs, in terms of edge/node importance and uncertainty, are\nperiodically translated to a logical GRL reward function. This adjustment is\naccomplished through defined symbolic reasoning rules within a Reasoner.\nConsidering a real-world testbed proof-of-concept (PoC), a gNodeB (gNB) radio\nresource allocation problem is formulated, which aims to minimize under- and\nover-provisioning of physical resource blocks (PRBs) while penalizing decisions\nemanating from the uncertain and less important edge-nodes relations. Our\nfindings reveal that the proposed in-hoc explainability solution significantly\nexpedites convergence compared to standard GRL baseline and other benchmarks in\nthe deep reinforcement learning (DRL) domain. The experiment evaluates\nperformance in AI, complexity, energy consumption, robustness, network,\nscalability, and explainability metrics. Specifically, the results show that\nTANGO achieves a noteworthy accuracy of 96.39% in terms of optimal PRB\nallocation in inference phase, outperforming the baseline by 1.22x.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}