{"id":"2407.19623","title":"Characterisation of SATCOM Networks for Rapid Message Delivery: Early\n  In-Orbit Results","authors":"Robert Mearns, Airlie Chapman, Michele Trenti","authorsParsed":[["Mearns","Robert",""],["Chapman","Airlie",""],["Trenti","Michele",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 01:00:51 GMT"}],"updateDate":"2024-07-30","timestamp":1722214851000,"abstract":"  Traditional nanosatellite communication links rely on infrequent\nground-station access windows. While this is well suited to both payload data\nand detailed scheduling information, the resulting long periods without contact\nare ill-suited for both opportunistic tasking of satellites and triggers\ngenerated by autonomous operations. Existing orbital infrastructure in the form\nof satellite communication (SATCOM) networks, such as Iridium and others\nprovide a readily available and cost effective solution to this problem. While\nthese networks continue to be utilized onboard nanosatellites, a full\ncharacterization of their utility and performance in-orbit is vital to\nunderstand the reliability and potential for high-timeliness message delivery.\nThe SpIRIT 6U nanosatellite is a mission led by The University of Melbourne in\ncooperation with the Italian Space Agency and supported by the Australian Space\nAgency. Developed over the last four years and launched in a 510km Polar Sun\nSynchronous Orbit in late 2023, SpIRIT carries multiple subsystems for\nscientific and technology demonstration. The Mercury subsystem provides a\ndemonstration and characterization test bed for SATCOM utilization in-orbit,\nwhile also providing the capability of rapid down-link of detection events\ngenerated by the main scientific payload of the mission, the HERMES instrument\nfor the detection of high-energy astrophysical transients. This paper first\npresents a brief payload characterization experiment overview. Early in-orbit\nresults are then presented. This work not only sheds light on the utility of\nthese networks for autonomous operations, and on their potential impact to\nenable greater utilization of nanosatellites for scientific missions, but also\noffers insights into the practical challenges related to the design and\nimplementation of utilizing these networks in-orbit.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}