{"id":"2407.01308","title":"Active Sensing Strategy: Multi-Modal, Multi-Robot Source Localization\n  and Mapping in Real-World Settings with Fixed One-Way Switching","authors":"Vu Phi Tran, Asanka G. Perera, Matthew A. Garratt, Kathryn Kasmarik,\n  Sreenatha G. Anavatti","authorsParsed":[["Tran","Vu Phi",""],["Perera","Asanka G.",""],["Garratt","Matthew A.",""],["Kasmarik","Kathryn",""],["Anavatti","Sreenatha G.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 14:12:23 GMT"}],"updateDate":"2024-07-02","timestamp":1719843143000,"abstract":"  This paper introduces a state-machine model for a multi-modal, multi-robot\nenvironmental sensing algorithm tailored to dynamic real-world settings. The\nalgorithm uniquely combines two exploration strategies for gas source\nlocalization and mapping: (1) an initial exploration phase using multi-robot\ncoverage path planning with variable formations for early gas field indication;\nand (2) a subsequent active sensing phase employing multi-robot swarms for\nprecise field estimation. The state machine governs the transition between\nthese two phases. During exploration, a coverage path maximizes the visited\narea while measuring gas concentration and estimating the initial gas field at\npredefined sample times. In the active sensing phase, mobile robots in a swarm\ncollaborate to select the next measurement point, ensuring coordinated and\nefficient sensing. System validation involves hardware-in-the-loop experiments\nand real-time tests with a radio source emulating a gas field. The approach is\nbenchmarked against state-of-the-art single-mode active sensing and gas source\nlocalization techniques. Evaluation highlights the multi-modal switching\napproach's ability to expedite convergence, navigate obstacles in dynamic\nenvironments, and significantly enhance gas source location accuracy. The\nfindings show a 43% reduction in turnaround time, a 50% increase in estimation\naccuracy, and improved robustness of multi-robot environmental sensing in\ncluttered scenarios without collisions, surpassing the performance of\nconventional active sensing strategies.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"MLhLsm-KNC8e7TxcIBtvlC4Xotd74Kl490gWjOWf3EI","pdfSize":"7027373"}
