{"id":"2407.21456","title":"A Ball Divergence Based Measure For Conditional Independence Testing","authors":"Bilol Banerjee, Bhaswar B. Bhattacharya and Anil K. Ghosh","authorsParsed":[["Banerjee","Bilol",""],["Bhattacharya","Bhaswar B.",""],["Ghosh","Anil K.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 09:08:48 GMT"}],"updateDate":"2024-08-01","timestamp":1722416928000,"abstract":"  In this paper we introduce a new measure of conditional dependence between\ntwo random vectors ${\\boldsymbol X}$ and ${\\boldsymbol Y}$ given another random\nvector $\\boldsymbol Z$ using the ball divergence. Our measure characterizes\nconditional independence and does not require any moment assumptions. We\npropose a consistent estimator of the measure using a kernel averaging\ntechnique and derive its asymptotic distribution. Using this statistic we\nconstruct two tests for conditional independence, one in the\nmodel-${\\boldsymbol X}$ framework and the other based on a novel local wild\nbootstrap algorithm. In the model-${\\boldsymbol X}$ framework, which assumes\nthe knowledge of the distribution of ${\\boldsymbol X}|{\\boldsymbol Z}$,\napplying the conditional randomization test we obtain a method that controls\nType I error in finite samples and is asymptotically consistent, even if the\ndistribution of ${\\boldsymbol X}|{\\boldsymbol Z}$ is incorrectly specified up\nto distance preserving transformations. More generally, in situations where\n${\\boldsymbol X}|{\\boldsymbol Z}$ is unknown or hard to estimate, we design a\ndouble-bandwidth based local wild bootstrap algorithm that asymptotically\ncontrols both Type I error and power. We illustrate the advantage of our\nmethod, both in terms of Type I error and power, in a range of simulation\nsettings and also in a real data example. A consequence of our theoretical\nresults is a general framework for studying the asymptotic properties of a\n2-sample conditional $V$-statistic, which is of independent interest.\n","subjects":["Mathematics/Statistics Theory","Statistics/Methodology","Statistics/Statistics Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}