{"id":"2407.09254","title":"Power Optimization and Deep Learning for Channel Estimation of Active\n  IRS-Aided IoT","authors":"Yan Wang, Feng Shu, Rongen Dong, Wei Gao, Qi Zhang, Jiajia Liu","authorsParsed":[["Wang","Yan",""],["Shu","Feng",""],["Dong","Rongen",""],["Gao","Wei",""],["Zhang","Qi",""],["Liu","Jiajia",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 13:31:42 GMT"},{"version":"v2","created":"Mon, 15 Jul 2024 08:31:17 GMT"}],"updateDate":"2024-07-16","timestamp":1720791102000,"abstract":"  In this paper, channel estimation of an active intelligent reflecting surface\n(IRS) aided uplink Internet of Things (IoT) network is investigated. Firstly,\nthe least square (LS) estimators for the direct channel and the cascaded\nchannel are presented, respectively. The corresponding mean square errors (MSE)\nof channel estimators are derived. Subsequently, in order to evaluate the\ninfluence of adjusting the transmit power at the IoT devices or the reflected\npower at the active IRS on Sum-MSE performance, two situations are considered.\nIn the first case, under the total power sum constraint of the IoT devices and\nactive IRS, the closed-form expression of the optimal power allocation factor\nis derived. In the second case, when the transmit power at the IoT devices is\nfixed, there exists an optimal reflective power at active IRS. To further\nimprove the estimation performance, the convolutional neural network\n(CNN)-based direct channel estimation (CDCE) algorithm and the CNN-based\ncascaded channel estimation (CCCE) algorithm are designed. Finally, simulation\nresults demonstrate the existence of an optimal power allocation strategy that\nminimizes the Sum-MSE, and further validate the superiority of the proposed\nCDCE / CCCE algorithms over their respective traditional LS and minimum mean\nsquare error (MMSE) baselines.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}