{"id":"2407.15082","title":"Primordial Black Holes and Scalar-induced Gravitational Waves in\n  Sneutrino Hybrid Inflation","authors":"Adeela Afzal, Anish Ghoshal, Stephen F. King","authorsParsed":[["Afzal","Adeela",""],["Ghoshal","Anish",""],["King","Stephen F.",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 07:46:33 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 05:13:20 GMT"},{"version":"v3","created":"Thu, 25 Jul 2024 17:24:05 GMT"}],"updateDate":"2024-07-29","timestamp":1721547993000,"abstract":"  We investigate the possibility that primordial black holes (PBHs) can be\nformed from large curvature perturbations generated during the waterfall phase\ntransition in a supersymmetric scenario where sneutrino is the inflaton in a\nhybrid inflationary framework. We obtain a spectral index ($n_s \\simeq 0.966$),\nand a tensor-to-scalar ratio ($r\\simeq 0.0056-10^{-11}$), consistent with the\ncurrent Planck data satisfying PBH as dark matter (DM) and detectable\nGravitational Wave (GW) signal. Our findings show that the mass of PBH and the\npeak in the GW spectrum is correlated with the right-handed (s)neutrino mass.\nWe identify parameter space where PBHs can be the entire DM candidate of the\nuniverse (with mass $10^{-13}\\, M_\\odot$) or a fraction of it. This can be\ntested in future observatories, for example, with amplitude $\\Omega_{\\rm\nGW}h^2$ $\\sim 10^{-9}$ and peak frequency $f\\sim 0.1$ Hz in LISA and\n$\\Omega_{\\rm GW}h^2 \\sim 10^{-11}$ and peak frequency of $\\sim 10$ Hz in ET via\nsecond-order GW signals. We study two models of sneutrino inflation: Model$-1$\ninvolves canonical sneutrino kinetic term which predicts the sub-Planckian mass\nparameter $M$, while the coupling between a gauge singlet and the waterfall\nfield, $\\beta$, needs to be quite large whereas, for the model$-2$ involving\n$\\alpha-$attractor canonical sneutrino kinetic term, $\\beta$ can take a natural\nvalue. Estimating explicitly, we show that both models have mild fine-tuning.\nWe also derive an analytical expression for the power spectrum in terms of the\nmicrophysics parameters of the model like (s)neutrino mass, etc. that fits well\nwith the numerical results. The typical reheat temperature for both the models\nis around $10^{7}-10^{8}$~GeV suitable for non-thermal leptogenesis.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}