{"id":"2407.14722","title":"Polarimetric compressed sensing with hollow, self-assembled diffractive\n  films","authors":"Ji Feng, Altai J. Perry, Xiaojing Weng, Alma K. Gonzalez-Alcalde,\n  Oriol Arteaga, Mario J. Mencagli, and Luat T. Vuong","authorsParsed":[["Feng","Ji",""],["Perry","Altai J.",""],["Weng","Xiaojing",""],["Gonzalez-Alcalde","Alma K.",""],["Arteaga","Oriol",""],["Mencagli","Mario J.",""],["Vuong","Luat T.",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 01:50:14 GMT"}],"updateDate":"2024-07-23","timestamp":1721440214000,"abstract":"  Sensing light's polarization and wavefront direction enables surface\ncurvature assessment, material identification, shadow differentiation, and\nimproved image quality in turbid environments. Traditional methods utilize\nmultiple sensors and polarization-filtering optics, resulting in reduced image\nresolution due to the loss of signal information at each photodetector. We\npropose a compressive sensing technique that mitigates information loss by\nusing a low-refractive-index, self-assembled optical encoders. These optical\nnanostructures scatter light into polarization-dependent lattice modes and\nrespond to input polarization ellipticity. Our study reveals that the wavefront\ndirection and the polarization are encoded in the interference patterns and the\nlinear component of the diffraction. Combining optical encoders with a shallow\nneural network, the system predicts pointing and polarization when equally\nspaced sensors are separated by less than 20{\\deg}. Comparison of\npolycrystalline and short-range ordered optical encoders shows that the latter\nhas a higher compression ratio. Our work centers on the unexpected modulation\nand spatial multiplexing of incident light polarization by self-assembled\nhollow nanocavity arrays as a new class of materials for optical computing,\ncompressed sensing and imaging.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"QSCxOTb_CQYnavWnLVNxjTX_nLrPMCtHd1wtVMgr1yE","pdfSize":"21543864","objectId":"0x45db1b554504fc635264216a523fb129846c50214c0caca094a606e53f610b9c","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
