{"id":"2407.06255","title":"Linking high-z and low-z: Are We Observing the Progenitors of the Milky\n  Way with JWST?","authors":"Elka Rusta, Stefania Salvadori, Viola Gelli, Ioanna Koutsouridou,\n  Alessandro Marconi","authorsParsed":[["Rusta","Elka",""],["Salvadori","Stefania",""],["Gelli","Viola",""],["Koutsouridou","Ioanna",""],["Marconi","Alessandro",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-10","timestamp":1720461600000,"abstract":"  The recent JWST observation of the Firefly Sparkle at $z=8.3$ offers a unique\nopportunity to link the high- and the low-$z$ Universe. Indeed, the claim of it\nbeing a Milky Way (MW) type of assembly at the cosmic dawn opens the\npossibility of interpreting the observation with locally calibrated\ngalaxy-formation models. Here, we use the MW-evolution model NEFERTITI to\nperform forward modeling of our Galaxy's progenitors at high-$z$. We build a\nset of mock spectra for the MW building blocks to make predictions for JWST and\nto interpret the Firefly Sparkle observation. First, we find that the most\nmassive MW progenitor becomes detectable in a deep survey like JADES from\n$z\\approx 8.2$, meaning that we could have already observed MW-analogs that\nstill need interpretation. Second, we provide predictions for the number of\ndetectable MW progenitors in lensed surveys like CANUCS, and interpret the\nFirefly Sparkle as a group of MW building blocks. Both the number of detections\nand the observed NIRCam photometry are consistent with our predictions. By\nidentifying the MW progenitors whose mock photometry best fits the data, we\nfind bursty and extended star-formation histories, lasting $> 150-300$~Myr, and\nestimate their properties: $M_h \\approx 10^{8-9} \\, M_{\\odot}$, $ M_\\star\n\\approx 10^{6.2-7.5}\\, M_{\\odot}$, $ SFR \\approx 0.04-0.20 \\, M_{\\odot}\nyr^{-1}$ and $ Z_{gas} \\approx 0.04 - 0.24 \\, Z_{\\odot}$. Uncovering the\nproperties of MW-analogs at cosmic dawn by combining JWST observations and\nlocally-constrained models, will allow us to understand our Galaxy's formation,\nlinking the high- and low-$z$ perspectives.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}