{"id":"2407.13296","title":"Prediction intervals for overdispersed binomial endpoints and their\n  application to historical control data","authors":"Max Menssen, Jonathan Rathjens","authorsParsed":[["Menssen","Max",""],["Rathjens","Jonathan",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 08:54:45 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 07:43:37 GMT"}],"updateDate":"2024-07-22","timestamp":1721292885000,"abstract":"  In toxicology, the validation of the concurrent control by historical control\ndata (HCD) has become requirements. This validation is usually done by\nhistorical control limits (HCL) which in practice are often graphically\ndisplayed in a Sheward control chart like manner. In many applications, HCL are\napplied to dichotomous data, e.g. the number of rats with a tumor vs. the\nnumber of rats without a tumor (carcinogenicity studies) or the number of cells\nwith a micronucleus out of a total number of cells. Dichotomous HCD may be\noverdispersed and can be heavily right- (or left-) skewed, which is usually not\ntaken into account in the practical applications of HCL. To overcome this\nproblem, four different prediction intervals (two frequentist, two Bayesian),\nthat can be applied to such data, are proposed. Comprehensive Monte-Carlo\nsimulations assessing the coverage probabilities of seven different methods for\nHCL calculation reveal, that frequentist bootstrap calibrated prediction\nintervals control the type-1-error best. Heuristics traditionally used in\ncontrol charts (e.g. the limits in Sheward np-charts or the mean plus minus 2\nSD) as well a the historical range fail to control a pre-specified coverage\nprobability. The application of HCL is demonstrated based on a real life data\nset containing historical controls from long-term carcinogenicity studies run\non behalf of the U.S. National Toxicology Program. The proposed frequentist\nprediction intervals are publicly available from the R package predint, whereas\nR code for the computation of the Bayesian prediction intervals is provided via\nGitHub.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"YfzG_7kCwlym5TvQy1LAEElqUGaqe-aNlu12rwpYTw8","pdfSize":"3452186"}
