{"id":"2407.15243","title":"Genetic Algorithm to Optimize Design of Micro-Surgical Scissors","authors":"Fatemeh Norouziani, Veerash Palanichamy, Shivam Gupta and Onaizah\n  Onaizah","authorsParsed":[["Norouziani","Fatemeh",""],["Palanichamy","Veerash",""],["Gupta","Shivam",""],["Onaizah","Onaizah",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 18:39:13 GMT"}],"updateDate":"2024-07-23","timestamp":1721587153000,"abstract":"  Microrobotics is an attractive area of research as small-scale robots have\nthe potential to improve the precision and dexterity offered by minimally\ninvasive surgeries. One example of such a tool is a pair of micro-surgical\nscissors that was developed for cutting of tumors or cancerous tissues present\ndeep inside the body such as in the brain. This task is often deemed difficult\nor impossible with conventional robotic tools due to their size and dexterity.\nThe scissors are designed with two magnets placed a specific distance apart to\nmaximize deflection and generate cutting forces. However, remote actuation and\nsize requirements of the micro-surgical scissors limits the force that can be\ngenerated to puncture the tissue. To address the limitation of small output\nforces, we use an evolutionary algorithm to further optimize the performance of\nthe scissors. In this study, the design of the previously developed untethered\nmicro-surgical scissors has been modified and their performance is enhanced by\ndetermining the optimal position of the magnets as well as the direction of\neach magnetic moment. The developed algorithm is successfully applied to a\n4-magnet configuration which results in increased net torque. This improvement\nin net torque is directly translated into higher cutting forces. The new\nconfiguration generates a cutting force of 58 mN from 80 generations of the\nevolutionary algorithm which is a 1.65 times improvement from the original\ndesign. Furthermore, the developed algorithm has the advantage that it can be\ndeployed with minor modifications to other microrobotic tools and systems,\nopening up new possibilities for various medical procedures and applications.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"LIlUbDvsPMwBueNPBboi6b53-OOBmLRWmrCEkmEO-9o","pdfSize":"397359"}
