{"id":"2407.00375","title":"Hagedorn temperature in holography: world-sheet and effective approaches","authors":"Francesco Bigazzi, Tommaso Canneti, Federico Castellani, Aldo L.\n  Cotrone and Wolfgang M\\\"uck","authorsParsed":[["Bigazzi","Francesco",""],["Canneti","Tommaso",""],["Castellani","Federico",""],["Cotrone","Aldo L.",""],["Mück","Wolfgang",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 08:58:48 GMT"}],"updateDate":"2024-07-02","timestamp":1719651528000,"abstract":"  We provide general results on the Hagedorn temperature of planar, strongly\ncoupled confining gauge theories holographically dual to type II superstring\nmodels on curved backgrounds with Ramond-Ramond and Kalb-Ramond fluxes and\nnon-trivial dilaton. For exact backgrounds the Hagedorn temperature is\ndetermined up to next-to-next-to-next-to-leading order (NNNLO) in an expansion\nin $\\alpha'$; in all the other cases the results can be safely trusted up to\nNNLO. To reach these goals we exploit two complementary approaches. On the one\nhand, we perform an extrapolation to the Hagedorn regime of world-sheet results\nobtained from the semiclassical quantization of string configurations winding\naround the compact Euclidean time direction. En passant, we provide a detailed\nderivation of the fermionic part of the world-sheet spectrum, which is hard to\nfind in the literature. On the other hand, we perturbatively solve the\nequations of motion for the thermal scalar field corresponding to the lightest\nmode of the winding string, which in flat space becomes tachyonic above the\nHagedorn temperature. The interplay between different approaches is surely\nconvenient, but we provide insights about a possible derivation of the whole\nNNLO correction to the Hagedorn temperature from a pure world-sheet\nperspective; furthermore, we determine the effective mass of the thermal scalar\nfrom the world-sheet in full generality.\n","subjects":["Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}