{"id":"2407.06152","title":"Uni-ELF: A Multi-Level Representation Learning Framework for Electrolyte\n  Formulation Design","authors":"Boshen Zeng, Sian Chen, Xinxin Liu, Changhong Chen, Bin Deng, Xiaoxu\n  Wang, Zhifeng Gao, Yuzhi Zhang, Weinan E, Linfeng Zhang","authorsParsed":[["Zeng","Boshen",""],["Chen","Sian",""],["Liu","Xinxin",""],["Chen","Changhong",""],["Deng","Bin",""],["Wang","Xiaoxu",""],["Gao","Zhifeng",""],["Zhang","Yuzhi",""],["E","Weinan",""],["Zhang","Linfeng",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 17:26:49 GMT"}],"updateDate":"2024-07-09","timestamp":1720459609000,"abstract":"  Advancements in lithium battery technology heavily rely on the design and\nengineering of electrolytes. However, current schemes for molecular design and\nrecipe optimization of electrolytes lack an effective\ncomputational-experimental closed loop and often fall short in accurately\npredicting diverse electrolyte formulation properties. In this work, we\nintroduce Uni-ELF, a novel multi-level representation learning framework to\nadvance electrolyte design. Our approach involves two-stage pretraining:\nreconstructing three-dimensional molecular structures at the molecular level\nusing the Uni-Mol model, and predicting statistical structural properties\n(e.g., radial distribution functions) from molecular dynamics simulations at\nthe mixture level. Through this comprehensive pretraining, Uni-ELF is able to\ncapture intricate molecular and mixture-level information, which significantly\nenhances its predictive capability. As a result, Uni-ELF substantially\noutperforms state-of-the-art methods in predicting both molecular properties\n(e.g., melting point, boiling point, synthesizability) and formulation\nproperties (e.g., conductivity, Coulombic efficiency). Moreover, Uni-ELF can be\nseamlessly integrated into an automatic experimental design workflow. We\nbelieve this innovative framework will pave the way for automated AI-based\nelectrolyte design and engineering.\n","subjects":["Physics/Chemical Physics","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}