{"id":"2407.00631","title":"TrialBench: Multi-Modal Artificial Intelligence-Ready Clinical Trial\n  Datasets","authors":"Jintai Chen, Yaojun Hu, Yue Wang, Yingzhou Lu, Xu Cao, Miao Lin,\n  Hongxia Xu, Jian Wu, Cao Xiao, Jimeng Sun, Lucas Glass, Kexin Huang, Marinka\n  Zitnik, Tianfan Fu","authorsParsed":[["Chen","Jintai",""],["Hu","Yaojun",""],["Wang","Yue",""],["Lu","Yingzhou",""],["Cao","Xu",""],["Lin","Miao",""],["Xu","Hongxia",""],["Wu","Jian",""],["Xiao","Cao",""],["Sun","Jimeng",""],["Glass","Lucas",""],["Huang","Kexin",""],["Zitnik","Marinka",""],["Fu","Tianfan",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 09:13:10 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 18:00:29 GMT"}],"updateDate":"2024-09-05","timestamp":1719738790000,"abstract":"  Clinical trials are pivotal for developing new medical treatments, yet they\ntypically pose some risks such as patient mortality, adverse events, and\nenrollment failure that waste immense efforts spanning over a decade. Applying\nartificial intelligence (AI) to forecast or simulate key events in clinical\ntrials holds great potential for providing insights to guide trial designs.\nHowever, complex data collection and question definition requiring medical\nexpertise and a deep understanding of trial designs have hindered the\ninvolvement of AI thus far. This paper tackles these challenges by presenting a\ncomprehensive suite of meticulously curated AIready datasets covering\nmulti-modal data (e.g., drug molecule, disease code, text,\ncategorical/numerical features) and 8 crucial prediction challenges in clinical\ntrial design, encompassing prediction of trial duration, patient dropout rate,\nserious adverse event, mortality rate, trial approval outcome, trial failure\nreason, drug dose finding, design of eligibility criteria. Furthermore, we\nprovide basic validation methods for each task to ensure the datasets'\nusability and reliability. We anticipate that the availability of such\nopen-access datasets will catalyze the development of advanced AI approaches\nfor clinical trial design, ultimately advancing clinical trial research and\naccelerating medical solution development. The curated dataset, metrics, and\nbasic models are publicly available at\nhttps://github.com/ML2Health/ML2ClinicalTrials/tree/main/AI4Trial.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}