{"id":"2407.01094","title":"Evaluation of Text-to-Video Generation Models: A Dynamics Perspective","authors":"Mingxiang Liao, Hannan Lu, Xinyu Zhang, Fang Wan, Tianyu Wang, Yuzhong\n  Zhao, Wangmeng Zuo, Qixiang Ye, Jingdong Wang","authorsParsed":[["Liao","Mingxiang",""],["Lu","Hannan",""],["Zhang","Xinyu",""],["Wan","Fang",""],["Wang","Tianyu",""],["Zhao","Yuzhong",""],["Zuo","Wangmeng",""],["Ye","Qixiang",""],["Wang","Jingdong",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 08:51:22 GMT"}],"updateDate":"2024-07-02","timestamp":1719823882000,"abstract":"  Comprehensive and constructive evaluation protocols play an important role in\nthe development of sophisticated text-to-video (T2V) generation models.\nExisting evaluation protocols primarily focus on temporal consistency and\ncontent continuity, yet largely ignore the dynamics of video content. Dynamics\nare an essential dimension for measuring the visual vividness and the honesty\nof video content to text prompts. In this study, we propose an effective\nevaluation protocol, termed DEVIL, which centers on the dynamics dimension to\nevaluate T2V models. For this purpose, we establish a new benchmark comprising\ntext prompts that fully reflect multiple dynamics grades, and define a set of\ndynamics scores corresponding to various temporal granularities to\ncomprehensively evaluate the dynamics of each generated video. Based on the new\nbenchmark and the dynamics scores, we assess T2V models with the design of\nthree metrics: dynamics range, dynamics controllability, and dynamics-based\nquality. Experiments show that DEVIL achieves a Pearson correlation exceeding\n90% with human ratings, demonstrating its potential to advance T2V generation\nmodels. Code is available at https://github.com/MingXiangL/DEVIL.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TfTbyljCPemZ63rp_E6YSMWAqjVgJ0N-E7mB_asSl1A","pdfSize":"12669302","objectId":"0x206fed087546125a6fb6c0dc05667c68fa5c3297ed4e55681ef554081b14bb8f","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
