{"id":"2407.03069","title":"Frequency-selective terahertz wave amplification by a\n  time-boundary-engineered Huygens metasurface","authors":"Fu Deng, Fengjie Zhu, Xiaoyue Zhou, Yi Chan, Jingbo Wu, Caihong Zhang,\n  Biaobing Jin, Jensen Li, Kebin Fan, and Jingdi Zhang","authorsParsed":[["Deng","Fu",""],["Zhu","Fengjie",""],["Zhou","Xiaoyue",""],["Chan","Yi",""],["Wu","Jingbo",""],["Zhang","Caihong",""],["Jin","Biaobing",""],["Li","Jensen",""],["Fan","Kebin",""],["Zhang","Jingdi",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 12:41:57 GMT"}],"updateDate":"2024-07-04","timestamp":1720010517000,"abstract":"  Ultrafast manipulation of optical resonance can establish the time-boundary\neffect in time-variant media leading to a new degree of freedom for coherent\ncontrol of electromagnetic waves. Here, we demonstrate that a free-standing all\ndielectric Huygens metasurface of degenerate electric and magnetic resonances\ncan prompt the broadband near-unity transmission in its static state, whereas\nit enables wave amplification in the presence of time boundary. The time\nboundary is realized by femtosecond laser excitations that transiently inject\nfree carriers into the constituent meta-atoms for dynamic removal of a\npre-established two-fold degeneracy. We observe that the transmittance in the\nphoto-excited Huygens metasurface can exceed unity transmittance, i.e., THz\nwave amplification, by a factor over 20% in intensity at frequencies tunable by\nvarying the arrival of time boundary with respect to that of the seed terahertz\npulse. By numerical simulations and analysis with time-dependent coupled mode\ntheory, we show that the wave amplification results from the ultrafast\nQ-switching and shift in resonant frequencies. This work demonstrates a new\napproach to achieve tunable amplification in an optical microcavity by\nexploiting the concept of time-variant media and the unique electromagnetic\nproperties of Huygens metasurface.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}