{"id":"2407.12463","title":"Progressive Proxy Anchor Propagation for Unsupervised Semantic\n  Segmentation","authors":"Hyun Seok Seong, WonJun Moon, SuBeen Lee, Jae-Pil Heo","authorsParsed":[["Seong","Hyun Seok",""],["Moon","WonJun",""],["Lee","SuBeen",""],["Heo","Jae-Pil",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 10:28:51 GMT"}],"updateDate":"2024-07-18","timestamp":1721212131000,"abstract":"  The labor-intensive labeling for semantic segmentation has spurred the\nemergence of Unsupervised Semantic Segmentation. Recent studies utilize\npatch-wise contrastive learning based on features from image-level\nself-supervised pretrained models. However, relying solely on similarity-based\nsupervision from image-level pretrained models often leads to unreliable\nguidance due to insufficient patch-level semantic representations. To address\nthis, we propose a Progressive Proxy Anchor Propagation (PPAP) strategy. This\nmethod gradually identifies more trustworthy positives for each anchor by\nrelocating its proxy to regions densely populated with semantically similar\nsamples. Specifically, we initially establish a tight boundary to gather a few\nreliable positive samples around each anchor. Then, considering the\ndistribution of positive samples, we relocate the proxy anchor towards areas\nwith a higher concentration of positives and adjust the positiveness boundary\nbased on the propagation degree of the proxy anchor. Moreover, to account for\nambiguous regions where positive and negative samples may coexist near the\npositiveness boundary, we introduce an instance-wise ambiguous zone. Samples\nwithin these zones are excluded from the negative set, further enhancing the\nreliability of the negative set. Our state-of-the-art performances on various\ndatasets validate the effectiveness of the proposed method for Unsupervised\nSemantic Segmentation.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}