{"id":"2407.07319","title":"The spatial correlations between pulsars for interfering sources in\n  Pulsar Timing Array and evidence for gravitational-wave background in\n  NANOGrav 15-year data set","authors":"Yu-Mei Wu, Yan-Chen Bi, and Qing-Guo Huang","authorsParsed":[["Wu","Yu-Mei",""],["Bi","Yan-Chen",""],["Huang","Qing-Guo",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 02:30:09 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 10:10:34 GMT"}],"updateDate":"2024-07-31","timestamp":1720578609000,"abstract":"  Pulsar timing arrays (PTAs), aimed at detecting gravitational waves (GWs) in\nthe $1\\sim 100$ nHz range, have recently made significant strides. Compelling\nevidence has emerged for a common spectrum signal spatially correlated among\npulsars, following a Hellings-Downs (HD) pattern, which is crucial for\ndetecting a gravitational-wave background (GWB). However, the HD curve is\nexpected for discrete and non-interfering sources, which is unlikely to hold in\nrealistic scenarios with potential interference among numerous GW sources, such\nas the supermassive black-hole binaries. Incorporating interference was\npreviously expected to introduce an irreducible uncertainty (known as \"cosmic\nvariance\") in discerning the HD correlation; however, our work reveals how this\ninterference generates measurable frequency-dependent spatial correlations\ndistinct from the HD curve. The spatial correlations for interfering sources\n(referred to as \"ISC\") still exhibit contributions in the quadrupole and higher\norders, resembling the HD correlation and encoding the nature of GW radiations.\nWe apply these novel correlations to search for a GWB in the NANOGrav 15-year\ndata set. In an optimistic estimation, our findings show a Bayes factor of\n$33.7\\pm 3.2$ comparing ISC to the HD correlation, and an improvement in\noptimal statistic signal-to-noise ratio from $4.9\\pm 1.1$ for the HD\ncorrelation to $6.6\\pm 1.7$ for the ISC, highlighting the significant\nenhancement in evidence for detecting a GWB through incorporating interference.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zDRYDDZPvfjVU7PrY5OwSpOsJ1M3nAFHMPmeEt-lczc","pdfSize":"1108936"}
