{"id":"2407.08462","title":"Distributed Deep Reinforcement Learning Based Gradient Quantization for\n  Federated Learning Enabled Vehicle Edge Computing","authors":"Cui Zhang, Wenjun Zhang, Qiong Wu, Pingyi Fan, Qiang Fan, Jiangzhou\n  Wang, Khaled B. Letaief","authorsParsed":[["Zhang","Cui",""],["Zhang","Wenjun",""],["Wu","Qiong",""],["Fan","Pingyi",""],["Fan","Qiang",""],["Wang","Jiangzhou",""],["Letaief","Khaled B.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 12:58:47 GMT"}],"updateDate":"2024-07-12","timestamp":1720702727000,"abstract":"  Federated Learning (FL) can protect the privacy of the vehicles in vehicle\nedge computing (VEC) to a certain extent through sharing the gradients of\nvehicles' local models instead of local data. The gradients of vehicles' local\nmodels are usually large for the vehicular artificial intelligence (AI)\napplications, thus transmitting such large gradients would cause large\nper-round latency. Gradient quantization has been proposed as one effective\napproach to reduce the per-round latency in FL enabled VEC through compressing\ngradients and reducing the number of bits, i.e., the quantization level, to\ntransmit gradients. The selection of quantization level and thresholds\ndetermines the quantization error, which further affects the model accuracy and\ntraining time. To do so, the total training time and quantization error (QE)\nbecome two key metrics for the FL enabled VEC. It is critical to jointly\noptimize the total training time and QE for the FL enabled VEC. However, the\ntime-varying channel condition causes more challenges to solve this problem. In\nthis paper, we propose a distributed deep reinforcement learning (DRL)-based\nquantization level allocation scheme to optimize the long-term reward in terms\nof the total training time and QE. Extensive simulations identify the optimal\nweighted factors between the total training time and QE, and demonstrate the\nfeasibility and effectiveness of the proposed scheme.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}