{"id":"2407.08769","title":"AuNR-SMA: Automated Gold Nanorod Spectral Morphology Analysis Pipeline","authors":"Samuel P. Gleason, Jakob C. Dahl, Mahmoud Elzouka, Xingzhi Wang, Dana\n  O. Byrne, Mumtaz Gababa, Hannah Cho, Ravi Prasher, Sean Lubner, Emory Chan,\n  and A. Paul Alivisatos","authorsParsed":[["Gleason","Samuel P.",""],["Dahl","Jakob C.",""],["Elzouka","Mahmoud",""],["Wang","Xingzhi",""],["Byrne","Dana O.",""],["Gababa","Mumtaz",""],["Cho","Hannah",""],["Prasher","Ravi",""],["Lubner","Sean",""],["Chan","Emory",""],["Alivisatos","A. Paul",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 17:40:17 GMT"}],"updateDate":"2024-07-15","timestamp":1720719617000,"abstract":"  The development of a colloidal synthesis procedure to produce nanomaterials\nof a specific size with high shape and size purity is often a time consuming,\niterative process. This is often due to the time, resource and expertise\nintensive characterization methods required for quantitative determination of\nnanomaterial size and shape. Absorption spectroscopy is often the easiest\nmethod of colloidal nanomaterial characterization, however, due to the lack of\na reliable method to extract nanoparticle shapes from absorption spectroscopy,\nit is generally treated as a more qualitative measure for metal nanoparticles.\nThis work demonstrates a gold nanorod (AuNR) spectral morphology analysis (SMA)\ntool, AuNR-SMA, which is a fast and accurate method to extract quantitative\ninformation about an AuNR sample's structural parameters from its absorption\nspectra. We apply AuNR-SMA in three distinct applications. First, we\ndemonstrate its utility as an automated analysis tool in a high throughput AuNR\nsynthesis procedure by generating quantitative size information from optical\nspectra. Second, we use the predictions generated by this model to train a\nmachine learning model capable of predicting the resulting AuNR size\ndistributions from the reaction conditions used to synthesize them. Third, we\nturn this model to spectra extracted from the literature where no size\ndistributions are reported to impute unreported quantitative information of\nAuNR synthesis. This approach can potentially be extended to any other\nnanocrystal system where the absorption spectra are size dependent and accurate\nnumerical simulation of the absorption spectra is possible. In addition, this\npipeline could be integrated into automated synthesis apparatuses to provide\ninterpretable data from simple measurements and help explore the synthesis\nscience of nanoparticles in a rational manner or facilitate closed-loop\nworkflows.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"G4-J4V8AUu3JpBXRKbtZpcKnJULGJr4dqhKe4MgXFko","pdfSize":"4789582"}
