{"id":"2407.10876","title":"RepVF: A Unified Vector Fields Representation for Multi-task 3D\n  Perception","authors":"Chunliang Li, Wencheng Han, Junbo Yin, Sanyuan Zhao, Jianbing Shen","authorsParsed":[["Li","Chunliang",""],["Han","Wencheng",""],["Yin","Junbo",""],["Zhao","Sanyuan",""],["Shen","Jianbing",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 16:25:07 GMT"},{"version":"v2","created":"Sat, 20 Jul 2024 15:46:44 GMT"}],"updateDate":"2024-07-23","timestamp":1721060707000,"abstract":"  Concurrent processing of multiple autonomous driving 3D perception tasks\nwithin the same spatiotemporal scene poses a significant challenge, in\nparticular due to the computational inefficiencies and feature competition\nbetween tasks when using traditional multi-task learning approaches. This paper\naddresses these issues by proposing a novel unified representation, RepVF,\nwhich harmonizes the representation of various perception tasks such as 3D\nobject detection and 3D lane detection within a single framework. RepVF\ncharacterizes the structure of different targets in the scene through a vector\nfield, enabling a single-head, multi-task learning model that significantly\nreduces computational redundancy and feature competition. Building upon RepVF,\nwe introduce RFTR, a network designed to exploit the inherent connections\nbetween different tasks by utilizing a hierarchical structure of queries that\nimplicitly model the relationships both between and within tasks. This approach\neliminates the need for task-specific heads and parameters, fundamentally\nreducing the conflicts inherent in traditional multi-task learning paradigms.\nWe validate our approach by combining labels from the OpenLane dataset with the\nWaymo Open dataset. Our work presents a significant advancement in the\nefficiency and effectiveness of multi-task perception in autonomous driving,\noffering a new perspective on handling multiple 3D perception tasks\nsynchronously and in parallel. The code will be available at:\nhttps://github.com/jbji/RepVF\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}