{"id":"2407.05540","title":"GTP-4o: Modality-prompted Heterogeneous Graph Learning for Omni-modal\n  Biomedical Representation","authors":"Chenxin Li, Xinyu Liu, Cheng Wang, Yifan Liu, Weihao Yu, Jing Shao,\n  and Yixuan Yuan","authorsParsed":[["Li","Chenxin",""],["Liu","Xinyu",""],["Wang","Cheng",""],["Liu","Yifan",""],["Yu","Weihao",""],["Shao","Jing",""],["Yuan","Yixuan",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 01:06:13 GMT"}],"updateDate":"2024-07-09","timestamp":1720400773000,"abstract":"  Recent advances in learning multi-modal representation have witnessed the\nsuccess in biomedical domains. While established techniques enable handling\nmulti-modal information, the challenges are posed when extended to various\nclinical modalities and practical modalitymissing setting due to the inherent\nmodality gaps. To tackle these, we propose an innovative Modality-prompted\nHeterogeneous Graph for Omnimodal Learning (GTP-4o), which embeds the numerous\ndisparate clinical modalities into a unified representation, completes the\ndeficient embedding of missing modality and reformulates the cross-modal\nlearning with a graph-based aggregation. Specially, we establish a\nheterogeneous graph embedding to explicitly capture the diverse semantic\nproperties on both the modality-specific features (nodes) and the cross-modal\nrelations (edges). Then, we design a modality-prompted completion that enables\ncompleting the inadequate graph representation of missing modality through a\ngraph prompting mechanism, which generates hallucination graphic topologies to\nsteer the missing embedding towards the intact representation. Through the\ncompleted graph, we meticulously develop a knowledge-guided hierarchical\ncross-modal aggregation consisting of a global meta-path neighbouring to\nuncover the potential heterogeneous neighbors along the pathways driven by\ndomain knowledge, and a local multi-relation aggregation module for the\ncomprehensive cross-modal interaction across various heterogeneous relations.\nWe assess the efficacy of our methodology on rigorous benchmarking experiments\nagainst prior state-of-the-arts. In a nutshell, GTP-4o presents an initial\nforay into the intriguing realm of embedding, relating and perceiving the\nheterogeneous patterns from various clinical modalities holistically via a\ngraph theory. Project page: https://gtp-4-o.github.io/.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}