{"id":"2407.18629","title":"CardioLab: Laboratory Values Estimation from Electrocardiogram Features\n  -- An Exploratory Study","authors":"Juan Miguel Lopez Alcaraz, Nils Strodthoff","authorsParsed":[["Alcaraz","Juan Miguel Lopez",""],["Strodthoff","Nils",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 09:40:30 GMT"},{"version":"v2","created":"Sun, 1 Sep 2024 18:49:10 GMT"}],"updateDate":"2024-09-04","timestamp":1721986830000,"abstract":"  Introduction: Laboratory value represents a cornerstone of medical\ndiagnostics, but suffers from slow turnaround times, and high costs and only\nprovides information about a single point in time. The continuous estimation of\nlaboratory values from non-invasive data such as electrocardiogram (ECG) would\ntherefore mark a significant frontier in healthcare monitoring. Despite its\ntransformative potential, this domain remains relatively underexplored within\nthe medical community.\n  Methods: In this preliminary study, we used a publicly available dataset\n(MIMIC-IV-ECG) to investigate the feasibility of inferring laboratory values\nfrom ECG features and patient demographics using tree-based models (XGBoost).\nWe define the prediction task as a binary prediction problem of predicting\nwhether the lab value falls into low or high abnormalities. The model\nperformance can then be assessed using AUROC.\n  Results: Our findings demonstrate promising results in the estimation of\nlaboratory values related to different organ systems based on a small yet\ncomprehensive set of features. While further research and validation are\nwarranted to fully assess the clinical utility and generalizability of\nECG-based estimation in healthcare monitoring, our findings lay the groundwork\nfor future investigations into approaches to laboratory value estimation using\nECG data. Such advancements hold promise for revolutionizing predictive\nhealthcare applications, offering faster, non-invasive, and more affordable\nmeans of patient monitoring.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Machine Learning","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}