{"id":"2407.19739","title":"Nomadic Non-Public Networks for 6G: Use Cases and Key Performance\n  Indicators","authors":"Daniel Lindenschmitt, Benedikt Veith, Khurshid Alam, Ainur\n  Daurembekova, Michael Gundall, Mohammad Asif Habibi, Bin Han, Dennis\n  Krummacker, Philipp Rosemann and Hans D. Schotten","authorsParsed":[["Lindenschmitt","Daniel",""],["Veith","Benedikt",""],["Alam","Khurshid",""],["Daurembekova","Ainur",""],["Gundall","Michael",""],["Habibi","Mohammad Asif",""],["Han","Bin",""],["Krummacker","Dennis",""],["Rosemann","Philipp",""],["Schotten","Hans D.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 07:04:30 GMT"},{"version":"v2","created":"Sun, 4 Aug 2024 13:26:43 GMT"}],"updateDate":"2024-08-06","timestamp":1722236670000,"abstract":"  The landscape of wireless communication systems is evolving rapidly, with a\npivotal role envisioned for dynamic network structures and self-organizing\nnetworks in upcoming technologies like the 6G mobile communications standard.\nThis evolution is fueled by the growing demand from diverse sectors, including\nindustry, manufacturing, agriculture, and the public sector, each with\nincreasingly specific requirements. The establishment of non-public networks in\nthe current 5G standard has laid a foundation, enabling independent operation\nwithin certain frequencies and local limitations, notably for Internet of\nThings applications. This paper explores the progression from non-public\nnetworks to nomadic non-public networks and their significance in the context\nof the forthcoming 6G era.\n  Building on existing work in dynamic network structures, non-public networks\nregulations, and alternative technological solutions, this paper introduces\nspecific use cases enhanced by nomadic networks. In addition, relevant Key\nPerformance Indicators are discussed on the basis of the presented use cases.\nThese serve as a starting point for the definition of requirement clusters and\nthus for a evaluation metric of nomadic non-public networks. This work lays the\ngroundwork for understanding the potential of nomadic non-public networks in\nthe dynamic landscape of 6G wireless communication systems.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"GwLbTTIOZVRyOOdHgWAN0PC8k24uMyKpeIfRA6VBtgA","pdfSize":"848055"}
