{"id":"2407.17207","title":"Solving The Travelling Salesman Problem Using A Single Qubit","authors":"Kapil Goswami, Gagan Anekonda Veereshi, Peter Schmelcher, Rick\n  Mukherjee","authorsParsed":[["Goswami","Kapil",""],["Veereshi","Gagan Anekonda",""],["Schmelcher","Peter",""],["Mukherjee","Rick",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 12:06:37 GMT"}],"updateDate":"2024-07-25","timestamp":1721822797000,"abstract":"  The travelling salesman problem (TSP) is a popular NP-hard-combinatorial\noptimization problem that requires finding the optimal way for a salesman to\ntravel through different cities once and return to the initial city. The\nexisting methods of solving TSPs on quantum systems are either gate-based or\nbinary variable-based encoding. Both approaches are resource-expensive in terms\nof the number of qubits while performing worse compared to existing classical\nalgorithms even for small-size problems. We present an algorithm that solves an\narbitrary TSP using a single qubit by invoking the principle of quantum\nparallelism. The cities are represented as quantum states on the Bloch sphere\nwhile the preparation of superposition states allows us to traverse multiple\npaths at once. The underlying framework of our algorithm is a quantum version\nof the classical Brachistochrone approach. Optimal control methods are employed\nto create a selective superposition of the quantum states to find the shortest\nroute of a given TSP. The numerical simulations solve a sample of four to nine\ncities for which exact solutions are obtained. The algorithm can be implemented\non any quantum platform capable of efficiently rotating a qubit and allowing\nstate tomography measurements. For the TSP problem sizes considered in this\nwork, our algorithm is more resource-efficient and accurate than existing\nquantum algorithms with the potential for scalability. A potential speed-up of\npolynomial time over classical algorithms is discussed.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Computational Complexity","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2UTtMpBZsu1--5u4O-1npePtTqEDS_vElkj-KrwZ-yc","pdfSize":"5764700","objectId":"0x12f12188229cc1df4cffeb60a2bf9128087eb435ae2a6f02f7d2159a582f94a1","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
