{"id":"2407.03541","title":"Parallel fast random bit generation based on spectrotemporally\n  uncorrelated Brillouin random fiber lasing oscillation","authors":"Yuxi Pang, Shaonian Ma, Qiang Ji, Xian Zhao, Zengguang Qin, Zhaojun\n  Liu, Ping Lu, Xiaoyi Bao, and Yanping Xu","authorsParsed":[["Pang","Yuxi",""],["Ma","Shaonian",""],["Ji","Qiang",""],["Zhao","Xian",""],["Qin","Zengguang",""],["Liu","Zhaojun",""],["Lu","Ping",""],["Bao","Xiaoyi",""],["Xu","Yanping",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 23:10:24 GMT"}],"updateDate":"2024-07-08","timestamp":1720048224000,"abstract":"  Correlations existing between spectral components in multi-wavelength lasers\nhave been the key challenge that hinders these laser sources from being\ndeveloped to chaotic comb entropy sources for parallel random bit generation.\nHerein, spectrotemporally uncorrelated multi-order Stokes/anti-Stokes emissions\nare achieved by cooperatively exploiting nonlinear optical processes including\ncascaded stimulated Brillouin scattering and quasi-phase-matched four-wave\nmixing in a Brillouin random fiber laser. Chaotic instabilities induced by\nrandom mode resonance are enhanced and disorderly redistributed among different\nlasing lines through complex nonlinear optical interactions, which\ncomprehensively releases the inherent correlation among multiple\nStokes/anti-Stokes emission lines, realizing a chaotic frequency comb with\nmultiple spectrotemporally uncorrelated channels. Parallel fast random bit\ngeneration is fulfilled with 31 channels, single-channel bit rate of 35-Gbps\nand total bit rate of 1.085-Tbps. National Institute of Standards and\nTechnology statistic tests verify the randomness of generated bit streams. This\nwork, in a simple and efficient way, breaks the correlation barrier for\nutilizing multi-wavelength laser to achieve high-quality spectrotemporally\nuncorrelated chaotic laser source, opening new avenues for achieving greatly\naccelerated random bit generation through parallelization and potentially\nrevolutionizing the current architecture of secure communication and\nhigh-performance computation.\n","subjects":["Physics/Optics","Nonlinear Sciences/Chaotic Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}