{"id":"2407.17640","title":"Atmospheric parameters and chemical abundances within 100 pc. A sample\n  of G, K, and M main-sequence stars","authors":"Ricardo L\\'opez-Valdivia, Luc\\'ia Adame, Eduardo Zagala Lagunas,\n  Carlos G. Rom\\'an-Z\\'u\\~niga, Jes\\'us Hern\\'andez, Edilberto S\\'anchez,\n  Jos\\'e G. Fern\\'andez-Trincado, Leticia Carigi, Marina Kounkel, Richard R.\n  Lane, Keivan G. Stassun, Sandro Villanova","authorsParsed":[["López-Valdivia","Ricardo",""],["Adame","Lucía",""],["Lagunas","Eduardo Zagala",""],["Román-Zúñiga","Carlos G.",""],["Hernández","Jesús",""],["Sánchez","Edilberto",""],["Fernández-Trincado","José G.",""],["Carigi","Leticia",""],["Kounkel","Marina",""],["Lane","Richard R.",""],["Stassun","Keivan G.",""],["Villanova","Sandro",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 21:08:31 GMT"}],"updateDate":"2024-07-26","timestamp":1721855311000,"abstract":"  To date, we have access to enormous inventories of stellar spectra that allow\nthe extraction of atmospheric parameters and chemical abundances essential in\nstellar studies. However, characterizing such a large amount of data is complex\nand requires a good understanding of the studied object to ensure reliable and\nhomogeneous results. In this study, we present a methodology to measure\nhomogenously the basic atmospheric parameters and detailed chemical abundances\nof over 1600 thin disk main-sequence stars in the 100 pc solar neighborhood,\nusing APOGEE-2 infrared spectra. We employed the code tonalli to determine the\natmospheric parameters using a prior on log g. The log g prior in tonalli\nimplies an understanding of the treated population and helps to find physically\ncoherent answers. Our atmospheric parameters agree within the typical\nuncertainties (100 K in Teff, 0.15 dex in log g and $[M/H]$) with previous\nestimations of ASPCAP and Gaia DR3. We use our temperatures to determine a new\ninfrared color-temperature sequence, in good agreement with previous works,\nthat can be used for any main-sequence star. Additionally, we used the BACCHUS\ncode to determine the abundances of Mg, Al, Si, Ca, and Fe in our sample. The\nfive elements (Mg, Al, Si, Ca, Fe) studied have an abundance distribution\ncentered around slightly sub-solar values, in agreement with previous results\nfor the solar neighborhood. The over 1600 main-sequence stars atmospheric\nparameters and chemical abundances presented here are useful in follow-up\nstudies of the solar neighborhood or as a training set for data-driven methods.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OwgGi8OmirV_d6Rw3tbcKKgeZSXslHSYYOfPFBRol0Q","pdfSize":"3643791"}
