{"id":"2407.08722","title":"Unifying 3D Representation and Control of Diverse Robots with a Single\n  Camera","authors":"Sizhe Lester Li, Annan Zhang, Boyuan Chen, Hanna Matusik, Chao Liu,\n  Daniela Rus, Vincent Sitzmann","authorsParsed":[["Li","Sizhe Lester",""],["Zhang","Annan",""],["Chen","Boyuan",""],["Matusik","Hanna",""],["Liu","Chao",""],["Rus","Daniela",""],["Sitzmann","Vincent",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 17:55:49 GMT"}],"updateDate":"2024-07-12","timestamp":1720720549000,"abstract":"  Mirroring the complex structures and diverse functions of natural organisms\nis a long-standing challenge in robotics. Modern fabrication techniques have\ndramatically expanded feasible hardware, yet deploying these systems requires\ncontrol software to translate desired motions into actuator commands. While\nconventional robots can easily be modeled as rigid links connected via joints,\nit remains an open challenge to model and control bio-inspired robots that are\noften multi-material or soft, lack sensing capabilities, and may change their\nmaterial properties with use. Here, we introduce Neural Jacobian Fields, an\narchitecture that autonomously learns to model and control robots from vision\nalone. Our approach makes no assumptions about the robot's materials,\nactuation, or sensing, requires only a single camera for control, and learns to\ncontrol the robot without expert intervention by observing the execution of\nrandom commands. We demonstrate our method on a diverse set of robot\nmanipulators, varying in actuation, materials, fabrication, and cost. Our\napproach achieves accurate closed-loop control and recovers the causal dynamic\nstructure of each robot. By enabling robot control with a generic camera as the\nonly sensor, we anticipate our work will dramatically broaden the design space\nof robotic systems and serve as a starting point for lowering the barrier to\nrobotic automation.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}