{"id":"2407.20034","title":"MaskInversion: Localized Embeddings via Optimization of Explainability\n  Maps","authors":"Walid Bousselham, Sofian Chaybouti, Christian Rupprecht, Vittorio\n  Ferrari, Hilde Kuehne","authorsParsed":[["Bousselham","Walid",""],["Chaybouti","Sofian",""],["Rupprecht","Christian",""],["Ferrari","Vittorio",""],["Kuehne","Hilde",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 14:21:07 GMT"}],"updateDate":"2024-07-30","timestamp":1722262867000,"abstract":"  Vision-language foundation models such as CLIP have achieved tremendous\nresults in global vision-language alignment, but still show some limitations in\ncreating representations for specific image regions. % To address this problem,\nwe propose MaskInversion, a method that leverages the feature representations\nof pre-trained foundation models, such as CLIP, to generate a context-aware\nembedding for a query image region specified by a mask at test time.\nMaskInversion starts with initializing an embedding token and compares its\nexplainability map, derived from the foundation model, to the query mask. The\nembedding token is then subsequently refined to approximate the query region by\nminimizing the discrepancy between its explainability map and the query mask.\nDuring this process, only the embedding vector is updated, while the underlying\nfoundation model is kept frozen allowing to use MaskInversion with any\npre-trained model. As deriving the explainability map involves computing its\ngradient, which can be expensive, we propose a gradient decomposition strategy\nthat simplifies this computation. The learned region representation can be used\nfor a broad range of tasks, including open-vocabulary class retrieval,\nreferring expression comprehension, as well as for localized captioning and\nimage generation. We evaluate the proposed method on all those tasks on several\ndatasets such as PascalVOC, MSCOCO, RefCOCO, and OpenImagesV7 and show its\ncapabilities compared to other SOTA approaches.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-d-bX1O30sCYom9l3KeBuGCIY17pl27W7SVBfZRbguw","pdfSize":"7332043"}
