{"id":"2407.13252","title":"Unveiling Structural Memorization: Structural Membership Inference\n  Attack for Text-to-Image Diffusion Models","authors":"Qiao Li, Xiaomeng Fu, Xi Wang, Jin Liu, Xingyu Gao, Jiao Dai, Jizhong\n  Han","authorsParsed":[["Li","Qiao",""],["Fu","Xiaomeng",""],["Wang","Xi",""],["Liu","Jin",""],["Gao","Xingyu",""],["Dai","Jiao",""],["Han","Jizhong",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 08:07:28 GMT"}],"updateDate":"2024-07-19","timestamp":1721290048000,"abstract":"  With the rapid advancements of large-scale text-to-image diffusion models,\nvarious practical applications have emerged, bringing significant convenience\nto society. However, model developers may misuse the unauthorized data to train\ndiffusion models. These data are at risk of being memorized by the models, thus\npotentially violating citizens' privacy rights. Therefore, in order to judge\nwhether a specific image is utilized as a member of a model's training set,\nMembership Inference Attack (MIA) is proposed to serve as a tool for privacy\nprotection. Current MIA methods predominantly utilize pixel-wise comparisons as\ndistinguishing clues, considering the pixel-level memorization characteristic\nof diffusion models. However, it is practically impossible for text-to-image\nmodels to memorize all the pixel-level information in massive training sets.\nTherefore, we move to the more advanced structure-level memorization.\nObservations on the diffusion process show that the structures of members are\nbetter preserved compared to those of nonmembers, indicating that diffusion\nmodels possess the capability to remember the structures of member images from\ntraining sets. Drawing on these insights, we propose a simple yet effective MIA\nmethod tailored for text-to-image diffusion models. Extensive experimental\nresults validate the efficacy of our approach. Compared to current pixel-level\nbaselines, our approach not only achieves state-of-the-art performance but also\ndemonstrates remarkable robustness against various distortions.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}