{"id":"2407.02231","title":"Safety-Driven Deep Reinforcement Learning Framework for Cobots: A\n  Sim2Real Approach","authors":"Ammar N. Abbas, Shakra Mehak, Georgios C. Chasparis, John D. Kelleher,\n  Michael Guilfoyle, Maria Chiara Leva, Aswin K Ramasubramanian","authorsParsed":[["Abbas","Ammar N.",""],["Mehak","Shakra",""],["Chasparis","Georgios C.",""],["Kelleher","John D.",""],["Guilfoyle","Michael",""],["Leva","Maria Chiara",""],["Ramasubramanian","Aswin K",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 12:56:17 GMT"}],"updateDate":"2024-07-03","timestamp":1719924977000,"abstract":"  This study presents a novel methodology incorporating safety constraints into\na robotic simulation during the training of deep reinforcement learning (DRL).\nThe framework integrates specific parts of the safety requirements, such as\nvelocity constraints, as specified by ISO 10218, directly within the DRL model\nthat becomes a part of the robot's learning algorithm. The study then evaluated\nthe efficiency of these safety constraints by subjecting the DRL model to\nvarious scenarios, including grasping tasks with and without obstacle\navoidance. The validation process involved comprehensive simulation-based\ntesting of the DRL model's responses to potential hazards and its compliance.\nAlso, the performance of the system is carried out by the functional safety\nstandards IEC 61508 to determine the safety integrity level. The study\nindicated a significant improvement in the safety performance of the robotic\nsystem. The proposed DRL model anticipates and mitigates hazards while\nmaintaining operational efficiency. This study was validated in a testbed with\na collaborative robotic arm with safety sensors and assessed with metrics such\nas the average number of safety violations, obstacle avoidance, and the number\nof successful grasps. The proposed approach outperforms the conventional method\nby a 16.5% average success rate on the tested scenarios in the simulations and\n2.5% in the testbed without safety violations. The project repository is\navailable at https://github.com/ammar-n-abbas/sim2real-ur-gym-gazebo.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}