{"id":"2407.18553","title":"REAPER: Reasoning based Retrieval Planning for Complex RAG Systems","authors":"Ashutosh Joshi, Sheikh Muhammad Sarwar, Samarth Varshney, Sreyashi\n  Nag, Shrivats Agrawal, and Juhi Naik","authorsParsed":[["Joshi","Ashutosh",""],["Sarwar","Sheikh Muhammad",""],["Varshney","Samarth",""],["Nag","Sreyashi",""],["Agrawal","Shrivats",""],["Naik","Juhi",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 07:05:54 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 23:41:32 GMT"}],"updateDate":"2024-08-01","timestamp":1721977554000,"abstract":"  Complex dialog systems often use retrieved evidence to facilitate factual\nresponses. Such RAG (Retrieval Augmented Generation) systems retrieve from\nmassive heterogeneous data stores that are usually architected as multiple\nindexes or APIs instead of a single monolithic source. For a given query,\nrelevant evidence needs to be retrieved from one or a small subset of possible\nretrieval sources. Complex queries can even require multi-step retrieval. For\nexample, a conversational agent on a retail site answering customer questions\nabout past orders will need to retrieve the appropriate customer order first\nand then the evidence relevant to the customer's question in the context of the\nordered product. Most RAG Agents handle such Chain-of-Thought (CoT) tasks by\ninterleaving reasoning and retrieval steps. However, each reasoning step\ndirectly adds to the latency of the system. For large models this latency cost\nis significant -- in the order of multiple seconds. Multi-agent systems may\nclassify the query to a single Agent associated with a retrieval source, though\nthis means that a (small) classification model dictates the performance of a\nlarge language model. In this work we present REAPER (REAsoning-based PlannER)\n- an LLM based planner to generate retrieval plans in conversational systems.\nWe show significant gains in latency over Agent-based systems and are able to\nscale easily to new and unseen use cases as compared to classification-based\nplanning. Though our method can be applied to any RAG system, we show our\nresults in the context of a conversational shopping assistant.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}