{"id":"2407.20177","title":"AutoScale: Automatic Prediction of Compute-optimal Data Composition for\n  Training LLMs","authors":"Feiyang Kang, Yifan Sun, Bingbing Wen, Si Chen, Dawn Song, Rafid\n  Mahmood, Ruoxi Jia","authorsParsed":[["Kang","Feiyang",""],["Sun","Yifan",""],["Wen","Bingbing",""],["Chen","Si",""],["Song","Dawn",""],["Mahmood","Rafid",""],["Jia","Ruoxi",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 17:06:30 GMT"}],"updateDate":"2024-07-30","timestamp":1722272790000,"abstract":"  To ensure performance on a diverse set of downstream tasks, LLMs are\npretrained via data mixtures over different domains. In this work, we\ndemonstrate that the optimal data composition for a fixed compute budget varies\ndepending on the scale of the training data, suggesting that the common\npractice of empirically determining an optimal composition using small-scale\nexperiments will not yield the optimal data mixtures when scaling up to the\nfinal model. To address this challenge, we propose *AutoScale*, an automated\ntool that finds a compute-optimal data composition for training at any desired\ntarget scale. AutoScale first determines the optimal composition at a small\nscale using a novel bilevel optimization framework, Direct Data Optimization\n(*DDO*), and then fits a predictor to estimate the optimal composition at\nlarger scales. The predictor's design is inspired by our theoretical analysis\nof scaling laws related to data composition, which could be of independent\ninterest. In empirical studies with pre-training 774M Decoder-only LMs (GPT-2\nLarge) on RedPajama dataset, AutoScale decreases validation perplexity at least\n25% faster than any baseline with up to 38% speed up compared to without\nreweighting, achieving the best overall performance across downstream tasks. On\npre-training Encoder-only LMs (BERT) with masked language modeling, DDO is\nshown to decrease loss on all domains while visibly improving average task\nperformance on GLUE benchmark by 8.7% and on large-scale QA dataset (SQuAD) by\n5.9% compared with without reweighting. AutoScale speeds up training by up to\n28%. Our codes are open-sourced.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}