{"id":"2407.19448","title":"Piecewise deterministic generative models","authors":"Andrea Bertazzi, Alain Oliviero-Durmus, Dario Shariatian, Umut\n  Simsekli, Eric Moulines","authorsParsed":[["Bertazzi","Andrea",""],["Oliviero-Durmus","Alain",""],["Shariatian","Dario",""],["Simsekli","Umut",""],["Moulines","Eric",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 09:53:02 GMT"}],"updateDate":"2024-07-30","timestamp":1722160382000,"abstract":"  We introduce a novel class of generative models based on piecewise\ndeterministic Markov processes (PDMPs), a family of non-diffusive stochastic\nprocesses consisting of deterministic motion and random jumps at random times.\nSimilarly to diffusions, such Markov processes admit time reversals that turn\nout to be PDMPs as well. We apply this observation to three PDMPs considered in\nthe literature: the Zig-Zag process, Bouncy Particle Sampler, and Randomised\nHamiltonian Monte Carlo. For these three particular instances, we show that the\njump rates and kernels of the corresponding time reversals admit explicit\nexpressions depending on some conditional densities of the PDMP under\nconsideration before and after a jump. Based on these results, we propose\nefficient training procedures to learn these characteristics and consider\nmethods to approximately simulate the reverse process. Finally, we provide\nbounds in the total variation distance between the data distribution and the\nresulting distribution of our model in the case where the base distribution is\nthe standard $d$-dimensional Gaussian distribution. Promising numerical\nsimulations support further investigations into this class of models.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VubDwk0pA0P3ZGcbMauJPBTMXRIe0_Z0LG1MVKOYAW8","pdfSize":"801850","objectId":"0x26be945485a6a714c17e93b7c587681be332248c90b9e5dc8418fdb870007855","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
