{"id":"2407.00241","title":"Exploiting Structure in Quantum Relative Entropy Programs","authors":"Kerry He, James Saunderson, Hamza Fawzi","authorsParsed":[["He","Kerry",""],["Saunderson","James",""],["Fawzi","Hamza",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 21:37:45 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 08:45:26 GMT"}],"updateDate":"2024-08-09","timestamp":1719610665000,"abstract":"  Quantum relative entropy programs are convex optimization problems which\nminimize a linear functional over an affine section of the epigraph of the\nquantum relative entropy function. Recently, the self-concordance of a natural\nbarrier function was proved for this set. This has opened up the opportunity to\nuse interior-point methods for nonsymmetric cone programs to solve these\noptimization problems. In this paper, we show how common structures arising\nfrom applications in quantum information theory can be exploited to improve the\nefficiency of solving quantum relative entropy programs using interior-point\nmethods. First, we show that the natural barrier function for the epigraph of\nthe quantum relative entropy composed with positive linear operators is\noptimally self-concordant, even when these linear operators map to singular\nmatrices. Compared to modelling problems using the full quantum relative\nentropy cone, this allows us to remove redundant log determinant expressions\nfrom the barrier function and reduce the overall barrier parameter. Second, we\nshow how certain slices of the quantum relative entropy cone exhibit useful\nproperties which should be exploited whenever possible to perform certain key\nsteps of interior-point methods more efficiently. We demonstrate how these\nmethods can be applied to applications in quantum information theory, including\nquantifying quantum key rates, quantum rate-distortion functions, quantum\nchannel capacities, and the ground state energy of Hamiltonians. Our numerical\nresults show that these techniques improve computation times by up to several\norders of magnitude, and allow previously intractable problems to be solved.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Information Theory","Mathematics/Information Theory","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}