{"id":"2407.17550","title":"Determining the Extents, Geometries, and Kinematics of Narrow-Line\n  Region Outflows in Nearby Seyfert Galaxies","authors":"Garrett E. Polack, Mitchell Revalski, D. Michael Crenshaw, Travis C.\n  Fischer, Henrique R. Schmitt, Steven B. Kraemer, Beena Meena, Marc Rafelski","authorsParsed":[["Polack","Garrett E.",""],["Revalski","Mitchell",""],["Crenshaw","D. Michael",""],["Fischer","Travis C.",""],["Schmitt","Henrique R.",""],["Kraemer","Steven B.",""],["Meena","Beena",""],["Rafelski","Marc",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-26","timestamp":1721844000000,"abstract":"  Outflowing gas from supermassive black holes in the centers of active\ngalaxies has been postulated as a major contributor to galactic evolution. To\nexplore the interaction between narrow-line region (NLR) outflows and their\nhost galaxies, we use Hubble Space Telescope (HST) Space Telescope Imaging\nSpectrograph (STIS) spectra and Wide Field Camera 3 (WFC3) images of 15 nearby\n(z < 0.02) active galactic nuclei (AGN) to determine the extents and geometries\nof their NLRs. We combine new HST WFC3 continuum and [O III] $\\lambda$5007A\nimages of 11 AGN with 4 archival AGN to match existing spectra from HST STIS.\nFor the 6 AGN with suitable long-slit coverage of their NLRs, we use isophotal\nfitting of ground-based images, continuum-subtracted [O III] images, and the\nSTIS spectra, to resolve, measure, and de-project the gas kinematics to the\nplane of the host galaxy disk and distinguish NLR outflows from galaxy rotation\nand/or kinematically disturbed gas. We find an average [O III] extent of\n$\\sim$680pc with a correlation between gas extent and [O III] luminosity of\nR$_\\mathrm{[O III]}$ $\\propto$ L$_{\\text{[O III]}}^{0.39}$. The measured\nextents depend strongly on the depth of the [O III] images, highlighting the\nimportance of adopting uniform thresholds when analyzing scaling relationships.\nThe outflows reach from 39-88% of the full NLR extents, and we find that all 6\nof the AGN with STIS coverage of their entire NLRs show strong kinematic\nevidence for outflows, despite previous uncertainty for these AGN. This\nsuggests that NLR outflows are ubiquitous in moderate luminosity AGN and that\nstandard criteria for kinematic modeling are essential for identifying\noutflows.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}