{"id":"2407.04349","title":"Elemental Abundances in And XIX From Coadded Spectra","authors":"L. R. Cullinane, Karoline M. Gilbert, Ivanna Escala, J. Leigh Wojno,\n  Evan N. Kirby, Kateryna A. Kvasova, Erik Tollerud, Michelle L. M. Collins, R.\n  Michael Rich","authorsParsed":[["Cullinane","L. R.",""],["Gilbert","Karoline M.",""],["Escala","Ivanna",""],["Wojno","J. Leigh",""],["Kirby","Evan N.",""],["Kvasova","Kateryna A.",""],["Tollerud","Erik",""],["Collins","Michelle L. M.",""],["Rich","R. Michael",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 08:39:10 GMT"}],"updateDate":"2024-07-08","timestamp":1720168750000,"abstract":"  With a luminosity similar to that of Milky Way dwarf spheroidal (dSph)\nsystems like Sextans, but a spatial extent similar to that of ultradiffuse\ngalaxies (UDGs), Andromeda (And) XIX is an unusual satellite of M31. To\ninvestigate the origin of this galaxy, we measure chemical abundances for\nAndXIX derived from medium-resolution (R$\\sim$6000) spectra from Keck\nII/DEIMOS. We coadd 79 red giant branch stars, grouped by photometric\nmetallicity, in order to obtain a sufficiently high signal-to-noise ratio (S/N)\nto measure 20 [Fe/H] and [$\\alpha$/Fe] abundances via spectral synthesis. The\nlatter are the first such measurements for AndXIX. The mean metallicity we\nderive for AndXIX places it $\\sim2\\sigma$ higher than the present-day stellar\nmass-metallicity relation for Local Group dwarf galaxies, potentially\nindicating it has experienced tidal stripping. A loss of gas and associated\nquenching during such a process, which prevents the extended star formation\nnecessary to produce shallow [$\\alpha$/Fe]--[Fe/H] gradients in massive\nsystems, is also consistent with the steeply decreasing [$\\alpha$/Fe]--[Fe/H]\ntrend we observe. In combination with the diffuse structure and disturbed\nkinematic properties of AndXIX, this suggests tidal interactions, rather than\ngalaxy mergers, are strong contenders for its formation.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}