{"id":"2407.11989","title":"Interconnected virtual space and Theater. Practice as research on\n  theater stage in the era of the network","authors":"Georges Gagner\\'e (INREV), C\\'edric Plessiet (INREV), R\\'emy Sohier\n  (INREV)","authorsParsed":[["Gagneré","Georges","","INREV"],["Plessiet","Cédric","","INREV"],["Sohier","Rémy","","INREV"]],"versions":[{"version":"v1","created":"Thu, 6 Jun 2024 08:02:30 GMT"}],"updateDate":"2024-07-18","timestamp":1717660950000,"abstract":"  Since 2014, we have been conducting experiments based on a multidisciplinary\ncollaboration between specialists in theatrical staging and researchers in\nvirtual reality, digital art, and video games. This team focused its work on\nthe similarities and differencesthat exist between real physical actors\n(actor-performers) and virtual digital actors (avatars). From this\nmultidisciplinary approach, experimental research-creation projects have\nemerged and rely on a physical actor playing with the image of an avatar,\ncontrolled by another physical actor via the intermediary of a low-cost\nmotion-capture system. In the first part of the paper, we will introduce the\nscenographic design on which our presentation is based, and the modifications\nwe have made in relation to our previous work. Next, in the second section, we\nwill discuss in detail the impact of augmenting the player's game using an\navatar, compared to the scenic limitations of the theatrical stage. In part\nthree of the paper, we will discuss the software-related aspects of the\nproject, focusing on exchanges between the different components of our design\nand describing the algorithms enabling us to utilize the real-time movement of\na player via various capture devices. To conclude, we will examine in detail\nhow our experimental system linking physical actors and avatars profoundly\nalters the nature of collaboration between directors, actors, and digital\nartists in terms of actor/avatar direction.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Graphics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}