{"id":"2407.12159","title":"The IoT Breaches your Household Again","authors":"Davide Bonaventura, Sergio Esposito, Giampaolo Bella","authorsParsed":[["Bonaventura","Davide",""],["Esposito","Sergio",""],["Bella","Giampaolo",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 20:30:37 GMT"}],"updateDate":"2024-07-18","timestamp":1721161837000,"abstract":"  Despite their apparent simplicity, devices like smart light bulbs and\nelectrical plugs are often perceived as exempt from rigorous security measures.\nHowever, this paper challenges this misconception, uncovering how\nvulnerabilities in these seemingly innocuous devices can expose users to\nsignificant risks. This paper extends the findings outlined in previous work,\nintroducing a novel attack scenario. This new attack allows malicious actors to\nobtain sensitive credentials, including the victim's Tapo account email and\npassword, as well as the SSID and password of her local network. Furthermore,\nwe demonstrate how these findings can be replicated, either partially or fully,\nacross other smart devices within the same IoT ecosystem, specifically those\nmanufactured by Tp-Link. Our investigation focused on the Tp-Link Tapo range,\nencompassing smart bulbs (Tapo L530E, Tapo L510E V2, and Tapo L630), a smart\nplug (Tapo P100), and a smart camera (Tapo C200). Utilizing similar\ncommunication protocols, or slight variants thereof, we found that the Tapo\nL530E, Tapo L510E V2, and Tapo L630 are susceptible to complete exploitation of\nall attack scenarios, including the newly identified one. Conversely, the Tapo\nP100 and Tapo C200 exhibit vulnerabilities to only a subset of attack\nscenarios. In conclusion, by highlighting these vulnerabilities and their\npotential impact, we aim to raise awareness and encourage proactive steps\ntowards mitigating security risks in smart device deployment.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}