{"id":"2407.10820","title":"Enabling MCTS Explainability for Sequential Planning Through Computation\n  Tree Logic","authors":"Ziyan An, Hendrik Baier, Abhishek Dubey, Ayan Mukhopadhyay and Meiyi\n  Ma","authorsParsed":[["An","Ziyan",""],["Baier","Hendrik",""],["Dubey","Abhishek",""],["Mukhopadhyay","Ayan",""],["Ma","Meiyi",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 15:35:09 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 18:00:31 GMT"}],"updateDate":"2024-07-18","timestamp":1721057709000,"abstract":"  Monte Carlo tree search (MCTS) is one of the most capable online search\nalgorithms for sequential planning tasks, with significant applications in\nareas such as resource allocation and transit planning. Despite its strong\nperformance in real-world deployment, the inherent complexity of MCTS makes it\nchallenging to understand for users without technical background. This paper\nconsiders the use of MCTS in transportation routing services, where the\nalgorithm is integrated to develop optimized route plans. These plans are\nrequired to meet a range of constraints and requirements simultaneously,\nfurther complicating the task of explaining the algorithm's operation in\nreal-world contexts. To address this critical research gap, we introduce a\nnovel computation tree logic-based explainer for MCTS. Our framework begins by\ntaking user-defined requirements and translating them into rigorous logic\nspecifications through the use of language templates. Then, our explainer\nincorporates a logic verification and quantitative evaluation module that\nvalidates the states and actions traversed by the MCTS algorithm. The outcomes\nof this analysis are then rendered into human-readable descriptive text using a\nsecond set of language templates. The user satisfaction of our approach was\nassessed through a survey with 82 participants. The results indicated that our\nexplanatory approach significantly outperforms other baselines in user\npreference.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}