{"id":"2407.12337","title":"Virtual Gram staining of label-free bacteria using darkfield microscopy\n  and deep learning","authors":"Cagatay Isil, Hatice Ceylan Koydemir, Merve Eryilmaz, Kevin de Haan,\n  Nir Pillar, Koray Mentesoglu, Aras Firat Unal, Yair Rivenson, Sukantha\n  Chandrasekaran, Omai B. Garner, Aydogan Ozcan","authorsParsed":[["Isil","Cagatay",""],["Koydemir","Hatice Ceylan",""],["Eryilmaz","Merve",""],["de Haan","Kevin",""],["Pillar","Nir",""],["Mentesoglu","Koray",""],["Unal","Aras Firat",""],["Rivenson","Yair",""],["Chandrasekaran","Sukantha",""],["Garner","Omai B.",""],["Ozcan","Aydogan",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 06:28:03 GMT"}],"updateDate":"2024-07-18","timestamp":1721197683000,"abstract":"  Gram staining has been one of the most frequently used staining protocols in\nmicrobiology for over a century, utilized across various fields, including\ndiagnostics, food safety, and environmental monitoring. Its manual procedures\nmake it vulnerable to staining errors and artifacts due to, e.g., operator\ninexperience and chemical variations. Here, we introduce virtual Gram staining\nof label-free bacteria using a trained deep neural network that digitally\ntransforms darkfield images of unstained bacteria into their Gram-stained\nequivalents matching brightfield image contrast. After a one-time training\neffort, the virtual Gram staining model processes an axial stack of darkfield\nmicroscopy images of label-free bacteria (never seen before) to rapidly\ngenerate Gram staining, bypassing several chemical steps involved in the\nconventional staining process. We demonstrated the success of the virtual Gram\nstaining workflow on label-free bacteria samples containing Escherichia coli\nand Listeria innocua by quantifying the staining accuracy of the virtual Gram\nstaining model and comparing the chromatic and morphological features of the\nvirtually stained bacteria against their chemically stained counterparts. This\nvirtual bacteria staining framework effectively bypasses the traditional Gram\nstaining protocol and its challenges, including stain standardization, operator\nerrors, and sensitivity to chemical variations.\n","subjects":["Quantitative Biology/Quantitative Methods","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing","Physics/Medical Physics","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}