{"id":"2407.00020","title":"Visual Language Model based Cross-modal Semantic Communication Systems","authors":"Feibo Jiang, Chuanguo Tang, Li Dong, Kezhi Wang, Kun Yang, Cunhua Pan","authorsParsed":[["Jiang","Feibo",""],["Tang","Chuanguo",""],["Dong","Li",""],["Wang","Kezhi",""],["Yang","Kun",""],["Pan","Cunhua",""]],"versions":[{"version":"v1","created":"Mon, 6 May 2024 08:59:16 GMT"}],"updateDate":"2024-07-02","timestamp":1714985956000,"abstract":"  Semantic Communication (SC) has emerged as a novel communication paradigm in\nrecent years, successfully transcending the Shannon physical capacity limits\nthrough innovative semantic transmission concepts. Nevertheless, extant Image\nSemantic Communication (ISC) systems face several challenges in dynamic\nenvironments, including low semantic density, catastrophic forgetting, and\nuncertain Signal-to-Noise Ratio (SNR). To address these challenges, we propose\na novel Vision-Language Model-based Cross-modal Semantic Communication\n(VLM-CSC) system. The VLM-CSC comprises three novel components: (1) Cross-modal\nKnowledge Base (CKB) is used to extract high-density textual semantics from the\nsemantically sparse image at the transmitter and reconstruct the original image\nbased on textual semantics at the receiver. The transmission of high-density\nsemantics contributes to alleviating bandwidth pressure. (2) Memory-assisted\nEncoder and Decoder (MED) employ a hybrid long/short-term memory mechanism,\nenabling the semantic encoder and decoder to overcome catastrophic forgetting\nin dynamic environments when there is a drift in the distribution of semantic\nfeatures. (3) Noise Attention Module (NAM) employs attention mechanisms to\nadaptively adjust the semantic coding and the channel coding based on SNR,\nensuring the robustness of the CSC system. The experimental simulations\nvalidate the effectiveness, adaptability, and robustness of the CSC system.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Information Theory","Computing Research Repository/Machine Learning","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}