{"id":"2407.15317","title":"Open-CD: A Comprehensive Toolbox for Change Detection","authors":"Kaiyu Li, Jiawei Jiang, Andrea Codegoni, Chengxi Han, Yupeng Deng,\n  Keyan Chen, Zhuo Zheng, Hao Chen, Zhengxia Zou, Zhenwei Shi, Sheng Fang, Deyu\n  Meng, Zhi Wang, Xiangyong Cao","authorsParsed":[["Li","Kaiyu",""],["Jiang","Jiawei",""],["Codegoni","Andrea",""],["Han","Chengxi",""],["Deng","Yupeng",""],["Chen","Keyan",""],["Zheng","Zhuo",""],["Chen","Hao",""],["Zou","Zhengxia",""],["Shi","Zhenwei",""],["Fang","Sheng",""],["Meng","Deyu",""],["Wang","Zhi",""],["Cao","Xiangyong",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 01:04:16 GMT"}],"updateDate":"2024-07-23","timestamp":1721610256000,"abstract":"  We present Open-CD, a change detection toolbox that contains a rich set of\nchange detection methods as well as related components and modules. The toolbox\nstarted from a series of open source general vision task tools, including\nOpenMMLab Toolkits, PyTorch Image Models, etc. It gradually evolves into a\nunified platform that covers many popular change detection methods and\ncontemporary modules. It not only includes training and inference codes, but\nalso provides some useful scripts for data analysis. We believe this toolbox is\nby far the most complete change detection toolbox. In this report, we introduce\nthe various features, supported methods and applications of Open-CD. In\naddition, we also conduct a benchmarking study on different methods and\ncomponents. We wish that the toolbox and benchmark could serve the growing\nresearch community by providing a flexible toolkit to reimplement existing\nmethods and develop their own new change detectors. Code and models are\navailable at \\url{https://github.com/likyoo/open-cd}. Pioneeringly, this report\nalso includes brief descriptions of the algorithms supported in Open-CD, mainly\ncontributed by their authors. We sincerely encourage researchers in this field\nto participate in this project and work together to create a more open\ncommunity. This toolkit and report will be kept updated.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}