{"id":"2407.19881","title":"The Nature of 500 micron Risers III: A Small Complete Sample","authors":"D.L. Clements, J. Cairns, J. Greenslade, G. Petitpas, Y. Ding, I.\n  P\\'erez-Fournon, D. Riechers","authorsParsed":[["Clements","D. L.",""],["Cairns","J.",""],["Greenslade","J.",""],["Petitpas","G.",""],["Ding","Y.",""],["Pérez-Fournon","I.",""],["Riechers","D.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 10:57:53 GMT"}],"updateDate":"2024-07-30","timestamp":1722250673000,"abstract":"  Herschel surveys have found large numbers of sources with red far-IR colours,\nand spectral energy distributions (SEDs) rising from 250 to 500$\\mu$m: 500\nrisers. The nature and role of these sources is not fully understood. We here\npresent Submillimeter Array (SMA) interferometric imaging at 200 GHz of a\ncomplete sample of five 500 risers with F500 $>$ 44 mJy selected within a 4.5\nsquare degree region of the XMMLSS field. These observations can resolve the\nseparate components of multiple sources and allow cross identification at other\nwavelengths using the extensive optical-to-IR data in this field. Of our five\ntargets we find that two are likely gravitationally lensed, two are multiple\nsources, and one an isolated single source. Photometric redshifts, using\noptical-to-IR data and far-IR/submm data, suggest they lie at redshifts $z \\sim\n2.5 - 3.5$. Star formation rates and stellar masses estimated from the SEDs\nshow that the majority of our sources lie on the star-formation rate-stellar\nmass `main sequence', though with outliers both above and below this relation.\nOf particular interest is our most multiple source which consists of three\nsubmm emitters and one submm-undetected optical companion within a 7 arcsecond\nregion, all with photometric redshifts $\\sim$ 3. One of the submm emitters in\nthis group lies above the `main sequence', while the optical companion lies\nwell below the relation, and has an estimated stellar mass of 3.3$\\pm 1.3\n\\times$10$^{11}$ M$_{\\odot}$. We suggest this object is a forming brightest\ncluster galaxy (BCG) in the process of accreting actively star forming\ncompanions.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"6TjoJPR--HTUVpzU7MhsKDkX84CQBjvbX9WQPPI7kV8","pdfSize":"1937646"}
