{"id":"2407.17887","title":"TIC441725813: A new bright hybrid sdB pulsator with differential\n  core/envelope rotation","authors":"Wenchao Su, St\\'ephane Charpinet, Marilyn Latour, Weikai Zong,\n  Elizabeth M Green and Gang Li","authorsParsed":[["Su","Wenchao",""],["Charpinet","Stéphane",""],["Latour","Marilyn",""],["Zong","Weikai",""],["Green","Elizabeth M",""],["Li","Gang",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 09:14:17 GMT"}],"updateDate":"2024-07-26","timestamp":1721898857000,"abstract":"  We present the detailed analysis of a new hybrid (p- and g-mode) sdB\npulsator, TIC441725813 (TYC 4427-1021-1), discovered and monitored by TESS over\n670 days. The TESS light curves available for this star were analysed using\nprewhitening techniques to extract mode frequencies accurately. The pulsation\nspectrum is then interpreted through methods that include asymptotic period\nspacing relationships and rotational multiplets identification. We also\nexploited a high signal-to-noise ratio (S/N), low-resolution spectrum of\nTIC441725813 using grids of non-local thermodynamic equilibrium (NLTE) model\natmospheres to derive its atmospheric parameters. Interestingly, several\nfrequency multiplets interpreted as rotational splittings of deep-probing\ng-modes indicate a slow rotation period of at least $85.3 \\pm 3.6$ day, while\nsplittings of mostly envelope-probing p-modes suggest a significantly shorter\nrotation period of $17.9 \\pm 0.7$ day, which implies the core (mainly the\nhelium mantle with possibly the deeper partially-mixed helium-burning core that\nit surrounds) rotates at least ~4.7 times slower than the envelope. The radial\nvelocity curves indicate that TIC441725813 is in a close binary system with a\nlow-luminosity companion, possibly a white dwarf. While elusive in the\navailable TESS photometry, a low-frequency signal that would correspond to a\nperiod of $\\sim 6.7$ h is found, albeit at low S/N. TIC441725813 is a\nparticularly interesting sdB star whose envelope rotates faster than the core.\nWe hypothesise that this might be caused by the effects of tidal interaction\nwith a companion, although in the present case, the presence of such a\ncompanion will have to be further investigated. This analysis paves the way\ntoward a more detailed seismic probing of TIC441725813 using optimisation\ntechniques, which will be presented in a second paper.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ZojNg6tBXwzQ9FyVCnb3Tmfu7PASD5ShvCbVPjzCNeI","pdfSize":"2712741","objectId":"0x1ee3995878a791296ab2d01af0ae8c8a538240bbe5ceac429a03e254e46003cd","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
