{"id":"2407.20059","title":"Improving the Accuracy of Temperature Measurement on TEM samples using\n  Plasmon Energy Expansion Thermometry (PEET): Addressing Sample Thickness\n  Effects","authors":"Yi-Chieh Yang (1), Luca Serafin (2 and 3), Nicolas Gauquelin (2 and\n  3), Johan Verbeeck (2 and 3), Joerg R. Jinschek (1) ((1) National Centre for\n  Nano Fabrication and Characterization (DTU Nanolab), Technical University of\n  Denmark (DTU), (2) Electron Microscopy for Materials Science (EMAT),\n  University of Antwerp, (3) NANOlab Center of Excellence, University of\n  Antwerp)","authorsParsed":[["Yang","Yi-Chieh","","2 and 3"],["Serafin","Luca","","2 and 3"],["Gauquelin","Nicolas","","2 and\n  3"],["Verbeeck","Johan","","2 and 3"],["Jinschek","Joerg R.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 14:45:53 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 08:52:19 GMT"}],"updateDate":"2024-08-09","timestamp":1722264353000,"abstract":"  Advances in analytical scanning transmission electron microscopy (STEM) and\nmicroelectronic mechanical systems (MEMS) based microheaters have enabled\nin-situ materials characterization at the nanometer scale at elevated\ntemperature. In addition to resolving the structural information at elevated\ntemperatures, detailed knowledge of the local temperature distribution inside\nthe sample is essential to reveal thermally induced phenomena and processes.\nHere, we investigate the accuracy of plasmon energy expansion thermometry\n(PEET) as a method to map the local temperature in a tungsten (W) lamella in a\nrange between room temperature and 700 degC. In particular, we address the\ninfluence of sample thickness in the range of a typical electron-transparent\nTEM sample (from 30 nm to 70 nm) on the temperature-dependent plasmon energy.\nThe shift in plasmon energy, used to determine the local sample temperature, is\nnot only temperature-dependent, but in case of W also thickness-dependent in\nsample thicknesses below approximately 60 nm. The results highlight the\nimportance of considering sample thickness (and especially thickness\nvariations) when analyzing the local bulk plasmon energy for temperature\nmeasurement using PEET. However, in case of W, an increasing beam broadening\n(FWHM) of the bulk plasmon peak with decreasing sample thickness can be used to\nimprove the accuracy of PEET in TEM lamellae with varying sample thickness.\n","subjects":["Condensed Matter/Materials Science","Physics/Instrumentation and Detectors"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}