{"id":"2407.04006","title":"Analysis and Optimization of RIS-Assisted Cell-Free Massive MIMO NOMA\n  Systems","authors":"Malay Chakraborty, Ekant Sharma, Himal A. Suraweera and Hien Quoc Ngo","authorsParsed":[["Chakraborty","Malay",""],["Sharma","Ekant",""],["Suraweera","Himal A.",""],["Ngo","Hien Quoc",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 15:27:16 GMT"},{"version":"v2","created":"Mon, 16 Sep 2024 19:28:19 GMT"}],"updateDate":"2024-09-18","timestamp":1720106836000,"abstract":"  We consider a reconfigurable intelligent surface (RIS) assisted cell-free\nmassive multiple-input multiple-output non-orthogonal multiple access (NOMA)\nsystem, where each access point (AP) serves all the users with the aid of the\nRIS. We practically model the system by considering imperfect instantaneous\nchannel state information (CSI) and employing imperfect successive interference\ncancellation at the users end. We first obtain the channel estimates using\nlinear minimum mean square error approach considering the spatial correlation\nat the RIS and then derive a closed-form downlink spectral efficiency (SE)\nexpression using the statistical CSI. We next formulate a joint optimization\nproblem to maximize the sum SE of the system. We first introduce a novel\nsuccessive Quadratic Transform (successive-QT) algorithm to optimize the\ntransmit power coefficients using the concept of block optimization along with\nquadratic transform and then use the particle swarm optimization technique to\ndesign the RIS phase shifts. Note that most of the existing works on RIS-aided\ncell-free systems are specific instances of the general scenario studied in\nthis work. We numerically show that i) the RIS-assisted link is more\nadvantageous at lower transmit power regions where the direct link between AP\nand user is weak, ii) NOMA outperforms orthogonal multiple access schemes in\nterms of SE, and iii) the proposed joint optimization framework significantly\nimproves the sum SE of the system.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}