{"id":"2407.02981","title":"Project Beyond: An Escape Room Game in Virtual Reality to Teach Building\n  Energy Simulations","authors":"Georg Arbesser-Rastburg, Saeed Safikhani, Matej Gustin, Christina\n  Hopfe, Gerald Schweiger, Johanna Pirker","authorsParsed":[["Arbesser-Rastburg","Georg",""],["Safikhani","Saeed",""],["Gustin","Matej",""],["Hopfe","Christina",""],["Schweiger","Gerald",""],["Pirker","Johanna",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 10:24:56 GMT"},{"version":"v2","created":"Mon, 8 Jul 2024 11:52:00 GMT"}],"updateDate":"2024-07-09","timestamp":1720002296000,"abstract":"  In recent years, Virtual Reality (VR) has found its way into different fields\nbesides pure entertainment. One of the topics that can benefit from the\nimmersive experience of VR is education. Furthermore, using game-based\napproaches in education can increase user motivation and engagement.\nAccordingly, in this paper, we designed and developed an immersive escape room\ngame in VR to teach building energy simulation topics. In the game, players\nmust solve puzzles like, for instance, assembling walls using different\nmaterials. We use a player guidance system that combines educational content,\npuzzles, and different types of hints to educate the players about parameters\nthat influence energy efficiency, structural resistance, and costs. To improve\nuser onboarding, we implemented a tutorial level to teach players general\ninteractions and locomotion. To assess the user experience, we evaluate both\nthe tutorial and the game with an expert study with gaming and VR experts\n(n=11). The participants were asked to play both the tutorial level and the\nescape room level and complete two sets of post-questionnaires, one after the\ntutorial and one after the puzzle level. The one after the tutorial level\nconsisted of NASA-TLX and SUS questionnaires, while after the escape room level\nwe asked users to complete the NASA-TLX, UESSF, and PXI questionnaires. The\nresults indicate that the onboarding level successfully provided good usability\nwhile maintaining a low task load. On the other hand, the escape room level can\nprovide an engaging, visually appealing, and usable learning environment by\narousing players' curiosity through the gameplay. This environment can be\nextended in future development stages with different educational contents from\nvarious fields.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jhpmuuv1dmnanlZdcbDVBZVjmc33iASpY-JK93ithrQ","pdfSize":"2684900"}
