{"id":"2407.04906","title":"Privacy or Transparency? Negotiated Smartphone Access as a Signifier of\n  Trust in Romantic Relationships","authors":"Periwinkle Doerfler and Kieron Ivy Turk and Chris Geeng and Damon\n  McCoy and Jeffrey Ackerman and Molly Dragiewicz","authorsParsed":[["Doerfler","Periwinkle",""],["Turk","Kieron Ivy",""],["Geeng","Chris",""],["McCoy","Damon",""],["Ackerman","Jeffrey",""],["Dragiewicz","Molly",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 00:52:34 GMT"}],"updateDate":"2024-07-09","timestamp":1720227154000,"abstract":"  In this work, we analyze two large-scale surveys to examine how individuals\nthink about sharing smartphone access with romantic partners as a function of\ntrust in relationships. We find that the majority of couples have access to\neach others' devices, but may have explicit or implicit boundaries on how this\naccess is to be used. Investigating these boundaries and related social norms,\nwe find that there is little consensus about the level of smartphone access\n(i.e., transparency), or lack thereof (i.e., privacy) that is desirable in\nromantic contexts. However, there is broad agreement that the level of access\nshould be mutual and consensual. Most individuals understand trust to be the\nbasis of their decisions about transparency and privacy. Furthermore, we find\nindividuals have crossed these boundaries, violating their partners' privacy\nand betraying their trust. We examine how, when, why, and by whom these\nbetrayals occur. We consider the ramifications of these boundary violations in\nthe case of intimate partner violence. Finally, we provide recommendations for\ndesign changes to enable technological enforcement of boundaries currently\nenforced by trust, bringing access control in line with users' sharing\npreferences.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"CAdehEepFtlJ9fyPmR_x8SWWVz0LOB3X1s_bD2AXEFM","pdfSize":"291871"}
