{"id":"2407.03388","title":"Passenger Route and Departure Time Guidance under Disruptions in\n  Oversaturated Urban Rail Transit Networks","authors":"Siyu Zhuo, Xiaoning Zhu, Pan Shang, Zhengke Liu","authorsParsed":[["Zhuo","Siyu",""],["Zhu","Xiaoning",""],["Shang","Pan",""],["Liu","Zhengke",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 09:05:03 GMT"}],"updateDate":"2024-07-08","timestamp":1719997503000,"abstract":"  The urban rail transit (URT) system attracts many commuters with its\npunctuality and convenience. However, it is vulnerable to disruptions caused by\nfactors like extreme weather and temporary equipment failures, which greatly\nimpact passengers' journeys and diminish the system's service quality. In this\nstudy, we propose targeted travel guidance for passengers at different\nspace-time locations by devising passenger rescheduling strategies during\ndisruptions. This guidance not only offers insights into route changes but also\nprovides practical recommendations for delaying departure times when required.\nWe present a novel three-feature four-group passenger classification principle,\nintegrating temporal, spatial, and spatio-temporal features to classify\npassengers in disrupted URT networks. This approach results in the creation of\nfour distinct solution spaces based on passenger groups. A mixed integer\nprogramming model is built based on individual level considering the\nFirst-in-First-out (FIFO) rule in oversaturated networks. Additionally, we\npresent a two-stage solution approach for handling the complex issues in\nlarge-scale networks. Experimental results from both small-scale artificial\nnetworks and the real-world Beijing URT network validate the efficacy of our\nproposed passenger rescheduling strategies in mitigating disruptions.\nSpecifically, when compared to scenarios with no travel guidance during\ndisruptions, our strategies achieve a substantial reduction in total passenger\ntravel time by 29.7% and 50.9% respectively, underscoring the effectiveness in\nmanaging unexpected disruptions.\n","subjects":["Physics/Physics and Society","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}