{"id":"2407.07467","title":"Bayesian weighted time-lapse full-waveform inversion using a\n  receiver-extension strategy","authors":"Sergio Luiz E. F. da Silva, Ammir Karsou, Roger M. Moreira, Marco\n  Cetale","authorsParsed":[["da Silva","Sergio Luiz E. F.",""],["Karsou","Ammir",""],["Moreira","Roger M.",""],["Cetale","Marco",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 08:50:03 GMT"}],"updateDate":"2024-07-11","timestamp":1720601403000,"abstract":"  Time-lapse full-waveform inversion (FWI) has become a powerful tool for\ncharacterizing and monitoring subsurface changes in various geophysical\napplications. However, non-repeatability (NR) issues caused, for instance, by\nGPS inaccuracies, often make it difficult to obtain unbiased time-lapse models.\nIn this work we explore the portability of combining a receiver-extension FWI\napproach and Bayesian analysis to mitigate time-lapse noises arising from NR\nissues. The receiver-extension scheme introduces an artificial degree of\nfreedom in positioning receivers, intending to minimize kinematic mismatches\nbetween modeled and observed data. Bayesian analysis systematically explores\nseveral potential solutions to mitigate time-lapse changes not associated with\nreservoir responses, assigning probabilities to each scenario based on prior\ninformation and available evidence. We consider two different subsurface models\nto demonstrate the potential of proposed approaches. First, using the Marmousi\nmodel, we investigate two NR scenarios associated with background noise in\nseismic data. Second, using a challenging deep-water Brazilian pre-salt\nsetting, we investigate several NR scenarios to simulate real-world challenges.\nOur results demonstrate that combining Bayesian analysis with the\nreceiver-extension FWI strategy can mitigate adverse NR effects successfully,\nproducing cleaner and more reliable time-lapse models than conventional\napproaches. The results also reveal that the proposed Bayesian weighted\nprocedure is a valuable tool for determining time-lapse estimates through\nstatistical analysis of pre-existing models, allowing its application in\nongoing time-lapse (4D) projects.\n","subjects":["Physics/Geophysics","Mathematics/Probability","Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}