{"id":"2407.13737","title":"Non-Fermi liquid and antiferromagnetic correlations with hole doping in\n  the bilayer two-orbital Hubbard model of La$_3$Ni$_2$O$_7$ at zero\n  temperature","authors":"Yin Chen, Yi-Heng Tian, Jia-Ming Wang, Rong-Qiang He, and Zhong-Yi Lu","authorsParsed":[["Chen","Yin",""],["Tian","Yi-Heng",""],["Wang","Jia-Ming",""],["He","Rong-Qiang",""],["Lu","Zhong-Yi",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:42:02 GMT"}],"updateDate":"2024-07-19","timestamp":1721324522000,"abstract":"  High-$T_c$ superconductivity (SC) was recently found in the bilayer material\nLa$_3$Ni$_2$O$_7$ (La327) under high pressures. We study the bilayer\ntwo-orbital Hubbard model derived from the band structure of the La327. The\nmodel is solved by cluster dynamical mean-field theory (CDMFT) with natural\norbitals renormalization group (NORG) as impurity solver at zero temperature,\nconsidering only normal states. With hole doping, we have observed sequentially\nthe Mott insulator (Mott), pseudogap (PG), non-Fermi liquid (NFL), and Fermi\nliquid (FL) phases, with quantum correlations decreasing. The ground state of\nthe La327 is in the NFL phase with Hund spin correlation, which transmits the\nNi-$3d_{z^2}$ ($z$) orbital inter-layer AFM correlation to the\nNi-$3d_{x^2-y^2}$ orbitals. When the $\\sigma$-bonding state of the $z$ orbitals\n($z+$) is no longer fully filled, the inter-layer antiferromagnetic (AFM)\ncorrelations weaken rapidly. At low pressures, the fully filled $z+$ band\nsupports a strong inter-layer AFM correlations, potentially favoring\nshort-range spin density wave (SDW) and suppressing SC. Hole doping at low\npressures may achieve a similar effect to high pressures, under which the $z+$\nband intersects with the Fermi level, and consequently the spin correlations\nweaken remarkably, potentially suppressing the possible short-range SDW and\nfavoring SC.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science","Condensed Matter/Superconductivity","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}