{"id":"2407.15647","title":"The Impact of Responsible AI Research on Innovation and Development","authors":"Ali Akbar Septiandri, Marios Constantinides, Daniele Quercia","authorsParsed":[["Septiandri","Ali Akbar",""],["Constantinides","Marios",""],["Quercia","Daniele",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:04:08 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 15:59:28 GMT"},{"version":"v3","created":"Thu, 1 Aug 2024 14:51:18 GMT"},{"version":"v4","created":"Mon, 19 Aug 2024 14:48:44 GMT"}],"updateDate":"2024-08-20","timestamp":1721657048000,"abstract":"  Translational research, especially in the fast-evolving field of Artificial\nIntelligence (AI), is key to converting scientific findings into practical\ninnovations. In Responsible AI (RAI) research, translational impact is often\nviewed through various pathways, including research papers, blogs, news\narticles, and the drafting of forthcoming AI legislation (e.g., the EU AI Act).\nHowever, the real-world impact of RAI research remains an underexplored area.\nOur study aims to capture it through two pathways: \\emph{patents} and\n\\emph{code repositories}, both of which provide a rich and structured source of\ndata. Using a dataset of 200,000 papers from 1980 to 2022 in AI and related\nfields, including Computer Vision, Natural Language Processing, and\nHuman-Computer Interaction, we developed a Sentence-Transformers Deep Learning\nframework to identify RAI papers. This framework calculates the semantic\nsimilarity between paper abstracts and a set of RAI keywords, which are derived\nfrom the NIST's AI Risk Management Framework; a framework that aims to enhance\ntrustworthiness considerations in the design, development, use, and evaluation\nof AI products, services, and systems. We identified 1,747 RAI papers published\nin top venues such as CHI, CSCW, NeurIPS, FAccT, and AIES between 2015 and\n2022. By analyzing these papers, we found that a small subset that goes into\npatents or repositories is highly cited, with the translational process taking\nbetween 1 year for repositories and up to 8 years for patents. Interestingly,\nimpactful RAI research is not limited to top U.S. institutions, but significant\ncontributions come from European and Asian institutions. Finally, the\nmultidisciplinary nature of RAI papers, often incorporating knowledge from\ndiverse fields of expertise, was evident as these papers tend to build on\nunconventional combinations of prior knowledge.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"17RN2rIi-FpeCdhx8GshpPRTySmWIeoNyhYhT1l2Wjs","pdfSize":"1030582"}
