{"id":"2407.09667","title":"Real and imaginary part symmetries (RIPS) and artifacts removal in 1H\n  magnetic resonance spectroscopy without water suppression","authors":"Zhengchao Dong","authorsParsed":[["Dong","Zhengchao",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 20:01:57 GMT"}],"updateDate":"2024-07-16","timestamp":1720814517000,"abstract":"  Purpose: Proton MR spectroscopic imaging (1H MRSI) without water suppression\n(WS) possess some distinct advantages over the conventionally used 1H MRSI with\nWS. However, the sideband artifacts in the non-water suppressed spectra hinder\nthe applications of the 1H MRSI without WS. Although many hardware or software\ntechniques to tackle the sidebands have been developed, they suffer from\nvarious shortcomings, such as the prolonged data acquisition time, insufficient\nelimination of the sidebands, or loss of some spectral information. Here, we\npresent a software method that allows the elimination of sideband artifacts\nfrom 1H MRSI data acquired without WS. Methods The presented method is based on\nthe following observations: (1) the real part of the sidebands is\nanti-symmetric, and the imaginary part of sidebands is symmetric about the\nunsuppressed water signal, which is at the center of the spectrum, and (2)\nthere is no observable metabolite resonances in the downfield region spectrum\nacquired with conventional MRSI pulse sequences. We model the complex sidebands\nin the downfield region using a singular value decomposition-based method,\nreconstruct from them the upfield sidebands according to the symmetry features\nof the sidebands, and subtract the sidebands from the spectrum. We demonstrate\nthe method using phantom and in vivo data. Results The method can remarkably\nreduce sideband artifacts in both the real and the imaginary parts of the\nspectrum. In both phantom data and high-quality in vivo data, the residual\nsidebands are smaller than those in the WS spectra. Conclusion The method\nallows to remove sideband artifacts in both the real and the imaginary parts of\nthe spectrum. The performance of the method on phantom data and high-quality in\nvivo data outperforms on poor quality in vivo data.\n","subjects":["Physics/Medical Physics","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"DqcHfoih3wiSR_I8FdrBZOoaQ3a0VmERGM4SCLTThzw","pdfSize":"1409724","objectId":"0x7e501d815fb804f17bc25495c12bb27e12e2a0cbf4cb67d2ba7a01ce8bf44a2b","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
