{"id":"2407.17650","title":"A defect-chemistry-informed phase-field model of grain growth in oxide\n  electroceramics","authors":"Kai Wang, Roger A. De Souza, Xiang-Long Peng, Rotraut Merkle, Wolfgang\n  Rheinheimer, Karsten Albe, Bai-Xiang Xu","authorsParsed":[["Wang","Kai",""],["De Souza","Roger A.",""],["Peng","Xiang-Long",""],["Merkle","Rotraut",""],["Rheinheimer","Wolfgang",""],["Albe","Karsten",""],["Xu","Bai-Xiang",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 21:34:07 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 14:12:12 GMT"}],"updateDate":"2024-07-30","timestamp":1721856847000,"abstract":"  Dopants can significantly affect the properties of oxide ceramics through\ntheir impact on the property-determined microstructure characteristics such as\ngrain boundary segregation, space charge layer formation in the grain boundary\nvicinity, and the resultant microstructure features like bimodality due to\nabnormal grain growth. To support rational oxide ceramics design, we propose a\nmultiphysics-based and defect-chemistry-informed phase-field grain growth model\nto simulate the microstructure evolution of oxide ceramics. It fully respects\nthe thermodynamics of charged point defects (oxygen vacancies and dopants) in\nboth the grain interior and boundaries and considers the competing kinetics of\ndefect diffusion and grain boundary movement. The proposed phase-field model is\nbenchmarked against well-known simplified bicrystal models, including the\nMott-Schottky and Gouy-Chapman models. Various simulation results are presented\nto reveal the impacts of defect formation energy differences between the grain\ninterior and the grain boundary core on the key microstructural aspects. In\nparticular, simulation results confirm that the solute drag effect alone can\nlead to bimodal grain size distribution, without any contribution from grain\nmisorientation and other anisotropy. Interestingly, abnormal grain growth\nsimulations demonstrate that grain boundary potentials can vary substantially:\ngrain boundaries of larger grains tend to have lower potentials than those of\nsmaller grains. Such heterogeneous grain boundary potential distribution may\ninspire a new material optimization strategy through microstructure design.\nThis study provides a comprehensive framework for defect-chemistry-consistent\ninvestigations of microstructure evolution in polycrystalline oxide ceramics,\noffering fundamental insights into in-situ processes during critical\nmanufacturing stages.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Vo0OU1crNUjtufBuXFFUj-QA2VZTzAfWX1c7yiPl-gU","pdfSize":"40161463","objectId":"0x71a56d048ac1261ca2eb7248d12b5e4f91f6c3f7cfc47d5c4206c2696b3eaefd","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
