{"id":"2407.16059","title":"Near-inertial echoes of ageostrophic instability in submesoscale\n  filaments","authors":"Erin Atkinson, James McWilliams, Nicolas Grisouard","authorsParsed":[["Atkinson","Erin",""],["McWilliams","James",""],["Grisouard","Nicolas",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 21:28:08 GMT"}],"updateDate":"2024-07-24","timestamp":1721683688000,"abstract":"  Ocean submesoscales, flows with characteristic size around 10m--10km, are\ntransitional between the larger, rotationally-constrained mesoscale and\nthree-dimensional turbulence. In this paper we present simulations of a\nsubmesoscale ocean filament. The strong vertical transport associated with\nsubmesoscale fronts and filaments ventilates the deeper water and provides a\nroute for the observed forward cascade of energy in the ocean. In our case, the\nfilament is strongly sheared in both vertical and cross-filament directions and\nis unstable. Instability indeed dominates the early behaviour with a fast\nextraction of kinetic energy from the vertically sheared thermal wind. The\nfilament is expected to be subject to instabilities, including symmetric and\nKelvin-Helmholtz instabilities. An instability emerges with a circulation that\ndoes not match either, though symmetric modes become apparent later. The action\nof the instability is sufficiently rapid that the filament does not respond in\na geostrophically balanced sense. Instead, it later exhibits vertically sheared\nnear-inertial oscillations with higher amplitude as the initial minimum\nRichardson number decreases. Horizontal gradients strengthen only briefly as\nthe fronts restratify. These unstable filaments can be generated by strong\nmixing events at pre-existing stable structures. The oscillations must also be\nconsidered when designing initial conditions for numerical experiments of\nsubmesoscale flows, where the initial state is intended to be balanced.\n","subjects":["Physics/Fluid Dynamics","Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}