{"id":"2407.01089","title":"Co-evolutionary dynamics for two adaptively coupled Theta neurons","authors":"Felix Augustsson and Erik Andreas Martens","authorsParsed":[["Augustsson","Felix",""],["Martens","Erik Andreas",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 08:46:10 GMT"}],"updateDate":"2024-07-02","timestamp":1719823570000,"abstract":"  Natural and technological networks exhibit dynamics that can lead to complex\ncooperative behaviors, such as synchronization in coupled oscillators and\nrhythmic activity in neuronal networks. Understanding these collective dynamics\nis crucial for deciphering a range of phenomena from brain activity to power\ngrid stability. Recent interest in co-evolutionary networks has highlighted the\nintricate interplay between dynamics on and of the network with mixed time\nscales. Here, we explore the collective behavior of excitable oscillators in a\nsimple networks of two Theta neurons with adaptive coupling without\nself-interaction. Through a combination of bifurcation analysis and numerical\nsimulations, we seek to understand how the level of adaptivity in the coupling\nstrength, $a$, influences the dynamics. We first investigate the dynamics\npossible in the non-adaptive limit; our bifurcation analysis reveals stability\nregions of quiescence and spiking behaviors, where the spiking frequencies\nmode-lock in a variety of configurations. Second, as we increase the adaptivity\n$a$, we observe a widening of the associated Arnol'd tongues, which may overlap\nand give room for multi-stable configurations. For larger adaptivity, the\nmode-locked regions may further undergo a period-doubling cascade into chaos.\nOur findings contribute to the mathematical theory of adaptive networks and\noffer insights into the potential mechanisms underlying neuronal communication\nand synchronization.\n","subjects":["Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}