{"id":"2407.17952","title":"BetterDepth: Plug-and-Play Diffusion Refiner for Zero-Shot Monocular\n  Depth Estimation","authors":"Xiang Zhang, Bingxin Ke, Hayko Riemenschneider, Nando Metzger, Anton\n  Obukhov, Markus Gross, Konrad Schindler, Christopher Schroers","authorsParsed":[["Zhang","Xiang",""],["Ke","Bingxin",""],["Riemenschneider","Hayko",""],["Metzger","Nando",""],["Obukhov","Anton",""],["Gross","Markus",""],["Schindler","Konrad",""],["Schroers","Christopher",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 11:16:37 GMT"}],"updateDate":"2024-07-26","timestamp":1721906197000,"abstract":"  By training over large-scale datasets, zero-shot monocular depth estimation\n(MDE) methods show robust performance in the wild but often suffer from\ninsufficiently precise details. Although recent diffusion-based MDE approaches\nexhibit appealing detail extraction ability, they still struggle in\ngeometrically challenging scenes due to the difficulty of gaining robust\ngeometric priors from diverse datasets. To leverage the complementary merits of\nboth worlds, we propose BetterDepth to efficiently achieve geometrically\ncorrect affine-invariant MDE performance while capturing fine-grained details.\nSpecifically, BetterDepth is a conditional diffusion-based refiner that takes\nthe prediction from pre-trained MDE models as depth conditioning, in which the\nglobal depth context is well-captured, and iteratively refines details based on\nthe input image. For the training of such a refiner, we propose global\npre-alignment and local patch masking methods to ensure the faithfulness of\nBetterDepth to depth conditioning while learning to capture fine-grained scene\ndetails. By efficient training on small-scale synthetic datasets, BetterDepth\nachieves state-of-the-art zero-shot MDE performance on diverse public datasets\nand in-the-wild scenes. Moreover, BetterDepth can improve the performance of\nother MDE models in a plug-and-play manner without additional re-training.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}