{"id":"2407.15851","title":"A Survey on Trustworthiness in Foundation Models for Medical Image\n  Analysis","authors":"Congzhen Shi, Ryan Rezai, Jiaxi Yang, Qi Dou, Xiaoxiao Li","authorsParsed":[["Shi","Congzhen",""],["Rezai","Ryan",""],["Yang","Jiaxi",""],["Dou","Qi",""],["Li","Xiaoxiao",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 18:07:57 GMT"}],"updateDate":"2024-07-24","timestamp":1720030077000,"abstract":"  The rapid advancement of foundation models in medical imaging represents a\nsignificant leap toward enhancing diagnostic accuracy and personalized\ntreatment. However, the deployment of foundation models in healthcare\nnecessitates a rigorous examination of their trustworthiness, encompassing\nprivacy, robustness, reliability, explainability, and fairness. The current\nbody of survey literature on foundation models in medical imaging reveals\nconsiderable gaps, particularly in the area of trustworthiness. Additionally,\nextant surveys on the trustworthiness of foundation models fail to address\ntheir specific variations and applications within the medical imaging domain.\nThis survey paper reviews the current research on foundation models in the\nmajor medical imaging applications, with a focus on segmentation, medical\nreport generation, medical question and answering (Q&A), and disease diagnosis,\nwhich includes trustworthiness discussion in their manuscripts. We explore the\ncomplex challenges of making foundation models for medical image analysis\ntrustworthy, associated with each application, and summarize the current\nconcerns and strategies to enhance trustworthiness. Furthermore, we explore the\nfuture promises of these models in revolutionizing patient care. Our analysis\nunderscores the imperative for advancing towards trustworthy AI in medical\nimage analysis, advocating for a balanced approach that fosters innovation\nwhile ensuring ethical and equitable healthcare delivery.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}