{"id":"2407.13932","title":"Excitation laser energy dependence of the gap-mode TERS spectra of\n  WS$_2$ and MoS$_2$ on silver","authors":"Andrey Krayev, Eleonora Isotta, Lauren Hoang, Jerry A. Yang, Kathryn\n  Neilson, Minyuan Wang, Noah Haughn, Eric Pop, Andrew Mannix, Oluwaseyi\n  Balogun and Chih-Feng Wang","authorsParsed":[["Krayev","Andrey",""],["Isotta","Eleonora",""],["Hoang","Lauren",""],["Yang","Jerry A.",""],["Neilson","Kathryn",""],["Wang","Minyuan",""],["Haughn","Noah",""],["Pop","Eric",""],["Mannix","Andrew",""],["Balogun","Oluwaseyi",""],["Wang","Chih-Feng",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 23:02:10 GMT"}],"updateDate":"2024-07-22","timestamp":1721343730000,"abstract":"  We present a systematic study of the dependence of gap mode tip-enhanced\nRaman scattering (TERS) of mono- and bi-layer WS$_2$ and MoS$_2$ as a function\nof excitation laser energy. We collected consecutive TERS maps of mono-and\nbi-layer regions with 6 different excitation lasers. To decrease the\nacquisition time, we used for the first time concurrent excitation and\ncollection with two lasers simultaneously. We found that the E$_{2g}$/A$_{1g}$\npeak intensity ratio for bilayer WS$_2$@Ag and the A'/A$_{1g}$ peak intensity\nratio of the out-of-plane modes for mono- and bilayer change in a significantly\nnon-monotonous way with excitation laser energies from 1.58 to 2.62 eV. The\nformer ratio increases at energies corresponding to A and B excitons in bilayer\nWS$_2$. The intensity of the A peak in the monolayer, and hence the A/A$_{1g}$\nratio, is surprisingly high at low excitation energies, dips dramatically at\nenergy corresponding to the A exciton, and is restored partially in between A\nand B excitons, though still showing a descending trend with increasing energy.\nA similar picture was observed in mono- and bi-layer MoS$_2$, though the\nexisting set of lasers did not match its excitonic profile as nicely as for\nWS$_2$. We attribute the observed behavior to intermediate (Fano resonance) or\nstrong (Rabi splitting) coupling between the excitons in transition metal\ndichalcogenides (TMDs) and the plasmons in the tip-substrate nanocavity. This\nis akin to the so-called Fano (Rabi) transparency experimentally observed in\nfar field scattering from TMDs between two plasmonic metals. The possibility of\nintermediate/strong coupling between excitonic resonances in TMDs and the\nnanocavity re-evaluates the role of resonances in gap-mode TERS and should\nbecome an important factor to be considered by TERS practitioners when planning\nexperiments. Finally, we propose the ideal substrate for efficient TERS and tip\nenhanced photoluminescence measurements.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qgodO07P2e17ViLm0eeaefKsM5xCkS87cKBM-lpq6vA","pdfSize":"2424829","objectId":"0xd1469592e9549ec4b7ca98174081ed2da0fa71b322bd08f848ee773620a978a7","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
