{"id":"2407.10215","title":"DMRIntTk: integrating different DMR sets based on density peak\n  clustering","authors":"Wenjin Zhang, Wenlong Jie, Wanxin Cui, Guihua Duan, You zou, Xiaoqing\n  Peng","authorsParsed":[["Zhang","Wenjin",""],["Jie","Wenlong",""],["Cui","Wanxin",""],["Duan","Guihua",""],["zou","You",""],["Peng","Xiaoqing",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 14:16:37 GMT"}],"updateDate":"2024-07-16","timestamp":1720966597000,"abstract":"  \\textbf{Background}: Identifying differentially methylated regions (DMRs) is\na basic task in DNA methylation analysis. However, due to the different\nstrategies adopted, different DMR sets will be predicted on the same dataset,\nwhich poses a challenge in selecting a reliable and comprehensive DMR set for\ndownstream analysis. \\textbf{Results}: Here, we develop DMRIntTk, a toolkit for\nintegrating DMR sets predicted by different methods on a same dataset. In\nDMRIntTk, the genome is segmented into bins and the reliability of each DMR set\nat different methylation thresholds is evaluated. Then, the bins are weighted\nbased on the covered DMR sets and integrated into DMRs by using a density peak\nclustering algorithm. To demonstrate the practicality of DMRIntTk, DMRIntTk was\napplied to different scenarios, including different tissues with relatively\nlarge methylation differences, cancer tissues versus normal tissues with medium\nmethylation differences, and disease tissues versus normal tissues with subtle\nmethylation differences. The results show that DMRIntTk can effectively trim\nthe regions with small methylation differences in the original DMR sets and\ntherefore it can enhance the proportion of DMRs with higher methylation\ndifferences. In addition, the overlap analysis suggests that the integrated DMR\nsets are quite comprehensive, and the functional analysis indicates the\nintegrated disease-related DMR sets are significantly enriched in biological\npathways, which are associated with the pathological mechanisms of the\ndiseases. \\textbf{Conclusions}: Conclusively, DMRIntTk can help researchers\nobtaining a reliable and comprehensive DMR set from many prediction methods.\n\\textbf{Keywords}:{Differentially methylated regions, Methylation array,\nCancer-related differentially methylated regions, Tissue-specific\ndifferentially methylated regions, Density peak clustering.}\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/"}