{"id":"2407.20146","title":"On the EFT of Dyon-Monopole Catalysis","authors":"S. Bogojevic and C.P. Burgess","authorsParsed":[["Bogojevic","S.",""],["Burgess","C. P.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 16:20:21 GMT"}],"updateDate":"2024-07-30","timestamp":1722270021000,"abstract":"  Monopole-fermion (and dyon-fermion) interactions provide a famous example\nwhere scattering from a compact object gives a cross section much larger than\nthe object's geometrical size. This underlies the phenomenon of monopole\ncatalysis of baryon-number violation because the reaction rate is much larger\nin the presence of a monopole than in its absence. It is sometimes claimed to\nviolate the otherwise generic requirement that short distance physics decouples\nfrom long-distance observables -- a property that underpins the general utility\nof effective field theory (EFT) methods. Decoupling in this context is most\nsimply expressed using point-particle effective field theories (PPEFTs)\ndesigned to capture systematically how small but massive objects influence\ntheir surroundings when probed only on length scales large compared to their\nsize. These have been tested in precision calculations of how nuclear\nproperties affect atomic energy levels for both ordinary and pionic atoms. We\nadapt the PPEFT formalism to describe low-energy $S$-wave dyon-fermion\nscattering with a view to understanding whether large catalysis cross sections\nviolate decoupling (and show why they do not). We also explore the related but\nseparate issue of the long-distance complications associated with polarizing\nthe fermion vacuum exterior to a dyon and show in some circumstances how PPEFT\nmethods can simplify calculations of low-energy fermion-dyon scattering in\ntheir presence. We propose an effective Hamiltonian governing how dyon\nexcitations respond to fermion scattering in terms of a time-dependent vacuum\nangle and outline open questions remaining in its microscopic derivation.\n","subjects":["Physics/High Energy Physics - Theory","Physics/High Energy Physics - Phenomenology","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}