{"id":"2407.13919","title":"A Multi-Messenger Search for Exotic Field Emission with a Global\n  Magnetometer Network","authors":"Sami S. Khamis, Ibrahim A. Sulai, Paul Hamilton, S. Afach, B. C.\n  Buchler, D. Budker, N. L. Figueroa, R. Folman, D. Gavil\\'an-Mart\\'in, M.\n  Givon, Z. D. Gruji\\'c, H. Guo, M. P. Hedges, D. F. Jackson Kimball, D. Kim,\n  E. Klinger, T. Kornack, A. Kryemadhi, N. Kukowski, G. Lukasiewicz, H.\n  Masia-Roig, M. Padniuk, C. A. Palm, S. Y. Park, X. Peng, M. Pospelov, S.\n  Pustelny, Y. Rosenzweig, O. M. Ruimi, P. C. Segura, T. Scholtes, Y. K.\n  Semertzidis, Y. C. Shin, J. E. Stalnaker, D. Tandon, A. Weis, A. Wickenbrock,\n  T. Wilson, T. Wu, J. Zhang, and Y. Zhao","authorsParsed":[["Khamis","Sami S.",""],["Sulai","Ibrahim A.",""],["Hamilton","Paul",""],["Afach","S.",""],["Buchler","B. C.",""],["Budker","D.",""],["Figueroa","N. L.",""],["Folman","R.",""],["Gavilán-Martín","D.",""],["Givon","M.",""],["Grujić","Z. D.",""],["Guo","H.",""],["Hedges","M. P.",""],["Kimball","D. F. Jackson",""],["Kim","D.",""],["Klinger","E.",""],["Kornack","T.",""],["Kryemadhi","A.",""],["Kukowski","N.",""],["Lukasiewicz","G.",""],["Masia-Roig","H.",""],["Padniuk","M.",""],["Palm","C. A.",""],["Park","S. Y.",""],["Peng","X.",""],["Pospelov","M.",""],["Pustelny","S.",""],["Rosenzweig","Y.",""],["Ruimi","O. M.",""],["Segura","P. C.",""],["Scholtes","T.",""],["Semertzidis","Y. K.",""],["Shin","Y. C.",""],["Stalnaker","J. E.",""],["Tandon","D.",""],["Weis","A.",""],["Wickenbrock","A.",""],["Wilson","T.",""],["Wu","T.",""],["Zhang","J.",""],["Zhao","Y.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 22:11:12 GMT"}],"updateDate":"2024-07-22","timestamp":1721340672000,"abstract":"  We present an analysis method to search for exotic low-mass field (ELF)\nbursts generated during large energy astrophysical events such as supernovae,\nbinary black hole or binary neutron star mergers, and fast radio bursts using\nthe Global Network of Optical Magnetometers for Exotic physics searches\n(GNOME). In our model, the associated gravitational waves or electromagnetic\nsignals herald the arrival of the ELF burst that interacts via coupling to the\nspin of fermions in the magnetometers. This enables GNOME to serve as a tool\nfor multi-messenger astronomy. The algorithm employs a model-agnostic\nexcess-power method to identify network-wide candidate events to be subjected\nto a model-dependent generalized likelihood-ratio test to determine their\nstatistical significance. We perform the first search with this technique on\nGNOME data coincident with the binary black hole merger S200311bg detected by\nLIGO/Virgo on the 11th of March 2020 and find no significant events. We place\nthe first lab-based limits on combinations of ELF production and coupling\nparameters.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Instrumentation and Methods for Astrophysics","Physics/High Energy Physics - Experiment","Physics/Atomic Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}