{"id":"2407.12592","title":"VegeDiff: Latent Diffusion Model for Geospatial Vegetation Forecasting","authors":"Sijie Zhao, Hao Chen, Xueliang Zhang, Pengfeng Xiao, Lei Bai and Wanli\n  Ouyang","authorsParsed":[["Zhao","Sijie",""],["Chen","Hao",""],["Zhang","Xueliang",""],["Xiao","Pengfeng",""],["Bai","Lei",""],["Ouyang","Wanli",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:15:52 GMT"}],"updateDate":"2024-07-18","timestamp":1721225752000,"abstract":"  In the context of global climate change and frequent extreme weather events,\nforecasting future geospatial vegetation states under these conditions is of\nsignificant importance. The vegetation change process is influenced by the\ncomplex interplay between dynamic meteorological variables and static\nenvironmental variables, leading to high levels of uncertainty. Existing\ndeterministic methods are inadequate in addressing this uncertainty and fail to\naccurately model the impact of these variables on vegetation, resulting in\nblurry and inaccurate forecasting results. To address these issues, we propose\nVegeDiff for the geospatial vegetation forecasting task. To our best knowledge,\nVegeDiff is the first to employ a diffusion model to probabilistically capture\nthe uncertainties in vegetation change processes, enabling the generation of\nclear and accurate future vegetation states. VegeDiff also separately models\nthe global impact of dynamic meteorological variables and the local effects of\nstatic environmental variables, thus accurately modeling the impact of these\nvariables. Extensive experiments on geospatial vegetation forecasting tasks\ndemonstrate the effectiveness of VegeDiff. By capturing the uncertainties in\nvegetation changes and modeling the complex influence of relevant variables,\nVegeDiff outperforms existing deterministic methods, providing clear and\naccurate forecasting results of future vegetation states. Interestingly, we\ndemonstrate the potential of VegeDiff in applications of forecasting future\nvegetation states from multiple aspects and exploring the impact of\nmeteorological variables on vegetation dynamics. The code of this work will be\navailable at https://github.com/walking-shadow/ Official_VegeDiff.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}