{"id":"2407.06858","title":"New Rotation Period Measurements for Kepler Stars Using Deep Learning:\n  The 100K Sample","authors":"Ilay Kamai, Hagai B. Perets","authorsParsed":[["Kamai","Ilay",""],["Perets","Hagai B.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 13:45:57 GMT"}],"updateDate":"2024-07-10","timestamp":1720532757000,"abstract":"  We propose a new framework to predict stellar properties from light curves.\nWe analyze the light-curve data from the Kepler space mission and develop a\nnovel tool for deriving the stellar rotation periods for main-sequence stars.\nUsing this tool, we provide the largest (108785 stars) and most accurate (an\naverage error of $1.6$ Days) sample of stellar rotations to date. Our model,\nLightPred, is a novel deep-learning model designed to extract stellar rotation\nperiods from light curves. The model utilizes a dual-branch architecture\ncombining Long Short-Term Memory (LSTM) and Transformer components to capture\nboth temporal and global features within the data. We train LightPred on a\ndataset of simulated light curves generated using a realistic spot model and\nenhance its performance through self-supervised contrastive pre-training on\nKepler light curves. Our evaluation demonstrates that LightPred outperforms\nclassical methods like the Autocorrelation Function (ACF) in terms of accuracy\nand robustness. We apply LightPred to the Kepler dataset, generating the\nlargest catalog to date of stellar rotation periods for main-sequence stars.\nOur analysis reveals a systematic shift towards shorter periods compared to\nprevious studies, suggesting a potential revision of stellar age estimates. We\nalso investigate the impact of stellar activity on period determination and\nfind evidence for a distinct period-activity relation. Additionally, we confirm\ntidal synchronization in eclipsing binaries with orbital periods shorter than\n10 days. Our findings highlight the potential of deep learning in extracting\nfundamental stellar properties from light curves, opening new avenues for\nunderstanding stellar evolution and population demographics.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}