{"id":"2407.10586","title":"COSMU: Complete 3D human shape from monocular unconstrained images","authors":"Marco Pesavento, Marco Volino and Adrian Hilton","authorsParsed":[["Pesavento","Marco",""],["Volino","Marco",""],["Hilton","Adrian",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 10:06:59 GMT"}],"updateDate":"2024-07-16","timestamp":1721038019000,"abstract":"  We present a novel framework to reconstruct complete 3D human shapes from a\ngiven target image by leveraging monocular unconstrained images. The objective\nof this work is to reproduce high-quality details in regions of the\nreconstructed human body that are not visible in the input target. The proposed\nmethodology addresses the limitations of existing approaches for reconstructing\n3D human shapes from a single image, which cannot reproduce shape details in\noccluded body regions. The missing information of the monocular input can be\nrecovered by using multiple views captured from multiple cameras. However,\nmulti-view reconstruction methods necessitate accurately calibrated and\nregistered images, which can be challenging to obtain in real-world scenarios.\nGiven a target RGB image and a collection of multiple uncalibrated and\nunregistered images of the same individual, acquired using a single camera, we\npropose a novel framework to generate complete 3D human shapes. We introduce a\nnovel module to generate 2D multi-view normal maps of the person registered\nwith the target input image. The module consists of body part-based reference\nselection and body part-based registration. The generated 2D normal maps are\nthen processed by a multi-view attention-based neural implicit model that\nestimates an implicit representation of the 3D shape, ensuring the reproduction\nof details in both observed and occluded regions. Extensive experiments\ndemonstrate that the proposed approach estimates higher quality details in the\nnon-visible regions of the 3D clothed human shapes compared to related methods,\nwithout using parametric models.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}