{"id":"2407.00013","title":"A Hybrid Approach to Monitor Context Parameters for Optimising Caching\n  for Context-Aware IoT Applications","authors":"Ashish Manchanda, Prem Prakash Jayaraman, Abhik Banerjee, Arkady\n  Zaslavsky, Shakthi Weerasinghe, Guang-Li Huang","authorsParsed":[["Manchanda","Ashish",""],["Jayaraman","Prem Prakash",""],["Banerjee","Abhik",""],["Zaslavsky","Arkady",""],["Weerasinghe","Shakthi",""],["Huang","Guang-Li",""]],"versions":[{"version":"v1","created":"Wed, 1 May 2024 00:12:27 GMT"}],"updateDate":"2024-07-02","timestamp":1714522347000,"abstract":"  Internet of Things (IoT) has seen a prolific rise in recent times and\nprovides the ability to solve several key challenges faced by our societies and\nenvironment. Data produced by IoT provides a significant opportunity to infer\ncontext that is key for IoT applications to make decisions/actuations. Context\nManagement Platform (CMP) is a middleware to facilitate the exchange and\nmanagement of such context information among IoT applications. In this paper,\nwe propose a novel approach to monitoring context freshness as a key metric, to\nimproving the CMP's caching performance to support the real-time context needs\nof IoT applications. Our proposed hybrid algorithm uses Analytic Hierarchy\nProcess (AHP) and Sliding Window technique to ensure the most relevant (as\nneeded by the IoT applications) context information is cached. By continuously\nmonitoring and prioritizing context attributes, the strategy adapts to IoT\nenvironment changes, keeping cached context fresh and reliable. Through\nexperimental evaluation and using mock data obtained from a real-world mobile\nIoT scenario in section~\\ref{use case}, we demonstrate that the proposed\nalgorithm can substantially enhance context cache performance, by monitoring\nthe context attributes in real time.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}