{"id":"2407.20220","title":"Ionospheric contributions to the excess power in high-redshift 21-cm\n  power-spectrum observations with LOFAR","authors":"S.A. Brackenhoff, M. Mevius, L.V.E. Koopmans, A. Offringa, E.\n  Ceccotti, J.K. Chege, B.K. Gehlot, S. Ghosh, C. H\\\"ofer, F.G. Mertens, S.\n  Munshi and S. Zaroubi","authorsParsed":[["Brackenhoff","S. A.",""],["Mevius","M.",""],["Koopmans","L. V. E.",""],["Offringa","A.",""],["Ceccotti","E.",""],["Chege","J. K.",""],["Gehlot","B. K.",""],["Ghosh","S.",""],["Höfer","C.",""],["Mertens","F. G.",""],["Munshi","S.",""],["Zaroubi","S.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 17:55:36 GMT"}],"updateDate":"2024-08-02","timestamp":1722275736000,"abstract":"  The turbulent ionosphere causes phase shifts to incoming radio waves on a\nbroad range of temporal and spatial scales. When an interferometer is not\nsufficiently calibrated for the direction-dependent ionospheric effects, the\ntime-varying phase shifts can cause the signal to decorrelate. The ionosphere's\ninfluence over various spatiotemporal scales introduces a baseline-dependent\neffect on the interferometric array. We study the impact of baseline-dependent\ndecorrelation on high-redshift observations with the Low Frequency Array\n(LOFAR). Datasets with a range of ionospheric corruptions are simulated using a\nthin-screen ionosphere model, and calibrated using the state-of-the-art LOFAR\nEpoch of Reionisation pipeline. For the first time ever, we show the\nionospheric impact on various stages of the calibration process including an\nanalysis of the transfer of gain errors from longer to shorter baselines using\nrealistic end-to-end simulations. We find that direction-dependent calibration\nfor source subtraction leaves excess power of up to two orders of magnitude\nabove the thermal noise at the largest spectral scales in the cylindrically\naveraged auto-power spectrum under normal ionospheric conditions. However, we\ndemonstrate that this excess power can be removed through Gaussian process\nregression, leaving no excess power above the ten per cent level for a $5~$km\ndiffractive scale. We conclude that ionospheric errors, in the absence of\ninteractions with other aggravating effects, do not constitute a dominant\ncomponent in the excess power observed in LOFAR Epoch of Reionisation\nobservations of the North Celestial Pole. Future work should therefore focus on\nless spectrally smooth effects, such as beam modelling errors.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}