{"id":"2407.18187","title":"First Demonstration of HZO/beta-Ga2O3 Ferroelectric FinFET with Improved\n  Memory Window","authors":"Seohyeon Park, Jaewook Yoo, Hyeojun Song, Hongseung Lee, Seongbin Lim,\n  Soyeon Kim, Minah Park, Bongjoong Kim, Keun Heo, Peide D. Ye and Hagyoul Bae","authorsParsed":[["Park","Seohyeon",""],["Yoo","Jaewook",""],["Song","Hyeojun",""],["Lee","Hongseung",""],["Lim","Seongbin",""],["Kim","Soyeon",""],["Park","Minah",""],["Kim","Bongjoong",""],["Heo","Keun",""],["Ye","Peide D.",""],["Bae","Hagyoul",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 16:49:56 GMT"}],"updateDate":"2024-07-26","timestamp":1721926196000,"abstract":"  We have experimentally demonstrated the effectiveness of beta-gallium oxide\n(beta-Ga2O3) ferroelectric fin field-effect transistors (Fe-FinFETs) for the\nfirst time. Atomic layer deposited (ALD) hafnium zirconium oxide (HZO) is used\nas the ferroelectric layer. The HZO/beta-Ga2O3 Fe-FinFETs have wider\ncounterclockwise hysteresis loops in the transfer characteristics than that of\nconventional planar FET, achieving record-high memory window (MW) of 13.9 V in\na single HZO layer. When normalized to the actual channel width, FinFETs show\nan improved ION/IOFF ratio of 2.3x10^7 and a subthreshold swing value of 110\nmV/dec. The enhanced characteristics are attributed to the low-interface state\ndensity (Dit), showing good interface properties between the beta-Ga2O3 and HZO\nlayer. The enhanced polarization due to larger electric fields across the\nentire ferroelectric layer in FinFETs is validated using Sentaurus TCAD. After\n5x10^6 program/erase (PGM/ERS) cycles, the MW was maintained at 9.2 V, and the\nretention time was measured up to 3x10^4 s with low degradation. Therefore, the\nultrawide bandgap (UWBG) Fe-FinFET was shown to be one of the promising\ncandidates for high-density non-volatile memory devices.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}