{"id":"2407.17742","title":"A high-order, high-efficiency adaptive time filter algorithm for shale\n  reservoir model based on coupled fluid flow with porous media flow","authors":"Jian Li, Lele Chen, Yi Qin and Zhangxin Chen","authorsParsed":[["Li","Jian",""],["Chen","Lele",""],["Qin","Yi",""],["Chen","Zhangxin",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 03:34:00 GMT"}],"updateDate":"2024-07-26","timestamp":1721878440000,"abstract":"  In this paper, a third-order time adaptive algorithm with less computation,\nlow complexity is provided for shale reservoir model based on coupled fluid\nflow with porous media flow. The algorithm combines the three-step linear time\nfilters method for simple post-processing and the second-order backward\ndifferential formula (BDF2), is third-order accurate and provides, at no extra\ncomputational complexity. At the same time, the time filter method can also be\nused to damp non-physical oscillations inherent in the BDF2 method, ensuring\nstability. We proves the variable time stepsize second-order backward\ndifferential formula plus time filter (BDF2-TF) algorithm's stability and the\nconvergence properties of the fluid velocity u and hydraulic head $\\phi$ in the\n$L^2$ norm with an order of $O(k_{n+1}^3 + h^3)$. In the experiments, the\nadaptive algorithm automatically adjusts the time step in response to the\nvarying characteristics of different models, ensuring that errors are\nmaintained within acceptable limits. This algorithm addresses the issue that\nhigh-order algorithms may select inappropriate time steps, resulting in\ninstability or reduced precision of the numerical solution, thereby enhancing\ncalculation accuracy and efficiency. We perform three-dimensional numerical\nexperiments to verify the BDF2-TF algorithm's effectiveness, stability, and\nthird-order convergence. Simultaneously, a simplified model is employed to\nsimulate the process of shale oil extraction from reservoirs, further\ndemonstrating the algorithm's practical applicability.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Mathematics/Analysis of PDEs"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}