{"id":"2407.17422","title":"The QBO, the annual cycle, and their interactions: Isolating periodic\n  modes with Koopman analysis","authors":"Claire Valva and Edwin P. Gerber","authorsParsed":[["Valva","Claire",""],["Gerber","Edwin P.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 16:58:49 GMT"}],"updateDate":"2024-07-25","timestamp":1721840329000,"abstract":"  The Quasi-Biennial Oscillation (QBO) is the dominant mode of variability in\nthe equatorial stratosphere. It is characterized by alternating descending\neasterly and westerly jets over a period of approximately 28 months. It has\nlong been known that the QBO interactions with the annual cycle, e.g., through\nvariation in tropical upwelling, leading to variations in the descent rate of\nthe jets and, resultingly, the QBO period. Understanding these interactions,\nhowever, has been hindered by the fact that conventional measures of the QBO\nconvolve these interactions. Koopman formalism, derived from dynamical systems,\nallows one to decompose spatio-temporal datasets (or nonlinear systems) into\nspatial modes that evolve coherently with distinct frequencies. We use a\ndata-driven approximation of the Koopman operator on zonal-mean zonal-wind to\nfind modes that correspond to the annual cycle, the QBO, and the nonlinear\ninteractions between the two. From these modes, we establish a data-driven\nindex for a \"pure\" QBO that is independent of the annual cycle and investigate\nhow the annual cycle modulates the QBO. We begin with what is already known,\nquantifying the Holton-Tan effect, a nonlinear interaction between the QBO and\nthe annual cycle of the polar stratospheric vortex. We then use the pure QBO to\ndo something new, quantifying how the annual cycle changes the descent rate of\nthe QBO, revealing annual variations with amplitudes comparable to the $30 \\,\n\\mathrm{m} \\, \\mathrm{day}^{-1}$ mean descent rate. We compare these results to\nthe annual variation in tropical upwelling and interpret then with a simple\nmodel.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}