{"id":"2407.11279","title":"Static Detection of Filesystem Vulnerabilities in Android Systems","authors":"Yu-Tsung Lee and Hayawardh Vijayakumar and Zhiyun Qian and Trent\n  Jaeger","authorsParsed":[["Lee","Yu-Tsung",""],["Vijayakumar","Hayawardh",""],["Qian","Zhiyun",""],["Jaeger","Trent",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 23:10:52 GMT"}],"updateDate":"2024-07-17","timestamp":1721085052000,"abstract":"  Filesystem vulnerabilities persist as a significant threat to Android\nsystems, despite various proposed defenses and testing techniques. The\ncomplexity of program behaviors and access control mechanisms in Android\nsystems makes it challenging to effectively identify these vulnerabilities. In\nthis paper, we present PathSentinel, which overcomes the limitations of\nprevious techniques by combining static program analysis and access control\npolicy analysis to detect three types of filesystem vulnerabilities: path\ntraversals, hijacking vulnerabilities, and luring vulnerabilities. By unifying\nprogram and access control policy analysis, PathSentinel identifies attack\nsurfaces accurately and prunes many impractical attacks to generate input\npayloads for vulnerability testing. To streamline vulnerability validation,\nPathSentinel leverages large language models (LLMs) to generate targeted\nexploit code based on the identified vulnerabilities and generated input\npayloads. The LLMs serve as a tool to reduce the engineering effort required\nfor writing test applications, demonstrating the potential of combining static\nanalysis with LLMs to enhance the efficiency of exploit generation and\nvulnerability validation. Evaluation on Android 12 and 14 systems from Samsung\nand OnePlus demonstrates PathSentinel's effectiveness, uncovering 51 previously\nunknown vulnerabilities among 217 apps with only 2 false positives. These\nresults underscore the importance of combining program and access control\npolicy analysis for accurate vulnerability detection and highlight the\npromising direction of integrating LLMs for automated exploit generation,\nproviding a comprehensive approach to enhancing the security of Android systems\nagainst filesystem vulnerabilities.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}