{"id":"2407.14514","title":"Accelerate Intermittent Deep Inference","authors":"Ziliang Zhang","authorsParsed":[["Zhang","Ziliang",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 20:15:16 GMT"}],"updateDate":"2024-07-23","timestamp":1719864916000,"abstract":"  Emerging research in edge devices and micro-controller units (MCU) enables\non-device computation of Deep Learning Training and Inferencing tasks. More\nrecently, contemporary trends focus on making the Deep Neural Net (DNN) Models\nrunnable on battery-less intermittent devices. One of the approaches is to\nshrink the DNN models by enabling weight sharing, pruning, and conducted Neural\nArchitecture Search (NAS) with optimized search space to target specific edge\ndevices \\cite{Cai2019OnceFA} \\cite{Lin2020MCUNetTD} \\cite{Lin2021MCUNetV2MP}\n\\cite{Lin2022OnDeviceTU}. Another approach analyzes the intermittent execution\nand designs the corresponding system by performing NAS that is aware of\nintermittent execution cycles and resource constraints \\cite{iNAS}\n\\cite{HW-NAS} \\cite{iLearn}.\n  However, the optimized NAS was only considering consecutive execution with no\npower loss, and intermittent execution designs only focused on balancing data\nreuse and costs related to intermittent inference and often with low accuracy.\nWe proposed Accelerated Intermittent Deep Inference to harness the power of\noptimized inferencing DNN models specifically targeting SRAM under 256KB and\nmake it schedulable and runnable within intermittent power. Our main\ncontribution is: (1) Schedule tasks performed by on-device inferencing into\nintermittent execution cycles and optimize for latency; (2) Develop a system\nthat can satisfy the end-to-end latency while achieving a much higher accuracy\ncompared to baseline \\cite{iNAS} \\cite{HW-NAS}\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IelFoqW5ZSrkS0I_wuJUKwqU_hPkf2KnM2FNYfcqBN0","pdfSize":"6987451"}
