{"id":"2407.19979","title":"Private and Secure Fuzzy Name Matching","authors":"Harsh Kasyap, Ugur Ilker Atmaca, Carsten Maple, Graham Cormode,\n  Jiancong He","authorsParsed":[["Kasyap","Harsh",""],["Atmaca","Ugur Ilker",""],["Maple","Carsten",""],["Cormode","Graham",""],["He","Jiancong",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 13:11:53 GMT"}],"updateDate":"2024-07-30","timestamp":1722258713000,"abstract":"  Modern financial institutions rely on data for many operations, including a\nneed to drive efficiency, enhance services and prevent financial crime. Data\nsharing across an organisation or between institutions can facilitate rapid,\nevidence-based decision making, including identifying money laundering and\nfraud. However, data privacy regulations impose restrictions on data sharing.\nPrivacy-enhancing technologies are being increasingly employed to allow\norganisations to derive shared intelligence while ensuring regulatory\ncompliance. This paper examines the case in which regulatory restrictions mean\na party cannot share data on accounts of interest with another (internal or\nexternal) party to identify people that hold an account in each dataset. We\nobserve that the names of account holders may be recorded differently in each\ndata set. We introduce a novel privacy-preserving approach for fuzzy name\nmatching across institutions, employing fully homomorphic encryption with\nlocality-sensitive hashing. The efficiency of the approach is enhanced using a\nclustering mechanism. The practicality and effectiveness of the proposed\napproach are evaluated using different datasets. Experimental results\ndemonstrate it takes around 100 and 1000 seconds to search 1000 names from 10k\nand 100k names, respectively. Moreover, the proposed approach exhibits\nsignificant improvement in reducing communication overhead by 30-300 times,\nusing clustering.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7cZ217vxgXwhCPaWTZxxCMinTETXf52S2VmWP6IxG7c","pdfSize":"689914"}
