{"id":"2407.21364","title":"Personalized Multi-task Training for Recommender System","authors":"Liangwei Yang, Zhiwei Liu, Jianguo Zhang, Rithesh Murthy, Shelby\n  Heinecke, Huan Wang, Caiming Xiong, Philip S. Yu","authorsParsed":[["Yang","Liangwei",""],["Liu","Zhiwei",""],["Zhang","Jianguo",""],["Murthy","Rithesh",""],["Heinecke","Shelby",""],["Wang","Huan",""],["Xiong","Caiming",""],["Yu","Philip S.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 06:27:06 GMT"}],"updateDate":"2024-08-01","timestamp":1722407226000,"abstract":"  In the vast landscape of internet information, recommender systems (RecSys)\nhave become essential for guiding users through a sea of choices aligned with\ntheir preferences. These systems have applications in diverse domains, such as\nnews feeds, game suggestions, and shopping recommendations. Personalization is\na key technique in RecSys, where modern methods leverage representation\nlearning to encode user/item interactions into embeddings, forming the\nfoundation for personalized recommendations. However, integrating information\nfrom multiple sources to enhance recommendation performance remains\nchallenging. This paper introduces a novel approach named PMTRec, the first\npersonalized multi-task learning algorithm to obtain comprehensive user/item\nembeddings from various information sources. Addressing challenges specific to\npersonalized RecSys, we develop modules to handle personalized task weights,\ndiverse task orientations, and variations in gradient magnitudes across tasks.\nPMTRec dynamically adjusts task weights based on gradient norms for each\nuser/item, employs a Task Focusing module to align gradient combinations with\nthe main recommendation task, and uses a Gradient Magnitude Balancing module to\nensure balanced training across tasks. Through extensive experiments on three\nreal-world datasets with different scales, we demonstrate that PMTRec\nsignificantly outperforms existing multi-task learning methods, showcasing its\neffectiveness in achieving enhanced recommendation accuracy by leveraging\nmultiple tasks simultaneously. Our contributions open new avenues for advancing\npersonalized multi-task training in recommender systems.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}