{"id":"2407.16126","title":"MxT: Mamba x Transformer for Image Inpainting","authors":"Shuang Chen, Amir Atapour-Abarghouei, Haozheng Zhang, Hubert P. H.\n  Shum","authorsParsed":[["Chen","Shuang",""],["Atapour-Abarghouei","Amir",""],["Zhang","Haozheng",""],["Shum","Hubert P. H.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 02:21:11 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 16:20:18 GMT"},{"version":"v3","created":"Thu, 15 Aug 2024 21:11:10 GMT"}],"updateDate":"2024-08-19","timestamp":1721701271000,"abstract":"  Image inpainting, or image completion, is a crucial task in computer vision\nthat aims to restore missing or damaged regions of images with semantically\ncoherent content. This technique requires a precise balance of local texture\nreplication and global contextual understanding to ensure the restored image\nintegrates seamlessly with its surroundings. Traditional methods using\nConvolutional Neural Networks (CNNs) are effective at capturing local patterns\nbut often struggle with broader contextual relationships due to the limited\nreceptive fields. Recent advancements have incorporated transformers,\nleveraging their ability to understand global interactions. However, these\nmethods face computational inefficiencies and struggle to maintain fine-grained\ndetails. To overcome these challenges, we introduce MxT composed of the\nproposed Hybrid Module (HM), which combines Mamba with the transformer in a\nsynergistic manner. Mamba is adept at efficiently processing long sequences\nwith linear computational costs, making it an ideal complement to the\ntransformer for handling long-scale data interactions. Our HM facilitates\ndual-level interaction learning at both pixel and patch levels, greatly\nenhancing the model to reconstruct images with high quality and contextual\naccuracy. We evaluate MxT on the widely-used CelebA-HQ and Places2-standard\ndatasets, where it consistently outperformed existing state-of-the-art methods.\nThe code will be released: {\\url{https://github.com/ChrisChen1023/MxT}}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}