{"id":"2407.02658","title":"Efficient Exact Algorithms for Minimum Covering of Orthogonal Polygons\n  with Squares","authors":"Anubhav Dhar, Subham Ghosh, Sudeshna Kolay","authorsParsed":[["Dhar","Anubhav",""],["Ghosh","Subham",""],["Kolay","Sudeshna",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 20:47:42 GMT"}],"updateDate":"2024-07-04","timestamp":1719953262000,"abstract":"  The Orthogonal Polygon Covering with Squares (OPCS) problem takes as input an\northogonal polygon $P$ without holes with $n$ vertices, where vertices have\nintegral coordinates. The aim is to find a minimum number of axis-parallel,\npossibly overlapping squares which lie completely inside $P$, such that their\nunion covers the entire region inside $P$. Aupperle et.\nal~\\cite{aupperle1988covering} provide an $\\mathcal O(N^{1.5})$-time algorithm\nto solve OPCS for orthogonal polygons without holes, where $N$ is the number of\nintegral lattice points lying in the interior or on the boundary of $P$.\nDesigning algorithms for OPCS with a running time polynomial in $n$ (the number\nof vertices of $P$) was discussed as an open question in\n\\cite{aupperle1988covering}, since $N$ can be exponentially larger than $n$. In\nthis paper we design a polynomial-time exact algorithm for OPCS with a running\ntime of $\\mathcal O(n^{14})$.\n  We also consider the following structural parameterized version of the\nproblem. A knob in an orthogonal polygon is a polygon edge whose both endpoints\nare convex polygon vertices. Given an input orthogonal polygon with $n$\nvertices and $k$ knobs, we design an algorithm for OPCS with running time\n$\\mathcal O(n^2 + k^{14} \\cdot n)$.\n  In \\cite{aupperle1988covering}, the Orthogonal Polygon with Holes Covering\nwith Squares (OPCSH) problem is also studied where orthogonal polygon could\nhave holes, and the objective is to find a minimum square covering of the input\npolygon. This is shown to be NP-complete. We think there is an error in the\nexisting proof in \\cite{aupperle1988covering}, where a reduction from Planar\n3-CNF is shown. We fix this error in the proof with an alternate construction\nof one of the gadgets used in the reduction, hence completing the proof of\nNP-completeness of OPCSH.\n","subjects":["Computing Research Repository/Computational Geometry"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}