{"id":"2407.06295","title":"Engineering morphogenesis of cell clusters with differentiable\n  programming","authors":"Ramya Deshpande, Francesco Mottes, Ariana-Dalia Vlad, Michael P.\n  Brenner, Alma dal Co","authorsParsed":[["Deshpande","Ramya",""],["Mottes","Francesco",""],["Vlad","Ariana-Dalia",""],["Brenner","Michael P.",""],["Co","Alma dal",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:05:11 GMT"}],"updateDate":"2024-07-10","timestamp":1720461911000,"abstract":"  Understanding the rules underlying organismal development is a major unsolved\nproblem in biology. Each cell in a developing organism responds to signals in\nits local environment by dividing, excreting, consuming, or reorganizing, yet\nhow these individual actions coordinate over a macroscopic number of cells to\ngrow complex structures with exquisite functionality is unknown. Here we use\nrecent advances in automatic differentiation to discover local interaction\nrules and genetic networks that yield emergent, systems-level characteristics\nin a model of development. We consider a growing tissue with cellular\ninteractions are mediated by morphogen diffusion, differential cell adhesion\nand mechanical stress. Each cell has an internal genetic network that it uses\nto make decisions based on its local environment. We show that one can\nsimultaneously learn parameters governing the cell interactions and the genetic\nnetwork for complex developmental scenarios, including the symmetry breaking of\nan embryo from an initial cell, the creation of emergent chemical\ngradients,homogenization of growth via mechanical stress, programmed growth\ninto a prespecified shape, and the ability to repair from damage. When combined\nwith recent experimental advances measuring spatio-temporal dynamics and gene\nexpression of cells in a growing tissue, the methodology outlined here offers a\npromising path to unravelling the cellular basis of development.\n","subjects":["Quantitative Biology/Cell Behavior","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}