{"id":"2407.12276","title":"VCP-CLIP: A visual context prompting model for zero-shot anomaly\n  segmentation","authors":"Zhen Qu, Xian Tao, Mukesh Prasad, Fei Shen, Zhengtao Zhang, Xinyi\n  Gong, Guiguang Ding","authorsParsed":[["Qu","Zhen",""],["Tao","Xian",""],["Prasad","Mukesh",""],["Shen","Fei",""],["Zhang","Zhengtao",""],["Gong","Xinyi",""],["Ding","Guiguang",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 02:54:41 GMT"}],"updateDate":"2024-07-18","timestamp":1721184881000,"abstract":"  Recently, large-scale vision-language models such as CLIP have demonstrated\nimmense potential in zero-shot anomaly segmentation (ZSAS) task, utilizing a\nunified model to directly detect anomalies on any unseen product with\npainstakingly crafted text prompts. However, existing methods often assume that\nthe product category to be inspected is known, thus setting product-specific\ntext prompts, which is difficult to achieve in the data privacy scenarios.\nMoreover, even the same type of product exhibits significant differences due to\nspecific components and variations in the production process, posing\nsignificant challenges to the design of text prompts. In this end, we propose a\nvisual context prompting model (VCP-CLIP) for ZSAS task based on CLIP. The\ninsight behind VCP-CLIP is to employ visual context prompting to activate\nCLIP's anomalous semantic perception ability. In specific, we first design a\nPre-VCP module to embed global visual information into the text prompt, thus\neliminating the necessity for product-specific prompts. Then, we propose a\nnovel Post-VCP module, that adjusts the text embeddings utilizing the\nfine-grained features of the images. In extensive experiments conducted on 10\nreal-world industrial anomaly segmentation datasets, VCP-CLIP achieved\nstate-of-the-art performance in ZSAS task. The code is available at\nhttps://github.com/xiaozhen228/VCP-CLIP.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}