{"id":"2407.20992","title":"Compact assessment of molecular surface complementarities enhances\n  neural network-aided prediction of key binding residues","authors":"Greta Grassmann, Lorenzo Di Rienzo, Giancarlo Ruocco, Mattia Miotto,\n  Edoardo Milanetti","authorsParsed":[["Grassmann","Greta",""],["Di Rienzo","Lorenzo",""],["Ruocco","Giancarlo",""],["Miotto","Mattia",""],["Milanetti","Edoardo",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 17:28:19 GMT"}],"updateDate":"2024-07-31","timestamp":1722360499000,"abstract":"  Predicting interactions between biomolecules, such as protein-protein\ncomplexes, remains a challenging problem. Despite the many advancements done so\nfar, the performances of docking protocols are deeply dependent on their\ncapability of identify binding regions. In this context, we present a novel\napproach that builds upon our previous works modeling protein surface patches\nvia sets of orthogonal polynomials to identify regions of high\nshape/electrostatic complementarity. By incorporating another key binding\nproperty, such as the balance between hydrophilic and hydrophobic\ncontributions, we define new binding matrices that serve an effective inputs\nfor training a neural network. Our approach also allows for the quantitative\ndefinition of a typical binding site area - approximately 10\\AA~in radius -\nwhere hydrophobic contribution and shape complementarity, which reflects the\nLennard-Jones interaction, are maximized. Using this new architecture, CIRNet\n(Core Interacting Residues Network), we achieve an accuracy of approximately\n0.82 in identifying pairs of core interacting residues on a balanced dataset.\nIn a blind search for core interacting residues, CIRNet distinguishes these\nfrom decoys with a ROC AUC of 0.72. This protocol can enahnce docking\nalgorithms by rescaling the proposed poses. When applied to the top ten models\nfrom three popular docking server, CIRNet improves docking outcomes, reducing\nthe the average RMSD between the refined poses and the native state by up to\n58%.\n","subjects":["Quantitative Biology/Biomolecules"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"bWRJ6fH1CZh0dI_17amTxEe83ObgTqoOIjhfz5nwrMQ","pdfSize":"2763349"}
