{"id":"2407.16289","title":"Federated Learning for Face Recognition via Intra-subject\n  Self-supervised Learning","authors":"Hansol Kim, Hoyeol Choi, Youngjun Kwak","authorsParsed":[["Kim","Hansol",""],["Choi","Hoyeol",""],["Kwak","Youngjun",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 08:43:42 GMT"}],"updateDate":"2024-07-24","timestamp":1721724222000,"abstract":"  Federated Learning (FL) for face recognition aggregates locally optimized\nmodels from individual clients to construct a generalized face recognition\nmodel. However, previous studies present two major challenges: insufficient\nincorporation of self-supervised learning and the necessity for clients to\naccommodate multiple subjects. To tackle these limitations, we propose FedFS\n(Federated Learning for personalized Face recognition via intra-subject\nSelf-supervised learning framework), a novel federated learning architecture\ntailored to train personalized face recognition models without imposing\nsubjects. Our proposed FedFS comprises two crucial components that leverage\naggregated features of the local and global models to cooperate with\nrepresentations of an off-the-shelf model. These components are (1) adaptive\nsoft label construction, utilizing dot product operations to reformat labels\nwithin intra-instances, and (2) intra-subject self-supervised learning,\nemploying cosine similarity operations to strengthen robust intra-subject\nrepresentations. Additionally, we introduce a regularization loss to prevent\noverfitting and ensure the stability of the optimized model. To assess the\neffectiveness of FedFS, we conduct comprehensive experiments on the DigiFace-1M\nand VGGFace datasets, demonstrating superior performance compared to previous\nmethods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}