{"id":"2407.18811","title":"Interpreting artificial neural networks to detect genome-wide\n  association signals for complex traits","authors":"Burak Yelmen, Maris Alver, Estonian Biobank Research Team, Flora Jay,\n  Lili Milani","authorsParsed":[["Yelmen","Burak",""],["Alver","Maris",""],["Team","Estonian Biobank Research",""],["Jay","Flora",""],["Milani","Lili",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 15:20:42 GMT"}],"updateDate":"2024-07-29","timestamp":1722007242000,"abstract":"  Investigating the genetic architecture of complex diseases is challenging due\nto the highly polygenic and interactive landscape of genetic and environmental\nfactors. Although genome-wide association studies (GWAS) have identified\nthousands of variants for multiple complex phenotypes, conventional statistical\napproaches can be limited by simplified assumptions such as linearity and lack\nof epistasis models. In this work, we trained artificial neural networks for\npredicting complex traits using both simulated and real genotype/phenotype\ndatasets. We extracted feature importance scores via different post hoc\ninterpretability methods to identify potentially associated loci (PAL) for the\ntarget phenotype. Simulations we performed with various parameters demonstrated\nthat associated loci can be detected with good precision using strict selection\ncriteria, but downstream analyses are required for fine-mapping the exact\nvariants due to linkage disequilibrium, similarly to conventional GWAS. By\napplying our approach to the schizophrenia cohort in the Estonian Biobank, we\nwere able to detect multiple PAL related to this highly polygenic and heritable\ndisorder. We also performed enrichment analyses with PAL in genic regions,\nwhich predominantly identified terms associated with brain morphology. With\nfurther improvements in model optimization and confidence measures, artificial\nneural networks can enhance the identification of genomic loci associated with\ncomplex diseases, providing a more comprehensive approach for GWAS and serving\nas initial screening tools for subsequent functional studies.\n  Keywords: Deep learning, interpretability, genome-wide association studies,\ncomplex diseases\n","subjects":["Quantitative Biology/Genomics","Computing Research Repository/Machine Learning","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KolKpUsJaTOZ1kwCVRWKxrCbfXMC6_b1WcDUkFdS4YQ","pdfSize":"15201542","objectId":"0x4c628ebff2eb7947f663baa6a74f9818de816ce024ba3a01bbfece7511a2243b","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
