{"id":"2407.09322","title":"Good Intentions, Risky Inventions: A Method for Assessing the Risks and\n  Benefits of AI in Mobile and Wearable Uses","authors":"Marios Constantinides, Edyta Bogucka, Sanja Scepanovic, Daniele\n  Quercia","authorsParsed":[["Constantinides","Marios",""],["Bogucka","Edyta",""],["Scepanovic","Sanja",""],["Quercia","Daniele",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 14:58:56 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 20:13:38 GMT"},{"version":"v3","created":"Mon, 29 Jul 2024 12:17:53 GMT"}],"updateDate":"2024-07-30","timestamp":1720796336000,"abstract":"  Integrating Artificial Intelligence (AI) into mobile and wearables offers\nnumerous benefits at individual, societal, and environmental levels. Yet, it\nalso spotlights concerns over emerging risks. Traditional assessments of risks\nand benefits have been sporadic, and often require costly expert analysis. We\ndeveloped a semi-automatic method that leverages Large Language Models (LLMs)\nto identify AI uses in mobile and wearables, classify their risks based on the\nEU AI Act, and determine their benefits that align with globally recognized\nlong-term sustainable development goals; a manual validation of our method by\ntwo experts in mobile and wearable technologies, a legal and compliance expert,\nand a cohort of nine individuals with legal backgrounds who were recruited from\nProlific, confirmed its accuracy to be over 85\\%. We uncovered that specific\napplications of mobile computing hold significant potential in improving\nwell-being, safety, and social equality. However, these promising uses are\nlinked to risks involving sensitive data, vulnerable groups, and automated\ndecision-making. To avoid rejecting these risky yet impactful mobile and\nwearable uses, we propose a risk assessment checklist for the Mobile HCI\ncommunity.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MFgw8yx5ore3ptsuJ__CFP1ka_bggUzMO412NakMn8k","pdfSize":"4979960","objectId":"0xd59eaf87bdb9f31960ba85aea70d96321f3d1abc6f9b27884b02a8255fc22774","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
