{"id":"2407.00552","title":"Efficient Resource Management in Multicast Short Video Streaming Systems","authors":"Betty Searcy and Zurh Farus and Bronny Bush and Kevin Muhammad and\n  Zubair Clinton","authorsParsed":[["Searcy","Betty",""],["Farus","Zurh",""],["Bush","Bronny",""],["Muhammad","Kevin",""],["Clinton","Zubair",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 01:01:09 GMT"}],"updateDate":"2024-07-02","timestamp":1719709269000,"abstract":"  The surge in popularity of short-form video content, particularly through\nplatforms like TikTok and Instagram, has led to an exponential increase in data\ntraffic, presenting significant challenges in network resource management.\nTraditional unicast streaming methods, while straightforward, are inefficient\nin scenarios where videos need to be delivered to a large number of users\nsimultaneously. Multicast streaming, which sends a single stream to multiple\nusers, can drastically reduce the required bandwidth, yet it introduces\ncomplexities in resource allocation, especially in wireless environments where\nbandwidth is limited and user demands are heterogeneous. This paper introduces\na novel multicast resource management framework tailored for the efficient\ndistribution of short-form video content. The proposed framework dynamically\noptimizes resource allocation to enhance Quality of Service (QoS) and Quality\nof Experience (QoE) for multiple users, balancing the trade-offs between cost,\nefficiency, and user satisfaction. We implement a series of optimization\nalgorithms that account for diverse network conditions and user requirements,\nensuring optimal service delivery across varying network topologies.\nExperimental results demonstrate that our framework can effectively reduce\nbandwidth usage and decrease video startup delay compared to traditional\nmulticast approaches, significantly improving overall user satisfaction. This\nstudy not only advances the understanding of multicast streaming dynamics but\nalso provides practical insights into scalable and efficient video distribution\nstrategies in congested network environments.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Graphics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}