{"id":"2407.18390","title":"Adapting Mouse Pathological Model to Human Glomerular Lesion\n  Segmentation","authors":"Lining Yu, Mengmeng Yin, Ruining Deng, Quan Liu, Tianyuan Yao, Can\n  Cui, Yu Wang, Yaohong Wang, Shilin Zhao, Haichun Yang, Yuankai Huo","authorsParsed":[["Yu","Lining",""],["Yin","Mengmeng",""],["Deng","Ruining",""],["Liu","Quan",""],["Yao","Tianyuan",""],["Cui","Can",""],["Wang","Yu",""],["Wang","Yaohong",""],["Zhao","Shilin",""],["Yang","Haichun",""],["Huo","Yuankai",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 20:47:43 GMT"}],"updateDate":"2024-07-29","timestamp":1721940463000,"abstract":"  Moving from animal models to human applications in preclinical research\nencompasses a broad spectrum of disciplines in medical science. A fundamental\nelement in the development of new drugs, treatments, diagnostic methods, and in\ndeepening our understanding of disease processes is the accurate measurement of\nkidney tissues. Past studies have demonstrated the viability of translating\nglomeruli segmentation techniques from mouse models to human applications. Yet,\nthese investigations tend to neglect the complexities involved in segmenting\npathological glomeruli affected by different lesions. Such lesions present a\nwider range of morphological variations compared to healthy glomerular tissue,\nwhich are arguably more valuable than normal glomeruli in clinical practice.\nFurthermore, data on lesions from animal models can be more readily scaled up\nfrom disease models and whole kidney biopsies. This brings up a question:\n``\\textit{Can a pathological segmentation model trained on mouse models be\neffectively applied to human patients?}\" To answer this question, we introduced\nGLAM, a deep learning study for fine-grained segmentation of human kidney\nlesions using a mouse model, addressing mouse-to-human transfer learning, by\nevaluating different learning strategies for segmenting human pathological\nlesions using zero-shot transfer learning and hybrid learning by leveraging\nmouse samples. From the results, the hybrid learning model achieved superior\nperformance.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}