{"id":"2407.09502","title":"From Text to Life: On the Reciprocal Relationship between Artificial\n  Life and Large Language Models","authors":"Eleni Nisioti, Claire Glanois, Elias Najarro, Andrew Dai, Elliot\n  Meyerson, Joachim Winther Pedersen, Laetitia Teodorescu, Conor F. Hayes,\n  Shyam Sudhakaran, Sebastian Risi","authorsParsed":[["Nisioti","Eleni",""],["Glanois","Claire",""],["Najarro","Elias",""],["Dai","Andrew",""],["Meyerson","Elliot",""],["Pedersen","Joachim Winther",""],["Teodorescu","Laetitia",""],["Hayes","Conor F.",""],["Sudhakaran","Shyam",""],["Risi","Sebastian",""]],"versions":[{"version":"v1","created":"Fri, 14 Jun 2024 07:45:32 GMT"}],"updateDate":"2024-07-16","timestamp":1718351132000,"abstract":"  Large Language Models (LLMs) have taken the field of AI by storm, but their\nadoption in the field of Artificial Life (ALife) has been, so far, relatively\nreserved. In this work we investigate the potential synergies between LLMs and\nALife, drawing on a large body of research in the two fields. We explore the\npotential of LLMs as tools for ALife research, for example, as operators for\nevolutionary computation or the generation of open-ended environments.\nReciprocally, principles of ALife, such as self-organization, collective\nintelligence and evolvability can provide an opportunity for shaping the\ndevelopment and functionalities of LLMs, leading to more adaptive and\nresponsive models. By investigating this dynamic interplay, the paper aims to\ninspire innovative crossover approaches for both ALife and LLM research. Along\nthe way, we examine the extent to which LLMs appear to increasingly exhibit\nproperties such as emergence or collective intelligence, expanding beyond their\noriginal goal of generating text, and potentially redefining our perception of\nlifelike intelligence in artificial systems.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}