{"id":"2407.03267","title":"Insulator-to-Metal Transition and Isotropic Gigantic Magnetoresistance\n  in Layered Magnetic Semiconductors","authors":"Gokul Acharya, Bimal Neupane, Chia-Hsiu Hsu, Xian P. Yang, David Graf,\n  Eun Sang Choi, Krishna Pandey, Md Rafique Un Nabi, Santosh Karki Chhetri,\n  Rabindra Basnet, Sumaya Rahman, Jian Wang, Zhengxin Hu, Bo Da, Hugh\n  Churchill, Guoqing Chang, M. Zahid Hasan, Yuanxi Wang, Jin Hu","authorsParsed":[["Acharya","Gokul",""],["Neupane","Bimal",""],["Hsu","Chia-Hsiu",""],["Yang","Xian P.",""],["Graf","David",""],["Choi","Eun Sang",""],["Pandey","Krishna",""],["Nabi","Md Rafique Un",""],["Chhetri","Santosh Karki",""],["Basnet","Rabindra",""],["Rahman","Sumaya",""],["Wang","Jian",""],["Hu","Zhengxin",""],["Da","Bo",""],["Churchill","Hugh",""],["Chang","Guoqing",""],["Hasan","M. Zahid",""],["Wang","Yuanxi",""],["Hu","Jin",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 16:56:38 GMT"}],"updateDate":"2024-07-04","timestamp":1720025798000,"abstract":"  Magnetotransport, the response of electrical conduction to external magnetic\nfield, acts as an important tool to reveal fundamental concepts behind exotic\nphenomena and plays a key role in enabling spintronic applications.\nMagnetotransport is generally sensitive to magnetic field orientations. In\ncontrast, efficient and isotropic modulation of electronic transport, which is\nuseful in technology applications such as omnidirectional sensing, is rarely\nseen, especially for pristine crystals. Here we propose a strategy to realize\nextremely strong modulation of electron conduction by magnetic field which is\nindependent of field direction. GdPS, a layered antiferromagnetic semiconductor\nwith resistivity anisotropies, supports a field-driven insulator-to-metal\ntransition with a paradoxically isotropic gigantic negative magnetoresistance\ninsensitive to magnetic field orientations. This isotropic magnetoresistance\noriginates from the combined effects of a near-zero spin-orbit coupling of\nGd3+-based half-filling f-electron system and the strong on-site f-d exchange\ncoupling in Gd atoms. Our results not only provide a novel material system with\nextraordinary magnetotransport that offers a missing block for\nantiferromagnet-based ultrafast and efficient spintronic devices, but also\ndemonstrate the key ingredients for designing magnetic materials with desired\ntransport properties for advanced functionalities.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}