{"id":"2407.15228","title":"3D Reconstruction of the Human Colon from Capsule Endoscope Video","authors":"P{\\aa}l Anders Floor, Ivar Farup, Marius Pedersen","authorsParsed":[["Floor","Pål Anders",""],["Farup","Ivar",""],["Pedersen","Marius",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 17:31:38 GMT"}],"updateDate":"2024-07-23","timestamp":1721583098000,"abstract":"  As the number of people affected by diseases in the gastrointestinal system\nis ever-increasing, a higher demand on preventive screening is inevitable. This\nwill significantly increase the workload on gastroenterologists. To help reduce\nthe workload, tools from computer vision may be helpful. In this paper, we\ninvestigate the possibility of constructing 3D models of whole sections of the\nhuman colon using image sequences from wireless capsule endoscope video,\nproviding enhanced viewing for gastroenterologists. As capsule endoscope images\ncontain distortion and artifacts non-ideal for many 3D reconstruction\nalgorithms, the problem is challenging. However, recent developments of virtual\ngraphics-based models of the human gastrointestinal system, where distortion\nand artifacts can be enabled or disabled, makes it possible to ``dissect'' the\nproblem. The graphical model also provides a ground truth, enabling computation\nof geometric distortion introduced by the 3D reconstruction method. In this\npaper, most distortions and artifacts are left out to determine if it is\nfeasible to reconstruct whole sections of the human gastrointestinal system by\nexisting methods. We demonstrate that 3D reconstruction is possible using\nsimultaneous localization and mapping. Further, to reconstruct the\ngastrointestinal wall surface from resulting point clouds, varying greatly in\ndensity, Poisson surface reconstruction is a good option. The results are\npromising, encouraging further research on this problem.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}