{"id":"2407.05130","title":"Heat transfer enhancement by mist/air two-phase flow in a\n  high-temperature channel","authors":"Junxian Cao, Mengqi Ye, Haiwang Li, Tianyou Wang, Zhizhao Che","authorsParsed":[["Cao","Junxian",""],["Ye","Mengqi",""],["Li","Haiwang",""],["Wang","Tianyou",""],["Che","Zhizhao",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 16:41:56 GMT"}],"updateDate":"2024-07-09","timestamp":1720284116000,"abstract":"  Mist/air two-phase flow is a promising cooling technique for many\napplications such as internal cooling of gas turbine blades. A significant\nenhancement of heat transfer can be achieved with a low mass fraction of\ndroplets by utilizing the latent heat of the droplets. Using newly designed\natomizers to accurately control the mist droplets, this study experimentally\nexplores the heat transfer performance of mist/air flow in a high-temperature\nchannel with a maximum temperature of 880 K. The effects of the mist/air mass\nratio, droplet size, Reynolds number, and wall heat flux are studied. The\nresults show that the cooling performance of the test section can be\nsignificantly improved by even adding a small amount of droplets. Considering\nmist droplets of different sizes, larger droplets can cause more remarkable\ntemperature reduction, while smaller droplets can improve the uniformity of\ntemperature distribution. For large droplets, the cooling effect in the\nupstream is more obvious than that in the downstream due to the interaction\nbetween the wall and the droplets, and with the increase of mist/air mass\nratio, the area with obvious cooling extends downstream. The performance of\nmist/air cooling is tested by increasing the heat flux until the maximum\ntemperature at the outlet reaches a predetermined value. Compared with air-only\ncooling, the increment in the wall heat flux by the mist/air cooling with a\nmass ratio of 3% can be up to 18.4%.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}