{"id":"2407.14631","title":"Two new feature selection methods based on learn-heuristic techniques\n  for breast cancer prediction: A comprehensive analysis","authors":"Kamyab Karimi, Ali Ghodratnama, Reza Tavakkoli-Moghaddam","authorsParsed":[["Karimi","Kamyab",""],["Ghodratnama","Ali",""],["Tavakkoli-Moghaddam","Reza",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 19:07:53 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 21:10:30 GMT"}],"updateDate":"2024-08-09","timestamp":1721416073000,"abstract":"  Breast cancer is not preventable because of its unknown causes. However, its\nearly diagnosis increases patients' recovery chances. Machine learning (ML) can\nbe utilized to improve treatment outcomes in healthcare operations while\ndiminishing costs and time. In this research, we suggest two novel feature\nselection (FS) methods based upon an imperialist competitive algorithm (ICA)\nand a bat algorithm (BA) and their combination with ML algorithms. This study\naims to enhance diagnostic models' efficiency and present a comprehensive\nanalysis to help clinical physicians make much more precise and reliable\ndecisions than before. K-nearest neighbors, support vector machine, decision\ntree, Naive Bayes, AdaBoost, linear discriminant analysis, random forest,\nlogistic regression, and artificial neural network are some of the methods\nemployed. This paper applied a distinctive integration of evaluation measures\nand ML algorithms using the wrapper feature selection based on ICA (WFSIC) and\nBA (WFSB) separately. We compared two proposed approaches for the performance\nof the classifiers. Also, we compared our best diagnostic model with previous\nworks reported in the literature survey. Experimentations were performed on the\nWisconsin diagnostic breast cancer dataset. Results reveal that the proposed\nframework that uses the BA with an accuracy of 99.12\\%, surpasses the framework\nusing the ICA and most previous works. Additionally, the RF classifier in the\napproach of FS based on BA emerges as the best model and outperforms others\nregarding its criteria. Besides, the results illustrate the role of our\ntechniques in reducing the dataset dimensions up to 90\\% and increasing the\nperformance of diagnostic models by over 99\\%. Moreover, the result\ndemonstrates that there are more critical features than the optimum dataset\nobtained by proposed FS approaches that have been selected by most ML models.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Neural and Evolutionary Computing","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}