{"id":"2407.16278","title":"Re-expression of manual expertise through semi-automatic control of a\n  teleoperated system","authors":"Erwann Landais (AUCTUS), Nasser Rezzoug (RoBioSS), Vincent Padois\n  (AUCTUS)","authorsParsed":[["Landais","Erwann","","AUCTUS"],["Rezzoug","Nasser","","RoBioSS"],["Padois","Vincent","","AUCTUS"]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 08:30:43 GMT"}],"updateDate":"2024-07-24","timestamp":1721723443000,"abstract":"  While the search for new solvents in the chemical industry is of uttermost\nimportance with respect to environmental considerations, this domain remains\nstrongly tied to highly manual and visual inspection tasks by human experts. As\nthe manipulated chemicals may imply a critical danger (CMR substances),\nmechanical protection barrier are used (fume hoods, gloveboxes). This, in turn,\ncan induce postural discomfort in the long term. Carrying out this task using a\nremotely controlled robot to reproduce the desired vial motions would alleviate\nthese postural constraints. Nevertheless, the adoption of such a system will\ndepend on its ability to transcribe the users' expertise. Particular attention\nmust be paid to the intuitiveness of the system : transparency of the actions\nperformed, relevance of the perceptual feedback, etc. and, in particular, the\nfidelity of the movements performed in relation to the user's commands.\nHowever, the extent of the rotational movements to be generated and the task\ninteractivity complicates the problem both from the point of view of the motor\ncapacities of industrial robots and for the transparency/responsiveness of the\ncontrol.To tackle the problen of guaranteeing a secure and reactive expression\nof the manual characteristics of this task, we propose to separate the control\nof movement into two parts: control of the path (set of spatial poses) and of\nthe trajectories associated with this path (speed, direction of travel along\nthe path). The user can then partially control the robot's movements, by\nchoosing the type of generic, secure path and modulating the trajectory\nperformed on this path in real time. Although this drastically limits the\npossibilities for interaction, we assume that this teleoperated system can\nenable this type of observation task to be carried out as effectively as for\ndirect manipulation. This hypothesis was tested through an experiment in which\na reading task, less dangerous but with similar characteristics to the\napplication task, had to be performed using different variants of trajectory\nmodulation. This experiment consisted in reading words printed on four white\ncapsules (dimensions 6 x 12 mm) placed into cylindrical vials ( dimensions 16\nmm x 70 mm). Four randomly selected vials were tested by each variant. Firstly,\nusers had to perform the task via direct handling, then under conditions\nsecured by a protection barrier. Users were then invited to perform the task\nusing different trajectory modulation variants (modulation and passive viewing\nof a pre-recorded video, modulation of the trajectory of a Franka-Emika Panda\nrobot performing the task in real time in front of a monocular Logitech Brio 4K\ncamera). After each trial of a variant, users evaluate different aspects of\nthis variant (manual and visual performance, ease of use, acceptability of the\ninterface) through a questionnaire. During the trials, various objective\ncriteria are also measured (number and nature of interaction with the\ninterface, time and degree of success in the task). This experiment was carried\nout with 37 subjects (age : 27$\\pm$5, 20 females). The data recorded showed\nthat the proportion of successes, as well as the subjects' perceptions of\nvisual performance, comfort of use and acceptability of the interface, were\nsimilar and high for all the variants. This suggests that this task is indeed\nachievable via the proposed interface. However, data also showed that average\ntask completion times when using the trajectory modulation variants were\nsignificantly higher than handling by hand variants, which implies that the\nproposed remote semi-automatic control procedure fails to achieve satisfactory\nperformance regarding execution time. An interface allowing more reactive\nmanipulation of the vial's movements seems necessary, and will be tested in a\nfuture experiment.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}