{"id":"2407.05214","title":"Photometric White Dwarf Rotation","authors":"Gabriela Oliveira da Rosa, S. O. Kepler, L. T. T. Soethe, Alejandra D.\n  Romero and Keaton J. Bell","authorsParsed":[["da Rosa","Gabriela Oliveira",""],["Kepler","S. O.",""],["Soethe","L. T. T.",""],["Romero","Alejandra D.",""],["Bell","Keaton J.",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 23:58:34 GMT"}],"updateDate":"2024-07-09","timestamp":1720310314000,"abstract":"  We present a census of photometrically detected rotation periods for white\ndwarf stars. We analyzed the light curves of 9285 white dwarf stars observed by\nthe Transiting Exoplanet Survey Satellite (TESS) up to sector 69. Using Fourier\ntransform analyses and the TESS localize software, we detected variability\nperiods for 318 white dwarf stars. The 115 high probability likely single white\ndwarfs in our sample have a median rotational period of 3.9 hours and a median\nabsolute deviation of 3.5 h. Our distribution is significantly different from\nthe distribution of the rotational period from asteroseismology, which exhibits\na longer median period of 24.3 hours and a median absolute deviation of 12.0 h.\nIn addition, we reported non-pulsating periods for three known pulsating white\ndwarfs with rotational period previously determined by asteroseismology: NGC\n1501, TIC 7675859, and G226-29. We also calculated evolutionary models that\ninclude six angular momentum transfer mechanisms from the literature throughout\nevolution in an attempt to reproduce our findings. Our models indicate that the\ntemperature-period relation of most observational data is best fitted by models\nwith low metallicity, probably indicating problems with the computations of\nangular-momentum loss during the high-mass-loss phase. Our models also generate\ninternal magnetic fields through the Tayler-Spruit dynamo.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}