{"id":"2407.03147","title":"Evolution of Band Structure in a Kagome Superconductor Cs(V1-xCrx)3Sb5:\n  Toward Universal Understanding of CDW and Superconducting Phase Diagrams","authors":"Shuto Suzuki, Takemi Kato, Yongkai Li, Kosuke Nakayama, Zhiwei Wang,\n  Seigo Souma, Kenichi Ozawa, Miho Kitamura, Koji Horiba, Hiroshi Kumigashira,\n  Takashi Takahashi, Yugui Yao, and Takafumi Sato","authorsParsed":[["Suzuki","Shuto",""],["Kato","Takemi",""],["Li","Yongkai",""],["Nakayama","Kosuke",""],["Wang","Zhiwei",""],["Souma","Seigo",""],["Ozawa","Kenichi",""],["Kitamura","Miho",""],["Horiba","Koji",""],["Kumigashira","Hiroshi",""],["Takahashi","Takashi",""],["Yao","Yugui",""],["Sato","Takafumi",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 14:24:58 GMT"}],"updateDate":"2024-07-04","timestamp":1720016698000,"abstract":"  Kagome superconductors AV3Sb5 (A = K, Rb, Cs) exhibit a characteristic\nsuperconducting and charge-density wave (CDW) phase diagram upon carrier doping\nand chemical substitution. However, the key electronic states responsible for\nsuch a phase diagram have yet to be clarified. Here we report a systematic\nmicro-focused angle-resolved photoemission spectroscopy (ARPES) study of\nCs(V1-xCrx)3Sb5 as a function of Cr content x, where Cr substitution causes\nmonotonic reduction of superconducting and CDW transition temperatures. We\nfound that the V-derived bands forming saddle points at the M point and Dirac\nnodes along high-symmetry cuts show an energy shift due to electron doping by\nCr substitution, whereas the Sb-derived electron band at the Gamma point\nremains almost unchanged, signifying an orbital-selective band shift. We also\nfound that band doubling associated with the emergence of three-dimensional CDW\nidentified at x = 0 vanishes at x = 0.25, in line with the disappearance of\nCDW. A comparison of band diagrams among Ti-, Nb-, and Cr-substituted\nCs(V1-xCrx)3Sb5 suggests the importance to simultaneously take into account the\ntwo saddle points at the M point and their proximity to the Fermi energy, to\nunderstand the complex phase diagram against carrier doping and chemical\npressure.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/"}