{"id":"2407.08799","title":"Self-dualities and Galois symmetries in Feynman integrals","authors":"Sebastian P\\\"ogel, Xing Wang, Stefan Weinzierl, Konglong Wu and\n  Xiaofeng Xu","authorsParsed":[["Pögel","Sebastian",""],["Wang","Xing",""],["Weinzierl","Stefan",""],["Wu","Konglong",""],["Xu","Xiaofeng",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 18:18:23 GMT"},{"version":"v2","created":"Sat, 31 Aug 2024 23:30:50 GMT"}],"updateDate":"2024-09-04","timestamp":1720721903000,"abstract":"  It is well-known that all Feynman integrals within a given family can be\nexpressed as a finite linear combination of master integrals. The master\nintegrals naturally group into sectors. Starting from two loops, there can\nexist sectors made up of more than one master integral. In this paper we show\nthat such sectors may have additional symmetries. First of all, self-duality,\nwhich was first observed in Feynman integrals related to Calabi--Yau\ngeometries, often carries over to non-Calabi--Yau Feynman integrals. Secondly,\nwe show that in addition there can exist Galois symmetries relating integrals.\nIn the simplest case of two master integrals within a sector, whose definition\ninvolves a square root $r$, we may choose a basis $(I_1,I_2)$ such that $I_2$\nis obtained from $I_1$ by the substitution $r \\rightarrow -r$. This pattern\nalso persists in sectors, which a priori are not related to any square root\nwith dependence on the kinematic variables. We show in several examples that in\nsuch cases a suitable redefinition of the integrals introduces constant square\nroots like $\\sqrt{3}$. The new master integrals are then again related by a\nGalois symmetry, for example the substitution $\\sqrt{3} \\rightarrow -\\sqrt{3}$.\nTo handle the case where the argument of a square root would be a perfect\nsquare we introduce a limit Galois symmetry. Both self-duality and Galois\nsymmetries constrain the differential equation.\n","subjects":["Physics/High Energy Physics - Theory","Physics/High Energy Physics - Phenomenology","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}