{"id":"2407.20142","title":"Greenberger-Horne-Zeilinger state is the best probe for multiparameter\n  estimation of independent local fields","authors":"Aparajita Bhattacharyya and Ujjwal Sen","authorsParsed":[["Bhattacharyya","Aparajita",""],["Sen","Ujjwal",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 16:12:04 GMT"}],"updateDate":"2024-07-30","timestamp":1722269524000,"abstract":"  We show that estimation of multiple independent field strengths of a local\nHamiltonian, i.e., one formed by a sum of single-party terms, necessitates the\nutility of a highly symmetric genuine multiparty entangled state, viz. the\nGreenberger-Horne-Zeilinger (GHZ) state, as the input probe. This feature\nhowever depends on the choice of the weight matrix considered, to define a\nfigure of merit in the multiparameter estimation. We obtain this result by\nproviding a lower bound on the precision of multiparameter estimation,\noptimized over input probes, for an arbitrary weight matrix. We find that the\nbound can be expressed in terms of eigenvalues of the arbitrary multiparty\nlocal encoding Hamiltonian. We show that there exists a weight matrix for which\nthis bound is attainable only when the probe is the GHZ state, up to a relative\nphase. In particular, no pure product state can achieve this lower bound.\nIndeed, the gap - in precision - between genuinely multiparty entangled and\nproduct states acting as probes, increases with increasing number of parties.\nFinally we also prove that using a probe that is in a mixed state provides a\nprecision lower than that for the GHZ state. To emphasize the importance of the\nweight matrix considered, we also prove that the choice of identity operator as\nthe same - thereby ignoring the covariances in the precision matrix - does not\nrequire the use of genuine multiparty entanglement in input probes for\nattaining the best precision, and the optimal probe can be a pure product.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}