{"id":"2407.20245","title":"Identifying fatigue crack initiation through analytical calculation of\n  temporal compliance calibrated with Computed Tomography","authors":"Ritam Pal, Amrita Basak","authorsParsed":[["Pal","Ritam",""],["Basak","Amrita",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 01:12:18 GMT"}],"updateDate":"2024-07-31","timestamp":1721265138000,"abstract":"  Fatigue failure is ubiquitous in engineering applications. While the total\nfatigue life is critical to understanding a component's operational life, for\nsafety, regulatory compliance, and predictive maintenance, the characterization\nof initiation life is important. Traditionally, initiation life is\ncharacterized by potential drop method, acoustic emission technique, and\nstrain-based measurements. However, the primary challenge with these methods\nlies in the necessity of calibration for each new material system. The\ndifficulties become even more aggravated for additively manufactured\ncomponents, where fatigue properties are reported to vary widely in the open\nliterature. In this work, an analytical methodology is utilized to evaluate the\ninitiation life of two different materials such as AlSi10Mg and SS316L,\nfabricated via laser-powder bed fusion (L-PBF) technique. The processing\nparameters are selected such that AlSi10Mg behaves like a brittle material\nwhile SS316L shows ductile behavior. A custom fatigue testing apparatus is used\ninside Computed Tomography (CT) for evaluating fatigue initiation. The\napparatus reports load-displacement data, which is post-processed using an\nanalytical approach to calculate the evolution of material compliance. The\nresults indicate that crack initiation during fatigue loading is marked by a\nnoticeable change in compliance. The analytical technique shows a maximum\ndifference of 4.8% in predicting initiation life compared to CT imaging. These\nfindings suggest that compliance monitoring can effectively identify fatigue\ninitiation in various materials.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"uQLZznCsajKgmJsp3ll0o0OpilJROr2TsIKVt3HJmr8","pdfSize":"2760190"}
