{"id":"2407.17338","title":"Accurate Inverse Process Optimization Framework in Laser Directed Energy\n  Deposition","authors":"Xiao Shang, Evelyn Li, Ajay Talbot, Haitao Wen, Tianyi Lyu, Jiahui\n  Zhang, Yu Zou","authorsParsed":[["Shang","Xiao",""],["Li","Evelyn",""],["Talbot","Ajay",""],["Wen","Haitao",""],["Lyu","Tianyi",""],["Zhang","Jiahui",""],["Zou","Yu",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 15:02:55 GMT"}],"updateDate":"2024-07-25","timestamp":1721833375000,"abstract":"  In additive manufacturing (AM), particularly for laser-based metal AM,\nprocess optimization is crucial to the quality of products and the efficiency\nof production. The identification of optimal process parameters out of a vast\nparameter space, however, is a daunting task. Despite advances in simulations,\nthe process optimization for specific materials and geometries is developed\nthrough a time-consuming trial-and-error approach, which often lacks the\nversatility to address multiple optimization objectives. Machine learning (ML)\nprovides a powerful tool to accelerate the optimization process, but most\ncurrent studies focus on simple single-track prints, which hardly translate to\nmanufacturing 3D components for engineering applications. In this study, we\ndevelop an Accurate Inverse process optimization framework in laser Directed\nEnergy Deposition (AIDED), based on machine learning models and a genetic\nalgorithm, to aid process optimization in laser DED processes. Using the AIDED,\nwe demonstrate the following: (i) Accurately predict single-track (R2 score\n0.995), multi-track (R2 score 0.969), and multi-layer (1.07% and 10.75% error\nin width and height, respectively) cross-sectional melt pool geometries\ndirectly from process parameters; (ii) Determine appropriate hatch spacing and\nlayer thickness for fabricating fully dense (density > 99.9%) multi-track and\nmulti-layer prints; (iii) Inversely identify optimal process parameters\ndirectly from customizable application objectives within 1-3 hours. We also\nvalidate the effectiveness of the AIDED experimentally by achieving two\nexemplary targets: fast print speed and fine print resolution. Furthermore, we\nshow the high transferability of the framework from stainless steel to pure\nnickel. With AIDED, we pave a new way for ''aiding'' the process optimization\nin the laser-based AM processes that is applicable to a wide range of\nmaterials.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}