{"id":"2407.08990","title":"Dynamic neural network with memristive CIM and CAM for 2D and 3D vision","authors":"Yue Zhang, Woyu Zhang, Shaocong Wang, Ning Lin, Yifei Yu, Yangu He, Bo\n  Wang, Hao Jiang, Peng Lin, Xiaoxin Xu, Xiaojuan Qi, Zhongrui Wang, Xumeng\n  Zhang, Dashan Shang, Qi Liu, Kwang-Ting Cheng and Ming Liu","authorsParsed":[["Zhang","Yue",""],["Zhang","Woyu",""],["Wang","Shaocong",""],["Lin","Ning",""],["Yu","Yifei",""],["He","Yangu",""],["Wang","Bo",""],["Jiang","Hao",""],["Lin","Peng",""],["Xu","Xiaoxin",""],["Qi","Xiaojuan",""],["Wang","Zhongrui",""],["Zhang","Xumeng",""],["Shang","Dashan",""],["Liu","Qi",""],["Cheng","Kwang-Ting",""],["Liu","Ming",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 04:55:57 GMT"}],"updateDate":"2024-07-15","timestamp":1720760157000,"abstract":"  The brain is dynamic, associative and efficient. It reconfigures by\nassociating the inputs with past experiences, with fused memory and processing.\nIn contrast, AI models are static, unable to associate inputs with past\nexperiences, and run on digital computers with physically separated memory and\nprocessing. We propose a hardware-software co-design, a semantic memory-based\ndynamic neural network (DNN) using memristor. The network associates incoming\ndata with the past experience stored as semantic vectors. The network and the\nsemantic memory are physically implemented on noise-robust ternary\nmemristor-based Computing-In-Memory (CIM) and Content-Addressable Memory (CAM)\ncircuits, respectively. We validate our co-designs, using a 40nm memristor\nmacro, on ResNet and PointNet++ for classifying images and 3D points from the\nMNIST and ModelNet datasets, which not only achieves accuracy on par with\nsoftware but also a 48.1% and 15.9% reduction in computational budget.\nMoreover, it delivers a 77.6% and 93.3% reduction in energy consumption.\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Emerging Technologies","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by/4.0/"}