{"id":"2407.05242","title":"Abdominal aortic aneurysm wall stress: A 7-line code in MATLAB and a\n  one-click software application","authors":"Mostafa Jamshidian, Saeideh Sekhavat, Adam Wittek, Karol Miller","authorsParsed":[["Jamshidian","Mostafa",""],["Sekhavat","Saeideh",""],["Wittek","Adam",""],["Miller","Karol",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 03:12:33 GMT"}],"updateDate":"2024-07-09","timestamp":1720321953000,"abstract":"  An abdominal aortic aneurysm (AAA) is a life-threatening condition\ncharacterized by the irreversible dilation of the lower aorta, usually detected\nincidentally during imaging for other health issues. Current clinical practice\nfor managing AAA relies on a one-size-fits-all approach, based on the\naneurysm's maximum diameter and growth rate, which can lead to underestimation\nor overestimation of AAA rupture risk. Patient-specific AAA wall stress,\ncomputed using biomechanical models derived from medical images without needing\npatient-specific material properties, has been widely investigated for\ndeveloping individualized AAA rupture risk predictors. Therefore, AAA wall\nstress, determined reliably and quickly, has the potential to enhance\npatient-specific treatment plans. This paper presents a 7-line code, written in\nMATLAB using the Partial Differential Equation Toolbox, for AAA wall stress\ncomputations via finite element analysis. The code takes AAA wall geometry as\ninput and outputs stress components over the AAA wall domain. Additionally, we\npresent a one-click standalone software application for AAA wall stress\ncomputation, developed based on our 7-line code using MATLAB Compiler. After\nverification, we used our code to compute AAA wall stress in ten patients. Our\nanalysis indicated that the 99th percentile of maximum principal stress across\nall patients ranged from 0.320 MPa to 0.522 MPa, with an average of 0.401 MPa\nand a standard deviation of 0.056 MPa. Moreover, for every case, the MATLAB\nsimulation time was less than a minute on a laptop workstation.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}