{"id":"2407.02445","title":"Meta 3D AssetGen: Text-to-Mesh Generation with High-Quality Geometry,\n  Texture, and PBR Materials","authors":"Yawar Siddiqui, Tom Monnier, Filippos Kokkinos, Mahendra Kariya, Yanir\n  Kleiman, Emilien Garreau, Oran Gafni, Natalia Neverova, Andrea Vedaldi, Roman\n  Shapovalov, David Novotny","authorsParsed":[["Siddiqui","Yawar",""],["Monnier","Tom",""],["Kokkinos","Filippos",""],["Kariya","Mahendra",""],["Kleiman","Yanir",""],["Garreau","Emilien",""],["Gafni","Oran",""],["Neverova","Natalia",""],["Vedaldi","Andrea",""],["Shapovalov","Roman",""],["Novotny","David",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 17:21:47 GMT"}],"updateDate":"2024-07-03","timestamp":1719940907000,"abstract":"  We present Meta 3D AssetGen (AssetGen), a significant advancement in\ntext-to-3D generation which produces faithful, high-quality meshes with texture\nand material control. Compared to works that bake shading in the 3D object's\nappearance, AssetGen outputs physically-based rendering (PBR) materials,\nsupporting realistic relighting. AssetGen generates first several views of the\nobject with factored shaded and albedo appearance channels, and then\nreconstructs colours, metalness and roughness in 3D, using a deferred shading\nloss for efficient supervision. It also uses a sign-distance function to\nrepresent 3D shape more reliably and introduces a corresponding loss for direct\nshape supervision. This is implemented using fused kernels for high memory\nefficiency. After mesh extraction, a texture refinement transformer operating\nin UV space significantly improves sharpness and details. AssetGen achieves 17%\nimprovement in Chamfer Distance and 40% in LPIPS over the best concurrent work\nfor few-view reconstruction, and a human preference of 72% over the best\nindustry competitors of comparable speed, including those that support PBR.\nProject page with generated assets: https://assetgen.github.io\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Graphics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}