{"id":"2407.07781","title":"Sequential Kalman Monte Carlo for gradient-free inference in Bayesian\n  inverse problems","authors":"Richard D.P. Grumitt, Minas Karamanis, Uro\\v{s} Seljak","authorsParsed":[["Grumitt","Richard D. P.",""],["Karamanis","Minas",""],["Seljak","Uroš",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 15:56:30 GMT"}],"updateDate":"2024-07-11","timestamp":1720626990000,"abstract":"  Ensemble Kalman Inversion (EKI) has been proposed as an efficient method for\nsolving inverse problems with expensive forward models. However, the method is\nbased on the assumption that we proceed through a sequence of Gaussian measures\nin moving from the prior to the posterior, and that the forward model is\nlinear. In this work, we introduce Sequential Kalman Monte Carlo (SKMC)\nsamplers, where we exploit EKI and Flow Annealed Kalman Inversion (FAKI) within\na Sequential Monte Carlo (SMC) sampling scheme to perform efficient\ngradient-free inference in Bayesian inverse problems. FAKI employs normalizing\nflows (NF) to relax the Gaussian ansatz of the target measures in EKI. NFs are\nable to learn invertible maps between a Gaussian latent space and the original\ndata space, allowing us to perform EKI updates in the Gaussianized NF latent\nspace. However, FAKI alone is not able to correct for the model linearity\nassumptions in EKI. Errors in the particle distribution as we move through the\nsequence of target measures can therefore compound to give incorrect posterior\nmoment estimates. In this work we consider the use of EKI and FAKI to\ninitialize the particle distribution for each target in an adaptive SMC\nannealing scheme, before performing t-preconditioned Crank-Nicolson (tpCN)\nupdates to distribute particles according to the target. We demonstrate the\nperformance of these SKMC samplers on three challenging numerical benchmarks,\nshowing significant improvements in the rate of convergence compared to\nstandard SMC with importance weighted resampling at each temperature level.\nCode implementing the SKMC samplers is available at\nhttps://github.com/RichardGrumitt/KalmanMC.\n","subjects":["Statistics/Computation","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8GNsJUDYn0Wof32WHYtGUS5F6hHEWnsT2_G_J_d5gPQ","pdfSize":"3397420"}
