{"id":"2407.11038","title":"Fuzzy Recurrent Stochastic Configuration Networks for Industrial Data\n  Analytics","authors":"Dianhui Wang and Gang Dang","authorsParsed":[["Wang","Dianhui",""],["Dang","Gang",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 01:40:31 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 00:55:09 GMT"}],"updateDate":"2024-08-14","timestamp":1720230031000,"abstract":"  This paper presents a novel neuro-fuzzy model, termed fuzzy recurrent\nstochastic configuration networks (F-RSCNs), for industrial data analytics.\nUnlike the original recurrent stochastic configuration network (RSCN), the\nproposed F-RSCN is constructed by multiple sub-reservoirs, and each\nsub-reservoir is associated with a Takagi-Sugeno-Kang (TSK) fuzzy rule. Through\nthis hybrid framework, first, the interpretability of the model is enhanced by\nincorporating fuzzy reasoning to embed the prior knowledge into the network.\nThen, the parameters of the neuro-fuzzy model are determined by the recurrent\nstochastic configuration (RSC) algorithm. This scheme not only ensures the\nuniversal approximation property and fast learning speed of the built model but\nalso overcomes uncertain problems, such as unknown dynamic orders, arbitrary\nstructure determination, and the sensitivity of learning parameters in\nmodelling nonlinear dynamics. Finally, an online update of the output weights\nis performed using the projection algorithm, and the convergence analysis of\nthe learning parameters is given. By integrating TSK fuzzy inference systems\ninto RSCNs, F-RSCNs have strong fuzzy inference capability and can achieve\nsound performance for both learning and generalization. Comprehensive\nexperiments show that the proposed F-RSCNs outperform other classical\nneuro-fuzzy and non-fuzzy models, demonstrating great potential for modelling\ncomplex industrial systems.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}