{"id":"2407.00992","title":"Turbulence modulation in liquid-liquid two-phase Taylor-Couette\n  turbulence","authors":"Jinghong Su, Cheng Wang, Yi-bao Zhang, Fan Xu, Junwu Wang, Chao Sun","authorsParsed":[["Su","Jinghong",""],["Wang","Cheng",""],["Zhang","Yi-bao",""],["Xu","Fan",""],["Wang","Junwu",""],["Sun","Chao",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 06:06:22 GMT"},{"version":"v2","created":"Wed, 11 Sep 2024 03:05:29 GMT"}],"updateDate":"2024-09-12","timestamp":1719813982000,"abstract":"  We investigate the coupling effects of the two-phase interface, viscosity\nratio, and density ratio of the dispersed phase to the continuous phase on the\nflow statistics in two-phase Taylor-Couette turbulence at a system Reynolds\nnumber of 6000 and a system Weber number of 10 using interface-resolved\nthree-dimensional direct numerical simulations with the volume-of-fluid method.\nOur study focuses on four different scenarios: neutral droplets, low-viscosity\ndroplets, light droplets, and low-viscosity light droplets. We find that\nneutral droplets and low-viscosity droplets primarily contribute to drag\nenhancement through the two-phase interface, while light droplets reduce the\nsystem's drag by explicitly reducing Reynolds stress due to the density\ndependence of Reynolds stress. Additionally, low-viscosity light droplets\ncontribute to greater drag reduction by further reducing momentum transport\nnear the inner cylinder and implicitly reducing Reynolds stress. While\ninterfacial tension enhances turbulent kinetic energy (TKE) transport, drag\nenhancement is not strongly correlated with TKE transport for both neutral\ndroplets and low-viscosity droplets. Light droplets primarily reduce the\nproduction term by diminishing Reynolds stress, whereas the density contrast\nbetween the phases boosts TKE transport near the inner wall. Therefore, the\nreduction in the dissipation rate is predominantly attributed to decreased\nturbulence production, causing drag reduction. For low-viscosity light\ndroplets, the production term diminishes further, primarily due to their\ngreater reduction in Reynolds stress, while reduced viscosity weakens the\ndensity difference's contribution to TKE transport near the inner cylinder,\nresulting in a more pronounced reduction in the dissipation rate and\nconsequently stronger drag reduction. Our findings provide new insights into\nthe turbulence modulation in two-phase flow.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}