{"id":"2407.10382","title":"Communication- and Computation-Efficient Distributed Decision-Making in\n  Multi-Robot Networks","authors":"Zirui Xu, Sandilya Sai Garimella, Vasileios Tzoumas","authorsParsed":[["Xu","Zirui",""],["Garimella","Sandilya Sai",""],["Tzoumas","Vasileios",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 01:25:39 GMT"}],"updateDate":"2024-07-16","timestamp":1721006739000,"abstract":"  We provide a distributed coordination paradigm that enables scalable and\nnear-optimal joint motion planning among multiple robots. Our coordination\nparadigm contrasts with current paradigms that are either near-optimal but\nimpractical for replanning times or real-time but offer no near-optimality\nguarantees. We are motivated by the future of collaborative mobile autonomy,\nwhere distributed teams of robots will coordinate via vehicle-to-vehicle (v2v)\ncommunication to execute information-heavy tasks like mapping, surveillance,\nand target tracking. To enable rapid distributed coordination, we must curtail\nthe explosion of information-sharing across the network, thus limiting robot\ncoordination. However, this can lead to suboptimal plans, causing overlapping\ntrajectories instead of complementary ones. We make theoretical and algorithmic\ncontributions to balance the trade-off between decision speed and optimality.\nWe introduce tools for distributed submodular optimization, a diminishing\nreturns property in information-gathering tasks. Theoretically, we analyze how\nlocal network topology affects near-optimality at the global level.\nAlgorithmically, we provide a communication- and computation-efficient\ncoordination algorithm for agents to balance the trade-off. Our algorithm is up\nto two orders faster than competitive near-optimal algorithms. In simulations\nof surveillance tasks with up to 45 robots, it enables real-time planning at\nthe order of 1 Hz with superior coverage performance. To enable the\nsimulations, we provide a high-fidelity simulator that extends AirSim by\nintegrating a collaborative autonomy pipeline and simulating v2v communication\ndelays.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multiagent Systems","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}