{"id":"2407.10923","title":"OPa-Ma: Text Guided Mamba for 360-degree Image Out-painting","authors":"Penglei Gao, Kai Yao, Tiandi Ye, Steven Wang, Yuan Yao, and Xiaofeng\n  Wang","authorsParsed":[["Gao","Penglei",""],["Yao","Kai",""],["Ye","Tiandi",""],["Wang","Steven",""],["Yao","Yuan",""],["Wang","Xiaofeng",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:23:00 GMT"}],"updateDate":"2024-07-16","timestamp":1721064180000,"abstract":"  In this paper, we tackle the recently popular topic of generating 360-degree\nimages given the conventional narrow field of view (NFoV) images that could be\ntaken from a single camera or cellphone. This task aims to predict the\nreasonable and consistent surroundings from the NFoV images. Existing methods\nfor feature extraction and fusion, often built with transformer-based\narchitectures, incur substantial memory usage and computational expense. They\nalso have limitations in maintaining visual continuity across the entire\n360-degree images, which could cause inconsistent texture and style generation.\nTo solve the aforementioned issues, we propose a novel text-guided out-painting\nframework equipped with a State-Space Model called Mamba to utilize its\nlong-sequence modelling and spatial continuity. Furthermore, incorporating\ntextual information is an effective strategy for guiding image generation,\nenriching the process with detailed context and increasing diversity.\nEfficiently extracting textual features and integrating them with image\nattributes presents a significant challenge for 360-degree image out-painting.\nTo address this, we develop two modules, Visual-textual Consistency Refiner\n(VCR) and Global-local Mamba Adapter (GMA). VCR enhances contextual richness by\nfusing the modified text features with the image features, while GMA provides\nadaptive state-selective conditions by capturing the information flow from\nglobal to local representations. Our proposed method achieves state-of-the-art\nperformance with extensive experiments on two broadly used 360-degree image\ndatasets, including indoor and outdoor settings.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"NQLMA9sLKmx8qVOWwkmw3yoSbBDGj9wuPbR3D8GAuCM","pdfSize":"42360733"}
