{"id":"2407.09244","title":"Physical Layer Aspects of Quantum Communications: A Survey","authors":"Seid Koudia, Leonardo Oleynik, Mert Bayraktar, Junaid ur Rehman, and\n  Symeon Chatzinotas","authorsParsed":[["Koudia","Seid",""],["Oleynik","Leonardo",""],["Bayraktar","Mert",""],["Rehman","Junaid ur",""],["Chatzinotas","Symeon",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 13:16:47 GMT"}],"updateDate":"2024-07-15","timestamp":1720790207000,"abstract":"  Quantum communication systems support unique applications in the form of\ndistributed quantum computing, distributed quantum sensing, and several\ncryptographic protocols. The main enabler in these communication systems is an\nefficient infrastructure that is capable to transport unknown quantum states\nwith high rate and fidelity. This feat requires a new approach to communication\nsystem design which efficiently exploits the available physical layer\nresources, while respecting the limitations and principles of quantum\ninformation. Despite the fundamental differences between the classic and\nquantum worlds, there exist universal communication concepts that may proven\nbeneficial in quantum communication systems as well. In this survey, the\ndistinctive aspects of physical layer quantum communications are highlighted in\na attempt to draw commonalities and divergences between classic and quantum\ncommunications. More specifically, we begin by overviewing the quantum channels\nand use cases over diverse optical propagation media, shedding light on the\nconcepts of crosstalk and interference. Subsequently, we survey quantum\nsources, detectors, channels and modulation techniques. More importantly, we\ndiscuss and analyze spatial multiplexing techniques, such as coherent control,\nmultiplexing, diversity and MIMO. Finally, we identify synergies between the\ntwo communication technologies and grand open challenges that can be pivotal in\nthe development of next-generation quantum communication systems.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/"}