{"id":"2407.00007","title":"Graph Neural Networks and Reinforcement Learning for Proactive\n  Application Image Placement","authors":"Antonios Makris, Theodoros Theodoropoulos, Evangelos Psomakelis,\n  Emanuele Carlini, Matteo Mordacchini, Patrizio Dazzi, Konstantinos Tserpes","authorsParsed":[["Makris","Antonios",""],["Theodoropoulos","Theodoros",""],["Psomakelis","Evangelos",""],["Carlini","Emanuele",""],["Mordacchini","Matteo",""],["Dazzi","Patrizio",""],["Tserpes","Konstantinos",""]],"versions":[{"version":"v1","created":"Tue, 23 Apr 2024 13:06:09 GMT"}],"updateDate":"2024-07-02","timestamp":1713877569000,"abstract":"  The shift from Cloud Computing to a Cloud-Edge continuum presents new\nopportunities and challenges for data-intensive and interactive applications.\nEdge computing has garnered a lot of attention from both industry and academia\nin recent years, emerging as a key enabler for meeting the increasingly strict\ndemands of Next Generation applications. In Edge computing the computations are\nplaced closer to the end-users, to facilitate low-latency and high-bandwidth\napplications and services. However, the distributed, dynamic, and heterogeneous\nnature of Edge computing, presents a significant challenge for service\nplacement. A critical aspect of Edge computing involves managing the placement\nof applications within the network system to minimize each application's\nruntime, considering the resources available on system devices and the\ncapabilities of the system's network. The placement of application images must\nbe proactively planned to minimize image tranfer time, and meet the strict\ndemands of the applications. In this regard, this paper proposes an approach\nfor proactive image placement that combines Graph Neural Networks and\nactor-critic Reinforcement Learning, which is evaluated empirically and\ncompared against various solutions. The findings indicate that although the\nproposed approach may result in longer execution times in certain scenarios, it\nconsistently achieves superior outcomes in terms of application placement.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Xkz-1JKIC1KxnqmDDEgU0DyQ0P686bgq_zW70xqF2xw","pdfSize":"1490342","txDigest":"4KKCLskjTNtRfBQmp8UtgamKGceLyXtfns8Af15SLfMJ","endEpoch":"1","status":"REGISTERED"}
