{"id":"2407.00559","title":"Neural Network-Assisted End-to-End Design for Dispersive Full-Parameter\n  Control of Meta-Optics","authors":"Hanbin Chi, Yueqiang Hu, Xiangnian Ou, Yuting Jiang, Dian Yu, Shaozhen\n  Lou, Quan Wang, Qiong Xie, Cheng-Wei Qiu, and Huigao Duan","authorsParsed":[["Chi","Hanbin",""],["Hu","Yueqiang",""],["Ou","Xiangnian",""],["Jiang","Yuting",""],["Yu","Dian",""],["Lou","Shaozhen",""],["Wang","Quan",""],["Xie","Qiong",""],["Qiu","Cheng-Wei",""],["Duan","Huigao",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 01:36:23 GMT"}],"updateDate":"2024-07-02","timestamp":1719711383000,"abstract":"  Flexible control light field across multiple parameters is the cornerstone of\nversatile and miniaturized optical devices. Metasurfaces, comprising\nsubwavelength scatterers, offer a potent platform for executing such precise\nmanipulations. However, the inherent mutual constraints between parameters of\nmetasurfaces make it challenging for traditional approaches to achieve\nfull-parameter control across multiple wavelengths. Here, we propose a\nuniversal end-to-end inverse design framework to directly optimize the\ngeometric parameter layout of meta-optics based on the target functionality of\nfull-parameter control across multiple wavelengths. This framework employs a\ndifferentiable forward simulator integrating a neural network-based dispersive\nfull-parameter Jones matrix and Fourier propagation to facilitate\ngradient-based optimization. Its superiority over sequential forward designs in\ndual-polarization channel color holography with higher quality and\ntri-polarization three-dimensional color holography with higher multiplexed\ncapacity is showcased. To highlight the universality, we further present\npolarized spectral multi-information processing with six arbitrary\npolarizations and three wavelengths. This versatile, differentiable,\nsystem-level design framework is poised to expedite the advancement of\nmeta-optics in integrated multi-information display, imaging, and\ncommunication, extending to multi-modal sensing applications.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}