{"id":"2407.17548","title":"A closer look at the extended edge-on low-surface brightness galaxies","authors":"Anna S. Saburova, Damir Gasymov, Evgenii V. Rubtsov, Igor V.\n  Chilingarian, Sviatoslav Borisov, Ivan Gerasimov, Fedor Kolganov, Anastasia\n  V. Kasparova, Roman I. Uklein, Michal B\\'ilek, Kirill A. Grishin, Anatoly\n  Zasov, Mariia Demianenko, Ivan Yu. Katkov, Ana Lalovi\\'c, Srdjan Samurovi\\'c","authorsParsed":[["Saburova","Anna S.",""],["Gasymov","Damir",""],["Rubtsov","Evgenii V.",""],["Chilingarian","Igor V.",""],["Borisov","Sviatoslav",""],["Gerasimov","Ivan",""],["Kolganov","Fedor",""],["Kasparova","Anastasia V.",""],["Uklein","Roman I.",""],["Bílek","Michal",""],["Grishin","Kirill A.",""],["Zasov","Anatoly",""],["Demianenko","Mariia",""],["Katkov","Ivan Yu.",""],["Lalović","Ana",""],["Samurović","Srdjan",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-26","timestamp":1721844000000,"abstract":"  To understand the origin of extended disks of low-surface brightness (LSB)\ngalaxies, we studied in detail 4 such systems with large disks seen edge-on.\nTwo of them are edge-on giant LSB galaxies (gLSBGs) recently identified by our\nteam. The edge-on orientation of these systems boosts their surface\nbrightnesses that provided an opportunity to characterize stellar populations\nspectroscopically and yielded the first such measurements for edge-on gLSBGs.\nWe collected deep images of one galaxy using the 1.4-m Milankovi\\'c Telescope\nwhich we combined with the archival Subaru Hyper Suprime-Cam and DESI Legacy\nSurveys data available for the three other systems, and measured the structural\nparameters of the disks. We acquired deep long-slit spectra with the Russian\n6-meter telescope and the 10-m Keck II telescope and estimated stellar\npopulation properties in the high- and low-surface brightness regions as well\nas the gas-phase metallicity distribution. The gas metallicity gradients are\nshallow to flat in the range between 0 and -0.03 dex per exponential disk scale\nlength, which is consistent with the extrapolation of the gradient -- scale\nlength relation for smaller disk galaxies. Our estimates of stellar velocity\ndispersion in the LSB disks as well as the relative thickness of the disks\nindicate the dynamical overheating. Our observations favor mergers as the\nessential stage in the formation scenario for massive LSB galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}