{"id":"2407.05806","title":"Normative brain mapping of 3-dimensional morphometry imaging data using\n  skewed functional data analysis","authors":"Marco Palma, Shahin Tavakoli, Julia Brettschneider, Ana-Maria Staicu,\n  Thomas E. Nichols (for the Alzheimer's Disease Neuroimaging Initiative)","authorsParsed":[["Palma","Marco","","for the Alzheimer's Disease Neuroimaging Initiative"],["Tavakoli","Shahin","","for the Alzheimer's Disease Neuroimaging Initiative"],["Brettschneider","Julia","","for the Alzheimer's Disease Neuroimaging Initiative"],["Staicu","Ana-Maria","","for the Alzheimer's Disease Neuroimaging Initiative"],["Nichols","Thomas E.","","for the Alzheimer's Disease Neuroimaging Initiative"]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 10:35:26 GMT"}],"updateDate":"2024-07-09","timestamp":1720434926000,"abstract":"  Tensor-based morphometry (TBM) aims at showing local differences in brain\nvolumes with respect to a common template. TBM images are smooth but they\nexhibit (especially in diseased groups) higher values in some brain regions\ncalled lateral ventricles. More specifically, our voxelwise analysis shows both\na mean-variance relationship in these areas and evidence of spatially dependent\nskewness. We propose a model for 3-dimensional functional data where mean,\nvariance, and skewness functions vary smoothly across brain locations. We model\nthe voxelwise distributions as skew-normal. The smooth effects of age and sex\nare estimated on a reference population of cognitively normal subjects from the\nAlzheimer's Disease Neuroimaging Initiative (ADNI) dataset and mapped across\nthe whole brain. The three parameter functions allow to transform each TBM\nimage (in the reference population as well as in a test set) into a Gaussian\nprocess. These subject-specific normative maps are used to derive indices of\ndeviation from a healthy condition to assess the individual risk of\npathological degeneration.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}