{"id":"2407.13269","title":"Valley polarization of Landau levels driven by residual strain in the\n  ZrSiS surface band","authors":"Christopher J. Butler, Masayuki Murase, Shunki Sawada, Ming-Chun\n  Jiang, Daisuke Hashizume, Guang-Yu Guo, Ryotaro Arita, Tetsuo Hanaguri, Takao\n  Sasagawa","authorsParsed":[["Butler","Christopher J.",""],["Murase","Masayuki",""],["Sawada","Shunki",""],["Jiang","Ming-Chun",""],["Hashizume","Daisuke",""],["Guo","Guang-Yu",""],["Arita","Ryotaro",""],["Hanaguri","Tetsuo",""],["Sasagawa","Takao",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 08:22:56 GMT"}],"updateDate":"2024-07-19","timestamp":1721290976000,"abstract":"  In a multi-valley electronic band structure, lifting of the valley degeneracy\nis associated with rotational symmetry breaking in the electronic fluid, and\nmay emerge through spontaneous symmetry breaking order, or through a large\nresponse to a small external perturbation such as strain. In this work we use\nscanning tunneling microscopy to investigate an unexpected rotational symmetry\nbreaking in Landau levels formed in the unusual floating surface band of ZrSiS.\nWe visualize a ubiquitous splitting of Landau levels into valley-polarized\nsub-levels. We demonstrate methods to measure valley-selective Landau level\nspectroscopy, to infer unknown Landau level indices, and to precisely measure\neach valley's Berry phase in a way that is agnostic to the band structure and\ntopology of the system. These techniques allow us to obtain each valley's\ndispersion curve and infer a rigid valley-dependent contribution to the band\nenergies. Ruling out spontaneous symmetry breaking by establishing the\nsample-dependence of this valley splitting, we explain the effect in terms of\nresidual strain. A quantitative estimate indicates that uniaxial strain can be\nmeasured to a precision of $ \\lt 0.025 \\% $. The extreme valley-polarization of\nthe Landau levels results from as little as $ \\sim 0.1 \\% $ strain, and this\nsuggests avenues for manipulation using deliberate strain engineering.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EWAihJ9PtDfXiX5nGd2Szn8JdxiU45MtYYj74oAvg-0","pdfSize":"14664085"}
