{"id":"2407.10540","title":"Sudden polarization angle jumps of the repeating fast radio burst FRB\n  20201124A","authors":"J. R. Niu, W. Y. Wang, J. C. Jiang, Y. Qu, D. J. Zhou, W. W. Zhu, K.\n  J. Lee, J. L. Han, B. Zhang, D. Li, S. Cao, Z. Y. Fang, Y. Feng, Q. Y. Fu, P.\n  Jiang, W. C. Jing, J. Li, Y. Li, R. Luo, L. Q. Meng, C. C. Miao, X. L. Miao,\n  C. H. Niu, Y. C. Pan, B. J. Wang, F. Y. Wang, H. Z. Wang, P. Wang, Q. Wu, Z.\n  W. Wu, H. Xu, J. W. Xu, L. Xu, M. Y. Xue, Y. P. Yang, M. Yuan, Y. L. Yue, D.\n  Zhao, C. F. Zhang, D. D. Zhang, J. S. Zhang, S. B. Zhang, Y. K. Zhang, and Y.\n  H. Zhu","authorsParsed":[["Niu","J. R.",""],["Wang","W. Y.",""],["Jiang","J. C.",""],["Qu","Y.",""],["Zhou","D. J.",""],["Zhu","W. W.",""],["Lee","K. J.",""],["Han","J. L.",""],["Zhang","B.",""],["Li","D.",""],["Cao","S.",""],["Fang","Z. Y.",""],["Feng","Y.",""],["Fu","Q. Y.",""],["Jiang","P.",""],["Jing","W. C.",""],["Li","J.",""],["Li","Y.",""],["Luo","R.",""],["Meng","L. Q.",""],["Miao","C. C.",""],["Miao","X. L.",""],["Niu","C. H.",""],["Pan","Y. C.",""],["Wang","B. J.",""],["Wang","F. Y.",""],["Wang","H. Z.",""],["Wang","P.",""],["Wu","Q.",""],["Wu","Z. W.",""],["Xu","H.",""],["Xu","J. W.",""],["Xu","L.",""],["Xue","M. Y.",""],["Yang","Y. P.",""],["Yuan","M.",""],["Yue","Y. L.",""],["Zhao","D.",""],["Zhang","C. F.",""],["Zhang","D. D.",""],["Zhang","J. S.",""],["Zhang","S. B.",""],["Zhang","Y. K.",""],["Zhu","Y. H.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 08:48:42 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 03:40:11 GMT"}],"updateDate":"2024-08-16","timestamp":1721033322000,"abstract":"  We report the first detection of polarization angle (PA) orthogonal jumps, a\nphenomenon previously only observed from radio pulsars, from a fast radio burst\n(FRB) source FRB 20201124A. We find three cases of orthogonal jumps in over two\nthousand bursts, all resembling those observed in pulsar single pulses. We\npropose that the jumps are due to the superposition of two orthogonal emission\nmodes that could only be produced in a highly magnetized plasma, and they are\ncaused by the line of sight sweeping across a rotating magnetosphere. The\nshortest jump timescale is of the order of one-millisecond, which hints that\nthe emission modes come from regions smaller than the light cylinder of most\npulsars or magnetars. This discovery provides convincing evidence that FRB\nemission originates from the complex magnetosphere of a magnetar, suggesting an\nFRB emission mechanism that is analogous to radio pulsars despite a huge\nluminosity difference between two types of objects.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}