{"id":"2407.09188","title":"First principles calculations of dynamical Born effective charges,\n  quadrupoles and higher order terms from the charge response in large\n  semiconducting and metallic systems","authors":"Francesco Macheda and Paolo Barone and Francesco Mauri","authorsParsed":[["Macheda","Francesco",""],["Barone","Paolo",""],["Mauri","Francesco",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 11:40:48 GMT"}],"updateDate":"2024-07-15","timestamp":1720784448000,"abstract":"  Within the context of first principles techniques we present a theoretical\nand computational framework to quickly determine, at finite momentum, the\nself-consistent (longitudinal) charge response to an external perturbation,\nthat enters the determination of the scattering cross section of inelastic\nscattering processes such as EELS. We also determine the (tranverse) charge\nresponse computed in short-circuit condition. The all-order quasimomentum\nexpansion of the tranverse charge response to an atomic displacement are the\nBorn effective charges, quadrupoles, octupoles etc. We demonstrate that the\ntransverse charge response can be related to the longitudinal one via a\nwell-defined long-range dielectric function. Our advancements lead to an\nefficient use of perturbation theory. Due to its more favorable scaling, our\nmethod provides an interesting computational alternative to the use of the 2n+1\ntheorem, especially for semiconductors and metals with large unit cells. For\nsemiconductors, we compute the piezoelectric properties of a large cell\nsolid-solution of semiconducting hafniun oxide containing 96 atoms. We here\nshow that the clamped ion piezoelectric response can be decomposed into\nreal-space localized contributions that mostly depend on the chemical\nenvironment, paving the way for the use of machine-learning techniques in the\nmaterial search for optimized piezoelectrics. We further apply our methodology\nto determine the density response of metals. Here, the leading terms of the\ncharge expansion are related to the Fermi energy shift of the potential and by\nBorn effective charges which do not sum to zero over the atoms. We apply our\ndevelopments to the TEM-EELS spectroscopy of lithium intercalated graphites,\nwhere we find that the use of the atomic form-factor in the long-wavelength\nlimit does not take into account for the anisotropy of the atomic chemical\nbonding.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}