{"id":"2407.11498","title":"Thermodynamic Space of Chemical Reaction Networks","authors":"Shiling Liang, Paolo De Los Rios, Daniel Maria Busiello","authorsParsed":[["Liang","Shiling",""],["Rios","Paolo De Los",""],["Busiello","Daniel Maria",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 08:35:04 GMT"}],"updateDate":"2024-07-17","timestamp":1721118904000,"abstract":"  Living systems are usually maintained out of equilibrium and exhibit complex\ndynamical behaviors. The external energy supply often comes from chemical\nfluxes that can keep some species concentrations constant. Furthermore, the\nproperties of the underlying chemical reaction networks (CRNs) are also\ninstrumental in establishing robust biological functioning. Hence, capturing\nthe emergent complexity of living systems and the role of their non-equilibrium\nnature is fundamental to uncover constraints and properties of the CRNs\nunderpinning their functions. In particular, while kinetics plays a key role in\nshaping detailed dynamical phenomena, the range of operations of any CRN must\nbe fundamentally constrained by thermodynamics, as they necessarily operate\nwith a given energy budget. Here, we derive universal thermodynamic upper and\nlower bounds for the accessible space of species concentrations in a generic\nCRN. The resulting region determines the \"thermodynamic space\" of the CRN, a\nconcept we introduce in this work. Moreover, we obtain similar bounds also for\nthe affinities, shedding light on how global thermodynamic properties can limit\nlocal non-equilibrium quantities. We illustrate our results in two paradigmatic\nexamples, the Schl\\\"ogl model for bistability and a minimal self-assembly\nprocess, demonstrating how the onset of complex behaviors is intimately tangled\nwith the presence of non-equilibrium driving. In summary, our work unveils the\nexact form of the accessible space in which a CRN must work as a function of\nits energy budget, shedding light on the non-equilibrium origin of a variety of\nphenomena, from amplification to pattern formation. Ultimately, by providing a\ngeneral tool for analyzing CRNs, the presented framework constitutes a stepping\nstone to deepen our ability to predict complex out-of-equilibrium behaviors and\ndesign artificial chemical reaction systems.\n","subjects":["Condensed Matter/Statistical Mechanics","Quantitative Biology/Molecular Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}