{"id":"2407.12037","title":"A Novel HDL Code Generator for Effectively Testing FPGA Logic Synthesis\n  Compilers","authors":"Zhihao Xu, Shikai Guo, Guilin Zhao, Peiyu Zou, Xiaochen Li, He Jiang","authorsParsed":[["Xu","Zhihao",""],["Guo","Shikai",""],["Zhao","Guilin",""],["Zou","Peiyu",""],["Li","Xiaochen",""],["Jiang","He",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 06:41:05 GMT"}],"updateDate":"2024-07-18","timestamp":1719816065000,"abstract":"  Field Programmable Gate Array (FPGA) logic synthesis compilers (e.g., Vivado,\nIverilog, Yosys, and Quartus) are widely applied in Electronic Design\nAutomation (EDA), such as the development of FPGA programs.However, defects\n(i.e., incorrect synthesis) in logic synthesis compilers may lead to unexpected\nbehaviors in target applications, posing security risks. Therefore, it is\ncrucial to thoroughly test logic synthesis compilers to eliminate such\ndefects.Despite several Hardware Design Language (HDL) code generators (e.g.,\nVerismith) have been proposed to find defects in logic synthesis compilers, the\neffectiveness of these generators is still limited by the simple code\ngeneration strategy and the monogeneity of the generated HDL code.This paper\nproposes LegoHDL, a novel method to generate syntax valid HDL code for\ncomprehensively testing FPGA logic synthesis compilers.LegoHDL can generate\nmore complex and diverse defect-trigger HDL code (e.g., Verilog, VHDL, and\nSystemVerilog) by leveraging the guidance of abstract syntax tree and the\nextensive function block libraries of cyber-physical systems. Extensive\nexperiments show that the diversity and defect-trigger capability of HDL code\ngenerated by LegoHDL are significantly better than the state-of-the-art method\n(i.e., Verismith).In three months, LegoHDL has reported 20 new defects--many of\nwhich are deep and important; 16 of them have been confirmed.\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}