{"id":"2407.03199","title":"BOWIE-ALIGN: How formation and migration histories of giant planets\n  impact atmospheric compositions","authors":"Anna B.T. Penzlin, Richard A. Booth, James Kirk, James E. Owen,\n  Eva-Maria Ahrer, Duncan A. Christie, Alastair B. Claringbold, Emma\n  Esparza-Borges, M. L\\'opez-Morales, N. J. Mayne, Mason McCormack, Annabella\n  Meech, Vatsal Panwar, Diana Powell, Denis E. Sergeev, Jake Taylor, Peter J.\n  Wheatley, Maria Zamyatina","authorsParsed":[["Penzlin","Anna B. T.",""],["Booth","Richard A.",""],["Kirk","James",""],["Owen","James E.",""],["Ahrer","Eva-Maria",""],["Christie","Duncan A.",""],["Claringbold","Alastair B.",""],["Esparza-Borges","Emma",""],["López-Morales","M.",""],["Mayne","N. J.",""],["McCormack","Mason",""],["Meech","Annabella",""],["Panwar","Vatsal",""],["Powell","Diana",""],["Sergeev","Denis E.",""],["Taylor","Jake",""],["Wheatley","Peter J.",""],["Zamyatina","Maria",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 15:29:34 GMT"},{"version":"v2","created":"Thu, 4 Jul 2024 07:29:46 GMT"}],"updateDate":"2024-07-08","timestamp":1720020574000,"abstract":"  Hot Jupiters present a unique opportunity for measuring how planet formation\nhistory shapes present-day atmospheric composition. However, due to the myriad\npathways influencing composition, a well-constructed sample of planets is\nneeded to determine whether formation history can be accurately traced back\nfrom atmospheric composition. To this end, the BOWIE-ALIGN survey will compare\nthe compositions of 8 hot Jupiters around F stars, 4 with orbits aligned with\nthe stellar rotation axis and 4 misaligned. Using the alignment as an indicator\nfor planets that underwent disc migration or high-eccentricity migration, one\ncan determine whether migration history produces notable differences in\ncomposition between the two samples of planets. This paper describes the planet\nformation model that motivates our observing programme. Our model traces the\naccretion of chemical components from the gas and dust in the disc over a broad\nparameter space to create a full, unbiased model sample from which we can\nestimate the range of final atmospheric compositions. For high metallicity\natmospheres (O/H > 10 times solar), the C/O ratios of aligned and misaligned\nplanets diverge, with aligned planets having lower C/O (< 0.25) due to the\naccretion of oxygen-rich silicates from the inner disc. However, silicates may\nrain out instead of releasing their oxygen into the atmosphere. This would\nsignificantly increase the C/O of aligned planets (C/O > 0.6), inverting the\ntrend between the aligned and misaligned planets. Nevertheless, by comparing\nstatistically significant samples of aligned and misaligned planets, we expect\natmospheric composition to constrain how planets form.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}