{"id":"2407.11732","title":"First-principles investigation of magnetic exchange force microscopy on\n  adatoms adsorbed on an antiferromagnetic surface","authors":"Soumyajyoti Haldar and Stefan Heinze","authorsParsed":[["Haldar","Soumyajyoti",""],["Heinze","Stefan",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 14:02:44 GMT"}],"updateDate":"2024-07-17","timestamp":1721138564000,"abstract":"  Using density functional theory (DFT), we calculate the magnetic short-ranged\nexchange forces between a magnetic tip and an adatom adsorbed on the\nantiferromagnetic Mn monolayer on the W(110) surface [Mn/W(110)]. These\nexchange forces can be measured in magnetic exchange force microscopy allowing\natomic-scale imaging of spin structures on insulating and conducting surfaces.\nWe consider two types of $3d$ transition-metal atoms with intrinsic magnetic\nmoments: Co and Mn and Ir as an example of a $5d$ transition-metal atom\nexhibiting an induced magnetic moment on Mn/W(110). The tips are modeled by Fe\npyramids and terminated either with an Fe or a Mn apex atom. From our total\nenergy DFT calculations for a parallel and antiparallel alignment between tip\nand adatom magnetic moments we obtain the exchange energy $E_{\\rm ex}(d)$ as a\nfunction of tip-adatom distance $d$. The exchange forces, $F_{\\rm ex}(d)$, are\ncalculated based on the Hellmann-Feynman theorem. We show that structural\nrelaxations of tip and sample due to their interaction need to be taken into\naccount. Due to the exchange interaction the relaxations depend on the\nalignment between tip and adatom magnetization -- an effect which will affect\nthe tunneling magnetoresistance that can be measured by a scanning tunneling\nmicroscope. A maximum in the exchange energy and force curves is obtained for\nmagnetic adatoms at tip-adatom separations of about 3 to 4~{\\AA}. The exchange\nforces with an Fe terminated tip reach a maximum value of up to 0.2~nN and\n0.6~nN for Co and Mn adatoms, respectively, and prefer an antiferromagnetic\ncoupling. Surprisingly, we also find an exchange force of up to 0.2~nN for Ir\nadatoms. We analyze the exchange interaction between tip and adatom based on\nthe spin-polarized electronic structure of the coupled system......\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}