{"id":"2407.18757","title":"Towards Robust Hemolysis Modeling with Uncertainty Quantification: A\n  Universal Approach to Address Experimental Variance","authors":"Christopher Blum, Ulrich Steinseifer, Michael Neidlin","authorsParsed":[["Blum","Christopher",""],["Steinseifer","Ulrich",""],["Neidlin","Michael",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 14:10:53 GMT"}],"updateDate":"2024-07-29","timestamp":1722003053000,"abstract":"  Purpose: The purpose of this study is to address the lack of uncertainty\nquantification in numerical hemolysis models, which are critical for medical\ndevice evaluations. Specifically, we aim to incorporate experimental\nvariability into these models using the Markov Chain Monte Carlo (MCMC) method\nto enhance predictive accuracy and robustness.\n  Methods: We applied the MCMC method to an experimental hemolysis dataset to\nderive detailed stochastic distributions for the hemolysis Power Law model\nparameters $C$, $\\alpha$ and $\\beta$. These distributions were then propagated\nthrough a reduced order model of the FDA benchmark pump to quantify the\nexperimental uncertainty in hemolysis measurements with respect to the\npredicted pump hemolysis.\n  Results: The MCMC analysis revealed multiple local minima in the sum of\nsquared errors, highlighting the non-uniqueness of traditional Power Law model\nfitting. The MCMC results showed a constant optimal $C=3.515x10-5$ and log\nnormal distributions of $\\alpha$ and $\\beta$ with means of 0.614 and 1.795,\nrespectively. The MCMC model closely matched the mean and variance of\nexperimental data. In comparison, conventional deterministic models are not\nable to describe experimental variation.\n  Conclusion: Incorporating Uncertainty quantification through MCMC enhances\nthe robustness and predictive accuracy of hemolysis models. This method allows\nfor better comparison of simulated hemolysis outcomes with in-vivo experiments\nand can integrate additional datasets, potentially setting a new standard in\nhemolysis modeling.\n","subjects":["Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6xEcRKzO8kHBgvSMCPC890HwzobLYcgiZvg3s4GEyAE","pdfSize":"736550"}
