{"id":"2407.21370","title":"SHA-CNN: Scalable Hierarchical Aware Convolutional Neural Network for\n  Edge AI","authors":"Narendra Singh Dhakad, Yuvnish Malhotra, Santosh Kumar Vishvakarma,\n  Kaushik Roy","authorsParsed":[["Dhakad","Narendra Singh",""],["Malhotra","Yuvnish",""],["Vishvakarma","Santosh Kumar",""],["Roy","Kaushik",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 06:44:52 GMT"}],"updateDate":"2024-08-01","timestamp":1722408292000,"abstract":"  This paper introduces a Scalable Hierarchical Aware Convolutional Neural\nNetwork (SHA-CNN) model architecture for Edge AI applications. The proposed\nhierarchical CNN model is meticulously crafted to strike a balance between\ncomputational efficiency and accuracy, addressing the challenges posed by\nresource-constrained edge devices. SHA-CNN demonstrates its efficacy by\nachieving accuracy comparable to state-of-the-art hierarchical models while\noutperforming baseline models in accuracy metrics. The key innovation lies in\nthe model's hierarchical awareness, enabling it to discern and prioritize\nrelevant features at multiple levels of abstraction. The proposed architecture\nclassifies data in a hierarchical manner, facilitating a nuanced understanding\nof complex features within the datasets. Moreover, SHA-CNN exhibits a\nremarkable capacity for scalability, allowing for the seamless incorporation of\nnew classes. This flexibility is particularly advantageous in dynamic\nenvironments where the model needs to adapt to evolving datasets and\naccommodate additional classes without the need for extensive retraining.\nTesting has been conducted on the PYNQ Z2 FPGA board to validate the proposed\nmodel. The results achieved an accuracy of 99.34%, 83.35%, and 63.66% for\nMNIST, CIFAR-10, and CIFAR-100 datasets, respectively. For CIFAR-100, our\nproposed architecture performs hierarchical classification with 10% reduced\ncomputation while compromising only 0.7% accuracy with the state-of-the-art.\nThe adaptability of SHA-CNN to FPGA architecture underscores its potential for\ndeployment in edge devices, where computational resources are limited. The\nSHA-CNN framework thus emerges as a promising advancement in the intersection\nof hierarchical CNNs, scalability, and FPGA-based Edge AI.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by/4.0/"}