{"id":"2407.14657","title":"Centroiding and Extraction of Tip/Tilt Information from Nonlinear\n  Curvature Wavefront Sensor Measurements","authors":"Caleb A. Abbott, Justin R. Crepp, Stanimir O. Letchev, Connor M. Smith","authorsParsed":[["Abbott","Caleb A.",""],["Crepp","Justin R.",""],["Letchev","Stanimir O.",""],["Smith","Connor M.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 20:34:29 GMT"}],"updateDate":"2024-07-23","timestamp":1721421269000,"abstract":"  The nonlinear curvature wavefront sensor (nlCWFS) uses multiple (typically\nfour) out-of-focus images to reconstruct the phase and amplitude of a\npropagating light beam. Because these images are located between the pupil and\nfocal planes, they contain tip/tilt information. Rather than using a separate\nsensor to measure image locations, it would be beneficial to extract tip/tilt\ninformation directly and routinely as part of the reconstruction process. In\nthe presence of atmospheric turbulence, recovering precise centroid offsets for\neach out-of-focus image becomes a dynamic process as image structure is altered\nby changing aberrations. We examine several tip/tilt extraction methods and\ncompare their precision and accuracy using numerical simulations. We find that\nthe nlCWFS outer measurement planes confer more accurate and reliable tip/tilt\ninformation than the inner measurement planes, due to their larger geometric\nlever arm. However, in practice, finite field of view (detector region of\ninterest) effects bias tip/tilt retrieval when using the outer planes due to\ndiffraction. Using knowledge of the $z$-distance to each plane, we find that\napplying a best-fit linear model to multiple image centroid locations can offer\nfast and accurate tip/tilt mode retrieval. For the most demanding applications,\na non-linear tip/tilt extraction method that self-consistently uses the speckle\nfield may need to be developed.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}