{"id":"2407.19950","title":"A multilevel backbone extraction framework","authors":"Sanaa Hmaida, Hocine Cherifi, Mohammed El Hassouni","authorsParsed":[["Hmaida","Sanaa",""],["Cherifi","Hocine",""],["Hassouni","Mohammed El",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 12:35:24 GMT"}],"updateDate":"2024-07-30","timestamp":1722256524000,"abstract":"  As networks grow in size and complexity, backbones become an essential\nnetwork representation. Indeed, they provide a simplified yet informative\noverview of the underlying organization by retaining the most significant and\nstructurally influential connections within a network. Network heterogeneity\noften results in complex and intricate structures, making it challenging to\nidentify the backbone. In response, we introduce the Multilevel Backbone\nExtraction Framework, a novel approach that diverges from conventional backbone\nmethodologies. This generic approach prioritizes the mesoscopic organization of\nnetworks. First, it splits the network into homogeneous-density components.\nSecond, it extracts independent backbones for each component using any\nclassical Backbone technique. Finally, the various backbones are combined. This\nstrategy effectively addresses the heterogeneity observed in network groupings.\nEmpirical investigations on real-world networks underscore the efficacy of the\nMultilevel Backbone approach in preserving essential network structures and\nproperties. Experiments demonstrate its superiority over classical methods in\nhandling network heterogeneity and enhancing network integrity. The framework\nis adaptable to various types of networks and backbone extraction techniques,\nmaking it a versatile tool for network analysis and backbone extraction across\ndiverse network applications.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"O0G1grNSIacy5Agp_EWJV121_Yy-_w2rfFcYX43kWGE","pdfSize":"4127172"}
