{"id":"2407.00664","title":"SCMIL: Sparse Context-aware Multiple Instance Learning for Predicting\n  Cancer Survival Probability Distribution in Whole Slide Images","authors":"Zekang Yang and Hong Liu and Xiangdong Wang","authorsParsed":[["Yang","Zekang",""],["Liu","Hong",""],["Wang","Xiangdong",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 11:22:36 GMT"}],"updateDate":"2024-07-02","timestamp":1719746556000,"abstract":"  Cancer survival prediction is a challenging task that involves analyzing of\nthe tumor microenvironment within Whole Slide Image (WSI). Previous methods\ncannot effectively capture the intricate interaction features among instances\nwithin the local area of WSI. Moreover, existing methods for cancer survival\nprediction based on WSI often fail to provide better clinically meaningful\npredictions. To overcome these challenges, we propose a Sparse Context-aware\nMultiple Instance Learning (SCMIL) framework for predicting cancer survival\nprobability distributions. SCMIL innovatively segments patches into various\nclusters based on their morphological features and spatial location\ninformation, subsequently leveraging sparse self-attention to discern the\nrelationships between these patches with a context-aware perspective.\nConsidering many patches are irrelevant to the task, we introduce a learnable\npatch filtering module called SoftFilter, which ensures that only interactions\nbetween task-relevant patches are considered. To enhance the clinical relevance\nof our prediction, we propose a register-based mixture density network to\nforecast the survival probability distribution for individual patients. We\nevaluate SCMIL on two public WSI datasets from the The Cancer Genome Atlas\n(TCGA) specifically focusing on lung adenocarcinom (LUAD) and kidney renal\nclear cell carcinoma (KIRC). Our experimental results indicate that SCMIL\noutperforms current state-of-the-art methods for survival prediction, offering\nmore clinically meaningful and interpretable outcomes. Our code is accessible\nat https://github.com/yang-ze-kang/SCMIL.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}