{"id":"2407.12909","title":"State-dependent mobility edge in kinetically constrained models","authors":"Manthan Badbaria, Nicola Pancotti, Rajeev Singh, Jamir Marino,\n  Riccardo J. Valencia-Tortora","authorsParsed":[["Badbaria","Manthan",""],["Pancotti","Nicola",""],["Singh","Rajeev",""],["Marino","Jamir",""],["Valencia-Tortora","Riccardo J.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-19","timestamp":1721239201000,"abstract":"  In this work, we show that the kinetically constrained quantum East model\nlies between a quantum scarred and a many-body localized system featuring an\nunconventional type of mobility edge in the spectrum. We name this scenario\n$\\textit{state-dependent}$ mobility edge: while the system does not exhibit a\nsharp separation in energy between thermal and non-thermal eigenstates, the\nabundance of non-thermal eigenstates results in slow entanglement growth for\n$\\textit{many}$ initial states, such as product states, below a finite energy\ndensity. We characterize the state-dependent mobility edge by looking at the\ncomplexity of classically simulating dynamics using tensor network for system\nsizes well beyond those accessible via exact diagonalization. Focusing on\ninitial product states, we observe a qualitative change in the dynamics of the\nbond dimension needed as a function of their energy density. Specifically, the\nbond dimension typically grows $\\textit{polynomially}$ in time up to a certain\nenergy density, where we locate the state-dependent mobility edge, enabling\nsimulations for long times. Above this energy density, the bond dimension\ntypically grows $\\textit{exponentially}$ making the simulation practically\nunfeasible beyond short times, as generally expected in interacting theories.\nWe correlate the polynomial growth of the bond dimension to the presence of\nmany non-thermal eigenstates around that energy density, a subset of which we\ncompute via tensor network.\n","subjects":["Condensed Matter/Statistical Mechanics","Condensed Matter/Disordered Systems and Neural Networks","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}