{"id":"2407.00858","title":"A comprehensive screening of plasma-facing materials for nuclear fusion","authors":"Andrea Fedrigucci, Nicola Marzari, Paolo Ricci","authorsParsed":[["Fedrigucci","Andrea",""],["Marzari","Nicola",""],["Ricci","Paolo",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 23:57:54 GMT"}],"updateDate":"2024-07-02","timestamp":1719791874000,"abstract":"  Plasma-facing materials (PFMs) represent one of the most significant\nchallenges for the design of future nuclear fusion reactors. Inside the\nreactor, the divertor will experience the harshest material environment:\nintense bombardment of neutrons and plasma particles coupled with large and\nintermittent heat fluxes. The material designated to cover this role in ITER is\ntungsten (W). While no other materials have shown the potential to match the\nproperties of W, many drawbacks associated with its application remain,\nincluding: cracking and erosion induced by a low recrystallization temperature\ncombined with a high ductile-brittle transition temperature and\nneutron-initiated embrittlement; surface morphology changes (fuzz layer) due to\nplasma-W interaction with subsequent risk of spontaneous material melting and\ndelamination; low oxidation resistance. This work aims to produce a structured\nand comprehensive materials screening of PFMs candidates based on known\ninorganic materials. The methodology applied in this study to identify the most\npromising PFM candidates combines peer-reviewed data present in the Pauling\nFile database and DFT calculations of two key PFMs defects, namely the surface\nbinding energy and the formation energy of a hydrogen interstitial. The crystal\nstructures and their related properties, extracted from the Pauling File, are\nranked according to the heat-balance equation of a PFM subject to the heat\nloads in the divertor region of an ITER-like tokamak. The materials satisfying\nthe requirements are critically compared with the state-of-the-art literature,\ndefining an optimal subset where to perform the first-principles electronic\nstructure calculations. The majority of previously known PFMs are captured by\nthis screening process, confirming its reliability. Additionally, less familiar\nrefractory materials suggest performance that calls for further investigations.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Gj6CEfOg_207iySuqQHOD0R1Wr4d-tb8gz_Qk4b2jpU","pdfSize":"1886839","objectId":"0xee0e0325856c2542cd62f131e10158149adecdfb3db4fca8936d24bc89bb2586","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
