{"id":"2407.21322","title":"Randomized Controlled Trials of Service Interventions: The Impact of\n  Capacity Constraints","authors":"Justin Boutilier, Jonas Oddur Jonasson, Hannah Li, Erez Yoeli","authorsParsed":[["Boutilier","Justin",""],["Jonasson","Jonas Oddur",""],["Li","Hannah",""],["Yoeli","Erez",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 04:03:41 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 17:55:52 GMT"}],"updateDate":"2024-08-06","timestamp":1722398621000,"abstract":"  Randomized controlled trials (RCTs), or experiments, are the gold standard\nfor intervention evaluation. However, the main appeal of RCTs, the clean\nidentification of causal effects, can be compromised by interference, when one\nsubject's treatment assignment can influence another subject's behavior or\noutcomes. In this paper, we formalise and study a type of interference stemming\nfrom the operational implementation of a subclass of interventions we term\nService Interventions (SIs): interventions that include an on-demand service\ncomponent provided by a costly and limited resource (e.g., healthcare providers\nor teachers).\n  We show that in such a system, the capacity constraints induce dependencies\nacross experiment subjects, where an individual may need to wait before\nreceiving the intervention. By modeling these dependencies using a queueing\nsystem, we show how increasing the number of subjects without increasing the\ncapacity of the system can lead to a nonlinear decrease in the treatment effect\nsize. This has implications for conventional power analysis and recruitment\nstrategies: increasing the sample size of an RCT without appropriately\nexpanding capacity can decrease the study's power. To address this issue, we\npropose a method to jointly select the system capacity and number of users\nusing the square root staffing rule from queueing theory. We show how\nincorporating knowledge of the queueing structure can help an experimenter\nreduce the amount of capacity and number of subjects required while still\nmaintaining high power. In addition, our analysis of congestion-driven\ninterference provides one concrete mechanism to explain why similar protocols\ncan result in different RCT outcomes and why promising interventions at the RCT\nstage may not perform well at scale.\n","subjects":["Statistics/Methodology","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}