{"id":"2407.15055","title":"Natural Language Task-Oriented Dialog System 2.0","authors":"Adib Mosharrof, A.B. Siddique","authorsParsed":[["Mosharrof","Adib",""],["Siddique","A. B.",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 04:52:38 GMT"}],"updateDate":"2024-07-23","timestamp":1721537558000,"abstract":"  Task-oriented dialog (TOD) systems play a crucial role in facilitating\nefficient interactions between users and machines by focusing on achieving\nspecific goals through natural language communication. These systems\ntraditionally rely on manually annotated metadata, such as dialog states and\npolicy annotations, which is labor-intensive, expensive, inconsistent, and\nprone to errors, thereby limiting the potential to leverage the vast amounts of\navailable conversational data. A critical aspect of TOD systems involves\naccessing and integrating information from external sources to effectively\nengage users. The process of determining when and how to query external\nresources represents a fundamental challenge in system design, however existing\napproaches expect this information to provided in the context. In this paper,\nwe introduce Natural Language Task Oriented Dialog System (NL-ToD), a novel\nmodel that removes the dependency on manually annotated turn-wise data by\nutilizing dialog history and domain schemas to create a Zero Shot Generalizable\nTOD system. We also incorporate query generation as a core task of the system,\nwhere the output of the system could be a response to the user or an API query\nto communicate with an external resource. To achieve a more granular analysis\nof the system output, we classify the output into multiple categories: slot\nfilling, retrieval, and query generation. Our analysis reveals that slot\nfilling is the most challenging TOD task for all models. Experimental results\non three popular TOD datasets (SGD, KETOD and BiToD) shows the effectiveness of\nour approach as NL-ToD outperforms state-of-the-art approaches, particularly\nwith a \\textbf{31.4\\%} and \\textbf{82.1\\%} improvement in the BLEU-4 score on\nthe SGD and KETOD dataset.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MUYF-SNEFM6Tsrq9nH88orjBMyNBX6yQsXYO9wPseMo","pdfSize":"1235344"}
