{"id":"2407.09497","title":"Simplicits: Mesh-Free, Geometry-Agnostic, Elastic Simulation","authors":"Vismay Modi, Nicholas Sharp, Or Perel, Shinjiro Sueda, David I. W.\n  Levin","authorsParsed":[["Modi","Vismay",""],["Sharp","Nicholas",""],["Perel","Or",""],["Sueda","Shinjiro",""],["Levin","David I. W.",""]],"versions":[{"version":"v1","created":"Sun, 9 Jun 2024 18:57:23 GMT"}],"updateDate":"2024-07-16","timestamp":1717959443000,"abstract":"  The proliferation of 3D representations, from explicit meshes to implicit\nneural fields and more, motivates the need for simulators agnostic to\nrepresentation. We present a data-, mesh-, and grid-free solution for elastic\nsimulation for any object in any geometric representation undergoing large,\nnonlinear deformations. We note that every standard geometric representation\ncan be reduced to an occupancy function queried at any point in space, and we\ndefine a simulator atop this common interface. For each object, we fit a small\nimplicit neural network encoding spatially varying weights that act as a\nreduced deformation basis. These weights are trained to learn physically\nsignificant motions in the object via random perturbations. Our loss ensures we\nfind a weight-space basis that best minimizes deformation energy by\nstochastically evaluating elastic energies through Monte Carlo sampling of the\ndeformation volume. At runtime, we simulate in the reduced basis and sample the\ndeformations back to the original domain. Our experiments demonstrate the\nversatility, accuracy, and speed of this approach on data including signed\ndistance functions, point clouds, neural primitives, tomography scans, radiance\nfields, Gaussian splats, surface meshes, and volume meshes, as well as showing\na variety of material energies, contact models, and time integration schemes.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vrg9bI4VyFuV4AJgRjngwHTa-spyFv9kr0AKkIIB5Y0","pdfSize":"25835597","objectId":"0x24c6efb83f9b627658d12551bd90c674c35169158114a2c1e22c20de257252df","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
