{"id":"2407.11553","title":"Learning Global and Local Features of Power Load Series Through\n  Transformer and 2D-CNN: An Image-based Multi-step Forecasting Approach\n  Incorporating Phase Space Reconstruction","authors":"Zihan Tang, Tianyao Ji and Wenhu Tang","authorsParsed":[["Tang","Zihan",""],["Ji","Tianyao",""],["Tang","Wenhu",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 09:59:13 GMT"},{"version":"v2","created":"Sun, 28 Jul 2024 16:59:49 GMT"}],"updateDate":"2024-07-30","timestamp":1721123953000,"abstract":"  As modern power systems continue to evolve, accurate power load forecasting\nremains a critical issue in energy management. The phase space reconstruction\nmethod can effectively retain the inner chaotic property of power load from a\nsystem dynamics perspective and thus is a promising knowledge-based\npreprocessing method for short-term forecasting. In order to fully utilize the\ncapability of PSR method to model the non-stationary characteristics within\npower load, and to solve the problem of the difficulty in applying traditional\nPSR prediction methods to form a general multi-step forecasting scheme, this\nstudy proposes a novel multi-step forecasting approach by delicately\nintegrating the PSR with neural networks to establish an end-to-end learning\nsystem. Firstly, the useful features in the phase trajectory are discussed in\ndetail. Through mathematical derivation, the equivalent characterization of the\nPSR and another time series preprocessing method, patch segmentation, is\ndemonstrated for the first time. Based on this knowledge, an image-based\nmodeling perspective is introduced. Subsequently, a novel deep learning model,\nnamely PSR-GALIEN, is designed, in which the Transformer Encoder and 2D-CNN are\nemployed for the extraction of the global and local patterns in the image, and\na MLP-based predictor is used for the efficient correlation modeling. Then,\nextensive experiments are conducted on five real-world benchmark datasets to\nverify the effectiveness of the PSR-GALIEN. The results show that, compared\nwith six state-of-the-art deep learning models, the forecasting performance of\nPSR-GALIEN consistently surpasses these baselines, achieving superior accuracy\nin both intra-day and day-ahead forecasting scenarios. At the same time, the\nattributions of its forecasting results can be explained through the\nvisualization-based method, which significantly increases the interpretability.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}