{"id":"2407.00820","title":"Localization and Perception for Control of a Low Speed Autonomous\n  Shuttle in a Campus Pilot Deployment","authors":"Bowen Wen","authorsParsed":[["Wen","Bowen",""]],"versions":[{"version":"v1","created":"Tue, 2 Apr 2024 21:38:39 GMT"}],"updateDate":"2024-07-02","timestamp":1712093919000,"abstract":"  Future SAE Level 4 and Level 5 autonomous vehicles will require novel\napplications of localization, perception, control and artificial intelligence\ntechnology in order to offer innovative and disruptive solutions to current\nmobility problems. Accurate localization is essential for self driving vehicle\nnavigation in GPS inaccessible environments. This thesis concentrates on low\nspeed autonomous shuttles that are mainly utilized for university campus\nintelligent transportation systems and presents initial results of ongoing work\non developing solutions to the localization and perception challenges of a\nuniversity planned pilot deployment orientated application. The paper treats\nautonomous driving with real time kinematics GPS (Global Positioning Systems)\nwith an inertial measurement unit (IMU), combined with simultaneous\nlocalization and mapping (SLAM) with threedimensional light detection and\nranging (LIDAR) sensor, which provides solutions to scenarios where GPS is not\navailable or a lower cost and hence lower accuracy GPS is desirable. The\nin-house automated low speed electric vehicle from the Automated Driving Lab is\nused in experimental evaluation and verification. An improved version of Hector\nSLAM was implemented on ROS and compared with high resolution GPS aided\nlocalization framework in the same hardware architecture. The overall\nconfiguration that combines ROS with DSpace controller can be easily\ntransplantable prototype in other hardware architectures for future similar\nresearch. Real-world experiments that are reported here have been conducted in\na small test area close to the Ohio State University AV pilot test route. are\nused for demonstrating the feasibility and robustness of this approach to\ndeveloping and evaluating low speed autonomous shuttle localization and\nperception algorithms for control and decision making.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EMoeQ2pxrR6qVBIeCceYgC-GxQ5J2s2Nz0HiLc9Yd0Y","pdfSize":"2290655"}
