{"id":"2407.10104","title":"A Self-Supervised Learning Pipeline for Demographically Fair Facial\n  Attribute Classification","authors":"Sreeraj Ramachandran and Ajita Rattani","authorsParsed":[["Ramachandran","Sreeraj",""],["Rattani","Ajita",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 07:11:57 GMT"}],"updateDate":"2024-07-16","timestamp":1720941117000,"abstract":"  Published research highlights the presence of demographic bias in automated\nfacial attribute classification. The proposed bias mitigation techniques are\nmostly based on supervised learning, which requires a large amount of labeled\ntraining data for generalizability and scalability. However, labeled data is\nlimited, requires laborious annotation, poses privacy risks, and can perpetuate\nhuman bias. In contrast, self-supervised learning (SSL) capitalizes on freely\navailable unlabeled data, rendering trained models more scalable and\ngeneralizable. However, these label-free SSL models may also introduce biases\nby sampling false negative pairs, especially at low-data regimes 200K images)\nunder low compute settings. Further, SSL-based models may suffer from\nperformance degradation due to a lack of quality assurance of the unlabeled\ndata sourced from the web. This paper proposes a fully self-supervised pipeline\nfor demographically fair facial attribute classifiers. Leveraging completely\nunlabeled data pseudolabeled via pre-trained encoders, diverse data curation\ntechniques, and meta-learning-based weighted contrastive learning, our method\nsignificantly outperforms existing SSL approaches proposed for downstream image\nclassification tasks. Extensive evaluations on the FairFace and CelebA datasets\ndemonstrate the efficacy of our pipeline in obtaining fair performance over\nexisting baselines. Thus, setting a new benchmark for SSL in the fairness of\nfacial attribute classification.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}