{"id":"2407.15719","title":"GFE-Mamba: Mamba-based AD Multi-modal Progression Assessment via\n  Generative Feature Extraction from MCI","authors":"Zhaojie Fang, Shenghao Zhu, Yifei Chen, Binfeng Zou, Fan Jia, Linwei\n  Qiu, Chang Liu, Yiyu Huang, Xiang Feng, Feiwei Qin, Changmiao Wang, Yeru\n  Wang, Jin Fan, Changbiao Chu, Wan-Zhen Wu, Hu Zhao","authorsParsed":[["Fang","Zhaojie",""],["Zhu","Shenghao",""],["Chen","Yifei",""],["Zou","Binfeng",""],["Jia","Fan",""],["Qiu","Linwei",""],["Liu","Chang",""],["Huang","Yiyu",""],["Feng","Xiang",""],["Qin","Feiwei",""],["Wang","Changmiao",""],["Wang","Yeru",""],["Fan","Jin",""],["Chu","Changbiao",""],["Wu","Wan-Zhen",""],["Zhao","Hu",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 15:22:33 GMT"}],"updateDate":"2024-07-23","timestamp":1721661753000,"abstract":"  Alzheimer's Disease (AD) is an irreversible neurodegenerative disorder that\noften progresses from Mild Cognitive Impairment (MCI), leading to memory loss\nand significantly impacting patients' lives. Clinical trials indicate that\nearly targeted interventions for MCI patients can potentially slow or halt the\ndevelopment and progression of AD. Previous research has shown that accurate\nmedical classification requires the inclusion of extensive multimodal data,\nsuch as assessment scales and various neuroimaging techniques like Magnetic\nResonance Imaging (MRI) and Positron Emission Tomography (PET). However,\nconsistently tracking the diagnosis of the same individual over time and\nsimultaneously collecting multimodal data poses significant challenges. To\naddress this issue, we introduce GFE-Mamba, a classifier based on Generative\nFeature Extraction (GFE). This classifier effectively integrates data from\nassessment scales, MRI, and PET, enabling deeper multimodal fusion. It\nefficiently extracts both long and short sequence information and incorporates\nadditional information beyond the pixel space. This approach not only improves\nclassification accuracy but also enhances the interpretability and stability of\nthe model. We constructed datasets of over 3000 samples based on the\nAlzheimer's Disease Neuroimaging Initiative (ADNI) for a two-step training\nprocess. Our experimental results demonstrate that the GFE-Mamba model is\neffective in predicting the conversion from MCI to AD and outperforms several\nstate-of-the-art methods. Our source code and ADNI dataset processing code are\navailable at https://github.com/Tinysqua/GFE-Mamba.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}