{"id":"2407.03539","title":"Population Size Estimation with Many Lists and Heterogeneity: A\n  Conditional Log-Linear Model Among the Unobserved","authors":"Mateo Dulce Rubio, Edward Kennedy","authorsParsed":[["Rubio","Mateo Dulce",""],["Kennedy","Edward",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 23:03:21 GMT"}],"updateDate":"2024-07-08","timestamp":1720047801000,"abstract":"  We contribute a general and flexible framework to estimate the size of a\nclosed population in the presence of $K$ capture-recapture lists and\nheterogeneous capture probabilities. Our novel identifying strategy leverages\nthe fact that it is sufficient for identification that a subset of the $K$\nlists are not arbitrarily dependent \\textit{within the subset of the population\nunobserved by the remaining lists}, conditional on covariates. This\nidentification approach is interpretable and actionable, interpolating between\nthe two predominant approaches in the literature as special cases:\n(conditional) independence across lists and log-linear models with no\nhighest-order interaction. We derive nonparametric doubly-robust estimators for\nthe resulting identification expression that are nearly optimal and\napproximately normal for any finite sample size, even when the heterogeneous\ncapture probabilities are estimated nonparametrically using machine learning\nmethods. Additionally, we devise a sensitivity analysis to show how deviations\nfrom the identification assumptions affect the resulting population size\nestimates, allowing for the integration of domain-specific knowledge into the\nidentification and estimation processes more transparently. We empirically\ndemonstrate the advantages of our method using both synthetic data and real\ndata from the Peruvian internal armed conflict to estimate the number of\ncasualties. The proposed methodology addresses recent critiques of\ncapture-recapture models by allowing for a weaker and more interpretable\nidentifying assumption and accommodating complex heterogeneous capture\nprobabilities depending on high-dimensional or continuous covariates.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}