{"id":"2407.00286","title":"Digital Twin-Assisted Data-Driven Optimization for Reliable Edge Caching\n  in Wireless Networks","authors":"Zifan Zhang, Yuchen Liu, Zhiyuan Peng, Mingzhe Chen, Dongkuan Xu,\n  Shuguang Cui","authorsParsed":[["Zhang","Zifan",""],["Liu","Yuchen",""],["Peng","Zhiyuan",""],["Chen","Mingzhe",""],["Xu","Dongkuan",""],["Cui","Shuguang",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 02:40:28 GMT"}],"updateDate":"2024-07-02","timestamp":1719628828000,"abstract":"  Optimizing edge caching is crucial for the advancement of next-generation\n(nextG) wireless networks, ensuring high-speed and low-latency services for\nmobile users. Existing data-driven optimization approaches often lack awareness\nof the distribution of random data variables and focus solely on optimizing\ncache hit rates, neglecting potential reliability concerns, such as base\nstation overload and unbalanced cache issues. This oversight can result in\nsystem crashes and degraded user experience. To bridge this gap, we introduce a\nnovel digital twin-assisted optimization framework, called D-REC, which\nintegrates reinforcement learning (RL) with diverse intervention modules to\nensure reliable caching in nextG wireless networks. We first develop a joint\nvertical and horizontal twinning approach to efficiently create network digital\ntwins, which are then employed by D-REC as RL optimizers and safeguards,\nproviding ample datasets for training and predictive evaluation of our cache\nreplacement policy. By incorporating reliability modules into a constrained\nMarkov decision process, D-REC can adaptively adjust actions, rewards, and\nstates to comply with advantageous constraints, minimizing the risk of network\nfailures. Theoretical analysis demonstrates comparable convergence rates\nbetween D-REC and vanilla data-driven methods without compromising caching\nperformance. Extensive experiments validate that D-REC outperforms conventional\napproaches in cache hit rate and load balancing while effectively enforcing\npredetermined reliability intervention modules.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}