{"id":"2407.10914","title":"Wetting and pressure gradient performance in a lattice Boltzmann color\n  gradient model","authors":"Mahmoud Sedahmed, Rodrigo C. V. Coelho","authorsParsed":[["Sedahmed","Mahmoud",""],["Coelho","Rodrigo C. V.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:12:26 GMT"},{"version":"v2","created":"Thu, 19 Sep 2024 00:33:26 GMT"}],"updateDate":"2024-09-20","timestamp":1721063546000,"abstract":"  An accurate implementation of wetting and pressure drop is crucial to\ncorrectly reproducing fluid displacement processes in porous media. Although\nseveral strategies have been proposed in the literature, a systematic\ncomparison of them is needed to determine the most suitable for practical\napplications. Here, we carried out numerical simulations to investigate the\nperformance of two widely used wettability schemes in the lattice Boltzmann\ncolor gradient model, namely the geometrical wetting scheme by Leclaire et al.\n(Scheme-I) and the modified direction of the color gradient scheme by Akai et\nal. (Scheme-II). We showed that Scheme-II was more accurate in simulating\nstatic contact angles of a fluid droplet on a solid surface. However, Scheme-I\nwas more accurate in simulating a dynamic case of a binary fluid flow in a\nhorizontal capillary tube described by the Washburn equation. Moreover, we\ninvestigated the performance of two popular pressure gradient implementation\ntypes. Type-I used the so-called Zou-He pressure boundary conditions at the\ninlet and the outlet of the domain, while Type-II used an external body force\nas a pressure gradient. We showed that the Type-I implementation was slightly\nmore accurate in simulating a neutrally wetting fluid in a horizontal capillary\ntube described by the Washburn equation. We also investigated the differences\nbetween the two types of pressure gradient implementation in simulating two\nfluid displacement processes in a Bentheimer sandstone rock sample: the primary\ndrainage and the imbibition displacement processes.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}