{"id":"2407.17918","title":"Vector tomography for reconstructing electric fields with non-zero\n  divergence in bounded domains","authors":"Alexandra Koulouri, Mike Brookes and Ville Rimpilainen","authorsParsed":[["Koulouri","Alexandra",""],["Brookes","Mike",""],["Rimpilainen","Ville",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 10:12:10 GMT"}],"updateDate":"2024-07-26","timestamp":1721902330000,"abstract":"  In vector tomography (VT), the aim is to reconstruct an unknown\nmulti-dimensional vector field using line integral data. In the case of a\n2-dimensional VT, two types of line integral data are usually required. These\ndata correspond to integration of the parallel and perpendicular projection of\nthe vector field along integration lines. VT methods are non-invasive,\nnon-intrusive and offer more information on the field than classical point\nmeasurements; they are typically used to reconstruct divergence-free (or\nsource-free) velocity and flow fields. In this paper, we show that VT can also\nbe used for the reconstruction of fields with non-zero divergence. In\nparticular, we study electric fields generated by dipole sources in bounded\ndomains which arise, for example, in electroencephalography (EEG) source\nimaging. To the best of our knowledge, VT has not previously been used to\nreconstruct such fields. We explain in detail the theoretical background, the\nderivation of the electric field inverse problem and the numerical\napproximation of the line integrals. We show that fields with non-zero\ndivergence can be reconstructed from the longitudinal measurements with the\nhelp of two sparsity constraints that are constructed from the transverse\nmeasurements and the vector Laplace operator. As a comparison to EEG source\nimaging, we note that VT does not require mathematical modelling of the\nsources. By numerical simulations, we show that the pattern of the electric\nfield can be correctly estimated using VT and the location of the source\nactivity can be determined accurately from the reconstructed magnitudes of the\nfield.\n","subjects":["Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hgz-NHE7QhSy0ID-PNpU_wMzmkiAF4DZpEXRrHcNjAM","pdfSize":"7814313"}
