{"id":"2407.03968","title":"Academic Freedom and International Research Collaboration: A\n  Longitudinal Analysis of Global Network Evolution","authors":"Travis A. Whetsell, Jen Sidorova","authorsParsed":[["Whetsell","Travis A.",""],["Sidorova","Jen",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 14:37:35 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 23:08:10 GMT"}],"updateDate":"2024-09-02","timestamp":1720103855000,"abstract":"  The topic of academic freedom has come to the fore as nations around the\nworld experience a wave of democratic backsliding. Institutions of higher\neducation are often targets of autocrats who seek to suppress intellectual\nsources of social and political resistance. At the same time, international\ncollaboration in scientific research continues unabated, and the network of\nglobal science grows larger and denser every year. This research analyzes the\neffects of academic freedom on international research collaboration (IRC) in a\nsample of 166 countries. Global international collaboration data are drawn from\narticles in Web of Science across a 30-year time frame (1993-2022) and are used\nto construct three separate IRC networks in science and technology (S&T),\nsocial sciences (SocSci), and arts and humanities (A&H). The Academic Freedom\nIndex, covering the same time frame, is drawn from the Varieties of Democracy\nProject, as are numerous country-level control variables. Stochastic\nactor-oriented models (SAOM) are used to analyze the networks. The results show\npositive significant estimates for both direct effects and homophily effects of\nacademic freedom on network evolution. These effects appear to increase in\nstrength moving from the S&T network, to the SocSci network, and appear\nstrongest in the A\\&H network. However, tests of temporal heterogeneity show a\nsignificant decline in the relevance of academic freedom in the most recent\nperiod.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/"}