{"id":"2407.09587","title":"A mean field analysis of the role of indirect transmission in emergent\n  infection events","authors":"Tom\\'as Ignacio Gonz\\'alez, Mar\\'ia Fabiana Laguna and Guillermo\n  Abramson","authorsParsed":[["González","Tomás Ignacio",""],["Laguna","María Fabiana",""],["Abramson","Guillermo",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 16:51:45 GMT"}],"updateDate":"2024-07-19","timestamp":1720803105000,"abstract":"  We developed a mathematical model to investigate the role of indirect\ntransmission in the spread of infectious diseases, using the illustrative\nexample of sarcoptic mange as a case study. This disease can be transmitted\nthrough direct contact between an infected host and a susceptible one, or\nindirectly when potential hosts encounter infectious mites and larvae deposited\nin the environment, commonly referred to as fomites. Our focus is on exploring\nthe potential of these infectious reservoirs as triggers for emerging infection\nevents and as stable reservoirs of the disease. To achieve this, our mean field\ncompartmental model incorporates the epidemiological dynamics driven by\nindirect transmission via fomites. We identify different types of dynamics that\nthe system can go into, controlled by different levels of direct and indirect\ntransmission. Among these, we find a new regime where the disease can emerge\nand persist over time solely through fomites, without the necessity for direct\ntransmission. This possibility of the system reveals an evolutionary pathway\nthat could enable the parasite to enhance its fitness beyond host co-evolution.\nWe also define a new threshold based on an effective reproductive number, that\nenables us to predict the conditions for disease persistence. Our model allows\nus to assess the potential effectiveness of various disease intervention\nmeasures by incorporating a feature observed in real systems. We hope this\ncontributes to a better understanding of infectious disease outbreaks.\n","subjects":["Quantitative Biology/Populations and Evolution","Nonlinear Sciences/Adaptation and Self-Organizing Systems","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"_b2c1O8gfefu7vFDL99r_uoYHMPhIz-mWsspAtpYgas","pdfSize":"1337752"}
