{"id":"2407.15839","title":"Importance Sampling-Guided Meta-Training for Intelligent Agents in\n  Highly Interactive Environments","authors":"Mansur Arief, Mike Timmerman, Jiachen Li, David Isele, Mykel J\n  Kochenderfer","authorsParsed":[["Arief","Mansur",""],["Timmerman","Mike",""],["Li","Jiachen",""],["Isele","David",""],["Kochenderfer","Mykel J",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 17:57:12 GMT"}],"updateDate":"2024-07-23","timestamp":1721671032000,"abstract":"  Training intelligent agents to navigate highly interactive environments\npresents significant challenges. While guided meta reinforcement learning (RL)\napproach that first trains a guiding policy to train the ego agent has proven\neffective in improving generalizability across various levels of interaction,\nthe state-of-the-art method tends to be overly sensitive to extreme cases,\nimpairing the agents' performance in the more common scenarios. This study\nintroduces a novel training framework that integrates guided meta RL with\nimportance sampling (IS) to optimize training distributions for navigating\nhighly interactive driving scenarios, such as T-intersections. Unlike\ntraditional methods that may underrepresent critical interactions or\noveremphasize extreme cases during training, our approach strategically adjusts\nthe training distribution towards more challenging driving behaviors using IS\nproposal distributions and applies the importance ratio to de-bias the result.\nBy estimating a naturalistic distribution from real-world datasets and\nemploying a mixture model for iterative training refinements, the framework\nensures a balanced focus across common and extreme driving scenarios.\nExperiments conducted with both synthetic dataset and T-intersection scenarios\nfrom the InD dataset demonstrate not only accelerated training but also\nimprovement in agent performance under naturalistic conditions, showcasing the\nefficacy of combining IS with meta RL in training reliable autonomous agents\nfor highly interactive navigation tasks.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}