{"id":"2407.03655","title":"Pathological Semantics-Preserving Learning for H&E-to-IHC Virtual\n  Staining","authors":"Fuqiang Chen, Ranran Zhang, Boyun Zheng, Yiwen Sun, Jiahui He, Wenjian\n  Qin","authorsParsed":[["Chen","Fuqiang",""],["Zhang","Ranran",""],["Zheng","Boyun",""],["Sun","Yiwen",""],["He","Jiahui",""],["Qin","Wenjian",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 05:54:00 GMT"},{"version":"v2","created":"Sun, 28 Jul 2024 05:55:26 GMT"}],"updateDate":"2024-07-30","timestamp":1720072440000,"abstract":"  Conventional hematoxylin-eosin (H&E) staining is limited to revealing cell\nmorphology and distribution, whereas immunohistochemical (IHC) staining\nprovides precise and specific visualization of protein activation at the\nmolecular level. Virtual staining technology has emerged as a solution for\nhighly efficient IHC examination, which directly transforms H&E-stained images\nto IHC-stained images. However, virtual staining is challenged by the\ninsufficient mining of pathological semantics and the spatial misalignment of\npathological semantics. To address these issues, we propose the Pathological\nSemantics-Preserving Learning method for Virtual Staining (PSPStain), which\ndirectly incorporates the molecular-level semantic information and enhances\nsemantics interaction despite any spatial inconsistency. Specifically, PSPStain\ncomprises two novel learning strategies: 1) Protein-Aware Learning Strategy\n(PALS) with Focal Optical Density (FOD) map maintains the coherence of protein\nexpression level, which represents molecular-level semantic information; 2)\nPrototype-Consistent Learning Strategy (PCLS), which enhances cross-image\nsemantic interaction by prototypical consistency learning. We evaluate PSPStain\non two public datasets using five metrics: three clinically relevant metrics\nand two for image quality. Extensive experiments indicate that PSPStain\noutperforms current state-of-the-art H&E-to-IHC virtual staining methods and\ndemonstrates a high pathological correlation between the staging of real and\nvirtual stains.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}