{"id":"2407.08689","title":"Operationalizing the Blueprint for an AI Bill of Rights: Recommendations\n  for Practitioners, Researchers, and Policy Makers","authors":"Alex Oesterling, Usha Bhalla, Suresh Venkatasubramanian, Himabindu\n  Lakkaraju","authorsParsed":[["Oesterling","Alex",""],["Bhalla","Usha",""],["Venkatasubramanian","Suresh",""],["Lakkaraju","Himabindu",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 17:28:07 GMT"}],"updateDate":"2024-07-12","timestamp":1720718887000,"abstract":"  As Artificial Intelligence (AI) tools are increasingly employed in diverse\nreal-world applications, there has been significant interest in regulating\nthese tools. To this end, several regulatory frameworks have been introduced by\ndifferent countries worldwide. For example, the European Union recently passed\nthe AI Act, the White House issued an Executive Order on safe, secure, and\ntrustworthy AI, and the White House Office of Science and Technology Policy\nissued the Blueprint for an AI Bill of Rights (AI BoR). Many of these\nframeworks emphasize the need for auditing and improving the trustworthiness of\nAI tools, underscoring the importance of safety, privacy, explainability,\nfairness, and human fallback options. Although these regulatory frameworks\nhighlight the necessity of enforcement, practitioners often lack detailed\nguidance on implementing them. Furthermore, the extensive research on\noperationalizing each of these aspects is frequently buried in technical papers\nthat are difficult for practitioners to parse. In this write-up, we address\nthis shortcoming by providing an accessible overview of existing literature\nrelated to operationalizing regulatory principles. We provide\neasy-to-understand summaries of state-of-the-art literature and highlight\nvarious gaps that exist between regulatory guidelines and existing AI research,\nincluding the trade-offs that emerge during operationalization. We hope that\nthis work not only serves as a starting point for practitioners interested in\nlearning more about operationalizing the regulatory guidelines outlined in the\nBlueprint for an AI BoR but also provides researchers with a list of critical\nopen problems and gaps between regulations and state-of-the-art AI research.\nFinally, we note that this is a working paper and we invite feedback in line\nwith the purpose of this document as described in the introduction.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}