{"id":"2407.03146","title":"Enhancing Class Fairness in Classification with A Two-Player Game\n  Approach","authors":"Yunpeng Jiang and Paul Weng and Yutong Ban","authorsParsed":[["Jiang","Yunpeng",""],["Weng","Paul",""],["Ban","Yutong",""]],"versions":[{"version":"v1","created":"Fri, 31 May 2024 02:56:43 GMT"},{"version":"v2","created":"Mon, 8 Jul 2024 05:21:59 GMT"}],"updateDate":"2024-07-09","timestamp":1717124203000,"abstract":"  Data augmentation is widely applied and has shown its benefits in different\nmachine learning tasks. However, as recently observed in some downstream tasks,\ndata augmentation may introduce an unfair impact on classifications. While it\ncan improve the performance of some classes, it can actually be detrimental for\nother classes, which can be problematic in some application domains. In this\npaper, to counteract this phenomenon, we propose a FAir Classification approach\nwith a Two-player game (FACT). We first formulate the training of a classifier\nwith data augmentation as a fair optimization problem, which can be further\nwritten as an adversarial two-player game. Following this formulation, we\npropose a novel multiplicative weight optimization algorithm, for which we\ntheoretically prove that it can converge to a solution that is fair over\nclasses. Interestingly, our formulation also reveals that this fairness issue\nover classes is not due to data augmentation only, but is in fact a general\nphenomenon. Our empirical experiments demonstrate that the performance of our\nlearned classifiers is indeed more fairly distributed over classes in five\ndatasets, with only limited impact on the average accuracy.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}