{"id":"2407.13681","title":"Imaging the jet of MWC 349A with resolved Radio Recombination Line\n  emission from ALMA","authors":"Antonio Mart\\'inez-Henares, Qizhou Zhang, Izaskun Jim\\'enez-Serra,\n  Jes\\'us Mart\\'in-Pintado, Nuria Hu\\'elamo, Sirina Prasad, James Moran and\n  Alejandro B\\'aez-Rubio","authorsParsed":[["Martínez-Henares","Antonio",""],["Zhang","Qizhou",""],["Jiménez-Serra","Izaskun",""],["Martín-Pintado","Jesús",""],["Huélamo","Nuria",""],["Prasad","Sirina",""],["Moran","James",""],["Báez-Rubio","Alejandro",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:54:12 GMT"}],"updateDate":"2024-07-19","timestamp":1721321652000,"abstract":"  Jets and disk winds arise from materials with excess angular momentum ejected\nfrom the accretion disks in forming stars. How these structures are launched\nand how they impact the gas within the innermost regions of these objects\nremains poorly understood. MWC349A is a massive star that has a circumstellar\ndisk which rotates in accord with Kepler's Law, with an ionized wind and a\nhigh-velocity jet launched from the disk surface. The strongly maser-amplified\nemission of hydrogen radio recombination lines (RRLs) observed toward this\nsystem provides a comprehensive picture of its ionized environment with\nexquisite detail. In this Letter, we present ALMA observations of the\nH26$\\alpha$ RRL and continuum emission obtained with the highest angular\nresolution ever used toward this source (beam of $\\sim$0.02\"). The maser RRL\nemission is resolved for the first time and clearly delineates the ionized\ndisk, wind and jet. We analyzed the RRL data cubes with the 3D non-LTE\nradiative transfer model MORELI, confirming that the jet is poorly collimated.\nWe found that the jet orientation is closer to the rotation axis of the system\nthan derived from spatially unresolved data. This study confirms that hydrogen\nRRL masers are powerful probes of the physical structure and kinematics of the\ninnermost ionized material around massive stars.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}