{"id":"2407.08363","title":"Alternative climatic steady states for the Permian-Triassic\n  paleogeography","authors":"Charline Ragon, Christian V\\'erard, J\\'er\\^ome Kasparian and Maura\n  Brunetti","authorsParsed":[["Ragon","Charline",""],["Vérard","Christian",""],["Kasparian","Jérôme",""],["Brunetti","Maura",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 10:18:15 GMT"}],"updateDate":"2024-07-12","timestamp":1720693095000,"abstract":"  Due to spatial scarcity and uncertainties in sediment data, initial and\nboundary conditions in deep-time climate simulations are not well constrained.\nOn the other hand, the climate is a nonlinear system with a multitude of\nfeedback mechanisms that compete and balance differently depending on the\ninitial and boundary conditions. This opens up the possibility to obtain\nmultiple steady states under the same forcing in numerical experiments. Here,\nwe use the MIT general circulation model with a coupled\natmosphere-ocean-thermodynamic sea ice-land configuration to explore the\nexistence of such alternative steady states around the Permian-Triassic\nBoundary (PTB). We construct the corresponding bifurcation diagram, taking into\naccount processes on a timescale of thousands of years, in order to identify\nthe stability range of the steady states and tipping points as the atmospheric\nCO$_2$ content is varied. We find three alternative steady states with a\ndifference in global mean surface air temperature of about 10 $^\\circ$C. We\nalso examine how these climatic steady states are modified when feedbacks\noperating on comparable or longer time scales are included, in particular\nvegetation dynamics and air-sea carbon exchanges. Our findings on\nmultistability provide a useful framework for explaining the climatic\nvariations observed in the Early Triassic geological record, as well as some\ndiscrepancies between numerical simulations in the literature and geological\ndata at PTB and its aftermath.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Nonlinear Sciences/Chaotic Dynamics","Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}