{"id":"2407.18001","title":"Measurement of $D^0-\\overline{D}^0$ mixing and search for $CP$ violation\n  with $D^0\\rightarrow K^+\\pi^-$ decays","authors":"LHCb collaboration: R. Aaij, A.S.W. Abdelmotteleb, C. Abellan Beteta,\n  F. Abudin\\'en, T. Ackernley, A. A. Adefisoye, B. Adeva, M. Adinolfi, P.\n  Adlarson, C. Agapopoulou, C.A. Aidala, Z. Ajaltouni, S. Akar, K. Akiba, P.\n  Albicocco, J. Albrecht, F. Alessio, M. Alexander, Z. Aliouche, P. Alvarez\n  Cartelle, R. Amalric, S. Amato, J.L. Amey, Y. Amhis, L. An, L. Anderlini, M.\n  Andersson, A. Andreianov, P. Andreola, M. Andreotti, D. Andreou, A. Anelli,\n  D. Ao, F. Archilli, M. Argenton, S. Arguedas Cuendis, A. Artamonov, M.\n  Artuso, E. Aslanides, R. Ataide Da Silva, M. Atzeni, B. Audurier, D. Bacher,\n  I. Bachiller Perea, S. Bachmann, M. Bachmayer, J.J. Back, P. Baladron\n  Rodriguez, V. Balagura, W. Baldini, H. Bao, J. Baptista de Souza Leite, M.\n  Barbetti, I. R. Barbosa, R.J. Barlow, M. Barnyakov, S. Barsuk, W. Barter, M.\n  Bartolini, J. Bartz, J.M. Basels, G. Bassi, B. Batsukh, A. Bay, A. Beck, M.\n  Becker, F. Bedeschi, I.B. Bediaga, S. Belin, V. Bellee, K. Belous, I. Belov,\n  I. Belyaev, G. Benane, G. Bencivenni, E. Ben-Haim, A. Berezhnoy, R. Bernet,\n  S. Bernet Andres, A. Bertolin, C. Betancourt, F. Betti, J. Bex, Ia.\n  Bezshyiko, J. Bhom, M.S. Bieker, N.V. Biesuz, P. Billoir, A. Biolchini, M.\n  Birch, F.C.R. Bishop, A. Bitadze, A. Bizzeti, T. Blake, F. Blanc, J.E. Blank,\n  S. Blusk, V. Bocharnikov, J.A. Boelhauve, O. Boente Garcia, T. Boettcher, A.\n  Bohare, A. Boldyrev, C.S. Bolognani, R. Bolzonella, N. Bondar, F. Borgato, S.\n  Borghi, M. Borsato, J.T. Borsuk, S.A. Bouchiba, T.J.V. Bowcock, A. Boyer, C.\n  Bozzi, A. Brea Rodriguez, N. Breer, J. Brodzicka, A. Brossa Gonzalo, J.\n  Brown, D. Brundu, E. Buchanan, A. Buonaura, L. Buonincontri, A.T. Burke, C.\n  Burr, A. Butkevich, J.S. Butter, J. Buytaert, W. Byczynski, S. Cadeddu, H.\n  Cai, R. Calabrese, S. Calderon Ramirez, L. Calefice, S. Cali, M. Calvi, M.\n  Calvo Gomez, P. Camargo Magalhaes, J. I. Cambon Bouzas, P. Campana, D.H.\n  Campora Perez, A.F. Campoverde Quezada, S. Capelli, L. Capriotti, R.\n  Caravaca-Mora, A. Carbone, L. Carcedo Salgado, R. Cardinale, A. Cardini, P.\n  Carniti, L. Carus, A. Casais Vidal, R. Caspary, G. Casse, J. Castro Godinez,\n  M. Cattaneo, G. Cavallero, V. Cavallini, S. Celani, D. Cervenkov, S. Cesare,\n  A.J. Chadwick, I. Chahrour, M. Charles, Ph. Charpentier, E. Chatzianagnostou,\n  C.A. Chavez Barajas, M. Chefdeville, C. Chen, S. Chen, Z. Chen, A. Chernov,\n  S. Chernyshenko, V. Chobanova, S. Cholak, M. Chrzaszcz, A. Chubykin, V.\n  Chulikov, P. Ciambrone, X. Cid Vidal, G. Ciezarek, P. Cifra, P.E.L. Clarke,\n  M. Clemencic, H.V. Cliff, J. Closier, C. Cocha Toapaxi, V. Coco, J. Cogan, E.\n  Cogneras, L. Cojocariu, P. Collins, T. Colombo, A. Comerma-Montells, L.\n  Congedo, A. Contu, N. Cooke, I. Corredoira, A. Correia, G. Corti, J.J. Cottee\n  Meldrum, B. Couturier, D.C. Craik, M. Cruz Torres, E. Curras Rivera, R.\n  Currie, C.L. Da Silva, S. Dadabaev, L. Dai, X. Dai, E. Dall'Occo, J. Dalseno,\n  C. D'Ambrosio, J. Daniel, A. Danilina, P. d'Argent, A. Davidson, J.E. Davies,\n  A. Davis, O. De Aguiar Francisco, C. De Angelis, F. De Benedetti, J. de Boer,\n  K. De Bruyn, S. De Capua, M. De Cian, U. De Freitas Carneiro Da Graca, E. De\n  Lucia, J.M. De Miranda, L. De Paula, M. De Serio, P. De Simone, F. De Vellis,\n  J.A. de Vries, F. Debernardis, D. Decamp, V. Dedu, L. Del Buono, B. Delaney,\n  H.-P. Dembinski, J. Deng, V. Denysenko, O. Deschamps, F. Dettori, B. Dey, P.\n  Di Nezza, I. Diachkov, S. Didenko, S. Ding, L. Dittmann, V. Dobishuk, A. D.\n  Docheva, C. Dong, A.M. Donohoe, F. Dordei, A.C. dos Reis, A. D. Dowling, W.\n  Duan, P. Duda, M.W. Dudek, L. Dufour, V. Duk, P. Durante, M. M. Duras, J.M.\n  Durham, O. D. Durmus, A. Dziurda, A. Dzyuba, S. Easo, E. Eckstein, U. Egede,\n  A. Egorychev, V. Egorychev, S. Eisenhardt, E. Ejopu, L. Eklund, M. Elashri,\n  J. Ellbracht, S. Ely, A. Ene, E. Epple, J. Eschle, S. Esen, T. Evans, F.\n  Fabiano, L.N. Falcao, Y. Fan, B. Fang, L. Fantini, M. Faria, K. Farmer, D.\n  Fazzini, L. Felkowski, M. Feng, M. Feo, M. Fernandez Gomez, A.D. Fernez, F.\n  Ferrari, F. Ferreira Rodrigues, M. Ferrillo, M. Ferro-Luzzi, S. Filippov,\n  R.A. Fini, M. Fiorini, K.M. Fischer, D.S. Fitzgerald, C. Fitzpatrick, F.\n  Fleuret, M. Fontana, L. F. Foreman, R. Forty, D. Foulds-Holt, M. Franco\n  Sevilla, M. Frank, E. Franzoso, G. Frau, C. Frei, D.A. Friday, J. Fu, Q.\n  Fuehring, Y. Fujii, T. Fulghesu, E. Gabriel, G. Galati, M.D. Galati, A.\n  Gallas Torreira, D. Galli, S. Gambetta, M. Gandelman, P. Gandini, B. Ganie,\n  H. Gao, R. Gao, Y. Gao, Y. Gao, Y. Gao, M. Garau, L.M. Garcia Martin, P.\n  Garcia Moreno, J. Garc\\'ia Pardi\\~nas, K. G. Garg, L. Garrido, C. Gaspar,\n  R.E. Geertsema, L.L. Gerken, E. Gersabeck, M. Gersabeck, T. Gershon, Z.\n  Ghorbanimoghaddam, L. Giambastiani, F. I. Giasemis, V. Gibson, H.K. Giemza,\n  A.L. Gilman, M. Giovannetti, A. Giovent\\`u, P. Gironella Gironell, C.\n  Giugliano, M.A. Giza, E.L. Gkougkousis, F.C. Glaser, V.V. Gligorov, C.\n  G\\\"obel, E. Golobardes, D. Golubkov, A. Golutvin, A. Gomes, S. Gomez\n  Fernandez, F. Goncalves Abrantes, M. Goncerz, G. Gong, J. A. Gooding, I.V.\n  Gorelov, C. Gotti, J.P. Grabowski, L.A. Granado Cardoso, E. Graug\\'es, E.\n  Graverini, L. Grazette, G. Graziani, A. T. Grecu, L.M. Greeven, N.A. Grieser,\n  L. Grillo, S. Gromov, C. Gu, M. Guarise, M. Guittiere, V. Guliaeva, P. A.\n  G\\\"unther, A.-K. Guseinov, E. Gushchin, Y. Guz, T. Gys, K. Habermann, T.\n  Hadavizadeh, C. Hadjivasiliou, G. Haefeli, C. Haen, J. Haimberger, M.\n  Hajheidari, M.M. Halvorsen, P.M. Hamilton, J. Hammerich, Q. Han, X. Han, S.\n  Hansmann-Menzemer, L. Hao, N. Harnew, M. Hartmann, J. He, F. Hemmer, C.\n  Henderson, R.D.L. Henderson, A.M. Hennequin, K. Hennessy, L. Henry, J. Herd,\n  P. Herrero Gascon, J. Heuel, A. Hicheur, G. Hijano Mendizabal, D. Hill, S.E.\n  Hollitt, J. Horswill, R. Hou, Y. Hou, N. Howarth, J. Hu, J. Hu, W. Hu, X. Hu,\n  W. Huang, W. Hulsbergen, R.J. Hunter, M. Hushchyn, D. Hutchcroft, D. Ilin, P.\n  Ilten, A. Inglessi, A. Iniukhin, A. Ishteev, K. Ivshin, R. Jacobsson, H.\n  Jage, S.J. Jaimes Elles, S. Jakobsen, E. Jans, B.K. Jashal, A. Jawahery, V.\n  Jevtic, E. Jiang, X. Jiang, Y. Jiang, Y. J. Jiang, M. John, D. Johnson, C.R.\n  Jones, T.P. Jones, S. Joshi, B. Jost, N. Jurik, I. Juszczak, D. Kaminaris, S.\n  Kandybei, Y. Kang, C. Kar, M. Karacson, D. Karpenkov, A. Kauniskangas, J.W.\n  Kautz, F. Keizer, M. Kenzie, T. Ketel, B. Khanji, A. Kharisova, S.\n  Kholodenko, G. Khreich, T. Kirn, V.S. Kirsebom, O. Kitouni, S. Klaver, N.\n  Kleijne, K. Klimaszewski, M.R. Kmiec, S. Koliiev, L. Kolk, A. Konoplyannikov,\n  P. Kopciewicz, P. Koppenburg, M. Korolev, I. Kostiuk, O. Kot, S. Kotriakhova,\n  A. Kozachuk, P. Kravchenko, L. Kravchuk, M. Kreps, P. Krokovny, W. Krupa, W.\n  Krzemien, O.K. Kshyvanskyi, J. Kubat, S. Kubis, M. Kucharczyk, V.\n  Kudryavtsev, E. Kulikova, A. Kupsc, B. K. Kutsenko, D. Lacarrere, A. Lai, A.\n  Lampis, D. Lancierini, C. Landesa Gomez, J.J. Lane, R. Lane, C. Langenbruch,\n  J. Langer, O. Lantwin, T. Latham, F. Lazzari, C. Lazzeroni, R. Le Gac, R.\n  Lef\\`evre, A. Leflat, S. Legotin, M. Lehuraux, E. Lemos Cid, O. Leroy, T.\n  Lesiak, B. Leverington, A. Li, H. Li, K. Li, L. Li, P. Li, P.-R. Li, Q. Li,\n  S. Li, T. Li, T. Li, Y. Li, Y. Li, Z. Lian, X. Liang, S. Libralon, C. Lin, T.\n  Lin, R. Lindner, V. Lisovskyi, R. Litvinov, F. L. Liu, G. Liu, K. Liu, S.\n  Liu, Y. Liu, Y. Liu, Y. L. Liu, A. Lobo Salvia, A. Loi, J. Lomba Castro, T.\n  Long, J.H. Lopes, A. Lopez Huertas, S. L\\'opez Soli\\~no, C. Lucarelli, D.\n  Lucchesi, M. Lucio Martinez, V. Lukashenko, Y. Luo, A. Lupato, E. Luppi, K.\n  Lynch, X.-R. Lyu, G. M. Ma, R. Ma, S. Maccolini, F. Machefert, F. Maciuc, B.\n  Mack, I. Mackay, L. M. Mackey, L.R. Madhan Mohan, M. M. Madurai, A. Maevskiy,\n  D. Magdalinski, D. Maisuzenko, M.W. Majewski, J.J. Malczewski, S. Malde, L.\n  Malentacca, A. Malinin, T. Maltsev, G. Manca, G. Mancinelli, C. Mancuso, R.\n  Manera Escalero, D. Manuzzi, D. Marangotto, J.F. Marchand, R. Marchevski, U.\n  Marconi, S. Mariani, C. Marin Benito, J. Marks, A.M. Marshall, G. Martelli,\n  G. Martellotti, L. Martinazzoli, M. Martinelli, D. Martinez Santos, F.\n  Martinez Vidal, A. Massafferri, R. Matev, A. Mathad, V. Matiunin, C.\n  Matteuzzi, K.R. Mattioli, A. Mauri, E. Maurice, J. Mauricio, P. Mayencourt,\n  M. Mazurek, M. McCann, L. Mcconnell, T.H. McGrath, N.T. McHugh, A. McNab, R.\n  McNulty, B. Meadows, G. Meier, D. Melnychuk, F. M. Meng, M. Merk, A. Merli,\n  L. Meyer Garcia, D. Miao, H. Miao, M. Mikhasenko, D.A. Milanes, A. Minotti,\n  E. Minucci, T. Miralles, B. Mitreska, D.S. Mitzel, A. Modak, A. M\\\"odden,\n  R.A. Mohammed, R.D. Moise, S. Mokhnenko, T. Momb\\\"acher, M. Monk, S. Monteil,\n  A. Morcillo Gomez, G. Morello, M.J. Morello, M.P. Morgenthaler, A.B. Morris,\n  A.G. Morris, R. Mountain, H. Mu, Z. M. Mu, E. Muhammad, F. Muheim, M. Mulder,\n  K. M\\\"uller, F. Mu\\~noz-Rojas, R. Murta, P. Naik, T. Nakada, R. Nandakumar,\n  T. Nanut, I. Nasteva, M. Needham, N. Neri, S. Neubert, N. Neufeld, P.\n  Neustroev, J. Nicolini, D. Nicotra, E.M. Niel, N. Nikitin, P. Nogarolli, P.\n  Nogga, N.S. Nolte, C. Normand, J. Novoa Fernandez, G. Nowak, C. Nunez, H. N.\n  Nur, A. Oblakowska-Mucha, V. Obraztsov, T. Oeser, S. Okamura, A. Okhotnikov,\n  O. Okhrimenko, R. Oldeman, F. Oliva, M. Olocco, C.J.G. Onderwater, R.H.\n  O'Neil, J.M. Otalora Goicochea, P. Owen, A. Oyanguren, O. Ozcelik, K.O.\n  Padeken, B. Pagare, P.R. Pais, T. Pajero, A. Palano, M. Palutan, G. Panshin,\n  L. Paolucci, A. Papanestis, M. Pappagallo, L.L. Pappalardo, C. Pappenheimer,\n  C. Parkes, B. Passalacqua, G. Passaleva, D. Passaro, A. Pastore, M. Patel, J.\n  Patoc, C. Patrignani, A. Paul, C.J. Pawley, A. Pellegrino, J. Peng, M. Pepe\n  Altarelli, S. Perazzini, D. Pereima, H. Pereira Da Costa, A. Pereiro Castro,\n  P. Perret, A. Perro, K. Petridis, A. Petrolini, J. P. Pfaller, H. Pham, L.\n  Pica, M. Piccini, B. Pietrzyk, G. Pietrzyk, D. Pinci, F. Pisani, M.\n  Pizzichemi, V. Placinta, M. Plo Casasus, F. Polci, M. Poli Lener, A.\n  Poluektov, N. Polukhina, I. Polyakov, E. Polycarpo, S. Ponce, D. Popov, S.\n  Poslavskii, K. Prasanth, C. Prouve, V. Pugatch, G. Punzi, S. Qasim, Q. Q.\n  Qian, W. Qian, N. Qin, S. Qu, R. Quagliani, R.I. Rabadan Trejo, J.H.\n  Rademacker, M. Rama, M. Ram\\'irez Garc\\'ia, V. Ramos De Oliveira, M. Ramos\n  Pernas, M.S. Rangel, F. Ratnikov, G. Raven, M. Rebollo De Miguel, F. Redi, J.\n  Reich, F. Reiss, Z. Ren, P.K. Resmi, R. Ribatti, G. R. Ricart, D. Riccardi,\n  S. Ricciardi, K. Richardson, M. Richardson-Slipper, K. Rinnert, P. Robbe, G.\n  Robertson, E. Rodrigues, E. Rodriguez Fernandez, J.A. Rodriguez Lopez, E.\n  Rodriguez Rodriguez, A. Rogovskiy, D.L. Rolf, P. Roloff, V. Romanovskiy, M.\n  Romero Lamas, A. Romero Vidal, G. Romolini, F. Ronchetti, T. Rong, M.\n  Rotondo, S. R. Roy, M.S. Rudolph, M. Ruiz Diaz, R.A. Ruiz Fernandez, J. Ruiz\n  Vidal, A. Ryzhikov, J. Ryzka, J. J. Saavedra-Arias, J.J. Saborido Silva, R.\n  Sadek, N. Sagidova, D. Sahoo, N. Sahoo, B. Saitta, M. Salomoni, C. Sanchez\n  Gras, I. Sanderswood, R. Santacesaria, C. Santamarina Rios, M. Santimaria, L.\n  Santoro, E. Santovetti, A. Saputi, D. Saranin, A. S. Sarnatskiy, G. Sarpis,\n  M. Sarpis, C. Satriano, A. Satta, M. Saur, D. Savrina, H. Sazak, L.G.\n  Scantlebury Smead, A. Scarabotto, S. Schael, S. Scherl, M. Schiller, H.\n  Schindler, M. Schmelling, B. Schmidt, S. Schmitt, H. Schmitz, O. Schneider,\n  A. Schopper, N. Schulte, S. Schulte, M.H. Schune, R. Schwemmer, G. Schwering,\n  B. Sciascia, A. Sciuccati, S. Sellam, A. Semennikov, T. Senger, M. Senghi\n  Soares, A. Sergi, N. Serra, L. Sestini, A. Seuthe, Y. Shang, D.M. Shangase,\n  M. Shapkin, R. S. Sharma, I. Shchemerov, L. Shchutska, T. Shears, L.\n  Shekhtman, Z. Shen, S. Sheng, V. Shevchenko, B. Shi, Q. Shi, Y. Shimizu, E.\n  Shmanin, R. Shorkin, J.D. Shupperd, R. Silva Coutinho, G. Simi, S. Simone, N.\n  Skidmore, T. Skwarnicki, M.W. Slater, J.C. Smallwood, E. Smith, K. Smith, M.\n  Smith, A. Snoch, L. Soares Lavra, M.D. Sokoloff, F.J.P. Soler, A. Solomin, A.\n  Solovev, I. Solovyev, R. Song, Y. Song, Y. Song, Y. S. Song, F.L. Souza De\n  Almeida, B. Souza De Paula, E. Spadaro Norella, E. Spedicato, J.G. Speer, E.\n  Spiridenkov, P. Spradlin, V. Sriskaran, F. Stagni, M. Stahl, S. Stahl, S.\n  Stanislaus, E.N. Stein, O. Steinkamp, O. Stenyakin, H. Stevens, D.\n  Strekalina, Y. Su, F. Suljik, J. Sun, L. Sun, Y. Sun, D. Sundfeld, W.\n  Sutcliffe, P.N. Swallow, F. Swystun, A. Szabelski, T. Szumlak, Y. Tan, M.D.\n  Tat, A. Terentev, F. Terzuoli, F. Teubert, E. Thomas, D.J.D. Thompson, H.\n  Tilquin, V. Tisserand, S. T'Jampens, M. Tobin, L. Tomassetti, G. Tonani, X.\n  Tong, D. Torres Machado, L. Toscano, D.Y. Tou, C. Trippl, G. Tuci, N. Tuning,\n  L.H. Uecker, A. Ukleja, D.J. Unverzagt, E. Ursov, A. Usachov, A. Ustyuzhanin,\n  U. Uwer, V. Vagnoni, G. Valenti, N. Valls Canudas, H. Van Hecke, E. van\n  Herwijnen, C.B. Van Hulse, R. Van Laak, M. van Veghel, G. Vasquez, R. Vazquez\n  Gomez, P. Vazquez Regueiro, C. V\\'azquez Sierra, S. Vecchi, J.J. Velthuis, M.\n  Veltri, A. Venkateswaran, M. Vesterinen, M. Vieites Diaz, X. Vilasis-Cardona,\n  E. Vilella Figueras, A. Villa, P. Vincent, F.C. Volle, D. vom Bruch, N.\n  Voropaev, K. Vos, G. Vouters, C. Vrahas, J. Wagner, J. Walsh, E.J. Walton, G.\n  Wan, C. Wang, G. Wang, J. Wang, J. Wang, J. Wang, J. Wang, M. Wang, N. W.\n  Wang, R. Wang, X. Wang, X. Wang, X. W. Wang, Y. Wang, Z. Wang, Z. Wang, Z.\n  Wang, J.A. Ward, M. Waterlaat, N.K. Watson, D. Websdale, Y. Wei, J. Wendel,\n  B.D.C. Westhenry, D.J. White, M. Whitehead, A.R. Wiederhold, D. Wiedner, G.\n  Wilkinson, M.K. Wilkinson, M. Williams, M.R.J. Williams, R. Williams, F.F.\n  Wilson, W. Wislicki, M. Witek, L. Witola, C.P. Wong, G. Wormser, S.A. Wotton,\n  H. Wu, J. Wu, Y. Wu, Z. Wu, K. Wyllie, S. Xian, Z. Xiang, Y. Xie, A. Xu, J.\n  Xu, L. Xu, L. Xu, M. Xu, Z. Xu, Z. Xu, Z. Xu, D. Yang, K. Yang, S. Yang, X.\n  Yang, Y. Yang, Z. Yang, Z. Yang, V. Yeroshenko, H. Yeung, H. Yin, C. Y. Yu,\n  J. Yu, X. Yuan, E. Zaffaroni, M. Zavertyaev, M. Zdybal, C. Zeng, M. Zeng, C.\n  Zhang, D. Zhang, J. Zhang, L. Zhang, S. Zhang, S. Zhang, Y. Zhang, Y. Z.\n  Zhang, Y. Zhao, A. Zharkova, A. Zhelezov, S. Z. Zheng, X. Z. Zheng, Y. Zheng,\n  T. Zhou, X. Zhou, Y. Zhou, V. Zhovkovska, L. Z. Zhu, X. Zhu, X. Zhu, V.\n  Zhukov, J. Zhuo, Q. Zou, D. Zuliani, G. Zunica","authorsParsed":[["LHCb collaboration","",""],["Aaij","R.",""],["Abdelmotteleb","A. S. W.",""],["Beteta","C. Abellan",""],["Abudinén","F.",""],["Ackernley","T.",""],["Adefisoye","A. A.",""],["Adeva","B.",""],["Adinolfi","M.",""],["Adlarson","P.",""],["Agapopoulou","C.",""],["Aidala","C. A.",""],["Ajaltouni","Z.",""],["Akar","S.",""],["Akiba","K.",""],["Albicocco","P.",""],["Albrecht","J.",""],["Alessio","F.",""],["Alexander","M.",""],["Aliouche","Z.",""],["Cartelle","P. Alvarez",""],["Amalric","R.",""],["Amato","S.",""],["Amey","J. L.",""],["Amhis","Y.",""],["An","L.",""],["Anderlini","L.",""],["Andersson","M.",""],["Andreianov","A.",""],["Andreola","P.",""],["Andreotti","M.",""],["Andreou","D.",""],["Anelli","A.",""],["Ao","D.",""],["Archilli","F.",""],["Argenton","M.",""],["Cuendis","S. Arguedas",""],["Artamonov","A.",""],["Artuso","M.",""],["Aslanides","E.",""],["Da Silva","R. Ataide",""],["Atzeni","M.",""],["Audurier","B.",""],["Bacher","D.",""],["Perea","I. Bachiller",""],["Bachmann","S.",""],["Bachmayer","M.",""],["Back","J. J.",""],["Rodriguez","P. Baladron",""],["Balagura","V.",""],["Baldini","W.",""],["Bao","H.",""],["Leite","J. Baptista de Souza",""],["Barbetti","M.",""],["Barbosa","I. R.",""],["Barlow","R. J.",""],["Barnyakov","M.",""],["Barsuk","S.",""],["Barter","W.",""],["Bartolini","M.",""],["Bartz","J.",""],["Basels","J. M.",""],["Bassi","G.",""],["Batsukh","B.",""],["Bay","A.",""],["Beck","A.",""],["Becker","M.",""],["Bedeschi","F.",""],["Bediaga","I. B.",""],["Belin","S.",""],["Bellee","V.",""],["Belous","K.",""],["Belov","I.",""],["Belyaev","I.",""],["Benane","G.",""],["Bencivenni","G.",""],["Ben-Haim","E.",""],["Berezhnoy","A.",""],["Bernet","R.",""],["Andres","S. Bernet",""],["Bertolin","A.",""],["Betancourt","C.",""],["Betti","F.",""],["Bex","J.",""],["Bezshyiko","Ia.",""],["Bhom","J.",""],["Bieker","M. S.",""],["Biesuz","N. V.",""],["Billoir","P.",""],["Biolchini","A.",""],["Birch","M.",""],["Bishop","F. C. R.",""],["Bitadze","A.",""],["Bizzeti","A.",""],["Blake","T.",""],["Blanc","F.",""],["Blank","J. E.",""],["Blusk","S.",""],["Bocharnikov","V.",""],["Boelhauve","J. A.",""],["Garcia","O. Boente",""],["Boettcher","T.",""],["Bohare","A.",""],["Boldyrev","A.",""],["Bolognani","C. S.",""],["Bolzonella","R.",""],["Bondar","N.",""],["Borgato","F.",""],["Borghi","S.",""],["Borsato","M.",""],["Borsuk","J. T.",""],["Bouchiba","S. A.",""],["Bowcock","T. J. V.",""],["Boyer","A.",""],["Bozzi","C.",""],["Rodriguez","A. Brea",""],["Breer","N.",""],["Brodzicka","J.",""],["Gonzalo","A. Brossa",""],["Brown","J.",""],["Brundu","D.",""],["Buchanan","E.",""],["Buonaura","A.",""],["Buonincontri","L.",""],["Burke","A. T.",""],["Burr","C.",""],["Butkevich","A.",""],["Butter","J. S.",""],["Buytaert","J.",""],["Byczynski","W.",""],["Cadeddu","S.",""],["Cai","H.",""],["Calabrese","R.",""],["Ramirez","S. Calderon",""],["Calefice","L.",""],["Cali","S.",""],["Calvi","M.",""],["Gomez","M. Calvo",""],["Magalhaes","P. Camargo",""],["Bouzas","J. I. Cambon",""],["Campana","P.",""],["Perez","D. H. Campora",""],["Quezada","A. F. Campoverde",""],["Capelli","S.",""],["Capriotti","L.",""],["Caravaca-Mora","R.",""],["Carbone","A.",""],["Salgado","L. Carcedo",""],["Cardinale","R.",""],["Cardini","A.",""],["Carniti","P.",""],["Carus","L.",""],["Vidal","A. Casais",""],["Caspary","R.",""],["Casse","G.",""],["Godinez","J. Castro",""],["Cattaneo","M.",""],["Cavallero","G.",""],["Cavallini","V.",""],["Celani","S.",""],["Cervenkov","D.",""],["Cesare","S.",""],["Chadwick","A. J.",""],["Chahrour","I.",""],["Charles","M.",""],["Charpentier","Ph.",""],["Chatzianagnostou","E.",""],["Barajas","C. A. Chavez",""],["Chefdeville","M.",""],["Chen","C.",""],["Chen","S.",""],["Chen","Z.",""],["Chernov","A.",""],["Chernyshenko","S.",""],["Chobanova","V.",""],["Cholak","S.",""],["Chrzaszcz","M.",""],["Chubykin","A.",""],["Chulikov","V.",""],["Ciambrone","P.",""],["Vidal","X. Cid",""],["Ciezarek","G.",""],["Cifra","P.",""],["Clarke","P. E. L.",""],["Clemencic","M.",""],["Cliff","H. V.",""],["Closier","J.",""],["Toapaxi","C. Cocha",""],["Coco","V.",""],["Cogan","J.",""],["Cogneras","E.",""],["Cojocariu","L.",""],["Collins","P.",""],["Colombo","T.",""],["Comerma-Montells","A.",""],["Congedo","L.",""],["Contu","A.",""],["Cooke","N.",""],["Corredoira","I.",""],["Correia","A.",""],["Corti","G.",""],["Meldrum","J. J. Cottee",""],["Couturier","B.",""],["Craik","D. C.",""],["Torres","M. Cruz",""],["Rivera","E. Curras",""],["Currie","R.",""],["Da Silva","C. L.",""],["Dadabaev","S.",""],["Dai","L.",""],["Dai","X.",""],["Dall'Occo","E.",""],["Dalseno","J.",""],["D'Ambrosio","C.",""],["Daniel","J.",""],["Danilina","A.",""],["d'Argent","P.",""],["Davidson","A.",""],["Davies","J. E.",""],["Davis","A.",""],["Francisco","O. De Aguiar",""],["De Angelis","C.",""],["De Benedetti","F.",""],["de Boer","J.",""],["De Bruyn","K.",""],["De Capua","S.",""],["De Cian","M.",""],["Da Graca","U. De Freitas Carneiro",""],["De Lucia","E.",""],["De Miranda","J. M.",""],["De Paula","L.",""],["De Serio","M.",""],["De Simone","P.",""],["De Vellis","F.",""],["de Vries","J. A.",""],["Debernardis","F.",""],["Decamp","D.",""],["Dedu","V.",""],["Del Buono","L.",""],["Delaney","B.",""],["Dembinski","H. -P.",""],["Deng","J.",""],["Denysenko","V.",""],["Deschamps","O.",""],["Dettori","F.",""],["Dey","B.",""],["Di Nezza","P.",""],["Diachkov","I.",""],["Didenko","S.",""],["Ding","S.",""],["Dittmann","L.",""],["Dobishuk","V.",""],["Docheva","A. D.",""],["Dong","C.",""],["Donohoe","A. M.",""],["Dordei","F.",""],["Reis","A. C. dos",""],["Dowling","A. D.",""],["Duan","W.",""],["Duda","P.",""],["Dudek","M. W.",""],["Dufour","L.",""],["Duk","V.",""],["Durante","P.",""],["Duras","M. M.",""],["Durham","J. M.",""],["Durmus","O. D.",""],["Dziurda","A.",""],["Dzyuba","A.",""],["Easo","S.",""],["Eckstein","E.",""],["Egede","U.",""],["Egorychev","A.",""],["Egorychev","V.",""],["Eisenhardt","S.",""],["Ejopu","E.",""],["Eklund","L.",""],["Elashri","M.",""],["Ellbracht","J.",""],["Ely","S.",""],["Ene","A.",""],["Epple","E.",""],["Eschle","J.",""],["Esen","S.",""],["Evans","T.",""],["Fabiano","F.",""],["Falcao","L. N.",""],["Fan","Y.",""],["Fang","B.",""],["Fantini","L.",""],["Faria","M.",""],["Farmer","K.",""],["Fazzini","D.",""],["Felkowski","L.",""],["Feng","M.",""],["Feo","M.",""],["Gomez","M. Fernandez",""],["Fernez","A. D.",""],["Ferrari","F.",""],["Rodrigues","F. Ferreira",""],["Ferrillo","M.",""],["Ferro-Luzzi","M.",""],["Filippov","S.",""],["Fini","R. A.",""],["Fiorini","M.",""],["Fischer","K. M.",""],["Fitzgerald","D. S.",""],["Fitzpatrick","C.",""],["Fleuret","F.",""],["Fontana","M.",""],["Foreman","L. F.",""],["Forty","R.",""],["Foulds-Holt","D.",""],["Sevilla","M. Franco",""],["Frank","M.",""],["Franzoso","E.",""],["Frau","G.",""],["Frei","C.",""],["Friday","D. A.",""],["Fu","J.",""],["Fuehring","Q.",""],["Fujii","Y.",""],["Fulghesu","T.",""],["Gabriel","E.",""],["Galati","G.",""],["Galati","M. D.",""],["Torreira","A. Gallas",""],["Galli","D.",""],["Gambetta","S.",""],["Gandelman","M.",""],["Gandini","P.",""],["Ganie","B.",""],["Gao","H.",""],["Gao","R.",""],["Gao","Y.",""],["Gao","Y.",""],["Gao","Y.",""],["Garau","M.",""],["Martin","L. M. Garcia",""],["Moreno","P. Garcia",""],["Pardiñas","J. García",""],["Garg","K. G.",""],["Garrido","L.",""],["Gaspar","C.",""],["Geertsema","R. E.",""],["Gerken","L. L.",""],["Gersabeck","E.",""],["Gersabeck","M.",""],["Gershon","T.",""],["Ghorbanimoghaddam","Z.",""],["Giambastiani","L.",""],["Giasemis","F. I.",""],["Gibson","V.",""],["Giemza","H. K.",""],["Gilman","A. L.",""],["Giovannetti","M.",""],["Gioventù","A.",""],["Gironell","P. Gironella",""],["Giugliano","C.",""],["Giza","M. A.",""],["Gkougkousis","E. L.",""],["Glaser","F. C.",""],["Gligorov","V. V.",""],["Göbel","C.",""],["Golobardes","E.",""],["Golubkov","D.",""],["Golutvin","A.",""],["Gomes","A.",""],["Fernandez","S. Gomez",""],["Abrantes","F. Goncalves",""],["Goncerz","M.",""],["Gong","G.",""],["Gooding","J. A.",""],["Gorelov","I. V.",""],["Gotti","C.",""],["Grabowski","J. P.",""],["Cardoso","L. A. Granado",""],["Graugés","E.",""],["Graverini","E.",""],["Grazette","L.",""],["Graziani","G.",""],["Grecu","A. T.",""],["Greeven","L. M.",""],["Grieser","N. A.",""],["Grillo","L.",""],["Gromov","S.",""],["Gu","C.",""],["Guarise","M.",""],["Guittiere","M.",""],["Guliaeva","V.",""],["Günther","P. A.",""],["Guseinov","A. -K.",""],["Gushchin","E.",""],["Guz","Y.",""],["Gys","T.",""],["Habermann","K.",""],["Hadavizadeh","T.",""],["Hadjivasiliou","C.",""],["Haefeli","G.",""],["Haen","C.",""],["Haimberger","J.",""],["Hajheidari","M.",""],["Halvorsen","M. M.",""],["Hamilton","P. M.",""],["Hammerich","J.",""],["Han","Q.",""],["Han","X.",""],["Hansmann-Menzemer","S.",""],["Hao","L.",""],["Harnew","N.",""],["Hartmann","M.",""],["He","J.",""],["Hemmer","F.",""],["Henderson","C.",""],["Henderson","R. D. L.",""],["Hennequin","A. M.",""],["Hennessy","K.",""],["Henry","L.",""],["Herd","J.",""],["Gascon","P. Herrero",""],["Heuel","J.",""],["Hicheur","A.",""],["Mendizabal","G. Hijano",""],["Hill","D.",""],["Hollitt","S. E.",""],["Horswill","J.",""],["Hou","R.",""],["Hou","Y.",""],["Howarth","N.",""],["Hu","J.",""],["Hu","J.",""],["Hu","W.",""],["Hu","X.",""],["Huang","W.",""],["Hulsbergen","W.",""],["Hunter","R. J.",""],["Hushchyn","M.",""],["Hutchcroft","D.",""],["Ilin","D.",""],["Ilten","P.",""],["Inglessi","A.",""],["Iniukhin","A.",""],["Ishteev","A.",""],["Ivshin","K.",""],["Jacobsson","R.",""],["Jage","H.",""],["Elles","S. J. Jaimes",""],["Jakobsen","S.",""],["Jans","E.",""],["Jashal","B. K.",""],["Jawahery","A.",""],["Jevtic","V.",""],["Jiang","E.",""],["Jiang","X.",""],["Jiang","Y.",""],["Jiang","Y. J.",""],["John","M.",""],["Johnson","D.",""],["Jones","C. R.",""],["Jones","T. P.",""],["Joshi","S.",""],["Jost","B.",""],["Jurik","N.",""],["Juszczak","I.",""],["Kaminaris","D.",""],["Kandybei","S.",""],["Kang","Y.",""],["Kar","C.",""],["Karacson","M.",""],["Karpenkov","D.",""],["Kauniskangas","A.",""],["Kautz","J. W.",""],["Keizer","F.",""],["Kenzie","M.",""],["Ketel","T.",""],["Khanji","B.",""],["Kharisova","A.",""],["Kholodenko","S.",""],["Khreich","G.",""],["Kirn","T.",""],["Kirsebom","V. S.",""],["Kitouni","O.",""],["Klaver","S.",""],["Kleijne","N.",""],["Klimaszewski","K.",""],["Kmiec","M. R.",""],["Koliiev","S.",""],["Kolk","L.",""],["Konoplyannikov","A.",""],["Kopciewicz","P.",""],["Koppenburg","P.",""],["Korolev","M.",""],["Kostiuk","I.",""],["Kot","O.",""],["Kotriakhova","S.",""],["Kozachuk","A.",""],["Kravchenko","P.",""],["Kravchuk","L.",""],["Kreps","M.",""],["Krokovny","P.",""],["Krupa","W.",""],["Krzemien","W.",""],["Kshyvanskyi","O. K.",""],["Kubat","J.",""],["Kubis","S.",""],["Kucharczyk","M.",""],["Kudryavtsev","V.",""],["Kulikova","E.",""],["Kupsc","A.",""],["Kutsenko","B. K.",""],["Lacarrere","D.",""],["Lai","A.",""],["Lampis","A.",""],["Lancierini","D.",""],["Gomez","C. Landesa",""],["Lane","J. J.",""],["Lane","R.",""],["Langenbruch","C.",""],["Langer","J.",""],["Lantwin","O.",""],["Latham","T.",""],["Lazzari","F.",""],["Lazzeroni","C.",""],["Gac","R. Le",""],["Lefèvre","R.",""],["Leflat","A.",""],["Legotin","S.",""],["Lehuraux","M.",""],["Cid","E. Lemos",""],["Leroy","O.",""],["Lesiak","T.",""],["Leverington","B.",""],["Li","A.",""],["Li","H.",""],["Li","K.",""],["Li","L.",""],["Li","P.",""],["Li","P. -R.",""],["Li","Q.",""],["Li","S.",""],["Li","T.",""],["Li","T.",""],["Li","Y.",""],["Li","Y.",""],["Lian","Z.",""],["Liang","X.",""],["Libralon","S.",""],["Lin","C.",""],["Lin","T.",""],["Lindner","R.",""],["Lisovskyi","V.",""],["Litvinov","R.",""],["Liu","F. L.",""],["Liu","G.",""],["Liu","K.",""],["Liu","S.",""],["Liu","Y.",""],["Liu","Y.",""],["Liu","Y. L.",""],["Salvia","A. Lobo",""],["Loi","A.",""],["Castro","J. Lomba",""],["Long","T.",""],["Lopes","J. H.",""],["Huertas","A. Lopez",""],["Soliño","S. López",""],["Lucarelli","C.",""],["Lucchesi","D.",""],["Martinez","M. Lucio",""],["Lukashenko","V.",""],["Luo","Y.",""],["Lupato","A.",""],["Luppi","E.",""],["Lynch","K.",""],["Lyu","X. -R.",""],["Ma","G. M.",""],["Ma","R.",""],["Maccolini","S.",""],["Machefert","F.",""],["Maciuc","F.",""],["Mack","B.",""],["Mackay","I.",""],["Mackey","L. M.",""],["Mohan","L. R. Madhan",""],["Madurai","M. M.",""],["Maevskiy","A.",""],["Magdalinski","D.",""],["Maisuzenko","D.",""],["Majewski","M. W.",""],["Malczewski","J. J.",""],["Malde","S.",""],["Malentacca","L.",""],["Malinin","A.",""],["Maltsev","T.",""],["Manca","G.",""],["Mancinelli","G.",""],["Mancuso","C.",""],["Escalero","R. Manera",""],["Manuzzi","D.",""],["Marangotto","D.",""],["Marchand","J. F.",""],["Marchevski","R.",""],["Marconi","U.",""],["Mariani","S.",""],["Benito","C. Marin",""],["Marks","J.",""],["Marshall","A. M.",""],["Martelli","G.",""],["Martellotti","G.",""],["Martinazzoli","L.",""],["Martinelli","M.",""],["Santos","D. Martinez",""],["Vidal","F. Martinez",""],["Massafferri","A.",""],["Matev","R.",""],["Mathad","A.",""],["Matiunin","V.",""],["Matteuzzi","C.",""],["Mattioli","K. R.",""],["Mauri","A.",""],["Maurice","E.",""],["Mauricio","J.",""],["Mayencourt","P.",""],["Mazurek","M.",""],["McCann","M.",""],["Mcconnell","L.",""],["McGrath","T. H.",""],["McHugh","N. T.",""],["McNab","A.",""],["McNulty","R.",""],["Meadows","B.",""],["Meier","G.",""],["Melnychuk","D.",""],["Meng","F. M.",""],["Merk","M.",""],["Merli","A.",""],["Garcia","L. Meyer",""],["Miao","D.",""],["Miao","H.",""],["Mikhasenko","M.",""],["Milanes","D. A.",""],["Minotti","A.",""],["Minucci","E.",""],["Miralles","T.",""],["Mitreska","B.",""],["Mitzel","D. S.",""],["Modak","A.",""],["Mödden","A.",""],["Mohammed","R. A.",""],["Moise","R. D.",""],["Mokhnenko","S.",""],["Mombächer","T.",""],["Monk","M.",""],["Monteil","S.",""],["Gomez","A. Morcillo",""],["Morello","G.",""],["Morello","M. J.",""],["Morgenthaler","M. P.",""],["Morris","A. B.",""],["Morris","A. G.",""],["Mountain","R.",""],["Mu","H.",""],["Mu","Z. M.",""],["Muhammad","E.",""],["Muheim","F.",""],["Mulder","M.",""],["Müller","K.",""],["Muñoz-Rojas","F.",""],["Murta","R.",""],["Naik","P.",""],["Nakada","T.",""],["Nandakumar","R.",""],["Nanut","T.",""],["Nasteva","I.",""],["Needham","M.",""],["Neri","N.",""],["Neubert","S.",""],["Neufeld","N.",""],["Neustroev","P.",""],["Nicolini","J.",""],["Nicotra","D.",""],["Niel","E. M.",""],["Nikitin","N.",""],["Nogarolli","P.",""],["Nogga","P.",""],["Nolte","N. S.",""],["Normand","C.",""],["Fernandez","J. Novoa",""],["Nowak","G.",""],["Nunez","C.",""],["Nur","H. N.",""],["Oblakowska-Mucha","A.",""],["Obraztsov","V.",""],["Oeser","T.",""],["Okamura","S.",""],["Okhotnikov","A.",""],["Okhrimenko","O.",""],["Oldeman","R.",""],["Oliva","F.",""],["Olocco","M.",""],["Onderwater","C. J. G.",""],["O'Neil","R. H.",""],["Goicochea","J. M. Otalora",""],["Owen","P.",""],["Oyanguren","A.",""],["Ozcelik","O.",""],["Padeken","K. O.",""],["Pagare","B.",""],["Pais","P. R.",""],["Pajero","T.",""],["Palano","A.",""],["Palutan","M.",""],["Panshin","G.",""],["Paolucci","L.",""],["Papanestis","A.",""],["Pappagallo","M.",""],["Pappalardo","L. L.",""],["Pappenheimer","C.",""],["Parkes","C.",""],["Passalacqua","B.",""],["Passaleva","G.",""],["Passaro","D.",""],["Pastore","A.",""],["Patel","M.",""],["Patoc","J.",""],["Patrignani","C.",""],["Paul","A.",""],["Pawley","C. J.",""],["Pellegrino","A.",""],["Peng","J.",""],["Altarelli","M. Pepe",""],["Perazzini","S.",""],["Pereima","D.",""],["Da Costa","H. Pereira",""],["Castro","A. Pereiro",""],["Perret","P.",""],["Perro","A.",""],["Petridis","K.",""],["Petrolini","A.",""],["Pfaller","J. P.",""],["Pham","H.",""],["Pica","L.",""],["Piccini","M.",""],["Pietrzyk","B.",""],["Pietrzyk","G.",""],["Pinci","D.",""],["Pisani","F.",""],["Pizzichemi","M.",""],["Placinta","V.",""],["Casasus","M. Plo",""],["Polci","F.",""],["Lener","M. Poli",""],["Poluektov","A.",""],["Polukhina","N.",""],["Polyakov","I.",""],["Polycarpo","E.",""],["Ponce","S.",""],["Popov","D.",""],["Poslavskii","S.",""],["Prasanth","K.",""],["Prouve","C.",""],["Pugatch","V.",""],["Punzi","G.",""],["Qasim","S.",""],["Qian","Q. Q.",""],["Qian","W.",""],["Qin","N.",""],["Qu","S.",""],["Quagliani","R.",""],["Trejo","R. I. Rabadan",""],["Rademacker","J. H.",""],["Rama","M.",""],["García","M. Ramírez",""],["De Oliveira","V. Ramos",""],["Pernas","M. Ramos",""],["Rangel","M. S.",""],["Ratnikov","F.",""],["Raven","G.",""],["De Miguel","M. Rebollo",""],["Redi","F.",""],["Reich","J.",""],["Reiss","F.",""],["Ren","Z.",""],["Resmi","P. K.",""],["Ribatti","R.",""],["Ricart","G. R.",""],["Riccardi","D.",""],["Ricciardi","S.",""],["Richardson","K.",""],["Richardson-Slipper","M.",""],["Rinnert","K.",""],["Robbe","P.",""],["Robertson","G.",""],["Rodrigues","E.",""],["Fernandez","E. Rodriguez",""],["Lopez","J. A. Rodriguez",""],["Rodriguez","E. Rodriguez",""],["Rogovskiy","A.",""],["Rolf","D. L.",""],["Roloff","P.",""],["Romanovskiy","V.",""],["Lamas","M. Romero",""],["Vidal","A. Romero",""],["Romolini","G.",""],["Ronchetti","F.",""],["Rong","T.",""],["Rotondo","M.",""],["Roy","S. R.",""],["Rudolph","M. S.",""],["Diaz","M. Ruiz",""],["Fernandez","R. A. Ruiz",""],["Vidal","J. Ruiz",""],["Ryzhikov","A.",""],["Ryzka","J.",""],["Saavedra-Arias","J. J.",""],["Silva","J. J. Saborido",""],["Sadek","R.",""],["Sagidova","N.",""],["Sahoo","D.",""],["Sahoo","N.",""],["Saitta","B.",""],["Salomoni","M.",""],["Gras","C. Sanchez",""],["Sanderswood","I.",""],["Santacesaria","R.",""],["Rios","C. Santamarina",""],["Santimaria","M.",""],["Santoro","L.",""],["Santovetti","E.",""],["Saputi","A.",""],["Saranin","D.",""],["Sarnatskiy","A. S.",""],["Sarpis","G.",""],["Sarpis","M.",""],["Satriano","C.",""],["Satta","A.",""],["Saur","M.",""],["Savrina","D.",""],["Sazak","H.",""],["Smead","L. G. Scantlebury",""],["Scarabotto","A.",""],["Schael","S.",""],["Scherl","S.",""],["Schiller","M.",""],["Schindler","H.",""],["Schmelling","M.",""],["Schmidt","B.",""],["Schmitt","S.",""],["Schmitz","H.",""],["Schneider","O.",""],["Schopper","A.",""],["Schulte","N.",""],["Schulte","S.",""],["Schune","M. H.",""],["Schwemmer","R.",""],["Schwering","G.",""],["Sciascia","B.",""],["Sciuccati","A.",""],["Sellam","S.",""],["Semennikov","A.",""],["Senger","T.",""],["Soares","M. Senghi",""],["Sergi","A.",""],["Serra","N.",""],["Sestini","L.",""],["Seuthe","A.",""],["Shang","Y.",""],["Shangase","D. M.",""],["Shapkin","M.",""],["Sharma","R. S.",""],["Shchemerov","I.",""],["Shchutska","L.",""],["Shears","T.",""],["Shekhtman","L.",""],["Shen","Z.",""],["Sheng","S.",""],["Shevchenko","V.",""],["Shi","B.",""],["Shi","Q.",""],["Shimizu","Y.",""],["Shmanin","E.",""],["Shorkin","R.",""],["Shupperd","J. D.",""],["Coutinho","R. Silva",""],["Simi","G.",""],["Simone","S.",""],["Skidmore","N.",""],["Skwarnicki","T.",""],["Slater","M. W.",""],["Smallwood","J. C.",""],["Smith","E.",""],["Smith","K.",""],["Smith","M.",""],["Snoch","A.",""],["Lavra","L. Soares",""],["Sokoloff","M. D.",""],["Soler","F. J. P.",""],["Solomin","A.",""],["Solovev","A.",""],["Solovyev","I.",""],["Song","R.",""],["Song","Y.",""],["Song","Y.",""],["Song","Y. S.",""],["De Almeida","F. L. Souza",""],["De Paula","B. Souza",""],["Norella","E. Spadaro",""],["Spedicato","E.",""],["Speer","J. G.",""],["Spiridenkov","E.",""],["Spradlin","P.",""],["Sriskaran","V.",""],["Stagni","F.",""],["Stahl","M.",""],["Stahl","S.",""],["Stanislaus","S.",""],["Stein","E. N.",""],["Steinkamp","O.",""],["Stenyakin","O.",""],["Stevens","H.",""],["Strekalina","D.",""],["Su","Y.",""],["Suljik","F.",""],["Sun","J.",""],["Sun","L.",""],["Sun","Y.",""],["Sundfeld","D.",""],["Sutcliffe","W.",""],["Swallow","P. N.",""],["Swystun","F.",""],["Szabelski","A.",""],["Szumlak","T.",""],["Tan","Y.",""],["Tat","M. D.",""],["Terentev","A.",""],["Terzuoli","F.",""],["Teubert","F.",""],["Thomas","E.",""],["Thompson","D. J. D.",""],["Tilquin","H.",""],["Tisserand","V.",""],["T'Jampens","S.",""],["Tobin","M.",""],["Tomassetti","L.",""],["Tonani","G.",""],["Tong","X.",""],["Machado","D. Torres",""],["Toscano","L.",""],["Tou","D. Y.",""],["Trippl","C.",""],["Tuci","G.",""],["Tuning","N.",""],["Uecker","L. H.",""],["Ukleja","A.",""],["Unverzagt","D. J.",""],["Ursov","E.",""],["Usachov","A.",""],["Ustyuzhanin","A.",""],["Uwer","U.",""],["Vagnoni","V.",""],["Valenti","G.",""],["Canudas","N. Valls",""],["Van Hecke","H.",""],["van Herwijnen","E.",""],["Van Hulse","C. B.",""],["Van Laak","R.",""],["van Veghel","M.",""],["Vasquez","G.",""],["Gomez","R. Vazquez",""],["Regueiro","P. Vazquez",""],["Sierra","C. Vázquez",""],["Vecchi","S.",""],["Velthuis","J. J.",""],["Veltri","M.",""],["Venkateswaran","A.",""],["Vesterinen","M.",""],["Diaz","M. Vieites",""],["Vilasis-Cardona","X.",""],["Figueras","E. Vilella",""],["Villa","A.",""],["Vincent","P.",""],["Volle","F. C.",""],["Bruch","D. vom",""],["Voropaev","N.",""],["Vos","K.",""],["Vouters","G.",""],["Vrahas","C.",""],["Wagner","J.",""],["Walsh","J.",""],["Walton","E. J.",""],["Wan","G.",""],["Wang","C.",""],["Wang","G.",""],["Wang","J.",""],["Wang","J.",""],["Wang","J.",""],["Wang","J.",""],["Wang","M.",""],["Wang","N. W.",""],["Wang","R.",""],["Wang","X.",""],["Wang","X.",""],["Wang","X. W.",""],["Wang","Y.",""],["Wang","Z.",""],["Wang","Z.",""],["Wang","Z.",""],["Ward","J. A.",""],["Waterlaat","M.",""],["Watson","N. K.",""],["Websdale","D.",""],["Wei","Y.",""],["Wendel","J.",""],["Westhenry","B. D. C.",""],["White","D. J.",""],["Whitehead","M.",""],["Wiederhold","A. R.",""],["Wiedner","D.",""],["Wilkinson","G.",""],["Wilkinson","M. K.",""],["Williams","M.",""],["Williams","M. R. J.",""],["Williams","R.",""],["Wilson","F. F.",""],["Wislicki","W.",""],["Witek","M.",""],["Witola","L.",""],["Wong","C. P.",""],["Wormser","G.",""],["Wotton","S. A.",""],["Wu","H.",""],["Wu","J.",""],["Wu","Y.",""],["Wu","Z.",""],["Wyllie","K.",""],["Xian","S.",""],["Xiang","Z.",""],["Xie","Y.",""],["Xu","A.",""],["Xu","J.",""],["Xu","L.",""],["Xu","L.",""],["Xu","M.",""],["Xu","Z.",""],["Xu","Z.",""],["Xu","Z.",""],["Yang","D.",""],["Yang","K.",""],["Yang","S.",""],["Yang","X.",""],["Yang","Y.",""],["Yang","Z.",""],["Yang","Z.",""],["Yeroshenko","V.",""],["Yeung","H.",""],["Yin","H.",""],["Yu","C. Y.",""],["Yu","J.",""],["Yuan","X.",""],["Zaffaroni","E.",""],["Zavertyaev","M.",""],["Zdybal","M.",""],["Zeng","C.",""],["Zeng","M.",""],["Zhang","C.",""],["Zhang","D.",""],["Zhang","J.",""],["Zhang","L.",""],["Zhang","S.",""],["Zhang","S.",""],["Zhang","Y.",""],["Zhang","Y. Z.",""],["Zhao","Y.",""],["Zharkova","A.",""],["Zhelezov","A.",""],["Zheng","S. Z.",""],["Zheng","X. Z.",""],["Zheng","Y.",""],["Zhou","T.",""],["Zhou","X.",""],["Zhou","Y.",""],["Zhovkovska","V.",""],["Zhu","L. Z.",""],["Zhu","X.",""],["Zhu","X.",""],["Zhukov","V.",""],["Zhuo","J.",""],["Zou","Q.",""],["Zuliani","D.",""],["Zunica","G.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 12:52:36 GMT"}],"updateDate":"2024-07-26","timestamp":1721911956000,"abstract":"  A measurement of the time-dependent ratio of the $D^0\\rightarrow K^+\\pi^-$ to\n$\\overline{D}^0\\rightarrow K^+\\pi^-$ decay rates is reported. The analysis uses\na sample of proton-proton collisions corresponding to an integrated luminosity\nof 6 fb$^-1$ recorded by the LHCb experiment from 2015 through 2018 at a\ncenter-of-mass energy of 13 TeV. The $D^0$ meson is required to originate from\na $D^{*+}\\rightarrow D^0\\pi^+$ decay, such that its flavor at production is\ninferred from the charge of the accompanying pion. The measurement is performed\nsimultaneously for the $K^+\\pi^-$ and $K^-\\pi^+$ final states, allowing both\nmixing and $CP$-violation parameters to be determined. The value of the ratio\nof the decay rates at production is determined to be $R_{K\\pi} = (343.1 \\pm\n2.0) \\times 10^{-5}$. The mixing parameters are measured to be $c_{K\\pi} =\n(51.4 \\pm 3.5) \\times 10^{-4}$ and $c_{K\\pi}^{\\prime} = (13 \\pm 4) \\times\n10^{-6}$, where $\\sqrt{R_{K\\pi}}c_{K\\pi}$ is the linear coefficient of the\nexpansion of the ratio as a function of decay time in units of the $D^0$\nlifetime, and $c_{K\\pi}^{\\prime}$ is the quadratic coefficient, both averaged\nbetween the $K^+\\pi^-$ and $K^-\\pi^+$ final states. The precision is improved\nrelative to the previous best measurement by approximately 60%. No evidence for\n$CP$ violation is found.\n","subjects":["Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aEjEPdyEGt5DdbfYP_heTQK2M4fgpyrm5adrMGdiJqQ","pdfSize":"2248049","objectId":"0xce3d20af85cf7abd7d619cd02adbacb4e54c26ca89653966a4bfcf01ee6f7617","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
