{"id":"2407.01867","title":"Ar$\\chi$i-Textile Composites: Role of Weave Architecture on Mode-I\n  Fracture Toughness in Woven Composites","authors":"Hridyesh Tewani, Jackson Cyvas, Kennedy Perez, Pavana Prabhakar","authorsParsed":[["Tewani","Hridyesh",""],["Cyvas","Jackson",""],["Perez","Kennedy",""],["Prabhakar","Pavana",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 00:54:12 GMT"}],"updateDate":"2024-07-03","timestamp":1719881652000,"abstract":"  This paper investigates the impact of weave architectures on the mechanics of\ncrack propagation in fiber-reinforced woven polymer composites under\nquasi-static loading. Woven composites consist of fabrics containing fibers\ninterwoven at 0 degrees (warp) and 90 degrees (weft) bound by a polymer matrix.\nThe mechanical properties can be tuned by weaving fiber bundles with single or\nmultiple materials in various patterns or architectures. Although the effects\nof uniform weave architectures, like plain, twill, satin, etc. on in-plane\nmodulus and fracture toughness have been studied, the influence of patterned\nweaves consisting of a combination of sub-patterns, that is, architected\nweaves, on these behaviors is not understood. We focus on identifying the\nmechanisms affecting crack path tortuosity and propagation rate in architected\nweave composites containing various sub-patterns. Through compact tension\ntests, we determine how architected weave patterns compared to uniform weaves\ninfluence mode-I fracture toughness of woven composites due to interactions of\ndifferent failure modes. Results show that fracture toughness increases at\ntransition regions between sub-patterns in architected weave composites, with\nmore tortuous crack propagation and higher resistance to crack growth than\nuniform weave composites. We also introduce three geometrical parameters\ntransition, area, and skewness factors to characterize sub-patterns and their\neffects on in-plane fracture toughness. This knowledge can be exploited to\ndesign and fabricate safer lightweight structures for marine and aerospace\nsectors with enhanced damage tolerance under extreme loads.\n","subjects":["Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}