{"id":"2407.12203","title":"Semantic Communication for the Internet of Sounds: Architecture, Design\n  Principles, and Challenges","authors":"Chengsi Liang, Yao Sun, Christo Kurisummoottil Thomas, Lina Mohjazi,\n  and Walid Saad","authorsParsed":[["Liang","Chengsi",""],["Sun","Yao",""],["Thomas","Christo Kurisummoottil",""],["Mohjazi","Lina",""],["Saad","Walid",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 22:10:14 GMT"}],"updateDate":"2024-07-18","timestamp":1721167814000,"abstract":"  The Internet of Sounds (IoS) combines sound sensing, processing, and\ntransmission techniques, enabling collaboration among diverse sound devices. To\nachieve perceptual quality of sound synchronization in the IoS, it is necessary\nto precisely synchronize three critical factors: sound quality, timing, and\nbehavior control. However, conventional bit-oriented communication, which\nfocuses on bit reproduction, may not be able to fulfill these synchronization\nrequirements under dynamic channel conditions. One promising approach to\naddress the synchronization challenges of the IoS is through the use of\nsemantic communication (SC) that can capture and leverage the logical\nrelationships in its source data. Consequently, in this paper, we propose an\nIoS-centric SC framework with a transceiver design. The designed encoder\nextracts semantic information from diverse sources and transmits it to IoS\nlisteners. It can also distill important semantic information to reduce\ntransmission latency for timing synchronization. At the receiver's end, the\ndecoder employs context- and knowledge-based reasoning techniques to\nreconstruct and integrate sounds, which achieves sound quality synchronization\nacross diverse communication environments. Moreover, by periodically sharing\nknowledge, SC models of IoS devices can be updated to optimize their\nsynchronization behavior. Finally, we explore several open issues on\nmathematical models, resource allocation, and cross-layer protocols.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}