{"id":"2407.08377","title":"Long-range Turbulence Mitigation: A Large-scale Dataset and A\n  Coarse-to-fine Framework","authors":"Shengqi Xu, Run Sun, Yi Chang, Shuning Cao, Xueyao Xiao, and Luxin Yan","authorsParsed":[["Xu","Shengqi",""],["Sun","Run",""],["Chang","Yi",""],["Cao","Shuning",""],["Xiao","Xueyao",""],["Yan","Luxin",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 10:38:02 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 07:26:01 GMT"}],"updateDate":"2024-07-18","timestamp":1720694282000,"abstract":"  Long-range imaging inevitably suffers from atmospheric turbulence with severe\ngeometric distortions due to random refraction of light. The further the\ndistance, the more severe the disturbance. Despite existing research has\nachieved great progress in tackling short-range turbulence, there is less\nattention paid to long-range turbulence with significant distortions. To\naddress this dilemma and advance the field, we construct a large-scale real\nlong-range atmospheric turbulence dataset (RLR-AT), including 1500 turbulence\nsequences spanning distances from 1 Km to 13 Km. The advantages of RLR-AT\ncompared to existing ones: turbulence with longer-distances and\nhigher-diversity, scenes with greater-variety and larger-scale. Moreover, most\nexisting work adopts either registration-based or decomposition-based methods\nto address distortions through one-step mitigation. However, they fail to\neffectively handle long-range turbulence due to its significant pixel\ndisplacements. In this work, we propose a coarse-to-fine framework to handle\nsevere distortions, which cooperates dynamic turbulence and static background\npriors (CDSP). On the one hand, we discover the pixel motion statistical prior\nof turbulence, and propose a frequency-aware reference frame for better\nlarge-scale distortion registration, greatly reducing the burden of refinement.\nOn the other hand, we take advantage of the static prior of background, and\npropose a subspace-based low-rank tensor refinement model to eliminate the\nmisalignments inevitably left by registration while well preserving details.\nThe dynamic and static priors complement to each other, facilitating us to\nprogressively mitigate long-range turbulence with severe distortions. Extensive\nexperiments demonstrate that the proposed method outperforms SOTA methods on\ndifferent datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"73eTW-EABY8zyqEyGnWWZullswi_00zrr2TnEzaew6c","pdfSize":"7508538"}
