{"id":"2407.21657","title":"Response of a multi-wavelength laser to single-sideband optical\n  injection","authors":"Shahab Abdollahi, Pablo Marin-Palomo, Martin Virte","authorsParsed":[["Abdollahi","Shahab",""],["Marin-Palomo","Pablo",""],["Virte","Martin",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 14:57:42 GMT"}],"updateDate":"2024-08-01","timestamp":1722437862000,"abstract":"  Single-mode semiconductor lasers subject to optical injection have been shown\nto trigger a wide range of dynamical behavior from injection locking to chaos.\nMulti-wavelength lasers add even more degrees of freedom and complexity to the\ndynamical repertoire potentially unlocking new functionalities for applications\nranging from THz generation and processing to all-optical memories. In\nparticular, leveraging the inherent mode coupling in multi-wavelength lasers,\nspectral multiplication over a THz range of an injected optical signal has been\nshown. While most of the research on optical injection has been focused on\nsingle-mode semiconductor lasers, the dynamical behavior of multi-wavelength\nlasers, particularly when subjected to injection of amplitude-modulated signals\nremains vastly unexplored. In this work, we numerically and experimentally\ninvestigate the response of an on-chip dual-wavelength laser subject to the\noptical injection of a single-sideband signal around one of the modes of the\nlaser. Our findings show an asymmetric power evolution of the sidebands\nappearing around both the injected and un-injected modes with respect to the\nmodulation frequency. The power and bandwidth of the sideband signals strongly\ndepend on the resonance frequency produced by the interference between the\ncavity mode and the injection, which can be tailored by twerking the strength\nand the detuning of the injection. The outcomes of our numerical\ninvestigations, based on rate equations, align closely with the experimental\nresults highlighting the influence of key injection and laser parameters.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}