{"id":"2407.05509","title":"Physically Accessible and Inaccessible Quantum Correlations of Dirac\n  Fields in Schwarzschild Spacetime","authors":"Samira Elghaayda and Asad Ali and Saif Al-Kuwari and Mostafa Mansour","authorsParsed":[["Elghaayda","Samira",""],["Ali","Asad",""],["Al-Kuwari","Saif",""],["Mansour","Mostafa",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 22:55:13 GMT"}],"updateDate":"2024-07-09","timestamp":1720392913000,"abstract":"  In this study, we investigate the influence of Hawking decoherence on the\nquantum correlations of Dirac fields between \\textit{Alice} and \\textit{Bob}.\nInitially, they share a \\textit{Gisin} state near the Schwarzschild black hole\n(SBH) in an asymptotically flat region. Then, \\textit{Alice} remains stationary\nin this region, while \\textit{Bob} hovers near the event horizon (EH) of the\nSBH. We expect that \\textit{Bob}, using his excited detector, will detect a\nthermal Fermi-Dirac particle distribution. We assess the quantum correlations\nin the evolved \\textit{Gisin} state using quantum consonance and\nuncertainty-induced non-locality across physically accessible, physically\ninaccessible, and spacetime regions. Our investigation examines how these\nmeasures vary with Hawking temperature, Dirac particle frequency, and the\nparameters of the initial \\textit{Gisin} state. Additionally, we analyze the\ndistribution of these quantum correlation measures across all possible regions,\nnoting a redistribution towards the physically inaccessible region. Our\nfindings demonstrate that Hawking decoherence reduces the quantum correlations\nof Dirac fields in the physically accessible region, with the extent of\nreduction depending on the initial state parameters. Moreover, as Hawking\ndecoherence intensifies in the physically inaccessible and spacetime regions,\nthe quantum correlations of Dirac fields reemerge and ultimately converge to\nspecific values at infinite Hawking temperature. These results contribute to\nour understanding of quantum correlation dynamics within the framework of\nrelativistic quantum information (RQI).\n","subjects":["Physics/Quantum Physics","Physics/General Relativity and Quantum Cosmology","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3rogtsEfrIa5_bV3vXJQFfh0KFwLedXHPLkrTiM8mO4","pdfSize":"1295708"}
