{"id":"2407.14196","title":"Integrability in Perturbed Black Holes: Background Hidden Structures","authors":"Jos\\'e Luis Jaramillo, Michele Lenzi, Carlos F. Sopuerta","authorsParsed":[["Jaramillo","José Luis",""],["Lenzi","Michele",""],["Sopuerta","Carlos F.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 10:48:22 GMT"}],"updateDate":"2024-07-22","timestamp":1721386102000,"abstract":"  In this work we investigate the presence of integrable hidden structures in\nthe dynamics of perturbed non-rotating black holes (BHs). This can also be\nconsidered as a first step in a wider program of an effective identification of\n``slow'' and ``fast'' degrees of freedom (DoFs) in the (binary) BH dynamics,\nfollowing a wave-mean flow perspective. The slow DoFs would be associated with\na nonlinear integrable dynamics, on which the fast ones propagate following an\neffective linear dynamics. BH perturbation theory offers a natural ground to\ntest these properties. Indeed, the decoupling of Einstein equations into wave\nmaster equations with a potential provides an instance of such splitting into\n(frozen) slow DoFs (background potential) over which the linear dynamics of the\nfast ones (perturbation master functions) evolve. It has been recently shown\nthat these wave equations possess an infinite number of symmetries that\ncorrespond to the flow of the infinite hierarchy of Korteweg-de Vries (KdV)\nequations. Starting from these results, we systematically investigate the\npresence of integrable structures in BH perturbation theory. We first study\nthem in Cauchy slices and then extend the analysis to hyperboloidal foliations.\nThis second step introduces a splitting of the master equation into bulk and\nboundary contributions, unveiling an underlying structural relation with the\nslow and fast DoFs. This insight represents a first step to establish the\nintegrable structures associated to the slow DoFs as bulk symmetries of the\ndynamics of perturbed BHs.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory","Nonlinear Sciences/Exactly Solvable and Integrable Systems"],"license":"http://creativecommons.org/licenses/by/4.0/"}