{"id":"2407.09038","title":"High-Resolution Hyperspectral Video Imaging Using A Hexagonal Camera\n  Array","authors":"Frank Sippel, J\\\"urgen Seiler, Andr\\'e Kaup","authorsParsed":[["Sippel","Frank",""],["Seiler","Jürgen",""],["Kaup","André",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 07:00:28 GMT"}],"updateDate":"2024-07-15","timestamp":1720767628000,"abstract":"  Retrieving the reflectance spectrum from objects is an essential task for\nmany classification and detection problems, since many materials and processes\nhave a unique spectral behaviour. In many cases, it is highly desirable to\ncapture hyperspectral images due to the high spectral flexibility. Often, it is\neven necessary to capture hyperspectral videos or at least to be able to record\na hyperspectral image at once, also called snapshot hyperspectral imaging, to\navoid spectral smearing. For this task, a high-resolution snapshot\nhyperspectral camera array using a hexagonal shape is introduced.The hexagonal\narray for hyperspectral imaging uses off-the-shelf hardware, which enables high\nflexibility regarding employed cameras, lenses and filters. Hence, the spectral\nrange can be easily varied by mounting a different set of filters. Moreover,\nthe concept of using off-the-shelf hardware enables low prices in comparison to\nother approaches with highly specialized hardware. Since classical industrial\ncameras are used in this hyperspectral camera array, the spatial and temporal\nresolution is very high, while recording 37 hyperspectral channels in the range\nfrom 400 nm to 760 nm in 10 nm steps. A registration process is required for\nnear-field imaging, which maps the peripheral camera views to the center view.\nIt is shown that this combination using a hyperspectral camera array and the\ncorresponding image registration pipeline is superior in comparison to other\npopular snapshot approaches. For this evaluation, a synthetic hyperspectral\ndatabase is rendered. On the synthetic data, the novel approach outperforms its\nbest competitor by more than 3 dB in reconstruction quality. This synthetic\ndata is also used to show the superiority of the hexagonal shape in comparison\nto an orthogonal-spaced one. Moreover, a real-world high resolution\nhyperspectral video database is provided.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}