{"id":"2407.01725","title":"DiscoveryBench: Towards Data-Driven Discovery with Large Language Models","authors":"Bodhisattwa Prasad Majumder, Harshit Surana, Dhruv Agarwal, Bhavana\n  Dalvi Mishra, Abhijeetsingh Meena, Aryan Prakhar, Tirth Vora, Tushar Khot,\n  Ashish Sabharwal, Peter Clark","authorsParsed":[["Majumder","Bodhisattwa Prasad",""],["Surana","Harshit",""],["Agarwal","Dhruv",""],["Mishra","Bhavana Dalvi",""],["Meena","Abhijeetsingh",""],["Prakhar","Aryan",""],["Vora","Tirth",""],["Khot","Tushar",""],["Sabharwal","Ashish",""],["Clark","Peter",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 18:58:22 GMT"}],"updateDate":"2024-07-03","timestamp":1719860302000,"abstract":"  Can the rapid advances in code generation, function calling, and data\nanalysis using large language models (LLMs) help automate the search and\nverification of hypotheses purely from a set of provided datasets? To evaluate\nthis question, we present DiscoveryBench, the first comprehensive benchmark\nthat formalizes the multi-step process of data-driven discovery. The benchmark\nis designed to systematically assess current model capabilities in discovery\ntasks and provide a useful resource for improving them. Our benchmark contains\n264 tasks collected across 6 diverse domains, such as sociology and\nengineering, by manually deriving discovery workflows from published papers to\napproximate the real-world challenges faced by researchers, where each task is\ndefined by a dataset, its metadata, and a discovery goal in natural language.\nWe additionally provide 903 synthetic tasks to conduct controlled evaluations\nacross task complexity. Furthermore, our structured formalism of data-driven\ndiscovery enables a facet-based evaluation that provides useful insights into\ndifferent failure modes. We evaluate several popular LLM-based reasoning\nframeworks using both open and closed LLMs as baselines on DiscoveryBench and\nfind that even the best system scores only 25%. Our benchmark, thus,\nillustrates the challenges in autonomous data-driven discovery and serves as a\nvaluable resource for the community to make progress.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IFPZi1Wl0UsQygDwjzdv73CTKBXPB35KgIWnzqmBjqE","pdfSize":"1505228"}
