{"id":"2407.13012","title":"CUAOA: A Novel CUDA-Accelerated Simulation Framework for the QAOA","authors":"Jonas Stein, Jonas Blenninger, David Bucher, Josef Peter Eder, Elif\n  \\c{C}etiner, Maximilian Zorn, Claudia Linnhoff-Popien","authorsParsed":[["Stein","Jonas",""],["Blenninger","Jonas",""],["Bucher","David",""],["Eder","Josef Peter",""],["Çetiner","Elif",""],["Zorn","Maximilian",""],["Linnhoff-Popien","Claudia",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 21:06:18 GMT"}],"updateDate":"2024-07-19","timestamp":1721250378000,"abstract":"  The Quantum Approximate Optimization Algorithm (QAOA) is a prominent quantum\nalgorithm designed to find approximate solutions to combinatorial optimization\nproblems, which are challenging for classical computers. In the current era,\nwhere quantum hardware is constrained by noise and limited qubit availability,\nsimulating the QAOA remains essential for research. However, existing\nstate-of-the-art simulation frameworks suffer from long execution times or lack\ncomprehensive functionality, usability, and versatility, often requiring users\nto implement essential features themselves. Additionally, these frameworks are\nprimarily restricted to Python, limiting their use in safer and faster\nlanguages like Rust, which offer, e.g., advanced parallelization capabilities.\nIn this paper, we develop a GPU accelerated QAOA simulation framework utilizing\nthe NVIDIA CUDA toolkit. This framework offers a complete interface for QAOA\nsimulations, enabling the calculation of (exact) expectation values, direct\naccess to the statevector, fast sampling, and high-performance optimization\nmethods using an advanced state-of-the-art gradient calculation technique. The\nframework is designed for use in Python and Rust, providing flexibility for\nintegration into a wide range of applications, including those requiring fast\nalgorithm implementations leveraging QAOA at its core. The new framework's\nperformance is rigorously benchmarked on the MaxCut problem and compared\nagainst the current state-of-the-art general-purpose quantum circuit simulation\nframeworks Qiskit and Pennylane as well as the specialized QAOA simulation tool\nQOKit. Our evaluation shows that our approach outperforms the existing\nstate-of-the-art solutions in terms of runtime up to multiple orders of\nmagnitude. Our implementation is publicly available at\nhttps://github.com/JFLXB/cuaoa and Zenodo.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jWX-SrWxFW8N_khhfVJehePpUycWiG7NHDw-lXzfvEQ","pdfSize":"407443","objectId":"0x33dbed7fe693855fb53db90f3ab4faea411ade11b4c47ac2f22a3d47481e9950","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
