{"id":"2407.11018","title":"Online Multi-Task Offloading for Semantic-Aware Edge Computing Systems","authors":"Xuyang Chen, Qu Luo, Gaojie Chen, Daquan Feng, and Yao Sun","authorsParsed":[["Chen","Xuyang",""],["Luo","Qu",""],["Chen","Gaojie",""],["Feng","Daquan",""],["Sun","Yao",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 11:30:50 GMT"}],"updateDate":"2024-07-17","timestamp":1719574250000,"abstract":"  Mobile edge computing (MEC) provides low-latency offloading solutions for\ncomputationally intensive tasks, effectively improving the computing efficiency\nand battery life of mobile devices. However, for data-intensive tasks or\nscenarios with limited uplink bandwidth, network congestion might occur due to\nmassive simultaneous offloading nodes, increasing transmission latency and\naffecting task performance. In this paper, we propose a semantic-aware\nmulti-modal task offloading framework to address the challenges posed by\nlimited uplink bandwidth. By introducing a semantic extraction factor, we\nbalance the relationship among transmission latency, computation energy\nconsumption, and task performance. To measure the offloading performance of\nmulti-modal tasks, we design a unified and fair quality of experience (QoE)\nmetric that includes execution latency, energy consumption, and task\nperformance. Lastly, we formulate the optimization problem as a Markov decision\nprocess (MDP) and exploit the multi-agent proximal policy optimization (MAPPO)\nreinforcement learning algorithm to jointly optimize the semantic extraction\nfactor, communication resources, and computing resources to maximize overall\nQoE. Experimental results show that the proposed method achieves a reduction in\nexecution latency and energy consumption of 18.1% and 12.9%, respectively\ncompared with the semantic-unaware approach. Moreover, the proposed approach\ncan be easily extended to models with different user preferences.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}