{"id":"2407.13190","title":"A Note on Generalized Locally Toeplitz Operators","authors":"V. B. Kiran Kumar and N. S. Sarathkumar","authorsParsed":[["Kumar","V. B. Kiran",""],["Sarathkumar","N. S.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 05:58:50 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 15:20:14 GMT"}],"updateDate":"2024-07-25","timestamp":1721282330000,"abstract":"  Generalized Locally Toeplitz (GLT) matrix sequences arise from large linear\nsystems that approximate Partial Differential Equations (PDEs), Fractional\nDifferential Equations (FDEs), and Integro-Differential Equations (IDEs). GLT\nsequences of matrices have been developed to study the spectral/singular value\nbehaviour of the numerical approximations to various PDEs, Fades and IDEs.\nThese approximations can be achieved using any discretization method on\nappropriate grids through local techniques such as Finite Differences, Finite\nElements, Finite Volumes, Isogeometric Analysis, and Discontinuous Galerkin\nmethods. Spectral and singular value symbols are essential for analyzing the\neigenvalue and singular value distributions of matrix sequences in the Weyl\nsense. In this article, we provide a comprehensive overview of the\noperator-theoretic aspect of GLT sequences. The theory of GLT sequences, along\nwith findings on the asymptotic spectral distribution of perturbed matrix\nsequences, is a highly effective and successful method for calculating the\nspectral symbol f. Therefore, developing an automatic procedure to compute the\nspectral symbols of these matrix sequences would be advantageous, a task that\nAhmed Ratnani, N S Sarathkumar, S. Serra-Capizzano have partially undertaken.\nAs an application of the theory developed here, we propose an automatic\nprocedure for computing the symbol of the underlying sequences of matrices,\nassuming they form a GLT sequence that meets mild conditions.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}