{"id":"2407.21538","title":"In-plane dielectric constant and conductivity of confined water","authors":"R. Wang, M. Souilamas, A. Esfandiar, R. Fabregas, S. Benaglia, H.\n  Nevison-Andrews, Q. Yang, J. Normansell, P. Ares, G. Ferrari, A. Principi, A.\n  K. Geim, L. Fumagalli","authorsParsed":[["Wang","R.",""],["Souilamas","M.",""],["Esfandiar","A.",""],["Fabregas","R.",""],["Benaglia","S.",""],["Nevison-Andrews","H.",""],["Yang","Q.",""],["Normansell","J.",""],["Ares","P.",""],["Ferrari","G.",""],["Principi","A.",""],["Geim","A. K.",""],["Fumagalli","L.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 11:52:24 GMT"}],"updateDate":"2024-08-01","timestamp":1722426744000,"abstract":"  Water is essential for almost every aspect of life on our planet and,\nunsurprisingly, its properties have been studied in great detail. However,\ndisproportionately little remains known about the electrical properties of\ninterfacial and strongly confined water where its structure deviates from that\nof bulk water, becoming distinctly layered. The structural change is expected\nto affect water's conductivity and particularly its polarizability, which in\nturn modifies intermolecular forces that play a crucial role in many physical\nand chemical processes. Here we use scanning dielectric microscopy to probe the\nin-plane electrical properties of water confined between atomically flat\nsurfaces separated by distances down to 1 nm. For confinement exceeding a few\nnm, water exhibits an in-plane dielectric constant close to that of bulk water\nand its proton conductivity is notably enhanced, gradually increasing with\ndecreasing water thickness. This trend abruptly changes when the confined water\nbecomes only a few molecules thick. Its in-plane dielectric constant reaches\ngiant, ferroelectric-like values of about 1,000 whereas the conductivity peaks\nat a few S/m, close to values characteristic of superionic liquids. We\nattribute the enhancement to strongly disordered hydrogen bonding induced by\nthe few-layer confinement, which facilitates both easier in-plane polarization\nof molecular dipoles and faster proton exchange. This insight into the\nelectrical properties of nanoconfined water is important for understanding many\nphenomena that occur at aqueous interfaces and in nanoscale pores.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Soft Condensed Matter","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cn-2wMTmP0q7EhL2xYwkMMKIm5xJfqRSJKzniGMlRWQ","pdfSize":"3206250"}
