{"id":"2407.08517","title":"Generalized Low-Rank Matrix Completion Model with Overlapping Group\n  Error Representation","authors":"Wenjing Lu, Zhuang Fang, Liang Wu, Liming Tang, Hanxin Liu, and\n  Chuanjiang He","authorsParsed":[["Lu","Wenjing",""],["Fang","Zhuang",""],["Wu","Liang",""],["Tang","Liming",""],["Liu","Hanxin",""],["He","Chuanjiang",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:01:57 GMT"},{"version":"v2","created":"Sun, 21 Jul 2024 02:43:43 GMT"}],"updateDate":"2024-07-23","timestamp":1720706517000,"abstract":"  The low-rank matrix completion (LRMC) technology has achieved remarkable\nresults in low-level visual tasks. There is an underlying assumption that the\nreal-world matrix data is low-rank in LRMC. However, the real matrix data does\nnot satisfy the strict low-rank property, which undoubtedly present serious\nchallenges for the above-mentioned matrix recovery methods. Fortunately, there\nare feasible schemes that devise appropriate and effective priori\nrepresentations for describing the intrinsic information of real data. In this\npaper, we firstly model the matrix data ${\\bf{Y}}$ as the sum of a low-rank\napproximation component $\\bf{X}$ and an approximation error component\n$\\cal{E}$. This finer-grained data decomposition architecture enables each\ncomponent of information to be portrayed more precisely. Further, we design an\noverlapping group error representation (OGER) function to characterize the\nabove error structure and propose a generalized low-rank matrix completion\nmodel based on OGER. Specifically, the low-rank component describes the global\nstructure information of matrix data, while the OGER component not only\ncompensates for the approximation error between the low-rank component and the\nreal data but also better captures the local block sparsity information of\nmatrix data. Finally, we develop an alternating direction method of multipliers\n(ADMM) that integrates the majorization-minimization (MM) algorithm, which\nenables the efficient solution of the proposed model. And we analyze the\nconvergence of the algorithm in detail both theoretically and experimentally.\nIn addition, the results of numerical experiments demonstrate that the proposed\nmodel outperforms existing competing models in performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}