{"id":"2407.03235","title":"Programming universal unitary transformations on a general-purpose\n  silicon photonics platform","authors":"Jose Roberto Rausell-Campo, Daniel P\\'erez, L\\'opez, Jos\\'e Capmany\n  Francoy","authorsParsed":[["Rausell-Campo","Jose Roberto",""],["Pérez","Daniel",""],["López","",""],["Francoy","José Capmany",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 16:05:00 GMT"}],"updateDate":"2024-07-04","timestamp":1720022700000,"abstract":"  General-purpose programmable photonic processors provide a versatile platform\nfor integrating diverse functionalities on a single chip. Leveraging a\ntwo-dimensional hexagonal waveguide mesh of Mach-Zehnder interferometers, these\nsystems have demonstrated significant potential in microwave photonics\napplications. Additionally, they are a promising platform for creating unitary\nlinear transformations, which are key elements in quantum computing and\nphotonic neural networks. However, a general procedure for implementing these\ntransformations on such systems has not been established yet. This work\ndemonstrates the programming of universal unitary transformations on a\ngeneral-purpose programmable photonic circuit with a hexagonal topology. We\ndetail the steps to split the light on-chip, demonstrate that an equivalent\nstructure to the Mach-Zehnder interferometer with one internal and one external\nphase shifter can be built in the hexagonal mesh, and program both the\ntriangular and rectangular architectures for matrix multiplication. We\nrecalibrate the system to account for passive phase deviations. Experimental\nprogramming of 3x3 and 4x4 random unitary matrices yields fidelities > 98% and\nbit precisions over 5 bits. To the best of our knowledge, this is the first\ntime that random unitary matrices are demonstrated on a general-purpose\nphotonic processor and pave the way for the implementation of programmable\nphotonic circuits in optical computing and signal processing systems.\n","subjects":["Physics/Optics","Computing Research Repository/Emerging Technologies","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}