{"id":"2407.16571","title":"Correlating Stroke Risk with Non-Invasive Tracing of Brain Blood Dynamic\n  via a Portable Speckle Contrast Optical Spectroscopy Laser Device","authors":"Yu Xi Huang, Simon Mahler, Aidin Abedi, Julian Michael Tyszka, Yu Tung\n  Lo, Patrick D. Lyden, Jonathan Russin, Charles Liu, Changhuei Yang","authorsParsed":[["Huang","Yu Xi",""],["Mahler","Simon",""],["Abedi","Aidin",""],["Tyszka","Julian Michael",""],["Lo","Yu Tung",""],["Lyden","Patrick D.",""],["Russin","Jonathan",""],["Liu","Charles",""],["Yang","Changhuei",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 15:25:19 GMT"}],"updateDate":"2024-07-24","timestamp":1721748319000,"abstract":"  Stroke poses a significant global health threat, with millions affected\nannually, leading to substantial morbidity and mortality. Current stroke risk\nassessment for the general population relies on markers such as demographics,\nblood tests, and comorbidities. A minimally invasive, clinically scalable, and\ncost-effective way to directly measure cerebral blood flow presents an\nopportunity. This opportunity has potential to positively impact effective\nstroke risk assessment prevention and intervention. Physiological changes in\nthe cerebral vascular system, particularly in response to carbon dioxide level\nchanges and oxygen deprivation, such as during breath-holding, can offer\ninsights into stroke risk assessment. However, existing methods for measuring\ncerebral perfusion reserve, such as blood flow and blood volume changes, are\nlimited by either invasiveness or impracticality. Here, we propose a\ntranscranial approach using speckle contrast optical spectroscopy (SCOS) to\nnon-invasively monitor regional changes in brain blood flow and volume during\nbreath-holding. Our study, conducted on 50 individuals classified into two\ngroups (low-risk and higher-risk for stroke), shows significant differences in\nblood dynamic changes during breath-holding between the two groups, providing\nphysiological insights for stroke risk assessment using a non-invasive\nquantification paradigm. Given its cost-effectiveness, scalability,\nportability, and simplicity, this laser-centric tool has significant potential\nin enhancing the pre-screening of stroke and mitigating strokes in the general\npopulation through early diagnosis and intervention.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Physics/Medical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}