{"id":"2407.12248","title":"Mitigating Interference of Microservices with a Scoring Mechanism in\n  Large-scale Clusters","authors":"Dingyu Yang, Kangpeng Zheng, Shiyou Qian, Jian Cao, Guangtao Xue","authorsParsed":[["Yang","Dingyu",""],["Zheng","Kangpeng",""],["Qian","Shiyou",""],["Cao","Jian",""],["Xue","Guangtao",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 01:30:45 GMT"}],"updateDate":"2024-07-18","timestamp":1721179845000,"abstract":"  Co-locating latency-critical services (LCSs) and best-effort jobs (BEJs)\nconstitute the principal approach for enhancing resource utilization in\nproduction. Nevertheless, the co-location practice hurts the performance of\nLCSs due to resource competition, even when employing isolation technology.\nThrough an extensive analysis of voluminous real trace data derived from two\nproduction clusters, we observe that BEJs typically exhibit periodic execution\npatterns and serve as the primary sources of interference to LCSs. Furthermore,\ndespite occupying the same level of resource consumption, the diverse\ncompositions of BEJs can result in varying degrees of interference on LCSs.\nSubsequently, we propose PISM, a proactive Performance Interference Scoring and\nMitigating framework for LCSs through the optimization of BEJ scheduling.\nFirstly, PISM adopts a data-driven approach to establish a characterization and\nclassification methodology for BEJs. Secondly, PISM models the relationship\nbetween the composition of BEJs on servers and the response time (RT) of LCSs.\nThirdly, PISM establishes an interference scoring mechanism in terms of RT,\nwhich serves as the foundation for BEJ scheduling. We assess the effectiveness\nof PISM on a small-scale cluster and through extensive data-driven simulations.\nThe experiment results demonstrate that PISM can reduce cluster interference by\nup to 41.5%, and improve the throughput of long-tail LCSs by 76.4%.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SDwswVsuyTmCVMqeO6SLVJgBYJi9Dn_GYRcdIKb1fQs","pdfSize":"2971796"}
