{"id":"2407.07465","title":"Exploring the Untouched Sweeps for Conflict-Aware 3D Segmentation\n  Pretraining","authors":"Tianfang Sun, Zhizhong Zhang, Xin Tan, Yanyun Qu, Yuan Xie","authorsParsed":[["Sun","Tianfang",""],["Zhang","Zhizhong",""],["Tan","Xin",""],["Qu","Yanyun",""],["Xie","Yuan",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 08:46:29 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 14:32:55 GMT"}],"updateDate":"2024-07-18","timestamp":1720601189000,"abstract":"  LiDAR-camera 3D representation pretraining has shown significant promise for\n3D perception tasks and related applications. However, two issues widely exist\nin this framework: 1) Solely keyframes are used for training. For example, in\nnuScenes, a substantial quantity of unpaired LiDAR and camera frames remain\nunutilized, limiting the representation capabilities of the pretrained network.\n2) The contrastive loss erroneously distances points and image regions with\nidentical semantics but from different frames, disturbing the semantic\nconsistency of the learned presentations. In this paper, we propose a novel\nVision-Foundation-Model-driven sample exploring module to meticulously select\nLiDAR-Image pairs from unexplored frames, enriching the original training set.\nWe utilized timestamps and the semantic priors from VFMs to identify\nwell-synchronized training pairs and to discover samples with diverse content.\nMoreover, we design a cross- and intra-modal conflict-aware contrastive loss\nusing the semantic mask labels of VFMs to avoid contrasting semantically\nsimilar points and image regions. Our method consistently outperforms existing\nstate-of-the-art pretraining frameworks across three major public autonomous\ndriving datasets: nuScenes, SemanticKITTI, and Waymo on 3D semantic\nsegmentation by +3.0\\%, +3.0\\%, and +3.3\\% in mIoU, respectively. Furthermore,\nour approach exhibits adaptable generalization to different 3D backbones and\ntypical semantic masks generated by non-VFM models.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}