{"id":"2407.09228","title":"High-Throughput Identification and Statistical Analysis of Atomically\n  Thin Semiconductors","authors":"Juri G. Crimmann, Moritz N. Junker, Yannik M. Glauser, Nolan\n  Lassaline, Gabriel Nagamine, and David J. Norris","authorsParsed":[["Crimmann","Juri G.",""],["Junker","Moritz N.",""],["Glauser","Yannik M.",""],["Lassaline","Nolan",""],["Nagamine","Gabriel",""],["Norris","David J.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 12:48:07 GMT"}],"updateDate":"2024-07-15","timestamp":1720788487000,"abstract":"  Transition metal dichalcogenides (TMDs) are layered two-dimensional\nsemiconductors explored for various optoelectronic applications, ranging from\nlight-emitting diodes to single-photon emitters. To interact strongly with\nlight, such devices require monolayer TMDs, which exhibit a direct bandgap.\nThese atomically thin sheets are typically obtained through mechanical\nexfoliation followed by manual identification with a brightfield optical\nmicroscope. While this traditional procedure provides high-quality crystals,\nthe identification step is time-intensive, low-throughput, and prone to human\nerror, creating a significant bottleneck for TMD research. Here, we report a\nsimple and fully automated approach for high-throughput identification of TMD\nmonolayers using photoluminescence microscopy. Compared to a manual search and\nverification, our methodology offers a four-orders-of-magnitude decrease in the\ntime a researcher must invest per identified monolayer. This ability enables us\nto measure geometric and photoluminescence-intensity features of more than\n2,400 monolayers and bilayers of WSe$_2$, MoSe$_2$, and MoS$_2$. Due to these\nlarge numbers, we can study and quantify material properties previously\ninaccessible. For example, we show that the mean photoluminescence intensity\nfrom a monolayer correlates with its size due to reduced emission from its\nedges. Further, we observe large variations in brightness (up to 10$\\times$)\nfrom WSe$_2$ monolayers of different batches produced by the same supplier.\nTherefore, our automated approach not only increases fabrication efficiency but\nalso enhances sample quality for optoelectronic devices of atomically thin\nsemiconductors.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}