{"id":"2407.06655","title":"Teacher agency in the age of generative AI: towards a framework of\n  hybrid intelligence for learning design","authors":"Thomas B Fr{\\o}sig (UniCA, LINE), Margarida Romero (UniCA, LINE)","authorsParsed":[["Frøsig","Thomas B","","UniCA, LINE"],["Romero","Margarida","","UniCA, LINE"]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 08:28:05 GMT"}],"updateDate":"2024-07-10","timestamp":1720513685000,"abstract":"  Generative AI (genAI) is being used in education for different purposes. From\nthe teachers' perspective, genAI can support activities such as learning\ndesign. However, there is a need to study the impact of genAI on the teachers'\nagency. While GenAI can support certain processes of idea generation and\nco-creation, GenAI has the potential to negatively affect professional agency\ndue to teachers' limited power to (i) act, (ii) affect matters, and (iii) make\ndecisions or choices, as well as the possibility to (iv) take a stance. Agency\nis identified in the learning sciences studies as being one of the factors in\nteachers' ability to trust AI. This paper aims to introduce a dual perspective.\nFirst, educational technology, as opposed to other computer-mediated\ncommunication (CMC) tools, has two distinctly different user groups and\ndifferent user needs, in the form of learners and teachers, to cater for.\nSecond, the design of educational technology often prioritises learner agency\nand engagement, thereby limiting the opportunities for teachers to influence\nthe technology and take action. This study aims to analyse the way GenAI is\ninfluencing teachers' agency. After identifying the current limits of GenAI, a\nsolution based on the combination of human intelligence and artificial\nintelligence through a hybrid intelligence approach is proposed. This\ncombination opens up the discussion of a collaboration between teacher and\ngenAI being able to open up new practices in learning design in which they HI\nsupport the extension of the teachers' activity.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}