{"id":"2407.09134","title":"Asynchronous Online Adaptation via Modular Drift Detection for Deep\n  Receivers","authors":"Nicole Uzlaner, Tomer Raviv, Nir Shlezinger and Koby Todros","authorsParsed":[["Uzlaner","Nicole",""],["Raviv","Tomer",""],["Shlezinger","Nir",""],["Todros","Koby",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 10:05:24 GMT"}],"updateDate":"2024-07-15","timestamp":1720778724000,"abstract":"  Deep learning is envisioned to facilitate the operation of wireless\nreceivers, with emerging architectures integrating deep neural networks (DNNs)\nwith traditional modular receiver processing. While deep receivers were shown\nto operate reliably in complex settings for which they were trained, the\ndynamic nature of wireless communications gives rise to the need to repeatedly\nadapt deep receivers to channel variations. However, frequent re-training is\ncostly and ineffective, while in practice, not every channel variation\nnecessitates adaptation of the entire DNN. In this paper, we study concept\ndrift detection for identifying when does a deep receiver no longer match the\nchannel, enabling asynchronous adaptation, i.e., re-training only when\nnecessary. We identify existing drift detection schemes from the machine\nlearning literature that can be adapted for deep receivers in dynamic channels,\nand propose a novel soft-output detection mechanism tailored to the\ncommunication domain. Moreover, for deep receivers that preserve conventional\nmodular receiver processing, we design modular drift detection mechanisms, that\nsimultaneously identify when and which sub-module to re-train. The provided\nnumerical studies show that even in a rapidly time-varying scenarios,\nasynchronous adaptation via modular drift detection dramatically reduces the\nnumber of trained parameters and re-training times, with little compromise on\nperformance.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}