{"id":"2407.03808","title":"Designing Value-Centered Consent Interfaces: A Mixed-Methods Approach to\n  Support Patient Values in Data-Sharing Decisions","authors":"David Leimst\\\"adtner, Peter S\\\"orries, Claudia M\\\"uller-Birn","authorsParsed":[["Leimstädtner","David",""],["Sörries","Peter",""],["Müller-Birn","Claudia",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 10:32:30 GMT"}],"updateDate":"2024-07-15","timestamp":1720089150000,"abstract":"  In the digital health domain, ethical data collection practices are crucial\nfor ensuring the availability of quality datasets that drive medical\nadvancement. Data donation, allowing patients to share their clinical data for\nsecondary research use, presents a promising resource for such datasets. Yet,\ncurrent consent interfaces mediating data-sharing decisions are found to favor\ndata-collectors' values by leveraging cognitive biases in data-subjects towards\nhigher data-sharing rates. This raises ethical concerns about the use of data\ncollected, as well as concerning the quality of the resulting datasets. Seeking\nto establish patient-centered data collection practices in digital health, we\ninvestigate the design of consent interfaces that support end-users in making\nvalue-congruent health data-sharing decisions. Focusing our research efforts on\nthe situated context of health data donation at the psychosomatic unit of a\nGerman university hospital, we demonstrate how a human-centered design can\nground technology within the perspective of a vulnerable group. We employed an\nexploratory sequential mixed-method approach consisting of five phases:\nParticipatory workshops explore patient values, informing the design of a\nproposed Value-Centered Consent Interface. An online experiment demonstrates\nour interface element's effect, increasing value-congruence in data-sharing\ndecisions. Our proposed consent interface design is then adapted to the\nresearch context through a co-creation workshop with subject experts and a user\nevaluation with patients. Our work contributes to recent discourse in CSCW\nconcerning ethical implications of new data practices within their\nsocio-technological context by exploring patient values on medical data\nsharing, introducing a novel consent interface to support value-congruent\ndecision-making, and providing a situated evaluation of the proposed interface\nwith patients.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}