{"id":"2407.19609","title":"Attosecond transient grating spectroscopy with near-infrared grating\n  pulses and an extreme ultraviolet diffracted probe","authors":"Rafael Quintero-Bermudez, Lorenz Drescher, Vincent Eggers, Kevin Gulu\n  Xiong, Stephen R. Leone","authorsParsed":[["Quintero-Bermudez","Rafael",""],["Drescher","Lorenz",""],["Eggers","Vincent",""],["Xiong","Kevin Gulu",""],["Leone","Stephen R.",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 23:22:19 GMT"}],"updateDate":"2024-07-30","timestamp":1722208939000,"abstract":"  Transient grating spectroscopy has become a mainstay among metal and\nsemiconductor characterization techniques. Here we extend the technique towards\nthe shortest achievable timescales by using tabletop high-harmonic generation\nof attosecond extreme ultraviolet (XUV) pulses that diffract from transient\ngratings generated with 500-1000 nm sub-5 fs near-infrared (NIR) pulses. We\ndemonstrate the power of attosecond transient grating spectroscopy (ATGS) by\ninvestigating the ultrafast photoexcited dynamics in an Sb semimetal thin film.\nATGS provides an element-specific, background-free signal, unfettered by\nspectral congestion, in contrast to transient absorption spectroscopy. With the\nATGS measurements in Sb polycrystalline thin films, we observe the generation\nof coherent phonons and investigate the lattice and carrier dynamics. Among the\nlatter processes, we extract carrier thermalization, hot carrier cooling, and\nelectron-hole recombination, which are on the order of 20 fs, 50 fs, and 2 ps,\ntimescales, respectively. Furthermore, simultaneous collection of transient\nabsorption and transient grating data allows us to extract the total complex\ndielectric constant in the sample dynamics, including the real-valued\nrefractive index, from which we are also able to investigate carrier-phonon\ninteractions and longer-lived phonon dynamics. The outlined experimental\ntechnique expands the capabilities of transient grating spectroscopy and\nattosecond spectroscopies by providing a wealth of information concerning\ncarrier and lattice dynamics with an element-selective technique, at the\nshortest achievable timescales.\n","subjects":["Physics/Optics","Condensed Matter/Materials Science","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/"}