{"id":"2407.02710","title":"WARNING This Contains Misinformation: The Effect of Cognitive Factors,\n  Beliefs, and Personality on Misinformation Warning Tag Attitudes","authors":"Robert Kaufman, Aaron Broukhim, Michael Haupt","authorsParsed":[["Kaufman","Robert",""],["Broukhim","Aaron",""],["Haupt","Michael",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 23:11:27 GMT"}],"updateDate":"2024-07-04","timestamp":1719961887000,"abstract":"  Social media platforms enhance the propagation of online misinformation by\nproviding large user bases with a quick means to share content. One way to\ndisrupt the rapid dissemination of misinformation at scale is through warning\ntags, which label content as potentially false or misleading. Past warning tag\nmitigation studies yield mixed results for diverse audiences, however. We\nhypothesize that personalizing warning tags to the individual characteristics\nof their diverse users may enhance mitigation effectiveness. To reach the goal\nof personalization, we need to understand how people differ and how those\ndifferences predict a person's attitudes and self-described behaviors toward\ntags and tagged content. In this study, we leverage Amazon Mechanical Turk (n =\n132) and undergraduate students (n = 112) to provide this foundational\nunderstanding. Specifically, we find attitudes towards warning tags and\nself-described behaviors are positively influenced by factors such as\nPersonality Openness and Agreeableness, Need for Cognitive Closure (NFCC),\nCognitive Reflection Test (CRT) score, and Trust in Medical Scientists.\nConversely, Trust in Religious Leaders, Conscientiousness, and political\nconservatism were negatively correlated with these attitudes and behaviors. We\nsynthesize our results into design insights and a future research agenda for\nmore effective and personalized misinformation warning tags and misinformation\nmitigation strategies more generally.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ddxwUMUbIuEK1QuAPNGbgHAk3TEd8nrC3SaYPPJ3km4","pdfSize":"655037"}
