{"id":"2407.09547","title":"Predicting Depression and Anxiety Risk in Dutch Neighborhoods from\n  Street-View Images","authors":"Nin Khodorivsko, Giacomo Spigler","authorsParsed":[["Khodorivsko","Nin",""],["Spigler","Giacomo",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 10:05:56 GMT"}],"updateDate":"2024-07-17","timestamp":1719482756000,"abstract":"  Depression and anxiety disorders are prevalent mental health challenges\naffecting a substantial segment of the global population. In this study, we\nexplored the environmental correlates of these disorders by analyzing\nstreet-view images (SVI) of neighborhoods in the Netherlands. Our dataset\ncomprises 9,879 Dutch SVIs sourced from Google Street View, paired with\nstatistical depression and anxiety risk metrics from the Dutch Health Monitor.\nTo tackle this challenge, we refined two existing neural network architectures,\nDeiT Base and ResNet50. Our goal was to predict neighborhood risk levels,\ncategorized into four tiers from low to high risk, using the raw images. The\nresults showed that DeiT Base and ResNet50 achieved accuracies of 43.43% and\n43.63%, respectively. Notably, a significant portion of the errors were between\nadjacent risk categories, resulting in adjusted accuracies of 83.55% and\n80.38%. We also implemented the SHapley Additive exPlanations (SHAP) method on\nboth models and employed gradient rollout on DeiT. Interestingly, while SHAP\nunderscored specific landscape attributes, the correlation between these\nfeatures and distinct depression risk categories remained unclear. The gradient\nrollout findings were similarly non-definitive. However, through manual\nanalysis, we identified certain landscape types that were consistently linked\nwith specific risk categories. These findings suggest the potential of these\ntechniques in monitoring the correlation between various landscapes and\nenvironmental risk factors for mental health issues. As a future direction, we\nrecommend employing these methods to observe how risk scores from the Dutch\nHealth Monitor shift across neighborhoods over time.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rEMj5_B9B6iMcjBi1K2QT0cCPQQw9Hf-VhBvyBdSHfo","pdfSize":"44136956"}
