{"id":"2407.00597","title":"Myriad of Terahertz Magnons with All-Optical Magnetoelectric\n  Functionality for Efficient Spin-Wave Computing in Honeycomb Magnet Co4Ta2O9","authors":"Brijesh Singh Mehra, Sanjeev Kumar, Gaurav Dubey, Ayyappan Shyam,\n  Ankit Kumar, K Anirudh, Kiran Singh, Dhanvir Singh Rana","authorsParsed":[["Mehra","Brijesh Singh",""],["Kumar","Sanjeev",""],["Dubey","Gaurav",""],["Shyam","Ayyappan",""],["Kumar","Ankit",""],["Anirudh","K",""],["Singh","Kiran",""],["Rana","Dhanvir Singh",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 05:43:06 GMT"}],"updateDate":"2024-07-02","timestamp":1719726186000,"abstract":"  Terahertz (THz) magnonics represent the notion of mathematical algebraic\noperations of magnons such as addition and subtraction in THz regime which is\nan emergent dissipationless ultrafast alternative to existing data processing\ntechnologies. Spin waves on antiferromagnets with a twist in spin order host\nsuch magnons in THz regime, which possess advantage of higher processing\nspeeds, additional polarization degree of freedom and longer propagation\nlengths compared to that of gigahertz magnons in ferromagnets. While\ninteraction among THz magnons is the crux of algebra operations, it requires\nmagnetic orders with closely spaced magnon modes for easier experimental\nrealization of their interactions. Herein, rich wealth of magnons spanning a\nnarrow energy range of 0.4 to 10 meV is unraveled in Co4Ta2O9 using magneto-THz\nspectroscopy. Rare multitude of ten excitation modes, either of magnons or\nhybrid magnon-phonon modes is presented. Among other attributes, spin lattice\ninteraction suggests a correlation among spin and local lattice distortion,\nmagnetostriction, and magnetic exchange interaction signifying a THz\nmagnetoelectric effect. This unification of structural, magnetic and dielectric\nfacets, and their magnetic field control in a narrow spectrum unwinds the\nmechanism underneath the system's complexity while the manifestation of\nmultitude of spin excitation modes is a potential source to design multiple\nchannels in spin-wave computing based devices.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}