{"id":"2407.18444","title":"Mapping the distribution of the magnetic field strength along the NGC\n  315 jet","authors":"Motoki Kino, Hyunwook Ro, Masaaki Takahashi, Tomohisa Kawashima,\n  Jongho Park, Kazuhiro Hada, Yuzhu Cui","authorsParsed":[["Kino","Motoki",""],["Ro","Hyunwook",""],["Takahashi","Masaaki",""],["Kawashima","Tomohisa",""],["Park","Jongho",""],["Hada","Kazuhiro",""],["Cui","Yuzhu",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 00:54:40 GMT"}],"updateDate":"2024-07-29","timestamp":1721955280000,"abstract":"  We study magnetic field strengths along the jet in NGC~315. First, we\nestimated the angular velocity of rotation in the jet magnetosphere by\ncomparing the measured velocity profile of NGC~315 with the\nmagneto-hydrodynamic jet model of proposed by Tomimatsu and Takahashi. Similar\nto the case of M87, we find that the model can reproduce the logarithmic\nfeature of the velocity profile and suggest a slowly rotating black hole\nmagnetosphere for NGC~315. By substituting the estimated $\\Omega_{F}$ into the\njet power predicted by the Blandford-Znajek mechanism, we estimate the magnetic\nfield strength near the event horizon of the central black hole as $5\\times\n10^{3}~{\\rm G}\\lesssim B_{H}\\lesssim 2\\times 10^{4}~{\\rm G}$. We then estimate\nmagnetic-field strengths along the jet by comparing the spectral index\ndistribution obtained from VLBI observations with a synchrotron-emitting jet\nmodel. Then we constrain the magnetic field strength at a de-projected distance\n$z$ from the black hole to be in the range $0.06~{\\rm G}\\lesssim B(z)\\lesssim\n0.9~{\\rm G}$ for $5.2 \\times 10^{3}~r_{g}\\lesssim z \\lesssim 4.9 \\times\n10^{4}~r_{g}$, where $r_{g}$ represents the gravitational radius. By combining\nthe obtained field strengths at the event horizon and the downstream section of\nthe jet, we find that the accretion flow at the jet base is consistent with a\nmagnetically arrested disk (MAD). We discuss a comparison of the jet power and\nthe magnetic flux anchored to the event horizon in NGC~315 and M87.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}