{"id":"2407.08544","title":"Constraints of the maximum mass of quark stars based on post-merger\n  evolutions","authors":"Yurui Zhou, Chen Zhang, Junjie Zhao, Kenta Kiuchi, Sho Fujibayashi,\n  Enping Zhou","authorsParsed":[["Zhou","Yurui",""],["Zhang","Chen",""],["Zhao","Junjie",""],["Kiuchi","Kenta",""],["Fujibayashi","Sho",""],["Zhou","Enping",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:30:18 GMT"}],"updateDate":"2024-07-12","timestamp":1720708218000,"abstract":"  We semi-analytically investigate the post-merger evolution of the binary\nquark star merger. The effective-one-body method is employed to estimate the\nenergy and angular momentum dissipation due to gravitational waves in the\ninspiral phase. Three major mechanisms of energy and angular momentum\ndissipation are considered in the post-merger phase: mass outflows, neutrinos,\nand gravitational waves. The proportion of each mechanism could be determined\nby baryon number, energy and angular momentum conservation laws as well as the\nequilibrium model for rotating quark stars. Applying this analysis to the\nGW170817 event suggests two important conclusions: 1) a remnant quark star\nwhose mass is smaller than the maximum mass of a uniformly rotating quark star\ncan collapse before its rotational energy is dissipated via electromagnetic\nradiation (i.e., $\\sim 100\\,\\mathrm{s}$) as the angular momentum left in the\nremnant quark star might not be large enough to sustain the additional\nself-gravity of the supramassive quark star due to the angular momentum\ndissipation of mass outflows, neutrinos and gravitational waves; 2) considering\na general quark star equation of state model, a constraint on the maximum mass\nof cold and non-rotating quark stars is found as\n$M_{\\mathrm{TOV}}\\lesssim2.35^{+0.07}_{-0.17}\\,M_{\\odot}$, assuming a delayed\ncollapse occurred before a large fraction of the total rotational energy\n($\\color{blue} \\gtrsim 10^{53}\\,$erg) of the merger remnant was deposited into\nthe merger environment for the GW170817 event. These constraints could be\nimproved with future merger events, once there are more evidences on its\npost-merger evolution channel or information on the amount of post-merger\ngravitational wave and neutrino emissions inferred from the multi-messenger\nobservations.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}