{"id":"2407.14981","title":"Open Problems in Technical AI Governance","authors":"Anka Reuel, Ben Bucknall, Stephen Casper, Tim Fist, Lisa Soder, Onni\n  Aarne, Lewis Hammond, Lujain Ibrahim, Alan Chan, Peter Wills, Markus\n  Anderljung, Ben Garfinkel, Lennart Heim, Andrew Trask, Gabriel Mukobi, Rylan\n  Schaeffer, Mauricio Baker, Sara Hooker, Irene Solaiman, Alexandra Sasha\n  Luccioni, Nitarshan Rajkumar, Nicolas Mo\\\"es, Jeffrey Ladish, Neel Guha,\n  Jessica Newman, Yoshua Bengio, Tobin South, Alex Pentland, Sanmi Koyejo,\n  Mykel J. Kochenderfer, Robert Trager","authorsParsed":[["Reuel","Anka",""],["Bucknall","Ben",""],["Casper","Stephen",""],["Fist","Tim",""],["Soder","Lisa",""],["Aarne","Onni",""],["Hammond","Lewis",""],["Ibrahim","Lujain",""],["Chan","Alan",""],["Wills","Peter",""],["Anderljung","Markus",""],["Garfinkel","Ben",""],["Heim","Lennart",""],["Trask","Andrew",""],["Mukobi","Gabriel",""],["Schaeffer","Rylan",""],["Baker","Mauricio",""],["Hooker","Sara",""],["Solaiman","Irene",""],["Luccioni","Alexandra Sasha",""],["Rajkumar","Nitarshan",""],["Moës","Nicolas",""],["Ladish","Jeffrey",""],["Guha","Neel",""],["Newman","Jessica",""],["Bengio","Yoshua",""],["South","Tobin",""],["Pentland","Alex",""],["Koyejo","Sanmi",""],["Kochenderfer","Mykel J.",""],["Trager","Robert",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 21:13:56 GMT"}],"updateDate":"2024-07-23","timestamp":1721510036000,"abstract":"  AI progress is creating a growing range of risks and opportunities, but it is\noften unclear how they should be navigated. In many cases, the barriers and\nuncertainties faced are at least partly technical. Technical AI governance,\nreferring to technical analysis and tools for supporting the effective\ngovernance of AI, seeks to address such challenges. It can help to (a) identify\nareas where intervention is needed, (b) identify and assess the efficacy of\npotential governance actions, and (c) enhance governance options by designing\nmechanisms for enforcement, incentivization, or compliance. In this paper, we\nexplain what technical AI governance is, why it is important, and present a\ntaxonomy and incomplete catalog of its open problems. This paper is intended as\na resource for technical researchers or research funders looking to contribute\nto AI governance.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}