{"id":"2407.08772","title":"A Spectral Atlas of Lyman Alpha Emitters at z = 5.7 and z = 6.6","authors":"A. Songaila, L. L. Cowie, A. J. Barger, E. M. Hu, A. J. Taylor","authorsParsed":[["Songaila","A.",""],["Cowie","L. L.",""],["Barger","A. J.",""],["Hu","E. M.",""],["Taylor","A. J.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-15","timestamp":1720720800000,"abstract":"  We present two uniformly observed spectroscopic samples of Ly-alpha emitters\n(LAEs) (127 at z = 5.7 and 82 at z = 6.6), which we use to investigate the\nevolution of the LAE population at these redshifts. The observations cover a\nlarge field (44 sq. deg) in the North Ecliptic Pole (HEROES), as well as\nseveral smaller fields. We have a small number of exotic LAEs in the samples:\ndouble-peaked Ly-alpha profiles; very extended red wings; and one impressive\nlensed LAE cross. We also find three broad-line AGNs. We compare the Ly-alpha\nline width measurements at the two redshifts, finding that the lower-luminosity\nLAEs show a strong evolution of decreasing line width with increasing redshift,\nwhile the high-luminosity LAEs do not, with a transition luminosity of log\nL(Ly-alpha) = 43.25 erg s-1 . Thus, at z = 6.6, the high-luminosity LAEs may be\nproducing large ionized bubbles themselves, or they may be residing in\noverdense galaxy sites that are producing such bubbles. In order to avoid\nlosses in the red wing, the radius of the ionized bubble must be larger than 1\npMpc. The double-peaked LAEs also require transmission on the blue side. For\nthe four at z = 6.6, we use models to estimate the proximity radii, Ra , where\nthe ionizing flux of the galaxy is sufficient to make the surroundings have a\nlow enough neutral fraction to pass the blue light. Since the required Ra are\nlarge, multiple ionizing sources in the vicinity may be needed.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}