{"id":"2407.19248","title":"Mamba-UIE: Enhancing Underwater Images with Physical Model Constraint","authors":"Song Zhang, Yuqing Duan, Daoliang Li, Ran Zhao","authorsParsed":[["Zhang","Song",""],["Duan","Yuqing",""],["Li","Daoliang",""],["Zhao","Ran",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 13:22:10 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 07:20:53 GMT"}],"updateDate":"2024-08-01","timestamp":1722086530000,"abstract":"  In underwater image enhancement (UIE), convolutional neural networks (CNN)\nhave inherent limitations in modeling long-range dependencies and are less\neffective in recovering global features. While Transformers excel at modeling\nlong-range dependencies, their quadratic computational complexity with\nincreasing image resolution presents significant efficiency challenges.\nAdditionally, most supervised learning methods lack effective physical model\nconstraint, which can lead to insufficient realism and overfitting in generated\nimages. To address these issues, we propose a physical model constraint-based\nunderwater image enhancement framework, Mamba-UIE. Specifically, we decompose\nthe input image into four components: underwater scene radiance, direct\ntransmission map, backscatter transmission map, and global background light.\nThese components are reassembled according to the revised underwater image\nformation model, and the reconstruction consistency constraint is applied\nbetween the reconstructed image and the original image, thereby achieving\neffective physical constraint on the underwater image enhancement process. To\ntackle the quadratic computational complexity of Transformers when handling\nlong sequences, we introduce the Mamba-UIE network based on linear complexity\nstate space models. By incorporating the Mamba in Convolution block, long-range\ndependencies are modeled at both the channel and spatial levels, while the CNN\nbackbone is retained to recover local features and details. Extensive\nexperiments on three public datasets demonstrate that our proposed Mamba-UIE\noutperforms existing state-of-the-art methods, achieving a PSNR of 27.13 and an\nSSIM of 0.93 on the UIEB dataset. Our method is available at\nhttps://github.com/zhangsong1213/Mamba-UIE.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"Yl3nZx4KRgrnVn1aquptpM3wIDCNpeQ2N1PL6JbYj3M","pdfSize":"2334770"}
