{"id":"2407.16779","title":"Learning Networked Dynamical System Models with Weak Form and Graph\n  Neural Networks","authors":"Yin Yu, Daning Huang, Seho Park, Herschel C. Pangborn","authorsParsed":[["Yu","Yin",""],["Huang","Daning",""],["Park","Seho",""],["Pangborn","Herschel C.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 18:25:36 GMT"}],"updateDate":"2024-07-25","timestamp":1721759136000,"abstract":"  This paper presents a sequence of two approaches for the data-driven\ncontrol-oriented modeling of networked systems, i.e., the systems that involve\nmany interacting dynamical components. First, a novel deep learning approach\nnamed the weak Latent Dynamics Model (wLDM) is developed for learning generic\nnonlinear dynamics with control. Leveraging the weak form, the wLDM enables\nmore numerically stable and computationally efficient training as well as more\naccurate prediction, when compared to conventional methods such as neural\nordinary differential equations. Building upon the wLDM framework, we propose\nthe weak Graph Koopman Bilinear Form (wGKBF) model, which integrates geometric\ndeep learning and Koopman theory to learn latent space dynamics for networked\nsystems, especially for the challenging cases having multiple timescales. The\neffectiveness of the wLDM framework and wGKBF model are demonstrated on three\nexample systems of increasing complexity - a controlled double pendulum, the\nstiff Brusselator dynamics, and an electrified aircraft energy system. These\nnumerical examples show that the wLDM and wGKBF achieve superior predictive\naccuracy and training efficiency as compared to baseline models. Parametric\nstudies provide insights into the effects of hyperparameters in the weak form.\nThe proposed framework shows the capability to efficiently capture\ncontrol-dependent dynamics in these systems, including stiff dynamics and\nmulti-physics interactions, offering a promising direction for learning\ncontrol-oriented models of complex networked systems.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}