{"id":"2407.03006","title":"Frequency-Controlled Diffusion Model for Versatile Text-Guided\n  Image-to-Image Translation","authors":"Xiang Gao, Zhengbo Xu, Junhan Zhao, Jiaying Liu","authorsParsed":[["Gao","Xiang",""],["Xu","Zhengbo",""],["Zhao","Junhan",""],["Liu","Jiaying",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 11:05:19 GMT"}],"updateDate":"2024-07-04","timestamp":1720004719000,"abstract":"  Recently, large-scale text-to-image (T2I) diffusion models have emerged as a\npowerful tool for image-to-image translation (I2I), allowing open-domain image\ntranslation via user-provided text prompts. This paper proposes\nfrequency-controlled diffusion model (FCDiffusion), an end-to-end\ndiffusion-based framework that contributes a novel solution to text-guided I2I\nfrom a frequency-domain perspective. At the heart of our framework is a\nfeature-space frequency-domain filtering module based on Discrete Cosine\nTransform, which filters the latent features of the source image in the DCT\ndomain, yielding filtered image features bearing different DCT spectral bands\nas different control signals to the pre-trained Latent Diffusion Model. We\nreveal that control signals of different DCT spectral bands bridge the source\nimage and the T2I generated image in different correlations (e.g., style,\nstructure, layout, contour, etc.), and thus enable versatile I2I applications\nemphasizing different I2I correlations, including style-guided content\ncreation, image semantic manipulation, image scene translation, and image style\ntranslation. Different from related approaches, FCDiffusion establishes a\nunified text-guided I2I framework suitable for diverse image translation tasks\nsimply by switching among different frequency control branches at inference\ntime. The effectiveness and superiority of our method for text-guided I2I are\ndemonstrated with extensive experiments both qualitatively and quantitatively.\nThe code is publicly available at: https://github.com/XiangGao1102/FCDiffusion.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}