{"id":"2407.15113","title":"Robust Secure ISAC: How RSMA and Active RIS Manage Eavesdropper's\n  Spatial Uncertainty","authors":"A. Abdelaziz Salem, Saeed Abdallah, Mohamed Saad, Khawla Alnajjar, and\n  Mahmoud A. Albreem","authorsParsed":[["Salem","A. Abdelaziz",""],["Abdallah","Saeed",""],["Saad","Mohamed",""],["Alnajjar","Khawla",""],["Albreem","Mahmoud A.",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 10:44:46 GMT"}],"updateDate":"2024-07-23","timestamp":1721558686000,"abstract":"  Incorporating rate splitting multiple access (RSMA) into integrated sensing\nand communication (ISAC) presents a significant security challenge,\nparticularly in scenarios where the location of a potential eavesdropper (Eve)\nis unidentified. Splitting users' messages into common and private streams\nexposes them to eavesdropping, with the common stream dedicated for sensing and\naccessible to multiple users. In response to this challenge, this paper\nproposes a novel approach that leverages active reconfigurable intelligent\nsurface (RIS) aided beamforming and artificial noise (AN) to enhance the\nsecurity of RSMA-enabled ISAC. Specifically, we first derive the ergodic\nprivate secrecy rate (EPSR) based on mathematical approximation of the average\nEve channel gain. An optimization problem is then formulated to maximize the\nminimum EPSR, while satisfying the minimum required thresholds on ergodic\ncommon secrecy rate, radar sensing and RIS power budget. To address this\nnon-convex problem, a novel optimization strategy is developed, whereby we\nalternatively optimize the transmit beamforming matrix for the common and\nprivate streams, rate splitting, AN, RIS reflection coefficient matrix, and\nradar receive beamformer. Successive convex approximation (SCA) and\nMajorization-Minimization (MM) are employed to convexify the beamforming and\nRIS sub-problems. Simulations are conducted to showcase the effectiveness of\nthe proposed framework against established benchmarks.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}