{"id":"2407.13211","title":"Research on Image Super-Resolution Reconstruction Mechanism based on\n  Convolutional Neural Network","authors":"Hao Yan, Zixiang Wang, Zhengjia Xu, Zhuoyue Wang, Zhizhong Wu, Ranran\n  Lyu","authorsParsed":[["Yan","Hao",""],["Wang","Zixiang",""],["Xu","Zhengjia",""],["Wang","Zhuoyue",""],["Wu","Zhizhong",""],["Lyu","Ranran",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 06:50:39 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 03:07:49 GMT"}],"updateDate":"2024-08-02","timestamp":1721285439000,"abstract":"  Super-resolution reconstruction techniques entail the utilization of software\nalgorithms to transform one or more sets of low-resolution images captured from\nthe same scene into high-resolution images. In recent years, considerable\nadvancement has been observed in the domain of single-image super-resolution\nalgorithms, particularly those based on deep learning techniques. Nevertheless,\nthe extraction of image features and nonlinear mapping methods in the\nreconstruction process remain challenging for existing algorithms. These issues\nresult in the network architecture being unable to effectively utilize the\ndiverse range of information at different levels. The loss of high-frequency\ndetails is significant, and the final reconstructed image features are overly\nsmooth, with a lack of fine texture details. This negatively impacts the\nsubjective visual quality of the image. The objective is to recover\nhigh-quality, high-resolution images from low-resolution images. In this work,\nan enhanced deep convolutional neural network model is employed, comprising\nmultiple convolutional layers, each of which is configured with specific\nfilters and activation functions to effectively capture the diverse features of\nthe image. Furthermore, a residual learning strategy is employed to accelerate\ntraining and enhance the convergence of the network, while sub-pixel\nconvolutional layers are utilized to refine the high-frequency details and\ntextures of the image. The experimental analysis demonstrates the superior\nperformance of the proposed model on multiple public datasets when compared\nwith the traditional bicubic interpolation method and several other\nlearning-based super-resolution methods. Furthermore, it proves the model's\nefficacy in maintaining image edges and textures.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"U9JhqGalC7ulFzBmi0E-kKnZGUfKBkAcQGOhC0vFu7k","pdfSize":"1361628"}
