{"id":"2407.01544","title":"Decentralized Multi-Party Multi-Network AI for Global Deployment of 6G\n  Wireless Systems","authors":"Merim Dzaferagic, Marco Ruffini, Nina Slamnik-Krijestorac, Joao F.\n  Santos, Johann Marquez-Barja, Christos Tranoris, Spyros Denazis, Thomas\n  Kyriakakis, Panagiotis Karafotis, Luiz DaSilva, Shashi Raj Pandey, Junya\n  Shiraishi, Petar Popovski, Soren Kejser Jensen, Christian Thomsen, Torben\n  Bach Pedersen, Holger Claussen, Jinfeng Du, Gil Zussman, Tingjun Chen, Yiran\n  Chen, Seshu Tirupathi, Ivan Seskar, and Daniel Kilper","authorsParsed":[["Dzaferagic","Merim",""],["Ruffini","Marco",""],["Slamnik-Krijestorac","Nina",""],["Santos","Joao F.",""],["Marquez-Barja","Johann",""],["Tranoris","Christos",""],["Denazis","Spyros",""],["Kyriakakis","Thomas",""],["Karafotis","Panagiotis",""],["DaSilva","Luiz",""],["Pandey","Shashi Raj",""],["Shiraishi","Junya",""],["Popovski","Petar",""],["Jensen","Soren Kejser",""],["Thomsen","Christian",""],["Pedersen","Torben Bach",""],["Claussen","Holger",""],["Du","Jinfeng",""],["Zussman","Gil",""],["Chen","Tingjun",""],["Chen","Yiran",""],["Tirupathi","Seshu",""],["Seskar","Ivan",""],["Kilper","Daniel",""]],"versions":[{"version":"v1","created":"Mon, 15 Apr 2024 15:21:25 GMT"}],"updateDate":"2024-07-03","timestamp":1713194485000,"abstract":"  Multiple visions of 6G networks elicit Artificial Intelligence (AI) as a\ncentral, native element. When 6G systems are deployed at a large scale,\nend-to-end AI-based solutions will necessarily have to encompass both the radio\nand the fiber-optical domain. This paper introduces the Decentralized\nMulti-Party, Multi-Network AI (DMMAI) framework for integrating AI into 6G\nnetworks deployed at scale. DMMAI harmonizes AI-driven controls across diverse\nnetwork platforms and thus facilitates networks that autonomously configure,\nmonitor, and repair themselves. This is particularly crucial at the network\nedge, where advanced applications meet heightened functionality and security\ndemands. The radio/optical integration is vital due to the current\ncompartmentalization of AI research within these domains, which lacks a\ncomprehensive understanding of their interaction. Our approach explores\nmulti-network orchestration and AI control integration, filling a critical gap\nin standardized frameworks for AI-driven coordination in 6G networks. The DMMAI\nframework is a step towards a global standard for AI in 6G, aiming to establish\nreference use cases, data and model management methods, and benchmarking\nplatforms for future AI/ML solutions.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}