{"id":"2407.18991","title":"Searching for String Bosenovas with Gravitational Wave Detectors","authors":"Dawid Brzeminski, Anson Hook, Junwu Huang and Clayton Ristow","authorsParsed":[["Brzeminski","Dawid",""],["Hook","Anson",""],["Huang","Junwu",""],["Ristow","Clayton",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-30","timestamp":1721930401000,"abstract":"  We study the phenomenology of string bosenova explosions in vector\nsuperradiance clouds around spinning black holes, focusing on the observable\nconsequences in gravitational wave detectors and accelerometers. During the\ngrowth of the superradiance cloud, the dark gauge field might reach a critical\nfield strength, when a network of dark photon strings is produced via a\nsuperheated phase transition. These dark photon strings will then absorb the\nenergy in the background fields and get ejected from the cloud, with total\nenergy as large as the rotational energy of the black hole. In this paper, we\nstudy the subsequent evolution of this dense string network, and the resulting\nobservational consequences depending on the unknown string tension, or almost\nequivalently, the ratio between the quartic and the gauge coupling in the\nAbelian Higgs model. Strings with large tension will dissipate into\ngravitational waves, detectable over a wide range of frequencies, from $\\sim$\nnHz near supermassive black holes, to $\\gtrsim 10$ MHz around stellar mass\nblack holes. This is the first known source of high frequency gravitational\nwaves, unconstrained by cosmological observations. The strain of this\ngravitational wave can be larger than $10^{-14}$ at low frequencies, lasting\nfor longer than typical duration of experiments. Small tension strings, with\ntotal lengths in the network as large as $10^{40}$ km, can travel to the earth\nwith appreciable rate from any black hole in the Milky Way and interact with\nearth based accelerometers. If the Standard Model particles are directly\ncharged under the dark photon, e.g. B-L, this interaction leads to an\nacceleration of Standard Model particles that is independent of the coupling\nconstant. We work out the spectral density of this acceleration, and project\nthat modern accelerometers and equivalence principle tests can be sensitive to\nthe passing of these strings.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}