{"id":"2407.05899","title":"The accreted stellar haloes of Milky Way-mass galaxies as a probe of the\n  nature of the dark matter","authors":"Victor J. Forouhar Moreno, Azadeh Fattahi, Alis J. Deason, Fergus\n  Henstridge and Alejandro Ben\\'itez-Llambay","authorsParsed":[["Moreno","Victor J. Forouhar",""],["Fattahi","Azadeh",""],["Deason","Alis J.",""],["Henstridge","Fergus",""],["Benítez-Llambay","Alejandro",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 13:05:59 GMT"}],"updateDate":"2024-07-09","timestamp":1720443959000,"abstract":"  Galactic stellar haloes are largely composed of the remnants of galaxies\naccreted during the assembly of their host galaxies, and hence their properties\nreflect the mass spectrum and post-accretion evolution of their satellites. As\nthe nature of dark matter (DM) can affect both, we explore how the properties\nof the accreted stellar component vary across cold (CDM), warm (WDM) and\nself-interacting (SIDM) models. We do this by studying accreted stellar\npopulations around eight MW-mass haloes using cosmological hydrodynamical\nsimulations based on the EAGLE galaxy formation model, in which we find that\nthe accreted stellar mass remains similar across models. Contrary to WDM, which\nonly presents minor differences relative to CDM, the distribution of accreted\nstars in SIDM changes significantly within $0.05R_{200}$ ($10\\,\\mathrm{kpc}$).\nThe central density reduces to $\\langle \\rho^{\\mathrm{SIDM}}_{\\mathrm{exsitu}}\n/ \\rho^{\\mathrm{CDM}}_{\\mathrm{exsitu}} \\rangle = 0.3$ and has a shallower\nradial dependence, with logarithmic density slopes of $\\langle\n\\alpha_{\\mathrm{SIDM}} \\rangle = -1.4$ vs $\\langle \\alpha_{\\mathrm{CDM}}\n\\rangle = -1.7$. Additionally, stars are on more tangential orbits than their\nCDM counterparts, with a change in the velocity anisotropy of $\\langle \\Delta\n\\beta \\rangle = - 0.2$. Finally, SIDM stellar haloes have the largest number\nand prominence of overdensities in radius vs radial velocity space. This is due\nto a combination of shorter stellar halo progenitor merging timescales and\nshallower host potentials, with the former resulting in less time for dynamical\nfriction and radialisation to operate. In summary, we show that the phase-space\nstructure of Galactic stellar haloes encode key information that can be used to\ndistinguish and rule out different DM models.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}