{"id":"2407.06252","title":"Spontaneous CP Breaking in a QCD-like Theory","authors":"Csaba Cs\\'aki, Maximilian Ruhdorfer, Taewook Youn","authorsParsed":[["Csáki","Csaba",""],["Ruhdorfer","Maximilian",""],["Youn","Taewook",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-10","timestamp":1720461600000,"abstract":"  We examine the phase structure of a QCD-like theory at $\\bar\\theta =\\pi$\nobtained from supersymmetric $SU(N)$ QCD perturbed by a small amount of\nsupersymmetry breaking via anomaly mediation (AMSB QCD). The spectrum of this\ntheory matches that of QCD at the massless level, though the superpartners are\nnot decoupled. In this theory it is possible to nail down the phase structure\nat $\\bar\\theta=\\pi$ as a function of the quark masses and the number of flavors\n$F$. For one flavor we find that there is a critical quark mass, below which CP\nis unbroken, while above the critical mass CP is spontaneously broken. At the\ncritical mass there is a second-order phase transition along with a massless\n$\\eta'$. We are able to analytically solve for the minima and the critical mass\nfor $N=2,3$ as well as for the large $N$ limit, while for other $N$ one can\nfind numerical results. For two flavors, we find that CP is always broken as\nlong as the quark masses are equal and non-zero, however there is a non-trivial\nphase boundary for unequal quark masses, which we find numerically. For $F\\geq\n3$ we obtain an intricate phase boundary which reproduces the various quark\nmass limits. All our results are in agreement with the predictions for ordinary\nQCD that were based on anomaly matching arguments for generalized symmetries\nand the effective chiral Lagrangian. We also briefly comment on the domain wall\nsolutions first discussed by Draper, and are able to present analytic results\nfor the simplest case of $SU(2)$ with one flavor.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}