{"id":"2407.12087","title":"Black holes in effective loop quantum gravity: Covariant holonomy\n  modifications","authors":"Idrus Husin Belfaqih, Martin Bojowald, Suddhasattwa Brahma and Erick\n  I. Duque","authorsParsed":[["Belfaqih","Idrus Husin",""],["Bojowald","Martin",""],["Brahma","Suddhasattwa",""],["Duque","Erick I.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 18:00:03 GMT"}],"updateDate":"2024-07-18","timestamp":1721152803000,"abstract":"  Emergent modified gravity provides a covariant, effective framework for\nobtaining spherically symmetric black hole solutions in models of loop quantum\ngravity with scale-dependent holonomy modifications. Exact solutions for vacuum\nblack holes in the presence of a cosmological constant are derived here and\nanalyzed in four different gauges, explicitly related to one another by\nstandard coordinate transformations. The global structure is obtained by gluing\nspace-time regions corresponding to the gauge choices, reconstructing a\nnon-singular wormhole space-time for an arbitrary scale-dependent holonomy\nparameter. This outcome demonstrates the robustness of black-hole models with\ncovariant holonomy modifications under quantization ambiguities. Compared with\nprevious constructions, full covariance of the resulting space-time models as\nderived here implies subtle new effects and leads to a novel understanding of\nthe parameters in holonomy modifications, distinguishing a constant holonomy\nlength from a possibly scale-dependent function that may change coefficients of\nholonomy terms. New physical results are obtained for instance in the context\nof a non-trivial zero-mass limit of holonomy-modified space-times. The\nexistence of a consistent effective space-time structure implies various novel\naspects of a net gravitational stress-energy and related thermodynamical\nproperties.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uHsv_cvQECuDBLIpP0ikq7ZfOZClMvgPDlxxou_GmBI","pdfSize":"1405430"}
