{"id":"2407.06421","title":"Variational Quantum Algorithms for Combinatorial Optimization","authors":"Daniel F Perez-Ramirez","authorsParsed":[["Perez-Ramirez","Daniel F",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 22:02:39 GMT"}],"updateDate":"2024-07-10","timestamp":1720476159000,"abstract":"  The promise of quantum computing to address complex problems requiring high\ncomputational resources has long been hindered by the intrinsic and demanding\nrequirements of quantum hardware development. Nonetheless, the current state of\nquantum computing, denominated Noisy Intermediate-Scale Quantum (NISQ) era, has\nintroduced algorithms and methods that are able to harness the computational\npower of current quantum computers with advantages over classical computers\n(referred to as quantum advantage). Achieving quantum advantage is of\nparticular relevance for the combinatorial optimization domain, since it often\nimplies solving an NP-Hard optimization problem. Moreover, combinatorial\nproblems are highly relevant for practical application areas, such as\noperations research, or resource allocation problems. Among quantum computing\nmethods, Variational Quantum Algorithms (VQA) have emerged as one of the\nstrongest candidates towards reaching practical applicability of NISQ systems.\nThis paper explores the current state and recent developments of VQAs,\nemphasizing their applicability to combinatorial optimization. We identify the\nQuantum Approximate Optimization Algorithm (QAOA) as the leading candidate for\nthese problems. Furthermore, we implement QAOA circuits with varying depths to\nsolve the MaxCut problem on graphs with 10 and 20 nodes, demonstrating the\npotential and challenges of using VQAs in practical optimization tasks. We\nrelease our code, dataset and optimized circuit parameters under\nhttps://github.com/DanielFPerez/VQA-for-MaxCut.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Emerging Technologies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}