{"id":"2407.13169","title":"Combining Climate Models using Bayesian Regression Trees and Random\n  Paths","authors":"John C. Yannotty, Thomas J. Santner, Bo Li, Matthew T. Pratola","authorsParsed":[["Yannotty","John C.",""],["Santner","Thomas J.",""],["Li","Bo",""],["Pratola","Matthew T.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 05:16:32 GMT"}],"updateDate":"2024-07-19","timestamp":1721279792000,"abstract":"  Climate models, also known as general circulation models (GCMs), are\nessential tools for climate studies. Each climate model may have varying\naccuracy across the input domain, but no single model is uniformly better than\nthe others. One strategy to improving climate model prediction performance is\nto integrate multiple model outputs using input-dependent weights. Along with\nthis concept, weight functions modeled using Bayesian Additive Regression Trees\n(BART) were recently shown to be useful for integrating multiple Effective\nField Theories in nuclear physics applications. However, a restriction of this\napproach is that the weights could only be modeled as piecewise constant\nfunctions. To smoothly integrate multiple climate models, we propose a new\ntree-based model, Random Path BART (RPBART), that incorporates random path\nassignments into the BART model to produce smooth weight functions and smooth\npredictions of the physical system, all in a matrix-free formulation. The\nsmoothness feature of RPBART requires a more complex prior specification, for\nwhich we introduce a semivariogram to guide its hyperparameter selection. This\napproach is easy to interpret, computationally cheap, and avoids an expensive\ncross-validation study. Finally, we propose a posterior projection technique to\nenable detailed analysis of the fitted posterior weight functions. This allows\nus to identify a sparse set of climate models that can largely recover the\nunderlying system within a given spatial region as well as quantifying model\ndiscrepancy within the model set under consideration. Our method is\ndemonstrated on an ensemble of 8 GCMs modeling the average monthly surface\ntemperature.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}