{"id":"2407.01833","title":"Thermal Properties of Current Sheet Plasmas in Solar Flares","authors":"Tingyu Gou, Katharine K. Reeves","authorsParsed":[["Gou","Tingyu",""],["Reeves","Katharine K.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 22:16:02 GMT"}],"updateDate":"2024-07-03","timestamp":1719872162000,"abstract":"  The current sheet is an essential feature in solar flares and is the primary\nsite for magnetic reconnetion and energy release. Imaging observations feature\na long linear structure above the candle-flame-shaped flare loops, which\nresembles the standard flare model with the current sheet viewed edge-on. We\ninvestigate the thermal properties of plasmas surrounding the linear sheet\nduring flares, using EUV observations from the Atmospheric Imaging Assembly\n(AIA) onboard the Solar Dynamics Observatory (SDO). The differential emission\nmeasure (DEM) analyses show evidence of high temperatures in the plasma sheets\n(PSs), containing hot emissions from only a narrow temperature range,\nsuggestive of an isothermal feature. The sheet's temperature remains constant\nat different heights above the flare arcade, peaking at around logT=7.0-7.1;\nwhile the well-studied 2017 September 10 X8.2 flare exhibits as an exception in\nthat the temperature decreases with an increasing height and peaks higher\n(logT=7.25) during the gradual phase. Most PS cases also hold similar emission\nmeasures and thicknesses; while the PS's emissions drop exponentially above the\nflare arcade, the sheet thicknesses show no significant height association as\nfor all the measurements. The characteristics of isothermal and steady\ntemperature suggests balanced heating and cooling processes along the current\nsheet, particularly additional heating may exist to compensate for the\nconductive and radiative cooling away from the reconenction site. Our results\nsuggest a steady and uniform sheet structure in the macroscopic scale that\nresults from flare reconnection.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"FuqPfob6PL0Xnq973Y7PhqAlhca5Gq6KPweZ7g6BLqM","pdfSize":"46477791","objectId":"0x5ec7f3599d3e6c503bba09500573ff82216b2967a73d897cd0d945a668da8d58","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
