{"id":"2407.01699","title":"Resilience of the quantum critical line in the Schmid transition","authors":"Nicolas Paris, Luca Giacomelli, Romain Daviet, Cristiano Ciuti,\n  Nicolas Dupuis, and Christophe Mora","authorsParsed":[["Paris","Nicolas",""],["Giacomelli","Luca",""],["Daviet","Romain",""],["Ciuti","Cristiano",""],["Dupuis","Nicolas",""],["Mora","Christophe",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 18:12:51 GMT"}],"updateDate":"2024-07-03","timestamp":1719857571000,"abstract":"  Schmid predicted that a single Josephson junction coupled to a resistive\nenvironment undergoes a quantum phase transition to an insulating phase when\nthe shunt resistance $R$ exceeds the resistance quantum $h/(4 e^ 2)$. Recent\nmeasurements and theoretical studies have sparked a debate on whether the\nlocation of this transition depends on the ratio between the Josephson and the\ncharging energies. We employ a combination of multiple innovative analytical\nand numerical techniques, never before explicitly applied to this problem, to\ndecisively demonstrate that the transition line between superconducting and\ninsulating behavior is indeed independent of this energy ratio. First, we apply\nfield-theory renormalization group methods and find that the $\\beta$ function\nvanishes along the critical line up to the third order in the Josephson energy.\nWe then identify a simple fermionic model that precisely captures the\nlow-energy physics on the critical line, regardless of the energy ratio. This\nconformally invariant fermionic model is verified by comparing the expected\nspectrum with exact diagonalization calculations of the resistively shunted\nJosephson junction, showing excellent agreement even for moderate system sizes.\nImportantly, this identification provides a rigorous non-perturbative proof\nthat the transition line is maintained at $R=h/(4 e^ 2)$ for all ratios of\nJosephson to charging energies. The line is further resilient to other\nultraviolet cutoffs such as the plasma frequency of the resistive environment.\nFinally, we implement an adiabatic approach to validate the duality at large\nJosephson energy.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Superconductivity","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}