{"id":"2407.03158","title":"Predictability of viral load kinetics in the early phases of SARS-CoV-2\n  through a model-based approach","authors":"Andrea Bondesan, Antonio Piralla, Elena Ballante, Antonino Maria\n  Guglielmo Pitrolo, Silvia Figini, Fausto Baldanti, Mattia Zanella","authorsParsed":[["Bondesan","Andrea",""],["Piralla","Antonio",""],["Ballante","Elena",""],["Pitrolo","Antonino Maria Guglielmo",""],["Figini","Silvia",""],["Baldanti","Fausto",""],["Zanella","Mattia",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 14:34:43 GMT"}],"updateDate":"2024-07-04","timestamp":1720017283000,"abstract":"  A pipeline to evaluate the evolution of viral dynamics based on a new\nmodel-driven approach has been developed in the present study. The proposed\nmethods exploit real data and the multiscale structure of the infection\ndynamics to provide robust predictions of the epidemic dynamics. We focus on\nviral load kinetics whose dynamical features are typically available in the\nsymptomatic stage of the infection. Hence, the epidemiological evolution is\nobtained by relying on a compartmental approach characterized by a varying\ninfection rate to estimate early-stage viral load dynamics, of which few data\nare available. We test the proposed approach with real data of SARS-CoV-2 viral\nload kinetics collected from patients living in an Italian province. The\nconsidered database refers to early-phase infections, whose viral load kinetics\nare not affected by mass vaccination policies in Italy. Our contribution is\ndevoted to provide an effective computational pipeline to evaluate in real time\nthe evolution of infectivity. Comprehending the factors influencing the in-host\nviral dynamics represents a fundamental tool to provide robust public health\nstrategies. This pilot study could be implemented in further investigations\ninvolving other respiratory viruses, to better clarify the process of viral\ndynamics as a preparatory action for future pandemics.\n","subjects":["Quantitative Biology/Populations and Evolution","Nonlinear Sciences/Adaptation and Self-Organizing Systems","Physics/Biological Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}