{"id":"2407.18873","title":"Absence of gapless Majorana edge modes in few-leg bosonic flux ladders","authors":"Felix A. Palm, C\\'ecile Repellin, Nathan Goldman, Fabian Grusdt","authorsParsed":[["Palm","Felix A.",""],["Repellin","Cécile",""],["Goldman","Nathan",""],["Grusdt","Fabian",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:06:25 GMT"}],"updateDate":"2024-07-29","timestamp":1722013585000,"abstract":"  The search for Majorana excitations has seen tremendous efforts in recent\nyears, ultimately aiming for their individual controllability in future\ntopological quantum computers. A promising framework to realize such exotic\nMajorana fermions are topologically ordered non-Abelian phases of matter, such\nas certain fractional quantum Hall states. Quantum simulators provide\nunprecedented controllability and versatility to investigate such states, and\ndeveloping experimentally feasible schemes to realize and identify them is of\nimmediate relevance. Motivated by recent experiments, we consider bosons on\ncoupled chains, subjected to a magnetic flux and experiencing Hubbard\nrepulsion. At magnetic filling factor $\\nu=1$, similar systems on cylinders\nhave been found to host the non-Abelian Moore-Read Pfaffian state in the bulk.\nHere, we address the question whether more realistic few-leg ladders can host\nthis exotic state and its chiral Majorana edge states. To this end, we perform\nextensive DMRG simulations and determine the central charge of the ground\nstate. While we do not find any evidence of gapless Majorana edge modes in\nsystems of up to six legs, exact diagonalization of small systems reveals\nevidence for the Pfaffian state in the entanglement structure. By\nsystematically varying the number of legs and monitoring the appearance and\ndisappearance of this signal, our work highlights the importance of finite-size\neffects for the realization of exotic states in experimentally realistic\nsystems.\n","subjects":["Condensed Matter/Quantum Gases","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}