{"id":"2407.04684","title":"Investigating the Mass of the Black Hole and Possible Wind Outflow of\n  the Accretion Disk in the Tidal Disruption Event AT2021ehb","authors":"Xin Xiang, Jon M. Miller, Abderahmen Zoghbi, Mark T. Reynolds, David\n  Bogensberger, Lixin Dai, Paul A. Draghis, Jeremy J. Drake, Olivier Godet,\n  Jimmy A. Irwin, Michael C. Miller, Brenna E. Mockler, Richard Saxton, Natalie\n  Webb","authorsParsed":[["Xiang","Xin",""],["Miller","Jon M.",""],["Zoghbi","Abderahmen",""],["Reynolds","Mark T.",""],["Bogensberger","David",""],["Dai","Lixin",""],["Draghis","Paul A.",""],["Drake","Jeremy J.",""],["Godet","Olivier",""],["Irwin","Jimmy A.",""],["Miller","Michael C.",""],["Mockler","Brenna E.",""],["Saxton","Richard",""],["Webb","Natalie",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 17:45:15 GMT"}],"updateDate":"2024-07-08","timestamp":1720201515000,"abstract":"  Tidal disruption events (TDEs) can potentially probe low-mass black holes in\nhost galaxies that might not adhere to bulge or stellar-dispersion\nrelationships. At least initially, TDEs can also reveal super-Eddington\naccretion. X-ray spectroscopy can potentially constrain black hole masses, and\nreveal ionized outflows associated with super-Eddington accretion. Our analysis\nof XMM-Newton X-ray observations of the TDE AT2021ehb, around 300 days\npost-disruption, reveals a soft spectrum and can be fit with a combination of\nmulti-color disk blackbody and power-law components. Using two independent disk\nmodels with properties suited to TDEs, we estimate a black hole mass at $M\n\\simeq 10^{5.5}~M_{\\odot}$, indicating AT2021ehb may expose the elusive\nlow-mass end of the nuclear black hole population. These models offer simple\nyet robust characterization; more complicated models are not required, but\nprovide important context and caveats in the limit of moderately sensitive\ndata. If disk reflection is included, the disk flux is lower and inferred black\nhole masses are $\\sim$ 0.35 dex higher. Simple wind formulations imply an\nextremely fast $v_{\\mathrm{out}} = -0.2~c$ outflow and obviate a disk continuum\ncomponent. Assuming a unity filling factor, such a wind implies an\ninstantaneous mass outflow rate of $\\dot{M} \\simeq 5~M_{\\odot}~{\\rm yr}^{-1}$.\nSuch a high rate suggests that the filling factor for the Ultra Fast Outflow\n(UFO) must be extremely low, and/or the UFO phase is ephemeral. We discuss the\nstrengths and limitations of our analysis and avenues for future observations\nof TDEs.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}