{"id":"2407.03130","title":"Towards Efficient Pixel Labeling for Industrial Anomaly Detection and\n  Localization","authors":"Hanxi Li, Jingqi Wu, Lin Yuanbo Wu, Hao Chen, Deyin Liu, Chunhua Shen","authorsParsed":[["Li","Hanxi",""],["Wu","Jingqi",""],["Wu","Lin Yuanbo",""],["Chen","Hao",""],["Liu","Deyin",""],["Shen","Chunhua",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 14:12:43 GMT"},{"version":"v2","created":"Thu, 4 Jul 2024 06:28:05 GMT"}],"updateDate":"2024-07-08","timestamp":1720015963000,"abstract":"  In the realm of practical Anomaly Detection (AD) tasks, manual labeling of\nanomalous pixels proves to be a costly endeavor. Consequently, many AD methods\nare crafted as one-class classifiers, tailored for training sets completely\ndevoid of anomalies, ensuring a more cost-effective approach. While some\npioneering work has demonstrated heightened AD accuracy by incorporating real\nanomaly samples in training, this enhancement comes at the price of\nlabor-intensive labeling processes. This paper strikes the balance between AD\naccuracy and labeling expenses by introducing ADClick, a novel Interactive\nImage Segmentation (IIS) algorithm. ADClick efficiently generates\n\"ground-truth\" anomaly masks for real defective images, leveraging innovative\nresidual features and meticulously crafted language prompts. Notably, ADClick\nshowcases a significantly elevated generalization capacity compared to existing\nstate-of-the-art IIS approaches. Functioning as an anomaly labeling tool,\nADClick generates high-quality anomaly labels (AP $= 94.1\\%$ on MVTec AD) based\non only $3$ to $5$ manual click annotations per training image. Furthermore, we\nextend the capabilities of ADClick into ADClick-Seg, an enhanced model designed\nfor anomaly detection and localization. By fine-tuning the ADClick-Seg model\nusing the weak labels inferred by ADClick, we establish the state-of-the-art\nperformances in supervised AD tasks (AP $= 86.4\\%$ on MVTec AD and AP $=\n78.4\\%$, PRO $= 98.6\\%$ on KSDD2).\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}