{"id":"2407.03873","title":"Parallel-in-time solution of hyperbolic PDE systems via\n  characteristic-variable block preconditioning","authors":"H. De Sterck, R. D. Falgout, O. A. Krzysik, J. B. Schroder","authorsParsed":[["De Sterck","H.",""],["Falgout","R. D.",""],["Krzysik","O. A.",""],["Schroder","J. B.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 12:10:53 GMT"}],"updateDate":"2024-07-08","timestamp":1720095053000,"abstract":"  We consider the parallel-in-time solution of hyperbolic partial differential\nequation (PDE) systems in one spatial dimension, both linear and nonlinear. In\nthe nonlinear setting, the discretized equations are solved with a\npreconditioned residual iteration based on a global linearization. The\nlinear(ized) equation systems are approximately solved parallel-in-time using a\nblock preconditioner applied in the characteristic variables of the underlying\nlinear(ized) hyperbolic PDE. This change of variables is motivated by the\nobservation that inter-variable coupling for characteristic variables is weak\nrelative to intra-variable coupling, at least locally where spatio-temporal\nvariations in the eigenvectors of the associated flux Jacobian are sufficiently\nsmall. For an $\\ell$-dimensional system of PDEs, applying the preconditioner\nconsists of solving a sequence of $\\ell$ scalar linear(ized)-advection-like\nproblems, each being associated with a different characteristic wave-speed in\nthe underlying linear(ized) PDE. We approximately solve these linear advection\nproblems using multigrid reduction-in-time (MGRIT); however, any other suitable\nparallel-in-time method could be used. Numerical examples are shown for the\n(linear) acoustics equations in heterogeneous media, and for the (nonlinear)\nshallow water equations and Euler equations of gas dynamics with shocks and\nrarefactions.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}