{"id":"2407.20669","title":"A Tutorial on the Use of Physics-Informed Neural Networks to Compute the\n  Spectrum of Quantum Systems","authors":"Lorenzo Brevi, Antonio Mandarino, Enrico Prati","authorsParsed":[["Brevi","Lorenzo",""],["Mandarino","Antonio",""],["Prati","Enrico",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 09:07:03 GMT"},{"version":"v2","created":"Wed, 11 Sep 2024 11:08:12 GMT"}],"updateDate":"2024-09-12","timestamp":1722330423000,"abstract":"  Quantum many-body systems are of great interest for many research areas,\nincluding physics, biology and chemistry. However, their simulation is\nextremely challenging, due to the exponential growth of the Hilbert space with\nthe system size, making it exceedingly difficult to parameterize the wave\nfunctions of large systems by using exact methods. Neural networks and machine\nlearning in general are a way to face this challenge. For instance, methods\nlike Tensor networks and Neural Quantum States are being investigated as\npromising tools to obtain the wave function of a quantum mechanical system. In\nthis tutorial, we focus on a particularly promising class of deep learning\nalgorithms. We explain how to construct a Physics-Informed Neural Network\n(PINN) able to solve the Schr\\\"odinger equation for a given potential, by\nfinding its eigenvalues and eigenfunctions. This technique is unsupervised, and\nutilizes a novel computational method in a manner that is barely explored.\nPINNs are a deep learning method that exploits Automatic Differentiation to\nsolve Integro-Differential Equations in a mesh-free way. We show how to find\nboth the ground and the excited states. The method discovers the states\nprogressively by starting from the ground state. We explain how to introduce\ninductive biases in the loss to exploit further knowledge of the physical\nsystem. Such additional constraints allow for a faster and more accurate\nconvergence. This technique can then be enhanced by a smart choice of\ncollocation points in order to take advantage of the mesh-free nature of the\nPINN. The methods are made explicit by applying them to the infinite potential\nwell and the particle in a ring, a challenging problem to be learned by an\nArtificial Intelligence agent due to the presence of complex-valued\neigenfunctions and degenerate states.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}