{"id":"2407.03740","title":"Testing a non-local 1-equation turbulent convection model: A solar model","authors":"T. A. M. Braun (1 and 2), F. Ahlborn (3), A. Weiss (1 and 2) ((1)\n  Max-Planck-Institut f\\\"ur Astrophysik, Garching, Germany, (2)\n  Ludwig-Maximillians-Universit\\\"at M\\\"unchen, Munich, Germany, (3)\n  Heidelberger Institut f\\\"ur Theoretische Studien, Heidelberg, Germany)","authorsParsed":[["Braun","T. A. M.","","1 and 2"],["Ahlborn","F.","","1 and 2"],["Weiss","A.","","1 and 2"]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 08:48:46 GMT"}],"updateDate":"2024-07-08","timestamp":1720082926000,"abstract":"  Turbulent convection models treat stellar convection more physically than\nstandard mixing-length theory by including non-local effects. We recently\nsuccessfully applied the Kuhfuss version to convective cores in main sequence\nstars. Its usefulness for convective envelopes remains to be tested. The solar\nconvective envelope constitutes a viable test bed for investigating the\nusefulness of the 1-equation Kuhfuss turbulent convection model. We used the\none-dimensional stellar evolution code GARSTEC to calculate a standard solar\nmodel with the 1-equation Kuhfuss turbulent convection model, and compared it\nto helioseismic measurements and a solar model using standard mixing-length\ntheory. Additionally, we investigated the influence of the additional free\nparameters of the convection model on the solar structure. The 1-equation\nKuhfuss model reproduces the sound-speed profile and the lower boundary of the\nconvective region less well than the mixing-length model, because the inherent\nnon-local effects overestimate the amount of convective penetration below the\nSchwarzschild boundary. We trace this back to the coupling of the temperature\ngradient to the convective flux in the 1-equation version of the Kuhfuss\ntheory. The temperature stratification of the solar convective envelope is not\nwell modelled by the 1-equation Kuhfuss turbulent convection model, and the\nmore complex 3-equation version is needed to improve the modelling of\nconvection in the envelopes of 1D stellar evolution models.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}