{"id":"2407.09398","title":"6G: The Intelligent Network of Everything -- A Comprehensive Vision,\n  Survey, and Tutorial","authors":"Harri Pennanen, Tuomo H\\\"anninen, Oskari Tervo, Antti T\\\"olli, Matti\n  Latva-aho","authorsParsed":[["Pennanen","Harri",""],["Hänninen","Tuomo",""],["Tervo","Oskari",""],["Tölli","Antti",""],["Latva-aho","Matti",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 16:19:38 GMT"},{"version":"v2","created":"Sun, 21 Jul 2024 04:45:08 GMT"}],"updateDate":"2024-07-23","timestamp":1720801178000,"abstract":"  The global 6G vision has taken its shape after years of international\nresearch and development efforts. This work culminated in ITU-R's\nRecommendation on \"IMT-2030 Framework\". While the definition phase of\ntechnological requirements is currently ongoing, 3GPP's standardization process\non 6G networks is expected to start in 2025 and worldwide commercialization\naround 2030. This article serves as a comprehensive guide to 6G by providing an\noverall vision, a contemporary survey of the main literature, and an\ninformative tutorial-type presentation style. In our vision, 6G will be based\non three fundamental elements: wireless, artificial intelligence (AI), and the\nInternet of Everything (IoE). Consequently, 6G can ultimately become the\nIntelligent Network of Everything while serving as an enabling platform for the\nnext major disruption in mobile communication, called mobile intelligence. The\npotential of mobile intelligence is that anything can be made connected,\nintelligent, and aware of its environment. This will revolutionize the way how\ndevices, systems, and applications are designed; how they operate and interact\nwith humans and each other; and how they can be used for the benefit of people,\nsociety, and the world in general. After high-level visioning, the main details\nof 6G are discussed, including fundamental elements, disruptive applications,\nkey use cases, main performance requirements, potential technologies, and\ndefining features. A special focus is given to a comprehensive set of potential\n6G technologies, each of which is introduced in a tutorial manner. Finally, we\nspeculate on what comes after 6G and sketch the first high-level vision of 7G.\nAll in all, the objective of this article is to provide a thorough guide to 6G\nin order to serve as a source of knowledge and inspiration for further research\nand development work in academia, industry, and standardization bodies.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}