{"id":"2407.09669","title":"The Simons Observatory: Dark Characterization of the Large Aperture\n  Telescope","authors":"Saianeesh K. Haridas, Zeeshan Ahmed, Tanay Bhandarkar, Mark Devlin,\n  Simon Dicker, Shannon M. Duff, Daniel Dutcher, Kathleen Harrington, Shawn W.\n  Henderson, Johannes Hubmayr, Bradley R. Johnson, Anna Kofman, Alex Manduca,\n  Michael D. Niemack, Michael J. Randall, Thomas P. Satterthwaite, John\n  Orlowski-Scherer, Benjamin L. Schmitt, Carlos Sierra, Max Silva-Feaver,\n  Robert J. Thornton, Yuhan Wang, and Kaiwen Zheng","authorsParsed":[["Haridas","Saianeesh K.",""],["Ahmed","Zeeshan",""],["Bhandarkar","Tanay",""],["Devlin","Mark",""],["Dicker","Simon",""],["Duff","Shannon M.",""],["Dutcher","Daniel",""],["Harrington","Kathleen",""],["Henderson","Shawn W.",""],["Hubmayr","Johannes",""],["Johnson","Bradley R.",""],["Kofman","Anna",""],["Manduca","Alex",""],["Niemack","Michael D.",""],["Randall","Michael J.",""],["Satterthwaite","Thomas P.",""],["Orlowski-Scherer","John",""],["Schmitt","Benjamin L.",""],["Sierra","Carlos",""],["Silva-Feaver","Max",""],["Thornton","Robert J.",""],["Wang","Yuhan",""],["Zheng","Kaiwen",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 20:07:12 GMT"}],"updateDate":"2024-07-16","timestamp":1720814832000,"abstract":"  The Simons Observatory (SO) is a cosmic microwave background experiment\ncomposed of three 0.42 m Small Aperture Telescopes (SATs) and one 6 m Large\nAperture Telescope (LAT) in the Atacama Desert of Chile. The Large Aperture\nTelescope Receiver (LATR) was integrated into the LAT in August 2023; however,\nbecause mirrors were not yet installed, the LATR optical chain was capped at\nthe 4K stage. In this dark configuration we are able to characterize many\nelements of the instrument without contributions from atmospheric noise. Here\nwe show this noise is below the required upper limit and its features are well\ndescribed with a simple noise model. Maps produced using this noise model have\nproperties that are in good agreement with the white noise levels of our dark\ndata. Additionally, we show that our nominal scan strategy has a minimal effect\non the noise when compared to the noise when the telescope is stationary\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}