{"id":"2407.07857","title":"Functional Assessment of Cerebral Capillaries using Single Capillary\n  Reporters in Ultrasound Localization Microscopy","authors":"Stephen A Lee, Alexis Leconte, Alice Wu, Joshua Kinugasa, Jonathan\n  Poree, Andreas Linninger, Jean Provost","authorsParsed":[["Lee","Stephen A",""],["Leconte","Alexis",""],["Wu","Alice",""],["Kinugasa","Joshua",""],["Poree","Jonathan",""],["Linninger","Andreas",""],["Provost","Jean",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 17:20:54 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 02:21:18 GMT"}],"updateDate":"2024-07-12","timestamp":1720632054000,"abstract":"  The brain's microvascular cerebral capillary network plays a vital role in\nmaintaining neuronal health, yet capillary dynamics are still not well\nunderstood due to limitations in existing imaging techniques. Here, we present\nSingle Capillary Reporters (SCaRe) for transcranial Ultrasound Localization\nMicroscopy (ULM), a novel approach enabling non-invasive, whole-brain mapping\nof single capillaries and estimates of their transit-time as a neurovascular\nbiomarker. We accomplish this first through computational Monte Carlo and\nultrasound simulations of microbubbles flowing through a fully-connected\ncapillary network. We unveil distinct capillary flow behaviors which informs\nmethodological changes to ULM acquisitions to better capture capillaries in\nvivo. Subsequently, applying SCaRe-ULM in vivo, we achieve unprecedented\nvisualization of single capillary tracks across brain regions, analysis of\nlayer-specific capillary heterogeneous transit times (CHT), and\ncharacterization of whole microbubble trajectories from arterioles to venules.\nLastly, we evaluate capillary biomarkers using injected lipopolysaccharide to\ninduce systemic neuroinflammation and track the increase in SCaRe-ULM CHT,\ndemonstrating the capability to detect subtle capillary functional changes.\nSCaRe-ULM represents a significant advance in studying microvascular dynamics,\noffering novel avenues for investigating capillary patterns in neurological\ndisorders and potential diagnostic applications.\n","subjects":["Physics/Medical Physics","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lw_YeW_osm47-nZjQeu_Pkuv5kaNAHPqBFsMjZzKdus","pdfSize":"25383312"}
