{"id":"2407.09385","title":"Cost-optimized probabilistic maintenance for condition monitoring of\n  wind turbines with rare failures","authors":"Viktor Begun, Ulrich Schlickewei","authorsParsed":[["Begun","Viktor",""],["Schlickewei","Ulrich",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 16:06:07 GMT"}],"updateDate":"2024-07-15","timestamp":1720800367000,"abstract":"  We propose a method, a model, and a form of presenting model results for\ncondition monitoring of a small set of wind turbines with rare failures. The\nmain new ingredient of the method is to sample failure thresholds according to\nthe profit they give to an operating company. The model is a multiple linear\nregression with seasonal components and external regressors, representing all\nsensor components except for the considered one. To overcome the scarcity of\nthe training data, we use the median sensor values from all available turbines\nin their healthy state. The cumulated deviation from the normal behavior model\nobtained for this median turbine is calibrated for each turbine at the\nbeginning of the test period and after known failures. The proposed form of\npresenting results is to set a scale for possible costs, control for random\nmaintenance, and show a whole distribution of costs depending on the free model\nparameters. We make a case study on an open dataset with SCADA data from\nmultiple sensors and show that considering the influence of turbine components\nis more critical than seasonality. The distribution, the average, and the\nstandard deviation of maintenance costs can be very different for similar\nminimal costs. Random maintenance can be more profitable than reactive\nmaintenance and other approaches. Our predictive maintenance model outperforms\nrandom maintenance and competitors for the whole set of considered turbines,\ngiving substantial savings.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sHqCBetML735DALEZaqDzmov4FyFr9guudW7lADYzLo","pdfSize":"1488771"}
