{"id":"2407.00008","title":"Spectral Brain Graph Neural Network for Prediction of Anxiety in\n  Children with Autism Spectrum Disorder","authors":"Peiyu Duan, Nicha C. Dvornek, Jiyao Wang, Jeffrey Eilbott, Yuexi Du,\n  Denis G. Sukhodolsky, James S. Duncan","authorsParsed":[["Duan","Peiyu",""],["Dvornek","Nicha C.",""],["Wang","Jiyao",""],["Eilbott","Jeffrey",""],["Du","Yuexi",""],["Sukhodolsky","Denis G.",""],["Duncan","James S.",""]],"versions":[{"version":"v1","created":"Tue, 23 Apr 2024 19:32:34 GMT"}],"updateDate":"2024-07-02","timestamp":1713900754000,"abstract":"  Children with Autism Spectrum Disorder (ASD) frequently exhibit comorbid\nanxiety, which contributes to impairment and requires treatment. Therefore, it\nis critical to investigate co-occurring autism and anxiety with functional\nimaging tools to understand the brain mechanisms of this comorbidity.\nMultidimensional Anxiety Scale for Children, 2nd edition (MASC-2) score is a\ncommon tool to evaluate the daily anxiety level in autistic children.\nPredicting MASC-2 score with Functional Magnetic Resonance Imaging (fMRI) data\nwill help gain more insights into the brain functional networks of children\nwith ASD complicated by anxiety. However, most of the current graph neural\nnetwork (GNN) studies using fMRI only focus on graph operations but ignore the\nspectral features. In this paper, we explored the feasibility of using spectral\nfeatures to predict the MASC-2 total scores. We proposed SpectBGNN, a\ngraph-based network, which uses spectral features and integrates graph spectral\nfiltering layers to extract hidden information. We experimented with multiple\nspectral analysis algorithms and compared the performance of the SpectBGNN\nmodel with CPM, GAT, and BrainGNN on a dataset consisting of 26 typically\ndeveloping and 70 ASD children with 5-fold cross-validation. We showed that\namong all spectral analysis algorithms tested, using the Fast Fourier Transform\n(FFT) or Welch's Power Spectrum Density (PSD) as node features performs\nsignificantly better than correlation features, and adding the graph spectral\nfiltering layer significantly increases the network's performance.\n","subjects":["Quantitative Biology/Neurons and Cognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"6ij-cQ9paTC77sWuAucKbf56OZpivBWbE1CrOHjQY4c","pdfSize":"521443"}
