{"id":"2407.09725","title":"Lattice-guided growth of dense arrays of aligned transition metal\n  dichalcogenide nanoribbons with high catalytic reactivity","authors":"Zongpeng Ma, Pablo Sol\\'is-Fern\\'andez, Kaito Hirata, Yung-Chang Lin,\n  Keisuke Shinokita, Mina Maruyama, Kota Honda, Tatsuki Kato, Aika Uchida,\n  Hiroto Ogura, Tomohiro Otsuka, Masahiro Hara, Kazunari Matsuda, Kazu Suenaga,\n  Susumu Okada, Toshiaki Kato, Yasufumi Takahashi, Hiroki Ago","authorsParsed":[["Ma","Zongpeng",""],["Solís-Fernández","Pablo",""],["Hirata","Kaito",""],["Lin","Yung-Chang",""],["Shinokita","Keisuke",""],["Maruyama","Mina",""],["Honda","Kota",""],["Kato","Tatsuki",""],["Uchida","Aika",""],["Ogura","Hiroto",""],["Otsuka","Tomohiro",""],["Hara","Masahiro",""],["Matsuda","Kazunari",""],["Suenaga","Kazu",""],["Okada","Susumu",""],["Kato","Toshiaki",""],["Takahashi","Yasufumi",""],["Ago","Hiroki",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 00:13:44 GMT"}],"updateDate":"2024-07-16","timestamp":1720829624000,"abstract":"  Transition metal dichalcogenides (TMDs) exhibit unique properties and\npotential applications when reduced to one-dimensional (1D) nanoribbons (NRs),\nowing to quantum confinement and high edge densities. However, effective growth\nmethods for self-aligned TMD NRs are still lacking. We demonstrate a versatile\napproach for the lattice-guided growth of dense, aligned TMD NR arrays via\nchemical vapor deposition (CVD) on anisotropic sapphire substrates, without the\nneed for tailored surface steps. This method enables the synthesis of NRs with\nwidths below 10 nm, with their longitudinal axis parallel to the zigzag\ndirection. The growth is influenced by both the substrate and CVD temperature,\nindicating the role of anisotropic precursor diffusion and substrate\ninteraction. The 1D nature of the NRs was asserted by the observation of\nCoulomb blockade at low temperature. Pronounced catalytic activity was observed\nat the edges of the NRs, indicating their promise for efficient catalysis.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}