{"id":"2407.05081","title":"Isomer production studied with simultaneous decay curve analysis for\n  alpha-particle induced reactions on natural platinum up to 29 MeV","authors":"Naohiko Otuka, Sandor Takacs, Masayuki Aikawa, Shuichiro Ebata,\n  Hiromitsu Haba","authorsParsed":[["Otuka","Naohiko",""],["Takacs","Sandor",""],["Aikawa","Masayuki",""],["Ebata","Shuichiro",""],["Haba","Hiromitsu",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 13:53:43 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 05:36:27 GMT"},{"version":"v3","created":"Wed, 31 Jul 2024 15:18:46 GMT"},{"version":"v4","created":"Thu, 1 Aug 2024 02:08:37 GMT"}],"updateDate":"2024-08-02","timestamp":1720274023000,"abstract":"  The isomeric ratios of $^{198}$Au, $^{197}$Hg and $^{195}$Hg produced by\n$\\alpha$-particle induced reactions on natural platinum were investigated\nexperimentally up to 29 MeV by using the standard stacked foil activation\ntechnique and $\\gamma$-ray spectrometry. The isomeric ratios of $^{197}$Hg and\n$^{195}$Hg determined by the conventional activation cross section formula\nshowed strong cooling time dependence. The time dependence was resolved by\nadjusting the isomeric transition branching ratios for the two isotopes within\na simultaneous decay curve analysis framework. Our analysis suggests\n94.5$\\pm$0.7% and 48.9$\\pm$1.8% as the isomeric transition branching ratios of\n$^{197m}$Hg (24 h) and $^{195m}$Hg (42 h), respectively. The isomeric ratios\nand independent production cross sections of $^{198}$Au, $^{197}$Hg, $^{195}$Hg\nand some other Hg, Au and Pt isotopes were also measured down to 6 MeV with\nthese corrected isomeric transition branching ratios, and compared with\npredictions of statistical and pre-equilibrium models by TALYS-2.0 to discuss\nspin cuto? parameter dependence. We found the measured isomeric ratios are\nbetter predicted if we reduce the spin cuto? parameter to half or less from\nthat estimated with the rigid body moment of inertia.\n","subjects":["Physics/Nuclear Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/"}