{"id":"2407.18593","title":"Content-driven Magnitude-Derivative Spectrum Complementary Learning for\n  Hyperspectral Image Classification","authors":"Huiyan Bai, Tingfa Xu, Huan Chen, Peifu Liu, Jianan Li","authorsParsed":[["Bai","Huiyan",""],["Xu","Tingfa",""],["Chen","Huan",""],["Liu","Peifu",""],["Li","Jianan",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 08:28:53 GMT"}],"updateDate":"2024-07-29","timestamp":1721982533000,"abstract":"  Extracting discriminative information from complex spectral details in\nhyperspectral image (HSI) for HSI classification is pivotal. While current\nprevailing methods rely on spectral magnitude features, they could cause\nconfusion in certain classes, resulting in misclassification and decreased\naccuracy. We find that the derivative spectrum proves more adept at capturing\nconcealed information, thereby offering a distinct advantage in separating\nthese confusion classes. Leveraging the complementarity between spectral\nmagnitude and derivative features, we propose a Content-driven Spectrum\nComplementary Network based on Magnitude-Derivative Dual Encoder, employing\nthese two features as combined inputs. To fully utilize their complementary\ninformation, we raise a Content-adaptive Point-wise Fusion Module, enabling\nadaptive fusion of dual-encoder features in a point-wise selective manner,\ncontingent upon feature representation. To preserve a rich source of\ncomplementary information while extracting more distinguishable features, we\nintroduce a Hybrid Disparity-enhancing Loss that enhances the differential\nexpression of the features from the two branches and increases the inter-class\ndistance. As a result, our method achieves state-of-the-art results on the\nextensive WHU-OHS dataset and eight other benchmark datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}