{"id":"2407.01398","title":"New Radiative and Collisional Atomic Data for Sr {\\sc ii} and Y {\\sc ii}\n  with application to Kilonova modelling","authors":"Leo Mulholland, Niall McElroy, Fiona McNeill, Stuart Sim, Connor\n  Ballance, Catherine Ramsbottom","authorsParsed":[["Mulholland","Leo",""],["McElroy","Niall",""],["McNeill","Fiona",""],["Sim","Stuart",""],["Ballance","Connor",""],["Ramsbottom","Catherine",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 15:49:17 GMT"}],"updateDate":"2024-07-02","timestamp":1719848957000,"abstract":"  The spectra of singly ionised Strontium and Yttrium (Sr {\\sc ii} and Y {\\sc\nii}) have been proposed as identifications of certain spectral features in the\nAT2017gfo spectrum. With the growing demand for NLTE simulations of Kilonovae,\nthere is a increasing need for atomic data for these and other $r$-process\nelements. Our goal is to expand upon the current set of atomic data for\n$r$-process elements, by presenting transition probabilities and\nMaxwellian-averaged effective collision strengths for Sr {\\sc ii} and Y {\\sc\nii}. The Breit-Pauli and DARC $R$-matrix codes are employed to calculate the\nappropriate collision strengths, which are thermally averaged according to a\nMaxwellian distribution to calculate excitation and de-excitation rates. The\n{\\sc tardis} and {\\sc ColRadPy} packages are subsequently used to perform LTE\nand NLTE modelling respectively. A complete set of transition probabilities and\neffective collision strengths involving levels for Sr {\\sc ii} and Y {\\sc ii}\nhave been calculated for temperature ranges compatible with kilonova plasma\nconditions. Forbidden transitions were found to disagree heavily with the\nAxelrod approximation, an approximation which is currently employed by other\nmodels within the literature. Theoretically important spectral lines are\nidentified with both LTE and NLTE modelling codes. LTE simulations in {\\sc\ntardis} reveal no new significant changes to the full synthetic spectra. NLTE\nsimulations in {\\sc ColRadPy} provide indications of which features are\nexpected to be strong for a range of regimes, and we include luminosity\nestimates. Synthetic emission spectra over KNe densities and temperatures\nreveal potentially interesting spectral lines in the NIR.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics","Physics/Atomic Physics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}