{"id":"2407.13023","title":"A Three-Stage Algorithm for the Closest String Problem on Artificial and\n  Real Gene Sequences","authors":"Alireza Abdi, Marko Djukanovic, Hesam Tahmasebi Boldaji, Hadis Salehi,\n  Aleksandar Kartelj","authorsParsed":[["Abdi","Alireza",""],["Djukanovic","Marko",""],["Boldaji","Hesam Tahmasebi",""],["Salehi","Hadis",""],["Kartelj","Aleksandar",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 21:26:27 GMT"}],"updateDate":"2024-07-19","timestamp":1721251587000,"abstract":"  The Closest String Problem is an NP-hard problem that aims to find a string\nthat has the minimum distance from all sequences that belong to the given set\nof strings. Its applications can be found in coding theory, computational\nbiology, and designing degenerated primers, among others. There are efficient\nexact algorithms that have reached high-quality solutions for binary sequences.\nHowever, there is still room for improvement concerning the quality of\nsolutions over DNA and protein sequences. In this paper, we introduce a\nthree-stage algorithm that comprises the following process: first, we apply a\nnovel alphabet pruning method to reduce the search space for effectively\nfinding promising search regions. Second, a variant of beam search to find a\nheuristic solution is employed. This method utilizes a newly developed guiding\nfunction based on an expected distance heuristic score of partial solutions.\nLast, we introduce a local search to improve the quality of the solution\nobtained from the beam search. Furthermore, due to the lack of real-world\nbenchmarks, two real-world datasets are introduced to verify the robustness of\nthe method. The extensive experimental results show that the proposed method\noutperforms the previous approaches from the literature.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qqYl_u_kcCCNKooKJQGGEgt9gnh50LPAKstBkJQQbyo","pdfSize":"320482","objectId":"0x5c179e130a7dcdc23b4af73799ec5a7c24e2c035a68d77b0f217aa7653c87c5c","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
