{"id":"2407.00014","title":"Kinetic and Kinematic Sensors-free Approach for Estimation of Continuous\n  Force and Gesture in sEMG Prosthetic Hands","authors":"Gang Liu, Zhenxiang Wang, Chuanmei Xi, Ziyang He, Shanshan Guo, Rui\n  Zhang, Dezhong Yao","authorsParsed":[["Liu","Gang",""],["Wang","Zhenxiang",""],["Xi","Chuanmei",""],["He","Ziyang",""],["Guo","Shanshan",""],["Zhang","Rui",""],["Yao","Dezhong",""]],"versions":[{"version":"v1","created":"Wed, 1 May 2024 09:13:29 GMT"},{"version":"v2","created":"Mon, 16 Sep 2024 16:04:36 GMT"}],"updateDate":"2024-09-17","timestamp":1714554809000,"abstract":"  Regression-based sEMG prosthetic hands are widely used for their ability to\nprovide continuous kinetic and kinematic parameters. However, establishing\nthese models requires complex sensors systems to collect corresponding kinetic\nand kinematic data in synchronization with sEMG, which is cumbersome and\nuser-unfriendly. This paper proposes a kinetic and kinematic sensors-free\napproach for controlling sEMG prosthetic hands, enabling continuous decoding\nand execution of three hand movements: individual finger flexion/extension,\nmultiple finger flexion/extension, and fist opening/closing. This approach\nutilizes only two data points (-1 and 1), representing maximal finger flexion\nforce label and extension force label respectively, and their corresponding\nsEMG data to establish a near-linear model based on sEMG data and labels. The\nmodel's output labels values are used to control the direction and magnitude of\nfingers forces, enabling the estimation of continuous gestures. To validate\nthis approach, we conducted offline and online experiments using four models:\nDendritic Net (DD), Linear Net (LN), Multi-Layer Perceptron (MLP), and\nConvolutional Neural Network (CNN). The offline analysis assessed each model's\nability to classify finger force direction and interpolate intermediate force\nvalues, while online experiments evaluated real-time control performance in\ncontrolling gestures and accurately adjusting forces. Our results demonstrate\nthat the DD and LN models provide excellent real-time control of finger forces\nand gestures, highlighting the practical potential of this sensors-free\napproach for prosthetic applications. This study significantly reduces the\ncomplexity of collecting kinetic and kinematic parameters in sEMG-based\nregression prosthetics, thus enhancing the usability and convenience of\nprosthetic hands.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}