{"id":"2407.16623","title":"Inverse Particle Filter","authors":"Himali Singh, Arpan Chattopadhyay, and Kumar Vijay Mishra","authorsParsed":[["Singh","Himali",""],["Chattopadhyay","Arpan",""],["Mishra","Kumar Vijay",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 16:32:38 GMT"},{"version":"v2","created":"Tue, 10 Sep 2024 14:26:03 GMT"}],"updateDate":"2024-09-11","timestamp":1721752358000,"abstract":"  In cognitive systems, recent emphasis has been placed on studying the\ncognitive processes of the subject whose behavior was the primary focus of the\nsystem's cognitive response. This approach, known as inverse cognition, arises\nin counter-adversarial applications and has motivated the development of\ninverse Bayesian filters. In this context, a cognitive adversary, such as a\nradar, uses a forward Bayesian filter to track its target of interest. An\ninverse filter is then employed to infer the adversary's estimate of the\ntarget's or defender's state. Previous studies have addressed this inverse\nfiltering problem by introducing methods like the inverse Kalman filter (I-KF),\ninverse extended KF (I-EKF), and inverse unscented KF (I-UKF). However, these\nfilters typically assume additive Gaussian noise models and/or rely on local\napproximations of non-linear dynamics at the state estimates, limiting their\npractical application. In contrast, this paper adopts a global filtering\napproach and presents the development of an inverse particle filter (I-PF). The\nparticle filter framework employs Monte Carlo (MC) methods to approximate\narbitrary posterior distributions. Moreover, under mild system-level\nconditions, the proposed I-PF demonstrates convergence to the optimal inverse\nfilter. Additionally, we propose the differentiable I-PF to address scenarios\nwhere system information is unknown to the defender. Using the recursive\nCramer-Rao lower bound and non-credibility index (NCI), our numerical\nexperiments for different systems demonstrate the estimation performance and\ntime complexity of the proposed filter.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Signal Processing","Electrical Engineering and Systems Science/Systems and Control","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}