{"id":"2407.11119","title":"Enhanced entanglement scaling and area-law charge fluctuations in a\n  non-Fermi liquid of composite fermions","authors":"Cristian Voinea, Songyang Pu, Ajit C. Balram, Zlatko Papi\\'c","authorsParsed":[["Voinea","Cristian",""],["Pu","Songyang",""],["Balram","Ajit C.",""],["Papić","Zlatko",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-17","timestamp":1721066401000,"abstract":"  The composite fermion Fermi liquid (CFL) state at $\\nu{=}1/2$ filling of a\nLandau level is a paradigmatic example of a non-Fermi liquid borne out purely\nby Coulomb interactions. But in what ways is this exotic state of matter\nprecisely different from a Fermi liquid? The entanglement entropy of the CFL\nstate was indeed found to exhibit a significant enhancement compared to free\nelectrons [Shao et al., Phys. Rev. Lett. 114, 206402 (2015)], which was\nsubsequently ruled out as a finite-size effect by the study of a lattice CFL\nanalogue [Mishmash and Motrunich, Phys. Rev. B 94, 081110 (2016)]. Moreover,\nthe enhancement was not observed in a quasi-one-dimensional limit of the\nCoulomb ground state at $\\nu{=}1/2$ [Geraedts et al., Science 352, 197 (2016)].\nHere, we revisit the problem of entanglement scaling in the CFL state realized\nin a two-dimensional continuum system. Using Monte Carlo evaluation of the\nsecond R\\'enyi entropy $S_2$ for the CFL variational wave function, we show\nthat the entanglement enhancement is present not only at $\\nu{=}1/2$ but also\nat $\\nu{=}1/4$, as well as in bosonic CFL states at $\\nu{=}1$ and $\\nu{=}1/3$\nfillings. In all cases, we find the scaling of $S_2$ with subsystem size to be\nenhanced compared to the non-interacting case, and insensitive to the choice of\ngeometry and projection to the lowest Landau level. We also demonstrate that\nthe variance of the particle number in a subsystem obeys area-law scaling with\na universal subleading corner contribution, in stark contrast with free\nfermions. Our results establish the enhanced entanglement scaling and\nsuppressed charge fluctuations as fingerprints of non-Fermi-liquid correlations\nin the CFL state.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}