{"id":"2407.07243","title":"Viscous circumbinary protoplanetary discs -- I. Structure of the inner\n  cavity","authors":"Anna B.T. Penzlin, Richard A. Booth, Richard P. Nelson, Christoph M.\n  Sch\\\"afer, Wilhelm Kley","authorsParsed":[["Penzlin","Anna B. T.",""],["Booth","Richard A.",""],["Nelson","Richard P.",""],["Schäfer","Christoph M.",""],["Kley","Wilhelm",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 21:42:31 GMT"}],"updateDate":"2024-07-11","timestamp":1720561351000,"abstract":"  Many of the most intriguing features, including spirals and cavities, in the\ncurrent disc observations are found in binary systems like GG Tau, HD 142527 or\nHD 100453. Such features are evidence of the dynamic interaction between binary\nstars and the viscous disc. Understanding these dynamic interactions and how\nthey result in the structure and growth of asymmetric circumbinary discs is a\ndifficult problem, for which there is no complete analytical solution, that\npredicts the shape of the observed disc accurately. We use numeric simulation\nto evolve circumbinary discs with varying disc viscosities and investigate the\nsize and shape of the inner cavities in such protoplanetary discs. We have\nsimulated over 140 locally isothermal 2D grid-based disc models for > 3e4\nbinary orbits each and mapped out the parameter space relevant for\nprotoplanetary discs. With this, it becomes possible to create parametrised\nprofiles for individual discs to compare to observation and find limits to\ntheir binary eccentricity or internal viscosity from the simulation data. In\nthe long-term simulations larger cavity sizes than previously considered are\npossible within the parameter space (< 6 binary separations). As an example, we\nfind that the eccentricity of the disc around HD 142527 suggests the impact of\nthe binary dynamics on the disc. However, even considering the larger cavity\nsizes, the large size of the cavity in HD 142527 remains unexplained by the\nsimulations considering the most recent orbital constraints.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}