{"id":"2407.03755","title":"A Computer Vision Approach to Estimate the Localized Sea State","authors":"Aleksandar Vorkapic, Miran Pobar, Marina Ivasic-Kos","authorsParsed":[["Vorkapic","Aleksandar",""],["Pobar","Miran",""],["Ivasic-Kos","Marina",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 09:07:25 GMT"},{"version":"v2","created":"Mon, 8 Jul 2024 14:05:29 GMT"}],"updateDate":"2024-07-09","timestamp":1720084045000,"abstract":"  This research presents a novel application of computer vision (CV) and deep\nlearning methods for real-time sea state recognition, aiming to contribute to\nimproving the operational safety and energy efficiency of seagoing vessels, key\nfactors in meeting the legislative carbon reduction targets. Our work focuses\non utilizing sea images in operational envelopes captured by a single\nstationary camera mounted on the ship bridge. The collected images are used to\ntrain a deep learning model to automatically recognize the state of the sea\nbased on the Beaufort scale. To recognize the sea state, we used 4\nstate-of-the-art deep neural networks with different characteristics that\nproved useful in various computer vision tasks: Resnet-101, NASNet,\nMobileNet_v2, and Transformer ViT-b32. Furthermore, we have defined a unique\nlarge-scale dataset, collected over a broad range of sea conditions from an\nocean-going vessel prepared for machine learning. We used the transfer learning\napproach to fine-tune the models on our dataset. The obtained results\ndemonstrate the potential for this approach to complement traditional methods,\nparticularly where in-situ measurements are unfeasible or interpolated weather\nbuoy data is insufficiently accurate. This study sets the groundwork for\nfurther development of sea state classification models to address recognized\ngaps in maritime research and enable safer and more efficient maritime\noperations.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}