{"id":"2407.14994","title":"Non-Reference Quality Assessment for Medical Imaging: Application to\n  Synthetic Brain MRIs","authors":"Karl Van Eeden Risager, Torkan Gholamalizadeh, Mostafa Mehdipour Ghazi","authorsParsed":[["Risager","Karl Van Eeden",""],["Gholamalizadeh","Torkan",""],["Ghazi","Mostafa Mehdipour",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 22:05:30 GMT"}],"updateDate":"2024-07-23","timestamp":1721513130000,"abstract":"  Generating high-quality synthetic data is crucial for addressing challenges\nin medical imaging, such as domain adaptation, data scarcity, and privacy\nconcerns. Existing image quality metrics often rely on reference images, are\ntailored for group comparisons, or are intended for 2D natural images, limiting\ntheir efficacy in complex domains like medical imaging. This study introduces a\nnovel deep learning-based non-reference approach to assess brain MRI quality by\ntraining a 3D ResNet. The network is designed to estimate quality across six\ndistinct artifacts commonly encountered in MRI scans. Additionally, a diffusion\nmodel is trained on diverse datasets to generate synthetic 3D images of high\nfidelity. The approach leverages several datasets for training and\ncomprehensive quality assessment, benchmarking against state-of-the-art metrics\nfor real and synthetic images. Results demonstrate superior performance in\naccurately estimating distortions and reflecting image quality from multiple\nperspectives. Notably, the method operates without reference images, indicating\nits applicability for evaluating deep generative models. Besides, the quality\nscores in the [0, 1] range provide an intuitive assessment of image quality\nacross heterogeneous datasets. Evaluation of generated images offers detailed\ninsights into specific artifacts, guiding strategies for improving generative\nmodels to produce high-quality synthetic images. This study presents the first\ncomprehensive method for assessing the quality of real and synthetic 3D medical\nimages in MRI contexts without reliance on reference images.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}