{"id":"2407.01971","title":"Pseudo-Labeling by Multi-Policy Viewfinder Network for Image Cropping","authors":"Zhiyu Pan, Kewei Wang, Yizheng Wu, Liwen Xiao, Jiahao Cui, Zhicheng\n  Wang, Zhiguo Cao","authorsParsed":[["Pan","Zhiyu",""],["Wang","Kewei",""],["Wu","Yizheng",""],["Xiao","Liwen",""],["Cui","Jiahao",""],["Wang","Zhicheng",""],["Cao","Zhiguo",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 06:02:05 GMT"},{"version":"v2","created":"Thu, 4 Jul 2024 06:52:38 GMT"}],"updateDate":"2024-07-08","timestamp":1719900125000,"abstract":"  Automatic image cropping models predict reframing boxes to enhance image\naesthetics. Yet, the scarcity of labeled data hinders the progress of this\ntask. To overcome this limitation, we explore the possibility of utilizing both\nlabeled and unlabeled data together to expand the scale of training data for\nimage cropping models. This idea can be implemented in a pseudo-labeling way:\nproducing pseudo labels for unlabeled data by a teacher model and training a\nstudent model with these pseudo labels. However, the student may learn from\nteacher's mistakes. To address this issue, we propose the multi-policy\nviewfinder network (MPV-Net) that offers diverse refining policies to rectify\nthe mistakes in original pseudo labels from the teacher. The most reliable\npolicy is selected to generate trusted pseudo labels. The reliability of\npolicies is evaluated via the robustness against box jittering. The efficacy of\nour method can be evaluated by the improvement compared to the supervised\nbaseline which only uses labeled data. Notably, our MPV-Net outperforms\noff-the-shelf pseudo-labeling methods, yielding the most substantial\nimprovement over the supervised baseline. Furthermore, our approach achieves\nstate-of-the-art results on both the FCDB and FLMS datasets, signifying the\nsuperiority of our approach.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}