{"id":"2407.14991","title":"Investigating the use of Snowballing on Gray Literature Reviews","authors":"Felipe Gomes, Thiago Mendes, S\\'avio Freire, Rodrigo Sp\\'inola, Manoel\n  Mendon\\c{c}a","authorsParsed":[["Gomes","Felipe",""],["Mendes","Thiago",""],["Freire","Sávio",""],["Spínola","Rodrigo",""],["Mendonça","Manoel",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 21:53:19 GMT"}],"updateDate":"2024-07-23","timestamp":1721512399000,"abstract":"  Background: The use of gray literature (GL) has grown in software engineering\nresearch, especially in studies that consider Questions and Answers (Q&A)\nsites, since software development professionals widely use them. Though\nsnowballing (SB) techniques are standard in systematic literature reviews,\nlittle is known about how to apply them to gray literature reviews. Aims: This\npaper investigates how to use SB approaches on Q&A sites during gray literature\nreviews to identify new valid discussions for analysis. Method: In previous\nstudies, we compiled and analyzed a set of Stack Exchange Project Management\n(SEPM) discussions related to software engineering technical debt (TD). Those\nstudies used a data set consisting of 108 valid discussions extracted from\nSEPM. Based on this start data set, we perform forward and backward SB using\ntwo different approaches: link-based and similarity-based SB. We then compare\nthe precision and recall of those two SB approaches against the search-based\napproach of the original study. Results: In just one snowballing iteration, the\napproaches yielded 291 new discussions for analysis, 130 of which were\nconsidered valid for our study. That is an increase of about 120% over the\noriginal data set (recall). The SB process also yielded a similar rate of valid\ndiscussion retrieval when compared to the search-based approach (precision).\nConclusion: This paper provides guidelines on how to apply two SB approaches to\nfind new valid discussions for review. To our knowledge, this is the first\nstudy that analyzes the use of SB on Q&A websites. By applying SB, it was\npossible to identify new discussions, significantly increasing the relevant\ndata set for a gray literature review.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}