{"id":"2407.19868","title":"POREMAPS: A finite difference based Porous Media Anisotropic\n  Permeability Solver for Stokes flow","authors":"David Krach (1 and 2) and Matthias Ruf (1) and Holger Steeb (1 and 2)\n  ((1) University of Stuttgart, Institute of Applied Mechanics (CE), (2)\n  University of Stuttgart, Stuttgart Center for Simulation Science)","authorsParsed":[["Krach","David","","1 and 2"],["Ruf","Matthias","","1 and 2"],["Steeb","Holger","","1 and 2"]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 10:38:12 GMT"}],"updateDate":"2024-07-30","timestamp":1722249492000,"abstract":"  Porous materials are ubiquitous in various engineering and geological\napplications, where their permeability plays a critical role in viscous fluid\nflow and transport phenomena. Understanding and characterizing the microscale\nproperties, the effective hydraulic parameters, and also the anisotropy of\nporous materials are essential for accurate modeling and predicting fluid flow\nbehavior. The study pursues the Digital Rock Physics approach to retrieve\nintrinsic permeability and its evolution in anisotropic configurations of\nporous media, which are subjected to pore space alterations. Therefore, we\ndiscuss the development and implementation of a computational framework based\non the finite difference method to solve the pseudo-unsteady Stokes equations\nfor fluid flow on the pore scale. We present an efficient and highly\nparallelized implementation of this numerical method for large voxel-based data\nsets originating from different image-based experimental setups. A\ncomprehensive variety of benchmarks has been conducted to assess and evaluate\nthe performance of the proposed solver. The solver's compatibility with huge\ndomain sizes generated by state-of-the-art imaging techniques is demonstrated.\nWe investigate an open-cell foam undergoing deformation, observing that\ncontrary to initial expectations, no anisotropy emerges. Further, we examine a\nmicrofluidic cell experiencing precipitation within its pore space, resulting\nin clear anisotropic development during the clogging process.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}