{"id":"2407.01722","title":"ToffA-DSPL: an approach of trade-off analysis for designing dynamic\n  software product lines","authors":"Michelle Larissa Luciano Carvalho, Paulo Cesar Masiero, Ismayle de\n  Sousa Santos, and Eduardo Santana de Almeida","authorsParsed":[["Carvalho","Michelle Larissa Luciano",""],["Masiero","Paulo Cesar",""],["Santos","Ismayle de Sousa",""],["de Almeida","Eduardo Santana",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 18:51:32 GMT"}],"updateDate":"2024-07-03","timestamp":1719859892000,"abstract":"  Software engineers have adopted the Dynamic Software Product Lines (DSPL)\nengineering practices to develop Dynamically Adaptable Software (DAS). DAS is\nseen as a DSPL application and must cope with a large number of configurations\nof features, Non-functional Requirements (NFRs), and contexts. However, the\naccurate representation of the impact of features over NFRs and contexts for\nthe identification of optimal configurations is not a trivial task. Software\nengineers need to have domain knowledge and design DAS before deploying to\nsatisfy those requirements. Aiming to handle them, we proposed an approach of\nTrade-off Analysis for DSPL at design-time, named ToffA-DSPL. It deals with the\nconfiguration selection process considering interactions between NFRs and\ncontexts. We performed an exploratory study based on simulations to identify\nthe usefulness of the ToffA-DSPL approach. In general, the configurations\nsuggested by ToffA-DSPL provide high satisfaction levels of NFRs. Based on\nsimulations, we evidenced that our approach aims to explore reuse and is useful\nfor generating valid and optimal configurations. In addition, ToffA-DSPL\nenables software engineers to conduct trade-off analysis, evaluate changes in\nthe context feature, and define an adaptation model from optimal configurations\nfound in the analysis.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}