{"id":"2407.04113","title":"How does the successive buckling events affect a galaxy bar and stellar\n  disk? Potential Observable Signatures For Spotting the Buckling Action -- I","authors":"Sandeep Kumar Kataria","authorsParsed":[["Kataria","Sandeep Kumar",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 18:34:10 GMT"}],"updateDate":"2024-07-08","timestamp":1720118050000,"abstract":"  Until now, observations have caught up only a handful of galaxies in ongoing\nbuckling action. Interestingly, N-body simulations over the past several\ndecades show that almost every bar buckles or vertically thickens as soon as it\nreaches its peak strength during its evolution and leads to box$/$ peanut$/$ x\n(BPX) shapes. In order to understand the effect of multiple buckling events on\nthe observable properties of galactic bar and disk, we perform an N-body\nsimulation of a Milky Way-type disk. The axisymmetric galaxy disk forms a bar\nwithin a Gyr of its evolution and the bar undergoes two successive buckling\nevents. We report that the time spans of these two buckling events are 220 Myr\nand 1 Gyr which have almost similar strengths of the bending modes. As a result\nof these two buckling events, the sizes of BPX shapes are around 5.8 kpc and\n8.6 kpc which are around two-thirds of the bar length at the end of each\nbuckling event. We find that the first buckling occurs at a smaller scale\n(radius less than 3 kpc) with a shorter time span affecting the larger length\nscales of the disk which is quantified in terms of changes in $m$ =2 and $m$ =\n4 Fourier modes. While the second buckling occurs at larger scales (radius of\naround 6 kpc) affecting the inner disk the most. Finally, we provide observable\nkinematic signatures (for example quadrupolar patterns of the line-of-sight\nvelocities) which can potentially differentiate the successive buckling events.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}