{"id":"2407.07203","title":"Graph Reinforcement Learning for Exploring BSM Model Spaces","authors":"George N. Wojcik, Shu Tian Eu, Lisa L. Everett","authorsParsed":[["Wojcik","George N.",""],["Eu","Shu Tian",""],["Everett","Lisa L.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 19:44:59 GMT"}],"updateDate":"2024-07-11","timestamp":1720554299000,"abstract":"  We present a methodology for performing scans of BSM parameter spaces with\nreinforcement learning (RL). We identify a novel procedure using graph neural\nnetworks that is capable of exploring spaces of models without the user\nspecifying a fixed particle content, allowing broad classes of BSM models to be\nexplored. In theory, the technique is applicable to nearly any model space with\na pre-specified gauge group. We provide a generic procedure by which a suitable\ngraph grammar can be developed for any BSM model which features user-specified\nsymmetry groups and a finite number of different possible particle species. As\na proof of concept, we construct the graph grammar for theories with\nvector-like leptons that may or may not be charged under a dark U(1) group,\ninspired by portal matter extensions of the sub-GeV vector portal/kinetic\nmixing simplified dark matter models. We then use this graph grammar to create\na RL environment tasked with creating models with these vector-like leptons\nthat are consistent with a list of a variety of precision observables. The RL\nagent succeeds in developing models that can address the observed muon\nanomalous magnetic moment discrepancy while remaining consistent with flavor\nviolation and electroweak precision observables, including both constructions\nthat have previously been studied as well as new models which have not, to our\nknowledge, previously been identified. By inspecting the resulting ensembles of\nmodels that the agent produces and experimenting with different configurations\nfor our RL environment and graph grammar, we also infer various lessons about\nthe development of these environments that can be transferable to RL scans of\nmore complicated model spaces, and comment on future directions for the\ndevelopment of this technique into a more mature tool.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}