{"id":"2407.00470","title":"Unusual Pore Volume Dependence of Water Sorption in Monolithic\n  Metal-Organic Framework","authors":"Jiawang Li, Guang Wang, Hongzhao Fan, Zhigang Li, Chi Yan Tso and\n  Yanguang Zhou","authorsParsed":[["Li","Jiawang",""],["Wang","Guang",""],["Fan","Hongzhao",""],["Li","Zhigang",""],["Tso","Chi Yan",""],["Zhou","Yanguang",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 15:32:44 GMT"}],"updateDate":"2024-07-02","timestamp":1719675164000,"abstract":"  Monolithic metal-organic frameworks (MOFs), which have a continuous structure\ncomposed of small primary MOF particles and amorphous networks, are\ndemonstrated to possess larger pore volume and thus better larger gas uptake\ncapacity compared to their powder forms. Here, we systematically investigated\nthe water vapor adsorption kinetics in a prototypical MOF, i.e., MOF-801. Our\nresults show that the total pore volume (average pore diameter) of the\nmonolithic MOF-801 is 0.831 cm3/g (5.20 nm) which is much larger than that of\npowder MOF-801, i.e., 0.488 cm3/g (1.95 nm). Unexpectedly, we find that the\nwater uptake capacity of monolithic MOF-801 is much lower than that of powder\nMOF-801 when the RH ranges from 10% to 90%. Our molecular dynamics simulations\nfurther demonstrate that the unexpected water uptake capacity of monolithic\nMOF-801 at RH of 10%~90% is caused by the water film formed by the capillary\ncondensation in these mesopores of monolithic MOF-801. The water molecules can\novercome the capillary force when the RH is higher than 90%, and then leads to\nthe increase of the corresponding water uptake capacity of monolithic MOF-801.\nOur findings reveal the underlying mechanisms for water adsorption kinetics in\nboth powder and monolithic MOFs, which could motivate and benefit the new\npassive cooling or water harvesting system design based on MOFs.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}