{"id":"2407.20393","title":"Validating Mean Field Theory in a New Complex, Disordered High-Entropy\n  Spinel Oxide","authors":"Neha Sharma, Nikita Sharma, Jyoti Sharma, S. D. Kaushik, Sanjoy Kr.\n  Mahatha, Tirthankar Chakraborty, and Sourav Marik","authorsParsed":[["Sharma","Neha",""],["Sharma","Nikita",""],["Sharma","Jyoti",""],["Kaushik","S. D.",""],["Mahatha","Sanjoy Kr.",""],["Chakraborty","Tirthankar",""],["Marik","Sourav",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 19:40:42 GMT"}],"updateDate":"2024-07-31","timestamp":1722282042000,"abstract":"  The advent of novel high-entropy oxides has sparked substantial research\ninterest due to their exceptional functional properties, which often surpass\nthe mere sum of their constituent elements' characteristics. This study\nintroduces a complex high-entropy spinel oxide with composition\n(Ni$_{0.2}$Mg$_{0.2}$Co$_{0.2}$Cu$_{0.2}$Zn$_{0.2}$)(Mn$_{0.66}$Fe$_{0.66}$Cr$_{0.66}$)O$_{4}$.\nWe performed comprehensive structural (X-ray and Neutron diffraction),\nmicrostructural, magnetic, and local electronic structure investigations on\nthis material. Despite the material's high degree of disorder, detailed\nmagnetization measurements and low temperature neutron powder diffraction\nstudies reveal long-range ferrimagnetic ordering beginning at 293 K. The sample\nexhibits a high saturation magnetization of 766 emu-cm${^3}$ (at 50 K), a low\ncoercivity (H$_C$) of 100 Oe (50 K), a high transition temperature (T$_C$)\naround room temperature, and high resistivity value of 4000 Ohm-cm at room\ntemperature, indicating its potential for high density memory devices. The\nmagnetic structure is determined using a collinear-type ferrimagnetic model\nwith a propagation vector k = 0,0,0. Various analytical techniques, including\nmodified Arrott plots, Kouvel-Fischer analysis, and critical isotherm analysis,\nare employed to investigate the phase transitions and magnetic properties of\nthis complex system. Our results indicate a second-order phase transition.\nRemarkably, despite the complex structure and significant disorder, the\ncritical exponents obtained are consistent with the mean field model. The high\nentropy leads to a remarkably homogeneous distribution of multiple cations,\nvalidating the approximation of average local magnetic environments and\nsupporting the mean field theory.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8mZiFX4AZ5RKZJkzfIAOJHbUipQeyWQU5X5bwv45JJU","pdfSize":"3500136","objectId":"0x10791fd9f2e0fa0a4b028ac58041eafd6aebd5dc70e006468f751be168c4460b","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
