{"id":"2407.11462","title":"X-ray Sources Classification Using Machine Learning: A Study with EP-WXT\n  Pathfinder LEIA","authors":"Xiaoxiong Zuo, Yihan Tao, Yuan Liu, Yunfei Xu, Wenda Zhang, Haiwu Pan,\n  Hui Sun, Zhen Zhang, Chenzhou Cui, Weimin Yuan","authorsParsed":[["Zuo","Xiaoxiong",""],["Tao","Yihan",""],["Liu","Yuan",""],["Xu","Yunfei",""],["Zhang","Wenda",""],["Pan","Haiwu",""],["Sun","Hui",""],["Zhang","Zhen",""],["Cui","Chenzhou",""],["Yuan","Weimin",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 07:54:31 GMT"}],"updateDate":"2024-07-17","timestamp":1721116471000,"abstract":"  X-ray observations play a crucial role in time-domain astronomy. The Einstein\nProbe (EP), a recently launched X-ray astronomical satellite, emerges as a\nforefront player in the field of time-domain astronomy and high-energy\nastrophysics. With a focus on systematic surveys in the soft X-ray band, EP\naims to discover high-energy transients and monitor variable sources in the\nuniverse. To achieve these objectives, a quick and reliable classification of\nobserved sources is essential. In this study, we developed a machine learning\nclassifier for autonomous source classification using data from the EP-WXT\nPathfinder Lobster Eye Imager for Astronomy (LEIA) and EP-WXT simulations. The\nproposed Random Forest classifier, built on selected features derived from\nlight curves, energy spectra, and location information, achieves an accuracy of\napproximately 95% on EP simulation data and 98% on LEIA observational data. The\nclassifier is integrated into the LEIA data processing pipeline, serving as a\ntool for manual validation and rapid classification during observations. This\npaper presents an efficient method for the classification of X-ray sources\nbased on single observations, along with implications of most effective\nfeatures for the task. This work facilitates rapid source classification for\nthe EP mission and also provides valuable insights into feature selection and\nclassification techniques for enhancing the efficiency and accuracy of X-ray\nsource classification that can be adapted to other X-ray telescope data.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}