{"id":"2407.03205","title":"Category-Aware Dynamic Label Assignment with High-Quality Oriented\n  Proposal","authors":"Mingkui Feng, Hancheng Yu, Xiaoyu Dang, and Ming Zhou","authorsParsed":[["Feng","Mingkui",""],["Yu","Hancheng",""],["Dang","Xiaoyu",""],["Zhou","Ming",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 15:36:47 GMT"}],"updateDate":"2024-07-04","timestamp":1720021007000,"abstract":"  Objects in aerial images are typically embedded in complex backgrounds and\nexhibit arbitrary orientations. When employing oriented bounding boxes (OBB) to\nrepresent arbitrary oriented objects, the periodicity of angles could lead to\ndiscontinuities in label regression values at the boundaries, inducing abrupt\nfluctuations in the loss function. To address this problem, an OBB\nrepresentation based on the complex plane is introduced in the oriented\ndetection framework, and a trigonometric loss function is proposed. Moreover,\nleveraging prior knowledge of complex background environments and significant\ndifferences in large objects in aerial images, a conformer RPN head is\nconstructed to predict angle information. The proposed loss function and\nconformer RPN head jointly generate high-quality oriented proposals. A\ncategory-aware dynamic label assignment based on predicted category feedback is\nproposed to address the limitations of solely relying on IoU for proposal label\nassignment. This method makes negative sample selection more representative,\nensuring consistency between classification and regression features.\nExperiments were conducted on four realistic oriented detection datasets, and\nthe results demonstrate superior performance in oriented object detection with\nminimal parameter tuning and time costs. Specifically, mean average precision\n(mAP) scores of 82.02%, 71.99%, 69.87%, and 98.77% were achieved on the\nDOTA-v1.0, DOTA-v1.5, DIOR-R, and HRSC2016 datasets, respectively.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}