{"id":"2407.03467","title":"Measure Adaptations and Rank Aggregation for the Selection of Clustering\n  Methods and Sizes For Single Cell Data","authors":"Owen Visser, Somnath Datta","authorsParsed":[["Visser","Owen",""],["Datta","Somnath",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 19:26:01 GMT"}],"updateDate":"2024-07-08","timestamp":1720034761000,"abstract":"  The growing efficiency of single-cell sequencing technology has provided\nbiologists with ample cells to identify and differentiate, often through\nclustering. Heuristic approaches for clustering method choice have become more\nprevalent and could lead to inaccurate reports if statistical evaluation of the\nresulting clusters is omitted. During the advent of microarray data, a similar\ndilemma was addressed in literature through the provision of supervised and\nunsupervised measures, which were evaluated through Rank Aggregation. In this\npaper, these measures are adapted into the single-cell framework through a\nleave-one-out approach. Additionally, a scheme was created to utilize the\ninformation of cluster sizes by using their ranking to assign importance to the\naggregation of methods, resulting in one table of methods ranked by cluster\nsizes. To demonstrate the ensemble of measures and scheme, five benchmark\nsingle-cell datasets were clustered with various methods at appropriate cluster\nsizes. We show that through rank aggregation and our importance scheme, our\nadapted measures select clustering methods that perform better at cluster sizes\nassociated with true biological groups compared to those selected through\ntraditional measures. For four of the five datasets and with internal measures\nalone, the rank aggregation scheme could correctly identify methods that\nperformed the best at cluster sizes that match the original biological groups.\nWe plan to package this ensemble of measures in the hopes to provide others\nwith a tool to identify the best performing clustering methods and associated\nsizes for a variety of single cell datasets.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/"}