{"id":"2407.06110","title":"FGA: Fourier-Guided Attention Network for Crowd Count Estimation","authors":"Yashwardhan Chaudhuri, Ankit Kumar, Arun Balaji Buduru, Adel\n  Alshamrani","authorsParsed":[["Chaudhuri","Yashwardhan",""],["Kumar","Ankit",""],["Buduru","Arun Balaji",""],["Alshamrani","Adel",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 16:47:19 GMT"}],"updateDate":"2024-07-09","timestamp":1720457239000,"abstract":"  Crowd counting is gaining societal relevance, particularly in domains of\nUrban Planning, Crowd Management, and Public Safety. This paper introduces\nFourier-guided attention (FGA), a novel attention mechanism for crowd count\nestimation designed to address the inefficient full-scale global pattern\ncapture in existing works on convolution-based attention networks. FGA\nefficiently captures multi-scale information, including full-scale global\npatterns, by utilizing Fast-Fourier Transformations (FFT) along with spatial\nattention for global features and convolutions with channel-wise attention for\nsemi-global and local features. The architecture of FGA involves a dual-path\napproach: (1) a path for processing full-scale global features through FFT,\nallowing for efficient extraction of information in the frequency domain, and\n(2) a path for processing remaining feature maps for semi-global and local\nfeatures using traditional convolutions and channel-wise attention. This\ndual-path architecture enables FGA to seamlessly integrate frequency and\nspatial information, enhancing its ability to capture diverse crowd patterns.\nWe apply FGA in the last layers of two popular crowd-counting works, CSRNet and\nCANNet, to evaluate the module's performance on benchmark datasets such as\nShanghaiTech-A, ShanghaiTech-B, UCF-CC-50, and JHU++ crowd. The experiments\ndemonstrate a notable improvement across all datasets based on\nMean-Squared-Error (MSE) and Mean-Absolute-Error (MAE) metrics, showing\ncomparable performance to recent state-of-the-art methods. Additionally, we\nillustrate the interpretability using qualitative analysis, leveraging Grad-CAM\nheatmaps, to show the effectiveness of FGA in capturing crowd patterns.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}