{"id":"2407.02768","title":"Knowledge Transfer with Simulated Inter-Image Erasing for Weakly\n  Supervised Semantic Segmentation","authors":"Tao Chen, XiRuo Jiang, Gensheng Pei, Zeren Sun, Yucheng Wang, Yazhou\n  Yao","authorsParsed":[["Chen","Tao",""],["Jiang","XiRuo",""],["Pei","Gensheng",""],["Sun","Zeren",""],["Wang","Yucheng",""],["Yao","Yazhou",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 02:54:33 GMT"}],"updateDate":"2024-07-04","timestamp":1719975273000,"abstract":"  Though adversarial erasing has prevailed in weakly supervised semantic\nsegmentation to help activate integral object regions, existing approaches\nstill suffer from the dilemma of under-activation and over-expansion due to the\ndifficulty in determining when to stop erasing. In this paper, we propose a\n\\textbf{K}nowledge \\textbf{T}ransfer with \\textbf{S}imulated Inter-Image\n\\textbf{E}rasing (KTSE) approach for weakly supervised semantic segmentation to\nalleviate the above problem. In contrast to existing erasing-based methods that\nremove the discriminative part for more object discovery, we propose a\nsimulated inter-image erasing scenario to weaken the original activation by\nintroducing extra object information. Then, object knowledge is transferred\nfrom the anchor image to the consequent less activated localization map to\nstrengthen network localization ability. Considering the adopted bidirectional\nalignment will also weaken the anchor image activation if appropriate\nconstraints are missing, we propose a self-supervised regularization module to\nmaintain the reliable activation in discriminative regions and improve the\ninter-class object boundary recognition for complex images with multiple\ncategories of objects. In addition, we resort to intra-image erasing and\npropose a multi-granularity alignment module to gently enlarge the object\nactivation to boost the object knowledge transfer. Extensive experiments and\nablation studies on PASCAL VOC 2012 and COCO datasets demonstrate the\nsuperiority of our proposed approach. Source codes and models are available at\nhttps://github.com/NUST-Machine-Intelligence-Laboratory/KTSE.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}