{"id":"2407.16489","title":"Cosmic Web Dynamics: Forces and Strains","authors":"Roi Kugel, Rien van de Weygaert","authorsParsed":[["Kugel","Roi",""],["van de Weygaert","Rien",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:04:58 GMT"}],"updateDate":"2024-07-24","timestamp":1721743498000,"abstract":"  This study concerns an inventory of the gravitational force and tidal field\ninduced by filaments, walls, cluster nodes and voids on Megaparsec scales and\nhow they assemble and shape the Cosmic Web. The study is based on a N$_{\\rm\nPart}=512^3$ $\\Lambda$CDM dark matter only N-body simulation in a\n(300$h^{-1}$~Mpc)$^3$ box at $z=0$. We invoke the density field NEXUS+\nmultiscale morphological procedure to assign the appropriate morphological\nfeature to each location. We then determine the contribution by each of the\ncosmic web components to the local gravitational and tidal forces. We find that\nfilaments are, by far, the dominant dynamical component in the interior of\nfilaments, in the majority of underdense void regions and in all wall regions.\nThe gravitational influence of cluster nodes is limited, and they are only\ndominant in their immediate vicinity. The force field induced by voids is\nmarked by divergent outflowing patterns, yielding the impression of a segmented\nvolume in which voids push matter towards their boundaries. Voids manifest\nthemselves strongly in the tidal field as a cellular tapestry that is closely\nlinked to the multiscale cosmic web. However, even within the interior of\nvoids, the dynamical influence of the surrounding filaments is stronger than\nthe outward push by voids. Therefore, the dynamics of voids cannot be\nunderstood without taking into account the influence of the environment. We\nconclude that filaments constitute the overpowering gravitational agent of the\ncosmic web, while voids are responsible for the cosmic web's spatial\norganisation and hence of its spatial connectivity.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}