{"id":"2407.01912","title":"Relay-Assisted Carrier Aggregation (RACA) Uplink System for Enhancing\n  Data Rate of Extended Reality (XR)","authors":"Chi-Wei Chen, Wen-Chiao Tsai, Lung-Sheng Tsai, and An-Yeu (Andy) Wu","authorsParsed":[["Chen","Chi-Wei","","Andy"],["Tsai","Wen-Chiao","","Andy"],["Tsai","Lung-Sheng","","Andy"],["An-Yeu","","","Andy"],["Wu","",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 03:22:43 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 12:00:02 GMT"}],"updateDate":"2024-07-17","timestamp":1719890563000,"abstract":"  In Extended Reality (XR) applications, high data rates and low latency are\ncrucial for immersive experiences. Uplink transmission in XR is challenging due\nto the limited antennas and power of lightweight XR devices. To improve data\ntransmission rates, we investigate a relay-assisted carrier aggregation (RACA)\nsystem. The XR device simultaneously transmits data to an access point (AP) and\na relay in proximity over low-frequency and high-frequency bands, respectively.\nThen, the relay down-converts and amplifies the signals to the AP, effectively\nacting as an additional transmit antenna for the XR device. In this paper, we\npropose two algorithms to maximize the data rate of the XR device in their\nrespective protocols. In the centralized protocol, the rate maximization\nproblem is equivalently transformed as a weighted mean square error\nminimization (WMMSE) problem which can be solved iteratively by alternative\noptimization. In the distributed protocol, the rate maximization problem is\ndecomposed into two independent sub-problems where the rate of the direct link\nand the rate of the relay link are maximized by singular value decomposition\n(SVD)-based methods with water-filling (WF). Simulation results show that the\nrate of the RACA system is improved by $32\\%$ compared to that of the\nconventional carrier aggregation scheme.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}