{"id":"2407.05228","title":"Thermal Preconditioning of Membrane Stress to Control the Shapes of\n  Ultrathin Crystals","authors":"Hao Wan, Geunwoong Jeon, Gregory M. Grason, Maria M. Santore","authorsParsed":[["Wan","Hao",""],["Jeon","Geunwoong",""],["Grason","Gregory M.",""],["Santore","Maria M.",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 01:48:15 GMT"}],"updateDate":"2024-07-09","timestamp":1720316895000,"abstract":"  We employ the phospholipid bilayer membranes of giant unilamellar vesicles as\na free-standing environment for the growth of membrane-integrated ultrathin\nphospholipid crystals possessing a variety of shapes with 6-fold symmetry.\nCrystal growth within vesicle membranes, where more elaborate shapes grow on\nlarger vesicles is dominated by the bending energy of the membrane itself,\ncreating a means to manipulate crystal morphology. Here we demonstrate how\ncooling rate preconditions the membrane tension before nucleation, in turn\nregulating nucleation and growth, and directing the morphology of crystals by\nthe time they are large enough to be visualized. The crystals retain their\nshapes during further growth through the two phase region. Experiments\ndemonstrate this behavior for single crystals growing within the membrane of\neach vesicle, ultimately comprising up to 13% of the vesicle area and length\nscales of up to 50 microns. A model for stress evolution, employing only\nphysical property data, reveals how the competition between thermal membrane\ncontraction and water diffusion from tensed vesicles produces a size- and\ntime-dependence of the membrane tension as a result of cooling history. The\ntension, critical in the contribution of bending energy in the fluid membrane\nregions, in turn selects for crystal shape for vesicles of a given size. The\nmodel reveals unanticipated behaviors including a low steady state tension on\nsmall vesicles that allows compact domains to develop, rapid tension\ndevelopment on large vesicles producing flower-shaped domains, and a stress\nrelaxation through water diffusion across the membrane with a time constant\nscaling as the square of the vesicle radius, consistent with measurable\ntensions only in the largest vesicles.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}