{"id":"2407.21578","title":"Algorithmic methods of finite discrete structures. Topological graph\n  drawing (part II)","authors":"Sergey Kurapov, Maxim Davidovsky","authorsParsed":[["Kurapov","Sergey",""],["Davidovsky","Maxim",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 13:07:34 GMT"}],"updateDate":"2024-08-01","timestamp":1722431254000,"abstract":"  A visualized graph is a powerful tool for data analysis and synthesis tasks.\nIn this case, the task of visualization constitutes not only in displaying\nvertices and edges according to the graph representation, but also in ensuring\nthat the result is visually simple and comprehensible for a human. Thus, the\nvisualization process involves solving several problems, one of which is the\nproblem of constructing a topological drawing of a planar part of a non-planar\ngraph with a minimum number of removed edges. In this manuscript, we consider a\nmathematical model for representing the topological drawing of a graph, which\nis based on methods of the theory of vertex rotation with the induction of\nsimple cycles that satisfy the Mac Lane planarity criterion. It is shown that\nthe topological drawing of a non-planar graph can be constructed on the basis\nof a selected planar part of the graph. The topological model of a graph\ndrawing allows us to reduce the brute-force enumeration problem of identifying\na plane graph to a discrete optimization problem - searching for a subset of\nthe set of isometric cycles of the graph that satisfy the zero value of the Mac\nLane's functional. To isolate the planar part of the graph, a new computational\nmethod has been developed based on linear algebra and the algebra of structural\nnumbers. The proposed method has polynomial computational complexity.\n","subjects":["Mathematics/Combinatorics","Computing Research Repository/Discrete Mathematics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"wXL2MjrZIEC2r8-_YJuGU71s5w21ebW2rXfj1YJc1ro","pdfSize":"3399751"}
