{"id":"2407.15865","title":"A Survey of AI-Powered Mini-Grid Solutions for a Sustainable Future in\n  Rural Communities","authors":"Craig Pirie, Harsha Kalutarage, Muhammad Shadi Hajar, Nirmalie\n  Wiratunga, Subodha Charles, Geeth Sandaru Madhushan, Priyantha Buddhika,\n  Supun Wijesiriwardana, Akila Dimantha, Kithdara Hansamal, Shalitha\n  Pathiranage","authorsParsed":[["Pirie","Craig",""],["Kalutarage","Harsha",""],["Hajar","Muhammad Shadi",""],["Wiratunga","Nirmalie",""],["Charles","Subodha",""],["Madhushan","Geeth Sandaru",""],["Buddhika","Priyantha",""],["Wijesiriwardana","Supun",""],["Dimantha","Akila",""],["Hansamal","Kithdara",""],["Pathiranage","Shalitha",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 20:23:38 GMT"}],"updateDate":"2024-07-24","timestamp":1721247818000,"abstract":"  This paper presents a comprehensive survey of AI-driven mini-grid solutions\naimed at enhancing sustainable energy access. It emphasises the potential of\nmini-grids, which can operate independently or in conjunction with national\npower grids, to provide reliable and affordable electricity to remote\ncommunities. Given the inherent unpredictability of renewable energy sources\nsuch as solar and wind, the necessity for accurate energy forecasting and\nmanagement is discussed, highlighting the role of advanced AI techniques in\nforecasting energy supply and demand, optimising grid operations, and ensuring\nsustainable energy distribution. This paper reviews various forecasting models,\nincluding statistical methods, machine learning algorithms, and hybrid\napproaches, evaluating their effectiveness for both short-term and long-term\npredictions. Additionally, it explores public datasets and tools such as\nProphet, NeuralProphet, and N-BEATS for model implementation and validation.\nThe survey concludes with recommendations for future research, addressing\nchallenges in model adaptation and optimisation for real-world applications.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"90Tb9Y-SvcXu4ONy7drYSLVHc6RwKcFQngcxl0NJb98","pdfSize":"1125916"}
