{"id":"2407.06552","title":"DLOVE: A new Security Evaluation Tool for Deep Learning Based\n  Watermarking Techniques","authors":"Sudev Kumar Padhi and Sk. Subidh Ali","authorsParsed":[["Padhi","Sudev Kumar",""],["Ali","Sk. Subidh",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 05:18:14 GMT"}],"updateDate":"2024-07-10","timestamp":1720502294000,"abstract":"  Recent developments in Deep Neural Network (DNN) based watermarking\ntechniques have shown remarkable performance. The state-of-the-art DNN-based\ntechniques not only surpass the robustness of classical watermarking techniques\nbut also show their robustness against many image manipulation techniques. In\nthis paper, we performed a detailed security analysis of different DNN-based\nwatermarking techniques. We propose a new class of attack called the Deep\nLearning-based OVErwriting (DLOVE) attack, which leverages adversarial machine\nlearning and overwrites the original embedded watermark with a targeted\nwatermark in a watermarked image. To the best of our knowledge, this attack is\nthe first of its kind. We have considered scenarios where watermarks are used\nto devise and formulate an adversarial attack in white box and black box\nsettings. To show adaptability and efficiency, we launch our DLOVE attack\nanalysis on seven different watermarking techniques, HiDDeN, ReDMark, PIMoG,\nStegastamp, Aparecium, Distortion Agostic Deep Watermarking and Hiding Images\nin an Image. All these techniques use different approaches to create\nimperceptible watermarked images. Our attack analysis on these watermarking\ntechniques with various constraints highlights the vulnerabilities of DNN-based\nwatermarking. Extensive experimental results validate the capabilities of\nDLOVE. We propose DLOVE as a benchmark security analysis tool to test the\nrobustness of future deep learning-based watermarking techniques.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"642ij5XChb3seSUbX2xtt9Bl4gPFIOAbDk0EU1gRdpg","pdfSize":"9486781"}
