{"id":"2407.02052","title":"The USTC-NERCSLIP Systems for The ICMC-ASR Challenge","authors":"Minghui Wu, Luzhen Xu, Jie Zhang, Haitao Tang, Yanyan Yue, Ruizhi\n  Liao, Jintao Zhao, Zhengzhe Zhang, Yichi Wang, Haoyin Yan, Hongliang Yu,\n  Tongle Ma, Jiachen Liu, Chongliang Wu, Yongchao Li, Yanyong Zhang, Xin Fang,\n  Yue Zhang","authorsParsed":[["Wu","Minghui",""],["Xu","Luzhen",""],["Zhang","Jie",""],["Tang","Haitao",""],["Yue","Yanyan",""],["Liao","Ruizhi",""],["Zhao","Jintao",""],["Zhang","Zhengzhe",""],["Wang","Yichi",""],["Yan","Haoyin",""],["Yu","Hongliang",""],["Ma","Tongle",""],["Liu","Jiachen",""],["Wu","Chongliang",""],["Li","Yongchao",""],["Zhang","Yanyong",""],["Fang","Xin",""],["Zhang","Yue",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 08:30:51 GMT"}],"updateDate":"2024-07-03","timestamp":1719909051000,"abstract":"  This report describes the submitted system to the In-Car Multi-Channel\nAutomatic Speech Recognition (ICMC-ASR) challenge, which considers the ASR task\nwith multi-speaker overlapping and Mandarin accent dynamics in the ICMC case.\nWe implement the front-end speaker diarization using the self-supervised\nlearning representation based multi-speaker embedding and beamforming using the\nspeaker position, respectively. For ASR, we employ an iterative pseudo-label\ngeneration method based on fusion model to obtain text labels of unsupervised\ndata. To mitigate the impact of accent, an Accent-ASR framework is proposed,\nwhich captures pronunciation-related accent features at a fine-grained level\nand linguistic information at a coarse-grained level. On the ICMC-ASR eval set,\nthe proposed system achieves a CER of 13.16% on track 1 and a cpCER of 21.48%\non track 2, which significantly outperforms the official baseline system and\nobtains the first rank on both tracks.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Sound"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}