{"id":"2407.01598","title":"Long-Term Prediction Accuracy Improvement of Data-Driven Medium-Range\n  Global Weather Forecast","authors":"Yifan Hu, Fukang Yin, Weimin Zhang, Kaijun Ren, Junqiang Song, Kefeng\n  Deng, Di Zhang","authorsParsed":[["Hu","Yifan",""],["Yin","Fukang",""],["Zhang","Weimin",""],["Ren","Kaijun",""],["Song","Junqiang",""],["Deng","Kefeng",""],["Zhang","Di",""]],"versions":[{"version":"v1","created":"Wed, 26 Jun 2024 02:06:27 GMT"}],"updateDate":"2024-07-03","timestamp":1719367587000,"abstract":"  Long-term stability stands as a crucial requirement in data-driven\nmedium-range global weather forecasting. Spectral bias is recognized as the\nprimary contributor to instabilities, as data-driven methods difficult to learn\nsmall-scale dynamics. In this paper, we reveal that the universal mechanism for\nthese instabilities is not only related to spectral bias but also to\ndistortions brought by processing spherical data using conventional\nconvolution. These distortions lead to a rapid amplification of errors over\nsuccessive long-term iterations, resulting in a significant decline in forecast\naccuracy. To address this issue, a universal neural operator called the\nSpherical Harmonic Neural Operator (SHNO) is introduced to improve long-term\niterative forecasts. SHNO uses the spherical harmonic basis to mitigate\ndistortions for spherical data and uses gated residual spectral attention\n(GRSA) to correct spectral bias caused by spurious correlations across\ndifferent scales. The effectiveness and merit of the proposed method have been\nvalidated through its application for spherical Shallow Water Equations (SWEs)\nand medium-range global weather forecasting. Our findings highlight the\nbenefits and potential of SHNO to improve the accuracy of long-term prediction.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"v_LEO28oGO2fS9WmhTZvfRzICBxywLkfa1F_EmJ12pU","pdfSize":"6987140"}
