{"id":"2407.01135","title":"Transport signatures of single and multiple Floquet Majorana modes in\n  one-dimensional Rashba nanowire and Shiba chain","authors":"Debashish Mondal, Rekha Kumari, Tanay Nag, Arijit Saha","authorsParsed":[["Mondal","Debashish",""],["Kumari","Rekha",""],["Nag","Tanay",""],["Saha","Arijit",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 09:58:22 GMT"}],"updateDate":"2024-07-02","timestamp":1719827902000,"abstract":"  We theoretically investigate the transport signature of single and multiple\nFloquet Majorana end modes~(FMEMs), appearing in an experimentally feasible\nsetup with Rashba nanowire~(NW) placed in closed proximity to a conventional\n$s$-wave superconductor, in the presence of an external Zeeman field. Periodic\ndrive causes the anomalous $\\pi$-modes to emerge in addition to the regular\n$0$-modes in the driven system where the former does not exhibit any static\nanalog. For single $0$- and/or $\\pi$-FMEM, differential conductance exhibits a\nquantized value of $2e^{2}/h$ while we consider the sum over all the photon\nsectors, supporting Floquet sum rule. We examine the stability of this summed\nconductance against random onsite disorder. We further investigate the summed\nconductance in several cases hosting multiple~(more than one) $0$- or\n$\\pi$-modes at the end of the NW. In these cases, we obtain quantized values of\n$n\\times 2e^{2}/h$ of summed conductance with $n$ being the number of\nmodes~($0$ / $\\pi$) located at one end of NW. We repeat our analysis for\nanother experimentally realizable model system known as helical Shiba chain.\nMoreover, we corroborate our results by computing the differential conductance\nfor FMEMs using non-equilibrium Green's function method. Our work opens up the\npossibility of studying the transport signatures of FMEMs in these realistic\nmodels.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}