{"id":"2407.15558","title":"Retinomorphic Machine Vision in a Network Laser","authors":"Wai Kit Ng, Jakub Dranczewski, Anna Fischer, T V Raziman, Dhruv\n  Saxena, Tobias Farchy, Kilian Stenning, Jonathan Peters, Heinz Schmid, Will R\n  Branford, Mauricio Barahona, Kirsten Moselund, Riccardo Sapienza and Jack C.\n  Gartside","authorsParsed":[["Ng","Wai Kit",""],["Dranczewski","Jakub",""],["Fischer","Anna",""],["Raziman","T V",""],["Saxena","Dhruv",""],["Farchy","Tobias",""],["Stenning","Kilian",""],["Peters","Jonathan",""],["Schmid","Heinz",""],["Branford","Will R",""],["Barahona","Mauricio",""],["Moselund","Kirsten",""],["Sapienza","Riccardo",""],["Gartside","Jack C.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 11:42:34 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 15:53:03 GMT"},{"version":"v3","created":"Fri, 2 Aug 2024 13:17:06 GMT"}],"updateDate":"2024-08-05","timestamp":1721648554000,"abstract":"  With the growing prevalence of AI, demand increases for efficient machine\nlearning hardware. Physical systems are sought which combine image feature\ndetection with the essential nonlinearity for tasks such as image\nclassification. Existing physical hardware typically detects features linearly,\nthen employs digital processing for nonlinear activation. Biological vision\nsystems excel at nonlinear image processing. The retina detects features in\nganglion cells via lateral inhibition, where cells nonlinearly compete for\nneuronal firing while supressing neighbouring cells.\n  We present a bio-inspired 'retinomorphic' machine vision platform using an\non-chip semiconductor network laser. The system detects multiple features in\nparallel via spatially-overlapping lasing modes, with integrated nonlinearity\nprovided by antagonistic gain competition between modes - a photonic analogue\nof retinal inhibition. Parallel feature-detection enhances efficiency relative\nto feature-detection schemes which operate sequentially or via multiple device\ncopies, with Si-compatible processing and a compact micron-scale footprint\nrelative to existing mm-scale systems. We report 98.05% accuracy on\nMNIST-digits and 87.85% on Fashion-MNIST, with strong performance on short\ntraining datasets.\n","subjects":["Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"pVk4-7ZL3pAnCstHMiNf2xkhI5WGlMXTYimJ8xmff8o","pdfSize":"33890222"}
