{"id":"2407.08804","title":"Coherent Organization of Passive Scalar from a Point-Source in a\n  Turbulent Boundary Layer","authors":"Isaiah E. Wall, Gokul Pathikonda","authorsParsed":[["Wall","Isaiah E.",""],["Pathikonda","Gokul",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 18:24:24 GMT"}],"updateDate":"2024-07-15","timestamp":1720722264000,"abstract":"  The spatial organization of a passive scalar plume originating from a point\nsource in a boundary layer is studied to understand its meandering\ncharacteristics. We focus shortly downstream of the isokinetic injection\n($1.5\\le x/\\delta \\le 3$, $\\delta$ being boundary layer thickness) where the\nscalar concentration is highly intermittent, the plume rapidly meanders, and\nbreaks-up into concentrated scalar pockets due to the action of turbulent\nstructures. Two injection locations were considered: the center of\nlogarithmic-region and the wake-region of the boundary layer. Simultaneous\nquantitative planar laser-induced fluorescence (PLIF) and particle-image\nvelocimetry (PIV) were performed in a wind-tunnel, using acetone vapors to\nmeasure scalar mixture fraction and velocity fields. Single- and multi-point\nstatistics were compared to established works to validate the diagnostic\nnovelties. Additionally, the spatial characteristics of the plume intermittency\nwere quantified using `blob' size, shape, orientation and mean concentration.\nIt was observed that straining and break up were the primary plume-evolution\nmodes in this region, with little small-scale homogenization. Further, the\ndominant role of coherent vortex motions in meandering and break-up of the\nplume was evident. Their action is found to be the primary mechanism by which\nthe scalar injected within the log-region is transported away from the wall\n(`large meander events'). Strong spatial correlation was observed in both\ninstantaneous and conditional fields between the high scalar concentration\nregions and the individual vortex heads. This coherent transport was weaker for\nwake-injection case, where the plume only interacts with outer vortex motions.\nA coherent-structure based mechanism is suggested to explain these transport\nmechanisms.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nxiIdMLqppkE3ZInwysc8NHUl7_HWbJWlx1zJL0G-5I","pdfSize":"10816636","objectId":"0x0d39e57e0bfa4d59ddbc1d45a65936b446fd0d3f27ca8c3d729141ea1756c88d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
