{"id":"2407.05263","title":"Impact of finite volume on kaon, antikaon, and $\\phi$ meson masses and\n  decay width in asymmetric strange hadronic matter","authors":"Zeeshan Ahmad, Nisha Chahal, Arvind Kumar, Suneel Dutt","authorsParsed":[["Ahmad","Zeeshan",""],["Chahal","Nisha",""],["Kumar","Arvind",""],["Dutt","Suneel",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 05:21:07 GMT"}],"updateDate":"2024-07-09","timestamp":1720329667000,"abstract":"  In the present work, we investigate the impact of finite volume on the\nin-medium properties of kaons ($K^+$, $K^0$) and antikaons ($K^-$,\n$\\bar{K^0}$), and $\\phi$ mesons in the isospin asymmetric strange hadronic\nmedium at finite density and temperature. We use the chiral SU(3) hadronic\nmean-field model, which accounts for the interactions between baryons through\nthe exchange of scalar ($\\sigma, \\zeta, \\delta $) and vector ($\\omega$, $\\rho$,\n$\\phi$) fields. To investigate the effects of finite volume, we apply the\nmultiple reflection expansion (MRE) technique for calculations of the density\nof states. The non-strange scalar field $\\sigma$ shows significant variation in\nan asymmetric medium, while the strange scalar field $\\zeta$ shows good\ndependency in the strange medium. We use the medium-modified masses of kaons\nand antikaons calculated using the chiral SU(3) model to obtain the masses and\ndecay width of $\\phi$ mesons in finite volume hadronic medium. To obtain the\nmasses and decay widths of $\\phi$ mesons, an effective Lagrangian approach with\n$\\phi$$K$$\\bar{K}$ interactions at one-loop level is used in the present work.\nWe obtain the effective masses and decay widths in the finite volume matter,\nfor the spherical geometry of the medium with Neumann and Dirichlet boundary\nconditions as well as for the cubic geometry. The finite volume effects are\nfound to be appreciable at high baryon densities.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tLxHsjEEOk91VxzMQYi7tUZ021FClcTjUo6NjLwkFcM","pdfSize":"637685"}
