{"id":"2407.02913","title":"SFC: Achieve Accurate Fast Convolution under Low-precision Arithmetic","authors":"Liulu He, Yufei Zhao, Rui Gao, Yuan Du, Li Du","authorsParsed":[["He","Liulu",""],["Zhao","Yufei",""],["Gao","Rui",""],["Du","Yuan",""],["Du","Li",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 08:38:14 GMT"}],"updateDate":"2024-07-04","timestamp":1719995894000,"abstract":"  Fast convolution algorithms, including Winograd and FFT, can efficiently\naccelerate convolution operations in deep models. However, these algorithms\ndepend on high-precision arithmetic to maintain inference accuracy, which\nconflicts with the model quantization. To resolve this conflict and further\nimprove the efficiency of quantized convolution, we proposes SFC, a new algebra\ntransform for fast convolution by extending the Discrete Fourier Transform\n(DFT) with symbolic computing, in which only additions are required to perform\nthe transformation at specific transform points, avoiding the calculation of\nirrational number and reducing the requirement for precision. Additionally, we\nenhance convolution efficiency by introducing correction terms to convert\ninvalid circular convolution outputs of the Fourier method into effective ones.\nThe numerical error analysis is presented for the first time in this type of\nwork and proves that our algorithms can provide a 3.68x multiplication\nreduction for 3x3 convolution, while the Winograd algorithm only achieves a\n2.25x reduction with similarly low numerical errors. Experiments carried out on\nbenchmarks and FPGA show that our new algorithms can further improve the\ncomputation efficiency of quantized models while maintaining accuracy,\nsurpassing both the quantization-alone method and existing works on fast\nconvolution quantization.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Numerical Analysis","Electrical Engineering and Systems Science/Image and Video Processing","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}