{"id":"2407.09928","title":"Results for pixel and strip centimeter-scale AC-LGAD sensors with a 120\n  GeV proton beam","authors":"Irene Dutta, Christopher Madrid, Ryan Heller, Shirsendu Nanda, Danush\n  Shekar, Claudio San Mart\\'in, Mat\\'ias Barr\\'ia, Artur Apresyan, Zhenyu Ye,\n  William K. Brooks, Wei Chen, Gabriele D'Amen, Gabriele Giacomini, Alessandro\n  Tricoli, Aram Hayrapetyan, Hakseong Lee, Ohannes Kamer K\\\"oseyan, Sergey Los,\n  Koji Nakamura, Sayuka Kita, Tomoka Imamura, Crist\\'ian Pe\\~na, Si Xie","authorsParsed":[["Dutta","Irene",""],["Madrid","Christopher",""],["Heller","Ryan",""],["Nanda","Shirsendu",""],["Shekar","Danush",""],["Martín","Claudio San",""],["Barría","Matías",""],["Apresyan","Artur",""],["Ye","Zhenyu",""],["Brooks","William K.",""],["Chen","Wei",""],["D'Amen","Gabriele",""],["Giacomini","Gabriele",""],["Tricoli","Alessandro",""],["Hayrapetyan","Aram",""],["Lee","Hakseong",""],["Köseyan","Ohannes Kamer",""],["Los","Sergey",""],["Nakamura","Koji",""],["Kita","Sayuka",""],["Imamura","Tomoka",""],["Peña","Cristían",""],["Xie","Si",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 15:49:28 GMT"}],"updateDate":"2024-07-16","timestamp":1720885768000,"abstract":"  We present the results of an extensive evaluation of strip and pixel AC-LGAD\nsensors tested with a 120 GeV proton beam, focusing on the influence of design\nparameters on the sensor temporal and spatial resolutions. Results show that\nreducing the thickness of pixel sensors significantly enhances their time\nresolution, with 20 $\\mu$m-thick sensors achieving around 20 ps. Uniform\nperformance is attainable with optimized sheet resistance, making these sensors\nideal for future timing detectors. Conversely, 20 $\\mu$m-thick strip sensors\nexhibit higher jitter than similar pixel sensors, negatively impacting time\nresolution, despite reduced Landau fluctuations with respect to the 50\n$\\mu$m-thick versions. Additionally, it is observed that a low resistivity in\nstrip sensors limits signal size and time resolution, whereas higher\nresistivity improves performance. This study highlights the importance of\ntuning the n$^{+}$ sheet resistance and suggests that further improvements\nshould target specific applications like the Electron-Ion Collider or other\nfuture collider experiments. In addition, the detailed performance of four\nAC-LGADs sensor designs is reported as examples of possible candidates for\nspecific detector applications. These advancements position AC-LGADs as\npromising candidates for future 4D tracking systems, pending the development of\nspecialized readout electronics.\n","subjects":["Physics/Instrumentation and Detectors","Physics/High Energy Physics - Experiment"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}