{"id":"2407.06616","title":"The influence of nitrogen ion implantation on the microstructure and\n  chemical composition of a thin layer on the biodegradable Zn-0.8Mg-0.2Sr\n  substrate","authors":"Jan Pinc, Petr Vlcak, Miroslav Lebeda, Vilem Bartunek, Vojtech Smola,\n  Marek Vronka, Jan Drahokoupil, Zdenek Weiss, Petr Svora, Hana Lesakova,\n  Katerina Sindelarova, Orsolya Molnarova, Tomas Horazdovsky, Tomas Studecky,\n  Pavel Salvetr, Jiri Kubasek, Jaroslav Capek and Andrea Skolakova","authorsParsed":[["Pinc","Jan",""],["Vlcak","Petr",""],["Lebeda","Miroslav",""],["Bartunek","Vilem",""],["Smola","Vojtech",""],["Vronka","Marek",""],["Drahokoupil","Jan",""],["Weiss","Zdenek",""],["Svora","Petr",""],["Lesakova","Hana",""],["Sindelarova","Katerina",""],["Molnarova","Orsolya",""],["Horazdovsky","Tomas",""],["Studecky","Tomas",""],["Salvetr","Pavel",""],["Kubasek","Jiri",""],["Capek","Jaroslav",""],["Skolakova","Andrea",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 07:46:52 GMT"}],"updateDate":"2024-07-10","timestamp":1720511212000,"abstract":"  In this research, the influence of the N+ ion implantation process on the\nmicrostructure of a biodegradable Zn-0.8Mg-0.2Sr alloy was investigated using\nvarious experimental techniques. Microscopic analysis revealed that a fluence\nof 17x10^17 ions/cm^2 resulted in the oversaturation of pure Zn and Mg2Zn11\nsurfaces, leading to the formation of nano/micro-porous layers up to 400 nm\nthick. The behavior of the Zn-0.8Mg-0.2Sr alloy was observed to be similar to\nthat of the individual pure phases, albeit without the creation of pore\nstructures. A limited formation of MgO and Mg3N2 was observed on the alloy\nsurface, although the overall presence of Mg significantly increased from 0.8\nto 15 wt.%. This increase was caused by the decomposition of the Mg2Zn11 phase\nduring the process and subsequent diffusion of Mg toward the surface. The\nabsence of Zn3N2 within the samples could be explained by the thermodynamic\ninstability and low Zn-N affinity. Despite the absence of zinc nitride, GD-OES\nconfirmed 10 at. % of nitrogen in the pure zinc, suggesting a possible\naccommodation of N atoms in the interstitial positions. This study points out\nto the complex nature of the process and highlights other promising directions\nfor future research.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}