{"id":"2407.13986","title":"Deep Feature Surgery: Towards Accurate and Efficient Multi-Exit Networks","authors":"Cheng Gong, Yao Chen, Qiuyang Luo, Ye Lu, Tao Li, Yuzhi Zhang, Yufei\n  Sun, Le Zhang","authorsParsed":[["Gong","Cheng",""],["Chen","Yao",""],["Luo","Qiuyang",""],["Lu","Ye",""],["Li","Tao",""],["Zhang","Yuzhi",""],["Sun","Yufei",""],["Zhang","Le",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 02:31:31 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 23:34:14 GMT"}],"updateDate":"2024-08-13","timestamp":1721356291000,"abstract":"  Multi-exit network is a promising architecture for efficient model inference\nby sharing backbone networks and weights among multiple exits. However, the\ngradient conflict of the shared weights results in sub-optimal accuracy. This\npaper introduces Deep Feature Surgery (\\methodname), which consists of feature\npartitioning and feature referencing approaches to resolve gradient conflict\nissues during the training of multi-exit networks. The feature partitioning\nseparates shared features along the depth axis among all exits to alleviate\ngradient conflict while simultaneously promoting joint optimization for each\nexit. Subsequently, feature referencing enhances multi-scale features for\ndistinct exits across varying depths to improve the model accuracy.\nFurthermore, \\methodname~reduces the training operations with the reduced\ncomplexity of backpropagation. Experimental results on Cifar100 and ImageNet\ndatasets exhibit that \\methodname~provides up to a \\textbf{50.00\\%} reduction\nin training time and attains up to a \\textbf{6.94\\%} enhancement in accuracy\nwhen contrasted with baseline methods across diverse models and tasks. Budgeted\nbatch classification evaluation on MSDNet demonstrates that DFS uses about\n$\\mathbf{2}\\boldsymbol{\\times}$ fewer average FLOPs per image to achieve the\nsame classification accuracy as baseline methods on Cifar100. The code is\navailable at https://github.com/GongCheng1919/dfs.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}