{"id":"2407.02919","title":"Efficient IoT Devices Localization Through Wi-Fi CSI Feature Fusion and\n  Anomaly Detection","authors":"Yan Li, Jie Yang, Shang-Ling Shih, Wan-Ting Shih, Chao-Kai Wen, and\n  Shi Jin","authorsParsed":[["Li","Yan",""],["Yang","Jie",""],["Shih","Shang-Ling",""],["Shih","Wan-Ting",""],["Wen","Chao-Kai",""],["Jin","Shi",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 08:53:11 GMT"}],"updateDate":"2024-07-04","timestamp":1719996791000,"abstract":"  Internet of Things (IoT) device localization is fundamental to smart home\nfunctionalities, including indoor navigation and tracking of individuals.\nTraditional localization relies on relative methods utilizing the positions of\nanchors within a home environment, yet struggles with precision due to inherent\ninaccuracies in these anchor positions. In response, we introduce a\ncutting-edge smartphone-based localization system for IoT devices, leveraging\nthe precise positioning capabilities of smartphones equipped with motion\nsensors. Our system employs artificial intelligence (AI) to merge channel state\ninformation from proximal trajectory points of a single smartphone,\nsignificantly enhancing line of sight (LoS) angle of arrival (AoA) estimation\naccuracy, particularly under severe multipath conditions. Additionally, we have\ndeveloped an AI-based anomaly detection algorithm to further increase the\nreliability of LoSAoA estimation. This algorithm improves measurement\nreliability by analyzing the correlation between the accuracy of reversed\nfeature reconstruction and the LoS-AoA estimation. Utilizing a straightforward\nleast squares algorithm in conjunction with accurate LoS-AoA estimation and\nsmartphone positional data, our system efficiently identifies IoT device\nlocations. Validated through extensive simulations and experimental tests with\na receiving antenna array comprising just two patch antenna elements in the\nhorizontal direction, our methodology has been shown to attain decimeter-level\nlocalization accuracy in nearly 90% of cases, demonstrating robust performance\neven in challenging real-world scenarios. Additionally, our proposed anomaly\ndetection algorithm trained on Wi-Fi data can be directly applied to\nultra-wideband, also outperforming the most advanced techniques.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}