{"id":"2407.18193","title":"Network Relaxations for Discrete Bilevel Optimization under Linear\n  Interactions","authors":"Leonardo Lozano and David Bergman and Andre Augusto Cire","authorsParsed":[["Lozano","Leonardo",""],["Bergman","David",""],["Cire","Andre Augusto",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 16:57:53 GMT"}],"updateDate":"2024-07-26","timestamp":1721926673000,"abstract":"  We investigate relaxations for a class of discrete bilevel programs where the\ninteraction constraints linking the leader and the follower are linear. Our\napproach reformulates the upper-level optimality constraints by projecting the\nleader's decisions onto vectors that map to distinct follower solution values,\neach referred to as a state. Based on such a state representation, we develop a\nnetwork-flow linear program via a decision diagram that captures the convex\nhull of the follower's value function graph, leading to a new single-level\nreformulation of the bilevel problem. We also present a reduction procedure\nthat exploits symmetry to identify the reformulation of minimal size. For large\nnetworks, we introduce parameterized relaxations that aggregate states by\nconsidering tractable hyperrectangles based on lower and upper bounds\nassociated with the interaction constraints, and can be integrated into\nexisting mixed-integer bilevel linear programming (MIBLP) solvers. Numerical\nexperiments suggest that the new relaxations, whether used within a simple\ncutting-plane procedure or integrated into state-of-the-art MIBLP solvers,\nsignificantly reduce runtimes or solve additional benchmark instances. Our\nfindings also highlight the correlation between the quality of relaxations and\nthe properties of the interaction matrix, underscoring the potential of our\napproach in enhancing solution methods for structured bilevel optimization\ninstances.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}