{"id":"2407.18066","title":"Multi-Agent Deep Reinforcement Learning for Resilience Optimization in\n  5G RAN","authors":"Soumeya Kaada, Dinh-Hieu Tran, Nguyen Van Huynh, Marie-Line Alberi\n  Morel, Sofiene Jelassi, Gerardo Rubino","authorsParsed":[["Kaada","Soumeya",""],["Tran","Dinh-Hieu",""],["Van Huynh","Nguyen",""],["Morel","Marie-Line Alberi",""],["Jelassi","Sofiene",""],["Rubino","Gerardo",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 14:19:59 GMT"}],"updateDate":"2024-07-26","timestamp":1721917199000,"abstract":"  Resilience is defined as the ability of a network to resist, adapt, and\nquickly recover from disruptions, and to continue to maintain an acceptable\nlevel of services from users' perspective. With the advent of future radio\nnetworks, including advanced 5G and upcoming 6G, critical services become\nintegral to future networks, requiring uninterrupted service delivery for end\nusers. Unfortunately, with the growing network complexity, user mobility and\ndiversity, it becomes challenging to scale current resilience management\ntechniques that rely on local optimizations to large dense network deployments.\nThis paper aims to address this problem by globally optimizing the resilience\nof a dense multi-cell network based on multi-agent deep reinforcement learning.\nSpecifically, our proposed solution can dynamically tilt cell antennas and\nreconfigure transmit power to mitigate outages and increase both coverage and\nservice availability. A multi-objective optimization problem is formulated to\nsimultaneously satisfy resiliency constraints while maximizing the service\nquality in the network area in order to minimize the impact of outages on\nneighbouring cells. Extensive simulations then demonstrate that with our\nproposed solution, the average service availability in terms of user throughput\ncan be increased by up to 50-60% on average, while reaching a coverage\navailability of 99% in best cases.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}