{"id":"2407.00303","title":"Krenn-Gu conjecture for sparse graphs","authors":"L. Sunil Chandran, Rishikesh Gajjala, Abraham M. Illickan","authorsParsed":[["Chandran","L. Sunil",""],["Gajjala","Rishikesh",""],["Illickan","Abraham M.",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 03:51:14 GMT"}],"updateDate":"2024-07-02","timestamp":1719633074000,"abstract":"  Greenberger-Horne-Zeilinger (GHZ) states are quantum states involving at\nleast three entangled particles. They are of fundamental interest in quantum\ninformation theory, and the construction of such states of high dimension has\nvarious applications in quantum communication and cryptography. They are of\nfundamental interest in quantum information theory, and the construction of\nsuch states of high dimension has various applications in quantum communication\nand cryptography. Krenn, Gu and Zeilinger discovered a correspondence between a\nlarge class of quantum optical experiments which produce GHZ states and\nedge-weighted edge-coloured multi-graphs with some special properties called\nthe \\emph{GHZ graphs}. On such GHZ graphs, a graph parameter called\n\\emph{dimension} can be defined, which is the same as the dimension of the GHZ\nstate produced by the corresponding experiment. Krenn and Gu conjectured that\nthe dimension of any GHZ graph with more than $4$ vertices is at most $2$. An\naffirmative resolution of the Krenn-Gu conjecture has implications for quantum\nresource theory. On the other hand, the construction of a GHZ graph on a large\nnumber of vertices with a high dimension would lead to breakthrough results.\n  In this paper, we study the existence of GHZ graphs from the perspective of\nthe Krenn-Gu conjecture and show that the conjecture is true for graphs of\nvertex connectivity at most 2 and for cubic graphs. We also show that the\nminimal counterexample to the conjecture should be $4$-connected. Such\ninformation could be of great help in the search for GHZ graphs using existing\ntools like PyTheus. While the impact of the work is in quantum physics, the\ntechniques in this paper are purely combinatorial, and no background in quantum\nphysics is required to understand them.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Discrete Mathematics","Mathematics/Combinatorics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HOO7c3xHva6IgVhnJw3zyx3jYvgDsOacumgs5AKGUEk","pdfSize":"992194"}
