{"id":"2407.07478","title":"EA-VTR: Event-Aware Video-Text Retrieval","authors":"Zongyang Ma, Ziqi Zhang, Yuxin Chen, Zhongang Qi, Chunfeng Yuan, Bing\n  Li, Yingmin Luo, Xu Li, Xiaojuan Qi, Ying Shan, Weiming Hu","authorsParsed":[["Ma","Zongyang",""],["Zhang","Ziqi",""],["Chen","Yuxin",""],["Qi","Zhongang",""],["Yuan","Chunfeng",""],["Li","Bing",""],["Luo","Yingmin",""],["Li","Xu",""],["Qi","Xiaojuan",""],["Shan","Ying",""],["Hu","Weiming",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 09:09:58 GMT"}],"updateDate":"2024-07-11","timestamp":1720602598000,"abstract":"  Understanding the content of events occurring in the video and their inherent\ntemporal logic is crucial for video-text retrieval. However, web-crawled\npre-training datasets often lack sufficient event information, and the widely\nadopted video-level cross-modal contrastive learning also struggles to capture\ndetailed and complex video-text event alignment. To address these challenges,\nwe make improvements from both data and model perspectives. In terms of\npre-training data, we focus on supplementing the missing specific event content\nand event temporal transitions with the proposed event augmentation strategies.\nBased on the event-augmented data, we construct a novel Event-Aware Video-Text\nRetrieval model, ie, EA-VTR, which achieves powerful video-text retrieval\nability through superior video event awareness. EA-VTR can efficiently encode\nframe-level and video-level visual representations simultaneously, enabling\ndetailed event content and complex event temporal cross-modal alignment,\nultimately enhancing the comprehensive understanding of video events. Our\nmethod not only significantly outperforms existing approaches on multiple\ndatasets for Text-to-Video Retrieval and Video Action Recognition tasks, but\nalso demonstrates superior event content perceive ability on Multi-event\nVideo-Text Retrieval and Video Moment Retrieval tasks, as well as outstanding\nevent temporal logic understanding ability on Test of Time task.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}