{"id":"2407.04115","title":"LiDAR-based Real-Time Object Detection and Tracking in Dynamic\n  Environments","authors":"Wenqiang Du, Giovanni Beltrame","authorsParsed":[["Du","Wenqiang",""],["Beltrame","Giovanni",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 18:38:25 GMT"}],"updateDate":"2024-07-08","timestamp":1720118305000,"abstract":"  In dynamic environments, the ability to detect and track moving objects in\nreal-time is crucial for autonomous robots to navigate safely and effectively.\nTraditional methods for dynamic object detection rely on high accuracy odometry\nand maps to detect and track moving objects. However, these methods are not\nsuitable for long-term operation in dynamic environments where the surrounding\nenvironment is constantly changing. In order to solve this problem, we propose\na novel system for detecting and tracking dynamic objects in real-time using\nonly LiDAR data. By emphasizing the extraction of low-frequency components from\nLiDAR data as feature points for foreground objects, our method significantly\nreduces the time required for object clustering and movement analysis.\nAdditionally, we have developed a tracking approach that employs\nintensity-based ego-motion estimation along with a sliding window technique to\nassess object movements. This enables the precise identification of moving\nobjects and enhances the system's resilience to odometry drift. Our experiments\nshow that this system can detect and track dynamic objects in real-time with an\naverage detection accuracy of 88.7\\% and a recall rate of 89.1\\%. Furthermore,\nour system demonstrates resilience against the prolonged drift typically\nassociated with front-end only LiDAR odometry. All of the source code, labeled\ndataset, and the annotation tool are available at:\nhttps://github.com/MISTLab/lidar_dynamic_objects_detection.git\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"C__6Ff86OmX1Qge4T_Oc7CldrYSUVwO0QXv1auQ5aWs","pdfSize":"4668767"}
