{"id":"2407.18522","title":"First-principles investigation of the physical properties of wide band\n  gap hexagonal AlPO4 compound for possible applications","authors":"A.S.M. Muhasin Reza, Md. Asif Afzal, S.H. Naqib","authorsParsed":[["Reza","A. S. M. Muhasin",""],["Afzal","Md. Asif",""],["Naqib","S. H.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 05:38:43 GMT"}],"updateDate":"2024-07-29","timestamp":1721972323000,"abstract":"  In this study, using the density functional theory, we have investigated the\nbulk physical properties like structural, electronic band structure, elastic\nproperties, thermal properties, optical properties and bonding features of\nAlPO4 compound in the hexagonal form. The values of our optimized structural\nparameters are very close to the previous results. Most of the results\npresented in this work are novel. The elastic constants indicate that AlPO4 is\nmechanically stable and brittle in nature. The compound is moderately hard and\npossesses low machinability index. AlPO4 contains significant elastic\nanisotropy. The charge density distribution , bond population analysis, Vickers\nhardness, thermo-mechanical properties, and optical properties have been\ninvestigated for the first time. The electronic band structure calculations\nreveal clear insulating behavior with a band gap of 6.0 eV. Band structure\ncalculations were carried out without and with spin-orbit coupling (SOC) to\nexplore possible topological signature. The energy dependent optical properties\nconform to the electronic band structure calculations. Major optical properties\nlike dielectric functions, refractive index, photoconductivity, absorption\ncoefficient, loss function and reflectivity are calculated and discussed in\ndetail in this study. The compound is optically anisotropic. It is an efficient\nabsorber and reflector of the ultraviolet light.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}