{"id":"2407.14319","title":"Neutrino-driven Core-collapse Supernova Yields in Galactic Chemical\n  Evolution","authors":"Finia P. Jost, Marta Molero, Gerard Nav\\'o, Almudena Arcones, Martin\n  Obergaulinger, and Francesca Matteucci","authorsParsed":[["Jost","Finia P.",""],["Molero","Marta",""],["Navó","Gerard",""],["Arcones","Almudena",""],["Obergaulinger","Martin",""],["Matteucci","Francesca",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 13:54:16 GMT"}],"updateDate":"2024-07-22","timestamp":1721397256000,"abstract":"  We provide yields from 189 neutrino-driven core-collapse supernova (CCSN)\nsimulations covering zero-age main sequence masses between 11 and 75 solar\nmasses and three different metallicities. Our CCSN simulations have two main\nadvantages compared to previous methods used for applications in Galactic\nchemical evolution (GCE). Firstly, the mass cut between remnant and ejecta\nevolves naturally. Secondly, the neutrino luminosities and thus the electron\nfraction are not modified. Both is key to obtain an accurate nucleosynthesis.\nWe follow the composition with an in-situ nuclear reaction network including\nthe 16 most abundant isotopes and use the yields as input in a GCE model of the\nMilky Way. We adopt a GCE which takes into account infall of gas as well as\nnucleosynthesis from a large variety of stellar sources. The GCE model is\ncalibrated to reproduce the main features of the solar vicinity. For the CCSN\nmodels, we use different calibrations and propagate the uncertainty. We find a\nbig impact of the CCSN yields on our GCE predictions. We compare the abundance\nratios of C, O, Ne, Mg, Si, S, Ar, Ca, Ti, and Cr with respect to Fe to an\nobservational data set as homogeneous as possible. From this, we conclude that\nat least half of the massive stars have to explode to match the observed\nabundance ratios. If the explosions are too energetic, the high amount of iron\nwill suppress the abundance ratios. With this, we demonstrate how GCE models\ncan be used to constrain the evolution and deaths of massive stars.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}