{"id":"2407.16631","title":"Nanoscale Water Behavior and Its Impact on Adsorption: A case study with\n  CNTs and Diclofenac","authors":"Patrick R. B. C\\^ortes, Nicol\\'as A. Loubet, Cintia A. Men\\'endez,\n  Gustavo A. Appignanesi, Mateus H. K\\\"ohler, and Jos\\'e Rafael Bordin","authorsParsed":[["Côrtes","Patrick R. B.",""],["Loubet","Nicolás A.",""],["Menéndez","Cintia A.",""],["Appignanesi","Gustavo A.",""],["Köhler","Mateus H.",""],["Bordin","José Rafael",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 16:43:44 GMT"}],"updateDate":"2024-07-24","timestamp":1721753024000,"abstract":"  Water is a fundamental component of life, playing a critical role in\nregulating metabolic processes and facilitating the dissolution and transport\nof essential molecules. However, the presence of emerging contaminants, such as\npharmaceuticals, poses significant challenges to water quality and safety.\nNanomaterials-based technologies arise as a promising tool to remove those\ncontaminants from water. Nevertheless, interfacial water plays a major role in\nthe adsorption of chemical compounds in the nanomaterials - as it plays in\nbiological processes such as protein folding, enzyme activity, and drug\ndelivery. To understand this role, in this study we employ Molecular Dynamics\n(MD) simulations to explore the adsorption dynamics of potassium diclofenac\n(K-DCF) on single-walled (SWCNT) and double-walled (DWCNT) carbon nanotubes,\nconsidering both dry and wet conditions. Our findings reveal that the\nstructuring of water molecules around CNTs creates hydration layers that\nsignificantly influence the accessibility of active sites and the interaction\nstrength between contaminants and adsorbents. Our analysis indicates higher\nenergy barriers for adsorption in DWCNTs compared to SWCNTs, which is\nattributed to stronger water-surface interactions. This research highlights the\nimportance of understanding nanoscale water behavior for optimizing the design\nand functionality of nanomaterials for water purification. These findings can\nguide the development of more efficient and selective nanomaterials, enhancing\ncontaminant removal and ensuring safer water resources, while also contributing\nto a deeper understanding of fundamental biological interactions.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}