{"id":"2407.09999","title":"Pay Less On Clinical Images: Asymmetric Multi-Modal Fusion Method For\n  Efficient Multi-Label Skin Lesion Classification","authors":"Peng Tang, Tobias Lasser","authorsParsed":[["Tang","Peng",""],["Lasser","Tobias",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 20:46:04 GMT"}],"updateDate":"2024-07-16","timestamp":1720903564000,"abstract":"  Existing multi-modal approaches primarily focus on enhancing multi-label skin\nlesion classification performance through advanced fusion modules, often\nneglecting the associated rise in parameters. In clinical settings, both\nclinical and dermoscopy images are captured for diagnosis; however, dermoscopy\nimages exhibit more crucial visual features for multi-label skin lesion\nclassification. Motivated by this observation, we introduce a novel asymmetric\nmulti-modal fusion method in this paper for efficient multi-label skin lesion\nclassification. Our fusion method incorporates two innovative schemes. Firstly,\nwe validate the effectiveness of our asymmetric fusion structure. It employs a\nlight and simple network for clinical images and a heavier, more complex one\nfor dermoscopy images, resulting in significant parameter savings compared to\nthe symmetric fusion structure using two identical networks for both\nmodalities. Secondly, in contrast to previous approaches using mutual attention\nmodules for interaction between image modalities, we propose an asymmetric\nattention module. This module solely leverages clinical image information to\nenhance dermoscopy image features, considering clinical images as supplementary\ninformation in our pipeline. We conduct the extensive experiments on the\nseven-point checklist dataset. Results demonstrate the generality of our\nproposed method for both networks and Transformer structures, showcasing its\nsuperiority over existing methods We will make our code publicly available.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}