{"id":"2407.07396","title":"Infrared band strengths of dangling OH features in amorphous water at 20\n  K","authors":"Takeshi Hasegawa, Hiroto Yanagisawa, Takumi Nagasawa, Reo Sato, Naoki\n  Numadate, and Tetsuya Hama","authorsParsed":[["Hasegawa","Takeshi",""],["Yanagisawa","Hiroto",""],["Nagasawa","Takumi",""],["Sato","Reo",""],["Numadate","Naoki",""],["Hama","Tetsuya",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 06:36:52 GMT"}],"updateDate":"2024-07-11","timestamp":1720593412000,"abstract":"  Infrared (IR) spectra of vapor-deposited amorphous water at low temperatures\nshow two weak peaks at around 3720 and 3696 cm-1 assigned to free-OH stretching\nmodes of two- and three-coordinated water molecules (so-called dangling OH\nbonds), respectively, on the ice surface. A recent James Webb Space Telescope\n(JWST) observation first succeeded in detection of a potential dangling OH\nfeature at 3664 cm-1 for ices in molecular clouds, highlighting the importance\nof dangling OH bonds in interstellar ice chemistry. A lack of band strengths of\nthese features at low temperatures restricts the quantification of dangling OH\nbonds from IR spectra, hindering development of a molecular-level understanding\nof the surface structure and chemistry of ice. Using IR multiple-angle\nincidence resolution spectrometry, we quantified the band strengths of two- and\nthree-coordinated dangling OH features in amorphous water at 20 K as being 4.6\nplus-minus 1.6 times 10-18 and 9.1 plus-minus 1.0 times 10-18 cm molecule-1,\nrespectively. These values are more than an order of magnitude lower than band\nstrengths of bulk water molecules in ice and liquid water and are similar to\nthose of H2O monomers confined in solid matrices. Adsorption of carbon monoxide\nwith dangling OH bonds results in the appearance of a new broad dangling OH\nfeature at 3680-3620 cm-1, with a band strength of 1.8 plus-minus 0.1 times\n10-17 cm molecule-1. The band strengths of dangling OH features determined in\nthis study advance our understanding of the surface structure of interstellar\nice analogs and recent IR observations of the JWST.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Earth and Planetary Astrophysics","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Jy265Wqfi7NdBTx-ScclkjJ9z3Q9n3s1a0AiVEdKLQY","pdfSize":"1119345"}
