{"id":"2407.00904","title":"Background-aware Multi-source Fusion Financial Trend Forecasting\n  Mechanism","authors":"Fengting Mo, Shanshan Yan, Yinhao Xiao","authorsParsed":[["Mo","Fengting",""],["Yan","Shanshan",""],["Xiao","Yinhao",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 02:10:17 GMT"}],"updateDate":"2024-07-02","timestamp":1719799817000,"abstract":"  Stock prices, as an economic indicator, reflect changes in economic\ndevelopment and market conditions. Traditional stock price prediction models\noften only consider time-series data and are limited by the mechanisms of the\nmodels themselves. Some deep learning models have high computational costs,\ndepend on a large amount of high-quality data, and have poor interpretations,\nmaking it difficult to intuitively understand the driving factors behind the\npredictions. Some studies have used deep learning models to extract text\nfeatures and combine them with price data to make joint predictions, but there\nare issues with dealing with information noise, accurate extraction of text\nsentiment, and how to efficiently fuse text and numerical data. To address\nthese issues in this paper, we propose a background-aware multi-source fusion\nfinancial trend forecasting mechanism. The system leverages a large language\nmodel to extract key information from policy and stock review texts, utilizing\nthe MacBERT model to generate feature vectors. These vectors are then\nintegrated with stock price data to form comprehensive feature representations.\nThese integrated features are input into a neural network comprising various\ndeep learning architectures. By integrating multiple data sources, the system\noffers a holistic view of market dynamics. It harnesses the comprehensive\nanalytical and interpretative capabilities of large language models, retaining\ndeep semantic and sentiment information from policy texts to provide richer\ninput features for stock trend prediction. Additionally, we compare the\naccuracy of six models (LSTM, BiLSTM, MogrifierLSTM, GRU, ST-LSTM, SwinLSTM).\nThe results demonstrate that our system achieves generally better accuracy in\npredicting stock movements, attributed to the incorporation of large language\nmodel processing, policy information, and other influential features.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}