{"id":"2407.07283","title":"The [Y/Mg] chemical clock in the Galactic Disk: The influence of\n  metallicity and Galactic population in the solar neighbourhood","authors":"J. Shejeelammal, Jorge Mel\\'endez, Anne Rathsam, and Giulia Martos","authorsParsed":[["Shejeelammal","J.",""],["Meléndez","Jorge",""],["Rathsam","Anne",""],["Martos","Giulia",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 00:25:57 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 03:18:28 GMT"}],"updateDate":"2024-09-02","timestamp":1720571157000,"abstract":"  Stellar ages are an important parameter to study the chemical evolution of\nthe Galaxy. In recent years, several studies have established the existence of\na relationship between chemical clocks and stellar ages. The [Y/Mg] clock is a\npromising technique, but there are still several open questions, such as its\nvalidity for metal-poor stars and differences between the thin and thick disk\npopulations. Our aim is to study the behaviour of the [Y/Mg] chemical clock\nwith stellar ages and the effect of metallicity and population on this chemical\nclock for a sample of solar-type disk stars. We have derived the precise\nstellar atmospheric parameters as well as the elemental abundances of Mg and Y\nthrough line-by-line differential spectroscopic analysis for a sample of 48\nmetal-poor solar-type stars based on high-quality, high-resolution ESO/HARPS\nspectra. From the high-precision Gaia astrometric data, stellar masses and ages\nwere estimated through isochrone-fitting. A joint analysis of our sample,\ntogether with a sample of 185 solar-twins and analogues from our previous\nworks, is performed to calibrate the [Y/Mg] chemical clock in the Galactic disk\nfor $-$0.71 $\\leq$ [Fe/H] $<$ +0.34. Open clusters and stars with asteroseismic\nages have been used to validate our relations. Two different populations could\nbe clearly seen in the [Mg/Fe] - [Fe/H] plane - the thick and thin disks. We\nfound a metallicity-dependent, strong anti-correlation between the [Y/Mg] ratio\nand stellar ages of our sample. For the first time in the literature, we report\nsimilar correlations for the thin and thick disk stars. The [Y/Mg] relation(s)\nfound here for solar-type stars is compatible with the literature using\nsolar-twins. Our relation provides higher accuracy and precision of 0.45 and\n0.99 Gyr, respectively, comparable with the best accuracy achieved for the\nsolar-twins till date.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZLom8cTtrFHxb2dRD89fR0exYUSIMuv25TduLxiRsXQ","pdfSize":"1089363"}
