{"id":"2407.19430","title":"Progressive Domain Adaptation for Thermal Infrared Object Tracking","authors":"Qiao Li, Kanlun Tan, Qiao Liu, Di Yuan, Xin Li, Yunpeng Liu","authorsParsed":[["Li","Qiao",""],["Tan","Kanlun",""],["Liu","Qiao",""],["Yuan","Di",""],["Li","Xin",""],["Liu","Yunpeng",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 08:43:16 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 09:42:24 GMT"}],"updateDate":"2024-09-04","timestamp":1722156196000,"abstract":"  Due to the lack of large-scale labeled Thermal InfraRed (TIR) training\ndatasets, most existing TIR trackers are trained directly on RGB datasets.\nHowever, tracking methods trained on RGB datasets suffer a significant drop-off\nin TIR data due to the domain shift issue. To this end, in this work, we\npropose a Progressive Domain Adaptation framework for TIR Tracking (PDAT),\nwhich transfers useful knowledge learned from RGB tracking to TIR tracking. The\nframework makes full use of large-scale labeled RGB datasets without requiring\ntime-consuming and labor-intensive labeling of large-scale TIR data.\nSpecifically, we first propose an adversarial-based global domain adaptation\nmodule to reduce domain gap on the feature level coarsely. Second, we design a\nclustering-based subdomain adaptation method to further align the feature\ndistributions of the RGB and TIR datasets finely. These two domain adaptation\nmodules gradually eliminate the discrepancy between the two domains, and thus\nlearn domain-invariant fine-grained features through progressive training.\nAdditionally, we collect a largescale TIR dataset with over 1.48 million\nunlabeled TIR images for training the proposed domain adaptation framework.\nExperimental results on five TIR tracking benchmarks show that the proposed\nmethod gains a nearly 6% success rate, demonstrating its effectiveness.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}