{"id":"2407.14616","title":"Deep Learning-based 3D Coronary Tree Reconstruction from Two 2D\n  Non-simultaneous X-ray Angiography Projections","authors":"Yiying Wang, Abhirup Banerjee, Robin P. Choudhury, Vicente Grau","authorsParsed":[["Wang","Yiying",""],["Banerjee","Abhirup",""],["Choudhury","Robin P.",""],["Grau","Vicente",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 18:18:17 GMT"}],"updateDate":"2024-07-23","timestamp":1721413097000,"abstract":"  Cardiovascular diseases (CVDs) are the most common cause of death worldwide.\nInvasive x-ray coronary angiography (ICA) is one of the most important imaging\nmodalities for the diagnosis of CVDs. ICA typically acquires only two 2D\nprojections, which makes the 3D geometry of coronary vessels difficult to\ninterpret, thus requiring 3D coronary tree reconstruction from two projections.\nState-of-the-art approaches require significant manual interactions and cannot\ncorrect the non-rigid cardiac and respiratory motions between non-simultaneous\nprojections. In this study, we propose a novel deep learning pipeline. We\nleverage the Wasserstein conditional generative adversarial network with\ngradient penalty, latent convolutional transformer layers, and a dynamic snake\nconvolutional critic to implicitly compensate for the non-rigid motion and\nprovide 3D coronary tree reconstruction. Through simulating projections from\ncoronary computed tomography angiography (CCTA), we achieve the generalisation\nof 3D coronary tree reconstruction on real non-simultaneous ICA projections. We\nincorporate an application-specific evaluation metric to validate our proposed\nmodel on both a CCTA dataset and a real ICA dataset, together with Chamfer L1\ndistance. The results demonstrate the good performance of our model in vessel\ntopology preservation, recovery of missing features, and generalisation ability\nto real ICA data. To the best of our knowledge, this is the first study that\nleverages deep learning to achieve 3D coronary tree reconstruction from two\nreal non-simultaneous x-ray angiography projections.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}