{"id":"2407.15555","title":"The Rlign Algorithm for Enhanced Electrocardiogram Analysis through\n  R-Peak Alignment for Explainable Classification and Clustering","authors":"Lucas Plagwitz, Lucas Bickmann, Michael Fujarski, Alexander Brenner,\n  Warnes Gobalakrishnan, Lars Eckardt, Antonius B\\\"uscher, Julian Varghese","authorsParsed":[["Plagwitz","Lucas",""],["Bickmann","Lucas",""],["Fujarski","Michael",""],["Brenner","Alexander",""],["Gobalakrishnan","Warnes",""],["Eckardt","Lars",""],["Büscher","Antonius",""],["Varghese","Julian",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 11:34:47 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 09:05:22 GMT"}],"updateDate":"2024-08-12","timestamp":1721648087000,"abstract":"  Electrocardiogram (ECG) recordings have long been vital in diagnosing\ndifferent cardiac conditions. Recently, research in the field of automatic ECG\nprocessing using machine learning methods has gained importance, mainly by\nutilizing deep learning methods on raw ECG signals. A major advantage of models\nlike convolutional neural networks (CNNs) is their ability to effectively\nprocess biomedical imaging or signal data. However, this strength is tempered\nby challenges related to their lack of explainability, the need for a large\namount of training data, and the complexities involved in adapting them for\nunsupervised clustering tasks. In addressing these tasks, we aim to reintroduce\nshallow learning techniques, including support vector machines and principal\ncomponents analysis, into ECG signal processing by leveraging their\nsemi-structured, cyclic form. To this end, we developed and evaluated a\ntransformation that effectively restructures ECG signals into a fully\nstructured format, facilitating their subsequent analysis using shallow\nlearning algorithms. In this study, we present this adaptive transformative\napproach that aligns R-peaks across all signals in a dataset and resamples the\nsegments between R-peaks, both with and without heart rate dependencies. We\nillustrate the substantial benefit of this transformation for traditional\nanalysis techniques in the areas of classification, clustering, and\nexplainability, outperforming commercial software for median beat\ntransformation and CNN approaches. Our approach demonstrates a significant\nadvantage for shallow machine learning methods over CNNs, especially when\ndealing with limited training data. Additionally, we release a fully tested and\npublicly accessible code framework, providing a robust alignment pipeline to\nsupport future research, available at https://github.com/imi-ms/rlign.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}