{"id":"2407.17637","title":"Responses to Disturbance of Supersonic Shear Layer: Input-Output\n  Analysis","authors":"Mitesh Thakor, Yiyang Sun, Datta V. Gaitonde","authorsParsed":[["Thakor","Mitesh",""],["Sun","Yiyang",""],["Gaitonde","Datta V.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 21:04:05 GMT"}],"updateDate":"2024-07-26","timestamp":1721855045000,"abstract":"  We investigate the perturbation dynamics in a supersonic shear layer using a\ncombination of large-eddy simulations (LES) and linear-operator-based\ninput-output analysis. The flow consists of two streams-a main stream (Mach\n1.23) and a bypass stream (Mach 1.0)-separated by a splitter plate of\nnon-negligible thickness. We employ spectral proper orthogonal decomposition to\nidentify the most energetic coherent structures and bispectral mode\ndecomposition to explore the nonlinear energy cascade within the turbulent\nshear layer flow. Structures at the dominant frequency are also obtained from a\nresolvent analysis of the mean flow. We observe higher gain at the dominant\nfrequency in resolvent analysis, indicating the dominance of Kelvin-Helmholtz\n(KH) instability as the primary disturbance energy-amplification mechanism. To\nfocus on realizable actuator placement locations, we further conduct an\ninput-output analysis by restricting a state variable and spatial location of\nan input and output. Various combinations of inputs and output indicate that\nthe splitter plate trailing surface is the most sensitive location for\nintroducing a perturbation. For all combinations, the KH instability plays a\nkey role in amplification, which reduces significantly as the input location is\nmoved upstream relative to the splitter plate trailing edge. Furthermore,\ntwo-dimensional nonlinear simulations with unsteady input at the upper surface\nof the splitter plate show remarkable similarities between pressure modes\nobtained through dynamic mode decomposition and those predicted from linear\ninput-output analysis at a given frequency. This study emphasizes the strength\nof linear analysis and demonstrates that predicted coherent structures remain\nactive in highly nonlinear turbulent flow. The insights gained from the\ninput-output analysis can be further leveraged to formulate practical flow\ncontrol strategies.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}