{"id":"2407.00302","title":"Short-time large deviation of constrained random acceleration process","authors":"Hanshuang Chen and Lulu Tian and Guofeng Li","authorsParsed":[["Chen","Hanshuang",""],["Tian","Lulu",""],["Li","Guofeng",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 03:48:32 GMT"}],"updateDate":"2024-07-02","timestamp":1719632912000,"abstract":"  By optimal fluctuation method, we study short-time distribution\n$P(\\mathcal{A}=A)$ of the functionals, $\\mathcal{A}=\\int_{0}^{t_f} x^n(t) dt$,\nalong constrained trajectories of random acceleration process for a given time\nduration $t_f$, where $n$ is a positive integer. We consider two types of\nconstraints: one is called the total constraint, where the initial position and\nvelocity and the final position and velocity are both fixed, and the other is\ncalled the partial constraint, where the initial position and velocity, the\nfinal position are fixed, and letting the final velocity be free. Via the\nvariation of constrained action functionals, the resulting Euler-Lagrange\nequations are analytically solved for $n=1$ and 2, and the optimal path, i.e.,\nthe most probable realization of the random acceleration process $x(t)$,\nconditioned on specified $A$ and $n$, are correspondingly obtained. For $n \\geq\n3$, a numerical scheme is proposed to find the optimal path. We show that, for\n$n=1$, $P(A)$ is a Gaussian distribution with the variance proportional to\n$Dt_f^5$ ($D$ is the particle velocity diffusion constant). For $n \\geq 2$,\n$P(A)$ exhibits the non-Gaussian feature. In the small-$A$ limit, $P(A)$ show a\nessential singularity, $-\\ln P(A) \\sim A^{-3}$, and the optimal path localizes\naround the initial state over a long-time window, and then escapes to the final\nposition sharply at a late time. For $A$ much larger than its typical value,\nthere are multiple optimal paths with the same $A$ but with different actions\n(or probability densities). Among these degenerate paths, one with the minimum\naction is dominant, and the others are exponentially unlikely. All the\ntheoretical results are validated by simulating the effective Langevin\nequations governing the constrained random acceleration process.\n","subjects":["Condensed Matter/Statistical Mechanics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}