{"id":"2407.18087","title":"Stabilization of cat-state manifolds using nonlinear reservoir\n  engineering","authors":"Ivan Rojkov, Matteo Simoni, Elias Zapusek, Florentin Reiter, Jonathan\n  Home","authorsParsed":[["Rojkov","Ivan",""],["Simoni","Matteo",""],["Zapusek","Elias",""],["Reiter","Florentin",""],["Home","Jonathan",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 14:50:52 GMT"}],"updateDate":"2024-07-26","timestamp":1721919052000,"abstract":"  We introduce a novel reservoir engineering approach for stabilizing\nmulti-component Schr\\\"odinger's cat manifolds. The fundamental principle of the\nmethod lies in the destructive interference at crossings of gain and loss\nHamiltonian terms in the coupling of an oscillator to a zero-temperature\nauxiliary system, which are nonlinear with respect to the oscillator's energy.\nThe nature of these gain and loss terms is found to determine the rotational\nsymmetry, energy distributions, and degeneracy of the resulting stabilized\nmanifolds. Considering these systems as bosonic error-correction codes, we\nanalyze their properties with respect to a variety of errors, including both\nautonomous and passive error correction, where we find that our formalism gives\nstraightforward insights into the nature of the correction. We give example\nimplementations using the anharmonic laser-ion coupling of a trapped ion\noutside the Lamb-Dicke regime as well as nonlinear superconducting circuits.\nBeyond the dissipative stabilization of standard cat manifolds and novel\nrotation symmetric codes, we demonstrate that our formalism allows for the\nstabilization of bosonic codes linked to cat states through unitary\ntransformations, such as quadrature-squeezed cats. Our work establishes a\ndesign approach for creating and utilizing codes using nonlinearity, providing\naccess to novel quantum states and processes across a range of physical\nsystems.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FIz8NomULskb7dS83byYN5vCwqGCbRiUDICIyCe_ppk","pdfSize":"6594021"}
