{"id":"2407.16694","title":"Aster: Fixing the Android TEE Ecosystem with Arm CCA","authors":"Mark Kuhne, Supraja Sridhara, Andrin Bertschi, Nicolas Dutly, Srdjan\n  Capkun, Shweta Shinde","authorsParsed":[["Kuhne","Mark",""],["Sridhara","Supraja",""],["Bertschi","Andrin",""],["Dutly","Nicolas",""],["Capkun","Srdjan",""],["Shinde","Shweta",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 17:57:36 GMT"}],"updateDate":"2024-07-24","timestamp":1721757456000,"abstract":"  The Android ecosystem relies on either TrustZone (e.g., OP-TEE, QTEE, Trusty)\nor trusted hypervisors (pKVM, Gunyah) to isolate security-sensitive services\nfrom malicious apps and Android bugs. TrustZone allows any secure world code to\naccess the normal world that runs Android. Similarly, a trusted hypervisor has\nfull access to Android running in one VM and security services in other VMs. In\nthis paper, we motivate the need for mutual isolation, wherein Android,\nhypervisors, and the secure world are isolated from each other. Then, we\npropose a sandboxed service abstraction, such that a sandboxed execution cannot\naccess any other sandbox, Android, hypervisor, or secure world memory. We\npresent Aster which achieves these goals while ensuring that sandboxed\nexecution can still communicate with Android to get inputs and provide outputs\nsecurely. Our main insight is to leverage the hardware isolation offered by Arm\nConfidential Computing Architecture (CCA). However, since CCA does not satisfy\nour sandboxing and mutual isolation requirements, Aster repurposes its hardware\nenforcement to meet its goals while addressing challenges such as secure\ninterfaces, virtio, and protection against interrupts. We implement Aster to\ndemonstrate its feasibility and assess its compatibility. We take three case\nstudies, including one currently deployed on Android phones and insufficiently\nsecured using a trusted hypervisor, to demonstrate that they can be protected\nby Aster.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}