{"id":"2407.12225","title":"Probabilistic Reachability Analysis of Stochastic Control Systems","authors":"Saber Jafarpour and Zishun Liu and Yongxin Chen","authorsParsed":[["Jafarpour","Saber",""],["Liu","Zishun",""],["Chen","Yongxin",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 00:39:49 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 17:38:06 GMT"}],"updateDate":"2024-09-04","timestamp":1721176789000,"abstract":"  We address the reachability problem for continuous-time stochastic dynamic\nsystems. Our objective is to present a unified framework that characterizes the\nreachable set of a dynamic system in the presence of both stochastic\ndisturbances and deterministic inputs. To achieve this, we devise a strategy\nthat effectively decouples the effects of deterministic inputs and stochastic\ndisturbances on the reachable sets of the system. For the deterministic part,\nmany existing methods can capture the deterministic reachability. As for the\nstochastic disturbances, we introduce a novel technique that probabilistically\nbounds the difference between a stochastic trajectory and its deterministic\ncounterpart. The key to our approach is introducing a novel energy function\ntermed the Averaged Moment Generating Function that yields a high probability\nbound for this difference. This bound is tight and exact for linear stochastic\ndynamics and applicable to a large class of nonlinear stochastic dynamics. By\ncombining our innovative technique with existing methods for deterministic\nreachability analysis, we can compute estimations of reachable sets that\nsurpass those obtained with current approaches for stochastic reachability\nanalysis. We validate the effectiveness of our framework through various\nnumerical experiments. Beyond its immediate applications in reachability\nanalysis, our methodology is poised to have profound implications in the\nbroader analysis and control of stochastic systems. It opens avenues for\nenhanced understanding and manipulation of complex stochastic dynamics,\npresenting opportunities for advancements in related fields.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}