{"id":"2407.07995","title":"Flow4D: Leveraging 4D Voxel Network for LiDAR Scene Flow Estimation","authors":"Jaeyeul Kim, Jungwan Woo, Ukcheol Shin, Jean Oh, Sunghoon Im","authorsParsed":[["Kim","Jaeyeul",""],["Woo","Jungwan",""],["Shin","Ukcheol",""],["Oh","Jean",""],["Im","Sunghoon",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 18:55:43 GMT"}],"updateDate":"2024-07-12","timestamp":1720637743000,"abstract":"  Understanding the motion states of the surrounding environment is critical\nfor safe autonomous driving. These motion states can be accurately derived from\nscene flow, which captures the three-dimensional motion field of points.\nExisting LiDAR scene flow methods extract spatial features from each point\ncloud and then fuse them channel-wise, resulting in the implicit extraction of\nspatio-temporal features. Furthermore, they utilize 2D Bird's Eye View and\nprocess only two frames, missing crucial spatial information along the Z-axis\nand the broader temporal context, leading to suboptimal performance. To address\nthese limitations, we propose Flow4D, which temporally fuses multiple point\nclouds after the 3D intra-voxel feature encoder, enabling more explicit\nextraction of spatio-temporal features through a 4D voxel network. However,\nwhile using 4D convolution improves performance, it significantly increases the\ncomputational load. For further efficiency, we introduce the Spatio-Temporal\nDecomposition Block (STDB), which combines 3D and 1D convolutions instead of\nusing heavy 4D convolution. In addition, Flow4D further improves performance by\nusing five frames to take advantage of richer temporal information. As a\nresult, the proposed method achieves a 45.9% higher performance compared to the\nstate-of-the-art while running in real-time, and won 1st place in the 2024\nArgoverse 2 Scene Flow Challenge. The code is available at\nhttps://github.com/dgist-cvlab/Flow4D.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}