{"id":"2407.11201","title":"SMDP: SARS-CoV-2 Mutation Distribution Profiler for rapid estimation of\n  mutational histories of unusual lineages","authors":"Erin E. Gill, Sheri Harari, Aijing Feng, Fiona S.L. Brinkman and Sarah\n  Otto","authorsParsed":[["Gill","Erin E.",""],["Harari","Sheri",""],["Feng","Aijing",""],["Brinkman","Fiona S. L.",""],["Otto","Sarah",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 19:37:10 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 17:42:26 GMT"}],"updateDate":"2024-07-25","timestamp":1721072230000,"abstract":"  SARS-CoV-2 usually evolves at a relatively constant rate over time.\nOccasionally, however, lineages arise with higher-than-expected numbers of\nmutations given the date of sampling. Such lineages can arise for a variety of\nreasons, including selection pressures imposed by evolution during a chronic\ninfection or exposure to mutation-inducing drugs like molnupiravir. We have\ndeveloped an open-source web-based application (SMDP: SARS-CoV-2 Mutation\nDistribution Profiler;\nhttps://eringill.shinyapps.io/covid_mutation_distributions) that compares a\nlist of user-submitted lineage-defining mutations with established mutation\ndistributions including those observed during (1) the first nine months of the\npandemic, (2) during the global transmission of Omicron, (3) during the chronic\ninfection of immunocompromised patients, and (4) during zoonotic spillover from\nhumans to deer. The application calculates the most likely distribution for the\nuser's mutation list and displays log likelihoods for all distributions. In\naddition, the transition:transversion ratio of the user's list is calculated to\ndetermine whether there is evidence of exposure to a mutation-inducing drug\nsuch as molnupiravir and indicates whether the list contains mutations in the\nproofreading domain of nsp14 which could lead to a higher-than-expected\nmutation rate in the lineage. This tool will be useful for public health and\nresearchers seeking to rapidly infer evolutionary histories of SARS-CoV-2\nvariants, which can aid risk assessment and public health responses.\n","subjects":["Quantitative Biology/Populations and Evolution","Quantitative Biology/Genomics","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mNQpPyvmdZ633LUxyp-E6ydmxJYqZGziH0rrBry7Hrs","pdfSize":"345619"}
