{"id":"2407.01362","title":"Creation, Control, and Modeling of NV Centers in Nanodiamonds","authors":"Pietro Apr\\`a, Nour Hanne Amine, Adam Britel, Sofia Sturari, Veronica\n  Varzi, Matteo Ziino, Lorenzo Mino, Paolo Olivero, Federico Picollo","authorsParsed":[["Aprà","Pietro",""],["Amine","Nour Hanne",""],["Britel","Adam",""],["Sturari","Sofia",""],["Varzi","Veronica",""],["Ziino","Matteo",""],["Mino","Lorenzo",""],["Olivero","Paolo",""],["Picollo","Federico",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 15:17:52 GMT"}],"updateDate":"2024-07-02","timestamp":1719847072000,"abstract":"  Sensing based on Nitrogen-Vacancy (NV) centers in nanodiamonds (NDs) offers\nsignificant potential across various applications. However, optimizing their\nquantum-optical properties remains challenging. This study focuses on enhancing\nand controlling the optical properties of NV centers in NDs through surface\nchemistry tuning and proton beam irradiation. Systematic thermal oxidations\nwere performed to investigate the evolution of surface chemical groups using IR\nspectroscopy and their influence on optical properties using photoluminescence\nspectroscopy and PL decay measurements. Proton irradiation was explored over a\nwide range of fluences (10^14 to 10^17 cm^-2) to precisely control the NV\ncenter concentration, identifying conditions that maximize creation and\nemission intensity. Furthermore, NV center charge state control was achieved by\nanalyzing the NV-/NV0 ratio with varying surface terminations and NV center\nconcentrations. A novel predictive mathematical model was developed to evaluate\nthe efficiencies of forming NV- and NV0. Although tested specifically with\nproton-irradiated NDs, this model has broad applicability, representing a\nsignificant advancement in predicting the outcomes of ion-beam-based color\ncenter generation in diamond.\n","subjects":["Physics/Atomic Physics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"z5yVopF3IsNPK1N_yx9ueaqREc2BxQsqt1AIFTj4_t4","pdfSize":"2221948","objectId":"0x1915b6c4c5275b171a7e1d92acdc07e8ce2fd894ac602d3ca1b439064f13613e","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
