{"id":"2407.05897","title":"Deciphering the Role of Representation Disentanglement: Investigating\n  Compositional Generalization in CLIP Models","authors":"Reza Abbasi, Mohammad Hossein Rohban, Mahdieh Soleymani Baghshah","authorsParsed":[["Abbasi","Reza",""],["Rohban","Mohammad Hossein",""],["Baghshah","Mahdieh Soleymani",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 13:04:40 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 05:42:05 GMT"}],"updateDate":"2024-07-17","timestamp":1720443880000,"abstract":"  CLIP models have recently shown to exhibit Out of Distribution (OoD)\ngeneralization capabilities. However, Compositional Out of Distribution (C-OoD)\ngeneralization, which is a crucial aspect of a model's ability to understand\nunseen compositions of known concepts, is relatively unexplored for the CLIP\nmodels. Our goal is to address this problem and identify the factors that\ncontribute to the C-OoD in CLIPs. We noted that previous studies regarding\ncompositional understanding of CLIPs frequently fail to ensure that test\nsamples are genuinely novel relative to the CLIP training data. To this end, we\ncarefully synthesized a large and diverse dataset in the single object setting,\ncomprising attributes for objects that are highly unlikely to be encountered in\nthe combined training datasets of various CLIP models. This dataset enables an\nauthentic evaluation of C-OoD generalization. Our observations reveal varying\nlevels of C-OoD generalization across different CLIP models. We propose that\nthe disentanglement of CLIP representations serves as a critical indicator in\nthis context. By utilizing our synthesized datasets and other existing\ndatasets, we assess various disentanglement metrics of text and image\nrepresentations. Our study reveals that the disentanglement of image and text\nrepresentations, particularly with respect to their compositional elements,\nplays a crucial role in improving the generalization of CLIP models in\nout-of-distribution settings. This finding suggests promising opportunities for\nadvancing out-of-distribution generalization in CLIPs.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}