{"id":"2407.05782","title":"Sequential Contrastive Audio-Visual Learning","authors":"Ioannis Tsiamas, Santiago Pascual, Chunghsin Yeh, Joan Serr\\`a","authorsParsed":[["Tsiamas","Ioannis",""],["Pascual","Santiago",""],["Yeh","Chunghsin",""],["Serrà","Joan",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 09:45:20 GMT"}],"updateDate":"2024-07-09","timestamp":1720431920000,"abstract":"  Contrastive learning has emerged as a powerful technique in audio-visual\nrepresentation learning, leveraging the natural co-occurrence of audio and\nvisual modalities in extensive web-scale video datasets to achieve significant\nadvancements. However, conventional contrastive audio-visual learning\nmethodologies often rely on aggregated representations derived through temporal\naggregation, which neglects the intrinsic sequential nature of the data. This\noversight raises concerns regarding the ability of standard approaches to\ncapture and utilize fine-grained information within sequences, information that\nis vital for distinguishing between semantically similar yet distinct examples.\nIn response to this limitation, we propose sequential contrastive audio-visual\nlearning (SCAV), which contrasts examples based on their non-aggregated\nrepresentation space using sequential distances. Retrieval experiments with the\nVGGSound and Music datasets demonstrate the effectiveness of SCAV, showing 2-3x\nrelative improvements against traditional aggregation-based contrastive\nlearning and other methods from the literature. We also show that models\ntrained with SCAV exhibit a high degree of flexibility regarding the metric\nemployed for retrieval, allowing them to operate on a spectrum of\nefficiency-accuracy trade-offs, potentially making them applicable in multiple\nscenarios, from small- to large-scale retrieval.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Computing Research Repository/Multimedia","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}