{"id":"2407.08457","title":"Neural Poisson Solver: A Universal and Continuous Framework for Natural\n  Signal Blending","authors":"Delong Wu, Hao Zhu, Qi Zhang, You Li, Zhan Ma, Xun Cao","authorsParsed":[["Wu","Delong",""],["Zhu","Hao",""],["Zhang","Qi",""],["Li","You",""],["Ma","Zhan",""],["Cao","Xun",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 12:54:21 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 03:19:07 GMT"}],"updateDate":"2024-07-15","timestamp":1720702461000,"abstract":"  Implicit Neural Representation (INR) has become a popular method for\nrepresenting visual signals (e.g., 2D images and 3D scenes), demonstrating\npromising results in various downstream applications. Given its potential as a\nmedium for visual signals, exploring the development of a neural blending\nmethod that utilizes INRs is a natural progression. Neural blending involves\nmerging two INRs to create a new INR that encapsulates information from both\noriginal representations. A direct approach involves applying traditional image\nediting methods to the INR rendering process. However, this method often\nresults in blending distortions, artifacts, and color shifts, primarily due to\nthe discretization of the underlying pixel grid and the introduction of\nboundary conditions for solving variational problems. To tackle this issue, we\nintroduce the Neural Poisson Solver, a plug-and-play and universally applicable\nframework across different signal dimensions for blending visual signals\nrepresented by INRs. Our Neural Poisson Solver offers a variational\nproblem-solving approach based on the continuous Poisson equation,\ndemonstrating exceptional performance across various domains. Specifically, we\npropose a gradient-guided neural solver to represent the solution process of\nthe variational problem, refining the target signal to achieve natural blending\nresults. We also develop a Poisson equation-based loss and optimization scheme\nto train our solver, ensuring it effectively blends the input INR scenes while\npreserving their inherent structure and semantic content. The lack of\ndependence on additional prior knowledge makes our method easily adaptable to\nvarious task categories, highlighting its versatility. Comprehensive\nexperimental results validate the robustness of our approach across multiple\ndimensions and blending tasks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}