{"id":"2407.18443","title":"HybridDepth: Robust Depth Fusion for Mobile AR by Leveraging Depth from\n  Focus and Single-Image Priors","authors":"Ashkan Ganj, Hang Su, Tian Guo","authorsParsed":[["Ganj","Ashkan",""],["Su","Hang",""],["Guo","Tian",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 00:51:52 GMT"}],"updateDate":"2024-07-29","timestamp":1721955112000,"abstract":"  We propose HYBRIDDEPTH, a robust depth estimation pipeline that addresses the\nunique challenges of depth estimation for mobile AR, such as scale ambiguity,\nhardware heterogeneity, and generalizability. HYBRIDDEPTH leverages the camera\nfeatures available on mobile devices. It effectively combines the scale\naccuracy inherent in Depth from Focus (DFF) methods with the generalization\ncapabilities enabled by strong single-image depth priors. By utilizing the\nfocal planes of a mobile camera, our approach accurately captures depth values\nfrom focused pixels and applies these values to compute scale and shift\nparameters for transforming relative depths into metric depths. We test our\npipeline as an end-to-end system, with a newly developed mobile client to\ncapture focal stacks, which are then sent to a GPU-powered server for depth\nestimation.\n  Through comprehensive quantitative and qualitative analyses, we demonstrate\nthat HYBRIDDEPTH not only outperforms state-of-the-art (SOTA) models in common\ndatasets (DDFF12, NYU Depth v2) and a real-world AR dataset ARKitScenes but\nalso demonstrates strong zero-shot generalization. For example, HYBRIDDEPTH\ntrained on NYU Depth v2 achieves comparable performance on the DDFF12 to\nexisting models trained on DDFF12. it also outperforms all the SOTA models in\nzero-shot performance on the ARKitScenes dataset. Additionally, we conduct a\nqualitative comparison between our model and the ARCore framework,\ndemonstrating that our models output depth maps are significantly more accurate\nin terms of structural details and metric accuracy. The source code of this\nproject is available at github.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}