{"id":"2407.04766","title":"Limitations to Dynamical Error Suppression and Gate-Error Virtualization\n  from Temporally Correlated Nonclassical Noise","authors":"Michiel Burgelman, Nattaphong Wonglakhon, Diego N. Bernal-Garc\\'ia,\n  Gerardo A. Paz-Silva, Lorenza Viola","authorsParsed":[["Burgelman","Michiel",""],["Wonglakhon","Nattaphong",""],["Bernal-García","Diego N.",""],["Paz-Silva","Gerardo A.",""],["Viola","Lorenza",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-09","timestamp":1720202400000,"abstract":"  Realistic multi-qubit noise processes often result in error mechanisms that\nare not captured by the probabilistic, Markovian error models commonly employed\nin circuit-level analyses of quantum fault-tolerance. By working within an\nopen-quantum system Hamiltonian formulation, we revisit the validity of the\nnotion of a constant gate error in the presence of noise that is both {\\em\ntemporally correlated and nonclassical}, and whose impact is mitigated through\nperfect instantaneous dynamical decoupling subject to finite timing\nconstraints. We study a minimal exactly solvable single-qubit model under\nGaussian quantum dephasing noise, showing that the fidelity of a dynamically\nprotected idling gate can depend strongly on its {\\em location in the circuit\nand the history of applied control}, even when the system-side error\npropagation is fully removed through perfect reset operations. For digital\nperiodic control, we prove that, under mild conditions on the low-frequency\nbehavior of the nonclassical noise spectrum, the gate fidelity saturates at a\nvalue that is strictly smaller than the one attainable in the absence of\ncontrol history; the presence of high-frequency noise peaks is also found as\nespecially harmful, due to the possible onset of control-induced resonance\neffects. We explicitly relate these features to the evolution of the bath\nstatistics during the computation, which has not been fully accounted for in\nexisting treatments. We find that only if decoupling can keep the qubit highly\npure over a timescale larger than the correlation time of the noise, the bath\napproximately converges to its original statistics and a stable-in-time control\nperformance is recovered. Implications of this costly re-equilibration of the\nquantum bath statistics for layered quantum fault-tolerant architectures are\ndiscussed.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}