{"id":"2407.18810","title":"Superfluid Spin-up: 3D Simulations of Post-Glitch Dynamics in Neutron\n  Star Cores","authors":"J. R. Fuentes and Vanessa Graber","authorsParsed":[["Fuentes","J. R.",""],["Graber","Vanessa",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 15:20:39 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 18:14:04 GMT"}],"updateDate":"2024-09-10","timestamp":1722007239000,"abstract":"  The dynamics of a neutron star after a glitch involve the transfer of angular\nmomentum from the crust (where the glitch is presumed to originate) to the\nliquid core, causing the core to spin up. The crust-core coupling, which\ndetermines how quickly this spin-up proceeds, can be achieved through various\nphysical processes, including Ekman pumping, superfluid vortex-mediated mutual\nfriction, and magnetic fields. Although the complex nature of these mechanisms\nhas made it difficult to study their combined effects, analytical estimations\nfor individual processes reveal that spin-up timescales vary according to the\nrelative strength of Coriolis, viscous, and mutual friction forces, as well as\nthe magnetic field. However, experimental and numerical validations of those\nanalytical predictions are limited. In this paper, we focus on viscous effects\nand mutual friction. We conduct non-linear hydrodynamical simulations of the\nspin-up problem in a two-component fluid by solving the incompressible\nHall-Vinen-Bekarevich-Khalatnikov (HVBK) equations in the full sphere (i.e.,\nincluding $r=0$) for the first time. We find that the viscous (normal)\ncomponent accelerates due to Ekman pumping, although the mutual friction\ncoupling to the superfluid component alters the spin-up dynamics compared to\nthe single-fluid scenario. Close to the sphere's surface, the response of the\nsuperfluid is accurately described by the mutual friction timescale\nirrespective of its coupling strength with the normal component. However, as we\nmove deeper into the sphere, the superfluid accelerates on different timescales\ndue to the slow viscous spin-up of the internal normal fluid layers. We discuss\npotential implications for neutron stars and requirements for future work to\nbuild more realistic models.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics","Condensed Matter/Other Condensed Matter","Condensed Matter/Quantum Gases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XX8_69f0hHDIEp0MQxDy7Izm7FbgnoceDTZ9JkYO0xs","pdfSize":"2061072"}
