{"id":"2407.12168","title":"A Scalable Real-Time Data Assimilation Framework for Predicting\n  Turbulent Atmosphere Dynamics","authors":"Junqi Yin, Siming Liang, Siyan Liu, Feng Bao, Hristo G. Chipilski, Dan\n  Lu, Guannan Zhang","authorsParsed":[["Yin","Junqi",""],["Liang","Siming",""],["Liu","Siyan",""],["Bao","Feng",""],["Chipilski","Hristo G.",""],["Lu","Dan",""],["Zhang","Guannan",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 20:44:09 GMT"}],"updateDate":"2024-07-18","timestamp":1721162649000,"abstract":"  The weather and climate domains are undergoing a significant transformation\nthanks to advances in AI-based foundation models such as FourCastNet,\nGraphCast, ClimaX and Pangu-Weather. While these models show considerable\npotential, they are not ready yet for operational use in weather forecasting or\nclimate prediction. This is due to the lack of a data assimilation method as\npart of their workflow to enable the assimilation of incoming Earth system\nobservations in real time. This limitation affects their effectiveness in\npredicting complex atmospheric phenomena such as tropical cyclones and\natmospheric rivers. To overcome these obstacles, we introduce a generic\nreal-time data assimilation framework and demonstrate its end-to-end\nperformance on the Frontier supercomputer. This framework comprises two primary\nmodules: an ensemble score filter (EnSF), which significantly outperforms the\nstate-of-the-art data assimilation method, namely, the Local Ensemble Transform\nKalman Filter (LETKF); and a vision transformer-based surrogate capable of\nreal-time adaptation through the integration of observational data. The ViT\nsurrogate can represent either physics-based models or AI-based foundation\nmodels. We demonstrate both the strong and weak scaling of our framework up to\n1024 GPUs on the Exascale supercomputer, Frontier. Our results not only\nillustrate the framework's exceptional scalability on high-performance\ncomputing systems, but also demonstrate the importance of supercomputers in\nreal-time data assimilation for weather and climate predictions. Even though\nthe proposed framework is tested only on a benchmark surface quasi-geostrophic\n(SQG) turbulence system, it has the potential to be combined with existing\nAI-based foundation models, making it suitable for future operational\nimplementations.\n","subjects":["Computing Research Repository/Machine Learning","Mathematics/Dynamical Systems","Physics/Atmospheric and Oceanic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}