{"id":"2407.09140","title":"FlyEye Ground-Based Telescope: Unveiling New Frontiers in Astronomical\n  Science","authors":"Carmelo Arcidiacono, Matteo Simioni, Roberto Ragazzoni, Piero Gregori,\n  Paolo Lorenzi, Francesco Cerutti, Roberto Ziano, Matteo Bisiani, Roberta\n  Pellegrini, Andrea Guazzora, Silvano Pieri, Marco Dima, Silvio Di Rosa,\n  Simone Zaggia, Jacopo Farinato, Demetrio Magrin, Andrea Grazian, Marco\n  Gullieuszik","authorsParsed":[["Arcidiacono","Carmelo",""],["Simioni","Matteo",""],["Ragazzoni","Roberto",""],["Gregori","Piero",""],["Lorenzi","Paolo",""],["Cerutti","Francesco",""],["Ziano","Roberto",""],["Bisiani","Matteo",""],["Pellegrini","Roberta",""],["Guazzora","Andrea",""],["Pieri","Silvano",""],["Dima","Marco",""],["Di Rosa","Silvio",""],["Zaggia","Simone",""],["Farinato","Jacopo",""],["Magrin","Demetrio",""],["Grazian","Andrea",""],["Gullieuszik","Marco",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 10:18:41 GMT"}],"updateDate":"2024-07-15","timestamp":1720779521000,"abstract":"  The FlyEye design makes its debut in the ESA's NEOSTEL developed by\nOHB-Italia. This pioneering FlyEye telescope integrates a monolithic 1-meter\nclass primary mirror feeding 16 CCD cameras for discovering Near-Earth Object\n(NEO) and any class of transient phenomena. OHB-Italia is the prime contractor,\nreceiving extended support from the Italian National Institute for Astrophysics\n(INAF) in the ESA's NEOSTED program's integration and testing. The FlyEye\ndistinctive design splits the Field of View into 16 channels, creating a unique\nmulti-telescope system with a panoramic 44 square degree Field of View and a\nseeing-size pixel-scale, enabling NEOs detection down to apparent magnitudes\n21.5 insisting on a 1m diameter spherical mirror. The scientific products of a\nsimilar FlyEye telescope can complement facilities such as Vera Rubin (former\nLSST) and ZTF. The FlyEye has the ability to survey two-thirds of the visible\nsky about three times per night can revolutionize time-domain astronomy,\nenabling comprehensive studies of transient phenomena, placing FlyEye in a new\nera of exploration of the dynamic universe. Efforts to develop automated\ncalibration and testing procedures are keys to realizing this transformative\npotential.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}