{"id":"2407.12482","title":"Exploring Milky Way rotation curves with Gaia DR3: a comparison between\n  $\\Lambda$CDM, MOND, and General Relativistic approaches","authors":"William Beordo, Mariateresa Crosta, Mario Gilberto Lattanzi","authorsParsed":[["Beordo","William",""],["Crosta","Mariateresa",""],["Lattanzi","Mario Gilberto",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 11:07:11 GMT"}],"updateDate":"2024-07-18","timestamp":1721214431000,"abstract":"  With the release of Gaia DR3, we extend the comparison between dynamical\nmodels for the Milky Way rotation curve initiated in the previous work.\nUtilising astrometric and spectro-photometric data for 719143 young disc stars\nwithin $|z|<1$ kpc and up to $R \\simeq 19$ kpc, we investigate the accuracy of\nMOND and $\\Lambda$CDM frameworks in addition to previously studied models, such\nas the classical one with a Navarro-Frenk-White dark matter halo and a general\nrelativistic model. We find that all models, including MOND and $\\Lambda$CDM,\nare statistically equivalent in representing the observed rotational\nvelocities. However, $\\Lambda$CDM, characterized by an Einasto density profile\nand cosmological constraints on its parameters, assigns more dark matter than\nthe model featuring a Navarro-Frenk-White profile, with the virial mass\nestimated at $1.5\\text{-}2.5 \\times 10^{12} \\, {\\rm M}_{\\odot}$ - a value\nsignificantly higher than recent literature estimates. Beyond $10\\text{-}15$\nkpc, non-Newtonian/non-baryonic contributions to the rotation curve are found\nto become dominant for all models consistently. Our results suggest the need\nfor further exploration into the role of General Relativity, dark matter, and\nalternative theories of gravitational dynamics in shaping Milky Way's rotation\ncurve.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pb6YDVoJj9O3uYFA8HnO38WwzLQy2KElCLyNthpHTQU","pdfSize":"2881488"}
