{"id":"2407.06002","title":"Distribution of the number of peaks within a long gamma-ray burst: The\n  full Fermi/GBM catalogue","authors":"R. Maccary, M. Maistrello, C. Guidorzi, M. Sartori, L. Amati, L.\n  Bazzanini, M. Bulla, A. E. Camisasca, L. Ferro, F. Frontera, and A. Tsvetkova","authorsParsed":[["Maccary","R.",""],["Maistrello","M.",""],["Guidorzi","C.",""],["Sartori","M.",""],["Amati","L.",""],["Bazzanini","L.",""],["Bulla","M.",""],["Camisasca","A. E.",""],["Ferro","L.",""],["Frontera","F.",""],["Tsvetkova","A.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 14:53:18 GMT"}],"updateDate":"2024-07-09","timestamp":1720450398000,"abstract":"  Context. The dissipation process responsible for the long gamma-ray burst\n(GRB) prompt emission and the kind of dynamics that drives the release of\nenergy as a function of time are still key open issues. We recently found that\nthe distribution of the number of peaks per GRB is described by a mixture of\ntwo exponentials, suggesting the existence of two behaviours that turn up as\npeak-rich and peak-poor time profiles.\n  Aims. Our aims are to study the distribution of the number of peaks per GRB\nof the entire catalogue of about 3000 GRBs observed by the Fermi Gamma-ray\nBurst Monitor (GBM) and to make a comparison with previous results obtained\nfrom other catalogues.\n  Methods. We identified GRB peaks using the MEPSA code and modelled the\nresulting distribution following the same procedure that was adopted in the\nprevious analogous investigation.\n  Results. We confirm that only a mixture of two exponentials can model the\ndistribution satisfactorily, with model parameters that fully agree with those\nfound from previous analyses. In particular, we confirm that (21 +- 4)% of the\nobserved GRBs are peak-rich (8 +- 1 peaks per GRB on average), while the\nremaining 80% are peak-poor (2.12 +- 0.10 peaks per GRB on average).\n  Conclusions. We confirm the existence of two different components, peak-poor\nand peak-rich GRBs, that make up the observed GRB populations. Together with\nprevious analogous results from other GRB catalogues, these results provide\ncompelling evidence that GRB prompt emission is governed by two distinct\nregimes.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}