{"id":"2407.07762","title":"Learning and Motivational Impact of Game-Based Learning: Comparing\n  Face-to-Face and Online Formats on Computer Science Education","authors":"Daniel L\\'opez-Fern\\'andez, Aldo Gordillo, Jennifer P\\'erez, Edmundo\n  Tovar","authorsParsed":[["López-Fernández","Daniel",""],["Gordillo","Aldo",""],["Pérez","Jennifer",""],["Tovar","Edmundo",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 15:39:45 GMT"}],"updateDate":"2024-07-11","timestamp":1720625985000,"abstract":"  Contribution: This article analyzes the learning and motivational impact of\nteacher-authored educational video games on computer science education and\ncompares its effectiveness in both face-to-face and online (remote) formats.\nThis work presents comparative data and findings obtained from 217 students who\nplayed the game in a face-to-face format (control group) and 104 students who\nplayed the game in an online format (experimental group). Background: Serious\nvideo games have been proven effective at computer science education, however,\nit is still unknown whether the effectiveness of these games is the same\nregardless of their format, face-to-face or online. Moreover, the usage of\ngames created through authoring tools has barely been explored. Research\nQuestions: Are teacher-authored educational video games effective in terms of\nlearning and motivation for computer science students? Does the effectiveness\nof teacher-authored educational video games depend on whether they are used in\na face-to-face or online format? Methodology: A quasi-experiment has been\nconducted by using three instruments (pre-test, post-test, and questionnaire)\nwith the purpose of comparing the effectiveness of game-based learning in\nface-to-face and online formats. A total of 321 computer science students\nplayed a teacher-authored educational video game aimed to learn about software\ndesign. Findings: The results reveal that teacher-authored educational video\ngames are highly effective in terms of knowledge acquisition and motivation\nboth in face-to-face and online formats. The results also show that some\nstudents' perceptions were more positive when a face-to-face format was used.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}