{"id":"2407.20906","title":"Automated Review Generation Method Based on Large Language Models","authors":"Shican Wu, Xiao Ma, Dehui Luo, Lulu Li, Xiangcheng Shi, Xin Chang,\n  Xiaoyun Lin, Ran Luo, Chunlei Pei, Zhi-Jian Zhao, Jinlong Gong","authorsParsed":[["Wu","Shican",""],["Ma","Xiao",""],["Luo","Dehui",""],["Li","Lulu",""],["Shi","Xiangcheng",""],["Chang","Xin",""],["Lin","Xiaoyun",""],["Luo","Ran",""],["Pei","Chunlei",""],["Zhao","Zhi-Jian",""],["Gong","Jinlong",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 15:26:36 GMT"}],"updateDate":"2024-07-31","timestamp":1722353196000,"abstract":"  Literature research, vital for scientific advancement, is overwhelmed by the\nvast ocean of available information. Addressing this, we propose an automated\nreview generation method based on Large Language Models (LLMs) to streamline\nliterature processing and reduce cognitive load. In case study on propane\ndehydrogenation (PDH) catalysts, our method swiftly generated comprehensive\nreviews from 343 articles, averaging seconds per article per LLM account.\nExtended analysis of 1041 articles provided deep insights into catalysts'\ncomposition, structure, and performance. Recognizing LLMs' hallucinations, we\nemployed a multi-layered quality control strategy, ensuring our method's\nreliability and effective hallucination mitigation. Expert verification\nconfirms the accuracy and citation integrity of generated reviews,\ndemonstrating LLM hallucination risks reduced to below 0.5% with over 95%\nconfidence. Released Windows application enables one-click review generation,\naiding researchers in tracking advancements and recommending literature. This\napproach showcases LLMs' role in enhancing scientific research productivity and\nsets the stage for further exploration.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wPbpFXTmthpbrxVYSBInfMIakG5al_HF6AjlXhQ3w8c","pdfSize":"1430049"}
