{"id":"2407.08428","title":"A Comprehensive Survey on Human Video Generation: Challenges, Methods,\n  and Insights","authors":"Wentao Lei, Jinting Wang, Fengji Ma, Guanjie Huang, Li Liu","authorsParsed":[["Lei","Wentao",""],["Wang","Jinting",""],["Ma","Fengji",""],["Huang","Guanjie",""],["Liu","Li",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 12:09:05 GMT"}],"updateDate":"2024-07-12","timestamp":1720699745000,"abstract":"  Human video generation is a dynamic and rapidly evolving task that aims to\nsynthesize 2D human body video sequences with generative models given control\nconditions such as text, audio, and pose. With the potential for wide-ranging\napplications in film, gaming, and virtual communication, the ability to\ngenerate natural and realistic human video is critical. Recent advancements in\ngenerative models have laid a solid foundation for the growing interest in this\narea. Despite the significant progress, the task of human video generation\nremains challenging due to the consistency of characters, the complexity of\nhuman motion, and difficulties in their relationship with the environment. This\nsurvey provides a comprehensive review of the current state of human video\ngeneration, marking, to the best of our knowledge, the first extensive\nliterature review in this domain. We start with an introduction to the\nfundamentals of human video generation and the evolution of generative models\nthat have facilitated the field's growth. We then examine the main methods\nemployed for three key sub-tasks within human video generation: text-driven,\naudio-driven, and pose-driven motion generation. These areas are explored\nconcerning the conditions that guide the generation process. Furthermore, we\noffer a collection of the most commonly utilized datasets and the evaluation\nmetrics that are crucial in assessing the quality and realism of generated\nvideos. The survey concludes with a discussion of the current challenges in the\nfield and suggests possible directions for future research. The goal of this\nsurvey is to offer the research community a clear and holistic view of the\nadvancements in human video generation, highlighting the milestones achieved\nand the challenges that lie ahead.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"gaqvZn81iwvohUgAnhNpOWIfizL4BVEwMqSf6He17lM","pdfSize":"1795158","objectId":"0xd9c56c841d51307e34f47b17369ad2f89267438119714d3e75592a13857ab77c","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
