{"id":"2407.20309","title":"Spectropolarimetric Inversion in Four Dimensions with Deep Learning\n  (SPIn4D): I. Overview, Magnetohydrodynamic Modeling, and Stokes Profile\n  Synthesis","authors":"Kai E. Yang, Lucas A. Tarr, Matthias Rempel, S. Curt Dodds, Sarah A.\n  Jaeggli, Peter Sadowski, Thomas A. Schad, Ian Cunnyngham, Jiayi Liu, Yannik\n  Glaser, Xudong Sun","authorsParsed":[["Yang","Kai E.",""],["Tarr","Lucas A.",""],["Rempel","Matthias",""],["Dodds","S. Curt",""],["Jaeggli","Sarah A.",""],["Sadowski","Peter",""],["Schad","Thomas A.",""],["Cunnyngham","Ian",""],["Liu","Jiayi",""],["Glaser","Yannik",""],["Sun","Xudong",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 17:32:22 GMT"}],"updateDate":"2024-07-31","timestamp":1722274342000,"abstract":"  The National Science Foundation's Daniel K. Inouye Solar Telescope (DKIST)\nwill provide high-resolution, multi-line spectropolarimetric observations that\nare poised to revolutionize our understanding of the Sun. Given the massive\ndata volume, novel inference techniques are required to unlock its full\npotential. Here, we provide an overview of our \"SPIn4D\" project, which aims to\ndevelop deep convolutional neural networks (CNNs) for estimating the physical\nproperties of the solar photosphere from DKIST spectropolarimetric\nobservations. We describe the magnetohydrodynamic (MHD) modeling and the Stokes\nprofile synthesis pipeline that produce the simulated output and input data,\nrespectively. These data will be used to train a set of CNNs that can rapidly\ninfer the four-dimensional MHD state vectors by exploiting the spatiotemporally\ncoherent patterns in the Stokes profile time series. Specifically, our\nradiative MHD model simulates the small-scale dynamo actions that are prevalent\nin quiet-Sun and plage regions. Six cases with different mean magnetic fields\nhave been conducted; each case covers six solar-hours, totaling 109 TB in data\nvolume. The simulation domain covers at least $25\\times25\\times8$ Mm with\n$16\\times16\\times12$ km spatial resolution, extending from the upper convection\nzone up to the temperature minimum region. The outputs are stored at a 40 s\ncadence. We forward model the Stokes profile of two sets of Fe I lines at 630\nand 1565 nm, which will be simultaneously observed by DKIST and can better\nconstrain the parameter variations along the line of sight. The MHD model\noutput and the synthetic Stokes profiles are publicly available.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZUdhhiOFYCyVIFz1hfo_HTAqNX68-7bYiWqh4xn4fDM","pdfSize":"18093384"}
