{"id":"2407.13801","title":"Application of a spectral scheme to simulate horizontally slowly varying\n  three-dimensional ocean acoustic propagation","authors":"Houwang Tu and Yongxian Wang and Xiaolan Zhou and Guojun Xu and\n  Dongbao Gao and Shuqing Ma","authorsParsed":[["Tu","Houwang",""],["Wang","Yongxian",""],["Zhou","Xiaolan",""],["Xu","Guojun",""],["Gao","Dongbao",""],["Ma","Shuqing",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 12:04:01 GMT"}],"updateDate":"2024-07-22","timestamp":1721217841000,"abstract":"  Three-dimensional numerical models for underwater sound propagation are\npopular in computational ocean acoustics. For horizontally slowly varying\nwaveguide environments, an adiabatic mode-parabolic equation hybrid theory can\nbe used for simulation. This theory employs adiabatic modes in the vertical\ndirection, simplifying the solution of the sound pressure to the solution of\nhorizontal refractive index of vertical modes. The refractive equations in the\nhorizontal direction are further solved by a ``split-step\" wide-angle parabolic\nequation model, following the approach of the ``vertical modes and horizontal\nparabolic equation\". Existing three-dimensional sound propagation models mostly\nuse finite difference methods for discretization, but in recent years, the\nacademic community has proposed new types of sound propagation models based on\nspectral methods. Spectral methods are numerical discretization methods based\non orthogonal polynomial approximation and weighted residual principles. They\noffer advantages such as high computational accuracy and fast convergence. In\nthis study, a three-dimensional adiabatic mode-parabolic equation hybrid model\ndiscretized using spectral methods is proposed. In the vertical direction, the\nmodal functions are solved using the Chebyshev spectral method. The medium\nlayering is handled using a domain decomposition strategy, and the leaky modes\nunder semi-infinite boundary conditions are addressed using an eigenvalue\ntransformation technique. In the horizontal direction, the perfectly matched\nlayer technique is utilized to handle unbounded computational domains, and the\nperfectly matched layer and computational domain are segmented into multiple\nlayers. Numerical simulations show that the Chebyshev spectral method achieves\nreliable results in the application of the adiabatic mode-parabolic equation\nhybrid model.\n","subjects":["Physics/Computational Physics","Physics/Atmospheric and Oceanic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}