{"id":"2407.08047","title":"Spatial-Temporal Attention Model for Traffic State Estimation with\n  Sparse Internet of Vehicles","authors":"Jianzhe Xue, Dongcheng Yuan, Yu Sun, Tianqi Zhang, Wenchao Xu, Haibo\n  Zhou, and Xuemin (Sherman) Shen","authorsParsed":[["Xue","Jianzhe","","Sherman"],["Yuan","Dongcheng","","Sherman"],["Sun","Yu","","Sherman"],["Zhang","Tianqi","","Sherman"],["Xu","Wenchao","","Sherman"],["Zhou","Haibo","","Sherman"],["Xuemin","","","Sherman"],["Shen","",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 20:58:53 GMT"},{"version":"v2","created":"Mon, 15 Jul 2024 02:31:15 GMT"}],"updateDate":"2024-07-16","timestamp":1720645133000,"abstract":"  The growing number of connected vehicles offers an opportunity to leverage\ninternet of vehicles (IoV) data for traffic state estimation (TSE) which plays\na crucial role in intelligent transportation systems (ITS). By utilizing only a\nportion of IoV data instead of the entire dataset, the significant overheads\nassociated with collecting and processing large amounts of data can be avoided.\nIn this paper, we introduce a novel framework that utilizes sparse IoV data to\nachieve cost-effective TSE. Particularly, we propose a novel spatial-temporal\nattention model called the convolutional retentive network (CRNet) to improve\nthe TSE accuracy by mining spatial-temporal traffic state correlations. The\nmodel employs the convolutional neural network (CNN) for spatial correlation\naggregation and the retentive network (RetNet) based on the attention mechanism\nto extract temporal correlations. Extensive simulations on a real-world IoV\ndataset validate the advantage of the proposed TSE approach in achieving\naccurate TSE using sparse IoV data, demonstrating its cost effectiveness and\npracticality for real-world applications.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}