{"id":"2407.07019","title":"Using Large Language Models for Generating Smart Contracts for Health\n  Insurance from Textual Policies","authors":"Inwon Kang and William Van Woensel and Oshani Seneviratne","authorsParsed":[["Kang","Inwon",""],["Van Woensel","William",""],["Seneviratne","Oshani",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 16:40:44 GMT"}],"updateDate":"2024-07-10","timestamp":1720543244000,"abstract":"  We explore using Large Language Models (LLMs) to generate application code\nthat automates health insurance processes from text-based policies. We target\nblockchain-based smart contracts as they offer immutability, verifiability,\nscalability, and a trustless setting: any number of parties can use the smart\ncontracts, and they need not have previously established trust relationships\nwith each other. Our methodology generates outputs at increasing levels of\ntechnical detail: (1) textual summaries, (2) declarative decision logic, and\n(3) smart contract code with unit tests. We ascertain LLMs are good at the task\n(1), and the structured output is useful to validate tasks (2) and (3).\nDeclarative languages (task 2) are often used to formalize healthcare policies,\nbut their execution on blockchain is non-trivial. Hence, task (3) attempts to\ndirectly automate the process using smart contracts. To assess the LLM output,\nwe propose completeness, soundness, clarity, syntax, and functioning code as\nmetrics. Our evaluation employs three health insurance policies (scenarios)\nwith increasing difficulty from Medicare's official booklet. Our evaluation\nuses GPT-3.5 Turbo, GPT-3.5 Turbo 16K, GPT-4, GPT-4 Turbo and CodeLLaMA. Our\nfindings confirm that LLMs perform quite well in generating textual summaries.\nAlthough outputs from tasks (2)-(3) are useful starting points, they require\nhuman oversight: in multiple cases, even \"runnable\" code will not yield sound\nresults; the popularity of the target language affects the output quality; and\nmore complex scenarios still seem a bridge too far. Nevertheless, our\nexperiments demonstrate the promise of LLMs for translating textual process\ndescriptions into smart contracts.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}