{"id":"2407.12937","title":"Multi-Band Wi-Fi Neural Dynamic Fusion","authors":"Sorachi Kato and Pu Perry Wang and Toshiaki Koike-Akino and Takuya\n  Fujihashi and Hassan Mansour and Petros Boufounos","authorsParsed":[["Kato","Sorachi",""],["Wang","Pu Perry",""],["Koike-Akino","Toshiaki",""],["Fujihashi","Takuya",""],["Mansour","Hassan",""],["Boufounos","Petros",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 18:08:53 GMT"}],"updateDate":"2024-07-19","timestamp":1721239733000,"abstract":"  Wi-Fi channel measurements across different bands, e.g., sub-7-GHz and 60-GHz\nbands, are asynchronous due to the uncoordinated nature of distinct standards\nprotocols, e.g., 802.11ac/ax/be and 802.11ad/ay. Multi-band Wi-Fi fusion has\nbeen considered before on a frame-to-frame basis for simple classification\ntasks, which does not require fine-time-scale alignment. In contrast, this\npaper considers asynchronous sequence-to-sequence fusion between sub-7-GHz\nchannel state information (CSI) and 60-GHz beam signal-to-noise-ratio~(SNR)s\nfor more challenging tasks such as continuous coordinate estimation. To handle\nthe timing disparity between asynchronous multi-band Wi-Fi channel\nmeasurements, this paper proposes a multi-band neural dynamic fusion (NDF)\nframework. This framework uses separate encoders to embed the multi-band Wi-Fi\nmeasurement sequences to separate initial latent conditions. Using a\ncontinuous-time ordinary differential equation (ODE) modeling, these initial\nlatent conditions are propagated to respective latent states of the multi-band\nchannel measurements at the same time instances for a latent alignment and a\npost-ODE fusion, and at their original time instances for measurement\nreconstruction. We derive a customized loss function based on the variational\nevidence lower bound (ELBO) that balances between the multi-band measurement\nreconstruction and continuous coordinate estimation. We evaluate the NDF\nframework using an in-house multi-band Wi-Fi testbed and demonstrate\nsubstantial performance improvements over a comprehensive list of single-band\nand multi-band baseline methods.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}