{"id":"2407.19800","title":"Astrophysical insights into magnetic Penrose process around\n  parameterized Konoplya-Rezzolla-Zhidenko black hole","authors":"Tursunali Xamidov, Sanjar Shaymatov, Pankaj Sheoran and Bobomurat\n  Ahmedov","authorsParsed":[["Xamidov","Tursunali",""],["Shaymatov","Sanjar",""],["Sheoran","Pankaj",""],["Ahmedov","Bobomurat",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 08:48:25 GMT"}],"updateDate":"2024-07-30","timestamp":1722242905000,"abstract":"  In this study, we investigate the parameterized Konoplya-Rezzolla-Zhidenko\n(KRZ) black hole (BH) spacetime in the presence of an external asymptotically\nuniform magnetic field. We first examine the innermost stable circular orbit\n(ISCO) radii for both neutral and charged test particles, demonstrating that\nthe deformation parameters, $\\delta_1$ and $\\delta_2$, reduce the ISCO values.\nSubsequently, we assess the energy efficiency of the magnetic Penrose process\n(MPP) for an axially symmetric parameterized BH, analyzing the effects of the\ndeformation parameters and the magnetic field on the energy extraction process.\nOur findings indicate that the rotational deformation parameter $\\delta_2$ is\ncrucial for the efficiency of energy extraction from the BH. The synergy\nbetween the rotational deformation parameter and the magnetic field\nsignificantly boosts the energy extraction efficiency, with values exceeding\n$100\\%$. Interestingly, for extremal BHs with negative $\\delta_2$ values, the\nenergy efficiency increases, in contrast to Kerr BHs where the MPP effect\ndiminishes. Additionally, we explore the astrophysical implications of the MPP\nby deriving the maximum energy of a proton escaping from the KRZ parameterized\nBH due to the beta decay of a free neutron near the horizon. Our results show\nthat negative $\\delta_2$ values require stronger magnetic fields to achieve\nequivalent energy levels for high-energy protons, providing deeper insights\ninto high-energy astrophysical phenomena around the parameterized BH.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}