{"id":"2407.15817","title":"Enhancing Cell Instance Segmentation in Scanning Electron Microscopy\n  Images via a Deep Contour Closing Operator","authors":"Florian Robert, Alexia Calovoulos, Laurent Facq, Fanny Decoeur,\n  Etienne Gontier, Christophe F. Grosset, Baudouin Denis de Senneville","authorsParsed":[["Robert","Florian",""],["Calovoulos","Alexia",""],["Facq","Laurent",""],["Decoeur","Fanny",""],["Gontier","Etienne",""],["Grosset","Christophe F.",""],["de Senneville","Baudouin Denis",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 17:32:06 GMT"}],"updateDate":"2024-07-23","timestamp":1721669526000,"abstract":"  Accurately segmenting and individualizing cells in SEM images is a highly\npromising technique for elucidating tissue architecture in oncology. While\ncurrent AI-based methods are effective, errors persist, necessitating\ntime-consuming manual corrections, particularly in areas where the quality of\ncell contours in the image is poor and requires gap filling. This study\npresents a novel AI-driven approach for refining cell boundary delineation to\nimprove instance-based cell segmentation in SEM images, also reducing the\nnecessity for residual manual correction. A CNN COp-Net is introduced to\naddress gaps in cell contours, effectively filling in regions with deficient or\nabsent information. The network takes as input cell contour probability maps\nwith potentially inadequate or missing information and outputs corrected cell\ncontour delineations. The lack of training data was addressed by generating low\nintegrity probability maps using a tailored PDE. We showcase the efficacy of\nour approach in augmenting cell boundary precision using both private SEM\nimages from PDX hepatoblastoma tissues and publicly accessible images datasets.\nThe proposed cell contour closing operator exhibits a notable improvement in\ntested datasets, achieving respectively close to 50% (private data) and 10%\n(public data) increase in the accurately-delineated cell proportion compared to\nstate-of-the-art methods. Additionally, the need for manual corrections was\nsignificantly reduced, therefore facilitating the overall digitalization\nprocess. Our results demonstrate a notable enhancement in the accuracy of cell\ninstance segmentation, particularly in highly challenging regions where image\nquality compromises the integrity of cell boundaries, necessitating gap\nfilling. Therefore, our work should ultimately facilitate the study of tumour\ntissue bioarchitecture in onconanotomy field.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}