{"id":"2407.03062","title":"Optimization study of a Z-type airflow cooling system of a lithium-ion\n  battery pack","authors":"Santosh Argade, Ashoke De","authorsParsed":[["Argade","Santosh",""],["De","Ashoke",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 12:34:47 GMT"}],"updateDate":"2024-07-04","timestamp":1720010087000,"abstract":"  The present study aims to optimize the structural design of a Z-type flow\nlithium-ion battery pack with a forced air-cooling system (FACS) known as BTMS\n(Battery Thermal Management System). The main goal is to minimize Tmax (maximum\ntemperature) and \\delta Tmax (maximum temperature difference) while ensuring an\neven airflow distribution within the battery module. The present study\nthoroughly investigates critical factors such as the inlet air velocity,\ntapered inlet manifold, and the number of secondary outlets to evaluate their\nimpact on thermal performance and airflow uniformity within the battery module.\nIncreasing the inlet air velocity from 3 to 4.5 m/s significantly improves the\nthermal cooling performance of the BTMS, resulting in a decrease of 4.57\n{\\deg}C (10.05%) in Tmax and 0.29 {\\deg}C (9.79%) in \\delta Tmax compared to\nthe original 3 m/s velocity. Further, the study assesses the significance of a\ntapered inlet manifold as a critical factor, revealing its substantial impact\non cooling performance and temperature reductions in battery cells 3-9. It also\nfacilitates a more uniform airflow distribution, decreasing the velocity\ndifference between channel 9 and channel 1 from 3.32 m/s to 2.50 m/s.\nIncorporating 7 secondary outlets significantly improves the heat dissipation\nability of the BTMS, resulting in a decrease of 0.894 {\\deg}C (2.18%) in Tmax\nand 2.23 {\\deg}C (72.84%) in \\delta Tmax compared to the configuration with 0\nsecondary outlets. By optimizing these parameters, the aim is to enhance BTMS's\ncapabilities, improving LIB packs' performance and reliability.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}