{"id":"2407.00759","title":"Analysis of Modern Computer Vision Models for Blood Cell Classification","authors":"Alexander Kim (1) and Ryan Kim (2) ((1) University of Illinois\n  Urbana-Champaign, (2) William Fremd High School)","authorsParsed":[["Kim","Alexander",""],["Kim","Ryan",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 16:49:29 GMT"}],"updateDate":"2024-07-02","timestamp":1719766169000,"abstract":"  The accurate classification of white blood cells and related blood components\nis crucial for medical diagnoses. While traditional manual examinations and\nautomated hematology analyzers have been widely used, they are often slow and\nprone to errors. Recent advancements in deep learning have shown promise for\naddressing these limitations. Earlier studies have demonstrated the viability\nof convolutional neural networks such as DenseNet, ResNet, and VGGNet for this\ntask. Building on these foundations, our work employs more recent and efficient\nmodels to achieve rapid and accurate results. Specifically, this study used\nstate-of-the-art architectures, including MaxVit, EfficientVit, EfficientNet,\nEfficientNetV2, and MobileNetV3. This study aimed to evaluate the performance\nof these models in WBC classification, potentially offering a more efficient\nand reliable alternative to current methods. Our approach not only addresses\nthe speed and accuracy concerns of traditional techniques but also explores the\napplicability of innovative deep learning models in hematological analysis.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EFEqqocDpFADVb3X5uDKKfpz2kVbcR8KgUxq3Dhe2J4","pdfSize":"579831","objectId":"0xbfa06f7cde0010f4404ef2ee6b2336f50d494d0f5d3f0c6bce0696a3d53d273d","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
