{"id":"2407.10381","title":"Hybrid Oscillator-Qubit Quantum Processors: Instruction Set\n  Architectures, Abstract Machine Models, and Applications","authors":"Yuan Liu, Shraddha Singh, Kevin C. Smith, Eleanor Crane, John M.\n  Martyn, Alec Eickbusch, Alexander Schuckert, Richard D. Li, Jasmine\n  Sinanan-Singh, Micheline B. Soley, Takahiro Tsunoda, Isaac L. Chuang, Nathan\n  Wiebe and Steven M. Girvin","authorsParsed":[["Liu","Yuan",""],["Singh","Shraddha",""],["Smith","Kevin C.",""],["Crane","Eleanor",""],["Martyn","John M.",""],["Eickbusch","Alec",""],["Schuckert","Alexander",""],["Li","Richard D.",""],["Sinanan-Singh","Jasmine",""],["Soley","Micheline B.",""],["Tsunoda","Takahiro",""],["Chuang","Isaac L.",""],["Wiebe","Nathan",""],["Girvin","Steven M.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 01:23:47 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 21:50:57 GMT"}],"updateDate":"2024-08-07","timestamp":1721006627000,"abstract":"  Quantum computing with discrete variable (DV, qubit) hardware is approaching\nthe large scales necessary for computations beyond the reach of classical\ncomputers. However, important use cases such as quantum simulations of physical\nmodels containing bosonic modes, and quantum error correction are challenging\nfor DV-only systems. Separately, hardware containing native continuous-variable\n(CV, oscillator) systems has received attention as an alternative approach, yet\nthe universal control of such systems is non-trivial. In this work, we show\nthat hybrid CV-DV hardware offers a great advantage in meeting these\nchallenges, offering a powerful computational paradigm that inherits the\nstrengths of both DV and CV processors. We provide a pedagogical introduction\nto CV-DV systems and the multiple abstraction layers needed to produce a full\nsoftware stack connecting applications to hardware. We present a variety of new\nhybrid CV-DV compilation techniques, algorithms, and applications, including\nthe extension of quantum signal processing concepts to CV-DV systems and\nstrategies to simulate systems of interacting spins, fermions, and bosons. To\nfacilitate the development of hybrid CV-DV processor systems, we introduce\nformal Abstract Machine Models and Instruction Set Architectures -- essential\nabstractions that enable developers to formulate applications, compile\nalgorithms, and explore the potential of current and future hardware for\nrealizing fault-tolerant circuits, modules, and processors. Hybrid CV-DV\nquantum computations are beginning to be performed in superconducting, trapped\nion, and neutral atom platforms, and large-scale experiments are set to be\ndemonstrated in the near future. We present a timely and comprehensive guide to\nthis relatively unexplored yet promising approach to quantum computation and\nproviding an architectural backbone to guide future development.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}