{"id":"2407.08901","title":"Accelerating Eigenvalue Computation for Nuclear Structure Calculations\n  via Perturbative Corrections","authors":"Dong Min Roh, Esmond Ng, Chao Yang, Dean Lee, Pieter Maris, James P.\n  Vary","authorsParsed":[["Roh","Dong Min",""],["Ng","Esmond",""],["Yang","Chao",""],["Lee","Dean",""],["Maris","Pieter",""],["Vary","James P.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 00:24:02 GMT"}],"updateDate":"2024-07-16","timestamp":1720743842000,"abstract":"  We present a new method for computing the lowest few eigenvalues and the\ncorresponding eigenvectors of a nuclear many-body Hamiltonian represented in a\ntruncated configuration interaction subspace, i.e., the no-core shell model\n(NCSM). The method uses the hierarchical structure of the NCSM Hamiltonian to\npartition the Hamiltonian as the sum of two matrices. The first matrix\ncorresponds to the Hamiltonian represented in a small configuration space,\nwhereas the second is viewed as the perturbation to the first matrix.\nEigenvalues and eigenvectors of the first matrix can be computed efficiently.\nPerturbative corrections to the eigenvectors of the first matrix can be\nobtained from the solutions of a sequence of linear systems of equations\ndefined in the small configuration space. These correction vectors can be\ncombined with the approximate eigenvectors of the first matrix to construct a\nsubspace from which more accurate approximations of the desired eigenpairs can\nbe obtained. We call this method a Subspace Projection with Perturbative\nCorrections (SPPC) method. We show by numerical examples that the SPPC method\ncan be more efficient than conventional iterative methods for solving\nlarge-scale eigenvalue problems such as the Lanczos, block Lanczos and the\nlocally optimal block preconditioned conjugate gradient (LOBPCG) method. The\nmethod can also be combined with other methods to avoid convergence stagnation.\n","subjects":["Physics/Computational Physics","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Zl2I7s-mlWtFXFOh4Dmf1BeNZR-RvbvFh127Actb9W0","pdfSize":"1446025","objectId":"0x1c81fc3cce5ad8df1597708b46a5873d2729e2787b4086f22f35ba61ab7836af","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
