{"id":"2407.07876","title":"Approximate Unitary $k$-Designs from Shallow, Low-Communication Circuits","authors":"Nicholas LaRacuente and Felix Leditzky","authorsParsed":[["LaRacuente","Nicholas",""],["Leditzky","Felix",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 17:43:23 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 17:56:53 GMT"}],"updateDate":"2024-07-12","timestamp":1720633403000,"abstract":"  Random unitaries are useful in quantum information and related fields but\nhard to generate with limited resources. An approximate unitary $k$-design is\nan ensemble of unitaries and measure over which the average is close to a Haar\n(uniformly) random ensemble up to the first $k$ moments. A particularly strong\nnotion of approximation bounds the distance from Haar randomness in relative\nerror: the approximate design can be written as a convex combination involving\nan exact design and vice versa. We construct multiplicative-error approximate\nunitary $k$-design ensembles for which communication between subsystems is\n$O(1)$ in the system size. These constructions use the alternating projection\nmethod to analyze overlapping Haar twirls, giving a bound on the convergence\nspeed to the full twirl with respect to the $2$-norm. Using von Neumann\nsubalgebra indices to replace system dimension, the 2-norm distance converts to\nrelative error without introducing any additional dimension dependence. Via\nrecursion on these constructions, we construct a scheme yielding relative error\ndesigns in $O \\big ( (k \\log k + \\log m + \\log(1/\\epsilon) ) k\\,\n\\text{polylog}(k) \\big )$ depth, where $m$ is the number of qudits in the\ncomplete system and $\\epsilon$ the approximation error. This sublinear depth\nconstruction answers one variant of [Harrow and Mehraban 2023, Open Problem 1].\nMoreover, entanglement generated by the sublinear depth scheme follows area\nlaws on spatial lattices up to corrections logarithmic in the full system size.\n","subjects":["Physics/Quantum Physics","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}