{"id":"2407.00966","title":"Smoothed Analysis for Learning Concepts with Low Intrinsic Dimension","authors":"Gautam Chandrasekaran, Adam Klivans, Vasilis Kontonis, Raghu Meka,\n  Konstantinos Stavropoulos","authorsParsed":[["Chandrasekaran","Gautam",""],["Klivans","Adam",""],["Kontonis","Vasilis",""],["Meka","Raghu",""],["Stavropoulos","Konstantinos",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 04:58:36 GMT"}],"updateDate":"2024-07-02","timestamp":1719809916000,"abstract":"  In traditional models of supervised learning, the goal of a learner -- given\nexamples from an arbitrary joint distribution on $\\mathbb{R}^d \\times \\{\\pm\n1\\}$ -- is to output a hypothesis that is competitive (to within $\\epsilon$) of\nthe best fitting concept from some class. In order to escape strong hardness\nresults for learning even simple concept classes, we introduce a\nsmoothed-analysis framework that requires a learner to compete only with the\nbest classifier that is robust to small random Gaussian perturbation.\n  This subtle change allows us to give a wide array of learning results for any\nconcept that (1) depends on a low-dimensional subspace (aka multi-index model)\nand (2) has a bounded Gaussian surface area. This class includes functions of\nhalfspaces and (low-dimensional) convex sets, cases that are only known to be\nlearnable in non-smoothed settings with respect to highly structured\ndistributions such as Gaussians.\n  Surprisingly, our analysis also yields new results for traditional\nnon-smoothed frameworks such as learning with margin. In particular, we obtain\nthe first algorithm for agnostically learning intersections of $k$-halfspaces\nin time $k^{poly(\\frac{\\log k}{\\epsilon \\gamma}) }$ where $\\gamma$ is the\nmargin parameter. Before our work, the best-known runtime was exponential in\n$k$ (Arriaga and Vempala, 1999).\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computational Complexity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}