{"id":"2407.17707","title":"Persistent homology elucidates hierarchical structures in amorphous\n  solids responsible for mechanical properties","authors":"Emi Minamitani, Takenobu Nakamura, Ippei Obayashi, Hideyuki Mizuno","authorsParsed":[["Minamitani","Emi",""],["Nakamura","Takenobu",""],["Obayashi","Ippei",""],["Mizuno","Hideyuki",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 02:03:30 GMT"}],"updateDate":"2024-07-26","timestamp":1721873010000,"abstract":"  Understanding the role of atomic-level structures in determining amorphous\nmaterial properties has been a long-standing challenge in solid-state physics.\nUpon mechanical loading, amorphous materials undergo both simple affine\ndisplacement and spatially inhomogeneous non-affine displacement. These two\ntypes of displacement contribute differently to the elastic modulus, i.e., the\nBorn (or affine) and non-affine terms. Whether \"soft\" local structures\ncharacterized by either small Born terms or large non-affine displacements\ndiffer has remained an unanswered question despite the importance in\nfundamental and applied physics. To address this question, we combined\nmolecular dynamics simulations and persistent homology analyses for amorphous\nSi. We found that the characteristics of local structures with large non-affine\ndisplacements differed significantly from those with small Born terms. The\nlocal structures surrounding atoms with small Born terms are characterized at\nthe scale of short-range order (SRO), whereas those surrounding atoms with\nlarge non-affine displacements have hierarchical structures ranging from SRO to\nmedium-range order. Furthermore, we found that these hierarchical structures\nare related to low-energy localized vibrational excitations. The correlation\nbetween the non-affine displacement and hierarchical geometric features\nelucidated by persistent homology provides a new viewpoint for understanding\nand designing the mechanical properties of amorphous materials based on their\nstatic structures.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}