{"id":"2407.04473","title":"The ACCEL$^2$ project: simulating Lyman-$\\alpha$ forest in large-volume\n  hydrodynamical simulations","authors":"Sol\\`ene Chabanier, Corentin Ravoux, Lucas Latrille, Jean Sexton,\n  \\'Eric Armengaud, Julian Bautista, Tyann Dumerchat, Zarija Luki\\'c","authorsParsed":[["Chabanier","Solène",""],["Ravoux","Corentin",""],["Latrille","Lucas",""],["Sexton","Jean",""],["Armengaud","Éric",""],["Bautista","Julian",""],["Dumerchat","Tyann",""],["Lukić","Zarija",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 12:43:56 GMT"}],"updateDate":"2024-07-08","timestamp":1720183436000,"abstract":"  Cosmological information is usually extracted from the Lyman-$\\alpha$ forest\ncorrelations using only either large-scale information interpreted through\nlinear theory or using small-scale information interpreted by means of\nexpensive hydrodynamical simulations. A complete cosmological interpretation of\nthe 3D correlations at all measurable scales is challenged by the need of more\nrealistic models including the complex growth of non-linear small scales that\ncan only be studied within large hydrodynamical simulations. Past work were\noften limited by the trade off between the simulated cosmological volume and\nthe resolution of the low-density intergalactic medium from which the\nLyman-$\\alpha$ signal originates. We conduct a suite of hydrodynamical\nsimulations of the intergalactic medium, including one of the largest\nLyman-$\\alpha$ simulations ever performed in terms of volume (640\n$h^{-1}\\mathrm{Mpc}$), alongside simulations in smaller volumes with\nresolutions up to 25 $h^{-1}\\mathrm{kpc}$. We compare the 3D Lyman-$\\alpha$\npower spectra predicted by those simulations to different non-linear models.\nThe inferred Lyman-$\\alpha$ bias and RSD parameters, $b_\\alpha$ and\n$\\beta_\\alpha$ are in remarkable agreement with those measured in SDSS and DESI\ndata. We find that, contrary to intuition, the convergence of large-scale modes\nof the 3D Lyman-$\\alpha$ power spectra, which determines $\\beta_\\alpha$, is\nprimarily influenced by the resolution of the simulation box through mode\ncoupling, rather than the box size itself. Finally, we study the BAO signal\nencoded in the 3D Lyman-$\\alpha$ power spectra. For the first time with a\nhydrodynamical simulation, we clearly detect the BAO signal, however we only\nmarginally detect its damping, associated with the non-linear growth of the\nstructures.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}