{"id":"2407.09884","title":"Metabolic activity controls the emergence of coherent flows in microbial\n  suspensions","authors":"Alexandros A. Fragkopoulos, Florian B\\\"ohme, Nicole Drewes, Oliver\n  B\\\"aumchen","authorsParsed":[["Fragkopoulos","Alexandros A.",""],["Böhme","Florian",""],["Drewes","Nicole",""],["Bäumchen","Oliver",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 13:18:49 GMT"}],"updateDate":"2024-07-16","timestamp":1720876729000,"abstract":"  Photosynthetic microbes have evolved and successfully adapted to the\never-changing environmental conditions in complex microhabitats throughout\nalmost all ecosystems on Earth. In the absence of light, they can sustain their\nbiological functionalities through aerobic respiration, and even in anoxic\nconditions through anaerobic metabolic activity. For a suspension of\nphotosynthetic microbes in an anaerobic environment, individual cellular\nmotility is directly controlled by its photosynthetic activity, i.e. the\nintensity of the incident light absorbed by chlorophyll. The effects of the\nmetabolic activity on the collective motility on the population level, however,\nremain elusive so far. Here, we demonstrate that at high light intensities, a\nsuspension of photosynthetically active microbes exhibits a stable reverse\nsedimentation profile of the cell density due to the microbes' natural bias to\nmove against gravity. With decreasing photosynthetic activity, and therefore\nsuppressed individual motility, the living suspension becomes unstable giving\nrise to coherent bioconvective flows. The collective motility is fully\nreversible and manifests as regular, three-dimensional plume structures, in\nwhich flow rates and cell distributions are directly controlled via the light\nintensity. The coherent flows emerge in the highly unfavourable condition of\nlacking both light and oxygen and, thus, might help the microbial collective to\nexpand the exploration of their natural habitat in search for better survival\nconditions.\n","subjects":["Physics/Biological Physics","Condensed Matter/Soft Condensed Matter","Condensed Matter/Statistical Mechanics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}