{"id":"2407.02689","title":"Accelerating Distributed Optimization: A Primal-Dual Perspective on\n  Local Steps","authors":"Junchi Yang, Murat Yildirim, Qiu Feng","authorsParsed":[["Yang","Junchi",""],["Yildirim","Murat",""],["Feng","Qiu",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 22:14:54 GMT"},{"version":"v2","created":"Sun, 11 Aug 2024 05:10:43 GMT"}],"updateDate":"2024-08-13","timestamp":1719958494000,"abstract":"  In distributed machine learning, efficient training across multiple agents\nwith different data distributions poses significant challenges. Even with a\ncentralized coordinator, current algorithms that achieve optimal communication\ncomplexity typically require either large minibatches or compromise on gradient\ncomplexity. In this work, we tackle both centralized and decentralized settings\nacross strongly convex, convex, and nonconvex objectives. We first demonstrate\nthat a basic primal-dual method, (Accelerated) Gradient Ascent Multiple\nStochastic Gradient Descent (GA-MSGD), applied to the Lagrangian of distributed\noptimization inherently incorporates local updates, because the inner loops of\nrunning Stochastic Gradient Descent on the primal variable require no\ninter-agent communication. Notably, for strongly convex objectives,\n(Accelerated) GA-MSGD achieves linear convergence in communication rounds\ndespite the Lagrangian being only linear in the dual variables. This is due to\na structural property where the dual variable is confined to the span of the\ncoupling matrix, rendering the dual problem strongly concave. When integrated\nwith the Catalyst framework, our approach achieves nearly optimal communication\ncomplexity across various settings without the need for minibatches.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Mathematics/Optimization and Control","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"pxuc0h_lii8vUcX5r5MpitVGXOHC6puMSbDdcfT-i38","pdfSize":"528368","objectId":"0x8ee7fba09041a2d2372df82ddfae3a8fad1c2a647e413847e785f1bb4489a84c","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
