{"id":"2407.09234","title":"SU(3) symmetry analysis in charmed baryon two body decays with penguin\n  diagram contribution","authors":"Zhi-Peng Xing, Yu-Ji Shi, Jin Sun, Ye Xing","authorsParsed":[["Xing","Zhi-Peng",""],["Shi","Yu-Ji",""],["Sun","Jin",""],["Xing","Ye",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 12:58:43 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 06:17:49 GMT"}],"updateDate":"2024-07-18","timestamp":1720789123000,"abstract":"  An increasing number of experimental measurements from the BESIII, Belle, and\nBelle-II collaborations encourage investigations into charmed baryon two-body\ndecay processes. By including contributions from the penguin diagrams that are\nignored in previous studies, we perform a global analysis with SU(3) flavor\nsymmetry. Assuming all form factors are real, we achieve a remarkable minimal\n$\\chi^{2}/d.o.f = 0.788$ and find that the contribution of the amplitude\nproportional to $V_{cb}^*V_{ub}$ is of the order $\\sim 0.01$, comparable with\nthe contribution of the tree-level diagram. Additionally, by using the KPW\ntheorem to reduce the number of amplitudes from 13 to 7 in the leading\ncontribution, it becomes possible to consider the complex form factor case for\nthe leading IRA amplitude in the global analysis. However, the analysis of\ncomplex form factors significantly conflicts with the experimental data\n$Br(\\Xi_c^0\\to\\Xi^-\\pi^+)$, and by excluding this data, $\\chi^2/d.o.f$ is\nreduced from 5.95 to 1.19. Although the analysis of complex form factors shows\na significant central value of the penguin diagram contribution, the large\nerrors from the corresponding form factors make it a challenge to precisely\ndetermine its true contribution. Consequently, the direct CP violation in decay\nprocesses is predicted to be approximately zero. With more data in future\nexperiments, the penguin diagram contribution with the amplitude proportional\nto $V_{cb}^*V_{ub}$ will be precisely determined, allowing for a more accurate\nprediction of CP violation. Our analysis necessitates further theoretical\ninvestigations and experimental measurements in the future.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}