{"id":"2407.18514","title":"Efficiently and accurately simulating multi-dimensional M-coupled\n  nonlinear Schr\\\"odinger equations with fourth-order time integrators and\n  Fourier spectral method","authors":"Nate Lovett, Harish Bhatt","authorsParsed":[["Lovett","Nate",""],["Bhatt","Harish",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 04:59:02 GMT"}],"updateDate":"2024-07-29","timestamp":1721969942000,"abstract":"  Coupled nonlinear Schr\\\"odinger equations model various physical phenomena,\nsuch as wave propagation in nonlinear optics, multi-component Bose-Einstein\ncondensates, and shallow water waves. Despite their extensive applications,\nanalytical solutions of coupled nonlinear Schr\\\"odinger equations are widely\neither unknown or challenging to compute, prompting the need for stable and\nefficient numerical methods to understand the nonlinear phenomenon and complex\ndynamics of systems governed by coupled nonlinear Schr\\\"odinger equations. This\npaper explores the use of the fourth-order Runge-Kutta based exponential\ntime-differencing and integrating factor methods combined with the Fourier\nspectral method to simulate multi-dimensional M-coupled nonlinear Schr\\\"odinger\nequations.\n  The theoretical derivation and stability of the methods, as well as the\nruntime complexity of the algorithms used for their implementation, are\nexamined. Numerical experiments are performed on systems of two and four\nmulti-dimensional coupled nonlinear Schr\\\"odinger equations. It is demonstrated\nby the results that both methods effectively conserve mass and energy while\nmaintaining fourth-order temporal and spectral spatial convergence. Overall, it\nis shown by the numerical results that the exponential time-differencing method\noutperforms the integrating factor method in this application, and both may be\nconsidered further in modeling more nonlinear dynamics in future work.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3HKfRvxmRHp63_CQiqxAwBIcg48o_HNjz-vMWJV9mjc","pdfSize":"2525182"}
