{"id":"2407.02277","title":"MelodyT5: A Unified Score-to-Score Transformer for Symbolic Music\n  Processing","authors":"Shangda Wu, Yashan Wang, Xiaobing Li, Feng Yu, Maosong Sun","authorsParsed":[["Wu","Shangda",""],["Wang","Yashan",""],["Li","Xiaobing",""],["Yu","Feng",""],["Sun","Maosong",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 14:06:31 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 16:25:20 GMT"}],"updateDate":"2024-07-04","timestamp":1719929191000,"abstract":"  In the domain of symbolic music research, the progress of developing scalable\nsystems has been notably hindered by the scarcity of available training data\nand the demand for models tailored to specific tasks. To address these issues,\nwe propose MelodyT5, a novel unified framework that leverages an\nencoder-decoder architecture tailored for symbolic music processing in ABC\nnotation. This framework challenges the conventional task-specific approach,\nconsidering various symbolic music tasks as score-to-score transformations.\nConsequently, it integrates seven melody-centric tasks, from generation to\nharmonization and segmentation, within a single model. Pre-trained on\nMelodyHub, a newly curated collection featuring over 261K unique melodies\nencoded in ABC notation and encompassing more than one million task instances,\nMelodyT5 demonstrates superior performance in symbolic music processing via\nmulti-task transfer learning. Our findings highlight the efficacy of multi-task\ntransfer learning in symbolic music processing, particularly for data-scarce\ntasks, challenging the prevailing task-specific paradigms and offering a\ncomprehensive dataset and framework for future explorations in this domain.\n","subjects":["Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"akq9yFaI7YUKoYv25s-Qwc3bp7K0G--IjSAL5wBqfeA","pdfSize":"293915","objectId":"0xe84672d09cb7f4d184edc4a8626d8d09ce162cd0824727efdeee2a77372b3e92","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
