{"id":"2407.19468","title":"MVPbev: Multi-view Perspective Image Generation from BEV with Test-time\n  Controllability and Generalizability","authors":"Buyu Liu, Kai Wang, Yansong Liu, Jun Bao, Tingting Han and Jun Yu","authorsParsed":[["Liu","Buyu",""],["Wang","Kai",""],["Liu","Yansong",""],["Bao","Jun",""],["Han","Tingting",""],["Yu","Jun",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 11:39:40 GMT"}],"updateDate":"2024-07-30","timestamp":1722166780000,"abstract":"  This work aims to address the multi-view perspective RGB generation from text\nprompts given Bird-Eye-View(BEV) semantics. Unlike prior methods that neglect\nlayout consistency, lack the ability to handle detailed text prompts, or are\nincapable of generalizing to unseen view points, MVPbev simultaneously\ngenerates cross-view consistent images of different perspective views with a\ntwo-stage design, allowing object-level control and novel view generation at\ntest-time. Specifically, MVPbev firstly projects given BEV semantics to\nperspective view with camera parameters, empowering the model to generalize to\nunseen view points. Then we introduce a multi-view attention module where\nspecial initialization and de-noising processes are introduced to explicitly\nenforce local consistency among overlapping views w.r.t. cross-view homography.\nLast but not least, MVPbev further allows test-time instance-level\ncontrollability by refining a pre-trained text-to-image diffusion model. Our\nextensive experiments on NuScenes demonstrate that our method is capable of\ngenerating high-resolution photorealistic images from text descriptions with\nthousands of training samples, surpassing the state-of-the-art methods under\nvarious evaluation metrics. We further demonstrate the advances of our method\nin terms of generalizability and controllability with the help of novel\nevaluation metrics and comprehensive human analysis. Our code, data, and model\ncan be found in \\url{https://github.com/kkaiwwana/MVPbev}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}