{"id":"2407.13151","title":"Wavelet-based Bi-dimensional Aggregation Network for SAR Image Change\n  Detection","authors":"Jiangwei Xie, Feng Gao, Xiaowei Zhou, Junyu Dong","authorsParsed":[["Xie","Jiangwei",""],["Gao","Feng",""],["Zhou","Xiaowei",""],["Dong","Junyu",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 04:36:10 GMT"}],"updateDate":"2024-07-19","timestamp":1721277370000,"abstract":"  Synthetic aperture radar (SAR) image change detection is critical in remote\nsensing image analysis. Recently, the attention mechanism has been widely used\nin change detection tasks. However, existing attention mechanisms often employ\ndown-sampling operations such as average pooling on the Key and Value\ncomponents to enhance computational efficiency. These irreversible operations\nresult in the loss of high-frequency components and other important\ninformation. To address this limitation, we develop Wavelet-based\nBi-dimensional Aggregation Network (WBANet) for SAR image change detection. We\ndesign a wavelet-based self-attention block that includes discrete wavelet\ntransform and inverse discrete wavelet transform operations on Key and Value\ncomponents. Hence, the feature undergoes downsampling without any loss of\ninformation, while simultaneously enhancing local contextual awareness through\nan expanded receptive field. Additionally, we have incorporated a\nbi-dimensional aggregation module that boosts the non-linear representation\ncapability by merging spatial and channel information via broadcast mechanism.\nExperimental results on three SAR datasets demonstrate that our WBANet\nsignificantly outperforms contemporary state-of-the-art methods. Specifically,\nour WBANet achieves 98.33\\%, 96.65\\%, and 96.62\\% of percentage of correct\nclassification (PCC) on the respective datasets, highlighting its superior\nperformance. Source codes are available at\n\\url{https://github.com/summitgao/WBANet}.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IBXqUIRpFUokeCUc0AVJwyDEJBEziobQxkaj0odgVfI","pdfSize":"969012"}
