{"id":"2407.17560","title":"Observability of dynamical tides in merging eccentric neutron star\n  binaries","authors":"J\\'anos Tak\\'atsy, Bence Kocsis, P\\'eter Kov\\'acs","authorsParsed":[["Takátsy","János",""],["Kocsis","Bence",""],["Kovács","Péter",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 18:00:03 GMT"}],"updateDate":"2024-07-26","timestamp":1721844003000,"abstract":"  While dynamical tides only become relevant during the last couple of orbits\nfor circular inspirals, orbital eccentricity can increase their impact during\nearlier phases of the inspiral by exciting tidal oscillations at each close\nencounter. We investigate the effect of dynamical tides on the orbital\nevolution of eccentric neutron star binaries using post-Newtonian numerical\nsimulations and constructing an analytic stochastic model. Our study reveals a\nstrong dependence of dynamical tides on the pericenter distance, with the\nenergy transferred to dynamical tides over that dissipated in gravitational\nwaves (GWs) exceeding $\\sim1\\%$ at separations $r_\\mathrm{p}\\lesssim50$ km for\nlarge eccentricities. We demonstrate that the effect of dynamical tides on\norbital evolution can manifest as a phase shift in the GW signal. We show that\nthe signal-to-noise ratio of the GW phase shift can reach the detectability\nthreshold of 8 with a single aLIGO detector at design densitivity for eccentric\nneutron star binaries at a distance of $40$ Mpc. This requires a pericenter\ndistance of $r_\\mathrm{p0}\\lesssim68$ km ($r_\\mathrm{p0}\\lesssim76$ km) at\nbinary formation with eccentricity close to 1 for a reasonable tidal\ndeformability and f-mode frequency of 500 and $1.73$ kHz (700 and $1.61$ kHz),\nrespectively. The observation of the phase shift will enable measuring the\nf-mode frequency of neutron stars independently from their tidal deformability,\nproviding significant insights into neutron star seismology and the properties\nof the equation of state. We also explore the potential of distinguishing\nbetween equal-radius and twin-star binaries, which could provide an opportunity\nto reveal strong first-order phase transitions in the nuclear equation of\nstate.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Phenomenology","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"TLDqrccSfoWZiuBg9ZQVAUhqyLs4szf8vE3qJqEOKo0","pdfSize":"1914452"}
