{"id":"2408.08048","title":"Semantic Capability Model for the Simulation of Manufacturing Processes","authors":"Jonathan Reif, Tom Jeleniewski, Aljosha K\\\"ocher, Tim Frerich, Felix\n  Gehlhoff, Alexander Fay","authorsParsed":[["Reif","Jonathan",""],["Jeleniewski","Tom",""],["Köcher","Aljosha",""],["Frerich","Tim",""],["Gehlhoff","Felix",""],["Fay","Alexander",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 09:28:08 GMT"}],"updateDate":"2024-08-16","timestamp":1723714088000,"abstract":"  Simulations offer opportunities in the examination of manufacturing\nprocesses. They represent various aspects of the production process and the\nassociated production systems. However, often a single simulation does not\nsuffice to provide a comprehensive understanding of specific process settings.\nInstead, a combination of different simulations is necessary when the outputs\nof one simulation serve as the input parameters for another, resulting in a\nsequence of simulations. Manual planning of simulation sequences is a demanding\ntask that requires careful evaluation of factors like time, cost, and result\nquality to choose the best simulation scenario for a given inquiry. In this\npaper, an information model is introduced, which represents simulations, their\ncapabilities to generate certain knowledge, and their respective quality\ncriteria. The information model is designed to provide the foundation for\nautomatically generating simulation sequences. The model is implemented as an\nextendable and adaptable ontology. It utilizes Ontology Design Patterns based\non established industrial standards to enhance interoperability and\nreusability. To demonstrate the practicality of this information model, an\napplication example is provided. This example serves to illustrate the model's\ncapacity in a real-world context, thereby validating its utility and potential\nfor future applications.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}