{"id":"2408.00318","title":"Holographic thermodynamics of a five-dimensional neutral Gauss-Bonnet\n  AdS black hole","authors":"Si-Jiang Yang, Md Sabir Ali, Shao-Wen Wei, and Yu-Xiao Liu","authorsParsed":[["Yang","Si-Jiang",""],["Ali","Md Sabir",""],["Wei","Shao-Wen",""],["Liu","Yu-Xiao",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 06:34:01 GMT"}],"updateDate":"2024-08-02","timestamp":1722494041000,"abstract":"  Motivated by the recent progress on the holographic dual of the extended\nthermodynamics for black holes in anti-de-Sitter (AdS) space, we investiggate\nthe hologrphic thermodynamics for the five-dimensional neutral Gauss-Bonnet AdS\nblack hole in the context of the anti-de Sitter/conformal field theory\n(AdS/CFT) correspondence. Through the extended bulk thermodynamics for the\nfive-dimensional Gauss-Bonnet AdS black hole, we derive the first law of the\nCFT thermodynamics which is obtained by directly translating the arbitrary\nconformal factors in the dual CFT. In addition to the newly defined chemical\npotential $\\mu$ conjugating to the central charge $C$, we obtain other pairs of\nthermodynamics for the CFT, such as the temperature $\\tilde{T}$ and the entropy\n$S$, the Gauss-Bonnet coupling constant $\\tilde{\\alpha}$ and its conjugate\nvariable $ \\tilde{\\mathcal{A}}$, the pressure $\\mathcal{P}$ and its conjugate\nvolume $\\mathcal{V}$. In the fixed $C$, $\\mathcal{V}$ and $\\tilde{\\alpha}$\ncanonical ensemble, we obtain the canonical description of the CFT\nthermodynamics and observe the standard swallowtail behavior in the Helmholtz\nfree energy vs the temperature plot. The self-intersection point of the\nHelmholtz free energy indicates the phase transition between the high and low\nentropy states of the CFT. By using Maxwell's equal area law, we get the\ncritical point and coexistence curve for the high and low entropy phases of the\nCFT. Besides, we get the critical exponents for the CFT, and find that the\ncritical point and critical exponents associated with the $\\tilde{T}-S$\ncriticality of the CFT are the same as those of the five-dimensional\nGauss-Bonnet AdS black hole.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}