{"id":"2408.14629","title":"Scalar Gravitational Aharonov-Bohm Effect: Generalization of the\n  Gravitational Redshift","authors":"Michael E Tobar, Michael T Hatzon, Graeme R Flower, Maxim Goryachev","authorsParsed":[["Tobar","Michael E",""],["Hatzon","Michael T",""],["Flower","Graeme R",""],["Goryachev","Maxim",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 20:51:59 GMT"}],"updateDate":"2024-09-05","timestamp":1724705519000,"abstract":"  The Aharonov-Bohm effect is a quantum mechanical phenomenon that demonstrates\nhow potentials can have observable effects even when the classical fields\nassociated with those potentials are absent. Initially proposed for\nelectromagnetic interactions, this effect has been experimentally confirmed and\nextensively studied over the years. More recently, the effect has been observed\nin the context of gravitational interactions using atom interferometry.\nAdditionally, recent predictions suggest that temporal variations in the phase\nof an electron wave function will induce modulation sidebands in the energy\nlevels of an atomic clock, solely driven by a time-varying scalar gravitational\npotential [1]. In this study, we consider the atomic clock as a two-level\nsystem undergoing continuous Rabi oscillations between the electron's ground\nand excited state. We assume the photons driving the transition are precisely\nfrequency-stabilized to match the transition, enabling accurate clock\ncomparisons. Our analysis takes into account, that when an atom transitions\nfrom its ground state to an excited state, it absorbs energy, increasing its\nmass according to the mass-energy equivalence principle. Due to the mass\ndifference between the two energy levels, we predict that an atomic clock in an\neccentric orbit will exhibit a constant frequency shift relative to a ground\nclock corresponding to the orbit's average gravitational redshift, with\nadditional modulation sidebands due to the time-varying gravitational\npotential.\n","subjects":["Physics/Quantum Physics","Physics/General Relativity and Quantum Cosmology","Physics/Atomic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"n3SNt-LvsPvUAi7gf5rcWZ8tsHd4I1B3S5Q9Alb6rVI","pdfSize":"564287"}
