{"id":"2408.12118","title":"Unitarity, Causality, and Solar System Bounds, Significantly Limit Using\n  Gravitational Waves to Test General Relativity","authors":"Alexander Cassem, Mark P. Hertzberg","authorsParsed":[["Cassem","Alexander",""],["Hertzberg","Mark P.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 04:19:46 GMT"},{"version":"v2","created":"Sat, 24 Aug 2024 02:07:27 GMT"}],"updateDate":"2024-08-27","timestamp":1724300386000,"abstract":"  The prospect of detecting/constraining deviations from general relativity by\nstudying gravitational waves (GWs) from merging black holes has been one of the\nprimary motivations of GW interferometers like LIGO/Virgo. Within pure gravity,\nthe only possible way deviations can arise is from the existence of higher\norder derivative corrections, namely higher powers of the Riemann curvature\ntensor, in the effective action. Any observational bounds imply constraints on\nthe corresponding Wilson coefficients. At the level of the action, one can\nimagine the coefficients are sufficiently large so as to be in principle\ndetectable. However, from the point of view of some fundamental principles,\nnamely causality and unitarity, this is much less clear, as we examine here. We\nbegin by reviewing certain known bounds on these coefficients, which together\nimply a low cut off on the effective theory. We then consider a possible\nmechanism to generate such terms, namely in the form of many minimally coupled\nlight scalars that can be integrated out to give these higher order operators.\nWe show that a by product of this is the generation of quantum corrections to\nNewton's potential, whose observable consequences are already ruled out by\nsolar system tests. We point out that over 7 orders of magnitude of improvement\nin interferometer sensitivity would be required to avoid such solar system\nconstraints.\n","subjects":["Physics/High Energy Physics - Theory","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}