{"id":"2408.05663","title":"Physics-informed spectral approximation of Koopman operators","authors":"Claire Valva and Dimitrios Giannakis","authorsParsed":[["Valva","Claire",""],["Giannakis","Dimitrios",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 00:43:49 GMT"}],"updateDate":"2024-08-13","timestamp":1723337029000,"abstract":"  Koopman operators and transfer operators represent nonlinear dynamics in\nstate space through its induced action on linear spaces of observables and\nmeasures, respectively. This framework enables the use of linear operator\ntheory for supervised and unsupervised learning of nonlinear dynamical systems,\nand has received considerable interest in recent years. Here, we propose a\ndata-driven technique for spectral approximation of Koopman operators of\ncontinuous-time, measure-preserving ergodic systems that is asymptotically\nconsistent and makes direct use of known equations of motion (physics). Our\napproach is based on a bounded transformation of the Koopman generator (an\noperator implementing directional derivatives of observables along the\ndynamical flow), followed by smoothing by a Markov semigroup of kernel integral\noperators. This results in a skew-adjoint, compact operator whose\neigendecomposition is expressible as a variational generalized eigenvalue\nproblem. We develop Galerkin methods to solve this eigenvalue problem and study\ntheir asymptotic consistency in the large-data limit. A key aspect of these\nmethods is that they are physics-informed, in the sense of making direct use of\ndynamical vector field information through automatic differentiation of kernel\nfunctions. Solutions of the eigenvalue problem reconstruct evolution operators\nthat preserve unitarity of the underlying Koopman group while spectrally\nconverging to it in a suitable limit. In addition, the computed eigenfunctions\nhave representatives in a reproducing kernel Hilbert space, enabling\nout-of-sample evaluation of learned dynamical features. Numerical experiments\nperformed with this method on integrable and chaotic low-dimensional systems\ndemonstrate its efficacy in extracting dynamically coherent observables under\ncomplex dynamics.\n","subjects":["Mathematics/Dynamical Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}