{"id":"2408.12817","title":"Data-Driven Parametrization of Molecular Mechanics Force Fields for\n  Expansive Chemical Space Coverage","authors":"Tianze Zheng, Ailun Wang, Xu Han, Yu Xia, Xingyuan Xu, Jiawei Zhan, Yu\n  Liu, Yang Chen, Zhi Wang, Xiaojie Wu, Sheng Gong and Wen Yan","authorsParsed":[["Zheng","Tianze",""],["Wang","Ailun",""],["Han","Xu",""],["Xia","Yu",""],["Xu","Xingyuan",""],["Zhan","Jiawei",""],["Liu","Yu",""],["Chen","Yang",""],["Wang","Zhi",""],["Wu","Xiaojie",""],["Gong","Sheng",""],["Yan","Wen",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 03:37:06 GMT"}],"updateDate":"2024-08-26","timestamp":1724384226000,"abstract":"  A force field is a critical component in molecular dynamics simulations for\ncomputational drug discovery. It must achieve high accuracy within the\nconstraints of molecular mechanics' (MM) limited functional forms, which offers\nhigh computational efficiency. With the rapid expansion of synthetically\naccessible chemical space, traditional look-up table approaches face\nsignificant challenges. In this study, we address this issue using a modern\ndata-driven approach, developing ByteFF, an Amber-compatible force field for\ndrug-like molecules. To create ByteFF, we generated an expansive and highly\ndiverse molecular dataset at the B3LYP-D3(BJ)/DZVP level of theory. This\ndataset includes 2.4 million optimized molecular fragment geometries with\nanalytical Hessian matrices, along with 3.2 million torsion profiles. We then\ntrained an edge-augmented, symmetry-preserving molecular graph neural network\n(GNN) on this dataset, employing a carefully optimized training strategy. Our\nmodel predicts all bonded and non-bonded MM force field parameters for\ndrug-like molecules simultaneously across a broad chemical space. ByteFF\ndemonstrates state-of-the-art performance on various benchmark datasets,\nexcelling in predicting relaxed geometries, torsional energy profiles, and\nconformational energies and forces. Its exceptional accuracy and expansive\nchemical space coverage make ByteFF a valuable tool for multiple stages of\ncomputational drug discovery.\n","subjects":["Computing Research Repository/Machine Learning","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}