{"id":"2408.00496","title":"SegStitch: Multidimensional Transformer for Robust and Efficient Medical\n  Imaging Segmentation","authors":"Shengbo Tan, Zeyu Zhang, Ying Cai, Daji Ergu, Lin Wu, Binbin Hu,\n  Pengzhang Yu, Yang Zhao","authorsParsed":[["Tan","Shengbo",""],["Zhang","Zeyu",""],["Cai","Ying",""],["Ergu","Daji",""],["Wu","Lin",""],["Hu","Binbin",""],["Yu","Pengzhang",""],["Zhao","Yang",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 12:05:02 GMT"}],"updateDate":"2024-08-02","timestamp":1722513902000,"abstract":"  Medical imaging segmentation plays a significant role in the automatic\nrecognition and analysis of lesions. State-of-the-art methods, particularly\nthose utilizing transformers, have been prominently adopted in 3D semantic\nsegmentation due to their superior performance in scalability and\ngeneralizability. However, plain vision transformers encounter challenges due\nto their neglect of local features and their high computational complexity. To\naddress these challenges, we introduce three key contributions: Firstly, we\nproposed SegStitch, an innovative architecture that integrates transformers\nwith denoising ODE blocks. Instead of taking whole 3D volumes as inputs, we\nadapt axial patches and customize patch-wise queries to ensure semantic\nconsistency. Additionally, we conducted extensive experiments on the BTCV and\nACDC datasets, achieving improvements up to 11.48% and 6.71% respectively in\nmDSC, compared to state-of-the-art methods. Lastly, our proposed method\ndemonstrates outstanding efficiency, reducing the number of parameters by 36.7%\nand the number of FLOPS by 10.7% compared to UNETR. This advancement holds\npromising potential for adapting our method to real-world clinical practice.\nThe code will be available at https://github.com/goblin327/SegStitch\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Rh6HgGHPJvVOmerAwzsRX7on_JVfPjlp8bM57IHnA9I","pdfSize":"14802092","txDigest":"8nC3qgEa8Nb9uLhSKLyfUyjNf8qeyar9bMN5XZrjG4Cu","endEpoch":"1","status":"CERTIFIED"}
