{"id":"2408.12052","title":"Cosmological perturbations with ultralight vector dark matter fields:\n  numerical implementation in CLASS","authors":"Tom\\'as Ferreira Chase, Mat\\'ias Leizerovich, Diana L\\'opez Nacir,\n  Susana Landau","authorsParsed":[["Chase","Tomás Ferreira",""],["Leizerovich","Matías",""],["Nacir","Diana López",""],["Landau","Susana",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 00:36:27 GMT"}],"updateDate":"2024-08-23","timestamp":1724286987000,"abstract":"  In this work we consider a dark matter candidate described by an ultralight\nvector field, whose mass is in principle in the range $H_{\\rm{eq}}\\sim\n10^{-28}\\rm{eV}\\ll m< \\rm{eV}$. The homogeneous background vector field is\nassumed to point in a given direction. We present a numerical implementation of\ncosmological perturbations in a Bianchi type I geometry with vector field dark\nmatter in a modified version of the Cosmic Linear Anisotropy Solving System\n(CLASS). We study the evolution of large-scale cosmological perturbations in\nthe linear regime. We compute the matter power spectrums defined for Fourier\nmodes pointing in a given direction. We obtain interesting features in the\npower spectrums whose observational significance depends on the field mass. We\ncompare the results with the standard $\\rm{\\Lambda CDM}$ and with the\ncorresponding well-studied ultralight scalar field dark matter case. As for the\nscalar case we obtain a suppression in the power spectrums at small scales\ncharacterized by the same scale, namely the Jeans scale. The main\ncharacteristic feature of the vector field model we notice here for first time\nis that the amplitude of the suppression effect depends on the direction of the\nFourier modes with respect to the background vector field, leaving eventually a\npossible anisotropic imprint in structure formation at small scales.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/"}