{"id":"2408.17241","title":"Leveraging Deep Generative Model For Computational Protein Design And\n  Optimization","authors":"Boqiao Lai","authorsParsed":[["Lai","Boqiao",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 12:32:40 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 19:01:39 GMT"}],"updateDate":"2024-09-17","timestamp":1725021160000,"abstract":"  Proteins are the fundamental macromolecules that play diverse and crucial\nroles in all living matter and have tremendous implications in healthcare,\nmanufacturing, and biotechnology. Their functions are largely determined by the\nsequences of amino acids that compose them and their unique three-dimensional\nstructures when folded. The recent surge in highly accurate computational\nprotein structure prediction tools has equipped scientists with the means to\nderive preliminary structural insights without the onerous costs of\nexperimental structure determination. These breakthroughs hold profound promise\nfor building robust and efficient in silico protein design systems.\n  While the prospect of designing de novo proteins with precise computational\naccuracy remains a grand challenge in biochemical engineering, conventional\nassembly-based and rational design methods often grapple with the expansive\ndesign space, resulting in suboptimal design success rates. Despite recently\nemerged deep learning-based models have shown promise in improving the\nefficiency of the computational protein design process, a significant gap\npersists between current design paradigms and their experimental realization.\nThis thesis will investigate the potential of deep generative models in\nrefining protein structure and sequence design methods, aiming to develop\nframeworks capable of crafting novel protein sequences with predetermined\nstructures or specific functionalities. By harnessing extensive protein\ndatabases and cutting-edge neural architectures, this research aims to enhance\nprecision and robustness in current protein design paradigms, potentially\npaving the way for advancements across various scientific fields.\n","subjects":["Quantitative Biology/Biomolecules"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"atZNC7ShDoS-EEGdrTmRUpARxENwxYoy6anOsFf24B0","pdfSize":"25754720"}
