{"id":"2408.14313","title":"Random eigenvalues of nanotubes","authors":"Artur Bille and Victor Buchstaber and Pavel Ievlev and Svyatoslav\n  Novikov and Evgeny Spodarev","authorsParsed":[["Bille","Artur",""],["Buchstaber","Victor",""],["Ievlev","Pavel",""],["Novikov","Svyatoslav",""],["Spodarev","Evgeny",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 14:43:22 GMT"}],"updateDate":"2024-08-27","timestamp":1724683402000,"abstract":"  The hexagonal lattice and its dual, the triangular lattice, serve as powerful\nmodels for comprehending the atomic and ring connectivity, respectively, in\n\\textit{graphene} and \\textit{carbon $(p,q)$--nanotubes}. The chemical and\nphysical attributes of these two carbon allotropes are closely linked to the\naverage number of closed paths of different lengths $k\\in\\mathbb{N}_0$ on their\nrespective graph representations. Considering that a carbon $(p,q)$--nanotube\ncan be thought of as a graphene sheet rolled up in a matter determined by the\n\\textit{chiral vector} $(p,q)$, our findings are based on the study of\n\\textit{random eigenvalues} of both the hexagonal and triangular lattices\npresented in \\cite{bille2023random}. This study reveals that for any given\n\\textit{chiral vector} $(p,q)$, the sequence of counts of closed paths forms a\nmoment sequence derived from a functional of two independent uniform\ndistributions. Explicit formulas for key characteristics of these\ndistributions, including probability density function (PDF) and moment\ngenerating function (MGF), are presented for specific choices of the chiral\nvector. Moreover, we demonstrate that as the \\textit{circumference} of a\n$(p,q)$--nanotube approaches infinity, i.e., $p+q\\rightarrow \\infty$, the\n$(p,q)$--nanotube tends to converge to the hexagonal lattice with respect to\nthe number of closed paths for any given length $k$, indicating weak\nconvergence of the underlying distributions.\n","subjects":["Mathematics/Spectral Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}