{"id":"2408.05165","title":"Higher-Order Temporal Network Prediction and Interpretation","authors":"H.A. Bart Peters, Alberto Ceria, and Huijuan Wang","authorsParsed":[["Peters","H. A. Bart",""],["Ceria","Alberto",""],["Wang","Huijuan",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 16:37:36 GMT"}],"updateDate":"2024-08-12","timestamp":1723221456000,"abstract":"  A social interaction (so-called higher-order event/interaction) can be\nregarded as the activation of the hyperlink among the corresponding\nindividuals. Social interactions can be, thus, represented as higher-order\ntemporal networks, that record the higher-order events occurring at each time\nstep over time. The prediction of higher-order interactions is usually\noverlooked in traditional temporal network prediction methods, where a\nhigher-order interaction is regarded as a set of pairwise interactions. The\nprediction of future higher-order interactions is crucial to forecast and\nmitigate the spread the information, epidemics and opinion on higher-order\nsocial contact networks. In this paper, we propose novel memory-based models\nfor higher-order temporal network prediction. By using these models, we aim to\npredict the higher-order temporal network one time step ahead, based on the\nnetwork observed in the past. Importantly, we also intent to understand what\nnetwork properties and which types of previous interactions enable the\nprediction. The design and performance analysis of these models are supported\nby our analysis of the memory property of networks, e.g., similarity of the\nnetwork and activity of a hyperlink over time respectively. Our models assume\nthat a target hyperlink's future activity (active or not) depends the past\nactivity of the target link and of all or selected types of hyperlinks that\noverlap with the target. We then compare the performance of both models with a\nbaseline utilizing a pairwise temporal network prediction method. In eight\nreal-world networks, we find that both models consistently outperform the\nbaseline and the refined model tends to perform the best. Our models also\nreveal how past interactions of the target hyperlink and different types of\nhyperlinks that overlap with the target contribute to the prediction of the\ntarget's future activity.\n","subjects":["Physics/Physics and Society","Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}