{"id":"2408.16815","title":"Deciphering the Milky Way disc formation time encrypted in the\n  chrono-kinematics of the bar","authors":"Hanyuan Zhang, Vasily Belokurov, N. Wyn Evans, Zhao-Yu Li, Jason L.\n  Sanders and Anke Ardern-Arentsen","authorsParsed":[["Zhang","Hanyuan",""],["Belokurov","Vasily",""],["Evans","N. Wyn",""],["Li","Zhao-Yu",""],["Sanders","Jason L.",""],["Ardern-Arentsen","Anke",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-09-02","timestamp":1724954400000,"abstract":"  We present a novel method to constrain the formation time of the Milky Way\ndisc using the chrono-kinematic signatures of the inner Galaxy. We construct an\nO-rich Mira variable sample from the Gaia Long-period Variable catalogue to\nstudy the kinematic behaviour of stars with different ages in the inner Galaxy.\nFrom the Auriga suite of cosmological zoom-in simulations, we find that the age\nof the oldest stellar population with imprints of the bar in density and\nkinematics matches the disc spin-up epoch. This is because stars born before\nthe spin-up show insufficient rotation and are not kinematically cold enough to\nbe efficiently trapped by the bar. We find that the bar kinematic signature\ndisappears for Mira variables with a period shorter than 190 days. Using the\nperiod-age relation of Mira variables, we constrain the spin-up epoch of the\nMilky Way to be younger than $\\sim11-12$~Gyr (redshift $\\sim3$). We also\ndiscuss and compare our method and result to other evidence of the Milky Way\nspin-up epoch under the context of a realistic age uncertainty. Age uncertainty\nleads to an overestimation of the disc formation time when performing backward\nmodelling. Our constrain of the spin-up epoch is independent from previous\nstudies because it relies on the kinematics of the inner Galaxy instead of the\nsolar vicinity.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}