{"id":"2408.15663","title":"NeuroVE: Brain-inspired Linear-Angular Velocity Estimation with Spiking\n  Neural Networks","authors":"Xiao Li, Xieyuanli Chen, Ruibin Guo, Yujie Wu, Zongtan Zhou, Fangwen\n  Yu, Huimin Lu","authorsParsed":[["Li","Xiao",""],["Chen","Xieyuanli",""],["Guo","Ruibin",""],["Wu","Yujie",""],["Zhou","Zongtan",""],["Yu","Fangwen",""],["Lu","Huimin",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 09:29:18 GMT"}],"updateDate":"2024-08-29","timestamp":1724837358000,"abstract":"  Vision-based ego-velocity estimation is a fundamental problem in robot state\nestimation. However, the constraints of frame-based cameras, including motion\nblur and insufficient frame rates in dynamic settings, readily lead to the\nfailure of conventional velocity estimation techniques. Mammals exhibit a\nremarkable ability to accurately estimate their ego-velocity during aggressive\nmovement. Hence, integrating this capability into robots shows great promise\nfor addressing these challenges. In this paper, we propose a brain-inspired\nframework for linear-angular velocity estimation, dubbed NeuroVE. The NeuroVE\nframework employs an event camera to capture the motion information and\nimplements spiking neural networks (SNNs) to simulate the brain's spatial\ncells' function for velocity estimation. We formulate the velocity estimation\nas a time-series forecasting problem. To this end, we design an Astrocyte Leaky\nIntegrate-and-Fire (ALIF) neuron model to encode continuous values.\nAdditionally, we have developed an Astrocyte Spiking Long Short-term Memory\n(ASLSTM) structure, which significantly improves the time-series forecasting\ncapabilities, enabling an accurate estimate of ego-velocity. Results from both\nsimulation and real-world experiments indicate that NeuroVE has achieved an\napproximate 60% increase in accuracy compared to other SNN-based approaches.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}