{"id":"2408.12387","title":"Makeup-Guided Facial Privacy Protection via Untrained Neural Network\n  Priors","authors":"Fahad Shamshad, Muzammal Naseer, Karthik Nandakumar","authorsParsed":[["Shamshad","Fahad",""],["Naseer","Muzammal",""],["Nandakumar","Karthik",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 17:59:39 GMT"}],"updateDate":"2024-08-23","timestamp":1724176779000,"abstract":"  Deep learning-based face recognition (FR) systems pose significant privacy\nrisks by tracking users without their consent. While adversarial attacks can\nprotect privacy, they often produce visible artifacts compromising user\nexperience. To mitigate this issue, recent facial privacy protection approaches\nadvocate embedding adversarial noise into the natural looking makeup styles.\nHowever, these methods require training on large-scale makeup datasets that are\nnot always readily available. In addition, these approaches also suffer from\ndataset bias. For instance, training on makeup data that predominantly contains\nfemale faces could compromise protection efficacy for male faces. To handle\nthese issues, we propose a test-time optimization approach that solely\noptimizes an untrained neural network to transfer makeup style from a reference\nto a source image in an adversarial manner. We introduce two key modules: a\ncorrespondence module that aligns regions between reference and source images\nin latent space, and a decoder with conditional makeup layers. The untrained\ndecoder, optimized via carefully designed structural and makeup consistency\nlosses, generates a protected image that resembles the source but incorporates\nadversarial makeup to deceive FR models. As our approach does not rely on\ntraining with makeup face datasets, it avoids potential male/female dataset\nbiases while providing effective protection. We further extend the proposed\napproach to videos by leveraging on temporal correlations. Experiments on\nbenchmark datasets demonstrate superior performance in face verification and\nidentification tasks and effectiveness against commercial FR systems. Our code\nand models will be available at\nhttps://github.com/fahadshamshad/deep-facial-privacy-prior\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"CWN8PWMT_cQn7gKNlVouvNkz91BNIMpH9lwBQR_b7pc","pdfSize":"4134117"}
