{"id":"2408.11608","title":"Don't Kill the Baby: The Case for AI in Arbitration","authors":"Michael Broyde, Yiyang Mei","authorsParsed":[["Broyde","Michael",""],["Mei","Yiyang",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 13:34:20 GMT"}],"updateDate":"2024-08-22","timestamp":1724247260000,"abstract":"  Since the introduction of Generative AI (GenAI) in 2022, its ability to\nsimulate human intelligence and generate content has sparked both enthusiasm\nand concern. While much criticism focuses on AI's potential to perpetuate bias,\ncreate emotional dissonance, displace jobs, and raise ethical questions, these\nconcerns often overlook the practical benefits of AI, particularly in legal\ncontexts.\n  This article examines the integration of AI into arbitration, arguing that\nthe Federal Arbitration Act (FAA) allows parties to contractually choose\nAI-driven arbitration, despite traditional reservations. The article makes\nthree key contributions: (1) It shifts the focus from debates over AI's\npersonhood to the practical aspects of incorporating AI into arbitration,\nasserting that AI can effectively serve as an arbitrator if both parties agree;\n(2) It positions arbitration as an ideal starting point for broader AI adoption\nin the legal field, given its flexibility and the autonomy it grants parties to\ndefine their standards of fairness; and (3) It outlines future research\ndirections, emphasizing the importance of empirically comparing AI and human\narbitration, which could lead to the development of distinct systems.\n  By advocating for the use of AI in arbitration, this article underscores the\nimportance of respecting contractual autonomy and creating an environment that\nallows AI's potential to be fully realized. Drawing on the insights of Judge\nRichard Posner, the article argues that the ethical obligations of AI in\narbitration should be understood within the context of its technological\nstrengths and the voluntary nature of arbitration agreements. Ultimately, it\ncalls for a balanced, open-minded approach to AI in arbitration, recognizing\nits potential to enhance the efficiency, fairness, and flexibility of dispute\nresolution\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}