{"id":"2408.05440","title":"Content-decoupled Contrastive Learning-based Implicit Degradation\n  Modeling for Blind Image Super-Resolution","authors":"Jiang Yuan, Ji Ma, Bo Wang, Weiming Hu","authorsParsed":[["Yuan","Jiang",""],["Ma","Ji",""],["Wang","Bo",""],["Hu","Weiming",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 04:51:43 GMT"}],"updateDate":"2024-08-13","timestamp":1723265503000,"abstract":"  Implicit degradation modeling-based blind super-resolution (SR) has attracted\nmore increasing attention in the community due to its excellent generalization\nto complex degradation scenarios and wide application range. How to extract\nmore discriminative degradation representations and fully adapt them to\nspecific image features is the key to this task. In this paper, we propose a\nnew Content-decoupled Contrastive Learning-based blind image super-resolution\n(CdCL) framework following the typical blind SR pipeline. This framework\nintroduces negative-free contrastive learning technique for the first time to\nmodel the implicit degradation representation, in which a new cyclic shift\nsampling strategy is designed to ensure decoupling between content features and\ndegradation features from the data perspective, thereby improving the purity\nand discriminability of the learned implicit degradation space. In addition, to\nimprove the efficiency and effectiveness of implicit degradation-based blind\nsuper-resolving, we design a detail-aware implicit degradation adaption module\nwith lower complexity, which adapts degradation information to the specific LR\nimage from both channel and spatial perspectives. Extensive experiments on\nsynthetic and real data prove that the proposed CdCL comprehensively improves\nthe quantitative and qualitative results of contrastive learning-based implicit\nblind SR paradigm, and achieves SOTA PSNR in this field. Even if the number of\nparameters is halved, our method still achieves very competitive results.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}