{"id":"2408.16462","title":"Consensus Planning with Primal, Dual, and Proximal Agents","authors":"Alvaro Maggiar, Lee Dicker, Michael Mahoney","authorsParsed":[["Maggiar","Alvaro",""],["Dicker","Lee",""],["Mahoney","Michael",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 11:51:04 GMT"},{"version":"v2","created":"Thu, 19 Sep 2024 13:36:40 GMT"}],"updateDate":"2024-09-20","timestamp":1724932264000,"abstract":"  Consensus planning is a method for coordinating decision making across\ncomplex systems and organizations, including complex supply chain optimization\npipelines. It arises when large interdependent distributed agents (systems)\nshare common resources and must act in order to achieve a joint goal. In prior\nconsensus planning work, all agents have been assumed to have the same\ninteraction pattern (e.g., all dual agents or all primal agents or all proximal\nagents), most commonly using the Alternating Direction Method of Multipliers\n(ADMM) as proximal agents. However, this is often not a valid assumption in\npractice, where agents consist of large complex systems, and where we might not\nhave the luxury of modifying these large complex systems at will. In this\npaper, we introduce a consensus algorithm that overcomes this hurdle by\nallowing for the coordination of agents with different types of interfaces\n(named primal, dual, and proximal). Our consensus planning algorithm allows for\nany mix of agents by combining ADMM-like updates for the proximal agents, dual\nascent updates for the dual agents, and linearized ADMM updates for the primal\nagents. We prove convergence results for the algorithm, namely a sublinear\nO(1/k) convergence rate under mild assumptions, and two-step linear convergence\nunder stronger assumptions. We also discuss enhancements to the basic method\nand provide illustrative empirical results.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Multiagent Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}