{"id":"2408.02184","title":"RoPotter: Toward Robotic Pottery and Deformable Object Manipulation with\n  Structural Priors","authors":"Uksang Yoo, Adam Hung, Jonathan Francis, Jean Oh, Jeffrey Ichnowski","authorsParsed":[["Yoo","Uksang",""],["Hung","Adam",""],["Francis","Jonathan",""],["Oh","Jean",""],["Ichnowski","Jeffrey",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 02:11:12 GMT"}],"updateDate":"2024-08-06","timestamp":1722823872000,"abstract":"  Humans are capable of continuously manipulating a wide variety of deformable\nobjects into complex shapes. This is made possible by our intuitive\nunderstanding of material properties and mechanics of the object, for reasoning\nabout object states even when visual perception is occluded. These capabilities\nallow us to perform diverse tasks ranging from cooking with dough to expressing\nourselves with pottery-making. However, developing robotic systems to robustly\nperform similar tasks remains challenging, as current methods struggle to\neffectively model volumetric deformable objects and reason about the complex\nbehavior they typically exhibit. To study the robotic systems and algorithms\ncapable of deforming volumetric objects, we introduce a novel robotics task of\ncontinuously deforming clay on a pottery wheel. We propose a pipeline for\nperception and pottery skill-learning, called RoPotter, wherein we demonstrate\nthat structural priors specific to the task of pottery-making can be exploited\nto simplify the pottery skill-learning process. Namely, we can project the\ncross-section of the clay to a plane to represent the state of the clay,\nreducing dimensionality. We also demonstrate a mesh-based method of occluded\nclay state recovery, toward robotic agents capable of continuously deforming\nclay. Our experiments show that by using the reduced representation with\nstructural priors based on the deformation behaviors of the clay, RoPotter can\nperform the long-horizon pottery task with 44.4% lower final shape error\ncompared to the state-of-the-art baselines.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/"}