{"id":"2408.03284","title":"ReSyncer: Rewiring Style-based Generator for Unified Audio-Visually\n  Synced Facial Performer","authors":"Jiazhi Guan, Zhiliang Xu, Hang Zhou, Kaisiyuan Wang, Shengyi He,\n  Zhanwang Zhang, Borong Liang, Haocheng Feng, Errui Ding, Jingtuo Liu,\n  Jingdong Wang, Youjian Zhao, Ziwei Liu","authorsParsed":[["Guan","Jiazhi",""],["Xu","Zhiliang",""],["Zhou","Hang",""],["Wang","Kaisiyuan",""],["He","Shengyi",""],["Zhang","Zhanwang",""],["Liang","Borong",""],["Feng","Haocheng",""],["Ding","Errui",""],["Liu","Jingtuo",""],["Wang","Jingdong",""],["Zhao","Youjian",""],["Liu","Ziwei",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 16:31:45 GMT"}],"updateDate":"2024-08-07","timestamp":1722961905000,"abstract":"  Lip-syncing videos with given audio is the foundation for various\napplications including the creation of virtual presenters or performers. While\nrecent studies explore high-fidelity lip-sync with different techniques, their\ntask-orientated models either require long-term videos for clip-specific\ntraining or retain visible artifacts. In this paper, we propose a unified and\neffective framework ReSyncer, that synchronizes generalized audio-visual facial\ninformation. The key design is revisiting and rewiring the Style-based\ngenerator to efficiently adopt 3D facial dynamics predicted by a principled\nstyle-injected Transformer. By simply re-configuring the information insertion\nmechanisms within the noise and style space, our framework fuses motion and\nappearance with unified training. Extensive experiments demonstrate that\nReSyncer not only produces high-fidelity lip-synced videos according to audio,\nbut also supports multiple appealing properties that are suitable for creating\nvirtual presenters and performers, including fast personalized fine-tuning,\nvideo-driven lip-syncing, the transfer of speaking styles, and even face\nswapping. Resources can be found at\nhttps://guanjz20.github.io/projects/ReSyncer.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-K8r_QlhItZzlc5KGfVogh5PLuLHYFpoxgC_yw0iksU","pdfSize":"16750158"}
