{"id":"2408.08617","title":"Virtual Reality Traffic Prioritization for Wi-Fi Quality of Service\n  Improvement using Machine Learning Classification Techniques","authors":"Seyedeh Soheila Shaabanzadeh (1), Marc Carrascosa-Zamacois (2), Juan\n  S\\'anchez-Gonz\\'alez (1), Costas Michaelides (2) and Boris Bellalta (2) ((1)\n  Universitat Polit\\`ecnica de Catalunya (UPC), Barcelona, Spain, (2)\n  Universitat Pompeu Fabra (UPF), Barcelona, Spain)","authorsParsed":[["Shaabanzadeh","Seyedeh Soheila",""],["Carrascosa-Zamacois","Marc",""],["Sánchez-González","Juan",""],["Michaelides","Costas",""],["Bellalta","Boris",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 09:17:32 GMT"}],"updateDate":"2024-08-19","timestamp":1723799852000,"abstract":"  The increase in the demand for eXtended Reality (XR)/Virtual Reality (VR)\nservices in the recent years, poses a great challenge for Wi-Fi networks to\nmaintain the strict latency requirements. In VR over Wi-Fi, latency is a\nsignificant issue. In fact, VR users expect instantaneous responses to their\ninteractions, and any noticeable delay can disrupt user experience. Such\ndisruptions can cause motion sickness, and users might end up quitting the\nservice. Differentiating interactive VR traffic from Non-VR traffic within a\nWi-Fi network can aim to decrease latency for VR users and improve Wi-Fi\nQuality of Service (QoS) with giving priority to VR users in the access point\n(AP) and efficiently handle VR traffic. In this paper, we propose a machine\nlearning-based approach for identifying interactive VR traffic in a Cloud-Edge\nVR scenario. The correlation between downlink and uplink is crucial in our\nstudy. First, we extract features from single-user traffic characteristics and\nthen, we compare six common classification techniques (i.e., Logistic\nRegression, Support Vector Machines, k-Nearest Neighbors, Decision Trees,\nRandom Forest, and Naive Bayes). For each classifier, a process of\nhyperparameter tuning and feature selection, namely permutation importance is\napplied. The model created is evaluated using datasets generated by different\nVR applications, including both single and multi-user cases. Then, a Wi-Fi\nnetwork simulator is used to analyze the VR traffic identification and\nprioritization QoS improvements. Our simulation results show that we\nsuccessfully reduce VR traffic delays by a factor of 4.2x compared to scenarios\nwithout prioritization, while incurring only a 2.3x increase in delay for\nbackground (BG) traffic related to Non-VR services.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}