{"id":"2408.06326","title":"AutOmatic floW planning for fetaL MRI (OWL)","authors":"Sara Neves Silva, Tomas Woodgate, Sarah McElroy, Michela Cleri,\n  Kamilah St Clair, Jordina Aviles Verdera, Kelly Payette, Alena Uus, Lisa\n  Story, David Lloyd, Mary A Rutherford, Joseph V Hajnal, Kuberan Pushparajah\n  and Jana Hutter","authorsParsed":[["Silva","Sara Neves",""],["Woodgate","Tomas",""],["McElroy","Sarah",""],["Cleri","Michela",""],["Clair","Kamilah St",""],["Verdera","Jordina Aviles",""],["Payette","Kelly",""],["Uus","Alena",""],["Story","Lisa",""],["Lloyd","David",""],["Rutherford","Mary A",""],["Hajnal","Joseph V",""],["Pushparajah","Kuberan",""],["Hutter","Jana",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 17:44:01 GMT"}],"updateDate":"2024-08-13","timestamp":1723484641000,"abstract":"  Two subsequent deep learning networks, one localizing the fetal chest and one\nidentifying a set of landmarks on a coronal whole-uterus balanced steady-state\nfree precession scan, were trained on 167 and 71 fetal datasets across field\nstrengths, acquisition parameters, and gestational ages and implemented in a\nreal-time setup. Next, a phase-contrast sequence was modified to use the\nidentified landmarks for planning. The OWL pipeline was evaluated\nretrospectively in 10 datasets and prospectively in 7 fetal subjects\n(gestational ages between 36+3 and 39+3 weeks). The prospective cases were\nadditionally manually planned to enable direct comparison both qualitatively,\nby scoring the planning quality, and quantitatively, by comparing the indexed\nflow measurements. OWL enabled real-time fully automatic planning of the 2D\nphase-contrast scans in all but one of the prospective participants. The fetal\nbody localization achieved an overall Dice score of 0.94+-0.05 and the cardiac\nlandmark detection accuracy was 5.77+-2.91 mm for the descending aorta,\n4.32+-2.44 mm for the spine, and 4.94+-3.82 mm for the umbilical vein. For the\nprospective cases, overall planning quality was 2.73/4 for the automated scans,\ncompared to 3.0/4 for manual planning, and the flow quantitative evaluation\nshowed a mean difference of -1.8% (range -14.2% to 14.9%) by comparing the\nindexed flow measurements obtained from gated automatic and manual\nacquisitions. Real-time automated planning of 2D phase-contrast MRI was\neffectively accomplished for 2 major vessels of the fetal vasculature. While\ndemonstrated here on 0.55T, the achieved method has wider implications, and\ntraining across multiple field strengths enables generalization. OWL thereby\npresents an important step towards extending access to this modality beyond\nspecialised centres.\n","subjects":["Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}