{"id":"2408.10335","title":"Twist-Programmable Superconductivity in Spin-Orbit Coupled Bilayer\n  Graphene","authors":"Yiran Zhang, Gal Shavit, Huiyang Ma, Youngjoon Han, Kenji Watanabe,\n  Takashi Taniguchi, David Hsieh, Cyprian Lewandowski, Felix von Oppen, Yuval\n  Oreg, and Stevan Nadj-Perge","authorsParsed":[["Zhang","Yiran",""],["Shavit","Gal",""],["Ma","Huiyang",""],["Han","Youngjoon",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Hsieh","David",""],["Lewandowski","Cyprian",""],["von Oppen","Felix",""],["Oreg","Yuval",""],["Nadj-Perge","Stevan",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:19:30 GMT"}],"updateDate":"2024-08-21","timestamp":1724091570000,"abstract":"  The relative twist angle between layers of near-lattice-matched van der Waals\nmaterials is critical for the emergent correlated phenomena associated with\nmoire flat bands. However, the concept of angle rotation control is not\nexclusive to moir\\'e superlattices in which electrons directly experience a\ntwist-angle-dependent periodic potential. Instead, it can also be employed to\ninduce programmable symmetry-breaking perturbations with the goal of\nstabilizing desired correlated states. Here, we experimentally demonstrate\n`moireless' twist-tuning of superconductivity together with other correlated\norders in Bernal bilayer graphene proximitized by tungsten diselenide. The\nalignment between the two materials systematically controls the strength of the\ninduced Ising spin-orbit coupling (SOC), profoundly altering the phase diagram.\nAs Ising SOC is increased, superconductivity onsets at a higher displacement\nfield and features a higher critical temperature, reaching up to 0.5K. Within\nthe main superconducting dome and in the strong Ising SOC limit, we find an\nunusual phase transition characterized by a nematic redistribution of holes\namong trigonally warped Fermi pockets and enhanced resilience to in-plane\nmagnetic fields. The behavior of the superconducting phase is well captured by\nour theoretical model, which emphasizes the role of interband interactions\nbetween Fermi pockets arising due to interaction-enhanced symmetry breaking.\nMoreover, we identify two additional superconducting regions, one of which\ndescends from an inter-valley coherent normal state and exhibits a Pauli-limit\nviolation ratio exceeding 40, among the highest for all known superconductors.\nOur results provide new insights into ultra-clean graphene-based\nsuperconductors and underscore the potential of utilizing moireless-twist\nengineering across a range of van der Waals heterostructures.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/"}