{"id":"2408.15123","title":"No Thick Atmosphere on the Terrestrial Exoplanet Gl 486b","authors":"Megan Weiner Mansfield, Qiao Xue, Michael Zhang, Alexandra S. Mahajan,\n  Jegug Ih, Daniel Koll, Jacob L. Bean, Brandon Park Coy, Jason D. Eastman,\n  Eliza M.-R. Kempton, Edwin S. Kite, Jonathan Lunine","authorsParsed":[["Mansfield","Megan Weiner",""],["Xue","Qiao",""],["Zhang","Michael",""],["Mahajan","Alexandra S.",""],["Ih","Jegug",""],["Koll","Daniel",""],["Bean","Jacob L.",""],["Coy","Brandon Park",""],["Eastman","Jason D.",""],["Kempton","Eliza M. -R.",""],["Kite","Edwin S.",""],["Lunine","Jonathan",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 15:04:08 GMT"}],"updateDate":"2024-08-28","timestamp":1724771048000,"abstract":"  A primary science goal for JWST is to detect and characterize the atmospheres\nof terrestrial planets orbiting M dwarfs (M-Earths). The existence of\natmospheres on M-Earths is highly uncertain because their host stars' extended\nhistory of high XUV irradiation may act to completely remove their atmospheres.\nWe present two JWST secondary eclipse observations of the M-Earth Gl 486b (also\nknown as GJ 486b) between 5-12 $\\mu$m. We combined these observations with a\nprecise analysis of the host star parameters to derive a planetary dayside\ntemperature of $T_{p}=865 \\pm 14$ K. We compared this temperature to the\nmaximum expected temperature for a zero albedo, zero heat redistribution bare\nrock and derived a temperature ratio of $R=\\frac{T_{p,dayside}}{T_{p,max}}=0.97\n\\pm 0.01$. This value is consistent with an airless body with a slight non-zero\nalbedo or a thin atmosphere with $<1$% H$_{2}$O or $<1$ ppm CO$_{2}$. However,\nit is inconsistent with an Earth- or Venus-like atmosphere, and the spectrum\nshows no clear emission or absorption features. Additionally, our observations\nare inconsistent with the water-rich atmospheric scenario allowed by previous\ntransit observations and suggest the transmission spectrum was instead shaped\nby stellar contamination (Moran et al. 2023). Given the potential for\natmospheric escape throughout the system's $\\geq6.6$-Gyr lifetime (Diamond-Lowe\net al. 2024), we conclude that the observations are likely best explained by an\nairless planet. This result is the most precise measurement yet of terrestrial\nexoplanet thermal emission with JWST, which places a strong constraint on the\nposition of the \"Cosmic Shoreline\" between airless bodies and those with\natmospheres.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}