{"id":"2408.10482","title":"Evaluation Framework for AI-driven Molecular Design of Multi-target\n  Drugs: Brain Diseases as a Case Study","authors":"Arthur Cerveira, Frederico Kremer, Darling de Andrade Louren\\c{c}o and\n  Ulisses B Corr\\^ea","authorsParsed":[["Cerveira","Arthur",""],["Kremer","Frederico",""],["Lourenço","Darling de Andrade",""],["Corrêa","Ulisses B",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 01:42:16 GMT"}],"updateDate":"2024-08-21","timestamp":1724118136000,"abstract":"  The widespread application of Artificial Intelligence (AI) techniques has\nsignificantly influenced the development of new therapeutic agents. These\ncomputational methods can be used to design and predict the properties of\ngenerated molecules. Multi-target Drug Discovery (MTDD) is an emerging paradigm\nfor discovering drugs against complex disorders that do not respond well to\nmore traditional target-specific treatments, such as central nervous system,\nimmune system, and cardiovascular diseases. Still, there is yet to be an\nestablished benchmark suite for assessing the effectiveness of AI tools for\ndesigning multi-target compounds. Standardized benchmarks allow for comparing\nexisting techniques and promote rapid research progress. Hence, this work\nproposes an evaluation framework for molecule generation techniques in MTDD\nscenarios, considering brain diseases as a case study. Our methodology involves\nusing large language models to select the appropriate molecular targets,\ngathering and preprocessing the bioassay datasets, training quantitative\nstructure-activity relationship models to predict target modulation, and\nassessing other essential drug-likeness properties for implementing the\nbenchmarks. Additionally, this work will assess the performance of four deep\ngenerative models and evolutionary algorithms over our benchmark suite. In our\nfindings, both evolutionary algorithms and generative models can achieve\ncompetitive results across the proposed benchmarks.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}