{"id":"2408.01885","title":"Channel-Aware Distributed Transmission Control and Video Streaming in\n  UAV Networks","authors":"Masoud Ghazikor, Keenan Roach, Kenny Cheung, and Morteza Hashemi","authorsParsed":[["Ghazikor","Masoud",""],["Roach","Keenan",""],["Cheung","Kenny",""],["Hashemi","Morteza",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 23:31:45 GMT"}],"updateDate":"2024-08-06","timestamp":1722727905000,"abstract":"  In this paper, we study the problem of distributed transmission control and\nvideo streaming optimization for unmanned aerial vehicles (UAVs) operating in\nunlicensed spectrum bands. We develop a rigorous cross-layer analysis framework\nthat jointly considers three inter-dependent factors: (i) in-band interference\nintroduced by ground/aerial nodes at the physical (PHY) layer, (ii)\nlimited-size queues with delay-constrained packet arrival at the medium access\ncontrol (MAC) layer, and (iii) video encoding rate at the application layer.\nFirst, we formulate an optimization problem to maximize the throughput by\noptimizing the fading threshold. To this end, we jointly analyze the\nqueue-related packet loss probabilities (i.e., buffer overflow and time\nthreshold event) as well as the outage probability due to the low\nsignal-to-interference-plus-noise ratio (SINR). We introduce the Distributed\nTransmission Control (DTC) algorithm that maximizes the throughput by adjusting\ntransmission policies to balance the trade-offs between packet drop from queues\nvs. transmission errors due to low SINRs. Second, we incorporate the video\ndistortion model to develop distributed peak signal-to-noise ratio (PSNR)\noptimization for video streaming. The formulated optimization incorporates two\ncross-layer parameters, specifically the fading threshold and video encoding\nrate. To tackle this problem, we develop the Joint Distributed Video\nTransmission and Encoder Control (JDVT-EC) algorithm that enhances the PSNR for\nall nodes by fine-tuning transmission policies and video encoding rates to\nbalance the trade-offs between packet loss and lossy video compression\ndistortions. Through extensive numerical analysis, we thoroughly examine the\nproposed algorithms and demonstrate that they are able to find the optimal\ntransmission policies and video encoding rates under various scenarios.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}