{"id":"2408.05176","title":"Modeling Transit in a Fully Integrated Agent-Based Framework:\n  Methodology and Large-Scale Application","authors":"Omer Verbas and Taner Cokyasar and Pedro Veiga de Camargo and Krishna\n  Murthy Gurumurthy and Natalia Zuniga-Garcia and Joshua Auld","authorsParsed":[["Verbas","Omer",""],["Cokyasar","Taner",""],["de Camargo","Pedro Veiga",""],["Gurumurthy","Krishna Murthy",""],["Zuniga-Garcia","Natalia",""],["Auld","Joshua",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 17:04:16 GMT"}],"updateDate":"2024-08-12","timestamp":1723223056000,"abstract":"  This study presents a transit routing, assignment, and simulation framework\nwhich is fully embedded in a multimodal, multi-agent transportation demand and\nsupply modeling platform. POLARIS, a high-performance agent-based simulation\nplatform, efficiently integrates advanced travel and freight demand modeling,\ndynamic traffic and transit assignment, and multimodal transportation\nsimulation within a unified framework. We focus on POLARIS's transit routing,\nassignment, and simulation components, detailing its structural design and\nessential terminologies. We demonstrate how the model integrates upstream\ndecision-making processes - activity generation, location and timing choices,\nand mode selection, particularly for transit-inclusive trips - followed by\nrouting, assignment decisions, and the movement of travelers and vehicles\nwithin a multimodal network. This integration enables modeling of interactions\namong all agents, including travelers, vehicles, and transportation service\nproviders. The study reviews literature on transportation system modeling\ntools, describes the transit modeling framework within POLARIS, and presents\nfindings from large-scale analyses of various policy interventions. Results\nfrom numerical experiments reveal that measures such as congestion pricing,\ntransit service improvements, first-mile-last-mile subsidies, increased\ne-commerce deliveries, and vehicle electrification significantly impact transit\nridership, with some interactions between these levers exhibiting synergistic\nor canceling effects. The case study underscores the necessity of integrating\ntransit modeling within a broader multimodal network simulation and\ndecision-making context.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}