{"id":"2408.10366","title":"Yang-Mills extension of the Loop Quantum Gravity-corrected Maxwell\n  equations","authors":"G. L. L. W. Levy, Jos\\'e A. Helay\\\"el-Neto","authorsParsed":[["Levy","G. L. L. W.",""],["Helayël-Neto","José A.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 19:16:30 GMT"},{"version":"v2","created":"Sat, 7 Sep 2024 22:09:08 GMT"}],"updateDate":"2024-09-10","timestamp":1724094990000,"abstract":"  In this paper, we endeavour to build up a non-Abelian formulation to describe\nthe self-interactions of massless vector bosons in the context of Loop Quantum\nGravity (LQG). To accomplish this task, we start off from the modified Maxwell\nequations with the inclusion of LQG corrections and its corresponding local\n$U(1)$ gauge invariance. LQG effects in the electromagnetic interactions have\nsignificant importance, as they might be adopted to describe the flight time of\ncosmic photons coming from very high-energy explosions in the Universe, such as\nevents of Gamma-Ray Bursts (GRBs). These photons have energy-dependent speeds,\nindicating that the velocity of light in the vacuum is not constant. To carry\nout the extension from the Abelian to the non-Abelian scenario, we shall follow\nthe so-called Noether current procedure, which consists in recurrently\nintroducing self-interactions into an initially free action for vector bosons\nby coupling the latter to the conserved currents of a global symmetry present\nin the action of departure. In the end of the non-Abelianization process, the\ninitial global symmetry naturally becomes local. Once the Yang-Mills system\nincludes LQG correction terms, it becomes possible to analyze how\nquantum-gravity induced contributions show up in both the electroweak and the\nQCD sectors of the Standard Model, providing a set-up for phenomenological\ninvestigations that may bring about new elements to discuss Physics beyond the\nStandard-Model.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/"}