{"id":"2408.14873","title":"Robo-GS: A Physics Consistent Spatial-Temporal Model for Robotic Arm\n  with Hybrid Representation","authors":"Haozhe Lou, Yurong Liu, Yike Pan, Yiran Geng, Jianteng Chen, Wenlong\n  Ma, Chenglong Li, Lin Wang, Hengzhen Feng, Lu Shi, Liyi Luo, Yongliang Shi","authorsParsed":[["Lou","Haozhe",""],["Liu","Yurong",""],["Pan","Yike",""],["Geng","Yiran",""],["Chen","Jianteng",""],["Ma","Wenlong",""],["Li","Chenglong",""],["Wang","Lin",""],["Feng","Hengzhen",""],["Shi","Lu",""],["Luo","Liyi",""],["Shi","Yongliang",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 08:42:44 GMT"},{"version":"v2","created":"Tue, 17 Sep 2024 15:52:18 GMT"}],"updateDate":"2024-09-18","timestamp":1724748164000,"abstract":"  Real2Sim2Real plays a critical role in robotic arm control and reinforcement\nlearning, yet bridging this gap remains a significant challenge due to the\ncomplex physical properties of robots and the objects they manipulate. Existing\nmethods lack a comprehensive solution to accurately reconstruct real-world\nobjects with spatial representations and their associated physics attributes.\n  We propose a Real2Sim pipeline with a hybrid representation model that\nintegrates mesh geometry, 3D Gaussian kernels, and physics attributes to\nenhance the digital asset representation of robotic arms.\n  This hybrid representation is implemented through a Gaussian-Mesh-Pixel\nbinding technique, which establishes an isomorphic mapping between mesh\nvertices and Gaussian models. This enables a fully differentiable rendering\npipeline that can be optimized through numerical solvers, achieves\nhigh-fidelity rendering via Gaussian Splatting, and facilitates physically\nplausible simulation of the robotic arm's interaction with its environment\nusing mesh-based methods.\n  The code,full presentation and datasets will be made publicly available at\nour website https://robostudioapp.com\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"_LS0adS7QoYkIM3pXqdtmll8q1gUw2vGO28rfJdFYcc","pdfSize":"2273148"}
