{"id":"2408.03135","title":"Dynamics of a Data-Driven Low-Dimensional Model of Turbulent Minimal\n  Pipe Flow","authors":"C. Ricardo Constante-Amores and Alec J. Linot and Michael D. Graham","authorsParsed":[["Constante-Amores","C. Ricardo",""],["Linot","Alec J.",""],["Graham","Michael D.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 12:22:43 GMT"}],"updateDate":"2024-08-07","timestamp":1722946963000,"abstract":"  The simulation of turbulent flow requires many degrees of freedom to resolve\nall the relevant times and length scales. However, due to the dissipative\nnature of the Navier-Stokes equations, the long-term dynamics are expected to\nlie on a finite-dimensional invariant manifold with fewer degrees of freedom.\nIn this study, we build low-dimensional data-driven models of pressure-driven\nflow through a circular pipe. We impose the `shift-and-reflect' symmetry to\nstudy the system in a minimal computational cell (e.g., smallest domain size\nthat sustains turbulence) at a Reynolds number of 2500. We build these models\nby using autoencoders to parametrize the manifold coordinates and neural ODEs\nto describe their time evolution. Direct numerical simulations (DNS) typically\nrequire on the order of O(105) degrees of freedom, while our data-driven\nframework enables the construction of models with fewer than 20 degrees of\nfreedom. Remarkably, these reduced order models effectively capture crucial\nfeatures of the flow, including the streak breakdown. In short-time tracking,\nthese models accurately track the true trajectory for one Lyapunov time, while\nat long-times, they successfully capture key aspects of the dynamics such as\nReynolds stresses and energy balance. Additionally, we report a library of\nexact coherent states (ECS) found in the DNS with the aid of these\nlow-dimensional models. This approach leads to the discovery of seventeen\npreviously unknown solutions within the turbulent pipe flow system, notably\nfeaturing relative periodic orbits characterized by the longest reported\nperiods for such flow conditions.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}