{"id":"2408.06960","title":"Measuring User Understanding in Dialogue-based XAI Systems","authors":"Dimitry Mindlin, Amelie Sophie Robrecht, Michael Morasch, Philipp\n  Cimiano","authorsParsed":[["Mindlin","Dimitry",""],["Robrecht","Amelie Sophie",""],["Morasch","Michael",""],["Cimiano","Philipp",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 15:17:03 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 12:11:12 GMT"}],"updateDate":"2024-08-15","timestamp":1723562223000,"abstract":"  The field of eXplainable Artificial Intelligence (XAI) is increasingly\nrecognizing the need to personalize and/or interactively adapt the explanation\nto better reflect users' explanation needs. While dialogue-based approaches to\nXAI have been proposed recently, the state-of-the-art in XAI is still\ncharacterized by what we call one-shot, non-personalized and one-way\nexplanations. In contrast, dialogue-based systems that can adapt explanations\nthrough interaction with a user promise to be superior to GUI-based or\ndashboard explanations as they offer a more intuitive way of requesting\ninformation. In general, while interactive XAI systems are often evaluated in\nterms of user satisfaction, there are limited studies that access user's\nobjective model understanding. This is in particular the case for\ndialogue-based XAI approaches. In this paper, we close this gap by carrying out\ncontrolled experiments within a dialogue framework in which we measure\nunderstanding of users in three phases by asking them to simulate the\npredictions of the model they are learning about. By this, we can quantify the\nlevel of (improved) understanding w.r.t. how the model works, comparing the\nstate prior, and after the interaction. We further analyze the data to reveal\npatterns of how the interaction between groups with high vs. low understanding\ngain differ. Overall, our work thus contributes to our understanding about the\neffectiveness of XAI approaches.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}