{"id":"2408.14358","title":"An Embedding is Worth a Thousand Noisy Labels","authors":"Francesco Di Salvo and Sebastian Doerrich and Ines Rieger and\n  Christian Ledig","authorsParsed":[["Di Salvo","Francesco",""],["Doerrich","Sebastian",""],["Rieger","Ines",""],["Ledig","Christian",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 15:32:31 GMT"}],"updateDate":"2024-08-27","timestamp":1724686351000,"abstract":"  The performance of deep neural networks scales with dataset size and label\nquality, rendering the efficient mitigation of low-quality data annotations\ncrucial for building robust and cost-effective systems. Existing strategies to\naddress label noise exhibit severe limitations due to computational complexity\nand application dependency. In this work, we propose WANN, a Weighted Adaptive\nNearest Neighbor approach that builds on self-supervised feature\nrepresentations obtained from foundation models. To guide the weighted voting\nscheme, we introduce a reliability score, which measures the likelihood of a\ndata label being correct. WANN outperforms reference methods, including a\nlinear layer trained with robust loss functions, on diverse datasets of varying\nsize and under various noise types and severities. WANN also exhibits superior\ngeneralization on imbalanced data compared to both Adaptive-NNs (ANN) and fixed\nk-NNs. Furthermore, the proposed weighting scheme enhances supervised\ndimensionality reduction under noisy labels. This yields a significant boost in\nclassification performance with 10x and 100x smaller image embeddings,\nminimizing latency and storage requirements. Our approach, emphasizing\nefficiency and explainability, emerges as a simple, robust solution to overcome\nthe inherent limitations of deep neural network training. The code is available\nat https://github.com/francescodisalvo05/wann-noisy-labels .\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yg6DXZ6TXL_ITB8_XKm65Hf6wweqQB63eusSaZiiYUQ","pdfSize":"1990184"}
