{"id":"2408.06909","title":"Multiboson Hanbury Brown-Twiss correlations for partially coherent\n  sources in relativistic heavy-ion collisions in a multiphase transport model","authors":"Shi-Yao Wang, Jun-Ting Ye, Wei-Ning Zhang","authorsParsed":[["Wang","Shi-Yao",""],["Ye","Jun-Ting",""],["Zhang","Wei-Ning",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 14:02:20 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 02:22:30 GMT"}],"updateDate":"2024-08-27","timestamp":1723557740000,"abstract":"  We use a multi-phase transport (AMPT) model to study multi-pion and\nmulti-kaon Hanbury Brown-Twiss (HBT) correlations for the partially coherent\nparticle-emitting sources in relativistic heavy-ion collisions. A\ndensity-dependent longitudinal coherent emission length and density-dependent\ntransverse coherent emission length are introduced in calculating the\nmulti-boson HBT correlation functions of the partially coherent sources. We\ncompare the model results of three- and four-pion HBT correlation functions\nwith experimental data in Pb-Pb collisions at center-of-mass energy\n$\\sqrt{s_{NN}}=$2.76 TeV, and investigate the influences of boson coherent\nemissions on the multi-pion and multi-kaon correlation functions, respectively.\nWe find that all of the three- and four-pion correlation functions of the\npartially coherent sources are consistent with experimental data. Coherent\nemission leads to the intercept decreases of the multi-boson correlation\nfunctions. The intercepts of the multi-kaon correlation functions of the\npartially coherent source are higher than those of the multi-pion correlation\nfunctions, because low kaon densities lead to smaller kaon coherent emission\nlengths than pion emission lengths. The intercepts of multi-boson correlation\nfunctions of partially coherent sources in high transverse momentum intervals\nare higher than those in low transverse momentum intervals because particle de\nBroglie wavelengths are small at high momenta.\n","subjects":["Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}