{"id":"2408.02346","title":"Exploiting Hankel-Toeplitz Structures for Fast Computation of Kernel\n  Precision Matrices","authors":"Frida Viset, Anton Kullberg, Frederiek Wesel, Arno Solin","authorsParsed":[["Viset","Frida",""],["Kullberg","Anton",""],["Wesel","Frederiek",""],["Solin","Arno",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 09:45:31 GMT"}],"updateDate":"2024-08-06","timestamp":1722851131000,"abstract":"  The Hilbert-space Gaussian Process (HGP) approach offers a\nhyperparameter-independent basis function approximation for speeding up\nGaussian Process (GP) inference by projecting the GP onto M basis functions.\nThese properties result in a favorable data-independent $\\mathcal{O}(M^3)$\ncomputational complexity during hyperparameter optimization but require a\ndominating one-time precomputation of the precision matrix costing\n$\\mathcal{O}(NM^2)$ operations. In this paper, we lower this dominating\ncomputational complexity to $\\mathcal{O}(NM)$ with no additional\napproximations. We can do this because we realize that the precision matrix can\nbe split into a sum of Hankel-Toeplitz matrices, each having $\\mathcal{O}(M)$\nunique entries. Based on this realization we propose computing only these\nunique entries at $\\mathcal{O}(NM)$ costs. Further, we develop two theorems\nthat prescribe sufficient conditions for the complexity reduction to hold\ngenerally for a wide range of other approximate GP models, such as the\nVariational Fourier Feature (VFF) approach. The two theorems do this with no\nassumptions on the data and no additional approximations of the GP models\nthemselves. Thus, our contribution provides a pure speed-up of several\nexisting, widely used, GP approximations, without further approximations.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PPK8omKLUQs1fcHuQDARmAaEMNoJIb6j3LN5YrHaFX4","pdfSize":"6129890","txDigest":"7wX5saqMYfdPbFVXBZg1a4V9meaTEXZh79p34WopDwih","endEpoch":"1","status":"CERTIFIED"}
