{"id":"2408.06974","title":"ESCAPE: Efficient Synthesis of Calibrations for Adaptive optics through\n  Pseudo-synthetic and Empirical methods","authors":"Jacob Taylor, Robin Swanson, Parker Levesque, Masen Lamb, Amali Vaz,\n  Manny Montoya, Andrew Gardner, Katie M. Morzinski, Suresh Sivanandam","authorsParsed":[["Taylor","Jacob",""],["Swanson","Robin",""],["Levesque","Parker",""],["Lamb","Masen",""],["Vaz","Amali",""],["Montoya","Manny",""],["Gardner","Andrew",""],["Morzinski","Katie M.",""],["Sivanandam","Suresh",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 15:30:46 GMT"}],"updateDate":"2024-08-14","timestamp":1723563046000,"abstract":"  With the commissioning of the refurbished adaptive secondary mirror (ASM) for\nthe 6.5-meter MMT Observatory under way, special consideration had to be made\nto properly calibrate the mirror response functions to generate an interaction\nmatrix (IM). The commissioning of the ASM is part of the MMT Adaptive optics\nexoPlanet characterization System (MAPS) upgrade the observatory's legacy\nadaptive optics (AO) system. Unlike most AO systems, MAPS employs a convex ASM\nwhich prevents the introduction of a calibration source capable of\nsimultaneously illuminating its ASM and wavefront sensor (WFS). This makes\ncalibration of the AO system a significant hurdle in commissioning. To address\nthis, we have employed a hybrid calibration strategy we call the Efficient\nSynthesis of Calibrations for Adaptive Optics through Pseudo-synthetic and\nEmpirical methods (ESCAPE). ESCAPE combines the DO-CRIME on-sky calibration\nmethod with the SPRINT method for computing pseudo-synthetic calibration\nmatrices. To monitor quasi-static system change, the ESCAPE methodology rapidly\nand continuously generates pseudo-synthetic calibration matrices using\ncontinual empirical feedback in either open or closed-loop. In addition, by\nmeasuring the current IM in the background while in close-loop, we are also\nable to measure the optical gains for pyramid wavefront sensor (PyWFS) systems.\nIn this paper, we will provide the mathematical foundation of the ESCAPE\ncalibration strategy and on-sky results from its application in calibrating the\nMMT Observatory's ASM. Additionally, we will showcase the validation of our\napproach from our AO testbed and share preliminary on-sky results from MMT.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}