{"id":"2408.01957","title":"Emergent quantum disordered phase in Na$_2$Co$_2$TeO$_6$ under\n  intermediate magnetic field along $c$ axis","authors":"Xu-Guang Zhou, Han Li, Chaebin Kim, Akira Matsuo, Kavita Mehlawat,\n  Kazuki Matsui, Zhuo Yang, Atsuhiko Miyata, Gang Su, Koichi Kindo, Je-Geun\n  Park, Yoshimitsu Kohama, Wei Li, and Yasuhiro H. Matsuda","authorsParsed":[["Zhou","Xu-Guang",""],["Li","Han",""],["Kim","Chaebin",""],["Matsuo","Akira",""],["Mehlawat","Kavita",""],["Matsui","Kazuki",""],["Yang","Zhuo",""],["Miyata","Atsuhiko",""],["Su","Gang",""],["Kindo","Koichi",""],["Park","Je-Geun",""],["Kohama","Yoshimitsu",""],["Li","Wei",""],["Matsuda","Yasuhiro H.",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 08:16:16 GMT"}],"updateDate":"2024-08-06","timestamp":1722759376000,"abstract":"  Identifying the exotic quantum spin liquid phase in Kitaev magnets has\ngarnered great research interests and remains a significant challenge. In\nexperiments, most of the proposed candidate materials exhibit an\nantiferromagnetic (AFM) order at low temperatures, thus the challenge\ntransforms into the searching for a field-driven disordered phase that is\ndistinct from the partially polarized paramagnetic phase after suppressing the\nAFM order. Recently, Na$_2$Co$_2$TeO$_6$ has been proposed as one of the prime\ncandidates, where the Kitaev interaction is realized by the high-spin\n$t^{5}_{2g}e^2_g$ configuration, and spin-orbit entangled $J_{\\rm eff} = 1/2$\nstate in a bond-edge shared honeycomb lattice. In this study, we identify an\nemergent intermediate disordered phase induced by an external field along the\n$c$-axis of the honeycomb plane. This phase is characterized through\nmagnetization and magnetocaloric effect experiments in high magnetic fields. To\nexplain the experimental results, we propose an effective spin model with large\nAFM Kitaev interaction, which yields results in good agreement with both our\nfindings and previously reported data. We determine that the effective\n$K$-$J$-$\\Gamma$-$\\Gamma'$ model for Na$_2$Co$_2$TeO$_6$ is nearly dual to that\nof $\\alpha$-RuCl$_3$ under an unitary transformation. Given the insignificant\nfragility of Na$_2$Co$_2$TeO$_6$ sample, further high-field experiments can be\nconducted to explore this intermediate-field quantum spin disordered phase.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}