{"id":"2408.14696","title":"Global analysis of the extended cosmic-ray decreases observed with\n  world-wide networks of neutron monitors and muon detectors; temporal\n  variation of the rigidity spectrum and its implication","authors":"K. Munakata, Y. Hayashi, M. Kozai, C. Kato, N. Miyashita, R. Kataoka,\n  A. Kadokura, S. Miyake, K. Iwai, E. Echer, A. Dal Lago, M. Rockenbach, N. J.\n  Schuch, J. V. Bageston, C. R. Braga, H. K. Al Jassar, M. M. Sharma, M. L.\n  Duldig, J. E. Humble, I. Sabbah, P. Evenson, T. Kuwabara and J. K\\'ota","authorsParsed":[["Munakata","K.",""],["Hayashi","Y.",""],["Kozai","M.",""],["Kato","C.",""],["Miyashita","N.",""],["Kataoka","R.",""],["Kadokura","A.",""],["Miyake","S.",""],["Iwai","K.",""],["Echer","E.",""],["Lago","A. Dal",""],["Rockenbach","M.",""],["Schuch","N. J.",""],["Bageston","J. V.",""],["Braga","C. R.",""],["Jassar","H. K. Al",""],["Sharma","M. M.",""],["Duldig","M. L.",""],["Humble","J. E.",""],["Sabbah","I.",""],["Evenson","P.",""],["Kuwabara","T.",""],["Kóta","J.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 23:49:57 GMT"}],"updateDate":"2024-08-28","timestamp":1724716197000,"abstract":"  This paper presents the global analysis of two extended decreases of the\ngalactic cosmic ray intensity observed by world-wide networks of ground-based\ndetectors in 2012. This analysis is capable of separately deriving the cosmic\nray density (or omnidirectional intensity) and anisotropy each as a function of\ntime and rigidity. A simple diffusion model along the spiral field line between\nEarth and a cosmic-ray barrier indicates the long duration of these events\nresulting from about 190$^\\circ$ eastern extension of a barrier such as an\nIP-shock followed by the sheath region and/or the corotating interaction region\n(CIR). It is suggested that the coronal mass ejection merging and compressing\nthe preexisting CIR at its flank can produce such the extended barrier. The\nderived rigidity spectra of the density and anisotropy both vary in time during\neach event period. In particular we find that the temporal feature of the\n``phantom Forbush decrease'' reported in an analyzed period is dependent on\nrigidity, looking quite different at different rigidities. From these rigidity\nspectra of the density and anisotropy, we derive the rigidity spectrum of the\naverage parallel mean-free-path of pitch angle scattering along the spiral\nfield line and infer the power spectrum of the magnetic fluctuation and its\ntemporal variation. Possible physical cause of the strong rigidity dependence\nof the ``phantom Forbush decrease'' is also discussed. These results\ndemonstrate the high-energy cosmic rays observed at Earth responding to remote\nspace weather.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rhPUcInfWA28GevqR6Wh05A5QJGw-wKGAkuZWIlNAnA","pdfSize":"8709048"}
