{"id":"2408.14489","title":"Effects of Mischmetal Composition and Cooling Rates on the\n  Microstructure and Mechanical Properties of Al-(Ce, La, Nd) Eutectic Alloys","authors":"Jie Qi, Erin C. Bryan, David C. Dunand","authorsParsed":[["Qi","Jie",""],["Bryan","Erin C.",""],["Dunand","David C.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 20:17:35 GMT"}],"updateDate":"2024-08-28","timestamp":1724271455000,"abstract":"  This study investigates the substitution of cerium (Ce) with mischmetal (MM)\nin cast Al-MM alloys, focusing on microstructure, hardness, tensile and\ncompression properties, creep resistance, and coarsening resistance. Al-MM\nalloys with various MM compositions (Ce, Ce-50La, Ce-33La, and Ce-27La-19Nd,\nweight percent) exhibit near-eutectic and hyper-eutectic microstructures for\nAl-9MM and Al-12MM compositions, respectively, with similar as-cast hardness\n(~525 MPa). All Al-9MM alloys show tensile yield stress ~55 MPa, ultimate\ntensile strength ~130 MPa, and fracture strain ~8%.The microstructural and\nmechanical properties consistency demonstrates the flexibility of MM\ncompositions in Al-MM alloys. Al-9MM exhibits excellent coarsening resistance,\nwith minimal hardness reduction when exposed to 300 and 350 C for up to 11\nweeks, and a modest ~15% hardness reduction at 400 C for 8 weeks, outperforming\neutectic Al-12.6Si and Al-6.4Ni alloys. Additionally, Al-9MM shows higher creep\nresistance at 300 C compared to most precipitate-strengthened Al-Sc-Zr and\nsolid-solution-strengthened Al-Mg/Mn alloys, but is outperformed by\neutectic-strengthened Al-6.4Ni and Al-10Ce-5Ni alloys.The effect of casting\ncooling rate is investigated through wedge casting: Al-9Ce transitions from\nhypo- to hyper-eutectic as cooling rates decrease, while Al-12Ce consistently\nshows hyper-eutectic microstructures. Al11Ce3 lamellae become finer and more\nclosely spaced with increasing cooling rates. Al-9Ce maintains steady hardness\nat high to moderate cooling rates but shows reduced hardness at lower rates,\nwhereas Al-12Ce shows no change in hardness.With a 15% reduction in energy\nconsumption and CO2 emissions, Al-Ce alloys where Ce is replaced with MM offer\ncomparable mechanical properties and enhanced environmental benefits,\nhighlighting the potential of MM as a sustainable alternative.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}