{"id":"2408.10489","title":"Interplay of Quantum Resources in Nonlocality Tests","authors":"Hai-Hao Dong, Yuwei Zhu, Su-Yi Cheng, Xingjian Zhang, Cheng-Long Li,\n  Ying-Zhao Li, Hao Li, Lixing You, Xiongfeng Ma, Qiang Zhang, and Jian-Wei Pan","authorsParsed":[["Dong","Hai-Hao",""],["Zhu","Yuwei",""],["Cheng","Su-Yi",""],["Zhang","Xingjian",""],["Li","Cheng-Long",""],["Li","Ying-Zhao",""],["Li","Hao",""],["You","Lixing",""],["Ma","Xiongfeng",""],["Zhang","Qiang",""],["Pan","Jian-Wei",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 02:03:22 GMT"}],"updateDate":"2024-08-21","timestamp":1724119402000,"abstract":"  Nonlocality, evidenced by the violation of Bell inequalities, not only\nsignifies entanglement but also highlights measurement incompatibility in\nquantum systems. Utilizing the generalized Clauser-Horne-Shimony-Holt (CHSH)\nBell inequality, our high-efficiency optical setup achieves a loophole-free\nviolation of $2.0132$. This result provides a device-independent lower bound on\nentanglement, quantified as the entanglement of formation at $0.0159$.\nMoreover, by tuning the parameters of the generalized Bell inequality, we\nenhance the estimation of measurement incompatibility, which is quantified by\nan effective overlap of $4.3883 \\times 10^{-5}$. To explore the intricate\ninterplay among nonlocality, entanglement, and measurement incompatibility, we\ngenerate mixed states, allowing for flexible modulation of entanglement via\nfast switching among the four Bell states using Pockels cells, achieving a\nfidelity above $99.10\\%$. Intriguingly, our results reveal a counterintuitive\nrelationship where increasing incompatibility initially boosts nonlocality but\neventually leads to its reduction. Typically, maximal nonlocality does not\ncoincide with maximal incompatibility. This experimental study sheds light on\nthe optimal management of quantum resources for Bell-inequality-based quantum\ninformation processing.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}