{"id":"2408.14297","title":"X-ray AGN in Bo\\\"otes: Black Hole - Galaxy assembly in massive\n  populations","authors":"Paloma Guetzoyan, James Aird, Antonis Georgakakis, Alison L. Coil,\n  Cassandra Barlow-Hall, Ryan C. Hickox, Amy L. Rankine and Bryan A. Terrazas","authorsParsed":[["Guetzoyan","Paloma",""],["Aird","James",""],["Georgakakis","Antonis",""],["Coil","Alison L.",""],["Barlow-Hall","Cassandra",""],["Hickox","Ryan C.",""],["Rankine","Amy L.",""],["Terrazas","Bryan A.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 14:28:41 GMT"}],"updateDate":"2024-08-27","timestamp":1724682521000,"abstract":"  Supermassive Black Holes (BHs) are known to efficiently grow through gas\naccretion, but even sustained and intense mass build-up through this mechanism\nstruggles to explain the assembly of the most massive BHs observed in the local\nUniverse. Using the Chandra Deep-Wide Field Survey (CDFWS) in the Bo\\\"otes\nfield, we measure BH-galaxy assembly in massive galaxies\n($M_\\star\\gtrsim10^{10}\\, \\rm M_\\odot$) through the AGN fraction and specific\nBlack Hole accretion rate (sBHAR) distribution as a function of redshift and\nstellar mass. We determine stellar masses and star formation rates for a parent\nsample of optically selected galaxies as well as those with X-ray detections\nindicating the presence of an AGN through Spectral Energy Distribution (SED)\nfitting. We derive a redshift-dependent mass completeness limit and extract\nX-ray information for every galaxy as to identify AGN in various types of\ngalaxies at low and high redshift providing a comprehensive picture of the AGN\npopulation in massive galaxies. While X-ray AGN samples are dominated by\nmoderately massive host galaxies of $M_{\\star} \\geqslant 10^{10}\\, \\rm\nM_{\\odot}$, we do not find a strong stellar mass dependence in AGN fraction (to\nlimits in sBHAR) or sBHAR distribution above this mass threshold, indicating a\nbias towards massive galaxies in the observed samples. A mild increase in AGN\nfraction is seen towards high stellar mass for low sBHAR AGN, as well as a\nsuppression of high sBHAR events in the most massive galaxies. We derive\nBH-galaxy growth tracks over time, which reveal that while most BH mass has\nbeen accumulated since $z=4$ for lower mass BHs, the assembly of the most\nmassive BHs is more complex, with little to no relative mass gain since $z=4$,\nimplying that rapid and intense growth episodes prior to $z=4$ were necessary\nto form these massive BHs.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"loP7iOBOKTZatiyiq1cGyA18mkg_9Hjj7VC0milK238","pdfSize":"5009369"}
