{"id":"2408.07120","title":"Hot-spots around Sagittarius A*: Joint fits to astrometry and\n  polarimetry","authors":"A. I. Yfantis, M. Wielgus, and M. A. Mo\\'scibrodzka","authorsParsed":[["Yfantis","A. I.",""],["Wielgus","M.",""],["Mościbrodzka","M. A.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-15","timestamp":1723572000000,"abstract":"  Observations of Sagittarius A* (Sgr A*) in near-infrared (NIR) show irregular\nflaring activity. Flares coincide with astrometric rotation of brightness\ncentroid and with looping patterns in fractional linear polarization. These\nsignatures can be explained with a model of a bright hot-spot, transiently\norbiting the black hole. We extend the capabilities of the existing algorithms\nto perform parameter estimation and model comparison in the Bayesian framework\nusing NIR observations from the GRAVITY instrument, and simultaneously fitting\nto the astrometric and polarimetric data. Using the numerical radiative\ntransfer code ipole, we defined several geometric models describing a hot-spot\norbiting Sgr A*, threaded with magnetic field, and emitting synchrotron\nradiation. We then explored the posterior space of our models in the Bayesian\nframework with a nested sampling code dynesty. We have used 11 models to\nsharpen our understanding of the importance of various aspects of the orbital\nmodel, such as non-Keplerian motion, hot-spot size, and off-equatorial orbit.\nAll considered models converge to realizations that fit the data well, but the\nequatorial super-Keplerian model is favored by the currently available NIR\ndataset. We have inferred an inclination of ~ 155 deg, which corroborates\nprevious estimates, a preferred period of ~ 70 minutes, and an orbital radius\nof ~ 12 gravitational radii with the orbital velocity of ~ 1.3 times the\nKeplerian value. A hot-spot of a diameter smaller than 5 gravitational radii is\nfavored. Black hole spin is not constrained well.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dVVEj6ShXiLGQgpByu2xPBHQ-EVWqRkmi17M7r7o3rE","pdfSize":"3145073"}
