{"id":"2408.10870","title":"Revisiting the measurements and interpretations of DLVO forces","authors":"Bo Feng, Xiantang Liu, Xinmin Liu, Yingli Li, Hang Li","authorsParsed":[["Feng","Bo",""],["Liu","Xiantang",""],["Liu","Xinmin",""],["Li","Yingli",""],["Li","Hang",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 14:00:19 GMT"}],"updateDate":"2024-08-21","timestamp":1724162419000,"abstract":"  The DLVO theory and electrical double layer (EDL) theory are the foundation\nof colloid and interface science. With the invention and development of surface\nforces apparatus (SFA) and atomic force microscope (AFM), the measurements and\ninterpretations of DLVO forces (i.e., mainly measuring the EDL force\n(electrostatic force) FEDL and van der Waals force FvdW, and interpreting the\npotential {\\psi}, charge density {\\sigma}, and Hamaker constant H) can be\ngreatly facilitated by various surface force measurement techniques, and would\nhave been very promising in advancing the DLVO theory, EDL theory, and colloid\nand interface science. However, although numerous studies have been conducted,\npervasive anomalous results can be identified throughout the literature, main\nincluding: (1) the fitted {\\psi}/{\\sigma} is normally extremely small ({\\psi}\ncan be close to or (much) smaller than {\\psi}{\\zeta} (zeta potential)) and\nvaries greatly; (2) the fitted {\\psi}/{\\sigma} can exceed the allowable range\nof calculation; and (3) the measured FvdW and the fitted H vary greatly. Based\non rigorous and comprehensive arguments, we have reasonably explained the\npervasive anomalous results in the literature and further speculated that, the\npervasive anomalous results are existing but not noticed and questioned owing\nto the two important aspects: (1) the pervasive unreasonable understandings of\nEDL theory and (2) the commonly neglected systematic errors. Consequently, we\nbelieve that the related studies have been seriously hampered. We therefore\ncall for re-examination and re-analysis of related experimental results and\ntheoretical understandings by careful consideration of the EDL theory and\nsystematic errors. On these bases, we can interpret the experimental results\nproperly and promote the development of EDL theory, colloid and interface\nscience, and many related fields.\n","subjects":["Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}