{"id":"2408.05260","title":"Fault-tolerant quantum input/output","authors":"Matthias Christandl, Omar Fawzi and Ashutosh Goswami","authorsParsed":[["Christandl","Matthias",""],["Fawzi","Omar",""],["Goswami","Ashutosh",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 12:26:38 GMT"}],"updateDate":"2024-08-13","timestamp":1723206398000,"abstract":"  Usual scenarios of fault-tolerant computation are concerned with the\nfault-tolerant realization of quantum algorithms that compute classical\nfunctions, such as Shor's algorithm for factoring. In particular, this means\nthat input and output to the quantum algorithm are classical. In contrast to\nstand-alone single-core quantum computers, in many distributed scenarios,\nquantum information might have to be passed on from one quantum information\nprocessing system to another one, possibly via noisy quantum communication\nchannels with noise levels above fault-tolerant thresholds. In such situations,\nquantum information processing devices will have quantum inputs, quantum\noutputs or even both, which pass qubits among each other. Such a scenario has\nfirst been considered in the context of point-to-point communication by\nChristandl and M{\\\"u}ller-Hermes, IEEE Trans. Inf. Th. 2024.\n  Working in the fault-tolerant framework of Kitaev we provide general tools\nfor making quantum computation with quantum input and quantum output robust\nagainst circuit noise. The framework allows the direct composition of the\nstatements, enabling versatile future application. As concrete applications, we\nshow that encoders and decoders affected by general noise (including coherent\nerrors) can be constructed for arbitrary linear distance communication codes.\nFor the weaker, but standard, model of local stochastic noise, we obtain such\nencoders and decoders for practical communication codes, which include families\nof efficient coding circuits.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}