{"id":"2408.15266","title":"People over trust AI-generated medical responses and view them to be as\n  valid as doctors, despite low accuracy","authors":"Shruthi Shekar, Pat Pataranutaporn, Chethan Sarabu, Guillermo A.\n  Cecchi, Pattie Maes","authorsParsed":[["Shekar","Shruthi",""],["Pataranutaporn","Pat",""],["Sarabu","Chethan",""],["Cecchi","Guillermo A.",""],["Maes","Pattie",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 23:41:28 GMT"}],"updateDate":"2024-08-29","timestamp":1723419688000,"abstract":"  This paper presents a comprehensive analysis of how AI-generated medical\nresponses are perceived and evaluated by non-experts. A total of 300\nparticipants gave evaluations for medical responses that were either written by\na medical doctor on an online healthcare platform, or generated by a large\nlanguage model and labeled by physicians as having high or low accuracy.\nResults showed that participants could not effectively distinguish between\nAI-generated and Doctors' responses and demonstrated a preference for\nAI-generated responses, rating High Accuracy AI-generated responses as\nsignificantly more valid, trustworthy, and complete/satisfactory. Low Accuracy\nAI-generated responses on average performed very similar to Doctors' responses,\nif not more. Participants not only found these low-accuracy AI-generated\nresponses to be valid, trustworthy, and complete/satisfactory but also\nindicated a high tendency to follow the potentially harmful medical advice and\nincorrectly seek unnecessary medical attention as a result of the response\nprovided. This problematic reaction was comparable if not more to the reaction\nthey displayed towards doctors' responses. This increased trust placed on\ninaccurate or inappropriate AI-generated medical advice can lead to\nmisdiagnosis and harmful consequences for individuals seeking help. Further,\nparticipants were more trusting of High Accuracy AI-generated responses when\ntold they were given by a doctor and experts rated AI-generated responses\nsignificantly higher when the source of the response was unknown. Both experts\nand non-experts exhibited bias, finding AI-generated responses to be more\nthorough and accurate than Doctors' responses but still valuing the involvement\nof a Doctor in the delivery of their medical advice. Ensuring AI systems are\nimplemented with medical professionals should be the future of using AI for the\ndelivery of medical advice.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}