{"id":"2408.14111","title":"Bengali Sign Language Recognition through Hand Pose Estimation using\n  Multi-Branch Spatial-Temporal Attention Model","authors":"Abu Saleh Musa Miah, Md. Al Mehedi Hasan, Md Hadiuzzaman, Muhammad\n  Nazrul Islam, Jungpil Shin","authorsParsed":[["Miah","Abu Saleh Musa",""],["Hasan","Md. Al Mehedi",""],["Hadiuzzaman","Md",""],["Islam","Muhammad Nazrul",""],["Shin","Jungpil",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 08:55:16 GMT"}],"updateDate":"2024-08-27","timestamp":1724662516000,"abstract":"  Hand gesture-based sign language recognition (SLR) is one of the most\nadvanced applications of machine learning, and computer vision uses hand\ngestures. Although, in the past few years, many researchers have widely\nexplored and studied how to address BSL problems, specific unaddressed issues\nremain, such as skeleton and transformer-based BSL recognition. In addition,\nthe lack of evaluation of the BSL model in various concealed environmental\nconditions can prove the generalized property of the existing model by facing\ndaily life signs. As a consequence, existing BSL recognition systems provide a\nlimited perspective of their generalisation ability as they are tested on\ndatasets containing few BSL alphabets that have a wide disparity in gestures\nand are easy to differentiate. To overcome these limitations, we propose a\nspatial-temporal attention-based BSL recognition model considering hand joint\nskeletons extracted from the sequence of images. The main aim of utilising hand\nskeleton-based BSL data is to ensure the privacy and low-resolution sequence of\nimages, which need minimum computational cost and low hardware configurations.\nOur model captures discriminative structural displacements and short-range\ndependency based on unified joint features projected onto high-dimensional\nfeature space. Specifically, the use of Separable TCN combined with a powerful\nmulti-head spatial-temporal attention architecture generated high-performance\naccuracy. The extensive experiments with a proposed dataset and two benchmark\nBSL datasets with a wide range of evaluations, such as intra- and inter-dataset\nevaluation settings, demonstrated that our proposed models achieve competitive\nperformance with extremely low computational complexity and run faster than\nexisting models.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VVbwGG8Sq3nmcGIyZcTED5pYaX0FG2qGOcOeZUvqyQw","pdfSize":"5688969"}
