{"id":"2408.07948","title":"$statcheck$ is flawed by design and no valid spell checker for\n  statistical results","authors":"Ingmar B\\\"oschen","authorsParsed":[["Böschen","Ingmar",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 05:52:05 GMT"}],"updateDate":"2024-08-16","timestamp":1723701125000,"abstract":"  The R package $statcheck$ is designed to extract statistical test results\nfrom text and check the consistency of the reported test statistics and\ncorresponding p-values. Recently, it has also been featured as a spell checker\nfor statistical results, aimed at improving reporting accuracy in scientific\npublications. In this study, I perform a check on $statcheck$ using a\nnon-exhaustive list of 187 simple text strings with arbitrary statistical test\nresults. These strings represent a wide range of textual representations of\nresults including correctly manageable results, non-targeted test statistics,\nvariable reporting styles, and common typos. Since $statcheck$'s detection\nheuristic is tied to a specific set of statistical test results that strictly\nadhere to the American Psychological Association (APA) reporting guidelines, it\nis unable to detect and check any reported result that even slightly deviates\nfrom this narrow style. In practice, $statcheck$ is unlikely to detect many\nstatistical test results reported in the literature. I conclude that the\ncapabilities and usefulness of the $statcheck$ software are very limited and\nthat it should not be used to detect irregularities in results nor as a spell\nchecker for statistical results. Future developments should aim to incorporate\nmore flexible algorithms capable of handling a broader variety of reporting\nstyles, such as those provided by $JATSdecoder$ and Large Language Models,\nwhich show promise in overcoming these limitations but they cannot replace the\ncritical eye of a knowledgeable reader.\n","subjects":["Statistics/Computation","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iVlO2APltKHMzjEihWuowLKzFHqIvYbgnxHvOSKwhrU","pdfSize":"235185"}
