{"id":"2408.08112","title":"On the Spectral Efficiency of Movable and Rotary Access Points under\n  Rician Fading","authors":"Eduardo Noboro Tominaga, Onel Luis Alcaraz L\\'opez, Tommy Svensson,\n  Richard Demo Souza and Hirley Alves","authorsParsed":[["Tominaga","Eduardo Noboro",""],["López","Onel Luis Alcaraz",""],["Svensson","Tommy",""],["Souza","Richard Demo",""],["Alves","Hirley",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 12:19:15 GMT"}],"updateDate":"2024-08-16","timestamp":1723724355000,"abstract":"  Multi-User Multiple-Input Multiple-Output (MU-MIMO) is a pivotal technology\nin present-day wireless communication systems. In such systems, a base station\nor Access Point (AP) is equipped with multiple antenna elements and serves\nmultiple active devices simultaneously. Nevertheless, most of the works\nevaluating the performance of MU-MIMO systems consider APs with static antenna\narrays, that is, without any movement capability. Recently, the idea of APs and\nantenna arrays that are able to move have gained traction among the research\ncommunity. Many works evaluate the communications performance of antenna\nsystems able to move on the horizontal plane. However, such APs require a very\nbulky, complex and expensive movement system. In this work, we propose a\nsimpler and cheaper alternative: the utilization of rotary APs, i.e. APs that\ncan rotate. We also analyze the performance of a system in which the AP is able\nto both move and rotate. The movements and/or rotations of the APs are computed\nin order to maximize the mean per-user achievable spectral efficiency, based on\nestimates of the locations of the active devices and using particle swarm\noptimization. We adopt a spatially correlated Rician fading channel model, and\nevaluate the resulting optimized performance of the different setups in terms\nof mean per-user achievable spectral efficiencies. Our numerical results show\nthat both the optimal rotations and movements of the APs can provide\nsubstantial performance gains when the line-of-sight components of the channel\nvectors are strong. Moreover, the simpler rotary APs can outperform the movable\nAPs when their movement area is constrained.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}