{"id":"2408.05102","title":"How Well Do LLMs Identify Cultural Unity in Diversity?","authors":"Jialin Li, Junli Wang, Junjie Hu and Ming Jiang","authorsParsed":[["Li","Jialin",""],["Wang","Junli",""],["Hu","Junjie",""],["Jiang","Ming",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 14:45:22 GMT"}],"updateDate":"2024-08-12","timestamp":1723214722000,"abstract":"  Much work on the cultural awareness of large language models (LLMs) focuses\non the models' sensitivity to geo-cultural diversity. However, in addition to\ncross-cultural differences, there also exists common ground across cultures.\nFor instance, a bridal veil in the United States plays a similar\ncultural-relevant role as a honggaitou in China. In this study, we introduce a\nbenchmark dataset CUNIT for evaluating decoder-only LLMs in understanding the\ncultural unity of concepts. Specifically, CUNIT consists of 1,425 evaluation\nexamples building upon 285 traditional cultural-specific concepts across 10\ncountries. Based on a systematic manual annotation of cultural-relevant\nfeatures per concept, we calculate the cultural association between any pair of\ncross-cultural concepts. Built upon this dataset, we design a contrastive\nmatching task to evaluate the LLMs' capability to identify highly associated\ncross-cultural concept pairs. We evaluate 3 strong LLMs, using 3 popular\nprompting strategies, under the settings of either giving all extracted concept\nfeatures or no features at all on CUNIT Interestingly, we find that cultural\nassociations across countries regarding clothing concepts largely differ from\nfood. Our analysis shows that LLMs are still limited to capturing\ncross-cultural associations between concepts compared to humans. Moreover,\ngeo-cultural proximity shows a weak influence on model performance in capturing\ncross-cultural associations.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1tUgSi4U2j7Y1uSKTrAVqYhdjx3kZxyYR-0vCdCV-l8","pdfSize":"1454181"}
