{"id":"2408.12514","title":"Interplay between the weak-coupling results and the lattice data in\n  dense QCD","authors":"Yuki Fujimoto","authorsParsed":[["Fujimoto","Yuki",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 16:12:11 GMT"},{"version":"v2","created":"Fri, 6 Sep 2024 17:33:51 GMT"}],"updateDate":"2024-09-09","timestamp":1724343131000,"abstract":"  We discuss the interplay between two first-principles calculations of QCD at\nhigh density: perturbative results in the weak-coupling regime and the recent\nlattice-QCD result at finite isospin density. By comparing these two results,\nwe verify empirically that the weak-coupling calculations of the bulk\nthermodynamics and the gap parameter for Cooper pairing between quarks can be\napplicable down to the quark chemical potential $\\mu \\sim 1$ GeV. Having\nverified the validity of the weak-coupling results in QCD at finite isospin\ndensity, we discuss possible effects on QCD at finite baryon density, which is\nrelevant for the application to realistic environments such as neutron stars,\nby using the fact that QCD at finite baryon and isospin density have the common\nweak-coupling expansions. First, we show the size of the color-superconducting\ngap at finite baryon density is as small as a few MeV at $\\mu = 1$ GeV, which\nimplies that the color-flavor locked phase may be unstable against unpairing up\nto $\\mu \\sim 1.4$ GeV even in the weak-coupling regime. We also introduce a\nprescription to reduce the ambiguity arising from the undetermined\nrenormalization scale in the weak-coupling calculation by matching with the\nlattice-QCD data. We demonstrate the effect of such reduction on neutron-star\nphenomenology by performing the Bayesian analysis.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Lattice","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qAH7FIj2UIvQWV4h9ro_YTxhZ417fjwbkWEnoyg0InM","pdfSize":"662328"}
