{"id":"2408.08603","title":"Magnetic fields in the outskirts of PSZ2 G096.88+24.18 from\n  depolarization analysis of radio relics","authors":"E. De Rubeis, C. Stuardi, A. Bonafede, F. Vazza, R. J. van Weeren, F.\n  de Gasperin, M. Br\\\"uggen","authorsParsed":[["De Rubeis","E.",""],["Stuardi","C.",""],["Bonafede","A.",""],["Vazza","F.",""],["van Weeren","R. J.",""],["de Gasperin","F.",""],["Brüggen","M.",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 08:43:11 GMT"}],"updateDate":"2024-08-19","timestamp":1723797791000,"abstract":"  In this paper, we investigate the polarization properties of the double radio\nrelics in PSZ2 G096.88+24.18 using the rotation measure synthesis, and try to\nconstrain the characteristics of the magnetic field that reproduce the observed\nbeam depolarization. Our aim is to understand the nature of the low\npolarization fraction that characterizes the southern relic with respect to the\nnorthern relic. Using new 1-2 GHz VLA observations, we derive the rotation\nmeasure and polarization of the two relics by applying the RM synthesis\ntechnique, thus solving for bandwidth depolarization in the wide observing\nbandwidth. To study the effect of beam depolarization, we degraded the image\nresolution and studied the decreasing trend of polarization fraction with\nincreasing beam size. Finally, we performed 3D magnetic field simulations using\nmultiple models for the magnetic field power spectrum over a wide range of\nscales, in order to constrain the characteristics of the cluster magnetic field\nthat can reproduce the observed beam depolarization trend. Using RM synthesis,\nwe obtained a polarization fraction of ($18.6 \\pm 0.3$)% for the norther relic\nand ($14.6 \\pm 0.1$)% for the southern one. Having corrected for bandwidth\ndepolarization, we infer that the nature of the depolarization for the southern\nrelic is external, and possibly related to the turbulent gas distribution\nwithin the cluster, or to the complex spatial structure of the relic. The\nbest-fit magnetic field power spectrum, that reproduces the observed\ndepolarization trend for the southern relic, is obtained for a turbulent\nmagnetic field model, described by a power spectrum derived from cosmological\nsimulations, and defined within the scales of $\\Lambda_{\\rm{min}}=35~\\rm{kpc}$\nand $\\Lambda_{\\rm{max}}=400~\\rm{kpc}$. This yields an average magnetic field of\nthe cluster within 1$~\\rm{Mpc}^3$ volume of $\\sim 2~\\rm{\\mu G}$.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}