{"id":"2408.02241","title":"Scalable Multilevel Monte Carlo Methods Exploiting Parallel\n  Redistribution on Coarse Levels","authors":"Hillary R. Fairbanks and Delyan Z. Kalchev and Chak Shing Lee and\n  Panayot S. Vassilevski","authorsParsed":[["Fairbanks","Hillary R.",""],["Kalchev","Delyan Z.",""],["Lee","Chak Shing",""],["Vassilevski","Panayot S.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 05:25:23 GMT"}],"updateDate":"2024-08-06","timestamp":1722835523000,"abstract":"  We study an element agglomeration coarsening strategy that requires data\nredistribution at coarse levels when the number of coarse elements becomes\nsmaller than the used computational units (cores). The overall procedure\ngenerates coarse elements (general unstructured unions of fine grid elements)\nwithin the framework of element-based algebraic multigrid methods (or AMGe)\nstudied previously. The AMGe generated coarse spaces have the ability to\nexhibit approximation properties of the same order as the fine-level ones since\nby construction they contain the piecewise polynomials of the same order as the\nfine level ones. These approximation properties are key for the successful use\nof AMGe in multilevel solvers for nonlinear partial differential equations as\nwell as for multilevel Monte Carlo (MLMC) simulations. The ability to coarsen\nwithout being constrained by the number of available cores, as described in the\npresent paper, allows to improve the scalability of these solvers as well as in\nthe overall MLMC method. The paper illustrates this latter fact with detailed\nscalability study of MLMC simulations applied to model Darcy equations with a\nstochastic log-normal permeability field.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"buLLumap46RAMCzgB8Y9fyn-8OlC6--LSnhXieiFtd0","pdfSize":"811965","txDigest":"UYd588vCsaoEvopzj3TFrD9NEfkYMGFZaB6xrLyAnbh","endEpoch":"1","status":"CERTIFIED"}
