{"id":"2408.10768","title":"Detection of Intracranial Hemorrhage for Trauma Patients","authors":"Antoine P. Sanner, Nils F. Grauhan, Marc A. Brockmann, Ahmed E.\n  Othman, Anirban Mukhopadhyay","authorsParsed":[["Sanner","Antoine P.",""],["Grauhan","Nils F.",""],["Brockmann","Marc A.",""],["Othman","Ahmed E.",""],["Mukhopadhyay","Anirban",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 12:03:59 GMT"}],"updateDate":"2024-08-21","timestamp":1724155439000,"abstract":"  Whole-body CT is used for multi-trauma patients in the search of any and all\ninjuries. Since an initial assessment needs to be rapid and the search for\nlesions is done for the whole body, very little time can be allocated for the\ninspection of a specific anatomy. In particular, intracranial hemorrhages are\nstill missed, especially by clinical students. In this work, we present a Deep\nLearning approach for highlighting such lesions to improve the diagnostic\naccuracy. While most works on intracranial hemorrhages perform segmentation,\ndetection only requires bounding boxes for the localization of the bleeding. In\nthis paper, we propose a novel Voxel-Complete IoU (VC-IoU) loss that encourages\nthe network to learn the 3D aspect ratios of bounding boxes and leads to more\nprecise detections. We extensively experiment on brain bleeding detection using\na publicly available dataset, and validate it on a private cohort, where we\nachieve 0.877 AR30, 0.728 AP30, and 0.653 AR30, 0.514 AP30 respectively. These\nresults constitute a relative +5% improvement in Average Recall for both\ndatasets compared to other loss functions. Finally, as there is little data\ncurrently publicly available for 3D object detection and as annotation\nresources are limited in the clinical setting, we evaluate the cost of\ndifferent annotation methods, as well as the impact of imprecise bounding boxes\nin the training data on the detection performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Lthr2eOgzwwYRH2LPxLYWjXEf_ICH1dfKFoNsqZbN5E","pdfSize":"3787900"}
