{"id":"2408.14840","title":"CL4KGE: A Curriculum Learning Method for Knowledge Graph Embedding","authors":"Yang Liu, Chuan Zhou, Peng Zhang, Yanan Cao, Yongchao Liu, Zhao Li,\n  Hongyang Chen","authorsParsed":[["Liu","Yang",""],["Zhou","Chuan",""],["Zhang","Peng",""],["Cao","Yanan",""],["Liu","Yongchao",""],["Li","Zhao",""],["Chen","Hongyang",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 07:51:26 GMT"},{"version":"v2","created":"Mon, 9 Sep 2024 06:57:22 GMT"}],"updateDate":"2024-09-10","timestamp":1724745086000,"abstract":"  Knowledge graph embedding (KGE) constitutes a foundational task, directed\ntowards learning representations for entities and relations within knowledge\ngraphs (KGs), with the objective of crafting representations comprehensive\nenough to approximate the logical and symbolic interconnections among entities.\nIn this paper, we define a metric Z-counts to measure the difficulty of\ntraining each triple ($<$head entity, relation, tail entity$>$) in KGs with\ntheoretical analysis. Based on this metric, we propose \\textbf{CL4KGE}, an\nefficient \\textbf{C}urriculum \\textbf{L}earning based training strategy for\n\\textbf{KGE}. This method includes a difficulty measurer and a training\nscheduler that aids in the training of KGE models. Our approach possesses the\nflexibility to act as a plugin within a wide range of KGE models, with the\nadded advantage of adaptability to the majority of KGs in existence. The\nproposed method has been evaluated on popular KGE models, and the results\ndemonstrate that it enhances the state-of-the-art methods. The use of Z-counts\nas a metric has enabled the identification of challenging triples in KGs, which\nhelps in devising effective training strategies.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uKKjQ4BQE7tDjmG4IgWFo_zqIatvG3IE6L6YnY-gehE","pdfSize":"675307"}
