{"id":"2408.00587","title":"Spinning waveforms in cubic effective field theories of gravity","authors":"Andreas Brandhuber, Graham R. Brown, Gang Chen, Gabriele Travaglini,\n  Pablo Vives Matasan","authorsParsed":[["Brandhuber","Andreas",""],["Brown","Graham R.",""],["Chen","Gang",""],["Travaglini","Gabriele",""],["Matasan","Pablo Vives",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 14:17:20 GMT"}],"updateDate":"2024-08-02","timestamp":1722521840000,"abstract":"  We derive analytic all-order-in-spin expressions for the leading-order\ntime-domain waveforms generated in the scattering of two Kerr black holes with\narbitrary masses and spin vectors in the presence of all independent cubic\ndeformations of Einstein-Hilbert gravity. These are the two parity-even\ninteractions $I_1$ and $G_3$, and the parity-odd ones $\\tilde{I}_1$ and\n$\\tilde{G}_3$. Our results are obtained using three independent methods: a\nparticularly efficient direct integration and tensor reduction approach;\nintegration by parts combined with the method of differential equations; and\nfinally a residue computation. For the case of the $G_3$ and $\\tilde{G}_3$\ndeformations we can express the spinning waveform in terms of the scalar\nwaveform with appropriately shifted impact parameters, which are reminiscent of\nNewman-Janis shifts. For $I_1$ and $\\tilde{I}_1$ similar shifts occur, but are\naccompanied by additional contributions that cannot be captured by simply\nshifting the scalar $I_1$ and $\\tilde{I}_1$ waveforms. We also show the absence\nof leading-order corrections to gravitational memory. Our analytic results are\nnotably compact, and we compare the effectiveness of the three methods used to\nobtain them. We also briefly comment on the magnitude of the corrections to\nobservables due to cubic deformations.\n","subjects":["Physics/High Energy Physics - Theory","Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/"}