{"id":"2408.02559","title":"Evaluating and Enhancing LLMs Agent based on Theory of Mind in Guandan:\n  A Multi-Player Cooperative Game under Imperfect Information","authors":"Yauwai Yim, Chunkit Chan, Tianyu Shi, Zheye Deng, Wei Fan, Tianshi\n  Zheng, Yangqiu Song","authorsParsed":[["Yim","Yauwai",""],["Chan","Chunkit",""],["Shi","Tianyu",""],["Deng","Zheye",""],["Fan","Wei",""],["Zheng","Tianshi",""],["Song","Yangqiu",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 15:36:46 GMT"}],"updateDate":"2024-08-06","timestamp":1722872206000,"abstract":"  Large language models (LLMs) have shown success in handling simple games with\nimperfect information and enabling multi-agent coordination, but their ability\nto facilitate practical collaboration against other agents in complex,\nimperfect information environments, especially in a non-English environment,\nstill needs to be explored. This study investigates the applicability of\nknowledge acquired by open-source and API-based LLMs to sophisticated\ntext-based games requiring agent collaboration under imperfect information,\ncomparing their performance to established baselines using other types of\nagents. We propose a Theory of Mind (ToM) planning technique that allows LLM\nagents to adapt their strategy against various adversaries using only game\nrules, current state, and historical context as input. An external tool was\nincorporated to mitigate the challenge of dynamic and extensive action spaces\nin this card game. Our results show that although a performance gap exists\nbetween current LLMs and state-of-the-art reinforcement learning (RL) models,\nLLMs demonstrate ToM capabilities in this game setting. It consistently\nimproves their performance against opposing agents, suggesting their ability to\nunderstand the actions of allies and adversaries and establish collaboration\nwith allies. To encourage further research and understanding, we have made our\ncodebase openly accessible.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}