{"id":"2408.12675","title":"Revaluation of the lower critical field in superconducting H$_3$S and\n  LaH$_{10}$ (Nature Comm. 13, 3194, 2022)","authors":"V. S. Minkov, E. F. Talantsev, V. Ksenofontov, S. L. Budko, F. F.\n  Balakirev, M. I. Eremets","authorsParsed":[["Minkov","V. S.",""],["Talantsev","E. F.",""],["Ksenofontov","V.",""],["Budko","S. L.",""],["Balakirev","F. F.",""],["Eremets","M. I.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 19:55:56 GMT"}],"updateDate":"2024-08-26","timestamp":1722542156000,"abstract":"  In our paper [1], we studied the magnetic response of H$_3$S and LaH$_{10}$\nsuperconductors to an applied magnetic field using Superconducting Quantum\nInterference Device (SQUID) magnetometry. Hirsch, in his comment [2],\nhighlighted an inconsistency in the data averaging procedure while questioning\nwhether high-Tc hydrides are superconductors at all. We accept the criticism\nregarding our method of extracting the penetration field HP from the original\ndata. Our SQUID magnet becomes noisy at high magnetic fields, which\nnecessitated the smoothing of a small portion of the data. To eliminate any\ndata processing issues, we have performed an alternative data analysis that\ndoes not require data smoothing to estimate the penetration field Hp values.\nThe formulation of the analysis is identical to the one widely used for\ndetermining critical currents in superconductors3. Recently, it has been shown\nto work effectively for extracting Hp and the lower critical field Hc1 from DC\nmagnetization data4. The Hp values of the present analysis are consistent with\nthose published in our original work1. We wish to emphasize very clearly that\nthe criticism pertains to the secondary issue of determining Ginzburg-Landau\nparameters for these hydride superconductors and does not undermine the\nvalidity of the existence of hydride superconductivity. Indeed, as part of our\npaper1, we also published m(H) curves demonstrating the virgin curve (about\nwhich the analysis issues were raised) followed by magnetic hysteretic loops\nthat have the classic form of the hysteresis curves of superconductors. Above\nTc, in both H$_3$S and LaH$_{10}$, the hysteresis is absent. We make all the\ndata available so that readers can judge for themselves.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}