{"id":"2408.05070","title":"Modeling and Analysis of Downlink Communications in a Heterogeneous LEO\n  Satellite Network","authors":"Chang-Sik Choi","authorsParsed":[["Choi","Chang-Sik",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 13:51:20 GMT"}],"updateDate":"2024-08-12","timestamp":1723211480000,"abstract":"  Low Earth Orbit (LEO) satellite networks connect millions of devices on Earth\nand offer various services, such as data communications, remote sensing, and\ndata harvesting. As the number of services increases, LEO satellite networks\nwill continue to grow, and many LEO satellite network operators will share the\nsame spectrum resources. We aim to examine the coexistence of such a future\nheterogeneous LEO satellite network by proposing a tractable spatial model and\nanalyzing the basic performance of downlink communications. We model a\nheterogeneous LEO satellite network as Cox point processes, ensuring satellites\nare located on various orbits. Then, we analyze two different access\ntechnologies for such a heterogeneous satellite network: closed access and open\naccess. For both cases, we derive the coverage probability and prove that the\ncoverage probability of the open access scenario outperforms that of the closed\naccess, and this coverage enhancement applies to all users. By providing\nessential network performance statistics as key distributional parameters and\nby presenting the fact that the Cox point process approximates a forthcoming\nfuture constellation with slight variation, the developed framework and\nanalysis will serve as a tractable instrument to design, evaluate, and optimize\nheterogeneous LEO satellite networks with numerous constellations.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"rTsgAi-tsDx4Zlu6b2Q7jt6zZdMFmFcjN-GQcmpEnOM","pdfSize":"3185673"}
