{"id":"2408.06153","title":"Status Report on the Chicago-Carnegie Hubble Program (CCHP): Three\n  Independent Astrophysical Determinations of the Hubble Constant Using the\n  James Webb Space Telescope","authors":"Wendy L. Freedman, Barry F. Madore, In Sung Jang, Taylor J. Hoyt,\n  Abigail J. Lee, and Kayla A. Owens","authorsParsed":[["Freedman","Wendy L.",""],["Madore","Barry F.",""],["Jang","In Sung",""],["Hoyt","Taylor J.",""],["Lee","Abigail J.",""],["Owens","Kayla A.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 13:48:33 GMT"}],"updateDate":"2024-08-13","timestamp":1723470513000,"abstract":"  We present the latest results from the Chicago Carnegie Hubble Program (CCHP)\nto measure the Hubble constant using data from the James Webb Space Telescope\n(JWST). This program is based upon three independent methods: (1) Tip of the\nRed Giant Branch (TRGB) stars, (2) JAGB (J-Region Asymptotic Giant Branch)\nstars, and (3) Cepheids. Our program includes 10 nearby galaxies, each hosting\nType Ia supernovae, suitable for measuring the Hubble constant (Ho). It also\nincludes NGC 4258, which has a geometric distance, setting the zero point for\nall three methods. The JWST observations have significantly higher\nsignal-to-noise and finer angular resolution than previous observations with\nthe Hubble Space Telescope (HST). We find three independent values of Ho =\n69.85 +/- 1.75 (stat) +/- 1.54 (sys) for the TRGB, Ho = 67.96 +/- 1.85 (stat)\n+/- 1.90 (sys) for the JAGB, and Ho = 72.05 +/- 1.86 (stat) +/- 3.10 (sys)\nkm/s/Mpc for Cepheids. Tying into supernovae, and combining these methods\nadopting a flat prior, yields our current estimate of Ho = 69.96 +/- 1.05\n(stat) +/- 1.12 (sys) km/s/Mpc. The distances measured using the TRGB and the\nJAGB method agree at the 1% level, but differ from the Cepheid distances at the\n2.5-4% level. The value of Ho based on these two methods with JWST data alone\nis Ho = 69.03 +/- 1.75 (total error) km/sec/Mpc. These numbers are consistent\nwith the current standard Lambda CDM model, without the need for the inclusion\nof additional new physics. Future JWST data will be required to increase the\nprecision and accuracy of the local distance scale.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}