{"id":"2408.16791","title":"Multi-faceted Neuroimaging Data Integration via Analysis of Subspaces","authors":"Andrew Ackerman, Zhengwu Zhang, Jan Hannig, Jack Prothero, J.S. Marron","authorsParsed":[["Ackerman","Andrew",""],["Zhang","Zhengwu",""],["Hannig","Jan",""],["Prothero","Jack",""],["Marron","J. S.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 13:26:11 GMT"}],"updateDate":"2024-09-02","timestamp":1724851571000,"abstract":"  Neuroimaging studies, such as the Human Connectome Project (HCP), often\ncollect multi-faceted and multi-block data to study the complex human brain.\nHowever, these data are often analyzed in a pairwise fashion, which can hinder\nour understanding of how different brain-related measures interact with each\nother. In this study, we comprehensively analyze the multi-block HCP data using\nthe Data Integration via Analysis of Subspaces (DIVAS) method. We integrate\nstructural and functional brain connectivity, substance use, cognition, and\ngenetics in an exhaustive five-block analysis. This gives rise to the important\nfinding that genetics is the single data modality most predictive of brain\nconnectivity, outside of brain connectivity itself. Nearly 14\\% of the\nvariation in functional connectivity (FC) and roughly 12\\% of the variation in\nstructural connectivity (SC) is attributed to shared spaces with genetics.\nMoreover, investigations of shared space loadings provide interpretable\nassociations between particular brain regions and drivers of variability, such\nas alcohol consumption in the substance-use data block. Novel Jackstraw\nhypothesis tests are developed for the DIVAS framework to establish\nstatistically significant loadings. For example, in the (FC, SC, and Substance\nUse) shared space, these novel hypothesis tests highlight largely negative\nfunctional and structural connections suggesting the brain's role in\nphysiological responses to increased substance use. Furthermore, our findings\nhave been validated using a subset of genetically relevant siblings or twins\nnot studied in the main analysis.\n","subjects":["Quantitative Biology/Neurons and Cognition","Statistics/Applications","Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}