{"id":"2408.13497","title":"Quantitative Evaluation of Full-Scale Ship Maneuvering Characteristics\n  During Berthing and Unberthing","authors":"Agnes N. Mwange and Yoshiki Miyauchi and Taichi Kambara and Hiroaki\n  Koike and Kazuyoshi Hosogaya and Atsuo Maki","authorsParsed":[["Mwange","Agnes N.",""],["Miyauchi","Yoshiki",""],["Kambara","Taichi",""],["Koike","Hiroaki",""],["Hosogaya","Kazuyoshi",""],["Maki","Atsuo",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 06:48:54 GMT"}],"updateDate":"2024-08-27","timestamp":1724482134000,"abstract":"  Leveraging empirical data is crucial in the development of accurate and\nreliable virtual models for the advancement of autonomous ship technologies and\nthe optimization of port operations. This study presents an in-depth analysis\nof ship berthing and unberthing maneuvering characteristics by utilizing a\ncomprehensive dataset encompassing the operation of a full-scale ship in\ndiverse infrastructural and environmental conditions. Various statistical\ntechniques and time-series analysis were employed to process and interpret the\noperational data. A systematic analysis was conducted on key performance\nvariables, including approach speed, drift angles, turning motions, distance\nfrom obstacles, and actuator utilization. The results demonstrate significant\ndiscrepancies between the empirical data and the established maneuvering\ncharacteristics. These findings have the potential to significantly enhance the\naccuracy and reliability of conventional maneuvering models, such as the\nMathematical Modeling Group (MMG) model, and improve the conditions used in\ncaptive model tests for the identification of maneuvering model parameters.\nFurthermore, these findings could inform the development of more robust\nautonomous berthing and unberthing algorithms and digital twins.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}