{"id":"2408.08613","title":"Acceleration and twisting of neutral atoms by strong elliptically\n  polarized short-wavelength laser pulses","authors":"Vladimir S.Melezhik and Sara Shadmehri","authorsParsed":[["Melezhik","Vladimir S.",""],["Shadmehri","Sara",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 09:11:34 GMT"}],"updateDate":"2024-08-19","timestamp":1723799494000,"abstract":"  We have investigated non-dipole effects in the interaction of a hydrogen atom\nwith elliptically polarized laser pulses of intensity 10$^{14}$ W/cm$^2$ with\nabout 8 fs duration. The study was performed within the framework of a hybrid\nquantum-quasiclassical approach in which the time-dependent Schr\\\"odinger\nequation for an electron and the classical Hamilton equations for the\ncenter-of-mass (CM) of an atom are simultaneously integrated. It is shown that\nthe spatial inhomogeneity $ \\mathbf{k}\\cdot\\mathbf{r}$ of the laser field and\nthe presence of a magnetic component in it lead to the non-separability of the\nCM and electron variables in a neutral atom and, as a consequence, to its\nacceleration. We have established a strict correlation between the total\nprobability of excitation and ionization of an atom and the velocity of its CM\nacquired as a result of interaction with a laser pulse. The acceleration of the\natom weakly depends on the polarization of the laser in the considered region\n(\\mbox{5 eV $\\lesssim \\hbar\\omega \\lesssim $ 27 eV}) of its frequencies.\nHowever, the transition from linear to elliptical laser polarization leads to\nthe twisting of the atom relative to the axis directed along the pulse\npropagation (coinciding with the direction of the momentum of the accelerated\natom). It is shown that with increasing ellipticity the twisting effect\nincreases and reaches its maximum value with circular polarization. At this\npoint the projection of the orbital angular momentum acquired by the electron\nonto the direction of the pulse propagation reaches its maximum value. Further\nexploration of the possibilities for producing accelerated and twisted atoms\nwith electromagnetic pulses is of interest for a number of prospective\napplications.\n","subjects":["Physics/Atomic Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}