{"id":"2408.07900","title":"Network analysis reveals news press landscape and asymmetric user\n  polarization","authors":"Byunghwee Lee, Hyo-sun Ryu, Jae Kook Lee, Hawoong Jeong, Beom Jun Kim","authorsParsed":[["Lee","Byunghwee",""],["Ryu","Hyo-sun",""],["Lee","Jae Kook",""],["Jeong","Hawoong",""],["Kim","Beom Jun",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 03:10:56 GMT"}],"updateDate":"2024-08-16","timestamp":1723691456000,"abstract":"  Unlike traditional media, online news platforms allow users to consume\ncontent that suits their tastes and to facilitate interactions with other\npeople. However, as more personalized consumption of information and\ninteraction with like-minded users increase, ideological bias can inadvertently\nincrease and contribute to the formation of echo chambers, reinforcing the\npolarization of opinions. Although the structural characteristics of\npolarization among different ideological groups in online spaces have been\nextensively studied, research into how these groups emotionally interact with\neach other has not been as thoroughly explored. From this perspective, we\ninvestigate both structural and affective polarization between news media user\ngroups on Naver News, South Korea's largest online news portal, during the\nperiod of 2022 Korean presidential election. By utilizing the dataset\ncomprising 333,014 articles and over 36 million user comments, we uncover two\ndistinct groups of users characterized by opposing political leanings and\nreveal significant bias and polarization among them. Additionally, we reveal\nthe existence of echo chambers within co-commenting networks and investigate\nthe asymmetric affective interaction patterns between the two polarized groups.\nClassification task of news media articles based on the distinct comment\nresponse patterns support the notion that different political groups may employ\ndistinct communication strategies. Our approach based on network analysis on\nlarge-scale comment dataset offers novel insights into characteristics of user\npolarization in the online news platforms and the nuanced interaction nature\nbetween user groups.\n","subjects":["Computing Research Repository/Social and Information Networks","Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}