{"id":"2408.13105","title":"The solar beryllium abundance revisited with 3D non-LTE models","authors":"A. M. Amarsi, D. Ogneva, G. Buldgen, N. Grevesse, Y. Zhou, P. S.\n  Barklem","authorsParsed":[["Amarsi","A. M.",""],["Ogneva","D.",""],["Buldgen","G.",""],["Grevesse","N.",""],["Zhou","Y.",""],["Barklem","P. S.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 14:28:40 GMT"},{"version":"v2","created":"Fri, 6 Sep 2024 12:21:16 GMT"}],"updateDate":"2024-09-09","timestamp":1724423320000,"abstract":"  The present-day abundance of beryllium in the solar atmosphere provides clues\nabout mixing mechanisms within stellar interiors. However, abundance\ndeterminations based on the Be II 313.107 nm line are prone to systematic\nerrors due to imperfect model spectra. These errors arise from missing\ncontinuous opacity in the UV, a significant unidentified blend at 313.102 nm,\ndepartures from local thermodynamic equilibrium (LTE), and microturbulence and\nmacroturbulence fudge parameters associated with one-dimensional (1D)\nhydrostatic model atmospheres. Although these factors have been discussed in\nthe literature, no study has yet accounted for all of them simultaneously. To\naddress this, we present 3D non-LTE calculations for neutral and ionised\nberyllium in the Sun. We used these models to derive the present-day solar\nberyllium abundance, calibrating the missing opacity on high resolution solar\nirradiance data and the unidentified blend on the centre-to-limb variation. We\nfind a surface abundance of 1.21 $\\pm$ 0.05 dex, which is significantly lower\nthan the value of 1.38 dex that has been commonly adopted since 2004. Taking\nthe initial abundance via CI chondrites, our result implies that beryllium has\nbeen depleted from the surface by an extra 0.11 $\\pm$ 0.06 dex, or 22 $\\pm$\n11%, on top of any effects of atomic diffusion. This is in tension with\nstandard solar models, which predict negligible depletion, as well as with\ncontemporary solar models that have extra mixing calibrated on the abundances\nof helium and lithium, which predict excessive depletion. These discrepancies\nhighlight the need for further improvements to the physics in solar and stellar\nmodels.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}