{"id":"2408.14612","title":"Detection of Radio Emission from Super-flaring Solar-Type Stars in the\n  VLA Sky Survey","authors":"Ivey Davis, Gregg Hallinan, Carlos Ayala, Dillon Dong, Steven Myers","authorsParsed":[["Davis","Ivey",""],["Hallinan","Gregg",""],["Ayala","Carlos",""],["Dong","Dillon",""],["Myers","Steven",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 20:17:38 GMT"}],"updateDate":"2024-08-28","timestamp":1724703458000,"abstract":"  Solar-type stars have been observed to flare at optical wavelengths to\nenergies much higher than observed for the Sun. To date, no counterparts have\nbeen observed at longer wavelengths. We have searched the the VLA Sky Survey\n(VLASS) for radio emission associated with a sample of 150 single, solar-type\nstars previously been observed to exhibit superflares in the Transiting\nExoplanet Survey Satellite (TESS). Counterparts to six of these stars were\npresent in VLASS as transient or highly variable radio sources. One of the\nstars is detected in all three epochs, exhibiting an unprecedented level of\napparently persistent radio emission. The engine for this radio emission is\nunclear, but may be related to accretion, a binary companion, or the presence\nof large-scale magnetic field. Two stars show radio emission with >50 circular\npolarization fraction, indicating a coherent emission process likely being\npresent. We find that the six VLASS-detected stars tend to have higher flare\nrates and higher flare energies of our TESS sample. This, in addition to the\nVLASS-detected stars adhering to the Gudel-Benz relation, suggest that the\nradio emission may be directly associated with superflares. These results\nconfirm that the superflare phenomenon on solar-type stars extends to radio\nwavelengths, in this instance tracing particle acceleration. These data provide\nthe first window on the luminosity function of radio superflares for solar-type\nstars and highlights the need for coordinated, multi-wavelength monitoring of\nsuch stars to fully illustrate the stellar flare-particle relation.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ShTg2e3nWQA3O7QCYvi1Nh_LSUCaIgqzQCeTWVU6B40","pdfSize":"963522"}
