{"id":"2408.17217","title":"The FLAMINGO Project: An assessment of the systematic errors in the\n  predictions of models for galaxy cluster counts used to infer cosmological\n  parameters","authors":"Roi Kugel, Joop Schaye, Matthieu Schaller, Victor J. Forouhar Moreno,\n  Robert J. McGibbon","authorsParsed":[["Kugel","Roi",""],["Schaye","Joop",""],["Schaller","Matthieu",""],["Moreno","Victor J. Forouhar",""],["McGibbon","Robert J.",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 11:48:51 GMT"}],"updateDate":"2024-09-02","timestamp":1725018531000,"abstract":"  Galaxy cluster counts have historically been important for the measurement of\ncosmological parameters and upcoming surveys will greatly reduce the\nstatistical errors. To exploit the potential of current and future cluster\nsurveys, theoretical uncertainties on the predicted abundance must be smaller\nthan the statistical errors. Models used to predict cluster counts typically\ncombine a model for the dark matter only (DMO) halo mass function (HMF) with an\nobservable - mass relation that is assumed to be a power-law with lognormal\nscatter. We use the FLAMINGO suite of cosmological hydrodynamical simulations\nto quantify the biases in the cluster counts and cosmological parameters\nresulting from the different ingredients of conventional models. For the\nobservable mass proxy we focus on the Compton-Y parameter quantifying the\nthermal Sunyaev-Zel'dovich effect, which is expected to result in cluster\nsamples that are relatively close to mass-selected samples. We construct three\nmock surveys based on existing (Planck and SPT) and upcoming (Simons\nObservatory) surveys. We ignore measurement uncertainties and compare the\nbiases in the counts and inferred cosmological parameters to each survey's\nPoisson errors. We find that widely used models for the DMO HMF differ\nsignificantly from each other and from the DMO version of FLAMINGO, leading to\nsignificant biases for all three surveys. For upcoming surveys, dramatic\nimprovements are needed for all additional model ingredients, i.e. the\nfunctional forms of the fits to the observable-mass scaling relation and the\nassociated scatter, the priors on the scaling relation and the prior on\nbaryonic effects associated with feedback processes on the HMF.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}