{"id":"2408.07160","title":"Quantum gravity from Weyl conformal geometry","authors":"D. M. Ghilencea","authorsParsed":[["Ghilencea","D. M.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 18:56:11 GMT"}],"updateDate":"2024-08-15","timestamp":1723575371000,"abstract":"  We review recent developments in physical implications of Weyl conformal\ngeometry. The associated Weyl quadratic gravity is a gauge theory of the Weyl\ngroup of dilatations and Poincar\\'e symmetry. Weyl geometry is defined by\nequivalence classes of the metric and Weyl gauge field ($\\omega_\\mu$), related\nby Weyl gauge transformations. Weyl geometry can be seen as a covariantised\nversion of Riemannian geometry with respect to Weyl gauge symmetry (of\ndilatations). This Weyl gauge-covariant formulation of Weyl geometry is metric,\nwhich avoids long-held criticisms on the physical relevance of this geometry.\nWeyl quadratic gravity and its geometry have interesting properties: Weyl gauge\nsymmetry spontaneously broken to Einstein-Hilbert gravity (Riemannian geometry)\nrespectively, with $\\Lambda>0$; this is the only true gauge theory of a\nspace-time symmetry i.e. with a physical Weyl gauge boson and is Weyl-anomaly\nfree; all fields and masses have geometric origin, with no added scalar\ncompensators; the theory is the leading order of a Weyl gauge invariant DBI\naction of conformal geometry that gives a natural analytical continuation of\nthe former to $d$ dimensions; Weyl anomaly is recovered in the broken phase; in\nthe limit of vanishing Weyl gauge current, one obtains conformal gravity and\nRiemannian geometry; SM has a natural embedding in Weyl conformal geometry with\nno new degrees of freedom, with a successful Starobinsky-Higgs inflation.\nBriefly, Weyl conformal geometry alone generates a (quantum) gauge theory of\ngravity, leading to a unified description by the gauge principle of\nEinstein-Hilbert gravity and SM.\n","subjects":["Physics/High Energy Physics - Theory","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}