{"id":"2408.06421","title":"Neural Networks as Spin Models: From Glass to Hidden Order Through\n  Training","authors":"Richard Barney, Michael Winer, Victor Galitski","authorsParsed":[["Barney","Richard",""],["Winer","Michael",""],["Galitski","Victor",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 18:01:04 GMT"}],"updateDate":"2024-08-14","timestamp":1723485664000,"abstract":"  We explore a one-to-one correspondence between a neural network (NN) and a\nstatistical mechanical spin model where neurons are mapped to Ising spins and\nweights to spin-spin couplings. The process of training an NN produces a family\nof spin Hamiltonians parameterized by training time. We study the magnetic\nphases and the melting transition temperature as training progresses. First, we\nprove analytically that the common initial state before training--an NN with\nindependent random weights--maps to a layered version of the classical\nSherrington-Kirkpatrick spin glass exhibiting a replica symmetry breaking. The\nspin-glass-to-paramagnet transition temperature is calculated. Further, we use\nthe Thouless-Anderson-Palmer (TAP) equations--a theoretical technique to\nanalyze the landscape of energy minima of random systems--to determine the\nevolution of the magnetic phases on two types of NNs (one with continuous and\none with binarized activations) trained on the MNIST dataset. The two NN types\ngive rise to similar results, showing a quick destruction of the spin glass and\nthe appearance of a phase with a hidden order, whose melting transition\ntemperature $T_c$ grows as a power law in training time. We also discuss the\nproperties of the spectrum of the spin system's bond matrix in the context of\nrich vs. lazy learning. We suggest that this statistical mechanical view of NNs\nprovides a useful unifying perspective on the training process, which can be\nviewed as selecting and strengthening a symmetry-broken state associated with\nthe training task.\n","subjects":["Condensed Matter/Disordered Systems and Neural Networks","Computing Research Repository/Machine Learning","Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"s0p-VROXj2ggCrMRRj3w-SXGxXYB9b-y5YhlDs4OfIM","pdfSize":"1064489"}
