{"id":"2408.01074","title":"Design, development, and construction of the new beam stoppers for\n  CERN's injector complex","authors":"D. Baillard, E. Grenier-Boley, M. Dole, F. Deslande, R. Froeschl, T.\n  Lorenzon, P. Moyret, R. Peron, A. Pilan Zanoni, C. Sharp, M. Timmins and M.\n  Calviani","authorsParsed":[["Baillard","D.",""],["Grenier-Boley","E.",""],["Dole","M.",""],["Deslande","F.",""],["Froeschl","R.",""],["Lorenzon","T.",""],["Moyret","P.",""],["Peron","R.",""],["Zanoni","A. Pilan",""],["Sharp","C.",""],["Timmins","M.",""],["Calviani","M.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 07:50:23 GMT"}],"updateDate":"2024-08-05","timestamp":1722585023000,"abstract":"  Beam stoppers are installed in the transfer lines of the CERN accelerator\ncomplex; these components are used as part of the access safety system, which\nguarantees the safety of workers in the accelerators. They are designed to stop\none or at most a few pulses of the beam, where \"stop\" means the partial or\ncomplete absorption of the primary beam in such a way that the remaining\nunabsorbed primary or secondary beam remains below a specified threshold, as\ndefined by the needs of radiation protection. Prior to Long Shutdown 2 (LS2;\n2018--2021), beam stoppers in the injector complex were dimensioned for\nbeam-pulse energies between 9.0 and 30~kJ. The upgrade of the accelerator\ncomplex in the framework of the LHC Injectors Upgrade (LIU) project involves\nbeam-pulse energies of up to 92.5~kJ, meaning that these beam stoppers are not\nable to fulfill the new functional specifications. To cope with the LIU beam\nparameters and fulfil requirements for safety, maintainability, efficiency, and\nreliability, a new generation of 28 beam stoppers has been designed, built, and\ninstalled. The aim of this paper is to demonstrate the requirements-driven\ndesign of these new beam stoppers, outlining the main requirements along with a\ndescription of the design and structural assessments. This document presents\nthe implementation and integration of a standardized but adaptable design using\na unique 564-mm-long stopper core with a CuCr1Zr absorber and an Inconel~718\ndiluter, taking into account radiological and infrastructure challenges. The\ninstallation process is also described, and the first operational feedback\nreceived since LS2 is presented.\n","subjects":["Physics/High Energy Physics - Experiment","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/"}