{"id":"2408.05719","title":"MR-ULINS: A Tightly-Coupled UWB-LiDAR-Inertial Estimator with\n  Multi-Epoch Outlier Rejection","authors":"Tisheng Zhang, Man Yuan, Linfu Wei, Yan Wang, Hailiang Tang, Xiaoji\n  Niu","authorsParsed":[["Zhang","Tisheng",""],["Yuan","Man",""],["Wei","Linfu",""],["Wang","Yan",""],["Tang","Hailiang",""],["Niu","Xiaoji",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 08:14:50 GMT"}],"updateDate":"2024-08-13","timestamp":1723364090000,"abstract":"  The LiDAR-inertial odometry (LIO) and the ultra-wideband (UWB) have been\nintegrated together to achieve driftless positioning in global navigation\nsatellite system (GNSS)-denied environments. However, the UWB may be affected\nby systematic range errors (such as the clock drift and the antenna phase\ncenter offset) and non-line-of-sight (NLOS) signals, resulting in reduced\nrobustness. In this study, we propose a UWB-LiDAR-inertial estimator (MR-ULINS)\nthat tightly integrates the UWB range, LiDAR frame-to-frame, and IMU\nmeasurements within the multi-state constraint Kalman filter (MSCKF) framework.\nThe systematic range errors are precisely modeled to be estimated and\ncompensated online. Besides, we propose a multi-epoch outlier rejection\nalgorithm for UWB NLOS by utilizing the relative accuracy of the LIO.\nSpecifically, the relative trajectory of the LIO is employed to verify the\nconsistency of all range measurements within the sliding window. Extensive\nexperiment results demonstrate that MR-ULINS achieves a positioning accuracy of\naround 0.1 m in complex indoor environments with severe NLOS interference.\nAblation experiments show that the online estimation and multi-epoch outlier\nrejection can effectively improve the positioning accuracy. Besides, MR-ULINS\nmaintains high accuracy and robustness in LiDAR-degenerated scenes and\nUWB-challenging conditions with spare base stations.\n","subjects":["Computing Research Repository/Robotics","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}