{"id":"2408.12015","title":"Determining van der Waals materials' optical and polaritonic properties\n  using cryogenic FTIR micro-spectroscopy","authors":"Siddharth Nandanwar, Aditya Desai, S. Maryam Vaghefi Esfidani, Tristan\n  McMillan, Eli Janzen, James H. Edgar, and Thomas G. Folland","authorsParsed":[["Nandanwar","Siddharth",""],["Desai","Aditya",""],["Esfidani","S. Maryam Vaghefi",""],["McMillan","Tristan",""],["Janzen","Eli",""],["Edgar","James H.",""],["Folland","Thomas G.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 21:57:12 GMT"}],"updateDate":"2024-08-23","timestamp":1724277432000,"abstract":"  Van-der-Waals materials have been shown to support numerous exotic\npolaritonic phenomena originating from their layered structures and associated\nvibrational and electronic properties. This includes emergent polaritonic\nphenomena, including hyperbolicity and exciton-polariton formation. However,\nmany van-der-Waals materials' unique properties are most prominent at cryogenic\ntemperatures. This presents a particular challenge for polaritonics research,\nas reliable optical constant data is required for understanding light-matter\ncoupling. For infrared polaritonics (3-100um), the small size of exfoliated\nflakes makes conventional ellipsometry impossible. This paper presents a\ncryogenic Fourier transform infrared microscope design constructed entirely\nfrom off-the-shelf components and fitting procedures for determining optical\nconstants. We use this microscope to present the first temperature-dependent\ncharacterization of the optical properties of hexagonal boron nitride grown\nwith isotopically pure boron. We show that Fabry Perot-type resonances close to\nthe transverse optical phonon show the key temperature-dependent tuning of\nseveral parameters. Our full analysis of the infrared dielectric function shows\nsmall but significant tuning of the optical constants, which is highly\nconsistent with Raman data from the literature. We then use this dielectric\ndata to perform and analyze the polariton propagation properties, which agree\nextremely well with published cryogenic scattering-type nearfield microscopy\nresults. In addition to the insights gained into hyperbolic polaritons in hBN,\nour paper represents a transferable framework for characterizing exfoliated\ninfrared polaritonic materials and other infrared devices. This could\naccelerate discoveries in other material systems, especially those that are\nspatially inhomogeneous or cannot be prepared as large single crystals.\n","subjects":["Physics/Optics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"apLalF9_A5thxBTsTUKgTQiKyMpAjdMzF8SLS3KonZo","pdfSize":"2853258"}
