{"id":"2408.12043","title":"Competing quantum effects in spin crossover chains: spin-orbit coupling,\n  magnetic exchange, and elastic interactions","authors":"Finnian Rist, Henry L. Nourse and Ben J. Powell","authorsParsed":[["Rist","Finnian",""],["Nourse","Henry L.",""],["Powell","Ben J.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 00:05:45 GMT"}],"updateDate":"2024-08-23","timestamp":1724285145000,"abstract":"  We derive and study a model of square planar, d8 spin crossover materials\nthat treats elastic, magnetic and spin-orbit interactions on an equal footing.\nFor 1D chains density matrix renormalization group calculations show that the\ncompetition between these interactions leads to six different phases. For weak\nspin-orbit coupling (SOC) and large antiferromagnetic interactions we find a\nsymmetry protected topological (SPT) Haldane phase. This is equivalent to the\nHaldane-large-D phase transition driven by single ion anisotropy(D) in the\nspin-one Heisenberg model. For strong SOC the Sz=+-1 HS states are high-energy\nexcitations. Thus, the system can be understood as a transverse field Ising\nmodel with the SOC playing the role of the transverse field. Consistent with\nthis, we find a quantum phase transition between the THS phase and a quantum\ndisordered (QD) phase. However, if the magnetic coupling is non-zero or the HS\nand LS states of a single molecule are non-degenerate the Z2 (Ising) symmetry\nis broken and the phase transition becomes a crossover. Thus, the QD phase and\nthe THS phases are adiabatically connected, as, equivalently, are the large-D\nphase of the spin-one Heisenberg model and the quantum disordered phase of the\ntransverse field Ising model. We also find a ferroelastic LS phase, and\nantierroelastic phase, with alternating HS and LS complexes, and a dimer phase,\nwhich results from the competition between antiferromagnetic and\nantiferroelastic interactions.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"d58L6FUkV4dndaCDgg4_Y1TJ6F0ikb1Zi1wq6ShKJag","pdfSize":"1152107"}
