{"id":"2408.16591","title":"CUR for Implicit Time Integration of Random Partial Differential\n  Equations on Low-Rank Matrix Manifolds","authors":"Mohammad Hossein Naderi and Sara Akhavan and Hessam Babaee","authorsParsed":[["Naderi","Mohammad Hossein",""],["Akhavan","Sara",""],["Babaee","Hessam",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 14:54:45 GMT"}],"updateDate":"2024-08-30","timestamp":1724943285000,"abstract":"  Dynamical low-rank approximation allows for solving large-scale matrix\ndifferential equations (MDEs) with significantly fewer degrees of freedom and\nhas been applied to a growing number of applications. However, most existing\ntechniques rely on explicit time integration schemes. In this work, we\nintroduce a cost-effective Newton's method for the implicit time integration of\nstiff, nonlinear MDEs on low-rank matrix manifolds. Our methodology is focused\non MDEs resulting from the discretization of random partial differential\nequations (PDEs). Cost-effectiveness is achieved by solving the MDE at the\nminimum number of entries required for a rank-$r$ approximation. We present a\nnovel CUR low-rank approximation that requires solving the parametric PDE at\n$r$ strategically selected parameters and $\\mathcal{O}(r)$ grid points using\nNewton's method. The selected random samples and grid points adaptively vary\nover time and are chosen using the discrete empirical interpolation method or\nsimilar techniques. The proposed methodology is developed for high-order\nimplicit multistep and Runge-Kutta schemes and incorporates rank adaptivity,\nallowing for dynamic rank adjustment over time to control error. Several\nanalytical and PDE examples, including the stochastic Burgers' and Gray-Scott\nequations, demonstrate the accuracy and efficiency of the presented\nmethodology.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"T13S5JJR4SdVvTHdyZKi_s7fs0nwrnUsRJfVDYrM8Zw","pdfSize":"13486425"}
