{"id":"2408.15692","title":"Iterated graph systems and the combinatorial Loewner property","authors":"Riku Anttila and Sylvester Eriksson-Bique","authorsParsed":[["Anttila","Riku",""],["Eriksson-Bique","Sylvester",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 10:29:22 GMT"}],"updateDate":"2024-08-29","timestamp":1724840962000,"abstract":"  We introduce iterated graph systems which yield fractal spaces through a\nprojective sequence of self-similar graphs. Our construction yields new\nexamples of self-similar fractals, such as the pentagonal Sierpi\\'nski carpet\nand a pillow-space, and it yields a new framework to study potential theory on\nmany standard examples in the literature, including generalized Sierpi\\'nski\ncarpets. We demonstrate that a fractal arising from an iterated graph system\nsatisfying mild geometric conditions and having enough reflection symmetries,\nsatisfies the combinatorial Loewner property (CLP) of Bourdon and Kleiner. For\ncertain exponents, one can also obtain the conductive homogeneity condition of\nKigami. This shows, in a precise sense, that self-similarity and sufficient\nsymmetry yields CLP.\n  Furthermore, we show that our examples satisfy important asymptotic behaviors\nof discrete moduli. In particular, we establish the so-called\nsuper-multiplicative inequality for our examples - which when $p=2$ plays a\ncrucial role in the study of Dirichlet forms and random walks on fractals. This\nimplies the super-multiplicativity bound also for many fractals for which it\nwas not known before, such as the Menger sponge. A particular feature here is\nusing replacement flows and the notion of a flow basis. This yields a simpler\nway to establish many known estimates, and allows us to prove several new ones.\nFurther, super-multiplicativity shows that one can effectively estimate the\nconformal dimensions numerically for many self-similar fractals.\n","subjects":["Mathematics/Metric Geometry","Mathematics/Analysis of PDEs"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lA8avV5mv3uXZ2etTRKDA-Nq36U8kAMP6f1zGgRpzyM","pdfSize":"881114"}
