{"id":"2408.11553","title":"AnyDesign: Versatile Area Fashion Editing via Mask-Free Diffusion","authors":"Yunfang Niu, Lingxiang Wu, Dong Yi, Jie Peng, Ning Jiang, Haiying Wu,\n  Jinqiao Wang","authorsParsed":[["Niu","Yunfang",""],["Wu","Lingxiang",""],["Yi","Dong",""],["Peng","Jie",""],["Jiang","Ning",""],["Wu","Haiying",""],["Wang","Jinqiao",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 12:04:32 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 09:03:21 GMT"}],"updateDate":"2024-08-26","timestamp":1724241872000,"abstract":"  Fashion image editing aims to modify a person's appearance based on a given\ninstruction. Existing methods require auxiliary tools like segmenters and\nkeypoint extractors, lacking a flexible and unified framework. Moreover, these\nmethods are limited in the variety of clothing types they can handle, as most\ndatasets focus on people in clean backgrounds and only include generic garments\nsuch as tops, pants, and dresses. These limitations restrict their\napplicability in real-world scenarios. In this paper, we first extend an\nexisting dataset for human generation to include a wider range of apparel and\nmore complex backgrounds. This extended dataset features people wearing diverse\nitems such as tops, pants, dresses, skirts, headwear, scarves, shoes, socks,\nand bags. Additionally, we propose AnyDesign, a diffusion-based method that\nenables mask-free editing on versatile areas. Users can simply input a human\nimage along with a corresponding prompt in either text or image format. Our\napproach incorporates Fashion DiT, equipped with a Fashion-Guidance Attention\n(FGA) module designed to fuse explicit apparel types and CLIP-encoded apparel\nfeatures. Both Qualitative and quantitative experiments demonstrate that our\nmethod delivers high-quality fashion editing and outperforms contemporary\ntext-guided fashion editing methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"xuJDKU7cVA2zuKGVB56v2MsZEpbCTtXzGaaQxExmxbY","pdfSize":"20818737"}
