{"id":"2408.05931","title":"Study of a red clump giant, KIC~11087027, with high rotation and strong\n  infrared excess -- Evidence of tidal interaction for high lithium abundance","authors":"Raghubar Singh, Anohita Mallick, Bacham E. Reddy, Jeewan C. Pandey,\n  Gang Zhao","authorsParsed":[["Singh","Raghubar",""],["Mallick","Anohita",""],["Reddy","Bacham E.",""],["Pandey","Jeewan C.",""],["Zhao","Gang",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 05:58:21 GMT"}],"updateDate":"2024-08-13","timestamp":1723442301000,"abstract":"  This paper presents results from Kepler photometric light curves and\nhigh-resolution spectroscopic study of a super Li-rich giant KIC11087027. Using\nthe light curve analysis, we measured the star's rotational period P$_{\\rm\nrot}$=30.4$\\pm$0.1~days, which translates to rotational velocity V$_{\\rm\nrot}$=19.5 $\\pm$ 1.7~km s$^{-1}$. Star's location in the HR-diagram, derived\nvalues of $^{12}C/^{13}C$ = 7$\\pm$1 and $[C/N]=-0.95\\pm 0.2$, and the inferred\nasteroseismic parameters from secondary calibration based on spectra suggest\nstar is a low-mass red clump giant in the He-core burning phase. Using Gaia\ndata, we found evidence of variation in radial velocity and proper motion,\nindicative of presence of an unresolved binary. The large V$_{\\rm rot}$ is\nprobably a result of tidal synchronization combined with the after-effects of\nHe-flash, in which the size of the star is reduced significantly. The\nsimultaneous presence of features like high rotation, very high Li abundance,\nstrong dust shell, and strong flares in a single star is relatively uncommon,\nsuggesting that the star experiencing tidal synchronization has recently\nundergone He-flash. The results pose a question whether the binary interaction,\nhence the high rotation, is a prerequisite for dredging-up of the high amounts\nof Li from the interior to the photosphere during or immediately after the\nHe-flash event.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}