{"id":"2408.02799","title":"On Galois duality, self-orthogonality, and dual-containment of matrix\n  product codes","authors":"Ramy Farouk Taki Eldin","authorsParsed":[["Eldin","Ramy Farouk Taki",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 19:33:54 GMT"}],"updateDate":"2024-08-07","timestamp":1722886434000,"abstract":"  In recent literature, matrix product (MP) codes and their duals have gained\nsignificant attention due to their application in the construction of quantum\nstabilizer codes. In this paper, we begin with providing a formula that\ncharacterizes the Galois dual of MP codes. Using this formula, we establish the\nconditions under which MP codes are self-orthogonal and dual-containing.\nAlthough similar results may exist in the literature, the novelty and\nsuperiority of our results can be identified in the following points. Previous\nresults that characterize the duals of MP codes only apply to MP codes with an\ninvertible square defining matrix $\\mathcal{A}$. However, our characterization\napplies to MP code with any defining matrix, whether $\\mathcal{A}$ is not\nsquare or not of full row rank. Previous studies on the conditions for\nself-orthogonality or dual-containment of MP codes have assumed certain\nstructures for the product $\\mathcal{A}\\mathcal{A}^T$ or\n$\\mathcal{A}\\mathcal{A}^{\\dagger}$, such as being diagonal, anti-diagonal,\nmonomial, or partitioned Hermitian orthogonal. However, our conditions do not\nnecessitate such specific structures. Previous studies investigated MP code\nduality in the context of Euclidean and Hermitian duals; however, we\ninvestigate MP code duality in the broader context of Galois dual, with\nEuclidean and Hermitian duals acting as special cases. Finally, it is worth\nnoting that the proposed conditions for Galois self-orthogonality or\ndual-containment are both necessary and sufficient. To demonstrate the\ntheoretical results, several numerical examples with best-known parameters MP\ncodes are provided.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}