{"id":"2408.05761","title":"Personalized Federated Learning for improving radar based precipitation\n  nowcasting on heterogeneous areas","authors":"Judith S\\'ainz-Pardo D\\'iaz, Mar\\'ia Castrillo, Juraj Bartok, Ignacio\n  Heredia Cach\\'a, Irina Malkin Ond\\'ik, Ivan Martynovskyi, Khadijeh Alibabaei,\n  Lisana Berberi, Valentin Kozlov and \\'Alvaro L\\'opez Garc\\'ia","authorsParsed":[["Díaz","Judith Sáinz-Pardo",""],["Castrillo","María",""],["Bartok","Juraj",""],["Cachá","Ignacio Heredia",""],["Ondík","Irina Malkin",""],["Martynovskyi","Ivan",""],["Alibabaei","Khadijeh",""],["Berberi","Lisana",""],["Kozlov","Valentin",""],["García","Álvaro López",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 12:46:55 GMT"}],"updateDate":"2024-08-13","timestamp":1723380415000,"abstract":"  The increasing generation of data in different areas of life, such as the\nenvironment, highlights the need to explore new techniques for processing and\nexploiting data for useful purposes. In this context, artificial intelligence\ntechniques, especially through deep learning models, are key tools to be used\non the large amount of data that can be obtained, for example, from weather\nradars. In many cases, the information collected by these radars is not open,\nor belongs to different institutions, thus needing to deal with the distributed\nnature of this data. In this work, the applicability of a personalized\nfederated learning architecture, which has been called adapFL, on distributed\nweather radar images is addressed. To this end, given a single available radar\ncovering 400 km in diameter, the captured images are divided in such a way that\nthey are disjointly distributed into four different federated clients. The\nresults obtained with adapFL are analyzed in each zone, as well as in a central\narea covering part of the surface of each of the previously distributed areas.\nThe ultimate goal of this work is to study the generalization capability of\nthis type of learning technique for its extrapolation to use cases in which a\nrepresentative number of radars is available, whose data can not be centralized\ndue to technical, legal or administrative concerns. The results of this\npreliminary study indicate that the performance obtained in each zone with the\nadapFL approach allows improving the results of the federated learning\napproach, the individual deep learning models and the classical Continuity\nTracking Radar Echoes by Correlation approach.\n","subjects":["Computing Research Repository/Machine Learning","Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"KaI8yo9XhC7WhPsxeYdnlr2oXKociYQ7WVr-wpuFdhM","pdfSize":"2591441"}
