{"id":"2408.08697","title":"The DAMA/LIBRA signal: an induced modulation effect?","authors":"R. S. James, K. Rule, E. Barberio, V. U. Bashu, L. J. Bignell, I.\n  Bolognino, G. Brooks, S.S. Chhun, F. Dastgiri, A. R. Duffy, M. Froehlich, T.\n  M. A. Fruth, G. Fu, G. C. Hill, K. Janssens, S. Kapoor, G. J. Lane, K. T.\n  Leaver, P. McGee, L. J. McKie, P. C. McNamara, J. McKenzie, W. J. D.\n  Melbourne, M. Mews, L. J. Milligan, J. Mould, F. Nuti, F. Scutti, Z.\n  Slavkovska, N. J. Spinks, O. Stanley, A. E. Stuchbery, B. Suerfu, G. N.\n  Taylor, P. Urquijo, A. G. Williams, Y. Xing, Y. Y. Zhong, M. J. Zurowski","authorsParsed":[["James","R. S.",""],["Rule","K.",""],["Barberio","E.",""],["Bashu","V. U.",""],["Bignell","L. J.",""],["Bolognino","I.",""],["Brooks","G.",""],["Chhun","S. S.",""],["Dastgiri","F.",""],["Duffy","A. R.",""],["Froehlich","M.",""],["Fruth","T. M. A.",""],["Fu","G.",""],["Hill","G. C.",""],["Janssens","K.",""],["Kapoor","S.",""],["Lane","G. J.",""],["Leaver","K. T.",""],["McGee","P.",""],["McKie","L. J.",""],["McNamara","P. C.",""],["McKenzie","J.",""],["Melbourne","W. J. D.",""],["Mews","M.",""],["Milligan","L. J.",""],["Mould","J.",""],["Nuti","F.",""],["Scutti","F.",""],["Slavkovska","Z.",""],["Spinks","N. J.",""],["Stanley","O.",""],["Stuchbery","A. E.",""],["Suerfu","B.",""],["Taylor","G. N.",""],["Urquijo","P.",""],["Williams","A. G.",""],["Xing","Y.",""],["Zhong","Y. Y.",""],["Zurowski","M. J.",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 12:24:21 GMT"}],"updateDate":"2024-08-19","timestamp":1723811061000,"abstract":"  The persistence of the DAMA/LIBRA (DAMA) modulation over the past two decades\nhas been a source of great contention within the dark matter community. The\nDAMA collaboration reports a persistent, modulating event rate within their\nsetup of NaI(Tl) scintillating crystals at the INFN Laboratori Nazionali del\nGran Sasso (LNGS) underground laboratory. A recent work alluded that this\nsignal could have arisen due to an analysis artefact, caused by DAMA not\naccounting for time variation of decaying background radioisotopes in their\nanalysis procedure. In this work, we examine in detail this 'induced\nmodulation' effect, arguing that a number of aspects of the DAMA signal are\nincompatible with an induced modulation arising from decays of background\nisotopes over the lifetime of the experiment. Using a toy model of the\nDAMA/LIBRA experiment, we explore the induced modulation effect under different\nvariations of the activities of the relevant isotopes - namely, $^3$H and\n$^{210}$Pb - highlighting the various inconsistencies between the resultant toy\ndatasets and the DAMA signal. We stress the importance of the SABRE experiment,\nwhose goal is to unambiguously test for the presence of such a modulating\nsignal in an experiment using the same target material and comparable levels of\nbackground.\n","subjects":["Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JmCIoH38qPQ8JK2xFg1zXMr2mjvy08e-5ofadLDwNwE","pdfSize":"1558664"}
