{"id":"2408.01221","title":"Rubric-based Learner Modelling via Noisy Gates Bayesian Networks for\n  Computational Thinking Skills Assessment","authors":"Giorgia Adorni, Francesca Mangili, Alberto Piatti, Claudio Bonesana,\n  Alessandro Antonucci","authorsParsed":[["Adorni","Giorgia",""],["Mangili","Francesca",""],["Piatti","Alberto",""],["Bonesana","Claudio",""],["Antonucci","Alessandro",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 12:21:05 GMT"}],"updateDate":"2024-08-05","timestamp":1722601265000,"abstract":"  In modern and personalised education, there is a growing interest in\ndeveloping learners' competencies and accurately assessing them. In a previous\nwork, we proposed a procedure for deriving a learner model for automatic skill\nassessment from a task-specific competence rubric, thus simplifying the\nimplementation of automated assessment tools. The previous approach, however,\nsuffered two main limitations: (i) the ordering between competencies defined by\nthe assessment rubric was only indirectly modelled; (ii) supplementary skills,\nnot under assessment but necessary for accomplishing the task, were not\nincluded in the model. In this work, we address issue (i) by introducing dummy\nobserved nodes, strictly enforcing the skills ordering without changing the\nnetwork's structure. In contrast, for point (ii), we design a network with two\nlayers of gates, one performing disjunctive operations by noisy-OR gates and\nthe other conjunctive operations through logical ANDs. Such changes improve the\nmodel outcomes' coherence and the modelling tool's flexibility without\ncompromising the model's compact parametrisation, interpretability and simple\nexperts' elicitation. We used this approach to develop a learner model for\nComputational Thinking (CT) skills assessment. The CT-cube skills assessment\nframework and the Cross Array Task (CAT) are used to exemplify it and\ndemonstrate its feasibility.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4llr9K397aLYgCYt2f7aO66FXaADJgMXbCpUQm0EOkg","pdfSize":"8027901"}
