{"id":"2408.03850","title":"Robust characterization of photonic integrated circuits","authors":"Jiajia Wang, Xingyuan Xu, Haoran Zhang, Xuecheng Zeng, Yunping Bai,\n  Arthur J. Lowery, Kun Xu","authorsParsed":[["Wang","Jiajia",""],["Xu","Xingyuan",""],["Zhang","Haoran",""],["Zeng","Xuecheng",""],["Bai","Yunping",""],["Lowery","Arthur J.",""],["Xu","Kun",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 15:46:56 GMT"}],"updateDate":"2024-08-08","timestamp":1723045616000,"abstract":"  Photonic integrated circuits (PICs) offer ultra-broad optical bandwidths that\nenable unprecedented data throughputs for signal processing applications.\nDynamic reconfigurability enables compensation of fabrication flaws and\nfluctuating external environments, tuning for adaptive equalization and\ntraining of optical neural networks. The initial step in PIC reconfiguration\nentails measuring its dynamic performance, often described by its frequency\nresponse. While measuring the amplitude response is straightforward, e.g. using\na tunable laser and optical power meter, measuring the phase response presents\nchallenges due to various factors, including phase variations in test\nconnections and instrumentation limitations. To address these challenges, a\nuniversal and robust characterization technique is proposed, which uses an\non-chip reference path coupled to the signal processing core (SPC), with a\ndelay larger or smaller than the total delay across the signal processing\npaths. A Fourier transform of the chip's power response reveals the SPC's\nimpulse response. The method is more robust against low reference-path power\nand imprecise delays. Experiments using a finite-impulse-response (FIR)\nstructure demonstrate rapid SPC training, overcoming thermal crosstalk and\ndevice imperfections. This approach offers a promising solution for PIC\ncharacterization, facilitating expedited physical parameter training for\nadvanced applications in communications and optical neural networks.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}