{"id":"2408.16418","title":"Controlling Tip Vortices and Cavitation through Tip Permeability for\n  Tidal Turbines","authors":"Yabin Liu, Junchen Tan, Richard H.J. Willden, Paul Gary Tucker,\n  Ignazio Maria Viola","authorsParsed":[["Liu","Yabin",""],["Tan","Junchen",""],["Willden","Richard H. J.",""],["Tucker","Paul Gary",""],["Viola","Ignazio Maria",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 10:24:25 GMT"}],"updateDate":"2024-08-30","timestamp":1724927065000,"abstract":"  Blade-tip vortices can lead to wakes, cavitation and noise, and their control\nremains a significant challenge for tidal and wind turbines. In the present\nwork, we propose and investigate controlling tip vortices through local\npermeability. Blade-resolved Reynolds-averaged Navier-Stokes simulation has\nbeen employed on a model-scale horizontal-axis turbine, following a rigorous\nvalidation and verification process. The tip-speed ratio of the turbine varies\nfrom 4.52 to 7.54. The tip permeability is modelled by including a porous zone\nover the blade tip section, within which Darcy's law is applied. The results\ndemonstrate that there is an optimal range of permeability, corresponding to a\nnon-dimensional Darcy number, Da, of around 10^{-5}, that can substantially\ndecrease the tip vortex intensity. The revealed flow physics show that the\npermeable tip treatment can effectively enlarge the vortex viscous core radius\nwith little change to the vortex circulation. As the tip vortex intensity is\nsignificantly reduced, the permeable tip treatment can increase the minimal\npressure-coefficient at the vortex core by up to 63%, which significantly\nalleviates the cavitation risk due to tip vortices. This approach has\nnegligible influence on the turbine's energy-harvesting performance because the\nspanwise extent of the permeable tip treatment is only in the order of 0.1%\nturbine diameter. Our findings demonstrate this approach's great promise to\nbreak the upper tip-speed ratio limit capped by cavitation for tidal turbines.\nThese will contribute to developing more efficient and resilient turbines.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"bvd4js87xm8X7dwtPiut55UD-zGABdxP1ipQdk4M35w","pdfSize":"16751911"}
