{"id":"2408.00872","title":"Online Detection of Anomalies in Temporal Knowledge Graphs with\n  Interpretability","authors":"Jiasheng Zhang, Rex Ying, Jie Shao","authorsParsed":[["Zhang","Jiasheng",""],["Ying","Rex",""],["Shao","Jie",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 18:46:05 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 17:41:24 GMT"}],"updateDate":"2024-09-04","timestamp":1722537965000,"abstract":"  Temporal knowledge graphs (TKGs) are valuable resources for capturing\nevolving relationships among entities, yet they are often plagued by noise,\nnecessitating robust anomaly detection mechanisms. Existing dynamic graph\nanomaly detection approaches struggle to capture the rich semantics introduced\nby node and edge categories within TKGs, while TKG embedding methods lack\ninterpretability, undermining the credibility of anomaly detection. Moreover,\nthese methods falter in adapting to pattern changes and semantic drifts\nresulting from knowledge updates. To tackle these challenges, we introduce\nAnoT, an efficient TKG summarization method tailored for interpretable online\nanomaly detection in TKGs. AnoT begins by summarizing a TKG into a novel rule\ngraph, enabling flexible inference of complex patterns in TKGs. When new\nknowledge emerges, AnoT maps it onto a node in the rule graph and traverses the\nrule graph recursively to derive the anomaly score of the knowledge. The\ntraversal yields reachable nodes that furnish interpretable evidence for the\nvalidity or the anomalous of the new knowledge. Overall, AnoT embodies a\ndetector-updater-monitor architecture, encompassing a detector for offline TKG\nsummarization and online scoring, an updater for real-time rule graph updates\nbased on emerging knowledge, and a monitor for estimating the approximation\nerror of the rule graph. Experimental results on four real-world datasets\ndemonstrate that AnoT surpasses existing methods significantly in terms of\naccuracy and interoperability. All of the raw datasets and the implementation\nof AnoT are provided in https://github.com/zjs123/ANoT.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Databases","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2EDEw_824cpvsbEchW-Zmc8BxwKiEbjnVFEMyu5X460","pdfSize":"1927790"}
