{"id":"2408.13572","title":"X-ray observations of Blueberry galaxies","authors":"B. Adamcov\\'a, J. Svoboda, E. Kyritsis, K. Kouroumpatzakis, A. Zezas,\n  P. G. Boorman, A. Borkar, M. B\\'ilek, M. Clavel, P.-O. Petrucci","authorsParsed":[["Adamcová","B.",""],["Svoboda","J.",""],["Kyritsis","E.",""],["Kouroumpatzakis","K.",""],["Zezas","A.",""],["Boorman","P. G.",""],["Borkar","A.",""],["Bílek","M.",""],["Clavel","M.",""],["Petrucci","P. -O.",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 12:53:21 GMT"}],"updateDate":"2024-08-27","timestamp":1724504001000,"abstract":"  Compact star-forming galaxies were dominant galaxy types in the early\nUniverse. Blueberry galaxies (BBs) represent their local analogues being very\ncompact and having intensive star formation. Motivated by high X-ray emission\nrecently found in other analogical dwarf galaxies, called Green Peas, we probe\ninto the X-ray properties of BBs to determine if their X-ray emission is\nconsistent with the empirical laws for star-forming galaxies. We performed the\nfirst X-ray observations of a small sample of BBs with the XMM-Newton\nsatellite. Spectral analysis for detected sources and upper limits measured via\nBayesian-based analysis for very low-count measurements were used to determine\nthe X-ray properties of our galaxy sample. Clear detection was obtained only\nfor 2 sources, with one source exhibiting an enhanced X-ray luminosity to the\nscaling relations. For the remaining 5 sources, only an upper limit was\nconstrained, suggesting BBs to be rather underluminous as a whole. Our analysis\nshows that the large scatter cannot be easily explained by the stochasticity\neffects. While the bright source is above and inconsistent at almost the 99%\nconfidence level, the upper limits of the two sources are below the expected\ndistribution. These results indicate that the empirical relations between the\nstar formation rate, metallicity, and X-ray luminosity might not hold for BBs\nwith uniquely high specific star formation rates. One possible explanation\ncould be that the BBs may not be old enough to have a significant X-ray binary\npopulation. The high luminosity of the only bright source can be then caused by\nan additional X-ray source, such as a hidden active galactic nucleus or more\nextreme ultraluminous X-ray sources.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}