{"id":"2408.01024","title":"Semantic Skill Grounding for Embodied Instruction-Following in\n  Cross-Domain Environments","authors":"Sangwoo Shin, Seunghyun Kim, Youngsoo Jang, Moontae Lee, Honguk Woo","authorsParsed":[["Shin","Sangwoo",""],["Kim","Seunghyun",""],["Jang","Youngsoo",""],["Lee","Moontae",""],["Woo","Honguk",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 05:50:31 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 01:46:36 GMT"}],"updateDate":"2024-08-22","timestamp":1722577831000,"abstract":"  In embodied instruction-following (EIF), the integration of pretrained\nlanguage models (LMs) as task planners emerges as a significant branch, where\ntasks are planned at the skill level by prompting LMs with pretrained skills\nand user instructions. However, grounding these pretrained skills in different\ndomains remains challenging due to their intricate entanglement with the\ndomain-specific knowledge. To address this challenge, we present a semantic\nskill grounding (SemGro) framework that leverages the hierarchical nature of\nsemantic skills. SemGro recognizes the broad spectrum of these skills, ranging\nfrom short-horizon low-semantic skills that are universally applicable across\ndomains to long-horizon rich-semantic skills that are highly specialized and\ntailored for particular domains. The framework employs an iterative skill\ndecomposition approach, starting from the higher levels of semantic skill\nhierarchy and then moving downwards, so as to ground each planned skill to an\nexecutable level within the target domain. To do so, we use the reasoning\ncapabilities of LMs for composing and decomposing semantic skills, as well as\ntheir multi-modal extension for assessing the skill feasibility in the target\ndomain. Our experiments in the VirtualHome benchmark show the efficacy of\nSemGro in 300 cross-domain EIF scenarios.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1ic5g618BpwWgkQFO4q2ZejJUj4viSROT5JqWiOlO3g","pdfSize":"3542598","txDigest":"E13pQff1whiWxbS9i24qmEZCAGuw9kxorReJ6Uf5Xms6","endEpoch":"1","status":"CERTIFIED"}
