{"id":"2408.09760","title":"Regional and spatial dependence of poverty factors in Thailand, and its\n  use into Bayesian hierarchical regression analysis","authors":"Irving G\\'omez-M\\'endez, Chainarong Amornbunchornvej","authorsParsed":[["Gómez-Méndez","Irving",""],["Amornbunchornvej","Chainarong",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 07:41:29 GMT"}],"updateDate":"2024-08-20","timestamp":1724053289000,"abstract":"  Poverty is a serious issue that harms humanity progression. The simplest\nsolution is to use one-shirt-size policy to alleviate it. Nevertheless, each\nregion has its unique issues, which require a unique solution to solve them. In\nthe aspect of spatial analysis, neighbor regions can provide useful information\nto analyze issues of a given region. In this work, we proposed inferred\nboundaries of regions of Thailand that can explain better the poverty dynamics,\ninstead of the usual government administrative regions. The proposed regions\nmaximize a trade-off between poverty-related features and geographical\ncoherence. We use a spatial analysis together with Moran's cluster algorithms\nand Bayesian hierarchical regression models, with the potential of assist the\nimplementation of the right policy to alleviate the poverty phenomenon. We\nfound that all variables considered show a positive spatial autocorrelation.\nThe results of analysis illustrate that 1) Northern, Northeastern Thailand, and\nin less extend Northcentral Thailand are the regions that require more\nattention in the aspect of poverty issues, 2) Northcentral, Northeastern,\nNorthern and Southern Thailand present dramatically low levels of education,\nincome and amount of savings contrasted with large cities such as\nBangkok-Pattaya and Central Thailand, and 3) Bangkok-Pattaya is the only region\nwhose average years of education is above 12 years, which corresponds (approx.)\nwith a complete senior high school.\n","subjects":["Statistics/Methodology","Computing Research Repository/Social and Information Networks","Economics/General Economics","Quantitative Finance/Economics","Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}