{"id":"2408.10259","title":"Contrastive Learning on Medical Intents for Sequential Prescription\n  Recommendation","authors":"Arya Hadizadeh Moghaddam, Mohsen Nayebi Kerdabadi, Mei Liu, Zijun Yao","authorsParsed":[["Moghaddam","Arya Hadizadeh",""],["Kerdabadi","Mohsen Nayebi",""],["Liu","Mei",""],["Yao","Zijun",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 20:10:28 GMT"}],"updateDate":"2024-08-21","timestamp":1723579828000,"abstract":"  Recent advancements in sequential modeling applied to Electronic Health\nRecords (EHR) have greatly influenced prescription recommender systems. While\nthe recent literature on drug recommendation has shown promising performance,\nthe study of discovering a diversity of coexisting temporal relationships at\nthe level of medical codes over consecutive visits remains less explored. The\ngoal of this study can be motivated from two perspectives. First, there is a\nneed to develop a sophisticated sequential model capable of disentangling the\ncomplex relationships across sequential visits. Second, it is crucial to\nestablish multiple and diverse health profiles for the same patient to ensure a\ncomprehensive consideration of different medical intents in drug\nrecommendation. To achieve this goal, we introduce Attentive Recommendation\nwith Contrasted Intents (ARCI), a multi-level transformer-based method designed\nto capture the different but coexisting temporal paths across a shared sequence\nof visits. Specifically, we propose a novel intent-aware method with\ncontrastive learning, that links specialized medical intents of the patients to\nthe transformer heads for extracting distinct temporal paths associated with\ndifferent health profiles. We conducted experiments on two real-world datasets\nfor the prescription recommendation task using both ranking and classification\nmetrics. Our results demonstrate that ARCI has outperformed the\nstate-of-the-art prescription recommendation methods and is capable of\nproviding interpretable insights for healthcare practitioners.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}