{"id":"2408.14444","title":"Thermodynamics and criticality of supersymmetric spin chains of\n  Haldane-Shastry type","authors":"Federico Finkel, Artemio Gonz\\'alez-L\\'opez","authorsParsed":[["Finkel","Federico",""],["González-López","Artemio",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 17:36:32 GMT"}],"updateDate":"2024-08-27","timestamp":1724693792000,"abstract":"  We analyze the thermodynamics and criticality properties of four families of\nsu$(m|n)$ supersymmetric spin chains of Haldane-Shastry (HS) type, related to\nboth the $A_{N-1}$ and the $BC_N$ classical root systems. Using a known formula\nexpressing the thermodynamic free energy per spin of these models in terms of\nthe Perron (largest in modulus) eigenvalue of a suitable inhomogeneous transfer\nmatrix, we prove a general result relating the su$(kp|kq)$ free energy with\narbitrary $k=1,2,\\dots$ to the su$(p|q)$ free energy. In this way we are able\nto evaluate the thermodynamic free energy per spin of several infinite families\nof supersymmetric HS-type chains, and study their thermodynamics. In\nparticular, we show that in all cases the specific heat at constant volume\nfeatures a single marked Schottky peak, which in some cases can be\nheuristically explained by approximating the model with a suitable multi-level\nsystem with equally spaced energies. We also study the critical behavior of the\nmodels under consideration, showing that the low-temperature behavior of their\nthermodynamic free energy per spin is the same as that of a $(1+1)$-dimensional\nconformal field theory with central charge $c=m+n/2-1$. However, using a\nmotif-based description of the spectrum we prove that only the three families\nof su$(1|n)$ chains of type $A_{N-1}$ and the su$(m|n)$ HS chain of $BC_N$ type\nwith $m=1,2,3$ (when the sign $\\varepsilon_B$ in the Hamiltonian takes the\nvalue $-1$ in the latter case) are truly critical.\n","subjects":["Condensed Matter/Statistical Mechanics","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"gdZ_G3fhG5LJ56zTgQGG_NpUsM4xt8ZVEX8EtfwCV_Y","pdfSize":"907693"}
