{"id":"2408.02570","title":"Whittle's index-based age-of-information minimization in multi-energy\n  harvesting source networks","authors":"Akanksha Jaiswal and Arpan Chattopadhyay","authorsParsed":[["Jaiswal","Akanksha",""],["Chattopadhyay","Arpan",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 15:44:49 GMT"}],"updateDate":"2024-08-06","timestamp":1722872689000,"abstract":"  We consider the problem of source sampling and transmission scheduling for\nage-of-information minimization in a system consisting of multiple energy\nharvesting (EH) sources and a sink node. At each time, one of the sources is\nselected by the scheduler and the quality of its channel to the sink is\nmeasured. This probed channel quality is then used to decide whether a source\nwill sample an observation and transmit the packet to the sink in that time\nslot. We formulate this problem as a constrained Markov decision process (CMDP)\nassuming i.i.d. energy arrival and channel fading processes, and relax it using\na Lagrange multiplier. We apply a near optimal Whittle's index policy to decide\nthe node to be probed. Next, for the probed node, we derive an optimal\nthreshold policy, which recommends source sampling and observation transmission\nfrom the probed source only when the measured channel quality is above a\nthreshold. Our proposed policy is called Whittle's index and threshold based\nsource scheduling and sampling (WITS3) policy. However, in order to calculate\nWhittle's indices, one must be aware of the underlying processes' transition\nmatrices, which are occasionally concealed from the scheduler. Therefore, we\nfurther propose a variant Q-WITS3 of WITS3 based on Q-learning assisted by two\ntimescale asynchronous stochastic approximation, which seeks to learn Whittle's\nindices and optimal policies for the case with unknown channel states and EH\ncharacteristics. Numerical results demonstrate the efficacy of our algorithms\nover two baseline policies.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}