{"id":"2408.02034","title":"Mini-Monkey: Multi-Scale Adaptive Cropping for Multimodal Large Language\n  Models","authors":"Mingxin Huang and Yuliang Liu and Dingkang Liang and Lianwen Jin and\n  Xiang Bai","authorsParsed":[["Huang","Mingxin",""],["Liu","Yuliang",""],["Liang","Dingkang",""],["Jin","Lianwen",""],["Bai","Xiang",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 13:55:58 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 04:01:11 GMT"}],"updateDate":"2024-08-12","timestamp":1722779758000,"abstract":"  Recently, there has been significant interest in enhancing the capability of\nmultimodal large language models (MLLMs) to process high-resolution images.\nMost existing methods focus on adopting a cropping strategy to improve the\nability of multimodal large language models to understand image details.\nHowever, this cropping operation inevitably causes the segmentation of objects\nand connected areas, which impairs the MLLM's ability to recognize small or\nirregularly shaped objects or text. This issue is particularly evident in\nlightweight MLLMs. Addressing this issue, we propose Mini-Monkey, a lightweight\nMLLM that incorporates a plug-and-play method called multi-scale adaptive crop\nstrategy (MSAC). Mini-Monkey adaptively generates multi-scale representations,\nallowing it to select non-segmented objects from various scales. To mitigate\nthe computational overhead introduced by MSAC, we propose a Scale Compression\nMechanism (SCM), which effectively compresses image tokens. Mini-Monkey\nachieves state-of-the-art performance among 2B-parameter MLLMs. It not only\ndemonstrates leading performance on a variety of general multimodal\nunderstanding tasks but also shows consistent improvements in document\nunderstanding capabilities. On the OCRBench, Mini-Monkey achieves a score of\n802, outperforming 8B-parameter state-of-the-art model InternVL2-8B. Besides,\nour model and training strategy are very efficient, which can be trained with\nonly eight RTX 3090. The code is available at\nhttps://github.com/Yuliang-Liu/Monkey.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}