{"id":"2408.06368","title":"Analysis of the Non-variational Quantum Walk-based Optimisation\n  Algorithm","authors":"Tavis Bennett, Lyle Noakes, Jingbo B. Wang","authorsParsed":[["Bennett","Tavis",""],["Noakes","Lyle",""],["Wang","Jingbo B.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 13:54:28 GMT"}],"updateDate":"2024-08-14","timestamp":1722261268000,"abstract":"  This paper introduces in detail a non-variational quantum algorithm designed\nto solve a wide range of combinatorial optimisation problems, including\nconstrained problems and problems with non-binary variables. The algorithm\nreturns optimal and near-optimal solutions from repeated preparation and\nmeasurement of an amplified state. The amplified state is prepared via repeated\napplication of two unitaries; one which phase-shifts solution states dependent\non objective function values, and the other which mixes phase-shifted\nprobability amplitudes via a continuous-time quantum walk (CTQW) on a\nproblem-specific mixing graph. The general interference process responsible for\namplifying optimal solutions is derived in part from statistical analysis of\nobjective function values as distributed over the mixing graph. The algorithm's\nversatility is demonstrated through its application to various problems:\nweighted maxcut, k-means clustering, quadratic assignment, maximum independent\nset and capacitated facility location. In all cases, efficient circuit\nimplementations of the CTQWs are discussed. A penalty function approach for\nconstrained problems is also introduced, including a method for optimising the\npenalty function. For each of the considered problems, the algorithm's\nperformance is simulated for a randomly generated problem instance, and in each\ncase, the amplified state produces a globally optimal solution within a small\nnumber of iterations.\n","subjects":["Physics/Quantum Physics","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}