{"id":"2408.16194","title":"Highly Sensitive Differential Microwave Sensor Using Enhanced Spiral\n  Resonators for Precision Permittivity Measurement","authors":"Nastouh Nikkhah, Rasool Keshavarz, Mehran Abolhasan, Justin Lipman,\n  and Negin Shariati","authorsParsed":[["Nikkhah","Nastouh",""],["Keshavarz","Rasool",""],["Abolhasan","Mehran",""],["Lipman","Justin",""],["Shariati","Negin",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 01:25:15 GMT"}],"updateDate":"2024-08-30","timestamp":1724894715000,"abstract":"  This paper presents a highly sensitive microwave sensor for dielectric\nsensing. One of the main disadvantages of microwave resonant-based sensors is\ncross-sensitivity originated by time-dependent uncontrolled environmental\nfactors such as temperature that affect the material under test (MUT) behavior,\nleading to undesirable frequency shifts and, hence, lower accuracy. However,\nthis work eliminates the unwanted errors using the differential measurement\ntechnique by comparing two transmission resonance frequencies during a unit\ntest setup to measure the permittivity of MUT over time. The proposed structure\ncomprises a spiral resonator with an extended horizontal microstrip line\n(EH-ML) coupled to a microstrip transmission line (MTL). Creating EH-ML within\nthe structure comprises two primary contributions: enhanced sensitivity\nresulting from stronger fringing fields generated by increasing the effective\narea and improved resolution due to higher resonance frequencies caused by a\nlower total capacitive coupling effect. The proposed sensor is fabricated and\ntested using MUTs with a permittivity of less than 80 to verify the\nperformance. In this regard, a frequency detection resolution (FDR) of 44MHz\nand a sensitivity of 0.85% are achieved at a maximum permittivity of 78.3. The\nresults of theoretical analysis, simulation, and measurement are in relatively\ngood agreement. Consequently, the proposed highly sensitive microwave sensor\noffers significant advantages, such as low complexity in design and\nfabrication. It also offers high resolution and precision in a wide range of\npermittivity, which can be an attractive candidate for dielectric sensing in\nhealth, chemical and agriculture applications.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}