{"id":"2408.02846","title":"Less Is More: A Mixed-Methods Study on Security-Sensitive API Calls in\n  Java for Better Dependency Selection","authors":"Imranur Rahman, Ranidya Paramitha, Henrik Plate, Dominik Wermke,\n  Laurie Williams","authorsParsed":[["Rahman","Imranur",""],["Paramitha","Ranidya",""],["Plate","Henrik",""],["Wermke","Dominik",""],["Williams","Laurie",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 22:01:18 GMT"}],"updateDate":"2024-08-07","timestamp":1722895278000,"abstract":"  Security sensitive APIs provide access to security-sensitive resources, e.g.,\nthe filesystem or network resources. Including such API calls -- directly or\nthrough dependencies -- increases the application's attack surface. An example\nof such a phenomenon is Log4Shell, which rendered many applications vulnerable\ndue to network-related capabilities (JNDI lookup) in log4j package. Before the\nLog4Shell incident, alternate logging libraries to log4j were available that do\nnot make JNDI lookup calls. The impact of such an incident would be minimal if\ninformation about network-related API calls by logging libraries were available\nto the developers. And so the lack of visibility into the calls to these\nsecurity sensitive APIs by functionally similar open-source packages makes it\ndifficult for developers to use them as a dependency selection criterion. The\ngoal of this study is to aid developers in selecting their dependency by\nunderstanding security sensitive APIs in their dependency through call graph\nanalysis. We conducted a mixed-methods study with 45 Java packages and defined\na list of 219 security sensitive APIs. We then used call graph analysis to\nanalyze the prevalence of these APIs in our selected package versions, with and\nwithout their dependencies. Finally, we conducted a survey with open-source\ndevelopers (110 respondents) showing the comparison of functionally similar\npackages w.r.t. Security sensitive API calls to understand the usefulness of\nthis API information in the dependency selection process. The number of\nSecurity sensitive API calls of functionally similar packages can vary from 0\nto 368 in one API category and 0 to 429 in total. Our survey results show that\n73% developers agree that information about the number and type of\nsecurity-sensitive API calls of functionally similar packages would have been\nuseful in their dependency selection.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}