{"id":"2408.14534","title":"Sequential formation of supermassive stars and heavy seed BHs through\n  the interplay of cosmological cold accretion and stellar radiative feedback","authors":"Masaki Kiyuna, Takashi Hosokawa and Sunmyon Chon","authorsParsed":[["Kiyuna","Masaki",""],["Hosokawa","Takashi",""],["Chon","Sunmyon",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 18:00:01 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 07:42:32 GMT"}],"updateDate":"2024-08-30","timestamp":1724695201000,"abstract":"  Supermassive stars (SMSs) and heavy seed black holes, as their remnants, are\npromising candidates for Supermassive Black Hole (SMBH) progenitors, especially\nfor ones observed in the early universe $ z\\simeq 8.5-10$ by recent JWST\nobservations. Expected cradles of SMSs are the atomic cooling halos ($M_{\\rm\nhalo}\\simeq 10^7~{\\rm M_\\odot}$), where \"cold accretion\" emerges and possibly\nforms SMSs. We perform a suit of cosmological radiation hydrodynamics\nsimulations and investigate star formation after the emergence of cold\naccretion, solving radiative feedback from stars inside the halo. We follow the\nmass growth of the protostars for $\\sim 3~{\\rm Myr}$, resolving the gas inflow\ndown to $\\sim 0.1~{\\rm pc}$ scales. We discover that, after cold accretion\nemerges, multiple SMSs of $m_\\star \\gtrsim 10^5{\\rm M_\\odot}$ form at the halo\ncentre with the accretion rates maintained at $\\dot{m}_\\star \\simeq 0.04~{\\rm\nM_\\odot}~{\\rm yr^{-1}}$ for $\\lesssim 3~{\\rm Myr}$. Cold accretion supplies gas\nat a rate of $\\dot{M}_{\\rm gas}\\gtrsim 0.01-0.1~{\\rm M_\\odot}~{\\rm yr^{-1}}$\nfrom outside the halo virial radius to the central gas disc. Gravitational\ntorques from spiral arms transport gas further inward, which feeds the SMSs.\nRadiative feedback from stars suppresses H$_2$ cooling and disc fragmentation,\nwhile photoevaporation is prevented by a dense envelope, which attenuates\nionising radiation. Our results suggest that cold accretion can bring efficient\nBH mass growth after seed formation in the later universe. Moreover, cold\naccretion and gas migration inside the central disc increase the mass\nconcentration and provide a promising formation site for the extremely compact\nstellar clusters observed by JWST.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}