{"id":"2408.01788","title":"Gorenstein-Fano polytopes and compactifications of rank 2 polyptych\n  lattices","authors":"Adrian Cook and Laura Escobar and Megumi Harada and Christopher Manon","authorsParsed":[["Cook","Adrian",""],["Escobar","Laura",""],["Harada","Megumi",""],["Manon","Christopher",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 14:00:21 GMT"}],"updateDate":"2024-08-06","timestamp":1722693621000,"abstract":"  The notion of polyptych lattices, introduced by Escobar, Harada, and Manon,\nwraps the data of a collection of lattices related by piecewise-linear\nbijections together into a single semi-algebraic object, equipped with its own\nnotions of convexity and polyhedra. The main purpose of this manuscript is to\nconstruct an explicit family of polyptych lattices, and to illustrate via\nexplicit computations the abstract theory introduced by Escobar-Harada-Manon.\nSpecifically, we first construct a family of rank-$2$ polyptych lattices\n$\\mathcal{M}_s$ with $2$ charts, compute their space of points, and prove that\nthey are full and self-dual. We then give a concrete sample computation of a\npoint-convex hull in $\\mathcal{M}_s \\otimes \\mathbb{R}$ to illustrate that\nconvex geometry in the polyptych lattice setting can exhibit phenomena not seen\nin the classical situation. We also give multiple examples of $2$-dimensional\n``chart-Gorenstein-Fano'' polytopes, which give rise to pairs of\nmutation-related $2$-dimensional (classical) Gorenstein-Fano polytopes.\nFinally, we produce detropicalizations $(\\mathcal{A}_s, \\mathfrak{v}_s)$ of\n$\\mathcal{M}_s$, and in the case $s=1$ where the detropicalization is a UFD,\nand with respect to a certain choice of PL polytope $\\mathcal{P}$, we give an\nexplicit generators-and-relations presentation of the (finitely generated) Cox\nring of the compactification $X_{\\mathcal{A}_s}(\\mathcal{P})$ of\n$\\mathrm{Spec}(\\mathcal{A}_s)$ with respect to $\\mathcal{P}$.\n","subjects":["Mathematics/Algebraic Geometry"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}