{"id":"2408.14199","title":"A Survey on Small-Scale Testbeds for Connected and Automated Vehicles\n  and Robot Swarms","authors":"Armin Mokhtarian, Jianye Xu, Patrick Scheffe, Maximilian Kloock, Simon\n  Sch\\\"afer, Heeseung Bang, Viet-Anh Le, Sangeet Ulhas, Johannes Betz, Sean\n  Wilson, Spring Berman, Liam Paull, Amanda Prorok, Bassam Alrifaee","authorsParsed":[["Mokhtarian","Armin",""],["Xu","Jianye",""],["Scheffe","Patrick",""],["Kloock","Maximilian",""],["Schäfer","Simon",""],["Bang","Heeseung",""],["Le","Viet-Anh",""],["Ulhas","Sangeet",""],["Betz","Johannes",""],["Wilson","Sean",""],["Berman","Spring",""],["Paull","Liam",""],["Prorok","Amanda",""],["Alrifaee","Bassam",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 11:54:27 GMT"}],"updateDate":"2024-08-27","timestamp":1724673267000,"abstract":"  Connected and automated vehicles and robot swarms hold transformative\npotential for enhancing safety, efficiency, and sustainability in the\ntransportation and manufacturing sectors. Extensive testing and validation of\nthese technologies is crucial for their deployment in the real world. While\nsimulations are essential for initial testing, they often have limitations in\ncapturing the complex dynamics of real-world interactions. This limitation\nunderscores the importance of small-scale testbeds. These testbeds provide a\nrealistic, cost-effective, and controlled environment for testing and\nvalidating algorithms, acting as an essential intermediary between simulation\nand full-scale experiments. This work serves to facilitate researchers' efforts\nin identifying existing small-scale testbeds suitable for their experiments and\nprovide insights for those who want to build their own. In addition, it\ndelivers a comprehensive survey of the current landscape of these testbeds. We\nderive 62 characteristics of testbeds based on the well-known sense-plan-act\nparadigm and offer an online table comparing 22 small-scale testbeds based on\nthese characteristics. The online table is hosted on our designated public\nwebpage www.cpm-remote.de/testbeds, and we invite testbed creators and\ndevelopers to contribute to it. We closely examine nine testbeds in this paper,\ndemonstrating how the derived characteristics can be used to present testbeds.\nFurthermore, we discuss three ongoing challenges concerning small-scale\ntestbeds that we identified, i.e., small-scale to full-scale transition,\nsustainability, and power and resource management.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Multiagent Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}