{"id":"2408.17154","title":"Self-supervised Anomaly Detection Pretraining Enhances Long-tail ECG\n  Diagnosis","authors":"Aofan Jiang, Chaoqin Huang, Qing Cao, Yuchen Xu, Zi Zeng, Kang Chen,\n  Ya Zhang, and Yanfeng Wang","authorsParsed":[["Jiang","Aofan",""],["Huang","Chaoqin",""],["Cao","Qing",""],["Xu","Yuchen",""],["Zeng","Zi",""],["Chen","Kang",""],["Zhang","Ya",""],["Wang","Yanfeng",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 09:48:47 GMT"}],"updateDate":"2024-09-02","timestamp":1725011327000,"abstract":"  Current computer-aided ECG diagnostic systems struggle with the\nunderdetection of rare but critical cardiac anomalies due to the imbalanced\nnature of ECG datasets. This study introduces a novel approach using\nself-supervised anomaly detection pretraining to address this limitation. The\nanomaly detection model is specifically designed to detect and localize subtle\ndeviations from normal cardiac patterns, capturing the nuanced details\nessential for accurate ECG interpretation. Validated on an extensive dataset of\nover one million ECG records from clinical practice, characterized by a\nlong-tail distribution across 116 distinct categories, the anomaly\ndetection-pretrained ECG diagnostic model has demonstrated a significant\nimprovement in overall accuracy. Notably, our approach yielded a 94.7% AUROC,\n92.2% sensitivity, and 92.5\\% specificity for rare ECG types, significantly\noutperforming traditional methods and narrowing the performance gap with common\nECG types. The integration of anomaly detection pretraining into ECG analysis\nrepresents a substantial contribution to the field, addressing the\nlong-standing challenge of long-tail data distributions in clinical\ndiagnostics. Furthermore, prospective validation in real-world clinical\nsettings revealed that our AI-driven approach enhances diagnostic efficiency,\nprecision, and completeness by 32%, 6.7%, and 11.8% respectively, when compared\nto standard practices. This advancement marks a pivotal step forward in the\nintegration of AI within clinical cardiology, with particularly profound\nimplications for emergency care, where rapid and accurate ECG interpretation is\ncrucial. The contributions of this study not only push the boundaries of\ncurrent ECG diagnostic capabilities but also lay the groundwork for more\nreliable and accessible cardiovascular care.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}