{"id":"2408.17113","title":"A Two-Timescale Decision-Hazard-Decision Formulation for Storage Usage\n  Values Calculation","authors":"Camila Martinez Parra (RTE, CERMICS), Michel de Lara (CERMICS),\n  Jean-Philippe Chancelier (CERMICS), Pierre Carpentier (UMA), Jean-Marc Janin\n  (RTE), Manuel Ruiz (RTE)","authorsParsed":[["Parra","Camila Martinez","","RTE, CERMICS"],["de Lara","Michel","","CERMICS"],["Chancelier","Jean-Philippe","","CERMICS"],["Carpentier","Pierre","","UMA"],["Janin","Jean-Marc","","RTE"],["Ruiz","Manuel","","RTE"]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 08:55:29 GMT"}],"updateDate":"2024-09-02","timestamp":1725008129000,"abstract":"  The penetration of renewable energies requires additional storages to deal\nwith intermittency. Accordingly, there is growing interest in evaluating the\nopportunity cost (usage value) associated with stored energy in large storages,\na cost obtained by solving a multistage stochastic optimization problem. Today,\nto compute usage values under uncertainties, an adequacy resource problem is\nsolved using stochastic dynamic programming assuming a hazard-decision\ninformation structure. This modelling assumes complete knowledge of the coming\nweek uncertainties, which is not adapted to the system operation as the\nintermittency occurs at smaller timescale. We equip the twotimescale problem\nwith a new information structure considering planning and recourse decisions:\ndecision-hazard-decision. This structure is used to decompose the multistage\ndecision-making process into a nonanticipative planning step in which the\non/off decisions for the thermal units are made, and a recourse step in which\nthe power modulation decisions are made once the uncertainties have been\ndisclosed. In a numerical case, we illustrate how usage values are sensitive as\nhow the disclosure of information is modelled.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}