{"id":"2408.13073","title":"IntelliCare: Improving Healthcare Analysis with Variance-Controlled\n  Patient-Level Knowledge from Large Language Models","authors":"Zhihao Yu, Yujie Jin, Yongxin Xu, Xu Chu, Yasha Wang, Junfeng Zhao","authorsParsed":[["Yu","Zhihao",""],["Jin","Yujie",""],["Xu","Yongxin",""],["Chu","Xu",""],["Wang","Yasha",""],["Zhao","Junfeng",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 13:56:00 GMT"}],"updateDate":"2024-08-26","timestamp":1724421360000,"abstract":"  While pioneering deep learning methods have made great strides in analyzing\nelectronic health record (EHR) data, they often struggle to fully capture the\nsemantics of diverse medical codes from limited data. The integration of\nexternal knowledge from Large Language Models (LLMs) presents a promising\navenue for improving healthcare predictions. However, LLM analyses may exhibit\nsignificant variance due to ambiguity problems and inconsistency issues,\nhindering their effective utilization. To address these challenges, we propose\nIntelliCare, a novel framework that leverages LLMs to provide high-quality\npatient-level external knowledge and enhance existing EHR models. Concretely,\nIntelliCare identifies patient cohorts and employs task-relevant statistical\ninformation to augment LLM understanding and generation, effectively mitigating\nthe ambiguity problem. Additionally, it refines LLM-derived knowledge through a\nhybrid approach, generating multiple analyses and calibrating them using both\nthe EHR model and perplexity measures. Experimental evaluations on three\nclinical prediction tasks across two large-scale EHR datasets demonstrate that\nIntelliCare delivers significant performance improvements to existing methods,\nhighlighting its potential in advancing personalized healthcare predictions and\ndecision support systems.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"2iHMUzWnnDvYRPBN0kM3FS-dy-7bHocbpIpl9xYcS5c","pdfSize":"762818"}
