{"id":"2408.11345","title":"Deep Tree-based Retrieval for Efficient Recommendation: Theory and\n  Method","authors":"Ze Liu, Jin Zhang, Chao Feng, Defu Lian, Jie Wang, and Enhong Chen","authorsParsed":[["Liu","Ze",""],["Zhang","Jin",""],["Feng","Chao",""],["Lian","Defu",""],["Wang","Jie",""],["Chen","Enhong",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 05:09:53 GMT"},{"version":"v2","created":"Sat, 7 Sep 2024 07:54:32 GMT"}],"updateDate":"2024-09-10","timestamp":1724216993000,"abstract":"  With the development of deep learning techniques, deep recommendation models\nalso achieve remarkable improvements in terms of recommendation accuracy.\nHowever, due to the large number of candidate items in practice and the high\ncost of preference computation, these methods also suffer from low efficiency\nof recommendation. The recently proposed tree-based deep recommendation models\nalleviate the problem by directly learning tree structure and representations\nunder the guidance of recommendation objectives. However, such models have\nshortcomings. The max-heap assumption in the hierarchical tree, in which the\npreference for a parent node should be the maximum between the preferences for\nits children, is difficult to satisfy in their binary classification\nobjectives. To this end, we propose Tree-based Deep Retrieval (TDR for short)\nfor efficient recommendation. In TDR, all the trees generated during the\ntraining process are retained to form the forest. When learning the node\nrepresentation of each tree, we have to satisfy the max-heap assumption as much\nas possible and mimic beam search behavior over the tree in the training stage.\nThis is achieved by TDR to regard the training task as multi-classification\nover tree nodes at the same level. However, the number of tree nodes grows\nexponentially with levels, making us train the preference model with the\nguidance of the sampled-softmax technique. The experiments are conducted on\nreal-world datasets, validating the effectiveness of the proposed preference\nmodel learning method and tree learning method.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"J7dGNFpMEzvhkoew9TSKU3BK78r9Ni7fGeVOoED0GnM","pdfSize":"893198"}
