{"id":"2408.02958","title":"A framework for incorporating binding energy distribution in gas-ice\n  astrochemical models","authors":"Kenji Furuya","authorsParsed":[["Furuya","Kenji",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 05:02:34 GMT"}],"updateDate":"2024-08-07","timestamp":1722920554000,"abstract":"  One of the most serious limitations of current astrochemical models with the\nrate equation (RE) approach is that only a single type of binding site is\nconsidered in grain surface chemistry, although laboratory and quantum chemical\nstudies have found that surfaces contain various binding sites with different\npotential energy depths. When various sites exist, adsorbed species can be\ntrapped in deep potential sites, increasing the resident time on the surface.\nOn the other hand, adsorbed species can be populated in shallow sites,\nactivating thermal hopping and thus two-body reactions even at low\ntemperatures, where the thermal hopping from deeper sites is not activated.\nSuch behavior cannot be described by the conventional RE approach. In this\nwork, I present a framework for incorporating various binding sites (i.e.,\nbinding energy distribution) in gas-ice astrochemical models as an extension of\nthe conventional RE approach. I propose a simple method to estimate the\nprobability density function for the occupation of various sites by adsorbed\nspecies, assuming a quasi-steady state. By using thermal desorption and hopping\nrates weighted by the probability density functions, the effect of binding\nenergy distribution is incorporated into the RE approach without increasing the\nnumber of ordinary differential equations to be solved. This method is found to\nbe accurate and computationally efficient and enables us to consider binding\nenergy distribution even for a large gas-ice chemical network, which contains\nhundreds of icy species. The impact of the binding energy distribution on\ninterstellar ice composition is discussed quantitatively for the first time.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}