{"id":"2408.02716","title":"Study of Stable Dark Energy Stars in Ho\\v{r}ava-Lifshitz gravity","authors":"Krishna Pada Das and Ujjal Debnath","authorsParsed":[["Das","Krishna Pada",""],["Debnath","Ujjal",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 15:23:58 GMT"}],"updateDate":"2024-08-07","timestamp":1722871438000,"abstract":"  We study the structure and basic physical properties of non-rotating dark\nenergy stars in Ho$\\Check{\\text{r}}$ava-Lifshitz (HL) gravity. The interior of\npropsed stellar structure is made of isotropic matter obeys extended Chaplygin\ngas EoS. The structure equations representing the state of hydrostatic\nequilibrium i.e., generalize TOV equation in HL gravity is numerically solved\nby using chosen realistic EoS. Next, we investigate the deviation of physical\nfeatures of dark energy stars in HL gravity as compared with general relativity\n(GR). Such investigation is depicted by varying a parameter $\\omega$, whereas\nfor $\\omega\\rightarrow \\infty$ HL coincide with GR. As a results, we find that\nnecessary features of our stellar structure are significantly affected by\n$\\omega$ in HL gravity specifically on the estimation of the maximum mass and\ncorresponding predicted radius of the star. In conclusion, we can predict the\nexistence of heavior massive dark energy stars in the context of HL gravity as\ncompared with GR with not collapsing into a black hole. Moreover, we\ninvestigate the stability of our proposed stellar system. By integrating the\nmodified perturbations equations in support of suitable boundary conditions at\nthe center and the surface of the stellar object, we evaluate the frequencies\nand eigenfunctions corresponding to six lowest excited modes. Finally, we find\nthat physically viable and stable dark energy stars can be successfully\ndiscussed in HL gravity by this study.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}