{"id":"2408.00593","title":"Generalised BBGKY hierarchy for near-integrable dynamics","authors":"Leonardo Biagetti, Maciej Lebek, Milosz Panfil, Jacopo De Nardis","authorsParsed":[["Biagetti","Leonardo",""],["Lebek","Maciej",""],["Panfil","Milosz",""],["De Nardis","Jacopo",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 14:21:13 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 14:10:24 GMT"}],"updateDate":"2024-09-06","timestamp":1722522073000,"abstract":"  We consider quantum or classical many-body Hamiltonian systems, whose\ndynamics is given by an integrable, contact interactions, plus another,\npossibly long-range, generic two-body potential. We show how the dynamics of\nlocal observables is given in terms of a generalised version of\nBogoliubov-Born-Green-Kirkwood-Yvon hierarchy, which we denote as gBBGKY, which\nis built for the densities, and their correlations, of the quasiparticles of\nthe underlying integrable model. Unlike the usual cases of perturbation theory\nfrom free gases, the presence of local interactions in the integrable model\n\"lifts\" the so-called kinetic blocking, and the second layer of the hierarchy\nreproduces the dynamics at all time-scales. The latter consists of a fast\npre-equilibration to a non-thermal steady state, and its subsequent\nthermalisation to a Gibbs ensemble. We show how the final relaxation is encoded\ninto a Boltzmann scattering integral involving three or higher\nbody-scatterings, and which, remarkably, is entirely determined by the\ndiffusion constants of the underlying integrable model. We check our results\nwith exact molecular dynamics simulations, finding perfect agreement. Our\nresults show how gBBGKY can be successfully employed in quantum systems to\ncompute scattering integrals and Fermi's golden rule transition rates.\n","subjects":["Condensed Matter/Statistical Mechanics","Condensed Matter/Quantum Gases","Nonlinear Sciences/Exactly Solvable and Integrable Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oN1-6gZ_JFFDpPAhbsHxhOcrr6yvD9bh2ovL0T-8SBk","pdfSize":"1334105","txDigest":"5gwBN5dBejnLCjmFGwkD4BpxnR9ancnB93ef4fethHpK","endEpoch":"1","status":"CERTIFIED"}
