{"id":"2408.14607","title":"Patient-specific prediction of regional lung mechanics in ARDS patients\n  with physics-based models: A validation study","authors":"Maximilian Rixner, Maximilian Ludwig, Matthias Lindner, In\\'ez\n  Frerichs, Armin Sablewski, Karl-Robert Wichmann, Max-Carl Wachter, Kei W.\n  M\\\"uller, Dirk Sch\\\"adler, Wolfgang A. Wall, Jonas Biehler, Tobias Becher","authorsParsed":[["Rixner","Maximilian",""],["Ludwig","Maximilian",""],["Lindner","Matthias",""],["Frerichs","Inéz",""],["Sablewski","Armin",""],["Wichmann","Karl-Robert",""],["Wachter","Max-Carl",""],["Müller","Kei W.",""],["Schädler","Dirk",""],["Wall","Wolfgang A.",""],["Biehler","Jonas",""],["Becher","Tobias",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 20:04:34 GMT"}],"updateDate":"2024-08-28","timestamp":1724702674000,"abstract":"  The choice of lung protective ventilation settings for mechanical ventilation\nhas a considerable impact on patient outcome, yet identifying optimal\nventilatory settings for individual patients remains highly challenging due to\nthe inherent inter- and intra-patient pathophysiological variability. In this\nvalidation study, we demonstrate that physics-based computational lung models\ntailored to individual patients can resolve this variability, allowing us to\npredict the otherwise unknown local state of the pathologically affected lung\nduring mechanical ventilation. For seven ARDS patients undergoing invasive\nmechanical ventilation, physics-based, patient-specific lung models were\ncreated using chest CT scans and ventilatory data. By numerically resolving the\ninteraction of the pathological lung with the airway pressure and flow imparted\nby the ventilator, we predict the time-dependent and heterogeneous local state\nof the lung for each patient and compare it against the regional ventilation\nobtained from bedside monitoring using Electrical Impedance Tomography.\nExcellent agreement between numerical simulations and experimental data was\nobtained, with the model-predicted anteroposterior ventilation profile\nachieving a Pearson correlation of 96% with the clinical reference data. Even\nwhen considering the regional ventilation within the entire transverse chest\ncross-section and across the entire dynamic ventilation range, an average\ncorrelation of more than 81% and an average root mean square error of less than\n15% were achieved. The results of this first systematic validation study\ndemonstrate the ability of computational models to provide clinically relevant\ninformation and thereby open the door for a truly patient-specific choice of\nventilator settings on the basis of both individual anatomy and\npathophysiology.\n","subjects":["Physics/Medical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}