{"id":"2408.11377","title":"From 100 MHz to 10 GHz: Unveiling the spectral evolution of the X-shaped\n  radio galaxy in Abell 3670","authors":"L. Bruno, M. Brienza, A. Zanichelli, M. Gitti, F. Ubertosi, K.\n  Rajpurohit, T. Venturi, D. Dallacasa","authorsParsed":[["Bruno","L.",""],["Brienza","M.",""],["Zanichelli","A.",""],["Gitti","M.",""],["Ubertosi","F.",""],["Rajpurohit","K.",""],["Venturi","T.",""],["Dallacasa","D.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 07:01:14 GMT"}],"updateDate":"2024-08-22","timestamp":1724223674000,"abstract":"  X-shaped radio galaxies (XRGs) are characterised by two pairs of misaligned\nlobes, namely the active lobes hosting radio jets and the wings. None of the\nformation mechanisms proposed so far can exhaustively reproduce the diverse\nfeatures observed among XRGs. The emerging evidence is the existence of\nsub-populations of XRGs forming via different processes. The brightest cluster\ngalaxy in Abell 3670 (A3670) is a dumbbell system hosting the XRG MRC 2011-298.\nThe morphological and spectral properties of this interesting XRG have been\nfirst characterised through Karl G. Jansky Very Large Array (JVLA) data at 1-10\nGHz. In the present work, we followed-up MRC 2011-298 with the upgraded Giant\nMetrewave Radio Telescope (uGMRT) at 120-800 MHz to further constrain its\nproperties and origin. We carried out a detailed spectral analysis sampling\ndifferent spatial scales. Integrated radio spectra, spectral index maps, radio\ncolour-colour diagrams, and radiative age maps of both the active lobes and\nprominent wings have been employed to test the origin of the source. We confirm\na progressive spectral steepening from the lobes to the wings. The maximum\nradiative age of the source is $\\sim 80$ Myr, with the wings being older than\nthe lobes by $\\gtrsim 30$ Myr in their outermost regions. The observed\nproperties are in line with an abrupt reorientation of the jets by $\\sim 90$\ndeg from the direction of the wings to their present position. This formation\nmechanism is further supported by the comparison with numerical simulations in\nthe literature, which additionally highlight the role of hydrodynamic processes\nin the evolution of large wings such as those of MRC 2011-298. Potentially, the\ncoalescence of supermassive black holes could have triggered the spin-flip of\nthe jets. Moreover, we show that the S-shape of the radio jets is likely driven\nby precession with a period $P \\sim 10$ Myr.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}