{"id":"2408.09408","title":"VrdONE: One-stage Video Visual Relation Detection","authors":"Xinjie Jiang, Chenxi Zheng, Xuemiao Xu, Bangzhen Liu, Weiying Zheng,\n  Huaidong Zhang, Shengfeng He","authorsParsed":[["Jiang","Xinjie",""],["Zheng","Chenxi",""],["Xu","Xuemiao",""],["Liu","Bangzhen",""],["Zheng","Weiying",""],["Zhang","Huaidong",""],["He","Shengfeng",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 08:38:20 GMT"}],"updateDate":"2024-08-20","timestamp":1723970300000,"abstract":"  Video Visual Relation Detection (VidVRD) focuses on understanding how\nentities interact over time and space in videos, a key step for gaining deeper\ninsights into video scenes beyond basic visual tasks. Traditional methods for\nVidVRD, challenged by its complexity, typically split the task into two parts:\none for identifying what relation categories are present and another for\ndetermining their temporal boundaries. This split overlooks the inherent\nconnection between these elements. Addressing the need to recognize entity\npairs' spatiotemporal interactions across a range of durations, we propose\nVrdONE, a streamlined yet efficacious one-stage model. VrdONE combines the\nfeatures of subjects and objects, turning predicate detection into 1D instance\nsegmentation on their combined representations. This setup allows for both\nrelation category identification and binary mask generation in one go,\neliminating the need for extra steps like proposal generation or\npost-processing. VrdONE facilitates the interaction of features across various\nframes, adeptly capturing both short-lived and enduring relations.\nAdditionally, we introduce the Subject-Object Synergy (SOS) module, enhancing\nhow subjects and objects perceive each other before combining. VrdONE achieves\nstate-of-the-art performances on the VidOR benchmark and ImageNet-VidVRD,\nshowcasing its superior capability in discerning relations across different\ntemporal scales. The code is available at\n\\textcolor[RGB]{228,58,136}{\\href{https://github.com/lucaspk512/vrdone}{https://github.com/lucaspk512/vrdone}}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}