{"id":"2408.08920","title":"A Survey of Trojan Attacks and Defenses to Deep Neural Networks","authors":"Lingxin Jin, Xianyu Wen, Wei Jiang, Jinyu Zhan","authorsParsed":[["Jin","Lingxin",""],["Wen","Xianyu",""],["Jiang","Wei",""],["Zhan","Jinyu",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 04:20:32 GMT"}],"updateDate":"2024-08-20","timestamp":1723695632000,"abstract":"  Deep Neural Networks (DNNs) have found extensive applications in\nsafety-critical artificial intelligence systems, such as autonomous driving and\nfacial recognition systems. However, recent research has revealed their\nsusceptibility to Neural Network Trojans (NN Trojans) maliciously injected by\nadversaries. This vulnerability arises due to the intricate architecture and\nopacity of DNNs, resulting in numerous redundant neurons embedded within the\nmodels. Adversaries exploit these vulnerabilities to conceal malicious Trojans\nwithin DNNs, thereby causing erroneous outputs and posing substantial threats\nto the efficacy of DNN-based applications. This article presents a\ncomprehensive survey of Trojan attacks against DNNs and the countermeasure\nmethods employed to mitigate them. Initially, we trace the evolution of the\nconcept from traditional Trojans to NN Trojans, highlighting the feasibility\nand practicality of generating NN Trojans. Subsequently, we provide an overview\nof notable works encompassing various attack and defense strategies,\nfacilitating a comparative analysis of their approaches. Through these\ndiscussions, we offer constructive insights aimed at refining these techniques.\nIn recognition of the gravity and immediacy of this subject matter, we also\nassess the feasibility of deploying such attacks in real-world scenarios as\nopposed to controlled ideal datasets. The potential real-world implications\nunderscore the urgency of addressing this issue effectively.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}