{"id":"2408.08563","title":"Compact Efficient Polarizers for Relativistic Electron Beams","authors":"Kun Xue, Yue Cao, Feng Wan, Zhong-Peng Li, Qian Zhao, Si-Man Liu,\n  Xin-Yu Liu, Li-Xiang Hu, Yong-Tao Zhao, Zhong-Feng Xu, Tong-Pu Yu, Jian-Xing\n  Li","authorsParsed":[["Xue","Kun",""],["Cao","Yue",""],["Wan","Feng",""],["Li","Zhong-Peng",""],["Zhao","Qian",""],["Liu","Si-Man",""],["Liu","Xin-Yu",""],["Hu","Li-Xiang",""],["Zhao","Yong-Tao",""],["Xu","Zhong-Feng",""],["Yu","Tong-Pu",""],["Li","Jian-Xing",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 06:54:00 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 14:34:35 GMT"}],"updateDate":"2024-09-19","timestamp":1723791240000,"abstract":"  Relativistic spin-polarized electron beams are important for fundamental\nresearch and the industry, but their generation currently requires conventional\naccelerators or ultrastrong laser facilities, limiting their accessibility and\nbroad applications. Here, we put forward a novel method for constructing a\ncompact efficient \"polarizer\" that achieves direct ultrafast conversion of\nrelativistic dense electron beams into polarized ones, based on the beam\n\"self-polarization\" mechanism via simple beam-target interactions. In this\nscheme, as the electron beam grazes through the polarizer (a double-layer solid\ntarget), it ionizes the target and excites an asymmetric plasma field due to\nthe plasma backflows. This field then reacts on the beam itself, triggering\nspontaneous radiative polarization and reflection of the beam, and ultimately\nyielding a dense polarized electron beam. Moreover, the double-layer target\nsetup induces a plasma bubble that focuses the polarized beam and reshapes its\npolarization distribution. Our method is robust with respect to the beam and\ntarget parameters, and opens a new avenue for relativistic beam polarization\nwith compact accessible devices, which would facilitate their broad\napplications and the development of related experiments, such as in\nstrong-field QED studies, and polarized electron-positron and electron-ion\ncolliders.\n","subjects":["Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}