{"id":"2408.09800","title":"Latent Diffusion for Guided Document Table Generation","authors":"Syed Jawwad Haider Hamdani, Saifullah Saifullah, Stefan Agne, Andreas\n  Dengel, Sheraz Ahmed","authorsParsed":[["Hamdani","Syed Jawwad Haider",""],["Saifullah","Saifullah",""],["Agne","Stefan",""],["Dengel","Andreas",""],["Ahmed","Sheraz",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 08:46:16 GMT"}],"updateDate":"2024-08-20","timestamp":1724057176000,"abstract":"  Obtaining annotated table structure data for complex tables is a challenging\ntask due to the inherent diversity and complexity of real-world document\nlayouts. The scarcity of publicly available datasets with comprehensive\nannotations for intricate table structures hinders the development and\nevaluation of models designed for such scenarios. This research paper\nintroduces a novel approach for generating annotated images for table structure\nby leveraging conditioned mask images of rows and columns through the\napplication of latent diffusion models. The proposed method aims to enhance the\nquality of synthetic data used for training object detection models.\nSpecifically, the study employs a conditioning mechanism to guide the\ngeneration of complex document table images, ensuring a realistic\nrepresentation of table layouts. To evaluate the effectiveness of the generated\ndata, we employ the popular YOLOv5 object detection model for training. The\ngenerated table images serve as valuable training samples, enriching the\ndataset with diverse table structures. The model is subsequently tested on the\nchallenging pubtables-1m testset, a benchmark for table structure recognition\nin complex document layouts. Experimental results demonstrate that the\nintroduced approach significantly improves the quality of synthetic data for\ntraining, leading to YOLOv5 models with enhanced performance. The mean Average\nPrecision (mAP) values obtained on the pubtables-1m testset showcase results\nclosely aligned with state-of-the-art methods. Furthermore, low FID results\nobtained on the synthetic data further validate the efficacy of the proposed\nmethodology in generating annotated images for table structure.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"5nJk0uLrt7gogclxGmXyw-3qUdhMYFoZWYJVvCVQXOY","pdfSize":"20879034"}
