{"id":"2408.17023","title":"Physics-integrated Neural Network for Quantum Transport Prediction of\n  Field-effect Transistor","authors":"Xiuying Zhang, Linqiang Xu, Jing Lu, Zhaofu Zhang, and Lei Shen","authorsParsed":[["Zhang","Xiuying",""],["Xu","Linqiang",""],["Lu","Jing",""],["Zhang","Zhaofu",""],["Shen","Lei",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 05:38:12 GMT"}],"updateDate":"2024-09-02","timestamp":1724996292000,"abstract":"  Quantum-mechanics-based transport simulation is of importance for the design\nof ultra-short channel field-effect transistors (FETs) with its capability of\nunderstanding the physical mechanism, while facing the primary challenge of the\nhigh computational intensity. Traditional machine learning is expected to\naccelerate the optimization of FET design, yet its application in this field is\nlimited by the lack of both high-fidelity datasets and the integration of\nphysical knowledge. Here, we introduced a physics-integrated neural network\nframework to predict the transport curves of sub-5-nm gate-all-around (GAA)\nFETs using an in-house developed high-fidelity database. The transport curves\nin the database are collected from literature and our first-principles\ncalculations. Beyond silicon, we included indium arsenide, indium phosphide,\nand selenium nanowires with different structural phases as the FET channel\nmaterials. Then, we built a physical-knowledge-integrated hyper vector neural\nnetwork (PHVNN), in which five new physical features were added into the inputs\nfor prediction transport characteristics, achieving a sufficiently low mean\nabsolute error of 0.39. In particular, ~98% of the current prediction residuals\nare within one order of magnitude. Using PHVNN, we efficiently screened out the\nsymmetric p-type GAA FETs that possess the same figures of merit with the\nn-type ones, which are crucial for the fabrication of homogeneous CMOS\ncircuits. Finally, our automatic differentiation analysis provides\ninterpretable insights into the PHVNN, which highlights the important\ncontributions of our new input parameters and improves the reliability of\nPHVNN. Our approach provides an effective method for rapidly screening\nappropriate GAA FETs with the prospect of accelerating the design process of\nnext-generation electronic devices.\n","subjects":["Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Materials Science","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}