{"id":"2408.10643","title":"The missing rings around Solar System moons","authors":"Mario Sucerquia, Jaime A. Alvarado-Montes, Jorge I. Zuluaga, Nicol\\'as\n  Cuello, Jorge Cuadra, and Mat\\'ias Montesinos","authorsParsed":[["Sucerquia","Mario",""],["Alvarado-Montes","Jaime A.",""],["Zuluaga","Jorge I.",""],["Cuello","Nicolás",""],["Cuadra","Jorge",""],["Montesinos","Matías",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 08:32:48 GMT"}],"updateDate":"2024-08-21","timestamp":1724142768000,"abstract":"  Rings are complex structures surrounding giant planets and some minor bodies\nin the Solar System. While some formation mechanisms could also potentially\nfoster their existence around (regular or irregular) satellites, none of these\nbodies currently bear these structures. We aim to understand the underlying\nmechanisms that govern the potential formation, stability, and/or decay of\nhypothetical circumsatellital rings (CSRs), orbiting the largest moons in the\nSolar System. This extends to the exploration of short-term morphological\nfeatures within these rings, providing insights into the ring survival\ntime-scales and the interactions that drive their evolution. To conduct this\nstudy, we use numerical N-body simulations under the perturbing influence of\nthe host planet and other moon companions. We found that moons with a lower\nRoche-to-Hill radius can preserve their rings over extended periods. Moreover,\nthe gravitational environment in which these rings are immersed influences the\nsystem's morphological evolution, inducing gaps through the excitation of\neccentricity and inclination of constituent particles. Specifically, our\nresults show that Iapetus' and Rhea's rings experience minimal variations in\ntheir orbital parameters, enhancing their long-term stability. This agrees with\nthe hypothesis that some of the features of Iapetus and Rhea were produced by\nancient ring systems, for example, the huge ridge in Iapetus equator as a\nresult of a decaying ring. From a dynamical perspective, we found that there\nare no mechanisms that preclude the existence of CSRs and we attribute their\ncurrent absence to non-gravitational phenomena. Effects such as stellar\nradiation, magnetic fields, and the influence of magnetospheric plasma can\nsignificantly impact the dynamics of constituent particles and trigger their\ndecay, highlighing the importance of future studies on these effects.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-or1u_pviIEgH6zXxq_XzuMPkQuMkPuhPjTnNAcWc7Y","pdfSize":"7792685"}
