{"id":"2408.12378","title":"Timelike virtual transition in a static atom by a static mirror in\n  Kasner Universe and in future Kruskal-Szekeres region","authors":"Subhajit Barman, Pradeep Kumawat, Bibhas Ranjan Majhi","authorsParsed":[["Barman","Subhajit",""],["Kumawat","Pradeep",""],["Majhi","Bibhas Ranjan",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 13:18:22 GMT"}],"updateDate":"2024-08-23","timestamp":1724332702000,"abstract":"  We investigate the timelike transitions in a two-level atom in the presence\nof an infinite reflecting mirror in the Kasner regions of a Minkowski spacetime\nas well as region interior of a $(1+1)$ dimensional Schwarzschild black hole.\nIn particular, when considering the Kasner spacetime, two specific scenarios\nare dealt with -- $(i)$ a static mirror is synchronized with Minkowski time\nwhile the static atom is using future Kasner time, $(ii)$ a static atom is\nusing Minkowski time and the mirror is following the future Kasner time.\nAnalogous scenarios in the black hole spacetime are -- the static mirror is\nusing future Kruskal time while the static atom is using Schwarzschild timelike\ncoordinate, defined inside the black hole, as its time, and vice-versa. In all\nof these scenarios, we observe thermal response and its periodic dependence on\nthe separation between the atom and the mirror. These responses vanish\nperiodically with this separation, which contrasts the scenario of uniform\nacceleration. We observe that the $(1+1)$ dimensional Minkowski-Kasner\nresponses are the same when the atomic and field frequencies are equal. At the\nsame time, the Schwarzschild-interior and $(3+1)$ dimensional Minkowski-Kasner\nare unequal for the same atomic and field frequencies. Therefore we feel that\nthe robustness of the symmetry between the two scenarios crucially depends on\nthe dimension as well as the curvature of the spacetime. Although\nqualitatively, there exist similarities to a certain degree between the\nresponses in the Minkowski-Kasner and Schwarzschild-interior, they also carry\ncrucial differences. We discuss the physical interpretations of these\nobservations.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}