{"id":"2408.02258","title":"Quantum conditional entropies and fully entangled fraction of states\n  with maximally mixed marginals","authors":"Komal Kumar, Indranil Chakrabarty, Nirman Ganguly","authorsParsed":[["Kumar","Komal",""],["Chakrabarty","Indranil",""],["Ganguly","Nirman",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 06:16:51 GMT"}],"updateDate":"2024-08-06","timestamp":1722838611000,"abstract":"  The fully entangled fraction (FEF) measures the proximity of a quantum state\nto maximally entangled states. FEF $>\\frac{1}{d}$, in $d \\otimes d$ systems is\na significant benchmark for various quantum information processing protocols\nincluding teleportation. Quantum conditional entropy (QCE) on the other hand is\na measure of correlation in quantum systems. Conditional entropies for quantum\nsystems can be negative, marking a departure from conventional classical\nsystems. The negativity of quantum conditional entropies plays a decisive role\nin tasks like state merging and dense coding. In the present work, we\ninvestigate the relation of these two important yardsticks. Our probe is mainly\ndone in the ambit of states with maximally mixed marginals, with a few\nillustrations from other classes of quantum states. We start our study in two\nqubit systems, where for the Werner states, we obtain lower bounds to its FEF\nwhen the conditional R\\'enyi $\\alpha-$entropy is negative. We then obtain\nrelations between FEF and QCE for two qubit Weyl states. Moving on to two qudit\nstates we find a necessary and sufficient condition based on FEF, for the\nisotropic state to have negative conditional entropy. In two qudit systems the\nrelation between FEF and QCE is probed for the rank deficient and generalized\nBell diagonal states. FEF is intricately linked with $k$- copy nonlocality and\n$k$- copy steerability. The relations between FEF and QCE facilitates to find\nconditions for $k$- copy nonlocality and $k$- copy steerability based on QCE.\nWe obtain such conditions for certain classes of states in two qubits and two\nqudits. As a corollary to the relations obtained between QCE and FEF we obtain\nlower bounds to minimal deterministic work cost for two qubit Werner states and\ntwo qudit generalized Bell states.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}