{"id":"2408.04042","title":"Scaling Law of Sim2Real Transfer Learning in Expanding Computational\n  Materials Databases for Real-World Predictions","authors":"Shunya Minami, Yoshihiro Hayashi, Stephen Wu, Kenji Fukumizu, Hiroki\n  Sugisawa, Masashi Ishii, Isao Kuwajima, Kazuya Shiratori, Ryo Yoshida","authorsParsed":[["Minami","Shunya",""],["Hayashi","Yoshihiro",""],["Wu","Stephen",""],["Fukumizu","Kenji",""],["Sugisawa","Hiroki",""],["Ishii","Masashi",""],["Kuwajima","Isao",""],["Shiratori","Kazuya",""],["Yoshida","Ryo",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 18:47:58 GMT"}],"updateDate":"2024-08-09","timestamp":1723056478000,"abstract":"  To address the challenge of limited experimental materials data, extensive\nphysical property databases are being developed based on high-throughput\ncomputational experiments, such as molecular dynamics simulations. Previous\nstudies have shown that fine-tuning a predictor pretrained on a computational\ndatabase to a real system can result in models with outstanding generalization\ncapabilities compared to learning from scratch. This study demonstrates the\nscaling law of simulation-to-real (Sim2Real) transfer learning for several\nmachine learning tasks in materials science. Case studies of three prediction\ntasks for polymers and inorganic materials reveal that the prediction error on\nreal systems decreases according to a power-law as the size of the\ncomputational data increases. Observing the scaling behavior offers various\ninsights for database development, such as determining the sample size\nnecessary to achieve a desired performance, identifying equivalent sample sizes\nfor physical and computational experiments, and guiding the design of data\nproduction protocols for downstream real-world tasks.\n","subjects":["Condensed Matter/Materials Science","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0uGKUriiQnfchSyM6lIMWCh5WpzorMU2cbhLOhPjXos","pdfSize":"1508167"}
