{"id":"2408.07068","title":"Atomic fluorescence collection into planar photonic devices","authors":"Orion Smedley, Vighnesh Natarajan, Oscar Jaramillo, Hamim Mahmud Rivy,\n  Karan K. Mehta","authorsParsed":[["Smedley","Orion",""],["Natarajan","Vighnesh",""],["Jaramillo","Oscar",""],["Rivy","Hamim Mahmud",""],["Mehta","Karan K.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 17:58:58 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 17:53:19 GMT"}],"updateDate":"2024-08-26","timestamp":1723571938000,"abstract":"  Fluorescence collection from individual emitters plays a key role in state\ndetection and remote entanglement generation, fundamental functionalities in\nmany quantum platforms. Planar photonics have been demonstrated for robust and\nscalable addressing of trapped-ion systems, motivating consideration of similar\nelements for the complementary challenge of photon collection. Here, using an\nargument from the reciprocity principle, we show that far-field photon\ncollection efficiency can be simply expressed in terms of the fields associated\nwith the collection optic at the emitter position alone. We calculate\ncollection efficiencies into ideal paraxial and fully vectorial focused\nGaussian modes parameterized in terms of focal waist, and further quantify the\nmodest enhancements possible with more general beam profiles, establishing\ndesign requirements for efficient collection. Towards practical implementation,\nwe design, fabricate, and characterize a diffractive collection element\noperating at $\\lambda=397$ nm predicted to offer a total 0.25\\% collection\nefficiency into a single waveguide mode. A more efficient design with more\ndemanding fabrication requirements would offer $1.14\\%$, and we indicate\navenues to improved devices approaching the limits predicted for ideal beams.\nWe point out a particularly simple integrated waveguide configuration for\npolarization-based remote entanglement generation enabled by integrated\ncollection.\n","subjects":["Physics/Optics","Physics/Atomic Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}