{"id":"2408.02462","title":"An investigation into the causes of race bias in AI-based cine CMR\n  segmentation","authors":"Tiarna Lee, Esther Puyol-Anton, Bram Ruijsink, Sebastien Roujol,\n  Theodore Barfoot, Shaheim Ogbomo-Harmitt, Miaojing Shi, Andrew P. King","authorsParsed":[["Lee","Tiarna",""],["Puyol-Anton","Esther",""],["Ruijsink","Bram",""],["Roujol","Sebastien",""],["Barfoot","Theodore",""],["Ogbomo-Harmitt","Shaheim",""],["Shi","Miaojing",""],["King","Andrew P.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 13:40:33 GMT"}],"updateDate":"2024-08-06","timestamp":1722865233000,"abstract":"  Artificial intelligence (AI) methods are being used increasingly for the\nautomated segmentation of cine cardiac magnetic resonance (CMR) imaging.\nHowever, these methods have been shown to be subject to race bias, i.e. they\nexhibit different levels of performance for different races depending on the\n(im)balance of the data used to train the AI model. In this paper we\ninvestigate the source of this bias, seeking to understand its root cause(s) so\nthat it can be effectively mitigated. We perform a series of classification and\nsegmentation experiments on short-axis cine CMR images acquired from Black and\nWhite subjects from the UK Biobank and apply AI interpretability methods to\nunderstand the results. In the classification experiments, we found that race\ncan be predicted with high accuracy from the images alone, but less accurately\nfrom ground truth segmentations, suggesting that the distributional shift\nbetween races, which is often the cause of AI bias, is mostly image-based\nrather than segmentation-based. The interpretability methods showed that most\nattention in the classification models was focused on non-heart regions, such\nas subcutaneous fat. Cropping the images tightly around the heart reduced\nclassification accuracy to around chance level. Similarly, race can be\npredicted from the latent representations of a biased segmentation model,\nsuggesting that race information is encoded in the model. Cropping images\ntightly around the heart reduced but did not eliminate segmentation bias. We\nalso investigate the influence of possible confounders on the bias observed.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}