{"id":"2408.02456","title":"Enhancing Heterogeneous Knowledge Graph Completion with a Novel\n  GAT-based Approach","authors":"Wanxu Wei, Yitong Song, Bin Yao","authorsParsed":[["Wei","Wanxu",""],["Song","Yitong",""],["Yao","Bin",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 13:28:51 GMT"}],"updateDate":"2024-08-06","timestamp":1722864531000,"abstract":"  Knowledge graphs (KGs) play a vital role in enhancing search results and\nrecommendation systems. With the rapid increase in the size of the KGs, they\nare becoming inaccuracy and incomplete. This problem can be solved by the\nknowledge graph completion methods, of which graph attention network\n(GAT)-based methods stand out since their superior performance. However,\nexisting GAT-based knowledge graph completion methods often suffer from\noverfitting issues when dealing with heterogeneous knowledge graphs, primarily\ndue to the unbalanced number of samples. Additionally, these methods\ndemonstrate poor performance in predicting the tail (head) entity that shares\nthe same relation and head (tail) entity with others. To solve these problems,\nwe propose GATH, a novel GAT-based method designed for Heterogeneous KGs. GATH\nincorporates two separate attention network modules that work synergistically\nto predict the missing entities. We also introduce novel encoding and feature\ntransformation approaches, enabling the robust performance of GATH in scenarios\nwith imbalanced samples. Comprehensive experiments are conducted to evaluate\nthe GATH's performance. Compared with the existing SOTA GAT-based model on\nHits@10 and MRR metrics, our model improves performance by 5.2% and 5.2% on the\nFB15K-237 dataset, and by 4.5% and 14.6% on the WN18RR dataset, respectively.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8J3QU_SsGI3vFhWgVwo3HCQip2ZK_yR0nZJzXDE6kEE","pdfSize":"1192843"}
