{"id":"2408.04859","title":"Investigating and improving student understanding of the basics of\n  quantum computing","authors":"Peter Hu, Yangqiuting Li, Chandralekha Singh","authorsParsed":[["Hu","Peter",""],["Li","Yangqiuting",""],["Singh","Chandralekha",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 04:30:44 GMT"}],"updateDate":"2024-08-12","timestamp":1723177844000,"abstract":"  Quantum information science and engineering (QISE) is a rapidly developing\nfield that leverages the skills of experts from many disciplines to utilize the\npotential of quantum systems in a variety of applications. It requires talent\nfrom a wide variety of traditional fields, including physics, engineering,\nchemistry, and computer science, to name a few. To prepare students for such\nopportunities, it is important to give them a strong foundation in the basics\nof QISE, in which quantum computing plays a central role. In this study, we\ndiscuss the development, validation, and evaluation of a QuILT, or Quantum\nInteractive Learning Tutorial, on the basics and applications of quantum\ncomputing. These include an overview of key quantum mechanical concepts\nrelevant for quantum computation (including ways a quantum computer is\ndifferent from a classical computer), properties of single- and multi-qubit\nsystems, and the basics of single-qubit quantum gates. The tutorial uses guided\ninquiry-based teaching-learning sequences. Its development and validation\ninvolved conducting cognitive task analysis from both expert and student\nperspectives and using common student difficulties as a guide. The\ninquiry-based learning sequences in the tutorial provide scaffolding support to\nhelp students develop a functional understanding. The final version of the\nvalidated tutorial was implemented in two distinct courses offered by the\nphysics department with slightly different student populations and broader\ncourse goals. Students' understanding was evaluated after traditional\nlecture-based instruction on the requisite concepts, and again after engaging\nwith the tutorial. We analyze and discuss their improvement in performance on\nconcepts covered in the tutorial.\n","subjects":["Physics/Physics Education"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}