{"id":"2408.08233","title":"The Z-Gromov-Wasserstein Distance","authors":"Martin Bauer, Facundo M\\'emoli, Tom Needham, Mao Nishino","authorsParsed":[["Bauer","Martin",""],["Mémoli","Facundo",""],["Needham","Tom",""],["Nishino","Mao",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 15:58:07 GMT"}],"updateDate":"2024-08-16","timestamp":1723737487000,"abstract":"  The Gromov-Wasserstein (GW) distance is a powerful tool for comparing metric\nmeasure spaces which has found broad applications in data science and machine\nlearning. Driven by the need to analyze datasets whose objects have\nincreasingly complex structure (such as node and edge-attributed graphs),\nseveral variants of GW distance have been introduced in the recent literature.\nWith a view toward establishing a general framework for the theory of GW-like\ndistances, this paper considers a vast generalization of the notion of a metric\nmeasure space: for an arbitrary metric space $Z$, we define a $Z$-network to be\na measure space endowed with a kernel valued in $Z$. We introduce a method for\ncomparing $Z$-networks by defining a generalization of GW distance, which we\nrefer to as $Z$-Gromov-Wasserstein ($Z$-GW) distance. This construction\nsubsumes many previously known metrics and offers a unified approach to\nunderstanding their shared properties. The paper demonstrates that the $Z$-GW\ndistance defines a metric on the space of $Z$-networks which retains desirable\nproperties of $Z$, such as separability, completeness, and geodesicity. Many of\nthese properties were unknown for existing variants of GW distance that fall\nunder our framework. Our focus is on foundational theory, but our results also\ninclude computable lower bounds and approximations of the distance which will\nbe useful for practical applications.\n","subjects":["Mathematics/Metric Geometry","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"Fm7iJldCQOby_qrEXJsrlBwTiYP1VI8RzJQy5wGsZKE","pdfSize":"662151"}
