{"id":"2408.04410","title":"Easy Access to Bright Oxygen Defects in Biocompatible Single-Walled\n  Carbon Nanotubes via a Fenton-Like Reaction","authors":"Simon Settele, Florian Stammer, Sebastian Lindenthal, Simon R. Wald,\n  Finn L. Sebastian, Han Li, Benjamin S. Flavel and Jana Zaumseil","authorsParsed":[["Settele","Simon",""],["Stammer","Florian",""],["Lindenthal","Sebastian",""],["Wald","Simon R.",""],["Sebastian","Finn L.",""],["Li","Han",""],["Flavel","Benjamin S.",""],["Zaumseil","Jana",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 12:19:46 GMT"}],"updateDate":"2024-08-09","timestamp":1723119586000,"abstract":"  The covalent functionalization of single-walled carbon nanotubes (SWNTs) with\nluminescent oxygen defects increases their brightness and enables their\napplication as optical biosensors or fluorescent probes for in-vivo imaging in\nthe second-biological window (NIR-II). However, obtaining luminescent defects\nwith high brightness is challenging with the current functionalization methods\ndue to a restricted window of reaction conditions or the necessity for\ncontrolled irradiation with ultraviolet light. Here we report a method for\nintroducing luminescent oxygen defects via a Fenton-like reaction that uses\nbenign and inexpensive chemicals without light irradiation. (6,5) SWNTs in\naqueous dispersion functionalized with this method show bright $E_{11}$*\nemission (1105 nm) with 3.2-times higher peak intensities than the pristine\n$E_{11}$ emission and a reproducible photoluminescence quantum yield of 3%. The\nfunctionalization can be performed within a wide range of reaction parameters\nand even with unsorted nanotube raw material at high concentrations (100 mg/L),\ngiving access to large amounts of brightly luminescent SWNTs. We further find\nthat the introduced oxygen defects rearrange under light irradiation, which\ngives additional insights into the structure and dynamics of oxygen defects.\nFinally, the functionalization of ultra-short SWNTs with oxygen defects also\nenables high photoluminescence quantum yields and their excellent emission\nproperties are retained after surfactant exchange with biocompatible pegylated\nphospholipids or single-stranded DNA to make them suitable for in-vivo NIR-II\nimaging and dopamine sensing.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"IytbFVi9NvEi2fGAkHAutkKO5B2Ik9WN_6ghBk6aHWc","pdfSize":"7284554"}
