{"id":"2408.01713","title":"Intuitionistic Fuzzy Generalized Eigenvalue Proximal Support Vector\n  Machine","authors":"A. Quadir, M. A. Ganaie, M. Tanveer","authorsParsed":[["Quadir","A.",""],["Ganaie","M. A.",""],["Tanveer","M.",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 08:49:23 GMT"}],"updateDate":"2024-08-06","timestamp":1722674963000,"abstract":"  Generalized eigenvalue proximal support vector machine (GEPSVM) has attracted\nwidespread attention due to its simple architecture, rapid execution, and\ncommendable performance. GEPSVM gives equal significance to all samples,\nthereby diminishing its robustness and efficacy when confronted with real-world\ndatasets containing noise and outliers. In order to reduce the impact of noises\nand outliers, we propose a novel intuitionistic fuzzy generalized eigenvalue\nproximal support vector machine (IF-GEPSVM). The proposed IF-GEPSVM assigns the\nintuitionistic fuzzy score to each training sample based on its location and\nsurroundings in the high-dimensional feature space by using a kernel function.\nThe solution of the IF-GEPSVM optimization problem is obtained by solving a\ngeneralized eigenvalue problem. Further, we propose an intuitionistic fuzzy\nimproved GEPSVM (IF-IGEPSVM) by solving the standard eigenvalue decomposition\nresulting in simpler optimization problems with less computation cost which\nleads to an efficient intuitionistic fuzzy-based model. We conduct a\ncomprehensive evaluation of the proposed IF-GEPSVM and IF-IGEPSVM models on UCI\nand KEEL datasets. Moreover, to evaluate the robustness of the proposed\nIF-GEPSVM and IF-IGEPSVM models, label noise is introduced into some UCI and\nKEEL datasets. The experimental findings showcase the superior generalization\nperformance of the proposed models when compared to the existing baseline\nmodels, both with and without label noise. Our experimental results, supported\nby rigorous statistical analyses, confirm the superior generalization abilities\nof the proposed IF-GEPSVM and IF-IGEPSVM models over the baseline models.\nFurthermore, we implement the proposed IF-GEPSVM and IF-IGEPSVM models on the\nUSPS recognition dataset, yielding promising results that underscore the\nmodels' effectiveness in practical and real-world applications.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}