{"id":"2408.10472","title":"Hybrid electromagnetic toroidal vortices","authors":"Ren Wang, Beier Ying, Shuai Shi, Junsong Wang, Bing-Zhong Wang,\n  Musheng Liang, and Yijie Shen","authorsParsed":[["Wang","Ren",""],["Ying","Beier",""],["Shi","Shuai",""],["Wang","Junsong",""],["Wang","Bing-Zhong",""],["Liang","Musheng",""],["Shen","Yijie",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 01:02:19 GMT"}],"updateDate":"2024-08-21","timestamp":1724115739000,"abstract":"  The ubiquitous occurrence of toroidal vortices or vortex rings in\nfluid-dynamic scenarios in nature has garnered significant attention of\nscientific frontier, whilst, the electromagnetic counterparts of which were\nonly proposed recently with two distinct manifestations: vector toroidal pulses\n[Nat. Photon. 16, 523 (2022)] and scalar phase toroidal vortices [Nat. Photon.\n16, 519 (2022)]. This dichotomy in the understanding of toroidal vortex\nphenomena has prompted a reassessment of their fundamental nature. Herein, we\ntheoretically propose a novel form of electromagnetic toroidal vortex\nsolutions, that uniquely integrate both scalar and vector characteristics,\nchallenging the prevailing notion of their mutual exclusivity. We also present\nthe experimental generation of the hybrid toroidal vortex pulses by a compact\ncoaxial horn emitter augmented with a metasurface. This methodology not only\ndemonstrates the feasibility of creating such complex vortex structures but\nalso endows the resulting pulses with unique properties, including the\ncoexistence of transverse orbital angular momentum, electromagnetic vortex\nstreets, and topological skyrmion textures. These attributes introduce new\ndimensions in topologically complex structured waves, opening avenues for\nenhanced free-space information transmission, topologically nontrivial\nlight-matter interaction and microscopy techniques.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}