{"id":"2408.11430","title":"A novel approach to combine spatial and spectral information from\n  hyperspectral images","authors":"Belal Gaci (UMR ITAP, CTIFL), Florent Abdelghafour (UMR ITAP), Maxime\n  Ryckewaert (UMR ITAP), S\\'ilvia Mas Garcia (UMR ITAP), Marine Louargant\n  (CTIFL), Florence Verpont (CTIFL), Yohana Laloum (CTIFL), Ryad Bendoula (UMR\n  ITAP), Gilles Chaix (UMR AGAP, Cirad-BIOS), Jean-Michel Roger (UMR ITAP)","authorsParsed":[["Gaci","Belal","","UMR ITAP, CTIFL"],["Abdelghafour","Florent","","UMR ITAP"],["Ryckewaert","Maxime","","UMR ITAP"],["Garcia","Sílvia Mas","","UMR ITAP"],["Louargant","Marine","","CTIFL"],["Verpont","Florence","","CTIFL"],["Laloum","Yohana","","CTIFL"],["Bendoula","Ryad","","UMR\n  ITAP"],["Chaix","Gilles","","UMR AGAP, Cirad-BIOS"],["Roger","Jean-Michel","","UMR ITAP"]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 08:37:46 GMT"}],"updateDate":"2024-08-22","timestamp":1724229466000,"abstract":"  This article proposes a generic framework to process jointly the spatial and\nspectral information of hyperspectral images. First, sub-images are extracted.\nThen each of these sub-images follows two parallel workflows, one dedicated to\nthe extraction of spatial features and the other dedicated to the extraction of\nspectral features. Finally, the extracted features are merged, producing as\nmany scores as sub-images. Two applications are proposed, illustrating\ndifferent spatial and spectral processing methods. The first one is related to\nthe characterization of a teak wood disk, in an unsupervised way. It implements\ntensors of structure for the spatial branch, simple averaging for the spectral\nbranch and multi-block principal component analysis for the fusion process. The\nsecond application is related to the early detection of apple scab on leaves.\nIt implements co-occurrence matrices for the spatial branch, singular value\ndecomposition for the spectral branch and multiblock partial least squares\ndiscriminant analysis for the fusion process. Both applications demonstrate the\ninterest of the proposed method for the extraction of relevant spatial and\nspectral information and show how promising this new approach is for\nhyperspectral imaging processing.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}