{"id":"2408.08197","title":"The Effect of Horizontal Shear on Extracting Water Currents From Surface\n  Wave Data","authors":"Stefan Weichert and Benjamin K. Smeltzer and Simen {\\AA}. Ellingsen","authorsParsed":[["Weichert","Stefan",""],["Smeltzer","Benjamin K.",""],["Ellingsen","Simen Å.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 15:04:10 GMT"}],"updateDate":"2024-08-27","timestamp":1723734250000,"abstract":"  The dispersive motion of surface waves is now routinely used to remotely\nmeasure the currents close beneath the surface of oceans and other natural\nflows. The current manifests as wavelength-dependent Doppler shifts in the\nspatiotemporal wave spectrum, which is obtained by performing a Fourier\ntransform of an observed wave field, a procedure which assumes that the current\nis horizontally uniform within the field of view. This assumption is frequently\nnot satisfied. We here analyze the effects of the presence of horizontal shear\nin the velocity field, with special emphasis on biases: ``measured'' velocities\nwhich differ systematically in magnitude and/or direction compared to the\naverage current within the field of view. We generate random synthetic wave\ndata according to a spectrum prescribed at the domain center while varying the\ncurrent and its gradient, and the mean direction $\\theta_0$ and angular spread\nof the waves' propagation direction, from which we extract Doppler shift\nvelocities (DSVs) using one of the most common numerical schemes. Assuming\ncurrents vary by up to 10\\% of a characteristic wave phase velocity across the\nfield of view, we find that strong biases can occur for highly directional wave\nspectra, strongly dependent on $\\theta_0$ and the current direction relative to\nthat of its magnitude gradient. We discuss how biases arise in the DSV\nextraction procedure and suggest practical steps to discover the presence of\nbiases.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"w8VrxBFo9HLX1dvryrTeJqWeV0v5AssAMhp_fnGOBCc","pdfSize":"625102"}
