{"id":"2408.02828","title":"A NuSTAR Census of the X-ray Binary Population of the M31 Disk","authors":"Hannah Moon, Daniel R. Wik, V. Antoniou, M. Eracleous, Ann E.\n  Hornschemeier, Margaret Lazzarini, Bret D. Lehmer, Neven Vulic, Benjamin F.\n  Williams, T. J. Maccarone, K. Pottschmidt, Andrew Ptak, Mihoko Yukita, and\n  Andreas Zezas","authorsParsed":[["Moon","Hannah",""],["Wik","Daniel R.",""],["Antoniou","V.",""],["Eracleous","M.",""],["Hornschemeier","Ann E.",""],["Lazzarini","Margaret",""],["Lehmer","Bret D.",""],["Vulic","Neven",""],["Williams","Benjamin F.",""],["Maccarone","T. J.",""],["Pottschmidt","K.",""],["Ptak","Andrew",""],["Yukita","Mihoko",""],["Zezas","Andreas",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 20:50:59 GMT"}],"updateDate":"2024-08-07","timestamp":1722891059000,"abstract":"  Using hard (E>10 keV) X-ray observations with NuSTAR, we are able to\ndifferentiate between accretion states, and thus compact object types, of\nneutron stars and black holes in X-ray binaries (XRBs) in M31, our nearest\nMilky Way-type neighbor. Using ten moderate-depth (20-50 ks) observations of\nthe disk of M31 covering a total of ~0.45 deg$^{2}$, we detect 20 sources at\n2$\\sigma$ in the 4-25 keV band pass, 14 of which we consider to be XRB\ncandidates. This complements an existing deeper (100-400 ks) survey covering\n~0.2 deg$^{2}$ of the bulge and the northeastern disk. We make tentative\nclassifications of 9 of these sources with the use of diagnostic\ncolor-intensity and color-color diagrams, which separate sources into various\nneutron star and black hole regimes, identifying 3 black holes and 6 neutron\nstars. In addition, we create X-ray luminosity functions for both the full\n(4-25 keV) and hard (12-25 keV) band, as well as sub-populations of the full\nband based on compact object type and association with globular clusters. Our\nbest fit globular cluster XLF is shallower than the field XLF, and preliminary\nBH and NS XLFs suggest a difference in shape based on compact object type. We\nfind that the cumulative disk XLFs in the full and hard band are best fit by\npower laws with indices of 1.32 and 1.28 respectively. This is consistent with\nmodels of the Milky Way XLF from Grimm et al. (2002), Voss & Ajello (2010), and\nDoroshenko et al. (2014).\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5FaM5FyTvMikWbA58kpVz-2y9zwKrMPihjn3TLMDN9o","pdfSize":"1464919"}
