{"id":"2408.00824","title":"Probing galaxy evolution from $z=0$ to $z\\simeq10$ through galaxy\n  scaling relations in three L-Galaxies flavours","authors":"Akash Vani, Mohammadreza Ayromlou, Guinevere Kauffmann, and Volker\n  Springel","authorsParsed":[["Vani","Akash",""],["Ayromlou","Mohammadreza",""],["Kauffmann","Guinevere",""],["Springel","Volker",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-05","timestamp":1722535200000,"abstract":"  We present a comprehensive examination of the three most recent versions of\nthe L-Galaxies semi-analytic galaxy formation model, focusing on the evolution\nof galaxy properties across a broad stellar mass range ($10^7\\:{\\rm\nM}_{\\odot}\\lesssim{M_\\star}\\lesssim10^{12}\\:{\\rm M}_{\\odot}$) from $z=0$ to\n$z\\simeq10$. We compare the predictions with the latest multiband data from key\nastronomical surveys, including SDSS, CANDELS, and COSMOS along with HST, JWST,\nand ALMA. We assess the models' ability to reproduce various time-dependent\ngalaxy scaling relations for star-forming and quenched galaxies. Key focus\nareas include global galaxy properties such as stellar mass functions, cosmic\nstar formation rate density, and the evolution of the main sequence of\nstar-forming galaxies. Additionally, we examine resolved morphological\nproperties such as the galaxy mass-size relation, alongside core\n$(R<1\\,{\\rm{kpc}})$ and effective $(R<R_{\\rm{e}})$ stellar-mass surface\ndensities as a function of stellar mass. This analysis reveals that the\n\\textsc{L-Galaxies} models are in qualitatively good agreement with observed\nglobal galaxy scaling relations up to $z\\simeq10$. However, significant\ndiscrepancies exist at both low and high redshifts in accurately reproducing\nthe number density, size, and surface density evolution of quenched galaxies.\nThese issues are most pronounced for massive galaxies, where the simulations\nunderpredict the abundance of quenched galaxies at $z\\geq1.5$, reaching a\ndiscrepancy of a factor of 60 by $z\\approx3$, with sizes several times larger\nthan observed. Therefore, we propose that the physical prescriptions governing\nthe cessation of star formation in galaxies, such as AGN feedback and processes\nrelated to merging, require improvement to be better supported by observational\ndata.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}