{"id":"2408.12572","title":"Contextual Stochastic Optimization for School Desegregation Policymaking","authors":"Hongzhao Guan, Nabeel Gillani, Tyler Simko, Jasmine Mangat, Pascal Van\n  Hentenryck","authorsParsed":[["Guan","Hongzhao",""],["Gillani","Nabeel",""],["Simko","Tyler",""],["Mangat","Jasmine",""],["Van Hentenryck","Pascal",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 17:40:06 GMT"}],"updateDate":"2024-08-23","timestamp":1724348406000,"abstract":"  Most US school districts draw geographic \"attendance zones\" to assign\nchildren to schools based on their home address, a process that can codify\nexisting neighborhood racial/ethnic and socioeconomic status (SES) segregation\nin schools. Redrawing boundaries can reduce segregation, but estimating the\nrezoning impact is challenging as families can opt-out of their assigned\nschools. This paper is an attempt to address this societal problem: it develops\na joint redistricting and choice modeling framework, called redistricting with\nchoices (RWC). The RWC framework is applied to a large US public school\ndistrict for estimating how redrawing elementary school boundaries in the\ndistrict might realistically impact levels of socioeconomic segregation. The\nmain methodological contribution of the RWC is a contextual stochastic\noptimization model that minimizes district-wide dissimilarity, and integrates\nthe rezoning constraints and a school choice model for the students obtained\nthrough machine learning. The key finding of the study is the observation that\nRWC yields boundary changes that might reduce segregation by a substantial\namount (23%) -- but doing so might require the re-assignment of a large number\nof students, likely to mitigate re-segregation that choice patterns could\nexacerbate. The results also reveal that predicting school choice is a\nchallenging machine learning problem. Overall, this study offers a novel\npractical framework that both academics and policymakers might use to foster\nmore diverse and integrated schools.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}