{"id":"2408.06244","title":"3D Reconstruction of Protein Structures from Multi-view AFM Images using\n  Neural Radiance Fields (NeRFs)","authors":"Jaydeep Rade, Ethan Herron, Soumik Sarkar, Anwesha Sarkar, Adarsh\n  Krishnamurthy","authorsParsed":[["Rade","Jaydeep",""],["Herron","Ethan",""],["Sarkar","Soumik",""],["Sarkar","Anwesha",""],["Krishnamurthy","Adarsh",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 15:53:24 GMT"}],"updateDate":"2024-08-13","timestamp":1723478004000,"abstract":"  Recent advancements in deep learning for predicting 3D protein structures\nhave shown promise, particularly when leveraging inputs like protein sequences\nand Cryo-Electron microscopy (Cryo-EM) images. However, these techniques often\nfall short when predicting the structures of protein complexes (PCs), which\ninvolve multiple proteins. In our study, we investigate using atomic force\nmicroscopy (AFM) combined with deep learning to predict the 3D structures of\nPCs. AFM generates height maps that depict the PCs in various random\norientations, providing a rich information for training a neural network to\npredict the 3D structures. We then employ the pre-trained UpFusion model (which\nutilizes a conditional diffusion model for synthesizing novel views) to train\nan instance-specific NeRF model for 3D reconstruction. The performance of\nUpFusion is evaluated through zero-shot predictions of 3D protein structures\nusing AFM images. The challenge, however, lies in the time-intensive and\nimpractical nature of collecting actual AFM images. To address this, we use a\nvirtual AFM imaging process that transforms a `PDB' protein file into\nmulti-view 2D virtual AFM images via volume rendering techniques. We\nextensively validate the UpFusion architecture using both virtual and actual\nmulti-view AFM images. Our results include a comparison of structures predicted\nwith varying numbers of views and different sets of views. This novel approach\nholds significant potential for enhancing the accuracy of protein complex\nstructure predictions with further fine-tuning of the UpFusion network.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"qTwtEf_NzRVO9mMmlp1YzfuO5ZgIEyz8egW--ttoM-0","pdfSize":"1195642"}
