{"id":"2408.15166","title":"Black hole-de Sitter model, a proposal for the de Sitter phases","authors":"Ida M. Rasulian","authorsParsed":[["Rasulian","Ida M.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 16:05:32 GMT"}],"updateDate":"2024-08-29","timestamp":1724774732000,"abstract":"  We expand on the braneworld-black hole de Sitter model introduced in\n\\cite{Rasulian} which is a proposal for constructing an effective de Sitter\nspacetime with no explicit dependence on brane tension or bulk cosmological\nconstant. In this model the 4D de Sitter space emerges on a brane near the\nhorizon of a 5D black hole. We study the effective gravity on the brane\nnon-perturbatively, with an approximate Z2 symmetry assumption, up to a\nconformal factor, and find that the evolution of the effective cosmological\nconstant on the brane depends on the flux of energy towards and away from the\nblack hole in the bulk. In this setup the presence of the black hole horizon\nsets the initial condition for the brane's evolution and the brane approaches\nits null configuration with de Sitter length $l\\lesssim l_5$, where $l_5$ is\nthe 5D Planck's length, as soon as the horizon forms. During the last stages of\ncollapse following this phase (or further flux of matter in the bulk after the\nhorizon is formed), the effective de Sitter length on the brane increases due\nto the in-falling flux relatively fast. This phase is tentatively the\ntransition between a low scale inflationary phase and the late dark energy\nphase. Also we observe that the increase in the de Sitter length is accompanied\nwith a flux of energy entering the brane due to the jump in the bulk flux\nacross the brane. Considering the initial state of the brane to be in the $l_5$\nneighborhood of the horizon, the configuration which is slightly below the\nhorizon is Euclidean AdS with AdS radius $l\\lesssim l_5$. This can be\ninterpreted as a boundary proposal for the resulting cosmology.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}