{"id":"2408.09394","title":"GRLinQ: An Intelligent Spectrum Sharing Mechanism for Device-to-Device\n  Communications with Graph Reinforcement Learning","authors":"Zhiwei Shan, Xinping Yi, Le Liang, Chung-Shou Liao, and Shi Jin","authorsParsed":[["Shan","Zhiwei",""],["Yi","Xinping",""],["Liang","Le",""],["Liao","Chung-Shou",""],["Jin","Shi",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 07:39:01 GMT"}],"updateDate":"2024-08-20","timestamp":1723966741000,"abstract":"  Device-to-device (D2D) spectrum sharing in wireless communications is a\nchallenging non-convex combinatorial optimization problem, involving entangled\nlink scheduling and power control in a large-scale network. The\nstate-of-the-art methods, either from a model-based or a data-driven\nperspective, exhibit certain limitations such as the critical need for channel\nstate information (CSI) and/or a large number of (solved) instances (e.g.,\nnetwork layouts) as training samples. To advance this line of research, we\npropose a novel hybrid model/datadriven spectrum sharing mechanism with graph\nreinforcement learning for link scheduling (GRLinQ), injecting information\ntheoretical insights into machine learning models, in such a way that link\nscheduling and power control can be solved in an intelligent yet explainable\nmanner. Through an extensive set of experiments, GRLinQ demonstrates superior\nperformance to the existing model-based and data-driven link scheduling and/or\npower control methods, with a relaxed requirement for CSI, a substantially\nreduced number of unsolved instances as training samples, a possible\ndistributed deployment, reduced online/offline computational complexity, and\nmore remarkably excellent scalability and generalizability over different\nnetwork scenarios and system configurations.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Information Theory","Computing Research Repository/Machine Learning","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}