{"id":"2408.01254","title":"TrIM: Triangular Input Movement Systolic Array for Convolutional Neural\n  Networks -- Part I: Dataflow and Analytical Modelling","authors":"Cristian Sestito, Shady Agwa, Themis Prodromakis","authorsParsed":[["Sestito","Cristian",""],["Agwa","Shady",""],["Prodromakis","Themis",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 13:15:17 GMT"}],"updateDate":"2024-08-05","timestamp":1722604517000,"abstract":"  In order to follow the ever-growing computational complexity and data\nintensity of state-of-the-art AI models, new computing paradigms are being\nproposed. These paradigms aim at achieving high energy efficiency, by\nmitigating the Von Neumann bottleneck that relates to the energy cost of moving\ndata between the processing cores and the memory. Convolutional Neural Networks\n(CNNs) are particularly susceptible to this bottleneck, given the massive data\nthey have to manage. Systolic Arrays (SAs) are promising architectures to\nmitigate the data transmission cost, thanks to high data utilization carried\nout by an array of Processing Elements (PEs). These PEs continuously exchange\nand process data locally based on specific dataflows (like weight stationary\nand row stationary), in turn reducing the number of memory accesses to the main\nmemory. The hardware specialization of SAs can meet different workloads,\nranging from matrix multiplications to multi-dimensional convolutions. In this\npaper, we propose TrIM: a novel dataflow for SAs based on a Triangular Input\nMovement and compatible with CNN computing. When compared to state-of-the-art\nSA dataflows, like weight stationary and row stationary, the high data\nutilization offered by TrIM guarantees ~10x less memory access. Furthermore,\nconsidering that PEs continuously overlap multiplications and accumulations,\nTrIM achieves high throughput (up to 81.8% higher than row stationary), other\nthan requiring a limited number of registers (up to 15.6x fewer registers than\nrow stationary).\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Uagc2VE7nIOvlw_DY7jb1-68GRwyW-mspDh2jm3BiLk","pdfSize":"1917776","txDigest":"7caXMoGHhFAfK5psszhUGXMsXHTnb7kFve4RczYJfWsp","endEpoch":"1","status":"CERTIFIED"}
