{"id":"2408.07937","title":"Microscopic origin of liquid viscosity from unstable localized modes","authors":"Long-Zhou Huang, Bingyu Cui, Vinay Vaibhav, Matteo Baggioli, Yun-Jiang\n  Wang","authorsParsed":[["Huang","Long-Zhou",""],["Cui","Bingyu",""],["Vaibhav","Vinay",""],["Baggioli","Matteo",""],["Wang","Yun-Jiang",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 05:12:27 GMT"}],"updateDate":"2024-08-16","timestamp":1723698747000,"abstract":"  Viscosity is the resistance of a liquid to flow, governed by atomic-scale\nfriction between its constituent atoms. While viscosity can be directly\ncomputed using the Green-Kubo formalism, this method does not fully elucidate\nthe physical mechanisms underlying such momentum transport coefficient. In\nfact, the microscopic origin of liquid viscosity remains poorly understood. In\nthis work, we calculate the viscosity of a $\\mathrm{Cu_{50}Zr_{50}}$ metallic\nliquid and a Kob-Andersen model in a large range of temperatures and compare\nthe results with a theoretical formula based on nonaffine linear response and\ninstantaneous normal mode theory. This analysis reveals that only unstable\nlocalized instantaneous normal modes (ULINMs) contribute to viscosity,\nproviding a microscopic definition of viscosity as diffusive momentum transport\nfacilitated by local structural excitations mediated by ULINMs as precursors.\nLeveraging on the concept of configurational entropy, a quantitative model to\nconnect viscosity with ULINMs is also proposed and validated in both the\nArrhenius and non-Arrhenius regimes. In summary, our work provides a\nmicroscopic definition of liquid viscosity and highlights the fundamental role\nof ULINMs as its building blocks, ultimately opening the path to an\natomic-scale prediction of viscosity in liquids and glasses.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"P1xha4je7yJs0XzKIuixOJFXgIXowp2cURtyVeweZzI","pdfSize":"2808630"}
