{"id":"2408.12225","title":"Combinatorial Auctions without a Numeraire: The Case of Blockchain\n  Trade-Intent Auctions","authors":"Andrea Canidio, Felix Henneke","authorsParsed":[["Canidio","Andrea",""],["Henneke","Felix",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 08:54:55 GMT"}],"updateDate":"2024-08-23","timestamp":1724316895000,"abstract":"  Blockchain trade intent auctions currently intermediate approximately USD 5\nbillion monthly. Due to production complementarities, the auction is\ncombinatorial: when multiple trade intents from different traders are auctioned\noff simultaneously, a bidder (here called solver) can generate additional\nefficiencies by winning a batch of multiple trade intents. However, unlike\nother combinatorial auctions studied in the literature, the auction has no\nnumeraire. Fairness is a concern as the efficiencies from batching cannot be\neasily shared between traders. We formalize this problem and study the most\ncommonly used auction formats: batch auctions and multiple simultaneous\nauctions. We also propose a novel fair combinatorial auction that combines\nbatch auction and multiple simultaneous auctions: solvers submit\nindividual-trade bids and batched bids, but batched bids are considered only if\nthey are better for all traders relative to the outcome of multiple\nsimultaneous auctions (constructed using the individual-trade bids). We find a\ntrade-off between the fairness guarantees provided by the auction (i.e., the\nminimum each trader can expect to receive) and the expected value of the assets\nreturned to the traders. Also, the amount that each trader receives in the\nequilibrium of the fair combinatorial auction may be higher or lower than what\nthey receive in the equilibrium of the simultaneous auctions used as a\nbenchmark for fairness.\n","subjects":["Economics/Theoretical Economics","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Computer Science and Game Theory"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"MbZMI2RFlZjJfKMMziF8SySEbz_9-exWozJBFYZWQ9o","pdfSize":"316779"}
