{"id":"2408.10343","title":"LegalBench-RAG: A Benchmark for Retrieval-Augmented Generation in the\n  Legal Domain","authors":"Nicholas Pipitone, Ghita Houir Alami","authorsParsed":[["Pipitone","Nicholas",""],["Alami","Ghita Houir",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:30:18 GMT"}],"updateDate":"2024-08-21","timestamp":1724092218000,"abstract":"  Retrieval-Augmented Generation (RAG) systems are showing promising potential,\nand are becoming increasingly relevant in AI-powered legal applications.\nExisting benchmarks, such as LegalBench, assess the generative capabilities of\nLarge Language Models (LLMs) in the legal domain, but there is a critical gap\nin evaluating the retrieval component of RAG systems. To address this, we\nintroduce LegalBench-RAG, the first benchmark specifically designed to evaluate\nthe retrieval step of RAG pipelines within the legal space. LegalBench-RAG\nemphasizes precise retrieval by focusing on extracting minimal, highly relevant\ntext segments from legal documents. These highly relevant snippets are\npreferred over retrieving document IDs, or large sequences of imprecise chunks,\nboth of which can exceed context window limitations. Long context windows cost\nmore to process, induce higher latency, and lead LLMs to forget or hallucinate\ninformation. Additionally, precise results allow LLMs to generate citations for\nthe end user. The LegalBench-RAG benchmark is constructed by retracing the\ncontext used in LegalBench queries back to their original locations within the\nlegal corpus, resulting in a dataset of 6,858 query-answer pairs over a corpus\nof over 79M characters, entirely human-annotated by legal experts. We also\nintroduce LegalBench-RAG-mini, a lightweight version for rapid iteration and\nexperimentation. By providing a dedicated benchmark for legal retrieval,\nLegalBench-RAG serves as a critical tool for companies and researchers focused\non enhancing the accuracy and performance of RAG systems in the legal domain.\nThe LegalBench-RAG dataset is publicly available at\nhttps://github.com/zeroentropy-cc/legalbenchrag.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"t_BQjANwVRsmKHJdrMkG-X0Cl1SsndPBIfrAYP8ES4c","pdfSize":"605888"}
