{"id":"2408.09811","title":"Unveiling the Mechanism of Phonon-Polariton Damping in \\alpha-MoO_3","authors":"Javier Taboada-Guti\\'errez, Yixi Zhou, Ana I. F. Tresguerres-Mata,\n  Christian Lanza, Abel Mart\\'inez-Su\\'arez, Gonzalo \\'Alvarez-P\\'erez, Jiahua\n  Duan, Jos\\'e Ignacio Mart\\'in, Mar\\'ia V\\'elez, Iv\\'an Prieto, Adrien\n  Bercher, J\\'er\\'emie Teyssier, Ion Errea, Alexey Y. Nikitin, Javier\n  Mart\\'in-S\\'anchez, Alexey B. Kuzmenko and Pablo Alonso-Gonz\\'alez","authorsParsed":[["Taboada-Gutiérrez","Javier",""],["Zhou","Yixi",""],["Tresguerres-Mata","Ana I. F.",""],["Lanza","Christian",""],["Martínez-Suárez","Abel",""],["Álvarez-Pérez","Gonzalo",""],["Duan","Jiahua",""],["Martín","José Ignacio",""],["Vélez","María",""],["Prieto","Iván",""],["Bercher","Adrien",""],["Teyssier","Jérémie",""],["Errea","Ion",""],["Nikitin","Alexey Y.",""],["Martín-Sánchez","Javier",""],["Kuzmenko","Alexey B.",""],["Alonso-González","Pablo",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 09:02:45 GMT"}],"updateDate":"2024-08-27","timestamp":1724058165000,"abstract":"  Phonon polaritons (PhPs) (light coupled to lattice vibrations) in the highly\nanisotropic polar layered material molybdenum trioxide (\\alpha-MoO_3) are\ncurrently the focus of intense research efforts due to their extreme\nsubwavelength field confinement, directional propagation and unprecedented low\nlosses. Nevertheless, prior research has primarily concentrated on exploiting\nthe squeezing and steering capabilities of \\alpha-MoO_3 PhPs, without inquiring\nmuch into the dominant microscopic mechanism that determines their long\nlifetimes, key for their implementation in nanophotonic applications. This\nstudy delves into the fundamental processes that govern PhP damping in\n\\alpha-MoO_3 by combining ab initio calculations with scattering-type scanning\nnear-field optical microscopy (s-SNOM) and Fourier-transform infrared (FTIR)\nspectroscopy measurements across a broad temperature range (from 8 to 300 K).\nThe remarkable agreement between our theoretical predictions and experimental\nobservations allows us to identify third-order anharmonic phonon-phonon\nscattering as the main damping mechanism of \\alpha-MoO_3 PhPs. These findings\nshed light on the fundamental limits of low-loss PhPs, a crucial factor for\nassessing their implementation into nanophotonic devices.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Fzebtci4fKTFvFOxJqhB8sEHnbfSzhZil6EQNZL0zvk","pdfSize":"780658"}
