{"id":"2408.04071","title":"Trigonometric Moments of a Generalized von Mises Distribution in 2-D\n  Range-Only Tracking","authors":"Nikhil Sharma and Shovan Bhaumik and Ratnasingham Tharmarasa and Thia\n  Kirubarajan","authorsParsed":[["Sharma","Nikhil",""],["Bhaumik","Shovan",""],["Tharmarasa","Ratnasingham",""],["Kirubarajan","Thia",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 20:18:30 GMT"}],"updateDate":"2024-08-09","timestamp":1723061910000,"abstract":"  A 2D range-only tracking scenario is non-trivial due to two main reasons.\nFirst, when the states to be estimated are in Cartesian coordinates, the\nuncertainty region is multi-modal. The second reason is that the probability\ndensity function of azimuth conditioned on range takes the form of a\ngeneralized von Mises distribution, which is hard to tackle. Even in the case\nof implementing a uni-modal Kalman filter, one needs expectations of\ntrigonometric functions of conditional bearing density, which are not available\nin the current literature. We prove that the trigonometric moments (circular\nmoments) of the azimuth density conditioned on range can be computed as an\ninfinite series, which can be sufficiently approximated by relatively few terms\nin summation. The solution can also be generalized to any order of the moments.\n  This important result can provide an accurate depiction of the conditional\nazimuth density in 2D range-only tracking geometries. We also present a simple\noptimization problem that results in deterministic samples of conditional\nazimuth density from the knowledge of its circular moments leading to an\naccurate filtering solution. The results are shown in a two-dimensional\nsimulation, where the range-only sensor platform maneuvers to make the system\nobservable. The results prove that the method is feasible in such applications.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"inljQ9NCR5qy3ztKeDNV4w__JIMlL9ShyJvvaC80HrM","pdfSize":"676114"}
