{"id":"2408.06094","title":"Mapping the longitudinal magnetic field in the atmosphere of an active\n  region plage from the inversion of the near-ultraviolet CLASP2.1\n  spectropolarimetric data","authors":"Hao Li, Tanaus\\'u del Pino Alem\\'an, Javier Trujillo Bueno, Ryohko\n  Ishikawa, Ernest Alsina Ballester, David E. McKenzie, Luca Belluzzi, Donguk\n  Song, Takenori J. Okamoto, Ken Kobayashi, Laurel A. Rachmeler, Christian\n  Bethge, and Fr\\'ed\\'eric Auch\\`ere","authorsParsed":[["Li","Hao",""],["Alemán","Tanausú del Pino",""],["Bueno","Javier Trujillo",""],["Ishikawa","Ryohko",""],["Ballester","Ernest Alsina",""],["McKenzie","David E.",""],["Belluzzi","Luca",""],["Song","Donguk",""],["Okamoto","Takenori J.",""],["Kobayashi","Ken",""],["Rachmeler","Laurel A.",""],["Bethge","Christian",""],["Auchère","Frédéric",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 12:25:25 GMT"}],"updateDate":"2024-08-13","timestamp":1723465525000,"abstract":"  We apply the HanleRT Tenerife Inversion Code to the spectro-polarimetric\nobservations obtained by the Chromospheric LAyer SpectroPolarimeter. This\nsuborbital space experiment measured the variation with wavelength of the four\nStokes parameters in the near-ultraviolet spectral region of the Mg II h & k\nlines over a solar disk area containing part of an active region plage and the\nedge of a sunspot penumbra. We infer the stratification of the temperature, the\nelectron density, the line of-sight velocity, the micro-turbulent velocity, and\nthe longitudinal component of the magnetic field from the observed intensity\nand circular polarization profiles. The inferred model atmosphere shows larger\ntemperature and electron density in the plage and the superpenumbra regions\nthan in the quiet regions. The shape of the plage region in terms of its\nbrightness is similar to the pattern of the inferred longitudinal component of\nthe magnetic field in the chromosphere, as well as to that of the overlying\nmoss observed by AIA in the 171 A band, which suggests a similar magnetic\norigin for the heating in both the plage and the moss region. Moreover, this\nheating is particularly significant in the regions with larger inferred\nmagnetic flux. In contrast, in the superpenumbra, the regions with larger\nelectron density and temperature are usually found in between these regions\nwith larger magnetic flux, suggesting that the details of the heating mechanism\nin the chromosphere of the superpenumbra may be different to those in the\nplage, but with the magnetic field still playing a key role.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"rGruw-C1KPck-1gzqR6Zo50wjV1nM-kuoJoX-QKscdE","pdfSize":"4300434"}
