{"id":"2408.16047","title":"Magic of the Heisenberg Picture","authors":"Neil Dowling and Pavel Kos and Xhek Turkeshi","authorsParsed":[["Dowling","Neil",""],["Kos","Pavel",""],["Turkeshi","Xhek",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-30","timestamp":1724868001000,"abstract":"  Magic quantifies the non-Clifford operations required for preparing a state\non quantum processors and sets bounds on the classical computational complexity\nof simulating quantum dynamics. We study a magic resource theory for operators,\nwhich is dual to that describing states. We identify that the stabilizer\nR\\'enyi entropy analog in operator space is a good magic monotone satisfying\nthe usual conditions, while inheriting efficient computability properties and\nproviding a tight lower-bound to the minimum number of non-Clifford gates in a\ncircuit. It is operationally well-defined as quantifying how well one can\napproximate an operator with one that has only few Pauli strings; analogous to\nthe relation between entanglement entropy and tensor-network truncation. An\nimmediate advantage is that the operator stabilizer entropies exhibit inherent\nlocality through a Lieb-Robinson bound, making them particularly suited for\nstudying local dynamic magic generation in many-body systems. We compute this\nquantity analytically in two distinct regimes. First, we show that random\nevolution or circuits typically have approximately maximal magic in the\nHeisenberg picture for all R\\'enyi indices, and evaluate the Page correction.\nSecond, harnessing both dual unitarity and ZX graphical calculus, we compute\nthe operator stabilizer entropy evolution for an interacting integrable XXZ\ncircuit. In this case, magic quickly saturates to a constant; a distinct\nHeisenberg picture phenomena and suggestive of a connection to integrability.\nWe argue that this efficiently computable operator magic monotone reveals\nstructural properties of many-body magic generation, and can inspire novel\nClifford-assisted tensor network methods.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}