{"id":"2408.11470","title":"A Thorough Comparison Between Independent Cascade and\n  Susceptible-Infected-Recovered Models","authors":"Panfeng Liu and Guoliang Qiu and Biaoshuai Tao and Kuan Yang","authorsParsed":[["Liu","Panfeng",""],["Qiu","Guoliang",""],["Tao","Biaoshuai",""],["Yang","Kuan",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 09:38:41 GMT"}],"updateDate":"2024-08-22","timestamp":1724233121000,"abstract":"  We study cascades in social networks with the independent cascade (IC) model\nand the Susceptible-Infected-recovered (SIR) model. The well-studied IC model\nfails to capture the feature of node recovery, and the SIR model is a variant\nof the IC model with the node recovery feature. In the SIR model, by computing\nthe probability that a node successfully infects another before its recovery\nand viewing this probability as the corresponding IC parameter, the SIR model\nbecomes an \"out-going-edge-correlated\" version of the IC model: the events of\nthe infections along different out-going edges of a node become dependent in\nthe SIR model, whereas these events are independent in the IC model. In this\npaper, we thoroughly compare the two models and examine the effect of this\nextra dependency in the SIR model. By a carefully designed coupling argument,\nwe show that the seeds in the IC model have a stronger influence spread than\ntheir counterparts in the SIR model, and sometimes it can be significantly\nstronger. Specifically, we prove that, given the same network, the same seed\nsets, and the parameters of the two models being set based on the\nabove-mentioned equivalence, the expected number of infected nodes at the end\nof the cascade for the IC model is weakly larger than that for the SIR model,\nand there are instances where this dominance is significant. We also study the\ninfluence maximization problem with the SIR model. We show that the\nabove-mentioned difference in the two models yields different seed-selection\nstrategies, which motivates the design of influence maximization algorithms\nspecifically for the SIR model. We design efficient approximation algorithms\nwith theoretical guarantees by adapting the reverse-reachable-set-based\nalgorithms, commonly used for the IC model, to the SIR model.\n","subjects":["Computing Research Repository/Social and Information Networks","Physics/Physics and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}