{"id":"2408.02733","title":"Quantum simulation of dynamical gauge theories in periodically driven\n  Rydberg atom arrays","authors":"Johannes Feldmeier, Nishad Maskara, Nazl{\\i} U\\u{g}ur\n  K\\\"oyl\\\"uo\\u{g}lu, Mikhail D. Lukin","authorsParsed":[["Feldmeier","Johannes",""],["Maskara","Nishad",""],["Köylüoğlu","Nazlı Uğur",""],["Lukin","Mikhail D.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 18:00:03 GMT"}],"updateDate":"2024-08-07","timestamp":1722880803000,"abstract":"  Simulating quantum dynamics of lattice gauge theories (LGTs) is an exciting\nfrontier in quantum science. Programmable quantum simulators based on neutral\natom arrays are a promising approach to achieve this goal, since strong Rydberg\nblockade interactions can be used to naturally create low energy subspaces that\ncan encode local gauge constraints. However, realizing regimes of LGTs where\nboth matter and gauge fields exhibit significant dynamics requires the presence\nof tunable multi-body interactions such as those associated with ring exchange,\nwhich are challenging to realize directly. Here, we develop a method for\ngenerating such interactions based on time-periodic driving. Our approach\nutilizes controlled deviations from time-reversed trajectories, which are\naccessible in constrained PXP-type models via the application of frequency\nmodulated global pulses. We show that such driving gives rise to a family of\neffective Hamiltonians with multi-body interactions whose strength is\nnon-perturbative in their respective operator weight. We apply this approach to\na two-dimensional U(1) LGT on the Kagome lattice, where we engineer strong\nsix-body magnetic plaquette terms that are tunable relative to the kinetic\nenergy of matter excitations, demonstrating access to previously unexplored\ndynamical regimes. Potential generalizations and prospects for experimental\nimplementations are discussed.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Quantum Gases","Physics/Atomic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}