{"id":"2408.04447","title":"Reinforcement Learning from Human Feedback for Lane Changing of\n  Autonomous Vehicles in Mixed Traffic","authors":"Yuting Wang, Lu Liu, Maonan Wang and Xi Xiong","authorsParsed":[["Wang","Yuting",""],["Liu","Lu",""],["Wang","Maonan",""],["Xiong","Xi",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 13:18:53 GMT"}],"updateDate":"2024-08-09","timestamp":1723123133000,"abstract":"  The burgeoning field of autonomous driving necessitates the seamless\nintegration of autonomous vehicles (AVs) with human-driven vehicles, calling\nfor more predictable AV behavior and enhanced interaction with human drivers.\nHuman-like driving, particularly during lane-changing maneuvers on highways, is\na critical area of research due to its significant impact on safety and traffic\nflow. Traditional rule-based decision-making approaches often fail to\nencapsulate the nuanced boundaries of human behavior in diverse driving\nscenarios, while crafting reward functions for learning-based methods\nintroduces its own set of complexities. This study investigates the application\nof Reinforcement Learning from Human Feedback (RLHF) to emulate human-like\nlane-changing decisions in AVs. An initial RL policy is pre-trained to ensure\nsafe lane changes. Subsequently, this policy is employed to gather data, which\nis then annotated by humans to train a reward model that discerns lane changes\naligning with human preferences. This human-informed reward model supersedes\nthe original, guiding the refinement of the policy to reflect human-like\npreferences. The effectiveness of RLHF in producing human-like lane changes is\ndemonstrated through the development and evaluation of conservative and\naggressive lane-changing models within obstacle-rich environments and mixed\nautonomy traffic scenarios. The experimental outcomes underscore the potential\nof RLHF to diversify lane-changing behaviors in AVs, suggesting its viability\nfor enhancing the integration of AVs into the fabric of human-driven traffic.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}