{"id":"2408.14827","title":"Generative-AI for AI/ML Model Adaptive Retraining in Beyond 5G Networks","authors":"Venkateswarlu Gudepu, Bhargav Chirumamilla, Venkatarami Reddy\n  Chintapalli, Piero Castoldi, Luca Valcarenghi, Bheemarjuna Reddy Tamma and\n  Koteswararao Kondepu","authorsParsed":[["Gudepu","Venkateswarlu",""],["Chirumamilla","Bhargav",""],["Chintapalli","Venkatarami Reddy",""],["Castoldi","Piero",""],["Valcarenghi","Luca",""],["Tamma","Bheemarjuna Reddy",""],["Kondepu","Koteswararao",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 07:15:05 GMT"}],"updateDate":"2024-08-28","timestamp":1724742905000,"abstract":"  Beyond fifth-generation (B5G) networks aim to support high data rates,\nlow-latency applications, and massive machine communications. Artificial\nIntelligence/Machine Learning (AI/ML) can help to improve B5G network\nperformance and efficiency. However, dynamic service demands of B5G use cases\ncause AI/ML model performance degradation, resulting in Service Level\nAgreements (SLA) violations, over- or under-provisioning of resources, etc.\nRetraining is essential to address the performance degradation of the AI/ML\nmodels. Existing threshold and periodic retraining approaches have potential\ndisadvantages, such as SLA violations and inefficient resource utilization for\nsetting a threshold parameter in a dynamic environment. This paper proposes a\nnovel approach that predicts when to retrain AI/ML models using Generative\nArtificial Intelligence. The proposed predictive approach is evaluated for a\nQuality of Service Prediction use case on the Open Radio Access Network (O-RAN)\nSoftware Community platform and compared to the predictive approach based on\nthe classifier and a threshold approach. Also, a realtime dataset from the\nColosseum testbed is considered to evaluate Network Slicing (NS) use case with\nthe proposed predictive approach. The results show that the proposed predictive\napproach outperforms both the classifier-based predictive and threshold\napproaches.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}