{"id":"2408.01199","title":"Pre-processing and quality control of large clinical CT head datasets\n  for intracranial arterial calcification segmentation","authors":"Benjamin Jin, Maria del C. Vald\\'es Hern\\'andez, Alessandro\n  Fontanella, Wenwen Li, Eleanor Platt, Paul Armitage, Amos Storkey, Joanna M.\n  Wardlaw and Grant Mair","authorsParsed":[["Jin","Benjamin",""],["Hernández","Maria del C. Valdés",""],["Fontanella","Alessandro",""],["Li","Wenwen",""],["Platt","Eleanor",""],["Armitage","Paul",""],["Storkey","Amos",""],["Wardlaw","Joanna M.",""],["Mair","Grant",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 11:27:25 GMT"}],"updateDate":"2024-08-05","timestamp":1722598045000,"abstract":"  As a potential non-invasive biomarker for ischaemic stroke, intracranial\narterial calcification (IAC) could be used for stroke risk assessment on CT\nhead scans routinely acquired for other reasons (e.g. trauma, confusion).\nArtificial intelligence methods can support IAC scoring, but they have not yet\nbeen developed for clinical imaging. Large heterogeneous clinical CT datasets\nare necessary for the training of such methods, but they exhibit expected and\nunexpected data anomalies. Using CTs from a large clinical trial, the third\nInternational Stroke Trial (IST-3), we propose a pipeline that uses as input\nnon-enhanced CT scans to output regions of interest capturing selected large\nintracranial arteries for IAC scoring. Our method uses co-registration with\ntemplates. We focus on quality control, using information presence along the\nz-axis of the imaging to group and apply similarity measures (structural\nsimilarity index measure) to triage assessment of individual image series.\nAdditionally, we propose superimposing thresholded binary masks of the series\nto inspect large quantities of data in parallel. We identify and exclude\nunrecoverable samples and registration failures. In total, our pipeline\nprocesses 10,659 CT series, rejecting 4,322 (41%) in the entire process, 1,450\n(14% of the total) during quality control, and outputting 6,337 series. Our\npipeline enables effective and efficient region of interest localisation for\ntargeted IAC segmentation.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eaiGpBH4ZUR8xZRyZyYVYfLYaPigxULx7aRBUm1yJXU","pdfSize":"6175467","txDigest":"8vgcDupYcUrqVxCgxVGbQf3tuhA28tpba5xeAjoEQtko","endEpoch":"1","status":"CERTIFIED"}
