{"id":"2408.09050","title":"On the Density of Low Lying Zeros of a Large Family of Automorphic\n  $L$-functions","authors":"Timothy Cheek, Pico Gilman, Kareem Jaber, Steven J. Miller, and\n  Marie-H\\'el\\`ene Tom\\'e","authorsParsed":[["Cheek","Timothy",""],["Gilman","Pico",""],["Jaber","Kareem",""],["Miller","Steven J.",""],["Tomé","Marie-Hélène",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 23:38:00 GMT"}],"updateDate":"2024-08-20","timestamp":1723851480000,"abstract":"  Under the generalized Riemann Hypothesis (GRH), Baluyot, Chandee, and Li\nnearly doubled the range in which the density of low lying zeros predicted by\nKatz and Sarnak is known to hold for a large family of automorphic\n$L$-functions with orthogonal symmetry. We generalize their main techniques to\nthe study of higher centered moments of the one-level density of this family,\nleading to better results on the behavior near the central point. Numerous\ntechnical obstructions emerge that are not present in the one-level density.\nAveraging over the level of the forms and assuming GRH, we prove the density\npredicted by Katz and Sarnak holds for the $n$-th centered moments for test\nfunctions whose Fourier transform is compactly supported in $(-\\sigma, \\sigma)$\nfor $\\sigma~=~\\min\\left\\{3/2(n-1), 4/(2n-\\mathbf{1}_{2\\nmid n})\\right\\}$. For\n$n=3$, our results improve the previously best known $\\sigma=2/3$ to\n$\\sigma=3/4$. We also prove the two-level density agrees with the Katz-Sarnak\ndensity conjecture for test functions whose Fourier transform is compactly\nsupported in $\\sigma_1 = 3/2$ and $\\sigma_2 = 5/6$, respectively, extending the\nprevious best known sum of supports $\\sigma_1 + \\sigma_2 = 2$. This work is the\nfirst evidence of an interesting new phenomenon: by taking different test\nfunctions, we are able to extend the range in which the Katz-Sarnak density\npredictions hold. The techniques we develop can be applied to understanding\nquantities related to this family containing sums over multiple primes.\n","subjects":["Mathematics/Number Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}