{"id":"2408.03943","title":"Building Machines that Learn and Think with People","authors":"Katherine M. Collins, Ilia Sucholutsky, Umang Bhatt, Kartik Chandra,\n  Lionel Wong, Mina Lee, Cedegao E. Zhang, Tan Zhi-Xuan, Mark Ho, Vikash\n  Mansinghka, Adrian Weller, Joshua B. Tenenbaum, Thomas L. Griffiths","authorsParsed":[["Collins","Katherine M.",""],["Sucholutsky","Ilia",""],["Bhatt","Umang",""],["Chandra","Kartik",""],["Wong","Lionel",""],["Lee","Mina",""],["Zhang","Cedegao E.",""],["Zhi-Xuan","Tan",""],["Ho","Mark",""],["Mansinghka","Vikash",""],["Weller","Adrian",""],["Tenenbaum","Joshua B.",""],["Griffiths","Thomas L.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 02:42:45 GMT"}],"updateDate":"2024-08-09","timestamp":1721616165000,"abstract":"  What do we want from machine intelligence? We envision machines that are not\njust tools for thought, but partners in thought: reasonable, insightful,\nknowledgeable, reliable, and trustworthy systems that think with us. Current\nartificial intelligence (AI) systems satisfy some of these criteria, some of\nthe time. In this Perspective, we show how the science of collaborative\ncognition can be put to work to engineer systems that really can be called\n``thought partners,'' systems built to meet our expectations and complement our\nlimitations. We lay out several modes of collaborative thought in which humans\nand AI thought partners can engage and propose desiderata for human-compatible\nthought partnerships. Drawing on motifs from computational cognitive science,\nwe motivate an alternative scaling path for the design of thought partners and\necosystems around their use through a Bayesian lens, whereby the partners we\nconstruct actively build and reason over models of the human and world.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}