{"id":"2408.14067","title":"Active Search for Low-altitude UAV Sensing and Communication for Users\n  at Unknown Locations","authors":"Yuanshuai Zheng and Junting Chen","authorsParsed":[["Zheng","Yuanshuai",""],["Chen","Junting",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 07:48:16 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 03:22:44 GMT"},{"version":"v3","created":"Thu, 29 Aug 2024 09:44:03 GMT"},{"version":"v4","created":"Mon, 2 Sep 2024 02:16:12 GMT"}],"updateDate":"2024-09-04","timestamp":1724658496000,"abstract":"  This paper studies optimal unmanned aerial vehicle (UAV) placement to ensure\nline-of-sight (LOS) communication and sensing for a cluster of ground users\npossibly in deep shadow, while the UAV maintains backhaul connectivity with a\nbase station (BS). The key challenges include unknown user locations, uncertain\nchannel model parameters, and unavailable urban structure. Addressing these\nchallenges, this paper focuses on developing an efficient online search\nstrategy which jointly estimates channels, guides UAV positioning, and\noptimizes resource allocation. Analytically exploiting the geometric properties\nof the equipotential surface, this paper develops an LOS discovery trajectory\non the equipotential surface while the closed-form search directions are\ndetermined using perturbation theory. Since the explicit expression of the\nequipotential surface is not available, this paper proposes to locally\nconstruct a channel model for each user in the LOS regime utilizing polynomial\nregression without depending on user locations or propagation distance. A class\nof spiral trajectories to simultaneously construct the LOS channels and search\non the equipotential surface is developed. An optimal radius of the spiral and\nan optimal measurement pattern for channel gain estimation are derived to\nminimize the mean squared error (MSE) of the locally constructed channel.\nNumerical results on real 3D city maps demonstrate that the proposed scheme\nachieves over 94% of the performance of a 3D exhaustive search scheme with just\na 3-kilometer search.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}