{"id":"2408.10732","title":"Robust self-testing of the $m-$partite maximally entangled state and\n  observables","authors":"Ritesh K. Singh, Souradeep Sasmal and A. K. Pan","authorsParsed":[["Singh","Ritesh K.",""],["Sasmal","Souradeep",""],["Pan","A. K.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 11:03:37 GMT"}],"updateDate":"2024-08-21","timestamp":1724151817000,"abstract":"  As quantum technologies continue to advance rapidly, the device-independent\ntesting of the functioning of a quantum device has become increasingly\nimportant. Self-testing, a correlation based protocol, enables such\ncertification of a promised quantum state as well as measurements performed on\nit without requiring knowledge of the device's internal workings. This approach\ntypically relies on achieving the optimal quantum violation of a suitable Bell\ninequality. Self-testing has been extensively investigated in the context of\nbipartite Bell experiments. However, its extension to multipartite scenarios\nremains largely unexplored, owing to the intricate nature of multipartite\nquantum correlations. In this work, we propose a simple and efficient\nself-testing protocol that certifies the state and observables based on the\noptimal quantum violation of the Svetlichny inequality involving an arbitrary\nnumber of parties, each with two inputs. Our method leverages an elegant\nsum-of-squares approach to derive the optimal quantum value of the Svetlichny\nfunctional, devoid of assuming the dimension of the quantum system. This\nenables the self-testing of the $m-$partite maximally entangled state and local\nanti-commuting observables for each party. Moreover, we develop a swap circuit\nisometry to assess the proximity of reference states and measurements to their\nideal counterparts in the presence of noise and imperfections in real\nexperiments, thereby demonstrating the robustness of our self-testing protocol.\nFinally, we illustrate how our self-testing protocol facilitates the generation\nof certified genuine randomness from correlations that enable the optimal\nviolation of the Svetlichny inequality.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"14OW8_uiDveo9Qk4T4eOsRYQJ4Cj2JCQ-2r7x-IRut4","pdfSize":"508934"}
