{"id":"2408.16404","title":"On the physical and mathematical foundations of quantum physics via\n  functional integrals","authors":"Giampiero Esposito, Tepper L. Gill","authorsParsed":[["Esposito","Giampiero",""],["Gill","Tepper L.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 10:03:46 GMT"}],"updateDate":"2024-08-30","timestamp":1724925826000,"abstract":"  In order to preserve the leading role of the action principle in formulating\nall field theories one needs quantum field theory, with the associated BRST\nsymmetry, and Feynman-DeWitt-Faddeev-Popov ghost fields. Such fields result\nfrom the fibre-bundle structure of the space of histories, but the\nphysics-oriented literature used them formally because a rigorous theory of\nmeasure and integration was lacking. Motivated by this framework, this paper\nexploits previous work of Gill and Zachary, where the use of Banach spaces for\nthe Feynman integral was proposed. The Henstock-Kurzweil integral is first\nintroduced, because it makes it possible to integrate functions like the\nexponential of (i times x squared). The Lebesgue measure on R(infinity) is then\nbuilt and used to define the measure on every separable Hilbert space. The\nsubsequent step is the construction of a new Hilbert space KS2, which contains\nsquare-integrable functions on R**n as a continuous dense embedding, and\ncontains both the test functions and their dual, the Schwartz space of\ndistributions, as continuous embeddings. This space allows us to construct the\nFeynman path integral in a manner that maintains its intuitive and\ncomputational advantages. We also extend this space to KS2[H], where H is any\nseparable Banach space. Last, the existence of a unique universal definition of\ntime, tau(h), that we call historical time, is proved. We use tau(h) as the\norder parameter for our construction of Feynman's time ordered operator\ncalculus, which in turn is used to extend the path integral in order to include\nall time dependent groups and semigroups with a kernel.\n","subjects":["Physics/High Energy Physics - Theory","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}