{"id":"2408.08924","title":"Prefix Guidance: A Steering Wheel for Large Language Models to Defend\n  Against Jailbreak Attacks","authors":"Jiawei Zhao, Kejiang Chen, Xiaojian Yuan, Weiming Zhang","authorsParsed":[["Zhao","Jiawei",""],["Chen","Kejiang",""],["Yuan","Xiaojian",""],["Zhang","Weiming",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 14:51:32 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 17:21:34 GMT"}],"updateDate":"2024-08-23","timestamp":1723733492000,"abstract":"  In recent years, the rapid development of large language models (LLMs) has\nachieved remarkable performance across various tasks. However, research\nindicates that LLMs are vulnerable to jailbreak attacks, where adversaries can\ninduce the generation of harmful content through meticulously crafted prompts.\nThis vulnerability poses significant challenges to the secure use and promotion\nof LLMs. Existing defense methods offer protection from different perspectives\nbut often suffer from insufficient effectiveness or a significant impact on the\nmodel's capabilities. In this paper, we propose a plug-and-play and\neasy-to-deploy jailbreak defense framework, namely Prefix Guidance (PG), which\nguides the model to identify harmful prompts by directly setting the first few\ntokens of the model's output. This approach combines the model's inherent\nsecurity capabilities with an external classifier to defend against jailbreak\nattacks. We demonstrate the effectiveness of PG across three models and five\nattack methods. Compared to baselines, our approach is generally more effective\non average. Additionally, results on the Just-Eval benchmark further confirm\nPG's superiority to preserve the model's performance. our code is available at\nhttps://github.com/weiyezhimeng/Prefix-Guidance.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}