{"id":"2408.06189","title":"The Planck SZiFi catalogues: a new set of Planck catalogues of\n  Sunyaev-Zeldovich-detected galaxy clusters","authors":"\\'I\\~nigo Zubeldia, Jean-Baptiste Melin, Jens Chluba and Richard\n  Battye","authorsParsed":[["Zubeldia","Íñigo",""],["Melin","Jean-Baptiste",""],["Chluba","Jens",""],["Battye","Richard",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 14:40:09 GMT"}],"updateDate":"2024-08-13","timestamp":1723473609000,"abstract":"  We introduce the Planck SZiFi catalogues, a new set of 10 catalogues of\ngalaxy clusters detected through their thermal Sunyaev-Zeldovich (tSZ)\nsignature. The catalogues are produced by applying the SZiFi cluster finder to\nthe Planck PR3 temperature data down to a signal-to-noise threshold of 5. They\nspan three frequency channel combinations (100-857 GHz, 100-545 GHz, and\n100-353 GHz) and 7 of them are constructed by spectrally deprojecting the\nCosmic Infrared Background (CIB). This approach allows us, for the first time\nin the context of cluster finding, to carefully assess the impact of the\ncluster-correlated CIB on the recovered cluster tSZ observables, which we find\nto be negligible. In addition, we quantify the impact of the relativistic\ncorrections to the tSZ signal, finding them to be at the 5-10% level for the\ncluster tSZ amplitude but negligible for the signal-to-noise. We compile our\ncatalogues into a single Planck SZiFi master catalogue containing a total of\n1499 detections. We cross-match the master catalogue with several external tSZ\nand X-ray cluster catalogues, setting a lower bound on the purity of our\nbaseline catalogue of 95% and 99% at a minimum signal-to-noise of 5 and 6,\nrespectively. We validate our cluster detection pipeline by applying it to\nsynthetic observations, recovering cluster number counts for which we are able\nto produce a theoretical prediction that accurately describes them. This\nvalidation exercise indicates that our catalogues are well-suited for\ncosmological inference. The Planck SZiFi master catalogue will become publicly\navailable at\ngithub.com/inigozubeldia/szifi/tree/main/planck_szifi_master_catalogue.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}