{"id":"2408.08489","title":"DFT-Based Adversarial Attack Detection in MRI Brain Imaging: Enhancing\n  Diagnostic Accuracy in Alzheimer's Case Studies","authors":"Mohammad Hossein Najafi, Mohammad Morsali, Mohammadmahdi Vahediahmar,\n  Saeed Bagheri Shouraki","authorsParsed":[["Najafi","Mohammad Hossein",""],["Morsali","Mohammad",""],["Vahediahmar","Mohammadmahdi",""],["Shouraki","Saeed Bagheri",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 02:18:23 GMT"}],"updateDate":"2024-08-19","timestamp":1723774703000,"abstract":"  Recent advancements in deep learning, particularly in medical imaging, have\nsignificantly propelled the progress of healthcare systems. However, examining\nthe robustness of medical images against adversarial attacks is crucial due to\ntheir real-world applications and profound impact on individuals' health. These\nattacks can result in misclassifications in disease diagnosis, potentially\nleading to severe consequences. Numerous studies have explored both the\nimplementation of adversarial attacks on medical images and the development of\ndefense mechanisms against these threats, highlighting the vulnerabilities of\ndeep neural networks to such adversarial activities. In this study, we\ninvestigate adversarial attacks on images associated with Alzheimer's disease\nand propose a defensive method to counteract these attacks. Specifically, we\nexamine adversarial attacks that employ frequency domain transformations on\nAlzheimer's disease images, along with other well-known adversarial attacks.\nOur approach utilizes a convolutional neural network (CNN)-based autoencoder\narchitecture in conjunction with the two-dimensional Fourier transform of\nimages for detection purposes. The simulation results demonstrate that our\ndetection and defense mechanism effectively mitigates several adversarial\nattacks, thereby enhancing the robustness of deep neural networks against such\nvulnerabilities.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Cryptography and Security","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}