{"id":"2408.05398","title":"PersonViT: Large-scale Self-supervised Vision Transformer for Person\n  Re-Identification","authors":"Bin Hu and Xinggang Wang and Wenyu Liu","authorsParsed":[["Hu","Bin",""],["Wang","Xinggang",""],["Liu","Wenyu",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 01:35:06 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 11:50:29 GMT"}],"updateDate":"2024-08-21","timestamp":1723253706000,"abstract":"  Person Re-Identification (ReID) aims to retrieve relevant individuals in\nnon-overlapping camera images and has a wide range of applications in the field\nof public safety. In recent years, with the development of Vision Transformer\n(ViT) and self-supervised learning techniques, the performance of person ReID\nbased on self-supervised pre-training has been greatly improved. Person ReID\nrequires extracting highly discriminative local fine-grained features of the\nhuman body, while traditional ViT is good at extracting context-related global\nfeatures, making it difficult to focus on local human body features. To this\nend, this article introduces the recently emerged Masked Image Modeling (MIM)\nself-supervised learning method into person ReID, and effectively extracts\nhigh-quality global and local features through large-scale unsupervised\npre-training by combining masked image modeling and discriminative contrastive\nlearning, and then conducts supervised fine-tuning training in the person ReID\ntask. This person feature extraction method based on ViT with masked image\nmodeling (PersonViT) has the good characteristics of unsupervised, scalable,\nand strong generalization capabilities, overcoming the problem of difficult\nannotation in supervised person ReID, and achieves state-of-the-art results on\npublicly available benchmark datasets, including MSMT17, Market1501,\nDukeMTMC-reID, and Occluded-Duke. The code and pre-trained models of the\nPersonViT method are released at \\url{https://github.com/hustvl/PersonViT} to\npromote further research in the person ReID field.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LqttwkpI2hQzTueq-i67bImIVgNCJmSaJqgqrEMBipM","pdfSize":"1008994"}
