{"id":"2408.14847","title":"Intraoperative Glioma Segmentation with YOLO + SAM for Improved Accuracy\n  in Tumor Resection","authors":"Samir Kassam, Angelo Markham, Katie Vo, Yashas Revanakara, Michael\n  Lam, Kevin Zhu","authorsParsed":[["Kassam","Samir",""],["Markham","Angelo",""],["Vo","Katie",""],["Revanakara","Yashas",""],["Lam","Michael",""],["Zhu","Kevin",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 07:58:08 GMT"}],"updateDate":"2024-08-28","timestamp":1724745488000,"abstract":"  Gliomas, a common type of malignant brain tumor, present significant surgical\nchallenges due to their similarity to healthy tissue. Preoperative Magnetic\nResonance Imaging (MRI) images are often ineffective during surgery due to\nfactors such as brain shift, which alters the position of brain structures and\ntumors. This makes real-time intraoperative MRI (ioMRI) crucial, as it provides\nupdated imaging that accounts for these shifts, ensuring more accurate tumor\nlocalization and safer resections. This paper presents a deep learning pipeline\ncombining You Only Look Once Version 8 (YOLOv8) and Segment Anything Model\nVision Transformer-base (SAM ViT-b) to enhance glioma detection and\nsegmentation during ioMRI. Our model was trained using the Brain Tumor\nSegmentation 2021 (BraTS 2021) dataset, which includes standard magnetic\nresonance imaging (MRI) images, and noise-augmented MRI images that simulate\nioMRI images. Noised MRI images are harder for a deep learning pipeline to\nsegment, but they are more representative of surgical conditions. Achieving a\nDice Similarity Coefficient (DICE) score of 0.79, our model performs comparably\nto state-of-the-art segmentation models tested on noiseless data. This\nperformance demonstrates the model's potential to assist surgeons in maximizing\ntumor resection and improving surgical outcomes.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hzHPTv2SeXTlFrBguDLulaaAikSJCFSs0TP0A22eB5g","pdfSize":"421712"}
