{"id":"2408.16996","title":"Ultra-rapid, Quantitative, Label-free Antibiotic Susceptibility Testing\n  via Optically Detected Purine Metabolites","authors":"Ranjith Premasiri, Allen Fraiman, Lawrence Ziegler","authorsParsed":[["Premasiri","Ranjith",""],["Fraiman","Allen",""],["Ziegler","Lawrence",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 04:00:12 GMT"}],"updateDate":"2024-09-02","timestamp":1724990412000,"abstract":"  There is an urgent need for the development of novel and truly rapid (equal\nor less than 1 hour) antibiotic susceptibility testing (AST) platforms in order\nto provide best antimicrobial prescribing practices and to help reduce the\nincreasing global threat of antibiotic resistance. A 785 nm surface enhanced\nRaman spectroscopy (SERS) based phenotypic methodology is described that\nresults in accurate minimum inhibitory concentration (MIC) determinations for\nall tested strain-antibiotic pairs. The SERS-AST procedure results in accurate\nMICs, the key quantitative measure of in vitro drug susceptibility, in 1 hour,\nincluding a 30-minute incubation period. The method is effective for both Gram\npositive and negative species, and for antibiotics with different initial\nprimary targets of antibiotic activity, and for both bactericidal and\nbacteriostatic antibiotics. The molecular level mechanism of this methodology\nis described. Bacterial SERS spectra are due to secreted purine nucleotide\ndegradation products (principally adenine, guanine, xanthine and hypoxanthine)\nresulting from water washing induced bacterial stringent response and the\nresulting (p)ppGpp alarmone mediates nucleobase formation from unneeded tRNA\nand rRNA. The rewiring of metabolic responses resulting from the secondary\nmetabolic effects of antibiotic exposure during the 30-minute incubation period\naccounts for the dose dependence of the SERS spectral intensities which are\nused to accurately yield the MIC. This is the fastest demonstrated AST method\nyielding MICs.\n","subjects":["Quantitative Biology/Subcellular Processes"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}