{"id":"2408.05295","title":"Tuning the spin dynamics and magnetic phase transitions of the Cantor\n  alloy via composition and sample processing protocols: A muon spin relaxation\n  study","authors":"Emma Zappala, Timothy A. Elmslie, Gerald D. Morris, Mark W. Meisel,\n  R\\'emi Dingreville, James J. Hamlin, and Benjamin A. Frandsen","authorsParsed":[["Zappala","Emma",""],["Elmslie","Timothy A.",""],["Morris","Gerald D.",""],["Meisel","Mark W.",""],["Dingreville","Rémi",""],["Hamlin","James J.",""],["Frandsen","Benjamin A.",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 18:44:06 GMT"}],"updateDate":"2024-08-13","timestamp":1723229046000,"abstract":"  CrMnFeCoNi, also called the Cantor alloy, is a well-known high-entropy alloy\nwhose magnetic properties have recently become a focus of attention. We present\na detailed muon spin relaxation study of the influence of chemical composition\nand sample processing protocols on the magnetic phase transitions and spin\ndynamics of several different Cantor alloy samples. Specific samples studied\ninclude a pristine equiatomic sample, samples with deficient and excess Mn\ncontent, and equiatomic samples magnetized in a field of 9 T or plastically\ndeformed in pressures up to 0.5 GPa. The results confirm the sensitive\ndependence of the transition temperature on composition and demonstrate that\npost-synthesis pressure treatments cause the transition to become significantly\nless homogeneous throughout the sample volume. In addition, we observe critical\nspin dynamics in the vicinity of the transition in all samples, reminiscent of\ncanonical spin glasses and magnetic materials with ideal continuous phase\ntransitions. Application of an external magnetic field suppresses the critical\ndynamics in the Mn-deficient sample, while the equiatomic and Mn-rich samples\nshow more robust critical dynamics. The spin-flip thermal activation energy in\nthe paramagnetic phase increases with Mn content, ranging from $3.1(3) \\times\n10^{-21}$ J for 0% Mn to $1.2(2) \\times 10^{-20}$ J for 30% Mn content. These\nresults shed light on critical magnetic behavior in environments of extreme\nchemical disorder and demonstrate the tunability of spin dynamics in the Cantor\nalloy via chemical composition and sample processing.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}