{"id":"2408.00459","title":"Microwave resonator-enabled broadband on-chip electro-optic frequency\n  comb generation","authors":"Zhaoxi Chen, Yiwen Zhang, Hanke Feng, Yuansong Zeng, Ke Zhang, and\n  Cheng Wang","authorsParsed":[["Chen","Zhaoxi",""],["Zhang","Yiwen",""],["Feng","Hanke",""],["Zeng","Yuansong",""],["Zhang","Ke",""],["Wang","Cheng",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 11:02:02 GMT"}],"updateDate":"2024-08-02","timestamp":1722510122000,"abstract":"  Optical frequency combs play a crucial role in optical communications,\ntime-frequency metrology, precise ranging, and sensing. Among various\ngeneration schemes, resonant electro-optic combs are particularly attractive\nfor its excellent stability, flexibility and broad bandwidths. In this\napproach, an optical pump undergoes multiple electro-optic modulation processes\nin a high-Q optical resonator, resulting in cascaded spectral sidebands.\nHowever, most resonant electro-optic combs to date make use of lumped-capacitor\nelectrodes with relatively inefficient utilization of the input electrical\npower. This design also reflects most electrical power back to the driving\ncircuits and necessitates costly RF isolators in between, presenting\nsubstantial challenges in practical applications. To address these issues, we\npresent an RF circuit friendly electro-optic frequency comb generator\nincorporated with on-chip coplanar microwave resonator electrodes, based on a\nthin-film lithium niobate platform. Our design achieves more than three times\nelectrical power reduction with minimal reflection at the designed comb\nrepetition rate of ~ 25 GHz. We experimentally demonstrate broadband\nelectro-optic frequency comb generation with a comb span of >85 nm at a\nmoderate electrical driving power of 740 mW (28.7 dBm). Our power-efficient and\nisolator-free electro-optic comb source could offer compact, low-cost and\nsimple-to-design solution for applications in spectroscopy, high-precise\nmetrology, optical communications.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YED6dOQ08n01iaNtbjBDVP-erqdjnE6BclwYepPF1TM","pdfSize":"17834507"}
