{"id":"2408.08069","title":"Integrated population model reveals human and environment driven changes\n  in Baltic ringed seal (Pusa hispida botnica) demography and behavior","authors":"Murat Ersalman, Mervi Kunnasranta, Markus Ahola, Anja M. Carlsson,\n  Sara Persson, Britt-Marie B\\\"acklin, Inari Helle, Linnea Cervin, Jarno\n  Vanhatalo","authorsParsed":[["Ersalman","Murat",""],["Kunnasranta","Mervi",""],["Ahola","Markus",""],["Carlsson","Anja M.",""],["Persson","Sara",""],["Bäcklin","Britt-Marie",""],["Helle","Inari",""],["Cervin","Linnea",""],["Vanhatalo","Jarno",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 10:34:23 GMT"}],"updateDate":"2024-08-16","timestamp":1723718063000,"abstract":"  Integrated population models (IPMs) are a promising approach to test\necological theories and assess wildlife populations in dynamic and uncertain\nconditions. By combining multiple data sources into a single, unified model,\nthey enable the parametrization of versatile, mechanistic models that can\npredict population dynamics in novel circumstances. Here, we present a Bayesian\nIPM for the ringed seal (Pusa hispida botnica) population inhabiting the\nBothnian Bay in the Baltic Sea. Despite the availability of long-term\nmonitoring data, traditional assessment methods have faltered due to dynamic\nenvironmental conditions, varying reproductive rates, and the recently\nre-introduced hunting, thus limiting the quality of information available to\nmanagers. We fit our model to census and various demographic, reproductive and\nharvest data from 1988 to 2023 to provide a comprehensive assessment of past\npopulation trends, and predict population response to alternative hunting\nscenarios. We estimated that 20,000 to 36,000 ringed seals inhabit the Bothnian\nBay, and the population is increasing 3% to 6% per year. Reproductive rates\nhave increased since 1988, leading to a substantial increase in the growth rate\nup until 2015. However, the re-introduction of hunting has since reduced the\ngrowth rate, and even minor quota increases are likely to reduce it further.\nOur results also support the hypothesis that a greater proportion of seals\nhaul-out under lower ice cover circumstances, leading to higher aerial survey\ncounts in such years. In general, our study demonstrates the value of IPMs for\nmonitoring natural populations under changing environments, and supporting\nscience-based management decisions.\n","subjects":["Quantitative Biology/Populations and Evolution","Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}