{"id":"2408.02370","title":"Identifying influential node groups in networks with core-periphery\n  structure","authors":"Gyuho Bae, Philip A. Knight, and Young-Ho Eom","authorsParsed":[["Bae","Gyuho",""],["Knight","Philip A.",""],["Eom","Young-Ho",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 10:43:53 GMT"}],"updateDate":"2024-08-06","timestamp":1722854633000,"abstract":"  Identifying influential spreaders is a crucial problem for practical\napplications in network science. The core-periphery(C-P) structure, common in\nmany real-world networks, comprises a densely interconnected group of\nnodes(core) and the rest of the sparsely connected nodes subordinated to the\ncore(periphery). Core nodes are expected to be more influential than periphery\nnodes generally, but recent studies suggest that this is not the case in some\nnetworks. In this work, we look for mesostructural conditions that arise when\ncore nodes are significantly more influential than periphery nodes. In\nparticular, we investigate the roles of the internal and external connectivity\nof cores in their relative influence. We observe that the internal and external\nconnectivity of cores are broadly distributed, and the relative influence of\nthe cores is also broadly distributed in real-world networks. Our key finding\nis that the internal connectivity of cores is positively correlated with their\nrelative influence, whereas the relative influence increases up to a certain\nvalue of the external connectivity and decreases thereafter. Finally, results\nfrom the model-generated networks clarify the observations from the real-world\nnetworks. Our findings provide a structural condition for influential cores in\nnetworks and shed light on why some cores are influential and others are not.\n","subjects":["Physics/Physics and Society","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hkjTsNjHyIBxGd64rhAI_CZiKBlloLT9vrbKKTs75rs","pdfSize":"4909785","txDigest":"BNk61MUYEHR1PQK8AgNhNZzBfsnH61VbrbCrCF9GK48w","endEpoch":"1","status":"CERTIFIED"}
