{"id":"2408.09708","title":"AXPs/SGRs: strange stars with crusts?","authors":"Guojun Qiao, Lunhua Shang, Renxin Xu, Kejia Lee, Yongquan Xue, Qijun\n  Zhi, Jiguang Lu, Juntao Bai","authorsParsed":[["Qiao","Guojun",""],["Shang","Lunhua",""],["Xu","Renxin",""],["Lee","Kejia",""],["Xue","Yongquan",""],["Zhi","Qijun",""],["Lu","Jiguang",""],["Bai","Juntao",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 05:50:35 GMT"}],"updateDate":"2024-08-20","timestamp":1724046635000,"abstract":"  The emission of Anomalous X-ray Pulsars (AXPs) and Soft Gamma-Ray Repeaters\n(SGRs) is believed to be powered by the dissipation of their strong magnetic\nfields, which coined the name `magnetar'. By combining timing and energy\nobservational results, the magnetar model can be easily appreciated. From a\ntiming perspective, the magnetic field strengths of AXPs and SGRs, calculated\nassuming dipole radiation, are extremely strong. From an energy perspective,\nthe X-ray/soft gamma-ray luminosities of AXPs and SGRs are larger than their\nrotational energy loss rates (i.e., $ L_{\\rm X}>\\dot E_{\\rm rot}$). It is thus\nreasonable to assume that the high-energy radiation comes from magnetic energy\ndecay, and the magnetar model has been extensively discussed (or accepted).\nHowever, we argue that: (1) calculating magnetic fields by assuming that\nrotational energy loss is dominated by dipole radiation (i.e., $\\dot{E}_{\\rm\nrot}\\simeq\\dot{E}_{\\mu}$)) may be controversial, and we suggest that the\nenergies carried by outflowing particles should also be considered; and (2) the\nfact that X-ray luminosity is greater than the rotational energy loss rate does\nnot necessarily mean that the emission energy comes from the magnetic field\ndecaying, which requires further observational testing. Furthermore, some\nobservational facts conflict with the `magnetar' model, such as observations of\nanti-magnetars, high magnetic field pulsars, and radio and X-ray observations\nof AXPs/SGRs. Therefore, we propose a crusted strange star model as an\nalternative, which can explain many more observational facts of AXPs/SGRs.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}