{"id":"2408.05847","title":"Correcting invalid regression discontinuity designs with multiple time\n  period data","authors":"Dor Leventer and Daniel Nevo","authorsParsed":[["Leventer","Dor",""],["Nevo","Daniel",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 19:06:26 GMT"}],"updateDate":"2024-08-13","timestamp":1723403186000,"abstract":"  A common approach to Regression Discontinuity (RD) designs relies on a\ncontinuity assumption of the mean potential outcomes at the cutoff defining the\nRD design. In practice, this assumption is often implausible when changes other\nthan the intervention of interest occur at the cutoff (e.g., other policies are\nimplemented at the same cutoff). When the continuity assumption is implausible,\nresearchers often retreat to ad-hoc analyses that are not supported by any\ntheory and yield results with unclear causal interpretation. These analyses\nseek to exploit additional data where either all units are treated or all units\nare untreated (regardless of their running variable value). For example, when\ndata from multiple time periods are available. We first derive the bias of RD\ndesigns when the continuity assumption does not hold. We then present a\ntheoretical foundation for analyses using multiple time periods by the means of\na general identification framework incorporating data from additional time\nperiods to overcome the bias. We discuss this framework under various RD\ndesigns, and also extend our work to carry-over effects and time-varying\nrunning variables. We develop local linear regression estimators, bias\ncorrection procedures, and standard errors that are robust to bias-correction\nfor the multiple period setup. The approach is illustrated using an application\nthat studied the effect of new fiscal laws on debt of Italian municipalities.\n","subjects":["Economics/Econometrics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YvqLsInKM_A0fOv1T8fRCe4ziDQFuYiUu3sP_tP5xAQ","pdfSize":"736154"}
