{"id":"2408.12228","title":"A nonstandard numerical scheme for a novel SECIR integro-differential\n  equation-based model allowing nonexponentially distributed stay times","authors":"Anna Wendler, Lena Pl\\\"otzke, Hannah Tritzschak, Martin J. K\\\"uhn","authorsParsed":[["Wendler","Anna",""],["Plötzke","Lena",""],["Tritzschak","Hannah",""],["Kühn","Martin J.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 09:03:51 GMT"}],"updateDate":"2024-08-23","timestamp":1724317431000,"abstract":"  Ordinary differential equations (ODE) are a popular tool to model the spread\nof infectious diseases, yet they implicitly assume an exponential distribution\nto describe the flow from one infection state to another. However, scientific\nexperience yields more plausible distributions where the likelihood of disease\nprogression or recovery changes accordingly with the duration spent in a\nparticular state of the disease. Furthermore, transmission dynamics depend\nheavily on the infectiousness of individuals. The corresponding nonlinear\nvariation with the time individuals have already spent in an infectious state\nrequires more realistic models. The previously mentioned items are particularly\ncrucial when modeling dynamics at change points such as the implementation of\nnonpharmaceutical interventions. In order to capture these aspects and to\nenhance the accuracy of simulations, integro-differential equations (IDE) can\nbe used.\n  In this paper, we propose a generalized model based on integro-differential\nequations with eight infection states. The model allows for variable stay time\ndistributions and generalizes the concept of ODE-based models as well as\nIDE-based age-of-infection models. In this, we include particular infection\nstates for severe and critical cases to allow for surveillance of the clinical\nsector, avoiding bottlenecks and overloads in critical epidemic situations.\n  We will extend a recently introduced nonstandard numerical scheme to solve a\nsimpler IDE-based model. This scheme is adapted to our more advanced model and\nwe prove important mathematical and biological properties for the numerical\nsolution. Furthermore, we validate our approach numerically by demonstrating\nthe convergence rate. Eventually, we also show that our novel model is\nintrinsically capable of better assessing disease dynamics upon the\nintroduction of nonpharmaceutical interventions.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}