{"id":"2408.08584","title":"S-RAF: A Simulation-Based Robustness Assessment Framework for\n  Responsible Autonomous Driving","authors":"Daniel Omeiza, Pratik Somaiya, Jo-Ann Pattinson, Carolyn Ten-Holter,\n  Jack Stilgoe, Marina Jirotka, Lars Kunze","authorsParsed":[["Omeiza","Daniel",""],["Somaiya","Pratik",""],["Pattinson","Jo-Ann",""],["Ten-Holter","Carolyn",""],["Stilgoe","Jack",""],["Jirotka","Marina",""],["Kunze","Lars",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 07:37:05 GMT"}],"updateDate":"2024-08-19","timestamp":1723793825000,"abstract":"  As artificial intelligence (AI) technology advances, ensuring the robustness\nand safety of AI-driven systems has become paramount. However, varying\nperceptions of robustness among AI developers create misaligned evaluation\nmetrics, complicating the assessment and certification of safety-critical and\ncomplex AI systems such as autonomous driving (AD) agents. To address this\nchallenge, we introduce Simulation-Based Robustness Assessment Framework\n(S-RAF) for autonomous driving. S-RAF leverages the CARLA Driving simulator to\nrigorously assess AD agents across diverse conditions, including faulty\nsensors, environmental changes, and complex traffic situations. By quantifying\nrobustness and its relationship with other safety-critical factors, such as\ncarbon emissions, S-RAF aids developers and stakeholders in building safe and\nresponsible driving agents, and streamlining safety certification processes.\nFurthermore, S-RAF offers significant advantages, such as reduced testing\ncosts, and the ability to explore edge cases that may be unsafe to test in the\nreal world. The code for this framework is available here:\nhttps://github.com/cognitive-robots/rai-leaderboard\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computers and Society","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}