{"id":"2408.16067","title":"A galactic outflow traced by its extended Mg II emission out to a\n  $\\sim30$ kpc radius in the Hubble Ultra Deep Field with MUSE","authors":"Ismael Pessa, Lutz Wisotzki, Tanya Urrutia, John Pharo, Ramona\n  Augustin, Nicolas F. Bouch\\'e, Anna Feltre, Yucheng Guo, Daria Kozlova, Davor\n  Krajnovic, Haruka Kusakabe, Floriane Leclercq, H\\'ector Salas, Joop Schaye,\n  and Anne Verhamme","authorsParsed":[["Pessa","Ismael",""],["Wisotzki","Lutz",""],["Urrutia","Tanya",""],["Pharo","John",""],["Augustin","Ramona",""],["Bouché","Nicolas F.",""],["Feltre","Anna",""],["Guo","Yucheng",""],["Kozlova","Daria",""],["Krajnovic","Davor",""],["Kusakabe","Haruka",""],["Leclercq","Floriane",""],["Salas","Héctor",""],["Schaye","Joop",""],["Verhamme","Anne",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:03:28 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 16:28:53 GMT"},{"version":"v3","created":"Wed, 11 Sep 2024 13:04:39 GMT"}],"updateDate":"2024-09-12","timestamp":1724868208000,"abstract":"  We report the discovery of a rare Mg II $\\lambda$$\\lambda$ 2796, 2803 doublet\nemission halo around a star forming galaxy with $\\log (M_\\star$/M$_\\odot) =\n10.3 \\pm 0.3$ at $z=0.737$ in deep (9.94 h) VLT/MUSE data from the MUSE-HUDF\nmosaic. While the central region prominently displays an absorption-dominated\nMg II doublet, characterized by discernible P-Cyg features, our examination\nreveals a remarkably extended Mg II emission, spanning approximately $\\sim30$\nkpc from the central galaxy. We introduce a simple outflow radiative transfer\nmodeling scheme based on the Sobolev approximation, and we employ a Bayesian\nMonte Carlo Markov Chain (MCMC) fitting to find the best-fitting parameters\nthat match our data. The model reproduces several key features of the observed\nMg II halo and allows us to constrain the kinematics and geometry of the\noutflowing gas. Our data are consistent with a biconical wind whose velocity\nincreases with radius, pointing nearly towards the observer, with an opening\nangle of $59\\pm4^{\\circ}$ In general, we find that our outflow model performs\nbetter in the inner regions of the galactic wind ($\\lesssim 10$ kpc $\\approx 6$\nhalf-light radii), reaching a velocity of $\\sim120$ km s$^{-1}$ at 10 kpc from\nthe central galaxy. However, discrepancies between the data and the model in\nthe outer regions suggest the possible influence of additional mechanisms, such\nas inflows, satellite interactions, or turbulence, which might significantly\nshape the circumgalactic medium (CGM) of galaxies at larger impact parameters.\nThis analysis underscores the complexity of galactic outflows and encourages\nfurther exploration of the processes governing the dynamics of galactic winds\nthrough spatially resolved studies of the CGM.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}