{"id":"2408.00323","title":"A Novel Edge Laplacian-based Approach for Adaptive Formation Control of\n  Uncertain Multi-agent Systems with Unified Relative Error Performance","authors":"Kun Li, Kai Zhao, Yongduan Song, and Lihua Xie","authorsParsed":[["Li","Kun",""],["Zhao","Kai",""],["Song","Yongduan",""],["Xie","Lihua",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 06:49:31 GMT"}],"updateDate":"2024-08-02","timestamp":1722494971000,"abstract":"  For most existing prescribed performance formation control methods,\nperformance requirements are not directly imposed on the relative states\nbetween agents but on the consensus error, which lacks a clear physical\ninterpretation of their solution. In this paper, we propose a novel adaptive\nprescribed performance formation control strategy, capable of guaranteeing\nprescribed performance on the relative errors, for uncertain high-order\nmulti-agent systems under a class of directed graphs. Due to the consideration\nof performance constraints for relative errors, a coupled nonlinear interaction\nterm that contains global graphic information among agents is involved in the\nerror dynamics, leading to a fully distributed control design more difficult\nand challenging. Here by proposing a series of nonlinear mappings and utilizing\nthe edge Laplacian along with Lyapunov stability theory, the presented\nformation control scheme exhibits the following appealing features when\ncompared to existing results: 1) different performance requirements can be\nguaranteed in a unified way by solely tuning the design parameters a priori,\nwithout the need for control redesign and stability reanalysis under the\nproposed fixed control protocol, making the design more user-friendly and the\nimplementation less demanding; 2) the complex and burdensome verification\nprocess for the initial constraint, often encountered in existing prescribed\nperformance controls, is completely obviated if the performance requirements\nare global; and 3) nonlinear interaction is completely decoupled and the\nasymptotic stability of the formation manifold is ensured via using the\nadaptive parameter estimate technique. Finally, simulations of various\nperformance behaviors are performed to show the efficiency of the theoretical\nresults.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}