{"id":"2408.00106","title":"WAS: Dataset and Methods for Artistic Text Segmentation","authors":"Xudong Xie, Yuzhe Li, Yang Liu, Zhifei Zhang, Zhaowen Wang, Wei Xiong,\n  Xiang Bai","authorsParsed":[["Xie","Xudong",""],["Li","Yuzhe",""],["Liu","Yang",""],["Zhang","Zhifei",""],["Wang","Zhaowen",""],["Xiong","Wei",""],["Bai","Xiang",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:29:36 GMT"}],"updateDate":"2024-08-02","timestamp":1722450576000,"abstract":"  Accurate text segmentation results are crucial for text-related generative\ntasks, such as text image generation, text editing, text removal, and text\nstyle transfer. Recently, some scene text segmentation methods have made\nsignificant progress in segmenting regular text. However, these methods perform\npoorly in scenarios containing artistic text. Therefore, this paper focuses on\nthe more challenging task of artistic text segmentation and constructs a real\nartistic text segmentation dataset. One challenge of the task is that the local\nstroke shapes of artistic text are changeable with diversity and complexity. We\npropose a decoder with the layer-wise momentum query to prevent the model from\nignoring stroke regions of special shapes. Another challenge is the complexity\nof the global topological structure. We further design a skeleton-assisted head\nto guide the model to focus on the global structure. Additionally, to enhance\nthe generalization performance of the text segmentation model, we propose a\nstrategy for training data synthesis, based on the large multi-modal model and\nthe diffusion model. Experimental results show that our proposed method and\nsynthetic dataset can significantly enhance the performance of artistic text\nsegmentation and achieve state-of-the-art results on other public datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}