{"id":"2408.09671","title":"GANPrompt: Enhancing Robustness in LLM-Based Recommendations with\n  GAN-Enhanced Diversity Prompts","authors":"Xinyu Li, Chuang Zhao, Hongke Zhao, Likang Wu, and Ming HE","authorsParsed":[["Li","Xinyu",""],["Zhao","Chuang",""],["Zhao","Hongke",""],["Wu","Likang",""],["HE","Ming",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 03:13:20 GMT"}],"updateDate":"2024-08-20","timestamp":1724037200000,"abstract":"  In recent years, LLM has demonstrated remarkable proficiency in comprehending\nand generating natural language, with a growing prevalence in the domain of\nrecommender systems. However, LLM continues to face a significant challenge in\nthat it is highly susceptible to the influence of prompt words. This\ninconsistency in response to minor alterations in prompt input may compromise\nthe accuracy and resilience of recommendation models. To address this issue,\nthis paper proposes GANPrompt, a multi-dimensional large language model prompt\ndiversity framework based on Generative Adversarial Networks (GANs). The\nframework enhances the model's adaptability and stability to diverse prompts by\nintegrating GAN generation techniques with the deep semantic understanding\ncapabilities of LLMs. GANPrompt first trains a generator capable of producing\ndiverse prompts by analysing multidimensional user behavioural data. These\ndiverse prompts are then used to train the LLM to improve its performance in\nthe face of unseen prompts. Furthermore, to ensure a high degree of diversity\nand relevance of the prompts, this study introduces a mathematical theory-based\ndiversity constraint mechanism that optimises the generated prompts to ensure\nthat they are not only superficially distinct, but also semantically cover a\nwide range of user intentions. Through extensive experiments on multiple\ndatasets, we demonstrate the effectiveness of the proposed framework,\nespecially in improving the adaptability and robustness of recommender systems\nin complex and dynamic environments. The experimental results demonstrate that\nGANPrompt yields substantial enhancements in accuracy and robustness relative\nto existing state-of-the-art methodologies.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}