{"id":"2408.15906","title":"Exploring the potential of AI in nurturing learner empathy, prosocial\n  values and environmental stewardship","authors":"Kenneth Y T Lim, Minh Anh Nguyen Duc, Minh Tuan Nguyen Thien","authorsParsed":[["Lim","Kenneth Y T",""],["Duc","Minh Anh Nguyen",""],["Thien","Minh Tuan Nguyen",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 16:19:55 GMT"}],"updateDate":"2024-08-29","timestamp":1724861995000,"abstract":"  With Artificial Intelligence (AI) becoming a powerful tool for education\n(Zawacki-Richter et al., 2019), this chapter describes the concept of combining\ngenerative and traditional AI, citizen-science physiological, neuroergonomic\nwearables and environmental sensors into activities for learners to understand\ntheir own well-being and emotional states better with a view to developing\nempathy and environmental stewardship. Alongside bespoke and affordable\nwearables (DIY EEG headsets and biometric wristbands), interpretable AI and\ndata science are used for learners to explore how the environment affects them\nphysiologically and mentally in authentic environments. For example,\nrelationships between environmental changes (e.g. poorer air quality) and their\nwell-being (e.g. cognitive functioning) can be discovered. This is particularly\ncrucial, as relevant knowledge can influence the way people treat the\nenvironment, as suggested by the disciplines of environmental neuroscience and\nenvironmental psychology (Doell et al., 2023). Yet, according to Palme and\nSalvati, there have been relatively few studies on the relationships between\nmicroclimates and human health and emotions (Palme and Salvati, 2021). As\nanthropogenic environmental pollution is becoming a prevalent problem, our\nresearch also aims to leverage on generative AI to introduce hypothetical\nscenarios of the environment as emotionally strong stimuli of relevance to the\nlearners. This would provoke an emotional response for them to learn about\ntheir own physiological and neurological responses (using neuro-physiological\ndata). Ultimately, we hope to establish a bidirectional understanding of how\nthe environment affects humans physiologically and mentally; after which, to\ngain insights as to how AI can be used to effectively foster empathy,\npro-environmental attitudes and stewardship.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}