{"id":"2408.16771","title":"Navigating Governance Paradigms: A Cross-Regional Comparative Study of\n  Generative AI Governance Processes & Principles","authors":"Jose Luna, Ivan Tan, Xiaofei Xie, Lingxiao Jiang","authorsParsed":[["Luna","Jose",""],["Tan","Ivan",""],["Xie","Xiaofei",""],["Jiang","Lingxiao",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 08:16:44 GMT"}],"updateDate":"2024-09-02","timestamp":1723623404000,"abstract":"  As Generative Artificial Intelligence (GenAI) technologies evolve at an\nunprecedented rate, global governance approaches struggle to keep pace with the\ntechnology, highlighting a critical issue in the governance adaptation of\nsignificant challenges. Depicting the nuances of nascent and diverse governance\napproaches based on risks, rules, outcomes, principles, or a mix across\ndifferent regions around the globe is fundamental to discern discrepancies and\nconvergences and to shed light on specific limitations that need to be\naddressed, thereby facilitating the safe and trustworthy adoption of GenAI. In\nresponse to the need and the evolving nature of GenAI, this paper seeks to\nprovide a collective view of different governance approaches around the world.\nOur research introduces a Harmonized GenAI Framework, \"H-GenAIGF,\" based on the\ncurrent governance approaches of six regions: European Union (EU), United\nStates (US), China (CN), Canada (CA), United Kingdom (UK), and Singapore (SG).\nWe have identified four constituents, fifteen processes, twenty-five\nsub-processes, and nine principles that aid the governance of GenAI, thus\nproviding a comprehensive perspective on the current state of GenAI governance.\nIn addition, we present a comparative analysis to facilitate the identification\nof common ground and distinctions based on the coverage of the processes by\neach region. The results show that risk-based approaches allow for better\ncoverage of the processes, followed by mixed approaches. Other approaches lag\nbehind, covering less than 50% of the processes. Most prominently, the analysis\ndemonstrates that among the regions, only one process aligns across all\napproaches, highlighting the lack of consistent and executable provisions.\nMoreover, our case study on ChatGPT reveals process coverage deficiency,\nshowing that harmonization of approaches is necessary to find alignment for\nGenAI governance.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}