{"id":"2408.08013","title":"Adaptive Learning of Consistency and Inconsistency Information for Fake\n  News Detection","authors":"Aohan Li, Jiaxin Chen, Xin Liao, Dengyong Zhang","authorsParsed":[["Li","Aohan",""],["Chen","Jiaxin",""],["Liao","Xin",""],["Zhang","Dengyong",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 08:22:10 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 09:48:44 GMT"}],"updateDate":"2024-08-19","timestamp":1723710130000,"abstract":"  The rapid advancement of social media platforms has significantly reduced the\ncost of information dissemination, yet it has also led to a proliferation of\nfake news, posing a threat to societal trust and credibility. Most of fake news\ndetection research focused on integrating text and image information to\nrepresent the consistency of multiple modes in news content, while paying less\nattention to inconsistent information. Besides, existing methods that leveraged\ninconsistent information often caused one mode overshadowing another, leading\nto ineffective use of inconsistent clue. To address these issues, we propose an\nadaptive multi-modal feature fusion network (MFF-Net). Inspired by human\njudgment processes for determining truth and falsity in news, MFF-Net focuses\non inconsistent parts when news content is generally consistent and consistent\nparts when it is generally inconsistent. Specifically, MFF-Net extracts\nsemantic and global features from images and texts respectively, and learns\nconsistency information between modes through a multiple feature fusion module.\nTo deal with the problem of modal information being easily masked, we design a\nsingle modal feature filtering strategy to capture inconsistent information\nfrom corresponding modes separately. Finally, similarity scores are calculated\nbased on global features with adaptive adjustments made to achieve weighted\nfusion of consistent and inconsistent features. Extensive experimental results\ndemonstrate that MFF-Net outperforms state-of-the-art methods across three\npublic news datasets derived from real social medias.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}