{"id":"2408.08669","title":"HSDreport: Heart Sound Diagnosis with Echocardiography Reports","authors":"Zihan Zhao, Pingjie Wang, Liudan Zhao, Yuchen Yang, Ya Zhang, Kun Sun,\n  Xin Sun, Xin Zhou, Yu Wang, Yanfeng Wang","authorsParsed":[["Zhao","Zihan",""],["Wang","Pingjie",""],["Zhao","Liudan",""],["Yang","Yuchen",""],["Zhang","Ya",""],["Sun","Kun",""],["Sun","Xin",""],["Zhou","Xin",""],["Wang","Yu",""],["Wang","Yanfeng",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 11:26:39 GMT"}],"updateDate":"2024-08-19","timestamp":1723807599000,"abstract":"  Heart sound auscultation holds significant importance in the diagnosis of\ncongenital heart disease. However, existing methods for Heart Sound Diagnosis\n(HSD) tasks are predominantly limited to a few fixed categories, framing the\nHSD task as a rigid classification problem that does not fully align with\nmedical practice and offers only limited information to physicians. Besides,\nsuch methods do not utilize echocardiography reports, the gold standard in the\ndiagnosis of related diseases. To tackle this challenge, we introduce\nHSDreport, a new benchmark for HSD, which mandates the direct utilization of\nheart sounds obtained from auscultation to predict echocardiography reports.\nThis benchmark aims to merge the convenience of auscultation with the\ncomprehensive nature of echocardiography reports. First, we collect a new\ndataset for this benchmark, comprising 2,275 heart sound samples along with\ntheir corresponding reports. Subsequently, we develop a knowledge-aware\nquery-based transformer to handle this task. The intent is to leverage the\ncapabilities of medically pre-trained models and the internal knowledge of\nlarge language models (LLMs) to address the task's inherent complexity and\nvariability, thereby enhancing the robustness and scientific validity of the\nmethod. Furthermore, our experimental results indicate that our method\nsignificantly outperforms traditional HSD approaches and existing multimodal\nLLMs in detecting key abnormalities in heart sounds.\n","subjects":["Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}