{"id":"2408.07431","title":"Strategies for optimizing double-bracket quantum algorithms","authors":"Li Xiaoyue, Matteo Robbiati, Andrea Pasquale, Edoardo Pedicillo,\n  Andrew Wright, Stefano Carrazza, Marek Gluza","authorsParsed":[["Xiaoyue","Li",""],["Robbiati","Matteo",""],["Pasquale","Andrea",""],["Pedicillo","Edoardo",""],["Wright","Andrew",""],["Carrazza","Stefano",""],["Gluza","Marek",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 10:07:54 GMT"}],"updateDate":"2024-08-15","timestamp":1723630074000,"abstract":"  Recently double-bracket quantum algorithms have been proposed as a way to\ncompile circuits for approximating eigenstates. Physically, they consist of\nappropriately composing evolutions under an input Hamiltonian together with\ndiagonal evolutions. Here, we present strategies to optimize the choice of the\ndouble-bracket evolutions to enhance the diagonalization efficiency. This can\nbe done by finding optimal generators and durations of the evolutions. We\npresent numerical results regarding the preparation of double-bracket\niterations, both in ideal cases where the algorithm's setup provides analytical\nconvergence guarantees and in more heuristic cases, where we use an adaptive\nand variational approach to optimize the generators of the evolutions. As an\nexample, we discuss the efficacy of these optimization strategies when\nconsidering a spin-chain Hamiltonian as the target. To propose algorithms that\ncan be executed starting today, fully aware of the limitations of the quantum\ntechnologies at our disposal, we finally present a selection of diagonal\nevolution parametrizations that can be directly compiled into CNOTs and\nsingle-qubit rotation gates. We discuss the advantages and limitations of this\ncompilation and propose a way to take advantage of this approach when used in\nsynergy with other existing methods.\n","subjects":["Physics/Quantum Physics","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}