{"id":"2408.15069","title":"Geometric Artifact Correction for Symmetric Multi-Linear Trajectory CT:\n  Theory, Method, and Generalization","authors":"Zhisheng Wang (1 and 2), Yanxu Sun (1 and 2), Shangyu Li (1 and 2),\n  Legeng Lin (1 and 2), Shunli Wang (1 and 2), Junning Cui (1 and 2) ((1)\n  Center of Ultra-precision Optoelectronic Instrument engineering, Harbin\n  Institute of Technology, (2) Key Lab of Ultra-precision Intelligent\n  Instrumentation, Harbin Institute of Technology)","authorsParsed":[["Wang","Zhisheng","","1 and 2"],["Sun","Yanxu","","1 and 2"],["Li","Shangyu","","1 and 2"],["Lin","Legeng","","1 and 2"],["Wang","Shunli","","1 and 2"],["Cui","Junning","","1 and 2"]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 13:56:48 GMT"}],"updateDate":"2024-08-28","timestamp":1724767008000,"abstract":"  For extending CT field-of-view to perform non-destructive testing, the\nSymmetric Multi-Linear trajectory Computed Tomography (SMLCT) has been\ndeveloped as a successful example of non-standard CT scanning modes. However,\ninevitable geometric errors can cause severe artifacts in the reconstructed\nimages. The existing calibration method for SMLCT is both crude and\ninefficient. It involves reconstructing hundreds of images by exhaustively\nsubstituting each potential error, and then manually identifying the images\nwith the fewest geometric artifacts to estimate the final geometric errors for\ncalibration. In this paper, we comprehensively and efficiently address the\nchallenging geometric artifacts in SMLCT, , and the corresponding works mainly\ninvolve theory, method, and generalization. In particular, after identifying\nsensitive parameters and conducting some theory analysis of geometric\nartifacts, we summarize several key properties between sensitive geometric\nparameters and artifact characteristics. Then, we further construct\nmathematical relationships that relate sensitive geometric errors to the pixel\noffsets of reconstruction images with artifact characteristics. To accurately\nextract pixel bias, we innovatively adapt the Generalized Cross-Correlation\nwith Phase Transform (GCC-PHAT) algorithm, commonly used in sound processing,\nfor our image registration task for each paired symmetric LCT. This adaptation\nleads to the design of a highly efficient rigid translation registration\nmethod. Simulation and physical experiments have validated the excellent\nperformance of this work. Additionally, our results demonstrate significant\ngeneralization to common rotated CT and a variant of SMLCT.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing","Physics/Instrumentation and Detectors"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}