{"id":"2408.13762","title":"Self-Parameterization Based Multi-Resolution Mesh Convolution Networks","authors":"Shi Hezi, Jiang Luo, Zheng Jianmin, Zeng Jun","authorsParsed":[["Hezi","Shi",""],["Luo","Jiang",""],["Jianmin","Zheng",""],["Jun","Zeng",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 08:11:22 GMT"}],"updateDate":"2024-08-27","timestamp":1724573482000,"abstract":"  This paper addresses the challenges of designing mesh convolution neural\nnetworks for 3D mesh dense prediction. While deep learning has achieved\nremarkable success in image dense prediction tasks, directly applying or\nextending these methods to irregular graph data, such as 3D surface meshes, is\nnontrivial due to the non-uniform element distribution and irregular\nconnectivity in surface meshes which make it difficult to adapt downsampling,\nupsampling, and convolution operations. In addition, commonly used\nmultiresolution networks require repeated high-to-low and then low-to-high\nprocesses to boost the performance of recovering rich, high-resolution\nrepresentations. To address these challenges, this paper proposes a\nself-parameterization-based multi-resolution convolution network that extends\nexisting image dense prediction architectures to 3D meshes. The novelty of our\napproach lies in two key aspects. First, we construct a multi-resolution mesh\npyramid directly from the high-resolution input data and propose area-aware\nmesh downsampling/upsampling operations that use sequential bijective\ninter-surface mappings between different mesh resolutions. The inter-surface\nmapping redefines the mesh, rather than reshaping it, which thus avoids\nintroducing unnecessary errors. Second, we maintain the high-resolution\nrepresentation in the multi-resolution convolution network, enabling\nmulti-scale fusions to exchange information across parallel multi-resolution\nsubnetworks, rather than through connections of high-to-low resolution\nsubnetworks in series. These features differentiate our approach from most\nexisting mesh convolution networks and enable more accurate mesh dense\npredictions, which is confirmed in experiments.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}