{"id":"2408.05322","title":"Opportunistic Learning for Markov Decision Systems with Application to\n  Smart Robots","authors":"Michael J. Neely","authorsParsed":[["Neely","Michael J.",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 20:07:37 GMT"}],"updateDate":"2024-08-13","timestamp":1723234057000,"abstract":"  This paper presents an online method that learns optimal decisions for a\ndiscrete time Markov decision problem with an opportunistic structure. The\nstate at time $t$ is a pair $(S(t),W(t))$ where $S(t)$ takes values in a finite\nset $\\mathcal{S}$ of basic states, and $\\{W(t)\\}_{t=0}^{\\infty}$ is an i.i.d.\nsequence of random vectors that affect the system and that have an unknown\ndistribution. Every slot $t$ the controller observes $(S(t),W(t))$ and chooses\na control action $A(t)$. The triplet $(S(t),W(t),A(t))$ determines a vector of\ncosts and the transition probabilities for the next state $S(t+1)$. The goal is\nto minimize the time average of an objective function subject to additional\ntime average cost constraints. We develop an algorithm that acts on a\ncorresponding virtual system where $S(t)$ is replaced by a decision variable.\nAn equivalence between virtual and actual systems is established by enforcing a\ncollection of time averaged global balance equations. For any desired\n$\\epsilon>0$, we prove the algorithm achieves an $\\epsilon$-optimal solution on\nthe virtual system with a convergence time of $O(1/\\epsilon^2)$. The actual\nsystem runs at the same time, its actions are informed by the virtual system,\nand its conditional transition probabilities and costs are proven to be the\nsame as the virtual system at every instant of time. Also, its unconditional\nprobabilities and costs are shown in simulation to closely match the virtual\nsystem. Our simulations consider online control of a robot that explores a\nregion of interest. Objects with varying rewards appear and disappear and the\nrobot learns what areas to explore and what objects to collect and deliver to a\nhome base.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}