{"id":"2408.08098","title":"A Framework for Integrating Quantum Simulation and High Performance\n  Computing","authors":"Amir Shehata, Thomas Naughton, and In-Saeng Suh","authorsParsed":[["Shehata","Amir",""],["Naughton","Thomas",""],["Suh","In-Saeng",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 11:48:14 GMT"}],"updateDate":"2024-08-16","timestamp":1723722494000,"abstract":"  Scientific applications are starting to explore the viability of quantum\ncomputing. This exploration typically begins with quantum simulations that can\nrun on existing classical platforms, albeit without the performance advantages\nof real quantum resources. In the context of high-performance computing (HPC),\nthe incorporation of simulation software can often take advantage of the\npowerful resources to help scale-up the simulation size. The configuration,\ninstallation and operation of these quantum simulation packages on HPC\nresources can often be rather daunting and increases friction for\nexperimentation by scientific application developers. We describe a framework\nto help streamline access to quantum simulation software running on HPC\nresources. This includes an interface for circuit-based quantum computing\ntasks, as well as the necessary resource management infrastructure to make\neffective use of the underlying HPC resources. The primary contributions of\nthis work include a classification of different usage models for quantum\nsimulation in an HPC context, a review of the software architecture for our\napproach and a detailed description of the prototype implementation to\nexperiment with these ideas using two different simulators (TNQVM \\& NWQ-Sim).\nWe include initial experimental results running on the Frontier supercomputer\nat the Oak Ridge Leadership Computing Facility (OLCF) using a synthetic\nworkload generated via the SupermarQ quantum benchmarking framework.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}