{"id":"2408.05789","title":"Status epilepticus and thinning of the entorhinal cortex","authors":"Jonathan Horsley, Yujiang Wang, Callum Simpson, Vyte Janiukstyte,\n  Karoline Leiberg, Beth Little, Jane de Tisi, John Duncan, Peter N. Taylor","authorsParsed":[["Horsley","Jonathan",""],["Wang","Yujiang",""],["Simpson","Callum",""],["Janiukstyte","Vyte",""],["Leiberg","Karoline",""],["Little","Beth",""],["de Tisi","Jane",""],["Duncan","John",""],["Taylor","Peter N.",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 14:41:56 GMT"}],"updateDate":"2024-08-13","timestamp":1723387316000,"abstract":"  Status epilepticus (SE) carries risks of morbidity and mortality.\nExperimental studies have implicated the entorhinal cortex in prolonged\nseizures; however, studies in large human cohorts are limited. We hypothesised\nthat individuals with temporal lobe epilepsy (TLE) and a history of SE would\nhave more severe entorhinal atrophy compared to others with TLE and no history\nof SE.\n  357 individuals with drug resistant temporal lobe epilepsy (TLE) and 100\nhealthy controls were scanned on a 3T MRI. For all subjects the cortex was\nsegmented, parcellated, and the thickness calculated from the T1-weighted\nanatomical scan. Subcortical volumes were derived similarly. Cohen's d and\nWilcoxon rank-sum tests respectively were used to capture effect sizes and\nsignificance.\n  Individuals with TLE and SE had reduced entorhinal thickness compared to\nthose with TLE and no history of SE. The entorhinal cortex was more atrophic\nipsilaterally (d=0.51, p<0.001) than contralaterally (d=0.37, p=0.01).\nReductions in ipsilateral entorhinal thickness were present in both left TLE\n(n=22:176, d=0.78, p<0.001), and right TLE (n=19:140, d=0.31, p=0.04), albeit\nwith a smaller effect size in right TLE. Several other regions exhibited\natrophy in individuals with TLE, but these did not relate to a history of SE.\n  These findings suggest potential involvement or susceptibility of the\nentorhinal cortex in prolonged seizures.\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}