{"id":"2408.10839","title":"Benchmarking Large Language Models for Math Reasoning Tasks","authors":"Kathrin Se{\\ss}ler, Yao Rong, Emek G\\\"ozl\\\"ukl\\\"u, Enkelejda Kasneci","authorsParsed":[["Seßler","Kathrin",""],["Rong","Yao",""],["Gözlüklü","Emek",""],["Kasneci","Enkelejda",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 13:34:17 GMT"}],"updateDate":"2024-08-21","timestamp":1724160857000,"abstract":"  The use of Large Language Models (LLMs) in mathematical reasoning has become\na cornerstone of related research, demonstrating the intelligence of these\nmodels and enabling potential practical applications through their advanced\nperformance, such as in educational settings. Despite the variety of datasets\nand in-context learning algorithms designed to improve the ability of LLMs to\nautomate mathematical problem solving, the lack of comprehensive benchmarking\nacross different datasets makes it complicated to select an appropriate model\nfor specific tasks. In this project, we present a benchmark that fairly\ncompares seven state-of-the-art in-context learning algorithms for mathematical\nproblem solving across five widely used mathematical datasets on four powerful\nfoundation models. Furthermore, we explore the trade-off between efficiency and\nperformance, highlighting the practical applications of LLMs for mathematical\nreasoning. Our results indicate that larger foundation models like GPT-4o and\nLLaMA 3-70B can solve mathematical reasoning independently from the concrete\nprompting strategy, while for smaller models the in-context learning approach\nsignificantly influences the performance. Moreover, the optimal prompt depends\non the chosen foundation model. We open-source our benchmark code to support\nthe integration of additional models in future research.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9XCTbTGqqgjbSxfnS9xC6iN6SVxD27kB7xnR-xBH0dQ","pdfSize":"579405"}
