{"id":"2408.12785","title":"Dynamically syndetic sets and the combinatorics of syndetic, idempotent\n  filters","authors":"Daniel Glasscock and Anh N. Le","authorsParsed":[["Glasscock","Daniel",""],["Le","Anh N.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 01:28:14 GMT"}],"updateDate":"2024-08-26","timestamp":1724376494000,"abstract":"  A subset of the positive integers is \\emph{dynamically central syndetic} if\nit contains the set of times that a point returns to a neighborhood of itself\nunder a minimal transformation of a compact metric space. These sets are part\nof the highly-influential link between dynamics and combinatorics forged by\nFurstenberg and Weiss in the 1970's. Our main result is a characterization of\ndynamically central syndetic sets as precisely those sets that belong to\nsyndetic, idempotent filters. Idempotent filters are combinatorial objects that\nabound in ergodic Ramsey theory but have been largely unnoticed and unexplored.\nWe develop the algebra of these objects for the proof of the main theorem and\nwith an eye toward future applications.\n  The main result is best contextualized as a ``global'' analogue to Bergelson\nand Hindman's ``local'' characterization of Furstenberg's central sets as\nmembers of minimal, idempotent ultrafilters. It leads to a dual\ncharacterization of sets of topological pointwise recurrence, allowing us to\nanswer a question of Glasner, Tsankov, Weiss, and Zucker. We draw numerous\nstriking contrasts between pointwise recurrence and set recurrence, a topic\nwith a long history in the subject and its applications, and answer four\nquestions posed by Host, Kra, and Maass. We also show that the intersection of\na dynamically central syndetic set with a set of pointwise recurrence must be\npiecewise syndetic, generalizing results of Dong, Glasner, Huang, Shao, Weiss,\nand Ye.\n","subjects":["Mathematics/Dynamical Systems","Mathematics/Combinatorics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}