{"id":"2408.11787","title":"NuSegDG: Integration of Heterogeneous Space and Gaussian Kernel for\n  Domain-Generalized Nuclei Segmentation","authors":"Zhenye Lou, Qing Xu, Zekun Jiang, Xiangjian He, Zhen Chen, Yi Wang,\n  Chenxin Li, Maggie M. He, Wenting Duan","authorsParsed":[["Lou","Zhenye",""],["Xu","Qing",""],["Jiang","Zekun",""],["He","Xiangjian",""],["Chen","Zhen",""],["Wang","Yi",""],["Li","Chenxin",""],["He","Maggie M.",""],["Duan","Wenting",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 17:19:23 GMT"},{"version":"v2","created":"Sun, 25 Aug 2024 03:49:14 GMT"}],"updateDate":"2024-08-27","timestamp":1724260763000,"abstract":"  Domain-generalized nuclei segmentation refers to the generalizability of\nmodels to unseen domains based on knowledge learned from source domains and is\nchallenged by various image conditions, cell types, and stain strategies.\nRecently, the Segment Anything Model (SAM) has made great success in universal\nimage segmentation by interactive prompt modes (e.g., point and box). Despite\nits strengths, the original SAM presents limited adaptation to medical images.\nMoreover, SAM requires providing manual bounding box prompts for each object to\nproduce satisfactory segmentation masks, so it is laborious in nuclei\nsegmentation scenarios. To address these limitations, we propose a\ndomain-generalizable framework for nuclei image segmentation, abbreviated to\nNuSegDG. Specifically, we first devise a Heterogeneous Space Adapter\n(HS-Adapter) to learn multi-dimensional feature representations of different\nnuclei domains by injecting a small number of trainable parameters into the\nimage encoder of SAM. To alleviate the labor-intensive requirement of manual\nprompts, we introduce a Gaussian-Kernel Prompt Encoder (GKP-Encoder) to\ngenerate density maps driven by a single point, which guides segmentation\npredictions by mixing position prompts and semantic prompts. Furthermore, we\npresent a Two-Stage Mask Decoder (TSM-Decoder) to effectively convert semantic\nmasks to instance maps without the manual demand for morphological shape\nrefinement. Based on our experimental evaluations, the proposed NuSegDG\ndemonstrates state-of-the-art performance in nuclei instance segmentation,\nexhibiting superior domain generalization capabilities. The source code is\navailable at https://github.com/xq141839/NuSegDG.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}