{"id":"2408.04156","title":"Structure functions with higher-order stencils as a probe to separate\n  small- and large-scale magnetic fields","authors":"Amit Seta and Christoph Federrath","authorsParsed":[["Seta","Amit",""],["Federrath","Christoph",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 01:51:41 GMT"}],"updateDate":"2024-08-09","timestamp":1723081901000,"abstract":"  Magnetic fields are an energetically important component of star-formation\ngalaxies, but it is often difficult to measure their properties from\nobservations. One of the complexities stems from the fact that the magnetic\nfields, especially in spiral galaxies, have a two-scale nature: a large-scale\nfield, coherent over ${\\rm kpc}$ scales and a small-scale, random field with a\nscale of $\\lesssim$ $100~{\\rm pc}$. Moreover, it is known that the strength of\nsmall- and large-scale fields are comparable and this makes it even harder to\nfind their imprints in radio polarisation observations such as the Faraday\nrotation measure, ${\\rm RM}$, which is the integral over the path length of the\nproduct of the thermal electron density and the parallel component of the\nmagnetic field to the line of sight. Here, we propose and demonstrate the use\nof second-order structure functions of ${\\rm RM}$ computed with multiple\nhigher-order stencils as a powerful analysis to separate the small- and\nlarge-scale magnetic field components. In particular, we provide new methods\nand calibrations to compute the scale and the strength of the large-scale\nmagnetic field in the presence of small-scale magnetic fluctuations. We then\napply the method to find the scale of large-scale magnetic fields in the nearby\ngalaxies M51 and NGC 6946, using archival data and further discuss the need for\ncomputing the ${\\rm RM}$ structure functions with higher-order stencils. With\nmultiple modern radio polarisation observatories and eventually the Square\nKilometre Array, ${\\rm RM}$ observations will significantly improve in quantity\nand quality, and the higher-order stencil structure function techniques\ndeveloped here can be used to extract information about multiscale magnetic\nfields in galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}