{"id":"2408.11771","title":"Thermodynamic Evolution of Plumes","authors":"Biswanath Malaker, Vishal Upendran, Durgesh Tripathi","authorsParsed":[["Malaker","Biswanath",""],["Upendran","Vishal",""],["Tripathi","Durgesh",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 16:53:04 GMT"}],"updateDate":"2024-08-22","timestamp":1724259184000,"abstract":"  Plumes are considered to play an important role in the origin of solar wind.\nHowever, an understanding of their thermodynamic evolution is not complete.\nHere, we perform a detailed study of a plume inside a coronal hole throughout\nits lifetime, using the observations from the Atmospheric Imaging Assembly\n(AIA) and the Helioseismic and Magnetic Imager (HMI). We find that the plume's\nformation is preceded by frequent occurrences of small-scale jets and jet-lets\nat its base, leading to the gradual development of plume haze. The plume\nrapidly developed within the first six hours into its well-known morphology.\nLight curves from all EUV channels exhibit a similar profile, suggesting its\nmulti-thermal nature and intensity modulation over its lifespan. Moreover, the\nphotospheric magnetic field dynamics at the plume's base are highly correlated\nwith its light curve in 171~{\\AA}. We calculate outflow velocities, observed\nprominently in the 171~{\\AA} passband and mildly in the 193~{\\AA} and 211~{\\AA}\npassbands, with median speeds lower in higher temperature bands but\noccasionally comparable to the respective sound speeds. When data is averaged\nover larger spatial scales, the plume appears iso-thermal along its length,\nwith constant temperature throughout its lifetime. However, an analysis of the\ndifferential emission measure at full resolution reveals the presence of\nhigher-temperature plasma, indicating internal temperature structures within\nthe plume. These results provide new insights into the formation, dynamics, and\nthermal properties of coronal plumes, placing tighter constraints on models to\nunderstand their thermodynamic evolution and potential role in the solar wind.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}