{"id":"2408.07455","title":"Infra-YOLO: Efficient Neural Network Structure with Model Compression\n  for Real-Time Infrared Small Object Detection","authors":"Zhonglin Chen, Anyu Geng, Jianan Jiang, Jiwu Lu, Di Wu","authorsParsed":[["Chen","Zhonglin",""],["Geng","Anyu",""],["Jiang","Jianan",""],["Lu","Jiwu",""],["Wu","Di",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 10:49:14 GMT"}],"updateDate":"2024-08-15","timestamp":1723632554000,"abstract":"  Although convolutional neural networks have made outstanding achievements in\nvisible light target detection, there are still many challenges in infrared\nsmall object detection because of the low signal-to-noise ratio, incomplete\nobject structure, and a lack of reliable infrared small object dataset. To\nresolve limitations of the infrared small object dataset, a new dataset named\nInfraTiny was constructed, and more than 85% bounding box is less than 32x32\npixels (3218 images and a total of 20,893 bounding boxes). A multi-scale\nattention mechanism module (MSAM) and a Feature Fusion Augmentation Pyramid\nModule (FFAFPM) were proposed and deployed onto embedded devices. The MSAM\nenables the network to obtain scale perception information by acquiring\ndifferent receptive fields, while the background noise information is\nsuppressed to enhance feature extraction ability. The proposed FFAFPM can\nenrich semantic information, and enhance the fusion of shallow feature and deep\nfeature, thus false positive results have been significantly reduced. By\nintegrating the proposed methods into the YOLO model, which is named\nInfra-YOLO, infrared small object detection performance has been improved.\nCompared to yolov3, mAP@0.5 has been improved by 2.7%; and compared to yolov4,\nthat by 2.5% on the InfraTiny dataset. The proposed Infra-YOLO was also\ntransferred onto the embedded device in the unmanned aerial vehicle (UAV) for\nreal application scenarios, where the channel pruning method is adopted to\nreduce FLOPs and to achieve a tradeoff between speed and accuracy. Even if the\nparameters of Infra-YOLO are reduced by 88% with the pruning method, a gain of\n0.7% is still achieved on mAP@0.5 compared to yolov3, and a gain of 0.5%\ncompared to yolov4. Experimental results show that the proposed MSAM and FFAFPM\nmethod can improve infrared small object detection performance compared with\nthe previous benchmark method.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"5Lhv4cvdE2HJE38UOLY3BafSoPE-x-niZwWx5aTgu2U","pdfSize":"1173311"}
