{"id":"2408.07595","title":"Progressive Radiance Distillation for Inverse Rendering with Gaussian\n  Splatting","authors":"Keyang Ye, Qiming Hou, Kun Zhou","authorsParsed":[["Ye","Keyang",""],["Hou","Qiming",""],["Zhou","Kun",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 14:50:08 GMT"}],"updateDate":"2024-08-15","timestamp":1723647008000,"abstract":"  We propose progressive radiance distillation, an inverse rendering method\nthat combines physically-based rendering with Gaussian-based radiance field\nrendering using a distillation progress map. Taking multi-view images as input,\nour method starts from a pre-trained radiance field guidance, and distills\nphysically-based light and material parameters from the radiance field using an\nimage-fitting process. The distillation progress map is initialized to a small\nvalue, which favors radiance field rendering. During early iterations when\nfitted light and material parameters are far from convergence, the radiance\nfield fallback ensures the sanity of image loss gradients and avoids local\nminima that attracts under-fit states. As fitted parameters converge, the\nphysical model gradually takes over and the distillation progress increases\ncorrespondingly. In presence of light paths unmodeled by the physical model,\nthe distillation progress never finishes on affected pixels and the learned\nradiance field stays in the final rendering. With this designed tolerance for\nphysical model limitations, we prevent unmodeled color components from leaking\ninto light and material parameters, alleviating relighting artifacts.\nMeanwhile, the remaining radiance field compensates for the limitations of the\nphysical model, guaranteeing high-quality novel views synthesis. Experimental\nresults demonstrate that our method significantly outperforms state-of-the-art\ntechniques quality-wise in both novel view synthesis and relighting. The idea\nof progressive radiance distillation is not limited to Gaussian splatting. We\nshow that it also has positive effects for prominently specular scenes when\nadapted to a mesh-based inverse rendering method.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}