{"id":"2408.05482","title":"TESS asteroseismology of $\\beta$ Hydri: a subgiant with a born-again\n  dynamo","authors":"Travis S. Metcalfe, Jennifer L. van Saders, Daniel Huber, Derek\n  Buzasi, Rafael A. Garcia, Keivan G. Stassun, Sarbani Basu, Sylvain N. Breton,\n  Zachary R. Claytor, Enrico Corsaro, Martin B. Nielsen, J. M. Joel Ong,\n  Nicholas Saunders, Amalie Stokholm, Timothy R. Bedding","authorsParsed":[["Metcalfe","Travis S.",""],["van Saders","Jennifer L.",""],["Huber","Daniel",""],["Buzasi","Derek",""],["Garcia","Rafael A.",""],["Stassun","Keivan G.",""],["Basu","Sarbani",""],["Breton","Sylvain N.",""],["Claytor","Zachary R.",""],["Corsaro","Enrico",""],["Nielsen","Martin B.",""],["Ong","J. M. Joel",""],["Saunders","Nicholas",""],["Stokholm","Amalie",""],["Bedding","Timothy R.",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 08:21:50 GMT"}],"updateDate":"2024-08-13","timestamp":1723278110000,"abstract":"  The solar-type subgiant $\\beta$ Hyi has long been studied as an old analog of\nthe Sun. Although the rotation period has never been measured directly, it was\nestimated to be near 27 days. As a southern hemisphere target it was not\nmonitored by long-term stellar activity surveys, but archival International\nUltraviolet Explorer data revealed a 12 year activity cycle. Previous\nground-based asteroseismology suggested that the star is slightly more massive\nand substantially larger and older than the Sun, so the similarity of both the\nrotation rate and the activity cycle period to solar values is perplexing. We\nuse two months of precise time-series photometry from the Transiting Exoplanet\nSurvey Satellite (TESS) to detect solar-like oscillations in $\\beta$ Hyi and\ndetermine the fundamental stellar properties from asteroseismic modeling. We\nalso obtain a direct measurement of the rotation period, which was previously\nestimated from an ultraviolet activity-rotation relation. We then use\nrotational evolution modeling to predict the rotation period expected from\neither standard spin-down or weakened magnetic braking (WMB). We conclude that\nthe rotation period of $\\beta$ Hyi is consistent with WMB, and that changes in\nstellar structure on the subgiant branch can reinvigorate the large-scale\ndynamo and briefly sustain magnetic activity cycles. Our results support the\nexistence of a \"born-again\" dynamo in evolved subgiants -- previously suggested\nto explain the cycle in 94 Aqr Aa -- which can best be understood within the\nWMB scenario.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}