{"id":"2408.03245","title":"Crab Pulsar: IXPE Observations Reveal Unified Polarization Properties\n  Across Optical and Soft X-Ray Bands","authors":"Denis Gonz\\'alez-Caniulef, Jeremy Heyl, Sergio Fabiani, Paolo\n  Soffitta, Enrico Costa, Niccol\\`o Bucciantini, Demet Kirmizibayrak, Fei Xie","authorsParsed":[["González-Caniulef","Denis",""],["Heyl","Jeremy",""],["Fabiani","Sergio",""],["Soffitta","Paolo",""],["Costa","Enrico",""],["Bucciantini","Niccolò",""],["Kirmizibayrak","Demet",""],["Xie","Fei",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 15:06:12 GMT"}],"updateDate":"2024-08-07","timestamp":1722956772000,"abstract":"  We present a phase-dependent analysis of the polarized emission from the Crab\npulsar based on three sets of observations by the Imaging X-ray Polarimetry\nExplorer (IXPE). We found that a phenomenological model involving a simple\nlinear transformation of the Stokes parameters adequately describes the IXPE\ndata. This model enables us to establish, for the first time, a connection\nbetween the polarization properties of the Crab pulsar in the optical and soft\nX-ray bands, suggesting a common underlying emission mechanism across these\nbands. In particular, the phase-dependent polarization degree in X-rays for\npure pulsar emission shows similar features but is reduced by a factor $\\approx\n(0.46-0.56)$ compared to the optical band, implying an energy-dependent\npolarized emission. In addition, using this model, we study the polarization\nangle swing in X-rays and identify a potentially variable phase-shift at the\ninterpulse relative to the optical band, alongside a phase-shift marginally\nconsistent with zero persisting at the main pulse. While the variability\npresents a new challenge for theoretical interpretation, our findings suggest\nthat the emission mechanism for the main pulse is likely located far from the\nneutron star surface, perhaps near or beyond the light cylinder, rather than\noperating in the inner magnetosphere where vacuum birefringence is expected to\nbe at work. Ignoring the phase-shifts would result in identical phase-dependent\npolarization angles between the optical and X-ray bands for pure pulsar\nemission.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fq7eJk7RJy1jQZXF1dQKCFwp_9c2E1xuMCJy0RZDa6I","pdfSize":"1459475"}
