{"id":"2408.09162","title":"Zero-Shot Object-Centric Representation Learning","authors":"Aniket Didolkar and Andrii Zadaianchuk and Anirudh Goyal and Mike\n  Mozer and Yoshua Bengio and Georg Martius and Maximilian Seitzer","authorsParsed":[["Didolkar","Aniket",""],["Zadaianchuk","Andrii",""],["Goyal","Anirudh",""],["Mozer","Mike",""],["Bengio","Yoshua",""],["Martius","Georg",""],["Seitzer","Maximilian",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 10:37:07 GMT"}],"updateDate":"2024-08-20","timestamp":1723891027000,"abstract":"  The goal of object-centric representation learning is to decompose visual\nscenes into a structured representation that isolates the entities. Recent\nsuccesses have shown that object-centric representation learning can be scaled\nto real-world scenes by utilizing pre-trained self-supervised features.\nHowever, so far, object-centric methods have mostly been applied\nin-distribution, with models trained and evaluated on the same dataset. This is\nin contrast to the wider trend in machine learning towards general-purpose\nmodels directly applicable to unseen data and tasks. Thus, in this work, we\nstudy current object-centric methods through the lens of zero-shot\ngeneralization by introducing a benchmark comprising eight different synthetic\nand real-world datasets. We analyze the factors influencing zero-shot\nperformance and find that training on diverse real-world images improves\ntransferability to unseen scenarios. Furthermore, inspired by the success of\ntask-specific fine-tuning in foundation models, we introduce a novel\nfine-tuning strategy to adapt pre-trained vision encoders for the task of\nobject discovery. We find that the proposed approach results in\nstate-of-the-art performance for unsupervised object discovery, exhibiting\nstrong zero-shot transfer to unseen datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}