{"id":"2408.05042","title":"Benchmarking Conventional and Learned Video Codecs with a Low-Delay\n  Configuration","authors":"Siyue Teng (1), Yuxuan Jiang (1), Ge Gao (1), Fan Zhang (1), Thomas\n  Davis (2), Zoe Liu (2), David Bull (1) ((1) University of Bristol, (2)\n  Visionular Inc.)","authorsParsed":[["Teng","Siyue",""],["Jiang","Yuxuan",""],["Gao","Ge",""],["Zhang","Fan",""],["Davis","Thomas",""],["Liu","Zoe",""],["Bull","David",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 12:55:23 GMT"}],"updateDate":"2024-08-12","timestamp":1723208123000,"abstract":"  Recent advances in video compression have seen significant coding performance\nimprovements with the development of new standards and learning-based video\ncodecs. However, most of these works focus on application scenarios that allow\na certain amount of system delay (e.g., Random Access mode in MPEG codecs),\nwhich is not always acceptable for live delivery. This paper conducts a\ncomparative study of state-of-the-art conventional and learned video coding\nmethods based on a low delay configuration. Specifically, this study includes\ntwo MPEG standard codecs (H.266/VVC VTM and JVET ECM), two AOM codecs (AV1\nlibaom and AVM), and two recent neural video coding models (DCVC-DC and\nDCVC-FM). To allow a fair and meaningful comparison, the evaluation was\nperformed on test sequences defined in the AOM and MPEG common test conditions\nin the YCbCr 4:2:0 color space. The evaluation results show that the JVET ECM\ncodecs offer the best overall coding performance among all codecs tested, with\na 16.1% (based on PSNR) average BD-rate saving over AOM AVM, and 11.0% over\nDCVC-FM. We also observed inconsistent performance with the learned video\ncodecs, DCVC-DC and DCVC-FM, for test content with large background motions.\n","subjects":["Computing Research Repository/Multimedia","Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}