{"id":"2408.00200","title":"UnPaSt: unsupervised patient stratification by differentially expressed\n  biclusters in omics data","authors":"Michael Hartung, Andreas Maier, Fernando Delgado-Chaves, Yuliya\n  Burankova, Olga I. Isaeva, F\\'abio Malta de S\\'a Patroni, Daniel He, Casey\n  Shannon, Katharina Kaufmann, Jens Lohmann, Alexey Savchik, Anne Hartebrodt,\n  Zoe Chervontseva, Farzaneh Firoozbakht, Niklas Probul, Evgenia Zotova, Olga\n  Tsoy, David B. Blumenthal, Martin Ester, Tanja Laske, Jan Baumbach, Olga\n  Zolotareva","authorsParsed":[["Hartung","Michael",""],["Maier","Andreas",""],["Delgado-Chaves","Fernando",""],["Burankova","Yuliya",""],["Isaeva","Olga I.",""],["Patroni","Fábio Malta de Sá",""],["He","Daniel",""],["Shannon","Casey",""],["Kaufmann","Katharina",""],["Lohmann","Jens",""],["Savchik","Alexey",""],["Hartebrodt","Anne",""],["Chervontseva","Zoe",""],["Firoozbakht","Farzaneh",""],["Probul","Niklas",""],["Zotova","Evgenia",""],["Tsoy","Olga",""],["Blumenthal","David B.",""],["Ester","Martin",""],["Laske","Tanja",""],["Baumbach","Jan",""],["Zolotareva","Olga",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 23:50:27 GMT"}],"updateDate":"2024-08-02","timestamp":1722469827000,"abstract":"  Most complex diseases, including cancer and non-malignant diseases like\nasthma, have distinct molecular subtypes that require distinct clinical\napproaches. However, existing computational patient stratification methods have\nbeen benchmarked almost exclusively on cancer omics data and only perform well\nwhen mutually exclusive subtypes can be characterized by many biomarkers. Here,\nwe contribute with a massive evaluation attempt, quantitatively exploring the\npower of 22 unsupervised patient stratification methods using both, simulated\nand real transcriptome data. From this experience, we developed UnPaSt\n(https://apps.cosy.bio/unpast/) optimizing unsupervised patient stratification,\nworking even with only a limited number of subtype-predictive biomarkers. We\nevaluated all 23 methods on real-world breast cancer and asthma transcriptomics\ndata. Although many methods reliably detected major breast cancer subtypes,\nonly few identified Th2-high asthma, and UnPaSt significantly outperformed its\nclosest competitors in both test datasets. Essentially, we showed that UnPaSt\ncan detect many biologically insightful and reproducible patterns in omic\ndatasets.\n","subjects":["Computing Research Repository/Machine Learning","Quantitative Biology/Genomics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zkANfOf9RI98m8FF-3wr3TLBFvBuFbxZ3ATBy9JoDOI","pdfSize":"5703701","txDigest":"265DJSHt4muC5KHDnFQxuL7QRaAYHFNFpVn2rrPbrKw2","endEpoch":"1","status":"CERTIFIED"}
