{"id":"2408.02085","title":"Unleashing the Power of Data Tsunami: A Comprehensive Survey on Data\n  Assessment and Selection for Instruction Tuning of Language Models","authors":"Yulei Qin, Yuncheng Yang, Pengcheng Guo, Gang Li, Hang Shao, Yuchen\n  Shi, Zihan Xu, Yun Gu, Ke Li, Xing Sun","authorsParsed":[["Qin","Yulei",""],["Yang","Yuncheng",""],["Guo","Pengcheng",""],["Li","Gang",""],["Shao","Hang",""],["Shi","Yuchen",""],["Xu","Zihan",""],["Gu","Yun",""],["Li","Ke",""],["Sun","Xing",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 16:50:07 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 03:19:25 GMT"},{"version":"v3","created":"Wed, 7 Aug 2024 06:04:31 GMT"}],"updateDate":"2024-08-08","timestamp":1722790207000,"abstract":"  Instruction tuning plays a critical role in aligning large language models\n(LLMs) with human preference. Despite the vast amount of open instruction\ndatasets, naively training a LLM on all existing instructions may not be\noptimal and practical. To pinpoint the most beneficial datapoints, data\nassessment and selection methods have been proposed in the fields of natural\nlanguage processing (NLP) and deep learning. However, under the context of\ninstruction tuning, there still exists a gap in knowledge on what kind of data\nevaluation metrics can be employed and how they can be integrated into the\nselection mechanism. To bridge this gap, we present a comprehensive review on\nexisting literature of data assessment and selection especially for instruction\ntuning of LLMs. We systematically categorize all applicable methods into\nquality-based, diversity-based, and importance-based ones where a unified,\nfine-grained taxonomy is structured. For each category, representative methods\nare elaborated to describe the landscape of relevant research. In addition,\ncomparison between latest methods is conducted on their officially reported\nresults to provide in-depth discussions on their limitations. Finally, we\nsummarize the open challenges and propose the promosing avenues for future\nstudies. All related contents are available at\nhttps://github.com/yuleiqin/fantastic-data-engineering.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}