{"id":"2408.16231","title":"Anchor-Controlled Generative Adversarial Network for High-Fidelity\n  Electromagnetic and Structurally Diverse Metasurface Design","authors":"Yunhui Zeng, Hongkun Cao, Xin Jin","authorsParsed":[["Zeng","Yunhui",""],["Cao","Hongkun",""],["Jin","Xin",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 03:11:55 GMT"}],"updateDate":"2024-08-30","timestamp":1724901115000,"abstract":"  In optoelectronics, designing free-form metasurfaces presents significant\nchallenges, particularly in achieving high electromagnetic response fidelity\ndue to the complex relationship between physical structures and electromagnetic\nbehaviors. A key difficulty arises from the one-to-many mapping dilemma, where\nmultiple distinct physical structures can yield similar electromagnetic\nresponses, complicating the design process. This paper introduces a novel\ngenerative framework, the Anchor-controlled Generative Adversarial Network\n(AcGAN), which prioritizes electromagnetic fidelity while effectively\nnavigating the one-to-many challenge to create structurally diverse\nmetasurfaces. Unlike existing methods that mainly replicate physical\nappearances, AcGAN excels in generating a variety of structures that, despite\ntheir differences in physical attributes, exhibit similar electromagnetic\nresponses, thereby accommodating fabrication constraints and tolerances. We\nintroduce the Spectral Overlap Coefficient (SOC) as a precise metric to measure\nthe spectral fidelity between generated designs and their targets.\nAdditionally, a cluster-guided controller refines input processing, ensuring\nmulti-level spectral integration and enhancing electromagnetic fidelity. The\nintegration of AnchorNet into our loss function facilitates a nuanced\nassessment of electromagnetic qualities, supported by a dynamic loss weighting\nstrategy that optimizes spectral alignment. Collectively, these innovations\nrepresent a transformative stride in metasurface inverse design, advancing\nelectromagnetic response-oriented engineering and overcoming the complexities\nof the one-to-many mapping dilemma.Empirical evidence underscores AcGAN's\neffectiveness in streamlining the design process, achieving superior\nelectromagnetic precision, and fostering a broad spectrum of design\npossibilities.\n","subjects":["Physics/Optics","Computing Research Repository/Artificial Intelligence","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eGELP092o1B7wHrZIYfsaHkk7KxA8f-FTfvdXa1Gauo","pdfSize":"4251721"}
