{"id":"2408.15115","title":"A novel numerical framework for three-dimensional fully resolved\n  simulation of freely falling particles of arbitrary shape","authors":"Taraprasad Bhowmick, Jonas Latt, Yong Wang, Gholamhossein Bagheri","authorsParsed":[["Bhowmick","Taraprasad",""],["Latt","Jonas",""],["Wang","Yong",""],["Bagheri","Gholamhossein",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 14:55:00 GMT"}],"updateDate":"2024-08-28","timestamp":1724770500000,"abstract":"  This article introduces a novel numerical framework designed to model the\ninterplay between free-falling particles and their surrounding fluid in\nsituations of high particle to fluid density ratio, typically exhibited by\natmospheric particles. This method is designed to complement experimental\nstudies in vertical wind tunnels to improve the understanding of the\naerodynamic behavior of small atmospheric particles, such as the transport and\nsedimentation of volcanic particles, cloud ice crystals and other application\nareas. The solver is based on the lattice Boltzmann method and it addresses the\nnumerical challenges, including the high density ratio and moderate to high\nReynolds number, by using an immersed-boundary approach and a\nrecursive-regularized collision model. A predictor-corrector scheme is applied\nfor the robust time integration of the six-degrees-of-freedom (6DOF) rigid-body\nmotion. Finally, the multi-scale nature arising from the long free-fall\ndistances of a particle is addressed through a dynamic memory allocation scheme\nallowing for a virtually infinite falling distance. This tool allows for the\nsimulation of particles of arbitrary shape represented by a triangularized\nsurface. The framework is validated against the analytical and experimental\ndata for falling spheres and ellipsoids, and is then applied to the case of an\nactual volcanic particle geometry, the shape of which is obtained from a 3D\nsurface-contour scanning process. The physics of the free-fall of this particle\nis investigated and described, and its terminal velocity is compared against\nthe experimental data measured with the 3D printed exemplars of the same\nparticle.\n","subjects":["Physics/Computational Physics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}