{"id":"2408.14615","title":"Automated model discovery of finite strain elastoplasticity from\n  uniaxial experiments","authors":"Asghar A. Jadoon, Knut A. Meyer, Jan N. Fuhg","authorsParsed":[["Jadoon","Asghar A.",""],["Meyer","Knut A.",""],["Fuhg","Jan N.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 20:22:13 GMT"}],"updateDate":"2024-08-28","timestamp":1724703733000,"abstract":"  Constitutive modeling lies at the core of mechanics, allowing us to map\nstrains onto stresses for a material in a given mechanical setting.\nHistorically, researchers relied on phenomenological modeling where simple\nmathematical relationships were derived through experimentation and curve\nfitting. Recently, to automate the constitutive modeling process, data-driven\napproaches based on neural networks have been explored. While initial naive\napproaches violated established mechanical principles, recent efforts\nconcentrate on designing neural network architectures that incorporate physics\nand mechanistic assumptions into machine-learning-based constitutive models.\nFor history-dependent materials, these models have so far predominantly been\nrestricted to small-strain formulations. In this work, we develop a finite\nstrain plasticity formulation based on thermodynamic potentials to model mixed\nisotropic and kinematic hardening. We then leverage physics-augmented neural\nnetworks to automate the discovery of thermodynamically consistent constitutive\nmodels of finite strain elastoplasticity from uniaxial experiments. We apply\nthe framework to both synthetic and experimental data, demonstrating its\nability to capture complex material behavior under cyclic uniaxial loading.\nFurthermore, we show that the neural network enhanced model trains easier than\ntraditional phenomenological models as it is less sensitive to varying initial\nseeds. our model's ability to generalize beyond the training set underscores\nits robustness and predictive power. By automating the discovery of hardening\nmodels, our approach eliminates user bias and ensures that the resulting\nconstitutive model complies with thermodynamic principles, thus offering a more\nsystematic and physics-informed framework.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"bjEIbKdd5SOID9jYzungkDVCISyyfTL7N5TL44c48Qc","pdfSize":"3211710"}
