{"id":"2408.11753","title":"Small Sample Behavior of Wasserstein Projections, Connections to\n  Empirical Likelihood, and Other Applications","authors":"Sirui Lin, Jose Blanchet, Peter Glynn, Viet Anh Nguyen","authorsParsed":[["Lin","Sirui",""],["Blanchet","Jose",""],["Glynn","Peter",""],["Nguyen","Viet Anh",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 16:23:13 GMT"}],"updateDate":"2024-08-22","timestamp":1724257393000,"abstract":"  The empirical Wasserstein projection (WP) distance quantifies the Wasserstein\ndistance from the empirical distribution to a set of probability measures\nsatisfying given expectation constraints. The WP is a powerful tool because it\nmitigates the curse of dimensionality inherent in the Wasserstein distance,\nmaking it valuable for various tasks, including constructing statistics for\nhypothesis testing, optimally selecting the ambiguity size in Wasserstein\ndistributionally robust optimization, and studying algorithmic fairness. While\nthe weak convergence analysis of the WP as the sample size $n$ grows is well\nunderstood, higher-order (i.e., sharp) asymptotics of WP remain unknown. In\nthis paper, we study the second-order asymptotic expansion and the Edgeworth\nexpansion of WP, both expressed as power series of $n^{-1/2}$. These expansions\nare essential to develop improved confidence level accuracy and a power\nexpansion analysis for the WP-based tests for moment equations null against\nlocal alternative hypotheses. As a by-product, we obtain insightful criteria\nfor comparing the power of the Empirical Likelihood and Hotelling's $T^2$ tests\nagainst the WP-based test. This insight provides the first comprehensive\nguideline for selecting the most powerful local test among WP-based,\nempirical-likelihood-based, and Hotelling's $T^2$ tests for a null.\nFurthermore, we introduce Bartlett-type corrections to improve the\napproximation to WP distance quantiles and, thus, improve the coverage in WP\napplications.\n","subjects":["Mathematics/Statistics Theory","Statistics/Methodology","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}