{"id":"2408.06894","title":"Exploring the generalizability of the optimal 0.234 acceptance rate in\n  random-walk Metropolis and parallel tempering algorithms","authors":"Aidan Li, Liyan Wang, Tianye Dou, Jeffrey S. Rosenthal","authorsParsed":[["Li","Aidan",""],["Wang","Liyan",""],["Dou","Tianye",""],["Rosenthal","Jeffrey S.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 13:42:56 GMT"}],"updateDate":"2024-08-14","timestamp":1723556576000,"abstract":"  For random-walk Metropolis (RWM) and parallel tempering (PT) algorithms, an\nasymptotic acceptance rate of around 0.234 is known to be optimal in the\nhigh-dimensional limit. Yet, the practical relevance of this value is uncertain\ndue to the restrictive conditions underlying its derivation. We synthesise\nprevious theoretical advances in extending the 0.234 acceptance rate to more\ngeneral settings, and demonstrate the applicability and generalizability of the\n0.234 theory for practitioners with a comprehensive empirical simulation study\non a variety of examples examining how acceptance rates affect Expected Squared\nJumping Distance (ESJD). Our experiments show the optimality of the 0.234\nacceptance rate for RWM is surprisingly robust even in lower dimensions across\nvarious proposal and multimodal target distributions which may or may not have\nan i.i.d. product density. Experiments on parallel tempering also show that the\nidealized 0.234 spacing of inverse temperatures may be approximately optimal\nfor low dimensions and non i.i.d. product target densities, and that\nconstructing an inverse temperature ladder with spacings given by a swap\nacceptance of 0.234 is a viable strategy. However, we observe the applicability\nof the 0.234 acceptance rate heuristic diminishes for both RWM and PT\nalgorithms below a certain dimension which differs based on the target density,\nand that inhomogeneously scaled components in the target density further\nreduces its applicability in lower dimensions.\n","subjects":["Statistics/Computation"],"license":"http://creativecommons.org/licenses/by/4.0/"}