{"id":"2408.00891","title":"Temporal Evolution of Knee Osteoarthritis: A Diffusion-based Morphing\n  Model for X-ray Medical Image Synthesis","authors":"Zhe Wang, Aladine Chetouani, Rachid Jennane, Yuhua Ru, Wasim Issa,\n  Mohamed Jarraya","authorsParsed":[["Wang","Zhe",""],["Chetouani","Aladine",""],["Jennane","Rachid",""],["Ru","Yuhua",""],["Issa","Wasim",""],["Jarraya","Mohamed",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 20:00:18 GMT"}],"updateDate":"2024-08-05","timestamp":1722542418000,"abstract":"  Knee Osteoarthritis (KOA) is a common musculoskeletal disorder that\nsignificantly affects the mobility of older adults. In the medical domain,\nimages containing temporal data are frequently utilized to study temporal\ndynamics and statistically monitor disease progression. While deep\nlearning-based generative models for natural images have been widely\nresearched, there are comparatively few methods available for synthesizing\ntemporal knee X-rays. In this work, we introduce a novel deep-learning model\ndesigned to synthesize intermediate X-ray images between a specific patient's\nhealthy knee and severe KOA stages. During the testing phase, based on a\nhealthy knee X-ray, the proposed model can produce a continuous and effective\nsequence of KOA X-ray images with varying degrees of severity. Specifically, we\nintroduce a Diffusion-based Morphing Model by modifying the Denoising Diffusion\nProbabilistic Model. Our approach integrates diffusion and morphing modules,\nenabling the model to capture spatial morphing details between source and\ntarget knee X-ray images and synthesize intermediate frames along a geodesic\npath. A hybrid loss consisting of diffusion loss, morphing loss, and\nsupervision loss was employed. We demonstrate that our proposed approach\nachieves the highest temporal frame synthesis performance, effectively\naugmenting data for classification models and simulating the progression of\nKOA.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}