{"id":"2408.15842","title":"Modelling the underlying event in photon-initiated processes","authors":"J.M. Butterworth, I.M. Helenius, J.J. Juan Castella, B. Pattengale, S.\n  Sanjrani, M. Wing","authorsParsed":[["Butterworth","J. M.",""],["Helenius","I. M.",""],["Castella","J. J. Juan",""],["Pattengale","B.",""],["Sanjrani","S.",""],["Wing","M.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 15:03:18 GMT"}],"updateDate":"2024-08-29","timestamp":1724857398000,"abstract":"  Modelling the underlying event in high-energy hadronic collisions is\nimportant for physics at colliders. This includes lepton colliders, where\nlow-virtuality photons accompanying the lepton beam(s) may develop hadronic\nstructure. Similarly, photon-induced collisions also occur in proton or\nheavy-ion beam experiments. While the underlying event in proton-proton\ncollisions has been the subject of much study at the LHC, studies of\nhadronic-photon-induced underlying event are now of increasing interest in\nlight of planned future lepton and lepton-hadron colliders, as well as the\nphoton-induced processes in ultra-peripheral collisions at the LHC. Here we\npresent an investigation of the underlying event in photon-initiated processes,\nstarting from the PYTHIA models used to describe LHC and Tevatron data, and\nrevisiting HERA and LEP2 data. While no single tune describes all the data with\ndifferent beam configurations, we find that a good agreement can still be found\nwithin the same model by adjusting the relevant parameters separately for\n$\\gamma\\gamma$, $\\gamma p$ and $pp$. This suggests that the basic model of\nmultiparton interaction implemented in PYTHIA can be applied for different beam\nconfigurations. Furthermore, we find that a reasonable agreement for\n$\\gamma\\gamma$ and $\\gamma p$ data, and for $pp$ data at an LHC reference\nenergy, can be found within a single parametrization, but $pp$ collisions would\nprefer a stronger energy dependence, leading to too many multiparton\ninteractions in lower energy photon-induced collisions. On this basis, we make\nsome recommendations for simulations of photon-induced processes, such as\n$\\gamma \\gamma$ events at the LHC or FCC and $ep$ or $eA$ collisions at the\nEIC, and suggest possibilities for improvements in the modelling.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MioQCNPMVjzlVLkFlASWc83vb2X0XNsHN04AHBS585U","pdfSize":"898299"}
