{"id":"2408.03463","title":"Identifying treatment response subgroups in observational time-to-event\n  data","authors":"Vincent Jeanselme, Chang Ho Yoon, Fabian Falck, Brian Tom, Jessica\n  Barrett","authorsParsed":[["Jeanselme","Vincent",""],["Yoon","Chang Ho",""],["Falck","Fabian",""],["Tom","Brian",""],["Barrett","Jessica",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 22:38:14 GMT"}],"updateDate":"2024-08-08","timestamp":1722983894000,"abstract":"  Identifying patient subgroups with different treatment responses is an\nimportant task to inform medical recommendations, guidelines, and the design of\nfuture clinical trials. Existing approaches for subgroup analysis primarily\nfocus on Randomised Controlled Trials (RCTs), in which treatment assignment is\nrandomised. Furthermore, the patient cohort of an RCT is often constrained by\ncost, and is not representative of the heterogeneity of patients likely to\nreceive treatment in real-world clinical practice. Therefore, when applied to\nobservational studies, such approaches suffer from significant statistical\nbiases because of the non-randomisation of treatment. Our work introduces a\nnovel, outcome-guided method for identifying treatment response subgroups in\nobservational studies. Our approach assigns each patient to a subgroup\nassociated with two time-to-event distributions: one under treatment and one\nunder control regime. It hence positions itself in between individualised and\naverage treatment effect estimation. The assumptions of our model result in a\nsimple correction of the statistical bias from treatment non-randomisation\nthrough inverse propensity weighting. In experiments, our approach\nsignificantly outperforms the current state-of-the-art method for\noutcome-guided subgroup analysis in both randomised and observational treatment\nregimes.\n","subjects":["Statistics/Methodology","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}