{"id":"2408.10675","title":"Airfoil Synchronous Surging and Pitching","authors":"C. Strangfeld, H.F. M\\\"uller-Vahl, C.N. Nayeri, C.O. Paschereit and D.\n  Greenblatt","authorsParsed":[["Strangfeld","C.",""],["Müller-Vahl","H. F.",""],["Nayeri","C. N.",""],["Paschereit","C. O.",""],["Greenblatt","D.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 09:27:06 GMT"}],"updateDate":"2024-08-21","timestamp":1724146026000,"abstract":"  Combined pitching-and-surging of an airfoil at the identical frequency (i.e.,\nsynchronously), at four different phase-differences, was investigated\ntheoretically and experimentally. The most general unsteady theoretical\nformulation was adopted to calculate the lift coefficient, and then extended to\nexplicitly compute the unsteady bound vortex sheet. This was used for\ncomparison to experiments and facilitated the computation of both Joukowsky and\nimpulsive-pressure lift contributions. Experiments were performed using a NACA\n0018 airfoil in an unsteady wind tunnel at an average Reynolds number of $3.0\n\\times 10^5$, with a free-stream oscillation amplitude of 0.51, an\nangle-of-attack range of $2^\\circ \\pm 2^\\circ$, and a reduced frequency of\n0.097. In general, excellent correspondence was observed between theory and\nexperiment, representing the first direct experimental validation of the\ngeneral theory. It was shown, both theoretically and experimentally, that the\nlift coefficient was not accurately represented by independent superposition of\nsurging and pitching effects, due to variations in the instantaneous effective\nreduced frequency not accounted for during pure pitching. Deviations from\ntheory, observed at phase-lags of $90^\\circ$ and $180^\\circ$ were attributed to\nbursting of separation bubbles during the early stages of the acceleration\nphase. The largest deviations occurred when the impulsive-pressure lift\ncontribution was small relative to the Joukowsky contribution, because the\nlatter was most affected by bubble-bursting. Bubble-bursting resulted in large\nform-drag oscillations that occurred at identical phase angles within the\noscillation cycle, irrespective of the phase difference between surging and\npitching, as well as in the absence of pitching. The bubble-bursting dynamic\nstall mechanism may have important implications for rotor performance and noise\nemissions.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8i-8wGNvWdFuV7W8pFi0VAb2UuMxPHQopPhxvUMJJH0","pdfSize":"1264781"}
