{"id":"2408.13543","title":"The Parameterized Complexity Landscape of Two-Sets Cut-Uncut","authors":"Matthias Bentert, Fedor V. Fomin, Fanny Hauser, and Saket Saurabh","authorsParsed":[["Bentert","Matthias",""],["Fomin","Fedor V.",""],["Hauser","Fanny",""],["Saurabh","Saket",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 10:28:02 GMT"}],"updateDate":"2024-08-27","timestamp":1724495282000,"abstract":"  In Two-Sets Cut-Uncut, we are given an undirected graph $G=(V,E)$ and two\nterminal sets $S$ and $T$. The task is to find a minimum cut $C$ in $G$ (if\nthere is any) separating $S$ from $T$ under the following ``uncut'' condition.\nIn the graph $(V,E \\setminus C)$, the terminals in each terminal set remain in\nthe same connected component. In spite of the superficial similarity to the\nclassic problem Minimum $s$-$t$-Cut, Two-Sets Cut-Uncut is computationally\nchallenging. In particular, even deciding whether such a cut of any size\nexists, is already NP-complete. We initiate a systematic study of Two-Sets\nCut-Uncut within the context of parameterized complexity. By leveraging known\nrelations between many well-studied graph parameters, we characterize the\nstructural properties of input graphs that allow for polynomial kernels,\nfixed-parameter tractability (FPT), and slicewise polynomial algorithms (XP).\nOur main contribution is the near-complete establishment of the complexity of\nthese algorithmic properties within the described hierarchy of graph\nparameters. On a technical level, our main results are fixed-parameter\ntractability for the (vertex-deletion) distance to cographs and an OR-cross\ncomposition excluding polynomial kernels for the vertex cover number of the\ninput graph (under the standard complexity assumption NP is not contained in\ncoNP/poly).\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Discrete Mathematics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"v5RSx_MWDS19RmegRiosrZJO_MtJC9qwKQ2dSnRyeO8","pdfSize":"317799"}
