{"id":"2408.05623","title":"Behavioral and Topological Heterogeneities in Network Versions of\n  Schelling's Segregation Model","authors":"Will Deter and Hiroki Sayama","authorsParsed":[["Deter","Will",""],["Sayama","Hiroki",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 20:10:54 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 00:38:54 GMT"}],"updateDate":"2024-08-14","timestamp":1723320654000,"abstract":"  Agent-based models of residential segregation have been of persistent\ninterest to various research communities since their origin with James Sakoda\nand popularization by Thomas Schelling. Frequently, these models have sought to\nelucidate the extent to which the collective dynamics of individual preferences\nmay cause segregation to emerge. This open question has sustained relevance in\nU.S. jurisprudence. Previous investigation of heterogeneity of behaviors\n(preferences) by Xie & Zhou has shown reductions in segregation. Meanwhile,\nprevious investigation of heterogeneity of social network topologies by\nGandica, Gargiulo, and Carletti has shown no significant impact to observed\nsegregation levels. In the present study, we examined effects of the concurrent\npresence of both behavioral and topological heterogeneities in network\nsegregation models. Simulations were conducted using both Schelling's and Xie &\nZhou's preference models on 2D lattices with varied levels of densification to\ncreate topological heterogeneities (i.e., clusters, hubs). Results show a\nricher variety of outcomes, including novel differences in resultant\nsegregation levels and hub composition. Notably, with concurrent increased\nrepresentations of heterogeneous preferences and heterogenous topologies,\nreduced levels of segregation emerge. Simultaneously, we observe a novel\ndynamic of segregation between tolerance levels as highly tolerant nodes take\nresidence in dense areas and push intolerant nodes to sparse areas mimicking\nthe urban-rural divide.\n","subjects":["Physics/Physics and Society","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}