{"id":"2408.02777","title":"DUST: A Framework for Data-Driven Density Steering","authors":"Joshua Pilipovsky and Panagiotis Tsiotras","authorsParsed":[["Pilipovsky","Joshua",""],["Tsiotras","Panagiotis",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 18:55:50 GMT"}],"updateDate":"2024-08-07","timestamp":1722884150000,"abstract":"  We consider the problem of data-driven stochastic optimal control of an\nunknown LTI dynamical system. Assuming the process noise is normally\ndistributed, we pose the problem of steering the state's mean and covariance to\na target normal distribution, under noisy data collected from the underlying\nsystem, a problem commonly referred to as covariance steering (CS). A novel\nframework for Data-driven Uncertainty quantification and density STeering\n(DUST) is presented that simultaneously characterizes the noise affecting the\nmeasured data and designs an optimal affine-feedback controller to steer the\ndensity of the state to a prescribed terminal value. We use both indirect and\ndirect data-driven design approaches based on the notions of persistency of\nexcitation and subspace predictors to exactly represent the mean and covariance\ndynamics of the state in terms of the data and noise realizations. Since both\nthe mean and the covariance steering sub-problems are plagued with\ndistributional uncertainty arising from noisy data collection, we first\nestimate the noise realization from this dataset and subsequently compute\ntractable upper bounds on the estimation errors. The moment steering problems\nare then solved to optimality using techniques from robust control and robust\noptimization. Lastly, we present an alternative control design approach based\non the certainty equivalence principle and interpret the problem as one of CS\nunder multiplicative uncertainties. We analyze the performance and efficacy of\neach of these data-driven approaches using a case study and compare them with\ntheir model-based counterparts.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}