{"id":"2408.13498","title":"Rethinking State Disentanglement in Causal Reinforcement Learning","authors":"Haiyao Cao, Zhen Zhang, Panpan Cai, Yuhang Liu, Jinan Zou, Ehsan\n  Abbasnejad, Biwei Huang, Mingming Gong, Anton van den Hengel, Javen Qinfeng\n  Shi","authorsParsed":[["Cao","Haiyao",""],["Zhang","Zhen",""],["Cai","Panpan",""],["Liu","Yuhang",""],["Zou","Jinan",""],["Abbasnejad","Ehsan",""],["Huang","Biwei",""],["Gong","Mingming",""],["Hengel","Anton van den",""],["Shi","Javen Qinfeng",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 06:49:13 GMT"}],"updateDate":"2024-08-27","timestamp":1724482153000,"abstract":"  One of the significant challenges in reinforcement learning (RL) when dealing\nwith noise is estimating latent states from observations. Causality provides\nrigorous theoretical support for ensuring that the underlying states can be\nuniquely recovered through identifiability. Consequently, some existing work\nfocuses on establishing identifiability from a causal perspective to aid in the\ndesign of algorithms. However, these results are often derived from a purely\ncausal viewpoint, which may overlook the specific RL context. We revisit this\nresearch line and find that incorporating RL-specific context can reduce\nunnecessary assumptions in previous identifiability analyses for latent states.\nMore importantly, removing these assumptions allows algorithm design to go\nbeyond the earlier boundaries constrained by them. Leveraging these insights,\nwe propose a novel approach for general partially observable Markov Decision\nProcesses (POMDPs) by replacing the complicated structural constraints in\nprevious methods with two simple constraints for transition and reward\npreservation. With the two constraints, the proposed algorithm is guaranteed to\ndisentangle state and noise that is faithful to the underlying dynamics.\nEmpirical evidence from extensive benchmark control tasks demonstrates the\nsuperiority of our approach over existing counterparts in effectively\ndisentangling state belief from noise.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}