{"id":"2408.12491","title":"AI in radiological imaging of soft-tissue and bone tumours: a systematic\n  review evaluating against CLAIM and FUTURE-AI guidelines","authors":"Douwe J. Spaanderman (1), Matthew Marzetti (2,3), Xinyi Wan (1),\n  Andrew F. Scarsbrook (4,5), Philip Robinson (4), Edwin H.G. Oei (1), Jacob J.\n  Visser (1), Robert Hemke (6), Kirsten van Langevelde (7), David F. Hanff (1),\n  Geert J.L.H. van Leenders (8), Cornelis Verhoef (9), Dirk J. Gru\\\"uhagen (9),\n  Wiro J. Niessen (1,10), Stefan Klein (1), Martijn P.A. Starmans (1) ((1)\n  Department of Radiology and Nuclear Medicine, Erasmus MC Cancer Institute,\n  University Medical Center Rotterdam, Rotterdam, the Netherlands, (2)\n  Department of Medical Physics, Leeds Teaching Hospitals NHS Trust, UK, (3)\n  Leeds Biomedical Research Centre, University of Leeds, UK, (4) Department of\n  Radiology, Leeds Teaching Hospitals NHS Trust, UK, (5) Leeds Institute of\n  Medical Research, University of Leeds, UK, (6) Department of Radiology and\n  Nuclear Medicine, Amsterdam UMC, Amsterdam, the Netherlands, (7) Department\n  of Radiology, Leiden University Medical Center, Leiden, the Netherlands, (8)\n  Department of Pathology, Erasmus MC Cancer Institute, University Medical\n  Center Rotterdam, Rotterdam, the Netherlands, (9) Department of Surgical\n  Oncology, Erasmus MC Cancer Institute, University Medical Center Rotterdam,\n  Rotterdam, the Netherlands, (10) Faculty of Medical Sciences, University of\n  Groningen, Groningen, the Netherlands)","authorsParsed":[["Spaanderman","Douwe J.",""],["Marzetti","Matthew",""],["Wan","Xinyi",""],["Scarsbrook","Andrew F.",""],["Robinson","Philip",""],["Oei","Edwin H. G.",""],["Visser","Jacob J.",""],["Hemke","Robert",""],["van Langevelde","Kirsten",""],["Hanff","David F.",""],["van Leenders","Geert J. L. H.",""],["Verhoef","Cornelis",""],["Gruühagen","Dirk J.",""],["Niessen","Wiro J.",""],["Klein","Stefan",""],["Starmans","Martijn P. A.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 15:31:48 GMT"}],"updateDate":"2024-08-23","timestamp":1724340708000,"abstract":"  Soft-tissue and bone tumours (STBT) are rare, diagnostically challenging\nlesions with variable clinical behaviours and treatment approaches. This\nsystematic review provides an overview of Artificial Intelligence (AI) methods\nusing radiological imaging for diagnosis and prognosis of these tumours,\nhighlighting challenges in clinical translation, and evaluating study alignment\nwith the Checklist for AI in Medical Imaging (CLAIM) and the FUTURE-AI\ninternational consensus guidelines for trustworthy and deployable AI to promote\nthe clinical translation of AI methods. The review covered literature from\nseveral bibliographic databases, including papers published before 17/07/2024.\nOriginal research in peer-reviewed journals focused on radiology-based AI for\ndiagnosing or prognosing primary STBT was included. Exclusion criteria were\nanimal, cadaveric, or laboratory studies, and non-English papers. Abstracts\nwere screened by two of three independent reviewers for eligibility. Eligible\npapers were assessed against guidelines by one of three independent reviewers.\nThe search identified 15,015 abstracts, from which 325 articles were included\nfor evaluation. Most studies performed moderately on CLAIM, averaging a score\nof 28.9$\\pm$7.5 out of 53, but poorly on FUTURE-AI, averaging 5.1$\\pm$2.1 out\nof 30. Imaging-AI tools for STBT remain at the proof-of-concept stage,\nindicating significant room for improvement. Future efforts by AI developers\nshould focus on design (e.g. define unmet clinical need, intended clinical\nsetting and how AI would be integrated in clinical workflow), development (e.g.\nbuild on previous work, explainability), evaluation (e.g. evaluating and\naddressing biases, evaluating AI against best practices), and data\nreproducibility and availability (making documented code and data publicly\navailable). Following these recommendations could improve clinical translation\nof AI methods.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"R1hBL_l3OvfLdkk94sCxZB33hbTZF6AHIlEsgEIQIMc","pdfSize":"6387289"}
