{"id":"2408.09477","title":"Nonequilibrium Steady State Full Counting Statistics in the Noncrossing\n  Approximation","authors":"Ido Zemach, Andre Erpenbeck, Emanuel Gull and Guy Cohen","authorsParsed":[["Zemach","Ido",""],["Erpenbeck","Andre",""],["Gull","Emanuel",""],["Cohen","Guy",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 13:47:00 GMT"}],"updateDate":"2024-08-20","timestamp":1723988820000,"abstract":"  Quantum transport is often characterized not just by mean observables like\nthe particle or energy current, but by their fluctuations and higher moments,\nwhich can act as detailed probes of the physical mechanisms at play. However,\nrelatively few theoretical methods are able to access the full counting\nstatistics (FCS) of transport processes through electronic junctions in\nstrongly correlated regimes. While most experiments are concerned with the\nsteady state properties, most accurate theoretical methods rely on\ncomputationally expensive propagation from a tractable initial state. Here, we\npropose a simple approach for computing the FCS through a junction directly at\nthe steady state, utilizing the propagator noncrossing approximation (NCA).\nCompared to time propagation, our method offers reduced computational cost at\nthe same level of approximation; but the idea can also be used within other\napproximations or as a basis for numerically exact techniques. We demonstrate\nthe method's capabilities by investigating the impact of lead dimensionality on\nelectronic transport in the nonequilibrium Anderson impurity model at the onset\nof Kondo physics. Our results reveal a distinct signature of one dimensional\nleads in the noise and Fano factor not present for other dimensionalities,\nshowing the potential of FCS measurements as a probe of the environment\nsurrounding a quantum dot.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/"}