{"id":"2408.01592","title":"OGLE-IV Period-Luminosity relation of the LMC: an analysis using mean\n  and median magnitudes","authors":"Jaime Mu\\~noz, Alejandro Garc\\'ia-Varela, Santiago Henao-Castellanos,\n  Beatriz Sabogal, Luis Felipe Giraldo","authorsParsed":[["Muñoz","Jaime",""],["García-Varela","Alejandro",""],["Henao-Castellanos","Santiago",""],["Sabogal","Beatriz",""],["Giraldo","Luis Felipe",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 22:32:13 GMT"}],"updateDate":"2024-08-06","timestamp":1722637933000,"abstract":"  TThe Period-Luminosity (PL) relation for Cepheid variable stars in the Large\nMagellanic Cloud (LMC) is crucial for distance measurements in astronomy. This\nstudy analyzes the impact of using the median rather than the mean on the PL\nrelation's slope and zero point. It also examines the persistence of the break\nat approximately 10 days and addresses specification issues in the PL relation\nmodel. Using $VI$-band median and mean magnitudes from the OGLE-IV survey,\ncorrected for extinction, we fit the PL relation employing robust\n$MM$-regression, which features a high breakdown point and robust standard\nerrors. Statistical tests and residual analysis are conducted to identify and\ncorrect model deficiencies. Our findings indicate a significant change in the\nPL relation for Cepheids with periods of 10 days or longer, regardless of\nwhether median or mean magnitudes are used. A bias in the zero point and slope\nestimators is observed when using median magnitudes instead of mean magnitudes,\nespecially in the $V$-band. By identifying and correcting regression issues and\nconsidering the period break, our estimators for slope and zero point are more\naccurate for distance calculations. Comparative analysis of the models for each\nband quantifies the bias introduced by using median magnitudes, highlighting\nthe importance of considering the Cepheids' period for accurate location\nmeasure results, similar to those obtained using mean magnitudes.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oDt4SpVz5wqGp_Fua55DnB1wU-8nsPFlNDrfXCoS0ko","pdfSize":"3226785","txDigest":"F6gXdYreoXLM6VMNTRb3rewTUoZXrTk7qHVBggEXRKKN","endEpoch":"1","status":"CERTIFIED"}
