{"id":"2408.02708","title":"Scribble-Based Interactive Segmentation of Medical Hyperspectral Images","authors":"Zhonghao Wang, Junwen Wang, Charlie Budd, Oscar MacCormac, Jonathan\n  Shapey, Tom Vercauteren","authorsParsed":[["Wang","Zhonghao",""],["Wang","Junwen",""],["Budd","Charlie",""],["MacCormac","Oscar",""],["Shapey","Jonathan",""],["Vercauteren","Tom",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 12:33:07 GMT"}],"updateDate":"2024-08-07","timestamp":1722861187000,"abstract":"  Hyperspectral imaging (HSI) is an advanced medical imaging modality that\ncaptures optical data across a broad spectral range, providing novel insights\ninto the biochemical composition of tissues. HSI may enable precise\ndifferentiation between various tissue types and pathologies, making it\nparticularly valuable for tumour detection, tissue classification, and disease\ndiagnosis.\n  Deep learning-based segmentation methods have shown considerable\nadvancements, offering automated and accurate results. However, these methods\nface challenges with HSI datasets due to limited annotated data and\ndiscrepancies from hardware and acquisition\ntechniques~\\cite{clancy2020surgical,studier2023heiporspectral}. Variability in\nclinical protocols also leads to different definitions of structure boundaries.\nInteractive segmentation methods, utilizing user knowledge and clinical\ninsights, can overcome these issues and achieve precise segmentation results\n\\cite{zhao2013overview}.\n  This work introduces a scribble-based interactive segmentation framework for\nmedical hyperspectral images. The proposed method utilizes deep learning for\nfeature extraction and a geodesic distance map generated from user-provided\nscribbles to obtain the segmentation results. The experiment results show that\nutilising the geodesic distance maps based on deep learning-extracted features\nachieved better segmentation results than geodesic distance maps directly\ngenerated from hyperspectral images, reconstructed RGB images, or Euclidean\ndistance maps.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}