{"id":"2408.13421","title":"Idle wage as a tool to regulate the relationship between ride-hailing\n  platforms and drivers","authors":"Andr\\'es Fielbaum, David Salas, Ruilin Zhang, Francisco Castro","authorsParsed":[["Fielbaum","Andrés",""],["Salas","David",""],["Zhang","Ruilin",""],["Castro","Francisco",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 01:26:05 GMT"}],"updateDate":"2024-08-27","timestamp":1724462765000,"abstract":"  Ride-hailing platforms typically classify drivers as either employees or\nindependent contractors. These classifications tend to emphasize either wage\ncertainty or flexibility, but rarely both. We study an alternative or\ncomplementary approach: the \\textit{Idle wage,} which provides with a fixed\npayment drivers even when they are connected without passengers on board. We\nadapt a well-known economic model of the supply-demand equilibrium in\nride-hailing platforms and analyse how the optimal welfare and profit change\nwith the introduction of an idle wage when drivers are risk-averse.\n  We show that in a single-period setting, risk aversion implies that it is\noptimal to pay the drivers only through an idle wage. However, if the pool of\navailable drivers is large, even a small idle wage could attract too many\ndrivers, rendering the system unprofitable.\n  When the demand fluctuates throughout multiple periods, we show that if the\nidle wage has to be constant, then it is optimal to combine the idle wage with\nthe traditional payment via trips, so that surge pricing influences the number\nof drivers connected. This illustrates a relevant trade-off: Risk-aversion\nfavours using the idle wage to attract drivers; however, if the platform is not\nallowed to fully adjust the idle wage over time, there may be periods in which\nthe idle wage cannot resolve the mismatch between supply and demand. We propose\na partially flexible constraint that still makes the idle wage-only solution\nviable. It allows the idle wage to adapt per period, as long as it fulfills a\ntotal minimum wage requirement.\n  Numerical simulations suggest that the idle wage policy, if properly\nimplemented, could be beneficial for the system as a whole.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}