{"id":"2408.04820","title":"Natural Language Outlines for Code: Literate Programming in the LLM Era","authors":"Kensen Shi, Deniz Alt{\\i}nb\\\"uken, Saswat Anand, Mihai Christodorescu,\n  Katja Gr\\\"unwedel, Alexa Koenings, Sai Naidu, Anurag Pathak, Marc Rasi,\n  Fredde Ribeiro, Brandon Ruffin, Siddhant Sanyam, Maxim Tabachnyk, Sara Toth,\n  Roy Tu, Tobias Welp, Pengcheng Yin, Manzil Zaheer, Satish Chandra, Charles\n  Sutton","authorsParsed":[["Shi","Kensen",""],["Altınbüken","Deniz",""],["Anand","Saswat",""],["Christodorescu","Mihai",""],["Grünwedel","Katja",""],["Koenings","Alexa",""],["Naidu","Sai",""],["Pathak","Anurag",""],["Rasi","Marc",""],["Ribeiro","Fredde",""],["Ruffin","Brandon",""],["Sanyam","Siddhant",""],["Tabachnyk","Maxim",""],["Toth","Sara",""],["Tu","Roy",""],["Welp","Tobias",""],["Yin","Pengcheng",""],["Zaheer","Manzil",""],["Chandra","Satish",""],["Sutton","Charles",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 02:22:51 GMT"}],"updateDate":"2024-08-16","timestamp":1723170171000,"abstract":"  We propose using natural language outlines as a novel modality and\ninteraction surface for providing AI assistance to developers throughout the\nsoftware development process. An NL outline for a code function comprises\nmultiple statements written in concise prose, which partition the code and\nsummarize its main ideas in the style of literate programming. Crucially, we\nfind that modern LLMs can generate accurate and high-quality NL outlines in\npractice. Moreover, NL outlines enable a bidirectional sync between code and\nNL, allowing changes in one to be automatically reflected in the other. We\ndiscuss many use cases for NL outlines: they can accelerate understanding and\nnavigation of code and diffs, simplify code maintenance, augment code search,\nsteer code generation, and more. We then propose and compare multiple LLM\nprompting techniques for generating outlines and ask professional developers to\njudge outline quality. Finally, we present two case studies applying NL\noutlines toward code review and the difficult task of malware detection.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}