{"id":"2408.13255","title":"Ensemble Modeling of Multiple Physical Indicators to Dynamically\n  Phenotype Autism Spectrum Disorder","authors":"Marie Huynh (1), Aaron Kline (1), Saimourya Surabhi (1), Kaitlyn\n  Dunlap (1), Onur Cezmi Mutlu (1), Mohammadmahdi Honarmand (1), Parnian\n  Azizian (1), Peter Washington (2), Dennis P. Wall (1) ((1) Stanford\n  University, (2) University of Hawaii at Manoa)","authorsParsed":[["Huynh","Marie",""],["Kline","Aaron",""],["Surabhi","Saimourya",""],["Dunlap","Kaitlyn",""],["Mutlu","Onur Cezmi",""],["Honarmand","Mohammadmahdi",""],["Azizian","Parnian",""],["Washington","Peter",""],["Wall","Dennis P.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 17:55:58 GMT"}],"updateDate":"2024-08-26","timestamp":1724435758000,"abstract":"  Early detection of autism, a neurodevelopmental disorder marked by social\ncommunication challenges, is crucial for timely intervention. Recent\nadvancements have utilized naturalistic home videos captured via the mobile\napplication GuessWhat. Through interactive games played between children and\ntheir guardians, GuessWhat has amassed over 3,000 structured videos from 382\nchildren, both diagnosed with and without Autism Spectrum Disorder (ASD). This\ncollection provides a robust dataset for training computer vision models to\ndetect ASD-related phenotypic markers, including variations in emotional\nexpression, eye contact, and head movements. We have developed a protocol to\ncurate high-quality videos from this dataset, forming a comprehensive training\nset. Utilizing this set, we trained individual LSTM-based models using eye\ngaze, head positions, and facial landmarks as input features, achieving test\nAUCs of 86%, 67%, and 78%, respectively. To boost diagnostic accuracy, we\napplied late fusion techniques to create ensemble models, improving the overall\nAUC to 90%. This approach also yielded more equitable results across different\ngenders and age groups. Our methodology offers a significant step forward in\nthe early detection of ASD by potentially reducing the reliance on subjective\nassessments and making early identification more accessibly and equitable.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lUbKUFG2JAsHzMzZzXcp394BE1pV-LOhWVk2LYVXY2k","pdfSize":"2319782"}
