{"id":"2408.13104","title":"EBSD and TKD analyses using inverted contrast Kikuchi diffraction\n  patterns and alternative measurement geometries","authors":"Grzegorz Cios, Aimo Winkelmann, Gert Nolze, Tomasz Tokarski, Benedykt\n  R. Jany, Piotr Ba{\\l}a","authorsParsed":[["Cios","Grzegorz",""],["Winkelmann","Aimo",""],["Nolze","Gert",""],["Tokarski","Tomasz",""],["Jany","Benedykt R.",""],["Bała","Piotr",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 14:26:54 GMT"}],"updateDate":"2024-08-26","timestamp":1724423214000,"abstract":"  Electron backscatter diffraction (EBSD) patterns can exhibit Kikuchi bands\nwith inverted contrast due to anomalous absorption. This can be observed, for\nexample, on samples with nanoscale topography, in case of a low tilt\nbackscattering geometry, or for transmission Kikuchi diffraction (TKD) on\nthicker samples. Three examples are discussed where contrast-inverted\nphysics-based simulated master patterns have been applied to find the correct\ncrystal orientation. As the first EBSD example, self-assembled gold\nnanostructures made of Au fcc and Au hcp phases on single-crystal germanium\nwere investigated. Gold covered about 12% of the mapped area, with only\ntwo-thirds being successfully interpreted using standard Hough-based indexing.\nThe remaining third was solved by brute force indexing using a\ncontrast-inverted master pattern. The second EBSD example deals with maps\ncollected at a non-tilted surface instead of the commonly used 70 degree tilted\none. As TKD example, a jet-polished foil made of duplex stainless steel 2205\nwas examined. The thin part close to the hole edge producing normal-contrast\npatterns were standard indexed. The areas of the foil that become thicker with\nincreasing distance from the edge of the hole produce contrast-inverted\npatterns. They covered three times the evaluable area and were successfully\nprocessed using the contrast-inverted master pattern. In the last example,\ninverted patterns collected at a non-tiled sample were mathematically inverted\nto normal contrast, and Hough/Radon-based indexing was successfully applied.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}