{"id":"2408.13238","title":"Self-triggered strong-field QED collisions in laser-plasma interaction","authors":"Aim\\'e Matheron, Igor Andriyash, Xavier Davoine, Laurent Gremillet,\n  Mattys Pouyez, Mickael Grech, Livia Lancia, Kim Ta Phuoc, S\\'ebastien Corde","authorsParsed":[["Matheron","Aimé",""],["Andriyash","Igor",""],["Davoine","Xavier",""],["Gremillet","Laurent",""],["Pouyez","Mattys",""],["Grech","Mickael",""],["Lancia","Livia",""],["Phuoc","Kim Ta",""],["Corde","Sébastien",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 17:25:29 GMT"}],"updateDate":"2024-08-26","timestamp":1724433929000,"abstract":"  Exploring quantum electrodynamics in the most extreme conditions, where\nelectron-positron pairs can emerge in the presence of a strong background\nfield, is now becoming possible in Compton collisions between ultraintense\nlasers and energetic electrons. In the strong-field regime, the colliding\nelectron emits $\\gamma$ rays that decay into pairs in the strong laser field.\nWhile the combination of conventional accelerators and lasers of sufficient\npower poses significant challenges, laser-plasma accelerators offer a promising\nalternative for producing the required multi-GeV electron beams. To overcome\nthe complexities of colliding these beams with another ultraintense laser\npulse, we propose a novel scheme in which a single laser pulse both accelerates\nthe electrons and collides with them after self-focusing in a dedicated plasma\nsection and reflecting off a plasma mirror. The laser intensity boost in the\nplasma allows the quantum interaction parameter to be greatly increased. Using\nfull-scale numerical simulations, we demonstrate that a single 100 J laser\npulse can achieve a deep quantum regime with electric fields in the electron\nrest frame as high as $\\chi_e\\sim 5$ times the Schwinger critical field,\nresulting in the production of about 40 pC of positrons.\n","subjects":["Physics/Plasma Physics","Physics/Accelerator Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xheBSpc4nG-y25C-3F6lJ7MAzoDKfe6n8cAorxASPmY","pdfSize":"2120682"}
