{"id":"2408.12914","title":"A Recursion-Based SNR Determination Method for Short Packet\n  Transmission: Analysis and Applications","authors":"Chengzhe Yin, Rui Zhang, Yongzhao Li, Yuhan Ruan, Tao Li, and Jiaheng\n  Lu","authorsParsed":[["Yin","Chengzhe",""],["Zhang","Rui",""],["Li","Yongzhao",""],["Ruan","Yuhan",""],["Li","Tao",""],["Lu","Jiaheng",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 08:45:12 GMT"}],"updateDate":"2024-08-26","timestamp":1724402712000,"abstract":"  The short packet transmission (SPT) has gained much attention in recent\nyears. In SPT, the most significant characteristic is that the finite\nblocklength code (FBC) is adopted. With FBC, the signal-to-noise ratio (SNR)\ncannot be expressed as an explicit function with respect to the other\ntransmission parameters. This raises the following two problems for the\nresource allocation in SPTs: (i) The exact value of the SNR is hard to\ndetermine, and (ii) The property of SNR w.r.t. the other parameters is hard to\nanalyze, which hinders the efficient optimization of them. To simultaneously\ntackle these problems, we have developed a recursion method in our prior work.\nTo emphasize the significance of this method, we further analyze the\nconvergence rate of the recursion method and investigate the property of the\nrecursion function in this paper. Specifically, we first analyze the\nconvergence rate of the recursion method, which indicates it can determine the\nSNR with low complexity. Then, we analyze the property of the recursion\nfunction, which facilitates the optimization of the other parameters during the\nrecursion. Finally, we also enumerate some applications for the recursion\nmethod. Simulation results indicate that the recursion method converges faster\nthan the other SNR determination methods. Besides, the results also show that\nthe recursion-based methods can almost achieve the optimal solution of the\napplication cases.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}