{"id":"2408.12021","title":"R-STELLAR: A Resilient Synthesizable Signature Attenuation SCA\n  Protection on AES-256 with built-in Attack-on-Countermeasure Detection","authors":"Archisman Ghosh, Dong-Hyun Seo, Debayan Das, Santosh Ghosh, and\n  Shreyas Sen","authorsParsed":[["Ghosh","Archisman",""],["Seo","Dong-Hyun",""],["Das","Debayan",""],["Ghosh","Santosh",""],["Sen","Shreyas",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 22:29:33 GMT"}],"updateDate":"2024-08-23","timestamp":1724279373000,"abstract":"  Side channel attacks (SCAs) remain a significant threat to the security of\ncryptographic systems in modern embedded devices. Even mathematically secure\ncryptographic algorithms, when implemented in hardware, inadvertently leak\ninformation through physical side channel signatures such as power consumption,\nelectromagnetic (EM) radiation, light emissions, and acoustic emanations.\nExploiting these side channels significantly reduces the search space of the\nattacker. In recent years, physical countermeasures have significantly\nincreased the minimum traces to disclosure (MTD) to 1 billion. Among them,\nsignature attenuation is the first method to achieve this mark. Signature\nattenuation often relies on analog techniques, and digital signature\nattenuation reduces MTD to 20 million, requiring additional methods for high\nresilience. We focus on improving the digital signature attenuation by an order\nof magnitude (MTD 200M). Additionally, we explore possible attacks against\nsignature attenuation countermeasure. We introduce a Voltage drop Linear region\nBiasing (VLB) attack technique that reduces the MTD to over 2000 times less\nthan the previous threshold. This is the first known attack against a physical\nside-channel attack (SCA) countermeasure. We have implemented an attack\ndetector with a response time of 0.8 milliseconds to detect such attacks,\nlimiting SCA leakage window to sub-ms, which is insufficient for a successful\nattack.\n","subjects":["Computing Research Repository/Cryptography and Security","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}