{"id":"2408.02390","title":"Dynamics of Relativistic Vortex Electrons in External Laser Fields","authors":"Mamutjan Ababekri, Yu Wang, Ren-Tong Guo, Zhong-Peng Li, Jian-Xing Li","authorsParsed":[["Ababekri","Mamutjan",""],["Wang","Yu",""],["Guo","Ren-Tong",""],["Li","Zhong-Peng",""],["Li","Jian-Xing",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 11:32:50 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 15:40:23 GMT"}],"updateDate":"2024-08-12","timestamp":1722857570000,"abstract":"  Investigating vortex electron interactions with electromagnetic fields is\nessential for advancing particle acceleration techniques, scattering theory in\nbackground fields, and obtaining novel electron beams for material diagnostics.\nA systematic investigation into the dynamics of vortex electrons in external\nlaser fields and the exploration of laser-induced vortex modes remains lacking.\nIn this work, we study the propagation of vortex electrons in linearly\npolarized (LP) and circularly polarized (CP) laser pulses, both separately and\nin their combined form in two-mode laser pulses. The theoretical formalism is\ndeveloped by utilizing Volkov-Bessel wave functions, and the four-current\ndensity is obtained as a crucial observable quantity. Numerical results\nillustrate the dynamics of vortex electrons in external lasers, showing that\nthe beam center of the vortex electron follows the classical motion of a point\ncharge electron, while maintaining the probability distribution structure for\nboth vortex eigenstates and superposition modes. The combined effect of LP and\nCP laser pulses in the two-mode laser field allows for the versatile control of\nvortex electrons, which is absent with LP or CP lasers alone, at femtosecond\nand sub-nanometer scales. Our findings demonstrate the versatile control over\nvortex electrons via laser pulses, with our formalism providing a reference for\nvortex scattering in laser backgrounds and inspiring the laser-controlled\nachievement of novel vortex modes as targeted diagnostic probes for specialized\nmaterials.\n","subjects":["Physics/Optics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}