{"id":"2408.07158","title":"Dynamical kinetic energy quenching in the antiferromagnetic quantum\n  critical metals","authors":"Anton Borissov, Vladimir Calvera, Sung-Sik Lee","authorsParsed":[["Borissov","Anton",""],["Calvera","Vladimir",""],["Lee","Sung-Sik",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 18:55:48 GMT"}],"updateDate":"2024-08-15","timestamp":1723575348000,"abstract":"  We study the dynamics of critical spin fluctuations and hot electrons at the\nmetallic antiferromagnetic quantum critical points with $Z_2$ and $O(2)$ spin\nsymmetries, building upon earlier works on the $O(3)$ symmetric theory. The\ninteracting theories in $2+1$ dimensions are approached from $3+1$-dimensional\ntheories in the $\\epsilon$-expansion that tunes the co-dimension of Fermi\nsurface as a control parameter. The low-energy physics of the $Z_2$ and $O(2)$\ntheories qualitatively differ from each other and also from that of the $O(3)$\ntheory. The difference is caused by higher-order quantum corrections beyond the\none-loop order that are important even to the leading order in $\\epsilon$. The\nnaive loop-expansion breaks down due to dynamical quenching of kinetic energy:\nthe speed of the collective mode ($c$) and the Fermi velocity perpendicular to\nthe magnetic ordering vector ($v$) become vanishingly small at low energies.\nWhat sets the three theories apart is the hierarchy that emerges between the\nquenched kinetic terms. At the infrared fixed point, $c/v$ becomes $0$, $1$ and\n$\\infty$ in the $Z_2$, $O(2)$ and $O(3)$ theories, respectively. At\nintermediate energy scales, the slow renormalization group (RG) flows of $c$\nand $v$ toward their fixed point values create approximate scale invariance\ncontrolled by approximate marginal parameters. The manifold of those\nquasi-fixed points and the RG flow therein determines crossovers from scaling\nbehaviours with transient critical exponents at intermediate energy scales to\nthe universal scaling in the low-energy limit. If the symmetry group is viewed\nas a tuning parameter, the $O(2)$ theory corresponds to a multi-critical point\nwhich has one additional quasi-marginal parameter than the other two theories.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}