{"id":"2408.06076","title":"Pebble-driven migration of low-mass planets in the 2D regime of pebble\n  accretion","authors":"O. Chrenko, R. O. Chametla, F. S. Masset, C. Baruteau, M. Bro\\v{z}","authorsParsed":[["Chrenko","O.",""],["Chametla","R. O.",""],["Masset","F. S.",""],["Baruteau","C.",""],["Brož","M.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 11:51:06 GMT"}],"updateDate":"2024-08-13","timestamp":1723463466000,"abstract":"  <Context> Pebbles drifting past a disk-embedded low-mass planet develop\nasymmetries in their distribution and exert a substantial gravitational torque\non the planet, thus modifying its migration rate. <Aims> Our aim is to assess\nhow the distribution of pebbles and the resulting torque change in the presence\nof pebble accretion, focusing on its 2D regime. <Methods> First, we performed\n2D high-resolution multi-fluid simulations with Fargo3D but found that they are\nimpractical for resolving pebble accretion due to the smoothing of the\nplanetary gravitational potential. To remove the smoothing and directly trace\npebbles accreted by the planet, we developed a new code, Deneb, which evolves\nan ensemble of pebbles, represented by Lagrangian superparticles, in a\nsteady-state gaseous background. <Results> For small and moderate Stokes\nnumbers, St $\\lesssim 0.1$, pebble accretion creates two underdense regions\nwith a front-rear asymmetry with respect to the planet. The underdensity\ntrailing the planet is more extended. The resulting excess of pebble mass in\nfront of the planet then makes the pebble torque positive and capable of\noutperforming the negative gas torque. Pebble accretion thus enables outward\nmigration (previously thought to occur mainly for St $\\gtrsim 0.1$) in a larger\nportion of the parameter space. It occurs for the planet mass\n$M_{pl}\\lesssim3\\,M_{\\oplus}$ and for all the Stokes numbers considered in our\nstudy, St $\\in$ [$10^{-2}, 0.785$], assuming a pebble-to-gas mass ratio of $Z =\n0.01$. <Conclusions> If some of the observed planets underwent outward\npebble-driven migration during their accretion, the formation sites of their\nprogenitor embryos could have differed greatly from the usual predictions of\nplanet formation models. To enable an update of the respective models, we\nprovide a scaling law for the pebble torque that can be readily incorporated in\nN-body simulations.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}