{"id":"2408.08353","title":"On the Origin of Star Formation Quenching of Galaxies in Group\n  Environments using the NewHorizon simulation","authors":"Jinsu Rhee, Sukyoung K. Yi, Jongwan Ko, Emanuele Contini, J. K. Jang,\n  Seyoung Jeon, San Han, Christophe Pichon, Yohan Dubois, Katarina Kraljic and\n  S\\'ebastien Peirani","authorsParsed":[["Rhee","Jinsu",""],["Yi","Sukyoung K.",""],["Ko","Jongwan",""],["Contini","Emanuele",""],["Jang","J. K.",""],["Jeon","Seyoung",""],["Han","San",""],["Pichon","Christophe",""],["Dubois","Yohan",""],["Kraljic","Katarina",""],["Peirani","Sébastien",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 18:00:03 GMT"}],"updateDate":"2024-08-19","timestamp":1723744803000,"abstract":"  We study star formation (SF) quenching of satellite galaxies with $M_{*} >\n10^7\\,M_{\\odot}$ within two low-mass groups ($M_{\\rm vir}=10^{12.9}$ and\n$10^{12.7} \\,M_{\\odot}$) using the NewHorizon simulation. We confirm that\nsatellite galaxies ($M_{*}\\lesssim10^{10}\\,M_{\\odot}$) are more prone to\nquenching than their field counterparts. This quenched fraction decreases with\nincreasing stellar mass, consistent with recent studies. Similar to the\nfindings in cluster environments, we note a correlation between the orbital\nmotions of galaxies within these groups and the phenomenon of SF quenching.\nSpecifically, SF is suppressed at the group center, and for galaxies with\n$M_{*} > 10^{9.1}\\,M_{\\odot}$, there is often a notable rejuvenation phase\nfollowing a temporary quenching period. The SF quenching at the group center is\nprimarily driven by changes in star formation efficiency and the amount of gas\navailable, both of which are influenced by hydrodynamic interactions between\nthe interstellar medium and surrounding hot gas within the group. Conversely,\nsatellite galaxies with $M_{*} < 10^{8.2}\\,M_{\\odot}$ experience significant\ngas removal within the group, leading to SF quenching. Our analysis highlights\nthe complexity of SF quenching in satellite galaxies in group environments,\nwhich involves an intricate competition between the efficiency of star\nformation (which depends on the dynamical state of the gas) on the one hand,\nand the availability of cold dense gas on the other hand. This challenges the\ntypical understanding of environmental effects based on gas stripping through\nram pressure, suggesting a need for a new description of galaxy evolution under\nmild environmental effects.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1jsuHNS-_QpkA37qgJr2KyUyZj8EbAaTTagO89sWW7A","pdfSize":"18209921"}
