{"id":"2408.07338","title":"Symmetric n-and p-Type Sub-5-nm 1D Graphene Nanoribbon Transistors for\n  Homogeneous CMOS Applications","authors":"Linqiang Xu, Shiqi Liu, Qiuhui Li, Ying Li, Shibo Fang, Ying Guo, Yee\n  Sin Ang, Chen Yang, Jing Lu","authorsParsed":[["Xu","Linqiang",""],["Liu","Shiqi",""],["Li","Qiuhui",""],["Li","Ying",""],["Fang","Shibo",""],["Guo","Ying",""],["Ang","Yee Sin",""],["Yang","Chen",""],["Lu","Jing",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 07:24:59 GMT"}],"updateDate":"2024-08-15","timestamp":1723620299000,"abstract":"  Graphene nanoribbon (GNR) emerges as an exceptionally promising channel\ncandidate due to its tunable sizable bandgap (0-3 eV), ultrahigh carrier\nmobility (up to 4600 cm^(2) V^(-1) s^(-1)), and excellent device performance\n(current on-off ratio of 10^(7)). However, the asymmetry of reported n-type and\np-type GNR field-effect transistors (FETs) at ultrashort gate length (Lg) has\nbecome an obstacle to future complementary metal-oxide-semiconductor (CMOS)\nintegration. Here, we conduct ab initio quantum transport simulations to\ninvestigate the transport properties of sub-5-nm Lg 7 armchair-edge GNR (7\nAGNR) FETs. The on-state current, delay time, and power dissipation of the\nn-type and p-type 7 AGNR FETs fulfill the International Technology Roadmap for\nSemiconductors targets for high-performance devices when Lg is reduced to 3 nm.\nRemarkably, the 7 AGNR FETs exhibit superior n-type and p-type symmetry to the\n7-9-7 AGNR FETs due to the more symmetrical electron/hole effective masses.\nCompared to the monolayer MoS2 and MoTe2 counterparts, the 7 AGNR FETs have\nbetter device performance, which could be further improved via gate\nengineering. Our results shed light on the immense potential of 7 AGNR in\nadvancing CMOS electronics beyond silicon.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}