{"id":"2408.16688","title":"Squeezed dual-comb spectroscopy","authors":"Daniel I. Herman, Mathieu Walsh, Molly Kate Kreider, Noah Lordi,\n  Eugene J. Tsao, Alexander J. Lind, Matthew Heyrich, Joshua Combes, J\\'er\\^ome\n  Genest, Scott A. Diddams","authorsParsed":[["Herman","Daniel I.",""],["Walsh","Mathieu",""],["Kreider","Molly Kate",""],["Lordi","Noah",""],["Tsao","Eugene J.",""],["Lind","Alexander J.",""],["Heyrich","Matthew",""],["Combes","Joshua",""],["Genest","Jérôme",""],["Diddams","Scott A.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 16:36:23 GMT"}],"updateDate":"2024-08-30","timestamp":1724949383000,"abstract":"  Laser spectroscopy and interferometry have provided an unparalleled view into\nthe fundamental nature of matter and the universe through ultra-precise\nmeasurements of atomic transition frequencies and gravitational waves. Optical\nfrequency combs have expanded metrology capabilities by phase-coherently\nbridging radio frequency and optical domains to enable traceable\nhigh-resolution spectroscopy across bandwidths greater than hundreds of\nterahertz. However, quantum mechanics limits the measurement precision\nachievable with laser frequency combs and traditional laser sources, ultimately\nimpacting fundamental interferometry and spectroscopy. Squeezing the\ndistribution of quantum noise to enhance measurement precision of either the\namplitude or phase quadrature of an optical field leads to significant\nmeasurement improvements with continuous wave lasers. In this work, we generate\nbright amplitude-squeezed frequency comb light and apply it to molecular\nspectroscopy using interferometry that leverages the high-speed and broad\nspectral coverage of the dual-comb technique. Using the Kerr effect in\nnonlinear optical fiber, the amplitude quadrature of a frequency comb centered\nat 1560 nm is squeezed by >3 dB over a 2.5 THz of bandwidth that includes 2500\ncomb teeth spaced by 1 GHz. Interferometry with a second coherent state\nfrequency comb yields mode-resolved spectroscopy of hydrogen sulfide gas with a\nsignal-to-noise ratio (SNR) nearly 3 dB beyond the shot noise limit, taking\nfull metrological advantage of the amplitude squeezing when the electrical\nnoise floor is considered. The quantum noise reduction leads to a two-fold\nquantum speedup in the determination of gas concentration, with impact for\nfast, broadband, and high SNR ratio measurements of multiple species in dynamic\nchemical environments.\n","subjects":["Physics/Optics","Physics/Chemical Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}