{"id":"2408.17402","title":"1.5-Femtosecond Delay in Charge Transfer","authors":"Danylo T. Matselyukh, Florian Rott, Thomas Schnappinger, Pengju Zhang,\n  Zheng Li, Jeremy O. Richardson, Regina de Vivie-Riedle, and Hans Jakob\n  W\\\"orner","authorsParsed":[["Matselyukh","Danylo T.",""],["Rott","Florian",""],["Schnappinger","Thomas",""],["Zhang","Pengju",""],["Li","Zheng",""],["Richardson","Jeremy O.",""],["de Vivie-Riedle","Regina",""],["Wörner","Hans Jakob",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 16:40:45 GMT"}],"updateDate":"2024-09-02","timestamp":1725036045000,"abstract":"  The transfer of population between two intersecting quantum states is the\nmost fundamental dynamical event that governs a broad variety of processes in\nphysics, chemistry, biology and material science. Whereas any two-state\ndescription implies that population leaving one state instantaneously appears\nin the other state, we show that coupling to additional states, present in all\nreal-world systems, can cause a measurable delay in population transfer. Using\nattosecond spectroscopy supported by advanced quantum-chemical calculations, we\nmeasure a delay of 1.46$\\pm$0.41 fs at a charge-transfer state crossing in\nCF$_3$I$^+$, where an electron hole moves from the fluorine atoms to iodine.\nOur measurements also fully resolve the other fundamental quantum-dynamical\nprocesses involved in the charge-transfer reaction: a vibrational rearrangement\ntime of 9.38$\\pm$0.21 fs (during which the vibrational wave packet travels to\nthe state crossing) and a population-transfer time of 2.3-2.4 fs. Our\nexperimental results and theoretical simulations show that delays in population\ntransfer readily appear in otherwise-adiabatic reactions and are typically on\nthe order of 1 fs for intersecting molecular valence states. These results have\nimplications for many research areas, such as atomic and molecular physics,\ncharge transfer or light harvesting.\n","subjects":["Physics/Chemical Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"NuBuTMHw9IrdELj3PbuaJxzadByt3rS01UI6HUP3B2o","pdfSize":"32611825"}
