{"id":"2408.04157","title":"R-adaptive DeepONet: Learning Solution Operators for PDEs with\n  Discontinuous Solutions Using an R-adaptive Strategy","authors":"Yameng Zhu, Jingrun Chen, Weibing Deng","authorsParsed":[["Zhu","Yameng",""],["Chen","Jingrun",""],["Deng","Weibing",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 02:01:08 GMT"}],"updateDate":"2024-08-09","timestamp":1723082468000,"abstract":"  DeepONet has recently been proposed as a representative framework for\nlearning nonlinear mappings between function spaces. However, when it comes to\napproximating solution operators of partial differential equations (PDEs) with\ndiscontinuous solutions, DeepONet poses a foundational approximation lower\nbound due to its linear reconstruction property. Inspired by the moving mesh\n(R-adaptive) method, we propose an R-adaptive DeepONet method, which contains\nthe following components: (1) the output data representation is transformed\nfrom the physical domain to the computational domain using the equidistribution\nprinciple; (2) the maps from input parameters to the solution and the\ncoordinate transformation function over the computational domain are learned\nusing DeepONets separately; (3) the solution over the physical domain is\nobtained via post-processing methods such as the (linear) interpolation method.\nAdditionally, we introduce a solution-dependent weighting strategy in the\ntraining process to reduce the final error. We establish an upper bound for the\nreconstruction error based on piecewise linear interpolation and show that the\nintroduced R-adaptive DeepONet can reduce this bound. Moreover, for two\nprototypical PDEs with sharp gradients or discontinuities, we prove that the\napproximation error decays at a superlinear rate with respect to the trunk\nbasis size, unlike the linear decay observed in vanilla DeepONets. Therefore,\nthe R-adaptive DeepONet overcomes the limitations of DeepONet, and can reduce\nthe approximation error for problems with discontinuous solutions. Numerical\nexperiments on PDEs with discontinuous solutions, including the linear\nadvection equation, the Burgers' equation with low viscosity, and the\ncompressible Euler equations of gas dynamics, are conducted to verify the\nadvantages of the R-adaptive DeepONet over available variants of DeepONet.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}