{"id":"2408.12956","title":"Forecasting Strong Subsequent Earthquakes in Japan using an improved\n  version of NESTORE Machine Learning Algorithm","authors":"Stefania Gentili, Giuseppe Davide Chiappetta, Giuseppe Petrillo, Piero\n  Brondi, Jiancang Zhuang","authorsParsed":[["Gentili","Stefania",""],["Chiappetta","Giuseppe Davide",""],["Petrillo","Giuseppe",""],["Brondi","Piero",""],["Zhuang","Jiancang",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 10:07:29 GMT"}],"updateDate":"2024-08-26","timestamp":1724407649000,"abstract":"  The advanced machine learning algorithm NESTORE (Next STrOng Related\nEarthquake) was developed to forecast strong aftershocks in earthquake\nsequences and has been successfully tested in Italy, western Slovenia, Greece,\nand California. NESTORE calculates the probability of aftershocks reaching or\nexceeding the magnitude of the main earthquake minus one and classifies\nclusters as type A or B based on a 0.5 probability threshold. In this study,\nNESTORE was applied to Japan using data from the Japan Meteorological Agency\ncatalog (1973-2024). Due to Japan's high seismic activity and class imbalance,\nnew algorithms were developed to complement NESTORE. The first is a hybrid\ncluster identification method using ETAS-based stochastic declustering and\ndeterministic graph-based selection. The second, REPENESE (RElevant features,\nclass imbalance PErcentage, NEighbour detection, SElection), is optimized for\ndetecting outliers in skewed class distributions. A new seismicity feature was\nproposed, showing good results in forecasting cluster classes in Japan. Trained\nwith data from 1973 to 2004 and tested from 2005 to 2023, the method correctly\nforecasted 75% of A clusters and 96% of B clusters, achieving a precision of\n0.75 and an accuracy of 0.94 six hours after the mainshock. It accurately\nclassified the 2011 T\\=ohoku event cluster. Near-real-time forecasting was\napplied to the sequence after the April 17, 2024 M6.6 earthquake in Shikoku,\nclassifying it as a \"Type B cluster,\" with validation expected on October 31,\n2024.\n","subjects":["Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nyDoH66jGE0DPBeDeU8YLPW_pxa5dzUhCsXq0b93K5o","pdfSize":"3507218"}
