{"id":"2408.11881","title":"Coherent all X-ray four wave mixing at core shell resonances","authors":"Ana Sofia Morillo-Candas, Sven Martin Augustin, Eduard Prat, Antoine\n  Sarracini, Jonas Knurr, Serhane Zerdane, Zhibin Sun, Ningchen Yang, Marc\n  Rebholz, Hankai Zhang, Yunpei Deng, Xinhua Xie, Andrea Cannizzo, Andre\n  Al-Haddad, Kirsten Andrea Schnorr, Christian Ott, Thomas Feurer, Christoph\n  Bostedt, Thomas Pfeifer and Gregor Knopp","authorsParsed":[["Morillo-Candas","Ana Sofia",""],["Augustin","Sven Martin",""],["Prat","Eduard",""],["Sarracini","Antoine",""],["Knurr","Jonas",""],["Zerdane","Serhane",""],["Sun","Zhibin",""],["Yang","Ningchen",""],["Rebholz","Marc",""],["Zhang","Hankai",""],["Deng","Yunpei",""],["Xie","Xinhua",""],["Cannizzo","Andrea",""],["Al-Haddad","Andre",""],["Schnorr","Kirsten Andrea",""],["Ott","Christian",""],["Feurer","Thomas",""],["Bostedt","Christoph",""],["Pfeifer","Thomas",""],["Knopp","Gregor",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 10:34:38 GMT"}],"updateDate":"2024-08-23","timestamp":1724236478000,"abstract":"  Nonlinear wave mixing in the X-ray range can provide valuable insights into\nthe structural and electron dynamics of atomic and molecular systems on\nultrafast time scales, with state- and site-selectivity and atomic resolution.\nThis promising experimental toolbox was so far limited by requiring at least\none near-visible laser, thus preventing core-shell two-dimensional X-ray\nspectroscopy. In this work, we demonstrate the generation of background-free\nall-X-ray four-wave mixing (XFWM) signals from a dilute gaseous sample (Ne).\nThe measured and simulated two-dimensional spectral maps\n($\\omega_{\\text{in}},\\omega_{\\text{out}}$) show multiple contributions\ninvolving the coherent response from core electrons. Notably, two-color\nresonant XFWM signals, essential for generalized multi-color schemes that allow\nto locally probe the electronic excitation of matter, are observed in neutral\nNe. Moreover, stimulated Ne$^+$ emission in each of the propagating X-ray\npulses leads to an increase of the temporal coherence in a narrow-bandwidth,\nwhich results in the coherent mixing of three X-ray lasers. Preliminary X-ray\nexcitation experiments making use of multi-color time-delayed X-ray pulses\ndemonstrate temporal resolution capability and show a time dependency\nconsistent with a signal dominated by resonant XFWM processes. This first\nall-X-ray four-wave-mixing approach represents a major breakthrough towards\nmultidimensional X-ray correlation spectroscopy and the general application of\nnonlinear all-X-ray wave-mixing.\n","subjects":["Physics/Optics","Physics/Atomic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}