{"id":"2408.06779","title":"ED$^4$: Explicit Data-level Debiasing for Deepfake Detection","authors":"Jikang Cheng, Ying Zhang, Qin Zou, Zhiyuan Yan, Chao Liang, Zhongyuan\n  Wang, Chen Li","authorsParsed":[["Cheng","Jikang",""],["Zhang","Ying",""],["Zou","Qin",""],["Yan","Zhiyuan",""],["Liang","Chao",""],["Wang","Zhongyuan",""],["Li","Chen",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 10:05:20 GMT"}],"updateDate":"2024-08-14","timestamp":1723543520000,"abstract":"  Learning intrinsic bias from limited data has been considered the main reason\nfor the failure of deepfake detection with generalizability. Apart from the\ndiscovered content and specific-forgery bias, we reveal a novel spatial bias,\nwhere detectors inertly anticipate observing structural forgery clues appearing\nat the image center, also can lead to the poor generalization of existing\nmethods. We present ED$^4$, a simple and effective strategy, to address\naforementioned biases explicitly at the data level in a unified framework\nrather than implicit disentanglement via network design. In particular, we\ndevelop ClockMix to produce facial structure preserved mixtures with arbitrary\nsamples, which allows the detector to learn from an exponentially extended data\ndistribution with much more diverse identities, backgrounds, local manipulation\ntraces, and the co-occurrence of multiple forgery artifacts. We further propose\nthe Adversarial Spatial Consistency Module (AdvSCM) to prevent extracting\nfeatures with spatial bias, which adversarially generates spatial-inconsistent\nimages and constrains their extracted feature to be consistent. As a\nmodel-agnostic debiasing strategy, ED$^4$ is plug-and-play: it can be\nintegrated with various deepfake detectors to obtain significant benefits. We\nconduct extensive experiments to demonstrate its effectiveness and superiority\nover existing deepfake detection approaches.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"OAFrwOPER94QDwXy70dNRmtoHJJh9DEhOYfCdxdCaXQ","pdfSize":"1261554"}
