{"id":"2408.00131","title":"Distributionally Robust Optimization as a Scalable Framework to\n  Characterize Extreme Value Distributions","authors":"Patrick Kuiper, Ali Hasan, Wenhao Yang, Yuting Ng, Hoda Bidkhori, Jose\n  Blanchet, Vahid Tarokh","authorsParsed":[["Kuiper","Patrick",""],["Hasan","Ali",""],["Yang","Wenhao",""],["Ng","Yuting",""],["Bidkhori","Hoda",""],["Blanchet","Jose",""],["Tarokh","Vahid",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 19:45:27 GMT"}],"updateDate":"2024-08-02","timestamp":1722455127000,"abstract":"  The goal of this paper is to develop distributionally robust optimization\n(DRO) estimators, specifically for multidimensional Extreme Value Theory (EVT)\nstatistics. EVT supports using semi-parametric models called max-stable\ndistributions built from spatial Poisson point processes. While powerful, these\nmodels are only asymptotically valid for large samples. However, since extreme\ndata is by definition scarce, the potential for model misspecification error is\ninherent to these applications, thus DRO estimators are natural. In order to\nmitigate over-conservative estimates while enhancing out-of-sample performance,\nwe study DRO estimators informed by semi-parametric max-stable constraints in\nthe space of point processes. We study both tractable convex formulations for\nsome problems of interest (e.g. CVaR) and more general neural network based\nestimators. Both approaches are validated using synthetically generated data,\nrecovering prescribed characteristics, and verifying the efficacy of the\nproposed techniques. Additionally, the proposed method is applied to a real\ndata set of financial returns for comparison to a previous analysis. We\nestablished the proposed model as a novel formulation in the multivariate EVT\ndomain, and innovative with respect to performance when compared to relevant\nalternate proposals.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Quantitative Finance/Risk Management"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CrJNYMmJI80LyVG6kFsRguEFTApCUqI4a6srUpYEKWY","pdfSize":"1499526"}
