{"id":"2408.05381","title":"Statistics of Solar White-Light Flares I: Optimization of Identification\n  Methods and Application","authors":"Yingjie Cai, Yijun Hou, Ting Li, Jifeng Liu","authorsParsed":[["Cai","Yingjie",""],["Hou","Yijun",""],["Li","Ting",""],["Liu","Jifeng",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 23:35:46 GMT"}],"updateDate":"2024-08-13","timestamp":1723246546000,"abstract":"  White-light flares (WLFs) are energetic activity in stellar atmosphere.\nHowever, the observed solar WLF is relatively rare compared to stellar WLFs or\nsolar flares observed at other wavelengths, limiting our further understanding\nsolar/stellar WLFs through statistical studies. By analyzing flare observations\nfrom the \\emph{Solar Dynamics Observatory (SDO)}, here we improve WLF\nidentification methods for obtaining more solar WLFs and their accurate light\ncurves from two aspects: 1) imposing constraints defined by the typical\ntemporal and spatial distribution characteristics of WLF-induced signals; 2)\nsetting the intrinsic threshold for each pixel in the flare ribbon region\naccording to its inherent background fluctuation rather than a fixed threshold\nfor the whole region. Applying the optimized method to 90 flares (30 C-class\nones, 30 M-class ones, and 30 X-class ones) for a statistical study, we\nidentified a total of 9 C-class WLFs, 18 M-class WLFs, and 28 X-class WLFs. The\nWLF identification rate of C-class flares reported here reaches 30\\%, which is\nthe highest to date to our best knowledge. It is also revealed that in each\nGOES energy level, the proportion of WLFs is higher in confined flares than\nthat in eruptive flares. Moreover, a power-law relation is found between the\nWLF energy (\\emph{E}) and duration ($\\tau$): $\\tau \\propto {E}^{0.22}$, similar\nto those of solar hard/soft X-ray flares and other stellar WLFs. These results\nindicate that we could recognize more solar WLFs through optimizing the\nidentification method, which will lay a base for future statistical and\ncomparison study of solar and stellar WLFs.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}