{"id":"2408.15979","title":"Comparing the Pearson and Spearman Correlation Coefficients Across\n  Distributions and Sample Sizes: A Tutorial Using Simulations and Empirical\n  Data","authors":"J. C. F. de Winter, S. D. Gosling, and J. Potter","authorsParsed":[["de Winter","J. C. F.",""],["Gosling","S. D.",""],["Potter","J.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 17:49:33 GMT"}],"updateDate":"2024-08-29","timestamp":1724867373000,"abstract":"  The Pearson product-moment correlation coefficient (rp) and the Spearman rank\ncorrelation coefficient (rs) are widely used in psychological research. We\ncompare rp and rs on 3 criteria: variability, bias with respect to the\npopulation value, and robustness to an outlier. Using simulations across low (N\n= 5) to high (N = 1,000) sample sizes we show that, for normally distributed\nvariables, rp and rs have similar expected values but rs is more variable,\nespecially when the correlation is strong. However, when the variables have\nhigh kurtosis, rp is more variable than rs. Next, we conducted a sampling study\nof a psychometric dataset featuring symmetrically distributed data with light\ntails, and of 2 Likert-type survey datasets, 1 with light-tailed and the other\nwith heavy-tailed distributions. Consistent with the simulations, rp had lower\nvariability than rs in the psychometric dataset. In the survey datasets with\nheavy-tailed variables in particular, rs had lower variability than rp, and\noften corresponded more accurately to the population Pearson correlation\ncoefficient (Rp) than rp did. The simulations and the sampling studies showed\nthat variability in terms of standard deviations can be reduced by about 20% by\nchoosing rs instead of rp. In comparison, increasing the sample size by a\nfactor of 2 results in a 41% reduction of the standard deviations of rs and rp.\nIn conclusion, rp is suitable for light-tailed distributions, whereas rs is\npreferable when variables feature heavy-tailed distributions or when outliers\nare present, as is often the case in psychological research.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qdqi0SziFOpIaabg16G3tfP6b2-xfJyRdohxgnFLkSc","pdfSize":"5398789"}
