{"id":"2408.16676","title":"Pseudogap regime of the unitary Fermi gas with lattice auxiliary-field\n  quantum Monte Carlo in the continuum limit","authors":"S. Jensen, C. N. Gilbreth, Y. Alhassid","authorsParsed":[["Jensen","S.",""],["Gilbreth","C. N.",""],["Alhassid","Y.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 16:23:35 GMT"}],"updateDate":"2024-08-30","timestamp":1724948615000,"abstract":"  The unitary Fermi gas (UFG) is a strongly correlated system of two-species\n(spin-1/2) fermions with a short-range attractive interaction modeled by a\ncontact interaction and has attracted much interest across different\ndisciplines. The UFG is considered a paradigm for strongly correlated\nsuperfluids and has been investigated extensively, with generally good\nagreement found between theory and experiment. However, the extent of a\npseudogap regime above the critical temperature $T_c$ for superfluidity is\nstill debated both theoretically and experimentally. Here we study\nthermodynamic properties of the UFG across the superfluid phase transition\nusing finite-temperature lattice auxiliary-field quantum Monte Carlo (AFMC)\nmethods in the canonical ensemble of fixed particle numbers. We extrapolate our\nlattice AFMC results to the continuous time and continuum limits, thus removing\nthe systematic error associated with the finite filling factor of previous AFMC\nstudies. We determine the critical temperature to be $T_c=0.16(1)\\, T_{F}$. For\nthe largest particle number studied $N=114$, the energy-staggering pairing gap\nis suppressed above a pairing scale temperature of $T^{*}\\approx 0.2\\,T_F$. The\nspin susceptibility displays moderate suppression above $T_c$ with a spin gap\ntemperature of $T_s\\approx 0.2 \\,T_F$. We also calculate a free\nenergy-staggering pairing gap, which shows substantially reduced statistical\nerrors when compared with the energy-staggering gap, allowing for a clear\nsignature of pairing correlations in the finite-size system. All results\nindicate that the pseudogap regime is narrow, with pseudogap signatures\nemerging at temperatures below $T^{*}\\approx 0.2 \\, T_F$. The reduced\nstatistical errors of the free energy gap enable an extrapolation at low\ntemperatures, allowing an estimate of the zero-temperature pairing gap\n$\\Delta_E = 0.576(24) \\, \\epsilon_F$.\n","subjects":["Condensed Matter/Quantum Gases","Condensed Matter/Superconductivity","Physics/High Energy Physics - Lattice","Physics/Nuclear Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}