{"id":"2408.11900","title":"Quantum highway: Observation of minimal and maximal speed limits for few\n  and many-body states","authors":"Zitian Zhu, Lei Gao, Zehang Bao, Liang Xiang, Zixuan Song, Shibo Xu,\n  Ke Wang, Jiachen Chen, Feitong Jin, Xuhao Zhu, Yu Gao, Yaozu Wu, Chuanyu\n  Zhang, Ning Wang, Yiren Zou, Ziqi Tan, Aosai Zhang, Zhengyi Cui, Fanhao Shen,\n  Jiarun Zhong, Tingting Li, Jinfeng Deng, Xu Zhang, Hang Dong, Pengfei Zhang,\n  Zhen Wang, Chao Song, Chen Cheng, Qiujiang Guo, Hekang Li, H. Wang, Haiqing\n  Lin, Rubem Mondaini","authorsParsed":[["Zhu","Zitian",""],["Gao","Lei",""],["Bao","Zehang",""],["Xiang","Liang",""],["Song","Zixuan",""],["Xu","Shibo",""],["Wang","Ke",""],["Chen","Jiachen",""],["Jin","Feitong",""],["Zhu","Xuhao",""],["Gao","Yu",""],["Wu","Yaozu",""],["Zhang","Chuanyu",""],["Wang","Ning",""],["Zou","Yiren",""],["Tan","Ziqi",""],["Zhang","Aosai",""],["Cui","Zhengyi",""],["Shen","Fanhao",""],["Zhong","Jiarun",""],["Li","Tingting",""],["Deng","Jinfeng",""],["Zhang","Xu",""],["Dong","Hang",""],["Zhang","Pengfei",""],["Wang","Zhen",""],["Song","Chao",""],["Cheng","Chen",""],["Guo","Qiujiang",""],["Li","Hekang",""],["Wang","H.",""],["Lin","Haiqing",""],["Mondaini","Rubem",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 18:00:07 GMT"}],"updateDate":"2024-08-23","timestamp":1724263207000,"abstract":"  Tracking the time evolution of a quantum state allows one to verify the\nthermalization rate or the propagation speed of correlations in generic quantum\nsystems. Inspired by the energy-time uncertainty principle, bounds have been\ndemonstrated on the maximal speed at which a quantum state can change,\nresulting in immediate and practical tasks. Based on a programmable\nsuperconducting quantum processor, we test the dynamics of various emulated\nquantum mechanical systems encompassing single- and many-body states. We show\nthat one can test the known quantum speed limits and that modifying a single\nHamiltonian parameter allows the observation of the crossover of the different\nbounds on the dynamics. We also unveil the observation of minimal quantum speed\nlimits in addition to more common maximal ones, i.e., the lowest rate of change\nof a unitarily evolved quantum state. Our results establish a comprehensive\nexperimental characterization of quantum speed limits and pave the way for\ntheir subsequent study in engineered non-unitary conditions.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}