{"id":"2408.03598","title":"PRISM: PRogressive dependency maxImization for Scale-invariant image\n  Matching","authors":"Xudong Cai, Yongcai Wang, Lun Luo, Minhang Wang, Deying Li, Jintao Xu,\n  Weihao Gu, Rui Ai","authorsParsed":[["Cai","Xudong",""],["Wang","Yongcai",""],["Luo","Lun",""],["Wang","Minhang",""],["Li","Deying",""],["Xu","Jintao",""],["Gu","Weihao",""],["Ai","Rui",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 07:35:17 GMT"}],"updateDate":"2024-08-08","timestamp":1723016117000,"abstract":"  Image matching aims at identifying corresponding points between a pair of\nimages. Currently, detector-free methods have shown impressive performance in\nchallenging scenarios, thanks to their capability of generating dense matches\nand global receptive field. However, performing feature interaction and\nproposing matches across the entire image is unnecessary, because not all image\nregions contribute to the matching process. Interacting and matching in\nunmatchable areas can introduce errors, reducing matching accuracy and\nefficiency. Meanwhile, the scale discrepancy issue still troubles existing\nmethods. To address above issues, we propose PRogressive dependency\nmaxImization for Scale-invariant image Matching (PRISM), which jointly prunes\nirrelevant patch features and tackles the scale discrepancy. To do this, we\nfirstly present a Multi-scale Pruning Module (MPM) to adaptively prune\nirrelevant features by maximizing the dependency between the two feature sets.\nMoreover, we design the Scale-Aware Dynamic Pruning Attention (SADPA) to\naggregate information from different scales via a hierarchical design. Our\nmethod's superior matching performance and generalization capability are\nconfirmed by leading accuracy across various evaluation benchmarks and\ndownstream tasks. The code is publicly available at\nhttps://github.com/Master-cai/PRISM.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}