{"id":"2408.02300","title":"A Lower Bound for Local Search Proportional Approval Voting","authors":"Sonja Kraiczy and Edith Elkind","authorsParsed":[["Kraiczy","Sonja",""],["Elkind","Edith",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 08:17:34 GMT"}],"updateDate":"2024-08-06","timestamp":1722845854000,"abstract":"  Selecting $k$ out of $m$ items based on the preferences of $n$ heterogeneous\nagents is a widely studied problem in algorithmic game theory. If agents have\napproval preferences over individual items and harmonic utility functions over\nbundles -- an agent receives $\\sum_{j=1}^t\\frac{1}{j}$ utility if $t$ of her\napproved items are selected -- then welfare optimisation is captured by a\nvoting rule known as Proportional Approval Voting (PAV). PAV also satisfies\ndemanding fairness axioms. However, finding a winning set of items under PAV is\nNP-hard. In search of a tractable method with strong fairness guarantees, a\nbounded local search version of PAV was proposed by Aziz et al. It proceeds by\nstarting with an arbitrary size-$k$ set $W$ and, at each step, checking if\nthere is a pair of candidates $a\\in W$, $b\\not\\in W$ such that swapping $a$ and\n$b$ increases the total welfare by at least $\\varepsilon$; if yes, it performs\nthe swap. Aziz et al.~show that setting $\\varepsilon=\\frac{n}{k^2}$ ensures\nboth the desired fairness guarantees and polynomial running time. However, they\nleave it open whether the algorithm converges in polynomial time if\n$\\varepsilon$ is very small (in particular, if we do not stop until there are\nno welfare-improving swaps). We resolve this open question, by showing that if\n$\\varepsilon$ can be arbitrarily small, the running time of this algorithm may\nbe super-polynomial. Specifically, we prove a lower bound of~$\\Omega(k^{\\log\nk})$ if improvements are chosen lexicographically. To complement our lower\nbound, we provide an empirical comparison of two variants of local search --\nbetter-response and best-response -- on several real-life data sets and a\nvariety of synthetic data sets. Our experiments indicate that, empirically,\nbetter response exhibits faster running time than best response.\n","subjects":["Computing Research Repository/Computer Science and Game Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vVrlL50g0t8d5dYuelIAKmyk5LSw5EnMyIT-D3wE2_w","pdfSize":"1111481","txDigest":"8eJjyoY8mo8SuArKDeS7EM5qcNKuAKcgAjLzNS79CHrJ","endEpoch":"1","status":"CERTIFIED"}
