{"id":"2408.15700","title":"Identifying the Mechanisms of Water Maser Variability During the\n  Accretion Burst in NGC6334I","authors":"Jakobus M. Vorster, James O. Chibueze, Tomoya Hirota, Gordon C.\n  MacLeod, Johan D. van der Walt, Eduard I. Vorobyov, Andrej M. Sobolev and\n  Mika Juvela","authorsParsed":[["Vorster","Jakobus M.",""],["Chibueze","James O.",""],["Hirota","Tomoya",""],["MacLeod","Gordon C.",""],["van der Walt","Johan D.",""],["Vorobyov","Eduard I.",""],["Sobolev","Andrej M.",""],["Juvela","Mika",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 10:54:40 GMT"}],"updateDate":"2024-08-29","timestamp":1724842480000,"abstract":"  HMYSOs gain most of their mass in short bursts of accretion. Maser emission\nis an invaluable tool in discovering and probing accretion bursts. We observed\nthe 22 GHz water maser response induced by the accretion burst in NGC6334I-MM1B\nand identified the underlying maser variability mechanisms. We report seven\nepochs of VLBI observations of 22 GHz water masers in NGC6334I with the VERA\narray, from 2014 to 2016, spanning the onset of the accretion burst in 2015.1.\nWe also report 2019 ALMA observations of 321 GHz water masers and 22 GHz maser\nmonitoring by HartRAO. We analyze variability patterns and use proper motions\nwith the 22 GHz to 321 GHz line ratio to distinguish between masers in C-shocks\nand J-shocks. We also calculated the burst-to-quiescent variance ratio of the\nsingle-dish time series. The constant mean proper motion before and after the\nburst indicates that maser variability is due to excitation effects from\nvariable radiation rather than jet ejecta. We find that the flux density\nvariance ratio in the single-dish time series can identify maser efficiency\nvariations in 22 GHz masers. The northern region, CM2-W2, is excited in\nC-shocks and showed long-term flaring with velocity-dependent excitation of new\nmaser features. We propose that radiative heating of H2 due to high-energy\nradiation from the accretion burst be the mechanism for the flaring in CM2-W2.\nThe southern regions are excited by J-shocks and have short-term flaring and\ndampening of water masers. We attributed the diverse variability patterns in\nthe southern regions to the radiative transfer of the burst energy in the\nsource. Our results indicate that the effects of source geometry, shock type,\nand incident radiation spectrum are fundamental factors affecting 22 GHz maser\nvariability. Investigating water masers in irradiated shocks will improve their\nuse as a diagnostic in time-variable radiation environments.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YW27Zp1J4qjQ6b-UMKTAFqvKaMDmMZs-PPpQEmCxzAI","pdfSize":"10367621"}
