{"id":"2408.08204","title":"Amplified Light Beam Cooling via Emergent Onsager's Irreversible\n  Thermodynamics","authors":"Zhongfei Xiong, Fan O. Wu, Yang Liu, Jian-Hua Jiang, Demetrios N.\n  Christodoulides, and Yuntian Chen","authorsParsed":[["Xiong","Zhongfei",""],["Wu","Fan O.",""],["Liu","Yang",""],["Jiang","Jian-Hua",""],["Christodoulides","Demetrios N.",""],["Chen","Yuntian",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 15:12:03 GMT"}],"updateDate":"2024-08-16","timestamp":1723734723000,"abstract":"  High-brightness coherent light source is at the heart of optical technology\nand yet challenging to achieve. Here, we propose an unconventional approach\nthat utilizes the \"forbidden chemical\" in optical thermodynamics to convert any\nincoming light beam into a high-brightness, high-spatial-coherence light beam\nin multimode nonlinear optical waveguide systems, in contrast to evaporative\ncooling in cold atoms where the brightness is instead reduced. This approach is\npowered by the fact that light in nonlinear multimode structures undergoes an\nirreversible thermalization process triggered by its own photon-photon\ninteractions. Moreover, the key characteristics in statistical mechanics, the\noptical temperature and chemical potential can be widely tuned in photonic\nsystems. As such, when the chemical potential of an optical reservoir is\ndesigned to locate at the forbidden band of the probe bosonic system, it can\nnever reach thermal equilibrium with the probe hence endlessly pumping the\nprobe system towards an enhanced brightness and spatial coherence. This\namplified cooling of light beam is revealed via both Onsager's irreversible\nthermodynamics theory and numerical simulations. Akin to this effect, the\ninverse photonic transport currents emerge due to the negative off-diagonal\nOnsager coefficients. We demonstrate the feasibility of the amplified beam\ncooling using a coupled multimode optical waveguide system and show that after\n800 rounds of amplified cooling, the optical power of an incoming beam is\nenhanced by 16 times, meanwhile the fundamental mode occupancy is increased to\n90%. These findings unveil an anomalous optical phenomenon and a new route\ntoward high-quality light sources.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}