{"id":"2408.00065","title":"Tip of the Red Giant Branch Distances with JWST. II. I-band Measurements\n  in a Sample of Hosts of 10 SN Ia Match HST Cepheids","authors":"Siyang Li, Gagandeep S. Anand, Adam G. Riess, Stefano Casertano,\n  Wenlong Yuan, Louise Breuval, Lucas M. Macri, Daniel Scolnic, Rachael Beaton,\n  Richard I. Anderson","authorsParsed":[["Li","Siyang",""],["Anand","Gagandeep S.",""],["Riess","Adam G.",""],["Casertano","Stefano",""],["Yuan","Wenlong",""],["Breuval","Louise",""],["Macri","Lucas M.",""],["Scolnic","Daniel",""],["Beaton","Rachael",""],["Anderson","Richard I.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:00:00 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 18:05:06 GMT"}],"updateDate":"2024-08-09","timestamp":1722448800000,"abstract":"  The Hubble Tension, a >5 sigma discrepancy between direct and indirect\nmeasurements of the Hubble constant (H0), has persisted for a decade and\nmotivated intense scrutiny of the paths used to infer H0. Comparing\nindependently-derived distances for a set of galaxies with different standard\ncandles, such as the tip of the red giant branch (TRGB) and Cepheid variables,\ncan test for systematics in the middle rung of the distance ladder. The I band\nis the preferred filter for measuring the TRGB due to constancy with color, a\nresult of low sensitivity to population differences in age and metallicity\nsupported by stellar models. We use James Webb Space Telescope (JWST)\nobservations with the maser host NGC 4258 as our geometric anchor to measure\nI-band (F090W vs F090W-F150W) TRGB distances to 8 hosts of 10 Type Ia\nsupernovae (SNe Ia) within 28 Mpc: NGC 1448, NGC 1559, NGC 2525, NGC 3370, NGC\n3447, NGC 5584, NGC 5643, and NGC 5861. We compare these with Hubble Space\nTelescope (HST) Cepheid-based relative distance moduli for the same galaxies\nand anchor. We find no evidence of a difference between their weighted means,\n0.01 +/- 0.04 (stat) +/- 0.04 (sys) mag. We produce fourteen variants of the\nTRGB analysis, altering the smoothing level and color range used to measure the\ntips to explore their impact. For some hosts, this changes the identification\nof the strongest peak, but this causes little change to the sample mean\ndifference producing a full range of 0.01 to 0.03 mag, all consistent at 1\nsigma with no difference. The result matches past comparisons of I-band TRGB\nand Cepheids when both use HST. SNe and anchor samples observed with JWST are\ntoo small to yield a measure of H0 that is competitive with the HST sample of\n42 SNe Ia and 4 anchors; however, they already provide a vital systematic\ncrosscheck to HST measurements of the distance ladder.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}