{"id":"2408.01878","title":"FBINeRF: Feature-Based Integrated Recurrent Network for Pinhole and\n  Fisheye Neural Radiance Fields","authors":"Yifan Wu, Tianyi Cheng, Peixu Xin, Janusz Konrad","authorsParsed":[["Wu","Yifan",""],["Cheng","Tianyi",""],["Xin","Peixu",""],["Konrad","Janusz",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 23:11:20 GMT"}],"updateDate":"2024-08-06","timestamp":1722726680000,"abstract":"  Previous studies aiming to optimize and bundle-adjust camera poses using\nNeural Radiance Fields (NeRFs), such as BARF and DBARF, have demonstrated\nimpressive capabilities in 3D scene reconstruction. However, these approaches\nhave been designed for pinhole-camera pose optimization and do not perform well\nunder radial image distortions such as those in fisheye cameras. Furthermore,\ninaccurate depth initialization in DBARF results in erroneous geometric\ninformation affecting the overall convergence and quality of results. In this\npaper, we propose adaptive GRUs with a flexible bundle-adjustment method\nadapted to radial distortions and incorporate feature-based recurrent neural\nnetworks to generate continuous novel views from fisheye datasets. Other NeRF\nmethods for fisheye images, such as SCNeRF and OMNI-NeRF, use projected ray\ndistance loss for distorted pose refinement, causing severe artifacts, long\nrendering time, and are difficult to use in downstream tasks, where the dense\nvoxel representation generated by a NeRF method needs to be converted into a\nmesh representation. We also address depth initialization issues by adding\nMiDaS-based depth priors for pinhole images. Through extensive experiments, we\ndemonstrate the generalization capacity of FBINeRF and show high-fidelity\nresults for both pinhole-camera and fisheye-camera NeRFs.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TOKL698wMGgXj5pysVmX33-5fMyImtXSy-EQWyK4atE","pdfSize":"13291300"}
