{"id":"2408.03815","title":"Dissipation Driven Coherent Dynamics Observed in Bose-Einstein\n  Condensates","authors":"Ye Tian, Yajuan Zhao, Yue Wu, Jilai Ye, Shuyao Mei, Zhihao Chi, Tian\n  Tian, Ce Wang, Zhe-Yu Shi, Yu Chen, Jiazhong Hu, Hui Zhai, Wenlan Chen","authorsParsed":[["Tian","Ye",""],["Zhao","Yajuan",""],["Wu","Yue",""],["Ye","Jilai",""],["Mei","Shuyao",""],["Chi","Zhihao",""],["Tian","Tian",""],["Wang","Ce",""],["Shi","Zhe-Yu",""],["Chen","Yu",""],["Hu","Jiazhong",""],["Zhai","Hui",""],["Chen","Wenlan",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 14:51:34 GMT"}],"updateDate":"2024-08-08","timestamp":1723042294000,"abstract":"  We report the first experimental observation of dissipation-driven coherent\nquantum many-body oscillation, and this oscillation is manifested as the\ncoherent exchange of atoms between the thermal and the condensate components in\na three-dimensional partially condensed Bose gas. Firstly, we observe that the\ndissipation leads to two different atom loss rates between the thermal and the\ncondensate components, such that the thermal fraction increases as dissipation\ntime increases. Therefore, this dissipation process serves as a tool to\nuniformly ramp up the system's temperature without introducing extra density\nexcitation. Subsequently, a coherent pair exchange of atoms between the thermal\nand the condensate components occurs, resulting in coherent oscillation of atom\nnumbers in both components. This oscillation, permanently embedded in the atom\nloss process, is revealed clearly when we inset a duration of dissipation-free\nevolution into the entire dynamics, manifested as an oscillation of total atom\nnumber at the end. Finally, we also present a theoretical calculation to\nsupport this physical mechanism, which simultaneously includes dissipation,\ninteraction, finite temperature, and harmonic trap effects. Our work introduces\na highly controllable dissipation as a new tool to control quantum many-body\ndynamics.\n","subjects":["Condensed Matter/Quantum Gases","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}