{"id":"2408.02331","title":"Explaining and Connecting Kriging with Gaussian Process Regression","authors":"Marius Marinescu","authorsParsed":[["Marinescu","Marius",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 09:15:40 GMT"}],"updateDate":"2024-08-06","timestamp":1722849340000,"abstract":"  Kriging and Gaussian Process Regression are statistical methods that allow\npredicting the outcome of a random process or a random field by using a sample\nof correlated observations. In other words, the random process or random field\nis partially observed, and by using a sample a prediction is made, pointwise or\nas a whole, where the latter can be thought as a reconstruction. In addition,\nthe techniques permit to give a measure of uncertainty of the prediction. The\nmethods have different origins. Kriging comes from geostatistics, a field which\nstarted to develop around 1950 oriented to mining valuation problems, whereas\nGaussian Process Regression has gained popularity in the area of machine\nlearning in the last decade of the previous century. In the literature, the\nmethods are usually presented as being the same technique. However, beyond this\naffirmation, the techniques have yet not been compared on a thorough\nmathematical basis and neither explained why and under which conditions this\naffirmation holds. Furthermore, Kriging has many variants and this affirmation\nshould be precised. In this paper, this gap is filled. It is shown, step by\nstep how both methods are deduced from the first principles -- with a major\nfocus on Kriging, the mathematical connection between them, and which Kriging\nvariant corresponds to which Gaussian Process Regression set up. The three most\nwidely used versions of Kriging are considered: Simple Kriging, Ordinary\nKriging and Universal Kriging. It is found, that despite their closeness, the\ntechniques are different in their approach and assumptions, in a similar way\nthe Least Square method, the Best Linear Unbiased Estimator method, and the\nLikelihood method in regression do. I hope this work can serve for a deeper\nunderstanding of the relationship between Kriging and Gaussian Process\nRegression, as well as a cohesive introductory resource for researchers.\n","subjects":["Statistics/Methodology","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}