{"id":"2408.03249","title":"Multi-User Mobile Augmented Reality for Cardiovascular Surgical Planning","authors":"Pratham Mehta, Rahul O Narayanan, Harsha Karanth, Haoyang Yang,\n  Timothy C Slesnick, Fawwaz Shaw, Duen Horng Chau","authorsParsed":[["Mehta","Pratham",""],["Narayanan","Rahul O",""],["Karanth","Harsha",""],["Yang","Haoyang",""],["Slesnick","Timothy C",""],["Shaw","Fawwaz",""],["Chau","Duen Horng",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 15:10:08 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 03:26:21 GMT"}],"updateDate":"2024-08-09","timestamp":1722957008000,"abstract":"  Collaborative planning for congenital heart diseases typically involves\ncreating physical heart models through 3D printing, which are then examined by\nboth surgeons and cardiologists. Recent developments in mobile augmented\nreality (AR) technologies have presented a viable alternative, known for their\nease of use and portability. However, there is still a lack of research\nexamining the utilization of multi-user mobile AR environments to support\ncollaborative planning for cardiovascular surgeries. We created ARCollab, an\niOS AR app designed for enabling multiple surgeons and cardiologists to\ninteract with a patient's 3D heart model in a shared environment. ARCollab\nenables surgeons and cardiologists to import heart models, manipulate them\nthrough gestures and collaborate with other users, eliminating the need for\nfabricating physical heart models. Our evaluation of ARCollab's usability and\nusefulness in enhancing collaboration, conducted with three cardiothoracic\nsurgeons and two cardiologists, marks the first human evaluation of a\nmulti-user mobile AR tool for surgical planning. ARCollab is open-source,\navailable at https://github.com/poloclub/arcollab.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tJvaSCjlM5djnFih1Gy1roazN1yXLmVP2S6JhJMk9Lo","pdfSize":"9603038"}
