{"id":"2408.16368","title":"Shape matters: Inferring the motility of confluent cells from static\n  images","authors":"Quirine J.S. Braat, Giulia Janzen, Bas C. Jansen, Vincent E. Debets,\n  Simone Ciarella and Liesbeth M. C. Janssen","authorsParsed":[["Braat","Quirine J. S.",""],["Janzen","Giulia",""],["Jansen","Bas C.",""],["Debets","Vincent E.",""],["Ciarella","Simone",""],["Janssen","Liesbeth M. C.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 09:25:10 GMT"}],"updateDate":"2024-08-30","timestamp":1724923510000,"abstract":"  Cell motility in dense cell collectives is pivotal in various diseases like\ncancer metastasis and asthma. A central aspect in these phenomena is the\nheterogeneity in cell motility, but identifying the motility of individual\ncells is challenging. Previous work has established the importance of the\naverage cell shape in predicting cell dynamics. Here, we aim to identify the\nimportance of individual cell shape features, rather than collective features,\nto distinguish between high-motility (active) and low-motility (passive) cells\nin heterogeneous cell layers. Employing the Cellular Potts Model, we generate\nsimulation snapshots and extract static features as inputs for a simple\nmachine-learning model. Our results show that when the passive cells are\nnon-motile, this machine-learning model can accurately predict whether a cell\nis passive or active using only single-cell shape features. Furthermore, we\nexplore scenarios where passive cells also exhibit some degree of motility,\nalbeit less than active cells. In such cases, our findings indicate that a\nneural network trained on shape features can accurately classify cell motility,\nparticularly when the number of active cells is low, and the motility of active\ncells is significantly higher compared to passive cells. This work offers\npotential for physics-inspired predictions of single-cell properties with\nimplications for inferring cell dynamics from static histological images.\n","subjects":["Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"","pdfSize":"9087231"}
