{"id":"2408.08967","title":"Phishing Codebook: A Structured Framework for the Characterization of\n  Phishing Emails","authors":"Tarini Saka, Rachiyta Jain, Kami Vaniea, Nadin K\\\"okciyan","authorsParsed":[["Saka","Tarini",""],["Jain","Rachiyta",""],["Vaniea","Kami",""],["Kökciyan","Nadin",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 18:30:53 GMT"}],"updateDate":"2024-08-20","timestamp":1723833053000,"abstract":"  Phishing is one of the most prevalent and expensive types of cybercrime faced\nby organizations and individuals worldwide. Most prior research has focused on\nvarious technical features and traditional representations of text to\ncharacterize phishing emails. There is a significant knowledge gap about the\nqualitative traits embedded in them, which could be useful in a range of\nphishing mitigation tasks. In this paper, we dissect the structure of phishing\nemails to gain a better understanding of the factors that influence human\ndecision-making when assessing suspicious emails and identify a novel set of\ndescriptive features. For this, we employ an iterative qualitative coding\napproach to identify features that are descriptive of the emails. We developed\nthe ``Phishing Codebook'', a structured framework to systematically extract key\ninformation from phishing emails, and we apply this codebook to a publicly\navailable dataset of 503 phishing emails collected between 2015 and 2021. We\npresent key observations and challenges related to phishing attacks delivered\nindirectly through legitimate services, the challenge of recurring and\nlong-lasting scams, and the variations within campaigns used by attackers to\nbypass rule-based filters. Furthermore, we provide two use cases to show how\nthe Phishing Codebook is useful in identifying similar phishing emails and in\ncreating well-tailored responses to end-users. We share the Phishing Codebook\nand the annotated benchmark dataset to help researchers have a better\nunderstanding of phishing emails.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bOcJWjh13EJF_DNZ_OEZFMlB4-RwUbXCnkAipPmz84I","pdfSize":"1109080"}
