{"id":"2408.10797","title":"Low energy phonons in single crystal ZrW$_{2}$O$_{8}$","authors":"R. A. Ewings, K. Refson, T. G. Perring, J. Ollivier","authorsParsed":[["Ewings","R. A.",""],["Refson","K.",""],["Perring","T. G.",""],["Ollivier","J.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 12:45:41 GMT"}],"updateDate":"2024-08-21","timestamp":1724157941000,"abstract":"  ZrW$_{2}$O$_{8}$ is the prototypical example of a material exhibiting\nnegative thermal expansion (NTE). As well as being among the first NTE\nmaterials to be studied in detail, it has served as a test bed for ideas for\nthe physical mechanisms that lead to this unusual behavior. It is now widely\naccepted that here, and in many other framework materials exhibiting NTE, a\ncollection of low energy phonon modes, as opposed to just one or two, are\nresponsible for the anomalous thermal properties. However, quantitative\nverification and analysis of the density functional theory (DFT) calculations\nwhich underpin this proposal are still lacking. In particular, probing the low\nenergy phonons directly throughout reciprocal space using inelastic neutron\nscattering, as opposed to other techniques which only probe the Brillouin zone\ncenter, is technically challenging and hence rarely done. Here we report\ninelastic neutron scattering measurements in a large number of Brillouin zones,\nachieved via the time of flight technique, over a 400 K temperature range. We\nfind excellent agreement between DFT calculations and experimental data at low\ntemperature, albeit with a rescaling of the calculated phonon energies, and of\nthe lattice parameter used in the calculations compared to the measured value.\nHowever, the shifts in phonon modes due to the reduction in lattice parameter\non warming, that can be predicted using DFT, are not observed. This is most\nlikely due to counteractive anharmonic effects arising from the increased\namplitude of lattice vibrations at elevated temperatures. Notwithstanding, the\ngood agreement between experiment and DFT gives high confidence that the\ntheory's predictions of atomic motions for different modes is correct, and\nhence can be used as a reliable basis for quantitative analysis of NTE effects.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jnHLWyPwoJaL7h1GBsVOtm6tbo0YpZ8qzU9X8t4ONVs","pdfSize":"26736686"}
