{"id":"2408.11311","title":"HiMA: Hierarchical Quantum Microarchitecture for Qubit-Scaling and\n  Quantum Process-Level Parallelism","authors":"Qi Zhou, Zi-Hao Mei, Han-Qing Shi, Liang-Liang Guo, Xiao-Yan Yang,\n  Yun-Jie Wang, Xiao-Fan Xu, Cheng Xue, Wei-Cheng Kong, Jun-Chao Wang, Yu-Chun\n  Wu, Zhao-Yun Chen and Guo-Ping Guo","authorsParsed":[["Zhou","Qi",""],["Mei","Zi-Hao",""],["Shi","Han-Qing",""],["Guo","Liang-Liang",""],["Yang","Xiao-Yan",""],["Wang","Yun-Jie",""],["Xu","Xiao-Fan",""],["Xue","Cheng",""],["Kong","Wei-Cheng",""],["Wang","Jun-Chao",""],["Wu","Yu-Chun",""],["Chen","Zhao-Yun",""],["Guo","Guo-Ping",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 03:29:17 GMT"}],"updateDate":"2024-08-22","timestamp":1724210957000,"abstract":"  Quantum computing holds immense potential for addressing a myriad of\nintricate challenges, which is significantly amplified when scaled to thousands\nof qubits. However, a major challenge lies in developing an efficient and\nscalable quantum control system. To address this, we propose a novel\nHierarchical MicroArchitecture (HiMA) designed to facilitate qubit scaling and\nexploit quantum process-level parallelism. This microarchitecture is based on\nthree core elements: (i) discrete qubit-level drive and readout, (ii) a\nprocess-based hierarchical trigger mechanism, and (iii) multiprocessing with a\nstaggered triggering technique to enable efficient quantum process-level\nparallelism. We implement HiMA as a control system for a 72-qubit tunable\nsuperconducting quantum processing unit, serving a public quantum cloud\ncomputing platform, which is capable of expanding to 6144 qubits through\nthree-layer cascading. In our benchmarking tests, HiMA achieves up to a 4.89x\nspeedup under a 5-process parallel configuration. Consequently, to the best of\nour knowledge, we have achieved the highest CLOPS (Circuit Layer Operations Per\nSecond), reaching up to 43,680, across all publicly available platforms.\n","subjects":["Computing Research Repository/Hardware Architecture","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}