{"id":"2408.10264","title":"OPDR: Order-Preserving Dimension Reduction for Semantic Embedding of\n  Multimodal Scientific Data","authors":"Chengyu Gong, Gefei Shen, Luanzheng Guo, Nathan Tallent, Dongfang Zhao","authorsParsed":[["Gong","Chengyu",""],["Shen","Gefei",""],["Guo","Luanzheng",""],["Tallent","Nathan",""],["Zhao","Dongfang",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 22:30:44 GMT"}],"updateDate":"2024-08-21","timestamp":1723761044000,"abstract":"  One of the most common operations in multimodal scientific data management is\nsearching for the $k$ most similar items (or, $k$-nearest neighbors, KNN) from\nthe database after being provided a new item. Although recent advances of\nmultimodal machine learning models offer a \\textit{semantic} index, the\nso-called \\textit{embedding vectors} mapped from the original multimodal data,\nthe dimension of the resulting embedding vectors are usually on the order of\nhundreds or a thousand, which are impractically high for time-sensitive\nscientific applications.\n  This work proposes to reduce the dimensionality of the output embedding\nvectors such that the set of top-$k$ nearest neighbors do not change in the\nlower-dimensional space, namely Order-Preserving Dimension Reduction (OPDR). In\norder to develop such an OPDR method, our central hypothesis is that by\nanalyzing the intrinsic relationship among key parameters during the\ndimension-reduction map, a quantitative function may be constructed to reveal\nthe correlation between the target (lower) dimensionality and other variables.\nTo demonstrate the hypothesis, this paper first defines a formal measure\nfunction to quantify the KNN similarity for a specific vector, then extends the\nmeasure into an aggregate accuracy of the global metric spaces, and finally\nderives a closed-form function between the target (lower) dimensionality and\nother variables. We incorporate the closed-function into popular\ndimension-reduction methods, various distance metrics, and embedding models.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}