{"id":"2408.10929","title":"A Comparative Study of Neutron Irradiation for Genetic Mutations:\n  Spallation, Reactor, and Compact Neutron Source","authors":"May Sweet (1 and 2), Kenji Mishima (3 and 2), Masahide Harada (4),\n  Keisuke Kurita (5), Hiroshi Iikura (5), Seiji Tasaki (6), Norio Kikuchi (1\n  and 2)","authorsParsed":[["Sweet","May","","1 and 2"],["Mishima","Kenji","","3 and 2"],["Harada","Masahide","","1\n  and 2"],["Kurita","Keisuke","","1\n  and 2"],["Iikura","Hiroshi","","1\n  and 2"],["Tasaki","Seiji","","1\n  and 2"],["Kikuchi","Norio","","1\n  and 2"]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 15:12:37 GMT"}],"updateDate":"2024-08-21","timestamp":1724166757000,"abstract":"  Neutron beam, being electrically neutral and highly penetrating, offers\nunique advantages for irradiation of biological species such as plants, seeds,\nand microorganisms. We comprehensively investigate the potential of neutron\nirradiation for inducing genetic mutations using simulations of J-PARC BL10,\nJRR-3 TNRF, and KUANS for spallation, reactor, and compact neutron sources. We\nanalyze neutron flux, energy deposition rates, and Linear Energy Transfer (LET)\ndistributions. KUANS demonstrated the highest dose rate of 17 Gy/h,\nsignificantly surpassing BL10, due to the large solid angle by the optimal\nsample placement. The findings highlight KUANS's suitability for efficient\ngenetic mutations and neutron breeding, particularly for inducing targeted\nmutations in biological samples. The LET range of KUANS is concentrated in\n20-70 keV/{\\mu}m, which is potentially ideal for inducing specific genetic\nmutations. The importance of choosing neutron sources based on LET requirements\nto maximize mutation induction efficiency is emphasized. This research shows\nthe potential of compact neutron sources like KUANS for effective biological\nirradiation and neutron breeding, offering a viable alternative to larger\nfacilities. The neutron filters used in BL10 and TNRF effectively excluded\nlow-energy neutrons with keeping the high LET component. The neutron capture\nreaction, 14N(n,p)14C, was found to be the main dose under thermal\nneutron-dominated conditions.\n","subjects":["Physics/Accelerator Physics","Physics/Biological Physics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}