{"id":"2408.13540","title":"Targeted Least Cardinality Candidate Key for Relational Databases","authors":"Vasileios Nakos, Hung Q. Ngo, Charalampos E. Tsourakakis","authorsParsed":[["Nakos","Vasileios",""],["Ngo","Hung Q.",""],["Tsourakakis","Charalampos E.",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 10:01:14 GMT"}],"updateDate":"2024-08-27","timestamp":1724493674000,"abstract":"  Functional dependencies (FDs) are a central theme in databases, playing a\nmajor role in the design of database schemas and the optimization of queries.\nIn this work, we introduce the {\\it targeted least cardinality candidate key\nproblem} (TCAND). This problem is defined over a set of functional dependencies\n$F$ and a target variable set $T \\subseteq V$, and it aims to find the smallest\nset $X \\subseteq V$ such that the FD $X \\to T$ can be derived from $F$. The\nTCAND problem generalizes the well-known NP-hard problem of finding the least\ncardinality candidate key~\\cite{lucchesi1978candidate}, which has been\npreviously demonstrated to be at least as difficult as the set cover problem.\n  We present an integer programming (IP) formulation for the TCAND problem,\nanalogous to a layered set cover problem. We analyze its linear programming\n(LP) relaxation from two perspectives: we propose two approximation algorithms\nand investigate the integrality gap. Our findings indicate that the\napproximation upper bounds for our algorithms are not significantly improvable\nthrough LP rounding, a notable distinction from the standard set cover problem.\nAdditionally, we discover that a generalization of the TCAND problem is\nequivalent to a variant of the set cover problem, named red-blue set\ncover~\\cite{carr1999red}, which cannot be approximated within a sub-polynomial\nfactor in polynomial time under plausible\nconjectures~\\cite{chlamtavc2023approximating}. Despite the extensive history\nsurrounding the issue of identifying the least cardinality candidate key, our\nresearch contributes new theoretical insights, novel algorithms, and\ndemonstrates that the general TCAND problem poses complexities beyond those\nencountered in the set cover problem.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Data Structures and Algorithms"],"license":"http://creativecommons.org/licenses/by/4.0/"}