{"id":"2408.07759","title":"SWaT: Statistical Modeling of Video Watch Time through User Behavior\n  Analysis","authors":"Shentao Yang, Haichuan Yang, Linna Du, Adithya Ganesh, Bo Peng, Boying\n  Liu, Serena Li, Ji Liu","authorsParsed":[["Yang","Shentao",""],["Yang","Haichuan",""],["Du","Linna",""],["Ganesh","Adithya",""],["Peng","Bo",""],["Liu","Boying",""],["Li","Serena",""],["Liu","Ji",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 18:19:35 GMT"}],"updateDate":"2024-08-16","timestamp":1723659575000,"abstract":"  The significance of estimating video watch time has been highlighted by the\nrising importance of (short) video recommendation, which has become a core\nproduct of mainstream social media platforms. Modeling video watch time,\nhowever, has been challenged by the complexity of user-video interaction, such\nas different user behavior modes in watching the recommended videos and varying\nwatching probabilities over the video horizon. Despite the importance and\nchallenges, existing literature on modeling video watch time mostly focuses on\nrelatively black-box mechanical enhancement of the classical\nregression/classification losses, without factoring in user behavior in a\nprincipled manner. In this paper, we for the first time take on a user-centric\nperspective to model video watch time, from which we propose a white-box\nstatistical framework that directly translates various user behavior\nassumptions in watching (short) videos into statistical watch time models.\nThese behavior assumptions are portrayed by our domain knowledge on users'\nbehavior modes in video watching. We further employ bucketization to cope with\nuser's non-stationary watching probability over the video horizon, which\nadditionally helps to respect the constraint of video length and facilitate the\npractical compatibility between the continuous regression event of watch time\nand other binary classification events. We test our models extensively on two\npublic datasets, a large-scale offline industrial dataset, and an online A/B\ntest on a short video platform with hundreds of millions of daily-active users.\nOn all experiments, our models perform competitively against strong relevant\nbaselines, demonstrating the efficacy of our user-centric perspective and\nproposed framework.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0bj6NGZxCp4MCIdPDWDZ0tcMl1lZMq3YZPHVrC3FC3g","pdfSize":"1010052"}
