{"id":"2408.06276","title":"Review-driven Personalized Preference Reasoning with Large Language\n  Models for Recommendation","authors":"Jieyong Kim, Hyunseo Kim, Hyunjin Cho, SeongKu Kang, Buru Chang,\n  Jinyoung Yeo, Dongha Lee","authorsParsed":[["Kim","Jieyong",""],["Kim","Hyunseo",""],["Cho","Hyunjin",""],["Kang","SeongKu",""],["Chang","Buru",""],["Yeo","Jinyoung",""],["Lee","Dongha",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 16:39:03 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 11:05:10 GMT"}],"updateDate":"2024-08-14","timestamp":1723480743000,"abstract":"  Recent advancements in Large Language Models (LLMs) have demonstrated\nexceptional performance across a wide range of tasks, generating significant\ninterest in their application to recommendation systems. However, existing\nmethods have not fully capitalized on the potential of LLMs, often constrained\nby limited input information or failing to fully utilize their advanced\nreasoning capabilities. To address these limitations, we introduce EXP3RT, a\nnovel LLM-based recommender designed to leverage rich preference information\ncontained in user and item reviews. EXP3RT is basically fine-tuned through\ndistillation from a teacher LLM to perform three key tasks in order: EXP3RT\nfirst extracts and encapsulates essential subjective preferences from raw\nreviews, aggregates and summarizes them according to specific criteria to\ncreate user and item profiles. It then generates detailed step-by-step\nreasoning followed by predicted rating, i.e., reasoning-enhanced rating\nprediction, by considering both subjective and objective information from\nuser/item profiles and item descriptions. This personalized preference\nreasoning from EXP3RT enhances rating prediction accuracy and also provides\nfaithful and reasonable explanations for recommendation. Extensive experiments\nshow that EXP3RT outperforms existing methods on both rating prediction and\ncandidate item reranking for top-k recommendation, while significantly\nenhancing the explainability of recommendation systems.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"p24h0dh0mciMHmB7dQGM-QkKexmx5r0rLUeRi_l1uqE","pdfSize":"1611889"}
