{"id":"2408.14211","title":"MagicMan: Generative Novel View Synthesis of Humans with 3D-Aware\n  Diffusion and Iterative Refinement","authors":"Xu He and Xiaoyu Li and Di Kang and Jiangnan Ye and Chaopeng Zhang and\n  Liyang Chen and Xiangjun Gao and Han Zhang and Zhiyong Wu and Haolin Zhuang","authorsParsed":[["He","Xu",""],["Li","Xiaoyu",""],["Kang","Di",""],["Ye","Jiangnan",""],["Zhang","Chaopeng",""],["Chen","Liyang",""],["Gao","Xiangjun",""],["Zhang","Han",""],["Wu","Zhiyong",""],["Zhuang","Haolin",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 12:10:52 GMT"}],"updateDate":"2024-08-27","timestamp":1724674252000,"abstract":"  Existing works in single-image human reconstruction suffer from weak\ngeneralizability due to insufficient training data or 3D inconsistencies for a\nlack of comprehensive multi-view knowledge. In this paper, we introduce\nMagicMan, a human-specific multi-view diffusion model designed to generate\nhigh-quality novel view images from a single reference image. As its core, we\nleverage a pre-trained 2D diffusion model as the generative prior for\ngeneralizability, with the parametric SMPL-X model as the 3D body prior to\npromote 3D awareness. To tackle the critical challenge of maintaining\nconsistency while achieving dense multi-view generation for improved 3D human\nreconstruction, we first introduce hybrid multi-view attention to facilitate\nboth efficient and thorough information interchange across different views.\nAdditionally, we present a geometry-aware dual branch to perform concurrent\ngeneration in both RGB and normal domains, further enhancing consistency via\ngeometry cues. Last but not least, to address ill-shaped issues arising from\ninaccurate SMPL-X estimation that conflicts with the reference image, we\npropose a novel iterative refinement strategy, which progressively optimizes\nSMPL-X accuracy while enhancing the quality and consistency of the generated\nmulti-views. Extensive experimental results demonstrate that our method\nsignificantly outperforms existing approaches in both novel view synthesis and\nsubsequent 3D human reconstruction tasks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}