{"id":"2408.14681","title":"Enhancing Neural Network Interpretability Through Conductance-Based\n  Information Plane Analysis","authors":"Jaouad Dabounou and Amine Baazzouz","authorsParsed":[["Dabounou","Jaouad",""],["Baazzouz","Amine",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 23:10:42 GMT"}],"updateDate":"2024-08-28","timestamp":1724713842000,"abstract":"  The Information Plane is a conceptual framework used to analyze the flow of\ninformation in neural networks, but traditional methods based on activations\nmay not fully capture the dynamics of information processing. This paper\nintroduces a new approach that uses layer conductance, a measure of sensitivity\nto input features, to enhance the Information Plane analysis. By incorporating\ngradient-based contributions, we provide a more precise characterization of\ninformation dynamics within the network. The proposed conductance-based\nInformation Plane and a new Information Transformation Efficiency (ITE) metric\nare evaluated on pretrained ResNet50 and VGG16 models using the ImageNet\ndataset. Our results demonstrate the ability to identify critical hidden layers\nthat contribute significantly to model performance and interpretability, giving\ninsights into information compression, preservation, and utilization across\nlayers. The conductance-based approach offers a granular perspective on feature\nattribution, enhancing our understanding of the decision-making processes\nwithin neural networks. Furthermore, our empirical findings challenge certain\ntheoretical predictions of the Information Bottleneck theory, highlighting the\ncomplexities of information dynamics in real-world data scenarios. The proposed\nmethod not only advances our understanding of information dynamics in neural\nnetworks but also has the potential to significantly impact the broader field\nof Artificial Intelligence by enabling the development of more interpretable,\nefficient, and robust models.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}