{"id":"2408.15051","title":"Optical Routing via High Efficiency Composite Acoustic Diffraction","authors":"Yuxiang Zhao, Jiangyong Hu, Ruijuan Liu, Ruochen Gao, Yiming Li, Xiao\n  Zhang, Huanfeng Zhu, Saijun Wu","authorsParsed":[["Zhao","Yuxiang",""],["Hu","Jiangyong",""],["Liu","Ruijuan",""],["Gao","Ruochen",""],["Li","Yiming",""],["Zhang","Xiao",""],["Zhu","Huanfeng",""],["Wu","Saijun",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 13:23:34 GMT"}],"updateDate":"2024-08-28","timestamp":1724765014000,"abstract":"  Acousto-optical modulation (AOM) is a powerful and widely used technique for\nrapidly controlling the frequency, phase, intensity, and direction of light.\nBased on Bragg diffraction, AOMs typically exhibit moderate diffraction\nefficiency, often less than 90\\% even for collimated inputs. In this work, we\ndemonstrate that this efficiency can be significantly improved using a\ncomposite (CP) setup comprising a pair of 4-F-linked AOMs, enabling 2-by-2\nbeamsplitting with fully tunable splitting amplitude and phase. The efficiency\nenhancement arises from two effects, termed \"momentum echo\" and \"high-order\nrephasing,\" which can be simultaneously optimized by adjusting the relative\ndistance between the two AOMs. This method is resource-efficient, does not\nrequire ultra-collimation, and maintains control bandwidth. Experimentally, we\nachieved a diffraction efficiency exceeding 99\\% (excluding insertion loss) and\na 35 dB single-mode suppression of the 0th-order beam, demonstrating a\nfull-contrast optical router with a switching time of less than\n100~nanoseconds. Theoretically, we formulate the dynamics of CP-AOM in terms of\nmulti-mode quantum control and discuss extensions beyond the $N=2$\nconfiguration presented in this work. The substantially enhanced performance of\nCP-AOMs, coupled with reduced acoustic amplitude requirements, may\nsignificantly advance our ability to accurately control light at high speeds\nwith low-loss acousto-optics.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Lx-to0z2MWwcW3FXJ0ixABtUhvBzhr4nRORvuqLsqaY","pdfSize":"2066074"}
