{"id":"2408.17445","title":"The picasso gas model: Painting intracluster gas on gravity-only\n  simulations","authors":"F. K\\'eruzor\\'e, L. E. Bleem, N. Frontiere, N. Krishnan, M. Buehlmann,\n  J.D. Emberson, S. Habib, P. Larsen","authorsParsed":[["Kéruzoré","F.",""],["Bleem","L. E.",""],["Frontiere","N.",""],["Krishnan","N.",""],["Buehlmann","M.",""],["Emberson","J. D.",""],["Habib","S.",""],["Larsen","P.",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 17:55:05 GMT"}],"updateDate":"2024-09-02","timestamp":1725040505000,"abstract":"  We introduce picasso, a model designed to predict thermodynamic properties of\nthe intracluster medium based on the properties of halos in gravity-only\nsimulations. The predictions result from the combination of an analytical gas\nmodel, mapping gas properties to the gravitational potential, and of a machine\nlearning model to predict the model parameters for individual halos based on\ntheir scalar properties, such as mass and concentration. Once trained, the\nmodel can be applied to make predictions for arbitrary potential distributions,\nallowing its use with flexible inputs such as N-body particle distributions or\nradial profiles. We present the model, and train it using pairs of gravity-only\nand hydrodynamic simulations. We show that when trained on non-radiative\nhydrodynamic simulations, picasso can make remarkably accurate and precise\npredictions of intracluster gas thermodynamics. Training the model on\nfull-physics simulations yields robust predictions as well, albeit with\nslightly degraded performance. We further show that the model can be trained to\nmake accurate predictions from very minimal information, at the cost of\nmodestly reduced precision. picasso is made publicly available as a Python\npackage, which includes trained models that can be used to make predictions\neasily and efficiently, in a fully auto-differentiable and hardware-accelerated\nframework.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}