{"id":"2408.07939","title":"$\\mathcal{H}_2$-optimal Model Reduction of Linear Quadratic Output\n  Systems in Finite Frequency Range","authors":"Umair Zulfiqar, Zhi-Hua Xiao, Qiu-Yan Song, Mohammad Monir Uddin, and\n  Victor Sreeram","authorsParsed":[["Zulfiqar","Umair",""],["Xiao","Zhi-Hua",""],["Song","Qiu-Yan",""],["Uddin","Mohammad Monir",""],["Sreeram","Victor",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 05:27:02 GMT"}],"updateDate":"2024-08-16","timestamp":1723699622000,"abstract":"  Linear quadratic output systems constitute an important class of dynamical\nsystems with numerous practical applications. When the order of these models is\nexceptionally high, simulating and analyzing these systems becomes\ncomputationally prohibitive. In such instances, model order reduction offers an\neffective solution by approximating the original high-order system with a\nreduced-order model while preserving the system's essential characteristics.\n  In frequency-limited model order reduction, the objective is to maintain the\nfrequency response of the original system within a specified frequency range in\nthe reduced-order model. In this paper, a mathematical expression for the\nfrequency-limited $\\mathcal{H}_2$ norm is derived, which quantifies the error\nwithin the desired frequency interval. Subsequently, the necessary conditions\nfor a local optimum of the frequency-limited $\\mathcal{H}_2$ norm of the error\nare derived. The inherent difficulty in satisfying these conditions within a\nPetrov-Galerkin projection framework is also discussed. Based on the optimality\nconditions and Petrov-Galerkin projection, a stationary point iteration\nalgorithm is proposed that enforces three of the four optimality conditions\nupon convergence. A numerical example is provided to illustrate the algorithm's\neffectiveness in accurately approximating the original high-order model within\nthe specified frequency interval.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}