{"id":"2408.00249","title":"Task-Adapter: Task-specific Adaptation of Image Models for Few-shot\n  Action Recognition","authors":"Congqi Cao, Yueran Zhang, Yating Yu, Qinyi Lv, Lingtong Min, Yanning\n  Zhang","authorsParsed":[["Cao","Congqi",""],["Zhang","Yueran",""],["Yu","Yating",""],["Lv","Qinyi",""],["Min","Lingtong",""],["Zhang","Yanning",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 03:06:56 GMT"}],"updateDate":"2024-08-02","timestamp":1722481616000,"abstract":"  Existing works in few-shot action recognition mostly fine-tune a pre-trained\nimage model and design sophisticated temporal alignment modules at feature\nlevel. However, simply fully fine-tuning the pre-trained model could cause\noverfitting due to the scarcity of video samples. Additionally, we argue that\nthe exploration of task-specific information is insufficient when relying\nsolely on well extracted abstract features. In this work, we propose a simple\nbut effective task-specific adaptation method (Task-Adapter) for few-shot\naction recognition. By introducing the proposed Task-Adapter into the last\nseveral layers of the backbone and keeping the parameters of the original\npre-trained model frozen, we mitigate the overfitting problem caused by full\nfine-tuning and advance the task-specific mechanism into the process of feature\nextraction. In each Task-Adapter, we reuse the frozen self-attention layer to\nperform task-specific self-attention across different videos within the given\ntask to capture both distinctive information among classes and shared\ninformation within classes, which facilitates task-specific adaptation and\nenhances subsequent metric measurement between the query feature and support\nprototypes. Experimental results consistently demonstrate the effectiveness of\nour proposed Task-Adapter on four standard few-shot action recognition\ndatasets. Especially on temporal challenging SSv2 dataset, our method\noutperforms the state-of-the-art methods by a large margin.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}