{"id":"2408.05051","title":"A GNN Model with Adaptive Weights for Session-Based Recommendation\n  Systems","authors":"Beg\\\"um \\\"Ozbay and Resul Tugay and \\c{S}ule G\\\"und\\\"uz\n  \\\"O\\u{g}\\\"ud\\\"uc\\\"u","authorsParsed":[["Özbay","Begüm",""],["Tugay","Resul",""],["Öğüdücü","Şule Gündüz",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 13:13:43 GMT"}],"updateDate":"2024-08-31","timestamp":1723209223000,"abstract":"  Session-based recommendation systems aim to model users' interests based on\ntheir sequential interactions to predict the next item in an ongoing session.\nIn this work, we present a novel approach that can be used in session-based\nrecommendations (SBRs). Our goal is to enhance the prediction accuracy of an\nexisting session-based recommendation model, the SR-GNN model, by introducing\nan adaptive weighting mechanism applied to the graph neural network (GNN)\nvectors. This mechanism is designed to incorporate various types of side\ninformation obtained through different methods during the study. Items are\nassigned varying degrees of importance within each session as a result of the\nweighting mechanism. We hypothesize that this adaptive weighting strategy will\ncontribute to more accurate predictions and thus improve the overall\nperformance of SBRs in different scenarios. The adaptive weighting strategy can\nbe utilized to address the cold start problem in SBRs by dynamically adjusting\nthe importance of items in each session, thus providing better recommendations\nin cold start situations, such as for new users or newly added items. Our\nexperimental evaluations on the Dressipi dataset demonstrate the effectiveness\nof the proposed approach compared to traditional models in enhancing the user\nexperience and highlighting its potential to optimize the recommendation\nresults in real-world applications.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0FrcVgY12fwi3uxNIpmbB_6xJAv24swObDtKJylMEA8","pdfSize":"616544"}
