{"id":"2408.00939","title":"New constraints on the central mass contents of Omega Centauri from\n  combined stellar kinematics and pulsar timing","authors":"Andr\\'es Ba\\~nares-Hern\\'andez, Francesca Calore, Jorge Martin\n  Camalich, Justin I. Read","authorsParsed":[["Bañares-Hernández","Andrés",""],["Calore","Francesca",""],["Camalich","Jorge Martin",""],["Read","Justin I.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 22:06:50 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 11:45:22 GMT"},{"version":"v3","created":"Sat, 24 Aug 2024 19:00:07 GMT"},{"version":"v4","created":"Tue, 27 Aug 2024 12:01:39 GMT"}],"updateDate":"2024-08-28","timestamp":1722550010000,"abstract":"  We perform a combined analysis of stellar kinematics and line-of-sight\naccelerations of millisecond pulsars to investigate the mass contents of Omega\nCentauri. We consider multiple mass components: the visible photometric\ndistribution, a central cluster of dark remnants, an intermediate-mass black\nhole, and a distribution of intermediate extension traced by the pulsars. By\nself-consistently incorporating multiple independent datasets, including the\neffects of different centers, we obtain significant constraints on these mass\ndistributions. Our results strongly favor an extended central mass of ~ 2 - 3 x\n10^5 Msun, emulating a cluster of heavy stellar remnants, over an IMBH, with a\n3-sigma upper limit of 6 x 10^3 Msun on its mass. Pulsar timing observations\nprovide significant constraints, favoring a central mass distribution that is ~\n20% more massive and extended. Notably, we observe a clear linear scaling\nbetween the pulsar distribution and stellar encounter rates, showing excellent\nagreement with the expectation from millisecond pulsar formation models and\nmotivating a profile for their distribution, providing the first validation of\nits kind where positions are linked to their place of formation in globular\nclusters. Our findings highlight the effectiveness of this novel methodology in\nexploring the structure of star clusters, setting a promising precedent amid\nthe advent of the rapidly growing number of observations and discoveries\ncurrently being experienced in this field.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}