{"id":"2408.08717","title":"A soft-clamped topological waveguide for phonons","authors":"Xiang Xi, Ilia Chernobrovkin, Jan Ko\\v{s}ata, Mads B. Kristensen, Eric\n  C. Langman, Anders S. S{\\o}rensen, Oded Zilberberg and Albert Schliesser","authorsParsed":[["Xi","Xiang",""],["Chernobrovkin","Ilia",""],["Košata","Jan",""],["Kristensen","Mads B.",""],["Langman","Eric C.",""],["Sørensen","Anders S.",""],["Zilberberg","Oded",""],["Schliesser","Albert",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 12:59:14 GMT"}],"updateDate":"2024-08-19","timestamp":1723813154000,"abstract":"  Topological insulators were originally discovered for electron waves in\ncondensed matter systems. Recently this concept has been transferred to bosonic\nsystems such as photons and phonons, which propagate in materials patterned\nwith artificial lattices that emulate spin-Hall physics. This work has been\nmotivated, in part, by the prospect of topologically protected transport along\nedge channels in on-chip circuits. Importantly, even in principle, topology\nprotects propagation against backscattering, but not against loss, which has\nremained limited to the dB/cm-level for phonon waveguides, be they topological\nor not. Here, we combine advanced dissipation engineering, in particular the\nrecently introduced method of soft-clamping, with the concept of a valley-Hall\ntopological insulator for phonons. This enables on-chip phononic waveguides\nwith propagation losses of 3 dB/km at room temperature, orders of magnitude\nbelow any previous chip-scale devices. For the first time, the low losses also\nallow us to accurately quantify backscattering protection in a topological\nphonon waveguide, using high-resolution ultrasound spectroscopy. We infer that\nphonons follow a sharp, 120 degree-bend with a 99.99%-probability instead of\nbeing scattered back, and less than one phonon in a million is lost. The\nextraordinary combination of features of this novel platform suggest\napplications in classical and quantum signal routing, processing, and storage.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"QAYJqUtKEOxzh5mv0RSJnOImdmv5gVh_9B2bhCwSVf0","pdfSize":"8630703"}
