{"id":"2408.10567","title":"Prompt Your Brain: Scaffold Prompt Tuning for Efficient Adaptation of\n  fMRI Pre-trained Model","authors":"Zijian Dong, Yilei Wu, Zijiao Chen, Yichi Zhang, Yueming Jin, Juan\n  Helen Zhou","authorsParsed":[["Dong","Zijian",""],["Wu","Yilei",""],["Chen","Zijiao",""],["Zhang","Yichi",""],["Jin","Yueming",""],["Zhou","Juan Helen",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 06:08:37 GMT"}],"updateDate":"2024-08-21","timestamp":1724134117000,"abstract":"  We introduce Scaffold Prompt Tuning (ScaPT), a novel prompt-based framework\nfor adapting large-scale functional magnetic resonance imaging (fMRI)\npre-trained models to downstream tasks, with high parameter efficiency and\nimproved performance compared to fine-tuning and baselines for prompt tuning.\nThe full fine-tuning updates all pre-trained parameters, which may distort the\nlearned feature space and lead to overfitting with limited training data which\nis common in fMRI fields. In contrast, we design a hierarchical prompt\nstructure that transfers the knowledge learned from high-resource tasks to\nlow-resource ones. This structure, equipped with a Deeply-conditioned\nInput-Prompt (DIP) mapping module, allows for efficient adaptation by updating\nonly 2% of the trainable parameters. The framework enhances semantic\ninterpretability through attention mechanisms between inputs and prompts, and\nit clusters prompts in the latent space in alignment with prior knowledge.\nExperiments on public resting state fMRI datasets reveal ScaPT outperforms\nfine-tuning and multitask-based prompt tuning in neurodegenerative diseases\ndiagnosis/prognosis and personality trait prediction, even with fewer than 20\nparticipants. It highlights ScaPT's efficiency in adapting pre-trained fMRI\nmodels to low-resource tasks.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ymvzJj5jreyKXK1cdZTiLyLLhEfGvc21s9l3IsDdNeo","pdfSize":"741245"}
