{"id":"2408.08841","title":"FLEXTAF: Enhancing Table Reasoning with Flexible Tabular Formats","authors":"Xuanliang Zhang, Dingzirui Wang, Longxu Dou, Baoxin Wang, Dayong Wu,\n  Qingfu Zhu, Wanxiang Che","authorsParsed":[["Zhang","Xuanliang",""],["Wang","Dingzirui",""],["Dou","Longxu",""],["Wang","Baoxin",""],["Wu","Dayong",""],["Zhu","Qingfu",""],["Che","Wanxiang",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 17:00:11 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 06:23:45 GMT"}],"updateDate":"2024-08-28","timestamp":1723827611000,"abstract":"  The table reasoning task aims to answer the question according to the given\ntable. Currently, using Large Language Models (LLMs) is the predominant method\nfor table reasoning. Most existing methods employ a fixed tabular format to\nrepresent the table, which could limit the performance. Given that each\ninstance requires different capabilities and models possess varying abilities,\nwe assert that different instances and models suit different tabular formats.\nWe prove the aforementioned claim through quantitative analysis of experimental\nresults, where different instances and models achieve different performances\nusing various tabular formats. Building on this discussion, we propose\nFLEXTAF-Single and FLEXTAF-Vote to enhance table reasoning performance by\nemploying flexible tabular formats. Specifically, (i) FLEXTAF-Single trains a\nclassifier to predict the most suitable tabular format based on the instance\nand the LLM. (ii) FLEXTAF-Vote integrates the results across different formats.\nOur experiments on WikiTableQuestions and TabFact reveal significant\nimprovements, with average gains of 2.3% and 4.8% compared to the best\nperformance achieved using a fixed tabular format with greedy decoding and\nself-consistency decoding, thereby validating the effectiveness of our methods.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"G-vW_KUU_TAB-cjnIxDTeuyetkhDaoDIxLARFPlU3No","pdfSize":"1021012"}
