{"id":"2408.13996","title":"Research Advances and New Paradigms for Biology-inspired Spiking Neural\n  Networks","authors":"Tianyu Zheng, Liyuan Han, Tielin Zhang","authorsParsed":[["Zheng","Tianyu",""],["Han","Liyuan",""],["Zhang","Tielin",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 03:37:48 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 08:28:57 GMT"}],"updateDate":"2024-08-29","timestamp":1724643468000,"abstract":"  Spiking neural networks (SNNs) are gaining popularity in the computational\nsimulation and artificial intelligence fields owing to their biological\nplausibility and computational efficiency. This paper explores the historical\ndevelopment of SNN and concludes that these two fields are intersecting and\nmerging rapidly. Following the successful application of Dynamic Vision Sensors\n(DVS) and Dynamic Audio Sensors (DAS), SNNs have found some proper paradigms,\nsuch as continuous visual signal tracking, automatic speech recognition, and\nreinforcement learning for continuous control, that have extensively supported\ntheir key features, including spike encoding, neuronal heterogeneity, specific\nfunctional circuits, and multiscale plasticity. Compared to these real-world\nparadigms, the brain contains a spiking version of the biology-world paradigm,\nwhich exhibits a similar level of complexity and is usually considered a mirror\nof the real world. Considering the projected rapid development of invasive and\nparallel Brain-Computer Interface (BCI), as well as the new BCI-based paradigms\nthat include online pattern recognition and stimulus control of biological\nspike trains, SNNs naturally leverage their advantages in energy efficiency,\nrobustness, and flexibility. The biological brain has inspired the present\nstudy of SNNs and effective SNN machine-learning algorithms, which can help\nenhance neuroscience discoveries in the brain by applying them to the new BCI\nparadigm. Such two-way interactions with positive feedback can accelerate brain\nscience research and brain-inspired intelligence technology.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}