{"id":"2408.04328","title":"Two-dimensional Weyl nodal-line semimetal and antihelical edge states in\n  a modified Kane-Mele model","authors":"Xiaokang Dai, Pei-Hao Fu, Yee Sin Ang, and Qinjun Chen","authorsParsed":[["Dai","Xiaokang",""],["Fu","Pei-Hao",""],["Ang","Yee Sin",""],["Chen","Qinjun",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 09:22:43 GMT"},{"version":"v2","created":"Sun, 11 Aug 2024 06:12:58 GMT"}],"updateDate":"2024-08-13","timestamp":1723108963000,"abstract":"  The Kane-Mele model has been modified to achieve versatile topological\nphases. Previous work [Phys. Rev. Lett. 120, 156402 (2018)] introduced a\nstaggered intrinsic spin-orbit coupling effect to generate pseudohelical edge\nstates, with Rashba spin-orbit coupling facilitating spin flips in alternating\nsublattices. Our study demonstrates that, in the absence of Rashba spin-orbit\ncoupling, the modified Kane-Mele model with staggered intrinsic spin-orbit\ncoupling evolves into a $Z_{2}$ class topological metal, specifically a\ntwo-dimensional Weyl nodal-line semimetal. In a nanoribbon geometry, we predict\nthe emergence of antihelical edge states, which support spin-polarized currents\nflowing in the same direction along parallel boundaries. Unlike pseudohelical\nedge states, antihelical edge states can be viewed as a superposition of two\nantichiral edge states related by time-reversal symmetry. However, the spin\nHall conductance from antihelical edge states is not quantized due to the\npresence of gapless bulk states. Additionally, we examine the robustness of\nhelical, pseudohelical, and antihelical edge states in the presence of\nnonmagnetic disorders, highlighting the particular fragility of antihelical\nedge states. Our findings enhance the understanding of the modified Kane-Mele\nmodel, providing new insights into its topological properties.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}