{"id":"2408.14286","title":"Revisiting the Borde-Traub focal plane wavefront estimation technique\n  for exoplanet direct imaging","authors":"Axel Potier, A J Eldorado Riggs, Garreth Ruane, Phillip K. Poon,\n  Matthew Noyes, Greg W. Allan, Alexander B. Walter, Camilo Mejia Prada,\n  Raphael Galicher, Johan Mazoyer, Pierre Baudoz","authorsParsed":[["Potier","Axel",""],["Riggs","A J Eldorado",""],["Ruane","Garreth",""],["Poon","Phillip K.",""],["Noyes","Matthew",""],["Allan","Greg W.",""],["Walter","Alexander B.",""],["Prada","Camilo Mejia",""],["Galicher","Raphael",""],["Mazoyer","Johan",""],["Baudoz","Pierre",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 14:11:35 GMT"}],"updateDate":"2024-08-27","timestamp":1724681495000,"abstract":"  Direct imaging of exoplanets relies on complex wavefront sensing and control\narchitectures. In addition to fast adaptive optics systems, most of the future\nhigh-contrast imaging instruments will soon be equipped with focal plane\nwavefront sensing algorithms. These techniques use the science detector to\nestimate the static and quasi-static aberrations induced by optical\nmanufacturing defects and system thermal variations. Pair-wise probing (PWP)\nhas been the most widely used, especially for space-based application and will\nbe tested at contrast levels of ~1e-9 on-sky along with the future coronagraph\ninstrument onboarding the Roman Space Telescope. This algorithm leans on phase\ndiversities applied on the deformable mirror that are recorded in pairs. A\nminimum of two pairs of probes are required per bandwidth. An additional\nunprobed image is also recorded to verify the convergence rate of the\ncorrection. Before PWP, Borde & Traub proposed a similar algorithm that takes\nadvantage of the unprobed image in the estimation process to get rid of the\npair diversity requirement. In this work, we theoretically show that this\nlatter technique should be more efficient than PWP when the convergence time is\nnot limited by photon noise. We then present its performance and practical\nlimitations on coronagraphic testbeds at JPL and exhibit a first on-sky control\nof non-common path aberrations with such method on VLT/SPHERE.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZFL5cENswIp-W1K4VLHsnmaws0YjfgDSiTnm9oouQ1s","pdfSize":"1056598"}
