{"id":"2408.00035","title":"Electric Penrose process and the accretion disk around a 4D charged\n  Einstein-Gauss-Bonnet black hole","authors":"Mirzabek Alloqulov and Sanjar Shaymatov","authorsParsed":[["Alloqulov","Mirzabek",""],["Shaymatov","Sanjar",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 12:15:12 GMT"}],"updateDate":"2024-08-02","timestamp":1722428112000,"abstract":"  In this paper, we aim to examine the electric Penrose process (PP) around a\ncharged black hole in 4D Einstein-Gauss-Bonnet (EGB) gravity and bring out the\neffect of the Gauss-Bonnet (GB) coupling parameter $\\alpha$ and black hole\ncharge on the efficiency of the energy extraction from the black hole. This\nresearch is motivated by the fact that electrostatic interactions significantly\ninfluence the behavior of charged particles in the vicinity of a charged static\nblack hole. Under this interaction, decaying charged particles can have\nnegative energies, causing energy to be released from black holes with no\nergosphere. We show that the GB coupling parameter has a significant impact on\nthe energy efficiency of the electric PP, but the efficiency can be strongly\nenhanced by the black hole charge due to the Coulomb force. Finally, we\nconsider the accretion disk around the black hole and investigate in detail its\nradiation properties, such as the electromagnetic radiation flux, the\ntemperature, and the differential luminosity. We show that the GB coupling\nparameter can have a significant impact on the radiation parameters, causing\nthem to increase in the accretion disk in the vicinity of the black hole.\nInterestingly, it is found that the 4D EGB charged black hole is more efficient\nand favorable for the accretion disk radiation compared to a charged black hole\nin Einstein gravity.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"0P6C9OApYfixH3AhGoqk854xOJC0YN--rgLHPBK_giM","pdfSize":"1695765"}
