{"id":"2408.14341","title":"True and apparent motion of gravitational-wave detector test masses","authors":"Evan D. Hall and Kevin Kuns","authorsParsed":[["Hall","Evan D.",""],["Kuns","Kevin",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 15:13:25 GMT"}],"updateDate":"2024-08-27","timestamp":1724685205000,"abstract":"  Modern optomechanical systems employ increasingly sophisticated\nquantum-mechanical states of light to probe and manipulate mechanical motion.\nSqueezed states are now used routinely to enhance the sensitivity of\ngravitational-wave interferometers to small external forces, and they are also\nused in feedback-based trapping and damping experiments on the same\ninterferometers to enhance the achievable cooling of the the phonon occupation\nnumber of the differential test mass mode (arXiv:2102.12665). In this latter\ncontext, an accurate accounting of the true test mass motion, incorporating all\nsources of loss, the effect of feedback control, and the influence of classical\nforce and sensing noises, is paramount. We work within the two-photon formalism\nto provide such an accounting, which extends a physically motivated\ndecomposition of the quantum-mechanical noise of the light field\n(arxiv:2105.12052). This decomposition provides insight, rooted in\nexperimentally accessible parameters, into the optimal squeezed state that\nshould be employed to achieve the lowest occupation number. We apply this\nformalism to current and possible future gravitational-wave interferometers,\nLIGO A+, LIGO Voyager, Cosmic Explorer (CE), and CE Voyager, finding that\noccupation numbers below 1 are possible over a frequency range comparable to\nthe bandwidth of the trapped and cooled oscillator. We also discuss several\ntechnical issues in cooling experiments with gravitational-wave detectors.\n","subjects":["Physics/Quantum Physics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KofURglnzETHn0zfn-9nal9PdfncnPAv8jkRWyE6-uQ","pdfSize":"856134"}
