{"id":"2408.07645","title":"Properties of sunspot light bridges on a geometric height scale","authors":"S. Esteban Pozuelo, A. Asensio Ramos, C. J. D\\'iaz Baso, B. Ruiz Cobo","authorsParsed":[["Pozuelo","S. Esteban",""],["Ramos","A. Asensio",""],["Baso","C. J. Díaz",""],["Cobo","B. Ruiz",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 16:17:35 GMT"}],"updateDate":"2024-08-15","timestamp":1723652255000,"abstract":"  Investigating light bridges (LBs) helps us comprehend key aspects of\nsunspots. However, few studies have analyzed the properties of LBs in terms of\nthe geometric height, which is a more realistic perspective given the\ncorrugation of the solar atmosphere. We aim to shed light on LBs by studying\nthe variation in their physical properties with geometric height. We used the\nSICON code to infer the physical quantities in terms of the optical depth and\nthe Wilson depression values of three LBs hosted by a sunspot observed with\nHinode/SP in the Fe I 630 nm pair lines. We also used SIR inversions to\ncross-check the height variation of the field inclination in the LBs. In both\noutput sets, we performed linear interpolation to convert the physical\nparameters from optical depth into a geometric height scale in each pixel. We\nclassified each LB as filamentary, grainy, or umbral. They appear as ridges\nthat reach different maximum heights, with the umbral LB being the deepest.\nWhile the filamentary LB hosts a plasma inflow from the penumbra, the results\nfor the grainy LB are compatible with an injection of hot plasma through\nconvective cells of reduced field strength. Only a few positions reveal hints\nsuggesting a cusp-like magnetic canopy. Moreover, strong gradients in the\nmagnetic field strength and inclination usually exhibit enhanced electric\ncurrents, with the filamentary LB having remarkably strong currents that appear\nto be related to chromospheric events. The height stratification in filamentary\nand grainy LBs differ, indicating diverse mechanisms at work. Our results are\nin general incompatible with a magnetic canopy scenario, and further analysis\nis needed to confirm whether it exists along the entire LB or only at specific\nlocations. Furthermore, this work assesses the usefulness of SICON when\ndetermining the height stratification of solar structures.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}