{"id":"2408.10608","title":"Promoting Equality in Large Language Models: Identifying and Mitigating\n  the Implicit Bias based on Bayesian Theory","authors":"Yongxin Deng (1), Xihe Qiu (1), Xiaoyu Tan (2), Jing Pan (3), Chen Jue\n  (1), Zhijun Fang (4), Yinghui Xu (5), Wei Chu (2), Yuan Qi (5) ((1) Shanghai\n  University of Engineering Science, (2) INF Technology (Shanghai) Co., Ltd.,\n  (3) Monash University, (4) Donghua University, (5) Fudan University)","authorsParsed":[["Deng","Yongxin",""],["Qiu","Xihe",""],["Tan","Xiaoyu",""],["Pan","Jing",""],["Jue","Chen",""],["Fang","Zhijun",""],["Xu","Yinghui",""],["Chu","Wei",""],["Qi","Yuan",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 07:40:12 GMT"}],"updateDate":"2024-08-21","timestamp":1724139612000,"abstract":"  Large language models (LLMs) are trained on extensive text corpora, which\ninevitably include biased information. Although techniques such as Affective\nAlignment can mitigate some negative impacts of these biases, existing\nprompt-based attack methods can still extract these biases from the model's\nweights. Moreover, these biases frequently appear subtly when LLMs are prompted\nto perform identical tasks across different demographic groups, thereby\ncamouflaging their presence. To address this issue, we have formally defined\nthe implicit bias problem and developed an innovative framework for bias\nremoval based on Bayesian theory, Bayesian-Theory based Bias Removal (BTBR).\nBTBR employs likelihood ratio screening to pinpoint data entries within\npublicly accessible biased datasets that represent biases inadvertently\nincorporated during the LLM training phase. It then automatically constructs\nrelevant knowledge triples and expunges bias information from LLMs using model\nediting techniques. Through extensive experimentation, we have confirmed the\npresence of the implicit bias problem in LLMs and demonstrated the\neffectiveness of our BTBR approach.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}