{"id":"2408.01088","title":"Bridging Information Gaps in Dialogues With Grounded Exchanges Using\n  Knowledge Graphs","authors":"Phillip Schneider, Nektarios Machner, Kristiina Jokinen, Florian\n  Matthes","authorsParsed":[["Schneider","Phillip",""],["Machner","Nektarios",""],["Jokinen","Kristiina",""],["Matthes","Florian",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 08:07:15 GMT"},{"version":"v2","created":"Sun, 11 Aug 2024 17:51:21 GMT"}],"updateDate":"2024-08-13","timestamp":1722586035000,"abstract":"  Knowledge models are fundamental to dialogue systems for enabling\nconversational interactions, which require handling domain-specific knowledge.\nEnsuring effective communication in information-providing conversations entails\naligning user understanding with the knowledge available to the system.\nHowever, dialogue systems often face challenges arising from semantic\ninconsistencies in how information is expressed in natural language compared to\nhow it is represented within the system's internal knowledge. To address this\nproblem, we study the potential of large language models for conversational\ngrounding, a mechanism to bridge information gaps by establishing shared\nknowledge between dialogue participants. Our approach involves annotating human\nconversations across five knowledge domains to create a new dialogue corpus\ncalled BridgeKG. Through a series of experiments on this dataset, we\nempirically evaluate the capabilities of large language models in classifying\ngrounding acts and identifying grounded information items within a knowledge\ngraph structure. Our findings offer insights into how these models use\nin-context learning for conversational grounding tasks and common prediction\nerrors, which we illustrate with examples from challenging dialogues. We\ndiscuss how the models handle knowledge graphs as a semantic layer between\nunstructured dialogue utterances and structured information items.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}