{"id":"2408.16030","title":"A Deep Learning Approach to Localizing Multi-level Airway Collapse Based\n  on Snoring Sounds","authors":"Ying-Chieh Hsu, Stanley Yung-Chuan Liu, Chao-Jung Huang, Chi-Wei Wu,\n  Ren-Kai Cheng, Jane Yung-Jen Hsu, Shang-Ran Huang, Yuan-Ren Cheng, Fu-Shun\n  Hsu","authorsParsed":[["Hsu","Ying-Chieh",""],["Liu","Stanley Yung-Chuan",""],["Huang","Chao-Jung",""],["Wu","Chi-Wei",""],["Cheng","Ren-Kai",""],["Hsu","Jane Yung-Jen",""],["Huang","Shang-Ran",""],["Cheng","Yuan-Ren",""],["Hsu","Fu-Shun",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 09:30:20 GMT"}],"updateDate":"2024-08-30","timestamp":1724837420000,"abstract":"  This study investigates the application of machine/deep learning to classify\nsnoring sounds excited at different levels of the upper airway in patients with\nobstructive sleep apnea (OSA) using data from drug-induced sleep endoscopy\n(DISE). The snoring sounds of 39 subjects were analyzed and labeled according\nto the Velum, Oropharynx, Tongue Base, and Epiglottis (VOTE) classification\nsystem. The dataset, comprising 5,173 one-second segments, was used to train\nand test models, including Support Vector Machine (SVM), Bidirectional Long\nShort-Term Memory (BiLSTM), and ResNet-50. The ResNet-50, a convolutional\nneural network (CNN), showed the best overall performance in classifying\nsnoring acoustics, particularly in identifying multi-level obstructions. The\nstudy emphasizes the potential of integrating snoring acoustics with deep\nlearning to improve the diagnosis and treatment of OSA. However, challenges\nsuch as limited sample size, data imbalance, and differences between\npharmacologically induced and natural snoring sounds were noted, suggesting\nfurther research to enhance model accuracy and generalizability.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}