{"id":"2408.10876","title":"More Options for Prelabor Rupture of Membranes, A Bayesian Analysis","authors":"Ashley Klein, Edward Raff, Elisabeth Seamon, Lily Foley and Timothy\n  Bussert","authorsParsed":[["Klein","Ashley",""],["Raff","Edward",""],["Seamon","Elisabeth",""],["Foley","Lily",""],["Bussert","Timothy",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 14:05:25 GMT"}],"updateDate":"2024-08-21","timestamp":1724162725000,"abstract":"  An obstetric goal for a laboring mother is to achieve a vaginal delivery as\nit reduces the risks inherent in major abdominal surgery (i.e., a Cesarean\nsection). Various medical interventions may be used by a physician to increase\nthe likelihood of this occurring while minimizing maternal and fetal morbidity.\nHowever, patients with prelabor rupture of membranes (PROM) have only two\ncommonly used options for cervical ripening, Pitocin and misoprostol. Little\nresearch exists on the benefits/risks for these two key drugs for PROM\npatients. A major limitation with most induction-of-labor related research is\nthe inability to account for differences in \\textit{Bishop scores} that are\ncommonly used in obstetrical practice to determine the next induction agent\noffered to the patient. This creates a confounding factor, which biases the\nresults, but has not been realized in the literature. In this work, we use a\nBayesian model of the relationships between the relevant factors, informed by\nexpert physicians, to separate the confounding variable from its actual impact.\nIn doing so, we provide strong evidence that pitocin and buccal misoprostol are\nequally effective and safe; thus, physicians have more choice in clinical care\nthan previously realized. This is particularly important for developing\ncountries where neither medication may be readily available, and prior\nguidelines may create an artificial barrier to needed medication.\n","subjects":["Statistics/Applications","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}