{"id":"2408.15408","title":"Divergence-free neural operators for stress field modeling in\n  polycrystalline materials","authors":"Mohammad S. Khorrami, Pawan Goyal, Jaber R. Mianroodi, Bob Svendsen,\n  Peter Benner, Dierk Raabe","authorsParsed":[["Khorrami","Mohammad S.",""],["Goyal","Pawan",""],["Mianroodi","Jaber R.",""],["Svendsen","Bob",""],["Benner","Peter",""],["Raabe","Dierk",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 21:18:41 GMT"}],"updateDate":"2024-08-29","timestamp":1724793521000,"abstract":"  The purpose of the current work is the development and comparison of Fourier\nneural operators (FNOs) for surrogate modeling of the quasi-static mechanical\nresponse of polycrystalline materials. Three types of such FNOs are considered\nhere: a physics-guided FNO (PgFNO), a physics-informed FNO (PiFNO), and a\nphysics-encoded FNO (PeFNO). These are trained and compared with the help of\nstress field data from a reference model for heterogeneous elastic materials\nwith a periodic grain microstructure. Whereas PgFNO training is based solely on\nthese data, that of the PiFNO and PeFNO is in addition constrained by the\nrequirement that stress fields satisfy mechanical equilibrium, i.e., be\ndivergence-free. The difference between the PiFNO and PeFNO lies in how this\nconstraint is taken into account; in the PiFNO, it is included in the loss\nfunction, whereas in the PeFNO, it is \"encoded\" in the operator architecture.\nIn the current work, this encoding is based on a stress potential and Fourier\ntransforms. As a result, only the training of the PiFNO is constrained by\nmechanical equilibrium; in contrast, mechanical equilibrium constrains both the\ntraining and output of the PeFNO. Due in particular to this, stress fields\ncalculated by the trained PeFNO are significantly more accurate than those\ncalculated by the trained PiFNO in the example cases considered.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Condensed Matter/Materials Science","Computing Research Repository/Machine Learning","Mathematics/Analysis of PDEs"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}