{"id":"2408.01895","title":"Computational Trichromacy Reconstruction: Empowering the Color-Vision\n  Deficient to Recognize Colors Using Augmented Reality","authors":"Yuhao Zhu, Ethan Chen, Colin Hascup, Yukang Yan, Gaurav Charma","authorsParsed":[["Zhu","Yuhao",""],["Chen","Ethan",""],["Hascup","Colin",""],["Yan","Yukang",""],["Charma","Gaurav",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 01:34:22 GMT"}],"updateDate":"2024-08-06","timestamp":1722735262000,"abstract":"  We propose an assistive technology that helps individuals with Color Vision\nDeficiencies (CVD) to recognize/name colors. A dichromat's color perception is\na reduced two-dimensional (2D) subset of a normal trichromat's three\ndimensional color (3D) perception, leading to confusion when visual stimuli\nthat appear identical to the dichromat are referred to by different color\nnames. Using our proposed system, CVD individuals can interactively induce\ndistinct perceptual changes to originally confusing colors via a computational\ncolor space transformation. By combining their original 2D precepts for colors\nwith the discriminative changes, a three dimensional color space is\nreconstructed, where the dichromat can learn to resolve color name confusions\nand accurately recognize colors. Our system is implemented as an Augmented\nReality (AR) interface on smartphones, where users interactively control the\nrotation through swipe gestures and observe the induced color shifts in the\ncamera view or in a displayed image. Through psychophysical experiments and a\nlongitudinal user study, we demonstrate that such rotational color shifts have\ndiscriminative power (initially confusing colors become distinct under\nrotation) and exhibit structured perceptual shifts dichromats can learn with\nmodest training. The AR App is also evaluated in two real-world scenarios\n(building with lego blocks and interpreting artistic works); users all report\npositive experience in using the App to recognize object colors that they\notherwise could not.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"p9EvaP5OLkZ53mCSknAxCcaO6Do0wrMtb3ujRisDZ54","pdfSize":"21068643","txDigest":"H6n536ghon1FdS8wvRtdYqhidoDij4B8rn5hJMqFSjds","endEpoch":"1","status":"CERTIFIED"}
