{"id":"2408.07421","title":"A MAC Protocol with Time Reversal for Wireless Networks within Computing\n  Packages","authors":"Ama Bandara, Abhijit Das, F\\'atima Rodr\\'iguez-Gal\\'an, Eduard\n  Alarc\\'on, Sergi Abadal","authorsParsed":[["Bandara","Ama",""],["Das","Abhijit",""],["Rodríguez-Galán","Fátima",""],["Alarcón","Eduard",""],["Abadal","Sergi",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 09:59:45 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 20:28:09 GMT"}],"updateDate":"2024-09-17","timestamp":1723629585000,"abstract":"  Wireless Network-on-Chip (WNoC) is a promising concept which provides a\nsolution to overcome the scalability issues in prevailing networks-in-package\nfor many-core processors. However, the electromagnetic propagation inside the\nchip package leads to energy reverberation, resulting in Inter-Symbol\nInterference (ISI) with high delay spreads. Time Reversal (TR) is a technique\nthat benefits the unique time-invariant channel with rich multipath effects to\nfocus the energy to the desired transceiver. TR mitigates both ISI and\nco-channel interference, hence providing parallel communications in both space\nand time. Thus, TR is a versatile candidate to improve the aggregate bandwidth\nof wireless on-chip networks provided that a Medium Access Control (MAC) is\nused to efficiently share the wireless medium. In this paper, we explore a\nsimple yet resilient TR-based MAC protocol (TR-MAC) design for WNoC. We propose\nto manage multiple parallel transmissions with simultaneous spatial channels in\nthe same time slot with TR precoding and focused energy detection at the\ntransceiver. Our results show that TR-MAC can be employed in massive computing\narchitectures with improved latency and throughput while matching with the\nstringent requirements of the physical layer.\n","subjects":["Computing Research Repository/Emerging Technologies","Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/"}