{"id":"2408.01598","title":"Gas Accretion Traced by Blue-Dominated Ly{\\alpha} Emission and\n  Redshifted UV Absorption Lines in Protocluster Galaxies at z = 2.3 from the\n  KBSS-KCWI Survey","authors":"Claire Bolda, Zhihui Li, Dawn K. Erb, Charles C. Steidel, and Yuguang\n  Chen","authorsParsed":[["Bolda","Claire",""],["Li","Zhihui",""],["Erb","Dawn K.",""],["Steidel","Charles C.",""],["Chen","Yuguang",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 22:58:10 GMT"}],"updateDate":"2024-08-06","timestamp":1722639490000,"abstract":"  Ly{\\alpha} emission with a dominant blueshifted peak can probe gas flowing\nthrough the circumgalactic medium as it accretes onto galaxies and fuels new\nstar formation, although it has seldom actually been observed. Here we present\nnew Keck Cosmic Web Imager observations of the extended Ly{\\alpha} halos\nsurrounding Q1700-BX710 and Q1700-BX711, a pair of UV continuum-selected Keck\nBaryonic Structure Survey (KBSS) galaxies at z = 2.3 in the HS1700+643\nprotocluster. We find that BX710 and BX711's Ly{\\alpha} halos are aligned with\na large-scale galaxy filament consisting of thirteen spectroscopically\nidentified protocluster galaxies. By measuring the peak separation and\nblue-to-red peak flux ratio of the Ly{\\alpha} emission profiles throughout\nthese galaxies' Ly{\\alpha} halos, we have obtained measurements of their\nspatially varying velocity structure. The prevalence of blue-dominated\nLy{\\alpha} emission profiles throughout BX711's Ly{\\alpha} halo suggests\nactively accreting gas. We fit a clumpy, multiphase Monte Carlo Radiative\nTransfer model which assumes a radially varying clump velocity to the spatially\nresolved Ly{\\alpha} emission throughout BX710 and BX711's Ly{\\alpha} halos and\nsimultaneously fit these galaxies' average down-the-barrel UV absorption\nprofile with a radially varying velocity model. The results of these models are\nconsistent with a combination of HI and higher-metallicity gas accretion for\nboth galaxies, especially BX711, which exhibits inflow-driven kinematics\nthroughout most of its Ly{\\alpha} halo. We consider various accretion scenarios\nto explain these findings, including accretion of metal-enriched gas from the\ncosmic web, galaxy interactions, and recycled gas from the circumgalactic\nmedium, all of which are compatible with our current observations.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}