{"id":"2408.12395","title":"Maximal steered coherence in the background of Schwarzschild space-time","authors":"Ming-Ming Du, Hong-Wei Li, Shu-Ting Shen, Xiao-Jing Yan, Xi-Yun Li,\n  Lan Zhou, Wei Zhong, Yu-Bo Sheng","authorsParsed":[["Du","Ming-Ming",""],["Li","Hong-Wei",""],["Shen","Shu-Ting",""],["Yan","Xiao-Jing",""],["Li","Xi-Yun",""],["Zhou","Lan",""],["Zhong","Wei",""],["Sheng","Yu-Bo",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 13:40:33 GMT"}],"updateDate":"2024-08-23","timestamp":1724334033000,"abstract":"  In the past two decades, the exploration of quantumness within Schwarzschild\nspacetime has garnered significant interest, particularly regarding the Hawking\nradiation's impact on quantum correlations and quantum coherence. Building on\nthis foundation, we investigate how Hawking radiation influences maximal\nsteered coherence (MSC)-a crucial measure for gauging the ability to generate\ncoherence through steering. We find that as the Hawking temperature increases,\nthe physically accessible MSC degrade while the unaccessible MSC increase. This\nobservation is attributed to a redistribution of the initial quantum\ncorrelations, previously acknowledged by inertial observers, across all\nbipartite modes. In particular, we find that in limit case that the Hawking\ntemperature tends to infinity, the accessible MSC equals to 1/\\sqrt{2} of its\ninitial value, and the unaccessible MSC also equals to the same value. Our\nfindings illuminate the intricate dynamics of quantum information in the\nvicinity of black holes, suggesting that Hawking radiation plays a pivotal role\nin reshaping the landscape of quantum coherence and entanglement in curved\nspacetime. This study not only advances our theoretical understanding of black\nhole thermodynamics but also opens new avenues for investigating the interface\nbetween quantum mechanics and general relativity.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}