{"id":"2408.12813","title":"Minimizing Movement Delay for Movable Antennas via Trajectory\n  Optimization","authors":"Qingliang Li, Weidong Mei, Boyu Ning, and Rui Zhang","authorsParsed":[["Li","Qingliang",""],["Mei","Weidong",""],["Ning","Boyu",""],["Zhang","Rui",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 03:17:57 GMT"}],"updateDate":"2024-08-26","timestamp":1724383077000,"abstract":"  Movable antennas (MAs) have received increasing attention in wireless\ncommunications due to their capability of antenna position adjustment to\nreconfigure wireless channels. However, moving MAs results in non-negligible\ndelay, which may decrease the effective data transmission time. To reduce the\nmovement delay, we study in this paper a new MA trajectory optimization\nproblem. In particular, given the desired destination positions of multiple\nMAs, we aim to jointly optimize their associations with the initial MA\npositions and the trajectories for moving them from their respective initial to\ndestination positions within a given two-dimensional (2D) region, such that the\ndelay of antenna movement is minimized, subject to the inter-MA minimum\ndistance constraints in the movement. However, this problem is a\ncontinuous-time mixed-integer linear programming (MILP) problem that is\nchallenging to solve. To tackle this challenge, we propose a two-stage\noptimization framework that sequentially optimizes the MAs' position\nassociations and trajectories, respectively. First, we relax the inter-MA\ndistance constraints and optimally solve the resulted delay minimization\nproblem. Next, we check if the obtained MA association and trajectory solutions\nsatisfy the inter-MA distance constraints. If not satisfied, we then employ a\nsuccessive convex approximation (SCA) algorithm to adjust the MAs' trajectories\nuntil they satisfy the given constraints. Simulation results are provided to\nshow the effectiveness of our proposed trajectory optimization method in\nreducing the movement delay as well as draw useful insights.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}