{"id":"2408.15327","title":"Evidence for a Fast Soft X-ray Wind in M82 from XMM-RGS","authors":"Erin Boettcher and Edmund Hodges-Kluck","authorsParsed":[["Boettcher","Erin",""],["Hodges-Kluck","Edmund",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 18:00:02 GMT"}],"updateDate":"2024-08-29","timestamp":1724781602000,"abstract":"  Starburst wind models predict that metals and energy are primarily carried\nout of the disk by hot gas ($T > 10^{6}$ K), but the low energy resolution of\nX-ray CCD observations results in large uncertainties on the mass and energy\nloading. Here, we present evidence for a fast soft X-ray wind from the\nprototypical starburst galaxy M82 using deep archival observations from the\nReflection Grating Spectrometer on XMM-Newton. After characterizing the complex\nline-spread function for the spatially extended outflow ($\\approx 4'$), we\nperform emission-line fitting to measure the velocity dispersion,\n$\\sigma_{\\text{v}}$, from OVIII (0.65, 0.77 keV), NeX (1.02 keV), and MgXII\n(1.47 keV). For the $T \\approx 3 \\times 10^{6}$ K gas, OVIII yields a velocity\ndispersion of $\\sigma_{\\text{v}} = 1160^{+100}_{-90}$ km s$^{-1}$, implying a\nwind speed that is significantly above the escape velocity ($v_{\\text{esc}}\n\\lesssim 450$ km s$^{-1}$). NeX ($\\sigma_{\\text{v}} = 550^{+130}_{-150}$ km\ns$^{-1}$) and MgXII ($\\sigma_{\\text{v}} < 370$ km s$^{-1}$) show less velocity\nbroadening than OVIII, hinting at a lower wind speed or smaller opening angle\non the more compact spatial scales traced by the $T \\approx (0.6 - 1) \\times\n10^{7}$ K gas. Alternatively, these higher energy emission lines may be\ndominated by shock-heated gas in the interstellar medium. Future synthesis of\nthese measurements with Performance Verification observations of the $E = 2 -\n12$ keV wind in M82 from the Resolve microcalorimeter on the X-ray Imaging and\nSpectroscopy Mission will inform the phase structure and energy budget of the\nhot starburst wind.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}