{"id":"2408.16343","title":"Toward Robust Early Detection of Alzheimer's Disease via an Integrated\n  Multimodal Learning Approach","authors":"Yifei Chen, Shenghao Zhu, Zhaojie Fang, Chang Liu, Binfeng Zou, Yuhe\n  Wang, Shuo Chang, Fan Jia, Feiwei Qin, Jin Fan, Yong Peng, Changmiao Wang","authorsParsed":[["Chen","Yifei",""],["Zhu","Shenghao",""],["Fang","Zhaojie",""],["Liu","Chang",""],["Zou","Binfeng",""],["Wang","Yuhe",""],["Chang","Shuo",""],["Jia","Fan",""],["Qin","Feiwei",""],["Fan","Jin",""],["Peng","Yong",""],["Wang","Changmiao",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 08:26:00 GMT"}],"updateDate":"2024-08-30","timestamp":1724919960000,"abstract":"  Alzheimer's Disease (AD) is a complex neurodegenerative disorder marked by\nmemory loss, executive dysfunction, and personality changes. Early diagnosis is\nchallenging due to subtle symptoms and varied presentations, often leading to\nmisdiagnosis with traditional unimodal diagnostic methods due to their limited\nscope. This study introduces an advanced multimodal classification model that\nintegrates clinical, cognitive, neuroimaging, and EEG data to enhance\ndiagnostic accuracy. The model incorporates a feature tagger with a tabular\ndata coding architecture and utilizes the TimesBlock module to capture\nintricate temporal patterns in Electroencephalograms (EEG) data. By employing\nCross-modal Attention Aggregation module, the model effectively fuses Magnetic\nResonance Imaging (MRI) spatial information with EEG temporal data,\nsignificantly improving the distinction between AD, Mild Cognitive Impairment,\nand Normal Cognition. Simultaneously, we have constructed the first AD\nclassification dataset that includes three modalities: EEG, MRI, and tabular\ndata. Our innovative approach aims to facilitate early diagnosis and\nintervention, potentially slowing the progression of AD. The source code and\nour private ADMC dataset are available at https://github.com/JustlfC03/MSTNet.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}