{"id":"2408.00677","title":"Scaling Backwards: Minimal Synthetic Pre-training?","authors":"Ryo Nakamura, Ryu Tadokoro, Ryosuke Yamada, Yuki M. Asano, Iro Laina,\n  Christian Rupprecht, Nakamasa Inoue, Rio Yokota, Hirokatsu Kataoka","authorsParsed":[["Nakamura","Ryo",""],["Tadokoro","Ryu",""],["Yamada","Ryosuke",""],["Asano","Yuki M.",""],["Laina","Iro",""],["Rupprecht","Christian",""],["Inoue","Nakamasa",""],["Yokota","Rio",""],["Kataoka","Hirokatsu",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 16:20:02 GMT"},{"version":"v2","created":"Sat, 3 Aug 2024 04:29:58 GMT"}],"updateDate":"2024-08-06","timestamp":1722529202000,"abstract":"  Pre-training and transfer learning are an important building block of current\ncomputer vision systems. While pre-training is usually performed on large\nreal-world image datasets, in this paper we ask whether this is truly\nnecessary. To this end, we search for a minimal, purely synthetic pre-training\ndataset that allows us to achieve performance similar to the 1 million images\nof ImageNet-1k. We construct such a dataset from a single fractal with\nperturbations. With this, we contribute three main findings. (i) We show that\npre-training is effective even with minimal synthetic images, with performance\non par with large-scale pre-training datasets like ImageNet-1k for full\nfine-tuning. (ii) We investigate the single parameter with which we construct\nartificial categories for our dataset. We find that while the shape differences\ncan be indistinguishable to humans, they are crucial for obtaining strong\nperformances. (iii) Finally, we investigate the minimal requirements for\nsuccessful pre-training. Surprisingly, we find that a substantial reduction of\nsynthetic images from 1k to 1 can even lead to an increase in pre-training\nperformance, a motivation to further investigate ''scaling backwards''.\nFinally, we extend our method from synthetic images to real images to see if a\nsingle real image can show similar pre-training effect through shape\naugmentation. We find that the use of grayscale images and affine\ntransformations allows even real images to ''scale backwards''.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}