{"id":"2408.03558","title":"D2Styler: Advancing Arbitrary Style Transfer with Discrete Diffusion\n  Methods","authors":"Onkar Susladkar, Gayatri Deshmukh, Sparsh Mittal, Parth Shastri","authorsParsed":[["Susladkar","Onkar",""],["Deshmukh","Gayatri",""],["Mittal","Sparsh",""],["Shastri","Parth",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 05:47:06 GMT"}],"updateDate":"2024-08-08","timestamp":1723009626000,"abstract":"  In image processing, one of the most challenging tasks is to render an\nimage's semantic meaning using a variety of artistic approaches. Existing\ntechniques for arbitrary style transfer (AST) frequently experience\nmode-collapse, over-stylization, or under-stylization due to a disparity\nbetween the style and content images. We propose a novel framework called\nD$^2$Styler (Discrete Diffusion Styler) that leverages the discrete\nrepresentational capability of VQ-GANs and the advantages of discrete\ndiffusion, including stable training and avoidance of mode collapse. Our method\nuses Adaptive Instance Normalization (AdaIN) features as a context guide for\nthe reverse diffusion process. This makes it easy to move features from the\nstyle image to the content image without bias. The proposed method\nsubstantially enhances the visual quality of style-transferred images, allowing\nthe combination of content and style in a visually appealing manner. We take\nstyle images from the WikiArt dataset and content images from the COCO dataset.\nExperimental results demonstrate that D$^2$Styler produces high-quality\nstyle-transferred images and outperforms twelve existing methods on nearly all\nthe metrics. The qualitative results and ablation studies provide further\ninsights into the efficacy of our technique. The code is available at\nhttps://github.com/Onkarsus13/D2Styler.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"oRunu8JTU4GA-vycoYboAxsvTF3xJCPy2ZLqvA-xf7c","pdfSize":"17060033"}
