{"id":"2408.14284","title":"May the Forgetting Be with You: Alternate Replay for Learning with Noisy\n  Labels","authors":"Monica Millunzi and Lorenzo Bonicelli and Angelo Porrello and Jacopo\n  Credi and Petter N. Kolm and Simone Calderara","authorsParsed":[["Millunzi","Monica",""],["Bonicelli","Lorenzo",""],["Porrello","Angelo",""],["Credi","Jacopo",""],["Kolm","Petter N.",""],["Calderara","Simone",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 14:09:40 GMT"}],"updateDate":"2024-08-27","timestamp":1724681380000,"abstract":"  Forgetting presents a significant challenge during incremental training,\nmaking it particularly demanding for contemporary AI systems to assimilate new\nknowledge in streaming data environments. To address this issue, most\napproaches in Continual Learning (CL) rely on the replay of a restricted buffer\nof past data. However, the presence of noise in real-world scenarios, where\nhuman annotation is constrained by time limitations or where data is\nautomatically gathered from the web, frequently renders these strategies\nvulnerable. In this study, we address the problem of CL under Noisy Labels\n(CLN) by introducing Alternate Experience Replay (AER), which takes advantage\nof forgetting to maintain a clear distinction between clean, complex, and noisy\nsamples in the memory buffer. The idea is that complex or mislabeled examples,\nwhich hardly fit the previously learned data distribution, are most likely to\nbe forgotten. To grasp the benefits of such a separation, we equip AER with\nAsymmetric Balanced Sampling (ABS): a new sample selection strategy that\nprioritizes purity on the current task while retaining relevant samples from\nthe past. Through extensive computational comparisons, we demonstrate the\neffectiveness of our approach in terms of both accuracy and purity of the\nobtained buffer, resulting in a remarkable average gain of 4.71% points in\naccuracy with respect to existing loss-based purification strategies. Code is\navailable at https://github.com/aimagelab/mammoth.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}