{"id":"2408.14844","title":"Impact of biased cooling on the operation of undoped silicon quantum\n  well field-effect devices for quantum circuit applications","authors":"Laura K. Diebel, Lukas G. Zinkl, Andreas H\\\"otzinger, Felix Reichmann,\n  Marco Lisker, Yuji Yamamoto, and Dominique Bougeard","authorsParsed":[["Diebel","Laura K.",""],["Zinkl","Lukas G.",""],["Hötzinger","Andreas",""],["Reichmann","Felix",""],["Lisker","Marco",""],["Yamamoto","Yuji",""],["Bougeard","Dominique",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 07:55:32 GMT"}],"updateDate":"2024-08-28","timestamp":1724745332000,"abstract":"  Gate-tunable semiconductor nanosystems are getting more and more important in\nthe realization of quantum circuits. While such devices are typically cooled to\noperation temperature with zero bias applied to the gate, biased cooling\ncorresponds to a non-zero gate voltage being applied before reaching the\noperation temperature. We systematically study the effect of biased cooling on\ndifferent undoped SiGe/Si/SiGe quantum well field-effect stacks (FESs),\ndesigned to accumulate and density-tune two-dimensional electron gases (2DEGs).\nIn an empirical model, we show that biased cooling of the undoped FES induces a\nstatic electric field, which is constant at operation temperature and\nsuperimposes onto the field exerted by the top gate onto the 2DEG. We show that\nthe voltage operation window of the field-effect-tuned 2DEG can be chosen in a\nwide range of voltages via the choice of the biased cooling voltage.\nImportantly, quality features of the 2DEG such as the mobility or the temporal\nstability of the 2DEG density remain unaltered under biased cooling. We discuss\nhow this additional degree of freedom in the tunability of FESs may be relevant\nfor the operation of quantum circuits, in particular for the electrostatic\ncontrol of spin qubits.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}