{"id":"2408.06658","title":"ComGPT: Detecting Local Community Structure with Large Language Models","authors":"Li Ni, Haowen Shen, Lin Mu, Yiwen Zhang, Wenjian Luo","authorsParsed":[["Ni","Li",""],["Shen","Haowen",""],["Mu","Lin",""],["Zhang","Yiwen",""],["Luo","Wenjian",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 06:15:43 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 02:59:36 GMT"}],"updateDate":"2024-09-16","timestamp":1723529743000,"abstract":"  Large Language Models (LLMs), like GPT, have demonstrated the ability to\nunderstand graph structures and have achieved excellent performance in various\ngraph reasoning tasks, such as node classification. Despite their strong\nabilities in graph reasoning tasks, they lack specific domain knowledge and\nhave a weaker understanding of community-related graph information, which\nhinders their capabilities in the community detection task. Moreover, local\ncommunity detection algorithms based on seed expansion, referred to as seed\nexpansion algorithms, often face the seed-dependent problem, community\ndiffusion, and free rider effect. To use LLMs to overcome the above\nshortcomings, we explore a GPT-guided seed expansion algorithm named ComGPT.\nComGPT iteratively selects potential nodes by local modularity M from the\ndetected community's neighbors, and subsequently employs LLMs to choose the\nnode to join the detected community from these selected potential nodes. To\naddress the above issues faced by LLMs, we improve graph encoding method,\ncalled Incident, by incorporating community knowledge to improve LLMs's\nunderstanding of community-related graph information. Additionally, we design\nthe NSG (Node Selection Guide) prompt to enhance LLMs' understanding of\ncommunity characteristics. Experimental results demonstrate that ComGPT\noutperforms the comparison methods, thereby confirming the effectiveness of the\nimproved graph encoding method and prompts.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}