{"id":"2408.12097","title":"Extraction of Research Objectives, Machine Learning Model Names, and\n  Dataset Names from Academic Papers and Analysis of Their Interrelationships\n  Using LLM and Network Analysis","authors":"S. Nishio, H. Nonaka, N. Tsuchiya, A. Migita, Y. Banno, T. Hayashi, H.\n  Sakaji, T. Sakumoto, K. Watabe","authorsParsed":[["Nishio","S.",""],["Nonaka","H.",""],["Tsuchiya","N.",""],["Migita","A.",""],["Banno","Y.",""],["Hayashi","T.",""],["Sakaji","H.",""],["Sakumoto","T.",""],["Watabe","K.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 03:10:52 GMT"}],"updateDate":"2024-08-23","timestamp":1724296252000,"abstract":"  Machine learning is widely utilized across various industries. Identifying\nthe appropriate machine learning models and datasets for specific tasks is\ncrucial for the effective industrial application of machine learning. However,\nthis requires expertise in both machine learning and the relevant domain,\nleading to a high learning cost. Therefore, research focused on extracting\ncombinations of tasks, machine learning models, and datasets from academic\npapers is critically important, as it can facilitate the automatic\nrecommendation of suitable methods. Conventional information extraction methods\nfrom academic papers have been limited to identifying machine learning models\nand other entities as named entities. To address this issue, this study\nproposes a methodology extracting tasks, machine learning methods, and dataset\nnames from scientific papers and analyzing the relationships between these\ninformation by using LLM, embedding model, and network clustering. The proposed\nmethod's expression extraction performance, when using Llama3, achieves an\nF-score exceeding 0.8 across various categories, confirming its practical\nutility. Benchmarking results on financial domain papers have demonstrated the\neffectiveness of this method, providing insights into the use of the latest\ndatasets, including those related to ESG (Environmental, Social, and\nGovernance) data.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FAxWWOB1-2bEDbdE9SwtxxMsju2yhE68KVKblFeNC7U","pdfSize":"645480"}
