{"id":"2408.02023","title":"A Smart City Infrastructure Ontology for Threats, Cybercrime, and\n  Digital Forensic Investigation","authors":"Yee Ching Tok, Davis Zheng Yang, Sudipta Chattopadhyay","authorsParsed":[["Tok","Yee Ching",""],["Yang","Davis Zheng",""],["Chattopadhyay","Sudipta",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 13:20:01 GMT"}],"updateDate":"2024-08-06","timestamp":1722777601000,"abstract":"  Cybercrime and the market for cyber-related compromises are becoming\nattractive revenue sources for state-sponsored actors, cybercriminals and\ntechnical individuals affected by financial hardships. Due to burgeoning\ncybercrime on new technological frontiers, efforts have been made to assist\ndigital forensic investigators (DFI) and law enforcement agencies (LEA) in\ntheir investigative efforts.\n  Forensic tool innovations and ontology developments, such as the Unified\nCyber Ontology (UCO) and Cyber-investigation Analysis Standard Expression\n(CASE), have been proposed to assist DFI and LEA. Although these tools and\nontologies are useful, they lack extensive information sharing and tool\ninteroperability features, and the ontologies lack the latest Smart City\nInfrastructure (SCI) context that was proposed.\n  To mitigate the weaknesses in both solutions and to ensure a safer\ncyber-physical environment for all, we propose the Smart City Ontological\nParadigm Expression (SCOPE), an expansion profile of the UCO and CASE ontology\nthat implements SCI threat models, SCI digital forensic evidence, attack\ntechniques, patterns and classifications from MITRE.\n  We showcase how SCOPE could present complex data such as SCI-specific\nthreats, cybercrime, investigation data and incident handling workflows via an\nincident scenario modelled after publicly reported real-world incidents\nattributed to Advanced Persistent Threat (APT) groups. We also make SCOPE\navailable to the community so that threats, digital evidence and cybercrime in\nemerging trends such as SCI can be identified, represented, and shared\ncollaboratively.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"4zY3Oeorcqf9db-Wp9reAs2n30Q_EQBKinggvhQNBls","pdfSize":"669997","txDigest":"2gWLbBrV9V4fyLREyeF7XcQoU4fQ288EEC7nvcy9P6U8","endEpoch":"1","status":"CERTIFIED"}
