{"id":"2408.10706","title":"Performance Analysis of Physical Layer Security: From Far-Field to\n  Near-Field","authors":"Boqun Zhao, Chongjun Ouyang, Xingqi Zhang and Yuanwei Liu","authorsParsed":[["Zhao","Boqun",""],["Ouyang","Chongjun",""],["Zhang","Xingqi",""],["Liu","Yuanwei",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 10:06:01 GMT"}],"updateDate":"2024-08-21","timestamp":1724148361000,"abstract":"  The secrecy performance in both near-field and far-field communications is\nanalyzed using two fundamental metrics: the secrecy capacity under a power\nconstraint and the minimum power requirement to achieve a specified secrecy\nrate target. 1) For the secrecy capacity, a closed-form expression is derived\nunder a discrete-time memoryless setup. This expression is further analyzed\nunder several far-field and near-field channel models, and the capacity scaling\nlaw is revealed by assuming an infinitely large transmit array and an\ninfinitely high power. A novel concept of \"depth of insecurity\" is proposed to\nevaluate the secrecy performance achieved by near-field beamfocusing. It is\ndemonstrated that increasing the number of transmit antennas reduces this depth\nand thus improves the secrecy performance. 2) Regarding the minimum required\npower, a closed-form expression is derived and analyzed within far-field and\nnear-field scenarios. Asymptotic analyses are performed by setting the number\nof transmit antennas to infinity to unveil the power scaling law. Numerical\nresults are provided to demonstrate that: i) compared to far-field\ncommunications, near-field communications expand the areas where secure\ntransmission is feasible, specifically when the eavesdropper is located in the\nsame direction as the intended receiver; ii) as the number of transmit antennas\nincreases, neither the secrecy capacity nor the minimum required power scales\nor vanishes unboundedly, adhering to the principle of energy conservation.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}