{"id":"2408.14906","title":"Writing in the Margins: Better Inference Pattern for Long Context\n  Retrieval","authors":"Melisa Russak, Umar Jamil, Christopher Bryant, Kiran Kamble, Axel\n  Magnuson, Mateusz Russak, Waseem AlShikh","authorsParsed":[["Russak","Melisa",""],["Jamil","Umar",""],["Bryant","Christopher",""],["Kamble","Kiran",""],["Magnuson","Axel",""],["Russak","Mateusz",""],["AlShikh","Waseem",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 09:34:38 GMT"}],"updateDate":"2024-08-28","timestamp":1724751278000,"abstract":"  In this paper, we introduce Writing in the Margins (WiM), a new inference\npattern for Large Language Models designed to optimize the handling of long\ninput sequences in retrieval-oriented tasks. This approach leverages the\nchunked prefill of the key-value cache to perform segment-wise inference, which\nenables efficient processing of extensive contexts along with the generation\nand classification of intermediate information (\"margins\") that guide the model\ntowards specific tasks. This method increases computational overhead marginally\nwhile significantly enhancing the performance of off-the-shelf models without\nthe need for fine-tuning. Specifically, we observe that WiM provides an average\nenhancement of 7.5% in accuracy for reasoning skills (HotpotQA, MultiHop-RAG)\nand more than a 30.0% increase in the F1-score for aggregation tasks (CWE).\nAdditionally, we show how the proposed pattern fits into an interactive\nretrieval design that provides end-users with ongoing updates about the\nprogress of context processing, and pinpoints the integration of relevant\ninformation into the final response. We release our implementation of WiM using\nHugging Face Transformers library at\nhttps://github.com/writer/writing-in-the-margins.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7TAFkS__MAjJaujuWeL3wpn8WZJwLzOQZ7hfcpSrfX0","pdfSize":"1217832"}
