{"id":"2408.06308","title":"Dynamic Traffic Assignment for Public Transport with Vehicle Capacities","authors":"Julian Patzner and Matthias M\\\"uller-Hannemann","authorsParsed":[["Patzner","Julian",""],["Müller-Hannemann","Matthias",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 17:22:15 GMT"}],"updateDate":"2024-08-13","timestamp":1723483335000,"abstract":"  Traffic assignment is a core component of many urban transport planning\ntools. It is used to determine how traffic is distributed over a transportation\nnetwork. We study the task of computing traffic assignments for public\ntransport: Given a public transit network, a timetable, vehicle capacities and\na demand (i.e. a list of passengers, each with an associated origin,\ndestination, and departure time), the goal is to predict the resulting\npassenger flow and the corresponding load of each vehicle. Microscopic\nstochastic simulation of individual passengers is a standard, but\ncomputationally expensive approach. Briem et al. (2017) have shown that a\nclever adaptation of the Connection Scan Algorithm (CSA) can lead to highly\nefficient traffic assignment algorithms, but ignores vehicle capacities,\nresulting in overcrowded vehicles. Taking their work as a starting point, we\nhere propose a new and extended model that guarantees capacity-feasible\nassignments and incorporates dynamic network congestion effects such as crowded\nvehicles, denied boarding, and dwell time delays. Moreover, we also incorporate\nlearning and adaptation of individual passengers based on their experience with\nthe network. Applications include studying the evolution of perceived travel\ntimes as a result of adaptation, the impact of an increase in capacity, or\nnetwork effects due to changes in the timetable such as the addition or the\nremoval of a service or a whole line. The proposed framework has been\nexperimentally evaluated with public transport networks of G\\\"ottingen and\nStuttgart (Germany). The simulation proves to be highly efficient. On a\nstandard PC the computation of a traffic assignment takes just a few seconds\nper simulation day.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Discrete Mathematics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tWEKiybmrV4rroJcMVWtMeFVN7L0qWmo-ikX-A7EXVo","pdfSize":"1882550"}
