{"id":"2408.01793","title":"Self-similarity in partial differential equations and critical\n  phenomena: renormalization group theory for interfacial hydrodynamics","authors":"Ikumi Yoshino and Ko Okumura","authorsParsed":[["Yoshino","Ikumi",""],["Okumura","Ko",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 14:18:06 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 06:56:13 GMT"},{"version":"v3","created":"Sat, 17 Aug 2024 01:52:42 GMT"},{"version":"v4","created":"Tue, 10 Sep 2024 05:57:41 GMT"}],"updateDate":"2024-09-11","timestamp":1722694686000,"abstract":"  Self-similar dynamics, often described by partial differential equations\n(PDEs) without noise terms, have been widely observed in nature and have\nattracted considerable attention from researchers in various fields, including\nphysics, fluid mechanics, applied mathematics, and chemical engineering. The\nconcept of universality class and the renormalization group (RG) theory,\nemerged from critical phenomena, which also have been widely observed in\nnature, are pillars of modern physics, with guiding the recent development of\nphysics. While self-similarity appearing in fluid dynamics reminds physicists\nof critical phenomena, deep connections between them have not been explored.\nHere, we focus on a variation of a daily phenomenon, a drop falling from a\nfaucet, and demonstrate self-similar dynamics for the shape of liquid-air\ninterface in confined space with a scaling law for a characteristic length\nscale, which leads to a clear correspondence between the present self-similar\ndynamics and critical phenomena by identifying critical exponents, which define\na universality class. We not only show that the observed master curve\ndescribing the self-similar shape is a solution to the Navier-Stokes equations,\nbut also develop a renormalization group (RG) theory for the governing PDE to\nshow the fixed point of RG corresponds to the solution, which becomes stable\nwith time due to a scaling crossover. Our results will impact on our\nunderstanding of critical, scaling, and singular behaviors widely observed in\nnature.\n","subjects":["Condensed Matter/Statistical Mechanics","Condensed Matter/Soft Condensed Matter","Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}