{"id":"2408.00683","title":"Hydrological collapse in southern Spain under expanding irrigated\n  agriculture: Meteorological, hydrological, and structural drought","authors":"Victoria Junquera, Daniel I. Rubenstein, Simon A. Levin, Jos\\'e I.\n  Hormaza, I\\~naki Vadillo P\\'erez, and Pablo Jim\\'enez Gavil\\'an","authorsParsed":[["Junquera","Victoria",""],["Rubenstein","Daniel I.",""],["Levin","Simon A.",""],["Hormaza","José I.",""],["Pérez","Iñaki Vadillo",""],["Gavilán","Pablo Jiménez",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 16:25:02 GMT"}],"updateDate":"2024-08-02","timestamp":1722529502000,"abstract":"  Spain is the largest producer of avocado and mango fruits in Europe. The\nmajority of production is concentrated in the Axarqu\\'ia region in the south,\nwhere subtropical fruit plantations and associated water demands have steadily\nincreased over the last two decades. Between 2019-2024, the region underwent an\nextreme water crisis. Reservoir reserves became nearly depleted and groundwater\nlevels dropped to sea level in several locations, where seawater intrusion is\nlikely, causing large socioeconomic impacts including short-term harvest losses\nand a long-term loss in economic centrality. We examine the causal pathway that\nled to this crisis using a mixed-methods approach, combining data from key\ninformant interviews, an exhaustive review of legal documents, and quantitative\nanalysis of time series and spatially explicit data. In particular, we analyze\ndam water use for irrigation and urban use, meteorological data, reservoir and\ngroundwater levels, and irrigation land cover maps. Our findings show that an\nunusual meteorological drought was the immediate cause for the decline in\nreservoir and groundwater reserves (hydrological drought), but the underlying\ncause was a chronic and structural long-term imbalance between water demand and\nresources resulting from several structural governance shortcomings: large\nuncertainties in water resource availability and use hampering effective\nplanning, lack of enforcement of individual water quotas, and the absence of\nregulatory mechanisms to flexibly impose resource use restrictions at both\nmicro and macro levels based on the overall resources of the system. We propose\nconcrete policy interventions aimed at sustainably enhancing the resilience of\nthe system that can be useful to efficiently manage water shortages in other\nregions with similar problems.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"NzKlLKD7GUvn9P4FBrOivGim0hxDxrNbMpTg_ZOYC3Q","pdfSize":"1312826"}
