{"id":"2408.01664","title":"SAT3D: Image-driven Semantic Attribute Transfer in 3D","authors":"Zhijun Zhai, Zengmao Wang, Xiaoxiao Long, Kaixuan Zhou, and Bo Du","authorsParsed":[["Zhai","Zhijun",""],["Wang","Zengmao",""],["Long","Xiaoxiao",""],["Zhou","Kaixuan",""],["Du","Bo",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 04:41:46 GMT"}],"updateDate":"2024-08-06","timestamp":1722660106000,"abstract":"  GAN-based image editing task aims at manipulating image attributes in the\nlatent space of generative models. Most of the previous 2D and 3D-aware\napproaches mainly focus on editing attributes in images with ambiguous\nsemantics or regions from a reference image, which fail to achieve photographic\nsemantic attribute transfer, such as the beard from a photo of a man. In this\npaper, we propose an image-driven Semantic Attribute Transfer method in 3D\n(SAT3D) by editing semantic attributes from a reference image. For the proposed\nmethod, the exploration is conducted in the style space of a pre-trained\n3D-aware StyleGAN-based generator by learning the correlations between semantic\nattributes and style code channels. For guidance, we associate each attribute\nwith a set of phrase-based descriptor groups, and develop a Quantitative\nMeasurement Module (QMM) to quantitatively describe the attribute\ncharacteristics in images based on descriptor groups, which leverages the\nimage-text comprehension capability of CLIP. During the training process, the\nQMM is incorporated into attribute losses to calculate attribute similarity\nbetween images, guiding target semantic transferring and irrelevant semantics\npreserving. We present our 3D-aware attribute transfer results across multiple\ndomains and also conduct comparisons with classical 2D image editing methods,\ndemonstrating the effectiveness and customizability of our SAT3D.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"s08u7Ir7e5apJ8ed80hJACww4LbKerjSet9K4qREGag","pdfSize":"46851229"}
