{"id":"2408.07608","title":"MatterGPT: A Generative Transformer for Multi-Property Inverse Design of\n  Solid-State Materials","authors":"Yan Chen, Xueru Wang, Xiaobin Deng, Yilun Liu, Xi Chen, Yunwei Zhang,\n  Lei Wang, Hang Xiao","authorsParsed":[["Chen","Yan",""],["Wang","Xueru",""],["Deng","Xiaobin",""],["Liu","Yilun",""],["Chen","Xi",""],["Zhang","Yunwei",""],["Wang","Lei",""],["Xiao","Hang",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 15:12:05 GMT"}],"updateDate":"2024-08-15","timestamp":1723648325000,"abstract":"  Inverse design of solid-state materials with desired properties represents a\nformidable challenge in materials science. Although recent generative models\nhave demonstrated potential, their adoption has been hindered by limitations\nsuch as inefficiency, architectural constraints and restricted open-source\navailability. The representation of crystal structures using the SLICES\n(Simplified Line-Input Crystal-Encoding System) notation as a string of\ncharacters enables the use of state-of-the-art natural language processing\nmodels, such as Transformers, for crystal design. Drawing inspiration from the\nsuccess of GPT models in generating coherent text, we trained a generative\nTransformer on the next-token prediction task to generate solid-state materials\nwith targeted properties. We demonstrate MatterGPT's capability to generate de\nnovo crystal structures with targeted single properties, including both\nlattice-insensitive (formation energy) and lattice-sensitive (band gap)\nproperties. Furthermore, we extend MatterGPT to simultaneously target multiple\nproperties, addressing the complex challenge of multi-objective inverse design\nof crystals. Our approach showcases high validity, uniqueness, and novelty in\ngenerated structures, as well as the ability to generate materials with\nproperties beyond the training data distribution. This work represents a\nsignificant step forward in computational materials discovery, offering a\npowerful and open tool for designing materials with tailored properties for\nvarious applications in energy, electronics, and beyond.\n","subjects":["Condensed Matter/Materials Science","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}