{"id":"2408.05776","title":"Convergence of Symbiotic Communications and Blockchain for Sustainable\n  and Trustworthy 6G Wireless Networks","authors":"Haoxiang Luo, Gang Sun, Cheng Chi, Hongfang Yu, Mohsen Guizani","authorsParsed":[["Luo","Haoxiang",""],["Sun","Gang",""],["Chi","Cheng",""],["Yu","Hongfang",""],["Guizani","Mohsen",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 14:00:39 GMT"}],"updateDate":"2024-08-13","timestamp":1723384839000,"abstract":"  Symbiotic communication (SC) is known as a new wireless communication\nparadigm, similar to the natural ecosystem population, and can enable multiple\ncommunication systems to cooperate and mutualize through service exchange and\nresource sharing. As a result, SC is seen as an important potential technology\nfor future sixth-generation (6G) communications, solving the problem of lack of\nspectrum resources and energy inefficiency. Symbiotic relationships among\ncommunication systems can complement radio resources in 6G. However, the\nabsence of established trust relationships among diverse communication systems\npresents a formidable hurdle in ensuring efficient and trusted resource and\nservice exchange within SC frameworks. To better realize trusted SC services in\n6G, in this paper, we propose a solution that converges SC and blockchain,\ncalled a symbiotic blockchain network (SBN). Specifically, we first use\ncognitive backscatter communication to transform blockchain consensus, that is,\nthe symbiotic blockchain consensus (SBC), so that it can be better suited for\nthe wireless network. Then, for SBC, we propose a highly energy-efficient\nsharding scheme to meet the extremely low power consumption requirements in 6G.\nFinally, such a blockchain scheme guarantees trusted transactions of\ncommunication services in SC. Through ablation experiments, our proposed SBN\ndemonstrates significant efficacy in mitigating energy consumption and reducing\nprocessing latency in adversarial networks, which is expected to achieve a\nsustainable and trusted 6G wireless network.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}