{"id":"2408.06275","title":"Robust Instance Optimal Phase-Only Compressed Sensing","authors":"Junren Chen, Zhaoqiang Liu, Michael K. Ng, Jonathan Scarlett","authorsParsed":[["Chen","Junren",""],["Liu","Zhaoqiang",""],["Ng","Michael K.",""],["Scarlett","Jonathan",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 16:37:48 GMT"}],"updateDate":"2024-08-13","timestamp":1723480668000,"abstract":"  Phase-only compressed sensing (PO-CS) is concerned with the recovery of\nstructured signals from the phases of complex measurements. Recent results show\nthat structured signals in the standard sphere $\\mathbb{S}^{n-1}$ can be\nexactly recovered from complex Gaussian phases, by recasting PO-CS as linear\ncompressed sensing and then applying existing solvers such as basis pursuit.\nKnown guarantees are either non-uniform or do not tolerate model error. We show\nthat this linearization approach is more powerful than the prior results\nindicate. First, it achieves uniform instance optimality: Under complex\nGaussian matrix with a near-optimal number of rows, this approach uniformly\nrecovers all signals in $\\mathbb{S}^{n-1}$ with errors proportional to the\nmodel errors of the signals. Specifically, for sparse recovery there exists an\nefficient estimator $\\mathbf{x}^\\sharp$ and some universal constant $C$ such\nthat $\\|\\mathbf{x}^\\sharp-\\mathbf{x}\\|_2\\le\n\\frac{C\\sigma_s(\\mathbf{x})_1}{\\sqrt{s}}~(\\forall\\mathbf{x}\\in\\mathbb{S}^{n-1})$,\nwhere\n$\\sigma_s(\\mathbf{x})_1=\\min_{\\mathbf{u}\\in\\Sigma^n_s}\\|\\mathbf{u}-\\mathbf{x}\\|_1$\nis the model error under $\\ell_1$-norm. Second, the instance optimality is\nrobust to small dense disturbances and sparse corruptions that arise before or\nafter capturing the phases. As an extension, we also propose to recast sparsely\ncorrupted PO-CS as a linear corrupted sensing problem and show that this\nachieves perfect reconstruction of the signals. Our results resemble the\ninstance optimal guarantees in linear compressed sensing and, to our knowledge,\nare the first results of this kind for a non-linear sensing scenario.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}