{"id":"2408.15456","title":"Convergence Analysis of Overparametrized LQR Formulations","authors":"Arthur Castello B. de Oliveira, Milad Siami and Eduardo D. Sontag","authorsParsed":[["de Oliveira","Arthur Castello B.",""],["Siami","Milad",""],["Sontag","Eduardo D.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 00:30:37 GMT"}],"updateDate":"2024-08-29","timestamp":1724805037000,"abstract":"  Motivated by the growing use of Artificial Intelligence (AI) tools in control\ndesign, this paper takes the first steps towards bridging the gap between\nresults from Direct Gradient methods for the Linear Quadratic Regulator (LQR),\nand neural networks. More specifically, it looks into the case where one wants\nto find a Linear Feed-Forward Neural Network (LFFNN) feedback that minimizes a\nLQR cost. This paper starts by computing the gradient formulas for the\nparameters of each layer, which are used to derive a key conservation law of\nthe system. This conservation law is then leveraged to prove boundedness and\nglobal convergence of solutions to critical points, and invariance of the set\nof stabilizing networks under the training dynamics. This is followed by an\nanalysis of the case where the LFFNN has a single hidden layer. For this case,\nthe paper proves that the training converges not only to critical points but to\nthe optimal feedback control law for all but a set of measure-zero of the\ninitializations. These theoretical results are followed by an extensive\nanalysis of a simple version of the problem (the ``vector case''), proving the\ntheoretical properties of accelerated convergence and robustness for this\nsimpler example. Finally, the paper presents numerical evidence of faster\nconvergence of the training of general LFFNNs when compared to traditional\ndirect gradient methods, showing that the acceleration of the solution is\nobservable even when the gradient is not explicitly computed but estimated from\nevaluations of the cost function.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control","Mathematics/Dynamical Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"czx9K5qzwA3_yjC_k860EgnOlgOAaDmu6lqtQ2mA63s","pdfSize":"2408287"}
