{"id":"2408.09289","title":"Mono-exponential Current Attenuation with Distance across 16 nm Thick\n  Bacteriorhodopsin Multilayers","authors":"Domenikos Chryssikos, Jerry A. Fereiro, Jonathan Rojas, Sudipta Bera,\n  Defne T\\\"uz\\\"un, Evanthia Kounoupioti, Rui N. Pereira, Christian Pfeiffer,\n  Ali Khoshouei, Hendrik Dietz, Mordechai Sheves, David Cahen, and Marc Tornow","authorsParsed":[["Chryssikos","Domenikos",""],["Fereiro","Jerry A.",""],["Rojas","Jonathan",""],["Bera","Sudipta",""],["Tüzün","Defne",""],["Kounoupioti","Evanthia",""],["Pereira","Rui N.",""],["Pfeiffer","Christian",""],["Khoshouei","Ali",""],["Dietz","Hendrik",""],["Sheves","Mordechai",""],["Cahen","David",""],["Tornow","Marc",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 20:32:35 GMT"}],"updateDate":"2024-09-17","timestamp":1723926755000,"abstract":"  The remarkable ability of natural proteins to conduct electricity in the dry\nstate over long distances remains largely inexplicable despite intensive\nresearch. In some cases, a (weakly) exponential length-attenuation, as in\noff-resonant tunneling transport, extends to thicknesses even beyond 10 nm.\nThis report deals with such charge transport characteristics observed in\nself-assembled multilayers of the protein bacteriorhodopsin (bR). About 7.5 nm\nto 15.5 nm thick bR layers were prepared on conductive titanium nitride (TiN)\nsubstrates using aminohexylphosphonic acid and poly-diallyl-dimethylammonium\nelectrostatic linkers. Using conical EGaIn top contacts, an intriguing,\nmono-exponential conductance attenuation as a function of the bR layer\nthickness with a small attenuation coefficient $\\beta \\approx 0.8 \\space {\\rm\nnm}^{-1}$ is measured at zero bias. Variable-temperature measurements using\nevaporated Ti/Au top contacts yield effective energy barriers of about 100 meV\nfrom fitting the data to tunneling, hopping, and carrier cascade transport\nmodels. The observed temperature-dependence is assigned to the\nprotein-electrode interfaces. The transport length and temperature dependence\nof the current densities are consistent with tunneling through the\nprotein-protein and protein-electrode interfaces, respectively. Importantly,\nour results call for new theoretical approaches to find the microscopic\nmechanism behind the remarkably efficient, long-range electron transport within\nbR.\n","subjects":["Physics/Biological Physics","Condensed Matter/Materials Science","Condensed Matter/Soft Condensed Matter","Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}