{"id":"2408.13090","title":"Direct observation of structural phase transformations during continuous\n  phosphorus deposition on Cu(111)","authors":"Ji\\v{r}\\'i David, Franti\\v{s}ek Je\\v{r}\\'abek, Pavel Proch\\'azka,\n  Miroslav \\v{C}ern\\'y, Cristian V. Ciobanu, Stanislav Pr\\r{u}\\v{s}a,\n  Tom\\'a\\v{s} \\v{S}ikola, Suneel Kodambaka, Miroslav Kol\\'ibal","authorsParsed":[["David","Jiří",""],["Jeřábek","František",""],["Procházka","Pavel",""],["Černý","Miroslav",""],["Ciobanu","Cristian V.",""],["Průša","Stanislav",""],["Šikola","Tomáš",""],["Kodambaka","Suneel",""],["Kolíbal","Miroslav",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 14:16:48 GMT"}],"updateDate":"2024-08-26","timestamp":1724422608000,"abstract":"  Blue phosphorene -- two-dimensional, hexagonal-structured, semiconducting\nphosphorus -- has gained attention as it is considered easier to synthesize on\nmetal surfaces than its allotrope, black phosphorene. Recent studies report\ndifferent structures of phosphorene, for example, on Cu(111), but the\nunderlying mechanisms of their formation are not known. Here, using a\ncombination of in situ ultrahigh vacuum low-energy electron microscopy and in\nvacuo scanning tunneling microscopy, we determine the time-evolution of the\nsurface structure and morphology during the deposition of phosphorus on\nsingle-crystalline Cu(111). We find that during early stages of deposition,\nphosphorus intermixes with Cu, resulting in copper phosphide structures. With\nincreasing surface concentration of phosphorus, the phosphide phase disappears\nand a blue phosphorene layer forms, followed by self-assembly of highly ordered\nphosphorus clusters that eventually grow into multilayer islands. We attribute\nthe unexpected transformation of stable phosphide to a phosphorene layer, and\nthe previously unreported multilayer growth, to the presence of a large\nconcentration of P2 dimers on the surface. Our results constitute direct\nevidence for a new growth mode leading to a phosphorene layer via an\nintermediary phase, which could underpin the growth of other 2D materials on\nstrongly interacting substrates.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"vc38jTwN3KCxgx3lf3zi1S_CrhubA73_GrHhWLXWmiA","pdfSize":"1137028"}
