{"id":"2408.04698","title":"CSS161010: a luminous, fast blue optical transient with broad\n  blueshifted hydrogen lines","authors":"Claudia P. Guti\\'errez, Seppo Mattila, Peter Lundqvist, Luc Dessart,\n  Santiago Gonz\\'alez-Gait\\'an, Peter G. Jonker, Subo Dong, Deanne Coppejans,\n  Ping Chen, Panos Charalampopoulos, Nancy Elias-Rosa, Thomas Reynolds,\n  Christopher Kochanek, Morgan Fraser, Andrea Pastorello, Mariusz Gromadzki,\n  Jack Neustadt, Stefano Benetti, Erkki Kankare, Tuomas Kangas, Rubina Kotak,\n  Maximilian D. Stritzinger, Thomas Wevers, Bing Zhang, David Bersier, Subhash\n  Bose, David A. H. Buckley, Raya Dastidar, Anjasha Gangopadhyay, Aleksandra\n  Hamanowicz, Juna Kollmeier, Jirong Mao, Stephen B. Potter, Encarni\n  Romero-Colmenero, Mridweeka Singh, Auni Somero, Giacomo Terreran, Petri\n  Vaisanen, Lukasz Wyrzykowski","authorsParsed":[["Gutiérrez","Claudia P.",""],["Mattila","Seppo",""],["Lundqvist","Peter",""],["Dessart","Luc",""],["González-Gaitán","Santiago",""],["Jonker","Peter G.",""],["Dong","Subo",""],["Coppejans","Deanne",""],["Chen","Ping",""],["Charalampopoulos","Panos",""],["Elias-Rosa","Nancy",""],["Reynolds","Thomas",""],["Kochanek","Christopher",""],["Fraser","Morgan",""],["Pastorello","Andrea",""],["Gromadzki","Mariusz",""],["Neustadt","Jack",""],["Benetti","Stefano",""],["Kankare","Erkki",""],["Kangas","Tuomas",""],["Kotak","Rubina",""],["Stritzinger","Maximilian D.",""],["Wevers","Thomas",""],["Zhang","Bing",""],["Bersier","David",""],["Bose","Subhash",""],["Buckley","David A. H.",""],["Dastidar","Raya",""],["Gangopadhyay","Anjasha",""],["Hamanowicz","Aleksandra",""],["Kollmeier","Juna",""],["Mao","Jirong",""],["Potter","Stephen B.",""],["Romero-Colmenero","Encarni",""],["Singh","Mridweeka",""],["Somero","Auni",""],["Terreran","Giacomo",""],["Vaisanen","Petri",""],["Wyrzykowski","Lukasz",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 18:00:04 GMT"}],"updateDate":"2024-08-12","timestamp":1723140004000,"abstract":"  We present ultraviolet, optical and near-infrared photometric and optical\nspectroscopic observations of the luminous, fast blue optical transient\n(LFBOT), CSS161010:045834-081803 (CSS161010). The transient was found in a\nlow-redshift (z=0.033) dwarf galaxy. The light curves of CSS161010 are\ncharacterized by an extremely fast evolution and blue colours. The V-band light\ncurve shows that CSS161010 reaches an absolute peak of\nM$_{V}^{max}=-20.66\\pm0.06$ mag in 3.8 days from the start of the outburst.\nAfter maximum, CSS161010 follows a power-law decline $\\propto t^{-2.8\\pm0.1}$\nat all optical bands. These photometric properties are comparable to those of\nwell-observed LFBOTs such as AT 2018cow, AT 2020mrf and AT 2020xnd. However,\nunlike these objects, the spectra of CSS161010 show a remarkable transformation\nfrom a blue and featureless continuum to spectra dominated by very broad,\nentirely blueshifted hydrogen emission lines of velocities of up to 10% of the\nspeed of light. The persistent blueshifted emission and the lack of any\nemission at the rest wavelength of CSS161010 are unique features not seen in\nany transient before CSS161010. The combined observational properties of\nCSS161010 and its dwarf galaxy host favour the tidal disruption of a star by an\nintermediate-mass black hole as its origin.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}