{"id":"2408.16371","title":"A multi-dimensional view of a unified model for TDEs","authors":"Edward J. Parkinson, Christian Knigge, Lixin Dai, Lars Lund Thomsen,\n  James H. Matthews, Knox S. Long","authorsParsed":[["Parkinson","Edward J.",""],["Knigge","Christian",""],["Dai","Lixin",""],["Thomsen","Lars Lund",""],["Matthews","James H.",""],["Long","Knox S.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 09:28:41 GMT"}],"updateDate":"2024-08-30","timestamp":1724923721000,"abstract":"  Tidal disruption events (TDEs) can generate non-spherical, relativistic and\noptically thick outflows. Simulations show that the radiation we observe is\nreprocessed by these outflows. According to a unified model suggested by these\nsimulations, the spectral energy distributions (SEDs) of TDEs depend strongly\non viewing angle: low [high] optical-to-X-ray ratios (OXRs) correspond to\nface-on [edge-on] orientations. Post-processing with radiative transfer codes\nhave simulated the emergent spectra, but have so far been carried out only in a\nquasi-1D framework, with three atomic species (H, He and O). Here, we present\n2.5D Monte Carlo radiative transfer simulations which model the emission from a\nnon-spherical outflow, including a more comprehensive set of cosmically\nabundant species. While the basic trend of OXR increasing with inclination is\npreserved, the inherently multi-dimensional nature of photon transport through\nthe non-spherical outflow significantly affects the emergent SEDs. Relaxing the\nquasi-1D approximation allows photons to preferentially escape in (polar)\ndirections of lower optical depth, resulting in a greater variation of\nbolometric luminosity as a function of inclination. According to our\nsimulations, inclination alone may not fully explain the large dynamic range of\nobserved TDE OXRs. We also find that including metals, other than Oxygen,\nchanges the emergent spectra significantly, resulting in stronger absorption\nand emission lines in the extreme ultraviolet, as well a greater variation in\nthe OXR as a function of inclination. Whilst our results support previously\nproposed unified models for TDEs, they also highlight the critical importance\nof multi-dimensional ionization and radiative transfer.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"G9XTvrFVWxLL5pVGjvZ3fj9pIg8_iJH0FvKLojkeyZA","pdfSize":"4915096"}
