{"id":"2408.14550","title":"Haptics-based, higher-order Sensory Substitution designed for Object\n  Negotiation in Blindness and Low Vision: Virtual Whiskers","authors":"Junchi Feng, Giles Hamilton-Fletcher, Todd E Hudson, Mahya Beheshti,\n  Maurizio Porfiri, John-Ross Rizzo","authorsParsed":[["Feng","Junchi",""],["Hamilton-Fletcher","Giles",""],["Hudson","Todd E",""],["Beheshti","Mahya",""],["Porfiri","Maurizio",""],["Rizzo","John-Ross",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 18:01:46 GMT"}],"updateDate":"2024-08-28","timestamp":1724695306000,"abstract":"  People with blindness and low vision (pBLV) face challenges in navigating.\nMobility aids are crucial for enhancing independence and safety. This paper\npresents an electronic travel aid that leverages a haptic-based, higher-order\nsensory substitution approach called Virtual Whiskers, designed to help pBLV\nnegotiate obstacles effectively, efficiently, and safely. Virtual Whiskers is\nequipped with a plurality of modular vibration units that operate independently\nto deliver haptic feedback to users. Virtual Whiskers features two navigation\nmodes: open path mode and depth mode, each addressing obstacle negotiation from\ndifferent perspectives. The open path mode detects and delineate a traversable\narea within an analyzed field of view. Then, it guides the user through to the\ntraversable direction adaptive vibratory feedback. The depth mode assists users\nin negotiating obstacles by highlighting spatial areas with prominent obstacles\nvia haptic feedback. We recruited 10 participants with blindness or low vision\nto participate in user testing for Virtual Whiskers. Results show that the\ndevice significantly reduces idle periods and decreases the number of cane\ncontacts. Virtual Whiskers is a promising obstacle negotiation strategy that\ndemonstrating great potential to assist with pBLV navigation.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"qnmcx1c2NGTzmnOX8TAXHrxKp65_H3kdI39aubWvbu0","pdfSize":"1357503"}
