{"id":"2408.11809","title":"Informed, Constrained, Aligned: A Field Analysis on Degeneracy-aware\n  Point Cloud Registration in the Wild","authors":"Turcan Tuna, Julian Nubert, Patrick Pfreundschuh, Cesar Cadena,\n  Shehryar Khattak, Marco Hutter","authorsParsed":[["Tuna","Turcan",""],["Nubert","Julian",""],["Pfreundschuh","Patrick",""],["Cadena","Cesar",""],["Khattak","Shehryar",""],["Hutter","Marco",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 17:54:04 GMT"}],"updateDate":"2024-08-22","timestamp":1724262844000,"abstract":"  The ICP registration algorithm has been a preferred method for LiDAR-based\nrobot localization for nearly a decade. However, even in modern SLAM solutions,\nICP can degrade and become unreliable in geometrically ill-conditioned\nenvironments. Current solutions primarily focus on utilizing additional sources\nof information, such as external odometry, to either replace the degenerate\ndirections of the optimization solution or add additional constraints in a\nsensor-fusion setup afterward. In response, this work investigates and compares\nnew and existing degeneracy mitigation methods for robust LiDAR-based\nlocalization and analyzes the efficacy of these approaches in degenerate\nenvironments for the first time in the literature at this scale. Specifically,\nthis work proposes and investigates i) the incorporation of different types of\nconstraints into the ICP algorithm, ii) the effect of using active or passive\ndegeneracy mitigation techniques, and iii) the choice of utilizing global point\ncloud registration methods on the ill-conditioned ICP problem in LiDAR\ndegenerate environments. The study results are validated through multiple\nreal-world field and simulated experiments. The analysis shows that active\noptimization degeneracy mitigation is necessary and advantageous in the absence\nof reliable external estimate assistance for LiDAR-SLAM. Furthermore,\nintroducing degeneracy-aware hard constraints in the optimization before or\nduring the optimization is shown to perform better in the wild than by\nincluding the constraints after. Moreover, with heuristic fine-tuned\nparameters, soft constraints can provide equal or better results in complex\nill-conditioned scenarios. The implementations used in the analysis of this\nwork are made publicly available to the community.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}