{"id":"2408.08143","title":"Unlearnable Examples Detection via Iterative Filtering","authors":"Yi Yu, Qichen Zheng, Siyuan Yang, Wenhan Yang, Jun Liu, Shijian Lu,\n  Yap-Peng Tan, Kwok-Yan Lam, and Alex Kot","authorsParsed":[["Yu","Yi",""],["Zheng","Qichen",""],["Yang","Siyuan",""],["Yang","Wenhan",""],["Liu","Jun",""],["Lu","Shijian",""],["Tan","Yap-Peng",""],["Lam","Kwok-Yan",""],["Kot","Alex",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 13:26:13 GMT"}],"updateDate":"2024-08-16","timestamp":1723728373000,"abstract":"  Deep neural networks are proven to be vulnerable to data poisoning attacks.\nRecently, a specific type of data poisoning attack known as availability\nattacks has led to the failure of data utilization for model learning by adding\nimperceptible perturbations to images. Consequently, it is quite beneficial and\nchallenging to detect poisoned samples, also known as Unlearnable Examples\n(UEs), from a mixed dataset. In response, we propose an Iterative Filtering\napproach for UEs identification. This method leverages the distinction between\nthe inherent semantic mapping rules and shortcuts, without the need for any\nadditional information. We verify that when training a classifier on a mixed\ndataset containing both UEs and clean data, the model tends to quickly adapt to\nthe UEs compared to the clean data. Due to the accuracy gaps between training\nwith clean/poisoned samples, we employ a model to misclassify clean samples\nwhile correctly identifying the poisoned ones. The incorporation of additional\nclasses and iterative refinement enhances the model's ability to differentiate\nbetween clean and poisoned samples. Extensive experiments demonstrate the\nsuperiority of our method over state-of-the-art detection approaches across\nvarious attacks, datasets, and poison ratios, significantly reducing the Half\nTotal Error Rate (HTER) compared to existing methods.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}