{"id":"2408.05282","title":"Two-Edge Connectivity via Pac-Man Gluing","authors":"Mohit Garg, Felix Hommelsheim, Alexander Lindermayr","authorsParsed":[["Garg","Mohit",""],["Hommelsheim","Felix",""],["Lindermayr","Alexander",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 18:09:29 GMT"}],"updateDate":"2024-08-13","timestamp":1723226969000,"abstract":"  We study the 2-edge-connected spanning subgraph (2-ECSS) problem: Given a\ngraph $G$, compute a connected subgraph $H$ of $G$ with the minimum number of\nedges such that $H$ is spanning, i.e., $V(H) = V(G)$, and $H$ is\n2-edge-connected, i.e., $H$ remains connected upon the deletion of any single\nedge, if such an $H$ exists. The $2$-ECSS problem is known to be NP-hard. In\nthis work, we provide a polynomial-time $(\\frac 5 4 +\n\\varepsilon)$-approximation for the problem for an arbitrarily small\n$\\varepsilon>0$, improving the previous best approximation ratio of\n$\\frac{13}{10}+\\varepsilon$.\n  Our improvement is based on two main innovations: First, we reduce solving\nthe problem on general graphs to solving it on structured graphs with high\nvertex connectivity. This high vertex connectivity ensures the existence of a\n4-matching across any bipartition of the vertex set with at least 10 vertices\nin each part. Second, we exploit this property in a later gluing step, where\nisolated 2-edge-connected components need to be merged without adding too many\nedges. Using the 4-matching property, we can repeatedly glue a huge component\n(containing at least 10 vertices) to other components. This step is reminiscent\nof the Pac-Man game, where a Pac-Man (a huge component) consumes all the dots\n(other components) as it moves through a maze. These two innovations lead to a\nsignificantly simpler algorithm and analysis for the gluing step compared to\nthe previous best approximation algorithm, which required a long and tedious\ncase analysis.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RACEskzKtDlj6-NeCSkWt3xzqp0PFbmKD5yzak0RvKk","pdfSize":"493902"}
