{"id":"2408.05212","title":"Preserving Privacy in Large Language Models: A Survey on Current Threats\n  and Solutions","authors":"Michele Miranda, Elena Sofia Ruzzetti, Andrea Santilli, Fabio Massimo\n  Zanzotto, S\\'ebastien Brati\\`eres, Emanuele Rodol\\`a","authorsParsed":[["Miranda","Michele",""],["Ruzzetti","Elena Sofia",""],["Santilli","Andrea",""],["Zanzotto","Fabio Massimo",""],["Bratières","Sébastien",""],["Rodolà","Emanuele",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 05:41:19 GMT"}],"updateDate":"2024-08-12","timestamp":1723268479000,"abstract":"  Large Language Models (LLMs) represent a significant advancement in\nartificial intelligence, finding applications across various domains. However,\ntheir reliance on massive internet-sourced datasets for training brings notable\nprivacy issues, which are exacerbated in critical domains (e.g., healthcare).\nMoreover, certain application-specific scenarios may require fine-tuning these\nmodels on private data. This survey critically examines the privacy threats\nassociated with LLMs, emphasizing the potential for these models to memorize\nand inadvertently reveal sensitive information. We explore current threats by\nreviewing privacy attacks on LLMs and propose comprehensive solutions for\nintegrating privacy mechanisms throughout the entire learning pipeline. These\nsolutions range from anonymizing training datasets to implementing differential\nprivacy during training or inference and machine unlearning after training. Our\ncomprehensive review of existing literature highlights ongoing challenges,\navailable tools, and future directions for preserving privacy in LLMs. This\nwork aims to guide the development of more secure and trustworthy AI systems by\nproviding a thorough understanding of privacy preservation methods and their\neffectiveness in mitigating risks.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}