{"id":"2408.12513","title":"Beyond Shortsighted Navigation: Merging Best View Trajectory Planning\n  with Robot Navigation","authors":"Srinath Tankasala, Roberto Mart\\'in-Mart\\'in, Mitch Pryor","authorsParsed":[["Tankasala","Srinath",""],["Martín-Martín","Roberto",""],["Pryor","Mitch",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 16:08:45 GMT"}],"updateDate":"2024-08-23","timestamp":1724342925000,"abstract":"  Gathering visual information effectively to monitor known environments is a\nkey challenge in robotics. To be as efficient as human surveyors, robotic\nsystems must continuously collect observational data required to complete their\nsurvey task. Inspection personnel instinctively know to look at relevant\nequipment that happens to be ``along the way.'' In this paper, we introduce a\nnovel framework for continuous long-horizon viewpoint planning, for ground\nrobots, applied to tasks involving patrolling, monitoring or visual data\ngathering in known environments. Our approach to Long Horizon Viewpoint\nPlanning (LHVP), enables the robot to autonomously navigate and collect\nenvironmental data optimizing for coverage over the horizon of the patrol.\nLeveraging a quadruped's mobility and sensory capabilities, our LHVP framework\nplans patrol paths that account for coupling the viewpoint planner for the arm\ncamera with the mobile base's navigation planner. The viewpath optimization\nalgorithm seeks a balance between comprehensive environmental coverage and\ndynamically feasible movements, thus ensuring prolonged and effective operation\nin scenarios including monitoring, security surveillance, and disaster\nresponse. We validate our approach through simulations and in the real world\nand show that our LHVP significantly outperforms naive patrolling methods in\nterms of area coverage generating information-gathering trajectories for the\nrobot arm. Our results indicate a promising direction for the deployment of\nmobile robots in long-term, autonomous surveying, and environmental data\ncollection tasks, highlighting the potential of intelligent robotic systems in\nchallenging real-world applications.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6MoR_COdHW8vnh2O_TSe_oaBTZBQ0TTLLG1wjwocCVA","pdfSize":"4911930"}
