{"id":"2408.09423","title":"A Spatio-temporal Prediction Methodology Based on Deep Learning and Real\n  Wi-Fi Measurements","authors":"Seyedeh Soheila Shaabanzadeh (1), Juan S\\'anchez-Gonz\\'alez (1) ((1)\n  Universitat Polit\\`ecnica de Catalunya (UPC))","authorsParsed":[["Shaabanzadeh","Seyedeh Soheila",""],["Sánchez-González","Juan",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 09:54:43 GMT"}],"updateDate":"2024-08-20","timestamp":1723974883000,"abstract":"  The rapid development of Wi-Fi technologies in recent years has caused a\nsignificant increase in the traffic usage. Hence, knowledge obtained from Wi-Fi\nnetwork measurements can be helpful for a more efficient network management. In\nthis paper, we propose a methodology to predict future values of some specific\nnetwork metrics (e.g. traffic load, transmission failures, etc.). These\npredictions may be useful for improving the network performance. After data\ncollection and preprocessing, the correlation between each target access point\n(AP) and its neighbouring APs is estimated. According to these correlations,\neither an only-temporal or a spatio-temporal based prediction is done. To\nevaluate the proposed methodology, real measurements are collected from 100 APs\ndeployed in different university buildings for 3 months. Deep Learning (DL)\nmethods (i.e. Convolutional Neural Network (CNN), Simple Recurrent Neural\nNetwork (SRNN), Gated Recurrent Unit (GRU), Long Short-Term Memory (LSTM),\nTransformer) are evaluated and compared for both temporal and spatio-temporal\nbased predictions. Moreover, a hybrid prediction methodology is proposed using\na spatial processing based on CNN and a temporal prediction based on RNN. The\nproposed hybrid methodology provides an improvement in the prediction accuracy\nat expenses of a slight increase in the Training Computational Time (TCT) and\nnegligible in Prediction Computational Time (PCT).\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"KTC1ngX-H1m56fYs6vjrCNhDkoLDUYiY2KXa_Ke-kF4","pdfSize":"1126088"}
