{"id":"2408.14130","title":"Theoretical Proportion Label Perturbation for Learning from Label\n  Proportions in Large Bags","authors":"Shunsuke Kubo, Shinnosuke Matsuo, Daiki Suehiro, Kazuhiro Terada,\n  Hiroaki Ito, Akihiko Yoshizawa, Ryoma Bise","authorsParsed":[["Kubo","Shunsuke",""],["Matsuo","Shinnosuke",""],["Suehiro","Daiki",""],["Terada","Kazuhiro",""],["Ito","Hiroaki",""],["Yoshizawa","Akihiko",""],["Bise","Ryoma",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 09:24:36 GMT"}],"updateDate":"2024-08-27","timestamp":1724664276000,"abstract":"  Learning from label proportions (LLP) is a kind of weakly supervised learning\nthat trains an instance-level classifier from label proportions of bags, which\nconsist of sets of instances without using instance labels. A challenge in LLP\narises when the number of instances in a bag (bag size) is numerous, making the\ntraditional LLP methods difficult due to GPU memory limitations. This study\naims to develop an LLP method capable of learning from bags with large sizes.\nIn our method, smaller bags (mini-bags) are generated by sampling instances\nfrom large-sized bags (original bags), and these mini-bags are used in place of\nthe original bags. However, the proportion of a mini-bag is unknown and differs\nfrom that of the original bag, leading to overfitting. To address this issue,\nwe propose a perturbation method for the proportion labels of sampled mini-bags\nto mitigate overfitting to noisy label proportions. This perturbation is added\nbased on the multivariate hypergeometric distribution, which is statistically\nmodeled. Additionally, loss weighting is implemented to reduce the negative\nimpact of proportions sampled from the tail of the distribution. Experimental\nresults demonstrate that the proportion label perturbation and loss weighting\nachieve classification accuracy comparable to that obtained without sampling.\nOur codes are available at https://github.com/stainlessnight/LLP-LargeBags.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"VKLR9-tULoQZtQ6YcqzNs4-Rsc1Of9-ofuBBuTF1C-A","pdfSize":"498712"}
