{"id":"2408.13014","title":"Contraction response of a polyelectrolyte hydrogel under spatially\n  nonuniform electric fields","authors":"Ekrem Bahceci and Aykut Erbas","authorsParsed":[["Bahceci","Ekrem",""],["Erbas","Aykut",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 12:05:05 GMT"}],"updateDate":"2024-08-26","timestamp":1724414705000,"abstract":"  One of the major challenges in contemporary materials science is to build\nsynthetic structures that can mimic responsive biological tissues, such as\nartificial skins and muscles. Polyelectrolyte hydrogels can provide such\nmechanoelectrical responses under external electric fields. Yet, their response\nto such stimuli, particularly at the molecular scales, is not fully revealed.\nHere, we study the mechanical response of a semi-infinite polyelectrolyte\nhydrogel slab to transient and spatially nonuniform sinusoidal electric fields\nby using extensive coarse-grained molecular dynamics simulations. Our\nsimulations show that if the electric field is exerted on a small volumetric\nsection of the hydrogel slab, the entire slab contracts reversibly and\nuniaxially in the direction perpendicular to the field. The hydrogel contracts\nalmost half of its field-free initial length before retracting its original\nsize, and eventually, its size fluctuations decay similarly exponentially. A\ncontraction maximises when the electric field is applied away from the\nboundaries of the hydrogel slab. Further, by tuning the electric field\nfrequency and amplitude, both contraction times and efficiency can be\ncontrolled. Analyses of contraction times and efficiency with implicit solvent\nsimulations for various electrostatic parameters and salt concentrations\nconfirm the robustness of the phenomenon while highlighting the importance of\nhydrodynamics. Our results demonstrate the effectiveness of spatially\nnonuniform electric fields' effectiveness in manipulating homogenous hydrogel\nstructures for applications requiring rapid and soft actuation components.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}