{"id":"2408.13340","title":"JWST Thermal Emission of the Terrestrial Exoplanet GJ 1132b","authors":"Qiao Xue, Jacob L. Bean, Michael Zhang, Alexandra S. Mahajan, Jegug\n  Ih, Jason D. Eastman, Jonathan I. Lunine, Megan Weiner Mansfield, Brandon P.\n  Coy, Eliza M.-R. Kempton, Daniel D. Koll, Edwin S. Kite","authorsParsed":[["Xue","Qiao",""],["Bean","Jacob L.",""],["Zhang","Michael",""],["Mahajan","Alexandra S.",""],["Ih","Jegug",""],["Eastman","Jason D.",""],["Lunine","Jonathan I.",""],["Mansfield","Megan Weiner",""],["Coy","Brandon P.",""],["Kempton","Eliza M. -R.",""],["Koll","Daniel D.",""],["Kite","Edwin S.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 19:20:15 GMT"}],"updateDate":"2024-09-20","timestamp":1724440815000,"abstract":"  We present thermal emission measurements of GJ 1132b spanning 5--12 um\nobtained with the Mid-Infrared Instrument Low-Resolution Spectrometer\n(MIRI/LRS) on the James Webb Space Telescope (JWST). GJ 1132b is an M-dwarf\nrocky planet with Teq=584 K and an orbital period of 1.6 days. We measure a\nwhite-light secondary eclipse depth of 140+/-17 ppm, which corresponds to a\ndayside brightness temperature of Tp,dayside= 709+/-31 K using improved star\nand planet parameters. This measured temperature is only 1 sigma below the\nmaximum possible dayside temperature of a bare rock (i.e., assuming a zero\nalbedo planet with no heat redistribution, Tmax = 746+14/-11 K). The emission\nspectrum is consistent with a featureless blackbody, which agrees with a wide\nrange of possible surface compositions. By comparing forward models to the\ndayside emission spectrum, we rule out Earth-thickness (P ~ 1 bar) atmospheres\nwith at least 1% H2O, atmospheres of any modeled thickness (10^-4 -- 10^2 bar)\nthat contain at least 1% CO2, and thick, Venus-like atmospheres (P>~100 bar)\nwith at least 1 ppm CO2 or H2O. We therefore conclude that GJ 1132b likely does\nnot have a significant atmosphere. This finding supports the concept of a\nuniversal 'Cosmic Shoreline' given the high level of bolometric and XUV\nirradiation received by the planet.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}