{"id":"2408.06402","title":"PhaGO: Protein function annotation for bacteriophages by integrating the\n  genomic context","authors":"Jiaojiao Guan, Yongxin Ji, Cheng Peng, Wei Zou, Xubo Tang, Jiayu\n  Shang, Yanni Sun","authorsParsed":[["Guan","Jiaojiao",""],["Ji","Yongxin",""],["Peng","Cheng",""],["Zou","Wei",""],["Tang","Xubo",""],["Shang","Jiayu",""],["Sun","Yanni",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 13:02:38 GMT"},{"version":"v2","created":"Sat, 17 Aug 2024 13:46:36 GMT"}],"updateDate":"2024-08-20","timestamp":1723467758000,"abstract":"  Bacteriophages are viruses that target bacteria, playing a crucial role in\nmicrobial ecology. Phage proteins are important in understanding phage biology,\nsuch as virus infection, replication, and evolution. Although a large number of\nnew phages have been identified via metagenomic sequencing, many of them have\nlimited protein function annotation. Accurate function annotation of phage\nproteins presents several challenges, including their inherent diversity and\nthe scarcity of annotated ones. Existing tools have yet to fully leverage the\nunique properties of phages in annotating protein functions. In this work, we\npropose a new protein function annotation tool for phages by leveraging the\nmodular genomic structure of phage genomes. By employing embeddings from the\nlatest protein foundation models and Transformer to capture contextual\ninformation between proteins in phage genomes, PhaGO surpasses state-of-the-art\nmethods in annotating diverged proteins and proteins with uncommon functions by\n6.78% and 13.05% improvement, respectively. PhaGO can annotate proteins lacking\nhomology search results, which is critical for characterizing the rapidly\naccumulating phage genomes. We demonstrate the utility of PhaGO by identifying\n688 potential holins in phages, which exhibit high structural conservation with\nknown holins. The results show the potential of PhaGO to extend our\nunderstanding of newly discovered phages.\n","subjects":["Quantitative Biology/Quantitative Methods","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"6Nv7AQBnyKSsOxC7pWSBO3eOrzg9BZadE3S2Ued0ZGU","pdfSize":"2849320"}
