{"id":"2408.00247","title":"Simple but Efficient: A Multi-Scenario Nearline Retrieval Framework for\n  Recommendation on Taobao","authors":"Yingcai Ma, Ziyang Wang, Yuliang Yan, Jian Wu, Yuning Jiang, Longbin\n  Li, Wen Chen and Jianhang Huang","authorsParsed":[["Ma","Yingcai",""],["Wang","Ziyang",""],["Yan","Yuliang",""],["Wu","Jian",""],["Jiang","Yuning",""],["Li","Longbin",""],["Chen","Wen",""],["Huang","Jianhang",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 02:54:23 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 03:19:58 GMT"},{"version":"v3","created":"Tue, 6 Aug 2024 03:27:02 GMT"}],"updateDate":"2024-08-07","timestamp":1722480863000,"abstract":"  In recommendation systems, the matching stage is becoming increasingly\ncritical, serving as the upper limit for the entire recommendation process.\nRecently, some studies have started to explore the use of multi-scenario\ninformation for recommendations, such as model-based and data-based approaches.\nHowever, the matching stage faces significant challenges due to the need for\nultra-large-scale retrieval and meeting low latency requirements. As a result,\nthe methods applied at this stage (collaborative filtering and two-tower\nmodels) are often designed to be lightweight, hindering the full utilization of\nextensive information. On the other hand, the ranking stage features the most\nsophisticated models with the strongest scoring capabilities, but due to the\nlimited screen size of mobile devices, most of the ranked results may not gain\nexposure or be displayed. In this paper, we introduce an innovative\nmulti-scenario nearline retrieval framework. It operates by harnessing ranking\nlogs from various scenarios through Flink, allowing us to incorporate finely\nranked results from other scenarios into our matching stage in near real-time.\nBesides, we propose a streaming scoring module, which selects a crucial subset\nfrom the candidate pool. Implemented on the \"Guess You Like\" (homepage of the\nTaobao APP), China's premier e-commerce platform, our method has shown\nsubstantial improvements-most notably, a 5% uptick in product transactions.\nFurthermore, the proposed approach is not only model-free but also highly\nefficient, suggesting it can be quickly implemented in diverse scenarios and\ndemonstrate promising performance.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/"}