{"id":"2408.08289","title":"Shadow behavior of an EMSG charged black hole","authors":"Fateme Aliyan and Kourosh Nozari","authorsParsed":[["Aliyan","Fateme",""],["Nozari","Kourosh",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 17:43:09 GMT"}],"updateDate":"2024-08-16","timestamp":1723743789000,"abstract":"  Recent shadow images of Sgr A and M87 captured by Event Horizon Telescope\n(EHT) collaboration confirms the existence of black holes or their possible\nalternatives in the center of galaxies. On the other hand, the new image of Sgr\nA in polarized light suggests a Magnetic field spiraling at the Edge of the\nMilky Way Central Black Hole. Due to the gravitational lensing effect, the\nbending of light in the background geometry of the black hole casts a shadow.\nIn recent years, black holes and their properties have been vastly studied in\nthe framework of General Relativity and other modified theories of gravity. One\nof the possibilities to generalize GR is Energy Momentum Squared Gravity\n(EMSG). It is important to mention that EMSG modifies all matter field\nequations, adding some non linear terms to Maxwell equations. EMSG theory as a\nmodified theory of gravity predicts an asymptotically de Sitter charged black\nhole whose shadow cast and other related characteristics have not been examined\nyet. Hence we consider the EMSG charged black hole and investigate the shadow\nshape of this kind of black hole solution in confrontation with EHT results. In\nthe case of non linear electrodynamics, the path of the photon is null on some\neffective metric. By deriving the effective metric of an EMSG charged black\nhole we study the null geodesics of the effective metric in the Hamilton Jacobi\nmethod. we find the photon orbits and compute the shadow size of this black\nhole. Then we examine how electric charge and the coupling constant of the EMSG\naffect the shadow size of the black hole in a positively accelerated expanding\nuniverse (with a positive cosmological constant). We explore the viable values\nof these parameters constrained by EHT data by comparing the shadow radius of\nan EMSG charged black hole with the shadow size of Sgr A.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}