{"id":"2408.12429","title":"FlexEdit: Marrying Free-Shape Masks to VLLM for Flexible Image Editing","authors":"Jue Wang, Yuxiang Lin, Tianshuo Yuan, Zhi-Qi Cheng, Xiaolong Wang,\n  Jiao GH, Wei Chen, Xiaojiang Peng","authorsParsed":[["Wang","Jue",""],["Lin","Yuxiang",""],["Yuan","Tianshuo",""],["Cheng","Zhi-Qi",""],["Wang","Xiaolong",""],["GH","Jiao",""],["Chen","Wei",""],["Peng","Xiaojiang",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 14:22:07 GMT"}],"updateDate":"2024-08-23","timestamp":1724336527000,"abstract":"  Combining Vision Large Language Models (VLLMs) with diffusion models offers a\npowerful method for executing image editing tasks based on human language\ninstructions. However, language instructions alone often fall short in\naccurately conveying user requirements, particularly when users want to add,\nreplace elements in specific areas of an image. Luckily, masks can effectively\nindicate the exact locations or elements to be edited, while they require users\nto precisely draw the shapes at the desired locations, which is highly\nuser-unfriendly. To address this, we propose FlexEdit, an end-to-end image\nediting method that leverages both free-shape masks and language instructions\nfor Flexible Editing. Our approach employs a VLLM in comprehending the image\ncontent, mask, and user instructions. Additionally, we introduce the Mask\nEnhance Adapter (MEA) that fuses the embeddings of the VLLM with the image\ndata, ensuring a seamless integration of mask information and model output\nembeddings. Furthermore, we construct FSMI-Edit, a benchmark specifically\ntailored for free-shape mask, including 8 types of free-shape mask. Extensive\nexperiments show that our method achieves state-of-the-art (SOTA) performance\nin LLM-based image editing, and our simple prompting technique stands out in\nits effectiveness. The code and data can be found at\nhttps://github.com/A-new-b/flex_edit.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}