{"id":"2408.16670","title":"A Causal Framework for Evaluating Heterogeneous Policy Mechanisms Using\n  Difference-in-Differences","authors":"Gary Hettinger, Youjin Lee, Nandita Mitra","authorsParsed":[["Hettinger","Gary",""],["Lee","Youjin",""],["Mitra","Nandita",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 16:19:19 GMT"}],"updateDate":"2024-08-30","timestamp":1724948359000,"abstract":"  In designing and evaluating public policies, policymakers and researchers\noften hypothesize about the mechanisms through which a policy may affect a\npopulation and aim to assess these mechanisms in practice. For example, when\nstudying an excise tax on sweetened beverages, researchers might explore how\ncross-border shopping, economic competition, and store-level price changes\ndifferentially affect store sales. However, many policy evaluation designs,\nincluding the difference-in-differences (DiD) approach, traditionally target\nthe average effect of the intervention rather than the underlying mechanisms.\nExtensions of these approaches to evaluate policy mechanisms often involve\nexploratory subgroup analyses or outcome models parameterized by\nmechanism-specific variables. However, neither approach studies the mechanisms\nwithin a causal framework, limiting the analysis to associative relationships\nbetween mechanisms and outcomes, which may be confounded by differences among\nsub-populations exposed to varying levels of the mechanisms. Therefore,\nrigorous mechanism evaluation requires robust techniques to adjust for\nconfounding and accommodate the interconnected relationship between stores\nwithin competitive economic landscapes. In this paper, we present a framework\nfor evaluating policy mechanisms by studying Philadelphia beverage tax. Our\napproach builds on recent advancements in causal effect curve estimators under\nDiD designs, offering tools and insights for assessing policy mechanisms\ncomplicated by confounding and network interference.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/"}