{"id":"2408.10816","title":"Deep Learning-based Classification of Dementia using Image\n  Representation of Subcortical Signals","authors":"Shivani Ranjan, Ayush Tripathi, Harshal Shende, Robin Badal, Amit\n  Kumar, Pramod Yadav, Deepak Joshi, Lalan Kumar","authorsParsed":[["Ranjan","Shivani",""],["Tripathi","Ayush",""],["Shende","Harshal",""],["Badal","Robin",""],["Kumar","Amit",""],["Yadav","Pramod",""],["Joshi","Deepak",""],["Kumar","Lalan",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 13:11:43 GMT"}],"updateDate":"2024-08-21","timestamp":1724159503000,"abstract":"  Dementia is a neurological syndrome marked by cognitive decline. Alzheimer's\ndisease (AD) and Frontotemporal dementia (FTD) are the common forms of\ndementia, each with distinct progression patterns. EEG, a non-invasive tool for\nrecording brain activity, has shown potential in distinguishing AD from FTD and\nmild cognitive impairment (MCI). Previous studies have utilized various EEG\nfeatures, such as subband power and connectivity patterns to differentiate\nthese conditions. However, artifacts in EEG signals can obscure crucial\ninformation, necessitating advanced signal processing techniques. This study\naims to develop a deep learning-based classification system for dementia by\nanalyzing scout time-series signals from deep brain regions, specifically the\nhippocampus, amygdala, and thalamus. The study utilizes scout time series\nextracted via the standardized low-resolution brain electromagnetic tomography\n(sLORETA) technique. The time series is converted to image representations\nusing continuous wavelet transform (CWT) and fed as input to deep learning\nmodels. Two high-density EEG datasets are utilized to check for the efficacy of\nthe proposed method: the online BrainLat dataset (comprising AD, FTD, and\nhealthy controls (HC)) and the in-house IITD-AIIA dataset (including subjects\nwith AD, MCI, and HC). Different classification strategies and classifier\ncombinations have been utilized for the accurate mapping of classes on both\ndatasets. The best results were achieved by using a product of probabilities\nfrom classifiers for left and right subcortical regions in conjunction with the\nDenseNet model architecture. It yields accuracies of 94.17$\\%$ and 77.72$\\%$ on\nthe BrainLat and IITD-AIIA datasets, respectively. This highlights the\npotential of this approach for early and accurate differentiation of\nneurodegenerative disorders.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}