{"id":"2408.04054","title":"NAVINACT: Combining Navigation and Imitation Learning for Bootstrapping\n  Reinforcement Learning","authors":"Amisha Bhaskar, Zahiruddin Mahammad, Sachin R Jadhav and Pratap\n  Tokekar","authorsParsed":[["Bhaskar","Amisha",""],["Mahammad","Zahiruddin",""],["Jadhav","Sachin R",""],["Tokekar","Pratap",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 19:30:08 GMT"}],"updateDate":"2024-08-09","timestamp":1723059008000,"abstract":"  Reinforcement Learning (RL) has shown remarkable progress in simulation\nenvironments, yet its application to real-world robotic tasks remains limited\ndue to challenges in exploration and generalisation. To address these issues,\nwe introduce NAVINACT, a framework that chooses when the robot should use\nclassical motion planning-based navigation and when it should learn a policy.\nTo further improve the efficiency in exploration, we use imitation data to\nbootstrap the exploration. NAVINACT dynamically switches between two modes of\noperation: navigating to a waypoint using classical techniques when away from\nthe objects and reinforcement learning for fine-grained manipulation control\nwhen about to interact with objects. NAVINACT consists of a multi-head\narchitecture composed of ModeNet for mode classification, NavNet for waypoint\nprediction, and InteractNet for precise manipulation. By combining the\nstrengths of RL and Imitation Learning (IL), NAVINACT improves sample\nefficiency and mitigates distribution shift, ensuring robust task execution. We\nevaluate our approach across multiple challenging simulation environments and\nreal-world tasks, demonstrating superior performance in terms of adaptability,\nefficiency, and generalization compared to existing methods. In both simulated\nand real-world settings, NAVINACT demonstrates robust performance. In\nsimulations, NAVINACT surpasses baseline methods by 10-15\\% in training success\nrates at 30k samples and by 30-40\\% during evaluation phases. In real-world\nscenarios, it demonstrates a 30-40\\% higher success rate on simpler tasks\ncompared to baselines and uniquely succeeds in complex, two-stage manipulation\ntasks.\n  Datasets and supplementary materials can be found on our website:\n{https://raaslab.org/projects/NAVINACT/}.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}