{"id":"2408.04593","title":"SAM 2 in Robotic Surgery: An Empirical Evaluation for Robustness and\n  Generalization in Surgical Video Segmentation","authors":"Jieming Yu, An Wang, Wenzhen Dong, Mengya Xu, Mobarakol Islam, Jie\n  Wang, Long Bai, Hongliang Ren","authorsParsed":[["Yu","Jieming",""],["Wang","An",""],["Dong","Wenzhen",""],["Xu","Mengya",""],["Islam","Mobarakol",""],["Wang","Jie",""],["Bai","Long",""],["Ren","Hongliang",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 17:08:57 GMT"}],"updateDate":"2024-08-09","timestamp":1723136937000,"abstract":"  The recent Segment Anything Model (SAM) 2 has demonstrated remarkable\nfoundational competence in semantic segmentation, with its memory mechanism and\nmask decoder further addressing challenges in video tracking and object\nocclusion, thereby achieving superior results in interactive segmentation for\nboth images and videos. Building upon our previous empirical studies, we\nfurther explore the zero-shot segmentation performance of SAM 2 in\nrobot-assisted surgery based on prompts, alongside its robustness against\nreal-world corruption. For static images, we employ two forms of prompts:\n1-point and bounding box, while for video sequences, the 1-point prompt is\napplied to the initial frame. Through extensive experimentation on the MICCAI\nEndoVis 2017 and EndoVis 2018 benchmarks, SAM 2, when utilizing bounding box\nprompts, outperforms state-of-the-art (SOTA) methods in comparative\nevaluations. The results with point prompts also exhibit a substantial\nenhancement over SAM's capabilities, nearing or even surpassing existing\nunprompted SOTA methodologies. Besides, SAM 2 demonstrates improved inference\nspeed and less performance degradation against various image corruption.\nAlthough slightly unsatisfactory results remain in specific edges or regions,\nSAM 2's robust adaptability to 1-point prompts underscores its potential for\ndownstream surgical tasks with limited prompt requirements.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}