{"id":"2408.04048","title":"A Survey of Protoplanetary Disks Using the Keck/NIRC2 Vortex Coronagraph","authors":"Nicole L. Wallack, Jean-Baptiste Ruffio, Garreth Ruane, Bin B. Ren,\n  Jerry W. Xuan, Marion Villenave, Dimitri Mawet, Karl Stapelfeldt, Jason J.\n  Wang, Michael C. Liu, Olivier Absil, Carlos Alvarez, Jaehan Bae, Charlotte\n  Bond, Michael Bottom, Benjamin Calvin, \\'Elodie Choquet, Valentin\n  Christiaens, Therese Cook, Bruno Femen\\'ia Castell\\'a, Carlos Gomez Gonzalez,\n  Greta Guidi, Elsa Huby, Joel Kastner, Heather A. Knutson, Tiffany Meshkat,\n  Henry Ngo, Sam Ragland, Maddalena Reggiani, Luca Ricci, Eugene Serabyn,\n  Taichi Uyama, Jonathan P. Williams, Peter Wizinowich, Zoe Zawol, Shangjia\n  Zhang, and Zhaohuan Zhu","authorsParsed":[["Wallack","Nicole L.",""],["Ruffio","Jean-Baptiste",""],["Ruane","Garreth",""],["Ren","Bin B.",""],["Xuan","Jerry W.",""],["Villenave","Marion",""],["Mawet","Dimitri",""],["Stapelfeldt","Karl",""],["Wang","Jason J.",""],["Liu","Michael C.",""],["Absil","Olivier",""],["Alvarez","Carlos",""],["Bae","Jaehan",""],["Bond","Charlotte",""],["Bottom","Michael",""],["Calvin","Benjamin",""],["Choquet","Élodie",""],["Christiaens","Valentin",""],["Cook","Therese",""],["Castellá","Bruno Femenía",""],["Gonzalez","Carlos Gomez",""],["Guidi","Greta",""],["Huby","Elsa",""],["Kastner","Joel",""],["Knutson","Heather A.",""],["Meshkat","Tiffany",""],["Ngo","Henry",""],["Ragland","Sam",""],["Reggiani","Maddalena",""],["Ricci","Luca",""],["Serabyn","Eugene",""],["Uyama","Taichi",""],["Williams","Jonathan P.",""],["Wizinowich","Peter",""],["Zawol","Zoe",""],["Zhang","Shangjia",""],["Zhu","Zhaohuan",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 18:59:14 GMT"}],"updateDate":"2024-08-09","timestamp":1723057154000,"abstract":"  Recent Atacama Large Millimeter/submillimeter Array (ALMA) observations of\nprotoplanetary disks in the millimeter continuum have shown a variety of radial\ngaps, cavities, and spiral features. These substructures may be signposts for\nongoing planet formation, and therefore these systems are promising targets for\ndirect imaging planet searches in the near-infrared. To this end, we present\nresults from a deep imaging survey in the $L'$-band (3.8 $\\mu$m) with the\nKeck/NIRC2 vortex coronagraph to search for young planets in 43 disks with\nresolved features in the millimeter continuum or evidence for gaps/central\ncavities from their spectral energy distributions. Although we do not detect\nany new point sources, using the vortex coronagraph allows for high sensitivity\nto faint sources at small angular separations (down to\n${\\sim}$0$^{\\prime\\prime}$.1), allowing us to place strong upper limits on the\nmasses of potential gas giant planets. We compare our mass sensitivities to the\nmasses of planets derived using ALMA observations, and while we are sensitive\nto $\\sim$1 M$_{Jup}$ planets in the gaps in some of our systems, we are\ngenerally not sensitive to planets of the masses expected from the ALMA\nobservations. In addition to placing upper limits on the masses of gas giant\nplanets that could be interacting with the dust in the disks to form the\nobserved millimeter substructures, we are also able to map the micron-sized\ndust as seen in scattered light for 8 of these systems. Our large sample of\nsystems also allows us to investigate limits on planetary accretion rates and\ndisk viscosities.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QqaiXoRgzs92MPW0OCPnEnne48YYfqMgXgDGtB4iyBk","pdfSize":"5663234"}
