{"id":"2408.10181","title":"Imbalance-Aware Culvert-Sewer Defect Segmentation Using an Enhanced\n  Feature Pyramid Network","authors":"Rasha Alshawi, Md Meftahul Ferdaus, Mahdi Abdelguerfi, Kendall Niles,\n  Ken Pathak, Steve Sloan","authorsParsed":[["Alshawi","Rasha",""],["Ferdaus","Md Meftahul",""],["Abdelguerfi","Mahdi",""],["Niles","Kendall",""],["Pathak","Ken",""],["Sloan","Steve",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 17:40:18 GMT"}],"updateDate":"2024-08-20","timestamp":1724089218000,"abstract":"  Imbalanced datasets are a significant challenge in real-world scenarios. They\nlead to models that underperform on underrepresented classes, which is a\ncritical issue in infrastructure inspection. This paper introduces the Enhanced\nFeature Pyramid Network (E-FPN), a deep learning model for the semantic\nsegmentation of culverts and sewer pipes within imbalanced datasets. The E-FPN\nincorporates architectural innovations like sparsely connected blocks and\ndepth-wise separable convolutions to improve feature extraction and handle\nobject variations. To address dataset imbalance, the model employs strategies\nlike class decomposition and data augmentation. Experimental results on the\nculvert-sewer defects dataset and a benchmark aerial semantic segmentation\ndrone dataset show that the E-FPN outperforms state-of-the-art methods,\nachieving an average Intersection over Union (IoU) improvement of 13.8% and\n27.2%, respectively. Additionally, class decomposition and data augmentation\ntogether boost the model's performance by approximately 6.9% IoU. The proposed\nE-FPN presents a promising solution for enhancing object segmentation in\nchallenging, multi-class real-world datasets, with potential applications\nextending beyond culvert-sewer defect detection.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}