{"id":"2408.03308","title":"Potential and Limitation of High-Frequency Cores and Caches","authors":"Kunal Pai, Anusheel Nand, Jason Lowe-Power","authorsParsed":[["Pai","Kunal",""],["Nand","Anusheel",""],["Lowe-Power","Jason",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 17:16:19 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 20:21:54 GMT"}],"updateDate":"2024-09-09","timestamp":1722964579000,"abstract":"  This paper explores the potential of cryogenic semiconductor computing and\nsuperconductor electronics as promising alternatives to traditional\nsemiconductor devices. As semiconductor devices face challenges such as\nincreased leakage currents and reduced performance at higher temperatures,\nthese novel technologies offer high performance and low power computation.\nConventional semiconductor electronics operating at cryogenic temperatures\n(below -150{\\deg}C or 123.15 K) can benefit from reduced leakage currents and\nimproved electron mobility. On the other hand, superconductor electronics,\noperating below 10 K, allow electrons to flow without resistance, offering the\npotential for ultra-low-power, high-speed computation. This study presents a\ncomprehensive performance modeling and analysis of these technologies and\nprovides insights into their potential benefits and limitations. We implement\nmodels of in-order and out-of-order cores operating at high clock frequencies\nassociated with superconductor electronics and cryogenic semiconductor\ncomputing in gem5. We evaluate the performance of these components using\nworkloads representative of real-world applications like NPB, SPEC CPU2006, and\nGAPBS. Our results show the potential speedups achievable by these components\nand the limitations posed by cache bandwidth. This work provides valuable\ninsights into the performance implications and design trade-offs associated\nwith cryogenic and superconductor technologies, laying the foundation for\nfuture research in this field using gem5.\n","subjects":["Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HCWgak5_E_MHa3zp5gVOgn_1eqcf_vy8K3KPFz4IAFc","pdfSize":"415011"}
