{"id":"2408.11350","title":"Predator and Prey: A Minimum Recipe for the Transition from Steady to\n  Oscillating Precipitation in Hothouse Climates","authors":"Da Yang, Dorian S. Abbot, Seth Seidel","authorsParsed":[["Yang","Da",""],["Abbot","Dorian S.",""],["Seidel","Seth",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 05:31:12 GMT"}],"updateDate":"2024-08-22","timestamp":1724218272000,"abstract":"  In the present tropical atmosphere, precipitation typically exhibits noisy,\nsmall-amplitude fluctuations about an average. However, recent cloud-resolving\nsimulations show that in a hothouse climate, precipitation can shift to a\nregime characterized by nonlinear oscillations. In this regime, intense\nprecipitation events are separated by several dry days. This raises questions\nabout what triggers the shift from a quasi-equilibrium state of precipitation\nto nonlinear precipitation oscillations and what factors determine the\ncharacteristics of these oscillations. To address these questions, we present a\nlow-order model that includes two nonlinear ordinary differential equations,\none for precipitation and the other for convective inhibition (CIN). Three\nprocesses govern the development of precipitation: a convective trigger that\nenhances precipitation, a self-limiting mechanism that reduces intense\nprecipitation, and the effect of CIN in suppressing precipitation. On the other\nhand, CIN increases due to compensating subsidence from convection and decays\nexponentially over time due to radiation. A critical parameter in our model is\nthe time-mean CIN (CIN*). As CIN* gradually increases, precipitation\ntransitions from a quasi-equilibrium state to a nonlinear oscillation via a\nsupercritical Hopf bifurcation. In the high CIN* limit, our model reduces to\npredator-prey dynamics, with CIN as the predator and precipitation as the prey.\nHere, the nonlinear oscillation's amplitude (maximum precipitation) grows with\nCIN*, and its period increases with the oscillation amplitude. A suite of\ncloud-resolving simulations corroborates these predictions from our low-order\nmodel, highlighting the effect of convective triggering and inhibition in\nregulating precipitation variability.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Mathematics/Dynamical Systems"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}