{"id":"2408.12886","title":"On Uniform Functions on Configuration Spaces of Large Scale Interacting\n  Systems","authors":"Kenichi Bannai and Makiko Sasada","authorsParsed":[["Bannai","Kenichi",""],["Sasada","Makiko",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 07:40:41 GMT"}],"updateDate":"2024-08-26","timestamp":1724398841000,"abstract":"  Stochastic large scale interacting systems can be studied via the\nobservables, i.e. functions on the underlying configuration space. In our\nprevious article, we introduced the concept of uniform functions, which are\nsuitable class of functions on configuration spaces underlying stochastic\nsystems on infinite graphs. An important consequence is the successful\ncharacterization of conserved quantities without introducing the notion of\nstationary distributions. In this article, we further develop the theory of\nuniform functions and construct the theory independent of any choice of a base\nstate. Furthermore, we generalize the notion of interactions given in our\nprevious article to accommodate the case where there are multiple possible\nstate transitions on adjacent vertices. We then prove that if the interaction\nis exchangeable, then any uniform function which gives a global conserved\nquantity can be expressed as a sum of local conserved quantities of the\ninteraction. Contrary to our previous article, we do not need to assume that\nthe interaction is irreducibly quantified. This shows that our theory of\nuniform functions on configuration spaces over infinite graphs with transition\nstructure given by an exchangeable interaction is a natural framework to study\ngeneral stochastic large scale interacting systems. While some of the ideas in\nthis article are based on our previous article, the article is logically\nindependent and self-contained.\n","subjects":["Mathematics/Probability","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WLhHC1UaHvUzRMjCumT8Ox9CCzGcPVT4CLeR8MQa2AU","pdfSize":"1205761"}
