{"id":"2408.15321","title":"Arkenstone -- II. A model for unresolved cool clouds entrained in\n  galactic winds in cosmological simulations","authors":"Matthew C. Smith, Drummond B. Fielding, Greg L. Bryan, Jake S.\n  Bennett, Chang-Goo Kim, Eve C. Ostriker, Rachel S. Somerville","authorsParsed":[["Smith","Matthew C.",""],["Fielding","Drummond B.",""],["Bryan","Greg L.",""],["Bennett","Jake S.",""],["Kim","Chang-Goo",""],["Ostriker","Eve C.",""],["Somerville","Rachel S.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-29","timestamp":1724781601000,"abstract":"  Arkenstone is a new scheme that allows multiphase, stellar feedback-driven\nwinds to be included in coarse resolution cosmological simulations. The\nevolution of galactic winds and their subsequent impact on the circumgalactic\nmedium are altered by exchanges of mass, energy, momentum, and metals between\ntheir component phases. These exchanges are governed by complex, small-scale\nphysical processes that cannot be resolved in cosmological simulations. In this\nsecond presentation paper, we describe Arkenstone's novel cloud particle\napproach for modelling unresolvable cool clouds entrained in hot, fast winds.\nThis general framework allows models of the cloud-wind interaction, derived\nfrom state-of-the-art high-resolution simulations, to be applied in a\nlarge-scale context. In this work, we adopt a cloud evolution model that\ncaptures simultaneous cloud mass loss to and gain from the ambient hot phase\nvia turbulent mixing and radiative cooling, respectively. We demonstrate the\nscheme using non-cosmological idealized simulations of a galaxy with a\nrealistic circumgalactic medium component, using the Arepo code. We show that\nthe ability of a high-specific energy wind component to perform preventative\nfeedback may be limited by heavy loading of cool clouds coupled into it. We\ndemonstrate that the diverging evolution of clouds of initially differing\nmasses leads to a complex velocity field for the cool phase and a cloud mass\nfunction that varies both spatially and temporally in a non-trivial manner.\nThese latter two phenomena can manifest in the simulation because of our choice\nof a Lagrangian discretisation of the cloud population, in contrast to other\nproposed schemes. This is a Learning the Universe publication.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}