{"id":"2408.04104","title":"Hardware-Assisted Virtualization of Neural Processing Units for Cloud\n  Platforms","authors":"Yuqi Xue, Yiqi Liu, Lifeng Nai, Jian Huang","authorsParsed":[["Xue","Yuqi",""],["Liu","Yiqi",""],["Nai","Lifeng",""],["Huang","Jian",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 21:45:01 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 21:01:59 GMT"},{"version":"v3","created":"Fri, 13 Sep 2024 02:48:33 GMT"}],"updateDate":"2024-09-16","timestamp":1723067101000,"abstract":"  Cloud platforms today have been deploying hardware accelerators like neural\nprocessing units (NPUs) for powering machine learning (ML) inference services.\nTo maximize the resource utilization while ensuring reasonable quality of\nservice, a natural approach is to virtualize NPUs for efficient resource\nsharing for multi-tenant ML services. However, virtualizing NPUs for modern\ncloud platforms is not easy. This is not only due to the lack of system\nabstraction support for NPU hardware, but also due to the lack of architectural\nand ISA support for enabling fine-grained dynamic operator scheduling for\nvirtualized NPUs.\n  We present Neu10, a holistic NPU virtualization framework. We investigate\nvirtualization techniques for NPUs across the entire software and hardware\nstack. Neu10 consists of (1) a flexible NPU abstraction called vNPU, which\nenables fine-grained virtualization of the heterogeneous compute units in a\nphysical NPU (pNPU); (2) a vNPU resource allocator that enables pay-as-you-go\ncomputing model and flexible vNPU-to-pNPU mappings for improved resource\nutilization and cost-effectiveness; (3) an ISA extension of modern NPU\narchitecture for facilitating fine-grained tensor operator scheduling for\nmultiple vNPUs. We implement Neu10 based on a production-level NPU simulator.\nOur experiments show that Neu10 improves the throughput of ML inference\nservices by up to 1.4$\\times$ and reduces the tail latency by up to\n4.6$\\times$, while improving the NPU utilization by 1.2$\\times$ on average,\ncompared to state-of-the-art NPU sharing approaches.\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Operating Systems"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}