{"id":"2408.04652","title":"Leveraging Large Language Models with Chain-of-Thought and Prompt\n  Engineering for Traffic Crash Severity Analysis and Inference","authors":"Hao Zhen, Yucheng Shi, Yongcan Huang, Jidong J. Yang, Ninghao Liu","authorsParsed":[["Zhen","Hao",""],["Shi","Yucheng",""],["Huang","Yongcan",""],["Yang","Jidong J.",""],["Liu","Ninghao",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 17:14:10 GMT"}],"updateDate":"2024-08-12","timestamp":1722791650000,"abstract":"  Harnessing the power of Large Language Models (LLMs), this study explores the\nuse of three state-of-the-art LLMs, specifically GPT-3.5-turbo, LLaMA3-8B, and\nLLaMA3-70B, for crash severity inference, framing it as a classification task.\nWe generate textual narratives from original traffic crash tabular data using a\npre-built template infused with domain knowledge. Additionally, we incorporated\nChain-of-Thought (CoT) reasoning to guide the LLMs in analyzing the crash\ncauses and then inferring the severity. This study also examine the impact of\nprompt engineering specifically designed for crash severity inference. The LLMs\nwere tasked with crash severity inference to: (1) evaluate the models'\ncapabilities in crash severity analysis, (2) assess the effectiveness of CoT\nand domain-informed prompt engineering, and (3) examine the reasoning abilities\nwith the CoT framework. Our results showed that LLaMA3-70B consistently\noutperformed the other models, particularly in zero-shot settings. The CoT and\nPrompt Engineering techniques significantly enhanced performance, improving\nlogical reasoning and addressing alignment issues. Notably, the CoT offers\nvaluable insights into LLMs' reasoning processes, unleashing their capacity to\nconsider diverse factors such as environmental conditions, driver behavior, and\nvehicle characteristics in severity analysis and inference.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}