{"id":"2408.13898","title":"Evaluating Attribute Comprehension in Large Vision-Language Models","authors":"Haiwen Zhang, Zixi Yang, Yuanzhi Liu, Xinran Wang, Zheqi He, Kongming\n  Liang, and Zhanyu Ma","authorsParsed":[["Zhang","Haiwen",""],["Yang","Zixi",""],["Liu","Yuanzhi",""],["Wang","Xinran",""],["He","Zheqi",""],["Liang","Kongming",""],["Ma","Zhanyu",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 17:42:05 GMT"}],"updateDate":"2024-08-27","timestamp":1724607725000,"abstract":"  Currently, large vision-language models have gained promising progress on\nmany downstream tasks. However, they still suffer many challenges in\nfine-grained visual understanding tasks, such as object attribute\ncomprehension. Besides, there have been growing efforts on the evaluations of\nlarge vision-language models, but lack of in-depth study of attribute\ncomprehension and the visual language fine-tuning process. In this paper, we\npropose to evaluate the attribute comprehension ability of large\nvision-language models from two perspectives: attribute recognition and\nattribute hierarchy understanding. We evaluate three vision-language\ninteractions, including visual question answering, image-text matching, and\nimage-text cosine similarity. Furthermore, we explore the factors affecting\nattribute comprehension during fine-tuning. Through a series of quantitative\nand qualitative experiments, we introduce three main findings: (1) Large\nvision-language models possess good attribute recognition ability, but their\nhierarchical understanding ability is relatively limited. (2) Compared to ITC,\nITM exhibits superior capability in capturing finer details, making it more\nsuitable for attribute understanding tasks. (3) The attribute information in\nthe captions used for fine-tuning plays a crucial role in attribute\nunderstanding. We hope this work can help guide future progress in fine-grained\nvisual understanding of large vision-language models.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}