{"id":"2408.16658","title":"Symmetry constraints on topological invariants and irreducible band\n  representations","authors":"Jing Zhang","authorsParsed":[["Zhang","Jing",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 16:01:59 GMT"},{"version":"v2","created":"Tue, 10 Sep 2024 14:12:43 GMT"}],"updateDate":"2024-09-11","timestamp":1724947319000,"abstract":"  EBR is considered the building block in TQC and fundamental concept in SI\nmethods. One of the hypophysis is that a fully occupied EBR has zero\nBerry-Wilczek-Zee phase and those occupied corresponds to trivial topology.\nAssociated with it are the concepts of atomic limit and equivalence between\nBRs. In this manuscript, an explicit link between the BWZ phase of connected\nbands and that of its EBR or irreducible band representation (IBR) basis is\nestablished. When gapped system occurs under the TB model, the relation between\nthe BWZ phase of a set of connected bands and its BR basis only persist if the\nlater are IBRs. Thus the BWZ phase can be evaluated in terms of the IBRs.\nEquivalent segments of path integral of BWZ connection with respect to IBRs are\nestablished as representation of the space group and selection rule for\ncorresponding BWZ phase established where possible. The occurrence of IBRs is\nrooted in real space symmetry but dependent on dynamic interaction and band\ntopology. Three gapped systems in honeycomb lattices are discussed. Two\nspin-less cases are shown to be topologically trivial, whereas the selection\nrule cannot be developed for the spin-full pz orbital as in graphene. Two\nnecessary conditions for topologically trivial phase are established, namely\n1.Connected bands having the same closed set of IBR basis for all k and, 2.The\nreduced tensor element for the path integral of BWZ connection for such basis\nis symmetry forbidden due to contractable close loop having zero BWZ phase.\nThus the IBRs are the building block of topologically trivial phase and\nsymmetry constraint on BWZ phase are obtained through IBRs and selection rules\nvia Wigner-Eckart theorem. Some examples demonstrate that the basic hypothesis\nof SI method is false. The analysis here advocate a paradigm shift from EBR to\nIBR as building block of topologically trivial phase.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Other Condensed Matter"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}