{"id":"2408.12443","title":"A Riemannian Approach for Spatiotemporal Analysis and Generation of 4D\n  Tree-shaped Structures","authors":"Tahmina Khanam, Hamid Laga, Mohammed Bennamoun, Guanjin Wang, Ferdous\n  Sohel, Farid Boussaid, Guan Wang and Anuj Srivastava","authorsParsed":[["Khanam","Tahmina",""],["Laga","Hamid",""],["Bennamoun","Mohammed",""],["Wang","Guanjin",""],["Sohel","Ferdous",""],["Boussaid","Farid",""],["Wang","Guan",""],["Srivastava","Anuj",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 14:39:30 GMT"}],"updateDate":"2024-08-23","timestamp":1724337570000,"abstract":"  We propose the first comprehensive approach for modeling and analyzing the\nspatiotemporal shape variability in tree-like 4D objects, i.e., 3D objects\nwhose shapes bend, stretch, and change in their branching structure over time\nas they deform, grow, and interact with their environment. Our key contribution\nis the representation of tree-like 3D shapes using Square Root Velocity\nFunction Trees (SRVFT). By solving the spatial registration in the SRVFT space,\nwhich is equipped with an L2 metric, 4D tree-shaped structures become\ntime-parameterized trajectories in this space. This reduces the problem of\nmodeling and analyzing 4D tree-like shapes to that of modeling and analyzing\nelastic trajectories in the SRVFT space, where elasticity refers to time\nwarping. In this paper, we propose a novel mathematical representation of the\nshape space of such trajectories, a Riemannian metric on that space, and\ncomputational tools for fast and accurate spatiotemporal registration and\ngeodesics computation between 4D tree-shaped structures. Leveraging these\nbuilding blocks, we develop a full framework for modelling the spatiotemporal\nvariability using statistical models and generating novel 4D tree-like\nstructures from a set of exemplars. We demonstrate and validate the proposed\nframework using real 4D plant data.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"JpE-yO7dreQlITmrm6VEZtGKiBsSPlTryPgP8VheJXk","pdfSize":"6770838"}
