{"id":"2408.12029","title":"Federated Diabetes Prediction in Canadian Adults Using Real-world\n  Cross-Province Primary Care Data","authors":"Guojun Tang, Jason E. Black, Tyler S. Williamson, Steve H. Drew","authorsParsed":[["Tang","Guojun",""],["Black","Jason E.",""],["Williamson","Tyler S.",""],["Drew","Steve H.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 22:47:21 GMT"}],"updateDate":"2024-08-23","timestamp":1724280441000,"abstract":"  Integrating Electronic Health Records (EHR) and the application of machine\nlearning present opportunities for enhancing the accuracy and accessibility of\ndata-driven diabetes prediction. In particular, developing data-driven machine\nlearning models can provide early identification of patients with high risk for\ndiabetes, potentially leading to more effective therapeutic strategies and\nreduced healthcare costs. However, regulation restrictions create barriers to\ndeveloping centralized predictive models. This paper addresses the challenges\nby introducing a federated learning approach, which amalgamates predictive\nmodels without centralized data storage and processing, thus avoiding privacy\nissues. This marks the first application of federated learning to predict\ndiabetes using real clinical datasets in Canada extracted from the Canadian\nPrimary Care Sentinel Surveillance Network (CPCSSN) without crossprovince\npatient data sharing. We address class-imbalance issues through downsampling\ntechniques and compare federated learning performance against province-based\nand centralized models. Experimental results show that the federated MLP model\npresents a similar or higher performance compared to the model trained with the\ncentralized approach. However, the federated logistic regression model showed\ninferior performance compared to its centralized peer.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}