{"id":"2408.04747","title":"Hybrid Quantum-Classical Neural Networks for Downlink Beamforming\n  Optimization","authors":"Juping Zhang, Gan Zheng, Toshiaki Koike-Akino, Kai-Kit Wong, and\n  Fraser Burton","authorsParsed":[["Zhang","Juping",""],["Zheng","Gan",""],["Koike-Akino","Toshiaki",""],["Wong","Kai-Kit",""],["Burton","Fraser",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 20:14:39 GMT"}],"updateDate":"2024-08-12","timestamp":1723148079000,"abstract":"  This paper investigates quantum machine learning to optimize the beamforming\nin a multiuser multiple-input single-output downlink system. We aim to combine\nthe power of quantum neural networks and the success of classical deep neural\nnetworks to enhance the learning performance. Specifically, we propose two\nhybrid quantum-classical neural networks to maximize the sum rate of a downlink\nsystem. The first one proposes a quantum neural network employing parameterized\nquantum circuits that follows a classical convolutional neural network. The\nclassical neural network can be jointly trained with the quantum neural network\nor pre-trained leading to a fine-tuning transfer learning method. The second\none designs a quantum convolutional neural network to better extract features\nfollowed by a classical deep neural network. Our results demonstrate the\nfeasibility of the proposed hybrid neural networks, and reveal that the first\nmethod can achieve similar sum rate performance compared to a benchmark\nclassical neural network with significantly less training parameters; while the\nsecond method can achieve higher sum rate especially in presence of many users\nstill with less training parameters. The robustness of the proposed methods is\nverified using both software simulators and hardware emulators considering\nnoisy intermediate-scale quantum devices.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0nSlGNdw6X-gVZhKn52gApDbs5-UwrNIFve79cB4omo","pdfSize":"620853"}
