{"id":"2408.14233","title":"Curvature of Quantum Evolutions for Qubits in Time-Dependent Magnetic\n  Fields","authors":"Carlo Cafaro, Leonardo Rossetti, Paul M. Alsing","authorsParsed":[["Cafaro","Carlo",""],["Rossetti","Leonardo",""],["Alsing","Paul M.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 12:49:28 GMT"}],"updateDate":"2024-08-27","timestamp":1724676568000,"abstract":"  In the geometry of quantum-mechanical processes, the time-varying curvature\ncoefficient of a quantum evolution is specified by the magnitude squared of the\ncovariant derivative of the tangent vector to the state vector. In particular,\nthe curvature coefficient measures the bending of the quantum curve traced out\nby a parallel-transported pure quantum state that evolves in a unitary fashion\nunder a nonstationary Hamiltonian that specifies the Schr\\\"odinger evolution\nequation. In this paper, we present an exact analytical expression of the\ncurvature of a quantum evolution for a two-level quantum system immersed in a\ntime-dependent magnetic field. Specifically, we study the dynamics generated by\na two-parameter nonstationary Hermitian Hamiltonian with unit speed efficiency.\nThe two parameters specify the constant temporal rates of change of the polar\nand azimuthal angles used in the Bloch sphere representation of the evolving\npure state. To better grasp the physical significance of the curvature\ncoefficient, showing that the quantum curve is nongeodesic since the geodesic\nefficiency of the quantum evolution is strictly less than one and tuning the\ntwo Hamiltonian parameters, we compare the temporal behavior of the curvature\ncoefficient with that of the speed and the acceleration of the evolution in\nprojective Hilbert space. Furthermore, we compare the temporal profile of the\ncurvature coefficient with that of the square of the ratio between the parallel\nand transverse magnetic field intensities. Finally, we discuss the challenges\nin extending our geometric approach to higher-dimensional quantum systems that\nevolve unitarily under an arbitrary time-dependent Hermitian Hamiltonian.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}