{"id":"2408.12904","title":"SecDOAR: A Software Reference Architecture for Security Data\n  Orchestration, Analysis and Reporting","authors":"Muhammad Aufeef Chauhan, Muhammad Ali Babar, Fethi Rabhi","authorsParsed":[["Chauhan","Muhammad Aufeef",""],["Babar","Muhammad Ali",""],["Rabhi","Fethi",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 08:11:27 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 01:34:17 GMT"}],"updateDate":"2024-08-27","timestamp":1724400687000,"abstract":"  A Software Reference Architecture (SRA) is a useful tool for standardising\nexisting architectures in a specific domain and facilitating concrete\narchitecture design, development and evaluation by instantiating SRA and using\nSRA as a benchmark for the development of new systems. In this paper, we have\npresented an SRA for Security Data Orchestration, Analysis and Reporting\n(SecDOAR) to provide standardisation of security data platforms that can\nfacilitate the integration of security orchestration, analysis and reporting\ntools for security data. The SecDOAR SRA has been designed by leveraging\nexisting scientific literature and security data standards. We have documented\nSecDOAR SRA in terms of design methodology, meta-models to relate to different\nconcepts in the security data architecture, and details on different elements\nand components of the SRA. We have evaluated SecDOAR SRA for its effectiveness\nand completeness by comparing it with existing commercial solutions. We have\ndemonstrated the feasibility of the proposed SecDOAR SRA by instantiating it as\na prototype platform to support security orchestration, analysis and reporting\nfor a selected set of tools. The proposed SecDOAR SRA consists of meta-models\nfor security data, security events and security data management processes as\nwell as security metrics and corresponding measurement schemes, a security data\nintegration model, and a description of SecDOAR SRA components. The proposed\nSecDOAR SRA can be used by researchers and practitioners as a structured\napproach for designing and implementing cybersecurity monitoring, analysis and\nreporting systems in various domains.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}