{"id":"2408.07785","title":"NeuroPapyri: A Deep Attention Embedding Network for Handwritten Papyri\n  Retrieval","authors":"Giuseppe De Gregorio, Simon Perrin, Rodrigo C. G. Pena, Isabelle\n  Marthot-Santaniello, Harold Mouch\\`ere","authorsParsed":[["De Gregorio","Giuseppe",""],["Perrin","Simon",""],["Pena","Rodrigo C. G.",""],["Marthot-Santaniello","Isabelle",""],["Mouchère","Harold",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 19:36:54 GMT"}],"updateDate":"2024-08-16","timestamp":1723664214000,"abstract":"  The intersection of computer vision and machine learning has emerged as a\npromising avenue for advancing historical research, facilitating a more\nprofound exploration of our past. However, the application of machine learning\napproaches in historical palaeography is often met with criticism due to their\nperceived ``black box'' nature. In response to this challenge, we introduce\nNeuroPapyri, an innovative deep learning-based model specifically designed for\nthe analysis of images containing ancient Greek papyri. To address concerns\nrelated to transparency and interpretability, the model incorporates an\nattention mechanism. This attention mechanism not only enhances the model's\nperformance but also provides a visual representation of the image regions that\nsignificantly contribute to the decision-making process. Specifically\ncalibrated for processing images of papyrus documents with lines of handwritten\ntext, the model utilizes individual attention maps to inform the presence or\nabsence of specific characters in the input image. This paper presents the\nNeuroPapyri model, including its architecture and training methodology. Results\nfrom the evaluation demonstrate NeuroPapyri's efficacy in document retrieval,\nshowcasing its potential to advance the analysis of historical manuscripts.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Digital Libraries"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NlDC0csXykSn9-J0_YoX7opv6h_OoK9JpHp6gWDlbG4","pdfSize":"5140501"}
