{"id":"2408.01082","title":"Topological Casimir effect in models with helical compact dimensions","authors":"R.M. Avagyan, A.A. Saharian, D.H. Simonyan, G.H. Harutyunyan","authorsParsed":[["Avagyan","R. M.",""],["Saharian","A. A.",""],["Simonyan","D. H.",""],["Harutyunyan","G. H.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 07:59:06 GMT"}],"updateDate":"2024-08-05","timestamp":1722585546000,"abstract":"  We investigate the influence of the helical compactification of spatial\ndimension on the local properties of the vacuum state for a charged scalar\nfield with general curvature coupling parameter. A general background geometry\nis considered with rotational symmetry in the subspace with the coordinates\nappearing in the helical periodicity condition. It is shown that by a\ncoordinate transformation the problem is reduced to the problem with standard\nquasiperiodicity condition in the same local geometry and with the effective\ncompactification radius determined by the length of the compact dimension and\nthe helicity parameter. As an application of the general procedure we have\nconsidered locally de Sitter spacetime with a helical compact dimension. By\nusing the Hadamard function for the Bunch-Davies vacuum state, the vacuum\nexpectation values of the field squared, current density, and energy-momentum\ntensor are studied. The topological contributions are explicitly separated and\ntheir asymptotics are described at early and late stages of cosmological\nexpansion. An important difference, compared to the problem with quasiperiodic\nconditions, is the appearance of the nonzero off-diagonal component of the\nenergy-momentum tensor and of the component of the current density along the\nuncompact dimension.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TFbePi7xX99kznT1LpI6JnNWAgf_6jFNU9IX76S4SoE","pdfSize":"173173","txDigest":"7bp3Tc3dyWuqDd3gzERQfP6sDXH9SA5ug1S7dCVijznj","endEpoch":"1","status":"CERTIFIED"}
