{"id":"2408.05099","title":"Lithography-free patterning of chalcogenide materials for integrated\n  photonic devices","authors":"Zhen Hu, Yuru Li, Yan Li, Shunyu Yao, Hongfei Chen, Tao Zhang,\n  Zhaohuan Ao, Zhaohui Li","authorsParsed":[["Hu","Zhen",""],["Li","Yuru",""],["Li","Yan",""],["Yao","Shunyu",""],["Chen","Hongfei",""],["Zhang","Tao",""],["Ao","Zhaohuan",""],["Li","Zhaohui",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 14:39:23 GMT"}],"updateDate":"2024-08-12","timestamp":1723214363000,"abstract":"  Chalcogenide material-based integrated photonic devices have garnered\nwidespread attention due to their unique wideband transparency. Despite their\nrecognized CMOS compatibility, the fabrication of these devices relies\npredominantly on lithography techniques. However, chalcogenide thin films are\nhighly susceptible to oxidation, necessitating customized process flows and\ncomplex protective measures during lithography. These requirements are hardly\ncompatible with current commercial CMOS manufacturing platforms designed for\nsilicon photonics, significantly limiting the practical applications of\nchalcogenide photonic devices. In this work, we ingeniously exploit the ease of\noxidation of chalcogenide materials, presenting a novel laser-induced localized\noxidation technique for spatial patterning on chalcogenide thin films, enabling\nconcise lithography-free fabrication of chalcogenide integrated photonic\ndevices. Using Sb2S3 as an example, we experimentally demonstrate localized\nmulti-level oxidation with a sizable overall refractive index contrast of 0.7\nat near-infrared, featuring a high spatial resolution of 0.6 um. Based on this\ntechnique, multiple integrated photonic devices are demonstrated, showing\nversatile functionalities, including color printing at visible and\nmetasurface-based spatial light modulation at near-infrared regions. Leveraging\nthe inherent phase-change property of Sb2S3, an active Fresnel zone plate,\nenabling switchable beam focusing, is further demonstrated, indicating the\nfeasibility of concise fabrication of active photonic devices. Our work offers\na brand-new modulation dimension for chalcogenide materials and provides a\nsignificantly simplified approach for realizing chalcogenide-integrated\nphotonic devices.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}