{"id":"2408.01278","title":"Pressure-tuned magnetism and conductivity in pyrochlore iridates\n  Lu2Ir2O7 and Er2Ir2O7","authors":"Daniel Sta\\v{s}ko, Petr Proschek, Ji\\v{r}\\'i Prchal, Milan Klicpera","authorsParsed":[["Staško","Daniel",""],["Proschek","Petr",""],["Prchal","Jiří",""],["Klicpera","Milan",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 14:03:58 GMT"}],"updateDate":"2024-08-05","timestamp":1722607438000,"abstract":"  A2Ir2O7 iridates were proven to crystallise in the geometrically frustrated\npyrochlore structure, which remains stable upon rare-earth cation substitution,\ntemperature variation, and external pressure application. However, the change\nof interatomic distances and local distortions in the lattice frequently leads\nto complex electronic properties. The low-temperature behaviour in light-A\niridates has been thoroughly investigated, including its evolution with\npressure. The present pressure study reports the electrical transport and\nmagnetotransport properties in heavy rare-earth Lu2Ir2O7 and Er2Ir2O7. Both\ncompounds reveal a semiconductor-to-insulator transition induced by the\nantiferromagnetic ordering of the all-in-all-out (AIAO) type in the Ir\nsublattice. The transition monotonously shifts to a higher temperature under\napplied pressure by approximately 20 K at 3 GPa. As the transition in\nresistivity originates in the antiferromagnetic order, the latter is expected\nto be enhanced with the applied pressure as well. Upon cooling the compound in\na magnetic field, the AIAO/AOAI domain structure with non-zero net magnetic\nmoment is formed, mirroring itself in an asymmetric term in the\nmagnetoresistance of Lu2Ir2O7. The application of pressure then enhances the\nasymmetric term. The same behaviour is proposed for the whole heavy rare-earth\nA2Ir2O7 series (A = Gd - Lu), although with magnetoresistance features masked\nsignificantly by a stronger response of magnetic A cations.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"z_b6hjfFByF4g1n0v8xVqLBgH90LswyepV-9loqqhj0","pdfSize":"598586"}
