{"id":"2408.13003","title":"BoostTrack++: using tracklet information to detect more objects in\n  multiple object tracking","authors":"Vuka\\v{s}in Stanojevi\\'c and Branimir Todorovi\\'c","authorsParsed":[["Stanojević","Vukašin",""],["Todorović","Branimir",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 11:44:21 GMT"}],"updateDate":"2024-08-26","timestamp":1724413461000,"abstract":"  Multiple object tracking (MOT) depends heavily on selection of true positive\ndetected bounding boxes. However, this aspect of the problem is mostly\noverlooked or mitigated by employing two-stage association and utilizing low\nconfidence detections in the second stage. Recently proposed BoostTrack\nattempts to avoid the drawbacks of multiple stage association approach and use\nlow-confidence detections by applying detection confidence boosting. In this\npaper, we identify the limitations of the confidence boost used in BoostTrack\nand propose a method to improve its performance. To construct a richer\nsimilarity measure and enable a better selection of true positive detections,\nwe propose to use a combination of shape, Mahalanobis distance and novel soft\nBIoU similarity. We propose a soft detection confidence boost technique which\ncalculates new confidence scores based on the similarity measure and the\nprevious confidence scores, and we introduce varying similarity threshold to\naccount for lower similarity measure between detections and tracklets which are\nnot regularly updated. The proposed additions are mutually independent and can\nbe used in any MOT algorithm.\n  Combined with the BoostTrack+ baseline, our method achieves near state of the\nart results on the MOT17 dataset and new state of the art HOTA and IDF1 scores\non the MOT20 dataset.\n  The source code is available at:\nhttps://github.com/vukasin-stanojevic/BoostTrack .\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FHBH4TC1wzvm2nMlxIZNtegaD8jlqR9q1DDQRSWFpu8","pdfSize":"499937"}
