{"id":"2408.12101","title":"Protostellar Disk Formation Regimes: Angular Momentum Conservation\n  versus Magnetic Braking","authors":"Hsi-Wei Yen and Yueh-Ning Lee","authorsParsed":[["Yen","Hsi-Wei",""],["Lee","Yueh-Ning",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 03:30:59 GMT"}],"updateDate":"2024-08-23","timestamp":1724297459000,"abstract":"  Protostellar disks around young protostars exhibit diverse properties, with\ntheir radii ranging from less than ten to several hundred au. To investigate\nthe mechanisms shaping this disk radius distribution, we compiled a sample of\n27 Class 0 and I single protostars with resolved disks and dynamically\ndetermined protostellar masses from the literature. Additionally, we derived\nthe radial profile of the rotational to gravitational energy ratio in dense\ncores from the observed specific angular momentum profiles in the literature.\nUsing these observed protostellar masses and rotational energy profile, we\ncomputed theoretical disk radii from the hydrodynamic and non-ideal\nmagnetohydrodynamic (MHD) models in Lee et al. (2021, 2024) and generated\nsynthetic samples to compare with the observations. In our theoretical model,\nthe disk radii are determined by hydrodynamics when the central protostar+disk\nmass is low. After the protostars and disks grow and exceed certain masses, the\ndisk radii become regulated by magnetic braking and non-ideal MHD effects. The\nsynthetic disk radius distribution from this model matches well with the\nobservations. This result suggests that hydrodynamics and non-ideal MHD can be\ndominant in different mass regimes (or evolutionary stages) depending on the\nrotational energy and protostar+disk mass. This model naturally explains the\nrarity of large (>100 au) disks and the presence of very small (<10 au) disks.\nIt also predicts that the majority of protostellar disks have radii of a few\ntens of au, as observed.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}