{"id":"2408.12920","title":"Cylindrical Cavity Expansion: A Novel Method for Characterizing the\n  Mechanical Properties of Soft Materials","authors":"Jian Li, Zihao Xie, Hannah Varner, Chockalingam Senthilnathan, Tal\n  Cohen","authorsParsed":[["Li","Jian",""],["Xie","Zihao",""],["Varner","Hannah",""],["Senthilnathan","Chockalingam",""],["Cohen","Tal",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 08:52:32 GMT"},{"version":"v2","created":"Tue, 17 Sep 2024 03:21:49 GMT"}],"updateDate":"2024-09-18","timestamp":1724403152000,"abstract":"  The low elastic modulus of soft materials, combined with geometric\nnonlinearity and rate dependence, presents significant challenges in the\ncharacterization of their mechanical response. We introduce a novel method for\nmeasuring the mechanical properties of soft materials under large deformations\nvia cylindrical cavity expansion. In this method, a cylindrical cavity is\nfabricated in the material and expanded by volume-controlled injection of an\nincompressible fluid with simultaneous measurement of the applied pressure at\nthe cavity wall. The relationship between applied pressure and deformation at\nthe cavity wall is then employed to characterize the nonlinear mechanical\nproperties. We demonstrate the feasibility of the proposed method and validate\nit by measuring the mechanical properties of synthetic polydimethylsiloxane\n(PDMS) and comparing with reported values in the literature. Results indicate\nthat the cylindrical cavitation method effectively captures the response of\nPDMS over a wide range of stiffness (shear modulus ranging from 5 kPa to 300\nkPa) and exhibit high repeatability. The proposed method overcomes limitations\nin characterization of ultra-soft materials using traditional testing methods,\nsuch as challenges with fabrication and clamping in unaxial tension testing and\nfriction and adhesion effects in compression and indentation testing, thus\nenabling accurate and precise characterization. It also offers improved\naccuracy and repeatability over other needle induced cavity expansion methods\ndue to precise control over the initial cavity dimension and shape at the cost\nof increased invasiveness of testing.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Soft Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}