{"id":"2408.05321","title":"A Recurrent YOLOv8-based framework for Event-Based Object Detection","authors":"Diego A. Silva, Kamilya Smagulova, Ahmed Elsheikh, Mohammed E. Fouda,\n  Ahmed M. Eltawil","authorsParsed":[["Silva","Diego A.",""],["Smagulova","Kamilya",""],["Elsheikh","Ahmed",""],["Fouda","Mohammed E.",""],["Eltawil","Ahmed M.",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 20:00:16 GMT"}],"updateDate":"2024-08-13","timestamp":1723233616000,"abstract":"  Object detection is crucial in various cutting-edge applications, such as\nautonomous vehicles and advanced robotics systems, primarily relying on data\nfrom conventional frame-based RGB sensors. However, these sensors often\nstruggle with issues like motion blur and poor performance in challenging\nlighting conditions. In response to these challenges, event-based cameras have\nemerged as an innovative paradigm. These cameras, mimicking the human eye,\ndemonstrate superior performance in environments with fast motion and extreme\nlighting conditions while consuming less power. This study introduces ReYOLOv8,\nan advanced object detection framework that enhances a leading frame-based\ndetection system with spatiotemporal modeling capabilities. We implemented a\nlow-latency, memory-efficient method for encoding event data to boost the\nsystem's performance. We also developed a novel data augmentation technique\ntailored to leverage the unique attributes of event data, thus improving\ndetection accuracy. Our models outperformed all comparable approaches in the\nGEN1 dataset, focusing on automotive applications, achieving mean Average\nPrecision (mAP) improvements of 5%, 2.8%, and 2.5% across nano, small, and\nmedium scales, respectively.These enhancements were achieved while reducing the\nnumber of trainable parameters by an average of 4.43% and maintaining real-time\nprocessing speeds between 9.2ms and 15.5ms. On the PEDRo dataset, which targets\nrobotics applications, our models showed mAP improvements ranging from 9% to\n18%, with 14.5x and 3.8x smaller models and an average speed enhancement of\n1.67x.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}