{"id":"2408.14814","title":"Partition Detection in Byzantine Networks","authors":"Y\\'erom-David Bromberg (IRISA, UR), J\\'er\\'emie Decouchant (TU Delft),\n  Manon Sourisseau (IRISA, UR), Fran\\c{c}ois Ta\\\"iani (IRISA, UR)","authorsParsed":[["Bromberg","Yérom-David","","IRISA, UR"],["Decouchant","Jérémie","","TU Delft"],["Sourisseau","Manon","","IRISA, UR"],["Taïani","François","","IRISA, UR"]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 06:54:36 GMT"}],"updateDate":"2024-08-28","timestamp":1724741676000,"abstract":"  Detecting and handling network partitions is a fundamental requirement of\ndistributed systems. Although existing partition detection methods in arbitrary\ngraphs tolerate unreliable networks, they either assume that all nodes are\ncorrect or that a limited number of nodes might crash. In particular, Byzantine\nbehaviors are out of the scope of these algorithms despite Byzantine fault\ntolerance being an active research topic for important problems such as\nconsensus. Moreover, Byzantinetolerant protocols, such as broadcast or\nconsensus, always rely on the assumption of connected networks. This paper\naddresses the problem of detecting partition in Byzantine networks (without\nconnectivity assumption). We present a novel algorithm, which we call NECTAR,\nthat safely detects partitioned and possibly partitionable networks and prove\nits correctness. NECTAR allows all correct nodes to detect whether a network\ncould suffer from Byzantine nodes. We evaluate NECTAR's performance and compare\nit to two existing baselines using up to 100 nodes running real code, on\nvarious realistic topologies. Our results confirm that NECTAR maintains a 100%\naccuracy while the accuracy of the various existing baselines decreases by at\nleast 40% as soon as one participant is Byzantine. Although NECTAR's network\ncost increases with the number of nodes and decreases with the network's\ndiameter, it does not go above around 500KB in the worst cases.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}