{"id":"2408.13051","title":"Eliminating Surface Oxides of Superconducting Circuits with Noble Metal\n  Encapsulation","authors":"Ray D. Chang, Nana Shumiya, Russell A. McLellan, Yifan Zhang, Matthew\n  P. Bland, Faranak Bahrami, Junsik Mun, Chenyu Zhou, Kim Kisslinger, Guangming\n  Cheng, Alexander C. Pakpour-Tabrizi, Nan Yao, Yimei Zhu, Mingzhao Liu, Robert\n  J. Cava, Sarang Gopalakrishnan, Andrew A. Houck, and Nathalie P. de Leon","authorsParsed":[["Chang","Ray D.",""],["Shumiya","Nana",""],["McLellan","Russell A.",""],["Zhang","Yifan",""],["Bland","Matthew P.",""],["Bahrami","Faranak",""],["Mun","Junsik",""],["Zhou","Chenyu",""],["Kisslinger","Kim",""],["Cheng","Guangming",""],["Pakpour-Tabrizi","Alexander C.",""],["Yao","Nan",""],["Zhu","Yimei",""],["Liu","Mingzhao",""],["Cava","Robert J.",""],["Gopalakrishnan","Sarang",""],["Houck","Andrew A.",""],["de Leon","Nathalie P.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 13:16:09 GMT"}],"updateDate":"2024-08-26","timestamp":1724418969000,"abstract":"  The lifetime of superconducting qubits is limited by dielectric loss, and a\nmajor source of dielectric loss is the native oxide present at the surface of\nthe superconducting metal. Specifically, tantalum-based superconducting qubits\nhave been demonstrated with record lifetimes, but a major source of loss is the\npresence of two-level systems (TLSs) in the surface tantalum oxide. Here, we\ndemonstrate a strategy for avoiding oxide formation by encapsulating the\ntantalum with noble metals that do not form native oxide. By depositing a few\nnanometers of Au or AuPd alloy before breaking vacuum, we completely suppress\ntantalum oxide formation. Microwave loss measurements of superconducting\nresonators reveal that the noble metal is proximitized, with a superconducting\ngap over 80% of the bare tantalum at thicknesses where the oxide is fully\nsuppressed. We find that losses in resonators fabricated by subtractive etching\nare dominated by oxides on the sidewalls, suggesting total surface\nencapsulation by additive fabrication as a promising strategy for eliminating\nsurface oxide TLS loss in superconducting qubits.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Materials Science","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}