{"id":"2408.10237","title":"Smart Acoustic Lining for UHBR Technologies Engine Part 1: design of an\n  electroacoustic liner and experimental characterization under flow in\n  rectangular cross-section ducts","authors":"E. De Bono, M. Collet, K. Billon, E. Salze, H. Lissek, M. Volery, M.\n  Ouisse, and J. Mardjono","authorsParsed":[["De Bono","E.",""],["Collet","M.",""],["Billon","K.",""],["Salze","E.",""],["Lissek","H.",""],["Volery","M.",""],["Ouisse","M.",""],["Mardjono","J.",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 16:15:49 GMT"}],"updateDate":"2024-08-21","timestamp":1722788149000,"abstract":"  The new generation of Ultra-High-By-Pass-Ratio (UHBR) turbofan engine while\nconsiderably reducing fuel consumption, threatens higher noise levels at low\nfrequencies because of its larger diameter, lower number of blades and\nrotational speed. This is accompanied by a shorter nacelle, leaving less\navailable space for acoustic treatments. In this context, a progress in the\nliner technology is highly demanded, prospecting alternative solutions to\nclassic liners. The SALUTE H2020 project has taken up this challenge, proposing\nelectro-active acoustic liners, made up of loudspeakers (actuators) and\nmicrophones (sensors). The electro-active means allow to program the surface\nimpedance on the electroacoustic liner, but also to conceive alternative\nboundary laws. Test-rigs of gradually increasing complexities have allowed to\nraise the Technology Readiness Level (TRL) up to 3-4. In this first part, we\ndescribe the control laws employed in the experimental campaigns, and present\nthe scattering performances in rectangular waveguides with monomodal guided\npropagation. These results have assessed the isolation capabilities, stability\nand robustness of such programmable boundary technology, allowing to gain\nconfidence for the successive implementation in a scaled turbofan test-rig.\n","subjects":["Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}