{"id":"2408.05559","title":"Influence of bovines and rodents in the spread of schistosomiasis across\n  the ricefield-lakescape of Lake Mainit, Philippines: An Optimal Control Study","authors":"J.P. Arcede, B. Doungsavanhb, L.A. Esta\\~no, J.C. Jumawan, J.H.\n  Jumawan, Y. Mammeri","authorsParsed":[["Arcede","J. P.",""],["Doungsavanhb","B.",""],["Estaño","L. A.",""],["Jumawan","J. C.",""],["Jumawan","J. H.",""],["Mammeri","Y.",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 13:52:07 GMT"}],"updateDate":"2024-08-13","timestamp":1723297927000,"abstract":"  Schistosomiasis remains a persistent challenge in tropical freshwater\necosystems, necessitating the development of refined control strategies.\nBovines, especially water buffaloes, are commonly used in traditional farming\npractices across rural areas of the Philippines. Bovines, however, are the\nbiggest reservoir hosts for schistosome eggs, which contribute to the active\ntransmission cycle of schistosomiasis in rice fields. We propose a mathematical\nmodel to analyze schistosomiasis dynamics in rice fields near the Lake Mainit\nin the Philippines, an area known for endemic transmission of schistosomiasis,\nfocusing on human, bovine, and snail populations. Rodents, although considered,\nwere not directly included in the control strategies. Grounded in field data,\nthe model, built on a system of nonlinear ordinary differential equations,\nenabled us to derive the basic reproduction number and assess various\nintervention strategies. The simulation of optimal control scenarios,\nincorporating chemotherapy, mollusciciding, and mechanical methods, provides a\ncomparative analysis of their efficacies. The results indicated that the\nintegrated control strategies markedly reduced the prevalence of\nschistosomiasis. This study provides insights into optimal control strategies\nthat are vital for policymakers to design effective, sustainable\nschistosomiasis control programs, underscored by the necessity to include\nbovine populations in treatment regimens.\n","subjects":["Mathematics/Optimization and Control","Quantitative Biology/Populations and Evolution"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}