{"id":"2408.09011","title":"Chaotic Dynamics in a Galactic Multipolar Halo with a Compact Primary","authors":"Yeasin Ali and Suparna Roychowdhury","authorsParsed":[["Ali","Yeasin",""],["Roychowdhury","Suparna",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 20:32:30 GMT"}],"updateDate":"2024-08-20","timestamp":1723840350000,"abstract":"  Observational evidence strongly supports the existence of a Super Massive\nBlack Hole (SMBH) at the Galactic center, surrounded by dense stellar clusters.\nModeling galactic centers with intricate structures like shells and rings pose\nchallenges, prompting the use of simplified models such as a spherical monopole\npotential with a multipolar halo mass distribution. This approach, employing a\nmultipolar expansion model, provides versatility for numerical analyses,\nrevealing the complex dynamics of stars in this region. Pseudo-Potentials like\nPaczynsky-Wiita and Artemova-Bjornsson-Novikov are utilized to simulate the\nimpacts of strong gravity from non-rotating and rotating compact objects\nrespectively, elucidating their influence on stellar dynamics. Chaos naturally\narises due to non-central forces, visualized using the Poincar\\'e section\ntechnique. Of particular importance is the utilization of the Smaller Alignment\nIndex (SALI), a powerful nonlinear dynamical tool, which categorizes particle\norbits as escaping, regular, sticky, or chaotic. We exhaustively examine all\ncombinations of multipolar moments up to the octupolar term along with spin\nusing this tool, which had not been studied earlier. SALI provides a\nstraightforward yet efficient method for assessing the interplay between the\nsystem's different multipolar moments, their combinations, and spin. Thus, our\nfindings offer insights into the dynamics of compact objects enshrouded in a\nhalo mass distribution and lay the groundwork for understanding complex\nastrophysical systems in galactic centers.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Nonlinear Sciences/Chaotic Dynamics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}