{"id":"2408.05683","title":"Single Image Dehazing Using Scene Depth Ordering","authors":"Pengyang Ling, Huaian Chen, Xiao Tan, Yimeng Shan, Yi Jin","authorsParsed":[["Ling","Pengyang",""],["Chen","Huaian",""],["Tan","Xiao",""],["Shan","Yimeng",""],["Jin","Yi",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 03:29:27 GMT"}],"updateDate":"2024-08-13","timestamp":1723346967000,"abstract":"  Images captured in hazy weather generally suffer from quality degradation,\nand many dehazing methods have been developed to solve this problem. However,\nsingle image dehazing problem is still challenging due to its ill-posed nature.\nIn this paper, we propose a depth order guided single image dehazing method,\nwhich utilizes depth order in hazy images to guide the dehazing process to\nachieve a similar depth perception in corresponding dehazing results. The\nconsistency of depth perception ensures that the regions that look farther or\ncloser in hazy images also appear farther or closer in the corresponding\ndehazing results, and thus effectively avoid the undesired visual effects. To\nachieve this goal, a simple yet effective strategy is proposed to extract the\ndepth order in hazy images, which offers a reference for depth perception in\nhazy weather. Additionally, a depth order embedded transformation model is\ndevised, which performs transmission estimation under the guidance of depth\norder to realize an unchanged depth order in the dehazing results. The\nextracted depth order provides a powerful global constraint for the dehazing\nprocess, which contributes to the efficient utilization of global information,\nthereby bringing an overall improvement in restoration quality. Extensive\nexperiments demonstrate that the proposed method can better recover potential\nstructure and vivid color with higher computational efficiency than the\nstate-of-the-art dehazing methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}