{"id":"2408.13661","title":"Hierarchical Network Fusion for Multi-Modal Electron Micrograph\n  Representation Learning with Foundational Large Language Models","authors":"Sakhinana Sagar Srinivas, Geethan Sannidhi, Venkataramana Runkana","authorsParsed":[["Srinivas","Sakhinana Sagar",""],["Sannidhi","Geethan",""],["Runkana","Venkataramana",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 19:24:44 GMT"}],"updateDate":"2024-08-27","timestamp":1724527484000,"abstract":"  Characterizing materials with electron micrographs is a crucial task in\nfields such as semiconductors and quantum materials. The complex hierarchical\nstructure of micrographs often poses challenges for traditional classification\nmethods. In this study, we propose an innovative backbone architecture for\nanalyzing electron micrographs. We create multi-modal representations of the\nmicrographs by tokenizing them into patch sequences and, additionally,\nrepresenting them as vision graphs, commonly referred to as patch attributed\ngraphs. We introduce the Hierarchical Network Fusion (HNF), a multi-layered\nnetwork structure architecture that facilitates information exchange between\nthe multi-modal representations and knowledge integration across different\npatch resolutions. Furthermore, we leverage large language models (LLMs) to\ngenerate detailed technical descriptions of nanomaterials as auxiliary\ninformation to assist in the downstream task. We utilize a cross-modal\nattention mechanism for knowledge fusion across cross-domain\nrepresentations(both image-based and linguistic insights) to predict the\nnanomaterial category. This multi-faceted approach promises a more\ncomprehensive and accurate representation and classification of micrographs for\nnanomaterial identification. Our framework outperforms traditional methods,\novercoming challenges posed by distributional shifts, and facilitating\nhigh-throughput screening.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}