{"id":"2408.02240","title":"CompositingVis: Exploring Interactions for Creating Composite\n  Visualizations in Immersive Environments","authors":"Qian Zhu, Tao Lu, Shunan Guo, Xiaojuan Ma, Yalong Yang","authorsParsed":[["Zhu","Qian",""],["Lu","Tao",""],["Guo","Shunan",""],["Ma","Xiaojuan",""],["Yang","Yalong",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 05:23:08 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 13:47:43 GMT"}],"updateDate":"2024-08-08","timestamp":1722835388000,"abstract":"  Composite visualization represents a widely embraced design that combines\nmultiple visual representations to create an integrated view. However, the\ntraditional approach of creating composite visualizations in immersive\nenvironments typically occurs asynchronously outside of the immersive space and\nis carried out by experienced experts. In this work, we aim to empower users to\nparticipate in the creation of composite visualization within immersive\nenvironments through embodied interactions. This could provide a flexible and\nfluid experience with immersive visualization and has the potential to\nfacilitate understanding of the relationship between visualization views. We\nbegin with developing a design space of embodied interactions to create various\ntypes of composite visualizations with the consideration of data relationships.\nDrawing inspiration from people's natural experience of manipulating physical\nobjects, we design interactions based on the combination of 3D manipulations in\nimmersive environments. Building upon the design space, we present a series of\ncase studies showcasing the interaction to create different kinds of composite\nvisualizations in virtual reality. Subsequently, we conduct a user study to\nevaluate the usability of the derived interaction techniques and user\nexperience of creating composite visualizations through embodied interactions.\nWe find that empowering users to participate in composite visualizations\nthrough embodied interactions enables them to flexibly leverage different\nvisualization views for understanding and communicating the relationships\nbetween different views, which underscores the potential of several future\napplication scenarios.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8JlzTLpuB7WNXOq3tf0PL3aFn8P705pti_egF717-C4","pdfSize":"5226102"}
