{"id":"2408.13265","title":"Exploiting Formal Concept Analysis for Data Modeling in Data Lakes","authors":"Anes Bendimerad, Romain Mathonat, Youcef Remil, Mehdi Kaytoue","authorsParsed":[["Bendimerad","Anes",""],["Mathonat","Romain",""],["Remil","Youcef",""],["Kaytoue","Mehdi",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 13:58:31 GMT"}],"updateDate":"2024-08-27","timestamp":1723384711000,"abstract":"  Data lakes are widely used to store extensive and heterogeneous datasets for\nadvanced analytics. However, the unstructured nature of data in these\nrepositories introduces complexities in exploiting them and extracting\nmeaningful insights. This motivates the need of exploring efficient approaches\nfor consolidating data lakes and deriving a common and unified schema. This\npaper introduces a practical data visualization and analysis approach rooted in\nFormal Concept Analysis (FCA) to systematically clean, organize, and design\ndata structures within a data lake. We explore diverse data structures stored\nin our data lake at Infologic, including InfluxDB measurements and\nElasticsearch indexes, aiming to derive conventions for a more accessible data\nmodel. Leveraging FCA, we represent data structures as objects, analyze the\nconcept lattice, and present two strategies-top-down and bottom-up-to unify\nthese structures and establish a common schema. Our methodology yields\nsignificant results, enabling the identification of common concepts in the data\nstructures, such as resources along with their underlying shared fields\n(timestamp, type, usedRatio, etc.). Moreover, the number of distinct data\nstructure field names is reduced by 54 percent (from 190 to 88) in the studied\nsubset of our data lake. We achieve a complete coverage of 80 percent of data\nstructures with only 34 distinct field names, a significant improvement from\nthe initial 121 field names that were needed to reach such coverage. The paper\nprovides insights into the Infologic ecosystem, problem formulation,\nexploration strategies, and presents both qualitative and quantitative results.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}