{"id":"2408.03088","title":"QADQN: Quantum Attention Deep Q-Network for Financial Market Prediction","authors":"Siddhant Dutta, Nouhaila Innan, Alberto Marchisio, Sadok Ben Yahia,\n  Muhammad Shafique","authorsParsed":[["Dutta","Siddhant",""],["Innan","Nouhaila",""],["Marchisio","Alberto",""],["Yahia","Sadok Ben",""],["Shafique","Muhammad",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 10:41:46 GMT"}],"updateDate":"2024-08-07","timestamp":1722940906000,"abstract":"  Financial market prediction and optimal trading strategy development remain\nchallenging due to market complexity and volatility. Our research in quantum\nfinance and reinforcement learning for decision-making demonstrates the\napproach of quantum-classical hybrid algorithms to tackling real-world\nfinancial challenges. In this respect, we corroborate the concept with rigorous\nbacktesting and validate the framework's performance under realistic market\nconditions, by including fixed transaction cost per trade. This paper\nintroduces a Quantum Attention Deep Q-Network (QADQN) approach to address these\nchallenges through quantum-enhanced reinforcement learning. Our QADQN\narchitecture uses a variational quantum circuit inside a traditional deep\nQ-learning framework to take advantage of possible quantum advantages in\ndecision-making. We gauge the QADQN agent's performance on historical data from\nmajor market indices, including the S&P 500. We evaluate the agent's learning\nprocess by examining its reward accumulation and the effectiveness of its\nexperience replay mechanism. Our empirical results demonstrate the QADQN's\nsuperior performance, achieving better risk-adjusted returns with Sortino\nratios of 1.28 and 1.19 for non-overlapping and overlapping test periods\nrespectively, indicating effective downside risk management.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}