{"id":"2408.16080","title":"Striking the Right Balance: Systematic Assessment of Evaluation Method\n  Distribution Across Contribution Types","authors":"Feng Lin, Arran Zeyu Wang, Md Dilshadur Rahman, Danielle Albers\n  Szafir, Ghulam Jilani Quadri","authorsParsed":[["Lin","Feng",""],["Wang","Arran Zeyu",""],["Rahman","Md Dilshadur",""],["Szafir","Danielle Albers",""],["Quadri","Ghulam Jilani",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:20:59 GMT"}],"updateDate":"2024-08-30","timestamp":1724869259000,"abstract":"  In the rapidly evolving field of information visualization, rigorous\nevaluation is essential for validating new techniques, understanding user\ninteractions, and demonstrating the effectiveness and usability of\nvisualizations. Faithful evaluations provide valuable insights into how users\ninteract with and perceive the system, enabling designers to identify potential\nweaknesses and make informed decisions about design choices and improvements.\nHowever, an emerging trend of multiple evaluations within a single research\nraises critical questions about the sustainability, feasibility, and\nmethodological rigor of such an approach. New researchers and students,\ninfluenced by this trend, may believe -- multiple evaluations are necessary for\na study, regardless of the contribution types. However, the number of\nevaluations in a study should depend on its contributions and merits, not on\nthe trend of including multiple evaluations to strengthen a paper. So, how many\nevaluations are enough? This is a situational question and cannot be\nformulaically determined. Our objective is to summarize current trends and\npatterns to assess the distribution of evaluation methods over different paper\ncontribution types. In this paper, we identify this trend through a\nnon-exhaustive literature survey of evaluation patterns in 214 papers in the\ntwo most recent years' VIS issues in IEEE TVCG from 2023 and 2024. We then\ndiscuss various evaluation strategy patterns in the information visualization\nfield to guide practical choices and how this paper will open avenues for\nfurther discussion.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}