{"id":"2408.14560","title":"The Impact from Galaxy Groups on Cosmological Measurements with Type Ia\n  Supernovae","authors":"Erik R. Peterson, Bastien Carreres, Anthony Carr, Daniel Scolnic, Ava\n  Bailey, Tamara M. Davis, Dillon Brout, Cullan Howlett, David O. Jones, Adam\n  G. Riess, Khaled Said, Georgie Taylor","authorsParsed":[["Peterson","Erik R.",""],["Carreres","Bastien",""],["Carr","Anthony",""],["Scolnic","Daniel",""],["Bailey","Ava",""],["Davis","Tamara M.",""],["Brout","Dillon",""],["Howlett","Cullan",""],["Jones","David O.",""],["Riess","Adam G.",""],["Said","Khaled",""],["Taylor","Georgie",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 18:21:39 GMT"}],"updateDate":"2024-08-28","timestamp":1724696499000,"abstract":"  At the low-redshift end ($z<0.05$) of the Hubble diagram with Type Ia\nSupernovae (SNe Ia), the contribution to Hubble residual scatter from peculiar\nvelocities is of similar size to that due to the standardization of the SN Ia\nlight curve. A way to improve the redshift measurement of the SN host galaxy is\nto utilize the average redshift of the galaxy group, effectively averaging over\nsmall-scale/intracluster peculiar velocities. One limiting factor is the\nfraction of SN host galaxies in galaxy groups, previously found to be 30% using\n(relatively incomplete) magnitude-limited galaxy catalogs. Here, we do the\nfirst analysis of N-body simulations to predict this fraction, finding\n$\\sim$66% should have associated groups and group averaging should improve\nredshift precision by $\\sim$120 km s$^{-1}$. Furthermore, using spectroscopic\ndata from the Anglo-Australian Telescope, we present results from the first\npilot program to evaluate whether or not 23 previously unassociated SN Ia hosts\nbelong in groups. We find that 91% of these candidates can be associated with\ngroups, consistent with predictions from simulations given the sample size.\nCombining with previously assigned SN host galaxies in Pantheon+, we\ndemonstrate improvement in Hubble residual scatter equivalent to 145 km\ns$^{-1}$, also consistent with simulations. For new and upcoming low-$z$\nsamples from, for example, the Zwicky Transient Facility and the Rubin\nObservatory's Legacy Survey of Space and Time, a separate follow-up program\nidentifying galaxy groups of SN hosts is a highly cost-effective way to enhance\ntheir constraining power.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}