{"id":"2408.02892","title":"Local excitation of kagome spin ice magnetism in HoAgGe seen by scanning\n  tunneling microscopy","authors":"Hanbin Deng, Tianyu Yang, Guowei Liu, Lu Liu, Lingxiao Zhao, Wu Wang,\n  Tiantian Li, Wei Song, Titus Neupert, Xiang-Rui Liu, Jifeng Shao, Y. Y. Zhao,\n  Nan Xu, Hao Deng, Li Huang, Yue Zhao, Liyuan Zhang, Jia-Wei Mei, Liusuo Wu,\n  Jiaqing He, Qihang Liu, Chang Liu, Jia-Xin Yin","authorsParsed":[["Deng","Hanbin",""],["Yang","Tianyu",""],["Liu","Guowei",""],["Liu","Lu",""],["Zhao","Lingxiao",""],["Wang","Wu",""],["Li","Tiantian",""],["Song","Wei",""],["Neupert","Titus",""],["Liu","Xiang-Rui",""],["Shao","Jifeng",""],["Zhao","Y. Y.",""],["Xu","Nan",""],["Deng","Hao",""],["Huang","Li",""],["Zhao","Yue",""],["Zhang","Liyuan",""],["Mei","Jia-Wei",""],["Wu","Liusuo",""],["He","Jiaqing",""],["Liu","Qihang",""],["Liu","Chang",""],["Yin","Jia-Xin",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 01:46:24 GMT"}],"updateDate":"2024-08-07","timestamp":1722908784000,"abstract":"  The kagome spin ice can host frustrated magnetic excitations by flipping its\nlocal spin. Under an inelastic tunneling condition, the tip in a scanning\ntunneling microscope can flip the local spin, and we apply this technique to\nkagome metal HoAgGe with a long-range ordered spin ice ground state. Away from\ndefects, we discover a pair of pronounced dips in the local tunneling spectrum\nat symmetrical bias voltages with negative intensity values, serving as a\nstriking inelastic tunneling signal. This signal disappears above the spin ice\nformation temperature and has a dependence on the magnetic fields,\ndemonstrating its intimate relation with the spin ice magnetism. We provide a\ntwo-level spin-flip model to explain the tunneling dips considering the spin\nice magnetism under spin-orbit coupling. Our results uncover a local emergent\nexcitation of spin ice magnetism in a kagome metal, suggesting that local\nelectrical field induced spin flip climbs over a barrier caused by spin-orbital\nlocking.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"C28G_s_VYtesfTjrtxbfKg6Y9bnDCEdDB4scegSMcks","pdfSize":"1728592"}
