{"id":"2408.02104","title":"Room-temperature optical spin polarization of an electron spin qudit in\n  a vanadyl -- free base porphyrin dimer","authors":"Alberto Privitera, Alessandro Chiesa, Fabio Santanni, Angelo Carella,\n  Davide Ranieri, Andrea Caneschi, Matthew D. Krzyaniak, Ryan M. Young, Michael\n  R. Wasielewski, Stefano Carretta, Roberta Sessoli","authorsParsed":[["Privitera","Alberto",""],["Chiesa","Alessandro",""],["Santanni","Fabio",""],["Carella","Angelo",""],["Ranieri","Davide",""],["Caneschi","Andrea",""],["Krzyaniak","Matthew D.",""],["Young","Ryan M.",""],["Wasielewski","Michael R.",""],["Carretta","Stefano",""],["Sessoli","Roberta",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 18:08:20 GMT"}],"updateDate":"2024-08-06","timestamp":1722794900000,"abstract":"  Photoexcited organic chromophores appended to molecular qubits can serve as a\nsource of spin initialization or multi-level qudit generation for quantum\ninformation applications. So far, this approach has been primarily investigated\nin chromophore/stable radical systems. Here, we extend this concept to a\nmeso-meso linked oxovanadium(IV) porphyrin - free base porphyrin dimer.\nFemtosecond transient absorption experiments reveal that photoexcitation of the\nfree base porphyrin leads to picosecond triplet state formation via enhanced\nintersystem crossing. Time-resolved electron paramagnetic resonance (TREPR)\nexperiments carried out at both 85 K and room temperature reveal the formation\nof a long-lived spin-polarized quartet state through triplet-doublet spin\nmixing. Notably, a distinct hyperfine structure arising from the interaction\nbetween the electron spin quartet state and the vanadyl nucleus (51V, I=7/2) is\nevident, with the quartet state exhibiting long-lived spin polarization even at\nroom temperature. Theoretical simulations of the TREPR spectra confirm the\nphotogenerated quartet state and provide insights into the non-Boltzmann spin\npopulations. Exploit-ing this phenomenon affords the possibility of using\nphotoinduced triplet states in porphyrins for quantum information as a resource\nto polarize and magnetically couple molecular electronic or nuclear spin qubits\nand qudits.\n","subjects":["Physics/Quantum Physics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}