{"id":"2408.14633","title":"Channel allocation revisited through 1-extendability of graphs","authors":"Anthony Busson, Malory Marin, R\\'emi Watrigant","authorsParsed":[["Busson","Anthony",""],["Marin","Malory",""],["Watrigant","Rémi",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 20:57:36 GMT"}],"updateDate":"2024-08-28","timestamp":1724705856000,"abstract":"  We revisit the classical problem of channel allocation for Wi-Fi access\npoints (AP). Using mechanisms such as the CSMA/CA protocol, Wi-Fi access points\nwhich are in conflict within a same channel are still able to communicate to\nterminals. In graph theoretical terms, it means that it is not mandatory for\nthe channel allocation to correspond to a proper coloring of the conflict\ngraph. However, recent studies suggest that the structure -- rather than the\nnumber -- of conflicts plays a crucial role in the performance of each AP. More\nprecisely, the graph induced by each channel must satisfy the so-called\n$1$-extendability property, which requires each vertex to be contained in an\nindependent set of maximum cardinality. In this paper we introduce the\n1-extendable chromatic number, which is the minimum size of a partition of the\nvertex set of a graph such that each part induces a 1-extendable graph. We\nstudy this parameter and the related optimization problem through different\nperspectives: algorithms and complexity, structure, and extremal properties. We\nfirst show how to compute this number using modular decompositions of graphs,\nand analyze the running time with respect to the modular width of the input\ngraph. We also focus on the special case of cographs, and prove that the\n1-extendable chromatic number can be computed in quasi-polynomial time in this\nclass. Concerning extremal results, we show that the 1-extendable chromatic\nnumber of a graph with $n$ vertices is at most $2\\sqrt{n}$, whereas the\nclassical chromatic number can be as large as $n$. We are also able to\nconstruct graphs whose 1-extendable chromatic number is at least logarithmic in\nthe number of vertices.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Computational Complexity","Computing Research Repository/Discrete Mathematics"],"license":"http://creativecommons.org/licenses/by/4.0/"}