{"id":"2408.07077","title":"Measuring the acceleration of an elevator by using the apparent weight\n  of an object inside it","authors":"Mingyuan Shi, Yu Shi","authorsParsed":[["Shi","Mingyuan",""],["Shi","Yu",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 08:46:17 GMT"}],"updateDate":"2024-08-15","timestamp":1722415577000,"abstract":"  An accelerating elevator changes the apparent weight of any object inside it\nfrom the original weight, as measured inside the elevator, because the\nacceleration causes an inertial force on it. For any object in a running\nelevator, the variation of the acceleration of the elevator causes the\nvariation of the apparent weight of the object. We have studied the time\ndependence of the apparent weight of the object and thus the acceleration of\nthe elevator. For chosen initial and final floors, we measured the apparent\nweight of an object by using an electronic scale inside the elevator, and shot\nthe readings of the scale and a watch during the movement of the elevator. Then\nwe analyzed the data collected from the recorded video. If the initial and\nfinal floors are exchanged, the variations of the weight and acceleration are,\nrespectively, same in magnitudes and opposite in signs. The experiments\nindicate that for the elevator to go directly from a floor to another, the\nprocess consists of periods with variable acceleration, constant acceleration,\nuniform motion, variable deceleration, constant deceleration and variable\ndeceleration consecutively. If there are pauses during the movement, each pause\ncauses an additional process consisting of periods with deceleration, stop and\nacceleration, replacing the original period of constant motion. Depending on\nthe distance to the destination, the elevator reduces or diminishes the periods\nof constant acceleration and uniform motion.\n","subjects":["Physics/Physics Education"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MSxY7ZJtwv8JUWnpG4G_hs61-Mu03dekWb406sKeHkw","pdfSize":"309918"}
