{"id":"2408.05266","title":"Gapped Phases in (2+1)d with Non-Invertible Symmetries: Part I","authors":"Lakshya Bhardwaj, Daniel Pajer, Sakura Schafer-Nameki, Apoorv Tiwari,\n  Alison Warman, Jingxiang Wu","authorsParsed":[["Bhardwaj","Lakshya",""],["Pajer","Daniel",""],["Schafer-Nameki","Sakura",""],["Tiwari","Apoorv",""],["Warman","Alison",""],["Wu","Jingxiang",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-13","timestamp":1723226400000,"abstract":"  We use the Symmetry Topological Field Theory (SymTFT) to study and classify\ngapped phases in (2+1)d for a class of categorical symmetries, referred to as\nbeing of bosonic type. The SymTFTs for these symmetries are given by twisted\nand untwisted (3+1)d Dijkgraaf-Witten (DW) theories for finite groups G. A\nfinite set of boundary conditions (BCs) of these DW theories is well-known:\nthese simply involve imposing Dirichlet and Neumann conditions on the (3+1)d\ngauge fields. We refer to these as minimal BCs. The key new observation here is\nthat for each DW theory, there exists an infinite number of other BCs, that we\ncall non-minimal BCs. These non-minimal BCs are all obtained by a 'theta\nconstruction', which involves stacking the Dirichlet BC with 3d TFTs having G\n0-form symmetry, and gauging the diagonal G symmetry. On the one hand, using\nthe non-minimal BCs as symmetry BCs gives rise to an infinite number of\nnon-invertible symmetries having the same SymTFT, while on the other hand,\nusing the non-minimal BCs as physical BCs in the sandwich construction gives\nrise to an infinite number of (2+1)d gapped phases for each such non-invertible\nsymmetry. Our analysis is thoroughly exemplified for G = $\\mathbb{Z_2}$ and\nmore generally any finite abelian group, for which the resulting non-invertible\nsymmetries and their gapped phases already reveal an immensely rich structure.\n","subjects":["Physics/High Energy Physics - Theory","Condensed Matter/Strongly Correlated Electrons","Mathematics/Category Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}