{"id":"2408.06279","title":"PDRs4All. X. ALMA and JWST detection of neutral carbon in the externally\n  irradiated disk d203-506: Undepleted gas-phase carbon","authors":"Javier R. Goicoechea, J. Le Bourlot, J. H. Black, F. Alarc\\'on, E. A.\n  Bergin, O. Bern\\'e, E. Bron, A. Canin, E. Chapillon, R. Chown, E. Dartois, M.\n  Gerin, E. Habart, T. J. Haworth, C. Joblin, O. Kannavou, F. Le Petit, T.\n  Onaka, E. Peeters, J. Pety, E. Roueff, A. Sidhu, I. Schroetter, B. Tabone, A.\n  G. G. M. Tielens, B. Trahin, D. Van De Putte, S. Vicente, M. Zannese","authorsParsed":[["Goicoechea","Javier R.",""],["Bourlot","J. Le",""],["Black","J. H.",""],["Alarcón","F.",""],["Bergin","E. A.",""],["Berné","O.",""],["Bron","E.",""],["Canin","A.",""],["Chapillon","E.",""],["Chown","R.",""],["Dartois","E.",""],["Gerin","M.",""],["Habart","E.",""],["Haworth","T. J.",""],["Joblin","C.",""],["Kannavou","O.",""],["Petit","F. Le",""],["Onaka","T.",""],["Peeters","E.",""],["Pety","J.",""],["Roueff","E.",""],["Sidhu","A.",""],["Schroetter","I.",""],["Tabone","B.",""],["Tielens","A. G. G. M.",""],["Trahin","B.",""],["Van De Putte","D.",""],["Vicente","S.",""],["Zannese","M.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 16:41:01 GMT"}],"updateDate":"2024-09-04","timestamp":1723480861000,"abstract":"  The gas-phase abundance of carbon, x_C = C/H, and its depletion factors are\nessential parameters for understanding the gas and solid compositions that are\nultimately incorporated into planets. The majority of protoplanetary disks are\nborn in clusters and, as a result, are exposed to external FUV radiation. These\nFUV photons potentially affect the disk's evolution, chemical composition, and\nline excitation. We present the first detection of the [CI]609um fine-structure\nline of neutral carbon (CI), achieved with ALMA, toward one of these disks,\nd203-506, in the Orion Nebula Cluster. We also report the detection of CI\nforbidden and permitted lines (from electronically excited states up to 10 eV)\nobserved with JWST in the IR. These lines trace the irradiated outer disk and\nphoto-evaporative wind. Contrary to the common belief that these IR lines are\nC+ recombination lines, we find that they are dominated by FUV-pumping of CI\nfollowed by fluorescence cascades. They trace the transition from atomic to\nmolecular gas, and their intensities scale with G0. The lack of outstanding IR\nOI fluorescent emission, however, implies a sharper attenuation of external FUV\nradiation with E > 12 eV (~Lyman-beta). This is related to a lower effective\nFUV dust absorption cross section compared to that of interstellar grains,\nimplying a more prominent role for FUV shielding by the CI photoionization\ncontinuum. The [CI]609um intensity is proportional to N(CI) and can be used to\ninfer x_C. We derive x_C ~ 1.4E-4. This implies that there is no major\ndepletion of volatile carbon compared to x_C measured in the natal cloud,\nhinting at a young disk. We also show that external FUV radiation impacts the\nouter disk and wind by vertically shifting the water freeze-out depth, which\nresults in less efficient grain growth and settling. This shift leads to nearly\nsolar gas-phase C/O abundance ratios in these irradiated layers.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4OHgwgtMIwOKug_PdKJE5gxT1D0KneQGEzfMgq3SUxA","pdfSize":"2459990"}
