{"id":"2408.08266","title":"IVHS via Kuznetsov components and categorical Torelli theorems for\n  weighted hypersurfaces","authors":"Xun Lin, J{\\o}rgen Vold Rennemo and Shizhuo Zhang","authorsParsed":[["Lin","Xun",""],["Rennemo","Jørgen Vold",""],["Zhang","Shizhuo",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 17:09:33 GMT"}],"updateDate":"2024-08-16","timestamp":1723741773000,"abstract":"  We study the categorical Torelli theorem for smooth (weighted) hypersurfaces\nin (weighted) projective spaces via the Hochschild--Serre algebra of its\nKuznetsov component. In the first part of the paper, we show that a natural\ngraded subalgebra of the Hochschild--Serre algebra of the Kuznetsov component\nof a degree $d$ weighted hypersurface in $\\mathbb{P}(a_0,\\ldots,a_n)$\nreconstructs the graded subalgebra of the Jacobian ring generated by the degree\n$t:=\\mathrm{gcd}(d,\\Sigma_{i=0}^na_i)$ piece under mild assumptions. Using\nresults of Donagi and Cox--Green, this gives a categorical Torelli theorem for\nmost smooth hypersurfaces $Y$ of degree $d \\le n$ in $\\mathbb{P}^n$ such that\n$d$ does not divide $n+1$ (the exception being the cases of the form $(d,n) =\n(4, 4k + 2)$, for which a result of Voisin lets us deduce a generic categorical\nTorelli theorem when $k \\ge 150$). Next, we show that the Jacobian ring of the\nVeronese double cone can be reconstructed from its graded subalgebra of even\ndegree, thus proving a categorical Torelli theorem for the Veronese double\ncone.\n  In the second part, we rebuild the infinitesimal Variation of Hodge\nstructures of a series of (weighted) hypersurfaces from their Kuznetsov\ncomponents via the Hochschild--Serre algebra. As a result, we prove categorical\nTorelli theorems for two classes of (weighted) hypersurfaces: $(1):$\nGeneralized Veronese double cone; $(2):$ Certain $k$-sheeted covering of\n$\\mathbb{P}^n$, when they are generic. Then, we prove a refined categorical\nTorelli theorem for a Fano variety whose Kuznetsov component is a Calabi--Yau\ncategory of dimension $2m+1$. Finally, we prove the actual categorical Torelli\ntheorem for generalized Veronese double cone and $k$-sheeted covering of\n$\\mathbb{P}^n$.\n","subjects":["Mathematics/Algebraic Geometry"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"c2ZX-djPHbzzJnhYQrKrbNIOgQ5DG3XDZam-qY6xsJE","pdfSize":"351633"}
