{"id":"2408.13677","title":"Room-temperature polariton condensate in a two-dimensional hybrid\n  perovskite","authors":"Marti Struve, Christoph Bennenhei, Hamid Pashaei Adl, Kok Wee Song,\n  Hangyong Shan, Nadiya Mathukhno, Jens-Christian Drawer, Falk Eilenberger,\n  Naga Pratibha Jasti, David Cahen, Oleksandr Kyriienko, Christian Schneider,\n  Martin Esmann","authorsParsed":[["Struve","Marti",""],["Bennenhei","Christoph",""],["Adl","Hamid Pashaei",""],["Song","Kok Wee",""],["Shan","Hangyong",""],["Mathukhno","Nadiya",""],["Drawer","Jens-Christian",""],["Eilenberger","Falk",""],["Jasti","Naga Pratibha",""],["Cahen","David",""],["Kyriienko","Oleksandr",""],["Schneider","Christian",""],["Esmann","Martin",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 21:48:39 GMT"}],"updateDate":"2024-08-27","timestamp":1724536119000,"abstract":"  Layered 2D halide perovskites are chemically synthesized realizations of\nquantum well stacks with giant exciton oscillator strengths, tunable emission\nspectra and very large exciton binding energies. While these features render 2D\nhalide perovskites a promising platform for room-temperature polaritonics,\nbosonic condensation and polariton lasing in 2D perovskites have so far\nremained elusive at ambient conditions. Here, we demonstrate room-temperature\ncavity exciton-polariton condensation in mechanically exfoliated crystals of\nthe 2D Ruddlesden-Popper iodide perovskite $(BA)_{2}(MA)_{2}Pb_{3}I_{10}$ in an\nopen optical microcavity. We observe a polariton condensation threshold of\n$P_{th}=6.76 fJ$ per pulse and detect a strong non-linear response.\nInterferometric measurements confirm the spontaneous emergence of spatial\ncoherence across the condensate with an associated first-order autocorrelation\nreaching $g^{(1)}\\approx 0.6$. Our results lay the foundation for a new class\nof room-temperature polariton lasers based on 2D halide perovskites with great\npotential for hetero-integration with other van-der-Waals materials and\ncombination with photonic crystals or waveguides.\n","subjects":["Physics/Optics","Condensed Matter/Quantum Gases"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}