{"id":"2408.12306","title":"Pulse characterization at the single-photon level through chronocyclic\n  $Q$-function measurements","authors":"Abhinandan Bhattacharjee, Patrick Folge, Laura Serino, Jaroslav\n  \\v{R}eh\\'a\\v{c}ek, Zden\\v{e}k Hradil, Christine Silberhorn, and Benjamin\n  Brecht","authorsParsed":[["Bhattacharjee","Abhinandan",""],["Folge","Patrick",""],["Serino","Laura",""],["Řeháček","Jaroslav",""],["Hradil","Zdeněk",""],["Silberhorn","Christine",""],["Brecht","Benjamin",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 11:30:49 GMT"}],"updateDate":"2024-08-23","timestamp":1724326249000,"abstract":"  The characterization of the complex spectral amplitude that is, the spectrum\nand spectral phase, of single-photon-level light fields is a crucial capability\nfor modern photonic quantum technologies. Since established pulse\ncharacterisation techniques are not applicable at low intensities, alternative\napproaches are required. Here, we demonstrate the retrieval of the complex\nspectral amplitude of single-photon-level light pulses through measuring their\nchronocyclic $Q-$function. Our approach draws inspiration from quantum state\ntomography by exploiting the analogy between quadrature phase space and\ntime-frequency phase space. In the experiment, we perform time-frequency\nprojections with a quantum pulse gate, which directly yield the chronocyclic\n$Q-$function. We evaluate the data with maximum likelihood estimation, which is\nthe established technique for quantum state tomography. This yields not only an\nunambigious estimate of the complex spectral amplitude of the state under test\nthat does not require any \\textit{a priori} information, but also allows for,\nin principle, estimating the spectral-temporal coherence properties of the\nstate. Our method accurately recovers features such as jumps in the spectral\nphase and is resistant against regions with zero spectral intensity, which\nmakes it immediately beneficial also for classical pulse characterization\nproblems.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Rp6Zljo7uzuv6sIZymEdsOBHTdLn4yYZ_UvcrDR2OPA","pdfSize":"1923663"}
