{"id":"2408.15137","title":"Warm Jupiters around M-dwarfs are great opportunities for extensive\n  chemical, cloud and haze characterisation with JWST","authors":"Lucas Teinturier, Elsa Ducrot, Benjamin Charnay","authorsParsed":[["Teinturier","Lucas",""],["Ducrot","Elsa",""],["Charnay","Benjamin",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 15:19:54 GMT"}],"updateDate":"2024-08-28","timestamp":1724771994000,"abstract":"  The population of short-period giant exoplanets around M-dwarf stars is\nslowly rising. These planets present an extraordinary opportunity for\natmospheric characterisation and defy our current understanding of planetary\nformation. Furthermore, clouds and hazes are ubiquitous in warm exoplanets but\ntheir behaviour is still poorly understood. We study the case of a standard\nwarm Jupiter around a M-dwarf star to show the opportunity of this exoplanet\npopulation for atmospheric characterisation. We aim to derive the cloud, haze,\nand chemical budget of such planets using JWST. We leverage a 3D Global Climate\nModel, the generic PCM, to simulate the cloudy and cloud-free atmosphere of\nwarm Jupiters around a M-dwarf. We then post-process our simulations to produce\nspectral phase curves and transit spectra as would be seen with JWST.We show\nthat using the amplitude and offset of the spectral phase curves, we can\ndirectly infer the presence of clouds and hazes in the atmosphere of such giant\nplanets. Chemical characterisation of multiple species is possible with an\nunprecedented signal-to-noise ratio, using the transit spectrum in one single\nvisit. In such atmospheres, NH3 could be detected for the first time in a giant\nexoplanet. We make the case that these planets are key to understanding the\ncloud and haze budget in warm giants. Finally, such planets are targets of\ngreat interest for Ariel.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gdkC9g0aiQ3Dg02wiEaHYQP57-NhvBa-kGfZ_eCGH24","pdfSize":"1519674"}
