{"id":"2408.08025","title":"Disagreement as a way to study misinformation and its effects","authors":"Damian Hodel and Jevin West","authorsParsed":[["Hodel","Damian",""],["West","Jevin",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 08:48:54 GMT"}],"updateDate":"2024-08-16","timestamp":1723711734000,"abstract":"  Misinformation - false or misleading information - is considered a\nsignificant societal concern due to its associated \"misinformation effects,\"\nsuch as political polarization, erosion of trust in institutions, problematic\nbehavior, and public health challenges. However, the prevailing concept is\nmisaligned with what is studied. While misinformation focuses on instances of\ninformation about factual matters, the broad spectrum of effects often\nmanifests at a societal level and is shaped by a wide range of interdependent\nfactors such as identity, values, opinions, epistemologies, and disagreements.\nUnsurprisingly, misinformation effects can occur without the prevalence of\nmisinformation, and misinformation does not necessarily increase the effects\nstudied. Here, we propose using disagreement - conflicting attitudes and\nbeliefs between individuals and communities - as a way to study misinformation\neffects because it addresses the identified conceptual limitations of\nmisinformation. Furthermore, unlike misinformation, disagreement does not\nrequire researchers to determine whether a given information is false or\nmisleading. Thus, it can be studied and, more importantly, measured without the\nneed to make a normative judgment about a given information, even when the\nspecific topic is entirely removed, as we show in a longitudinal disagreement\nmeasurement. We demonstrate that disagreement, as a holistic concept, provides\nbetter explanations for the occurrence of misinformation effects, enhances\nprecision in developing appropriate interventions, and offers a promising\napproach for evaluating them through quantification. Finally, we show how\ndisagreement addresses current misinformation research questions and conclude\nwith recommendations for research practice.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/"}