{"id":"2408.10357","title":"Beyond Relevant Documents: A Knowledge-Intensive Approach for\n  Query-Focused Summarization using Large Language Models","authors":"Weijia Zhang, Jia-Hong Huang, Svitlana Vakulenko, Yumo Xu, Thilina\n  Rajapakse, Evangelos Kanoulas","authorsParsed":[["Zhang","Weijia",""],["Huang","Jia-Hong",""],["Vakulenko","Svitlana",""],["Xu","Yumo",""],["Rajapakse","Thilina",""],["Kanoulas","Evangelos",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:54:20 GMT"}],"updateDate":"2024-08-21","timestamp":1724093660000,"abstract":"  Query-focused summarization (QFS) is a fundamental task in natural language\nprocessing with broad applications, including search engines and report\ngeneration. However, traditional approaches assume the availability of relevant\ndocuments, which may not always hold in practical scenarios, especially in\nhighly specialized topics. To address this limitation, we propose a novel\nknowledge-intensive approach that reframes QFS as a knowledge-intensive task\nsetup. This approach comprises two main components: a retrieval module and a\nsummarization controller. The retrieval module efficiently retrieves\npotentially relevant documents from a large-scale knowledge corpus based on the\ngiven textual query, eliminating the dependence on pre-existing document sets.\nThe summarization controller seamlessly integrates a powerful large language\nmodel (LLM)-based summarizer with a carefully tailored prompt, ensuring the\ngenerated summary is comprehensive and relevant to the query. To assess the\neffectiveness of our approach, we create a new dataset, along with\nhuman-annotated relevance labels, to facilitate comprehensive evaluation\ncovering both retrieval and summarization performance. Extensive experiments\ndemonstrate the superior performance of our approach, particularly its ability\nto generate accurate summaries without relying on the availability of relevant\ndocuments initially. This underscores our method's versatility and practical\napplicability across diverse query scenarios.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mKs9cdJUfOMKXmbckOjX-Js7qwRLTkG8tEH8l_GjM5I","pdfSize":"623727"}
