{"id":"2408.04800","title":"A High-Temperature Thermocouple Development by Additive Manufacturing:\n  Tungsten-Nickel (W-Ni) and Molybdenum (Mo) Integration with Ceramic\n  Structures","authors":"Azizul Islam, Aayush Alok, Vamsi Borra, Pedro Cortes","authorsParsed":[["Islam","Azizul",""],["Alok","Aayush",""],["Borra","Vamsi",""],["Cortes","Pedro",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 00:52:52 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 16:27:26 GMT"}],"updateDate":"2024-09-19","timestamp":1723164772000,"abstract":"  Additive manufacturing holds more potential to enable the development of\nceramic-based components. Ceramics offer high resistance to heat, high fracture\ntoughness, and are extremely corrosion resistant. Thus, ceramics are widely\nused in sectors such as the aerospace industry, automotive, microelectronics,\nand biomedicine. Using various additive manufacturing platforms, ceramics with\ncomplex and uniquely designed geometry can be developed to suit specific\napplications. This project aims at innovating high-temperature thermocouples by\nembedding conductive metal pastes into a ceramic structure. The paste used\nincludes tungsten, molybdenum, and antimony. The metal pastes are precisely\nextruded into a T-shaped trench inside the ceramic matrix. Following specific\ntemperature ranges, the ceramic matrix is sintered to improve the properties of\nthe material. The sensors produced can function at extremely high temperatures\nand are thereby suitable for high-temperature environments. Comparative testing\nof the 3D sintered sensors with conventional temperature sensors shows high\ncorrelation between the two classes of sensors. The resulting R-squared value\nof 0.9885 is satisfactory which implies the reliability and accuracy of 3D\nsintering sensors are satisfactory in temperature sensing applications.\n","subjects":["Physics/Chemical Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"49d9EPl6hClX8MRgZ11B0k_NuJATQmTqrAn_bn43nKo","pdfSize":"1131177"}
