{"id":"2408.12369","title":"RoundTable: Leveraging Dynamic Schema and Contextual Autocomplete for\n  Enhanced Query Precision in Tabular Question Answering","authors":"Pratyush Kumar, Kuber Vijaykumar Bellad, Bharat Vadlamudi, Aman Chadha","authorsParsed":[["Kumar","Pratyush",""],["Bellad","Kuber Vijaykumar",""],["Vadlamudi","Bharat",""],["Chadha","Aman",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 13:13:06 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 08:11:09 GMT"}],"updateDate":"2024-08-26","timestamp":1724332386000,"abstract":"  With advancements in Large Language Models (LLMs), a major use case that has\nemerged is querying databases in plain English, translating user questions into\nexecutable database queries, which has improved significantly. However,\nreal-world datasets often feature a vast array of attributes and complex\nvalues, complicating the LLMs task of accurately identifying relevant columns\nor values from natural language queries. Traditional methods cannot fully relay\nthe datasets size and complexity to the LLM. To address these challenges, we\npropose a novel framework that leverages Full-Text Search (FTS) on the input\ntable. This approach not only enables precise detection of specific values and\ncolumns but also narrows the search space for language models, thereby\nenhancing query accuracy. Additionally, it supports a custom auto-complete\nfeature that suggests queries based on the data in the table. This integration\nsignificantly refines the interaction between the user and complex datasets,\noffering a sophisticated solution to the limitations faced by current table\nquerying capabilities. This work is accompanied by an application for both Mac\nand Windows platforms, which readers can try out themselves on their own data.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UkoL1nBaDAX7tTm9wQRtNTNqtQjmBkdt114yTE9s6LM","pdfSize":"2056915"}
