{"id":"2408.08593","title":"RadioDiff: An Effective Generative Diffusion Model for Sampling-Free\n  Dynamic Radio Map Construction","authors":"Xiucheng Wang and Keda Tao and Nan Cheng and Zhisheng Yin and Zan Li\n  and Yuan Zhang and Xuemin Shen","authorsParsed":[["Wang","Xiucheng",""],["Tao","Keda",""],["Cheng","Nan",""],["Yin","Zhisheng",""],["Li","Zan",""],["Zhang","Yuan",""],["Shen","Xuemin",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 08:02:00 GMT"}],"updateDate":"2024-08-19","timestamp":1723795320000,"abstract":"  Radio map (RM) is a promising technology that can obtain pathloss based on\nonly location, which is significant for 6G network applications to reduce the\ncommunication costs for pathloss estimation. However, the construction of RM in\ntraditional is either computationally intensive or depends on costly\nsampling-based pathloss measurements. Although the neural network (NN)-based\nmethod can efficiently construct the RM without sampling, its performance is\nstill suboptimal. This is primarily due to the misalignment between the\ngenerative characteristics of the RM construction problem and the\ndiscrimination modeling exploited by existing NN-based methods. Thus, to\nenhance RM construction performance, in this paper, the sampling-free RM\nconstruction is modeled as a conditional generative problem, where a denoised\ndiffusion-based method, named RadioDiff, is proposed to achieve high-quality RM\nconstruction. In addition, to enhance the diffusion model's capability of\nextracting features from dynamic environments, an attention U-Net with an\nadaptive fast Fourier transform module is employed as the backbone network to\nimprove the dynamic environmental features extracting capability. Meanwhile,\nthe decoupled diffusion model is utilized to further enhance the construction\nperformance of RMs. Moreover, a comprehensive theoretical analysis of why the\nRM construction is a generative problem is provided for the first time, from\nboth perspectives of data features and NN training methods. Experimental\nresults show that the proposed RadioDiff achieves state-of-the-art performance\nin all three metrics of accuracy, structural similarity, and peak\nsignal-to-noise ratio. The code is available at\nhttps://github.com/UNIC-Lab/RadioDiff.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}