{"id":"2408.04806","title":"When Refreshable Tactile Displays Meet Conversational Agents:\n  Investigating Accessible Data Presentation and Analysis with Touch and Speech","authors":"Samuel Reinders, Matthew Butler, Ingrid Zukerman, Bongshin Lee, Lizhen\n  Qu, Kim Marriott","authorsParsed":[["Reinders","Samuel",""],["Butler","Matthew",""],["Zukerman","Ingrid",""],["Lee","Bongshin",""],["Qu","Lizhen",""],["Marriott","Kim",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 01:21:52 GMT"}],"updateDate":"2024-08-12","timestamp":1723166512000,"abstract":"  Despite the recent surge of research efforts to make data visualizations\naccessible to people who are blind or have low vision (BLV), how to support BLV\npeople's data analysis remains an important and challenging question. As\nrefreshable tactile displays (RTDs) become cheaper and conversational agents\ncontinue to improve, their combination provides a promising approach to support\nBLV people's interactive data exploration and analysis. To understand how BLV\npeople would use and react to a system combining an RTD with a conversational\nagent, we conducted a Wizard-of-Oz study with 11 BLV participants, where they\ninteracted with line charts, bar charts, and isarithmic maps. Our analysis of\nparticipants' interactions led to the identification of nine distinct patterns.\nWe also learned that the choice of modalities depended on the type of task and\nprior experience with tactile graphics, and that participants strongly\npreferred the combination of RTD and speech to a single modality. In addition,\nparticipants with more tactile experience described how tactile images\nfacilitated a deeper engagement with the data and supported independent\ninterpretation. Our findings will inform the design of interfaces for such\ninteractive mixed-modality systems.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"6NLMqWUZO35JAiDIP-psSNnZ9mWiL-3bpfkxjaHbox8","pdfSize":"4836350"}
