{"id":"2408.04131","title":"Heterogeneous Graph Sequence Neural Networks for Dynamic Traffic\n  Assignment","authors":"Tong Liu, Hadi Meidani","authorsParsed":[["Liu","Tong",""],["Meidani","Hadi",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 23:41:09 GMT"}],"updateDate":"2024-08-09","timestamp":1723074069000,"abstract":"  Traffic assignment and traffic flow prediction provide critical insights for\nurban planning, traffic management, and the development of intelligent\ntransportation systems. An efficient model for calculating traffic flows over\nthe entire transportation network could provide a more detailed and realistic\nunderstanding of traffic dynamics. However, existing traffic prediction\napproaches, such as those utilizing graph neural networks, are typically\nlimited to locations where sensors are deployed and cannot predict traffic\nflows beyond sensor locations. To alleviate this limitation, inspired by\nfundamental relationship that exists between link flows and the\norigin-destination (OD) travel demands, we proposed the Heterogeneous\nSpatio-Temporal Graph Sequence Network (HSTGSN). HSTGSN exploits dependency\nbetween origin and destination nodes, even when it is long-range, and learns\nimplicit vehicle route choices under different origin-destination demands. This\nmodel is based on a heterogeneous graph which consists of road links, OD links\n(virtual links connecting origins and destinations) and a spatio-temporal graph\nencoder-decoder that captures the spatio-temporal relationship between OD\ndemands and flow distribution. We will show how the graph encoder-decoder is\nable to recover the incomplete information in the OD demand, by using node\nembedding from the graph decoder to predict the temporal changes in flow\ndistribution. Using extensive experimental studies on real-world networks with\ncomplete/incomplete OD demands, we demonstrate that our method can not only\ncapture the implicit spatio-temporal relationship between link traffic flows\nand OD demands but also achieve accurate prediction performance and\ngeneralization capability.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"W_v3I4gvaw0NP7iXUewTlAX47pPbgVvfYEw_Q1er_wo","pdfSize":"2550334"}
