{"id":"2408.02943","title":"Recent Advances in Data-driven Intelligent Control for Wireless\n  Communication: A Comprehensive Survey","authors":"Wei Huo, Huiwen Yang, Nachuan Yang, Zhaohua Yang, Jiuzhou Zhang, Fuhai\n  Nan, Xingzhou Chen, Yifan Mao, Suyang Hu, Pengyu Wang, Xuanyu Zheng, Mingming\n  Zhao, Ling Shi","authorsParsed":[["Huo","Wei",""],["Yang","Huiwen",""],["Yang","Nachuan",""],["Yang","Zhaohua",""],["Zhang","Jiuzhou",""],["Nan","Fuhai",""],["Chen","Xingzhou",""],["Mao","Yifan",""],["Hu","Suyang",""],["Wang","Pengyu",""],["Zheng","Xuanyu",""],["Zhao","Mingming",""],["Shi","Ling",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 04:07:39 GMT"}],"updateDate":"2024-08-07","timestamp":1722917259000,"abstract":"  The advent of next-generation wireless communication systems heralds an era\ncharacterized by high data rates, low latency, massive connectivity, and\nsuperior energy efficiency. These systems necessitate innovative and adaptive\nstrategies for resource allocation and device behavior control in wireless\nnetworks. Traditional optimization-based methods have been found inadequate in\nmeeting the complex demands of these emerging systems. As the volume of data\ncontinues to escalate, the integration of data-driven methods has become\nindispensable for enabling adaptive and intelligent control mechanisms in\nfuture wireless communication systems. This comprehensive survey explores\nrecent advancements in data-driven methodologies applied to wireless\ncommunication networks. It focuses on developments over the past five years and\ntheir application to various control objectives within wireless cyber-physical\nsystems. It encompasses critical areas such as link adaptation, user\nscheduling, spectrum allocation, beam management, power control, and the\nco-design of communication and control systems. We provide an in-depth\nexploration of the technical underpinnings that support these data-driven\napproaches, including the algorithms, models, and frameworks developed to\nenhance network performance and efficiency. We also examine the challenges that\ncurrent data-driven algorithms face, particularly in the context of the dynamic\nand heterogeneous nature of next-generation wireless networks. The paper\nprovides a critical analysis of these challenges and offers insights into\npotential solutions and future research directions. This includes discussing\nthe adaptability, integration with 6G, and security of data-driven methods in\nthe face of increasing network complexity and data volume.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}