{"id":"2408.00415","title":"DriveArena: A Closed-loop Generative Simulation Platform for Autonomous\n  Driving","authors":"Xuemeng Yang, Licheng Wen, Yukai Ma, Jianbiao Mei, Xin Li, Tiantian\n  Wei, Wenjie Lei, Daocheng Fu, Pinlong Cai, Min Dou, Botian Shi, Liang He,\n  Yong Liu, Yu Qiao","authorsParsed":[["Yang","Xuemeng",""],["Wen","Licheng",""],["Ma","Yukai",""],["Mei","Jianbiao",""],["Li","Xin",""],["Wei","Tiantian",""],["Lei","Wenjie",""],["Fu","Daocheng",""],["Cai","Pinlong",""],["Dou","Min",""],["Shi","Botian",""],["He","Liang",""],["Liu","Yong",""],["Qiao","Yu",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 09:32:01 GMT"}],"updateDate":"2024-08-02","timestamp":1722504721000,"abstract":"  This paper presented DriveArena, the first high-fidelity closed-loop\nsimulation system designed for driving agents navigating in real scenarios.\nDriveArena features a flexible, modular architecture, allowing for the seamless\ninterchange of its core components: Traffic Manager, a traffic simulator\ncapable of generating realistic traffic flow on any worldwide street map, and\nWorld Dreamer, a high-fidelity conditional generative model with infinite\nautoregression. This powerful synergy empowers any driving agent capable of\nprocessing real-world images to navigate in DriveArena's simulated environment.\nThe agent perceives its surroundings through images generated by World Dreamer\nand output trajectories. These trajectories are fed into Traffic Manager,\nachieving realistic interactions with other vehicles and producing a new scene\nlayout. Finally, the latest scene layout is relayed back into World Dreamer,\nperpetuating the simulation cycle. This iterative process fosters closed-loop\nexploration within a highly realistic environment, providing a valuable\nplatform for developing and evaluating driving agents across diverse and\nchallenging scenarios. DriveArena signifies a substantial leap forward in\nleveraging generative image data for the driving simulation platform, opening\ninsights for closed-loop autonomous driving. Code will be available soon on\nGitHub: https://github.com/PJLab-ADG/DriveArena\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}