{"id":"2408.16018","title":"SPICED: Syntactical Bug and Trojan Pattern Identification in A/MS\n  Circuits using LLM-Enhanced Detection","authors":"Jayeeta Chaudhuri, Dhruv Thapar, Arjun Chaudhuri, Farshad Firouzi, and\n  Krishnendu Chakrabarty","authorsParsed":[["Chaudhuri","Jayeeta",""],["Thapar","Dhruv",""],["Chaudhuri","Arjun",""],["Firouzi","Farshad",""],["Chakrabarty","Krishnendu",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 17:07:08 GMT"}],"updateDate":"2024-08-30","timestamp":1724605628000,"abstract":"  Analog and mixed-signal (A/MS) integrated circuits (ICs) are crucial in\nmodern electronics, playing key roles in signal processing, amplification,\nsensing, and power management. Many IC companies outsource manufacturing to\nthird-party foundries, creating security risks such as stealthy analog Trojans.\nTraditional detection methods, including embedding circuit watermarks or\nconducting hardware-based monitoring, often impose significant area and power\noverheads, and may not effectively identify all types of Trojans. To address\nthese shortcomings, we propose SPICED, a Large Language Model (LLM)-based\nframework that operates within the software domain, eliminating the need for\nhardware modifications for Trojan detection and localization. This is the first\nwork using LLM-aided techniques for detecting and localizing syntactical bugs\nand analog Trojans in circuit netlists, requiring no explicit training and\nincurring zero area overhead. Our framework employs chain-of-thought reasoning\nand few-shot examples to teach anomaly detection rules to LLMs. With the\nproposed method, we achieve an average Trojan coverage of 93.32% and an average\ntrue positive rate of 93.4% in identifying Trojan-impacted nodes for the\nevaluated analog benchmark circuits. These experimental results validate the\neffectiveness of LLMs in detecting and locating both syntactical bugs and\nTrojans within analog netlists.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}