{"id":"2408.09216","title":"Asymmetric dust accumulation of the PDS 70 disk revealed by ALMA Band 3\n  observations","authors":"Kiyoaki Doi, Akimasa Kataoka, Hauyu Baobab Liu, Tomohiro C. Yoshida,\n  Myriam Benisty, Ruobing Dong, Yoshihide Yamato, Jun Hashimoto","authorsParsed":[["Doi","Kiyoaki",""],["Kataoka","Akimasa",""],["Liu","Hauyu Baobab",""],["Yoshida","Tomohiro C.",""],["Benisty","Myriam",""],["Dong","Ruobing",""],["Yamato","Yoshihide",""],["Hashimoto","Jun",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 14:47:56 GMT"}],"updateDate":"2024-08-20","timestamp":1723906076000,"abstract":"  The PDS 70 system, hosting two planets within its disk, is an ideal target\nfor examining the effect of planets on dust accumulation, growth, and ongoing\nplanet formation. Here, we present high-resolution ($0.''07 = 8 \\ \\mathrm{au}$)\ndust continuum observations of the PDS 70 disk in ALMA Band 3 (3.0 mm). While\nprevious Band 7 observations showed a dust ring with slight asymmetry, our Band\n3 observations reveal a more prominent asymmetric peak in the northwest\ndirection, where the intensity is 2.5 times higher than in other directions and\nthe spectral index is at the local minimum with $\\alpha_{\\mathrm{SED}} \\sim\n2.2$. This indicates that a substantial amount of dust is accumulated both\nradially and azimuthally in the peak. We also detect point-source emission\naround the stellar position in the Band 3 image, which is likely to be\nfree-free emission. We constrain the eccentricity of the outer ring to be\n$e<0.04$ from the position of the central star and the outer ring. From the\ncomparison with numerical simulations, we constrain the mass of PDS 70c to be\nless than 4.9 Jupiter masses if the gas turbulence strength\n$\\alpha_{\\mathrm{turb}} = 10^{-3}$. Then, we discuss the formation mechanism of\nthe disk structures and further planet formation scenarios in the disk.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}