{"id":"2408.00334","title":"Significant Contributions of the Higgs Mode and Self-Energy Corrections\n  to Low-Frequency Complex Conductivity in DC-Biased Superconducting Devices","authors":"Takayuki Kubo","authorsParsed":[["Kubo","Takayuki",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 07:13:28 GMT"}],"updateDate":"2024-08-02","timestamp":1722496408000,"abstract":"  We investigate the complex conductivity of superconductors under a DC bias\nbased on the Keldysh-Eilenberger formalism of nonequilibrium superconductivity.\nThis framework allows us to account for the Higgs mode and impurity scattering\nself-energy corrections, which are known to significantly impact the complex\nconductivity under a bias DC, especially near the resonance frequency of the\nHiggs mode. The purpose of this paper is to explore the effects of these\ncontributions on the low-frequency complex conductivity relevant to\nsuperconducting device technologies. Our approach enables us to derive the\ncomplex conductivity formula for superconductors ranging from clean to dirty\nlimits, applicable to any bias DC strength. Our calculations reveal that the\nHiggs mode and impurity scattering self-energy corrections significantly affect\nthe complex conductivity even at low frequencies, relevant to superconducting\ndevice technologies. Specifically, we find that the real part of the\nlow-frequency complex conductivity exhibits a bias-dependent reduction up to\n\\(\\hbar \\omega \\sim 0.1\\), a much higher frequency than previously considered.\nThis finding allows for the suppression of dissipation in devices by tuning the\nbias DC. Additionally, through the calculation of the imaginary part of the\ncomplex conductivity, we evaluate the bias-dependent kinetic inductance for\nsuperconductors ranging from clean to dirty limits. The bias dependence becomes\nstronger as the mean free path decreases. Our dirty-limit results coincide with\nprevious studies based on the so-called slow experiment scenario. This widely\nused scenario can be understood as a phenomenological implementation of the\nHiggs mode into the kinetic inductance calculation, now justified by our\ncalculation based on the robust theory of nonequilibrium superconductivity,\nwhich microscopically treats the Higgs mode contribution.\n","subjects":["Condensed Matter/Superconductivity","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Y3Id5iqriJ85gCp59t87klUNmqfSpilNOg55i8OCiwQ","pdfSize":"1284963","txDigest":"5MVosiQyfJZxWjza7UU92m8ZL6ew8n3yz27DX8n8XBUq","endEpoch":"1","status":"CERTIFIED"}
