{"id":"2408.13468","title":"Modeling of Terrain Deformation by a Grouser Wheel for Lunar Rover\n  Simulation","authors":"Junnosuke Kamohara, Vinicius Ares, James Hurrell, Keisuke Takehana,\n  Antoine Richard, Shreya Santra, Kentaro Uno, Eric Rohmer and Kazuya Yoshida","authorsParsed":[["Kamohara","Junnosuke",""],["Ares","Vinicius",""],["Hurrell","James",""],["Takehana","Keisuke",""],["Richard","Antoine",""],["Santra","Shreya",""],["Uno","Kentaro",""],["Rohmer","Eric",""],["Yoshida","Kazuya",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 05:09:09 GMT"}],"updateDate":"2024-08-27","timestamp":1724476149000,"abstract":"  Simulation of vehicle motion in planetary environments is challenging. This\nis due to the modeling of complex terrain, optical conditions, and\nterrain-aware vehicle dynamics. One of the critical issues of typical\nsimulators is that they assume terrain is a rigid body, which limits their\nability to render wheel traces and compute the wheel-terrain interactions. This\nprevents, for example, the use of wheel traces as landmarks for localization,\nas well as the accurate simulation of motion. In the context of lunar regolith,\nthe surface is not rigid but granular. As such, there are differences in the\nrover's motion, such as sinkage and slippage, and a clear wheel trace left\nbehind the rover, compared to that on a rigid terrain. This study presents a\nnovel approach to integrating a terramechanics-aware terrain deformation engine\nto simulate a realistic wheel trace in a digital lunar environment. By\nleveraging Discrete Element Method simulation results alongside experimental\nsingle-wheel test data, we construct a regression model to derive deformation\nheight as a function of contact normal force. The region of interest in a\nheight map is retrieved from the wheel poses. The elevation values of\ncorresponding pixels are subsequently modified using contact normal forces and\nthe regression model. Finally, we apply the determined elevation change to each\nmesh vertex to render wheel traces during runtime. The deformation engine is\nintegrated into our ongoing development of a lunar simulator based on NVIDIA's\nOmniverse IsaacSim. We hypothesize that our work will be crucial to testing\nperception and downstream navigation systems under conditions similar to\noutdoor or terrestrial fields. A demonstration video is available here:\nhttps://www.youtube.com/watch?v=TpzD0h-5hv4\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}