{"id":"2408.08589","title":"Cosmological Prediction of the Void and Galaxy Clustering Measurements\n  in the CSST Spectroscopic Survey","authors":"Yingxiao Song, Qi Xiong, Yan Gong, Furen Deng, Kwan Chuen Chan, Xuelei\n  Chen, Qi Guo, Guoliang Li, Ming Li, Yun Liu, Yu Luo, Wenxiang Pei, and\n  Chengliang Wei","authorsParsed":[["Song","Yingxiao",""],["Xiong","Qi",""],["Gong","Yan",""],["Deng","Furen",""],["Chan","Kwan Chuen",""],["Chen","Xuelei",""],["Guo","Qi",""],["Li","Guoliang",""],["Li","Ming",""],["Liu","Yun",""],["Luo","Yu",""],["Pei","Wenxiang",""],["Wei","Chengliang",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 07:47:03 GMT"}],"updateDate":"2024-08-19","timestamp":1723794423000,"abstract":"  The void power spectrum is related to the clustering of low-density regions\nin the large-scale structure (LSS) of the Universe, and can be used as an\neffective cosmological probe to extract the information of the LSS. We generate\nthe galaxy mock catalogs from Jiutian simulation, and identify voids using the\nwatershed algorithm for studying the cosmological constraint strength of the\nChina Space Station Telescope (CSST) spectroscopic survey. The galaxy and void\nauto power spectra and void-galaxy cross power spectra at $z=0.3$, 0.6, and 0.9\nare derived from the mock catalogs. To fit the full power spectra, we propose\nto use the void average effective radius at a given redshift to simplify the\ntheoretical model, and adopt the Markov Chain Monte Carlo (MCMC) technique to\nimplement the constraints on the cosmological and void parameters. The\nsystematical parameters, such as galaxy and void biases, and noise terms in the\npower spectra are also included in the fitting process. We find that our\ntheoretical model can correctly extract the cosmological information from the\ngalaxy and void power spectra, which demonstrates its feasibility and\neffectivity. The joint constraint accuracy of the cosmological parameters can\nbe improved by $\\sim20\\%$ compared to that from the galaxy power spectrum only.\nThe fitting results of the void density profile and systematical parameters are\nalso well constrained and consistent with the expectation. This indicates that\nthe void clustering measurement can be an effective complement to the galaxy\nclustering probe, especially for the next generation galaxy surveys.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}