{"id":"2408.10356","title":"Diversity and stylization of the contemporary user-generated visual arts\n  in the complexity-entropy plane","authors":"Seunghwan Kim, Byunghwee Lee, Wonjae Lee","authorsParsed":[["Kim","Seunghwan",""],["Lee","Byunghwee",""],["Lee","Wonjae",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:54:01 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 16:42:06 GMT"}],"updateDate":"2024-08-22","timestamp":1724093641000,"abstract":"  The advent of computational and numerical methods in recent times has\nprovided new avenues for analyzing art historiographical narratives and tracing\nthe evolution of art styles therein. Here, we investigate an evolutionary\nprocess underpinning the emergence and stylization of contemporary\nuser-generated visual art styles using the complexity-entropy (C-H) plane,\nwhich quantifies local structures in paintings. Informatizing 149,780 images\ncurated in DeviantArt and Behance platforms from 2010 to 2020, we analyze the\nrelationship between local information of the C-H space and multi-level image\nfeatures generated by a deep neural network and a feature extraction algorithm.\nThe results reveal significant statistical relationships between the C-H\ninformation of visual artistic styles and the dissimilarities of the\nmulti-level image features over time within groups of artworks. By disclosing a\nparticular C-H region where the diversity of image representations is\nnoticeably manifested, our analyses reveal an empirical condition of emerging\nstyles that are both novel in the C-H plane and characterized by greater\nstylistic diversity. Our research shows that visual art analyses combined with\nphysics-inspired methodologies and machine learning, can provide macroscopic\ninsights into quantitatively mapping relevant characteristics of an\nevolutionary process underpinning the creative stylization of uncharted visual\narts of given groups and time.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Physics/Data Analysis, Statistics and Probability","Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IfDvB-WWFJK2l2TfDTcCvy7R4R_w-H1H3tuXr7Rrwxc","pdfSize":"6164396"}
