{"id":"2408.07064","title":"On Networks and their Applications: Stability of Gene Regulatory\n  Networks and Gene Function Prediction using Autoencoders","authors":"Hamza Coban","authorsParsed":[["Coban","Hamza",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 17:57:11 GMT"}],"updateDate":"2024-08-14","timestamp":1723571831000,"abstract":"  We prove that nested canalizing functions are the minimum-sensitivity Boolean\nfunctions for any activity ratio and we determine the functional form of this\nboundary which has a nontrivial fractal structure. We further observe that the\nmajority of the gene regulatory functions found in known biological networks\n(submitted to the Cell Collective database) lie on the line of minimum\nsensitivity which paradoxically remains largely in the unstable regime. Our\nresults provide a quantitative basis for the argument that an evolutionary\npreference for nested canalizing functions in gene regulation (e.g., for higher\nrobustness) and for elasticity of gene activity are sufficient for\nconcentration of such systems near the \"edge of chaos.\" The original structure\nof gene regulatory networks is unknown due to the undiscovered functions of\nsome genes. Most gene function discovery approaches make use of unsupervised\nclustering or classification methods that discover and exploit patterns in gene\nexpression profiles. However, existing knowledge in the field derives from\nmultiple and diverse sources. Incorporating this know-how for novel gene\nfunction prediction can, therefore, be expected to improve such predictions. We\nhere propose a function-specific novel gene discovery tool that uses a\nsemi-supervised autoencoder. Our method is thus able to address the needs of a\nmodern researcher whose expertise is typically confined to a specific\nfunctional domain. Lastly, the dynamics of unorthodox learning approaches like\nbiologically plausible learning algorithms are investigated and found to\nexhibit a general form of Einstein relation.\n","subjects":["Quantitative Biology/Molecular Networks","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0dtJce27t9L8gYcI0i4Y9VcUeT-mET29x1XGLyD-Tdc","pdfSize":"2391267"}
