{"id":"2408.01599","title":"Strongly interacting Hofstadter states in magic-angle twisted bilayer\n  graphene","authors":"Minhao He, Xiaoyu Wang, Jiaqi Cai, Jonah Herzog-Arbeitman, Takashi\n  Taniguchi, Kenji Watanabe, Ady Stern, B. Andrei Bernevig, Matthew Yankowitz,\n  Oskar Vafek, Xiaodong Xu","authorsParsed":[["He","Minhao",""],["Wang","Xiaoyu",""],["Cai","Jiaqi",""],["Herzog-Arbeitman","Jonah",""],["Taniguchi","Takashi",""],["Watanabe","Kenji",""],["Stern","Ady",""],["Bernevig","B. Andrei",""],["Yankowitz","Matthew",""],["Vafek","Oskar",""],["Xu","Xiaodong",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 23:08:54 GMT"}],"updateDate":"2024-08-06","timestamp":1722640134000,"abstract":"  Magic-angle twisted bilayer graphene (MATBG) hosts a multitude of strongly\ncorrelated states at partial fillings of its flat bands. In a magnetic field,\nthese flat bands further evolve into a unique Hofstadter spectrum renormalized\nby strong Coulomb interactions. Here, we study the interacting Hofstadter\nstates spontaneously formed within the topological magnetic subbands of an\nultraclean MATBG device, notably including symmetry-broken Chern insulator\n(SBCI) states and fractional quantum Hall (FQH) states. The observed SBCI\nstates form a cascade with their Chern numbers mimicking the main sequence\ncorrelated Chern insulators. The FQH states in MATBG form in Jain sequence;\nhowever, they disappear at high magnetic field, distinct from conventional FQH\nstates which strengthen with increasing magnetic field. We reveal a unique\nmagnetic field-driven phase transition from composite fermion phases to a\ndissipative Fermi liquid. Our theoretical analysis of the magnetic subbands\nhosting FQH states predicts non uniform quantum geometric properties far from\nthe lowest Landau level. This points towards a more natural interpretation of\nthese FQH states as in-field fractional Chern insulators of the magnetic\nsubbands.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}