{"id":"2408.01040","title":"Privacy-Preserving Split Learning with Vision Transformers using\n  Patch-Wise Random and Noisy CutMix","authors":"Seungeun Oh, Sihun Baek, Jihong Park, Hyelin Nam, Praneeth Vepakomma,\n  Ramesh Raskar, Mehdi Bennis, and Seong-Lyun Kim","authorsParsed":[["Oh","Seungeun",""],["Baek","Sihun",""],["Park","Jihong",""],["Nam","Hyelin",""],["Vepakomma","Praneeth",""],["Raskar","Ramesh",""],["Bennis","Mehdi",""],["Kim","Seong-Lyun",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 06:24:39 GMT"}],"updateDate":"2024-08-05","timestamp":1722579879000,"abstract":"  In computer vision, the vision transformer (ViT) has increasingly superseded\nthe convolutional neural network (CNN) for improved accuracy and robustness.\nHowever, ViT's large model sizes and high sample complexity make it difficult\nto train on resource-constrained edge devices. Split learning (SL) emerges as a\nviable solution, leveraging server-side resources to train ViTs while utilizing\nprivate data from distributed devices. However, SL requires additional\ninformation exchange for weight updates between the device and the server,\nwhich can be exposed to various attacks on private training data. To mitigate\nthe risk of data breaches in classification tasks, inspired from the CutMix\nregularization, we propose a novel privacy-preserving SL framework that injects\nGaussian noise into smashed data and mixes randomly chosen patches of smashed\ndata across clients, coined DP-CutMixSL. Our analysis demonstrates that\nDP-CutMixSL is a differentially private (DP) mechanism that strengthens privacy\nprotection against membership inference attacks during forward propagation.\nThrough simulations, we show that DP-CutMixSL improves privacy protection\nagainst membership inference attacks, reconstruction attacks, and label\ninference attacks, while also improving accuracy compared to DP-SL and\nDP-MixSL.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Cryptography and Security","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}