{"id":"2408.12308","title":"Deep Learning with CNNs: A Compact Holistic Tutorial with Focus on\n  Supervised Regression (Preprint)","authors":"Yansel Gonzalez Tejeda and Helmut A. Mayer","authorsParsed":[["Tejeda","Yansel Gonzalez",""],["Mayer","Helmut A.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 11:34:34 GMT"},{"version":"v2","created":"Tue, 17 Sep 2024 16:22:18 GMT"}],"updateDate":"2024-09-18","timestamp":1724326474000,"abstract":"  In this tutorial, we present a compact and holistic discussion of Deep\nLearning with a focus on Convolutional Neural Networks (CNNs) and supervised\nregression. While there are numerous books and articles on the individual\ntopics we cover, comprehensive and detailed tutorials that address Deep\nLearning from a foundational yet rigorous and accessible perspective are rare.\nMost resources on CNNs are either too advanced, focusing on cutting-edge\narchitectures, or too narrow, addressing only specific applications like image\nclassification.This tutorial not only summarizes the most relevant concepts but\nalso provides an in-depth exploration of each, offering a complete yet agile\nset of ideas. Moreover, we highlight the powerful synergy between learning\ntheory, statistic, and machine learning, which together underpin the Deep\nLearning and CNN frameworks. We aim for this tutorial to serve as an optimal\nresource for students, professors, and anyone interested in understanding the\nfoundations of Deep Learning. Upon acceptance we will provide an accompanying\nrepository under\n\\href{https://github.com/neoglez/deep-learning-tutorial}{https://github.com/neoglez/deep-learning-tutorial}\n  Keywords: Tutorial, Deep Learning, Convolutional Neural Networks, Machine\nLearning.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"RwWmqudNZkARI7x0Gsqwp3TLJNEIpFgLFKrvMT4oHtM","pdfSize":"855404"}
