{"id":"2408.15080","title":"Squeezed state protection of fine structure in \"Poor Man's Majorana\" via\n  quantum spin coupling","authors":"J.E. Sanches, L.T. Lustosa, L.S. Ricco, H. Sigur{\\dh}sson, M. de\n  Souza, M.S. Figueira, E. Marinho Jr. and A.C. Seridonio","authorsParsed":[["Sanches","J. E.",""],["Lustosa","L. T.",""],["Ricco","L. S.",""],["Sigurðsson","H.",""],["de Souza","M.",""],["Figueira","M. S.",""],["Marinho","E.","Jr."],["Seridonio","A. C.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 14:11:08 GMT"}],"updateDate":"2024-08-28","timestamp":1724767868000,"abstract":"  The \"Poor Man's Majorana\" [Phys. Rev. B 86, 134528 (2012)] devoid of\ntopological protection has been theoretically predicted to rely on the minimal\nKitaev chain. Afterward, a pair of superconducting and spinless quantum dots\nturned the proposal practicable and differential conductance pinpointed\nconsistent fingerprints with such a scenario [Nature 614, 445 (2023) and Nature\n630, 329 (2024)]. In this work, we propose a model wherein the \"Poor Man's\nMajorana\" presents protection when one of the dots is exchange coupled to a\nquantum spin. If this quantum dot is perturbed by tuning the exchange coupling,\nthe well-known spill over-like behavior of this Majorana surprisingly remains\nunchanged, and solely half of the fine structure is unexpectedly viewed. As a\nmatter of fact, the \"Poor Man's Majorana\" zero mode consists in squeezing of\nthe other half at zero frequency, which imposes its pinning there and prevents\nthe mixing of the mode with the explicit fine structure. We claim that if the\nsupposed unavoidable split of the zero mode by the fine structure is\nunexpectedly absent, then the \"Poor Man's Majorana\" can be considered robust\nagainst the quantum spin. In this way, it becomes protected and the lack of\ntopological protection paradigm of the \"Poor Man's Majorana\" has been\nrevisited, pushing this seemingly well-established issue into a new direction.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}