{"id":"2408.09560","title":"Deep Learning for the Estimation of Heterogeneous Parameters in Discrete\n  Choice Models","authors":"Stephan Hetzenecker and Maximilian Osterhaus","authorsParsed":[["Hetzenecker","Stephan",""],["Osterhaus","Maximilian",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 18:11:33 GMT"}],"updateDate":"2024-08-20","timestamp":1724004693000,"abstract":"  This paper studies the finite sample performance of the flexible estimation\napproach of Farrell, Liang, and Misra (2021a), who propose to use deep learning\nfor the estimation of heterogeneous parameters in economic models, in the\ncontext of discrete choice models. The approach combines the structure imposed\nby economic models with the flexibility of deep learning, which assures the\ninterpretebility of results on the one hand, and allows estimating flexible\nfunctional forms of observed heterogeneity on the other hand. For inference\nafter the estimation with deep learning, Farrell et al. (2021a) derive an\ninfluence function that can be applied to many quantities of interest. We\nconduct a series of Monte Carlo experiments that investigate the impact of\nregularization on the proposed estimation and inference procedure in the\ncontext of discrete choice models. The results show that the deep learning\napproach generally leads to precise estimates of the true average parameters\nand that regular robust standard errors lead to invalid inference results,\nshowing the need for the influence function approach for inference. Without\nregularization, the influence function approach can lead to substantial bias\nand large estimated standard errors caused by extreme outliers. Regularization\nreduces this property and stabilizes the estimation procedure, but at the\nexpense of inducing an additional bias. The bias in combination with decreasing\nvariance associated with increasing regularization leads to the construction of\ninvalid inferential statements in our experiments. Repeated sample splitting,\nunlike regularization, stabilizes the estimation approach without introducing\nan additional bias, thereby allowing for the construction of valid inferential\nstatements.\n","subjects":["Economics/Econometrics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}