{"id":"2408.09912","title":"Harnessing Multi-resolution and Multi-scale Attention for Underwater\n  Image Restoration","authors":"Alik Pramanick, Arijit Sur and V. Vijaya Saradhi","authorsParsed":[["Pramanick","Alik",""],["Sur","Arijit",""],["Saradhi","V. Vijaya",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 11:36:48 GMT"}],"updateDate":"2024-08-20","timestamp":1724067408000,"abstract":"  Underwater imagery is often compromised by factors such as color distortion\nand low contrast, posing challenges for high-level vision tasks. Recent\nunderwater image restoration (UIR) methods either analyze the input image at\nfull resolution, resulting in spatial richness but contextual weakness, or\nprogressively from high to low resolution, yielding reliable semantic\ninformation but reduced spatial accuracy. Here, we propose a lightweight\nmulti-stage network called Lit-Net that focuses on multi-resolution and\nmulti-scale image analysis for restoring underwater images while retaining\noriginal resolution during the first stage, refining features in the second,\nand focusing on reconstruction in the final stage. Our novel encoder block\nutilizes parallel $1\\times1$ convolution layers to capture local information\nand speed up operations. Further, we incorporate a modified weighted color\nchannel-specific $l_1$ loss ($cl_1$) function to recover color and detail\ninformation. Extensive experimentations on publicly available datasets suggest\nour model's superiority over recent state-of-the-art methods, with significant\nimprovement in qualitative and quantitative measures, such as $29.477$ dB PSNR\n($1.92\\%$ improvement) and $0.851$ SSIM ($2.87\\%$ improvement) on the EUVP\ndataset. The contributions of Lit-Net offer a more robust approach to\nunderwater image enhancement and super-resolution, which is of considerable\nimportance for underwater autonomous vehicles and surveillance. The code is\navailable at: https://github.com/Alik033/Lit-Net.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1nNZniNu7z_DsAQqZXLwsCnshSPclfbp1D-xZNxi_lI","pdfSize":"26723423"}
