{"id":"2408.07140","title":"Nanostructuring of AlCu alloy NPs obtained by FLASiS{\\dag}","authors":"Jesica M. J. Santill\\'an, David Mu\\~net\\'on Arboleda, Osvaldo Fornaro,\n  Marcelo Lester, Daniel C. Schinca, Luc\\'ia B. Scaffardi","authorsParsed":[["Santillán","Jesica M. J.",""],["Arboleda","David Muñetón",""],["Fornaro","Osvaldo",""],["Lester","Marcelo",""],["Schinca","Daniel C.",""],["Scaffardi","Lucía B.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 18:17:54 GMT"}],"updateDate":"2024-08-15","timestamp":1723573074000,"abstract":"  In the nanometric scale, alloy nanomaterials behave as new materials since\nthey are able to display structures and properties which are different from\nthose of the pure metal nanostructures or bulk alloys. In this work, the\ncompositional characteristics of AlCu alloy nanoparticles obtained by\n{\\dag}Femtosecond Laser Ablation Synthesis in Solution (FLASiS) on solid\ntargets with different percentages of Al and Cu were studied. Morphology,\nstructure, composition and plasmonic behaviour of the nanoparticles were\nanalysed by Scanning Electron Microscopy (SEM), Transmission Electron\nMicroscopy (TEM), Energy-Dispersive X-ray Spectroscopy (EDS) and Optical\nExtinction Spectroscopy (OES). From the obtained results, underlying formation\nmechanism and a configuration model of a host alumina matrix with copper\ninclusions is proposed. Analysis of the plasmonic resonance spectral region in\nthe extinction spectra of the synthesized colloids using this model show that\nthe nanoparticles have a Cu filling factors of about 0.02 which agrees with\nthose determined independently from TEM images. The amount of Al and Cu\ncomponents in the nanoparticle depends on their relative percentages in the\ninitial solid target. Here we describe the possible kinetic formation mechanism\nof these nanostructures.\n","subjects":["Physics/Optics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}