{"id":"2408.01413","title":"A Game Theoretic Analysis of High Occupancy Toll Lane Design","authors":"Zhanhao Zhang, Ruifan Yang, Manxi Wu","authorsParsed":[["Zhang","Zhanhao",""],["Yang","Ruifan",""],["Wu","Manxi",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 17:42:01 GMT"}],"updateDate":"2024-08-05","timestamp":1722620521000,"abstract":"  In this article, we study the optimal design of High Occupancy Toll (HOT)\nlanes. The traffic authority determines the road capacity allocation between\nHOT lanes and ordinary lanes, as well as the toll price charged for travelers\nusing HOT lanes who do not meet the high-occupancy eligibility criteria. We\ndevelop a game-theoretic model to analyze the decisions of travelers with\nheterogeneous preference parameters in values of time and carpool disutilities.\nThese travelers choose between paying or forming carpools to use the HOT lanes,\nor taking the ordinary lanes. Travelers' welfare depends on the congestion cost\nof the lane they use, the toll payment, and the carpool disutilities. For\nhighways with a single entrance and exit node, we provide a complete\ncharacterization of equilibrium strategies and a comparative statics analysis\nof how the equilibrium vehicle flow and travel time change with HOT capacity\nand toll price. We then extend the single segment model to highways with\nmultiple entrance and exit nodes. We extend the equilibrium concept and propose\nvarious design objectives considering traffic congestion, toll revenue, and\nsocial welfare. Using the data collected from the HOT lane of the California\nInterstate Highway 880 (I-880), we formulate a convex program to estimate the\ntravel demand and approximate the distribution of travelers' preference\nparameters. We then compute the optimal toll design of five segments for I-880\nfor achieve each one of the four objectives, and compare the optimal solution\nwith the current toll pricing.\n","subjects":["Computing Research Repository/Computer Science and Game Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}