{"id":"2408.09012","title":"Autoregressive models for panel data causal inference with application\n  to state-level opioid policies","authors":"Joseph Antonelli and Max Rubinstein and Denis Agniel and Rosanna Smart\n  and Elizabeth Stuart and Matthew Cefalu and Terry Schell and Joshua Eagan and\n  Elizabeth Stone and Max Griswold and Mark Sorbero and Beth Ann Griffin","authorsParsed":[["Antonelli","Joseph",""],["Rubinstein","Max",""],["Agniel","Denis",""],["Smart","Rosanna",""],["Stuart","Elizabeth",""],["Cefalu","Matthew",""],["Schell","Terry",""],["Eagan","Joshua",""],["Stone","Elizabeth",""],["Griswold","Max",""],["Sorbero","Mark",""],["Griffin","Beth Ann",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 20:42:05 GMT"}],"updateDate":"2024-08-20","timestamp":1723840925000,"abstract":"  Motivated by the study of state opioid policies, we propose a novel approach\nthat uses autoregressive models for causal effect estimation in settings with\npanel data and staggered treatment adoption. Specifically, we seek to estimate\nof the impact of key opioid-related policies by quantifying the effects of must\naccess prescription drug monitoring programs (PDMPs), naloxone access laws\n(NALs), and medical marijuana laws on opioid prescribing. Existing methods,\nsuch as differences-in-differences and synthetic controls, are challenging to\napply in these types of dynamic policy landscapes where multiple policies are\nimplemented over time and sample sizes are small. Autoregressive models are an\nalternative strategy that have been used to estimate policy effects in similar\nsettings, but until this paper have lacked formal justification. We outline a\nset of assumptions that tie these models to causal effects, and we study biases\nof estimates based on this approach when key causal assumptions are violated.\nIn a set of simulation studies that mirror the structure of our application, we\nalso show that our proposed estimators frequently outperform existing\nestimators. In short, we justify the use of autoregressive models to provide\nrobust evidence on the effectiveness of four state policies in combating the\nopioid crisis.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}