{"id":"2408.04568","title":"Learning Fine-Grained Grounded Citations for Attributed Large Language\n  Models","authors":"Lei Huang, Xiaocheng Feng, Weitao Ma, Yuxuan Gu, Weihong Zhong,\n  Xiachong Feng, Weijiang Yu, Weihua Peng, Duyu Tang, Dandan Tu, Bing Qin","authorsParsed":[["Huang","Lei",""],["Feng","Xiaocheng",""],["Ma","Weitao",""],["Gu","Yuxuan",""],["Zhong","Weihong",""],["Feng","Xiachong",""],["Yu","Weijiang",""],["Peng","Weihua",""],["Tang","Duyu",""],["Tu","Dandan",""],["Qin","Bing",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 16:28:22 GMT"}],"updateDate":"2024-08-09","timestamp":1723134502000,"abstract":"  Despite the impressive performance on information-seeking tasks, large\nlanguage models (LLMs) still struggle with hallucinations. Attributed LLMs,\nwhich augment generated text with in-line citations, have shown potential in\nmitigating hallucinations and improving verifiability. However, current\napproaches suffer from suboptimal citation quality due to their reliance on\nin-context learning. Furthermore, the practice of citing only coarse document\nidentifiers makes it challenging for users to perform fine-grained\nverification. In this work, we introduce FRONT, a training framework designed\nto teach LLMs to generate Fine-Grained Grounded Citations. By grounding model\noutputs in fine-grained supporting quotes, these quotes guide the generation of\ngrounded and consistent responses, not only improving citation quality but also\nfacilitating fine-grained verification. Experiments on the ALCE benchmark\ndemonstrate the efficacy of FRONT in generating superior grounded responses and\nhighly supportive citations. With LLaMA-2-7B, the framework significantly\noutperforms all the baselines, achieving an average of 14.21% improvement in\ncitation quality across all datasets, even surpassing ChatGPT.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}