{"id":"2408.05950","title":"Robust online reconstruction of continuous-time signals from a lean\n  spike train ensemble code","authors":"Anik Chattopadhyay, Arunava Banerjee","authorsParsed":[["Chattopadhyay","Anik",""],["Banerjee","Arunava",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 06:55:51 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 16:43:36 GMT"}],"updateDate":"2024-08-15","timestamp":1723445751000,"abstract":"  Sensory stimuli in animals are encoded into spike trains by neurons, offering\nadvantages such as sparsity, energy efficiency, and high temporal resolution.\nThis paper presents a signal processing framework that deterministically\nencodes continuous-time signals into biologically feasible spike trains, and\naddresses the questions about representable signal classes and reconstruction\nbounds. The framework considers encoding of a signal through spike trains\ngenerated by an ensemble of neurons using a convolve-then-threshold mechanism\nwith various convolution kernels. A closed-form solution to the inverse\nproblem, from spike trains to signal reconstruction, is derived in the Hilbert\nspace of shifted kernel functions, ensuring sparse representation of a\ngeneralized Finite Rate of Innovation (FRI) class of signals. Additionally,\ninspired by real-time processing in biological systems, an efficient iterative\nversion of the optimal reconstruction is formulated that considers only a\nfinite window of past spikes, ensuring robustness of the technique to\nill-conditioned encoding; convergence guarantees of the windowed reconstruction\nto the optimal solution are then provided. Experiments on a large audio dataset\ndemonstrate excellent reconstruction accuracy at spike rates as low as\none-fifth of the Nyquist rate, while showing clear competitive advantage in\ncomparison to state-of-the-art sparse coding techniques in the low spike rate\nregime.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}