{"id":"2408.17415","title":"Comparing Inflationary Models in Extended Metric-Affine Theories of\n  Gravity","authors":"Salvatore Capozziello, Mehdi Shokri","authorsParsed":[["Capozziello","Salvatore",""],["Shokri","Mehdi",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 17:02:30 GMT"}],"updateDate":"2024-09-02","timestamp":1725037350000,"abstract":"  We study slow-roll inflation as a common feature in Metric-affine Theories of\nGravity. In particular, we take into account extended metric, teleparallel and\nsymmetric-teleparallel theories of gravity, based on different geometric\ninvariants, discussing analogies and differences. The analysis for each model\nis performed in two approaches. First, we focus on the {\\it potential-slow-roll\napproach} by studying the reconstructed potentials for different forms of the\nextended models related to the considered gravitational theory in the Einstein\nframe. Secondly, we investigate the {\\it Hubble-slow-roll approach} for some\nconventional inflationary potentials related to the specific extended model in\nthe Jordan frame. We compare all results with cosmic microwave background\nanisotropy observations coming from Planck 2018 and BICEP2/Keck array\nsatellites in order to find the observational constraints on the parameters\nspace of the models as well as their prediction from the spectral parameters.\nEventually, we attempt to present a qualitative comparison between three\nclasses of considered modified gravities using the obtained inflationary\nresults. The aim is to select, in principle, cosmological signatures capable of\ndiscriminating among concurrent models in view to point out the representation\nof gravity, according with geometric invariants, which better addresses the\nearly universe dynamics.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}