{"id":"2408.15436","title":"Online Event-Triggered Switching for Frequency Control in Power Grids\n  with Variable Inertia","authors":"Jie Feng, Wenqi Cui, Jorge Cort\\'es, Yuanyuan Shi","authorsParsed":[["Feng","Jie",""],["Cui","Wenqi",""],["Cortés","Jorge",""],["Shi","Yuanyuan",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 22:44:33 GMT"}],"updateDate":"2024-08-29","timestamp":1724798673000,"abstract":"  The increasing integration of renewable energy resources into power grids has\nled to time-varying system inertia and consequent degradation in frequency\ndynamics. A promising solution to alleviate performance degradation is using\npower electronics interfaced energy resources, such as renewable generators and\nbattery energy storage for primary frequency control, by adjusting their power\noutput set-points in response to frequency deviations. However, designing a\nfrequency controller under time-varying inertia is challenging. Specifically,\nthe stability or optimality of controllers designed for time-invariant systems\ncan be compromised once applied to a time-varying system. We model the\nfrequency dynamics under time-varying inertia as a nonlinear switching system,\nwhere the frequency dynamics under each mode are described by the nonlinear\nswing equations and different modes represent different inertia levels. We\nidentify a key controller structure, named Neural Proportional-Integral\n(Neural-PI) controller, that guarantees exponential input-to-state stability\nfor each mode. To further improve performance, we present an online\nevent-triggered switching algorithm to select the most suitable controller from\na set of Neural-PI controllers, each optimized for specific inertia levels.\nSimulations on the IEEE 39-bus system validate the effectiveness of the\nproposed online switching control method with stability guarantees and\noptimized performance for frequency control under time-varying inertia.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}