{"id":"2408.06674","title":"Compact robotic gripper with tandem actuation for selective fruit\n  harvesting","authors":"Alejandro Velasquez, Cindy Grimm, Joseph R. Davidson","authorsParsed":[["Velasquez","Alejandro",""],["Grimm","Cindy",""],["Davidson","Joseph R.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 06:54:19 GMT"}],"updateDate":"2024-08-14","timestamp":1723532059000,"abstract":"  Selective fruit harvesting is a challenging manipulation problem due to\nocclusions and clutter arising from plant foliage. A harvesting gripper should\ni) have a small cross-section, to avoid collisions while approaching the fruit;\nii) have a soft and compliant grasp to adapt to different fruit geometry and\navoid bruising it; and iii) be capable of rigidly holding the fruit tightly\nenough to counteract detachment forces. Previous work on fruit harvesting has\nprimarily focused on using grippers with a single actuation mode, either\nsuction or fingers. In this paper we present a compact robotic gripper that\ncombines the benefits of both. The gripper first uses an array of compliant\nsuction cups to gently attach to the fruit. After attachment, telescoping\ncam-driven fingers deploy, sweeping obstacles away before pivoting inwards to\nprovide a secure grip on the fruit for picking. We present and analyze the\nfinger design for both ability to sweep clutter and maintain a tight grasp.\nSpecifically, we use a motorized test bed to measure grasp strength for each\nactuation mode (suction, fingers, or both). We apply a tensile force at\ndifferent angles (0{\\deg}, 15{\\deg}, 30{\\deg} and 45{\\deg}), and vary the point\nof contact between the fingers and the fruit. We observed that with both modes\nthe grasp strength is approximately 40 N. We use an apple proxy to test the\ngripper's ability to obtain a grasp in the presence of occluding apples and\nleaves, achieving a grasp success rate over 96% (with an ideal controller).\nFinally, we validate our gripper in a commercial apple orchard.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}