{"id":"2408.02246","title":"AMIDER: A Multidisciplinary Research Database and Its Application to\n  Promote Open Science","authors":"Masayoshi Kozai (1), Yoshimasa Tanaka (1 and 2), Shuji Abe (3),\n  Yasuyuki Minamiyama (4), Atsuki Shinbori (5), Akira Kadokura (1) ((1) Polar\n  Environment Data Science Center, Joint Support-Center for Data Science\n  Research, Research Organization of Information and Systems, Tachikawa, Japan,\n  (2) National Institute of Polar Research, Research Organization of\n  Information and Systems, Tachikawa, Japan, (3) International Research Center\n  for Space and Planetary Environmental Science, Kyushu University, Fukuoka,\n  Japan, (4) Research Center for Open Science and Data Platform, National\n  Institute of Informatics, Research Organization of Information and Systems,\n  Tokyo, Japan, (5) Institute for Space and Earth Environmental Research Center\n  for Integrated Data Science, Nagoya University, Nagoya, Japan)","authorsParsed":[["Kozai","Masayoshi","","1 and 2"],["Tanaka","Yoshimasa","","1 and 2"],["Abe","Shuji",""],["Minamiyama","Yasuyuki",""],["Shinbori","Atsuki",""],["Kadokura","Akira",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 05:38:48 GMT"}],"updateDate":"2024-08-06","timestamp":1722836328000,"abstract":"  The AMIDER, Advanced Multidisciplinary Integrated-Database for Exploring new\nResearch, is a newly developed research data catalog to demonstrate an advanced\ndatabase application. AMIDER is characterized as a multidisciplinary database\nequipped with a user-friendly web application. Its catalog view displays\ndiverse research data at once beyond any limitation of each individual\ndiscipline. Some useful functions, such as a selectable data download, data\nformat conversion, and display of data visual information, are also\nimplemented. Further advanced functions, such as visualization of dataset\nmutual relationship, are also implemented as a preliminary trial. These\ncharacteristics and functions are expected to enhance the accessibility to\nindividual research data, even from non-expertized users, and be helpful for\ncollaborations among diverse scientific fields beyond individual disciplines.\nMultidisciplinary data management is also one of AMIDER's uniqueness, where\nvarious metadata schemas can be mapped to a uniform metadata table, and\nstandardized and self-describing data formats are adopted. AMIDER website\n(https://amider.rois.ac.jp/) had been launched in April 2024. As of July 2024,\nover 15,000 metadata in various research fields of polar science have been\nregistered in the database, and approximately 500 visitors are viewing the\nwebsite every day on average. Expansion of the database to further\nmultidisciplinary scientific fields, not only polar science, is planned, and\nadvanced attempts, such as applying Natural Language Processing (NLP) to\nmetadata, have also been considered.\n","subjects":["Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"TsOzCmMCWN4soI7jhg8tyAMj4wp6RwSHerhf_eQD74o","pdfSize":"943455"}
