{"id":"2408.12500","title":"WhisperMask: A Noise Suppressive Mask-Type Microphone for Whisper Speech","authors":"Hirotaka Hiraki, Shusuke Kanazawa, Takahiro Miura, Manabu Yoshida,\n  Masaaki Mochimaru, and Jun Rekimoto","authorsParsed":[["Hiraki","Hirotaka",""],["Kanazawa","Shusuke",""],["Miura","Takahiro",""],["Yoshida","Manabu",""],["Mochimaru","Masaaki",""],["Rekimoto","Jun",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 15:51:07 GMT"}],"updateDate":"2024-08-23","timestamp":1724341867000,"abstract":"  Whispering is a common privacy-preserving technique in voice-based\ninteractions, but its effectiveness is limited in noisy environments. In\nconventional hardware- and software-based noise reduction approaches, isolating\nwhispered speech from ambient noise and other speech sounds remains a\nchallenge. We thus propose WhisperMask, a mask-type microphone featuring a\nlarge diaphragm with low sensitivity, making the wearer's voice significantly\nlouder than the background noise. We evaluated WhisperMask using three key\nmetrics: signal-to-noise ratio, quality of recorded voices, and speech\nrecognition rate. Across all metrics, WhisperMask consistently outperformed\ntraditional noise-suppressing microphones and software-based solutions.\nNotably, WhisperMask showed a 30% higher recognition accuracy for whispered\nspeech recorded in an environment with 80 dB background noise compared with the\npin microphone and earbuds. Furthermore, while a denoiser decreased the\nwhispered speech recognition rate of these two microphones by approximately 20%\nat 30-60 dB noise, WhisperMask maintained a high performance even without\ndenoising, surpassing the other microphones' performances by a significant\nmargin.WhisperMask's design renders the wearer's voice as the dominant input\nand effectively suppresses background noise without relying on signal\nprocessing. This device allows for reliable voice interactions, such as phone\ncalls and voice commands, in a wide range of noisy real-world scenarios while\npreserving user privacy.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}