{"id":"2408.12613","title":"Deceptive uses of Artificial Intelligence in elections strengthen\n  support for AI ban","authors":"Andreas Jungherr, Adrian Rauchfleisch, Alexander Wuttke","authorsParsed":[["Jungherr","Andreas",""],["Rauchfleisch","Adrian",""],["Wuttke","Alexander",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 12:58:20 GMT"}],"updateDate":"2024-08-26","timestamp":1723121900000,"abstract":"  All over the world, political parties, politicians, and campaigns explore how\nArtificial Intelligence (AI) can help them win elections. However, the effects\nof these activities are unknown. We propose a framework for assessing AI's\nimpact on elections by considering its application in various campaigning\ntasks. The electoral uses of AI vary widely, carrying different levels of\nconcern and need for regulatory oversight. To account for this diversity, we\ngroup AI-enabled campaigning uses into three categories -- campaign operations,\nvoter outreach, and deception. Using this framework, we provide the first\nsystematic evidence from a preregistered representative survey and two\npreregistered experiments (n=7,635) on how Americans think about AI in\nelections and the effects of specific campaigning choices. We provide three\nsignificant findings. 1) the public distinguishes between different AI uses in\nelections, seeing AI uses predominantly negative but objecting most strongly to\ndeceptive uses; 2) deceptive AI practices can have adverse effects on relevant\nattitudes and strengthen public support for stopping AI development; 3)\nAlthough deceptive electoral uses of AI are intensely disliked, they do not\nresult in substantial favorability penalties for the parties involved. There is\na misalignment of incentives for deceptive practices and their externalities.\nWe cannot count on public opinion to provide strong enough incentives for\nparties to forgo tactical advantages from AI-enabled deception. There is a need\nfor regulatory oversight and systematic outside monitoring of electoral uses of\nAI. Still, regulators should account for the diversity of AI uses and not\ncompletely disincentivize their electoral use.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}