{"id":"2408.12852","title":"Structural Representation Learning and Disentanglement for Evidential\n  Chinese Patent Approval Prediction","authors":"Jinzhi Shan, Qi Zhang, Chongyang Shi, Mengting Gui, Shoujin Wang,\n  Usman Naseem","authorsParsed":[["Shan","Jinzhi",""],["Zhang","Qi",""],["Shi","Chongyang",""],["Gui","Mengting",""],["Wang","Shoujin",""],["Naseem","Usman",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 05:44:16 GMT"}],"updateDate":"2024-08-26","timestamp":1724391856000,"abstract":"  Automatic Chinese patent approval prediction is an emerging and valuable task\nin patent analysis. However, it involves a rigorous and transparent\ndecision-making process that includes patent comparison and examination to\nassess its innovation and correctness. This resultant necessity of decision\nevidentiality, coupled with intricate patent comprehension presents significant\nchallenges and obstacles for the patent analysis community. Consequently, few\nexisting studies are addressing this task. This paper presents the pioneering\neffort on this task using a retrieval-based classification approach. We propose\na novel framework called DiSPat, which focuses on structural representation\nlearning and disentanglement to predict the approval of Chinese patents and\noffer decision-making evidence. DiSPat comprises three main components: base\nreference retrieval to retrieve the Top-k most similar patents as a reference\nbase; structural patent representation to exploit the inherent claim hierarchy\nin patents for learning a structural patent representation; disentangled\nrepresentation learning to learn disentangled patent representations that\nenable the establishment of an evidential decision-making process. To ensure a\nthorough evaluation, we have meticulously constructed three datasets of Chinese\npatents. Extensive experiments on these datasets unequivocally demonstrate our\nDiSPat surpasses state-of-the-art baselines on patent approval prediction,\nwhile also exhibiting enhanced evidentiality.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}