{"id":"2408.10899","title":"All Robots in One: A New Standard and Unified Dataset for Versatile,\n  General-Purpose Embodied Agents","authors":"Zhiqiang Wang, Hao Zheng, Yunshuang Nie, Wenjun Xu, Qingwei Wang, Hua\n  Ye, Zhe Li, Kaidong Zhang, Xuewen Cheng, Wanxi Dong, Chang Cai, Liang Lin,\n  Feng Zheng, Xiaodan Liang","authorsParsed":[["Wang","Zhiqiang",""],["Zheng","Hao",""],["Nie","Yunshuang",""],["Xu","Wenjun",""],["Wang","Qingwei",""],["Ye","Hua",""],["Li","Zhe",""],["Zhang","Kaidong",""],["Cheng","Xuewen",""],["Dong","Wanxi",""],["Cai","Chang",""],["Lin","Liang",""],["Zheng","Feng",""],["Liang","Xiaodan",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 14:40:20 GMT"}],"updateDate":"2024-08-21","timestamp":1724164820000,"abstract":"  Embodied AI is transforming how AI systems interact with the physical world,\nyet existing datasets are inadequate for developing versatile, general-purpose\nagents. These limitations include a lack of standardized formats, insufficient\ndata diversity, and inadequate data volume. To address these issues, we\nintroduce ARIO (All Robots In One), a new data standard that enhances existing\ndatasets by offering a unified data format, comprehensive sensory modalities,\nand a combination of real-world and simulated data. ARIO aims to improve the\ntraining of embodied AI agents, increasing their robustness and adaptability\nacross various tasks and environments. Building upon the proposed new standard,\nwe present a large-scale unified ARIO dataset, comprising approximately 3\nmillion episodes collected from 258 series and 321,064 tasks. The ARIO standard\nand dataset represent a significant step towards bridging the gaps of existing\ndata resources. By providing a cohesive framework for data collection and\nrepresentation, ARIO paves the way for the development of more powerful and\nversatile embodied AI agents, capable of navigating and interacting with the\nphysical world in increasingly complex and diverse ways. The project is\navailable on https://imaei.github.io/project_pages/ario/\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WQ54RJPtrmZJ6WLWH-k43Bnhh3GkC3_0_uZxXjlCx8I","pdfSize":"7789212"}
