{"id":"2408.06215","title":"Gas-phase Fe/O and Fe/N abundances in Star-Forming Regions. Relations\n  between nucleosynthesis, metallicity and dust","authors":"J. E. M\\'endez-Delgado, K. Kreckel, C. Esteban, J. Garc\\'ia-Rojas, L.\n  Carigi, A.A.C. Sander, M. Palla, M. Chru\\'sli\\'nska, I. De Looze, M.\n  Rela\\~no, S.A. van der Giessen, E. Reyes-Rodr\\'iguez and S. F. S\\'anchez","authorsParsed":[["Méndez-Delgado","J. E.",""],["Kreckel","K.",""],["Esteban","C.",""],["García-Rojas","J.",""],["Carigi","L.",""],["Sander","A. A. C.",""],["Palla","M.",""],["Chruślińska","M.",""],["De Looze","I.",""],["Relaño","M.",""],["van der Giessen","S. A.",""],["Reyes-Rodríguez","E.",""],["Sánchez","S. F.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 15:10:59 GMT"}],"updateDate":"2024-08-13","timestamp":1723475459000,"abstract":"  In stars, metallicity is usually traced using Fe, while in nebulae, O serves\nas the preferred proxy. Both elements have different nucleosynthetic origins\nand are not directly comparable. Additionally, in ionized nebulae, Fe is\nheavily depleted onto dust grains. We investigate the distribution of Fe gas\nabundances in a sample of 452 star-forming nebulae with \\feiii~$\\lambda 4658$\ndetections and their relationship with O and N. Additionally, we analyze the\ndepletion of Fe onto dust grains in photoionized environments. We homogeneously\ndetermine the chemical abundances with direct determinations of electron\ntemperature ($T_e$), considering the effect of possible internal variations of\nthis parameter. We adopt a sample of 300 Galactic stars to interpret the\nnebular findings. We find a moderate linear correlation ($r=-0.59$) between\nFe/O and O/H. In turn, we report a stronger correlation ($r=-0.80$) between\nFe/N and N/H. We interpret the tighter correlation as evidence of Fe and N\nbeing produced on similar timescales while Fe-dust depletion scales with the Fe\navailability. The apparently flat distribution between Fe/N and N/H in Milky\nWay stars supports this interpretation. We find that when 12+log(O/H)<7.6, the\nnebulae seem to reach a plateau value around $\\text{log(Fe/O)} \\approx -1.7$.\nIf this trend is confirmed, it would be consistent with a very small amount of\nFe-dust in these systems, similar to what is observed in high-z galaxies\ndiscovered by the James Webb Space Telescope (JWST). We derive a relationship\nthat allows us to approximate the fraction of Fe trapped into dust in ionized\nnebulae. If the O-dust scales in the same way, its possible contribution in low\nmetallicity nebulae would be negligible. After analyzing the Fe/O abundances in\nJ0811+4730 and J1631+4426, we do not see evidence of the presence of very\nmassive stars with $M_\\text{init}>300M_{\\odot}$ in these systems.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}