{"id":"2408.14734","title":"General-Kindred Physics-Informed Neural Network to the Solutions of\n  Singularly Perturbed Differential Equations","authors":"Sen Wang, Peizhi Zhao, Qinglong Ma, Tao Song","authorsParsed":[["Wang","Sen",""],["Zhao","Peizhi",""],["Ma","Qinglong",""],["Song","Tao",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 02:03:22 GMT"}],"updateDate":"2024-08-28","timestamp":1724724202000,"abstract":"  Physics-Informed Neural Networks (PINNs) have become a promising research\ndirection in the field of solving Partial Differential Equations (PDEs).\nDealing with singular perturbation problems continues to be a difficult\nchallenge in the field of PINN. The solution of singular perturbation problems\noften exhibits sharp boundary layers and steep gradients, and traditional PINN\ncannot achieve approximation of boundary layers. In this manuscript, we propose\nthe General-Kindred Physics-Informed Neural Network (GKPINN) for solving\nSingular Perturbation Differential Equations (SPDEs). This approach utilizes\nasymptotic analysis to acquire prior knowledge of the boundary layer from the\nequation and establishes a novel network to assist PINN in approximating the\nboundary layer. It is compared with traditional PINN by solving examples of\none-dimensional, two-dimensional, and time-varying SPDE equations. The research\nfindings underscore the exceptional performance of our novel approach, GKPINN,\nwhich delivers a remarkable enhancement in reducing the $L_2$ error by two to\nfour orders of magnitude compared to the established PINN methodology. This\nsignificant improvement is accompanied by a substantial acceleration in\nconvergence rates, without compromising the high precision that is critical for\nour applications. Furthermore, GKPINN still performs well in extreme cases with\nperturbation parameters of ${1\\times10}^{-38}$, demonstrating its excellent\ngeneralization ability.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Numerical Analysis","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/"}