{"id":"2408.11885","title":"HDN:Hybrid Deep-learning and Non-line-of-sight Reconstruction Framework\n  for Photoacoustic Brain Imaging","authors":"Pengcheng Wan, Fan Zhang, Yuting Shen, Xin Shang, Hulin Zhao, Shuangli\n  Liu, Xiaohua Feng, and Fei Gao","authorsParsed":[["Wan","Pengcheng",""],["Zhang","Fan",""],["Shen","Yuting",""],["Shang","Xin",""],["Zhao","Hulin",""],["Liu","Shuangli",""],["Feng","Xiaohua",""],["Gao","Fei",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 15:06:19 GMT"}],"updateDate":"2024-08-23","timestamp":1724252779000,"abstract":"  Photoacoustic imaging (PAI) combines the high contrast of optical imaging\nwith the deep penetration depth of ultrasonic imaging, showing great potential\nin cerebrovascular disease detection. However, the ultrasonic wave suffers\nstrong attenuation and multi-scattering when it passes through the skull\ntissue, resulting in the distortion of the collected photoacoustic (PA) signal.\nIn this paper, inspired by the principles of deep learning and\nnon-line-of-sight (NLOS) imaging, we propose an image reconstruction framework\nnamed HDN (Hybrid Deep-learning and Non-line-of-sight), which consists of the\nsignal extraction part and difference utilization part. The signal extraction\npart is used to correct the distorted signal and reconstruct an initial image.\nThe difference utilization part is used to make further use of the signal\ndifference between the distorted signal and corrected signal, reconstructing\nthe residual image between the initial image and the target image. The test\nresults on a PA digital brain simulation dataset show that compared with the\ntraditional delay-and-sum (DAS) method and deep-learning-based method, HDN\nachieved superior performance in both signal correction and image\nreconstruction. Specifically for the SSIM index, the HDN reached 0.606 in\nimaging results, compared to 0.154 for the DAS method and 0.307 for the\ndeep-learning-based method.\n","subjects":["Physics/Medical Physics","Electrical Engineering and Systems Science/Image and Video Processing","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}