{"id":"2408.06293","title":"Ultraviolet flux and spectral variability study of blazars observed with\n  UVIT/AstroSat","authors":"M. Reshma, Aditi Agarwal, C.S. Stalin, Prajwel Joseph, Akanksha\n  Dagore, Amit Kumar Mandal, Ashish Devaraj and S. B. Gudennavar","authorsParsed":[["Reshma","M.",""],["Agarwal","Aditi",""],["Stalin","C. S.",""],["Joseph","Prajwel",""],["Dagore","Akanksha",""],["Mandal","Amit Kumar",""],["Devaraj","Ashish",""],["Gudennavar","S. B.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 17:03:02 GMT"}],"updateDate":"2024-08-13","timestamp":1723482182000,"abstract":"  Blazars, the peculiar class of active galactic nuclei (AGN), are known to\nshow flux variations across the accessible electromagnetic spectrum. Though\nthey have been studied extensively for their flux variability characteristics\nacross wavelengths, information on their ultraviolet (UV) flux variations on\ntime scales of hours is very limited. Here, we present the first UV flux\nvariability study on intraday time scales of a sample of 10 blazars comprising\n2 flat spectrum radio quasars (FSRQs) and 8 BL Lacertae objects (BL Lacs).\nThese objects, spanning a redshift (z) range of 0.034 <= z <= 1.003, were\nobserved in the far-UV (FUV: 1300 - 1800 \\text{\\AA}) and near-UV (NUV: 2000 -\n3000 \\text{\\AA}) wavebands using the ultraviolet imaging telescope on board\nAstroSat. UV flux variations on time scales of hours were detected in 9 sources\nout of the observed 10 blazars. The spectral variability analysis showed a\nbluer-when-brighter trend with no difference in the UV spectral variability\nbehavior between the studied sample of FSRQs and BL Lacs. The observed UV flux\nand spectral variability in our sample of both FSRQs and BL Lacs revealed that\nthe observed UV emission in them is dominated by jet synchrotron process.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}