{"id":"2408.11962","title":"Characterizing Online Toxicity During the 2022 Mpox Outbreak: A\n  Computational Analysis of Topical and Network Dynamics","authors":"Lizhou Fan, Lingyao Li, Libby Hemphill","authorsParsed":[["Fan","Lizhou",""],["Li","Lingyao",""],["Hemphill","Libby",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 19:31:01 GMT"},{"version":"v2","created":"Sat, 31 Aug 2024 17:34:43 GMT"}],"updateDate":"2024-09-04","timestamp":1724268661000,"abstract":"  Background: Online toxicity, encompassing behaviors such as harassment,\nbullying, hate speech, and the dissemination of misinformation, has become a\npressing social concern in the digital age. The 2022 Mpox outbreak, initially\ntermed \"Monkeypox\" but subsequently renamed to mitigate associated stigmas and\nsocietal concerns, serves as a poignant backdrop to this issue. Objective: In\nthis research, we undertake a comprehensive analysis of the toxic online\ndiscourse surrounding the 2022 Mpox outbreak. Our objective is to dissect its\norigins, characterize its nature and content, trace its dissemination patterns,\nand assess its broader societal implications, with the goal of providing\ninsights that can inform strategies to mitigate such toxicity in future crises.\nMethods: We collected more than 1.6 million unique tweets and analyzed them\nfrom five dimensions, including context, extent, content, speaker, and intent.\nUtilizing BERT-based topic modeling and social network community clustering, we\ndelineated the toxic dynamics on Twitter. Results: We identified five\nhigh-level topic categories in the toxic online discourse on Twitter, including\ndisease (46.6%), health policy and healthcare (19.3%), homophobia (23.9%),\npolitics (6.0%), and racism (4.1%). Through the toxicity diffusion networks of\nmentions, retweets, and the top users, we found that retweets of toxic content\nwere widespread, while influential users rarely engaged with or countered this\ntoxicity through retweets. Conclusions: By tracking topical dynamics, we can\ntrack the changing popularity of toxic content online, providing a better\nunderstanding of societal challenges. Network dynamics spotlight key social\nmedia influencers and their intents, indicating that addressing these central\nfigures in toxic discourse can enhance crisis communication and inform\npolicy-making.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ukUnhBmhUGXUQMeCaGLcBr4EAg0x7NbsJ7um5tnO4zc","pdfSize":"1739382"}
