{"id":"2408.01136","title":"Fully metallic geodesic lenses as analog electromagnetic models of\n  static and spherically symmetric gravitational fields","authors":"Enderson Falc\\'on-G\\'omez, Vittorio De Falco, Kerlos Atia Abdalmalak,\n  Adri\\'an Amor-Mart\\'in, Valent\\'in De La Rubia, Gabriel Santamar\\'ia-Botello,\n  and Luis Enrique Garc\\'ia Mu\\~noz","authorsParsed":[["Falcón-Gómez","Enderson",""],["De Falco","Vittorio",""],["Abdalmalak","Kerlos Atia",""],["Amor-Martín","Adrián",""],["De La Rubia","Valentín",""],["Santamaría-Botello","Gabriel",""],["Muñoz","Luis Enrique García",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 09:30:07 GMT"}],"updateDate":"2024-08-05","timestamp":1722591007000,"abstract":"  We demonstrate that a fully metallic and air-filled geodesic waveguide can be\nemployed as an analog electromagnetic model of a static and spherically\nsymmetric gravitational field. By following the Plebanski formalism, a\nspace-time metric of the aforementioned type is firstly encoded into the\nelectromagnetic properties of a flat space-time region in the form of an\nisotropic and radially varying refractive index distribution. Then, a\nthree-dimensional, air-filled, and axially symmetric waveguide, composed of two\nequally spaced and curved metallic surfaces, is employed. Its shape is tailored\nsuch that the effective paths, followed by transverse electromagnetic beams of\nmicrowave radiation within this waveguide, result equivalent to null-geodesics\ntaking place in the aforementioned refractive medium. This strategy avoids the\nneed for a refractive medium, although it only allows to reproduce the\nspace-time metric on the invariant plane. Two analog electromagnetic models of\ngravity, using the proposed approach, are designed to reproduce the metric of\nboth a Schwarzschild black hole and a Morris-Thorne wormhole. The results from\nfull-wave simulations demonstrate that a one-dimensional Gaussian beam\nfaithfully follows a path completely equivalent to general relativistic null\ngeodesics with a mean relative error within 4%.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"renom6XVRjlcBMn8ZNetlHb8HaJsxlRIBtc5-IIEjIk","pdfSize":"3819042"}
