{"id":"2408.00243","title":"A Survey on the Applications of Zero-Knowledge Proofs","authors":"Ryan Lavin, Xuekai Liu, Hardhik Mohanty, Logan Norman, Giovanni\n  Zaarour, Bhaskar Krishnamachari","authorsParsed":[["Lavin","Ryan",""],["Liu","Xuekai",""],["Mohanty","Hardhik",""],["Norman","Logan",""],["Zaarour","Giovanni",""],["Krishnamachari","Bhaskar",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 02:47:30 GMT"}],"updateDate":"2024-08-02","timestamp":1722480450000,"abstract":"  Zero-knowledge proofs (ZKPs) represent a revolutionary advance in\ncomputational integrity and privacy technology, enabling the secure and private\nexchange of information without revealing underlying private data. ZKPs have\nunique advantages in terms of universality and minimal security assumptions\nwhen compared to other privacy-sensitive computational methods for distributed\nsystems, such as homomorphic encryption and secure multiparty computation.\nTheir application spans multiple domains, from enhancing privacy in blockchain\nto facilitating confidential verification of computational tasks. This survey\nstarts with a high-level overview of the technical workings of ZKPs with a\nfocus on an increasingly relevant subset of ZKPs called zk-SNARKS. While there\nhave been prior surveys on the algorithmic and theoretical aspects of ZKPs, our\nwork is distinguished by providing a broader view of practical aspects and\ndescribing many recently-developed use cases of ZKPs across various domains.\nThese application domains span blockchain privacy, scaling, storage, and\ninteroperability, as well as non-blockchain applications like voting,\nauthentication, timelocks, and machine learning. Aimed at both practitioners\nand researchers, the survey also covers foundational components and\ninfrastructure such as zero-knowledge virtual machines (zkVM), domain-specific\nlanguages (DSLs), supporting libraries, frameworks, and protocols. We conclude\nwith a discussion on future directions, positioning ZKPs as pivotal in the\nadvancement of cryptographic practices and digital privacy across many\napplications.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Computational Complexity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KDE3r6SJpZevcumvm_-MBjCaHIRW_FUuwBHe3Q3FbBM","pdfSize":"816052","txDigest":"AFEvUwv4wKcX5ddpbiWfR3Yavi135MGEcpQrMrmFo2wF","endEpoch":"1","status":"CERTIFIED"}
