{"id":"2408.02661","title":"Context-aware Mamba-based Reinforcement Learning for social robot\n  navigation","authors":"Syed Muhammad Mustafa, Omema Rizvi, Zain Ahmed Usmani, Abdul Basit\n  Memon","authorsParsed":[["Mustafa","Syed Muhammad",""],["Rizvi","Omema",""],["Usmani","Zain Ahmed",""],["Memon","Abdul Basit",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 17:55:20 GMT"}],"updateDate":"2024-08-06","timestamp":1722880520000,"abstract":"  Social robot navigation (SRN) is a relevant problem that involves navigating\na pedestrian-rich environment in a socially acceptable manner. It is an\nessential part of making social robots effective in pedestrian-rich settings.\nThe use cases of such robots could vary from companion robots to warehouse\nrobots to autonomous wheelchairs. In recent years, deep reinforcement learning\nhas been increasingly used in research on social robot navigation. Our work\nintroduces CAMRL (Context-Aware Mamba-based Reinforcement Learning). Mamba is a\nnew deep learning-based State Space Model (SSM) that has achieved results\ncomparable to transformers in sequencing tasks. CAMRL uses Mamba to determine\nthe robot's next action, which maximizes the value of the next state predicted\nby the neural network, enabling the robot to navigate effectively based on the\nrewards assigned. We evaluate CAMRL alongside existing solutions (CADRL,\nLSTM-RL, SARL) using a rigorous testing dataset which involves a variety of\ndensities and environment behaviors based on ORCA and SFM, thus, demonstrating\nthat CAMRL achieves higher success rates, minimizes collisions, and maintains\nsafer distances from pedestrians. This work introduces a new SRN planner,\nshowcasing the potential for deep-state space models for robot navigation.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"E6A9jCl2dYBTXAW8RhOVoxeyvSyLaIuLPSWmy4rNXNc","pdfSize":"1895723","txDigest":"EExFQKCuv5RTvf1yp2t6hpf6e4R8VkGL6gdW1C4q7jK7","endEpoch":"1","status":"CERTIFIED"}
