{"id":"2408.09631","title":"Penalized Likelihood Approach for the Four-parameter Kappa Distribution","authors":"Nipada Papukdee, Jeong-Soo Park, and Piyapatr Busababodhin","authorsParsed":[["Papukdee","Nipada",""],["Park","Jeong-Soo",""],["Busababodhin","Piyapatr",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 01:28:28 GMT"}],"updateDate":"2024-08-20","timestamp":1724030908000,"abstract":"  The four-parameter kappa distribution (K4D) is a generalized form of some\ncommonly used distributions such as generalized logistic, generalized Pareto,\ngeneralized Gumbel, and generalized extreme value (GEV) distributions. Owing to\nits flexibility, the K4D is widely applied in modeling in several fields such\nas hydrology and climatic change. For the estimation of the four parameters,\nthe maximum likelihood approach and the method of L-moments are usually\nemployed. The L-moment estimator (LME) method works well for some parameter\nspaces, with up to a moderate sample size, but it is sometimes not feasible in\nterms of computing the appropriate estimates. Meanwhile, the maximum likelihood\nestimator (MLE) is optimal for large samples and applicable to a very wide\nrange of situations, including non-stationary data. However, using the MLE of\nK4D with small sample sizes shows substantially poor performance in terms of a\nlarge variance of the estimator. We therefore propose a maximum penalized\nlikelihood estimation (MPLE) of K4D by adjusting the existing penalty functions\nthat restrict the parameter space. Eighteen combinations of penalties for two\nshape parameters are considered and compared. The MPLE retains modeling\nflexibility and large sample optimality while also improving on small sample\nproperties. The properties of the proposed estimator are verified through a\nMonte Carlo simulation, and an application case is demonstrated taking\nThailand's annual maximum temperature data. Based on this study, we suggest\nusing combinations of penalty functions in general.\n","subjects":["Statistics/Methodology","Statistics/Computation"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}