{"id":"2408.02558","title":"Peer-induced Fairness: A Causal Approach for Algorithmic Fairness\n  Auditing","authors":"Shiqi Fang, Zexun Chen, Jake Ansell","authorsParsed":[["Fang","Shiqi",""],["Chen","Zexun",""],["Ansell","Jake",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 15:35:34 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 22:06:57 GMT"},{"version":"v3","created":"Fri, 16 Aug 2024 12:33:59 GMT"},{"version":"v4","created":"Thu, 5 Sep 2024 23:38:21 GMT"}],"updateDate":"2024-09-09","timestamp":1722872134000,"abstract":"  With the European Union's Artificial Intelligence Act taking effect on 1\nAugust 2024, high-risk AI applications must adhere to stringent transparency\nand fairness standards. This paper addresses a crucial question: how can we\nscientifically audit algorithmic fairness? Current methods typically remain at\nthe basic detection stage of auditing, without accounting for more complex\nscenarios. We propose a novel framework, ``peer-induced fairness'', which\ncombines the strengths of counterfactual fairness and peer comparison strategy,\ncreating a reliable and robust tool for auditing algorithmic fairness. Our\nframework is universal, adaptable to various domains, and capable of handling\ndifferent levels of data quality, including skewed distributions. Moreover, it\ncan distinguish whether adverse decisions result from algorithmic\ndiscrimination or inherent limitations of the subjects, thereby enhancing\ntransparency. This framework can serve as both a self-assessment tool for AI\ndevelopers and an external assessment tool for auditors to ensure compliance\nwith the EU AI Act. We demonstrate its utility in small and medium-sized\nenterprises access to finance, uncovering significant unfairness-41.51% of\nmicro-firms face discrimination compared to non-micro firms. These findings\nhighlight the framework's potential for broader applications in ensuring\nequitable AI-driven decision-making.\n","subjects":["Statistics/Applications","Computing Research Repository/Computers and Society","Quantitative Finance/Computational Finance","Quantitative Finance/Statistical Finance","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}