{"id":"2408.11983","title":"Orbital motion of NGC 6166 (3C 338) and its impact on the jet morphology\n  at kiloparsec scales","authors":"A. S. R. Antas, A. Caproni, R. E. G. Machado, T. F. Lagan\\'a and G. S.\n  Souza","authorsParsed":[["Antas","A. S. R.",""],["Caproni","A.",""],["Machado","R. E. G.",""],["Laganá","T. F.",""],["Souza","G. S.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 20:33:13 GMT"}],"updateDate":"2024-08-23","timestamp":1724272393000,"abstract":"  In the central region of the galaxy cluster Abell 2199 (A2199) resides the cD\ngalaxy NGC 6166, which spatially coincides with the 3C 338 radio source. Lobes,\njets, and a more detached southern structure (similar to a jet labelled as\nridge) are seen at kiloparsec-scale images of 3C 338. This unusual radio\nmorphology has led to the proposition of different hypotheses about its\nphysical origin in the literature. In this work, we study the feasibility of a\ndynamical scenario where NGC 6166 moves around the X-ray inferred centre of\nA2199 from the point of view of three-dimensional hydrodynamic simulations. The\nphysical characteristics of the intra-cluster medium in which the jet\npropagates are constrained to those derived from X-ray observations in the\nvicinity of NGC 6166. Possible orbits for the jet inlet region are derived from\nthe estimated radial velocity of NGC 6166, while the jet parameters are\nconstrained by parsec-scale interferometric radio observations and the\nestimated jet power of 3C 338 obtained from radio and X-ray data. Our results\nshow that the hypothesis of NGC 6166 has been moving around the centre of A2199\nduring the last tens of million of years is compatible with the general radio\nmorphology of 3C 338. Furthermore, the proposed dynamic scenario for the motion\nof NGC 6166 may be linked to gravitational perturbations induced by the passage\nof a sub-cluster of galaxies hundreds of millions of years ago.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QmohVygJKR4OfTLNSu7bum03eoZwF8uZI-1bhi6WFUM","pdfSize":"8465526"}
