{"id":"2408.02779","title":"A Generalized Dispersion Equation Combining Coupled Modes, Parity-Time\n  Symmetry, and Leaky Waves Describing Non-Decaying Leaky Surface Waves","authors":"Afshin Abbaszadeh and Jordan Budhu","authorsParsed":[["Abbaszadeh","Afshin",""],["Budhu","Jordan",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 18:57:21 GMT"}],"updateDate":"2024-08-07","timestamp":1722884241000,"abstract":"  A generalized dispersion equation is derived featuring coupled mode theory,\nparity-time symmetry, and leaky wave antennas of arbitrary periodic modulation.\nIt can be specialized to each of these cases individually or can describe a\nstructure containing all three electromagnetic phenomena simultaneously in a\nsingle antenna. This very general dispersion equation is derived using both\nmode matching and the transverse resonance method, the latter lacking the\nability to provide the field descriptions and wave impedances at the cost of\ncomputational simplicity. Using the dispersion equation, a sinusoidally\nmodulated reactive sheet (SMRS) supported by an active impedance sheet backed\ndielectric spacer is designed. The active impedance sheet is designed to\ncompensate the SMRS radiative leakage loss when coupled in close proximity. Due\nto the coupling, each spatial harmonic generated by the SMRS modulation is\ncharacterized by a purely real propagation constant and hence leaky wave\nradiation is generated from surface waves which do not decay. Due to the\nnon-decaying nature of the surface waves, an input to output surface wave\nport-to-port |S21| would be unity despite an open far field channel being\ngenerated. The non-decaying leaky surface wave antenna is compared to the\ntraditional PEC backed SMRS. The non-decaying leaky surface waves give rise to\nperfect aperture efficiency and the associated radiation pattern making it far\nsuperior to the traditional PEC backed SMRS case. Full-wave simulations\ncorroborate the results. These types of antennas can make sensors probed from\nthe far field where changes in S21 amplitude directly correlate to local\nchanges in the waveguiding environment.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ElCtOicZnKUBc_5lC8VLnSafVRLJjIKt6dCb1dkJBMA","pdfSize":"1770152"}
