{"id":"2408.05799","title":"Boosting the quality factor of Tamm structures to millions by quantum\n  inspired classical annealer with factorization machine","authors":"Jiang Guo, Koki Kitai, Hideyuki Jippo, and Junichiro Shiomi","authorsParsed":[["Guo","Jiang",""],["Kitai","Koki",""],["Jippo","Hideyuki",""],["Shiomi","Junichiro",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 15:20:41 GMT"}],"updateDate":"2024-08-13","timestamp":1723389641000,"abstract":"  The Tamm structures show high quality (Q) factor property with simple\nphotonic Bragg reflectors composed of alternative high/low refractive index\nlayers and metal reflectors. However, the Q-factor of Tamm structures is\ninherently limited by the periodic constraints and fixed thicknesses of the\nBragg reflector pairs. Removing periodic constraints and adopting aperiodic\ndesigns can lead to significantly higher Q-factors. Nevertheless, to fully\nexploit the potential of Tamm structures, it is essential to thoroughly explore\nthe extensive search space introduced by these aperiodic designs. Herein, we\nintroduce a novel approach that utilizes the quantum-inspired classical\nannealer combined with a factorization machine to facilitate the design of\nphotonic Bragg reflectors with the aim of achieving ultrahigh Q-factor\nproperties. Our investigation begins by establishing the effectiveness of\nglobal optimization in a 15-bit problem setting, showcasing a remarkable\nefficiency improvement of nearly one order of magnitude compared to random\nsearch strategies. Subsequently, we expand our analysis to a 20-bit problem,\ndemonstrating comparable efficiency to state-of-the-art Bayesian optimization\nmethods. Moreover, the proposed method proves its capability in handling\nextremely large search spaces, exemplified by a 40-bit problem, where we\nsuccessfully uncover a Tamm structure design exhibiting an extraordinary\nultrahigh Q-factor surpassing millions. The designed aperiodic Tamm structure\nexhibits exceptional high localization and enhancement of electric field, and\nthe power loss is concentrated in the low loss dielectric layer. Hence, the\ndecay rate of power dissipation significantly decreases and light-matter\ninteraction time increases, resulting in ultrahigh Q-factor.\n","subjects":["Condensed Matter/Materials Science","Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ISLH-_fNFAlY9xM4n1ZJj61j2WynDTep2axRCPF7JyE","pdfSize":"1161428"}
