{"id":"2408.17345","title":"Dimensional confinement and superdiffusive rotational motion of uniaxial\n  colloids in the presence of cylindrical obstacles","authors":"Vikki Anand Varma and Sujin B Babu","authorsParsed":[["Varma","Vikki Anand",""],["Babu","Sujin B",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 15:17:29 GMT"}],"updateDate":"2024-09-02","timestamp":1725031049000,"abstract":"  In biological system like cell the macromolecules which are anisotropic\nparticles diffuse in a crowded medium. In the present work we have studied the\ndiffusion of spheroidal particles diffusing between cylindrical obstacles by\nvarying the density of the obstacles as well as the spheroidal particles.\nAnalytical calculation of the free energy showed that the orientational vector\nof a single oblate particle will be aligned perpendicular and a prolate\nparticle will be aligned parallel to the symmetry axis of the cylindrical\nobstacles in equilibrium. The nematic transition of the system with and without\nobstacle remained the same, but in the case of obstacles the nematic vector of\nthe spheroid system always remained parallel to the cylindrical axis. The\ncomponent of the translational diffusion coefficient of the spheroidal particle\nperpendicular to the axis of the cylinder is calculated for isotropic system\nwhich agrees with analytical calculation. When the cylinders overlap such that\nthe spheroidal particles can only diffuse along the direction parallel to the\naxis of the cylinder we could observe dimensional confinement. This was\nobserved by the discontinuous fall of the diffusion coefficient, when plotted\nagainst the chemical potential both for single particle as well as for finite\nvolume fraction. The rotational diffusion coefficient quickly reached the bulk\nvalue as the distance between the obstacle increased in the isotropic phase. In\nthe nematic phase the rotational motion of the spheroid should be arrested. We\nobserved that even though the entire system remained in the nematic phase the\noblate particle close to the cylinder underwent flipping motion. The\nconsequence is that when the rotational mean squared displacement was\ncalculated it showed a super-diffusive behavior even though the orientational\nself correlation function never relaxed to zero.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}