{"id":"2408.12691","title":"Quantization-free Lossy Image Compression Using Integer Matrix\n  Factorization","authors":"Pooya Ashtari, Pourya Behmandpoor, Fateme Nateghi Haredasht, Jonathan\n  H. Chen, Panagiotis Patrinos and Sabine Van Huffel","authorsParsed":[["Ashtari","Pooya",""],["Behmandpoor","Pourya",""],["Haredasht","Fateme Nateghi",""],["Chen","Jonathan H.",""],["Patrinos","Panagiotis",""],["Van Huffel","Sabine",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 19:08:08 GMT"}],"updateDate":"2024-08-26","timestamp":1724353688000,"abstract":"  Lossy image compression is essential for efficient transmission and storage.\nTraditional compression methods mainly rely on discrete cosine transform (DCT)\nor singular value decomposition (SVD), both of which represent image data in\ncontinuous domains and therefore necessitate carefully designed quantizers.\nNotably, SVD-based methods are more sensitive to quantization errors than\nDCT-based methods like JPEG. To address this issue, we introduce a variant of\ninteger matrix factorization (IMF) to develop a novel quantization-free lossy\nimage compression method. IMF provides a low-rank representation of the image\ndata as a product of two smaller factor matrices with bounded integer elements,\nthereby eliminating the need for quantization. We propose an efficient,\nprovably convergent iterative algorithm for IMF using a block coordinate\ndescent (BCD) scheme, with subproblems having closed-form solutions. Our\nexperiments on the Kodak and CLIC 2024 datasets demonstrate that our IMF\ncompression method consistently outperforms JPEG at low bit rates below 0.25\nbits per pixel (bpp) and remains comparable at higher bit rates. We also\nassessed our method's capability to preserve visual semantics by evaluating an\nImageNet pre-trained classifier on compressed images. Remarkably, our method\nimproved top-1 accuracy by over 5 percentage points compared to JPEG at bit\nrates under 0.25 bpp. The project is available at\nhttps://github.com/pashtari/lrf .\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}