{"id":"2408.11411","title":"SelfDRSC++: Self-Supervised Learning for Dual Reversed Rolling Shutter\n  Correction","authors":"Wei Shang, Dongwei Ren, Wanying Zhang, Qilong Wang, Pengfei Zhu, and\n  Wangmeng Zuo","authorsParsed":[["Shang","Wei",""],["Ren","Dongwei",""],["Zhang","Wanying",""],["Wang","Qilong",""],["Zhu","Pengfei",""],["Zuo","Wangmeng",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 08:17:22 GMT"}],"updateDate":"2024-08-22","timestamp":1724228242000,"abstract":"  Modern consumer cameras commonly employ the rolling shutter (RS) imaging\nmechanism, via which images are captured by scanning scenes row-by-row,\nresulting in RS distortion for dynamic scenes. To correct RS distortion,\nexisting methods adopt a fully supervised learning manner that requires high\nframerate global shutter (GS) images as ground-truth for supervision. In this\npaper, we propose an enhanced Self-supervised learning framework for Dual\nreversed RS distortion Correction (SelfDRSC++). Firstly, we introduce a\nlightweight DRSC network that incorporates a bidirectional correlation matching\nblock to refine the joint optimization of optical flows and corrected RS\nfeatures, thereby improving correction performance while reducing network\nparameters. Subsequently, to effectively train the DRSC network, we propose a\nself-supervised learning strategy that ensures cycle consistency between input\nand reconstructed dual reversed RS images. The RS reconstruction in SelfDRSC++\ncan be interestingly formulated as a specialized instance of video frame\ninterpolation, where each row in reconstructed RS images is interpolated from\npredicted GS images by utilizing RS distortion time maps. By achieving superior\nperformance while simplifying the training process, SelfDRSC++ enables feasible\none-stage self-supervised training. Additionally, besides start and end RS\nscanning time, SelfDRSC++ allows supervision of GS images at arbitrary\nintermediate scanning times, thus enabling the learned DRSC network to generate\nhigh framerate GS videos. The code and trained models are available at\n\\url{https://github.com/shangwei5/SelfDRSC_plusplus}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}