{"id":"2408.04819","title":"Interventional Causal Structure Discovery over Graphical Models with\n  Convergence and Optimality Guarantees","authors":"Qiu Chengbo, Yang Kai","authorsParsed":[["Chengbo","Qiu",""],["Kai","Yang",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 02:22:50 GMT"}],"updateDate":"2024-08-12","timestamp":1723170170000,"abstract":"  Learning causal structure from sampled data is a fundamental problem with\napplications in various fields, including healthcare, machine learning and\nartificial intelligence. Traditional methods predominantly rely on\nobservational data, but there exist limits regarding the identifiability of\ncausal structures with only observational data. Interventional data, on the\nother hand, helps establish a cause-and-effect relationship by breaking the\ninfluence of confounding variables. It remains to date under-explored to\ndevelop a mathematical framework that seamlessly integrates both observational\nand interventional data in causal structure learning. Furthermore, existing\nstudies often focus on centralized approaches, necessitating the transfer of\nentire datasets to a single server, which lead to considerable communication\noverhead and heightened risks to privacy. To tackle these challenges, we\ndevelop a bilevel polynomial optimization (Bloom) framework. Bloom not only\nprovides a powerful mathematical modeling framework, underpinned by theoretical\nsupport, for causal structure discovery from both interventional and\nobservational data, but also aspires to an efficient causal discovery algorithm\nwith convergence and optimality guarantees. We further extend Bloom to a\ndistributed setting to reduce the communication overhead and mitigate data\nprivacy risks. It is seen through experiments on both synthetic and real-world\ndatasets that Bloom markedly surpasses other leading learning algorithms.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}