{"id":"2408.12851","title":"Neural network assisted electrostatic global gyrokinetic toroidal code\n  using cylindrical coordinates","authors":"Jaya Kumar Alageshan, Joydeep Das, Tajinder Singh, Sarveshwar Sharma,\n  Animesh Kuley","authorsParsed":[["Alageshan","Jaya Kumar",""],["Das","Joydeep",""],["Singh","Tajinder",""],["Sharma","Sarveshwar",""],["Kuley","Animesh",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 05:44:03 GMT"}],"updateDate":"2024-08-26","timestamp":1724391843000,"abstract":"  Gyrokinetic simulation codes are used to understand the microturbulence in\nthe linear and nonlinear regimes of the tokamak and stellarator core. The codes\nthat use flux coordinates to reduce computational complexities introduced by\nthe anisotropy due to the presence of confinement magnetic fields encounter a\nmathematical singularity of the metric on the magnetic separatrix surface. To\novercome this constraint, we develop a neural network-assisted Global\nGyrokinetic Code using Cylindrical Coordinates (G2C3) to study the\nelectrostatic microturbulence in realistic tokamak geometries. In particular,\nG2C3 uses a cylindrical coordinate system for particle dynamics, which allows\nparticle motion in arbitrarily shaped flux surfaces, including the magnetic\nseparatrix of the tokamak. We use an efficient particle locating hybrid scheme,\nwhich uses a neural network and iterative local search algorithm, for the\ncharge deposition and field interpolation. G2C3 uses the field lines estimated\nby numerical integration to train the neural network in universal function\napproximator mode to speed up the subroutines related to gathering and\nscattering operations of gyrokinetic simulation. Finally, as verification of\nthe capability of the new code, we present results from self-consistent\nsimulations of linear ion temperature gradient modes in the core region of the\nDIII-D tokamak.\n","subjects":["Physics/Plasma Physics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1RU7QtdUe9sz9MY63S2i99UGQT5zwc6HglrUvwU0yEU","pdfSize":"10572802"}
