{"id":"2408.11990","title":"Time Series Foundation Models and Deep Learning Architectures for\n  Earthquake Temporal and Spatial Nowcasting","authors":"Alireza Jafari, Geoffrey Fox, John B. Rundle, Andrea Donnellan, Lisa\n  Grant Ludwig","authorsParsed":[["Jafari","Alireza",""],["Fox","Geoffrey",""],["Rundle","John B.",""],["Donnellan","Andrea",""],["Ludwig","Lisa Grant",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 20:57:03 GMT"}],"updateDate":"2024-08-23","timestamp":1724273823000,"abstract":"  Advancing the capabilities of earthquake nowcasting, the real-time\nforecasting of seismic activities remains a crucial and enduring objective\naimed at reducing casualties. This multifaceted challenge has recently gained\nattention within the deep learning domain, facilitated by the availability of\nextensive, long-term earthquake datasets. Despite significant advancements,\nexisting literature on earthquake nowcasting lacks comprehensive evaluations of\npre-trained foundation models and modern deep learning architectures. These\narchitectures, such as transformers or graph neural networks, uniquely focus on\ndifferent aspects of data, including spatial relationships, temporal patterns,\nand multi-scale dependencies. This paper addresses the mentioned gap by\nanalyzing different architectures and introducing two innovation approaches\ncalled MultiFoundationQuake and GNNCoder. We formulate earthquake nowcasting as\na time series forecasting problem for the next 14 days within 0.1-degree\nspatial bins in Southern California, spanning from 1986 to 2024. Earthquake\ntime series is forecasted as a function of logarithm energy released by quakes.\nOur comprehensive evaluation employs several key performance metrics, notably\nNash-Sutcliffe Efficiency and Mean Squared Error, over time in each spatial\nregion. The results demonstrate that our introduced models outperform other\ncustom architectures by effectively capturing temporal-spatial relationships\ninherent in seismic data. The performance of existing foundation models varies\nsignificantly based on the pre-training datasets, emphasizing the need for\ncareful dataset selection. However, we introduce a new general approach termed\nMultiFoundationPattern that combines a bespoke pattern with foundation model\nresults handled as auxiliary streams. In the earthquake case, the resultant\nMultiFoundationQuake model achieves the best overall performance.\n","subjects":["Computing Research Repository/Machine Learning","Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}