{"id":"2408.10375","title":"Dipole representation of composite fermions in graphene's quantum Hall\n  systems","authors":"Sonja Predin","authorsParsed":[["Predin","Sonja",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 19:42:24 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 13:09:26 GMT"}],"updateDate":"2024-08-23","timestamp":1724096544000,"abstract":"  The even denominator fractional quantum Hall effect has been experimentally\nobserved in the fourth Landau level ($n = 3$). This paper is motivated by\nrecent studies regarding the possibility of pairing and the nature of the\nground state in this system. By extending the dipole representation of\ncomposite fermions, we adapt this framework to the context of graphene's\nquantum Hall systems, with a focus on half-filled Landau levels. We derive an\neffective Hamiltonian that incorporates the key symmetry of half-filled Landau\nlevels, particularly particle-hole symmetry. At the Fermi level, the energetic\ninstability of the dipole state is influenced by the interplay between topology\nand symmetry, driving the system towards a critical state. We explore the\npossibility that this critical state stabilizes into one of the paired states\nwith well-defined pairing solutions. However, our results demonstrate that the\nregularized state which satisfies boost invariance at Fermi level and lacks\nwell-defined pairing instabilities emerges as energetically more favorable.\nTherefore, we find no well-defined pairing instabilities of composite fermions\nin the dipole representation in the half-filled fourth Landau level ($ n = 3 $)\nof electrons in graphene. Although the theory of composite fermions has its\nlimitations, further research is required to investigate other possible\nconfigurations. We discuss the consistency of our results with experimental and\nnumerical studies, and their relevance for future research efforts.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/"}