{"id":"2408.08077","title":"Magnetostructural Coupling at the N\\'eel point in YNiO3 Single Crystals","authors":"Dariusz J. Gawryluk, Y. Maximilian Klein, Rebecca Scatena, Tian Shang,\n  Romain Sibille, Denis Sheptyakov, Nicola Casati, Anthony Linden, Dmitry\n  Chernyshov, Miros{\\l}aw Koz{\\l}owski, Piotr D{\\l}u\\.zewski, Marta D. Rossell,\n  Piero Macchi, Marisa Medarde","authorsParsed":[["Gawryluk","Dariusz J.",""],["Klein","Y. Maximilian",""],["Scatena","Rebecca",""],["Shang","Tian",""],["Sibille","Romain",""],["Sheptyakov","Denis",""],["Casati","Nicola",""],["Linden","Anthony",""],["Chernyshov","Dmitry",""],["Kozłowski","Mirosław",""],["Dłużewski","Piotr",""],["Rossell","Marta D.",""],["Macchi","Piero",""],["Medarde","Marisa",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 11:04:00 GMT"}],"updateDate":"2024-08-16","timestamp":1723719840000,"abstract":"  The recent discovery of superconductivity in infinite layer thin films and\nbulk Ruddlesden-Popper nickelates has stimulated the investigation of other\npredicted properties of these materials. Among them, the existence of\nmagnetism-driven ferroelectricity in the parent compounds RNiO3 (R = 4f\nlanthanide and Y) at the onset of the N\\'eel order, TN, has remained\nparticularly elusive. Using diffraction techniques, we reveal here the\nexistence of magnetostriction at TN in bulk YNiO3 single crystals.\nInterestingly, the associated lattice anomalies are much more pronounced along\nthe b crystal axis, which coincides with the electric polarization direction\nexpected from symmetry arguments. This axis undergoes an abrupt contraction\nbelow TN that reaches deltab/b ~ - 0.01 %, a value comparable to those found in\nsome magnetoresistive manganites and much larger than those reported for\nmagnetism-driven multiferroics. This observation suggests a strong spin-lattice\ncoupling in these materials, consistent with theoretical predictions. Using the\nsymmetry-adapted distortion mode formalism we identify the main ionic\ndisplacements contributing to the lattice anomalies and discuss the most likely\npolar displacements below TN. Furthermore, our data support symmetric\nsuperexchange as the most likely mechanism responsible for the magnetoelastic\ncoupling. These results, that may be common to the full RNiO3 family, provide\nnew experimental evidence supporting the predicted existence of\nmagnetism-driven ferroelectricity in RNiO3 perovskites\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"eM5ssVT-1A1Rs5MYS-BJRt5Qoqdc3LSt8MKjqAGwddE","pdfSize":"2604111"}
