{"id":"2408.05725","title":"Various Features of the X-class White-light Flares in Super Active\n  Region NOAA 13664","authors":"Ying Li, Xiaofeng Liu, Zhichen Jing, Wei Chen, Qiao Li, Yang Su,\n  De-Chao Song, M. D. Ding, Li Feng, Hui Li, and Weiqun Gan","authorsParsed":[["Li","Ying",""],["Liu","Xiaofeng",""],["Jing","Zhichen",""],["Chen","Wei",""],["Li","Qiao",""],["Su","Yang",""],["Song","De-Chao",""],["Ding","M. D.",""],["Feng","Li",""],["Li","Hui",""],["Gan","Weiqun",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 08:33:18 GMT"}],"updateDate":"2024-08-13","timestamp":1723365198000,"abstract":"  Super active region NOAA 13664 produced 12 X-class flares (including the\nlargest one, an occulted X8.7 flare, in solar cycle 25 so far) during 2024 May\n8-15 and 11 of them are identified as white-light flares. Here we present\nvarious features of these X-class white-light flares observed by the\nWhite-light Solar Telescope (WST) on board the Advanced Space-based Solar\nObservatory and the Helioseismic and Magnetic Imager (HMI) on board the Solar\nDynamics Observatory. It is found that both the white-light emissions at WST\n3600 {\\AA} (Balmer continuum) and HMI 6173 {\\AA} (Paschen continuum) show up in\ndifferent regions of the sunspot group in these flares, including outside the\nsunspots and within the penumbra and umbra of the sunspots. They exhibit a\npoint-, ribbon-, loop-, or ejecta-like shape, which can come from flare ribbons\n(or footpoints), flare loops, and plasma ejecta depending on the perspective\nview. The white-light duration and relative enhancement are measured and both\nparameters for 3600 {\\AA} emission have greater values than those for 6173\n{\\AA} emission. It is also found that these white-light emissions are cospatial\nwell with the hard X-ray (HXR) sources in the on-disk flares but have some\noffsets with the HXR emissions in the off-limb flares. In addition, it is\ninteresting that the 3600 and 6173 {\\AA} emissions show different correlations\nwith the peak HXR fluxes, with the former one more sensitive to the HXR\nemission. All these greatly help us understand the white-light flares of a\nlarge magnitude from a super active region on the Sun and also provide\nimportant insights into superflares on Sun-like stars.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}