{"id":"2408.00463","title":"Initial Insights on MLOps: Perception and Adoption by Practitioners","authors":"Sergio Moreschi and David H\\\"astbacka and Andrea Janes and Valentina\n  Lenarduzzi and Davide Taibi","authorsParsed":[["Moreschi","Sergio",""],["Hästbacka","David",""],["Janes","Andrea",""],["Lenarduzzi","Valentina",""],["Taibi","Davide",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 11:08:29 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 07:57:06 GMT"}],"updateDate":"2024-08-05","timestamp":1722510509000,"abstract":"  The accelerated adoption of AI-based software demands precise development\nguidelines to guarantee reliability, scalability, and ethical compliance. MLOps\n(Machine Learning and Operations) guidelines have emerged as the principal\nreference in this field, paving the way for the development of high-level\nautomated tools and applications. Despite the introduction of MLOps guidelines,\nthere is still a degree of skepticism surrounding their implementation, with a\ngradual adoption rate across many companies. In certain instances, a lack of\nawareness about MLOps has resulted in organizations adopting similar approaches\nunintentionally, frequently without a comprehensive understanding of the\nassociated best practices and principles. The objective of this study is to\ngain insight into the actual adoption of MLOps (or comparable) guidelines in\ndifferent business contexts. To this end, we surveyed practitioners\nrepresenting a range of business environments to understand how MLOps is\nadopted and perceived in their companies. The results of this survey also shed\nlight on other pertinent aspects related to the advantages and challenges of\nthese guidelines, the learning curve associated with them, and the future\ntrends that can be derived from this information. This study aims to provide\ndeeper insight into MLOps and its impact on the next phase of innovation in\nmachine learning. By doing so, we aim to lay the foundation for more efficient,\nreliable, and creative AI applications in the future.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AzS8FU8SvyoEYDOzAvFbN-pH1HMqL2i8vgZB3jnr4Y0","pdfSize":"214838","txDigest":"738mWZvmukaHqzAJeb6DW5bE26Xaz4zePhNgwWC6VRLG","endEpoch":"1","status":"CERTIFIED"}
