{"id":"2408.12860","title":"Active STAR-RIS Empowered Edge System for Enhanced Energy Efficiency and\n  Task Management","authors":"Pyae Sone Aung, Kitae Kim, Yan Kyaw Tun, Zhu Han and Choong Seon Hong","authorsParsed":[["Aung","Pyae Sone",""],["Kim","Kitae",""],["Tun","Yan Kyaw",""],["Han","Zhu",""],["Hong","Choong Seon",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 06:08:47 GMT"}],"updateDate":"2024-08-26","timestamp":1724393327000,"abstract":"  The proliferation of data-intensive and low-latency applications has driven\nthe development of multi-access edge computing (MEC) as a viable solution to\nmeet the increasing demands for high-performance computing and storage\ncapabilities at the network edge. Despite the benefits of MEC, challenges such\nas obstructions cause non-line-of-sight (NLoS) communication to persist.\nReconfigurable intelligent surfaces (RISs) and the more advanced simultaneously\ntransmitting and reflecting (STAR)-RISs have emerged to address these\nchallenges; however, practical limitations and multiplicative fading effects\nhinder their efficacy. We propose an active STAR-RIS-assisted MEC system to\novercome these obstacles, leveraging the advantages of active STAR-RIS. The\nmain contributions consist of formulating an optimization problem to minimize\nenergy consumption with task queue stability by jointly optimizing the partial\ntask offloading, amplitude, phase shift coefficients, amplification\ncoefficients, transmit power of the base station (BS), and admitted tasks.\nFurthermore, we decompose the non-convex problem into manageable sub-problems,\nemploying sequential fractional programming for transmit power control, convex\noptimization technique for task offloading, and Lyapunov optimization with\ndouble deep Q-network (DDQN) for joint amplitude, phase shift, amplification,\nand task admission. Extensive performance evaluations demonstrate the\nsuperiority of the proposed system over benchmark schemes, highlighting its\npotential for enhancing MEC system performance. Numerical results indicate that\nour proposed system outperforms the conventional STAR-RIS-assisted by 18.64\\%\nand the conventional RIS-assisted system by 30.43\\%, respectively.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}