{"id":"2408.00159","title":"Dust-Gas Coupling in Turbulence- and MHD Wind-Driven Protoplanetary\n  Disks: Implications for Rocky Planet Formation","authors":"Teng Ee Yap, Konstantin Batygin","authorsParsed":[["Yap","Teng Ee",""],["Batygin","Konstantin",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 20:55:32 GMT"}],"updateDate":"2024-08-02","timestamp":1722459332000,"abstract":"  The degree of coupling between dust particles and their surrounding gas in\nprotoplanetary disks is quantified by the dimensionless Stokes number. The\nStokes number (St) governs particle size and spatial distributions, in turn\nestablishing the dominant mode of planetary accretion in different disk\nregions. In this paper, we model the characteristic St of particles across time\nin disks evolving under both turbulent viscosity and magnetohydrodynamic (MHD)\ndisk winds. In both turbulence- and wind-dominated disks, we find that\ncollisional fragmentation is the limiting mechanism of particle growth, and the\nwater-ice sublimation line constitutes a critical transition point between dust\nsettling, drift, and size regimes.\n  The St dichotomy across the ice-line translates to distinct planet formation\npathways between the inner and outer disk. While pebble accretion proceeds\nslowly for rocky embryos within the ice-line (across most of parameter space),\nit does so rapidly for volatile-rich embryos beyond it, allowing for the growth\nof giant planet cores before disk dissipation. Through simulations of rocky\nplanet growth, we evaluate the competition between pebble accretion and\nclassical pairwise collisions between planetesimals. We conclude that the\ndominance of pebble accretion can only be realized in disks that are driven by\nMHD winds, slow-evolving, and devoid of pressure maxima that may concentrate\nsolids and give rise of planetesimal rings. Such disks are extremely quiescent,\nwith Shakura-Sunyaev turbulence parameters $\\alpha_{\\nu} \\sim 10^{-4}$. We\nconclude that for most of parameter space corresponding to values of\n$\\alpha_{\\nu}$ reflected in observations of protoplanetary disks ($\\gtrsim\n10^{-4}$), pairwise collisions constitute the dominant pathway of rocky planet\naccretion. Our results are discussed in the context of super-Earth origins and\nEarth's accretion history.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wrfqthSoDxvtnFGwQPCwGLR-wgUXSfcRUKes11g9NHI","pdfSize":"12698193","txDigest":"ADmVRexzndaEk9xvxKiSNnysmADF78qvtdEBtBJD3VNr","endEpoch":"1","status":"CERTIFIED"}
