{"id":"2408.12053","title":"Non-local, diamagnetic electromagnetic effects in long MITLs","authors":"E. G. Evstatiev and M. H. Hess and N. D. Hamlin","authorsParsed":[["Evstatiev","E. G.",""],["Hess","M. H.",""],["Hamlin","N. D.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 00:38:07 GMT"}],"updateDate":"2024-08-23","timestamp":1724287087000,"abstract":"  We identify the physics responsible for the critical reduction of current\nlosses in magnetically insulated transmission lines (MITLs) before magnetic\n(self-) insulation has been established. Focusing on time-dependent physics, a\ndrive current with a prototypical sine squared temporal profile introduces\nsufficiently strong time dependence that steady state results alone become\ninsufficient for the complete understanding of current losses. We find that the\neffects of time dependence are most pronounced in long MITLs, i.e., MITLs in\nwhich an electromagnetic wave traverses its length in time comparable to the\ncurrent pulse length. The time-dependent physics can be described as non-local,\ndiamagnetic electromagnetic response of space charge limited currents. As the\nlength of the MITL is reduced (in the above sense), current losses converge to\nthose based on the well known Child-Langmuir law in static external fields. We\npresent a simple one-dimensional (1D) model that encapsulates the essence of\nthis physics. We find excellent agreement with 2D particle-in-cell (PIC)\nsimulations for two MITL geometries, Cartesian parallel plate and azimuthally\nsymmetric straight coaxial. Based on the 1D model, we explore various scaling\ndependencies of current losses with relevant parameters, e.g., peak current,\npeak pulse time, geometrical dimensions, etc. We also propose an improved\nphysics model of magnetic insulation, which could help improve predictions of\ncurrent losses by common circuit element codes, such as BERTHA. Lastly, we\ndescribe how to calculate temperature rise due to electron impact, as a\ndiagnostic within the 1D model.\n  Keywords: magnetically insulated transmission line; MITL; parallel plate;\ncoaxial; magnetic insulation; non-local; diamagnetic; particle-in-cell; PIC;\nkinetic; space charge limited; SCL; electron emission; BERTHA; circuit element\nmodel; Z machine.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}