{"id":"2408.08172","title":"Towards flexible perception with visual memory","authors":"Robert Geirhos, Priyank Jaini, Austin Stone, Sourabh Medapati, Xi Yi,\n  George Toderici, Abhijit Ogale, Jonathon Shlens","authorsParsed":[["Geirhos","Robert",""],["Jaini","Priyank",""],["Stone","Austin",""],["Medapati","Sourabh",""],["Yi","Xi",""],["Toderici","George",""],["Ogale","Abhijit",""],["Shlens","Jonathon",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 14:19:13 GMT"},{"version":"v2","created":"Tue, 17 Sep 2024 13:35:04 GMT"}],"updateDate":"2024-09-18","timestamp":1723731553000,"abstract":"  Training a neural network is a monolithic endeavor, akin to carving knowledge\ninto stone: once the process is completed, editing the knowledge in a network\nis nearly impossible, since all information is distributed across the network's\nweights. We here explore a simple, compelling alternative by marrying the\nrepresentational power of deep neural networks with the flexibility of a\ndatabase. Decomposing the task of image classification into image similarity\n(from a pre-trained embedding) and search (via fast nearest neighbor retrieval\nfrom a knowledge database), we build a simple and flexible visual memory that\nhas the following key capabilities: (1.) The ability to flexibly add data\nacross scales: from individual samples all the way to entire classes and\nbillion-scale data; (2.) The ability to remove data through unlearning and\nmemory pruning; (3.) An interpretable decision-mechanism on which we can\nintervene to control its behavior. Taken together, these capabilities\ncomprehensively demonstrate the benefits of an explicit visual memory. We hope\nthat it might contribute to a conversation on how knowledge should be\nrepresented in deep vision models -- beyond carving it in \"stone\" weights.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}