{"id":"2408.01745","title":"Indexing and Visualization of Climate Change Narratives Using BERT and\n  Causal Extraction","authors":"Hiroki Sakaji, Noriyasu Kaneda","authorsParsed":[["Sakaji","Hiroki",""],["Kaneda","Noriyasu",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 11:05:41 GMT"}],"updateDate":"2024-08-06","timestamp":1722683141000,"abstract":"  In this study, we propose a methodology to extract, index, and visualize\n``climate change narratives'' (stories about the connection between causal and\nconsequential events related to climate change). We use two natural language\nprocessing methods, BERT (Bidirectional Encoder Representations from\nTransformers) and causal extraction, to textually analyze newspaper articles on\nclimate change to extract ``climate change narratives.'' The novelty of the\nmethodology could extract and quantify the causal relationships assumed by the\nnewspaper's writers. Looking at the extracted climate change narratives over\ntime, we find that since 2018, an increasing number of narratives suggest the\nimpact of the development of climate change policy discussion and the\nimplementation of climate change-related policies on corporate behaviors,\nmacroeconomics, and price dynamics. We also observed the recent emergence of\nnarratives focusing on the linkages between climate change-related policies and\nmonetary policy. Furthermore, there is a growing awareness of the negative\nimpacts of natural disasters (e.g., abnormal weather and severe floods) related\nto climate change on economic activities, and this issue might be perceived as\na new challenge for companies and governments. The methodology of this study is\nexpected to be applied to a wide range of fields, as it can analyze causal\nrelationships among various economic topics, including analysis of inflation\nexpectation or monetary policy communication strategy.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"nxGuvZpzPVG_1cteg9ugxSxWn2eEfwWejp9kYNKkUAA","pdfSize":"14930734","txDigest":"ENAM6GCMBX9FLTzMj97vbHf8BUUgXcWD1CERPUALU1fF","endEpoch":"1","status":"CERTIFIED"}
