{"id":"2408.11972","title":"Efficient nanoscale imaging of solid-state phase transitions by\n  transmission electron microscopy demonstrated on vanadium dioxide\n  nanoparticles","authors":"Michal Hor\\'ak, Peter Kepi\\v{c}, Ji\\v{r}\\'i Kab\\'at, Martin H\\'ajek,\n  Filip Ligmajer, Andrea Kone\\v{c}n\\'a, Tom\\'a\\v{s} \\v{S}ikola, and Vlastimil\n  K\\v{r}\\'apek","authorsParsed":[["Horák","Michal",""],["Kepič","Peter",""],["Kabát","Jiří",""],["Hájek","Martin",""],["Ligmajer","Filip",""],["Konečná","Andrea",""],["Šikola","Tomáš",""],["Křápek","Vlastimil",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 19:54:31 GMT"}],"updateDate":"2024-08-23","timestamp":1724270071000,"abstract":"  We present annular dark field scanning transmission electron microscopy\n(ADF-STEM) as an efficient, fast, and non-destructive nanoscale tool for\nmonitoring solid-state phase transition. Using metal-insulator transition in\nvanadium dioxide nanoparticles as an example, we characterize lattice and\nelectronic signatures of the phase transition using analytical transmission\nelectron microscopy including diffraction and electron energy-loss\nspectroscopy. We demonstrate that ADF-STEM shows a clear contrast across the\ntransition, interpreted with the help of convergent electron beam diffraction\nas stemming from the crystal-lattice modification accompanying the transition.\nIn addition, ADF-STEM utilizes 3--6 orders of magnitude lower electron dose\nwhen compared to electron microscopy techniques able to reveal the phase\ntransition with the same spatial resolution and universality. The benefits of\nADF-STEM are emphasized by recording a full hysteresis loop for the\nmetal-insulator transition of a single vanadium dioxide nanoparticle. Our study\nopens the prospect for fast, non-destructive, large-area and nanoscale\ncharacterization of solid-state phase transitions.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"B6XXkY9IDO6c_-87-Ah6P0aJvMbqI0N9KNPNcUYnjBk","pdfSize":"31817968"}
