{"id":"2408.10537","title":"Subspace Prototype Guidance for Mitigating Class Imbalance in Point\n  Cloud Semantic Segmentation","authors":"Jiawei Han, Kaiqi Liu, Wei Li, and Guangzhi Chen","authorsParsed":[["Han","Jiawei",""],["Liu","Kaiqi",""],["Li","Wei",""],["Chen","Guangzhi",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 04:31:46 GMT"}],"updateDate":"2024-08-21","timestamp":1724128306000,"abstract":"  Point cloud semantic segmentation can significantly enhance the perception of\nan intelligent agent. Nevertheless, the discriminative capability of the\nsegmentation network is influenced by the quantity of samples available for\ndifferent categories. To mitigate the cognitive bias induced by class\nimbalance, this paper introduces a novel method, namely subspace prototype\nguidance (\\textbf{SPG}), to guide the training of segmentation network.\nSpecifically, the point cloud is initially separated into independent point\nsets by category to provide initial conditions for the generation of feature\nsubspaces. The auxiliary branch which consists of an encoder and a projection\nhead maps these point sets into separate feature subspaces. Subsequently, the\nfeature prototypes which are extracted from the current separate subspaces and\nthen combined with prototypes of historical subspaces guide the feature space\nof main branch to enhance the discriminability of features of minority\ncategories. The prototypes derived from the feature space of main branch are\nalso employed to guide the training of the auxiliary branch, forming a\nsupervisory loop to maintain consistent convergence of the entire network. The\nexperiments conducted on the large public benchmarks (i.e. S3DIS, ScanNet v2,\nScanNet200, Toronto-3D) and collected real-world data illustrate that the\nproposed method significantly improves the segmentation performance and\nsurpasses the state-of-the-art method. The code is available at\n\\url{https://github.com/Javion11/PointLiBR.git}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"JbrcmAY_0qrgkmHiDI6hPS2QIrozjeTDP9Y5p91gnio","pdfSize":"5828921"}
