{"id":"2408.14296","title":"Relaxation-based schemes for on-the-fly parameter estimation in\n  dissipative dynamical systems","authors":"Vincent R. Martinez, Jacob Murri, Jared P. Whitehead","authorsParsed":[["Martinez","Vincent R.",""],["Murri","Jacob",""],["Whitehead","Jared P.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 14:28:24 GMT"}],"updateDate":"2024-08-27","timestamp":1724682504000,"abstract":"  This article studies two particular algorithms, a Relaxation Least Squares\n(RLS) algorithm and a Relaxation Newton Iteration (RNI) scheme , for\nreconstructing unknown parameters in dissipative dynamical systems. Both\nalgorithms are based on a continuous data assimilation (CDA) algorithm for\nstate reconstruction of A. Azouani, E. Olson, and E.S. Titi\n\\cite{Azouani_Olson_Titi_2014}. Due to the CDA origins of these parameter\nrecovery algorithms, these schemes provide on-the-fly reconstruction, that is,\nas data is collected, of unknown state and parameters simultaneously. It is\nshown how both algorithms give way to a robust general framework for\nsimultaneous state and parameter estimation. In particular, we develop a\ngeneral theory, applicable to a large class of dissipative dynamical systems,\nwhich identifies structural and algorithmic conditions under which the proposed\nalgorithms achieve reconstruction of the true parameters. The algorithms are\nimplemented on a high-dimensional two-layer Lorenz 96 model, where the\ntheoretical conditions of the general framework are explicitly verifiable. They\nare also implemented on the two-dimensional Rayleigh-B\\'enard convection system\nto demonstrate the applicability of the algorithms beyond the\nfinite-dimensional setting. In each case, systematic numerical experiments are\ncarried out probing the efficacy of the proposed algorithms, in addition to the\napparent benefits and drawbacks between them.\n","subjects":["Mathematics/Dynamical Systems","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Mathematics/Optimization and Control","Nonlinear Sciences/Chaotic Dynamics","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"siB4QSV7690YblR_skFZfLEYMQ2gn0LZYrIFBJeA8MA","pdfSize":"2169677"}
