{"id":"2408.08252","title":"Derivative-Free Guidance in Continuous and Discrete Diffusion Models\n  with Soft Value-Based Decoding","authors":"Xiner Li, Yulai Zhao, Chenyu Wang, Gabriele Scalia, Gokcen Eraslan,\n  Surag Nair, Tommaso Biancalani, Aviv Regev, Sergey Levine, Masatoshi Uehara","authorsParsed":[["Li","Xiner",""],["Zhao","Yulai",""],["Wang","Chenyu",""],["Scalia","Gabriele",""],["Eraslan","Gokcen",""],["Nair","Surag",""],["Biancalani","Tommaso",""],["Regev","Aviv",""],["Levine","Sergey",""],["Uehara","Masatoshi",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 16:47:59 GMT"},{"version":"v2","created":"Wed, 11 Sep 2024 05:19:32 GMT"},{"version":"v3","created":"Thu, 12 Sep 2024 17:56:40 GMT"}],"updateDate":"2024-09-13","timestamp":1723740479000,"abstract":"  Diffusion models excel at capturing the natural design spaces of images,\nmolecules, DNA, RNA, and protein sequences. However, rather than merely\ngenerating designs that are natural, we often aim to optimize downstream reward\nfunctions while preserving the naturalness of these design spaces. Existing\nmethods for achieving this goal often require ``differentiable'' proxy models\n(\\textit{e.g.}, classifier guidance or DPS) or involve computationally\nexpensive fine-tuning of diffusion models (\\textit{e.g.}, classifier-free\nguidance, RL-based fine-tuning). In our work, we propose a new method to\naddress these challenges. Our algorithm is an iterative sampling method that\nintegrates soft value functions, which looks ahead to how intermediate noisy\nstates lead to high rewards in the future, into the standard inference\nprocedure of pre-trained diffusion models. Notably, our approach avoids\nfine-tuning generative models and eliminates the need to construct\ndifferentiable models. This enables us to (1) directly utilize\nnon-differentiable features/reward feedback, commonly used in many scientific\ndomains, and (2) apply our method to recent discrete diffusion models in a\nprincipled way. Finally, we demonstrate the effectiveness of our algorithm\nacross several domains, including image generation, molecule generation, and\nDNA/RNA sequence generation. The code is available at\n\\href{https://github.com/masa-ue/SVDD}{https://github.com/masa-ue/SVDD}.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Quantitative Biology/Genomics","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cU3Q4XJDJveUQJs88RH9p7dT3WlOEBYhtBKe72zq5XY","pdfSize":"23666469"}
