{"id":"2408.00149","title":"Multipartite Entanglement for Multi-node Quantum Networks","authors":"E. M. Ainley, A. Agrawal, D. Main, P. Drmota, D. P. Nadlinger, B. C.\n  Nichol, R. Srinivas, G. Araneda","authorsParsed":[["Ainley","E. M.",""],["Agrawal","A.",""],["Main","D.",""],["Drmota","P.",""],["Nadlinger","D. P.",""],["Nichol","B. C.",""],["Srinivas","R.",""],["Araneda","G.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 20:23:28 GMT"}],"updateDate":"2024-08-02","timestamp":1722457408000,"abstract":"  Scaling the number of entangled nodes in a quantum network is a challenge\nwith significant implications for quantum computing, clock synchronisation,\nsecure communications, and quantum sensing. In a quantum network, photons\ninteract with matter qubits at different nodes, flexibly enabling the creation\nof remote entanglement between them. Multipartite entanglement among multiple\nnodes will be crucial for many proposed quantum network applications, including\nquantum computational tasks and quantum metrology. To date, experimental\nefforts have primarily focused on generating bipartite entanglement between\nnodes, which is widely regarded as the fundamental quantum resource for quantum\nnetworks. However, relying exclusively on bipartite entanglement to form more\ncomplex multipartite entanglement introduces several challenges. These include\nthe need for ancillary qubits, extensive local entangling operations which\nincreases the preparation latency, and increasingly stringent requirements on\ncoherence times as the number of nodes grows. Here, we analyse various schemes\nthat achieve multipartite entanglement between nodes in a single step,\nbypassing the need for multiple rounds of bipartite entanglement. We\ndemonstrate that different schemes can produce distinct multipartite entangled\nstates, with varying fidelity and generation rates. Additionally, we discuss\nthe applicability of these schemes across different experimental platforms,\nhighlighting their primary advantages and disadvantages.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}