{"id":"2408.13746","title":"Quartered Spectral Envelope and 1D-CNN-based Classification of Normally\n  Phonated and Whispered Speech","authors":"S. Johanan Joysingh, P. Vijayalakshmi, T. Nagarajan","authorsParsed":[["Joysingh","S. Johanan",""],["Vijayalakshmi","P.",""],["Nagarajan","T.",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 07:17:11 GMT"}],"updateDate":"2024-08-27","timestamp":1724570231000,"abstract":"  Whisper, as a form of speech, is not sufficiently addressed by mainstream\nspeech applications. This is due to the fact that systems built for normal\nspeech do not work as expected for whispered speech. A first step to building a\nspeech application that is inclusive of whispered speech, is the successful\nclassification of whispered speech and normal speech. Such a front-end\nclassification system is expected to have high accuracy and low computational\noverhead, which is the scope of this paper. One of the characteristics of\nwhispered speech is the absence of the fundamental frequency (or pitch), and\nhence the pitch harmonics as well. The presence of the pitch and pitch\nharmonics in normal speech, and its absence in whispered speech, is evident in\nthe spectral envelope of the Fourier transform. We observe that this\ncharacteristic is predominant in the first quarter of the spectrum, and exploit\nthe same as a feature. We propose the use of one dimensional convolutional\nneural networks (1D-CNN) to capture these features from the quartered spectral\nenvelope (QSE). The system yields an accuracy of 99.31% when trained and tested\non the wTIMIT dataset, and 100% on the CHAINS dataset. The proposed feature is\ncompared with Mel frequency cepstral coefficients (MFCC), a staple in the\nspeech domain. The proposed classification system is also compared with the\nstate-of-the-art system based on log-filterbank energy (LFBE) features trained\non long short-term memory (LSTM) network. The proposed system based on 1D-CNN\nperforms better than, or as good as, the state-of-the-art across multiple\nexperiments. It also converges sooner, with lesser computational overhead.\nFinally, the proposed system is evaluated under the presence of white noise at\nvarious signal-to-noise ratios and found to be robust.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jKI6-RhOa1jZJL-YfgTqr6hAeU0_KgXp9Nn8jvMB9Ns","pdfSize":"640723"}
