{"id":"2408.05902","title":"Observation of single-quantum vortex splitting in the\n  Ba$_{1-x}$K$_x$Fe$_2$As$_2$ superconductor","authors":"Q. Z. Zhou, B. R. Chen, B. K. Xiang, I. Timoshuk, J. Garaud, Y. Li, K.\n  Y. Liang, Q. S. He, Z. J. Li, P. H. Zhang, K. Z. Yao, H. X. Yao, E. Babaev,\n  V. Grinenko, Y. H. Wang","authorsParsed":[["Zhou","Q. Z.",""],["Chen","B. R.",""],["Xiang","B. K.",""],["Timoshuk","I.",""],["Garaud","J.",""],["Li","Y.",""],["Liang","K. Y.",""],["He","Q. S.",""],["Li","Z. J.",""],["Zhang","P. H.",""],["Yao","K. Z.",""],["Yao","H. X.",""],["Babaev","E.",""],["Grinenko","V.",""],["Wang","Y. H.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 02:49:12 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 03:29:21 GMT"}],"updateDate":"2024-08-29","timestamp":1723430952000,"abstract":"  Since their theoretical discovery more than a half-century ago, vortices\nobserved in bulk superconductors have carried a quantized value of magnetic\nflux determined only by fundamental constants. A recent experiment reported\n'unquantized' quantum vortices carrying the same fraction of flux quantum in\nBa$_{0.23}$K$_{0.77}$Fe$_2$As$_2$ in a small temperature range below its\nsuperconducting critical temperature ($T_C$). Here, we use scanning\nsuperconducting quantum interference device (sSQUID) microscopy with improved\nsensitivity to investigate the genesis of fractional vortices in\nBa$_{0.23}$K$_{0.77}$Fe$_2$As$_2$. We report the direct observation of a\nsingle-flux quantum vortex splitting into two different fractions with\nincreasing temperature. The flux of the two fractions has opposite dependence\non temperature, while the total flux sums up to one flux quantum despite their\nspatial separation. Overall, our study shows the existence of different\nfractional vortices and their stability in temperature ranging from 0.1 to 0.99\n$T_C$. Besides the implications of this observation for the fundamental\nquestion of quantum vorticity, the discovery of these objects paves the way for\nthe new platform for anyon quasiparticles and applications for fractional\nfluxonics.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/"}