{"id":"2408.09307","title":"A Benchmark Time Series Dataset for Semiconductor Fabrication\n  Manufacturing Constructed using Component-based Discrete-Event Simulation\n  Models","authors":"Vamsi Krishna Pendyala, Hessam S. Sarjoughian, Bala Potineni, Edward\n  J. Yellig","authorsParsed":[["Pendyala","Vamsi Krishna",""],["Sarjoughian","Hessam S.",""],["Potineni","Bala",""],["Yellig","Edward J.",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 23:05:47 GMT"}],"updateDate":"2024-08-20","timestamp":1723935947000,"abstract":"  Advancements in high-computing devices increase the necessity for improved\nand new understanding and development of smart manufacturing factories.\nDiscrete-event models with simulators have been shown to be critical to\narchitect, designing, building, and operating the manufacturing of\nsemiconductor chips. The diffusion, implantation, and lithography machines have\nintricate processes due to their feedforward and feedback connectivity. The\ndataset collected from simulations of the factory models holds the promise of\ngenerating valuable machine-learning models. As surrogate data-based models,\ntheir executions are highly efficient compared to the physics-based counterpart\nmodels. For the development of surrogate models, it is beneficial to have\npublicly available benchmark simulation models that are grounded in factory\nmodels that have concise structures and accurate behaviors. Hence, in this\nresearch, a dataset is devised and constructed based on a benchmark model of an\nIntel semiconductor fabrication factory. The model is formalized using the\nParallel Discrete-Event System Specification and executed using the DEVS-Suite\nsimulator. The time series dataset is constructed using discrete-event time\ntrajectories. This dataset is further analyzed and used to develop baseline\nunivariate and multivariate machine learning models. The dataset can also be\nutilized in the machine learning community for behavioral analysis based on\nformalized and scalable component-based discrete-event models and simulations.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"GBWjWIzW1foc-JzjIKbwa_4OpjgBVg035XCftbO9n4A","pdfSize":"1119202"}
