{"id":"2408.13998","title":"The untapped power of a general theory of organismal metabolism","authors":"Marko Jusup, Michael R. Kearney","authorsParsed":[["Jusup","Marko",""],["Kearney","Michael R.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 03:53:35 GMT"}],"updateDate":"2024-08-27","timestamp":1724644415000,"abstract":"  What makes living things special is how they manage matter, energy, and\nentropy. A general theory of organismal metabolism should therefore be\nquantified in these three currencies while capturing the unique way they flow\nbetween individuals and their environments. We argue that such a theory has\nquietly arrived -- 'Dynamic Energy Budget' (DEB) theory -- which conceptualises\norganisms as a series of macrochemical reactions that use energy to transform\nfood into structured biomass and bioproducts while producing entropy. We show\nthat such conceptualisation is deeply rooted in thermodynamic principles and\nthat, with the help of a small set of biological assumptions, it underpins the\nemergence of fundamental ecophysiological phenomena, most notably the\nthree-quarter power scaling of metabolism. Building on the subcellular nature\nof the theory, we unveil the eco-evolutionary relevance of coarse-graining\nbiomass into qualitatively distinct, stoichiometricially fixed pools with\nimplicitly regulated dynamics based on surface area-volume relations. We also\nshow how generalised enzymes called 'synthesising units' and an\ninformation-based state variable called 'maturity' capture transitions between\necological and physiological metabolic interactions, and thereby transitions\nbetween unicellular and multicellular metabolic organisation. Formal\ntheoretical frameworks make the constraints imposed by the laws of nature\nexplicit, which in turn leads to better research hypotheses and avoids errors\nin reasoning. DEB theory uniquely applies thermodynamic formalism to organismal\nmetabolism, linking biological processes across different scales through the\ntransformation of matter and energy, the production of entropy, and the\nexchange of information. We propose ways in which the theory can inform\ntrans-disciplinary efforts at the frontiers of the life sciences.\n","subjects":["Quantitative Biology/Populations and Evolution","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qC6vppeTJBeKzoXRl7hoV7KLEZyaJBqLwjPluqI0H7E","pdfSize":"1021585"}
