{"id":"2408.16945","title":"Different Victims, Same Layout: Email Visual Similarity Detection for\n  Enhanced Email Protection","authors":"Sachin Shukla, Omid Mirzaei","authorsParsed":[["Shukla","Sachin",""],["Mirzaei","Omid",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 23:51:51 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 14:20:02 GMT"},{"version":"v3","created":"Wed, 4 Sep 2024 14:25:47 GMT"}],"updateDate":"2024-09-05","timestamp":1724975511000,"abstract":"  In the pursuit of an effective spam detection system, the focus has often\nbeen on identifying known spam patterns either through rule-based detection\nsystems or machine learning (ML) solutions that rely on keywords. However, both\nsystems are susceptible to evasion techniques and zero-day attacks that can be\nachieved at low cost. Therefore, an email that bypassed the defense system once\ncan do it again in the following days, even though rules are updated or the ML\nmodels are retrained. The recurrence of failures to detect emails that exhibit\nlayout similarities to previously undetected spam is concerning for customers\nand can erode their trust in a company. Our observations show that threat\nactors reuse email kits extensively and can bypass detection with little\neffort, for example, by making changes to the content of emails. In this work,\nwe propose an email visual similarity detection approach, named Pisco, to\nimprove the detection capabilities of an email threat defense system. We apply\nour proof of concept to some real-world samples received from different\nsources. Our results show that email kits are being reused extensively and\nvisually similar emails are sent to our customers at various time intervals.\nTherefore, this method could be very helpful in situations where detection\nengines that rely on textual features and keywords are bypassed, an occurrence\nour observations show happens frequently.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"q9WJj9abVzn3Dyzxdv9Hk2gvu_iExm42PY1MPawfMPY","pdfSize":"843308"}
