{"id":"2408.02102","title":"The Infrared Surface Brightness technique applied to RR Lyrae stars from\n  the solar neighborhood","authors":"Bart{\\l}omiej Zgirski, Wolfgang Gieren, Grzegorz Pietrzy\\'nski, Marek\n  G\\'orski, Piotr Wielg\\'orski, Jesper Storm, Garance Bras, Pierre Kervella,\n  Nicolas Nardetto, Gergely Hajdu, Rolf Chini, Martin Haas","authorsParsed":[["Zgirski","Bartłomiej",""],["Gieren","Wolfgang",""],["Pietrzyński","Grzegorz",""],["Górski","Marek",""],["Wielgórski","Piotr",""],["Storm","Jesper",""],["Bras","Garance",""],["Kervella","Pierre",""],["Nardetto","Nicolas",""],["Hajdu","Gergely",""],["Chini","Rolf",""],["Haas","Martin",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 18:03:38 GMT"}],"updateDate":"2024-08-06","timestamp":1722794618000,"abstract":"  The Baade-Wesselink method allows us to estimate distances to individual\npulsating stars. Accurate geometric parallaxes obtained by the Gaia mission\nserve us in the calibration of the method and in the determination of its\nprecision. The method also provides a way of determining mean radii of\npulsating stars. The main aim of this work is to determine the scatter and\npossible dependence of p- factors of RR Lyrae stars on their pulsation periods.\nThe secondary objective is to determine mean radius - period relations for\nthese stars. Our calibrations for RR Lyrae stars are based on photometric data\ngathered at the Cerro Murphy Observatory. We obtained spectroscopic data\nspecifically for this project using high resolution spectrographs. We use the\nInfrared Surface Brightness (IRSB) version of the method that relies on a\nsurface brightness - color relation dependent on the (V-K) color. We obtain the\nspread of p- factors of around 0.07-0.08 for our sample of 9 RR Lyrae stars\nfrom the solar neighborhood. However, we also find relations between the\np-factor and the pulsation period for RRab stars with the rms scatter around\nthe relation of around 0.05, but with relatively large uncertainty of\nrelations' parameters. We present relations between the mean radius and period\nfor RR Lyrae pulsating in the fundamental mode with the rms scatter around the\nrelation of $0.012R_{\\odot}$. We observe a clear offset between p- factors\nobtained using the IRSB technique (with mean p between 1.39 and 1.45) and\nvalues inferred by Bras et al. (2024) using the SPIPS tool (M\\'erand et al.\n2015). On the other hand, we obtain a similar scatter of p of as observed by\nBras et al. (2024). Our period-radius relations are in a good agreement with\nboth the inference of Bras et al. (2024) based on SPIPS and theoretical\npredictions of Marconi et al. (2005, 2015)\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}