{"id":"2408.06839","title":"Geotree of Geodetector: An Anatomy of Knowledge Diffusion of a Novel\n  Statistic","authors":"Yuting Liang, Jinfeng Wang","authorsParsed":[["Liang","Yuting",""],["Wang","Jinfeng",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 12:01:03 GMT"}],"updateDate":"2024-08-14","timestamp":1723550463000,"abstract":"  The growing number of citations to original publications highlighted their\nutility across academia, but the dissemination of knowledge from tacit\nconceptualization to scientific publications and its global applications\nremains understudied, and the prediction of knowledge trends in a disciplinary\ncontext is rare. Addressing the gaps, this paper constructed a tree-like\nhierarchical model (Geotree) to dissect the knowledge evolution paths of the\nGeodetector theory (a case) using the Web of Science citation database. Our\nresults revealed that the knowledge evolution of 932 citations to Geodetector\nwas partitioned into periods: a budding period of initial theoretical\nexploration, a growing period for emerging topics in application, and a mature\nperiod marked by significant citation growth. Our test R2 of the predicting\nmodel over the next decade, considering the tree-like hierarchy across research\ndirections and disciplines, was 100% higher than that of the other two (from\n0.29 to 0.58). The knowledge spreading, from China to North America in 2011,\nEurope in 2012, Oceania in 2017, South America in 2018, and Africa in 2019, was\nmore associated with a country s production of scientific publications\n(q-statistic = 0.307***) than its income level. The Geotree modeling of two\nother cases from space science and physics confirmed the reliability of the\nsource publication-based approach in tracking knowledge diffusion. Our\nestablished research framework enriched the current methodology of information\nscience and provided valuable references for policymakers and scholars to\nenhance their decision-making processes.\n","subjects":["Computing Research Repository/Digital Libraries","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-CRQ1C4ST0suPScXaBSw7u73IOI7qg4FKFR--D5flhg","pdfSize":"1749714"}
