{"id":"2408.07912","title":"Congruence Classes of Simplex Structures in Finite Field Vector Spaces","authors":"Timothy Cheek, Joseph Cooper, Pico Gilman, Alex Iosevich, Kareem\n  Jaber, Eyvindur Palsson, Vismay Sharan, Jenna Shuffelton, Marie-H\\'el\\`ene\n  Tom\\'e","authorsParsed":[["Cheek","Timothy",""],["Cooper","Joseph",""],["Gilman","Pico",""],["Iosevich","Alex",""],["Jaber","Kareem",""],["Palsson","Eyvindur",""],["Sharan","Vismay",""],["Shuffelton","Jenna",""],["Tomé","Marie-Hélène",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 03:38:40 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 19:45:07 GMT"}],"updateDate":"2024-08-26","timestamp":1723693120000,"abstract":"  We study a generalization of the Erd\\H{o}s-Falconer distance problem over\nfinite fields. For a graph $G$, two embeddings $p, p': V(G) \\to \\mathbb{F}_q^d$\nof a graph $G$ are congruent if for all edges $(v_i, v_j)$ of $G$ we have that\n$||p(v_i) - p(v_j)|| = ||p'(v_i) - p'(v_j)||$. What is the infimum of $s$ such\nthat for any subset $E\\subset \\mathbb{F}_q^d$ with $|E| \\gtrsim q^s$, $E$\ncontains a positive proportion of congruence classes of $G$ in\n$\\mathbb{F}_q^d$? Bennett et al. and McDonald used group action methods to\nprove results in the case of $k$-simplices. The work of Iosevich, Jardine, and\nMcDonald as well as that of Bright et al. have proved results in the case of\ntrees and trees of simplices, utilizing the inductive nature of these graphs.\n  Recently, Aksoy, Iosevich, and McDonald combined these two approaches to\nobtain nontrivial bounds on the \"bowtie\" graph, two triangles joined at a\nvertex. Their proof relies on an application of the Hadamard three-lines\ntheorem to pass to a different graph. We develop novel geometric techniques\ncalled branch shifting and simplex unbalancing to reduce our analysis of trees\nof simplices to a much smaller class of simplex structures. This allows us to\nestablish a framework that handles a wide class of graphs exhibiting a\ncombination of rigid and loose behavior. In $\\mathbb{F}_q^2$, this approach\ngives new nontrivial bounds on chains and trees of simplices. In\n$\\mathbb{F}_q^d$, we improve on the results of Bright et al. in many cases and\ngeneralize their work to a wider class of simplex trees. We discuss partial\nprogress on how this framework can be extended to more general simplex\nstructures, such as cycles of simplices and structures of simplices glued\ntogether along an edge or a face.\n","subjects":["Mathematics/Combinatorics","Mathematics/Classical Analysis and ODEs"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}