{"id":"2408.13010","title":"A Web-Based Solution for Federated Learning with LLM-Based Automation","authors":"Chamith Mawela and Chaouki Ben Issaid and Mehdi Bennis","authorsParsed":[["Mawela","Chamith",""],["Issaid","Chaouki Ben",""],["Bennis","Mehdi",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 11:57:02 GMT"}],"updateDate":"2024-08-26","timestamp":1724414222000,"abstract":"  Federated Learning (FL) offers a promising approach for collaborative machine\nlearning across distributed devices. However, its adoption is hindered by the\ncomplexity of building reliable communication architectures and the need for\nexpertise in both machine learning and network programming. This paper presents\na comprehensive solution that simplifies the orchestration of FL tasks while\nintegrating intent-based automation. We develop a user-friendly web application\nsupporting the federated averaging (FedAvg) algorithm, enabling users to\nconfigure parameters through an intuitive interface. The backend solution\nefficiently manages communication between the parameter server and edge nodes.\nWe also implement model compression and scheduling algorithms to optimize FL\nperformance. Furthermore, we explore intent-based automation in FL using a\nfine-tuned Language Model (LLM) trained on a tailored dataset, allowing users\nto conduct FL tasks using high-level prompts. We observe that the LLM-based\nautomated solution achieves comparable test accuracy to the standard web-based\nsolution while reducing transferred bytes by up to 64% and CPU time by up to\n46% for FL tasks. Also, we leverage the neural architecture search (NAS) and\nhyperparameter optimization (HPO) using LLM to improve the performance. We\nobserve that by using this approach test accuracy can be improved by 10-20% for\nthe carried out FL tasks.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MXTxMwviyap3GZB9Ov23TM5FnXaE89BW4ZDsNfAQOKg","pdfSize":"2578012"}
