{"id":"2408.15124","title":"Silver electrodes are highly selective for CO in CO$_2$ electroreduction\n  due to interplay between voltage dependent kinetics and thermodynamics","authors":"Michele Re Fiorentin, Francesca Risplendi, Clara Salvini, Juqin Zeng,\n  Giancarlo Cicero and Hannes J\\'onsson","authorsParsed":[["Fiorentin","Michele Re",""],["Risplendi","Francesca",""],["Salvini","Clara",""],["Zeng","Juqin",""],["Cicero","Giancarlo",""],["Jónsson","Hannes",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 15:04:21 GMT"}],"updateDate":"2024-08-28","timestamp":1724771061000,"abstract":"  Electrochemical reduction is a promising way to make use of CO$_2$ as\nfeedstock for generating renewable fuel and valuable chemicals. Several metals\ncan be used in the electrocatalyst to generate CO and formic acid but hydrogen\nformation is an unwanted side reaction that can even be dominant. The lack of\nselectivity is in general a significant problem, but silver-based\nelectrocatalysts have been shown to be highly selective for CO with over over\n90% faradaic efficiency when the applied voltage is below -1 V vs. RHE.\nHydrogen formation is then insignificant and little formate is formed even\nthough it is thermodynamically favored. We present calculations of the\nactivation free energy for the various elementary steps as a function of\napplied voltage at the three low index facets, Ag(111), Ag(100) and Ag(110), as\nwell as experimental measurements on polycrystalline electrodes, to identify\nthe reason for this high selectivity. The formation of formic acid is\nsuppressed because of the low coverage of adsorbed hydrogen and kinetic\nhindrance to the formation of the HCOO* intermediate, while *COOH, a key\nintermediate in CO formation, is thermodynamically unstable until the applied\nvoltage reaches -1 V vs. RHE, at which point the kinetics for its formation are\nmore favorable than for hydrogen. The calculated results are consistent with\nexperimental measurements carried out for acidic conditions and provide an\natomic scale insight into the high CO selectivity of silver-based\nelectrocatalysts.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}