{"id":"2408.02404","title":"Feedback Reciprocal Graph Collaborative Filtering","authors":"Weijun Chen, Yuanchen Bei, Qijie Shen, Hao Chen, Xiao Huang, Feiran\n  Huang","authorsParsed":[["Chen","Weijun",""],["Bei","Yuanchen",""],["Shen","Qijie",""],["Chen","Hao",""],["Huang","Xiao",""],["Huang","Feiran",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 11:57:11 GMT"}],"updateDate":"2024-08-06","timestamp":1722859031000,"abstract":"  Collaborative filtering on user-item interaction graphs has achieved success\nin the industrial recommendation. However, recommending users' truly fascinated\nitems poses a seesaw dilemma for collaborative filtering models learned from\nthe interaction graph. On the one hand, not all items that users interact with\nare equally appealing. Some items are genuinely fascinating to users, while\nothers are unfascinated. Training graph collaborative filtering models in the\nabsence of distinction between them can lead to the recommendation of\nunfascinating items to users. On the other hand, disregarding the interacted\nbut unfascinating items during graph collaborative filtering will result in an\nincomplete representation of users' interaction intent, leading to a decline in\nthe model's recommendation capabilities. To address this seesaw problem, we\npropose Feedback Reciprocal Graph Collaborative Filtering (FRGCF), which\nemphasizes the recommendation of fascinating items while attenuating the\nrecommendation of unfascinating items. Specifically, FRGCF first partitions the\nentire interaction graph into the Interacted & Fascinated (I&F) graph and the\nInteracted & Unfascinated (I&U) graph based on the user feedback. Then, FRGCF\nintroduces separate collaborative filtering on the I&F graph and the I&U graph\nwith feedback-reciprocal contrastive learning and macro-level feedback\nmodeling. This enables the I&F graph recommender to learn multi-grained\ninteraction characteristics from the I&U graph without being misdirected by it.\nExtensive experiments on four benchmark datasets and a billion-scale industrial\ndataset demonstrate that FRGCF improves the performance by recommending more\nfascinating items and fewer unfascinating items. Besides, online A/B tests on\nTaobao's recommender system verify the superiority of FRGCF.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}