{"id":"2408.14646","title":"ParTEETor: A System for Partial Deployments of TEEs within Tor","authors":"Rachel King, Quinn Burke, Yohan Beugin, Blaine Hoak, Kunyang Li, Eric\n  Pauley, Ryan Sheatsley, Patrick McDaniel","authorsParsed":[["King","Rachel",""],["Burke","Quinn",""],["Beugin","Yohan",""],["Hoak","Blaine",""],["Li","Kunyang",""],["Pauley","Eric",""],["Sheatsley","Ryan",""],["McDaniel","Patrick",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 21:23:19 GMT"}],"updateDate":"2024-08-28","timestamp":1724707399000,"abstract":"  The Tor anonymity network allows users such as political activists and those\nunder repressive governments to protect their privacy when communicating over\nthe internet. At the same time, Tor has been demonstrated to be vulnerable to\nseveral classes of deanonymizing attacks that expose user behavior and\nidentities. Prior work has shown that these threats can be mitigated by\nleveraging trusted execution environments (TEEs). However, previous proposals\nassume that all relays in the network will be TEE-based-which as a practical\nmatter is unrealistic. In this work, we introduce ParTEETor, a Tor-variant\nsystem, which leverages partial deployments of TEEs to thwart known attacks. We\nstudy two modes of operation: non-policy and policy. Non-policy mode uses the\nexisting Tor relay selection algorithm to provide users incident security.\nPolicy mode extends the relay selection algorithm to address the classes of\nattacks by enforcing a specific TEE circuit configuration. We evaluate\nParTEETor for security, performance, and privacy. Our evaluation demonstrates\nthat at even a small TEE penetration (e.g., 10% of relays are TEE-based), users\ncan reach performance of Tor today while enforcing a security policy to\nguarantee protection from at least two classes of attacks. Overall, we find\nthat partial deployments of TEEs can substantially improve the security of Tor,\nwithout a significant impact on performance or privacy.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Igwzxzur0fUz3XEk3PmkwSZg5TeMEieM5VYs0w9qGHA","pdfSize":"1562427"}
