{"id":"2408.06571","title":"Iterative quantum optimization of spin glass problems with rapidly\n  oscillating transverse fields","authors":"Brandon Barton, Jacob Sagal, Sean Feeney, George Grattan, Pratik\n  Patnaik, Vadim Oganesyan, Lincoln D Carr and Eliot Kapit","authorsParsed":[["Barton","Brandon",""],["Sagal","Jacob",""],["Feeney","Sean",""],["Grattan","George",""],["Patnaik","Pratik",""],["Oganesyan","Vadim",""],["Carr","Lincoln D",""],["Kapit","Eliot",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 02:09:30 GMT"}],"updateDate":"2024-08-14","timestamp":1723514970000,"abstract":"  In this work, we introduce a new iterative quantum algorithm, called\nIterative Symphonic Tunneling for Satisfiability problems (IST-SAT), which\nsolves quantum spin glass optimization problems using high-frequency\noscillating transverse fields. IST-SAT operates as a sequence of iterations, in\nwhich bitstrings returned from one iteration are used to set spin-dependent\nphases in oscillating transverse fields in the next iteration. Over several\niterations, the novel mechanism of the algorithm steers the system toward the\nproblem ground state. We benchmark IST-SAT on sets of hard MAX-3-XORSAT problem\ninstances with exact state vector simulation, and report polynomial speedups\nover trotterized adiabatic quantum computation (TAQC) and the best known\nsemi-greedy classical algorithm. When IST-SAT is seeded with a sufficiently\ngood initial approximation, the algorithm converges to exact solution(s) in a\npolynomial number of iterations. Our numerical results identify a critial\nHamming radius(CHR), or quality of initial approximation, where the\ntime-to-solution crosses from exponential to polynomial scaling in problem\nsize. By combining IST-SAT with future classical or quantum approximation\nalgorithms, larger gains may be achieved. The mechanism we present in this work\nthus presents a new path toward achieving quantum advantage in optimization.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MOpt9sHOqXs-8Dqby0ZPnA0oXzVsjLYiiM574kVwMfo","pdfSize":"5536158"}
