{"id":"2408.04873","title":"Unsupervised Episode Detection for Large-Scale News Events","authors":"Priyanka Kargupta, Yunyi Zhang, Yizhu Jiao, Siru Ouyang, Jiawei Han","authorsParsed":[["Kargupta","Priyanka",""],["Zhang","Yunyi",""],["Jiao","Yizhu",""],["Ouyang","Siru",""],["Han","Jiawei",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 05:26:31 GMT"}],"updateDate":"2024-08-12","timestamp":1723181191000,"abstract":"  Episodic structures are inherently interpretable and adaptable to evolving\nlarge-scale key events. However, state-of-the-art automatic event detection\nmethods overlook event episodes and, therefore, struggle with these crucial\ncharacteristics. This paper introduces a novel task, episode detection, aimed\nat identifying episodes from a news corpus containing key event articles. An\nepisode describes a cohesive cluster of core entities (e.g., \"protesters\",\n\"police\") performing actions at a specific time and location. Furthermore, an\nepisode is a significant part of a larger group of episodes under a particular\nkey event. Automatically detecting episodes is challenging because, unlike key\nevents and atomic actions, we cannot rely on explicit mentions of times and\nlocations to distinguish between episodes or use semantic similarity to merge\ninconsistent episode co-references. To address these challenges, we introduce\nEpiMine, an unsupervised episode detection framework that (1) automatically\nidentifies the most salient, key-event-relevant terms and segments, (2)\ndetermines candidate episodes in an article based on natural episodic\npartitions estimated through shifts in discriminative term combinations, and\n(3) refines and forms final episode clusters using large language model-based\nreasoning on the candidate episodes. We construct three diverse, real-world\nevent datasets annotated at the episode level. EpiMine outperforms all\nbaselines on these datasets by an average 59.2% increase across all metrics.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}