{"id":"2408.01493","title":"Strong pairing and symmetric pseudogap metal in double Kondo lattice\n  model: from nickelate superconductor to tetralayer optical lattice","authors":"Hui Yang, Hanbit Oh and Ya-Hui Zhang","authorsParsed":[["Yang","Hui",""],["Oh","Hanbit",""],["Zhang","Ya-Hui",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 18:00:02 GMT"}],"updateDate":"2024-08-06","timestamp":1722621602000,"abstract":"  In this work, we propose and study a double Kondo lattice model which hosts\nrobust superconductivity. The system consists of two identical Kondo lattice\nmodel, each with Kondo coupling $J_K$ within each layer, while the localized\nspin moments are coupled together via an inter-layer on-site antiferromagnetic\nspin coupling $J_\\perp$. We consider the strong $J_\\perp$ limit, wherein the\nlocal moments tend to form rung singlets and are thus gapped. However, the\nKondo coupling $J_K$ transmits the inter-layer entanglement between the local\nmoments to the itinerant electrons. Consequently, the itinerant electrons\nexperience a strong inter-layer antiferromangetic spin coupling and form strong\ninter-layer pairing, which is confirmed through numerical simulation in one\ndimensional system. Experimentally, the $J_K \\rightarrow -\\infty$ limits of the\nmodel describes the recently found bilayer nickelate La$_3$Ni$_2$O$_7$, while\nthe $J_K>0$ side can be realized in tetralayer optical lattice of cold atoms.\nTwo extreme limits, $J_K \\rightarrow -\\infty$ and $J_K \\rightarrow +\\infty$\nlimit are shown to be simplified to a bilayer type II t-J model and a bilayer\none-orbital t-J model, respectively. Thus, our double Kondo lattice model\noffers a unified framework for nickelate superconductor and tetralayer optical\nlattice quantum simulator upon changing the sign of $J_K$. We highlight both\nthe qualitative similarity and the quantitative difference in the two sides of\n$J_K$. Finally, we discuss the possibility of a symmetric Kondo breakdown\ntransition in the model with a symmetric pseudogap metal corresponding to the\nusual heavy Fermi liquid.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"WVIg9pfBfd49NJIHy-3iOsotRMt2V7Y0nzU2vwjG57A","pdfSize":"15632646","txDigest":"ERZdQ1R6JRCxETxSP3DMvZjt48DDn6EEdqJtq4F6tqJN","endEpoch":"1","status":"CERTIFIED"}
