{"id":"2408.10112","title":"Eight New Substellar Hyades Candidates from the UKIRT Hemisphere Survey","authors":"Adam C. Schneider, Michael C. Cushing, Robert A. Stiller, Jeffrey A.\n  Munn, Frederick J. Vrba, Justice Bruursema, Stephen J. Williams, Michael C.\n  Liu, Alexia Bravo, Jacqueline K. Faherty, Austin Rothermich, Emily Calamari,\n  Dan Caselden, Martin Kabatnik, Arttu Sainio, Thomas P. Bickle, William\n  Pendrill, Nikolaj Stevnbak Andersen, Melina Thevenot","authorsParsed":[["Schneider","Adam C.",""],["Cushing","Michael C.",""],["Stiller","Robert A.",""],["Munn","Jeffrey A.",""],["Vrba","Frederick J.",""],["Bruursema","Justice",""],["Williams","Stephen J.",""],["Liu","Michael C.",""],["Bravo","Alexia",""],["Faherty","Jacqueline K.",""],["Rothermich","Austin",""],["Calamari","Emily",""],["Caselden","Dan",""],["Kabatnik","Martin",""],["Sainio","Arttu",""],["Bickle","Thomas P.",""],["Pendrill","William",""],["Andersen","Nikolaj Stevnbak",""],["Thevenot","Melina",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 15:59:49 GMT"}],"updateDate":"2024-08-20","timestamp":1724083189000,"abstract":"  We have used the UKIRT Hemisphere Survey (UHS) combined with the UKIDSS\nGalactic Cluster Survey (GCS), the UKIDSS Galactic Plane Survey (GPS), and the\nCatWISE2020 catalog to search for new substellar members of the nearest open\ncluster to the Sun, the Hyades. Eight new substellar Hyades candidate members\nwere identified and observed with the Gemini/GNIRS near-infrared spectrograph.\nAll eight objects are confirmed as brown dwarfs with spectral types ranging\nfrom L6 to T5, with two objects showing signs of spectral binarity and/or\nvariability. A kinematic analysis demonstrates that all eight new discoveries\nlikely belong to the Hyades cluster, with future radial velocity and parallax\nmeasurements needed to confirm their membership. CWISE J042356.23$+$130414.3,\nwith a spectral type of T5, would be the coldest ($T_{\\rm eff}$$\\approx$1100 K)\nand lowest-mass ($M$$\\approx$30 $M_{\\rm Jup}$) free-floating member of the\nHyades yet discovered. We further find that high-probability substellar Hyades\nmembers from this work and previous studies have redder near-infrared colors\nthan field-age brown dwarfs, potentially due to lower surface gravities and\nsuper-solar metallicities.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VOSkKiaBt_ib770Zm3MSkBqNMm3yCUAmoaSZhyhfRfM","pdfSize":"1447771"}
