{"id":"2408.07456","title":"A Survey on Immersive Cyber Situational Awareness Systems","authors":"Hussain Ahmad, Faheem Ullah, Rehan Jafri","authorsParsed":[["Ahmad","Hussain",""],["Ullah","Faheem",""],["Jafri","Rehan",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 10:49:39 GMT"}],"updateDate":"2024-08-15","timestamp":1723632579000,"abstract":"  Cyber situational awareness systems are increasingly used for creating cyber\ncommon operating pictures for cybersecurity analysis and education. However,\nthese systems face data occlusion and convolution issues due to the burgeoning\ncomplexity, dimensionality, and heterogeneity of cybersecurity data, which\ndamages cyber Situational Awareness (SA) of end-users. Moreover, conventional\nways of human-computer interactions, such as mouse and keyboard, increase the\nmental effort and cognitive load of cybersecurity practitioners, when analyzing\ncyber situations of large-scale infrastructures. Therefore, immersive\ntechnologies, such as virtual reality, augmented reality, and mixed reality,\nare employed in the cybersecurity realm to create intuitive, engaging, and\ninteractive cyber common operating pictures. The Immersive Cyber Situational\nAwareness (ICSA) systems provide several unique visualization techniques and\ninteraction features for the perception, comprehension, and projection of cyber\nSA. However, there has been no attempt to comprehensively investigate and\nclassify the existing state of the art in the use of immersive technologies for\ncyber SA. Therefore, in this paper, we have gathered, analyzed, and synthesized\nthe existing body of knowledge on ICSA systems. In particular, our survey has\nidentified visualization and interaction techniques, evaluation mechanisms, and\ndifferent levels of cyber SA (i.e., perception, comprehension, and projection)\nfor ICSA systems. Consequently, our survey has enabled us to propose: (i) a\nreference framework for designing and analyzing ICSA systems by mapping\nimmersive visualization and interaction techniques to the different levels of\nICSA; (ii) future research directions for advancing the state-of-the-art on\nICSA systems; and (iii) an in-depth analysis of the industrial implications of\nICSA systems to enhance cybersecurity operations.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}