{"id":"2408.02335","title":"Reemergence of Trampolining in a Leidenfrost Droplet","authors":"Pranjal Agrawal, Gaurav Tomar, Susmita Dash","authorsParsed":[["Agrawal","Pranjal",""],["Tomar","Gaurav",""],["Dash","Susmita",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 09:18:29 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 07:19:54 GMT"}],"updateDate":"2024-08-28","timestamp":1722849509000,"abstract":"  The levitating Leidenfrost (LF) state of a droplet on a heated substrate is\noften accompanied by fascinating behaviors such as star-shaped deformations,\nself-propulsion, bouncing, and trampolining. These behaviors arise due to the\nvapor flow instabilities at the liquid-vapor interface beneath the droplet at\nsizes typically comparable to the capillary length scale of the liquid. Here,\nwe report on the spontaneous bouncing, trampolining, and hovering behavior of\nan unconstrained LF water droplet. We observe that a droplet exhibits\nintermittent increase in bouncing height at specific radii and subsequent\nreduction in the height of bounce leading to a quiescent LF state. The\nreemergence of the trampolining behavior from the quiescent hovering state\nwithout any external forcing is observed at sizes as low as 0.1 times the\ncapillary length. We attribute the droplet bouncing behavior to the dynamics of\nvapor flow beneath the LF droplet. We propose that the trampolining behavior of\nthe droplet at specific radii is triggered by subharmonic and harmonic\nexcitation of the liquid-vapor interface. We attribute the intermittent\ntrampolining events to the change in the natural frequency of the droplet and\nthe vapor layer due to evaporative mass loss. This proposed mechanism of\nresonance-driven trampolining of LF droplets is observed to be applicable for\ndifferent liquids irrespective of the initial volume and substrate\ntemperatures, thus indicating a universality of the behavior.\n","subjects":["Physics/Fluid Dynamics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}