{"id":"2408.00901","title":"A value-focused thinking approach to measure community resilience","authors":"Rohit Suresh, Parastoo Akbari, Cameron A MacKenzie","authorsParsed":[["Suresh","Rohit",""],["Akbari","Parastoo",""],["MacKenzie","Cameron A",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 20:41:15 GMT"}],"updateDate":"2024-08-05","timestamp":1722544875000,"abstract":"  Community resilience refers to the ability to prepare for, absorb, recover\nfrom, and adapt to disruptive events, but specific definitions and measures for\nresilience can vary widely from researcher to researcher or from discipline to\ndiscipline. Community resilience is often measured using a set of indicators\nbased on census, socioeconomic, and community organizational data, but these\nmetrics and measures for community resilience provide little guidance for\npolicymakers to determine how best to increase the community resilience. This\narticle proposes to measure community resilience based on value focused\nthinking. We propose an objectives hierarchy that begins with a community\ndecision makers' fundamental objective for resilience. Six high level\nobjectives for community resilience, including social resilience, economic\nresilience, infrastructure resilience, environmental resilience, availability\nof resources, and functionality of critical services, are broken down into\nmeasurable attributes that focus on specific outcomes that a decision maker\nwould like to achieve if a disruption occurs. This new way of assessing\nresilience is applied to measure the resilience of an illustrative community to\nan improvised explosive device, a cyberattack, a tornado, a flood, and a winter\nstorm. Keywords: Community Resilience, Resiliency, Risk Analysis\n","subjects":["Computing Research Repository/Social and Information Networks","Mathematics/Optimization and Control","Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kv5ua1gYsi8Yt5U_jvyrtkk40FTqhFloSLlRFMCPE4w","pdfSize":"583211"}
