{"id":"2408.07177","title":"V3rified: Revelation vs Non-Revelation Mechanisms for Decentralized\n  Verifiable Computation","authors":"Tiantian Gong, Aniket Kate, Alexandros Psomas, Athina Terzoglou","authorsParsed":[["Gong","Tiantian",""],["Kate","Aniket",""],["Psomas","Alexandros",""],["Terzoglou","Athina",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 19:38:59 GMT"}],"updateDate":"2024-08-15","timestamp":1723577939000,"abstract":"  In the era of Web3, decentralized technologies have emerged as the\ncornerstone of a new digital paradigm. Backed by a decentralized blockchain\narchitecture, the Web3 space aims to democratize all aspects of the web. From\ndata-sharing to learning models, outsourcing computation is an established,\nprevalent practice. Verifiable computation makes this practice trustworthy as\nclients/users can now efficiently validate the integrity of a computation. As\nverifiable computation gets considered for applications in the Web3 space,\ndecentralization is crucial for system reliability, ensuring that no single\nentity can suppress clients. At the same time, however, decentralization needs\nto be balanced with efficiency: clients want their computations done as quickly\nas possible.\n  Motivated by these issues, we study the trade-off between decentralization\nand efficiency when outsourcing computational tasks to strategic, rational\nsolution providers. Specifically, we examine this trade-off when the client\nemploys (1) revelation mechanisms, i.e. auctions, where solution providers bid\ntheir desired reward for completing the task by a specific deadline and then\nthe client selects which of them will do the task and how much they will be\nrewarded, and (2) simple, non-revelation mechanisms, where the client commits\nto the set of rules she will use to map solutions at specific times to rewards\nand then solution providers decide whether they want to do the task or not. We\ncompletely characterize the power and limitations of revelation and\nnon-revelation mechanisms in our model.\n","subjects":["Computing Research Repository/Computer Science and Game Theory"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"UBrnZ7vZoGstaR2kwDlh9QALon7QdYzr4vCSnLxayDo","pdfSize":"265494"}
