{"id":"2408.12958","title":"Analysis of DNS Dependencies and their Security Implications in\n  Australia: A Comparative Study of General and Indigenous Populations","authors":"Niousha Nazemi, Omid Tavallaie, Anna Maria Mandalari, Hamed Haddadi,\n  Ralph Holz and Albert Y. Zomaya","authorsParsed":[["Nazemi","Niousha",""],["Tavallaie","Omid",""],["Mandalari","Anna Maria",""],["Haddadi","Hamed",""],["Holz","Ralph",""],["Zomaya","Albert Y.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 10:09:28 GMT"}],"updateDate":"2024-08-26","timestamp":1724407768000,"abstract":"  This paper investigates the impact of internet centralization on DNS\nprovisioning, particularly its effects on vulnerable populations such as the\nindigenous people of Australia. We analyze the DNS dependencies of Australian\ngovernment domains that serve indigenous communities compared to those serving\nthe general population. Our study categorizes DNS providers into leading\n(hyperscaler, US-headquartered companies), non-leading (smaller\nAustralian-headquartered or non-Australian companies), and Australian\ngovernment-hosted providers. Then, we build dependency graphs to demonstrate\nthe direct dependency between Australian government domains and their DNS\nproviders and the indirect dependency involving further layers of providers.\nAdditionally, we conduct an IP location analysis of DNS providers to map out\nthe geographical distribution of DNS servers, revealing the extent of\ncentralization on DNS services within or outside of Australia. Finally, we\nintroduce an attacker model to categorize potential cyber attackers based on\ntheir intentions and resources. By considering attacker models and DNS\ndependency results, we discuss the security vulnerability of each population\ngroup against any group of attackers and analyze whether the current setup of\nthe DNS services of Australian government services contributes to a digital\ndivide.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}