{"id":"2408.09522","title":"Orchestrating Federated Learning in Space-Air-Ground Integrated\n  Networks: Adaptive Data Offloading and Seamless Handover","authors":"Dong-Jun Han, Wenzhi Fang, Seyyedali Hosseinalipour, Mung Chiang,\n  Christopher G. Brinton","authorsParsed":[["Han","Dong-Jun",""],["Fang","Wenzhi",""],["Hosseinalipour","Seyyedali",""],["Chiang","Mung",""],["Brinton","Christopher G.",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 16:09:49 GMT"}],"updateDate":"2024-08-20","timestamp":1723997389000,"abstract":"  Devices located in remote regions often lack coverage from well-developed\nterrestrial communication infrastructure. This not only prevents them from\nexperiencing high quality communication services but also hinders the delivery\nof machine learning services in remote regions. In this paper, we propose a new\nfederated learning (FL) methodology tailored to space-air-ground integrated\nnetworks (SAGINs) to tackle this issue. Our approach strategically leverages\nthe nodes within space and air layers as both (i) edge computing units and (ii)\nmodel aggregators during the FL process, addressing the challenges that arise\nfrom the limited computation powers of ground devices and the absence of\nterrestrial base stations in the target region. The key idea behind our\nmethodology is the adaptive data offloading and handover procedures that\nincorporate various network dynamics in SAGINs, including the mobility,\nheterogeneous computation powers, and inconsistent coverage times of incoming\nsatellites. We analyze the latency of our scheme and develop an adaptive data\noffloading optimizer, and also characterize the theoretical convergence bound\nof our proposed algorithm. Experimental results confirm the advantage of our\nSAGIN-assisted FL methodology in terms of training time and test accuracy\ncompared with various baselines.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}