{"id":"2408.06910","title":"Apsidal motion and TESS light curves of three southern close eccentric\n  eclipsing binaries: GM Nor, V397 Pup, and PT Vel","authors":"M. Wolf, P. Zasche, J. K\\'ara, M. Zejda, J. Jan\\'ik, M. Ma\\v{s}ek, M.\n  Lehk\\'y, J. Merc, A. Richterkov\\'a, D. Han\\v{z}l, Z. Mikul\\'a\\v{s}ek, S.N. de\n  Villiers, and J. Li\\v{s}ka","authorsParsed":[["Wolf","M.",""],["Zasche","P.",""],["Kára","J.",""],["Zejda","M.",""],["Janík","J.",""],["Mašek","M.",""],["Lehký","M.",""],["Merc","J.",""],["Richterková","A.",""],["Hanžl","D.",""],["Mikulášek","Z.",""],["de Villiers","S. N.",""],["Liška","J.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 14:03:37 GMT"}],"updateDate":"2024-08-14","timestamp":1723557817000,"abstract":"  New ground-based and space-based photometric data have been obtained and\narchival spectroscopic measurements were used in this study of three detached\nearly-type and southern-hemisphere eccentric eclipsing binaries GM Nor (P =\n1.88 d, e = 0.05), V397 Pup (3.00, 0.30), and PT Vel (1.80, 0.12). Their TESS\nobservations in several sectors have also been included and the corresponding\nlight curves were solved using the Phoebe code. As a result, new accurate\nphotoelectric times of minimum light have been obtained. The newly completed\nO-C diagrams were analyzed using all reliable timings found in the literature\nand calculated using the TESS light curves. New or improved values for the\nelements of apsidal motion were obtained. Using ESO archive spectroscopy, for\nV397 Pup, the precise absolute parameters were newly derived: M1 = 3.076(35)\nM$\\odot$, M2 = 2.306(35) M$\\odot$, and R1 = 2.711(55) R$\\odot$, R2 = 1.680(55)\nR$\\odot$. For PT Vel the absolute dimensions were improved: M1 = 2.204(25)\nM$\\odot$, M2 = 1.638(25) M$\\odot$, and R1 = 2.108(30) R$\\odot$, R2 = 1.605(30)\nR$\\odot$. For GM Nor, the less accurate absolute parameters based on the light\ncurve analysis were evaluated: M1 = 1.94(15) M$\\odot$, M2 = 1.84(14) M$\\odot$,\nand R1 = 2.27(20) R$\\odot$, R2 = 2.25(20) R$\\odot$. We found more precise and\nrelatively short periods of apsidal motion of about 80, 335, and 160 years,\nalong with the corresponding internal structure constants, log k2, -2.524,\n-2.361, and -2.563, for GM Nor, V397 Pup, and PT Vel, respectively.\nRelativistic effects are small but not negligible, making up to 10\\% of the\ntotal apsidal motion rate in all systems. No marks of the presence of the third\nbody were revealed in the light curves, on the O-C diagrams, or in the reduced\nspectra of the eccentric systems studied here.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ih2XDyP6sUFQigXhJRPtCZ3_uRgmfXR4M6PBz8MtdRw","pdfSize":"26157478"}
