{"id":"2408.00209","title":"Extracting doubly-excited state lifetimes in helium directly in the time\n  domain with attosecond noncollinear four-wave-mixing spectroscopy","authors":"Patrick Rupprecht (1 and 2), Nicolette G. Puskar (1 and 2), Daniel M.\n  Neumark (1 and 2), and Stephen R. Leone (1 and 2 and 3) ((1) Department of\n  Chemistry, University of California, Berkeley, California, USA, (2) Chemical\n  Sciences Division, Lawrence Berkeley National Laboratory, Berkeley,\n  California, USA, (3) Department of Physics, University of California,\n  Berkeley, California, USA)","authorsParsed":[["Rupprecht","Patrick","","1 and 2"],["Puskar","Nicolette G.","","1 and 2"],["Neumark","Daniel M.","","1 and 2"],["Leone","Stephen R.","","1 and 2 and 3"]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 00:35:57 GMT"}],"updateDate":"2024-08-02","timestamp":1722472557000,"abstract":"  The helium atom, with one nucleus and two electrons, is a prototypical system\nto study quantum many-body dynamics. Doubly-excited states, or quantum states\nin which both electrons are excited by one photon, are showcase scenarios of\nelectronic-correlation mediated effects. In this paper, the natural lifetimes\nof the doubly-excited $^1$P$^o$ 2s$n$p Rydberg series and the $^1$S$^e$ 2p$^2$\ndark state in helium in the 60 eV to 65 eV region are measured directly in the\ntime domain with extreme-ultraviolet/near-infrared noncollinear attosecond\nfour-wave-mixing (FWM) spectroscopy. The measured lifetimes are in agreement\nwith lifetimes deduced from spectral linewidths and theoretical predictions,\nand the roles of specific decay mechanisms are considered. While complex\nspectral line shapes in the form of Fano resonances are common in absorption\nspectroscopy of autoionizing states, the background-free and thus homodyned\ncharacter of noncollinear FWM results exclusively in Lorentzian spectral\nfeatures in the absence of strong-field effects. The onset of strong-field\neffects that would affect the extraction of accurate natural lifetimes in\nhelium by FWM is determined to be approximately 0.3 Rabi cycles. This study\nprovides a systematic understanding of the FWM parameters necessary to enable\naccurate lifetime extractions, which can be utilized in more complex quantum\nsystems such as molecules in the future.\n","subjects":["Physics/Atomic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}