{"id":"2408.00599","title":"Learned Compression of Point Cloud Geometry and Attributes in a Single\n  Model through Multimodal Rate-Control","authors":"Michael Rudolph, Aron Riemenschneider, Amr Rizk","authorsParsed":[["Rudolph","Michael",""],["Riemenschneider","Aron",""],["Rizk","Amr",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 14:31:06 GMT"}],"updateDate":"2024-08-02","timestamp":1722522666000,"abstract":"  Point cloud compression is essential to experience volumetric multimedia as\nit drastically reduces the required streaming data rates. Point attributes,\nspecifically colors, extend the challenge of lossy compression beyond geometric\nrepresentation to achieving joint reconstruction of texture and geometry.\nState-of-the-art methods separate geometry and attributes to compress them\nindividually. This comes at a computational cost, requiring an encoder and a\ndecoder for each modality. Additionally, as attribute compression methods\nrequire the same geometry for encoding and decoding, the encoder emulates the\ndecoder-side geometry reconstruction as an input step to project and compress\nthe attributes. In this work, we propose to learn joint compression of geometry\nand attributes using a single, adaptive autoencoder model, embedding both\nmodalities into a unified latent space which is then entropy encoded. Key to\nthe technique is to replace the search for trade-offs between rate, attribute\nquality and geometry quality, through conditioning the model on the desired\nqualities of both modalities, bypassing the need for training model ensembles.\nTo differentiate important point cloud regions during encoding or to allow\nview-dependent compression for user-centered streaming, conditioning is\npointwise, which allows for local quality and rate variation. Our evaluation\nshows comparable performance to state-of-the-art compression methods for\ngeometry and attributes, while reducing complexity compared to related\ncompression methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eXQ2tZTMMHzWFrNoZlu2Jx666lWgS2mDJMA34L46GJE","pdfSize":"4373492","txDigest":"AX3gY4c5mWGcggy794cujgbhs5NtbvbiXa2YHUGWhie2","endEpoch":"1","status":"CERTIFIED"}
