{"id":"2408.12010","title":"Confounding Privacy and Inverse Composition","authors":"Tao Zhang, Bradley A. Malin, Netanel Raviv, Yevgeniy Vorobeychik","authorsParsed":[["Zhang","Tao",""],["Malin","Bradley A.",""],["Raviv","Netanel",""],["Vorobeychik","Yevgeniy",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 21:45:13 GMT"}],"updateDate":"2024-08-23","timestamp":1724276713000,"abstract":"  We introduce a novel privacy notion of ($\\epsilon, \\delta$)-confounding\nprivacy that generalizes both differential privacy and Pufferfish privacy. In\ndifferential privacy, sensitive information is contained in the dataset while\nin Pufferfish privacy, sensitive information determines data distribution.\nConsequently, both assume a chain-rule relationship between the sensitive\ninformation and the output of privacy mechanisms. Confounding privacy, in\ncontrast, considers general causal relationships between the dataset and\nsensitive information. One of the key properties of differential privacy is\nthat it can be easily composed over multiple interactions with the mechanism\nthat maps private data to publicly shared information. In contrast, we show\nthat the quantification of the privacy loss under the composition of\nindependent ($\\epsilon, \\delta$)-confounding private mechanisms using the\noptimal composition of differential privacy \\emph{underestimates} true privacy\nloss. To address this, we characterize an inverse composition framework to\ntightly implement a target global ($\\epsilon_{g}, \\delta_{g}$)-confounding\nprivacy under composition while keeping individual mechanisms independent and\nprivate. In particular, we propose a novel copula-perturbation method which\nensures that (1) each individual mechanism $i$ satisfies a target local\n($\\epsilon_{i}, \\delta_{i}$)-confounding privacy and (2) the target global\n($\\epsilon_{g}, \\delta_{g}$)-confounding privacy is tightly implemented by\nsolving an optimization problem. Finally, we study inverse composition\nempirically on real datasets.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"c5Jn8RovuwmjmWib00O6sixW6ze7qdfQfcrUI5MWtak","pdfSize":"692496"}
