{"id":"2408.09517","title":"Extreme Metallicity Dwarf Galaxies in IllustrisTNG","authors":"Timothy Carleton and Jacqueline Monkiewicz","authorsParsed":[["Carleton","Timothy",""],["Monkiewicz","Jacqueline",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 15:49:06 GMT"}],"updateDate":"2024-08-20","timestamp":1723996146000,"abstract":"  The use of extremely metal-deficient dwarf galaxies (XMDs) as nearby analogs\nfor high-redshift protogalaxies is generating renewed interest due to recent\nJWST observations studying these protogalaxies. However, the existence of a\npopulation of unenriched galaxies at $z\\sim0$ raises fundamental questions\nabout how galaxies with such pristine gas reservoirs could be formed. To\naddress these questions we study XMDs in the IllustrisTNG simulation. We find\nthat XMDs at $z=0$ are not relics of the first galaxies, but dwarf galaxies\nthat experience a dramatic $\\sim0.3$ dex drop in their gas-phase metallicity in\nthe past few Gyr. We investigate possible causes of this drop in metallicity\nincluding high gas fractions, outflow efficiency or inflow/outflow rates,\nunique environments, pristine inflow metallicity, and inflow/SFR interactions.\nOf these, we find that inflow/outflow interactions, parameterized by the\ncumulative regional SFR experienced by inflows, has the strongest correlation\nwith dwarf galaxy metallicity and XMD formation. In other words, inefficient\ngas enrichment during the short time between its accretion from the CGM and the\ninitiation of star formation is the most important cause of XMD formation in\nthe simulation. Observationally, we identify differences in star formation\nhistory between XMDs and non-XMDs (with XMDs having significantly decreased\nstar formation rates on $1-5$ Gyr timescales) and differences in galaxy size\n(with XMDs having a more extended young stellar population) as the primary\ndifferences between the two populations. These results highlight the importance\nof inflow enrichment efficiency as a possible driver of dwarf galaxy\nmetallicities.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}