{"id":"2408.13378","title":"DrugAgent: Explainable Drug Repurposing Agent with Large Language\n  Model-based Reasoning","authors":"Yoshitaka Inoue, Tianci Song, Tianfan Fu","authorsParsed":[["Inoue","Yoshitaka",""],["Song","Tianci",""],["Fu","Tianfan",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 21:24:59 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 16:06:37 GMT"},{"version":"v3","created":"Mon, 16 Sep 2024 22:13:30 GMT"}],"updateDate":"2024-09-18","timestamp":1724448299000,"abstract":"  Drug repurposing offers a promising avenue for accelerating drug development\nby identifying new therapeutic potentials of existing drugs. In this paper, we\npropose a multi-agent framework to enhance the drug repurposing process using\nstate-of-the-art machine learning techniques and knowledge integration. Our\nframework comprises several specialized agents: an AI Agent trains robust\ndrug-target interaction (DTI) models; a Knowledge Graph Agent utilizes the\ndrug-gene interaction database (DGIdb), DrugBank, Comparative Toxicogenomics\nDatabase (CTD), and Search Tool for Interactions of Chemicals (STITCH) to\nsystematically extract DTIs; and a Search Agent interacts with biomedical\nliterature to annotate and verify computational predictions. By integrating\noutputs from these agents, our system effectively harnesses diverse data\nsources, including external databases, to propose viable repurposing\ncandidates. Preliminary results demonstrate the potential of our approach in\nnot only predicting drug-disease interactions but also in reducing the time and\ncost associated with traditional drug discovery methods. This paper highlights\nthe scalability of multi-agent systems in biomedical research and their role in\ndriving innovation in drug repurposing. Our approach not only outperforms\nexisting methods in predicting drug repurposing potential but also provides\ninterpretable results, paving the way for more efficient and cost-effective\ndrug discovery processes.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ec9wfr2O_T-vSdbmkGHk7Vpe_CVo0Klm0ULx8j7T7Yc","pdfSize":"2653453"}
