{"id":"2408.15695","title":"G-Style: Stylized Gaussian Splatting","authors":"\\'Aron Samuel Kov\\'acs, Pedro Hermosilla, and Renata G. Raidou","authorsParsed":[["Kovács","Áron Samuel",""],["Hermosilla","Pedro",""],["Raidou","Renata G.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 10:43:42 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 09:05:39 GMT"}],"updateDate":"2024-09-06","timestamp":1724841822000,"abstract":"  We introduce G-Style, a novel algorithm designed to transfer the style of an\nimage onto a 3D scene represented using Gaussian Splatting. Gaussian Splatting\nis a powerful 3D representation for novel view synthesis, as -- compared to\nother approaches based on Neural Radiance Fields -- it provides fast scene\nrenderings and user control over the scene. Recent pre-prints have demonstrated\nthat the style of Gaussian Splatting scenes can be modified using an image\nexemplar. However, since the scene geometry remains fixed during the\nstylization process, current solutions fall short of producing satisfactory\nresults. Our algorithm aims to address these limitations by following a\nthree-step process: In a pre-processing step, we remove undesirable Gaussians\nwith large projection areas or highly elongated shapes. Subsequently, we\ncombine several losses carefully designed to preserve different scales of the\nstyle in the image, while maintaining as much as possible the integrity of the\noriginal scene content. During the stylization process and following the\noriginal design of Gaussian Splatting, we split Gaussians where additional\ndetail is necessary within our scene by tracking the gradient of the stylized\ncolor. Our experiments demonstrate that G-Style generates high-quality\nstylizations within just a few minutes, outperforming existing methods both\nqualitatively and quantitatively.\n","subjects":["Computing Research Repository/Graphics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}