{"id":"2408.04214","title":"Convolution Type of Metaplectic Cohen's Distribution Time-Frequency\n  Analysis Theory, Method and Technology","authors":"Manjun Cui, Zhichao Zhang, Jie Han, Yunjie Chen, Chunzheng Cao","authorsParsed":[["Cui","Manjun",""],["Zhang","Zhichao",""],["Han","Jie",""],["Chen","Yunjie",""],["Cao","Chunzheng",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 04:45:36 GMT"}],"updateDate":"2024-08-09","timestamp":1723092336000,"abstract":"  The conventional Cohen's distribution can't meet the requirement of additive\nnoises jamming signals high-performance denoising under the condition of low\nsignal-to-noise ratio, it is necessary to integrate the metaplectic transform\nfor non-stationary signal fractional domain time-frequency analysis. In this\npaper, we blend time-frequency operators and coordinate operator\nfractionizations to formulate the definition of the metaplectic Wigner\ndistribution, based on which we integrate the generalized metaplectic\nconvolution to address the unified representation issue of the convolution type\nof metaplectic Cohen's distribution (CMCD), whose special cases and essential\nproperties are also derived. We blend Wiener filter principle and fractional\ndomain filter mechanism of the metaplectic transform to design the\nleast-squares adaptive filter method in the metaplectic Wigner distribution\ndomain, giving birth to the least-squares adaptive filter-based CMCD whose\nkernel function can be adjusted with the input signal automatically to achieve\nthe minimum mean-square error (MSE) denoising in Wigner distribution domain. We\ndiscuss the optimal symplectic matrices selection strategy of the proposed\nadaptive CMCD through the minimum MSE minimization modeling and solving. Some\nexamples are also carried out to demonstrate that the proposed filtering method\noutperforms some state-of-the-arts including Wiener filter and fixed kernel\nfunctions-based or adaptive Cohen's distribution in noise suppression.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}