{"id":"2408.16854","title":"A Spintronic Nano-Antenna Activated by Spin Injection from a\n  Three-Dimensional Topological Insulator","authors":"Raisa Fabiha, Michael Suche, Erdem Topsakal, Patrick J. Taylor,\n  Supriyo Bandyopadhyay","authorsParsed":[["Fabiha","Raisa",""],["Suche","Michael",""],["Topsakal","Erdem",""],["Taylor","Patrick J.",""],["Bandyopadhyay","Supriyo",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:36:04 GMT"}],"updateDate":"2024-09-02","timestamp":1724956564000,"abstract":"  A charge current flowing through a three-dimensional topological insulator\n(3D-TI) can inject a spin current into a ferromagnet placed on the surface of\nthe 3D-TI. Here, we report leveraging this mechanism to implement a\nnano-antenna that radiates an electromagnetic wave (1-10 GHz) into the\nsurrounding medium efficiently despite being orders of magnitude smaller than\nthe radiated free space wavelength. An alternating charge current of 1-10 GHz\nfrequency is injected into a thin film of the 3D-TI Bi2Se3, resulting in the\ninjection of an alternating spin current (of the same frequency) into a\nperiodic array of cobalt nanomagnets deposited on the surface of the 3D-TI.\nThis causes the magnetizations of the nanomagnets to oscillate in time and\nradiate electromagnetic waves in space, thereby implementing a nano-antenna.\nBecause it is so much smaller than the free space wavelength, the nano-antenna\nis effectively a \"point source\" and yet it radiates anisotropically because of\ninternal anisotropy. One can change the anisotropic radiation pattern by\nchanging the direction of the injected alternating charge current, which\nimplements beam steering. This would normally not have been possible in a\nconventional extreme sub-wavelength antenna.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oE2j2buceXO0P9zJOZJwKf0GzwtCqMn4lKyIk7SMAd8","pdfSize":"15266490"}
