{"id":"2408.15127","title":"T-FAKE: Synthesizing Thermal Images for Facial Landmarking","authors":"Philipp Flotho (1), Moritz Piening (2), Anna Kukleva (3), Gabriele\n  Steidl (2) ((1) Systems Neuroscience & Neurotechnology Unit, Faculty of\n  Medicine, Saarland University & htw saar, (2) Institute of Mathematics,\n  Technische Universit\\\"at Berlin, (3) Max Planck Institute for Informatics,\n  Saarland Informatics Campus)","authorsParsed":[["Flotho","Philipp",""],["Piening","Moritz",""],["Kukleva","Anna",""],["Steidl","Gabriele",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 15:07:58 GMT"}],"updateDate":"2024-08-28","timestamp":1724771278000,"abstract":"  Facial analysis is a key component in a wide range of applications such as\nsecurity, autonomous driving, entertainment, and healthcare. Despite the\navailability of various facial RGB datasets, the thermal modality, which plays\na crucial role in life sciences, medicine, and biometrics, has been largely\noverlooked. To address this gap, we introduce the T-FAKE dataset, a new\nlarge-scale synthetic thermal dataset with sparse and dense landmarks. To\nfacilitate the creation of the dataset, we propose a novel RGB2Thermal loss\nfunction, which enables the transfer of thermal style to RGB faces. By\nutilizing the Wasserstein distance between thermal and RGB patches and the\nstatistical analysis of clinical temperature distributions on faces, we ensure\nthat the generated thermal images closely resemble real samples. Using\nRGB2Thermal style transfer based on our RGB2Thermal loss function, we create\nthe T-FAKE dataset, a large-scale synthetic thermal dataset of faces.\nLeveraging our novel T-FAKE dataset, probabilistic landmark prediction, and\nlabel adaptation networks, we demonstrate significant improvements in landmark\ndetection methods on thermal images across different landmark conventions. Our\nmodels show excellent performance with both sparse 70-point landmarks and dense\n478-point landmark annotations. Our code and models are available at\nhttps://github.com/phflot/tfake.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"-xSR-h8nZWbicJ-c9OW7e9oyeSbEe-Nc93oNnrhF-qM","pdfSize":"21253523"}
