{"id":"2408.09361","title":"Entropic Semi-Martingale Optimal Transport","authors":"Jean-David Benamou, Guillaume Chazareix, Marc Hoffmann, Gr\\'egoire\n  Loeper, Fran\\c{c}ois-Xavier Vialard","authorsParsed":[["Benamou","Jean-David",""],["Chazareix","Guillaume",""],["Hoffmann","Marc",""],["Loeper","Grégoire",""],["Vialard","François-Xavier",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 05:00:01 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 14:22:48 GMT"}],"updateDate":"2024-08-21","timestamp":1723957201000,"abstract":"  Entropic Optimal Transport (EOT), also referred to as the Schr\\\"odinger\nproblem, seeks to find a random processes with prescribed initial/final\nmarginals and with minimal relative entropy with respect to a reference\nmeasure. The relative entropy forces the two measures to share the same support\nand only the drift of the controlled process can be adjusted, the diffusion\nbeing imposed by the reference measure. Therefore, at first sight,\nSemi-Martingale Optimal Transport (SMOT) problems (see [1]) seem out of the\nscope of applications of Entropic regularization techniques, which are\notherwise very attractive from a computational point of view. However, when the\nprocess is observed only at discrete times, and become therefore a Markov\nchain, its relative entropy can remain finite even with variable diffusion\ncoefficients, and discrete semi-martingales can be obtained as solutions of\n(multi-marginal) EOT problems.Given a (smooth) semi-martingale, the limit of\nthe relative entropy of its time discretizations, scaled by the time step\nconverges to the so-called ``specific relative entropy'', a convex functional\nof its variance process, similar to those used in SMOT.In this paper we use\nthis observation to build an entropic time discretization of continuous SMOT\nproblems. This allows to compute discrete approximations of solutions to\ncontinuous SMOT problems by a multi-marginal Sinkhorn algorithm, without the\nneed of solving the non-linear Hamilton-Jacobi-Bellman pde's associated to the\ndual problem, as done for example in [1, 2]. We prove a convergence result of\nthe time discrete entropic problem to the continuous time problem, we propose\nan implementation and provide numerical experiments supporting the theoretical\nconvergence.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"A0A6Sw9QQaW6L6vAzgO2oG8AwcdljewdfDa6L2feo-Q","pdfSize":"4240489"}
