{"id":"2408.16109","title":"A nudge to the truth: atom conservation as a hard constraint in models\n  of atmospheric composition using an uncertainty-weighted correction","authors":"Patrick Obin Sturm and Sam J. Silva","authorsParsed":[["Sturm","Patrick Obin",""],["Silva","Sam J.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 19:32:28 GMT"}],"updateDate":"2024-08-30","timestamp":1724873548000,"abstract":"  Computational models of atmospheric composition are not always physically\nconsistent. For example, not all models respect fundamental conservation laws\nsuch as conservation of atoms in an interconnected chemical system. In well\nperforming models, these nonphysical deviations are often ignored because they\nare frequently minor, and thus only need a small nudge to perfectly conserve\nmass. Here we introduce a method that anchors a prediction from any numerical\nmodel to physically consistent hard constraints, nudging concentrations to the\nnearest solution that respects the conservation laws. This closed-form\nmodel-agnostic correction uses a single matrix operation to minimally perturb\nthe predicted concentrations to ensure that atoms are conserved to machine\nprecision. To demonstrate this approach, we train a gradient boosting decision\ntree ensemble to emulate a small reference model of ozone photochemistry and\ntest the effect of the correction on accurate but non-conservative predictions.\nThe nudging approach minimally perturbs the already well-predicted results for\nmost species, but decreases the accuracy of important oxidants, including\nradicals. We develop a weighted extension of this nudging approach that\nconsiders the uncertainty and magnitude of each species in the correction. This\nspecies-level weighting approach is essential to accurately predict important\nlow concentration species such as radicals. We find that applying the\nuncertainty-weighted correction to the nonphysical predictions slightly\nimproves overall accuracy, by nudging the predictions to a more likely\nmass-conserving solution.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}