{"id":"2408.00571","title":"Evaluation of Performance Measures for Qualifying Flood Models with\n  Satellite Observations","authors":"Jean-Paul Travert, S\\'ebastien Boyaval, C\\'edric Goeury, Vito Bacchi,\n  Fabrice Zaoui","authorsParsed":[["Travert","Jean-Paul",""],["Boyaval","Sébastien",""],["Goeury","Cédric",""],["Bacchi","Vito",""],["Zaoui","Fabrice",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 14:05:05 GMT"}],"updateDate":"2024-08-05","timestamp":1722521105000,"abstract":"  This work discusses how to choose performance measures to compare numerical\nsimulations of a flood event with one satellite image, e.g., in a model\ncalibration or validation procedure. A series of criterion are proposed to\nevaluate the sensitivity of performance measures with respect to the flood\nextent, satellite characteristics (position, orientation), and\nmeasurements/processing errors (satellite raw values or extraction of the flood\nmaps). Their relevance is discussed numerically in the case of one flooding\nevent (on the Garonne River in France in February 2021), using a distribution\nof water depths simulated from a shallow-water model parameterized by an\nuncertain friction field. After identifying the performance measures respecting\nthe most criteria, a correlation analysis is carried out to identify how\nvarious performance measures are similar. Then, a methodology is proposed to\nrank performance measures and select the most robust to observation errors. The\nmethodology is shown useful at identifying four performance measures out of 28\nin the study case. Note that the various top-ranked performance measures do not\nlead to the same calibration result as regards the friction field of the\nshallow-water model. The methodology can be applied to the comparison of any\nflood model with any flood event.\n","subjects":["Physics/Geophysics","Computing Research Repository/Computational Engineering, Finance, and Science","Physics/Data Analysis, Statistics and Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}