{"id":"2408.09888","title":"Forecasting Attacker Actions using Alert-driven Attack Graphs","authors":"Ion B\\u{a}b\\u{a}l\\u{a}u, Azqa Nadeem","authorsParsed":[["Băbălău","Ion",""],["Nadeem","Azqa",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 11:04:47 GMT"}],"updateDate":"2024-08-20","timestamp":1724065487000,"abstract":"  While intrusion detection systems form the first line-of-defense against\ncyberattacks, they often generate an overwhelming volume of alerts, leading to\nalert fatigue among security operations center (SOC) analysts. Alert-driven\nattack graphs (AGs) have been developed to reduce alert fatigue by\nautomatically discovering attack paths in intrusion alerts. However, they only\nwork in offline settings and cannot prioritize critical attack paths. This\npaper builds an action forecasting capability on top of the existing\nalert-driven AG framework for predicting the next likely attacker action given\na sequence of observed actions, thus enabling analysts to prioritize\nnon-trivial attack paths. We also modify the framework to build AGs in real\ntime, as new alerts are triggered. This way, we convert alert-driven AGs into\nan early warning system that enables analysts to circumvent ongoing attacks and\nbreak the cyber killchain. We propose an expectation maximization approach to\nforecast future actions in a reversed suffix-based probabilistic deterministic\nfinite automaton (rSPDFA). By utilizing three real-world intrusion and endpoint\nalert datasets, we empirically demonstrate that the best performing rSPDFA\nachieves an average top-3 accuracy of 67.27%, which reflects a 57.17%\nimprovement over three baselines, on average. We also invite six SOC analysts\nto use the evolving AGs in two scenarios. Their responses suggest that the\naction forecasts help them prioritize critical incidents, while the evolving\nAGs enable them to choose countermeasures in real-time.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}