{"id":"2408.08667","title":"Improving Gaussian channel simulation using non-unity gain heralded\n  quantum teleportation","authors":"Biveen Shajilal, Lorc\\'an O. Conlon, Angus Walsh, Spyros Tserkis, Jie\n  Zhao, Jiri Janousek, Syed Assad, and Ping Koy Lam","authorsParsed":[["Shajilal","Biveen",""],["Conlon","Lorcán O.",""],["Walsh","Angus",""],["Tserkis","Spyros",""],["Zhao","Jie",""],["Janousek","Jiri",""],["Assad","Syed",""],["Lam","Ping Koy",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 11:19:51 GMT"}],"updateDate":"2024-08-19","timestamp":1723807191000,"abstract":"  Gaussian channel simulation is an essential paradigm in understanding the\nevolution of bosonic quantum states. It allows us to investigate how such\nstates are influenced by the environment and how they transmit quantum\ninformation. This makes it an essential tool for understanding the properties\nof Gaussian quantum communication. Quantum teleportation provides an avenue to\neffectively simulate Gaussian channels such as amplifier channels, loss\nchannels and classically additive noise channels. However, implementations of\nthese channels, particularly quantum amplifier channels and channels capable of\nperforming Gaussian noise suppression are limited by experimental imperfections\nand non-ideal entanglement resources. In this work, we overcome these\ndifficulties using a heralded quantum teleportation scheme that is empowered by\na measurement-based noiseless linear amplifier. The noiseless linear\namplification enables us to simulate a range of Gaussian channels that were\npreviously inaccessible. In particular, we demonstrate the simulation of\nnon-physical Gaussian channels otherwise inaccessible using conventional means.\nWe report Gaussian noise suppression, effectively converting an imperfect\nquantum channel into a near-identity channel. The performance of Gaussian noise\nsuppression is quantified by calculating the transmitted entanglement.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}