{"id":"2408.15547","title":"Redshift evolution of the X-ray and UV luminosity relation of quasars:\n  calibrated results from SNe Ia","authors":"Xiaolei Li, Ryan E. Keeley and Arman Shafieloo","authorsParsed":[["Li","Xiaolei",""],["Keeley","Ryan E.",""],["Shafieloo","Arman",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 05:48:35 GMT"}],"updateDate":"2024-08-29","timestamp":1724824115000,"abstract":"  Quasars could serve as standard candles if the relation between their\nultraviolet and X-ray luminosities can be accurately calibrated. Previously, we\ndeveloped a model-independent method to calibrate quasar standard candles using\nthe distances-redshift relation reconstructed from Type Ia supernova at z<2\nusing Gaussian process regression. Interestingly, we found that the calibrated\nquasar standard candle dataset preferred a deviation from $\\Lambda$CDM at\nredshifts above z>2. One interpretation of these findings is that the\ncalibration parameters of the quasar UV-X-ray luminosity relationship evolves\nwith redshift. In order to test the redshift dependence of the quasar\ncalibration in a model-independent manner, we divided the quasar sample whose\nredshift overlap with the redshift coverage of Pantheon+ Type Ia supernova\ncompilation into two sub-samples: a low-redshift quasar sub-sample and a\nhigh-redshift quasar sub-sample. Our present results show that there is about a\n4$\\sigma$ inconsistency between the quasar parameters inferred from the\nhigh-redshift quasar sub-sample and from the low-redshift sub-sample if no\nevolution of the quasar relation is considered. This inconsistency suggests the\nnecessity of considering redshift evolution for the relationship between the\nquasars$'$ ultraviolet and X-ray luminosities. We then test an explicit\nparametrization of the redshift evolution of the quasar calibration parameters\nvia $\\gamma(z) = \\gamma_0+\\gamma_1(1+z)$ and $\\beta(z)=\\beta_0+\\beta_1(1+z)$.\nCombining this redshift-dependent calibration relationship with the\ndistance-redshift relationship reconstructed from Pantheon+ supernova\ncompilation, we find the high-redshift sub-sample and low-redshift sub-sample\nbecome consistent at the 1$\\sigma$ level, which means that the parameterized\nform of $\\gamma(z)$ and $\\beta(z)$ works well at describing the evolution of\nthe quasar calibration parameters.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}