{"id":"2408.09265","title":"ByCAN: Reverse Engineering Controller Area Network (CAN) Messages from\n  Bit to Byte Level","authors":"Xiaojie Lin, Baihe Ma, Xu Wang, Guangsheng Yu, Ying He, Ren Ping Liu,\n  Wei Ni","authorsParsed":[["Lin","Xiaojie",""],["Ma","Baihe",""],["Wang","Xu",""],["Yu","Guangsheng",""],["He","Ying",""],["Liu","Ren Ping",""],["Ni","Wei",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 18:10:15 GMT"}],"updateDate":"2024-08-20","timestamp":1723918215000,"abstract":"  As the primary standard protocol for modern cars, the Controller Area Network\n(CAN) is a critical research target for automotive cybersecurity threats and\nautonomous applications. As the decoding specification of CAN is a proprietary\nblack-box maintained by Original Equipment Manufacturers (OEMs), conducting\nrelated research and industry developments can be challenging without a\ncomprehensive understanding of the meaning of CAN messages. In this paper, we\npropose a fully automated reverse-engineering system, named ByCAN, to reverse\nengineer CAN messages. ByCAN outperforms existing research by introducing\nbyte-level clusters and integrating multiple features at both byte and bit\nlevels. ByCAN employs the clustering and template matching algorithms to\nautomatically decode the specifications of CAN frames without the need for\nprior knowledge. Experimental results demonstrate that ByCAN achieves high\naccuracy in slicing and labeling performance, i.e., the identification of CAN\nsignal boundaries and labels. In the experiments, ByCAN achieves slicing\naccuracy of 80.21%, slicing coverage of 95.21%, and labeling accuracy of 68.72%\nfor general labels when analyzing the real-world CAN frames.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning","Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"o4ufVY5JmyrIn5Q224lzkRCc33ZUxDB1VjaSTYfHimc","pdfSize":"11303472"}
