{"id":"2408.06287","title":"Infant Type Ia Supernovae from the KMTNet I. Multi-Color Evolution and\n  Populations","authors":"Yuan Qi Ni, Dae-Sik Moon, Maria R. Drout, Youngdae Lee, Patrick\n  Sandoval, Jeehye Shin, Hong Soo Park, Sang Chul Kim, Kyuseok Oh","authorsParsed":[["Ni","Yuan Qi",""],["Moon","Dae-Sik",""],["Drout","Maria R.",""],["Lee","Youngdae",""],["Sandoval","Patrick",""],["Shin","Jeehye",""],["Park","Hong Soo",""],["Kim","Sang Chul",""],["Oh","Kyuseok",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 16:49:54 GMT"}],"updateDate":"2024-08-13","timestamp":1723481394000,"abstract":"  We conduct a systematic analysis of the early multi-band light curves and\ncolors of 19 Type Ia Supernovae (SNe) from the Korea Microlensing Telescope\nNetwork SN Program, including 16 previously unpublished events. Seven are\ndetected $\\lesssim$ 1 day since the estimated epoch of first light and the rest\nwithin $\\lesssim$ 3 days. Some show excess emission within $<$ 0.5 days to\n$\\sim$ 2 days, but most show pure power-law rises. The colors are initially\ndiverse before $\\sim$ 5 days, but converge to a similar color at $\\sim$ 10\ndays. We identify at least three populations based on 2--5-day color evolution:\n(1) \"early-blues\" exhibit slowly-evolving colors consistent with a $\\sim$\n17,000 K blackbody; (2) \"early-reds\" have initially blue $B-V$ and red $V-i$\ncolors that cannot simultaneously be fit with a blackbody -- likely due to\nsuppression of $B$- and $i$-band flux by Fe II/III and Ca II -- and evolve more\nrapidly; and (3) \"early-yellows\" evolve blueward, consistent with thermal\nheating from $\\sim$ 8,000 to 13,000 K. The distributions of early-blue and\nearly-red colors are compatible with them being either distinct populations --\nwith early-reds comprising (60 $\\pm$ 15)% of them -- or extreme ends of one\ncontinuous population; whereas the early-yellow population identified here is\nclearly distinct. Compared to the other populations, early-blues in our sample\ndiffer by exhibiting excess emission within 1--2 days, nearly constant peak\nbrightness regardless of $\\Delta M_{15}(B)$ after standardization, and\nshallower Si II features. Early-blues also prefer star-forming host\nenvironments, while early-yellows and, to a lesser extent, early-reds prefer\nquiescent ones. These preferences appear to indicate at least two Type Ia SN\nproduction channels based on stellar population age, while early-reds and\nearly-blues may still share a common origin.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}