{"id":"2408.06404","title":"Analysis of optical spectroscopy and photometry of the type I X-ray\n  bursting system UW CrB","authors":"M. R. Kennedy, P. Callanan, P. M. Garnavich, R. P. Breton, A. J.\n  Brown, N. Castro Segura, V. S. Dhillon, M. J. Dyer, J. Garbutt, M. J. Green,\n  P. Hakala, F. Jiminez-Ibarra, P. Kerry, S. Fijma, S. Littlefair, J. Munday,\n  P. A. Mason, D. Mata-Sanchez, T. Munoz-Darias, S. Parsons, I. Pelisoli, and\n  D. Sahman","authorsParsed":[["Kennedy","M. R.",""],["Callanan","P.",""],["Garnavich","P. M.",""],["Breton","R. P.",""],["Brown","A. J.",""],["Segura","N. Castro",""],["Dhillon","V. S.",""],["Dyer","M. J.",""],["Garbutt","J.",""],["Green","M. J.",""],["Hakala","P.",""],["Jiminez-Ibarra","F.",""],["Kerry","P.",""],["Fijma","S.",""],["Littlefair","S.",""],["Munday","J.",""],["Mason","P. A.",""],["Mata-Sanchez","D.",""],["Munoz-Darias","T.",""],["Parsons","S.",""],["Pelisoli","I.",""],["Sahman","D.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 14:12:58 GMT"}],"updateDate":"2024-08-14","timestamp":1723471978000,"abstract":"  UW Coronae Borealis (UW CrB) is a low mass X-ray binary that shows both Type\n1 X-ray and optical bursts, which typically last for 20 s. The system has a\nbinary period of close to 2 hours and is thought to have a relatively high\ninclination due to the presence of an eclipse in the optical light curve. There\nis also evidence that an asymmetric disc is present in the system, which\nprecesses every 5.5 days based on changes in the depth of the eclipse. In this\npaper, we present optical photometry and spectroscopy of UW CrB taken over 2\nyears. We update the orbital ephemeris using observed optical eclipses and\nrefine the orbital period to 110.97680(1) min. A total of 17 new optical bursts\nare presented, with 10 of these bursts being resolved temporally. The average\n$e$-folding time of $19\\pm3$s for the bursts is consistent with the previously\nfound value. Optical bursts are observed during a previously identified gap in\norbital phase centred on $\\phi=0.967$, meaning the reprocessing site is not\neclipsed as previously thought. Finally, we find that the apparent P-Cygni\nprofiles present in some of the atomic lines in the optical spectra are due to\ntransient absorption.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}