{"id":"2408.14351","title":"Can supernova from runaway stars mimic the signs of absorbing\n  `super-virial' gas?","authors":"Mukesh Singh Bisht (1), Projjwal Banerjee (2), Biman B. Nath (1), Yuri\n  Shchekinov (1) ((1) Raman Research Institute, Bengaluru - 560080, India, (2)\n  Department of Physics, Indian Institute of Technology Palakkad, Kerala,\n  India)","authorsParsed":[["Bisht","Mukesh Singh",""],["Banerjee","Projjwal",""],["Nath","Biman B.",""],["Shchekinov","Yuri",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 15:29:09 GMT"}],"updateDate":"2024-08-27","timestamp":1724686149000,"abstract":"  The recent detection of large column density absorption lines from highly\nionized gas in a few directions through the circumgalactic medium (CGM) of the\nMilky Way (MW) has been puzzling. The inferred temperature from these\nabsorption lines far exceeds the virial temperature of the MW, and the column\ndensities are also too large to be easily explained. In this paper, we propose\na novel idea to explain these observations and claim that they may not have\noriginated from the CGM, but from a totally different type of source, namely,\nstellar ejecta from supernovae (SNe) above the Galactic disk that happen to lie\nin the line of sight to the background quasars. About $\\sim 20\\%$ of massive OB\nstars (progenitors of core-collapse supernovae) are known to be runaway stars\nthat have high ejection velocities near the Galactic plane and can end up\nexploding as SNe above the Galactic disk. We show that the associated reverse\nshock in the supernova remnant in the early non-radiative phase can heat the\nejecta to temperatures of $\\gtrsim 10^7\\,{\\rm K}$ and can naturally explain the\nobserved high column density of ions in the observed `super-virial' phase along\nwith $\\alpha$-enriched super-solar abundance that is typical of core-collapse\nsupernovae. However, SNe from runaway stars has a covering fraction of\n$\\lesssim 0.7 \\%$ and thus can only explain the observations along limited\nsightlines.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"I6UDpsoUmOeQiI6GfFJywEp9lwBGR3HM6GSAd2S_rAc","pdfSize":"1528568"}
