{"id":"2408.02847","title":"Intertwined Superconductivity and Magnetism from Repulsive Interactions\n  in Kondo Bilayers","authors":"Clara S. Weber, Dominik Kiese, Dante M. Kennes, and Martin Claassen","authorsParsed":[["Weber","Clara S.",""],["Kiese","Dominik",""],["Kennes","Dante M.",""],["Claassen","Martin",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 22:10:19 GMT"}],"updateDate":"2024-08-07","timestamp":1722895819000,"abstract":"  While superconductors are conventionally established by attractive\ninteractions, higher-temperature mechanisms for emergent electronic pairing\nfrom strong repulsive electron-electron interactions remain under considerable\nscrutiny. Here, we establish a strong-coupling mechanism for intertwined\nsuperconductivity and magnetic order from purely repulsive interactions in a\nKondo-like bilayer system, composed of a two-dimensional Mott insulator coupled\nto a layer of weakly-interacting itinerant electrons. Combining large scale\nDMRG and Monte Carlo simulations, we find that superconductivity persists and\ncoexists with magnetism over a wide range of interlayer couplings. We classify\nthe resulting rich phase diagram and find 2-rung antiferromagnetic and 4-rung\nantiferromagnetic order in one-dimensional systems along with a phase\nseparation regime, while finding that superconductivity coexists with either\nantiferromagnetic or ferromagnetic order in two dimensions. Remarkably, the\nmodel permits a rigorous strong-coupling analysis via localized spins coupled\nto charge-2e bosons through Kugel-Khomskii interactions, capturing the pairing\nmechanism in the presence of magnetism due to emergent attractive interactions.\nOur numerical analysis reveals that pairing remains robust well beyond the\nstrong-coupling regime, establishing a new mechanism for superconductivity in\ncoupled weakly- and strongly-interacting electron systems, relevant for\ninfinite-layer nickelates and superconductivity in moire multilayer\nheterostructures.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/"}