{"id":"2408.05263","title":"The average stellar population age and metallicity of\n  intermediate-redshift quiescent galaxies","authors":"Ivana Damjanov (Department of Astronomy and Physics, Saint Mary's\n  University, Canada), Margaret J. Geller (Center for Astrophysics, Harvard &\n  Smithsonian, USA), and Jubee Sohn (Astronomy Program, Department of Physics\n  and Astronomy, Seoul National University, Republic of Korea)","authorsParsed":[["Damjanov","Ivana","","Department of Astronomy and Physics, Saint Mary's\n  University, Canada"],["Geller","Margaret J.","","Center for Astrophysics, Harvard &\n  Smithsonian, USA"],["Sohn","Jubee","","Astronomy Program, Department of Physics\n  and Astronomy, Seoul National University, Republic of Korea"]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-13","timestamp":1723226400000,"abstract":"  The HectoMAP spectroscopic survey provides a unique mass-limited sample of\nmore than 35,000 quiescent galaxies ($D_n4000>1.5$) covering the redshift range\n$0.2<z<0.6$. We segregate galaxies in bins of properties based on stellar mass,\n$D_n4000$, and redshift to construct a set of high signal-to-noise spectra\nrepresenting massive ($M_\\ast>10^{10}\\,M_\\odot$) quiescent population at\nintermediate redshift. These high-quality summed spectra enable full spectrum\nfitting and the related extraction of the average stellar population age and\nmetallicity. The average galaxy age increases with the central D$_n4000$ as\nexpected. The correlation is essentially invariant with stellar mass; thus\n$D_n4000$ is a robust proxy for quiescent galaxy stellar population age.\nHectoMAP provides the first quiescent sample at intermediate redshift\ncomparable with $z\\sim0$ mass-complete datasets. Scaling relations derived from\nthe HectoMAP summed spectra connect stellar age and metallicity with quiescent\ngalaxy stellar mass up to $z\\sim0.5$. Anti-correlation between the equivalent\nwidth of the [O II] emission line and stellar age, together with the mild\nincrease in stellar age with stellar mass, supports a broad range of timescales\nfor the mass assembly of intermediate-redshift quiescent systems. On average,\nthe most massive galaxies ($M_\\ast>10^{11}\\, M_\\odot$) assemble the bulk of\ntheir stars at earlier epochs. A strong increase in the average stellar\nmetallicity with stellar mass, along with the correlation between the [O II]\nequivalent width and metallicity at $0.2<z<0.4$, suggests that lower-mass\ngalaxies are more likely to have recent star formation episodes; related\nfeedback from massive stars affects the chemical enrichment of these galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WvHeXmTFac2Cq6vHI6aDsZq5ZdQnHXH66a0XfY6PoOE","pdfSize":"4194418"}
