{"id":"2408.04857","title":"Where Have All the Sulfur Atoms Gone? Polycyclic Aromatic Hydrocarbon as\n  a Possible Sink for the Missing Sulfur in the Interstellar Medium. I. The\n  C--S Band Strengths","authors":"X.J. Yang, Lijun Hua, Aigen Li","authorsParsed":[["Yang","X. J.",""],["Hua","Lijun",""],["Li","Aigen",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 04:27:52 GMT"}],"updateDate":"2024-08-12","timestamp":1723177672000,"abstract":"  Despite its biogeneic and astrochemical importance, sulfur (S), the 10th most\nabundant element in the interstellar medium (ISM) with a total abundance of\nS/H~2.2E-5, largely remains undetected in molecular clouds. Even in the diffuse\nISM where S was previously often believed to be fully in the gas phase, in\nrecent years observational evidence has suggested that S may also be\nappreciably depleted from the gas. What might be the dominant S reservoir in\nthe ISM remains unknown. Solid sulfides like MgS, FeS and SiS_2 are excluded as\na major S reservoir due to the undetection of their expected infrared spectral\nbands in the ISM. In this work, we explore the potential role of sulfurated\npolycyclic aromatic hydrocarbon (PAH) molecules -- PAHs with sulfur\nheterocycles (PASHs) -- as a sink for the missing S. Utilizing density function\ntheory, we compute the vibrational spectra of 18 representative PASH molecules.\nIt is found that these molecules exhibit a prominent, C--S stretching band at\n~10 micron and two relatively weak, C--S deformation bands at 15 and 25 micron\nthat are not mixed with the nominal PAH bands at 6.2, 7.7, 8.6, 11.3 and 12.7\nmicron If several parts per million of S (relative to H) are locked up in PAHs,\nthe 10 micron C--S band would be detectable by Spitzer and JWST. To\nquantitatively explore the amount of S/H depleted in PASHs, detailed comparison\nof the infrared emission spectra of PASHs with the Spitzer and JWST\nobservations is needed.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PvD3p7zuLX7jt5m741ziQbOo_lky0afHyavcpuX0RVA","pdfSize":"1506661"}
