{"id":"2408.14378","title":"User-Access Point Association for High Density MIMO Wireless LANs","authors":"Phillip B. Oni and Steven D. Blostein","authorsParsed":[["Oni","Phillip B.",""],["Blostein","Steven D.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 16:00:05 GMT"}],"updateDate":"2024-08-27","timestamp":1724688005000,"abstract":"  Wireless local area network (WLAN) access points (APs) are being deployed in\nhigh density to improve coverage and throughput. The emerging multiple-input\nmultiple-output (MIMO) implementation for uplink (UL) transmissions promises\nhigh per-user throughput and improved aggregate network throughput. However,\nthe high throughput potential of dense UL-MIMO WLAN is impaired by multiple\naccess channel interference and high contention among densely distributed user\nstations (STAs). We investigate the problem of actualizing the throughput\npotential of UL-MIMO in high density WLANs via user-AP association. Since\nuser-AP association influences interference and STA contention, a method to\noptimally distribute STAs among APs is proposed to maximize aggregate users'\nthroughput utility. This problem is transformed into a graph matching problem\nwith the throughput utility function as the graph edge weights. The graph\nmatching problem is solved as a combinatorial problem using a modified\nclassical Kuhn-Munkres algorithm. A dynamic implementation of the proposed\nalgorithm is used to periodically update user-AP associations when there are\nchanges in the network due to new entrants and/or user mobility. Simulated\ndense UL-MIMO WLAN scenarios reveal that the proposed scheme achieves an\naverage of $36.9 \\%$, $33.5 \\%$, $20.4 \\%$ and $11.3 \\%$ gains over the default\nstrongest signal first (SSF) association scheme used in conventional WLAN,\nGreedy [14], SmartAssoc [13] and best performance first (BPF) [5] algorithms,\nrespectively.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Networking and Internet Architecture","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}