{"id":"2408.04163","title":"Academic collaboration on large language model studies increases overall\n  but varies across disciplines","authors":"Lingyao Li, Ly Dinh, Songhua Hu, Libby Hemphill","authorsParsed":[["Li","Lingyao",""],["Dinh","Ly",""],["Hu","Songhua",""],["Hemphill","Libby",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 02:08:59 GMT"}],"updateDate":"2024-08-09","timestamp":1723082939000,"abstract":"  Interdisciplinary collaboration is crucial for addressing complex scientific\nchallenges. Recent advancements in large language models (LLMs) have shown\nsignificant potential in benefiting researchers across various fields. To\nexplore the application of LLMs in scientific disciplines and their\nimplications for interdisciplinary collaboration, we collect and analyze 50,391\npapers from OpenAlex, an open-source platform for scholarly metadata. We first\nemploy Shannon entropy to assess the diversity of collaboration in terms of\nauthors' institutions and departments. Our results reveal that most fields have\nexhibited varying degrees of increased entropy following the release of\nChatGPT, with Computer Science displaying a consistent increase. Other fields\nsuch as Social Science, Decision Science, Psychology, Engineering, Health\nProfessions, and Business, Management & Accounting have shown minor to\nsignificant increases in entropy in 2024 compared to 2023. Statistical testing\nfurther indicates that the entropy in Computer Science, Decision Science, and\nEngineering is significantly lower than that in health-related fields like\nMedicine and Biochemistry, Genetics & Molecular Biology. In addition, our\nnetwork analysis based on authors' affiliation information highlights the\nprominence of Computer Science, Medicine, and other Computer Science-related\ndepartments in LLM research. Regarding authors' institutions, our analysis\nreveals that entities such as Stanford University, Harvard University,\nUniversity College London, and Google are key players, either dominating\ncentrality measures or playing crucial roles in connecting research networks.\nOverall, this study provides valuable insights into the current landscape and\nevolving dynamics of collaboration networks in LLM research.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-3Id8XT1EC07RyHZTN6cjFpMTxJqB2dF2vBZg0V2gTU","pdfSize":"7814622"}
