{"id":"2408.07422","title":"LLMI3D: Empowering LLM with 3D Perception from a Single 2D Image","authors":"Fan Yang, Sicheng Zhao, Yanhao Zhang, Haoxiang Chen, Hui Chen, Wenbo\n  Tang, Haonan Lu, Pengfei Xu, Zhenyu Yang, Jungong Han, Guiguang Ding","authorsParsed":[["Yang","Fan",""],["Zhao","Sicheng",""],["Zhang","Yanhao",""],["Chen","Haoxiang",""],["Chen","Hui",""],["Tang","Wenbo",""],["Lu","Haonan",""],["Xu","Pengfei",""],["Yang","Zhenyu",""],["Han","Jungong",""],["Ding","Guiguang",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 10:00:16 GMT"}],"updateDate":"2024-08-15","timestamp":1723629616000,"abstract":"  Recent advancements in autonomous driving, augmented reality, robotics, and\nembodied intelligence have necessitated 3D perception algorithms. However,\ncurrent 3D perception methods, particularly small models, struggle with\nprocessing logical reasoning, question-answering, and handling open scenario\ncategories. On the other hand, generative multimodal large language models\n(MLLMs) excel in general capacity but underperform in 3D tasks, due to weak\nspatial and local object perception, poor text-based geometric numerical\noutput, and inability to handle camera focal variations. To address these\nchallenges, we propose the following solutions: Spatial-Enhanced Local Feature\nMining for better spatial feature extraction, 3D Query Token-Derived Info\nDecoding for precise geometric regression, and Geometry Projection-Based 3D\nReasoning for handling camera focal length variations. We employ\nparameter-efficient fine-tuning for a pre-trained MLLM and develop LLMI3D, a\npowerful 3D perception MLLM. Additionally, we have constructed the IG3D\ndataset, which provides fine-grained descriptions and question-answer\nannotations. Extensive experiments demonstrate that our LLMI3D achieves\nstate-of-the-art performance, significantly outperforming existing methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}