{"id":"2408.12026","title":"Average energy of the X-ray spectrum as a model-independent proxy for\n  the mass of galaxy clusters","authors":"A. Kruglov, I. Khabibullin, N. Lyskova, K. Dolag, V. Biffi","authorsParsed":[["Kruglov","A.",""],["Khabibullin","I.",""],["Lyskova","N.",""],["Dolag","K.",""],["Biffi","V.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 22:35:39 GMT"}],"updateDate":"2024-08-23","timestamp":1724279739000,"abstract":"  Temperature of the hot gas in galaxy clusters is known to be a reliable proxy\nfor the their total gravitating mass, allowing one to use spectroscopic X-ray\nobservations for halo mass function measurements. Data of shallow wide area\nsurveys, however, often precludes direct fitting of the X-ray spectra, given\npossible biases arising due to unresolved (multitemperature) inner structure of\nthe intracluster medium (ICM), projection effects and necessity of certain\nmodel assumptions to be made to allow for robust spectral fitting. We consider\nusing a simple observable value - the average energy of the observed cluster\nX-ray spectrum - as a model-independent proxy for the ICM temperature, and\nconsequently cluster's mass. We calibrate relation of this proxy to the cluster\nparameters using mock obsesrvations for a sample of 84 massive galaxy clusters\nextracted from the Magneticum cosmological hydro simulations. We consider\nobservational parameters corresponding to the all-sky survey observations by\nSRG/eROSITA. Taking into account contributions of various background and\nforeground signals, average energy of the simulated X-ray spectra in the\n$0.4-7.0$ keV band is shown to be a stable indicator of the ICM temperature\nwith $\\sim10\\%$ scatter and cluster's mass $M_{500}$ with a $\\sim 20\\%$\nscatter. A database containing simulated X-ray images and their spectra\n(subtracted in several concentric rings) is publicly available.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}