{"id":"2408.06749","title":"Multiscale Excitations in the Diluted Two-dimensional S = 1/2 Heisenberg\n  Antiferromagnet","authors":"Liuyun Dao, Hui Shao, and Anders W. Sandvik","authorsParsed":[["Dao","Liuyun",""],["Shao","Hui",""],["Sandvik","Anders W.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 09:16:08 GMT"}],"updateDate":"2024-08-14","timestamp":1723540568000,"abstract":"  We study the excitation spectrum of the $S=1/2$ Heisenberg model on the\nrandomly diluted square lattice by analytic continuation of QMC data. At\ndilution fractions $p=1/16$ and $p=1/8$, the dynamic structure factor $S({\\bf\nq},\\omega)$ exhibits a damped magnon peak with anomalous dispersion near ${\\bf\nq}=(0,0)$ and $(\\pi,\\pi)$, a non-dispersive low-energy localization peak, and a\nsecond dispersive peak between these two features. A magnon with anomalous\ndispersion, close to our result, was predicted in spin wave and $T$-matrix\ntheory [A. Chernyshev et al., PRB {\\bf 65}, 104407 (2002)], above the\nlocalization energy. However, no intermediate dispersive mode was predicted.\nAnalyzing spectral functions in real space for individual vacancy realizations\nby energy tomography, we find that these excitations are concentrated on a\nsmall subset of the spins adjacent to vacancies. We argue that the low-energy\nexcitations are those of a sparse random network of effective moments at a\nfraction of the vacancies. There is a shift in magnon spectral weight\ndistribution, from the spins away from vacancies at high energy to those\nadjacent to vacancies at lower energy. We also analyze the Anderson quantum\nrotor excitation at $\\omega \\propto N^{-1}$ (with $N=L^2$ the system size),\nwhich in the clean system is visible in $S({\\bf q},\\omega)$ only at ${\\bf\nq}=(\\pi,\\pi)$ but spreads through the Brillouin zone when $p>0$. Weight close\nto ${\\bf q}=(0,0)$ and $(\\pi,\\pi)$ is explained by local sublattice imbalance\nwithin a dimer-monomer model but there is also structure arising from\ncorrelated singlet fluctuations, which we demonstrate by enhancing said\nfluctuations with four-spin couplings. All spectral features found here should\nbe observable by elastic neutron scattering experiments on layered quantum\nantiferromagnets doped with nonmagnetic impurities.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Statistical Mechanics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}