{"id":"2408.11525","title":"Straight outta photosphere: Open solar flux without coronal modeling","authors":"Ismo T\\\"ahtinen, Timo Asikainen, Kalevi Mursula","authorsParsed":[["Tähtinen","Ismo",""],["Asikainen","Timo",""],["Mursula","Kalevi",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 11:02:35 GMT"}],"updateDate":"2024-08-23","timestamp":1724238155000,"abstract":"  The open solar flux, that is, the total magnetic flux escaping the Sun, is\none of the most important parameters connecting solar activity to the Earth.\nThe open solar flux is commonly estimated from photospheric magnetic field\nmeasurements by making model assumptions about the solar corona. However, the\nquestion in which way the open solar flux is directly related to the\ndistribution of the photospheric magnetic field is still partly unknown. We aim\nto reconstruct the open solar flux directly from the photospheric magnetic\nfields without making any assumptions about the corona and without using\ncoronal hole observations, for instance. We modified an earlier vector sum\nmethod by taking magnetic field polarities into account and applied the method\nto the synoptic magnetograms of six instruments to determine the open solar\nflux from solar cycles 21-24. Results. The modified vector sum method produces\na vector of the global solar magnetic field whose magnitude closely matches the\nopen solar flux from the potential field source surface (PFSS) model both by\nthe absolute scale and the overall time evolution for each of the six\nmagnetograms. The latitude of this vector follows the Hale cycle by always\npointing toward the dominantly positive-polarity hemisphere, and its longitude\ncoincides with the location of the main coronal holes of the McIntosh Archive.\nWe find multi-year periods during which the longitude of the vector slowly\ndrifts or stays rather stationary in the Carrington frame. These periods are\npunctuated by times when the longitude moves rapidly in the Carrington frame.\nBy comparing the magnitude of this vector to the open solar flux calculated\nfrom the PFSS model with different source surface heights, we find that the\nbest match is produced with a source surface height $R_{ss} = 2.4 -\n2.5R_\\odot$.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Space Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}