{"id":"2408.10000","title":"Working in Extended Reality in the Wild: Worker and Bystander\n  Experiences of XR Virtual Displays in Real-World Settings","authors":"Leonardo Pavanatto, Verena Biener, Jennifer Chandran, Snehanjali\n  Kalamkar, Feiyu Lu, John J. Dudley, Jinghui Hu, G. Nikki Ramirez-Saffy, Per\n  Ola Kristensson, Alexander Giovannelli, Luke Schlueter, J\\\"org M\\\"uller, Jens\n  Grubert, Doug A. Bowman","authorsParsed":[["Pavanatto","Leonardo",""],["Biener","Verena",""],["Chandran","Jennifer",""],["Kalamkar","Snehanjali",""],["Lu","Feiyu",""],["Dudley","John J.",""],["Hu","Jinghui",""],["Ramirez-Saffy","G. Nikki",""],["Kristensson","Per Ola",""],["Giovannelli","Alexander",""],["Schlueter","Luke",""],["Müller","Jörg",""],["Grubert","Jens",""],["Bowman","Doug A.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 13:53:35 GMT"}],"updateDate":"2024-08-20","timestamp":1724075615000,"abstract":"  Although access to sufficient screen space is crucial to knowledge work,\nworkers often find themselves with limited access to display infrastructure in\nremote or public settings. While virtual displays can be used to extend the\navailable screen space through extended reality (XR) head-worn displays (HWD),\nwe must better understand the implications of working with them in public\nsettings from both users' and bystanders' viewpoints. To this end, we conducted\ntwo user studies. We first explored the usage of a hybrid AR display across\nreal-world settings and tasks. We focused on how users take advantage of\nvirtual displays and what social and environmental factors impact their usage\nof the system. A second study investigated the differences between working with\na laptop, an AR system, or a VR system in public. We focused on a single\nlocation and participants performed a predefined task to enable direct\ncomparisons between the conditions while also gathering data from bystanders.\nThe combined results suggest a positive acceptance of XR technology in public\nsettings and show that virtual displays can be used to accompany existing\ndevices. We highlighted some environmental and social factors. We saw that\nprevious XR experience and personality can influence how people perceive the\nuse of XR in public. In addition, we confirmed that using XR in public still\nmakes users stand out and that bystanders are curious about the devices, yet\nhave no clear understanding of how they can be used.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}