{"id":"2408.07327","title":"An Offline Meta Black-box Optimization Framework for Adaptive Design of\n  Urban Traffic Light Management Systems","authors":"Taeyoung Yun, Kanghoon Lee, Sujin Yun, Ilmyung Kim, Won-Woo Jung,\n  Min-Cheol Kwon, Kyujin Choi, Yoohyeon Lee, and Jinkyoo Park","authorsParsed":[["Yun","Taeyoung",""],["Lee","Kanghoon",""],["Yun","Sujin",""],["Kim","Ilmyung",""],["Jung","Won-Woo",""],["Kwon","Min-Cheol",""],["Choi","Kyujin",""],["Lee","Yoohyeon",""],["Park","Jinkyoo",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 06:57:58 GMT"}],"updateDate":"2024-08-15","timestamp":1723618678000,"abstract":"  Complex urban road networks with high vehicle occupancy frequently face\nsevere traffic congestion. Designing an effective strategy for managing\nmultiple traffic lights plays a crucial role in managing congestion. However,\nmost current traffic light management systems rely on human-crafted decisions,\nwhich may not adapt well to diverse traffic patterns. In this paper, we delve\ninto two pivotal design components of the traffic light management system that\ncan be dynamically adjusted to various traffic conditions: phase combination\nand phase time allocation. While numerous studies have sought an efficient\nstrategy for managing traffic lights, most of these approaches consider a fixed\ntraffic pattern and are limited to relatively small road networks. To overcome\nthese limitations, we introduce a novel and practical framework to formulate\nthe optimization of such design components using an offline meta black-box\noptimization. We then present a simple yet effective method to efficiently find\na solution for the aforementioned problem. In our framework, we first collect\nan offline meta dataset consisting of pairs of design choices and corresponding\ncongestion measures from various traffic patterns. After collecting the\ndataset, we employ the Attentive Neural Process (ANP) to predict the impact of\nthe proposed design on congestion across various traffic patterns with\nwell-calibrated uncertainty. Finally, Bayesian optimization, with ANP as a\nsurrogate model, is utilized to find an optimal design for unseen traffic\npatterns through limited online simulations. Our experiment results show that\nour method outperforms state-of-the-art baselines on complex road networks in\nterms of the number of waiting vehicles. Surprisingly, the deployment of our\nmethod into a real-world traffic system was able to improve traffic throughput\nby 4.80\\% compared to the original strategy.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dl0QNBxf4h62t0dyVIVsQYWnFi6qVeAaeVB73Nkehe8","pdfSize":"4455105"}
