{"id":"2408.06417","title":"Detecting exoplanet transits with the next generation of X-ray\n  telescopes","authors":"Raven Cilley, George W. King, Lia Corrales","authorsParsed":[["Cilley","Raven",""],["King","George W.",""],["Corrales","Lia",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 18:00:04 GMT"}],"updateDate":"2024-08-14","timestamp":1723485604000,"abstract":"  Detecting exoplanet transits at X-ray wavelengths would provide a window into\nthe effects of high energy irradiation on the upper atmospheres of planets.\nHowever, stars are relatively dim in the X-ray, making exoplanet transit\ndetections difficult with current X-ray telescopes. To date, only one exoplanet\n(HD~189733~b) has an X-ray transit detection. In this study, we investigate the\ncapability of future X-ray observatories to detect more exoplanet transits,\nfocusing on both the NewAthena-WFI instrument and the proposed Advanced X-ray\nImaging Satellite (AXIS), which provide more light-collecting power than\ncurrent instruments. We examined all the transiting exoplanet systems in the\nNASA Exoplanet Archive and gathered X-ray flux measurements or estimates for\neach host star. We then predicted the stellar count rates for both AXIS and\nNewAthena and simulated light curves, using null-hypothesis testing to identify\nthe top 15 transiting planets ranked by potential detection significance. We\nalso evaluate transit detection probabilities when the apparent X-ray radius is\nenlarged due to atmospheric escape, finding that $\\geq 5$ of these planetary\nsystems may be detectable on the $>4\\sigma$ level in this scenario. Finally, we\nnote that the assumed host star coronal temperature, which affects the shape of\nan X-ray transit, can also significantly affect our ability to detect the\nplanet.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}