{"id":"2408.06248","title":"Rethinking Video with a Universal Event-Based Representation","authors":"Andrew Freeman","authorsParsed":[["Freeman","Andrew",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 16:00:17 GMT"}],"updateDate":"2024-08-13","timestamp":1723478417000,"abstract":"  Traditionally, video is structured as a sequence of discrete image frames.\nRecently, however, a novel video sensing paradigm has emerged which eschews\nvideo frames entirely. These \"event\" sensors aim to mimic the human vision\nsystem with asynchronous sensing, where each pixel has an independent, sparse\ndata stream. While these cameras enable high-speed and high-dynamic-range\nsensing, researchers often revert to a framed representation of the event data\nfor existing applications, or build bespoke applications for a particular\ncamera's event data type. At the same time, classical video systems have\nsignificant computational redundancy at the application layer, since pixel\nsamples are repeated across frames in the uncompressed domain.\n  To address the shortcomings of existing systems, I introduce Address,\nDecimation, {\\Delta}t Event Representation (AD{\\Delta}ER, pronounced \"adder\"),\na novel intermediate video representation and system framework. The framework\ntranscodes a variety of framed and event camera sources into a single\nevent-based representation, which supports source-modeled lossy compression and\nbackward compatibility with traditional frame-based applications. I demonstrate\nthat AD{\\Delta}ER achieves state-of-the-art application speed and compression\nperformance for scenes with high temporal redundancy. Crucially, I describe how\nAD{\\Delta}ER unlocks an entirely new control mechanism for computer vision:\napplication speed can correlate with both the scene content and the level of\nlossy compression. Finally, I discuss the implications for event-based video on\nlarge-scale video surveillance and resource-constrained sensing.\n","subjects":["Computing Research Repository/Multimedia","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}