{"id":"2408.07339","title":"Bilayer TeO2: The First Oxide Semiconductor with Symmetric Sub-5-nm NMOS\n  and PMOS","authors":"Linqiang Xu, Liya Zhao, Chit Siong Lau, Pan Zhang, Lianqiang Xu,\n  Qiuhui Li, Shibo Fang, Yee Sin Ang, Xiaotian Sun, and Jing Lu","authorsParsed":[["Xu","Linqiang",""],["Zhao","Liya",""],["Lau","Chit Siong",""],["Zhang","Pan",""],["Xu","Lianqiang",""],["Li","Qiuhui",""],["Fang","Shibo",""],["Ang","Yee Sin",""],["Sun","Xiaotian",""],["Lu","Jing",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 07:29:51 GMT"}],"updateDate":"2024-08-15","timestamp":1723620591000,"abstract":"  Wide bandgap oxide semiconductors are very promising channel candidates for\nnext-generation electronics due to their large-area manufacturing, high-quality\ndielectrics, low contact resistance, and low leakage current. However, the\nabsence of ultra-short gate length (Lg) p-type transistors has restricted their\napplication in future complementary metal-oxide-semiconductor (CMOS)\nintegration. Inspired by the successfully grown high-hole mobility bilayer (BL)\nbeta tellurium dioxide (\\b{eta}-TeO2), we investigate the performance of\nsub-5-nm-Lg BL \\b{eta}-TeO2 field-effect transistors (FETs) by utilizing\nfirst-principles quantum transport simulation. The distinctive anisotropy of BL\n\\b{eta}-TeO2 yields different transport properties. In the y-direction, both\nthe sub-5-nm-Lg n-type and p-type BL \\b{eta}-TeO2 FETs can fulfill the\nInternational Technology Roadmap for Semiconductors (ITRS) criteria for\nhigh-performance (HP) devices, which are superior to the reported oxide FETs\n(only n-type). Remarkably, we for the first time demonstrate the existence of\nthe NMOS and PMOS symmetry in sub-5-nm-Lg oxide semiconductor FETs. As to the\nx-direction, the n-type BL \\b{eta}-TeO2 FETs satisfy both the ITRS HP and\nlow-power (LP) requirements with Lg down to 3 nm. Consequently, our work shed\nlight on the tremendous prospects of BL \\b{eta}-TeO2 for CMOS application.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}