{"id":"2408.02514","title":"Stem-JEPA: A Joint-Embedding Predictive Architecture for Musical Stem\n  Compatibility Estimation","authors":"Alain Riou, Stefan Lattner, Ga\\\"etan Hadjeres, Michael Anslow,\n  Geoffroy Peeters","authorsParsed":[["Riou","Alain",""],["Lattner","Stefan",""],["Hadjeres","Gaëtan",""],["Anslow","Michael",""],["Peeters","Geoffroy",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 14:34:40 GMT"}],"updateDate":"2024-08-06","timestamp":1722868480000,"abstract":"  This paper explores the automated process of determining stem compatibility\nby identifying audio recordings of single instruments that blend well with a\ngiven musical context. To tackle this challenge, we present Stem-JEPA, a novel\nJoint-Embedding Predictive Architecture (JEPA) trained on a multi-track dataset\nusing a self-supervised learning approach.\n  Our model comprises two networks: an encoder and a predictor, which are\njointly trained to predict the embeddings of compatible stems from the\nembeddings of a given context, typically a mix of several instruments. Training\na model in this manner allows its use in estimating stem compatibility -\nretrieving, aligning, or generating a stem to match a given mix - or for\ndownstream tasks such as genre or key estimation, as the training paradigm\nrequires the model to learn information related to timbre, harmony, and rhythm.\n  We evaluate our model's performance on a retrieval task on the MUSDB18\ndataset, testing its ability to find the missing stem from a mix and through a\nsubjective user study. We also show that the learned embeddings capture\ntemporal alignment information and, finally, evaluate the representations\nlearned by our model on several downstream tasks, highlighting that they\neffectively capture meaningful musical features.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bAbmhnZCnhvskw62HgmQw-0EJ8P5cEKqwbHl2rLgU7Y","pdfSize":"619304"}
