{"id":"2408.16885","title":"A Prototype Model of Zero-Trust Architecture Blockchain with\n  EigenTrust-Based Practical Byzantine Fault Tolerance Protocol to Manage\n  Decentralized Clinical Trials","authors":"Ashok Kumar Peepliwall, Hari Mohan Pandey, Surya Prakash, Anand A\n  Mahajan, Sudhinder Singh Chowhan, Vinesh Kumar, Rahul Sharma","authorsParsed":[["Peepliwall","Ashok Kumar",""],["Pandey","Hari Mohan",""],["Prakash","Surya",""],["Mahajan","Anand A",""],["Chowhan","Sudhinder Singh",""],["Kumar","Vinesh",""],["Sharma","Rahul",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 20:18:00 GMT"}],"updateDate":"2024-09-02","timestamp":1724962680000,"abstract":"  The COVID-19 pandemic necessitated the emergence of decentralized Clinical\nTrials (DCTs) due to patient retention, accelerate trials, improve data\naccessibility, enable virtual care, and facilitate seamless communication\nthrough integrated systems. However, integrating systems in DCTs exposes\nclinical data to potential security threats, making them susceptible to theft\nat any stage, a high risk of protocol deviations, and monitoring issues. To\nmitigate these challenges, blockchain technology serves as a secure framework,\nacting as a decentralized ledger, creating an immutable environment by\nestablishing a zero-trust architecture, where data are deemed untrusted until\nverified. In combination with Internet of Things (IoT)-enabled wearable\ndevices, blockchain secures the transfer of clinical trial data on private\nblockchains during DCT automation and operations. This paper proposes a\nprototype model of the Zero-Trust Architecture Blockchain (z-TAB) to integrate\npatient-generated clinical trial data during DCT operation management. The\nEigenTrust-based Practical Byzantine Fault Tolerance (T-PBFT) algorithm has\nbeen incorporated as a consensus protocol, leveraging Hyperledger Fabric.\nFurthermore, the Internet of Things (IoT) has been integrated to streamline\ndata processing among stakeholders within the blockchain platforms. Rigorous\nevaluation has been done to evaluate the quality of the system.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Emerging Technologies","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5-yLHI4MEbJ1CzjusiZ0Q7tdOBhFZsBZoaQGmGYwwJM","pdfSize":"2324443"}
