{"id":"2408.01113","title":"p-wave superconductivity induced by nearest-neighbor attraction in the\n  square-lattice extended Hubbard model","authors":"Zhangkai Cao, Jianyu Li, Jiahao Su, Tao Ying, and Ho-Kin Tang","authorsParsed":[["Cao","Zhangkai",""],["Li","Jianyu",""],["Su","Jiahao",""],["Ying","Tao",""],["Tang","Ho-Kin",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 08:41:38 GMT"}],"updateDate":"2024-08-05","timestamp":1722588098000,"abstract":"  The two-dimensional (2D) Hubbard model is widely believed to contain the key\ningredients of high-temperature superconductivity in cuprate materials. Here,\nwe report a constrained path quantum Monte Carlo (CPQMC) study of the\nsquare-lattice extended Hubbard model with on-site Coulomb repulsion U and\nnearest-neighbor (NN) electron attraction V. Upon doping $\\delta$= 0.125, we\nfind that the NN electron attraction V can notably drive an exotic spin-triplet\n(p-wave) superconducting (SC) phase, and enhance the p-wave SC correlations\nwith the increase of V. But in the intermediate coupling regime, the\n$d_{x^2-y^2}$-wave (d-wave) does not significantly increase with the increase\nof V, indicating that the d-wave is not affected by V in strongly correlated\nsystem. Besides the pairing phase, a spin density wave (SDW) only exists near\nthe half-filling in the particle-hole channel, and doping disrupts the\nformation of SDW order. Especially, the NN electron attraction V has no\nsignificant effect on SDW, reflecting the consistent relationship between\nd-wave SC and spin correlation. Moreover, as doping increases, the dominant\nregion of p-wave also expands, further suppressing the presence of d-wave,\nwhich may help explain the disappearance of d-wave SC in overdoped cuprate\nsuperconductors. We also find the d-wave exhibits a singular nonzero (near\npoint ($2{\\pi}/3, {\\pi}$)) condensation structure in momentum space, resulting\nin a different staggered behavior in the x and y direction with distance in\nreal space. On the contrary, the p-wave condensed at zero momentum, and the\np-wave correlation exhibits exponential decay in real space. Our work suggests\nthe p-wave SC region can be induced and further broadened by the NN electron\nattraction V, offering a feasible mechanism to realize p-wave superconductivity\nin realistic cuprate materials.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/"}