{"id":"2408.06533","title":"Dynamics of polymers in coarse-grained nematic solvents","authors":"Zahra Valei and Karolina Wamsler and Alex J. Parker and Therese A.\n  Obara and Alexander R. Klotz and Tyler N. Shendruk","authorsParsed":[["Valei","Zahra",""],["Wamsler","Karolina",""],["Parker","Alex J.",""],["Obara","Therese A.",""],["Klotz","Alexander R.",""],["Shendruk","Tyler N.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 23:43:52 GMT"}],"updateDate":"2024-08-14","timestamp":1723506232000,"abstract":"  Polymers are a primary building block in many biomaterials, often interacting\nwith anisotropic backgrounds. While previous studies have considered polymer\ndynamics within nematic solvents, rarely are the the effects of anisotropic\nviscosity and polymer elongation differentiated. Here, we study polymers\nembedded in nematic liquid crystals with isotropic viscosity via numerical\nsimulations, to explicitly investigate the effect of nematicity on\nmacromolecular conformation and how conformation alone can produce anisotropic\ndynamics. We employ a hybrid technique that captures nematic orientation,\nthermal fluctuations and hydrodynamic interactions. The coupling of the polymer\nbackbone to the nematic field elongates the polymer, producing anisotropic\ndiffusion even in nematic solvents with isotropic viscosity. For intermediate\ncoupling, the competition between background anisotropy and macrmolecular\nentropy leads to hairpins - sudden kinks along the backbone of the polymer.\nExperiments of DNA embedded in a solution of rod-like fd viruses qualitatively\nsupport the role of hairpins in establishing characteristic conformational\nfeatures that govern polymer dynamics. Hairpin diffusion along the backbone\nexponentially slows as coupling increases. Better understanding two-way\ncoupling between polymers and their surroundings could allow the creation of\nmore biomimetic composite materials.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0QrZq8QD6_u9w3xNem3AlvWP74u_u2SMHCueKWpMn7c","pdfSize":"1616428"}
