{"id":"2408.06023","title":"Revisiting Chronology Protection Conjecture in The Dyonic Kerr-Sen Black\n  Hole Spacetime","authors":"Teephatai Bunyaratavej, Piyabut Burikham, David Senjaya","authorsParsed":[["Bunyaratavej","Teephatai",""],["Burikham","Piyabut",""],["Senjaya","David",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 09:22:57 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 17:24:46 GMT"}],"updateDate":"2024-08-27","timestamp":1723454577000,"abstract":"  The Chronology Protection Conjecture (CPC) was first introduced by Hawking\nafter his semi-classical investigation to the behaviour of a spacetime with\nclosed timelike curves (CTCs) in response to scalar perturbation. It is argued\nthat there would be instabilities leading to amplification of the perturbation\nand finally causing collapse of the region with CTCs. In this work, we\ninvestigate the CPC by exactly solve the Klein-Gordon equation in the region\ninside the inner horizon of the non-extremal Dyonic Kerr-Sen~(KS) black hole,\nwhere closed timelike curves exist. Successfully find the exact radial\nsolution, we apply the polynomial condition that turns into rule of the energy\nquantization. The quasinormal modes~(QNMs) of the scalar fields in the region\ninside the inner horizon of the rotating black hole with nonzero energy have\nonly positive imaginary part describing states that grow in time. The\nexponentially growing modes will backreact and deform the spacetime region\nwhere CTC exists. The CPC is proven to be valid in the Dyonic Kerr-Sen black\nhole spacetime. Moreover, since the Dyonic Kerr-Sen black hole is the most\ngeneral axisymmetric black hole solution of the string inspired\nEinstein-Maxwell-dilaton-axion (EMDA) theory, the semiclassical proof in this\nwork is also valid for all simpler rotating black holes of the EMDA theory. The\nstructure of the Dyonic KS spacetime distinctive from the Kerr-Newman\ncounterpart is also explored.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}