{"id":"2408.00647","title":"Counterclockwise Dissipativity, Potential Games and Evolutionary Nash\n  Equilibrium Learning","authors":"Nuno C. Martins, Jair Cert\\'orio, Matthew S. Hankins","authorsParsed":[["Martins","Nuno C.",""],["Certório","Jair",""],["Hankins","Matthew S.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 15:38:40 GMT"}],"updateDate":"2024-08-02","timestamp":1722526720000,"abstract":"  We use system-theoretic passivity methods to study evolutionary Nash\nequilibria learning in large populations of agents engaged in strategic,\nnon-cooperative interactions. The agents follow learning rules (rules for\nshort) that capture their strategic preferences and a payoff mechanism ascribes\npayoffs to the available strategies. The population's aggregate strategic\nprofile is the state of an associated evolutionary dynamical system.\nEvolutionary Nash equilibrium learning refers to the convergence of this state\nto the Nash equilibria set of the payoff mechanism. Most approaches consider\nmemoryless payoff mechanisms, such as potential games. Recently, methods using\n$\\delta$-passivity and equilibrium independent passivity (EIP) have introduced\ndynamic payoff mechanisms. However, $\\delta$-passivity does not hold when\nagents follow rules exhibiting ``imitation\" behavior, such as in replicator\ndynamics. Conversely, EIP applies to the replicator dynamics but not to\n$\\delta$-passive rules. We address this gap using counterclockwise\ndissipativity (CCW). First, we prove that continuous memoryless payoff\nmechanisms are CCW if and only if they are potential games. Subsequently, under\n(possibly dynamic) CCW payoff mechanisms, we establish evolutionary Nash\nequilibrium learning for any rule within a convex cone spanned by imitation\nrules and continuous $\\delta$-passive rules.\n","subjects":["Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Mathematics/Dynamical Systems","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"iFUrPg8hqBaW1shCxYFBTvle0_R5brqIJnwc3I1vjzA","pdfSize":"267939","txDigest":"5bSTv6UT58JyCv84sUKemtyZudJcki9Q9MR28ZuLUMpU","endEpoch":"1","status":"CERTIFIED"}
