{"id":"2408.14718","title":"Residual-based Adaptive Huber Loss (RAHL) -- Design of an improved Huber\n  loss for CQI prediction in 5G networks","authors":"Mina Kaviani, Jurandy Almeida, Fabio L. Verdi","authorsParsed":[["Kaviani","Mina",""],["Almeida","Jurandy",""],["Verdi","Fabio L.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 00:58:32 GMT"}],"updateDate":"2024-08-28","timestamp":1724720312000,"abstract":"  The Channel Quality Indicator (CQI) plays a pivotal role in 5G networks,\noptimizing infrastructure dynamically to ensure high Quality of Service (QoS).\nRecent research has focused on improving CQI estimation in 5G networks using\nmachine learning. In this field, the selection of the proper loss function is\ncritical for training an accurate model. Two commonly used loss functions are\nMean Squared Error (MSE) and Mean Absolute Error (MAE). Roughly speaking, MSE\nput more weight on outliers, MAE on the majority. Here, we argue that the Huber\nloss function is more suitable for CQI prediction, since it combines the\nbenefits of both MSE and MAE. To achieve this, the Huber loss transitions\nsmoothly between MSE and MAE, controlled by a user-defined hyperparameter\ncalled delta. However, finding the right balance between sensitivity to small\nerrors (MAE) and robustness to outliers (MSE) by manually choosing the optimal\ndelta is challenging. To address this issue, we propose a novel loss function,\nnamed Residual-based Adaptive Huber Loss (RAHL). In RAHL, a learnable residual\nis added to the delta, enabling the model to adapt based on the distribution of\nerrors in the data. Our approach effectively balances model robustness against\noutliers while preserving inlier data precision. The widely recognized Long\nShort-Term Memory (LSTM) model is employed in conjunction with RAHL, showcasing\nsignificantly improved results compared to the aforementioned loss functions.\nThe obtained results affirm the superiority of RAHL, offering a promising\navenue for enhanced CQI prediction in 5G networks.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}