{"id":"2408.02738","title":"Odd-parity effect and scale-dependent viscosity in atomic quantum gases","authors":"Jeff Maki and Ulf Gran and Johannes Hofmann","authorsParsed":[["Maki","Jeff",""],["Gran","Ulf",""],["Hofmann","Johannes",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 18:00:11 GMT"}],"updateDate":"2024-08-07","timestamp":1722880811000,"abstract":"  It has recently been predicted that two-dimensional electron gases possess an\nanomalous ``tomographic'' transport regime outside of the traditional\ncollisionless and hydrodynamic limits, but an experimental confirmation has\nbeen elusive so far. This anomalous regime is marked by the appearance of an\nodd-even effect in the quasiparticle lifetimes where deformations of the Fermi\nsurface with odd-parity become long-lived in comparison to even-parity ones. In\nthis work, we establish neutral atomic quantum gases as an alternative platform\nto reveal this new transport regime and demonstrate an odd-even effect in the\nnormal phase of two-component Fermi gases. By diagonalizing the Fermi liquid\ncollision integral, we identify odd-parity modes with anomalously long\nlifetimes below temperatures $T\\leq 0.1 T_F$, which is within the reach of\ncurrent cold atom experiments. In a marked difference from condensed matter\nsetups, we show that the odd-even effect in neutral gases is widely tunable\nwith interactions along the BCS-BEC crossover and suppressed on the BEC side\nwhere the Fermi surface is destroyed. We propose the damping rate of quadrupole\noscillations as an experimental signature of the long-lived odd-parity modes.\nThe damping rate is set by the shear viscosity, which for finite trap\nconfinement is dominated by odd-parity modes and thus anomalous enhanced\ncompared to the hydrodynamic limit. Furthermore, a full computation of the\nshear viscosity within Fermi liquid theory shows that the magnitude of the\nodd-even effect depends on the particle number and is particularly pronounced\nin mesoscopic Fermi gases. Our findings suggest that the hydrodynamic behavior\nof neutral degenerate quantum gases is much richer than previously thought and\nshould include additional long-lived modes.\n","subjects":["Condensed Matter/Quantum Gases","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6q9WJNkE4ueIC0hGFNjf75-lf1uSqK5oAMkUEAx5-uw","pdfSize":"555490"}
