{"id":"2408.12575","title":"Enhanced Parking Perception by Multi-Task Fisheye Cross-view\n  Transformers","authors":"Antonyo Musabini, Ivan Novikov, Sana Soula, Christel Leonet, Lihao\n  Wang, Rachid Benmokhtar, Fabian Burger, Thomas Boulay, Xavier Perrotton","authorsParsed":[["Musabini","Antonyo",""],["Novikov","Ivan",""],["Soula","Sana",""],["Leonet","Christel",""],["Wang","Lihao",""],["Benmokhtar","Rachid",""],["Burger","Fabian",""],["Boulay","Thomas",""],["Perrotton","Xavier",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 17:42:16 GMT"}],"updateDate":"2024-08-23","timestamp":1724348536000,"abstract":"  Current parking area perception algorithms primarily focus on detecting\nvacant slots within a limited range, relying on error-prone homographic\nprojection for both labeling and inference. However, recent advancements in\nAdvanced Driver Assistance System (ADAS) require interaction with end-users\nthrough comprehensive and intelligent Human-Machine Interfaces (HMIs). These\ninterfaces should present a complete perception of the parking area going from\ndistinguishing vacant slots' entry lines to the orientation of other parked\nvehicles. This paper introduces Multi-Task Fisheye Cross View Transformers (MT\nF-CVT), which leverages features from a four-camera fisheye Surround-view\nCamera System (SVCS) with multihead attentions to create a detailed Bird-Eye\nView (BEV) grid feature map. Features are processed by both a segmentation\ndecoder and a Polygon-Yolo based object detection decoder for parking slots and\nvehicles. Trained on data labeled using LiDAR, MT F-CVT positions objects\nwithin a 25m x 25m real open-road scenes with an average error of only 20 cm.\nOur larger model achieves an F-1 score of 0.89. Moreover the smaller model\noperates at 16 fps on an Nvidia Jetson Orin embedded board, with similar\ndetection results to the larger one. MT F-CVT demonstrates robust\ngeneralization capability across different vehicles and camera rig\nconfigurations. A demo video from an unseen vehicle and camera rig is available\nat: https://streamable.com/jjw54x.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"4OhiwyMyaGITfxRlVNqlN-nW7OynGBcTSlEFMu-FRrE","pdfSize":"2777424"}
