{"id":"2408.14501","title":"Applying graph neural network to SupplyGraph for supply chain network","authors":"Kihwan Han","authorsParsed":[["Han","Kihwan",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 23:42:18 GMT"}],"updateDate":"2024-08-28","timestamp":1724456538000,"abstract":"  Supply chain networks describe interactions between products, manufacture\nfacilities, storages in the context of supply and demand of the products.\nSupply chain data are inherently under graph structure; thus, it can be fertile\nground for applications of graph neural network (GNN). Very recently, supply\nchain dataset, SupplyGraph, has been released to the public. Though the\nSupplyGraph dataset is valuable given scarcity of publicly available data,\nthere was less clarity on description of the dataset, data quality assurance\nprocess, and hyperparameters of the selected models. Further, for\ngeneralizability of findings, it would be more convincing to present the\nfindings by performing statistical analyses on the distribution of errors\nrather than showing the average value of the errors. Therefore, this study\nassessed the supply chain dataset, SupplyGraph, with better clarity on analyses\nprocesses, data quality assurance, machine learning (ML) model specifications.\nAfter data quality assurance procedures, this study compared performance of\nMultilayer Perceptions (MLP), Graph Convolution Network (GCN), and Graph\nAttention Network (GAT) on a demanding forecasting task while matching\nhyperparameters as feasible as possible. The analyses revealed that GAT\nperformed best, followed by GCN and MLP. Those performance improvements were\nstatistically significant at $\\alpha = 0.05$ after correction for multiple\ncomparisons. This study also discussed several considerations in applying GNN\nto supply chain networks. The current study reinforces the previous study in\nsupply chain benchmark dataset with respect to description of the dataset and\nmethodology, so that the future research in applications of GNN to supply chain\nbecomes more reproducible.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}