{"id":"2408.11229","title":"EFT Workshop at Notre Dame","authors":"Nick Smith, Daniel Spitzbart, Jennet Dickinson, Jon Wilson, Lindsey\n  Gray, Kelci Mohrman, Saptaparna Bhattacharya, Andrea Piccinelli, Titas Roy,\n  Garyfallia Paspalaki, Duarte Fontes, Adam Martin, William Shepherd, Sergio\n  S\\'anchez Cruz, Dorival Goncalves, Andrei Gritsan, Harrison Prosper, Tom\n  Junk, Kyle Cranmer, Michael Peskin, Andrew Gilbert, Jonathon Langford, Frank\n  Petriello, Luca Mantani, Andrew Wightman, Charlotte Knight, Prasanth\n  Shyamsundar, Aashwin Basnet, Giacomo Boldrini, Kevin Lannon","authorsParsed":[["Smith","Nick",""],["Spitzbart","Daniel",""],["Dickinson","Jennet",""],["Wilson","Jon",""],["Gray","Lindsey",""],["Mohrman","Kelci",""],["Bhattacharya","Saptaparna",""],["Piccinelli","Andrea",""],["Roy","Titas",""],["Paspalaki","Garyfallia",""],["Fontes","Duarte",""],["Martin","Adam",""],["Shepherd","William",""],["Cruz","Sergio Sánchez",""],["Goncalves","Dorival",""],["Gritsan","Andrei",""],["Prosper","Harrison",""],["Junk","Tom",""],["Cranmer","Kyle",""],["Peskin","Michael",""],["Gilbert","Andrew",""],["Langford","Jonathon",""],["Petriello","Frank",""],["Mantani","Luca",""],["Wightman","Andrew",""],["Knight","Charlotte",""],["Shyamsundar","Prasanth",""],["Basnet","Aashwin",""],["Boldrini","Giacomo",""],["Lannon","Kevin",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 23:04:36 GMT"}],"updateDate":"2024-08-22","timestamp":1724195076000,"abstract":"  The LPC EFT workshop was held April 25-26, 2024 at the University of Notre\nDame. The workshop was organized into five thematic sessions: \"how far beyond\nlinear\" discusses issues of truncation and validity in interpretation of\nresults with an eye towards practicality; \"reconstruction-level results\" visits\nthe question of how best to design analyses directly targeting inference of EFT\nparameters; \"logistics of combining likelihoods\" addresses the challenges of\nbringing a diverse array of measurements into a cohesive whole; \"unfolded\nresults\" tackles the question of designing fiducial measurements for later use\nin EFT interpretations, and the benefits and limitations of unfolding; and\n\"building a sample library\" addresses how best to generate simulation samples\nfor use in data analysis. This document serves as a summary of presentations,\nsubsequent discussions, and actionable items identified over the course of the\nworkshop.\n","subjects":["Physics/High Energy Physics - Experiment"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}