{"id":"2408.07267","title":"Realization of time-reversal invariant photonic topological Anderson\n  insulators","authors":"Xiao-Dong Chen, Zi-Xuan Gao, Xiaohan Cui, Hao-Chang Mo, Wen-Jie Chen,\n  Ruo-Yang Zhang, C. T. Chan, Jian-Wen Dong","authorsParsed":[["Chen","Xiao-Dong",""],["Gao","Zi-Xuan",""],["Cui","Xiaohan",""],["Mo","Hao-Chang",""],["Chen","Wen-Jie",""],["Zhang","Ruo-Yang",""],["Chan","C. T.",""],["Dong","Jian-Wen",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 03:20:23 GMT"}],"updateDate":"2024-08-15","timestamp":1723605623000,"abstract":"  Disorder, which is ubiquitous in nature, has been extensively explored in\nphotonics for understanding the fundamental principles of light diffusion and\nlocalization, as well as for applications in functional resonators and random\nlasers. Recently, the investigation of disorder in topological photonics has\nled to the realization of topological Anderson insulators characterized by an\nunexpected disorder-induced phase transition. However, the observed photonic\ntopological Anderson insulators so far are limited to the time-reversal\nsymmetry breaking systems. Here, we propose and realize a photonic quantum spin\nHall topological Anderson insulator without breaking time-reversal symmetry.\nThe disorder-induced topological phase transition is comprehensively confirmed\nthrough the theoretical effective Dirac Hamiltonian, numerical analysis of bulk\ntransmission, and experimental examination of bulk and edge transmissions. We\npresent the convincing evidence for the unidirectional propagation and robust\ntransport of helical edge modes, which are the key features of nontrivial\ntime-reversal invariant topological Anderson insulators. Furthermore, we\ndemonstrate disorder-induced beam steering, highlighting the potential of\ndisorder as a new degree of freedom to manipulate light propagation in\nmagnetic-free systems. Our work not only paves the way for observing unique\ntopological photonic phases but also suggests potential device applications\nthrough the utilization of disorder.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}