{"id":"2408.13106","title":"NEST: Self-supervised Fast Conformer as All-purpose Seasoning to Speech\n  Processing Tasks","authors":"He Huang, Taejin Park, Kunal Dhawan, Ivan Medennikov, Krishna C.\n  Puvvada, Nithin Rao Koluguri, Weiqing Wang, Jagadeesh Balam, Boris Ginsburg","authorsParsed":[["Huang","He",""],["Park","Taejin",""],["Dhawan","Kunal",""],["Medennikov","Ivan",""],["Puvvada","Krishna C.",""],["Koluguri","Nithin Rao",""],["Wang","Weiqing",""],["Balam","Jagadeesh",""],["Ginsburg","Boris",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 14:32:18 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 15:23:40 GMT"},{"version":"v3","created":"Wed, 4 Sep 2024 21:32:17 GMT"},{"version":"v4","created":"Wed, 18 Sep 2024 15:47:50 GMT"}],"updateDate":"2024-09-19","timestamp":1724423538000,"abstract":"  Self-supervised learning has been proved to benefit a wide range of speech\nprocessing tasks, such as speech recognition/translation, speaker verification\nand diarization, etc. However, most of current approaches are computationally\nexpensive. In this paper, we propose a simplified and more efficient\nself-supervised learning framework termed as NeMo Encoder for Speech Tasks\n(NEST). Specifically, we adopt the FastConformer architecture with 8x\nsub-sampling rate, which is faster than Transformer or Conformer architectures.\nInstead of clustering-based quantization, we use fixed random projection for\nits simplicity and effectiveness. We also implement a generalized noisy speech\naugmentation that teaches the model to disentangle the main speaker from noise\nor other speakers. Experiments show that \\model improves over existing\nself-supervised models and achieves new state-of-the-art performance on a\nvariety of speech processing tasks, such as speech recognition/translation,\nspeaker diarization, spoken language understanding, etc. Code and checkpoints\nwill be publicly available via NVIDIA NeMo framework.\n","subjects":["Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}