{"id":"2408.07848","title":"Combinatorial synthesis and characterization of thin film Al1-xRExN (RE\n  = Pr3+, Tb3+) heterostructural alloys","authors":"Binod Paudel, John S. Mangum, Christopher L. Rom, Kingsley Egbo,\n  Cheng-Wei Lee, Harvey Guthrey, Sean Allen, Nancy M. Haegel, Keisuke Yazawa,\n  Geoff L. Brennecka and Rebecca W. Smaha","authorsParsed":[["Paudel","Binod",""],["Mangum","John S.",""],["Rom","Christopher L.",""],["Egbo","Kingsley",""],["Lee","Cheng-Wei",""],["Guthrey","Harvey",""],["Allen","Sean",""],["Haegel","Nancy M.",""],["Yazawa","Keisuke",""],["Brennecka","Geoff L.",""],["Smaha","Rebecca W.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 23:14:04 GMT"}],"updateDate":"2024-08-16","timestamp":1723677244000,"abstract":"  The potential impact of cation-substituted AlN-based materials, such as\nAl1-xScxN, Al1-xGaxN, and Al1-xBxN, with exceptional electronic,\nelectromechanical, and dielectric properties has spurred research into this\nbroad family of materials. Rare earth (RE) cations are particularly appealing\nas they could additionally impart optoelectronic or magnetic functionality.\nHowever, success in incorporating a significant level of RE cations into AlN\nhas been limited so far because it is thermodynamically challenging to\nstabilize such heterostructural alloys. Using combinatorial co-sputtering, we\nsynthesized Al1-xRExN (RE = Pr, Tb) thin films and performed a rapid survey of\nthe composition-structure-property relationships as a function of RE alloying.\nUnder our growth conditions, we observe that Al1-xPrxN maintains a phase-pure\nwurtzite structure until transitioning to amorphous for x>0.22. Al1-xTbxN\nexhibits a phase-pure wurtzite structure until x<0.15, then exhibits mixed\nwurtzite and rocksalt phases for 0.16<x<0.28, and finally becomes amorphous\nbeyond that. Ellipsometry measurements reveal that the absorption onset\ndecreases with increasing rare earth incorporation and has a strong dependence\non the phases present. We observe the characteristic cathodoluminescence\nemission of Pr3+ and Tb3+, respectively. Using this synthesis approach, we have\ndemonstrated incorporation of Pr and Tb into the AlN wurtzite structure up to\nhigher compositions levels than previously reported and made the first\nmeasurements of corresponding structural and optoelectronic properties.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"sauoipmxVFHgDnETUhS7PFdHQyfaSWL7oV_S5Q_31zQ","pdfSize":"1182133"}
