{"id":"2408.02735","title":"Quantum information scrambling in adiabatically-driven critical systems","authors":"Ricardo Puebla, Fernando J. G\\'omez-Ruiz","authorsParsed":[["Puebla","Ricardo",""],["Gómez-Ruiz","Fernando J.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 18:00:05 GMT"}],"updateDate":"2024-08-07","timestamp":1722880805000,"abstract":"  Quantum information scrambling refers to the spread of the initially stored\ninformation over many degrees of freedom of a quantum many-body system.\nInformation scrambling is intimately linked to the thermalization of isolated\nquantum many-body systems and has been typically studied in a sudden quench\nscenario. Here we extend the notion of quantum information scrambling to\ncritical quantum many-body systems undergoing an adiabatic evolution. In\nparticular, we analyze how the symmetry-breaking information of an initial\nstate is scrambled in adiabatically-driven integrable systems, such as the\nLipkin-Meshkov-Glick and quantum Rabi model. Following a time-dependent\nprotocol that drives the system from a symmetry-breaking to a normal phase, we\nshow how the initial information is scrambled even for perfect adiabatic\nevolutions as indicated by the expectation value of a suitable observable. We\ndetail the underlying mechanism for quantum information scrambling, its\nrelation to ground- and excited-state quantum phase transitions and quantify\nthe degree of scrambling in terms of the number of eigenstates that participate\nin the encoding of the initial symmetry-breaking information. While the energy\nof the final state remains unaltered in an adiabatic protocol, the relative\nphases among eigenstates are scrambled and so is the symmetry-breaking\ninformation. We show that a potential information retrieval, following a\ntime-reversed protocol, is hindered by small perturbations as indicated by a\nvanishingly small Loschmidt echo and out-of-time-ordered correlators. The\nreported phenomenon is amenable for its experimental verification and may help\nin the understanding of information scrambling in critical quantum many-body\nsystems.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}