{"id":"2408.09989","title":"Adaptive BESS and Grid Setpoints Optimization: A Model-Free Framework\n  for Efficient Battery Management under Dynamic Tariff Pricing","authors":"Alaa Selim, Huadong Mo, Hemanshu Pota, Daoyi Dong","authorsParsed":[["Selim","Alaa",""],["Mo","Huadong",""],["Pota","Hemanshu",""],["Dong","Daoyi",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 13:40:41 GMT"}],"updateDate":"2024-08-20","timestamp":1724074841000,"abstract":"  This paper introduces an enhanced framework for managing Battery Energy\nStorage Systems (BESS) in residential communities. The non-convex BESS control\nproblem is first addressed using a gradient-based optimizer, providing a\nbenchmark solution. Subsequently, the problem is tackled using multiple Deep\nReinforcement Learning (DRL) agents, with a specific emphasis on the off-policy\nSoft Actor-Critic (SAC) algorithm. This version of SAC incorporates reward\nrefinement based on this non-convex problem, applying logarithmic scaling to\nenhance convergence rates. Additionally, a safety mechanism selects only\nfeasible actions from the action space, aimed at improving the learning curve,\naccelerating convergence, and reducing computation times. Moreover, the state\nrepresentation of this DRL approach now includes uncertainties quantified in\nthe entropy term, enhancing the model's adaptability across various entropy\ntypes. This developed system adheres to strict limits on the battery's State of\nCharge (SOC), thus preventing breaches of SOC boundaries and extending the\nbattery lifespan. The robustness of the model is validated across several\nAustralian states' districts, each characterized by unique uncertainty\ndistributions. By implementing the refined SAC, the SOC consistently surpasses\n50 percent by the end of each day, enabling the BESS control to start smoothly\nfor the next day with some reserve. Finally, this proposed DRL method achieves\na mean reduction in optimization time by 50 percent and an average cost saving\nof 40 percent compared to the gradient-based optimization benchmark.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"A-jS275sUN7F9v_I3KYIcFn8jicqgbPL2_drJ086mjg","pdfSize":"1405103"}
