{"id":"2408.00944","title":"Investigating introductory and advanced students' difficulties with\n  entropy and the second law of thermodynamics using a validated instrument","authors":"Mary Jane Brundage, David E. Meltzer, Chandralekha Singh","authorsParsed":[["Brundage","Mary Jane",""],["Meltzer","David E.",""],["Singh","Chandralekha",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 22:33:29 GMT"}],"updateDate":"2024-08-05","timestamp":1722551609000,"abstract":"  We use the Survey of Thermodynamic Processes and First and Second Laws-Long\n(STPFaSL-Long), a research-based survey instrument with 78 items at the level\nof introductory physics, to investigate introductory and advanced students'\ndifficulties with entropy and the second law of thermodynamics. We present\nanalysis of data from 12 different introductory and advanced physics classes at\nfour different higher education public institutions in the US in which the\nsurvey was administered in-person to more than 1000 students. We find that a\nwidespread unproductive tendency for introductory students to associate the\nproperties of entropy with those of energy leads to many errors based on an\nidea of \"conservation of entropy,\" in which entropy increases are always\nbalanced by equal entropy decreases. For many of the more advanced students\n(calculus-based and upper level), we detect a tendency to expect entropy\nincreases even in processes in which the entropy does not change. We observed a\nwidespread failure to correctly apply the relationship {\\Delta}S =\n{\\delta}Qreversible/T, either by using it for irreversible processes to which\nit does not apply, or by applying it incorrectly or completely neglecting it in\nreversible processes to which it does apply. We also noted that many\nintroductory students are simply not aware that total entropy must increase in\nany \"spontaneous\" heat transfer process. Students at all levels were very\nfrequently found to be confused that while net entropy (system + reservoir) in\nreversible isothermal processes does not change, the entropy of the working\nsubstance itself does indeed increase or decrease depending on whether the\nprocess is an expansion or compression. Our findings are broadly consistent\nwith prior research findings in this area, expanding upon them and revealing\npreviously unreported aspects of students' thinking.\n","subjects":["Physics/Physics Education"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}