{"id":"2408.02159","title":"SPINEX-TimeSeries: Similarity-based Predictions with Explainable\n  Neighbors Exploration for Time Series and Forecasting Problems","authors":"Ahmed Z Naser, MZ Naser","authorsParsed":[["Naser","Ahmed Z",""],["Naser","MZ",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 22:26:34 GMT"}],"updateDate":"2024-08-06","timestamp":1722810394000,"abstract":"  This paper introduces a new addition to the SPINEX (Similarity-based\nPredictions with Explainable Neighbors Exploration) family, tailored\nspecifically for time series and forecasting analysis. This new algorithm\nleverages the concept of similarity and higher-order temporal interactions\nacross multiple time scales to enhance predictive accuracy and interpretability\nin forecasting. To evaluate the effectiveness of SPINEX, we present\ncomprehensive benchmarking experiments comparing it against 18 algorithms and\nacross 49 synthetic and real datasets characterized by varying trends,\nseasonality, and noise levels. Our performance assessment focused on\nforecasting accuracy and computational efficiency. Our findings reveal that\nSPINEX consistently ranks among the top 5 performers in forecasting precision\nand has a superior ability to handle complex temporal dynamics compared to\ncommonly adopted algorithms. Moreover, the algorithm's explainability features,\nPareto efficiency, and medium complexity (on the order of O(log n)) are\ndemonstrated through detailed visualizations to enhance the prediction and\ndecision-making process. We note that integrating similarity-based concepts\nopens new avenues for research in predictive analytics, promising more accurate\nand transparent decision making.\n","subjects":["Statistics/Methodology","Computing Research Repository/Machine Learning","Statistics/Computation","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9984_K0ym7S99R06lIBgGE24DmmU28W_rryWA9IuEzo","pdfSize":"5940376","txDigest":"2N7w75CrLJP5aj16WPT2zuhMppkfJiyGzspw9G1S8DQA","endEpoch":"1","status":"CERTIFIED"}
