{"id":"2408.15407","title":"Constraints on the physical origin of large cavities in transition disks\n  from multi-wavelength dust continuum emission","authors":"Anibal Sierra, Laura M. P\\'erez, Benjam\\'in Sotomayor, Myriam Benisty,\n  Claire J. Chandler, Sean Andrews, John Carpenter, Thomas Henning, Leonardo\n  Testi, Luca Ricci, David Wilner","authorsParsed":[["Sierra","Anibal",""],["Pérez","Laura M.",""],["Sotomayor","Benjamín",""],["Benisty","Myriam",""],["Chandler","Claire J.",""],["Andrews","Sean",""],["Carpenter","John",""],["Henning","Thomas",""],["Testi","Leonardo",""],["Ricci","Luca",""],["Wilner","David",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 21:11:03 GMT"}],"updateDate":"2024-08-29","timestamp":1724793063000,"abstract":"  The physical origin of the large cavities observed in transition disks is to\ndate still unclear. Different physical mechanisms (e.g., a companion, dead\nzones, enhanced grain growth) produce disk cavities of different depth, and the\nexpected spatial distribution of gas and solids in each mechanism is not the\nsame. In this work, we analyze the multi-wavelength interferometric\nvisibilities of dust continuum observations obtained with ALMA and VLA for six\ntransition disks: CQTau, UXTau A, LkCa15, RXJ1615, SR24S, and DMTau, and\ncalculate brightness radial profiles, where diverse emission morphology is\nrevealed at different wavelengths. The multi-wavelength data is used to model\nthe spectral energy distribution and compute constraints on the radial profile\nof the dust surface density, maximum grain size, and dust temperature in each\ndisk. They are compared with the observational signatures expected from various\nphysical mechanisms responsible for disk cavities. The observational signatures\nsuggest that the cavities observed in the disks around UXTau A, LkCa15, and\nRXJ1615 could potentially originate from a dust trap created by a companion.\nConversely, in the disks around CQTau, SR24S, DMTau, the origin of the cavity\nremains unclear, although it is compatible with a pressure bump and grain\ngrowth within the cavity.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}