{"id":"2408.00170","title":"CREW: Facilitating Human-AI Teaming Research","authors":"Lingyu Zhang, Zhengran Ji, Boyuan Chen","authorsParsed":[["Zhang","Lingyu",""],["Ji","Zhengran",""],["Chen","Boyuan",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 21:43:55 GMT"}],"updateDate":"2024-08-02","timestamp":1722462235000,"abstract":"  With the increasing deployment of artificial intelligence (AI) technologies,\nthe potential of humans working with AI agents has been growing at a great\nspeed. Human-AI teaming is an important paradigm for studying various aspects\nwhen humans and AI agents work together. The unique aspect of Human-AI teaming\nresearch is the need to jointly study humans and AI agents, demanding\nmultidisciplinary research efforts from machine learning to human-computer\ninteraction, robotics, cognitive science, neuroscience, psychology, social\nscience, and complex systems. However, existing platforms for Human-AI teaming\nresearch are limited, often supporting oversimplified scenarios and a single\ntask, or specifically focusing on either human-teaming research or multi-agent\nAI algorithms. We introduce CREW, a platform to facilitate Human-AI teaming\nresearch and engage collaborations from multiple scientific disciplines, with a\nstrong emphasis on human involvement. It includes pre-built tasks for cognitive\nstudies and Human-AI teaming with expandable potentials from our modular\ndesign. Following conventional cognitive neuroscience research, CREW also\nsupports multimodal human physiological signal recording for behavior analysis.\nMoreover, CREW benchmarks real-time human-guided reinforcement learning agents\nusing state-of-the-art algorithms and well-tuned baselines. With CREW, we were\nable to conduct 50 human subject studies within a week to verify the\neffectiveness of our benchmark.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}