{"id":"2408.04025","title":"Variable, circularly polarized radio emission from the Young Stellar\n  Object [BHB2007]-1: another ingredient of a unique system","authors":"Simranpreet Kaur, Josep M. Girart, Daniele Vigan\\`o, \\'Alvaro\n  S\\'anchez Monge, L. Ilsedore Cleeves, Alice Zurlo, Fabio Del Sordo, \\`Oscar\n  Morata, Trisha Bhowmik, Felipe O. Alves","authorsParsed":[["Kaur","Simranpreet",""],["Girart","Josep M.",""],["Viganò","Daniele",""],["Monge","Álvaro Sánchez",""],["Cleeves","L. Ilsedore",""],["Zurlo","Alice",""],["Del Sordo","Fabio",""],["Morata","Òscar",""],["Bhowmik","Trisha",""],["Alves","Felipe O.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 18:17:46 GMT"}],"updateDate":"2024-08-09","timestamp":1723054666000,"abstract":"  The young stellar object [BHB2007]-1 has been extensively studied in the past\nat radio, millimeter, and infrared wavelengths. It shows a gap in the disk and\nprevious observations claimed the possible emission from a forming sub-stellar\nobject, in correspondence to the disk gap. Here, we analyze a set of 8 Karl\nJansky Very Large Array (VLA) observations at 15 GHz and spread over a month.\nWe infer a slowly variable emission from the star, with a $\\sim 15 \\text{-}\n20\\%$ circular polarization detected in two of the eight observations. The\nlatter can be related to the magnetic fields in the system, while the\nunpolarized and moderately varying component can be indicative of free-free\nemission associated with jet induced shocks or interaction of the stellar wind\nwith dense surrounding material. We discard any relevant short flaring\nactivities when sampling the radio light curves down to 10 seconds and find no\nclear evidence of emission from the sub-stellar object inferred from past\nobservations, although deeper observations could shed further light on this.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VsCJDq41Gwv40ombKmBP_4dSKWn-CIU1FtTSsKYHNJE","pdfSize":"6537492"}
