{"id":"2408.02638","title":"The Kraft Break Sharply Divides Low Mass and Intermediate Mass Stars","authors":"Alexa C. Beyer and Russel J. White","authorsParsed":[["Beyer","Alexa C.",""],["White","Russel J.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 17:01:53 GMT"}],"updateDate":"2024-08-06","timestamp":1722877313000,"abstract":"  Main sequence stars transition at mid-F spectral types from slowly rotating\n(cooler stars) to rapidly rotating (hotter stars), a transition known as the\nKraft Break (Kraft 1967) and attributed the disappearance of the outer\nconvective envelope, causing magnetic braking to become ineffective. To define\nthis Break more precisely, we assembled spectroscopic measurements of 405 F\nstars within 33.33 pc. Once young, evolved and candidate binary stars are\nremoved, the distribution of projected rotational velocities shows the Break to\nbe well-defined and relatively sharp. Nearly all stars redder than G_BP-G_RP =\n0.60 mag are slowly rotating (vsini < 20 km/s), while only 4 of 40 stars bluer\nthan G_BP-G_RP = 0.54 mag are slowly rotating, consistent with that expected\nfor a random distribution of inclinations. The Break is centered at an\neffective temperature of 6550 K and has a width of about 200 K, corresponding\nto a mass range of 1.32 - 1.41 M_Sun. The Break is ~450 K hotter than the\nstellar temperature at which hot Jupiters show a change in their obliquity\ndistribution, often attributed to tidal realignment. The Break, as defined\nabove, is nearly but not fully established in the ~650 Myr Hyades cluster; it\nshould be established in populations older than 1 Gyr. We propose that the\nKraft Break provides a more useful division, for both professional and\npedagogical purposes, between what are called low mass stars and intermediate\nmass stars; the Kraft Break is observationally well-defined and is linked to a\nchange in stellar structure.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5eBLMd4P3IpmC-7htay6XKPQuhVTuIZ1Uq-sNv5zWNI","pdfSize":"861663","txDigest":"JDREvmXbfXA9Y1EUbX2VYTyvYESTrKq7YvL5rpjwvFwB","endEpoch":"1","status":"CERTIFIED"}
