{"id":"2408.01525","title":"Gravitational-Wave and Gravitational-Wave Memory Signatures of\n  Core-Collapse Supernovae","authors":"Lyla Choi, Adam Burrows, David Vartanyan","authorsParsed":[["Choi","Lyla",""],["Burrows","Adam",""],["Vartanyan","David",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 18:35:58 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 04:32:18 GMT"}],"updateDate":"2024-08-29","timestamp":1722623758000,"abstract":"  In this paper, we calculate the energy, signal-to-noise ratio, detection\nrange, and angular anisotropy of the matter, matter memory, and neutrino memory\ngravitational wave (GW) signatures of 21 three-dimensional initially\nnon-rotating core-collapse supernova (CCSN) models carried to late times. We\nfind that inferred energy, signal-to-noise ratio, and detection range are\nangle-dependent quantities, and that the spread of possible energy,\nsignal-to-noise, and detection ranges across all viewing angles generally\nincreases with progenitor mass. When examining the low-frequency matter memory\nand neutrino memory components of the signal, we find that the neutrino memory\nis the most detectable component of a CCSN GW signal, and that DECIGO is\nbest-equipped to detect both matter memory and neutrino memory. Moreover, we\nfind that the polarization angle between the $h_+$ and $h_{\\times}$ strains\nserves as a unique identifier of matter and neutrino memory. Finally, we\ndevelop a galactic density- and stellar mass-weighted formalism to calculate\nthe rate at which we can expect to detect CCSN GW signals with Advanced LIGO.\nWhen considering only the matter component of the signal, the aLIGO detection\nrate is around 65$\\%$ of the total galactic supernova rate, but increases to\n90$\\%$ when incorporating the neutrino memory component. We find that all\nfuture detectors (ET, CE, DECIGO) will be able to detect CCSN GW signals from\nthe entire galaxy, and for the higher-mass progenitors even into the local\ngroup of galaxies.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}