{"id":"2408.13782","title":"Batch-FPM: Random batch-update multi-parameter physical Fourier\n  ptychography neural network","authors":"Ruiqing Sun, Delong Yang, Yiyan Su, Shaohui Zhang, and Qun Hao","authorsParsed":[["Sun","Ruiqing",""],["Yang","Delong",""],["Su","Yiyan",""],["Zhang","Shaohui",""],["Hao","Qun",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 09:24:18 GMT"}],"updateDate":"2024-08-27","timestamp":1724577858000,"abstract":"  Fourier Ptychographic Microscopy (FPM) is a computational imaging technique\nthat enables high-resolution imaging over a large field of view. However, its\napplication in the biomedical field has been limited due to the long image\nreconstruction time and poor noise robustness. In this paper, we propose a fast\nand robust FPM reconstruction method based on physical neural networks with\nbatch update stochastic gradient descent (SGD) optimization strategy, capable\nof achieving attractive results with low single-to-noise ratio and correcting\nmultiple system parameters simultaneously. Our method leverages a random batch\noptimization approach, breaks away from the fixed sequential iterative order\nand gives greater attention to high-frequency information. The proposed method\nhas better convergence performance even for low signal-to-noise ratio data\nsets, such as low exposure time dark-field images. As a result, it can greatly\nincrease the image recording and result reconstruction speed without any\nadditional hardware modifications. By utilizing advanced deep learning\noptimizers and perform parallel computational scheme, our method enhances GPU\ncomputational efficiency, significantly reducing reconstruction costs.\nExperimental results demonstrate that our method achieves near real-time\ndigital refocusing of a 1024 x 1024 pixels region of interest on consumer-grade\nGPUs. This approach significantly improves temporal resolution (by reducing the\nexposure time of dark-field images), noise resistance, and reconstruction\nspeed, and therefore can efficiently promote the practical application of FPM\nin clinical diagnostics, digital pathology, and biomedical research, etc. In\naddition, we believe our algorithm scheme can help researchers quickly validate\nand implement FPM-related ideas. We invite requests for the full code via\nemail.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}