{"id":"2408.07860","title":"A Novel Generative Artificial Intelligence Method for Interference Study\n  on Multiplex Brightfield Immunohistochemistry Images","authors":"Satarupa Mukherjee, Jim Martin, Yao Nie","authorsParsed":[["Mukherjee","Satarupa",""],["Martin","Jim",""],["Nie","Yao",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 00:17:00 GMT"}],"updateDate":"2024-08-16","timestamp":1723681020000,"abstract":"  Multiplex brightfield imaging offers the advantage of simultaneously\nanalyzing multiple biomarkers on a single slide, as opposed to single biomarker\nlabeling on multiple consecutive slides. To accurately analyze multiple\nbiomarkers localized at the same cellular compartment, two representative\nbiomarker sets were selected as assay models - cMET-PDL1-EGFR and\nCD8-LAG3-PDL1, where all three biomarkers can co-localize on the cell membrane.\nOne of the most crucial preliminary stages for analyzing such assay is\nidentifying each unique chromogen on individual cells. This is a challenging\nproblem due to the co-localization of membrane stains from all the three\nbiomarkers. It requires advanced color unmixing for creating the equivalent\nsingleplex images from each triplex image for each biomarker.\n  In this project, we developed a cycle-Generative Adversarial Network\n(cycle-GAN) method for unmixing the triplex images generated from the\nabove-mentioned assays. Three different models were designed to generate the\nsingleplex image for each of the three stains Tamra (purple), QM-Dabsyl\n(yellow) and Green. A notable novelty of our approach was that the input to the\nnetwork were images in the optical density domain instead of conventionally\nused RGB images. The use of the optical density domain helped in reducing the\nblurriness of the synthetic singleplex images, which was often observed when\nthe network was trained on RGB images.\n  The cycle-GAN models were validated on 10,800 lung, gastric and colon images\nfor the cMET-PDL1-EGFR assay and 3600 colon images for the CD8-LAG3-PDL1 assay.\nVisual as well as quantified assessments demonstrated that the proposed method\nis effective and efficient when compared with the manual reviewing results and\nis readily applicable to various multiplex assays.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}