{"id":"2408.13512","title":"Unleashing Collaborative Computing for Adaptive Video Streaming with\n  Multi-objective Optimization in Satellite Terrestrial Networks","authors":"Zhishu Shen, Qiushi Zheng, Ziqi Rong, Jiong Jin, Atsushi Tagami, Wei\n  Xiang","authorsParsed":[["Shen","Zhishu",""],["Zheng","Qiushi",""],["Rong","Ziqi",""],["Jin","Jiong",""],["Tagami","Atsushi",""],["Xiang","Wei",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 08:19:24 GMT"}],"updateDate":"2024-08-27","timestamp":1724487564000,"abstract":"  Satellite-terrestrial networks (STNs) are anticipated to deliver seamless IoT\nservices across expansive regions. Given the constrained resources available\nfor offloading computationally intensive tasks like video streaming, it is\ncrucial to establish collaborative computing among diverse components within\nSTNs. In this paper, we present the task offloading challenge as a\nmulti-objective optimization problem, leveraging the collaboration between\nground devices/users and satellites. We propose a collaborative computing\nscheme that optimally assigns computing tasks to various nodes within STNs to\nenhance service performance including quality of experience (QoE). This\nalgorithm initially dynamically selects an end-to-end path that balances\nservice time and resource utilization. For each selected path, a multi-agent\nsoft actor-critic (MA-SAC)-based algorithm is introduced to make adaptive\ndecisions and collaboratively assign optimal heterogeneous resources to the\ngiven computing tasks. In this algorithm, the ground station bridging satellite\nnetwork and terrestrial network is treated as agent to extract the information\nfrom both STNs and users. Through MA-SAC, multiple agents cooperate to\ndetermine the adaptive bitrate and network resources for the arriving tasks.\nThe numerical results demonstrate that our proposal outperforms comparative\nschemes across various computing tasks in terms of various criteria.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}