{"id":"2408.14346","title":"From irregular to regular eutectic growth in the Al-Al3Ni system: in\n  situ observations during directional solidification","authors":"Paul Chao, Shanmukha Kiran Aramanda, Xianghui Xiao, Sabine\n  Bottin-Rousseau, Silv\\`ere Akamatsu, Ashwin J. Shahani","authorsParsed":[["Chao","Paul",""],["Aramanda","Shanmukha Kiran",""],["Xiao","Xianghui",""],["Bottin-Rousseau","Sabine",""],["Akamatsu","Silvère",""],["Shahani","Ashwin J.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 15:21:30 GMT"}],"updateDate":"2024-08-27","timestamp":1724685690000,"abstract":"  We investigate the irregular eutectic growth dynamics of the Al-Al3Ni alloy,\nin which one of the solid phases (Al3Ni) grows faceted from the liquid.\nLeveraging in situ optical microscopy and synchrotron transmission x-ray\nmicroscopy, we address the question of the degree of coupling between Al and\nAl3Ni at the growth front and that of the shape of the microstructures left\nbehind in the bulk solid during directional solidification. Real-time optical\nobservations bring evidence for a morphological transition from a\neutectic-grain dependent, irregular eutectic growth at low solidification\nvelocity V (typically 1 ${\\mu}ms^{-1}$), to a weakly anisotropic, regular\ngrowth at higher V (reaching 10 ${\\mu}ms^{-1}$). Unprecedented x-ray\nnano-imaging of the solid-liquid interface, and 3D characterization of the\ngrowth patterns, were made possible by a new Directional Solidification (DS)\nsetup at Brookhaven National Laboratory's NSLS-II. At low V, the leading tips\nof partly faceted Al3Ni crystals are observed to grow not far ahead of the Al\ngrowth front. Correlating in situ images and postmortem 3D tomographic\nreconstructions reveals that the presence of faceted and non-faceted regions of\nAl3Ni crystals in the solid is a direct consequence of coupling and decoupling\nduring DS, respectively. Upon increasing V , the lead distance of Al3Ni\nvanishes, and the shape of Al3Ni ceases to be governed by faceted growth. These\nobservations shed light on the basic mechanisms (faceted growth, diffusive\ncoupling, and the dynamics of trijunctions) governing the transition from\nfaceted to rod-like growth upon increasing V in the Al3Ni system, with broad\nimplications for a large class of irregular eutectics.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Other Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}