{"id":"2408.11982","title":"AIM 2024 Challenge on Compressed Video Quality Assessment: Methods and\n  Results","authors":"Maksim Smirnov, Aleksandr Gushchin, Anastasia Antsiferova, Dmitry\n  Vatolin, Radu Timofte, Ziheng Jia, Zicheng Zhang, Wei Sun, Jiaying Qian,\n  Yuqin Cao, Yinan Sun, Yuxin Zhu, Xiongkuo Min, Guangtao Zhai, Kanjar De, Qing\n  Luo, Ao-Xiang Zhang, Peng Zhang, Haibo Lei, Linyan Jiang, Yaqing Li, Wenhui\n  Meng, Xiaoheng Tan, Haiqiang Wang, Xiaozhong Xu, Shan Liu, Zhenzhong Chen,\n  Zhengxue Cheng, Jiahao Xiao, Jun Xu, Chenlong He, Qi Zheng, Ruoxi Zhu, Min\n  Li, Yibo Fan, and Zhengzhong Tu","authorsParsed":[["Smirnov","Maksim",""],["Gushchin","Aleksandr",""],["Antsiferova","Anastasia",""],["Vatolin","Dmitry",""],["Timofte","Radu",""],["Jia","Ziheng",""],["Zhang","Zicheng",""],["Sun","Wei",""],["Qian","Jiaying",""],["Cao","Yuqin",""],["Sun","Yinan",""],["Zhu","Yuxin",""],["Min","Xiongkuo",""],["Zhai","Guangtao",""],["De","Kanjar",""],["Luo","Qing",""],["Zhang","Ao-Xiang",""],["Zhang","Peng",""],["Lei","Haibo",""],["Jiang","Linyan",""],["Li","Yaqing",""],["Meng","Wenhui",""],["Tan","Xiaoheng",""],["Wang","Haiqiang",""],["Xu","Xiaozhong",""],["Liu","Shan",""],["Chen","Zhenzhong",""],["Cheng","Zhengxue",""],["Xiao","Jiahao",""],["Xu","Jun",""],["He","Chenlong",""],["Zheng","Qi",""],["Zhu","Ruoxi",""],["Li","Min",""],["Fan","Yibo",""],["Tu","Zhengzhong",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 20:32:45 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 11:01:16 GMT"}],"updateDate":"2024-08-29","timestamp":1724272365000,"abstract":"  Video quality assessment (VQA) is a crucial task in the development of video\ncompression standards, as it directly impacts the viewer experience. This paper\npresents the results of the Compressed Video Quality Assessment challenge, held\nin conjunction with the Advances in Image Manipulation (AIM) workshop at ECCV\n2024. The challenge aimed to evaluate the performance of VQA methods on a\ndiverse dataset of 459 videos, encoded with 14 codecs of various compression\nstandards (AVC/H.264, HEVC/H.265, AV1, and VVC/H.266) and containing a\ncomprehensive collection of compression artifacts. To measure the methods\nperformance, we employed traditional correlation coefficients between their\npredictions and subjective scores, which were collected via large-scale\ncrowdsourced pairwise human comparisons. For training purposes, participants\nwere provided with the Compressed Video Quality Assessment Dataset (CVQAD), a\npreviously developed dataset of 1022 videos. Up to 30 participating teams\nregistered for the challenge, while we report the results of 6 teams, which\nsubmitted valid final solutions and code for reproducing the results. Moreover,\nwe calculated and present the performance of state-of-the-art VQA methods on\nthe developed dataset, providing a comprehensive benchmark for future research.\nThe dataset, results, and online leaderboard are publicly available at\nhttps://challenges.videoprocessing.ai/challenges/compressedvideo-quality-assessment.html.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}