{"id":"2408.15060","title":"Understanding the Adjoint Method in Seismology: Theory and\n  Implementation in the Time Domain","authors":"Rafael Abreu","authorsParsed":[["Abreu","Rafael",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 13:45:10 GMT"}],"updateDate":"2024-08-28","timestamp":1724766310000,"abstract":"  The adjoint method is a popular method used for seismic (full-waveform)\ninversion today. The method is considered to give more realistic and detailed\nimages of the interior of the Earth by the use of more realistic physics. It\nrelies on the definition of an adjoint wavefield (hence its name) that is the\ntime reversed synthetics that satisfy the original equations of motion. The\nphysical justification of the nature of the adjoint wavefield is, however,\ncommonly done by brute force with ad hoc assumptions and/or relying on the\nexistence of Green's functions, the representation theorem and/or the Born\napproximation. Using variational principles only, and without these mentioned\nassumptions and/or additional mathematical tools, we show that the time\nreversed adjoint wavefield should be defined as a premise that leads to the\ncorrect adjoint equations. This allows us to clarify mathematical\ninconsistencies found in previous seminal works when dealing with visco-elastic\nattenuation and/or odd-order derivative terms in the equation of motion. We\nthen discuss some methodologies for the numerical implementation of the method\nin the time domain and to present a variational formulation for the\nconstruction of different misfit functions. We here define a new misfit\ntravel-time function that allows us to find consensus for the long-standing\ndebate on the zero sensitivity along the ray path that cross-correlation\ntravel-time measurements show. In fact, we prove that the zero sensitivity\nalong the ray-path appears as a consequence of the assumption on the similarity\nbetween data and synthetics required to perform cross-correlation travel-time\nmeasurements. When no assumption between data and synthetics is preconceived,\ntravel-time Frechet kernels show an extremum along the ray path as one\nintuitively would expect.\n","subjects":["Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}