{"id":"2408.00115","title":"Numerical Study of Quantum Oscillations of the Quasiparticle Lifetime:\n  Impurity Spectroscopy, Novel Electric Field and Strain Effects","authors":"Valentin Leeb, Johannes Knolle","authorsParsed":[["Leeb","Valentin",""],["Knolle","Johannes",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:52:59 GMT"}],"updateDate":"2024-08-02","timestamp":1722451979000,"abstract":"  Quantum oscillation (QOs) measurements constitute one of the most powerful\nmethods for determining the Fermi surface (FS) of metals, exploiting the famous\nOnsager relation between the FS area and the QO frequency. The recent\nobservation of non-Onsager QOs with a frequency set by the difference of two FS\norbits in a bulk three-dimensional metal can be understood as the QO of the\nquasiparticle lifetime (QPL) due to interorbital scattering [Huber, Leeb, {\\it\net al.}, Nature 621 (2023)]. QPL oscillations (QPLOs) generalize\nmagneto-intersubband oscillations (MISOs) known from coupled two-dimensional\nmetals. They may provide a novel tool for extracting otherwise hard-to-measure\nintra-versus interband scattering times of quasiparticles. Here, we provide a\nnumerical lattice study of QPLOs comparing transport and thermodynamic\nobservables. We explore the effect of different imperfections like general\nimpurities, Hall effect-induced electric fields, various forms of strain from\nbending, and magnetic field inhomogeneities. We confirm the basic phenomenology\nof QPLOs as predicted in analytical calculations and identify additional novel,\nnon-perturbative features. Remarkably, we find that some imperfections can\nstabilize, or even enhance, non-Onsager QPLOs in contrast to standard QO\nfrequencies. We discuss various avenues for identifying QPLOs in experiments\nand how to use their dependence on imperfections to extract material\nproperties.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Disordered Systems and Neural Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wnvKPDHRC_4FL8k1v0WajsnPSWFi-GXWELKELvLMjxM","pdfSize":"5465933","txDigest":"H9aer1BQkdkMdhcewLX3HtW8nXS6ZNhB9VBFrEtcyd7R","endEpoch":"100","status":"CERTIFIED"}
