{"id":"2408.07246","title":"ChemVLM: Exploring the Power of Multimodal Large Language Models in\n  Chemistry Area","authors":"Junxian Li, Di Zhang, Xunzhi Wang, Zeying Hao, Jingdi Lei, Qian Tan,\n  Cai Zhou, Wei Liu, Yaotian Yang, Xinrui Xiong, Weiyun Wang, Zhe Chen, Wenhai\n  Wang, Wei Li, Shufei Zhang, Mao Su, Wanli Ouyang, Yuqiang Li, Dongzhan Zhou","authorsParsed":[["Li","Junxian",""],["Zhang","Di",""],["Wang","Xunzhi",""],["Hao","Zeying",""],["Lei","Jingdi",""],["Tan","Qian",""],["Zhou","Cai",""],["Liu","Wei",""],["Yang","Yaotian",""],["Xiong","Xinrui",""],["Wang","Weiyun",""],["Chen","Zhe",""],["Wang","Wenhai",""],["Li","Wei",""],["Zhang","Shufei",""],["Su","Mao",""],["Ouyang","Wanli",""],["Li","Yuqiang",""],["Zhou","Dongzhan",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 01:16:40 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 16:46:32 GMT"}],"updateDate":"2024-08-19","timestamp":1723598200000,"abstract":"  Large Language Models (LLMs) have achieved remarkable success and have been\napplied across various scientific fields, including chemistry. However, many\nchemical tasks require the processing of visual information, which cannot be\nsuccessfully handled by existing chemical LLMs. This brings a growing need for\nmodels capable of integrating multimodal information in the chemical domain. In\nthis paper, we introduce \\textbf{ChemVLM}, an open-source chemical multimodal\nlarge language model specifically designed for chemical applications. ChemVLM\nis trained on a carefully curated bilingual multimodal dataset that enhances\nits ability to understand both textual and visual chemical information,\nincluding molecular structures, reactions, and chemistry examination questions.\nWe develop three datasets for comprehensive evaluation, tailored to Chemical\nOptical Character Recognition (OCR), Multimodal Chemical Reasoning (MMCR), and\nMultimodal Molecule Understanding tasks. We benchmark ChemVLM against a range\nof open-source and proprietary multimodal large language models on various\ntasks. Experimental results demonstrate that ChemVLM achieves competitive\nperformance across all evaluated tasks. Our model can be found at\nhttps://huggingface.co/AI4Chem/ChemVLM-26B.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}