{"id":"2408.02170","title":"Searching for Neutral Hydrogen Escape from the 120 Myr Old Sub-Neptune\n  HIP94235b using HST","authors":"Ava Morrissey, George Zhou, Chelsea X. Huang, Duncan Wright, Caitlin\n  Auger, Keighley E. Rockcliffe, Elisabeth R. Newton, James G. Rogers, Neale\n  Gibson, Nataliea Lowson, Laura C. Mayorga, Robert A. Wittenmyer","authorsParsed":[["Morrissey","Ava",""],["Zhou","George",""],["Huang","Chelsea X.",""],["Wright","Duncan",""],["Auger","Caitlin",""],["Rockcliffe","Keighley E.",""],["Newton","Elisabeth R.",""],["Rogers","James G.",""],["Gibson","Neale",""],["Lowson","Nataliea",""],["Mayorga","Laura C.",""],["Wittenmyer","Robert A.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 00:19:55 GMT"}],"updateDate":"2024-08-06","timestamp":1722817195000,"abstract":"  HIP94235 b, a 120 Myr old sub-Neptune, provides us the unique opportunity to\nstudy mass loss at a pivotal stage of the system's evolution: the end of a 100\nmillion year (Myr) old phase of intense XUV irradiation. We present two\nobservations of HIP94235 b using the Hubble Space Telescope's Space Telescope\nImaging Spectrograph (HST/STIS) in the Ly-alpha wavelength region. We do not\nobserve discernible differences across either the blue and red wings of the\nLy-alpha line profile in and out of transit, and report no significant\ndetection of outflowing neutral hydrogen around the planet. We constrain the\nrate of neutral hydrogen escaping HIP94235 b to an upper limit of 10^13 g/s,\nwhich remains consistent with energy-limited model predictions of 10^11 g/s.\nThe Ly-alpha non-detection is likely due to the extremely short photoionization\ntimescale of the neutral hydrogen escaping the planet's atmosphere. This\ntimescale, approximately 15 minutes, is significantly shorter than that of any\nother planets with STIS observations. Through energy-limited mass loss models,\nwe anticipate that HIP94235 b will transition into a super-Earth within a\ntimescale of 1 Gyr.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lfgrmTWnKqt6iIlrFjzpe5AzCPao4EIAIQaY9IJscmQ","pdfSize":"4937631"}
