{"id":"2408.14586","title":"Optical and Radio Analysis of Systemically Classified Broad-lined Type\n  Ic Supernovae from the Zwicky Transient Facility","authors":"Gokul P. Srinivasaragavan, Sheng Yang, Shreya Anand, Jesper Sollerman,\n  Anna Y. Q. Ho, Alessandra Corsi, S. Bradley Cenko, Daniel Perley, Steve\n  Schulze, Marquice Sanchez-Fleming, Jack Pope, Nikhil Sarin, Conor Omand,\n  Kaustav K. Das, Christoffer Fremling, Igor Andreoni, Rachel Bruch, Kevin B.\n  Burdge, Kishalay De, Avishay Gal-Yam, Anjasha Gangopadhyay, Matthew J.\n  Graham, Jacob E. Jencson, Viraj Karambelkar, Mansi M. Kasliwal, S. R.\n  Kulkarni, Julia Martikainen, Yashvi S. Sharma, Anastasios Tzanidakis, Lin\n  Yan, Yuhan Yao, Eric C. Bellm, Steven L. Groom, Frank J. Masci, Guy Nir,\n  Josiah Purdum, Roger Smith, Niharika Sravan","authorsParsed":[["Srinivasaragavan","Gokul P.",""],["Yang","Sheng",""],["Anand","Shreya",""],["Sollerman","Jesper",""],["Ho","Anna Y. Q.",""],["Corsi","Alessandra",""],["Cenko","S. Bradley",""],["Perley","Daniel",""],["Schulze","Steve",""],["Sanchez-Fleming","Marquice",""],["Pope","Jack",""],["Sarin","Nikhil",""],["Omand","Conor",""],["Das","Kaustav K.",""],["Fremling","Christoffer",""],["Andreoni","Igor",""],["Bruch","Rachel",""],["Burdge","Kevin B.",""],["De","Kishalay",""],["Gal-Yam","Avishay",""],["Gangopadhyay","Anjasha",""],["Graham","Matthew J.",""],["Jencson","Jacob E.",""],["Karambelkar","Viraj",""],["Kasliwal","Mansi M.",""],["Kulkarni","S. R.",""],["Martikainen","Julia",""],["Sharma","Yashvi S.",""],["Tzanidakis","Anastasios",""],["Yan","Lin",""],["Yao","Yuhan",""],["Bellm","Eric C.",""],["Groom","Steven L.",""],["Masci","Frank J.",""],["Nir","Guy",""],["Purdum","Josiah",""],["Smith","Roger",""],["Sravan","Niharika",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 19:09:47 GMT"}],"updateDate":"2024-08-28","timestamp":1724699387000,"abstract":"  We study a magnitude-limited sample of 36 Broad-lined Type Ic Supernovae (SNe\nIc-BL) from the Zwicky Transient Facility Bright Transient Survey, detected\nbetween March 2018 and August 2021. We present the light curves (LCs) for each\nof the SNe, and analyze the shape of the LCs to derive empirical parameters,\nalong with the explosion epochs for every event. The sample has an average\nabsolute peak magnitude in the r band of $M_r^{max}$ = -18.51 $\\pm$ 0.15 mag.\nUsing spectra obtained around peak light, we compute expansion velocities from\nthe Fe II 5169 Angstrom line for each event with high enough signal-to-noise\nratio spectra, and find an average value of $v_{ph}$ = 16,100 $\\pm$ 1,100 km\n$s^{-1}$. We also compute bolometric LCs, study the blackbody temperature and\nradii evolution over time, and derive the explosion properties of the SNe. The\nexplosion properties of the sample have average values of $M_{Ni}$ =\n$0.37_{-0.06}^{+0.08}$ solar masses, $M_{ej}$ = $2.45_{-0.41}^{+0.47}$ solar\nmasses, and $E_K$= $4.02_{-1.00}^{+1.37} \\times 10^{51}$ erg. Thirteen events\nhave radio observations from the Very Large Array, with 8 detections and 5\nnon-detections. We find that the populations that have radio detections and\nradio non-detections are indistinct from one another with respect to their\noptically-inferred explosion properties, and there are no statistically\nsignificant correlations present between the events' radio luminosities and\noptically-inferred explosion properties. This provides evidence that the\nexplosion properties derived from optical data alone cannot give inferences\nabout the radio properties of SNe Ic-BL, and likely their relativistic jet\nformation mechanisms.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}