{"id":"2408.08276","title":"Marker or Markerless? Mode-Switchable Optical Tactile Sensing for\n  Diverse Robot Tasks","authors":"Ni Ou, Zhuo Chen, Shan Luo","authorsParsed":[["Ou","Ni",""],["Chen","Zhuo",""],["Luo","Shan",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 17:21:21 GMT"}],"updateDate":"2024-08-16","timestamp":1723742481000,"abstract":"  Optical tactile sensors play a pivotal role in robot perception and\nmanipulation tasks. The membrane of these sensors can be painted with markers\nor remain markerless, enabling them to function in either marker or markerless\nmode. However, this uni-modal selection means the sensor is only suitable for\neither manipulation or perception tasks. While markers are vital for\nmanipulation, they can also obstruct the camera, thereby impeding perception.\nThe dilemma of selecting between marker and markerless modes presents a\nsignificant obstacle. To address this issue, we propose a novel mode-switchable\noptical tactile sensing approach that facilitates transitions between the two\nmodes. The marker-to-markerless transition is achieved through a generative\nmodel, whereas its inverse transition is realized using a sparsely supervised\nregressive model. Our approach allows a single-mode optical sensor to operate\neffectively in both marker and markerless modes without the need for additional\nhardware, making it well-suited for both perception and manipulation tasks.\nExtensive experiments validate the effectiveness of our method. For perception\ntasks, our approach decreases the number of categories that include\nmisclassified samples by 2 and improves contact area segmentation IoU by 3.53%.\nFor manipulation tasks, our method attains a high success rate of 92.59% in\nslip detection. Code, dataset and demo videos are available at the project\nwebsite: https://gitouni.github.io/Marker-Markerless-Transition/\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}