{"id":"2408.04922","title":"UAV-Enhanced Combination to Application: Comprehensive Analysis and\n  Benchmarking of a Human Detection Dataset for Disaster Scenarios","authors":"Ragib Amin Nihal, Benjamin Yen, Katsutoshi Itoyama, Kazuhiro Nakadai","authorsParsed":[["Nihal","Ragib Amin",""],["Yen","Benjamin",""],["Itoyama","Katsutoshi",""],["Nakadai","Kazuhiro",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 08:07:19 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 18:01:25 GMT"}],"updateDate":"2024-08-27","timestamp":1723190839000,"abstract":"  Unmanned aerial vehicles (UAVs) have revolutionized search and rescue (SAR)\noperations, but the lack of specialized human detection datasets for training\nmachine learning models poses a significant challenge.To address this gap, this\npaper introduces the Combination to Application (C2A) dataset, synthesized by\noverlaying human poses onto UAV-captured disaster scenes. Through extensive\nexperimentation with state-of-the-art detection models, we demonstrate that\nmodels fine-tuned on the C2A dataset exhibit substantial performance\nimprovements compared to those pre-trained on generic aerial datasets.\nFurthermore, we highlight the importance of combining the C2A dataset with\ngeneral human datasets to achieve optimal performance and generalization across\nvarious scenarios. This points out the crucial need for a tailored dataset to\nenhance the effectiveness of SAR operations. Our contributions also include\ndeveloping dataset creation pipeline and integrating diverse human poses and\ndisaster scenes information to assess the severity of disaster scenarios. Our\nfindings advocate for future developments, to ensure that SAR operations\nbenefit from the most realistic and effective AI-assisted interventions\npossible.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}