{"id":"2408.12341","title":"Interacting dark sector from Horndeski theories and beyond: Mapping\n  fields and fluids","authors":"Pulkit Bansal (IIT Bombay), Joseph P Johnson (IISER Mohali), and S.\n  Shankaranarayanan (IIT Bombay)","authorsParsed":[["Bansal","Pulkit","","IIT Bombay"],["Johnson","Joseph P","","IISER Mohali"],["Shankaranarayanan","S.","","IIT Bombay"]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 12:36:12 GMT"}],"updateDate":"2024-08-23","timestamp":1724330172000,"abstract":"  In Cosmology, when dissipative effects are minimal, the energy content of the\nUniverse can be effectively described as a sum of perfect fluids. Perfect fluid\ndescriptions ensure thermal equilibrium since they equilibrate immediately.\nHowever, interactions among different energy content of the Universe might\nprevent such rapid equilibration. This limitation calls for a more fundamental\nframework that incorporates these interactions directly at the level of the\naction. In earlier work, two of the authors demonstrated that an interacting\ndark energy (DE)-dark matter (DM) field theory action could be derived from a\nmodified gravity action via a conformal transformation, establishing a\none-to-one correspondence between the field theory action and fluid for a\nunique interaction term [arXiv:2006.04618]. In this work, we extend that\nanalysis by considering quadratic order Horndeski gravity, identifying two\nclasses of models: field coupling and field-kinetic coupling. Our approach\ngeneralizes the coupling function for DE-DM interactions by incorporating an\nadditional dependence on kinetic terms. We establish a field-to-fluid mapping\nfor dark matter and find that this mapping only holds for a specific form of\nthe interaction strength. Interestingly, we show that this interaction strength\nexcludes non-gravitational interactions between dark energy and dark radiation.\nNumerical analysis reveals that purely kinetic interactions within the dark\nsector can significantly alter cosmological evolution compared to\nnon-interacting scenarios, highlighting the strong dependence of cosmological\ndynamics on coupling strength. A preliminary examination of linear scalar\nperturbations indicates that the field-kinetic coupling results in a non-zero\ngravitational slip parameter and momentum exchange.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/"}