{"id":"2408.09218","title":"FQGA-single: Towards Fewer Training Epochs and Fewer Model Parameters\n  for Image-to-Image Translation Tasks","authors":"Cho Yang","authorsParsed":[["Yang","Cho",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 14:55:15 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 08:46:37 GMT"},{"version":"v3","created":"Thu, 22 Aug 2024 11:23:27 GMT"}],"updateDate":"2024-08-23","timestamp":1723906515000,"abstract":"  CycleGAN was trained on SynthRAD Grand Challenge Dataset using the\nsingle-epoch modification (SEM) method proposed in this paper which is referred\nto as (CycleGAN-single) compared to the usual method of training CycleGAN on\naround 200 epochs (CycleGAN-multi). Model performance were evaluated\nqualitatively and quantitatively with quantitative performance metrics like\nPSNR, SSIM, MAE and MSE. The consideration of both quantitative and qualitative\nperformance when evaluating a model is unique to certain image-to-image\ntranslation tasks like medical imaging of patient data as detailed in this\npaper. Also, this paper shows that good quantitative performance does not\nalways imply good qualitative performance and the converse is also not always\nTrue (i.e. good qualitative performance does not always imply good quantitative\nperformance). This paper also proposes a lightweight model called FQGA (Fast\nPaired Image-to-Image Translation Quarter-Generator Adversary) which has 1/4\nthe number of parameters compared to CycleGAN (when comparing their Generator\nModels). FQGA outperforms CycleGAN qualitatively and quantitatively even only\nafter training on 20 epochs. Finally, using SEM method on FQGA allowed it to\nagain outperform CycleGAN both quantitatively and qualitatively. These\nperformance gains even with fewer model parameters and fewer epochs (which will\nresult in time and computational savings) may also be applicable to other\nimage-to-image translation tasks in Machine Learning apart from the Medical\nimage-translation task discussed in this paper between Cone Beam Computed\nTomography (CBCT) and Computed Tomography (CT) images.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}