{"id":"2408.01544","title":"Momentum Capture and Prediction System Based on Wimbledon Open2023\n  Tournament Data","authors":"Chang Liu, Tongyuan Yang, Yan Zhao","authorsParsed":[["Liu","Chang",""],["Yang","Tongyuan",""],["Zhao","Yan",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 19:14:49 GMT"}],"updateDate":"2024-08-06","timestamp":1722626089000,"abstract":"  There is a hidden energy in tennis, which cannot be seen or touched. It is\nthe force that controls the flow of the game and is present in all types of\nmatches. This mysterious force is Momentum. This study introduces an evaluation\nmodel that synergizes the Entropy Weight Method (EWM) and Gray Relation\nAnalysis (GRA) to quantify momentum's impact on match outcomes. Empirical\nvalidation was conducted through Mann-Whitney U and Kolmogorov-Smirnov tests,\nwhich yielded p values of 0.0043 and 0.00128,respectively. These results\nunderscore the non-random association between momentum shifts and match\noutcomes, highlighting the critical role of momentum in tennis. Otherwise, our\ninvestigation foucus is the creation of a predictive model that combines the\nadvanced machine learning algorithm XGBoost with the SHAP framework. This model\nenables precise predictions of match swings with exceptional accuracy (0.999013\nfor multiple matches and 0.992738 for finals). The model's ability to identify\nthe influence of specific factors on match dynamics,such as bilateral distance\nrun during points, demonstrates its prowess.The model's generalizability was\nthoroughly evaluated using datasets from the four Grand Slam tournaments. The\nresults demonstrate its remarkable adaptability to different match\nscenarios,despite minor variations in predictive accuracy. It offers strategic\ninsights that can help players effectively respond to opponents' shifts in\nmomentum,enhancing their competitive edge.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}