{"id":"2408.04168","title":"Perceive, Reflect, and Plan: Designing LLM Agent for Goal-Directed City\n  Navigation without Instructions","authors":"Qingbin Zeng, Qinglong Yang, Shunan Dong, Heming Du, Liang Zheng,\n  Fengli Xu, Yong Li","authorsParsed":[["Zeng","Qingbin",""],["Yang","Qinglong",""],["Dong","Shunan",""],["Du","Heming",""],["Zheng","Liang",""],["Xu","Fengli",""],["Li","Yong",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 02:28:43 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 16:14:39 GMT"}],"updateDate":"2024-09-06","timestamp":1723084123000,"abstract":"  This paper considers a scenario in city navigation: an AI agent is provided\nwith language descriptions of the goal location with respect to some well-known\nlandmarks; By only observing the scene around, including recognizing landmarks\nand road network connections, the agent has to make decisions to navigate to\nthe goal location without instructions. This problem is very challenging,\nbecause it requires agent to establish self-position and acquire spatial\nrepresentation of complex urban environment, where landmarks are often\ninvisible. In the absence of navigation instructions, such abilities are vital\nfor the agent to make high-quality decisions in long-range city navigation.\nWith the emergent reasoning ability of large language models (LLMs), a tempting\nbaseline is to prompt LLMs to \"react\" on each observation and make decisions\naccordingly. However, this baseline has very poor performance that the agent\noften repeatedly visits same locations and make short-sighted, inconsistent\ndecisions. To address these issues, this paper introduces a novel agentic\nworkflow featured by its abilities to perceive, reflect and plan. Specifically,\nwe find LLaVA-7B can be fine-tuned to perceive the direction and distance of\nlandmarks with sufficient accuracy for city navigation. Moreover, reflection is\nachieved through a memory mechanism, where past experiences are stored and can\nbe retrieved with current perception for effective decision argumentation.\nPlanning uses reflection results to produce long-term plans, which can avoid\nshort-sighted decisions in long-range navigation. We show the designed workflow\nsignificantly improves navigation ability of the LLM agent compared with the\nstate-of-the-art baselines.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}