{"id":"2408.12828","title":"Self-Assembly and Phase Behavior of Janus Rods: Competition Between\n  Shape and Potential Anisotropy","authors":"Jared A. Wood, Laura Dal Compare, Lillian Pearse, Alicia Schuitemaker,\n  Yawei Liu, Toby Hudson, Achille Giacometti, Asaph Widmer-Cooper","authorsParsed":[["Wood","Jared A.",""],["Compare","Laura Dal",""],["Pearse","Lillian",""],["Schuitemaker","Alicia",""],["Liu","Yawei",""],["Hudson","Toby",""],["Giacometti","Achille",""],["Widmer-Cooper","Asaph",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 04:19:18 GMT"}],"updateDate":"2024-08-26","timestamp":1724386758000,"abstract":"  We characterize the self-assembly and phase behavior of Janus rods over a\nbroad range of temperatures and volume fractions, using Langevin dynamics\nsimulations and free energy calculations. The Janus rods consist of a line of\nfused overlapping spheres that interact via a soft-core repulsive potential,\nwith the addition of an attractive pseudo-square-well tail to a fraction of the\nspheres (the coverage) ranging from 5\\% to 100\\% of sites. Competition between\nthe stability of liquid crystal phases originating from shape anisotropy and\nassembly driven by directional interactions gives rise to a rich polymorphism\nthat depends on the coverage. At low density near the Boyle temperature, we\nobserve the formation of spherical and tubular micelles at low coverage, while\nat higher coverage randomly oriented monolayers form as the attractive parts of\nthe rods overlap. At higher density, bilayer structures appear and merge to\nform smectic and crystalline lamellar phases. All of these structures gradually\nbecome unstable as the temperature is increased until eventually regular\nnematic and smectic phases appear, consistent with the hard rod limit. Our\nresults indicate that the intermediate regime where shape-entropic effects\ncompete with anisotropic attractions provided by site specificity is rich in\nstructural possibilities, and should help guide the design of rod-like colloids\nfor specific applications.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}