{"id":"2408.06403","title":"From Diagnostic CT to DTI Tractography labels: Using Deep Learning for\n  Corticospinal Tract Injury Assessment and Outcome Prediction in Intracerebral\n  Haemorrhage","authors":"Olivia N Murray, Hamied Haroon, Paul Ryu, Hiren Patel, George Harston,\n  Marieke Wermer, Wilmar Jolink, Daniel Hanley, Catharina Klijn, Ulrike\n  Hammerbeck, Adrian Parry-Jones, Timothy Cootes","authorsParsed":[["Murray","Olivia N",""],["Haroon","Hamied",""],["Ryu","Paul",""],["Patel","Hiren",""],["Harston","George",""],["Wermer","Marieke",""],["Jolink","Wilmar",""],["Hanley","Daniel",""],["Klijn","Catharina",""],["Hammerbeck","Ulrike",""],["Parry-Jones","Adrian",""],["Cootes","Timothy",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 13:34:26 GMT"}],"updateDate":"2024-08-14","timestamp":1723469666000,"abstract":"  The preservation of the corticospinal tract (CST) is key to good motor\nrecovery after stroke. The gold standard method of assessing the CST with\nimaging is diffusion tensor tractography. However, this is not available for\nmost intracerebral haemorrhage (ICH) patients. Non-contrast CT scans are\nroutinely available in most ICH diagnostic pipelines, but delineating white\nmatter from a CT scan is challenging. We utilise nnU-Net, trained on paired\ndiagnostic CT scans and high-directional diffusion tractography maps, to\nsegment the CST from diagnostic CT scans alone, and we show our model\nreproduces diffusion based tractography maps of the CST with a Dice similarity\ncoefficient of 57%.\n  Surgical haematoma evacuation is sometimes performed after ICH, but published\nclinical trials to date show that whilst surgery reduces mortality, there is no\nevidence of improved functional recovery. Restricting surgery to patients with\nan intact CST may reveal a subset of patients for whom haematoma evacuation\nimproves functional outcome. We investigated the clinical utility of our model\nin the MISTIE III clinical trial dataset. We found that our model's CST\nintegrity measure significantly predicted outcome after ICH in the acute and\nchronic time frames, therefore providing a prognostic marker for patients to\nwhom advanced diffusion tensor imaging is unavailable. This will allow for\nfuture probing of subgroups who may benefit from surgery.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}