{"id":"2408.03126","title":"Exploring the Phase Transition in Charged Gauss-Bonnet Black Holes: A\n  Holographic Thermodynamics Perspectives","authors":"Jafar Sadeghi, Mohammad Reza Alipour, Mohammad Ali S. Afshar, Saeed\n  Noori Gashti","authorsParsed":[["Sadeghi","Jafar",""],["Alipour","Mohammad Reza",""],["Afshar","Mohammad Ali S.",""],["Gashti","Saeed Noori",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 11:59:04 GMT"}],"updateDate":"2024-08-15","timestamp":1722945544000,"abstract":"  In this paper, we delve into the study of thermodynamics and phase transition\nof charged Gauss-Bonnet black holes within the context of anti-de Sitter (AdS)\nspace, with particular emphasis on the central charge's role within the dual\nconformal field theory (CFT). We employ a holographic methodology that\ninterprets the cosmological constant and the Newton constant as thermodynamic\nvariables, leading to the derivation of a modified first law of thermodynamics\nthat incorporates the thermodynamic volume and pressure. Our findings reveal\nthat the central charge of the CFT is intrinsically linked to the variation of\nthese constants, and its stability can be ensured by simultaneous adjustment of\nthese constants. We further explore the phase structures of the black holes,\nutilizing the free energy. Our research uncovers the existence of a critical\nvalue of the central charge, beyond which the phase diagram displays a\nfirst-order phase transition between small and large black holes. We also delve\ninto the implications of our findings on the complexity of the CFT. Our\nconclusions underscore the significant role of the central charge in the\nholographic thermodynamics and phase transition of charged Gauss-Bonnet black\nholes. Furthermore, we conclude that while the central charge considered\nprovides suitable and satisfactory solutions for this black hole in 4 and 5\ndimensions, it becomes necessary to introduce a unique central charge for this\nstructure of modified gravity. In essence, the central charge in holographic\nthermodynamics is not a universal value and requires modification in accordance\nwith different modified gravities. Consequently, the physics of the problem\nwill significantly deviate from the one discussed in this article, indicating a\nrich and complex landscape for future work.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NSQuz-IlzJ4P4eSA7UzpJyxxwcMdYuFEDmadiAFYDvg","pdfSize":"367332"}
