{"id":"2408.14036","title":"Robust subgroup-classifier learning and testing in change-plane\n  regressions","authors":"Xu Liu, Jian Huang, Yong Zhou and Xiao Zhang","authorsParsed":[["Liu","Xu",""],["Huang","Jian",""],["Zhou","Yong",""],["Zhang","Xiao",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 06:10:26 GMT"}],"updateDate":"2024-08-27","timestamp":1724652626000,"abstract":"  Considered here are robust subgroup-classifier learning and testing in\nchange-plane regressions with heavy-tailed errors, which can identify subgroups\nas a basis for making optimal recommendations for individualized treatment. A\nnew subgroup classifier is proposed by smoothing the indicator function, which\nis learned by minimizing the smoothed Huber loss. Nonasymptotic properties and\nthe Bahadur representation of estimators are established, in which the proposed\nestimators of the grouping difference parameter and baseline parameter achieve\nsub-Gaussian tails. The hypothesis test considered here belongs to the class of\ntest problems for which some parameters are not identifiable under the null\nhypothesis. The classic supremum of the squared score test statistic may lose\npower in practice when the dimension of the grouping parameter is large, so to\novercome this drawback and make full use of the data's heavy-tailed error\ndistribution, a robust weighted average of the squared score test statistic is\nproposed, which achieves a closed form when an appropriate weight is chosen.\nAsymptotic distributions of the proposed robust test statistic are derived\nunder the null and alternative hypotheses. The proposed robust subgroup\nclassifier and test statistic perform well on finite samples, and their\nperformances are shown further by applying them to a medical dataset. The\nproposed procedure leads to the immediate application of recommending optimal\nindividualized treatments.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"U71X-_fEjcRqghj8hKziM3kiqNpVol7jt1Z7OjDamC8","pdfSize":"440567"}
