{"id":"2408.17000","title":"Millimetre observations of the S-type AGB star $\\chi$ Cygni: variability\n  of the emission of the inner envelope","authors":"D.T. Hoai, J.M. Winters, P.T. Nhung, P. Darriulat, and T. Le Bertre","authorsParsed":[["Hoai","D. T.",""],["Winters","J. M.",""],["Nhung","P. T.",""],["Darriulat","P.",""],["Bertre","T. Le",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 04:18:18 GMT"}],"updateDate":"2024-09-02","timestamp":1724991498000,"abstract":"  New observations are presented of millimetre line emissions of the\ncircumstellar envelope (CSE) of AGB star $\\chi$ Cygni using the recently\nupgraded NOEMA array. $\\chi$ Cygni is an S-type Mira variable, at the border\nbetween oxygen-rich and carbon-rich, that has been observed for over 40 years\nto display features giving evidence for the strong role played by\npulsation-associated shock waves in the generation of its wind. The new\nobservations give evidence for a bright H$^{12}$CN(3-2) line emission confined\nto the very close neighbourhood of the star, however significantly more\nextended in 2024 than in 2023. Interpretation of such variability in terms of\nmaser emission is considered but found to raise significant unanswered\nquestions. Moreover, other unexpected features are observed in the very close\nneighbourhood of the star, including low Si$^{16}$O(6-5)/Si$^{17}$O(6-5),\n$^{28}$SiO(5-4)/$^{29}$SiO(5-4) and $^{12}$CO(2-1)/$^{13}$CO(2-1) line emission\nratios. Possibly confirming the important role played by shocks, we discuss a\nmeasurement of the SiO(5-4)/SiO(6-5) emission ratio, evidence for a recent mass\nejection particularly enhanced in the north-western red-shifted octant of the\ncircumstellar envelope, leaving a depression of emission in its wake, and\npatterns of enhanced CO(2-1) line-emission suggesting an interpretation in\nterms of episodic outflows enhanced over solid angles associated with the\nsurface of convective cells and on a time scale of a few decades. Unravelling\nthe mechanisms underlying such newly observed features is very challenging and\nconfirmation of the reported observations with improved sensitivity and angular\nresolution would be highly welcome. Observation of SiO maser emission in the\n($\\nu$=1,$J$=6-5) transition is reported for the first time.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5LHnk1RdUxgH-RjIZ9YNpOAYrXHn9ScpHqAPlDtWHlc","pdfSize":"8469132"}
