{"id":"2408.07672","title":"Rapid stochastic spatial light modulator calibration and pixel crosstalk\n  optimisation","authors":"P. Schroff, E. Haller, S. Kuhr and A. La Rooij","authorsParsed":[["Schroff","P.",""],["Haller","E.",""],["Kuhr","S.",""],["La Rooij","A.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 17:11:50 GMT"}],"updateDate":"2024-08-15","timestamp":1723655510000,"abstract":"  Holographic light potentials generated by phase-modulating liquid-crystal\nspatial light modulators (SLMs) are widely used in quantum technology\napplications. Accurate calibration of the wavefront and intensity profile of\nthe laser beam at the SLM display is key to the high fidelity of holographic\npotentials. Here, we present a new calibration technique that is faster than\nprevious methods while maintaining the same level of accuracy. By employing\nstochastic optimisation and random speckle intensity patterns, we calibrate a\ndigital twin that accurately models the experimental setup. This approach\nallows us to measure the wavefront at the SLM to within $\\lambda /170$ in ~ 5\nminutes using only 10 SLM phase patterns, a significant speedup over\nstate-of-the-art techniques. Additionally, our digital twin models pixel\ncrosstalk on the liquid-crystal SLM, enabling rapid calibration of model\nparameters and reducing the error in light potentials by a factor of ~ 5\nwithout losing efficiency. Our fast calibration technique will simplify the\nimplementation of high-fidelity light potentials in, for example, quantum-gas\nmicroscopes and neutral-atom tweezer arrays where high-NA objectives and\nthermal lensing can deform the wavefront significantly. Applications in the\nfield of holographic displays that require high image fidelity will benefit\nfrom the novel pixel crosstalk calibration, especially for displays with a\nlarge field of view and increased SLM diffraction angles.\n","subjects":["Physics/Optics","Physics/Atomic Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}