{"id":"2408.02267","title":"Accurate Simultaneous Constraints on the Dust Mass, Temperature and\n  Emissivity Index of a Galaxy at Redshift 7.31","authors":"Hiddo Algera, Hanae Inami, Ilse De Looze, Andrea Ferrara, Hiroyuki\n  Hirashita, Manuel Aravena, Tom Bakx, Rychard Bouwens, Rebecca Bowler,\n  Elisabete Da Cunha, Pratika Dayal, Yoshinobu Fudamoto, Jacqueline Hodge,\n  Alexander Hygate, Ivana van Leeuwen, Themiya Nanayakkara, Marco Palla, Andrea\n  Pallottini, Lucie Rowland, Renske Smit, Laura Sommovigo, Mauro Stefanon,\n  Aswin Vijayan, Paul van der Werf","authorsParsed":[["Algera","Hiddo",""],["Inami","Hanae",""],["De Looze","Ilse",""],["Ferrara","Andrea",""],["Hirashita","Hiroyuki",""],["Aravena","Manuel",""],["Bakx","Tom",""],["Bouwens","Rychard",""],["Bowler","Rebecca",""],["Da Cunha","Elisabete",""],["Dayal","Pratika",""],["Fudamoto","Yoshinobu",""],["Hodge","Jacqueline",""],["Hygate","Alexander",""],["van Leeuwen","Ivana",""],["Nanayakkara","Themiya",""],["Palla","Marco",""],["Pallottini","Andrea",""],["Rowland","Lucie",""],["Smit","Renske",""],["Sommovigo","Laura",""],["Stefanon","Mauro",""],["Vijayan","Aswin",""],["van der Werf","Paul",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 06:49:53 GMT"}],"updateDate":"2024-08-06","timestamp":1722840593000,"abstract":"  We present new multi-frequency ALMA continuum observations of the massive\n[$\\log_{10}(M_\\star/M_\\odot) = 10.3_{-0.2}^{+0.1}$], UV-luminous\n[$M_\\mathrm{UV} = -21.7 \\pm 0.2$] $z=7.31$ galaxy REBELS-25 in Bands 3, 4, 5,\nand 9. Combining the new observations with previously-taken data in Bands 6 and\n8, we cover the dust continuum emission of the galaxy in six distinct bands --\nspanning rest-frame $50-350\\,\\mu$m -- enabling simultaneous constraints on its\ndust mass ($M_\\mathrm{dust}$), temperature ($T_\\mathrm{dust}$) and emissivity\nindex ($\\beta_\\mathrm{IR}$) via modified blackbody fitting. Given a fiducial\nmodel of optically thin emission, we infer a cold dust temperature of\n$T_\\mathrm{dust} = 32_{-6}^{+9}\\,$K and a high dust mass of\n$\\log_{10}(M_\\mathrm{dust}/M_\\odot) = 8.2_{-0.4}^{+0.6}$, and moderately\noptically thick dust does not significantly alter these estimates. If we assume\ndust production is solely through supernovae (SNe), the inferred dust yield\nwould be high, $y = 0.7_{-0.4}^{+2.3}\\,M_\\odot$ per SN. Consequently, we argue\ngrain growth in the interstellar medium of REBELS-25 also contributes to its\ndust build-up. This is supported by the steep dust emissivity index\n$\\beta_\\mathrm{IR} = 2.5 \\pm 0.4$ we measure for REBELS-25, as well as by its\nhigh stellar mass, dense interstellar medium, and metal-rich nature. Our\nresults suggest that constraining the dust emissivity indices of high-redshift\ngalaxies is important not only to mitigate systematic uncertainties in their\ndust masses and obscured star formation rates, but also to assess if dust\nproperties evolve across cosmic time. We present an efficient observing setup\nto do so with ALMA, combining observations of the peak and Rayleigh-Jeans tail\nof the dust emission.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}