{"id":"2408.08442","title":"A semi-centralized multi-agent RL framework for efficient irrigation\n  scheduling","authors":"Bernard T. Agyeman, Benjamin Decard-Nelson, Jinfeng Liu (University of\n  Alberta), Sirish L. Shah","authorsParsed":[["Agyeman","Bernard T.","","University of\n  Alberta"],["Decard-Nelson","Benjamin","","University of\n  Alberta"],["Liu","Jinfeng","","University of\n  Alberta"],["Shah","Sirish L.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 22:27:32 GMT"}],"updateDate":"2024-08-19","timestamp":1723760852000,"abstract":"  This paper proposes a Semi-Centralized Multi-Agent Reinforcement Learning\n(SCMARL) approach for irrigation scheduling in spatially variable agricultural\nfields, where management zones address spatial variability. The SCMARL\nframework is hierarchical in nature, with a centralized coordinator agent at\nthe top level and decentralized local agents at the second level. The\ncoordinator agent makes daily binary irrigation decisions based on field-wide\nconditions, which are communicated to the local agents. Local agents determine\nappropriate irrigation amounts for specific management zones using local\nconditions. The framework employs state augmentation approach to handle\nnon-stationarity in the local agents' environments. An extensive evaluation on\na large-scale field in Lethbridge, Canada, compares the SCMARL approach with a\nlearning-based multi-agent model predictive control scheduling approach,\nhighlighting its enhanced performance, resulting in water conservation and\nimproved Irrigation Water Use Efficiency (IWUE). Notably, the proposed approach\nachieved a 4.0% savings in irrigation water while enhancing the IWUE by 6.3%.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"n6etEzQz3kk8fgY1XuQuYq9gL6TKanT3FmGIz_4hg_M","pdfSize":"6844234"}
