{"id":"2408.03469","title":"Performance Classification and Remaining Useful Life Prediction of\n  Lithium Batteries Using Machine Learning and Early Cycle Electrochemical\n  Impedance Spectroscopy Measurements","authors":"Christian Parsons, Adil Amin, Prasenjit Guptasarma","authorsParsed":[["Parsons","Christian",""],["Amin","Adil",""],["Guptasarma","Prasenjit",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 22:50:40 GMT"}],"updateDate":"2024-08-08","timestamp":1722984640000,"abstract":"  We presents an approach for early cycle classification of lithium-ion\nbatteries into high and low-performing categories, coupled with the prediction\nof their remaining useful life (RUL) using a linear lasso technique.\nTraditional methods often rely on extensive cycling and the measurement of a\nlarge number of electrochemical impedance spectroscopy (EIS) frequencies to\nassess battery performance, which can be time and resource consuming. In this\nstudy, we propose a methodology that leverages specific EIS frequencies to\nachieve accurate classification and RUL prediction within the first few cycles\nof battery operation. Notably, given only the 20 kHz impedance response, our\nsupport vector machine (SVM) model classifies batteries with 100\\% accuracy.\nAdditionally, our findings reveal that battery performance classification is\nfrequency agnostic within the high frequency ($<20$ kHz) to low-frequency (32\nmHz) range. Our model also demonstrates accurate RUL predictions with\n$R^2>0.96$ based on the out of phase impedance response at a single high (20\nkHz) and a single mid-frequency (8.8 Hz), in conjunction with temperature data.\nThis research underscores the significance of the mid-frequency impedance\nresponse as merely one among several crucial features in determining battery\nperformance, thereby broadening the understanding of factors influencing\nbattery behavior.\n","subjects":["Condensed Matter/Materials Science","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}