{"id":"2408.10538","title":"Surgical Workflow Recognition and Blocking Effectiveness Detection in\n  Laparoscopic Liver Resections with Pringle Maneuver","authors":"Diandian Guo, Weixin Si, Zhixi Li, Jialun Pei, Pheng-Ann Heng","authorsParsed":[["Guo","Diandian",""],["Si","Weixin",""],["Li","Zhixi",""],["Pei","Jialun",""],["Heng","Pheng-Ann",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 04:32:50 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 15:02:53 GMT"}],"updateDate":"2024-08-22","timestamp":1724128370000,"abstract":"  Pringle maneuver (PM) in laparoscopic liver resection aims to reduce blood\nloss and provide a clear surgical view by intermittently blocking blood inflow\nof the liver, whereas prolonged PM may cause ischemic injury. To\ncomprehensively monitor this surgical procedure and provide timely warnings of\nineffective and prolonged blocking, we suggest two complementary AI-assisted\nsurgical monitoring tasks: workflow recognition and blocking effectiveness\ndetection in liver resections. The former presents challenges in real-time\ncapturing of short-term PM, while the latter involves the intraoperative\ndiscrimination of long-term liver ischemia states. To address these challenges,\nwe meticulously collect a novel dataset, called PmLR50, consisting of 25,037\nvideo frames covering various surgical phases from 50 laparoscopic liver\nresection procedures. Additionally, we develop an online baseline for PmLR50,\ntermed PmNet. This model embraces Masked Temporal Encoding (MTE) and Compressed\nSequence Modeling (CSM) for efficient short-term and long-term temporal\ninformation modeling, and embeds Contrastive Prototype Separation (CPS) to\nenhance action discrimination between similar intraoperative operations.\nExperimental results demonstrate that PmNet outperforms existing\nstate-of-the-art surgical workflow recognition methods on the PmLR50 benchmark.\nOur research offers potential clinical applications for the laparoscopic liver\nsurgery community. Source code and data will be publicly available.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}