{"id":"2408.14746","title":"Charge-Discharge Coupling Strategy for Dispatching Problems with\n  Electric Tractors at Airports","authors":"Danwen Bao, Ziqian Zhang, Di Kang","authorsParsed":[["Bao","Danwen",""],["Zhang","Ziqian",""],["Kang","Di",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 02:49:31 GMT"}],"updateDate":"2024-08-28","timestamp":1724726971000,"abstract":"  Airports worldwide are actively promoting the transition of ground service\nvehicles from traditional fuel-powered vehicles to electric vehicles. The key\nto the successful implementation of this transition lies in the development of\nefficient electric vehicle dispatching models that comprehensively consider the\ncharge-discharge processes of electric vehicles. However, due to the nonlinear\ncharacteristics of charge-discharge processes, finding precise solutions poses\na significant challenge. Previous researchers have often used traditional\nenergy consumption models and constant charging rates to simplify calculations,\nbut this has resulted in inaccurate estimates of the remaining battery charge\nlevel. Furthermore, the lack of diverse pacing and charging strategies for\nairport ground service vehicles necessitates more adaptable solutions to\nenhance operational efficiency. To address these challenges, this paper uses\nairport electric tractors as a case study, develops an accurate model that\ntakes into account the start-stop process and a piecewise linear charging\nfunction, designs an improved genetic algorithm that incorporates a greedy\nalgorithm and an adaptive strategy, and develops charge-discharge coupling\nstrategies for different configuration scenarios at Nanjing Lukou Airport to\nmeet current and future needs. The research results indicate that compared to\ntraditional genetic algorithms, the proposed improved genetic algorithm\nsignificantly enhances solution accuracy and convergence speed. Additionally,\nwith the increase in flight scale, airports can appropriately enhance their\ncharging strategies; airports with dispersed aircraft stands should devise\nhigher pacing strategies compared to those with dense aircraft stands.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}