{"id":"2408.06716","title":"Towards Cross-Domain Single Blood Cell Image Classification via\n  Large-Scale LoRA-based Segment Anything Model","authors":"Yongcheng Li, Lingcong Cai, Ying Lu, Yupeng Zhang, Jingyan Jiang,\n  Genan Dai, Bowen Zhang, Jingzhou Cao, Xiangzhong Zhang, and Xiaomao Fan","authorsParsed":[["Li","Yongcheng",""],["Cai","Lingcong",""],["Lu","Ying",""],["Zhang","Yupeng",""],["Jiang","Jingyan",""],["Dai","Genan",""],["Zhang","Bowen",""],["Cao","Jingzhou",""],["Zhang","Xiangzhong",""],["Fan","Xiaomao",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 08:20:47 GMT"}],"updateDate":"2024-08-14","timestamp":1723537247000,"abstract":"  Accurate classification of blood cells plays a vital role in hematological\nanalysis as it aids physicians in diagnosing various medical conditions. In\nthis study, we present a novel approach for classifying blood cell images known\nas BC-SAM. BC-SAM leverages the large-scale foundation model of Segment\nAnything Model (SAM) and incorporates a fine-tuning technique using LoRA,\nallowing it to extract general image embeddings from blood cell images. To\nenhance the applicability of BC-SAM across different blood cell image datasets,\nwe introduce an unsupervised cross-domain autoencoder that focuses on learning\nintrinsic features while suppressing artifacts in the images. To assess the\nperformance of BC-SAM, we employ four widely used machine learning classifiers\n(Random Forest, Support Vector Machine, Artificial Neural Network, and XGBoost)\nto construct blood cell classification models and compare them against existing\nstate-of-the-art methods. Experimental results conducted on two publicly\navailable blood cell datasets (Matek-19 and Acevedo-20) demonstrate that our\nproposed BC-SAM achieves a new state-of-the-art result, surpassing the baseline\nmethods with a significant improvement. The source code of this paper is\navailable at https://github.com/AnoK3111/BC-SAM.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}