{"id":"2408.12706","title":"Free-breathing 3D cardiac extracellular volume (ECV) mapping using a\n  linear tangent space alignment (LTSA) model","authors":"Wonil Lee, Paul Kyu Han, Thibault Marin, Isma\\\"el B.G. Mounime, Samira\n  Vafay Eslahi, Yanis Djebra, Didi Chi, Felicitas J. Bijari, Marc D. Normandin,\n  Georges El Fakhri, Chao Ma","authorsParsed":[["Lee","Wonil",""],["Han","Paul Kyu",""],["Marin","Thibault",""],["Mounime","Ismaël B. G.",""],["Eslahi","Samira Vafay",""],["Djebra","Yanis",""],["Chi","Didi",""],["Bijari","Felicitas J.",""],["Normandin","Marc D.",""],["Fakhri","Georges El",""],["Ma","Chao",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 19:48:20 GMT"}],"updateDate":"2024-08-26","timestamp":1724356100000,"abstract":"  $\\textbf{Purpose:}$ To develop a new method for free-breathing 3D\nextracellular volume (ECV) mapping of the whole heart at 3T.\n$\\textbf{Methods:}$ A free-breathing 3D cardiac ECV mapping method was\ndeveloped at 3T. T1 mapping was performed before and after contrast agent\ninjection using a free-breathing ECG-gated inversion-recovery sequence with\nspoiled gradient echo readout. A linear tangent space alignment (LTSA)\nmodel-based method was used to reconstruct high-frame-rate dynamic images from\n(k,t)-space data sparsely sampled along a random stack-of-stars trajectory.\nJoint T1 and transmit B1 estimation was performed voxel-by-voxel for pre- and\npost-contrast T1 mapping. To account for the time-varying T1 after contrast\nagent injection, a linearly time-varying T1 model was introduced for\npost-contrast T1 mapping. ECV maps were generated by aligning pre- and\npost-contrast T1 maps through affine transformation. $\\textbf{Results:}$ The\nfeasibility of the proposed method was demonstrated using in vivo studies with\nsix healthy volunteers at 3T. We obtained 3D ECV maps at a spatial resolution\nof 1.9$\\times$1.9$\\times$4.5 $mm^{3}$ and a FOV of 308$\\times$308$\\times$144\n$mm^{3}$, with a scan time of 10.1$\\pm$1.4 and 10.6$\\pm$1.6 min before and\nafter contrast agent injection, respectively. The ECV maps and the pre- and\npost-contrast T1 maps obtained by the proposed method were in good agreement\nwith the 2D MOLLI method both qualitatively and quantitatively.\n$\\textbf{Conclusion:}$ The proposed method allows for free-breathing 3D ECV\nmapping of the whole heart within a practically feasible imaging time. The\nestimated ECV values from the proposed method were comparable to those from the\nexisting method. $\\textbf{Keywords:}$ cardiac extracellular volume (ECV)\nmapping, cardiac T1 mapping, linear tangent space alignment (LTSA), manifold\nlearning\n","subjects":["Physics/Medical Physics","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}