{"id":"2408.10780","title":"QCD corrections to the Golden decay channel of the Higgs boson","authors":"Mandeep Kaur","authorsParsed":[["Kaur","Mandeep",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 12:19:12 GMT"}],"updateDate":"2024-08-21","timestamp":1724156352000,"abstract":"  Precision studies within the Higgs sector of the Standard Model are crucial\nto deepen our understanding of the fundamental interactions and uncovering new\nphysics phenomena beyond the Standard Model. To fully leverage the potential of\nfuture precision machines aiming to provide highly precise experimental\nmeasurements of the Higgs properties, it is crucial to minimize theoretical\nerrors in the Higgs sector observables, such as production and decay rates.\n  In this thesis, we focus on providing precise predictions for observables\nassociated with the Golden decay channel of the Higgs boson. We improve\ntheoretical predictions for the partial decay width of this channel,\nspecifically $H \\to Z^{(*)}Z^{(*)} \\to e^+ e^- \\mu^+ \\mu^-$, by incorporating\nNNLO mixed QCD-electroweak corrections in perturbation theory. We also describe\nthe full analytical evaluation of the two-loop master integrals appearing in\nthe $\\mathcal{O}(\\alpha \\alpha_s)$ corrections to the $HZZ$ vertex with both\n$Z$-bosons being off-shell, employing the method of differential equations\nretaining full mass dependence. The analytic results for all the master\nintegrals are obtained in terms of Chen's iterated integrals with logarithmic\nkernels order-by-order in the dimensional regularization parameter $\\epsilon$,\nalong with analytic boundary constants.\n  This thesis also presents a phenomenological study of the $H \\to e^+ e^-\n\\mu^+ \\mu^-$ decay at $\\mathcal{O}(\\alpha \\alpha_s)$ by implementing the entire\ncalculation of the decay amplitude in the public code Hto4l to perform the\nphase space integration over final state leptons. We study the impact of these\nmixed QCD-electroweak corrections on the invariant mass distribution of the\nfinal-state leptons and angular variables, specifically the angle between the\ndecay planes of the intermediate $Z$-bosons relative to leading-order\npredictions and NLO electroweak corrections.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bRXY5MvFGP5d1jtqK_PTjMiLo4Wl6XblyTKZDdxqZL0","pdfSize":"8563129"}
