{"id":"2408.01217","title":"Searching for Pulsars, Magnetars, and Fast Radio Bursts in the Sculptor\n  Galaxy using MeerKAT","authors":"H. Hurter, C. Venter, L. Levin, B. W. Stappers, E. D. Barr, R. P.\n  Breton, S. Buchner, E. Carli, M. Kramer, P.V. Padmanabh, A. Possenti, V.\n  Prayag, J. D. Turner","authorsParsed":[["Hurter","H.",""],["Venter","C.",""],["Levin","L.",""],["Stappers","B. W.",""],["Barr","E. D.",""],["Breton","R. P.",""],["Buchner","S.",""],["Carli","E.",""],["Kramer","M.",""],["Padmanabh","P. V.",""],["Possenti","A.",""],["Prayag","V.",""],["Turner","J. D.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 12:12:53 GMT"}],"updateDate":"2024-08-05","timestamp":1722600773000,"abstract":"  The Sculptor Galaxy (NGC 253), located in the Southern Hemisphere, far off\nthe Galactic Plane, has a relatively high star-formation rate of about 7\nM$_{\\odot}$ yr$^{-1}$ and hosts a young and bright stellar population,\nincluding several super star clusters and supernova remnants. It is also the\nfirst galaxy, apart from the Milky Way Galaxy to be associated with two giant\nmagnetar flares. As such, it is a potential host of pulsars and/or fast radio\nbursts in the nearby Universe. The instantaneous sensitivity and multibeam sky\ncoverage offered by MeerKAT therefore make it a favourable target. We searched\nfor pulsars, radio-emitting magnetars, and fast radio bursts in NGC 253 as part\nof the TRAPUM large survey project with MeerKAT. We did not find any pulsars\nduring a four-hour observation, and derive a flux density limit of 4.4 $\\mu$Jy\nat 1400 MHz, limiting the pseudo-luminosity of the brightest putative pulsar in\nthis galaxy to 54 Jy kpc$^2$. Assuming universality of pulsar populations\nbetween galaxies, we estimate that detecting a pulsar as bright as this limit\nrequires NGC 253 to contain a pulsar population of $\\gtrsim$20 000. We also did\nnot detect any single pulses and our single pulse search flux density limit is\n62 mJy at 1284\\,MHz. Our search is sensitive enough to have detected any fast\nradio bursts and radio emission similar to the brighter pulses seen from the\nmagnetar SGR J1935+2154 if they had occurred during our observation.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}