{"id":"2408.11526","title":"RConE: Rough Cone Embedding for Multi-Hop Logical Query Answering on\n  Multi-Modal Knowledge Graphs","authors":"Mayank Kharbanda, Rajiv Ratn Shah, Raghava Mutharaju","authorsParsed":[["Kharbanda","Mayank",""],["Shah","Rajiv Ratn",""],["Mutharaju","Raghava",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 11:02:35 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 07:46:25 GMT"}],"updateDate":"2024-08-27","timestamp":1724238155000,"abstract":"  Multi-hop query answering over a Knowledge Graph (KG) involves traversing one\nor more hops from the start node to answer a query. Path-based and logic-based\nmethods are state-of-the-art for multi-hop question answering. The former is\nused in link prediction tasks. The latter is for answering complex logical\nqueries. The logical multi-hop querying technique embeds the KG and queries in\nthe same embedding space. The existing work incorporates First Order Logic\n(FOL) operators, such as conjunction ($\\wedge$), disjunction ($\\vee$), and\nnegation ($\\neg$), in queries. Though current models have most of the building\nblocks to execute the FOL queries, they cannot use the dense information of\nmulti-modal entities in the case of Multi-Modal Knowledge Graphs (MMKGs). We\npropose RConE, an embedding method to capture the multi-modal information\nneeded to answer a query. The model first shortlists candidate (multi-modal)\nentities containing the answer. It then finds the solution (sub-entities)\nwithin those entities. Several existing works tackle path-based\nquestion-answering in MMKGs. However, to our knowledge, we are the first to\nintroduce logical constructs in querying MMKGs and to answer queries that\ninvolve sub-entities of multi-modal entities as the answer. Extensive\nevaluation of four publicly available MMKGs indicates that RConE outperforms\nthe current state-of-the-art.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}