{"id":"2408.01997","title":"Rate-Splitting Multiple Access for GEO-LEO Coexisting Satellite Systems:\n  A Traffic-Aware Throughput Maximization Precoder Design","authors":"Jaehak Ryu, Aryan Kaushik, Byungju Lee, Wonjae Shin","authorsParsed":[["Ryu","Jaehak",""],["Kaushik","Aryan",""],["Lee","Byungju",""],["Shin","Wonjae",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 11:48:44 GMT"}],"updateDate":"2024-08-06","timestamp":1722772124000,"abstract":"  The frequency coexistence between geostationary orbit (GEO) and low earth\norbit (LEO) satellite systems is expected to be a promising approach for\nrelieving spectrum scarcity. However, it is essential to manage mutual\ninterference between GEO and LEO satellite systems for frequency coexistence.\nSpecifically, \\emph{in-line interference}, caused by LEO satellites moving near\nthe line-of-sight path between GEO satellite and GEO users (GUs), can\nsignificantly degrade GEO system throughput. This paper put forth a novel\nrate-splitting multiple access (RSMA) with a super-common message for GEO-LEO\ncoexisting satellite systems (CSS). By employing a super-common message that\nGUs can decode, GUs can mitigate the in-line interference by successive\ninterference cancellation (SIC). Moreover, we formulate a traffic-aware\nthroughput maximization (TTM) problem to satisfy the heterogeneous traffic\ndemands of users by minimizing total unmet throughput demands (or user\ndissatisfaction). By doing so, the TTM precoder can be flexibly adjusted\naccording to the interference leakage from LEO satellites to GUs and target\ntraffic demands. Numerical results confirm that our proposed method ensures\nseamless connectivity even in the GEO-LEO in-line interference regime under\nimperfect channel state information (CSI) at both the transmitter and receiver.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vznw8z7iOJ1ZGgZXLqqpUu45DAbAtklo1Mck0siAdJA","pdfSize":"3734434","txDigest":"fZRD1xzcivHruJiLEfm2nqwZWe6V7Zm5MM9CBfigXf4","endEpoch":"1","status":"CERTIFIED"}
