{"id":"2408.04368","title":"Quantum metric Choquet simplices","authors":"Bhishan Jacelon","authorsParsed":[["Jacelon","Bhishan",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 10:57:28 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 08:29:58 GMT"}],"updateDate":"2024-08-15","timestamp":1723114648000,"abstract":"  Precipitating a notion emerging from recent research, we formalise the study\nof a special class of compact quantum metric spaces. Abstractly, the additional\nrequirement we impose on the underlying order unit spaces is the Riesz\ninterpolation property. In practice, this means that a `quantum metric Choquet\nsimplex' arises as a unital $\\mathrm{C}^*$-algebra $A$ whose trace space is\nequipped with a metric inducing the $w^*$-topology, such that tracially\nLipschitz elements are dense in $A$. This added structure is designed for\nmeasuring distances in and around the category of stably finite classifiable\n$\\mathrm{C}^*$-algebras, and in particular for witnessing metric and\nstatistical properties of the space of (approximate unitary equivalence classes\nof) unital embeddings of $A$ into a stably finite classifiable\n$\\mathrm{C}^*$-algebra $B$. Our reference frame for this measurement is a\ncertain compact `nucleus' of $A$ provided by its quantum metric structure. As\nfor the richness of the metric space of isometric isomorphism classes of\nclassifiable $\\mathrm{C}^*$-algebraic quantum metric Choquet simplices\n(equipped with Rieffel's quantum Gromov--Hausdorff distance), we show how to\nconstruct examples starting from Bauer simplices associated to compact metric\nspaces. We also explain how to build non-Bauer examples by forming `quantum\ncrossed products' associated to dynamical systems on the tracial boundary.\nFurther, we observe that continuous fields of quantum spaces are obtained by\ncontinuously varying either the dynamics or the metric. In the case of deformed\nisometric actions, we show that equivariant Gromov--Hausdorff continuity\nimplies fibrewise continuity of the quantum structures. As an example, we\npresent a field of deformed quantum rotation algebras whose fibres are\ncontinuous with respect to a quasimetric called the quantum intertwining gap.\n","subjects":["Mathematics/Operator Algebras"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}