{"id":"2408.12626","title":"Fingerprints of supersymmetric spin and charge dynamics observed by\n  inelastic neutron scattering","authors":"B. Wehinger, F. T. Lisandrini, N. Kestin, P. Bouillot, S. Ward, D.\n  Biner, R. Bewley, K. W. Kr\\\"amer, B. Normand, C. Kollath, T. Giamarchi, A. M.\n  L\\\"auchli and Ch. R\\\"uegg","authorsParsed":[["Wehinger","B.",""],["Lisandrini","F. T.",""],["Kestin","N.",""],["Bouillot","P.",""],["Ward","S.",""],["Biner","D.",""],["Bewley","R.",""],["Krämer","K. W.",""],["Normand","B.",""],["Kollath","C.",""],["Giamarchi","T.",""],["Läuchli","A. M.",""],["Rüegg","Ch.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 15:56:41 GMT"}],"updateDate":"2024-08-26","timestamp":1724083001000,"abstract":"  Supersymmetry is an algebraic property of a class of quantum Hamiltonians, a\nguiding principle used in the development of nuclear theory and a concept that\nmay underpin physics beyond the Standard Model. In condensed matter, any\nsymmetry between bosonic and fermionic entities is usually strongly broken, as\nfor the spin and charge sectors of the $t$-$J$ model describing the dynamics of\nfractionalized electrons in one-dimensional materials. While the triplet\nexcitations of a quantum spin ladder in an applied magnetic field provide a\nclose analogue of the $t$-$J$ chain, the supersymmetric nature of this system\nhas not been explored. Here we perform neutron spectroscopy on the spin-ladder\ncompounds (C$_5$D$_{12}$N)$_2$CuBr$_4$ and (C$_5$D$_{12}$N)$_2$CuCl$_4$ over a\nrange of applied fields and temperatures, and apply matrix-product-state (MPS)\nmethods to the ladder and equivalent chain models, to analyse the full,\nmomentum-resolved dynamics of a single charge excitation in a bath of\nfractionalized spins. We find a dramatic difference in the effects of thermal\nfluctuations, where strong and coherent shifts of spectral weight at the zone\nedge contrast with a strict pole at the zone centre, whose persistence at all\ntemperatures constitutes an observable consequence of supersymmetry in a\nquantum spin ladder.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}