{"id":"2408.06678","title":"Attainability of quantum state discrimination bounds with collective\n  measurements on finite copies","authors":"Lorcan Conlon, Jin Ming Koh, Biveen Shajilal, Jasminder Sidhu, Ping\n  Koy Lam, and Syed M. Assad","authorsParsed":[["Conlon","Lorcan",""],["Koh","Jin Ming",""],["Shajilal","Biveen",""],["Sidhu","Jasminder",""],["Lam","Ping Koy",""],["Assad","Syed M.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 07:08:16 GMT"}],"updateDate":"2024-08-14","timestamp":1723532896000,"abstract":"  One of the fundamental tenets of quantum mechanics is that non-orthogonal\nstates cannot be distinguished perfectly. When distinguishing multiple copies\nof a mixed quantum state, a collective measurement, which generates\nentanglement between the different copies of the unknown state, can achieve a\nlower error probability than non-entangling measurements. The error probability\nthat can be attained using a collective measurement on a finite number of\ncopies of the unknown state is given by the Helstrom bound. In the limit where\nwe can perform a collective measurement on asymptotically many copies of the\nquantum state, the quantum Chernoff bound gives the attainable error\nprobability. It is natural to ask at what rate does the error tend to this\nasymptotic limit, and whether the asymptotic limit can be attained for any\nfinite number of copies. In this paper we address these questions. We find\nanalytic expressions for the Helstrom bound for arbitrarily many copies of the\nunknown state in several simple qubit examples. Using these analytic\nexpressions, we investigate how the attainable error rate changes as we allow\ncollective measurements on finite numbers of copies of the quantum state. We\nalso investigate the necessary conditions to saturate the M-copy Helstrom\nbound. It is known that a collective measurement on all M-copies of the unknown\nstate is always sufficient to saturate the M-copy Helstrom bound. However,\ngeneral conditions for when such a measurement is necessary to saturate the\nHelstrom bound remain unknown. We investigate specific measurement strategies\nwhich involve entangling operations on fewer than all M-copies of the unknown\nstate. For many regimes we find that a collective measurement on all M-copies\nof the unknown state is necessary to saturate the M-copy Helstrom bound.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}