{"id":"2408.12238","title":"VR Cloud Gaming UX: Exploring the Impact of Network Quality on Emotion,\n  Presence, Game Experience and Cybersickness","authors":"Maximilian Warsinke and Tanja Koji\\'c and Maurizio Vergari and\n  Jan-Niklas Voigt-Antons and Sebastian M\\\"oller","authorsParsed":[["Warsinke","Maximilian",""],["Kojić","Tanja",""],["Vergari","Maurizio",""],["Voigt-Antons","Jan-Niklas",""],["Möller","Sebastian",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 09:14:08 GMT"}],"updateDate":"2024-08-23","timestamp":1724318048000,"abstract":"  This study explores the user experience (UX) of virtual reality (VR) cloud\ngaming under simulated network degradation conditions. Two contrasting games\n(Beat Saber, Cubism) were streamed via Meta Air Link to a Quest 3 device in a\nlaboratory setup. Packet loss and delay were introduced into the streaming\nnetwork using NetEm for WiFi traffic manipulation. In a within-subjects\nexperiment, 16 participants played both games under three network conditions\n(Loss, Delay, Baseline), followed by post-game questionnaires assessing their\nemotions, perceived quality, game experience, sense of presence, and\ncybersickness. Friedman's test and Dunn's post-hoc test for pairwise\ncomparisons revealed that packet loss had a greater impact on UX than delay\nacross almost all evaluated aspects. Notably, packet loss in Beat Saber led to\na significant increase in cybersickness, whereas in Cubism, players experienced\na significant reduction in their sense of presence. Additionally, both games\nexhibited statistically significant variations between conditions in most game\nexperience dimensions, perceived quality, and emotional responses. This study\nhighlights the critical role of network stability in VR cloud gaming,\nparticularly in minimizing packet loss. The different dynamics between the\ngames suggest the possibility of genre-specific optimization and novel game\ndesign considerations for VR cloud games.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}