{"id":"2408.01586","title":"miniBLAST: a novel experimental setup for laboratory testing of\n  structures under blast loads","authors":"Ahmad Morsel, Filippo Masi, Emmanuel March\\'e, Guillaume Racineux,\n  Panagiotis Kotronis, Ioannis Stefanou","authorsParsed":[["Morsel","Ahmad",""],["Masi","Filippo",""],["Marché","Emmanuel",""],["Racineux","Guillaume",""],["Kotronis","Panagiotis",""],["Stefanou","Ioannis",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 21:55:19 GMT"}],"updateDate":"2024-08-06","timestamp":1722635719000,"abstract":"  We present a novel experimental setup called miniBLAST, which enables\nsystematic and repeatable laboratory tests of structures subjected to blast\nloads. The explosive source is based on the discharge of high electrical loads\non a thin conductor, producing repeatable blast-type shock waves of controlled\nintensity. Conducting blast experiments under safe laboratory conditions offers\nsignificant advantages over large-scale experiments, which are expensive,\nrequire specialized personnel, are limited in number, and face repeatability\nissues.\n  In this work, we provide a comprehensive description of the setup's design\nrationale and technical characteristics. Moreover, we place particular emphasis\non the installation phases, safety, and metrology. The explosive source is\nanalyzed and the signature of blast shock waves is retrieved. Finally, we\npresent an example of a masonry wall subjected to blast loads of varying\nintensity. We then report its dynamic response in three dimensions and at\ndifferent time instances.\n  This new experimental setup offers a cost-effective, safe, and repeatable\nmethod to study structural dynamics under blast loads, with results that can be\nupscaled to real structures. It also aids in evaluating numerical models and\nlays the groundwork for further investigations into blast effects and\nmitigation.\n","subjects":["Physics/Classical Physics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"L-xf7bCabfQpE-Qk7lEIl87T8_gw0UZ-QCLAAkgy1mE","pdfSize":"4432742","txDigest":"933fhv9XMz8trWoyc3tQaTTG9FoD7YzUGXhiFzxQqCuh","endEpoch":"1","status":"CERTIFIED"}
