{"id":"2408.09620","title":"Weak field deflection angle and analytical parameter estimation of the\n  Lorentz-violating Bumblebee parameter through the black hole shadow using EHT\n  data","authors":"Gaetano Lambiase, Reggie C. Pantig, Ali \\\"Ovg\\\"un","authorsParsed":[["Lambiase","Gaetano",""],["Pantig","Reggie C.",""],["Övgün","Ali",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 00:23:50 GMT"}],"updateDate":"2024-08-20","timestamp":1724027030000,"abstract":"  As a way to explore the potential consequences of Lorentz symmetry breaking\non gravitational and cosmological phenomena, the Bumblebee model was proposed\nas a type of modified gravity theory that incorporates spontaneous Lorentz\nsymmetry breaking, achieved by a Bumblebee vector field acquiring a non-zero\nvacuum expectation value in some preferred direction. In this paper, we\nexplored how the Lorentz symmetry breaking parameter $\\ell$ affects the\nReissner-Nordst\\\"{o}m BH solution in the context of weak field deflection\nangle, and the black hole shadow. We aim to derive the general expression for\nthe weak deflection angle using the non-asymptotic version of the Gauss-Bonnet\ntheorem, and we presented a way to simplify the calculations under the\nassumption that the distance of the source and the receiver are the same. We\nalso studied the black hole shadow in an analytic way, where we applied the EHT\nresults under the far approximation in obtaining an estimate expression for\n$\\ell$. We have found out that the theory always restricts the geometrical mass\nand the observer's distance to being equal. Using the realistic values of the\nblack hole mass and observer distance for Sgr. A* and M87*, it was shown that\n$M/r_{\\rm o} \\neq 1$ is satisfied, implying the relevance and potential promise\nof the spontaneous Lorentz symmetry breaking parameter's role on the shadow\nradius uncertainties as measured by the EHT.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}