{"id":"2408.00038","title":"MIMNet: Multi-Interest Meta Network with Multi-Granularity Target-Guided\n  Attention for Cross-domain Recommendation","authors":"Xiaofei Zhu, Yabo Yin, Li Wang","authorsParsed":[["Zhu","Xiaofei",""],["Yin","Yabo",""],["Wang","Li",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 13:30:34 GMT"}],"updateDate":"2024-08-02","timestamp":1722432634000,"abstract":"  Cross-domain recommendation (CDR) plays a critical role in alleviating the\nsparsity and cold-start problem and substantially boosting the performance of\nrecommender systems. Existing CDR methods prefer to either learn a common\npreference bridge shared by all users or a personalized preference bridge\ntailored for each user to transfer user preference from the source domain to\nthe target domain. Although these methods significantly improve the\nrecommendation performance, there are still some limitations. First, these\nmethods usually assume a user only has a unique interest, while ignoring the\nfact that a user may interact with items with different interest preferences.\nSecond, they learn transformed preference representation mainly relies on the\nsource domain signals, while neglecting the rich information available in the\ntarget domain. To handle these issues, in this paper, we propose a novel method\nnamed Multi-interest Meta Network with Multi-granularity Target-guided\nAttention (MIMNet) for cross-domain recommendation. To be specific, we employ\nthe capsule network to learn user multiple interests in the source domain,\nwhich will be fed into a meta network to generate multiple interest-level\npreference bridges. Then, we transfer user representations from the source\ndomain to the target domain based on these multi-interest bridges. In addition,\nwe introduce both fine-grained and coarse-grained target signals to aggregate\nuser transformed interest-level representations by incorporating a novel\nmulti-granularity target-guided attention network. We conduct extensive\nexperimental results on three real-world CDR tasks, and the results show that\nour proposed approach MIMNet consistently outperforms all baseline methods. The\nsource code of MIMNet is released at https://github.com/marqu22/MIMNet.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}