{"id":"2408.10558","title":"Multi-Attribute Preferences: A Transfer Learning Approach","authors":"Sjoerd Hermes, Joost van Heerwaarden, Pariya Behrouzi","authorsParsed":[["Hermes","Sjoerd",""],["van Heerwaarden","Joost",""],["Behrouzi","Pariya",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 05:53:41 GMT"}],"updateDate":"2024-08-21","timestamp":1724133221000,"abstract":"  This contribution introduces a novel statistical learning methodology based\non the Bradley-Terry method for pairwise comparisons, where the novelty arises\nfrom the method's capacity to estimate the worth of objects for a primary\nattribute by incorporating data of secondary attributes. These attributes are\nproperties on which objects are evaluated in a pairwise fashion by individuals.\nBy assuming that the main interest of practitioners lies in the primary\nattribute, and the secondary attributes only serve to improve estimation of the\nparameters underlying the primary attribute, this paper utilises the well-known\ntransfer learning framework. To wit, the proposed method first estimates a\nbiased worth vector using data pertaining to both the primary attribute and the\nset of informative secondary attributes, which is followed by a debiasing step\nbased on a penalised likelihood of the primary attribute. When the set of\ninformative secondary attributes is unknown, we allow for their estimation by a\ndata-driven algorithm. Theoretically, we show that, under mild conditions, the\n$\\ell_\\infty$ and $\\ell_2$ rates are improved compared to fitting a\nBradley-Terry model on just the data pertaining to the primary attribute. The\nfavourable (comparative) performance under more general settings is shown by\nmeans of a simulation study. To illustrate the usage and interpretation of the\nmethod, an application of the proposed method is provided on consumer\npreference data pertaining to a cassava derived food product: eba. An R package\ncontaining the proposed methodology can be found on\nxhttps://CRAN.R-project.org/package=BTTL.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}