{"id":"2408.12585","title":"Diagnosing the pattern effect in the atmosphere-ocean coupled system\n  through linear response theory","authors":"Fabrizio Falasca, Aurora Basinski-Ferris, Laure Zanna, Ming Zhao","authorsParsed":[["Falasca","Fabrizio",""],["Basinski-Ferris","Aurora",""],["Zanna","Laure",""],["Zhao","Ming",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 17:52:08 GMT"},{"version":"v2","created":"Tue, 17 Sep 2024 20:41:08 GMT"}],"updateDate":"2024-09-19","timestamp":1724349128000,"abstract":"  The energy surplus resulting from radiative forcing causes warming of the\nEarth system. This initial warming drives a myriad of changes including in sea\nsurface temperatures (SSTs), leading to different radiative feedbacks. The\nrelationship between the radiative feedbacks and the pattern of SST changes is\nreferred to as the \"pattern effect\". The current approach to study the pattern\neffect relies on diagnosing the response of atmosphere-only models to\nperturbations in the SST boundary condition. Here, we argue that the\nfluctuation-dissipation relation (FDR), together with coarse-graining\nprocedures, is a computationally cheap and theoretically grounded alternative\nto model experiments. We introduce a protocol to study the pattern effect and\npresent its application in a state-of-the-art coupled climate model. By\nfocusing on the coupled dynamics, we unveil the role of the slow ocean\ncomponent in setting the pattern effect. We present a new \"sensitivity map\",\nrepresenting a first, qualitative prediction of the response of the average\ntop-of-the-atmosphere (TOA) radiative flux to perturbations in the SST field.\nWe find negative sensitivity throughout the tropics, in contrast to the current\nunderstanding of a positive-negative dipole of sensitivity in the tropical\nPacific. Considering only the shortest time scales, the response is dominated\nby the fast atmospheric variability and we recover results in qualitative\nagreement with the literature. Therefore, the difference between our results\nand previous studies, largely comes from including the atmosphere-ocean\ncoupling. The framework offers a conceptually novel perspective on the pattern\neffect: feedbacks in the coupled system are encoded in a temporally and\nspatially dependent response operator, rather than time-independent maps as for\nprevious studies.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Condensed Matter/Statistical Mechanics","Nonlinear Sciences/Chaotic Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}