{"id":"2408.10980","title":"Accelerated Emergence of Evolved Galaxies in Early Overdensities at\n  $z\\sim5.7$","authors":"Takahiro Morishita, Zhaoran Liu, Massimo Stiavelli, Tommaso Treu,\n  Michele Trenti, Nima Chartab, Guido Roberts-Borsani, Benedetta Vulcani,\n  Pietro Bergamini, Marco Castellano, Claudio Grillo","authorsParsed":[["Morishita","Takahiro",""],["Liu","Zhaoran",""],["Stiavelli","Massimo",""],["Treu","Tommaso",""],["Trenti","Michele",""],["Chartab","Nima",""],["Roberts-Borsani","Guido",""],["Vulcani","Benedetta",""],["Bergamini","Pietro",""],["Castellano","Marco",""],["Grillo","Claudio",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 16:15:56 GMT"}],"updateDate":"2024-08-21","timestamp":1724170556000,"abstract":"  We report the identification of two galaxy overdensities at $z\\sim5.7$ in the\nsightline of the galaxy cluster Abell 2744. These overdensities consist of 25\nand 17 member galaxies, spectroscopically confirmed with JWST NIRSpec/MSA and\nNIRCam/WFSS. Each overdensity has a total stellar mass of $\\sim2\\times10^{10}\nM_\\odot$ and a star formation rate of $\\sim200 M_\\odot$/yr within a central\nregion of radius $R=2$ Mpc (physical). The sensitive PRISM spectra allow us to\nidentify six galaxies that show weak Ha+[NII] emissions within the\noverdensities ($27\\pm6\\%$), whereas the fraction of such galaxies is found\nsignificantly lower ($6\\pm2\\%$) in field samples of the equivalent redshift\nrange. These weak emission line galaxies, dubbed as wELGs, exhibit a strong\ncontinuum break at $4000$AA rest-frame, a characteristic feature of evolved\nstellar populations. The high observed fraction of wELGs in the two\noverdensities is consistent with the idea that high-density environments are an\nideal site where galaxies can accelerate their evolutionary pace compared to\nfield analogs. Our study pinpoints an early onset of environmental effects,\nalready important within one billion years after the Big Bang, and provides a\ncomplementary perspective on the emergence of quenched, massive galaxies at\nlower redshifts. Potential contributions from black hole accretion feedback to\nthe reduction of star formation activity are discussed, but the connection to\nthe local environments remains unclear.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}