{"id":"2408.07734","title":"Analog Spiking Neuron in CMOS 28 nm Towards Large-Scale Neuromorphic\n  Processors","authors":"Marwan Besrour, Jacob Lavoie, Takwa Omrani, Gabriel Martin-Hardy,\n  Esmaeil Ranjbar Koleibi, Jeremy Menard, Konin Koua, Philippe Marcoux, Mounir\n  Boukadoum, Rejean Fontaine","authorsParsed":[["Besrour","Marwan",""],["Lavoie","Jacob",""],["Omrani","Takwa",""],["Martin-Hardy","Gabriel",""],["Koleibi","Esmaeil Ranjbar",""],["Menard","Jeremy",""],["Koua","Konin",""],["Marcoux","Philippe",""],["Boukadoum","Mounir",""],["Fontaine","Rejean",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 17:51:20 GMT"}],"updateDate":"2024-08-16","timestamp":1723657880000,"abstract":"  The computational complexity of deep learning algorithms has given rise to\nsignificant speed and memory challenges for the execution hardware. In\nenergy-limited portable devices, highly efficient processing platforms are\nindispensable for reproducing the prowess afforded by much bulkier processing\nplatforms.\n  In this work, we present a low-power Leaky Integrate-and-Fire (LIF) neuron\ndesign fabricated in TSMC's 28 nm CMOS technology as proof of concept to build\nan energy-efficient mixed-signal Neuromorphic System-on-Chip (NeuroSoC). The\nfabricated neuron consumes 1.61 fJ/spike and occupies an active area of 34 $\\mu\nm^{2}$, leading to a maximum spiking frequency of 300 kHz at 250 mV power\nsupply.\n  These performances are used in a software model to emulate the dynamics of a\nSpiking Neural Network (SNN). Employing supervised backpropagation and a\nsurrogate gradient technique, the resulting accuracy on the MNIST dataset,\nusing 4-bit post-training quantization stands at 82.5\\%. The approach\nunderscores the potential of such ASIC implementation of quantized SNNs to\ndeliver high-performance, energy-efficient solutions to various embedded\nmachine-learning applications.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"924NGes4AlF6Os7mcwrsaPybxBo1RGuY4GBylH3mzWQ","pdfSize":"6162856"}
