{"id":"2408.14441","title":"Attend-Fusion: Efficient Audio-Visual Fusion for Video Classification","authors":"Mahrukh Awan, Asmar Nadeem, Muhammad Junaid Awan, Armin Mustafa, Syed\n  Sameed Husain","authorsParsed":[["Awan","Mahrukh",""],["Nadeem","Asmar",""],["Awan","Muhammad Junaid",""],["Mustafa","Armin",""],["Husain","Syed Sameed",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 17:33:47 GMT"}],"updateDate":"2024-08-27","timestamp":1724693627000,"abstract":"  Exploiting both audio and visual modalities for video classification is a\nchallenging task, as the existing methods require large model architectures,\nleading to high computational complexity and resource requirements. Smaller\narchitectures, on the other hand, struggle to achieve optimal performance. In\nthis paper, we propose Attend-Fusion, an audio-visual (AV) fusion approach that\nintroduces a compact model architecture specifically designed to capture\nintricate audio-visual relationships in video data. Through extensive\nexperiments on the challenging YouTube-8M dataset, we demonstrate that\nAttend-Fusion achieves an F1 score of 75.64\\% with only 72M parameters, which\nis comparable to the performance of larger baseline models such as\nFully-Connected Late Fusion (75.96\\% F1 score, 341M parameters). Attend-Fusion\nachieves similar performance to the larger baseline model while reducing the\nmodel size by nearly 80\\%, highlighting its efficiency in terms of model\ncomplexity. Our work demonstrates that the Attend-Fusion model effectively\ncombines audio and visual information for video classification, achieving\ncompetitive performance with significantly reduced model size. This approach\nopens new possibilities for deploying high-performance video understanding\nsystems in resource-constrained environments across various applications.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xDmgXmsyPD3ZfEXplglb0g4APfLxHhksu4wIobllD7o","pdfSize":"30256695"}
