{"id":"2408.13465","title":"New Insights into Type-I Solar Noise Storms from High Angular Resolution\n  Spectroscopic Imaging with the upgraded Giant Metrewave Radio Telescope","authors":"Surajit Mondal, Devojyoti Kansabanik, Divya Oberoi and Soham Dey","authorsParsed":[["Mondal","Surajit",""],["Kansabanik","Devojyoti",""],["Oberoi","Divya",""],["Dey","Soham",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 04:52:48 GMT"}],"updateDate":"2024-08-27","timestamp":1724475168000,"abstract":"  Type-I solar noise storms are perhaps the most commonly observed active radio\nemissions from the Sun at meter-wavelengths. Noise storms have a long-lived and\nwideband continuum background with superposed islands of much brighter\nnarrowband and short-lived emissions, known as type-I bursts. There is a\nserious paucity of studies focusing on the morphology of these two types of\nemissions, primarily because of the belief that coronal scattering will always\nwash out any features at small angular scales. However, it is important to {\ninvestigate} their spatial structures in detail to make a spatio-temporal\nconnection with observations at extreme-ultraviolet/ X-ray bands to understand\nthe detailed nature of these emissions. In this work, we use high angular\nresolution observations from the upgraded Giant Metrewave Radio Telescope to\ndemonstrate that it is possible to detect structures with angular scales as\nsmall as $\\sim 9\\arcsec$, about three times smaller than the smallest structure\nreported to date from noise storms. Our observations also suggest while the\nindividual type-I bursts are narrowband in nature, the bursts are probably\ncaused by traveling disturbance(s) inducing magnetic reconnections at different\ncoronal heights, and thus leading to correlated change in the morphology of the\ntype-I bursts observed at a wide range of frequencies.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}