{"id":"2408.12185","title":"Rank and Align: Towards Effective Source-free Graph Domain Adaptation","authors":"Junyu Luo, Zhiping Xiao, Yifan Wang, Xiao Luo, Jingyang Yuan, Wei Ju,\n  Langechuan Liu, Ming Zhang","authorsParsed":[["Luo","Junyu",""],["Xiao","Zhiping",""],["Wang","Yifan",""],["Luo","Xiao",""],["Yuan","Jingyang",""],["Ju","Wei",""],["Liu","Langechuan",""],["Zhang","Ming",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 08:00:50 GMT"}],"updateDate":"2024-08-23","timestamp":1724313650000,"abstract":"  Graph neural networks (GNNs) have achieved impressive performance in graph\ndomain adaptation. However, extensive source graphs could be unavailable in\nreal-world scenarios due to privacy and storage concerns. To this end, we\ninvestigate an underexplored yet practical problem of source-free graph domain\nadaptation, which transfers knowledge from source models instead of source\ngraphs to a target domain. To solve this problem, we introduce a novel\nGNN-based approach called Rank and Align (RNA), which ranks graph similarities\nwith spectral seriation for robust semantics learning, and aligns inharmonic\ngraphs with harmonic graphs which close to the source domain for subgraph\nextraction. In particular, to overcome label scarcity, we employ the spectral\nseriation algorithm to infer the robust pairwise rankings, which can guide\nsemantic learning using a similarity learning objective. To depict distribution\nshifts, we utilize spectral clustering and the silhouette coefficient to detect\nharmonic graphs, which the source model can easily classify. To reduce\npotential domain discrepancy, we extract domain-invariant subgraphs from\ninharmonic graphs by an adversarial edge sampling process, which guides the\ninvariant learning of GNNs. Extensive experiments on several benchmark datasets\ndemonstrate the effectiveness of our proposed RNA.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7JWeKnqWlWlXaLFk1fof2rR-qSoWNPDPkAyhxhCElKM","pdfSize":"7696485"}
