{"id":"2408.11084","title":"Multi-level Monte-Carlo Gradient Methods for Stochastic Optimization\n  with Biased Oracles","authors":"Yifan Hu, Jie Wang, Xin Chen, Niao He","authorsParsed":[["Hu","Yifan",""],["Wang","Jie",""],["Chen","Xin",""],["He","Niao",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 17:56:16 GMT"}],"updateDate":"2024-08-22","timestamp":1724176576000,"abstract":"  We consider stochastic optimization when one only has access to biased\nstochastic oracles of the objective and the gradient, and obtaining stochastic\ngradients with low biases comes at high costs. This setting captures various\noptimization paradigms, such as conditional stochastic optimization,\ndistributionally robust optimization, shortfall risk optimization, and machine\nlearning paradigms, such as contrastive learning. We examine a family of\nmulti-level Monte Carlo (MLMC) gradient methods that exploit a delicate\ntradeoff among bias, variance, and oracle cost. We systematically study their\ntotal sample and computational complexities for strongly convex, convex, and\nnonconvex objectives and demonstrate their superiority over the widely used\nbiased stochastic gradient method. When combined with the variance reduction\ntechniques like SPIDER, these MLMC gradient methods can further reduce the\ncomplexity in the nonconvex regime. Our results imply that a series of\nstochastic optimization problems with biased oracles, previously considered to\nbe more challenging, is fundamentally no harder than the classical stochastic\noptimization with unbiased oracles. We also delineate the boundary conditions\nunder which these problems become more difficult. Moreover, MLMC gradient\nmethods significantly improve the best-known complexities in the literature for\nconditional stochastic optimization and shortfall risk optimization. Our\nextensive numerical experiments on distributionally robust optimization,\npricing and staffing scheduling problems, and contrastive learning demonstrate\nthe superior performance of MLMC gradient methods.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"yhkJx7vFC5elAYsER5Df-5vg0TB1B1GNSG5yqmsf60s","pdfSize":"1971996"}
