{"id":"2408.01051","title":"From Stem to Stern: Contestability Along AI Value Chains","authors":"Agathe Balayn, Yulu Pi, David Gray Widder, Kars Alfrink, Mireia\n  Yurrita, Sohini Upadhyay, Naveena Karusala, Henrietta Lyons, Cagatay Turkay,\n  Christelle Tessono, Blair Attard-Frost, Ujwal Gadiraju","authorsParsed":[["Balayn","Agathe",""],["Pi","Yulu",""],["Widder","David Gray",""],["Alfrink","Kars",""],["Yurrita","Mireia",""],["Upadhyay","Sohini",""],["Karusala","Naveena",""],["Lyons","Henrietta",""],["Turkay","Cagatay",""],["Tessono","Christelle",""],["Attard-Frost","Blair",""],["Gadiraju","Ujwal",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 06:57:52 GMT"}],"updateDate":"2024-08-05","timestamp":1722581872000,"abstract":"  This workshop will grow and consolidate a community of interdisciplinary CSCW\nresearchers focusing on the topic of contestable AI. As an outcome of the\nworkshop, we will synthesize the most pressing opportunities and challenges for\ncontestability along AI value chains in the form of a research roadmap. This\nroadmap will help shape and inspire imminent work in this field. Considering\nthe length and depth of AI value chains, it will especially spur discussions\naround the contestability of AI systems along various sites of such chains. The\nworkshop will serve as a platform for dialogue and demonstrations of concrete,\nsuccessful, and unsuccessful examples of AI systems that (could or should) have\nbeen contested, to identify requirements, obstacles, and opportunities for\ndesigning and deploying contestable AI in various contexts. This will be held\nprimarily as an in-person workshop, with some hybrid accommodation. The day\nwill consist of individual presentations and group activities to stimulate\nideation and inspire broad reflections on the field of contestable AI. Our aim\nis to facilitate interdisciplinary dialogue by bringing together researchers,\npractitioners, and stakeholders to foster the design and deployment of\ncontestable AI.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}