{"id":"2408.11999","title":"Layers of electron captures in the crust of accreting neutron stars","authors":"Lami Suleiman, Julian-Leszek Zdunik, Pawel Haensel","authorsParsed":[["Suleiman","Lami",""],["Zdunik","Julian-Leszek",""],["Haensel","Pawel",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 21:30:13 GMT"}],"updateDate":"2024-08-23","timestamp":1724275813000,"abstract":"  The accumulation of accreted matter onto the neutron star surface triggers\nexothermic reactions in the crust. The heat released as a result influences the\nluminosity exhibited by the X-ray transient. The most common approach to the\nkinetics of exothermic reactions in the crust of accreting neutron stars is to\nconsider an infinite reaction rate. Here, we investigate accretion-related heat\nrelease in the accreted outer crust of a neutron star by including a\ntime-dependent accretion cycle and experimentally based reaction rates in the\nkinetics of electron captures above the reaction threshold. A simple model was\nused to compute the zero temperature equation of state of a crust in which two\nnuclei can coexist. We solved the abundance of parent nuclei as a function of\nthe depth in the star and the time variable using astrophysically motivated\nfeatures of the accreting system. We calculated the heat release and neutrino\nloss associated to reactions in the outer crust. We report the existence of\nlayers in the outer crust, which contain both parent and grand-daughter nuclei\nof electron captures. The reactions can occur deeper in the shell than the\nreaction threshold, thus releasing more heat per accreted baryon for a given\naccretion rate. The electron capture layers continue to exist even when the\naccretion has stopped. The heat sources are time- and pressure-dependent in\naccreting crusts of neutron stars. The total heat released is a function of\nastrophysical (active and quiescent time) and microscopic (reaction rate)\nparameters Therefore, we conclude these parameters should be considered\nindividually and carefully for a range of different sources.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}