{"id":"2408.14940","title":"Bayesian spatiotemporal modelling of political violence and conflict\n  events using discrete-time Hawkes processes","authors":"Raiha Browning, Hamish Patten, Judith Rousseau, Kerrie Mengersen","authorsParsed":[["Browning","Raiha",""],["Patten","Hamish",""],["Rousseau","Judith",""],["Mengersen","Kerrie",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 10:24:46 GMT"}],"updateDate":"2024-08-28","timestamp":1724754286000,"abstract":"  Monitoring of conflict risk in the humanitarian sector is largely based on\nsimple historic averages. To advance our understanding, we propose Hawkes\nprocesses, a self-exciting stochastic process used to describe phenomena\nwhereby past events increase the probability of future events occurring. The\noverarching goal of this work is to assess the potential for using a more\nstatistically rigorous approach to monitor the risk of political violence and\nconflict events in practice and characterise their temporal and spatial\npatterns.\n  The region of South Asia was selected as an exemplar of how our model can be\napplied globally. We individually analyse the various types of conflict events\nfor the countries in this region and compare the results. A Bayesian,\nspatiotemporal variant of the Hawkes process is fitted to data gathered by the\nArmed Conflict Location and Event Data (ACLED) project to obtain sub-national\nestimates of conflict risk over time and space. Our model can effectively\nestimate the risk level of these events within a statistically sound framework,\nwith a more precise understanding of the uncertainty around these estimates\nthan was previously possible. This work enables a better understanding of\nconflict events which can inform preventative measures.\n  We demonstrate the advantages of the Bayesian framework by comparing our\nresults to maximum likelihood estimation. While maximum likelihood gives\nreasonable point estimates, the Bayesian approach is preferred when possible.\nPractical examples are presented to demonstrate how the proposed model can be\nused to monitor conflict risk. Comparing to current practices that rely on\nhistorical averages, we also show that our model is more stable and robust to\noutliers. In this work we aim to support actors in the humanitarian sector in\nmaking data-informed decisions, such as the allocation of resources in\nconflict-prone regions.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7o5Qtp9Mje7Yyk-a2ZP9_ATvrcS8XqvrOoprnxqEQjw","pdfSize":"42849707"}
