{"id":"2408.02763","title":"A critical reassessment of \"Restricted Weyl Symmetry\"","authors":"Dra\\v{z}en Glavan, Ruggero Noris, Tom Zlosnik","authorsParsed":[["Glavan","Dražen",""],["Noris","Ruggero",""],["Zlosnik","Tom",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 18:26:39 GMT"}],"updateDate":"2024-08-07","timestamp":1722882399000,"abstract":"  A class of globally scale-invariant scalar-tensor theories have been proposed\nto be invariant under a larger class of transformations that take the form of\nlocal Weyl transformations supplemented by a restriction that the conformal\nfactor satisfies a covariant Klein-Gordon equation. The action of these\ntheories indeed seems to be invariant under such transformations up to boundary\nterms, this property being referred to as \"restricted Weyl symmetry\". However,\nwe find that corresponding equations of motion are not invariant under these\ntransformations. This is a paradox, that is explained by realizing that the\nrestriction condition on the conformal factor forces the \"restricted Weyl\ntransformation\" to be a nonlocal transformation. For nonlocal transformations\nwould-be boundary terms cannot in general be discarded from the action.\nMoreover, variations of trajectories cannot be assumed to vanish at boundaries\nof the action when deriving equations of motion. We illustrate both of these\nless known properties by considering a series of simple examples. Finally, we\napply these observations to the case of globally scale-invariant scalar-tensor\ntheories to demonstrate that \"restricted Weyl transformations\" are, in fact,\nnot symmetries of the full system.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CMnxjIm7IQ0Wqnj0hLWCpmGowvLhwkO6KwMfmUvqPTg","pdfSize":"268803","txDigest":"3fsskpj7NEGHNe83X7ZB8xU2y7CvWr4GK3Xs7ES2PPS7","endEpoch":"1","status":"CERTIFIED"}
