{"id":"2408.06897","title":"Five new eclipsing binaries with low-mass companions","authors":"J. Lipt\\'ak, M. Skarka, E. Guenther, P. Chaturvedi, M. V\\'itkov\\'a, R.\n  Karjalainen, J. \\v{S}ubjak, A. Hatzes, A. Bieryla, D. Gandolfi, S.H.\n  Albrecht, P.G. Beck, H.J. Deeg, M.E. Everett, J. Higuera, D. Jones, S.\n  Mathur, Y.G. Patel, C.M. Persson, S. Redfield and P. Kab\\'ath","authorsParsed":[["Lipták","J.",""],["Skarka","M.",""],["Guenther","E.",""],["Chaturvedi","P.",""],["Vítková","M.",""],["Karjalainen","R.",""],["Šubjak","J.",""],["Hatzes","A.",""],["Bieryla","A.",""],["Gandolfi","D.",""],["Albrecht","S. H.",""],["Beck","P. G.",""],["Deeg","H. J.",""],["Everett","M. E.",""],["Higuera","J.",""],["Jones","D.",""],["Mathur","S.",""],["Patel","Y. G.",""],["Persson","C. M.",""],["Redfield","S.",""],["Kabáth","P.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 13:47:12 GMT"}],"updateDate":"2024-08-14","timestamp":1723556832000,"abstract":"  Precise space-based photometry from the Transiting Exoplanet Survey Satellite\nresults in a huge number of exoplanetary candidates. However, the masses of\nthese objects are unknown and must be determined by ground-based spectroscopic\nfollow-up observations, frequently revealing the companions to be low-mass\nstars rather than exoplanets. We present the first orbital and stellar\nparameter solutions for five such eclipsing binary-star systems using\nradial-velocity follow-up measurements together with\nspectral-energy-distribution solutions. TOI-416 and TOI-1143 are totally\neclipsing F+M star systems with well-determined secondary masses, radii, and\ntemperatures. TOI-416 is a circular system with an F6 primary and a secondary\nwith a mass of $M_2={0.131(8)}{M_\\odot}$. TOI-1143 consists of an F6 primary\nwith an $M_2={0.142(3)}{M_\\odot}$ secondary on an eccentric orbit with a third\ncompanion. With respect to the other systems, TOI-1153 shows ellipsoidal\nvariations, TOI-1615 contains a pulsating primary, and TOI-1788 has a spotted\nprimary, while all have moderate mass ratios of 0.2-0.4. However, these systems\nare in a grazing configuration, which limits their full description. The\nparameters of TOI-416B and TOI-1143B are suitable for the calibration of the\nradius-mass relation for dwarf stars.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}