{"id":"2408.00761","title":"Tamper-Resistant Safeguards for Open-Weight LLMs","authors":"Rishub Tamirisa, Bhrugu Bharathi, Long Phan, Andy Zhou, Alice Gatti,\n  Tarun Suresh, Maxwell Lin, Justin Wang, Rowan Wang, Ron Arel, Andy Zou, Dawn\n  Song, Bo Li, Dan Hendrycks, Mantas Mazeika","authorsParsed":[["Tamirisa","Rishub",""],["Bharathi","Bhrugu",""],["Phan","Long",""],["Zhou","Andy",""],["Gatti","Alice",""],["Suresh","Tarun",""],["Lin","Maxwell",""],["Wang","Justin",""],["Wang","Rowan",""],["Arel","Ron",""],["Zou","Andy",""],["Song","Dawn",""],["Li","Bo",""],["Hendrycks","Dan",""],["Mazeika","Mantas",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 17:59:12 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 22:46:04 GMT"},{"version":"v3","created":"Sat, 14 Sep 2024 02:43:00 GMT"}],"updateDate":"2024-09-17","timestamp":1722535152000,"abstract":"  Rapid advances in the capabilities of large language models (LLMs) have\nraised widespread concerns regarding their potential for malicious use.\nOpen-weight LLMs present unique challenges, as existing safeguards lack\nrobustness to tampering attacks that modify model weights. For example, recent\nworks have demonstrated that refusal and unlearning safeguards can be trivially\nremoved with a few steps of fine-tuning. These vulnerabilities necessitate new\napproaches for enabling the safe release of open-weight LLMs. We develop a\nmethod, called TAR, for building tamper-resistant safeguards into open-weight\nLLMs such that adversaries cannot remove the safeguards even after thousands of\nsteps of fine-tuning. In extensive evaluations and red teaming analyses, we\nfind that our method greatly improves tamper-resistance while preserving benign\ncapabilities. Our results demonstrate that tamper-resistance is a tractable\nproblem, opening up a promising new avenue to improve the safety and security\nof open-weight LLMs.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}