{"id":"2408.14971","title":"Probing coronal mass ejections inclination effects with EUHFORIA","authors":"Karmen Martini\\'c, Eleanna Asvestari, Mateja Dumbovi\\'c, Tobias\n  Rindlisbacher, Manuela Temmer, Bojan Vr\\v{s}nak","authorsParsed":[["Martinić","Karmen",""],["Asvestari","Eleanna",""],["Dumbović","Mateja",""],["Rindlisbacher","Tobias",""],["Temmer","Manuela",""],["Vršnak","Bojan",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 11:23:55 GMT"}],"updateDate":"2024-08-28","timestamp":1724757835000,"abstract":"  Coronal mass ejections (CMEs) are complex magnetized plasma structures in\nwhich the magnetic field spirals around a central axis, forming what is known\nas a flux rope (FR). The central FR axis can be oriented at any angle to the\necliptic. Throughout its journey, a CME will encounter interplanetary magnetic\nfield and solar wind which are neither homogeneous nor isotropic. Consequently,\nCMEs with different orientations will encounter different ambient medium\nconditions and, thus, the interaction of a CME with its surrounding environment\nwill vary depending on the orientation of its FR axis, among other factors.\nThis study aims to understand the effect of inclination on CME propagation. We\nperformed simulations with the EUHFORIA 3D magnetohydrodynamic model. This\nstudy focuses on two CMEs modelled as spheromaks with nearly identical\nproperties, differing only by their inclination. We show the effects of CME\norientation on sheath evolution, MHD drag, and non-radial flows by analyzing\nthe model data from a swarm of 81 virtual spacecraft scattered across the inner\nheliospheric. We have found that the sheath duration increases with radial\ndistance from the Sun and that the rate of increase is greater on the flanks of\nthe CME. Non-radial flows within the studied sheath region appear larger\noutside the ecliptic plane, indicating a \"sliding\" of the IMF in the out-of\necliptic plane. We found that the calculated drag parameter does not remain\nconstant with radial distance and that the inclination dependence of the drag\nparameter can not be resolved with our numerical setup.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}