{"id":"2408.05667","title":"PhishLang: A Lightweight, Client-Side Phishing Detection Framework using\n  MobileBERT for Real-Time, Explainable Threat Mitigation","authors":"Sayak Saha Roy, Shirin Nilizadeh","authorsParsed":[["Roy","Sayak Saha",""],["Nilizadeh","Shirin",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 01:14:13 GMT"},{"version":"v2","created":"Mon, 9 Sep 2024 23:46:59 GMT"}],"updateDate":"2024-09-11","timestamp":1723338853000,"abstract":"  In this paper, we introduce PhishLang, an open-source, lightweight language\nmodel specifically designed for phishing website detection through contextual\nanalysis of the website. Unlike traditional heuristic or machine learning\nmodels that rely on static features and struggle to adapt to new threats, and\ndeep learning models that are computationally intensive, our model leverages\nMobileBERT, a fast and memory-efficient variant of the BERT architecture, to\nlearn granular features characteristic of phishing attacks. PhishLang operates\nwith minimal data preprocessing and offers performance comparable to leading\ndeep learning anti-phishing tools, while being significantly faster and less\nresource-intensive. Over a 3.5-month testing period, PhishLang successfully\nidentified 25,796 phishing URLs, many of which were undetected by popular\nantiphishing blocklists, thus demonstrating its potential to enhance current\ndetection measures. Capitalizing on PhishLang's resource efficiency, we release\nthe first open-source fully client-side Chromium browser extension that\nprovides inference locally without requiring to consult an online blocklist and\ncan be run on low-end systems with no impact on inference times. Our\nimplementation not only outperforms prevalent (server-side) phishing tools, but\nis significantly more effective than the limited commercial client-side\nmeasures available. Furthermore, we study how PhishLang can be integrated with\nGPT-3.5 Turbo to create explainable blocklisting -- which, upon detection of a\nwebsite, provides users with detailed contextual information about the features\nthat led to a website being marked as phishing.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IgK1wSbiILju_RMmXdhvJXaffXPbYEnXJzDYX1dHF3U","pdfSize":"3365359"}
