{"id":"2408.08915","title":"A Survey on Blockchain-based Supply Chain Finance with Progress and\n  Future directions","authors":"Zhengdong Luo","authorsParsed":[["Luo","Zhengdong",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 15:08:51 GMT"}],"updateDate":"2024-08-20","timestamp":1723648131000,"abstract":"  Supply Chain Finance is very important for supply chain competition, which is\nan important tool to activate the capital flow in the supply chain. Supply\nChain Finance-related research can support multiple applications and services,\nsuch as providing accounts receivable financing, enhancing risk management, and\noptimizing supply chain management. For more than a decade, the development of\nBlockchain has attracted widely attention in various fields, especially in\nfinance. With the characteristics of data tamper-proof, forgery-proof,\ncryptography, consensus verification, and decentralization, Blockchain fits\nwell with the realistic needs of Supply Chain Finance, which requires data\nintegrity, authenticity, privacy, and information sharing. Therefore, it is\ntime to summarize the applications of Blockchain technology in the field of\nSupply Chain Finance. What Blockchain technology brings to Supply Chain Finance\nis not only to alleviate the problems of information asymmetry, credit\ndisassembly, and financing cost, but also to improve Supply Chain Finance\noperations through smart contracts to intelligent Supply Chain Finance and in\ncombination with other technologies, such as artificial intelligence, cloud\ncomputing, and data mining, jointly. So there has been some work in\nBlockchain-based Supply Chain Finance research for different Supply Chain\nFinance oriented applications, but most of these work are at the management\nlevel to propose conceptual frameworks or simply use Blockchain without\nexploiting its deep applications. Moreover, there are few systematic reviews\nproviding a comprehensive summary of current work in the area of\nBlockchain-based Supply Chain Finance. In this paper, we ...\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}