{"id":"2408.12122","title":"On the Credibility of Backdoor Attacks Against Object Detectors in the\n  Physical World","authors":"Bao Gia Doan, Dang Quang Nguyen, Callum Lindquist, Paul Montague,\n  Tamas Abraham, Olivier De Vel, Seyit Camtepe, Salil S. Kanhere, Ehsan\n  Abbasnejad, Damith C. Ranasinghe","authorsParsed":[["Doan","Bao Gia",""],["Nguyen","Dang Quang",""],["Lindquist","Callum",""],["Montague","Paul",""],["Abraham","Tamas",""],["De Vel","Olivier",""],["Camtepe","Seyit",""],["Kanhere","Salil S.",""],["Abbasnejad","Ehsan",""],["Ranasinghe","Damith C.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 04:29:48 GMT"}],"updateDate":"2024-09-17","timestamp":1724300988000,"abstract":"  Object detectors are vulnerable to backdoor attacks. In contrast to\nclassifiers, detectors possess unique characteristics, architecturally and in\ntask execution; often operating in challenging conditions, for instance,\ndetecting traffic signs in autonomous cars. But, our knowledge dominates\nattacks against classifiers and tests in the \"digital domain\".\n  To address this critical gap, we conducted an extensive empirical study\ntargeting multiple detector architectures and two challenging detection tasks\nin real-world settings: traffic signs and vehicles. Using the diverse,\nmethodically collected videos captured from driving cars and flying drones,\nincorporating physical object trigger deployments in authentic scenes, we\ninvestigated the viability of physical object-triggered backdoor attacks in\napplication settings.\n  Our findings revealed 8 key insights. Importantly, the prevalent \"digital\"\ndata poisoning method for injecting backdoors into models does not lead to\neffective attacks against detectors in the real world, although proven\neffective in classification tasks. We construct a new, cost-efficient attack\nmethod, dubbed MORPHING, incorporating the unique nature of detection tasks;\nours is remarkably successful in injecting physical object-triggered backdoors,\neven capable of poisoning triggers with clean label annotations or invisible\ntriggers without diminishing the success of physical object triggered\nbackdoors. We discovered that the defenses curated are ill-equipped to\nsafeguard detectors against such attacks. To underscore the severity of the\nthreat and foster further research, we, for the first time, release an\nextensive video test set of real-world backdoor attacks. Our study not only\nestablishes the credibility and seriousness of this threat but also serves as a\nclarion call to the research community to advance backdoor defenses in the\ncontext of object detection.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"okLjkH50ftENrACmYUV33kWEDhbI-9B2vAELeGVQEDM","pdfSize":"15032904"}
