{"id":"2408.15183","title":"On latent dynamics learning in nonlinear reduced order modeling","authors":"Nicola Farenga, Stefania Fresca, Simone Brivio, Andrea Manzoni","authorsParsed":[["Farenga","Nicola",""],["Fresca","Stefania",""],["Brivio","Simone",""],["Manzoni","Andrea",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 16:35:06 GMT"}],"updateDate":"2024-08-28","timestamp":1724776506000,"abstract":"  In this work, we present the novel mathematical framework of latent dynamics\nmodels (LDMs) for reduced order modeling of parameterized nonlinear\ntime-dependent PDEs. Our framework casts this latter task as a nonlinear\ndimensionality reduction problem, while constraining the latent state to evolve\naccordingly to an (unknown) dynamical system. A time-continuous setting is\nemployed to derive error and stability estimates for the LDM approximation of\nthe full order model (FOM) solution. We analyze the impact of using an explicit\nRunge-Kutta scheme in the time-discrete setting, resulting in the\n$\\Delta\\text{LDM}$ formulation, and further explore the learnable setting,\n$\\Delta\\text{LDM}_\\theta$, where deep neural networks approximate the discrete\nLDM components, while providing a bounded approximation error with respect to\nthe FOM. Moreover, we extend the concept of parameterized Neural ODE - recently\nproposed as a possible way to build data-driven dynamical systems with varying\ninput parameters - to be a convolutional architecture, where the input\nparameters information is injected by means of an affine modulation mechanism,\nwhile designing a convolutional autoencoder neural network able to retain\nspatial-coherence, thus enhancing interpretability at the latent level.\nNumerical experiments, including the Burgers' and the\nadvection-reaction-diffusion equations, demonstrate the framework's ability to\nobtain, in a multi-query context, a time-continuous approximation of the FOM\nsolution, thus being able to query the LDM approximation at any given time\ninstance while retaining a prescribed level of accuracy. Our findings highlight\nthe remarkable potential of the proposed LDMs, representing a mathematically\nrigorous framework to enhance the accuracy and approximation capabilities of\nreduced order modeling for time-dependent parameterized PDEs.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Machine Learning","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}