{"id":"2408.07979","title":"Role of host/guest coupling in stabilizing the phases of the\n  over-tolerant hybrid perovskite MHyPbX3","authors":"Pradhi Srivastava, Sayan Maity, Varadharajan Srinivasan","authorsParsed":[["Srivastava","Pradhi",""],["Maity","Sayan",""],["Srinivasan","Varadharajan",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 06:55:43 GMT"}],"updateDate":"2024-08-16","timestamp":1723704943000,"abstract":"  $MHyPbBr_xCl_{3-x}$ exhibits an interesting temperature-induced phase diagram\ntransitioning from monoclinic (Phase-II) to orthorhombic (Phase-I) and\neventually to the high-temperature disordered cubic phase. However,\nexperimental observations indicate the absence of either the cubic or\northorhombic phases in compositions with x=0 (chloride) and x=3 (bromide),\nrespectively. We explain the composition dependence of the phase transition\nsequence in MHyPbX3 (X = Cl, Br) from the perspective of a host/guest framework\nfor the system. We argue that the sequence of phase transitions in MHyPbX3 can\nbe anticipated based on the competition between host distortion and host/guest\ncoupling energies. A dominant coupling in MHyPbCl3 ensures the stabilization of\nthe intermediate Phase-I while pushing the transition to cubic phase beyond its\ndecomposition temperature. On the other hand, a balance of the energy scales in\nMHyPbBr3 suppresses Phase-I and stabilizes the cubic phase. Our expectations\nwere supported by first-principles based estimates of the transition\ntemperatures in both compounds, which yield trends in agreement with\nexperimental observations. Furthermore, ab initio molecular dynamics\nsimulations revealed that the cubic phase of MHyPbBr3 results from a disorder\nover locally orthorhombic structures, a clear manifestation of the balance of\nenergy scales. We propose that the same concept can be employed to predict the\nstable phases in other hybrid perovskites.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}