{"id":"2408.06224","title":"A Multi-Year Grey Literature Review on AI-assisted Test Automation","authors":"Filippo Ricca, Alessandro Marchetto, Andrea Stocco","authorsParsed":[["Ricca","Filippo",""],["Marchetto","Alessandro",""],["Stocco","Andrea",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 15:26:36 GMT"}],"updateDate":"2024-08-13","timestamp":1723476396000,"abstract":"  Context: Test Automation (TA) techniques are crucial for quality assurance in\nsoftware engineering but face limitations such as high test suite maintenance\ncosts and the need for extensive programming skills. Artificial Intelligence\n(AI) offers new opportunities to address these issues through automation and\nimproved practices. Objectives: This study surveys grey literature to explore\nhow AI is adopted in TA, focusing on the problems it solves, its solutions, and\nthe available tools. Additionally, the study gathers expert insights to\nunderstand AI's current and future role in TA. Methods: We reviewed over 3,600\ngrey literature sources over five years, including blogs, white papers, and\nuser manuals, and finally filtered 342 documents to develop taxonomies of TA\nproblems and AI solutions. We also cataloged 100 AI-driven TA tools and\ninterviewed five expert software testers to gain insights into AI's current and\nfuture role in TA. Results: The study found that manual test code development\nand maintenance are the main challenges in TA. In contrast, automated test\ngeneration and self-healing test scripts are the most common AI solutions. We\nidentified 100 AI-based TA tools, with Applitools, Testim, Functionize, AccelQ,\nand Mabl being the most adopted in practice. Conclusion: This paper offers a\ndetailed overview of AI's impact on TA through grey literature analysis and\nexpert interviews. It presents new taxonomies of TA problems and AI solutions,\nprovides a catalog of AI-driven tools, and relates solutions to problems and\ntools to solutions. Interview insights further revealed the state and future\npotential of AI in TA. Our findings support practitioners in selecting TA tools\nand guide future research directions.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"X9vkhRmg-LBCrAG7VkmVtFhRirIfaDmqzZgxacvGn4A","pdfSize":"1839803"}
