{"id":"2408.16272","title":"Beyond Uncertainty: Evidential Deep Learning for Robust Video Temporal\n  Grounding","authors":"Kaijing Ma, Haojian Huang, Jin Chen, Haodong Chen, Pengliang Ji,\n  Xianghao Zang, Han Fang, Chao Ban, Hao Sun, Mulin Chen, Xuelong Li","authorsParsed":[["Ma","Kaijing",""],["Huang","Haojian",""],["Chen","Jin",""],["Chen","Haodong",""],["Ji","Pengliang",""],["Zang","Xianghao",""],["Fang","Han",""],["Ban","Chao",""],["Sun","Hao",""],["Chen","Mulin",""],["Li","Xuelong",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 05:32:03 GMT"}],"updateDate":"2024-08-30","timestamp":1724909523000,"abstract":"  Existing Video Temporal Grounding (VTG) models excel in accuracy but often\noverlook open-world challenges posed by open-vocabulary queries and untrimmed\nvideos. This leads to unreliable predictions for noisy, corrupted, and\nout-of-distribution data. Adapting VTG models to dynamically estimate\nuncertainties based on user input can address this issue. To this end, we\nintroduce SRAM, a robust network module that benefits from a two-stage\ncross-modal alignment task. More importantly, it integrates Deep Evidential\nRegression (DER) to explicitly and thoroughly quantify uncertainty during\ntraining, thus allowing the model to say \"I do not know\" in scenarios beyond\nits handling capacity. However, the direct application of traditional DER\ntheory and its regularizer reveals structural flaws, leading to unintended\nconstraints in VTG tasks. In response, we develop a simple yet effective\nGeom-regularizer that enhances the uncertainty learning framework from the\nground up. To the best of our knowledge, this marks the first successful\nattempt of DER in VTG. Our extensive quantitative and qualitative results\naffirm the effectiveness, robustness, and interpretability of our modules and\nthe uncertainty learning paradigm in VTG tasks. The code will be made\navailable.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}