{"id":"2408.00348","title":"Securing the Diagnosis of Medical Imaging: An In-depth Analysis of\n  AI-Resistant Attacks","authors":"Angona Biswas, MD Abdullah Al Nasim, Kishor Datta Gupta, Roy George,\n  Abdur Rashid","authorsParsed":[["Biswas","Angona",""],["Nasim","MD Abdullah Al",""],["Gupta","Kishor Datta",""],["George","Roy",""],["Rashid","Abdur",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 07:37:27 GMT"}],"updateDate":"2024-08-02","timestamp":1722497847000,"abstract":"  Machine learning (ML) is a rapidly developing area of medicine that uses\nsignificant resources to apply computer science and statistics to medical\nissues. ML's proponents laud its capacity to handle vast, complicated, and\nerratic medical data. It's common knowledge that attackers might cause\nmisclassification by deliberately creating inputs for machine learning\nclassifiers. Research on adversarial examples has been extensively conducted in\nthe field of computer vision applications. Healthcare systems are thought to be\nhighly difficult because of the security and life-or-death considerations they\ninclude, and performance accuracy is very important. Recent arguments have\nsuggested that adversarial attacks could be made against medical image analysis\n(MedIA) technologies because of the accompanying technology infrastructure and\npowerful financial incentives. Since the diagnosis will be the basis for\nimportant decisions, it is essential to assess how strong medical DNN tasks are\nagainst adversarial attacks. Simple adversarial attacks have been taken into\naccount in several earlier studies. However, DNNs are susceptible to more risky\nand realistic attacks. The present paper covers recent proposed adversarial\nattack strategies against DNNs for medical imaging as well as countermeasures.\nIn this study, we review current techniques for adversarial imaging attacks,\ndetections. It also encompasses various facets of these techniques and offers\nsuggestions for the robustness of neural networks to be improved in the future.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}