{"id":"2408.10206","title":"The Resonant Remains of Broken Chains from Major and Minor Mergers","authors":"Rixin Li, Eugene Chiang, Nick Choksi, Fei Dai","authorsParsed":[["Li","Rixin",""],["Chiang","Eugene",""],["Choksi","Nick",""],["Dai","Fei",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 17:59:57 GMT"}],"updateDate":"2024-08-20","timestamp":1724090397000,"abstract":"  Observations with the Transiting Exoplanet Survey Satellite and Kepler have\nrevealed that practically all close-in sub-Neptunes form in mean-motion\nresonant chains, most of which unravel on timescales of 100 Myr. Using a series\nof N-body integrations, we study how planetary collisions resulting from the\ndestabilization of resonant chains produce the distribution of orbital periods\nobserved among mature systems, focusing on the resonant fine structures that\nremain post-instability. In their natal chains, planets near first-order\nresonances have period ratios just wide of perfect commensurability, driven\nthere by disk migration and eccentricity damping. Sufficiently large resonant\nlibration amplitudes (of unknown origin) are needed to trigger instability.\nEnsuing collisions between planets (\"major mergers\") erode but do not\ncompletely eliminate resonant pairs; survivors which avoid mergers show up as\nnarrow \"peaks\" just wide of commensurability in the histogram of\nneighboring-planet period ratios. Merger products exhibit a broad range of\nperiod ratios, with each resonant peak in the histogram spawning a continuum of\nratios wide of the given resonance. These continua may fill in period ratios\nbetween relatively closely separated resonances such as the 5:4, 4:3, and 3:2,\nbut may fail to bridge the relatively wide gap between the 3:2 and the 2:1.\nThus a \"trough\" manifests just short of the 2:1 resonance (and only the 2:1\nresonance), as observed. Major mergers are not perfect, and generate\ncollisional debris which undergoes \"minor mergers\" with planets, in many cases\nfurther widening resonant pairs. With all this dynamical activity, free\neccentricities of resonant pairs, and by extension the phases of their transit\ntiming variations (TTVs), are readily excited. Because non-resonant planets are\nmerger products, they are predicted to have higher masses than resonant\nplanets.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qAL_gku8KMSimrRPjnIF_R3CAjHX6shcGwtMwhBAogM","pdfSize":"1504971"}
