{"id":"2408.04385","title":"Non-maximizing policies that fulfill multi-criterion aspirations in\n  expectation","authors":"Simon Dima, Simon Fischer, Jobst Heitzig, Joss Oliver","authorsParsed":[["Dima","Simon",""],["Fischer","Simon",""],["Heitzig","Jobst",""],["Oliver","Joss",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 11:41:04 GMT"}],"updateDate":"2024-08-09","timestamp":1723117264000,"abstract":"  In dynamic programming and reinforcement learning, the policy for the\nsequential decision making of an agent in a stochastic environment is usually\ndetermined by expressing the goal as a scalar reward function and seeking a\npolicy that maximizes the expected total reward. However, many goals that\nhumans care about naturally concern multiple aspects of the world, and it may\nnot be obvious how to condense those into a single reward function.\nFurthermore, maximization suffers from specification gaming, where the obtained\npolicy achieves a high expected total reward in an unintended way, often taking\nextreme or nonsensical actions.\n  Here we consider finite acyclic Markov Decision Processes with multiple\ndistinct evaluation metrics, which do not necessarily represent quantities that\nthe user wants to be maximized. We assume the task of the agent is to ensure\nthat the vector of expected totals of the evaluation metrics falls into some\ngiven convex set, called the aspiration set. Our algorithm guarantees that this\ntask is fulfilled by using simplices to approximate feasibility sets and\npropagate aspirations forward while ensuring they remain feasible. It has\ncomplexity linear in the number of possible state-action-successor triples and\npolynomial in the number of evaluation metrics. Moreover, the explicitly\nnon-maximizing nature of the chosen policy and goals yields additional degrees\nof freedom, which can be used to apply heuristic safety criteria to the choice\nof actions. We discuss several such safety criteria that aim to steer the agent\ntowards more conservative behavior.\n","subjects":["Computing Research Repository/Artificial Intelligence","Economics/Theoretical Economics","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"p8Ya8wPpBjMN64K9f1YTsCWX7NBxHnCTyD-DTvLgUEg","pdfSize":"648383"}
