{"id":"2408.16714","title":"ARINC 429 Cyber-vulnerabilities and Voltage Data in a\n  Hardware-in-the-Loop Simulator","authors":"Connor Trask, Steve Movit, Justace Clutter, Rosene Clark, Mark\n  Herrera, Kelly Tran","authorsParsed":[["Trask","Connor",""],["Movit","Steve",""],["Clutter","Justace",""],["Clark","Rosene",""],["Herrera","Mark",""],["Tran","Kelly",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 17:06:20 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 13:50:37 GMT"}],"updateDate":"2024-09-02","timestamp":1724951180000,"abstract":"  ARINC 429 is a ubiquitous data bus for civil avionics, enabling reliable\ncommunication between devices from disparate manufacturers. However, ARINC 429\nlacks any form of encryption or authentication, making it an inherently\ninsecure communication protocol and rendering any connected avionics vulnerable\nto a range of attacks. We constructed a hardware-in-the-loop simulator with\nARINC 429 buses, explored these vulnerabilities, and identified their potential\nto deny, degrade, or disrupt aircraft capabilities. We performed a\ndenial-of-service attack against a multi-function display via a compromised\nARINC 429 bus using commercially available tools, which succeeded in disabling\nimportant navigational aids. This proven attack on physical avionics\nillustrates the risk inherent in ARINC 429 and the need for the ability to\ndetect these attacks. One potential mitigation is an intrusion detection system\n(IDS) trained on data collected from the electrical properties of the physical\nbus. Although previous research has demonstrated the feasibility of an IDS on\nan ARINC 429 bus, no IDS has been trained on data generated by avionics\nhardware. To facilitate this, we recorded voltage traces and message history\ngenerated by avionics and adversarial devices on the ARINC 429 bus. To the best\nof our knowledge, this is the first publicly available collection of\nhardware-generated ARINC 429 signal data.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}