{"id":"2408.14618","title":"High-dimensional Gaussian linear processes: Marchenko-Pastur beyond\n  simultaneous diagonalizability","authors":"Ben Deitmar","authorsParsed":[["Deitmar","Ben",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 20:24:02 GMT"}],"updateDate":"2024-08-28","timestamp":1724703842000,"abstract":"  Except for trivial cases, the eigenvectors of spectral density matrices\n$f(\\theta)$ corresponding to stationary Gaussian process depend explicitly on\nthe frequency $\\theta \\in [0,2\\pi]$. The most commonly used estimator of the\nspectral density matrix is the smoothed periodogram, which takes the form of\nsample covariance matrices $YY^T$ for data-matrices $Y$ with iid columns that\neach have differing underlying covariance structure. However, the covariance\nmatrices of the columns need not be simultaneously diagonalizable and\ntherefore, such sample covariance matrices are out of reach for the current\nstate of random matrix theory. In this paper, we derive a Marchenko-Pastur law\nin this non-simultaneously diagonalizable case. On the technical level, we make\nthe following two major contributions:\n  - Except for negligible approximations we construct a matrix with the same\neigenvalue distribution as the smoothed periodogram, but which is much more\naccessible. To this aim, we introduce a generalization of graph-theoretical\nmethods specific to Gaussian random matrices, which allow for the exploitation\nof independence properties in-between either columns or rows.\n  - By means of the Lagrange inversion formula, we draw a novel connection\nbetween trace moment expansions and the Marchen\\-ko-Pastur equation, which\nenables us to formulate deviation inequalities for the corresponding $l$-th\nmoments for all $l \\in \\mathbb{N}$.\n  The Marchenko-Pastur law emerges when the dimension $d$ of the process and\nthe smoothing span $m$ of the smoothed periodogram grow at the same rate, which\nis slower than the number of observations $n$.\n","subjects":["Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}