{"id":"2408.07274","title":"Exact Boundary Controllability for Reduced System Associated to Extended\n  Maxwell Systems","authors":"Maarten V. de Hoop, Ching-Lung Lin, Gen Nakamura","authorsParsed":[["de Hoop","Maarten V.",""],["Lin","Ching-Lung",""],["Nakamura","Gen",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 03:49:58 GMT"}],"updateDate":"2024-08-15","timestamp":1723607398000,"abstract":"  In the theory of viscoelasticity, an important class of models admits a\nrepresentation in terms of springs and dashpots. Widely used members of this\nclass are the Maxwell model and its extended version. The paper concerns about\nthe exact boundary controllability (abbreviated by EBC) for the reduced system\n(abbreviated by RS) associated to the extended Maxwell model (EMM). The initial\nboundary value problem (abbreviated by IBP) with a mixed type boundary\ncondition (abbreviated by MBC) in the absence of the exterior force is called\nthe augmented system (abbreviated by AD system). Here, the MBC consists of a\nhomogeneous displacement boundary condition and inhomogeneous traction boundary\ncondition with a boundary control. The RS is a closed subsystem inside the AD\nsystem (see Section \\ref{sec1} for the details of the EMM and the RS). For the\nRS, we consider the IBP for the associated AD system. By using a dissipative\nstructure of the RS in relation with the AD system, we will prove the EBC for\nthe RS by a modified version of Russell's principle. Also, as an application of\nthis EBC, we will show a partial boundary controllability (abbreviated by PBC)\nfor the Boltzmann type viscoelastic system of equations (abbreviated by BVS)\nassociated to the EMM. That is, for a large enough time $T>0$ and any pair of\ngiven speeds $(v_0, v_1)$, there is a boundary control which steers to have\n$v(0)=v^0,\\,v(t)=v^1$, where $v(t)=\\partial_t u(t)$ is the speed of the\ndisplacement vector $u(t)$ of BVS at time $t$.\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}