{"id":"2408.06482","title":"Demonstration of a CAFQA-bootstrapped Variational Quantum Eigensolver on\n  a Trapped-Ion Quantum Computer","authors":"Qingfeng Wang, Liudmila Zhukas, Qiang Miao, Aniket S. Dalvi, Peter J.\n  Love, Christopher Monroe, Frederic T. Chong, Gokul Subramanian Ravi","authorsParsed":[["Wang","Qingfeng",""],["Zhukas","Liudmila",""],["Miao","Qiang",""],["Dalvi","Aniket S.",""],["Love","Peter J.",""],["Monroe","Christopher",""],["Chong","Frederic T.",""],["Ravi","Gokul Subramanian",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 20:30:37 GMT"}],"updateDate":"2024-08-14","timestamp":1723494637000,"abstract":"  To enhance the variational quantum eigensolver (VQE), the CAFQA method can\nutilize classical computational capabilities to identify a better initial state\nthan the Hartree-Fock method. Previous research has demonstrated that the\ninitial state provided by CAFQA recovers more correlation energy than that of\nthe Hartree-Fock method and results in faster convergence. In the present\nstudy, we advance the investigation of CAFQA by demonstrating its advantages on\na high-fidelity trapped-ion quantum computer located at the Duke Quantum Center\n-- this is the first experimental demonstration of CAFQA-bootstrapped VQE on a\nTI device and on any academic quantum device. In our VQE experiment, we use LiH\nand BeH$_2$ as test cases to show that CAFQA achieves faster convergence and\nobtains lower energy values within the specified computational budget limits.\nTo ensure the seamless execution of VQE on this academic device, we develop a\nnovel hardware-software interface framework that supports independent software\nenvironments for both the circuit and hardware end. This mechanism facilitates\nthe automation of VQE-type job executions as well as mitigates the impact of\nrandom hardware interruptions. This framework is versatile and can be applied\nto a variety of academic quantum devices beyond the trapped-ion quantum\ncomputer platform, with support for integration with customized packages.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}