{"id":"2408.16300","title":"A Distance Similarity-based Genetic Optimization Algorithm for Satellite\n  Ground Network Planning Considering Feeding Mode","authors":"Yingying Ren, Qiuli Li, Yangyang Guo, Witold Pedrycz, Lining Xing,\n  Anfeng Liu, Yanjie Song","authorsParsed":[["Ren","Yingying",""],["Li","Qiuli",""],["Guo","Yangyang",""],["Pedrycz","Witold",""],["Xing","Lining",""],["Liu","Anfeng",""],["Song","Yanjie",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 06:57:45 GMT"}],"updateDate":"2024-08-30","timestamp":1724914665000,"abstract":"  With the rapid development of the satellite industry, the information\ntransmission network based on communication satellites has gradually become a\nmajor and important part of the future satellite ground integration network.\nHowever, the low transmission efficiency of the satellite data relay back\nmission has become a problem that is currently constraining the construction of\nthe system and needs to be solved urgently. Effectively planning the task of\nsatellite ground networking by reasonably scheduling resources is crucial for\nthe efficient transmission of task data. In this paper, we hope to provide a\ntask execution scheme that maximizes the profit of the networking task for\nsatellite ground network planning considering feeding mode (SGNPFM). To solve\nthe SGNPFM problem, a mixed-integer planning model with the objective of\nmaximizing the gain of the link-building task is constructed, which considers\nvarious constraints of the satellite in the feed-switching mode. Based on the\nproblem characteristics, we propose a distance similarity-based genetic\noptimization algorithm (DSGA), which considers the state characteristics\nbetween the tasks and introduces a weighted Euclidean distance method to\ndetermine the similarity between the tasks. To obtain more high-quality\nsolutions, different similarity evaluation methods are designed to assist the\nalgorithm in intelligently screening individuals. The DSGA also uses an\nadaptive crossover strategy based on similarity mechanism, which guides the\nalgorithm to achieve efficient population search. In addition, a task\nscheduling algorithm considering the feed-switching mode is designed for\ndecoding the algorithm to generate a high-quality scheme. The results of\nsimulation experiments show that the DSGA can effectively solve the SGNPFM\nproblem.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}