{"id":"2408.07302","title":"Effects of a Prompt Engineering Intervention on Undergraduate Students'\n  AI Self-Efficacy, AI Knowledge and Prompt Engineering Ability: A Mixed\n  Methods Study","authors":"David James Woo, Deliang Wang, Tim Yung, and Kai Guo","authorsParsed":[["Woo","David James",""],["Wang","Deliang",""],["Yung","Tim",""],["Guo","Kai",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 15:05:24 GMT"}],"updateDate":"2024-08-15","timestamp":1722351924000,"abstract":"  Prompt engineering is critical for effective interaction with large language\nmodels (LLMs) such as ChatGPT. However, efforts to teach this skill to students\nhave been limited. This study designed and implemented a prompt engineering\nintervention, examining its influence on undergraduate students' AI\nself-efficacy, AI knowledge, and proficiency in creating effective prompts. The\nintervention involved 27 students who participated in a 100-minute workshop\nconducted during their history course at a university in Hong Kong. During the\nworkshop, students were introduced to prompt engineering strategies, which they\napplied to plan the course's final essay task. Multiple data sources were\ncollected, including students' responses to pre- and post-workshop\nquestionnaires, pre- and post-workshop prompt libraries, and written\nreflections. The study's findings revealed that students demonstrated a higher\nlevel of AI self-efficacy, an enhanced understanding of AI concepts, and\nimproved prompt engineering skills because of the intervention. These findings\nhave implications for AI literacy education, as they highlight the importance\nof prompt engineering training for specific higher education use cases. This is\na significant shift from students haphazardly and intuitively learning to\nengineer prompts. Through prompt engineering education, educators can faciitate\nstudents' effective navigation and leverage of LLMs to support their\ncoursework.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Computation and Language","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"qHq7rHcPHfezixQgcT6_WDqNBXHybTamsOeJv94c8Xk","pdfSize":"2144761"}
