{"id":"2408.07659","title":"Enabling two-dimensional electron gas with high room-temperature\n  electron mobility exceeding 100 cm$^2$/Vs at a perovskite oxide interface","authors":"Georg Hoffmann, Martina Zupancic, Aysha A. Riaz, Curran Kalha,\n  Christoph Schlueter, Andrei Gloskovskii, Anna Regoutz, Martin Albrecht,\n  Johanna Nordlander, and Oliver Bierwagen","authorsParsed":[["Hoffmann","Georg",""],["Zupancic","Martina",""],["Riaz","Aysha A.",""],["Kalha","Curran",""],["Schlueter","Christoph",""],["Gloskovskii","Andrei",""],["Regoutz","Anna",""],["Albrecht","Martin",""],["Nordlander","Johanna",""],["Bierwagen","Oliver",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 16:41:40 GMT"}],"updateDate":"2024-08-15","timestamp":1723653700000,"abstract":"  In perovskite oxide heterostructures, bulk functional properties coexist with\nemergent physical phenomena at epitaxial interfaces. Notably, charge transfer\nat the interface between two insulating oxide layers can lead to the formation\nof a two-dimensional electron gas (2DEG) with possible applications in, e.g.,\nhigh-electronmobility transistors and ferroelectric field-effect transistors.\nSo far, the realization of oxide 2DEGs is, however, largely limited to the\ninterface between the single-crystal substrate and epitaxial film, preventing\ntheir deliberate placement inside a larger device architecture. Additionally,\nthe substrate-limited quality of perovskite oxide interfaces hampers\nroom-temperature 2DEG performance due to notoriously low electron mobility. In\nthis work, we demonstrate the controlled creation of an interfacial 2DEG at the\nepitaxial interface between perovskite oxides BaSnO$_3$ and LaInO$_3$ with\nenhanced room-temperature electron mobilities up to 119 cm$^2$/Vs - the highest\nroom-temperature value reported so far for a perovskite oxide 2DEG. Using a\ncombination of state-of-the-art deposition modes during oxide molecular beam\nepitaxy, our approach opens up another degree of freedom in optimization and\n$in$-$situ$ control of the interface between two epitaxial oxide layers away\nfrom the substrate interface. We thus expect our approach to apply to the\ngeneral class of perovskite oxide 2DEG systems and to enable their improved\ncompatibility with novel device concepts and integration across materials\nplatforms.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}