{"id":"2408.01313","title":"Optimal limits of continuously monitored thermometers and their\n  Hamiltonian structure","authors":"Mohammad Mehboudi, Florian Meier, Marcus Huber, Harry J. D. Miller","authorsParsed":[["Mehboudi","Mohammad",""],["Meier","Florian",""],["Huber","Marcus",""],["Miller","Harry J. D.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 15:05:06 GMT"}],"updateDate":"2024-08-05","timestamp":1722611106000,"abstract":"  The temperature of a bosonic/fermionic environment can be measured by\ncoupling a fully characterised $N$-dimensional probe to it. While\nprepare-measure-reset strategies offer optimal thermometry precision, they\noverlook the required time for the preparation and reset, and require excessive\ncontrol of the probe at all times. Continuously monitored probes are more\npractical in this sense, as they take into account finite-time limitations.\nThus, we study the ultimate limits and the optimal structure of continuously\nmonitored $N$-dimensional thermometers. With the local estimation scheme our\nfigure of merit is the Fisher information, which inversely bounds the mean\nsquare error. We provide an optimal strategy for both fermionic and bosonic\nenvironments. Under reasonable assumptions it turns out that the optimal\nthermometer is an effective two-level system, with a degeneracy of the ground\nstate that increases with $N$ -- contrary to the optimal thermometers at\nequilibrium that have a single ground state degeneracy. The optimal gap also\ndiffers from the equilibrium case, as it depends on the bath type\n(fermionic/bosonic) and the specific spectral density. For $N\\gg 1$, the Fisher\ninformation can grow linearly with $N$ regardless of bath type, significantly\nimproving the well-known $\\log^2 N$ scaling for equilibrium thermometry.\nAnother remarkable observation is that the scaling with $N$ does not vanish in\npresence of prior ignorance, i.e., in a Bayesian setup even non-adaptive\nstrategies can lead to an estimation error that scales with $1/N$. In\ncomparison, a no-go theorem prohibits the ultimate equilibrium scaling\n$1/\\log^2 N$ without adaptive strategies.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Hiyt5rBUCqUQkiEznemv_aKBHYYGYyhHYKj8VYhYN80","pdfSize":"1317912"}
