{"id":"2408.01833","title":"Quantum algorithms for the variational optimization of correlated\n  electronic states with stochastic reconfiguration and the linear method","authors":"Mario Motta, Kevin J. Sung, James Shee","authorsParsed":[["Motta","Mario",""],["Sung","Kevin J.",""],["Shee","James",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 17:53:35 GMT"}],"updateDate":"2024-08-06","timestamp":1722707615000,"abstract":"  Solving the electronic Schrodinger equation for strongly correlated ground\nstates is a long-standing challenge. We present quantum algorithms for the\nvariational optimization of wavefunctions correlated by products of unitary\noperators, such as Local Unitary Cluster Jastrow (LUCJ) ansatzes, using\nstochastic reconfiguration and the linear method. While an implementation on\nclassical computing hardware would require exponentially growing compute cost,\nthe cost (number of circuits and shots) of our quantum algorithms is polynomial\nin system size. We find that classical simulations of optimization with the\nlinear method consistently find lower energy solutions than with the L-BFGS-B\noptimizer across the dissociation curves of the notoriously difficult N$_2$ and\nC$_2$ dimers; LUCJ predictions of the ground-state energies deviate from exact\ndiagonalization by 1 kcal/mol or less at all points on the potential energy\ncurve. While we do characterize the effect of shot noise on the LM\noptimization, these noiseless results highlight the critical but often\noverlooked role that optimization techniques must play in attacking the\nelectronic structure problem (on both classical and quantum hardware), for\nwhich even mean-field optimization is formally NP hard. We also discuss the\nchallenge of obtaining smooth curves in these strongly correlated regimes, and\npropose a number of quantum-friendly solutions ranging from symmetry-projected\nansatz forms to a symmetry-constrained optimization algorithm.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AY2AGEmbW7sRjGRGbAJgImYvoj-6g12MS1BVgcAG_Us","pdfSize":"1166344"}
