{"id":"2408.11458","title":"Aerodynamic Performance and Impact Analysis of a MEMS-Based Non-Invasive\n  Monitoring System for Wind Turbine Blades","authors":"Nicolas Sch\\\"arer, Denis Mikhaylov, C\\'edric Sievi, Badoui Hanna,\n  Caroline Braud, Julien Deparday, Sarah Barber, Tommaso Polonelli, Michele\n  Magno","authorsParsed":[["Schärer","Nicolas",""],["Mikhaylov","Denis",""],["Sievi","Cédric",""],["Hanna","Badoui",""],["Braud","Caroline",""],["Deparday","Julien",""],["Barber","Sarah",""],["Polonelli","Tommaso",""],["Magno","Michele",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 09:23:49 GMT"}],"updateDate":"2024-08-22","timestamp":1724232229000,"abstract":"  Wind power generation plays a crucial role in transitioning away from fossil\nfuel-dependent energy sources, contributing significantly to the mitigation of\nclimate change. Monitoring and evaluating the aerodynamics of large wind\nturbine rotors is crucial to enable more wind energy deployment. This is\nnecessary to achieve the European climate goal of a reduction in net greenhouse\ngas emissions by at least 55% by 2030, compared to 1990 levels. This paper\npresents a comparison between two measurement systems for evaluating the\naerodynamic performance of wind turbine rotor blades on a full-scale wind\ntunnel test. One system uses an array of ten commercial compact ultra-low power\nmicro-electromechanical systems (MEMS) pressure sensors placed on the blade\nsurface, while the other employs high-accuracy lab-based pressure scanners\nembedded in the airfoil. The tests are conducted at a Reynolds number of 3.5 x\n10^6, which represents typical operating conditions for wind turbines. MEMS\nsensors are of particular interest, as they can enable real-time monitoring\nwhich would be impossible with the ground truth system. This work provides an\naccurate quantification of the impact of the MEMS system on the blade\naerodynamics and its measurement accuracy. Our results indicate that MEMS\nsensors, with a total sensing power below 1.6 mW, can measure key aerodynamic\nparameters like Angle of Attack (AoA) and flow separation with a precision of\n1{\\deg}. Although there are minor differences in measurements due to sensor\nencapsulation, the MEMS system does not significantly compromise blade\naerodynamics, with a maximum shift in the angle of attack for flow separation\nof only 1{\\deg}. These findings indicate that surface and low-power MEMS sensor\nsystems are a promising approach for efficient and sustainable wind turbine\nmonitoring using self-sustaining Internet of Things devices and wireless sensor\nnetworks.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}