{"id":"2408.14020","title":"Implications of Fermionic Dark Matter Interactions on Anisotropic\n  Neutron Stars","authors":"Premachand Mahapatra, Chiranjeeb Singha, Ayush Hazarika, Prasanta\n  Kumar Das","authorsParsed":[["Mahapatra","Premachand",""],["Singha","Chiranjeeb",""],["Hazarika","Ayush",""],["Das","Prasanta Kumar",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 05:16:29 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 16:02:30 GMT"}],"updateDate":"2024-09-13","timestamp":1724649389000,"abstract":"  The presence of Dark matter (DM) within a neutron star (NS) can substantially\ninfluence the macroscopic properties. It is commonly assumed that the pressure\ninside an NS is isotropic, but in reality, pressure is locally anisotropic.\nThis study explores the properties of anisotropic NS with a subfraction of DM\n(isotropic) trapped inside. Implementing a two-fluid formalism with three\nEquations of State (EOS): AP3 (a realistic nucleon-nucleon interaction model),\nBSk22 (modeling atomic nuclei and neutron-matter), and MPA1 (considering\nrelativistic effects in nuclear interactions). The properties of NS, such as\nmass ($M$), radius ($R$), and dimensionless tidal deformability ($\\Lambda$),\nfor various DM-anisotropic configurations, have been rigorously tested against\nobservational constraints. These constraints include data from the binary NS\nmerger GW170817, NICER x-ray measurements, and pulsar mass-radius observations.\nWe observe that with increasing DM subfraction, higher anisotropies could also\nsatisfy the observational constraints. Furthermore, increasing the coupling\n($g$) between DM and its mediator leads to the formation of a core-halo\nstructure, with a DM halo surrounding the baryonic matter (BM). Specifically,\nfor coupling values of $g = 10^{-4}$, $10^{-3.7}$, and $10^{-3.5}$, we observe\nthat the maximum radius ($R_{max}$) decreases with increasing anisotropy, which\ncontrasts with the behavior at $g = 10^{-5}$ and in scenarios with no DM. Our\nanalysis indicates that binary pulsar systems could potentially constrain the\nextent of admixed anisotropic NS or, more optimistically, provide evidence for\nthe existence of DM-admixed anisotropic NS.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-dkp73tTmy3ndKCMleya_njPp1WUKljKnqbe9r-JoIQ","pdfSize":"3558194"}
