{"id":"2408.03242","title":"Careful finite element simulations of cold rolling with accurate\n  through-thickness resolution and prediction of residual stress","authors":"Francis Flanagan, Alison O'Connor, Mozhdeh Erfanian, Omer Music,\n  Edward James Brambley and Doireann O'Kiely","authorsParsed":[["Flanagan","Francis",""],["O'Connor","Alison",""],["Erfanian","Mozhdeh",""],["Music","Omer",""],["Brambley","Edward James",""],["O'Kiely","Doireann",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 15:03:07 GMT"}],"updateDate":"2024-08-07","timestamp":1722956587000,"abstract":"  In this paper, we carefully develop a finite element (FE) model that gives\naccurate through-thickness predictions of stress and strain distributions\nduring the steady-state cold rolling process. These through-thickness\npredictions unveil an oscillatory pattern that is shown to have important\nconsequences for residual stress in the rolled sheet. We believe this is the\nfirst time that through-thickness FE results have been accurately validated by\ncomparison to non-FE results, in this case by comparison to a recent analytical\nmodel of through-thickness variation in cold rolling. While we use here the\nABAQUS commercially available FE software, our observations are relevant to all\nFE simulations of cold rolling. Care is taken by considering both convergence\nin number of elements through thickness, convergence to a steady state, and the\navoidance of other numerical artefacts such as shear locking and hourglassing.\nWe find that previous FE models of cold rolling are usually woefully\nunder-resolved through-thickness; e.g. using 10 elements through-thickness,\nwhile we require 60 here for convergence. Convergence of roll force and roll\ntorque, used in previous studies to validate models, are shown to be poor\nindicators of through-thickness convergence. We also show that the\nthrough-thickness oscillatory pattern may have important consequences for\npredicting curvature during asymmetric rolling.\n","subjects":["Condensed Matter/Materials Science","Physics/Classical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}