{"id":"2408.08334","title":"Comparing NASA Discovery and New Frontiers Class Mission Concepts for\n  the Io Volcano Observer (IVO)","authors":"Christopher W. Hamilton, Alfred S. McEwen, Laszlo Keszthelyi, Lynn M.\n  Carter, Ashley G. Davies, Katherine de Kleer, Kandis Lea Jessup, Xianzhe Jia,\n  James T. Keane, Kathleen Mandt, Francis Nimmo, Chris Paranicas, Ryan S. Park,\n  Jason E. Perry, Anne Pommier, Jani Radebaugh, Sarah S. Sutton, Audrey\n  Vorburger, Peter Wurz, Cau\\^e Borlina, Amanda F. Haapala, Daniella N.\n  DellaGiustina, Brett W. Denevi, Sarah M. H\\\"orst, Sascha Kempf, Krishan K.\n  Khurana, Justin J. Likar, Adam Masters, Olivier Mousis, Anjani T. Polit,\n  Aditya Bhushan, Michael Bland, Isamu Matsuyama, John Spencer","authorsParsed":[["Hamilton","Christopher W.",""],["McEwen","Alfred S.",""],["Keszthelyi","Laszlo",""],["Carter","Lynn M.",""],["Davies","Ashley G.",""],["de Kleer","Katherine",""],["Jessup","Kandis Lea",""],["Jia","Xianzhe",""],["Keane","James T.",""],["Mandt","Kathleen",""],["Nimmo","Francis",""],["Paranicas","Chris",""],["Park","Ryan S.",""],["Perry","Jason E.",""],["Pommier","Anne",""],["Radebaugh","Jani",""],["Sutton","Sarah S.",""],["Vorburger","Audrey",""],["Wurz","Peter",""],["Borlina","Cauê",""],["Haapala","Amanda F.",""],["DellaGiustina","Daniella N.",""],["Denevi","Brett W.",""],["Hörst","Sarah M.",""],["Kempf","Sascha",""],["Khurana","Krishan K.",""],["Likar","Justin J.",""],["Masters","Adam",""],["Mousis","Olivier",""],["Polit","Anjani T.",""],["Bhushan","Aditya",""],["Bland","Michael",""],["Matsuyama","Isamu",""],["Spencer","John",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 01:00:58 GMT"}],"updateDate":"2024-08-19","timestamp":1723683658000,"abstract":"  Jupiter's moon Io is a highly compelling target for future exploration that\noffers critical insight into tidal dissipation processes and the geology of\nhigh heat flux worlds, including primitive planetary bodies, such as the early\nEarth, that are shaped by enhanced rates of volcanism. Io is also important for\nunderstanding the development of volcanogenic atmospheres and mass-exchange\nwithin the Jupiter System. However, fundamental questions remain about the\nstate of Io's interior, surface, and atmosphere, as well as its role in the\nevolution of the Galilean satellites. The Io Volcano Observer (IVO) would\naddress these questions by achieving the following three key goals: (A)\nDetermine how and where tidal heat is generated inside Io; (B) Understand how\ntidal heat is transported to the surface of Io; and (C) Understand how Io is\nevolving. IVO was selected for Phase A study through the NASA Discovery program\nin 2020 and, in anticipation of a New Frontiers 5 opportunity, an enhanced\nIVO-NF mission concept was advanced that would increase the Baseline mission\nfrom 10 flybys to 20, with an improved radiation design; employ a Ka-band\ncommunications to double IVO's total data downlink; add a wide angle camera for\ncolor and stereo mapping; add a dust mass spectrometer; and lower the altitude\nof later flybys to enable new science. This study compares and contrasts the\nmission architecture, instrument suite, and science objectives for Discovery\n(IVO) and New Frontiers (IVO-NF) missions to Io, and advocates for continued\nprioritization of Io as an exploration target for New Frontiers.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"x5SBGdNPa9-F4hclXDhZH4_8WpOBrtSeNeomig7gcmg","pdfSize":"23386792"}
