{"id":"2408.00935","title":"Multi-controlled single-qubit unitary gates based on the quantum Fourier\n  transform","authors":"Vladimir V. Arsoski","authorsParsed":[["Arsoski","Vladimir V.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 21:56:02 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 23:10:30 GMT"}],"updateDate":"2024-08-27","timestamp":1722549362000,"abstract":"  Multi-controlled (MC) unitary (U) gates are widely employed in quantum\nalgorithms and circuits. Few state-of-the-art decompositions of MCU gates use\nnon-elementary $C-R_x$ and $C-U^{1/2^{m-1}}$ gates resulting in a linear\nfunction for the depths of an implemented circuit on the number of these gates.\nOur approach is based on two generalizations of the multi-controlled X (MCX)\ngate that uses the quantum Fourier transform (QFT) comprised of Hadamard and\ncontrolled-phase gates. For the native gate set used in a genuine quantum\ncomputer, the decomposition of the controlled-phase gate is twice as less\ncomplex as $C-R_x$, which can result in an approximately double advantage of\ncircuits derived from the QFT. The first generalization of QFT-MCX is based on\naltering the controlled gates acting on the target qubit. These gates are the\nmost complex and are also used in the state-of-the-art circuits. The second\ngeneralization relies on the ZYZ decomposition and uses only one extended\nQFT-based circuit to implement the two multi-controlled X gates needed for the\ndecomposition. Since the complexities of this circuit are approximately equal\nto the QFT-based MCX, our MCU implementation is more advanced than any known\nexisting. The supremacy over the best-known optimized algorithm will be\ndemonstrated by comparing transpiled circuits assembled for execution in a\ngenuine quantum device. One may note that our implementations use approximately\nhalf the number of elementary gates compared to the most efficient one,\npotentially resulting in a smaller error. Additionally, we elaborated\noptimization steps to simplify the state-of-the-art linear-depth decomposition\n(LDD) MCU circuit to one of our implementations.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Bqu-hoJ1BGy_-Zp-q6JNVh69W3I2J484CEhgsgB3bjY","pdfSize":"481427","txDigest":"GTgDTHW6CcE8boUU29m4WjtqRz2g1xhrSQpsgDXC19Nj","endEpoch":"1","status":"CERTIFIED"}
