{"id":"2408.05164","title":"Deterministic remote entanglement using a chiral quantum interconnect","authors":"Aziza Almanakly, Beatriz Yankelevich, Max Hays, Bharath Kannan,\n  Reouven Assouly, Alex Greene, Michael Gingras, Bethany M. Niedzielski, Hannah\n  Stickler, Mollie E. Schwartz, Kyle Serniak, Joel I-J. Wang, Terry P. Orlando,\n  Simon Gustavsson, Jeffrey A. Grover, and William D. Oliver","authorsParsed":[["Almanakly","Aziza",""],["Yankelevich","Beatriz",""],["Hays","Max",""],["Kannan","Bharath",""],["Assouly","Reouven",""],["Greene","Alex",""],["Gingras","Michael",""],["Niedzielski","Bethany M.",""],["Stickler","Hannah",""],["Schwartz","Mollie E.",""],["Serniak","Kyle",""],["Wang","Joel I-J.",""],["Orlando","Terry P.",""],["Gustavsson","Simon",""],["Grover","Jeffrey A.",""],["Oliver","William D.",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 16:35:43 GMT"}],"updateDate":"2024-08-12","timestamp":1723221343000,"abstract":"  Quantum interconnects facilitate entanglement distribution between non-local\ncomputational nodes. For superconducting processors, microwave photons are a\nnatural means to mediate this distribution. However, many existing\narchitectures limit node connectivity and directionality. In this work, we\nconstruct a chiral quantum interconnect between two nominally identical modules\nin separate microwave packages. We leverage quantum interference to emit and\nabsorb microwave photons on demand and in a chosen direction between these\nmodules. We optimize the protocol using model-free reinforcement learning to\nmaximize absorption efficiency. By halting the emission process halfway through\nits duration, we generate remote entanglement between modules in the form of a\nfour-qubit W state with 62.4 +/- 1.6% (leftward photon propagation) and 62.1\n+/- 1.2% (rightward) fidelity, limited mainly by propagation loss. This quantum\nnetwork architecture enables all-to-all connectivity between non-local\nprocessors for modular and extensible quantum computation.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}