{"id":"2408.13521","title":"HRGraph: Leveraging LLMs for HR Data Knowledge Graphs with Information\n  Propagation-based Job Recommendation","authors":"Azmine Toushik Wasi","authorsParsed":[["Wasi","Azmine Toushik",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 08:50:25 GMT"}],"updateDate":"2024-08-27","timestamp":1724489425000,"abstract":"  Knowledge Graphs (KGs) serving as semantic networks, prove highly effective\nin managing complex interconnected data in different domains, by offering a\nunified, contextualized, and structured representation with flexibility that\nallows for easy adaptation to evolving knowledge. Processing complex Human\nResources (HR) data, KGs can help in different HR functions like recruitment,\njob matching, identifying learning gaps, and enhancing employee retention.\nDespite their potential, limited efforts have been made to implement practical\nHR knowledge graphs. This study addresses this gap by presenting a framework\nfor effectively developing HR knowledge graphs from documents using Large\nLanguage Models. The resulting KG can be used for a variety of downstream\ntasks, including job matching, identifying employee skill gaps, and many more.\nIn this work, we showcase instances where HR KGs prove instrumental in precise\njob matching, yielding advantages for both employers and employees. Empirical\nevidence from experiments with information propagation in KGs and Graph Neural\nNets, along with case studies underscores the effectiveness of KGs in tasks\nsuch as job and employee recommendations and job area classification. Code and\ndata are available at : https://github.com/azminewasi/HRGraph\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Information Retrieval","Computing Research Repository/Information Theory","Computing Research Repository/Social and Information Networks","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"STpGQPbyrAUKNlOA8gMwQDGZdy8pBRz-vaTrv99ULqo","pdfSize":"506213"}
