{"id":"2408.01703","title":"WaitGPT: Monitoring and Steering Conversational LLM Agent in Data\n  Analysis with On-the-Fly Code Visualization","authors":"Liwenhan Xie, Chengbo Zheng, Haijun Xia, Huamin Qu, Chen Zhu-Tian","authorsParsed":[["Xie","Liwenhan",""],["Zheng","Chengbo",""],["Xia","Haijun",""],["Qu","Huamin",""],["Zhu-Tian","Chen",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 07:51:08 GMT"}],"updateDate":"2024-08-06","timestamp":1722671468000,"abstract":"  Large language models (LLMs) support data analysis through conversational\nuser interfaces, as exemplified in OpenAI's ChatGPT (formally known as Advanced\nData Analysis or Code Interpreter). Essentially, LLMs produce code for\naccomplishing diverse analysis tasks. However, presenting raw code can obscure\nthe logic and hinder user verification. To empower users with enhanced\ncomprehension and augmented control over analysis conducted by LLMs, we propose\na novel approach to transform LLM-generated code into an interactive visual\nrepresentation. In the approach, users are provided with a clear, step-by-step\nvisualization of the LLM-generated code in real time, allowing them to\nunderstand, verify, and modify individual data operations in the analysis. Our\ndesign decisions are informed by a formative study (N=8) probing into user\npractice and challenges. We further developed a prototype named WaitGPT and\nconducted a user study (N=12) to evaluate its usability and effectiveness. The\nfindings from the user study reveal that WaitGPT facilitates monitoring and\nsteering of data analysis performed by LLMs, enabling participants to enhance\nerror detection and increase their overall confidence in the results.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"PzT7x_NJIjC8_PrFFfVtcBRUUKhCLVCNm35XfKb7K5M","pdfSize":"4796737","txDigest":"5usswJEcqEHedz6h33vV75UEND6amJBzEWgbYWKBgiCm","endEpoch":"1","status":"CERTIFIED"}
