{"id":"2408.02306","title":"Mixture-of-Noises Enhanced Forgery-Aware Predictor for Multi-Face\n  Manipulation Detection and Localization","authors":"Changtao Miao, Qi Chu, Tao Gong, Zhentao Tan, Zhenchao Jin, Wanyi\n  Zhuang, Man Luo, Honggang Hu, and Nenghai Yu","authorsParsed":[["Miao","Changtao",""],["Chu","Qi",""],["Gong","Tao",""],["Tan","Zhentao",""],["Jin","Zhenchao",""],["Zhuang","Wanyi",""],["Luo","Man",""],["Hu","Honggang",""],["Yu","Nenghai",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 08:35:59 GMT"}],"updateDate":"2024-08-06","timestamp":1722846959000,"abstract":"  With the advancement of face manipulation technology, forgery images in\nmulti-face scenarios are gradually becoming a more complex and realistic\nchallenge. Despite this, detection and localization methods for such multi-face\nmanipulations remain underdeveloped. Traditional manipulation localization\nmethods either indirectly derive detection results from localization masks,\nresulting in limited detection performance, or employ a naive two-branch\nstructure to simultaneously obtain detection and localization results, which\ncannot effectively benefit the localization capability due to limited\ninteraction between two tasks. This paper proposes a new framework, namely\nMoNFAP, specifically tailored for multi-face manipulation detection and\nlocalization. The MoNFAP primarily introduces two novel modules: the\nForgery-aware Unified Predictor (FUP) Module and the Mixture-of-Noises Module\n(MNM). The FUP integrates detection and localization tasks using a token\nlearning strategy and multiple forgery-aware transformers, which facilitates\nthe use of classification information to enhance localization capability.\nBesides, motivated by the crucial role of noise information in forgery\ndetection, the MNM leverages multiple noise extractors based on the concept of\nthe mixture of experts to enhance the general RGB features, further boosting\nthe performance of our framework. Finally, we establish a comprehensive\nbenchmark for multi-face detection and localization and the proposed\n\\textit{MoNFAP} achieves significant performance. The codes will be made\navailable.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"04hiLppBVa6RPsR6IokjPPjG9hGmUyw7zXnYR44vG74","pdfSize":"3846302","txDigest":"36MAX2Em1xH5mLZB18hSQo1Ljmc9V193xzVXqtBofSnC","endEpoch":"1","status":"CERTIFIED"}
