{"id":"2408.14617","title":"Dynamic Locality Sensitive Orderings in Doubling Metrics","authors":"An La and Hung Le","authorsParsed":[["La","An",""],["Le","Hung",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 20:23:02 GMT"}],"updateDate":"2024-08-28","timestamp":1724703782000,"abstract":"  In their pioneering work, Chan, Har-Peled, and Jones (SICOMP 2020) introduced\nlocality-sensitive ordering (LSO), and constructed an LSO with a constant\nnumber of orderings for point sets in the $d$-dimensional Euclidean space.\nFurthermore, their LSO could be made dynamic effortlessly under point\ninsertions and deletions, taking $O(\\log{n})$ time per update by exploiting\nEuclidean geometry. Their LSO provides a powerful primitive to solve a host of\ngeometric problems in both dynamic and static settings. Filtser and Le (STOC\n2022) constructed the first LSO with a constant number of orderings in the more\ngeneral setting of doubling metrics. However, their algorithm is inherently\nstatic since it relies on several sophisticated constructions in intermediate\nsteps, none of which is known to have a dynamic version. Making their LSO\ndynamic would recover the full generality of LSO and provide a general tool to\ndynamize a vast number of static constructions in doubling metrics.\n  In this work, we give a dynamic algorithm that has $O(\\log{n})$ time per\nupdate to construct an LSO in doubling metrics under point insertions and\ndeletions. We introduce a toolkit of several new data structures: a pairwise\ntree cover, a net tree cover, and a leaf tracker. A key technical is\nstabilizing the dynamic net tree of Cole and Gottlieb (STOC 2006), a central\ndynamic data structure in doubling metrics. Specifically, we show that every\nupdate to the dynamic net tree can be decomposed into a few simple updates to\ntrees in the net tree cover. As stability is the key to any dynamic algorithm,\nour technique could be useful for other problems in doubling metrics.\n  We obtain several algorithmic applications from our dynamic LSO. The most\nnotably is the first dynamic algorithm for maintaining an $k$-fault tolerant\nspanner in doubling metrics with optimal sparsity in optimal $O(\\log{n})$ time\nper update.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Computational Geometry"],"license":"http://creativecommons.org/licenses/by/4.0/"}