{"id":"2408.14664","title":"Interplay of protection and damage through intermolecular processes in\n  the decay of electronic core holes in microsolvated organic molecules","authors":"Dana Blo{\\ss}, Nikolai V. Kryzhevoi, Jonas Maurmann, Philipp Schmidt,\n  Andr\\'e Knie, Johannes H. Viehmann, Sascha Deinert, Gregor Hartmann, Catmarna\n  K\\\"ustner-Wetekam, Florian Trinter, Lorenz S. Cederbaum, Arno Ehresmann,\n  Alexander I. Kuleff, and Andreas Hans","authorsParsed":[["Bloß","Dana",""],["Kryzhevoi","Nikolai V.",""],["Maurmann","Jonas",""],["Schmidt","Philipp",""],["Knie","André",""],["Viehmann","Johannes H.",""],["Deinert","Sascha",""],["Hartmann","Gregor",""],["Küstner-Wetekam","Catmarna",""],["Trinter","Florian",""],["Cederbaum","Lorenz S.",""],["Ehresmann","Arno",""],["Kuleff","Alexander I.",""],["Hans","Andreas",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 22:09:59 GMT"}],"updateDate":"2024-08-28","timestamp":1724710199000,"abstract":"  Soft X-ray irradiation of molecules causes electronic core-level vacancies\nthrough photoelectronemission. In light elements, such as C, N, or O, which are\nabundant in the biosphere, these vacancies predominantly decay by Auger\nemission, leading inevitably to dissociative multiply charged states. It was\nrecently demonstrated that an environment can prevent fragmentation of\ncore-level-ionized small organic molecules through immediate non-local decay of\nthe core hole, dissipating charge and energy to the environment. Here, we\npresent an extended photoelectron-photoion-photoion coincidence (PEPIPICO)\nstudy of the biorelevant pyrimidine molecule embedded in a water cluster. It is\nobserved and supported by theoretical calculations that the supposed protective\neffect of the environment is partially reversed if the vacancy is originally\nlocated at a water molecule. In this scenario, intermolecular energy or charge\ntransfer from the core-ionized water environment to the pyrimidine molecule\nleads to ionization of the latter, however, presumably in non-dissociative\ncationic states. Our results contribute to a more comprehensive understanding\nof the complex interplay of protective and harmful effects of an environment in\nthe photochemistry of microsolvated molecules exposed to X-rays.\n","subjects":["Physics/Chemical Physics","Physics/Atomic and Molecular Clusters"],"license":"http://creativecommons.org/licenses/by/4.0/"}