{"id":"2408.16149","title":"Total Solar Eclipse White Light Images as a Benchmark for PFSS Coronal\n  Magnetic Field Models: An In-Depth Analysis over a Solar Cycle","authors":"Luke Fushimi Benavitz, Benjamin Boe, Shadia Rifai Habbal","authorsParsed":[["Benavitz","Luke Fushimi",""],["Boe","Benjamin",""],["Habbal","Shadia Rifai",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 21:51:58 GMT"}],"updateDate":"2024-08-30","timestamp":1724881918000,"abstract":"  Potential Field Source Surface (PFSS) models are widely used to simulate\ncoronal magnetic fields. PFSS models use the observed photospheric magnetic\nfield as the inner boundary condition and assume a perfectly radial field\nbeyond a ``Source Surface\" ($R_{ss}$). At present, total solar eclipse (TSE)\nwhite light images are the only data that delineate the coronal magnetic field\nfrom the photosphere out to several solar radii ($R_\\odot$). We utilize a\ncomplete solar cycle span of these images between 2008 and 2020 as a benchmark\nto assess the reliability of PFSS models. For a quantitative assessment, we\napply a rolling Hough transform (RHT) to the eclipse data and corresponding\nPFFS models to measure the difference, $\\Delta\\theta$, between the data and\nmodel magnetic field lines throughout the corona. We find that the average\n$\\Delta\\theta$, $\\langle\\Delta\\theta\\rangle$, can be minimized for a given\nchoice of $R_{ss}$ depending on the phase within a solar cycle. In particular,\n$R_{ss}\\approx1.3 \\ R_\\odot$ is found to be optimal for solar maximum, while\n$R_{ss}\\approx3 \\ R_\\odot$ yields a better match at solar minimum. However,\nlarge ($\\langle\\Delta\\theta\\rangle>10^\\circ$) discrepancies between TSE data\nand PFSS-generated coronal field lines remain regardless of the choice of\nsource surface. Yet, implementation of solar cycle dependent $R_{ss}$ optimal\nvalues do yield more reliable PFSS-generated coronal field lines for use in\nmodels and for tracing in-situ measurements back to their sources at the Sun.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}