{"id":"2408.09527","title":"ALS-HAR: Harnessing Wearable Ambient Light Sensors to Enhance IMU-based\n  Human Activity Recogntion","authors":"Lala Shakti Swarup Ray, Daniel Gei{\\ss}ler, Mengxi Liu, Bo Zhou,\n  Sungho Suh, Paul Lukowicz","authorsParsed":[["Ray","Lala Shakti Swarup",""],["Geißler","Daniel",""],["Liu","Mengxi",""],["Zhou","Bo",""],["Suh","Sungho",""],["Lukowicz","Paul",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 16:24:22 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 09:03:13 GMT"}],"updateDate":"2024-08-23","timestamp":1723998262000,"abstract":"  Despite the widespread integration of ambient light sensors (ALS) in smart\ndevices commonly used for screen brightness adaptation, their application in\nhuman activity recognition (HAR), primarily through body-worn ALS, is largely\nunexplored. In this work, we developed ALS-HAR, a robust wearable light-based\nmotion activity classifier. Although ALS-HAR achieves comparable accuracy to\nother modalities, its natural sensitivity to external disturbances, such as\nchanges in ambient light, weather conditions, or indoor lighting, makes it\nchallenging for daily use. To address such drawbacks, we introduce strategies\nto enhance environment-invariant IMU-based activity classifications through\naugmented multi-modal and contrastive classifications by transferring the\nknowledge extracted from the ALS. Our experiments on a real-world activity\ndataset for three different scenarios demonstrate that while ALS-HAR's accuracy\nstrongly relies on external lighting conditions, cross-modal information can\nstill improve other HAR systems, such as IMU-based classifiers.Even in\nscenarios where ALS performs insufficiently, the additional knowledge enables\nimproved accuracy and macro F1 score by up to 4.2 % and 6.4 %, respectively,\nfor IMU-based classifiers and even surpasses multi-modal sensor fusion models\nin two of our three experiment scenarios. Our research highlights the untapped\npotential of ALS integration in advancing sensor-based HAR technology, paving\nthe way for practical and efficient wearable ALS-based activity recognition\nsystems with potential applications in healthcare, sports monitoring, and smart\nindoor environments.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"NMdZXrZpIUBkY7ixIJwsj6L6PbKaMExUMdZAG4uHGgk","pdfSize":"5260649"}
