{"id":"2408.05839","title":"Deep Learning in Medical Image Registration: Magic or Mirage?","authors":"Rohit Jena, Deeksha Sethi, Pratik Chaudhari, James C. Gee","authorsParsed":[["Jena","Rohit",""],["Sethi","Deeksha",""],["Chaudhari","Pratik",""],["Gee","James C.",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 18:20:08 GMT"}],"updateDate":"2024-08-13","timestamp":1723400408000,"abstract":"  Classical optimization and learning-based methods are the two reigning\nparadigms in deformable image registration. While optimization-based methods\nboast generalizability across modalities and robust performance, learning-based\nmethods promise peak performance, incorporating weak supervision and amortized\noptimization. However, the exact conditions for either paradigm to perform well\nover the other are shrouded and not explicitly outlined in the existing\nliterature. In this paper, we make an explicit correspondence between the\nmutual information of the distribution of per-pixel intensity and labels, and\nthe performance of classical registration methods. This strong correlation\nhints to the fact that architectural designs in learning-based methods is\nunlikely to affect this correlation, and therefore, the performance of\nlearning-based methods. This hypothesis is thoroughly validated with\nstate-of-the-art classical and learning-based methods. However, learning-based\nmethods with weak supervision can perform high-fidelity intensity and label\nregistration, which is not possible with classical methods. Next, we show that\nthis high-fidelity feature learning does not translate to invariance to domain\nshift, and learning-based methods are sensitive to such changes in the data\ndistribution. Finally, we propose a general recipe to choose the best paradigm\nfor a given registration problem, based on these observations.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Jdvt6L7fzkwPDdGsSXy33FpHRI39z6AZAAeCjW6ktY4","pdfSize":"593810"}
