{"id":"2408.13307","title":"Two Novel Hot Jupiter Formation Pathways: How White Dwarf Kicks Shape\n  the Hot Jupiter Population","authors":"Alexander P. Stephan, David V. Martin, Smadar Naoz, Nathan R. Hughes,\n  Cheyanne Shariat","authorsParsed":[["Stephan","Alexander P.",""],["Martin","David V.",""],["Naoz","Smadar",""],["Hughes","Nathan R.",""],["Shariat","Cheyanne",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-27","timestamp":1724436001000,"abstract":"  The origin of Hot Jupiters (HJs) is disputed between a variety of in situ and\nex situ formation scenarios. One of the early proposed ex situ scenarios was\nthe Eccentric Kozai-Lidov (EKL) mechanism combined with tidal circularization,\nwhich can produce HJs with the aid of a stellar or planetary companion.\nHowever, observations have revealed a lack of stellar companions to HJs, which\nchallenges the importance of the binary star-driven EKL plus tides scenario. In\nthis work, we explore so far unaccounted-for stellar evolution effects on HJ\nformation, in particular the effect of white dwarf (WD) formation. Gaia\nobservations have revealed that WDs often undergo a kick during formation,\nwhich can alter a binary's orbital configuration or even unbind it. Based on\nthis WD kick, in this letter we propose and explore two novel HJ formation\npathways: 1) HJs that are presently orbiting single stars, but were initially\nformed in a binary that was later unbound by a WD kick; 2) Binaries that\nsurvive the WD kick can trigger enhanced EKL oscillations and lead to 2nd\ngeneration HJ formation. We demonstrate that the majority of seemingly single\nHJs could have formed in binary star systems. As such, HJ formation in binaries\nvia the EKL mechanism could be one of the dominant HJ formation pathways, and\nour results highlight that unaccounted-for stellar evolution effects, like WD\nformation, can obscure the actual origin of observed exoplanet populations.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}