{"id":"2408.12704","title":"A General Framework for Gradient-Based Optimization of Superconducting\n  Quantum Circuits using Qubit Discovery as a Case Study","authors":"Taha Rajabzadeh, Alex Boulton-McKeehan, Sam Bonkowsky, David I.\n  Schuster, Amir H. Safavi-Naeini","authorsParsed":[["Rajabzadeh","Taha",""],["Boulton-McKeehan","Alex",""],["Bonkowsky","Sam",""],["Schuster","David I.",""],["Safavi-Naeini","Amir H.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 19:46:50 GMT"}],"updateDate":"2024-08-26","timestamp":1724356010000,"abstract":"  Engineering the Hamiltonian of a quantum system is fundamental to the design\nof quantum systems. Automating Hamiltonian design through gradient-based\noptimization can dramatically accelerate this process. However, computing the\ngradients of eigenvalues and eigenvectors of a Hamiltonian--a large, sparse\nmatrix--relative to system properties poses a significant challenge, especially\nfor arbitrary systems. Superconducting quantum circuits offer substantial\nflexibility in Hamiltonian design, making them an ideal platform for this task.\nIn this work, we present a comprehensive framework for the gradient-based\noptimization of superconducting quantum circuits, leveraging the SQcircuit\nsoftware package. By addressing the challenge of calculating the gradient of\nthe eigensystem for large, sparse Hamiltonians and integrating automatic\ndifferentiation within SQcircuit, our framework enables efficient and precise\ncomputation of gradients for various circuit properties or custom-defined\nmetrics, streamlining the optimization process. We apply this framework to the\nqubit discovery problem, demonstrating its effectiveness in identifying qubit\ndesigns with superior performance metrics. The optimized circuits show\nimprovements in a heuristic measure of gate count, upper bounds on gate speed,\ndecoherence time, and resilience to noise and fabrication errors compared to\nexisting qubits. While this methodology is showcased through qubit optimization\nand discovery, it is versatile and can be extended to tackle other optimization\nchallenges in superconducting quantum hardware design.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}