{"id":"2408.00533","title":"Predicting nonlinear-flow regions in highly heterogeneous porous media\n  using adaptive constitutive laws and neural networks","authors":"Chiara Giovannini, Alessio Fumagalli, Francesco Patacchini","authorsParsed":[["Giovannini","Chiara",""],["Fumagalli","Alessio",""],["Patacchini","Francesco",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 13:08:54 GMT"}],"updateDate":"2024-08-02","timestamp":1722517734000,"abstract":"  In a porous medium featuring heterogeneous permeabilities, a wide range of\nfluid velocities may be recorded, so that significant inertial and frictional\neffects may arise in high-speed regions. In such parts, the link between\npressure gradient and velocity is typically made via Darcy's law, which may\nfail to account for these effects; instead, the Darcy Forchheimer law, which\nintroduces a nonlinear term, may be more adequate. Applying the Darcy\nForchheimer law globally in the domain is very costly numerically and, rather,\nshould only be done where strictly necessary. The question of finding a prori\nthe subdomain where to restrict the use of the Darcy Forchheimer law was\nrecently answered in FP23 by using an adaptive model: given a threshold on the\nflow velocity, the model locally selects the more appropriate law as it is\nbeing solved. At the end of the resolution, each mesh cell is flagged as being\nin the Darcy or Darcy Forchheimer subdomain. Still, this model is nonlinear\nitself and thus relatively expensive to run. In this paper, to accelerate the\nsubdivision of the domain into low and high speed regions, we instead exploit\nthe adaptive model from FP23 to generate partitioning data given an array of\ndifferent input parameters, such as boundary conditions and inertial\ncoefficients, and then train neural networks on these data classifying each\nmesh cell as Darcy or not. Two test cases are studied to illustrate the\nresults, where cost functions, parity plots, precision-recall plots and\nreceiver operating characteristic curves are analyzed.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}