{"id":"2408.13236","title":"Large-scale Collective Dynamics in the Three Iterations of the Reddit\n  r/place Experiment","authors":"Yutong Wu, Arlei Silva","authorsParsed":[["Wu","Yutong",""],["Silva","Arlei",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 17:19:55 GMT"}],"updateDate":"2024-08-26","timestamp":1724433595000,"abstract":"  The Reddit r/place experiments were a series of online social experiments\nhosted by Reddit in 2017, 2022, and 2023, where users were allowed to update\nthe colors of pixels in a large shared canvas. The largest of these experiments\n(in 2022) has attracted over 100 million users who collaborated and competed to\nproduce elaborate artworks that together provide a unique view of the shared\ninterests connecting the diverse communities on Reddit. The user activity\ntraces resulting from these experiments enable us to analyze how online users\nengage, collaborate, and compete online at an unprecedented scale. However,\nthis requires labeling millions of updates made during the experiments\naccording to their intended artwork.\n  This paper characterizes large-scale activity traces from r/place with a\nfocus on dynamics around successful and failed artworks. To achieve this goal,\nwe propose a dynamic graph clustering algorithm to label artworks by leveraging\nvisual and user-level features. %In the first phase of the algorithm, updates\nwithin a snapshot of the experiment are grouped based on proximity, color, and\nuser embeddings. In the second phase, clusters across snapshots are merged via\nan efficient approximation for the set cover problem. We apply the proposed\nalgorithm to the 2017 edition of r/place and show that it outperforms an\nexisting baseline in terms of accuracy and running time. Moreover, we use our\nalgorithm to identify key factors that distinguish successful from failed\nartworks in terms of user engagement, collaboration, and competition.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8Dk4PB4j0Nbuo6F71u_RvOFQVvwgWMFdhnkLvwu5PnQ","pdfSize":"42550777"}
