{"id":"2408.09748","title":"Revisiting Reciprocal Recommender Systems: Metrics, Formulation, and\n  Method","authors":"Chen Yang, Sunhao Dai, Yupeng Hou, Wayne Xin Zhao, Jun Xu, Yang Song,\n  Hengshu Zhu","authorsParsed":[["Yang","Chen",""],["Dai","Sunhao",""],["Hou","Yupeng",""],["Zhao","Wayne Xin",""],["Xu","Jun",""],["Song","Yang",""],["Zhu","Hengshu",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 07:21:02 GMT"}],"updateDate":"2024-08-20","timestamp":1724052062000,"abstract":"  Reciprocal recommender systems~(RRS), conducting bilateral recommendations\nbetween two involved parties, have gained increasing attention for enhancing\nmatching efficiency. However, the majority of existing methods in the\nliterature still reuse conventional ranking metrics to separately assess the\nperformance on each side of the recommendation process. These methods overlook\nthe fact that the ranking outcomes of both sides collectively influence the\neffectiveness of the RRS, neglecting the necessity of a more holistic\nevaluation and a capable systemic solution.\n  In this paper, we systemically revisit the task of reciprocal recommendation,\nby introducing the new metrics, formulation, and method. Firstly, we propose\nfive new evaluation metrics that comprehensively and accurately assess the\nperformance of RRS from three distinct perspectives: overall coverage,\nbilateral stability, and balanced ranking. These metrics provide a more\nholistic understanding of the system's effectiveness and enable a comprehensive\nevaluation. Furthermore, we formulate the RRS from a causal perspective,\nformulating recommendations as bilateral interventions, which can better model\nthe decoupled effects of potential influencing factors. By utilizing the\npotential outcome framework, we further develop a model-agnostic causal\nreciprocal recommendation method that considers the causal effects of\nrecommendations. Additionally, we introduce a reranking strategy to maximize\nmatching outcomes, as measured by the proposed metrics. Extensive experiments\non two real-world datasets from recruitment and dating scenarios demonstrate\nthe effectiveness of our proposed metrics and approach. The code and dataset\nare available at: https://github.com/RUCAIBox/CRRS.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}