{"id":"2408.05543","title":"PixelFade: Privacy-preserving Person Re-identification with Noise-guided\n  Progressive Replacement","authors":"Delong Zhang, Yi-Xing Peng, Xiao-Ming Wu, Ancong Wu, and Wei-Shi Zheng","authorsParsed":[["Zhang","Delong",""],["Peng","Yi-Xing",""],["Wu","Xiao-Ming",""],["Wu","Ancong",""],["Zheng","Wei-Shi",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 12:52:54 GMT"}],"updateDate":"2024-08-13","timestamp":1723294374000,"abstract":"  Online person re-identification services face privacy breaches from potential\ndata leakage and recovery attacks, exposing cloud-stored images to malicious\nattackers and triggering public concern. The privacy protection of pedestrian\nimages is crucial. Previous privacy-preserving person re-identification methods\nare unable to resist recovery attacks and compromise accuracy. In this paper,\nwe propose an iterative method (PixelFade) to optimize pedestrian images into\nnoise-like images to resist recovery attacks. We first give an in-depth study\nof protected images from previous privacy methods, which reveal that the chaos\nof protected images can disrupt the learning of recovery models. Accordingly,\nSpecifically, we propose Noise-guided Objective Function with the feature\nconstraints of a specific authorization model, optimizing pedestrian images to\nnormal-distributed noise images while preserving their original identity\ninformation as per the authorization model. To solve the above non-convex\noptimization problem, we propose a heuristic optimization algorithm that\nalternately performs the Constraint Operation and the Partial Replacement\nOperation. This strategy not only safeguards that original pixels are replaced\nwith noises to protect privacy, but also guides the images towards an improved\noptimization direction to effectively preserve discriminative features.\nExtensive experiments demonstrate that our PixelFade outperforms previous\nmethods in resisting recovery attacks and Re-ID performance. The code is\navailable at https://github.com/iSEE-Laboratory/PixelFade.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}