{"id":"2408.04992","title":"Receding contact line dynamics on superhydrophobic surfaces","authors":"Lorenzo Betti, Jordy Queiros Campos, Amandine Lechantre, Lea\n  Cailly-Brandstater, Sarra Nouma, J\\'er\\^ome Fresnais, Etienne Barthel, Yann\n  Bouret, Xavier Noblin and C\\'eline Cohen","authorsParsed":[["Betti","Lorenzo",""],["Campos","Jordy Queiros",""],["Lechantre","Amandine",""],["Cailly-Brandstater","Lea",""],["Nouma","Sarra",""],["Fresnais","Jérôme",""],["Barthel","Etienne",""],["Bouret","Yann",""],["Noblin","Xavier",""],["Cohen","Céline",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 10:50:29 GMT"}],"updateDate":"2024-09-13","timestamp":1723200629000,"abstract":"  We have explored receding contact line dynamics on superhydrophobic surfaces,\ncomposed of micropillars arrays. We present here dynamic receding contact angle\nmeasurements of water on such surfaces, covering contact line speeds spanning\nover five decades. We have studied the effect of pillars fraction on dynamical\nreceding contact angles. We compared these measurements to those on smooth\nsurfaces with the same chemical nature and also with similar systems reported\nin the literature.\n  We show that superhydrophobic surfaces exhibit a significantly lower\ndependence of contact angle on contact line speed compared to smooth surfaces.\nAdditionally, we observed that a higher surface fraction of pillars leads to a\ngreater dependence of the contact angle on contact line speed, approaching the\ndependence of the angle on smooth surface. Interestingly, we show that the\nexact texuration of the surface does not play a fundamental role in the\nangle-velocity relationships as long as microtextures present the same type of\nperiodic pattern (pillar arrays or microgrid). These results are interpreted in\nterms of viscous friction reduction on superhydrophobic surfaces, shedding\nlight on the underlying mechanisms governing their unique dynamic behavior. In\naddition we show that contact angles follow same laws for two different\ngeometries (milimetric sessile drop and a centimetric capillary bridge).\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}