{"id":"2408.12743","title":"A Formal, Symbolic Analysis of the Matrix Cryptographic Protocol Suite","authors":"Jacob Ginesin, Cristina Nita-Rotaru","authorsParsed":[["Ginesin","Jacob",""],["Nita-Rotaru","Cristina",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 21:52:08 GMT"}],"updateDate":"2024-08-26","timestamp":1724363528000,"abstract":"  Secure instant group messaging applications such as WhatsApp, Facebook\nMessenger, Matrix, and the Signal Application have become ubiquitous in today's\ninternet, cumulatively serving billions of users. Unlike WhatsApp, for example,\nMatrix can be deployed in a federated manner, allowing users to choose which\nserver manages their chats. To account for this difference in architecture,\nMatrix employs two novel cryptographic protocols: Olm, which secures pairwise\ncommunications, and Megolm, which relies on Olm and secures group\ncommunications. Olm and Megolm are similar to and share security goals with\nSignal and Sender Keys, which are widely deployed in practice to secure group\ncommunications. While Olm, Megolm, and Sender Keys have been manually analyzed\nin the computational model, no symbolic analysis nor mechanized proofs of\ncorrectness exist. Using mechanized proofs and computer-aided analysis is\nimportant for cryptographic protocols, as hand-written proofs and analysis are\nerror-prone and often carry subtle mistakes.\n  Using Verifpal, we construct formal models of Olm and Megolm, as well as\ntheir composition. We prove various properties of interest about Olm and\nMegolm, including authentication, confidentiality, forward secrecy, and\npost-compromise security. We also mechanize known limitations, previously\ndiscovered attacks, and trivial attacker wins from the specifications and\nprevious literature. Finally, we model Sender Keys and the composition of\nSignal with Sender Keys in order to draw a comparison with Olm, Megolm, and\ntheir composition. From our analysis we conclude the composition of Olm and\nMegolm has comparable security to the composition of Signal and Sender Keys if\nOlm pre-keys are signed, and provably worse post-compromise security if Olm\npre-keys are not signed.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}