{"id":"2408.11253","title":"Automatic Image Annotation (AIA) of AlmondNet-20 Method for Almond\n  Detection by Improved CNN-based Model","authors":"Mohsen Asghari Ilani, Saba Moftakhar Tehran, Ashkan Kavei, Arian\n  Radmehr","authorsParsed":[["Ilani","Mohsen Asghari",""],["Tehran","Saba Moftakhar",""],["Kavei","Ashkan",""],["Radmehr","Arian",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 00:20:08 GMT"}],"updateDate":"2024-08-22","timestamp":1724199608000,"abstract":"  In response to the burgeoning global demand for premium agricultural\nproducts, particularly within the competitive nut market, this paper introduces\nan innovative methodology aimed at enhancing the grading process for almonds\nand their shells. Leveraging state-of-the-art Deep Convolutional Neural\nNetworks (CNNs), specifically the AlmondNet-20 architecture, our study achieves\nexceptional accuracy exceeding 99%, facilitated by the utilization of a\n20-layer CNN model. To bolster robustness in differentiating between almonds\nand shells, data augmentation techniques are employed, ensuring the reliability\nand accuracy of our classification system. Our model, meticulously trained over\n1000 epochs, demonstrates remarkable performance, boasting an accuracy rate of\n99% alongside a minimal loss function of 0.0567. Rigorous evaluation through\ntest datasets further validates the efficacy of our approach, revealing\nimpeccable precision, recall, and F1-score metrics for almond detection. Beyond\nits technical prowess, this advanced classification system offers tangible\nbenefits to both industry experts and non-specialists alike, ensuring globally\nreliable almond classification. The application of deep learning algorithms, as\nshowcased in our study, not only enhances grading accuracy but also presents\nopportunities for product patents, thereby contributing to the economic value\nof our nation. Through the adoption of cutting-edge technologies such as the\nAlmondNet-20 model, we pave the way for future advancements in agricultural\nproduct classification, ultimately enriching global trade and economic\nprosperity.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}