{"id":"2408.08958","title":"Microphysical Prescriptions for Parameterized Water Cloud Formation on\n  Ultra-cool Substellar Objects","authors":"James Mang, Caroline V. Morley, Tyler D. Robinson, and Peter Gao","authorsParsed":[["Mang","James",""],["Morley","Caroline V.",""],["Robinson","Tyler D.",""],["Gao","Peter",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 18:04:25 GMT"}],"updateDate":"2024-08-20","timestamp":1723831465000,"abstract":"  Water must condense into ice clouds in the coldest brown dwarfs and\nexoplanets. When they form, these icy clouds change the emergent spectra,\ntemperature structure, and albedo of the substellar atmosphere. The properties\nof clouds are governed by complex microphysics but these complexities are often\nnot captured by the simpler parameterized cloud models used in climate models\nor retrieval models. Here, we combine microphysical cloud modeling and 1D\nclimate modeling to incorporate insights from microphysical models into a\nself-consistent, parameterized cloud model. Using the 1D Community Aerosol and\nRadiation Model for Atmospheres (CARMA), we generate microphysical water clouds\nand compare their properties with those from the widely-used EddySed cloud\nmodel (Ackerman & Marley 2001) for a grid of Y dwarfs. We find that the mass of\nwater condensate in our CARMA water clouds is significantly limited by\navailable condensation nuclei; in models without additional seed particles for\nclouds added, the atmosphere becomes supersaturated. We incorporate water\nlatent heat release in the convective and radiative parts of the atmosphere and\nfind no significant impact on water-ice cloud formation for typical gas giant\ncompositions. Our analysis reveals the CARMA cloud profiles have a gradual\ndecrease in opacity of approximately 4% per bar below the cloud base.\nIncorporating this gradual cloud base falloff and a variable $f_{sed}$\nparameter allows spectra generated from the parameterized Eddysed model to\nbetter match those of the microphysical CARMA model. This work provides\nrecommendations for efficiently generating microphysically-informed water\nclouds for future models of cold substellar objects with H/He atmospheres.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"L6OUNF0m-mX3sOft-FDKOSyjRVw07CUEcAX2hd6p9vs","pdfSize":"11572322"}
