{"id":"2408.01297","title":"Optimal Mixed Integer Linear Optimization Trained Multivariate\n  Classification Trees","authors":"Brandon Alston, Illya V. Hicks","authorsParsed":[["Alston","Brandon",""],["Hicks","Illya V.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 14:37:28 GMT"}],"updateDate":"2024-08-05","timestamp":1722609448000,"abstract":"  Multivariate decision trees are powerful machine learning tools for\nclassification and regression that attract many researchers and industry\nprofessionals. An optimal binary tree has two types of vertices, (i) branching\nvertices which have exactly two children and where datapoints are assessed on a\nset of discrete features and (ii) leaf vertices at which datapoints are given a\nprediction, and can be obtained by solving a biobjective optimization problem\nthat seeks to (i) maximize the number of correctly classified datapoints and\n(ii) minimize the number of branching vertices. Branching vertices are linear\ncombinations of training features and therefore can be thought of as\nhyperplanes. In this paper, we propose two cut-based mixed integer linear\noptimization (MILO) formulations for designing optimal binary classification\ntrees (leaf vertices assign discrete classes). Our models leverage on-the-fly\nidentification of minimal infeasible subsystems (MISs) from which we derive\ncutting planes that hold the form of packing constraints. We show theoretical\nimprovements on the strongest flow-based MILO formulation currently in the\nliterature and conduct experiments on publicly available datasets to show our\nmodels' ability to scale, strength against traditional branch and bound\napproaches, and robustness in out-of-sample test performance. Our code and data\nare available on GitHub.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Discrete Mathematics","Mathematics/Combinatorics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6Ck6eszTsVGV4UpQhA9vVCNYHvFl_poJFI1XrLr04IM","pdfSize":"1254389"}
