{"id":"2408.02313","title":"A Lean Transformer Model for Dynamic Malware Analysis and Detection","authors":"Tony Quertier, Benjamin Marais, Gr\\'egoire Barru\\'e, St\\'ephane\n  Morucci, S\\'evan Az\\'e, S\\'ebastien Salladin","authorsParsed":[["Quertier","Tony",""],["Marais","Benjamin",""],["Barrué","Grégoire",""],["Morucci","Stéphane",""],["Azé","Sévan",""],["Salladin","Sébastien",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 08:46:46 GMT"}],"updateDate":"2024-08-06","timestamp":1722847606000,"abstract":"  Malware is a fast-growing threat to the modern computing world and existing\nlines of defense are not efficient enough to address this issue. This is mainly\ndue to the fact that many prevention solutions rely on signature-based\ndetection methods that can easily be circumvented by hackers. Therefore, there\nis a recurrent need for behavior-based analysis where a suspicious file is ran\nin a secured environment and its traces are collected to reports for analysis.\nPrevious works have shown some success leveraging Neural Networks and API calls\nsequences extracted from these execution reports.\n  Recently, Large Language Models and Generative AI have demonstrated\nimpressive capabilities mainly in Natural Language Processing tasks and\npromising applications in the cybersecurity field for both attackers and\ndefenders.\n  In this paper, we design an Encoder-Only model, based on the Transformers\narchitecture, to detect malicious files, digesting their API call sequences\ncollected by an execution emulation solution. We are also limiting the size of\nthe model architecture and the number of its parameters since it is often\nconsidered that Large Language Models may be overkill for specific tasks such\nas the one we are dealing with hereafter. In addition to achieving decent\ndetection results, this approach has the advantage of reducing our carbon\nfootprint by limiting training and inference times and facilitating technical\noperations with less hardware requirements.\n  We also carry out some analysis of our results and highlight the limits and\npossible improvements when using Transformers to analyze malicious files.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}