{"id":"2408.06626","title":"The First Large Absorption Survey in HI (FLASH): II. Pilot Survey data\n  release and first results","authors":"Hyein Yoon, Elaine M. Sadler, Elizabeth K. Mahony, J.N.H.S. Aditya,\n  James R. Allison, Marcin Glowacki, Emily F. Kerrison, Vanessa A. Moss, Renzhi\n  Su, Simon Weng, Matthew Whiting, O. Ivy Wong, Joseph R. Callingham, Stephen\n  J. Curran, Jeremy Darling, Alastair C. Edge, Sara L. Ellison, Kimberly L.\n  Emig, Lilian Garratt-Smithson, Gordon German, Kathryn Grasha, Baerbel S.\n  Koribalski, Raffaella Morganti, Tom Oosterloo, C\\'eline P\\'eroux, Max\n  Pettini, Kevin A. Pimbblet, Zheng Zheng, Martin Zwaan, Lewis Ball, Douglas\n  C.-J. Bock, David Brodrick, John D. Bunton, F.R. Cooray, Philip G. Edwards,\n  Douglas B. Hayman, Aidan W. Hotan, K. Lee-Waddell, N. M. McClure-Griffiths,\n  A. Ng, Chris J. Phillips, Wasim Raja, Maxim A. Voronkov, and Tobias Westmeier","authorsParsed":[["Yoon","Hyein",""],["Sadler","Elaine M.",""],["Mahony","Elizabeth K.",""],["Aditya","J. N. H. S.",""],["Allison","James R.",""],["Glowacki","Marcin",""],["Kerrison","Emily F.",""],["Moss","Vanessa A.",""],["Su","Renzhi",""],["Weng","Simon",""],["Whiting","Matthew",""],["Wong","O. Ivy",""],["Callingham","Joseph R.",""],["Curran","Stephen J.",""],["Darling","Jeremy",""],["Edge","Alastair C.",""],["Ellison","Sara L.",""],["Emig","Kimberly L.",""],["Garratt-Smithson","Lilian",""],["German","Gordon",""],["Grasha","Kathryn",""],["Koribalski","Baerbel S.",""],["Morganti","Raffaella",""],["Oosterloo","Tom",""],["Péroux","Céline",""],["Pettini","Max",""],["Pimbblet","Kevin A.",""],["Zheng","Zheng",""],["Zwaan","Martin",""],["Ball","Lewis",""],["Bock","Douglas C. -J.",""],["Brodrick","David",""],["Bunton","John D.",""],["Cooray","F. R.",""],["Edwards","Philip G.",""],["Hayman","Douglas B.",""],["Hotan","Aidan W.",""],["Lee-Waddell","K.",""],["McClure-Griffiths","N. M.",""],["Ng","A.",""],["Phillips","Chris J.",""],["Raja","Wasim",""],["Voronkov","Maxim A.",""],["Westmeier","Tobias",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 04:29:15 GMT"}],"updateDate":"2024-08-14","timestamp":1723523355000,"abstract":"  The First Large Absorption Survey in HI (FLASH) is a large-area radio survey\nfor neutral hydrogen in the redshift range 0.4<z<1.0, using the 21cm HI\nabsorption line as a probe of cold neutral gas. FLASH uses the ASKAP radio\ntelescope and is the first large 21cm absorption survey to be carried out\nwithout any optical preselection of targets. We use an automated Bayesian\nline-finding tool to search through large datasets and assign a statistical\nsignificance to potential line detections. The survey aims to explore the\nneutral gas content of galaxies at a cosmic epoch where almost no HI data are\ncurrently available, and to investigate the role of neutral gas in AGN fuelling\nand feedback. Two Pilot Surveys, covering around 3000 deg$^2$ of sky, were\ncarried out in 2019-22 to test and verify the strategy for the full FLASH\nsurvey. The processed data from these Pilot Surveys (spectral-line cubes,\ncontinuum images, and catalogues) are available online. Here, we describe the\nFLASH spectral-line and continuum data and discuss the quality of the HI\nspectra and the completeness of our automated line search. Finally, we present\na set of 30 new HI absorption lines that were robustly detected in the Pilot\nSurveys. These lines span a wide range in HI optical depth, including three\nlines with a peak optical depth $\\tau>1$, and appear to be a mixture of\nintervening and associated systems. The overall detection rate for HI\nabsorption lines in the Pilot Surveys (0.3 to 0.5 lines per ASKAP field) is a\nfactor of two below the expected value. There are several possible reasons for\nthis, but one likely factor is the presence of a range of spectral-line\nartefacts in the Pilot Survey data that have now been mitigated and are not\nexpected to recur in the full FLASH survey. A future paper will discuss the\nhost galaxies of the HI absorption systems identified here.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}