{"id":"2408.14900","title":"Stellar model tests and age determination for RGB stars from the APO-K2\n  catalogue","authors":"G. Valle, M. Dell'Omodarme, P.G. Prada Moroni, S. Degl'Innocenti","authorsParsed":[["Valle","G.",""],["Dell'Omodarme","M.",""],["Moroni","P. G. Prada",""],["Degl'Innocenti","S.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 09:25:38 GMT"}],"updateDate":"2024-08-28","timestamp":1724750738000,"abstract":"  By adopting the recently empirically derived dependence of $\\alpha$-elements\non $[\\alpha/{\\rm Fe}]$ instead of the conventionally applied uniform one, we\ntested the agreement between stellar model predictions and observations for red\ngiant branch (RGB) stars in the APO-K2 catalogue. We particularly focused on\nthe biases in effective temperature scales and on the robustness of age\nestimations. We computed a grid of stellar models relying on the empirical\nscaling of $\\alpha$-elements, investigating the offset in effective temperature\n$\\Delta T$ between these models and observations, using univariate analyses for\nboth metallicity [Fe/H] and $[\\alpha/{\\rm Fe}]$. To account for potential\nconfounding factors, we then employed a multivariate generalised additive model\nto study the dependence of $\\Delta T$ on [Fe/H], $[\\alpha/{\\rm Fe}]$, $\\log g$,\nand stellar mass. The initial analysis revealed a negligible trend of $\\Delta\nT$ with [Fe/H], in contrast with previous works in the literature. A slight\n$\\Delta T$ difference of 25 K was detected between stars with high and low\n$\\alpha$-enhancement. Our multivariate analysis reveals a dependence of $\\Delta\nT$ on both [Fe/H] and $[\\alpha/{\\rm Fe}]$, and highlights a significant\ndependence on stellar mass. This suggests a discrepancy in how effective\ntemperature scales with stellar mass in the models compared to observations.\nDespite differences in assumed chemical composition, our analysis, through a\nfortunate cancellation effect, yields ages that are largely consistent with\nrecent studies of the same sample. Notably, our analysis identifies a 6%\nfraction of stars younger than 4 Ga within the high-$\\alpha$ population.\nHowever, our analysis of the [C/N] ratio supports the possible origin of the\nthese stars as a result of mergers or mass transfer events.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}