{"id":"2408.02679","title":"Visual Analysis of Multi-outcome Causal Graphs","authors":"Mengjie Fan, Jinlu Yu, Daniel Weiskopf, Nan Cao, Huai-Yu Wang, and\n  Liang Zhou","authorsParsed":[["Fan","Mengjie",""],["Yu","Jinlu",""],["Weiskopf","Daniel",""],["Cao","Nan",""],["Wang","Huai-Yu",""],["Zhou","Liang",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 08:44:34 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 01:17:43 GMT"}],"updateDate":"2024-08-27","timestamp":1722415474000,"abstract":"  We introduce a visual analysis method for multiple causal graphs with\ndifferent outcome variables, namely, multi-outcome causal graphs. Multi-outcome\ncausal graphs are important in healthcare for understanding multimorbidity and\ncomorbidity. To support the visual analysis, we collaborated with medical\nexperts to devise two comparative visualization techniques at different stages\nof the analysis process. First, a progressive visualization method is proposed\nfor comparing multiple state-of-the-art causal discovery algorithms. The method\ncan handle mixed-type datasets comprising both continuous and categorical\nvariables and assist in the creation of a fine-tuned causal graph of a single\noutcome. Second, a comparative graph layout technique and specialized visual\nencodings are devised for the quick comparison of multiple causal graphs. In\nour visual analysis approach, analysts start by building individual causal\ngraphs for each outcome variable, and then, multi-outcome causal graphs are\ngenerated and visualized with our comparative technique for analyzing\ndifferences and commonalities of these causal graphs. Evaluation includes\nquantitative measurements on benchmark datasets, a case study with a medical\nexpert, and expert user studies with real-world health research data.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Graphics","Computing Research Repository/Human-Computer Interaction","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/"}