{"id":"2408.00362","title":"Measuring the Speed of Gravity and the Cosmic Expansion with Time Delays\n  between Gravity and Light from Binary Neutron Stars","authors":"Leonardo Iampieri, Simone Mastrogiovanni and Francesco Pannarale","authorsParsed":[["Iampieri","Leonardo",""],["Mastrogiovanni","Simone",""],["Pannarale","Francesco",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 08:03:19 GMT"}],"updateDate":"2024-08-02","timestamp":1722499399000,"abstract":"  The first observation of a gravitational wave (GW) and a short gamma-ray\nburst (sGRB) emitted by the same binary neutron star (BNS) merger officially\nopened the field of GW multi-messenger astronomy. In this paper, we define and\naddress \\textit{lagging sirens}, a new class of multi-messenger BNSs for which\nassociated GWs and sGRBs are observed without the identification of their host\ngalaxy. We propose a new methodology to use the observed time delay of these\nsources to constrain the speed of gravity that is, the propagation speed of\ngravitational waves, the Hubble constant and the prompt time delay distribution\nbetween GWs and sGRBs, even though a direct redshift estimation from the host\ngalaxy is unavailable. Our method exploits the intrinsic relation between GWs\nand sGRBs observed and prompt time delays to obtain a statistical redshift\nmeasure for the cosmological sources. We show that this technique can be used\nto infer the Hubble constant at the $10\\%$~level of precision with\nfuture-generation GW detectors such as the Einstein Telescope and only 100\nobservations of this kind. The novel procedure that we propose has systematics\nthat differ completely from the ones of previous GW methods for cosmology.\nAdditionally, we demonstrate for the first time that the speed of gravity and\nthe distribution of the prompt time-delays between GWs and sGRBs can be\ninferred conjointly with less than 10 sources even with current GW detector\nsensitivities.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VqC7xvgPyn0pSdduNbqGPrsM-sHC2W6kwj_B5mIleHE","pdfSize":"1377349"}
