{"id":"2408.10133","title":"Interplay of electronic crystals with integer and fractional Chern\n  insulators in moir\\'e pentalayer graphene","authors":"Dacen Waters, Anna Okounkova, Ruiheng Su, Boran Zhou, Jiang Yao, Kenji\n  Watanabe, Takashi Taniguchi, Xiaodong Xu, Ya-Hui Zhang, Joshua Folk, Matthew\n  Yankowitz","authorsParsed":[["Waters","Dacen",""],["Okounkova","Anna",""],["Su","Ruiheng",""],["Zhou","Boran",""],["Yao","Jiang",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Xu","Xiaodong",""],["Zhang","Ya-Hui",""],["Folk","Joshua",""],["Yankowitz","Matthew",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 16:27:21 GMT"}],"updateDate":"2024-08-20","timestamp":1724084841000,"abstract":"  The rapid development of moir\\'e quantum matter has recently led to the\nremarkable discovery of the fractional quantum anomalous Hall effect, and\nsparked predictions of other novel correlation-driven topological states. Here,\nwe investigate the interplay of electronic crystals with integer and fractional\nChern insulators in a moir\\'e lattice of rhomobohedral pentalayer graphene\n(RPG) aligned with hexagonal boron nitride. At a doping of one electron per\nmoir\\'e unit cell, we see a correlated insulator with a Chern number that can\nbe tuned between $C=0$ and $+1$ by an electric displacement field, accompanied\nby an array of other such insulators formed at fractional band fillings, $\\nu$.\nCollectively, these states likely correspond to trivial and topological\nelectronic crystals, some of which spontaneously break the discrete\ntranslational symmetry of the moir\\'e lattice. Upon applying a modest magnetic\nfield, a narrow region forms around $\\nu=2/3$ in which transport measurements\nimply the emergence of a fractional Chern insulator, along with hints of weaker\nstates at other fractional $\\nu$. In the same sample, we also see a unique\nsequence of incipient Chern insulators arising over a broad range of\nincommensurate band filling near two holes per moir\\'e unit cell. Our results\nestablish moir\\'e RPG as a fertile platform for studying the competition and\npotential intertwining of electronic crystallization and topological charge\nfractionalization.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}