{"id":"2408.09664","title":"3D-printed terahertz subwavelength dual-core fibers with dense\n  channel-integration","authors":"Haiyuan Ge, Haisu Li, Lu Jie, Jianshuai Wang, Yang Cao, Shaghik\n  Atakaramians, Yandong Gong, Guobin Ren, Li Pei","authorsParsed":[["Ge","Haiyuan",""],["Li","Haisu",""],["Jie","Lu",""],["Wang","Jianshuai",""],["Cao","Yang",""],["Atakaramians","Shaghik",""],["Gong","Yandong",""],["Ren","Guobin",""],["Pei","Li",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 02:49:48 GMT"}],"updateDate":"2024-08-20","timestamp":1724035788000,"abstract":"  Terahertz (THz) fiber that provides high-speed connections is an essential\ncomponent in THz communication systems. The emerging\nspace-division-multiplexing technology is expected to increase the transmission\ncapacity of THz communications. A promising candidate to achieve that is\nintegrating multiple channels in a compact THz multi-core fiber system. Here,\nwe propose and experimentally demonstrate a THz subwavelength rectangular\ndielectric dual-core fiber structure, where two identical cores can be densely\nintegrated, thanks to the polarization-maintaining feature of the rectangular\nfiber. Different configurations, including the placements, core-spacings, and\npolarization states of two fiber cores, are comprehensively investigated to\nimprove channel isolation. Numerical simulations show that the fractional power\nin core of fiber mode has a dominant effect on inter-core coupling performance.\nMoreover, we design the core size (1 mm x 0.5 mm) slightly less than the WR5.1\nwaveguide (1.295 mm x 0.6475 mm) so that the fiber can be conveniently\nconnected with the WR5.1 flange port with mode excitation efficiencies up to\n62.8%. A cost-efficient dielectric 3D printing technique is employed for rapid\nfabrications of dual-core fibers and corresponding polymer flange structures\nthat offer solid integration between the fiber samples and the WR5.1 port.\nExperimental measurements demonstrate that a 4-mm core-spacing (less than three\ntimes the operation wavelengths over 0.17-0.21 THz) supports robust\ndual-channel propagation with channel isolation values more than 15 dB, which\nare consistent with theoretical and numerical results. This work provides a\ndensely integrated dual-core fiber system with low fabrication cost and\npractical connection to the WR5.1 flange, holding exciting potential for\nhigh-capacity THz space-division-multiplexing communication systems.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"17kBXN53QfPkdvSNddxFRh6sgcapG_oo0EOJ9puYZ4k","pdfSize":"1870742"}
