{"id":"2408.02268","title":"CHORDination: Evaluating Visual Design Choices in Chord Diagrams for\n  Network Data","authors":"Kai Wang (1), Shuqi He (1), Wenlu Wang (1), Jinbei Yu (1), Yu Liu (1)\n  and Lingyun Yu (1) ((1) Xi'an Jiaotong-Liverpool University)","authorsParsed":[["Wang","Kai","","Xi'an Jiaotong-Liverpool University"],["He","Shuqi","","Xi'an Jiaotong-Liverpool University"],["Wang","Wenlu","","Xi'an Jiaotong-Liverpool University"],["Yu","Jinbei","","Xi'an Jiaotong-Liverpool University"],["Liu","Yu","","Xi'an Jiaotong-Liverpool University"],["Yu","Lingyun","","Xi'an Jiaotong-Liverpool University"]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 06:54:36 GMT"}],"updateDate":"2024-08-06","timestamp":1722840876000,"abstract":"  Chord diagrams are widely used for visualizing data connectivity and flow\nbetween nodes in a network. They are effective for representing complex\nstructures through an intuitive and visually appealing circular layout. While\nprevious work has focused on improving aesthetics and interactivity, the\ninfluence of fundamental design elements on user perception and information\nretrieval remains under-explored. In this study, we explored the three primary\ncomponents of chord diagram anatomy, namely the nodes, circular outline, and\narc connections, in three sequential experiment phases. In phase one, we\nconducted a controlled experiment (N=90) to find the perceptually and\ninformation optimized node widths (narrow, medium, wide) and quantities (low,\nmedium, high). This optimal set of node width and quantity sets the foundation\nfor subsequent evaluations and were kept fixed for consistency. In phase two of\nthe study, we conducted an expert design review for identifying the optimal\nradial tick marks and color gradients. Then in phase three, we evaluated the\nperceptual and information retrieval performance of the design choices in a\ncontrolled experiment (N=24) by comparing four chord diagram designs (baseline,\nradial tick marks, arc color gradients, both tick marks and color gradients).\nResults indicated that node width and quantity significantly affected users'\ninformation retrieval performance and subjective ratings, whereas the presence\nof tick marks predominantly influenced subjective experiences. Based on these\nfindings, we discuss the design implications of these visual elements and offer\nguidance and recommendations for optimizing chord diagram designs in network\nvisualization tasks.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-FZQvJZMriZydNLzt3yFMCANzSFXXpSLkWX9zGv6ag4","pdfSize":"11114667","txDigest":"DcweXKUBtZbiKKm6D9WU1qUzsufeFJNbsG2JUVdbvn2U","endEpoch":"1","status":"CERTIFIED"}
