{"id":"2408.05917","title":"Inverse design of Non-parameterized Ventilated Acoustic Resonator via\n  Variational Autoencoder with Acoustic Response-encoded Latent Space","authors":"Min Woo Cho, Seok Hyeon Hwang, Jun-Young Jang, Jin Yeong Song,\n  Sun-kwang Hwang, Kyoung Je Cha, Dong Yong Park, Kyungjun Song, Sang Min Park","authorsParsed":[["Cho","Min Woo",""],["Hwang","Seok Hyeon",""],["Jang","Jun-Young",""],["Song","Jin Yeong",""],["Hwang","Sun-kwang",""],["Cha","Kyoung Je",""],["Park","Dong Yong",""],["Song","Kyungjun",""],["Park","Sang Min",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 04:43:40 GMT"}],"updateDate":"2024-08-13","timestamp":1723437820000,"abstract":"  Ventilated acoustic resonator(VAR), a type of acoustic metamaterial, emerge\nas an alternative for sound attenuation in environments that require\nventilation, owing to its excellent low-frequency attenuation performance and\nflexible shape adaptability. However, due to the non-linear acoustic responses\nof VARs, the VAR designs are generally obtained within a limited parametrized\ndesign space, and the design relies on the iteration of the numerical\nsimulation which consumes a considerable amount of computational time and\nresources. This paper proposes an acoustic response-encoded variational\nautoencoder (AR-VAE), a novel variational autoencoder-based generative design\nmodel for the efficient and accurate inverse design of VAR even with\nnon-parametrized designs. The AR-VAE matches the high-dimensional acoustic\nresponse with the VAR cross-section image in the dimension-reduced latent\nspace, which enables the AR-VAE to generate various non-parametrized VAR\ncross-section images with the target acoustic response. AR-VAE generates\nnon-parameterized VARs from target acoustic responses, which show a 25-fold\nreduction in mean squared error compared to conventional deep learning-based\nparameter searching methods while exhibiting lower average mean squared error\nand peak frequency variance. By combining the inverse-designed VARs by AR-VAE,\nmulti-cavity VAR was devised for broadband and multitarget peak frequency\nattenuation. The proposed design method presents a new approach for structural\ninverse-design with a high-dimensional non-linear physical response.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}