{"id":"2408.01661","title":"Mitigating the Impact of Malware Evolution on API Sequence-based Windows\n  Malware Detector","authors":"Xingyuan Wei, Ce Li, Qiujian Lv, Ning Li, Degang Sun, Yan Wang","authorsParsed":[["Wei","Xingyuan",""],["Li","Ce",""],["Lv","Qiujian",""],["Li","Ning",""],["Sun","Degang",""],["Wang","Yan",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 04:21:24 GMT"}],"updateDate":"2024-08-06","timestamp":1722658884000,"abstract":"  In dynamic Windows malware detection, deep learning models are extensively\ndeployed to analyze API sequences. Methods based on API sequences play a\ncrucial role in malware prevention. However, due to the continuous updates of\nAPIs and the changes in API sequence calls leading to the constant evolution of\nmalware variants, the detection capability of API sequence-based malware\ndetection models significantly diminishes over time. We observe that the API\nsequences of malware samples before and after evolution usually have similar\nmalicious semantics. Specifically, compared to the original samples, evolved\nmalware samples often use the API sequences of the pre-evolution samples to\nachieve similar malicious behaviors. For instance, they access similar\nsensitive system resources and extend new malicious functions based on the\noriginal functionalities. In this paper, we propose a frame(MME), a framework\nthat can enhance existing API sequence-based malware detectors and mitigate the\nadverse effects of malware evolution. To help detection models capture the\nsimilar semantics of these post-evolution API sequences, our framework\nrepresents API sequences using API knowledge graphs and system resource\nencodings and applies contrastive learning to enhance the model's encoder.\nResults indicate that, compared to Regular Text-CNN, our framework can\nsignificantly reduce the false positive rate by 13.10% and improve the F1-Score\nby 8.47% on five years of data, achieving the best experimental results.\nAdditionally, evaluations show that our framework can save on the human costs\nrequired for model maintenance. We only need 1% of the budget per month to\nreduce the false positive rate by 11.16% and improve the F1-Score by 6.44%.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}