{"id":"2408.15201","title":"An Investigation on The Position Encoding in Vision-Based Dynamics\n  Prediction","authors":"Jiageng Zhu, Hanchen Xie, Jiazhi Li, Mahyar Khayatkhoei, Wael\n  AbdAlmageed","authorsParsed":[["Zhu","Jiageng",""],["Xie","Hanchen",""],["Li","Jiazhi",""],["Khayatkhoei","Mahyar",""],["AbdAlmageed","Wael",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 17:02:03 GMT"}],"updateDate":"2024-08-28","timestamp":1724778123000,"abstract":"  Despite the success of vision-based dynamics prediction models, which predict\nobject states by utilizing RGB images and simple object descriptions, they were\nchallenged by environment misalignments. Although the literature has\ndemonstrated that unifying visual domains with both environment context and\nobject abstract, such as semantic segmentation and bounding boxes, can\neffectively mitigate the visual domain misalignment challenge, discussions were\nfocused on the abstract of environment context, and the insight of using\nbounding box as the object abstract is under-explored. Furthermore, we notice\nthat, as empirical results shown in the literature, even when the visual\nappearance of objects is removed, object bounding boxes alone, instead of being\ndirectly fed into the network, can indirectly provide sufficient position\ninformation via the Region of Interest Pooling operation for dynamics\nprediction. However, previous literature overlooked discussions regarding how\nsuch position information is implicitly encoded in the dynamics prediction\nmodel. Thus, in this paper, we provide detailed studies to investigate the\nprocess and necessary conditions for encoding position information via using\nthe bounding box as the object abstract into output features. Furthermore, we\nstudy the limitation of solely using object abstracts, such that the dynamics\nprediction performance will be jeopardized when the environment context varies.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0Whildi-SFoIsCZTwo9Oz6PJSuhf7F2cr1LCYnhP6rc","pdfSize":"941697"}
