{"id":"2408.05842","title":"Evolving Virtual World with Delta-Engine","authors":"Hongqiu Wu, Zekai Xu, Tianyang Xu, Shize Wei, Yan Wang, Jiale Hong,\n  Weiqi Wu, Hai Zhao, Min Zhang, Zhezhi He","authorsParsed":[["Wu","Hongqiu",""],["Xu","Zekai",""],["Xu","Tianyang",""],["Wei","Shize",""],["Wang","Yan",""],["Hong","Jiale",""],["Wu","Weiqi",""],["Zhao","Hai",""],["Zhang","Min",""],["He","Zhezhi",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 18:32:29 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 03:57:24 GMT"},{"version":"v3","created":"Fri, 30 Aug 2024 15:51:51 GMT"},{"version":"v4","created":"Mon, 2 Sep 2024 15:08:32 GMT"}],"updateDate":"2024-09-04","timestamp":1723401149000,"abstract":"  In this paper, we focus on the \\emph{virtual world}, a cyberspace where\npeople can live in. An ideal virtual world shares great similarity with our\nreal world. One of the crucial aspects is its evolving nature, reflected by\nindividuals' capability to grow and thereby influence the objective world. Such\ndynamics is unpredictable and beyond the reach of existing systems. For this,\nwe propose a special engine called \\textbf{\\emph{Delta-Engine}} to drive this\nvirtual world. $\\Delta$ associates the world's evolution to the engine's\nscalability. It consists of a base engine and a neural proxy. The base engine\nprograms the prototype of the virtual world; given a trigger, the neural proxy\ngenerates new snippets on the base engine through \\emph{incremental\nprediction}. This paper presents a full-stack introduction to the delta-engine.\nThe key feature of the delta-engine is its scalability to unknown elements\nwithin the world, Technically, it derives from the prefect co-work of the\nneural proxy and the base engine, and the alignment with high-quality data. We\nintroduce an engine-oriented fine-tuning method that embeds the base engine\ninto the proxy. We then discuss the human-LLM collaborative design to produce\nnovel and interesting data efficiently. Eventually, we propose three evaluation\nprinciples to comprehensively assess the performance of a delta engine: naive\nevaluation, incremental evaluation, and adversarial evaluation.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}