{"id":"2408.06312","title":"A magnetised Galactic halo from inner Galaxy outflows","authors":"He-Shou Zhang, Gabriele Ponti, Ettore Carretti, Ruo-Yu Liu, Mark R.\n  Morris, Marijke Haverkorn, Nicola Locatelli, Xueying Zheng, Felix Aharonian,\n  Haiming Zhang, Yi Zhang, Giovanni Stel, Andrew Strong, Micheal Yeung, Andrea\n  Merloni","authorsParsed":[["Zhang","He-Shou",""],["Ponti","Gabriele",""],["Carretti","Ettore",""],["Liu","Ruo-Yu",""],["Morris","Mark R.",""],["Haverkorn","Marijke",""],["Locatelli","Nicola",""],["Zheng","Xueying",""],["Aharonian","Felix",""],["Zhang","Haiming",""],["Zhang","Yi",""],["Stel","Giovanni",""],["Strong","Andrew",""],["Yeung","Micheal",""],["Merloni","Andrea",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 17:25:24 GMT"}],"updateDate":"2024-08-13","timestamp":1723483524000,"abstract":"  Large-scale magnetic fields are observed off the midplanes of disk galaxies,\nindicating that they harbour magnetised halos. These halos are crucial to\nstudies of galaxy evolution, galactic-scale outflows, and feedback from star\nformation activity. Identifying the magnetised halo of the Milky Way is\nchallenging because of the potential contamination from foreground emission\narising in local spiral arms. Additionally, it is unclear how our magnetic halo\nis influenced by recently revealed large-scale structures such as the X-ray\nemitting eROSITA Bubbles, which, according to previous simulations, might be\ntransient structures powered by the Galactic Center or the Galaxy's\nstar-forming ring. Here we report the identification of several kpc-scale\nmagnetised structures based on their polarized radio emission and their\ngamma-ray counterparts, which can be interpreted as the radiation of\nrelativistic electrons. These non-thermal structures extend far above and below\nthe Galactic plane and are spatially coincident with the thermal X-ray emission\nfrom the eROSITA Bubbles. The morphological consistency of these structures\nsuggests a common origin, which can be sustained by Galactic outflows driven by\nthe active star-forming regions located at 3-5 kpc from the Galactic Centre.\nThese results reveal how X-ray-emitting and magnetised halos of spiral galaxies\ncan be related to intense star formation activities and suggest that the\nX-shaped coherent magnetic structures observed in their halos can stem from\ngalaxy outflows.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fKaqWxJ2qCAQrhdRap9ZTEUP3GoOOUHre3ZoxeXKxxc","pdfSize":"6175924"}
