{"id":"2408.11704","title":"Diluted Yu-Shiba-Rusinov arrays on the $\\beta$-Bi$_2$Pd anisotropic\n  superconductor","authors":"Stefano Trivini, Jon Ortuzar, Javier Zaldivar, Edwin Herrera, Isabel\n  Guillam\\'on, Hermann Suderow, F. Sebastian Bergeret, Jose Ignacio Pascual","authorsParsed":[["Trivini","Stefano",""],["Ortuzar","Jon",""],["Zaldivar","Javier",""],["Herrera","Edwin",""],["Guillamón","Isabel",""],["Suderow","Hermann",""],["Bergeret","F. Sebastian",""],["Pascual","Jose Ignacio",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 15:28:47 GMT"}],"updateDate":"2024-08-22","timestamp":1724254127000,"abstract":"  Magnetic adatoms on s-wave superconductors induce bound states inside the\nsuperconducting gap, called Yu-Shiba-Rusinov states (YSR). The anisotropy of\nthe Fermi surface determines the spatial extension of bound states in a\nquasi-two-dimensional superconductor. This is especially important in the\ndiluted impurity limit since the orbital overlap determines the coupling of YSR\nstates of neighboring atoms and the formation of the collective YSR system.\nHere, we build diluted arrays of Mn atoms with different dimensionalities on\nthe surface of $\\beta$-Bi$_2$Pd, and we measure the evolution of their YSR\nspectra with the structure. We detect the coupling as a split of YSR peaks in\nsubgap spectra and find that the split size increases with the number of atoms.\nThe orientation of the structures along different directions of the \\bipd\nsubstrate modulates the split and particle-hole asymmetry of the YSR states due\nto the anisotropic character of the Fermi surface, captured by the Green\nfunction model. With the aid of the model, we found multiple YSR excitations in\nan extended 2D array of 25 Mn atoms, and we identified that their spatial\ndistribution reflects a chiral LDOS.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"q7s_9VZ4EUnuAw4Yrucd0RgvoK704pSDXLo4iYeZMM4","pdfSize":"3651888"}
