{"id":"2408.13328","title":"Localized Observation Abstraction Using Piecewise Linear Spatial Decay\n  for Reinforcement Learning in Combat Simulations","authors":"Scotty Black, Christian Darken","authorsParsed":[["Black","Scotty",""],["Darken","Christian",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 18:26:10 GMT"}],"updateDate":"2024-08-27","timestamp":1724437570000,"abstract":"  In the domain of combat simulations, the training and deployment of deep\nreinforcement learning (RL) agents still face substantial challenges due to the\ndynamic and intricate nature of such environments. Unfortunately, as the\ncomplexity of the scenarios and available information increases, the training\ntime required to achieve a certain threshold of performance does not just\nincrease, but often does so exponentially. This relationship underscores the\nprofound impact of complexity in training RL agents. This paper introduces a\nnovel approach that addresses this limitation in training artificial\nintelligence (AI) agents using RL. Traditional RL methods have been shown to\nstruggle in these high-dimensional, dynamic environments due to real-world\ncomputational constraints and the known sample inefficiency challenges of RL.\nTo overcome these limitations, we propose a method of localized observation\nabstraction using piecewise linear spatial decay. This technique simplifies the\nstate space, reducing computational demands while still preserving essential\ninformation, thereby enhancing AI training efficiency in dynamic environments\nwhere spatial relationships are often critical. Our analysis reveals that this\nlocalized observation approach consistently outperforms the more traditional\nglobal observation approach across increasing scenario complexity levels. This\npaper advances the research on observation abstractions for RL, illustrating\nhow localized observation with piecewise linear spatial decay can provide an\neffective solution to large state representation challenges in dynamic\nenvironments.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}