{"id":"2408.14600","title":"PVAFN: Point-Voxel Attention Fusion Network with Multi-Pooling Enhancing\n  for 3D Object Detection","authors":"Yidi Li, Jiahao Wen, Bin Ren, Wenhao Li, Zhenhuan Xu, Hao Guo, Hong\n  Liu, Nicu Sebe","authorsParsed":[["Li","Yidi",""],["Wen","Jiahao",""],["Ren","Bin",""],["Li","Wenhao",""],["Xu","Zhenhuan",""],["Guo","Hao",""],["Liu","Hong",""],["Sebe","Nicu",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 19:43:01 GMT"}],"updateDate":"2024-08-28","timestamp":1724701381000,"abstract":"  The integration of point and voxel representations is becoming more common in\nLiDAR-based 3D object detection. However, this combination often struggles with\ncapturing semantic information effectively. Moreover, relying solely on point\nfeatures within regions of interest can lead to information loss and\nlimitations in local feature representation. To tackle these challenges, we\npropose a novel two-stage 3D object detector, called Point-Voxel Attention\nFusion Network (PVAFN). PVAFN leverages an attention mechanism to improve\nmulti-modal feature fusion during the feature extraction phase. In the\nrefinement stage, it utilizes a multi-pooling strategy to integrate both\nmulti-scale and region-specific information effectively. The point-voxel\nattention mechanism adaptively combines point cloud and voxel-based\nBird's-Eye-View (BEV) features, resulting in richer object representations that\nhelp to reduce false detections. Additionally, a multi-pooling enhancement\nmodule is introduced to boost the model's perception capabilities. This module\nemploys cluster pooling and pyramid pooling techniques to efficiently capture\nkey geometric details and fine-grained shape structures, thereby enhancing the\nintegration of local and global features. Extensive experiments on the KITTI\nand Waymo datasets demonstrate that the proposed PVAFN achieves competitive\nperformance. The code and models will be available.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}