{"id":"2408.05335","title":"Interlayer Dzyaloshinskii-Moriya interactions induced via non-linear\n  phononics in bilayer van der Waals materials","authors":"Ze-Xun Lin, Bowen Ma, Wesley Roberts, Martin Rodriguez-Vega, and\n  Gregory A. Fiete","authorsParsed":[["Lin","Ze-Xun",""],["Ma","Bowen",""],["Roberts","Wesley",""],["Rodriguez-Vega","Martin",""],["Fiete","Gregory A.",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 21:06:12 GMT"}],"updateDate":"2024-08-13","timestamp":1723237572000,"abstract":"  We theoretically study the impact of light-driven structural changes via\nnonlinear phononics on the magnetic order of untwisted bilayer van der Waals\nmaterials. We consider an illustrative example of the AA-stacked bilayer\nhoneycomb lattice and show that high-intensity light in resonance with selected\nphonons induces large amplitude phonon displacements that modify the magnetic\nHamiltonian of the system. We performed a group theory analysis to identify the\nvibrational modes of the honeycomb bilayer and the nonlinear couplings among\nthem in the strongly driven regime. We find that the structural changes in the\nstrongly driven regime lower the symmetry relative to the equilibrium lattice\nand produce changes in the magnetic interactions between the local moments. In\nparticular, the lattice symmetry changes permit a non-zero interlayer\nDzyaloshinskii-Moriya interaction that induces a magnetic state with canted\nlocal moments. Using a spin-wave analysis about the new magnetic configuration\nwe study the corresponding changes in the magnon spectrum and identify a\nprotocol for engineering topological band transitions using a combination of\nnonlinear phononics and an external magnetic field. Our work suggests a\nstrategy to induce interlayer Dyzaloshinskii-Moriya interactions in a class of\nlayered van der Waals materials, the effect of which is to modify the magnetic\nground state, magnon dispersions, and related band geometric properties,\nincluding topological invariants.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}