{"id":"2408.00706","title":"Point-supervised Brain Tumor Segmentation with Box-prompted MedSAM","authors":"Xiaofeng Liu, Jonghye Woo, Chao Ma, Jinsong Ouyang, Georges El Fakhri","authorsParsed":[["Liu","Xiaofeng",""],["Woo","Jonghye",""],["Ma","Chao",""],["Ouyang","Jinsong",""],["Fakhri","Georges El",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 16:52:39 GMT"}],"updateDate":"2024-08-02","timestamp":1722531159000,"abstract":"  Delineating lesions and anatomical structure is important for image-guided\ninterventions. Point-supervised medical image segmentation (PSS) has great\npotential to alleviate costly expert delineation labeling. However, due to the\nlack of precise size and boundary guidance, the effectiveness of PSS often\nfalls short of expectations. Although recent vision foundational models, such\nas the medical segment anything model (MedSAM), have made significant\nadvancements in bounding-box-prompted segmentation, it is not straightforward\nto utilize point annotation, and is prone to semantic ambiguity. In this\npreliminary study, we introduce an iterative framework to facilitate\nsemantic-aware point-supervised MedSAM. Specifically, the semantic box-prompt\ngenerator (SBPG) module has the capacity to convert the point input into\npotential pseudo bounding box suggestions, which are explicitly refined by the\nprototype-based semantic similarity. This is then succeeded by a prompt-guided\nspatial refinement (PGSR) module that harnesses the exceptional\ngeneralizability of MedSAM to infer the segmentation mask, which also updates\nthe box proposal seed in SBPG. Performance can be progressively improved with\nadequate iterations. We conducted an evaluation on BraTS2018 for the\nsegmentation of whole brain tumors and demonstrated its superior performance\ncompared to traditional PSS methods and on par with box-supervised methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing","Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AwEqmZUJtXU35ktZWDybSNsurDFtXoJ2jmOaRN1skY8","pdfSize":"1313936","txDigest":"4TP93Pfy6SKtP6jtt5ad3gDNjoBbWM94wH3vmyyBS1z3","endEpoch":"1","status":"CERTIFIED"}
