{"id":"2408.05436","title":"A Methodological and Structural Review of Hand Gesture Recognition\n  Across Diverse Data Modalities","authors":"Jungpil Shin, Abu Saleh Musa Miah, Md. Humaun Kabir, Md. Abdur Rahim,\n  Abdullah Al Shiam","authorsParsed":[["Shin","Jungpil",""],["Miah","Abu Saleh Musa",""],["Kabir","Md. Humaun",""],["Rahim","Md. Abdur",""],["Shiam","Abdullah Al",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 04:40:01 GMT"}],"updateDate":"2024-09-12","timestamp":1723264801000,"abstract":"  Researchers have been developing Hand Gesture Recognition (HGR) systems to\nenhance natural, efficient, and authentic human-computer interaction,\nespecially benefiting those who rely solely on hand gestures for communication.\nDespite significant progress, the automatic and precise identification of hand\ngestures remains a considerable challenge in computer vision. Recent studies\nhave focused on specific modalities like RGB images, skeleton data, and\nspatiotemporal interest points. This paper provides a comprehensive review of\nHGR techniques and data modalities from 2014 to 2024, exploring advancements in\nsensor technology and computer vision. We highlight accomplishments using\nvarious modalities, including RGB, Skeleton, Depth, Audio, EMG, EEG, and\nMultimodal approaches and identify areas needing further research. We reviewed\nover 200 articles from prominent databases, focusing on data collection, data\nsettings, and gesture representation. Our review assesses the efficacy of HGR\nsystems through their recognition accuracy and identifies a gap in research on\ncontinuous gesture recognition, indicating the need for improved vision-based\ngesture systems. The field has experienced steady research progress, including\nadvancements in hand-crafted features and deep learning (DL) techniques.\nAdditionally, we report on the promising developments in HGR methods and the\narea of multimodal approaches. We hope this survey will serve as a potential\nguideline for diverse data modality-based HGR research.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}