{"id":"2408.10442","title":"Feasibility of assessing cognitive impairment via distributed camera\n  network and privacy-preserving edge computing","authors":"Chaitra Hegde, Yashar Kiarashi, Allan I Levey, Amy D Rodriguez,\n  Hyeokhyen Kwon, Gari D Clifford","authorsParsed":[["Hegde","Chaitra",""],["Kiarashi","Yashar",""],["Levey","Allan I",""],["Rodriguez","Amy D",""],["Kwon","Hyeokhyen",""],["Clifford","Gari D",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 22:34:43 GMT"}],"updateDate":"2024-08-21","timestamp":1724106883000,"abstract":"  INTRODUCTION: Mild cognitive impairment (MCI) is characterized by a decline\nin cognitive functions beyond typical age and education-related expectations.\nSince, MCI has been linked to reduced social interactions and increased aimless\nmovements, we aimed to automate the capture of these behaviors to enhance\nlongitudinal monitoring.\n  METHODS: Using a privacy-preserving distributed camera network, we collected\nmovement and social interaction data from groups of individuals with MCI\nundergoing therapy within a 1700$m^2$ space. We developed movement and social\ninteraction features, which were then used to train a series of machine\nlearning algorithms to distinguish between higher and lower cognitive\nfunctioning MCI groups.\n  RESULTS: A Wilcoxon rank-sum test revealed statistically significant\ndifferences between high and low-functioning cohorts in features such as linear\npath length, walking speed, change in direction while walking, entropy of\nvelocity and direction change, and number of group formations in the indoor\nspace. Despite lacking individual identifiers to associate with specific levels\nof MCI, a machine learning approach using the most significant features\nprovided a 71% accuracy.\n  DISCUSSION: We provide evidence to show that a privacy-preserving low-cost\ncamera network using edge computing framework has the potential to distinguish\nbetween different levels of cognitive impairment from the movements and social\ninteractions captured during group activities.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"DzsA7kqYrxkecSinzYTKNCb7aaHP_XADPBTbCh0tOiY","pdfSize":"1359315"}
