{"id":"2408.14106","title":"Energy-Momentum Squared Gravity: A Brief Overview","authors":"Ricardo A. C. Cipriano, Nailya Ganiyeva, Tiberiu Harko, Francisco S.\n  N. Lobo, Miguel A. S. Pinto, Jo\\~ao Lu\\'is Rosa","authorsParsed":[["Cipriano","Ricardo A. C.",""],["Ganiyeva","Nailya",""],["Harko","Tiberiu",""],["Lobo","Francisco S. N.",""],["Pinto","Miguel A. S.",""],["Rosa","João Luís",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 08:49:11 GMT"}],"updateDate":"2024-08-27","timestamp":1724662151000,"abstract":"  In this work, we present a review of Energy-Momentum Squared Gravity (EMSG)\n-- more specifically, $f(R,T_{\\mu\\nu}T^{\\mu\\nu})$ gravity, where $R$ represents\nthe Ricci scalar and $T_{\\mu\\nu}$ denotes the energy-momentum tensor. The\ninclusion of quadratic contributions from the energy-momentum components has\nintriguing cosmological implications, particularly during the Universe's early\nepochs. These effects dominate under high-energy conditions, enabling EMSG to\npotentially address unresolved issues in General Relativity (GR), such as the\ninitial singularity and aspects of big-bang nucleosynthesis in certain models.\nThe theory's explicit non-minimal coupling between matter and geometry leads to\nthe non-conservation of the energy-momentum tensor, which prompts the\ninvestigation of cosmological scenarios through the framework of irreversible\nthermodynamics of open systems. By employing this formalism, we interpret the\nenergy-balance equations within EMSG from a thermodynamic perspective, viewing\nthem as descriptions of irreversible matter creation processes. Since EMSG\nconverges to GR in a vacuum and differences emerge only in the presence of an\nenergy-momentum distribution, these distinctions become significant in\nhigh-curvature regions. Therefore, deviations from GR are expected to be\npronounced in the dense cores of compact objects. This review delves into these\nfacets of EMSG, highlighting its potential to shed light on some of the\nfundamental questions in modern cosmology and gravitational theory.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}