{"id":"2408.02160","title":"Modeling and Design of RIS-Assisted Multi-cell Multi-band Networks with\n  RSMA","authors":"Abdelhamid Salem, Kai-Kit Wong, Chan-Byoung Chae, and Yangyang Zhang","authorsParsed":[["Salem","Abdelhamid",""],["Wong","Kai-Kit",""],["Chae","Chan-Byoung",""],["Zhang","Yangyang",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 22:48:57 GMT"}],"updateDate":"2024-08-06","timestamp":1722811737000,"abstract":"  Reconfigurable intelligent surface (RIS) has been identified as a promising\ntechnology for future wireless communication systems due to its ability to\nmanipulate the propagation environment intelligently. RIS is a\nfrequency-selective device, thus it can only effectively manipulate the\npropagation of signals within a specific frequency band. This frequency\nselective characteristic can make deploying RIS in wireless cellular networks\nmore challenging, as adjacent base stations (BSs) operate on different\nfrequency bands. In addition, rate-splitting multiple access (RSMA) scheme has\nbeen shown to enhance the performance of RIS-aided multi-user communication\nsystems. Accordingly, this work considers a more practical reflection model for\nRIS-aided RSMA communication systems, which accounts for the responses of\nsignals across different frequency bands. To that end, new analytical\nexpressions for the ergodic sum-rate are derived using the moment generating\nfunction (MGF) and Jensen inequality. Based on these analytical sum-rate\nexpressions, novel practical RIS reflection designs and power allocation\nstrategies for the RSMA scheme are proposed and investigated to maximize the\nachievable sum-rate in RIS-assisted multi-cell, multi-band cellular networks.\nSimple sub-optimal designs are also introduced and discussed. The results\nvalidate the significant gains of our proposed reflection design algorithms\nwith RSMA over conventional schemes in terms of achievable sum-rate.\nAdditionally, the power allocation strategy for the RSMA scheme is shown to\noffer superior performance compared to conventional precoding schemes that do\nnot rely on RSMA.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}