{"id":"2408.08763","title":"GRB Redshift Classifier to Follow-up High-Redshift GRBs Using Supervised\n  Machine Learning","authors":"Maria Giovanna Dainotti, Shubham Bhardwaj, Christopher Cook, Joshua\n  Ange, Nishan Lamichhane, Malgorzata Bogdan, Monnie McGee, Pavel Nadolsky,\n  Milind Sarkar, Agnieszka Pollo, and Shigehiro Nagataki","authorsParsed":[["Dainotti","Maria Giovanna",""],["Bhardwaj","Shubham",""],["Cook","Christopher",""],["Ange","Joshua",""],["Lamichhane","Nishan",""],["Bogdan","Malgorzata",""],["McGee","Monnie",""],["Nadolsky","Pavel",""],["Sarkar","Milind",""],["Pollo","Agnieszka",""],["Nagataki","Shigehiro",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 14:13:40 GMT"}],"updateDate":"2024-08-19","timestamp":1723817620000,"abstract":"  Gamma-ray bursts (GRBs) are intense, short-lived bursts of gamma-ray\nradiation observed up to a high redshift ($z \\sim 10$) due to their\nluminosities. Thus, they can serve as cosmological tools to probe the early\nUniverse. However, we need a large sample of high$-z$ GRBs, currently limited\ndue to the difficulty in securing time at the large aperture Telescopes. Thus,\nit is painstaking to determine quickly whether a GRB is high$z$ or low$-z$,\nwhich hampers the possibility of performing rapid follow-up observations.\nPrevious efforts to distinguish between high$-$ and low$-z$ GRBs using GRB\nproperties and machine learning (ML) have resulted in limited sensitivity. In\nthis study, we aim to improve this classification by employing an ensemble ML\nmethod on 251 GRBs with measured redshifts and plateaus observed by the Neil\nGehrels Swift Observatory. Incorporating the plateau phase with the prompt\nemission, we have employed an ensemble of classification methods to enhance the\nsensitivity unprecedentedly. Additionally, we investigate the effectiveness of\nvarious classification methods using different redshift thresholds,\n$z_{threshold}$=$z_t$ at $z_{t}=$ 2.0, 2.5, 3.0, and 3.5. We achieve a\nsensitivity of 87\\% and 89\\% with a balanced sampling for both $z_{t}=3.0$ and\n$z_{t}=3.5$, respectively, representing a 9\\% and 11\\% increase in the\nsensitivity over Random Forest used alone. Overall, the best results are at\n$z_{t} = 3.5$, where the difference between the sensitivity of the training set\nand the test set is the smallest. This enhancement of the proposed method paves\nthe way for new and intriguing follow-up observations of high$-z$ GRBs.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iy0DhT_dEyxw_hVfu2ob6EXEjREHN1rDO5DC_-k_sv0","pdfSize":"11636492"}
