{"id":"2408.12879","title":"Frequency-aware Feature Fusion for Dense Image Prediction","authors":"Linwei Chen, Ying Fu, Lin Gu, Chenggang Yan, Tatsuya Harada, Gao Huang","authorsParsed":[["Chen","Linwei",""],["Fu","Ying",""],["Gu","Lin",""],["Yan","Chenggang",""],["Harada","Tatsuya",""],["Huang","Gao",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 07:30:34 GMT"}],"updateDate":"2024-08-26","timestamp":1724398234000,"abstract":"  Dense image prediction tasks demand features with strong category information\nand precise spatial boundary details at high resolution. To achieve this,\nmodern hierarchical models often utilize feature fusion, directly adding\nupsampled coarse features from deep layers and high-resolution features from\nlower levels. In this paper, we observe rapid variations in fused feature\nvalues within objects, resulting in intra-category inconsistency due to\ndisturbed high-frequency features. Additionally, blurred boundaries in fused\nfeatures lack accurate high frequency, leading to boundary displacement.\nBuilding upon these observations, we propose Frequency-Aware Feature Fusion\n(FreqFusion), integrating an Adaptive Low-Pass Filter (ALPF) generator, an\noffset generator, and an Adaptive High-Pass Filter (AHPF) generator. The ALPF\ngenerator predicts spatially-variant low-pass filters to attenuate\nhigh-frequency components within objects, reducing intra-class inconsistency\nduring upsampling. The offset generator refines large inconsistent features and\nthin boundaries by replacing inconsistent features with more consistent ones\nthrough resampling, while the AHPF generator enhances high-frequency detailed\nboundary information lost during downsampling. Comprehensive visualization and\nquantitative analysis demonstrate that FreqFusion effectively improves feature\nconsistency and sharpens object boundaries. Extensive experiments across\nvarious dense prediction tasks confirm its effectiveness. The code is made\npublicly available at https://github.com/Linwei-Chen/FreqFusion.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}