{"id":"2408.17334","title":"Role of Data-driven Regional Growth Model in Shaping Brain Folding\n  Patterns","authors":"Jixin Hou, Zhengwang Wu, Xianyan Chen, Li Wang, Dajiang Zhu, Tianming\n  Liu, Gang Li, Xianqiao Wang","authorsParsed":[["Hou","Jixin",""],["Wu","Zhengwang",""],["Chen","Xianyan",""],["Wang","Li",""],["Zhu","Dajiang",""],["Liu","Tianming",""],["Li","Gang",""],["Wang","Xianqiao",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 14:49:10 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 22:30:36 GMT"}],"updateDate":"2024-09-06","timestamp":1725029350000,"abstract":"  The surface morphology of the developing mammalian brain is crucial for\nunderstanding brain function and dysfunction. Computational modeling offers\nvaluable insights into the underlying mechanisms for early brain folding.\nRecent findings indicate significant regional variations in brain tissue\ngrowth, while the role of these variations in cortical development remains\nunclear. In this study, we unprecedently explored how regional cortical growth\naffects brain folding patterns using computational simulation. We first\ndeveloped growth models for typical cortical regions using machine learning\n(ML)-assisted symbolic regression, based on longitudinal real surface expansion\nand cortical thickness data from prenatal and infant brains derived from over\n1,000 MRI scans of 735 pediatric subjects with ages ranging from 29\npost-menstrual weeks to 24 months. These models were subsequently integrated\ninto computational software to simulate cortical development with anatomically\nrealistic geometric models. We comprehensively quantified the resulting folding\npatterns using multiple metrics such as mean curvature, sulcal depth, and\ngyrification index. Our results demonstrate that regional growth models\ngenerate complex brain folding patterns that more closely match actual brains\nstructures, both quantitatively and qualitatively, compared to conventional\nuniform growth models. Growth magnitude plays a dominant role in shaping\nfolding patterns, while growth trajectory has a minor influence. Moreover,\nmulti-region models better capture the intricacies of brain folding than\nsingle-region models. Our results underscore the necessity and importance of\nincorporating regional growth heterogeneity into brain folding simulations,\nwhich could enhance early diagnosis and treatment of cortical malformations and\nneurodevelopmental disorders such as cerebral palsy and autism.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Symbolic Computation","Quantitative Biology/Tissues and Organs"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}