{"id":"2408.11128","title":"Massive stellar triples on the edge: A numerical study of the evolution\n  and final outcomes of destabilized massive triples","authors":"C. W. Bruenech, T. Boekholt, F. Kummer, S. Toonen","authorsParsed":[["Bruenech","C. W.",""],["Boekholt","T.",""],["Kummer","F.",""],["Toonen","S.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 18:27:01 GMT"}],"updateDate":"2024-08-22","timestamp":1724178421000,"abstract":"  Massive stars reside predominantly in triples or higher-order multiples.\nTheir lives can be significantly affected by three-body interactions, making it\nan important area of study in the context of massive star evolution. In this\nstudy we provide a statistical overview of the lives and final outcomes of\ndestabilized massive triples. A population of initially stable triples with a\nmassive primary star are evolved from the zero-age main sequence using the code\nTRES, which combines stellar evolution with orbit-averaged dynamics. The\ntriples that become unstable are transferred to a direct N-body code where they\nare simulated until the system disintegrates. This excludes systems undergoing\nmass transfer, such that the instability is caused by stellar winds or\nsupernovae. Two suites of N-body simulations are performed; one with gravity as\nthe only interaction, and one with stellar evolution included. We find that\ncollisions occur in 35 - 40% of systems, with the variation coming from whether\nstellar evolution is included. The collisions mainly involve two main sequence\nstars (70 - 78%) or a main sequence and post-main sequence star (13 - 28%). We\nestimate a Galactic rate of collisions due to massive triple destabilization at\n1.1 - 1.3 events per Myr. Furthermore, we find that the process of\ndestabilization often ends in the ejection of one of the stellar bodies,\nspecifically for 31 - 40% of systems. The ejected bodies have typical\nvelocities of around 6 km/s, with a tail stretching to 102 km/s. If we assume\nthat 20% of massive stars are runaway stars, then 0.1% of runaways originate\nfrom triple destabilization. Overall, our simulations show that triple\ninstability affects approximately 2% of massive triples. However, we estimate\nthat up to ten times as many systems can become unstable due to mass transfer\nin the inner binary, and these system may end up ejecting bodies at higher\nvelocities.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fKwpwIddXMrrkozuIa0uDSUEAFWITeWE2ELNSyfJpAQ","pdfSize":"1064822"}
