{"id":"2408.05645","title":"BeyondCT: A deep learning model for predicting pulmonary function from\n  chest CT scans","authors":"Kaiwen Geng, Zhiyi Shi, Xiaoyan Zhao, Alaa Ali, Jing Wang, Joseph\n  Leader, Jiantao Pu","authorsParsed":[["Geng","Kaiwen",""],["Shi","Zhiyi",""],["Zhao","Xiaoyan",""],["Ali","Alaa",""],["Wang","Jing",""],["Leader","Joseph",""],["Pu","Jiantao",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 22:28:02 GMT"}],"updateDate":"2024-08-13","timestamp":1723328882000,"abstract":"  Abstract\n  Background: Pulmonary function tests (PFTs) and computed tomography (CT)\nimaging are vital in diagnosing, managing, and monitoring lung diseases. A\ncommon issue in practice is the lack of access to recorded pulmonary functions\ndespite available chest CT scans.\n  Purpose: To develop and validate a deep learning algorithm for predicting\npulmonary function directly from chest CT scans.\n  Methods: The development cohort came from the Pittsburgh Lung Screening Study\n(PLuSS) (n=3619). The validation cohort came from the Specialized Centers of\nClinically Oriented Research (SCCOR) in COPD (n=662). A deep learning model\ncalled BeyondCT, combining a three-dimensional (3D) convolutional neural\nnetwork (CNN) and Vision Transformer (ViT) architecture, was used to predict\nforced vital capacity (FVC) and forced expiratory volume in one second (FEV1)\nfrom non-contrasted inspiratory chest CT scans. A 3D CNN model without ViT was\nused for comparison. Subject demographics (age, gender, smoking status) were\nalso incorporated into the model. Performance was compared to actual PFTs using\nmean absolute error (MAE, L), percentage error, and R square.\n  Results: The 3D-CNN model achieved MAEs of 0.395 L and 0.383 L, percentage\nerrors of 13.84% and 18.85%, and R square of 0.665 and 0.679 for FVC and FEV1,\nrespectively. The BeyondCT model without demographics had MAEs of 0.362 L and\n0.371 L, percentage errors of 10.89% and 14.96%, and R square of 0.719 and\n0.727, respectively. Including demographics improved performance (p<0.05), with\nMAEs of 0.356 L and 0.353 L, percentage errors of 10.79% and 14.82%, and R\nsquare of 0.77 and 0.739 for FVC and FEV1 in the test set.\n  Conclusion: The BeyondCT model showed robust performance in predicting lung\nfunction from non-contrast inspiratory chest CT scans.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}