{"id":"2408.06231","title":"On the potential origin of the circumbinary planet Delorme 1 (AB)b","authors":"Matthew Teasdale and Dimitris Stamatellos","authorsParsed":[["Teasdale","Matthew",""],["Stamatellos","Dimitris",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 15:34:30 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 13:39:22 GMT"}],"updateDate":"2024-09-04","timestamp":1723476870000,"abstract":"  Many circumbinary gas giant planets have been recently discovered. The\nformation mechanism of circumbinary planets on wide orbits is unclear. We\ninvestigate the formation of Delorme 1 (AB)b, a 13$\\pm$5M$_{\\rm J}$ planet,\norbiting its host binary at 84AU. The planet is accreting while having an\nestimated age of 40Myr, which is unexpected, as this process should have ceased\ndue to the dissipation of the protoplanetary disc. Using the Smoothed Particle\nHydrodynamics code SEREN, we model three formation scenarios for this planet.\nIn Scenario I the planet forms in-situ on a wide orbit in a massive disc (by\ngravitational instability), in Scenario II closer to the binary in a massive\ndisc (by gravitational instability), and in Scenario III much closer to the\nbinary in a less massive disc (by core accretion). Planets in Scenario I stay\nat the observed separation, have mass accretion rates consistent with observed\nvalue, but their final mass is too high. In Scenario II, the planet reaches the\nobserved separation through outward migration or scattering by the binary, and\nhas mass accretion rate comparable to the observed; however, the planet mass is\nabove the observed value. In Scenario III, the planet's final mass and mass\naccretion rate are comparable to the observed ones but the planet's separation\nis smaller. We conclude that all models may explain some features of the\nobservations but not all of them, raising questions about how gas is accreted\nonto the planet from its circumplanetary disc, and of the presumed age of the\nsystem.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}