{"id":"2408.14027","title":"UAV-Enabled Integrated Sensing and Communication in Maritime Emergency\n  Networks","authors":"Bohan Li, Jiahao Liu, Yifeng Xiong, Junsheng Mu, Pei Xiao, Sheng Chen","authorsParsed":[["Li","Bohan",""],["Liu","Jiahao",""],["Xiong","Yifeng",""],["Mu","Junsheng",""],["Xiao","Pei",""],["Chen","Sheng",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 05:36:58 GMT"}],"updateDate":"2024-08-27","timestamp":1724650618000,"abstract":"  With line-of-sight mode deployment and fast response, unmanned aerial vehicle\n(UAV), equipped with the cutting-edge integrated sensing and communication\n(ISAC) technique, is poised to deliver high-quality communication and sensing\nservices in maritime emergency scenarios. In practice, however, the real-time\ntransmission of ISAC signals at the UAV side cannot be realized unless the\nreliable wireless fronthaul link between the terrestrial base station and UAV\nare available. This paper proposes a multicarrier-division duplex based joint\nfronthaul-access scheme, where mutually orthogonal subcarrier sets are\nleveraged to simultaneously support four types of fronthaul/access\ntransmissions. In order to maximize the end-to-end communication rate while\nmaintaining an adequate sensing quality-of-service (QoS) in such a complex\nscheme, the UAV trajectory, subcarrier assignment and power allocation are\njointly optimized. The overall optimization process is designed in two stages.\nAs the emergency area is usually far away from the coast, the optimal initial\noperating position for the UAV is first found. Once the UAV passes the initial\noperating position, the UAV's trajectory and resource allocation are optimized\nduring the mission period to maximize the end-to-end communication rate under\nthe constraint of minimum sensing QoS. Simulation results demonstrate the\neffectiveness of the proposed scheme in dealing with the joint fronthaul-access\noptimization problem in maritime ISAC networks, offering the advantages over\nbenchmark schemes.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}