{"id":"2408.05207","title":"Design and Fabrication of Soft Locomotion Robots based on Spatial\n  Compliant Mechanisms","authors":"Andrija Milojevic and Kyrre Glette","authorsParsed":[["Milojevic","Andrija",""],["Glette","Kyrre",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 17:58:05 GMT"}],"updateDate":"2024-08-12","timestamp":1723226285000,"abstract":"  Soft robotics has emerged as a promising technology that holds great\npotential for various application areas. This is due to soft materials unique\nproperties, including flexibility, safety, and shock absorption, among others.\nDespite many advancement in the field, the development of effective design\nmethodologies and production techniques for soft robots remains a challenge.\nAlthough numerous robot prototypes have been proposed in recent years, their\ndesigns are often complex and difficult to produce. As such, there is a need\nfor more efficient and unified design approaches that can facilitate the\nproduction of soft robots with desirable properties. In this paper, we propose\na method for designing soft robots using elastic beams and spatial compliant\nmechanisms. The method is based on an evolutionary approach that enables the\ncreation of designs with both high motion and force transmission ratios.\nSpecifically, we focus on the development of locomotion mechanisms using a\ncentral linear actuator. Our approach involves the use of commonly available\nplastic materials and a 3D printer to manufacture the designs. We demonstrate\nthe feasibility of our approach by presenting experimental results that show\nsuccessful production and real world operation. Overall, our findings suggest\nthat the use of elastic beams and an evolutionary approach can facilitate the\ncreation of soft robots with desirable locomotion properties, including fast\nlocomotion up to 3.7 body lengths per second, locomotion with a payload, and\nunderwater locomotion. This method has the potential to enable the development\nof more efficient and practical soft robots for various applications.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}