{"id":"2408.11184","title":"Second and third harmonic generation of acoustic waves in a nonlinear\n  elastic solid in one space dimension","authors":"Fernando Lund","authorsParsed":[["Lund","Fernando",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 20:40:05 GMT"}],"updateDate":"2024-08-22","timestamp":1724186405000,"abstract":"  The generation of second and third harmonics by an acoustic wave propagating\nalong one dimension in a weakly nonlinear elastic medium that is loaded\nharmonically in time with frequency $\\omega_0$ at a single point in space, is\nanalyzed by successive approximations starting with the linear case. It is\nnoted that nonlinear waves have a speed of propagation that depends on their\namplitude. It is also noted that both a free medium as well as a loaded medium\ngenerate higher harmonics, but that although the second harmonic of the free\nmedium scales like the square of the linear wave, this is no longer the case\nwhen the medium is externally loaded. The shift in speed of propagation due to\nthe nonlinearities is determined imposing that there be no resonant terms in a\nsuccessive approximation solution scheme to the homogeneous problem. The result\nis then used to solve the inhomogeneous case also by successive approximations,\nup to the third order. At second order, the result is a second harmonic wave\nwhose amplitude is modulated by a long wave, whose wavelength is inversely\nproportional to the shift in the speed of propagation of the linear wave due to\nnonlinearities. The amplitude of the long modulating wave scales like the\namplitude of the linear wave to the four thirds. At short distances from the\nsource a scaling proportional to the amplitude of the linear wave squared is\nrecovered, as is a second harmonic amplitude that grows linearly with distance\nfrom the source and depends on the third-order elastic constant only. The third\norder solution is the sum of four amplitude-modulated waves, two of them\noscillate with frequency $\\omega_0$ and the other two, third harmonics, with\n$3\\omega_0$. In each pair, one term scales like the amplitude of the linear\nwave to the five-thirds, and the other to the seven-thirds.\n","subjects":["Condensed Matter/Materials Science","Nonlinear Sciences/Pattern Formation and Solitons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"h47akT1O4P7fye4ZWyct6c40CSxfazFbuXY1ISNm4zE","pdfSize":"439284"}
