{"id":"2408.01929","title":"Advancing H&E-to-IHC Stain Translation in Breast Cancer: A\n  Multi-Magnification and Attention-Based Approach","authors":"Linhao Qu, Chengsheng Zhang, Guihui Li, Haiyong Zheng, Chen Peng and\n  Wei He","authorsParsed":[["Qu","Linhao",""],["Zhang","Chengsheng",""],["Li","Guihui",""],["Zheng","Haiyong",""],["Peng","Chen",""],["He","Wei",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 04:55:10 GMT"}],"updateDate":"2024-08-06","timestamp":1722747310000,"abstract":"  Breast cancer presents a significant healthcare challenge globally, demanding\nprecise diagnostics and effective treatment strategies, where histopathological\nexamination of Hematoxylin and Eosin (H&E) stained tissue sections plays a\ncentral role. Despite its importance, evaluating specific biomarkers like Human\nEpidermal Growth Factor Receptor 2 (HER2) for personalized treatment remains\nconstrained by the resource-intensive nature of Immunohistochemistry (IHC).\nRecent strides in deep learning, particularly in image-to-image translation,\noffer promise in synthesizing IHC-HER2 slides from H\\&E stained slides.\nHowever, existing methodologies encounter challenges, including managing\nmultiple magnifications in pathology images and insufficient focus on crucial\ninformation during translation. To address these issues, we propose a novel\nmodel integrating attention mechanisms and multi-magnification information\nprocessing. Our model employs a multi-magnification processing strategy to\nextract and utilize information from various magnifications within pathology\nimages, facilitating robust image translation. Additionally, an attention\nmodule within the generative network prioritizes critical information for image\ndistribution translation while minimizing less pertinent details. Rigorous\ntesting on a publicly available breast cancer dataset demonstrates superior\nperformance compared to existing methods, establishing our model as a\nstate-of-the-art solution in advancing pathology image translation from H&E to\nIHC staining.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}