{"id":"2408.13928","title":"GeoPlant: Spatial Plant Species Prediction Dataset","authors":"Lukas Picek, Christophe Botella, Maximilien Servajean, C\\'esar\n  Leblanc, R\\'emi Palard, Th\\'eo Larcher, Benjamin Deneu, Diego Marcos, Pierre\n  Bonnet and Alexis Joly","authorsParsed":[["Picek","Lukas",""],["Botella","Christophe",""],["Servajean","Maximilien",""],["Leblanc","César",""],["Palard","Rémi",""],["Larcher","Théo",""],["Deneu","Benjamin",""],["Marcos","Diego",""],["Bonnet","Pierre",""],["Joly","Alexis",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 20:09:46 GMT"}],"updateDate":"2024-08-27","timestamp":1724616586000,"abstract":"  The difficulty of monitoring biodiversity at fine scales and over large areas\nlimits ecological knowledge and conservation efforts. To fill this gap, Species\nDistribution Models (SDMs) predict species across space from spatially explicit\nfeatures. Yet, they face the challenge of integrating the rich but\nheterogeneous data made available over the past decade, notably millions of\nopportunistic species observations and standardized surveys, as well as\nmulti-modal remote sensing data. In light of that, we have designed and\ndeveloped a new European-scale dataset for SDMs at high spatial resolution\n(10-50 m), including more than 10k species (i.e., most of the European flora).\nThe dataset comprises 5M heterogeneous Presence-Only records and 90k exhaustive\nPresence-Absence survey records, all accompanied by diverse environmental\nrasters (e.g., elevation, human footprint, and soil) that are traditionally\nused in SDMs. In addition, it provides Sentinel-2 RGB and NIR satellite images\nwith 10 m resolution, a 20-year time-series of climatic variables, and\nsatellite time-series from the Landsat program. In addition to the data, we\nprovide an openly accessible SDM benchmark (hosted on Kaggle), which has\nalready attracted an active community and a set of strong baselines for single\npredictor/modality and multimodal approaches. All resources, e.g., the dataset,\npre-trained models, and baseline methods (in the form of notebooks), are\navailable on Kaggle, allowing one to start with our dataset literally with two\nmouse clicks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tCPrb5-RK9TU3xNNtOEUVCQ6L8j2WsQ6QHeb04upndY","pdfSize":"14616152"}
