{"id":"2408.15198","title":"Automatic 8-tissue Segmentation for 6-month Infant Brains","authors":"Yilan Dong (1 and 2), Vanessa Kyriakopoulou (1 and 2), Irina\n  Grigorescu (1), Grainne McAlonan (2), Dafnis Batalle (1 and 2), Maria Deprez\n  (1) ((1) School of Biomedical Engineering & Imaging Sciences, King's College\n  London, London, United Kingdom, (2) Department of Forensic and\n  Neurodevelopmental Science, Institute of Psychiatry, Psychology &\n  Neuroscience, King's College London, London, United Kingdom)","authorsParsed":[["Dong","Yilan","","1 and 2"],["Kyriakopoulou","Vanessa","","1 and 2"],["Grigorescu","Irina","","1 and 2"],["McAlonan","Grainne","","1 and 2"],["Batalle","Dafnis","","1 and 2"],["Deprez","Maria",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 16:58:23 GMT"}],"updateDate":"2024-08-28","timestamp":1724777903000,"abstract":"  Numerous studies have highlighted that atypical brain development,\nparticularly during infancy and toddlerhood, is linked to an increased\nlikelihood of being diagnosed with a neurodevelopmental condition, such as\nautism. Accurate brain tissue segmentations for morphological analysis are\nessential in numerous infant studies. However, due to ongoing white matter (WM)\nmyelination changing tissue contrast in T1- and T2-weighted images, automatic\ntissue segmentation in 6-month infants is particularly difficult. On the other\nhand, manual labelling by experts is time-consuming and labor-intensive. In\nthis study, we propose the first 8-tissue segmentation pipeline for\nsix-month-old infant brains. This pipeline utilizes domain adaptation (DA)\ntechniques to leverage our longitudinal data, including neonatal images\nsegmented with the neonatal Developing Human Connectome Project structural\npipeline. Our pipeline takes raw 6-month images as inputs and generates the\n8-tissue segmentation as outputs, forming an end-to-end segmentation pipeline.\nThe segmented tissues include WM, gray matter (GM), cerebrospinal fluid (CSF),\nventricles, cerebellum, basal ganglia, brainstem, and hippocampus/amygdala.\nCycle-Consistent Generative Adversarial Network (CycleGAN) and Attention U-Net\nwere employed to achieve the image contrast transformation between neonatal and\n6-month images and perform tissue segmentation on the synthesized 6-month\nimages (neonatal images with 6-month intensity contrast), respectively.\nMoreover, we incorporated the segmentation outputs from Infant Brain Extraction\nand Analysis Toolbox (iBEAT) and another Attention U-Net to further enhance the\nperformance and construct the end-to-end segmentation pipeline. Our evaluation\nwith real 6-month images achieved a DICE score of 0.92, an HD95 of 1.6, and an\nASSD of 0.42.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HZmhWmOfgSoe5pWUwCkHkgJ7ny-I34hhwinX2V02yTI","pdfSize":"609268"}
