{"id":"2408.08918","title":"Supervised and Unsupervised Alignments for Spoofing Behavioral\n  Biometrics","authors":"Thomas Thebaud, Ga\\\"el Le Lan, and Anthony Larcher","authorsParsed":[["Thebaud","Thomas",""],["Lan","Gaël Le",""],["Larcher","Anthony",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 20:46:59 GMT"}],"updateDate":"2024-08-20","timestamp":1723668419000,"abstract":"  Biometric recognition systems are security systems based on intrinsic\nproperties of their users, usually encoded in high dimension representations\ncalled embeddings, which potential theft would represent a greater threat than\na temporary password or a replaceable key. To study the threat of embedding\ntheft, we perform spoofing attacks on two behavioral biometric systems (an\nautomatic speaker verification system and a handwritten digit analysis system)\nusing a set of alignment techniques. Biometric recognition systems based on\nembeddings work in two phases: enrollment - where embeddings are collected and\nstored - then authentication - when new embeddings are compared to the stored\nones -.The threat of stolen enrollment embeddings has been explored by the\ntemplate reconstruction attack literature: reconstructing the original data to\nspoof an authentication system is doable with black-box access to their\nencoder. In this document, we explore the options available to perform template\nreconstruction attacks without any access to the encoder. To perform those\nattacks, we suppose general rules over the distribution of embeddings across\nencoders and use supervised and unsupervised algorithms to align an unlabeled\nset of embeddings with a set from a known encoder. The use of an alignment\nalgorithm from the unsupervised translation literature gives promising results\non spoofing two behavioral biometric systems.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}