{"id":"2408.05609","title":"Mitigating Metropolitan Carbon Emissions with Dynamic Eco-driving at\n  Scale","authors":"Vindula Jayawardana, Baptiste Freydt, Ao Qu, Cameron Hickert, Edgar\n  Sanchez, Catherine Tang, Mark Taylor, Blaine Leonard, Cathy Wu","authorsParsed":[["Jayawardana","Vindula",""],["Freydt","Baptiste",""],["Qu","Ao",""],["Hickert","Cameron",""],["Sanchez","Edgar",""],["Tang","Catherine",""],["Taylor","Mark",""],["Leonard","Blaine",""],["Wu","Cathy",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 18:23:59 GMT"}],"updateDate":"2024-08-13","timestamp":1723314239000,"abstract":"  The sheer scale and diversity of transportation make it a formidable sector\nto decarbonize. Here, we consider an emerging opportunity to reduce carbon\nemissions: the growing adoption of semi-autonomous vehicles, which can be\nprogrammed to mitigate stop-and-go traffic through intelligent speed commands\nand, thus, reduce emissions. But would such dynamic eco-driving move the needle\non climate change? A comprehensive impact analysis has been out of reach due to\nthe vast array of traffic scenarios and the complexity of vehicle emissions. We\naddress this challenge with large-scale scenario modeling efforts and by using\nmulti-task deep reinforcement learning with a carefully designed network\ndecomposition strategy. We perform an in-depth prospective impact assessment of\ndynamic eco-driving at 6,011 signalized intersections across three major US\nmetropolitan cities, simulating a million traffic scenarios. Overall, we find\nthat vehicle trajectories optimized for emissions can cut city-wide\nintersection carbon emissions by 11-22%, without harming throughput or safety,\nand with reasonable assumptions, equivalent to the national emissions of Israel\nand Nigeria, respectively. We find that 10% eco-driving adoption yields 25%-50%\nof the total reduction, and nearly 70% of the benefits come from 20% of\nintersections, suggesting near-term implementation pathways. However, the\ncomposition of this high-impact subset of intersections varies considerably\nacross different adoption levels, with minimal overlap, calling for careful\nstrategic planning for eco-driving deployments. Moreover, the impact of\neco-driving, when considered jointly with projections of vehicle\nelectrification and hybrid vehicle adoption remains significant. More broadly,\nthis work paves the way for large-scale analysis of traffic externalities, such\nas time, safety, and air quality, and the potential impact of solution\nstrategies.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Multiagent Systems","Computing Research Repository/Robotics","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}