{"id":"2408.01504","title":"Stellar bars form dark matter counterparts in TNG50","authors":"Neil Ash, Monica Valluri, Yingtian Chen, Eric F. Bell","authorsParsed":[["Ash","Neil",""],["Valluri","Monica",""],["Chen","Yingtian",""],["Bell","Eric F.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 18:04:07 GMT"}],"updateDate":"2024-08-06","timestamp":1722621847000,"abstract":"  Dark matter (DM) bars that shadow stellar bars have been previously shown to\nform in idealized simulations of isolated disk galaxies. Here, we show that DM\nbars commonly occur in barred disk galaxies in the TNG50 cosmological\nsimulation suite, but do not appear in unbarred disk galaxies. Consistent with\nisolated simulations, DM bars are typically shorter than their stellar\ncounterparts and are $75\\%$ weaker as measured by the Fourier $A_2$ moment. DM\nbars dominate the shape of the inner halo potential and are easily identified\nin the time series of quadrupolar coefficients. We present two novel methods\nfor measuring the bar pattern speed using these coefficients, and use them to\nmake a measurement of the pattern speed and rotation axis orientation for one\nsample galaxy located in one of the high-time resolution subboxes of TNG50. The\nstellar and dark bars in this galaxy remain co-aligned throughout the last 8\nGyr and have identical pattern speeds throughout. Both the pattern speed and\nrotation axis orientation of the bars evolve considerably over the last 8 Gyr,\nconsistent with torques on the bars due to dynamical friction and gas\naccretion. While the bar pattern speed generally decreases over the time\ncourse, it is seen to increase after mergers. Rather than remaining static in\ntime, the rotation axis displays both precession and nutation possibly caused\nby torques outside the plane of rotation. We find that the shape of the stellar\nand DM mass distributions are tightly correlated with the bar pattern speed.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}