{"id":"2408.14279","title":"Learning Local Pattern Modularization for Point Cloud Reconstruction\n  from Unseen Classes","authors":"Chao Chen, Yu-Shen Liu, Zhizhong Han","authorsParsed":[["Chen","Chao",""],["Liu","Yu-Shen",""],["Han","Zhizhong",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 13:55:42 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 15:33:15 GMT"}],"updateDate":"2024-09-05","timestamp":1724680542000,"abstract":"  It is challenging to reconstruct 3D point clouds in unseen classes from\nsingle 2D images. Instead of object-centered coordinate system, current methods\ngeneralized global priors learned in seen classes to reconstruct 3D shapes from\nunseen classes in viewer-centered coordinate system. However, the\nreconstruction accuracy and interpretability are still eager to get improved.\nTo resolve this issue, we introduce to learn local pattern modularization for\nreconstructing 3D shapes in unseen classes, which achieves both good\ngeneralization ability and high reconstruction accuracy. Our insight is to\nlearn a local prior which is class-agnostic and easy to generalize in\nobject-centered coordinate system. Specifically, the local prior is learned via\na process of learning and customizing local pattern modularization in seen\nclasses. During this process, we first learn a set of patterns in local\nregions, which is the basis in the object-centered coordinate system to\nrepresent an arbitrary region on shapes across different classes. Then, we\nmodularize each region on an initially reconstructed shape using the learned\nlocal patterns. Based on that, we customize the local pattern modularization\nusing the input image by refining the reconstruction with more details. Our\nmethod enables to reconstruct high fidelity point clouds from unseen classes in\nobject-centered coordinate system without requiring a large number of patterns\nor any additional information, such as segmentation supervision or camera\nposes. Our experimental results under widely used benchmarks show that our\nmethod achieves the state-of-the-art reconstruction accuracy for shapes from\nunseen classes. The code is available at https://github.com/chenchao15/Unseen.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dnuBn2JuPXbi97-E9Sv_VACmLEK0Pzq8S2i-QRwwFqo","pdfSize":"5430964"}
