{"id":"2408.13025","title":"Electronic interferometry with ultrashort plasmonic pulses","authors":"Seddik Ouacel, Lucas Mazzella, Thomas Kloss, Matteo Aluffi, Thomas\n  Vasselon, Hermann Edlbauer, Junliang Wang, Clement Geffroy, Jashwanth Shaju,\n  Michihisa Yamamoto, David Pomaranski, Shintaro Takada, Nobu-Hisa Kaneko,\n  Giorgos Georgiou, Xavier Waintal, Matias Urdampilleta, Arne Ludwig, Andreas\n  D. Wieck, Hermann Sellier, and Christopher B\\\"auerle","authorsParsed":[["Ouacel","Seddik",""],["Mazzella","Lucas",""],["Kloss","Thomas",""],["Aluffi","Matteo",""],["Vasselon","Thomas",""],["Edlbauer","Hermann",""],["Wang","Junliang",""],["Geffroy","Clement",""],["Shaju","Jashwanth",""],["Yamamoto","Michihisa",""],["Pomaranski","David",""],["Takada","Shintaro",""],["Kaneko","Nobu-Hisa",""],["Georgiou","Giorgos",""],["Waintal","Xavier",""],["Urdampilleta","Matias",""],["Ludwig","Arne",""],["Wieck","Andreas D.",""],["Sellier","Hermann",""],["Bäuerle","Christopher",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 12:29:02 GMT"}],"updateDate":"2024-08-26","timestamp":1724416142000,"abstract":"  Electronic flying qubits offer an interesting alternative to photonic qubits:\nelectrons propagate slower, hence easier to control in real time, and Coulomb\ninteraction enables direct entanglement between different qubits. While their\ncoherence time is limited, picosecond-scale control would make them competitive\nin terms of number of possible coherent operations. The key challenge lies in\nachieving the dynamical regime, where the injected plasmonic pulse width is\nshorter than the quantum device dimensions. Here we reach this new regime in a\nquantum nanoelectronic system by injecting ultrashort single electron plasmonic\npulses into a 14-micrometer-long Mach-Zehnder interferometer. Our findings\nreveal that quantum coherence is preserved for ultrashort plasmonic pulses,\nexhibiting enhanced contrast of coherent oscillations compared to the DC\nregime. Moreover, this coherence remains robust even under large bias voltages.\nThis milestone demonstrates the feasibility of flying qubits as a promising\nalternative to localized qubit architectures, offering reduced hardware\nfootprint, increased connectivity, and potential for scalable quantum\ninformation processing.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}