{"id":"2408.17449","title":"Performance Analysis of Pair-wise Symbol Detection in Uplink NOMA-ISaC\n  Systems","authors":"Haofeng Liu, Emad Alsusa and Arafat Al-Dweik","authorsParsed":[["Liu","Haofeng",""],["Alsusa","Emad",""],["Al-Dweik","Arafat",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 17:58:52 GMT"}],"updateDate":"2024-09-02","timestamp":1725040732000,"abstract":"  This paper investigates the bit error rate (BER) and outage probability\nperformance of integrated sensing and communication (ISaC) in uplink\nnon-orthogonal multiple access (NOMA) based Internet of Things (IoT) systems.\nSpecifically, we consider an ISaC system where the radar signal is designed to\nbe orthogonal to the communication signal over two symbol periods so that its\ninterference on the communication signal is completely eliminated when\ndetecting the data in pairs of consecutive symbols. This is akin to\nmulti-symbol rate NOMA systems except in this case as the radar bears no data,\nits waveform is manipulated to be orthogonal to the transmitted communication\nsignal. To eliminate potential decision ambiguity during the pair-wise data\ndetection, a constant phase-offset between adjacent communication symbols is\napplied at the transmitter. The performance of such a system is analyzed\nthrough deriving analytical expressions for the exact BER of zero-forcing (ZF)\nbased receivers. In addition, close-form expressions for the upper BER bound\nand the outage probability for both ZF and the joint maximum likelihood (JML)\nreceivers are presented. The results show that the derived expressions are\nperfectly matched with the simulation results. The obtained expressions provide\nan insight into the performance of this novel ISaC system including\ndemonstrating the impact of various parameters and showing how the ZF receiver\nprovides a useful trade-off between performance and complexity relative to the\nJML receiver.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}