{"id":"2408.05877","title":"Toward Pedestrian Head Tracking: A Benchmark Dataset and an Information\n  Fusion Network","authors":"Kailai Sun, Xinwei Wang, Shaobo Liu, Qianchuan Zhao, Gao Huang, Chang\n  Liu","authorsParsed":[["Sun","Kailai",""],["Wang","Xinwei",""],["Liu","Shaobo",""],["Zhao","Qianchuan",""],["Huang","Gao",""],["Liu","Chang",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 00:21:36 GMT"}],"updateDate":"2024-08-13","timestamp":1723422096000,"abstract":"  Pedestrian detection and tracking in crowded video sequences have a wide\nrange of applications, including autonomous driving, robot navigation and\npedestrian flow surveillance. However, detecting and tracking pedestrians in\nhigh-density crowds face many challenges, including intra-class occlusions,\ncomplex motions, and diverse poses. Although deep learning models have achieved\nremarkable progress in head detection, head tracking datasets and methods are\nextremely lacking. Existing head datasets have limited coverage of complex\npedestrian flows and scenes (e.g., pedestrian interactions, occlusions, and\nobject interference). It is of great importance to develop new head tracking\ndatasets and methods. To address these challenges, we present a Chinese\nLarge-scale Cross-scene Pedestrian Head Tracking dataset (Cchead) and a\nMulti-Source Information Fusion Network (MIFN). Our dataset has features that\nare of considerable interest, including 10 diverse scenes of 50,528 frames with\nover 2,366,249 heads and 2,358 tracks annotated. Our dataset contains diverse\nhuman moving speeds, directions, and complex crowd pedestrian flows with\ncollision avoidance behaviors. We provide a comprehensive analysis and\ncomparison with existing state-of-the-art (SOTA) algorithms. Moreover, our MIFN\nis the first end-to-end CNN-based head detection and tracking network that\njointly trains RGB frames, pixel-level motion information (optical flow and\nframe difference maps), depth maps, and density maps in videos. Compared with\nSOTA pedestrian detection and tracking methods, MIFN achieves superior\nperformance on our Cchead dataset. We believe our datasets and baseline will\nbecome valuable resources towards developing pedestrian tracking in dense\ncrowds.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}