{"id":"2408.02249","title":"Thermodynamic hierarchical equations of motion and their application to\n  Carnot engine","authors":"Shoki Koyanagi and Yoshitaka Tanimura","authorsParsed":[["Koyanagi","Shoki",""],["Tanimura","Yoshitaka",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 05:45:22 GMT"}],"updateDate":"2024-08-06","timestamp":1722836722000,"abstract":"  We developed a computer code for the thermodynamic hierarchical equations of\nmotion (T-HEOM) derived from a spin subsystem coupled to multiple Drude baths\nat different temperatures, which are connected to or disconnected from the\nsubsystem as a function of time. The code can simulate the reduced dynamics of\nthe subsystem under isothermal, isentropic, thermostatic, and entropic\nconditions. The thermodynamic extensive and intensive variables were calculated\nas physical observables, and the Gibbs and Helmholtz energies were evaluated as\nintensive and extensive work. The contribution of energies from the system-bath\ninteraction was evaluated separately from the subsystem using the hierarchical\nelements of T-HEOM. The accuracy of the calculated results for the equilibrium\ndistribution and two-body correlation functions of the subsystem was verified\nby comparison with the results obtained from the time-convolution-less Redfield\nequation. Non-Markovian effects in thermostatic processes were investigated by\nsequentially turning on and off the baths of different temperatures with\ndifferent switching times and system-bath coupling. As a demonstration, a\ncomparison was made by simulating the case where the temperature of one bath\nwas varied over time and the case where similar temperature changes were\nachieved by turning on and off the baths at different temperatures. In\naddition, the Carnot engine was simulated under quasi-static conditions. To\nanalyze the work done for the subsystem in the cycle, thermodynamic work\ndiagrams were plotted as functions of intensive and extensive variables. The\nC++ source codes are provided as supplementary material.\n","subjects":["Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9C0TEpl41J8zrpYCSkyD5N5XR8aKtjG0ORLHwYoHcAU","pdfSize":"2157255"}
