{"id":"2408.11210","title":"A Short Review and Evaluation of SAM2's Performance in 3D CT Image\n  Segmentation","authors":"Yufan He, Pengfei Guo, Yucheng Tang, Andriy Myronenko, Vishwesh Nath,\n  Ziyue Xu, Dong Yang, Can Zhao, Daguang Xu, Wenqi Li","authorsParsed":[["He","Yufan",""],["Guo","Pengfei",""],["Tang","Yucheng",""],["Myronenko","Andriy",""],["Nath","Vishwesh",""],["Xu","Ziyue",""],["Yang","Dong",""],["Zhao","Can",""],["Xu","Daguang",""],["Li","Wenqi",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 22:08:42 GMT"}],"updateDate":"2024-08-22","timestamp":1724191722000,"abstract":"  Since the release of Segment Anything 2 (SAM2), the medical imaging community\nhas been actively evaluating its performance for 3D medical image segmentation.\nHowever, different studies have employed varying evaluation pipelines,\nresulting in conflicting outcomes that obscure a clear understanding of SAM2's\ncapabilities and potential applications. We shortly review existing benchmarks\nand point out that the SAM2 paper clearly outlines a zero-shot evaluation\npipeline, which simulates user clicks iteratively for up to eight iterations.\nWe reproduced this interactive annotation simulation on 3D CT datasets and\nprovided the results and code~\\url{https://github.com/Project-MONAI/VISTA}. Our\nfindings reveal that directly applying SAM2 on 3D medical imaging in a\nzero-shot manner is far from satisfactory. It is prone to generating false\npositives when foreground objects disappear, and annotating more slices cannot\nfully offset this tendency. For smaller single-connected objects like kidney\nand aorta, SAM2 performs reasonably well but for most organs it is still far\nbehind state-of-the-art 3D annotation methods. More research and innovation are\nneeded for 3D medical imaging community to use SAM2 correctly.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"T3sNusrhO1Y7diBK7--eSdsEIjBOv5rXbAJPUbx0GUQ","pdfSize":"1532185"}
