{"id":"2408.13675","title":"How to guide a present-biased agent through prescribed tasks?","authors":"Tatiana Belova, Yuriy Dementiev, Fedor V. Fomin, Petr A. Golovach,\n  Artur Ignatiev","authorsParsed":[["Belova","Tatiana",""],["Dementiev","Yuriy",""],["Fomin","Fedor V.",""],["Golovach","Petr A.",""],["Ignatiev","Artur",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 21:26:42 GMT"}],"updateDate":"2024-08-27","timestamp":1724534802000,"abstract":"  The present bias is a well-documented behavioral trait that significantly\ninfluences human decision-making, with present-biased agents often prioritizing\nimmediate rewards over long-term benefits, leading to suboptimal outcomes in\nvarious real-world scenarios. Kleinberg and Oren (2014) proposed a popular\ngraph-theoretical model of inconsistent planning to capture the behavior of\npresent-biased agents. In this model, a multi-step project is represented by a\nweighted directed acyclic task graph, where the agent traverses the graph based\non present-biased preferences.\n  We use the model of Kleinberg and Oren to address the principal-agent\nproblem, where a principal, fully aware of the agent's present bias, aims to\nmodify an existing project by adding or deleting tasks. The challenge is to\ncreate a modified project that satisfies two somewhat contradictory conditions.\nOn one hand, the present-biased agent should select specific tasks deemed\nimportant by the principal. On the other hand, if the anticipated costs in the\nmodified project become too high for the agent, there is a risk of the agent\nabandoning the entire project, which is not in the principal's interest.\n  To tackle this issue, we leverage the tools of parameterized complexity to\ninvestigate whether the principal's strategy can be efficiently identified. We\nprovide algorithms and complexity bounds for this problem.\n","subjects":["Computing Research Repository/Computer Science and Game Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}