{"id":"2408.09841","title":"Demystifying Reinforcement Learning in Production Scheduling via\n  Explainable AI","authors":"Daniel Fischer, Hannah M. H\\\"usener, Felix Grumbach, Lukas\n  Vollenkemper, Arthur M\\\"uller, Pascal Reusch","authorsParsed":[["Fischer","Daniel",""],["Hüsener","Hannah M.",""],["Grumbach","Felix",""],["Vollenkemper","Lukas",""],["Müller","Arthur",""],["Reusch","Pascal",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 09:39:01 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 10:28:53 GMT"}],"updateDate":"2024-09-02","timestamp":1724060341000,"abstract":"  Deep Reinforcement Learning (DRL) is a frequently employed technique to solve\nscheduling problems. Although DRL agents ace at delivering viable results in\nshort computing times, their reasoning remains opaque. We conduct a case study\nwhere we systematically apply two explainable AI (xAI) frameworks, namely SHAP\n(DeepSHAP) and Captum (Input x Gradient), to describe the reasoning behind\nscheduling decisions of a specialized DRL agent in a flow production. We find\nthat methods in the xAI literature lack falsifiability and consistent\nterminology, do not adequately consider domain-knowledge, the target audience\nor real-world scenarios, and typically provide simple input-output explanations\nrather than causal interpretations. To resolve this issue, we introduce a\nhypotheses-based workflow. This approach enables us to inspect whether\nexplanations align with domain knowledge and match the reward hypotheses of the\nagent. We furthermore tackle the challenge of communicating these insights to\nthird parties by tailoring hypotheses to the target audience, which can serve\nas interpretations of the agent's behavior after verification. Our proposed\nworkflow emphasizes the repeated verification of explanations and may be\napplicable to various DRL-based scheduling use cases.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6DEBh0vV55KlCZrPamYS3CO3ke10xJcoWmfsalutl_w","pdfSize":"2366097"}
