{"id":"2408.16320","title":"Influence of surface pre-deformation on the Portevin-Le Chatelier effect\n  and the related multiscale complexity of plastic flow in an Al-Mg alloy","authors":"Hafsa Jaber, Beno\\^it Beausir, Denis Entemeyer, Tatiana Lebedkina,\n  Marc Novelli, Mikhail Lebyodkin","authorsParsed":[["Jaber","Hafsa",""],["Beausir","Benoît",""],["Entemeyer","Denis",""],["Lebedkina","Tatiana",""],["Novelli","Marc",""],["Lebyodkin","Mikhail",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 07:46:24 GMT"}],"updateDate":"2024-08-30","timestamp":1724917584000,"abstract":"  The influence of the surface pre-deformation on jerky flow caused by the\nPortevin-Le Chatelier (PLC) effect was investigated using flat tensile\nspecimens of an Al-Mg alloy. Although jerky flow represents a macroscopic\nplastic instability, the underlying mechanisms stem from self-organization of\ndislocations, which pertains to deformation processes at mesoscopic scales. To\nprovide a comprehensive approach, the investigation was carried out by coupling\ntensile tests, digital image correlation and acoustic emission techniques, each\ntargeting a particular range of scales. Thin superficial layers were\npre-deformed using surface mechanical attrition technique (SMAT). It was found\nthat the observed effects depend on which surfaces are processed. Overall, the\ntreated samples exhibited an enhanced yield strength without deterioration of\nductility in comparison with the initial material. These changes in the general\nmechanical behavior are likely to be correlated with the changes in jerky flow.\nUsing digital image correlation, a tendency to delocalization of bursts of\nplastic flow was found for both the PLC bands and smaller-scale strain\nheterogeneities outside the bands, the latter having been little studied so\nfar. Unexpectedly, SMAT occurred to modify plastic flow drastically at this\nscale. In addition to clarification of the role played by the surface in the\nPLC effect, these findings provide new insights into relationships between\ndeformation processes at distinct scales.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}