{"id":"2408.07567","title":"Experimental signatures of a new channel of the DD reaction at very-low\n  energy","authors":"R. Dubey, K. Czerski, Gokul Das H, A. Kowalska, N.Targosz-Sleczka, M.\n  Kaczmarski, and M. Valat","authorsParsed":[["Dubey","R.",""],["Czerski","K.",""],["H","Gokul Das",""],["Kowalska","A.",""],["Targosz-Sleczka","N.",""],["Kaczmarski","M.",""],["Valat","M.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 14:04:06 GMT"}],"updateDate":"2024-08-15","timestamp":1723644246000,"abstract":"  The discovery of a new, strong reaction channel of the deuteron-deuteron\nfusion at very low energies might have major consequences for the construction\nof a future clean and efficient energy source. Following the first theoretical\nand experimental indications for the existence of the deuteron-deuteron\nthreshold resonance in the $^4$He nucleus and its dominant decay by the\ninternal $e^+e^-$ pair creation, we present here an extensive experimental\nstudy confirming emission of high-energy electrons and positrons. A\nsimultaneous use of Si charged particle detectors of different thicknesses and\nlarge volume NaI(Tl) and HPGe detectors has allowed for the first time to\ndetermine the branching ratio between emitted protons, neutrons and $e^+e^-$\npairs for deuteron energies down to 5 keV. The high-energy positrons could be\nunambiguously detected by their bremsstrahlung spectra and annihilation\nradiation, supported by the Monte Carlo Geant4 simulations. The theoretical\ncalculations, based on a destructive interference between the threshold\nresonance and the known broad resonance in $^4$He, agree very well with\nexperimentally observed increase of branching ratios for lowering projectile\nenergies. The partial width of the threshold resonance for the $e^+e^-$ pair\ncreation should be at least 10 times larger than that of the proton channel.\n","subjects":["Physics/Nuclear Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XFcNFTNgHhysrcNLN3flvTV4K8G8ir8U9itVRgqsVAY","pdfSize":"977943"}
