{"id":"2408.06596","title":"GeoFormer: Learning Point Cloud Completion with Tri-Plane Integrated\n  Transformer","authors":"Jinpeng Yu, Binbin Huang, Yuxuan Zhang, Huaxia Li, Xu Tang, Shenghua\n  Gao","authorsParsed":[["Yu","Jinpeng",""],["Huang","Binbin",""],["Zhang","Yuxuan",""],["Li","Huaxia",""],["Tang","Xu",""],["Gao","Shenghua",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 03:15:36 GMT"}],"updateDate":"2024-08-14","timestamp":1723518936000,"abstract":"  Point cloud completion aims to recover accurate global geometry and preserve\nfine-grained local details from partial point clouds. Conventional methods\ntypically predict unseen points directly from 3D point cloud coordinates or use\nself-projected multi-view depth maps to ease this task. However, these\ngray-scale depth maps cannot reach multi-view consistency, consequently\nrestricting the performance. In this paper, we introduce a GeoFormer that\nsimultaneously enhances the global geometric structure of the points and\nimproves the local details. Specifically, we design a CCM Feature Enhanced\nPoint Generator to integrate image features from multi-view consistent\ncanonical coordinate maps (CCMs) and align them with pure point features,\nthereby enhancing the global geometry feature. Additionally, we employ the\nMulti-scale Geometry-aware Upsampler module to progressively enhance local\ndetails. This is achieved through cross attention between the multi-scale\nfeatures extracted from the partial input and the features derived from\npreviously estimated points. Extensive experiments on the PCN, ShapeNet-55/34,\nand KITTI benchmarks demonstrate that our GeoFormer outperforms recent methods,\nachieving the state-of-the-art performance. Our code is available at\n\\href{https://github.com/Jinpeng-Yu/GeoFormer}{https://github.com/Jinpeng-Yu/GeoFormer}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_4de54JHkYOh4r3i8s3EVVRRtAeqPvaV3aFHSLD7R30","pdfSize":"8633251"}
