{"id":"2408.14854","title":"Distance estimation of gamma-ray emitting BL Lac objects from imaging\n  observations","authors":"K. Nilsson, V. Fallah Ramazani, E. Lindfors, P. Goldoni, J. Becerra\n  Gonz\\'alez, J. A. Acosta Pulido, R. Clavero, J. Otero-Santos, T. Pursimo, S.\n  Pita, P. M. Kouch, C. Boisson, M. Backes, G. Cotter, F. D'Ammando, E. Kasai","authorsParsed":[["Nilsson","K.",""],["Ramazani","V. Fallah",""],["Lindfors","E.",""],["Goldoni","P.",""],["González","J. Becerra",""],["Pulido","J. A. Acosta",""],["Clavero","R.",""],["Otero-Santos","J.",""],["Pursimo","T.",""],["Pita","S.",""],["Kouch","P. M.",""],["Boisson","C.",""],["Backes","M.",""],["Cotter","G.",""],["D'Ammando","F.",""],["Kasai","E.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 08:14:21 GMT"}],"updateDate":"2024-08-28","timestamp":1724746461000,"abstract":"  Direct redshift determination of BL Lac objects is highly challenging as the\nemission in the optical and near-infrared (NIR) bands is largely dominated by\nthe non-thermal emission from the relativistic jet that points very close to\nour line of sight. Therefore, their optical spectra often show no emission\nlines from the host galaxy. In this work, we aim to overcome this difficulty by\nattempting to detect the host galaxy and derive redshift constraints based on\nassumptions on the galaxy magnitude (\"imaging redshifts\"). Imaging redshifts\nare derived by obtaining deep optical images under good seeing conditions, so\nthat it is possible to detect the host galaxy as weak extension of the\npoint-like source. We then derive the imaging redshift by using the host galaxy\nas a standard candle using two different methods. We determine imaging redshift\nfor 9 out of 17 blazars that we observed as part of this program. The redshift\nrange of these targets is 0.28-0.60 and the two methods used to derive the\nredshift give very consistent results within the uncertainties. We also\nperformed a detailed comparison of the imaging redshifts with those obtained by\nother methods, like direct spectroscopic constraints or looking for groups of\ngalaxies close to the blazar. We show that the constraints from different\nmethods are consistent and that for example in the case of J2156.0+1818, which\nis the most distant source for which we detect the host galaxy, combining the\nthree constraints narrows down the redshift to $0.63<z<0.71$. This makes the\nsource interesting for future studies of extragalactic background light in the\nCherenkov Telescope Array Observatory era.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}