{"id":"2408.08432","title":"Predictive uncertainty estimation in deep learning for lung carcinoma\n  classification in digital pathology under real dataset shifts","authors":"Abdur R. Fayjie and Jutika Borah and Florencia Carbone and Jan Tack\n  and Patrick Vandewalle","authorsParsed":[["Fayjie","Abdur R.",""],["Borah","Jutika",""],["Carbone","Florencia",""],["Tack","Jan",""],["Vandewalle","Patrick",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 21:49:43 GMT"}],"updateDate":"2024-08-19","timestamp":1723758583000,"abstract":"  Deep learning has shown tremendous progress in a wide range of digital\npathology and medical image classification tasks. Its integration into safe\nclinical decision-making support requires robust and reliable models. However,\nreal-world data comes with diversities that often lie outside the intended\nsource distribution. Moreover, when test samples are dramatically different,\nclinical decision-making is greatly affected. Quantifying predictive\nuncertainty in models is crucial for well-calibrated predictions and\ndetermining when (or not) to trust a model. Unfortunately, many works have\noverlooked the importance of predictive uncertainty estimation. This paper\nevaluates whether predictive uncertainty estimation adds robustness to deep\nlearning-based diagnostic decision-making systems. We investigate the effect of\nvarious carcinoma distribution shift scenarios on predictive performance and\ncalibration. We first systematically investigate three popular methods for\nimproving predictive uncertainty: Monte Carlo dropout, deep ensemble, and\nfew-shot learning on lung adenocarcinoma classification as a primary disease in\nwhole slide images. Secondly, we compare the effectiveness of the methods in\nterms of performance and calibration under clinically relevant distribution\nshifts such as in-distribution shifts comprising primary disease sub-types and\nother characterization analysis data; out-of-distribution shifts comprising\nwell-differentiated cases, different organ origin, and imaging modality shifts.\nWhile studies on uncertainty estimation exist, to our best knowledge, no\nrigorous large-scale benchmark compares predictive uncertainty estimation\nincluding these dataset shifts for lung carcinoma classification.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"sSq878fjCIOdI6wBFqpr0m4KqB1xvAeBlCe3-TZpweY","pdfSize":"48927699"}
