{"id":"2408.10515","title":"Ground State Magnetic Structure and Magnetic Field Effects in the\n  Layered Honeycomb Antiferromagnet YbOCl","authors":"Zheng Zhang, Yanzhen Cai, Jinlong Jiao, Jing Kang, Dehong Yu, Bertrand\n  Roessli, Anmin Zhang, Jianting Ji, Feng Jin, Jie Ma, Qingming Zhang","authorsParsed":[["Zhang","Zheng",""],["Cai","Yanzhen",""],["Jiao","Jinlong",""],["Kang","Jing",""],["Yu","Dehong",""],["Roessli","Bertrand",""],["Zhang","Anmin",""],["Ji","Jianting",""],["Jin","Feng",""],["Ma","Jie",""],["Zhang","Qingming",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 03:29:00 GMT"}],"updateDate":"2024-09-13","timestamp":1724124540000,"abstract":"  YbOCl is a representative member of the van der Waals layered honeycomb\nrare-earth chalcohalide REChX (RE = rare earth, Ch = O, S, Se, and Te, and X =\nF, Cl, Br, and I) family reported recently. Its spin ground state remains to be\nexplored experimentally. In this paper, we have grown high-quality single\ncrystals of YbOCl and conducted comprehensive thermodynamic, elastic, and\ninelastic neutron scattering experiments down to 50 mK. The experiments reveal\nan antiferromagnetic phase below 1.3 K, which is identified as a spin ground\nstate with an intralayer ferromagnetic and interlayer antiferromagnetic\nordering. By applying sophisticated numerical techniques to a honeycomb\n(nearest-neighbor)-triangle (next-nearest-neighbor) model Hamiltonian which\naccurately describes the highly anisotropic spin system, we are able to well\nsimulate the experiments and determine the diagonal and off-diagonal\nspin-exchange interactions. The simulations give an antiferromagnetic Kitaev\nterm comparable to the Heisenberg one. The experiments under magnetic fields\nallow us to establish a magnetic field-temperature phase diagram around the\nspin ground state. Most interestingly, a relatively small magnetic field (~ 0.3\nto 3 T) can significantly suppress the antiferromagnetic order, suggesting an\nintriguing interplay of the Kitaev interaction and magnetic fields in the spin\nsystem. The present study provides fundamental insights into the highly\nanisotropic spin systems and opens a new window to look into Kitaev spin\nphysics in a rare-earth-based system.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Jl3JJnkViIFyAxxlvb7PVTxaGhzwsJ_U-rloKvvFeZ8","pdfSize":"13443358"}
