{"id":"2408.05828","title":"Observability and Predictability in Quantum and Post-Quantum Physics","authors":"Johannes Fankhauser","authorsParsed":[["Fankhauser","Johannes",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 17:05:01 GMT"}],"updateDate":"2024-08-13","timestamp":1723395901000,"abstract":"  I introduce a framework to distinguish two domains of physics - the manifest\n(i.e. the directly observable empirical records in terms of manifest\nconfigurations) and the non-manifest domain of physics (i.e. the things that\nthe manifest configurations signify according to a physical theory). I show\nthat many quantum 'paradoxes' rest on ambiguous reasoning about the two\ndomains. More concretely, I study so-called 'surrealistic' trajectories, the\n'delayed choice quantum eraser', and 'weak measurements'. Finally, I show how\nthe alleged puzzles resolve in the framework provided. I then formally define\nand address the question of whether quantum uncertainty could be fundamental or\nwhether post-quantum theories could have predictive advantage whilst conforming\nto the Born rule on average. This notion of what I call 'empirical\ncompleteness' refers to actual prediction-making beyond the Born probabilities,\nand thus delineates the operational notion of predictability from a 'hidden\nvariable' programme in quantum theory. I study how empirical completeness\nconnects to signal-locality, and argue that a partial proof for the\nimpossibility of predictive advantage can be established for bi-partite quantum\nsystems. The relevant results demonstrate signal-locality as a sufficient\nprinciple that might explain the fundamental chanciness in present and future\nquantum theories and, in turn, reconciles us to many quantum features as\naspects of limits on Nature's predictability.\n","subjects":["Physics/Quantum Physics","Physics/History and Philosophy of Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5yL1i9rRz4IaFXJr209eCE1AldhzZH2w7jc8T1faeWQ","pdfSize":"6145744"}
