{"id":"2408.07562","title":"Multilayer Network of Cardiovascular Diseases and Depression via\n  Multipartite Projection","authors":"Jie Li, Cillian Hourican, Pashupati P. Mishra, Binisha H. Mishra, Mika\n  K\\\"ah\\\"onen, Olli T. Raitakari, Reijo Laaksonen, Mika Ala-Korpela, Liisa\n  Keltikangas-J\\\"arvinen, Markus Juonala, Terho Lehtim\\\"aki, Jos A. Bosch, Rick\n  Quax","authorsParsed":[["Li","Jie",""],["Hourican","Cillian",""],["Mishra","Pashupati P.",""],["Mishra","Binisha H.",""],["Kähönen","Mika",""],["Raitakari","Olli T.",""],["Laaksonen","Reijo",""],["Ala-Korpela","Mika",""],["Keltikangas-Järvinen","Liisa",""],["Juonala","Markus",""],["Lehtimäki","Terho",""],["Bosch","Jos A.",""],["Quax","Rick",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 13:58:56 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 09:55:31 GMT"}],"updateDate":"2024-08-27","timestamp":1723643936000,"abstract":"  Cardiovascular diseases (CVD) and depression exhibit significant comorbidity,\nwhich is highly predictive of poor clinical outcomes. Yet, the underlying\nbiological pathways remain challenging to decipher, presumably due to the\nnon-linear associations across multiple mechanisms. In this study, we\nintroduced a multipartite projection method based on mutual information\ncorrelations to construct multilayer disease networks as a novel approach to\nexplore such intricate relationships. We applied this method to a\ncross-sectional dataset from a wave of the Young Finns Study, which includes\ndata on CVD and depression, along with related risk factors and two omics of\nbiomarkers: metabolites and lipids. Rather than directly correlating\nCVD-related phenotypes and depressive symptoms, we extended the notion of\nbipartite networks to create a multipartite network, linking these phenotypes\nand symptoms to intermediate biological variables. Projecting from these\nintermediate variables results in a weighted multilayer network, where each\nlink between CVD and depression variables is marked by its layer (i.e.,\nmetabolome or lipidome). Applying this projection method, we identified\npotential mediating biomarkers that connect CVD with depression. These\nbiomarkers may therefore play significant roles in the biological pathways\nunderlying CVD-depression comorbidity. Additionally, the network projection\nhighlighted sex and BMI as key risk factors, or confounders, in this\ncomorbidity. Our method is scalable to incorporate any number of omics layers\nand various disease phenotypes, offering a comprehensive, system-level\nperspective on the biological pathways contributing to comorbidity.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}