{"id":"2408.16208","title":"ReXamine-Global: A Framework for Uncovering Inconsistencies in Radiology\n  Report Generation Metrics","authors":"Oishi Banerjee, Agustina Saenz, Kay Wu, Warren Clements, Adil Zia,\n  Dominic Buensalido, Helen Kavnoudias, Alain S. Abi-Ghanem, Nour El Ghawi,\n  Cibele Luna, Patricia Castillo, Khaled Al-Surimi, Rayyan A. Daghistani,\n  Yuh-Min Chen, Heng-sheng Chao, Lars Heiliger, Moon Kim, Johannes Haubold,\n  Frederic Jonske, Pranav Rajpurkar","authorsParsed":[["Banerjee","Oishi",""],["Saenz","Agustina",""],["Wu","Kay",""],["Clements","Warren",""],["Zia","Adil",""],["Buensalido","Dominic",""],["Kavnoudias","Helen",""],["Abi-Ghanem","Alain S.",""],["Ghawi","Nour El",""],["Luna","Cibele",""],["Castillo","Patricia",""],["Al-Surimi","Khaled",""],["Daghistani","Rayyan A.",""],["Chen","Yuh-Min",""],["Chao","Heng-sheng",""],["Heiliger","Lars",""],["Kim","Moon",""],["Haubold","Johannes",""],["Jonske","Frederic",""],["Rajpurkar","Pranav",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 02:03:05 GMT"}],"updateDate":"2024-08-30","timestamp":1724896985000,"abstract":"  Given the rapidly expanding capabilities of generative AI models for\nradiology, there is a need for robust metrics that can accurately measure the\nquality of AI-generated radiology reports across diverse hospitals. We develop\nReXamine-Global, a LLM-powered, multi-site framework that tests metrics across\ndifferent writing styles and patient populations, exposing gaps in their\ngeneralization. First, our method tests whether a metric is undesirably\nsensitive to reporting style, providing different scores depending on whether\nAI-generated reports are stylistically similar to ground-truth reports or not.\nSecond, our method measures whether a metric reliably agrees with experts, or\nwhether metric and expert scores of AI-generated report quality diverge for\nsome sites. Using 240 reports from 6 hospitals around the world, we apply\nReXamine-Global to 7 established report evaluation metrics and uncover serious\ngaps in their generalizability. Developers can apply ReXamine-Global when\ndesigning new report evaluation metrics, ensuring their robustness across\nsites. Additionally, our analysis of existing metrics can guide users of those\nmetrics towards evaluation procedures that work reliably at their sites of\ninterest.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}