{"id":"2408.16408","title":"High-yield large-scale suspended graphene membranes over closed cavities\n  for sensor applications","authors":"Sebastian Lukas, Ardeshir Esteki, Nico Rademacher, Vikas Jangra,\n  Michael Gross, Zhenxing Wang, Ha Duong Ngo, Manuel B\\\"auscher, Piotr\n  Mackowiak, Katrin H\\\"oppner, Dominique Wehenkel, Richard van Rijn, Max C.\n  Lemme","authorsParsed":[["Lukas","Sebastian",""],["Esteki","Ardeshir",""],["Rademacher","Nico",""],["Jangra","Vikas",""],["Gross","Michael",""],["Wang","Zhenxing",""],["Ngo","Ha Duong",""],["Bäuscher","Manuel",""],["Mackowiak","Piotr",""],["Höppner","Katrin",""],["Wehenkel","Dominique",""],["van Rijn","Richard",""],["Lemme","Max C.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 10:12:33 GMT"}],"updateDate":"2024-08-30","timestamp":1724926353000,"abstract":"  Suspended membranes of monoatomic graphene exhibit great potential for\napplications in electronic and nanoelectromechanical devices. In this work, a\n\"hot and dry\" transfer process is demonstrated to address the fabrication and\npatterning challenges of large-area graphene membranes on top of closed, sealed\ncavities. Here, \"hot\" refers to the use of high temperature during transfer,\npromoting the adhesion. Additionally, \"dry\" refers to the absence of liquids\nwhen graphene and target substrate are brought into contact. The method leads\nto higher yields of intact suspended monolayer CVD graphene and artificially\nstacked double-layer CVD graphene membranes than previously reported. The yield\nevaluation is performed using neural-network-based object detection in SEM\nimages, ascertaining high yields of intact membranes with large statistical\naccuracy. The suspended membranes are examined by Raman tomography and AFM. The\nmethod is verified by applying the suspended graphene devices as piezoresistive\npressure sensors. Our technology advances the application of suspended graphene\nmembranes and can be extended to other two-dimensional (2D) materials.\n","subjects":["Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}