{"id":"2408.15373","title":"Handling Geometric Domain Shifts in Semantic Segmentation of Surgical\n  RGB and Hyperspectral Images","authors":"Silvia Seidlitz, Jan Sellner, Alexander Studier-Fischer, Alessandro\n  Motta, Berkin \\\"Ozdemir, Beat P. M\\\"uller-Stich, Felix Nickel, Lena\n  Maier-Hein","authorsParsed":[["Seidlitz","Silvia",""],["Sellner","Jan",""],["Studier-Fischer","Alexander",""],["Motta","Alessandro",""],["Özdemir","Berkin",""],["Müller-Stich","Beat P.",""],["Nickel","Felix",""],["Maier-Hein","Lena",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 19:13:15 GMT"}],"updateDate":"2024-08-29","timestamp":1724785995000,"abstract":"  Robust semantic segmentation of intraoperative image data holds promise for\nenabling automatic surgical scene understanding and autonomous robotic surgery.\nWhile model development and validation are primarily conducted on idealistic\nscenes, geometric domain shifts, such as occlusions of the situs, are common in\nreal-world open surgeries. To close this gap, we (1) present the first analysis\nof state-of-the-art (SOA) semantic segmentation models when faced with\ngeometric out-of-distribution (OOD) data, and (2) propose an augmentation\ntechnique called \"Organ Transplantation\", to enhance generalizability. Our\ncomprehensive validation on six different OOD datasets, comprising 600 RGB and\nhyperspectral imaging (HSI) cubes from 33 pigs, each annotated with 19 classes,\nreveals a large performance drop in SOA organ segmentation models on geometric\nOOD data. This performance decline is observed not only in conventional RGB\ndata (with a dice similarity coefficient (DSC) drop of 46 %) but also in HSI\ndata (with a DSC drop of 45 %), despite the richer spectral information\ncontent. The performance decline increases with the spatial granularity of the\ninput data. Our augmentation technique improves SOA model performance by up to\n67 % for RGB data and 90 % for HSI data, achieving performance at the level of\nin-distribution performance on real OOD test data. Given the simplicity and\neffectiveness of our augmentation method, it is a valuable tool for addressing\ngeometric domain shifts in surgical scene segmentation, regardless of the\nunderlying model. Our code and pre-trained models are publicly available at\nhttps://github.com/IMSY-DKFZ/htc.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UuTbgRf-FxNLSRDJYh_LWj8T2bjVutsSpmrFbJzngFI","pdfSize":"38165797"}
