{"id":"2408.13562","title":"Plug-and-Play Drag Sail Module for LEO Satellites: Implementation and\n  Early Testing of AirDragMod (ADM)","authors":"Anshuman Shukla, Pranav Sawant","authorsParsed":[["Shukla","Anshuman",""],["Sawant","Pranav",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 12:18:40 GMT"}],"updateDate":"2024-08-27","timestamp":1724501920000,"abstract":"  Space debris has become a critical issue, with debris in orbit surpassing\nactive satellites, posing significant risks to space sustainability. Payloads\nor rocket bodies discarded post-mission in LEO without orbital control are\nmajor sources. The IADC guidelines recommend limiting post-mission presence in\nprotected regions to 25 years. The FCC recently introduced stricter\nregulations, reducing the allowable post-mission stay for LEO satellites to 5\nyears. These changes necessitate integrating deorbiting systems into satellite\ndesigns. However, adding extra fuel and engines for active deorbiting presents\nchallenges due to LEO satellites' mass and volume limitations, especially for\nlarge constellations or CubeSats. This often leads to prioritizing\nmission-critical components over deorbiting systems. Thus, alternative\napproaches like passive deorbiting techniques or international regulations are\nexplored. Drag sails are a cost-effective passive solution for small and\nmedium-sized LEO satellites. This paper proposes a plug-and-play drag sail\nmodule using COTS components for CubeSats and sub-mass satellites. The scalable\ndesign is derived from mission requirements and trajectory analysis. The\ntechnique includes active control for quicker deorbiting at specific orbital\nLTAN. Inspired by JAXA's IKAROS mission, the deployment mechanism uses residual\nangular momentum and follows a standard sequence. A cost analysis estimates the\nsystem's breakeven point. A prototype with a 3D-printed deployment system and\ninverted stepper motor was tested and compared to a numerical model. A tension\nmodel for sail extension petals was developed using curve fitting from test\ndata. SIMULINK multibody models are available for simulations. Further\nexperimentation and prototype development are required to assess real-world\nperformance, with a control system identified as crucial.\n","subjects":["Physics/Space Physics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"wvTvGteuFrQnRSHbEuRHepKIxXbI4KSfMWFZCL37lOg","pdfSize":"1290524"}
