{"id":"2408.04576","title":"Time-cost-error trade-off relation in thermodynamics: The third law and\n  beyond","authors":"Tan Van Vu and Keiji Saito","authorsParsed":[["Van Vu","Tan",""],["Saito","Keiji",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 16:36:49 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 14:16:15 GMT"}],"updateDate":"2024-09-06","timestamp":1723135009000,"abstract":"  Elucidating fundamental limitations inherent in physical systems is a central\nsubject in physics. For important thermodynamic operations such as information\nerasure, cooling, and copying, resources like time and energetic cost must be\nexpended to achieve the desired outcome within a predetermined error margin. In\nthis study, we introduce the concept of separated states, which consist of\nfully unoccupied and occupied states. This concept generalizes many critical\nstates involved in relevant thermodynamic operations. We then uncover a\nthree-way trade-off relation between time, cost, and error for a general class\nof thermodynamic operations aimed at creating separated states, simply\nexpressed as $\\tau\\mathcal{C}\\varepsilon_{\\tau}\\ge 1-\\eta$. This fundamental\nrelation is applicable to diverse thermodynamic operations, including\ninformation erasure, cooling, and copying. It provides a profound\nquantification of the unattainability principle in the third law of\nthermodynamics in a general form. Building upon this relation, we explore the\nquantitative limitations governing cooling operations, the preparation of\nseparated states, and a no-go theorem for exact classical copying. Furthermore,\nwe extend these findings to the quantum regime, encompassing both Markovian and\nnon-Markovian dynamics. Specifically, within Lindblad dynamics, we derive a\nsimilar three-way trade-off relation that quantifies the cost of achieving a\npure state with a given error. The generalization to general quantum dynamics\ninvolving a system coupled to a finite bath implies that heat dissipation\nbecomes infinite as the quantum system is exactly cooled down to the ground\nstate or perfectly reset to a pure state, thereby resolving an open question\nregarding the thermodynamic cost of information erasure.\n","subjects":["Condensed Matter/Statistical Mechanics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pFGoqFx682Yy1UsHT0UKzvMH5UIuUStsXHprTVwTfSg","pdfSize":"5060842"}
