{"id":"2408.06848","title":"Improving WiFi CSI Fingerprinting with IQ Samples","authors":"Junjie Wang (1), Yong Huang (1), Feiyang Zhao (1), Wenjing Wang (1),\n  Dalong Zhang (1), Wei Wang (2) ((1) Zhengzhou University, Zhengzhou, China,\n  (2) Huazhong University of Science and Technology, Wuhan, China)","authorsParsed":[["Wang","Junjie",""],["Huang","Yong",""],["Zhao","Feiyang",""],["Wang","Wenjing",""],["Zhang","Dalong",""],["Wang","Wei",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 12:21:14 GMT"}],"updateDate":"2024-08-14","timestamp":1723551674000,"abstract":"  Identity authentication is crucial for ensuring the information security of\nwireless communication. Radio frequency (RF) fingerprinting techniques provide\na prom-ising supplement to cryptography-based authentication approaches but\nrely on dedicated equipment to capture in-phase and quadrature (IQ) samples,\nhindering their wide adoption. Recent advances advocate easily obtainable\nchannel state in-formation (CSI) by commercial WiFi devices for lightweight RF\nfingerprinting, but they mainly focus on eliminating channel interference and\ncannot address the challenges of coarse granularity and information loss of CSI\nmeasurements. To overcome these challenges, we propose CSI2Q, a novel CSI\nfingerprinting sys-tem that achieves comparable performance to IQ-based\napproaches. Instead of ex-tracting fingerprints directly from raw CSI\nmeasurements, CSI2Q first transforms them into time-domain signals that share\nthe same feature space with IQ samples. Then, the distinct advantages of an IQ\nfingerprinting model in feature extraction are transferred to its CSI\ncounterpart via an auxiliary training strategy. Finally, the trained CSI\nfingerprinting model is used to decide which device the sample under test comes\nfrom. We evaluate CSI2Q on both synthetic and real CSI datasets. On the\nsynthetic dataset, our system can improve the recognition accuracy from 76% to\n91%. On the real dataset, CSI2Q boosts the accuracy from 67% to 82%.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}