{"id":"2408.01085","title":"Effect of Fog Particle Size Distribution on 3D Object Detection Under\n  Adverse Weather Conditions","authors":"Ajinkya Shinde, Gaurav Sharma, Manisha Pattanaik, and Sri Niwas Singh","authorsParsed":[["Shinde","Ajinkya",""],["Sharma","Gaurav",""],["Pattanaik","Manisha",""],["Singh","Sri Niwas",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 08:06:12 GMT"}],"updateDate":"2024-08-05","timestamp":1722585972000,"abstract":"  LiDAR-based sensors employing optical spectrum signals play a vital role in\nproviding significant information about the target objects in autonomous\ndriving vehicle systems. However, the presence of fog in the atmosphere\nseverely degrades the overall system's performance. This manuscript analyzes\nthe role of fog particle size distributions in 3D object detection under\nadverse weather conditions. We utilise Mie theory and meteorological optical\nrange (MOR) to calculate the attenuation and backscattering coefficient values\nfor point cloud generation and analyze the overall system's accuracy in Car,\nCyclist, and Pedestrian case scenarios under easy, medium and hard detection\ndifficulties. Gamma and Junge (Power-Law) distributions are employed to\nmathematically model the fog particle size distribution under strong and\nmoderate advection fog environments. Subsequently, we modified the KITTI\ndataset based on the backscattering coefficient values and trained it on the\nPV-RCNN++ deep neural network model for Car, Cyclist, and Pedestrian cases\nunder different detection difficulties. The result analysis shows a significant\nvariation in the system's accuracy concerning the changes in target object\ndimensionality, the nature of the fog environment and increasing detection\ndifficulties, with the Car exhibiting the highest accuracy of around 99% and\nthe Pedestrian showing the lowest accuracy of around 73%.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}