{"id":"2408.12560","title":"Data Quality Antipatterns for Software Analytics","authors":"Aaditya Bhatia, Dayi Lin, Gopi Krishnan Rajbahadur, Bram Adams, and\n  Ahmed E. Hassan","authorsParsed":[["Bhatia","Aaditya",""],["Lin","Dayi",""],["Rajbahadur","Gopi Krishnan",""],["Adams","Bram",""],["Hassan","Ahmed E.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 17:21:09 GMT"}],"updateDate":"2024-08-23","timestamp":1724347269000,"abstract":"  Background: Data quality is vital in software analytics, particularly for\nmachine learning (ML) applications like software defect prediction (SDP).\nDespite the widespread use of ML in software engineering, the effect of data\nquality antipatterns on these models remains underexplored.\n  Objective: This study develops a taxonomy of ML-specific data quality\nantipatterns and assesses their impact on software analytics models'\nperformance and interpretation.\n  Methods: We identified eight types and 14 sub-types of ML-specific data\nquality antipatterns through a literature review. We conducted experiments to\ndetermine the prevalence of these antipatterns in SDP data (RQ1), assess how\ncleaning order affects model performance (RQ2), evaluate the impact of\nantipattern removal on performance (RQ3), and examine the consistency of\ninterpretation from models built with different antipatterns (RQ4).\n  Results: In our SDP case study, we identified nine antipatterns. Over 90% of\nthese overlapped at both row and column levels, complicating cleaning\nprioritization and risking excessive data removal. The order of cleaning\nsignificantly impacts ML model performance, with neural networks being more\nresilient to cleaning order changes than simpler models like logistic\nregression. Antipatterns such as Tailed Distributions and Class Overlap show a\nstatistically significant correlation with performance metrics when other\nantipatterns are cleaned. Models built with different antipatterns showed\nmoderate consistency in interpretation results.\n  Conclusion: The cleaning order of different antipatterns impacts ML model\nperformance. Five antipatterns have a statistically significant correlation\nwith model performance when others are cleaned. Additionally, model\ninterpretation is moderately affected by different data quality antipatterns.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}