{"id":"2408.10094","title":"Shape inference in three-dimensional steady state supersonic flows using\n  ODIL and JAX-Fluids","authors":"Aaron B. Buhendwa, Deniz A. Bezgin, Petr Karnakov, Nikolaus A. Adams,\n  Petros Koumoutsakos","authorsParsed":[["Buhendwa","Aaron B.",""],["Bezgin","Deniz A.",""],["Karnakov","Petr",""],["Adams","Nikolaus A.",""],["Koumoutsakos","Petros",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 15:32:59 GMT"}],"updateDate":"2024-08-20","timestamp":1724081579000,"abstract":"  We propose a novel method for inferring the shape of a solid obstacle and its\nflow field in three-dimensional, steady state supersonic flows. The method\ncombines the optimization of a discrete loss (ODIL) technique with the\nautomatically differentiable JAX-Fluids computational fluid dynamics (CFD)\nsolver to study joint reconstruction of flow field and obstacle shape. ODIL\nminimizes the discrete residual of the governing partial differential equation\n(PDE) by gradient-descent-based algorithms. The ODIL framework inherits the\ncharacteristics of the chosen numerical discretizations of the underlying PDE,\nincluding their consistency and stability. The discrete residuals and their\nautomatic differentiation gradients are computed by the JAX-Fluids solver which\nprovides nonlinear shock-capturing schemes and level-set based immersed solid\nboundaries. We test the approach on challenging inverse problems, including the\nshape inference of a solid obstacle in three-dimensional steady state\nsupersonic flow. We show that the nonlinear shock-capturing discretization in\ncombination with the level-set based interface representation allows for\naccurate inference of the obstacle shape and its flow field. The proposed\napproach opens new avenues for solving complex inverse problems in supersonic\naerodynamics.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"JqcTgFYyKemJF0UUjV9__8JOeIRi1OM5Ta2ccsRpiWA","pdfSize":"4529318"}
