{"id":"2408.05343","title":"Superuniversal Statistics of Complex Time-Delays in Non-Hermitian\n  Scattering Systems","authors":"Nadav Shaibe, Jared M. Erb, and Steven M. Anlage","authorsParsed":[["Shaibe","Nadav",""],["Erb","Jared M.",""],["Anlage","Steven M.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 15:20:07 GMT"}],"updateDate":"2024-08-13","timestamp":1722007207000,"abstract":"  The Wigner-Smith time-delay of flux conserving systems is a real quantity\nthat measures how long an excitation resides in an interaction region. The\ncomplex generalization of time-delay to non-Hermitian systems is still under\ndevelopment, in particular, its statistical properties in the short-wavelength\nlimit of complex chaotic scattering systems has not been investigated. From the\nexperimentally measured multi-port scattering ($S$)-matrices of one-dimensional\ngraphs, a two-dimensional billiard, and a three-dimensional cavity, we\ncalculate the complex Wigner-Smith ($\\tau_{WS}$), as well as each individual\nreflection ($\\tau_{xx}$) and transmission ($\\tau_{xy}$) time-delays. The\ncomplex reflection time-delay differences ($\\tau_{\\delta R}$) between each port\nare calculated, and the transmission time-delay differences ($\\tau_{\\delta T}$)\nare introduced for systems exhibiting non-reciprocal scattering. Large\ntime-delays are associated with coherent perfect absorption, reflectionless\nscattering, slow light, and uni-directional invisibility. We demonstrate that\nthe large-delay tails of the distributions of the real and imaginary parts of\neach of these time-delay quantities are superuniversal, independent of\nexperimental parameters: uniform attenuation $\\eta$, number of scattering\nchannels $M$, wave propagation dimension $\\mathcal{D}$, and Dyson symmetry\nclass $\\beta$. This superuniversality is in direct contrast with the\nwell-established time-delay statistics of unitary scattering systems, where the\ntail of the $\\tau_{WS}$ distribution depends explicitly on the values of $M$\nand $\\beta$. Due to the direct analogy of the wave equations, the time-delay\nstatistics described in this paper are applicable to any non-Hermitian\nwave-chaotic scattering system in the short-wavelength limit, such as quantum\ngraphs, electromagnetic, optical and acoustic resonators, etc.\n","subjects":["Nonlinear Sciences/Chaotic Dynamics","Physics/Data Analysis, Statistics and Probability","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nNYLt2ooVH_zObmhElv_NJa-ii93W_9IRB9xKoFH1Z8","pdfSize":"4755856"}
