{"id":"2408.07640","title":"Insight into the occurrence of particle acceleration through the\n  investigation of Wolf-Rayet stars using uGMRT observations","authors":"A. B. Blanco, M. De Becker, A. Saha, A. Tej, and P. Benaglia","authorsParsed":[["Blanco","A. B.",""],["De Becker","M.",""],["Saha","A.",""],["Tej","A.",""],["Benaglia","P.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 16:07:29 GMT"}],"updateDate":"2024-08-15","timestamp":1723651649000,"abstract":"  Massive stars produce strong stellar winds that consist of continuous\noutflows of material at speeds of thousands of km/s. These winds convey large\namounts of kinetic power, especially in the case of Wolf-Rayet (WR) stars. When\nthese winds interact with nearby material, they will likely produce shocks.\nAmong other processes, particle acceleration is expected to occur. This is\nparticularly well established in the case of massive binary systems, where the\nstellar winds collide, allowing these systems to be identified thanks to the\ndetection of synchrotron radio emission, produced by a population of\nrelativistic particles accelerated in the shocks. Our goal is to investigate\nthe occurrence of particle acceleration among massive stars in their\npre-supernova evolution phases. To this end, we observed a subset of five WR\nstars in the radio domain using the upgraded Giant Metrewave Radio Telescope\n(uGMRT), located in India. The observations were carried out in bands 4\n(550-950 MHz) and 5 (1050-1450 MHz) for all the targets. We detected radio\nemission for only WR 110 in bands 4 and 5. Its thermal spectrum displays a\nconsistent index of +0.74 down to uGMRT bands. The four other targets were not\ndetected and we derived 3$\\sigma$ upper limits. Our upper limits in Band 4 are\nthe first provided for these targets below 1 GHz. None of the targets was\nidentified as a synchrotron radio emitter in these radio bands. If some\nsynchrotron emission is produced in these systems, the non-detection with uGMRT\ncan be most likely attributed to strong free-free absorption (FFA). This is\nespecially relevant for WR 98a, which is catalogued as a particle accelerator\nbased on previous measurements at higher radio frequencies. We discuss how the\nprominence of FFA constitutes a severe obstacle to identifying particle\naccelerators in the radio domain.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}