{"id":"2408.08485","title":"Generalized code index modulation-aided frequency offset realign\n  multiple-antenna spatial modulation approach for next-generation green\n  communication systems","authors":"Bang Huang and Jiajie Xu and Mohamed-Slim Alouini","authorsParsed":[["Huang","Bang",""],["Xu","Jiajie",""],["Alouini","Mohamed-Slim",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 02:15:03 GMT"}],"updateDate":"2024-08-19","timestamp":1723774503000,"abstract":"  For next-generation green communication systems, this article proposes an\ninnovative communication system based on frequency-diverse array-multiple-input\nmultiple-output (FDA-MIMO) technology, which aims to achieve high data rates\nwhile maintaining low power consumption. This system utilizes frequency offset\nindex realign modulation, multiple-antenna spatial index modulation, and\nspreading code index modulation techniques. In the proposed generalized code\nindex modulation-aided frequency offset realign multiple-antenna spatial\nmodulation (GCIM-FORMASM) system, the coming bits are divided into five parts:\nspatial modulation bits by activating multiple transmit antennas, frequency\noffset index bits of the FDA antennas, including frequency offset combination\nbits and frequency offset realign bits, spreading code index modulation bits,\nand modulated symbol bits. Subsequently, this paper utilizes the orthogonal\nwaveforms transmitted by the FDA to design the corresponding transmitter and\nreceiver structures and provide specific expressions for the received signals.\nMeanwhile, to reduce the decoding complexity of the maximum likelihood (ML)\nalgorithm, we propose a three-stage despreading-based low complexity (DBLC)\nalgorithm leveraging the orthogonality of the spreading codes. Additionally, a\nclosed-form expression for the upper bound of the average bit error probability\n(ABEP) of the DBLC algorithm has been derived. Analyzing metrics such as energy\nefficiency and data rate shows that the proposed system features low power\nconsumption and high data transmission rates, which aligns better with the\nconcept of future green communications. The effectiveness of our proposed\nmethods has been validated through comprehensive numerical results.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}