{"id":"2408.03109","title":"Exceptional point and hysteresis trajectories in cold Rydberg atomic\n  gases","authors":"Jun Zhang, En-Ze Li, Ya-Jun Wang, Bang Liu, Li-Hua Zhang, Zheng-Yuan\n  Zhang, Shi-Yao Shao, Qing Li, Han-Chao Chen, Yu Ma, Tian-Yu Han, Qi-Feng\n  Wang, Jia-Dou Nan, Yi-Ming Ying, Dong-Yang Zhu, Bao-Sen Shi, Dong-Sheng Ding","authorsParsed":[["Zhang","Jun",""],["Li","En-Ze",""],["Wang","Ya-Jun",""],["Liu","Bang",""],["Zhang","Li-Hua",""],["Zhang","Zheng-Yuan",""],["Shao","Shi-Yao",""],["Li","Qing",""],["Chen","Han-Chao",""],["Ma","Yu",""],["Han","Tian-Yu",""],["Wang","Qi-Feng",""],["Nan","Jia-Dou",""],["Ying","Yi-Ming",""],["Zhu","Dong-Yang",""],["Shi","Bao-Sen",""],["Ding","Dong-Sheng",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 11:35:06 GMT"}],"updateDate":"2024-08-07","timestamp":1722944106000,"abstract":"  The interplay between strong long-range interactions and the coherent driving\ncontribute to the formation of complex patterns, symmetry, and novel phases of\nmatter in many-body systems. However, long-range interactions may induce an\nadditional dissipation channel, resulting in non-Hermitian many-body dynamics\nand the emergence of exceptional points in spectrum. Here, we report\nexperimental observation of interaction-induced exceptional points in cold\nRydberg atomic gases, revealing the breaking of charge-conjugation parity\nsymmetry. By measuring the transmission spectrum under increasing and\ndecreasing probe intensity, the interaction-induced hysteresis trajectories are\nobserved, which give rise to non-Hermitian dynamics. We record the area\nenclosed by hysteresis loops and investigate the dynamics of hysteresis loops.\nThe reported exceptional points and hysteresis trajectories in cold Rydberg\natomic gases provide valuable insights into the underlying non-Hermitian\nphysics in many-body systems, allowing us to study the interplay between\nlong-range interactions and non-Hermiticity.\n","subjects":["Condensed Matter/Quantum Gases","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}