{"id":"2408.14763","title":"Channel-wise Influence: Estimating Data Influence for Multivariate Time\n  Series","authors":"Muyao Wang and Zeke Xie and Bo Chen","authorsParsed":[["Wang","Muyao",""],["Xie","Zeke",""],["Chen","Bo",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 03:30:18 GMT"}],"updateDate":"2024-08-28","timestamp":1724729418000,"abstract":"  The influence function, a technique from robust statistics, measures the\nimpact on model parameters or related functions when training data is removed\nor modified. This effective and valuable post-hoc method allows for studying\nthe interpretability of machine learning models without requiring costly model\nretraining. It would provide extensions like increasing model performance,\nimproving model generalization, and offering interpretability. Recently,\nMultivariate Time Series (MTS) analysis has become an important yet challenging\ntask, attracting significant attention. However, there is no preceding research\non the influence functions of MTS to shed light on the effects of modifying the\nchannel of training MTS. Given that each channel in an MTS plays a crucial role\nin its analysis, it is essential to characterize the influence of different\nchannels. To fill this gap, we propose a channel-wise influence function, which\nis the first method that can estimate the influence of different channels in\nMTS, utilizing a first-order gradient approximation that leverages the more\ninformative average gradient of the data set. Additionally, we demonstrate how\nthis influence function can be used to estimate the impact of a channel in MTS.\nFinally, we validated the accuracy and effectiveness of our influence\nestimation function in critical MTS analysis tasks, such as MTS anomaly\ndetection and MTS forecasting. According to abundant experiments on real-world\ndataset, the original influence function performs worse than our method and\neven fail for the channel pruning problem, which demonstrate the superiority\nand necessity of channel-wise influence function in MTS analysis tasks.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}