{"id":"2408.14125","title":"CHIGLU: A Modular Hardware for Stepper Motorized Quadruped Robot\n  $\\unicode{x2014}$ Design, Analysis, Fabrication, and Validation","authors":"Abid Shahriar, Monim Hasan Anik","authorsParsed":[["Shahriar","Abid",""],["Anik","Monim Hasan",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 09:19:39 GMT"}],"updateDate":"2024-08-27","timestamp":1724663979000,"abstract":"  Bio-engineered robots are under rapid development due to their maneuver\nability through uneven surfaces. This advancement paves the way for\nexperimenting with versatile electrical system developments with various\nmotors. In this research paper, we present a design, fabrication and analysis\nof a versatile printed circuit board (PCB) as the main system that allows for\nthe control of twelve stepper motors by stacking low-budget stepper motor\ncontroller and widely used micro-controller unit. The primary motivation behind\nthe design is to offer a compact and efficient hardware solution for\ncontrolling multiple stepper motors of a quadruped robot while meeting the\nrequired power budget. The research focuses on the hardware's architecture,\nstackable design, power budget planning and a thorough analysis. Additionally,\nPDN (Power Distribution Network) analysis simulation is done to ensure that the\nvoltage and current density are within the expected parameters. Also, the\nhardware design deep dives into design for manufacturability (DFM). The ability\nto stack the controllers on the development board provides insights into the\nboard's components swapping feasibility. The findings from this research make a\nsignificant contribution to the advancement of stepper motor control systems of\nmulti-axis applications for bio-inspired robot offering a convenient form\nfactor and a reliable performance.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}