{"id":"2408.10737","title":"Mid-Band Extra Large-Scale MIMO System: Channel Modeling and Performance\n  Analysis","authors":"Jiachen Tian, Yu Han, Xiao Li, Shi Jin, Chao-Kai Wen","authorsParsed":[["Tian","Jiachen",""],["Han","Yu",""],["Li","Xiao",""],["Jin","Shi",""],["Wen","Chao-Kai",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 11:11:52 GMT"}],"updateDate":"2024-08-21","timestamp":1724152312000,"abstract":"  In pursuit of enhanced quality of service and higher transmission rates,\ncommunication within the mid-band spectrum, such as bands in the 6-15 GHz\nrange, combined with extra large-scale multiple-input multiple-output\n(XL-MIMO), is considered a potential enabler for future communication systems.\nHowever, the characteristics introduced by mid-band XL-MIMO systems pose\nchallenges for channel modeling and performance analysis. In this paper, we\nfirst analyze the potential characteristics of mid-band MIMO channels. Then, an\nanalytical channel model incorporating novel channel characteristics is\nproposed, based on a review of classical analytical channel models. This model\nis convenient for theoretical analysis and compatible with other analytical\nchannel models. Subsequently, based on the proposed channel model, we analyze\nkey metrics of wireless communication, including the ergodic spectral\nefficiency (SE) and outage probability (OP) of MIMO maximal-ratio combining\nsystems. Specifically, we derive closed-form approximations and performance\nbounds for two typical scenarios, aiming to illustrate the influence of\nmid-band XL-MIMO systems. Finally, comparisons between systems under different\npractical configurations are carried out through simulations. The theoretical\nanalysis and simulations demonstrate that mid-band XL-MIMO systems excel in SE\nand OP due to the increased array elements, moderate large-scale fading, and\nenlarged transmission bandwidth.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}