{"id":"2408.01207","title":"Dipole orientation reveals single-molecule interactions and dynamics on\n  2D crystals","authors":"Wei Guo, Tzu-Heng Chen, Nathan Ronceray, Eveline Mayner, Kenji\n  Watanabe, Takashi Taniguchi, Aleksandra Radenovic","authorsParsed":[["Guo","Wei",""],["Chen","Tzu-Heng",""],["Ronceray","Nathan",""],["Mayner","Eveline",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Radenovic","Aleksandra",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 11:43:02 GMT"}],"updateDate":"2024-08-05","timestamp":1722598982000,"abstract":"  Direct observation of single-molecule interactions and dynamic configurations\nin situ is a demanding challenge but crucial for both chemical and biological\nsystems. However, optical microscopy that relies on bulk measurements cannot\nmeet these requirements due to rapid molecular diffusion in solutions and the\ncomplexity of reaction systems. In this work, we leveraged the fluorescence\nactivation of pristine hexagonal boron nitride (h-BN) in organic solvents as a\nmolecular sensing platform, confining the molecules to a two-dimensional (2D)\ninterface and slowing down their motion. Conformational recognition and dynamic\ntracking were achieved simultaneously by measuring the 3D orientation of\nfluorescent emitters through polarized single-molecule localization microscopy\n(SMLM). We found that the orientation of in-plane emitters aligns with the\nsymmetry of the h-BN lattice, and their conformation is influenced by both the\nlocal conditions of h-BN and the regulation of the electrochemical environment.\nAdditionally, lateral diffusion of fluorescent emitters at the solid-liquid\ninterface displays more abundant dynamics compared to solid-state emitters.\nThis study opens the door for the simultaneous molecular conformation and\nphotophysics measurement, contributing to the understanding of interactions at\nthe single-molecule level and real-time sensing through 2D materials.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}