{"id":"2408.15777","title":"A Survey on Facial Expression Recognition of Static and Dynamic Emotions","authors":"Yan Wang, Shaoqi Yan, Yang Liu, Wei Song, Jing Liu, Yang Chang, Xinji\n  Mai, Xiping Hu, Wenqiang Zhang and Zhongxue Gan","authorsParsed":[["Wang","Yan",""],["Yan","Shaoqi",""],["Liu","Yang",""],["Song","Wei",""],["Liu","Jing",""],["Chang","Yang",""],["Mai","Xinji",""],["Hu","Xiping",""],["Zhang","Wenqiang",""],["Gan","Zhongxue",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 13:15:25 GMT"}],"updateDate":"2024-08-29","timestamp":1724850925000,"abstract":"  Facial expression recognition (FER) aims to analyze emotional states from\nstatic images and dynamic sequences, which is pivotal in enhancing\nanthropomorphic communication among humans, robots, and digital avatars by\nleveraging AI technologies. As the FER field evolves from controlled laboratory\nenvironments to more complex in-the-wild scenarios, advanced methods have been\nrapidly developed and new challenges and apporaches are encounted, which are\nnot well addressed in existing reviews of FER. This paper offers a\ncomprehensive survey of both image-based static FER (SFER) and video-based\ndynamic FER (DFER) methods, analyzing from model-oriented development to\nchallenge-focused categorization. We begin with a critical comparison of recent\nreviews, an introduction to common datasets and evaluation criteria, and an\nin-depth workflow on FER to establish a robust research foundation. We then\nsystematically review representative approaches addressing eight main\nchallenges in SFER (such as expression disturbance, uncertainties, compound\nemotions, and cross-domain inconsistency) as well as seven main challenges in\nDFER (such as key frame sampling, expression intensity variations, and\ncross-modal alignment). Additionally, we analyze recent advancements, benchmark\nperformances, major applications, and ethical considerations. Finally, we\npropose five promising future directions and development trends to guide\nongoing research. The project page for this paper can be found at\nhttps://github.com/wangyanckxx/SurveyFER.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}