{"id":"2408.06241","title":"Sequential non-determinism in tile self-assembly: a general framework\n  and an application to efficient temperature-1 self-assembly of squares","authors":"David Furcy and Scott M. Summers","authorsParsed":[["Furcy","David",""],["Summers","Scott M.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 15:48:30 GMT"}],"updateDate":"2024-08-13","timestamp":1723477710000,"abstract":"  In this paper, we work in a 2D version of the probabilistic variant of\nWinfree's abstract Tile Assembly Model defined by Chandran, Gopalkrishnan and\nReif (SICOMP 2012) in which attaching tiles are sampled uniformly with\nreplacement. First, we develop a framework called ``sequential\nnon-determinism'' for analyzing the probabilistic correctness of a\nnon-deterministic, temperature-1 tile assembly system (TAS) in which most (but\nnot all) tile attachments are deterministic and the non-deterministic\nattachments always occur in a specific order. Our main sequential\nnon-determinism result equates the probabilistic correctness of such a TAS to a\nfinite product of probabilities, each of which 1) corresponds to the\nprobability of the correct type of tile attaching at a point where it is\npossible for two different types to attach, and 2) ignores all other tile\nattachments that do not affect the non-deterministic attachment. We then show\nthat sequential non-determinism allows for efficient and geometrically\nexpressive self-assembly. To that end, we constructively prove that for any\npositive integer $N$ and any real $\\delta \\in (0,1)$, there exists a TAS that\nself-assembles into an $N \\times N$ square with probability at least $1 -\n\\delta$ using only $O\\left( \\log N + \\log \\frac{1}{\\delta} \\right)$ types of\ntiles. Our bound improves upon the previous state-of-the-art bound for this\nproblem by Cook, Fu and Schweller (SODA 2011).\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Computational Geometry"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}