{"id":"2408.11635","title":"Cost-Effective Big Data Orchestration Using Dagster: A Multi-Platform\n  Approach","authors":"Hernan Picatto and Georg Heiler and Peter Klimek","authorsParsed":[["Picatto","Hernan",""],["Heiler","Georg",""],["Klimek","Peter",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 14:05:35 GMT"}],"updateDate":"2024-08-22","timestamp":1724249135000,"abstract":"  The rapid advancement of big data technologies has underscored the need for\nrobust and efficient data processing solutions. Traditional Spark-based\nPlatform-as-a-Service (PaaS) solutions, such as Databricks and Amazon Web\nServices Elastic MapReduce, provide powerful analytics capabilities but often\nresult in high operational costs and vendor lock-in issues. These platforms,\nwhile user-friendly, can lead to significant inefficiencies due to their cost\nstructures and lack of transparent pricing. This paper introduces a\ncost-effective and flexible orchestration framework using Dagster. Our solution\naims to reduce dependency on any single PaaS provider by integrating various\nSpark execution environments. We demonstrate how Dagster's orchestration\ncapabilities can enhance data processing efficiency, enforce best coding\npractices, and significantly reduce operational costs. In our implementation,\nwe achieved a 12% performance improvement over EMR and a 40% cost reduction\ncompared to DBR, translating to over 300 euros saved per pipeline run. Our goal\nis to provide a flexible, developer-controlled computing environment that\nmaintains or improves performance and scalability while mitigating the risks\nassociated with vendor lock-in. The proposed framework supports rapid\nprototyping and testing, which is essential for continuous development and\noperational efficiency, contributing to a more sustainable model of large data\nprocessing.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}