{"id":"2408.12977","title":"New series expansion method for the periapsis shift","authors":"Akihito Katsumata, Tomohiro Harada, Kota Ogasawara, Hayami Iizuka","authorsParsed":[["Katsumata","Akihito",""],["Harada","Tomohiro",""],["Ogasawara","Kota",""],["Iizuka","Hayami",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 10:49:17 GMT"}],"updateDate":"2024-08-26","timestamp":1724410157000,"abstract":"  We propose a new series expansion method for the periapsis shift. The method\nformulates the periapsis shift in various spacetimes analytically without using\nspecial functions and provides simple and highly accurate approximate formulae.\nWe derive new series representations for the periapsis shift in the Kerr and\nthe Chazy-Curzon spacetimes by using the method, where the expansion parameter\nis defined as the eccentricity divided by the non-dimensional quantity that\nvanishes in the limit of the innermost stable circular orbit. That is to say,\nthe expansion parameter denotes how eccentric the orbit is and how close it is\nto the innermost stable circular orbit. The smaller the eccentricity, the\nhigher the accuracy of the formulae that are obtained by truncating the new\nseries representations up to a finite number of terms. If the eccentricity is\nsufficiently small, the truncated new representations have higher accuracy than\nthe post-Newtonian expansion formulae even in strong gravitational fields where\nthe convergence of the post-Newtonian expansion formula is not guaranteed. On\nthe other hand, even if the orbit is highly eccentric, the truncated new\nrepresentations have comparable or higher accuracy than the post-Newtonian\nexpansion formulae if the semi-major axis is sufficiently large. An exact\nformula for the periapsis shift of the quasi-circular orbit in the Chazy-Curzon\nspacetime is also obtained as a special case of the new series representation.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}