{"id":"2408.00483","title":"A Systematic Review on Long-Tailed Learning","authors":"Chongsheng Zhang, George Almpanidis, Gaojuan Fan, Binquan Deng,Yanbo\n  Zhang, Ji Liu, Aouaidjia Kamel, Paolo Soda, Jo\\~ao Gama","authorsParsed":[["Zhang","Chongsheng",""],["Almpanidis","George",""],["Fan","Gaojuan",""],["Deng","Binquan",""],["Zhang","Yanbo",""],["Liu","Ji",""],["Kamel","Aouaidjia",""],["Soda","Paolo",""],["Gama","João",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 11:39:45 GMT"}],"updateDate":"2024-08-02","timestamp":1722512385000,"abstract":"  Long-tailed data is a special type of multi-class imbalanced data with a very\nlarge amount of minority/tail classes that have a very significant combined\ninfluence. Long-tailed learning aims to build high-performance models on\ndatasets with long-tailed distributions, which can identify all the classes\nwith high accuracy, in particular the minority/tail classes. It is a\ncutting-edge research direction that has attracted a remarkable amount of\nresearch effort in the past few years. In this paper, we present a\ncomprehensive survey of latest advances in long-tailed visual learning. We\nfirst propose a new taxonomy for long-tailed learning, which consists of eight\ndifferent dimensions, including data balancing, neural architecture, feature\nenrichment, logits adjustment, loss function, bells and whistles, network\noptimization, and post hoc processing techniques. Based on our proposed\ntaxonomy, we present a systematic review of long-tailed learning methods,\ndiscussing their commonalities and alignable differences. We also analyze the\ndifferences between imbalance learning and long-tailed learning approaches.\nFinally, we discuss prospects and future directions in this field.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mo78IvuLrg0M4e8i5lmnx6iDnm3ymO_mQwO2s9GF2-g","pdfSize":"3890290","txDigest":"BKZDDNVYrJAt2qmoT8g5sDnHdZWoGW6usJdeQKAx2T3H","endEpoch":"1","status":"CERTIFIED"}
