{"id":"2408.14189","title":"EMDFNet: Efficient Multi-scale and Diverse Feature Network for Traffic\n  Sign Detection","authors":"Pengyu Li, Chenhe Liu, Tengfei Li, Xinyu Wang, Shihui Zhang, Dongyang\n  Yu","authorsParsed":[["Li","Pengyu",""],["Liu","Chenhe",""],["Li","Tengfei",""],["Wang","Xinyu",""],["Zhang","Shihui",""],["Yu","Dongyang",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 11:26:27 GMT"}],"updateDate":"2024-08-27","timestamp":1724671587000,"abstract":"  The detection of small objects, particularly traffic signs, is a critical\nsubtask within object detection and autonomous driving. Despite the notable\nachievements in previous research, two primary challenges persist. Firstly, the\nmain issue is the singleness of feature extraction. Secondly, the detection\nprocess fails to effectively integrate with objects of varying sizes or scales.\nThese issues are also prevalent in generic object detection. Motivated by these\nchallenges, in this paper, we propose a novel object detection network named\nEfficient Multi-scale and Diverse Feature Network (EMDFNet) for traffic sign\ndetection that integrates an Augmented Shortcut Module and an Efficient Hybrid\nEncoder to address the aforementioned issues simultaneously. Specifically, the\nAugmented Shortcut Module utilizes multiple branches to integrate various\nspatial semantic information and channel semantic information, thereby\nenhancing feature diversity. The Efficient Hybrid Encoder utilizes global\nfeature fusion and local feature interaction based on various features to\ngenerate distinctive classification features by integrating feature information\nin an adaptable manner. Extensive experiments on the Tsinghua-Tencent 100K\n(TT100K) benchmark and the German Traffic Sign Detection Benchmark (GTSDB)\ndemonstrate that our EMDFNet outperforms other state-of-the-art detectors in\nperformance while retaining the real-time processing capabilities of\nsingle-stage models. This substantiates the effectiveness of EMDFNet in\ndetecting small traffic signs.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}