{"id":"2408.12111","title":"ZipGait: Bridging Skeleton and Silhouette with Diffusion Model for\n  Advancing Gait Recognition","authors":"Fanxu Min, Qing Cai, Shaoxiang Guo, Yang Yu, Hao Fan, Junyu Dong","authorsParsed":[["Min","Fanxu",""],["Cai","Qing",""],["Guo","Shaoxiang",""],["Yu","Yang",""],["Fan","Hao",""],["Dong","Junyu",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 03:52:44 GMT"}],"updateDate":"2024-08-23","timestamp":1724298764000,"abstract":"  Current gait recognition research predominantly focuses on extracting\nappearance features effectively, but the performance is severely compromised by\nthe vulnerability of silhouettes under unconstrained scenes. Consequently,\nnumerous studies have explored how to harness information from various models,\nparticularly by sufficiently utilizing the intrinsic information of skeleton\nsequences. While these model-based methods have achieved significant\nperformance, there is still a huge gap compared to appearance-based methods,\nwhich implies the potential value of bridging silhouettes and skeletons. In\nthis work, we make the first attempt to reconstruct dense body shapes from\ndiscrete skeleton distributions via the diffusion model, demonstrating a new\napproach that connects cross-modal features rather than focusing solely on\nintrinsic features to improve model-based methods. To realize this idea, we\npropose a novel gait diffusion model named DiffGait, which has been designed\nwith four specific adaptations suitable for gait recognition. Furthermore, to\neffectively utilize the reconstructed silhouettes and skeletons, we introduce\nPerception Gait Integration (PGI) to integrate different gait features through\na two-stage process. Incorporating those modifications leads to an efficient\nmodel-based gait recognition framework called ZipGait. Through extensive\nexperiments on four public benchmarks, ZipGait demonstrates superior\nperformance, outperforming the state-of-the-art methods by a large margin under\nboth cross-domain and intra-domain settings, while achieving significant\nplug-and-play performance improvements.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}