{"id":"2408.09733","title":"Orientation independent quantification of macromolecular proton fraction\n  in tissues with suppression of residual dipolar coupling","authors":"Zijian Gao, Ziqiang Yu, Ziqin Zhou, Jian Hou, Baiyan Jiang, Michael\n  Ong, Weitian Chen","authorsParsed":[["Gao","Zijian",""],["Yu","Ziqiang",""],["Zhou","Ziqin",""],["Hou","Jian",""],["Jiang","Baiyan",""],["Ong","Michael",""],["Chen","Weitian",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 06:43:01 GMT"}],"updateDate":"2024-08-20","timestamp":1724049781000,"abstract":"  Quantitative magnetization transfer (MT) imaging enables non-invasive\ncharacterization of the macromolecular environment of tissues. However, recent\nwork has highlighted that the quantification of MT parameters exhibits\norientation dependence in ordered tissue structures, potentially confounding\nits clinical applications. Notably, in tissues with ordered structures, such as\narticular cartilage and myelin, the residual dipolar coupling (RDC) effect can\narise owing to incomplete averaging of dipolar-dipolar interactions of water\nprotons. In this study, we demonstrated the confounding effect of RDC on\nquantitative MT imaging in ordered tissues can be suppressed by using an\nemerging technique known as macromolecular proton fraction mapping based on\nspin-lock (MPF-SL). The off-resonance spin-lock pulse in MPF-SL could be\ndesigned to generate a strong effective spin-lock field to suppress RDC without\nviolating the specific absorption rate and hardware limitations in clinical\nscans. Furthermore, removing the water signal in MPF-SL enabled the application\nof a strong effective spin-lock field without any confounding signal from\ndirect water saturation. Our findings were experimentally validated using human\nknee specimens and healthy human cartilage. The results demonstrated that\nMPF-SL exhibits lower sensitivity to tissue orientation compared with R2,\nR1rho, and saturation-pulse-based MT imaging. Thus, MPF-SL could serve as a\nvaluable orientation-independent technique for quantifying MPF.\n","subjects":["Physics/Medical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}