{"id":"2408.03674","title":"A global optimization approach for antenna design using analytical\n  derivatives from high-frequency simulations","authors":"Thomas Most, Peter Krenz, Ralf Lampert","authorsParsed":[["Most","Thomas",""],["Krenz","Peter",""],["Lampert","Ralf",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 10:30:49 GMT"}],"updateDate":"2024-08-08","timestamp":1723026649000,"abstract":"  Antennas are more prevalent than ever enabling 5G connectivity for wide\nranging applications like cellular communication, IoT, autonomous vehicles,\netc. Optimizing an antenna design can be challenging and employing traditional\noptimization techniques oftentimes require evaluating ~100s of design\nvariations, which is time prohibitive to tight design deadlines. Instead, the\ncommon optimization approach relies on engineering expertise and solving only a\nhandful design variations to manually determine a design with good-enough\nperformance. Here, we present a novel approach for antenna optimization, which\nutilizes analytical derivatives calculated by Ansys HFSS to dramatically reduce\nthe number of necessary simulation runs. In the presented approach a local\nupdating scheme, which converges quickly to the next local optimum, is extended\nto a global search strategy intended to detect several local and global optima.\nThis global search procedure uses a consistent interpolation model to\napproximate the simulation model outputs and its derivatives depending on the\ndesign parameters values. The presented approach is implemented in an\noptimization workflow, which automatically interacts with the HFSS simulation\nmodel. Since this optimizer relies on the analytical derivatives calculated by\nHFSS, it is applicable to any design optimization where geometry or material\nproperties are varied, and the device response is described by SYZ-parameters\nor far-field quantities. The usability of this new optimizer is therefore wide\nranging from antenna design to signal integrity applications.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}