{"id":"2408.09305","title":"Constructing the Molecular Tree of Life using Assembly Theory and Mass\n  Spectrometry","authors":"Amit Kahana, Alasdair MacLeod, Hessam Mehr, Abhishek Sharma, Emma\n  Carrick, Michael Jirasek, Sara Walker and Leroy Cronin","authorsParsed":[["Kahana","Amit",""],["MacLeod","Alasdair",""],["Mehr","Hessam",""],["Sharma","Abhishek",""],["Carrick","Emma",""],["Jirasek","Michael",""],["Walker","Sara",""],["Cronin","Leroy",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 22:39:34 GMT"}],"updateDate":"2024-08-20","timestamp":1723934374000,"abstract":"  Here we demonstrate the first biochemistry-agnostic approach to map\nevolutionary relationships at the molecular scale, allowing the construction of\nphylogenetic models using mass spectrometry (MS) and Assembly Theory (AT)\nwithout elucidating molecular identities. AT allows us to estimate the\ncomplexity of molecules by deducing the amount of shared information stored\nwithin them when . By examining 74 samples from a diverse range of biotic and\nabiotic sources, we used tandem MS data to detect 24102 analytes (9262 unique)\nand 59518 molecular fragments (6755 unique). Using this MS dataset, together\nwith AT, we were able to infer the joint assembly spaces (JAS) of samples from\nmolecular analytes. We show how JAS allows agnostic annotation of samples\nwithout fingerprinting exact analyte identities, facilitating accurate\ndetermination of their biogenicity and taxonomical grouping. Furthermore, we\ndeveloped an AT-based framework to construct a biochemistry-agnostic\nphylogenetic tree which is consistent with genome-based models and outperforms\nother similarity-based algorithms. Finally, we were able to use AT to track\ncolony lineages of a single bacterial species based on phenotypic variation in\ntheir molecular composition with high accuracy, which would be challenging to\ntrack with genomic data. Our results demonstrate how AT can expand causal\nmolecular inference to non-sequence information without requiring exact\nmolecular identities, thereby opening the possibility to study previously\ninaccessible biological domains.\n","subjects":["Quantitative Biology/Populations and Evolution"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"YharQOCK3RPS3zo9RWU0hxdiMjOqYDlHqV3klo8vTu4","pdfSize":"1749153"}
