{"id":"2408.16868","title":"Characterization of point-source transient events with a rolling-shutter\n  compressed sensing system","authors":"Frank Qiu, Joshua Michalenko, Lilian K. Casias, Cameron J. Radosevich,\n  Jon Slater, Eric A. Shields","authorsParsed":[["Qiu","Frank",""],["Michalenko","Joshua",""],["Casias","Lilian K.",""],["Radosevich","Cameron J.",""],["Slater","Jon",""],["Shields","Eric A.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 19:22:37 GMT"}],"updateDate":"2024-09-02","timestamp":1724959357000,"abstract":"  Point-source transient events (PSTEs) - optical events that are both\nextremely fast and extremely small - pose several challenges to an imaging\nsystem. Due to their speed, accurately characterizing such events often\nrequires detectors with very high frame rates. Due to their size, accurately\ndetecting such events requires maintaining coverage over an extended\nfield-of-view, often through the use of imaging focal plane arrays (FPA) with a\nglobal shutter readout. Traditional imaging systems that meet these\nrequirements are costly in terms of price, size, weight, power consumption, and\ndata bandwidth, and there is a need for cheaper solutions with adequate\ntemporal and spatial coverage. To address these issues, we develop a novel\ncompressed sensing algorithm adapted to the rolling shutter readout of an\nimaging system. This approach enables reconstruction of a PSTE signature at the\nsampling rate of the rolling shutter, offering a 1-2 order of magnitude\ntemporal speedup and a proportional reduction in data bandwidth. We present\nempirical results demonstrating accurate recovery of PSTEs using measurements\nthat are spatially undersampled by a factor of 25, and our simulations show\nthat, relative to other compressed sensing algorithms, our algorithm is both\nfaster and yields higher quality reconstructions. We also present theoretical\nresults characterizing our algorithm and corroborating simulations. The\npotential impact of our work includes the development of much faster, cheaper\nsensor solutions for PSTE detection and characterization.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Signal Processing","Physics/Optics","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}