{"id":"2408.07530","title":"Towards Real-time Video Compressive Sensing on Mobile Devices","authors":"Miao Cao, Lishun Wang, Huan Wang, Guoqing Wang, Xin Yuan","authorsParsed":[["Cao","Miao",""],["Wang","Lishun",""],["Wang","Huan",""],["Wang","Guoqing",""],["Yuan","Xin",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 13:03:31 GMT"}],"updateDate":"2024-08-15","timestamp":1723640611000,"abstract":"  Video Snapshot Compressive Imaging (SCI) uses a low-speed 2D camera to\ncapture high-speed scenes as snapshot compressed measurements, followed by a\nreconstruction algorithm to retrieve the high-speed video frames. The fast\nevolving mobile devices and existing high-performance video SCI reconstruction\nalgorithms motivate us to develop mobile reconstruction methods for real-world\napplications. Yet, it is still challenging to deploy previous reconstruction\nalgorithms on mobile devices due to the complex inference process, let alone\nreal-time mobile reconstruction. To the best of our knowledge, there is no\nvideo SCI reconstruction model designed to run on the mobile devices. Towards\nthis end, in this paper, we present an effective approach for video SCI\nreconstruction, dubbed MobileSCI, which can run at real-time speed on the\nmobile devices for the first time. Specifically, we first build a U-shaped 2D\nconvolution-based architecture, which is much more efficient and\nmobile-friendly than previous state-of-the-art reconstruction methods. Besides,\nan efficient feature mixing block, based on the channel splitting and shuffling\nmechanisms, is introduced as a novel bottleneck block of our proposed MobileSCI\nto alleviate the computational burden. Finally, a customized knowledge\ndistillation strategy is utilized to further improve the reconstruction\nquality. Extensive results on both simulated and real data show that our\nproposed MobileSCI can achieve superior reconstruction quality with high\nefficiency on the mobile devices. Particularly, we can reconstruct a 256 X 256\nX 8 snapshot compressed measurement with real-time performance (about 35 FPS)\non an iPhone 15. Code is available at https://github.com/mcao92/MobileSCI.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}