{"id":"2408.04654","title":"Anisotropic effect of regular particle distribution in elastic-plastic\n  composites: The modified tangent cluster model and numerical homogenization","authors":"Kamil Bieniek, Micha{\\l} Majewski, Pawe{\\l} Ho{\\l}obut, Katarzyna\n  Kowalczyk-Gajewska","authorsParsed":[["Bieniek","Kamil",""],["Majewski","Michał",""],["Hołobut","Paweł",""],["Kowalczyk-Gajewska","Katarzyna",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 11:22:40 GMT"}],"updateDate":"2024-08-12","timestamp":1722856960000,"abstract":"  The goal of this paper is to develop a reliable analytical approach to\nfinding the effective elastic-plastic response of metal matrix composites (MMC)\nand porous metals (PM) with a predefined particle or void distribution, as well\nas to examine the anisotropy induced by regular inhomogeneity arrangements. The\nproposed framework is based on the idea of Molinari & El Mouden (1996) to\nimprove classical mean-field models of thermoelastic media by taking into\naccount the interactions between each pair of inhomogeneities within the\nmaterial volume, known as a cluster model. Both elastic and elasto-plastic\nregimes are examined. A new extension of the original formulation, aimed to\naccount for the non-linear plastic regime, is performed with the use of the\nmodified tangent linearization of the metal matrix constitutive law. The model\nuses the second stress moment to track the accumulated plastic strain in the\nmatrix. In the examples, arrangements of spherical inhomogeneities in three\nBravais lattices of cubic symmetry (Regular Cubic, Body-Centered Cubic and\nFace-Centered Cubic) are considered for two basic material scenarios:\n\"hard-in-soft\" (MMC) and \"soft-in-hard\" (PM). As a means of verification, the\nresults of micromechanical mean-field modeling are compared with those of\nnumerical homogenization performed using the Finite Element Method (FEM). In\nthe elastic regime, a comparison is also made with several other\nmicromechanical models dedicated to periodic composites. Within both regimes,\nthe results obtained by the cluster model are qualitatively and quantitatively\nconsistent with FEM calculations, especially for volume fractions of inclusions\nup to 40%.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}