{"id":"2408.15652","title":"Hybrid OTFS/OFDM Design in Massive MIMO","authors":"Ruoxi Chong, Mohammadali Mohammadi, Hien Quoc Ngo, Simon L. Cotton,\n  and Michail Matthaiou","authorsParsed":[["Chong","Ruoxi",""],["Mohammadi","Mohammadali",""],["Ngo","Hien Quoc",""],["Cotton","Simon L.",""],["Matthaiou","Michail",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 09:11:31 GMT"}],"updateDate":"2024-08-29","timestamp":1724836291000,"abstract":"  We consider a downlink (DL) massive multiple-input multiple-output (MIMO)\nsystem, where different users have different mobility profiles. To support this\nsystem, we categorize the users into two disjoint groups according to their\nmobility profile and implement a hybrid orthogonal time frequency space\n(OTFS)/orthogonal frequency division multiplexing (OFDM) modulation scheme.\nBuilding upon this framework, two precoding designs, namely full-pilot\nzero-forcing (FZF) precoding and partial zero-forcing (PZF) precoding are\nconsidered. To shed light on the system performance, the spectral efficiency\n(SE) with a minimum-mean-square-error (MMSE)-successive interference\ncancellation (SIC) detector is investigated. Closed-form expressions for the SE\nare obtained using some tight mathematical approximations. To improve fairness\namong different users, we consider max-min power control for both precoding\nschemes based on the closed-form SE expression. However, by noting the large\nperformance gap for different groups of users with PZF precoding, the per-user\nSE will be compromised when pursuing overall fairness. Therefore, we propose a\nweighted max-min power control scheme. By introducing a weighting coefficient,\nthe trade-off between the per-user performance and fairness can be enhanced.\nOur numerical results confirm the theoretical analysis and reveal that with\nmobility-based grouping, the proposed hybrid OTFS/OFDM modulation significantly\noutperforms the conventional OFDM modulation for high-mobility users.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}