{"id":"2408.01892","title":"Re-ENACT: Reinforcement Learning for Emotional Speech Generation using\n  Actor-Critic Strategy","authors":"Ravi Shankar and Archana Venkataraman","authorsParsed":[["Shankar","Ravi",""],["Venkataraman","Archana",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 00:47:29 GMT"}],"updateDate":"2024-08-06","timestamp":1722732449000,"abstract":"  In this paper, we propose the first method to modify the prosodic features of\na given speech signal using actor-critic reinforcement learning strategy. Our\napproach uses a Bayesian framework to identify contiguous segments of\nimportance that links segments of the given utterances to perception of\nemotions in humans. We train a neural network to produce the variational\nposterior of a collection of Bernoulli random variables; our model applies a\nMarkov prior on it to ensure continuity. A sample from this distribution is\nused for downstream emotion prediction. Further, we train the neural network to\npredict a soft assignment over emotion categories as the target variable. In\nthe next step, we modify the prosodic features (pitch, intensity, and rhythm)\nof the masked segment to increase the score of target emotion. We employ an\nactor-critic reinforcement learning to train the prosody modifier by\ndiscretizing the space of modifications. Further, it provides a simple solution\nto the problem of gradient computation through WSOLA operation for rhythm\nmanipulation. Our experiments demonstrate that this framework changes the\nperceived emotion of a given speech utterance to the target. Further, we show\nthat our unified technique is on par with state-of-the-art emotion conversion\nmodels from supervised and unsupervised domains that require pairwise training.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dgMdYb4VeId5tInpIN6gHaUkpC_UgLYt4-dw7k0X84c","pdfSize":"1205583"}
