{"id":"2408.04183","title":"Quantum-Enhanced Polarimetric Imaging","authors":"Meng-Yu Xie, Su-Jian Niu, Zhao-Qi-Zhi Han, Yin-Hai Li, Ren-Hui Chen,\n  Xiao-Hua Wang, Ming-Yuan Gao, Li Chen, Yue-Wei Song, Zhi-Yuan Zhou, and\n  Bao-Sen Shi","authorsParsed":[["Xie","Meng-Yu",""],["Niu","Su-Jian",""],["Han","Zhao-Qi-Zhi",""],["Li","Yin-Hai",""],["Chen","Ren-Hui",""],["Wang","Xiao-Hua",""],["Gao","Ming-Yuan",""],["Chen","Li",""],["Song","Yue-Wei",""],["Zhou","Zhi-Yuan",""],["Shi","Bao-Sen",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 03:08:08 GMT"}],"updateDate":"2024-08-09","timestamp":1723086488000,"abstract":"  Polarimetric imaging, a technique that captures the invisible\npolarization-related properties of given materials, has broad applications from\nfundamental physics to advanced fields such as target recognition, stress\ndetection, biomedical diagnosis and remote sensing. The introduction of quantum\nsources into classical imaging systems has demonstrated distinct advantages,\nyet few studies have explored their combination with polarimetric imaging. In\nthis study, we present a quantum polarimetric imaging system that integrates\npolarization-entangled photon pairs into a\npolarizer-sample-compensator-analyzer (PSRA)-type polarimeter. Our system\nvisualizes the birefringence properties of a periodical-distributed anisotropic\nmaterial under decreasing illumination levels and diverse disturbing light\nsources. Compared to the classical system, the quantum approach reveals the\nsuperior sensitivity and robustness in low-light conditions, particularly\nuseful in biomedical studies where the low illumination and non-destructive\ndetection are urgently needed. The study also highlights the nonlocality of\nentangled photons in birefringence measurement, indicating the potential of\nquantum polarimetric system in the remote sensing domain.\n","subjects":["Physics/Optics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}