{"id":"2408.16338","title":"Deep DeePC: Data-enabled predictive control with low or no online\n  optimization using deep learning","authors":"Xuewen Zhang, Kaixiang Zhang, Zhaojian Li, Xunyuan Yin","authorsParsed":[["Zhang","Xuewen",""],["Zhang","Kaixiang",""],["Li","Zhaojian",""],["Yin","Xunyuan",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 08:22:21 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 10:07:35 GMT"}],"updateDate":"2024-09-16","timestamp":1724919741000,"abstract":"  Data-enabled predictive control (DeePC) is a data-driven control algorithm\nthat utilizes data matrices to form a non-parametric representation of the\nunderlying system, predicting future behaviors and generating optimal control\nactions. DeePC typically requires solving an online optimization problem, the\ncomplexity of which is heavily influenced by the amount of data used,\npotentially leading to expensive online computation. In this paper, we leverage\ndeep learning to propose a highly computationally efficient DeePC approach for\ngeneral nonlinear processes, referred to as Deep DeePC. Specifically, a deep\nneural network is employed to learn the DeePC vector operator, which is an\nessential component of the non-parametric representation of DeePC. This neural\nnetwork is trained offline using historical open-loop input and output data of\nthe nonlinear process. With the trained neural network, the Deep DeePC\nframework is formed for online control implementation. At each sampling\ninstant, this neural network directly outputs the DeePC operator, eliminating\nthe need for online optimization as conventional DeePC. The optimal control\naction is obtained based on the DeePC operator updated by the trained neural\nnetwork. To address constrained scenarios, a constraint handling scheme is\nfurther proposed and integrated with the Deep DeePC to handle hard constraints\nduring online implementation. The efficacy and superiority of the proposed Deep\nDeePC approach are demonstrated using two benchmark process examples.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"M7h4yF-fN-Koj5WVnW0UzltSsPSIkIJooX9DlzdtQW4","pdfSize":"1461762"}
