{"id":"2408.00305","title":"Leveraging Weak Cross-Modal Guidance for Coherence Modelling via\n  Iterative Learning","authors":"Yi Bin, Junrong Liao, Yujuan Ding, Haoxuan Li, Yang Yang, See-Kiong\n  Ng, Heng Tao Shen","authorsParsed":[["Bin","Yi",""],["Liao","Junrong",""],["Ding","Yujuan",""],["Li","Haoxuan",""],["Yang","Yang",""],["Ng","See-Kiong",""],["Shen","Heng Tao",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 06:04:44 GMT"}],"updateDate":"2024-08-02","timestamp":1722492284000,"abstract":"  Cross-modal coherence modeling is essential for intelligent systems to help\nthem organize and structure information, thereby understanding and creating\ncontent of the physical world coherently like human-beings. Previous work on\ncross-modal coherence modeling attempted to leverage the order information from\nanother modality to assist the coherence recovering of the target modality.\nDespite of the effectiveness, labeled associated coherency information is not\nalways available and might be costly to acquire, making the cross-modal\nguidance hard to leverage. To tackle this challenge, this paper explores a new\nway to take advantage of cross-modal guidance without gold labels on coherency,\nand proposes the Weak Cross-Modal Guided Ordering (WeGO) model. More\nspecifically, it leverages high-confidence predicted pairwise order in one\nmodality as reference information to guide the coherence modeling in another.\nAn iterative learning paradigm is further designed to jointly optimize the\ncoherence modeling in two modalities with selected guidance from each other.\nThe iterative cross-modal boosting also functions in inference to further\nenhance coherence prediction in each modality. Experimental results on two\npublic datasets have demonstrated that the proposed method outperforms existing\nmethods for cross-modal coherence modeling tasks. Major technical modules have\nbeen evaluated effective through ablation studies. Codes are available at:\n\\url{https://github.com/scvready123/IterWeGO}.\n","subjects":["Computing Research Repository/Multimedia","Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}