{"id":"2408.17247","title":"Gellan-Based Hydrogels and Microgels for culturage heritage: a\n  rheological perspective","authors":"Silvia Franco, Leonardo Severini, Elena Buratti, Letizia Tavagnacco,\n  Simona Sennato, Mauro Missori, Barbara Ruzicka, Claudia Mazzuca, Emanuela\n  Zaccarelli, Roberta Angelini","authorsParsed":[["Franco","Silvia",""],["Severini","Leonardo",""],["Buratti","Elena",""],["Tavagnacco","Letizia",""],["Sennato","Simona",""],["Missori","Mauro",""],["Ruzicka","Barbara",""],["Mazzuca","Claudia",""],["Zaccarelli","Emanuela",""],["Angelini","Roberta",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 12:40:28 GMT"}],"updateDate":"2024-09-02","timestamp":1725021628000,"abstract":"  Gellan gum has gained significant attention due to its versatility in\nmultiple applications in the form of hydrogels and microgels. A thorough\nunderstanding of the rheological behaviour of these systems is crucial both for\nfundamental research and to optimize the manufacturing needs. To this aim, here\nwe extensively characterize the rheological behaviour of gellan based hydrogels\nand microgels recently used for efficient paper cleaning for restoration\ninterventions. In particular, we study their viscoelastic properties, also\nduring hydrogel and microgel formation, assessing the role of temperature,\ngellan concentration, and, importantly, the presence of different cations,\nwhich plays a crucial role in the gelation process. We find the interesting\nresult that, in the conditions where they are efficient for cleaning, gellan\nhydrogels exhibit a double yielding behavior. In addition, we provide a\ndetailed description of gellan microgels preparation, ensuring high control and\nreproducibility of the samples. Altogether our study sheds light on the\nmechanical stability, network structure, and overall functionality of the\ngellan-based gels, providing valuable insights into optimizing conditions for\ndesired applications in paper cleaning.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZAEmaCEXD51BrhOA79XHabghcHlQpEx6mJC5FjkLqpM","pdfSize":"2540331"}
