{"id":"2408.04440","title":"Boosting Earth System Model Outputs And Saving PetaBytes in their\n  Storage Using Exascale Climate Emulators","authors":"Sameh Abdulah, Allison H. Baker, George Bosilca, Qinglei Cao, Stefano\n  Castruccio, Marc G. Genton, David E. Keyes, Zubair Khalid, Hatem Ltaief, Yan\n  Song, Georgiy L. Stenchikov, Ying Sun","authorsParsed":[["Abdulah","Sameh",""],["Baker","Allison H.",""],["Bosilca","George",""],["Cao","Qinglei",""],["Castruccio","Stefano",""],["Genton","Marc G.",""],["Keyes","David E.",""],["Khalid","Zubair",""],["Ltaief","Hatem",""],["Song","Yan",""],["Stenchikov","Georgiy L.",""],["Sun","Ying",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 13:12:18 GMT"},{"version":"v2","created":"Sun, 11 Aug 2024 10:34:33 GMT"}],"updateDate":"2024-08-13","timestamp":1723122738000,"abstract":"  We present the design and scalable implementation of an exascale climate\nemulator for addressing the escalating computational and storage requirements\nof high-resolution Earth System Model simulations. We utilize the spherical\nharmonic transform to stochastically model spatio-temporal variations in\nclimate data. This provides tunable spatio-temporal resolution and\nsignificantly improves the fidelity and granularity of climate emulation,\nachieving an ultra-high spatial resolution of 0.034 (approximately 3.5 km) in\nspace. Our emulator, trained on 318 billion hourly temperature data points from\na 35-year and 31 billion daily data points from an 83-year global simulation\nensemble, generates statistically consistent climate emulations. We extend\nlinear solver software to mixed-precision arithmetic GPUs, applying different\nprecisions within a single solver to adapt to different correlation strengths.\nThe PaRSEC runtime system supports efficient parallel matrix operations by\noptimizing the dynamic balance between computation, communication, and memory\nrequirements. Our BLAS3-rich code is optimized for systems equipped with four\ndifferent families and generations of GPUs, scaling well to achieve 0.976\nEFlop/s on 9,025 nodes (36,100 AMD MI250X multichip module (MCM) GPUs) of\nFrontier (nearly full system), 0.739 EFlop/s on 1,936 nodes (7,744 Grace-Hopper\nSuperchips (GH200)) of Alps, 0.243 EFlop/s on 1,024 nodes (4,096 A100 GPUs) of\nLeonardo, and 0.375 EFlop/s on 3,072 nodes (18,432 V100 GPUs) of Summit.\n","subjects":["Statistics/Computation"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}