{"id":"2408.13251","title":"Re-evaluation of Face Anti-spoofing Algorithm in Post COVID-19 Era Using\n  Mask Based Occlusion Attack","authors":"Vaibhav Sundharam, Abhijit Sarkar, A. Lynn Abbott","authorsParsed":[["Sundharam","Vaibhav",""],["Sarkar","Abhijit",""],["Abbott","A. Lynn",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 17:48:22 GMT"}],"updateDate":"2024-08-26","timestamp":1724435302000,"abstract":"  Face anti-spoofing algorithms play a pivotal role in the robust deployment of\nface recognition systems against presentation attacks. Conventionally, full\nfacial images are required by such systems to correctly authenticate\nindividuals, but the widespread requirement of masks due to the current\nCOVID-19 pandemic has introduced new challenges for these biometric\nauthentication systems. Hence, in this work, we investigate the performance of\npresentation attack detection (PAD) algorithms under synthetic facial\nocclusions using masks and glasses. We have used five variants of masks to\ncover the lower part of the face with varying coverage areas (low-coverage,\nmedium-coverage, high-coverage, round coverage), and 3D cues. We have also used\ndifferent variants of glasses that cover the upper part of the face. We\nsystematically tested the performance of four PAD algorithms under these\nocclusion attacks using a benchmark dataset. We have specifically looked at\nfour different baseline PAD algorithms that focus on, texture, image quality,\nframe difference/motion, and abstract features through a convolutional neural\nnetwork (CNN). Additionally we have introduced a new hybrid model that uses CNN\nand local binary pattern textures. Our experiment shows that adding the\nocclusions significantly degrades the performance of all of the PAD algorithms.\nOur results show the vulnerability of face anti-spoofing algorithms with\nocclusions, which could be in the usage of such algorithms in the post-pandemic\nera.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"-9TyHrIXHPSl2L9UrunZrhxeP6Nz3AHYq5_vO4FRh-M","pdfSize":"6657926"}
