{"id":"2408.07991","title":"Wavelength calibration and spectral sensitivity correction of\n  luminescence measurements for dosimetry applications: method comparison\n  tested on the IR-RF of K-feldspar","authors":"Mariana Sontag-Gonz\\'alez, Dirk Mittelstra{\\ss}, Sebastian Kreutzer,\n  Markus Fuchs","authorsParsed":[["Sontag-González","Mariana",""],["Mittelstraß","Dirk",""],["Kreutzer","Sebastian",""],["Fuchs","Markus",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 07:40:51 GMT"}],"updateDate":"2024-08-16","timestamp":1723707651000,"abstract":"  Spectroscopic investigations provide important insights into the composition\nof luminescence emissions relevant to trapped-charge dating of sediments.\nAccurate wavelength calibration and a correction for the wavelength-dependent\ndetection efficiency of the spectrometer system are crucial to ensure the\ncorrect spectrum interpretation and allow for its comparison with those\nobtained from other systems. However, to achieve an accurate detection\nefficiency correction, it is necessary to obtain the device-specific spectral\nresponse function (SRF). Here, we compare two SRF approximation methods by\nusing either a calibration lamp of known irradiance or calculating the product\nof efficiency curves provided by the manufacturers of all known optical\nelements. We discuss the results using radiofluorescence (RF) measurements of\ntwo K-feldspar samples as an example. Feldspar infra-red (IR) RF spectra are\nknown to be composed of several overlapping emissions, whose variation with\nsample mineralogy is still poorly understood and requires more extensive\ninvestigations. We find that both methods of sensitivity correction yield\nbroadly similar results. However, the observed differences can alter a\nspectrum's interpretation. For example, we observe that after peak\ndeconvolution the maximum signal wavelength of the IR-RF peak used for dating\napplications differs by ~3-13 nm between the two methods, depending on sample\nand diffraction grating. We recommend using calibration lamps to determine a\ndevice's SRF but highlight the need to consider issues such as higher-order\nsignals in the choice of filters to establish the SRF's reliable wavelength\nrange. Additionally, we find that a simple and inexpensive fluorescent white\nlight yields an acceptable wavelength calibration comparable to that obtained\nfrom a specialized light source.\n","subjects":["Physics/Data Analysis, Statistics and Probability","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}