{"id":"2408.17310","title":"Lyapunov spectra and fluctuation relations: Insights from the\n  Galerkin-truncated Burgers equation","authors":"Arunava Das, Pinaki Dutta, Kamal L. Panigrahi, Vishwanath Shukla","authorsParsed":[["Das","Arunava",""],["Dutta","Pinaki",""],["Panigrahi","Kamal L.",""],["Shukla","Vishwanath",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 14:12:42 GMT"}],"updateDate":"2024-09-02","timestamp":1725027162000,"abstract":"  The imposition of a global constraint of the conservation of total kinetic\nenergy on a forced-dissipative Burgers equation yields a governing equation\nthat is invariant under the time-reversal symmetry operation, $\\{\\mathcal{T}: t\n\\to -t; u \\to -u \\}$, where $u$ is the velocity field. Moreover, the\ndissipation term gets strongly modified, as the viscosity is no longer a\nconstant, but a fluctuating, state dependent quantity, which can even become\nnegative in certain dynamical regimes. Despite these differences, the\nstatistical properties of different dynamical regimes of the time-reversible\nBurgers equation and the standard forced-dssipative Burgers equation are\nequivalent, \\`a la Gallavotti's conjecture of \\textit{equivalence of\nnonequilibrium ensembles}. We show that the negative viscosity events occur\nonly in the thermalized regime described by the time-reversible equation. This\nquasi-equilibrium regime is examined by calculating the local Lyapunov spectra\nand fluctuation relations. A pairing symmetry among the spectra is observed,\nindicating that the dynamics is chaotic and has an attractor spanning the\nentire phase space of the system. The violations of the second law of\nthermodynamics are found to be in accordance with the fluctuation relations,\nnamely the Gallavotti-Cohen relation based on the phase-space contraction rate\nand the Cohen-Searles fluctuation relation based on the energy production rate.\nIt is also argued that these violations are associated with the effects of the\nGalerkin-truncation, the latter is responsible for the thermalization.\n","subjects":["Nonlinear Sciences/Chaotic Dynamics","Condensed Matter/Statistical Mechanics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}