{"id":"2408.06060","title":"Numerical methods and analytic results for one-dimensional strongly\n  interacting spinor gases","authors":"Ovidiu I. Patu","authorsParsed":[["Patu","Ovidiu I.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 11:19:51 GMT"}],"updateDate":"2024-08-13","timestamp":1723461591000,"abstract":"  One of quantum physics's fundamental, but largely unsolved, problems is the\ncomputation of the correlation functions in many-body systems. In this paper we\naddress this problem in the case of one-dimensional spinor gases with repulsive\ncontact interactions in the presence of a confining potential. We take\nadvantage of the fact that in the strong coupling limit, the wavefunction\nfactorizes with the charge degrees of freedom expressed as a Slater determinant\nof spinless fermions and the spin sector described by a spin chain of\nSutherland type with exchange coefficients that depend only on the trapping\npotential. This factorization is also present in the expressions for the\ncorrelation functions. Still, analytical and numerical investigations were\nhindered by the fact that the local exchange coefficients and the charge\ncomponent of the correlators are expressed as $N-1$ multidimensional integrals,\nwith $N$ the number of particles, which are notoriously hard to compute using\nconventional methods. We introduce a new approach to calculating these\nintegrals that is extremely simple, scales polynomially with the number of\nparticles, and is several orders of magnitude faster than the previous methods\nreported in the literature. This allows us to investigate the static and\ndynamic properties, temperature dependence, and nonequilibrium dynamics for\nsystems with larger number of particles than previously considered and discover\nnew phenomena. We show that, contrary to natural expectations, the momentum\ndistribution of strongly interacting trapped spinor gases becomes narrower as\nwe increase the temperature and derive simple determinant representations for\nthe correlators in the spin incoherent regime valid for both equilibrium and\nnonequilibrium situations.\n","subjects":["Condensed Matter/Quantum Gases","Condensed Matter/Statistical Mechanics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}