{"id":"2408.09042","title":"ADen: Adaptive Density Representations for Sparse-view Camera Pose\n  Estimation","authors":"Hao Tang, Weiyao Wang, Pierre Gleize, and Matt Feiszli","authorsParsed":[["Tang","Hao",""],["Wang","Weiyao",""],["Gleize","Pierre",""],["Feiszli","Matt",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 22:45:46 GMT"}],"updateDate":"2024-08-20","timestamp":1723848346000,"abstract":"  Recovering camera poses from a set of images is a foundational task in 3D\ncomputer vision, which powers key applications such as 3D scene/object\nreconstructions. Classic methods often depend on feature correspondence, such\nas keypoints, which require the input images to have large overlap and small\nviewpoint changes. Such requirements present considerable challenges in\nscenarios with sparse views. Recent data-driven approaches aim to directly\noutput camera poses, either through regressing the 6DoF camera poses or\nformulating rotation as a probability distribution. However, each approach has\nits limitations. On one hand, directly regressing the camera poses can be\nill-posed, since it assumes a single mode, which is not true under symmetry and\nleads to sub-optimal solutions. On the other hand, probabilistic approaches are\ncapable of modeling the symmetry ambiguity, yet they sample the entire space of\nrotation uniformly by brute-force. This leads to an inevitable trade-off\nbetween high sample density, which improves model precision, and sample\nefficiency that determines the runtime. In this paper, we propose ADen to unify\nthe two frameworks by employing a generator and a discriminator: the generator\nis trained to output multiple hypotheses of 6DoF camera pose to represent a\ndistribution and handle multi-mode ambiguity, and the discriminator is trained\nto identify the hypothesis that best explains the data. This allows ADen to\ncombine the best of both worlds, achieving substantially higher precision as\nwell as lower runtime than previous methods in empirical evaluations.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"waLutGdVPOFVcbQTAjL3Hge__RAdhhE-s4iatwq8ngA","pdfSize":"2608092"}
