{"id":"2408.04299","title":"Respiratory Subtraction for Pulmonary Microwave Ablation Evaluation","authors":"Wan Li, Xinyun Zhong, Wei Li, Song Zhang, Moheng Rong, Yan Xi, Peng\n  Yuan, Zechen Wang, Xiaolei Jiang, Rongxi Yi, Hui Tang, Yang Chen, Chaohui\n  Tong, Zhan Wu, Feng Wang","authorsParsed":[["Li","Wan",""],["Zhong","Xinyun",""],["Li","Wei",""],["Zhang","Song",""],["Rong","Moheng",""],["Xi","Yan",""],["Yuan","Peng",""],["Wang","Zechen",""],["Jiang","Xiaolei",""],["Yi","Rongxi",""],["Tang","Hui",""],["Chen","Yang",""],["Tong","Chaohui",""],["Wu","Zhan",""],["Wang","Feng",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 08:25:38 GMT"}],"updateDate":"2024-08-09","timestamp":1723105538000,"abstract":"  Currently, lung cancer is a leading cause of global cancer mortality, often\nnecessitating minimally invasive interventions. Microwave ablation (MWA) is\nextensively utilized for both primary and secondary lung tumors. Although\nnumerous clinical guidelines and standards for MWA have been established, the\nclinical evaluation of ablation surgery remains challenging and requires\nlong-term patient follow-up for confirmation. In this paper, we propose a\nmethod termed respiratory subtraction to evaluate lung tumor ablation therapy\nperformance based on pre- and post-operative image guidance. Initially,\npreoperative images undergo coarse rigid registration to their corresponding\npostoperative positions, followed by further non-rigid registration.\nSubsequently, subtraction images are generated by subtracting the registered\npreoperative images from the postoperative ones. Furthermore, to enhance the\nclinical assessment of MWA treatment performance, we devise a quantitative\nanalysis metric to evaluate ablation efficacy by comparing differences between\ntumor areas and treatment areas. To the best of our knowledge, this is the\npioneering work in the field to facilitate the assessment of MWA surgery\nperformance on pulmonary tumors. Extensive experiments involving 35 clinical\ncases further validate the efficacy of the respiratory subtraction method. The\nexperimental results confirm the effectiveness of the respiratory subtraction\nmethod and the proposed quantitative evaluation metric in assessing lung tumor\ntreatment.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}