{"id":"2408.06809","title":"Reformulating Conversational Recommender Systems as Tri-Phase Offline\n  Policy Learning","authors":"Gangyi Zhang, Chongming Gao, Hang Pan, Runzhe Teng, Ruizhe Li","authorsParsed":[["Zhang","Gangyi",""],["Gao","Chongming",""],["Pan","Hang",""],["Teng","Runzhe",""],["Li","Ruizhe",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 10:58:29 GMT"},{"version":"v2","created":"Sat, 7 Sep 2024 09:02:29 GMT"}],"updateDate":"2024-09-10","timestamp":1723546709000,"abstract":"  Existing Conversational Recommender Systems (CRS) predominantly utilize user\nsimulators for training and evaluating recommendation policies. These\nsimulators often oversimplify the complexity of user interactions by focusing\nsolely on static item attributes, neglecting the rich, evolving preferences\nthat characterize real-world user behavior. This limitation frequently leads to\nmodels that perform well in simulated environments but falter in actual\ndeployment. Addressing these challenges, this paper introduces the Tri-Phase\nOffline Policy Learning-based Conversational Recommender System (TCRS), which\nsignificantly reduces dependency on real-time interactions and mitigates\noverfitting issues prevalent in traditional approaches. TCRS integrates a\nmodel-based offline learning strategy with a controllable user simulation that\ndynamically aligns with both personalized and evolving user preferences.\nThrough comprehensive experiments, TCRS demonstrates enhanced robustness,\nadaptability, and accuracy in recommendations, outperforming traditional CRS\nmodels in diverse user scenarios. This approach not only provides a more\nrealistic evaluation environment but also facilitates a deeper understanding of\nuser behavior dynamics, thereby refining the recommendation process.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RTG_h6w6_-n-7pDhosmZGN7N2WBrmZcciwHVWEtsEMM","pdfSize":"1202718"}
