{"id":"2408.10391","title":"Tax Credits and Household Behavior: The Roles of Myopic Decision-Making\n  and Liquidity in a Simulated Economy","authors":"Jialin Dong, Kshama Dwarakanath, Svitlana Vyetrenko","authorsParsed":[["Dong","Jialin",""],["Dwarakanath","Kshama",""],["Vyetrenko","Svitlana",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 20:19:29 GMT"}],"updateDate":"2024-08-21","timestamp":1724098769000,"abstract":"  There has been a growing interest in multi-agent simulators in the domain of\neconomic modeling. However, contemporary research often involves developing\nreinforcement learning (RL) based models that focus solely on a single type of\nagents, such as households, firms, or the government. Such an approach\noverlooks the adaptation of interacting agents thereby failing to capture the\ncomplexity of real-world economic systems. In this work, we consider a\nmulti-agent simulator comprised of RL agents of numerous types, including\nheterogeneous households, firm, central bank and government. In particular, we\nfocus on the crucial role of the government in distributing tax credits to\nhouseholds. We conduct two broad categories of comprehensive experiments\ndealing with the impact of tax credits on 1) households with varied degrees of\nmyopia (short-sightedness in spending and saving decisions), and 2) households\nwith diverse liquidity profiles. The first category of experiments examines the\nimpact of the frequency of tax credits (e.g. annual vs quarterly) on\nconsumption patterns of myopic households. The second category of experiments\nfocuses on the impact of varying tax credit distribution strategies on\nhouseholds with differing liquidities. We validate our simulation model by\nreproducing trends observed in real households upon receipt of unforeseen,\nuniform tax credits, as documented in a JPMorgan Chase report. Based on the\nresults of the latter, we propose an innovative tax credit distribution\nstrategy for the government to reduce inequality among households. We\ndemonstrate the efficacy of this strategy in improving social welfare in our\nsimulation results.\n","subjects":["Computing Research Repository/Multiagent Systems","Economics/General Economics","Quantitative Finance/Economics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}