{"id":"2408.12880","title":"Has Multimodal Learning Delivered Universal Intelligence in Healthcare?\n  A Comprehensive Survey","authors":"Qika Lin, Yifan Zhu, Xin Mei, Ling Huang, Jingying Ma, Kai He, Zhen\n  Peng, Erik Cambria, Mengling Feng","authorsParsed":[["Lin","Qika",""],["Zhu","Yifan",""],["Mei","Xin",""],["Huang","Ling",""],["Ma","Jingying",""],["He","Kai",""],["Peng","Zhen",""],["Cambria","Erik",""],["Feng","Mengling",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 07:31:01 GMT"}],"updateDate":"2024-08-26","timestamp":1724398261000,"abstract":"  The rapid development of artificial intelligence has constantly reshaped the\nfield of intelligent healthcare and medicine. As a vital technology, multimodal\nlearning has increasingly garnered interest due to data complementarity,\ncomprehensive modeling form, and great application potential. Currently,\nnumerous researchers are dedicating their attention to this field, conducting\nextensive studies and constructing abundant intelligent systems. Naturally, an\nopen question arises that has multimodal learning delivered universal\nintelligence in healthcare? To answer the question, we adopt three unique\nviewpoints for a holistic analysis. Firstly, we conduct a comprehensive survey\nof the current progress of medical multimodal learning from the perspectives of\ndatasets, task-oriented methods, and universal foundation models. Based on\nthem, we further discuss the proposed question from five issues to explore the\nreal impacts of advanced techniques in healthcare, from data and technologies\nto performance and ethics. The answer is that current technologies have NOT\nachieved universal intelligence and there remains a significant journey to\nundertake. Finally, in light of the above reviews and discussions, we point out\nten potential directions for exploration towards the goal of universal\nintelligence in healthcare.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}