{"id":"2408.06209","title":"Observation of vortex stripes in UTe$_2$","authors":"Y. F. Wang, H. X. Yao, T. Winyard, Christopher Broyles, Shannon Gould,\n  Q. S. He, P. H. Zhang, K. Z. Yao, J. J. Zhu, B. K. Xiang, K. Y. Liang, Z. J.\n  Li, B. R. Chen, Q. Z. Zhou, D. F. Agterberg, E. Babaev, S. Ran, Y. H. Wang","authorsParsed":[["Wang","Y. F.",""],["Yao","H. X.",""],["Winyard","T.",""],["Broyles","Christopher",""],["Gould","Shannon",""],["He","Q. S.",""],["Zhang","P. H.",""],["Yao","K. Z.",""],["Zhu","J. J.",""],["Xiang","B. K.",""],["Liang","K. Y.",""],["Li","Z. J.",""],["Chen","B. R.",""],["Zhou","Q. Z.",""],["Agterberg","D. F.",""],["Babaev","E.",""],["Ran","S.",""],["Wang","Y. H.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 14:58:49 GMT"},{"version":"v2","created":"Sun, 1 Sep 2024 13:16:11 GMT"}],"updateDate":"2024-09-04","timestamp":1723474729000,"abstract":"  Quantum vortices are fundamentally important for properties of\nsuperconductors. In conventional type-II superconductor they determine the\nmagnetic response of the system and tend to form regular lattices. UTe$_2$ is a\nrecently discovered heavy fermion superconductor exhibiting many anomalous\nmacroscopic behaviors. However, the question whether it has a multicomponent\norder parameter remains open. Here, we study magnetic properties of UTe$_2$ by\nemploying scanning superconducting quantum interference device microscopy. We\nfind vortex behavior which is very different from that in ordinary\nsuperconductors. We imaged vortices generated by cooling in magnetic field\napplied along different crystalline directions. While a small out-of-plane\nmagnetic field produces typical isolated vortices, higher field generates\nvortex stripe patterns which evolve with vortex density. The stripes form at\ndifferent locations and along different directions in the surface plane when\nthe vortices are crystalized along the crystalline b or c axes. The behavior is\nreproduced by our simulation based on an anisotropic two-component order\nparameter. This study shows that UTe$_2$ has a nontrivial disparity of multiple\nlength scales, placing constraints on multicomponent superconductivity. The\ntendency of vortex stripe formation and their control by external field may be\nuseful in fluxonics applications.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nxHAx_syfQWiS71_zCdIXIFv1LgSFlbFP3AR_pekUys","pdfSize":"4941116"}
