{"id":"2408.14605","title":"New supernova remnant candidates in the LOFAR Two Metre Sky Survey","authors":"K. Tsalapatas, M. Arias, T. Shimwell, K. Rajwade, M. J. Hardcastle,\n  and A. Drabent","authorsParsed":[["Tsalapatas","K.",""],["Arias","M.",""],["Shimwell","T.",""],["Rajwade","K.",""],["Hardcastle","M. J.",""],["Drabent","A.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 19:55:06 GMT"}],"updateDate":"2024-08-28","timestamp":1724702106000,"abstract":"  In spite of their key role in galaxy evolution and several decades of\nobservational efforts, the census of supernova remnants (SNRs) in our Galaxy\nremains incomplete. Theoretical predictions based on the local supernova rate\nestimate the expected number of SNRs in the Galaxy to be $\\gtrsim$ 1000. By\ncontrast, the number of detected SNRs amounts to about 300. High-resolution,\nwide-area radio surveys at low frequencies are ideal tools with which to find\nmissing SNRs, given the prominence of these sources at low radio frequencies.\nWe aim to find missing SNRs using proprietary data from the LOFAR Two-Metre Sky\nSurvey (LoTSS) at 144~MHz. We used LoTSS total intensity maps of two Galactic\nregions, one with $39^\\mathrm{o} < l < 66^\\mathrm{o}$ and $|b|<\n2.5^\\mathrm{o}$, and the other with $145^\\mathrm{o} < l < 150^\\mathrm{o}$ and\n$|b| < 3^\\mathrm{o}$, in addition to mid-infrared (MIR) data from the\nWide-field Infrared Survey Explorer (WISE) all-sky survey to search for SNR\ncandidates. We report the discovery of 14 new SNR candidates selected on the\nbasis of their morphology at 144 MHz and a lack of MIR emission. We also follow\nup on 24 previously reported SNR candidates, inferring their spectral index\nbetween the LoTSS frequency (144 MHz) and the frequency at which they were\nreported. The high resolution and sensitivity of LoTSS observations has\nresulted in the detection of 14 new SNR candidates. In order to unambiguously\nconfirm the SNR nature of these candidates, follow-up X-ray observations are\nrequired with facilities such as eROSITA.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}