{"id":"2408.10339","title":"Demonstration of Hardware Efficient Photonic Variational Quantum\n  Algorithm","authors":"Iris Agresti and Koushik Paul and Peter Schiansky and Simon Steiner\n  and Zhengao Yin and Ciro Pentangelo and Simone Piacentini and Andrea Crespi\n  and Yue Ban and Francesco Ceccarelli and Roberto Osellame and Xi Chen and\n  Philip Walther","authorsParsed":[["Agresti","Iris",""],["Paul","Koushik",""],["Schiansky","Peter",""],["Steiner","Simon",""],["Yin","Zhengao",""],["Pentangelo","Ciro",""],["Piacentini","Simone",""],["Crespi","Andrea",""],["Ban","Yue",""],["Ceccarelli","Francesco",""],["Osellame","Roberto",""],["Chen","Xi",""],["Walther","Philip",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:26:57 GMT"}],"updateDate":"2024-08-21","timestamp":1724092017000,"abstract":"  Quantum computing has brought a paradigm change in computer science, where\nnon-classical technologies have promised to outperform their classical\ncounterpart. Such an advantage was only demonstrated for tasks without\npractical applications, still out of reach for the state-of-art quantum\ntechnologies. In this context, a promising strategy to find practical use of\nquantum computers is to exploit hybrid quantum-classical models, where a\nquantum device estimates a hard-to-compute quantity, while a classical\noptimizer trains the parameters of the model. In this work, we demonstrate that\nsingle photons and linear optical networks are sufficient for implementing\nVariational Quantum Algorithms, when the problem specification, or ansatz, is\ntailored to this specific platform. We show this by a proof-of-principle\ndemonstration of a variational approach to tackle an instance of a\nfactorization task, whose solution is encoded in the ground state of a suitable\nHamiltonian. This work which combines Variational Quantum Algorithms with\nhardware efficient ansatzes for linear-optics networks showcases a promising\npathway towards practical applications for photonic quantum platforms.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"","pdfSize":"916450"}
