{"id":"2408.10849","title":"A Noval Feature via Color Quantisation for Fake Audio Detection","authors":"Zhiyong Wang, Xiaopeng Wang, Yuankun Xie, Ruibo Fu, Zhengqi Wen,\n  Jianhua Tao, Yukun Liu, Guanjun Li, Xin Qi, Yi Lu, Xuefei Liu, Yongwei Li","authorsParsed":[["Wang","Zhiyong",""],["Wang","Xiaopeng",""],["Xie","Yuankun",""],["Fu","Ruibo",""],["Wen","Zhengqi",""],["Tao","Jianhua",""],["Liu","Yukun",""],["Li","Guanjun",""],["Qi","Xin",""],["Lu","Yi",""],["Liu","Xuefei",""],["Li","Yongwei",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 13:43:20 GMT"}],"updateDate":"2024-08-21","timestamp":1724161400000,"abstract":"  In the field of deepfake detection, previous studies focus on using\nreconstruction or mask and prediction methods to train pre-trained models,\nwhich are then transferred to fake audio detection training where the encoder\nis used to extract features, such as wav2vec2.0 and Masked Auto Encoder. These\nmethods have proven that using real audio for reconstruction pre-training can\nbetter help the model distinguish fake audio. However, the disadvantage lies in\npoor interpretability, meaning it is hard to intuitively present the\ndifferences between deepfake and real audio. This paper proposes a noval\nfeature extraction method via color quantisation which constrains the\nreconstruction to use a limited number of colors for the spectral image-like\ninput. The proposed method ensures reconstructed input differs from the\noriginal, which allows for intuitive observation of the focus areas in the\nspectral reconstruction. Experiments conducted on the ASVspoof2019 dataset\ndemonstrate that the proposed method achieves better classification performance\ncompared to using the original spectral as input and pretraining the recolor\nnetwork can also benefit the fake audio detection.\n","subjects":["Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"x28KdF8b138LwsC1kKpwTV--7BCbvqvabJXitLIzsNQ","pdfSize":"965247"}
