{"id":"2408.04121","title":"Can Rule-Based Insights Enhance LLMs for Radiology Report\n  Classification? Introducing the RadPrompt Methodology","authors":"Panagiotis Fytas, Anna Breger, Ian Selby, Simon Baker, Shahab\n  Shahipasand, Anna Korhonen","authorsParsed":[["Fytas","Panagiotis",""],["Breger","Anna",""],["Selby","Ian",""],["Baker","Simon",""],["Shahipasand","Shahab",""],["Korhonen","Anna",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 23:09:23 GMT"}],"updateDate":"2024-08-09","timestamp":1723072163000,"abstract":"  Developing imaging models capable of detecting pathologies from chest X-rays\ncan be cost and time-prohibitive for large datasets as it requires supervision\nto attain state-of-the-art performance. Instead, labels extracted from\nradiology reports may serve as distant supervision since these are routinely\ngenerated as part of clinical practice. Despite their widespread use, current\nrule-based methods for label extraction rely on extensive rule sets that are\nlimited in their robustness to syntactic variability. To alleviate these\nlimitations, we introduce RadPert, a rule-based system that integrates an\nuncertainty-aware information schema with a streamlined set of rules, enhancing\nperformance. Additionally, we have developed RadPrompt, a multi-turn prompting\nstrategy that leverages RadPert to bolster the zero-shot predictive\ncapabilities of large language models, achieving a statistically significant\nimprovement in weighted average F1 score over GPT-4 Turbo. Most notably,\nRadPrompt surpasses both its underlying models, showcasing the synergistic\npotential of LLMs with rule-based models. We have evaluated our methods on two\nEnglish Corpora: the MIMIC-CXR gold-standard test set and a gold-standard\ndataset collected from the Cambridge University Hospitals.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8PyjMFYs53mnbKvE8p4Gu6GYFeZt9yGrRsMSvIRWXpU","pdfSize":"1381193"}
