{"id":"2408.13350","title":"Conditional representation stability, classification of\n  $*$-homomorphisms, and relative eta invariants","authors":"Rufus Willett","authorsParsed":[["Willett","Rufus",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 19:52:23 GMT"},{"version":"v2","created":"Tue, 17 Sep 2024 21:26:34 GMT"}],"updateDate":"2024-09-19","timestamp":1724442743000,"abstract":"  A quasi-representation of a group is a map from the group into a matrix\nalgebra (or similar object) that approximately satisfies the relations needed\nto be a representation. Work of many people starting with Kazhdan and\nVoiculescu, and recently advanced by Dadarlat, Eilers-Shulman-S\\o{}rensen and\nothers, has shown that there are topological obstructions to approximating\nunitary quasi-representations of groups by honest representations, where\n`approximation' is understood to be with respect to the operator norm.\n  The purpose of this paper is to explore whether approximation is possible if\nthe known obstructions vanish, partially generalizing work of Gong-Lin and\nEilers-Loring-Pedersen for the free abelian group of rank two, and the Klein\nbottle group. We show that this is possible, at least in a weak sense, for some\n`low-dimensional' groups including fundamental groups of closed surfaces,\ncertain Baumslag-Solitar groups, free-by-cyclic groups, and many fundamental\ngroups of three manifolds.\n  The techniques used in the paper are $K$-theoretic: they have their origin in\nBaum-Connes-Kasparov type assembly maps, and in the Elliott program to classify\n$C^*$-algebras; Kasparov's bivariant KK-theory is a crucial tool. The key new\ntechnical ingredients are: a stable uniqueness theorem in the sense of\nDadarlat-Eilers and Lin that works for non-exact $C^*$-algebras; and an\nanalysis of maps on $K$-theory with finite coefficients in terms of the\nrelative eta invariants of Atiyah-Patodi-Singer. Despite the proofs going\nthrough $K$-theoretic machinery, the main theorems can be stated in elementary\nterms that do not need any $K$-theory.\n","subjects":["Mathematics/Group Theory","Mathematics/K-Theory and Homology","Mathematics/Operator Algebras"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}