{"id":"2408.13380","title":"The MUSE Beamline Calorimeter","authors":"W. Lin, T. Rostomyan, R. Gilman, S. Strauch, C. Meier, C. Nestler, M.\n  Ali, H. Atac, J. C. Bernauer, W. J. Briscoe, A. Christopher Ndukwe, E. W.\n  Cline, K. Deiters, S. Dogra, E. J. Downie, Z. Duan, I. P. Fernando, A.\n  Flannery, D. Ghosal, A. Golossanov, J. Guo, N. S. Ifat, Y. Ilieva, M. Kohl,\n  I. Lavrukhin, L. Li, W. Lorenzon, P. Mohanmurthy, S. J. Nazeer, M. Nicol, T.\n  Patel, A. Prosnyakov, R. D. Ransome, R. Ratvasky, H. Reid, P. E. Reimer, R.\n  Richards, G. Ron, O. M. Ruimi, K. Salamone, N. Sparveris, N. Wuerfel, and D.\n  A. Yaari","authorsParsed":[["Lin","W.",""],["Rostomyan","T.",""],["Gilman","R.",""],["Strauch","S.",""],["Meier","C.",""],["Nestler","C.",""],["Ali","M.",""],["Atac","H.",""],["Bernauer","J. C.",""],["Briscoe","W. J.",""],["Ndukwe","A. Christopher",""],["Cline","E. W.",""],["Deiters","K.",""],["Dogra","S.",""],["Downie","E. J.",""],["Duan","Z.",""],["Fernando","I. P.",""],["Flannery","A.",""],["Ghosal","D.",""],["Golossanov","A.",""],["Guo","J.",""],["Ifat","N. S.",""],["Ilieva","Y.",""],["Kohl","M.",""],["Lavrukhin","I.",""],["Li","L.",""],["Lorenzon","W.",""],["Mohanmurthy","P.",""],["Nazeer","S. J.",""],["Nicol","M.",""],["Patel","T.",""],["Prosnyakov","A.",""],["Ransome","R. D.",""],["Ratvasky","R.",""],["Reid","H.",""],["Reimer","P. E.",""],["Richards","R.",""],["Ron","G.",""],["Ruimi","O. M.",""],["Salamone","K.",""],["Sparveris","N.",""],["Wuerfel","N.",""],["Yaari","D. A.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 21:25:55 GMT"}],"updateDate":"2024-08-27","timestamp":1724448355000,"abstract":"  The MUon Scattering Experiment (MUSE) was motivated by the proton radius\npuzzle arising from the discrepancy between muonic hydrogen spectroscopy and\nelectron-proton measurements. The MUSE physics goals also include testing\nlepton universality, precisely measuring two-photon exchange contribution, and\ntesting radiative corrections. MUSE addresses these physics goals through\nsimultaneous measurement of high precision cross sections for electron-proton\nand muon-proton scattering using a mixed-species beam. The experiment will run\nat both positive and negative beam polarities. Measuring precise cross sections\nrequires understanding both the incident beam energy and the radiative\ncorrections. For this purpose, a lead-glass calorimeter was installed at the\nend of the beam line in the MUSE detector system. In this article we discuss\nthe detector specifications, calibration and performance. We demonstrate that\nthe detector performance is well reproduced by simulation, and meets\nexperimental requirements.\n","subjects":["Physics/Instrumentation and Detectors","Physics/Nuclear Experiment"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}