{"id":"2408.07960","title":"Characterization of Intensity Correlation via Single-photon Detection in\n  Quantum Key Distribution","authors":"Tianyi Xing, Junxuan Liu, Likang Zhang, Min-Yan Wang, Yu-Huai Li,\n  Ruiyin Liu, Qingquan Peng, Dongyang Wang, Yaxuan Wang, Hongwei Liu, Wei Li,\n  Yuan Cao, Anqi Huang","authorsParsed":[["Xing","Tianyi",""],["Liu","Junxuan",""],["Zhang","Likang",""],["Wang","Min-Yan",""],["Li","Yu-Huai",""],["Liu","Ruiyin",""],["Peng","Qingquan",""],["Wang","Dongyang",""],["Wang","Yaxuan",""],["Liu","Hongwei",""],["Li","Wei",""],["Cao","Yuan",""],["Huang","Anqi",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 06:13:20 GMT"},{"version":"v2","created":"Sun, 18 Aug 2024 08:16:42 GMT"}],"updateDate":"2024-08-20","timestamp":1723702400000,"abstract":"  One of the most significant vulnerabilities in the source unit of quantum key\ndistribution (QKD) is the correlation between quantum states after modulation,\nwhich shall be characterized and evaluated for its practical security\nperformance. In this work, we propose a methodology to characterize the\nintensity correlation according to the single-photon detection results in the\nmeasurement unit without modifying the configuration of the QKD system. In\ncontrast to the previous research that employs extra classical optical detector\nto measure the correlation, our method can directly analyse the detection data\ngenerated during the raw key exchange, enabling to characterize the feature of\ncorrelation in real-time system operation. The basic method is applied to a\nBB84 QKD system and the characterized correlation decreases the secure key rate\nshown by the security proof. Furthermore, the method is extended and applied to\ncharacterize the correlation from the result of Bell-state measurement, which\ndemonstrates its applicability to a running full-scheme MDI QKD system. This\nstudy provides an approach for standard certification of a QKD system.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}