{"id":"2408.06847","title":"AI Research is not Magic, it has to be Reproducible and Responsible:\n  Challenges in the AI field from the Perspective of its PhD Students","authors":"Andrea Hrckova, Jennifer Renoux, Rafael Tolosana Calasanz, Daniela\n  Chuda, Martin Tamajka and Jakub Simko","authorsParsed":[["Hrckova","Andrea",""],["Renoux","Jennifer",""],["Calasanz","Rafael Tolosana",""],["Chuda","Daniela",""],["Tamajka","Martin",""],["Simko","Jakub",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 12:19:02 GMT"}],"updateDate":"2024-08-14","timestamp":1723551542000,"abstract":"  With the goal of uncovering the challenges faced by European AI students\nduring their research endeavors, we surveyed 28 AI doctoral candidates from 13\nEuropean countries. The outcomes underscore challenges in three key areas: (1)\nthe findability and quality of AI resources such as datasets, models, and\nexperiments; (2) the difficulties in replicating the experiments in AI papers;\n(3) and the lack of trustworthiness and interdisciplinarity. From our findings,\nit appears that although early stage AI researchers generally tend to share\ntheir AI resources, they lack motivation or knowledge to engage more in dataset\nand code preparation and curation, and ethical assessments, and are not used to\ncooperate with well-versed experts in application domains. Furthermore, we\nexamine existing practices in data governance and reproducibility both in\ncomputer science and in artificial intelligence. For instance, only a minority\nof venues actively promote reproducibility initiatives such as reproducibility\nevaluations.\n  Critically, there is need for immediate adoption of responsible and\nreproducible AI research practices, crucial for society at large, and essential\nfor the AI research community in particular. This paper proposes a combination\nof social and technical recommendations to overcome the identified challenges.\nSocially, we propose the general adoption of reproducibility initiatives in AI\nconferences and journals, as well as improved interdisciplinary collaboration,\nespecially in data governance practices. On the technical front, we call for\nenhanced tools to better support versioning control of datasets and code, and a\ncomputing infrastructure that facilitates the sharing and discovery of AI\nresources, as well as the sharing, execution, and verification of experiments.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}