{"id":"2408.16760","title":"OmniRe: Omni Urban Scene Reconstruction","authors":"Ziyu Chen, Jiawei Yang, Jiahui Huang, Riccardo de Lutio, Janick\n  Martinez Esturo, Boris Ivanovic, Or Litany, Zan Gojcic, Sanja Fidler, Marco\n  Pavone, Li Song, Yue Wang","authorsParsed":[["Chen","Ziyu",""],["Yang","Jiawei",""],["Huang","Jiahui",""],["de Lutio","Riccardo",""],["Esturo","Janick Martinez",""],["Ivanovic","Boris",""],["Litany","Or",""],["Gojcic","Zan",""],["Fidler","Sanja",""],["Pavone","Marco",""],["Song","Li",""],["Wang","Yue",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 17:56:33 GMT"}],"updateDate":"2024-08-30","timestamp":1724954193000,"abstract":"  We introduce OmniRe, a holistic approach for efficiently reconstructing\nhigh-fidelity dynamic urban scenes from on-device logs. Recent methods for\nmodeling driving sequences using neural radiance fields or Gaussian Splatting\nhave demonstrated the potential of reconstructing challenging dynamic scenes,\nbut often overlook pedestrians and other non-vehicle dynamic actors, hindering\na complete pipeline for dynamic urban scene reconstruction. To that end, we\npropose a comprehensive 3DGS framework for driving scenes, named OmniRe, that\nallows for accurate, full-length reconstruction of diverse dynamic objects in a\ndriving log. OmniRe builds dynamic neural scene graphs based on Gaussian\nrepresentations and constructs multiple local canonical spaces that model\nvarious dynamic actors, including vehicles, pedestrians, and cyclists, among\nmany others. This capability is unmatched by existing methods. OmniRe allows us\nto holistically reconstruct different objects present in the scene,\nsubsequently enabling the simulation of reconstructed scenarios with all actors\nparticipating in real-time (~60Hz). Extensive evaluations on the Waymo dataset\nshow that our approach outperforms prior state-of-the-art methods\nquantitatively and qualitatively by a large margin. We believe our work fills a\ncritical gap in driving reconstruction.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}