{"id":"2408.00799","title":"Deep Uncertainty-Based Explore for Index Construction and Retrieval in\n  Recommendation System","authors":"Xin Jiang, Kaiqiang Wang, Yinlong Wang, Fengchang Lv, Taiyang Peng,\n  Shuai Yang, Xianteng Wu, Pengye Zhang, Shuo Yuan, Yifan Zeng","authorsParsed":[["Jiang","Xin",""],["Wang","Kaiqiang",""],["Wang","Yinlong",""],["Lv","Fengchang",""],["Peng","Taiyang",""],["Yang","Shuai",""],["Wu","Xianteng",""],["Zhang","Pengye",""],["Yuan","Shuo",""],["Zeng","Yifan",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 02:27:57 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 03:03:16 GMT"}],"updateDate":"2024-08-07","timestamp":1721615277000,"abstract":"  In recommendation systems, the relevance and novelty of the final results are\nselected through a cascade system of Matching -> Ranking -> Strategy. The\nmatching model serves as the starting point of the pipeline and determines the\nupper bound of the subsequent stages. Balancing the relevance and novelty of\nmatching results is a crucial step in the design and optimization of\nrecommendation systems, contributing significantly to improving recommendation\nquality. However, the typical matching algorithms have not simultaneously\naddressed the relevance and novelty perfectly. One main reason is that deep\nmatching algorithms exhibit significant uncertainty when estimating items in\nthe long tail (e.g., due to insufficient training samples) items.The\nuncertainty not only affects the training of the models but also influences the\nconfidence in the index construction and beam search retrieval process of these\nmodels. This paper proposes the UICR (Uncertainty-based explore for Index\nConstruction and Retrieval) algorithm, which introduces the concept of\nuncertainty modeling in the matching stage and achieves multi-task modeling of\nmodel uncertainty and index uncertainty. The final matching results are\nobtained by combining the relevance score and uncertainty score infered by the\nmodel. Experimental results demonstrate that the UICR improves novelty without\nsacrificing relevance on realworld industrial productive environments and\nmultiple open-source datasets. Remarkably, online A/B test results of display\nadvertising in Shopee demonstrates the effectiveness of the proposed algorithm.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yvMHi-bEhh3DI4I_CGJ_Z_dhJyrExNA8uO9jly4eGE4","pdfSize":"761714"}
