{"id":"2408.10559","title":"An Accreting Supermassive Black Hole Buried in a Faint Dwarf Galaxy","authors":"Abhishek Paswan, Mousumi Das, K Rubinur","authorsParsed":[["Paswan","Abhishek",""],["Das","Mousumi",""],["Rubinur","K",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 05:59:16 GMT"}],"updateDate":"2024-08-21","timestamp":1724133556000,"abstract":"  In the last decade, there have been several discoveries of Active Galactic\nNuclei (AGN) in dwarf galaxies including an AGN in an ultra-compact dwarf\ngalaxy with a Black Hole mass $>$10$^{6}$ M$_{\\odot}$. However, finding a\nSupermassive Black Hole (SMBH) in a dwarf Low Surface Brightness (LSB) galaxy\nis rare. We report the discovery of a Seyfert type-2 class AGN which is\nassociated with a nuclear SMBH of mass $\\sim$6.5 $\\times$ 10$^{6}$ M$_{\\odot}$\nin a dwarf LSB galaxy ($\\mu_{0,r}$ $>$ 23.8 mag/arcsec$^{2}$) that we denote by\nMJ0818+2257. The galaxy was previously thought to be an outlying emission blob\naround the large spiral galaxy LEDA 1678924. In our current analysis, which\nincludes the detection of the optical counterpart of MJ0818+2257, we study its\nionized gas kinematics and find that the dynamical mass within the ionized gas\ndisk is $\\sim$5.3 $\\times$ 10$^{9}$ M$_{\\odot}$. This is comparable to its\nstellar mass which is $\\sim$3$\\times$ 10$^{9}$ M$_{\\odot}$ and suggests that\nMJ0818+2257 is moderately dark matter-dominated within the stellar disk. The\nSMBH mass to galaxy stellar mass ratio is $M_{BH}/M(*)>0.022$ which is high\ncompared to disk galaxies. Our detection of a SMBH in a bulgeless LSB dwarf\ngalaxy raises questions about the growth of SMBHs in low-luminosity galaxies\nand suggests the possibility of detecting heavy, seed black holes from early\nepochs in LSB dwarf galaxies in the low redshift universe.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hPpkHP6oNPKDh-pHCs09zILk315HGBoU9GiPEFGd6lE","pdfSize":"3244349"}
