{"id":"2408.09876","title":"Improving Genomic Prediction using High-dimensional Secondary\n  Phenotypes: the Genetic Latent Factor Approach","authors":"Killian A. C. Melsen, Jonathan F. Kunst, Jos\\'e Crossa, Margaret R.\n  Krause, Fred A. van Eeuwijk, Willem Kruijer, Carel F. W. Peeters","authorsParsed":[["Melsen","Killian A. C.",""],["Kunst","Jonathan F.",""],["Crossa","José",""],["Krause","Margaret R.",""],["van Eeuwijk","Fred A.",""],["Kruijer","Willem",""],["Peeters","Carel F. W.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 10:34:36 GMT"}],"updateDate":"2024-08-20","timestamp":1724063676000,"abstract":"  Decreasing costs and new technologies have led to an increase in the amount\nof data available to plant breeding programs. High-throughput phenotyping (HTP)\nplatforms routinely generate high-dimensional datasets of secondary features\nthat may be used to improve genomic prediction accuracy. However, integration\nof this data comes with challenges such as multicollinearity, parameter\nestimation in $p > n$ settings, and the computational complexity of many\nstandard approaches. Several methods have emerged to analyze such data, but\ninterpretation of model parameters often remains challenging.\n  We propose genetic factor best linear unbiased prediction (gfBLUP), a\nseven-step prediction pipeline that reduces the dimensionality of the original\nsecondary HTP data using generative factor analysis. In short, gfBLUP uses\nredundancy filtered and regularized genetic and residual correlation matrices\nto fit a maximum likelihood factor model and estimate genetic latent factor\nscores. These latent factors are subsequently used in multi-trait genomic\nprediction. Our approach performs on par or better than alternatives in\nextensive simulations and a real-world application, while producing easily\ninterpretable and biologically relevant parameters. We discuss several possible\nextensions and highlight gfBLUP as the basis for a flexible and modular\nmulti-trait genomic prediction framework.\n","subjects":["Statistics/Methodology","Quantitative Biology/Quantitative Methods"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}