{"id":"2408.12199","title":"Efficient Learning for Linear Properties of Bounded-Gate Quantum\n  Circuits","authors":"Yuxuan Du, Min-Hsiu Hsieh, Dacheng Tao","authorsParsed":[["Du","Yuxuan",""],["Hsieh","Min-Hsiu",""],["Tao","Dacheng",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 08:21:28 GMT"}],"updateDate":"2024-08-23","timestamp":1724314888000,"abstract":"  The vast and complicated large-qubit state space forbids us to\ncomprehensively capture the dynamics of modern quantum computers via classical\nsimulations or quantum tomography. However, recent progress in quantum learning\ntheory invokes a crucial question: given a quantum circuit containing d tunable\nRZ gates and G-d Clifford gates, can a learner perform purely classical\ninference to efficiently predict its linear properties using new classical\ninputs, after learning from data obtained by incoherently measuring states\ngenerated by the same circuit but with different classical inputs? In this\nwork, we prove that the sample complexity scaling linearly in d is necessary\nand sufficient to achieve a small prediction error, while the corresponding\ncomputational complexity may scale exponentially in d. Building upon these\nderived complexity bounds, we further harness the concept of classical shadow\nand truncated trigonometric expansion to devise a kernel-based learning model\ncapable of trading off prediction error and computational complexity,\ntransitioning from exponential to polynomial scaling in many practical\nsettings. Our results advance two crucial realms in quantum computation: the\nexploration of quantum algorithms with practical utilities and learning-based\nquantum system certification. We conduct numerical simulations to validate our\nproposals across diverse scenarios, encompassing quantum information processing\nprotocols, Hamiltonian simulation, and variational quantum algorithms up to 60\nqubits.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}