{"id":"2408.14808","title":"Effect of quark anomalous magnetic moment on neutral dense quark matter\n  under magnetic field","authors":"Mamiya Kawaguchi, Irfan Siddique, Mei Huang","authorsParsed":[["Kawaguchi","Mamiya",""],["Siddique","Irfan",""],["Huang","Mei",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 06:44:14 GMT"}],"updateDate":"2024-08-28","timestamp":1724741054000,"abstract":"  We discuss the effect of the quark anomalous magnetic moment (AMM) on the\nneutral dense quark matter under magnetic fields based on the\nNambu-Jona-Lasinio (NJL) model at finite baryon density. To address its\ncorrelation with the chiral symmetry, we consider a simplified situation: the\nmodel includes the two-quark flavors under constant magnetic fields, and\nincorporates the effective interaction of the quark AMM linked to the\nspontaneous chiral symmetry breaking. We then examine the equation of state\n(EoS) in cases with and without magnetization for anatomizing the thermodynamic\nquantities. Without the magnetization, a small magnetic field stiffens the EoS,\nbut with increasing the magnetic field, the EoS tends to soften. The stiffness\nof the EoS is found to be influenced by the magnetic effect on the critical\nchemical potential of the chiral phase transition and the quark number density\nat this critical point. As a result, the mass and radius of the neutral dense\nquark matter increase with the small magnetic field but turn to decrease as the\nmagnetic field further increases. By including the quark AMM, the critical\nchemical potential is decreased and the quark number density takes a smaller\nvalue. Thus, for the stronger magnetic fields, the quark AMM suppresses the\nsoftening effect of the magnetic field on the EoS, leading to increased mass\nand radius compared to when the quark AMM is absent. In contrast, for the small\nmagnetic field, the contribution of the quark AMM to the EoS is marginal. When\nthe magnetization is taken into account, the magnetic effect on the stiffness\nof the EoS is overshadowed by the contribution of the magnetization, and the\nsignificance of the quark AMM also becomes invisible in the mass-radius\nrelation.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}