{"id":"2408.09667","title":"BLADE: Benchmarking Language Model Agents for Data-Driven Science","authors":"Ken Gu, Ruoxi Shang, Ruien Jiang, Keying Kuang, Richard-John Lin,\n  Donghe Lyu, Yue Mao, Youran Pan, Teng Wu, Jiaqian Yu, Yikun Zhang, Tianmai M.\n  Zhang, Lanyi Zhu, Mike A. Merrill, Jeffrey Heer, Tim Althoff","authorsParsed":[["Gu","Ken",""],["Shang","Ruoxi",""],["Jiang","Ruien",""],["Kuang","Keying",""],["Lin","Richard-John",""],["Lyu","Donghe",""],["Mao","Yue",""],["Pan","Youran",""],["Wu","Teng",""],["Yu","Jiaqian",""],["Zhang","Yikun",""],["Zhang","Tianmai M.",""],["Zhu","Lanyi",""],["Merrill","Mike A.",""],["Heer","Jeffrey",""],["Althoff","Tim",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 02:59:35 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 20:25:10 GMT"}],"updateDate":"2024-08-22","timestamp":1724036375000,"abstract":"  Data-driven scientific discovery requires the iterative integration of\nscientific domain knowledge, statistical expertise, and an understanding of\ndata semantics to make nuanced analytical decisions, e.g., about which\nvariables, transformations, and statistical models to consider. LM-based agents\nequipped with planning, memory, and code execution capabilities have the\npotential to support data-driven science. However, evaluating agents on such\nopen-ended tasks is challenging due to multiple valid approaches, partially\ncorrect steps, and different ways to express the same decisions. To address\nthese challenges, we present BLADE, a benchmark to automatically evaluate\nagents' multifaceted approaches to open-ended research questions. BLADE\nconsists of 12 datasets and research questions drawn from existing scientific\nliterature, with ground truth collected from independent analyses by expert\ndata scientists and researchers. To automatically evaluate agent responses, we\ndeveloped corresponding computational methods to match different\nrepresentations of analyses to this ground truth. Though language models\npossess considerable world knowledge, our evaluation shows that they are often\nlimited to basic analyses. However, agents capable of interacting with the\nunderlying data demonstrate improved, but still non-optimal, diversity in their\nanalytical decision making. Our work enables the evaluation of agents for\ndata-driven science and provides researchers deeper insights into agents'\nanalysis approaches.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PTVR8A7SIR-aL-LGEZzuMzI_mPbe5ng-E3jt532qB4A","pdfSize":"17556676"}
