{"id":"2408.14982","title":"Ultra-Low-Complexity, Non-Linear Processing for MU-MIMO Systems","authors":"Chathura Jayawardena and Konstantinos Nikitopoulos","authorsParsed":[["Jayawardena","Chathura",""],["Nikitopoulos","Konstantinos",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 11:51:50 GMT"}],"updateDate":"2024-08-28","timestamp":1724759510000,"abstract":"  Non-linear detection schemes can substantially improve the achievable\nthroughput and connectivity capabilities of uplink MU-MIMO systems that employ\nlinear detection. However, the complexity requirements of existing non-linear\nsoft detectors that provide substantial gains compared to linear ones are at\nleast an order of magnitude more complex, making their adoption challenging. In\nparticular, joint soft information computation involves solving multiple vector\nminimization problems, each with a complexity that scales exponentially with\nthe number of users. This work introduces a novel ultra-low-complexity,\nnon-linear detection scheme that performs joint Detection and Approximate\nReliability Estimation (DARE). For the first time, DARE can substantially\nimprove the achievable throughput (e.g., 40%) with less than 2x the complexity\nof linear MMSE, making non-linear processing extremely practical. To enable\nthis, DARE includes a novel procedure to approximate the reliability of the\nreceived bits based on the region of the received observable that can\nefficiently approach the accurately calculated soft detection performance. In\naddition, we show that DARE can achieve a better throughput than linear\ndetection when using just half the base station antennas, resulting in\nsubstantial power savings (e.g., 500 W). Consequently, DARE is a very strong\ncandidate for future power-efficient MU-MIMO developments, even in the case of\nsoftware-based implementations, as in the case of emerging Open-RAN systems.\nFurthermore, DARE can achieve the throughput of the state-of-the-art non-linear\ndetectors with complexity requirements that are orders of magnitude lower.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}