{"id":"2408.03358","title":"MLC-GCN: Multi-Level Generated Connectome Based GCN for AD Analysis","authors":"Wenqi Zhu, Yinghua Fu, Ze Wang (for the Alzheimer's Disease\n  Neuroimaging Initiative)","authorsParsed":[["Zhu","Wenqi","","for the Alzheimer's Disease\n  Neuroimaging Initiative"],["Fu","Yinghua","","for the Alzheimer's Disease\n  Neuroimaging Initiative"],["Wang","Ze","","for the Alzheimer's Disease\n  Neuroimaging Initiative"]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 14:18:36 GMT"}],"updateDate":"2024-08-08","timestamp":1722953916000,"abstract":"  Alzheimer's Disease (AD) is a currently incurable neurodegeneartive disease.\nAccurately detecting AD, especially in the early stage, represents a high\nresearch priority. AD is characterized by progressive cognitive impairments\nthat are related to alterations in brain functional connectivity (FC). Based on\nthis association, many studies have been published over the decades using FC\nand machine learning to differentiate AD from healthy aging. The most recent\ndevelopment in this detection method highlights the use of graph neural network\n(GNN) as the brain functionality analysis. In this paper, we proposed a stack\nof spatio-temporal feature extraction and graph generation based AD\nclassification model using resting state fMRI. The proposed multi-level\ngenerated connectome (MLC) based graph convolutional network (GCN) (MLC-GCN)\ncontains a multi-graph generation block and a GCN prediction block. The\nmulti-graph generation block consists of a hierarchy of spatio-temporal feature\nextraction layers for extracting spatio-temporal rsfMRI features at different\ndepths and building the corresponding connectomes. The GCN prediction block\ntakes the learned multi-level connectomes to build and optimize GCNs at each\nlevel and concatenates the learned graphical features as the final predicting\nfeatures for AD classification. Through independent cohort validations, MLC-GCN\nshows better performance for differentiating MCI, AD, and normal aging than\nstate-of-art GCN and rsfMRI based AD classifiers. The proposed MLC-GCN also\nshowed high explainability in terms of learning clinically reasonable\nconnectome node and connectivity features from two independent datasets. While\nwe only tested MLC-GCN on AD, the basic rsfMRI-based multi-level learned GCN\nbased outcome prediction strategy is valid for other diseases or clinical\noutcomes.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}