{"id":"2408.01539","title":"Delay Conditioned Generative Modelling of Resistive Drift in Memristors","authors":"Waleed El-Geresy, Christos Papavassiliou, Deniz G\\\"und\\\"uz","authorsParsed":[["El-Geresy","Waleed",""],["Papavassiliou","Christos",""],["Gündüz","Deniz",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 18:53:39 GMT"}],"updateDate":"2024-08-06","timestamp":1722624819000,"abstract":"  The modelling of memristive devices is an essential part of the development\nof novel in-memory computing systems. Models are needed to enable the accurate\nand efficient simulation of memristor device characteristics, for purposes of\ntesting the performance of the devices or the feasibility of their use in\nfuture neuromorphic and in-memory computing architectures. The consideration of\nmemristor non-idealities is an essential part of any modelling approach. The\nnature of the deviation of memristive devices from their initial state,\nparticularly at ambient temperature and in the absence of a stimulating\nvoltage, is of key interest, as it dictates their reliability as information\nstorage media - a property that is of importance for both traditional storage\nand neuromorphic applications. In this paper, we investigate the use of a\ngenerative modelling approach for the simulation of the delay and initial\nresistance-conditioned resistive drift distribution of memristive devices. We\nintroduce a data normalisation scheme and a novel training technique to enable\nthe generative model to be conditioned on the continuous inputs. The proposed\ngenerative modelling approach is suited for use in end-to-end training and\ndevice modelling scenarios, including learned data storage applications, due to\nits simulation efficiency and differentiability.\n","subjects":["Computing Research Repository/Emerging Technologies","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5Uo_8bntY0RAnqpCYO_o7-IKqZxHFajEucH4UFxHbRU","pdfSize":"7844251"}
