{"id":"2408.08316","title":"SepAl: Sepsis Alerts On Low Power Wearables With Digital Biomarkers and\n  On-Device Tiny Machine Learning","authors":"Marco Giordano, Kanika Dheman and Michele Magno","authorsParsed":[["Giordano","Marco",""],["Dheman","Kanika",""],["Magno","Michele",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 09:56:19 GMT"}],"updateDate":"2024-08-19","timestamp":1722419779000,"abstract":"  Sepsis is a lethal syndrome of organ dysfunction that is triggered by an\ninfection and claims 11 million lives per year globally. Prognostic algorithms\nbased on deep learning have shown promise in detecting the onset of sepsis\nhours before the actual event but use a large number of bio-markers, including\nvital signs and laboratory tests. The latter makes the deployment of such\nsystems outside hospitals or in resource-limited environments extremely\nchallenging. This paper introduces SepAl, an energy-efficient and lightweight\nneural network, using only data from low-power wearable sensors, such as\nphotoplethysmography (PPG), inertial measurement units (IMU), and body\ntemperature sensors, designed to deliver alerts in real-time. SepAl leverages\nonly six digitally acquirable vital signs and tiny machine learning algorithms,\nenabling on-device real-time sepsis prediction.\n  SepAl uses a lightweight temporal convolution neural network capable of\nproviding sepsis alerts with a median predicted time to sepsis of 9.8 hours.\nThe model has been fully quantized, being able to be deployed on any low-power\nprocessors, and evaluated on an ARM Cortex-M33 core. Experimental evaluations\nshow an inference efficiency of 0.11MAC/Cycle and a latency of 143ms, with an\nenergy per inference of 2.68mJ. This work aims at paving the way toward\naccurate disease prediction, deployable in a long-lasting multi-vital sign\nwearable device, suitable for providing sepsis onset alerts at the point of\ncare.\n  The code used in this work has been open-sourced and is available at\nhttps://github.com/mgiordy/sepsis-prediction\n","subjects":["Quantitative Biology/Tissues and Organs","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"EjkJMrtqkwc0oyLRV2TLswRibHS9TolR55S_0l_sAJw","pdfSize":"2152599"}
