{"id":"2408.08787","title":"Electron beam splitting effect with crossed zigzag graphene nanoribbons\n  in high-spin metallic states","authors":"Sofia Sanz, G\\'eza Giedke, Daniel S\\'anchez-Portal, Thomas Frederiksen","authorsParsed":[["Sanz","Sofia",""],["Giedke","Géza",""],["Sánchez-Portal","Daniel",""],["Frederiksen","Thomas",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 14:59:53 GMT"}],"updateDate":"2024-08-19","timestamp":1723820393000,"abstract":"  Here we analyze the electron transport properties of a device formed of two\ncrossed graphene nanoribbons with zigzag edges (ZGNRs) in a spin state with\ntotal magnetization different from zero. While the ground state of ZGNRs has\nbeen shown to display antiferromagnetic ordering between the electrons at the\nedges, for wide ZGNRs--where the localized spin states at the edges are\ndecoupled and the exchange interaction is close to zero--, in presence of\nrelatively small magnetic fields, the ferromagnetic (FM) spin configuration can\nin fact become the state of lowest energy due to the Zeeman effect. In these\nterms, by comparing the total energy of a periodic ZGNR as a function of the\nmagnetization per unit cell we obtain the FM-like solution of lowest energy for\nthe perfect ribbon, the corresponding FM-like configuration of lowest energy\nfor the four-terminal device formed of crossed ZGNRs, and the critical magnetic\nfield needed to excite the system to this spin configuration. By performing\ntransport calculations, we analyze the role of the distance between layers and\nthe crossing angle of this device in the electrical conductance, at small gate\nvoltages. The problem is approached employing the mean-field Hubbard\nHamiltonian in combination with non-equilibrium Green's functions. We find that\nZGNR devices subject to transverse magnetic fields may acquire a high-spin\nconfiguration that ensures a metallic response and tunable beam splitting\nproperties, making this setting promising for studying electron quantum optics\nwith single-electron excitations.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}