{"id":"2408.10906","title":"ShapeSplat: A Large-scale Dataset of Gaussian Splats and Their\n  Self-Supervised Pretraining","authors":"Qi Ma, Yue Li, Bin Ren, Nicu Sebe, Ender Konukoglu, Theo Gevers, Luc\n  Van Gool, Danda Pani Paudel","authorsParsed":[["Ma","Qi",""],["Li","Yue",""],["Ren","Bin",""],["Sebe","Nicu",""],["Konukoglu","Ender",""],["Gevers","Theo",""],["Van Gool","Luc",""],["Paudel","Danda Pani",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 14:49:14 GMT"}],"updateDate":"2024-08-21","timestamp":1724165354000,"abstract":"  3D Gaussian Splatting (3DGS) has become the de facto method of 3D\nrepresentation in many vision tasks. This calls for the 3D understanding\ndirectly in this representation space. To facilitate the research in this\ndirection, we first build a large-scale dataset of 3DGS using the commonly used\nShapeNet and ModelNet datasets. Our dataset ShapeSplat consists of 65K objects\nfrom 87 unique categories, whose labels are in accordance with the respective\ndatasets. The creation of this dataset utilized the compute equivalent of 2 GPU\nyears on a TITAN XP GPU.\n  We utilize our dataset for unsupervised pretraining and supervised finetuning\nfor classification and segmentation tasks. To this end, we introduce\n\\textbf{\\textit{Gaussian-MAE}}, which highlights the unique benefits of\nrepresentation learning from Gaussian parameters. Through exhaustive\nexperiments, we provide several valuable insights. In particular, we show that\n(1) the distribution of the optimized GS centroids significantly differs from\nthe uniformly sampled point cloud (used for initialization) counterpart; (2)\nthis change in distribution results in degradation in classification but\nimprovement in segmentation tasks when using only the centroids; (3) to\nleverage additional Gaussian parameters, we propose Gaussian feature grouping\nin a normalized feature space, along with splats pooling layer, offering a\ntailored solution to effectively group and embed similar Gaussians, which leads\nto notable improvement in finetuning tasks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"E7pnVVLgBJttk8oXrdnVVe8YMZlvAoWHK26SlyvIHbg","pdfSize":"5886751"}
