{"id":"2408.00488","title":"Absolute-value based preconditioner for complex-shifted Laplacian\n  systems","authors":"Xuelei Lin, Congcong Li, Sean Hon","authorsParsed":[["Lin","Xuelei",""],["Li","Congcong",""],["Hon","Sean",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 11:49:26 GMT"}],"updateDate":"2024-08-02","timestamp":1722512966000,"abstract":"  The complex-shifted Laplacian systems arising in a wide range of\napplications. In this work, we propose an absolute-value based preconditioner\nfor solving the complex-shifted Laplacian system. In our approach, the\ncomplex-shifted Laplacian system is equivalently rewritten as a $2\\times 2$\nblock real linear system. With the Toeplitz structure of uniform-grid\ndiscretization of the constant-coefficient Laplacian operator, the absolute\nvalue of the block real matrix is fast invertible by means of fast sine\ntransforms. For more general coefficient function, we then average the\ncoefficient function and take the absolute value of the averaged matrix as our\npreconditioner. With assumptions on the complex shift, we theoretically prove\nthat the eigenvalues of the preconditioned matrix in absolute value are upper\nand lower bounded by constants independent of matrix size, indicating a\nmatrix-size independent linear convergence rate of MINRES solver.\nInterestingly, numerical results show that the proposed preconditioner is still\nefficient even if the assumptions on the complex shift are not met. The fast\ninvertibility of the proposed preconditioner and the robust convergence rate of\nthe preconditioned MINRES solver lead to a linearithmic (nearly optimal)\ncomplexity of the proposed solver. The proposed preconditioner is compared with\nseveral state-of-the-art preconditioners via several numerical examples to\ndemonstrate the efficiency of the proposed preconditioner.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"2cX-_RdAifEXv7QfDTv5mUPa2ndC80DJIAnh0XoVzm0","pdfSize":"217733","txDigest":"7erXv14bNiL77mzbMmtyYPNsiDzm9JjkUcCH3rt9ZGYc","endEpoch":"1","status":"CERTIFIED"}
