{"id":"2408.06048","title":"Hungry Professors? Decision Biases Are Less Widespread than Previously\n  Thought","authors":"Katja Bergonzoli, Laurent Bieri, Dominic Rohner, Christian Zehnder","authorsParsed":[["Bergonzoli","Katja",""],["Bieri","Laurent",""],["Rohner","Dominic",""],["Zehnder","Christian",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 10:49:14 GMT"}],"updateDate":"2024-08-13","timestamp":1723459754000,"abstract":"  In many situations people make sequences of similar, but unrelated decisions.\nSuch decision sequences are prevalent in many important contexts including\njudicial judgments, loan approvals, college admissions, and athletic\ncompetitions. A growing literature claims that decisions in such sequences may\nbe severely biased because decision outcomes seem to be systematically affected\nby the scheduling. In particular, it has been argued that mental depletion\nleads to harsher decisions before food breaks and that the ``law of small\nnumbers'' induces decisions to be negatively auto-correlated (i.e. favorable\ndecisions are followed by unfavorable ones and vice versa). These findings have\nattracted much academic and media attention and it has been suspected that they\nmay only represent the ``tip of the iceberg''. However, voices of caution point\nout that existing studies may suffer from serious limitations, because the\ndecision order is not randomly determined, other influencing factors are hard\nto exclude, or direct evidence for the underlying mechanisms is not available.\nWe exploit a large-scale natural experiment in a context in which the previous\nliterature would predict the presence of scheduling biases. Specifically, we\ninvestigate whether the grades of randomly scheduled oral exams in Law School\ndepend on the position of the exam in the sequence. Our rich data enables us to\nfilter-out student, professor, day, and course-specific features. Our results\ncontradict the previous findings and suggest that caution is advised when\ngeneralizing from previous studies for policy advice.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"TTwqgzkYOGNxycdprdL30Qbmm3FFbhbl6v-lOrrQgfE","pdfSize":"186514"}
