{"id":"2408.06411","title":"Thermal false vacuum decay in (1+1)-dimensions: Evidence for\n  non-equilibrium dynamics","authors":"Dalila P\\^irvu, Andrey Shkerin, Sergey Sibiryakov","authorsParsed":[["Pîrvu","Dalila",""],["Shkerin","Andrey",""],["Sibiryakov","Sergey",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-14","timestamp":1723485601000,"abstract":"  We numerically study the evolution of a classical real scalar field in\n${(1+1)}$ dimensions with initial conditions describing thermal fluctuations\naround a metastable vacuum. We track false vacuum decay in real time and\ncompare several observables to the predictions of the standard Euclidean\nformalism. We find agreement for the shape of the critical bubble and the\nexponential suppression of the decay rate. However, the decay rate prefactor is\nalmost an order of magnitude lower than the predicted value. We argue that this\nsignals a breakdown of thermal equilibrium during the bubble nucleation. In\naddition, the inefficient thermalization in the system biases the properties of\nthe statistical ensemble and leads to further decrease of the decay rate with\ntime. We substantiate our interpretation with a suite of stochastic field\nsimulations with controlled thermalization time. Varying this time we find that\nthe predictions of the standard equilibrium formalism are recovered when it is\nsufficiently short. We propose an upper bound on the thermalization time that\nmust be satisfied in order to ensure the applicability of the Euclidean rate\ncalculation. We discuss that this bound is unavoidably violated in common\nsingle-field models, irrespective of the number of spacetime dimensions,\nimplying that deviations from equilibrium in these models cannot be neglected.\nIn theories with multiple fields, the bound may or may not hold, depending on\nthe setup details. We investigate one more signature of non-equilibrium\ndynamics -- coherent oscillonic precursors to the critical bubble nucleation.\nWe show that they get suppressed in the stochastic dynamical simulations when\nthe thermalization time is reduced.\n","subjects":["Physics/High Energy Physics - Theory","Astrophysics/Cosmology and Nongalactic Astrophysics","Condensed Matter/Statistical Mechanics","Physics/High Energy Physics - Lattice","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}