{"id":"2408.06684","title":"How to Best Combine Demosaicing and Denoising?","authors":"Yu Guo, Qiyu Jin, Jean-Michel Morel, Gabriele Facciolo","authorsParsed":[["Guo","Yu",""],["Jin","Qiyu",""],["Morel","Jean-Michel",""],["Facciolo","Gabriele",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 07:23:53 GMT"}],"updateDate":"2024-08-14","timestamp":1723533833000,"abstract":"  Image demosaicing and denoising play a critical role in the raw imaging\npipeline. These processes have often been treated as independent, without\nconsidering their interactions. Indeed, most classic denoising methods handle\nnoisy RGB images, not raw images. Conversely, most demosaicing methods address\nthe demosaicing of noise free images. The real problem is to jointly denoise\nand demosaic noisy raw images. But the question of how to proceed is still not\nyet clarified. In this paper, we carry-out extensive experiments and a\nmathematical analysis to tackle this problem by low complexity algorithms.\nIndeed, both problems have been only addressed jointly by end-to-end heavy\nweight convolutional neural networks (CNNs), which are currently incompatible\nwith low power portable imaging devices and remain by nature domain (or device)\ndependent. Our study leads us to conclude that, with moderate noise,\ndemosaicing should be applied first, followed by denoising. This requires a\nsimple adaptation of classic denoising algorithms to demosaiced noise, which we\njustify and specify. Although our main conclusion is ``demosaic first, then\ndenoise'', we also discover that for high noise, there is a moderate PSNR gain\nby a more complex strategy: partial CFA denoising followed by demosaicing, and\nby a second denoising on the RGB image. These surprising results are obtained\nby a black-box optimization of the pipeline, which could be applied to any\nother pipeline. We validate our results on simulated and real noisy CFA images\nobtained from several benchmarks.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}