{"id":"2408.09619","title":"Statistical Inference for Regression with Imputed Binary Covariates with\n  Application to Emotion Recognition","authors":"Ziqian Lin, Danyang Huang, Ziyu Xiong, Hansheng Wang","authorsParsed":[["Lin","Ziqian",""],["Huang","Danyang",""],["Xiong","Ziyu",""],["Wang","Hansheng",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 00:17:46 GMT"}],"updateDate":"2024-08-20","timestamp":1724026666000,"abstract":"  In the flourishing live streaming industry, accurate recognition of\nstreamers' emotions has become a critical research focus, with profound\nimplications for audience engagement and content optimization. However, precise\nemotion coding typically requires manual annotation by trained experts, making\nit extremely expensive and time-consuming to obtain complete observational data\nfor large-scale studies. Motivated by this challenge in streamer emotion\nrecognition, we develop here a novel imputation method together with a\nprincipled statistical inference procedure for analyzing partially observed\nbinary data. Specifically, we assume for each observation an auxiliary feature\nvector, which is sufficiently cheap to be fully collected for the whole sample.\nWe next assume a small pilot sample with both the target binary covariates\n(i.e., the emotion status) and the auxiliary features fully observed, of which\nthe size could be considerably smaller than that of the whole sample.\nThereafter, a regression model can be constructed for the target binary\ncovariates and the auxiliary features. This enables us to impute the missing\nbinary features using the fully observed auxiliary features for the entire\nsample. We establish the associated asymptotic theory for principled\nstatistical inference and present extensive simulation experiments,\ndemonstrating the effectiveness and theoretical soundness of our proposed\nmethod. Furthermore, we validate our approach using a comprehensive dataset on\nemotion recognition in live streaming, demonstrating that our imputation method\nyields smaller standard errors and is more statistically efficient than using\npilot data only. Our findings have significant implications for enhancing user\nexperience and optimizing engagement on streaming platforms.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}