{"id":"2408.01935","title":"Defining and Evaluating Decision and Composite Risk in Language Models\n  Applied to Natural Language Inference","authors":"Ke Shen, Mayank Kejriwal","authorsParsed":[["Shen","Ke",""],["Kejriwal","Mayank",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 05:24:32 GMT"}],"updateDate":"2024-08-06","timestamp":1722749072000,"abstract":"  Despite their impressive performance, large language models (LLMs) such as\nChatGPT are known to pose important risks. One such set of risks arises from\nmisplaced confidence, whether over-confidence or under-confidence, that the\nmodels have in their inference. While the former is well studied, the latter is\nnot, leading to an asymmetry in understanding the comprehensive risk of the\nmodel based on misplaced confidence. In this paper, we address this asymmetry\nby defining two types of risk (decision and composite risk), and proposing an\nexperimental framework consisting of a two-level inference architecture and\nappropriate metrics for measuring such risks in both discriminative and\ngenerative LLMs. The first level relies on a decision rule that determines\nwhether the underlying language model should abstain from inference. The second\nlevel (which applies if the model does not abstain) is the model's inference.\nDetailed experiments on four natural language commonsense reasoning datasets\nusing both an open-source ensemble-based RoBERTa model and ChatGPT, demonstrate\nthe practical utility of the evaluation framework. For example, our results\nshow that our framework can get an LLM to confidently respond to an extra 20.1%\nof low-risk inference tasks that other methods might misclassify as high-risk,\nand skip 19.8% of high-risk tasks, which would have been answered incorrectly.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oEBm8PkeNAaxWjAsJ7sWDhJ2x2vxpP9KuXmVDWMp5DM","pdfSize":"4534571","txDigest":"E1btvJ4eEsL3oFCTxSRSTWokgEnm71mZaZeSyoyEWEw","endEpoch":"1","status":"CERTIFIED"}
