{"id":"2408.03376","title":"Entanglement-enhanced learning of quantum processes at scale","authors":"Alireza Seif, Senrui Chen, Swarnadeep Majumder, Haoran Liao, Derek S.\n  Wang, Moein Malekakhlagh, Ali Javadi-Abhari, Liang Jiang, Zlatko K. Minev","authorsParsed":[["Seif","Alireza",""],["Chen","Senrui",""],["Majumder","Swarnadeep",""],["Liao","Haoran",""],["Wang","Derek S.",""],["Malekakhlagh","Moein",""],["Javadi-Abhari","Ali",""],["Jiang","Liang",""],["Minev","Zlatko K.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 18:00:20 GMT"}],"updateDate":"2024-08-08","timestamp":1722967220000,"abstract":"  Learning unknown processes affecting a quantum system reveals underlying\nphysical mechanisms and enables suppression, mitigation, and correction of\nunwanted effects. Describing a general quantum process requires an\nexponentially large number of parameters. Measuring these parameters, when they\nare encoded in incompatible observables, is constrained by the uncertainty\nprinciple and requires exponentially many measurements. However, for Pauli\nchannels, having access to an ideal quantum memory and entangling operations\nallows encoding parameters in commuting observables, thereby exponentially\nreducing measurement complexity. In practice, though, quantum memory and\nentangling operations are always noisy and introduce errors, making the\nadvantage of using noisy quantum memory unclear. To address these challenges we\nintroduce error-mitigated entanglement-enhanced learning and show, both\ntheoretically and experimentally, that even with noise, there is a separation\nin efficiency between learning Pauli channels with and without entanglement\nwith noisy quantum memory. We demonstrate our protocol's efficacy in examples\nincluding hypothesis testing with up to 64 qubits and learning inherent noise\nprocesses in a layer of parallel gates using up to 16 qubits on a\nsuperconducting quantum processor. Our protocol provides accurate and practical\ninformation about the process, with an overhead factor of $1.33 \\pm 0.05$ per\nqubit, much smaller than the fundamental lower bound of 2 without entanglement\nwith quantum memory. Our study demonstrates that entanglement with auxiliary\nnoisy quantum memory combined with error mitigation considerably enhances the\nlearning of quantum processes.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}