{"id":"2408.10987","title":"Denoising Plane Wave Ultrasound Images Using Diffusion Probabilistic\n  Models","authors":"Hojat Asgariandehkordi, Sobhan Goudarzi, Mostafa Sharifzadeh, Adrian\n  Basarab, and Hassan Rivaz","authorsParsed":[["Asgariandehkordi","Hojat",""],["Goudarzi","Sobhan",""],["Sharifzadeh","Mostafa",""],["Basarab","Adrian",""],["Rivaz","Hassan",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 16:31:31 GMT"}],"updateDate":"2024-08-21","timestamp":1724171491000,"abstract":"  Ultrasound plane wave imaging is a cutting-edge technique that enables high\nframe-rate imaging. However, one challenge associated with high frame-rate\nultrasound imaging is the high noise associated with them, hindering their\nwider adoption. Therefore, the development of a denoising method becomes\nimperative to augment the quality of plane wave images. Drawing inspiration\nfrom Denoising Diffusion Probabilistic Models (DDPMs), our proposed solution\naims to enhance plane wave image quality. Specifically, the method considers\nthe distinction between low-angle and high-angle compounding plane waves as\nnoise and effectively eliminates it by adapting a DDPM to beamformed\nradiofrequency (RF) data. The method underwent training using only 400\nsimulated images. In addition, our approach employs natural image segmentation\nmasks as intensity maps for the generated images, resulting in accurate\ndenoising for various anatomy shapes. The proposed method was assessed across\nsimulation, phantom, and in vivo images. The results of the evaluations\nindicate that our approach not only enhances image quality on simulated data\nbut also demonstrates effectiveness on phantom and in vivo data in terms of\nimage quality. Comparative analysis with other methods underscores the\nsuperiority of our proposed method across various evaluation metrics. The\nsource code and trained model will be released along with the dataset at:\nhttp://code.sonography.ai\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NcpiG4mFKLAgJ900uDU7_oG3oYR1b8fhi1oGOK_f7pQ","pdfSize":"11049635"}
