{"id":"2408.02073","title":"Case-based reasoning approach for diagnostic screening of children with\n  developmental delays","authors":"Zichen Song, Jiakang Li, Songning Lai, Sitan Huang","authorsParsed":[["Song","Zichen",""],["Li","Jiakang",""],["Lai","Songning",""],["Huang","Sitan",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 04:28:52 GMT"}],"updateDate":"2024-08-06","timestamp":1721276932000,"abstract":"  According to the World Health Organization, the population of children with\ndevelopmental delays constitutes approximately 6% to 9% of the total\npopulation. Based on the number of newborns in Huaibei, Anhui Province, China,\nin 2023 (94,420), it is estimated that there are about 7,500 cases (suspected\ncases of developmental delays) of suspicious cases annually. Early\nidentification and appropriate early intervention for these children can\nsignificantly reduce the wastage of medical resources and societal costs.\nInternational research indicates that the optimal period for intervention in\nchildren with developmental delays is before the age of six, with the golden\ntreatment period being before three and a half years of age. Studies have shown\nthat children with developmental delays who receive early intervention exhibit\nsignificant improvement in symptoms; some may even fully recover. This research\nadopts a hybrid model combining a CNN-Transformer model with Case-Based\nReasoning (CBR) to enhance the screening efficiency for children with\ndevelopmental delays. The CNN-Transformer model is an excellent model for image\nfeature extraction and recognition, effectively identifying features in bone\nage images to determine bone age. CBR is a technique for solving problems based\non similar cases; it solves current problems based on past experiences, similar\nto how humans solve problems through learning from experience. Given CBR's\nmemory capability to judge and compare new cases based on previously stored old\ncases, it is suitable for application in support systems with latent and\nvariable characteristics. Therefore, this study utilizes the\nCNN-Transformer-CBR to establish a screening system for children with\ndevelopmental delays, aiming to improve screening efficiency.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}