{"id":"2408.01876","title":"Selection bias obfuscates the discovery of fast radio burst sources","authors":"Mohit Bhardwaj, Jimin Lee, Kevin Ji","authorsParsed":[["Bhardwaj","Mohit",""],["Lee","Jimin",""],["Ji","Kevin",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 22:49:39 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 13:54:41 GMT"}],"updateDate":"2024-08-07","timestamp":1722725379000,"abstract":"  FRBs are a newly discovered class of extragalactic radio transients\ncharacterised by their high energy and short-duration (~$\\mu$s-ms)[1]. Their\nelusive physical origin remains a subject of ongoing research, with magnetars\nemerging as leading candidates[2],[3]. Previous studies have employed various\nmethodologies to address the FRB origin problem, including demographic analyses\nof FRB host galaxies and their local environments[4]-[6], assessments of FRB\nrate evolution with redshift[7]-[9], and searches for proposed multi-messenger\nFRB counterparts[10]. However, these studies are susceptible to significant\nbiases stemming from unaccounted radio and optical selection effects. Here we\npresent empirical evidence for a substantial selection bias against detecting\nFRBs in galaxies with large inclination angles (edge-on) using a sample of\nhosts identified for FRBs discovered by untargeted surveys. This\ninclination-related bias likely leads to a significant underestimation (by\nabout a factor of two) of the FRB rates reported in the literature and\ndisfavours globular clusters as the dominant origin of FRB sources, as\npreviously speculated[6]. These conclusions have important implications for FRB\nprogenitor models and targeted FRB follow-up strategies. We further investigate\nthe impact of this bias on the relative rate of FRBs in different host\nenvironments. Our analysis suggests that scattering in FRB hosts is likely\nresponsible for the observed bias[11],[12]. However, a larger sample of\nlocalised FRBs is required to robustly quantify its contribution in the\ninclination-related selection bias.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}