{"id":"2408.12630","title":"Improving Typhoon Predictions by Integrating Data-Driven Machine\n  Learning Models with Physics Models Based on the Spectral Nudging and Data\n  Assimilation","authors":"Zeyi Niu, Wei Huang, Lei Zhang, Lin Deng, Haibo Wang, Yuhua Yang,\n  Dongliang Wang, and Hong Li","authorsParsed":[["Niu","Zeyi",""],["Huang","Wei",""],["Zhang","Lei",""],["Deng","Lin",""],["Wang","Haibo",""],["Yang","Yuhua",""],["Wang","Dongliang",""],["Li","Hong",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 04:47:56 GMT"}],"updateDate":"2024-08-26","timestamp":1724302076000,"abstract":"  With the rapid development of data-driven machine learning (ML) models in\nmeteorology, typhoon track forecasts have become increasingly accurate.\nHowever, current ML models still face challenges, such as underestimating\ntyphoon intensity and lacking interpretability. To address these issues, this\nstudy establishes an ML-driven hybrid typhoon model, where forecast fields from\nthe Pangu-Weather model are used to constrain the large-scale forecasts of the\nWeather Research and Forecasting model based on the spectral nudging method\n(Pangu_SP). The results show that forecasts from the Pangu_SP experiment\nobviously outperform those by using the Global Forecast System as the initial\nfield (GFS_INIT) and from the Integrated Forecasting System of the European\nCentre for Medium-Range Weather Forecasts (ECMWF IFS) for the track forecast of\nTyphoon Doksuri (2023). The predicted typhoon cloud patterns from Pangu_SP are\nalso more consistent with satellite observations. Additionally, the typhoon\nintensity forecasts from Pangu_SP are notably more accurate than those from the\nECMWF IFS, demonstrating that the hybrid model effectively leverages the\nstrengths of both ML and physical models. Furthermore, this study is the first\nto explore the significance of data assimilation in ML-driven hybrid dynamical\nsystems. The findings reveal that after assimilating water vapor channels from\nthe Advanced Geostationary Radiation Imager onboard Fengyun-4B, the errors in\ntyphoon intensity forecasts are reduced.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}