{"id":"2408.11910","title":"Why am I Still Seeing This: Measuring the Effectiveness Of Ad Controls\n  and Explanations in AI-Mediated Ad Targeting Systems","authors":"Jane Castleman, Aleksandra Korolova","authorsParsed":[["Castleman","Jane",""],["Korolova","Aleksandra",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 18:03:11 GMT"}],"updateDate":"2024-08-23","timestamp":1724263391000,"abstract":"  Recently, Meta has shifted towards AI-mediated ad targeting mechanisms that\ndo not require advertisers to provide detailed targeting criteria, likely\ndriven by excitement over AI capabilities as well as new data privacy policies\nand targeting changes agreed upon in civil rights settlements. At the same\ntime, Meta has touted their ad preference controls as an effective mechanism\nfor users to control the ads they see. Furthermore, Meta markets their\ntargeting explanations as a transparency tool that allows users to understand\nwhy they saw certain ads and inform actions to control future ads.\n  Our study evaluates the effectiveness of Meta's \"See less\" ad control and the\nactionability of ad targeting explanations following the shift to AI-mediated\ntargeting. We conduct a large-scale study, randomly assigning participants to\nmark \"See less\" to Body Weight Control or Parenting topics, and collecting the\nads and targeting explanations Meta shows to participants before and after the\nintervention. We find that utilizing the \"See less\" ad control for the topics\nwe study does not significantly reduce the number of ads shown by Meta on these\ntopics, and that the control is less effective for some users whose\ndemographics are correlated with the topic. Furthermore, we find that the\nmajority of ad targeting explanations for local ads made no reference to\nlocation-specific targeting criteria, and did not inform users why ads related\nto the topics they marked to \"See less\" of continued to be delivered. We\nhypothesize that the poor effectiveness of controls and lack of actionability\nin explanations are the result of the shift to AI-mediated targeting, for which\nexplainability and transparency tools have not yet been developed. Our work\nthus provides evidence for the need of new methods for transparency and user\ncontrol, suitable and reflective of increasingly complex AI-mediated ad\ndelivery systems.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}