{"id":"2408.09355","title":"Atomic Engineering of Triangular Nanopores in Monolayer hBN: A Decoupled\n  Seeding and Growth Approach","authors":"Dana O. Byrne and Frances I. Allen","authorsParsed":[["Byrne","Dana O.",""],["Allen","Frances I.",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 04:36:18 GMT"}],"updateDate":"2024-08-20","timestamp":1723955778000,"abstract":"  Nanopores in 2D materials are of significant interest in advanced membrane\ntechnologies aimed at the sensing and separation of ions and molecules. These\napplications necessitate 2D nanopores that are precise in size and shape, and\nabundant in number. However, conventional fabrication techniques often struggle\nto achieve both high precision and throughput. In this study, we introduce a\ndecoupled seeding and growth approach designed to overcome this limitation. The\nmethod allows the controlled fabrication of ensembles of nanopores with narrow\nsize distribution and is demonstrated for free-standing monolayer hexagonal\nboron nitride. Using light ion showering, we first create vacancy defect seeds.\nThese seeds are then expanded into triangular nanopores through\nelement-specific preferential atom removal under broad-beam electron\nirradiation in a transmission electron microscope. Nanopore density and size\nare controlled by the ion and electron irradiation doses, respectively. During\nthe electron irradiation step, high-resolution imaging allows real-time\ntracking of the nanopore formation process, enabling the highest level of\ncontrol. An additional workflow is introduced using thermal annealing in air\nfor the nanopore growth step, delivering the most flexible platform for\nnanopore fabrication over larger areas with the significant benefit of\nconcurrently removing surface hydrocarbon contamination to mitigate pore\nclogging and distortion. This study provides researchers with a novel approach\nto create ensembles of meticulously designed nanopores with well-controlled\nsize and geometry, facilitating the development of next-generation membrane\ndevices that will demand high precision and high throughput nanopore\nfabrication pipelines.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}