{"id":"2408.02024","title":"Faster Diffusion Action Segmentation","authors":"Shuaibing Wang, Shunli Wang, Mingcheng Li, Dingkang Yang, Haopeng\n  Kuang, Ziyun Qian, Lihua Zhang","authorsParsed":[["Wang","Shuaibing",""],["Wang","Shunli",""],["Li","Mingcheng",""],["Yang","Dingkang",""],["Kuang","Haopeng",""],["Qian","Ziyun",""],["Zhang","Lihua",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 13:23:18 GMT"}],"updateDate":"2024-08-06","timestamp":1722777798000,"abstract":"  Temporal Action Segmentation (TAS) is an essential task in video analysis,\naiming to segment and classify continuous frames into distinct action segments.\nHowever, the ambiguous boundaries between actions pose a significant challenge\nfor high-precision segmentation. Recent advances in diffusion models have\ndemonstrated substantial success in TAS tasks due to their stable training\nprocess and high-quality generation capabilities. However, the heavy sampling\nsteps required by diffusion models pose a substantial computational burden,\nlimiting their practicality in real-time applications. Additionally, most\nrelated works utilize Transformer-based encoder architectures. Although these\narchitectures excel at capturing long-range dependencies, they incur high\ncomputational costs and face feature-smoothing issues when processing long\nvideo sequences. To address these challenges, we propose EffiDiffAct, an\nefficient and high-performance TAS algorithm. Specifically, we develop a\nlightweight temporal feature encoder that reduces computational overhead and\nmitigates the rank collapse phenomenon associated with traditional\nself-attention mechanisms. Furthermore, we introduce an adaptive skip strategy\nthat allows for dynamic adjustment of timestep lengths based on computed\nsimilarity metrics during inference, thereby further enhancing computational\nefficiency. Comprehensive experiments on the 50Salads, Breakfast, and GTEA\ndatasets demonstrated the effectiveness of the proposed algorithm.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}