{"id":"2408.11349","title":"Image Score: Learning and Evaluating Human Preferences for Mercari\n  Search","authors":"Chingis Oinar and Miao Cao and Shanshan Fu","authorsParsed":[["Oinar","Chingis",""],["Cao","Miao",""],["Fu","Shanshan",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 05:30:06 GMT"}],"updateDate":"2024-08-22","timestamp":1724218206000,"abstract":"  Mercari is the largest C2C e-commerce marketplace in Japan, having more than\n20 million active monthly users. Search being the fundamental way to discover\ndesired items, we have always had a substantial amount of data with implicit\nfeedback. Although we actively take advantage of that to provide the best\nservice for our users, the correlation of implicit feedback for such tasks as\nimage quality assessment is not trivial. Many traditional lines of research in\nMachine Learning (ML) are similarly motivated by the insatiable appetite of\nDeep Learning (DL) models for well-labelled training data. Weak supervision is\nabout leveraging higher-level and/or noisier supervision over unlabeled data.\nLarge Language Models (LLMs) are being actively studied and used for data\nlabelling tasks. We present how we leverage a Chain-of-Thought (CoT) to enable\nLLM to produce image aesthetics labels that correlate well with human behavior\nin e-commerce settings. Leveraging LLMs is more cost-effective compared to\nexplicit human judgment, while significantly improving the explainability of\ndeep image quality evaluation which is highly important for customer journey\noptimization at Mercari. We propose a cost-efficient LLM-driven approach for\nassessing and predicting image quality in e-commerce settings, which is very\nconvenient for proof-of-concept testing. We show that our LLM-produced labels\ncorrelate with user behavior on Mercari. Finally, we show our results from an\nonline experimentation, where we achieved a significant growth in sales on the\nweb platform.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}