{"id":"2408.04887","title":"Relevance Filtering for Embedding-based Retrieval","authors":"Nicholas Rossi, Juexin Lin, Feng Liu, Zhen Yang, Tony Lee, Alessandro\n  Magnani, and Ciya Liao","authorsParsed":[["Rossi","Nicholas",""],["Lin","Juexin",""],["Liu","Feng",""],["Yang","Zhen",""],["Lee","Tony",""],["Magnani","Alessandro",""],["Liao","Ciya",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 06:21:20 GMT"}],"updateDate":"2024-08-12","timestamp":1723184480000,"abstract":"  In embedding-based retrieval, Approximate Nearest Neighbor (ANN) search\nenables efficient retrieval of similar items from large-scale datasets. While\nmaximizing recall of relevant items is usually the goal of retrieval systems, a\nlow precision may lead to a poor search experience. Unlike lexical retrieval,\nwhich inherently limits the size of the retrieved set through keyword matching,\ndense retrieval via ANN search has no natural cutoff. Moreover, the cosine\nsimilarity scores of embedding vectors are often optimized via contrastive or\nranking losses, which make them difficult to interpret. Consequently, relying\non top-K or cosine-similarity cutoff is often insufficient to filter out\nirrelevant results effectively. This issue is prominent in product search,\nwhere the number of relevant products is often small. This paper introduces a\nnovel relevance filtering component (called \"Cosine Adapter\") for\nembedding-based retrieval to address this challenge. Our approach maps raw\ncosine similarity scores to interpretable scores using a query-dependent\nmapping function. We then apply a global threshold on the mapped scores to\nfilter out irrelevant results. We are able to significantly increase the\nprecision of the retrieved set, at the expense of a small loss of recall. The\neffectiveness of our approach is demonstrated through experiments on both\npublic MS MARCO dataset and internal Walmart product search data. Furthermore,\nonline A/B testing on the Walmart site validates the practical value of our\napproach in real-world e-commerce settings.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}