{"id":"2408.07705","title":"Enhancing Supply Chain Visibility with Knowledge Graphs and Large\n  Language Models","authors":"Sara AlMahri, Liming Xu, Alexandra Brintrup","authorsParsed":[["AlMahri","Sara",""],["Xu","Liming",""],["Brintrup","Alexandra",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 17:11:29 GMT"}],"updateDate":"2024-08-16","timestamp":1722877889000,"abstract":"  In today's globalized economy, comprehensive supply chain visibility is\ncrucial for effective risk management. Achieving visibility remains a\nsignificant challenge due to limited information sharing among supply chain\npartners. This paper presents a novel framework leveraging Knowledge Graphs\n(KGs) and Large Language Models (LLMs) to enhance supply chain visibility\nwithout relying on direct stakeholder information sharing. Our zero-shot,\nLLM-driven approach automates the extraction of supply chain information from\ndiverse public sources and constructs KGs to capture complex interdependencies\nbetween supply chain entities. We employ zero-shot prompting for Named Entity\nRecognition (NER) and Relation Extraction (RE) tasks, eliminating the need for\nextensive domain-specific training. We validate the framework with a case study\non electric vehicle supply chains, focusing on tracking critical minerals for\nbattery manufacturing. Results show significant improvements in supply chain\nmapping, extending visibility beyond tier-2 suppliers. The framework reveals\ncritical dependencies and alternative sourcing options, enhancing risk\nmanagement and strategic planning. With high accuracy in NER and RE tasks, it\nprovides an effective tool for understanding complex, multi-tiered supply\nnetworks. This research offers a scalable, flexible method for constructing\ndomain-specific supply chain KGs, addressing longstanding challenges in\nvisibility and paving the way for advancements in digital supply chain\nsurveillance.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Yauls_FYjH-G96MKcIfDjas6G8B1DCev7FrxGtN3k2A","pdfSize":"11307900"}
