{"id":"2408.15157","title":"Simulation of Stochastic Discrete Dislocation Dynamics in Ductile Vs\n  Brittle Materials","authors":"Santosh Chhetri, Maryam Naghibolhosseini, Mohsen Zayernouri","authorsParsed":[["Chhetri","Santosh",""],["Naghibolhosseini","Maryam",""],["Zayernouri","Mohsen",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 15:52:29 GMT"}],"updateDate":"2024-08-28","timestamp":1724773949000,"abstract":"  Defects are inevitable during the manufacturing processes of materials.\nPresence of these defects and their dynamics significantly influence the\nresponses of materials. A thorough understanding of dislocation dynamics of\ndifferent types of materials under various conditions is essential for\nanalyzing the performance of the materials. Ductility of a material is directly\nrelated with the movement and rearrangement of dislocations under applied load.\nIn this work, we look into the dynamics of dislocations in ductile and brittle\nmaterials using simplified two dimensional discrete dislocation dynamics\n(2D-DDD) simulation. We consider Aluminium (Al) and Tungsten (W) as\nrepresentative examples of ductile and brittle materials respectively. We study\nthe velocity distribution, strain field, dislocation count, and junction\nformation during interactions of the dislocations within the domain.\nFurthermore, we study the probability densities of dislocation motion for both\nmaterials. In mesoscale, moving dislocations can be considered as particle\ndiffusionm, which are often stochastic and super-diffusive. Classical diffusion\nmodels fail to account for these phenomena and the long-range interactions of\ndislocations. Therefore, we propose the nonlocal transport model for the\nprobability density and obtained the parameters of nonlocal operators using a\nmachine learning framework.\n","subjects":["Condensed Matter/Materials Science","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}