{"id":"2408.02825","title":"On the Variability of AI-based Software Systems Due to Environment\n  Configurations","authors":"Musfiqur Rahman, SayedHassan Khatoonabadi, Ahmad Abdellatif, Haya\n  Samaana, Emad Shihab","authorsParsed":[["Rahman","Musfiqur",""],["Khatoonabadi","SayedHassan",""],["Abdellatif","Ahmad",""],["Samaana","Haya",""],["Shihab","Emad",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 20:47:14 GMT"}],"updateDate":"2024-08-23","timestamp":1722890834000,"abstract":"  [Context] Nowadays, many software systems include Artificial Intelligence\n(AI) components and changes in the development environment have been known to\ninduce variability in an AI-based system. [Objective] However, how an\nenvironment configuration impacts the variability of these systems is yet to be\nexplored. Understanding and quantifying the degree of variability due to such\nconfigurations can help practitioners decide the best environment configuration\nfor the most stable AI products. [Method] To achieve this goal, we performed\nexperiments with eight different combinations of three key environment\nvariables (operating system, Python version, and CPU architecture) on 30\nopen-source AI-based systems using the Travis CI platform. We evaluate\nvariability using three metrics: the output of an AI component like an ML model\n(performance), the time required to build and run a system (processing time),\nand the cost associated with building and running a system (expense). [Results]\nOur results indicate that variability exists in all three metrics; however, it\nis observed more frequently with respect to processing time and expense than\nperformance. For example, between Linux and MacOS, variabilities are observed\nin 23%, 96.67%, and 100% of the studied projects in performance, processing\ntime, and expense, respectively. [Conclusion] Our findings underscore the\nimportance of identifying the optimal combination of configuration settings to\nmitigate performance drops and reduce retraining time and cost before deploying\nan AI-based system.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0lUY9x3nraly4dUjIMsYjX-ZE5dqjRLDtojiWfnQdj0","pdfSize":"480005"}
