{"id":"2408.06128","title":"Effect of low-temperature compression on superconductivity and crystal\n  structure in strontium metal","authors":"J. Lim, S. Sinha, D. E. Jackson, R. S. Kumar, C. Park, R. J. Hemley,\n  D. VanGennep, Y. K. Vohra, R. G. Hennig, P. J. Hirschfeld, G. R. Stewart, J.\n  J. Hamlin","authorsParsed":[["Lim","J.",""],["Sinha","S.",""],["Jackson","D. E.",""],["Kumar","R. S.",""],["Park","C.",""],["Hemley","R. J.",""],["VanGennep","D.",""],["Vohra","Y. K.",""],["Hennig","R. G.",""],["Hirschfeld","P. J.",""],["Stewart","G. R.",""],["Hamlin","J. J.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 13:13:52 GMT"}],"updateDate":"2024-08-13","timestamp":1723468432000,"abstract":"  The superconducting and structural properties of elemental strontium metal\nwere investigated under pressures up to 60 GPa while maintaining cryogenic\nconditions during pressure application. Applying pressure at low temperatures\nreveals differences in superconducting and structural phases compared to\nprevious reports obtained at room temperatures. Notably, the superconducting\ncritical temperature exhibits a twofold increase under compression after\ncryogenic cooling within the pressure range of 35-42 GPa, compared to cryogenic\ncooling after room-temperature compression. Subsequently, the transition width\nbecomes significantly sharper above 42 GPa. Low-temperature X-ray diffraction\nmeasurements under pressure reveal that this change corresponds to the Sr-III\nto Sr-IV transition, with no evidence of any metastable structure. Furthermore,\nthe monoclinic Sr-IV structure was observed to remain stable to much higher\npressures - at least up to 60 GPa, without the appearance of the incommensurate\nSr-V phase present at room temperature. This implies that thermal activation\nenergy plays an important role in overcoming the presence of a kinetic barrier\nto the Sr-V phase at room temperature.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"djVLroV6Rd0i8zpwN6taOTs2Bw48sr8jNJ3uzPYIbVs","pdfSize":"3218909"}
