{"id":"2408.16298","title":"Online Probabilistic Metric Embedding: A General Framework for Bypassing\n  Inherent Bounds","authors":"Yair Bartal and Ora N. Fandina and Seeun William Umboh","authorsParsed":[["Bartal","Yair",""],["Fandina","Ora N.",""],["Umboh","Seeun William",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 06:56:59 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 05:51:44 GMT"}],"updateDate":"2024-09-02","timestamp":1724914619000,"abstract":"  Probabilistic metric embedding into trees is a powerful technique for\ndesigning online algorithms. The standard approach is to embed the entire\nunderlying metric into a tree metric and then solve the problem on the latter.\nThe overhead in the competitive ratio depends on the expected distortion of the\nembedding, which is logarithmic in $n$, the size of the underlying metric. For\nmany online applications, such as online network design problems, it is natural\nto ask if it is possible to construct such embeddings in an online fashion such\nthat the distortion would be a polylogarithmic function of $k$, the number of\nterminals.\n  Our first main contribution is answering this question negatively, exhibiting\na \\emph{lower bound} of $\\tilde{\\Omega}(\\log k \\log \\Phi)$, where $\\Phi$ is the\naspect ratio of the set of terminals, showing that a simple modification of the\nprobabilistic embedding into trees of Bartal (FOCS 1996), which has expected\ndistortion of $O(\\log k \\log \\Phi)$, is \\emph{nearly-tight}. Unfortunately,\nthis may result in a very bad dependence in terms of $k$, namely, a power of\n$k$.\n  Our second main contribution is a general framework for bypassing this\nlimitation. We show that for a large class of online problems this online\nprobabilistic embedding can still be used to devise an algorithm with\n$O(\\min\\{\\log k\\log (k\\lambda),\\log^3 k\\})$ overhead in the competitive ratio,\nwhere $k$ is the current number of terminals, and $\\lambda$ is a measure of\nsubadditivity of the cost function, which is at most $r$, the current number of\nrequests. In particular, this implies the first algorithms with competitive\nratio $\\operatorname{polylog}(k)$ for online subadditive network design\n(buy-at-bulk network design being a special case), and\n$\\operatorname{polylog}(k,r)$ for online group Steiner forest.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}