{"id":"2408.11106","title":"Highly correlated optomechanical oscillations manifested by an anomalous\n  stabilization","authors":"Jinlian Zhang, Miguel Orszag, Min Xiao, Xiaoshun Jiang, Qing Lin, and\n  Bing He","authorsParsed":[["Zhang","Jinlian",""],["Orszag","Miguel",""],["Xiao","Min",""],["Jiang","Xiaoshun",""],["Lin","Qing",""],["He","Bing",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 18:00:46 GMT"}],"updateDate":"2024-09-06","timestamp":1724176846000,"abstract":"  Driven by a sufficiently powerful pump laser, a cavity optomechanical system\nwill stabilize in coupled oscillations of its cavity field and mechanical\nresonator. It was assumed that the oscillation will be continuously magnified\nupon enhancing the driving laser further. However, based on the nonlinear\ndynamics of the system, we find that the dynamical behaviors of the system are\nmuch more complex than this intuitive picture, especially when it is operated\nnear the blue detuning point by the mechanical resonator's intrinsic frequency.\nThere exists an anomalous stabilization: depending on its intrinsic damping\nrate and the pump power, the mechanical resonator will metastably stay on one\norbit of oscillation after another until it completely stabilizes on the final\norbit it can reach. These orbits are consistent with the locked ones with\nalmost fixed oscillation amplitudes, which are realized after the pump power\nbecomes still higher. The oscillatory cavity field is seen to adjust its\nsidebands following the mechanical frequency shift due to optical spring\neffect, so that it always drives the mechanical resonator to near those locked\norbits once the pump power is over a threshold. In the regimes with such\ncorrelation between cavity field sidebands and mechanical oscillation, the\nsystem's dynamical attractors are confined on the locked orbits and chaotic\nmotion is also excluded.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"QPnmgchBxuMZ_jAZt3WjjSsgxLqnoISyXDjtwdXe27Y","pdfSize":"20521625"}
