{"id":"2408.15233","title":"Signatures of Chiral Superconductivity in Rhombohedral Graphene","authors":"Tonghang Han, Zhengguang Lu, Yuxuan Yao, Lihan Shi, Jixiang Yang,\n  Junseok Seo, Shenyong Ye, Zhenghan Wu, Muyang Zhou, Haoyang Liu, Gang Shi,\n  Zhenqi Hua, Kenji Watanabe, Takashi Taniguchi, Peng Xiong, Liang Fu, Long Ju","authorsParsed":[["Han","Tonghang",""],["Lu","Zhengguang",""],["Yao","Yuxuan",""],["Shi","Lihan",""],["Yang","Jixiang",""],["Seo","Junseok",""],["Ye","Shenyong",""],["Wu","Zhenghan",""],["Zhou","Muyang",""],["Liu","Haoyang",""],["Shi","Gang",""],["Hua","Zhenqi",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Xiong","Peng",""],["Fu","Liang",""],["Ju","Long",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 17:50:09 GMT"}],"updateDate":"2024-08-28","timestamp":1724781009000,"abstract":"  Chiral superconductors are unconventional superconducting states that break\ntime reversal symmetry spontaneously and typically feature Cooper pairing at\nnon-zero angular momentum. Such states may host Majorana fermions and provide\nan important platform for topological physics research and fault-tolerant\nquantum computing. Despite of intensive search and prolonged studies of several\ncandidate systems, chiral superconductivity has remained elusive so far. Here\nwe report the discovery of unconventional superconductivity in rhombohedral\ntetra-layer graphene. We observed two superconducting states in the\ngate-induced flat conduction bands with Tc up to 300 mK and charge density ne\nas low as 2.4*1011 cm-2, appearing robustly in three different devices, where\nelectrons reside close to a proximate WSe2 layer, far away from WSe2, and in\nthe absence of WSe2 respectively. Spontaneous time-reversal-symmetry-breaking\n(TRSB) due to electron's orbital motion is found, and several observations\nindicate the chiral nature of these superconducting states, including 1. In the\nsuperconducting state, Rxx shows fluctuations at zero magnetic field and\nmagnetic hysteresis versus an out-of-plane magnetic field B, which are absent\nfrom all other superconductors; 2. one superconducting state develops within a\nspin- and valley-polarized quarter-metal phase, and is robust against the\nneighboring spin-valley-polarized quarter-metal state under B; 3. the normal\nstates show anomalous Hall signals at zero magnetic field and magnetic\nhysteresis. We also observed a critical B > 0.9 Tesla, higher than any graphene\nsuperconductivity reported so far and indicates a strong-coupling\nsuperconductivity close the BCS-BEC crossover. Our observations establish a\npure carbon material for the study of topological superconductivity, and pave\nthe way to explore Majorana modes and topological quantum computing.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0oDO5ImDd_vfpB2qDlmAcm80a_K6kLfLDsE_GXJmN8c","pdfSize":"4742388"}
