{"id":"2408.17233","title":"A methodological framework for Resilience as a Service (RaaS) in\n  multimodal urban transportation networks","authors":"Sara Jaber (Univ. Gustave Eiffel, COSYS, GRETTIA, Paris, France and\n  VEDECOM, mobiLAB, Department of new solutions of mobility services and shared\n  energy, Versailles, France), Mostafa Ameli (Univ. Gustave Eiffel, COSYS,\n  GRETTIA, Paris, France), S. M. Hassan Mahdavi (VEDECOM, mobiLAB, Department\n  of new solutions of mobility services and shared energy, Versailles, France),\n  Neila Bhouri (Univ. Gustave Eiffel, COSYS, GRETTIA, Paris, France)","authorsParsed":[["Jaber","Sara","","Univ. Gustave Eiffel, COSYS, GRETTIA, Paris, France and\n  VEDECOM, mobiLAB, Department of new solutions of mobility services and shared\n  energy, Versailles, France"],["Ameli","Mostafa","","Univ. Gustave Eiffel, COSYS,\n  GRETTIA, Paris, France"],["Mahdavi","S. M. Hassan","","VEDECOM, mobiLAB, Department\n  of new solutions of mobility services and shared energy, Versailles, France"],["Bhouri","Neila","","Univ. Gustave Eiffel, COSYS, GRETTIA, Paris, France"]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 12:22:34 GMT"}],"updateDate":"2024-09-02","timestamp":1725020554000,"abstract":"  Public transportation systems are experiencing an increase in commuter\ntraffic. This increase underscores the need for resilience strategies to manage\nunexpected service disruptions, ensuring rapid and effective responses that\nminimize adverse effects on stakeholders and enhance the system's ability to\nmaintain essential functions and recover quickly. This study aims to explore\nthe management of public transport disruptions through resilience as a service\n(RaaS) strategies, developing an optimization model to effectively allocate\nresources and minimize the cost for operators and passengers. The proposed\nmodel includes multiple transportation options, such as buses, taxis, and\nautomated vans, and evaluates them as bridging alternatives to rail-disrupted\nservices based on factors such as their availability, capacity, speed, and\nproximity to the disrupted station. This ensures that the most suitable\nvehicles are deployed to maintain service continuity. Applied to a case study\nin the Ile de France region, Paris and suburbs, complemented by a microscopic\nsimulation, the model is compared to existing solutions such as bus bridging\nand reserve fleets. The results highlight the model's performance in minimizing\ncosts and enhancing stakeholder satisfaction, optimizing transport management\nduring disruptions.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}