{"id":"2408.02269","title":"Nonlinear Perturbation-based Non-Convex Optimization over Time-Varying\n  Networks","authors":"Mohammadreza Doostmohammadian, Zulfiya R. Gabidullina, Hamid R. Rabiee","authorsParsed":[["Doostmohammadian","Mohammadreza",""],["Gabidullina","Zulfiya R.",""],["Rabiee","Hamid R.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 06:56:29 GMT"}],"updateDate":"2024-08-06","timestamp":1722840989000,"abstract":"  Decentralized optimization strategies are helpful for various applications,\nfrom networked estimation to distributed machine learning. This paper studies\nfinite-sum minimization problems described over a network of nodes and proposes\na computationally efficient algorithm that solves distributed convex problems\nand optimally finds the solution to locally non-convex objective functions. In\ncontrast to batch gradient optimization in some literature, our algorithm is on\na single-time scale with no extra inner consensus loop. It evaluates one\ngradient entry per node per time. Further, the algorithm addresses link-level\nnonlinearity representing, for example, logarithmic quantization of the\nexchanged data or clipping of the exchanged data bits. Leveraging\nperturbation-based theory and algebraic Laplacian network analysis proves\noptimal convergence and dynamics stability over time-varying and switching\nnetworks. The time-varying network setup might be due to packet drops or link\nfailures. Despite the nonlinear nature of the dynamics, we prove exact\nconvergence in the face of odd sign-preserving sector-bound nonlinear data\ntransmission over the links. Illustrative numerical simulations further\nhighlight our contributions.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"n1BqLyp-vQNGD_o_A8MGm-QRpbnr35GpOKxSZMgZS1I","pdfSize":"1952462"}
