{"id":"2408.02337","title":"Developing PUGG for Polish: A Modern Approach to KBQA, MRC, and IR\n  Dataset Construction","authors":"Albert Sawczyn, Katsiaryna Viarenich, Konrad Wojtasik, Aleksandra\n  Domoga{\\l}a, Marcin Oleksy, Maciej Piasecki, Tomasz Kajdanowicz","authorsParsed":[["Sawczyn","Albert",""],["Viarenich","Katsiaryna",""],["Wojtasik","Konrad",""],["Domogała","Aleksandra",""],["Oleksy","Marcin",""],["Piasecki","Maciej",""],["Kajdanowicz","Tomasz",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 09:23:49 GMT"}],"updateDate":"2024-08-06","timestamp":1722849829000,"abstract":"  Advancements in AI and natural language processing have revolutionized\nmachine-human language interactions, with question answering (QA) systems\nplaying a pivotal role. The knowledge base question answering (KBQA) task,\nutilizing structured knowledge graphs (KG), allows for handling extensive\nknowledge-intensive questions. However, a significant gap exists in KBQA\ndatasets, especially for low-resource languages. Many existing construction\npipelines for these datasets are outdated and inefficient in human labor, and\nmodern assisting tools like Large Language Models (LLM) are not utilized to\nreduce the workload. To address this, we have designed and implemented a\nmodern, semi-automated approach for creating datasets, encompassing tasks such\nas KBQA, Machine Reading Comprehension (MRC), and Information Retrieval (IR),\ntailored explicitly for low-resource environments. We executed this pipeline\nand introduced the PUGG dataset, the first Polish KBQA dataset, and novel\ndatasets for MRC and IR. Additionally, we provide a comprehensive\nimplementation, insightful findings, detailed statistics, and evaluation of\nbaseline models.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"-hLgym0V3K9hzFoXaf0K_oITy6cxrrLKvwveOp3r50E","pdfSize":"726381"}
