{"id":"2408.10861","title":"DVRP-MHSI: Dynamic Visualization Research Platform for Multimodal\n  Human-Swarm Interaction","authors":"Pengming Zhu, Zhiwen Zeng, Weijia Yao, Wei Dai, Huimin Lu, and Zongtan\n  Zhou","authorsParsed":[["Zhu","Pengming",""],["Zeng","Zhiwen",""],["Yao","Weijia",""],["Dai","Wei",""],["Lu","Huimin",""],["Zhou","Zongtan",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 13:52:41 GMT"}],"updateDate":"2024-08-21","timestamp":1724161961000,"abstract":"  In recent years, there has been a significant amount of research on\nalgorithms and control methods for distributed collaborative robots. However,\nthe emergence of collective behavior in a swarm is still difficult to predict\nand control. Nevertheless, human interaction with the swarm helps render the\nswarm more predictable and controllable, as human operators can utilize\nintuition or knowledge that is not always available to the swarm. Therefore,\nthis paper designs the Dynamic Visualization Research Platform for Multimodal\nHuman-Swarm Interaction (DVRP-MHSI), which is an innovative open system that\ncan perform real-time dynamic visualization and is specifically designed to\naccommodate a multitude of interaction modalities (such as brain-computer,\neye-tracking, electromyographic, and touch-based interfaces), thereby\nexpediting progress in human-swarm interaction research. Specifically, the\nplatform consists of custom-made low-cost omnidirectional wheeled mobile\nrobots, multitouch screens and two workstations. In particular, the mutitouch\nscreens can recognize human gestures and the shapes of objects placed on them,\nand they can also dynamically render diverse scenes. One of the workstations\nprocesses communication information within robots and the other one implements\nhuman-robot interaction methods. The development of DVRP-MHSI frees researchers\nfrom hardware or software details and allows them to focus on versatile swarm\nalgorithms and human-swarm interaction methods without being limited to fixed\nscenarios, tasks, and interfaces. The effectiveness and potential of the\nplatform for human-swarm interaction studies are validated by several\ndemonstrative experiments.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}