{"id":"2408.11086","title":"A dissipation-induced superradiant transition in a strontium cavity-QED\n  system","authors":"Eric Yilun Song, Diego Barberena, Dylan J. Young, Edwin Chaparro,\n  Anjun Chu, Sanaa Agarwal, Zhijing Niu, Jeremy T. Young, Ana Maria Rey, and\n  James K. Thompson","authorsParsed":[["Song","Eric Yilun",""],["Barberena","Diego",""],["Young","Dylan J.",""],["Chaparro","Edwin",""],["Chu","Anjun",""],["Agarwal","Sanaa",""],["Niu","Zhijing",""],["Young","Jeremy T.",""],["Rey","Ana Maria",""],["Thompson","James K.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 18:00:00 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 03:06:08 GMT"}],"updateDate":"2024-08-28","timestamp":1724176800000,"abstract":"  In cavity quantum electrodynamics (QED), emitters and a resonator are coupled\ntogether to enable precise studies of quantum light-matter interactions. Over\nthe past few decades, this has led to a variety of quantum technologies such as\nmore precise inertial sensors, clocks, memories, controllable qubits, and\nquantum simulators. Furthermore, the intrinsically dissipative nature of cavity\nQED platforms makes them a natural testbed for exploring driven-dissipative\nphenomena in open quantum systems as well as equilibrium and non-equilibrium\nphase transitions in quantum optics. One such model, the so-called cooperative\nresonance fluorescence (CRF) model, concerns the behavior of coherently driven\nemitters in the presence of collective dissipation (superradiance). Despite\ntremendous interest, this model has yet to be realized in a clean experimental\nsystem. Here we provide an observation of the continuous superradiant phase\ntransition predicted in the CRF model using an ensemble of ultracold $^{88}$Sr\natoms coupled to a driven high-finesse optical cavity on a long-lived optical\ntransition. Below a critical drive, atoms quickly reach a steady state\ndetermined by the self-balancing of the drive and the collective dissipation.\nThe steady state possesses a macroscopic dipole moment and corresponds to a\nsuperradiant phase. Above a critical drive strength, the atoms undergo\npersistent Rabi-like oscillations until other decoherence processes kick in. In\nfact, our platform also allows us to witness the change of this phase\ntransition from second to first order induced by single-particle spontaneous\nemission, which pushes the system towards a different steady state. Our\nobservations are a first step towards finer control of driven-dissipative\nsystems, which have been predicted to generate quantum states that can be\nharnessed for quantum information processing and in particular quantum sensing.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Quantum Gases","Physics/Atomic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}