{"id":"2408.06489","title":"Path Partitions of Phylogenetic Networks","authors":"Manuel Lafond, Vincent Moulton","authorsParsed":[["Lafond","Manuel",""],["Moulton","Vincent",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 20:51:31 GMT"}],"updateDate":"2024-08-14","timestamp":1723495891000,"abstract":"  In phylogenetics, evolution is traditionally represented in a tree-like\nmanner. However, phylogenetic networks can be more appropriate for representing\nevolutionary events such as hybridization, horizontal gene transfer, and\nothers. In particular, the class of forest-based networks was recently\nintroduced to represent introgression, in which genes are swapped between\nbetween species. A network is forest-based if it can be obtained by adding arcs\nto a collection of trees, so that the endpoints of the new arcs are in\ndifferent trees. This contrasts with so-called tree-based networks, which are\nformed by adding arcs within a single tree.\n  We are interested in the computational complexity of recognizing forest-based\nnetworks, which was recently left as an open problem by Huber et al.\nForest-based networks coincide with directed acyclic graphs that can be\npartitioned into induced paths, each ending at a leaf of the original graph.\nSeveral types of path partitions have been studied in the graph theory\nliterature, but to our knowledge this type of leaf induced path partition has\nnot been considered before. The study of forest-based networks in terms of\nthese partitions allows us to establish closer relationships between\nphylogenetics and algorithmic graph theory, and to provide answers to problems\nin both fields.\n  We show that deciding whether a network is forest-based is NP-complete, even\non input networks that are tree-based, binary, and have only three leaves. This\nshows that partitioning a directed acyclic graph into three induced paths is\nNP-complete, answering a recent question of Ferneau et al. We then show that\nthe problem is polynomial-time solvable on binary networks with two leaves and\non the class of orchards. Finally, for undirected graphs, we introduce unrooted\nforest-based networks and provide hardness results for this class as well.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}