{"id":"2408.08394","title":"A topological Hund nodal line antiferromagnet","authors":"Xian P. Yang, Yueh-Ting Yao, Pengyu Zheng, Shuyue Guan, Huibin Zhou,\n  Tyler A. Cochran, Che-Min Lin, Jia-Xin Yin, Xiaoting Zhou, Zi-Jia Cheng,\n  Zhaohu Li, Tong Shi, Md Shafayat Hossain, Shengwei Chi, Ilya Belopolski,\n  Yu-Xiao Jiang, Maksim Litskevich, Gang Xu, Zhaoming Tian, Arun Bansil,\n  Zhiping Yin, Shuang Jia, Tay-Rong Chang, M. Zahid Hasan","authorsParsed":[["Yang","Xian P.",""],["Yao","Yueh-Ting",""],["Zheng","Pengyu",""],["Guan","Shuyue",""],["Zhou","Huibin",""],["Cochran","Tyler A.",""],["Lin","Che-Min",""],["Yin","Jia-Xin",""],["Zhou","Xiaoting",""],["Cheng","Zi-Jia",""],["Li","Zhaohu",""],["Shi","Tong",""],["Hossain","Md Shafayat",""],["Chi","Shengwei",""],["Belopolski","Ilya",""],["Jiang","Yu-Xiao",""],["Litskevich","Maksim",""],["Xu","Gang",""],["Tian","Zhaoming",""],["Bansil","Arun",""],["Yin","Zhiping",""],["Jia","Shuang",""],["Chang","Tay-Rong",""],["Hasan","M. Zahid",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 19:36:38 GMT"}],"updateDate":"2024-08-19","timestamp":1723750598000,"abstract":"  The interplay of topology, magnetism, and correlations gives rise to\nintriguing phases of matter. In this study, through state-of-the-art\nangle-resolved photoemission spectroscopy, density functional theory and\ndynamical mean-field theory calculations, we visualize a fourfold degenerate\nDirac nodal line at the boundary of the bulk Brillouin zone in the\nantiferromagnet YMn2Ge2. We further demonstrate that this gapless,\nantiferromagnetic Dirac nodal line is enforced by the combination of magnetism,\nspace-time inversion symmetry and nonsymmorphic lattice symmetry. The\ncorresponding drumhead surface states traverse the whole surface Brillouin\nzone. YMn2Ge2 thus serves as a platform to exhibit the interplay of multiple\ndegenerate nodal physics and antiferromagnetism. Interestingly, the magnetic\nnodal line displays a d-orbital dependent renormalization along its trajectory\nin momentum space, thereby manifesting Hund coupling. Our findings offer\ninsights into the effect of electronic correlations on magnetic Dirac nodal\nlines, leading to an antiferromagnetic Hund nodal line.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}