{"id":"2408.08051","title":"Coexisting polarization mechanisms in ferroelectric uniaxial tetragonal\n  tungsten bronze Ca_0.3Ba_0.7Nb_2O_6","authors":"E. Buixaderas, \\v{S}. Svirskas, C. Kadlec, M. Savinov, P. Lapienyt\\.e,\n  Anirudh K.R., C. Milesi-Brault, D. Nuzhnyy, J. Dec","authorsParsed":[["Buixaderas","E.",""],["Svirskas","Š.",""],["Kadlec","C.",""],["Savinov","M.",""],["Lapienytė","P.",""],["R.","Anirudh K.",""],["Milesi-Brault","C.",""],["Nuzhnyy","D.",""],["Dec","J.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 09:41:57 GMT"}],"updateDate":"2024-08-16","timestamp":1723714917000,"abstract":"  Using a broad band dielectric spectroscopy approach (1 to 10^14 Hz) we prove\nthat the tungsten bronze Ca0.3Ba0.7Nb2O6 (CBN-30) displays a ferroelectric\nphase transition of mixed displacive and order-disorder character, and its\nparaelectric phase does not show traces of relaxor behaviour but precursor\neffects as polar fluctuations below about 550 K. The analysis of the sub-MHz\ndielectric response together with infrared and Raman spectroscopy reveals that\nsimultaneous polarization mechanisms are responsible for the phase transition.\nThe comparison of the excitations found in CBN-30 with those of (Sr,Ba)Nb2O6\nreveals that these mechanisms are congruous, although in CBN-30 the main\nrelaxation process behaves differently due to the different domain structure.\nThe excitations are phenomenologically assigned to phonons, to an anharmonic\nvibration of cationic origin which plays the role of a soft central mode, and\nto a relaxation in the GHz range probably due to polarization fluctuations of\nnanometric size which carries the main part of the permittivity and splits\nbelow TC into several weaker excitations with different polarization\ncorrelation lengths. The overall dielectric response is therefore explained by\nthe coexistence of several excitations with different thermal behaviors,\ncorroborating the complexity of the tetragonal tungsten bronze structures.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}