{"id":"2408.01806","title":"Algebraic Geometry Codes for Distributed Matrix Multiplication Using\n  Local Expansions","authors":"Jiang Li and Songsong Li and Chaoping Xing","authorsParsed":[["Li","Jiang",""],["Li","Songsong",""],["Xing","Chaoping",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 15:22:11 GMT"}],"updateDate":"2024-08-06","timestamp":1722698531000,"abstract":"  Code-based Distributed Matrix Multiplication (DMM) has been extensively\nstudied in distributed computing for efficiently performing large-scale matrix\nmultiplication using coding theoretic techniques. The communication cost and\nrecovery threshold (i.e., the least number of successful worker nodes required\nto recover the product of two matrices) are two major challenges in coded DMM\nresearch. Several constructions based on Reed-Solomon (RS) codes are known,\nincluding Polynomial codes, MatDot codes, and PolyDot codes. However, these\nRS-based schemes are not efficient for small finite fields because the\ndistributed order (i.e., the total number of worker nodes) is limited by the\nsize of the underlying finite field. Algebraic geometry (AG) codes can have a\ncode length exceeding the size of the finite field, which helps solve this\nproblem. Some work has been done to generalize Polynomial and MatDot codes to\nAG codes, but the generalization of PolyDot codes to AGcodes still remains an\nopen problem as far as we know. This is because functions of an algebraic curve\ndo not behave as nicely as polynomials.\n  In this work, by using local expansions of functions, we are able to\ngeneralize the three DMM schemes based on RS codes to AG codes. Specifically,\nwe provide a construction of AG-based PolyDot codes for the first time. In\naddition, our AG-based Polynomial and MatDot codes achieve better recovery\nthresholds compared to previous AG-based DMM schemes while maintaining similar\ncommunication costs. Our constructions are based on a novel basis of the\nRiemann-Roch space using local expansions, which naturally generalizes the\nstandard monomial basis of the univariate polynomial space in RS codes. In\ncontrast, previous work used the non-gap numbers to construct a basis of the\nRiemann-Roch space, which can cause cancellation problems that prevent the\nconditions of PolyDot codes from being satisfied.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}