{"id":"2408.10486","title":"Revisiting Evolutionary Program Repair via Code Language Model","authors":"Yunan Wang, Tingyu Guo, Zilong Huang, Yuan Yuan","authorsParsed":[["Wang","Yunan",""],["Guo","Tingyu",""],["Huang","Zilong",""],["Yuan","Yuan",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 01:57:45 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 08:01:49 GMT"}],"updateDate":"2024-08-27","timestamp":1724119065000,"abstract":"  Software defects are an inherent part of software development and\nmaintenance. To address these defects, Automated Program Repair (APR) has been\ndeveloped to fix bugs automatically. With the advent of Large Language Models,\nCode Language Models (CLMs) trained on code corpora excels in code generation,\nmaking them suitable for APR applications. Despite this progress, a significant\nlimitation remains: many bugs necessitate multi-point edits for repair, yet\ncurrent CLM-based APRs are restricted to single-point bug fixes, which severely\nnarrows the scope of repairable bugs. Moreover, these tools typically only\nconsider the direct context of the buggy line when building prompts for the\nCLM, leading to suboptimal repair outcomes due to the limited information\nprovided. This paper introduces a novel approach, ARJA-CLM, which integrates\nthe multiobjective evolutionary algorithm with CLM to fix multilocation bugs in\nJava projects. We also propose a context-aware prompt construction stratege,\nwhich enriches the prompt with additional information about accessible fields\nand methods for the CLM generating candidate statements. Our experiments on the\nDefects4J and APR-2024 competition benchmark demonstrate that ARJA-CLM\nsurpasses many state-of-the-art repair systems, and performs well on\nmulti-point bugs. The results also reveal that CLMs effectively utilize the\nprovided field and method information within context-aware prompts to produce\ncandidate statements.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}