{"id":"2408.09659","title":"An Algorithm for Enhancing Privacy-Utility Tradeoff in the Privacy\n  Funnel and Other Lift-based Measures","authors":"Mohammad Amin Zarrabian, Parastoo Sadeghi","authorsParsed":[["Zarrabian","Mohammad Amin",""],["Sadeghi","Parastoo",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 02:43:18 GMT"}],"updateDate":"2024-08-20","timestamp":1724035398000,"abstract":"  This paper investigates the privacy funnel, a privacy-utility tradeoff\nproblem in which mutual information quantifies both privacy and utility. The\nobjective is to maximize utility while adhering to a specified privacy budget.\nHowever, the privacy funnel represents a non-convex optimization problem,\nmaking it challenging to achieve an optimal solution. An existing proposed\napproach to this problem involves substituting the mutual information with the\nlift (the exponent of information density) and then solving the optimization.\nSince mutual information is the expectation of the information density, this\nsubstitution overestimates the privacy loss and results in a final smaller\nbound on the privacy of mutual information than what is allowed in the budget.\nThis significantly compromises the utility. To overcome this limitation, we\npropose using a privacy measure that is more relaxed than the lift but stricter\nthan mutual information while still allowing the optimization to be efficiently\nsolved. Instead of directly using information density, our proposed measure is\nthe average of information density over the sensitive data distribution for\neach observed data realization. We then introduce a heuristic algorithm capable\nof achieving solutions that produce extreme privacy values, which enhances\nutility. The numerical results confirm improved utility at the same privacy\nbudget compared to existing solutions in the literature. Additionally, we\nexplore two other privacy measures, $\\ell_{1}$-norm and strong\n$\\chi^2$-divergence, demonstrating the applicability of our algorithm to these\nlift-based measures. We evaluate the performance of our method by comparing its\noutput with previous works. Finally, we validate our heuristic approach with a\ntheoretical framework that estimates the optimal utility for strong\n$\\chi^2$-divergence, numerically showing a perfect match.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7rZmLRSQiaOBkAPB0OXt3l441aIXXFTIIH3kNdnj-oA","pdfSize":"318239"}
