{"id":"2408.00618","title":"Facilitating heterogeneous effect estimation via statistically efficient\n  categorical modifiers","authors":"Daniel R. Kowal","authorsParsed":[["Kowal","Daniel R.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 14:58:01 GMT"}],"updateDate":"2024-08-02","timestamp":1722524281000,"abstract":"  Categorical covariates such as race, sex, or group are ubiquitous in\nregression analysis. While main-only (or ANCOVA) linear models are predominant,\ncat-modified linear models that include categorical-continuous or\ncategorical-categorical interactions are increasingly important and allow\nheterogeneous, group-specific effects. However, with standard approaches, the\naddition of cat-modifiers fundamentally alters the estimates and\ninterpretations of the main effects, often inflates their standard errors, and\nintroduces significant concerns about group (e.g., racial) biases. We advocate\nan alternative parametrization and estimation scheme using abundance-based\nconstraints (ABCs). ABCs induce a model parametrization that is both\ninterpretable and equitable. Crucially, we show that with ABCs, the addition of\ncat-modifiers 1) leaves main effect estimates unchanged and 2) enhances their\nstatistical power, under reasonable conditions. Thus, analysts can, and\narguably should include cat-modifiers in linear regression models to discover\npotential heterogeneous effects--without compromising estimation, inference,\nand interpretability for the main effects. Using simulated data, we verify\nthese invariance properties for estimation and inference and showcase the\ncapabilities of ABCs to increase statistical power. We apply these tools to\nstudy demographic heterogeneities among the effects of social and environmental\nfactors on STEM educational outcomes for children in North Carolina. An R\npackage lmabc is available.\n","subjects":["Statistics/Methodology","Mathematics/Statistics Theory","Statistics/Applications","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VVWZypPWdHbRILj4CmuVw0cctUtFJBJL6cqieJwu9G4","pdfSize":"2497443","txDigest":"4DGXF4uoEpsgDanz9SMTSue6fcDBLoaHP3aUJezSNmWS","endEpoch":"1","status":"CERTIFIED"}
