{"id":"2408.02464","title":"Fairness and Bias Mitigation in Computer Vision: A Survey","authors":"Sepehr Dehdashtian, Ruozhen He, Yi Li, Guha Balakrishnan, Nuno\n  Vasconcelos, Vicente Ordonez, Vishnu Naresh Boddeti","authorsParsed":[["Dehdashtian","Sepehr",""],["He","Ruozhen",""],["Li","Yi",""],["Balakrishnan","Guha",""],["Vasconcelos","Nuno",""],["Ordonez","Vicente",""],["Boddeti","Vishnu Naresh",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 13:44:22 GMT"}],"updateDate":"2024-08-06","timestamp":1722865462000,"abstract":"  Computer vision systems have witnessed rapid progress over the past two\ndecades due to multiple advances in the field. As these systems are\nincreasingly being deployed in high-stakes real-world applications, there is a\ndire need to ensure that they do not propagate or amplify any discriminatory\ntendencies in historical or human-curated data or inadvertently learn biases\nfrom spurious correlations. This paper presents a comprehensive survey on\nfairness that summarizes and sheds light on ongoing trends and successes in the\ncontext of computer vision. The topics we discuss include 1) The origin and\ntechnical definitions of fairness drawn from the wider fair machine learning\nliterature and adjacent disciplines. 2) Work that sought to discover and\nanalyze biases in computer vision systems. 3) A summary of methods proposed to\nmitigate bias in computer vision systems in recent years. 4) A comprehensive\nsummary of resources and datasets produced by researchers to measure, analyze,\nand mitigate bias and enhance fairness. 5) Discussion of the field's success,\ncontinuing trends in the context of multimodal foundation and generative\nmodels, and gaps that still need to be addressed. The presented\ncharacterization should help researchers understand the importance of\nidentifying and mitigating bias in computer vision and the state of the field\nand identify potential directions for future research.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}