{"id":"2408.01689","title":"Controllable Unlearning for Image-to-Image Generative Models via\n  $\\varepsilon$-Constrained Optimization","authors":"Xiaohua Feng and Chaochao Chen and Yuyuan Li and Li Zhang","authorsParsed":[["Feng","Xiaohua",""],["Chen","Chaochao",""],["Li","Yuyuan",""],["Zhang","Li",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 07:04:55 GMT"},{"version":"v2","created":"Sat, 14 Sep 2024 10:11:25 GMT"}],"updateDate":"2024-09-17","timestamp":1722668695000,"abstract":"  While generative models have made significant advancements in recent years,\nthey also raise concerns such as privacy breaches and biases. Machine\nunlearning has emerged as a viable solution, aiming to remove specific training\ndata, e.g., containing private information and bias, from models. In this\npaper, we study the machine unlearning problem in Image-to-Image (I2I)\ngenerative models. Previous studies mainly treat it as a single objective\noptimization problem, offering a solitary solution, thereby neglecting the\nvaried user expectations towards the trade-off between complete unlearning and\nmodel utility. To address this issue, we propose a controllable unlearning\nframework that uses a control coefficient $\\varepsilon$ to control the\ntrade-off. We reformulate the I2I generative model unlearning problem into a\n$\\varepsilon$-constrained optimization problem and solve it with a\ngradient-based method to find optimal solutions for unlearning boundaries.\nThese boundaries define the valid range for the control coefficient. Within\nthis range, every yielded solution is theoretically guaranteed with Pareto\noptimality. We also analyze the convergence rate of our framework under various\ncontrol functions. Extensive experiments on two benchmark datasets across three\nmainstream I2I models demonstrate the effectiveness of our controllable\nunlearning framework.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}