{"id":"2408.11297","title":"Making Large Vision Language Models to be Good Few-shot Learners","authors":"Fan Liu, Wenwen Cai, Jian Huo, Chuanyi Zhang, Delong Chen, Jun Zhou","authorsParsed":[["Liu","Fan",""],["Cai","Wenwen",""],["Huo","Jian",""],["Zhang","Chuanyi",""],["Chen","Delong",""],["Zhou","Jun",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 03:01:11 GMT"}],"updateDate":"2024-08-22","timestamp":1724209271000,"abstract":"  Few-shot classification (FSC) is a fundamental yet challenging task in\ncomputer vision that involves recognizing novel classes from limited data.\nWhile previous methods have focused on enhancing visual features or\nincorporating additional modalities, Large Vision Language Models (LVLMs) offer\na promising alternative due to their rich knowledge and strong visual\nperception. However, LVLMs risk learning specific response formats rather than\neffectively extracting useful information from support data in FSC tasks. In\nthis paper, we investigate LVLMs' performance in FSC and identify key issues\nsuch as insufficient learning and the presence of severe positional biases. To\ntackle the above challenges, we adopt the meta-learning strategy to teach\nmodels \"learn to learn\". By constructing a rich set of meta-tasks for\ninstruction fine-tuning, LVLMs enhance the ability to extract information from\nfew-shot support data for classification. Additionally, we further boost LVLM's\nfew-shot learning capabilities through label augmentation and candidate\nselection in the fine-tuning and inference stage, respectively. Label\naugmentation is implemented via a character perturbation strategy to ensure the\nmodel focuses on support information. Candidate selection leverages attribute\ndescriptions to filter out unreliable candidates and simplify the task.\nExtensive experiments demonstrate that our approach achieves superior\nperformance on both general and fine-grained datasets. Furthermore, our\ncandidate selection strategy has been proven beneficial for training-free\nLVLMs.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bYFYkajst-LDIzBZQGXJhIdQJFP0EF45yNobBoJL3YI","pdfSize":"8395504"}
