{"id":"2408.02574","title":"DanModCap: Designing a Danmaku Moderation Tool for Video-Sharing\n  Platforms that Leverages Impact Captions","authors":"Siying Hu, Huanchen Wang, Yu Zhang, Piaohong Wang, Zhicong Lu","authorsParsed":[["Hu","Siying",""],["Wang","Huanchen",""],["Zhang","Yu",""],["Wang","Piaohong",""],["Lu","Zhicong",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 15:48:19 GMT"},{"version":"v2","created":"Mon, 19 Aug 2024 16:42:30 GMT"}],"updateDate":"2024-08-21","timestamp":1722872899000,"abstract":"  Online video platforms have gained increased popularity due to their ability\nto support information consumption and sharing and the diverse social\ninteractions they afford. Danmaku, a real-time commentary feature that overlays\nuser comments on a video, has been found to improve user engagement, however,\nthe use of Danmaku can lead to toxic behaviors and inappropriate comments. To\naddress these issues, we propose a proactive moderation approach inspired by\nImpact Captions, a visual technique used in East Asian variety shows. Impact\nCaptions combine textual content and visual elements to construct emotional and\ncognitive resonance. Within the context of this work, Impact Captions were used\nto guide viewers towards positive Danmaku-related activities and elicit more\npro-social behaviors. Leveraging Impact Captions, we developed DanModCap, an\nmoderation tool that collected and analyzed Danmaku and used it as input to\nlarge generative language models to produce Impact Captions. Our evaluation of\nDanModCap demonstrated that Impact Captions reduced negative antagonistic\nemotions, increased users' desire to share positive content, and elicited\nself-control in Danmaku social action to fostering proactive community\nmaintenance behaviors. Our approach highlights the benefits of using\nLLM-supported content moderation methods for proactive moderation in a\nlarge-scale live content contexts.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}