{"id":"2408.15295","title":"A novel method to separate circadian from non-circadian masking effects\n  in order to enhance daily circadian timing and amplitude estimation from core\n  body temperature","authors":"Phuc D Nguyen, Claire Dunbar, Hannah Scott, Bastien Lechat, Jack\n  Manners, Gorica Micic, Nicole Lovato, Amy C Reynolds, Leon Lack, Robert\n  Adams, Danny Eckert, Andrew Vakulin, Peter G Catcheside","authorsParsed":[["Nguyen","Phuc D",""],["Dunbar","Claire",""],["Scott","Hannah",""],["Lechat","Bastien",""],["Manners","Jack",""],["Micic","Gorica",""],["Lovato","Nicole",""],["Reynolds","Amy C",""],["Lack","Leon",""],["Adams","Robert",""],["Eckert","Danny",""],["Vakulin","Andrew",""],["Catcheside","Peter G",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 10:13:17 GMT"}],"updateDate":"2024-08-29","timestamp":1724753597000,"abstract":"  Circadian disruption contributes to adverse effects on sleep, performance,\nand health. One accepted method to track continuous daily changes in circadian\ntiming is to measure core body temperature (CBT), and establish daily,\ncircadian-related CBT minimum time (Tmin). This method typically applies\ncosine-model fits to measured CBT data, which may not adequately account for\nsubstantial wake metabolic activity and sleep effects on CBT that confound and\nmask circadian effects, and thus estimates of the circadian-related Tmin. This\nstudy introduced a novel physiology-grounded analytic approach to separate\ncircadian from non-circadian effects on CBT, which we compared against\ntraditional cosine-based methods. The dataset comprised 33 healthy participants\nattending a 39-hour in-laboratory study with an initial overnight sleep\nfollowed by an extended wake period. CBT data were collected at 30-second\nintervals via ingestible capsules. Our design captured CBT during both the\nbaseline sleep period and during extended wake period (without sleep) and\nallowed us to model the influence of circadian and non-circadian effects of\nsleep, wake, and activity on CBT using physiology-guided generalized additive\nmodels. Model fits and estimated Tmin inferred from extended wake without sleep\nwere compared with traditional cosine-based models fits. Compared to the\ntraditional cosine model, the new model exhibited superior fits to CBT (Pearson\nR 0.90 [95%CI; [0.83 - 0.96] versus 0.81 [0.55-0.93]). The difference between\nestimated vs measured circadian Tmin, derived from the day without sleep, was\nbetter fit with our method (0.2 [-0.5,0.3] hours) versus previous methods (1.4\n[1.1 to 1.7] hours). This new method provides superior demasking of\nnon-circadian influences compared to traditional cosine methods, including the\nremoval of a sleep-related bias towards an earlier estimate of circadian Tmin.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"T4CwCeVnX75dT-cOT2KQgk78wuF6PRx9npvV5ZpYlQU","pdfSize":"687452"}
