{"id":"2408.01699","title":"Electrostatic Waves and Electron Holes in Simulations of Low-Mach\n  Quasi-Perpendicular Shocks","authors":"Artem Bohdan, Aaron Tran, Lorenzo Sironi, Lynn B. Wilson III","authorsParsed":[["Bohdan","Artem",""],["Tran","Aaron",""],["Sironi","Lorenzo",""],["Wilson","Lynn B.","III"]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 07:41:29 GMT"}],"updateDate":"2024-08-06","timestamp":1722670889000,"abstract":"  Collisionless low Mach number shocks are abundant in astrophysical and space\nplasma environments, exhibiting complex wave activity and wave-particle\ninteractions. In this paper, we present 2D Particle-in-Cell (PIC) simulations\nof quasi-perpendicular nonrelativistic ($\\vsh \\approx (5500-22000)$ km/s) low\nMach number shocks, with a specific focus on studying electrostatic waves in\nthe shock ramp and the precursor regions. In these shocks, an ion-scale oblique\nwhistler wave creates a configuration with two hot counter-streaming electron\nbeams, which drive unstable electron acoustic waves (EAWs) that can turn into\nelectrostatic solitary waves (ESWs) at the late stage of their evolution. By\nconducting simulations with periodic boundaries, we show that EAW properties\nagree with linear dispersion analysis. The characteristics of ESWs in shock\nsimulations, including their wavelength and amplitude, depend on the shock\nvelocity. When extrapolated to shocks with realistic velocities ($\\vsh \\approx\n300$ km/s), the ESW wavelength is reduced to one tenth of the electron skin\ndepth and the ESW amplitude is anticipated to surpass that of the quasi-static\nelectric field by more than a factor of 100. These theoretical predictions may\nexplain a discrepancy, between PIC and satellite measurements, in the relative\namplitude of high- and low-frequency electric field fluctuations.\n","subjects":["Physics/Space Physics","Astrophysics/High Energy Astrophysical Phenomena","Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LhLw1ukhpM2PC4prFqP1VC7_Ae2cTMMA4pIJCE6tzcg","pdfSize":"4432025"}
