{"id":"2408.04686","title":"Multi-Turn Context Jailbreak Attack on Large Language Models From First\n  Principles","authors":"Xiongtao Sun, Deyue Zhang, Dongdong Yang, Quanchen Zou, Hui Li","authorsParsed":[["Sun","Xiongtao",""],["Zhang","Deyue",""],["Yang","Dongdong",""],["Zou","Quanchen",""],["Li","Hui",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 09:18:47 GMT"}],"updateDate":"2024-08-12","timestamp":1723108727000,"abstract":"  Large language models (LLMs) have significantly enhanced the performance of\nnumerous applications, from intelligent conversations to text generation.\nHowever, their inherent security vulnerabilities have become an increasingly\nsignificant challenge, especially with respect to jailbreak attacks. Attackers\ncan circumvent the security mechanisms of these LLMs, breaching security\nconstraints and causing harmful outputs. Focusing on multi-turn semantic\njailbreak attacks, we observe that existing methods lack specific\nconsiderations for the role of multiturn dialogues in attack strategies,\nleading to semantic deviations during continuous interactions. Therefore, in\nthis paper, we establish a theoretical foundation for multi-turn attacks by\nconsidering their support in jailbreak attacks, and based on this, propose a\ncontext-based contextual fusion black-box jailbreak attack method, named\nContext Fusion Attack (CFA). This method approach involves filtering and\nextracting key terms from the target, constructing contextual scenarios around\nthese terms, dynamically integrating the target into the scenarios, replacing\nmalicious key terms within the target, and thereby concealing the direct\nmalicious intent. Through comparisons on various mainstream LLMs and red team\ndatasets, we have demonstrated CFA's superior success rate, divergence, and\nharmfulness compared to other multi-turn attack strategies, particularly\nshowcasing significant advantages on Llama3 and GPT-4.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}