{"id":"2408.02780","title":"LR-Net: A Lightweight and Robust Network for Infrared Small Target\n  Detection","authors":"Chuang Yu, Yunpeng Liu, Jinmiao Zhao, Zelin Shi","authorsParsed":[["Yu","Chuang",""],["Liu","Yunpeng",""],["Zhao","Jinmiao",""],["Shi","Zelin",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 18:57:33 GMT"}],"updateDate":"2024-08-07","timestamp":1722884253000,"abstract":"  Limited by equipment limitations and the lack of target intrinsic features,\nexisting infrared small target detection methods have difficulty meeting actual\ncomprehensive performance requirements. Therefore, we propose an innovative\nlightweight and robust network (LR-Net), which abandons the complex structure\nand achieves an effective balance between detection accuracy and resource\nconsumption. Specifically, to ensure the lightweight and robustness, on the one\nhand, we construct a lightweight feature extraction attention (LFEA) module,\nwhich can fully extract target features and strengthen information interaction\nacross channels. On the other hand, we construct a simple refined feature\ntransfer (RFT) module. Compared with direct cross-layer connections, the RFT\nmodule can improve the network's feature refinement extraction capability with\nlittle resource consumption. Meanwhile, to solve the problem of small target\nloss in high-level feature maps, on the one hand, we propose a low-level\nfeature distribution (LFD) strategy to use low-level features to supplement the\ninformation of high-level features. On the other hand, we introduce an\nefficient simplified bilinear interpolation attention module (SBAM) to promote\nthe guidance constraints of low-level features on high-level features and the\nfusion of the two. In addition, We abandon the traditional resizing method and\nadopt a new training and inference cropping strategy, which is more robust to\ndatasets with multi-scale samples. Extensive experimental results show that our\nLR-Net achieves state-of-the-art (SOTA) performance. Notably, on the basis of\nthe proposed LR-Net, we achieve 3rd place in the \"ICPR 2024 Resource-Limited\nInfrared Small Target Detection Challenge Track 2: Lightweight Infrared Small\nTarget Detection\".\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}