{"id":"2408.05406","title":"Efficient Quantum Gradient and Higher-order Derivative Estimation via\n  Generalized Hadamard Test","authors":"Dantong Li, Dikshant Dulal, Mykhailo Ohorodnikov, Hanrui Wang,\n  Yongshan Ding","authorsParsed":[["Li","Dantong",""],["Dulal","Dikshant",""],["Ohorodnikov","Mykhailo",""],["Wang","Hanrui",""],["Ding","Yongshan",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 02:08:54 GMT"}],"updateDate":"2024-08-13","timestamp":1723255734000,"abstract":"  In the context of Noisy Intermediate-Scale Quantum (NISQ) computing,\nparameterized quantum circuits (PQCs) represent a promising paradigm for\ntackling challenges in quantum sensing, optimal control, optimization, and\nmachine learning on near-term quantum hardware. Gradient-based methods are\ncrucial for understanding the behavior of PQCs and have demonstrated\nsubstantial advantages in the convergence rates of Variational Quantum\nAlgorithms (VQAs) compared to gradient-free methods. However, existing gradient\nestimation methods, such as Finite Difference, Parameter Shift Rule, Hadamard\nTest, and Direct Hadamard Test, often yield suboptimal gradient circuits for\ncertain PQCs. To address these limitations, we introduce the Flexible Hadamard\nTest, which, when applied to first-order gradient estimation methods, can\ninvert the roles of ansatz generators and observables. This inversion\nfacilitates the use of measurement optimization techniques to efficiently\ncompute PQC gradients. Additionally, to overcome the exponential cost of\nevaluating higher-order partial derivatives, we propose the $k$-fold Hadamard\nTest, which computes the $k^{th}$-order partial derivative using a single\ncircuit. Furthermore, we introduce Quantum Automatic Differentiation (QAD), a\nunified gradient method that adaptively selects the best gradient estimation\ntechnique for individual parameters within a PQC. This represents the first\nimplementation, to our knowledge, that departs from the conventional practice\nof uniformly applying a single method to all parameters. Through rigorous\nnumerical experiments, we demonstrate the effectiveness of our proposed\nfirst-order gradient methods, showing up to an $O(N)$ factor improvement in\ncircuit execution count for real PQC applications. Our research contributes to\nthe acceleration of VQA computations, offering practical utility in the NISQ\nera of quantum computing.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}