{"id":"2408.14523","title":"Retrieval Augmented Generation for Dynamic Graph Modeling","authors":"Yuxia Wu, Yuan Fang, Lizi Liao","authorsParsed":[["Wu","Yuxia",""],["Fang","Yuan",""],["Liao","Lizi",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 09:23:35 GMT"}],"updateDate":"2024-08-28","timestamp":1724664215000,"abstract":"  Dynamic graph modeling is crucial for analyzing evolving patterns in various\napplications. Existing approaches often integrate graph neural networks with\ntemporal modules or redefine dynamic graph modeling as a generative sequence\ntask. However, these methods typically rely on isolated historical contexts of\nthe target nodes from a narrow perspective, neglecting occurrences of similar\npatterns or relevant cases associated with other nodes. In this work, we\nintroduce the Retrieval-Augmented Generation for Dynamic Graph Modeling\n(RAG4DyG) framework, which leverages guidance from contextually and temporally\nanalogous examples to broaden the perspective of each node. This approach\npresents two critical challenges: (1) How to identify and retrieve high-quality\ndemonstrations that are contextually and temporally analogous to dynamic graph\nsamples? (2) How can these demonstrations be effectively integrated to improve\ndynamic graph modeling? To address these challenges, we propose RAG4DyG, which\nenriches the understanding of historical contexts by retrieving and learning\nfrom contextually and temporally pertinent demonstrations. Specifically, we\nemploy a time- and context-aware contrastive learning module to identify and\nretrieve relevant cases for each query sequence. Moreover, we design a graph\nfusion strategy to integrate the retrieved cases, thereby augmenting the\ninherent historical contexts for improved prediction. Extensive experiments on\nreal-world datasets across different domains demonstrate the effectiveness of\nRAG4DyG for dynamic graph modeling.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}