{"id":"2408.16796","title":"Raising AI Ethics Awareness through an AI Ethics Quiz for Software\n  Practitioners","authors":"Aastha Pant, Rashina Hoda, Paul McIntosh","authorsParsed":[["Pant","Aastha",""],["Hoda","Rashina",""],["McIntosh","Paul",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 23:36:13 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 01:14:01 GMT"}],"updateDate":"2024-09-05","timestamp":1724888173000,"abstract":"  Context:Today, ethical issues surrounding AI systems are increasingly\nprevalent, highlighting the critical need to integrate AI ethics into system\ndesign to prevent societal harm. Raising awareness and fostering a deep\nunderstanding of AI ethics among software practitioners is essential for\nachieving this goal. However, research indicates a significant gap in\npractitioners' awareness and knowledge of AI ethics and ethical principles.\nWhile much effort has been directed toward helping practitioners operationalise\nAI ethical principles such as fairness, transparency, accountability, and\nprivacy, less attention has been paid to raising initial awareness, which\nshould be the foundational step. Objective: Addressing this gap, we developed a\nsoftware-based tool, the AI Ethics Quiz, to raise awareness and enhance the\nknowledge of AI ethics among software practitioners. Our objective was to\norganise interactive workshops, introduce the AI Ethics Quiz, and evaluate its\neffectiveness in enhancing awareness and knowledge of AI ethics and ethical\nprinciples among practitioners. Method: We conducted two one-hour workshops\n(one in-person and one online) involving 29 software practitioners. Data was\ncollected through pre-quiz questionnaire, the AI Ethics Quiz, and a post-quiz\nquestionnaire. Results: The anonymous responses revealed that the quiz\nsignificantly improved practitioners' awareness and understanding of AI ethics.\nAdditionally, practitioners found the quiz engaging and reported it created a\nmeaningful learning experience regarding AI ethics. In this paper, we share\ninsights gained from conducting these interactive workshops and introducing the\nAI Ethics Quiz to practitioners. Conclusion: We also provide recommendations\nfor software companies and leaders to adopt similar initiatives, which may help\nthem enhance practitioners' awareness and understanding of AI ethics.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}