{"id":"2408.01151","title":"Calibration of the strain amplitude recorded with DAS using a\n  strainmeter array","authors":"Thomas Forbriger (1), Nasim Karamzadeh (1 and 2), J\\'er\\^ome Azzola\n  (3), Emmanuel Gaucher (3), Rudolf Widmer-Schnidrig (4), Andreas Rietbrock (1)\n  ((1) Karlsruhe Institute of Technology (KIT), Geophysical Institute,\n  Karlsruhe, Germany, (2) now at University of M\\\"unster Institut f\\\"ur\n  Geophysik, M\\\"unster, Germany, (3) Karlsruhe Institute of Technology (KIT),\n  Institute for Applied Geosciences, Karlsruhe, Germany, (4) Institute of\n  Geodesy, University of Stuttgart, Stuttgart, Germany)","authorsParsed":[["Forbriger","Thomas","","1 and 2"],["Karamzadeh","Nasim","","1 and 2"],["Azzola","Jérôme",""],["Gaucher","Emmanuel",""],["Widmer-Schnidrig","Rudolf",""],["Rietbrock","Andreas",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 10:08:35 GMT"}],"updateDate":"2024-08-05","timestamp":1722593315000,"abstract":"  The power of distributed acoustic sensing (DAS) lies in its ability to sample\ndeformation signals along an optical fiber at hundreds of locations with only\none interrogation unit (IU). While the IU is calibrated to record 'fiber\nstrain', the properties of the cable and its coupling to the rock control the\n'strain transfer rate' and hence how much of 'rock strain' is represented in\nthe recorded signal. We use DAS recordings in an underground installation\ncolocated with an array of strainmeters in order to calibrate the 'strain\ntransfer rate' in situ, using earthquake signals between 0.05 Hz and 0.1 Hz. A\ntight-buffered cable and a standard loose-tube telecommunication cable (running\nin parallel) are used, where a section of both cables loaded down by loose sand\nand sand bags is compared to a section, where cables are just unreeled on the\nfloor. The 'strain transfer rate' varies between 0.13 and 0.53 depending on\ncable and installation type. The sandbags show no obvious effect and the\ntight-buffered cable generally provides a larger 'strain transfer rate'.\nCalibration of the 'strain transfer rate' with respect to the strainmeter does\nnot depend on wave propagation parameters. Hence it is applicable to the large\namplitude surface wave signal in a strain component almost perpendicular to the\ngreat-circle direction for which a waveform comparison with seismometer data\ndoes not work. The noise background for 'rock strain' in the investigated band\nis found at about an rms-amplitude of 0.1 nstrain in 1/6 decade for the\ntight-buffered cable. This allows a detection of marine microseisms at times of\nhigh microseism amplitude.\n","subjects":["Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}