{"id":"2408.03222","title":"On the unsteady aerodynamics of flapping wings under dynamic hovering\n  kinematics","authors":"Romain Poletti, Andre Calado, Lilla K. Koloszar, Joris Degroote, and\n  Miguel A. Mendez","authorsParsed":[["Poletti","Romain",""],["Calado","Andre",""],["Koloszar","Lilla K.",""],["Degroote","Joris",""],["Mendez","Miguel A.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 14:35:05 GMT"}],"updateDate":"2024-08-07","timestamp":1722954905000,"abstract":"  Hummingbirds and insects achieve outstanding flight performance by adapting\ntheir flapping motion to the flight requirements. Their wing kinematics can\nchange from smooth flapping to highly dynamic waveforms, generating unsteady\naerodynamic phenomena such as leading-edge vortices (LEV), rotational\ncirculation, wing wake capture, and added mass. This article uncovers the\ninteractions of these mechanisms in the case of a rigid semi-elliptical wing\nundergoing aggressive kinematics in the hovering regime at $Re\\sim\n\\mathcal{O}(10^3)$. The flapping kinematics were parametrized using smoothed\nsteps and triangular functions and the flow dynamics were simulated by\ncombining the overset method with Large Eddy Simulations (LES). The analysis of\nthe results identifies an initial acceleration phase and a cruising phase.\nDuring the former, the flow is mostly irrotational and governed by the added\nmass effect. The added mass was shown to be responsible for a lift first peak\ndue to the strong flapping acceleration. The dynamic pitching and the wing wake\ninteraction generate a second lift peak due to a downwash flow and a vortex\nsystem on the proximal and distal parts of the wing's pressure side.\nConversely, aerodynamic forces in the cruising phase are mainly governed by the\ngrowth and the establishment of the LEV. Finally, the leading flow structures\nin each phase and their impact on the aerodynamic forces were isolated using\nthe extended Proper Orthogonal Decomposition (POD).\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BpWR2QTP2bmtxnkgFzhsnV1X5Z7qimTfiwnCClXtcjM","pdfSize":"18070256"}
