{"id":"2408.05112","title":"Semantic Successive Refinement: A Generative AI-aided Semantic\n  Communication Framework","authors":"Kexin Zhang, Lixin Li, Wensheng Lin, Yuna Yan, Rui Li, Wenchi Cheng,\n  Zhu Han","authorsParsed":[["Zhang","Kexin",""],["Li","Lixin",""],["Lin","Wensheng",""],["Yan","Yuna",""],["Li","Rui",""],["Cheng","Wenchi",""],["Han","Zhu",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 06:08:51 GMT"}],"updateDate":"2024-08-12","timestamp":1722406131000,"abstract":"  Semantic Communication (SC) is an emerging technology aiming to surpass the\nShannon limit. Traditional SC strategies often minimize signal distortion\nbetween the original and reconstructed data, neglecting perceptual quality,\nespecially in low Signal-to-Noise Ratio (SNR) environments. To address this\nissue, we introduce a novel Generative AI Semantic Communication (GSC) system\nfor single-user scenarios. This system leverages deep generative models to\nestablish a new paradigm in SC. Specifically, At the transmitter end, it\nemploys a joint source-channel coding mechanism based on the Swin Transformer\nfor efficient semantic feature extraction and compression. At the receiver end,\nan advanced Diffusion Model (DM) reconstructs high-quality images from degraded\nsignals, enhancing perceptual details. Additionally, we present a Multi-User\nGenerative Semantic Communication (MU-GSC) system utilizing an asynchronous\nprocessing model. This model effectively manages multiple user requests and\noptimally utilizes system resources for parallel processing. Simulation results\non public datasets demonstrate that our generative AI semantic communication\nsystems achieve superior transmission efficiency and enhanced communication\ncontent quality across various channel conditions. Compared to CNN-based\nDeepJSCC, our methods improve the Peak Signal-to-Noise Ratio (PSNR) by 17.75%\nin Additive White Gaussian Noise (AWGN) channels and by 20.86% in Rayleigh\nchannels.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}