{"id":"2408.12891","title":"Performance evaluation of the high-voltage CMOS active pixel sensor\n  AstroPix for gamma-ray space telescopes","authors":"Yusuke Suda, Regina Caputo, Amanda L. Steinhebel, Nicolas Striebig,\n  Manoj Jadhav, Yasushi Fukazawa, Masaki Hashizume, Carolyn Kierans, Richard\n  Leys, Jessica Metcalfe, Michela Negro, Ivan Peri\\'c, Jeremy S. Perkins,\n  Taylor Shin, Hiroyasu Tajima, Daniel Violette, Norito Nakano","authorsParsed":[["Suda","Yusuke",""],["Caputo","Regina",""],["Steinhebel","Amanda L.",""],["Striebig","Nicolas",""],["Jadhav","Manoj",""],["Fukazawa","Yasushi",""],["Hashizume","Masaki",""],["Kierans","Carolyn",""],["Leys","Richard",""],["Metcalfe","Jessica",""],["Negro","Michela",""],["Perić","Ivan",""],["Perkins","Jeremy S.",""],["Shin","Taylor",""],["Tajima","Hiroyasu",""],["Violette","Daniel",""],["Nakano","Norito",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 07:51:35 GMT"}],"updateDate":"2024-08-26","timestamp":1724399495000,"abstract":"  AstroPix is a novel monolithic high-voltage CMOS active pixel sensor proposed\nfor next generation medium-energy gamma-ray observatories like the All-sky\nMedium Energy Gamma-ray Observatory eXplorer (AMEGO-X). For AMEGO-X AstroPix\nmust maintain a power consumption of less than $1.5~\\rm{mW/{cm}^2}$ while\nhaving a pixel pitch of up to $500~\\rm{\\mu m}$. We developed the second and\nthird versions of AstroPix, namely AstroPix2 and AstroPix3. AstroPix2 and\nAstroPix3 exhibit power consumptions of $3.4~\\rm{mW/{cm}^2}$ and\n$4.1~\\rm{mW/{cm}^2}$, respectively. While AstroPix2 has a pixel pitch of\n$250~\\rm{\\mu m}$, AstroPix3 achieves the desired size for AMEGO-X with a pixel\npitch of $500~\\rm{\\mu m}$. Performance evaluation of a single pixel in an\nAstroPix2 chip revealed a dynamic range from 13.9 keV to 59.5 keV, with the\nenergy resolution meeting the AMEGO-X target value ($<10\\%$ (FWHM) at 60 keV).\nWe performed energy calibration on most of the pixels in an AstroPix3 chip,\nyielding a mean energy resolution of 6.2 keV (FWHM) at 59.5 keV, with 44.4% of\nthe pixels satisfying the target value. The dynamic range of AstroPix3 was\nassessed to span from 22.2 keV to 122.1 keV. The expansion of the depletion\nlayer aligns with expectations in both AstroPix2 and AstroPix3. Furthermore,\nradiation tolerance testing was conducted on AstroPix. An AstroPix2 chip was\nsubjected to an equivalent exposure of approximately 10 Gy from a\nhigh-intensity $\\rm{^{60}Co}$ source. The chip was fully operational after\nirradiation although a decrease in gain by approximately 4% was observed.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Instrumentation and Detectors"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}