{"id":"2408.12937","title":"Hydrodynamical shear mixing in subsonic boundary layers and its role in\n  the thermonuclear explosion of classical novae","authors":"Marco Bellomo, Steven N. Shore, Jordi Jos\\'e","authorsParsed":[["Bellomo","Marco",""],["Shore","Steven N.",""],["José","Jordi",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 09:38:52 GMT"}],"updateDate":"2024-08-26","timestamp":1724405932000,"abstract":"  The transition zone between the white dwarf (WD) envelope and a circumstellar\naccretion disk in classical novae, the boundary layer, is a region of strong\ndissipation and intense vorticity. In this strongly sheared layer, the\nhydrogen-rich accreted gas is expected to mix with the underlying WD outermost\nlayers so the conditions for the onset of the thermonuclear runaway (TNR) in\nclassical nova will be different from the the standard treatment of the onset\nand subsequent mixing. We applied the critical layer instability (CLI) to the\nboundary between a disk-accreted H/He zone and the C/O - or O/Ne - rich outer\nlayers of a mass-accreting WD in a cataclysmic binary and then used the\nresulting structure as input to one-dimensional nuclear-hydrodynamic\nsimulations of the nova outburst. We simulated the subsonic mixing process in\ntwo dimensions for conditions appropriate for the inner disk and a CO 0.8 solar\nmass and CO and ONe 1.25 solar mass WDs using the compressible hydrodynamics\ncode PLUTO. The resulting compositional profile was then imported into the\none-dimensional nuclear-hydrodynamics code SHIVA to simulate the triggering and\ngrowth rate for the TNR and subsequent envelope ejection. We find that the deep\nshear-driven mixing changes the triggering and development of the TNR. In\nparticular, the time to reach peak temperature is significantly shorter, and\nthe ejected mass and maximum velocity of the ejecta substantially greater, than\nthe current treatment. The 7Li yield is reduced by about an order of magnitude\nrelative to the current treatments.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MaVn-b-t8Z2cK6PyubkP5Z888bcspZIYC1r2F57UELY","pdfSize":"4768945"}
