{"id":"2408.08416","title":"Spin Relaxation and Diffusion in Monolayer 1T'-WTe$_2$ from\n  First-Principles","authors":"Junqing Xu, Hiroyuki Takenaka, Andrew Grieder, Jacopo Simoni,\n  Ravishankar Sundraraman, Yuan Ping","authorsParsed":[["Xu","Junqing",""],["Takenaka","Hiroyuki",""],["Grieder","Andrew",""],["Simoni","Jacopo",""],["Sundraraman","Ravishankar",""],["Ping","Yuan",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 20:55:39 GMT"}],"updateDate":"2024-08-19","timestamp":1723755339000,"abstract":"  Understanding spin relaxation in topological systems such as quantum\nspin-hall (QSH) insulator is critical for realizing coherent transport at high\ntemperature. WTe$_{2}$, known as a QSH insulator with a high transition\ntemperature of 100K, is an important test-bed of unveiling spin relaxation\nmechanism in topological materials. In this work, we employ our\nrecently-developed \\emph{ab initio} density-matrix dynamics approach to\ninvestigate spin relaxation mechanism, and calculate spin lifetime and\ndiffusion length of monolayer 1T'-WTe$_{2}$, at finite temperature under an\nexternal electric field. We found the spin lifetime of electrons have the\nlargest anisotropy when measuring along the canted-spin-texture direction.\nMoreover, we found an opposite trend between spin and carrier relaxation\nagainst applied electric field. Most importantly, the relaxation mechanism\nunder intermediate electric field around 1V/nm can not be explained by either\nEillot-Yafet or Dyakonov-Perel models, which highlights the generality of our\n\\emph{ab initio} density-matrix framework. We then proposed analytical models\nto explain its mechanism and compare well with \\emph{ab initio} results at\nsmall and large electric field. We predict that spin lifetime and spin\ndiffusion length of bulk-state electrons are $\\sim$1 ps and $\\sim$30 nm at room\ntemperature respectively, suggesting its promise for spintronic applications.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Jt9IbmQK31hoXSOvyGU4i31DWVzuT6qtlpMWHbuObWk","pdfSize":"844948"}
