{"id":"2408.12950","title":"Informational Embodiment: Computational role of information structure in\n  codes and robots","authors":"Alexandre Pitti, Kohei Nakajima, Yasuo Kuniyoshi","authorsParsed":[["Pitti","Alexandre",""],["Nakajima","Kohei",""],["Kuniyoshi","Yasuo",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 09:59:45 GMT"}],"updateDate":"2024-08-26","timestamp":1724407185000,"abstract":"  The body morphology plays an important role in the way information is\nperceived and processed by an agent. We address an information theory (IT)\naccount on how the precision of sensors, the accuracy of motors, their\nplacement, the body geometry, shape the information structure in robots and\ncomputational codes. As an original idea, we envision the robot's body as a\nphysical communication channel through which information is conveyed, in and\nout, despite intrinsic noise and material limitations. Following this, entropy,\na measure of information and uncertainty, can be used to maximize the\nefficiency of robot design and of algorithmic codes per se. This is known as\nthe principle of Entropy Maximization (PEM) introduced in biology by Barlow in\n1969. The Shannon's source coding theorem provides then a framework to compare\ndifferent types of bodies in terms of sensorimotor information. In line with\nPME, we introduce a special class of efficient codes used in IT that reached\nthe Shannon limits in terms of information capacity for error correction and\nrobustness against noise, and parsimony. These efficient codes, which exploit\ninsightfully quantization and randomness, permit to deal with uncertainty,\nredundancy and compacity. These features can be used for perception and control\nin intelligent systems. In various examples and closing discussions, we reflect\non the broader implications of our framework that we called Informational\nEmbodiment to motor theory and bio-inspired robotics, touching upon concepts\nlike motor synergies, reservoir computing, and morphological computation. These\ninsights can contribute to a deeper understanding of how information theory\nintersects with the embodiment of intelligence in both natural and artificial\nsystems.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}