{"id":"2408.03651","title":"Path-SAM2: Transfer SAM2 for digital pathology semantic segmentation","authors":"Mingya Zhang, Liang Wang, Zhihao Chen, Yiyuan Ge and Xianping Tao","authorsParsed":[["Zhang","Mingya",""],["Wang","Liang",""],["Chen","Zhihao",""],["Ge","Yiyuan",""],["Tao","Xianping",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 09:30:51 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 08:23:00 GMT"}],"updateDate":"2024-09-05","timestamp":1723023051000,"abstract":"  The semantic segmentation task in pathology plays an indispensable role in\nassisting physicians in determining the condition of tissue lesions. With the\nproposal of Segment Anything Model (SAM), more and more foundation models have\nseen rapid development in the field of image segmentation. Recently, SAM2 has\ngarnered widespread attention in both natural image and medical image\nsegmentation. Compared to SAM, it has significantly improved in terms of\nsegmentation accuracy and generalization performance. We compared the\nfoundational models based on SAM and found that their performance in semantic\nsegmentation of pathological images was hardly satisfactory. In this paper, we\npropose Path-SAM2, which for the first time adapts the SAM2 model to cater to\nthe task of pathological semantic segmentation. We integrate the largest\npretrained vision encoder for histopathology (UNI) with the original SAM2\nencoder, adding more pathology-based prior knowledge. Additionally, we\nintroduce a learnable Kolmogorov-Arnold Networks (KAN) classification module to\nreplace the manual prompt process. In three adenoma pathological datasets,\nPath-SAM2 has achieved state-of-the-art performance.This study demonstrates the\ngreat potential of adapting SAM2 to pathology image segmentation tasks. We plan\nto release the code and model weights for this paper at:\nhttps://github.com/simzhangbest/SAM2PATH\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}