{"id":"2408.06723","title":"Sustaining Maintenance Labor for Healthy Open Source Software Projects\n  through Human Infrastructure: A Maintainer Perspective","authors":"Johan Lin{\\aa}ker and Georg J.P. Link and Kevin Lumbard","authorsParsed":[["Linåker","Johan",""],["Link","Georg J. P.",""],["Lumbard","Kevin",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 08:30:52 GMT"}],"updateDate":"2024-08-14","timestamp":1723537852000,"abstract":"  Background: Open Source Software (OSS) fuels our global digital\ninfrastructure but is commonly maintained by small groups of people whose time\nand labor represent a depletable resource. For the OSS projects to stay\nsustainable, i.e., viable and maintained over time without interruption or\nweakening, maintenance labor requires an underlying infrastructure to be\nsupported and secured. Aims: Using the construct of human infrastructure, our\nstudy aims to investigate how maintenance labor can be supported and secured to\nenable the creation and maintenance of sustainable OSS projects, viewed from\nthe maintainers' perspective. Method: In our exploration, we interviewed ten\nmaintainers from nine well-adopted OSS projects. We coded the data in two steps\nusing investigator-triangulation. Results: We constructed a framework of\ninfrastructure design that provide insight for OSS projects in the design of\ntheir human infrastructure. The framework specifically highlight the importance\nof human factors, e.g., securing a work-life balance and proactively managing\nsocial pressure, toxicity, and diversity. We also note both differences and\noverlaps in how the infrastructure needs to support and secure maintenance\nlabor from maintainers and the wider OSS community, respectively. Funding is\nspecifically highlighted as an important enabler for both types of resources.\nConclusions: The study contributes to the qualitative understanding of the\nimportance, sensitivity, and risk for depletion of the maintenance labor\nrequired to build and maintain healthy OSS projects. Human infrastructure is\npivotal in ensuring that maintenance labor is sustainable, and by extension the\nOSS projects on which we all depend.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"z8pimrgboH_0chGGH1McyMsez0_02b4cTA8VzoHj4wE","pdfSize":"706262"}
