{"id":"2408.00539","title":"Intermittent Semi-working Mask: A New Masking Paradigm for LLMs","authors":"Mingcong Lu, Jiangcai Zhu, Wang Hao, Zheng Li, Shusheng Zhang, Kailai\n  Shao, Chao Chen, Nan Li, Feng Wang, Xin Lu","authorsParsed":[["Lu","Mingcong",""],["Zhu","Jiangcai",""],["Hao","Wang",""],["Li","Zheng",""],["Zhang","Shusheng",""],["Shao","Kailai",""],["Chen","Chao",""],["Li","Nan",""],["Wang","Feng",""],["Lu","Xin",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 13:22:01 GMT"}],"updateDate":"2024-08-02","timestamp":1722518521000,"abstract":"  Multi-turn dialogues are a key interaction method between humans and Large\nLanguage Models (LLMs), as conversations extend over multiple rounds, keeping\nLLMs' high generation quality and low latency is a challenge. Mainstream LLMs\ncan be grouped into two categories based on masking strategy: causal LLM and\nprefix LLM. Several works have demonstrated that prefix LLMs tend to outperform\ncausal ones in scenarios that heavily depend on historical context such as\nmulti-turn dialogues or in-context learning, thanks to their bidirectional\nattention on prefix sequences. However, prefix LLMs have an inherent\ninefficient training problem in multi-turn dialogue datasets. In addition, the\nattention mechanism of prefix LLM makes it unable to reuse Key-Value Cache (KV\nCache) across dialogue rounds to reduce generation latency. In this paper, we\npropose a novel masking scheme called Intermittent Semi-working Mask (ISM) to\naddress these problems. Specifically, we apply alternate bidirectional and\nunidirectional attention on queries and answers in the dialogue history. In\nthis way, ISM is able to maintain the high quality of prefix LLM and low\ngeneration latency of causal LLM, simultaneously. Extensive experiments\nillustrate that our ISM achieves significant performance.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5DSfdOWxdwtisM5YAQgGB0jOC7IvHcSZ_9-yyHJireA","pdfSize":"780532"}
