{"id":"2408.11323","title":"Optimizing Transmit Field Inhomogeneity of Parallel RF Transmit Design\n  in 7T MRI using Deep Learning","authors":"Zhengyi Lu, Hao Liang, Xiao Wang, Xinqiang Yan, Yuankai Huo","authorsParsed":[["Lu","Zhengyi",""],["Liang","Hao",""],["Wang","Xiao",""],["Yan","Xinqiang",""],["Huo","Yuankai",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 04:10:56 GMT"}],"updateDate":"2024-08-22","timestamp":1724213456000,"abstract":"  Ultrahigh field (UHF) Magnetic Resonance Imaging (MRI) provides a higher\nsignal-to-noise ratio and, thereby, higher spatial resolution. However, UHF MRI\nintroduces challenges such as transmit radiofrequency (RF) field (B1+)\ninhomogeneities, leading to uneven flip angles and image intensity anomalies.\nThese issues can significantly degrade imaging quality and its medical\napplications. This study addresses B1+ field homogeneity through a novel deep\nlearning-based strategy. Traditional methods like Magnitude Least Squares (MLS)\noptimization have been effective but are time-consuming and dependent on the\npatient's presence. Recent machine learning approaches, such as RF Shim\nPrediction by Iteratively Projected Ridge Regression and deep learning\nframeworks, have shown promise but face limitations like extensive training\ntimes and oversimplified architectures. We propose a two-step deep learning\nstrategy. First, we obtain the desired reference RF shimming weights from\nmulti-channel B1+ fields using random-initialized Adaptive Moment Estimation.\nThen, we employ Residual Networks (ResNets) to train a model that maps B1+\nfields to target RF shimming outputs. Our approach does not rely on\npre-calculated reference optimizations for the testing process and efficiently\nlearns residual functions. Comparative studies with traditional MLS\noptimization demonstrate our method's advantages in terms of speed and\naccuracy. The proposed strategy achieves a faster and more efficient RF\nshimming design, significantly improving imaging quality at UHF. This\nadvancement holds potential for broader applications in medical imaging and\ndiagnostics.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}