{"id":"2408.03967","title":"The Stability of Anisotropic Compact Stars Influenced by Dark Matter\n  under Teleparallel Gravity: An Extended Gravitational Deformation Approach","authors":"Sneha Pradhan, Piyali Bhar, Sanjay Mandal, P.K. Sahoo, Kazuharu Bamba","authorsParsed":[["Pradhan","Sneha",""],["Bhar","Piyali",""],["Mandal","Sanjay",""],["Sahoo","P. K.",""],["Bamba","Kazuharu",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 14:04:05 GMT"}],"updateDate":"2024-08-09","timestamp":1722953045000,"abstract":"  In our investigation, we pioneer the development of geometrically deformed\nstrange stars within the framework of $f(\\mathcal{T})$ gravity theory through\ngravitational decoupling via the complete geometric deformation (CGD)\ntechnique. The significant finding is the precise solution for deformed strange\nstar (SS) models achieved through the vanishing complexity factor scenario.\nFurther, we introduce the concept of space-time deformation caused by dark\nmatter (DM) content in DM haloes, leading to perturbations in the metric\npotentials $g_{tt}$ and $g_{rr}$ components. Mathematically, this DM-induced\ndeformation is achieved through the CGD method, where the decoupling parameter\n$\\alpha$ governs the extent of DM influence. To validate our findings, we\ncompare our model predictions with observational constraints, including\nGW190814 (with a mass range of $2.5-2.67 M_{\\odot}$) and neutron stars (NSTRs)\nsuch as EXO 1785-248 [mass=$1.3_{-0.2}^{+0.2}~M_{\\odot}$], 4U 1608-52\n[mass=$1.74_{-0.14}^{+0.14}~M_{\\odot}$], and PSR J0952-0607\n[mass=$2.35_{-0.17}^{+0.17}~M_{\\odot}$]. Our investigation delves into the\nstability of the model by considering causality conditions, Herrera's Cracking\nMethod, the adiabatic index, and the Harrison-Zeldovich-Novikov criterion. We\ndemonstrate that the developed model mimics a wide range of recently observed\npulsars. To emphasize its compatibility, we highlight the predicted mass and\nradius in tabular form by varying both the parameters $\\alpha$ and $\\zeta_1$.\nNotably, our findings are consistent with the observation of gravitational\nwaves from the first binary merger event. Furthermore, we compare our results\nwith those obtained for a slow-rotating configuration. In addition to this, we\ndiscuss the moment of inertia using the Bejger-Haensel approach in this\nformulation.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Gm8dV3lplxwazT3ZOlAvFSARcgfrIcAofIJc9tnGCE4","pdfSize":"1272631"}
