{"id":"2408.03078","title":"BodySLAM: A Generalized Monocular Visual SLAM Framework for Surgical\n  Applications","authors":"G. Manni (1 and 2), C. Lauretti (2), F. Prata (3), R. Papalia (3), L.\n  Zollo (2), P. Soda (1) ((1) Research Unit of Computer Systems and\n  Bioinformatics Department of Engineering Universit\\`a Campus Bio-Medico di\n  Roma, (2) Unit of Advanced Robotics and Human-Centred Technologies Department\n  of Engineering Universit\\`a Campus Bio-Medico di Roma, (3) Department of\n  Urology Fondazione Policlinico Universitario Campus Bio-Medico)","authorsParsed":[["Manni","G.","","1 and 2"],["Lauretti","C.",""],["Prata","F.",""],["Papalia","R.",""],["Zollo","L.",""],["Soda","P.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 10:13:57 GMT"}],"updateDate":"2024-08-07","timestamp":1722939237000,"abstract":"  Endoscopic surgery relies on two-dimensional views, posing challenges for\nsurgeons in depth perception and instrument manipulation. While Simultaneous\nLocalization and Mapping (SLAM) has emerged as a promising solution to address\nthese limitations, its implementation in endoscopic procedures presents\nsignificant challenges due to hardware limitations, such as the use of a\nmonocular camera and the absence of odometry sensors. This study presents a\nrobust deep learning-based SLAM approach that combines state-of-the-art and\nnewly developed models. It consists of three main parts: the Monocular Pose\nEstimation Module that introduces a novel unsupervised method based on the\nCycleGAN architecture, the Monocular Depth Estimation Module that leverages the\nnovel Zoe architecture, and the 3D Reconstruction Module which uses information\nfrom the previous models to create a coherent surgical map. The performance of\nthe procedure was rigorously evaluated using three publicly available datasets\n(Hamlyn, EndoSLAM, and SCARED) and benchmarked against two state-of-the-art\nmethods, EndoSFMLearner and EndoDepth. The integration of Zoe in the MDEM\ndemonstrated superior performance compared to state-of-the-art depth estimation\nalgorithms in endoscopy, whereas the novel approach in the MPEM exhibited\ncompetitive performance and the lowest inference time. The results showcase the\nrobustness of our approach in laparoscopy, gastroscopy, and colonoscopy, three\ndifferent scenarios in endoscopic surgery. The proposed SLAM approach has the\npotential to improve the accuracy and efficiency of endoscopic procedures by\nproviding surgeons with enhanced depth perception and 3D reconstruction\ncapabilities.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}