{"id":"2408.02178","title":"StreamVoice+: Evolving into End-to-end Streaming Zero-shot Voice\n  Conversion","authors":"Zhichao Wang, Yuanzhe Chen, Xinsheng Wang, Lei Xie, Yuping Wang","authorsParsed":[["Wang","Zhichao",""],["Chen","Yuanzhe",""],["Wang","Xinsheng",""],["Xie","Lei",""],["Wang","Yuping",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 01:32:19 GMT"}],"updateDate":"2024-08-06","timestamp":1722821539000,"abstract":"  StreamVoice has recently pushed the boundaries of zero-shot voice conversion\n(VC) in the streaming domain. It uses a streamable language model (LM) with a\ncontext-aware approach to convert semantic features from automatic speech\nrecognition (ASR) into acoustic features with the desired speaker timbre.\nDespite its innovations, StreamVoice faces challenges due to its dependency on\na streaming ASR within a cascaded framework, which complicates system\ndeployment and optimization, affects VC system's design and performance based\non the choice of ASR, and struggles with conversion stability when faced with\nlow-quality semantic inputs. To overcome these limitations, we introduce\nStreamVoice+, an enhanced LM-based end-to-end streaming framework that operates\nindependently of streaming ASR. StreamVoice+ integrates a semantic encoder and\na connector with the original StreamVoice framework, now trained using a\nnon-streaming ASR. This model undergoes a two-stage training process:\ninitially, the StreamVoice backbone is pre-trained for voice conversion and the\nsemantic encoder for robust semantic extraction. Subsequently, the system is\nfine-tuned end-to-end, incorporating a LoRA matrix to activate comprehensive\nstreaming functionality. Furthermore, StreamVoice+ mainly introduces two\nstrategic enhancements to boost conversion quality: a residual compensation\nmechanism in the connector to ensure effective semantic transmission and a\nself-refinement strategy that leverages pseudo-parallel speech pairs generated\nby the conversion backbone to improve speech decoupling. Experiments\ndemonstrate that StreamVoice+ not only achieves higher naturalness and speaker\nsimilarity in voice conversion than its predecessor but also provides versatile\nsupport for both streaming and non-streaming conversion scenarios.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Sound"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}