{"id":"2408.08623","title":"SketchRef: A Benchmark Dataset and Evaluation Metrics for Automated\n  Sketch Synthesis","authors":"Xingyue Lin, Xingjian Hu, Shuai Peng, Jianhua Zhu, Liangcai Gao","authorsParsed":[["Lin","Xingyue",""],["Hu","Xingjian",""],["Peng","Shuai",""],["Zhu","Jianhua",""],["Gao","Liangcai",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 09:32:26 GMT"}],"updateDate":"2024-08-19","timestamp":1723800746000,"abstract":"  Sketch, a powerful artistic technique to capture essential visual information\nabout real-world objects, is increasingly gaining attention in the image\nsynthesis field. However, evaluating the quality of synthesized sketches\npresents unique unsolved challenges. Current evaluation methods for sketch\nsynthesis are inadequate due to the lack of a unified benchmark dataset,\nover-reliance on classification accuracy for recognizability, and unfair\nevaluation of sketches with different levels of simplification. To address\nthese issues, we introduce SketchRef, a benchmark dataset comprising 4\ncategories of reference photos--animals, human faces, human bodies, and common\nobjects--alongside novel evaluation metrics. Considering that classification\naccuracy is insufficient to measure the structural consistency between a sketch\nand its reference photo, we propose the mean Object Keypoint Similarity (mOKS)\nmetric, utilizing pose estimation to assess structure-level recognizability. To\nensure fair evaluation sketches with different simplification levels, we\npropose a recognizability calculation method constrained by simplicity. We also\ncollect 8K responses from art enthusiasts, validating the effectiveness of our\nproposed evaluation methods. We hope this work can provide a comprehensive\nevaluation of sketch synthesis algorithms, thereby aligning their performance\nmore closely with human understanding.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}