{"id":"2408.07031","title":"Compact groups of galaxies in GAMA -- Probing the densest minor systems\n  at intermediate redshifts","authors":"A. Zandivarez (1), E. Diaz-Gimenez (1), A. Taverna (1 and 2), F.\n  Rodriguez (1), M. Merchan ((1) OAC/UNC - IATE/CONICET/UNC - (2) IAE-UNAM)","authorsParsed":[["Zandivarez","A.","","OAC/UNC - IATE/CONICET/UNC -"],["Diaz-Gimenez","E.","","OAC/UNC - IATE/CONICET/UNC -"],["Taverna","A.","","1 and 2"],["Rodriguez","F.","","OAC/UNC - IATE/CONICET/UNC -"],["Merchan","M.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 16:51:23 GMT"}],"updateDate":"2024-08-14","timestamp":1723567883000,"abstract":"  [Abridged] Over the years, several compact group catalogues have been built\nusing different methods, but most of them are not deep enough to go beyond the\nvery local universe with a high level of redshift completeness. We build\nstatistically reliable samples of compact groups to study the influence of\ntheir inner extreme environment at intermediate redshifts. We adopted the GAMA\nredshift survey as a parent catalogue, complemented with galaxies from the\nSDSS, to identify compact groups using Hickson-like criteria. We explored the\nparameter space to perform several identifications: we reduced the maximum\ngalaxy separation in the line-of-sight to 500 km/s and we implemented different\nmagnitude ranges to define membership. For comparison, we used control samples\nextracted from a catalogue of loose groups to contrast properties with the\ncompact groups. We build five considerably large compact group samples, ranging\nfrom more than 400 up to ~2400 systems, and maximum redshifts from 0.2 to 0.4.\nThe overall properties of each sample are in agreement with previous findings.\nCompact groups tend to have a larger fraction of quenched galaxies than control\nloose groups, mainly for low stellar mass galaxies in compact groups with small\ncrossing times. In addition, ~45% of compact groups are embedded in loose\ngalaxy systems and display the highest compactness, lowest crossing times and\nbrightest first-ranked galaxies compared to compact groups considered\nnon-embedded or isolated. There is almost no evolution of compact group\nproperties with redshift. Our results confirm previous findings that postulate\ncompact groups as one of the suitable places to study the suppression of the\nstar formation rate in galaxies primarily due to galaxy interactions. These new\nsamples will be valuable to deepen the analysis of these peculiar galaxy\nsystems in a redshift regime poorly explored so far.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}