{"id":"2408.13925","title":"Infrared Domain Adaptation with Zero-Shot Quantization","authors":"Burak Sevsay, Erdem Akag\\\"und\\\"uz","authorsParsed":[["Sevsay","Burak",""],["Akagündüz","Erdem",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 19:47:40 GMT"}],"updateDate":"2024-08-27","timestamp":1724615260000,"abstract":"  Quantization is one of the most popular techniques for reducing computation\ntime and shrinking model size. However, ensuring the accuracy of quantized\nmodels typically involves calibration using training data, which may be\ninaccessible due to privacy concerns. In such cases, zero-shot quantization, a\ntechnique that relies on pretrained models and statistical information without\nthe need for specific training data, becomes valuable. Exploring zero-shot\nquantization in the infrared domain is important due to the prevalence of\ninfrared imaging in sensitive fields like medical and security applications. In\nthis work, we demonstrate how to apply zero-shot quantization to an object\ndetection model retrained with thermal imagery. We use batch normalization\nstatistics of the model to distill data for calibration. RGB image-trained\nmodels and thermal image-trained models are compared in the context of\nzero-shot quantization. Our investigation focuses on the contributions of mean\nand standard deviation statistics to zero-shot quantization performance.\nAdditionally, we compare zero-shot quantization with post-training quantization\non a thermal dataset. We demonstrated that zero-shot quantization successfully\ngenerates data that represents the training dataset for the quantization of\nobject detection models. Our results indicate that our zero-shot quantization\nframework is effective in the absence of training data and is well-suited for\nthe infrared domain.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2mKfffeh0v4wQoGzcKbSN0IzKELmbIJQbyK_kcwa_0U","pdfSize":"1987649"}
