{"id":"2408.01659","title":"Self-Supervised Learning for Effective Denoising of Flow Fields","authors":"Linqi Yu, Mustafa Z. Yousif, Dan Zhou, Meng Zhang, Jungsub Lee, and\n  Hee-Chang Lim","authorsParsed":[["Yu","Linqi",""],["Yousif","Mustafa Z.",""],["Zhou","Dan",""],["Zhang","Meng",""],["Lee","Jungsub",""],["Lim","Hee-Chang",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 04:13:56 GMT"}],"updateDate":"2024-08-06","timestamp":1722658436000,"abstract":"  In this study, we proposed an efficient approach based on a deep learning\n(DL) denoising autoencoder (DAE) model for denoising noisy flow fields. The DAE\noperates on a self-learning principle and does not require clean data as\ntraining labels. Furthermore, investigations into the denoising mechanism of\nthe DAE revealed that its bottleneck structure with a compact latent space\nenhances denoising efficacy. Meanwhile, we also developed a deep multiscale DAE\nfor denoising turbulent flow fields. Furthermore, we used conventional noise\nfilters to denoise the flow fields and performed a comparative analysis with\nthe results from the DL method. The effectiveness of the proposed DL models was\nevaluated using direct numerical simulation data of laminar flow around a\nsquare cylinder and turbulent channel flow data at various Reynolds numbers.\nFor every case, synthetic noise was augmented in the data. A separate\nexperiment used particle-image velocimetry data of laminar flow around a square\ncylinder containing real noise to test DAE denoising performance. Instantaneous\ncontours and flow statistical results were used to verify the alignment between\nthe denoised data and ground truth. The findings confirmed that the proposed\nmethod could effectively denoise noisy flow data, including turbulent flow\nscenarios. Furthermore, the proposed method exhibited excellent generalization,\nefficiently denoising noise with various types and intensities.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}