{"id":"2408.05803","title":"Prototype Learning Guided Hybrid Network for Breast Tumor Segmentation\n  in DCE-MRI","authors":"Lei Zhou, Yuzhong Zhang, Jiadong Zhang, Xuejun Qian, Chen Gong, Kun\n  Sun, Zhongxiang Ding, Xing Wang, Zhenhui Li, Zaiyi Liu, and Dinggang Shen","authorsParsed":[["Zhou","Lei",""],["Zhang","Yuzhong",""],["Zhang","Jiadong",""],["Qian","Xuejun",""],["Gong","Chen",""],["Sun","Kun",""],["Ding","Zhongxiang",""],["Wang","Xing",""],["Li","Zhenhui",""],["Liu","Zaiyi",""],["Shen","Dinggang",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 15:46:00 GMT"}],"updateDate":"2024-08-13","timestamp":1723391160000,"abstract":"  Automated breast tumor segmentation on the basis of dynamic\ncontrast-enhancement magnetic resonance imaging (DCE-MRI) has shown great\npromise in clinical practice, particularly for identifying the presence of\nbreast disease. However, accurate segmentation of breast tumor is a challenging\ntask, often necessitating the development of complex networks. To strike an\noptimal trade-off between computational costs and segmentation performance, we\npropose a hybrid network via the combination of convolution neural network\n(CNN) and transformer layers. Specifically, the hybrid network consists of a\nencoder-decoder architecture by stacking convolution and decovolution layers.\nEffective 3D transformer layers are then implemented after the encoder\nsubnetworks, to capture global dependencies between the bottleneck features. To\nimprove the efficiency of hybrid network, two parallel encoder subnetworks are\ndesigned for the decoder and the transformer layers, respectively. To further\nenhance the discriminative capability of hybrid network, a prototype learning\nguided prediction module is proposed, where the category-specified prototypical\nfeatures are calculated through on-line clustering. All learned prototypical\nfeatures are finally combined with the features from decoder for tumor mask\nprediction. The experimental results on private and public DCE-MRI datasets\ndemonstrate that the proposed hybrid network achieves superior performance than\nthe state-of-the-art (SOTA) methods, while maintaining balance between\nsegmentation accuracy and computation cost. Moreover, we demonstrate that\nautomatically generated tumor masks can be effectively applied to identify\nHER2-positive subtype from HER2-negative subtype with the similar accuracy to\nthe analysis based on manual tumor segmentation. The source code is available\nat https://github.com/ZhouL-lab/PLHN.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}