{"id":"2408.16510","title":"Anomalous amplitude mode dynamics below the expected charge-density-wave\n  transition in 1$T$-VSe$_2$","authors":"Charles J. Sayers, Giovanni Marini, Matteo Calandra, Hamoon Hedayat,\n  Xuanbo Feng, Erik van Heumen, Christoph Gadermaier, Stefano Dal Conte, Giulio\n  Cerullo","authorsParsed":[["Sayers","Charles J.",""],["Marini","Giovanni",""],["Calandra","Matteo",""],["Hedayat","Hamoon",""],["Feng","Xuanbo",""],["van Heumen","Erik",""],["Gadermaier","Christoph",""],["Conte","Stefano Dal",""],["Cerullo","Giulio",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 13:16:40 GMT"}],"updateDate":"2024-08-30","timestamp":1724937400000,"abstract":"  A charge-density-wave (CDW) is characterized by a dynamical order parameter\nconsisting of a time-dependent amplitude and phase, which manifest as\noptically-active collective modes of the CDW phase. Studying the behaviour of\nsuch collective modes in the time-domain, and their coupling with electronic\nand lattice order, provides important insight into the underlying mechanisms\nbehind CDW formation. In this work, we report on femtosecond broadband\ntransient reflectivity experiments on bulk 1$T$-VSe$_2$ using near-infrared\nexcitation. At low temperature, we observe coherent oscillations associated\nwith the CDW amplitude mode and phonons of the distorted lattice. Across the\nexpected transition temperature at 110 K, we confirm signatures of a\nrearrangement of the electronic structure evident in the quasiparticle\ndynamics. However, we find that the amplitude mode instead softens to zero\nfrequency at 80 K, possibly indicating an additional phase transition at this\ntemperature. In addition, we demonstrate photoinduced CDW melting, associated\nwith a collapse of the electronic and lattice order, which occurs at moderate\nexcitation densities, consistent with a dominant electron-phonon CDW mechanism.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}