{"id":"2408.00626","title":"Estimating quantum Markov chains using coherent absorber post-processing\n  and pattern counting estimator","authors":"Federico Girotti, Alfred Godley and M\\u{a}d\\u{a}lin Gu\\c{t}\\u{a}","authorsParsed":[["Girotti","Federico",""],["Godley","Alfred",""],["Guţă","Mădălin",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 15:12:01 GMT"}],"updateDate":"2024-08-02","timestamp":1722525121000,"abstract":"  We propose a two step strategy for estimating one-dimensional dynamical\nparameters of a quantum Markov chain, which involves quantum post-processing\nthe output using a coherent quantum absorber and a \"pattern counting''\nestimator computed as a simple additive functional of the outcomes trajectory\nproduced by sequential, identical measurements on the output units. We provide\nstrong theoretical and numerical evidence that the estimator achieves the\nquantum Cram\\'{e}-Rao bound in the limit of large output size. Our estimation\nmethod is underpinned by an asymptotic theory of translationally invariant\nmodes (TIMs) built as averages of shifted tensor products of output operators,\nlabelled by binary patterns. For large times, the TIMs form a bosonic algebra\nand the output state approaches a joint coherent state of the TIMs whose\namplitude depends linearly on the mismatch between system and absorber\nparameters. Moreover, in the asymptotic regime the TIMs capture the full\nquantum Fisher information of the output state. While directly probing the\nTIMs' quadratures seems impractical, we show that the standard sequential\nmeasurement is an effective joint measurement of all the TIMs number operators;\nindeed, we show that counts of different binary patterns extracted from the\nmeasurement trajectory have the expected joint Poisson distribution. Together\nwith the displaced-null methodology of J. Phys. A: Math. Theor. 57 245304 2024\nthis provides a computationally efficient estimator which only depends on the\ntotal number of patterns. This opens the way for similar estimation strategies\nin continuous-time dynamics, expanding the results of Phys. Rev. X 13, 031012\n2023.\n","subjects":["Physics/Quantum Physics","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}