{"id":"2408.11587","title":"Large Language Models are Good Attackers: Efficient and Stealthy Textual\n  Backdoor Attacks","authors":"Ziqiang Li, Yueqi Zeng, Pengfei Xia, Lei Liu, Zhangjie Fu, Bin Li","authorsParsed":[["Li","Ziqiang",""],["Zeng","Yueqi",""],["Xia","Pengfei",""],["Liu","Lei",""],["Fu","Zhangjie",""],["Li","Bin",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 12:50:23 GMT"}],"updateDate":"2024-08-22","timestamp":1724244623000,"abstract":"  With the burgeoning advancements in the field of natural language processing\n(NLP), the demand for training data has increased significantly. To save costs,\nit has become common for users and businesses to outsource the labor-intensive\ntask of data collection to third-party entities. Unfortunately, recent research\nhas unveiled the inherent risk associated with this practice, particularly in\nexposing NLP systems to potential backdoor attacks. Specifically, these attacks\nenable malicious control over the behavior of a trained model by poisoning a\nsmall portion of the training data. Unlike backdoor attacks in computer vision,\ntextual backdoor attacks impose stringent requirements for attack stealthiness.\nHowever, existing attack methods meet significant trade-off between\neffectiveness and stealthiness, largely due to the high information entropy\ninherent in textual data. In this paper, we introduce the Efficient and\nStealthy Textual backdoor attack method, EST-Bad, leveraging Large Language\nModels (LLMs). Our EST-Bad encompasses three core strategies: optimizing the\ninherent flaw of models as the trigger, stealthily injecting triggers with\nLLMs, and meticulously selecting the most impactful samples for backdoor\ninjection. Through the integration of these techniques, EST-Bad demonstrates an\nefficient achievement of competitive attack performance while maintaining\nsuperior stealthiness compared to prior methods across various text classifier\ndatasets.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9YcUi9eQQ_s1ljGFLgVfvVRxpT1Qs9NG-S8NPu8qYYU","pdfSize":"1053109"}
