{"id":"2408.02926","title":"A Deep Reinforcement Learning Approach for Cost Optimized Workflow\n  Scheduling in Cloud Computing Environments","authors":"Amanda Jayanetti, Saman Halgamuge, and Rajkumar Buyya","authorsParsed":[["Jayanetti","Amanda",""],["Halgamuge","Saman",""],["Buyya","Rajkumar",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 03:21:11 GMT"}],"updateDate":"2024-08-07","timestamp":1722914471000,"abstract":"  Cost optimization is a common goal of workflow schedulers operating in cloud\ncomputing environments. The use of spot instances is a potential means of\nachieving this goal, as they are offered by cloud providers at discounted\nprices compared to their on-demand counterparts in exchange for reduced\nreliability. This is due to the fact that spot instances are subjected to\ninterruptions when spare computing capacity used for provisioning them is\nneeded back owing to demand variations. Also, the prices of spot instances are\nnot fixed as pricing is dependent on long term supply and demand. The\npossibility of interruptions and pricing variations associated with spot\ninstances adds a layer of uncertainty to the general problem of workflow\nscheduling across cloud computing environments. These challenges need to be\nefficiently addressed for enjoying the cost savings achievable with the use of\nspot instances without compromising the underlying business requirements. To\nthis end, in this paper we use Deep Reinforcement Learning for developing an\nautonomous agent capable of scheduling workflows in a cost efficient manner by\nusing an intelligent mix of spot and on-demand instances. The proposed solution\nis implemented in the open source container native Argo workflow engine that is\nwidely used for executing industrial workflows. The results of the experiments\ndemonstrate that the proposed scheduling method is capable of outperforming the\ncurrent benchmarks.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rXeBBZyjpsgfO3NEE9HQ6g-v0VGwfyXaciY0hVs_0Ng","pdfSize":"1875043"}
