{"id":"2408.03058","title":"A dual-cutoff machine-learned potential for condensed organic systems\n  obtained via uncertainty-guided active learning","authors":"Leonid Kahle, Benoit Minisini, Tai Bui, Jeremy T. First, Corneliu\n  Buda, Thomas Goldman, Erich Wimmer","authorsParsed":[["Kahle","Leonid",""],["Minisini","Benoit",""],["Bui","Tai",""],["First","Jeremy T.",""],["Buda","Corneliu",""],["Goldman","Thomas",""],["Wimmer","Erich",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 09:21:07 GMT"}],"updateDate":"2024-08-07","timestamp":1722936067000,"abstract":"  Machine-learned potentials (MLPs) trained on ab initio data combine the\ncomputational efficiency of classical interatomic potentials with the accuracy\nand generality of the first-principles method used in the creation of the\nrespective training set. In this work, we implement and train a MLP to obtain\nan accurate description of the potential energy surface and property\npredictions for organic compounds, as both single molecules and in the\ncondensed phase. We devise a dual descriptor, based on the atomic cluster\nexpansion (ACE), that couples an information-rich short-range description with\na coarser long-range description that captures weak intermolecular\ninteractions. We employ uncertainty-guided active learning for the training set\ngeneration, creating a dataset that is comparatively small for the breadth of\napplication and consists of alcohols, alkanes, and an adipate. Utilizing that\nMLP, we calculate densities of those systems of varying chain lengths as a\nfunction of temperature, obtaining a discrepancy of less than 4% compared with\nexperiment. Vibrational frequencies calculated with the MLP have a root mean\nsquare error of less than 1 THz compared to DFT. The heat capacities of\ncondensed systems are within 11% of experimental findings, which is strong\nevidence that the dual descriptor provides an accurate framework for the\nprediction of both short-range intramolecular and long-range intermolecular\ninteractions.\n","subjects":["Physics/Chemical Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}