{"id":"2408.02247","title":"Contrastive Learning and Abstract Concepts: The Case of Natural Numbers","authors":"Daniel N. Nissani (Nissensohn)","authorsParsed":[["Nissani","Daniel N.","","Nissensohn"]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 05:41:16 GMT"},{"version":"v2","created":"Sun, 11 Aug 2024 05:29:47 GMT"},{"version":"v3","created":"Thu, 15 Aug 2024 05:28:10 GMT"},{"version":"v4","created":"Tue, 3 Sep 2024 06:02:25 GMT"},{"version":"v5","created":"Wed, 11 Sep 2024 14:21:29 GMT"}],"updateDate":"2024-09-12","timestamp":1722836476000,"abstract":"  Contrastive Learning (CL) has been successfully applied to classification and\nother downstream tasks related to concrete concepts, such as objects contained\nin the ImageNet dataset. No attempts seem to have been made so far in applying\nthis promising scheme to more abstract entities. A prominent example of these\ncould be the concept of (discrete) Quantity. CL can be frequently interpreted\nas a self-supervised scheme guided by some profound and ubiquitous conservation\nprinciple (e.g. conservation of identity in object classification tasks). In\nthis introductory work we apply a suitable conservation principle to the\nsemi-abstract concept of natural numbers by which discrete quantities can be\nestimated or predicted. We experimentally show, by means of a toy problem, that\ncontrastive learning can be trained to count at a glance with high accuracy\nboth at human as well as at super-human ranges.. We compare this with the\nresults of a trained-to-count at a glance supervised learning (SL) neural\nnetwork scheme of similar architecture. We show that both schemes exhibit\nsimilar good performance on baseline experiments, where the distributions of\nthe training and testing stages are equal. Importantly, we demonstrate that in\nsome generalization scenarios, where training and testing distributions differ,\nCL boasts more robust and much better error performance.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BqkOXfYHTjzfs1U9StgjWR15EWPq0PL_An5U4cwcLKk","pdfSize":"707055","txDigest":"PEdFKHRU7WNbzcDC4zNv62AMtRWqwhYUkPRjkAwLNXs","endEpoch":"1","status":"CERTIFIED"}
