{"id":"2408.12856","title":"Reentrant polar phase induced by the ferro-ionic coupling in\n  Bi$_{1-x}$Sm$_x$FeO$_3$ nanoparticles","authors":"Anna N. Morozovska, Eugene A. Eliseev, Igor V. Fesych, Yuriy O.\n  Zagorodniy, Oleksandr S. Pylypchuk, Evgenii V. Leonenko, Maxim V. Rallev,\n  Andrii D. Yaremkevych, Lesya P. Yurchenko, Lesya Demchenko, Sergei V.\n  Kalinin, and Olena M. Fesenko","authorsParsed":[["Morozovska","Anna N.",""],["Eliseev","Eugene A.",""],["Fesych","Igor V.",""],["Zagorodniy","Yuriy O.",""],["Pylypchuk","Oleksandr S.",""],["Leonenko","Evgenii V.",""],["Rallev","Maxim V.",""],["Yaremkevych","Andrii D.",""],["Yurchenko","Lesya P.",""],["Demchenko","Lesya",""],["Kalinin","Sergei V.",""],["Fesenko","Olena M.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 05:50:44 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 09:57:02 GMT"}],"updateDate":"2024-08-27","timestamp":1724392244000,"abstract":"  Using the model of four sublattices, the Landau-Ginzburg-Devonshire-Kittel\nphenomenological approach and the Stephenson-Highland ionic adsorption model\nfor the description of coupled polar and antipolar long-range orders in\nferroics, we calculated analytically the phase diagrams and polar properties of\nBi$_{1-x}$Sm$_x$FeO$_3$ nanoparticles covered by surface ions in dependence on\ntheir size, surface ions density, samarium content \"x\" and temperature. The\nsize effects and ferro-ionic coupling govern the appearance and stability\nconditions of the long-range ordered ferroelectric, reentrant ferrielectric and\nantiferroelectric phases in the Bi1-xSmxFeO3 nanoparticles. Calculated phase\ndiagrams are in a qualitative agreement with the X-ray diffraction phase\nanalysis, electron paramagnetic resonance, infra-red spectroscopy and\nelectrophysical measurements of the Bi$_{1-x}$Sm$_x$FeO$_3$ nanopowders\nsintered by the solution combustion method. The combined\ntheoretical-experimental approach allows to establish the influence of the\nferro-ionic coupling and size effects in Bi$_{1-x}$Sm$_x$FeO$_3$ nanoparticles\non their polar properties.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}