{"id":"2408.16417","title":"3D Topological Modeling and Multi-Agent Movement Simulation for Viral\n  Infection Risk Analysis","authors":"Wassim Jabi, Yidan Xue, Thomas E. Woolley, Katerina Kaouri","authorsParsed":[["Jabi","Wassim",""],["Xue","Yidan",""],["Woolley","Thomas E.",""],["Kaouri","Katerina",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 10:22:51 GMT"}],"updateDate":"2024-08-30","timestamp":1724926971000,"abstract":"  In this paper, a method to study how the design of indoor spaces and people's\nmovement within them affect disease spread is proposed by integrating\ncomputer-aided modeling, multi-agent movement simulation, and airborne viral\ntransmission modeling. Topologicpy spatial design and analysis software is used\nto model indoor environments, connect spaces, and construct a navigation graph.\nPathways for agents, each with unique characteristics such as walking speed,\ninfection status, and activities, are computed using this graph. Agents follow\na schedule of events with specific locations and times. The software calculates\n\"time-to-leave\" based on walking speed and event start times, and agents are\nmoved along the shortest path within the navigation graph, accurately\nconsidering obstacles, doorways, and walls. Precise distance calculations\nbetween agents are enabled by this setup. Viral aerosol concentration is then\ncomputed and visualized using a reaction-diffusion equation, and each agent's\ninfection risk is determined with an extension of the Wells-Riley ansatz.\nInfection risk simulations are improved by this spatio-temporal and topological\napproach, incorporating realistic human behavior and spatial dynamics. The\nresulting software is designed as a rapid decision-support tool for\npolicymakers, facility managers, stakeholders, architects, and engineers to\nmitigate disease spread in existing buildings and inform the design of new\nones. The software's effectiveness is demonstrated through a comparative\nanalysis of cellular and open commercial office plan layouts.\n","subjects":["Computing Research Repository/Multiagent Systems","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/"}