{"id":"2408.13038","title":"Improving the Classification Effect of Clinical Images of Diseases for\n  Multi-Source Privacy Protection","authors":"Tian Bowen, Xu Zhengyang, Yin Zhihao, Wang Jingying, Yue Yutao","authorsParsed":[["Bowen","Tian",""],["Zhengyang","Xu",""],["Zhihao","Yin",""],["Jingying","Wang",""],["Yutao","Yue",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 12:52:24 GMT"}],"updateDate":"2024-08-26","timestamp":1724417544000,"abstract":"  Privacy data protection in the medical field poses challenges to data\nsharing, limiting the ability to integrate data across hospitals for training\nhigh-precision auxiliary diagnostic models. Traditional centralized training\nmethods are difficult to apply due to violations of privacy protection\nprinciples. Federated learning, as a distributed machine learning framework,\nhelps address this issue, but it requires multiple hospitals to participate in\ntraining simultaneously, which is hard to achieve in practice. To address these\nchallenges, we propose a medical privacy data training framework based on data\nvectors. This framework allows each hospital to fine-tune pre-trained models on\nprivate data, calculate data vectors (representing the optimization direction\nof model parameters in the solution space), and sum them up to generate\nsynthetic weights that integrate model information from multiple hospitals.\nThis approach enhances model performance without exchanging private data or\nrequiring synchronous training. Experimental results demonstrate that this\nmethod effectively utilizes dispersed private data resources while protecting\npatient privacy. The auxiliary diagnostic model trained using this approach\nsignificantly outperforms models trained independently by a single hospital,\nproviding a new perspective for resolving the conflict between medical data\nprivacy protection and model training and advancing the development of medical\nintelligence.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}