{"id":"2408.01066","title":"Stabilization of synchronous tridiagonal network motion","authors":"Luca Dieci, Cinzia Elia, Alessandro Pugliese","authorsParsed":[["Dieci","Luca",""],["Elia","Cinzia",""],["Pugliese","Alessandro",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 07:40:21 GMT"}],"updateDate":"2024-08-05","timestamp":1722584421000,"abstract":"  We consider a network of identical agents, coupled through linear asymmetric\ncoupling. An important case is when each agent has an asymptotically stable\nperiodic orbit, so that the full network inherits a synchronous periodic orbit,\nbut also chaotic trajectories are of interest. In this work, we will restrict\nto \"nearest-neighbor\" type of couplings.\n  The Master Stability Function (MSF) is a powerful tool to establish local\nstability of the synchronous orbit, in particular a negative MSF implies\nasymptotic stability. But not every network structure gives a negative MSF.\nMoreover, there are many situations where in order to obtain a negative MSF,\nsymmetric networks need a coupling strength so large, that the model bears\nlittle physical interest. We make two main contributions: (i) Given a\ntridiagonal nearest neighbor topology, we show how it is possible to choose\nappropriate coupling so that the synchronous orbit is stable, and (ii) we show\nthat this stability comes without the need of a large coupling strength if the\nstructure is not symmetric. Our construction is based on solving inverse\neigenvalue problems. We will see that the coupling of the agents cannot always\nbe chosen to be symmetric so that the underlying graph structure is that of a\ndirected graph with edges having different weights. We provide numerical\nimplementation of our technique on networks of van der Pol and of chaotic\nR\\\"ossler oscillators, where the standard symmetric nearest neighbor coupling\nfails to give stability of the synchronous orbit.\n","subjects":["Mathematics/Dynamical Systems","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}