{"id":"2408.11792","title":"Optical ISAC: Fundamental Performance Limits and Transceiver Design","authors":"Alireza Ghazavi Khorasgani, Mahtab Mirmohseni, Ahmed Elzanaty","authorsParsed":[["Khorasgani","Alireza Ghazavi",""],["Mirmohseni","Mahtab",""],["Elzanaty","Ahmed",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 17:25:40 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 00:56:20 GMT"},{"version":"v3","created":"Fri, 23 Aug 2024 17:14:36 GMT"}],"updateDate":"2024-08-26","timestamp":1724261140000,"abstract":"  This paper characterizes the optimal capacity-distortion (C-D) tradeoff in an\noptical point-to-point (P2P) system with single-input single-output for\ncommunication and single-input multiple-output for sensing (SISO-COM and\nSIMO-SEN) within an integrated sensing and communication (ISAC) framework. We\nconsider the optimal rate-distortion (R-D) region and explore several inner\n(IB) and outer (OB) bounds. We introduce practical, asymptotically optimal\nmaximum a posteriori (MAP) and maximum likelihood estimators (MLE) for target\ndistance, addressing nonlinear measurement-to-state relationships and\nnon-conjugate priors. As the number of sensing antennas increases, these\nestimators converge to the Bayesian Cram\\'er-Rao bound (BCRB). We also\nestablish that the achievable rate-CRB (AR-CRB) serves as an OB for the optimal\nC-D region, valid for both unbiased estimators and asymptotically large numbers\nof receive antennas. To clarify that the input distribution determines the\ntradeoff across the Pareto boundary of the C-D region, we propose two\nalgorithms: \\textit{i}) an iterative Blahut-Arimoto algorithm (BAA)-type\nmethod, and \\textit{ii}) a memory-efficient closed-form (CF) approach. The CF\napproach includes a CF optimal distribution for high optical signal-to-noise\nratio (O-SNR) conditions. Additionally, we adapt and refine the\nDeterministic-Random Tradeoff (DRT) to this optical ISAC context.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Machine Learning","Mathematics/Information Theory","Statistics/Applications","Statistics/Computation"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}