{"id":"2408.17142","title":"Recursive Attentive Pooling for Extracting Speaker Embeddings from\n  Multi-Speaker Recordings","authors":"Shota Horiguchi, Atsushi Ando, Takafumi Moriya, Takanori Ashihara,\n  Hiroshi Sato, Naohiro Tawara, Marc Delcroix","authorsParsed":[["Horiguchi","Shota",""],["Ando","Atsushi",""],["Moriya","Takafumi",""],["Ashihara","Takanori",""],["Sato","Hiroshi",""],["Tawara","Naohiro",""],["Delcroix","Marc",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 09:34:21 GMT"}],"updateDate":"2024-09-02","timestamp":1725010461000,"abstract":"  This paper proposes a method for extracting speaker embedding for each\nspeaker from a variable-length recording containing multiple speakers. Speaker\nembeddings are crucial not only for speaker recognition but also for various\nmulti-speaker speech applications such as speaker diarization and\ntarget-speaker speech processing. Despite the challenges of obtaining a single\nspeaker's speech without pre-registration in multi-speaker scenarios, most\nstudies on speaker embedding extraction focus on extracting embeddings only\nfrom single-speaker recordings. Some methods have been proposed for extracting\nspeaker embeddings directly from multi-speaker recordings, but they typically\nrequire preparing a model for each possible number of speakers or involve\ncomplicated training procedures. The proposed method computes the embeddings of\nmultiple speakers by focusing on different parts of the frame-wise embeddings\nextracted from the input multi-speaker audio. This is achieved by recursively\ncomputing attention weights for pooling the frame-wise embeddings.\nAdditionally, we propose using the calculated attention weights to estimate the\nnumber of speakers in the recording, which allows the same model to be applied\nto various numbers of speakers. Experimental evaluations demonstrate the\neffectiveness of the proposed method in speaker verification and diarization\ntasks.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Sound"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}