{"id":"2408.07417","title":"The Restaurant Meal Delivery Problem with Ghost Kitchens","authors":"Gal Neria, Florentin D Hildebrandt, Michal Tzur, Marlin W Ulmer","authorsParsed":[["Neria","Gal",""],["Hildebrandt","Florentin D",""],["Tzur","Michal",""],["Ulmer","Marlin W",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 09:54:03 GMT"}],"updateDate":"2024-08-15","timestamp":1723629243000,"abstract":"  Restaurant meal delivery has been rapidly growing in the last few years. The\nmain challenges in operating it are the temporally and spatially dispersed\nstochastic demand that arrives from customers all over town as well as the\ncustomers' expectation of timely and fresh delivery. To overcome these\nchallenges a new business concept emerged, \"Ghost kitchens\". This concept\nproposes synchronized food preparation of several restaurants in a central\ncomplex, exploiting consolidation benefits. However, dynamically scheduling\nfood preparation and delivery is challenging and we propose operational\nstrategies for the effective operations of ghost kitchens. We model the problem\nas a sequential decision process. For the complex, combinatorial decision space\nof scheduling order preparations, consolidating orders to trips, and scheduling\ntrip departures, we propose a large neighborhood search procedure based on\npartial decisions and driven by analytical properties. Within the large\nneighborhood search, decisions are evaluated via a value function\napproximation, enabling anticipatory and real-time decision making. We show the\neffectiveness of our method and demonstrate the value of ghost kitchens\ncompared to conventional meal delivery systems. We show that both integrated\noptimization of cook scheduling and vehicle dispatching, as well as\nanticipation of future demand and decisions, are essential for successful\noperations. We further derive several managerial insights, amongst others, that\ncompanies should carefully consider the trade-off between fast delivery and\nfresh food.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NS62fdlNM1X8jDEgh241MxSS9ksBjwNCevkmSlBydvY","pdfSize":"756007"}
