{"id":"2408.09767","title":"Propagating the prior from shallow to deep with a pre-trained\n  velocity-model Generative Transformer network","authors":"Randy Harsuko, Shijun Cheng, Tariq Alkhalifah","authorsParsed":[["Harsuko","Randy",""],["Cheng","Shijun",""],["Alkhalifah","Tariq",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 07:56:43 GMT"}],"updateDate":"2024-08-20","timestamp":1724054203000,"abstract":"  Building subsurface velocity models is essential to our goals in utilizing\nseismic data for Earth discovery and exploration, as well as monitoring. With\nthe dawn of machine learning, these velocity models (or, more precisely, their\ndistribution) can be stored accurately and efficiently in a generative model.\nThese stored velocity model distributions can be utilized to regularize or\nquantify uncertainties in inverse problems, like full waveform inversion.\nHowever, most generators, like normalizing flows or diffusion models, treat the\nimage (velocity model) uniformly, disregarding spatial dependencies and\nresolution changes with respect to the observation locations. To address this\nweakness, we introduce VelocityGPT, a novel implementation that utilizes\nTransformer decoders trained autoregressively to generate a velocity model from\nshallow subsurface to deep. Owing to the fact that seismic data are often\nrecorded on the Earth's surface, a top-down generator can utilize the inverted\ninformation in the shallow as guidance (prior) to generating the deep. To\nfacilitate the implementation, we use an additional network to compress the\nvelocity model. We also inject prior information, like well or structure\n(represented by a migration image) to generate the velocity model. Using\nsynthetic data, we demonstrate the effectiveness of VelocityGPT as a promising\napproach in generative model applications for seismic velocity model building.\n","subjects":["Physics/Geophysics","Computing Research Repository/Artificial Intelligence","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}