{"id":"2408.03112","title":"Competition between Kondo Effect and RKKY Coupling","authors":"Stefan Kettemann","authorsParsed":[["Kettemann","Stefan",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 11:38:46 GMT"}],"updateDate":"2024-08-07","timestamp":1722944326000,"abstract":"  When magnetic moments are immersed into the Fermi sea of itinerant electrons,\nrich quantum physics emerges. This is relevant for a wide range of materials\nincluding heavy Fermion systems, high temperature superconductors like the\ncuprates, but also good metals with magnetic impurities, doped semiconductors\nlike Si:P close to the metal-insulator transition, 2D materials like graphene\nand topological insulators. While each material has its specific properties,\nrequiring detailed modelling, their electronic properties are to some degree\ngoverned by the competition between Kondo screening and indirect exchange\ncouplings. In these lecture notes we give an introduction, starting with a\nreview of formation of magnetic moments, the theory of the Kondo effect for a\nsingle magnetic impurity in a metal host and the derivation of RKKY coupling\nbetween magnetic impurities in a metal host. We review the Doniach diagram and\nKondo lattice physics and give an introduction to a self consistent\nrenormalization group theory, taking into account Kondo effect and RKKY\ncoupling between magnetic impurities and review results obtained thereby. We\nreview the effect of gaps and pseudo gaps on Kondo effect and RKKY couplings,\nand on their competition. Especially for dilute concentration of magnetic\nmoments, disorder effects from randomly distributed impurities result in a\ndistribution of both Kondo temperatures and RKKY couplings. Then, their\ncompetition becomes an even more complex problem. Moreover, disorder induced\nAnderson localization transitions may occur, affecting both Kondo effect and\nRKKY coupling severely, and changing their competition. These disorder effects\non the spin competition are introduced and recent results are reviewed. We\nconclude with an outlook and list of, in our view, most pressing and\ninteresting open problems.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Disordered Systems and Neural Networks"],"license":"http://creativecommons.org/licenses/by/4.0/"}