{"id":"2408.08385","title":"On the full non-Gaussian Surprise statistic and the cosmological\n  concordance between DESI, SDSS and Pantheon+","authors":"Pedro Riba Mello, Miguel Quartin, Bjoern Malte Schaefer, Benedikt\n  Schosser","authorsParsed":[["Mello","Pedro Riba",""],["Quartin","Miguel",""],["Schaefer","Bjoern Malte",""],["Schosser","Benedikt",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 19:06:57 GMT"}],"updateDate":"2024-08-19","timestamp":1723748817000,"abstract":"  With the increasing precision of recent cosmological surveys and the\ndiscovery of important tensions within the $\\Lambda$CDM paradigm, it is\nbecoming more and more important to develop tools to quantify accurately the\ndiscordance between different probes. One such tool is the Surprise statistic,\na measure based on the Kullback-Leibler divergence. The Surprise, however, has\nbeen up to now applied only under its Gaussian approximation, which can fail to\nproperly capture discordance in cases that deviate significantly from\nGaussianity. In this paper we developed the klsurprise code which computes the\nfull numerical non-Gaussian Surprise, and analyse the Surprise for BAO + BBN\nand supernova data. We test different cosmological models, some of which the\nparameters deviate significantly from Gaussianity. We find that the\nnon-Gaussianities, mainly present in the Supernova dataset, change the Surprise\nstatistic significantly from its Gaussian approximation, and reveal a\n$2.7\\sigma$ tension in the curved $w$CDM model (o$w$CDM) between the combined\nPantheon+ and SH0ES (Pantheon+ & SH0ES) data and the dataset which combines\nSDSS, BOSS and eBOSS BAO. This tension is hidden in the Gaussian Surprise\napproximation. For DESI the tension with Pantheon+ & SH0ES is at the meager\n$1.9\\sigma$ level for o$w$CDM, but a large $3.3\\sigma$ for $\\Lambda$CDM.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aU1qn4zOH2xiXN4-nlEBPh8XiVh7WaZOQllUzJdbTjc","pdfSize":"2209389"}
