{"id":"2408.12939","title":"A cost-effective strategy of enhancing machine learning potentials by\n  transfer learning from a multicomponent dataset on {\\ae}net-PyTorch","authors":"An Niza El Aisnadaa, Kajjana Boonpalit Robin van der Kruit, Koen M.\n  Draijer, Jon Lopez-Zorrilla, Masahiro Miyauchi, Akira Yamaguchi, Nongnuch\n  Artrith","authorsParsed":[["Aisnadaa","An Niza El",""],["van der Kruit","Kajjana Boonpalit Robin",""],["Draijer","Koen M.",""],["Lopez-Zorrilla","Jon",""],["Miyauchi","Masahiro",""],["Yamaguchi","Akira",""],["Artrith","Nongnuch",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 09:41:43 GMT"}],"updateDate":"2024-08-26","timestamp":1724406103000,"abstract":"  Machine learning potentials (MLPs) offer efficient and accurate material\nsimulations, but constructing the reference ab initio database remains a\nsignificant challenge, particularly for catalyst-adsorbate systems. Training an\nMLP with a small dataset can lead to overfitting, thus limiting its practical\napplications. This study explores the feasibility of developing computationally\ncost-effective and accurate MLPs for catalyst-adsorbate systems with a limited\nnumber of ab initio references by leveraging a transfer learning strategy from\nsubsets of a comprehensive public database. Using the Open Catalyst Project\n2020 (OC20) -- a dataset closely related to our system of interest -- we\npre-trained MLP models on OC20 subsets using the {\\ae}net-PyTorch framework. We\ncompared several strategies for database subset selection. Our findings\nindicate that MLPs constructed via transfer learning exhibit better\ngeneralizability than those constructed from scratch, as demonstrated by the\nconsistency in the dynamics simulations. Remarkably, transfer learning enhances\nthe stability and accuracy of MLPs for the CuAu/H2O system with approximately\n600 reference data points. This approach achieved excellent extrapolation\nperformance in molecular dynamics (MD) simulations for the larger CuAu/6H2O\nsystem, sustaining up to 250 ps, whereas MLPs without transfer learning lasted\nless than 50 ps. We also examine the potential limitations of this strategy.\nThis work proposes an alternative, cost-effective approach for constructing\nMLPs for the challenging simulation of catalytic systems. Finally, we\nanticipate that this methodology will pave the way for broader applications in\nmaterial science and catalysis research, facilitating more efficient and\naccurate simulations across various systems.\n","subjects":["Condensed Matter/Disordered Systems and Neural Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"a9iLT8nrt816l88FiBc8sO-WR4oymCk1bC5OI7eF5Mc","pdfSize":"4946740"}
