{"id":"2408.07150","title":"The Potential of Combined Learning Strategies to Enhance Energy\n  Efficiency of Spiking Neuromorphic Systems","authors":"Ali Shiri Sichani, Sai Kankatala","authorsParsed":[["Sichani","Ali Shiri",""],["Kankatala","Sai",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 18:40:50 GMT"}],"updateDate":"2024-08-15","timestamp":1723574450000,"abstract":"  Ensuring energy-efficient design in neuromorphic computing systems\nnecessitates a tailored architecture combined with algorithmic approaches. This\nmanuscript focuses on enhancing brain-inspired perceptual computing machines\nthrough a novel combined learning approach for Convolutional Spiking Neural\nNetworks (CSNNs). CSNNs present a promising alternative to traditional\npower-intensive and complex machine learning methods like backpropagation,\noffering energy-efficient spiking neuron processing inspired by the human\nbrain. The proposed combined learning method integrates Pair-based Spike\nTiming-Dependent Plasticity (PSTDP) and power law-dependent\nSpike-timing-dependent plasticity (STDP) to adjust synaptic efficacies,\nenabling the utilization of stochastic elements like memristive devices to\nenhance energy efficiency and improve perceptual computing accuracy. By\nreducing learning parameters while maintaining accuracy, these systems consume\nless energy and have reduced area overhead, making them more suitable for\nhardware implementation. The research delves into neuromorphic design\narchitectures, focusing on CSNNs to provide a general framework for\nenergy-efficient computing hardware. Various CSNN architectures are evaluated\nto assess how less trainable parameters can maintain acceptable accuracy in\nperceptual computing systems, positioning them as viable candidates for\nneuromorphic architecture. Comparisons with previous work validate the\nachievements and methodology of the proposed architecture.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_gOIFjngmVAUMDNaGxLWeqLpZUdQEMDokTJuNBss_8A","pdfSize":"1469725"}
