{"id":"2408.00076","title":"Lower-mass-gap Black Holes in Dense Star Clusters","authors":"Claire S. Ye (CITA), Kyle Kremer, Scott M. Ransom, Frederic A. Rasio","authorsParsed":[["Ye","Claire S.","","CITA"],["Kremer","Kyle",""],["Ransom","Scott M.",""],["Rasio","Frederic A.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:00:04 GMT"}],"updateDate":"2024-08-02","timestamp":1722448804000,"abstract":"  The existence of compact stellar remnants in the mass range $2-5\\,M_{\\odot}$\nhas long been debated. This so-called lower mass gap was initially suggested by\nthe lack of low-mass X-ray binary observations with accretors in this mass\nrange, but it has recently been called into question following newer\nobservations, including a lower-mass-gap candidate with a millisecond pulsar\ncompanion in the dense globular cluster NGC~1851. Here we model NGC~1851 with a\ngrid of similar dense star clusters utilizing the state-of-the-art Monte Carlo\n$N$-body code \\texttt{CMC}, and we specifically study the formation of\nlower-mass-gap black holes. We demonstrate that both massive star evolution and\ndynamical interactions can contribute to forming lower-mass-gap black holes. In\ngeneral, the collapse of massive remnants formed through mergers of neutron\nstars or massive white dwarfs produces the largest number of lower-mass-gap\nblack holes among all formation channels. However, in more massive clusters,\nsupernova core collapse can contribute comparable numbers. Our NGC~1851-like\nmodels can reproduce millisecond pulsar -- lower-mass-gap black hole binaries\nsimilar to the observed system. Additionally, the lower-mass-gap black holes\ncan also become components of dynamically assembled binaries, and some will be\nin merging black hole--neutron star systems similar to the recently detected\ngravitational wave source GW230529. However, the corresponding merger rate is\nprobably $\\lesssim 1~{\\rm Gpc^{-3}\\,yr^{-1}}$.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}