{"id":"2408.15214","title":"EDGE: Predictable Scatter in the Stellar Mass--Halo Mass Relation of\n  Dwarf Galaxies","authors":"Stacy Y. Kim, Justin I. Read, Martin P. Rey, Matthew D. A. Orkney,\n  Sushanta Nigudkar, Andrew Pontzen, Ethan Taylor, Oscar Agertz, Payel Das","authorsParsed":[["Kim","Stacy Y.",""],["Read","Justin I.",""],["Rey","Martin P.",""],["Orkney","Matthew D. A.",""],["Nigudkar","Sushanta",""],["Pontzen","Andrew",""],["Taylor","Ethan",""],["Agertz","Oscar",""],["Das","Payel",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 17:23:27 GMT"}],"updateDate":"2024-08-28","timestamp":1724779407000,"abstract":"  The stellar-mass--halo-mass (SMHM) relation is central to our understanding\nof galaxy formation and the nature of dark matter. However, its normalisation,\nslope, and scatter are highly uncertain at dwarf galaxy scales. In this paper,\nwe present DarkLight, a new semi-empirical dwarf galaxy formation model\ndesigned to robustly predict the SMHM relation for the smallest galaxies.\nDarkLight harnesses a correlation between the mean star formation rate of\ndwarfs and their peak rotation speed -- the $\\langle$SFR$\\rangle$-$v_{\\rm max}$\nrelation -- that we derive from simulations and observations. Given the\nsparsity of data for isolated dwarfs with $v_{\\rm max} \\lesssim 20$ km/s, we\nfit the $\\langle$SFR$\\rangle$-$v_{\\rm max}$ relation to observational data for\ndwarfs above this velocity scale and to the high-resolution EDGE cosmological\nsimulations below. Reionisation quenching is implemented via distinct\n$\\langle$SFR$\\rangle$-$v_{\\rm max}$ relations before and after reionisation. We\nfind that the SMHM scatter is small at reionisation, $\\sim$0.2 dex, but rises\nto $\\sim$0.5 dex ($1\\sigma$) at a halo mass of $\\sim$10$^9$ M$_\\odot$ as star\nformation is quenched by reionisation but dark matter halo masses continue to\ngrow. While we do not find a significant break in the slope of the SMHM\nrelation, one can be introduced if reionisation occurs early ($z_{\\rm quench}\n\\gtrsim 5$). Finally, we find that dwarfs can be star forming today down to a\nhalo mass of $\\sim$2 $\\times 10^9$ M$_\\odot$. We predict that the lowest mass\nstar forming dwarf irregulars in the nearby universe are the tip of the iceberg\nof a much larger population of quiescent isolated dwarfs.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HP0vOIOTvz80DTSOMEWanJA5xvDUsy3gnvhJHbmPwnU","pdfSize":"1428347"}
