{"id":"2408.03224","title":"Microwave driven singlet-triplet qubits enabled by site-dependent\n  g-tensors","authors":"Jaime Saez-Mollejo, Daniel Jirovec, Yona Schell, Josip Kukucka,\n  Stefano Calcaterra, Daniel Chrastina, Giovanni Isella, Maximilian\n  Rimbach-Russ, Stefano Bosco and Georgios Katsaros","authorsParsed":[["Saez-Mollejo","Jaime",""],["Jirovec","Daniel",""],["Schell","Yona",""],["Kukucka","Josip",""],["Calcaterra","Stefano",""],["Chrastina","Daniel",""],["Isella","Giovanni",""],["Rimbach-Russ","Maximilian",""],["Bosco","Stefano",""],["Katsaros","Georgios",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 14:36:32 GMT"}],"updateDate":"2024-08-07","timestamp":1722954992000,"abstract":"  Hole spin qubits are rapidly emerging as the workhorse of semiconducting\nquantum processors because of their large spin-orbit interaction, enabling fast\nall-electric operations at low power. However, spin-orbit interaction also\ncauses non-uniformities in devices, resulting in locally varying qubit energies\nand site-dependent anisotropies. While these anisotropies can be used to drive\nsingle-spins, if not properly harnessed, they can hinder the path toward\nlarge-scale quantum processors. Here, we report on a qubit in planar germanium,\nwhere we control the anisotropy of two spins in a double quantum dot. By\ncharacterising microwave-driven singlet-triplet qubits, we show two distinct\noperating regimes depending on the magnetic field direction. For in-plane\nfields, the two spins are largely anisotropic, enabling to measure all the\navailable transitions; coherence times exceeding 3 $\\mu$s are extracted. For\nout-of-plane fields, they have an isotropic response but preserve the\nsubstantial energy difference required to address the singlet-triplet qubit.\nEven in this field direction, where the qubit lifetime is strongly affected by\nnuclear spins, we find 400 ns coherence times. Our work adds a valuable tool to\ninvestigate and harness the anisotropy of spin qubits and can be implemented in\nany large-scale NxN device, facilitating the path towards scalable quantum\nprocessors.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}