{"id":"2408.13899","title":"$\\boldsymbol{Steiner}$-Hardness: A Query Hardness Measure for\n  Graph-Based ANN Indexes","authors":"Zeyu Wang, Qitong Wang, Xiaoxing Cheng, Peng Wang, Themis Palpanas,\n  Wei Wang","authorsParsed":[["Wang","Zeyu",""],["Wang","Qitong",""],["Cheng","Xiaoxing",""],["Wang","Peng",""],["Palpanas","Themis",""],["Wang","Wei",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 17:44:17 GMT"}],"updateDate":"2024-08-27","timestamp":1724607857000,"abstract":"  Graph-based indexes have been widely employed to accelerate approximate\nsimilarity search of high-dimensional vectors. However, the performance of\ngraph indexes to answer different queries varies vastly, leading to an unstable\nquality of service for downstream applications. This necessitates an effective\nmeasure to test query hardness on graph indexes. Nonetheless, popular\ndistance-based hardness measures like LID lose their effects due to the\nignorance of the graph structure. In this paper, we propose $Steiner$-hardness,\na novel connection-based graph-native query hardness measure. Specifically, we\nfirst propose a theoretical framework to analyze the minimum query effort on\ngraph indexes and then define $Steiner$-hardness as the minimum effort on a\nrepresentative graph. Moreover, we prove that our $Steiner$-hardness is highly\nrelevant to the classical Directed $Steiner$ Tree (DST) problems. In this case,\nwe design a novel algorithm to reduce our problem to DST problems and then\nleverage their solvers to help calculate $Steiner$-hardness efficiently.\nCompared with LID and other similar measures, $Steiner$-hardness shows a\nsignificantly better correlation with the actual query effort on various\ndatasets. Additionally, an unbiased evaluation designed based on\n$Steiner$-hardness reveals new ranking results, indicating a meaningful\ndirection for enhancing the robustness of graph indexes. This paper is accepted\nby PVLDB 2025.\n","subjects":["Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"sna_SRyFz6qu8K_egx6KeIe9VPMUVkjsejvfdbJsWd8","pdfSize":"4208102"}
