{"id":"2408.09260","title":"Analysis of the Effect of Tilted Corner Cube Reflector Arrays on Lunar\n  Laser Ranging","authors":"Jin Cao (1,2,3), Rufeng Tang (1), Kai Huang (1,3), Zhulian Li (1),\n  Yongzhang Yang (1), Kai Huang (2), Jintao Li (1) and Yuqiang Li (1) ((1)\n  Yunnan Observatories, Chinese Academy of Sciences, Kunming, China, (2)\n  College of Mathematics and Physics, Leshan Normal University, Leshan, China,\n  (3) University of Chinese Academy of Sciences, Beijing, China)","authorsParsed":[["Cao","Jin",""],["Tang","Rufeng",""],["Huang","Kai",""],["Li","Zhulian",""],["Yang","Yongzhang",""],["Huang","Kai",""],["Li","Jintao",""],["Li","Yuqiang",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 17:14:12 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 08:59:32 GMT"}],"updateDate":"2024-08-22","timestamp":1723914852000,"abstract":"  This paper primarily investigates the effect of the tilt of corner cube\nreflector (CCR) arrays on lunar laser ranging (LLR). A mathematical model was\nestablished to study the random errors caused by the tilt of the CCR arrays.\nThe study found that, ideally, when the laser ranging pulse width is 10\npicoseconds or less, it is possible to distinguish from which specific corner\ncubes within the CCR array each peak in the echo signal originates.\nConsequently, partial data from the echo can be extracted for signal\nprocessing, significantly reducing random errors and improving the single-shot\nprecision of LLR. The distance obtained by extracting part of the echo can be\nreduced to the center position of the array, thereby providing multiple\nhigher-precision ranging results from each measurement. This not only improves\nthe precision of LLR but also increases the data volume. A simulation\nexperiment based on the 1.2 m laser ranging system at Yunnan Observatories was\nconducted. By extracting one peak for signal processing, the single-shot\nprecision improved from 32.24 mm to 2.52 mm, validating the theoretical\nanalysis results. Finally, an experimental laser ranging system based on a 53\ncm binocular telescope system was established for ground experiments. The\nexperimental results indicated that the echo signal could identify the tilt\nstate of the CCR array. By extracting the peak returned by the central CCR for\nsignal processing, the ranging precision was greatly improved. Through\ntheoretical analyses, simulation experiments, and ground experiments, a\nsolution to reduce the random errors caused by the tilt of the CCR array was\nprovided. This offers an approach to enhance the single-shot precision of\nfuture LLR and provides a reference for upgrading ground-based equipment at\nfuture laser ranging stations.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}