{"id":"2408.01471","title":"Enhancing Online Road Network Perception and Reasoning with Standard\n  Definition Maps","authors":"Hengyuan Zhang, David Paz, Yuliang Guo, Arun Das, Xinyu Huang, Karsten\n  Haug, Henrik I. Christensen, Liu Ren","authorsParsed":[["Zhang","Hengyuan",""],["Paz","David",""],["Guo","Yuliang",""],["Das","Arun",""],["Huang","Xinyu",""],["Haug","Karsten",""],["Christensen","Henrik I.",""],["Ren","Liu",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 19:39:55 GMT"}],"updateDate":"2024-08-06","timestamp":1722541195000,"abstract":"  Autonomous driving for urban and highway driving applications often requires\nHigh Definition (HD) maps to generate a navigation plan. Nevertheless, various\nchallenges arise when generating and maintaining HD maps at scale. While recent\nonline mapping methods have started to emerge, their performance especially for\nlonger ranges is limited by heavy occlusion in dynamic environments. With these\nconsiderations in mind, our work focuses on leveraging lightweight and scalable\npriors-Standard Definition (SD) maps-in the development of online vectorized HD\nmap representations. We first examine the integration of prototypical\nrasterized SD map representations into various online mapping architectures.\nFurthermore, to identify lightweight strategies, we extend the OpenLane-V2\ndataset with OpenStreetMaps and evaluate the benefits of graphical SD map\nrepresentations. A key finding from designing SD map integration components is\nthat SD map encoders are model agnostic and can be quickly adapted to new\narchitectures that utilize bird's eye view (BEV) encoders. Our results show\nthat making use of SD maps as priors for the online mapping task can\nsignificantly speed up convergence and boost the performance of the online\ncenterline perception task by 30% (mAP). Furthermore, we show that the\nintroduction of the SD maps leads to a reduction of the number of parameters in\nthe perception and reasoning task by leveraging SD map graphs while improving\nthe overall performance. Project Page:\nhttps://henryzhangzhy.github.io/sdhdmap/.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}