{"id":"2408.16358","title":"Irradiation-driven mass transfer for massive companion stars in\n  supersoft X-rays sources","authors":"Weitao Zhao and Xiangcun Meng and Yingzhen Cui","authorsParsed":[["Zhao","Weitao",""],["Meng","Xiangcun",""],["Cui","Yingzhen",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 08:59:00 GMT"}],"updateDate":"2024-08-30","timestamp":1724921940000,"abstract":"  Supersoft X-ray sources (SSSs) have been proposed as one of the progenitors\nfor Type Ia supernovae. However, the exact origin of the quasi-periodic\nvariability in the optical light curve remains a mystery.In this work, our goal\nis to investigate the effect of the feedback of an evolved main-sequence\ncompanion star on X-ray irradiation and find whether periodic X-ray irradiation\nof the companion star could reproduce periodic mass transfer.Using the Modules\nfor Experiments in Stellar Astrophysics (MESA) code, we modeled the\nevolutionary track of the companion star under the influence of supersoft X-ray\nirradiation, and we calculated the resulting mass transfer rate. We find that\nthe supersoft X-ray heating of the companion star can result in the expansion\nof the companion, causing it to greatly overflow its Roche lobe and thereby\nincreasing the mass transfer rate. The periodic X-ray irradiation on the\ncompanion stars leads to periodic changes in the mass transfer rate. For a\ngiven companion star, higher irradiation efficiencies result in a higher mass\ntransfer rate. Additionally, the mass transfer rate increases as the mass of\nthe companion star decreases for a given irradiation efficiency. The companion\nstar undergoing thermal timescale mass transfer is periodically irradiated by\nthe X-rays from the WD, which can lead to periodic enhancement of the mass\ntransfer rate. The mechanism could be the origin of the quasi-periodic optical\nlight curve in supersoft X-ray sources.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}