{"id":"2408.03679","title":"Review of the finite difference Hartree-Fock method for atoms and\n  diatomic molecules, and its implementation in the x2dhf program","authors":"Jacek Kobus and Susi Lehtola","authorsParsed":[["Kobus","Jacek",""],["Lehtola","Susi",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 10:40:33 GMT"}],"updateDate":"2024-08-08","timestamp":1723027233000,"abstract":"  We present an extensive review of the two-dimensional finite difference\nHartree--Fock (FD HF) method, and present its implementation in the newest\nversion of X2DHF, the FD HF program for atoms and diatomic molecules. The\nprogram was originally published in Comput. Phys. Commun. in 1996, and was last\nrevised in 2013. X2DHF can be used to obtain HF limit values of total energies\nand multipole moments for a wide range of diatomic molecules and their ions,\nusing either point nuclei or a finite nuclear model. Polarizabilities\n($\\alpha_{zz}$) and hyperpolarizabilities ($\\beta_{zzz}$, $\\gamma_{zzzz}$,\n${A}_{z,zz}$, ${B}_{zz,zz}$) can also be computed by the program with the\nfinite-field method. X2DHF has been extensively used in the literature to\nassess the accuracy of existing atomic basis sets and to help in developing new\nones. As a new feature since the last revision, the program can now also\nperform Kohn-Sham density functional calculations with local and generalized\ngradient exchange-correlation functionals with the Libxc library of density\nfunctionals, enabling new types of studies. Furthermore, the initialization of\ncalculations has been greatly simplified. As before, X2DHF can also perform\none-particle calculations with (smooth) Coulomb, Green-Sellin-Zachor and\nKrammers-Henneberger potentials, while calculations with a superposition of\natomic potentials have been added as a new feature. The program is easy to\ninstall from the GitHub repository and build via CMake using the x2dhfctl\nscript that facilitates creating its single- and multiple-threaded versions, as\nwell as building in Libxc support. Calculations can be carried out with X2DHF\nin double- or quadruple-precision arithmetic.\n","subjects":["Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}