{"id":"2408.03902","title":"HOLISMOKES -- XIV. Time-delay and differential dust extinction\n  determination with lensed type II supernova color curves","authors":"J. Grupa, S. Taubenberger, S. H. Suyu, S. Huber, C. Vogl, D. Sluse","authorsParsed":[["Grupa","J.",""],["Taubenberger","S.",""],["Suyu","S. H.",""],["Huber","S.",""],["Vogl","C.",""],["Sluse","D.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 16:59:35 GMT"}],"updateDate":"2024-08-08","timestamp":1723049975000,"abstract":"  The Hubble tension is one of the most relevant unsolved problems in cosmology\ntoday. Strongly gravitationally lensed transient objects, such as strongly\nlensed supernovae, are an independent and competitive probe that can be used to\ndetermine the Hubble constant. In this context, the time delay between\ndifferent images of lensed supernovae is a key ingredient. We present a method,\nto retrieve time delays and the amount of differential dust extinction between\nmultiple images of lensed type IIP supernovae through their color curves, which\ndisplay a kink in the time evolution. With multiple realistic mock color curves\nbased on an observed unlensed supernova from the Carnegie Supernova Project, we\ndemonstrate that we can retrieve the time delay with uncertainties of $\\pm$1.0\ndays for light curves with 2-day cadence and 35% missing data due to weather\nlosses. The differential dust extinction is more susceptible to uncertainties,\nbecause it depends on imposing the correct extinction law. Further we also\ninvestigate the kink structure in the color curves for different rest-frame\nwavelength bands, particularly rest-frame UV light curves from SWIFT, finding\nsufficiently strong kinks for our method to work for typical lensed SN\nredshifts that would redshift the kink feature to optical wavelengths. With the\nupcoming Rubin Observatory Legacy Survey of Space and Time, hundreds of\nstrongly lensed supernovae will be detected and our new method for lensed SN\nIIP is readily applicable to provide delays.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}