{"id":"2408.17298","title":"Accelerating the discovery of steady-states of planetary interior\n  dynamics with machine learning","authors":"Siddhant Agarwal, Nicola Tosi, Christian H\\\"uttig, David S. Greenberg,\n  Ali Can Bekar","authorsParsed":[["Agarwal","Siddhant",""],["Tosi","Nicola",""],["Hüttig","Christian",""],["Greenberg","David S.",""],["Bekar","Ali Can",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 13:55:19 GMT"}],"updateDate":"2024-09-02","timestamp":1725026119000,"abstract":"  Simulating mantle convection often requires reaching a computationally\nexpensive steady-state, crucial for deriving scaling laws for thermal and\ndynamical flow properties and benchmarking numerical solutions. The strong\ntemperature dependence of the rheology of mantle rocks causes viscosity\nvariations of several orders of magnitude, leading to a slow-evolving stagnant\nlid where heat conduction dominates, overlying a rapidly-evolving and strongly\nconvecting region. Time-stepping methods, while effective for fluids with\nconstant viscosity, are hindered by the Courant criterion, which restricts the\ntime step based on the system's maximum velocity and grid size. Consequently,\nachieving steady-state requires a large number of time steps due to the\ndisparate time scales governing the stagnant and convecting regions.\n  We present a concept for accelerating mantle convection simulations using\nmachine learning. We generate a dataset of 128 two-dimensional simulations with\nmixed basal and internal heating, and pressure- and temperature-dependent\nviscosity. We train a feedforward neural network on 97 simulations to predict\nsteady-state temperature profiles. These can then be used to initialize\nnumerical time stepping methods for different simulation parameters. Compared\nto typical initializations, the number of time steps required to reach\nsteady-state is reduced by a median factor of 3.75. The benefit of this method\nlies in requiring very few simulations to train on, providing a solution with\nno prediction error as we initialize a numerical method, and posing minimal\ncomputational overhead at inference time. We demonstrate the effectiveness of\nour approach and discuss the potential implications for accelerated simulations\nfor advancing mantle convection research.\n","subjects":["Physics/Fluid Dynamics","Astrophysics/Earth and Planetary Astrophysics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}