{"id":"2408.06833","title":"Nuclearity, Schatten-von Neumann classes, distribution of eigenvalues\n  and $L^p$-$L^q$-boundedness of Fourier integral operators on compact\n  manifolds","authors":"Duv\\'an Cardona, Julio Delgado, Michael Ruzhansky","authorsParsed":[["Cardona","Duván",""],["Delgado","Julio",""],["Ruzhansky","Michael",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 11:46:42 GMT"}],"updateDate":"2024-08-14","timestamp":1723549602000,"abstract":"  We link Sogge's type $L^p$-estimates for eigenfunctions of the Laplacian on\ncompact manifolds with the problem of providing criteria for the $r$-nuclearity\nof Fourier integral operators. The classes of Fourier integral operators\n$I^\\mu_{\\rho,1-\\rho}(X,Y;C)$ considered here are associated with complex\ncanonical relations $C$, i.e. they are parametrised by a complex-valued phase\nfunction. Our analysis also includes the case of real canonical relations,\nnamely, the class of Fourier integral operators with real-valued phase\nfunctions. The nuclear trace in the sense of Grothendieck is investigated for\nthese operators as well as the validity of the Grothendieck-Lidskii formula on\nLebesgue spaces. Criteria are presented in terms of the factorisation condition\nfor the complex canonical relation. Necessary and sufficient conditions for the\nmembership of Fourier integral operators in Schatten-von Neumann classes are\npresented in the case where the Schatten index $r>0$ belongs to the set\n$\\mathbb{N} $ and sharp sufficient conditions are presented in the general case\n$r>0$. In particular, we establish necessary and sufficient conditions for the\nmembership of Fourier integral operators to the ideal of trace class operators\nand to the ideal of Hilbert-Schmidt operators on $L^2(X)$. The rate of decay of\neigenvalues and the trace of Fourier integral operators is also investigated in\nboth settings, in the Hilbert space case of $L^2(X)$ using Schatten-von Neumann\nproperties and in the context of the Banach spaces $L^p(X),$ $1<p<\\infty,$\nutilising the notion of $r$-nuclearity.\n","subjects":["Mathematics/Analysis of PDEs","Mathematics/Functional Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2NkTw_GLhK36IbLqzQIzLPCCDQYaaulXSPdgBtkeUWQ","pdfSize":"463034"}
