{"id":"2408.09790","title":"Structure-enhanced Contrastive Learning for Graph Clustering","authors":"Xunlian Wu, Jingqi Hu, Anqi Zhang, Yining Quan, Qiguang Miao, Peng\n  Gang Sun","authorsParsed":[["Wu","Xunlian",""],["Hu","Jingqi",""],["Zhang","Anqi",""],["Quan","Yining",""],["Miao","Qiguang",""],["Sun","Peng Gang",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 08:39:08 GMT"}],"updateDate":"2024-08-20","timestamp":1724056748000,"abstract":"  Graph clustering is a crucial task in network analysis with widespread\napplications, focusing on partitioning nodes into distinct groups with stronger\nintra-group connections than inter-group ones. Recently, contrastive learning\nhas achieved significant progress in graph clustering. However, most methods\nsuffer from the following issues: 1) an over-reliance on meticulously designed\ndata augmentation strategies, which can undermine the potential of contrastive\nlearning. 2) overlooking cluster-oriented structural information, particularly\nthe higher-order cluster(community) structure information, which could unveil\nthe mesoscopic cluster structure information of the network. In this study,\nStructure-enhanced Contrastive Learning (SECL) is introduced to addresses these\nissues by leveraging inherent network structures. SECL utilizes a cross-view\ncontrastive learning mechanism to enhance node embeddings without elaborate\ndata augmentations, a structural contrastive learning module for ensuring\nstructural consistency, and a modularity maximization strategy for harnessing\nclustering-oriented information. This comprehensive approach results in robust\nnode representations that greatly enhance clustering performance. Extensive\nexperiments on six datasets confirm SECL's superiority over current\nstate-of-the-art methods, indicating a substantial improvement in the domain of\ngraph clustering.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}