{"id":"2408.15078","title":"On the settling and clustering behavior of polydisperse gas-solid flows\n  with application to pyroclastic density currents","authors":"E. Foster, E.C.P. Breard, S. Beetham","authorsParsed":[["Foster","E.",""],["Breard","E. C. P.",""],["Beetham","S.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 14:06:54 GMT"}],"updateDate":"2024-08-28","timestamp":1724767614000,"abstract":"  Sedimenting flows occur in a range of society-critical systems, such as\ncirculating fluidized bed reactors and pyroclastic density currents (PDCs), the\nmost hazardous volcanic process. In these systems, mass loading is sufficiently\nhigh ($\\gg\\mathcal{O}(1)$) and momentum coupling between the phases gives rise\nto mesoscale behavior, such as formation of coherent structures. This\nheterogeneity has been demonstrated to generate and sustain turbulence in the\ncarrier phase and directly impact large-scale quantities of interest, such as\nsettling time. While contemporary work has explored the physical processes\nunderpinning these multiphase phenomenon for monodisperse assemblies of\nparticles, polydispersity flow behavior has been largely understudied. Since\nall real-world flows are polydisperse, understanding the role of polydispersity\nin gas-solid systems is critical for informing closures that are accurate and\nrobust. This work characterizes the sedimentation behavior of two polydispersed\ngas-solid flows, with statistical and physical properties of the particulate\nphase sampled from historical PDC ejecta. Highly resolved data for both\npolydisperse distributions of particles at two volume fractions (1% and 10%) is\ncollected using an Euler-Lagrange framework and is compared with monodisperse\nconfigurations of particles with diameters equivalent to the arithmetic mean of\nthe polydisperse configurations. From this data, we find that polydispersity\nhas an important impact on cluster formation and structure and that this is\nmost pronounced for more dilute flows. At higher volume fraction, the effect of\npolydispersity is less pronounced. We also propose a new metric for predicting\nthe degree of clustering, termed `surface loading', and a model for the\ncoefficient of drag that produces accurate predictions for settling velocity\ngiven the high-fidelity data presented.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}