{"id":"2408.02627","title":"Tunable 30 GHz laser frequency comb for astronomical spectrograph\n  characterization and calibration","authors":"Pooja Sekhar, Molly Kate Kreider, Connor Fredrick, Joe P Ninan, Chad F\n  Bender, Ryan Terrien, Suvrath Mahadevan and Scott A Diddams","authorsParsed":[["Sekhar","Pooja",""],["Kreider","Molly Kate",""],["Fredrick","Connor",""],["Ninan","Joe P",""],["Bender","Chad F",""],["Terrien","Ryan",""],["Mahadevan","Suvrath",""],["Diddams","Scott A",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 16:50:27 GMT"}],"updateDate":"2024-08-06","timestamp":1722876627000,"abstract":"  The search for earth-like exoplanets with the Doppler radial velocity\ntechnique is an extremely challenging and multifaceted precision spectroscopy\nproblem. Currently, one of the limiting instrumental factors in reaching the\nrequired long-term $10^{-10}$ level of radial velocity precision is the\ndefect-driven sub-pixel quantum efficiency variations in the large-format\ndetector arrays used by precision echelle spectrographs. Tunable frequency comb\ncalibration sources that can fully map the point spread function across a\nspectrograph's entire bandwidth are necessary for quantifying and correcting\nthese detector artifacts. In this work, we demonstrate a combination of laser\nfrequency and mode spacing control that allows full and deterministic\ntunability of a 30 GHz electro-optic comb together with its filter cavity.\nAfter supercontinuum generation, this gives access to any optical frequency\nacross 700 - 1300 nm. Our specific implementation is intended for the comb\ndeployed at the Habitable Zone Planet Finder spectrograph and its near-infrared\nHawaii-2RG array, but the techniques apply to all laser frequency combs used\nfor precision astronomical spectrograph calibration and other applications that\nrequire broadband tuning.\n","subjects":["Physics/Optics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}