{"id":"2408.01568","title":"First-principles investigation of the emergence of multiferroicity and\n  skyrmions in CrI2","authors":"Khimananda Acharya, Kai Huang, Evgeny Y. Tsymbal and Tula R. Paudel","authorsParsed":[["Acharya","Khimananda",""],["Huang","Kai",""],["Tsymbal","Evgeny Y.",""],["Paudel","Tula R.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 20:47:01 GMT"}],"updateDate":"2024-08-06","timestamp":1722631621000,"abstract":"  The recently discovered van der Waals magnetic semiconductor CrI2 shows\npromise for spintronic applications. Its electronic and magnetic properties are\nknown to be strongly influenced by electronic correlations. In this work, we\nemploy density functional theory calculations where electronic correlations in\nCrI2 are considered within an on-site Coulomb interaction, U, with U being\ndetermined using the perturbative approach based on the linear response method.\nWe show that the accuracy of an on-site Coulomb interaction is essential for\npredicting the non-centrosymmetric orthorhombic ground state of CrI2, which\nallows the existence of ferroelectricity and non-zero Dzyaloshinskii-Moriya\n(DMI) interaction. Our calculation shows that the ground state of bulk CrI2 has\nelectric polarization of 0.15 {\\mu}C/cm-2 pointing along the z-axis and the\nsmall DMI energy that changes sign with the ferroelectric polarization\nswitching. The DMI and polarization are enhanced to 0.28 meV/formula-unit and\n0.63 {\\mu}C/cm-2 when Pt intercalates bilayers of CrI2, due to its large\nspin-orbit coupling strength and large off-center displacement. Such an\nenhanced DMI leads to the N\\'eel skyrmions, whose handedness is controlled by\nferroelectric polarization. Our work contributes to the creation and\nmanipulation of bits in skyrmions-based memory devices.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Other Condensed Matter","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}