{"id":"2408.11779","title":"Personality Alignment of Large Language Models","authors":"Minjun Zhu, Linyi Yang, Yue Zhang","authorsParsed":[["Zhu","Minjun",""],["Yang","Linyi",""],["Zhang","Yue",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 17:09:00 GMT"}],"updateDate":"2024-08-22","timestamp":1724260140000,"abstract":"  Current methods for aligning large language models (LLMs) typically aim to\nreflect general human values and behaviors, but they often fail to capture the\nunique characteristics and preferences of individual users. To address this\ngap, we introduce the concept of Personality Alignment. This approach tailors\nLLMs' responses and decisions to match the specific preferences of individual\nusers or closely related groups. Inspired by psychometrics, we created the\nPersonality Alignment with Personality Inventories (PAPI) dataset, which\nincludes data from 300,000 real subjects, each providing behavioral preferences\nbased on the Big Five Personality Factors. This dataset allows us to\nquantitatively evaluate the extent to which LLMs can align with each subject's\nbehavioral patterns. Recognizing the challenges of personality alignments: such\nas limited personal data, diverse preferences, and scalability requirements: we\ndeveloped an activation intervention optimization method. This method enhances\nLLMs' ability to efficiently align with individual behavioral preferences using\nminimal data and computational resources. Remarkably, our method, PAS, achieves\nsuperior performance while requiring only 1/5 of the optimization time compared\nto DPO, offering practical value for personality alignment. Our work paves the\nway for future AI systems to make decisions and reason in truly personality\nways, enhancing the relevance and meaning of AI interactions for each user and\nadvancing human-centered artificial intelligence.The code has released in\n\\url{https://github.com/zhu-minjun/PAlign}.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}