{"id":"2408.16989","title":"Optimal Ratcheting of Dividends with Irreversible Reinsurance","authors":"Tim J. Boonen and Engel John C. Dela Vega","authorsParsed":[["Boonen","Tim J.",""],["Vega","Engel John C. Dela",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 03:34:29 GMT"}],"updateDate":"2024-09-02","timestamp":1724988869000,"abstract":"  This paper considers an insurance company that faces two key constraints: a\nratcheting dividend constraint and an irreversible reinsurance constraint. The\ncompany allocates part of its reserve to pay dividends to its shareholders\nwhile strategically purchasing reinsurance for its claims. The ratcheting\ndividend constraint ensures that dividend cuts are prohibited at any time. The\nirreversible reinsurance constraint ensures that reinsurance contracts cannot\nbe prematurely terminated or sold to external entities. The dividend rate level\nand the reinsurance level are modelled as nondecreasing processes, thereby\nsatisfying the constraints. The incurred claims are modelled via a Brownian\nrisk model. The main objective is to maximize the cumulative expected\ndiscounted dividend payouts until the time of ruin. The reinsurance and\ndividend levels belong to either a finite set or a closed interval. The optimal\nvalue functions for the finite set case and the closed interval case are proved\nto be the unique viscosity solutions of the corresponding\nHamilton-Jacobi-Bellman equations, and the convergence between these optimal\nvalue functions is established. For the finite set case, a threshold strategy\nis proved to be optimal, while for the closed interval case, an\n$\\epsilon$-optimal strategy is constructed. Finally, numerical examples are\npresented to illustrate the optimality conditions and optimal strategies.\n","subjects":["Mathematics/Optimization and Control","Mathematics/Probability","Quantitative Finance/Pricing of Securities","Quantitative Finance/Risk Management"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}