{"id":"2408.02004","title":"Resonant excitation of eccentricity in spherical extreme-mass-ratio\n  inspirals","authors":"Areti Eleni, Kyriakos Destounis, Theocharis A. Apostolatos and Kostas\n  D. Kokkotas","authorsParsed":[["Eleni","Areti",""],["Destounis","Kyriakos",""],["Apostolatos","Theocharis A.",""],["Kokkotas","Kostas D.",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 12:02:50 GMT"}],"updateDate":"2024-08-06","timestamp":1722772970000,"abstract":"  Gravitational radiation reaction, has been one of the fundamental issues in\ngeneral relativity. Over a span of decades, this process has been analyzed in\nthe adiabatic limit, in order to comprehend how it drives extreme-mass-ratio\nbinaries, that are prime targets for space-borne detectors. It has been shown\nthat spherical orbits around Schwarzschild and Kerr black holes remain\nspherical (zero eccentricity) under the influence of gravitational radiation\nreaction. Here, we show that spherical orbits in non-Kerr black holes, that\nstill preserve most of the good qualities and symmetries of Kerr spacetime, can\naccess certain resonances in such a way that an initially spherical inspiral\nacquires non-zero eccentricity and becomes non-spherical. Therefore, the\ncrossing of resonances under radiation reaction interrupts and even inverts, up\nto some small radius close to plunge, the process of circularization of orbits.\nThe strength of resonant excitation of eccentricity depends on the initial\nposition and inclination of the integrable extreme-mass-ratio system, as well\nas the integrability-breaking parameter introduced in the background spacetime\nthat amplifies further the excitation. We find that the harmonics of\ngravitational waves emitted from these inspirals undergo a frequency modulation\nas the orbit `metamorphoses' from spherical to non-spherical, due to the effect\nof resonant eccentricity excitation. The gain that low-amplitude harmonics\nexperience in these oligochromatic EMRIs, due to resonances, may be detectable\nwith future spaceborne detectors and serves as an indicator of non-Kerrness of\nthe background spacetime.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"B_wmJQ0ClX3TxBZhHQRxEl8dEKmV-HvzwB2pF7umFSo","pdfSize":"7617852","txDigest":"4Ze8nhAShRpsXV55QmcHupUztzCrKzUvd9i7zzQwW5BH","endEpoch":"1","status":"CERTIFIED"}
