{"id":"2408.15965","title":"Novel ground states and emergent quantum many-body scars in a\n  two-species Rydberg atom array","authors":"Lei-Yi-Nan Liu, Shun-Yao Yu, Shi-Rong Peng, Jie Sheng, Su Yi, Peng Xu,\n  Shou-Shu Gong, Tao Shi, Jian Cui","authorsParsed":[["Liu","Lei-Yi-Nan",""],["Yu","Shun-Yao",""],["Peng","Shi-Rong",""],["Sheng","Jie",""],["Yi","Su",""],["Xu","Peng",""],["Gong","Shou-Shu",""],["Shi","Tao",""],["Cui","Jian",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 17:36:10 GMT"}],"updateDate":"2024-08-29","timestamp":1724866570000,"abstract":"  Rydberg atom array has been established as one appealing platform for quantum\nsimulation and quantum computation. Recent experimental development of trapping\nand controlling two-species atoms using optical tweezer arrays has brought more\ncomplex interactions in this game, enabling much versatile novel quantum states\nand phenomena to emerge and thus leading to a growing need for both theoretical\nand numerical investigations in this regard. In this paper we systematically\ncalculate the ground state phase diagram of alternating two-species atom array\nand find some novel quantum states that cannot exist in traditional cold-atom\nplatforms, for instance the period $4$ product state $|1100\\rangle^{\\otimes\nm}$, the period $6$ product state $|111000\\rangle^{\\otimes m}$ and\norder-disorder separation phase. We also confirm the existence of floating\nphase, however, in this system it has to be described by two interacting\nbosonic fields whereas that in the single species Rydberg atom array can be\nunderstood as free bosons. More interestingly, in the quench dynamics we\ndiscover a type of new quantum many-body scar distinct from that previous found\nin single species atoms which is explained by low-energy effective theory of\nthe PXP model. Instead, the underlying physics of the newly found quantum\nmany-body scar can be described by a perturbation theory spanning the whole\nenergy spectrum. Detailed analysis on how to experimentally prepare these\nstates and observe the phenomena is provided. Numerical evidence shows that the\nproposed scheme is robust against typical experimentally relevent imperfections\nand thus it is implementable. Our work opens new avenue for quantum simulating\nnovel quantum many-body states both in and out of equilibrium arising from the\ninterplay of competing interactions of different atom species and quantum\nfluctuations.\n","subjects":["Condensed Matter/Quantum Gases","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}