{"id":"2408.16916","title":"A Computational Framework for Modeling Emergence of Color Vision in the\n  Human Brain","authors":"Atsunobu Kotani, Ren Ng","authorsParsed":[["Kotani","Atsunobu",""],["Ng","Ren",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 21:27:06 GMT"}],"updateDate":"2024-09-02","timestamp":1724966826000,"abstract":"  It is a mystery how the brain decodes color vision purely from the optic\nnerve signals it receives, with a core inferential challenge being how it\ndisentangles internal perception with the correct color dimensionality from the\nunknown encoding properties of the eye. In this paper, we introduce a\ncomputational framework for modeling this emergence of human color vision by\nsimulating both the eye and the cortex. Existing research often overlooks how\nthe cortex develops color vision or represents color space internally, assuming\nthat the color dimensionality is known a priori; however, we argue that the\nvisual cortex has the capability and the challenge of inferring the color\ndimensionality purely from fluctuations in the optic nerve signals. To validate\nour theory, we introduce a simulation engine for biological eyes based on\nestablished vision science and generate optic nerve signals resulting from\nlooking at natural images. Further, we propose a model of cortical learning\nbased on self-supervised principle and show that this model naturally learns to\ngenerate color vision by disentangling retinal invariants from the sensory\nsignals. When the retina contains N types of color photoreceptors, our\nsimulation shows that N-dimensional color vision naturally emerges, verified\nthrough formal colorimetry. Using this framework, we also present the first\nsimulation work that successfully boosts the color dimensionality, as observed\nin gene therapy on squirrel monkeys, and demonstrates the possibility of\nenhancing human color vision from 3D to 4D.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"sBSR_PORsuE0yl17CMZGy6Y-kUVtJf43pckSRraGy2A","pdfSize":"20914387"}
