{"id":"2408.12776","title":"Surface plasmon-mediated photoluminescence boost in graphene-covered\n  CsPbBr$_3$ quantum dots","authors":"Youngsin Park, Elham Oleiki, Guanhua Ying, Atanu Jana, Mutibah\n  Alanazi, Vitaly Osokin, Sangeun Cho, Robert A. Taylorb, Geunsik Lee","authorsParsed":[["Park","Youngsin",""],["Oleiki","Elham",""],["Ying","Guanhua",""],["Jana","Atanu",""],["Alanazi","Mutibah",""],["Osokin","Vitaly",""],["Cho","Sangeun",""],["Taylorb","Robert A.",""],["Lee","Geunsik",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 00:50:41 GMT"}],"updateDate":"2024-08-26","timestamp":1724374241000,"abstract":"  The optical properties of graphene (Gr)-covered CsPbBr$_3$ quantum dots (QDs)\nwere investigated using micro-photoluminescence spectroscopy, revealing a\nremarkable three-orders-of-magnitude enhancement in photoluminescence (PL)\nintensity compared to bare CsPbBr$_3$ QDs. To elucidate the underlying\nmechanisms, we combined experimental techniques with density functional theory\n(DFT) calculations. DFT simulations showed that the graphene layer generates\ninterfacial electrostatic potential barriers when in contact with the\nCsPbBr$_3$ surface, impeding carrier leakage from perovskite to graphene and\nenhancing radiative recombination. Additionally, graphene passivates CsPbBr$_3$\nsurface defect states, suppressing nonradiative recombination of\nphoto-generated carriers. Our study also revealed that graphene becomes n-doped\nupon contact with CsPbBr$_3$ QDs, activating its plasmon mode. This mode\nresonantly couples with photo-generated excitons in the perovskite. The\nmomentum mismatch between graphene plasmons and free-space photons is resolved\nthrough plasmon scattering at Gr/CsPbBr$_3$ interface corrugations,\nfacilitating the observed super-bright emission. These findings highlight the\ncritical role of graphene as a top contact in dramatically enhancing CsPbBr$_3$\nQDs' PL. Our work advances the understanding of graphene-perovskite interfaces\nand opens new avenues for designing high-efficiency optoelectronic devices. The\nmultifaceted enhancement mechanisms uncovered provide valuable insights for\nfuture research in nanophotonics and materials science, potentially leading to\nbreakthroughs in light-emitting technologies.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}