{"id":"2408.10924","title":"Unveiling the jet angular broadening with $\\gamma-$jet in high-energy\n  nuclear collisions","authors":"Sa Wang, Yao Li, Jin-Wen Kang, Ben-Wei Zhang","authorsParsed":[["Wang","Sa",""],["Li","Yao",""],["Kang","Jin-Wen",""],["Zhang","Ben-Wei",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 15:05:49 GMT"}],"updateDate":"2024-08-21","timestamp":1724166349000,"abstract":"  Medium modification of jet substructure within the hot and dense nuclear\nmatter has attracted enormous interest from the heavy-ion physics community in\nrecent years. Measurements of inclusive jet show the angular narrowing in\nnucleus-nucleus collisions, while the recent CMS results of the photon-tagged\njets ($\\gamma-$jet) indicate hints of broadening. In this work, we conduct a\ntheoretical study on the angular structure of inclusive jet and $\\gamma-$jet\nwith a transport approach considering the jet energy loss and the medium\nresponse in the quark-gluon plasma. We carry out the girth modification of\n$\\gamma-$jet in $0-30\\%$ PbPb collisions at $\\sqrt{s_{NN}}=$ 5.02 TeV, which\nshows a satisfactory agreement with the recent CMS measurement. We explore the\nconnection between the selection bias and the jet kinematics when choosing\ndifferent $x_{j\\gamma}=p_T^{\\rm jet}/p_T^{\\gamma}$ threshold. Importantly, we\nquantitatively demonstrate that $\\gamma-$jet provides significant advantages to\nreduce the selection bias and can effectively collect jets sufficiently\nquenched in PbPb collisions compared to the inclusive jet, which is critical to\ncapture the jet angular broadening observed by CMS. We further estimate the\ncontributions of the medium-induced gluon radiation and the medium response to\nthe broadening of the jet angular substructure.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"E-rP10C101BUjFNHnFPzYGWbZ__68L4qaB3pQS0M2qc","pdfSize":"432941"}
