{"id":"2408.10040","title":"The Practimum-Optimum Algorithm for Manufacturing Scheduling: A Paradigm\n  Shift Leading to Breakthroughs in Scale and Performance","authors":"Moshe BenBassat","authorsParsed":[["BenBassat","Moshe",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 14:32:21 GMT"}],"updateDate":"2024-08-20","timestamp":1724077941000,"abstract":"  The Practimum-Optimum (P-O) algorithm represents a paradigm shift in\ndeveloping automatic optimization products for complex real-life business\nproblems such as large-scale manufacturing scheduling. It leverages deep\nbusiness domain expertise to create a group of virtual human expert (VHE)\nagents with different \"schools of thought\" on how to create high-quality\nschedules. By computerizing them into algorithms, P-O generates many valid\nschedules at far higher speeds than human schedulers are capable of. Initially,\nthese schedules can also be local optimum peaks far away from high-quality\nschedules. By submitting these schedules to a reinforced machine learning\nalgorithm (RL), P-O learns the weaknesses and strengths of each VHE schedule,\nand accordingly derives reward and punishment changes in the Demand Set that\nwill modify the relative priorities for time and resource allocation that jobs\nreceived in the prior iteration that led to the current state of the schedule.\nThese cause the core logic of the VHE algorithms to explore, in the subsequent\niteration, substantially different parts of the schedules universe and\npotentially find higher-quality schedules. Using the hill climbing analogy,\nthis may be viewed as a big jump, shifting from a given local peak to a faraway\npromising start point equipped with knowledge embedded in the demand set for\nfuture iterations. This is a fundamental difference from most contemporary\nalgorithms, which spend considerable time on local micro-steps restricted to\nthe neighbourhoods of local peaks they visit. This difference enables a\nbreakthrough in scale and performance for fully automatic manufacturing\nscheduling in complex organizations. The P-O algorithm is at the heart of\nPlataine Scheduler that, in one click, routinely schedules 30,000-50,000 tasks\nfor real-life complex manufacturing operations.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uioJ1cCjlda_I91Q5BNin5MyF8lIHQqEwQfNsxYI58E","pdfSize":"468967"}
