{"id":"2408.01048","title":"Host Galaxy Properties of Gamma-ray Bursts Involving Neutron Star Binary\n  Mergers and Its Impact on Kilonovae Rates","authors":"Mankeun Jeong, Myungshin Im","authorsParsed":[["Jeong","Mankeun",""],["Im","Myungshin",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 06:50:29 GMT"}],"updateDate":"2024-08-05","timestamp":1722581429000,"abstract":"  In the upcoming gravitational wave (GW) observing runs, identifying host\ngalaxies is crucial as it provides essential redshift information and enables\nthe use of GW events as standard sirens. However, pinpointing host galaxies\nremains challenging due to the large localization uncertainties and the rapidly\nfading nature of their optical counterparts. Analyzing the host galaxies of\nshort gamma-ray bursts (sGRBs) offers an alternative approach to deepen our\nunderstanding of the environments where binary neutron stars (BNS) primarily\nmerge. This study compiles archival photometric data for the host galaxies of\n76 sGRBs and 4 hybrid GRBs that are long GRBs accompanied by kilonova-like\nsignals. We use this data to evaluate their physical properties through\nspectral energy distribution (SED) fitting. To assess the characteristics of\nthe host galaxies, we utilized a volume-limited sample ($z<0.5$) from the\nCOSMOS field as a control group. Contrary to expectations that the BNS merger\nrate is proportional to host stellar mass, the short and hybrid GRB population\nappears less massive than the mass-weighted distribution of the control sample.\nInstead, we propose a formulation for the expected BNS merger rate from a\ngalaxy as $\\log(n_{\\mathrm{BNS}}/\\mathrm{Gyr}) = 0.86 \\times\n\\log(M_*/M_{\\odot}) + 0.44 \\times \\log(\\mathrm{sSFR}/\\mathrm{yr}) + 0.857$,\nwhich optimally explains the deviation between the stellar mass distributions\nof the GRB host galaxies and the control sample. These insights provide a\nstrategic framework for targeted GW follow-ups and enhance our ability to\nidentify potential host galaxies for future GW events.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Vn6bkzJfx95BWmR2F7fjcE7vESNmQTGUyXYimNAyTW4","pdfSize":"8504411"}
