{"id":"2408.04898","title":"Object as a Service: Simplifying Cloud-Native Development through\n  Serverless Object Abstraction","authors":"Pawissanutt Lertpongrujikorn, Mohsen Amini Salehi","authorsParsed":[["Lertpongrujikorn","Pawissanutt",""],["Salehi","Mohsen Amini",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 06:55:00 GMT"}],"updateDate":"2024-08-12","timestamp":1723186500000,"abstract":"  The function-as-a-service (FaaS) paradigm is envisioned as the next\ngeneration of cloud computing systems that mitigate the burden for cloud-native\napplication developers by abstracting them from cloud resource management.\nHowever, it does not deal with the application data aspects. As such,\ndevelopers have to intervene and undergo the burden of managing the application\ndata, often via separate cloud storage services. To further streamline\ncloud-native application development, in this work, we propose a new paradigm,\nknown as Object as a Service (OaaS) that encapsulates application data and\nfunctions into the cloud object abstraction. OaaS relieves developers from\nresource and data management burden while offering built-in optimization\nfeatures. Inspired by OOP, OaaS incorporates access modifiers and inheritance\ninto the serverless paradigm that: (a) prevents developers from compromising\nthe system via accidentally accessing underlying data; and (b) enables software\nreuse in cloud-native application development. Furthermore, OaaS natively\nsupports dataflow semantics. It enables developers to define function workflows\nwhile transparently handling data navigation, synchronization, and parallelism\nissues. To establish the OaaS paradigm, we develop a platform named Oparaca\nthat offers state abstraction for structured and unstructured data with\nconsistency and fault-tolerant guarantees. We evaluated Oparaca under\nreal-world settings against state-of-the-art platforms with respect to the\nimposed overhead, scalability, and ease of use. The results demonstrate that\nthe object abstraction provided by OaaS can streamline flexible and scalable\ncloud-native application development with an insignificant overhead on the\nunderlying serverless system.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Operating Systems","Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}