{"id":"2408.00099","title":"A comparative study of radio signatures from winds and jets: Modelling\n  synchrotron emission and polarization","authors":"Moun Meenakshi, Dipanjan Mukherjee, Gianluigi Bodo, Paola Rossi and\n  Chris M. Harrison","authorsParsed":[["Meenakshi","Moun",""],["Mukherjee","Dipanjan",""],["Bodo","Gianluigi",""],["Rossi","Paola",""],["Harrison","Chris M.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:17:44 GMT"}],"updateDate":"2024-08-02","timestamp":1722449864000,"abstract":"  Outflows driven by active galactic nuclei (AGN) are seen in numerous compact\nsources; however, it has remained unclear how to distinguish between the\ndriving mechanisms, such as winds and jets. Therefore, our study aims to offer\nobservational insights from simulations to aid in this distinction.\nSpecifically, in this paper, we investigate the evolution of wide-angled,\nmoderately relativistic, magnetized winds and analyze their non-thermal radio\nemission and polarization properties. We find that the evolution of winds\nvaries depending on factors such as power, density, and opening angle, which in\nturn influence their observable characteristics. Additionally, different\nviewing angles can lead to varying observations. Furthermore, we note\ndistinctions in the evolution of winds compared to jets, resulting in\ndisparities in their observable features. Jets typically exhibit a thin spine\nand hotspot(s). Winds manifest broader spines or an \"hourglass-shaped\" bright\nemission in the cocoon, which are capped by bright arcs. Both display high\npolarization coinciding with the bright spine and hotspots/arcs, although these\nregions are relatively compact and localized in jets when compared to winds. We\nemphasize the importance of high resolution, as we demonstrate that emission\nfeatures from both jets and winds can become indistinguishable at lower\nresolutions. The distribution of polarization is largely unaffected by\nresolution, though lower polarization becomes more noticeable when the\nresolution is decreased.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}