{"id":"2408.00836","title":"Classical Benchmarks for Variational Quantum Eigensolver Simulations of\n  the Hubbard Model","authors":"Antonios M. Alvertis, Abid Khan, Thomas Iadecola, Peter P. Orth, Norm\n  Tubman","authorsParsed":[["Alvertis","Antonios M.",""],["Khan","Abid",""],["Iadecola","Thomas",""],["Orth","Peter P.",""],["Tubman","Norm",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 18:00:04 GMT"}],"updateDate":"2024-08-05","timestamp":1722535204000,"abstract":"  Simulating the Hubbard model is of great interest to a wide range of\napplications within condensed matter physics, however its solution on classical\ncomputers remains challenging in dimensions larger than one. The relative\nsimplicity of this model, embodied by the sparseness of the Hamiltonian matrix,\nallows for its efficient implementation on quantum computers, and for its\napproximate solution using variational algorithms such as the variational\nquantum eigensolver. While these algorithms have been shown to reproduce the\nqualitative features of the Hubbard model, their quantitative accuracy in terms\nof producing true ground state energies and other properties, and the\ndependence of this accuracy on the system size and interaction strength, the\nchoice of variational ansatz, and the degree of spatial inhomogeneity in the\nmodel, remains unknown. Here we present a rigorous classical benchmarking\nstudy, demonstrating the potential impact of these factors on the accuracy of\nthe variational solution of the Hubbard model on quantum hardware. We find that\neven when using the most accurate wavefunction ans\\\"{a}tze for the Hubbard\nmodel, the error in its ground state energy and wavefunction plateaus for\nlarger lattices, while stronger electronic correlations magnify this issue.\nConcurrently, spatially inhomogeneous parameters and the presence of off-site\nCoulomb interactions only have a small effect on the accuracy of the computed\nground state energies. Our study highlights the capabilities and limitations of\ncurrent approaches for solving the Hubbard model on quantum hardware, and we\ndiscuss potential future avenues of research.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"V3De6vcWoca91MRzD3THbo0p1NY6_S28oHG01jppwLs","pdfSize":"1707991","txDigest":"DQXDbZNzczdxJBsafuvxo1T8bP31raFDKT2AZyyj3f4Z","endEpoch":"1","status":"CERTIFIED"}
