{"id":"2408.05118","title":"On the origin of transient features in cosmological N-Body Simulations","authors":"J. S. Bagla and Swati Gavas","authorsParsed":[["Bagla","J. S.",""],["Gavas","Swati",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 15:13:59 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 08:25:47 GMT"}],"updateDate":"2024-08-16","timestamp":1723216439000,"abstract":"  We study the effect of gravitational clustering at small scales on larger\nscales by studying mode coupling between virialised halos. We build on the\ncalculation by Peebles (1974) where it was shown that a virialised halo does\nnot contribute any mode coupling terms at small wave numbers $k$. Using a\nperturbative expansion in wave number, we show that this effect is small and\narises from the deviation of halo shapes from spherical and also on tidal\ninteractions between halos. We connect this with the impact of finite mass\nresolution of cosmological N-Body simulations on the evolution of perturbations\nat early times. This difference between the expected evolution and the\nevolution obtained in cosmological N-Body simulations can be quantified using\nsuch an estimate. We also explore the impact of a finite shortest scale up to\nwhich the desired power spectrum is realised in simulations. Several simulation\nstudies have shown that this effect is small in comparison with the effect of\nperturbations at large scales on smaller scales. It is nevertheless important\nto study these effects and develop a general approach for estimating their\nmagnitude. This is especially relevant in the present era of precision\ncosmology. We provide basic estimates of the magnitude of these effects and\ntheir power spectrum dependence. We find that the impact of small scale cutoff\nin the initial power spectrum and discreteness increases with $(n+3)$, with $n$\nbeing the index of the power spectrum. In general, we recommend that\ncosmological simulation data should be used only if the scale of non-linearity,\ndefined as the scale where the linearly extrapolated {\\it rms} amplitude of\nfluctuations is unity, is larger than the average inter-particle separation.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}