{"id":"2408.16273","title":"SAU: A Dual-Branch Network to Enhance Long-Tailed Recognition via\n  Generative Models","authors":"Guangxi Li, Yinsheng Song, Mingkai Zheng","authorsParsed":[["Li","Guangxi",""],["Song","Yinsheng",""],["Zheng","Mingkai",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 05:33:59 GMT"}],"updateDate":"2024-08-30","timestamp":1724909639000,"abstract":"  Long-tailed distributions in image recognition pose a considerable challenge\ndue to the severe imbalance between a few dominant classes with numerous\nexamples and many minority classes with few samples. Recently, the use of large\ngenerative models to create synthetic data for image classification has been\nrealized, but utilizing synthetic data to address the challenge of long-tailed\nrecognition remains relatively unexplored. In this work, we proposed the use of\nsynthetic data as a complement to long-tailed datasets to eliminate the impact\nof data imbalance. To tackle this real-synthetic mixed dataset, we designed a\ntwo-branch model that contains Synthetic-Aware and Unaware branches (SAU). The\ncore ideas are (1) a synthetic-unaware branch for classification that mixes\nreal and synthetic data and treats all data equally without distinguishing\nbetween them. (2) A synthetic-aware branch for improving the robustness of the\nfeature extractor by distinguishing between real and synthetic data and\nlearning their discrepancies. Extensive experimental results demonstrate that\nour method can improve the accuracy of long-tailed image recognition. Notably,\nour approach achieves state-of-the-art Top-1 accuracy and significantly\nsurpasses other methods on CIFAR-10-LT and CIFAR-100-LT datasets across various\nimbalance factors. Our code is available at https://github.com/lgX1123/gm4lt.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"D9HNY4Wvl28KY-cKw6T7grB-xXkBPqNaSRZYkreG1Nk","pdfSize":"2533476"}
