{"id":"2408.15324","title":"Detection Limits of Thermal-Infrared Observations with Adaptive Optics:\n  I. Observational Data","authors":"J. R. Sauter, W. Brandner, J. Heidt, F. Cantalloube","authorsParsed":[["Sauter","J. R.",""],["Brandner","W.",""],["Heidt","J.",""],["Cantalloube","F.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-29","timestamp":1724781601000,"abstract":"  Ground-based thermal infrared observations face substantial challenges in\ncorrecting the predominant background emitted as thermal radiation from the\natmosphere and the telescope itself. With the upcoming 40\\,m class ELTs,\nunprecedented sensitivities from ground will be reached, underlining the need\nof even more sophisticated background correction strategies. This study aims to\ninvestigate the impact of thermal backgrounds on ground-based observations and\nidentify possible limiting factors in dedicated correction strategies. We\nevaluate temporal and spatial characteristics of the thermal background in\ndirect imaging data obtained with different telescopes and observation modes.\nIn particular, three distinct datasets, acquired using VLT/NACO and KECK/NIRC2,\nare analyzed. Our analysis reveals that the observations are not fully photon\nshot noise limited, but exhibit additional sensitivity losses caused by\nimperfect background compensation in the different datasets. We identify\ncorrelations between background fluctuations and the activity of the adaptive\noptics system. We hypothesize that the pupil modulation of the adaptive optics\nmirrors introduces high frequency spatial and temporal fluctuations to the\nbackground, which could ultimately constrain the detection limit if they are\nnot compensated adequately.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BwLyIQ820Tspp__H64NiJrPM0NamVxTxbkwUrEC8b1o","pdfSize":"2440189"}
