{"id":"2408.06908","title":"Optical line shapes of color centers in solids from classical\n  autocorrelation functions","authors":"Christopher Linder\\\"alv and Nicklas \\\"Osterbacka and Julia Wiktor and\n  Paul Erhart","authorsParsed":[["Linderälv","Christopher",""],["Österbacka","Nicklas",""],["Wiktor","Julia",""],["Erhart","Paul",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 14:00:51 GMT"}],"updateDate":"2024-08-14","timestamp":1723557651000,"abstract":"  Color centers play key roles in applications, including, e.g., solid state\nlighting and quantum information technology, for which the coupling between\ntheir optical and vibrational properties is crucial. Established methodologies\nfor predicting the optical lineshapes of such emitters rely on the generating\nfunction (GF) approach and impose tight constraints on the shape of and\nrelationship between the ground and excited state landscapes, which limits\ntheir application range. Here, we describe an approach based on direct sampling\nof the underlying auto-correlation functions through molecular dynamics\nsimulations (MD-ACF) that overcomes these restrictions. The energy landscapes\nare represented by a machine-learned potential, which provides an accurate yet\nefficient description of both the ground and excited state landscapes through a\nsingle model, guaranteeing size-consistent predictions. We apply this\nmethodology to the (VSiVC)kk(0) divacancy defect in 4H-SiC, a prototypical\ncolor center, which has been studied both experimentally and theoretically. We\ndemonstrate that at low temperatures the present MD-ACF approach yields\npredictions in agreement with earlier GF calculations. Unlike the latter it is,\nhowever, also applicable at high temperatures as it is not subject to the same\nlimitations, especially with respect to handling of anharmonicity, and can be\napplied to study non-crystalline materials. While we discuss remaining\nchallenges and possible extensions, the methodology presented here already\nholds the potential to substantially widen the range of computational\npredictions of the optical properties of color centers and related defects,\nespecially for cases with pronounced anharmonicity and/or large differences\nbetween the initial and final states.\n","subjects":["Condensed Matter/Materials Science","Physics/Chemical Physics","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}