{"id":"2408.10963","title":"KeySpace: Public Key Infrastructure Considerations in Interplanetary\n  Networks","authors":"Joshua Smailes, Sebastian K\\\"ohler, Simon Birnbach, Martin Strohmeier,\n  Ivan Martinovic","authorsParsed":[["Smailes","Joshua",""],["Köhler","Sebastian",""],["Birnbach","Simon",""],["Strohmeier","Martin",""],["Martinovic","Ivan",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 16:00:17 GMT"}],"updateDate":"2024-08-21","timestamp":1724169617000,"abstract":"  As satellite networks grow larger and begin to incorporate interplanetary\ncommunication, there is an increasing interest in the unsolved problem of how\nto approach PKI in these conditions. In this paper we explore the goals and\nrequirements for implementing key management systems in satellite networks,\nfocusing on megaconstellations and interplanetary networks. We design a set of\nstandardized experiments which can be used to compare systems against one\nanother for particular network topologies. Using these, we demonstrate that\nterrestrial PKI techniques are feasible in highly distributed interplanetary\nnetworks, showing that it is possible to configure PKI systems to achieve\nefficient low-latency connection establishment, and minimize the impact of\nattacks through effective revocations.\n  We evaluate this by building the Deep Space Network Simulator (DSNS), a novel\nnetwork simulator aimed at efficient simulation of large space networks. We run\nsimulations evaluating connection establishment and key revocation under a wide\nrange of PKI configurations. Finally, we propose and evaluate two additional\nconfiguration options: OCSP Hybrid, and the use of relay nodes as a firewall.\nTogether these minimize the extent of the network an attacker can reach with a\ncompromised key, and reduce the attacker's load on interplanetary relay links.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ixPXa8g2fcyoD2rRS7v-iYzh1OpabEHMEX_FgEPjPqM","pdfSize":"615478"}
