{"id":"2408.05098","title":"Overcoming the Limitations of Layer Synchronization in Spiking Neural\n  Networks","authors":"Roel Koopman and Amirreza Yousefzadeh and Mahyar Shahsavari and\n  Guangzhi Tang and Manolis Sifalakis","authorsParsed":[["Koopman","Roel",""],["Yousefzadeh","Amirreza",""],["Shahsavari","Mahyar",""],["Tang","Guangzhi",""],["Sifalakis","Manolis",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 14:39:23 GMT"}],"updateDate":"2024-08-12","timestamp":1723214363000,"abstract":"  Currently, neural-network processing in machine learning applications relies\non layer synchronization, whereby neurons in a layer aggregate incoming\ncurrents from all neurons in the preceding layer, before evaluating their\nactivation function. This is practiced even in artificial Spiking Neural\nNetworks (SNNs), which are touted as consistent with neurobiology, in spite of\nprocessing in the brain being, in fact asynchronous. A truly asynchronous\nsystem however would allow all neurons to evaluate concurrently their threshold\nand emit spikes upon receiving any presynaptic current. Omitting layer\nsynchronization is potentially beneficial, for latency and energy efficiency,\nbut asynchronous execution of models previously trained with layer\nsynchronization may entail a mismatch in network dynamics and performance. We\npresent a study that documents and quantifies this problem in three datasets on\nour simulation environment that implements network asynchrony, and we show that\nmodels trained with layer synchronization either perform sub-optimally in\nabsence of the synchronization, or they will fail to benefit from any energy\nand latency reduction, when such a mechanism is in place. We then \"make ends\nmeet\" and address the problem with unlayered backprop, a novel\nbackpropagation-based training method, for learning models suitable for\nasynchronous processing. We train with it models that use different neuron\nexecution scheduling strategies, and we show that although their neurons are\nmore reactive, these models consistently exhibit lower overall spike density\n(up to 50%), reach a correct decision faster (up to 2x) without integrating all\nspikes, and achieve superior accuracy (up to 10% higher). Our findings suggest\nthat asynchronous event-based (neuromorphic) AI computing is indeed more\nefficient, but we need to seriously rethink how we train our SNN models, to\nbenefit from it.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"77MAmtkCe-tSMzWF3thy-K7Hw3Py6Iisf1kFoqDUuY4","pdfSize":"793895"}
