{"id":"2408.13053","title":"Constructing Tight Quadratic Relaxations for Global Optimization: I.\n  Outer-Approximating Twice-Differentiable Convex Functions","authors":"William R. Strahl, Arvind U. Raghunathan, Nikolaos V. Sahinidis,\n  Chrysanthos E. Gounaris","authorsParsed":[["Strahl","William R.",""],["Raghunathan","Arvind U.",""],["Sahinidis","Nikolaos V.",""],["Gounaris","Chrysanthos E.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 13:20:11 GMT"}],"updateDate":"2024-08-26","timestamp":1724419211000,"abstract":"  When computing bounds, spatial branch-and-bound algorithms often linearly\nouter approximate convex relaxations for non-convex expressions in order to\ncapitalize on the efficiency and robustness of linear programming solvers.\nConsidering that linear outer approximations sacrifice accuracy when\napproximating highly nonlinear functions and recognizing the recent\nadvancements in the efficiency and robustness of available methods to solve\noptimization problems with quadratic objectives and constraints, we contemplate\nhere the construction of quadratic outer approximations of twice-differentiable\nconvex functions for use in deterministic global optimization. To this end, we\npresent a novel cutting-plane algorithm that determines the tightest scaling\nparameter, $\\alpha$, in the second-order Taylor series approximation quadratic\nunderestimator proposed by Su et al. We use a representative set of convex\nfunctions extracted from optimization benchmark libraries to\nshowcase--qualitatively and quantitatively--the tightness of the constructed\nquadratic underestimators and to demonstrate the overall computational\nefficiency of our algorithm. Furthermore, we extend our construction procedure\nto generate even tighter quadratic underestimators by allowing overestimation\nin infeasible polyhedral regions of optimization problems, as informed by the\nlatter's linear constraints.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}