{"id":"2408.09867","title":"Physical properties of embedded clusters in ATLASGAL clumps with HII\n  regions","authors":"J. W. Zhou, Pavel Kroupa, and Sami Dib","authorsParsed":[["Zhou","J. W.",""],["Kroupa","Pavel",""],["Dib","Sami",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 10:18:30 GMT"}],"updateDate":"2024-08-20","timestamp":1724062710000,"abstract":"  Using the optimal sampling model, we synthesized the embedded clusters of\nATLASGAL clumps with HII regions (HII-clumps). The 0.1 Myr isochrone was used\nto estimate the bolometric luminosity of each star in an embedded cluster, we\nalso added the accretion luminosity of each star in the embeded cluster. The\ntotal bolometric luminosity of synthetic embedded clusters can well fit the\nobserved bolometric luminosity of HII-clumps. More realistically, we considered\nthe age spread in the young star and protostar populations in embedded clusters\nof HII-clumps by modeling both constant and time-varying star formation\nhistories (SFHs). According to the age distribution of the stellar population,\nwe distributed the appropriate isochrones to each star, and sorted out the\nfraction of stellar objects that are still protostars (Class 0 and Class I\nphases) to properly add their accretion luminosities. Compared to a constant\nSFH, burst-like and time-dependent SFHs can better fit the observational data.\nWe found that as long as 20\\% of the stars within the embedded cluster are\nstill accreting, the contribution of accretion luminosity will be significant\nto the total bolometric luminosity of low-mass HII-clumps with mass\nlog$_{10}$(M$_{\\rm cl}$/M$_{\\odot}$) $<$ 2.8. Variations in the accretion rate,\nthe SFE and the initial mass function (IMF) and more physical processes like\nthe external heating from HII regions and the flaring from pre-main sequence\n(PMS) stars and protostars need to be investigated to further explain the\nexcess luminosity of low-mass HII-clumps.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}