{"id":"2408.14292","title":"Decentralized Singular Value Decomposition for Extremely Large-scale\n  Antenna Array Systems","authors":"Yufan Fan and Marius Pesavento","authorsParsed":[["Fan","Yufan",""],["Pesavento","Marius",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 14:24:35 GMT"}],"updateDate":"2024-08-27","timestamp":1724682275000,"abstract":"  In this article, the problems of decentralized Singular Value Decomposition\n(d-SVD) and decentralized Principal Component Analysis (d-PCA) are studied,\nwhich are fundamental in various signal processing applications. Two scenarios\nof d-SVD are considered depending on the availability of the data matrix under\nconsideration. In the first scenario, the matrix of interest is row-wisely\navailable in each local node in the network. In the second scenario, the matrix\nof interest implicitly forms an outer product generated from two different\nseries of measurements. Combining the lightweight local rational function\napproximation approach and parallel averaging consensus algorithms, two d-SVD\nalgorithms are proposed to cope with the two aforementioned scenarios. We\ndemonstrate the proposed algorithms with two respective application examples\nfor Extremely Large-scale Antenna Array (ELAA) systems: decentralized sensor\nlocalization via low-rank matrix completion and decentralized passive radar\ndetection. Moreover, a non-trivial truncation technique, which employs a\nrepresentative vector that is orthonormal to the principal signal subspace, is\nproposed to further reduce the associated communication cost with the d-SVD\nalgorithms. Simulation results show that the proposed d-SVD algorithms converge\nto the centralized solution with reduced communication cost compared to those\nfacilitated with the state-of-the-art decentralized power method.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}