{"id":"2408.03646","title":"Goal-oriented Semantic Communication for the Metaverse Application","authors":"Zhe Wang, Nan Li, Yansha Deng","authorsParsed":[["Wang","Zhe",""],["Li","Nan",""],["Deng","Yansha",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 09:13:52 GMT"}],"updateDate":"2024-08-08","timestamp":1723022032000,"abstract":"  With the emergence of the metaverse and its role in enabling real-time\nsimulation and analysis of real-world counterparts, an increasing number of\npersonalized metaverse scenarios are being created to influence entertainment\nexperiences and social behaviors. However, compared to traditional image and\nvideo entertainment applications, the exact transmission of the vast amount of\nmetaverse-associated information significantly challenges the capacity of\nexisting bit-oriented communication networks. Moreover, the current metaverse\nalso witnesses a growing goal shift for transmitting the meaning behind\ncustom-designed content, such as user-designed buildings and avatars, rather\nthan exact copies of physical objects. To meet this growing goal shift and\nbandwidth challenge, this paper proposes a goal-oriented semantic communication\nframework for metaverse application (GSCM) to explore and define semantic\ninformation through the goal levels. Specifically, we first analyze the\ntraditional image communication framework in metaverse construction and then\ndetail our proposed semantic information along with the end-to-end wireless\ncommunication. We then describe the designed modules of the GSCM framework,\nincluding goal-oriented semantic information extraction, base knowledge\ndefinition, and neural radiance field (NeRF) based metaverse construction.\nFinally, numerous experiments have been conducted to demonstrate that, compared\nto image communication, our proposed GSCM framework decreases transmission\nlatency by up to 92.6% and enhances the virtual object operation accuracy and\nmetaverse construction clearance by up to 45.6% and 44.7%, respectively.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_q2cVSz-u7H9DJNisw6ilP4hr9vKPE1TxkmAfk7oG98","pdfSize":"3569090"}
