{"id":"2408.16821","title":"KASHz+SUPER: Evidence of cold molecular gas depletion in AGN hosts at\n  cosmic noon","authors":"E. Bertola, C. Circosta, M. Ginolfi, V. Mainieri, C. Vignali, G.\n  Calistro Rivera, S. R. Ward, I. E. Lopez, A. Pensabene, D. M. Alexander, M.\n  Bischetti, M. Brusa, M. Cappi, A. Comastri, A. Contursi, C. Cicone, G.\n  Cresci, M. Dadina, Q. D'Amato, A. Feltre, C. M. Harrison, D. Kakkad, I.\n  Lamperti, G. Lanzuisi, F. Mannucci, A. Marconi, M. Perna, E. Piconcelli, A.\n  Puglisi, F. Ricci, J. Scholtz, G. Tozzi, G. Vietri, G. Zamorani, L.\n  Zappacosta","authorsParsed":[["Bertola","E.",""],["Circosta","C.",""],["Ginolfi","M.",""],["Mainieri","V.",""],["Vignali","C.",""],["Rivera","G. Calistro",""],["Ward","S. R.",""],["Lopez","I. E.",""],["Pensabene","A.",""],["Alexander","D. M.",""],["Bischetti","M.",""],["Brusa","M.",""],["Cappi","M.",""],["Comastri","A.",""],["Contursi","A.",""],["Cicone","C.",""],["Cresci","G.",""],["Dadina","M.",""],["D'Amato","Q.",""],["Feltre","A.",""],["Harrison","C. M.",""],["Kakkad","D.",""],["Lamperti","I.",""],["Lanzuisi","G.",""],["Mannucci","F.",""],["Marconi","A.",""],["Perna","M.",""],["Piconcelli","E.",""],["Puglisi","A.",""],["Ricci","F.",""],["Scholtz","J.",""],["Tozzi","G.",""],["Vietri","G.",""],["Zamorani","G.",""],["Zappacosta","L.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:00:02 GMT"}],"updateDate":"2024-09-02","timestamp":1724954402000,"abstract":"  The energy released by AGN has the potential to heat or remove the gas of the\nISM, thus likely impacting the cold molecular gas reservoir of host galaxies at\nfirst, with star formation following on longer timescales. Previous works on\nhigh-z galaxies have yielded conflicting results, possibly due to selection\nbiases and other systematics. To provide a reliable benchmark for galaxy\nevolution models at cosmic noon (z=1-3), two surveys were conceived: SUPER and\nKASHz, both targeting unbiased X-ray-selected AGN at z>1 that span a wide\nbolometric luminosity range. In this paper, we assess the effects of AGN\nfeedback on the molecular gas content of host galaxies in a statistically\nrobust, uniformly selected, coherently analyzed sample of AGN at z=1-2.6, drawn\nfrom the KASHz and SUPER surveys. By using ALMA data in combination with\ndedicated SED modeling, we retrieve CO and FIR luminosity as well as $M_*$ of\nSUPER and KASHz AGN. We selected non-active galaxies from PHIBBS, ASPECS and\nmultiple ALMA/NOEMA surveys of sub-mm galaxies. By matching the samples in z,\n$M_*$ and $L_{FIR}$, we compared the properties of AGN and non-active galaxies\nwithin a Bayesian framework. We find that AGN hosts at given $L_{FIR}$ are on\naverage CO depleted compared to non-active galaxies, confirming what was\npreviously found in the SUPER survey. Moreover, the molecular gas fraction\ndistributions of AGN and non-active galaxies are statistically different, with\nthat of of AGN being skewed to lower values. Our results indicate that AGN can\nindeed reduce the total cold molecular gas reservoir of their host galaxies.\nLastly, by comparing our results with predictions from three cosmological\nsimulations (TNG, Eagle and Simba) filtered to match the observed properties,\nwe confirm already known discrepancies and highlight new ones between\nobservations and simulations.[Abridged]\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}