{"id":"2408.12408","title":"An Evaluation of Deep Learning Models for Stock Market Trend Prediction","authors":"Gonzalo Lopez Gil, Paul Duhamel-Sebline and Andrew McCarren","authorsParsed":[["Gil","Gonzalo Lopez",""],["Duhamel-Sebline","Paul",""],["McCarren","Andrew",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 13:58:55 GMT"}],"updateDate":"2024-08-23","timestamp":1724335135000,"abstract":"  The stock market is a fundamental component of financial systems, reflecting\neconomic health, providing investment opportunities, and influencing global\ndynamics. Accurate stock market predictions can lead to significant gains and\npromote better investment decisions. However, predicting stock market trends is\nchallenging due to their non-linear and stochastic nature. This study\ninvestigates the efficacy of advanced deep learning models for short-term trend\nforecasting using daily and hourly closing prices from the S&P 500 index and\nthe Brazilian ETF EWZ. The models explored include Temporal Convolutional\nNetworks (TCN), Neural Basis Expansion Analysis for Time Series Forecasting\n(N-BEATS), Temporal Fusion Transformers (TFT), Neural Hierarchical\nInterpolation for Time Series Forecasting (N-HiTS), and Time-series Dense\nEncoder (TiDE). Furthermore, we introduce the Extended Long Short-Term Memory\nfor Time Series (xLSTM-TS) model, an xLSTM adaptation optimised for time series\nprediction. Wavelet denoising techniques were applied to smooth the signal and\nreduce minor fluctuations, providing cleaner data as input for all approaches.\nDenoising significantly improved performance in predicting stock price\ndirection. Among the models tested, xLSTM-TS consistently outperformed others.\nFor example, it achieved a test accuracy of 72.82% and an F1 score of 73.16% on\nthe EWZ daily dataset. By leveraging advanced deep learning models and\neffective data preprocessing techniques, this research provides valuable\ninsights into the application of machine learning for market movement\nforecasting, highlighting both the potential and the challenges involved.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}