{"id":"2408.07201","title":"Quantification of total uncertainty in the physics-informed\n  reconstruction of CVSim-6 physiology","authors":"Mario De Florio, Zongren Zou, Daniele E. Schiavazzi, George Em\n  Karniadakis","authorsParsed":[["De Florio","Mario",""],["Zou","Zongren",""],["Schiavazzi","Daniele E.",""],["Karniadakis","George Em",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 21:10:39 GMT"}],"updateDate":"2024-08-15","timestamp":1723583439000,"abstract":"  When predicting physical phenomena through simulation, quantification of the\ntotal uncertainty due to multiple sources is as crucial as making sure the\nunderlying numerical model is accurate. Possible sources include irreducible\naleatoric uncertainty due to noise in the data, epistemic uncertainty induced\nby insufficient data or inadequate parameterization, and model-form uncertainty\nrelated to the use of misspecified model equations. Physics-based\nregularization interacts in nontrivial ways with aleatoric, epistemic and\nmodel-form uncertainty and their combination, and a better understanding of\nthis interaction is needed to improve the predictive performance of\nphysics-informed digital twins that operate under real conditions. With a\nspecific focus on biological and physiological models, this study investigates\nthe decomposition of total uncertainty in the estimation of states and\nparameters of a differential system simulated with MC X-TFC, a new\nphysics-informed approach for uncertainty quantification based on random\nprojections and Monte-Carlo sampling. MC X-TFC is applied to a six-compartment\nstiff ODE system, the CVSim-6 model, developed in the context of human\nphysiology. The system is analyzed by progressively removing data while\nestimating an increasing number of parameters and by investigating total\nuncertainty under model-form misspecification of non-linear resistance in the\npulmonary compartment. In particular, we focus on the interaction between the\nformulation of the discrepancy term and quantification of model-form\nuncertainty, and show how additional physics can help in the estimation\nprocess. The method demonstrates robustness and efficiency in estimating\nunknown states and parameters, even with limited, sparse, and noisy data. It\nalso offers great flexibility in integrating data with physics for improved\nestimation, even in cases of model misspecification.\n","subjects":["Computing Research Repository/Machine Learning","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}