{"id":"2408.14674","title":"gWaveNet: Classification of Gravity Waves from Noisy Satellite Data\n  using Custom Kernel Integrated Deep Learning Method","authors":"Seraj Al Mahmud Mostafa, Omar Faruque, Chenxi Wang, Jia Yue, Sanjay\n  Purushotham, Jianwu Wang","authorsParsed":[["Mostafa","Seraj Al Mahmud",""],["Faruque","Omar",""],["Wang","Chenxi",""],["Yue","Jia",""],["Purushotham","Sanjay",""],["Wang","Jianwu",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 22:50:59 GMT"}],"updateDate":"2024-08-28","timestamp":1724712659000,"abstract":"  Atmospheric gravity waves occur in the Earths atmosphere caused by an\ninterplay between gravity and buoyancy forces. These waves have profound\nimpacts on various aspects of the atmosphere, including the patterns of\nprecipitation, cloud formation, ozone distribution, aerosols, and pollutant\ndispersion. Therefore, understanding gravity waves is essential to comprehend\nand monitor changes in a wide range of atmospheric behaviors. Limited studies\nhave been conducted to identify gravity waves from satellite data using machine\nlearning techniques. Particularly, without applying noise removal techniques,\nit remains an underexplored area of research. This study presents a novel\nkernel design aimed at identifying gravity waves within satellite images. The\nproposed kernel is seamlessly integrated into a deep convolutional neural\nnetwork, denoted as gWaveNet. Our proposed model exhibits impressive\nproficiency in detecting images containing gravity waves from noisy satellite\ndata without any feature engineering. The empirical results show our model\noutperforms related approaches by achieving over 98% training accuracy and over\n94% test accuracy which is known to be the best result for gravity waves\ndetection up to the time of this work. We open sourced our code at\nhttps://rb.gy/qn68ku.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}