{"id":"2408.16697","title":"Ultrathin natural biotite crystals as a dielectric layer for van der\n  Waals heterostructure applications","authors":"Raphaela de Oliveira, Ana Beatriz Yoshida, Cesar Rabahi, Raul O.\n  Freitas, Christiano J. S. de Matos, Yara Galv\\~ao Gobato, Ingrid D. Barcelos,\n  and Alisson R. Cadore","authorsParsed":[["de Oliveira","Raphaela",""],["Yoshida","Ana Beatriz",""],["Rabahi","Cesar",""],["Freitas","Raul O.",""],["de Matos","Christiano J. S.",""],["Gobato","Yara Galvão",""],["Barcelos","Ingrid D.",""],["Cadore","Alisson R.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 16:46:24 GMT"}],"updateDate":"2024-08-30","timestamp":1724949984000,"abstract":"  Biotite, an iron-rich mineral belonging to the trioctahedral mica group, is a\nnaturally abundant layered material (LM) exhibiting attractive electronic\nproperties for application in nanodevices. Biotite stands out as a\nnon-degradable LM under ambient conditions, featuring high-quality basal\ncleavage, a significant advantage for van der Waals heterostructure (vdWH)\napplications. In this work, we present the micro-mechanical exfoliation of\nbiotite down to monolayers (1Ls), yielding ultrathin flakes with large areas\nand atomically flat surfaces. To identify and characterize the mineral, we\nconducted a multi-elemental analysis of biotite using energy-dispersive\nspectroscopy mapping. Additionally, synchrotron infrared nano-spectroscopy was\nemployed to probe its vibrational signature in few-layer form, with sensitivity\nto the layer number. We have also observed good morphological and structural\nstability in time (up to 12 months) and no important changes in their physical\nproperties after thermal annealing processes in ultrathin biotite flakes.\nConductive atomic force microscopy evaluated its electrical capacity, revealing\nan electrical breakdown strength of approximately 1 V/nm. Finally, we explore\nthe use of biotite as a substrate and encapsulating LM in vdWH applications. We\nhave performed optical and magneto-optical measurements at low temperatures. We\nfind that ultrathin biotite flakes work as a good substrate for 1L-MoSe2,\ncomparable to hexagonal boron nitride flakes, but it induces a small change of\nthe 1L-MoSe2 g-factor values, most likely due to natural impurities on its\ncrystal structure. Furthermore, our results show that biotite flakes are useful\nsystems to protect sensitive LMs such as black phosphorus from degradation for\nup to 60 days in ambient air. Our study introduces biotite as a promising,\ncost-effective LM for the advancement of future ultrathin nanotechnologies.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}