{"id":"2408.14291","title":"Applying digital twins for the management of information in turnaround\n  event operations in commercial airports","authors":"Javier Conde, Andres Munoz-Arcentales, Mario Romero, Javier Rojo,\n  Joaqu\\'in Salvach\\'ua, Gabriel Huecas, \\'Alvaro Alonso","authorsParsed":[["Conde","Javier",""],["Munoz-Arcentales","Andres",""],["Romero","Mario",""],["Rojo","Javier",""],["Salvachúa","Joaquín",""],["Huecas","Gabriel",""],["Alonso","Álvaro",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 14:24:07 GMT"}],"updateDate":"2024-08-27","timestamp":1724682247000,"abstract":"  The aerospace sector is one of the many sectors in which large amounts of\ndata are generated. Thanks to the evolution of technology, these data can be\nexploited in several ways to improve the operation and management of industrial\nprocesses. However, to achieve this goal, it is necessary to define\narchitectures and data models that allow to manage and homogenise the\nheterogeneous data collected. In this paper, we present an Airport Digital Twin\nReference Conceptualisation's and data model based on FIWARE Generic Enablers\nand the Next Generation Service Interfaces-Linked Data standard. Concretely, we\nparticularise the Airport Digital Twin to improve the efficiency of flight\nturnaround events. The architecture proposed is validated in the Aberdeen\nInternational Airport with the aim of reducing delays in commercial flights.\nThe implementation includes an application that shows the real state of the\nairport, combining two-dimensional and three-dimensional virtual reality\nrepresentations of the stands, and a mobile application that helps ground\noperators to schedule departure and arrival flights.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ZT6Gr_FpX_lQH86q1l_xTKwCb0hz06M0tQZXUN3DQnY","pdfSize":"7560122"}
