{"id":"2408.12926","title":"Balancing AoI and Rate for Mission-Critical and eMBB Coexistence with\n  Puncturing, NOMA,and RSMA in Cellular Uplink","authors":"Farnaz Khodakhah, Aamir Mahmood, \\v{C}edomir Stefanovi\\'c, Hossam\n  Farag, Patrik \\\"Osterberg, Mikael Gidlund","authorsParsed":[["Khodakhah","Farnaz",""],["Mahmood","Aamir",""],["Stefanović","Čedomir",""],["Farag","Hossam",""],["Österberg","Patrik",""],["Gidlund","Mikael",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 09:08:37 GMT"}],"updateDate":"2024-08-26","timestamp":1724404117000,"abstract":"  Through the lens of average and peak age-of-information (AoI), this paper\ntakes a fresh look into the uplink medium access solutions for mission-critical\n(MC) communication coexisting with enhanced mobile broadband (eMBB) service.\nConsidering the stochastic packet arrivals from an MC user, we study three\naccess schemes: orthogonal multiple access (OMA) with eMBB preemption\n(puncturing), non-orthogonal multiple access (NOMA), and rate-splitting\nmultiple access (RSMA), the latter two both with concurrent eMBB transmissions.\nPuncturing is found to reduce both average AoI and peak AoI (PAoI) violation\nprobability but at the expense of decreased eMBB user rates and increased\nsignaling complexity. Conversely, NOMA and RSMA offer higher eMBB rates but may\nlead to MC packet loss and AoI degradation. The paper systematically\ninvestigates the conditions under which NOMA or RSMA can closely match the\naverage AoI and PAoI violation performance of puncturing while maintaining data\nrate gains. Closed-form expressions for average AoI and PAoI violation\nprobability are derived, and conditions on the eMBB and MC channel gain\ndifference with respect to the base station are analyzed. Additionally, optimal\npower and rate splitting factors in RSMA are determined through an exhaustive\nsearch to minimize MC outage probability. Notably, our results indicate that\nwith a small loss in the average AoI and PAoI violation probability the eMBB\nrate in NOMA and RSMA can be approximately five times higher than that achieved\nthrough puncturing.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4y3r1GjWb2wOKTpk4yFpNv-3NTbwss_s2WeHqBknwIA","pdfSize":"1904550"}
