{"id":"2408.08134","title":"CorrAdaptor: Adaptive Local Context Learning for Correspondence Pruning","authors":"Wei Zhu, Yicheng Liu, Yuping He, Tangfei Liao, Kang Zheng, Xiaoqiu Xu,\n  Tao Wang, Tong Lu","authorsParsed":[["Zhu","Wei",""],["Liu","Yicheng",""],["He","Yuping",""],["Liao","Tangfei",""],["Zheng","Kang",""],["Xu","Xiaoqiu",""],["Wang","Tao",""],["Lu","Tong",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 13:09:37 GMT"}],"updateDate":"2024-08-16","timestamp":1723727377000,"abstract":"  In the fields of computer vision and robotics, accurate pixel-level\ncorrespondences are essential for enabling advanced tasks such as\nstructure-from-motion and simultaneous localization and mapping. Recent\ncorrespondence pruning methods usually focus on learning local consistency\nthrough k-nearest neighbors, which makes it difficult to capture robust context\nfor each correspondence. We propose CorrAdaptor, a novel architecture that\nintroduces a dual-branch structure capable of adaptively adjusting local\ncontexts through both explicit and implicit local graph learning. Specifically,\nthe explicit branch uses KNN-based graphs tailored for initial neighborhood\nidentification, while the implicit branch leverages a learnable matrix to\nsoftly assign neighbors and adaptively expand the local context scope,\nsignificantly enhancing the model's robustness and adaptability to complex\nimage variations. Moreover, we design a motion injection module to integrate\nmotion consistency into the network to suppress the impact of outliers and\nrefine local context learning, resulting in substantial performance\nimprovements. The experimental results on extensive correspondence-based tasks\nindicate that our CorrAdaptor achieves state-of-the-art performance both\nqualitatively and quantitatively. The code and pre-trained models are available\nat https://github.com/TaoWangzj/CorrAdaptor.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}