{"id":"2408.16170","title":"CardBench: A Benchmark for Learned Cardinality Estimation in Relational\n  Databases","authors":"Yannis Chronis, Yawen Wang, Yu Gan, Sami Abu-El-Haija, Chelsea Lin,\n  Carsten Binnig, Fatma \\\"Ozcan","authorsParsed":[["Chronis","Yannis",""],["Wang","Yawen",""],["Gan","Yu",""],["Abu-El-Haija","Sami",""],["Lin","Chelsea",""],["Binnig","Carsten",""],["Özcan","Fatma",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 23:25:25 GMT"}],"updateDate":"2024-08-30","timestamp":1724887525000,"abstract":"  Cardinality estimation is crucial for enabling high query performance in\nrelational databases. Recently learned cardinality estimation models have been\nproposed to improve accuracy but there is no systematic benchmark or datasets\nwhich allows researchers to evaluate the progress made by new learned\napproaches and even systematically develop new learned approaches. In this\npaper, we are releasing a benchmark, containing thousands of queries over 20\ndistinct real-world databases for learned cardinality estimation. In contrast\nto other initial benchmarks, our benchmark is much more diverse and can be used\nfor training and testing learned models systematically. Using this benchmark,\nwe explored whether learned cardinality estimation can be transferred to an\nunseen dataset in a zero-shot manner. We trained GNN-based and\ntransformer-based models to study the problem in three setups: 1-)\ninstance-based, 2-) zero-shot, and 3-) fine-tuned. Our results show that while\nwe get promising results for zero-shot cardinality estimation on simple single\ntable queries; as soon as we add joins, the accuracy drops. However, we show\nthat with fine-tuning, we can still utilize pre-trained models for cardinality\nestimation, significantly reducing training overheads compared to instance\nspecific models. We are open sourcing our scripts to collect statistics,\ngenerate queries and training datasets to foster more extensive research, also\nfrom the ML community on the important problem of cardinality estimation and in\nparticular improve on recent directions such as pre-trained cardinality\nestimation.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}