{"id":"2408.12773","title":"Enhancement of the Third Harmonic Generation Efficiency of ITO\n  nanolayers coupled to Tamm Plasmon Polaritons","authors":"Tornike Shubitidze, Luca Dal Negro","authorsParsed":[["Shubitidze","Tornike",""],["Negro","Luca Dal",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 00:31:21 GMT"}],"updateDate":"2024-08-26","timestamp":1724373081000,"abstract":"  We study the enhancement of third harmonic generation in indium tin oxide\nnanolayers coupled to Tamm plasmon polaritons (TPPs). The TPPs are excited at\nthe interface between a thin gold mirror and a silicon dioxide/silicon nitride\n(SiO2/Si3N4) distributed Bragg reflector with a 30nm-thick indium tin oxide\n(ITO) nanolayer embedded in hte topmost dielectric layer under the metal\nmirror. This ITO nanolayer exhibits epsilon-near-zero (ENZ) behavior at\nnearinfrared wavelengths. By tuning the angle of incidence and resonance\nconditions, we achieve strong confinement and localization of the\nelectromagnetic field at the TPP mode, which significantly boosts the local\nelectric field and the nonlinear optical response of the structure. Our\nexperiments reveal that the third harmonic generation (THG) efficiency is\nmaximized when the TPP resonance coincides with the ENZ wavelength (i.e., the\nwavelength at which the real part of the ITO permittivity vanishes) of the ITO,\nresulting in a tenfold enhancement of the measured THG efficiency compared to a\nbare ITO nanolayer. We further investigate the dependence of the THG signal on\nthe incident angle and sample orientation, confirming that the enhancement is\ndirectly related to the excitation of the TPP mode with nonreciprocal\nbehaviour. Numerical simulations based on the transfer matrix method (TMM)\nsupport our findings. Our study demonstrates that the TPP-ENZ platform offers a\nversatile and highly efficient approach to enhancing nonlinear optical\nprocesses, with potential applications in frequency conversion, optical signal\nprocessing, and the development of quantum photonic devices.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}