{"id":"2408.11242","title":"Coherent radio emission from 'Main-sequence Radio Pulse emitters': a new\n  stellar diagnostic to probe 3D magnetospheric structures","authors":"Barnali Das, Poonam Chandra, Veronique Petit","authorsParsed":[["Das","Barnali",""],["Chandra","Poonam",""],["Petit","Veronique",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 23:41:57 GMT"}],"updateDate":"2024-08-22","timestamp":1724197317000,"abstract":"  Main-sequence Radio Pulse emitters (MRPs) are magnetic early-type stars that\nproduce coherent radio emission observed in the form of periodic radio pulses.\nThe emission mechanism behind is the Electron Cyclotron Maser Emission (ECME).\nAmongst all kinds of magnetospheric emission, ECME is unique due to its high\ndirectivity and intrinsically narrow bandwidth. The emission is also highly\ncircularly polarized and the sign of polarization is opposite for the two\nmagnetic hemispheres. This combination of properties makes ECME highly\nsensitive to the three-dimensional structures in the stellar magnetospheres.\nThis is especially significant for late-B and A-type magnetic stars that do not\nemit other types of magnetospheric emission such as Halpha, the key probe used\nto trace magnetospheric densities. In this paper, we use ultra-wideband\nobservation (0.4-2 GHz) of a late B-type MRP HD 133880 to demonstrate how we\ncan extract information on plasma distribution from ECME. We achieve this by\nexamining the differences in pulse arrival times ('lags') as a function of\nfrequencies, and qualitatively comparing those with lags obtained by simulating\nECME ray paths in hot stars' magnetospheres. This reveals that the stellar\nmagnetosphere has a disk-like overdensity inclined to the magnetic equator with\na centrally concentrated density that primarily affects the intermediate\nfrequencies (400-800 MHz). This result, which is consistent with recent density\nmodel proposed for hotter centrifugally supported magnetospheres, lends support\nto the idea of a unifying model for magnetospheric operations in early-type\nstars, and also provides further motivation to fully characterize the ECME\nphenomenon in large-scale stellar magnetospheres.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}