{"id":"2408.00779","title":"Learning Structurally Stabilized Representations for Multi-modal\n  Lossless DNA Storage","authors":"Ben Cao, Tiantian He, Xue Li, Bin Wang, Xiaohu Wu, Qiang Zhang,\n  Yew-Soon Ong","authorsParsed":[["Cao","Ben",""],["He","Tiantian",""],["Li","Xue",""],["Wang","Bin",""],["Wu","Xiaohu",""],["Zhang","Qiang",""],["Ong","Yew-Soon",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 06:31:49 GMT"}],"updateDate":"2024-08-05","timestamp":1721197909000,"abstract":"  In this paper, we present Reed-Solomon coded single-stranded representation\nlearning (RSRL), a novel end-to-end model for learning representations for\nmulti-modal lossless DNA storage. In contrast to existing learning-based\nmethods, the proposed RSRL is inspired by both error-correction codec and\nstructural biology. Specifically, RSRL first learns the representations for the\nsubsequent storage from the binary data transformed by the Reed-Solomon codec.\nThen, the representations are masked by an RS-code-informed mask to focus on\ncorrecting the burst errors occurring in the learning process. With the decoded\nrepresentations with error corrections, a novel biologically stabilized loss is\nformulated to regularize the data representations to possess stable\nsingle-stranded structures. By incorporating these novel strategies, the\nproposed RSRL can learn highly durable, dense, and lossless representations for\nthe subsequent storage tasks into DNA sequences. The proposed RSRL has been\ncompared with a number of strong baselines in real-world tasks of multi-modal\ndata storage. The experimental results obtained demonstrate that RSRL can store\ndiverse types of data with much higher information density and durability but\nmuch lower error rates.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Emerging Technologies","Computing Research Repository/Information Theory","Mathematics/Information Theory","Quantitative Biology/Biomolecules"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}