{"id":"2408.14573","title":"Deep Einstein@Home search for Continuous Gravitational Waves from the\n  Central Compact Objects in the Supernova Remnants Vela Jr. and G347.3-0.5\n  using LIGO public data","authors":"Jing Ming, Maria Alessandra Papa, Heinz-Bernd Eggenstein, Banafsheh\n  Beheshtipour, Bernd Machenschalk, Reinhard Prix, Bruce Allen, Maximillian\n  Bensch","authorsParsed":[["Ming","Jing",""],["Papa","Maria Alessandra",""],["Eggenstein","Heinz-Bernd",""],["Beheshtipour","Banafsheh",""],["Machenschalk","Bernd",""],["Prix","Reinhard",""],["Allen","Bruce",""],["Bensch","Maximillian",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 18:43:11 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 20:13:35 GMT"}],"updateDate":"2024-09-04","timestamp":1724697791000,"abstract":"  We perform a search for continuous nearly monochromatic gravitational waves\nfrom the central compact objects associated with the supernova remnants Vela\nJr. and G347.3 using LIGO O2 and O3 public data. Over $10^{18}$ different\nwaveforms are considered, covering signal frequencies between 20-1300 Hz\n(20-400 Hz) for G347.3-0.5 (Vela Jr) and a very broad range of frequency\nderivatives. Thousands of volunteers donating compute cycles through the\ncomputing project Einstein@Home have made this endeavour possible. Following\nthe Einstein@Home search, we perform multi-stage follow-ups of over 5 million\nwaveforms. The selection threshold is set so that a signal could be confirmed\nusing the first half of the LIGO O3 data. We find no significant signal\ncandidate for either targets. Based on this null result, for G347.3-0.5, we set\nthe most constraining upper limits to date on the amplitude of gravitational\nwave signals, corresponding to deformations below $10^{-6}$ in a large part of\nthe search band. At the frequency of best strain sensitivity, near $161$ Hz, we\nset 90\\%\\ confidence upper limits on the gravitational wave intrinsic amplitude\nof $h_0^{90\\%}\\approx 6.2\\times10^{-26}$. Over most of the frequency range our\nupper limits are a factor of 10 smaller than the indirect age-based upper\nlimit. For Vela Jr., near $163$ Hz, we set $h_0^{90\\%}\\approx\n6.4\\times10^{-26}$. Over most of the frequency range our upper limits are a\nfactor of 15 smaller than the indirect age-based upper limit. The Vela Jr.\nupper limits presented here are slightly less constraining than the most recent\nupper limits of \\cite{ligo_o3a_c_v} but they apply to a broader set of signals.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}