{"id":"2408.12210","title":"Enhancing Causal Discovery in Financial Networks with Piecewise Quantile\n  Regression","authors":"Cameron Cornell, Lewis Mitchell, Matthew Roughan","authorsParsed":[["Cornell","Cameron",""],["Mitchell","Lewis",""],["Roughan","Matthew",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 08:39:09 GMT"}],"updateDate":"2024-08-23","timestamp":1724315949000,"abstract":"  Financial networks can be constructed using statistical dependencies found\nwithin the price series of speculative assets. Across the various methods used\nto infer these networks, there is a general reliance on predictive modelling to\ncapture cross-correlation effects. These methods usually model the flow of\nmean-response information, or the propagation of volatility and risk within the\nmarket. Such techniques, though insightful, don't fully capture the broader\ndistribution-level causality that is possible within speculative markets. This\npaper introduces a novel approach, combining quantile regression with a\npiecewise linear embedding scheme - allowing us to construct causality networks\nthat identify the complex tail interactions inherent to financial markets.\nApplying this method to 260 cryptocurrency return series, we uncover\nsignificant tail-tail causal effects and substantial causal asymmetry. We\nidentify a propensity for coins to be self-influencing, with comparatively\nsparse cross variable effects. Assessing all link types in conjunction, Bitcoin\nstands out as the primary influencer - a nuance that is missed in conventional\nlinear mean-response analyses. Our findings introduce a comprehensive framework\nfor modelling distributional causality, paving the way towards more holistic\nrepresentations of causality in financial markets.\n","subjects":["Quantitative Finance/Statistical Finance","Economics/Econometrics","Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"z_wfawzX5vNDmWwHS6nMLEtNgyAyOqTo0_6DxmuPoQc","pdfSize":"4304505"}
