{"id":"2408.09562","title":"Security Concerns in Quantum Machine Learning as a Service","authors":"Satwik Kundu and Swaroop Ghosh","authorsParsed":[["Kundu","Satwik",""],["Ghosh","Swaroop",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 18:21:24 GMT"}],"updateDate":"2024-08-20","timestamp":1724005284000,"abstract":"  Quantum machine learning (QML) is a category of algorithms that employ\nvariational quantum circuits (VQCs) to tackle machine learning tasks. Recent\ndiscoveries have shown that QML models can effectively generalize from limited\ntraining data samples. This capability has sparked increased interest in\ndeploying these models to address practical, real-world challenges, resulting\nin the emergence of Quantum Machine Learning as a Service (QMLaaS). QMLaaS\nrepresents a hybrid model that utilizes both classical and quantum computing\nresources. Classical computers play a crucial role in this setup, handling\ninitial pre-processing and subsequent post-processing of data to compensate for\nthe current limitations of quantum hardware. Since this is a new area, very\nlittle work exists to paint the whole picture of QMLaaS in the context of known\nsecurity threats in the domain of classical and quantum machine learning. This\nSoK paper is aimed to bridge this gap by outlining the complete QMLaaS\nworkflow, which encompasses both the training and inference phases and\nhighlighting significant security concerns involving untrusted classical or\nquantum providers. QML models contain several sensitive assets, such as the\nmodel architecture, training/testing data, encoding techniques, and trained\nparameters. Unauthorized access to these components could compromise the\nmodel's integrity and lead to intellectual property (IP) theft. We pinpoint the\ncritical security issues that must be considered to pave the way for a secure\nQMLaaS deployment.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}