{"id":"2408.02467","title":"Inferring firm-level supply chain networks with realistic systemic risk\n  from industry sector-level data","authors":"Massimiliano Fessina, Giulio Cimini, Tiziano Squartini, Pablo\n  Astudillo-Est\\'evez, Stefan Thurner and Diego Garlaschelli","authorsParsed":[["Fessina","Massimiliano",""],["Cimini","Giulio",""],["Squartini","Tiziano",""],["Astudillo-Estévez","Pablo",""],["Thurner","Stefan",""],["Garlaschelli","Diego",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 13:48:56 GMT"}],"updateDate":"2024-08-28","timestamp":1722865736000,"abstract":"  Production networks constitute the backbone of every economic system. They\nare inherently fragile as several recent crises clearly highlighted. Estimating\nthe system-wide consequences of local disruptions (systemic risk) requires\ndetailed information on the supply chain networks (SCN) at the firm-level, as\nsystemic risk is associated with specific mesoscopic patterns. However, such\ninformation is usually not available and realistic estimates must be inferred\nfrom available sector-level data such as input-output tables and firm-level\naggregate output data. Here we explore the ability of several maximum-entropy\nalgorithms to infer realizations of SCNs characterized by a realistic level of\nsystemic risk. We are in the unique position to test them against the actual\nEcuadorian production network at the firm-level. Concretely, we compare various\nproperties, including the Economic Systemic Risk Index, of the Ecuadorian\nproduction network with those from four inference models. We find that the most\nrealistic systemic risk content at the firm-level is retrieved by the model\nthat incorporates information about firm-specific input disaggregated by\nsector, indicating the importance of correctly accounting for firms'\nheterogeneous input profiles across sectors. Our results clearly demonstrate\nthe minimal amount of empirical information at the sector level that is\nnecessary to statistically generate synthetic SCNs that encode realistic\nfirm-specific systemic risk.\n","subjects":["Physics/Physics and Society","Quantitative Finance/Risk Management"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}