{"id":"2408.02876","title":"Elevating Software Trust: Unveiling and Quantifying the Risk Landscape","authors":"Sarah Ali Siddiqui, Chandra Thapa, Rayne Holland, Wei Shao, and Seyit\n  Camtepe","authorsParsed":[["Siddiqui","Sarah Ali",""],["Thapa","Chandra",""],["Holland","Rayne",""],["Shao","Wei",""],["Camtepe","Seyit",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 00:50:08 GMT"}],"updateDate":"2024-08-07","timestamp":1722905408000,"abstract":"  Considering the ever-evolving threat landscape and rapid changes in software\ndevelopment, we propose a risk assessment framework SRiQT (Software Risk\nQuantification through Trust). This framework is based on the necessity of a\ndynamic, data-driven, and adaptable process to quantify risk in the software\nsupply chain. Usually, when formulating such frameworks, static pre-defined\nweights are assigned to reflect the impact of each contributing parameter while\naggregating these individual parameters to compute resulting risk scores. This\nleads to inflexibility, a lack of adaptability, and reduced accuracy, making\nthem unsuitable for the changing nature of the digital world. We adopt a novel\nperspective by examining risk through the lens of trust and incorporating the\nhuman aspect. Moreover, we quantify risk associated with individual software by\nassessing and formulating risk elements quantitatively and exploring dynamic\ndata-driven weight assignment. This enhances the sensitivity of the framework\nto cater to the evolving risk factors associated with software development and\nthe different actors involved in the entire process. The devised framework is\ntested through a dataset containing 9000 samples, comprehensive scenarios,\nassessments, and expert opinions. Furthermore, a comparison between scores\ncomputed by the OpenSSF scorecard, OWASP risk calculator, and the proposed\nSRiQT framework has also been presented. The results suggest that SRiQT\nmitigates subjectivity and yields dynamic data-driven weights as well as risk\nscores.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"d1v3Spm5FXvW3Q0RLXSCq9L6cFZa8e6Nq84flx1LlEY","pdfSize":"717520"}
