{"id":"2408.16946","title":"Best of two worlds: Cartesian sampling and volume computation for\n  distance-constrained configuration spaces using Cayley coordinates","authors":"Yichi Zhang and Meera Sitharam","authorsParsed":[["Zhang","Yichi",""],["Sitharam","Meera",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 23:57:28 GMT"}],"updateDate":"2024-09-02","timestamp":1724975848000,"abstract":"  Volume calculation of configurational spaces acts as a vital part in\nconfigurational entropy calculation, which contributes towards calculating free\nenergy landscape for molecular systems. In this article, we present our\nsampling-based volume computation method using distance-based Cayley\ncoordinate, mitigating drawbacks: our method guarantees that the sampling\nprocedure stays in lower-dimensional coordinate space (instead of\nhigher-dimensional Cartesian space) throughout the whole process; and our\nmapping function, utilizing Cayley parameterization, can be applied in both\ndirections with low computational cost. Our method uniformly samples and\ncomputes a discrete volume measure of a Cartesian configuration space of point\nsets satisfying systems of distance inequality constraints. The systems belong\nto a large natural class whose feasible configuration spaces are effectively\nlower dimensional subsets of high dimensional ambient space. Their topological\ncomplexity makes discrete volume computation challenging, yet necessary in\nseveral application scenarios including free energy calculation in soft matter\nassembly modeling. The algorithm runs in linear time and empirically sub-linear\nspace in the number of grid hypercubes (used to define the discrete volume\nmeasure) \\textit{that intersect} the configuration space. In other words, the\nnumber of wasted grid cube visits is insignificant compared to prevailing\nmethods typically based on gradient descent. Specifically, the traversal stays\nwithin the feasible configuration space by viewing it as a branched covering,\nusing a recent theory of Cayley or distance coordinates to convexify the base\nspace, and by employing a space-efficient, frontier hypercube traversal data\nstructure. A software implementation and comparison with existing methods is\nprovided.\n","subjects":["Computing Research Repository/Computational Geometry"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Fb4rJOLjZzbB-X_si9WLKOjX8eSAmjieUaYZe2JcxCQ","pdfSize":"1965311"}
