{"id":"2408.01107","title":"BioRAG: A RAG-LLM Framework for Biological Question Reasoning","authors":"Chengrui Wang, Qingqing Long, Meng Xiao, Xunxin Cai, Chengjun Wu, Zhen\n  Meng, Xuezhi Wang, Yuanchun Zhou","authorsParsed":[["Wang","Chengrui",""],["Long","Qingqing",""],["Xiao","Meng",""],["Cai","Xunxin",""],["Wu","Chengjun",""],["Meng","Zhen",""],["Wang","Xuezhi",""],["Zhou","Yuanchun",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 08:37:03 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 09:54:24 GMT"}],"updateDate":"2024-08-15","timestamp":1722587823000,"abstract":"  The question-answering system for Life science research, which is\ncharacterized by the rapid pace of discovery, evolving insights, and complex\ninteractions among knowledge entities, presents unique challenges in\nmaintaining a comprehensive knowledge warehouse and accurate information\nretrieval. To address these issues, we introduce BioRAG, a novel\nRetrieval-Augmented Generation (RAG) with the Large Language Models (LLMs)\nframework. Our approach starts with parsing, indexing, and segmenting an\nextensive collection of 22 million scientific papers as the basic knowledge,\nfollowed by training a specialized embedding model tailored to this domain.\nAdditionally, we enhance the vector retrieval process by incorporating a\ndomain-specific knowledge hierarchy, which aids in modeling the intricate\ninterrelationships among each query and context. For queries requiring the most\ncurrent information, BioRAG deconstructs the question and employs an iterative\nretrieval process incorporated with the search engine for step-by-step\nreasoning. Rigorous experiments have demonstrated that our model outperforms\nfine-tuned LLM, LLM with search engines, and other scientific RAG frameworks\nacross multiple life science question-answering tasks.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}