{"id":"2408.05371","title":"Overcoming the Thermal-Noise Limit of Room-Temperature Microwave\n  Measurements by Cavity Pre-cooling with a Low-Noise Amplifier. Application to\n  Time-resolved Electron Paramagnetic Resonance","authors":"Kuan-Cheng Chen and Mark Oxborrow","authorsParsed":[["Chen","Kuan-Cheng",""],["Oxborrow","Mark",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 22:43:29 GMT"}],"updateDate":"2024-08-13","timestamp":1723243409000,"abstract":"  We demonstrate an inexpensive, bench-top method, which we here name cavity\npre-cooling (CPC), for removing, just prior to performing a measurement, a\nlarge fraction of the deleterious thermal photons that would otherwise occupy\nthe electromagnetic modes of a microwave cavity (or some alternative form of rf\nresonator) at room temperature. Our method repurposes the input of a commercial\nHEMT-based low-noise amplifier (LNA) to serve as a photon-absorbing cold load\nthat is temporarily over-coupled to the cavity. No isolator is inserted between\nthe LNA and the coupling port of the cavity. In a proof-of-concept experiment,\nthe noise temperature of a monitored microwave mode drops from a little below\nroom temperature to approx 108 K. Upon incorporating our pre-coolable cavity\ninto a time-resolved (tr-) EPR spectrometer, a commensurate improvement in the\nsignal-to-noise ratio is observed, corresponding to a factor-of-5 speed up over\na conventional tr-EPR measurement at room temperature for the same precision\nand/or sensitivity. Simulations indicate the feasibility, for realistic Q\nfactors and couplings, of cooling the temperatures of the modes of a cavity\ndown to a few tens of K, and for this coldness to last several tens of\nmicroseconds whilst the cavity and its contents are optimally interrogated by a\nmicrowave tone or pulse sequence. The method thus provides a generally\napplicable and extremely convenient approach to improving the sensitivity\nand/or read-out speed in pulsed or time-resolved EPR spectroscopy, quantum\ndetection and other radiometric measurements performed at or near room\ntemperature. It also provides a first-stage cold reservoir (of microwave\nphotons) for deeper cooling methods to work from.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}