{"id":"2408.01889","title":"Dynamic Behavior of Origami Structures: Computational and Experimental\n  Study","authors":"Sudheendra Herkal, Satish Nagarajaiah and Glaucio Paulino","authorsParsed":[["Herkal","Sudheendra",""],["Nagarajaiah","Satish",""],["Paulino","Glaucio",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 00:35:36 GMT"}],"updateDate":"2024-08-06","timestamp":1722731736000,"abstract":"  Origami structures have been receiving a lot of attention from engineering\nand scientific researchers owing to their unique properties such as\ndeployability, multi-stability, negative stiffness, etc. However, dynamic\nproperties of origami structures have not been explored much due to a lack of\nvalidated analytical dynamic modeling approaches. Given the range of\ninteresting properties and applications of origami structures, it is important\nto study the dynamic behavior of origami structures. In this study, a dynamic\nmodeling approach for origami structures is presented considering distributed\nmass modeling, which has the potential to be a generalizable approach. In the\nproposed approach, stiffness is modeled using the bar and hinge modeling\napproach while the mass is modeled using the mass distribution approach.\nVarious candidate mass distribution approaches were investigated by comparing\ntheir responses to the finite element method responses for various geometric\nconditions, loading and boundary conditions, and deformation modes. It was\nobserved that a dynamic modeling approach with triangle circumcenter mass\ndistribution was able to capture most of the dynamics satisfactorily\nconsistently. Subsequently, a Miura-ori specimen was manufactured and its free\nvibration response was determined experimentally and then compared to the\nprediction of the analytical model. The comparison demonstrated that the\nanalytical model was able to capture most of the dynamics in the longitudinal\ndirection.\n","subjects":["Condensed Matter/Materials Science","Nonlinear Sciences/Chaotic Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}