{"id":"2408.08862","title":"Visual Agents as Fast and Slow Thinkers","authors":"Guangyan Sun, Mingyu Jin, Zhenting Wang, Cheng-Long Wang, Siqi Ma,\n  Qifan Wang, Ying Nian Wu, Yongfeng Zhang, Dongfang Liu","authorsParsed":[["Sun","Guangyan",""],["Jin","Mingyu",""],["Wang","Zhenting",""],["Wang","Cheng-Long",""],["Ma","Siqi",""],["Wang","Qifan",""],["Wu","Ying Nian",""],["Zhang","Yongfeng",""],["Liu","Dongfang",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 17:44:02 GMT"},{"version":"v2","created":"Fri, 6 Sep 2024 19:04:54 GMT"}],"updateDate":"2024-09-10","timestamp":1723830242000,"abstract":"  Achieving human-level intelligence requires refining cognitive distinctions\nbetween System 1 and System 2 thinking. While contemporary AI, driven by large\nlanguage models, demonstrates human-like traits, it falls short of genuine\ncognition. Transitioning from structured benchmarks to real-world scenarios\npresents challenges for visual agents, often leading to inaccurate and overly\nconfident responses. To address the challenge, we introduce FaST, which\nincorporates the Fast and Slow Thinking mechanism into visual agents. FaST\nemploys a switch adapter to dynamically select between System 1/2 modes,\ntailoring the problem-solving approach to different task complexity. It tackles\nuncertain and unseen objects by adjusting model confidence and integrating new\ncontextual data. With this novel design, we advocate a flexible system,\nhierarchical reasoning capabilities, and a transparent decision-making\npipeline, all of which contribute to its ability to emulate human-like\ncognitive processes in visual intelligence. Empirical results demonstrate that\nFaST outperforms various well-known baselines, achieving 80.8% accuracy over\nVQA^{v2} for visual question answering and 48.7% GIoU score over ReasonSeg for\nreasoning segmentation, demonstrate FaST's superior performance. Extensive\ntesting validates the efficacy and robustness of FaST's core components,\nshowcasing its potential to advance the development of cognitive visual agents\nin AI systems. The code is available at ttps://github.com/GuangyanS/Sys2-LLaVA.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}