{"id":"2408.16901","title":"Microstructural characterization to reveal evidence of shock deformation\n  in a Campo del Cielo meteorite fragment","authors":"Graeme J. Francolini and Thomas B. Britton","authorsParsed":[["Francolini","Graeme J.",""],["Britton","Thomas B.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 20:58:18 GMT"}],"updateDate":"2024-09-02","timestamp":1724965098000,"abstract":"  The study of meteorites and their microstructures is a topic which spans\nmultiple fields of research, such as meteoritics and materials science. For\nmaterials scientists and engineers, the extreme and unusual conditions which\nthese microstructures form allow for insight into materials which would exist\nat the edge of our thermomechanical processing abilities. One such\nmicrostructure found in low-shock event iron meteorites is Neumann bands. These\nbands are an array of lenticular deformation twins that form throughout the\nFe-Ni matrix with numerous intersections, resulting in many high stress and\nstrain regions within the material's surface. The existence of these regions\nand the shocks that formed them encourage atypical strain accommodating\nmechanisms and structural changes of the material. However, direct\ninvestigation of the deformation twin intersections and the microstructural\nbehaviour in and around these regions has been limited. In this work,\ninvestigation of these regions in a Campo del Cielo meteorite fragment, with\nelectron backscatter diffraction (EBSD) and forescatter electron (FSE) imaging,\nrevealed two primary findings: high-intensity pattern doubling mirrored across\nthe {110} band at twin-twin intersection and microband formation across the\nsample surface, which suggest multilayer twinning and constraint of the crystal\nstructure at points of twin-twin intersection. Microbands were found to form\nalong the {110} plane and in regions near Neumann bands. The simultaneous\nexistence of Neumann bands (microtwins) and microbands is presented here for a\nBCC material, and it is believed the Neumann band and microbands formed during\ndifferent types and/or shock events. The presence of both Neumann bands and\nmicrobands within a BCC iron meteorite is previously unreported and may be\nvaluable in furthering our understanding of shock deformation within iron-based\nmaterials.\n","subjects":["Condensed Matter/Materials Science","Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}