{"id":"2408.00460","title":"Discovery of Dynamical Heterogeneity in a Supercooled Magnetic Monopole\n  Fluid","authors":"Jahnatta Dasini, Chaia Carroll, Chun-Chih Hsu, Hiroto Takahashi, Jack\n  Murphy, Sudarshan Sharma, Catherine Dawson, Fabian Jerzembeck, Stephen J.\n  Blundell, Graeme Luke, J.C. S\\'eamus Davis and Jonathan Ward","authorsParsed":[["Dasini","Jahnatta",""],["Carroll","Chaia",""],["Hsu","Chun-Chih",""],["Takahashi","Hiroto",""],["Murphy","Jack",""],["Sharma","Sudarshan",""],["Dawson","Catherine",""],["Jerzembeck","Fabian",""],["Blundell","Stephen J.",""],["Luke","Graeme",""],["Davis","J. C. Séamus",""],["Ward","Jonathan",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 11:05:18 GMT"}],"updateDate":"2024-08-02","timestamp":1722510318000,"abstract":"  Dynamical heterogeneity in which transitory local fluctuations occur in the\nconformation and dynamics of constituent particles, is essential for evolution\nof supercooled liquids into the glass state. Yet its microscopic spatiotemporal\nphenomenology has remained unobservable in virtually all supercooled glass\nforming liquids. Recent theoretical advances predict that corresponding\ndynamical heterogeneity could also occur in supercooled magnetic monopole\nfluids. Motivated thus, we searched for dynamical heterogeneity when entering\nthe supercooled monopole fluid of Dy2Ti2O7. By measuring microsecond-resolved\nspontaneous magnetization noise M(t,T) at temperatures between 15 mK<T<2500 mK\nwe discover a sharp bifurcation in monopole noise characteristics beginning\nbelow T$\\approx 1500$ mK, with the appearance of powerful monopole current\nbursts. This unique new form of dynamical heterogeneity first emerges upon\nentering the supercooled monopole fluid regime, reaches maximum intensity near\nT$\\approx 500$ mK and then terminates along with coincident loss of ergodicity\nnear T$\\lesssim 250$ mK. Surprisingly, however, low intensity monopole noise\nrepresenting activity at approximately 2% of the Dy sites persists below\nT$\\lesssim 250$ mK, implying a population of dynamical monopoles trapped within\nthe spin-ice ground state as T$\\rightarrow 0$. This overall phenomenology\nsignificantly expands our knowledge of both supercooled monopole fluids and of\nthe ground state of spin-ice. More generally, we demonstrate how comprehensive\ndirect detection of the time sequence, magnitude and statistics of dynamical\nheterogeneity can greatly accelerate fundamental vitrification studies.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}