{"id":"2408.05428","title":"Generalized Encouragement-Based Instrumental Variables for\n  Counterfactual Regression","authors":"Anpeng Wu, Kun Kuang, Ruoxuan Xiong, Xiangwei Chen, Zexu Sun, Fei Wu,\n  Kun Zhang","authorsParsed":[["Wu","Anpeng",""],["Kuang","Kun",""],["Xiong","Ruoxuan",""],["Chen","Xiangwei",""],["Sun","Zexu",""],["Wu","Fei",""],["Zhang","Kun",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 04:21:04 GMT"}],"updateDate":"2024-08-13","timestamp":1723263664000,"abstract":"  In causal inference, encouragement designs (EDs) are widely used to analyze\ncausal effects, when randomized controlled trials (RCTs) are impractical or\ncompliance to treatment cannot be perfectly enforced. Unlike RCTs, which\ndirectly allocate treatments, EDs randomly assign encouragement policies that\npositively motivate individuals to engage in a specific treatment. These random\nencouragements act as instrumental variables (IVs), facilitating the\nidentification of causal effects through leveraging exogenous perturbations in\ndiscrete treatment scenarios. However, real-world applications of encouragement\ndesigns often face challenges such as incomplete randomization, limited\nexperimental data, and significantly fewer encouragements compared to\ntreatments, hindering precise causal effect estimation. To address this, this\npaper introduces novel theories and algorithms for identifying the Conditional\nAverage Treatment Effect (CATE) using variations in encouragement. Further, by\nleveraging both observational and encouragement data, we propose a generalized\nIV estimator, named Encouragement-based Counterfactual Regression (EnCounteR),\nto effectively estimate the causal effects. Extensive experiments on both\nsynthetic and real-world datasets demonstrate the superiority of EnCounteR over\nexisting methods.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Methodology","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}