{"id":"2408.12064","title":"A Practical Introduction to Benchmarking and Characterization of Quantum\n  Computers","authors":"Akel Hashim, Long B. Nguyen, Noah Goss, Brian Marinelli, Ravi K. Naik,\n  Trevor Chistolini, Jordan Hines, J. P. Marceaux, Yosep Kim, Pranav Gokhale,\n  Teague Tomesh, Senrui Chen, Liang Jiang, Samuele Ferracin, Kenneth Rudinger,\n  Timothy Proctor, Kevin C. Young, Robin Blume-Kohout, Irfan Siddiqi","authorsParsed":[["Hashim","Akel",""],["Nguyen","Long B.",""],["Goss","Noah",""],["Marinelli","Brian",""],["Naik","Ravi K.",""],["Chistolini","Trevor",""],["Hines","Jordan",""],["Marceaux","J. P.",""],["Kim","Yosep",""],["Gokhale","Pranav",""],["Tomesh","Teague",""],["Chen","Senrui",""],["Jiang","Liang",""],["Ferracin","Samuele",""],["Rudinger","Kenneth",""],["Proctor","Timothy",""],["Young","Kevin C.",""],["Blume-Kohout","Robin",""],["Siddiqi","Irfan",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 02:00:49 GMT"}],"updateDate":"2024-08-23","timestamp":1724292049000,"abstract":"  Rapid progress in quantum technology has transformed quantum computing and\nquantum information science from theoretical possibilities into tangible\nengineering challenges. Breakthroughs in quantum algorithms, quantum\nsimulations, and quantum error correction are bringing useful quantum\ncomputation closer to fruition. These remarkable achievements have been\nfacilitated by advances in quantum characterization, verification, and\nvalidation (QCVV). QCVV methods and protocols enable scientists and engineers\nto scrutinize, understand, and enhance the performance of quantum\ninformation-processing devices. In this Tutorial, we review the fundamental\nprinciples underpinning QCVV, and introduce a diverse array of QCVV tools used\nby quantum researchers. We define and explain QCVV's core models and concepts\n-- quantum states, measurements, and processes -- and illustrate how these\nbuilding blocks are leveraged to examine a target system or operation. We\nsurvey and introduce protocols ranging from simple qubit characterization to\nadvanced benchmarking methods. Along the way, we provide illustrated examples\nand detailed descriptions of the protocols, highlight the advantages and\ndisadvantages of each, and discuss their potential scalability to future\nlarge-scale quantum computers. This Tutorial serves as a guidebook for\nresearchers unfamiliar with the benchmarking and characterization of quantum\ncomputers, and also as a detailed reference for experienced practitioners.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}