{"id":"2408.13398","title":"Buto Facula, Ganymede: Palimpsest Exemplar","authors":"Jeffrey M. Moore, Oliver L. White, Donald G. Korycansky, Paul M.\n  Schenk, Andrew J. Dombard, Martina L. Caussi","authorsParsed":[["Moore","Jeffrey M.",""],["White","Oliver L.",""],["Korycansky","Donald G.",""],["Schenk","Paul M.",""],["Dombard","Andrew J.",""],["Caussi","Martina L.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 22:46:13 GMT"}],"updateDate":"2024-08-27","timestamp":1724453173000,"abstract":"  Nowhere in the solar system are impact morphologies observed in greater\nvariety than on the icy Galilean satellites. This is likely a consequence of\nthe structural and thermal state of the crust at the time of impact, and\nperhaps impact velocity. Palimpsest-type impact features show smooth enclosed\ncentral plains surrounded by undulating plains, within which are distributed\nconcentric arcuate ridges, and no recognizable rim. Buto Facula on Ganymede is\nthe best resolved of any palimpsest, having mostly been imaged at 190 m/pixel\nand optimum lighting, allowing insight into the circumstances that form this\ntype of impact feature. Part of an impact crater on the eastern edge of Buto\nFacula has been buried by undulating plains material, suggesting that at the\ntime of their emplacement the undulating plains behaved as a low-viscosity flow\nadvancing across the landscape around the impact zone, encroaching on landforms\nthat it encountered. We evaluated hypotheses for the formation of undulating\nplains using impact and ejecta modeling. We do not attribute the source of\nButo's undulating plains to \"dry\" impact ejecta due to the existence of impact\nfeatures larger than Buto that are not surrounded by undulating plains\ndeposits. We performed iSALE impact simulations incorporating a subsurface\nliquid layer (or low strength layer) at various depths. An impact into a\nsurface with a pre-existing, 5 km-deep, 5 km-thick fluid layer results in\nexcavation of fluid material from that layer, producing a nearly flat final\nsurface profile that is consistent with Buto's flat profile and the\ndistribution of its undulating plains material. A liquid layer at a depth of\n20-40 km results in impact feature profiles that resemble classic impact\ncraters. We offer tests of this shallow subsurface liquid layer hypothesis for\npalimpsest formation that could potentially be performed by JUICE and Europa\nClipper.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"jWTLsbEKzc7oDGZ_YjCR4JY_PISq2dYNbAQNUGzuLeQ","pdfSize":"8326189"}
