{"id":"2408.04614","title":"Better Alignment with Instruction Back-and-Forth Translation","authors":"Thao Nguyen, Jeffrey Li, Sewoong Oh, Ludwig Schmidt, Jason Weston,\n  Luke Zettlemoyer, Xian Li","authorsParsed":[["Nguyen","Thao",""],["Li","Jeffrey",""],["Oh","Sewoong",""],["Schmidt","Ludwig",""],["Weston","Jason",""],["Zettlemoyer","Luke",""],["Li","Xian",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 17:42:32 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 18:00:57 GMT"}],"updateDate":"2024-08-15","timestamp":1723138952000,"abstract":"  We propose a new method, instruction back-and-forth translation, to construct\nhigh-quality synthetic data grounded in world knowledge for aligning large\nlanguage models (LLMs). Given documents from a web corpus, we generate and\ncurate synthetic instructions using the backtranslation approach proposed by Li\net al.(2023a), and rewrite the responses to improve their quality further based\non the initial documents. Fine-tuning with the resulting (backtranslated\ninstruction, rewritten response) pairs yields higher win rates on AlpacaEval\nthan using other common instruction datasets such as Humpback, ShareGPT, Open\nOrca, Alpaca-GPT4 and Self-instruct. We also demonstrate that rewriting the\nresponses with an LLM outperforms direct distillation, and the two generated\ntext distributions exhibit significant distinction in embedding space. Further\nanalysis shows that our backtranslated instructions are of higher quality than\nother sources of synthetic instructions, while our responses are more diverse\nand complex than those obtained from distillation. Overall we find that\ninstruction back-and-forth translation combines the best of both worlds --\nmaking use of the information diversity and quantity found on the web, while\nensuring the quality of the responses which is necessary for effective\nalignment.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"C4BS1-LOQuWSI2B8RewmJJ7uuQ5F6Yhz54UWI6-Z5y8","pdfSize":"981736"}
