{"id":"2408.10555","title":"GACL: Graph Attention Collaborative Learning for Temporal QoS Prediction","authors":"Shengxiang Hu, Guobing Zou, Bofeng Zhang, Shaogang Wu, Shiyi Lin,\n  Yanglan Gan, Yixin Chen","authorsParsed":[["Hu","Shengxiang",""],["Zou","Guobing",""],["Zhang","Bofeng",""],["Wu","Shaogang",""],["Lin","Shiyi",""],["Gan","Yanglan",""],["Chen","Yixin",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 05:38:47 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 05:52:05 GMT"}],"updateDate":"2024-09-13","timestamp":1724132327000,"abstract":"  Accurate prediction of temporal QoS is crucial for maintaining service\nreliability and enhancing user satisfaction in dynamic service-oriented\nenvironments. However, current methods often neglect high-order latent\ncollaborative relationships and fail to dynamically adjust feature learning for\nspecific user-service invocations, which are critical for precise feature\nextraction within each time slice. Moreover, the prevalent use of RNNs for\nmodeling temporal feature evolution patterns is constrained by their inherent\ndifficulty in managing long-range dependencies, thereby limiting the detection\nof long-term QoS trends across multiple time slices. These shortcomings\ndramatically degrade the performance of temporal QoS prediction. To address the\ntwo issues, we propose a novel Graph Attention Collaborative Learning (GACL)\nframework for temporal QoS prediction. Building on a dynamic user-service\ninvocation graph to comprehensively model historical interactions, it designs a\ntarget-prompt graph attention network to extract deep latent features of users\nand services at each time slice, considering implicit target-neighboring\ncollaborative relationships and historical QoS values. Additionally, a\nmulti-layer Transformer encoder is introduced to uncover temporal feature\nevolution patterns, enhancing temporal QoS prediction. Extensive experiments on\nthe WS-DREAM dataset demonstrate that GACL significantly outperforms\nstate-of-the-art methods for temporal QoS prediction across multiple evaluation\nmetrics, achieving the improvements of up to 38.80%.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}