{"id":"2408.08694","title":"Quantifying the Effectiveness of Student Organization Activities using\n  Natural Language Processing","authors":"Lyberius Ennio F. Taruc, and Arvin R. De La Cruz","authorsParsed":[["Taruc","Lyberius Ennio F.",""],["De La Cruz","Arvin R.",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 12:16:59 GMT"}],"updateDate":"2024-08-19","timestamp":1723810619000,"abstract":"  Student extracurricular activities play an important role in enriching the\nstudents' educational experiences. With the increasing popularity of Machine\nLearning and Natural Language Processing, it becomes a logical step that\nincorporating ML-NLP in improving extracurricular activities is a potential\nfocus of study in Artificial Intelligence (AI). This research study aims to\ndevelop a machine learning workflow that will quantify the effectiveness of\nstudent-organized activities based on student emotional responses using\nsentiment analysis. The study uses the Bidirectional Encoder Representations\nfrom Transformers (BERT) Large Language Model (LLM) called via the\npysentimiento toolkit, as a Transformer pipeline in Hugging Face. A sample data\nset from Organization C, a Recognized Student Organization (RSO) of a higher\neducational institute in the Philippines, College X, was used to develop the\nworkflow. The workflow consisted of data preprocessing, key feature selection,\nLLM feature processing, and score aggregation, resulting in an Event Score for\neach data set. The results show that the BERT LLM can also be used effectively\nin analyzing sentiment beyond product reviews and post comments. For the\nstudent affairs offices of educational institutions, this study can provide a\npractical example of how NLP can be applied to real-world scenarios, showcasing\nthe potential impact of data-driven decision making.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"blgpA8ZwvtWKxWsGMtYJyu_sTQHTHEnE3mGGkdetXc0","pdfSize":"547960"}
