{"id":"2408.10032","title":"Tunable interfacial Rashba spin-orbit coupling in asymmetric\n  Al$_x$In$_{1-x}$Sb/InSb/CdTe quantum well heterostructures","authors":"Hanzhi Ruan and Zhenghang Zhi and Yuyang Wu and Jiuming Liu and Puyang\n  Huang and Shan Yao and Xinqi Liu and Chenjia Tang and Qi Yao and Lu Sun and\n  Yifan Zhang and Yujie Xiao and Renchao Che and Xufeng Kou","authorsParsed":[["Ruan","Hanzhi",""],["Zhi","Zhenghang",""],["Wu","Yuyang",""],["Liu","Jiuming",""],["Huang","Puyang",""],["Yao","Shan",""],["Liu","Xinqi",""],["Tang","Chenjia",""],["Yao","Qi",""],["Sun","Lu",""],["Zhang","Yifan",""],["Xiao","Yujie",""],["Che","Renchao",""],["Kou","Xufeng",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 14:25:01 GMT"}],"updateDate":"2024-08-20","timestamp":1724077501000,"abstract":"  The manipulation of Rashba-type spin-orbit coupling (SOC) in molecular beam\nepitaxy-grown Al$_x$In$_{1-x}$Sb/InSb/CdTe quantum well heterostructures is\nreported. The effective band bending provides robust two-dimensional quantum\nconfinement, while the unidirectional built-in electric field from the\nasymmetric hetero-interfaces results in pronounced Rashba SOC strength. By\ntuning the Al concentration in the top Al$_x$In$_{1-x}$Sb barrier layer, the\noptimal structure with $x = 0.15$ shows the largest Rashba coefficient of 0.23\neV-Angstrom. and the highest low-temperature electron mobility of 4400\ncm$^2$/Vs . Quantitative investigations of the weak anti-localization effect\nfurther confirm the dominant D'yakonov-Perel (DP) spin relaxation mechanism\nduring charge-to-spin conversion. These findings highlight the significance of\nquantum well engineering in shaping magneto-resistance responses, and narrow\nbandgap semiconductor-based heterostructures may offer a reliable platform for\nenergy-efficient spintronic applications.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}