{"id":"2408.13667","title":"Outlier Detection Bias Busted: Understanding Sources of Algorithmic Bias\n  through Data-centric Factors","authors":"Xueying Ding, Rui Xi, Leman Akoglu","authorsParsed":[["Ding","Xueying",""],["Xi","Rui",""],["Akoglu","Leman",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 20:35:32 GMT"}],"updateDate":"2024-08-28","timestamp":1724531732000,"abstract":"  The astonishing successes of ML have raised growing concern for the fairness\nof modern methods when deployed in real world settings. However, studies on\nfairness have mostly focused on supervised ML, while unsupervised outlier\ndetection (OD), with numerous applications in finance, security, etc., have\nattracted little attention. While a few studies proposed fairness-enhanced OD\nalgorithms, they remain agnostic to the underlying driving mechanisms or\nsources of unfairness. Even within the supervised ML literature, there exists\ndebate on whether unfairness stems solely from algorithmic biases (i.e. design\nchoices) or from the biases encoded in the data on which they are trained. To\nclose this gap, this work aims to shed light on the possible sources of\nunfairness in OD by auditing detection models under different data-centric\nfactors. By injecting various known biases into the input data -- as pertain to\nsample size disparity, under-representation, feature measurement noise, and\ngroup membership obfuscation -- we find that the OD algorithms under the study\nall exhibit fairness pitfalls, although differing in which types of data bias\nthey are more susceptible to. Most notable of our study is to demonstrate that\nOD algorithm bias is not merely a data bias problem. A key realization is that\nthe data properties that emerge from bias injection could as well be organic --\nas pertain to natural group differences w.r.t. sparsity, base rate, variance,\nand multi-modality. Either natural or biased, such data properties can give\nrise to unfairness as they interact with certain algorithmic design choices.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JXXs4ukk9EIUFz-G91iEKtGkj6HJVt8MKgLbfrpQV1o","pdfSize":"19103803"}
