{"id":"2408.06748","title":"Buoyancy induced motion of a Newtonian drop in elastoviscoplastic\n  materials","authors":"Giancarlo Esposito, Yannis Dimakopoulos, John Tsamopoulos","authorsParsed":[["Esposito","Giancarlo",""],["Dimakopoulos","Yannis",""],["Tsamopoulos","John",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 09:13:10 GMT"}],"updateDate":"2024-08-14","timestamp":1723540390000,"abstract":"  We investigate theoretically the buoyancy-driven motion of a viscous drop in\na yield-stress material, incorporating elastic effects represented by the\nSaramito-Herschel-Bulkley constitutive equation. We solve the governing\nequations using an open-source finite volume solver and utilizing the volume of\nfluid technique to accurately capture the interface between the two fluids. To\nvalidate our numerical approach, we compare our results with data from previous\nexperimental and numerical studies. We find quantitative agreement in terms of\nterminal velocities and drop shapes, affirming the accuracy of our model and\nits numerical solution. Notably, we observe that incorporating elastic effects\ninto the modelling of the continuous phase is essential for predicting\nphenomena reported in experiments, such as the inversion of the flow field\nbehind the sedimenting drop (i.e., the negative wake) or the formation of a\nteardrop shape. Due to the elastoviscoplastic nature of the continuous phase,\nwe observe that small drops remain entrapped because the buoyancy force is\ninsufficient to fluidize the surrounding material. We investigate entrapment\nconditions using two different protocols, which yield different outcomes due to\nthe interplay between capillarity and elasto-plasticity. Finally, we conduct an\nextensive parametric analysis to evaluate the impact of rheological parameters\n(yield stress, elastic modulus, and interfacial tension) on the dynamics of\nsedimentation.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}