{"id":"2408.15890","title":"Disentangled Diffusion Autoencoder for Harmonization of Multi-site\n  Neuroimaging Data","authors":"Ayodeji Ijishakin, Ana Lawry Aguila, Elizabeth Levitis, Ahmed\n  Abdulaal, Andre Altmann, and James Cole","authorsParsed":[["Ijishakin","Ayodeji",""],["Aguila","Ana Lawry",""],["Levitis","Elizabeth",""],["Abdulaal","Ahmed",""],["Altmann","Andre",""],["Cole","James",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 16:03:18 GMT"}],"updateDate":"2024-08-29","timestamp":1724860998000,"abstract":"  Combining neuroimaging datasets from multiple sites and scanners can help\nincrease statistical power and thus provide greater insight into subtle\nneuroanatomical effects. However, site-specific effects pose a challenge by\npotentially obscuring the biological signal and introducing unwanted variance.\nExisting harmonization techniques, which use statistical models to remove such\neffects, have been shown to incompletely remove site effects while also failing\nto preserve biological variability. More recently, generative models using GANs\nor autoencoder-based approaches, have been proposed for site adjustment.\nHowever, such methods are known for instability during training or blurry image\ngeneration. In recent years, diffusion models have become increasingly popular\nfor their ability to generate high-quality synthetic images. In this work, we\nintroduce the disentangled diffusion autoencoder (DDAE), a novel diffusion\nmodel designed for controlling specific aspects of an image. We apply the DDAE\nto the task of harmonizing MR images by generating high-quality site-adjusted\nimages that preserve biological variability. We use data from 7 different sites\nand demonstrate the DDAE's superiority in generating high-resolution,\nharmonized 2D MR images over previous approaches. As far as we are aware, this\nwork marks the first diffusion-based model for site adjustment of neuroimaging\ndata.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}