{"id":"2408.04552","title":"Semiparametric Estimation of Individual Coefficients in a Dyadic Link\n  Formation Model Lacking Observable Characteristics","authors":"L. Sanna Stephan","authorsParsed":[["Stephan","L. Sanna",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 16:05:45 GMT"}],"updateDate":"2024-08-09","timestamp":1723133145000,"abstract":"  Dyadic network formation models have wide applicability in economic research,\nyet are difficult to estimate in the presence of individual specific effects\nand in the absence of distributional assumptions regarding the model noise\ncomponent. The availability of (continuously distributed) individual or link\ncharacteristics generally facilitates estimation. Yet, while data on social\nnetworks has recently become more abundant, the characteristics of the entities\ninvolved in the link may not be measured. Adapting the procedure of \\citet{KS},\nI propose to use network data alone in a semiparametric estimation of the\nindividual fixed effect coefficients, which carry the interpretation of the\nindividual relative popularity. This entails the possibility to anticipate how\na new-coming individual will connect in a pre-existing group. The estimator,\nneeded for its fast convergence, fails to implement the monotonicity assumption\nregarding the model noise component, thereby potentially reversing the order if\nthe fixed effect coefficients. This and other numerical issues can be\nconveniently tackled by my novel, data-driven way of normalising the fixed\neffects, which proves to outperform a conventional standardisation in many\ncases. I demonstrate that the normalised coefficients converge both at the same\nrate and to the same limiting distribution as if the true error distribution\nwas known. The cost of semiparametric estimation is thus purely computational,\nwhile the potential benefits are large whenever the errors have a strongly\nconvex or strongly concave distribution.\n","subjects":["Economics/Econometrics"],"license":"http://creativecommons.org/licenses/by/4.0/"}