{"id":"2408.10493","title":"Clustering by Mining Density Distributions and Splitting Manifold\n  Structure","authors":"Zhichang Xu, Zhiguo Long, Hua Meng","authorsParsed":[["Xu","Zhichang",""],["Long","Zhiguo",""],["Meng","Hua",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 02:22:59 GMT"}],"updateDate":"2024-08-21","timestamp":1724120579000,"abstract":"  Spectral clustering requires the time-consuming decomposition of the\nLaplacian matrix of the similarity graph, thus limiting its applicability to\nlarge datasets. To improve the efficiency of spectral clustering, a top-down\napproach was recently proposed, which first divides the data into several\nmicro-clusters (granular-balls), then splits these micro-clusters when they are\nnot \"compact'', and finally uses these micro-clusters as nodes to construct a\nsimilarity graph for more efficient spectral clustering. However, this top-down\napproach is challenging to adapt to unevenly distributed or structurally\ncomplex data. This is because constructing micro-clusters as a rough ball\nstruggles to capture the shape and structure of data in a local range, and the\nsimplistic splitting rule that solely targets ``compactness'' is susceptible to\nnoise and variations in data density and leads to micro-clusters with varying\nshapes, making it challenging to accurately measure the similarity between\nthem. To resolve these issues, this paper first proposes to start from local\nstructures to obtain micro-clusters, such that the complex structural\ninformation inside local neighborhoods is well captured by them. Moreover, by\nnoting that Euclidean distance is more suitable for convex sets, this paper\nfurther proposes a data splitting rule that couples local density and data\nmanifold structures, so that the similarities of the obtained micro-clusters\ncan be easily characterized. A novel similarity measure between micro-clusters\nis then proposed for the final spectral clustering. A series of experiments\nbased on synthetic and real-world datasets demonstrate that the proposed method\nhas better adaptability to structurally complex data than granular-ball based\nmethods.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}