{"id":"2408.02084","title":"SLAMS-Propelled Electron Acceleration at High-Mach Number Astrophysical\n  Shocks","authors":"Vladimir Zekovi\\'c, Anatoly Spitkovsky, Zachary Hemler","authorsParsed":[["Zeković","Vladimir",""],["Spitkovsky","Anatoly",""],["Hemler","Zachary",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 16:46:06 GMT"}],"updateDate":"2024-08-06","timestamp":1722789966000,"abstract":"  Short Large Amplitude Magnetic Structures (SLAMS) are frequently detected\nduring spacecraft crossings over the Earth bow shock. We investigate the\nexistence of such structures at astrophysical shocks, where they could result\nfrom the steepening of cosmic-ray (CR) driven waves. Using kinetic\nparticle-in-cell simulations, we study the growth of SLAMS and the appearance\nof associated transient shocks in the upstream region of quasi-parallel,\nnon-relativistic, high-Mach number collisionless shocks. We find that\nhigh-energy CRs significantly enhance the transverse magnetic field within\nSLAMS, producing highly inclined field lines. As SLAMS are advected towards the\nshock, these fields lines form an intermittent superluminal configuration which\ntraps magnetized electrons at fast shocks. Due to their oscillatory nature,\nSLAMS are periodically separated by subluminal gaps with lower transverse\nmagnetic field strength. In these regions, electrons diffuse and accelerate by\nbouncing between the shock and the approaching SLAMS region through a mechanism\nthat we call quasi-periodic shock acceleration (QSA). We analytically derive\nthe distribution of electrons accelerated via QSA, $f(p)\\sim p^{[-4.7,-5.7]}$,\nwhich agrees well with the simulation spectra. We find that the electron power\nlaw remains steep until the end of our longest runs, providing a possible\nexplanation for the steep electron spectra observed at least up to GeV energies\nin young and fast supernova remnants.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/Plasma Physics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}