{"id":"2408.00916","title":"A reference frame-based microgrid primary control for ensuring global\n  convergence to a periodic orbit","authors":"Xinyuan Jiang and Constantino M. Lagoa and Daning Huang and Yan Li","authorsParsed":[["Jiang","Xinyuan",""],["Lagoa","Constantino M.",""],["Huang","Daning",""],["Li","Yan",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 21:15:24 GMT"}],"updateDate":"2024-08-05","timestamp":1722546924000,"abstract":"  Electric power systems with growing penetration of renewable generation face\nproblems of frequency oscillation and increased uncertainty as the operating\npoint may veer close to instability. Traditionally the stability of these\nsystems is studied either in terms of local stability or as an angle\nsynchronization problem under the simplifying assumption that decouples the\namplitude along with all dissipations. Without the simplifying assumption,\nhowever, the steady state being studied is basically a limit cycle with the\nconvergence of its orbit in question. In this paper we present an analysis of\nthe orbital stability of a microgrid integrating the proposed type of\ndistributed generation controller, whose internal reference voltage arises from\nthe rotation of the reference frame much like a rotating machine. We utilize\nthe shifted passivity framework to prove that, with sufficient dissipation,\nsuch system is globally convergent to a nontrivial orbit. This is the first\nglobal stability result for the limit cycle of such system in the full state\nspace, which provides new insight into the synchronization mechanism as well as\nhow dissipation plays a role in the orbital stability. The proposed controller\nis verified with a test microgrid, demonstrating its stability and transient\nsmoothness compared to the standard droop control.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"CQo0u8jaBW9mxzTILBOPe7og9-5zbsMFleXnVLXVBQY","pdfSize":"1212530","txDigest":"2wK95o4a7NWuVBsPfyZ8msGNrUj4RKSD9uZC3vv2Q3La","endEpoch":"1","status":"CERTIFIED"}
