{"id":"2408.15623","title":"Correlation-Adjusted Simultaneous Testing for Ultra High-dimensional\n  Grouped Data","authors":"Iris Ivy Gauran, Patrick Wincy Reyes, Erniel Barrios, Hernando Ombao","authorsParsed":[["Gauran","Iris Ivy",""],["Reyes","Patrick Wincy",""],["Barrios","Erniel",""],["Ombao","Hernando",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 08:24:27 GMT"}],"updateDate":"2024-08-29","timestamp":1724833467000,"abstract":"  Epigenetics plays a crucial role in understanding the underlying molecular\nprocesses of several types of cancer as well as the determination of innovative\ntherapeutic tools. To investigate the complex interplay between genetics and\nenvironment, we develop a novel procedure to identify differentially methylated\nprobes (DMPs) among cases and controls. Statistically, this translates to an\nultra high-dimensional testing problem with sparse signals and an inherent\ngrouping structure. When the total number of variables being tested is massive\nand typically exhibits some degree of dependence, existing group-wise multiple\ncomparisons adjustment methods lead to inflated false discoveries. We propose a\nclass of Correlation-Adjusted Simultaneous Testing (CAST) procedures\nincorporating the general dependence among probes within and between genes to\ncontrol the false discovery rate (FDR). Simulations demonstrate that CASTs have\nsuperior empirical power while maintaining the FDR compared to the benchmark\ngroup-wise. Moreover, while the benchmark fails to control FDR for small-sized\ngrouped correlated data, CAST exhibits robustness in controlling FDR across\nvarying group sizes. In bladder cancer data, the proposed CAST method confirms\nsome existing differentially methylated probes implicated with the disease\n(Langevin, et. al., 2014). However, CAST was able to detect novel DMPs that the\nprevious study (Langevin, et. al., 2014) failed to identify. The CAST method\ncan accurately identify significant potential biomarkers and facilitates\ninformed decision-making aligned with precision medicine in the context of\ncomplex data analysis.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}