{"id":"2408.11826","title":"Generative Organizational Behavior Simulation using Large Language Model\n  based Autonomous Agents: A Holacracy Perspective","authors":"Chen Zhu, Yihang Cheng, Jingshuai Zhang, Yusheng Qiu, Sitao Xia,\n  Hengshu Zhu","authorsParsed":[["Zhu","Chen",""],["Cheng","Yihang",""],["Zhang","Jingshuai",""],["Qiu","Yusheng",""],["Xia","Sitao",""],["Zhu","Hengshu",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 13:39:03 GMT"}],"updateDate":"2024-08-23","timestamp":1722865143000,"abstract":"  In this paper, we present the technical details and periodic findings of our\nproject, CareerAgent, which aims to build a generative simulation framework for\na Holacracy organization using Large Language Model-based Autonomous Agents.\nSpecifically, the simulation framework includes three phases: construction,\nexecution, and evaluation, and it incorporates basic characteristics of\nindividuals, organizations, tasks, and meetings. Through our simulation, we\nobtained several interesting findings. At the organizational level, an increase\nin the average values of management competence and functional competence can\nreduce overall members' stress levels, but it negatively impacts deeper\norganizational performance measures such as average task completion. At the\nindividual level, both competences can improve members' work performance. From\nthe analysis of social networks, we found that highly competent members\nselectively participate in certain tasks and take on more responsibilities.\nOver time, small sub-communities form around these highly competent members\nwithin the holacracy. These findings contribute theoretically to the study of\norganizational science and provide practical insights for managers to\nunderstand the organization dynamics.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"AKN4NJWZ7E7FqjrOJqrFiUpReqlNni20iSkfqizlfrU","pdfSize":"713788"}
