{"id":"2408.08275","title":"Photon Frequency Conversion in High-$Q$ Superconducting Resonators:\n  Axion Electrodynamics, QED & Nonlinear Meissner Radiation","authors":"Hikaru Ueki and J. A. Sauls","authorsParsed":[["Ueki","Hikaru",""],["Sauls","J. A.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 17:20:25 GMT"}],"updateDate":"2024-08-16","timestamp":1723742425000,"abstract":"  High-Q superconducting resonators have been proposed and developed as\ndetectors of light-by-light scattering mediated by the hypothesized axion or\nvirtual electron-positron pairs in quantum electrodynamics - the\nEuler-Heisenberg (EH) interaction. Photon frequency and mode conversion is\ncentral to the scheme for detecting such rare events. Superconducting\nresonators are nonlinear devices. The Meissner screening currents that confine\nthe electromagnetic fields to the vacuum region of a superconducting RF cavity\nare nonlinear functions of the EM field at the vacuum-superconducting\ninterface, and as a result can generate source currents and frequency\nconversion of microwave photons in the cavity. In this report we consider\nphoton frequency and mode conversion in superconducting resonators with high\nquality factors from Meissner currents in single and dual cavity setups\nproposed for axion and QED searches based on light-by-light scattering. In a\nsingle cavity with two pump modes photon frequency conversion by the Meissner\nscreening current dominates photon generation by the EH interaction for\ncavities with $Q \\lesssim 10^{12}$. The Meissner currents also generate\nbackground photons that limits the operation of the resonator for axion\ndetection in three-mode, single cavity setups. We also consider the leakage of\nphotons from pump modes into the signal mode for both axion and EH mediated\nlight-by-light scattering. Photon frequency conversion by the EH interaction\ncan compete with Meissner and leakage radiation in \\emph{ultra-high-Q} cavities\nthat are beyond current state of the art. Meissner radiation and leakage\nbackgrounds can be suppressed in dual cavity setups with appropriate choices\nfor pump and spectator modes, as well as the single-cavity setup proposed for\nheterodyne detection of galactic axion dark matter.\n","subjects":["Physics/High Energy Physics - Phenomenology","Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}