{"id":"2408.12093","title":"LLM-enhanced Scene Graph Learning for Household Rearrangement","authors":"Wenhao Li, Zhiyuan Yu, Qijin She, Zhinan Yu, Yuqing Lan, Chenyang Zhu,\n  Ruizhen Hu and Kai Xu","authorsParsed":[["Li","Wenhao",""],["Yu","Zhiyuan",""],["She","Qijin",""],["Yu","Zhinan",""],["Lan","Yuqing",""],["Zhu","Chenyang",""],["Hu","Ruizhen",""],["Xu","Kai",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 03:03:04 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 07:18:00 GMT"}],"updateDate":"2024-09-13","timestamp":1724295784000,"abstract":"  The household rearrangement task involves spotting misplaced objects in a\nscene and accommodate them with proper places. It depends both on common-sense\nknowledge on the objective side and human user preference on the subjective\nside. In achieving such task, we propose to mine object functionality with user\npreference alignment directly from the scene itself, without relying on human\nintervention. To do so, we work with scene graph representation and propose\nLLM-enhanced scene graph learning which transforms the input scene graph into\nan affordance-enhanced graph (AEG) with information-enhanced nodes and newly\ndiscovered edges (relations). In AEG, the nodes corresponding to the receptacle\nobjects are augmented with context-induced affordance which encodes what kind\nof carriable objects can be placed on it. New edges are discovered with newly\ndiscovered non-local relations. With AEG, we perform task planning for scene\nrearrangement by detecting misplaced carriables and determining a proper\nplacement for each of them. We test our method by implementing a tiding robot\nin simulator and perform evaluation on a new benchmark we build. Extensive\nevaluations demonstrate that our method achieves state-of-the-art performance\non misplacement detection and the following rearrangement planning.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}