{"id":"2408.11945","title":"Properties of outer solar system pebbles during planetesimal formation\n  from meteor observations","authors":"Peter Jenniskens, Paul R. Estrada, Stuart Pilorz, Peter S. Gural, Dave\n  Samuels, Steve Rau, Timothy M. C. Abbott, Jim Albers, Scott Austin, Dan\n  Avner, Jack W. Baggaley, Tim Beck, Solvay Blomquist, Mustafa Boyukata, Martin\n  Breukers, Walt Cooney, Tim Cooper, Marcelo De Cicco, Hadrien Devillepoix,\n  Eric Egland, Elize Fahl, Megan Gialluca, Bryant Grigsby, Toni Hanke, Barbara\n  Harris, Steve Heathcote, Samantha Hemmelgarn, Andy Howell, Emmanuel Jehin,\n  Carl Johannink, Luke Juneau, Erika Kisvarsanyi, Philip Mey, Nick Moskovitz,\n  Mohammad Odeh, Brian Rachford, David Rollinson, James M. Scott, Martin C.\n  Towner, Ozan Unsalan, Rynault van Wyk, Jeff Wood, James D. Wray, C. Pavao,\n  and Dante S. Lauretta","authorsParsed":[["Jenniskens","Peter",""],["Estrada","Paul R.",""],["Pilorz","Stuart",""],["Gural","Peter S.",""],["Samuels","Dave",""],["Rau","Steve",""],["Abbott","Timothy M. C.",""],["Albers","Jim",""],["Austin","Scott",""],["Avner","Dan",""],["Baggaley","Jack W.",""],["Beck","Tim",""],["Blomquist","Solvay",""],["Boyukata","Mustafa",""],["Breukers","Martin",""],["Cooney","Walt",""],["Cooper","Tim",""],["De Cicco","Marcelo",""],["Devillepoix","Hadrien",""],["Egland","Eric",""],["Fahl","Elize",""],["Gialluca","Megan",""],["Grigsby","Bryant",""],["Hanke","Toni",""],["Harris","Barbara",""],["Heathcote","Steve",""],["Hemmelgarn","Samantha",""],["Howell","Andy",""],["Jehin","Emmanuel",""],["Johannink","Carl",""],["Juneau","Luke",""],["Kisvarsanyi","Erika",""],["Mey","Philip",""],["Moskovitz","Nick",""],["Odeh","Mohammad",""],["Rachford","Brian",""],["Rollinson","David",""],["Scott","James M.",""],["Towner","Martin C.",""],["Unsalan","Ozan",""],["van Wyk","Rynault",""],["Wood","Jeff",""],["Wray","James D.",""],["Pavao","C.",""],["Lauretta","Dante S.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 18:58:08 GMT"}],"updateDate":"2024-08-23","timestamp":1724266688000,"abstract":"  In the late stages of accretion leading up to the formation of planetesimals,\nparticles grew to pebbles the size of 1-mm to tens of cm. That is the same size\nrange that dominates the present-day comet mass loss. Meteoroids that size\ncause visible meteors on Earth. Here, we hypothesize that the size distribution\nand the physical and chemical properties of young meteoroid streams still\ncontain information about the conditions in the solar nebula during these late\nstages of accretion. From observations of 47 young meteor showers, we find that\nfreshly ejected meteoroids from long-period comets tend to have low bulk\ndensity and are distributed with equal surface area per log-mass interval\n(magnitude distribution index chi ~ 1.85), suggesting gentle accretion\nconditions. Jupiter-family comets, on the other hand, mostly produce meteoroids\ntwice as dense and distributed with a steeper chi ~ 2.15 or even chi ~ 2.5,\nwhich implies that those pebbles grew from particles fragmenting in a\ncollisional cascade or by catastrophic collisions, respectively. Both comet\npopulations contain an admixture of compact materials that are sometimes\nsodium-poor, but Jupiter-family comets show a higher percentage (~8% on\naverage) than long-period comet showers (~4%), and a wider range. While there\nare exceptions in both groups, the implication is that most long-period comets\nformed under gentle particle growth conditions, possibly near the 30 AU edge of\nthe Trans Neptunian Disk, while most Jupiter family comets formed closer to the\nSun where pebbles reached or passed the fragmentation barrier. This is possible\nif the Scattered Disk represents all objects scattered by Neptune during its\nmigration, while the present-day outer Oort cloud formed only during and after\nthe Sun had moved away from sibling stars.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"A9jZTX3mE2H0mqYYtX8Jgt2W7UnvT2OIhu_FaHdvwBU","pdfSize":"6452720"}
