{"id":"2408.05596","title":"Semantic Communications with Explicit Semantic Bases: Model,\n  Architecture, and Open Problems","authors":"Fengyu Wang, Yuan Zheng, Wenjun Xu, Junxiao Liang, and Ping Zhang","authorsParsed":[["Wang","Fengyu",""],["Zheng","Yuan",""],["Xu","Wenjun",""],["Liang","Junxiao",""],["Zhang","Ping",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 16:56:49 GMT"}],"updateDate":"2024-08-13","timestamp":1723309009000,"abstract":"  The increasing demands for massive data transmission pose great challenges to\ncommunication systems. Compared to traditional communication systems that focus\non the accurate reconstruction of bit sequences, semantic communications\n(SemComs), which aim to successfully deliver information connotation, have been\nregarded as the key technology for next-generation communication systems. Most\ncurrent SemCom systems focus on an E2E trained neural network (NN) for semantic\nextraction and interpretation, regarding the parameters of the NN as the\nimplicit synchronized background knowledge. However, the implicit knowledge\nbase (KB)-based architectures lack interpretability and flexibility, which\nlimits the performance of SemComs. In this article, we propose a SemCom\narchitecture that employs explicit semantic bases (Sebs), which serve as the\nbasic units to describe semantic information. In specific, the mathematical\nmodel of Sebs is first proposed to build explicit KB. Then, the Seb-based\nSemCom architecture is proposed, consisting of a communication mode and a KB\nupdate mode to enable the evolution of communication systems. Specifically, the\nmodules of Sem-codec and channel codec are dedicatedly designed, with the\nassistance of explicit KB for efficient and robust transmission of semantics.\nMoreover, unequal error protection is strategically implemented, considering\nthe intent of communications and the importance of Sebs, thereby ensuring\nreliability of critical semantics. To assess the effectiveness of the proposed\nSeb-based SemCom architecture, a case study focusing on an image transmission\ntask is conducted. Simulations show that the proposed Seb-based SemComs\noutperforms state-of-art works in LPIPS by over 20% under varying communication\nintents, with more robust performance under fluctuating channel conditions,\nindicating the flexible and robust transmission of the proposed Seb-based\nSemComs.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}