{"id":"2408.00196","title":"Combining audio control and style transfer using latent diffusion","authors":"Nils Demerl\\'e, Philippe Esling, Guillaume Doras, David Genova","authorsParsed":[["Demerlé","Nils",""],["Esling","Philippe",""],["Doras","Guillaume",""],["Genova","David",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 23:27:27 GMT"}],"updateDate":"2024-08-02","timestamp":1722468447000,"abstract":"  Deep generative models are now able to synthesize high-quality audio signals,\nshifting the critical aspect in their development from audio quality to control\ncapabilities. Although text-to-music generation is getting largely adopted by\nthe general public, explicit control and example-based style transfer are more\nadequate modalities to capture the intents of artists and musicians.\n  In this paper, we aim to unify explicit control and style transfer within a\nsingle model by separating local and global information to capture musical\nstructure and timbre respectively. To do so, we leverage the capabilities of\ndiffusion autoencoders to extract semantic features, in order to build two\nrepresentation spaces. We enforce disentanglement between those spaces using an\nadversarial criterion and a two-stage training strategy. Our resulting model\ncan generate audio matching a timbre target, while specifying structure either\nwith explicit controls or through another audio example. We evaluate our model\non one-shot timbre transfer and MIDI-to-audio tasks on instrumental recordings\nand show that we outperform existing baselines in terms of audio quality and\ntarget fidelity. Furthermore, we show that our method can generate cover\nversions of complete musical pieces by transferring rhythmic and melodic\ncontent to the style of a target audio in a different genre.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Audio and Speech Processing","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9K6QHJoAHci6Q_YYOitVSZwQzNfAX3Zedh1C_M9QA2g","pdfSize":"791065","txDigest":"3umqvACHjKC2w7HUgYcLm2mQjt79cg5nWUA1Wme7hYpk","endEpoch":"1","status":"CERTIFIED"}
