{"id":"2408.03793","title":"Violations of energy conservation in Horava-Lifshitz gravity: a new\n  ingredient in the dark matter puzzle","authors":"Paolo M Bassani, Joao Magueijo and Shinji Mukohyama","authorsParsed":[["Bassani","Paolo M",""],["Magueijo","Joao",""],["Mukohyama","Shinji",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 14:19:45 GMT"}],"updateDate":"2024-08-08","timestamp":1723040385000,"abstract":"  We investigate the interplay between Horava-Lifshitz (HL) gravity and more\ngeneral theories where the local Hamiltonian constraint is lost, for example\ndue to the time variability of the Lagrangian (e.g. via its parameters) where\ntime is defined on a foliation according to a prescription mimicking Lambda and\n4-volume time in unimodualr gravity. In one direction we subject the multitude\nof parameters in HL to this variability game, mimicking RG flow in a\ncosmological setting. In the opposite direction, we examine the evolution on\nthe left-over Hamiltonian should the HL algebra of constraints be still\napplicable, rather than the algebra of General Relativity being restored.\nWithin the projectable theory, the non-vanishing Hamiltonian can be\nreinterpreted as a pressureless fluid. Unlike in theories with similar\nvariability based on GR, violations of stress-energy tensor conservation\npersist, and these are computed here for the full class of projectable HL\nmodels. The phenomenological implications are examined: remarkably the driven\nsolutions resulting from these energy conservation violations have the correct\nprofiles to flatten the galactic rotation curves in a toy model. Unfortunately\nthis interesting remark does not survive closer scrutiny: neither is the driven\nsolution an attractor, nor does it have the right sign for acceptable values of\nthe HL parameter, certainly for the simplest terms examined. Yet, in this paper\nwe have established a new ingredient in the dark matter mystery, the\npossibility of energy conservation violation.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"hL2VIuWb_lMHtMbhm7cVuCB--kzhskZxMxUOJfGXHh0","pdfSize":"215870"}
