{"id":"2408.08886","title":"The Oasis Project: UHI mitigation strategies applied to Parisian\n  schoolyards","authors":"Ghid Karam (LIED), Martin Hendel (LIED), Bob\\'ee C\\'ecilia (LIED),\n  Berthe Alexandre (LIED), Bordin Patricia (LIED), Royon Laurent (LIED)","authorsParsed":[["Karam","Ghid","","LIED"],["Hendel","Martin","","LIED"],["Cécilia","Bobée","","LIED"],["Alexandre","Berthe","","LIED"],["Patricia","Bordin","","LIED"],["Laurent","Royon","","LIED"]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 13:33:16 GMT"}],"updateDate":"2024-08-20","timestamp":1722864796000,"abstract":"  Paris is experimenting and implementing strategies to increase the capital's\nresilience and promote climate change adaptation. Major heatwaves have been\nhitting the French Capital lately (Bador et al., 2017) and have thus focused\nattention on UHI countermeasures, such as pavement-watering solutions and urban\ngreening. The Oasis Project is one such strategy aiming to transform\nschoolyards into urban cool islands that would benefit surrounding\nneighborhoods and their inhabitants during heatwaves.The work presented here\nfocuses on identifying high-priority schoolyards among the 670 city-owned\nschools. This is conducted using a GIS tool used to identify areas with high\ncooling potential, which would benefit most from UHI countermeasures. After\nextracting bare schoolyard from the facilities, we built a cooling indicator\nbased on the ratio of high solar irradiance surface to the whole schoolyard\narea. We were thus able to identify 38 schoolyards with high cooling potential,\n157 with medium cooling potential and 286 facilities with moderate cooling\npotential, out of the 670 facilities.The methodology can be applied to other\ncities, and therefore helps set up GIS tools that can provide municipalities\nwith meaningful insight into their urban cooling strategy.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}