{"id":"2408.15397","title":"Constraining Dust Formation in the Superluminous Supernova 2017gci with\n  JWST Observations","authors":"Sebastian Gomez, Tea Temim, Ori Fox, V. Ashley Villar, Melissa\n  Shahbandeh, Chris Ashall, Jacob E. Jencson, Danial Langeroodi, Ilse De Looze,\n  Dan Milisavljevic, Justin Pierel, Armin Rest, Tam\\'as Szalai, Samaporn\n  Tinyanont","authorsParsed":[["Gomez","Sebastian",""],["Temim","Tea",""],["Fox","Ori",""],["Villar","V. Ashley",""],["Shahbandeh","Melissa",""],["Ashall","Chris",""],["Jencson","Jacob E.",""],["Langeroodi","Danial",""],["De Looze","Ilse",""],["Milisavljevic","Dan",""],["Pierel","Justin",""],["Rest","Armin",""],["Szalai","Tamás",""],["Tinyanont","Samaporn",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 20:47:45 GMT"}],"updateDate":"2024-08-29","timestamp":1724791665000,"abstract":"  We present JWST/MIRI observations of the Type I superluminous supernova\n(SLSN) 2017gci taken over 2000 rest-frame days after the supernova (SN)\nexploded, which represent the latest phase images taken of any known SLSN. We\nfind that archival \\WISE detections of SN\\,2017gci taken 70 to 200 days after\nexplosion are most likely explained by an IR dust echo from a $\\sim 3 \\times\n10^{-4}$ M$_\\odot$ shell of pre-existing dust, as opposed to freshly-formed\ndust. New JWST observations reveal IR emission in the field of SN\\,2017gci,\nwhich we determine is most likely dominated by the host galaxy of the SN, based\non the expected flux of the galaxy and the measurable separation between said\nemission and the location of the SN. Based on models for IR emission of\ncarbonate dust, we place a $3\\sigma$ upper limit of $0.83$ M$_\\odot$ of dust\nformed in SN\\,2017gci, with a lowest $1\\sigma$ limit of $0.44$ M$_\\odot$.\nInfrared (IR) detections of other SLSNe have suggested that SLSNe could be\namong the most efficient dust producers in the universe. Our results suggest\nthat SLSNe do not necessarily form more dust than other types of SNe, but\ninstead might have a more accelerated dust formation process. More IR\nobservations of a larger sample of SLSNe will be required to determine how\nefficient dust production is in SLSNe.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}