{"id":"2408.05604","title":"Cellular Plasticity Model for Bottom-Up Robotic Design","authors":"Trevor R. Smith, Thomas J. Smith, Nicholas S. Szczecinski, Sergiy\n  Yakovenko, and Yu Gu","authorsParsed":[["Smith","Trevor R.",""],["Smith","Thomas J.",""],["Szczecinski","Nicholas S.",""],["Yakovenko","Sergiy",""],["Gu","Yu",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 17:47:03 GMT"}],"updateDate":"2024-08-13","timestamp":1723312023000,"abstract":"  Traditional top-down robotic design often lacks the adaptability needed to\nhandle real-world complexities, prompting the need for more flexible\napproaches. Therefore, this study introduces a novel cellular plasticity model\ntailored for bottom-up robotic design. The proposed model utilizes an\nactivator-inhibitor reaction, a common foundation of Turing patterns, which are\nfundamental in morphogenesis -- the emergence of form from simple interactions.\nTuring patterns describe how diffusion and interactions between two chemical\nsubstances-an activator and an inhibitor-can lead to complex patterns and\nstructures, such as the formation of limbs and feathers. Our study extends this\nconcept by modeling cellular plasticity as an activator-inhibitor reaction\naugmented with environmental stimuli, encapsulating the core phenomena observed\nacross various cell types: stem cells, neurons, and muscle cells. In addition\nto demonstrating self-regulation and self-containment, this approach ensures\nthat a robot's form and function are direct emergent responses to its\nenvironment without a comprehensive environmental model. In the proposed model,\na factory acts as the activator, producing a product that serves as the\ninhibitor, which is then influenced by environmental stimuli through\nconsumption. These components are regulated by cellular plasticity phenomena as\nfeedback loops. We calculate the equilibrium points of the model and the\nstability criterion. Simulations examine how varying parameters affect the\nsystem's transient behavior and the impact of competing functions on its\nfunctional capacity. Results show the model converges to a single stable\nequilibrium tuned to the environmental stimulation. Such dynamic behavior\nunderscores the model's utility for generating predictable responses within\nrobotics and biological systems, showcasing its potential for navigating the\ncomplexities of adaptive systems.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"S062If-CJkXI4XgKnQn4UlQA_KWH6HY9sQwUNz6WnFI","pdfSize":"980427"}
