{"id":"2408.00794","title":"CCSRP: Robust Pruning of Spiking Neural Networks through Cooperative\n  Coevolution","authors":"Zichen Song, Jiakang Li, Songning Lai, Sitan Huang","authorsParsed":[["Song","Zichen",""],["Li","Jiakang",""],["Lai","Songning",""],["Huang","Sitan",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 04:28:16 GMT"}],"updateDate":"2024-08-05","timestamp":1721276896000,"abstract":"  Spiking neural networks (SNNs) have shown promise in various dynamic visual\ntasks, yet those ready for practical deployment often lack the compactness and\nrobustness essential in resource-limited and safety-critical settings. Prior\nresearch has predominantly concentrated on enhancing the compactness or\nrobustness of artificial neural networks through strategies like network\npruning and adversarial training, with little exploration into similar\nmethodologies for SNNs. Robust pruning of SNNs aims to reduce computational\noverhead while preserving both accuracy and robustness. Current robust pruning\napproaches generally necessitate expert knowledge and iterative experimentation\nto establish suitable pruning criteria or auxiliary modules, thus constraining\ntheir broader application. Concurrently, evolutionary algorithms (EAs) have\nbeen employed to automate the pruning of artificial neural networks, delivering\nremarkable outcomes yet overlooking the aspect of robustness. In this work, we\npropose CCSRP, an innovative robust pruning method for SNNs, underpinned by\ncooperative co-evolution. Robust pruning is articulated as a tri-objective\noptimization challenge, striving to balance accuracy, robustness, and\ncompactness concurrently, resolved through a cooperative co-evolutionary\npruning framework that independently prunes filters across layers using EAs.\nOur experiments on CIFAR-10 and SVHN demonstrate that CCSRP can match or exceed\nthe performance of the latest methodologies.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}