{"id":"2408.14348","title":"Deep learning-based ecological analysis of camera trap images is\n  impacted by training data quality and size","authors":"Omiros Pantazis, Peggy Bevan, Holly Pringle, Guilherme Braga Ferreira,\n  Daniel J. Ingram, Emily Madsen, Liam Thomas, Dol Raj Thanet, Thakur Silwal,\n  Santosh Rayamajhi, Gabriel Brostow, Oisin Mac Aodha, Kate E. Jones","authorsParsed":[["Pantazis","Omiros",""],["Bevan","Peggy",""],["Pringle","Holly",""],["Ferreira","Guilherme Braga",""],["Ingram","Daniel J.",""],["Madsen","Emily",""],["Thomas","Liam",""],["Thanet","Dol Raj",""],["Silwal","Thakur",""],["Rayamajhi","Santosh",""],["Brostow","Gabriel",""],["Mac Aodha","Oisin",""],["Jones","Kate E.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 15:26:27 GMT"}],"updateDate":"2024-08-27","timestamp":1724685987000,"abstract":"  Large wildlife image collections from camera traps are crucial for\nbiodiversity monitoring, offering insights into species richness, occupancy,\nand activity patterns. However, manual processing of these data is\ntime-consuming, hindering analytical processes. To address this, deep neural\nnetworks have been widely adopted to automate image analysis. Despite their\ngrowing use, the impact of model training decisions on downstream ecological\nmetrics remains unclear. Here, we analyse camera trap data from an African\nsavannah and an Asian sub-tropical dry forest to compare key ecological metrics\nderived from expert-generated species identifications with those generated from\ndeep neural networks. We assess the impact of model architecture, training data\nnoise, and dataset size on ecological metrics, including species richness,\noccupancy, and activity patterns. Our results show that while model\narchitecture has minimal impact, large amounts of noise and reduced dataset\nsize significantly affect these metrics. Nonetheless, estimated ecological\nmetrics are resilient to considerable noise, tolerating up to 10% error in\nspecies labels and a 50% reduction in training set size without changing\nsignificantly. We also highlight that conventional metrics like classification\nerror may not always be representative of a model's ability to accurately\nmeasure ecological metrics. We conclude that ecological metrics derived from\ndeep neural network predictions closely match those calculated from expert\nlabels and remain robust to variations in the factors explored. However,\ntraining decisions for deep neural networks can impact downstream ecological\nanalysis. Therefore, practitioners should prioritize creating large, clean\ntraining sets and evaluate deep neural network solutions based on their ability\nto measure the ecological metrics of interest.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}