{"id":"2408.15308","title":"Antivax and off-label medication communities on brazilian Telegram:\n  between esotericism as a gateway and the monetization of false miraculous\n  cures","authors":"Ergon Cugler de Moraes Silva","authorsParsed":[["Silva","Ergon Cugler de Moraes",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 17:07:10 GMT"},{"version":"v2","created":"Sat, 31 Aug 2024 02:13:24 GMT"}],"updateDate":"2024-09-04","timestamp":1724778430000,"abstract":"  Conspiracy theories, particularly those focused on anti-vaccine narratives\nand the promotion of off-label medications such as MMS and CDS, have\nproliferated on Telegram, including in Brazil, finding fertile ground among\ncommunities that share esoteric beliefs and distrust towards scientific\ninstitutions. In this context, this study seeks to answer how Brazilian\nconspiracy theory communities on Telegram are characterized and articulated\nconcerning anti-vaccine themes and off-label medications? It is important to\nhighlight that this study is part of a series of seven studies aimed at\nunderstanding and characterizing Brazilian conspiracy theory communities on\nTelegram. This series of seven studies is openly and originally available on\nthe arXiv of Cornell University, applying a mirrored method across all studies,\nchanging only the thematic object of analysis and providing replicable\nresearch, including proprietary and original codes developed, contributing to\nthe culture of free and open-source software. Regarding the main findings of\nthis study, it was observed: Themes such as the New World Order and Apocalypse\nand Survivalism act as significant gateways to anti-vaccine narratives,\nconnecting them to theories of global control; Globalism and New World Order\nstand out as the main communities receiving invitations from anti-vaccine\ncommunities; Occultism and Esotericism emerge as the largest sources of\ninvitations to off-label medication communities, creating a strong connection\nbetween esoteric beliefs and the promotion of non-scientific treatments;\nAnti-vaccine narratives experienced a 290% increase during the COVID-19\npandemic, evidencing a growing interconnectedness with other conspiracy\ntheories; The overlap of themes between anti-vaccine and other conspiracy\ntheories creates an interdependent disinformation network, where different\nnarratives mutually reinforce each other.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/"}