{"id":"2408.08322","title":"Movable-Antenna Position Optimization for Physical-Layer Security via\n  Discrete Sampling","authors":"Weidong Mei, Xin Wei, Yijie Liu, Boyu Ning, Zhi Chen","authorsParsed":[["Mei","Weidong",""],["Wei","Xin",""],["Liu","Yijie",""],["Ning","Boyu",""],["Chen","Zhi",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 07:27:25 GMT"}],"updateDate":"2024-08-19","timestamp":1722497245000,"abstract":"  Fluid antennas (FAs) and mobile antennas (MAs) are innovative technologies in\nwireless communications that are able to proactively improve channel conditions\nby dynamically adjusting the transmit/receive antenna positions within a given\nspatial region. In this paper, we investigate an MA-enhanced multiple-input\nsingle-output (MISO) secure communication system, aiming to maximize the\nsecrecy rate by jointly optimizing the positions of multiple MAs. Instead of\ncontinuously searching for the optimal MA positions as in prior works, we\npropose to discretize the transmit region into multiple sampling points,\nthereby converting the continuous antenna position optimization into a discrete\nsampling point selection problem. However, this point selection problem is\ncombinatory and thus difficult to be optimally solved. To tackle this\nchallenge, we ingeniously transform this combinatory problem into a recursive\npath selection problem in graph theory and propose a partial enumeration\nalgorithm to obtain its optimal solution without the need for high-complexity\nexhaustive search. To further reduce the complexity, a linear-time sequential\nupdate algorithm is also proposed to obtain a high-quality suboptimal solution.\nNumerical results show that our proposed algorithms yield much higher secrecy\nrates as compared to the conventional FPA and other baseline schemes.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}