{"id":"2408.17338","title":"Introducing antiferromagnetic ordering on the surface states of Bi2Se3\n  topological insulator by Europium doping","authors":"Sumana Paul, Moumita Das, Sujoy Datta, Raja Chakraborty, Prabhat\n  Mandal and P. K. Giri","authorsParsed":[["Paul","Sumana",""],["Das","Moumita",""],["Datta","Sujoy",""],["Chakraborty","Raja",""],["Mandal","Prabhat",""],["Giri","P. K.",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 15:03:58 GMT"}],"updateDate":"2024-09-02","timestamp":1725030238000,"abstract":"  Topological insulators (TIs) are materials with an insulating bulk\ncharacterized by a gapped band structure, along with gapless metallic surface\nstates having a Dirac cone with a helical spin structure in momentum space. The\nhelical spin--momentum locking of the surface states arises from intrinsic\nspin--orbit coupling (SOC) and provides topological protection to the surface\nstates against scattering from external perturbations, like defects and\nnon-magnetic impurities. Breaking the topological protection of surface states\nof topological insulators is an essential prerequisite for exploring their\napplications. Rare-earth ions typically exhibit larger magnetic moments than\ntransition-metal ions and thus promise the opening of a wider exchange gap in\nthe Dirac surface states of topological insulators. Bi$_2$Se$_3$ is an\ninteresting material; on the one hand, it has semiconducting properties when it\nis thin sheets; on the other hand, it's a topological insulator when the\nstructure has a minimum of six quintuple layers (QLs), with diverse\napplications in photothermal, thermoelectric, and optical properties. Here, we\nhave developed a controlled colloidal synthesis with low temperature and a\ncost-effective process for the synthesis of undoped and Eu-doped 2D layered\nBi$_2$Se$_3$ nanosheets. Scanning tunneling spectroscopy measurements\ndemonstrated a correlation between the shift of Dirac point position and the\ndopant content, which has been theoretically established by the band structure\ncalculation. At low temperatures below 10K, for the 10\\% Eu-doped sample,\nmagnetic data suggests an antiferromagnetic ordering in the sample, which may\nbe the contribution of the mixed valence state of Europium. Our results support\nthat antiferromagnetic exchange interaction can exist in topological surface\nstates in rare-earth Eu-doped Bi$_2$Se$_3$, which can open a new window to\nnovel quantum phenomena.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}