{"id":"2408.09454","title":"Retina-inspired Object Motion Segmentation","authors":"Victoria Clerico (1), Shay Snyder (1), Arya Lohia (1), Md Abdullah-Al\n  Kaiser (2), Gregory Schwartz (3), Akhilesh Jaiswal (2), Maryam Parsa (1) ((1)\n  George Mason Unviersity, (2) University of Southern, California, (3)\n  Northwestern University)","authorsParsed":[["Clerico","Victoria",""],["Snyder","Shay",""],["Lohia","Arya",""],["Kaiser","Md Abdullah-Al",""],["Schwartz","Gregory",""],["Jaiswal","Akhilesh",""],["Parsa","Maryam",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 12:28:26 GMT"}],"updateDate":"2024-08-20","timestamp":1723984106000,"abstract":"  Dynamic Vision Sensors (DVS) have emerged as a revolutionary technology with\na high temporal resolution that far surpasses RGB cameras. DVS technology draws\nbiological inspiration from photoreceptors and the initial retinal synapse. Our\nresearch showcases the potential of additional retinal functionalities to\nextract visual features. We provide a domain-agnostic and efficient algorithm\nfor ego-motion compensation based on Object Motion Sensitivity (OMS), one of\nthe multiple robust features computed within the mammalian retina. We develop a\nframework based on experimental neuroscience that translates OMS' biological\ncircuitry to a low-overhead algorithm. OMS processes DVS data from dynamic\nscenes to perform pixel-wise object motion segmentation. Using a real and a\nsynthetic dataset, we highlight OMS' ability to differentiate object motion\nfrom ego-motion, bypassing the need for deep networks. This paper introduces a\nbio-inspired computer vision method that dramatically reduces the number of\nparameters by a factor of 1000 compared to prior works. Our work paves the way\nfor robust, high-speed, and low-bandwidth decision-making for in-sensor\ncomputations.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Neural and Evolutionary Computing","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}