{"id":"2408.08415","title":"Dynamics of the unitary Bose gas near a narrow Feshbach resonance:\n  universal coherent atom-molecule oscillations","authors":"Ke Wang, Zhendong Zhang, Shu Nagata, Zhiqiang Wang, K. Levin","authorsParsed":[["Wang","Ke",""],["Zhang","Zhendong",""],["Nagata","Shu",""],["Wang","Zhiqiang",""],["Levin","K.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 20:48:31 GMT"}],"updateDate":"2024-08-19","timestamp":1723754911000,"abstract":"  Quench experiments on a unitary Bose gas around a broad Feshbach resonance\nhave led to the discovery of universal dynamics. This universality is\nmanifested in the measured atomic momentum distributions where, asymptotically,\na quasi-equilibrated metastable state is found in which both the momentum\ndistribution and the time scales are determined by the particle density. In\nthis paper we present counterpart studies but for the case of a very narrow\nFeshbach resonance of $^{133}$Cs atoms having a width of 8.3 mG. In dramatic\ncontrast to the behavior reported earlier, a rapid quench of an atomic\ncondensate to unitarity is observed to ultimately lead to coherent oscillations\ninvolving dynamically produced condensed and non-condensed molecules and atoms.\nThe same characteristic frequency, determined by the Feshbach coupling, is\nobserved in all types of particles. To understand these quench dynamics and how\nthese different particle species are created, we develop a beyond\nHartree-Fock-Bogoliubov dynamical framework including a new type of cross\ncorrelation between atoms and molecules. This leads to a quantitative\nconsistency with the measured frequency. Our results, which can be applied to\nthe general class of bosonic superfluids associated with narrow Feshbach\nresonances, establish a new paradigm for universal dynamics dominated by\nquantum many-body interactions.\n","subjects":["Condensed Matter/Quantum Gases","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"S5fU7MeEMjfImuaa3PHRJYxcMS8KKaIdRMZvGMN6Yb4","pdfSize":"3438715"}
