{"id":"2408.07466","title":"Forming and Compliance-free Operation of Low-power, Fast-switching\n  HfO$_x$S$_y$/HfS$_2$ Heterostructure Memristors","authors":"Aferdita Xhameni, AbdulAziz AlMutairi, Xuyun Guo, Irina Chirc\\u{a},\n  Tianyi Wen, Stephan Hofmann, Valeria Nicolosi, Antonio Lombardo","authorsParsed":[["Xhameni","Aferdita",""],["AlMutairi","AbdulAziz",""],["Guo","Xuyun",""],["Chircă","Irina",""],["Wen","Tianyi",""],["Hofmann","Stephan",""],["Nicolosi","Valeria",""],["Lombardo","Antonio",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 11:23:01 GMT"}],"updateDate":"2024-08-15","timestamp":1723634581000,"abstract":"  We demonstrate low power, forming and compliance-free operation of a\nresistive memory obtained by the partial oxidation of a two-dimensional layered\nvan-der-Waals semiconductor: hafnium disulfide (HfS$_2$). Semiconductor - oxide\nheterostructures are achieved by low temperature ($<300^{o}$C) thermal\noxidation of HfS$_2$ in dry conditions, carefully controlling process\nparameters such as pressure, temperature and oxygen flow. The resulting\nHfO$_x$S$_y$/HfS$_2$ heterostructures are integrated between metal contacts,\nforming vertical crossbar devices. Forming-free, compliance-free resistive\nswitching between two non-volatile states is demonstrated by applying voltage\nsweeps. By applying voltage pulses and measuring the current response in time,\nwe show non-volatile memory operation programmable by 60ns, $<$ 20pJ WRITE and\nERASE operations. Multiple stable resistance states are achievable by pulse\nwidth and amplitude modulation demonstrating the capability for multi-state\nprogramming. Resistance states were retained without fail at 85$^o$C and\n150$^o$C, showcasing the potential of these devices for long retention times.\nUsing a technology computer-aided design (TCAD) tool (Synopsys Sentaurus,\n2022), we explore the role of the semiconductor layer in tuning the device\nconductance and driving gradual resistive switching in 2D HfO$_x$ - based\ndevices.\n","subjects":["Physics/Applied Physics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}