{"id":"2408.05564","title":"Meta-heuristic Optimizer Inspired by the Philosophy of Yi Jing","authors":"Yisheng Yang, Sim Kuan Goh, Qing Cai, Shen Yuong Wong, Ho-Kin Tang","authorsParsed":[["Yang","Yisheng",""],["Goh","Sim Kuan",""],["Cai","Qing",""],["Wong","Shen Yuong",""],["Tang","Ho-Kin",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 14:17:42 GMT"}],"updateDate":"2024-08-13","timestamp":1723299462000,"abstract":"  Drawing inspiration from the philosophy of Yi Jing, the Yin-Yang pair\noptimization (YYPO) algorithm has been shown to achieve competitive performance\nin single objective optimizations, in addition to the advantage of low time\ncomplexity when compared to other population-based meta-heuristics. Building\nupon a reversal concept in Yi Jing, we propose the novel Yi optimization (YI)\nalgorithm. Specifically, we enhance the Yin-Yang pair in YYPO with a proposed\nYi-point, in which we use Cauchy flight to update the solution, by implementing\nboth the harmony and reversal concept of Yi Jing. The proposed Yi-point\nbalances both the effort of exploration and exploitation in the optimization\nprocess. To examine YI, we use the IEEE CEC 2017 benchmarks and compare YI\nagainst the dynamical YYPO, CV1.0 optimizer, and four classical optimizers,\ni.e., the differential evolution, the genetic algorithm, the particle swarm\noptimization, and the simulated annealing. According to the experimental\nresults, YI shows highly competitive performance while keeping the low time\ncomplexity. The results of this work have implications for enhancing a\nmeta-heuristic optimizer using the philosophy of Yi Jing. While this work\nimplements only certain aspects of Yi Jing, we envisage enhanced performance by\nincorporating other aspects.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HJ6YPAoGoIJtN_ZU6vDy8AThqsB-sXZtD2vXP8oE7mw","pdfSize":"488649"}
