{"id":"2408.08588","title":"Movable Antenna for Wireless Communications:Prototyping and Experimental\n  Results","authors":"Zhenjun Dong, Zhiwen Zhou, Zhiqiang Xiao, Chaoyue Zhang, Xinrui Li,\n  Hongqi Min, Yong Zeng, Shi Jin, Rui Zhang","authorsParsed":[["Dong","Zhenjun",""],["Zhou","Zhiwen",""],["Xiao","Zhiqiang",""],["Zhang","Chaoyue",""],["Li","Xinrui",""],["Min","Hongqi",""],["Zeng","Yong",""],["Jin","Shi",""],["Zhang","Rui",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 07:43:31 GMT"}],"updateDate":"2024-08-19","timestamp":1723794211000,"abstract":"  Movable antenna (MA), which can flexibly change the position of antenna in\nthree-dimensional (3D) continuous space, is an emerging technology for\nachieving full spatial performance gains. In this paper, a prototype of MA\ncommunication system with ultra-accurate movement control is presented to\nverify the performance gain of MA in practical environments. The prototype\nutilizes the feedback control to ensure that each power measurement is\nperformed after the MA moves to a designated position. The system operates at\n3.5 GHz or 27.5 GHz, where the MA moves along a one-dimensional horizontal line\nwith a step size of 0.01{\\lambda} and in a two-dimensional square region with a\nstep size of 0.05{\\lambda}, respectively, with {\\lambda} denoting the signal\nwavelength. The scenario with mixed line-of-sight (LoS) and non-LoS (NLoS)\nlinks is considered. Extensive experimental results are obtained with the\ndesigned prototype and compared with the simulation results, which validate the\ngreat potential of MA technology in improving wireless communication\nperformance. For example, the maximum variation of measured power reaches over\n40 dB and 23 dB at 3.5 GHz and 27.5 GHz, respectively, thanks to the flexible\nantenna movement. In addition, experimental results indicate that the power\ngain of MA system relies on the estimated path state information (PSI),\nincluding the number of paths, their delays, elevation and azimuth angles of\narrival (AoAs), as well as the power ratio of each path.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}