{"id":"2408.07650","title":"Exact Trajectory Similarity Search With N-tree: An Efficient Metric\n  Index for kNN and Range Queries","authors":"Ralf Hartmut G\\\"uting (1), Suvam Kumar Das (2), Fabio Vald\\'es (1),\n  Suprio Ray (2) ((1) Fernuniversit\\\"at in Hagen, Germany, (2) University of\n  New Brunswick, Fredericton, Canada)","authorsParsed":[["Güting","Ralf Hartmut",""],["Das","Suvam Kumar",""],["Valdés","Fabio",""],["Ray","Suprio",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 16:21:28 GMT"}],"updateDate":"2024-08-15","timestamp":1723652488000,"abstract":"  Similarity search is the problem of finding in a collection of objects those\nthat are similar to a given query object. It is a fundamental problem in modern\napplications and the objects considered may be as diverse as locations in\nspace, text documents, images, twitter messages, or trajectories of moving\nobjects.\n  In this paper we are motivated by the latter application. Trajectories are\nrecorded movements of mobile objects such as vehicles, animals, public\ntransportation, or parts of the human body. We propose a novel distance\nfunction called DistanceAvg to capture the similarity of such movements. To be\npractical, it is necessary to provide indexing for this distance measure.\n  Fortunately we do not need to start from scratch. A generic and unifying\napproach is metric space, which organizes the set of objects solely by a\ndistance (similarity) function with certain natural properties. Our function\nDistanceAvg is a metric.\n  Although metric indexes have been studied for decades and many such\nstructures are available, they do not offer the best performance with\ntrajectories. In this paper we propose a new design, which outperforms the best\nexisting indexes for kNN queries and is equally good for range queries. It is\nespecially suitable for expensive distance functions as they occur in\ntrajectory similarity search. In many applications, kNN queries are more\npractical than range queries as it may be difficult to determine an appropriate\nsearch radius. Our index provides exact result sets for the given distance\nfunction.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}