{"id":"2408.01152","title":"Vertiport Terminal Scheduling and Throughput Analysis for Multiple\n  Surface Directions","authors":"Ravi Raj Saxena, T.V. Prabhakar, Joy Kuri, Manogna Yadav","authorsParsed":[["Saxena","Ravi Raj",""],["Prabhakar","T. V.",""],["Kuri","Joy",""],["Yadav","Manogna",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 10:11:41 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 08:00:01 GMT"}],"updateDate":"2024-08-06","timestamp":1722593501000,"abstract":"  Vertical Take-Off and Landing (VTOL) vehicles have gained immense popularity\nin the delivery drone market and are now being developed for passenger\ntransportation in urban areas to efficiently enable Urban Air Mobility (UAM).\nUAM aims to utilize the urban airspace \\hidetxt{vertical dimension} to address\nthe problem of heavy road congestion in dense urban cities. VTOL vehicles\nrequire vertiport terminals for landing, take-off, passengers boarding or\ndeboarding, refuelling (or charging), and maintenance. An efficient scheduling\nalgorithm is essential to maximize the throughput of the vertiport terminal\n(vertiminal)\\hidetxt{ as well as efficient use of airspace} while maintaining\nsafety protocols to handle the UAM traffic. While traditional departure and\ntaxiing operations can be applied in the context of vertiminal, specific\nalgorithms are required for take-off and landing schedules. Unlike fixed-wing\naircraft that require a runway to take-off and climb in a single direction,\nVTOL vehicles can approach and climb in several directions. We propose a Mixed\nInteger Linear Program (MILP) formulation to schedule flights for taxiing,\nclimbing (or approaching) using multiple directions after take-off (before\nlanding) and turnaround on gates. We also derived equations to thoroughly\nanalyze the throughput capacity of a vertiminal considering all its core\nelements. We have shown that our MILP can achieve the maximum throughput\nobtained through the equations. Given the input parameters, our analysis can be\nused to analyze the capacity of a vertiminal without running any simulation,\nwhile our MILP can be used to get the most efficient schedule.\n","subjects":["Computing Research Repository/Emerging Technologies","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AiGElquHT6l6Cs1O7PUZfuvL9Ei0R7G9k0RzrdY7mxE","pdfSize":"6257337"}
