{"id":"2408.01658","title":"Flow Reconstruction Using Spatially Restricted Domains Based on Enhanced\n  Super-Resolution Generative Adversarial Networks","authors":"Mustafa Z. Yousif, Dan Zhou, Linqi Yu, Meng Zhang, Arash\n  Mohammadikarachi, Jung Sub Lee, and Hee-Chang Lim","authorsParsed":[["Yousif","Mustafa Z.",""],["Zhou","Dan",""],["Yu","Linqi",""],["Zhang","Meng",""],["Mohammadikarachi","Arash",""],["Lee","Jung Sub",""],["Lim","Hee-Chang",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 04:09:13 GMT"}],"updateDate":"2024-08-06","timestamp":1722658153000,"abstract":"  This study aims to reconstruct the complete flow field from spatially\nrestricted domain data by utilizing an Enhanced Super-Resolution Generative\nAdversarial Network (ESRGAN) model. The difficulty in flow field reconstruction\nlies in accurately capturing and reconstructing large amounts of data under\nnonlinear, multi-scale, and complex flow while ensuring physical consistency\nand high computational efficiency. The ESRGAN model has a strong information\nmapping capability, capturing fluctuating features from local flow fields of\nvarying geometries and sizes. The model effectiveness in reconstructing the\nwhole domain flow field is validated by comparing instantaneous velocity\nfields, flow statistical properties, and probability density distributions.\nUsing laminar bluff body flow from Direct Numerical Simulation (DNS) as a\npriori case, the model successfully reconstructs the complete flow field from\nthree non-overlapping limited regions, with flow statistical properties\nperfectly matching the original data. Validation of the power spectrum density\n(PSD) for the reconstruction results also proves that the model could conform\nto the temporal behavior of the real complete flow field. Additionally, tests\nusing DNS turbulent channel flow with a friction Reynolds number ($Re_\\tau =\n180$) demonstrate the model ability to reconstruct turbulent fields, though the\nquality of results depends on the number of flow features in the local regions.\nFinally, the model is applied to reconstruct turbulence flow fields from\nParticle Image Velocimetry (PIV) experimental measurements, using limited data\nfrom the near-wake region to reconstruct a larger field of view. The turbulence\nstatistics closely match the experimental data, indicating that the model can\nserve as a reliable data-driven method to overcome PIV field-of-view\nlimitations while saving computational costs.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"2tXcfEYrLsGeo6VjLxGjHDbfq0cNsjyEFttMiGej5UU","pdfSize":"7099785"}
