{"id":"2408.13536","title":"Four HD 209458 b transits through CRIRES+: Detection of H$_2$O and\n  non-detections of C$_2$H$_2$, CH$_4$, and HCN","authors":"D. Blain, R. Landman, P. Molli\\`ere and J. Dittmann","authorsParsed":[["Blain","D.",""],["Landman","R.",""],["Mollière","P.",""],["Dittmann","J.",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 09:28:46 GMT"}],"updateDate":"2024-08-27","timestamp":1724491726000,"abstract":"  HD 209458 b is one of the most studied exoplanets to date. Despite this,\natmospheric characterisation studies yielded inconsistent species detections\nand abundances. Values reported for the C/O ratio range from 0.1 to 1.0. Of\nparticular interest is the simultaneous detection of H2O and HCN reported by\nsome studies using high-resolution ground-based observations, which would\nrequire the atmospheric C/O ratio to be fine-tuned to a narrow interval around\n1. HCN has however not been detected from recent space-based observations.\n  We aim to provide an independent study of HD 209458 b's atmosphere with\nhigh-resolution observations, in order to infer the presence of several\nspecies, including H2O and HCN.\n  We observed four primary transits of HD 209458 b at a high resolution\n(R=92000) with CRIRES+ in the near infrared (band H, 1.4--1.8 um). After\nreducing the data with pycrires, we prepared the data using the SysRem\nalgorithm and performed a cross-correlation (CCF) analysis of the transmission\nspectra. We also compared the results with those obtained from simulated\ndatasets constructed by combining the Exo-REM self-consistent model with the\npetitRADTRANS package.\n  Combining the four transits, we detect H2O with a signal-to-noise CCF metric\nof 8.7. This corresponds to a signal emitted at $K_p=151.3^{+31.1}_{-23.4}$\nkm/s and blueshifted by $-6^{+1}_{-2}$ km/s, consistent with what is expected\nfor HD 209458 b. We do not detect any other species among C2H2, CH4, CO, CO2,\nH2S, HCN, and NH3. Comparing this with our simulated datasets, this result is\nconsistent with a C/O ratio of 0.1 and an opaque cloud top pressure of 50 Pa,\nat a 3 times solar metallicity. This would also be consistent with recent JWST\nobservations. However, none of the simulated results obtained with a bulk C/O\nratio of 0.8, a value suggested by previous studies using GIANO-B and CRIRES,\nare consistent with our observations.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ry8dU_Ebpiu_eRxDhfS8_Nt7SuEnoFwYBj7WcAy5SP0","pdfSize":"4836569"}
