{"id":"2408.14710","title":"On the distinction between the per-protocol effect and the effect of the\n  treatment strategy","authors":"Issa J. Dahabreh, Lawson Ung, Miguel A. Hern\\'an and Yu-Han Chiu","authorsParsed":[["Dahabreh","Issa J.",""],["Ung","Lawson",""],["Hernán","Miguel A.",""],["Chiu","Yu-Han",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 00:33:38 GMT"}],"updateDate":"2024-08-28","timestamp":1724718818000,"abstract":"  In randomized trials, the per-protocol effect, that is, the effect of being\nassigned a treatment strategy and receiving treatment according to the assigned\nstrategy, is sometimes thought to reflect the effect of the treatment strategy\nitself, without intervention on assignment. Here, we argue by example that this\nis not necessarily the case. We examine a causal structure for a randomized\ntrial where these two causal estimands -- the per-protocol effect and the\neffect of the treatment strategy -- are not equal, and where their\ncorresponding identifying observed data functionals are not the same, but both\nrequire information on assignment for identification. Our example highlights\nthe conceptual difference between the per-protocol effect and the effect of the\ntreatment strategy itself, the conditions under which the observed data\nfunctionals for these estimands are equal, and suggests that in some cases\ntheir identification requires information on assignment, even when assignment\nis randomized. An implication of these findings is that in observational\nanalyses that aim to emulate a target randomized trial in which an analog of\nassignment is well-defined, the effect of the treatment strategy is not\nnecessarily an observational analog of the per-protocol effect. Furthermore,\neither of these effects may be unidentifiable without information on treatment\nassignment, unless one makes additional assumptions; informally, that\nassignment does not affect the outcome except through treatment (i.e., an\nexclusion-restriction assumption), and that assignment is not a confounder of\nthe treatment outcome association conditional on other variables in the\nanalysis.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}