{"id":"2408.14684","title":"Preparing angular momentum eigenstates using engineered quantum walks","authors":"Yuan Shi, Kristin M. Beck, Veronika Anneliese Kruse, Stephen B. Libby","authorsParsed":[["Shi","Yuan",""],["Beck","Kristin M.",""],["Kruse","Veronika Anneliese",""],["Libby","Stephen B.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 23:20:00 GMT"}],"updateDate":"2024-08-28","timestamp":1724714400000,"abstract":"  Coupled angular momentum eigenstates are widely used in atomic and nuclear\nphysics calculations, and are building blocks for spin networks and the Schur\ntransform. To combine two angular momenta $\\mathbf{J}_1$ and $\\mathbf{J}_2$,\nforming eigenstates of their total angular momentum\n$\\mathbf{J}=\\mathbf{J}_1+\\mathbf{J}_2$, we develop a quantum-walk scheme that\ndoes not require inputting $O(j^3)$ nonzero Clebsch-Gordan (CG) coefficients\nclassically. In fact, our scheme may be regarded as a unitary method for\ncomputing CG coefficients on quantum computers with a typical complexity of\n$O(j)$ and a worst-case complexity of $O(j^3)$. Equivalently, our scheme\nprovides decompositions of the dense CG unitary into sparser unitary\noperations. Our scheme prepares angular momentum eigenstates using a sequence\nof Hamiltonians to move an initial state deterministically to desired final\nstates, which are usually highly entangled states in the computational basis.\nIn contrast to usual quantum walks, whose Hamiltonians are prescribed, we\nengineer the Hamiltonians in $\\mathfrak{su}(2)\\times \\mathfrak{su}(2)$, which\nare inspired by, but different from, Hamiltonians that govern magnetic\nresonances and dipole interactions. To achieve a deterministic preparation of\nboth ket and bra states, we use projection and destructive interference to\ndouble pinch the quantum walks, such that each step is a unit-probability\npopulation transfer within a two-level system. We test our state preparation\nscheme on classical computers, reproducing CG coefficients. We also implement\nsmall test problems on current quantum hardware.\n","subjects":["Physics/Quantum Physics","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}