{"id":"2408.05965","title":"Time-limited H2-optimal Model Order Reduction of Linear Systems with\n  Quadratic Outputs","authors":"Umair Zulfiqar, Zhi-Hua Xiao, Qiu-Yan Song, Mohammad Monir Uddin,\n  Victor Sreeram","authorsParsed":[["Zulfiqar","Umair",""],["Xiao","Zhi-Hua",""],["Song","Qiu-Yan",""],["Uddin","Mohammad Monir",""],["Sreeram","Victor",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 07:36:54 GMT"}],"updateDate":"2024-08-13","timestamp":1723448214000,"abstract":"  An important class of dynamical systems with several practical applications\nis linear systems with quadratic outputs. These models have the same state\nequation as standard linear time-invariant systems but differ in their output\nequations, which are nonlinear quadratic functions of the system states. When\ndealing with models of exceptionally high order, the computational demands for\nsimulation and analysis can become overwhelming. In such cases, model order\nreduction proves to be a useful technique, as it allows for constructing a\nreduced-order model that accurately represents the essential characteristics of\nthe original high-order system while significantly simplifying its complexity.\n  In time-limited model order reduction, the main goal is to maintain the\noutput response of the original system within a specific time range in the\nreduced-order model. To assess the error within this time interval, a\nmathematical expression for the time-limited $\\mathcal{H}_2$-norm is derived in\nthis paper. This norm acts as a measure of the accuracy of the reduced-order\nmodel within the specified time range. Subsequently, the necessary conditions\nfor achieving a local optimum of the time-limited $\\mathcal{H}_2$ norm error\nare derived. The inherent inability to satisfy these optimality conditions\nwithin the Petrov-Galerkin projection framework is also discussed. After that,\na stationary point iteration algorithm based on the optimality conditions and\nPetrov-Galerkin projection is proposed. Upon convergence, this algorithm\nfulfills three of the four optimality conditions. To demonstrate the\neffectiveness of the proposed algorithm, a numerical example is provided that\nshowcases its ability to effectively approximate the original high-order model\nwithin the desired time interval.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}