{"id":"2408.08116","title":"The spectroscopic binary fraction of the young stellar cluster M17","authors":"M.C. Ram\\'irez-Tannus, A.R. Derkink, F. Backs, A. de Koter, H. Sana,\n  J. Poorta, L. Kaper, and M. Stoop","authorsParsed":[["Ramírez-Tannus","M. C.",""],["Derkink","A. R.",""],["Backs","F.",""],["de Koter","A.",""],["Sana","H.",""],["Poorta","J.",""],["Kaper","L.",""],["Stoop","M.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 12:27:33 GMT"}],"updateDate":"2024-08-16","timestamp":1723724853000,"abstract":"  Significant progress has been made toward understanding the formation of\nmassive ($M > 8~$M$_{\\odot}$) binaries in close orbits. For example, the\ndetection of a very low velocity dispersion among the massive stars in the\nyoung region M17 and the measurement of a positive trend of velocity dispersion\nwith age in Galactic clusters. The velocity dispersion observed in M17 could be\nexplained either by the lack of binaries among the stars in this region or by\nlarger binary separations than typically observed, but with a binary fraction\nsimilar to other young Galactic clusters. The latter implies that over time,\nthe binary components migrate toward each other. We aim to determine the origin\nof the strikingly low velocity dispersion by determining the observed and\nintrinsic binary fraction of massive stars in M17 through multi-epoch\nspectroscopy. We performed a multi-epoch spectroscopic survey consisting of\nthree epochs separated by days and months. We determine the radial velocity of\neach star at each epoch by fitting the stellar absorption profiles. We\ndetermine an observed binary fraction of 27% and an intrinsic binary fraction\nof 87%, consistent with that of other Galactic clusters. We conclude that the\nlow velocity dispersion is due to a large separation among the young massive\nbinaries in M17. Our result is in agreement with a migration scenario in which\nmassive stars are born in binaries or higher order systems at large separation\nand harden within the first million years of evolution. Such an inward\nmigration may either be driven by interaction with a remnant accretion disk,\nwith other young stellar objects present in the system or by dynamical\ninteractions within the cluster. Our results imply that possibly both dynamical\ninteractions and binary evolution are key processes in the formation of\ngravitational wave sources.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_tXsUzvduq4qvLCGygyHDjoqI6pfH5A19xLUb-PzWZg","pdfSize":"2315623"}
