{"id":"2408.02365","title":"Non-parametric late-time expansion history reconstruction and\n  implications for the Hubble tension in light of DESI","authors":"Jun-Qian Jiang, Davide Pedrotti, Simony Santos da Costa, Sunny\n  Vagnozzi","authorsParsed":[["Jiang","Jun-Qian",""],["Pedrotti","Davide",""],["da Costa","Simony Santos",""],["Vagnozzi","Sunny",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 10:22:31 GMT"}],"updateDate":"2024-08-12","timestamp":1722853351000,"abstract":"  We non-parametrically reconstruct the late-time expansion history in light of\nthe latest Baryon Acoustic Oscillation (BAO) measurements from DESI combined\nwith various Type Ia Supernovae (SNeIa) catalogs, using interpolation through\npiece-wise natural cubic splines, and a reconstruction procedure based on\nGaussian Processes (GPs). Applied to DESI BAO and PantheonPlus SNeIa data, both\nmethods indicate that deviations from a reference $\\Lambda$CDM model in the $z\n\\lesssim 2$ unnormalized expansion rate $E(z)$ are constrained to be $\\lesssim\n10\\%$, but also consistently identify two features in $E(z)$: a bump at $z \\sim\n0.5$, and a depression at $z \\sim 0.9$, which cannot be simultaneously captured\nby a $w_0w_a$CDM fit. These features, which are stable against assumptions\nregarding spatial curvature, interpolation knots, and GP kernel, disappear if\none adopts the older SDSS BAO measurements in place of DESI, and decrease in\nsignificance when replacing the PantheonPlus catalog with the Union3 and DESY5\nones. We infer $c/(r_dH_0)=29.90 \\pm 0.33$ (with $r_d$ the sound horizon at\nbaryon drag), which slightly reduces the Hubble tension and makes room for a\nmore important role of late-time new physics in this context, albeit still\nremaining a sub-dominant part of the solution. If substantiated in forthcoming\ndata releases, our results tentatively point to oscillatory/non-monotonic\nfeatures in the shape of the expansion rate at $z \\lesssim 2$, of potential\ninterest for dark energy model-building.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}