{"id":"2408.13122","title":"Semantic Variational Bayes Based on a Semantic Information Theory for\n  Solving Latent Variables","authors":"Chenguang Lu","authorsParsed":[["Lu","Chenguang",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 03:23:53 GMT"}],"updateDate":"2024-08-26","timestamp":1723433033000,"abstract":"  The Variational Bayesian method (VB) is used to solve the probability\ndistributions of latent variables with the minimum free energy criterion. This\ncriterion is not easy to understand, and the computation is complex. For these\nreasons, this paper proposes the Semantic Variational Bayes' method (SVB). The\nSemantic Information Theory the author previously proposed extends the\nrate-distortion function R(D) to the rate-fidelity function R(G), where R is\nthe minimum mutual information for given semantic mutual information G. SVB\ncame from the parameter solution of R(G), where the variational and iterative\nmethods originated from Shannon et al.'s research on the rate-distortion\nfunction. The constraint functions SVB uses include likelihood, truth,\nmembership, similarity, and distortion functions. SVB uses the maximum\ninformation efficiency (G/R) criterion, including the maximum semantic\ninformation criterion for optimizing model parameters and the minimum mutual\ninformation criterion for optimizing the Shannon channel. For the same tasks,\nSVB is computationally simpler than VB. The computational experiments in the\npaper include 1) using a mixture model as an example to show that the mixture\nmodel converges as G/R increases; 2) demonstrating the application of SVB in\ndata compression with a group of error ranges as the constraint; 3)\nillustrating how the semantic information measure and SVB can be used for\nmaximum entropy control and reinforcement learning in control tasks with given\nrange constraints, providing numerical evidence for balancing control's\npurposiveness and efficiency. Further research is needed to apply SVB to neural\nnetworks and deep learning.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}