{"id":"2408.12153","title":"DimeRec: A Unified Framework for Enhanced Sequential Recommendation via\n  Generative Diffusion Models","authors":"Wuchao Li, Rui Huang, Haijun Zhao, Chi Liu, Kai Zheng, Qi Liu, Na Mou,\n  Guorui Zhou, Defu Lian, Yang Song, Wentian Bao, Enyun Yu and Wenwu Ou","authorsParsed":[["Li","Wuchao",""],["Huang","Rui",""],["Zhao","Haijun",""],["Liu","Chi",""],["Zheng","Kai",""],["Liu","Qi",""],["Mou","Na",""],["Zhou","Guorui",""],["Lian","Defu",""],["Song","Yang",""],["Bao","Wentian",""],["Yu","Enyun",""],["Ou","Wenwu",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 06:42:09 GMT"}],"updateDate":"2024-08-23","timestamp":1724308929000,"abstract":"  Sequential Recommendation (SR) plays a pivotal role in recommender systems by\ntailoring recommendations to user preferences based on their non-stationary\nhistorical interactions. Achieving high-quality performance in SR requires\nattention to both item representation and diversity. However, designing an SR\nmethod that simultaneously optimizes these merits remains a long-standing\nchallenge. In this study, we address this issue by integrating recent\ngenerative Diffusion Models (DM) into SR. DM has demonstrated utility in\nrepresentation learning and diverse image generation. Nevertheless, a\nstraightforward combination of SR and DM leads to sub-optimal performance due\nto discrepancies in learning objectives (recommendation vs. noise\nreconstruction) and the respective learning spaces (non-stationary vs.\nstationary). To overcome this, we propose a novel framework called DimeRec\n(\\textbf{Di}ffusion with \\textbf{m}ulti-interest \\textbf{e}nhanced\n\\textbf{Rec}ommender). DimeRec synergistically combines a guidance extraction\nmodule (GEM) and a generative diffusion aggregation module (DAM). The GEM\nextracts crucial stationary guidance signals from the user's non-stationary\ninteraction history, while the DAM employs a generative diffusion process\nconditioned on GEM's outputs to reconstruct and generate consistent\nrecommendations. Our numerical experiments demonstrate that DimeRec\nsignificantly outperforms established baseline methods across three publicly\navailable datasets. Furthermore, we have successfully deployed DimeRec on a\nlarge-scale short video recommendation platform, serving hundreds of millions\nof users. Live A/B testing confirms that our method improves both users' time\nspent and result diversification.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}