{"id":"2408.12236","title":"MedDiT: A Knowledge-Controlled Diffusion Transformer Framework for\n  Dynamic Medical Image Generation in Virtual Simulated Patient","authors":"Yanzeng Li, Cheng Zeng, Jinchao Zhang, Jie Zhou, Lei Zou","authorsParsed":[["Li","Yanzeng",""],["Zeng","Cheng",""],["Zhang","Jinchao",""],["Zhou","Jie",""],["Zou","Lei",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 09:10:29 GMT"}],"updateDate":"2024-08-23","timestamp":1724317829000,"abstract":"  Medical education relies heavily on Simulated Patients (SPs) to provide a\nsafe environment for students to practice clinical skills, including medical\nimage analysis. However, the high cost of recruiting qualified SPs and the lack\nof diverse medical imaging datasets have presented significant challenges. To\naddress these issues, this paper introduces MedDiT, a novel\nknowledge-controlled conversational framework that can dynamically generate\nplausible medical images aligned with simulated patient symptoms, enabling\ndiverse diagnostic skill training. Specifically, MedDiT integrates various\npatient Knowledge Graphs (KGs), which describe the attributes and symptoms of\npatients, to dynamically prompt Large Language Models' (LLMs) behavior and\ncontrol the patient characteristics, mitigating hallucination during medical\nconversation. Additionally, a well-tuned Diffusion Transformer (DiT) model is\nincorporated to generate medical images according to the specified patient\nattributes in the KG. In this paper, we present the capabilities of MedDiT\nthrough a practical demonstration, showcasing its ability to act in diverse\nsimulated patient cases and generate the corresponding medical images. This can\nprovide an abundant and interactive learning experience for students, advancing\nmedical education by offering an immersive simulation platform for future\nhealthcare professionals. The work sheds light on the feasibility of\nincorporating advanced technologies like LLM, KG, and DiT in education\napplications, highlighting their potential to address the challenges faced in\nsimulated patient-based medical education.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}