{"id":"2408.09199","title":"TC-RAG:Turing-Complete RAG's Case study on Medical LLM Systems","authors":"Xinke Jiang, Yue Fang, Rihong Qiu, Haoyu Zhang, Yongxin Xu, Hao Chen,\n  Wentao Zhang, Ruizhe Zhang, Yuchen Fang, Xu Chu, Junfeng Zhao, Yasha Wang","authorsParsed":[["Jiang","Xinke",""],["Fang","Yue",""],["Qiu","Rihong",""],["Zhang","Haoyu",""],["Xu","Yongxin",""],["Chen","Hao",""],["Zhang","Wentao",""],["Zhang","Ruizhe",""],["Fang","Yuchen",""],["Chu","Xu",""],["Zhao","Junfeng",""],["Wang","Yasha",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 13:32:32 GMT"}],"updateDate":"2024-08-20","timestamp":1723901552000,"abstract":"  In the pursuit of enhancing domain-specific Large Language Models (LLMs),\nRetrieval-Augmented Generation (RAG) emerges as a promising solution to\nmitigate issues such as hallucinations, outdated knowledge, and limited\nexpertise in highly specialized queries. However, existing approaches to RAG\nfall short by neglecting system state variables, which are crucial for ensuring\nadaptive control, retrieval halting, and system convergence. In this paper, we\nintroduce the TC-RAG through rigorous proof, a novel framework that addresses\nthese challenges by incorporating a Turing Complete System to manage state\nvariables, thereby enabling more efficient and accurate knowledge retrieval. By\nleveraging a memory stack system with adaptive retrieval, reasoning, and\nplanning capabilities, TC-RAG not only ensures the controlled halting of\nretrieval processes but also mitigates the accumulation of erroneous knowledge\nvia Push and Pop actions. In the case study of the medical domain, our\nextensive experiments on real-world healthcare datasets demonstrate the\nsuperiority of TC-RAG over existing methods in accuracy by over 7.20\\%. Our\ndataset and code have been available at\nhttps://https://github.com/Artessay/SAMA.git.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"SXJMtErbrXSPNTc8v4iKqHeUyRVJ5K6baIh-SdV547M","pdfSize":"1035098"}
