{"id":"2408.15419","title":"Bayesian Inference General Procedures for A Single-subject Test Study","authors":"Jie Li, Gary Green, Sarah J. A. Carr, Peng Liu, Jian Zhang","authorsParsed":[["Li","Jie",""],["Green","Gary",""],["Carr","Sarah J. A.",""],["Liu","Peng",""],["Zhang","Jian",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 21:50:11 GMT"},{"version":"v2","created":"Mon, 9 Sep 2024 09:46:04 GMT"},{"version":"v3","created":"Tue, 10 Sep 2024 20:48:04 GMT"}],"updateDate":"2024-09-12","timestamp":1724795411000,"abstract":"  Abnormality detection in the identification of a single-subject which\ndeviates from the majority of the dataset that comes from a control group is a\ncritical problem. A common approach is to assume that the control group can be\ncharacterised in terms of standard Normal statistics and the detection of\nsingle abnormal subject is in that context. But in many situations the control\ngroup can not be described in terms of Normal statistics and the use of\nstandard statistics is inappropriate. This paper presents a Bayesian Inference\nGeneral Procedures for A Single-Subject Test (BIGPAST), designed to mitigate\nthe effects of skewness under the assumption that the dataset of control group\ncomes from the skewed Student's \\( t \\) distribution. BIGPAST operates under\nthe null hypothesis that the single-subject follows the same distribution as\nthe control group. We assess BIGPAST's performance against other methods\nthrough a series of simulation studies. The results demonstrate that BIGPAST is\nrobust against deviations from normality and outperforms the existing\napproaches in terms of accuracy. This is because BIGPAST can effectively reduce\nmodel misspecification errors under the skewed Student's \\( t \\) assumption. We\napply BIGPAST to a MEG dataset consisting of an individual with mild traumatic\nbrain injury and an age and gender-matched control group, demonstrating its\neffectiveness in detecting abnormalities in the single-subject.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8vVsH0KhgrBnlBVMgRKjZIEB-jUy3-vx6Zni_CbWPok","pdfSize":"2005116"}
