{"id":"2408.15458","title":"PersonalizedUS: Interpretable Breast Cancer Risk Assessment with Local\n  Coverage Uncertainty Quantification","authors":"Alek Fr\\\"ohlich, Thiago Ramos, Gustavo Cabello, Isabela Buzatto,\n  Rafael Izbicki, Daniel Tiezzi","authorsParsed":[["Fröhlich","Alek",""],["Ramos","Thiago",""],["Cabello","Gustavo",""],["Buzatto","Isabela",""],["Izbicki","Rafael",""],["Tiezzi","Daniel",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 00:47:55 GMT"}],"updateDate":"2024-08-29","timestamp":1724806075000,"abstract":"  Correctly assessing the malignancy of breast lesions identified during\nultrasound examinations is crucial for effective clinical decision-making.\nHowever, the current \"golden standard\" relies on manual BI-RADS scoring by\nclinicians, often leading to unnecessary biopsies and a significant mental\nhealth burden on patients and their families. In this paper, we introduce\nPersonalizedUS, an interpretable machine learning system that leverages recent\nadvances in conformal prediction to provide precise and personalized risk\nestimates with local coverage guarantees and sensitivity, specificity, and\npredictive values above 0.9 across various threshold levels. In particular, we\nidentify meaningful lesion subgroups where distribution-free, model-agnostic\nconditional coverage holds, with approximately 90% of our prediction sets\ncontaining only the ground truth in most lesion subgroups, thus explicitly\ncharacterizing for which patients the model is most suitably applied. Moreover,\nwe make available a curated tabular dataset of 1936 biopsied breast lesions\nfrom a recent observational multicenter study and benchmark the performance of\nseveral state-of-the-art learning algorithms. We also report a successful case\nstudy of the deployed system in the same multicenter context. Concrete clinical\nbenefits include up to a 65% reduction in requested biopsies among BI-RADS 4a\nand 4b lesions, with minimal to no missed cancer cases.\n","subjects":["Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}