{"id":"2408.11495","title":"Modified Debye-H\\\"{u}ckel-Onsager Theory for Electrical Conductivity in\n  Aqueous Electrolyte Solutions. Nonlocal Electrostatics Approach","authors":"N.N. Kalikin, Yu.A. Budkov","authorsParsed":[["Kalikin","N. N.",""],["Budkov","Yu. A.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 10:11:18 GMT"}],"updateDate":"2024-08-22","timestamp":1724235078000,"abstract":"  The paper presents a nonlocal mean field theory of electrolyte solutions,\nextending the classical Debye-H\\\"{u}ckel-Onsager theory to provide a detailed\ndescription of the electrical conductivity in strong electrolyte solutions. The\ntheory systematically incorporates the effects of ions specificity, such as\nsteric interactions, hydration of ions, and their spatial charge distributions,\ninto the mean-field framework. This allows for calculation of ion mobility and\nelectrical conductivity, while accounting for relaxation and hydrodynamic\nphenomena. At low concentrations, the model reproduces the well-known\nKohlrausch's limiting law. Using the exponential (Slater-type) charge\ndistribution function for solvated ions, we demonstrate that experimental data\non the electrical conductivity of aqueous 1:1, 2:1, and 3:1 electrolyte\nsolutions can be approximated over a broad concentration range by adjusting a\nsingle free parameter representing the spatial scale of the nonlocal ion charge\ndistribution. Using the fitted value of this parameter at 298.15 K, we obtain\ngood agreement with available experimental data when calculating the electrical\nconductivity across different temperatures. We also analyze the effects of\ntemperature and electrolyte concentration on the relaxation and electrophoretic\ncontributions to total electrical conductivity, explaining the underlying\nphysical mechanisms responsible for the observed behavior.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oGipqTt-y0UL1UWS2lE_0OZWDz8bOfVN9679SBTJhso","pdfSize":"1183108"}
