{"id":"2408.16430","title":"Do Recommender Systems Promote Local Music? A Reproducibility Study\n  Using Music Streaming Data","authors":"Kristina Matrosova, Lilian Marey, Guillaume Salha-Galvan, Thomas\n  Louail, Olivier Bodini, Manuel Moussallam","authorsParsed":[["Matrosova","Kristina",""],["Marey","Lilian",""],["Salha-Galvan","Guillaume",""],["Louail","Thomas",""],["Bodini","Olivier",""],["Moussallam","Manuel",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 10:44:59 GMT"}],"updateDate":"2024-08-30","timestamp":1724928299000,"abstract":"  This paper examines the influence of recommender systems on local music\nrepresentation, discussing prior findings from an empirical study on the LFM-2b\npublic dataset. This prior study argued that different recommender systems\nexhibit algorithmic biases shifting music consumption either towards or against\nlocal content. However, LFM-2b users do not reflect the diverse audience of\nmusic streaming services. To assess the robustness of this study's conclusions,\nwe conduct a comparative analysis using proprietary listening data from a\nglobal music streaming service, which we publicly release alongside this paper.\nWe observe significant differences in local music consumption patterns between\nour dataset and LFM-2b, suggesting that caution should be exercised when\ndrawing conclusions on local music based solely on LFM-2b. Moreover, we show\nthat the algorithmic biases exhibited in the original work vary in our dataset,\nand that several unexplored model parameters can significantly influence these\nbiases and affect the study's conclusion on both datasets. Finally, we discuss\nthe complexity of accurately labeling local music, emphasizing the risk of\nmisleading conclusions due to unreliable, biased, or incomplete labels. To\nencourage further research and ensure reproducibility, we have publicly shared\nour dataset and code.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Databases","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}