{"id":"2408.05568","title":"Metacognitive Myopia in Large Language Models","authors":"Florian Scholten, Tobias R. Rebholz, and Mandy H\\\"utter","authorsParsed":[["Scholten","Florian",""],["Rebholz","Tobias R.",""],["Hütter","Mandy",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 14:43:57 GMT"}],"updateDate":"2024-08-13","timestamp":1723301037000,"abstract":"  Large Language Models (LLMs) exhibit potentially harmful biases that\nreinforce culturally inherent stereotypes, cloud moral judgments, or amplify\npositive evaluations of majority groups. Previous explanations mainly\nattributed bias in LLMs to human annotators and the selection of training data.\nConsequently, they have typically been addressed with bottom-up approaches such\nas reinforcement learning or debiasing corpora. However, these methods only\ntreat the effects of LLM biases by indirectly influencing the model\narchitecture, but do not address the underlying causes in the computational\nprocess. Here, we propose metacognitive myopia as a cognitive-ecological\nframework that can account for a conglomerate of established and emerging LLM\nbiases and provide a lever to address problems in powerful but vulnerable\ntools. Our theoretical framework posits that a lack of the two components of\nmetacognition, monitoring and control, causes five symptoms of metacognitive\nmyopia in LLMs: integration of invalid tokens and embeddings, susceptibility to\nredundant information, neglect of base rates in conditional computation,\ndecision rules based on frequency, and inappropriate higher-order statistical\ninference for nested data structures. As a result, LLMs produce erroneous\noutput that reaches into the daily high-stakes decisions of humans. By\nintroducing metacognitive regulatory processes into LLMs, engineers and\nscientists can develop precise remedies for the underlying causes of these\nbiases. Our theory sheds new light on flawed human-machine interactions and\nraises ethical concerns regarding the increasing, imprudent implementation of\nLLMs in organizational structures.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Computers and Society","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Zx8pjvRncZBTo06oXI6F74aWqqyTjXvqc1TSz8dkzQo","pdfSize":"4418731"}
