{"id":"2408.00837","title":"Measuring the ICM velocity structure within the A3266 galaxy cluster","authors":"E. Gatuzz, J. Sanders, A. Liu, A. Fabian, C. Pinto, H. Russell, D.\n  Eckert, S. Walker, J. ZuHone, R. Mohapatra","authorsParsed":[["Gatuzz","E.",""],["Sanders","J.",""],["Liu","A.",""],["Fabian","A.",""],["Pinto","C.",""],["Russell","H.",""],["Eckert","D.",""],["Walker","S.",""],["ZuHone","J.",""],["Mohapatra","R.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 18:00:05 GMT"}],"updateDate":"2024-08-05","timestamp":1722535205000,"abstract":"  We present a detailed analysis of the velocity structure of the hot\nintracluster medium (ICM) within the A3266 galaxy cluster, including new\nobservations taken between June and November 2023. Firstly, morphological\nstructures within the galaxy cluster were examined using a Gaussian Gradient\nMagnitude (GGM) and adaptively smoothed GGM filter applied to the EPIC-pn X-ray\nimage. Then, we applied a novel {\\it XMM-Newton} EPIC-pn energy scale\ncalibration, which uses instrumental Cu K$\\alpha$ as reference for the line\nemission, to measure line-of-sight velocities of the hot gas within the system.\nThis approach enabled us to create two-dimensional projected maps for velocity,\ntemperature, and metallicity, showing that the hot gas displays a redshifted\nsystemic velocity relative to the cluster redshift across all fields of view.\nFurther analysis of the velocity distribution through non-overlapping circular\nregions demonstrated consistent redshifted velocities extending up to 1125 kpc\nfrom the cluster core. Additionally, the velocity distribution was assessed\nalong regions following surface brightness discontinuities, where we observed\nredshifted velocities in all regions, with the largest velocities reaching $768\n\\pm 284$ km/s. Moreover, we computed the velocity Probability Density Function\n(PDF) from the velocity map. We applied a normality test, finding that the PDF\nadheres to an unimodal normal distribution consistent with theoretical\npredictions. Lastly, we computed a velocity structure function (VSF) for this\nsystem using the measured line-of-sight velocities. These insights advance our\nunderstanding of the dynamic processes within the A3266 galaxy cluster and\ncontribute to our broader knowledge of ICM behavior in merging galaxy clusters.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}