{"id":"2408.01106","title":"Slow Voltage Relaxation of Silicon Nanoparticles with a Chemo-Mechanical\n  Core-Shell Model","authors":"Lukas K\\\"obbing, Yannick Kuhn, Birger Horstmann","authorsParsed":[["Köbbing","Lukas",""],["Kuhn","Yannick",""],["Horstmann","Birger",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 08:31:38 GMT"}],"updateDate":"2024-08-05","timestamp":1722587498000,"abstract":"  Silicon presents itself as a high-capacity anode material for lithium-ion\nbatteries with a promising future. The high ability for lithiation comes along\nwith massive volume changes and a problematic voltage hysteresis, causing\nreduced efficiency, detrimental heat generation, and a complicated\nstate-of-charge estimation. During slow cycling, amorphous silicon\nnanoparticles show a larger voltage hysteresis than after relaxation periods.\nInterestingly, the voltage relaxes for at least several days, which has not\nbeen physically explained so far. We apply a chemo-mechanical continuum model\nin a core-shell geometry interpreted as a silicon particle covered by the\nsolid-electrolyte interphase to account for the hysteresis phenomena. The\nsilicon core (de)lithiates during every cycle while the covering shell is\nchemically inactive. The visco-elastoplastic behavior of the shell explains the\nvoltage hysteresis during cycling and after relaxation. We identify a\nlogarithmic voltage relaxation, which fits with the established Garofalo law\nfor viscosity. Our chemo-mechanical model describes the observed voltage\nhysteresis phenomena and outperforms the empirical Plett model. In addition to\nour full model, we present a reduced model to allow for easy voltage profile\nestimations. The presented results support the mechanical explanation of the\nsilicon voltage hysteresis with a core-shell model and encourage further\nefforts into the investigation of the silicon anode mechanics.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}