{"id":"2408.07543","title":"MathScape: Evaluating MLLMs in multimodal Math Scenarios through a\n  Hierarchical Benchmark","authors":"Minxuan Zhou, Hao Liang, Tianpeng Li, Zhiyu Wu, Mingan Lin, Linzhuang\n  Sun, Yaqi Zhou, Yan Zhang, Xiaoqin Huang, Yicong Chen, Yujing Qiao, Weipeng\n  Chen, Bin Cui, Wentao Zhang, Zenan Zhou","authorsParsed":[["Zhou","Minxuan",""],["Liang","Hao",""],["Li","Tianpeng",""],["Wu","Zhiyu",""],["Lin","Mingan",""],["Sun","Linzhuang",""],["Zhou","Yaqi",""],["Zhang","Yan",""],["Huang","Xiaoqin",""],["Chen","Yicong",""],["Qiao","Yujing",""],["Chen","Weipeng",""],["Cui","Bin",""],["Zhang","Wentao",""],["Zhou","Zenan",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 13:23:43 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 04:01:53 GMT"},{"version":"v3","created":"Fri, 23 Aug 2024 14:09:34 GMT"}],"updateDate":"2024-08-26","timestamp":1723641823000,"abstract":"  With the development of Multimodal Large Language Models (MLLMs), the\nevaluation of multimodal models in the context of mathematical problems has\nbecome a valuable research field. Multimodal visual-textual mathematical\nreasoning serves as a critical indicator for evaluating the comprehension and\ncomplex multi-step quantitative reasoning abilities of MLLMs. However, previous\nmultimodal math benchmarks have not sufficiently integrated visual and textual\ninformation. To address this gap, we proposed MathScape, a new benchmark that\nemphasizes the understanding and application of combined visual and textual\ninformation. MathScape is designed to evaluate photo-based math problem\nscenarios, assessing the theoretical understanding and application ability of\nMLLMs through a categorical hierarchical approach. We conduct a\nmulti-dimensional evaluation on 11 advanced MLLMs, revealing that our benchmark\nis challenging even for the most sophisticated models. By analyzing the\nevaluation results, we identify the limitations of MLLMs, offering valuable\ninsights for enhancing model performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}