{"id":"2408.09710","title":"Likelihood inference of the non-stationary Hawkes process with\n  non-exponential kernel","authors":"Tsz-Kit Jeffrey Kwan, Feng Chen, and William Dunsmuir","authorsParsed":[["Kwan","Tsz-Kit Jeffrey",""],["Chen","Feng",""],["Dunsmuir","William",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 05:55:22 GMT"}],"updateDate":"2024-08-20","timestamp":1724046922000,"abstract":"  The Hawkes process is a popular point process model for event sequences that\nexhibit temporal clustering. The intensity process of a Hawkes process consists\nof two components, the baseline intensity and the accumulated excitation effect\ndue to past events, with the latter specified via an excitation kernel. The\nclassical Hawkes process assumes a constant baseline intensity and an\nexponential excitation kernel. This results in an intensity process that is\nMarkovian, a fact that has been used extensively to establish the strong\nconsistency and asymtpotic normality of maximum likelihood estimators or\nsimilar. However, these assumptions can be overly restrictive and unrealistic\nfor modelling the many applications which require the baseline intensity to\nvary with time and the excitation kernel to have non-exponential decay.\nHowever, asymptotic properties of maximum likelihood inference for the\nparameters specifying the baseline intensity and the self-exciting decay under\nthis setup are substantially more difficult since the resulting intensity\nprocess is non-Markovian. To overcome this challenge, we develop an\napproximation procedure to show the intensity process is asymptotically ergodic\nin a suitably defined sense. This allows for the identification of an ergodic\nlimit to the likelihood function and its derivatives, as required for obtaining\nlarge sample inference under minimal regularity conditions.\n","subjects":["Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0r3AgihDp9yJ8Sd69-RfvXgcwa7oRyF_YMZklBGbcP8","pdfSize":"3542369"}
