{"id":"2408.17367","title":"Virgo Filaments. III. The gas content of galaxies in filaments as\n  predicted by the GAEA semi-analytic model","authors":"D. Zakharova, B. Vulcani, G. De Lucia, R. A. Finn, G. Rudnick, F.\n  Combes, G. Castignani, F. Fontanot, P. Jablonka, L. Xie, and M. Hirschmann","authorsParsed":[["Zakharova","D.",""],["Vulcani","B.",""],["De Lucia","G.",""],["Finn","R. A.",""],["Rudnick","G.",""],["Combes","F.",""],["Castignani","G.",""],["Fontanot","F.",""],["Jablonka","P.",""],["Xie","L.",""],["Hirschmann","M.",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 15:55:44 GMT"}],"updateDate":"2024-09-02","timestamp":1725033344000,"abstract":"  Galaxy evolution depends on the environment in which galaxies are located.\nThe various physical processes (ram-pressure stripping, tidal interactions,\netc.) that can affect the gas content in galaxies have different efficiencies\nin different environments. In this work, we examine the gas (atomic \\ce{HI} and\nmolecular \\ce{H2}) content of local galaxies inside and outside clusters,\ngroups, and filaments as well as in isolation using observational and simulated\ndata. We exploited a catalog of galaxies in the Virgo cluster(including the\nsurrounding filaments) and compared the data against the predictions of the\nGalaxy Evolution and Assembly(GAEA) semi-analytic model, which has explicit\nprescriptions for partitioning the cold gas content in its atomic and molecular\nphases. We extracted from the model a mock catalog that mimics the\nobservational biases and one not tailored to observations to study the impact\nof observational limits on the results and predict trends in regimes not\ncovered by the current observations. The observations and simulated data show\nthat galaxies within filaments exhibit intermediate cold gas content between\ngalaxies in clusters and isolation. The amount of \\ce{HI} is typically more\nsensitive to the environment than \\ce{H2} and low-mass galaxies ($\\log_{10}\n[{\\rm M}_{\\star} / \\rm{M}_{\\sun} ] < 10$) are typically more affected than\ntheir massive ($\\log_{10} [{\\rm M}_{\\star} / \\rm{M}_{\\sun} ] > 10$)\ncounterparts. Considering only model data, we identified two distinct\npopulations among filament galaxies present in similar proportions: those\nsimultaneously lying in groups and isolated galaxies. The former has properties\nmore similar to cluster and group galaxies, and the latter is more similar to\nthose of field galaxies. We therefore did not detect filaments' strong effects\non galaxies' gas content, and we ascribe the results to the presence of groups\nin filaments.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}