{"id":"2408.10657","title":"ETGuard: Malicious Encrypted Traffic Detection in Blockchain-based Power\n  Grid Systems","authors":"Peng Zhou, Yongdong Liu, Lixun Ma, Weiye Zhang, Haohan Tan, Zhenguang\n  Liu, Butian Huang","authorsParsed":[["Zhou","Peng",""],["Liu","Yongdong",""],["Ma","Lixun",""],["Zhang","Weiye",""],["Tan","Haohan",""],["Liu","Zhenguang",""],["Huang","Butian",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 08:53:42 GMT"}],"updateDate":"2024-08-21","timestamp":1724144022000,"abstract":"  The escalating prevalence of encryption protocols has led to a concomitant\nsurge in the number of malicious attacks that hide in encrypted traffic. Power\ngrid systems, as fundamental infrastructure, are becoming prime targets for\nsuch attacks. Conventional methods for detecting malicious encrypted packets\ntypically use a static pre-trained model. We observe that these methods are not\nwell-suited for blockchain-based power grid systems. More critically, they fall\nshort in dynamic environments where new types of encrypted attacks continuously\nemerge. Motivated by this, in this paper we try to tackle these challenges from\ntwo aspects: (1) We present a novel framework that is able to automatically\ndetect malicious encrypted traffic in blockchain-based power grid systems and\nincrementally learn from new malicious traffic. (2) We mathematically derive\nincremental learning losses to resist the forgetting of old attack patterns\nwhile ensuring the model is capable of handling new encrypted attack patterns.\nEmpirically, our method achieves state-of-the-art performance on three\ndifferent benchmark datasets. We also constructed the first malicious encrypted\ntraffic dataset for blockchain-based power grid scenario. Our code and dataset\nare available at https://github.com/PPPmzt/ETGuard, hoping to inspire future\nresearch.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}