{"id":"2408.14334","title":"Unconventional superconductivity emerging along with the strange-metal\n  behavior in UAs2 under pressure","authors":"Qing Li, Zhe-Ning Xiang, Bin-Bin Zhang, Ying-Jie Zhang, Chaofan Zhang,\n  Hai-Hu Wen","authorsParsed":[["Li","Qing",""],["Xiang","Zhe-Ning",""],["Zhang","Bin-Bin",""],["Zhang","Ying-Jie",""],["Zhang","Chaofan",""],["Wen","Hai-Hu",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 15:03:01 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 04:29:44 GMT"},{"version":"v3","created":"Wed, 28 Aug 2024 01:43:58 GMT"}],"updateDate":"2024-08-29","timestamp":1724684581000,"abstract":"  The recently discovered spin-triplet superconductor candidate UTe2 with Tc =\n2 K has attracted enormous attention because it possesses many interesting\nproperties, such as the extremely high upper critical field Hc2(0), chiral\nsuperconductivity and spontaneous time-reversal symmetry breaking, etc., all\nthese suggest that it may be the long-sought spin-triplet superconductor. Here\nwe report the discovery of superconductivity up to Tc = 4K in one of its\nsiblings, i.e., UAs2 under high pressures. Interestingly, the UAs2 shows\nmetallic behavior with an antiferromagnetic (AFM) transition at about 274 K\nunder ambient pressure. Upon applying pressure, this transition is pushed down\nto lower temperatures with improved electric conductivity. When the pressure\nrises to about 20-22 GPa, superconductivity occurs together with the emergence\nof a linear temperature dependence of normal state resistance, the latter is a\nhallmark of the strange-metal state. The superconductivity with the highest Tc\n= 4 K is reached under a pressure of about 26.8 GPa, and it is robust against\nmagnetic field with the upper critical field {\\mu}0Hc2(0) ~ 12 T, far beyond\nthe Pauli limit. Higher pressures will suppress the superconductivity and bring\nback the Fermi liquid behavior, showing a clear signature of quantum\ncriticality. Our results open a new avenue for investigating the unconventional\nsuperconductivity concerning the mysterious 5f-band electrons in this\nuranium-based system.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/"}