{"id":"2408.11925","title":"An Open Knowledge Graph-Based Approach for Mapping Concepts and\n  Requirements between the EU AI Act and International Standards","authors":"Julio Hernandez, Delaram Golpayegani, Dave Lewis","authorsParsed":[["Hernandez","Julio",""],["Golpayegani","Delaram",""],["Lewis","Dave",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 18:21:09 GMT"}],"updateDate":"2024-08-23","timestamp":1724264469000,"abstract":"  The many initiatives on trustworthy AI result in a confusing and multipolar\nlandscape that organizations operating within the fluid and complex\ninternational value chains must navigate in pursuing trustworthy AI. The EU's\nAI Act will now shift the focus of such organizations toward conformance with\nthe technical requirements for regulatory compliance, for which the Act relies\non Harmonized Standards. Though a high-level mapping to the Act's requirements\nwill be part of such harmonization, determining the degree to which standards\nconformity delivers regulatory compliance with the AI Act remains a complex\nchallenge. Variance and gaps in the definitions of concepts and how they are\nused in requirements between the Act and harmonized standards may impact the\nconsistency of compliance claims across organizations, sectors, and\napplications. This may present regulatory uncertainty, especially for SMEs and\npublic sector bodies relying on standards conformance rather than proprietary\nequivalents for developing and deploying compliant high-risk AI systems. To\naddress this challenge, this paper offers a simple and repeatable mechanism for\nmapping the terms and requirements relevant to normative statements in\nregulations and standards, e.g., AI Act and ISO management system standards,\ntexts into open knowledge graphs. This representation is used to assess the\nadequacy of standards conformance to regulatory compliance and thereby provide\na basis for identifying areas where further technical consensus development in\ntrustworthy AI value chains is required to achieve regulatory compliance.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sHhriKaE-nSgbFtGvun7m4TgrazTrndMocoeNl0qREA","pdfSize":"1084877"}
