{"id":"2408.15509","title":"Ice Chemistry Modeling of Active Phase Comets: Hale-Bopp","authors":"Eric R. Willis and Drew A. Christianson and Robin T. Garrod","authorsParsed":[["Willis","Eric R.",""],["Christianson","Drew A.",""],["Garrod","Robin T.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 03:43:36 GMT"}],"updateDate":"2024-08-29","timestamp":1724816616000,"abstract":"  We present a chemical kinetics model of the solid-phase chemical evolution of\na comet, beginning with a long period of cold-storage in the Oort Cloud,\nfollowed by five orbits that bring the comet close to the Sun. The chemical\nmodel is based on an earlier treatment that considered only the cold-storage\nphase, and which was based on the interstellar ice chemical kinetics model\nMAGICKAL. The comet is treated as 25 chemically distinct layers. Updates to the\nprevious model includes: (i) Time- and depth-dependent temperature profiles\naccording to heliocentric distance; (ii) a rigorous treatment of back-diffusion\nfor species capable of diffusing through the bulk-ice layers; (iii) adoption of\nrecent improvements in the kinetic treatment of nondiffusive chemical reaction\nrates. Starting from an initially simple ice composition, interstellar UV\nphotons drive a rapid chemistry in the upper micron of material, but diminished\nby absorption of the UV by the dust component. Galactic cosmic rays (GCRs)\ndrive a much slower chemistry in the deeper ices over the long cold-storage\nperiod down to 10 m. The first solar approach drives off the upper layers of\nice material via thermal desorption and/or dissociation, bringing closer to the\nsurface the deeper material that previously underwent long-term processing by\nGCRs. Subsequent orbits are more uniform in their chemical behavior. Loss of\nmolecular material leads to concentration of the dust in the upper layers.\nSubstantial quantities of complex organic molecules are formed in the upper 10\nm during the cold storage phase, with some of this material released during\nsolar approach; however, their abundances with respect to water appear too low\nto account for the observed gas-phase values for comet Hale-Bopp, indicating\nthat the majority of complex molecular material observed, at least in comet\nHale-Bopp, is an inheritance of primordial material.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"W9CQ0rglg2R7LpZGLJwyFR194UKpD1M0kt3HIpnMJHE","pdfSize":"8063232"}
