{"id":"2408.04404","title":"Transverse instability of electron-acoustic solitons in a relativistic\n  degenerate astrophysical magnetoplasma","authors":"A. P. Misra and A. Abdikian","authorsParsed":[["Misra","A. P.",""],["Abdikian","A.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 12:13:09 GMT"}],"updateDate":"2024-08-09","timestamp":1723119189000,"abstract":"  We study the nonlinear theory of small-amplitude electron-acoustic solitons\n(EASs) in a relativistic astrophysical magnetoplasma consisting of\ntwo-temperature electrons: a sparse population of relativistic nondegenerate\nclassical electrons and a group of fully degenerate dense relativistic\nelectrons (main constituent) immersed in a static magnetic field with a\nneutralizing stationary ion background. By using the multiple-scale reductive\nperturbation technique with the Lorentz transformation, the Zakharov-Kuznetsov\n(ZK) and the modified Zakharov-Kuznetsov (mZK) equations are derived to\ndescribe the evolution of EASs in two different regimes of relativistic\ndegeneracy: $r_{d0}<50$ and $r_{d0}\\gtrsim50$. The characteristics of the plane\nsoliton solutions of ZK and mZK equations and the soliton energy are studied.\nWe show that the solitons moving at an angle $\\alpha$ to the external magnetic\nfield can be unstable under transverse long-wavelength perturbations. The\ngrowth rates of instabilities are obtained and analyzed with the effects of the\nrelativity parameter $\\beta_{\\rm{cl}}=k_BT_{\\rm{cl}}/m_ec^2$ and the degeneracy\nparameter $r_{d0}$, where $k_B$ is the Boltzmann constant and $T_{\\rm{cl}}$ is\nthe temperature of classical electrons. Interestingly, the ZK solitons, even if\nit is stable for the first-order perturbations, can be unstable in the\nsecond-order correction. Furthermore, while the first-order growth rates of\nperturbations for ZK solitons tend to vanish as $\\alpha\\rightarrow 38^\\circ$,\nthat for the mZK soliton goes to zero as $\\alpha\\rightarrow 90^\\circ$. However,\ndepending on the angle $\\alpha$, the growth rates are found to be reduced\neither by increasing the values of $\\beta_{\\rm{cl}}$ or by decreasing the\nvalues of $r_{d0}$. The applications of our results to astrophysical plasmas,\nsuch as those in the environments of white dwarfs are discussed.\n","subjects":["Physics/Plasma Physics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"VJD7FQxmkfLET7nHqyhq0Yssvi5U6a5VGw7JVfwDYN8","pdfSize":"1799005"}
