{"id":"2408.11445","title":"Verifying Approximate Equilibrium in Auctions","authors":"Fabian R. Pieroth and Tuomas Sandholm","authorsParsed":[["Pieroth","Fabian R.",""],["Sandholm","Tuomas",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 08:55:26 GMT"}],"updateDate":"2024-08-22","timestamp":1724230526000,"abstract":"  In practice, most auction mechanisms are not strategy-proof, so equilibrium\nanalysis is required to predict bidding behavior. In many auctions, though, an\nexact equilibrium is not known and one would like to understand whether --\nmanually or computationally generated -- bidding strategies constitute an\napproximate equilibrium. We develop a framework and methods for estimating the\ndistance of a strategy profile from equilibrium, based on samples from the\nprior and either bidding strategies or sample bids. We estimate an agent's\nutility gain from deviating to strategies from a constructed finite subset of\nthe strategy space. We use PAC-learning to give error bounds, both for\nindependent and interdependent prior distributions. The primary challenge is\nthat one may miss large utility gains by considering only a finite subset of\nthe strategy space. Our work differs from prior research in two critical ways.\nFirst, we explore the impact of bidding strategies on altering opponents'\nperceived prior distributions -- instead of assuming the other agents to bid\ntruthfully. Second, we delve into reasoning with interdependent priors, where\nthe type of one agent may imply a distinct distribution for other agents. Our\nmain contribution lies in establishing sufficient conditions for strategy\nprofiles and a closeness criterion for conditional distributions to ensure that\nutility gains estimated through our finite subset closely approximate the\nmaximum gains. To our knowledge, ours is the first method to verify approximate\nequilibrium in any auctions beyond single-item ones. Also, ours is the first\nsample-based method for approximate equilibrium verification.\n","subjects":["Computing Research Repository/Computer Science and Game Theory","Economics/Theoretical Economics"],"license":"http://creativecommons.org/licenses/by/4.0/"}