{"id":"2408.00609","title":"Nanohertz gravitational waves from a quasar-based supermassive black\n  hole binary population model as dark sirens","authors":"Si-Ren Xiao, Yue Shao, Ling-Feng Wang, Ji-Yu Song, Lu Feng, Jing-Fei\n  Zhang, Xin Zhang","authorsParsed":[["Xiao","Si-Ren",""],["Shao","Yue",""],["Wang","Ling-Feng",""],["Song","Ji-Yu",""],["Feng","Lu",""],["Zhang","Jing-Fei",""],["Zhang","Xin",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 14:48:01 GMT"}],"updateDate":"2024-08-02","timestamp":1722523681000,"abstract":"  Recently, several pulsar timing array (PTA) projects have detected evidence\nof the existence of a stochastic gravitational wave background (SGWB) in the\nnanohertz frequency band, providing confidence in detecting individual\nsupermassive black hole binaries (SMBHBs) in the future. Nanohertz GWs emitted\nby inspiraling SMBHBs encode the luminosity distances of SMBHBs. They can serve\nas dark sirens to explore the cosmic expansion history via a statistical method\nto obtain the redshift information of GW sources' host galaxies using galaxy\ncatalogs. The theoretical analysis of the dark siren method relies on the\nmodeling of the population of SMBHBs. Using a population model consistent with\nthe latest SGWB observations is essential, as the SGWB provides significant\ninformation about the distribution of SMBHBs. In this work, we employ a\nquasar-based model, which can self-consistently account for the SGWB amplitude,\nto estimate the population of SMBHBs. We constrain the Hubble constant using\nthe mock GW data from different detection cases of PTAs in the future. Our\nresults show that a PTA consisting of 100 pulsars with a white noise level of\n20 ns could measure the Hubble constant with a precision close to $1\\%$ over a\n10-year observation period, and a PTA with 200 pulsars may achieve this goal\nover a 5-year observation period. The results indicate that modeling the SMBHB\npopulation significantly influences the analysis of dark sirens, and SMBHB dark\nsirens have the potential to be developed as a valuable cosmological probe.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}