{"id":"2408.06605","title":"Wormhole Geometries Supported by Strange Quark Matter and Phantom-like\n  Generalized Chaplygin gas within $f(Q)$ Gravity","authors":"Sneha Pradhan, Zinnat Hassan, P.K. Sahoo","authorsParsed":[["Pradhan","Sneha",""],["Hassan","Zinnat",""],["Sahoo","P. K.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 03:37:30 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 10:05:01 GMT"}],"updateDate":"2024-08-20","timestamp":1723520250000,"abstract":"  A crucial aspect of wormhole (WH) physics is the inclusion of exotic matter,\nwhich requires violating the null energy condition. Here, we explore the\npotential for WHs to be sustained by quark matter under conditions of extreme\ndensity along with the phantom-like generalized cosmic Chaplygin gas (GCCG) in\nsymmetric teleparallel gravity. Theoretical and experimental studies on baryon\nstructures indicate that strange quark matter, composed of u (up), d (down),\nand s (strange) quarks, represents the most energy-efficient form of baryonic\nmatter. Drawing from these theoretical insights, we use the Massachusetts\nInstitute of Technology (MIT) bag model equation of state to characterize\nordinary quark matter. By formulating specific configurations for the bag\nparameter, we develop several WH models corresponding to different shape\nfunctions for the isotropic and anisotropic cases. Our analysis strongly\nsuggests that an isotropic WH is not theoretically possible. Furthermore, we\ninvestigate traversable WH solutions utilizing a phantom-like GCCG, examining\ntheir feasibility. This equation of state, capable of violating the null energy\ncondition, can elucidate late-time cosmic acceleration through various\nbeneficial parameters. In this framework, we derive WH solutions for both\nconstant and variable redshift functions. We have employed the volume integral\nquantifier (VIQ) method for both studies to assess the quantity of exotic\nmatter. Furthermore, we have done the equilibrium analysis through the\nTolman-Oppenheimer-Volkoff (TOV) equation, which supports the viability of our\nconstructed WH model.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Oo5mk8cfBWaZPM_GJF-fCKYEdIRsYlk5HP5IbuQK93k","pdfSize":"2632208"}
