{"id":"2408.14588","title":"$\\chi^2$ from Redundant Calibration as a Tool in the Detection of Faint\n  Radio-frequency Interference","authors":"Theodora Kunicki, Jonathan C. Pober","authorsParsed":[["Kunicki","Theodora",""],["Pober","Jonathan C.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 19:17:25 GMT"}],"updateDate":"2024-08-28","timestamp":1724699845000,"abstract":"  Radio-frequency interference detection and flagging is one of the most\ndifficult and urgent problems in 21 cm Epoch of Reionization research. In this\nwork, we present $\\chi^2$ from redundant calibration as a novel method for RFI\ndetection and flagging, demonstrating it to be complementary to current\nstate-of-the-art flagging algorithms. Beginning with a brief overview of\nredundant calibration and the meaning of the $\\chi^2$ metric, we demonstrate a\ntwo-step RFI flagging algorithm which uses the values of this metric to detect\nfaint RFI. We find that roughly 27.4\\% of observations have RFI from digital\ntelevision channel 7 detected by at least one algorithm of the three tested:\n18.0\\% of observations are flagged by the novel $\\chi^2$ algorithm, 16.5\\% are\nflagged by SSINS, and 6.8\\% are flagged by AOFlagger (there is significant\noverlap in these percentages). Of the 27.4\\% of observations with detected DTV\nchannel 7 RFI, 37.1\\% (10.2\\% of the total observations) are detected by\n$\\chi^2$ alone, and not by either SSINS or AOFlagger, demonstrating a\nsignificant population of as-yet undetected RFI. We find that $\\chi^2$ is able\nto detect RFI events which remain undetectable to SSINS and AOFlagger,\nespecially in the domain of long-duration, weak RFI from digital television. We\nalso discuss the shortcomings of this approach, and discuss examples of RFI\nwhich seems undetectable using $\\chi^2$ while being successfully flagged by\nSSINS and/or AOFlagger.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}