{"id":"2408.11620","title":"Annealed Sinkhorn for Optimal Transport: convergence, regularization\n  path and debiasing","authors":"L\\'ena\\\"ic Chizat","authorsParsed":[["Chizat","Lénaïc",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 13:47:01 GMT"}],"updateDate":"2024-08-22","timestamp":1724248021000,"abstract":"  Sinkhorn's algorithm is a method of choice to solve large-scale optimal\ntransport (OT) problems. In this context, it involves an inverse temperature\nparameter $\\beta$ that determines the speed-accuracy trade-off. To improve this\ntrade-off, practitioners often use a variant of this algorithm, Annealed\nSinkhorn, that uses an nondecreasing sequence $(\\beta_t)_{t\\in \\mathbb{N}}$\nwhere $t$ is the iteration count. However, besides for the schedule\n$\\beta_t=\\Theta(\\log t)$ which is impractically slow, it is not known whether\nthis variant is guaranteed to actually solve OT. Our first contribution answers\nthis question: we show that a concave annealing schedule asymptotically solves\nOT if and only if $\\beta_t\\to+\\infty$ and $\\beta_t-\\beta_{t-1}\\to 0$. The proof\nis based on an equivalence with Online Mirror Descent and further suggests that\nthe iterates of Annealed Sinkhorn follow the solutions of a sequence of\nrelaxed, entropic OT problems, the regularization path. An analysis of this\npath reveals that, in addition to the well-known \"entropic\" error in\n$\\Theta(\\beta^{-1}_t)$, the annealing procedure induces a \"relaxation\" error in\n$\\Theta(\\beta_{t}-\\beta_{t-1})$. The best error trade-off is achieved with the\nschedule $\\beta_t = \\Theta(\\sqrt{t})$ which, albeit slow, is a universal\nlimitation of this method. Going beyond this limitation, we propose a simple\nmodification of Annealed Sinkhorn that reduces the relaxation error, and\ntherefore enables faster annealing schedules. In toy experiments, we observe\nthe effectiveness of our Debiased Annealed Sinkhorn's algorithm: a single run\nof this algorithm spans the whole speed-accuracy Pareto front of the standard\nSinkhorn's algorithm.\n","subjects":["Computing Research Repository/Machine Learning","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}