{"id":"2408.11446","title":"Green Probabilistic Semantic Communication over Wireless Networks","authors":"Ruopeng Xu, Zhaohui Yang, Yijie Mao, Chongwen Huang, Qianqian Yang,\n  Lexi Xu, Wei Xu and Zhaoyang Zhang","authorsParsed":[["Xu","Ruopeng",""],["Yang","Zhaohui",""],["Mao","Yijie",""],["Huang","Chongwen",""],["Yang","Qianqian",""],["Xu","Lexi",""],["Xu","Wei",""],["Zhang","Zhaoyang",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 08:58:53 GMT"}],"updateDate":"2024-08-22","timestamp":1724230733000,"abstract":"  In this paper, we propose a multi-user green semantic communication system\nfacilitated by a probabilistic knowledge graph (PKG). By integrating\nprobability into the knowledge graph, we enable probabilistic semantic\ncommunication (PSC) and represent semantic information accordingly. On this\nbasis, a semantic compression model designed for multi-user downlink\ntask-oriented communication is introduced, utilizing the semantic compression\nratio (SCR) as a parameter to connect the computation and communication\nprocesses of information transmission. Based on the rate-splitting multiple\naccess (RSMA) technology, we derive mathematical expressions for system\ntransmission energy consumption and related formulations. Subsequently, the\nmulti-user green semantic communication system is modeled and the optimal\nproblem with the goal of minimizing system energy consumption comprehensively\nconsidering the computation and communication process under given constrains is\nformulated. In order to address the optimal problem, we propose an alternating\noptimization algorithm that tackles sub-problems of power allocation and\nbeamforming design, semantic compression ratio, and computation capacity\nallocation. Simulation results validate the effectiveness of our approach,\ndemonstrating the superiority of our system over methods using Space Division\nMultiple Access (SDMA) and non-orthogonal multiple access (NOMA) instead of\nRSMA, and highlighting the benefits of our PSC compression model.\n","subjects":["Computing Research Repository/Emerging Technologies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}