{"id":"2408.09284","title":"Lasing on hybridized soliton frequency combs","authors":"Theodore P. Letsou, Dmitry Kazakov, Pawan Ratra, Lorenzo L. Columbo,\n  Massimo Brambilla, Franco Prati, Cristina Rimoldi, Sandro Dal Cin, Nikola\n  Opa\\v{c}ak, Henry O. Everitt, Marco Piccardo, Benedikt Schwarz, and Federico\n  Capasso","authorsParsed":[["Letsou","Theodore P.",""],["Kazakov","Dmitry",""],["Ratra","Pawan",""],["Columbo","Lorenzo L.",""],["Brambilla","Massimo",""],["Prati","Franco",""],["Rimoldi","Cristina",""],["Cin","Sandro Dal",""],["Opačak","Nikola",""],["Everitt","Henry O.",""],["Piccardo","Marco",""],["Schwarz","Benedikt",""],["Capasso","Federico",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 20:12:35 GMT"}],"updateDate":"2024-08-20","timestamp":1723925555000,"abstract":"  Coupling is an essential mechanism that drives complexity in natural systems,\ntransforming single, non-interacting elements into intricate networks with rich\nphysical properties. Here, we demonstrate a chip-scale coupled laser system\nthat exhibits complex optical states impossible to achieve in an uncoupled\nsystem. We show that a pair of coupled semiconductor ring lasers spontaneously\nforms a frequency comb consisting of the hybridized modes of its coupled\ncavity, exhibiting a large number of phase-locked tones that anticross with one\nanother. Experimental coherent waveform reconstruction reveals that the\nhybridized frequency comb manifests itself as pairs of bright and dark\npicosecond-long solitons circulating simultaneously. The dark and bright\nsolitons exit the coupled cavity at the same time, leading to breathing bright\nsolitons temporally overlapped with their dark soliton counterparts - a state\ninaccessible for a single, free-running laser. Our results demonstrate that the\nrules that govern allowable states of light can be broken by simply coupling\nelements together, paving the way for the design of more complex networks of\ncoupled on-chip lasers.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yRVtHJcnYMU6iAqQvYtpq5tAVexl_7biQblait5sdUc","pdfSize":"1474948"}
