{"id":"2408.17073","title":"Approximately Invertible Neural Network for Learned Image Compression","authors":"Yanbo Gao, Meng Fu, Shuai Li, Chong Lv, Xun Cai, Hui Yuan, Mao Ye","authorsParsed":[["Gao","Yanbo",""],["Fu","Meng",""],["Li","Shuai",""],["Lv","Chong",""],["Cai","Xun",""],["Yuan","Hui",""],["Ye","Mao",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 07:57:47 GMT"}],"updateDate":"2024-09-02","timestamp":1725004667000,"abstract":"  Learned image compression have attracted considerable interests in recent\nyears. It typically comprises an analysis transform, a synthesis transform,\nquantization and an entropy coding model. The analysis transform and synthesis\ntransform are used to encode an image to latent feature and decode the\nquantized feature to reconstruct the image, and can be regarded as coupled\ntransforms. However, the analysis transform and synthesis transform are\ndesigned independently in the existing methods, making them unreliable in\nhigh-quality image compression. Inspired by the invertible neural networks in\ngenerative modeling, invertible modules are used to construct the coupled\nanalysis and synthesis transforms. Considering the noise introduced in the\nfeature quantization invalidates the invertible process, this paper proposes an\nApproximately Invertible Neural Network (A-INN) framework for learned image\ncompression. It formulates the rate-distortion optimization in lossy image\ncompression when using INN with quantization, which differentiates from using\nINN for generative modelling. Generally speaking, A-INN can be used as the\ntheoretical foundation for any INN based lossy compression method. Based on\nthis formulation, A-INN with a progressive denoising module (PDM) is developed\nto effectively reduce the quantization noise in the decoding. Moreover, a\nCascaded Feature Recovery Module (CFRM) is designed to learn high-dimensional\nfeature recovery from low-dimensional ones to further reduce the noise in\nfeature channel compression. In addition, a Frequency-enhanced Decomposition\nand Synthesis Module (FDSM) is developed by explicitly enhancing the\nhigh-frequency components in an image to address the loss of high-frequency\ninformation inherent in neural network based image compression. Extensive\nexperiments demonstrate that the proposed A-INN outperforms the existing\nlearned image compression methods.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xEwEgz_iUxG6XmYAq6nRBWDc8w6bvD6zkS3I7xhAHv8","pdfSize":"8472049"}
