{"id":"2408.05265","title":"Projection-to-Born-improved Subtractions at NNLO","authors":"John Campbell, Tobias Neumann, and Gherardo Vita","authorsParsed":[["Campbell","John",""],["Neumann","Tobias",""],["Vita","Gherardo",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-13","timestamp":1723226400000,"abstract":"  While the current frontier in fixed-order precision for collider observables\nis N$^3$LO, important steps are necessary to consolidate NNLO cross-section\npredictions with improved stability and efficiency. Slicing methods have been\nsuccessfully applied to obtain NNLO and N$^3$LO predictions, but have shown\npoor performance in the presence of fiducial cuts due to large kinematical\npower corrections. In this paper we implement Projection-to-Born-improved $q_T$\n(P2B $q_T$) and jettiness (P2B $\\tau_0$) subtractions for a large class of\ncolor singlet processes in MCFM. This method allows for the efficient\nevaluation of \\emph{fiducial} power corrections in any non-local subtraction\nscheme using a Projection-to-Born subtraction. We demonstrate the significant\nnumerical improvements of this method based on fiducial Drell-Yan and Higgs\ncross-sections. Moreover, with fiducial power corrections removed via this\nmethod, the leading-logarithmic power corrections that have only been\ncalculated without fiducial cuts can be included, further improving the\ncalculations. For di-photon production with photon isolation, we devise a novel\nmethod in combination with P2B-improved subtractions, which we name\n$P2B_\\gamma$ $\\tau_0$, and $P2B_\\gamma$ $q_T$ for the two subtraction schemes,\nrespectively. This method allows the inclusion of both fiducial power\ncorrections due to kinematic cuts on the photons and a set of isolation power\ncorrections in the fragmentation channel where a quark may enter the isolation\ncone. We find significant improvements in the convergence of NNLO di-photon\ncross-sections with photon isolation cuts, demonstrating that it is possible to\nachieve a stable and efficient calculation of di-photon cross-sections using\nslicing methods.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IuxNhXSokn8e9_Dg7thd6FF5k6iX1j_bWEAOfMGhnK0","pdfSize":"2073264"}
