{"id":"2408.11191","title":"Active Learning of Molecular Data for Task-Specific Objectives","authors":"Kunal Ghosh, Milica Todorovi\\'c, Aki Vehtari, Patrick Rinke","authorsParsed":[["Ghosh","Kunal",""],["Todorović","Milica",""],["Vehtari","Aki",""],["Rinke","Patrick",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 20:50:29 GMT"}],"updateDate":"2024-08-22","timestamp":1724187029000,"abstract":"  Active learning (AL) has shown promise for being a particularly\ndata-efficient machine learning approach. Yet, its performance depends on the\napplication and it is not clear when AL practitioners can expect computational\nsavings. Here, we carry out a systematic AL performance assessment for three\ndiverse molecular datasets and two common scientific tasks: compiling compact,\ninformative datasets and targeted molecular searches. We implemented AL with\nGaussian processes (GP) and used the many-body tensor as molecular\nrepresentation. For the first task, we tested different data acquisition\nstrategies, batch sizes and GP noise settings. AL was insensitive to the\nacquisition batch size and we observed the best AL performance for the\nacquisition strategy that combines uncertainty reduction with clustering to\npromote diversity. However, for optimal GP noise settings, AL did not\noutperform randomized selection of data points. Conversely, for targeted\nsearches, AL outperformed random sampling and achieved data savings up to 64%.\nOur analysis provides insight into this task-specific performance difference in\nterms of target distributions and data collection strategies. We established\nthat the performance of AL depends on the relative distribution of the target\nmolecules in comparison to the total dataset distribution, with the largest\ncomputational savings achieved when their overlap is minimal.\n","subjects":["Computing Research Repository/Machine Learning","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"qFmWjEo3bc9JlXoXuAClaOuAw5yBidnCuVMDk-GEeA4","pdfSize":"2733500"}
