{"id":"2408.03913","title":"AdapMTL: Adaptive Pruning Framework for Multitask Learning Model","authors":"Mingcan Xiang, Steven Jiaxun Tang, Qizheng Yang, Hui Guan, Tongping\n  Liu","authorsParsed":[["Xiang","Mingcan",""],["Tang","Steven Jiaxun",""],["Yang","Qizheng",""],["Guan","Hui",""],["Liu","Tongping",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 17:19:15 GMT"}],"updateDate":"2024-08-08","timestamp":1723051155000,"abstract":"  In the domain of multimedia and multimodal processing, the efficient handling\nof diverse data streams such as images, video, and sensor data is paramount.\nModel compression and multitask learning (MTL) are crucial in this field,\noffering the potential to address the resource-intensive demands of processing\nand interpreting multiple forms of media simultaneously. However, effectively\ncompressing a multitask model presents significant challenges due to the\ncomplexities of balancing sparsity allocation and accuracy performance across\nmultiple tasks. To tackle these challenges, we propose AdapMTL, an adaptive\npruning framework for MTL models. AdapMTL leverages multiple learnable soft\nthresholds independently assigned to the shared backbone and the task-specific\nheads to capture the nuances in different components' sensitivity to pruning.\nDuring training, it co-optimizes the soft thresholds and MTL model weights to\nautomatically determine the suitable sparsity level at each component to\nachieve both high task accuracy and high overall sparsity. It further\nincorporates an adaptive weighting mechanism that dynamically adjusts the\nimportance of task-specific losses based on each task's robustness to pruning.\nWe demonstrate the effectiveness of AdapMTL through comprehensive experiments\non popular multitask datasets, namely NYU-v2 and Tiny-Taskonomy, with different\narchitectures, showcasing superior performance compared to state-of-the-art\npruning methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"38YbM8bVcZNk8SUvvXgsnIaAoZ8KAVTkTBhO_bB0U64","pdfSize":"1345470"}
