{"id":"2408.06243","title":"Complexity of trust-region methods in the presence of unbounded Hessian\n  approximations","authors":"Youssef Diouane and Mohamed Laghdaf Habiboullah and Dominique Orban","authorsParsed":[["Diouane","Youssef",""],["Habiboullah","Mohamed Laghdaf",""],["Orban","Dominique",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 15:50:21 GMT"}],"updateDate":"2024-08-13","timestamp":1723477821000,"abstract":"  We extend traditional complexity analyses of trust-region methods for\nunconstrained, possibly nonconvex, optimization. Whereas most complexity\nanalyses assume uniform boundedness of the model Hessians, we work with\npotentially unbounded model Hessians. Boundedness is not guaranteed in\npractical implementations, in particular ones based on quasi-Newton updates\nsuch as PSB, BFGS and SR1. Our analysis is conducted for a family of\ntrust-region methods that includes most known methods as special cases. We\nexamine two regimes of Hessian growth: one bounded by a power of the number of\nsuccessful iterations, and one bounded by a power of the number of iterations.\nThis allows us to formalize and confirm the profound intuition of Powell [IMA\nJ. Numer. Ana. 30(1):289-301,2010], who studied convergence under a special\ncase of our assumptions, but whose proof contained complexity arguments.\nSpecifically, for \\(0 \\leq p < 1\\), we establish sharp\n\\(O(\\epsilon^{-2/(1-p)})\\) evaluation complexity to find an\n\\(\\epsilon\\)-stationary point when model Hessians are \\(O(k^p)\\), where \\(k\\)\nis the iteration counter. For \\(p = 1\\), which is the case studied by Powell,\nwe establish a sharp \\(O(\\exp(c\\epsilon^{-2}))\\) evaluation complexity for a\ncertain constant \\(c > 0\\). This is as Powell suspected and is far worse than\nother bounds surmised elsewhere in the literature. We establish similar bounds\nwhen model Hessians are \\(O(|\\mathcal{S}_k|^p)\\), where \\(|\\mathcal{S}_k|\\) is\nthe number of iterations where the step was accepted, up to iteration \\(k\\). To\nthe best of our knowledge, ours is the first work to provide complexity bounds\nwhen model Hessians grow linearly with \\(|\\mathcal{S}_k|\\) or at most linearly\nwith \\(k\\), which covers multiple quasi-Newton approximations.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}