{"id":"2408.00739","title":"Investigating the role of nuclear parameters on oscillation modes in hot\n  Neutron Stars","authors":"Nilaksha Barman, Bikram Keshari Pradhan and Debarati Chatterjee","authorsParsed":[["Barman","Nilaksha",""],["Pradhan","Bikram Keshari",""],["Chatterjee","Debarati",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 17:38:47 GMT"}],"updateDate":"2024-08-02","timestamp":1722533927000,"abstract":"  Recent studies have revealed that certain nuclear parameters are more\ndominant than others in governing global neutron star properties, such as its\nstructure or oscillation mode characteristics. Although neutron stars can in\ngeneral assumed to be cold, in astrophysical scenarios such as newly born\nneutron stars or remnants of binary neutron star mergers, finite temperature\neffects play a non-negligible role. In this work, we perform a consistent and\nsystematic investigation of the role of nuclear parameters and thermal effects\non neutron star properties and fluid oscillation modes within a full general\nrelativistic scheme. We impose constraints on the parameter space of the\nrelativistic mean field model using state-of-the-art information from\nterrestrial experiments and multi-messenger astrophysical data. We find\neffective nucleon mass to be the most important nuclear parameter controlling\nastrophysical observables of hot neutron stars, similar to the cold beta\nequilibrated matter. However, we conclude that the interplay among saturation\nproperties and astrophysical observables depends not only on the thermal\nconfigurations considered but also on the constraints imposed. We also\ninvestigated the role of nuclear saturation parameters on some universal\nrelations for hot NSs which are important in gravitational wave\nasteroseismology. Our investigation confirmed that these relations are mostly\ninsensitive to nuclear saturation properties and mainly affected by variation\nof charge fraction in the star.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology","Physics/Nuclear Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}