{"id":"2408.12483","title":"Not All Samples Should Be Utilized Equally: Towards Understanding and\n  Improving Dataset Distillation","authors":"Shaobo Wang, Yantai Yang, Qilong Wang, Kaixin Li, Linfeng Zhang, and\n  Junchi Yan","authorsParsed":[["Wang","Shaobo",""],["Yang","Yantai",""],["Wang","Qilong",""],["Li","Kaixin",""],["Zhang","Linfeng",""],["Yan","Junchi",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 15:20:32 GMT"}],"updateDate":"2024-08-23","timestamp":1724340032000,"abstract":"  Dataset Distillation (DD) aims to synthesize a small dataset capable of\nperforming comparably to the original dataset. Despite the success of numerous\nDD methods, theoretical exploration of this area remains unaddressed. In this\npaper, we take an initial step towards understanding various matching-based DD\nmethods from the perspective of sample difficulty. We begin by empirically\nexamining sample difficulty, measured by gradient norm, and observe that\ndifferent matching-based methods roughly correspond to specific difficulty\ntendencies. We then extend the neural scaling laws of data pruning to DD to\ntheoretically explain these matching-based methods. Our findings suggest that\nprioritizing the synthesis of easier samples from the original dataset can\nenhance the quality of distilled datasets, especially in low IPC\n(image-per-class) settings. Based on our empirical observations and theoretical\nanalysis, we introduce the Sample Difficulty Correction (SDC) approach,\ndesigned to predominantly generate easier samples to achieve higher dataset\nquality. Our SDC can be seamlessly integrated into existing methods as a plugin\nwith minimal code adjustments. Experimental results demonstrate that adding SDC\ngenerates higher-quality distilled datasets across 7 distillation methods and 6\ndatasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"v2jibf88Nodl3B8LWbSL5g10GHLYpag9O-JCHd5Mx_0","pdfSize":"12426144"}
