{"id":"2408.14239","title":"Tension-induced giant actuation in unstructured elastic sheets","authors":"Kexin Guo, Marc Su\\~n\\'e, Kwok Ming Li, K. Jimmy Hsia, Mingchao Liu\n  and Dominic Vella","authorsParsed":[["Guo","Kexin",""],["Suñé","Marc",""],["Li","Kwok Ming",""],["Hsia","K. Jimmy",""],["Liu","Mingchao",""],["Vella","Dominic",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 12:52:32 GMT"}],"updateDate":"2024-08-27","timestamp":1724676752000,"abstract":"  Buckling is normally associated with a compressive load applied to a slender\nstructure; from railway tracks in extreme heat [1] to microtubules in cytoplasm\n[2], axial compression is relieved by out-of-plane buckling. However, recent\nstudies have demonstrated that tension applied to structured thin sheets leads\nto transverse motion that may be harnessed for novel applications. For\ninstance, tension in one direction can actuate motion in an orthogonal\ndirection, enabling the creation of kirigami grippers [3], `groovy metasheets'\nfor multi-stable morphing [4], and lateral bending of ribbed sheets [5].\nQualitatively similar behaviour has also been observed in simulations of\nthermalized graphene sheets [6,7], where clamping along one edge leads to\ntilting in the transverse direction. Here, we show that this counter-intuitive\nbehaviour is, in fact, generic for thin sheets that have a relatively low\nstretching modulus compared to the bending modulus, which allows `giant\nactuation' with moderate strain. Indeed, transverse buckling can be induced by\nuni-axial tension even in unstructured elastic sheets, provided that the axial\nloading is sufficiently close to localized. We therefore refer to this as\n`Tension indUced Giant actuation' (TUG actuation) and study its properties. We\nshow that TUG actuation occurs because of an efficient transfer of applied\ntensile load into compression and determine scaling results for the transverse\nangle as a function of applied strain; our scaling results compare favorably\nwith both experiments and simulations. Our findings suggest that controlled\nbuckling in tension can be utilized in a broader range of materials and\nstructures to give TUG actuation, potentially expanding the scope of its\napplication in material science and engineering.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XhT7Mn9A8Qs_FNQypiLvS-Dxcf_3Jiehehf7UcxxSUw","pdfSize":"2940113"}
