{"id":"2408.14660","title":"Assessing realistic binding energies of some essential interstellar\n  radicals with amorphous solid water. A fully quantum chemical approach","authors":"Milan Sil, Arghyadeb Roy, Prasanta Gorai, Naoki Nakatani, Takashi\n  Shimonishi, Kenji Furuya, Natalia Inostroza-Pino, Paola Caselli, Ankan Das","authorsParsed":[["Sil","Milan",""],["Roy","Arghyadeb",""],["Gorai","Prasanta",""],["Nakatani","Naoki",""],["Shimonishi","Takashi",""],["Furuya","Kenji",""],["Inostroza-Pino","Natalia",""],["Caselli","Paola",""],["Das","Ankan",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 21:57:22 GMT"},{"version":"v2","created":"Mon, 16 Sep 2024 19:52:36 GMT"}],"updateDate":"2024-09-18","timestamp":1724709442000,"abstract":"  In the absence of laboratory data, state-of-the-art quantum chemical\napproaches can provide estimates of the binding energy (BE) of interstellar\nspecies with grains. Without BE values, contemporary astrochemical models are\ncompelled to utilize wild guesses, often delivering misleading information.\nHere, we employed a fully quantum chemical approach to estimate the BE of seven\ndiatomic radicals - CH, NH, OH, SH, CN, NS, and NO - that play a crucial role\nin shaping the interstellar chemical composition, using a suitable amorphous\nsolid water model as a substrate since water is the principal constituent of\ninterstellar ice in dense and shielded regions. While the BEs are compatible\nwith physisorption, the binding of CH in some sites shows chemisorption, in\nwhich a chemical bond to an oxygen atom of a water molecule is formed. While no\nstructural change has been observed for the CN radical, it is believed that the\nformation of a hemibonded system between the outer layer of the water cluster\nand the radical is the reason for the unusually large BE in one of the binding\nsites considered in our study. A significantly lower BE for NO, consistent with\nrecent calculations, is obtained, which helps explain the recently observed\nHONO/NH$_2$OH and HONO/HNO ratios in the low-mass hot corino IRAS 16293-2422 B\nwith chemical models.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}