{"id":"2408.04366","title":"Towards Less Greedy Quantum Coalition Structure Generation in Induced\n  Subgraph Games","authors":"Jonas N\\\"u{\\ss}lein, Dani\\\"elle Schuman, David Bucher, Naeimeh\n  Mohseni, Kumar Ghosh, Corey O'Meara, Giorgio Cortiana and Claudia\n  Linnhoff-Popien","authorsParsed":[["Nüßlein","Jonas",""],["Schuman","Daniëlle",""],["Bucher","David",""],["Mohseni","Naeimeh",""],["Ghosh","Kumar",""],["O'Meara","Corey",""],["Cortiana","Giorgio",""],["Linnhoff-Popien","Claudia",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 10:54:56 GMT"},{"version":"v2","created":"Sun, 1 Sep 2024 17:06:55 GMT"}],"updateDate":"2024-09-04","timestamp":1723114496000,"abstract":"  The transition to 100% renewable energy requires new techniques for managing\nenergy networks, such as dividing them into sensible subsets of prosumers\ncalled micro-grids. Doing so in an optimal manner is a difficult optimization\nproblem, as it can be abstracted to the Coalition Structure Generation problem\nin Induced Subgraph Games, a NP-complete problem which requires dividing an\nundirected, complete, weighted graph into subgraphs in a way that maximizes the\nsum of their internal weights. Recently, Venkatesh et al. (arXiv:2212.11372)\npublished a Quantum Annealing (QA)-based iterative algorithm called GCS-Q,\nwhich they claim to be the best currently existing solver for the problem in\nterms of runtime complexity. As this algorithm makes the application of QA to\nthe problem seem promising, but is a greedy one, this work proposes several\nless greedy QA-based approaches and investigates whether any of them can\noutperform GCS-Q in terms of solution quality. While we find that this is not\nthe case yet on D-Wave hardware, most of them do when using the classical\nQBSolv software as a solver. Especially an algorithm we call 4-split iterative\nR-QUBO shows potential here, finding all optima in our dataset while scaling\nfavorably with the problem size in terms of runtime. Thus, it appears to be\ninteresting for future research on quantum approaches to the problem, assuming\nQA hardware will become more noise-resilient over time.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Emerging Technologies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}