{"id":"2408.01242","title":"A modular open-source software platform for BCI research with\n  application in closed-loop deep brain stimulation","authors":"Matthias Dold, Joana Pereira, Bastian Sajonz, Volker A. Coenen, Marcus\n  L.F. Janssen, Michael Tangermann","authorsParsed":[["Dold","Matthias",""],["Pereira","Joana",""],["Sajonz","Bastian",""],["Coenen","Volker A.",""],["Janssen","Marcus L. F.",""],["Tangermann","Michael",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 13:01:02 GMT"}],"updateDate":"2024-08-05","timestamp":1722603662000,"abstract":"  This work introduces Dareplane, a modular and broad technology agnostic open\nsource software platform for brain-computer interface research with an\napplication focus on adaptive deep brain stimulation (aDBS). While the search\nfor suitable biomarkers to inform aDBS has provided rich results over the last\ntwo decades, development of control strategies is not progressing at the same\npace. One difficulty for investigating control approaches resides with the\ncomplex setups required for aDBS experiments. The Dareplane platform supports\naDBS setups, and more generally brain computer interfaces, by providing a\nmodular, technology-agnostic, and easy-to-implement software platform to make\nexperimental setups more resilient and replicable. The key features of the\nplatform are presented and the composition of modules into a full experimental\nsetup is discussed in the context of a Python-based orchestration module. The\nperformance of a typical experimental setup on Dareplane for aDBS is evaluated\nin three benchtop experiments, covering (a) an easy-to-replicate setup using an\nArduino microcontroller, (b) a setup with hardware of an implantable pulse\ngenerator, and (c) a setup using an established and CE certified external\nneurostimulator. Benchmark results are presented for individual processing\nsteps and full closed-loop processing. The results show that the\nmicrocontroller setup in (a) provides timing comparable to the realistic setups\nin (b) and (c). The Dareplane platform was successfully used in a total of 19\nopen-loop DBS sessions with externalized DBS and electrocorticography (ECoG)\nleads. In addition, the full technical feasibility of the platform in the aDBS\ncontext is demonstrated in a first closed-loop session with externalized leads\non a patient with Parkinson's disease receiving DBS treatment.\n","subjects":["Quantitative Biology/Other Quantitative Biology"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"yMHBuGeVMcuAtm8dDIHQWpBFzosIQnMm5TBBFC-retU","pdfSize":"4296938","txDigest":"GZysxYhmcpU8f7nT5RBJUNKDyGEK2zTJ85ajffF8VL1x","endEpoch":"1","status":"CERTIFIED"}
