{"id":"2408.01916","title":"MAO: A Framework for Process Model Generation with Multi-Agent\n  Orchestration","authors":"Leilei Lin, Yumeng Jin, Yingming Zhou, Wenlong Chen, Chen Qian","authorsParsed":[["Lin","Leilei",""],["Jin","Yumeng",""],["Zhou","Yingming",""],["Chen","Wenlong",""],["Qian","Chen",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 03:32:17 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 10:37:38 GMT"}],"updateDate":"2024-08-08","timestamp":1722742337000,"abstract":"  Process models are frequently used in software engineering to describe\nbusiness requirements, guide software testing and control system improvement.\nHowever, traditional process modeling methods often require the participation\nof numerous experts, which is expensive and time-consuming. Therefore, the\nexploration of a more efficient and cost-effective automated modeling method\nhas emerged as a focal point in current research. This article explores a\nframework for automatically generating process models with multi-agent\norchestration (MAO), aiming to enhance the efficiency of process modeling and\noffer valuable insights for domain experts. Our framework MAO leverages large\nlanguage models as the cornerstone for multi-agent, employing an innovative\nprompt strategy to ensure efficient collaboration among multi-agent.\nSpecifically, 1) generation. The first phase of MAO is to generate a slightly\nrough process model from the text description; 2) refinement. The agents would\ncontinuously refine the initial process model through multiple rounds of\ndialogue; 3) reviewing. Large language models are prone to hallucination\nphenomena among multi-turn dialogues, so the agents need to review and repair\nsemantic hallucinations in process models; 4) testing. The representation of\nprocess models is diverse. Consequently, the agents utilize external tools to\ntest whether the generated process model contains format errors, namely format\nhallucinations, and then adjust the process model to conform to the output\nparadigm. The experiments demonstrate that the process models generated by our\nframework outperform existing methods and surpass manual modeling by 89%, 61%,\n52%, and 75% on four different datasets, respectively.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}