{"id":"2408.10974","title":"Deep Reinforcement Learning for Network Energy Saving in 6G and Beyond\n  Networks","authors":"Dinh-Hieu Tran, Nguyen Van Huynh, Soumeya Kaada, Van Nhan Vo, Eva\n  Lagunas, and Symeon Chatzinotas","authorsParsed":[["Tran","Dinh-Hieu",""],["Van Huynh","Nguyen",""],["Kaada","Soumeya",""],["Vo","Van Nhan",""],["Lagunas","Eva",""],["Chatzinotas","Symeon",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 16:06:46 GMT"}],"updateDate":"2024-08-21","timestamp":1724170006000,"abstract":"  Network energy saving has received great attention from operators and vendors\nto reduce energy consumption and CO2 emissions to the environment as well as\nsignificantly reduce costs for mobile network operators. However, the design of\nenergy-saving networks also needs to ensure the mobile users' (MUs) QoS\nrequirements such as throughput requirements (TR). This work considers a mobile\ncellular network including many ground base stations (GBSs), and some GBSs are\nintentionally turned off due to network energy saving (NES) or crash, so the\nMUs located in these outage GBSs are not served in time. Based on this\nobservation, we propose the problem of maximizing the total achievable\nthroughput in the network by optimizing the GBSs' antenna tilt and adaptive\ntransmission power with a given number of served MUs satisfied. Notice that,\nthe MU is considered successfully served if its Reference Signal Received Power\n(RSRP) and throughput requirement are satisfied. The formulated optimization\nproblem becomes difficult to solve with multiple binary variables and\nnon-convex constraints along with random throughput requirements and random\nplacement of MUs. We propose a Deep Q-learning-based algorithm to help the\nnetwork learn the uncertainty and dynamics of the transmission environment.\nExtensive simulation results show that our proposed algorithm achieves much\nbetter performance than the benchmark schemes.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IYUywgNja41_5q2jY0RKU26qMy_jBhLr5d75RTqw4ag","pdfSize":"541939"}
