{"id":"2408.04055","title":"Machine Learning-Based Reward-Driven Tuning of Scanning Probe\n  Microscopy: Towards Fully Automated Microscopy","authors":"Yu Liu, Roger Proksch, Jason Bemis, Utkarsh Pratiush, Astita Dubey,\n  Mahshid Ahmadi, Reece Emery, Philip D. Rack, Yu-Chen Liu, Jan-Chi Yang,\n  Sergei V. Kalinin","authorsParsed":[["Liu","Yu",""],["Proksch","Roger",""],["Bemis","Jason",""],["Pratiush","Utkarsh",""],["Dubey","Astita",""],["Ahmadi","Mahshid",""],["Emery","Reece",""],["Rack","Philip D.",""],["Liu","Yu-Chen",""],["Yang","Jan-Chi",""],["Kalinin","Sergei V.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 19:34:42 GMT"}],"updateDate":"2024-08-09","timestamp":1723059282000,"abstract":"  Since the dawn of scanning probe microscopy (SPM), tapping or intermittent\ncontact mode has been one of the most widely used imaging modes. Manual\noptimization of tapping mode not only takes a lot of instrument and operator\ntime, but also often leads to frequent probe and sample damage, poor image\nquality and reproducibility issues for new types of samples or inexperienced\nusers. Despite wide use, optimization of tapping mode imaging is an extremely\nhard problem, ill-suited to either classical control methods or machine\nlearning. Here we introduce a reward-driven workflow to automate the\noptimization of SPM in the tapping mode. The reward function is defined based\non multiple channels with physical and empirical knowledge of good scans\nencoded, representing a sample-agnostic measure of image quality and imitating\nthe decision-making logic employed by human operators. This automated workflow\ngives optimal scanning parameters for different probes and samples and gives\nhigh-quality SPM images consistently in the attractive mode. This study\nbroadens the application and accessibility of SPM and opens the door for fully\nautomated SPM.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}