{"id":"2408.06659","title":"A hybrid neural network for real-time OD demand calibration under\n  disruptions","authors":"Takao Dantsuji, Dong Ngoduy, Ziyuan Pu, Seunghyeon Lee, Hai L. Vu","authorsParsed":[["Dantsuji","Takao",""],["Ngoduy","Dong",""],["Pu","Ziyuan",""],["Lee","Seunghyeon",""],["Vu","Hai L.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 06:16:21 GMT"}],"updateDate":"2024-08-14","timestamp":1723529781000,"abstract":"  Existing automated urban traffic management systems, designed to mitigate\ntraffic congestion and reduce emissions in real time, face significant\nchallenges in effectively adapting to rapidly evolving conditions.\nPredominantly reactive, these systems typically respond to incidents only after\nthey have transpired. A promising solution lies in implementing real-time\ntraffic simulation models capable of accurately modelling environmental\nchanges. Central to these real-time traffic simulations are origin-destination\n(OD) demand matrices. However, the inherent variability, stochasticity, and\nunpredictability of traffic demand complicate the precise calibration of these\nmatrices in the face of disruptions. This paper introduces a hybrid neural\nnetwork (NN) architecture specifically designed for real-time OD demand\ncalibration to enhance traffic simulations' accuracy and reliability under both\nrecurrent and non-recurrent traffic conditions. The proposed hybrid NN predicts\nthe OD demand to reconcile the discrepancies between actual and simulated\ntraffic patterns. To facilitate real-time updating of the internal parameters\nof the NN, we develop a metamodel-based backpropagation method by integrating\ndata from real-world traffic systems and simulated environments. This ensures\nprecise predictions of the OD demand even in the case of abnormal or\nunpredictable traffic patterns. Furthermore, we incorporate offline\npre-training of the NN using the metamodel to improve computational efficiency.\nValidation through a toy network and a Tokyo expressway corridor case study\nillustrates the model's ability to dynamically adjust to shifting traffic\npatterns across various disruption scenarios. Our findings underscore the\npotential of advanced machine learning techniques in developing proactive\ntraffic management strategies, offering substantial improvements over\ntraditional reactive systems.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}