{"id":"2408.11814","title":"SynPlay: Importing Real-world Diversity for a Synthetic Human Dataset","authors":"Jinsub Yim, Hyungtae Lee, Sungmin Eum, Yi-Ting Shen, Yan Zhang,\n  Heesung Kwon, Shuvra S. Bhattacharyya","authorsParsed":[["Yim","Jinsub",""],["Lee","Hyungtae",""],["Eum","Sungmin",""],["Shen","Yi-Ting",""],["Zhang","Yan",""],["Kwon","Heesung",""],["Bhattacharyya","Shuvra S.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 17:58:49 GMT"}],"updateDate":"2024-08-22","timestamp":1724263129000,"abstract":"  We introduce Synthetic Playground (SynPlay), a new synthetic human dataset\nthat aims to bring out the diversity of human appearance in the real world. We\nfocus on two factors to achieve a level of diversity that has not yet been seen\nin previous works: i) realistic human motions and poses and ii) multiple camera\nviewpoints towards human instances. We first use a game engine and its\nlibrary-provided elementary motions to create games where virtual players can\ntake less-constrained and natural movements while following the game rules\n(i.e., rule-guided motion design as opposed to detail-guided design). We then\naugment the elementary motions with real human motions captured with a motion\ncapture device. To render various human appearances in the games from multiple\nviewpoints, we use seven virtual cameras encompassing the ground and aerial\nviews, capturing abundant aerial-vs-ground and dynamic-vs-static attributes of\nthe scene. Through extensive and carefully-designed experiments, we show that\nusing SynPlay in model training leads to enhanced accuracy over existing\nsynthetic datasets for human detection and segmentation. The benefit of SynPlay\nbecomes even greater for tasks in the data-scarce regime, such as few-shot and\ncross-domain learning tasks. These results clearly demonstrate that SynPlay can\nbe used as an essential dataset with rich attributes of complex human\nappearances and poses suitable for model pretraining. SynPlay dataset\ncomprising over 73k images and 6.5M human instances, is available for download\nat https://synplaydataset.github.io/.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}