{"id":"2408.16410","title":"Denoising of Photogrammetric Dummy Head Ear Point Clouds for Individual\n  Head-Related Transfer Functions Computation","authors":"Fabio Di Giusto, Francesc Llu\\'is, Sjoerd van Ophem, Elke Deckers","authorsParsed":[["Di Giusto","Fabio",""],["Lluís","Francesc",""],["van Ophem","Sjoerd",""],["Deckers","Elke",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 10:15:19 GMT"}],"updateDate":"2024-08-30","timestamp":1724926519000,"abstract":"  Individual Head Related Transfer Functions (HRTFs), crucial for realistic\nvirtual audio rendering, can be efficiently numerically computed on precise\nthree-dimensional head and ear scans. While photogrammetry scanning is\npromising, it generally lacks in accuracy, leading to HRTFs showing significant\nperceptual deviation from reference data, owing to the scanning error mainly\naffecting the most occluded pinna structures. This papers analyses the use of\nDeep Neural Networks (DNNs) for denoising photogrammetric ear scans. Various\nDNNs, fine-tuned on pinna samples corrupted with modelled synthetic error\nmimicking that observed in photogrammetric dummy head ear scans, are tested and\nbenchmarked against a classical denoising approach. One DNN is further modified\nand retrained to increase its denoising performance. The HRTFs computed on\noriginal and denoised scans are compared to those of a reference scan, showing\nthat the best-performing DNN is capable of generally decreasing the deviation\nof photogrammetric dummy head HRTFs to levels obtained with accurately measured\nindividual data. Correlation analysis between the geometrical metrics, computed\non the scanned point clouds, and the related HRTFs is used to identify the most\nrelevant metrics to assess the geometrical deviation between target and\nreference scans, in terms of the similarity of the HRTFs computed on them.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Sound"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}