{"id":"2408.09060","title":"[Invited Discussion] Randomization Tests to Address Disruptions in\n  Clinical Trials: A Report from the NISS Ingram Olkin Forum Series on\n  Unplanned Clinical Trial Disruptions","authors":"Rachael V. Phillips and Mark J. van der Laan","authorsParsed":[["Phillips","Rachael V.",""],["van der Laan","Mark J.",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 01:15:28 GMT"}],"updateDate":"2024-08-20","timestamp":1723857328000,"abstract":"  Disruptions in clinical trials may be due to external events like pandemics,\nwarfare, and natural disasters. Resulting complications may lead to unforeseen\nintercurrent events (events that occur after treatment initiation and affect\nthe interpretation of the clinical question of interest or the existence of the\nmeasurements associated with it). In Uschner et al. (2023), several example\nclinical trial disruptions are described: treatment effect drift, population\nshift, change of care, change of data collection, and change of availability of\nstudy medication. A complex randomized controlled trial (RCT) setting with\n(planned or unplanned) intercurrent events is then described, and randomization\ntests are presented as a means for non-parametric inference that is robust to\nviolations of assumption typically made in clinical trials. While estimation\nmethods like Targeted Learning (TL) are valid in such settings, we do not see\nwhere the authors make the case that one should be going for a randomization\ntest in such disrupted RCTs. In this discussion, we comment on the\nappropriateness of TL and the accompanying TL Roadmap in the context of\ndisrupted clinical trials. We highlight a few key articles related to the broad\napplicability of TL for RCTs and real-world data (RWD) analyses with\nintercurrent events. We begin by introducing TL and motivating its utility in\nSection 2, and then in Section 3 we provide a brief overview of the TL Roadmap.\nIn Section 4 we recite the example clinical trial disruptions presented in\nUschner et al. (2023), discussing considerations and solutions based on the\nprinciples of TL. We request in an authors' rejoinder a clear theoretical\ndemonstration with specific examples in this setting that a randomization test\nis the only valid inferential method relative to one based on following the TL\nRoadmap.\n","subjects":["Statistics/Applications","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/"}