{"id":"2408.12649","title":"Multi-iron subpopulations in Liller 1 from high resolution H-band\n  spectroscopy","authors":"C. Fanelli, L. Origlia, R. M. Rich, F. R. Ferraro, D. A. Alvarez\n  Garay, L. Chiappino, B. Lanzoni, C. Pallanca, C. Crociati and E. Dalessandro","authorsParsed":[["Fanelli","C.",""],["Origlia","L.",""],["Rich","R. M.",""],["Ferraro","F. R.",""],["Garay","D. A. Alvarez",""],["Chiappino","L.",""],["Lanzoni","B.",""],["Pallanca","C.",""],["Crociati","C.",""],["Dalessandro","E.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 18:00:03 GMT"}],"updateDate":"2024-08-26","timestamp":1724349603000,"abstract":"  We present a high resolution chemical study of a representative sample of 21\nluminous giant stars of Liller~1, a complex stellar system in the Galactic\nbulge, based on H band spectra acquired with the Near InfraRed Spectrograph at\nKeckII. 15 stars turn out to have a subsolar iron abundance and enhanced\n[$\\alpha$/Fe] and [Al/Fe], likely old that formed early and quickly from gas\nmainly enriched by type~II supernovae, and 6 stars with supersolar iron and\nroughly solar-scaled [$\\alpha$/Fe] and [Al/Fe], likely younger, thus formed at\nlater epochs from gas also enriched by type~Ia supernovae. Moreover, both\nsubpopulations show enhanced [N/Fe], as in the bulge field, about solar-scaled\n[V/Fe], and depletion of [C/Fe] and $^{12}$C/$^{13}$C with respect to the solar\nvalues, indicating the occurrence of significant mixing in the stellar\ninteriors of these evolved stars. The current study has also made evident that\nthe sub-solar subpopulation shows some structuring, and the presence of a third\nsubcomponent with iron content and [$\\alpha$/Fe] enhancement somewhat\nintermediate between the metal-poor and metal-rich main subpopulations, has\nbeen statistically assessed, providing the chemical signature of an extended\nstar formation with multiple bursts and of some self-enrichment.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}