{"id":"2408.06324","title":"Online Vehicle Routing with Pickups and Deliveries under Time-Dependent\n  Travel-Time Constraints","authors":"Spyros Kontogiannis and Andreas Paraskevopoulos and Christos\n  Zaroliagis","authorsParsed":[["Kontogiannis","Spyros",""],["Paraskevopoulos","Andreas",""],["Zaroliagis","Christos",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 17:43:48 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 06:32:22 GMT"}],"updateDate":"2024-08-14","timestamp":1723484628000,"abstract":"  The Vehicle Routing Problem with pickups, deliveries and spatiotemporal\nservice constraints ($VRPPDSTC$) is a quite challenging algorithmic problem\nthat can be dealt with in either an offline or an online fashion. In this work,\nwe focus on a generalization, called $VRPPDSTCtd$, in which the travel-time\nmetric is \\emph{time-dependent}: the traversal-time per road segment\n(represented as a directed arc) is determined by some function of the\ndeparture-time from its tail towards its head. Time-dependence makes things\nmuch more complicated, even for the simpler problem of computing\nearliest-arrival-time paths which is a crucial subroutine to be solved\n(numerous times) by $VRPPDSTCtd$ schedulers.\n  We propose two \\emph{online} schedulers of requests to workers, one which is\na time-dependent variant of the classical Plain-Insertion heuristic, and an\nextension of it trying to digest some sort of forecasts for future demands for\nservice. We enrich these two online schedulers with two additional heuristics,\none targeting for distance-balanced assignments of work loads to the workers\nand another that makes local-search-improvements to the produced solutions.\n  We conduct a careful experimental evaluation of the proposed algorithms on a\nreal-world instance, with or without these heuristics, and compare their\nquality with human-curated assignments provided by professional experts (human\noperators at actual pickup-and-delivery control centers), and also with\nfeasible solutions constructed from a relaxed MILP formulation of $VRPPDSTCtd$,\nwhich is also introduced in this paper.\n  Our findings are quite encouraging, demonstrating that the proposed\nalgorithms produce solutions which (i) are significant improvements over the\nhuman-curated assignments, and (ii) have overall quality pretty close to that\nof the (extremely time-consuming) solutions provided by an exact solver for the\nMILP formulation.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Data Structures and Algorithms"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"c_KVs_NniyxhzRYYQQj7cKo6YY-TXTWV2O60zCuWWY8","pdfSize":"1349245"}
