{"id":"2408.02665","title":"Structure-preserving approximations of the Serre-Green-Naghdi equations\n  in standard and hyperbolic form","authors":"Hendrik Ranocha and Mario Ricchiuto","authorsParsed":[["Ranocha","Hendrik",""],["Ricchiuto","Mario",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 17:56:19 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 16:21:32 GMT"},{"version":"v3","created":"Mon, 19 Aug 2024 06:44:17 GMT"}],"updateDate":"2024-08-20","timestamp":1722880579000,"abstract":"  We develop structure-preserving numerical methods for the Serre-Green-Naghdi\nequations, a model for weakly dispersive free-surface waves. We consider both\nthe classical form, requiring the inversion of a non-linear elliptic operator,\nand a hyperbolic approximation of the equations, allowing fully explicit time\nstepping. Systems for both flat and variable topography are studied. Our novel\nnumerical methods conserve both the total water mass and the total energy. In\naddition, the methods for the original Serre-Green-Naghdi equations conserve\nthe total momentum for flat bathymetry. For variable topography, all the\nmethods proposed are well-balanced for the lake-at-rest state. We provide a\ntheoretical setting allowing us to construct schemes of any kind (finite\ndifference, finite element, discontinuous Galerkin, spectral, etc.) as long as\nsummation-by-parts operators are available in the chosen setting. Energy-stable\nvariants are proposed by adding a consistent high-order artificial viscosity\nterm. The proposed methods are validated through a large set of benchmarks to\nverify all the theoretical properties. Whenever possible, comparisons with\nexact, reference numerical, or experimental data are carried out. The\nimpressive advantage of structure preservation, and in particular energy\npreservation, to resolve accurately dispersive wave propagation on very coarse\nmeshes is demonstrated by several of the tests.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}