{"id":"2408.04786","title":"SOD-YOLOv8 -- Enhancing YOLOv8 for Small Object Detection in Traffic\n  Scenes","authors":"Boshra Khalili, Andrew W.Smyth","authorsParsed":[["Khalili","Boshra",""],["Smyth","Andrew W.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 23:05:25 GMT"}],"updateDate":"2024-08-12","timestamp":1723158325000,"abstract":"  Object detection as part of computer vision can be crucial for traffic\nmanagement, emergency response, autonomous vehicles, and smart cities. Despite\nsignificant advances in object detection, detecting small objects in images\ncaptured by distant cameras remains challenging due to their size, distance\nfrom the camera, varied shapes, and cluttered backgrounds. To address these\nchallenges, we propose Small Object Detection YOLOv8 (SOD-YOLOv8), a novel\nmodel specifically designed for scenarios involving numerous small objects.\nInspired by Efficient Generalized Feature Pyramid Networks (GFPN), we enhance\nmulti-path fusion within YOLOv8 to integrate features across different levels,\npreserving details from shallower layers and improving small object detection\naccuracy. Also, A fourth detection layer is added to leverage high-resolution\nspatial information effectively. The Efficient Multi-Scale Attention Module\n(EMA) in the C2f-EMA module enhances feature extraction by redistributing\nweights and prioritizing relevant features. We introduce Powerful-IoU (PIoU) as\na replacement for CIoU, focusing on moderate-quality anchor boxes and adding a\npenalty based on differences between predicted and ground truth bounding box\ncorners. This approach simplifies calculations, speeds up convergence, and\nenhances detection accuracy. SOD-YOLOv8 significantly improves small object\ndetection, surpassing widely used models in various metrics, without\nsubstantially increasing computational cost or latency compared to YOLOv8s.\nSpecifically, it increases recall from 40.1\\% to 43.9\\%, precision from 51.2\\%\nto 53.9\\%, $\\text{mAP}_{0.5}$ from 40.6\\% to 45.1\\%, and\n$\\text{mAP}_{0.5:0.95}$ from 24\\% to 26.6\\%. In dynamic real-world traffic\nscenes, SOD-YOLOv8 demonstrated notable improvements in diverse conditions,\nproving its reliability and effectiveness in detecting small objects even in\nchallenging environments.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bF6E3NDy0NdG23TdpI88gmAPZAsX51p-zIQMxLZxSIY","pdfSize":"6787179"}
