{"id":"2408.06212","title":"Computability of Classification and Deep Learning: From Theoretical\n  Limits to Practical Feasibility through Quantization","authors":"Holger Boche and Vit Fojtik and Adalbert Fono and Gitta Kutyniok","authorsParsed":[["Boche","Holger",""],["Fojtik","Vit",""],["Fono","Adalbert",""],["Kutyniok","Gitta",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 15:02:26 GMT"}],"updateDate":"2024-08-13","timestamp":1723474946000,"abstract":"  The unwavering success of deep learning in the past decade led to the\nincreasing prevalence of deep learning methods in various application fields.\nHowever, the downsides of deep learning, most prominently its lack of\ntrustworthiness, may not be compatible with safety-critical or\nhigh-responsibility applications requiring stricter performance guarantees.\nRecently, several instances of deep learning applications have been shown to be\nsubject to theoretical limitations of computability, undermining the\nfeasibility of performance guarantees when employed on real-world computers. We\nextend the findings by studying computability in the deep learning framework\nfrom two perspectives: From an application viewpoint in the context of\nclassification problems and a general limitation viewpoint in the context of\ntraining neural networks. In particular, we show restrictions on the\nalgorithmic solvability of classification problems that also render the\nalgorithmic detection of failure in computations in a general setting\ninfeasible. Subsequently, we prove algorithmic limitations in training deep\nneural networks even in cases where the underlying problem is well-behaved.\nFinally, we end with a positive observation, showing that in quantized versions\nof classification and deep network training, computability restrictions do not\narise or can be overcome to a certain degree.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computational Complexity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}