{"id":"2408.05213","title":"A multi-objective mixed integer linear programming model for supply\n  chain planning of 3D printing","authors":"Amirreza Talebi","authorsParsed":[["Talebi","Amirreza",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 05:53:52 GMT"}],"updateDate":"2024-08-13","timestamp":1720850032000,"abstract":"  3D printing is considered the future of production systems and one of the\nphysical elements of the Fourth Industrial Revolution. 3D printing will\nsignificantly impact the product lifecycle, considering cost, energy\nconsumption, and carbon dioxide emissions, leading to the creation of\nsustainable production systems. Given the importance of these production\nsystems and their effects on the quality of life for future generations, it is\nexpected that 3D printing will soon become one of the global industry's\nfundamental needs. Although three decades have passed since the emergence of 3D\nprinters, there has not yet been much research on production planning and mass\nproduction using these devices. Therefore, we aimed to identify the existing\ngaps in the planning of 3D printers and to propose a model for planning and\nscheduling these devices. In this research, several parts with different\nheights, areas, and volumes have been considered for allocation on identical 3D\nprinters for various tasks. To solve this problem, a multi-objective mixed\ninteger linear programming model has been proposed to minimize the earliness\nand tardiness of parts production, considering their order delivery times, and\nmaximizing machine utilization. Additionally, a method has been proposed for\nthe placement of parts in 3D printers, leading to the selection of the best\nedge as the height. Using a numerical example, we have plotted the Pareto curve\nobtained from solving the model using the epsilon constraint method for several\nparts and analyzed the impact of the method for selecting the best edge as the\nheight, with and without considering it. Additionally, a comprehensive\nsensitivity and scenario analysis has been conducted to validate the results.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}