{"id":"2408.05271","title":"Electronic Structure and Kohn-Luttinger Superconductivity of\n  Heavily-Doped Single-Layer Graphene","authors":"Saul Herrera, Guillermo Parra-Martinez, Philipp Rosenzweig, Bharti\n  Matta, Craig M. Polley, Kathrin Kuster, Ulrich Starke, Francisco Guinea, Jose\n  Angel Silva-Guillen, Gerardo G. Naumis, Pierre A. Pantaleon","authorsParsed":[["Herrera","Saul",""],["Parra-Martinez","Guillermo",""],["Rosenzweig","Philipp",""],["Matta","Bharti",""],["Polley","Craig M.",""],["Kuster","Kathrin",""],["Starke","Ulrich",""],["Guinea","Francisco",""],["Silva-Guillen","Jose Angel",""],["Naumis","Gerardo G.",""],["Pantaleon","Pierre A.",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 18:00:02 GMT"}],"updateDate":"2024-08-13","timestamp":1723226402000,"abstract":"  The existence of superconductivity (SC) in graphene appears to be established\nin both twisted and non-twisted multilayers. However, whether their building\nblock, single-layer graphene (SLG), can also host SC remains an open question.\nEarlier theoretical works predicted that SLG could become a chiral d-wave\nsuperconductor driven by electronic interactions when doped to its van Hove\nsingularity, but questions such as whether the d-wave SC survives the strong\nband renormalizations seen in experiments, its robustness against the source of\ndoping, or if it will occur at any reasonable critical temperature (Tc) have\nremained difficult to answer, in part due to uncertainties in model parameters.\nIn this study, we adopt a random-phase approximation framework based on a\nKohn-Luttinger-like mechanism to investigate SC in heavily-doped SLG. We\npredict that robust d+id topological SC could arise in SLG doped by Tb, with a\nTc up to 600 mK. We also investigate the possibility of realizing d-wave SC by\nemploying other dopants, such as Li or Cs. The structural models have been\nderived from angle-resolved photoemission spectroscopy measurements on Tb-doped\ngraphene and first-principles calculations for Cs and Li doping. We find that\ndopants that change the lattice symmetry of SLG are detrimental to the d-wave\nstate. The stability of the d-wave SC predicted here in Tb-doped SLG could\nprovide a valuable insight for guiding future experimental efforts aimed at\nexploring topological superconductivity in monolayer graphene.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}