{"id":"2408.00295","title":"Contrastive Graph Representation Learning with Adversarial Cross-view\n  Reconstruction and Information Bottleneck","authors":"Yuntao Shou, Haozhi Lan, Xiangyong Cao","authorsParsed":[["Shou","Yuntao",""],["Lan","Haozhi",""],["Cao","Xiangyong",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 05:45:21 GMT"}],"updateDate":"2024-08-02","timestamp":1722491121000,"abstract":"  Graph Neural Networks (GNNs) have received extensive research attention due\nto their powerful information aggregation capabilities. Despite the success of\nGNNs, most of them suffer from the popularity bias issue in a graph caused by a\nsmall number of popular categories. Additionally, real graph datasets always\ncontain incorrect node labels, which hinders GNNs from learning effective node\nrepresentations. Graph contrastive learning (GCL) has been shown to be\neffective in solving the above problems for node classification tasks. Most\nexisting GCL methods are implemented by randomly removing edges and nodes to\ncreate multiple contrasting views, and then maximizing the mutual information\n(MI) between these contrasting views to improve the node feature\nrepresentation. However, maximizing the mutual information between multiple\ncontrasting views may lead the model to learn some redundant information\nirrelevant to the node classification task. To tackle this issue, we propose an\neffective Contrastive Graph Representation Learning with Adversarial Cross-view\nReconstruction and Information Bottleneck (CGRL) for node classification, which\ncan adaptively learn to mask the nodes and edges in the graph to obtain the\noptimal graph structure representation. Furthermore, we innovatively introduce\nthe information bottleneck theory into GCLs to remove redundant information in\nmultiple contrasting views while retaining as much information as possible\nabout node classification. Moreover, we add noise perturbations to the original\nviews and reconstruct the augmented views by constructing adversarial views to\nimprove the robustness of node feature representation. Extensive experiments on\nreal-world public datasets demonstrate that our method significantly\noutperforms existing state-of-the-art algorithms.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fB0l9wZtDqAFZv1HGOJsANeAl2OXXnbWAXX44p0JHY0","pdfSize":"7140058","txDigest":"F4mihgYpyfHMaqAMF2MH1WV2tBkQ4T6rpV3iKsuYL4az","endEpoch":"1","status":"CERTIFIED"}
