{"id":"2408.08189","title":"FancyVideo: Towards Dynamic and Consistent Video Generation via\n  Cross-frame Textual Guidance","authors":"Jiasong Feng, Ao Ma, Jing Wang, Bo Cheng, Xiaodan Liang, Dawei Leng,\n  Yuhui Yin","authorsParsed":[["Feng","Jiasong",""],["Ma","Ao",""],["Wang","Jing",""],["Cheng","Bo",""],["Liang","Xiaodan",""],["Leng","Dawei",""],["Yin","Yuhui",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 14:47:44 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 06:51:05 GMT"}],"updateDate":"2024-08-19","timestamp":1723733264000,"abstract":"  Synthesizing motion-rich and temporally consistent videos remains a challenge\nin artificial intelligence, especially when dealing with extended durations.\nExisting text-to-video (T2V) models commonly employ spatial cross-attention for\ntext control, equivalently guiding different frame generations without\nframe-specific textual guidance. Thus, the model's capacity to comprehend the\ntemporal logic conveyed in prompts and generate videos with coherent motion is\nrestricted. To tackle this limitation, we introduce FancyVideo, an innovative\nvideo generator that improves the existing text-control mechanism with the\nwell-designed Cross-frame Textual Guidance Module (CTGM). Specifically, CTGM\nincorporates the Temporal Information Injector (TII), Temporal Affinity Refiner\n(TAR), and Temporal Feature Booster (TFB) at the beginning, middle, and end of\ncross-attention, respectively, to achieve frame-specific textual guidance.\nFirstly, TII injects frame-specific information from latent features into text\nconditions, thereby obtaining cross-frame textual conditions. Then, TAR refines\nthe correlation matrix between cross-frame textual conditions and latent\nfeatures along the time dimension. Lastly, TFB boosts the temporal consistency\nof latent features. Extensive experiments comprising both quantitative and\nqualitative evaluations demonstrate the effectiveness of FancyVideo. Our video\ndemo, code and model are available at https://360cvgroup.github.io/FancyVideo/.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}