{"id":"2408.10972","title":"On the Number of Connected Components of T-Hypersurfaces","authors":"Jules Chenal","authorsParsed":[["Chenal","Jules",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 16:05:41 GMT"}],"updateDate":"2024-08-21","timestamp":1724169941000,"abstract":"  A T-hypersurface is a combinatorial hypersurface of the real locus of a\nprojective toric variety $Y$. It is constructed from a primitive triangulation\n$K$ of a moment polytope $P$ of $Y$ and a $0$-cochain $\\varepsilon$ on $K$ with\ncoefficients in the field with two elements $\\mathbb{F}_2$, called a sign\ndistribution. O. Viro showed that when $K$ is convex the T-hypersurface is\nambiantly isotopic to a real algebraic hypersurface of $Y$. A. Renaudineau and\nK. Shaw gave upper bounds on the Betti numbers of T-hypersurfaces in terms of\nthe Hodge numbers of a generic section of the ample line bundle $L$ associated\nwith the moment polytope. In particular, the number of connected components of\na T-hypersurface cannot exceed the geometric genus of a generic section of $L$\nplus one. In this article we investigate whether this upper bound is\nattainable. We are able to characterise the couples $(K;\\varepsilon)$ leading\nto T-hypersurfaces realising the Renaudineau-Shaw upper bound on the number of\nconnected components. This theorem generalises B. Haas' theorem for T-curves.\nIn contrast with this results we find that the upper bound is not always\nattainable on every primitive triangulations. For some of those on which it is\nnot attainable we provide a sharper upper bound. Finally we use our\ncharacterisation to show that there always exists a triangulation and a sign\ndistribution on the standard simplex that reach the Renaudineau-Shaw upper\nbound. We also study the growth of the expected number of connected components\nof a T-hypersurface as we dilate the moment polytope by $d$ (i.e. we tensorise\nthe line bundle $d$-times with itself) and show that it is always of the order\nof $d^n$ where $n$ is the dimension of $P$.\n","subjects":["Mathematics/Algebraic Geometry"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}