{"id":"2408.10877","title":"Varying water activity and momentum transfer on comet\n  67P/Churyumov-Gerasimenko from its non-gravitational forces and torques","authors":"N. Attree, P. Guti\\'errez, O. Groussin, J. B\\\"urger, H. U. Keller, T.\n  Kramer, R. Lasagni Manghi, M. L\\\"auter, P. Lemos, J. Markkanen, R. Marschall,\n  and C. Schuckart","authorsParsed":[["Attree","N.",""],["Gutiérrez","P.",""],["Groussin","O.",""],["Bürger","J.",""],["Keller","H. U.",""],["Kramer","T.",""],["Manghi","R. Lasagni",""],["Läuter","M.",""],["Lemos","P.",""],["Markkanen","J.",""],["Marschall","R.",""],["Schuckart","C.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 14:05:33 GMT"}],"updateDate":"2024-08-21","timestamp":1724162733000,"abstract":"  We investigate the ability of a simultaneous fitting of comet\n67P/Churyumov-Gerasimenko's non-gravitational forces, torques and total\nwater-outgassing rate, as observed by Rosetta, to constrain complex\nthermophysical models of cometary material. We extend the previous work of\nfitting geographically defined surface outgassing models to the Rosetta\nobservations by testing the effects of a more detailed geomorphological\nmapping, the resolution of the shape-model used, self-heating by neighbouring\nfacets on the shape-model, thermal inertia in the outgassing solution, and\nvariation in the momentum coupling between the gas and the nucleus. We also\ndirectly compare the non-gravitational acceleration curves available in the\nliterature. We correct an error in the calculation of pole-orientation in the\nprevious paper. We find that, under the assumptions of the model:\nnon-gravitational forces and torques are driven by water sublimation from the\nnucleus, thermal inertia and self-heating have only minor effects, spatially\nuniform activity cannot explain 67P's non-gravitational dynamics, spatially\nuniform momentum transfer cannot explain 67P's non-gravitational dynamics, and\ndifferent terrain types have different instantaneous responses to insolation.\nConsolidated terrain facing south on 67P/Churyumov-Gerasimenko has a high\noutgassing flux, steep response to insolation, and large gas momentum transfer\ncoefficient. Meanwhile, that facing north behaves differently, producing\nlow-to-no water outgassing, and with a lower momentum transfer efficiency.\nDusty terrain also has a lower outgassing rate and momentum transfer\nefficiency, and either depletes its volatile component or is buried in\nfall-back as the comet approaches the Sun. Momentum transfer appears correlated\nwith insolation, likely due to an increased enhancement in the gas temperature\nas the dust it flows through is heated.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}