{"id":"2408.06428","title":"Large Language Models for Secure Code Assessment: A Multi-Language\n  Empirical Study","authors":"Kohei Dozono, Tiago Espinha Gasiba, Andrea Stocco","authorsParsed":[["Dozono","Kohei",""],["Gasiba","Tiago Espinha",""],["Stocco","Andrea",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 18:10:11 GMT"}],"updateDate":"2024-08-14","timestamp":1723486211000,"abstract":"  Most vulnerability detection studies focus on datasets of vulnerabilities in\nC/C++ code, offering limited language diversity. Thus, the effectiveness of\ndeep learning methods, including large language models (LLMs), in detecting\nsoftware vulnerabilities beyond these languages is still largely unexplored. In\nthis paper, we evaluate the effectiveness of LLMs in detecting and classifying\nCommon Weakness Enumerations (CWE) using different prompt and role strategies.\nOur experimental study targets six state-of-the-art pre-trained LLMs (GPT-3.5-\nTurbo, GPT-4 Turbo, GPT-4o, CodeLLama-7B, CodeLLama- 13B, and Gemini 1.5 Pro)\nand five programming languages: Python, C, C++, Java, and JavaScript. We\ncompiled a multi-language vulnerability dataset from different sources, to\nensure representativeness. Our results showed that GPT-4o achieves the highest\nvulnerability detection and CWE classification scores using a few-shot setting.\nAside from the quantitative results of our study, we developed a library called\nCODEGUARDIAN integrated with VSCode which enables developers to perform\nLLM-assisted real-time vulnerability analysis in real-world security scenarios.\nWe have evaluated CODEGUARDIAN with a user study involving 22 developers from\nthe industry. Our study showed that, by using CODEGUARDIAN, developers are more\naccurate and faster at detecting vulnerabilities.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Dl8te111kBwRi8iMa6N2CtWNfl8JF4QvG9ljPcTWnKI","pdfSize":"331466"}
