{"id":"2408.16500","title":"CogVLM2: Visual Language Models for Image and Video Understanding","authors":"Wenyi Hong, Weihan Wang, Ming Ding, Wenmeng Yu, Qingsong Lv, Yan Wang,\n  Yean Cheng, Shiyu Huang, Junhui Ji, Zhao Xue, Lei Zhao, Zhuoyi Yang, Xiaotao\n  Gu, Xiaohan Zhang, Guanyu Feng, Da Yin, Zihan Wang, Ji Qi, Xixuan Song, Peng\n  Zhang, Debing Liu, Bin Xu, Juanzi Li, Yuxiao Dong, Jie Tang","authorsParsed":[["Hong","Wenyi",""],["Wang","Weihan",""],["Ding","Ming",""],["Yu","Wenmeng",""],["Lv","Qingsong",""],["Wang","Yan",""],["Cheng","Yean",""],["Huang","Shiyu",""],["Ji","Junhui",""],["Xue","Zhao",""],["Zhao","Lei",""],["Yang","Zhuoyi",""],["Gu","Xiaotao",""],["Zhang","Xiaohan",""],["Feng","Guanyu",""],["Yin","Da",""],["Wang","Zihan",""],["Qi","Ji",""],["Song","Xixuan",""],["Zhang","Peng",""],["Liu","Debing",""],["Xu","Bin",""],["Li","Juanzi",""],["Dong","Yuxiao",""],["Tang","Jie",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 12:59:12 GMT"}],"updateDate":"2024-08-30","timestamp":1724936352000,"abstract":"  Beginning with VisualGLM and CogVLM, we are continuously exploring VLMs in\npursuit of enhanced vision-language fusion, efficient higher-resolution\narchitecture, and broader modalities and applications. Here we propose the\nCogVLM2 family, a new generation of visual language models for image and video\nunderstanding including CogVLM2, CogVLM2-Video and GLM-4V. As an image\nunderstanding model, CogVLM2 inherits the visual expert architecture with\nimproved training recipes in both pre-training and post-training stages,\nsupporting input resolution up to $1344 \\times 1344$ pixels. As a video\nunderstanding model, CogVLM2-Video integrates multi-frame input with timestamps\nand proposes automated temporal grounding data construction. Notably, CogVLM2\nfamily has achieved state-of-the-art results on benchmarks like MMBench,\nMM-Vet, TextVQA, MVBench and VCGBench. All models are open-sourced in\nhttps://github.com/THUDM/CogVLM2 and https://github.com/THUDM/GLM-4,\ncontributing to the advancement of the field.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}