{"id":"2408.03048","title":"Exploring the range of impacts of helium in the spectra of double\n  detonation models for Type Ia supernovae","authors":"F. P. Callan, C. E. Collins, S. A. Sim, L. J. Shingles, R. Pakmor, S.\n  Srivastav, J. M. Pollin, S. Gronow, F. K. Roepke and I. R. Seitenzahl","authorsParsed":[["Callan","F. P.",""],["Collins","C. E.",""],["Sim","S. A.",""],["Shingles","L. J.",""],["Pakmor","R.",""],["Srivastav","S.",""],["Pollin","J. M.",""],["Gronow","S.",""],["Roepke","F. K.",""],["Seitenzahl","I. R.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 09:05:21 GMT"}],"updateDate":"2024-08-07","timestamp":1722935121000,"abstract":"  In the double detonation scenario the ignition of a surface He detonation on\na sub-Chandrasekhar mass white dwarf leads to a secondary core detonation.\nDouble detonation models have shown promise for explaining Type Ia supernovae\n(SNe Ia) with a variety of luminosities. A key feature of such models is\nunburnt He in the ejecta, which can show significant variation in both its mass\nand velocity distribution. Many previous radiative transfer simulations for\ndouble detonation models have neglected treatment of non-thermal ionization and\nexcitation, preventing them from robustly assessing whether He spectral\nfeatures are expected to form. We present a non local thermodynamic equilibrium\nradiative transfer simulation, including treatment for non-thermal electrons,\nfor a double detonation model with a modest mass of He (${\\sim}$0.04\nM${\\odot}$) ejected at reasonably low velocities\n(${\\sim}$12000$\\,\\mathrm{km}\\,\\mathrm{s}^{-1}$). Despite our simulation\npredicting no clear optical He features, a strong and persistent He I\n10830$\\,\\r{A}$ absorption feature forms that is significantly blended with the\nspectral contribution of Mg II 10927$\\,\\r{A}$. For some normal SNe Ia the Mg\nfeature shows an extended blue wing, previously attributed to C I, however the\nsimulated He feature shows its strongest absorption at wavelengths consistent\nwith this wing. We therefore suggest this extended wing is instead a spectral\nsignature of He. The He feature predicted by this particular model is too\nstrong and persistent to be consistent with normal SNe Ia, however, this\nmotivates further work to use this observable signature to test the parameter\nspace for double detonation models.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}