{"id":"2408.01458","title":"Surveys Considered Harmful? Reflecting on the Use of Surveys in AI\n  Research, Development, and Governance","authors":"Mohammmad Tahaei, Daricia Wilkinson, Alisa Frik, Michael Muller, Ruba\n  Abu-Salma, Lauren Wilcox","authorsParsed":[["Tahaei","Mohammmad",""],["Wilkinson","Daricia",""],["Frik","Alisa",""],["Muller","Michael",""],["Abu-Salma","Ruba",""],["Wilcox","Lauren",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 22:10:49 GMT"}],"updateDate":"2024-08-06","timestamp":1722031849000,"abstract":"  Calls for engagement with the public in Artificial Intelligence (AI)\nresearch, development, and governance are increasing, leading to the use of\nsurveys to capture people's values, perceptions, and experiences related to AI.\nIn this paper, we critically examine the state of human participant surveys\nassociated with these topics. Through both a reflexive analysis of a survey\npilot spanning six countries and a systematic literature review of 44 papers\nfeaturing public surveys related to AI, we explore prominent perspectives and\nmethodological nuances associated with surveys to date. We find that public\nsurveys on AI topics are vulnerable to specific Western knowledge, values, and\nassumptions in their design, including in their positioning of ethical concepts\nand societal values, lack sufficient critical discourse surrounding deployment\nstrategies, and demonstrate inconsistent forms of transparency in their\nreporting. Based on our findings, we distill provocations and heuristic\nquestions for our community, to recognize the limitations of surveys for\nmeeting the goals of engagement, and to cultivate shared principles to design,\ndeploy, and interpret surveys cautiously and responsibly.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0RT56unXDHnQYiXf9iybHKF0DQDXCrX_cxrVX76TRB4","pdfSize":"262809","txDigest":"39yiK3rx4MiGjYbewz5sfKssjYUpcunkR5tiika5ke1u","endEpoch":"1","status":"CERTIFIED"}
