{"id":"2408.05608","title":"TOPGN: Real-time Transparent Obstacle Detection using Lidar Point Cloud\n  Intensity for Autonomous Robot Navigation","authors":"Kasun Weerakoon, Adarsh Jagan Sathyamoorthy, Mohamed Elnoor, Anuj\n  Zore, Dinesh Manocha","authorsParsed":[["Weerakoon","Kasun",""],["Sathyamoorthy","Adarsh Jagan",""],["Elnoor","Mohamed",""],["Zore","Anuj",""],["Manocha","Dinesh",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 18:22:46 GMT"}],"updateDate":"2024-08-13","timestamp":1723314166000,"abstract":"  We present TOPGN, a novel method for real-time transparent obstacle detection\nfor robot navigation in unknown environments. We use a multi-layer 2D grid map\nrepresentation obtained by summing the intensities of lidar point clouds that\nlie in multiple non-overlapping height intervals. We isolate a neighborhood of\npoints reflected from transparent obstacles by comparing the intensities in the\ndifferent 2D grid map layers. Using the neighborhood, we linearly extrapolate\nthe transparent obstacle by computing a tangential line segment and use it to\nperform safe, real-time collision avoidance. Finally, we also demonstrate our\ntransparent object isolation's applicability to mapping an environment. We\ndemonstrate that our approach detects transparent objects made of various\nmaterials (glass, acrylic, PVC), arbitrary shapes, colors, and textures in a\nvariety of real-world indoor and outdoor scenarios with varying lighting\nconditions. We compare our method with other glass/transparent object detection\nmethods that use RGB images, 2D laser scans, etc. in these benchmark scenarios.\nWe demonstrate superior detection accuracy in terms of F-score improvement at\nleast by 12.74% and 38.46% decrease in mean absolute error (MAE), improved\nnavigation success rates (at least two times better than the second-best), and\na real-time inference rate (~50Hz on a mobile CPU). We will release our code\nand challenging benchmarks for future evaluations upon publication.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"McOTl3K3JckpsRtWYtCkSSo8n44c9O0MTCOmZ_EOAJg","pdfSize":"3258603"}
