{"id":"2408.06801","title":"Time-asymptotic stability of composite waves of degenerate Oleinik shock\n  and rarefaction for non-convex conservation laws","authors":"Feimin Huang, Yi Wang, Jian Zhang","authorsParsed":[["Huang","Feimin",""],["Wang","Yi",""],["Zhang","Jian",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 10:45:05 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 07:55:37 GMT"}],"updateDate":"2024-09-04","timestamp":1723545905000,"abstract":"  We are concerned with the large-time behavior of the solution to\none-dimensional (1D) cubic non-convex scalar viscous conservation laws. Due to\nthe inflection point of the cubic non-convex flux, the solution to the\ncorresponding inviscid Riemann problem can be the composite wave of a\ndegenerate Oleinik shock and a rarefaction wave and these two nonlinear waves\nare always attached together. We give a first proof of the time-asymptotic\nstability of this composite wave, up to a time-dependent shift to the viscous\nOleinik shock, for the viscous equation. The Oleinik shock wave strength can be\narbitrarily large. The main difficulty is due to the incompatibility of the\ntime-asymptotic stability proof framework of individual viscous shock by the\nso-called anti-derivative method and the direct $L^2$-energy method to\nrarefaction wave. Here we develop a new type of $a$-contraction method with\nsuitable weight function and the time-dependent shift to the viscous shock,\nwhich is motivated by [9,12]. Another difficulty comes from that the Oleinik\nshock and rarefaction wave are always attached together and their wave\ninteractions are very subtle. Therefore, the same time-dependent shift needs to\nbe equipped to both Oleinik shock and rarefaction wave such that the wave\ninteractions can be treated in our stability proof. Time-asymptotically, this\nshift function grows strictly sub-linear with respect to the time and then the\nshifted rarefaction wave is equivalent to the original self-similar rarefaction\nwave.\n","subjects":["Mathematics/Analysis of PDEs","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"lzuguaF0vPraZ_bngqav8xqovdWxv8_5h6xAGVQMD8w","pdfSize":"395490"}
