{"id":"2408.14241","title":"Complexity of Quantum-Mechanical Evolutions from Probability Amplitudes","authors":"Carlo Cafaro, Leonardo Rossetti, Paul M. Alsing","authorsParsed":[["Cafaro","Carlo",""],["Rossetti","Leonardo",""],["Alsing","Paul M.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 12:54:51 GMT"}],"updateDate":"2024-08-27","timestamp":1724676891000,"abstract":"  We study the complexity of both time-optimal and time sub-optimal quantum\nHamiltonian evolutions connecting arbitrary source and a target states on the\nBloch sphere equipped with the Fubini-Study metric. This investigation is\nperformed in a number of steps. First, we describe each unitary Schr\\\"odinger\nquantum evolution by means of the path length, the geodesic efficiency, the\nspeed efficiency, and the curvature coefficient of its corresponding dynamical\ntrajectory linking the source state to the target state. Second, starting from\na classical probabilistic setting where the so-called information geometric\ncomplexity can be employed to describe the complexity of entropic motion on\ncurved statistical manifolds underlying the physics of systems when only\npartial knowledge about them is available, we transition into a deterministic\nquantum setting. In this context, after proposing a definition of the\ncomplexity of a quantum evolution, we present a notion of quantum complexity\nlength scale. In particular, we discuss the physical significance of both\nquantities in terms of the accessed (i.e., partial) and accessible (i.e.,\ntotal) parametric volumes of the regions on the Bloch sphere that specify the\nquantum mechanical evolution from the source to the target states. Fourth,\nafter calculating the complexity measure and the complexity length scale for\neach one of the two quantum evolutions, we compare the behavior of our measures\nwith that of the path length, the geodesic efficiency, the speed efficiency,\nand the curvature coefficient. We find that, in general, efficient quantum\nevolutions are less complex than inefficient evolutions. However, we also\nobserve that complexity is more than length. Indeed, longer paths that are\nsufficiently bent can exhibit a behavior that is less complex than that of\nshorter paths with a smaller curvature coefficient.\n","subjects":["Physics/Quantum Physics","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}