{"id":"2408.10363","title":"Self-testing of multiple unsharpness parameters through sequential\n  violations of non-contextual inequality","authors":"Rajdeep Paul, Souradeep Sasmal and A. K. Pan","authorsParsed":[["Paul","Rajdeep",""],["Sasmal","Souradeep",""],["Pan","A. K.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 19:04:48 GMT"}],"updateDate":"2024-08-21","timestamp":1724094288000,"abstract":"  The self-testing protocols refer to novel device-independent certification\nschemes wherein the devices are uncharacterised, and the dimension of the\nsystem remains unspecified. The optimal quantum violation of a Bell's\ninequality facilitates such self-testing. In this work, we put forth a protocol\nfor self-testing of noisy quantum instruments, specifically, the unsharpness\nparameter of smeared projective measurements in any arbitrary dimension. Our\nprotocol hinges on the sequential quantum violations of a bipartite Bell-type\npreparation non-contextual inequality, involving three measurement settings per\nparty. First, we demonstrate that at most three sequential independent Bobs\nmanifest simultaneous preparation contextuality with a single Alice through the\nviolation of this inequality. Subsequently, we show that the sub-optimal\nsequential quantum violations of the non-contextual inequality form an optimal\nset, eventually enabling the self-testing of shared state, local measurements\nand unsharpness parameters of one party. Notably, we derive the optimal set of\nquantum violations without specifying the dimension of the quantum system,\nthereby circumventing the constraint that may arise due to Naimark's theorem.\nFurthermore, we extend our investigation to quantify the degree of incompatible\nmeasurements pertaining to the sequential observers, exploring how variations\nin the degree of incompatibility impact the values of unsharp parameters\nnecessary for sequential quantum violation.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tr2tQyWlaB6FZ6lyWS3KoY8-Yt7MDslssZNWXx5Om5Q","pdfSize":"1089839"}
