{"id":"2408.16810","title":"The TRGB-SBF Project. II. Resolving the Virgo Cluster with JWST","authors":"Gagandeep S. Anand, R. Brent Tully, Yotam Cohen, Edward J. Shaya,\n  Dmitry I. Makarov, Lidia N. Makarova, Maksim I. Chazov, John P. Blakeslee,\n  Michele Cantiello, Joseph B. Jensen, Ehsan Kourkchi, Gabriella Raimondo","authorsParsed":[["Anand","Gagandeep S.",""],["Tully","R. Brent",""],["Cohen","Yotam",""],["Shaya","Edward J.",""],["Makarov","Dmitry I.",""],["Makarova","Lidia N.",""],["Chazov","Maksim I.",""],["Blakeslee","John P.",""],["Cantiello","Michele",""],["Jensen","Joseph B.",""],["Kourkchi","Ehsan",""],["Raimondo","Gabriella",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-09-02","timestamp":1724954400000,"abstract":"  The Virgo Cluster is the nearest substantial cluster of galaxies to the Milky\nWay and a cornerstone of the extragalactic distance scale. Here, we present\nJWST/NIRCam observations that simultaneously cover the cores and halos of ten\ngalaxies in and around the Virgo Cluster and are designed to perform\nsimultaneous measurements of the tip of the red giant branch (TRGB) and surface\nbrightness fluctuations (SBF). Seven of the targets are within the Virgo\nCluster and where we are able to resolve some of the cluster's substructure,\nwhile an additional three provide important constraints on Virgo infall. The\nseven galaxies within Virgo itself all have SBF measurements from the Advanced\nCamera for Surveys Virgo Cluster Survey (ACSVCS). After adjusting the ACSVCS\nmeasurements for the offset from our new JWST TRGB measurements, we determine a\ndistance to the Virgo Cluster of d $=$ 16.17 $\\pm$ 0.25 (stat) $\\pm$ 0.47 (sys)\nMpc. The work presented here is part of a larger program to develop a\nPopulation II distance scale through the TRGB and SBF that is completely\nindependent of the prominent Cepheid + Type Ia supernova ladder. The TRGB\ndistances to the galaxies presented here, when combined with future SBF\nmeasurements, will provide a crucial step forward for determining whether or\nnot systematic errors can explain the well-known \"Hubble tension'' or if there\nis significant evidence for cracks in the $\\Lambda$CDM model.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}