{"id":"2408.04326","title":"Multi-Scale and Detail-Enhanced Segment Anything Model for Salient\n  Object Detection","authors":"Shixuan Gao and Pingping Zhang and Tianyu Yan and Huchuan Lu","authorsParsed":[["Gao","Shixuan",""],["Zhang","Pingping",""],["Yan","Tianyu",""],["Lu","Huchuan",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 09:09:37 GMT"}],"updateDate":"2024-08-09","timestamp":1723108177000,"abstract":"  Salient Object Detection (SOD) aims to identify and segment the most\nprominent objects in images. Advanced SOD methods often utilize various\nConvolutional Neural Networks (CNN) or Transformers for deep feature\nextraction. However, these methods still deliver low performance and poor\ngeneralization in complex cases. Recently, Segment Anything Model (SAM) has\nbeen proposed as a visual fundamental model, which gives strong segmentation\nand generalization capabilities. Nonetheless, SAM requires accurate prompts of\ntarget objects, which are unavailable in SOD. Additionally, SAM lacks the\nutilization of multi-scale and multi-level information, as well as the\nincorporation of fine-grained details. To address these shortcomings, we\npropose a Multi-scale and Detail-enhanced SAM (MDSAM) for SOD. Specifically, we\nfirst introduce a Lightweight Multi-Scale Adapter (LMSA), which allows SAM to\nlearn multi-scale information with very few trainable parameters. Then, we\npropose a Multi-Level Fusion Module (MLFM) to comprehensively utilize the\nmulti-level information from the SAM's encoder. Finally, we propose a Detail\nEnhancement Module (DEM) to incorporate SAM with fine-grained details.\nExperimental results demonstrate the superior performance of our model on\nmultiple SOD datasets and its strong generalization on other segmentation\ntasks. The source code is released at https://github.com/BellyBeauty/MDSAM.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}