{"id":"2408.10714","title":"Physics-Driven AI Correction in Laser Absorption Sensing Quantification","authors":"Ruiyuan Kang, Panos Liatsis, Meixia Geng, Qingjie Yang","authorsParsed":[["Kang","Ruiyuan",""],["Liatsis","Panos",""],["Geng","Meixia",""],["Yang","Qingjie",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 10:29:41 GMT"}],"updateDate":"2024-08-21","timestamp":1724149781000,"abstract":"  Laser absorption spectroscopy (LAS) quantification is a popular tool used in\nmeasuring temperature and concentration of gases. It has low error tolerance,\nwhereas current ML-based solutions cannot guarantee their measure reliability.\nIn this work, we propose a new framework, SPEC, to address this issue. In\naddition to the conventional ML estimator-based estimation mode, SPEC also\nincludes a Physics-driven Anomaly Detection module (PAD) to assess the error of\nthe estimation. And a Correction mode is designed to correct the unreliable\nestimation. The correction mode is a network-based optimization algorithm,\nwhich uses the guidance of error to iteratively correct the estimation. A\nhybrid surrogate error model is proposed to estimate the error distribution,\nwhich contains an ensemble of networks to simulate reconstruction error, and\ntrue feasible error computation. A greedy ensemble search is proposed to find\nthe optimal correction robustly and efficiently from the gradient guidance of\nsurrogate model. The proposed SPEC is validated on the test scenarios which are\noutside the training distribution. The results show that SPEC can significantly\nimprove the estimation quality, and the correction mode outperforms current\nnetwork-based optimization algorithms. In addition, SPEC has the\nreconfigurability, which can be easily adapted to different quantification\ntasks via changing PAD without retraining the ML estimator.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"99Sq2RdnKzgVaYIDvTTm42y12LqpPJ8as6NP_MtJLeQ","pdfSize":"2822163"}
