{"id":"2408.14143","title":"2D-Malafide: Adversarial Attacks Against Face Deepfake Detection Systems","authors":"Chiara Galdi, Michele Panariello, Massimiliano Todisco, Nicholas Evans","authorsParsed":[["Galdi","Chiara",""],["Panariello","Michele",""],["Todisco","Massimiliano",""],["Evans","Nicholas",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 09:41:40 GMT"}],"updateDate":"2024-08-28","timestamp":1724665300000,"abstract":"  We introduce 2D-Malafide, a novel and lightweight adversarial attack designed\nto deceive face deepfake detection systems. Building upon the concept of 1D\nconvolutional perturbations explored in the speech domain, our method leverages\n2D convolutional filters to craft perturbations which significantly degrade the\nperformance of state-of-the-art face deepfake detectors. Unlike traditional\nadditive noise approaches, 2D-Malafide optimises a small number of filter\ncoefficients to generate robust adversarial perturbations which are\ntransferable across different face images. Experiments, conducted using the\nFaceForensics++ dataset, demonstrate that 2D-Malafide substantially degrades\ndetection performance in both white-box and black-box settings, with larger\nfilter sizes having the greatest impact. Additionally, we report an\nexplainability analysis using GradCAM which illustrates how 2D-Malafide\nmisleads detection systems by altering the image areas used most for\nclassification. Our findings highlight the vulnerability of current deepfake\ndetection systems to convolutional adversarial attacks as well as the need for\nfuture work to enhance detection robustness through improved image fidelity\nconstraints.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pS4HjBivc1CqcOlWoqabYhLZraEmjf-b9QyU9PH4Gtc","pdfSize":"6285263"}
