{"id":"2408.10755","title":"Generating Synthetic Fair Syntax-agnostic Data by Learning and\n  Distilling Fair Representation","authors":"Md Fahim Sikder, Resmi Ramachandranpillai, Daniel de Leng, Fredrik\n  Heintz","authorsParsed":[["Sikder","Md Fahim",""],["Ramachandranpillai","Resmi",""],["de Leng","Daniel",""],["Heintz","Fredrik",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 11:37:52 GMT"}],"updateDate":"2024-08-21","timestamp":1724153872000,"abstract":"  Data Fairness is a crucial topic due to the recent wide usage of AI powered\napplications. Most of the real-world data is filled with human or machine\nbiases and when those data are being used to train AI models, there is a chance\nthat the model will reflect the bias in the training data. Existing\nbias-mitigating generative methods based on GANs, Diffusion models need\nin-processing fairness objectives and fail to consider computational overhead\nwhile choosing computationally-heavy architectures, which may lead to high\ncomputational demands, instability and poor optimization performance. To\nmitigate this issue, in this work, we present a fair data generation technique\nbased on knowledge distillation, where we use a small architecture to distill\nthe fair representation in the latent space. The idea of fair latent space\ndistillation enables more flexible and stable training of Fair Generative\nModels (FGMs). We first learn a syntax-agnostic (for any data type) fair\nrepresentation of the data, followed by distillation in the latent space into a\nsmaller model. After distillation, we use the distilled fair latent space to\ngenerate high-fidelity fair synthetic data. While distilling, we employ quality\nloss (for fair distillation) and utility loss (for data utility) to ensure that\nthe fairness and data utility characteristics remain in the distilled latent\nspace. Our approaches show a 5%, 5% and 10% rise in performance in fairness,\nsynthetic sample quality and data utility, respectively, than the\nstate-of-the-art fair generative model.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"e1Pxi25-ddGnsgj3hUR8ciSk2wbl7TWw6mcNBbhBOPQ","pdfSize":"2242868"}
