{"id":"2408.08631","title":"Persona is a Double-edged Sword: Enhancing the Zero-shot Reasoning by\n  Ensembling the Role-playing and Neutral Prompts","authors":"Junseok Kim, Nakyeong Yang, and Kyomin Jung","authorsParsed":[["Kim","Junseok",""],["Yang","Nakyeong",""],["Jung","Kyomin",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 09:49:51 GMT"}],"updateDate":"2024-08-19","timestamp":1723801791000,"abstract":"  Recent studies demonstrate that prompting an appropriate role-playing persona\nto an LLM improves its reasoning capability. However, assigning a proper\npersona is difficult since an LLM's performance is extremely sensitive to\nassigned prompts; therefore, personas sometimes hinder LLMs and degrade their\nreasoning capabilities. In this paper, we propose a novel framework, Jekyll \\&\nHyde, which ensembles the results of role-playing and neutral prompts to\neradicate performance degradation via unilateral use of role-playing prompted\nLLM and enhance the robustness of an LLM's reasoning ability. Specifically,\nJekyll \\& Hyde collects two potential solutions from both role-playing and\nneutral prompts and selects a better solution after cross-checking via an LLM\nevaluator. However, LLM-based evaluators tend to be affected by the order of\nthose potential solutions within the prompt when selecting the proper solution;\nthus, we also propose a robust LLM evaluator to mitigate the position bias. The\nexperimental analysis demonstrates that role-playing prompts distract LLMs and\ndegrade their reasoning abilities in 4 out of 12 datasets, even when using\nGPT-4. In addition, we reveal that Jekyll \\& Hyde improves reasoning\ncapabilities by selecting better choices among the potential solutions on\ntwelve widely-used reasoning datasets. We further show that our proposed LLM\nevaluator outperforms other baselines, proving the LLMs' position bias is\nsuccessfully mitigated.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"aLHF8ujpelcrAt78NTVnj8IavPfAIDbYr5JFYlm-fHo","pdfSize":"582245"}
