{"id":"2408.01491","title":"Accreting companion occurrence rates using a new method to compute\n  emission-line survey sensitivity: Application to the H-alpha Giant Accreting\n  Protoplanet Survey (GAPlanetS)","authors":"Cailin Plunkett, Katherine B. Follette, Gabriel-Dominique Marleau,\n  Eric Nielsen","authorsParsed":[["Plunkett","Cailin",""],["Follette","Katherine B.",""],["Marleau","Gabriel-Dominique",""],["Nielsen","Eric",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 18:00:01 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 14:20:23 GMT"}],"updateDate":"2024-08-28","timestamp":1722621601000,"abstract":"  A key scientific goal of exoplanet surveys is to characterize the underlying\npopulation of planets in the local galaxy. In particular, the properties of\naccreting protoplanets can inform the rates and physical processes of planet\nformation. We develop a novel method to compute sensitivity to protoplanets in\nemission-line direct-imaging surveys, enabling estimates of protoplanet\npopulation properties under various planetary accretion and formation theories.\nIn this work, we specialize to the case of H-alpha and investigate three\nformation models governing the planetary-mass-to-mass-accretion-rate power law,\nand two accretion models that describe the scaling between total accretion\nluminosity and observable H-alpha line luminosity. We apply our method to the\nresults of the Magellan Giant Accreting Protoplanet Survey (GAPlanetS) to place\nthe first constraints on accreting companion occurrence rates in systems with\ntransitional circumstellar disks. We compute the posterior probability for\ntransitional disk systems to host an accreting companion (-8< log MMdot MJ^2/yr\n< -2) within 2 arcseconds (~200 au). Across accretion models, we find\nconsistent accreting companion rates, with median and one-sigma credible\nintervals of 0.15 (+0.18, -0.10) and 0.19 (+0.23, -0.12). Our technique enables\nstudying protoplanet populations under flexible assumptions about planet\nformation. This formalism provides the statistical underpinning necessary for\nprotoplanet surveys to discriminate among formation and accretion theories for\nplanets and brown dwarfs.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"TJQJocOPSOQNXdEILELi9l2EcX4gT4mN849eNoLnJGE","pdfSize":"4496424"}
