{"id":"2408.00860","title":"UlRe-NeRF: 3D Ultrasound Imaging through Neural Rendering with\n  Ultrasound Reflection Direction Parameterization","authors":"Ziwen Guo, Zi Fang, and Zhuang Fu","authorsParsed":[["Guo","Ziwen",""],["Fang","Zi",""],["Fu","Zhuang",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 18:22:29 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 14:00:40 GMT"},{"version":"v3","created":"Fri, 13 Sep 2024 13:40:31 GMT"}],"updateDate":"2024-09-16","timestamp":1722536549000,"abstract":"  Three-dimensional ultrasound imaging is a critical technology widely used in\nmedical diagnostics. However, traditional 3D ultrasound imaging methods have\nlimitations such as fixed resolution, low storage efficiency, and insufficient\ncontextual connectivity, leading to poor performance in handling complex\nartifacts and reflection characteristics. Recently, techniques based on NeRF\n(Neural Radiance Fields) have made significant progress in view synthesis and\n3D reconstruction, but there remains a research gap in high-quality ultrasound\nimaging. To address these issues, we propose a new model, UlRe-NeRF, which\ncombines implicit neural networks and explicit ultrasound volume rendering into\nan ultrasound neural rendering architecture. This model incorporates reflection\ndirection parameterization and harmonic encoding, using a directional MLP\nmodule to generate view-dependent high-frequency reflection intensity\nestimates, and a spatial MLP module to produce the medium's physical property\nparameters. These parameters are used in the volume rendering process to\naccurately reproduce the propagation and reflection behavior of ultrasound\nwaves in the medium. Experimental results demonstrate that the UlRe-NeRF model\nsignificantly enhances the realism and accuracy of high-fidelity ultrasound\nimage reconstruction, especially in handling complex medium structures.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}