{"id":"2408.11894","title":"Automated Synthesis of Fault-Tolerant State Preparation Circuits for\n  Quantum Error Correction Codes","authors":"Tom Peham, Ludwig Schmid, Lucas Berent, Markus M\\\"uller and Robert\n  Wille","authorsParsed":[["Peham","Tom",""],["Schmid","Ludwig",""],["Berent","Lucas",""],["Müller","Markus",""],["Wille","Robert",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 18:00:01 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 09:06:29 GMT"}],"updateDate":"2024-09-04","timestamp":1724263201000,"abstract":"  A central ingredient in fault-tolerant quantum algorithms is the\ninitialization of a logical state for a given quantum error-correcting code\nfrom a set of noisy qubits. A scheme that has demonstrated promising results\nfor small code instances that are realizable on currently available hardware\ncomposes a non-fault-tolerant state preparation step with a verification step\nthat checks for spreading errors. Known circuit constructions of this scheme\nare mostly obtained manually, and no algorithmic techniques for constructing\ndepth- or gate-optimal circuits exist. As a consequence, the current state of\nthe art exploits this scheme only for specific code instances and mostly for\nthe special case of distance 3 codes. In this work, we propose an automated\napproach for synthesizing fault-tolerant state preparation circuits for\narbitrary CSS codes. We utilize methods based on satisfiability solving (SAT)\ntechniques to construct fault-tolerant state preparation circuits consisting of\ndepth- and gate-optimal preparation and verification circuits. We also provide\nheuristics that can synthesize fault-tolerant state preparation circuits for\ncode instances where no optimal solution can be obtained in an adequate\ntimeframe. Moreover, we give a general construction for non-deterministic state\npreparation circuits beyond distance 3. Numerical evaluations using $d=3$ and\n$d=5$ codes confirm that the generated circuits exhibit the desired scaling of\nthe logical error rates. The resulting methods are publicly available as part\nof the Munich Quantum Toolkit (MQT) at https://github.com/cda-tum/mqt-qecc.\nSuch methods are an important step in providing fault-tolerant circuit\nconstructions that can aid in near-term demonstration of fault-tolerant quantum\ncomputing.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Emerging Technologies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}