{"id":"2408.16184","title":"Development and Implementation of Advanced Beam Diagnostic and Abort\n  Systems in SuperKEKB","authors":"Keisuke Yoshihara, Tetsuro Abe, Michele Aversano, Alexander Gale,\n  Hitomi Ikeda, Hiroshi Kaji, Hidekazu Kakuno, Taichiro Koga, Toru Iijima,\n  Shinnosuke Kato, Ami Kusudo, Yuxin Liu, Akane Maeda, Sayan Mitra, Gaku\n  Mitsuka, Kenkichi Miyabayashi, Isamu Nakamura, Hiroyuki Nakayama, Yu\n  Nakazawa, Riku Nomaru, Iori Okada, Xiao-Dong Shi, Shuji Tanaka, Kenta Uno,\n  Yutaka Ushiroda, Bela Urbschat, Rui Zhang","authorsParsed":[["Yoshihara","Keisuke",""],["Abe","Tetsuro",""],["Aversano","Michele",""],["Gale","Alexander",""],["Ikeda","Hitomi",""],["Kaji","Hiroshi",""],["Kakuno","Hidekazu",""],["Koga","Taichiro",""],["Iijima","Toru",""],["Kato","Shinnosuke",""],["Kusudo","Ami",""],["Liu","Yuxin",""],["Maeda","Akane",""],["Mitra","Sayan",""],["Mitsuka","Gaku",""],["Miyabayashi","Kenkichi",""],["Nakamura","Isamu",""],["Nakayama","Hiroyuki",""],["Nakazawa","Yu",""],["Nomaru","Riku",""],["Okada","Iori",""],["Shi","Xiao-Dong",""],["Tanaka","Shuji",""],["Uno","Kenta",""],["Ushiroda","Yutaka",""],["Urbschat","Bela",""],["Zhang","Rui",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 00:45:38 GMT"}],"updateDate":"2024-08-30","timestamp":1724892338000,"abstract":"  The SuperKEKB/Belle II experiment aims to collect high-statistics data of B\nmeson pairs to explore new physics beyond the Standard Model (SM). SuperKEKB,\nan upgraded version of the KEKB accelerator, has achieved a world-record\nluminosity of $4.71 \\times 10^{34} \\, \\mathrm{cm^{-2}s^{-1}}$ in 2022 but\ncontinues to strive for higher luminosities. One of the major obstacles is\nSudden Beam Loss (SBL) events, which cause substantial beam losses and damage\nto the Belle~II detector. To find a hint for addressing SBL challenges,\nadvanced beam diagnostic systems and enhanced beam abort systems have been\ndeveloped. The diagnostic system aims to accurately pinpoint the start of beam\nlosses, while the upgraded abort system quickly disposes of anomalous beams to\nminimize damage.\n  This paper details the development and implementation of these systems,\nincluding high-speed loss monitors, time synchronization with the White Rabbit\nsystem, and data acquisition systems. Efforts to understand the mechanisms of\nSBL events, using acoustic sensors to detect discharges, are also discussed.\nThese measures aim to improve the operational stability and luminosity of\nSuperKEKB, contributing to the experiment's success.\n","subjects":["Physics/High Energy Physics - Experiment","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/"}