{"id":"2408.09832","title":"Clock synchronization and light-travel-time estimation for space-based\n  gravitational-wave detectors","authors":"Jan Niklas Reinhardt, Olaf Hartwig, and Gerhard Heinzel","authorsParsed":[["Reinhardt","Jan Niklas",""],["Hartwig","Olaf",""],["Heinzel","Gerhard",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 09:28:05 GMT"}],"updateDate":"2024-08-20","timestamp":1724059685000,"abstract":"  Space-based gravitational-wave detectors, such as LISA, record\ninterferometric measurements on widely separated satellites. Their clocks are\nnot synced actively. Instead, clock synchronization is performed in on-ground\ndata processing. It relies on measurements of the so-called pseudoranges, which\nentangle the interspacecraft light travel times with the clock\ndesynchronizations between emitting and receiving spacecraft. For\ninterspacecraft clock synchronization, we need to isolate the differential\nclock desynchronizations, i.e., disentangle the pseudoranges. This further\nyields estimates for the interspacecraft light travel times, which are required\nas delays for the laser frequency noise suppression via time-delay\ninterferometry. Previous studies on pseudorange disentanglement apply various\nsimplifications in the pseudorange modeling and the data simulation. In\ncontrast, this article derives an accurate pseudorange model in the barycentric\ncelestial reference system, complemented by realistic state-of-the-art LISA\ndata simulations. Concerning pseudorange disentanglement, this leads to an a\npriori under-determined system. We demonstrate how on-ground orbit\ndeterminations, as well as onboard transmission and on-ground reception time\ntags of the telemetry data, can be used to resolve this degeneracy. We\nintroduce an algorithm for pseudorange disentanglement based on a nonstandard\nKalman filter specially designed for clock synchronization in systems where\npseudorange measurements are conducted in different time frames. This algorithm\nachieves interspacecraft clock synchronization and light travel time estimation\nwith submeter accuracy, thus fulfilling the requirements of time-delay\ninterferometry.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"2QkzZ8RkDMJ1MYcp2wXDK-kmqO9hrFbIhJmisiPqyQM","pdfSize":"9199320"}
