{"id":"2408.03982","title":"JWST/NIRSpec WIDE survey: a z=4.6 low-mass star-forming galaxy hosting a\n  jet-driven shock with low ionisation and solar metallicity","authors":"Francesco D'Eugenio, Roberto Maiolino, Vijay H. Mahatma, Giovanni\n  Mazzolari, Stefano Carniani, Anna de Graaff, Michael V. Maseda, Eleonora\n  Parlanti, Andrew J. Bunker, Xihan Ji, Gareth C. Jones, Raffaella Morganti,\n  Jan Scholtz, Sandro Tacchella, Clive Tadhunter, Hannah \\\"Ubler, Giacomo\n  Venturi","authorsParsed":[["D'Eugenio","Francesco",""],["Maiolino","Roberto",""],["Mahatma","Vijay H.",""],["Mazzolari","Giovanni",""],["Carniani","Stefano",""],["de Graaff","Anna",""],["Maseda","Michael V.",""],["Parlanti","Eleonora",""],["Bunker","Andrew J.",""],["Ji","Xihan",""],["Jones","Gareth C.",""],["Morganti","Raffaella",""],["Scholtz","Jan",""],["Tacchella","Sandro",""],["Tadhunter","Clive",""],["Übler","Hannah",""],["Venturi","Giacomo",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-09","timestamp":1723053600000,"abstract":"  We present NIRSpec/MSA observations from the JWST large-area survey WIDE,\ntargeting the rest-frame UV-optical spectrum of Ulema, a radio-AGN host at\nredshift z=4.6348. The low-resolution prism spectrum displays high equivalent\nwidth nebular emission, with remarkably high ratios of low-ionisation species\nof oxygen, nitrogen and sulphur, relative to hydrogen; auroral O$^+$ emission\nis clearly detected, possibly also C$^+$. From the high-resolution grating\nspectrum, we measure a gas velocity dispersion $\\sigma$~400 km s$^{-1}$, broad\nenough to rule out star-forming gas in equilibrium in the gravitational\npotential of the galaxy. Emission-line ratio diagnostics suggest that the\nnebular emission is due to a shock which ran out of pre-shock gas. To infer the\nphysical properties of the system, we model simultaneously the galaxy spectral\nenergy distribution (SED) and shock-driven line emission under a Bayesian\nframework. We find a relatively low-mass, star-forming system (M* =\n1.4$\\times$10^{10} M$_\\odot$, SFR = 70 M$_\\odot$ yr$^{-1}$), where shock-driven\nemission contributes 50 per cent to the total H$\\beta$ luminosity. The nebular\nmetallicity is near solar - three times higher than that predicted by the\nmass-metallicity relation at z=4.6, possibly related to fast-paced chemical\nevolution near the galaxy nucleus. We find no evidence for a recent decline in\nthe SFR of the galaxy, meaning that, already at this early epoch, fast\nradio-mode AGN feedback was poorly coupled with the bulk of the star-forming\ngas; therefore, most of the feedback energy must end up in the galaxy halo,\nsetting the stage for future quenching.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ch9Yr7XpIomo5YIErI4QtYipzpwZn2D_1EPRClwkhXM","pdfSize":"3101084"}
