{"id":"2408.11611","title":"DTN: Deep Multiple Task-specific Feature Interactions Network for\n  Multi-Task Recommendation","authors":"Yaowen Bi, Yuteng Lian, Jie Cui, Jun Liu, Peijian Wang, Guanghui Li,\n  Xuejun Chen, Jinglin Zhao, Hao Wen, Jing Zhang, Zhaoqi Zhang, Wenzhuo Song,\n  Yang Sun, Weiwei Zhang, Mingchen Cai, Guanxing Zhang","authorsParsed":[["Bi","Yaowen",""],["Lian","Yuteng",""],["Cui","Jie",""],["Liu","Jun",""],["Wang","Peijian",""],["Li","Guanghui",""],["Chen","Xuejun",""],["Zhao","Jinglin",""],["Wen","Hao",""],["Zhang","Jing",""],["Zhang","Zhaoqi",""],["Song","Wenzhuo",""],["Sun","Yang",""],["Zhang","Weiwei",""],["Cai","Mingchen",""],["Zhang","Guanxing",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 13:39:21 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 08:13:07 GMT"}],"updateDate":"2024-08-26","timestamp":1724247561000,"abstract":"  Neural-based multi-task learning (MTL) has been successfully applied to many\nrecommendation applications. However, these MTL models (e.g., MMoE, PLE) did\nnot consider feature interaction during the optimization, which is crucial for\ncapturing complex high-order features and has been widely used in ranking\nmodels for real-world recommender systems. Moreover, through feature importance\nanalysis across various tasks in MTL, we have observed an interesting\ndivergence phenomenon that the same feature can have significantly different\nimportance across different tasks in MTL. To address these issues, we propose\nDeep Multiple Task-specific Feature Interactions Network (DTN) with a novel\nmodel structure design. DTN introduces multiple diversified task-specific\nfeature interaction methods and task-sensitive network in MTL networks,\nenabling the model to learn task-specific diversified feature interaction\nrepresentations, which improves the efficiency of joint representation learning\nin a general setup. We applied DTN to our company's real-world E-commerce\nrecommendation dataset, which consisted of over 6.3 billion samples, the\nresults demonstrated that DTN significantly outperformed state-of-the-art MTL\nmodels. Moreover, during online evaluation of DTN in a large-scale E-commerce\nrecommender system, we observed a 3.28% in clicks, a 3.10% increase in orders\nand a 2.70% increase in GMV (Gross Merchandise Value) compared to the\nstate-of-the-art MTL models. Finally, extensive offline experiments conducted\non public benchmark datasets demonstrate that DTN can be applied to various\nscenarios beyond recommendations, enhancing the performance of ranking models.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}