{"id":"2408.03794","title":"A universal framework for inclusive 15-minute cities","authors":"Matteo Bruno, Hygor Piaget Monteiro Melo, Bruno Campanelli and\n  Vittorio Loreto","authorsParsed":[["Bruno","Matteo",""],["Melo","Hygor Piaget Monteiro",""],["Campanelli","Bruno",""],["Loreto","Vittorio",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 14:19:56 GMT"}],"updateDate":"2024-08-08","timestamp":1723040396000,"abstract":"  Proximity-based cities have attracted much attention in recent years. The\n15-minute city, in particular, heralded a new vision for cities where essential\nservices must be easily accessible. Despite its undoubted merit in stimulating\ndiscussion on new organisations of cities, the 15-minute city cannot be\napplicable everywhere, and its very definition raises a few concerns. Here, we\ntackle the feasibility and practicability of the '15-minute city' model in many\ncities worldwide. We provide a worldwide quantification of how close cities are\nto the ideal of the 15-minute city. To this end, we measure the accessibility\ntimes to resources and services, and we reveal strong heterogeneity of\naccessibility within and across cities, with a significant role played by local\npopulation densities. We provide an online platform\n(\\href{whatif.sonycsl.it/15mincity}{whatif.sonycsl.it/15mincity}) to access and\nvisualise accessibility scores for virtually all cities worldwide. The\nheterogeneity of accessibility within cities is one of the sources of\ninequality. We thus simulate how much a better redistribution of resources and\nservices could heal inequity by keeping the same resources and services or by\nallowing for virtually infinite resources. We highlight pronounced\ndiscrepancies among cities in the minimum number of additional services needed\nto comply with the 15-minute city concept. We conclude that the proximity-based\nparadigm must be generalised to work on a wide range of local population\ndensities. Finally, socio-economic and cultural factors should be included to\nshift from time-based to value-based cities.\n","subjects":["Physics/Physics and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}