{"id":"2408.11292","title":"Unprecedented Central Engine \"Breathing\" Phenomenon in an Active\n  Supermassive Black Hole","authors":"Shuying Zhou, Mouyuan Sun, Hai-Cheng Feng, Sha-Sha Li, Yongquan Xue,\n  Jun-Xian Wang, Zhen-Yi Cai, Jin-Ming Bai, Danyang Li, Hengxiao Guo, H. T.\n  Liu, Kai-Xing Lu, Jirong Mao, Marcin Marculewicz, and Jian-Guo Wang","authorsParsed":[["Zhou","Shuying",""],["Sun","Mouyuan",""],["Feng","Hai-Cheng",""],["Li","Sha-Sha",""],["Xue","Yongquan",""],["Wang","Jun-Xian",""],["Cai","Zhen-Yi",""],["Bai","Jin-Ming",""],["Li","Danyang",""],["Guo","Hengxiao",""],["Liu","H. T.",""],["Lu","Kai-Xing",""],["Mao","Jirong",""],["Marculewicz","Marcin",""],["Wang","Jian-Guo",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 02:44:35 GMT"}],"updateDate":"2024-08-22","timestamp":1724208275000,"abstract":"  Resolving the inner structures of active galactic nuclei (AGNs) provides the\n\"standard ruler\" to measure the parallax distances of the Universe and a\npowerful way to weigh supermassive black holes (SMBHs). Thanks to time-domain\nobservations, it is possible to use the reverberation mapping (RM) technique to\nmeasure time delays between different light curves that probe the structures of\nthe SMBH accretion disks and broad line regions (BLRs), which are otherwise\noften too compact to be spatially resolved for most AGNs. Despite decades of RM\nstudies, the critical physical process that controls the structures of SMBH\naccretion disk and BLR and their temporal evolution remains unclear. Here we\nreport the variation of the SMBH accretion disk structure of NGC 4151 in\nresponse to changes in luminosity within 6 years. In the high-flux state, the\ntime delays measured from our continuum RM with high-cadence (2 days)\nspectroscopy are 3.8 times larger than that in the low-flux state and 15 times\nlonger than the classical standard thin disk (SSD) prediction. This result\nprovides the first piece of direct evidence that the SMBH disk structure\n\"breathes\" in highly-variable AGN manifestations. The time-delay change\nseverely challenges the popular X-ray reprocessing of the SSD model, with or\nwithout BLR contributions. More importantly, the continuum time delays can be\ncomparable with the time delay between the broad Hb line and the nearby optical\ncontinuum, and the latter is commonly used to calculate the BLR sizes. Hence,\nthe BLR sizes are significantly underestimated if the continuum time delays are\nnot properly considered. This underestimation introduces up to 0.3 dex\nsystematic uncertainties on RM SMBH masses and BLR parallax distances. Our\nfindings underscore that simultaneous continuum and BLR RM studies are vital\nfor better deciphering the SMBH mass growth and the cosmological expansion\nhistory.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}