{"id":"2408.15236","title":"MADNESS Deblender: Maximum A posteriori with Deep NEural networks for\n  Source Separation","authors":"Biswajit Biswas, Eric Aubourg, Alexandre Boucaud, Axel Guinot, Junpeng\n  Lao, C\\'ecile Roucelle, and the LSST Dark Energy Science Collaboration","authorsParsed":[["Biswas","Biswajit",""],["Aubourg","Eric",""],["Boucaud","Alexandre",""],["Guinot","Axel",""],["Lao","Junpeng",""],["Roucelle","Cécile",""],["Collaboration","the LSST Dark Energy Science",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 17:55:25 GMT"}],"updateDate":"2024-08-28","timestamp":1724781325000,"abstract":"  Due to the unprecedented depth of the upcoming ground-based Legacy Survey of\nSpace and Time (LSST) at the Vera C. Rubin Observatory, approximately\ntwo-thirds of the galaxies are likely to be affected by blending - the overlap\nof physically separated galaxies in images. Thus, extracting reliable shapes\nand photometry from individual objects will be limited by our ability to\ncorrect blending and control any residual systematic effect. Deblending\nalgorithms tackle this issue by reconstructing the isolated components from a\nblended scene, but the most commonly used algorithms often fail to model\ncomplex realistic galaxy morphologies.\n  As part of an effort to address this major challenge, we present MADNESS,\nwhich takes a data-driven approach and combines pixel-level multi-band\ninformation to learn complex priors for obtaining the maximum a posteriori\nsolution of deblending. MADNESS is based on deep neural network architectures\nsuch as variational auto-encoders and normalizing flows. The variational\nauto-encoder reduces the high-dimensional pixel space into a lower-dimensional\nspace, while the normalizing flow models a data-driven prior in this latent\nspace.\n  Using a simulated test dataset with galaxy models for a 10-year LSST survey\nand a galaxy density ranging from 48 to 80 galaxies per arcmin2 we characterize\nthe aperture-photometry g-r color, structural similarity index, and pixel\ncosine similarity of the galaxies reconstructed by MADNESS. We compare our\nresults against state-of-the-art deblenders including scarlet. With the r-band\nof LSST as an example, we show that MADNESS performs better than in all the\nmetrics. For instance, the average absolute value of relative flux residual in\nthe r-band for MADNESS is approximately 29% lower than that of scarlet. The\ncode is publicly available on GitHub.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hGJMp2_EcAQoTIXYnug7gvVnXqbtcRcX8OYZSZWnmy8","pdfSize":"12644588"}
