{"id":"2408.03892","title":"MORTAR: A Model-based Runtime Action Repair Framework for AI-enabled\n  Cyber-Physical Systems","authors":"Renzhi Wang, Zhehua Zhou, Jiayang Song, Xuan Xie, Xiaofei Xie, Lei Ma","authorsParsed":[["Wang","Renzhi",""],["Zhou","Zhehua",""],["Song","Jiayang",""],["Xie","Xuan",""],["Xie","Xiaofei",""],["Ma","Lei",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 16:44:53 GMT"}],"updateDate":"2024-08-08","timestamp":1723049093000,"abstract":"  Cyber-Physical Systems (CPSs) are increasingly prevalent across various\nindustrial and daily-life domains, with applications ranging from robotic\noperations to autonomous driving. With recent advancements in artificial\nintelligence (AI), learning-based components, especially AI controllers, have\nbecome essential in enhancing the functionality and efficiency of CPSs.\nHowever, the lack of interpretability in these AI controllers presents\nchallenges to the safety and quality assurance of AI-enabled CPSs (AI-CPSs).\nExisting methods for improving the safety of AI controllers often involve\nneural network repair, which requires retraining with additional adversarial\nexamples or access to detailed internal information of the neural network.\nHence, these approaches have limited applicability for black-box policies,\nwhere only the inputs and outputs are accessible during operation. To overcome\nthis, we propose MORTAR, a runtime action repair framework designed for AI-CPSs\nin this work. MORTAR begins by constructing a prediction model that forecasts\nthe quality of actions proposed by the AI controller. If an unsafe action is\ndetected, MORTAR then initiates a repair process to correct it. The generation\nof repaired actions is achieved through an optimization process guided by the\nsafety estimates from the prediction model. We evaluate the effectiveness of\nMORTAR across various CPS tasks and AI controllers. The results demonstrate\nthat MORTAR can efficiently improve task completion rates of AI controllers\nunder specified safety specifications. Meanwhile, it also maintains minimal\ncomputational overhead, ensuring real-time operation of the AI-CPSs.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}