{"id":"2408.15290","title":"Analysis of critical points of the In-Vessel Retention safety evaluation","authors":"Laure Car\\'enini (IRSN/PSN-RES/SAM/LEPC), Florian Fichot\n  (IRSN/PSN-RES/SAM/LEPC)","authorsParsed":[["Carénini","Laure","","IRSN/PSN-RES/SAM/LEPC"],["Fichot","Florian","","IRSN/PSN-RES/SAM/LEPC"]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 07:46:30 GMT"}],"updateDate":"2024-08-29","timestamp":1724658390000,"abstract":"  In-Vessel Retention (IVR) strategy for nuclear reactors in case of a Severe\nAccident (SA) intends to stabilize and retain the corium in the vessel by using\nthe vessel wall as a heat exchanger with an external water loop. This strategy\nrelies on simple actions to be passively taken as soon as SA signal is raised:\nvessel depressurization and reactor pit flooding. Then, the strategy is\nsuccessful if the vessel keeps it integrity, which means that the heat flux\ncoming from the corium pool does not exceed the cooling capacity of the\nExternal Reactor Vessel Cooling (ERVC) at each location along the vessel wall\n(no vessel melt-through) and the ablated vessel wall is mechanically resistant.\nThe main uncertainties in this IVR safety evaluation are associated to the\nthermal load applied from the corium pool to the vessel wall and the resulting\nminimum vessel thickness after ablation. Indeed, the heat fluxes distribution\nalong the vessel wall is directly dependent on the corium stratification which\noccurs as aresult of thermochemical interactions in the pool: when liquid steel\nis mixed with UO2 and partially oxidized Zr coming from the degradation of the\nfuel and claddings, there is a phase separation between oxide and metal phases\ndue to a gap of miscibility. The primordial impact of the corium behaviour in\nthe lower plenum of the reactor vessel on the IVR safety evaluation was clearly\nhighlighted in the Phenomena Identification Ranking Table (PIRT) on IVR\nperformed in the frame of the European IVMR (In-Vessel Melt Retention) project\n(Fichot et al., 2019). As a result, the focus is made in this paper on the\ncritical points which impact the value of the minimum vessel thickness\norequivalently the maximum heat flux reached at the outer surface of the vessel\nwall. Efficiency of the ERVC and mechanical resistance of the vessel wall are\nconsequently not discussed here.The main objective is to identify the generic\ncritical situations leading to an excessive heat flux to the vessel wall and\nthe investigation of possible means to avoid them. In this perspective, the\ncalculations of IVR strategy done by the project partners for different reactor\ndesigns and accident scenarios were used as a database to identify and\nunderstand the occurrence of critical configurations with excessive heat flux\nto the vessel wall. The results of 25 sequences are used, which correspond to 9\ndifferent reactor designs: a generic PWR 900MWe, a PWR 1100MWe with heavy\nreflector, a generic PWR 1300MWe, a generic Konvoi 1300MWe, a generic German\nBWR69, aNordic BWR, a BWR-5 Mark II, a VVER1000 and a VVER440/v213. In\naddition, different SA integral codes (ASTEC, ATHLET-CD, MAAP -combined with\nMAAP_EDF and PROCOR codes for simulation of lower plenum behavior-, MELCOR and\nRELAP/SCDAPSIM codes) are used.\n","subjects":["Physics/Instrumentation and Detectors","Physics/Classical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}