{"id":"2408.08929","title":"Single Atom Convolutional Matching Pursuit: Theoretical Framework and\n  Application to Lamb Waves based Structural Health Monitoring","authors":"Sebastian Rodriguez, Marc R\\'ebillat, Shweta Paunikar, Pierre\n  Margerit, Eric Monteiro, Francisco Chinesta and Nazih Mechbal","authorsParsed":[["Rodriguez","Sebastian",""],["Rébillat","Marc",""],["Paunikar","Shweta",""],["Margerit","Pierre",""],["Monteiro","Eric",""],["Chinesta","Francisco",""],["Mechbal","Nazih",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 01:42:29 GMT"}],"updateDate":"2024-08-20","timestamp":1723772549000,"abstract":"  Structural Health Monitoring (SHM) aims to monitor in real time the health\nstate of engineering structures. For thin structures, Lamb Waves (LW) are very\nefficient for SHM purposes. A bonded piezoelectric transducer (PZT) emits LW in\nthe structure in the form of a short tone burst. This initial wave packet (IWP)\npropagates in the structure and interacts with its boundaries and\ndiscontinuities and with eventual damages generating additional wave packets.\nThe main issues with LW based SHM are that at least two LW modes are\nsimultaneously excited and that those modes are dispersive. Matching Pursuit\nMethod (MPM), which consists of approximating a signal as a sum of different\ndelayed and scaled atoms taken from an a priori known learning dictionary,\nseems very appealing in such a context, however is limited to nondispersive\nsignals and relies on a priori known dictionary. An improved version of MPM\ncalled the Single Atom Convolutional Matching Pursuit method (SACMPM), which\naddresses the dispersion phenomena by decomposing a measured signal as delayed\nand dispersed atoms and limits the learning dictionary to only one atom, is\nproposed here. Its performances are illustrated when dealing with numerical and\nexperimental signals as well as its usage for damage detection. Although the\nsignal approximation method proposed in this paper finds an original\napplication in the context of SHM, this method remains completely general and\ncan be easily applied to any signal processing problem.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Gagg_jS0TSoZO0FRz7OU-B1UunvtZT98jsFriZUMj9c","pdfSize":"4300686"}
