{"id":"2408.03091","title":"Modeling User Intent Beyond Trigger: Incorporating Uncertainty for\n  Trigger-Induced Recommendation","authors":"Jianxing Ma, Zhibo Xiao, Luwei Yang, Hansheng Xue, Xuanzhou Liu, Wen\n  Jiang, Wei Ning, Guannan Zhang","authorsParsed":[["Ma","Jianxing",""],["Xiao","Zhibo",""],["Yang","Luwei",""],["Xue","Hansheng",""],["Liu","Xuanzhou",""],["Jiang","Wen",""],["Ning","Wei",""],["Zhang","Guannan",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 10:45:14 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 04:34:24 GMT"}],"updateDate":"2024-08-08","timestamp":1722941114000,"abstract":"  To cater to users' desire for an immersive browsing experience, numerous\ne-commerce platforms provide various recommendation scenarios, with a focus on\nTrigger-Induced Recommendation (TIR) tasks. However, the majority of current\nTIR methods heavily rely on the trigger item to understand user intent, lacking\na higher-level exploration and exploitation of user intent (e.g., popular items\nand complementary items), which may result in an overly convergent\nunderstanding of users' short-term intent and can be detrimental to users'\nlong-term purchasing experiences. Moreover, users' short-term intent shows\nuncertainty and is affected by various factors such as browsing context and\nhistorical behaviors, which poses challenges to user intent modeling. To\naddress these challenges, we propose a novel model called Deep Uncertainty\nIntent Network (DUIN), comprising three essential modules: i) Explicit Intent\nExploit Module extracting explicit user intent using the contrastive learning\nparadigm; ii) Latent Intent Explore Module exploring latent user intent by\nleveraging the multi-view relationships between items; iii) Intent Uncertainty\nMeasurement Module offering a distributional estimation and capturing the\nuncertainty associated with user intent. Experiments on three real-world\ndatasets demonstrate the superior performance of DUIN compared to existing\nbaselines. Notably, DUIN has been deployed across all TIR scenarios in our\ne-commerce platform, with online A/B testing results conclusively validating\nits superiority.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}