{"id":"2408.12524","title":"Stochastic Online Correlated Selection","authors":"Ziyun Chen and Zhiyi Huang and Enze Sun","authorsParsed":[["Chen","Ziyun",""],["Huang","Zhiyi",""],["Sun","Enze",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 16:29:55 GMT"}],"updateDate":"2024-08-23","timestamp":1724344195000,"abstract":"  We study Stochastic Online Correlated Selection (SOCS), a family of online\nrounding algorithms for Non-IID Stochastic Online Submodular Welfare\nMaximization and special cases such as Online Stochastic Matching, Stochastic\nAdWords, and Stochastic Display Ads. At each step, the algorithm sees an online\nitem's type and fractional allocation, then immediately allocates it to an\nagent. We propose a metric called the convergence rate for the quality of SOCS.\nThis is cleaner than most metrics in the OCS literature.\n  We propose a Type Decomposition that reduces SOCS to the two-way special\ncase. First, we sample a surrogate type with half-integer allocation. The\nrounding is trivial for a one-way type fully allocated to an agent. For a\ntwo-way type split equally between two agents, we round it using two-way SOCS.\nWe design the distribution of surrogate types to get two-way types as often as\npossible while respecting the original fractional allocation in expectation.\n  Following this framework, we make progress on numerous problems:\n  1) Online Stochastic Matching: We improve the state-of-the-art $0.666$\ncompetitive ratio for unweighted/vertex-weighted matching to $0.69$.\n  2) Query-Commit Matching: We enhance the ratio to $0.705$ in the Query-Commit\nmodel, improving the best previous $0.696$ and $0.662$ for unweighted and\nvertex-weighted matching.\n  3) Stochastic AdWords: We give a $0.6338$ competitive algorithm, breaking the\n$1-\\frac{1}{e}$ barrier and answering a decade-old open question.\n  4) AdWords: The framework applies to the adversarial model if the rounding is\noblivious to future items' distributions. We get the first multi-way OCS for\nAdWords, addressing an open question about OCS. This gives a $0.504$\ncompetitive ratio for AdWords, improving the previous $0.501$.\n  5) Stochastic Display Ads: We design a $0.644$ competitive algorithm,\nbreaking the $1-\\frac{1}{e}$ barrier.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Computer Science and Game Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}