{"id":"2408.02448","title":"Applications of CMOS technology at the ALICE experiment","authors":"Domenico Colella","authorsParsed":[["Colella","Domenico",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 13:19:39 GMT"}],"updateDate":"2024-08-06","timestamp":1722863979000,"abstract":"  Monolithic Active Pixel Sensors (MAPS) combine the sensing part and the\nfront-end electronics in the same silicon layer, making use of CMOS technology.\nProfiting from the progresses of this commercial process, MAPS have been\nundergoing significant advances over the last decade in terms of integration\ndensities, radiation hardness and readout speed. The first application of MAPS\nin high energy physics has been the PXL detector, installed in 2014 as the\nvertexer of the STAR experiment at BNL. In the same years, ALICE Collaboration\nstarted the development of a new MAPS with improved performances, to assemble a\nnew detector to replace the Inner Tracking System used during LHC Run 1 and 2.\nThis effort lead to the ALPIDE sensor, today successfully equipped in a large\nvariety of systems. Starting from 2019, profiting from the experience acquired\nduring the design of the ALPIDE sensor, the ALICE Collaboration embarked on a\nnew development phase, the ITS3 project. Here the goal is to design the first\ntruly cylindrical detector based on wafer-size sensors in 65 nm CMOS node. This\nnew detector is expected to take data during LHC Run 4. ALICE Collaboration\nsubmitted a proposal for a new experiment, to be installed in place of the\npresent detector system before the LHC Run 5. Building on the experience on\nMAPS acquired in the recent years, the idea is to design a compact all silicon\ndetector, that will give unprecedented insight into the quark-gluon plasma\ncharacterization.\n","subjects":["Physics/Instrumentation and Detectors","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ie4kmke8ayIo8UDV5gjvEJbfIS44DILf-s_J_8WGGdw","pdfSize":"596032"}
