{"id":"2408.06857","title":"On the Lottery Problem: Tracing Stefan Mandel's Combinatorial\n  Condensation","authors":"Ralph St\\\"ommer","authorsParsed":[["Stömmer","Ralph",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 15:30:07 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 11:53:42 GMT"},{"version":"v3","created":"Sun, 25 Aug 2024 08:52:13 GMT"}],"updateDate":"2024-08-27","timestamp":1723303807000,"abstract":"  Stefan Mandel is the man who won the lottery 14 times. He never disclosed the\nrecipe he called combinatorial condensation, which enabled him to hit the\nRomanian lottery jackpot in the early phase of his betting career.\nCombinatorial condensation is frequently mixed up with another strategy known\nas buying the pot, which Stefan Mandel was pursuing later on. On occasion, he\ndropped a few hints on combinatorial condensation. The hints are applied in\nthis work to narrow down and assess his initial recipe. The underlying theory\nresembles what a weekend mathematician, as he once referred to himself, may\nhave encountered in the 1960s. Calculations indicate that he took residual\nrisks that his method might fail. Residual risks explain why he changed his\nstrategy from combinatorial condensation to buying the pot. The cardinality of\nthe (15, 6, 6, 5)- and (49, 6, 6, 5)-lottery schemes shows that Stefan Mandel\nprobably wasn't aware of lottery designs. First concepts on such topics had\nbeen available at that time, but coherent theories on combinatorial designs\ntook off only in later decades, triggered by growing computing power, and\neventually triggered by Stefan Mandel's publicity and successes in the field.\nBut, as the comparison with actual covering designs reveals, Stefan Mandel most\nlikely pioneered in constructing a (15, 6, 5)-covering design many years before\nothers published about it, which he applied in the Romanian lottery.\n","subjects":["Mathematics/Combinatorics","Mathematics/Probability"],"license":"http://creativecommons.org/licenses/by/4.0/"}