{"id":"2408.06007","title":"Quantum Annealing-Based Algorithm for Efficient Coalition Formation\n  Among LEO Satellites","authors":"Supreeth Mysore Venkatesh, Antonio Macaluso, Marlon Nuske, Matthias\n  Klusch, Andreas Dengel","authorsParsed":[["Venkatesh","Supreeth Mysore",""],["Macaluso","Antonio",""],["Nuske","Marlon",""],["Klusch","Matthias",""],["Dengel","Andreas",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 08:53:46 GMT"}],"updateDate":"2024-08-13","timestamp":1723452826000,"abstract":"  The increasing number of Low Earth Orbit (LEO) satellites, driven by lower\nmanufacturing and launch costs, is proving invaluable for Earth observation\nmissions and low-latency internet connectivity. However, as the number of\nsatellites increases, the number of communication links to maintain also rises,\nmaking the management of this vast network increasingly challenging and\nhighlighting the need for clustering satellites into efficient groups as a\npromising solution. This paper formulates the clustering of LEO satellites as a\ncoalition structure generation (CSG) problem and leverages quantum annealing to\nsolve it. We represent the satellite network as a graph and obtain the optimal\npartitions using a hybrid quantum-classical algorithm called GCS-Q. The\nalgorithm follows a top-down approach by iteratively splitting the graph at\neach step using a quadratic unconstrained binary optimization (QUBO)\nformulation. To evaluate our approach, we utilize real-world three-line element\nset (TLE/3LE) data for Starlink satellites from Celestrak. Our experiments,\nconducted using the D-Wave Advantage annealer and the state-of-the-art solver\nGurobi, demonstrate that the quantum annealer significantly outperforms\nclassical methods in terms of runtime while maintaining the solution quality.\nThe performance achieved with quantum annealers surpasses the capabilities of\nclassical computers, highlighting the transformative potential of quantum\ncomputing in optimizing the management of large-scale satellite networks.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Computational Complexity","Computing Research Repository/Discrete Mathematics","Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ENE9EZ2bAq-RkW86oY2HFU3erdFZvzO4oPZf3efh80k","pdfSize":"2599810"}
