{"id":"2408.14219","title":"Visuo-Tactile Exploration of Unknown Rigid 3D Curvatures by\n  Vision-Augmented Unified Force-Impedance Control","authors":"K\\\"ubra Karacan, Anran Zhang, Hamid Sadeghian, Fan Wu, and Sami\n  Haddadin","authorsParsed":[["Karacan","Kübra",""],["Zhang","Anran",""],["Sadeghian","Hamid",""],["Wu","Fan",""],["Haddadin","Sami",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 12:33:43 GMT"}],"updateDate":"2024-08-27","timestamp":1724675623000,"abstract":"  Despite recent advancements in torque-controlled tactile robots, integrating\nthem into manufacturing settings remains challenging, particularly in complex\nenvironments. Simplifying robotic skill programming for non-experts is crucial\nfor increasing robot deployment in manufacturing. This work proposes an\ninnovative approach, Vision-Augmented Unified Force-Impedance Control\n(VA-UFIC), aimed at intuitive visuo-tactile exploration of unknown 3D\ncurvatures. VA-UFIC stands out by seamlessly integrating vision and tactile\ndata, enabling the exploration of diverse contact shapes in three dimensions,\nincluding point contacts, flat contacts with concave and convex curvatures, and\nscenarios involving contact loss. A pivotal component of our method is a robust\nonline contact alignment monitoring system that considers tactile error, local\nsurface curvature, and orientation, facilitating adaptive adjustments of robot\nstiffness and force regulation during exploration. We introduce virtual energy\ntanks within the control framework to ensure safety and stability, effectively\naddressing inherent safety concerns in visuo-tactile exploration. Evaluation\nusing a Franka Emika research robot demonstrates the efficacy of VA-UFIC in\nexploring unknown 3D curvatures while adhering to arbitrarily defined\nforce-motion policies. By seamlessly integrating vision and tactile sensing,\nVA-UFIC offers a promising avenue for intuitive exploration of complex\nenvironments, with potential applications spanning manufacturing, inspection,\nand beyond.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}