{"id":"2408.16597","title":"Deep extragalactic HI survey of the COSMOS field with FAST","authors":"Hengxing Pan, Matt J. Jarvis, Ming Zhu, Yin-Zhe Ma, Mario G. Santos,\n  Anastasia A. Ponomareva, Ian Heywood, Yingjie Jing, Chen Xu, Ziming Liu,\n  Yogesh Chandola and Yipeng Jing","authorsParsed":[["Pan","Hengxing",""],["Jarvis","Matt J.",""],["Zhu","Ming",""],["Ma","Yin-Zhe",""],["Santos","Mario G.",""],["Ponomareva","Anastasia A.",""],["Heywood","Ian",""],["Jing","Yingjie",""],["Xu","Chen",""],["Liu","Ziming",""],["Chandola","Yogesh",""],["Jing","Yipeng",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 15:04:49 GMT"},{"version":"v2","created":"Thu, 19 Sep 2024 17:52:59 GMT"}],"updateDate":"2024-09-20","timestamp":1724943889000,"abstract":"  We present a deep HI survey at L-band conducted with the Five-hundred-meter\nAperture Spherical radio Telescope (FAST) over the COSMOS field. This survey is\nstrategically designed to overlap with the MIGHTEE COSMOS field, aiming to\ncombine the sensitivity of the FAST and high-resolution of the MeerKAT. We\nobserved the field with FAST for approximately 11 hours covering $\\sim$2 square\ndegrees, and reduced the raw data to HI spectral cubes over the frequency range\n1310-1420 MHz. The FAST-HI data reach a median 3$\\sigma$ column density of\n$N_{\\rm HI}\\sim2\\times10^{17}$ cm$^{-2}$ over a 5 km s$^{-1}$ channel width,\nallowing for studies of the distribution of HI gas in various environments,\nsuch as in galaxies, the Circum-Galactic Medium (CGM) and Intergalactic Medium\n(IGM). We visually searched the spectral cubes for HI sources, and found a\ntotal of 80 HI detections, of which 56 have been cross-matched with the\nMIGHTEE-HI catalogue. With the cross-matched sources, we compare their HI\nmasses and find that the total HI mass fraction in the IGM and CGM surrounding\nthe galaxy pairs is statistically higher than the HI fraction surrounding the\nisolated galaxies by a difference of 13$\\pm$4%, indicating that the CGM and IGM\nassociated with interacting systems are richer in neutral hydrogen compared to\nthose around isolated galaxies in the local Universe. We also describe several\nFAST-MeerKAT synergy projects, highlighting the full potential of exploiting\nboth single-dish and interferometric observations to study the distribution and\nevolution of the diffuse HI gas.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}