{"id":"2408.15973","title":"Cocoon shock breakout emission from binary neutron star mergers","authors":"Eduardo M. Guti\\'errez, Mukul Bhattacharya, David Radice, Kohta\n  Murase, Sebastiano Bernuzzi","authorsParsed":[["Gutiérrez","Eduardo M.",""],["Bhattacharya","Mukul",""],["Radice","David",""],["Murase","Kohta",""],["Bernuzzi","Sebastiano",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 17:46:18 GMT"}],"updateDate":"2024-08-29","timestamp":1724867178000,"abstract":"  Shock breakout emission is among the first observable signals in a wide\nvariety of astrophysical phenomena, including neutron star (NS) mergers, and it\ncan be the dominant component in low-luminosity short gamma-ray bursts\n(llsGRBs), as exemplified by GRB 170817A. In this work, we investigate the\ncocoon shock breakout emission in NS mergers and how its signal depends on the\noutermost layers of the ejecta profile, which we derive from general\nrelativistic radiation hydrodynamic simulations. We study the formation of the\ncocoon as a consequence of a relativistic jet propagating through the ejecta.\nTo explore the influence of the outermost layers of the ejecta on the breakout\nemission, we explore cases where the ejecta has a sharp cutoff or an extended\nsmooth tail. We find that the shock breakout emission is strongly influenced by\nthe shape of the ejecta outer layers, with extended tails yielding results\nconsistent with the observed properties of GRB 170817A, whereas sharp cutoffs\noverestimate the radiated energy. Using a Bayesian analysis, we estimate the\nbest fit parameters of the central engine, considering both accreting black\nhole and magnetized neutron star scenarios. Our findings indicate a slight\npreference for the scenarios where the engine is a black hole. Our work probes\nthe nature of neutron star mergers and highlights the importance of the shape\nof the ejecta profile in modeling early electromagnetic counterparts to these\nmergers.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}