{"id":"2408.00139","title":"Multiway Alignment of Political Attitudes","authors":"Letizia Iannucci, Ali Faqeeh, Ali Salloum, Ted Hsuan Yun Chen, Mikko\n  Kivel\\\"a","authorsParsed":[["Iannucci","Letizia",""],["Faqeeh","Ali",""],["Salloum","Ali",""],["Chen","Ted Hsuan Yun",""],["Kivelä","Mikko",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 19:51:54 GMT"}],"updateDate":"2024-08-02","timestamp":1722455514000,"abstract":"  The related concepts of partisan belief systems, issue alignment, and\npartisan sorting are central to our understanding of politics. These phenomena\nhave been studied using measures of alignment between pairs of topics, or how\nmuch individuals' attitudes toward a topic reveal about their attitudes toward\nanother topic. We introduce a higher-order measure that extends the assessment\nof alignment beyond pairs of topics by quantifying the amount of information\nindividuals' opinions on one topic reveal about a set of topics simultaneously.\nOur multiway alignment measure indicates how much individuals' opinions on\nmultiple topics align into a single ideological divide. Applying this approach\nto legislative voting behavior reveals that parliamentary systems typically\nexhibit similar multiway alignment characteristics, but can change in response\nto shifting intergroup dynamics. In American National Election Studies surveys,\nour approach reveals a growing significance of party identification together\nwith a consistent rise in multiway alignment over time. Similarly, the growing\nmultiway alignment among topical issues in Finnish online discussions suggests\na trend towards a more ideologically driven political landscape. Our case\nstudies demonstrate that the multiway alignment measure is a versatile tool for\nunderstanding societal polarization and partisan belief systems across diverse\ndomains.\n","subjects":["Computing Research Repository/Social and Information Networks","Physics/Physics and Society","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aAmTpH_wb1KvbhHQqbd0Fi359jkooyZTHawM2eIt3vw","pdfSize":"4414333"}
