{"id":"2408.00252","title":"Quantum thermalization and Floquet engineering in a spin ensemble with a\n  clock transition","authors":"Mi Lei, Rikuto Fukumori, Chun-Ju Wu, Edwin Barnes, Sophia Economou,\n  Joonhee Choi, Andrei Faraon","authorsParsed":[["Lei","Mi",""],["Fukumori","Rikuto",""],["Wu","Chun-Ju",""],["Barnes","Edwin",""],["Economou","Sophia",""],["Choi","Joonhee",""],["Faraon","Andrei",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 03:16:25 GMT"}],"updateDate":"2024-08-02","timestamp":1722482185000,"abstract":"  Studying and controlling quantum many-body interactions is fundamentally\nimportant for quantum science and related emerging technologies. Optically\naddressable solid-state spins offer a promising platform for exploring various\nquantum many-body phenomena due to their scalability to a large Hilbert space.\nHowever, it is often challenging to probe many-body dynamics in solid-state\nspin systems due to large on-site disorder and undesired coupling to the\nenvironment. Here, we investigate an optically addressable solid-state spin\nsystem comprising a strongly interacting ensemble of millions of ytterbium-171\nions in a crystal. Notably, this platform features a clock transition that\ngives rise to pure long-range spin-exchange interactions, termed the dipolar XY\nmodel. Leveraging this unique feature, we investigate quantum thermalization by\nvarying the relative ratio of interaction strength to disorder, dynamically\nengineering the XY model into other many-body Hamiltonian models, and realizing\na time-crystalline phase of matter through periodic driving. Our findings\nindicate that an ensemble of rare-earth ions serves as a versatile testbed for\nmany-body physics and offers valuable insights for advancing quantum\ntechnologies.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gnG7KUET1aaIskgUG22i5nVWK-HoAdX-eYu7IwchlWU","pdfSize":"21828864","txDigest":"3QhmfeCGPYCXZEhtuJFB2yZc2C7eweCEqV32EQjihVzw","endEpoch":"1","status":"CERTIFIED"}
