{"id":"2408.13611","title":"Real-Time Rendering of Glints in the Presence of Area Lights","authors":"Tom Kneiphof, Reinhard Klein","authorsParsed":[["Kneiphof","Tom",""],["Klein","Reinhard",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 15:47:13 GMT"}],"updateDate":"2024-08-27","timestamp":1724514433000,"abstract":"  Many real-world materials are characterized by a glittery appearance.\nReproducing this effect in physically based renderings is a challenging problem\ndue to its discrete nature, especially in real-time applications which require\na consistently low runtime. Recent work focuses on glittery appearance\nilluminated by infinitesimally small light sources only. For light sources like\nthe sun this approximation is a reasonable choice. In the real world however,\nall light sources are fundamentally area light sources. In this paper, we\nderive an efficient method for rendering glints illuminated by spatially\nconstant diffuse area lights in real time. To this end, we require an adequate\nestimate for the probability of a single microfacet to be correctly oriented\nfor reflection from the source to the observer. A good estimate is achieved\neither using linearly transformed cosines (LTC) for large light sources, or a\nlocally constant approximation of the normal distribution for small spherical\ncaps of light directions. To compute the resulting number of reflecting\nmicrofacets, we employ a counting model based on the binomial distribution. In\nthe evaluation, we demonstrate the visual accuracy of our approach, which is\neasily integrated into existing real-time rendering frameworks, especially if\nthey already implement shading for area lights using LTCs and a counting model\nfor glint shading under point and directional illumination. Besides the\noverhead of the preexisting constituents, our method adds little to no\nadditional overhead.\n","subjects":["Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wIwdUGDg75EIqSjqDzIJqhWJGoMafMGY-Zm_rVF1GYk","pdfSize":"22757743"}
