{"id":"2408.15185","title":"PoseWatch: A Transformer-based Architecture for Human-centric Video\n  Anomaly Detection Using Spatio-temporal Pose Tokenization","authors":"Ghazal Alinezhad Noghre, Armin Danesh Pazho, Hamed Tabkhi","authorsParsed":[["Noghre","Ghazal Alinezhad",""],["Pazho","Armin Danesh",""],["Tabkhi","Hamed",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 16:40:14 GMT"}],"updateDate":"2024-08-28","timestamp":1724776814000,"abstract":"  Video Anomaly Detection (VAD) presents a significant challenge in computer\nvision, particularly due to the unpredictable and infrequent nature of\nanomalous events, coupled with the diverse and dynamic environments in which\nthey occur. Human-centric VAD, a specialized area within this domain, faces\nadditional complexities, including variations in human behavior, potential\nbiases in data, and substantial privacy concerns related to human subjects.\nThese issues complicate the development of models that are both robust and\ngeneralizable. To address these challenges, recent advancements have focused on\npose-based VAD, which leverages human pose as a high-level feature to mitigate\nprivacy concerns, reduce appearance biases, and minimize background\ninterference. In this paper, we introduce PoseWatch, a novel transformer-based\narchitecture designed specifically for human-centric pose-based VAD. PoseWatch\nfeatures an innovative Spatio-Temporal Pose and Relative Pose (ST-PRP)\ntokenization method that enhances the representation of human motion over time,\nwhich is also beneficial for broader human behavior analysis tasks. The\narchitecture's core, a Unified Encoder Twin Decoders (UETD) transformer,\nsignificantly improves the detection of anomalous behaviors in video data.\nExtensive evaluations across multiple benchmark datasets demonstrate that\nPoseWatch consistently outperforms existing methods, establishing a new\nstate-of-the-art in pose-based VAD. This work not only demonstrates the\nefficacy of PoseWatch but also highlights the potential of integrating Natural\nLanguage Processing techniques with computer vision to advance human behavior\nanalysis.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}