{"id":"2408.14944","title":"Dynamic Spectrum Management for 6G Network-in-Network Concepts","authors":"Daniel Lindenschmitt, Paul Seehofer, Marius Schmitz, Jan Mertes,\n  Roland Bless, Matthias Klar, Martina Zitterbart, Jan C. Aurich, Hans D.\n  Schotten","authorsParsed":[["Lindenschmitt","Daniel",""],["Seehofer","Paul",""],["Schmitz","Marius",""],["Mertes","Jan",""],["Bless","Roland",""],["Klar","Matthias",""],["Zitterbart","Martina",""],["Aurich","Jan C.",""],["Schotten","Hans D.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 10:41:31 GMT"}],"updateDate":"2024-08-28","timestamp":1724755291000,"abstract":"  Flexible, self-organizing communication networks will be a key feature in the\nnext mobile communication standard. Network-in-Network (NiN) is one important\nconcept in 6G research, introducing sub-networks tailored to specific\napplication requirements. These sub-networks may be dynamic, i.e., they may\nappear, disappear, or even move throughout the network. Moreover, sub-networks\nmay operate within a shared frequency spectrum, thereby requiring coordination\namong them. We demonstrate the concept of Dynamic Spectrum Management (DSM) for\nfuture 6G networks that dynamically (re-)allocates spectrum according to active\nsub-networks in the shared spectrum domain. Resilient control plane\nconnectivity between sub-networks and the DSM is provided by the\nself-organizing routing protocol KIRA, enabling the aforementioned\ncoordination. This demonstration presents an integrated solution of the DSM\nconcept, providing increased flexibility to support diverse industrial\napplications and their individual performance requirements simultaneously\nwithin the context of a cyber-physical production system (CPPS). For the\nsub-networks, we use specifically designed hardware for wireless real-time\ncommunication and couple them with a network emulation. By switching\nsub-networks on and off, one can see that the DSM dynamically manages the\nspectrum allocations for them and that KIRA provides the required connectivity.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}