{"id":"2408.06836","title":"Linear stability analysis of a vertical liquid film over a moving\n  substrate","authors":"Fabio Pino, Miguel Alfonso Mendez, Benoit Scheid","authorsParsed":[["Pino","Fabio",""],["Mendez","Miguel Alfonso",""],["Scheid","Benoit",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 11:50:02 GMT"}],"updateDate":"2024-08-14","timestamp":1723549802000,"abstract":"  The stability of liquid film flows are important in many industrial\napplications. In the dip-coating process, a liquid film is formed over a\nsubstrate extracted at a constant speed from a liquid bath. We studied the\nlinear stability of this film considering different thicknesses $\\hat{h}$ for\nfour liquids, spanning a large range of Kapitza numbers ($\\rm Ka$). By solving\nthe Orr-Sommerfeld eigenvalue problem with the Chebyshev-Tau spectral method,\nwe calculated the neutral curves, investigated the instability mechanism and\ncomputed the absolute/convective threshold. The instability mechanism was\nstudied through the analysis of vorticity distribution and the kinetic energy\nbalance of the perturbations. It was found that liquids with low $\\rm Ka$ (e.g.\ncorn oil, $\\text{Ka}$ = 4) have a smaller area of stability than a liquid at\nhigh $\\rm Ka$ (e.g. Liquid Zinc, $\\rm Ka$ = 11525). Surface tension has both a\nstabilizing and a destabilizing effect, especially for large $\\rm Ka$. For long\nwaves, it curves the vorticity lines near the substrate, reducing the flow\nunder the crests. For short waves, it fosters vorticity production at the\ninterface and creates a region of intense vorticity near the substrate. In\naddition, we discovered that the surface tension contributes to both the\nproduction and dissipation of perturbation's energy depending on the $\\rm Ka$\nnumber. In terms of absolute/convective threshold, we found a window of\nabsolute instability in the $\\text{Re}-\\hat{h}$ space, showing that the\nLandau-Levich-Derjaguin solution ($\\hat{h}=0.945\n\\text{Re}^{1/9}\\text{Ka}^{-1/6}$) is always convectively unstable. Moreover, we\nshow that for $\\text{Ka}<17$, the Derjaguin's solution ($\\hat{h}=1$) is always\nconvectively unstable.\n","subjects":["Physics/Fluid Dynamics","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3Soo8aMexxxzn0W-BNp86QLa4uuy7sEKu7GUfrt64SY","pdfSize":"23987034"}
