{"id":"2408.08180","title":"A Partial Near-infrared Guide Star Catalog for Thirty Meter Telescope\n  Operations","authors":"Sarang Shah, Smitha Subramanian, Avinash C. K., David R. Andersen,\n  Warren Skidmore, G. C. Anupama, Francisco Delgado, Kim Gillies, Maheshwar\n  Gopinathan, A. N. Ramaprakash, B. E. Reddy, T. Sivarani, and Annapurni\n  Subramaniam","authorsParsed":[["Shah","Sarang",""],["Subramanian","Smitha",""],["K.","Avinash C.",""],["Andersen","David R.",""],["Skidmore","Warren",""],["Anupama","G. C.",""],["Delgado","Francisco",""],["Gillies","Kim",""],["Gopinathan","Maheshwar",""],["Ramaprakash","A. N.",""],["Reddy","B. E.",""],["Sivarani","T.",""],["Subramaniam","Annapurni",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 14:34:35 GMT"}],"updateDate":"2024-08-16","timestamp":1723732475000,"abstract":"  At first light, the Thirty Meter Telescope (TMT) near-infrared (NIR)\ninstruments will be fed by a multiconjugate adaptive optics instrument known as\nthe Narrow Field Infrared Adaptive Optics System (NFIRAOS). NFIRAOS will use\nsix laser guide stars to sense atmospheric turbulence in a volume corresponding\nto a field of view of 2', but natural guide stars (NGSs) will be required to\nsense tip/tilt and focus. To achieve high sky coverage (50% at the north\nGalactic pole), the NFIRAOS client instruments use NIR on-instrument wavefront\nsensors that take advantage of the sharpening of the stars by NFIRAOS. A\ncatalog of guide stars with NIR magnitudes as faint as 22 mag in the J band\n(Vega system), covering the TMT-observable sky, will be a critical resource for\nthe efficient operation of NFIRAOS, and no such catalog currently exists.\nHence, it is essential to develop such a catalog by computing the expected NIR\nmagnitudes of stellar sources identified in deep optical sky surveys using\ntheir optical magnitudes. This paper discusses the generation of a partial NIR\nGuide Star Catalog (IRGSC), similar to the final IRGSC for TMT operations. The\npartial catalog is generated by applying stellar atmospheric models to the\noptical data of stellar sources from the Panoramic Survey Telescope and Rapid\nResponse System (Pan-STARRS) optical data and then computing their expected NIR\nmagnitudes. We validated the computed NIR magnitudes of the sources in some\nfields by using the available NIR data for those fields. We identified the\nremaining challenges of this approach. We outlined the path for producing the\nfinal IRGSC using the Pan-STARRS data. We have named the Python code to\ngenerate the IRGSC as irgsctool, which generates a list of NGS for a field\nusing optical data from the Pan-STARRS 3pi survey and also a list of NGSs\nhaving observed NIR data from the UKIRT Infrared Deep Sky Survey if they are\navailable.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}