{"id":"2408.11199","title":"Institutions of public judgment established by social contract and\n  taxation","authors":"Taylor A. Kessinger, Joshua B. Plotkin","authorsParsed":[["Kessinger","Taylor A.",""],["Plotkin","Joshua B.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 21:19:47 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 20:17:36 GMT"}],"updateDate":"2024-08-30","timestamp":1724188787000,"abstract":"  Indirect reciprocity is a plausible mechanism for sustaining cooperation:\npeople cooperate with those who have a good reputation, which can be acquired\nby helping others. However, this mechanism requires the population to agree on\nwho has good or bad moral standing. Consensus can be provided by a central\ninstitution that monitors and broadcasts reputations. But how might such an\ninstitution be maintained, and how can a population ensure that it is effective\nand incorruptible? Here we explore a simple mechanism to sustain an institution\nof reputational judgment: a compulsory contribution from each member of the\npopulation, i.e., a tax. We analyze the maximum possible tax rate that\nindividuals will rationally pay to sustain an institution of judgment, which\nprovides a public good in the form of information, and we derive necessary\nconditions for individuals to resist the temptation to evade their tax payment.\nWe also consider the possibility that institution members may be corrupt and\nsubject to bribery, and we analyze how often an institution must be audited to\nprevent bribery. Our analysis has implications for the establishment of robust\npublic institutions that provide social information to support cooperation in\nlarge populations--and the potential negative consequences associated with\nwealth or income inequality.\n","subjects":["Economics/Theoretical Economics","Quantitative Biology/Populations and Evolution"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"o_9eKANwc9ZHeFIrL90X9YT2J2-bsr6gjATTG5P-Bpo","pdfSize":"527483"}
