{"id":"2408.03965","title":"A Workflow-Centric Approach to Generating FAIR Data Objects for\n  Mechanical Properties of Materials","authors":"Ronak Shoghi, Alexander Hartmaier","authorsParsed":[["Shoghi","Ronak",""],["Hartmaier","Alexander",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 12:06:37 GMT"}],"updateDate":"2024-08-09","timestamp":1722945997000,"abstract":"  From a data perspective, the field of materials mechanics is characterized by\na sparsity of available data, mainly due to the strong\nmicrostructure-sensitivity of properties such as strength, fracture toughness,\nand fatigue limit. Consequently, individual tests are needed for specimens with\nvarious thermo-mechanical process histories, even if their chemical composition\nremains the same. Experimental data on the mechanical behavior of materials is\nusually rare, as mechanical testing is typically a destructive method requiring\nlarge amounts of material and effort for specimen preparation and testing.\nFurthermore, mechanical behavior is typically characterized in simplified tests\nunder uniaxial loading conditions, whereas a complete characterization of\nmechanical material behavior requires multiaxial testing conditions. To address\nthis data sparsity, different simulation methods, such as micromechanical\nmodeling or even atomistic simulations, can contribute to\nmicrostructure-sensitive data collections. These methods cover a wide range of\nmaterials with different microstructures characterized under multiaxial loading\nconditions. In the present work, we describe a novel data schema that\nintegrates metadata and mechanical data itself, following the workflows of the\nmaterial modeling processes by which the data has been generated. Each run of\nthis workflow results in unique data objects due to the incorporation of\nvarious elements such as user, system, and job-specific information in\ncorrelation with the resulting mechanical properties. Hence, this integrated\ndata format provides a sustainable way of generating data objects that are\nFindable, Accessible, Interoperable, and Reusable (FAIR). The choice of\nmetadata elements has centered on necessary features required to characterize\nmicrostructure-specific data objects, simplifying how purpose-specific datasets\nare collected by search algorithms.\n","subjects":["Physics/Computational Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}