{"id":"2408.09411","title":"Weakly Supervised Lymph Nodes Segmentation Based on Partial Instance\n  Annotations with Pre-trained Dual-branch Network and Pseudo Label Learning","authors":"Litingyu Wang (1), Yijie Qu (1), Xiangde Luo (1 and 2), Wenjun Liao (1\n  and 3), Shichuan Zhang (1 and 3), Guotai Wang (1 and 2) ((1) University of\n  Electronic Science and Technology of China, Chengdu, China, (2) ShangAI\n  Laboratory, Shanghai, China, (3) Department of Radiation Oncology, Sichuan\n  Cancer Hospital & Institute, Sichuan Cancer Center, Chengdu, China)","authorsParsed":[["Wang","Litingyu","","1 and 2"],["Qu","Yijie","","1 and 2"],["Luo","Xiangde","","1 and 2"],["Liao","Wenjun","","1\n  and 3"],["Zhang","Shichuan","","1 and 3"],["Wang","Guotai","","1 and 2"]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 08:54:53 GMT"}],"updateDate":"2024-08-20","timestamp":1723971293000,"abstract":"  Assessing the presence of potentially malignant lymph nodes aids in\nestimating cancer progression, and identifying surrounding benign lymph nodes\ncan assist in determining potential metastatic pathways for cancer. For\nquantitative analysis, automatic segmentation of lymph nodes is crucial.\nHowever, due to the labor-intensive and time-consuming manual annotation\nprocess required for a large number of lymph nodes, it is more practical to\nannotate only a subset of the lymph node instances to reduce annotation costs.\nIn this study, we propose a pre-trained Dual-Branch network with Dynamically\nMixed Pseudo label (DBDMP) to learn from partial instance annotations for lymph\nnodes segmentation. To obtain reliable pseudo labels for lymph nodes that are\nnot annotated, we employ a dual-decoder network to generate different outputs\nthat are then dynamically mixed. We integrate the original weak partial\nannotations with the mixed pseudo labels to supervise the network. To further\nleverage the extensive amount of unannotated voxels, we apply a self-supervised\npre-training strategy to enhance the model's feature extraction capability.\nExperiments on the mediastinal Lymph Node Quantification (LNQ) dataset\ndemonstrate that our method, compared to directly learning from partial\ninstance annotations, significantly improves the Dice Similarity Coefficient\n(DSC) from 11.04% to 54.10% and reduces the Average Symmetric Surface Distance\n(ASSD) from 20.83 $mm$ to 8.72 $mm$. The code is available at\nhttps://github.com/WltyBY/LNQ2023_training_code.git\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4ZYGOPum5aAXYjy2MiEEb6LwWySl4t80VIvgR7JKQWE","pdfSize":"3970212"}
