{"id":"2408.10217","title":"Inference of Heterogeneous Material Properties via Infinite-Dimensional\n  Integrated DIC","authors":"Joseph Kirchhoff, Dingcheng Luo, Thomas O'Leary-Roseberry and Omar\n  Ghattas","authorsParsed":[["Kirchhoff","Joseph",""],["Luo","Dingcheng",""],["O'Leary-Roseberry","Thomas",""],["Ghattas","Omar",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 19:20:40 GMT"}],"updateDate":"2024-08-21","timestamp":1721676040000,"abstract":"  We present a scalable and efficient framework for the inference of\nspatially-varying parameters of continuum materials from image observations of\ntheir deformations. Our goal is the nondestructive identification of arbitrary\ndamage, defects, anomalies and inclusions without knowledge of their morphology\nor strength. Since these effects cannot be directly observed, we pose their\nidentification as an inverse problem. Our approach builds on integrated digital\nimage correlation (IDIC, Besnard Hild, Roux, 2006), which poses the image\nregistration and material inference as a monolithic inverse problem, thereby\nenforcing physical consistency of the image registration using the governing\nPDE. Existing work on IDIC has focused on low-dimensional parameterizations of\nmaterials. In order to accommodate the inference of heterogeneous material\npropertes that are formally infinite dimensional, we present $\\infty$-IDIC, a\ngeneral formulation of the PDE-constrained coupled image registration and\ninversion posed directly in the function space setting. This leads to several\nmathematical and algorithmic challenges arising from the ill-posedness and high\ndimensionality of the inverse problem. To address ill-posedness, we consider\nvarious regularization schemes, namely $H^1$ and total variation for the\ninference of smooth and sharp features, respectively. To address the\ncomputational costs associated with the discretized problem, we use an\nefficient inexact-Newton CG framework for solving the regularized inverse\nproblem. In numerical experiments, we demonstrate the ability of $\\infty$-IDIC\nto characterize complex, spatially varying Lam\\'e parameter fields of linear\nelastic and hyperelastic materials. Our method exhibits (i) the ability to\nrecover fine-scale and sharp material features, (ii) mesh-independent\nconvergence performance and hyperparameter selection, (iii) robustness to\nobservational noise.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}