{"id":"2408.01702","title":"Beamforming for PIN Diode-Based IRS-Assisted Systems Under a Phase\n  Shift-Dependent Power Consumption Model","authors":"Qiucen Wu, Tian Lin, Xianghao Yu, Yu Zhu and Robert Schober","authorsParsed":[["Wu","Qiucen",""],["Lin","Tian",""],["Yu","Xianghao",""],["Zhu","Yu",""],["Schober","Robert",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 07:49:54 GMT"}],"updateDate":"2024-08-06","timestamp":1722671394000,"abstract":"  Intelligent reflecting surfaces (IRSs) have been regarded as a promising\nenabler for future wireless communication systems. In the literature, IRSs have\nbeen considered power-free or assumed to have constant power consumption.\nHowever, recent experimental results have shown that for\npositive-intrinsic-negative (PIN) diode-based IRSs, the power consumption\ndynamically changes with the phase shift configuration. This phase\nshift-dependent power consumption (PS-DPC) introduces a challenging power\nallocation problem between base station (BS) and IRS. To tackle this issue, in\nthis paper, we investigate a rate maximization problem for IRS-assisted systems\nunder a practical PS-DPC model. For the single-user case, we propose a\ngeneralized Benders decomposition-based beamforming method to maximize the\nachievable rate while satisfying a total system power consumption constraint.\nMoreover, we propose a low-complexity beamforming design, where the powers\nallocated to BS and IRS are optimized offline based on statistical channel\nstate information. Furthermore, for the multi-user case, we solve an equivalent\nweighted mean square error minimization problem with two different joint power\nallocation and phase shift optimization methods. Simulation results indicate\nthat compared to baseline schemes, our proposed methods can flexibly optimize\nthe power allocation between BS and IRS, thus achieving better performance. The\noptimized power allocation strategy strongly depends on the system power\nbudget. When the system power budget is high, the PS-DPC is not the dominant\nfactor in the system power consumption, allowing the IRS to turn on as many PIN\ndiodes as needed to achieve high beamforming quality. When the system power\nbudget is limited, however, more power tends to be allocated to the BS to\nenhance the transmit power, resulting in a lower beamforming quality at the IRS\ndue to the reduced PS-DPC budget.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}