{"id":"2408.15099","title":"No Regrets: Investigating and Improving Regret Approximations for\n  Curriculum Discovery","authors":"Alexander Rutherford, Michael Beukman, Timon Willi, Bruno Lacerda,\n  Nick Hawes, Jakob Foerster","authorsParsed":[["Rutherford","Alexander",""],["Beukman","Michael",""],["Willi","Timon",""],["Lacerda","Bruno",""],["Hawes","Nick",""],["Foerster","Jakob",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 14:31:54 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 14:20:44 GMT"}],"updateDate":"2024-08-30","timestamp":1724769114000,"abstract":"  What data or environments to use for training to improve downstream\nperformance is a longstanding and very topical question in reinforcement\nlearning. In particular, Unsupervised Environment Design (UED) methods have\ngained recent attention as their adaptive curricula enable agents to be robust\nto in- and out-of-distribution tasks. We ask to what extent these methods are\nthemselves robust when applied to a novel setting, closely inspired by a\nreal-world robotics problem. Surprisingly, we find that the state-of-the-art\nUED methods either do not improve upon the na\\\"{i}ve baseline of Domain\nRandomisation (DR), or require substantial hyperparameter tuning to do so. Our\nanalysis shows that this is due to their underlying scoring functions failing\nto predict intuitive measures of ``learnability'', i.e., in finding the\nsettings that the agent sometimes solves, but not always. Based on this, we\ninstead directly train on levels with high learnability and find that this\nsimple and intuitive approach outperforms UED methods and DR in several\nbinary-outcome environments, including on our domain and the standard UED\ndomain of Minigrid. We further introduce a new adversarial evaluation procedure\nfor directly measuring robustness, closely mirroring the conditional value at\nrisk (CVaR). We open-source all our code and present visualisations of final\npolicies here: https://github.com/amacrutherford/sampling-for-learnability.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"X_AUCzvi4D05nGwOFPl6tEnQ3Qc9rm5Cr9JIYQKBiXs","pdfSize":"2880052"}
