{"id":"2408.00111","title":"Femtosecond switching of strong light-matter interactions in\n  microcavities with two-dimensional semiconductors","authors":"Armando Genco, Charalambos Louca, Cristina Cruciano, Kok Wee Song,\n  Chiara Trovatello, Giuseppe Di Blasio, Giacomo Sansone, Sam Randerson, Peter\n  Claronino, Rahul Jayaprakash, Kenji Watanabe, Takashi Taniguchi, David G.\n  Lidzey, Oleksandr Kyriienko, Stefano Dal Conte, Alexander I. Tartakovskii and\n  Giulio Cerullo","authorsParsed":[["Genco","Armando",""],["Louca","Charalambos",""],["Cruciano","Cristina",""],["Song","Kok Wee",""],["Trovatello","Chiara",""],["Di Blasio","Giuseppe",""],["Sansone","Giacomo",""],["Randerson","Sam",""],["Claronino","Peter",""],["Jayaprakash","Rahul",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Lidzey","David G.",""],["Kyriienko","Oleksandr",""],["Conte","Stefano Dal",""],["Tartakovskii","Alexander I.",""],["Cerullo","Giulio",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:43:21 GMT"}],"updateDate":"2024-08-02","timestamp":1722451401000,"abstract":"  Ultrafast all-optical logic devices based on nonlinear light-matter\ninteractions hold the promise to overcome the speed limitations of conventional\nelectronic devices. Strong coupling of excitons and photons inside an optical\nresonator enhances such interactions and generates new polariton states which\ngive access to unique nonlinear phenomena, such as Bose-Einstein condensation,\nused for all-optical ultrafast polariton transistors. However, the pulse\nenergies required to pump such devices range from tens to hundreds of pJ,\nmaking them not competitive with electronic transistors. Here we introduce a\nnew paradigm for all-optical switching based on the ultrafast transition from\nthe strong to the weak coupling regime in microcavities embedding atomically\nthin transition metal dichalcogenides. Employing single and double stacks of\nhBN-encapsulated MoS$_2$ homobilayers with high optical nonlinearities and fast\nexciton relaxation times, we observe a collapse of the 55-meV polariton gap and\nits revival in less than one picosecond, lowering the threshold for optical\nswitching below 4 pJ per pulse, while retaining ultrahigh switching\nfrequencies. As an additional degree of freedom, the switching can be triggered\npumping either the intra- or the interlayer excitons of the bilayers at\ndifferent wavelengths, speeding up the polariton dynamics, owing to unique\ninterspecies excitonic interactions. Our approach will enable the development\nof compact ultrafast all-optical logical circuits and neural networks,\nshowcasing a new platform for polaritonic information processing based on\nmanipulating the light-matter coupling.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}