{"id":"2408.10223","title":"High order compact fully-discrete scheme for hyperbolic conversation\n  laws","authors":"Tong Zhou, Haitao Dong, Shucheng Pan","authorsParsed":[["Zhou","Tong",""],["Dong","Haitao",""],["Pan","Shucheng",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 10:14:52 GMT"}],"updateDate":"2024-08-21","timestamp":1722420892000,"abstract":"  Based on the solution formula method, a series of one-step fully-discrete\nschemes, such as FWENO/Full-WENO has been proposed. Storing the by-products\nconservative variables at the half points (grid center) and using them as\ninterpolation information to construct high-order schemes, we obtain a new\nclass of one-step compact fully-discrete schemes. The new scheme can be\nassociate with various non-oscillatory strategies. This paper takes\nstate-of-the-art WENO-JS method as an example and proposes a family of compact\nfully-discrete WENO scheme. Detailed analysis is conducted on accuracy, errors,\ncomputational cost, efficiency and their connection with Hermite interpolation.\nMeanwhile, we design a new entropy flux linearization strategy for Euler\nequations to enhance its robustness, and also develop a multi-dimensional\nmethod for this compact fully-discrete framework. Due to the new scheme is\none-step and utilizes stored by-products information for interpolation, it has\na significant advantage in efficiency. For one-dimensional Euler equations,\ncompared to the original FWENO, the computational cost only increases by\n20-40%, while is approximately one-third of WENO+RK3. For two-dimensional case,\na new special dimension-by-dimension strategy is applied. Although there is an\nadditional computing cost, numerical experiments show that the new scheme only\nneeds about 1/10 to 1/13 cost of that for WENO+RK3 when obtaining similar or\neven better resolution results, indicating that the new scheme is more\nefficient than semi-discrete schemes based on RK methods.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}