{"id":"2408.07761","title":"The effects of the carbon-to-oxygen ratio on the condensate compositions\n  around Solar-like stars","authors":"Cody J. Shakespeare, Min Li, Shichun Huang, Zhaohuan Zhu, and Jason H.\n  Steffen","authorsParsed":[["Shakespeare","Cody J.",""],["Li","Min",""],["Huang","Shichun",""],["Zhu","Zhaohuan",""],["Steffen","Jason H.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 18:26:13 GMT"}],"updateDate":"2024-08-16","timestamp":1723659973000,"abstract":"  The initial stellar carbon-to-oxygen (C/O) ratio can have a large impact on\nthe resulting condensed species present in the protoplanetary disk and, hence,\nthe composition of the bodies and planets that form. The observed C/O ratios of\nstars can vary from 0.1-2. We use a sequential dust condensation model to\nexamine the impact of the C/O ratio on the composition of solids around a\nSolar-like star. We utilize this model in a focused examination of the impact\nof varying the initial stellar C/O ratio to isolate the effects of the C/O\nratio in the context of Solar-like stars. We describe three different system\ntypes in our findings. The Solar system falls into the silicate-dominant, low\nC/O ratio systems which end at a stellar C/O ratio somewhere between 0.52 and\n0.6. At C/O ratios between about 0.6 and 0.9, we have intermediate systems.\nIntermediate systems show a decrease in silicates while carbides begin to\nbecome significant. Carbide-dominant systems begin around a C/O ratio of 0.9.\nCarbide-dominant systems exhibit high carbide surface densities at inner radii\nwith comparable levels of carbides and silicates at outer radii. Our models\nshow that changes between C/O=0.8 and C/O=1 are more significant than previous\nstudies, that carbon can exceed 80% of the condensed mass, and that carbon\ncondensation can be significant at radii up to 6 AU.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}