{"id":"2408.01810","title":"Demystifying Device-specific Compatibility Issues in Android Apps","authors":"Junfeng Chen, Kevin Li, Yifei Chen, Lili Wei, Yepang Liu","authorsParsed":[["Chen","Junfeng",""],["Li","Kevin",""],["Chen","Yifei",""],["Wei","Lili",""],["Liu","Yepang",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 15:34:58 GMT"}],"updateDate":"2024-08-06","timestamp":1722699298000,"abstract":"  The Android ecosystem is profoundly fragmented due to the frequent updates of\nthe Android system and the prevalent customizations by mobile device\nmanufacturers. Previous research primarily focused on identifying and repairing\nevolution-induced API compatibility issues, with limited consideration of\ndevices-specific compatibility issues (DSC issues). To fill this gap, we\nconduct an empirical study of 197 DSC issues collected from 94 open-source\nrepositories on GitHub. We introduce a new perspective for comprehending these\nissues by categorizing them into two principal groups, Functionality Breaks,\nand OEM Features, based on their manifestations and root causes. The\nfunctionality break issues disrupt standard Android system behaviors, lead to\ncrashes or unexpected behaviors on specific devices, and require developers to\nimplement workarounds to preserve the original functionality. The OEM feature\nissues involve the introduction of device-specific functionalities or features\nbeyond the basic Android system. The different nature of functionality break\nissues and OEM feature issues lead to unique challenges in addressing them.\nCommon solutions for functionality break issues involve calling additional\nAPIs, substituting problematic ones, or using specific parameters, while\nresolving OEM feature issues often relies on Android inter-component\ncommunication methods and reflection, with additional unconventional\nstrategies. Such observations highlight the distinctive challenges in\naddressing DSC issues in Android apps and will facilitate the future\ndevelopment of testing and analysis tools targeting these issues. Our study\ndemonstrates that Functionality break and OEM feature issues have different\ncharacteristics, and future research may need to investigate them separately.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"37UyEqQZNn4hTQd4PTKzvhPhxRHMPuuiy2ByOl8qamc","pdfSize":"507010"}
