{"id":"2408.02367","title":"StoDIP: Efficient 3D MRF image reconstruction with deep image priors and\n  stochastic iterations","authors":"Perla Mayo, Matteo Cencini, Carolin M. Pirkl, Marion I. Menzel,\n  Michela Tosetti, Bjoern H. Menze and Mohammad Golbabaee","authorsParsed":[["Mayo","Perla",""],["Cencini","Matteo",""],["Pirkl","Carolin M.",""],["Menzel","Marion I.",""],["Tosetti","Michela",""],["Menze","Bjoern H.",""],["Golbabaee","Mohammad",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 10:32:06 GMT"}],"updateDate":"2024-08-06","timestamp":1722853926000,"abstract":"  Magnetic Resonance Fingerprinting (MRF) is a time-efficient approach to\nquantitative MRI for multiparametric tissue mapping. The reconstruction of\nquantitative maps requires tailored algorithms for removing aliasing artefacts\nfrom the compressed sampled MRF acquisitions. Within approaches found in the\nliterature, many focus solely on two-dimensional (2D) image reconstruction,\nneglecting the extension to volumetric (3D) scans despite their higher\nrelevance and clinical value. A reason for this is that transitioning to 3D\nimaging without appropriate mitigations presents significant challenges,\nincluding increased computational cost and storage requirements, and the need\nfor large amount of ground-truth (artefact-free) data for training. To address\nthese issues, we introduce StoDIP, a new algorithm that extends the\nground-truth-free Deep Image Prior (DIP) reconstruction to 3D MRF imaging.\nStoDIP employs memory-efficient stochastic updates across the multicoil MRF\ndata, a carefully selected neural network architecture, as well as faster\nnonuniform FFT (NUFFT) transformations. This enables a faster convergence\ncompared against a conventional DIP implementation without these features.\nTested on a dataset of whole-brain scans from healthy volunteers, StoDIP\ndemonstrated superior performance over the ground-truth-free reconstruction\nbaselines, both quantitatively and qualitatively.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}