{"id":"2408.10498","title":"Cervical Cancer Detection Using Multi-Branch Deep Learning Model","authors":"Tatsuhiro Baba, Abu Saleh Musa Miah, Jungpil Shin, Md. Al Mehedi Hasan","authorsParsed":[["Baba","Tatsuhiro",""],["Miah","Abu Saleh Musa",""],["Shin","Jungpil",""],["Hasan","Md. Al Mehedi",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 02:44:48 GMT"}],"updateDate":"2024-08-21","timestamp":1724121888000,"abstract":"  Cervical cancer is a crucial global health concern for women, and the\npersistent infection of High-risk HPV mainly triggers this remains a global\nhealth challenge, with young women diagnosis rates soaring from 10\\% to 40\\%\nover three decades. While Pap smear screening is a prevalent diagnostic method,\nvisual image analysis can be lengthy and often leads to mistakes. Early\ndetection of the disease can contribute significantly to improving patient\noutcomes. In recent decades, many researchers have employed machine learning\ntechniques that achieved promise in cervical cancer detection processes based\non medical images. In recent years, many researchers have employed various\ndeep-learning techniques to achieve high-performance accuracy in detecting\ncervical cancer but are still facing various challenges. This research proposes\nan innovative and novel approach to automate cervical cancer image\nclassification using Multi-Head Self-Attention (MHSA) and convolutional neural\nnetworks (CNNs). The proposed method leverages the strengths of both MHSA\nmechanisms and CNN to effectively capture both local and global features within\ncervical images in two streams. MHSA facilitates the model's ability to focus\non relevant regions of interest, while CNN extracts hierarchical features that\ncontribute to accurate classification. Finally, we combined the two stream\nfeatures and fed them into the classification module to refine the feature and\nthe classification. To evaluate the performance of the proposed approach, we\nused the SIPaKMeD dataset, which classifies cervical cells into five\ncategories. Our model achieved a remarkable accuracy of 98.522\\%. This\nperformance has high recognition accuracy of medical image classification and\nholds promise for its applicability in other medical image recognition tasks.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}