{"id":"2408.11172","title":"SubgoalXL: Subgoal-based Expert Learning for Theorem Proving","authors":"Xueliang Zhao, Lin Zheng, Haige Bo, Changran Hu, Urmish Thakker,\n  Lingpeng Kong","authorsParsed":[["Zhao","Xueliang",""],["Zheng","Lin",""],["Bo","Haige",""],["Hu","Changran",""],["Thakker","Urmish",""],["Kong","Lingpeng",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 20:10:53 GMT"}],"updateDate":"2024-08-22","timestamp":1724184653000,"abstract":"  Formal theorem proving, a field at the intersection of mathematics and\ncomputer science, has seen renewed interest with advancements in large language\nmodels (LLMs). This paper introduces SubgoalXL, a novel approach that\nsynergizes subgoal-based proofs with expert learning to enhance LLMs'\ncapabilities in formal theorem proving within the Isabelle environment.\nSubgoalXL addresses two critical challenges: the scarcity of specialized\nmathematics and theorem-proving data, and the need for improved multi-step\nreasoning abilities in LLMs. By optimizing data efficiency and employing\nsubgoal-level supervision, SubgoalXL extracts richer information from limited\nhuman-generated proofs. The framework integrates subgoal-oriented proof\nstrategies with an expert learning system, iteratively refining formal\nstatement, proof, and subgoal generators. Leveraging the Isabelle environment's\nadvantages in subgoal-based proofs, SubgoalXL achieves a new state-of-the-art\nperformance of 56.1\\% in Isabelle on the standard miniF2F dataset, marking an\nabsolute improvement of 4.9\\%. Notably, SubgoalXL successfully solves 41 AMC12,\n9 AIME, and 3 IMO problems from miniF2F. These results underscore the\neffectiveness of maximizing limited data utility and employing targeted\nguidance for complex reasoning in formal theorem proving, contributing to the\nongoing advancement of AI reasoning capabilities. The implementation is\navailable at \\url{https://github.com/zhaoxlpku/SubgoalXL}.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Logic in Computer Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fegk_4M3Lprc6JAXigCenmp_D_LqeTHVSNca3xbqxlE","pdfSize":"1017180"}
