{"id":"2408.01383","title":"PLIC-Net: A Machine Learning Approach for 3D Interface Reconstruction in\n  Volume of Fluid Methods","authors":"Andrew Cahaly, Fabien Evrard, Olivier Desjardins","authorsParsed":[["Cahaly","Andrew",""],["Evrard","Fabien",""],["Desjardins","Olivier",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 16:41:16 GMT"}],"updateDate":"2024-08-05","timestamp":1722616876000,"abstract":"  The accurate reconstruction of immiscible fluid-fluid interfaces from the\nvolume fraction field is a critical component of geometric Volume of Fluid\n(VOF) methods. A common strategy is the Piecewise Linear Interface Calculation\n(PLIC), which fits a plane in each mixed-phase computational cell. However,\nrecent work goes beyond PLIC by using two planes or even a paraboloid. To\nselect such planes or paraboloids, complex optimization algorithms as well as\ncarefully crafted heuristics are necessary. Yet, the potential exists for a\nwell-trained machine learning model to efficiently provide broadly applicable\nsolutions to the interface reconstruction problem at lower costs. In this work,\nthe viability of a machine learning approach is demonstrated in the context of\na single plane reconstruction. A feed-forward deep neural network is used to\npredict the normal vector of a PLIC plane given volume fraction and phasic\nbarycenter data in a $3\\times3\\times3$ stencil. The PLIC plane is then\ntranslated in its cell to ensure exact volume conservation. Our proposed neural\nnetwork PLIC reconstruction (PLIC-Net) is equivariant to reflections about the\nCartesian planes. Training data is analytically generated with\n$\\mathcal{O}(10^6)$ randomized paraboloid surfaces, which allows for sampling a\nwide range of interface shapes. PLIC-Net is tested in multiphase flow\nsimulations where it is compared to standard (E)LVIRA reconstruction\nalgorithms, and the impact of training data statistics on PLIC-Net's\nperformance is also explored. It is found that PLIC-Net greatly limits the\nformation of spurious planes and generates cleaner numerical break-up of the\ninterface. Additionally, the computational cost of PLIC-Net is lower than that\nof (E)LVIRA. These results establish that machine learning is a viable approach\nto VOF interface reconstruction and is superior to current reconstruction\nalgorithms for some cases.\n","subjects":["Physics/Computational Physics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"p5bZfEtS5pCyvqnkRRaPcq97zZGvIcJy2kIpWU3IHKE","pdfSize":"7842217"}
