{"id":"2408.04813","title":"Rethinking Multiple Instance Learning: Developing an Instance-Level\n  Classifier via Weakly-Supervised Self-Training","authors":"Yingfan Ma, Xiaoyuan Luo, Mingzhi Yuan, Xinrong Chen and Manning Wang","authorsParsed":[["Ma","Yingfan",""],["Luo","Xiaoyuan",""],["Yuan","Mingzhi",""],["Chen","Xinrong",""],["Wang","Manning",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 01:53:41 GMT"}],"updateDate":"2024-08-12","timestamp":1723168421000,"abstract":"  Multiple instance learning (MIL) problem is currently solved from either\nbag-classification or instance-classification perspective, both of which ignore\nimportant information contained in some instances and result in limited\nperformance. For example, existing methods often face difficulty in learning\nhard positive instances. In this paper, we formulate MIL as a semi-supervised\ninstance classification problem, so that all the labeled and unlabeled\ninstances can be fully utilized to train a better classifier. The difficulty in\nthis formulation is that all the labeled instances are negative in MIL, and\ntraditional self-training techniques used in semi-supervised learning tend to\ndegenerate in generating pseudo labels for the unlabeled instances in this\nscenario. To resolve this problem, we propose a weakly-supervised self-training\nmethod, in which we utilize the positive bag labels to construct a global\nconstraint and a local constraint on the pseudo labels to prevent them from\ndegenerating and force the classifier to learn hard positive instances. It is\nworth noting that easy positive instances are instances are far from the\ndecision boundary in the classification process, while hard positive instances\nare those close to the decision boundary. Through iterative optimization, the\npseudo labels can gradually approach the true labels. Extensive experiments on\ntwo MNIST synthetic datasets, five traditional MIL benchmark datasets and two\nhistopathology whole slide image datasets show that our method achieved new\nSOTA performance on all of them. The code will be publicly available.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}