{"id":"2408.16458","title":"Quantum Sieving for Code-Based Cryptanalysis and Its Limitations for ISD","authors":"Lynn Engelberts, Simona Etinski, Johanna Loyer","authorsParsed":[["Engelberts","Lynn",""],["Etinski","Simona",""],["Loyer","Johanna",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 11:47:33 GMT"}],"updateDate":"2024-08-30","timestamp":1724932053000,"abstract":"  Sieving using near-neighbor search techniques is a well-known method in\nlattice-based cryptanalysis, yielding the current best runtime for the shortest\nvector problem in both the classical [BDGL16] and quantum [BCSS23] setting.\nRecently, sieving has also become an important tool in code-based\ncryptanalysis. Specifically, using a sieving subroutine, [GJN23, DEEK24]\npresented a variant of the information-set decoding (ISD) framework, which is\ncommonly used for attacking cryptographically relevant instances of the\ndecoding problem. The resulting sieving-based ISD framework yields complexities\nclose to the best-performing classical algorithms for the decoding problem such\nas [BJMM12, BM18]. It is therefore natural to ask how well quantum versions\nperform. In this work, we introduce the first quantum algorithms for code\nsieving by designing quantum variants of the aforementioned sieving subroutine.\nIn particular, using quantum-walk techniques, we provide a speed-up over the\nbest known classical algorithm from [DEEK24] and over a variant using Grover's\nalgorithm [Gro96]. Our quantum-walk algorithm exploits the structure of the\nunderlying search problem by adding a layer of locality-sensitive filtering,\ninspired by the quantum-walk algorithm for lattice sieving from [CL21]. We\ncomplement our asymptotic analysis of the quantum algorithms with numerical\nresults, and observe that our quantum speed-ups for code sieving behave\nsimilarly as those observed in lattice sieving. In addition, we show that a\nnatural quantum analog of the sieving-based ISD framework does not provide any\nspeed-up over the first presented quantum ISD algorithm [Ber10]. Our analysis\nhighlights that the framework should be adapted in order to outperform the\nstate-of-the-art of quantum ISD algorithms [KT17, Kir18].\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7A250c3Pb-FSstdEAw20l7eieET0hOFbAQ-yhfIGqso","pdfSize":"558485"}
