{"id":"2408.00309","title":"Discretizing Continuous Action Space with Unimodal Probability\n  Distributions for On-Policy Reinforcement Learning","authors":"Yuanyang Zhu, Zhi Wang, Yuanheng Zhu, Chunlin Chen, Dongbin Zhao","authorsParsed":[["Zhu","Yuanyang",""],["Wang","Zhi",""],["Zhu","Yuanheng",""],["Chen","Chunlin",""],["Zhao","Dongbin",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 06:06:53 GMT"}],"updateDate":"2024-08-02","timestamp":1722492413000,"abstract":"  For on-policy reinforcement learning, discretizing action space for\ncontinuous control can easily express multiple modes and is straightforward to\noptimize. However, without considering the inherent ordering between the\ndiscrete atomic actions, the explosion in the number of discrete actions can\npossess undesired properties and induce a higher variance for the policy\ngradient estimator. In this paper, we introduce a straightforward architecture\nthat addresses this issue by constraining the discrete policy to be unimodal\nusing Poisson probability distributions. This unimodal architecture can better\nleverage the continuity in the underlying continuous action space using\nexplicit unimodal probability distributions. We conduct extensive experiments\nto show that the discrete policy with the unimodal probability distribution\nprovides significantly faster convergence and higher performance for on-policy\nreinforcement learning algorithms in challenging control tasks, especially in\nhighly complex tasks such as Humanoid. We provide theoretical analysis on the\nvariance of the policy gradient estimator, which suggests that our attentively\ndesigned unimodal discrete policy can retain a lower variance and yield a\nstable learning process.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QLB3ct0ISCphVshUx4VDg1A8hfZ2HeatK-O1dSX5RLQ","pdfSize":"1911072","txDigest":"J6Efi7Fgd4fWPiJYj8WD1uPed7fC1wSqjfnPtk4vqhzk","endEpoch":"1","status":"CERTIFIED"}
