{"id":"2408.06072","title":"CogVideoX: Text-to-Video Diffusion Models with An Expert Transformer","authors":"Zhuoyi Yang, Jiayan Teng, Wendi Zheng, Ming Ding, Shiyu Huang,\n  Jiazheng Xu, Yuanming Yang, Wenyi Hong, Xiaohan Zhang, Guanyu Feng, Da Yin,\n  Xiaotao Gu, Yuxuan Zhang, Weihan Wang, Yean Cheng, Ting Liu, Bin Xu, Yuxiao\n  Dong, Jie Tang","authorsParsed":[["Yang","Zhuoyi",""],["Teng","Jiayan",""],["Zheng","Wendi",""],["Ding","Ming",""],["Huang","Shiyu",""],["Xu","Jiazheng",""],["Yang","Yuanming",""],["Hong","Wenyi",""],["Zhang","Xiaohan",""],["Feng","Guanyu",""],["Yin","Da",""],["Gu","Xiaotao",""],["Zhang","Yuxuan",""],["Wang","Weihan",""],["Cheng","Yean",""],["Liu","Ting",""],["Xu","Bin",""],["Dong","Yuxiao",""],["Tang","Jie",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 11:47:11 GMT"}],"updateDate":"2024-08-13","timestamp":1723463231000,"abstract":"  We introduce CogVideoX, a large-scale diffusion transformer model designed\nfor generating videos based on text prompts. To efficently model video data, we\npropose to levearge a 3D Variational Autoencoder (VAE) to compress videos along\nboth spatial and temporal dimensions. To improve the text-video alignment, we\npropose an expert transformer with the expert adaptive LayerNorm to facilitate\nthe deep fusion between the two modalities. By employing a progressive training\ntechnique, CogVideoX is adept at producing coherent, long-duration videos\ncharacterized by significant motions. In addition, we develop an effective\ntext-video data processing pipeline that includes various data preprocessing\nstrategies and a video captioning method. It significantly helps enhance the\nperformance of CogVideoX, improving both generation quality and semantic\nalignment. Results show that CogVideoX demonstrates state-of-the-art\nperformance across both multiple machine metrics and human evaluations. The\nmodel weights of both the 3D Causal VAE and CogVideoX are publicly available at\nhttps://github.com/THUDM/CogVideo.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}