{"id":"2408.12124","title":"Recording Brain Activity While Listening to Music Using Wearable EEG\n  Devices Combined with Bidirectional Long Short-Term Memory Networks","authors":"Jingyi Wang and Zhiqun Wang and Guiran Liu","authorsParsed":[["Wang","Jingyi",""],["Wang","Zhiqun",""],["Liu","Guiran",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 04:32:22 GMT"}],"updateDate":"2024-08-23","timestamp":1724301142000,"abstract":"  Electroencephalography (EEG) signals are crucial for investigating brain\nfunction and cognitive processes. This study aims to address the challenges of\nefficiently recording and analyzing high-dimensional EEG signals while\nlistening to music to recognize emotional states. We propose a method combining\nBidirectional Long Short-Term Memory (Bi-LSTM) networks with attention\nmechanisms for EEG signal processing. Using wearable EEG devices, we collected\nbrain activity data from participants listening to music. The data was\npreprocessed, segmented, and Differential Entropy (DE) features were extracted.\nWe then constructed and trained a Bi-LSTM model to enhance key feature\nextraction and improve emotion recognition accuracy. Experiments were conducted\non the SEED and DEAP datasets. The Bi-LSTM-AttGW model achieved 98.28% accuracy\non the SEED dataset and 92.46% on the DEAP dataset in multi-class emotion\nrecognition tasks, significantly outperforming traditional models such as SVM\nand EEG-Net. This study demonstrates the effectiveness of combining Bi-LSTM\nwith attention mechanisms, providing robust technical support for applications\nin brain-computer interfaces (BCI) and affective computing. Future work will\nfocus on improving device design, incorporating multimodal data, and further\nenhancing emotion recognition accuracy, aiming to achieve practical\napplications in real-world scenarios.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Human-Computer Interaction","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}