{"id":"2408.03004","title":"Reconciling Cosmological Tensions with Inelastic Dark Matter and Dark\n  Radiation in a $\\boldsymbol{U(1)_D}$ Framework","authors":"Wonsub Cho, Ki-Young Choi, Satyabrata Mahapatra","authorsParsed":[["Cho","Wonsub",""],["Choi","Ki-Young",""],["Mahapatra","Satyabrata",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 07:30:07 GMT"}],"updateDate":"2024-08-07","timestamp":1722929407000,"abstract":"  We propose a novel and comprehensive particle physics framework that\naddresses multiple cosmological tensions observed in recent measurements of the\nHubble parameter, $S_8$, and Lyman-$\\alpha$ forest data. Our model, termed\n`{\\bf SIDR+$\\boldsymbol{z_t}$}' (Self Interacting Dark Radiation with\ntransition redshift), is based on an inelastic dark matter (IDM) scenario\ncoupled with dark radiation, governed by a $U(1)_D$ gauge symmetry. This\nframework naturally incorporates cold dark matter (DM), SIDR, and the\ninteractions between these components. The fluid-like behavior of the dark\nradiation component, effectively mitigates both the Hubble and $S_8$ tensions\nby suppressing free-streaming effects. Simultaneously, the interacting DM-DR\nsystem attenuates the matter power spectrum at small scales, potentially\nreconciling discrepancies in Lyman-$\\alpha$ (Ly-$\\alpha$) observations. The\ninelastic nature of DM provides a distinct temperature dependence for the DM-DR\ninteraction rate determined by the mass-splitting between the inelastic dark\nfermions which is crucial for resolving the Ly-$\\alpha$ discrepancies. We\npresent a cosmologically consistent analysis of the model by solving the\nrelevant Boltzmann equations to obtain the energy density and number density\nevolution of different species of the model. The DR undergoes two ``steps\" of\nincreased energy density when the heavier dark species freeze out and become\nnon-relativistic, transferring their entropy to the dark radiation and\nenhancing $\\Delta N{\\rm eff}$. The analysis showcases the model's potential to\nuphold the Big Bang Nucleosynthesis (BBN) prediction of $\\Delta N_{\\rm eff}$\nbut dominantly producing additional contributions prior to recombination, while\nsimultaneously achieving correct relic density of DM though an hybrid of\nfreeze-in and non-thermal production.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}