{"id":"2408.07083","title":"Masked EEG Modeling for Driving Intention Prediction","authors":"Jinzhao Zhou, Justin Sia, Yiqun Duan, Yu-Cheng Chang, Yu-Kai Wang,\n  Chin-Teng Lin","authorsParsed":[["Zhou","Jinzhao",""],["Sia","Justin",""],["Duan","Yiqun",""],["Chang","Yu-Cheng",""],["Wang","Yu-Kai",""],["Lin","Chin-Teng",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 03:49:05 GMT"}],"updateDate":"2024-08-15","timestamp":1723088945000,"abstract":"  Driving under drowsy conditions significantly escalates the risk of vehicular\naccidents. Although recent efforts have focused on using electroencephalography\nto detect drowsiness, helping prevent accidents caused by driving in such\nstates, seamless human-machine interaction in driving scenarios requires a more\nversatile EEG-based system. This system should be capable of understanding a\ndriver's intention while demonstrating resilience to artifacts induced by\nsudden movements. This paper pioneers a novel research direction in\nBCI-assisted driving, studying the neural patterns related to driving\nintentions and presenting a novel method for driving intention prediction. In\nparticular, our preliminary analysis of the EEG signal using independent\ncomponent analysis suggests a close relation between the intention of driving\nmaneuvers and the neural activities in central-frontal and parietal areas.\nPower spectral density analysis at a group level also reveals a notable\ndistinction among various driving intentions in the frequency domain. To\nexploit these brain dynamics, we propose a novel Masked EEG Modeling framework\nfor predicting human driving intentions, including the intention for left\nturning, right turning, and straight proceeding. Extensive experiments,\nencompassing comprehensive quantitative and qualitative assessments on public\ndataset, demonstrate the proposed method is proficient in predicting driving\nintentions across various vigilance states. Specifically, our model attains an\naccuracy of 85.19% when predicting driving intentions for drowsy subjects,\nwhich shows its promising potential for mitigating traffic accidents related to\ndrowsy driving. Notably, our method maintains over 75% accuracy when more than\nhalf of the channels are missing or corrupted, underscoring its adaptability in\nreal-life driving.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eXKyxwEJKI48KlI-kWUq3y6ml15pB26yfJX5U00c8UA","pdfSize":"6194532"}
