{"id":"2408.02345","title":"Nonlocal particle approximation for linear and fast diffusion equations","authors":"Jos\\'e Antonio Carrillo, Antonio Esposito, Jakub Skrzeczkowski, Jeremy\n  Sheung-Him Wu","authorsParsed":[["Carrillo","José Antonio",""],["Esposito","Antonio",""],["Skrzeczkowski","Jakub",""],["Wu","Jeremy Sheung-Him",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 09:44:59 GMT"}],"updateDate":"2024-08-06","timestamp":1722851099000,"abstract":"  We construct deterministic particle solutions for linear and fast diffusion\nequations using a nonlocal approximation. We exploit the $2$-Wasserstein\ngradient flow structure of the equations in order to obtain the nonlocal\napproximating PDEs by regularising the corresponding internal energy with\nsuitably chosen mollifying kernels, either compactly or globally supported.\nWeak solutions are obtained by the JKO scheme. From the technical point of\nview, we improve known commutator estimates, fundamental in the\nnonlocal-to-local limit, to include globally supported kernels which, in\nparticular cases, allow us to justify the limit without any further\nperturbation needed. Furthermore, we prove geodesic convexity of the nonlocal\nenergies in order to prove convergence of the particle solutions to the\nnonlocal equations towards weak solutions of the local equations. We overcome\nthe crucial difficulty of dealing with the singularity of the first variation\nof the free energies at the origin. As a byproduct, we provide convergence\nrates expressed as a scaling relationship between the number of particles and\nthe localisation parameter. The analysis we perform leverages the fact that\nglobally supported kernels yield a better convergence rate compared to\ncompactly supported kernels. Our result is relevant in statistics, more\nprecisely in sampling Gibbs and heavy-tailed distributions.\n","subjects":["Mathematics/Analysis of PDEs","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}