{"id":"2408.17200","title":"Investor behavior and multiscale cross-correlations: Unveiling regime\n  shifts in global financial markets","authors":"Marina Dolfin, George Kapetanios, Leone Leonida, Jose De Leon Miranda","authorsParsed":[["Dolfin","Marina",""],["Kapetanios","George",""],["Leonida","Leone",""],["Miranda","Jose De Leon",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 10:53:19 GMT"}],"updateDate":"2024-09-02","timestamp":1725015199000,"abstract":"  We propose an algorithm to capture emergent patterns in the\ncross-correlations of financial markets, highlighting regime changes on a\nglobal scale. In our approach, financial markets are viewed as complex adaptive\nsystems, and multiscale properties and cross-correlations are considered,\nparticularly during stress conditions such as the COVID-19 pandemic, the\ninvasion of Ukraine by Russia in 2022, and Brexit. We investigate whether\nsignificant disruptions reflect an imbalance in investment horizons among\ninvestors, and we propose a measure based on this imbalance to depict the\nimpact on global financial markets. The detrended cross-correlation cost\n(DCCC), which is derived from detrended cross-correlation analysis, uses\ncross-correlations at different timescales to capture variations in investment\nhorizons amid financial uncertainties. Our algorithm, which combines DCCC\nanalysis and the minimum-spanning-tree filtering approach, tracks system\ninterconnectedness and investor imbalances. We tested the DCCC indicator using\ndaily price series of G7, Russian, and Chinese markets over the past decade and\nfound that it increases sharply during ``crash'' periods compared to ``business\nas usual'' periods. Our empirical results confirm that short-term investment\nhorizons dominate during financial instabilities; this validates our hypothesis\nand indicates that the DCCC can serve as a leading indicator of shifts in\nfinancial-market regimes.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"I2-MNvGxUD6tHE17wiIulzWLR2x6LqRqKgmZBhlP3ZI","pdfSize":"2596393"}
