{"id":"2408.09623","title":"Reorientation transition between square and hexagonal skyrmion lattices\n  near the saturation into the homogeneous state in quasi-two-dimensional\n  chiral magnets","authors":"Andrey O. Leonov","authorsParsed":[["Leonov","Andrey O.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 00:55:49 GMT"}],"updateDate":"2024-08-20","timestamp":1724028949000,"abstract":"  I revisit the well-known phase transition between the hexagonal skyrmion\nlattice and the homogeneous state within the phenomenological Dzyaloshinskii\ntheory for chiral magnets which includes only the exchange,\nDzyaloshinskii-Moriya and Zeeman energy contributions. I show that, in a narrow\nfield range near the saturation field, the hexagonal skyrmion order gradually\ntransforms into a square arrangement of skyrmions. Then, by the second-order\nphase transition during which the lattice period diverges, the square skyrmion\nlattice releases a set of repulsive isolated skyrmions. On decreasing magnetic\nfield, isolated skyrmions re-condense into the square lattice at the same\ncritical field as soon as their eigen-energy becomes negative with respect to\nthe field-aligned state. The underlying reason of the reorientation transition\nbetween two skyrmion orders can be deduced from the energy density distribution\nwithin isolated skyrmions surrounded by the homogeneous state. When the\nnegative energy within the ring-shaped area at the skyrmion outskirt outweighs\nthe positive energy amount around the skyrmion axis, skyrmions tend to form the\nsquare lattice, in which the overlap of skyrmion profiles results in smaller\nenergy losses as compared with the hexagonal crystal. With the further\ndecreasing field, the hexagonal lattice achieves smaller energy density in\ncomparison with the square one due to the denser packing of individual\nskyrmions.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cOVByhP0LEbhP-BQkNBRt-4bJmekfqZBclR0RR-fDys","pdfSize":"3901551"}
