{"id":"2408.13181","title":"Fluid-network relations: decay laws meet with spatial self-similarity,\n  scale-invariance, and control scaling","authors":"Yang Tian, Pei Sun and Yizhou Xu","authorsParsed":[["Tian","Yang",""],["Sun","Pei",""],["Xu","Yizhou",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 16:02:26 GMT"}],"updateDate":"2024-08-26","timestamp":1724428946000,"abstract":"  Diverse implicit structures of fluids are discovered lately, providing\nopportunities to study the physics of fluids applying network analysis.\nAlthough considerable works devote to identifying informative network\nstructures of fluids, we have limited understanding about the information these\nnetworks convey about fluids. To analyze how fluid mechanics is embodied in\nnetwork topology or vice versa, we reveal a set of fluid-network relations that\nquantify the interactions between fundamental fluid properties (e.g., kinetic\nenergy and enstrophy decay laws) and defining network characteristics (e.g.,\nspatial self-similarity, scale-invariance, and control scaling). By analyzing\nspatial self-similarity in classic and generalized contexts, we first assess\nthe self-similarity of vortical interactions in fluid flows. Deviations from\nself-similarity in networks exhibit power-law scaling behaviors with respect to\nfluid properties, suggesting the diversity among vortex as essential to\nself-similar fluid flows. Then, the same paradigm is adopted to investigate\nscale-invariance using renormalization groups, which reveals that the breaking\nextents of scale-invariance in networks, similar to those of spatial\nself-similarity, also scale with fluid properties in power-law manners.\nFurthermore, we define a control problem on networks to study the propagation\nof perturbations through vortical interactions over different ranges. The\nminimum cost of controlling vortical networks exponentially scales with range\ndiameters (i.e., control distances), whose growth rates experiences temporal\ndecays. We show that this temporal decay speed is fully determined by fluid\nproperties in power-law scaling behaviours. In summary, these fluid-network\nrelations enable a deeper understanding of implicit fluid structures and their\ninteractions with fluid dynamics.\n","subjects":["Physics/Fluid Dynamics","Condensed Matter/Statistical Mechanics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}