{"id":"2408.14641","title":"A millimeter rebrightening in GRB 210702A","authors":"Simon de Wet, Tanmoy Laskar, Paul J. Groot, Rodolfo Barniol Duran, Edo\n  Berger, Shivani Bhandari, Tarraneh Eftekhari, C. Guidorzi, Shiho Kobayashi,\n  Daniel A. Perley, Re'em Sari, Genevieve Schroeder","authorsParsed":[["de Wet","Simon",""],["Laskar","Tanmoy",""],["Groot","Paul J.",""],["Duran","Rodolfo Barniol",""],["Berger","Edo",""],["Bhandari","Shivani",""],["Eftekhari","Tarraneh",""],["Guidorzi","C.",""],["Kobayashi","Shiho",""],["Perley","Daniel A.",""],["Sari","Re'em",""],["Schroeder","Genevieve",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 21:08:28 GMT"}],"updateDate":"2024-08-28","timestamp":1724706508000,"abstract":"  We present X-ray to radio frequency observations of the bright long gamma-ray\nburst GRB 210702A. Our ALMA 97.5 GHz observations show a significant\nrebrightening by a factor of ~2 beginning at 8.2 days post-burst and rising to\npeak brightness at 18.1 days before declining again. This is the first such\nrebrightening seen in a millimeter afterglow light curve. A standard forward\nshock model in a stellar wind circumburst medium can explain most of our X-ray,\noptical and millimeter observations prior to the rebrightening, but\nsignificantly over-predicts the self-absorbed radio emission, and cannot\nexplain the millimeter rebrightening. We investigate possible explanations for\nthe millimeter rebrightening and find that energy injection or a reverse shock\nfrom a late-time shell collision are plausible causes. Similar to other bursts,\nour radio data may require alternative scenarios such as a thermal electron\npopulation or a structured jet to explain the data. Our observations\ndemonstrate that millimeter light curves can exhibit some of the rich features\nmore commonly seen in optical and X-ray afterglow light curves, motivating\nfurther millimeter wavelength studies of GRB afterglows.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8pFj67zlpkD9MroTaIPudRIidIJsrbl3qmJAKyxq78c","pdfSize":"1234046"}
