{"id":"2408.07430","title":"UAHOI: Uncertainty-aware Robust Interaction Learning for HOI Detection","authors":"Mu Chen, Minghan Chen, Yi Yang","authorsParsed":[["Chen","Mu",""],["Chen","Minghan",""],["Yang","Yi",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 10:06:39 GMT"}],"updateDate":"2024-08-15","timestamp":1723629999000,"abstract":"  This paper focuses on Human-Object Interaction (HOI) detection, addressing\nthe challenge of identifying and understanding the interactions between humans\nand objects within a given image or video frame. Spearheaded by Detection\nTransformer (DETR), recent developments lead to significant improvements by\nreplacing traditional region proposals by a set of learnable queries. However,\ndespite the powerful representation capabilities provided by Transformers,\nexisting Human-Object Interaction (HOI) detection methods still yield low\nconfidence levels when dealing with complex interactions and are prone to\noverlooking interactive actions. To address these issues, we propose a novel\napproach \\textsc{UAHOI}, Uncertainty-aware Robust Human-Object Interaction\nLearning that explicitly estimates prediction uncertainty during the training\nprocess to refine both detection and interaction predictions. Our model not\nonly predicts the HOI triplets but also quantifies the uncertainty of these\npredictions. Specifically, we model this uncertainty through the variance of\npredictions and incorporate it into the optimization objective, allowing the\nmodel to adaptively adjust its confidence threshold based on prediction\nvariance. This integration helps in mitigating the adverse effects of incorrect\nor ambiguous predictions that are common in traditional methods without any\nhand-designed components, serving as an automatic confidence threshold. Our\nmethod is flexible to existing HOI detection methods and demonstrates improved\naccuracy. We evaluate \\textsc{UAHOI} on two standard benchmarks in the field:\nV-COCO and HICO-DET, which represent challenging scenarios for HOI detection.\nThrough extensive experiments, we demonstrate that \\textsc{UAHOI} achieves\nsignificant improvements over existing state-of-the-art methods, enhancing both\nthe accuracy and robustness of HOI detection.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}