{"id":"2408.16972","title":"Exploring Nonlinear System with Machine Learning: Chua and Lorenz\n  Circuits Analyzed","authors":"Zhe Wang, Haixia Fan, Jiyuan Zhang, Xiao-Yun Wang","authorsParsed":[["Wang","Zhe",""],["Fan","Haixia",""],["Zhang","Jiyuan",""],["Wang","Xiao-Yun",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 02:17:15 GMT"},{"version":"v2","created":"Fri, 6 Sep 2024 05:48:12 GMT"}],"updateDate":"2024-09-09","timestamp":1724984235000,"abstract":"  Nonlinear circuits serve as crucial carriers and physical models for\ninvestigating nonlinear dynamics and chaotic behavior, particularly in the\nsimulation of biological neurons. In this study, Chua's circuit and Lorenz\ncircuit are systematically explored for the first time through machine learning\ncorrelation algorithms. Specifically, the upgraded and optimized SINDy-PI\nmodel, which is based on neural network and symbolic regression algorithm, is\nutilized to learn the numerical results of attractors generated by these two\nnonlinear circuits. Through error analysis, we examine the effects of the\nprecision of input data and the amount of data on the algorithmic model. The\nfindings reveal that when the input data quantity and data precision fall\nwithin a certain range, the algorithm model can effectively recognize and\nrestore the differential equation expressions corresponding to the two\ncircuits. Additionally, we test the anti-interference ability of different\ncircuits and the robustness of the algorithm by introducing noise into the test\ndata. The results indicate that under the same noise disturbance, the Lorenz\ncircuit has better noise resistance than Chua's circuit, providing a starting\npoint for further studying the intrinsic properties and characteristics of\ndifferent nonlinear circuits. The above results will not only offer a reference\nfor the further study of nonlinear circuits and related systems using deep\nlearning algorithms but also lay a preliminary theoretical foundation for the\nstudy of related physical problems and applications.\n","subjects":["Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pXsWCF0u73yrUqlLiAa3PNE1IuLAUy0PZ422V39joqI","pdfSize":"468890"}
