{"id":"2408.01145","title":"TransRx-6G-V2X : Transformer Encoder-Based Deep Neural Receiver For Next\n  Generation of Cellular Vehicular Communications","authors":"Osama Saleem, Soheyb Ribouh, Mohammed Alfaqawi, Abdelaziz Bensrhair,\n  Pierre Merdrignac","authorsParsed":[["Saleem","Osama",""],["Ribouh","Soheyb",""],["Alfaqawi","Mohammed",""],["Bensrhair","Abdelaziz",""],["Merdrignac","Pierre",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 09:47:51 GMT"}],"updateDate":"2024-08-05","timestamp":1722592071000,"abstract":"  End-to-end wireless communication is new concept expected to be widely used\nin the physical layer of future wireless communication systems (6G). It\ninvolves the substitution of transmitter and receiver block components with a\ndeep neural network (DNN), aiming to enhance the efficiency of data\ntransmission. This will ensure the transition of autonomous vehicles (AVs) from\nself-autonomy to full collaborative autonomy, that requires vehicular\nconnectivity with high data throughput and minimal latency. In this article, we\npropose a novel neural network receiver based on transformer architecture,\nnamed TransRx, designed for vehicle-to-network (V2N) communications. The\nTransRx system replaces conventional receiver block components in traditional\ncommunication setups. We evaluated our proposed system across various scenarios\nusing different parameter sets and velocities ranging from 0 to 120 km/h over\nUrban Macro-cell (UMa) channels as defined by 3GPP. The results demonstrate\nthat TransRx outperforms the state-of-the-art systems, achieving a 3.5dB\nimprovement in convergence to low Bit Error Rate (BER) compared to\nconvolutional neural network (CNN)-based neural receivers, and an 8dB\nimprovement compared to traditional baseline receiver configurations.\nFurthermore, our proposed system exhibits robust generalization capabilities,\nmaking it suitable for deployment in large-scale environments.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}