{"id":"2408.04387","title":"Bright Star Subtraction Pipeline for LSST: Phase one report","authors":"Amir E. Bazkiaei, Lee S. Kelvin, Sarah Brough, Simon J. O'Toole, Aaron\n  Watkins, Morgan A. Schmitz","authorsParsed":[["Bazkiaei","Amir E.",""],["Kelvin","Lee S.",""],["Brough","Sarah",""],["O'Toole","Simon J.",""],["Watkins","Aaron",""],["Schmitz","Morgan A.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 11:44:47 GMT"}],"updateDate":"2024-08-09","timestamp":1723117487000,"abstract":"  We present the phase one report of the Bright Star Subtraction (BSS) pipeline\nfor the Vera C. Rubin Observatory's Legacy Survey of Space and Time (LSST).\nThis pipeline is designed to create an extended PSF model by utilizing observed\nstars, followed by subtracting this model from the bright stars present in LSST\ndata. Running the pipeline on Hyper Suprime-Cam (HSC) data shows a correlation\nbetween the shape of the extended PSF model and the position of the detector\nwithin the camera's focal plane. Specifically, detectors positioned closer to\nthe focal plane's edge exhibit reduced circular symmetry in the extended PSF\nmodel. To mitigate this effect, we present an algorithm that enables users to\naccount for the location dependency of the model. Our analysis also indicates\nthat the choice of normalization annulus is crucial for modeling the extended\nPSF. Smaller annuli can exclude stars due to overlap with saturated regions,\nwhile larger annuli may compromise data quality because of lower\nsignal-to-noise ratios. This makes finding the optimal annulus size a\nchallenging but essential task for the BSS pipeline. Applying the BSS pipeline\nto HSC exposures allows for the subtraction of, on average, 100 to 700 stars\nbrighter than 12th magnitude measured in g-band across a full exposure, with a\nfull HSC exposure comprising ~100 detectors.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}