{"id":"2408.08108","title":"Unsupervised Part Discovery via Dual Representation Alignment","authors":"Jiahao Xia, Wenjian Huang, Min Xu, Jianguo Zhang, Haimin Zhang, Ziyu\n  Sheng and Dong Xu","authorsParsed":[["Xia","Jiahao",""],["Huang","Wenjian",""],["Xu","Min",""],["Zhang","Jianguo",""],["Zhang","Haimin",""],["Sheng","Ziyu",""],["Xu","Dong",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 12:11:20 GMT"}],"updateDate":"2024-08-16","timestamp":1723723880000,"abstract":"  Object parts serve as crucial intermediate representations in various\ndownstream tasks, but part-level representation learning still has not received\nas much attention as other vision tasks. Previous research has established that\nVision Transformer can learn instance-level attention without labels,\nextracting high-quality instance-level representations for boosting downstream\ntasks. In this paper, we achieve unsupervised part-specific attention learning\nusing a novel paradigm and further employ the part representations to improve\npart discovery performance. Specifically, paired images are generated from the\nsame image with different geometric transformations, and multiple part\nrepresentations are extracted from these paired images using a novel module,\nnamed PartFormer. These part representations from the paired images are then\nexchanged to improve geometric transformation invariance. Subsequently, the\npart representations are aligned with the feature map extracted by a feature\nmap encoder, achieving high similarity with the pixel representations of the\ncorresponding part regions and low similarity in irrelevant regions. Finally,\nthe geometric and semantic constraints are applied to the part representations\nthrough the intermediate results in alignment for part-specific attention\nlearning, encouraging the PartFormer to focus locally and the part\nrepresentations to explicitly include the information of the corresponding\nparts. Moreover, the aligned part representations can further serve as a series\nof reliable detectors in the testing phase, predicting pixel masks for part\ndiscovery. Extensive experiments are carried out on four widely used datasets,\nand our results demonstrate that the proposed method achieves competitive\nperformance and robustness due to its part-specific attention.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}