{"id":"2408.09114","title":"Automatic Mitigation of Dynamic Atmospheric Turbulence Using Optical\n  Phase Conjugation for Coherent Free-Space Optical Communications","authors":"Huibin Zhou, Xinzhou Su, Yuxiang Duan, Yue Zuo, Zile Jiang,\n  Muralekrishnan Ramakrishnan, Jan Tepper, Volker Ziegler, Robert W. Boyd,\n  Moshe Tur, Alan E. Willner","authorsParsed":[["Zhou","Huibin",""],["Su","Xinzhou",""],["Duan","Yuxiang",""],["Zuo","Yue",""],["Jiang","Zile",""],["Ramakrishnan","Muralekrishnan",""],["Tepper","Jan",""],["Ziegler","Volker",""],["Boyd","Robert W.",""],["Tur","Moshe",""],["Willner","Alan E.",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 06:36:23 GMT"}],"updateDate":"2024-08-20","timestamp":1723876583000,"abstract":"  Coherent detection can provide enhanced receiver sensitivity and spectral\nefficiency in free-space optical (FSO) communications. However, turbulence can\ncause modal power coupling effects on a Gaussian data beam and significantly\ndegrade the mixing efficiency between the data beam and a Gaussian local\noscillator (LO) in the coherent detector. Optical phase conjugation (OPC) in a\nphotorefractive crystal can \"automatically\" mitigate turbulence by: (a)\nrecording a back-propagated turbulence-distorted probe beam, and (b) creating a\nphase-conjugate beam that has the inverse phase distortion of the medium as the\ntransmitted data beam. However, previously reported crystal-based OPC\napproaches for FSO links have demonstrated either: (i) a relatively fast\nresponse time of 35 ms but at a relatively low data rate (e.g., <1 Mbit/s), or\n(ii) a relatively high data rate of 2-Gbit/s but at a slow response time (e.g.,\n>60 s). Here, we report an OPC approach for the automatic mitigation of dynamic\nturbulence that enables both a high data rate (8 Gbit/s) data beam and a rapid\n(<5 ms) response time. For a similar data rate, this represents a 10,000-fold\nfaster response time than previous reports, thereby enabling mitigation for\ndynamic effects. In our approach, the transmitted pre-distorted phase-conjugate\ndata beam is generated by four-wave mixing in a GaAs crystal of three input\nbeams: a turbulence-distorted probe beam, a Gaussian reference beam regenerated\nfrom the probe beam, and a Gaussian data beam carrying a high-speed data\nchannel. We experimentally demonstrate our approach in an 8-Gbit/s\nquadrature-phase-shift-keying coherent FSO link through emulated dynamic\nturbulence. Our results show ~10-dB improvement in the mixing efficiency of the\nLO with the data beam under dynamic turbulence with a bandwidth of up to ~260\nHz (Greenwood frequency).\n","subjects":["Physics/Optics","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}