{"id":"2408.15502","title":"ROMI: A Randomized Two-Stage Basket Trial Design to Optimize Doses for\n  Multiple Indications","authors":"Shuqi Wang, Peter F. Thall, Kentaro Takeda, and Ying Yuan","authorsParsed":[["Wang","Shuqi",""],["Thall","Peter F.",""],["Takeda","Kentaro",""],["Yuan","Ying",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 03:15:47 GMT"}],"updateDate":"2024-08-29","timestamp":1724814947000,"abstract":"  Optimizing doses for multiple indications is challenging. The pooled approach\nof finding a single optimal biological dose (OBD) for all indications ignores\nthat dose-response or dose-toxicity curves may differ between indications,\nresulting in varying OBDs. Conversely, indication-specific dose optimization\noften requires a large sample size. To address this challenge, we propose a\nRandomized two-stage basket trial design that Optimizes doses in Multiple\nIndications (ROMI). In stage 1, for each indication, response and toxicity are\nevaluated for a high dose, which may be a previously obtained MTD, with a rule\nthat stops accrual to indications where the high dose is unsafe or ineffective.\nIndications not terminated proceed to stage 2, where patients are randomized\nbetween the high dose and a specified lower dose. A latent-cluster Bayesian\nhierarchical model is employed to borrow information between indications, while\nconsidering the potential heterogeneity of OBD across indications.\nIndication-specific utilities are used to quantify response-toxicity\ntrade-offs. At the end of stage 2, for each indication with at least one\nacceptable dose, the dose with highest posterior mean utility is selected as\noptimal. Two versions of ROMI are presented, one using only stage 2 data for\ndose optimization and the other optimizing doses using data from both stages.\nSimulations show that both versions have desirable operating characteristics\ncompared to designs that either ignore indications or optimize dose\nindependently for each indication.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}