{"id":"2408.09372","title":"All-Electron Molecular Tunnel Ionization Based on the Weak-Field\n  Asymptotic Theory in the Integral Representation","authors":"Imam S. Wahyutama, Denawakage D. Jayasinghe, Francois Mauger, Kenneth\n  Lopata, Kenneth J. Schafer","authorsParsed":[["Wahyutama","Imam S.",""],["Jayasinghe","Denawakage D.",""],["Mauger","Francois",""],["Lopata","Kenneth",""],["Schafer","Kenneth J.",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 06:12:44 GMT"}],"updateDate":"2024-08-20","timestamp":1723961564000,"abstract":"  Tunnel ionization (TI) underlies many important ultrafast processes, such as\nhigh-harmonic generation and strong-field ionization. Among the existing\ntheories for TI, many-electron weak-field asymptotic theory (ME-WFAT) is by\ndesign capable of accurately treating many-electron effects in TI. An earlier\nversion of ME-WFAT relied on an accurate representation of the asymptotic tail\nof the orbitals, which hindered its implementation in Gaussian-basis-set-based\nquantum chemistry programs. In this work, we reformulate ME-WFAT in the\nintegral representation, which makes the quality of the asymptotic tail much\nless critical, hence greatly facilitating its implementation in standard\nquantum chemistry packages. The integral reformulation introduced here is\ntherefore much more robust when applied to molecules with arbitrary geometry.\nWe present several case studies, among which is the CO molecule where some\nearlier theories disagree with experiments. Here, we find that ME-WFAT produces\nthe largest ionization probability when the field points from C to O, as\nexperiments suggest. An attractive feature of ME-WFAT is that it can be used\nwith various types of multi-electron methods whether of density functional\n[Phys. Rev. A 106, 052211 (2022)] or multiconfiguration types, which\nfacilitates tunnel ionization calculation in systems exhibiting a strong\nmultireference character, such as transition-metal-containing molecules.\n","subjects":["Physics/Chemical Physics","Physics/Atomic and Molecular Clusters","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}