{"id":"2408.13202","title":"Instruct-DeBERTa: A Hybrid Approach for Aspect-based Sentiment Analysis\n  on Textual Reviews","authors":"Dineth Jayakody, A V A Malkith, Koshila Isuranda, Vishal Thenuwara,\n  Nisansa de Silva, Sachintha Rajith Ponnamperuma, G G N Sandamali, K L K\n  Sudheera","authorsParsed":[["Jayakody","Dineth",""],["Malkith","A V A",""],["Isuranda","Koshila",""],["Thenuwara","Vishal",""],["de Silva","Nisansa",""],["Ponnamperuma","Sachintha Rajith",""],["Sandamali","G G N",""],["Sudheera","K L K",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 16:31:07 GMT"}],"updateDate":"2024-08-26","timestamp":1724430667000,"abstract":"  Aspect-based Sentiment Analysis (ABSA) is a critical task in Natural Language\nProcessing (NLP) that focuses on extracting sentiments related to specific\naspects within a text, offering deep insights into customer opinions.\nTraditional sentiment analysis methods, while useful for determining overall\nsentiment, often miss the implicit opinions about particular product or service\nfeatures. This paper presents a comprehensive review of the evolution of ABSA\nmethodologies, from lexicon-based approaches to machine learning and deep\nlearning techniques. We emphasize the recent advancements in Transformer-based\nmodels, particularly Bidirectional Encoder Representations from Transformers\n(BERT) and its variants, which have set new benchmarks in ABSA tasks. We\nfocused on finetuning Llama and Mistral models, building hybrid models using\nthe SetFit framework, and developing our own model by exploiting the strengths\nof state-of-the-art (SOTA) Transformer-based models for aspect term extraction\n(ATE) and aspect sentiment classification (ASC). Our hybrid model Instruct -\nDeBERTa uses SOTA InstructABSA for aspect extraction and DeBERTa-V3-baseabsa-V1\nfor aspect sentiment classification. We utilize datasets from different domains\nto evaluate our model's performance. Our experiments indicate that the proposed\nhybrid model significantly improves the accuracy and reliability of sentiment\nanalysis across all experimented domains. As per our findings, our hybrid model\nInstruct - DeBERTa is the best-performing model for the joint task of ATE and\nASC for both SemEval restaurant 2014 and SemEval laptop 2014 datasets\nseparately. By addressing the limitations of existing methodologies, our\napproach provides a robust solution for understanding detailed consumer\nfeedback, thus offering valuable insights for businesses aiming to enhance\ncustomer satisfaction and product development.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}