{"id":"2408.00084","title":"Approximating Rayleigh Scattering in Exoplanetary Atmospheres using\n  Physics-informed Neural Networks (PINNs)","authors":"David Dahlb\\\"udding, Karan Molaverdikhani, Barbara Ercolano and\n  Tommaso Grassi","authorsParsed":[["Dahlbüdding","David",""],["Molaverdikhani","Karan",""],["Ercolano","Barbara",""],["Grassi","Tommaso",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:00:55 GMT"}],"updateDate":"2024-08-02","timestamp":1722448855000,"abstract":"  This research introduces an innovative application of physics-informed neural\nnetworks (PINNs) to tackle the intricate challenges of radiative transfer (RT)\nmodeling in exoplanetary atmospheres, with a special focus on efficiently\nhandling scattering phenomena. Traditional RT models often simplify scattering\nas absorption, leading to inaccuracies. Our approach utilizes PINNs, noted for\ntheir ability to incorporate the governing differential equations of RT\ndirectly into their loss function, thus offering a more precise yet potentially\nfast modeling technique. The core of our method involves the development of a\nparameterized PINN tailored for a modified RT equation, enhancing its\nadaptability to various atmospheric scenarios. We focus on RT in transiting\nexoplanet atmospheres using a simplified 1D isothermal model with\npressure-dependent coefficients for absorption and Rayleigh scattering. In\nscenarios of pure absorption, the PINN demonstrates its effectiveness in\npredicting transmission spectra for diverse absorption profiles. For Rayleigh\nscattering, the network successfully computes the RT equation, addressing both\ndirect and diffuse stellar light components. While our preliminary results with\nsimplified models are promising, indicating the potential of PINNs in improving\nRT calculations, we acknowledge the errors stemming from our approximations as\nwell as the challenges in applying this technique to more complex atmospheric\nconditions. Specifically, extending our approach to atmospheres with intricate\ntemperature-pressure profiles and varying scattering properties, such as those\nintroduced by clouds and hazes, remains a significant area for future\ndevelopment.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics","Computing Research Repository/Machine Learning","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}