{"id":"2408.08255","title":"Effect of hydrogen on the local chemical bonding states and structure of\n  amorphous alumina by atomistic and electrostatic modeling of Auger parameter\n  shifts","authors":"Simon Gramatte, Olivier Politano, Claudia Cancellieri, Ivo Utke, Lars\n  P.H. Jeurgens, and Vladyslav Turlo","authorsParsed":[["Gramatte","Simon",""],["Politano","Olivier",""],["Cancellieri","Claudia",""],["Utke","Ivo",""],["Jeurgens","Lars P. H.",""],["Turlo","Vladyslav",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 16:52:54 GMT"}],"updateDate":"2024-08-16","timestamp":1723740774000,"abstract":"  This study discloses the effect of hydrogen impurities on the local chemical\nbonding states and structure of amorphous alumina films by predicting measured\nAuger parameter shifts using a combination of atomistic and electrostatic\nmodeling. Different amorphous alumina polymorphs with variable H-content and\ndensity, as grown by atomic layer deposition, were successfully modeled using a\nuniversal machine learning interatomic potential. The annealing of highly\ndefective crystalline hydroxide structures with experimental H-contents at the\ncorresponding atomic layer deposition temperatures led to excellent agreement\nbetween theory and experiment in the density and structure of the resulting\namorphous alumina polymorphs. The measured Auger parameter shifts of Al cations\nin such polymorphs were accurately predicted with respect to the H content by\nassuming that all H atoms are present in the form of hydroxyl ligands in the\nrandomly interconnected 4-fold, 5-fold, and 6-fold nearest-coordination spheres\nof Al. As revealed by a combination of atomistic and electrostatic modeling,\nthe measured Auger shifts with an increase in the H content and an accompanying\ndecrease in the oxide density depend on the complex correlations between local\ncoordination, bond lengths, bond angles, and ligand type(s) around the\ncore-ionized atoms. Moreover, cryogenic X-ray photoelectron spectroscopy is\nsuggested to offer new insights into the local chemical and structural building\nblocks of crystalline and amorphous oxides by reducing thermal noise. These\nfindings and fundamental knowledge contribute to advancing the design of e.g.\nhydrogen oxide barrier films, oxide membranes for H separation, H storage\nmaterials, and fuel cells for a hydrogen-based economy.\n","subjects":["Condensed Matter/Materials Science","Physics/Chemical Physics","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}