{"id":"2408.13473","title":"Why Antiwork: A RoBERTa-Based System for Work-Related Stress\n  Identification and Leading Factor Analysis","authors":"Tao Lu, Muzhe Wu, Xinyi Lu, Siyuan Xu, Shuyu Zhan, Anuj Tambwekar,\n  Emily Mower Provost","authorsParsed":[["Lu","Tao",""],["Wu","Muzhe",""],["Lu","Xinyi",""],["Xu","Siyuan",""],["Zhan","Shuyu",""],["Tambwekar","Anuj",""],["Provost","Emily Mower",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 05:15:15 GMT"}],"updateDate":"2024-08-27","timestamp":1724476515000,"abstract":"  Harsh working environments and work-related stress have been known to\ncontribute to mental health problems such as anxiety, depression, and suicidal\nideation. As such, it is paramount to create solutions that can both detect\nemployee unhappiness and find the root cause of the problem. While prior works\nhave examined causes of mental health using machine learning, they typically\nfocus on general mental health analysis, with few of them focusing on\nexplainable solutions or looking at the workplace-specific setting. r/antiwork\nis a subreddit for the antiwork movement, which is the desire to stop working\naltogether. Using this subreddit as a proxy for work environment\ndissatisfaction, we create a new dataset for antiwork sentiment detection and\nsubsequently train a model that highlights the words with antiwork sentiments.\nFollowing this, we performed a qualitative and quantitative analysis to uncover\nsome of the key insights into the mindset of individuals who identify with the\nantiwork movement and how their working environments influenced them. We find\nthat working environments that do not give employees authority or\nresponsibility, frustrating recruiting experiences, and unfair compensation,\nare some of the leading causes of the antiwork sentiment, resulting in a lack\nof self-confidence and motivation among their employees.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}