{"id":"2408.02921","title":"Interoperability and Explicable AI-based Zero-Day Attacks Detection\n  Process in Smart Community","authors":"Mohammad Sayduzzaman and Jarin Tasnim Tamanna and Dipanjali Kundu and\n  Tawhidur Rahman","authorsParsed":[["Sayduzzaman","Mohammad",""],["Tamanna","Jarin Tasnim",""],["Kundu","Dipanjali",""],["Rahman","Tawhidur",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 03:11:36 GMT"}],"updateDate":"2024-08-07","timestamp":1722913896000,"abstract":"  Systems, technologies, protocols, and infrastructures all face\ninteroperability challenges. It is among the most crucial parameters to give\nreal-world effectiveness. Organizations that achieve interoperability will be\nable to identify, prevent, and provide appropriate protection on an\ninternational scale, which can be relied upon. This paper aims to explain how\nfuture technologies such as 6G mobile communication, Internet of Everything\n(IoE), Artificial Intelligence (AI), and Smart Contract embedded WPA3\nprotocol-based WiFi-8 can work together to prevent known attack vectors and\nprovide protection against zero-day attacks, thus offering intelligent\nsolutions for smart cities. The phrase zero-day refers to an attack that occurs\non the day zero of the vulnerability's disclosure to the public or vendor.\nExisting systems require an extra layer of security. In the security world,\ninteroperability enables disparate security solutions and systems to\ncollaborate seamlessly. AI improves cybersecurity by enabling improved\ncapabilities for detecting, responding, and preventing zero-day attacks. When\ninteroperability and Explainable Artificial Intelligence (XAI) are integrated\ninto cybersecurity, they form a strong protection against zero-day assaults.\nAdditionally, we evaluate a couple of parameters based on the accuracy and time\nrequired for efficiently analyzing attack patterns and anomalies.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}