{"id":"2408.15815","title":"MR-Adopt: Automatic Deduction of Input Transformation Function for\n  Metamorphic Testing","authors":"Congying Xu, Songqiang Chen, Jiarong Wu, Shing-Chi Cheung, Valerio\n  Terragni, Hengcheng Zhu, Jialun Cao","authorsParsed":[["Xu","Congying",""],["Chen","Songqiang",""],["Wu","Jiarong",""],["Cheung","Shing-Chi",""],["Terragni","Valerio",""],["Zhu","Hengcheng",""],["Cao","Jialun",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 14:24:48 GMT"}],"updateDate":"2024-08-29","timestamp":1724855088000,"abstract":"  While a recent study reveals that many developer-written test cases can\nencode a reusable Metamorphic Relation (MR), over 70% of them directly\nhard-code the source input and follow-up input in the encoded relation. Such\nencoded MRs, which do not contain an explicit input transformation to transform\nthe source inputs to corresponding follow-up inputs, cannot be reused with new\nsource inputs to enhance test adequacy.\n  In this paper, we propose MR-Adopt (Automatic Deduction Of inPut\nTransformation) to automatically deduce the input transformation from the\nhard-coded source and follow-up inputs, aiming to enable the encoded MRs to be\nreused with new source inputs. With typically only one pair of source and\nfollow-up inputs available in an MR-encoded test case as the example, we\nleveraged LLMs to understand the intention of the test case and generate\nadditional examples of source-followup input pairs. This helps to guide the\ngeneration of input transformations generalizable to multiple source inputs.\nBesides, to mitigate the issue that LLMs generate erroneous code, we refine\nLLM-generated transformations by removing MR- irrelevant code elements with\ndata-flow analysis. Finally, we assess candidate transformations based on\nencoded output relations and select the best transformation as the result.\nEvaluation results show that MR-Adopt can generate input transformations\napplicable to all experimental source inputs for 72.00% of encoded MRs, which\nis 33.33% more than using vanilla GPT-3.5. By incorporating MR- Adopt-generated\ninput transformations, encoded MR-based test cases can effectively enhance the\ntest adequacy, increasing the line coverage and mutation score by 10.62% and\n18.91%, respectively.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/"}