{"id":"2408.02726","title":"JADES Ultra-red Flattened Objects: Morphologies and Spatial Gradients in\n  Color and Stellar Populations","authors":"Justus L. Gibson, Erica Nelson, Christina C. Williams, Sedona H.\n  Price, Katherine E. Whitaker, Katherine A. Suess, Anna de Graaff, Benjamin D.\n  Johnson, Andrew J. Bunker, William M. Baker, Rachana Bhatawdekar, Kristan\n  Boyett, Stephane Charlot, Emma Curtis-Lake, Daniel J. Eisenstein, Kevin\n  Hainline, Ryan Hausen, Roberto Maiolino, George Rieke, Marcia Rieke, Brant\n  Robertson, Sandro Tacchella, and Chris Willott","authorsParsed":[["Gibson","Justus L.",""],["Nelson","Erica",""],["Williams","Christina C.",""],["Price","Sedona H.",""],["Whitaker","Katherine E.",""],["Suess","Katherine A.",""],["de Graaff","Anna",""],["Johnson","Benjamin D.",""],["Bunker","Andrew J.",""],["Baker","William M.",""],["Bhatawdekar","Rachana",""],["Boyett","Kristan",""],["Charlot","Stephane",""],["Curtis-Lake","Emma",""],["Eisenstein","Daniel J.",""],["Hainline","Kevin",""],["Hausen","Ryan",""],["Maiolino","Roberto",""],["Rieke","George",""],["Rieke","Marcia",""],["Robertson","Brant",""],["Tacchella","Sandro",""],["Willott","Chris",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-07","timestamp":1722880801000,"abstract":"  One of the more surprising findings after the first year of JWST observations\nis the large number of spatially extended galaxies (ultra-red flattened\nobjects, or UFOs) among the optically-faint galaxy population otherwise thought\nto be compact. Leveraging the depth and survey area of the JADES survey, we\nextend observations of the optically-faint galaxy population to an additional\n112 objects, 56 of which are well-resolved in F444W with effective sizes, $R_e\n> 0.25''$, more than tripling previous UFO counts. These galaxies have\nredshifts around $2 < z < 4$, high stellar masses ($\\mathrm{log(M_*/M_{\\odot})}\n\\sim 10-11$), and star-formation rates around $\\sim 100-1000\n\\mathrm{M_{\\odot}/yr}$. Surprisingly, UFOs are red across their entire extents\nwhich spatially resolved analysis of their stellar populations shows is due to\nlarge values of dust attenuation (typically $A_V > 2$ mag even at large radii).\nMorphologically, the majority of our UFO sample tends to have low S\\'ersic\nindices ($n \\sim 1$) suggesting these large, massive, optically faint galaxies\nhave little contribution from a bulge in F444W. Further, a majority have\naxis-ratios between $0.2 < q < 0.4$, which Bayesian modeling suggests that\ntheir intrinsic shapes are consistent with being a mixture of inclined disks\nand prolate objects with little to no contribution from spheroids. While\nkinematic constraints will be needed to determine the true intrinsic shapes of\nUFOs, it is clear that an unexpected population of large, disky or prolate\nobjects contributes significantly to the population of optically faint\ngalaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}