{"id":"2408.07442","title":"Superflare of a Sun-like star observed with XMM-Newton and SRG/eROSITA","authors":"Andrey Mukhin, Roman Krivonos, Ilfan Bikmaev, Mark Gorbachev, Irek\n  Khamitov, Sergey Sazonov, Marat Gilfanov and Rashid Sunyaev","authorsParsed":[["Mukhin","Andrey",""],["Krivonos","Roman",""],["Bikmaev","Ilfan",""],["Gorbachev","Mark",""],["Khamitov","Irek",""],["Sazonov","Sergey",""],["Gilfanov","Marat",""],["Sunyaev","Rashid",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 10:24:31 GMT"}],"updateDate":"2024-08-15","timestamp":1723631071000,"abstract":"  In this work, we studied X-ray source SRGe J021932.4$-$040154 (SRGe J02193),\nwhich we associated with a single X-ray active star of spectral class G2V$-$G4V\nand the rotational period $\\rm P_{rot} < 9.3$ days. Additional analysis of TESS\nlight-curves allowed for the rotational period estimation of $3.2 \\pm 0.5$\ndays. SRGe J02193 was observed with the SRG/eROSITA during eUDS survey in 2019\nin a much dimmer state compared to the XMM-Newton catalogue 4XMM-DR12. Detailed\nanalysis revealed that the archival XMM-Newton observations captured the source\nduring a flaring event in 2017. The XMM-Newton light curve demonstrates a\nstrong flare described with the Gaussian rise and exponential decay, typical\nfor stellar flares, characterized by timescales of ${\\sim}400$ s and\n${\\sim}1300$ s, respectively. The spectral analysis of the quiescent state\nreveals ${\\sim}10$ MK plasma at luminosity of $(1.4\\pm0.4) \\times 10^{29}\n\\rm~erg~s^{-1}$ (0.3$-$4.5 keV). The spectrum of the flare is characterized by\ntemperature of ${\\sim}40$ MK and luminosity $(5.5\\pm0.6)\\times 10^{30}\n\\rm~erg~s^{-1}$. The total energy emitted during the flare ${\\sim}1.7 \\times\n10^{34}$ erg exceeds the canonical threshold of $10^{33}$ erg, allowing us to\nclassify the observed event as a superflare on a Sun-like star. Additionally,\nwe present the upper limit on the surface starspot area based on the brightness\nvariations and consider the hypothesis of the object being a binary system with\nG-type and M-type stars, suggested by two independent estimations of radial\nvelocity variations from APOGEE-2 and Gaia.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}