{"id":"2408.12971","title":"M giants with IGRINS IV. Identification and characterization of a\n  near-IR line of the s-element Barium","authors":"G. Nandakumar, N. Ryde, H. Hartman, and G. Mace","authorsParsed":[["Nandakumar","G.",""],["Ryde","N.",""],["Hartman","H.",""],["Mace","G.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 10:39:22 GMT"}],"updateDate":"2024-08-26","timestamp":1724409562000,"abstract":"  Neutron-capture elements represent an important nucleosynthetic channel in\nthe study of the Galactic Chemical Evolution of stellar populations. For\nstellar populations behind significant extinction, such as those in the\nGalactic Center and along the Galactic plane, abundance analyses based on\nnear-IR spectra are necessary. Previously, spectral lines from the\nneutron-capture elements such as copper (Cu), cerium (Ce), neodymium (Nd), and\nytterbium (Yb) have been identified in the H band, while yttrium (Y) lines have\nbeen identified in the K band. Due to the scarcity of spectral lines from\nneutron-capture elements in the near-IR, the addition of useful spectral lines\nfrom other neutron-capture elements is highly desirable. The aim of this work\nis to identify and characterise a spectral line suitable for abundance\ndetermination from the most commonly used s-process element, namely barium. We\nobserved near-IR spectra of 37 M giants in the solar neighbourhood at high S/N\nand high spectral resolution using the IGRINS spectrometer on the GEMINI South\ntelescope. Using a manual spectral synthesis method, we determined the stellar\nparameters for these stars and derived the barium abundance from the Ba line\n(6s5d $^3$D$_2 \\rightarrow$ 6s6p $^3$P$^o_2$) at\n$\\lambda_\\mathrm{air}=23\\,253.56\\,$\\AA\\ in the K band. We demonstrate that the\nBa line in the K band at 2.33\\,\\mic\\ ($\\lambda$23253.56) is useful for\nabundance analysis from spectra of M giants. The line becomes progressively\nweaker at higher temperatures and is only useful in M giants and the coolest K\ngiants at supersolar metallicities. We can now add Ba to the trends of the\nheavy elements Cu, Zn, Y, Ce, Nd, and Yb, which can be retrieved from\nhigh-resolution H- and K-band spectra. This opens up the study of\nnucleosynthetic channels, including the s-process and the r-process, in\ndust-obscured populations such as the Galactic Center.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"fxf3lbfJ4nd3xTaCJ11a9WjFT5zRNP7yYanAXVpSKY0","pdfSize":"3026974"}
