{"id":"2408.05857","title":"Comparative Evaluation of Memory Technologies for Synaptic Crossbar\n  Arrays- Part 2: Design Knobs and DNN Accuracy Trends","authors":"Jeffry Victor, Chunguang Wang and Sumeet K. Gupta","authorsParsed":[["Victor","Jeffry",""],["Wang","Chunguang",""],["Gupta","Sumeet K.",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 20:02:51 GMT"}],"updateDate":"2024-08-13","timestamp":1723406571000,"abstract":"  Crossbar memory arrays have been touted as the workhorse of in-memory\ncomputing (IMC)-based acceleration of Deep Neural Networks (DNNs), but the\nassociated hardware non-idealities limit their efficacy. To address this,\ncross-layer design solutions that reduce the impact of hardware non-idealities\non DNN accuracy are needed. In Part 1 of this paper, we established the\nco-optimization strategies for various memory technologies and their crossbar\narrays, and conducted a comparative technology evaluation in the context of IMC\nrobustness. In this part, we analyze various design knobs such as array size\nand bit-slice (number of bits per device) and their impact on the performance\nof 8T SRAM, ferroelectric transistor (FeFET), Resistive RAM (ReRAM) and\nspin-orbit-torque magnetic RAM (SOT-MRAM) in the context of inference accuracy\nat 7nm technology node. Further, we study the effect of circuit design\nsolutions such as Partial Wordline Activation (PWA) and custom ADC reference\nlevels that reduce the hardware non-idealities and comparatively analyze the\nresponse of each technology to such accuracy enhancing techniques. Our results\non ResNet-20 (with CIFAR-10) show that PWA increases accuracy by up to 32.56%\nwhile custom ADC reference levels yield up to 31.62% accuracy enhancement. We\nobserve that compared to the other technologies, FeFET, by virtue of its small\nlayout height and high distinguishability of its memory states, is best suited\nfor large arrays. For higher bit-slices and a more complex dataset (ResNet-50\nwith Cifar-100) we found that ReRAM matches the performance of FeFET.\n","subjects":["Computing Research Repository/Emerging Technologies","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}