{"id":"2408.14761","title":"Suppression of Collisionless Magnetic Reconnection in the High Ion\n  $\\beta$, Strong Guide Field Limit","authors":"Carlos A. Giai, Colby C. Haggerty, Michael A. Shay, Paul A. Cassak","authorsParsed":[["Giai","Carlos A.",""],["Haggerty","Colby C.",""],["Shay","Michael A.",""],["Cassak","Paul A.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 03:27:01 GMT"}],"updateDate":"2024-08-28","timestamp":1724729221000,"abstract":"  In magnetic reconnection, the ion bulk outflow speed and ion heating have\nbeen shown to be set by the available reconnecting magnetic energy, i.e., the\nenergy stored in the reconnecting magnetic field ($B_r$). However, recent\nsimulations, observations, and theoretical works have shown that the released\nmagnetic energy is inhibited by upstream ion plasma beta $\\beta_{i}$ -- the\nrelative ion thermal pressure normalized to magnetic pressure based on the\nreconnecting field -- for antiparallel magnetic field configurations. Using\nkinetic theory and hybrid particle-in-cell simulations, we investigate the\neffects of $\\beta_{i}$ on guide field reconnection. While previous works have\nsuggested that guide field reconnection is uninfluenced by $\\beta_{i}$, we\ndemonstrate that the reconnection process is modified and the outflow is\nreduced for sufficiently large $\\beta_{i} > B_g^2/(B_r^2 + B_g^2)$. We develop\na theoretical framework that shows that this reduction is consistent with an\nenhanced exhaust pressure gradient, which reduces the outflow speed as $v_0\n\\propto 1/\\sqrt{\\beta_{i}}$. These results apply to systems in which guide\nfield reconnection is embedded in hot plasmas, such as reconnection at the\nboundary of eddies in fully developed turbulence like the solar wind or the\nmagnetosheath as well as downstream of shocks such as the heliosheath or the\nmergers of galaxy clusters.\n","subjects":["Physics/Plasma Physics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HQYEzvfElrvsBEhWjLyHPVFP0wkiy2MCgHYiH4l0ZHY","pdfSize":"3208679"}
