{"id":"2408.15325","title":"Deep thermalization under charge-conserving quantum dynamics","authors":"Rui-An Chang, Harshank Shrotriya, Wen Wei Ho, Matteo Ippoliti","authorsParsed":[["Chang","Rui-An",""],["Shrotriya","Harshank",""],["Ho","Wen Wei",""],["Ippoliti","Matteo",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-29","timestamp":1724781601000,"abstract":"  ``Deep thermalization'' describes the emergence of universal wavefunction\ndistributions in quantum many-body dynamics, appearing on a local subsystem\nupon measurement of its environment. In this work, we study in detail the\neffect of continuous internal symmetries and associated conservation laws on\ndeep thermalization. Concretely, we consider quantum spin systems with a $U(1)$\nsymmetry associated with the conservation of magnetization (or `charge'), and\nanalyze how the choice of initial states (specifically, their degree of charge\nfluctuations) and the choice of measurement basis (specifically, whether or not\nit can reveal information about the local charge density) determine the ensuing\nuniversal wavefunction distributions. We find a rich set of possibilities.\nFirst we focus on the case of a random state of well-defined charge subjected\nto charge-revealing masurements, and rigorously prove that the projected\nensemble approaches a direct sum of Haar ensembles in the charge sectors of the\nsubsystem of interest. We then analytically derive the limiting wavefunction\ndistributions for more general initial states and measurement bases, finding\nresults that include the Haar ensemble, the ``Scrooge ensemble'' (a distortion\nof the Haar ensemble by a density matrix), and the ``generalized Scrooge\nensemble'' (a stochastic mixture of multiple Scrooge ensembles). These\nrepresent nontrivial higher-moment generalizations of the Gibbs state, and\nnotably can depend on the entire charge distribution of the initial state, not\njust its average. Our findings demonstrate a rich interplay between symmetries\nand the information extracted by measurements, which allows deep thermalization\nto exhibit a range of universal behaviors far beyond regular thermalization.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Statistical Mechanics","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}