{"id":"2408.12094","title":"On certain classes of mild solutions of the scalar Li\\'enard equation\n  revisited","authors":"Pham Truong Xuan, Nguyen Thi Van, Nguyen Thi Loan, Tran Minh Nguyet","authorsParsed":[["Xuan","Pham Truong",""],["Van","Nguyen Thi",""],["Loan","Nguyen Thi",""],["Nguyet","Tran Minh",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 03:04:17 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 01:53:49 GMT"}],"updateDate":"2024-09-05","timestamp":1724295857000,"abstract":"  In this work we revisit the existence, uniqueness and exponential decay of\nsome classes of mild solutions which are almost periodic (AP-), asymptotically\nalmost periodic (AAP-) and pseudo almost periodic (PAP-) of the scalar\nLin\\'eard equation by employing the notion of Green function and Massera-type\nprinciple. First, by changing variable we convert this equation to a system of\nfirst order differential equations. Then, we transform the problem into a\nframework of an abstract parabolic evolution equation which associates with an\nevolution family equipped an exponential dichtonomy and the corresponding Green\nfunction is exponentially almost periodic. After that, we prove a Massera-type\nprinciple that the corresponding linear equation has a uniqueness AP-, AAP- and\nPAP- mild solution if the right hand side and the coefficient functions are\nAP-, AAP- and PAP- functions, respectively. The well-posedness of semilinear\nequation is proved by using fixed point arguments and the exponential decay of\nmild solutions are obtained by using Gronwall's inequality. Although our work\nrevisits some previous works on well-posedness of the Lin\\'eard equation on\nthese type solutions but provide a difference view by using Green function and\ngo farther on the aspects of asymptotic behaviour of solutions and the\nconstruction of abstract theory. Our abstract results can be also applied to\nother parabolic evolution equations.\n","subjects":["Mathematics/Analysis of PDEs","Physics/Mathematical Physics","Mathematics/Functional Analysis","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}