{"id":"2408.17291","title":"Exploring the effect of positive Q-value neutron transfer in\n  coupled-channels calculations using microscopic nuclear potentials","authors":"N. Jain, M. Bhuyan, P. Mohr, and Raj Kumar","authorsParsed":[["Jain","N.",""],["Bhuyan","M.",""],["Mohr","P.",""],["Kumar","Raj",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 13:46:00 GMT"}],"updateDate":"2024-09-02","timestamp":1725025560000,"abstract":"  We investigated the effect of the degree of freedom of neutron transfer on\nthe cross section of heavy-ion fusion reactions, using the relativistic\nmean-field formalism within the coupled channel approach (CCFULL). We obtain\nthe microscopic nuclear interaction potential in terms of the density\ndistributions for the targets and projectiles with the NL3$^*$ parameter set\nand corresponding R3Y nucleon-nucleon potential. The present analysis includes\nthe $^{18}$O-induced reactions, for which experimental fusion cross-section is\navailable around the Coulomb barrier. It is evident from the results that\nincluding vibrational and/or rotational degrees of freedom enhances the fusion\ncross-section at energies below the barrier. However, fusion hindrance persists\nin this energy region. To address this, we incorporated the two-neutron $(2n)$\ntransfer channels in the Coupled Channel calculation. A comparison with the\nWoods-Saxon potential (WS) shows that the R3Y nucleon-nucleon (NN) potential,\nwith intrinsic degrees of freedom, is superior to it, especially at energies\nbelow the barrier. This superiority can be attributed to the observed higher\nbarrier heights and lower cross-section of the WS potential compared to the\nrelativistic R3Y NN potential for the considered reaction systems.\nConsequently, we employed the relativistic mean-field formalism to estimate\nfusion characteristics for the unknown $^{18}$O-induced reactions, namely\n$^{18}$O + $^{62}${Ni}, $^{18}$O + $^{70,72,76}${Ge}, $^{18}$O +\n$^{144,150}${Nd}, and $^{18}$O + $^{144,148,152,154}${Sm}. Our analysis\nhighlights the significant role of positive $Q$-value neutron transfer in\nenhancing the sub-barrier fusion cross-section for the $^{18}$O + $^{148}${Nd}\nreaction with the R3Y NN potential. However, the effect of this transfer\nchannel for the other considered reactions is comparatively less pronounced.\n","subjects":["Physics/Nuclear Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}