{"id":"2408.00073","title":"Reverberation mapping of high-mass and high-redshift quasars using\n  gravitational time delays","authors":"Miriam Golubchik, Charles L. Steinhardt, Adi Zitrin, Ashish K. Meena,\n  Lukas J. Furtak, Doron Chelouche and Shai Kaspi","authorsParsed":[["Golubchik","Miriam",""],["Steinhardt","Charles L.",""],["Zitrin","Adi",""],["Meena","Ashish K.",""],["Furtak","Lukas J.",""],["Chelouche","Doron",""],["Kaspi","Shai",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:00:03 GMT"}],"updateDate":"2024-08-02","timestamp":1722448803000,"abstract":"  Mass estimates of black holes (BHs) in the centers of Active Galactic Nuclei\n(AGN) often rely on the radius-luminosity relation. However, this relation,\nusually probed by reverberation mapping (RM), is poorly constrained in the\nhigh-luminosity and high-redshift ends due to the very long expected lag times.\nMultiply imaged AGN may thus offer a unique opportunity to explore the\nradius-luminosity relation at these ends. In addition to comprising several\nmagnified images which enable a more efficient light-curve sampling, the time\ndelay between multiple images of strongly lensed quasars can also aid in making\nsuch RM measurements feasible on reasonable timescales: If the time delay is,\nfor example, of the order of the expected time lag, changes in the emission\nlines in the leading image can be observed around the same time as the changes\nin the continuum in the trailing image. In this work we probe the typical\ntime-delay distribution in galaxy-cluster lenses and estimate the number of\nboth high-mass ($\\sim10^9-10^{10}$ M$_{\\odot}$), and high-redshift\n($z\\gtrsim4-12$) quasars that are expected to be strongly lensed by clusters.\nWe find that less than one, very massive (and luminous, L$_{UV}>10^{46.5}$ erg\ns$^{-1}$) multiply imaged quasar is expected across the sky down to 30 AB mag.\nNonetheless, up to several dozen thousand M$_{BH}\\sim10^{6}$-$10^{8}$\nM$_{\\odot}$ broad-line AGN at $z>4$ should be multiply imaged by galaxy\nclusters and detectable with JWST, hundreds with $\\textit{Euclid}$ and several\nthousands with the $\\textit{Roman}$ Space Telescope, across the whole sky.\nThese could supply an important calibration for the BH mass scaling in the\nearly Universe.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}