{"id":"2408.00400","title":"Micro frequency hopping spread spectrum modulation and encryption\n  technology","authors":"Fanping Du and Pingfang Du","authorsParsed":[["Du","Fanping",""],["Du","Pingfang",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 09:13:35 GMT"}],"updateDate":"2024-08-02","timestamp":1722503615000,"abstract":"  By combining traditional frequency hopping ideas with the concepts of\nsubcarriers and sampling points in OFDM baseband systems, this paper proposes a\nfrequency hopping technology within the baseband called micro frequency\nhopping. Based on the concept of micro frequency hopping, this paper proposes a\nmicro frequency hopping spread spectrum modulation method based on cyclic\nfrequency shift and cyclic time shift, as well as a micro frequency hopping\nencryption method based on phase scrambling of baseband signals. Specifically,\nthis paper reveals a linear micro frequency hopping symbol with good\nauto-correlation and cross-correlation feature in both time domain and\nfrequency domain. Linear micro frequency hopping symbols with different root\n$R$ have good cross-correlation feature, which can be used in multi-user\ncommunication at same time and same frequency. Moreover, there is a linear\nrelationship between the time delay and frequency offset of this linear micro\nfrequency hopping symbol, making it suitable for time delay and frequency\noffset estimation, also for ranging, and speed measurement. Finally, this paper\nalso verifies the advantages of micro frequency hopping technology through an\nexample of a linear micro frequency hopping spread spectrum multiple access\ncommunication system. The author believes that micro frequency hopping\ntechnology will be widely used in fields such as the Internet of Things,\nmilitary communication, satellite communication, satellite positioning, and\nradar etc.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}