{"id":"2408.00536","title":"Brittleness of metallic glasses dictated by their state at the\n  fragile-to-strong transition temperature","authors":"Achraf Atila, Sergey V. Sukhomlinov, Marc J. Honecker, Martin H.\n  M\\\"user","authorsParsed":[["Atila","Achraf",""],["Sukhomlinov","Sergey V.",""],["Honecker","Marc J.",""],["Müser","Martin H.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 13:17:47 GMT"}],"updateDate":"2024-08-02","timestamp":1722518267000,"abstract":"  The effect of cooling on the brittleness of glasses in general, and bulk\nmetallic glasses (BMGs) in particular, is usually studied with continuously\nvarying cooling rates; slower cooling rates lead to stiffer, harder, and more\nbrittle glasses than higher cooling rates. These protocols obscure any\npotential discontinuity that a glass might experience depending on whether its\nmicrostructure resembles that of a fragile or a strong glass-forming liquid.\nHere, we use large-scale molecular dynamics to simulate the nanoindentation\nbehavior of model BMGs (Zr$_{0.6}$Cu$_{0.3}$Al$_{0.1}$) obtained by rapidly\nquenching equilibrium melts from temperatures above and below the\nfragile-to-strong transition temperature $T_\\textrm{fst}$, leading to fragile\nand strong glasses, respectively. While the contact modulus deduced from the\nindentation simulation evolves smoothly with the temperature $T_\\text{q}$ from\nwhich the melt is quenched, the plastic response changes quasi-discontinuously\nas $T_\\text{q}$ passes through $T_\\textrm{fst}$. In particular, strong glasses\ndevelop highly asymmetric flow profiles with mature shear bands, in contrast to\nfragile glasses. Quantitative differences reveal themselves not only through a\nformal von Mises localization parameter analysis but also through image\nanalysis of flow patterns using pre-trained artificial intelligence models.\nMoreover, seemingly erratic flow profiles for our indentation geometry produced\nsurprisingly reproducible and, thus, deterministic features. It remains to be\ndetermined to what extent other classes of glass formers follow our observation\nthat the degree of brittleness is significantly influenced by whether the melt\nis fragile or strong when it falls out of equilibrium at the glass transition\ntemperature.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"a3G507E2eeBFE_VE67ieQASRFax5GEwXEfjwOnqnNoA","pdfSize":"3324373","txDigest":"5ih6GsJgDUFEeB4R3J3ASBGfxvy5ZtC5LU4smDgfLLGy","endEpoch":"1","status":"CERTIFIED"}
