{"id":"2408.01322","title":"A Robotics-Inspired Scanpath Model Reveals the Importance of Uncertainty\n  and Semantic Object Cues for Gaze Guidance in Dynamic Scenes","authors":"Vito Mengers, Nicolas Roth, Oliver Brock, Klaus Obermayer, Martin\n  Rolfs","authorsParsed":[["Mengers","Vito",""],["Roth","Nicolas",""],["Brock","Oliver",""],["Obermayer","Klaus",""],["Rolfs","Martin",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 15:20:34 GMT"}],"updateDate":"2024-08-05","timestamp":1722612034000,"abstract":"  How we perceive objects around us depends on what we actively attend to, yet\nour eye movements depend on the perceived objects. Still, object segmentation\nand gaze behavior are typically treated as two independent processes. Drawing\non an information processing pattern from robotics, we present a mechanistic\nmodel that simulates these processes for dynamic real-world scenes. Our\nimage-computable model uses the current scene segmentation for object-based\nsaccadic decision-making while using the foveated object to refine its scene\nsegmentation recursively. To model this refinement, we use a Bayesian filter,\nwhich also provides an uncertainty estimate for the segmentation that we use to\nguide active scene exploration. We demonstrate that this model closely\nresembles observers' free viewing behavior, measured by scanpath statistics,\nincluding foveation duration and saccade amplitude distributions used for\nparameter fitting and higher-level statistics not used for fitting. These\ninclude how object detections, inspections, and returns are balanced and a\ndelay of returning saccades without an explicit implementation of such temporal\ninhibition of return. Extensive simulations and ablation studies show that\nuncertainty promotes balanced exploration and that semantic object cues are\ncrucial to form the perceptual units used in object-based attention. Moreover,\nwe show how our model's modular design allows for extensions, such as\nincorporating saccadic momentum or pre-saccadic attention, to further align its\noutput with human scanpaths.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZqOXnePpXPFq_petYTTcDkVhc-AP17Nbh36eAxAV27w","pdfSize":"4451324","txDigest":"3XwkqVKSyHWmeLDyaLpBEpRYRXgVWRDbDPBNd1QK4Hum","endEpoch":"1","status":"CERTIFIED"}
