{"id":"2408.07938","title":"Sb2Se3 and SbBiSe3 Surface Capping and Biaxial Strain Co-Engineering for\n  Tuning the Surface Electronic Properties of Bi2Se3 Nanosheet- A Density\n  Functional Theory based Investigation","authors":"Naresh Bahadursha, Banasree Sadhukhan, Tanay Nag, Swastik\n  Bhattacharya, and Sayan Kanungo","authorsParsed":[["Bahadursha","Naresh",""],["Sadhukhan","Banasree",""],["Nag","Tanay",""],["Bhattacharya","Swastik",""],["Kanungo","Sayan",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 05:13:06 GMT"}],"updateDate":"2024-08-16","timestamp":1723698786000,"abstract":"  In this work, for the first time, a density functional theory (DFT) based\ncomprehensive theoretical study is performed on the surface electronic\nproperties of Bi2Se3 nanosheet in the presence of a surface capping layer as\nwell as mechanical strain. The study systematically introduces a biaxial\ncompressive and tensile strain up to 5% in natural, Sb2Se3 surface capped, and\nSbBiSe3 surface capped Bi2Se3, and the subsequent effects on the electronic\nproperties are assessed from the surface energy band (E-k) structure, the\ndensity of states (DOS), band edge energy and bandgap variations, surface\nconducting state localization, and Fermi surface spin-textures. The key\nfindings of this work are systematically analyzed from conducting surface state\nhybridization through bulk in the presence of surface capping layers and\napplied biaxial strain. The result demonstrates that the interplay of surface\ncapping and strain can simultaneously tune the surface electronic structure,\nspin-momentum locking results from change in electronic localization and\ninteractions. In essence, this work presents an extensive theoretical and\ndesign-level insight into the surface capping and biaxial strain co-engineering\nin Bi2Se3, which can potentially facilitate different topological transport for\nmodern optoelectronics, spintronics, valleytronics, bulk photovoltaics\napplications of engineered nanostructured topological materials in the future.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tbSffScUEn4yJJX3rVNfAtN7jQeBBU5mcWv2pGQYyng","pdfSize":"6189585"}
