{"id":"2408.13668","title":"Effective Block Preconditioners for Fluid Dynamics Coupled to Reduced\n  Models of a Non-Local Nature","authors":"Marc Hirschvogel, Mia Bonini, Maximilian Balmus, David Nordsletten","authorsParsed":[["Hirschvogel","Marc",""],["Bonini","Mia",""],["Balmus","Maximilian",""],["Nordsletten","David",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 20:41:05 GMT"}],"updateDate":"2024-08-27","timestamp":1724532065000,"abstract":"  Modeling cardiovascular blood flow is central to many applications in\nbiomedical engineering. To accommodate the complexity of the cardiovascular\nsystem, in terms of boundary conditions and surrounding vascular tissue,\ncomputational fluid dynamics (CFD) often are coupled to reduced circuit and/or\nsolid mechanics models. These allow for realistic simulations of hemodynamics\nin the heart or the aorta, but come at additional computational cost and\ncomplexity. In this contribution, we design a novel block preconditioner for\nthe solution of the stabilized Navier-Stokes equations coupled to reduced-order\nmodels of a non-local nature. These models encompass lumped-parameter systems\nthat impose flux-dependent boundary tractions, and Galerkin reduced-order\nmodels that can be used to account for outlying mechanical structures. Here we\npropose a 3x3 preconditioner derived from the block factorization and\napproximation to the Schur complement(s). The solver performance is\ndemonstrated for a series of examples with increasing complexity, culminating\nin a reduced FSI simulation in a patient-specific contracting left heart model.\nFor all test cases, we show that our proposed approach is superior to other\nfrequently presented 2x2 schemes that merge stiffness contributions from\nreduced models into the fluid Jacobian or consolidate some variables for the\npurpose of efficiency - with an up to six times shorter overall computing time\nand/or only half as many linear iterations.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}