{"id":"2408.12830","title":"SAMBO-RL: Shifts-aware Model-based Offline Reinforcement Learning","authors":"Wang Luo, Haoran Li, Zicheng Zhang, Congying Han, Jiayu Lv, Tiande Guo","authorsParsed":[["Luo","Wang",""],["Li","Haoran",""],["Zhang","Zicheng",""],["Han","Congying",""],["Lv","Jiayu",""],["Guo","Tiande",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 04:25:09 GMT"}],"updateDate":"2024-08-26","timestamp":1724387109000,"abstract":"  Model-based Offline Reinforcement Learning trains policies based on offline\ndatasets and model dynamics, without direct real-world environment\ninteractions. However, this method is inherently challenged by distribution\nshift. Previous approaches have primarily focused on tackling this issue\ndirectly leveraging off-policy mechanisms and heuristic uncertainty in model\ndynamics, but they resulted in inconsistent objectives and lacked a unified\ntheoretical foundation. This paper offers a comprehensive analysis that\ndisentangles the problem into two key components: model bias and policy shift.\nWe provide both theoretical insights and empirical evidence to demonstrate how\nthese factors lead to inaccuracies in value function estimation and impose\nimplicit restrictions on policy learning. To address these challenges, we\nderive adjustment terms for model bias and policy shift within a unified\nprobabilistic inference framework. These adjustments are seamlessly integrated\ninto the vanilla reward function to create a novel Shifts-aware Reward (SAR),\naiming at refining value learning and facilitating policy training.\nFurthermore, we introduce Shifts-aware Model-based Offline Reinforcement\nLearning (SAMBO-RL), a practical framework that efficiently trains classifiers\nto approximate the SAR for policy optimization. Empirically, we show that SAR\neffectively mitigates distribution shift, and SAMBO-RL demonstrates superior\nperformance across various benchmarks, underscoring its practical effectiveness\nand validating our theoretical analysis.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}