{"id":"2408.03066","title":"Long-range optomechanical interactions in SiN membrane arrays","authors":"Xiong Yao, Matthijs H. J. de Jong, Jie Li, Simon Gr\\\"oblacher","authorsParsed":[["Yao","Xiong",""],["de Jong","Matthijs H. J.",""],["Li","Jie",""],["Gröblacher","Simon",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 09:38:35 GMT"}],"updateDate":"2024-08-07","timestamp":1722937115000,"abstract":"  Optomechanical systems using a membrane-in-the-middle configuration can\nexhibit a long-range type of interaction similar to how atoms show collective\nmotion in an optical potential. Photons bounce back and forth inside a\nhigh-finesse Fabry-P\\'{e}rot cavity and mediate the interaction between\nmultiple membranes over a significant distance compared to the wavelength.\nRecently, it has been demonstrated that light coupling the center-of-mass mode\nof the membranes can cause coherent mechanical noise cancellation. Long-range\ninteractions involving the breathing mode of the membranes have to date not\nbeen experimentally demonstrated, however. In our experiment, a double-membrane\nsystem inside a Fabry-P\\'{e}rot cavity resonantly enhances the cavity field,\nresulting in a stronger optomechanical coupling strength from the increased\nradiation pressure. The resonance condition is first identified by analyzing\nthe slope of the dispersion relation. Then, the optomechanical coupling is\ndetermined at various chip positions over one wavelength range. The optimum\ncoupling conditions are obtained and enhancement is demonstrated for double\nmembrane arrays with three different reflectivites, reaching nearly four-fold\nenhancement for the breathing mode of $R=65\\%$ double membranes. The cavity\nlosses at the optimum coupling are also characterized and the potential of\nreaching the single-photon strong coupling regime is discussed.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}