{"id":"2408.17220","title":"Next-Generation Triggering: A Novel Event-Level Approach","authors":"Jelena K\\\"ohler, Aur\\'elien Benoit-L\\'evy, Pablo Correa, Ars\\`ene\n  Ferriere, Tim Huege, Kumiko Kotera, Olivier Martineau-Huynh, Simon Prunet,\n  Markus Roth","authorsParsed":[["Köhler","Jelena",""],["Benoit-Lévy","Aurélien",""],["Correa","Pablo",""],["Ferriere","Arsène",""],["Huege","Tim",""],["Kotera","Kumiko",""],["Martineau-Huynh","Olivier",""],["Prunet","Simon",""],["Roth","Markus",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 11:58:02 GMT"}],"updateDate":"2024-09-02","timestamp":1725019082000,"abstract":"  Large-scale cosmic-ray detectors like the Giant Radio Array for Neutrino\nDetection (GRAND) are pushing the boundaries of our ability to identify air\nshower events. Existing trigger schemes rely solely on the timing of signals\ndetected by individual antennas, which brings many challenges in distinguishing\ntrue air shower signals from background. This work explores novel event-level\nradio trigger methods specifically designed for GRAND, but also applicable to\nother systems, such as the Radio Detector (RD) of the Pierre Auger Observatory.\nIn addition to an upgraded plane wave front reconstruction technique, we\nintroduce orthogonal and complementary approaches that analyze the\nradio-emission footprint, the spatial distribution of signal strength across\ntriggered antennas, to refine event selection. We test our methods on mock data\nsets constructed with simulated showers and real background noise measured with\nthe GRAND prototype, to assess the performance potential in terms of\nsensitivity and background rejection in GRAND. Our preliminary results are a\nfirst step to identifying the most discriminating radio signal features at\nevent-level, and optimizing the techniques for future implementation on\nexperimental data.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}