{"id":"2408.07253","title":"All-around Neural Collapse for Imbalanced Classification","authors":"Enhao Zhang, Chaohua Li, Chuanxing Geng, and Songcan Chen","authorsParsed":[["Zhang","Enhao",""],["Li","Chaohua",""],["Geng","Chuanxing",""],["Chen","Songcan",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 02:06:24 GMT"}],"updateDate":"2024-08-15","timestamp":1723601184000,"abstract":"  Neural Collapse (NC) presents an elegant geometric structure that enables\nindividual activations (features), class means and classifier (weights) vectors\nto reach \\textit{optimal} inter-class separability during the terminal phase of\ntraining on a \\textit{balanced} dataset. Once shifted to imbalanced\nclassification, such an optimal structure of NC can be readily destroyed by the\nnotorious \\textit{minority collapse}, where the classifier vectors\ncorresponding to the minority classes are squeezed. In response, existing works\nendeavor to recover NC typically by optimizing classifiers. However, we\ndiscover that this squeezing phenomenon is not only confined to classifier\nvectors but also occurs with class means.\n  Consequently, reconstructing NC solely at the classifier aspect may be\nfutile, as the feature means remain compressed, leading to the violation of\ninherent \\textit{self-duality} in NC (\\textit{i.e.}, class means and classifier\nvectors converge mutually) and incidentally, resulting in an unsatisfactory\ncollapse of individual activations towards the corresponding class means. To\nshake off these dilemmas, we present a unified \\textbf{All}-around\n\\textbf{N}eural \\textbf{C}ollapse framework (AllNC), aiming to comprehensively\nrestore NC across multiple aspects including individual activations, class\nmeans and classifier vectors. We thoroughly analyze its effectiveness and\nverify on multiple benchmark datasets that it achieves state-of-the-art in both\nbalanced and imbalanced settings.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}