{"id":"2408.00932","title":"Towards Zero-Shot Annotation of the Built Environment with\n  Vision-Language Models (Vision Paper)","authors":"Bin Han, Yiwei Yang, Anat Caspi, Bill Howe","authorsParsed":[["Han","Bin",""],["Yang","Yiwei",""],["Caspi","Anat",""],["Howe","Bill",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 21:50:23 GMT"}],"updateDate":"2024-08-05","timestamp":1722549023000,"abstract":"  Equitable urban transportation applications require high-fidelity digital\nrepresentations of the built environment: not just streets and sidewalks, but\nbike lanes, marked and unmarked crossings, curb ramps and cuts, obstructions,\ntraffic signals, signage, street markings, potholes, and more. Direct\ninspections and manual annotations are prohibitively expensive at scale.\nConventional machine learning methods require substantial annotated training\ndata for adequate performance. In this paper, we consider vision language\nmodels as a mechanism for annotating diverse urban features from satellite\nimages, reducing the dependence on human annotation to produce large training\nsets. While these models have achieved impressive results in describing common\nobjects in images captured from a human perspective, their training sets are\nless likely to include strong signals for esoteric features in the built\nenvironment, and their performance in these settings is therefore unclear. We\ndemonstrate proof-of-concept combining a state-of-the-art vision language model\nand variants of a prompting strategy that asks the model to consider segmented\nelements independently of the original image. Experiments on two urban features\n-- stop lines and raised tables -- show that while direct zero-shot prompting\ncorrectly annotates nearly zero images, the pre-segmentation strategies can\nannotate images with near 40% intersection-over-union accuracy. We describe how\nthese results inform a new research agenda in automatic annotation of the built\nenvironment to improve equity, accessibility, and safety at broad scale and in\ndiverse environments.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9y5M5ULzxZBgYRPxskpNpraWPET0Oa8DoQQcvuFOLA8","pdfSize":"30015268"}
