{"id":"2408.11348","title":"Learning Flock: Enhancing Sets of Particles for Multi~Sub-State Particle\n  Filtering with Neural Augmentation","authors":"Itai Nuri and Nir Shlezinger","authorsParsed":[["Nuri","Itai",""],["Shlezinger","Nir",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 05:28:12 GMT"}],"updateDate":"2024-08-22","timestamp":1724218092000,"abstract":"  A leading family of algorithms for state estimation in dynamic systems with\nmultiple sub-states is based on particle filters (PFs). PFs often struggle when\noperating under complex or approximated modelling (necessitating many\nparticles) with low latency requirements (limiting the number of particles), as\nis typically the case in multi target tracking (MTT). In this work, we\nintroduce a deep neural network (DNN) augmentation for PFs termed learning\nflock (LF). LF learns to correct a particles-weights set, which we coin flock,\nbased on the relationships between all sub-particles in the set itself, while\ndisregarding the set acquisition procedure. Our proposed LF, which can be\nreadily incorporated into different PFs flow, is designed to facilitate rapid\noperation by maintaining accuracy with a reduced number of particles. We\nintroduce a dedicated training algorithm, allowing both supervised and\nunsupervised training, and yielding a module that supports a varying number of\nsub-states and particles without necessitating re-training. We experimentally\nshow the improvements in performance, robustness, and latency of LF\naugmentation for radar multi-target tracking, as well its ability to mitigate\nthe effect of a mismatched observation modelling. We also compare and\nillustrate the advantages of LF over a state-of-the-art DNN-aided PF, and\ndemonstrate that LF enhances both classic PFs as well as DNN-based filters.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}