{"id":"2408.07674","title":"Neutron stars in the generalized SU(2) Proca theory","authors":"Jhan N. Martinez (1), Jose F. Rodriguez (1,2), Laura M. Becerra (2,3),\n  Yeinzon Rodriguez (1,4), Gabriel Gomez (5) ((1) Universidad Industrial de\n  Santander, (2) ICRANet, (3) Universidad Mayor, (4) Universidad Antonio\n  Narino, (5) Universidad de Santiago de Chile)","authorsParsed":[["Martinez","Jhan N.",""],["Rodriguez","Jose F.",""],["Becerra","Laura M.",""],["Rodriguez","Yeinzon",""],["Gomez","Gabriel",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 17:17:31 GMT"}],"updateDate":"2024-08-15","timestamp":1723655851000,"abstract":"  The generalized SU(2) Proca theory is a vector-tensor modified gravity theory\ncharacterized by an action that remains invariant under both diffeomorphisms\nand global internal transformations of the SU(2) group. This study aims to\nfurther explore the physical properties of the theory within astrophysical\ncontexts. Previous investigations have unveiled intriguing astrophysical\nsolutions, including particle-like configurations and black holes. The purpose\nof this work is to constrain the theory's free parameters by modeling realistic\nneutron stars. To that end, we have assumed solutions that are static,\nspherically symmetric, and have adopted the t'Hooft-Polyakov magnetic monopole\nconfiguration for the vector fields. Employing both analytical techniques, such\nas asymptotic expansions, and numerical methods involving solving boundary\nvalue problems, we have obtained neutron star solutions whose baryonic matter\nis described by realistic equations of state for nuclear matter. Furthermore,\nwe have constructed mass-radius relations which reveal that neutron stars\nexhibit greater compactness in comparison with general relativity predictions\nfor most of the solutions we have found and for the employed equations of\nstate. Finally, we have found out solutions where the mass of the star is\ngreater than $\\sim$ 2.5 $M_\\odot$; this result poses an alternative in the\nexploration of the mass gap of compact stellar objects.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}