{"id":"2408.01053","title":"Orientational order in liquid crystal surface induced by evaporation of\n  water droplet","authors":"Yusaku Abe and Yu Matsuda","authorsParsed":[["Abe","Yusaku",""],["Matsuda","Yu",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 07:01:01 GMT"}],"updateDate":"2024-08-05","timestamp":1722582061000,"abstract":"  The evaporation of a droplet induces variety of ordered patterns near the\ncontact line between the droplet and a substrate. This pattern formation\ninvolves both the behavior of colloidal suspensions and interactions between a\ndroplet and a substrate. Although studies on the effect of the behavior of\ncolloidal suspensions on the deposition process have been actively conducted,\nstudies on the effect of the interaction between a droplet and a substrate have\nnot been actively conducted because the observation of the interaction is\ndifficult owing to the lack of structural changes in the substrate by the\ninteraction. In this study, we investigated the solvent-substrate interactions\nby using a water droplet and liquid crystals as a substrate, where the liquid\ncrystals were placed on a glass slide. The orientation patterns of the liquid\ncrystals were induced at the contact line between the water droplet and the\nliquid crystal and were observed using a polarized optical microscope. Pinning\nand depinning events were observed at a certain anchoring strength of the\nliquid crystal on the glass slide and formed linear patterns on the surface of\nthe liquid crystal. Additionally, the interfacial tension between the water and\nliquid crystal slowly varied at this anchoring strength owing to the variation\nin the orientation of the liquid crystals. These results indicated that the\nevaporation-induced patterns appeared when the strength of the\nsolvent-substrate interactions was neutral. The interaction between a droplet\nand a substrate is important for the fabrication of desired ordered patterns.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}