{"id":"2408.10402","title":"Stacking-Dependent Van Hove Singularity Shifts in Three-Dimensional\n  Charge Density Waves of Kagome Metals AV$_3$Sb$_5$ (A = K, Rb, Cs)","authors":"Chanchal K. Barman, Sun-Woo Kim, and Youngkuk Kim","authorsParsed":[["Barman","Chanchal K.",""],["Kim","Sun-Woo",""],["Kim","Youngkuk",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 20:37:32 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 11:53:18 GMT"}],"updateDate":"2024-08-29","timestamp":1724099852000,"abstract":"  Vanadium-based kagome systems AV$_3$Sb$_5$ (A = K, Rb, Cs) have emerged as\nparadigmatic examples exhibiting unconventional charge density waves (CDWs) and\nsuperconductivity linked to van Hove singularities (VHSs). Despite extensive\nstudies, the three-dimensional (3D) nature of CDW states in these systems\nremains elusive. This study employs first-principles density functional theory\nand a tight-binding model to investigate the stacking-dependent electronic\nstructures of 3D CDWs in AV$_3$Sb$_5$, emphasizing the significant role of\ninterlayer coupling in behaviors of the VHSs associated with diverse 3D CDW\norders. We develop a minimal 3D tight-binding model and present a detailed\nanalysis of band structures and density of states for various 3D CDW stacking\nconfigurations, including those with and without a $\\pi$-phase shift stacking\nof the inverse star of David, as well as alternating stacking of the inverse\nstar of David and the star of David. We find that VHSs exist below the Fermi\nlevel even in 3D CDWs without $\\pi$-phase shift stackings, and that these VHSs\nshift downward in the $\\pi$-phase shift stacking CDW structure, stabilizing the\n$2\\times2\\times2$ $\\pi$-shifted inverse star of David distortions in\nalternating vanadium layers as the ground state 3D CDW order of AV$_3$Sb$_5$.\nOur work provides the electronic origin of 3D CDW orders, paving the way for a\ndeeper understanding of CDWs and superconductivity in AV$_3$Sb$_5$ kagome\nmetals.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}