{"id":"2408.04719","title":"One Born$-$Oppenheimer Effective Theory to rule them all: hybrids,\n  tetraquarks, pentaquarks, doubly heavy baryons and quarkonium","authors":"Matthias Berwein, Nora Brambilla, Abhishek Mohapatra, and Antonio\n  Vairo","authorsParsed":[["Berwein","Matthias",""],["Brambilla","Nora",""],["Mohapatra","Abhishek",""],["Vairo","Antonio",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 18:36:37 GMT"}],"updateDate":"2024-08-12","timestamp":1723142197000,"abstract":"  The discovery of XYZ exotic states in the hadronic sector with two heavy\nquarks, represents a significant challenge in particle theory. Understanding\nand predicting their nature remains an open problem. In this work, we\ndemonstrate how the Born$-$Oppenheimer (BO) effective field theory (BOEFT),\nderived from Quantum Chromodynamics (QCD) on the basis of scale separation and\nsymmetries, can address XYZ exotics of any composition. We derive the\nSchr\\\"odinger coupled equations that describe hybrids, tetraquarks,\npentaquarks, doubly heavy baryons, and quarkonia at leading order,\nincorporating nonadiabatic terms, and present the predicted multiples. We\ndefine the static potentials in terms of the QCD static energies for all\nrelevant cases. We provide the precise form of the nonperturbative low-energy\ngauge-invariant correlators required for the BOEFT: static energies,\ngeneralized Wilson loops, gluelumps, and adjoint mesons. These are to be\ncalculated on the lattice and we calculate here their short-distance behavior.\nFurthermore, we outline how spin-dependent corrections and mixing terms can be\nincorporated using matching computations. Lastly, we discuss how static\nenergies with the same BO quantum numbers mix at large distances leading to the\nphenomenon of avoided level crossing. This effect is crucial to understand the\nemergence of exotics with molecular characteristics, such as the\n$\\chi_{c1}(3872)$. With BOEFT both the tetraquark and the molecular picture\nappear as part of the same description.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment","Physics/High Energy Physics - Lattice"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RdKGknDWJ28g6V0xs-Nd-434Wv5-4cJJWTUGzxXX43I","pdfSize":"2244062"}
