{"id":"2408.07996","title":"Monte Carlo Path Tracing and Statistical Event Detection for Event\n  Camera Simulation","authors":"Yuichiro Manabe, Tatsuya Yatagawa, Shigeo Morishima, Hiroyuki Kubo","authorsParsed":[["Manabe","Yuichiro",""],["Yatagawa","Tatsuya",""],["Morishima","Shigeo",""],["Kubo","Hiroyuki",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 07:46:51 GMT"}],"updateDate":"2024-08-16","timestamp":1723708011000,"abstract":"  This paper presents a novel event camera simulation system fully based on\nphysically based Monte Carlo path tracing with adaptive path sampling. The\nadaptive sampling performed in the proposed method is based on a statistical\ntechnique, hypothesis testing for the hypothesis whether the difference of\nlogarithmic luminances at two distant periods is significantly larger than a\npredefined event threshold. To this end, our rendering system collects\nlogarithmic luminances rather than raw luminance in contrast to the\nconventional rendering system imitating conventional RGB cameras. Then, based\non the central limit theorem, we reasonably assume that the distribution of the\npopulation mean of logarithmic luminance can be modeled as a normal\ndistribution, allowing us to model the distribution of the difference of\nlogarithmic luminance as a normal distribution. Then, using Student's t-test,\nwe can test the hypothesis and determine whether to discard the null hypothesis\nfor event non-occurrence. When we sample a sufficiently large number of path\nsamples to satisfy the central limit theorem and obtain a clean set of events,\nour method achieves significant speed up compared to a simple approach of\nsampling paths uniformly at every pixel. To our knowledge, we are the first to\nsimulate the behavior of event cameras in a physically accurate manner using an\nadaptive sampling technique in Monte Carlo path tracing, and we believe this\nstudy will contribute to the development of computer vision applications using\nevent cameras.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"zM5_ysX-7AiwDsCyuajZmCfN8X8QJ_ZdiYeUGzxK8lI","pdfSize":"1459810"}
