{"id":"2408.16342","title":"Ultranarrow-linewidth Wavelength-Vortex Metasurface Holography","authors":"Weijia Meng, Johannes E. Fr\\\"och, Ke Cheng, Baoli Li, Arka Majumdar,\n  Stefan A. Maier, Haoran Ren, Min Gu, and Xinyuan Fang","authorsParsed":[["Meng","Weijia",""],["Fröch","Johannes E.",""],["Cheng","Ke",""],["Li","Baoli",""],["Majumdar","Arka",""],["Maier","Stefan A.",""],["Ren","Haoran",""],["Gu","Min",""],["Fang","Xinyuan",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 08:24:26 GMT"}],"updateDate":"2024-08-30","timestamp":1724919866000,"abstract":"  Ultrathin metasurface holograms, with thicknesses comparable to the operating\nwavelength, leverage multiple degrees of freedom of light to address\nindependent image channels, thereby significantly enhancing information\ncapacity. Although the wavelength of light can be used to encode holographic\nimage channels, high-capacity wavelength-multiplexing holography has\ntraditionally been achieved only through 3D volume holograms based on Bragg\ndiffraction. We demonstrate ultranarrow-linewidth wavelength-vortex\nmultiplexing holography in ultrathin metasurface holograms. By applying\ndispersion engineering to the elementary grating functions of a multiplexing\nhologram, we develop a sparse k-vector-filtering aperture array in momentum\nspace that achieves sharp wavelength selectivity in conjunction with orbital\nangular momentum selectivity. Further leveraging transformer neural networks\nfor the design of phase-only multiplexing holograms, we reconstruct up to 118\nindependent image channels from a single metasurface hologram, achieving an\nultranarrow linewidth of 2 nm in the visible range. Finally, we apply the\ndeveloped wavelength-vortex multiplexing metasurface holograms for holographic\nvisual cryptography, achieving unprecedented security with an information rate\nmore than 2500 times higher than that of traditional visual cryptography\nschemes. Our results open exciting avenues for the use of metasurface holograms\nin various applications, including 3D displays, holographic encryption, beam\nshaping, LiDAR, microscopy, data storage, and optical artificial intelligence.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}