{"id":"2408.01941","title":"A Jellyfish Cyborg: Exploiting Natural Embodied Intelligence as Soft\n  Robots","authors":"Dai Owaki, Max Austin, Shuhei Ikeda, Kazuya Okuizumi, Kohei Nakajima","authorsParsed":[["Owaki","Dai",""],["Austin","Max",""],["Ikeda","Shuhei",""],["Okuizumi","Kazuya",""],["Nakajima","Kohei",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 06:29:57 GMT"}],"updateDate":"2024-08-06","timestamp":1722752997000,"abstract":"  In the advanced field of bio-inspired robotics, the emergence of cyborgs\nrepresents the successful integration of engineering and biological systems.\nBuilding on previous research that showed how electrical stimuli could initiate\nand speed up a jellyfish's movement, this study presents a groundbreaking\napproach that explores how the natural embodied intelligence of the animal can\nbe harnessed to address pivotal challenges such as spontaneous exploration,\nnavigation in various environments, control of whole-body motion, and real-time\npredictions of behavior. We have developed a comprehensive data acquisition\nsystem and a unique setup for stimulating jellyfish, allowing for a detailed\nstudy of their movements. Through careful analysis of both spontaneous\nbehaviors and behaviors induced by targeted stimulation, we have identified\nsubtle differences between natural and induced motion patterns. By using a\nmachine learning method called physical reservoir computing, we have\nsuccessfully shown that future behaviors can be accurately predicted by\ndirectly measuring the jellyfish's body shape when the stimuli align with the\nanimal's natural dynamics. Our findings also reveal significant advancements in\nmotion control and real-time prediction capabilities of jellyfish cyborgs. In\nsummary, this research provides a comprehensive roadmap for optimizing the\ncapabilities of jellyfish cyborgs, with potential implications in marine\nreconnaissance and sustainable ecological interventions.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}