{"id":"2408.10506","title":"Correlation between dust continuum and CN line emissions in high-mass\n  star-forming regions","authors":"Jihye Hwang, Chang Won Lee, Jongsoo Kim, Eun Jung Chung, and Kee-Tae\n  Kim","authorsParsed":[["Hwang","Jihye",""],["Lee","Chang Won",""],["Kim","Jongsoo",""],["Chung","Eun Jung",""],["Kim","Kee-Tae",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 03:09:55 GMT"}],"updateDate":"2024-08-21","timestamp":1724123395000,"abstract":"  Measuring the strength of three dimensional (3D) magnetic field vector is\nchallenging as it is not easy to recognize whether its line-of-sight (LOS) and\nplane-of-sky (POS) components are obtained from the same region. CN ($N = 1 -\n0$) emission has been used to get the LOS component of a magnetic field\n(B$_\\mathrm{LOS}$) from its Zeeman splitting lines, while dust continuum\nemission has been used to get the POS component of a magnetic field\n(B$_\\mathrm{POS}$). We use the CN ($N = 1 - 0$) data observed with the Taeduk\nRadio Astronomy Observatory (TRAO) 14-m telescope and the dust continuum data\nfrom $Herschel$ archive toward six high-mass star-forming regions in order to\ntest whether CN line and dust continuum emission can trace a similar region and\nthus can be used for inferring 3D magnetic field strength. Our comparison\nbetween CN and H$_2$ column densities for all targets indicates that CN line\nemission tends to be strong toward bright continuum regions. The positions of\npeak CN column densities are particularly well correlated with those of peak\nH$_2$ column densities at least over the H$_2$ column density of 8.0 $\\times$\n10$^{22}$ cm$^{-2}$ within one or two telescope beam size in all targets,\nimplying that CN line and dust continuum emitting regions are likely spatially\ncoincident. This enabled us to make the reliable measurement of 3D magnetic\nfield strengths of five targets by taking a vector sum of their\nB$_\\mathrm{LOS}$ and B$_\\mathrm{POS}$, helping to decide the magnetical\ncriticality of the targets as supercritical or transcritical.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PTYPS_krN5ufa6Y9GxyPkEkn2eeTmIpst8hhHozH7Jw","pdfSize":"3782883"}
