{"id":"2408.12992","title":"CT scans without X-rays: parallel-beam imaging from nonlinear current\n  flows","authors":"Melody Alsaker, Siiri Rautio, Fernando Moura, Juan Pablo Agnelli,\n  Rashmi Murthy, Matti Lassas, Jennifer L. Mueller, Samuli Siltanen","authorsParsed":[["Alsaker","Melody",""],["Rautio","Siiri",""],["Moura","Fernando",""],["Agnelli","Juan Pablo",""],["Murthy","Rashmi",""],["Lassas","Matti",""],["Mueller","Jennifer L.",""],["Siltanen","Samuli",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 11:19:37 GMT"}],"updateDate":"2024-08-26","timestamp":1724411977000,"abstract":"  Parallel-beam X-ray computed tomography (CT) and electrical impedance\ntomography (EIT) are two imaging modalities which stem from completely\ndifferent underlying physics, and for decades have been thought to have little\nin common either practically or mathematically. CT is only mildly ill-posed and\nuses straight X-rays as measurement energy, which admits simple linear\nmathematics. However, CT relies on exposing targets to ionizing radiation and\nrequires cumbersome setups with expensive equipment. In contrast, EIT uses\nharmless electrical currents as measurement energy and can be implemented using\nsimple low-cost portable setups. But EIT is burdened by nonlinearity stemming\nfrom the curved paths of electrical currents, as well as extreme ill-posedness\nwhich causes characteristic low spatial resolution. In practical EIT\nreconstruction methods, nonlinearity and ill-posedness have been considered\nintertwined in a complicated fashion. In this work we demonstrate a surprising\nconnection between CT and EIT which partly unravels the main problems of EIT\nand leads directly to a proposed imaging modality which we call virtual hybrid\nparallel-beam tomography (VHPT). We show that hidden deep within EIT data is\ninformation which possesses the same linear geometry as parallel-beam CT data.\nThis admits a fundamental restructuring of EIT, separating ill-posedness and\nnonlinearity into simple modular sub-problems, and yields ''virtual\nradiographs'' and CT-like images which reveal previously concealed information.\nFurthermore, as proof of concept we present VHPT images of real-world objects.\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"q1qC16rzC6TQwoIAR14YCUU903-NAwpJYsMrGn76buo","pdfSize":"7136192"}
