{"id":"2408.11087","title":"EWOCS-II: X-ray properties of the Wolf-Rayet stars in the young Galactic\n  super star cluster Westerlund 1","authors":"K. Anastasopoulou, M.G. Guarcello, E. Flaccomio, S. Sciortino, S.\n  Benatti, M. De Becker, N.J. Wright, J. Drake, J.F. Albacete-Colombo, M.\n  Andersen, C. Argiroffi, A. Bayo, R. Castellanos, M. Gennaro, E.K. Grebel, M.\n  Miceli, F. Najarro, I. Negueruela, L. Prisinzano, B. Ritchie, M. Robberto, E.\n  Sabbi, P. Zeidler","authorsParsed":[["Anastasopoulou","K.",""],["Guarcello","M. G.",""],["Flaccomio","E.",""],["Sciortino","S.",""],["Benatti","S.",""],["De Becker","M.",""],["Wright","N. J.",""],["Drake","J.",""],["Albacete-Colombo","J. F.",""],["Andersen","M.",""],["Argiroffi","C.",""],["Bayo","A.",""],["Castellanos","R.",""],["Gennaro","M.",""],["Grebel","E. K.",""],["Miceli","M.",""],["Najarro","F.",""],["Negueruela","I.",""],["Prisinzano","L.",""],["Ritchie","B.",""],["Robberto","M.",""],["Sabbi","E.",""],["Zeidler","P.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-22","timestamp":1724176800000,"abstract":"  We present the most comprehensive and deepest X-ray study to date of the\nproperties of the richest Wolf-Rayet (WR) population observed in a single\nstellar cluster, Westerlund 1 (Wd1). This work is based on 36 Chandra\nobservations obtained from the \"Extended Westerlund 1 and 2 Open Clusters\nSurvey\" (EWOCS) project, plus 8 archival Chandra observations. The overall\nexposure depth (~1.1 Ms) and baseline of the EWOCS observations extending over\nmore than one year enable us to perform a detailed photometric, colour, and\nspectral analysis, as well as to search for short- and long-term periodicity.\nIn X-rays, we detect 20 out of the 24 known Wolf-Rayet stars in Wd1 down to an\nobserved luminosity of ~7$\\times10^{29}$erg s$^{-1}$ (assuming a distance of\n4.23 kpc to Wd1), with 8 WR stars being detected in X-rays for the first time.\nNine stars show clear evidence of variability over the year-long baseline, with\nclear signs of periodicity. The X-ray colours and spectral analysis reveal that\nthe vast majority of the WR stars are hard X-ray sources (kT$\\geq$2.0keV). The\nFe XXV emission line at ~6.7 keV, which commonly originates from the wind-wind\ncollision zone in binary systems, is detected for the first time in the spectra\nof 17 WR stars in Wd1. In addition the ~6.4 keV fluorescent line is observed in\nthe spectra of three stars, indicating that dense cold material coexists with\nthe hot gas in these systems. Overall, our X-ray results alone suggest a very\nhigh binary fraction ($\\geq$80%) for the WR star population in Wd1. When\ncombining our results with properties of the WR population from other\nwavelengths, we estimate a binary fraction of $\\geq$92%, which could even reach\nunity. This suggests that either all the most massive stars are found in binary\nsystems within Wd1, or that binarity is essential for the formation of such a\nrich population of WR stars.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"adk8VPhk4I9tTkpDQzthCjqwqCUjlLWi0Lvup1F5Ii0","pdfSize":"9318031"}
