{"id":"2408.02384","title":"Strategic Federated Learning: Application to Smart Meter Data Clustering","authors":"Hassan Mohamad, Chao Zhang, Samson Lasaulce, Vineeth S Varma,\n  M\\'erouane Debbah, Mounir Ghogho","authorsParsed":[["Mohamad","Hassan",""],["Zhang","Chao",""],["Lasaulce","Samson",""],["Varma","Vineeth S",""],["Debbah","Mérouane",""],["Ghogho","Mounir",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 11:16:26 GMT"}],"updateDate":"2024-08-06","timestamp":1722856586000,"abstract":"  Federated learning (FL) involves several clients that share with a fusion\ncenter (FC), the model each client has trained with its own data. Conventional\nFL, which can be interpreted as an estimation or distortion-based approach,\nignores the final use of model information (MI) by the FC and the other\nclients. In this paper, we introduce a novel FL framework in which the FC uses\nan aggregate version of the MI to make decisions that affect the client's\nutility functions. Clients cannot choose the decisions and can only use the MI\nreported to the FC to maximize their utility. Depending on the alignment\nbetween the client and FC utilities, the client may have an individual interest\nin adding strategic noise to the model. This general framework is stated and\nspecialized to the case of clustering, in which noisy cluster representative\ninformation is reported. This is applied to the problem of power consumption\nscheduling. In this context, utility non-alignment occurs, for instance, when\nthe client wants to consume when the price of electricity is low, whereas the\nFC wants the consumption to occur when the total power is the lowest. This is\nillustrated with aggregated real data from Ausgrid \\cite{ausgrid}. Our\nnumerical analysis clearly shows that the client can increase his utility by\nadding noise to the model reported to the FC. Corresponding results and source\ncodes can be downloaded from \\cite{source-code}.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Science and Game Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}