{"id":"2408.06067","title":"Don't You (Project Around Discs)? Neural Network Surrogate and Projected\n  Gradient Descent for Calibrating an Intervertebral Disc Finite Element Model","authors":"Matan Atad, Gabriel Gruber, Marx Ribeiro, Luis Fernando Nicolini,\n  Robert Graf, Hendrik M\\\"oller, Kati Nispel, Ivan Ezhov, Daniel Rueckert, Jan\n  S. Kirschke","authorsParsed":[["Atad","Matan",""],["Gruber","Gabriel",""],["Ribeiro","Marx",""],["Nicolini","Luis Fernando",""],["Graf","Robert",""],["Möller","Hendrik",""],["Nispel","Kati",""],["Ezhov","Ivan",""],["Rueckert","Daniel",""],["Kirschke","Jan S.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 11:39:21 GMT"}],"updateDate":"2024-08-13","timestamp":1723462761000,"abstract":"  Accurate calibration of finite element (FE) models of human intervertebral\ndiscs (IVDs) is essential for their reliability and application in diagnosing\nand planning treatments for spinal conditions. Traditional calibration methods\nare computationally intensive, requiring iterative, derivative-free\noptimization algorithms that often take hours or days to converge.\n  This study addresses these challenges by introducing a novel, efficient, and\neffective calibration method for an L4-L5 IVD FE model using a neural network\n(NN) surrogate. The NN surrogate predicts simulation outcomes with high\naccuracy, outperforming other machine learning models, and significantly\nreduces the computational cost associated with traditional FE simulations.\nNext, a Projected Gradient Descent (PGD) approach guided by gradients of the NN\nsurrogate is proposed to efficiently calibrate FE models. Our method explicitly\nenforces feasibility with a projection step, thus maintaining material bounds\nthroughout the optimization process.\n  The proposed method is evaluated against state-of-the-art Genetic Algorithm\n(GA) and inverse model baselines on synthetic and in vitro experimental\ndatasets. Our approach demonstrates superior performance on synthetic data,\nachieving a Mean Absolute Error (MAE) of 0.06 compared to the baselines' MAE of\n0.18 and 0.54, respectively. On experimental specimens, our method outperforms\nthe baseline in 5 out of 6 cases. Most importantly, our approach reduces\ncalibration time to under three seconds, compared to up to 8 days per sample\nrequired by traditional calibration. Such efficiency paves the way for applying\nmore complex FE models, enabling accurate patient-specific simulations and\nadvancing spinal treatment planning.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}