{"id":"2408.05373","title":"Evolutionary mechanisms that promote cooperation may not promote social\n  welfare","authors":"The Anh Han, Manh Hong Duong, Matjaz Perc","authorsParsed":[["Han","The Anh",""],["Duong","Manh Hong",""],["Perc","Matjaz",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 22:51:13 GMT"},{"version":"v2","created":"Wed, 11 Sep 2024 19:52:44 GMT"}],"updateDate":"2024-09-13","timestamp":1723243873000,"abstract":"  Understanding the emergence of prosocial behaviours among self-interested\nindividuals is an important problem in many scientific disciplines. Various\nmechanisms have been proposed to explain the evolution of such behaviours,\nprimarily seeking the conditions under which a given mechanism can induce\nhighest levels of cooperation. As these mechanisms usually involve costs that\nalter individual payoffs, it is however possible that aiming for highest levels\nof cooperation might be detrimental for social welfare -- the later broadly\ndefined as the total population payoff, taking into account all costs involved\nfor inducing increased prosocial behaviours. Herein, by comparatively analysing\nthe social welfare and cooperation levels obtained from stochastic evolutionary\nmodels of two well-established mechanisms of prosocial behaviour, namely, peer\nand institutional incentives, we demonstrate exactly that. We show that the\nobjectives of maximising cooperation levels and the objectives of maximising\nsocial welfare are often misaligned. We argue for the need of adopting social\nwelfare as the main optimisation objective when designing and implementing\nevolutionary mechanisms for social and collective goods.\n","subjects":["Mathematics/Dynamical Systems","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Multiagent Systems","Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"waBNJ7c-DNUehA7FPyT2HpyAo1tgJeLf0kspukBZJTE","pdfSize":"1542164"}
