{"id":"2408.00769","title":"Decoding AI and Human Authorship: Nuances Revealed Through NLP and\n  Statistical Analysis","authors":"Mayowa Akinwande, Oluwaseyi Adeliyi, Toyyibat Yussuph","authorsParsed":[["Akinwande","Mayowa",""],["Adeliyi","Oluwaseyi",""],["Yussuph","Toyyibat",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:09:03 GMT"}],"updateDate":"2024-08-05","timestamp":1721066943000,"abstract":"  This research explores the nuanced differences in texts produced by AI and\nthose written by humans, aiming to elucidate how language is expressed\ndifferently by AI and humans. Through comprehensive statistical data analysis,\nthe study investigates various linguistic traits, patterns of creativity, and\npotential biases inherent in human-written and AI- generated texts. The\nsignificance of this research lies in its contribution to understanding AI's\ncreative capabilities and its impact on literature, communication, and societal\nframeworks. By examining a meticulously curated dataset comprising 500K essays\nspanning diverse topics and genres, generated by LLMs, or written by humans,\nthe study uncovers the deeper layers of linguistic expression and provides\ninsights into the cognitive processes underlying both AI and human-driven\ntextual compositions. The analysis revealed that human-authored essays tend to\nhave a higher total word count on average than AI-generated essays but have a\nshorter average word length compared to AI- generated essays, and while both\ngroups exhibit high levels of fluency, the vocabulary diversity of Human\nauthored content is higher than AI generated content. However, AI- generated\nessays show a slightly higher level of novelty, suggesting the potential for\ngenerating more original content through AI systems. The paper addresses\nchallenges in assessing the language generation capabilities of AI models and\nemphasizes the importance of datasets that reflect the complexities of human-AI\ncollaborative writing. Through systematic preprocessing and rigorous\nstatistical analysis, this study offers valuable insights into the evolving\nlandscape of AI-generated content and informs future developments in natural\nlanguage processing (NLP).\n","subjects":["Computing Research Repository/Digital Libraries","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bSWFWdMR04zxdftYMMC1aoXF6cmnSeYbBwNpz3FMcDA","pdfSize":"798649"}
