{"id":"2408.02286","title":"Competitive optimal portfolio selection in a non-Markovian financial\n  market: A backward stochastic differential equation study","authors":"Guangchen Wang, Zuo Quan Xu, Panpan Zhang","authorsParsed":[["Wang","Guangchen",""],["Xu","Zuo Quan",""],["Zhang","Panpan",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 07:45:16 GMT"}],"updateDate":"2024-08-06","timestamp":1722843916000,"abstract":"  This paper studies a competitive optimal portfolio selection problem in a\nmodel where the interest rate, the appreciation rate and volatility rate of the\nrisky asset are all stochastic processes, thus forming a non-Markovian\nfinancial market. In our model, all investors (or agents) aim to obtain an\nabove-average wealth at the end of the common investment horizon. This\ncompetitive optimal portfolio problem is indeed a non-zero stochastic\ndifferential game problem. The quadratic BSDE theory is applied to tackle the\nproblem and Nash equilibria in suitable spaces are found. We discuss both the\nCARA and CRRA utility cases. For the CARA utility case, there are three\npossible scenarios depending on market and competition parameters: a unique\nNash equilibrium, no Nash equilibrium, and infinite Nash equilibria. The Nash\nequilibrium is given by the solutions of a quadratic BSDE and a linear BSDE\nwith unbounded coefficient when it is unique. Different from the\nwealth-independent Nash equilibria in the existing literature, the equilibrium\nin our paper is of feedback form of wealth. For the CRRA utility case, the\nissue is a bit more complicated than the CARA utility case. We prove the\nsolvability of a new kind of quadratic BSDEs with unbounded coefficients. A\ndecoupling technology is used to relate the Nash equilibrium to a series of\n1-dimensional quadratic BSDEs. With the help of this decoupling technology, we\ncan even give the limiting strategies for both cases when the number of agent\ntends to be infinite.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}