{"id":"2408.02026","title":"Examination of ventilated cavities in the wake of a two-dimensional\n  bluff body","authors":"Udhav U. Gawandalkar, Nicholas A. Lucido, Prachet Jain, Christian\n  Poelma, Steven L. Ceccio, Harish Ganesh","authorsParsed":[["Gawandalkar","Udhav U.",""],["Lucido","Nicholas A.",""],["Jain","Prachet",""],["Poelma","Christian",""],["Ceccio","Steven L.",""],["Ganesh","Harish",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 13:24:44 GMT"}],"updateDate":"2024-08-06","timestamp":1722777884000,"abstract":"  Ventilated cavities in the wake of a two-dimensional bluff body are studied\nexperimentally via time-resolved X-ray densitometry. With a systematic\nvariation of flow velocity and gas injection rate, expressed as Froude number\n($Fr$) and ventilation coefficient ($C_{qs}$), four stable cavities with\ndifferent closures are identified. A regime map governed by $Fr$ and $C_{qs}$\nis constructed to estimate flow conditions associated with each cavity closure\ntype. Each closure exhibits a different gas ejection mechanism, which in turn\ndictates the cavity geometry and the pressure inside the cavity.\nThree-dimensional cavity closure is seen to exist for the supercavities at low\n$Fr$. However, closure is nominally two-dimensional for supercavities at higher\n$Fr$. At low $C_{qs}$, cavity closure is seen to be wake-dominated, while\nsupercavities are seen to have wave-type closure at higher $C_{qs}$,\nirrespective of $Fr$. With the measured gas fraction, a simple gas balance\nanalysis is performed to quantify the gas ejection rate at the transitional\ncavity closure during its formation. For a range of $Fr$, the transitional\ncavity closure is seen to be characterised by liquid re-entrant flow, whose\nintensity depends on the flow inertia, dictating the gas ejection rates. Two\ndifferent ventilation strategies were employed to systematically investigate\nthe formation and maintenance gas fluxes. The interaction of wake and gas\ninjection is suspected to dominate the cavity formation process and not the\nmaintenance, resulting in ventilation hysteresis. Consequently, the ventilation\ngas flux required to maintain the supercavity is significantly less than the\ngas flux required to form the supercavity.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9OmeKmOnAHK_SL1CgTsctk2vyr8V0lY6Rcgu2hpW2qM","pdfSize":"7070876"}
