{"id":"2408.16501","title":"UAV-Based Human Body Detector Selection and Fusion for Geolocated\n  Saliency Map Generation","authors":"Piotr Rudol, Patrick Doherty, Mariusz Wzorek, Chattrakul Sombattheera","authorsParsed":[["Rudol","Piotr",""],["Doherty","Patrick",""],["Wzorek","Mariusz",""],["Sombattheera","Chattrakul",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 13:00:37 GMT"}],"updateDate":"2024-08-30","timestamp":1724936437000,"abstract":"  The problem of reliably detecting and geolocating objects of different\nclasses in soft real-time is essential in many application areas, such as\nSearch and Rescue performed using Unmanned Aerial Vehicles (UAVs). This\nresearch addresses the complementary problems of system contextual vision-based\ndetector selection, allocation, and execution, in addition to the fusion of\ndetection results from teams of UAVs for the purpose of accurately and reliably\ngeolocating objects of interest in a timely manner. In an offline step, an\napplication-independent evaluation of vision-based detectors from a system\nperspective is first performed. Based on this evaluation, the most appropriate\nalgorithms for online object detection for each platform are selected\nautomatically before a mission, taking into account a number of practical\nsystem considerations, such as the available communication links, video\ncompression used, and the available computational resources. The detection\nresults are fused using a method for building maps of salient locations which\ntakes advantage of a novel sensor model for vision-based detections for both\npositive and negative observations. A number of simulated and real flight\nexperiments are also presented, validating the proposed method.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"W3mkbBjtaEMcSIJoHO0BAHGBvg7CKGFSGauXFKYom6Y","pdfSize":"12993536"}
