{"id":"2408.09951","title":"Principle Driven Parameterized Fiber Model based on GPT-PINN Neural\n  Network","authors":"Yubin Zang, Boyu Hua, Zhenzhou Tang, Zhipeng Lin, Fangzheng Zhang,\n  Simin Li, Zuxing Zhang, Hongwei Chen","authorsParsed":[["Zang","Yubin",""],["Hua","Boyu",""],["Tang","Zhenzhou",""],["Lin","Zhipeng",""],["Zhang","Fangzheng",""],["Li","Simin",""],["Zhang","Zuxing",""],["Chen","Hongwei",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 12:44:00 GMT"}],"updateDate":"2024-08-20","timestamp":1724071440000,"abstract":"  In cater the need of Beyond 5G communications, large numbers of data driven\nartificial intelligence based fiber models has been put forward as to utilize\nartificial intelligence's regression ability to predict pulse evolution in\nfiber transmission at a much faster speed compared with the traditional split\nstep Fourier method. In order to increase the physical interpretabiliy,\nprinciple driven fiber models have been proposed which inserts the Nonlinear\nSchodinger Equation into their loss functions. However, regardless of either\nprinciple driven or data driven models, they need to be re-trained the whole\nmodel under different transmission conditions. Unfortunately, this situation\ncan be unavoidable when conducting the fiber communication optimization work.\nIf the scale of different transmission conditions is large, then the whole\nmodel needs to be retrained large numbers of time with relatively large scale\nof parameters which may consume higher time costs. Computing efficiency will be\ndragged down as well. In order to address this problem, we propose the\nprinciple driven parameterized fiber model in this manuscript. This model\nbreaks down the predicted NLSE solution with respect to one set of transmission\ncondition into the linear combination of several eigen solutions which were\noutputted by each pre-trained principle driven fiber model via the reduced\nbasis method. Therefore, the model can greatly alleviate the heavy burden of\nre-training since only the linear combination coefficients need to be found\nwhen changing the transmission condition. Not only strong physical\ninterpretability can the model posses, but also higher computing efficiency can\nbe obtained. Under the demonstration, the model's computational complexity is\n0.0113% of split step Fourier method and 1% of the previously proposed\nprinciple driven fiber model.\n","subjects":["Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}