{"id":"2408.11673","title":"Improved Visual Saliency of Graph Clusters with Orderable Node-Link\n  Layouts","authors":"Nora Al-Naami, Nicolas M\\'edoc, Matteo Magnani, Mohammad Ghoniem","authorsParsed":[["Al-Naami","Nora",""],["Médoc","Nicolas",""],["Magnani","Matteo",""],["Ghoniem","Mohammad",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 14:50:37 GMT"}],"updateDate":"2024-08-22","timestamp":1724251837000,"abstract":"  Graphs are often used to model relationships between entities. The\nidentification and visualization of clusters in graphs enable insight discovery\nin many application areas, such as life sciences and social sciences.\nForce-directed graph layouts promote the visual saliency of clusters, as they\nbring adjacent nodes closer together, and push non-adjacent nodes apart. At the\nsame time, matrices can effectively show clusters when a suitable row/column\nordering is applied, but are less appealing to untrained users not providing an\nintuitive node-link metaphor. It is thus worth exploring layouts combining the\nstrengths of the node-link metaphor and node ordering. In this work, we study\nthe impact of node ordering on the visual saliency of clusters in orderable\nnode-link diagrams, namely radial diagrams, arc diagrams and symmetric arc\ndiagrams. Through a crowdsourced controlled experiment, we show that users can\ncount clusters consistently more accurately, and to a large extent faster, with\norderable node-link diagrams than with three state-of-the art force-directed\nlayout algorithms, i.e., `Linlog', `Backbone' and `sfdp'. The measured\nadvantage is greater in case of low cluster separability and/or low\ncompactness. A free copy of this paper and all supplemental materials are\navailable at https://osf.io/kc3dg/.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LrpNODkPAeRCF-fNTgByvQxvf7xL4_0fHHQAdZZnCao","pdfSize":"18069063"}
