{"id":"2408.04527","title":"Charmed hypernuclei within density-dependent relativistic mean-field\n  theory","authors":"Wei Yang, Shi Yuan Ding, Bao Yuan Sun","authorsParsed":[["Yang","Wei",""],["Ding","Shi Yuan",""],["Sun","Bao Yuan",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 15:26:41 GMT"}],"updateDate":"2024-08-09","timestamp":1723130801000,"abstract":"  The charmed $ \\Lambda_{c}^{+} $ hypernuclei are investigated within the\nframework of the density-dependent relativistic mean-field (DDRMF) theory.\nStarting from the empirical hyperon potential in symmetric nuclear matter,\nobtained through microscopic first-principle calculations, two sets of\n$\\Lambda_c N$ effective interactions were derived by fitting the potentials\nwith minimal uncertainty (Fermi momentum $k_{F,n} = 1.05~\\rm{fm}^{-1}$) and\nnear saturation density ($k_{F,n} = 1.35~\\rm{fm}^{-1}$). These DDRMF models\nwere then used to explore the $\\Lambda_{c} N$ effective interaction\nuncertainties on the description of hypernuclear bulk and single-particle\nproperties. A systematic investigation was conducted on the existence of bound\n$\\Lambda_{c}^{+}$ hypernuclei. The dominant factors affecting the existence and\nstability of hypernuclei were analyzed from the perspective of the\n$\\Lambda_{c}^{+}$ potential. It is found that the hyperon potential is not only\ninfluenced by the Coulomb repulsion, but by an extra contribution from the\nrearrangement terms due to the density dependence of the meson-baryon coupling\nstrengths. Therefore, the rearrangement term significantly impacts the\nstability description for light hypernuclei, while for heavier hypernuclei, the\ncontribution from Coulomb repulsion becomes increasingly significant and\neventually dominant. The discussion then delves into the bulk and\nsingle-particle properties of charmed hypernuclei using these models. It is\nfound that even when different models yield similar hyperon potentials for\nnuclear matter, different treatments of nuclear medium effects could lead to\ndisparities in the theoretical description of hypernuclear structures. This\nstudy indicates that constraints on the $ \\Lambda_{c} N $ interaction at finite\ndensities are crucial for the study of $ \\Lambda_{c}^{+} $ hypernuclear\nstructures.\n","subjects":["Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iYkDljaUiZjo9VZTQtDmWz0CPhe5vpcqqVndCvGRALs","pdfSize":"934995"}
