{"id":"2408.06461","title":"Integrated astrophotonic phase control for high resolution optical\n  interferometry","authors":"Ross Cheriton, Siegfried Janz, Glen Herriot, Jean-Pierre V\\'eran,\n  Brent Carlson","authorsParsed":[["Cheriton","Ross",""],["Janz","Siegfried",""],["Herriot","Glen",""],["Véran","Jean-Pierre",""],["Carlson","Brent",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 19:21:48 GMT"}],"updateDate":"2024-08-14","timestamp":1723490508000,"abstract":"  Long baseline optical interferometry and aperture synthesis using\nground-based telescopes can enable unprecedented angular resolution astronomy\nin the optical domain. However, atmospheric turbulence leads to large, dynamic\nphase errors between participating apertures that limit fringe visibility using\ntelescopes arrays or subaperture configurations in a single large telescope.\nDiffraction limited optics or adaptive optics can be used to ensure coherence\nat each aperture, but correlating the phase between apertures requires high\nspeed, high stroke phase correction and recombination that is extremely\nchallenging and costly. As a solution, we show an alternative phase correction\nand beam combination method using a centimeter-scale silicon astrophotonic chip\noptimized for H-band operation. The 4.7x10mm silicon photonic chip is\nfabricated using electron beam lithography with devices with 2 up to 32\nindependent channels. Light is coupled into the chip using single mode fiber\nribbons. An array of microheaters is used to individually tune the effective\nindex of each spiral delay waveguides. Narrowband spectral splitters at each\nspatial channel divert a modulated digital reference signal from an artificial\nguide star off-chip for phase measurement. Science light from other wavelengths\nis coherently combined using on-chip beam combiners and outputted to a single\nwaveguide. We described the role, design, fabrication and characterization of\nthe photonic chip. This photonic phase control scheme can be applied in\nastronomical interferometry or optical satellite communications.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Applied Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AJWTUiFSX7rsZ3sZzmphLA8kqJ7XbNsDQnfDS8PvH0o","pdfSize":"972576"}
