{"id":"2408.03368","title":"Evolving massive stars to core collapse with GENEC: Extension of\n  equation of state, opacities and effective nuclear network","authors":"Adam Griffiths, Miguel-\\'A Aloy, Raphael Hirschi, Moritz Reichert,\n  Matrin Obergaulinger, Emily E. Whitehead, S\\'ebastien Martinet, Sylvia\n  Esktr\\\"om, Georges Meynet","authorsParsed":[["Griffiths","Adam",""],["Aloy","Miguel-Á",""],["Hirschi","Raphael",""],["Reichert","Moritz",""],["Obergaulinger","Matrin",""],["Whitehead","Emily E.",""],["Martinet","Sébastien",""],["Esktröm","Sylvia",""],["Meynet","Georges",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-08","timestamp":1722967201000,"abstract":"  Stars with initial mass above roughly 8 solar masses will evolve to form a\ncore made of iron group elements at which point no further exothermic nuclear\nreactions between charged nuclei may prevent the core collapse. Electron\ncaptures, neutrino losses, and the photo-disintegration of heavy nuclei trigger\nthe collapse of these stars. Models at the brink of core collapse are produced\nusing stellar evolution codes and these pre-collapse models may be used in the\nstudy of the subsequent dynamical evolution (including their explosion as\nsupernovae and the formation of compact remnants such as neutron stars or black\nholes). We upgrade the physical ingredients employed by the GENeva stellar\nEvolution Code, GENEC, so that it may cover the regime of high temperatures and\nhigh densities required to produce progenitors of core-collapse. We have\nimproved GENEC in three directions, equation of state, the nuclear reaction\nnetwork and the radiative and conductive opacities adapted for the computation\nof the advanced phases of evolution. We produce a small grid of pre-supernova\nmodels of stars with zero-age main sequence masses of 15, 20 and 25 solar\nmasses at solar and less than half solar metallicities. The results are\ncompared with analogous models produced with the MESA code. The global\nproperties of our new models, particularly of their inner cores, are comparable\nto models computed with MESA and pre-existing progenitors in the literature.\nBetween codes the exact shell structure varies impacting explosion predictions.\nUsing GENEC with state-of-the-art physics, we have produced massive stellar\nprogenitors prior to collapse. These progenitors are suitable for follow-up\nstudies, including the dynamical collapse and supernova phases. Larger grids of\nsupernova progenitors are now feasible, with potential for further dynamical\nevolution.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"v6ME2FN0OVx0J2Re5X67sHr05M-nNEWYtZ9nta6MRMQ","pdfSize":"5437261"}
