{"id":"2408.02039","title":"Pixel-Level Domain Adaptation: A New Perspective for Enhancing Weakly\n  Supervised Semantic Segmentation","authors":"Ye Du, Zehua Fu, Qingjie Liu","authorsParsed":[["Du","Ye",""],["Fu","Zehua",""],["Liu","Qingjie",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 14:14:54 GMT"}],"updateDate":"2024-08-06","timestamp":1722780894000,"abstract":"  Recent attention has been devoted to the pursuit of learning semantic\nsegmentation models exclusively from image tags, a paradigm known as\nimage-level Weakly Supervised Semantic Segmentation (WSSS). Existing attempts\nadopt the Class Activation Maps (CAMs) as priors to mine object regions yet\nobserve the imbalanced activation issue, where only the most discriminative\nobject parts are located. In this paper, we argue that the distribution\ndiscrepancy between the discriminative and the non-discriminative parts of\nobjects prevents the model from producing complete and precise pseudo masks as\nground truths. For this purpose, we propose a Pixel-Level Domain Adaptation\n(PLDA) method to encourage the model in learning pixel-wise domain-invariant\nfeatures. Specifically, a multi-head domain classifier trained adversarially\nwith the feature extraction is introduced to promote the emergence of pixel\nfeatures that are invariant with respect to the shift between the source (i.e.,\nthe discriminative object parts) and the target (\\textit{i.e.}, the\nnon-discriminative object parts) domains. In addition, we come up with a\nConfident Pseudo-Supervision strategy to guarantee the discriminative ability\nof each pixel for the segmentation task, which serves as a complement to the\nintra-image domain adversarial training. Our method is conceptually simple,\nintuitive and can be easily integrated into existing WSSS methods. Taking\nseveral strong baseline models as instances, we experimentally demonstrate the\neffectiveness of our approach under a wide range of settings.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}