{"id":"2408.00674","title":"ChordSync: Conformer-Based Alignment of Chord Annotations to Music Audio","authors":"Andrea Poltronieri, Valentina Presutti, Mart\\'in Rocamora","authorsParsed":[["Poltronieri","Andrea",""],["Presutti","Valentina",""],["Rocamora","Martín",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 16:16:29 GMT"}],"updateDate":"2024-08-02","timestamp":1722528989000,"abstract":"  In the Western music tradition, chords are the main constituent components of\nharmony, a fundamental dimension of music. Despite its relevance for several\nMusic Information Retrieval (MIR) tasks, chord-annotated audio datasets are\nlimited and need more diversity. One way to improve those resources is to\nleverage the large number of chord annotations available online, but this\nrequires aligning them with music audio. However, existing audio-to-score\nalignment techniques, which typically rely on Dynamic Time Warping (DTW), fail\nto address this challenge, as they require weakly aligned data for precise\nsynchronisation. In this paper, we introduce ChordSync, a novel conformer-based\nmodel designed to seamlessly align chord annotations with audio, eliminating\nthe need for weak alignment. We also provide a pre-trained model and a\nuser-friendly library, enabling users to synchronise chord annotations with\naudio tracks effortlessly. In this way, ChordSync creates opportunities for\nharnessing crowd-sourced chord data for MIR, especially in audio chord\nestimation, thereby facilitating the generation of novel datasets.\nAdditionally, our system extends its utility to music education, enhancing\nmusic learning experiences by providing accurately aligned annotations, thus\nenabling learners to engage in synchronised musical practices.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Machine Learning","Computing Research Repository/Multimedia","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"J_mtKoByDLIWAJkDnYmo9jntLF1qbzJcYKbgMLtIlNA","pdfSize":"1322027","txDigest":"9MyTSwGGqPevsu3fqykJEgabiGMhJm8aWwLfQeQYyyjQ","endEpoch":"1","status":"CERTIFIED"}
