{"id":"2408.09051","title":"AI-assisted super-resolution cosmological simulations IV: An emulator\n  for deterministic realizations","authors":"Xiaowen Zhang, Patrick Lachance, Ankita Dasgupta, Rupert A. C. Croft,\n  Tiziana Di Matteo, Yueying Ni, Simeon Bird, Yin Li","authorsParsed":[["Zhang","Xiaowen",""],["Lachance","Patrick",""],["Dasgupta","Ankita",""],["Croft","Rupert A. C.",""],["Di Matteo","Tiziana",""],["Ni","Yueying",""],["Bird","Simeon",""],["Li","Yin",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 23:38:34 GMT"}],"updateDate":"2024-08-20","timestamp":1723851514000,"abstract":"  Super-resolution (SR) models in cosmological simulations use deep learning\n(DL) to rapidly supplement low-resolution (LR) runs with statistically correct,\nfine details. The SR technique preserves large-scale structures by conditioning\non a low-resolution (LR) version of the simulation. On smaller scales, the\ngenerative deep learning (DL) process is stochastic, resulting in numerous\npossible SR realizations, each with unique small-scale structures. Validation\nof SR then relies on making sure that a specific statistic of interest is\naccurately reproduced by comparing SR and high resolution (HR) runs. In this\nstudy, we develop an emulator designed to reproduce the individual small-scale\nstructures of an HR simulation as closely as possible. We process an SR\nrealization alongside a specific High-Resolution Initial Condition (HRIC),\ntransforming the SR output to emulate the results of a full simulation with\nthat HRIC. By comparing visualizations, individual halo measures and\ncross-correlating Fourier modes we show that the emulated SR runs closely align\nwith the corresponding HR simulation, even on length scales an order of\nmagnitude smaller than the LR run. Additionally, small halos are trained to\nmatch the HR simulation, and the subhalo mass function is more accurately\nreproduced. These results show the promise of this method for generating\nnumerous fast and accurate simulations and mock observations for large galaxy\nsurveys.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AoZpuC8qLYMpJ5FyriLGeBBPZ1fk3qR7bUASeR9iVdw","pdfSize":"12038410"}
