{"id":"2408.04634","title":"Maximization and minimization of the principal eigenvalue of the\n  Laplacian with indefinite weight under Dirichlet and Robin boundary\n  conditions on classes of rearrangements","authors":"Claudia Anedda and Fabrizio Cuccu","authorsParsed":[["Anedda","Claudia",""],["Cuccu","Fabrizio",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 07:45:40 GMT"}],"updateDate":"2024-08-12","timestamp":1721288740000,"abstract":"  Let $\\Omega\\subset\\mathbb{R}^N$, $N\\geq 1$, be a bounded connected open set.\nWe consider the weighted eigenvalue problem $-\\Delta u =\\lambda m u$ in\n$\\Omega$ with $\\lambda \\in \\mathbb{R}$, $m\\in L^\\infty(\\Omega)$ and with\nhomogeneous Dirichlet and Robin boundary conditions. First, we study weak*\ncontinuity, convexity and G\\^ateaux differentiability of the map\n$m\\mapsto1/\\lambda_1(m)$, where $\\lambda_1(m)$ is the principal eigenvalue.\nThen, denoting by $\\mathcal{G}(m_0)$ the class of rearrangements of a fixed\nweight $m_0$ and assuming that $m_0$ is positive on a set of positive Lebesgue\nmeasure, we investigate the minimization and maximization of $\\lambda_1(m)$\nover $\\mathcal{G}(m_0)$. The minimization problem has been already discussed in\nsome papers; here we prove some known results about the existence and\ncharacterization of minimizers of $\\lambda_1(m)$. We underline that our\napproach allows us to treat Dirichlet and Robin boundary conditions together.\nInstead, to our best knowledge, the maximization problem has been only\npartially addressed in the literature. It turns out that the maximization of\n$\\lambda_1(m)$ is more intricate than its minimization. In our work we discuss\nexistence, uniqueness and characterization of maximizers both in $\n\\mathcal{G}(m_0)$ and in its weak* closure $\\overline{\\mathcal{G}(m_0)}$. In\nparticular, we provide an original full description of the unique maximizer in\nthe case of Dirichlet boundary conditions. In the context of the population\ndynamics, this kind of problems arise from the question of determining the\noptimal spatial location of favourable and unfavourable habitats in order to\nincrease the chances of survival or extinction of a population.\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}