{"id":"2408.11429","title":"Long-Range Vision-Based UAV-assisted Localization for Unmanned Surface\n  Vehicles","authors":"Waseem Akram, Siyuan Yang, Hailiang Kuang, Xiaoyu He, Muhayy Ud Din,\n  Yihao Dong, Defu Lin, Lakmal Seneviratne, Shaoming He and Irfan Hussain","authorsParsed":[["Akram","Waseem",""],["Yang","Siyuan",""],["Kuang","Hailiang",""],["He","Xiaoyu",""],["Din","Muhayy Ud",""],["Dong","Yihao",""],["Lin","Defu",""],["Seneviratne","Lakmal",""],["He","Shaoming",""],["Hussain","Irfan",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 08:37:37 GMT"}],"updateDate":"2024-08-22","timestamp":1724229457000,"abstract":"  The global positioning system (GPS) has become an indispensable navigation\nmethod for field operations with unmanned surface vehicles (USVs) in marine\nenvironments. However, GPS may not always be available outdoors because it is\nvulnerable to natural interference and malicious jamming attacks. Thus, an\nalternative navigation system is required when the use of GPS is restricted or\nprohibited. To this end, we present a novel method that utilizes an Unmanned\nAerial Vehicle (UAV) to assist in localizing USVs in GNSS-restricted marine\nenvironments. In our approach, the UAV flies along the shoreline at a\nconsistent altitude, continuously tracking and detecting the USV using a deep\nlearning-based approach on camera images. Subsequently, triangulation\ntechniques are applied to estimate the USV's position relative to the UAV,\nutilizing geometric information and datalink range from the UAV. We propose\nadjusting the UAV's camera angle based on the pixel error between the USV and\nthe image center throughout the localization process to enhance accuracy.\nAdditionally, visual measurements are integrated into an Extended Kalman Filter\n(EKF) for robust state estimation. To validate our proposed method, we utilize\na USV equipped with onboard sensors and a UAV equipped with a camera. A\nheterogeneous robotic interface is established to facilitate communication\nbetween the USV and UAV. We demonstrate the efficacy of our approach through a\nseries of experiments conducted during the ``Muhammad Bin Zayed International\nRobotic Challenge (MBZIRC-2024)'' in real marine environments, incorporating\nnoisy measurements and ocean disturbances. The successful outcomes indicate the\npotential of our method to complement GPS for USV navigation.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8R5S1HxsgKUnufhHEQNRQMtu019WYwwQwbIqseUvT6A","pdfSize":"6814130"}
