{"id":"2408.11864","title":"Automated and Connected Driving: State-of-the-Art and Implications for\n  Future Scenario Analysis","authors":"Edgar Jungblut, Thomas Grube, Jochen Lin{\\ss}en, Detlef Stolten","authorsParsed":[["Jungblut","Edgar",""],["Grube","Thomas",""],["Linßen","Jochen",""],["Stolten","Detlef",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 16:20:58 GMT"}],"updateDate":"2024-08-23","timestamp":1723911658000,"abstract":"  Automated driving can have a huge impact on the transport system in\npassenger, as well as freight applications; however, market and technological\ndevelopment are difficult to foresee. Therefore, a systems analysis is called\nfor to answer the question: What is the impact of automated driving on the\ntechno-economic performance of transport systems? It is important to quantify\nthe potential impacts not only on a local scale and for specific use cases but\nfor entire transport systems at large. Here, we provide an overview of the\ncurrent state of automated driving, including academic research in addition to\nindustrial development. For industrial development, we find that it will take\nat least until 2030-2040 for automated vehicles to be widely available for\npassenger transport. For freight transport on the other hand, automated\nvehicles might already be used within the next years at least on motorways. For\nacademic research, we find that most studies on passenger transport consider\nshared automated vehicles separated from other transport modes and consider\nspecific regions only. For freight transport we find that operational\nstrategies and usage potentials for level 4 and 5 trucks lack alignment with\nreal-life use cases and driving profiles. Based on this, we develop an\nanalytical framework for future research. This includes a mode choice model for\npassenger transport demand calculations, a total cost of ownership model for\nfreight trucks, transport statistics for freight flows, a microscopic traffic\nsimulation to assess the impact of automated vehicles on traffic flow, and a\nroad network analysis.\n","subjects":["Physics/Physics and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}