{"id":"2408.17095","title":"RISSOLE: Parameter-efficient Diffusion Models via Block-wise Generation\n  and Retrieval-Guidance","authors":"Avideep Mukherjee, Soumya Banerjee, Piyush Rai, Vinay P. Namboodiri","authorsParsed":[["Mukherjee","Avideep",""],["Banerjee","Soumya",""],["Rai","Piyush",""],["Namboodiri","Vinay P.",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 08:26:55 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 20:33:49 GMT"}],"updateDate":"2024-09-04","timestamp":1725006415000,"abstract":"  Diffusion-based models demonstrate impressive generation capabilities.\nHowever, they also have a massive number of parameters, resulting in enormous\nmodel sizes, thus making them unsuitable for deployment on resource-constraint\ndevices. Block-wise generation can be a promising alternative for designing\ncompact-sized (parameter-efficient) deep generative models since the model can\ngenerate one block at a time instead of generating the whole image at once.\nHowever, block-wise generation is also considerably challenging because\nensuring coherence across generated blocks can be non-trivial. To this end, we\ndesign a retrieval-augmented generation (RAG) approach and leverage the\ncorresponding blocks of the images retrieved by the RAG module to condition the\ntraining and generation stages of a block-wise denoising diffusion model. Our\nconditioning schemes ensure coherence across the different blocks during\ntraining and, consequently, during generation. While we showcase our approach\nusing the latent diffusion model (LDM) as the base model, it can be used with\nother variants of denoising diffusion models. We validate the solution of the\ncoherence problem through the proposed approach by reporting substantive\nexperiments to demonstrate our approach's effectiveness in compact model size\nand excellent generation quality.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"blDjK_topSp1osWg5_BW6WmjYHfOfBi7d8EaWACPjYk","pdfSize":"15008393"}
