{"id":"2408.04295","title":"Assigning Credit with Partial Reward Decoupling in Multi-Agent Proximal\n  Policy Optimization","authors":"Aditya Kapoor, Benjamin Freed, Howie Choset and Jeff Schneider","authorsParsed":[["Kapoor","Aditya",""],["Freed","Benjamin",""],["Choset","Howie",""],["Schneider","Jeff",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 08:18:05 GMT"}],"updateDate":"2024-08-09","timestamp":1723105085000,"abstract":"  Multi-agent proximal policy optimization (MAPPO) has recently demonstrated\nstate-of-the-art performance on challenging multi-agent reinforcement learning\ntasks. However, MAPPO still struggles with the credit assignment problem,\nwherein the sheer difficulty in ascribing credit to individual agents' actions\nscales poorly with team size. In this paper, we propose a multi-agent\nreinforcement learning algorithm that adapts recent developments in credit\nassignment to improve upon MAPPO. Our approach leverages partial reward\ndecoupling (PRD), which uses a learned attention mechanism to estimate which of\na particular agent's teammates are relevant to its learning updates. We use\nthis estimate to dynamically decompose large groups of agents into smaller,\nmore manageable subgroups. We empirically demonstrate that our approach,\nPRD-MAPPO, decouples agents from teammates that do not influence their expected\nfuture reward, thereby streamlining credit assignment. We additionally show\nthat PRD-MAPPO yields significantly higher data efficiency and asymptotic\nperformance compared to both MAPPO and other state-of-the-art methods across\nseveral multi-agent tasks, including StarCraft II. Finally, we propose a\nversion of PRD-MAPPO that is applicable to \\textit{shared} reward settings,\nwhere PRD was previously not applicable, and empirically show that this also\nleads to performance improvements over MAPPO.\n","subjects":["Computing Research Repository/Multiagent Systems","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hMIRuEVrf87aDBqU-K65IClubodkSRc60nvb7GcIE6c","pdfSize":"41950094"}
