{"id":"2408.00474","title":"Generalized hydrodynamics of integrable quantum circuits","authors":"Friedrich H\\\"ubner, Eric Vernier, Lorenzo Piroli","authorsParsed":[["Hübner","Friedrich",""],["Vernier","Eric",""],["Piroli","Lorenzo",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 11:25:26 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 09:51:10 GMT"},{"version":"v3","created":"Mon, 16 Sep 2024 13:37:55 GMT"}],"updateDate":"2024-09-17","timestamp":1722511526000,"abstract":"  Quantum circuits make it possible to simulate the continuous-time dynamics of\na many-body Hamiltonian by implementing discrete Trotter steps of duration\n$\\tau$. However, when $\\tau$ is sufficiently large, the discrete dynamics\nexhibit qualitative differences compared to the original evolution, potentially\ndisplaying novel features and many-body effects. We study an interesting\nexample of this phenomenon, by considering the integrable Trotterization of a\nprototypical integrable model, the XXZ Heisenberg spin chain. We focus on the\nwell-known bipartition protocol, where two halves of a large system are\nprepared in different macrostates and suddenly joined together, yielding\nnon-trivial nonequilibrium dynamics. Building upon recent results and adapting\nthe generalized hydrodynamics (GHD) of integrable models, we develop an exact\nlarge-scale description of an explicit one-dimensional quantum-circuit setting,\nwhere the input left and right qubits are initialized in two distinct product\nstates. We explore the phenomenology predicted by the GHD equations, which\ndepend on the Trotter step and the gate parameters. In some phases of the\nparameter space, we show that the quantum-circuit large-scale dynamics is\nqualitatively different compared to the continuous-time evolution. In\nparticular, we find that a single microscopic defect at the junction, such as\nthe addition of a single qubit, may change the nonequilibrium macrostate\nappearing at late time.\n","subjects":["Condensed Matter/Statistical Mechanics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}