{"id":"2408.04782","title":"Revisiting Aristotle vs. Ringelmann: The influence of biases on\n  measuring productivity in Open Source software development","authors":"Christian Gut and Alfredo Goldman","authorsParsed":[["Gut","Christian",""],["Goldman","Alfredo",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 22:49:22 GMT"}],"updateDate":"2024-08-12","timestamp":1723157362000,"abstract":"  Aristotle vs. Ringelmann was a discussion between two distinct research teams\nfrom the ETH Z\\\"urich who argued whether the productivity of Open Source\nsoftware projects scales sublinear or superlinear with regard to its team size.\nThis discussion evolved around two publications, which apparently used similar\ntechniques by sampling projects on GitHub and running regression analyses to\nanswer the question about superlinearity. Despite the similarity in their\nresearch methods, one team around Ingo Scholtes reached the conclusion that\nprojects scale sublinear, while the other team around Didier Sornette\nascertained a superlinear relationship between team size and productivity. In\nsubsequent publications, the two authors argue that the opposite conclusions\nmay be attributed to differences in project populations, since 81.7% of\nSornette's projects have less than 50 contributors. Scholtes, on the other\nhand, sampled specifically projects with more than 50 contributors.\n  This publication compares the research from both authors by replicating their\nfindings, thus allowing for an evaluation of how much project sampling actually\naccounted for the differences between Scholtes' and Sornette's results.\nThereby, the discovery was made that sampling bias only partially explains the\ndiscrepancies between the two authors. Further analysis led to the detection of\ninstrumentation biases that drove the regression coefficients in opposite\ndirections. These findings were then consolidated into a quantitative analysis,\nindicating that instrumentation biases contributed more to the differences\nbetween Scholtes' and Sornette's work than the selection bias suggested by both\nauthors.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"65hVRVAZ0fHbpT6nFIfdn85YIsg96O11Smas_qsp9uc","pdfSize":"1209904"}
