{"id":"2408.14300","title":"XRISM Spectroscopy of the Fe K$_{\\alpha}$ Emission Line in the Seyfert\n  AGN NGC 4151 Reveals the Disk, Broad Line Region, and Torus","authors":"XRISM Collaboration","authorsParsed":[["XRISM Collaboration","",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 14:31:20 GMT"}],"updateDate":"2024-08-27","timestamp":1724682680000,"abstract":"  We present an analysis of the first two XRISM/Resolve spectra of the\nwell-known Seyfert-1.5 active galactic nucleus in NGC 4151, obtained in\nDecember 2023. Our work focuses on the nature of the narrow Fe K$_{\\alpha}$\nemission line at 6.4 keV, the strongest and most common X-ray line observed in\nAGN. The total line is found to consist of three components. Even the narrowest\ncomponent of the line is resolved with evident Fe K$_{\\alpha,1}$ (6.404 keV)\nand K$_{\\alpha,2}$ (6.391 keV) contributions in a 2:1 flux ratio, fully\nconsistent with neutral gas with negligible bulk velocity. Subject to the\nlimitations of our models, the narrowest and intermediate-width components are\nconsistent with emission from optically thin gas, suggesting that they arise in\na disk atmosphere and/or wind. Modeling the three line components in terms of\nKeplerian broadening, they are readily associated with (1) the inner wall of\nthe ``torus,'' (2) the innermost optical ``broad line region'' (or, ``X-ray\nBLR''), and (3) a region with a radius of $r\\simeq 100~GM/c^{2}$ that may\nsignal a warp in the accretion disk. Viable alternative explanations of the\nbroadest component include a fast wind component and/or scattering; however, we\nfind evidence of variability in the narrow Fe K$_{\\alpha}$ line complex on time\nscales consistent with small radii. The best-fit models are statistically\nsuperior to simple Voigt functions, but when fit with Voigt profiles the\ntime-averaged lines are consistent with a projected velocity broadening of\nFWHM$=1600^{+400}_{-200}~{\\rm km}~{\\rm s}^{-1}$. Overall, the resolution and\nsensitivity of XRISM show that the narrow Fe K line in AGN is an effective\nprobe of all key parts of the accretion flow, as it is currently understood. We\ndiscuss the implications of these findings for our understanding of AGN\naccretion, future studies with XRISM, and X-ray-based black hole mass\nmeasurements.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}