{"id":"2408.13390","title":"High-redshift cosmography with a possible cosmic distance duality\n  relation violation","authors":"Jos\\'e F. Jesus, Mikael J. S. Gomes, Rodrigo F. L. Holanda and Rafael\n  C. Nunes","authorsParsed":[["Jesus","José F.",""],["Gomes","Mikael J. S.",""],["Holanda","Rodrigo F. L.",""],["Nunes","Rafael C.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 22:05:28 GMT"}],"updateDate":"2024-08-27","timestamp":1724450728000,"abstract":"  The Cosmic Distance Duality Relation (CDDR) defines a fundamental link in\nmodern cosmology between geometric distance measurements and redshift. Any\nobserved deviations from the CDDR could suggest the need for new physics beyond\nthe $\\Lambda$CDM model. In this study, we model geometric distances (both\nluminosity and angular) using a cosmographic expansion with the Pade method,\nwhich stabilizes the behavior of the cosmographic series at high redshifts.\nThis approach allows us to determine geometric distances independently of any\nspecific model. By incorporating updated data from supernovae (SN), baryon\nacoustic oscillations (BAO), and cosmic chronometers (CC), we obtain\nobservational constraints for parametric models that quantify the CDDR,\nalongside all baseline cosmographic parameters. We find that potential CDDR\nviolations introduce new statistical correlations in the cosmographic\nparameters ($H_0$, $q_0$, and $j_0$). However, within this framework, we do not\nobserve significant deviations from the CDDR, and our results remain consistent\nwith the predictions of the $\\Lambda$CDM model. This work offers a novel and\nstraightforward method for testing the CDDR by fixing background evolution\nthrough cosmographic techniques, thereby paving the way for new geometric\nobservational tests of possible deviations from standard cosmology.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}