{"id":"2408.08389","title":"Differentiating Three-Dimensional Molecular Structures using\n  Laser-induced Coulomb Explosion Imaging","authors":"Huynh Van Sa Lam and Anbu Selvam Venkatachalam and Surjendu\n  Bhattacharyya and Keyu Chen and Kurtis Borne and Enliang Wang and Rebecca\n  Boll and Till Jahnke and Vinod Kumarappan and Artem Rudenko and Daniel Rolles","authorsParsed":[["Lam","Huynh Van Sa",""],["Venkatachalam","Anbu Selvam",""],["Bhattacharyya","Surjendu",""],["Chen","Keyu",""],["Borne","Kurtis",""],["Wang","Enliang",""],["Boll","Rebecca",""],["Jahnke","Till",""],["Kumarappan","Vinod",""],["Rudenko","Artem",""],["Rolles","Daniel",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 19:13:12 GMT"}],"updateDate":"2024-08-19","timestamp":1723749192000,"abstract":"  Coulomb explosion imaging (CEI) with x-ray free electron lasers has recently\nbeen shown to be a powerful method for obtaining detailed structural\ninformation of gas-phase planar ring molecules [R. Boll et al. Nat. Phys. 18,\n423-428 (2022)]. In this Letter, we investigate the potential of CEI driven by\na tabletop laser and extend this approach to differentiating three-dimensional\n(3D) structures. We study the static CEI patterns of planar and nonplanar\norganic molecules that resemble the structures of typical products formed in\nring-opening reactions. Our results reveal that each molecule exhibits a\nwell-localized and distinctive pattern in 3D fragment-ion momentum space. We\nfind that these patterns yield direct information about the molecular\nstructures and can be qualitatively reproduced using a classical Coulomb\nexplosion simulation. Our findings suggest that laser-induced CEI can serve as\na robust method for differentiating molecular structures of organic ring and\nchain molecules. As such, it holds great promise as a method for following\nultrafast structural changes, e.g., during ring-opening reactions, by tracking\nthe motion of individual atoms in pump-probe experiments.\n","subjects":["Physics/Atomic and Molecular Clusters","Physics/Chemical Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}