{"id":"2408.00717","title":"ISDE with logarithmic interaction and characteristic polynomials","authors":"Theodoros Assiotis, Zahra Sadat Mirsajjadi","authorsParsed":[["Assiotis","Theodoros",""],["Mirsajjadi","Zahra Sadat",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 17:02:47 GMT"},{"version":"v2","created":"Sun, 25 Aug 2024 18:05:56 GMT"}],"updateDate":"2024-08-27","timestamp":1722531767000,"abstract":"  We consider certain random matrix eigenvalue dynamics, akin to Dyson Brownian\nmotion, introduced by Rider and Valko. We show that from every initial\ncondition, including ones involving coinciding coordinates, the dynamics,\nenhanced with more information, converge on path-space to a new\ninfinite-dimensional Feller-continuous diffusion process. We show that the\nlimiting diffusion solves an infinite-dimensional system of stochastic\ndifferential equations (ISDE) with logarithmic interaction. Moreover, we show\nconvergence in the long-time limit of the infinite-dimensional dynamics\nstarting from any initial condition to the equilibrium measure, given by the\ninverse points of the Bessel determinantal point process. As far as we can\ntell, this is: (a) the first path-space convergence result of random matrix\ndynamics starting from every initial condition to an infinite-dimensional\nFeller diffusion, (b) the first construction of solutions to an ISDE with\nlogarithmic interaction from every initial condition for which the singular\ndrift term can be defined at time $0$, (c) the first convergence to equilibrium\nresult from every initial condition for an ISDE of this kind. The argument\nsplits into two parts. The first part builds on the method of intertwiners\nintroduced and developed by Borodin and Olshanski. The main new ingredients are\na uniform, in a certain sense, approximation theorem of the spectrum of a\nfamily of random matrices indexed by an infinite-dimensional space and an\nextension of the method of intertwiners to deal with convergence to\nequilibrium. The second part introduces a new approach towards convergence of\nthe singular drift term in the dynamics and for showing non-intersection of the\nlimiting paths via certain ``characteristic polynomials\" associated to the\nprocess. We believe variations of it will be applicable to other\ninfinite-dimensional dynamics coming from random matrices.\n","subjects":["Mathematics/Probability","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}