{"id":"2408.13373","title":"Learning Unknowns from Unknowns: Diversified Negative Prototypes\n  Generator for Few-Shot Open-Set Recognition","authors":"Zhenyu Zhang, Guangyao Chen, Yixiong Zou, Yuhua Li, Ruixuan Li","authorsParsed":[["Zhang","Zhenyu",""],["Chen","Guangyao",""],["Zou","Yixiong",""],["Li","Yuhua",""],["Li","Ruixuan",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 21:14:03 GMT"}],"updateDate":"2024-08-27","timestamp":1724447643000,"abstract":"  Few-shot open-set recognition (FSOR) is a challenging task that requires a\nmodel to recognize known classes and identify unknown classes with limited\nlabeled data. Existing approaches, particularly Negative-Prototype-Based\nmethods, generate negative prototypes based solely on known class data.\nHowever, as the unknown space is infinite while the known space is limited,\nthese methods suffer from limited representation capability. To address this\nlimitation, we propose a novel approach, termed \\textbf{D}iversified\n\\textbf{N}egative \\textbf{P}rototypes \\textbf{G}enerator (DNPG), which adopts\nthe principle of \"learning unknowns from unknowns.\" Our method leverages the\nunknown space information learned from base classes to generate more\nrepresentative negative prototypes for novel classes. During the pre-training\nphase, we learn the unknown space representation of the base classes. This\nrepresentation, along with inter-class relationships, is then utilized in the\nmeta-learning process to construct negative prototypes for novel classes. To\nprevent prototype collapse and ensure adaptability to varying data\ncompositions, we introduce the Swap Alignment (SA) module. Our DNPG model, by\nlearning from the unknown space, generates negative prototypes that cover a\nbroader unknown space, thereby achieving state-of-the-art performance on three\nstandard FSOR datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}