{"id":"2408.01184","title":"A Short-Term Planning Framework for the Operation of Tanker-Based Water\n  Distribution Systems in Urban Areas","authors":"Abhilasha Maheshwari, Shamik Misra, Ravindra Gudi, Senthilmurugan\n  Subbiah","authorsParsed":[["Maheshwari","Abhilasha",""],["Misra","Shamik",""],["Gudi","Ravindra",""],["Subbiah","Senthilmurugan",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 11:12:36 GMT"}],"updateDate":"2024-08-05","timestamp":1722597156000,"abstract":"  Tanker-based distribution systems have been prevalent in developing countries\nto supply clean and pure water in different regions. To efficiently operate\nsuch tanker service systems, a large fleet of tanker trucks are required to\ntransport water among several water sources, water treatment plants and\nconsumers spanning across the regions. This requires tighter coordination\nbetween water suppliers, treatment plant operations, and user groups to use\navailable water resources in a sustainable manner, along with the assurance of\nwater quality and timely delivery. This paper proposes a novel formulation to\nassist decision-making for optimizing tanker-based water distribution systems\nand treatment operations, with an overall objective of minimizing the total\noperating cost such that all of the constraints related to the water demand,\nsupply operations, and environmental and social aspects are honored while\nsupplying water to a maximum number of users. The problem is formulated and\nsolved as a mixed integer linear programming (MILP) optimization framework and\ncaptures all of the nuances related to (i) water availability limitations and\nquality constraints from different sources, (ii) maintaining water quality as\nit transports via tankers, (iii) water demands for various end-use purposes,\nand (iv) transportation across a water supply chain. The proposed novel\nframework is applied to a realistic urban model to find the optimal tanker\ndelivery schedule, ensuring appropriate treatment and timely delivery of water.\nThe results of the case study conducted on a representative-scale problem also\nelucidate several aspects of treatment plant operation and consumer demand\nfulfillment for the efficient planning and management of tanker-based water\ndistribution systems.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"CBz8_M1cKm_1AFfEMhTkkcLGeX47VwVWncKrQciURNI","pdfSize":"1904347","txDigest":"Gg2mHZK5noJiB6o1AWbtP1DjL4aT8wx9UpcccDiaMiPy","endEpoch":"1","status":"CERTIFIED"}
