{"id":"2408.16912","title":"New theoretical instability regions and pulsational masses for blue\n  large-amplitude pulsators","authors":"Daniel Jadlovsk\\'y, Susmita Das, L\\'aszl\\'o Moln\\'ar","authorsParsed":[["Jadlovský","Daniel",""],["Das","Susmita",""],["Molnár","László",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 21:20:23 GMT"}],"updateDate":"2024-09-02","timestamp":1724966423000,"abstract":"  Blue large-amplitude pulsators (BLAPs) are a recently discovered group of hot\npulsating stars whose evolutionary status remains uncertain. We study the\npulsation characteristics of BLAPs for the two main mass scenarios, $ 0.3 - 0.4\n\\: \\rm M_{\\odot} $ and $ 0.7 - 1.1 \\: \\rm M_{\\odot} $, and compare them with\nobservations to find evidence for either scenario. We compute about a half\nmillion linear BLAP models using MESA-RSP and compare the linear pulsation\nperiods with the observed ranges of BLAP stars. For the low-mass scenario,\nBLAPs are in a region of the HR diagram where the growth rates are positive for\nthe fundamental mode, and the model periods correspond well to the observed\nones, assuming the reported luminosities of $ \\sim 200 \\: \\rm L_{\\odot} $. For\nthe high-mass scenario, pulsations in the first overtone dominate. Assuming a\nlarger range of luminosities, high-mass models could also explain all BLAPs,\nincluding the high-gravity BLAPs. Furthermore, we provide the first seismically\nconstrained mass estimate for the first double-mode BLAP star, OGLE-BLAP-030.\nWe find that a linear model with a mass of $ 0.62 \\: \\rm M_{\\odot} $ matches\nthe reported parameters of this star exactly, placing it in between the two\nmass scenarios. We also derive new period relations based on our models and all\navailable observed BLAPs, and we find that the derived relations also support\nthe low-mass scenario.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"260Z-buNzJ4RIaaSdWBzIXBj68RTH4WmOwPzsQPZpR4","pdfSize":"1420593"}
