{"id":"2408.15563","title":"Order-preserving pattern mining with forgetting mechanism","authors":"Yan Li, Chenyu Ma, Rong Gao, Youxi Wu, Jinyan Li, Wenjian Wang, and\n  Xindong Wu","authorsParsed":[["Li","Yan",""],["Ma","Chenyu",""],["Gao","Rong",""],["Wu","Youxi",""],["Li","Jinyan",""],["Wang","Wenjian",""],["Wu","Xindong",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 06:28:20 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 12:15:03 GMT"}],"updateDate":"2024-09-04","timestamp":1724826500000,"abstract":"  Order-preserving pattern (OPP) mining is a type of sequential pattern mining\nmethod in which a group of ranks of time series is used to represent an OPP.\nThis approach can discover frequent trends in time series. Existing OPP mining\nalgorithms consider data points at different time to be equally important;\nhowever, newer data usually have a more significant impact, while older data\nhave a weaker impact. We therefore introduce the forgetting mechanism into OPP\nmining to reduce the importance of older data. This paper explores the mining\nof OPPs with forgetting mechanism (OPF) and proposes an algorithm called\nOPF-Miner that can discover frequent OPFs. OPF-Miner performs two tasks,\ncandidate pattern generation and support calculation. In candidate pattern\ngeneration, OPF-Miner employs a maximal support priority strategy and a group\npattern fusion strategy to avoid redundant pattern fusions. For support\ncalculation, we propose an algorithm called support calculation with forgetting\nmechanism, which uses prefix and suffix pattern pruning strategies to avoid\nredundant support calculations. The experiments are conducted on nine datasets\nand 12 alternative algorithms. The results verify that OPF-Miner is superior to\nother competitive algorithms. More importantly, OPF-Miner yields good\nclustering performance for time series, since the forgetting mechanism is\nemployed.\n","subjects":["Computing Research Repository/Databases"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}