{"id":"2408.10102","title":"From Low- to High-Frequency QPOs around the Non-Rotating Hairy Horndeski\n  Black Hole: Microquasar GRS 1915+105","authors":"Orhan Donmez","authorsParsed":[["Donmez","Orhan",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 15:45:38 GMT"}],"updateDate":"2024-08-20","timestamp":1724082338000,"abstract":"  Research on the Horndeski black hole, associated with the scalar hairy\nparameter, offers insights into enigmatic cosmic phenomena such as dark matter.\nAdditionally, the numerical study of the GRS 1915+105 source, which exhibits\ncontinuous variability in X-ray observations, along with its physical\nproperties and mechanisms behind Quasi-periodic oscillations (QPOs)\nfrequencies, can contribute to observational studies. Motivated by this, we\nexamine the variations in physical mechanisms around the non-rotating Horndeski\nblack hole with Bondi-Hoyle-Lyttleton (BHL) accretion related to the scalar\nhair parameter and the resulting QPO frequencies. With a decrease in the scalar\nhair parameter, the shock cone opening angle narrows due to the influence of\nthe scalar field potential, and the stagnation point within the cone moves\ncloser to the black hole horizon. With the changing scalar hair parameter, the\nsimultaneous formation of the shock cone and bow shock is observed. Due to the\nintense increase in scalar potential, both the shock cone and bow shock\ndisappeared, and a cavity surrounding the black hole forms in the area where\nthe shock cone was. Additionally, QPO oscillations induced by the physical\nmechanisms observed in relation to the hair parameter are revealed through\nnumerical simulations. A broad range of QPO frequencies is observed, from low\nto high frequencies, with resonance states like 3:2 occurring. Lastly, we\ndefine the potential range of the spin parameter for the GRS 1915+105 source\nbased on the agreement between observational and numerical results. It has also\nbeen found that for most of the QPOs obtained from numerical calculations to be\nconsistent with observations, h/M should be greater than -0.5.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}