{"id":"2408.00225","title":"Scaling and assigning resources on ion trap QCCD architectures","authors":"Anabel Ovide, Daniele Cuomo and Carmen G. Almudever","authorsParsed":[["Ovide","Anabel",""],["Cuomo","Daniele",""],["Almudever","Carmen G.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 01:35:55 GMT"}],"updateDate":"2024-08-02","timestamp":1722476155000,"abstract":"  Ion trap technologies have earned significant attention as potential\ncandidates for quantum information processing due to their long decoherence\ntimes and precise manipulation of individual qubits, distinguishing them from\nother candidates in the field of quantum technologies. However, scalability\nremains a challenge, as introducing additional qubits into a trap increases\nnoise and heating effects, consequently decreasing operational fidelity.\nTrapped-ion Quantum Charge-Coupled Device (QCCD) architectures have addressed\nthis limitation by interconnecting multiple traps and employing ion shuttling\nmechanisms to transfer ions among traps. This new architectural design requires\nthe development of novel compilation techniques for quantum algorithms, which\nefficiently allocate and route qubits, and schedule operations. The aim of a\ncompiler is to minimize ion movements and, therefore, reduce the execution time\nof the circuit to achieve a higher fidelity.\n  In this paper, we propose a novel approach for initial qubit placement,\ndemonstrating enhancements of up to 50\\% compared to prior methods.\nFurthermore, we conduct a scalability analysis on two distinct QCCD topologies:\na 1D-linear array and a ring structure. Additionally, we evaluate the impact of\nthe excess capacity -- i.e. the number of free spaces within a trap -- on the\nalgorithm performance.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0HGDQRspNGoyc9N4cNz_RjuBHY5Y3pzVknYxY8t4dIw","pdfSize":"666978","txDigest":"4PUBzJKV2wXcWzQJXybdqW9CJoq7F9Euve1W6NZPoCvq","endEpoch":"1","status":"CERTIFIED"}
