{"id":"2408.09732","title":"Unraveling the untwisting process and upward mass transfer of a twisted\n  prominence driven by vortex motion","authors":"X. F. Zhang, G. P. Zhou, C. L. Jin, Y. Z. Zhang, G. W. Li, Z. H.\n  Shang, L. P. Li, S. B. Yang, S. H. Yang, and J. X. Wang","authorsParsed":[["Zhang","X. F.",""],["Zhou","G. P.",""],["Jin","C. L.",""],["Zhang","Y. Z.",""],["Li","G. W.",""],["Shang","Z. H.",""],["Li","L. P.",""],["Yang","S. B.",""],["Yang","S. H.",""],["Wang","J. X.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 06:36:33 GMT"}],"updateDate":"2024-08-20","timestamp":1724049393000,"abstract":"  Solar filaments/prominences are common features in the Sun's atmosphere that\ncontain cool chromospheric material suspended within the hot corona. However,\nthe intricate topology of these structures and the mechanisms driving their\ninstability and upward material transfer are not well understood. This study is\nto analyze a specific twisted prominence on February 10, 2021, and to explore\nits dynamics, including stability, motion, and material transfer. The study\nutilizes high-resolution H$\\alpha$ observations from the 1-m New Vacuum Solar\nTelescope and space-borne observations from the Solar Dynamics Observatory. We\nanalyzed the data to investigate the characteristics and behavior of the\ntwisted prominence. We also detected and measured the outflow speed surrounding\nthe prominence. The study reveals that the observed prominence exhibited a\nstretched and twisted structure at its apex, distinguishing it from familiar\ncloudy prominences. Following more than 30 hours of equilibrium, the prominence\ndestabilized, leading to a series of dynamic phenomena, such as vortex motion,\noscillations, resonations, untwisting, and the upward transfer of mass.\nConsequently, material from the top of the prominence was carried upward and\ndeposited into the overlying magnetic arcades. Noteworthy, outflows surrounding\nthe prominence were characterized by speeds exceeding 40 km $s^{-1}$. We\npropose, for the first time, a mechanism rooted in the K\\'arm\\'an Vortex Street\ninstability to explain the destabilization of the prominence. The estimated\ntypical Strouhal Number of 0.23$\\pm$0.06, which is related to vortex shedding,\nfalls within the expected range for the K\\'arm\\'an Vortex Street effect, as\npredicted by simulations. These discoveries provide new insights into the\ndynamics and fundamental topology of solar prominences and reveal a previously\nunknown mechanism for mass loading into the upper atmosphere.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}