{"id":"2408.13036","title":"S4D: Streaming 4D Real-World Reconstruction with Gaussians and 3D\n  Control Points","authors":"Bing He, Yunuo Chen, Guo Lu, Li Song, Wenjun Zhang","authorsParsed":[["He","Bing",""],["Chen","Yunuo",""],["Lu","Guo",""],["Song","Li",""],["Zhang","Wenjun",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 12:51:49 GMT"}],"updateDate":"2024-08-26","timestamp":1724417509000,"abstract":"  Recently, the dynamic scene reconstruction using Gaussians has garnered\nincreased interest. Mainstream approaches typically employ a global deformation\nfield to warp a 3D scene in the canonical space. However, the inherently\nlow-frequency nature of implicit neural fields often leads to ineffective\nrepresentations of complex motions. Moreover, their structural rigidity can\nhinder adaptation to scenes with varying resolutions and durations. To overcome\nthese challenges, we introduce a novel approach utilizing discrete 3D control\npoints. This method models local rays physically and establishes a\nmotion-decoupling coordinate system, which effectively merges traditional\ngraphics with learnable pipelines for a robust and efficient local\n6-degrees-of-freedom (6-DoF) motion representation. Additionally, we have\ndeveloped a generalized framework that incorporates our control points with\nGaussians. Starting from an initial 3D reconstruction, our workflow decomposes\nthe streaming 4D real-world reconstruction into four independent submodules: 3D\nsegmentation, 3D control points generation, object-wise motion manipulation,\nand residual compensation. Our experiments demonstrate that this method\noutperforms existing state-of-the-art 4D Gaussian Splatting techniques on both\nthe Neu3DV and CMU-Panoptic datasets. Our approach also significantly\naccelerates training, with the optimization of our 3D control points achievable\nwithin just 2 seconds per frame on a single NVIDIA 4070 GPU.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}