{"id":"2408.04708","title":"MulliVC: Multi-lingual Voice Conversion With Cycle Consistency","authors":"Jiawei Huang, Chen Zhang, Yi Ren, Ziyue Jiang, Zhenhui Ye, Jinglin\n  Liu, Jinzheng He, Xiang Yin, Zhou Zhao","authorsParsed":[["Huang","Jiawei",""],["Zhang","Chen",""],["Ren","Yi",""],["Jiang","Ziyue",""],["Ye","Zhenhui",""],["Liu","Jinglin",""],["He","Jinzheng",""],["Yin","Xiang",""],["Zhao","Zhou",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 18:12:51 GMT"}],"updateDate":"2024-08-12","timestamp":1723140771000,"abstract":"  Voice conversion aims to modify the source speaker's voice to resemble the\ntarget speaker while preserving the original speech content. Despite notable\nadvancements in voice conversion these days, multi-lingual voice conversion\n(including both monolingual and cross-lingual scenarios) has yet to be\nextensively studied. It faces two main challenges: 1) the considerable\nvariability in prosody and articulation habits across languages; and 2) the\nrarity of paired multi-lingual datasets from the same speaker. In this paper,\nwe propose MulliVC, a novel voice conversion system that only converts timbre\nand keeps original content and source language prosody without multi-lingual\npaired data. Specifically, each training step of MulliVC contains three\nsubsteps: In step one the model is trained with monolingual speech data; then,\nsteps two and three take inspiration from back translation, construct a\ncyclical process to disentangle the timbre and other information (content,\nprosody, and other language-related information) in the absence of\nmulti-lingual data from the same speaker. Both objective and subjective results\nindicate that MulliVC significantly surpasses other methods in both monolingual\nand cross-lingual contexts, demonstrating the system's efficacy and the\nviability of the three-step approach with cycle consistency. Audio samples can\nbe found on our demo page (mullivc.github.io).\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cdQpxChyST0OmNOXZsHNeGlDrlZZ5SSN5x6quQDVD5c","pdfSize":"1649941"}
