{"id":"2408.05563","title":"Impacts of Darwinian Evolution on Pre-trained Deep Neural Networks","authors":"Guodong Du, Runhua Jiang, Senqiao Yang, Haoyang Li, Wei Chen, Keren\n  Li, Sim Kuan Goh, Ho-Kin Tang","authorsParsed":[["Du","Guodong",""],["Jiang","Runhua",""],["Yang","Senqiao",""],["Li","Haoyang",""],["Chen","Wei",""],["Li","Keren",""],["Goh","Sim Kuan",""],["Tang","Ho-Kin",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 14:08:33 GMT"}],"updateDate":"2024-08-13","timestamp":1723298913000,"abstract":"  Darwinian evolution of the biological brain is documented through multiple\nlines of evidence, although the modes of evolutionary changes remain unclear.\nDrawing inspiration from the evolved neural systems (e.g., visual cortex), deep\nlearning models have demonstrated superior performance in visual tasks, among\nothers. While the success of training deep neural networks has been relying on\nback-propagation (BP) and its variants to learn representations from data, BP\ndoes not incorporate the evolutionary processes that govern biological neural\nsystems. This work proposes a neural network optimization framework based on\nevolutionary theory. Specifically, BP-trained deep neural networks for visual\nrecognition tasks obtained from the ending epochs are considered the primordial\nancestors (initial population). Subsequently, the population evolved with\ndifferential evolution. Extensive experiments are carried out to examine the\nrelationships between Darwinian evolution and neural network optimization,\nincluding the correspondence between datasets, environment, models, and living\nspecies. The empirical results show that the proposed framework has positive\nimpacts on the network, with reduced over-fitting and an order of magnitude\nlower time complexity compared to BP. Moreover, the experiments show that the\nproposed framework performs well on deep neural networks and big datasets.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}