{"id":"2408.03361","title":"GMAI-MMBench: A Comprehensive Multimodal Evaluation Benchmark Towards\n  General Medical AI","authors":"Pengcheng Chen, Jin Ye, Guoan Wang, Yanjun Li, Zhongying Deng, Wei Li,\n  Tianbin Li, Haodong Duan, Ziyan Huang, Yanzhou Su, Benyou Wang, Shaoting\n  Zhang, Bin Fu, Jianfei Cai, Bohan Zhuang, Eric J Seibel, Junjun He, Yu Qiao","authorsParsed":[["Chen","Pengcheng",""],["Ye","Jin",""],["Wang","Guoan",""],["Li","Yanjun",""],["Deng","Zhongying",""],["Li","Wei",""],["Li","Tianbin",""],["Duan","Haodong",""],["Huang","Ziyan",""],["Su","Yanzhou",""],["Wang","Benyou",""],["Zhang","Shaoting",""],["Fu","Bin",""],["Cai","Jianfei",""],["Zhuang","Bohan",""],["Seibel","Eric J",""],["He","Junjun",""],["Qiao","Yu",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 17:59:21 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 02:43:06 GMT"},{"version":"v3","created":"Fri, 9 Aug 2024 08:59:52 GMT"}],"updateDate":"2024-08-12","timestamp":1722967161000,"abstract":"  Large Vision-Language Models (LVLMs) are capable of handling diverse data\ntypes such as imaging, text, and physiological signals, and can be applied in\nvarious fields. In the medical field, LVLMs have a high potential to offer\nsubstantial assistance for diagnosis and treatment. Before that, it is crucial\nto develop benchmarks to evaluate LVLMs' effectiveness in various medical\napplications. Current benchmarks are often built upon specific academic\nliterature, mainly focusing on a single domain, and lacking varying perceptual\ngranularities. Thus, they face specific challenges, including limited clinical\nrelevance, incomplete evaluations, and insufficient guidance for interactive\nLVLMs. To address these limitations, we developed the GMAI-MMBench, the most\ncomprehensive general medical AI benchmark with well-categorized data structure\nand multi-perceptual granularity to date. It is constructed from 285 datasets\nacross 39 medical image modalities, 18 clinical-related tasks, 18 departments,\nand 4 perceptual granularities in a Visual Question Answering (VQA) format.\nAdditionally, we implemented a lexical tree structure that allows users to\ncustomize evaluation tasks, accommodating various assessment needs and\nsubstantially supporting medical AI research and applications. We evaluated 50\nLVLMs, and the results show that even the advanced GPT-4o only achieves an\naccuracy of 52%, indicating significant room for improvement. Moreover, we\nidentified five key insufficiencies in current cutting-edge LVLMs that need to\nbe addressed to advance the development of better medical applications. We\nbelieve that GMAI-MMBench will stimulate the community to build the next\ngeneration of LVLMs toward GMAI.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}