{"id":"2408.02761","title":"Dimensionality Reduction and Nearest Neighbors for Improving\n  Out-of-Distribution Detection in Medical Image Segmentation","authors":"McKell Woodland, Nihil Patel, Austin Castelo, Mais Al Taie, Mohamed\n  Eltaher, Joshua P. Yung, Tucker J. Netherton, Tiffany L. Calderone, Jessica\n  I. Sanchez, Darrel W. Cleere, Ahmed Elsaiey, Nakul Gupta, David Victor, Laura\n  Beretta, Ankit B. Patel, Kristy K. Brock","authorsParsed":[["Woodland","McKell",""],["Patel","Nihil",""],["Castelo","Austin",""],["Taie","Mais Al",""],["Eltaher","Mohamed",""],["Yung","Joshua P.",""],["Netherton","Tucker J.",""],["Calderone","Tiffany L.",""],["Sanchez","Jessica I.",""],["Cleere","Darrel W.",""],["Elsaiey","Ahmed",""],["Gupta","Nakul",""],["Victor","David",""],["Beretta","Laura",""],["Patel","Ankit B.",""],["Brock","Kristy K.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 18:24:48 GMT"},{"version":"v2","created":"Sat, 7 Sep 2024 21:46:43 GMT"}],"updateDate":"2024-09-10","timestamp":1722882288000,"abstract":"  Clinically deployed deep learning-based segmentation models are known to fail\non data outside of their training distributions. While clinicians review the\nsegmentations, these models tend to perform well in most instances, which could\nexacerbate automation bias. Therefore, detecting out-of-distribution images at\ninference is critical to warn the clinicians that the model likely failed. This\nwork applied the Mahalanobis distance (MD) post hoc to the bottleneck features\nof four Swin UNETR and nnU-net models that segmented the liver on T1-weighted\nmagnetic resonance imaging and computed tomography. By reducing the dimensions\nof the bottleneck features with either principal component analysis or uniform\nmanifold approximation and projection, images the models failed on were\ndetected with high performance and minimal computational load. In addition,\nthis work explored a non-parametric alternative to the MD, a k-th nearest\nneighbors distance (KNN). KNN drastically improved scalability and performance\nover MD when both were applied to raw and average-pooled bottleneck features.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nrsNXuRwng1btEoTxfb5YBjw_jVUYxB05y8K4YZ83nU","pdfSize":"5463642"}
