{"id":"2408.16831","title":"Mapping AGN winds: a connection between radio-mode AGN and the AGN\n  feedback cycle","authors":"Marco Alb\\'an, Dominika Wylezalek, Julia M. Comerford, Jenny E.\n  Greene, and Rogemar A. Riffel","authorsParsed":[["Albán","Marco",""],["Wylezalek","Dominika",""],["Comerford","Julia M.",""],["Greene","Jenny E.",""],["Riffel","Rogemar A.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:00:12 GMT"}],"updateDate":"2024-09-02","timestamp":1724954412000,"abstract":"  We present a kinematic analysis based on the large Integral Field\nSpectroscopy (IFS) dataset of SDSS-IV MaNGA (10.000 galaxies). We have compiled\na diverse sample of 594 unique Active Galactic Nuclei (AGN), identified through\na variety of independent selection techniques, encompassing radio (1.4 GHz)\nobservations, optical emission line diagnostics (BPT), broad Balmer emission\nlines, mid-infrared colors, and hard X-ray emission. We investigate how ionized\ngas kinematics behave in these different AGN populations through stacked radial\nprofiles of the [OIII]~5007 emission-line width across each AGN population. We\ncontrast AGN populations against each other (and non-AGN galaxies) by matching\nsamples by stellar mass, [OIII]~5007 luminosity, morphology, and redshift. We\nfind similar kinematics between AGN selected by BPT diagnostics compared to\nbroad-line selected AGN. We also identify a population of non-AGN with similar\nradial profiles as AGN, indicative of the presence of remnant outflows (or\nfossil outflows) of a past AGN activity. We find that purely radio-selected AGN\ndisplay enhanced ionized gas line widths across all radii. This suggests that\nour radio-selection technique is sensitive to a population where AGN-driven\nkinematic perturbations have been active for longer durations (potentially due\nto recurrent activity) than in purely optically selected AGN. This connection\nbetween radio activity and extended ionized gas outflow signatures is\nconsistent with recent evidence that suggests radio emission (expected to be\ndiffuse) originated due to shocks from outflows. We conclude that different\nselection techniques can trace different AGN populations not only in terms of\nenergetics but also in terms of AGN evolutionary stages. Our results are\nimportant in the context of AGN duty cycle and highlight IFU data's potential\nto deepen our knowledge of AGN and galaxy evolution.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lWYzs2VuZmDmnn28HL0YmXibUWw7RKdqiSrrJXiNS6k","pdfSize":"1728031"}
