{"id":"2408.10336","title":"The interior of Uranus: Thermal profile, bulk composition and the\n  distribution of rock, water and hydrogen and helium","authors":"Luca Morf, Simon M\\\"uller, Ravit Helled","authorsParsed":[["Morf","Luca",""],["Müller","Simon",""],["Helled","Ravit",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:21:28 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 07:28:09 GMT"}],"updateDate":"2024-08-22","timestamp":1724091688000,"abstract":"  We present improved empirical density profiles of Uranus and interpret them\nin terms of their temperature and composition using a new random algorithm. The\nalgorithm to determine the temperature and composition is agnostic with respect\nto the temperature gradient in non-isentropic regions and chooses randomly\namongst all possible gradients that are stable against convection and\ncorrespond to an Equation of State compatible composition. Our empirical models\nare based on an efficient implementation of the Theory of Figures up to 10th\norder including a proper treatment of the atmosphere. The accuracy of 10th\norder ToF enables us to present accurate calculations of the gravitational\nmoments of Uranus up to $J_{14}$: $J_{6} = ( 5.3078 \\pm 0.3312)\\cdot10^{-7}$,\n$J_{8} = (-1.1114 \\pm 0.1391)\\cdot10^{-8}$, $J_{10} = ( 2.8616 \\pm\n0.5466)\\cdot10^{-10}$, $J_{12} = (-8.4684 \\pm 2.0889)\\cdot10^{-12}$ and $J_{14}\n= ( 2.7508 \\pm 0.7944)\\cdot10^{-13}$. We consider two interior models of Uranus\nthat differ with respect to the maximal number of materials allowed per layer\nof Uranus (three vs. four composition components). The case with three\nmaterials does not allow Hydrogen and Helium in deeper parts of Uranus and\nresults in a higher water abundance which leads to lower central temperatures.\nOn the other hand, the models with four materials allow H-He to be mixed into\nthe deeper interior and lead to rock-dominated solutions. We find that these\nfour composition components models are less reliable due to the underlying\nempirical models incompatibility with realistic Brunt frequencies. Most of our\nmodels are found to be either purely convective with the exception of boundary\nlayers, or only convective in the outermost region. Almost all of our models\npossess a region that is convective and consists of ionic H$_{2}$O which could\nexplain the generation of Uranus' magnetic field.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LslJrnveEl_HcnjSb1Wurql4bjXiVIG-1tGy4xkBlQQ","pdfSize":"6406969"}
