{"id":"2408.16395","title":"IBO: Inpainting-Based Occlusion to Enhance Explainable Artificial\n  Intelligence Evaluation in Histopathology","authors":"Pardis Afshar, Sajjad Hashembeiki, Pouya Khani, Emad Fatemizadeh,\n  Mohammad Hossein Rohban","authorsParsed":[["Afshar","Pardis",""],["Hashembeiki","Sajjad",""],["Khani","Pouya",""],["Fatemizadeh","Emad",""],["Rohban","Mohammad Hossein",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 09:57:55 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 14:57:18 GMT"}],"updateDate":"2024-09-04","timestamp":1724925475000,"abstract":"  Histopathological image analysis is crucial for accurate cancer diagnosis and\ntreatment planning. While deep learning models, especially convolutional neural\nnetworks, have advanced this field, their \"black-box\" nature raises concerns\nabout interpretability and trustworthiness. Explainable Artificial Intelligence\n(XAI) techniques aim to address these concerns, but evaluating their\neffectiveness remains challenging. A significant issue with current\nocclusion-based XAI methods is that they often generate Out-of-Distribution\n(OoD) samples, leading to inaccurate evaluations. In this paper, we introduce\nInpainting-Based Occlusion (IBO), a novel occlusion strategy that utilizes a\nDenoising Diffusion Probabilistic Model to inpaint occluded regions in\nhistopathological images. By replacing cancerous areas with realistic,\nnon-cancerous tissue, IBO minimizes OoD artifacts and preserves data integrity.\nWe evaluate our method on the CAMELYON16 dataset through two phases: first, by\nassessing perceptual similarity using the Learned Perceptual Image Patch\nSimilarity (LPIPS) metric, and second, by quantifying the impact on model\npredictions through Area Under the Curve (AUC) analysis. Our results\ndemonstrate that IBO significantly improves perceptual fidelity, achieving\nnearly twice the improvement in LPIPS scores compared to the best existing\nocclusion strategy. Additionally, IBO increased the precision of XAI\nperformance prediction from 42% to 71% compared to traditional methods. These\nresults demonstrate IBO's potential to provide more reliable evaluations of XAI\ntechniques, benefiting histopathology and other applications. The source code\nfor this study is available at https://github.com/a-fsh-r/IBO.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}