{"id":"2408.15334","title":"The companion mass distribution of post common envelope hot subdwarf\n  binaries: evidence for boosted and disrupted magnetic braking?","authors":"Lisa Blomberg, Kareem El-Badry, Katelyn Breivik","authorsParsed":[["Blomberg","Lisa",""],["El-Badry","Kareem",""],["Breivik","Katelyn",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 18:00:07 GMT"}],"updateDate":"2024-08-29","timestamp":1724781607000,"abstract":"  We measure the mass distribution of main-sequence (MS) companions to hot\nsubdwarf B stars (sdBs) in post-common envelope binaries (PCEBs). We carried\nout a spectroscopic survey of 14 eclipsing systems (\"HW Vir binaries\") with\norbital periods of $3.8 < P_{\\rm orb} < 12$ hours, resulting in a\nwell-understood selection function and a near-complete sample of HW Vir\nbinaries with $G < 16$. We constrain companion masses from the radial velocity\ncurves of the sdB stars. The companion mass distribution peaks at $M_{\\rm\nMS}\\approx 0.15 M_{\\odot}$ and drops off at $M_{\\rm MS} > 0.2\\,M_{\\odot}$, with\nonly two systems hosting companions above the fully-convective limit. There is\nno correlation between $P_{\\rm orb}$ and $M_{\\rm MS}$ within the sample. A\nsimilar drop-off in the companion mass distribution of white dwarf (WD) + MS\nPCEBs has been attributed to disrupted magnetic braking (MB) below the\nfully-convective limit. We compare the sdB companion mass distribution to\npredictions of binary evolution simulations with a range of MB laws. Because\nsdBs have short lifetimes compared to WDs, explaining the lack of higher-mass\nMS companions to sdBs with disrupted MB requires MB to be boosted by a factor\nof 20-100 relative to MB laws inferred from the rotation evolution of single\nstars. We speculate that such boosting may be a result of irradiation-driven\nenhancement of the MS stars' winds. An alternative possibility is that common\nenvelope evolution favors low-mass companions in short-period orbits, but the\nexistence of massive WD companions to sdBs with similar periods disfavors this\nscenario.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}