{"id":"2408.08403","title":"High-speed micro-actuation in a supersonic dual-stream jet flow","authors":"Melissa Yeung, Datta V. Gaitonde, and Yiyang Sun","authorsParsed":[["Yeung","Melissa",""],["Gaitonde","Datta V.",""],["Sun","Yiyang",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 20:09:07 GMT"}],"updateDate":"2024-08-19","timestamp":1723752547000,"abstract":"  Supersonic shear layers experience instabilities that generate significant\nadverse effects; in complex configurations, these instabilities have global\nimpacts as they foster compounding complications with other independent flow\nfeatures. We consider the flow near the exit of a dual-stream rectangular\nnozzle, in which the supersonic core and sonic bypass streams mix downstream of\na splitter plate trailing edge (SPTE) just above an adjacent deck\nrepresentative of a wing surface. Active flow control is explored to alleviate\nthe prominent tone associated with vortices shed at the SPTE; these vortices\nalso initiate an unsteady shock system that affects the entire flow field\nthrough a shock-induced separation and the downstream evolution of plume shear\nlayers. Resolvent analysis is performed on the baseline flow. The identified\noptimal location guides the placement of steady-blowing micro-jet actuators. A\nNavier--Stokes-based parametric study is carried out to consider various\nactuation angles and locations. Since the resolvent analysis fundamentally\ninvestigates the input-output dynamics of a system, it is also utilized to\nuncover actuation-induced changes in the forcing-response dynamics. Spectral\nanalysis shows that the baseline flow fluctuating energy is concentrated in the\nshedding instability. Actuating at optimal angles based on location disperses\nthis energy into various flow features; this affects the shedding itself, and\nthe structure and unsteadiness of the shock system and thus the response of the\ndeck and nozzle wall boundary layers and the plume. The resolvent analysis\nindicates, and Navier-Stokes solutions confirm, that favorable control is\nobtained by either indirectly or directly mitigating the baseline instability.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}