{"id":"2408.02097","title":"Optimal policy for control of epidemics with constrained time intervals\n  and region-based interactions","authors":"Xia Li, Andrea L. Bertozzi, P. Jeffrey Brantingham, Yevgeniy\n  Vorobeychik","authorsParsed":[["Li","Xia",""],["Bertozzi","Andrea L.",""],["Brantingham","P. Jeffrey",""],["Vorobeychik","Yevgeniy",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 17:37:22 GMT"}],"updateDate":"2024-08-06","timestamp":1722793042000,"abstract":"  We introduce a policy model coupled with the susceptible-infected-recovered\n(SIR) epidemic model to study interactions between policy-making and the\ndynamics of epidemics. We consider both single-region policies, as well as\ngame-theoretic models involving interactions among several regions, and\nhierarchical interactions among policy-makers modeled as multi-layer games. We\nassume that the policy functions are piece-wise constant with a minimum time\ninterval for each policy stage, considering policies cannot change frequently\nin time or they cannot be easily followed. The optimal policy is obtained by\nminimizing a cost function which consists of an implementation cost, an impact\ncost, and, in the case of multi-layer games, a non-compliance cost. We show in\na case study of COVID-19 in France that when the cost function is reduced to\nthe impact cost and is parameterized as the final epidemic size, the solution\napproximates that of the optimal control in Bliman et al, J. Optim. Theory\nAppl., 189, 2021, for sufficiently small minimum policy time interval. For a\nlarger time interval however the optimal policy is a step down function, quite\ndifferent from the step up structure typically deployed during the COVID-19\npandemic. In addition, we present a counterfactual study of how the pandemic\nwould have evolved if herd immunity was reached during the second wave in the\ncounty of Los Angeles, California. Lastly, we study a case of three interacting\ncounties with and without a governing state.\n","subjects":["Mathematics/Optimization and Control","Mathematics/Dynamical Systems","Physics/Physics and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}