{"id":"2408.15067","title":"Systematic search for cool hypervelocity stars in multi-epoch WISE data","authors":"Sergey Karpov, Oleg Malkov, Alexandra Avdeeva","authorsParsed":[["Karpov","Sergey",""],["Malkov","Oleg",""],["Avdeeva","Alexandra",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 13:51:37 GMT"}],"updateDate":"2024-08-28","timestamp":1724766697000,"abstract":"  Sixty years after the discovery of brown dwarfs, the search for these objects\ncontinues, particularly in the vicinity of the Sun. Objects near the Sun are\ncharacterized by large proper motions, making them seen as fast-moving objects.\nWhile the Gaia DR3 catalogue is a comprehensive source of proper motions, it\nlacks the depth needed for discovering fainter objects. Modern multi-epoch\nsurveys, with their greater depth, offer a new opportunity for systematic\nsearch for ultra-cool dwarfs. The study aims to systematically search for high\nproper motion objects using the newly released catalogue of epochal WISE data\nin order to identify new brown dwarf candidates in the solar neighborhood,\nestimate their spectral types, distances and spatial velocities. We used\nrecently released unTimely catalogue of epochal detections in unWISE coadds to\nsearch for objects with high proper motions using simple motion detection\nalgorithm. This method was used to identify objects with proper motions\nexceeding approximately 0.6 arcseconds per year. The identified objects were\nthen cross-referenced with data from other large-scale sky surveys to further\nanalyze their characteristics. The search yielded 3245 moving objects with\nsignificant proper motions, 32 of which had not been previously published.\nAmong these, at least 15 were identified as reliable new brown dwarf\ncandidates, with estimated distances closer than 50 parsecs and spectral types\nlater than T0.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}