{"id":"2408.07171","title":"BVI-UGC: A Video Quality Database for User-Generated Content Transcoding","authors":"Zihao Qi, Chen Feng, Fan Zhang, Xiaozhong Xu, Shan Liu, David Bull","authorsParsed":[["Qi","Zihao",""],["Feng","Chen",""],["Zhang","Fan",""],["Xu","Xiaozhong",""],["Liu","Shan",""],["Bull","David",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 19:30:12 GMT"}],"updateDate":"2024-08-15","timestamp":1723577412000,"abstract":"  In recent years, user-generated content (UGC) has become one of the major\nvideo types consumed via streaming networks. Numerous research contributions\nhave focused on assessing its visual quality through subjective tests and\nobjective modeling. In most cases, objective assessments are based on a\nno-reference scenario, where the corresponding reference content is assumed not\nto be available. However, full-reference video quality assessment is also\nimportant for UGC in the delivery pipeline, particularly associated with the\nvideo transcoding process. In this context, we present a new UGC video quality\ndatabase, BVI-UGC, for user-generated content transcoding, which contains 60\n(non-pristine) reference videos and 1,080 test sequences. In this work, we\nsimulated the creation of non-pristine reference sequences (with a wide range\nof compression distortions), typical of content uploaded to UGC platforms for\ntranscoding. A comprehensive crowdsourced subjective study was then conducted\ninvolving more than 3,500 human participants. Based on this collected\nsubjective data, we benchmarked the performance of 10 full-reference and 11\nno-reference quality metrics. Our results demonstrate the poor performance\n(SROCC values are lower than 0.6) of these metrics in predicting the perceptual\nquality of UGC in two different scenarios (with or without a reference).\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"orjRhtQIEdd-rBfeV3WW0VHdp-8P9_XJdohXeCyk4us","pdfSize":"8678062"}
