{"id":"2408.05736","title":"Three types of solar coronal rain during magnetic reconnection between\n  open and closed magnetic structures","authors":"Fangfang Qiao, Leping Li, Hui Tian, Zhenyong Hou, Hongqiang Song,\n  Kaifan Ji, and Zheng Sun","authorsParsed":[["Qiao","Fangfang",""],["Li","Leping",""],["Tian","Hui",""],["Hou","Zhenyong",""],["Song","Hongqiang",""],["Ji","Kaifan",""],["Sun","Zheng",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 09:55:32 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 02:51:32 GMT"}],"updateDate":"2024-08-15","timestamp":1723370132000,"abstract":"  Coronal rain (CR) is a crucial part of the mass cycle between the corona and\nchromosphere. It includes the flare-driven CR and two types of quiescent CR\nseparately along the non-flaring active region closed loops and along the open\nstructures, labeled as types I, II, and III CR, respectively. Among them, types\nI and III CR are generally associated with magnetic reconnection. In this\nstudy, employing data taken by the Solar Dynamics Observatory (SDO) and the\nSolar Upper Transition Region Imager (SUTRI) on 2022 October 11, we report\nthree types of CR during an interchange reconnection between open and closed\nmagnetic filed structures above the southeastern solar limb. The open and\nclosed structures converge, with the formation of current sheet at the\ninterface, and reconnect. The newly-formed closed and open structures then\nrecede from the reconnection region. During the reconnection, coronal\ncondensation occurs along the reconnecting closed loops, and falls toward the\nsolar surface along both loop legs as the type II CR. Subsequently,\ncondensation happens in the newly-formed closed loops, and moves down toward\nthe solar surface along both loop legs as the type I CR. Magnetic dips of the\nreconnecting open structures form during the reconnection. In the dips,\ncondensation occurs, and propagates along the open structures toward the solar\nsurface as the type III CR. Our results suggest that the reconnection rate may\nbe crucial for the formation of types I and III CR during the reconnection.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}