{"id":"2408.13733","title":"Anatomical Consistency Distillation and Inconsistency Synthesis for\n  Brain Tumor Segmentation with Missing Modalities","authors":"Zheyu Zhang, Xinzhao Liu, Zheng Chen, Yueyi Zhang, Huanjing Yue,\n  Yunwei Ou, Xiaoyan Sun","authorsParsed":[["Zhang","Zheyu",""],["Liu","Xinzhao",""],["Chen","Zheng",""],["Zhang","Yueyi",""],["Yue","Huanjing",""],["Ou","Yunwei",""],["Sun","Xiaoyan",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 06:16:08 GMT"}],"updateDate":"2024-08-27","timestamp":1724566568000,"abstract":"  Multi-modal Magnetic Resonance Imaging (MRI) is imperative for accurate brain\ntumor segmentation, offering indispensable complementary information.\nNonetheless, the absence of modalities poses significant challenges in\nachieving precise segmentation. Recognizing the shared anatomical structures\nbetween mono-modal and multi-modal representations, it is noteworthy that\nmono-modal images typically exhibit limited features in specific regions and\ntissues. In response to this, we present Anatomical Consistency Distillation\nand Inconsistency Synthesis (ACDIS), a novel framework designed to transfer\nanatomical structures from multi-modal to mono-modal representations and\nsynthesize modality-specific features. ACDIS consists of two main components:\nAnatomical Consistency Distillation (ACD) and Modality Feature Synthesis Block\n(MFSB). ACD incorporates the Anatomical Feature Enhancement Block (AFEB),\nmeticulously mining anatomical information. Simultaneously, Anatomical\nConsistency ConsTraints (ACCT) are employed to facilitate the consistent\nknowledge transfer, i.e., the richness of information and the similarity in\nanatomical structure, ensuring precise alignment of structural features across\nmono-modality and multi-modality. Complementarily, MFSB produces\nmodality-specific features to rectify anatomical inconsistencies, thereby\ncompensating for missing information in the segmented features. Through\nvalidation on the BraTS2018 and BraTS2020 datasets, ACDIS substantiates its\nefficacy in the segmentation of brain tumors with missing MRI modalities.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}