{"id":"2408.17278","title":"Incorporating Memory into Continuous-Time Spatial Capture-Recapture\n  Models","authors":"Clara Panchaud, Ruth King, David Borchers, Hannah Worthington, Ian\n  Durbach and Paul Van Dam-Bates","authorsParsed":[["Panchaud","Clara",""],["King","Ruth",""],["Borchers","David",""],["Worthington","Hannah",""],["Durbach","Ian",""],["Van Dam-Bates","Paul",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 13:27:14 GMT"}],"updateDate":"2024-09-02","timestamp":1725024434000,"abstract":"  Obtaining reliable and precise estimates of wildlife species abundance and\ndistribution is essential for the conservation and management of animal\npopulations and natural reserves. Remote sensors such as camera traps are\nincreasingly employed to gather data on uniquely identifiable individuals.\nSpatial capture-recapture (SCR) models provide estimates of population and\nspatial density from such data. These models introduce spatial correlation\nbetween observations of the same individual through a latent activity center.\nHowever SCR models assume that observations are independent over time and\nspace, conditional on their given activity center, so that observed sightings\nat a given time and location do not influence the probability of being seen at\nfuture times and/or locations. With detectors like camera traps, this is\necologically unrealistic given the smooth movement of animals over space\nthrough time. We propose a new continuous-time modeling framework that\nincorporates both an individual's (latent) activity center and (known) previous\nlocation and time of detection. We demonstrate that standard SCR models can\nproduce substantially biased density estimates when there is correlation in the\ntimes and locations of detections, and that our new model performs\nsubstantially better than standard SCR models on data simulated through a\nmovement model as well as in a real camera trap study of American martens where\nan improvement in model fit is observed when incorporating the observed\nlocations and times of previous observations.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}