{"id":"2408.17013","title":"Inflation models with Peccei-Quinn symmetry and axion kinetic\n  misalignment","authors":"Hyun Min Lee, Adriana G. Menkara, Myeong-Jung Seong, Jun-Ho Song","authorsParsed":[["Lee","Hyun Min",""],["Menkara","Adriana G.",""],["Seong","Myeong-Jung",""],["Song","Jun-Ho",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 05:05:34 GMT"}],"updateDate":"2024-09-02","timestamp":1724994334000,"abstract":"  We propose a consistent framework with the $U(1)$ Peccei-Quinn (PQ) symmetry\nfor obtaining the initial condition for axion kinetic misalignment from\ninflation. We introduce a PQ complex scalar field and an extra Higgs doublet,\nwhich are conformally coupled to gravity, and three right-handed neutrinos for\nthe seesaw mechanism. In the DFSZ type scenarios for the axion, we obtain the\nPQ anomalies from the Standard Model quarks carrying nonzero PQ charges in some\nof two Higgs doublet models, solving the strong CP problem by the QCD potential\nfor the axion. Assuming that the PQ symmetry is explicitly violated in the\nscalar potential by quantum gravity effects, we show that a sufficiently large\ninitial axion velocity can be obtained at the end inflation while avoiding the\naxion quality problem. As inflation is driven by the radial distance from the\norigin in the space of scalar fields close to the pole of the kinetic terms in\nthe Einstein frame, we obtain successful inflationary predictions and set the\ninitial axion velocity at the end of inflation. Focusing on the pure PQ\ninflation with a small running quartic coupling for the PQ field, we discuss\nthe post-inflationary dynamics for the inflaton and the axion. As a result, we\nshow that a sufficiently high reheating temperature, can be obtained dominantly\nfrom the Higgs-portal couplings to the PQ field, while being consistent with\naxion kinetic misalignment, the stability for the Higgs fields during inflation\nand the non-restoration of the PQ symmetry after reheating.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}