{"id":"2408.12641","title":"Surrogate Constructed Scalable Circuits ADAPT-VQE in the Schwinger model","authors":"Erik Gustafson, Kyle Sherbert, Adrien Florio, Karunya Shirali, Yanzhu\n  Chen, Henry Lamm, Semeon Valgushev, Andreas Weichselbaum, Sophia E. Economou,\n  Robert D. Pisarski, Norm M. Tubman","authorsParsed":[["Gustafson","Erik",""],["Sherbert","Kyle",""],["Florio","Adrien",""],["Shirali","Karunya",""],["Chen","Yanzhu",""],["Lamm","Henry",""],["Valgushev","Semeon",""],["Weichselbaum","Andreas",""],["Economou","Sophia E.",""],["Pisarski","Robert D.",""],["Tubman","Norm M.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-26","timestamp":1724349600000,"abstract":"  Inspired by recent advancements of simulating periodic systems on quantum\ncomputers, we develop a new approach, (SC)$^2$-ADAPT-VQE, to further advance\nthe simulation of these systems. Our approach extends the scalable circuits\nADAPT-VQE framework, which builds an ansatz from a pool of coordinate-invariant\noperators defined for arbitrarily large, though not arbitrarily small, volumes.\nOur method uses a classically tractable ``Surrogate Constructed'' method to\nremove irrelevant operators from the pool, reducing the minimum size for which\nthe scalable circuits are defined. Bringing together the scalable circuits and\nthe surrogate constructed approaches forms the core of the (SC)$^2$\nmethodology. Our approach allows for a wider set of classical computations, on\nsmall volumes, which can be used for a more robust extrapolation protocol.\nWhile developed in the context of lattice models, the surrogate construction\nportion is applicable to a wide variety of problems where information about the\nrelative importance of operators in the pool is available. As an example, we\nuse it to compute properties of the Schwinger model - quantum electrodynamics\nfor a single, massive fermion in $1+1$ dimensions - and show that our method\ncan be used to accurately extrapolate to the continuum limit.\n","subjects":["Physics/Quantum Physics","Physics/High Energy Physics - Lattice"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}