{"id":"2408.09524","title":"Enhancing Quantum Memory Lifetime with Measurement-Free Local Error\n  Correction and Reinforcement Learning","authors":"Mincheol Park, Nishad Maskara, Marcin Kalinowski, Mikhail D. Lukin","authorsParsed":[["Park","Mincheol",""],["Maskara","Nishad",""],["Kalinowski","Marcin",""],["Lukin","Mikhail D.",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 16:18:21 GMT"}],"updateDate":"2024-08-20","timestamp":1723997901000,"abstract":"  Reliable quantum computation requires systematic identification and\ncorrection of errors that occur and accumulate in quantum hardware. To diagnose\nand correct such errors, standard quantum error-correcting protocols utilize\n$\\textit{global}$ error information across the system obtained by mid-circuit\nreadout of ancillary qubits. We investigate circuit-level error-correcting\nprotocols that are measurement-free and based on $\\textit{local}$ error\ninformation. Such a local error correction (LEC) circuit consists of faulty\nmulti-qubit gates to perform both syndrome extraction and ancilla-controlled\nerror removal. We develop and implement a reinforcement learning framework that\ntakes a fixed set of faulty gates as inputs and outputs an optimized LEC\ncircuit. To evaluate this approach, we quantitatively characterize an extension\nof logical qubit lifetime by a noisy LEC circuit. For the 2D classical Ising\nmodel and 4D toric code, our optimized LEC circuit performs better at extending\na memory lifetime compared to a conventional LEC circuit based on Toom's rule\nin a sub-threshold gate error regime. We further show that such circuits can be\nused to reduce the rate of mid-circuit readouts to preserve a 2D toric code\nmemory. Finally, we discuss the application of the LEC protocol on dissipative\npreparation of quantum states with topological phases.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Machine Learning","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}