{"id":"2408.03763","title":"Doping evolution of the normal state magnetic excitations in pressurized\n  La3Ni2O7","authors":"Hai-Yang Zhang, Yu-Jie Bai, Fan-Jie Kong, Xiu-Qiang Wu, Yu-Heng Xing,\n  and Ning Xu","authorsParsed":[["Zhang","Hai-Yang",""],["Bai","Yu-Jie",""],["Kong","Fan-Jie",""],["Wu","Xiu-Qiang",""],["Xing","Yu-Heng",""],["Xu","Ning",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 13:32:16 GMT"}],"updateDate":"2024-08-08","timestamp":1723037536000,"abstract":"  The doping evolution behaviors of the normal state magnetic excitations (MEs)\nof the nickelate La3Ni2O7 are theoretically studied in this paper. For a\nfilling of n = 3.0 which corresponds roughly to the material which realizes the\nsuperconductivity of about 80 K under moderately high pressures above 14 GPa,\nthe MEs exhibit a square-like pattern centered at (0,0) which originates from\nthe intrapocket particle-hole scatterings. Furthermore, it was found that the\nMEs show very strong modulations on the interlayer momentum qz. With the\nincreasing of qz, the patterns of the MEs change dramatically. In the large qz\nregime, they turn to be ruled by the interpocket excitation modes with\nsignificantly larger intensity which may play a vital role in the\nsuperconducting pairing. This hidden feature of the MEs was not revealed by\nprevious studies. The established features of the MEs are found to be very\nrobust against doping. They persist in the wide hole- or electron-doping regime\naround n = 3.0. However, in the heavily electron-doped regime, a Lifshitz\ntransition will occur. Consequently, the behaviors of the MEs change\nqualitatively across this transition. With the absence of the hole pocket, we\npredict that a strong tendency toward the spin-density-wave (SDW) order will\ndevelop due to the perfect nesting between the electron and the hole pockets at\nn = 4.0. Thus, we have investigated the normal state behaviors of the MEs and\ntheir doping evolutions which may shed light on the mechanism of\nsuperconductivity in pressurized La3Ni2O7.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rA62MXignMLtYp6Bp0zPln92Z1ezwWUT9ilr8tD5yVw","pdfSize":"1935038"}
