{"id":"2408.15839","title":"Particle acceleration, escape and non-thermal emission from\n  core-collapse supernovae inside non-identical wind-blown bubbles","authors":"Samata Das, Robert Brose, Martin Pohl, Dominique M.-A. Meyer, Iurii\n  Sushch","authorsParsed":[["Das","Samata",""],["Brose","Robert",""],["Pohl","Martin",""],["Meyer","Dominique M. -A.",""],["Sushch","Iurii",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 14:53:51 GMT"}],"updateDate":"2024-08-29","timestamp":1724856831000,"abstract":"  In the core-collapse scenario, the supernova remnants evolve inside the\ncomplex wind-blown bubbles, structured by massive progenitors during their\nlifetime. Therefore, particle acceleration and the emissions from these SNRs\ncan carry the fingerprints of the evolutionary sequences of the progenitor\nstars.\n  We time-dependently investigate the impact of the ambient environment of\ncore-collapse SNRs on particle spectra and the emissions. We use the RATPaC\ncode to model the particle acceleration at the SNRs with progenitors having\nZAMS masses of 20 Msol and 60 Msol. We have constructed the pre-supernova\ncircumstellar medium by solving the hydrodynamic equations for the lifetime of\nthe progenitor stars. Then, the transport equation for cosmic rays, and\nmagnetic turbulence in test-particle approximation along with the induction\nequation for the evolution of large-scale magnetic field have been solved\nsimultaneously with the hydrodynamic equations for the expansion of SNRs inside\nthe pre-supernova CSM.\n  The structure of the wind bubbles along with the magnetic field and the\nscattering turbulence regulate the spectra of accelerated particles for both\nSNRs. For the 60 Msol progenitor the spectral index reaches 2.4 even below 10\nGeV during the propagation of the SNR shock inside the hot shocked wind. In\ncontrast, we have not observed persistent soft spectra at earlier evolutionary\nstages of the SNR with 20 Msol progenitor, for which the spectral index becomes\n2.2 only for a brief period. Later, the spectra become soft above ~10 GeV for\nboth SNRs, as weak driving of turbulence permits the escape of high-energy\nparticles from the remnants. The emission morphology of the SNRs strongly\ndepends on the type of progenitors. For instance, the radio morphology of the\nSNR with 20 Msol progenitor is centre-filled at early stages whereas that for\nthe more massive progenitor is shell-like.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Y2OwhovhisiVu_CDmWi8GNtJkZ_EeltdgJeTXcIqQAo","pdfSize":"2408854"}
