{"id":"2408.02162","title":"Improvement and Empirical Testing of a Novel Autonomous\n  Microplastics-Collecting Semisubmersible","authors":"Ziddane Isahaku","authorsParsed":[["Isahaku","Ziddane",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 23:12:31 GMT"}],"updateDate":"2024-08-06","timestamp":1722813151000,"abstract":"  Since their invention, plastics have become ubiquitous in modern societies\nall around the world, and their impact on the environment has, in recent years,\nbecome nearly as well-known. Plastics produced by humans have reached nearly\nevery corner of the world, and throughout their centuries-long lifetimes,\nplastics continually break down into smaller and smaller particles due to the\nphysical stresses which they are subjected to. These stresses eventually,\ninevitably, break these plastics down into microplastics -pieces of plastic\nsmall enough to be consumed by organisms in bodies of water throughout the\nglobe. These microplastics can very easily bioaccumulate, and have been found\neverywhere from the Great Lakes to the bloodstreams of humans. The effects of\nthese plastics are poorly understood, however, they have been linked to\ninfertility, halted growth, and a host of other maladies in aquatic organisms.\nCurrently, removal of these plastics has been neglected, with no governmental\naction to remove them from marine environments, and this project aims to begin\nprototyping a solution to this issue. A significant percentage of microplastics\nare found at the surface of waterways, thus trawling in surface waters using an\nautonomously propelled net is proposed as a way to solve this seemingly\nintractable issue. By attaching motors and a guidance system to a manta trawl,\na device currently used for collecting microorganisms, the process of\ncollecting microplastics in open water can be automated, and thus the work of\nremoving plastics from the environment on a large scale can begin.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}