{"id":"2408.10054","title":"Quantum Register Machine: Efficient Implementation of Quantum Recursive\n  Programs","authors":"Zhicheng Zhang and Mingsheng Ying","authorsParsed":[["Zhang","Zhicheng",""],["Ying","Mingsheng",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 14:48:41 GMT"}],"updateDate":"2024-08-20","timestamp":1724078921000,"abstract":"  Quantum recursive programming has been recently introduced for describing\nsophisticated and complicated quantum algorithms in a compact and elegant way.\nHowever, implementation of quantum recursion involves intricate interplay\nbetween quantum control flows and recursive procedure calls. In this paper, we\naim at resolving this fundamental challenge and develop a series of techniques\nto efficiently implement quantum recursive programs. Our main contributions\ninclude:\n  1. We propose a notion of quantum register machine, the first purely quantum\narchitecture (including an instruction set) that supports quantum control flows\nand recursive procedure calls at the same time.\n  2. Based on quantum register machine, we describe the first comprehensive\nimplementation process of quantum recursive programs, including the\ncompilation, the partial evaluation of quantum control flows, and the execution\non the quantum register machine.\n  3. As a bonus, our efficient implementation of quantum recursive programs\nalso offers automatic parallelisation of quantum algorithms. For implementing\ncertain quantum algorithmic subroutine, like the widely used quantum\nmultiplexor, we can even obtain exponential parallel speed-up (over the\nstraightforward implementation) from this automatic parallelisation. This\ndemonstrates that quantum recursive programming can be win-win for both\nmodularity of programs and efficiency of their implementation.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Hardware Architecture","Computing Research Repository/Programming Languages"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}