{"id":"2408.00443","title":"An Experimental Evaluation of TEE technology Evolution: Benchmarking\n  Transparent Approaches based on SGX, SEV, and TDX","authors":"Luigi Coppolino, Salvatore D'Antonio, Davide Iasio, Giovanni Mazzeo,\n  and Luigi Romano","authorsParsed":[["Coppolino","Luigi",""],["D'Antonio","Salvatore",""],["Iasio","Davide",""],["Mazzeo","Giovanni",""],["Romano","Luigi",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 10:29:11 GMT"}],"updateDate":"2024-08-02","timestamp":1722508151000,"abstract":"  Protection of data-in-use is a key priority, for which Trusted Execution\nEnvironment (TEE) technology has unarguably emerged as a, possibly the most,\npromising solution. Multiple server-side TEE offerings have been released over\nthe years, exhibiting substantial differences with respect to several aspects.\nThe first comer was Intel SGX, which featured Process-based TEE protection, an\nefficient yet difficult to use approach. Some SGX limitations were (partially)\novercome by runtimes, notably: Gramine, Scone, and Occlum. A major paradigm\nshift was later brought by AMD SEV, with VM-based TEE protection, which enabled\nlift-and-shift deployment of legacy applications. This new paradigm has been\nimplemented by Intel only recently, in TDX. While the threat model of the\naforementioned TEE solutions has been widely discussed, a thorough performance\ncomparison is still lacking in the literature. This paper provides a\ncomparative evaluation of TDX, SEV, Gramine-SGX, and Occlum-SGX. We study\ncomputational overhead and resource usage, under different operational\nscenarios and using a diverse suite of legacy applications. By doing so, we\nprovide a reliable performance assessment under realistic conditions. We\nexplicitly emphasize that, at the time of writing, TDX was not yet available to\nthe public. Thus, the evaluation of TDX is a unique feature of this study.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"H_7wHr5iW2Ib9ZPseK2s9mCKRLjaEEtrl5FcgqmFol8","pdfSize":"31873522"}
