{"id":"2408.04927","title":"Large Models for Aerial Edges: An Edge-Cloud Model Evolution and\n  Communication Paradigm","authors":"Shuhang Zhang, Qingyu Liu, Ke Chen, Boya Di, Hongliang Zhang, Wenhan\n  Yang, Dusit Niyato, Zhu Han, and H. Vincent Poor","authorsParsed":[["Zhang","Shuhang",""],["Liu","Qingyu",""],["Chen","Ke",""],["Di","Boya",""],["Zhang","Hongliang",""],["Yang","Wenhan",""],["Niyato","Dusit",""],["Han","Zhu",""],["Poor","H. Vincent",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 08:16:08 GMT"}],"updateDate":"2024-08-12","timestamp":1723191368000,"abstract":"  The future sixth-generation (6G) of wireless networks is expected to surpass\nits predecessors by offering ubiquitous coverage through integrated air-ground\nfacility deployments in both communication and computing domains. In this\nnetwork, aerial facilities, such as unmanned aerial vehicles (UAVs), conduct\nartificial intelligence (AI) computations based on multi-modal data to support\ndiverse applications including surveillance and environment construction.\nHowever, these multi-domain inference and content generation tasks require\nlarge AI models, demanding powerful computing capabilities, thus posing\nsignificant challenges for UAVs. To tackle this problem, we propose an\nintegrated edge-cloud model evolution framework, where UAVs serve as edge nodes\nfor data collection and edge model computation. Through wireless channels, UAVs\ncollaborate with ground cloud servers, providing cloud model computation and\nmodel updating for edge UAVs. With limited wireless communication bandwidth,\nthe proposed framework faces the challenge of information exchange scheduling\nbetween the edge UAVs and the cloud server. To tackle this, we present joint\ntask allocation, transmission resource allocation, transmission data\nquantization design, and edge model update design to enhance the inference\naccuracy of the integrated air-ground edge-cloud model evolution framework by\nmean average precision (mAP) maximization. A closed-form lower bound on the mAP\nof the proposed framework is derived, and the solution to the mAP maximization\nproblem is optimized accordingly. Simulations, based on results from\nvision-based classification experiments, consistently demonstrate that the mAP\nof the proposed framework outperforms both a centralized cloud model framework\nand a distributed edge model framework across various communication bandwidths\nand data sizes.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"35zPz44VrWsrNYqRmwZ1ux4iW1okGisAU3PbMcnWbzo","pdfSize":"1329710"}
