{"id":"2408.02685","title":"Artificial Neural Networks for Photonic Applications: From Algorithms to\n  Implementation","authors":"Pedro Freire, Egor Manuylovich, Jaroslaw E. Prilepsky and Sergei K.\n  Turitsy","authorsParsed":[["Freire","Pedro",""],["Manuylovich","Egor",""],["Prilepsky","Jaroslaw E.",""],["Turitsy","Sergei K.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 08:22:49 GMT"}],"updateDate":"2024-08-07","timestamp":1722586969000,"abstract":"  This tutorial-review on applications of artificial neural networks in\nphotonics targets a broad audience, ranging from optical research and\nengineering communities to computer science and applied mathematics. We focus\nhere on the research areas at the interface between these disciplines,\nattempting to find the right balance between technical details specific to each\ndomain and overall clarity. First, we briefly recall key properties and\npeculiarities of some core neural network types, which we believe are the most\nrelevant to photonics, also linking the layer's theoretical design to some\nphotonics hardware realizations. After that, we elucidate the question of how\nto fine-tune the selected model's design to perform the required task with\noptimized accuracy. Then, in the review part, we discuss recent developments\nand progress for several selected applications of neural networks in photonics,\nincluding multiple aspects relevant to optical communications, imaging,\nsensing, and the design of new materials and lasers. In the following section,\nwe put a special emphasis on how to accurately evaluate the complexity of\nneural networks in the context of the transition from algorithms to hardware\nimplementation. The introduced complexity characteristics are used to analyze\nthe applications of neural networks in optical communications, as a specific,\nalbeit highly important example, comparing those with some benchmark signal\nprocessing methods. We combine the description of the well-known model\ncompression strategies used in machine learning, with some novel techniques\nintroduced recently in optical applications of neural networks. It is important\nto stress that although our focus in this tutorial-review is on photonics, we\nbelieve that the methods and techniques presented here can be handy in a much\nwider range of scientific and engineering applications.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Signal Processing","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}