{"id":"2408.10999","title":"Constraining Extra Mixing during the Main Sequence: What Depletes\n  Lithium Does Not Touch Beryllium","authors":"Henrique Reggiani, Jhon Yana Galarza, Diego Lorenzo-Oliveira, Sofia\n  Covarrubias, Micaela Oyague, Rita Valle, Julio Chanam\\'e","authorsParsed":[["Reggiani","Henrique",""],["Galarza","Jhon Yana",""],["Lorenzo-Oliveira","Diego",""],["Covarrubias","Sofia",""],["Oyague","Micaela",""],["Valle","Rita",""],["Chanamé","Julio",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 16:50:29 GMT"}],"updateDate":"2024-08-21","timestamp":1724172629000,"abstract":"  Measurement of lithium abundances in solar-type stars have shown that\nstandard models of stellar evolution are incapable of explaining the observed\ndepletion as a function of stellar age. Beryllium is one of the lightest\nelements that can be measured in stellar photospheres, and it can be burned in\nrelatively low temperatures. Studying its abundances as a function of stellar\nage can provide important constraints to stellar mixing models, as the level of\ndepletion as a function of time will indicate how deep the photospheric\nmaterial must be dredged to explain the observed abundances of both elements.\nIn an effort to provide the most stringent constraints for non-standard stellar\nmixing models, we observed a sample of solar-twins and concomitantly analyzed\ntheir lithium and beryllium abundances. Unlike what is typically observed for\nlithium, we find that beryllium does not decrease as a function of stellar age,\nconstraining models that predict burning of both materials. Based on our data,\nmodels that invoke convective overshoot and convective settling are preferred\nover typical rotationaly-induced mixing models, as the later burn Be in excess\nwhile the former do not. Previous works also proposed mixing due to gravity\nwaves as a possible explanation for observed abundances, which can fit our data\nas well. We also confirm previous finds of an increase in Be abundance as a\nfunction of metallicity, indicative of galactic production via cosmic ray\nspallation.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dTzIyQ16MBkIQ_fAYRJE5t1CYL7v1LrlNqdyl_jwbMI","pdfSize":"694092"}
