{"id":"2408.05420","title":"Facilitating bootstrapped and rarefaction-based microbiome diversity\n  analysis with q2-boots","authors":"Isaiah Raspet, Elizabeth Gehret, Chloe Herman, Jeff Meilander, Andrew\n  Manley, Anthony Simard, Evan Bolyen, J. Gregory Caporaso","authorsParsed":[["Raspet","Isaiah",""],["Gehret","Elizabeth",""],["Herman","Chloe",""],["Meilander","Jeff",""],["Manley","Andrew",""],["Simard","Anthony",""],["Bolyen","Evan",""],["Caporaso","J. Gregory",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 03:12:15 GMT"}],"updateDate":"2024-08-13","timestamp":1723259535000,"abstract":"  Background: We present q2-boots, a QIIME 2 plugin that facilitates\nbootstrapped and rarefaction-based microbiome diversity analysis. This plugin\nprovides eight new actions that allow users to apply any of thirty different\nalpha diversity metrics and twenty-two beta diversity metrics to bootstrapped\nor rarefied feature tables, using a single QIIME 2 Pipeline command, or more\ngranular QIIME 2 Action commands.\n  Results: Given a feature table, an even sampling depth, and the number of\niterations to perform (n), the command qiime boots core-metrics will resample\nthe feature table n times and compute alpha and beta diversity metrics on each\nresampled table. The results will be integrated in summary data artifacts that\nare identical in structure and type to results that would be generated by\napplying diversity metrics to a single table. This enables all of the same\ndownstream analytic tools to be applied to these tables, and ensures that all\ncollected data is considered when computing microbiome diversity metrics.\n  Conclusions: A challenge of this work was deciding how to integrate distance\nmatrices that were computed on n resampled feature tables, as a simple average\nof pairwise distances (median or mean) does not account for the structure of\ndistance matrices. q2-boots provides three options, and we show here that the\nresults of these approaches are highly correlated. q2-boots is free and open\nsource. Source code, installation instructions, and a tutorial can be found at\nhttps://github.com/caporaso-lab/q2-boots.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"cOE6uR2nZ6CalXvlmBIai1jF5ZjoIQR9xjzlN2xK1CE","pdfSize":"620144"}
