{"id":"2408.07752","title":"Hybrid entanglement and error correction in a scalable quantum network\n  node","authors":"Xiu-Ying Chang, Pan-Yu Hou, Wen-Gang Zhang, Xiang-Qian Meng, Ye-Fei\n  Yu, Ya-Nan Lu, Yan-Qing Liu, Bin-Xiang Qi, Dong-Ling Deng, Lu-Ming Duan","authorsParsed":[["Chang","Xiu-Ying",""],["Hou","Pan-Yu",""],["Zhang","Wen-Gang",""],["Meng","Xiang-Qian",""],["Yu","Ye-Fei",""],["Lu","Ya-Nan",""],["Liu","Yan-Qing",""],["Qi","Bin-Xiang",""],["Deng","Dong-Ling",""],["Duan","Lu-Ming",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 18:01:49 GMT"}],"updateDate":"2024-08-16","timestamp":1723658509000,"abstract":"  Recent breakthroughs have ushered the quantum network into a new era, where\nquantum information can be stored, transferred, and processed across multiple\nnodes on a metropolitan scale. A key challenge in this new era is enhancing the\ncapabilities of individual nodes, providing precise and robust control over\nmultiple qubits and advanced functionality for scalable quantum networks. Here,\nwe report on precise and complex control in a hybrid quantum node based on a\ndiamond color center. We demonstrate hybrid coherent control by entangling\nthree types of qubits: an electron spin as an interface qubit, a nuclear spin\nwith long memory time, and a flying photonic qubit, with their qubit\nfrequencies spanning three distinct regimes from the optical domain to the rf\ndomain. By incorporating two additional memory qubits, we encode three memory\nqubits into a logical state using the three-qubit repetition code and entangle\nthis logical qubit with a photonic qubit. Leveraging hybrid qubits and precise\ncontrol, we repeatedly read out the error syndromes of memory qubits through\nthe electron spin, serving as an auxiliary qubit, then apply a real-time\nfeedback operation to correct bit-flip errors. We execute and verify active\nerror correction for up to twelve rounds and demonstrate the improvement over\nthe uncorrected counterpart. Our results demonstrate the feasibility of several\nkey functionalities for next-generation quantum repeaters, paving the way\ntowards full-fledged metropolitan-scale quantum networks for a wide range of\npractical applications.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}