{"id":"2408.11480","title":"OAPT: Offset-Aware Partition Transformer for Double JPEG Artifacts\n  Removal","authors":"Qiao Mo, Yukang Ding, Jinhua Hao, Qiang Zhu, Ming Sun, Chao Zhou,\n  Feiyu Chen, Shuyuan Zhu","authorsParsed":[["Mo","Qiao",""],["Ding","Yukang",""],["Hao","Jinhua",""],["Zhu","Qiang",""],["Sun","Ming",""],["Zhou","Chao",""],["Chen","Feiyu",""],["Zhu","Shuyuan",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 09:47:54 GMT"}],"updateDate":"2024-08-22","timestamp":1724233674000,"abstract":"  Deep learning-based methods have shown remarkable performance in single JPEG\nartifacts removal task. However, existing methods tend to degrade on double\nJPEG images, which are prevalent in real-world scenarios. To address this\nissue, we propose Offset-Aware Partition Transformer for double JPEG artifacts\nremoval, termed as OAPT. We conduct an analysis of double JPEG compression that\nresults in up to four patterns within each 8x8 block and design our model to\ncluster the similar patterns to remedy the difficulty of restoration. Our OAPT\nconsists of two components: compression offset predictor and image\nreconstructor. Specifically, the predictor estimates pixel offsets between the\nfirst and second compression, which are then utilized to divide different\npatterns. The reconstructor is mainly based on several Hybrid Partition\nAttention Blocks (HPAB), combining vanilla window-based self-attention and\nsparse attention for clustered pattern features. Extensive experiments\ndemonstrate that OAPT outperforms the state-of-the-art method by more than\n0.16dB in double JPEG image restoration task. Moreover, without increasing any\ncomputation cost, the pattern clustering module in HPAB can serve as a plugin\nto enhance other transformer-based image restoration methods. The code will be\navailable at https://github.com/QMoQ/OAPT.git .\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}