{"id":"2408.02217","title":"Climate-Driven Doubling of Maize Loss Probability in U.S. Crop\n  Insurance: Spatiotemporal Prediction and Possible Policy Responses","authors":"A Samuel Pottinger, Lawson Connor, Brookie Guzder-Williams, Maya\n  Weltman-Fahs, Timothy Bowles","authorsParsed":[["Pottinger","A Samuel",""],["Connor","Lawson",""],["Guzder-Williams","Brookie",""],["Weltman-Fahs","Maya",""],["Bowles","Timothy",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 03:38:38 GMT"}],"updateDate":"2024-08-06","timestamp":1722829118000,"abstract":"  Climate change not only threatens agricultural producers but also strains\nfinancial institutions. These important food system actors include government\nentities tasked with both insuring grower livelihoods and supporting response\nto continued global warming. We use an artificial neural network to predict\nfuture maize yields in the U.S. Corn Belt, finding alarming changes to\ninstitutional risk exposure within the Federal Crop Insurance Program.\nSpecifically, our machine learning method anticipates more frequent and more\nsevere yield losses that would result in the annual probability of Yield\nProtection (YP) claims to more than double at mid-century relative to\nsimulations without continued climate change. Furthermore, our dual finding of\nrelatively unchanged average yields paired with decreasing yield stability\nreveals targeted opportunities to adjust coverage formulas to include\nvariability. This important structural shift may help regulators support grower\nadaptation to continued climate change by recognizing the value of\nrisk-reducing strategies such as regenerative agriculture. Altogether, paired\nwith open source interactive tools for deeper investigation, our risk profile\nsimulations fill an actionable gap in current understanding, bridging granular\nhistoric yield estimation and climate-informed prediction of future\ninsurer-relevant loss.\n","subjects":["Computing Research Repository/Machine Learning","Quantitative Finance/Risk Management"],"license":"http://creativecommons.org/licenses/by/4.0/"}