{"id":"2408.05449","title":"Unidirectional imaging with partially coherent light","authors":"Guangdong Ma, Che-Yung Shen, Jingxi Li, Luzhe Huang, Cagatay Isil,\n  Fazil Onuralp Ardic, Xilin Yang, Yuhang Li, Yuntian Wang, Md Sadman Sakib\n  Rahman, Aydogan Ozcan","authorsParsed":[["Ma","Guangdong",""],["Shen","Che-Yung",""],["Li","Jingxi",""],["Huang","Luzhe",""],["Isil","Cagatay",""],["Ardic","Fazil Onuralp",""],["Yang","Xilin",""],["Li","Yuhang",""],["Wang","Yuntian",""],["Rahman","Md Sadman Sakib",""],["Ozcan","Aydogan",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 06:01:06 GMT"}],"updateDate":"2024-08-13","timestamp":1723269666000,"abstract":"  Unidirectional imagers form images of input objects only in one direction,\ne.g., from field-of-view (FOV) A to FOV B, while blocking the image formation\nin the reverse direction, from FOV B to FOV A. Here, we report unidirectional\nimaging under spatially partially coherent light and demonstrate high-quality\nimaging only in the forward direction (A->B) with high power efficiency while\ndistorting the image formation in the backward direction (B->A) along with low\npower efficiency. Our reciprocal design features a set of spatially engineered\nlinear diffractive layers that are statistically optimized for partially\ncoherent illumination with a given phase correlation length. Our analyses\nreveal that when illuminated by a partially coherent beam with a correlation\nlength of ~1.5 w or larger, where w is the wavelength of light, diffractive\nunidirectional imagers achieve robust performance, exhibiting asymmetric\nimaging performance between the forward and backward directions - as desired. A\npartially coherent unidirectional imager designed with a smaller correlation\nlength of less than 1.5 w still supports unidirectional image transmission, but\nwith a reduced figure of merit. These partially coherent diffractive\nunidirectional imagers are compact (axially spanning less than 75 w),\npolarization-independent, and compatible with various types of illumination\nsources, making them well-suited for applications in asymmetric visual\ninformation processing and communication.\n","subjects":["Physics/Optics","Computing Research Repository/Computer Vision and Pattern Recognition","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}