{"id":"2408.02625","title":"Selective pruning and neuronal death generate heavy-tail network\n  connectivity","authors":"Rodrigo Siqueira Kazu and Kleber Neves and Bruno Mota","authorsParsed":[["Kazu","Rodrigo Siqueira",""],["Neves","Kleber",""],["Mota","Bruno",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 16:49:41 GMT"}],"updateDate":"2024-08-06","timestamp":1722876581000,"abstract":"  From the proliferative mechanisms generating neurons from progenitor cells to\nneuron migration and synaptic connection formation, several vicissitudes\nculminate in the mature brain. Both component loss and gain remain ubiquitous\nduring brain development. For example, rodent brains lose over half of their\ninitial neurons and synapses during healthy development. The role of\ndeleterious steps in network ontogeny remains unclear, yet it is unlikely these\ncostly processes are random. Like neurogenesis and synaptogenesis, synaptic\npruning and neuron death likely evolved to support complex, efficient\ncomputations. In order to incorporate both component loss and gain in\ndescribing neuronal networks, we propose an algorithm where a directed network\nevolves through the selective deletion of less-connected nodes (neurons) and\nedges (synapses). Resulting in networks that display scale-invariant degree\ndistributions, provided the network is predominantly feed-forward.\nScale-invariance offers several advantages in biological networks: scalability,\nresistance to random deletions, and strong connectivity with parsimonious\nwiring. Whilst our algorithm is not intended to be a realistic model of\nneuronal network formation, our results suggest selective deletion is an\nadaptive mechanism contributing to more stable and efficient networks. This\nprocess aligns with observed decreasing pruning rates in animal studies,\nresulting in higher synapse preservation. Our overall findings have broader\nimplications for network science. Scale-invariance in degree distributions was\ndemonstrated in growing preferential attachment networks and observed\nempirically. Our preferential detachment algorithm offers an alternative\nmechanism for generating such networks, suggesting that both mechanisms may be\npart of a broader class of algorithms resulting in scale-free networks.\n","subjects":["Quantitative Biology/Neurons and Cognition","Quantitative Biology/Populations and Evolution"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"IPJtUG2Q6TInVfnmA3G6gSa31bgDuud-KDw4EHA8q8o","pdfSize":"7683590"}
