{"id":"2408.07117","title":"Equivalence Relations on Vertex Operator Algebras, I: Genus","authors":"Sven M\\\"oller and Brandon C. Rayhaun","authorsParsed":[["Möller","Sven",""],["Rayhaun","Brandon C.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-15","timestamp":1723572000000,"abstract":"  In this first of a series of two papers, we investigate two different\nequivalence relations obtained by generalizing the notion of genus of even\nlattices to the setting of vertex operator algebras (or two-dimensional chiral\nalgebras). The bulk genus equivalence relation was defined in\narXiv:math/0209333 and groups (suitably regular) vertex operator algebras\naccording to their modular tensor category and central charge. Hyperbolic genus\narXiv:2004.01441 tests isomorphy after tensoring with a hyperbolic plane vertex\nalgebra. Physically, two rational chiral algebras are said to belong to the\nsame bulk genus if they live on the boundary of the same 2+1d topological\nquantum field theory; they belong to the same hyperbolic genus if they can be\nrelated by current-current exactly marginal deformations after tensoring a\nnon-chiral compact boson.\n  As one main result, we prove the conjecture that the hyperbolic genus defines\na finer equivalence relation than the bulk genus. This is based on a new,\nequivalent characterization of the hyperbolic genus that uses the maximal\nlattice inside a vertex operator algebra and its commutant (or coset).\n  We discuss the implications of these constructions for the classification of\nrational conformal field theory. In particular, we propose a program for\n(partially) classifying $c=32$, holomorphic vertex operator algebras (or chiral\nconformal field theories), and obtain novel lower bounds, via a generalization\nof the Smith-Minkowski-Siegel mass formula, on the number of vertex operator\nalgebras at higher central charges. Finally, we conjecture a Siegel-Weil\nidentity which computes the \"average\" torus partition function of an ensemble\nof chiral conformal field theories defined by any hyperbolic genus, and\ninterpret this formula physically in terms of disorder-averaged holography.\n","subjects":["Physics/High Energy Physics - Theory","Mathematics/Quantum Algebra","Mathematics/Representation Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}