{"id":"2408.16931","title":"Full-Field Quantitative Visualization of Shock-Driven Pore Collapse and\n  Failure Modes in PMMA","authors":"Barry P Lawlor and Vatsa Gandhi and Guruswami Ravichandran","authorsParsed":[["Lawlor","Barry P",""],["Gandhi","Vatsa",""],["Ravichandran","Guruswami",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 22:13:55 GMT"}],"updateDate":"2024-09-02","timestamp":1724969635000,"abstract":"  The dynamic collapse of pores under shock loading is thought to be directly\nrelated to hot spot generation and material failure, which is critical to the\nperformance of porous energetic and structural materials. However, the shock\ncompression response of porous materials at the local, individual pore scale is\nnot well understood. This study examines, quantitatively, the collapse\nphenomenon of a single spherical void in PMMA at shock stresses ranging from\n0.4-1.0 GPa. Using a newly developed internal digital image correlation\ntechnique in conjunction with plate impact experiments, full-field quantitative\ndeformation measurements are conducted in the material surrounding the\ncollapsing pore for the first time. The experimental results reveal two failure\nmode transitions as shock stress is increased: (i) the first in-situ evidence\nof shear localization via adiabatic shear banding and (ii) dynamic fracture\ninitiation at the pore surface. Numerical simulations using thermo-viscoplastic\ndynamic finite element analysis provide insights into the formation of\nadiabatic shear bands (ASBs) and stresses at which failure mode transitions\noccur. Further numerical and theoretical modeling indicates the dynamic\nfracture to occur along the weakened material inside an adiabatic shear band.\nFinally, analysis of the evolution of pore asymmetry and models for ASB spacing\nelucidate the mechanisms for the shear band initiation sites, and elastostatic\ntheory explains the experimentally observed ASB and fracture paths based on the\ndirections of maximum shear.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}