{"id":"2408.08942","title":"Interacting Holographic dark energy with matter creation: A dynamical\n  system analysis","authors":"Goutam Mandal, Santosh Biswas, and Sujay Kr. Biswas","authorsParsed":[["Mandal","Goutam",""],["Biswas","Santosh",""],["Biswas","Sujay Kr.",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 15:17:22 GMT"}],"updateDate":"2024-08-20","timestamp":1723821442000,"abstract":"  An interacting Holographic dark energy (HDE) with different infra-red (IR)\ncutoffs (Hubble horizon and future event horizon) is investigated in the\nbackground dynamics of flat Friedmann Lemaitre Robertson Walker (FLRW) universe\nwhere gravitational particle creation effects via different form of particle\ncreation rates (1) $\\Gamma=3\\beta H$ and (2) $\\Gamma=3\\alpha H_{0}+3\\beta H$\nare considered. The created particles are considered to be pressureless Dark\nMatter (DM) which interacts with the HDE through a phenomenological choice of\ninteraction term $Q=3\\gamma H \\rho_{m}$. We obtain an analytic solution of the\ncosmological dynamics with Hubble horizon as IR cutoff when the creation rate\nis taken as $\\Gamma=3 \\beta H$. We find that the interacting HDE from the\nHubble horizon as the IR cutoff can give the late-time acceleration and\nnon-interacting cannot give. On the other hand, employing the Hubble horizon\nand the future event as IR cutoffs for the model of HDE does not provide the\nanalytic solution when the creation rate is taken as $\\Gamma=3\\alpha\nH_{0}+3\\beta H$. We then analyze the model separately using the dynamical\nsystems theory. From the analysis, the model (with Hubble horizon as IR cutoff)\nprovides two sets of critical points. One can give a late-time accelerated\nuniverse evolving in quintessence, the cosmological constant, or the phantom\nera. But, it does not show any matter-dominated era. On the other hand, by\napplying the future event as an IR cutoff, the model provides the complete\nevolution of the universe. It also exhibits the late-time scaling attractor\ngives the possible solution of the coincidence problem. Global dynamics of the\nmodel are investigated by defining the appropriate Lyapunov function. Finally,\nthe adiabatic sound speeds of all the models have been calculated and plotted\nnumerically to find the stability of the models.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}