{"id":"2408.16465","title":"Human and LLM-Based Voice Assistant Interaction: An Analytical Framework\n  for User Verbal and Nonverbal Behaviors","authors":"Szeyi Chan, Shihan Fu, Jiachen Li, Bingsheng Yao, Smit Desai, Mirjana\n  Prpa, Dakuo Wang","authorsParsed":[["Chan","Szeyi",""],["Fu","Shihan",""],["Li","Jiachen",""],["Yao","Bingsheng",""],["Desai","Smit",""],["Prpa","Mirjana",""],["Wang","Dakuo",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 11:54:02 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 15:45:13 GMT"}],"updateDate":"2024-09-04","timestamp":1724932442000,"abstract":"  Recent progress in large language model (LLM) technology has significantly\nenhanced the interaction experience between humans and voice assistants (VAs).\nThis project aims to explore a user's continuous interaction with LLM-based VA\n(LLM-VA) during a complex task. We recruited 12 participants to interact with\nan LLM-VA during a cooking task, selected for its complexity and the\nrequirement for continuous interaction. We observed that users show both verbal\nand nonverbal behaviors, though they know that the LLM-VA can not capture those\nnonverbal signals. Despite the prevalence of nonverbal behavior in human-human\ncommunication, there is no established analytical methodology or framework for\nexploring it in human-VA interactions. After analyzing 3 hours and 39 minutes\nof video recordings, we developed an analytical framework with three\ndimensions: 1) behavior characteristics, including both verbal and nonverbal\nbehaviors, 2) interaction stages--exploration, conflict, and integration--that\nillustrate the progression of user interactions, and 3) stage transition\nthroughout the task. This analytical framework identifies key verbal and\nnonverbal behaviors that provide a foundation for future research and practical\napplications in optimizing human and LLM-VA interactions.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ngGJuPVfDNFUVHX78g93AgLW-GTb8dkDLrQ5Lk_Mn5M","pdfSize":"9412955"}
