{"id":"2408.07060","title":"Diversity Empowers Intelligence: Integrating Expertise of Software\n  Engineering Agents","authors":"Kexun Zhang, Weiran Yao, Zuxin Liu, Yihao Feng, Zhiwei Liu, Rithesh\n  Murthy, Tian Lan, Lei Li, Renze Lou, Jiacheng Xu, Bo Pang, Yingbo Zhou,\n  Shelby Heinecke, Silvio Savarese, Huan Wang, Caiming Xiong","authorsParsed":[["Zhang","Kexun",""],["Yao","Weiran",""],["Liu","Zuxin",""],["Feng","Yihao",""],["Liu","Zhiwei",""],["Murthy","Rithesh",""],["Lan","Tian",""],["Li","Lei",""],["Lou","Renze",""],["Xu","Jiacheng",""],["Pang","Bo",""],["Zhou","Yingbo",""],["Heinecke","Shelby",""],["Savarese","Silvio",""],["Wang","Huan",""],["Xiong","Caiming",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 17:50:28 GMT"}],"updateDate":"2024-08-14","timestamp":1723571428000,"abstract":"  Large language model (LLM) agents have shown great potential in solving\nreal-world software engineering (SWE) problems. The most advanced open-source\nSWE agent can resolve over 27% of real GitHub issues in SWE-Bench Lite.\nHowever, these sophisticated agent frameworks exhibit varying strengths,\nexcelling in certain tasks while underperforming in others. To fully harness\nthe diversity of these agents, we propose DEI (Diversity Empowered\nIntelligence), a framework that leverages their unique expertise. DEI functions\nas a meta-module atop existing SWE agent frameworks, managing agent collectives\nfor enhanced problem-solving. Experimental results show that a DEI-guided\ncommittee of agents is able to surpass the best individual agent's performance\nby a large margin. For instance, a group of open-source SWE agents, with a\nmaximum individual resolve rate of 27.3% on SWE-Bench Lite, can achieve a 34.3%\nresolve rate with DEI, making a 25% improvement and beating most closed-source\nsolutions. Our best-performing group excels with a 55% resolve rate, securing\nthe highest ranking on SWE-Bench Lite. Our findings contribute to the growing\nbody of research on collaborative AI systems and their potential to solve\ncomplex software engineering challenges.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}