{"id":"2408.14173","title":"BackFlip: The Impact of Local and Global Data Augmentations on Artistic\n  Image Aesthetic Assessment","authors":"Ombretta Strafforello, Gonzalo Muradas Odriozola, Fatemeh Behrad,\n  Li-Wei Chen, Anne-Sofie Maerten, Derya Soydaner and Johan Wagemans","authorsParsed":[["Strafforello","Ombretta",""],["Odriozola","Gonzalo Muradas",""],["Behrad","Fatemeh",""],["Chen","Li-Wei",""],["Maerten","Anne-Sofie",""],["Soydaner","Derya",""],["Wagemans","Johan",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 10:39:01 GMT"}],"updateDate":"2024-08-27","timestamp":1724668741000,"abstract":"  Assessing the aesthetic quality of artistic images presents unique challenges\ndue to the subjective nature of aesthetics and the complex visual\ncharacteristics inherent to artworks. Basic data augmentation techniques\ncommonly applied to natural images in computer vision may not be suitable for\nart images in aesthetic evaluation tasks, as they can change the composition of\nthe art images. In this paper, we explore the impact of local and global data\naugmentation techniques on artistic image aesthetic assessment (IAA). We\nintroduce BackFlip, a local data augmentation technique designed specifically\nfor artistic IAA. We evaluate the performance of BackFlip across three artistic\nimage datasets and four neural network architectures, comparing it with the\ncommonly used data augmentation techniques. Then, we analyze the effects of\ncomponents within the BackFlip pipeline through an ablation study. Our findings\ndemonstrate that local augmentations, such as BackFlip, tend to outperform\nglobal augmentations on artistic IAA in most cases, probably because they do\nnot perturb the composition of the art images. These results emphasize the\nimportance of considering both local and global augmentations in future\ncomputational aesthetics research.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oJYpemKtExyaCowkJCmggqoTfWfWiv4I10NKnGfWgjw","pdfSize":"30313294"}
