{"id":"2408.09228","title":"Geodesics structure and deflection angle of electrically charged black\n  holes in gravity with a background Kalb-Ramond field","authors":"Ahmad al-Badawi, Sanjar Shaymatov and Izzet Sakall{\\i}","authorsParsed":[["al-Badawi","Ahmad",""],["Shaymatov","Sanjar",""],["Sakallı","Izzet",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 15:20:13 GMT"}],"updateDate":"2024-08-20","timestamp":1723908013000,"abstract":"  This article investigates the geodesic structure and deflection angle of\ncharged black holes in the presence of a nonzero vacuum expectation value\nbackground of the Kalb-Ramond field. Topics explored include null and timelike\ngeodesics, energy extraction by collisions, and the motion of charged\nparticles. The photon sphere radius is calculated and plotted to examine the\neffects of both the black hole charge ($Q$) and the Lorentz-violating parameter\n($b$) on null geodesics. The effective potential for timelike geodesics is\nanalyzed, and second-order analytical orbits are derived. We further show that\nthe combined effects of Lorentz-violating parameter and electric charge can\nmimic a Kerr black hole spin parameter up to its maximum values, i.e., $a/M\n\\sim 1$ thus suggesting that the current precision of measurements of highly\nspinning black hole candidates may not rule out the effect of Lorentz-violating\nparameter. The center of mass energy of colliding particles is also considered,\ndemonstrating a decrease with increasing Lorentz-violating parameter. Circular\norbiting particles of charged particles are discovered, with the minimum radius\nfor a stable circular orbit decreasing as both $b$ and $Q$ increase. Results\nshow that this circular orbit is particularly sensitive to changes in the\nLorentz-violating parameter. Additionally, a timelike particle trajectory is\ndemonstrated as a consequence of the combined effects of parameters $b$ and\n$Q$. Finally, the light deflection angle is analyzed using the weak field limit\napproach to determine the Lorentz-breaking effect, employing the Gauss-Bonnet\ntheorem for computation. Findings are visualized with appropriate plots and\nthoroughly discussed.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}