{"id":"2408.12058","title":"Molecular Quantum Chemical Data Sets and Databases for Machine Learning\n  Potentials","authors":"Arif Ullah, Pavlo O. Dral","authorsParsed":[["Ullah","Arif",""],["Dral","Pavlo O.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 01:25:43 GMT"}],"updateDate":"2024-08-23","timestamp":1724289943000,"abstract":"  The field of computational chemistry is increasingly leveraging machine\nlearning (ML) potentials to predict molecular properties with high accuracy and\nefficiency, providing a viable alternative to traditional quantum mechanical\n(QM) methods, which are often computationally intensive. Central to the success\nof ML models is the quality and comprehensiveness of the data sets on which\nthey are trained. Quantum chemistry data sets and databases, comprising\nextensive information on molecular structures, energies, forces, and other\nproperties derived from QM calculations, are crucial for developing robust and\ngeneralizable ML potentials. In this review, we provide an overview of the\ncurrent landscape of quantum chemical data sets and databases. We examine key\ncharacteristics and functionalities of prominent resources, including the types\nof information they store, the level of electronic structure theory employed,\nthe diversity of chemical space covered, and the methodologies used for data\ncreation. Additionally, an updatable resource is provided to track new data\nsets and databases at\nhttps://github.com/Arif-PhyChem/datasets_and_databases_4_MLPs. Looking forward,\nwe discuss the challenges associated with the rapid growth of quantum chemical\ndata sets and databases, emphasizing the need for updatable and accessible\nresources to ensure the long-term utility of them. We also address the\nimportance of data format standardization and the ongoing efforts to align with\nthe FAIR principles to enhance data interoperability and reusability. Drawing\ninspiration from established materials databases, we advocate for the\ndevelopment of user-friendly and sustainable platforms for these data sets and\ndatabases.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RqJsI2PF4-rhPY0WTGz3pCdUaJU1aMwQ8Pvg6-UXUWU","pdfSize":"534776"}
