{"id":"2408.06141","title":"[Draft] High-order observers and high-order state-estimation-based\n  properties of discrete-event systems","authors":"Kuize Zhang, Xiaoguang Han, Alessandro Giua, Carla Seatzu","authorsParsed":[["Zhang","Kuize",""],["Han","Xiaoguang",""],["Giua","Alessandro",""],["Seatzu","Carla",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 13:34:12 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 12:43:16 GMT"}],"updateDate":"2024-08-14","timestamp":1723469652000,"abstract":"  State-estimation-based properties are central properties in discrete-event\nsystems modeled by labeled finite-state automata studied over the past 3\ndecades. Most existing results are based on a single agent who knows the\nstructure of a system and can observe a subset of events and estimate the\nsystem's state based on the system's structure and the agent's observation to\nthe system. The main tool used to do state estimation and verify\nstate-estimation-based properties is called \\emph{observer} which is the\npowerset construction originally proposed by Rabin and Scott in 1959, used to\ndeterminize a nondeterministic finite automaton with $\\varepsilon$-transitions.\n  In this paper, we consider labeled finite-state automata, extend the\nstate-estimation-based properties from a single agent to a finite ordered set\nof agents and also extend the original observer to \\emph{high-order observer}\nbased on the original observer and our \\emph{concurrent composition}. As a\nresult, a general framework on high-order state-estimation-based properties\nhave been built and a basic tool has also been built to verify such properties.\nThis general framework contains many basic properties as its members such as\nstate-based opacity, critical observability, determinism, high-order opacity,\netc. Special cases for which verification can be done more efficiently are also\ndiscussed.\n  In our general framework, the system's structure is publicly known to all\nagents $A_1,\\dots,A_n$, each agent $A_i$ has its own observable event set\n$E_i$, and additionally knows all its preceding agents' observable events but\ncan only observe its own observable events. The intuitive meaning of our\nhigh-order observer is what agent $A_n$ knows about what $A_{n-1}$ knows about\n\\dots what $A_2$ knows about $A_1$'s state estimate of the system.\n","subjects":["Computing Research Repository/Formal Languages and Automata Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}