{"id":"2408.14090","title":"Exploring GPU-to-GPU Communication: Insights into Supercomputer\n  Interconnects","authors":"Daniele De Sensi, Lorenzo Pichetti, Flavio Vella, Tiziano De Matteis,\n  Zebin Ren, Luigi Fusco, Matteo Turisini, Daniele Cesarini, Kurt Lust, Animesh\n  Trivedi, Duncan Roweth, Filippo Spiga, Salvatore Di Girolamo, Torsten Hoefler","authorsParsed":[["De Sensi","Daniele",""],["Pichetti","Lorenzo",""],["Vella","Flavio",""],["De Matteis","Tiziano",""],["Ren","Zebin",""],["Fusco","Luigi",""],["Turisini","Matteo",""],["Cesarini","Daniele",""],["Lust","Kurt",""],["Trivedi","Animesh",""],["Roweth","Duncan",""],["Spiga","Filippo",""],["Di Girolamo","Salvatore",""],["Hoefler","Torsten",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 08:20:50 GMT"}],"updateDate":"2024-08-27","timestamp":1724660450000,"abstract":"  Multi-GPU nodes are increasingly common in the rapidly evolving landscape of\nexascale supercomputers. On these systems, GPUs on the same node are connected\nthrough dedicated networks, with bandwidths up to a few terabits per second.\nHowever, gauging performance expectations and maximizing system efficiency is\nchallenging due to different technologies, design options, and software layers.\nThis paper comprehensively characterizes three supercomputers - Alps, Leonardo,\nand LUMI - each with a unique architecture and design. We focus on performance\nevaluation of intra-node and inter-node interconnects on up to 4096 GPUs, using\na mix of intra-node and inter-node benchmarks. By analyzing its limitations and\nopportunities, we aim to offer practical guidance to researchers, system\narchitects, and software developers dealing with multi-GPU supercomputing. Our\nresults show that there is untapped bandwidth, and there are still many\nopportunities for optimization, ranging from network to software optimization.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Hardware Architecture","Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Performance"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DYO-yW00oCMF2IVp82PP8nMW0Bc-zcS6jUN6onyjtN4","pdfSize":"976908"}
