{"id":"2408.01495","title":"3D-Radial galaxy correlation function","authors":"Francesco Spezzati, Alvise Raccanelli","authorsParsed":[["Spezzati","Francesco",""],["Raccanelli","Alvise",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 18:00:06 GMT"}],"updateDate":"2024-08-06","timestamp":1722621606000,"abstract":"  Tests of cosmological models via measurements of galaxy correlations will\nrequire increasing modeling accuracy, given the high precision of measurements\npromised by forthcoming galaxy surveys. In this work we investigate the biases\nintroduced in parameter estimation when using different approximations in the\nmodeling of the galaxy two point correlation function. We study this for two\nexample surveys, with different binning strategies, for measurements of the\nPrimordial non-Gaussianity parameter $f_{\\mathrm{NL}}$ and the growth rate of\nstructures $\\gamma$. We then investigate the same issue for the nDGP model, to\nsee if results will change for a different cosmological model. Our results show\nthat failing to properly account for radial and angular separation between\ngalaxies will induce a considerable shift in parameters best fit estimates, the\nbias being larger for thicker redshift bins. When accounting for radial\nevolution within the bins by integrating over z, such shifts are reduced but\nstill present. We then introduce a new hybrid model, which we call 3D radial,\nwhere we neglect the purely wide angle terms, but include a proper 3D modeling\nof the system by including radial modes. Using this model, we show that biases\nare greatly reduced, making it an accurate formalism to be safely used for\nforthcoming galaxy surveys. This moreover confirms other recent findings on the\nimportance of including radial modes to accurately model the galaxy correlation\nfunction.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xhfv7i2gZ4Yz_iB9Lsjy31D9EW8i97xpQSxcrMoa5i0","pdfSize":"1482348","txDigest":"BEcTBCdUB4SscHAUCbq6AeapsnjjygXzcU8J4azXWy6S","endEpoch":"1","status":"CERTIFIED"}
