{"id":"2408.03164","title":"Dilated Convolution with Learnable Spacings makes visual models more\n  aligned with humans: a Grad-CAM study","authors":"Rabih Chamas, Ismail Khalfaoui-Hassani, Timothee Masquelier","authorsParsed":[["Chamas","Rabih",""],["Khalfaoui-Hassani","Ismail",""],["Masquelier","Timothee",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 13:05:32 GMT"}],"updateDate":"2024-08-07","timestamp":1722949532000,"abstract":"  Dilated Convolution with Learnable Spacing (DCLS) is a recent advanced\nconvolution method that allows enlarging the receptive fields (RF) without\nincreasing the number of parameters, like the dilated convolution, yet without\nimposing a regular grid. DCLS has been shown to outperform the standard and\ndilated convolutions on several computer vision benchmarks. Here, we show that,\nin addition, DCLS increases the models' interpretability, defined as the\nalignment with human visual strategies. To quantify it, we use the Spearman\ncorrelation between the models' GradCAM heatmaps and the ClickMe dataset\nheatmaps, which reflect human visual attention. We took eight reference models\n- ResNet50, ConvNeXt (T, S and B), CAFormer, ConvFormer, and FastViT (sa 24 and\n36) - and drop-in replaced the standard convolution layers with DCLS ones. This\nimproved the interpretability score in seven of them. Moreover, we observed\nthat Grad-CAM generated random heatmaps for two models in our study: CAFormer\nand ConvFormer models, leading to low interpretability scores. We addressed\nthis issue by introducing Threshold-Grad-CAM, a modification built on top of\nGrad-CAM that enhanced interpretability across nearly all models. The code and\ncheckpoints to reproduce this study are available at:\nhttps://github.com/rabihchamas/DCLS-GradCAM-Eval.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Y4u29FwLKDY_LbCOc2d3e8-ovWvvz1aKGSfMaYnw8zo","pdfSize":"9343633"}
