{"id":"2408.06545","title":"Optimal Preprocessing for Joint Detection and Classification of Wireless\n  Communication Signals in Congested Spectrum Using Computer Vision Methods","authors":"Xiwen Kang, Hua-mei Chen, Genshe Chen, Kuo-Chu Chang, Thomas M.\n  Clemons","authorsParsed":[["Kang","Xiwen",""],["Chen","Hua-mei",""],["Chen","Genshe",""],["Chang","Kuo-Chu",""],["Clemons","Thomas M.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 00:39:55 GMT"}],"updateDate":"2024-08-14","timestamp":1723509595000,"abstract":"  The joint detection and classification of RF signals has been a critical\nproblem in the field of wideband RF spectrum sensing. Recent advancements in\ndeep learning models have revolutionized this field, remarkably through the\napplication of state-of-the-art computer vision algorithms such as YOLO (You\nOnly Look Once) and DETR (Detection Transformer) to the spectrogram images.\nThis paper focuses on optimizing the preprocessing stage to enhance the\nperformance of these computer vision models. Specifically, we investigated the\ngeneration of training spectrograms via the classical Short-Time Fourier\nTransform (STFT) approach, examining four classical STFT parameters: FFT size,\nwindow type, window length, and overlapping ratio. Our study aims to maximize\nthe mean average precision (mAP) scores of YOLOv10 models in detecting and\nclassifying various digital modulation signals within a congested spectrum\nenvironment. Firstly, our results reveal that additional zero padding in FFT\ndoes not enhance detection and classification accuracy and introduces\nunnecessary computational cost. Secondly, our results indicated that there\nexists an optimal window size that balances the trade-offs between and the time\nand frequency resolution, with performance losses of approximately 10% and 30%\nif the window size is four or eight times off from the optimal. Thirdly,\nregarding the choice of window functions, the Hamming window yields optimal\nperformance, with non-optimal windows resulting in up to a 10% accuracy loss.\nFinally, we found a 10% accuracy score performance gap between using 10% and\n90% overlap. These findings highlight the potential for significant performance\nimprovements through optimized spectrogram parameters when applying computer\nvision models to the problem of wideband RF spectrum sensing.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"c8F6qu9GYP4HFx6lLZrRjfTOicT-Z9Y3ViaQXg4SRnw","pdfSize":"670157"}
