{"id":"2408.12218","title":"Slowly positively drifting bursts generated by large-scale magnetic\n  reconnection","authors":"Alena Zemanov\\'a, Marian Karlick\\'y, Jana Ka\\v{s}parov\\'a, Jaroslav\n  Dud\\'ik, J\\'an Ryb\\'ak","authorsParsed":[["Zemanová","Alena",""],["Karlický","Marian",""],["Kašparová","Jana",""],["Dudík","Jaroslav",""],["Rybák","Ján",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 08:45:46 GMT"}],"updateDate":"2024-08-23","timestamp":1724316346000,"abstract":"  The slowly positively drifting bursts (SPDBs) are rarely observed in radio\nemission of solar flares. To understand how the SPDBs are generated, we studied\nthe radio observations at 600--5000 MHz together with the imaging observations\nmade in ultraviolet (UV) and extreme ultraviolet (EUV) during the SPDB-rich\nC8.7 flare of 2014 May 10 (SOL2014-05-10T0702). Because the SPDBs propagate\ntowards locations of higher plasma density, we studied their associations with\nindividual flare kernels, located either within the flare core itself, or\ndistributed at longer distances, but connected to the flaring region by\nlarge-scale hot loops. For each kernel we constructed light curves using 1600 A\nand 304 A observations and compared these light curves with the temporal\nevolution of radio flux at 1190 MHz, representing all observed groups of SPDBs.\nWe also analysed the UV/EUV observations to understand the evolution of\nmagnetic connectivity during the flare. The flare starts with a growing hot\nsigmoid observed in 131 A. As the sigmoid evolves, it extends to and interacts\nwith a half dome present within the active region. The evolving sigmoid\nreconnects at the respective hyperbolic flux tube, producing large-scale\nmagnetic connections and an EUV swirl. Three groups of SPDBs are observed\nduring this large-scale magnetic reconnection, along with a group of\nnarrow-band type III bursts. The light curves of a kernel corresponding to the\nfootpoint of spine line analogue show good agreement with the radio flux at\n1190 MHz, indicating that the SPDBs are produced by the large-scale magnetic\nreconnection at the half dome. In addition, one of the kernels appeared in the\nneighbouring active region and also showed a similar evolution to the radio\nflux, implying that beams of accelerated particles can synchronize radio and\nUV/EUV light curves across relatively large distances.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}