{"id":"2408.09499","title":"A Knowledge-Based Analysis of Intersection Protocols","authors":"Kaya Alpturer, Joseph Y. Halpern, Ron van der Meyden","authorsParsed":[["Alpturer","Kaya",""],["Halpern","Joseph Y.",""],["van der Meyden","Ron",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 14:44:19 GMT"}],"updateDate":"2024-08-20","timestamp":1723992259000,"abstract":"  The increasing wireless communication capabilities of vehicles creates\nopportunities for more efficient intersection management strategies. One\npromising approach is the replacement of traffic lights with a system wherein\nvehicles run protocols among themselves to determine right of way. In this\npaper, we define the intersection problem to model this scenario abstractly,\nwithout any assumptions on the specific structure of the intersection or a\nbound on the number of vehicles. Protocols solving the intersection problem\nmust guarantee safety (no collisions) and liveness (every vehicle eventually\ngoes through). In addition, we would like these protocols to satisfy various\noptimality criteria, some of which turn out to be achievable only in a subset\nof the contexts. In particular, we show a partial equivalence between\neliminating unnecessary waiting, a criterion of interest in the distributed\nmutual-exclusion literature, and a notion of optimality that we define called\nlexicographical optimality. We then introduce a framework to design protocols\nfor the intersection problem by converting an intersection policy, which is\nbased on a global view of the intersection, to a protocol that can be run by\nthe vehicles through the use of knowledge-based programs. Our protocols are\nshown to guarantee safety and liveness while also being optimal under\nsufficient conditions on the context. Finally, we investigate protocols in the\npresence of faulty vehicles that experience communication failures and older\nvehicles with limited communication capabilities. We show that intersection\nprotocols can be made safe, live and optimal even in the presence of faulty\nbehavior.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}