{"id":"2408.12659","title":"Disentangled Structural and Featural Representation for Task-Agnostic\n  Graph Valuation","authors":"Ali Falahati, Mohammad Mohammadi Amiri","authorsParsed":[["Falahati","Ali",""],["Amiri","Mohammad Mohammadi",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 18:05:41 GMT"}],"updateDate":"2024-08-26","timestamp":1724349941000,"abstract":"  With the emergence of data marketplaces, the demand for methods to assess the\nvalue of data has increased significantly. While numerous techniques have been\nproposed for this purpose, none have specifically addressed graphs as the main\ndata modality. Graphs are widely used across various fields, ranging from\nchemical molecules to social networks. In this study, we break down graphs into\ntwo main components: structural and featural, and we focus on evaluating data\nwithout relying on specific task-related metrics, making it applicable in\npractical scenarios where validation requirements may be lacking. We introduce\na novel framework called blind message passing, which aligns the seller's and\nbuyer's graphs using a shared node permutation based on graph matching. This\nallows us to utilize the graph Wasserstein distance to quantify the differences\nin the structural distribution of graph datasets, called the structural\ndisparities. We then consider featural aspects of buyers' and sellers' graphs\nfor data valuation and capture their statistical similarities and differences,\nreferred to as relevance and diversity, respectively. Our approach ensures that\nbuyers and sellers remain unaware of each other's datasets. Our experiments on\nreal datasets demonstrate the effectiveness of our approach in capturing the\nrelevance, diversity, and structural disparities of seller data for buyers,\nparticularly in graph-based data valuation scenarios.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Theory","Mathematics/Information Theory","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"x5HNev1z4iOHdUfpI6WgTTo0LMhllqft-iWfDGacwfs","pdfSize":"974709"}
