{"id":"2408.05864","title":"Magnetic field, magnetospheric accretion and candidate planet of the\n  young star GM Aurigae observed with SPIRou","authors":"B. Zaire, J.-F. Donati, S. P. Alencar, J. Bouvier, C. Moutou, S.\n  Bellotti, A. Carmona, P. Petit, \\'A. K\\'osp\\'al, H. Shang, K. Grankin, C.\n  Manara, E. Alecian, S. P. Gregory, P. Fouqu\\'e, and the SLS consortium","authorsParsed":[["Zaire","B.",""],["Donati","J. -F.",""],["Alencar","S. P.",""],["Bouvier","J.",""],["Moutou","C.",""],["Bellotti","S.",""],["Carmona","A.",""],["Petit","P.",""],["Kóspál","Á.",""],["Shang","H.",""],["Grankin","K.",""],["Manara","C.",""],["Alecian","E.",""],["Gregory","S. P.",""],["Fouqué","P.",""],["consortium","the SLS",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 21:33:01 GMT"}],"updateDate":"2024-08-13","timestamp":1723411981000,"abstract":"  This paper analyses spectropolarimetric observations of the classical T Tauri\nstar (CTTS) GM Aurigae collected with SPIRou, the near-infrared\nspectropolarimeter at the Canada-France-Hawaii Telescope, as part of the SLS\nand SPICE Large Programs. We report for the first time results on the\nlarge-scale magnetic field at the surface of GM Aur using Zeeman Doppler\nimaging. Its large-scale magnetic field energy is almost entirely stored in an\naxisymmetric poloidal field, which places GM Aur close to other CTTSs with\nsimilar internal structures. A dipole of about 730 G dominates the large-scale\nfield topology, while higher-order harmonics account for less than 30 per-cent\nof the total magnetic energy. Overall, we find that the main difference between\nour three reconstructed maps (corresponding to sequential epochs) comes from\nthe evolving tilt of the magnetic dipole, likely generated by non-stationary\ndynamo processes operating in this largely convective star rotating with a\nperiod of about 6 d. Finally, we report a 5.5$\\sigma$ detection of a signal in\nthe activity-filtered radial velocity data of semi-amplitude 110 $\\pm$ 20 m/s\nat a period of 8.745 $\\pm$ 0.009 d. If attributed to a close-in planet in the\ninner accretion disc of GM Aur, it would imply that this planet candidate has a\nminimum mass of 1.10 $\\pm$ 0.30 Mjup and orbits at a distance of 0.082 $\\pm$\n0.002 au.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}