{"id":"2408.02667","title":"Evaluating and Utilizing Surrogate Outcomes in Covariate-Adjusted\n  Response-Adaptive Designs","authors":"Wenxin Zhang, Aaron Hudson, Maya Petersen, Mark van der Laan","authorsParsed":[["Zhang","Wenxin",""],["Hudson","Aaron",""],["Petersen","Maya",""],["van der Laan","Mark",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 17:58:44 GMT"},{"version":"v2","created":"Sun, 11 Aug 2024 01:04:00 GMT"}],"updateDate":"2024-08-13","timestamp":1722880724000,"abstract":"  This manuscript explores the intersection of surrogate outcomes and adaptive\ndesigns in statistical research. While surrogate outcomes have long been\nstudied for their potential to substitute long-term primary outcomes, current\nsurrogate evaluation methods do not directly account for the potential benefits\nof using surrogate outcomes to adapt randomization probabilities in adaptive\nrandomized trials that aim to learn and respond to treatment effect\nheterogeneity. In this context, surrogate outcomes can benefit participants in\nthe trial directly (i.e. improve expected outcome of newly-enrolled\nparticipants) by allowing for more rapid adaptation of randomization\nprobabilities, particularly when surrogates enable earlier detection of\nheterogeneous treatment effects and/or indicate the optimal (individualized)\ntreatment with stronger signals. Our study introduces a novel approach for\nsurrogate evaluation that quantifies both of these benefits in the context of\nsequential adaptive experiment designs. We also propose a new\nCovariate-Adjusted Response-Adaptive (CARA) design that incorporates an Online\nSuperlearner to assess and adaptively choose surrogate outcomes for updating\ntreatment randomization probabilities. We introduce a Targeted Maximum\nLikelihood Estimator that addresses data dependency challenges in adaptively\ncollected data and achieves asymptotic normality under reasonable assumptions\nwithout relying on parametric model assumptions. The robust performance of our\nadaptive design with Online Superlearner is presented via simulations. Our\nframework not only contributes a method to more comprehensively quantifying the\nbenefits of candidate surrogate outcomes and choosing between them, but also\noffers an easily generalizable tool for evaluating various adaptive designs and\nmaking inferences, providing insights into alternative choices of designs.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}