{"id":"2408.12736","title":"Impact of Usability Mechanisms: A Family of Experiments on Efficiency,\n  Effectiveness and User Satisfaction","authors":"Juan M. Ferreira, Francy Rodr\\'iguez, Adri\\'an Santos, Silvia T.\n  Acu\\~na, Natalia Juristo","authorsParsed":[["Ferreira","Juan M.",""],["Rodríguez","Francy",""],["Santos","Adrián",""],["Acuña","Silvia T.",""],["Juristo","Natalia",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 21:23:18 GMT"}],"updateDate":"2024-08-29","timestamp":1724361798000,"abstract":"  Context: The usability software quality attribute aims to improve system user\nperformance. In a previous study, we found evidence of the impact of a set of\nusability characteristics from the viewpoint of users in terms of efficiency,\neffectiveness and satisfaction. However, the impact level appears to depend on\nthe usability feature and suggest priorities with respect to their\nimplementation depending on how they promote user performance. Objectives: We\nuse a family of three experiments to increase the precision and generalization\nof the results in the baseline experiment and provide findings on the impact on\nuser performance of the Abort Operation, Progress Feedback and Preferences\nusability mechanisms. Method: We conduct two replications of the baseline\nexperiment in academic settings. We analyse the data of 367 experimental\nsubjects and apply aggregation (meta-analysis) procedures. Results: We find\nthat the Abort Operation and Preferences usability mechanisms appear to improve\nsystem usability a great deal with respect to efficiency, effectiveness and\nuser satisfaction. Conclusions: We find that the family of experiments further\ncorroborates the results of the baseline experiment. Most of the results are\nstatistically significant, and, because of the large number of experimental\nsubjects, the evidence that we gathered in the replications is sufficient to\noutweigh other experiments.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}