{"id":"2408.08399","title":"An Efficient and Explainable Transformer-Based Few-Shot Learning for\n  Modeling Electricity Consumption Profiles Across Thousands of Domains","authors":"Weijie Xia, Gao Peng, Chenguang Wang, Peter Palensky, Eric Pauwels,\n  Pedro P. Vergara","authorsParsed":[["Xia","Weijie",""],["Peng","Gao",""],["Wang","Chenguang",""],["Palensky","Peter",""],["Pauwels","Eric",""],["Vergara","Pedro P.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 19:54:53 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 13:29:46 GMT"}],"updateDate":"2024-08-23","timestamp":1723751693000,"abstract":"  Electricity Consumption Profiles (ECPs) are crucial for operating and\nplanning power distribution systems, especially with the increasing numbers of\nvarious low-carbon technologies such as solar panels and electric vehicles.\nTraditional ECP modeling methods typically assume the availability of\nsufficient ECP data. However, in practice, the accessibility of ECP data is\nlimited due to privacy issues or the absence of metering devices. Few-shot\nlearning (FSL) has emerged as a promising solution for ECP modeling in\ndata-scarce scenarios. Nevertheless, standard FSL methods, such as those used\nfor images, are unsuitable for ECP modeling because (1) these methods usually\nassume several source domains with sufficient data and several target domains.\nHowever, in the context of ECP modeling, there may be thousands of source\ndomains with a moderate amount of data and thousands of target domains. (2)\nStandard FSL methods usually involve cumbersome knowledge transfer mechanisms,\nsuch as pre-training and fine-tuning, whereas ECP modeling requires more\nlightweight methods. (3) Deep learning models often lack explainability,\nhindering their application in industry. This paper proposes a novel FSL method\nthat exploits Transformers and Gaussian Mixture Models (GMMs) for ECP modeling\nto address the above-described issues. Results show that our method can\naccurately restore the complex ECP distribution with a minimal amount of ECP\ndata (e.g., only 1.6\\% of the complete domain dataset) while it outperforms\nstate-of-the-art time series modeling methods, maintaining the advantages of\nbeing both lightweight and interpretable. The project is open-sourced at\nhttps://github.com/xiaweijie1996/TransformerEM-GMM.git.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}