{"id":"2408.14962","title":"Deep Learning-based Average Shear Wave Velocity Prediction using\n  Accelerometer Records","authors":"Bar{\\i}\\c{s} Y{\\i}lmaz, Melek T\\\"urkmen, Sanem Meral, Erdem\n  Akag\\\"und\\\"uz, Salih Tileylioglu","authorsParsed":[["Yılmaz","Barış",""],["Türkmen","Melek",""],["Meral","Sanem",""],["Akagündüz","Erdem",""],["Tileylioglu","Salih",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 11:09:34 GMT"}],"updateDate":"2024-08-28","timestamp":1724756974000,"abstract":"  Assessing seismic hazards and thereby designing earthquake-resilient\nstructures or evaluating structural damage that has been incurred after an\nearthquake are important objectives in earthquake engineering. Both tasks\nrequire critical evaluation of strong ground motion records, and the knowledge\nof site conditions at the earthquake stations plays a major role in achieving\nthe aforementioned objectives. Site conditions are generally represented by the\ntime-averaged shear wave velocity in the upper 30 meters of the geological\nmaterials (Vs30). Several strong motion stations lack Vs30 measurements\nresulting in potentially inaccurate assessment of seismic hazards and\nevaluation of ground motion records. In this study, we present a deep\nlearning-based approach for predicting Vs30 at strong motion station locations\nusing three-channel earthquake records. For this purpose, Convolutional Neural\nNetworks (CNNs) with dilated and causal convolutional layers are used to\nextract deep features from accelerometer records collected from over 700\nstations located in Turkey. In order to overcome the limited availability of\nlabeled data, we propose a two-phase training approach. In the first phase, a\nCNN is trained to estimate the epicenters, for which ground truth is available\nfor all records. After the CNN is trained, the pre-trained encoder is\nfine-tuned based on the Vs30 ground truth. The performance of the proposed\nmethod is compared with machine learning models that utilize hand-crafted\nfeatures. The results demonstrate that the deep convolutional encoder based\nVs30 prediction model outperforms the machine learning models that rely on\nhand-crafted features.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}