{"id":"2408.14395","title":"A Derivative-Free Martingale Neural Network Soc-Martnet For The\n  Hamilton-Jacobi-Bellman Equations In Stochastic Optimal Controls","authors":"Wei Cai, Shuixin Fang, Wenzhong Zhang, and Tao Zhou","authorsParsed":[["Cai","Wei",""],["Fang","Shuixin",""],["Zhang","Wenzhong",""],["Zhou","Tao",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 16:27:26 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 03:21:16 GMT"}],"updateDate":"2024-08-28","timestamp":1724689646000,"abstract":"  In this paper, we propose an efficient derivative-free version of a\nmartingale neural network SOC-MartNet proposed in Cai et al. [2] for solving\nhigh-dimensional Hamilton-Jacobi-Bellman (HJB) equations and stochastic optimal\ncontrol problems (SOCPs) with controls on both drift and volatility. The\nsolution of the HJB equation consists of two steps: (1) finding the optimal\ncontrol from the value function, and (2) deriving the value function from a\nlinear PDE characterized by the optimal control. The linear PDE is reformulated\ninto a weak form of a new martingale formulation from the original SOC-MartNet\nwhere all temporal and spatial derivatives are replaced by an univariate,\nfirst-order random finite difference operator approximation, giving the\nderivative free version of the SOC-MartNet. Then, the optimal feedback control\nis identified by minimizing the mean of the value function, thereby avoiding\nthe need for pointwise minimization on the Hamiltonian. Finally, the optimal\ncontrol and value function are approximated by neural networks trained via\nadversarial learning using the derivative-free formulation. This method\neliminates the reliance on automatic differentiation for computing temporal and\nspatial derivatives, offering significant efficiency in solving\nhigh-dimensional HJB equations and SOCPs.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/"}