{"id":"2408.11617","title":"Time-Dependent Strategy for Improving Aortic Blood Flow Simulations with\n  Boundary Control and Data Assimilation","authors":"Muhammad Adnan Anwar and Jorge Tiago","authorsParsed":[["Anwar","Muhammad Adnan",""],["Tiago","Jorge",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 13:44:44 GMT"}],"updateDate":"2024-08-22","timestamp":1724247884000,"abstract":"  Understanding time-dependent blood flow dynamics in arteries is crucial for\ndiagnosing and treating cardiovascular diseases. However, accurately predicting\ntime-varying flow patterns requires integrating observational data with\ncomputational models in a dynamic environment. This study investigates the\napplication of data assimilation and boundary optimization techniques to\nimprove the accuracy of time-dependent blood flow simulations. We propose an\nintegrated approach that combines data assimilation methods with boundary\noptimization strategies tailored for time-dependent cases. Our method aims to\nminimize the disparity between model predictions and observed data over time,\nthereby enhancing the fidelity of time-dependent blood flow simulations. Using\nsynthetic time-series observational data with added noise, we validate our\napproach by comparing its predictions with the known exact solution, computing\nthe L2 norm to demonstrate improved accuracy in time-dependent blood flow\nsimulations. Our results indicate that the optimization process consistently\naligns the optimized data with the exact data. In particular, velocity\nmagnitudes showed reduced discrepancies compared to the noisy data, aligning\nmore closely with the exact solutions. The analysis of pressure data revealed a\nremarkable correspondence between the optimized and exact pressure values,\nhighlighting the potential of this methodology for accurate pressure estimation\nwithout any previous knowledge on this quantity. Furthermore, wall shear stress\n(WSS) analysis demonstrated the effectiveness of our optimization scheme in\nreducing noise and improving prediction of a relevant indicator determined at\nthe postprocessing level. These findings suggest that our approach can\nsignificantly enhance the accuracy of blood flow simulations, ultimately\ncontributing to better diagnostic and therapeutic strategies.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"dV2hNROgps51HrsJZgzW-zj4IQU3F-SfpcVazLpRBSc","pdfSize":"13502955"}
