{"id":"2408.09198","title":"Learning Based Toolpath Planner on Diverse Graphs for 3D Printing","authors":"Yuming Huang, Yuhu Guo, Renbo Su, Xingjian Han, Junhao Ding, Tianyu\n  Zhang, Tao Liu, Weiming Wang, Guoxin Fang, Xu Song, Emily Whiting, Charlie\n  C.L. Wang","authorsParsed":[["Huang","Yuming",""],["Guo","Yuhu",""],["Su","Renbo",""],["Han","Xingjian",""],["Ding","Junhao",""],["Zhang","Tianyu",""],["Liu","Tao",""],["Wang","Weiming",""],["Fang","Guoxin",""],["Song","Xu",""],["Whiting","Emily",""],["Wang","Charlie C. L.",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 13:29:16 GMT"}],"updateDate":"2024-08-20","timestamp":1723901356000,"abstract":"  This paper presents a learning based planner for computing optimized 3D\nprinting toolpaths on prescribed graphs, the challenges of which include the\nvarying graph structures on different models and the large scale of nodes &\nedges on a graph. We adopt an on-the-fly strategy to tackle these challenges,\nformulating the planner as a Deep Q-Network (DQN) based optimizer to decide the\nnext `best' node to visit. We construct the state spaces by the Local Search\nGraph (LSG) centered at different nodes on a graph, which is encoded by a\ncarefully designed algorithm so that LSGs in similar configurations can be\nidentified to re-use the earlier learned DQN priors for accelerating the\ncomputation of toolpath planning. Our method can cover different 3D printing\napplications by defining their corresponding reward functions. Toolpath\nplanning problems in wire-frame printing, continuous fiber printing, and\nmetallic printing are selected to demonstrate its generality. The performance\nof our planner has been verified by testing the resultant toolpaths in physical\nexperiments. By using our planner, wire-frame models with up to 4.2k struts can\nbe successfully printed, up to 93.3% of sharp turns on continuous fiber\ntoolpaths can be avoided, and the thermal distortion in metallic printing can\nbe reduced by 24.9%.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/"}