{"id":"2408.09189","title":"SA-GDA: Spectral Augmentation for Graph Domain Adaptation","authors":"Jinhui Pang, Zixuan Wang, Jiliang Tang, Mingyan Xiao, Nan Yin","authorsParsed":[["Pang","Jinhui",""],["Wang","Zixuan",""],["Tang","Jiliang",""],["Xiao","Mingyan",""],["Yin","Nan",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 13:01:45 GMT"}],"updateDate":"2024-08-20","timestamp":1723899705000,"abstract":"  Graph neural networks (GNNs) have achieved impressive impressions for\ngraph-related tasks. However, most GNNs are primarily studied under the cases\nof signal domain with supervised training, which requires abundant\ntask-specific labels and is difficult to transfer to other domains. There are\nfew works focused on domain adaptation for graph node classification. They\nmainly focused on aligning the feature space of the source and target domains,\nwithout considering the feature alignment between different categories, which\nmay lead to confusion of classification in the target domain. However, due to\nthe scarcity of labels of the target domain, we cannot directly perform\neffective alignment of categories from different domains, which makes the\nproblem more challenging. In this paper, we present the \\textit{Spectral\nAugmentation for Graph Domain Adaptation (\\method{})} for graph node\nclassification. First, we observe that nodes with the same category in\ndifferent domains exhibit similar characteristics in the spectral domain, while\ndifferent classes are quite different. Following the observation, we align the\ncategory feature space of different domains in the spectral domain instead of\naligning the whole features space, and we theoretical proof the stability of\nproposed \\method{}. Then, we develop a dual graph convolutional network to\njointly exploits local and global consistency for feature aggregation. Last, we\nutilize a domain classifier with an adversarial learning submodule to\nfacilitate knowledge transfer between different domain graphs. Experimental\nresults on a variety of publicly available datasets reveal the effectiveness of\nour \\method{}.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XmKeM2hipLN9MNdAU2GOt4FWZofKX2to9RZVWyvcT3c","pdfSize":"7925746"}
