{"id":"2408.12941","title":"iSee: Advancing Multi-Shot Explainable AI Using Case-based\n  Recommendations","authors":"Anjana Wijekoon, Nirmalie Wiratunga, David Corsar, Kyle Martin,\n  Ikechukwu Nkisi-Orji, Chamath Palihawadana, Marta Caro-Mart\\'inez, Belen\n  D\\'iaz-Agudo, Derek Bridge, Anne Liret","authorsParsed":[["Wijekoon","Anjana",""],["Wiratunga","Nirmalie",""],["Corsar","David",""],["Martin","Kyle",""],["Nkisi-Orji","Ikechukwu",""],["Palihawadana","Chamath",""],["Caro-Martínez","Marta",""],["Díaz-Agudo","Belen",""],["Bridge","Derek",""],["Liret","Anne",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 09:44:57 GMT"}],"updateDate":"2024-08-26","timestamp":1724406297000,"abstract":"  Explainable AI (XAI) can greatly enhance user trust and satisfaction in\nAI-assisted decision-making processes. Recent findings suggest that a single\nexplainer may not meet the diverse needs of multiple users in an AI system;\nindeed, even individual users may require multiple explanations. This\nhighlights the necessity for a \"multi-shot\" approach, employing a combination\nof explainers to form what we introduce as an \"explanation strategy\". Tailored\nto a specific user or a user group, an \"explanation experience\" describes\ninteractions with personalised strategies designed to enhance their AI\ndecision-making processes. The iSee platform is designed for the intelligent\nsharing and reuse of explanation experiences, using Case-based Reasoning to\nadvance best practices in XAI. The platform provides tools that enable AI\nsystem designers, i.e. design users, to design and iteratively revise the most\nsuitable explanation strategy for their AI system to satisfy end-user needs.\nAll knowledge generated within the iSee platform is formalised by the iSee\nontology for interoperability. We use a summative mixed methods study protocol\nto evaluate the usability and utility of the iSee platform with six design\nusers across varying levels of AI and XAI expertise. Our findings confirm that\nthe iSee platform effectively generalises across applications and its potential\nto promote the adoption of XAI best practices.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EtqjsKgxsGcUQ8awWX9RS2AHP4WKtyf_Rli-WTvGJCk","pdfSize":"11385429"}
