{"id":"2408.16004","title":"Granger causal inference for climate change attribution","authors":"Mark D. Risser, Mohammed Ombadi, Michael F. Wehner","authorsParsed":[["Risser","Mark D.",""],["Ombadi","Mohammed",""],["Wehner","Michael F.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 18:55:07 GMT"}],"updateDate":"2024-08-30","timestamp":1723575307000,"abstract":"  Climate change detection and attribution (D&A) is concerned with determining\nthe extent to which anthropogenic activities have influenced specific aspects\nof the global climate system. D&A fits within the broader field of causal\ninference, the collection of statistical methods that identify cause and effect\nrelationships. There are a wide variety of methods for making attribution\nstatements, each of which require different types of input data and focus on\ndifferent types of weather and climate events and each of which are conditional\nto varying extents. Some methods are based on Pearl causality while others\nleverage Granger causality, and the causal framing provides important context\nfor how the resulting attribution conclusion should be interpreted. However,\nwhile Granger-causal attribution analyses have become more common, there is no\nclear statement of their strengths and weaknesses and no clear consensus on\nwhere and when Granger-causal perspectives are appropriate. In this prospective\npaper, we provide a formal definition for Granger-based approaches to trend and\nevent attribution and a clear comparison with more traditional methods for\nassessing the human influence on extreme weather and climate events. Broadly\nspeaking, Granger-causal attribution statements can be constructed quickly from\nobservations and do not require computationally-intesive dynamical experiments.\nThese analyses also enable rapid attribution, which is useful in the aftermath\nof a severe weather event, and provide multiple lines of evidence for\nanthropogenic climate change when paired with Pearl-causal attribution.\nConfidence in attribution statements is increased when different methodologies\narrive at similar conclusions. Moving forward, we encourage the D&A community\nto embrace hybrid approaches to climate change attribution that leverage the\nstrengths of both Granger and Pearl causality.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"O_4xy3SKRiTkaM7ielHpFhaGa2pc3KyPj-BVdJ3UoCU","pdfSize":"523807"}
