{"id":"2408.13273","title":"Retrieval-Augmented Generation Meets Data-Driven Tabula Rasa Approach\n  for Temporal Knowledge Graph Forecasting","authors":"Geethan Sannidhi, Sagar Srinivas Sakhinana, Venkataramana Runkana","authorsParsed":[["Sannidhi","Geethan",""],["Sakhinana","Sagar Srinivas",""],["Runkana","Venkataramana",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 11:52:24 GMT"}],"updateDate":"2024-08-27","timestamp":1723981944000,"abstract":"  Pre-trained large language models (PLLMs) like OpenAI ChatGPT and Google\nGemini face challenges such as inaccurate factual recall, hallucinations,\nbiases, and future data leakage for temporal Knowledge Graph (tKG) forecasting.\nTo address these issues, we introduce sLA-tKGF (small-scale language assistant\nfor tKG forecasting), which utilizes Retrieval-Augmented Generation (RAG)\naided, custom-trained small-scale language models through a tabula rasa\napproach from scratch for effective tKG forecasting. Our framework constructs\nknowledge-infused prompts with relevant historical data from tKGs, web search\nresults, and PLLMs-generated textual descriptions to understand historical\nentity relationships prior to the target time. It leverages these external\nknowledge-infused prompts for deeper understanding and reasoning of\ncontext-specific semantic and temporal information to zero-shot prompt\nsmall-scale language models for more accurate predictions of future events\nwithin tKGs. It reduces hallucinations and mitigates distributional shift\nchallenges through comprehending changing trends over time. As a result, it\nenables more accurate and contextually grounded forecasts of future events\nwhile minimizing computational demands. Rigorous empirical studies demonstrate\nour framework robustness, scalability, and state-of-the-art (SOTA) performance\non benchmark datasets with interpretable and trustworthy tKG forecasting.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"wcychCmzdmWOYWl1R3DQX25CXcUUWlEkSGc09ytwExs","pdfSize":"671325"}
