{"id":"2408.15367","title":"How Much is too Much: Exploring the Effect of Verbal Route Description\n  Length on Indoor Navigation","authors":"Fathima Nourin N, Pradip Pramanick, Chayan Sarkar","authorsParsed":[["N","Fathima Nourin",""],["Pramanick","Pradip",""],["Sarkar","Chayan",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 19:04:07 GMT"}],"updateDate":"2024-08-29","timestamp":1724785447000,"abstract":"  Navigating through a new indoor environment can be stressful. Recently, many\nplaces have deployed robots to assist visitors. One of the features of such\nrobots is escorting the visitors to their desired destination within the\nenvironment, but this is neither scalable nor necessary for every visitor.\nInstead, a robot assistant could be deployed at a strategic location to provide\nwayfinding instructions. This not only increases the user experience but can be\nhelpful in many time-critical scenarios e.g., escorting someone to their\nboarding gate at an airport. However, delivering route descriptions verbally\nposes a challenge. If the description is too verbose, people may struggle to\nrecall all the information, while overly brief descriptions may be simply\nunhelpful. This article focuses on studying the optimal length of verbal route\ndescriptions that are effective for reaching the destination and easy for\npeople to recall. This work proposes a theoretical framework that links route\nsegments to chunks in working memory. Based on this framework, an experiment is\ndesigned and conducted to examine the effects of route descriptions of\ndifferent lengths on navigational performance. The results revealed intriguing\npatterns suggesting an ideal length of four route segments. This study lays a\nfoundation for future research exploring the relationship between route\ndescription lengths, working memory capacity, and navigational performance in\nindoor environments.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dUbrjbgYeyw3jB_IDdSMaBm4zB9ycrCCrO5pFWLpWgA","pdfSize":"692796"}
