{"id":"2408.11120","title":"Effects of the photospheric cut-off on the p-mode frequency stability","authors":"Dmitrii Y. Kolotkov, Anne-Marie Broomhall, Amir Hasanzadeh","authorsParsed":[["Kolotkov","Dmitrii Y.",""],["Broomhall","Anne-Marie",""],["Hasanzadeh","Amir",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 18:22:24 GMT"}],"updateDate":"2024-08-22","timestamp":1724178144000,"abstract":"  Sub-photospheric acoustic resonators allow for the formation of standing\np-mode oscillations by reflecting acoustic waves with frequencies below the\nacoustic cut-off frequency. We employ the Klein-Gordon equation with a\npiecewise acoustic potential to study the characteristic frequencies of\nintermediate-degree p-modes, modified by the cut-off effect. For a perfectly\nreflective photosphere, provided by the infinite value of the acoustic cut-off\nfrequency, characteristic discrete frequencies of the trapped p-modes are fully\nprescribed by the width of the acoustic potential barrier. Finite values of the\nacoustic cut-off frequency result in the reduction of p-mode frequencies,\nassociated with the decrease in the sound speed by the cut-off effect. For\nexample, for a spherical degree of $\\ell = 100$, characteristic p-mode\nfrequencies are found to decrease by up to 200 $\\mu$Hz and the effect is more\npronounced for higher radial harmonics. The frequency separation between two\nconsecutive radial harmonics is shown to behave non-asymptotically with\nnon-uniform spacing in the radial harmonic number due to the cut-off effect. We\nalso show how the 11-yr variability of the Sun's photospheric magnetic field\ncan result in the p-mode frequency shifts through the link between the acoustic\ncut-off frequency and the plasma parameter $\\beta$. Using this model, we\nreadily reproduce the observed typical amplitudes of the p-mode frequency shift\nand its phase behaviour relative to other 11-yr solar cycle proxies. The use of\nthe developed model for comparison with observations requires its\ngeneralisation for 2D effects, more realistic profiles of the acoustic\npotential, and broad-band stochastic drivers.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mwpStFlg1ZommJQntmW783NADwQXBUrU09K-aoEvubQ","pdfSize":"860972"}
