{"id":"2408.12826","title":"The FAST Core Array","authors":"Peng Jiang, Rurong Chen, Hengqian Gan, Jinghai Sun, Boqin Zhu, Hui Li,\n  Weiwei Zhu, Jingwen Wu, Xuelei Chen, Haiyan Zhang and Tao An","authorsParsed":[["Jiang","Peng",""],["Chen","Rurong",""],["Gan","Hengqian",""],["Sun","Jinghai",""],["Zhu","Boqin",""],["Li","Hui",""],["Zhu","Weiwei",""],["Wu","Jingwen",""],["Chen","Xuelei",""],["Zhang","Haiyan",""],["An","Tao",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 04:12:18 GMT"}],"updateDate":"2024-08-26","timestamp":1724386338000,"abstract":"  The Five-hundred-meter Aperture Spherical Radio Telescope (FAST) Core Array\nis a proposed extension of FAST, integrating 24 secondary 40-m antennas\nimplanted within 5 km of the FAST site. This original array design will combine\nthe unprecedented sensitivity of FAST with a high angular resolution (4.3\" at a\nfrequency of 1.4 GHz), thereby exceeding the capabilities at similar\nfrequencies of next-generation arrays such as the Square Kilometre Array Phase\n1 or the next-generation Very Large Array. This article presents the technical\nspecifications of the FAST Core Array, evaluates its potential relatively to\nexisting radio telescope arrays, and describes its expected scientific\nprospects. The proposed array will be equipped with technologically advanced\nbackend devices, such as real-time signal processing systems. A phased array\nfeed receiver will be mounted on FAST to improve the survey efficiency of the\nFAST Core Array, whose broad frequency coverage and large field of view (FOV)\nwill be essential to study transient cosmic phenomena such as fast radio bursts\nand gravitational wave events, to conduct surveys and resolve structures in\nneutral hydrogen galaxies, to monitor or detect pulsars, and to investigate\nexoplanetary systems. Finally, the FAST Core Array can strengthen China's major\nrole in the global radio astronomy community, owing to a wide range of\npotential scientific applications from cosmology to exoplanet science.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"6SkjhcSFZ4RSA2qrxv-t_7WRuCrW4j3ibqJsf1T7RD8","pdfSize":"7081563"}
