{"id":"2408.01765","title":"Joint Model Pruning and Resource Allocation for Wireless Time-triggered\n  Federated Learning","authors":"Xinlu Zhang, Yansha Deng, Toktam Mahmoodi","authorsParsed":[["Zhang","Xinlu",""],["Deng","Yansha",""],["Mahmoodi","Toktam",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 12:19:23 GMT"}],"updateDate":"2024-08-06","timestamp":1722687563000,"abstract":"  Time-triggered federated learning, in contrast to conventional event-based\nfederated learning, organizes users into tiers based on fixed time intervals.\nHowever, this network still faces challenges due to a growing number of devices\nand limited wireless bandwidth, increasing issues like stragglers and\ncommunication overhead. In this paper, we apply model pruning to wireless\nTime-triggered systems and jointly study the problem of optimizing the pruning\nratio and bandwidth allocation to minimize training loss under communication\nlatency constraints. To solve this joint optimization problem, we perform a\nconvergence analysis on the gradient $l_2$-norm of the asynchronous multi-tier\nfederated learning (FL) model with adaptive model pruning. The convergence\nupper bound is derived and a joint optimization problem of pruning ratio and\nwireless bandwidth is defined to minimize the model training loss under a given\ncommunication latency constraint. The closed-form solutions for wireless\nbandwidth and pruning ratio by using KKT conditions are then formulated. As\nindicated in the simulation experiments, our proposed TT-Prune demonstrates a\n40% reduction in communication cost, compared with the asynchronous multi-tier\nFL without model pruning, while maintaining the model convergence at the same\nlevel.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"e16VXh-fUxLurliku_PImhNh77l1_BKynQZdYUcV67s","pdfSize":"656408","txDigest":"BP5rnFHKSaJh8cQFBn8j4JMrppGKVwSWDWYJcaFasHng","endEpoch":"1","status":"CERTIFIED"}
