{"id":"2408.05579","title":"Recurrence Resonance -- Noise-Enhanced Dynamics in Recurrent Neural\n  Networks","authors":"Claus Metzner, Achim Schilling, Andreas Maier and Patrick Krauss","authorsParsed":[["Metzner","Claus",""],["Schilling","Achim",""],["Maier","Andreas",""],["Krauss","Patrick",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 15:14:41 GMT"}],"updateDate":"2024-08-13","timestamp":1723302881000,"abstract":"  In specific motifs of three recurrently connected neurons with probabilistic\nresponse, the spontaneous information flux, defined as the mutual information\nbetween subsequent states, has been shown to increase by adding ongoing white\nnoise of some optimal strength to each of the neurons\n\\cite{krauss2019recurrence}. However, the precise conditions for and mechanisms\nof this phenomenon called 'recurrence resonance' (RR) remain largely\nunexplored. Using Boltzmann machines of different sizes and with various types\nof weight matrices, we show that RR can generally occur when a system has\nmultiple dynamical attractors, but is trapped in one or a few of them. In\nprobabilistic networks, the phenomenon is bound to a suitable observation time\nscale, as the system could autonomously access its entire attractor landscape\neven without the help of external noise, given enough time. Yet, even in large\nsystems, where time scales for observing RR in the full network become too\nlong, the resonance can still be detected in small subsets of neurons. Finally,\nwe show that short noise pulses can be used to transfer recurrent neural\nnetworks, both probabilistic and deterministic, between their dynamical\nattractors. Our results are relevant to the fields of reservoir computing and\nneuroscience, where controlled noise may turn out a key factor for efficient\ninformation processing leading to more robust and adaptable systems.\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"szHEYnBwcuYsJzw6jU791Y2YJGSON8THNnQP5s30LcU","pdfSize":"21864543"}
