{"id":"2408.16728","title":"Joint 9D Receiver Localization and Ephemeris Correction with LEO and\n  $5$G Base Stations","authors":"Don-Roberts Emenonye, Harpreet S. Dhillon, and R. Michael Buehrer","authorsParsed":[["Emenonye","Don-Roberts",""],["Dhillon","Harpreet S.",""],["Buehrer","R. Michael",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 17:20:00 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 21:37:14 GMT"}],"updateDate":"2024-09-05","timestamp":1724952000000,"abstract":"  In this paper, we use the Fisher information matrix (FIM) to analyze the\ninteraction between low-earth orbit (LEO) satellites and $5$G base stations in\nproviding $9$D receiver localization and correcting LEO ephemeris. First, we\ngive a channel model that captures all the information in the LEO-receiver,\nLEO-BS, and BS-receiver links. Subsequently, we use FIM to capture the amount\nof information about the channel parameters in these links. Then, we transform\nthese FIM for channel parameters to the FIM for the $9$D ($3$D position, $3$D\norientation, and $3$D velocity estimation) receiver localization parameters and\nthe LEO position and velocity offset. Closed-form expressions for the entries\nin the FIM for these location parameters are presented. Our results on\nidentifiability utilizing the FIM for the location parameters indicate: i) with\none LEO, we need three BSs and three time slots to both estimate the $9$D\nlocation parameters and correct the LEO position and velocity, ii) with two\nLEO, we need three BSs and three time slots to both estimate the $9$D location\nparameters and correct the LEO position and velocity, and iii) with three LEO,\nwe need three BSs and four-time slots to both estimate the $9$D location\nparameters and correct the LEO position and velocity. Another key insight is\nthat through the Cramer Rao lower bound we show that with a single LEO, three\ntime slots, and three BSs, the receiver positioning error, velocity estimation\nerror, orientation error, LEO position offset estimation error, and LEO\nvelocity offset estimation error are $0.1 \\text{ cm}$, $1 \\text{ mm/s}$,\n$10^{-3} \\text{ rad}$, $0.01 \\text{ m}$, and $1 \\text{ m/s}$, respectively.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}