{"id":"2408.14754","title":"Sequential-Scanning Dual-Energy CT Imaging Using High Temporal\n  Resolution Image Reconstruction and Error-Compensated Material Basis Image\n  Generation","authors":"Qiaoxin Li, Ruifeng Chen, Peng Wang, Guotao Quan, Yanfeng Du, Dong\n  Liang, Yinsheng Li","authorsParsed":[["Li","Qiaoxin",""],["Chen","Ruifeng",""],["Wang","Peng",""],["Quan","Guotao",""],["Du","Yanfeng",""],["Liang","Dong",""],["Li","Yinsheng",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 03:09:39 GMT"}],"updateDate":"2024-08-28","timestamp":1724728179000,"abstract":"  Dual-energy computed tomography (DECT) has been widely used to obtain\nquantitative elemental composition of imaged subjects for personalized and\nprecise medical diagnosis. Compared with DECT leveraging advanced X-ray source\nand/or detector technologies, the use of the sequential-scanning data\nacquisition scheme to implement DECT may make a broader impact on clinical\npractice because this scheme requires no specialized hardware designs and can\nbe directly implemented into conventional CT systems. However, since the\nconcentration of iodinated contrast agent in the imaged subject varies over\ntime, sequentially scanned data sets acquired at two tube potentials are\ntemporally inconsistent. As existing material basis image reconstruction\napproaches assume that the data sets acquired at two tube potentials are\ntemporally consistent, the violation of this assumption results in inaccurate\nquantification of material concentration. In this work, we developed\nsequential-scanning DECT imaging using high temporal resolution image\nreconstruction and error-compensated material basis image generation,\nACCELERATION in short, to address the technical challenge induced by temporal\ninconsistency of sequentially scanned data sets and improve quantification\naccuracy of material concentration in sequential-scanning DECT. ACCELERATION\nhas been validated and evaluated using numerical simulation data sets generated\nfrom clinical human subject exams and experimental human subject studies.\nResults demonstrated the improvement of quantification accuracy and image\nquality using ACCELERATION.\n","subjects":["Physics/Medical Physics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Physics/Instrumentation and Detectors"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}