{"id":"2408.08887","title":"Tree species classification at the pixel-level using deep learning and\n  multispectral time series in an imbalanced context","authors":"Florian Mouret (CESBIO, UO), David Morin (CESBIO), Milena Planells\n  (CESBIO), C\\'ecile Vincent-Barbaroux","authorsParsed":[["Mouret","Florian","","CESBIO, UO"],["Morin","David","","CESBIO"],["Planells","Milena","","CESBIO"],["Vincent-Barbaroux","Cécile",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 13:44:42 GMT"}],"updateDate":"2024-08-20","timestamp":1722865482000,"abstract":"  This paper investigates tree species classification using Sentinel-2\nmultispectral satellite image time-series. Despite their critical importance\nfor many applications, such maps are often unavailable, outdated, or inaccurate\nfor large areas. The interest of using remote sensing time series to produce\nthese maps has been highlighted in many studies. However, many methods proposed\nin the literature still rely on a standard classification algorithm, usually\nthe Random Forest (RF) algorithm with vegetation indices. This study shows that\nthe use of deep learning models can lead to a significant improvement in\nclassification results, especially in an imbalanced context where the RF\nalgorithm tends to predict towards the majority class. In our use case in the\ncenter of France with 10 tree species, we obtain an overall accuracy (OA)\naround 95% and a F1-macro score around 80% using three different benchmark deep\nlearning architectures. In contrast, using the RF algorithm yields an OA of 93%\nand an F1 of 60%, indicating that the minority classes are not classified with\nsufficient accuracy. Therefore, the proposed framework is a strong baseline\nthat can be easily implemented in most scenarios, even with a limited amount of\nreference data. Our results highlight that standard multilayer perceptron can\nbe competitive with batch normalization and a sufficient amount of parameters.\nOther architectures (convolutional or attention-based) can also achieve strong\nresults when tuned properly. Furthermore, our results show that DL models are\nnaturally robust to imbalanced data, although similar results can be obtained\nusing dedicated techniques.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}