{"id":"2408.00551","title":"Test-beam measurements of instrumented sensor planes for a highly\n  compact and granular electromagnetic calorimeter","authors":"Melissa Almanza Soto (1)(on behalf of the LUXE collaboration (1) IFIC,\n  Universitat de Val\\`encia and CSIC)","authorsParsed":[["Soto","Melissa Almanza",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 13:35:43 GMT"}],"updateDate":"2024-08-02","timestamp":1722519343000,"abstract":"  The LUXE experiment is designed to explore the strong-field QED regime in\ninteractions of high-energy electrons from the European XFEL in a powerful\nlaser field. One of the crucial aims of this experiment is to measure the\nproduction of electron-positron pairs as a function of the laser field strength\nwhere non-perturbative effects are expected to kick in above the Schwinger\nlimit. For the measurements of positron energy and multiplicity spectra, a\ntracker and an electromagnetic calorimeter are foreseen. The expected number of\npositrons varies over ten orders of magnitude and has to be measured over a\nwidely spread low-energy background. To overcome these challenges, a compact\nand finely segmented calorimeter is proposed. The concept of a sandwich\ncalorimeter made of tungsten absorber plates interspersed with thin sensor\nplanes is developed. The sensor planes comprise a silicon pad sensor, flexible\nKapton printed circuit planes for bias voltage supply and signal transport to\nthe sensor edge, all embedded in a carbon fiber support. The thickness of a\nsensor plane is less than 1 mm. A dedicated readout is developed comprising\nfront-end ASICs in 130 nm technology and FPGAs to orchestrate the ASICs and\nperform data pre-processing. As an alternative, GaAs are considered with\nintegrated readout strips on the sensor. Prototypes of both sensor planes are\nstudied in an electron beam of 5 GeV. Results will be presented on the\nhomogeneity of the response and edge effects.\n","subjects":["Physics/High Energy Physics - Experiment","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yrXKO9RVLl6-LIzOO9uA9xpExErCuQFXjT_zprinE3c","pdfSize":"846355","txDigest":"DjHpMqorKzr91Sq8aJsfvTpCFT2otkgZATU4QvWsoNTa","endEpoch":"1","status":"CERTIFIED"}
