{"id":"2408.16049","title":"Forward Ray Tracing and Hot Spots in Kerr Spacetime","authors":"Lihang Zhou, Zhen Zhong, Yifan Chen, Vitor Cardoso","authorsParsed":[["Zhou","Lihang",""],["Zhong","Zhen",""],["Chen","Yifan",""],["Cardoso","Vitor",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-30","timestamp":1724868001000,"abstract":"  Hotspots, often characterized as point-like emissions, frequently manifest\nnear black holes, displaying significantly increased luminosity compared to the\nsurrounding accretion flow. It is noteworthy that these hotspots regularly\noccur outside the black hole at the center of the Milky Way. Light rays emitted\nfrom these sources follow complex trajectories around the black hole,\nultimately arriving at distinct locations on the observer's image plane. To\nextract precise spacetime information, including the black hole mass, spin, and\ninclination angle, it is crucial to accurately resolve both the direct emission\nand its higher-order images, despite the latter's intensity suppression. To\nenhance the accuracy and efficiency of modeling and analyzing these hotspots,\nwe introduce a forward ray tracing method, a departure from the traditional\nbackward ray tracing approach. By utilizing conserved quantities in Kerr\nspacetime, this method initiates geodesics from a specified emission point near\nthe black hole and terminates them at a distant observer, effectively capturing\nmultiple images. By introducing perturbations to these geodesics, we map\nfinite-size emissions to distinct regions on the image plane, allowing for the\nquantification of image shapes and amplification rates. This approach\nfacilitates efficient spacetime tomography and hotspot localization, leveraging\nobservations from the Event Horizon Telescope and its next-generation upgrades.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"G7_z8fpwDAVDvwaQvnLhoSrZ4Musd8ZyZVeHSANkJgk","pdfSize":"10089110"}
