{"id":"2408.01561","title":"Magnetodynamics of few-nanoparticle chains","authors":"Thinh Q. Bui, Samuel D. Oberdick, Frank M. Abel, Michael J. Donahue,\n  Klaus N. Quelhas, Cindi L. Dennis, Thomas Cleveland, Yanxin Liu, and Solomon\n  I. Woods","authorsParsed":[["Bui","Thinh Q.",""],["Oberdick","Samuel D.",""],["Abel","Frank M.",""],["Donahue","Michael J.",""],["Quelhas","Klaus N.",""],["Dennis","Cindi L.",""],["Cleveland","Thomas",""],["Liu","Yanxin",""],["Woods","Solomon I.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 20:17:43 GMT"}],"updateDate":"2024-08-06","timestamp":1722629863000,"abstract":"  In recent years, there has been increasing interest in the understanding and\napplication of nanoparticle assemblies driven by external fields. Although\nthese systems can exhibit marked transitions in behavior compared to\nnon-interacting counterparts, it has often proven challenging to connect their\ndynamics with underlying physical mechanisms or even to verifiably establish\ntheir structure under realistic experimental conditions. We have studied\ncolloidal iron oxide nanoparticles that assemble into ordered, few-particle\nlinear chains under the influence of oscillating and pulsed magnetic fields.\nCryo-EM has been used to flash freeze and image the structures formed by\noscillatory drive fields, and magnetic relaxometry has been used to extract the\nmultiple time constants associated with magnetic switching of the short chains.\nArmed with the physical structure from cryo-EM and the field-dependent\nswitching times from magnetic measurements, we have conducted extensive\nmicromagnetic simulations, revealing probable mechanisms for each time constant\nregime spanning $10^{9}$ in time and how switching develops from individual\nparticles to entire chains. These types of magnetic nanomaterials have great\npotential for biomedical technologies, particularly magnetic particle imaging\nand hyperthermia, and rigorous elucidation of their physics will hasten their\noptimization.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics","Physics/Classical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2wbeq5w-fCaEp7AFvqp_PzYT3Lo0QROLCAaLF3jjqys","pdfSize":"4303537","txDigest":"2Sz38senafESdNcmbf2qhT3TeKumDcK7MkZ2rG2uVMHY","endEpoch":"1","status":"CERTIFIED"}
