{"id":"2408.01897","title":"CAF-YOLO: A Robust Framework for Multi-Scale Lesion Detection in\n  Biomedical Imagery","authors":"Zilin Chen, Shengnan Lu","authorsParsed":[["Chen","Zilin",""],["Lu","Shengnan",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 01:44:44 GMT"}],"updateDate":"2024-08-06","timestamp":1722735884000,"abstract":"  Object detection is of paramount importance in biomedical image analysis,\nparticularly for lesion identification. While current methodologies are\nproficient in identifying and pinpointing lesions, they often lack the\nprecision needed to detect minute biomedical entities (e.g., abnormal cells,\nlung nodules smaller than 3 mm), which are critical in blood and lung\npathology. To address this challenge, we propose CAF-YOLO, based on the YOLOv8\narchitecture, a nimble yet robust method for medical object detection that\nleverages the strengths of convolutional neural networks (CNNs) and\ntransformers. To overcome the limitation of convolutional kernels, which have a\nconstrained capacity to interact with distant information, we introduce an\nattention and convolution fusion module (ACFM). This module enhances the\nmodeling of both global and local features, enabling the capture of long-term\nfeature dependencies and spatial autocorrelation. Additionally, to improve the\nrestricted single-scale feature aggregation inherent in feed-forward networks\n(FFN) within transformer architectures, we design a multi-scale neural network\n(MSNN). This network improves multi-scale information aggregation by extracting\nfeatures across diverse scales. Experimental evaluations on widely used\ndatasets, such as BCCD and LUNA16, validate the rationale and efficacy of\nCAF-YOLO. This methodology excels in detecting and precisely locating diverse\nand intricate micro-lesions within biomedical imagery. Our codes are available\nat https://github.com/xiaochen925/CAF-YOLO.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}