{"id":"2408.08756","title":"Accurate wave velocity measurement from diffuse wave fields","authors":"Melody Png, Ming Huang, Marzieh Bahreman, Christopher M. Kube, Michael\n  J.S. Lowe, Bo Lan","authorsParsed":[["Png","Melody",""],["Huang","Ming",""],["Bahreman","Marzieh",""],["Kube","Christopher M.",""],["Lowe","Michael J. S.",""],["Lan","Bo",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 13:57:12 GMT"}],"updateDate":"2024-08-19","timestamp":1723816632000,"abstract":"  Directional wave speeds variations in anisotropic elastic solids enables\nmaterial characterisation capabilities, such as determination of elastic\nconstants and volumetric measurement of crystallographic texture. However,\nachieving such measurements is challenging especially on samples with complex\ngeometries. Here we propose the use of Green's Function reconstruction from\ndiffuse ultrasonic wave fields for accurate velocity measurements on components\nwith arbitrary geometries. Strategies for accurate reconstruction, including\naveraging over an increased number of different source locations, using longer\nwindow lengths of diffuse fields, and accurately deconvolving a\nsource-dependent factor, were implemented to achieve satisfactory convergence\ntowards Green's Function. Additionally, low signal intensity challenges from\nlaser interferometers were overcome to enable non-contact measurement of the\nwave speeds, by making use of simultaneous excitation of sources to increase\nsignal-to-noise ratio and signal normalisation to account for energy\ndissipation of diffuse fields. With successful demonstration using both phased\narray and laser receivers, this advancement fundamentally broadens acoustic\nwave velocity measurement capabilities to a wider range of environments and\nholds promise for future material characterisation of complex-shaped\ncomponents.\n","subjects":["Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"NG5tEsJmZqxGnmD2qPqtOF5ZC5f6dvVSykyRyxm-PFU","pdfSize":"5070913"}
