{"id":"2408.00952","title":"A Primer on Near-Field Communications for Next-Generation Multiple\n  Access","authors":"Chongjun Ouyang, Zhaolin Wang, Yan Chen, Xidong Mu, and Peiying Zhu","authorsParsed":[["Ouyang","Chongjun",""],["Wang","Zhaolin",""],["Chen","Yan",""],["Mu","Xidong",""],["Zhu","Peiying",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 23:20:43 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 08:44:56 GMT"},{"version":"v3","created":"Thu, 8 Aug 2024 18:25:10 GMT"}],"updateDate":"2024-08-12","timestamp":1722554443000,"abstract":"  Multiple-antenna technologies are advancing toward the development of\nextremely large aperture arrays and the utilization of extremely high\nfrequencies, driving the progress of next-generation multiple access (NGMA).\nThis evolution is accompanied by the emergence of near-field communications\n(NFC), characterized by spherical-wave propagation, which introduces additional\nrange dimensions to the channel and enhances system throughput. In this\ncontext, a tutorial-based primer on NFC is presented, emphasizing its\napplications in multiuser communications and multiple access (MA). The\nfollowing areas are investigated: \\romannumeral1) the commonly used near-field\nchannel models are reviewed along with their simplifications under various\nnear-field conditions. \\romannumeral2) Building upon these models, the\ninformation-theoretic capacity limits of NFC-MA are analyzed, including the\nderivation of sum-rate capacity and capacity region, and their upper limits for\nboth downlink and uplink scenarios. \\romannumeral3) A detailed investigation of\nnear-field multiuser beamforming design is presented, offering low-complexity\nand effective NFC-MA design methodologies in both the spatial and wavenumber\n(angular) domains. Throughout these investigations, near-field MA is compared\nwith its far-field counterpart to highlight its superiority and flexibility in\nterms of interference management, thereby laying the groundwork for achieving\nNGMA.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}