{"id":"2408.10903","title":"BEYOND DIALOGUE: A Profile-Dialogue Alignment Framework Towards General\n  Role-Playing Language Model","authors":"Yeyong Yu, Runsheng Yu, Haojie Wei, Zhanqiu Zhang, Quan Qian","authorsParsed":[["Yu","Yeyong",""],["Yu","Runsheng",""],["Wei","Haojie",""],["Zhang","Zhanqiu",""],["Qian","Quan",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 14:47:38 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 03:31:25 GMT"},{"version":"v3","created":"Mon, 26 Aug 2024 07:37:19 GMT"},{"version":"v4","created":"Tue, 27 Aug 2024 02:58:39 GMT"},{"version":"v5","created":"Thu, 29 Aug 2024 02:38:05 GMT"}],"updateDate":"2024-08-30","timestamp":1724165258000,"abstract":"  The rapid advancement of large language models (LLMs) has revolutionized\nrole-playing, enabling the development of general role-playing models. However,\ncurrent role-playing training has two significant issues: (I) Using a\npredefined role profile to prompt dialogue training for specific scenarios\nusually leads to inconsistencies and even conflicts between the dialogue and\nthe profile, resulting in training biases. (II) The model learns to imitate the\nrole based solely on the profile, neglecting profile-dialogue alignment at the\nsentence level. In this work, we propose a simple yet effective framework\ncalled BEYOND DIALOGUE, designed to overcome these hurdles. This framework\ninnovatively introduces \"beyond dialogue\" tasks to align dialogue with profile\ntraits based on each specific scenario, thereby eliminating biases during\ntraining. Furthermore, by adopting an innovative prompting mechanism that\ngenerates reasoning outcomes for training, the framework allows the model to\nachieve fine-grained alignment between profile and dialogue at the sentence\nlevel. The aforementioned methods are fully automated and low-cost.\nAdditionally, the integration of automated dialogue and objective evaluation\nmethods forms a comprehensive framework, paving the way for general\nrole-playing. Experimental results demonstrate that our model excels in\nadhering to and reflecting various dimensions of role profiles, outperforming\nmost proprietary general and specialized role-playing baselines. All code and\ndatasets are available at https://github.com/yuyouyu32/BeyondDialogue.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}