{"id":"2408.09784","title":"Apostle--Auriga: Effects of stellar feedback subgrid models on the\n  evolution of angular momentum in disc galaxies","authors":"Hang Yang, Shihong Liao, Azadeh Fattahi, Carlos S. Frenk, Liang Gao,\n  Qi Guo, Shi Shao, Lan Wang, Ruby J. Wright, Guangquan Zeng","authorsParsed":[["Yang","Hang",""],["Liao","Shihong",""],["Fattahi","Azadeh",""],["Frenk","Carlos S.",""],["Gao","Liang",""],["Guo","Qi",""],["Shao","Shi",""],["Wang","Lan",""],["Wright","Ruby J.",""],["Zeng","Guangquan",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 08:18:47 GMT"}],"updateDate":"2024-08-20","timestamp":1724055527000,"abstract":"  Utilizing the Apostle--Auriga simulations, which start from the same zoom-in\ninitial conditions of Local Group-like systems but run with different galaxy\nformation subgrid models and hydrodynamic solvers, we study the impact of\nstellar feedback models on the evolution of angular momentum in disc galaxies.\nAt $z = 0$, Auriga disc galaxies tend to exhibit higher specific angular\nmomenta compared to their cross-matched Apostle counterparts. By tracing the\nevolution history of the Lagrangian mass tracers of the in-situ star particles\nin the $z = 0$ galaxies, we find that the specific angular momentum\ndistributions of the gas tracers from the two simulations at the halo accretion\ntime are relatively similar. The present-day angular momentum difference is\nmainly driven by the physical processes occurring inside dark matter haloes,\nespecially galactic fountains. Due to the different subgrid implementations of\nstellar feedback processes, Auriga galaxies contain a high fraction of recycled\ngas tracers (${\\sim} 65$ per cent) which could acquire angular momentum through\nmixing with the high angular momentum circumgalactic medium (CGM). In Apostle,\nhowever, the fraction of recycled gas tracers is significantly lower (down to\n${\\sim} 20$ per cent for Milky Way-sized galaxies) and the angular momentum\nacquisition from the CGM is marginal. As a result, the present-day Auriga\ngalaxies overall have higher specific angular momenta.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OdfBRmUXMWSa5y3jvw_VDP6N8te-d2VOZwFKxwxi3VQ","pdfSize":"894473"}
