{"id":"2408.05167","title":"Gravitational Waves and Dark Matter in the Gauged Two-Higgs Doublet\n  Model","authors":"Michael J. Ramsey-Musolf, Van Que Tran and Tzu-Chiang Yuan","authorsParsed":[["Ramsey-Musolf","Michael J.",""],["Tran","Van Que",""],["Yuan","Tzu-Chiang",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 16:44:08 GMT"}],"updateDate":"2024-08-12","timestamp":1723221848000,"abstract":"  We investigate the possibility of a strong first-order electroweak phase\ntransition during the early universe within the framework of the gauged\ntwo-Higgs doublet model (G2HDM) and explore its detectability through\nstochastic gravitational wave signals. The G2HDM introduces a dark replica of\nthe Standard Model electroweak gauge group, inducing an accidental $Z_2$\nsymmetry which not only leads to a simple scalar potential at tree-level but\nalso offers a compelling vectorial dark matter candidate. Using the high\ntemperature expansion in the effective potential that manifests gauge\ninvariance, we find a possible two-step phase transition pattern in the model\nwith a strong first-order transition occurring in the second step at the\nelectroweak scale temperature. Collider data from the LHC plays a crucial role\nin constraining the parameter space conducive to this two-step transition.\nFurthermore, satisfying the nucleation condition necessitates the masses of\nscalar bosons in the hidden sector to align with the electroweak scale,\npotentially probed by future collider detectors. The stochastic gravitational\nwave energy spectrum associated with the phase transition is computed. The\nresults indicate that forthcoming detectors such as BBO, LISA, DECIGO, TianQin\nand Taiji could potentially detect the gravitational wave signals generated by\nthe first-order phase transition. Additionally, we find that the parameter\nspace probed by gravitational waves can also be searched for in future dark\nmatter direct detection experiments, in particular those designed for dark\nmatter masses in the sub-GeV range using the superfluid Helium target\ndetectors.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/"}