{"id":"2408.06553","title":"Centralization vs. decentralization in multi-robot coverage: Ground\n  robots under UAV supervision","authors":"Aryo Jamshidpey, Mostafa Wahby, Mary Katherine Heinrich, Michael\n  Allwright, Weixu Zhu, Marco Dorigo","authorsParsed":[["Jamshidpey","Aryo",""],["Wahby","Mostafa",""],["Heinrich","Mary Katherine",""],["Allwright","Michael",""],["Zhu","Weixu",""],["Dorigo","Marco",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 01:33:19 GMT"}],"updateDate":"2024-08-14","timestamp":1723512799000,"abstract":"  In swarm robotics, decentralized control is often proposed as a more scalable\nand fault-tolerant alternative to centralized control. However, centralized\nbehaviors are often faster and more efficient than their decentralized\ncounterparts. In any given application, the goals and constraints of the task\nbeing solved should guide the choice to use centralized control, decentralized\ncontrol, or a combination of the two. Currently, the tradeoffs that exist\nbetween centralization and decentralization have not been thoroughly studied.\nIn this paper, we investigate these tradeoffs for multi-robot coverage, and\nfind that they are more nuanced than expected. For instance, our findings\nreinforce the expectation that more decentralized control will provide better\nscalability, but contradict the expectation that more decentralized control\nwill perform better in environments with randomized obstacles. Beginning with a\ngroup of fully independent ground robots executing coverage, we add unmanned\naerial vehicles as supervisors and progressively increase the degree to which\nthe supervisors use centralized control, in terms of access to global\ninformation and a central coordinating entity. We compare, using the\nmulti-robot physics-based simulation environment ARGoS, the following four\ncontrol approaches: decentralized control, hybrid control, centralized control,\nand predetermined control. In comparing the ground robots performing the\ncoverage task, we assess the speed and efficiency advantages of centralization\n-- in terms of coverage completeness and coverage uniformity -- and we assess\nthe scalability and fault tolerance advantages of decentralization. We also\nassess the energy expenditure disadvantages of centralization due to different\nenergy consumption rates of ground robots and unmanned aerial vehicles,\naccording to the specifications of robots available off-the-shelf.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}