{"id":"2408.11339","title":"Deep Reinforcement Learning for Decentralized Multi-Robot Control: A DQN\n  Approach to Robustness and Information Integration","authors":"Bin Wu and C Steve Suh","authorsParsed":[["Wu","Bin",""],["Suh","C Steve",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 04:49:49 GMT"}],"updateDate":"2024-08-22","timestamp":1724215789000,"abstract":"  The superiority of Multi-Robot Systems (MRS) in various complex environments\nis unquestionable. However, in complex situations such as search and rescue,\nenvironmental monitoring, and automated production, robots are often required\nto work collaboratively without a central control unit. This necessitates an\nefficient and robust decentralized control mechanism to process local\ninformation and guide the robots' behavior. In this work, we propose a new\ndecentralized controller design method that utilizes the Deep Q-Network (DQN)\nalgorithm from deep reinforcement learning, aimed at improving the integration\nof local information and robustness of multi-robot systems. The designed\ncontroller allows each robot to make decisions independently based on its local\nobservations while enhancing the overall system's collaborative efficiency and\nadaptability to dynamic environments through a shared learning mechanism.\nThrough testing in simulated environments, we have demonstrated the\neffectiveness of this controller in improving task execution efficiency,\nstrengthening system fault tolerance, and enhancing adaptability to the\nenvironment. Furthermore, we explored the impact of DQN parameter tuning on\nsystem performance, providing insights for further optimization of the\ncontroller design. Our research not only showcases the potential application of\nthe DQN algorithm in the decentralized control of multi-robot systems but also\noffers a new perspective on how to enhance the overall performance and\nrobustness of the system through the integration of local information.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}