{"id":"2408.12779","title":"Investigating LLM Applications in E-Commerce","authors":"Chester Palen-Michel, Ruixiang Wang, Yipeng Zhang, David Yu, Canran\n  Xu, Zhe Wu","authorsParsed":[["Palen-Michel","Chester",""],["Wang","Ruixiang",""],["Zhang","Yipeng",""],["Yu","David",""],["Xu","Canran",""],["Wu","Zhe",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 00:57:37 GMT"}],"updateDate":"2024-08-26","timestamp":1724374657000,"abstract":"  The emergence of Large Language Models (LLMs) has revolutionized natural\nlanguage processing in various applications especially in e-commerce. One\ncrucial step before the application of such LLMs in these fields is to\nunderstand and compare the performance in different use cases in such tasks.\nThis paper explored the efficacy of LLMs in the e-commerce domain, focusing on\ninstruction-tuning an open source LLM model with public e-commerce datasets of\nvarying sizes and comparing the performance with the conventional models\nprevalent in industrial applications. We conducted a comprehensive comparison\nbetween LLMs and traditional pre-trained language models across specific tasks\nintrinsic to the e-commerce domain, namely classification, generation,\nsummarization, and named entity recognition (NER). Furthermore, we examined the\neffectiveness of the current niche industrial application of very large LLM,\nusing in-context learning, in e-commerce specific tasks. Our findings indicate\nthat few-shot inference with very large LLMs often does not outperform\nfine-tuning smaller pre-trained models, underscoring the importance of\ntask-specific model optimization.Additionally, we investigated different\ntraining methodologies such as single-task training, mixed-task training, and\nLoRA merging both within domain/tasks and between different tasks. Through\nrigorous experimentation and analysis, this paper offers valuable insights into\nthe potential effectiveness of LLMs to advance natural language processing\ncapabilities within the e-commerce industry.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"ntUEXUMi2XhG1wePJWTySyMsg6rYvzE6wfGpK79Xnzg","pdfSize":"203656"}
