{"id":"2408.08396","title":"Level Up Your Tutorials: VLMs for Game Tutorials Quality Assessment","authors":"Daniele Rege Cambrin, Gabriele Scaffidi Militone, Luca Colomba,\n  Giovanni Malnati, Daniele Apiletti, Paolo Garza","authorsParsed":[["Cambrin","Daniele Rege",""],["Militone","Gabriele Scaffidi",""],["Colomba","Luca",""],["Malnati","Giovanni",""],["Apiletti","Daniele",""],["Garza","Paolo",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 19:46:21 GMT"}],"updateDate":"2024-08-19","timestamp":1723751181000,"abstract":"  Designing effective game tutorials is crucial for a smooth learning curve for\nnew players, especially in games with many rules and complex core mechanics.\nEvaluating the effectiveness of these tutorials usually requires multiple\niterations with testers who have no prior knowledge of the game. Recent\nVision-Language Models (VLMs) have demonstrated significant capabilities in\nunderstanding and interpreting visual content. VLMs can analyze images, provide\ndetailed insights, and answer questions about their content. They can recognize\nobjects, actions, and contexts in visual data, making them valuable tools for\nvarious applications, including automated game testing. In this work, we\npropose an automated game-testing solution to evaluate the quality of game\ntutorials. Our approach leverages VLMs to analyze frames from video game\ntutorials, answer relevant questions to simulate human perception, and provide\nfeedback. This feedback is compared with expected results to identify confusing\nor problematic scenes and highlight potential errors for developers. In\naddition, we publish complete tutorial videos and annotated frames from\ndifferent game versions used in our tests. This solution reduces the need for\nextensive manual testing, especially by speeding up and simplifying the initial\ndevelopment stages of the tutorial to improve the final game experience.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"heVUgbV3I3rlnJWyl7WomgKP4OIE6VPEydIcNrHttEc","pdfSize":"8257440"}
