{"id":"2408.07011","title":"A complete characterization of pairs of binary phylogenetic trees with\n  identical $A_k$-alignments","authors":"Mirko Wilde and Mareike Fischer","authorsParsed":[["Wilde","Mirko",""],["Fischer","Mareike",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 16:18:00 GMT"}],"updateDate":"2024-08-14","timestamp":1723565880000,"abstract":"  Phylogenetic trees play a key role in the reconstruction of evolutionary\nrelationships. Typically, they are derived from aligned sequence data (like\nDNA, RNA, or proteins) by using optimization criteria like, e.g., maximum\nparsimony (MP). It is believed that the latter is able to reconstruct the\n\\enquote{true} tree, i.e., the tree that generated the data, whenever the\nnumber of substitutions required to explain the data with that tree is\nrelatively small compared to the size of the tree (measured in the number $n$\nof leaves of the tree, which represent the species under investigation).\nHowever, reconstructing the correct tree from any alignment first and foremost\nrequires the given alignment to perform differently on the \\enquote{correct}\ntree than on others.\n  A special type of alignments, namely so-called $A_k$-alignments, has gained\nconsiderable interest in recent literature. These alignments consist of all\nbinary characters (\\enquote{sites}) which require precisely $k$ substitutions\non a given tree. It has been found that whenever $k$ is small enough (in\ncomparison to $n$), $A_k$-alignments uniquely characterize the trees that\ngenerated them. However, recent literature has left a significant gap between\n$k\\leq 2k+2$ -- namely the cases in which no such characterization is possible\n-- and $k\\geq 4k$ -- namely the cases in which this characterization works. It\nis the main aim of the present manuscript to close this gap, i.e., to present a\nfull characterization of all pairs of trees that share the same\n$A_k$-alignment. In particular, we show that indeed every binary phylogenetic\ntree with $n$ leaves is uniquely defined by its $A_k$-alignments if $n\\geq\n2k+3$. By closing said gap, we also ensure that our result is optimal.\n","subjects":["Quantitative Biology/Populations and Evolution","Mathematics/Combinatorics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}