{"id":"2408.08913","title":"MLoRA: Multi-Domain Low-Rank Adaptive Network for CTR Prediction","authors":"Zhiming Yang, Haining Gao, Dehong Gao, Luwei Yang, Libin Yang, Xiaoyan\n  Cai, Wei Ning, Guannan Zhang","authorsParsed":[["Yang","Zhiming",""],["Gao","Haining",""],["Gao","Dehong",""],["Yang","Luwei",""],["Yang","Libin",""],["Cai","Xiaoyan",""],["Ning","Wei",""],["Zhang","Guannan",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 05:53:02 GMT"}],"updateDate":"2024-08-20","timestamp":1723614782000,"abstract":"  Click-through rate (CTR) prediction is one of the fundamental tasks in the\nindustry, especially in e-commerce, social media, and streaming media. It\ndirectly impacts website revenues, user satisfaction, and user retention.\nHowever, real-world production platforms often encompass various domains to\ncater for diverse customer needs. Traditional CTR prediction models struggle in\nmulti-domain recommendation scenarios, facing challenges of data sparsity and\ndisparate data distributions across domains. Existing multi-domain\nrecommendation approaches introduce specific-domain modules for each domain,\nwhich partially address these issues but often significantly increase model\nparameters and lead to insufficient training. In this paper, we propose a\nMulti-domain Low-Rank Adaptive network (MLoRA) for CTR prediction, where we\nintroduce a specialized LoRA module for each domain. This approach enhances the\nmodel's performance in multi-domain CTR prediction tasks and is able to be\napplied to various deep-learning models. We evaluate the proposed method on\nseveral multi-domain datasets. Experimental results demonstrate our MLoRA\napproach achieves a significant improvement compared with state-of-the-art\nbaselines. Furthermore, we deploy it in the production environment of the\nAlibaba.COM. The online A/B testing results indicate the superiority and\nflexibility in real-world production environments. The code of our MLoRA is\npublicly available.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}