{"id":"2408.03588","title":"Facing the Music: Tackling Singing Voice Separation in Cinematic Audio\n  Source Separation","authors":"Karn N. Watcharasupat, Chih-Wei Wu, and Iroro Orife","authorsParsed":[["Watcharasupat","Karn N.",""],["Wu","Chih-Wei",""],["Orife","Iroro",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 07:04:29 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 00:52:40 GMT"}],"updateDate":"2024-08-27","timestamp":1723014269000,"abstract":"  Cinematic audio source separation (CASS), as a standalone problem of\nextracting individual stems from their mixture, is a fairly new subtask of\naudio source separation. A typical setup of CASS is a three-stem problem, with\nthe aim of separating the mixture into the dialogue (DX), music (MX), and\neffects (FX) stems. Given the creative nature of cinematic sound production,\nhowever, several edge cases exist; some sound sources do not fit neatly in any\nof these three stems, necessitating the use of additional auxiliary stems in\nproduction. One very common edge case is the singing voice in film audio, which\nmay belong in either the DX or MX or neither, depending heavily on the\ncinematic context. In this work, we demonstrate a very straightforward\nextension of the dedicated-decoder Bandit and query-based single-decoder\nBanquet models to a four-stem problem, treating non-musical dialogue,\ninstrumental music, singing voice, and effects as separate stems.\nInterestingly, the query-based Banquet model outperformed the dedicated-decoder\nBandit model. We hypothesized that this is due to a better feature alignment at\nthe bottleneck as enforced by the band-agnostic FiLM layer. Dataset and model\nimplementation will be made available at\nhttps://github.com/kwatcharasupat/source-separation-landing.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Sound"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}