{"id":"2408.13553","title":"Decoupling technology for systems of evolutionary equations","authors":"Petr N. Vabishchevich","authorsParsed":[["Vabishchevich","Petr N.",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 11:27:56 GMT"}],"updateDate":"2024-08-27","timestamp":1724498876000,"abstract":"  Numerical methods of approximate solution of the Cauchy problem for coupled\nsystems of evolution equations are considered. Separating simpler subproblems\nfor individual components of the solution achieves simplification of the\nproblem at a new level in time. The decoupling method, a significant approach\nto simplifying the problem, is based on the decomposition of the problem's\noperator matrix. The approximate solution is constructed based on the linear\ncomposition of solutions to auxiliary problems. The paper investigates\ndecoupling variants based on extracting the diagonal part of the operator\nmatrix and the lower and upper triangular submatrices. The study introduces a\nnew decomposition approach, which involves splitting the operator matrix into\nrows and columns. The composition stage utilizes various variants of splitting\nschemes, showcasing the versatility of the approach. In additive\noperator-difference schemes, we can distinguish explicit-implicit schemes,\nfactorized schemes for two-component splitting, and regularized schemes for\ngeneral multicomponent splitting. The study of stability of two- and\nthree-level decoupling composition schemes is carried out using the theory of\nstability (correctness) of operator-difference schemes for finite-dimensional\nHilbert spaces. The theoretical results of the decoupling technique for systems\nof evolution equations are illustrated on a test two-dimensional problem for a\ncoupled system of two diffusion equations with inhomogeneous self- and\ncross-diffusion coefficients.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xxYhQaxX8zf1rC94ngGcD0u3PK4mQSPKmEFhxgzwob8","pdfSize":"8942041"}
