{"id":"2408.10377","title":"Approaching the Physical Limits of Specific Absorption Rate in\n  Hyperthermia Applications","authors":"S. Scheibler, H. Wei, J. Ackers, S. Helbig, S. Koraltan, R.\n  Peremadathil-Pradeep, M. Krupi\\'nski, M. Graeser, D. Suess, I. K. Herrmann,\n  and H. J. Hug","authorsParsed":[["Scheibler","S.",""],["Wei","H.",""],["Ackers","J.",""],["Helbig","S.",""],["Koraltan","S.",""],["Peremadathil-Pradeep","R.",""],["Krupiński","M.",""],["Graeser","M.",""],["Suess","D.",""],["Herrmann","I. K.",""],["Hug","H. J.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 19:47:41 GMT"}],"updateDate":"2024-08-21","timestamp":1724096861000,"abstract":"  Magnetic nanoparticle-based hyperthermia has emerged as a promising\ntherapeutic modality for treating malignant solid tumors that exhibit\nresistance to conventional cancer treatments, including chemotherapy and\nradiation. Despite the clinical approval of superparamagnetic iron oxide\nnanoparticles (SPIONs) for the adjunct treatment of recurrent glioblastoma,\ntheir therapeutic potential is undercut by chemical synthesis-inherent\nlimitations such as low saturation magnetization, superparamagnetic\ncharacteristics, and a wide nanoparticle size distribution. Here, we introduce\nan micromagnetic modelling-based SAF-MDP design with in-plane magnetization,\noptimized through specific uniaxial anisotropy adjustments to avert the\nspin-flop phenomenon and eliminate hysteresis-free hard-axis magnetization\nloops, paired with a mechanofluidic modeling approach to assess the alignment\nof the SAF-MDP to the applied alternating magnetic field (AMF). Magnetic Force\nMicroscopy characterization provides unprecedented insights into the particle\nswitching behaviour on a single particle scale. This comprehensive strategy\nspanning micromagnetics and advanced magnetic characterization enables the\ndesign of particles with heating efficiencies to approach the theoretical\nmaximum, dictated by the saturation magnetization of the utilized materials and\nlimited solely by the biologically acceptable frequencies and amplitudes of the\noscillating magnetic field. Our work not only addresses the limitations\nencountered by previous methodologies but also sets the stage for the\ndevelopment of advanced SAF-MDP designs and alignment techniques. This opens a\nnew avenue to hyperthermia-based cancer therapy, delineated only by the\nboundaries of physical laws and biological safety standards.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gjABh1O3LcMrfBNFJQCgYND2tkvzTVSg9YnPhYMPFpY","pdfSize":"14012824"}
