{"id":"2408.11957","title":"Bimodal Visualization of Industrial X-Ray and Neutron Computed\n  Tomography Data","authors":"Xuan Huang, Haichao Miao, Hyojin Kim, Andrew Townsend, Kyle Champley,\n  Joseph Tringe, Valerio Pascucci, Peer-Timo Bremer","authorsParsed":[["Huang","Xuan",""],["Miao","Haichao",""],["Kim","Hyojin",""],["Townsend","Andrew",""],["Champley","Kyle",""],["Tringe","Joseph",""],["Pascucci","Valerio",""],["Bremer","Peer-Timo",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 19:24:12 GMT"}],"updateDate":"2024-08-23","timestamp":1724268252000,"abstract":"  Advanced manufacturing creates increasingly complex objects with material\ncompositions that are often difficult to characterize by a single modality. Our\ncollaborating domain scientists are going beyond traditional methods by\nemploying both X-ray and neutron computed tomography to obtain complementary\nrepresentations expected to better resolve material boundaries. However, the\nuse of two modalities creates its own challenges for visualization, requiring\neither complex adjustments of bimodal transfer functions or the need for\nmultiple views. Together with experts in nondestructive evaluation, we designed\na novel interactive bimodal visualization approach to create a combined view of\nthe co-registered X-ray and neutron acquisitions of industrial objects. Using\nan automatic topological segmentation of the bivariate histogram of X-ray and\nneutron values as a starting point, the system provides a simple yet effective\ninterface to easily create, explore, and adjust a bimodal visualization. We\npropose a widget with simple brushing interactions that enables the user to\nquickly correct the segmented histogram results. Our semiautomated system\nenables domain experts to intuitively explore large bimodal datasets without\nthe need for either advanced segmentation algorithms or knowledge of\nvisualization techniques. We demonstrate our approach using synthetic examp\n","subjects":["Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by/4.0/"}