{"id":"2408.08822","title":"PFDiff: Training-free Acceleration of Diffusion Models through the\n  Gradient Guidance of Past and Future","authors":"Guangyi Wang, Yuren Cai, Lijiang Li, Wei Peng, Songzhi Su","authorsParsed":[["Wang","Guangyi",""],["Cai","Yuren",""],["Li","Lijiang",""],["Peng","Wei",""],["Su","Songzhi",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 16:12:44 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 13:50:46 GMT"}],"updateDate":"2024-09-19","timestamp":1723824764000,"abstract":"  Diffusion Probabilistic Models (DPMs) have shown remarkable potential in\nimage generation, but their sampling efficiency is hindered by the need for\nnumerous denoising steps. Most existing solutions accelerate the sampling\nprocess by proposing fast ODE solvers. However, the inevitable discretization\nerrors of the ODE solvers are significantly magnified when the number of\nfunction evaluations (NFE) is fewer. In this work, we propose PFDiff, a novel\ntraining-free and orthogonal timestep-skipping strategy, which enables existing\nfast ODE solvers to operate with fewer NFE. Specifically, PFDiff initially\nutilizes gradient replacement from past time steps to predict a \"springboard\".\nSubsequently, it employs this \"springboard\" along with foresight updates\ninspired by Nesterov momentum to rapidly update current intermediate states.\nThis approach effectively reduces unnecessary NFE while correcting for\ndiscretization errors inherent in first-order ODE solvers. Experimental results\ndemonstrate that PFDiff exhibits flexible applicability across various\npre-trained DPMs, particularly excelling in conditional DPMs and surpassing\nprevious state-of-the-art training-free methods. For instance, using DDIM as a\nbaseline, we achieved 16.46 FID (4 NFE) compared to 138.81 FID with DDIM on\nImageNet 64x64 with classifier guidance, and 13.06 FID (10 NFE) on Stable\nDiffusion with 7.5 guidance scale.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}