{"id":"2408.05484","title":"Interacting Models of Dark Energy and Dark Matter in Einstein scalar\n  Gauss Bonnet Gravity","authors":"Saddam Hussain, Simran Arora, Yamuna Rana, Benjamin Rose, and Anzhong\n  Wang","authorsParsed":[["Hussain","Saddam",""],["Arora","Simran",""],["Rana","Yamuna",""],["Rose","Benjamin",""],["Wang","Anzhong",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 08:25:52 GMT"}],"updateDate":"2024-08-13","timestamp":1723278352000,"abstract":"  We study the dynamics of the interacting models between the Gauss-Bonnet (GB)\ncoupled scalar field and the dark matter fluid in a homogeneous and isotropic\nbackground. A key feature of GB coupling models is the varying speed of\ngravitational waves (GWs). We utilize recent constraints on the GW speed and\nconduct our analysis in two primary scenarios: model-dependent and\nmodel-independent. In the model-dependent scenario, where determining the GW\nspeed requires a specific GB coupling functional form, we choose an exponential\nGB coupling. We adopt a dynamical system analysis to obtain the necessary\nconstraints on the model parameters that describe different phases of the\nuniverse and produce a stable late-time accelerating solution following the GW\nconstraint, and find that to satisfy all these constraints, fine-tuning of the\nfree parameters involved in the models is often needed. In the\nmodel-independent scenario, the GW speed is fixed to one, and we construct the\nautonomous system to identify the late-time stable accelerating critical\npoints. Furthermore, we adopt a Bayesian inference method using late-time\nobservational data sets, including 31 data points from cosmic chronometer data\n(Hubble data) and 1701 data points from Pantheon+ and find that all the\nobservational constraints can be satisfied without fine-tuning. In addition, we\nalso utilize simulated binned Roman and LSST data to study the evolution of the\nuniverse in the model-independent scenario. We find that the model shows\nsignificant deviation at higher redshifts from $\\Lambda$CDM and fits the\ncurrent data much better than $\\Lambda$CDM within the error bars.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4_ftvWo4ZTxpxdtPBTrR_oFgyZMRHOvOZhkV9vh9DU8","pdfSize":"4284485"}
