{"id":"2408.10803","title":"Estimating the Atmospheric Parameters of Early-type Stars from the\n  Chinese Space Station Telescope (CSST) Slitless Spectra Survey","authors":"JiaRui Rao, HaiLiang Chen, JianPing Xiong, LuQian Wang, YanJun Guo,\n  JiaJia Li, Chao Liu, ZhanWen Han and XueFei Chen","authorsParsed":[["Rao","JiaRui",""],["Chen","HaiLiang",""],["Xiong","JianPing",""],["Wang","LuQian",""],["Guo","YanJun",""],["Li","JiaJia",""],["Liu","Chao",""],["Han","ZhanWen",""],["Chen","XueFei",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 12:52:28 GMT"}],"updateDate":"2024-08-21","timestamp":1724158348000,"abstract":"  The measurement of atmospheric parameters is fundamental for scientific\nresearch using stellar spectra. The Chinese Space Station Telescope (CSST),\nscheduled to be launched in 2024, will provide researchers with hundreds of\nmillions of slitless spectra for stars during a 10 yr survey. And machine\nlearning has unparalleled efficiency in processing large amounts of data\ncompared to manual processing. Here we studied the stellar parameters of\nearly-type stars (effective temperature Teff more than 15,000 K) based on the\ndesign indicators of the CSST slitless spectrum and the machine learning\nalgorithm, Stellar LAbel Machine. We used the Potsdam Wolf-Rayet (POWR)\nsynthetic spectra library for cross validation. Then we tested the reliability\nof machine learning results by using the Next Generation Spectrum Library\n(NGSL) from Hubble Space Telescope observation data. We use the spectra with\nthe impact of interstellar extinction (AV = 0, 0.5, 1, 1.5, 2 mag) and radial\nvelocity (RV = -50, -30, 0, 30, 50 km s-1) from the POWR library as the test\nset. When RV = 0 km s-1 and AV = 0 mag, the average value and standard\ndeviation for 3 wavelength ranges (2550-4050 Ang (R = 287); 4050-6300 Ang (R =\n232); 6300-10000 Ang (R = 207)) are -66 K, 550 K, and 356 K for Teff, and 0.004\nc.g.s, -0.024 c.g.s, and 0.01 c.g.s for log g. When using the observed data\nfrom NGSL as the testing samples, the deviation of Teff is less than 5%, and\nthe deviation of log g is less than 11%. In addition, we also test the\ninfluence of shifting of spectra on the parameters accuracy. The deviation of\nTeff for the case with a shift of 5 Ang and 10 Ang are 3.6% and 4.3%,\nrespectively; the deviation of log g are 4.2% and 5.1%. These results\ndemonstrate that we can obtain relatively accurate stellar parameters of a\npopulation of early-type stars with the CSST slitless spectra and a\nmachine-learning method.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}