{"id":"2408.11422","title":"Scenario-Based Robust Optimization of Tree Structures","authors":"Spyros Angelopoulos, Christoph D\\\"urr, Alex Elenter, Georgii Melidi","authorsParsed":[["Angelopoulos","Spyros",""],["Dürr","Christoph",""],["Elenter","Alex",""],["Melidi","Georgii",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 08:26:14 GMT"}],"updateDate":"2024-08-22","timestamp":1724228774000,"abstract":"  We initiate the study of tree structures in the context of scenario-based\nrobust optimization. Specifically, we study Binary Search Trees (BSTs) and\nHuffman coding, two fundamental techniques for efficiently managing and\nencoding data based on a known set of frequencies of keys. Given $k$ different\nscenarios, each defined by a distinct frequency distribution over the keys, our\nobjective is to compute a single tree of best-possible performance, relative to\nany scenario.\n  We consider, as performance metrics, the competitive ratio, which compares\nmultiplicatively the cost of the solution to the tree of least cost among all\nscenarios, as well as the regret, which induces a similar, but additive\ncomparison. For BSTs, we show that the problem is NP-hard across both metrics.\nWe also show how to obtain a tree of competitive ratio $\\lceil \\log_2(k+1)\n\\rceil$, and we prove that this ratio is optimal. For Huffman Trees, we show\nthat the problem is, likewise, NP-hard across both metrics; we also give an\nalgorithm of regret $\\lceil \\log_2 k \\rceil$, which we show is near-optimal, by\nproving a lower bound of $\\lfloor \\log_2 k \\rfloor$. Last, we give a\npolynomial-time algorithm for computing Pareto-optimal BSTs with respect to\ntheir regret, assuming scenarios defined by uniform distributions over the\nkeys. This setting captures, in particular, the first study of fairness in the\ncontext of data structures. We provide an experimental evaluation of all\nalgorithms. To this end, we also provide mixed integer linear program\nformulation for computing optimal trees.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://creativecommons.org/licenses/by/4.0/"}