{"id":"2408.00568","title":"Enhancing Digital Forensics Readiness In Big Data Wireless Medical\n  Networks: A Secure Decentralised Framework","authors":"Cephas Mpungu, Carlisle George, and Glenford Mapp","authorsParsed":[["Mpungu","Cephas",""],["George","Carlisle",""],["Mapp","Glenford",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 14:01:49 GMT"}],"updateDate":"2024-08-02","timestamp":1722520909000,"abstract":"  Wireless medical networks are pivotal for chronic disease management, yet the\nsensitive Big Data they generate presents administration challenges and cyber\nvulnerability. This Big Data is valuable within both healthcare and legal\ncontexts, serving as a resource for investigating medical malpractice, civil\ncases, criminal activities, and network-related incidents. However, the rapid\nevolution of network technologies and data creates complexities in digital\nforensics investigations and audits. To address these issues, this paper\nproposes a secure decentralised framework aimed at bolstering digital forensics\nreadiness (DFR) in Big Data wireless medical networks by identifying security\nthreats, complexities, and gaps in current research efforts. By improving the\nnetwork's resilience to cyber threats and aiding in medical malpractice\ninvestigations, this framework significantly advances digital forensics,\nwireless networks, and healthcare. It enhances digital forensics readiness,\nincident response, and the management of medical malpractice incidents in Big\nData wireless medical networks. A real-world scenario-based evaluation\ndemonstrated the framework's effectiveness in improving forensic readiness and\nresponse capabilities, validating its practical applicability and impact. A\ncomparison of the proposed framework with existing frameworks concluded that it\nis an advancement in framework design for DFR, especially in regard to Big Data\nprocessing, decentralised DFR storage and scalability.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"8cswmiB5ZaZqz9-v7BMzi12ZAALn1epLT0m9jQw2A88","pdfSize":"727975","txDigest":"8xkMsR6WUg8vRmYPXSCXTDckhU8xUiNhFz4WvZf4mHxV","endEpoch":"1","status":"CERTIFIED"}
