{"id":"2408.06826","title":"Cloud-Cloud Collision: Formation of Hub-Filament Systems and Associated\n  Gas Kinematics; Mass-collecting cone: A new signature of Cloud-Cloud\n  Collision","authors":"A. K. Maity, T. Inoue, Y. Fukui, L. K. Dewangan, H. Sano, R. I.\n  Yamada, K. Tachihara, N. K. Bhadari, and O. R. Jadhav","authorsParsed":[["Maity","A. K.",""],["Inoue","T.",""],["Fukui","Y.",""],["Dewangan","L. K.",""],["Sano","H.",""],["Yamada","R. I.",""],["Tachihara","K.",""],["Bhadari","N. K.",""],["Jadhav","O. R.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 11:38:11 GMT"}],"updateDate":"2024-08-14","timestamp":1723549091000,"abstract":"  Massive star-forming regions (MSFRs) are commonly associated with\nhub-filament systems (HFSs) and sites of cloud-cloud collision (CCC). Recent\nobservational studies of some MSFRs suggest a possible connection between CCC\nand the formation of HFSs. To understand this connection, we analyzed the\nmagneto-hydrodynamic simulation data from Inoue et al. (2018). This simulation\ninvolves the collision of a spherical turbulent molecular cloud with a\nplane-parallel sea of dense molecular gas at a relative velocity of about 10\nkm/s. Following the collision, the turbulent and non-uniform cloud undergoes\nshock compression, rapidly developing filamentary structures within the\ncompressed layer. We found that CCC can lead to the formation of HFSs, which is\na combined effect of turbulence, shock compression, magnetic field, and\ngravity. The collision between the cloud components shapes the filaments into a\ncone and drives inward flows among them. These inward flows merge at the vertex\nof the cone, rapidly accumulating high-density gas, which can lead to the\nformation of massive star(s). The cone acts as a mass-collecting machine,\ninvolving a non-gravitational early process of filament formation, followed by\ngravitational gas attraction to finalize the HFS. The gas distribution in the\nposition-velocity (PV) and position-position spaces highlights the challenges\nin detecting two cloud components and confirming their complementary\ndistribution if the colliding clouds have a large size difference. However,\nsuch CCC events can be confirmed by the PV diagrams presenting gas flow toward\nthe vertex of the cone, which hosts gravitationally collapsing high-density\nobjects, and by the magnetic field morphology curved toward the direction of\nthe collision.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}