{"id":"2408.16975","title":"Technical Report of HelixFold3 for Biomolecular Structure Prediction","authors":"Lihang Liu, Shanzhuo Zhang, Yang Xue, Xianbin Ye, Kunrui Zhu, Yuxin\n  Li, Yang Liu, Wenlai Zhao, Hongkun Yu, Zhihua Wu, Xiaonan Zhang, Xiaomin Fang","authorsParsed":[["Liu","Lihang",""],["Zhang","Shanzhuo",""],["Xue","Yang",""],["Ye","Xianbin",""],["Zhu","Kunrui",""],["Li","Yuxin",""],["Liu","Yang",""],["Zhao","Wenlai",""],["Yu","Hongkun",""],["Wu","Zhihua",""],["Zhang","Xiaonan",""],["Fang","Xiaomin",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 02:36:36 GMT"},{"version":"v2","created":"Mon, 9 Sep 2024 02:44:49 GMT"}],"updateDate":"2024-09-10","timestamp":1724985396000,"abstract":"  The AlphaFold series has transformed protein structure prediction with\nremarkable accuracy, often matching experimental methods. AlphaFold2,\nAlphaFold-Multimer, and the latest AlphaFold3 represent significant strides in\npredicting single protein chains, protein complexes, and biomolecular\nstructures. While AlphaFold2 and AlphaFold-Multimer are open-sourced,\nfacilitating rapid and reliable predictions, AlphaFold3 remains partially\naccessible through a limited online server and has not been open-sourced,\nrestricting further development. To address these challenges, the PaddleHelix\nteam is developing HelixFold3, aiming to replicate AlphaFold3's capabilities.\nUsing insights from previous models and extensive datasets, HelixFold3 achieves\nan accuracy comparable to AlphaFold3 in predicting the structures of\nconventional ligands, nucleic acids, and proteins. The initial release of\nHelixFold3 is available as open source on GitHub for academic research,\npromising to advance biomolecular research and accelerate discoveries. We also\nprovide online service at PaddleHelix website at\nhttps://paddlehelix.baidu.com/app/all/helixfold3/forecast.\n","subjects":["Quantitative Biology/Biomolecules","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"t4auEvrn7GAwQYfhXHOzBt3c_4hnzDXdvDfRnktKb1I","pdfSize":"530217"}
