{"id":"2408.10947","title":"Dr.Academy: A Benchmark for Evaluating Questioning Capability in\n  Education for Large Language Models","authors":"Yuyan Chen, Chenwei Wu, Songzhou Yan, Panjun Liu, Haoyu Zhou, Yanghua\n  Xiao","authorsParsed":[["Chen","Yuyan",""],["Wu","Chenwei",""],["Yan","Songzhou",""],["Liu","Panjun",""],["Zhou","Haoyu",""],["Xiao","Yanghua",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 15:36:30 GMT"}],"updateDate":"2024-08-21","timestamp":1724168190000,"abstract":"  Teachers are important to imparting knowledge and guiding learners, and the\nrole of large language models (LLMs) as potential educators is emerging as an\nimportant area of study. Recognizing LLMs' capability to generate educational\ncontent can lead to advances in automated and personalized learning. While LLMs\nhave been tested for their comprehension and problem-solving skills, their\ncapability in teaching remains largely unexplored. In teaching, questioning is\na key skill that guides students to analyze, evaluate, and synthesize core\nconcepts and principles. Therefore, our research introduces a benchmark to\nevaluate the questioning capability in education as a teacher of LLMs through\nevaluating their generated educational questions, utilizing Anderson and\nKrathwohl's taxonomy across general, monodisciplinary, and interdisciplinary\ndomains. We shift the focus from LLMs as learners to LLMs as educators,\nassessing their teaching capability through guiding them to generate questions.\nWe apply four metrics, including relevance, coverage, representativeness, and\nconsistency, to evaluate the educational quality of LLMs' outputs. Our results\nindicate that GPT-4 demonstrates significant potential in teaching general,\nhumanities, and science courses; Claude2 appears more apt as an\ninterdisciplinary teacher. Furthermore, the automatic scores align with human\nperspectives.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"scm8ESK3ZV87r8Ap5gXfcd0zsMP9oCpN2ZEzW7MUIzM","pdfSize":"3016453"}
