{"id":"2408.16036","title":"Efficient $k$-NN Search in IoT Data: Overlap Optimization in Tree-Based\n  Indexing Structures","authors":"Ala-Eddine Benrazek, Zineddine Kouahla, Brahim Farou, Hamid Seridi,\n  and Ibtissem Kemouguette","authorsParsed":[["Benrazek","Ala-Eddine",""],["Kouahla","Zineddine",""],["Farou","Brahim",""],["Seridi","Hamid",""],["Kemouguette","Ibtissem",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 16:16:55 GMT"}],"updateDate":"2024-08-30","timestamp":1724861815000,"abstract":"  The proliferation of interconnected devices in the Internet of Things (IoT)\nhas led to an exponential increase in data, commonly known as Big IoT Data.\nEfficient retrieval of this heterogeneous data demands a robust indexing\nmechanism for effective organization. However, a significant challenge remains:\nthe overlap in data space partitions during index construction. This overlap\nincreases node access during search and retrieval, resulting in higher resource\nconsumption, performance bottlenecks, and impedes system scalability. To\naddress this issue, we propose three innovative heuristics designed to quantify\nand strategically reduce data space partition overlap. The volume-based method\n(VBM) offers a detailed assessment by calculating the intersection volume\nbetween partitions, providing deeper insights into spatial relationships. The\ndistance-based method (DBM) enhances efficiency by using the distance between\npartition centers and radii to evaluate overlap, offering a streamlined yet\naccurate approach. Finally, the object-based method (OBM) provides a practical\nsolution by counting objects across multiple partitions, delivering an\nintuitive understanding of data space dynamics. Experimental results\ndemonstrate the effectiveness of these methods in reducing search time,\nunderscoring their potential to improve data space partitioning and enhance\noverall system performance.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Retrieval","Computing Research Repository/Performance"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}