{"id":"2408.10923","title":"LBC: Language-Based-Classifier for Out-Of-Variable Generalization","authors":"Kangjun Noh, Baekryun Seong, Hoyoon Byun, Youngjun Choi, Sungjin Song,\n  Kyungwoo Song","authorsParsed":[["Noh","Kangjun",""],["Seong","Baekryun",""],["Byun","Hoyoon",""],["Choi","Youngjun",""],["Song","Sungjin",""],["Song","Kyungwoo",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 15:05:02 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 15:51:33 GMT"},{"version":"v3","created":"Sat, 24 Aug 2024 03:22:09 GMT"}],"updateDate":"2024-08-27","timestamp":1724166302000,"abstract":"  Large Language Models (LLMs) have great success in natural language\nprocessing tasks such as response generation. However, their use in tabular\ndata has been limited due to their inferior performance compared to traditional\nmachine learning models (TMLs) such as XGBoost. We find that the pre-trained\nknowledge of LLMs enables them to interpret new variables that appear in a test\nwithout additional training, a capability central to the concept of\nOut-of-Variable (OOV). From the findings, we propose a\nLanguage-Based-Classifier (LBC), a classifier that maximizes the benefits of\nLLMs to outperform TMLs on OOV tasks. LBC employs three key methodological\nstrategies: 1) Categorical changes to adjust data to better fit the model's\nunderstanding, 2) Advanced order and indicator to enhance data representation\nto the model, and 3) Using verbalizer to map logit scores to classes during\ninference to generate model predictions. These strategies, combined with the\npre-trained knowledge of LBC, emphasize the model's ability to effectively\nhandle OOV tasks. We empirically and theoretically validate the superiority of\nLBC. LBC is the first study to apply an LLM-based model to OOV tasks. The\nsource code is at https://github.com/sksmssh/LBCforOOVGen\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}