{"id":"2408.11317","title":"The continuous accumulation of civilization core in the cycle of\n  elements-creature, benefits and weapons","authors":"Hongfa Zi, Zhen Liu","authorsParsed":[["Zi","Hongfa",""],["Liu","Zhen",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 03:51:40 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 00:31:05 GMT"}],"updateDate":"2024-09-02","timestamp":1724212300000,"abstract":"  The comprehensive strength of a country varies from strong to weak, divided\ninto three condition: descending, periodicity destruction or rapidly rising,\nExploring the differences can solve the development crisis. the most important\nthings for a country are interests, weapons and creature, corresponding to\nmoney, technology and people. The ship industry has two attribute of financial\nbenefits and technological weapons. Commercial ships can transport massive\ncommodity and warships carry updating of massive technological weapons; But a\nnew core: equity incentives have emerged, and it has helped the rapid\ndevelopment of the computer industry. This article uses comparative analysis\nand comparative historical analysis to observe the changes in the United States\nand China after the mutual circulation of two elements and the double\ncirculation of three elements in history, such as the growth rates of GDP and\npatent applications. Then, it summarizes the changes brought by the core of\ncivilization to the country.Through this article, it can be concluded that the\ncore of civilization consists of ships, equity incentives record-wisdom method;\nThrough the circulation of new elements, a country can transform into\ncivilizations with three cycles, achieving mutual circulation among the three\nand enhancing endogenous power; The core of civilization can enhance the\nstability of economic development, prevent economic crises, and achieve a more\nbalanced civilization.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}