{"id":"2408.13798","title":"Selectively Dilated Convolution for Accuracy-Preserving Sparse\n  Pillar-based Embedded 3D Object Detection","authors":"Seongmin Park, Minjae Lee, Junwon Choi, Jungwook Choi","authorsParsed":[["Park","Seongmin",""],["Lee","Minjae",""],["Choi","Junwon",""],["Choi","Jungwook",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 10:14:43 GMT"}],"updateDate":"2024-08-27","timestamp":1724580883000,"abstract":"  Pillar-based 3D object detection has gained traction in self-driving\ntechnology due to its speed and accuracy facilitated by the artificial\ndensification of pillars for GPU-friendly processing. However, dense pillar\nprocessing fundamentally wastes computation since it ignores the inherent\nsparsity of pillars derived from scattered point cloud data. Motivated by\nrecent embedded accelerators with native sparsity support, sparse pillar\nconvolution methods like submanifold convolution (SubM-Conv) aimed to reduce\nthese redundant computations by applying convolution only on active pillars but\nsuffered considerable accuracy loss. Our research identifies that this accuracy\nloss is due to the restricted fine-grained spatial information flow (fSIF) of\nSubM-Conv in sparse pillar networks. To overcome this restriction, we propose a\nselectively dilated (SD-Conv) convolution that evaluates the importance of\nencoded pillars and selectively dilates the convolution output, enhancing the\nreceptive field for critical pillars and improving object detection accuracy.\nTo facilitate actual acceleration with this novel convolution approach, we\ndesigned SPADE+ as a cost-efficient augmentation to existing embedded sparse\nconvolution accelerators. This design supports the SD-Conv without significant\ndemands in area and SRAM size, realizing superior trade-off between the speedup\nand model accuracy. This strategic enhancement allows our method to achieve\nextreme pillar sparsity, leading to up to 18.1x computational savings and 16.2x\nspeedup on the embedded accelerators, without compromising object detection\naccuracy.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}