{"id":"2408.00102","title":"Multidimensional asymptotic classes","authors":"Sylvy Anscombe, Dugald Macpherson, Charles Steinhorn, Daniel Wolf","authorsParsed":[["Anscombe","Sylvy",""],["Macpherson","Dugald",""],["Steinhorn","Charles",""],["Wolf","Daniel",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:21:03 GMT"}],"updateDate":"2024-08-02","timestamp":1722450063000,"abstract":"  We develop a general framework (multidimensional asymptotic classes, or\nm.a.c.s) for handling classes of finite first order structures with a strong\nuniformity condition on cardinalities of definable sets: The condition asserts\nthat definable families given by a formula \\phi(x,y) should take on a fixed\nnumber n_\\phi of approximate sizes in any M in the class, with those sizes\nvarying with M. The prototype is the class of all finite fields, where the\nuniformity is given by a theorem of Chatzidakis, van den Dries and Macintyre.\nIt inspired the development of asymptotic classes of finite structures, which\nthis new framework extends.\n  The underlying theory of m.a.c.s is developed, including preservation under\nbi-interpretability, and a proof that for the m.a.c. condition to hold it\nsuffices to consider formulas \\phi(x,y) with x a single variable. Many examples\nof m.a.c.s are given, including 2-sorted structures (F,V) where V is a vector\nspace over a finite field F possibly equipped with a bilinear form, and an\nexample arising from representations of quivers of finite representation type.\nWe also give examples and structural results for multidimensional exact classes\n(m.e.c.s), where the definable sets take a fixed number of precisely specified\ncardinalities, which again vary with M.\n  We also develop a notion of infinite generalised measurable structure,\nwhereby definable sets are assigned values in an ordered semiring. We show that\nany infinite ultraproduct of a m.a.c. is generalised measurable, that values\ncan be taken in an ordered ring if the m.a.c. is a m.e.c., and explore\nmodel-theoretic consequences of generalised measurability. Such a structure\ncannot have the strict order property, and stability-theoretic properties can\nbe read off from the measures in the semiring.\n","subjects":["Mathematics/Logic"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3787zpPMJzyZtXT1IRyTwf-WqOwNsP-wY4EkQXFtYPs","pdfSize":"771070"}
