{"id":"2408.15372","title":"AutoPatch: Automated Generation of Hotpatches for Real-Time Embedded\n  Devices","authors":"Mohsen Salehi and Karthik Pattabiraman","authorsParsed":[["Salehi","Mohsen",""],["Pattabiraman","Karthik",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 19:11:39 GMT"}],"updateDate":"2024-08-29","timestamp":1724785899000,"abstract":"  Real-time embedded devices like medical or industrial devices are\nincreasingly targeted by cyber-attacks. Prompt patching is crucial to mitigate\nthe serious consequences of such attacks on these devices. Hotpatching is an\napproach to apply a patch to mission-critical embedded devices without\nrebooting them. However, existing hotpatching approaches require developers to\nmanually write the hotpatch for target systems, which is time-consuming and\nerror-prone.\n  To address these issues, we propose AutoPatch, a new hotpatching technique\nthat automatically generates functionally equivalent hotpatches via static\nanalysis of the official patches. AutoPatch introduces a new software\ntriggering approach that supports diverse embedded devices, and preserves the\nfunctionality of the official patch. In contrast to prior work, AutoPatch does\nnot rely on hardware support for triggering patches, or on executing patches in\nspecialized virtual machines. We implemented AutoPatch using the LLVM compiler,\nand evaluated its efficiency, effectiveness and generality using 62 real CVEs\non four embedded devices with different specifications and architectures\nrunning popular RTOSes. We found that AutoPatch can fix more than 90% of CVEs,\nand resolve the vulnerability successfully. The results revealed an average\ntotal delay of less than 12.7 $\\mu s$ for fixing the vulnerabilities,\nrepresenting a performance improvement of 50% over RapidPatch, a\nstate-of-the-art approach. Further, our memory overhead, on average, was\nslightly lower than theirs (23%). Finally, AutoPatch was able to generate\nhotpatches for all four devices without any modifications.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"d9emmqFNdkq7_50QUmiXbtNq9iZKdlsMuj-1iSYamFo","pdfSize":"1230005"}
