{"id":"2408.01937","title":"Inflight Performance and Calibrations of the Lyman-alpha Solar Telescope\n  on board the Advanced Space-based Solar Observatory","authors":"Bo Chen, Li Feng, Guang Zhang, Hui Li, Lingping He, Kefei Song,\n  Quanfeng Guo, Ying Li, Yu Huang, Jingwei Li, Jie Zhao, Jianchao Xue, Gen Li,\n  Guanglu Shi, Dechao Song, Lei Lu, Beili Ying, Haifeng Wang, Shuang Dai,\n  Xiaodong Wang, Shilei Mao, Peng Wang, Kun Wu, Shuai Ren, Liang Sun, Xianwei\n  Yang, Mingyi Xia, Xiaoxue Zhang, Peng Zhou, Chen Tao, Yang Liu, Sibo Yu,\n  Xinkai Li, Shuting Li, Ping Zhang, Qiao Li, Zhengyuan Tian, Yue Zhou, Jun\n  Tian, Jiahui Shan, Xiaofeng Liu, Zhichen Jing, Weiqun Gan","authorsParsed":[["Chen","Bo",""],["Feng","Li",""],["Zhang","Guang",""],["Li","Hui",""],["He","Lingping",""],["Song","Kefei",""],["Guo","Quanfeng",""],["Li","Ying",""],["Huang","Yu",""],["Li","Jingwei",""],["Zhao","Jie",""],["Xue","Jianchao",""],["Li","Gen",""],["Shi","Guanglu",""],["Song","Dechao",""],["Lu","Lei",""],["Ying","Beili",""],["Wang","Haifeng",""],["Dai","Shuang",""],["Wang","Xiaodong",""],["Mao","Shilei",""],["Wang","Peng",""],["Wu","Kun",""],["Ren","Shuai",""],["Sun","Liang",""],["Yang","Xianwei",""],["Xia","Mingyi",""],["Zhang","Xiaoxue",""],["Zhou","Peng",""],["Tao","Chen",""],["Liu","Yang",""],["Yu","Sibo",""],["Li","Xinkai",""],["Li","Shuting",""],["Zhang","Ping",""],["Li","Qiao",""],["Tian","Zhengyuan",""],["Zhou","Yue",""],["Tian","Jun",""],["Shan","Jiahui",""],["Liu","Xiaofeng",""],["Jing","Zhichen",""],["Gan","Weiqun",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 05:35:14 GMT"}],"updateDate":"2024-08-06","timestamp":1722749714000,"abstract":"  The Lyman-alpha Solar Telescope (LST) on board the Advanced Space-based Solar\nObservatory (ASO-S) is the first payload to image the full solar disk and the\nsolar corona in both white-light (WL) and ultraviolet (UV) H I Lya, extending\nup to 2.5 solar radii (Rs). Since the launch of the ASO-S on 9 October 2022,\nLST has captured various significant solar activities including flares,\nprominences, coronal mass ejections (CMEs). LST covers different passbands of\n121.6 nm, 360 nm and 700 nm. The Lya Solar Disk Imager (SDI) has a field of\nview (FOV) of 38.4 arcmin and a spatial resolution of around 9.5 arcsec, while\nthe White-Light Solar Telescope (WST) has a FOV of 38.43 arcmin and a spatial\nresolution of around 3.0 arcsec. The FOV of the Lya Solar Corona Imager (SCI)\nreaches 81.1 arcmin and its spatial resolution is 4.3 arcsec. The stray-light\nlevel in the 700 nm waveband is about 7.8e-6 MSB (mean solar brightness) at 1.1\nRs and 7.6e-7 MSB at 2.5 Rs, and in the Lya waveband it is around 4.3e-3 MSB at\n1.1 Rs and 4.1e-4 MSB at 2.5 Rs. This article will detail the results from\non-orbit tests and calibrations.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}