{"id":"2408.00336","title":"Cybloids $-$ Creation and Control of Cybernetic Colloids","authors":"Debasish Saha and Sonja Tarama and Hartmut L\\\"owen and Stefan U.\n  Egelhaaf","authorsParsed":[["Saha","Debasish",""],["Tarama","Sonja",""],["Löwen","Hartmut",""],["Egelhaaf","Stefan U.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 07:14:48 GMT"}],"updateDate":"2024-08-02","timestamp":1722496488000,"abstract":"  Colloids play an important role in fundamental science as well as in nature\nand technology. They have had a strong impact on the fundamental understanding\nof statistical physics. For example, colloids have helped to obtain a better\nunderstanding of collective phenomena, ranging from phase transitions and glass\nformation to the swarming of active Brownian particles. Yet the success of\ncolloidal systems hinges crucially on the specific physical and chemical\nproperties of the colloidal particles, i.e. particles with the appropriate\ncharacteristics must be available. Here we present an idea to create particles\nwith freely selectable properties. The properties might depend, for example, on\nthe presence of other particles (hence mimicking specific pair or many-body\ninteractions), previous configurations (hence introducing some memory or\nfeedback), or a directional bias (hence changing the dynamics). Without\ndirectly interfering with the sample, each particle is fully controlled and can\nreceive external commands through a predefined algorithm that can take into\naccount any input parameters. This is realized with computer-controlled\ncolloids, which we term cybloids - short for cybernetic colloids. The potential\nof cybloids is illustrated by programming a time-delayed external potential\nacting on a single colloid and interaction potentials for many colloids. Both\nan attractive harmonic potential and an annular potential are implemented. For\na single particle, this programming can cause subdiffusive behavior or lend\nactivity. For many colloids, the programmed interaction potential allows to\nselect a crystal structure at wish. Beyond these examples, we discuss further\nopportunities which cybloids offer.\n","subjects":["Condensed Matter/Soft Condensed Matter","Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}