{"id":"2408.10950","title":"Talbot effect-based sensor measuring grating period change in\n  subwavelength range","authors":"Saumya J. Sarkar, M. Ebrahim-Zadeh, and G. K. Samanta","authorsParsed":[["Sarkar","Saumya J.",""],["Ebrahim-Zadeh","M.",""],["Samanta","G. K.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 15:41:53 GMT"}],"updateDate":"2024-08-21","timestamp":1724168513000,"abstract":"  Talbot length, the distance between two consecutive self-image planes along\nthe propagation axis for a periodic diffraction object (grating) illuminated by\na plane wave, depends on the period of the object and the wavelength of\nillumination. This property makes the Talbot effect a straightforward technique\nfor measuring the period of a periodic object (grating) by accurately\ndetermining the Talbot length for a given illumination wavelength. However,\nsince the Talbot length scale is proportional to the square of the grating\nperiod, traditional Talbot techniques face challenges when dealing with smaller\ngrating periods and minor changes in the grating period. Recently, we\ndemonstrated a Fourier transform technique-based Talbot imaging method that\nallows for controlled Talbot lengths of a periodic object with a constant\nperiod and illumination wavelength. Using this method, we successfully measured\nperiods as small as a few micrometers and detected sub-micrometer changes in\nthe periodic object. Furthermore, by measuring the Talbot length of gratings\nwith varying periods imaged through the combination of a thick lens of short\nfocal length and a thin lens of long focal length and large aperture, we\ndetermined the effective focal length of the thick lens in close agreement with\nthe theoretical effective focal length of a thick lens in the presence of\nspherical aberration. These findings establish the Talbot effect as an\neffective and simple technique for various sensing applications in optics and\nphotonics through the measurement of any physical parameter influencing the\nTalbot length of a periodic object.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}