{"id":"2408.02582","title":"Clustering and Mining Accented Speech for Inclusive and Fair Speech\n  Recognition","authors":"Jaeyoung Kim, Han Lu, Soheil Khorram, Anshuman Tripathi, Qian Zhang,\n  Hasim Sak","authorsParsed":[["Kim","Jaeyoung",""],["Lu","Han",""],["Khorram","Soheil",""],["Tripathi","Anshuman",""],["Zhang","Qian",""],["Sak","Hasim",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 16:00:07 GMT"}],"updateDate":"2024-08-06","timestamp":1722873607000,"abstract":"  Modern automatic speech recognition (ASR) systems are typically trained on\nmore than tens of thousands hours of speech data, which is one of the main\nfactors for their great success. However, the distribution of such data is\ntypically biased towards common accents or typical speech patterns. As a\nresult, those systems often poorly perform on atypical accented speech. In this\npaper, we present accent clustering and mining schemes for fair speech\nrecognition systems which can perform equally well on under-represented\naccented speech. For accent recognition, we applied three schemes to overcome\nlimited size of supervised accent data: supervised or unsupervised\npre-training, distributionally robust optimization (DRO) and unsupervised\nclustering. Three schemes can significantly improve the accent recognition\nmodel especially for unbalanced and small accented speech. Fine-tuning ASR on\nthe mined Indian accent speech using the proposed supervised or unsupervised\nclustering schemes showed 10.0% and 5.3% relative improvements compared to\nfine-tuning on the randomly sampled speech, respectively.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"A5d4h7o8nIOr7vvO7wmGsc3dCgM0vex8E4YUufw4dTo","pdfSize":"466844","txDigest":"DatMmN1b5j35Tc32YYY8P9mDm3m9gso2yZ9ppANHb3rC","endEpoch":"1","status":"CERTIFIED"}
