{"id":"2408.04535","title":"Synchronous Multi-modal Semantic Communication System with Packet-level\n  Coding","authors":"Yun Tian, Jingkai Ying, Zhijin Qin, Ye Jin, Xiaoming Tao","authorsParsed":[["Tian","Yun",""],["Ying","Jingkai",""],["Qin","Zhijin",""],["Jin","Ye",""],["Tao","Xiaoming",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 15:42:00 GMT"},{"version":"v2","created":"Sun, 11 Aug 2024 02:37:42 GMT"}],"updateDate":"2024-08-13","timestamp":1723131720000,"abstract":"  Although the semantic communication with joint semantic-channel coding design\nhas shown promising performance in transmitting data of different modalities\nover physical layer channels, the synchronization and packet-level forward\nerror correction of multimodal semantics have not been well studied. Due to the\nindependent design of semantic encoders, synchronizing multimodal features in\nboth the semantic and time domains is a challenging problem. In this paper, we\ntake the facial video and speech transmission as an example and propose a\nSynchronous Multimodal Semantic Communication System (SyncSC) with Packet-Level\nCoding. To achieve semantic and time synchronization, 3D Morphable Mode (3DMM)\ncoefficients and text are transmitted as semantics, and we propose a semantic\ncodec that achieves similar quality of reconstruction and synchronization with\nlower bandwidth, compared to traditional methods. To protect semantic packets\nunder the erasure channel, we propose a packet-Level Forward Error Correction\n(FEC) method, called PacSC, that maintains a certain visual quality performance\neven at high packet loss rates. Particularly, for text packets, a text packet\nloss concealment module, called TextPC, based on Bidirectional Encoder\nRepresentations from Transformers (BERT) is proposed, which significantly\nimproves the performance of traditional FEC methods. The simulation results\nshow that our proposed SyncSC reduce transmission overhead and achieve\nhigh-quality synchronous transmission of video and speech over the packet loss\nnetwork.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}