{"id":"2408.15356","title":"Optimal level set estimation for non-parametric tournament and\n  crowdsourcing problems","authors":"Maximilian Graf, Alexandra Carpentier, Nicolas Verzelen","authorsParsed":[["Graf","Maximilian",""],["Carpentier","Alexandra",""],["Verzelen","Nicolas",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 18:28:31 GMT"}],"updateDate":"2024-08-29","timestamp":1724783311000,"abstract":"  Motivated by crowdsourcing, we consider a problem where we partially observe\nthe correctness of the answers of $n$ experts on $d$ questions. In this paper,\nwe assume that both the experts and the questions can be ordered, namely that\nthe matrix $M$ containing the probability that expert $i$ answers correctly to\nquestion $j$ is bi-isotonic up to a permutation of it rows and columns. When\n$n=d$, this also encompasses the strongly stochastic transitive (SST) model\nfrom the tournament literature. Here, we focus on the relevant problem of\ndeciphering small entries of $M$ from large entries of $M$, which is key in\ncrowdsourcing for efficient allocation of workers to questions. More precisely,\nwe aim at recovering a (or several) level set $p$ of the matrix up to a\nprecision $h$, namely recovering resp. the sets of positions $(i,j)$ in $M$\nsuch that $M_{ij}>p+h$ and $M_{i,j}<p-h$. We consider, as a loss measure, the\nnumber of misclassified entries. As our main result, we construct an efficient\npolynomial-time algorithm that turns out to be minimax optimal for this\nclassification problem. This heavily contrasts with existing literature in the\nSST model where, for the stronger reconstruction loss,\nstatistical-computational gaps have been conjectured. More generally, this\nshades light on the nature of statistical-computational gaps for permutations\nmodels.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}