{"id":"2408.14013","title":"A Multiscale Gradient Fusion Method for Edge Detection in Color Images\n  Utilizing the CBM3D Filter","authors":"Zhuoyue Wang, Yiyi Tao, Danqing Ma, Jiajing Chen","authorsParsed":[["Wang","Zhuoyue",""],["Tao","Yiyi",""],["Ma","Danqing",""],["Chen","Jiajing",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 04:36:10 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 15:34:09 GMT"}],"updateDate":"2024-09-04","timestamp":1724646970000,"abstract":"  In this paper, a color edge detection strategy based on collaborative\nfiltering combined with multiscale gradient fusion is proposed. The\nblock-matching and 3D (BM3D) filter are used to enhance the sparse\nrepresentation in the transform domain and achieve the effect of denoising,\nwhereas the multiscale gradient fusion makes up for the defect of loss of\ndetails in single-scale edge detection and improves the edge detection\nresolution and quality. First, the RGB images in the dataset are converted to\nXYZ color space images through mathematical operations. Second, the colored\nblock-matching and 3D (CBM3D) filter are used on the sparse images and to\nremove noise interference. Then, the vector gradients of the color image and\nthe anisotropic Gaussian directional derivative of the two scale parameters are\ncalculated and averaged pixel-by-pixel to obtain a new edge strength map.\nFinally, the edge features are enhanced by image normalization and non-maximum\nsuppression technology, and on that basis, the edge contour is obtained by\ndouble threshold selection and a new morphological refinement method. Through\nan experimental analysis of the edge detection dataset, the method proposed has\ngood noise robustness and high edge quality, which is better than the Color\nSobel, Color Canny, SE and Color AGDD as shown by the PR curve, AUC, PSNR, MSE,\nand FOM indicators.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}