{"id":"2408.05750","title":"FADE: A Dataset for Detecting Falling Objects around Buildings in Video","authors":"Zhigang Tu, Zitao Gao, Zhengbo Zhang, Chunluan Zhou, Junsong Yuan, Bo\n  Du","authorsParsed":[["Tu","Zhigang",""],["Gao","Zitao",""],["Zhang","Zhengbo",""],["Zhou","Chunluan",""],["Yuan","Junsong",""],["Du","Bo",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 11:43:56 GMT"}],"updateDate":"2024-08-13","timestamp":1723376636000,"abstract":"  Falling objects from buildings can cause severe injuries to pedestrians due\nto the great impact force they exert. Although surveillance cameras are\ninstalled around some buildings, it is challenging for humans to capture such\nevents in surveillance videos due to the small size and fast motion of falling\nobjects, as well as the complex background. Therefore, it is necessary to\ndevelop methods to automatically detect falling objects around buildings in\nsurveillance videos. To facilitate the investigation of falling object\ndetection, we propose a large, diverse video dataset called FADE (FAlling\nObject DEtection around Buildings) for the first time. FADE contains 1,881\nvideos from 18 scenes, featuring 8 falling object categories, 4 weather\nconditions, and 4 video resolutions. Additionally, we develop a new object\ndetection method called FADE-Net, which effectively leverages motion\ninformation and produces small-sized but high-quality proposals for detecting\nfalling objects around buildings. Importantly, our method is extensively\nevaluated and analyzed by comparing it with the previous approaches used for\ngeneric object detection, video object detection, and moving object detection\non the FADE dataset. Experimental results show that the proposed FADE-Net\nsignificantly outperforms other methods, providing an effective baseline for\nfuture research. The dataset and code are publicly available at\nhttps://fadedataset.github.io/FADE.github.io/.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}