{"id":"2408.06851","title":"BSS-CFFMA: Cross-Domain Feature Fusion and Multi-Attention Speech\n  Enhancement Network based on Self-Supervised Embedding","authors":"Alimjan Mattursun and Liejun Wang and Yinfeng Yu","authorsParsed":[["Mattursun","Alimjan",""],["Wang","Liejun",""],["Yu","Yinfeng",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 12:27:24 GMT"}],"updateDate":"2024-08-14","timestamp":1723552044000,"abstract":"  Speech self-supervised learning (SSL) represents has achieved\nstate-of-the-art (SOTA) performance in multiple downstream tasks. However, its\napplication in speech enhancement (SE) tasks remains immature, offering\nopportunities for improvement. In this study, we introduce a novel cross-domain\nfeature fusion and multi-attention speech enhancement network, termed\nBSS-CFFMA, which leverages self-supervised embeddings. BSS-CFFMA comprises a\nmulti-scale cross-domain feature fusion (MSCFF) block and a residual hybrid\nmulti-attention (RHMA) block. The MSCFF block effectively integrates\ncross-domain features, facilitating the extraction of rich acoustic\ninformation. The RHMA block, serving as the primary enhancement module,\nutilizes three distinct attention modules to capture diverse attention\nrepresentations and estimate high-quality speech signals.\n  We evaluate the performance of the BSS-CFFMA model through comparative and\nablation studies on the VoiceBank-DEMAND dataset, achieving SOTA results.\nFurthermore, we select three types of data from the WHAMR! dataset, a\ncollection specifically designed for speech enhancement tasks, to assess the\ncapabilities of BSS-CFFMA in tasks such as denoising only, dereverberation\nonly, and simultaneous denoising and dereverberation. This study marks the\nfirst attempt to explore the effectiveness of self-supervised embedding-based\nspeech enhancement methods in complex tasks encompassing dereverberation and\nsimultaneous denoising and dereverberation. The demo implementation of\nBSS-CFFMA is available online\\footnote[2]{https://github.com/AlimMat/BSS-CFFMA.\n\\label{s1}}.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}