{"id":"2408.13858","title":"Draw Like an Artist: Complex Scene Generation with Diffusion Model via\n  Composition, Painting, and Retouching","authors":"Minghao Liu, Le Zhang, Yingjie Tian, Xiaochao Qu, Luoqi Liu, Ting Liu","authorsParsed":[["Liu","Minghao",""],["Zhang","Le",""],["Tian","Yingjie",""],["Qu","Xiaochao",""],["Liu","Luoqi",""],["Liu","Ting",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 15:05:32 GMT"}],"updateDate":"2024-08-27","timestamp":1724598332000,"abstract":"  Recent advances in text-to-image diffusion models have demonstrated\nimpressive capabilities in image quality. However, complex scene generation\nremains relatively unexplored, and even the definition of `complex scene'\nitself remains unclear. In this paper, we address this gap by providing a\nprecise definition of complex scenes and introducing a set of Complex\nDecomposition Criteria (CDC) based on this definition. Inspired by the artists\npainting process, we propose a training-free diffusion framework called Complex\nDiffusion (CxD), which divides the process into three stages: composition,\npainting, and retouching. Our method leverages the powerful chain-of-thought\ncapabilities of large language models (LLMs) to decompose complex prompts based\non CDC and to manage composition and layout. We then develop an attention\nmodulation method that guides simple prompts to specific regions to complete\nthe complex scene painting. Finally, we inject the detailed output of the LLM\ninto a retouching model to enhance the image details, thus implementing the\nretouching stage. Extensive experiments demonstrate that our method outperforms\nprevious SOTA approaches, significantly improving the generation of\nhigh-quality, semantically consistent, and visually diverse images for complex\nscenes, even with intricate prompts.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"F1onNrsQb65BZjHcfSW0gD_Q0Imog85e4RYO8Yehxgc","pdfSize":"11024092"}
