{"id":"2408.07891","title":"Quantum-inspired Interpretable Deep Learning Architecture for Text\n  Sentiment Analysis","authors":"Bingyu Li, Da Zhang, Zhiyuan Zhao, Junyu Gao and Yuan Yuan","authorsParsed":[["Li","Bingyu",""],["Zhang","Da",""],["Zhao","Zhiyuan",""],["Gao","Junyu",""],["Yuan","Yuan",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 02:32:50 GMT"}],"updateDate":"2024-08-16","timestamp":1723689170000,"abstract":"  Text has become the predominant form of communication on social media,\nembedding a wealth of emotional nuances. Consequently, the extraction of\nemotional information from text is of paramount importance. Despite previous\nresearch making some progress, existing text sentiment analysis models still\nface challenges in integrating diverse semantic information and lack\ninterpretability. To address these issues, we propose a quantum-inspired deep\nlearning architecture that combines fundamental principles of quantum mechanics\n(QM principles) with deep learning models for text sentiment analysis.\nSpecifically, we analyze the commonalities between text representation and QM\nprinciples to design a quantum-inspired text representation method and further\ndevelop a quantum-inspired text embedding layer. Additionally, we design a\nfeature extraction layer based on long short-term memory (LSTM) networks and\nself-attention mechanisms (SAMs). Finally, we calculate the text density matrix\nusing the quantum complex numbers principle and apply 2D-convolution neural\nnetworks (CNNs) for feature condensation and dimensionality reduction. Through\na series of visualization, comparative, and ablation experiments, we\ndemonstrate that our model not only shows significant advantages in accuracy\nand efficiency compared to previous related models but also achieves a certain\nlevel of interpretability by integrating QM principles. Our code is available\nat QISA.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}