{"id":"2408.11737","title":"Dynamics of operator size distribution in q-local quantum Brownian SYK\n  and spin models","authors":"Shenglong Xu","authorsParsed":[["Xu","Shenglong",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 16:00:36 GMT"}],"updateDate":"2024-08-22","timestamp":1724256036000,"abstract":"  We study operator dynamics in Brownian quantum many-body models with\n$q$-local interactions. The operator dynamics are characterized by the\ntime-dependent size distribution, for which we derive an exact master equation\nin both the Brownian Majorana Sachdev-Ye-Kitaev (SYK) model and the spin model\nfor general $q$. This equation can be solved numerically for large systems.\nAdditionally, we obtain the analytical size distribution in the large $N$ limit\nfor arbitrary initial conditions and $q$. The distributions for both models\ntake the same form, related to the $\\chi$-squared distribution by a change of\nvariable, and strongly depend on the initial condition. For small initial\nsizes, the operator dynamics are characterized by a broad distribution that\nnarrows as the initial size increases. When the initial operator size is below\n$q-2$ for the Majorana model or $q-1$ for the spin model, the distribution\ndiverges in the small size limit at all times. The mean size of all operators,\nwhich can be directly measured by the out-of-time ordered correlator, grows\nexponentially during the early time. In the late time regime, the mean size for\na single Majorana or Pauli operator for all $q$ decays exponentially as $t\ne^{-t}$, much slower than all other operators, which decay as $e^{-t}$. At\nfinite $N$, the size distribution exhibits modulo-dependent branching within a\nsymmetry sector for the $q \\geq 8$ Majorana model and the $q \\geq 4$ spin\nmodel. Our results reveal universal features of operator dynamics in $q$-local\nquantum many-body systems.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Statistical Mechanics","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"N16daOqYUlQPpJqjpUao4aRE6p6V19p6RjrmJ7ntZpA","pdfSize":"2077274"}
