{"id":"2408.16845","title":"Enabling Local Editing in Diffusion Models by Joint and Individual\n  Component Analysis","authors":"Theodoros Kouzelis, Manos Plitsis, Mihalis A. Nicolaou, Yannis\n  Panagakis","authorsParsed":[["Kouzelis","Theodoros",""],["Plitsis","Manos",""],["Nicolaou","Mihalis A.",""],["Panagakis","Yannis",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:21:50 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 10:33:48 GMT"}],"updateDate":"2024-09-04","timestamp":1724955710000,"abstract":"  Recent advances in Diffusion Models (DMs) have led to significant progress in\nvisual synthesis and editing tasks, establishing them as a strong competitor to\nGenerative Adversarial Networks (GANs). However, the latent space of DMs is not\nas well understood as that of GANs. Recent research has focused on unsupervised\nsemantic discovery in the latent space of DMs by leveraging the bottleneck\nlayer of the denoising network, which has been shown to exhibit properties of a\nsemantic latent space. However, these approaches are limited to discovering\nglobal attributes. In this paper we address, the challenge of local image\nmanipulation in DMs and introduce an unsupervised method to factorize the\nlatent semantics learned by the denoising network of pre-trained DMs. Given an\narbitrary image and defined regions of interest, we utilize the Jacobian of the\ndenoising network to establish a relation between the regions of interest and\ntheir corresponding subspaces in the latent space. Furthermore, we disentangle\nthe joint and individual components of these subspaces to identify latent\ndirections that enable local image manipulation. Once discovered, these\ndirections can be applied to different images to produce semantically\nconsistent edits, making our method suitable for practical applications.\nExperimental results on various datasets demonstrate that our method can\nproduce semantic edits that are more localized and have better fidelity\ncompared to the state-of-the-art.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}