{"id":"2408.13065","title":"SIMPLE: Simultaneous Multi-Plane Self-Supervised Learning for Isotropic\n  MRI Restoration from Anisotropic Data","authors":"Rotem Benisty, Yevgenia Shteynman, Moshe Porat, Anat Illivitzki, Moti\n  Freiman","authorsParsed":[["Benisty","Rotem",""],["Shteynman","Yevgenia",""],["Porat","Moshe",""],["Illivitzki","Anat",""],["Freiman","Moti",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 13:48:11 GMT"}],"updateDate":"2024-08-26","timestamp":1724420891000,"abstract":"  Magnetic resonance imaging (MRI) is crucial in diagnosing various abdominal\nconditions and anomalies. Traditional MRI scans often yield anisotropic data\ndue to technical constraints, resulting in varying resolutions across spatial\ndimensions, which limits diagnostic accuracy and volumetric analysis.\nSuper-resolution (SR) techniques aim to address these limitations by\nreconstructing isotropic high-resolution images from anisotropic data. However,\ncurrent SR methods often rely on indirect mappings and limited training data,\nfocusing mainly on two-dimensional improvements rather than achieving true\nthree-dimensional isotropy. We introduce SIMPLE, a Simultaneous Multi-Plane\nSelf-Supervised Learning approach for isotropic MRI restoration from\nanisotropic data. Our method leverages existing anisotropic clinical data\nacquired in different planes, bypassing the need for simulated downsampling\nprocesses. By considering the inherent three-dimensional nature of MRI data,\nSIMPLE ensures realistic isotropic data generation rather than solely improving\nthrough-plane slices. This approach flexibility allows it to be extended to\nmultiple contrast types and acquisition methods commonly used in clinical\nsettings. Our experiments show that SIMPLE outperforms state-of-the-art methods\nboth quantitatively using the Kernel Inception Distance (KID) and\nsemi-quantitatively through radiologist evaluations. The generated isotropic\nvolume facilitates more accurate volumetric analysis and 3D reconstructions,\npromising significant improvements in clinical diagnostic capabilities.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"sTo0X1tcqs5463ou8ZtB-0xyaVjwCHqzWpvOXI71oCA","pdfSize":"5703691"}
