{"id":"2408.15756","title":"When Fire Attacks: How does Concrete Stand up to Heat ?","authors":"Anshu Sharma and Basuraj Bhowmik","authorsParsed":[["Sharma","Anshu",""],["Bhowmik","Basuraj",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 12:49:33 GMT"}],"updateDate":"2024-08-29","timestamp":1724849373000,"abstract":"  Fire is a process that generates both light and heat, posing a significant\nthreat to life and infrastructure. Buildings and structures are neither\ninherently susceptible to fire nor completely fire-resistant; their\nvulnerability largely depends on the specific causes of the fire, which can\nstem from natural events or human-induced hazards. High temperatures in\nstructures can lead to severe health risks for those directly affected,\ndiscomfort due to smoke, and compromised safety if the structure fails to meet\nsafety standards. Elevated temperatures can also cause significant structural\ndamage, becoming the primary cause of casualties, economic losses, and material\ndamage. This study aims to investigate the thermal and structural behavior of\nconcrete beams when exposed to extreme fire conditions. It examines the effects\nof different temperatures on plain and reinforced concrete (PCC and RCC,\nrespectively) using finite element method (FEM) simulations. Additionally, the\nstudy explores the performance of various concrete grades under severe\nconditions. The analysis reveals that higher-grade concrete exhibits greater\ndisplacement, crack width, stress, and strain but has lower thermal\nconductivity compared to lower-grade concrete. These elevated temperatures can\ninduce severe stresses in the concrete, leading to expansion, spalling, and the\npotential failure of the structure. Reinforced concrete, on the other hand,\nshows lower stress concentrations and minimal strain up to 250{\\deg}C. These\nfindings contribute to the existing knowledge and support the development of\nimproved fire safety regulations and performance-based design methodologies.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}