{"id":"2408.15460","title":"Lagrangian approach to origami vertex analysis: Kinematics","authors":"Matthew Grasinger, Andrew Gillman, Philip Buskohl","authorsParsed":[["Grasinger","Matthew",""],["Gillman","Andrew",""],["Buskohl","Philip",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 00:52:39 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 16:56:16 GMT"}],"updateDate":"2024-09-04","timestamp":1724806359000,"abstract":"  The use of origami in engineering has significantly expanded in recent years,\nspanning deployable structures across scales, folding robotics, and mechanical\nmetamaterials. However, finding foldable paths can be a formidable task as the\nkinematics are determined by a nonlinear system of equations, often with\nseveral degrees of freedom. In this work, we leverage a Lagrangian approach to\nderive reduced-order compatibility conditions for rigid-facet origami vertices\nwith reflection and rotational symmetries. Then, using the reduced-order\nconditions, we derive exact, multi-degree of freedom solutions for degree 6 and\ndegree 8 vertices with prescribed symmetries. The exact kinematic solutions\nallow us to efficiently investigate the topology of allowable kinematics,\nincluding the consideration of a self-contact constraint, and then visually\ninterpret the role of geometric design parameters on these admissible fold\npaths by monitoring the change in the kinematic topology. We then introduce a\nprocedure to construct lower symmetry kinematic solutions by breaking symmetry\nof higher order kinematic solutions in a systematic way that preserves\ncompatibility. The multi-degree of freedom solutions discovered here should\nassist with building intuition of the kinematic feasibility of higher degree\norigami vertices and also facilitate the development of new algorithmic\nprocedures for origami-engineering design.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}