{"id":"2408.01723","title":"A Novel Evaluation Framework for Image2Text Generation","authors":"Jia-Hong Huang, Hongyi Zhu, Yixian Shen, Stevan Rudinac, Alessio M.\n  Pacces, Evangelos Kanoulas","authorsParsed":[["Huang","Jia-Hong",""],["Zhu","Hongyi",""],["Shen","Yixian",""],["Rudinac","Stevan",""],["Pacces","Alessio M.",""],["Kanoulas","Evangelos",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 09:27:57 GMT"}],"updateDate":"2024-08-06","timestamp":1722677277000,"abstract":"  Evaluating the quality of automatically generated image descriptions is\nchallenging, requiring metrics that capture various aspects such as\ngrammaticality, coverage, correctness, and truthfulness. While human evaluation\noffers valuable insights, its cost and time-consuming nature pose limitations.\nExisting automated metrics like BLEU, ROUGE, METEOR, and CIDEr aim to bridge\nthis gap but often show weak correlations with human judgment. We address this\nchallenge by introducing a novel evaluation framework rooted in a modern large\nlanguage model (LLM), such as GPT-4 or Gemini, capable of image generation. In\nour proposed framework, we begin by feeding an input image into a designated\nimage captioning model, chosen for evaluation, to generate a textual\ndescription. Using this description, an LLM then creates a new image. By\nextracting features from both the original and LLM-created images, we measure\ntheir similarity using a designated similarity metric. A high similarity score\nsuggests that the image captioning model has accurately generated textual\ndescriptions, while a low similarity score indicates discrepancies, revealing\npotential shortcomings in the model's performance. Human-annotated reference\ncaptions are not required in our proposed evaluation framework, which serves as\na valuable tool for evaluating the effectiveness of image captioning models.\nIts efficacy is confirmed through human evaluation.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/"}