{"id":"2408.16048","title":"Investigating cannibalistic millisecond pulsar binaries using MESA: new\n  constraints from pulsar spin and mass evolution","authors":"Devina Misra, Manuel Linares, Claire S. Ye","authorsParsed":[["Misra","Devina",""],["Linares","Manuel",""],["Ye","Claire S.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-30","timestamp":1724868001000,"abstract":"  Compact binary millisecond pulsars (MSPs), with orbital periods $\\lesssim1$d,\nare key to understanding binary evolution involving massive neutron stars\n(NSs). Due to ablation of the companion by the rapidly spinning pulsar, these\nsystems are also known as spiders, categorized into two main branches: redbacks\n(RBs; companion mass in the range of 0.1 to 0.5 M$_{\\odot}$) and black widows\n(BWs; companion mass $\\lesssim$ 0.1 M$_{\\odot}$). We present models of low- and\nintermediate-mass X-ray binaries (XRBs) and compare them with observations of\nGalactic spiders (including the presence/absence of hydrogen lines in their\noptical spectra). We constrain and quantify the interaction between pulsar and\ncompanion. Using MESA, we create the allowed initial parameter space, modeling\nthe irradiation of the companion by the pulsar wind. For the first time in\nMESA, we include the detailed evolution of the pulsar spin. Efficient mass\naccretion onto the NS ($70\\%$ of mass transferred) with an X-ray irradiated\ndisc, followed by strong irradiation of the companion can explain most\nproperties of the observed spiders. Our RBs continue to the BW regime,\nconnecting the two branches of spiders. Our models explain the lack of hydrogen\nin some observed BWs with ultra-light companions. The mass required to spin-up\na NS to sub-milliseconds is high enough to collapse it into a black hole.\nFinally, we discuss the formation of RB-like spiders with giant companions and\norbital periods of several days (huntsmen) showing that they are unlikely to\nproduce super-massive NSs (maximum accreted mass $\\lesssim$0.5 M$_{\\odot}$).\nCannibalistic MSP binary formation depends heavily on the interplay between\naccretion onto the pulsar and pulsar wind irradiation. Our work supports\nearlier claims that RBs evolve into BWs. We also show that the fastest-spinning\npulsars may collapse before reaching sub-millisecond spin periods.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}