{"id":"2408.16695","title":"The relevance of degenerate states in chiral polaritonics","authors":"Carlos M. Bustamante, Dominik Sidler, Michael Ruggenthaler and Angel\n  Rubio","authorsParsed":[["Bustamante","Carlos M.",""],["Sidler","Dominik",""],["Ruggenthaler","Michael",""],["Rubio","Angel",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 16:45:00 GMT"}],"updateDate":"2024-08-30","timestamp":1724949900000,"abstract":"  In this work we explore theoretically whether a parity-violating/chiral\nlight-matter interaction is required to capture all relevant aspects of chiral\npolaritonics or if a parity-conserving/achiral theory is sufficient (e.g.\nlong-wavelength/dipole approximation). This question is non-trivial to answer,\nsince achiral theories (Hamiltonians) still possess chiral solutions. To\nelucidate this fundamental theoretical question, a simple GaAs quantum ring\nmodel is coupled to an effective chiral mode of a single-handedness optical\ncavity in dipole approximation. The bare matter GaAs quantum ring possesses a\nnon-degenerate ground state and a doubly degenerate first excited state. The\nchiral or achiral nature (superpositions) of the degenerate excited state\nremains undetermined for an isolated matter system. However, inside our\nparity-conserving description of a chiral cavity, we find that the dressed\neigenstates automatically (ab-initio) attain chiral character and become\nenergetically discriminated based on the handedness of the cavity. In contrast,\nthe non-degenerate bare matter state (ground state) does not show an energetic\ndiscrimination inside a chiral cavity within dipole approximation.\nNevertheless, our results suggest that the handedness of the cavity can still\nbe imprinted onto these states (e.g. angular momentum and chiral current\ndensities). Overall, above findings highlight the relevance of degenerate\nstates in chiral polaritonics. In particularly because recent theoretical\nresults indicate the formation of a frustrated and highly-degenerate electronic\nground-state under collective strong coupling conditions, which thus might be\nprone to chiral symmetry breaking effects.\n","subjects":["Physics/Chemical Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zTVH1R9wvn1_oQi3FbuaQ__GWviCM0zWeEMvqTi3Mos","pdfSize":"1723442"}
