{"id":"2408.12496","title":"MEDCO: Medical Education Copilots Based on A Multi-Agent Framework","authors":"Hao Wei, Jianing Qiu, Haibao Yu, Wu Yuan","authorsParsed":[["Wei","Hao",""],["Qiu","Jianing",""],["Yu","Haibao",""],["Yuan","Wu",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 15:41:58 GMT"}],"updateDate":"2024-08-27","timestamp":1724341318000,"abstract":"  Large language models (LLMs) have had a significant impact on diverse\nresearch domains, including medicine and healthcare. However, the potential of\nLLMs as copilots in medical education remains underexplored. Current\nAI-assisted educational tools are limited by their solitary learning approach\nand inability to simulate the multi-disciplinary and interactive nature of\nactual medical training. To address these limitations, we propose MEDCO\n(Medical EDucation COpilots), a novel multi-agent-based copilot system\nspecially developed to emulate real-world medical training environments. MEDCO\nincorporates three primary agents: an agentic patient, an expert doctor, and a\nradiologist, facilitating a multi-modal and interactive learning environment.\nOur framework emphasizes the learning of proficient question-asking skills,\nmulti-disciplinary collaboration, and peer discussions between students. Our\nexperiments show that simulated virtual students who underwent training with\nMEDCO not only achieved substantial performance enhancements comparable to\nthose of advanced models, but also demonstrated human-like learning behaviors\nand improvements, coupled with an increase in the number of learning samples.\nThis work contributes to medical education by introducing a copilot that\nimplements an interactive and collaborative learning approach. It also provides\nvaluable insights into the effectiveness of AI-integrated training paradigms.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by/4.0/"}