{"id":"2408.13598","title":"Advancing Gamma-Ray Burst Identification through Transfer Learning with\n  Convolutional Neural Networks","authors":"Peng Zhang, Bing Li, Ren-zhou Gui, Shao-lin Xiong, Yu Wang, Yan-qiu\n  Zhang, Chen-wei Wang, Jia-cong Liu, Wang-chen Xue, Chao Zheng, Zheng-hang Yu\n  and Wen-long Zhang","authorsParsed":[["Zhang","Peng",""],["Li","Bing",""],["Gui","Ren-zhou",""],["Xiong","Shao-lin",""],["Wang","Yu",""],["Zhang","Yan-qiu",""],["Wang","Chen-wei",""],["Liu","Jia-cong",""],["Xue","Wang-chen",""],["Zheng","Chao",""],["Yu","Zheng-hang",""],["Zhang","Wen-long",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 14:59:42 GMT"}],"updateDate":"2024-08-27","timestamp":1724511582000,"abstract":"  The Rapid and accurate identification of Gamma-Ray Bursts (GRBs) is crucial\nfor unraveling their origins. However, current burst search algorithms\nfrequently miss low-threshold signals or lack universality for observations. In\nthis study, we propose a novel approach utilizing transfer learning experiment\nbased on convolutional neural network (CNN) to establish a universal GRB\nidentification method, which validated successfully using GECAM-B data. By\nemploying data augmentation techniques, we enhance the diversity and quantity\nof the GRB sample. We develop a 1D CNN model with a multi-scale feature cross\nfusion module (MSCFM) to extract features from samples and perform\nclassification. The comparative results demonstrated significant performance\nimprovements following pre-training and transferring on a large-scale dataset.\nOur optimal model achieved an impressive accuracy of 96.41% on the source\ndataset of GECAM-B, and identified three previously undiscovered GRBs by\ncontrast with manual analysis of GECAM-B observations. These innovative\ntransfer learning and data augmentation methods presented in this work hold\npromise for applications in multi-satellite exploration scenarios characterized\nby limited data sets and a scarcity of labeled samples in high-energy\nastronomy.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}