{"id":"2408.06634","title":"Harnessing Earnings Reports for Stock Predictions: A QLoRA-Enhanced LLM\n  Approach","authors":"Haowei Ni and Shuchen Meng and Xupeng Chen and Ziqing Zhao and Andi\n  Chen and Panfeng Li and Shiyao Zhang and Qifu Yin and Yuanqing Wang and Yuxi\n  Chan","authorsParsed":[["Ni","Haowei",""],["Meng","Shuchen",""],["Chen","Xupeng",""],["Zhao","Ziqing",""],["Chen","Andi",""],["Li","Panfeng",""],["Zhang","Shiyao",""],["Yin","Qifu",""],["Wang","Yuanqing",""],["Chan","Yuxi",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 04:53:31 GMT"}],"updateDate":"2024-09-17","timestamp":1723524811000,"abstract":"  Accurate stock market predictions following earnings reports are crucial for\ninvestors. Traditional methods, particularly classical machine learning models,\nstruggle with these predictions because they cannot effectively process and\ninterpret extensive textual data contained in earnings reports and often\noverlook nuances that influence market movements. This paper introduces an\nadvanced approach by employing Large Language Models (LLMs) instruction\nfine-tuned with a novel combination of instruction-based techniques and\nquantized low-rank adaptation (QLoRA) compression. Our methodology integrates\n'base factors', such as financial metric growth and earnings transcripts, with\n'external factors', including recent market indices performances and analyst\ngrades, to create a rich, supervised dataset. This comprehensive dataset\nenables our models to achieve superior predictive performance in terms of\naccuracy, weighted F1, and Matthews correlation coefficient (MCC), especially\nevident in the comparison with benchmarks such as GPT-4. We specifically\nhighlight the efficacy of the llama-3-8b-Instruct-4bit model, which showcases\nsignificant improvements over baseline models. The paper also discusses the\npotential of expanding the output capabilities to include a 'Hold' option and\nextending the prediction horizon, aiming to accommodate various investment\nstyles and time frames. This study not only demonstrates the power of\nintegrating cutting-edge AI with fine-tuned financial data but also paves the\nway for future research in enhancing AI-driven financial analysis tools.\n","subjects":["Quantitative Finance/Computational Finance","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning","Quantitative Finance/Statistical Finance"],"license":"http://creativecommons.org/licenses/by/4.0/"}