{"id":"2408.02156","title":"Calibration-Disentangled Learning and Relevance-Prioritized Reranking\n  for Calibrated Sequential Recommendation","authors":"Hyunsik Jeon, Se-eun Yoon, Julian McAuley","authorsParsed":[["Jeon","Hyunsik",""],["Yoon","Se-eun",""],["McAuley","Julian",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 22:23:09 GMT"}],"updateDate":"2024-08-06","timestamp":1722810189000,"abstract":"  Calibrated recommendation, which aims to maintain personalized proportions of\ncategories within recommendations, is crucial in practical scenarios since it\nenhances user satisfaction by reflecting diverse interests. However, achieving\ncalibration in a sequential setting (i.e., calibrated sequential\nrecommendation) is challenging due to the need to adapt to users' evolving\npreferences. Previous methods typically leverage reranking algorithms to\ncalibrate recommendations after training a model without considering the effect\nof calibration and do not effectively tackle the conflict between relevance and\ncalibration during the reranking process. In this work, we propose LeapRec\n(Calibration-Disentangled Learning and Relevance-Prioritized Reranking), a\nnovel approach for the calibrated sequential recommendation that addresses\nthese challenges. LeapRec consists of two phases, model training phase and\nreranking phase. In the training phase, a backbone model is trained using our\nproposed calibration-disentangled learning-to-rank loss, which optimizes\npersonalized rankings while integrating calibration considerations. In the\nreranking phase, relevant items are prioritized at the top of the list, with\nitems needed for calibration following later to address potential conflicts\nbetween relevance and calibration. Through extensive experiments on four\nreal-world datasets, we show that LeapRec consistently outperforms previous\nmethods in the calibrated sequential recommendation. Our code is available at\nhttps://github.com/jeon185/LeapRec.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SYpwrPcgMC5jUZtm4ub2fDIqtMKgdz47bwfs4eEodQA","pdfSize":"6700387","txDigest":"2LZg7snphXQtwm7y3yqfKexzfnmpMTvb1DHSnXHrCnyR","endEpoch":"1","status":"CERTIFIED"}
