{"id":"2408.05055","title":"Numerical simulation and analysis of mixing enhancement due to chaotic\n  advection using an adaptive approach for approximating the dilution index","authors":"Carla Feistner, M\\'onica Basilio Hazas, Barbara Wohlmuth, Gabriele\n  Chiogna","authorsParsed":[["Feistner","Carla",""],["Hazas","Mónica Basilio",""],["Wohlmuth","Barbara",""],["Chiogna","Gabriele",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 13:22:21 GMT"}],"updateDate":"2024-08-12","timestamp":1723209741000,"abstract":"  A velocity field characterized by chaotic advection induces stretching and\nfolding processes that increase the solute-solvent interface available for\ndiffusion. Identifying chaotic flow fields with optimized mixing enhancement is\nrelevant for applications like groundwater remediation, microfluidics, and many\nmore. This work uses the dilution index to quantify the temporal increase in\nmixing of a solute within its solvent. We introduce a new approach to select a\nsuitable grid size for each time step in the dilution index approximation,\nmotivated by the theory of representative elementary volumes. It preserves the\ncentral feature of the dilution index, which is monotonically increasing in\ntime and hence leads to reliable results. Our analysis highlights the\nimportance of a suitable choice for the grid size in the dilution index\napproximation. We use this approach to demonstrate the mixing enhancement for\ntwo chaotic injection-extraction systems that exhibit chaotic structures: a\nsource-sink dipole and a rotated potential mixing. By analyzing the chaotic\nflow fields, we identify Kolmogorov--Arnold--Moser (KAM) islands, non-mixing\nregions that limit the chaotic area in the domain and, thereby, the mixing\nenhancement. Using our new approach, we assess the choice of design parameters\nof the injection-extraction systems to effectively engineer chaotic mixing. We\ndemonstrate the important role of diffusion in filling the KAM islands and\nreaching complete mixing in the systems.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mqtoDpNFtwIH_32Yoj84MSppdok1KlaW1S2G8KmG6S8","pdfSize":"5323133"}
