{"id":"2408.10274","title":"Benchmarking quantum machine learning kernel training for classification\n  tasks","authors":"Diego Alvarez-Estevez","authorsParsed":[["Alvarez-Estevez","Diego",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 10:53:06 GMT"}],"updateDate":"2024-08-21","timestamp":1723891986000,"abstract":"  Quantum-enhanced machine learning is a rapidly evolving field that aims to\nleverage the unique properties of quantum mechanics to enhance classical\nmachine learning. However, the practical applicability of these methods remains\nan open question, particularly in the context of real-world datasets and the\nlimitations of current quantum hardware. This work performs a benchmark study\nof Quantum Kernel Estimation (QKE) and Quantum Kernel Training (QKT) with a\nfocus on classification tasks. Through a series of experiments, the versatility\nand generalization capabilities of two quantum feature mappings, namely\nZZFeatureMap and CovariantFeatureMap, are analyzed in this context. Remarkably,\nthese feature maps have been proposed in the literature under the conjecture of\npossible near-term quantum advantage and have shown promising performance in\nad-hoc datasets. This study explores both artificial and established reference\ndatasets and incorporates classical machine learning methods, specifically\nSupport Vector Machines (SVMs) and logistic regression, as baseline\ncomparisons. Experimental results indicate that quantum methods exhibit varying\nperformance across different datasets. While they outperform classical methods\nin ad-hoc datasets, they frequently encounter difficulties in generalizing to\nunseen test data when dealing with reference classical datasets, even if\nachieving high classification accuracy on the training data. It is suggested\nthat the choice of the feature mapping and the optimization of kernel\nparameters through QKT are critical for maximizing the effectiveness of quantum\nmethods.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"R52_d_O0oVX2g4z2xxK2O6ZtD6dVAhnkFFX3r0exjP4","pdfSize":"321539"}
