{"id":"2408.05249","title":"Advancing oncology with federated learning: transcending boundaries in\n  breast, lung, and prostate cancer. A systematic review","authors":"Anshu Ankolekar, Sebastian Boie, Maryam Abdollahyan, Emanuela\n  Gadaleta, Seyed Alireza Hasheminasab, Guang Yang, Charles Beauville, Nikolaos\n  Dikaios, George Anthony Kastis, Michael Bussmann, Sara Khalid, Hagen Kruger,\n  Philippe Lambin, Giorgos Papanastasiou","authorsParsed":[["Ankolekar","Anshu",""],["Boie","Sebastian",""],["Abdollahyan","Maryam",""],["Gadaleta","Emanuela",""],["Hasheminasab","Seyed Alireza",""],["Yang","Guang",""],["Beauville","Charles",""],["Dikaios","Nikolaos",""],["Kastis","George Anthony",""],["Bussmann","Michael",""],["Khalid","Sara",""],["Kruger","Hagen",""],["Lambin","Philippe",""],["Papanastasiou","Giorgos",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 14:36:16 GMT"}],"updateDate":"2024-08-13","timestamp":1723127776000,"abstract":"  Federated Learning (FL) has emerged as a promising solution to address the\nlimitations of centralised machine learning (ML) in oncology, particularly in\novercoming privacy concerns and harnessing the power of diverse, multi-center\ndata. This systematic review synthesises current knowledge on the\nstate-of-the-art FL in oncology, focusing on breast, lung, and prostate cancer.\nDistinct from previous surveys, our comprehensive review critically evaluates\nthe real-world implementation and impact of FL on cancer care, demonstrating\nits effectiveness in enhancing ML generalisability, performance and data\nprivacy in clinical settings and data. We evaluated state-of-the-art advances\nin FL, demonstrating its growing adoption amid tightening data privacy\nregulations. FL outperformed centralised ML in 15 out of the 25 studies\nreviewed, spanning diverse ML models and clinical applications, and\nfacilitating integration of multi-modal information for precision medicine.\nDespite the current challenges identified in reproducibility, standardisation\nand methodology across studies, the demonstrable benefits of FL in harnessing\nreal-world data and addressing clinical needs highlight its significant\npotential for advancing cancer research. We propose that future research should\nfocus on addressing these limitations and investigating further advanced FL\nmethods, to fully harness data diversity and realise the transformative power\nof cutting-edge FL in cancer care.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computational Engineering, Finance, and Science","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}