{"id":"2408.09555","title":"Predicting potential SARS-CoV-2 spillover and spillback in animals","authors":"Zi Hian Tan, Kian Yan Yong and Jian-Jun Shu","authorsParsed":[["Tan","Zi Hian",""],["Yong","Kian Yan",""],["Shu","Jian-Jun",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 17:48:20 GMT"}],"updateDate":"2024-08-20","timestamp":1724003300000,"abstract":"  The COVID-19 pandemic is spreading rapidly around the world, causing\ncountries to impose lockdowns and efforts to develop vaccines on a global\nscale. However, human-to-animal and animal-to-human transmission cannot be\nignored, as severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) can\nspread rapidly in farmed and wild animals. This could create a worrying cycle\nof SARS-CoV-2 spillover from humans to animals and spillback of new strains\nback into humans, rendering vaccines ineffective. This study provides a key\nindicator of animals that may be potential susceptible hosts for SARS-CoV-2 and\ncoronavirus infections by analysing the phylogenetic distance between host\nangiotensin-converting enzyme 2 and the coronavirus spike protein. Crucially,\nour analysis identifies animals that are at elevated risk from a spillover and\nspillback incident. One group of animals has been identified as potentially\nsusceptible to SARS-CoV-2 by harbouring a parasitic coronavirus spike protein\nsimilar to the SARS-CoV-2 spike protein. These animals may serve as\namplification hosts in spillover events from zoonotic reservoirs. Tracing\ninterspecies transmission in multi-host environments based solely on in vitro\nand in vivo examinations of animal susceptibility or serology is a\ntime-consuming task. This approach allows rapid identification of high-risk\nanimals to prioritize research and assessment of the risk of zoonotic disease\ntransmission in the environment. It is a tool to rapidly identify zoonotic\nspecies that may cause outbreaks or participate in expansion cycles of\ncoexistence with their hosts. This prevents the spread of coronavirus\ninfections between species, preventing spillover and spillback incidents from\noccurring.\n","subjects":["Quantitative Biology/Populations and Evolution"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}