{"id":"2408.00001","title":"Replication in Visual Diffusion Models: A Survey and Outlook","authors":"Wenhao Wang, Yifan Sun, Zongxin Yang, Zhengdong Hu, Zhentao Tan, Yi\n  Yang","authorsParsed":[["Wang","Wenhao",""],["Sun","Yifan",""],["Yang","Zongxin",""],["Hu","Zhengdong",""],["Tan","Zhentao",""],["Yang","Yi",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 06:39:16 GMT"}],"updateDate":"2024-08-02","timestamp":1720334356000,"abstract":"  Visual diffusion models have revolutionized the field of creative AI,\nproducing high-quality and diverse content. However, they inevitably memorize\ntraining images or videos, subsequently replicating their concepts, content, or\nstyles during inference. This phenomenon raises significant concerns about\nprivacy, security, and copyright within generated outputs. In this survey, we\nprovide the first comprehensive review of replication in visual diffusion\nmodels, marking a novel contribution to the field by systematically\ncategorizing the existing studies into unveiling, understanding, and mitigating\nthis phenomenon. Specifically, unveiling mainly refers to the methods used to\ndetect replication instances. Understanding involves analyzing the underlying\nmechanisms and factors that contribute to this phenomenon. Mitigation focuses\non developing strategies to reduce or eliminate replication. Beyond these\naspects, we also review papers focusing on its real-world influence. For\ninstance, in the context of healthcare, replication is critically worrying due\nto privacy concerns related to patient data. Finally, the paper concludes with\na discussion of the ongoing challenges, such as the difficulty in detecting and\nbenchmarking replication, and outlines future directions including the\ndevelopment of more robust mitigation techniques. By synthesizing insights from\ndiverse studies, this paper aims to equip researchers and practitioners with a\ndeeper understanding at the intersection between AI technology and social good.\nWe release this project at\nhttps://github.com/WangWenhao0716/Awesome-Diffusion-Replication.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}