{"id":"2408.10455","title":"IDEA:Enhancing the Rule Learning Ability of Language Agents through\n  Induction, Deduction, and Abduction","authors":"Kaiyu He and Zhiyu Chen","authorsParsed":[["He","Kaiyu",""],["Chen","Zhiyu",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 23:37:07 GMT"},{"version":"v2","created":"Sat, 24 Aug 2024 03:23:09 GMT"}],"updateDate":"2024-08-27","timestamp":1724110627000,"abstract":"  While large language models (LLMs) have been thoroughly evaluated for\ndeductive and inductive reasoning, their proficiency in abductive reasoning and\nholistic rule learning in interactive environments remains less explored. This\nwork introduces RULEARN, a novel benchmark specifically designed to assess the\nrule-learning ability of LLMs in interactive settings. In RULEARN, agents\ninteract with the environment to gather observations and discern patterns,\nusing these insights to solve problems. To further enhance the rule-learning\ncapabilities of LLM agents within this benchmark, we propose IDEA agent, which\nintegrates Induction, Deduction, and Abduction processes. IDEA agent refines\nthis approach by leveraging a structured reasoning sequence: generating\nhypotheses through abduction, testing them via deduction, and refining them\nbased on feedback from induction. This sequence enables agents to dynamically\nestablish and apply rules, mimicking human-like reasoning processes. Our\nevaluation of five representative LLMs indicates that while these models can\ngenerate plausible initial hypotheses, they often struggle with strategic\ninteraction within the environment, effective incorporation of feedback, and\nadaptive refinement of their hypotheses. IDEA agent demonstrates significantly\nimproved performance on the RULEARN benchmark, offering valuable insights for\nthe development of agents capable of human-like rule-learning in real-world\nscenarios. We will release our code and data.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}