{"id":"2408.04660","title":"XMainframe: A Large Language Model for Mainframe Modernization","authors":"Anh T. V. Dau, Hieu Trung Dao, Anh Tuan Nguyen, Hieu Trung Tran, Phong\n  X. Nguyen, Nghi D. Q. Bui","authorsParsed":[["Dau","Anh T. V.",""],["Dao","Hieu Trung",""],["Nguyen","Anh Tuan",""],["Tran","Hieu Trung",""],["Nguyen","Phong X.",""],["Bui","Nghi D. Q.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 20:01:10 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 14:12:23 GMT"},{"version":"v3","created":"Mon, 26 Aug 2024 09:37:46 GMT"}],"updateDate":"2024-08-27","timestamp":1722888070000,"abstract":"  Mainframe operating systems, despite their inception in the 1940s, continue\nto support critical sectors like finance and government. However, these systems\nare often viewed as outdated, requiring extensive maintenance and\nmodernization. Addressing this challenge necessitates innovative tools that can\nunderstand and interact with legacy codebases. To this end, we introduce\nXMainframe, a state-of-the-art large language model (LLM) specifically designed\nwith knowledge of mainframe legacy systems and COBOL codebases. Our solution\ninvolves the creation of an extensive data collection pipeline to produce\nhigh-quality training datasets, enhancing XMainframe's performance in this\nspecialized domain. Additionally, we present MainframeBench, a comprehensive\nbenchmark for assessing mainframe knowledge, including multiple-choice\nquestions, question answering, and COBOL code summarization. Our empirical\nevaluations demonstrate that XMainframe consistently outperforms existing\nstate-of-the-art LLMs across these tasks. Specifically, XMainframe achieves 30%\nhigher accuracy than DeepSeek-Coder on multiple-choice questions, doubles the\nBLEU score of Mixtral-Instruct 8x7B on question answering, and scores six times\nhigher than GPT-3.5 on COBOL summarization. Our work highlights the potential\nof XMainframe to drive significant advancements in managing and modernizing\nlegacy systems, thereby enhancing productivity and saving time for software\ndevelopers.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}