{"id":"2408.11769","title":"Decoding Pedestrian Stress on Urban Streets using Electrodermal Activity\n  Monitoring in Virtual Immersive Reality","authors":"Mohsen Nazemi, Bara Rababah, Daniel Ramos, Tangxu Zhao, Bilal Farooq","authorsParsed":[["Nazemi","Mohsen",""],["Rababah","Bara",""],["Ramos","Daniel",""],["Zhao","Tangxu",""],["Farooq","Bilal",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 16:46:30 GMT"}],"updateDate":"2024-08-22","timestamp":1724258790000,"abstract":"  The pedestrian stress level is shown to significantly influence human\ncognitive processes and, subsequently, decision-making, e.g., the decision to\nselect a gap and cross a street. This paper systematically studies the stress\nexperienced by a pedestrian when crossing a street under different experimental\nmanipulations by monitoring the ElectroDermal Activity (EDA) using the Galvanic\nSkin Response (GSR) sensor. To fulfil the research objectives, a dynamic and\nimmersive virtual reality (VR) platform was used, which is suitable for\neliciting and capturing pedestrian's emotional responses in conjunction with\nmonitoring their EDA. A total of 171 individuals participated in the\nexperiment, tasked to cross a two-way street at mid-block with no signal\ncontrol. Mixed effects models were employed to compare the influence of\nsocio-demographics, social influence, vehicle technology, environment, road\ndesign, and traffic variables on the stress levels of the participants. The\nresults indicated that having a street median in the middle of the road\noperates as a refuge and significantly reduced stress. Younger participants\nwere (18-24 years) calmer than the relatively older participants (55-65 years).\nArousal levels were higher when it came to the characteristics of the avatar\n(virtual pedestrian) in the simulation, especially for those avatars with\nadventurous traits. The pedestrian location influenced stress since the stress\nwas higher on the street while crossing than waiting on the sidewalk.\nSignificant causes of arousal were fear of accidents and an actual accident for\npedestrians. The estimated random effects show a high degree of physical and\nmental learning by the participants while going through the scenarios.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}