{"id":"2408.16807","title":"STEREO: Towards Adversarially Robust Concept Erasing from Text-to-Image\n  Generation Models","authors":"Koushik Srivatsan, Fahad Shamshad, Muzammal Naseer, Karthik Nandakumar","authorsParsed":[["Srivatsan","Koushik",""],["Shamshad","Fahad",""],["Naseer","Muzammal",""],["Nandakumar","Karthik",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 17:29:26 GMT"}],"updateDate":"2024-09-02","timestamp":1724952566000,"abstract":"  The rapid proliferation of large-scale text-to-image generation (T2IG) models\nhas led to concerns about their potential misuse in generating harmful content.\nThough many methods have been proposed for erasing undesired concepts from T2IG\nmodels, they only provide a false sense of security, as recent works\ndemonstrate that concept-erased models (CEMs) can be easily deceived to\ngenerate the erased concept through adversarial attacks. The problem of\nadversarially robust concept erasing without significant degradation to model\nutility (ability to generate benign concepts) remains an unresolved challenge,\nespecially in the white-box setting where the adversary has access to the CEM.\nTo address this gap, we propose an approach called STEREO that involves two\ndistinct stages. The first stage searches thoroughly enough for strong and\ndiverse adversarial prompts that can regenerate an erased concept from a CEM,\nby leveraging robust optimization principles from adversarial training. In the\nsecond robustly erase once stage, we introduce an anchor-concept-based\ncompositional objective to robustly erase the target concept at one go, while\nattempting to minimize the degradation on model utility. By benchmarking the\nproposed STEREO approach against four state-of-the-art concept erasure methods\nunder three adversarial attacks, we demonstrate its ability to achieve a better\nrobustness vs. utility trade-off. Our code and models are available at\nhttps://github.com/koushiksrivats/robust-concept-erasing.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}