{"id":"2408.13489","title":"Quantum Illumination Advantage for Classification Among an Arbitrary\n  Library of Targets","authors":"Ali Cox, Quntao Zhuang, Jeffrey H. Shapiro, Saikat Guha","authorsParsed":[["Cox","Ali",""],["Zhuang","Quntao",""],["Shapiro","Jeffrey H.",""],["Guha","Saikat",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 06:20:23 GMT"}],"updateDate":"2024-08-27","timestamp":1724480423000,"abstract":"  Quantum illumination (QI) is the task of querying a scene using a transmitter\nprobe whose quantum state is entangled with a reference beam retained in ideal\nstorage, followed by optimally detecting the target-returned light together\nwith the stored reference, to make decisions on characteristics of targets at\nstand-off range, at precision that exceeds what is achievable with a classical\ntransmitter of the same brightness and otherwise identical conditions. Using\ntools from perturbation theory, we show that in the limit of low transmitter\nbrightness, high loss, and high thermal background, there is a factor of four\nimprovement in the Chernoff exponent of the error probability in discriminating\nany number of apriori-known reflective targets when using a Gaussian-state\nentangled QI probe, over using classical coherent-state illumination (CI).\nWhile this advantage was known for detecting the presence or absence of a\ntarget, it had not been proven for the generalized task of discriminating\nbetween arbitrary target libraries. In proving our result, we derive simple\ngeneral analytic expressions for the lowest-order asymptotic expansions of the\nquantum Chernoff exponents for QI and CI in terms of the signal brightness,\nloss, thermal noise, and the modal expansion coefficients of the\ntarget-reflected light's radiant exitance profiles when separated by a spatial\nmode sorter after entering the entrance pupil of the receiver's aperture.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}