{"id":"2408.11426","title":"AS-LIO: Spatial Overlap Guided Adaptive Sliding Window LiDAR-Inertial\n  Odometry for Aggressive FOV Variation","authors":"Tianxiang Zhang, Xuanxuan Zhang, Zongbo Liao, Xin Xia, You Li","authorsParsed":[["Zhang","Tianxiang",""],["Zhang","Xuanxuan",""],["Liao","Zongbo",""],["Xia","Xin",""],["Li","You",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 08:35:12 GMT"}],"updateDate":"2024-08-22","timestamp":1724229312000,"abstract":"  LiDAR-Inertial Odometry (LIO) demonstrates outstanding accuracy and stability\nin general low-speed and smooth motion scenarios. However, in high-speed and\nintense motion scenarios, such as sharp turns, two primary challenges arise:\nfirstly, due to the limitations of IMU frequency, the error in estimating\nsignificantly non-linear motion states escalates; secondly, drastic changes in\nthe Field of View (FOV) may diminish the spatial overlap between LiDAR frame\nand pointcloud map (or between frames), leading to insufficient data\nassociation and constraint degradation.\n  To address these issues, we propose a novel Adaptive Sliding window LIO\nframework (AS-LIO) guided by the Spatial Overlap Degree (SOD). Initially, we\nassess the SOD between the LiDAR frames and the registered map, directly\nevaluating the adverse impact of current FOV variation on pointcloud alignment.\nSubsequently, we design an adaptive sliding window to manage the continuous\nLiDAR stream and control state updates, dynamically adjusting the update step\naccording to the SOD. This strategy enables our odometry to adaptively adopt\nhigher update frequency to precisely characterize trajectory during aggressive\nFOV variation, thus effectively reducing the non-linear error in positioning.\nMeanwhile, the historical constraints within the sliding window reinforce the\nframe-to-map data association, ensuring the robustness of state estimation.\nExperiments show that our AS-LIO framework can quickly perceive and respond to\nchallenging FOV change, outperforming other state-of-the-art LIO frameworks in\nterms of accuracy and robustness.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}