{"id":"2408.07305","title":"Learning Decisions Offline from Censored Observations with\n  {\\epsilon}-insensitive Operational Costs","authors":"Minxia Chen, Ke Fu, Teng Huang, Miao Bai","authorsParsed":[["Chen","Minxia",""],["Fu","Ke",""],["Huang","Teng",""],["Bai","Miao",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 05:44:56 GMT"}],"updateDate":"2024-08-15","timestamp":1723614296000,"abstract":"  Many important managerial decisions are made based on censored observations.\nMaking decisions without adequately handling the censoring leads to inferior\noutcomes. We investigate the data-driven decision-making problem with an\noffline dataset containing the feature data and the censored historical data of\nthe variable of interest without the censoring indicators. Without assuming the\nunderlying distribution, we design and leverage {\\epsilon}-insensitive\noperational costs to deal with the unobserved censoring in an offline\ndata-driven fashion. We demonstrate the customization of the\n{\\epsilon}-insensitive operational costs for a newsvendor problem and use such\ncosts to train two representative ML models, including linear regression (LR)\nmodels and neural networks (NNs). We derive tight generalization bounds for the\ncustom LR model without regularization (LR-{\\epsilon}NVC) and with\nregularization (LR-{\\epsilon}NVC-R), and a high-probability generalization\nbound for the custom NN (NN-{\\epsilon}NVC) trained by stochastic gradient\ndescent. The theoretical results reveal the stability and learnability of\nLR-{\\epsilon}NVC, LR-{\\epsilon}NVC-R and NN-{\\epsilon}NVC. We conduct extensive\nnumerical experiments to compare LR-{\\epsilon}NVC-R and NN-{\\epsilon}NVC with\ntwo existing approaches, estimate-as-solution (EAS) and integrated estimation\nand optimization (IEO). The results show that LR-{\\epsilon}NVC-R and\nNN-{\\epsilon}NVC outperform both EAS and IEO, with maximum cost savings up to\n14.40% and 12.21% compared to the lowest cost generated by the two existing\napproaches. In addition, LR-{\\epsilon}NVC-R's and NN-{\\epsilon}NVC's order\nquantities are statistically significantly closer to the optimal solutions\nshould the underlying distribution be known.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"fWN_M-UfvIkfl8Dm94m0F8Z_Uo6xu-8maZlxC--VCCQ","pdfSize":"998795"}
