{"id":"2408.14178","title":"Single-photon scattering in giant-atom topological-waveguide-QED systems","authors":"Hai Zhu, Xian-Li Yin, Jie-Qiao Liao","authorsParsed":[["Zhu","Hai",""],["Yin","Xian-Li",""],["Liao","Jie-Qiao",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 10:57:23 GMT"}],"updateDate":"2024-08-27","timestamp":1724669843000,"abstract":"  The giant-atom topological-waveguide-QED systems have recently emerged as a\npromising platform for manipulating light-matter interactions. The combination\nof the multiple-point couplings and topological phase effect could lead to rich\nphysical phenomena and effects. Here, we study single-photon scattering in a\nSu-Schrieffer-Heeger (SSH) waveguide coupled to either one or two two-level\ngiant atoms. We assume that each giant atom is coupled to the waveguide via two\ncoupling points, and hence there exist four and sixteen coupling configurations\nfor the single-giant-atom case and two-giant-atom separate coupling case,\nrespectively. By solving the single-photon scattering problem in the real\nspace, we obtain the exact expressions of the single-photon scattering\namplitudes. It is found that a single photon in the SSH waveguide can be\ncompletely reflected or transmitted by choosing proper coupling configurations,\ncoupling-point distances, atomic resonance frequency, and dimerization\nparameter. In addition, under proper parameter conditions, the scattering\nspectra are periodically modulated by the coupling-point distances. We also\nfind that the collective behavior of the two giant atoms can be adjusted by\nquantum interference effect and topological effect, and that the single-photon\nscattering spectra can exhibit the Lorentzian, super-Gaussian,\nelectromagnetically induced transparency-like, and asymmetric Fano line shapes\nfor some coupling configurations. This work will inspire the development of\ncontrollable single-photon devices based on the giant-atom\ntopological-waveguide-QED systems.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}