{"id":"2408.01055","title":"LLM as Runtime Error Handler: A Promising Pathway to Adaptive\n  Self-Healing of Software Systems","authors":"Zhensu Sun, Haotian Zhu, Bowen Xu, Xiaoning Du, Li Li, David Lo","authorsParsed":[["Sun","Zhensu",""],["Zhu","Haotian",""],["Xu","Bowen",""],["Du","Xiaoning",""],["Li","Li",""],["Lo","David",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 07:03:00 GMT"}],"updateDate":"2024-08-05","timestamp":1722582180000,"abstract":"  Unanticipated runtime errors, lacking predefined handlers, can abruptly\nterminate execution and lead to severe consequences, such as data loss or\nsystem crashes. Despite extensive efforts to identify potential errors during\nthe development phase, such unanticipated errors remain a challenge to to be\nentirely eliminated, making the runtime mitigation measurements still\nindispensable to minimize their impact. Automated self-healing techniques, such\nas reusing existing handlers, have been investigated to reduce the loss coming\nthrough with the execution termination. However, the usability of existing\nmethods is retained by their predefined heuristic rules and they fail to handle\ndiverse runtime errors adaptively. Recently, the advent of Large Language\nModels (LLMs) has opened new avenues for addressing this problem. Inspired by\ntheir remarkable capabilities in understanding and generating code, we propose\nto deal with the runtime errors in a real-time manner using LLMs.\n  Specifically, we propose Healer, the first LLM-assisted self-healing\nframework for handling runtime errors. When an unhandled runtime error occurs,\nHealer will be activated to generate a piece of error-handling code with the\nhelp of its internal LLM and the code will be executed inside the runtime\nenvironment owned by the framework to obtain a rectified program state from\nwhich the program should continue its execution. Our exploratory study\nevaluates the performance of Healer using four different code benchmarks and\nthree state-of-the-art LLMs, GPT-3.5, GPT-4, and CodeQwen-7B. Results show\nthat, without the need for any fine-tuning, GPT-4 can successfully help\nprograms recover from 72.8% of runtime errors, highlighting the potential of\nLLMs in handling runtime errors.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7h9bsNxvcwqFHDId_h0nzsVHo_eos5KjfXebVdnl1ts","pdfSize":"815530","txDigest":"4CgXg6wA8y5PcUQa3vfPGN622nHwJphpJgeP7zempQvR","endEpoch":"1","status":"CERTIFIED"}
