{"id":"2408.05780","title":"U-DECN: End-to-End Underwater Object Detection ConvNet with Improved\n  DeNoising Training","authors":"Zhuoyan Liu, Bo Wang, Ye Li","authorsParsed":[["Liu","Zhuoyan",""],["Wang","Bo",""],["Li","Ye",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 14:11:45 GMT"}],"updateDate":"2024-08-13","timestamp":1723385505000,"abstract":"  Underwater object detection has higher requirements of running speed and\ndeployment efficiency for the detector due to its specific environmental\nchallenges. NMS of two- or one-stage object detectors and transformer\narchitecture of query-based end-to-end object detectors are not conducive to\ndeployment on underwater embedded devices with limited processing power. As for\nthe detrimental effect of underwater color cast noise, recent underwater object\ndetectors make network architecture or training complex, which also hinders\ntheir application and deployment on underwater vehicle platforms. In this\npaper, we propose the Underwater DECO with improved deNoising training\n(U-DECN), the query-based end-to-end object detector (with ConvNet\nencoder-decoder architecture) for underwater color cast noise that addresses\nthe above problems. We integrate advanced technologies from DETR variants into\nDECO and design optimization methods specifically for the ConvNet architecture,\nincluding Separate Contrastive DeNoising Forward and Deformable Convolution in\nSIM. To address the underwater color cast noise issue, we propose an underwater\ncolor denoising query to improve the generalization of the model for the biased\nobject feature information by different color cast noise. Our U-DECN, with\nResNet-50 backbone, achieves 61.4 AP (50 epochs), 63.3 AP (72 epochs), 64.0 AP\n(100 epochs) on DUO, and 21 FPS (5 times faster than Deformable DETR and DINO 4\nFPS) on NVIDIA AGX Orin by TensorRT FP16, outperforming the other\nstate-of-the-art query-based end-to-end object detectors. The code is available\nat https://github.com/LEFTeyex/U-DECN.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}