{"id":"2408.08972","title":"ASGM-KG: Unveiling Alluvial Gold Mining Through Knowledge Graphs","authors":"Debashis Gupta, Aditi Golder, Luis Fernendez, Miles Silman, Greg\n  Lersen, Fan Yang, Bob Plemmons, Sarra Alqahtani, Paul Victor Pauca","authorsParsed":[["Gupta","Debashis",""],["Golder","Aditi",""],["Fernendez","Luis",""],["Silman","Miles",""],["Lersen","Greg",""],["Yang","Fan",""],["Plemmons","Bob",""],["Alqahtani","Sarra",""],["Pauca","Paul Victor",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 18:48:15 GMT"}],"updateDate":"2024-08-20","timestamp":1723834095000,"abstract":"  Artisanal and Small-Scale Gold Mining (ASGM) is a low-cost yet highly\ndestructive mining practice, leading to environmental disasters across the\nworld's tropical watersheds. The topic of ASGM spans multiple domains of\nresearch and information, including natural and social systems, and knowledge\nis often atomized across a diversity of media and documents. We therefore\nintroduce a knowledge graph (ASGM-KG) that consolidates and provides crucial\ninformation about ASGM practices and their environmental effects. The current\nversion of ASGM-KG consists of 1,899 triples extracted using a large language\nmodel (LLM) from documents and reports published by both non-governmental and\ngovernmental organizations. These documents were carefully selected by a group\nof tropical ecologists with expertise in ASGM. This knowledge graph was\nvalidated using two methods. First, a small team of ASGM experts reviewed and\nlabeled triples as factual or non-factual. Second, we devised and applied an\nautomated factual reduction framework that relies on a search engine and an LLM\nfor labeling triples. Our framework performs as well as five baselines on a\npublicly available knowledge graph and achieves over 90 accuracy on our ASGM-KG\nvalidated by domain experts. ASGM-KG demonstrates an advancement in knowledge\naggregation and representation for complex, interdisciplinary environmental\ncrises such as ASGM.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning","Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by/4.0/"}