{"id":"2408.07474","title":"Debiasing astro-Photometric Observations with Corrections Using\n  Statistics (DePhOCUS)","authors":"Tobias Hoffmann, Marco Micheli, Juan Luis Cano, Maxime Devog\\`ele,\n  Davide Farnocchia, Petr Pravec, Peter Vere\\v{s}, Bj\\\"orn Poppe","authorsParsed":[["Hoffmann","Tobias",""],["Micheli","Marco",""],["Cano","Juan Luis",""],["Devogèle","Maxime",""],["Farnocchia","Davide",""],["Pravec","Petr",""],["Vereš","Peter",""],["Poppe","Björn",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 11:34:48 GMT"}],"updateDate":"2024-08-15","timestamp":1723635288000,"abstract":"  Photometric measurements allow the determination of an asteroid's absolute\nmagnitude, which often represents the sole means to infer its size. Photometric\nobservations can be obtained in a variety of filters that can be unique to a\nspecific observatory. Those observations are then calibrated into specific\nbands with respect to reference star catalogs. In order to combine all the\ndifferent measurements for evaluation, photometric observations need to be\nconverted to a common band, typically V-band. Current band-correction schemes\nin use by IAU's Minor Planet Center, JPL's Center for Near Earth Object Studies\nand ESA's NEO Coordination Centre use average correction values for the\napparent magnitude derived from photometry of asteroids as the corrections are\ndependent on the typically unknown spectrum of the object to be corrected. By\nstatistically analyzing the photometric residuals of asteroids, we develop a\nnew photometric correction scheme that does not only consider the band, but\nalso accounts for reference catalog and observatory. We describe a new\nstatistical photometry correction scheme for asteroid observations with\ndebiased corrections. Testing this scheme on a reference group of asteroids, we\nsee a 36% reduction in the photometric residuals. Moreover, the new scheme\nleads to a more accurate and debiased determination of the H-G magnitude system\nand, in turn, to more reliable inferred sizes. We discuss the significant shift\nin the corrections with this \"DePhOCUS\" debiasing system, its limitations, and\nthe impact for photometric and physical properties of all asteroids, especially\nNear-Earth Objects.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}