{"id":"2408.15411","title":"AUTOGENICS: Automated Generation of Context-Aware Inline Comments for\n  Code Snippets on Programming Q&A Sites Using LLM","authors":"Suborno Deb Bappon, Saikat Mondal, Banani Roy","authorsParsed":[["Bappon","Suborno Deb",""],["Mondal","Saikat",""],["Roy","Banani",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 21:21:13 GMT"}],"updateDate":"2024-08-29","timestamp":1724793673000,"abstract":"  Inline comments in the source code facilitate easy comprehension,\nreusability, and enhanced readability. However, code snippets in answers on Q&A\nsites like Stack Overflow (SO) often lack comments because answerers volunteer\ntheir time and often skip comments or explanations due to time constraints.\nExisting studies show that these online code examples are difficult to read and\nunderstand, making it difficult for developers (especially novices) to use them\ncorrectly and leading to misuse. Given these challenges, we introduced\nAUTOGENICS, a tool designed to integrate with SO to generate effective inline\ncomments for code snippets in SO answers exploiting large language models\n(LLMs). Our contributions are threefold. First, we randomly select 400 answer\ncode snippets from SO and generate inline comments for them using LLMs. We then\nmanually evaluate these comments' effectiveness using four key metrics:\naccuracy, adequacy, conciseness, and usefulness. Overall, LLMs demonstrate\npromising effectiveness in generating inline comments for SO answer code\nsnippets. Second, we surveyed 14 active SO users to perceive the effectiveness\nof these inline comments. The survey results are consistent with our previous\nmanual evaluation. However, according to our evaluation, LLMs-generated\ncomments are less effective for shorter code snippets and sometimes produce\nnoisy comments. Third, to address the gaps, we introduced AUTOGENICS, which\nextracts additional context from question texts and generates context-aware\ninline comments. It also optimizes comments by removing noise (e.g., comments\nin import statements and variable declarations). We evaluate the effectiveness\nof AUTOGENICS-generated comments using the same four metrics that outperform\nthose of standard LLMs. AUTOGENICS might (a) enhance code comprehension, (b)\nsave time, and improve developers' ability to learn and reuse code more\naccurately.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"xqZfL2y7GQvKU_uE5gyrxzgsI0GIrlnskmpPfmNm0f0","pdfSize":"853981"}
