{"id":"2408.07280","title":"Understanding Brain Aging Across Populations: A Comprehensive Framework\n  for Structural Analysis","authors":"Alphin J Thottupattu, Jayanthi Sivaswamy, Bharath Holla, Jithender\n  Saini","authorsParsed":[["Thottupattu","Alphin J",""],["Sivaswamy","Jayanthi",""],["Holla","Bharath",""],["Saini","Jithender",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 06:37:00 GMT"}],"updateDate":"2024-08-15","timestamp":1722407820000,"abstract":"  Understanding distinct neurological aging patterns across various populations\nis vital in the context of a globally aging populace. This study seeks to\nunravel the structural variations in the aging brain, taking into consideration\ndifferent ethnic backgrounds. MRI data from Indian, Chinese, Japanese, and\nCaucasian populations were analyzed using a two-pronged approach. Initially, a\ngroup analysis was performed involving tissue segmentation through FSL-FAST,\nexamining gray matter (GM), white matter (WM), and cerebrospinal fluid (CSF).\nSubsequently, a continuous model-based analysis was employed, defining aging as\na diffeomorphic transformation, which facilitated a detailed intra- and\ninter-population analysis, and examined both global anatomy and age-dependent\ndistances of each population in comparison to the Indian population. Detailed\ninsights into the spatial distribution of brain deformations over time were\nobtained, with particular focus on anatomical changes relative to a reference\ntime point. The proposed comprehensive structural comparison framework, applied\nto a sample dataset encompassing four distinct populations, represents a\npioneering effort to compare structural differences related to brain aging on a\nglobal scale. Subsequent studies utilizing larger datasets and applying the\nproposed analysis across groups based on various criteria will further advance\nour understanding of aging-related changes.\n","subjects":["Quantitative Biology/Neurons and Cognition","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}