{"id":"2408.09840","title":"Machine Learning with Physics Knowledge for Prediction: A Survey","authors":"Joe Watson, Chen Song, Oliver Weeger, Theo Gruner, An T. Le, Kay\n  Hansel, Ahmed Hendawy, Oleg Arenz, Will Trojak, Miles Cranmer, Carlo D'Eramo,\n  Fabian B\\\"ulow, Tanmay Goyal, Jan Peters and Martin W. Hoffman","authorsParsed":[["Watson","Joe",""],["Song","Chen",""],["Weeger","Oliver",""],["Gruner","Theo",""],["Le","An T.",""],["Hansel","Kay",""],["Hendawy","Ahmed",""],["Arenz","Oleg",""],["Trojak","Will",""],["Cranmer","Miles",""],["D'Eramo","Carlo",""],["Bülow","Fabian",""],["Goyal","Tanmay",""],["Peters","Jan",""],["Hoffman","Martin W.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 09:36:07 GMT"}],"updateDate":"2024-08-20","timestamp":1724060167000,"abstract":"  This survey examines the broad suite of methods and models for combining\nmachine learning with physics knowledge for prediction and forecast, with a\nfocus on partial differential equations. These methods have attracted\nsignificant interest due to their potential impact on advancing scientific\nresearch and industrial practices by improving predictive models with small- or\nlarge-scale datasets and expressive predictive models with useful inductive\nbiases. The survey has two parts. The first considers incorporating physics\nknowledge on an architectural level through objective functions, structured\npredictive models, and data augmentation. The second considers data as physics\nknowledge, which motivates looking at multi-task, meta, and contextual learning\nas an alternative approach to incorporating physics knowledge in a data-driven\nfashion. Finally, we also provide an industrial perspective on the application\nof these methods and a survey of the open-source ecosystem for physics-informed\nmachine learning.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}