{"id":"2408.02731","title":"Impact of Systematic Modeling Uncertainties on Kilonova Property\n  Estimation","authors":"Daniel Brethauer, Daniel Kasen, Raffaella Margutti, Ryan Chornock","authorsParsed":[["Brethauer","Daniel",""],["Kasen","Daniel",""],["Margutti","Raffaella",""],["Chornock","Ryan",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 18:00:02 GMT"}],"updateDate":"2024-08-07","timestamp":1722880802000,"abstract":"  The precise atomic structure and therefore the wavelength-dependent opacities\nof lanthanides are highly uncertain. This uncertainty introduces systematic\nerrors in modeling transients like kilonovae and estimating key properties such\nas mass, characteristic velocity, and heavy metal content. Here, we quantify\nhow atomic data from across the literature as well as choices of thermalization\nefficiency of r-process radioactive decay heating impact the light curve and\nspectra of kilonovae. Specifically, we analyze the spectra of a grid of models\nproduced by the radiative transfer code \\texttt{Sedona} that span the expected\nrange of kilonova properties to identify regions with the highest systematic\nuncertainty. Our findings indicate that differences in atomic data have a\nsubstantial impact on estimates of lanthanide mass fraction, spanning\napproximately one order of magnitude for lanthanide-rich ejecta, and\ndemonstrate the difficulty in precisely measuring the lanthanide fraction in\nlanthanide-poor ejecta. Mass estimates vary typically by 25-40$\\%$ for\ndiffering atomic data. Similarly, the choice of thermalization efficiency can\naffect mass estimates by 20$\\%$ to 50$\\%$. Observational properties such as\ncolor and decay rate are \\textit{highly} model-dependent. Velocity estimation,\nwhen fitting solely based on the light curve, can have a typical error of $\\sim\n100\\%$. Atomic data of light r-process elements can strongly affect blue\nemission. Even for well-observed events like GW170817, the total lanthanide\nproduction estimated using different atomic datasets can vary by a factor of\n$\\sim6$.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"V9vx8BJz1JhJOUYWgMZ_u3oWNqHZd8Vc1yoh64lLkH4","pdfSize":"1776192","txDigest":"49AffAhved7M3QhaZSsFaNmWZ4RH5NBZFaH2nJz3JveG","endEpoch":"1","status":"CERTIFIED"}
