{"id":"2408.12765","title":"Variable Stars in M31 Stellar Clusters from the Panchromatic Hubble\n  Andromeda Treasury","authors":"Richard Smith, Avi Patel, Monika D. Soraisam, Puragra Guhathakurta,\n  Pranav Tadepalli, Sally Zhu, Joseph Liu, L\\'eo Girardi, L. Clifton Johnson,\n  Sagnick Mukherjee, Knut A. G. Olsen, Benjamin F. Williams","authorsParsed":[["Smith","Richard",""],["Patel","Avi",""],["Soraisam","Monika D.",""],["Guhathakurta","Puragra",""],["Tadepalli","Pranav",""],["Zhu","Sally",""],["Liu","Joseph",""],["Girardi","Léo",""],["Johnson","L. Clifton",""],["Mukherjee","Sagnick",""],["Olsen","Knut A. G.",""],["Williams","Benjamin F.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 23:41:18 GMT"}],"updateDate":"2024-08-26","timestamp":1724370078000,"abstract":"  Variable stars in stellar clusters can offer key constraints on stellar\nevolution and pulsation models, utilising estimates of host cluster properties\nto constrain stellar physical parameters. We present a catalogue of 86 luminous\n(F814W<19) variable stars in M31 clusters identified by mining the archival\nPanchromatic Hubble Andromeda Treasury (PHAT) survey using a combination of\nstatistical analysis of sparse PHAT light curves and difference imaging. We\ndetermine the evolutionary phases and initial masses of these variable stars by\nmatching them with theoretical isochrones generated using host cluster\nproperties from the literature. We calculate the probability of PHAT photometry\nbeing blended due to the highly crowded nature of cluster environments for each\ncluster-variable star, using these probabilities to inform our level of\nconfidence in the derived properties of each star. Our 86 cluster-variable\nstars have initial masses between 0.8--67 $M_{\\odot}$. Their evolutionary\nphases span the main sequence, more evolved hydrogen- and helium-burning\nphases, and the post-asymptotic giant branch. We identify numerous candidate\nvariable star types: RV Tauri variables, red supergiants and slowly pulsating\nB-type supergiants, along with Wolf Rayet stars, $\\alpha$ Cygni and Mira\nvariables, a classical Cepheid and a possible super-asymptotic giant. We\ncharacterise 12 cluster-variable stars at higher confidence based on their\ndifference image quality and lower blending probability. Ours is the first\nsystematic study of variable stars in extragalactic stellar clusters leveraging\nthe superior resolution of the Hubble Space Telescope and demonstrating the\nunique power of stellar clusters in constraining the fundamental properties of\nvariable stars.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wHmPFA8EjdIW7fV_Te7nUrslr6QwuUCU_gCXuCikkOQ","pdfSize":"14291786"}
