{"id":"2408.15566","title":"TagOOD: A Novel Approach to Out-of-Distribution Detection via\n  Vision-Language Representations and Class Center Learning","authors":"Jinglun Li, Xinyu Zhou, Kaixun Jiang, Lingyi Hong, Pinxue Guo, Zhaoyu\n  Chen, Weifeng Ge, Wenqiang Zhang","authorsParsed":[["Li","Jinglun",""],["Zhou","Xinyu",""],["Jiang","Kaixun",""],["Hong","Lingyi",""],["Guo","Pinxue",""],["Chen","Zhaoyu",""],["Ge","Weifeng",""],["Zhang","Wenqiang",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 06:37:59 GMT"}],"updateDate":"2024-08-29","timestamp":1724827079000,"abstract":"  Multimodal fusion, leveraging data like vision and language, is rapidly\ngaining traction. This enriched data representation improves performance across\nvarious tasks. Existing methods for out-of-distribution (OOD) detection, a\ncritical area where AI models encounter unseen data in real-world scenarios,\nrely heavily on whole-image features. These image-level features can include\nirrelevant information that hinders the detection of OOD samples, ultimately\nlimiting overall performance. In this paper, we propose \\textbf{TagOOD}, a\nnovel approach for OOD detection that leverages vision-language representations\nto achieve label-free object feature decoupling from whole images. This\ndecomposition enables a more focused analysis of object semantics, enhancing\nOOD detection performance. Subsequently, TagOOD trains a lightweight network on\nthe extracted object features to learn representative class centers. These\ncenters capture the central tendencies of IND object classes, minimizing the\ninfluence of irrelevant image features during OOD detection. Finally, our\napproach efficiently detects OOD samples by calculating distance-based metrics\nas OOD scores between learned centers and test samples. We conduct extensive\nexperiments to evaluate TagOOD on several benchmark datasets and demonstrate\nits superior performance compared to existing OOD detection methods. This work\npresents a novel perspective for further exploration of multimodal information\nutilization in OOD detection, with potential applications across various tasks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}