{"id":"2408.15887","title":"SpineMamba: Enhancing 3D Spinal Segmentation in Clinical Imaging through\n  Residual Visual Mamba Layers and Shape Priors","authors":"Zhiqing Zhang, Tianyong Liu, Guojia Fan, Bin Li, Qianjin Feng, and\n  Shoujun Zhou","authorsParsed":[["Zhang","Zhiqing",""],["Liu","Tianyong",""],["Fan","Guojia",""],["Li","Bin",""],["Feng","Qianjin",""],["Zhou","Shoujun",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 15:59:40 GMT"}],"updateDate":"2024-08-29","timestamp":1724860780000,"abstract":"  Accurate segmentation of 3D clinical medical images is critical in the\ndiagnosis and treatment of spinal diseases. However, the inherent complexity of\nspinal anatomy and uncertainty inherent in current imaging technologies, poses\nsignificant challenges for semantic segmentation of spinal images. Although\nconvolutional neural networks (CNNs) and Transformer-based models have made\nsome progress in spinal segmentation, their limitations in handling long-range\ndependencies hinder further improvements in segmentation accuracy.To address\nthese challenges, we introduce a residual visual Mamba layer to effectively\ncapture and model the deep semantic features and long-range spatial\ndependencies of 3D spinal data. To further enhance the structural semantic\nunderstanding of the vertebrae, we also propose a novel spinal shape prior\nmodule that captures specific anatomical information of the spine from medical\nimages, significantly enhancing the model's ability to extract structural\nsemantic information of the vertebrae. Comparative and ablation experiments on\ntwo datasets demonstrate that SpineMamba outperforms existing state-of-the-art\nmodels. On the CT dataset, the average Dice similarity coefficient for\nsegmentation reaches as high as 94.40, while on the MR dataset, it reaches\n86.95. Notably, compared to the renowned nnU-Net, SpineMamba achieves superior\nsegmentation performance, exceeding it by up to 2 percentage points. This\nunderscores its accuracy, robustness, and excellent generalization\ncapabilities.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}