{"id":"2408.01019","title":"Five New Heartbeat Star Systems with Tidally Excited Oscillations\n  Discovered Based on TESS Data","authors":"Min-Yu Li, Sheng-Bang Qian, Ai-Ying Zhou, Li-Ying Zhu, Wen-Ping Liao,\n  Er-Gang Zhao, Xiang-Dong Shi, Fu-Xing Li, and Qi-Bin Sun","authorsParsed":[["Li","Min-Yu",""],["Qian","Sheng-Bang",""],["Zhou","Ai-Ying",""],["Zhu","Li-Ying",""],["Liao","Wen-Ping",""],["Zhao","Er-Gang",""],["Shi","Xiang-Dong",""],["Li","Fu-Xing",""],["Sun","Qi-Bin",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 05:37:38 GMT"}],"updateDate":"2024-08-05","timestamp":1722577058000,"abstract":"  Heartbeat stars (HBSs) with tidally excited oscillations (TEOs) are ideal\nastrophysical laboratories for studying the internal properties of the systems.\nIn this paper, five new HBSs exhibiting TEOs are discovered using TESS\nphotometric data. The orbital parameters are derived using a corrected version\nof Kumar et al.'s model based on the Markov Chain Monte Carlo (MCMC) method.\nThe TEOs in these objects are examined, and their pulsation phases and modes\nare identified. The pulsation phases of the TEOs in TIC 266809405, TIC\n266894805, and TIC 412881444 are consistent with the dominant $l=2$, $m=0$, or\n$\\pm2$ spherical harmonic. For TIC 11619404, although the TEO phase is close to\nthe $m=+2$ mode, the $m = 0$ mode cannot be excluded because of the low\ninclination in this system. The TEO phase in TIC 447927324 shows a large\ndeviation ($>2\\sigma$) from the adiabatic expectations, suggesting that it is\nexpected to be a traveling wave rather than a standing wave. In addition, these\nTEOs occur at relatively low orbital harmonics, and we cautiously suggest that\nthis may be an observational bias. These objects are valuable sources for\nstudying the structure and evolution of eccentricity orbit binaries and\nextending the TESS HBS catalog with TEOs.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"l-32fECg4uhFLPiEPSNzYuIysfiynR_C02b8R58_pK4","pdfSize":"1789829","txDigest":"9fMGvbNA3LPrPw1EPW9aMDxGutiUeE7t9yGC8HUVz6Pa","endEpoch":"1","status":"CERTIFIED"}
