{"id":"2408.14030","title":"Dopant-induced modulation of ferroelectricity in perovskite nitride\n  LaWN$_3$","authors":"Harshvardhan Singh Deora and Awadhesh Narayan","authorsParsed":[["Deora","Harshvardhan Singh",""],["Narayan","Awadhesh",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 05:47:45 GMT"}],"updateDate":"2024-08-27","timestamp":1724651265000,"abstract":"  Perovskite nitrides are starting to be explored for their promising\nproperties distinct from their oxide counterparts. Here, through\nfirst-principles density functional computations, we study the intricate\nrelationship between ferroelectricity and metallicity in the ferroelectric\nnitride LaWN$_3$. We systematically assess the impact of electron and hole\ndoping via the background charge method, revealing that both types of charge\ncarriers diminish the propensity for ferroelectricity in LaWN$_3$, although to\nremarkably different extents. Specifically, the introduction of electrons leads\nto centrosymmetry at a lower concentration value of nearly 0.2 electrons per\nformula unit. In contrast, the addition of holes does not result in\ncentrosymmetry at reasonable doping values of up to 0.3 holes per formula unit.\nWe present the underlying mechanisms behind these findings, noting that adding\nelectrons fills the valence orbitals of both W and N atoms. This filling leads\nto a screening effect on the long-range repulsion between these atoms, thereby\nreducing the off-centering of W. On the other hand, hole doping does not\nsignificantly alter the W-N bonding nature, resulting in a more robust\noff-centering. Furthermore, we introduce explicit impurity atoms and analyze\nthe influence of the different factors contributing to the change in\npolarization, namely, the size of the dopant, charge carriers introduced by the\ndopant, and changes in lattice constants. We discover that doped LaWN$_3$ can\nbe a promising polar metal, especially with acceptor dopants. Our study\ncomprehensively shows the interplay between polarity and metallicity in this\nprototypical perovskite nitride.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}