{"id":"2408.08074","title":"A Survey on Integrated Sensing, Communication, and Computation","authors":"Dingzhu Wen, Yong Zhou, Xiaoyang Li, Yuanming Shi, Kaibin Huang, and\n  Khaled B. Letaief","authorsParsed":[["Wen","Dingzhu",""],["Zhou","Yong",""],["Li","Xiaoyang",""],["Shi","Yuanming",""],["Huang","Kaibin",""],["Letaief","Khaled B.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 11:01:35 GMT"}],"updateDate":"2024-08-16","timestamp":1723719695000,"abstract":"  The forthcoming generation of wireless technology, 6G, promises a\nrevolutionary leap beyond traditional data-centric services. It aims to usher\nin an era of ubiquitous intelligent services, where everything is\ninterconnected and intelligent. This vision requires the seamless integration\nof three fundamental modules: Sensing for information acquisition,\ncommunication for information sharing, and computation for information\nprocessing and decision-making. These modules are intricately linked,\nespecially in complex tasks such as edge learning and inference. However, the\nperformance of these modules is interdependent, creating a resource competition\nfor time, energy, and bandwidth. Existing techniques like integrated\ncommunication and computation (ICC), integrated sensing and computation (ISC),\nand integrated sensing and communication (ISAC) have made partial strides in\naddressing this challenge, but they fall short of meeting the extreme\nperformance requirements. To overcome these limitations, it is essential to\ndevelop new techniques that comprehensively integrate sensing, communication,\nand computation. This integrated approach, known as Integrated Sensing,\nCommunication, and Computation (ISCC), offers a systematic perspective for\nenhancing task performance. This paper begins with a comprehensive survey of\nhistoric and related techniques such as ICC, ISC, and ISAC, highlighting their\nstrengths and limitations. It then explores the state-of-the-art signal designs\nfor ISCC, along with network resource management strategies specifically\ntailored for ISCC. Furthermore, this paper discusses the exciting research\nopportunities that lie ahead for implementing ISCC in future advanced networks.\nBy embracing ISCC, we can unlock the full potential of intelligent\nconnectivity, paving the way for groundbreaking applications and services.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}