{"id":"2408.08771","title":"Dynamic factor analysis for sparse and irregular longitudinal data: an\n  application to metabolite measurements in a COVID-19 study","authors":"Jiachen Cai, Robert J. B. Goudie, Brian D. M. Tom","authorsParsed":[["Cai","Jiachen",""],["Goudie","Robert J. B.",""],["Tom","Brian D. M.",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 14:26:35 GMT"}],"updateDate":"2024-08-19","timestamp":1723818395000,"abstract":"  It is of scientific interest to identify essential biomarkers in biological\nprocesses underlying diseases to facilitate precision medicine. Factor analysis\n(FA) has long been used to address this goal: by assuming latent biological\npathways drive the activity of measurable biomarkers, a biomarker is more\ninfluential if its absolute factor loading is larger. Although correlation\nbetween biomarkers has been properly handled under this framework, correlation\nbetween latent pathways are often overlooked, as one classical assumption in FA\nis the independence between factors. However, this assumption may not be\nrealistic in the context of pathways, as existing biological knowledge suggests\nthat pathways interact with one another rather than functioning independently.\nMotivated by sparsely and irregularly collected longitudinal measurements of\nmetabolites in a COVID-19 study of large sample size, we propose a dynamic\nfactor analysis model that can account for the potential cross-correlations\nbetween pathways, through a multi-output Gaussian processes (MOGP) prior on the\nfactor trajectories. To mitigate against overfitting caused by sparsity of\nlongitudinal measurements, we introduce a roughness penalty upon MOGP\nhyperparameters and allow for non-zero mean functions. To estimate these\nhyperparameters, we develop a stochastic expectation maximization (StEM)\nalgorithm that scales well to the large sample size. In our simulation studies,\nStEM leads across all sample sizes considered to a more accurate and stable\nestimate of the MOGP hyperparameters than a comparator algorithm used in\nprevious research. Application to the motivating example identifies a\nkynurenine pathway that affects the clinical severity of patients with\nCOVID-19. In particular, a novel biomarker taurine is discovered, which has\nbeen receiving increased attention clinically, yet its role was overlooked in a\nprevious analysis.\n","subjects":["Statistics/Methodology","Statistics/Computation"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}