{"id":"2408.03810","title":"Improved Tangential Interpolation-based Multi-input Multi-output Modal\n  Analysis of a Full Aircraft","authors":"Gabriele Dessena, Marco Civera","authorsParsed":[["Dessena","Gabriele",""],["Civera","Marco",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 14:37:03 GMT"}],"updateDate":"2024-08-08","timestamp":1723041423000,"abstract":"  In the field of Structural Dynamics, modal analysis is the foundation of\nSystem Identification and vibration-based inspection. However, despite their\nwidespread use, current state-of-the-art methods for extracting modal\nparameters from multi-input multi-output (MIMO) frequency domain data are still\naffected by many technical limitations. Mainly, they can be computationally\ncumbersome and/or negatively affected by close-in-frequency modes. The Loewner\nFramework (LF) was recently proposed to alleviate these problems with the\nlimitation of working with single-input data only. This work proposes a\ncomputationally improved version of the Lowner Framework, or iLF, to extract\nmodal parameters more efficiently. Also, the proposed implementation is\nextended in order to handle multi-input multi-output data in the frequency\ndomain. This new implementation is compared to state-of-the-art methods such as\nthe frequency domain implementations of the Least Square Complex Exponential\nmethod and the Numerical Algorithm for Subspace State Space System\nIdentification on numerical and experimental datasets. More specifically, a\nfinite element model of a 3D Euler-Bernoulli beam is used for the baseline\ncomparison and the noise robustness verification of the proposed MIMO iLF\nalgorithm. Then, an experimental dataset from MIMO ground vibration tests of a\ntrainer jet aircraft with over 91 accelerometer channels is chosen for the\nalgorithm validation on a real-life application. Excellent results are achieved\nin terms of accuracy, robustness to noise, and computational performance by the\nproposed improved MIMO method, both on the numerical and the experimental\ndatasets. The MIMO iLF MATLAB implementation is shared in the work\nsupplementary material.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QmiFnGRCyyN7uzso9jNjxOez3UFSsGDr09cTzUjdkHg","pdfSize":"7477535"}
