{"id":"2408.15691","title":"Spin-dependent exotic interactions","authors":"Lei Cong, Wei Ji, Pavel Fadeev, Filip Ficek, Min Jiang, Victor V.\n  Flambaum, Haosen Guan, Derek F. Jackson Kimball, Mikhail G. Kozlov, Yevgeny\n  V. Stadnik, Dmitry Budker","authorsParsed":[["Cong","Lei",""],["Ji","Wei",""],["Fadeev","Pavel",""],["Ficek","Filip",""],["Jiang","Min",""],["Flambaum","Victor V.",""],["Guan","Haosen",""],["Kimball","Derek F. Jackson",""],["Kozlov","Mikhail G.",""],["Stadnik","Yevgeny V.",""],["Budker","Dmitry",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 10:28:36 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 11:40:35 GMT"}],"updateDate":"2024-08-30","timestamp":1724840916000,"abstract":"  Novel interactions beyond the four known fundamental forces in nature\n(electromagnetic, gravitational, strong and weak interactions), may arise due\nto \"new physics\" beyond the standard model, manifesting as a \"fifth force\".\nThis review is focused on spin-dependent fifth forces mediated by exotic bosons\nsuch as spin-0 axions and axionlike particles and spin-1 Z' bosons, dark\nphotons, or paraphotons. Many of these exotic bosons are candidates to explain\nthe nature of dark matter and dark energy, and their interactions may violate\nfundamental symmetries. Spin-dependent interactions between fermions mediated\nby the exchange of exotic bosons have been investigated in a variety of\nexperiments, particularly at the low-energy frontier. Experimental methods and\ntools used to search for exotic spin-dependent interactions, such as atomic\ncomagnetometers, torsion balances, nitrogen-vacancy spin sensors, and precision\natomic and molecular spectroscopy, are described. A complete set of interaction\npotentials, derived based on quantum field theory with minimal assumptions and\ncharacterized in terms of reduced coupling constants, are presented. A\ncomprehensive summary of existing experimental and observational constraints on\nexotic spin-dependent interactions is given, illustrating the current research\nlandscape and promising directions of further research.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/Atomic Physics","Physics/Optics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}