{"id":"2408.09217","title":"EagleEye: Attention to Unveil Malicious Event Sequences from Provenance\n  Graphs","authors":"Philipp Gysel, Candid W\\\"uest, Kenneth Nwafor, Otakar Ja\\v{s}ek,\n  Andrey Ustyuzhanin, Dinil Mon Divakaran","authorsParsed":[["Gysel","Philipp",""],["Wüest","Candid",""],["Nwafor","Kenneth",""],["Jašek","Otakar",""],["Ustyuzhanin","Andrey",""],["Divakaran","Dinil Mon",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 14:48:02 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 06:07:06 GMT"}],"updateDate":"2024-09-04","timestamp":1723906082000,"abstract":"  Securing endpoints is challenging due to the evolving nature of threats and\nattacks. With endpoint logging systems becoming mature, provenance-graph\nrepresentations enable the creation of sophisticated behavior rules. However,\nadapting to the pace of emerging attacks is not scalable with rules. This led\nto the development of ML models capable of learning from endpoint logs.\nHowever, there are still open challenges: i) malicious patterns of malware are\nspread across long sequences of events, and ii) ML classification results are\nnot interpretable. To address these issues, we develop and present EagleEye, a\nnovel system that i) uses rich features from provenance graphs for behavior\nevent representation, including command-line embeddings, ii) extracts long\nsequences of events and learns event embeddings, and iii) trains a lightweight\nTransformer model to classify behavior sequences as malicious or not. We\nevaluate and compare EagleEye against state-of-the-art baselines on two\ndatasets, namely a new real-world dataset from a corporate environment, and the\npublic DARPA dataset. On the DARPA dataset, at a false-positive rate of 1%,\nEagleEye detects $\\approx$89% of all malicious behavior, outperforming two\nstate-of-the-art solutions by an absolute margin of 38.5%. Furthermore, we show\nthat the Transformer's attention mechanism can be leveraged to highlight the\nmost suspicious events in a long sequence, thereby providing interpretation of\nmalware alerts.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"HvoPQhSJ2LchSu7UzryrMYV01GuDheJMjOVJZY3vdAc","pdfSize":"1062340"}
