{"id":"2408.11328","title":"Measurement-based Fast Quantum State Stabilization with Deep\n  Reinforcement Learning","authors":"Chunxiang Song, Yanan Liu, Daoyi Dong, Hidehiro Yonezawa","authorsParsed":[["Song","Chunxiang",""],["Liu","Yanan",""],["Dong","Daoyi",""],["Yonezawa","Hidehiro",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 04:21:30 GMT"}],"updateDate":"2024-08-22","timestamp":1724214090000,"abstract":"  The stabilization of quantum states is a fundamental problem for realizing\nvarious quantum technologies. Measurement-based-feedback strategies have\ndemonstrated powerful performance, and the construction of quantum control\nsignals using measurement information has attracted great interest. However,\nthe interaction between quantum systems and the environment is inevitable,\nespecially when measurements are introduced, which leads to decoherence. To\nmitigate decoherence, it is desirable to stabilize quantum systems faster,\nthereby reducing the time of interaction with the environment. In this paper,\nwe utilize information obtained from measurement and apply deep reinforcement\nlearning (DRL) algorithms, without explicitly constructing specific complex\nmeasurement-control mappings, to rapidly drive random initial quantum state to\nthe target state. The proposed DRL algorithm has the ability to speed up the\nconvergence to a target state, which shortens the interaction between quantum\nsystems and their environments to protect coherence. Simulations are performed\non two-qubit and three-qubit systems, and the results show that our algorithm\ncan successfully stabilize random initial quantum system to the target\nentangled state, with a convergence time faster than traditional methods such\nas Lyapunov feedback control. Moreover, it exhibits robustness against\nimperfect measurements and delays in system evolution.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}