{"id":"2408.11685","title":"Bridging experiment and theory of relaxor ferroelectrics at the atomic\n  scale with multislice electron ptychography","authors":"Menglin Zhu, Michael Xu, Yubo Qi, Colin Gilgenbach, Jieun Kim, Jiahao\n  Zhang, Bridget R. Denzer, Lane W. Martin, Andrew M. Rappe, James M. LeBeau","authorsParsed":[["Zhu","Menglin",""],["Xu","Michael",""],["Qi","Yubo",""],["Gilgenbach","Colin",""],["Kim","Jieun",""],["Zhang","Jiahao",""],["Denzer","Bridget R.",""],["Martin","Lane W.",""],["Rappe","Andrew M.",""],["LeBeau","James M.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 15:07:19 GMT"}],"updateDate":"2024-08-22","timestamp":1724252839000,"abstract":"  Introducing structural and/or chemical heterogeneity into otherwise ordered\ncrystals can dramatically alter material properties. Lead-based relaxor\nferroelectrics are a prototypical example, with decades of investigation having\nconnected chemical and structural heterogeneity to their unique properties.\nWhile theory has pointed to the formation of an ensemble of ``slush''-like\npolar domains, the lack of direct, spatially resolved volumetric data\ncomparable to simulations presents a significant challenge in measuring the\nspatial distribution and correlation of local chemistry and structure with the\nphysics underlying relaxor behavior. Here, we address this challenge through\nthree-dimensional volumetric characterization of the prototypical relaxor\nferroelectric \\ce{0.68Pb(Mg$_{1/3}$Nb$_{2/3}$)O3-0.32PbTiO$_3$} using\nmultislice electron ptychography. Direct comparison with molecular dynamics\nsimulations reveals the intimate relationship between the polar structure and\nunit-cell level charge imbalance induced by chemical disorder. Further, polar\nnanodomains are maintained through local correlations arising from residual\nshort-range chemical order. Acting in concert with the chemical\nheterogeneities, it is also shown that compressive strain enhances out-of-plane\ncorrelations and ferroelectric-like order without affecting the in-plane\nrelaxor-like structure. Broadly, these findings provide a pathway to enable\ndetailed atomic scale understanding for hierarchical control of polar domains\nin relaxor ferroelectric materials and devices, and also present significant\nopportunities to tackle other heterogeneous systems using complementary\ntheoretical and experimental studies.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}