{"id":"2408.07468","title":"Exploring the Impact of Passthrough on VR Exergaming in Public\n  Environments: A Field Study","authors":"Zixuan Guo, Hanxiao Deng, Hongyu Wang, Angel J. Y. Tan, Wenge Xu,\n  Hai-Ning Liang","authorsParsed":[["Guo","Zixuan",""],["Deng","Hanxiao",""],["Wang","Hongyu",""],["Tan","Angel J. Y.",""],["Xu","Wenge",""],["Liang","Hai-Ning",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 11:24:44 GMT"}],"updateDate":"2024-08-15","timestamp":1723634684000,"abstract":"  Sedentary behavior is becoming increasingly prevalent in daily work and study\nenvironments. VR exergaming has emerged as a promising solution in these places\nof work and study. However, private spaces in these environments are not easy,\nand engaging in VR exergaming in public settings presents its own set of\nchallenges (e.g., safety, social acceptance, isolation, and privacy\nprotection). The recent development of Passthrough functionality in VR headsets\nallows users to maintain awareness of their surroundings, enhancing safety and\nconvenience. Despite its potential benefits, little is known about how\nPassthrough could affect user performance and experience and solve the\nchallenges of playing VR exergames in real-world public environments. To our\nknowledge, this work is the first to conduct a field study in an underground\npassageway on a university campus to explore the use of Passthrough in a\nreal-world public environment, with a disturbance-free closed room as a\nbaseline. Results indicate that enabling Passthrough in a public environment\nimproves performance without compromising presence. Moreover, Passthrough can\nincrease social acceptance, especially among individuals with higher levels of\nself-consciousness. These findings highlight Passthrough's potential to\nencourage VR exergaming adoption in public environments, with promising\nimplications for overall health and well-being.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"2RaPlEgxfSVbva3IkLqoQWDnqdFbnIdhoB8x_0zBFsk","pdfSize":"2947978"}
