{"id":"2408.17179","title":"Discovery and characterization of a dense sub-Saturn TOI-6651b","authors":"Sanjay Baliwal, Rishikesh Sharma, Abhijit Chakraborty, Akanksha\n  Khandelwal, K.J. Nikitha, Boris S. Safonov, Ivan A. Strakhov, Marco Montalto,\n  Jason D. Eastman, David W. Latham, Allyson Bieryla, Neelam J.S.S.V. Prasad,\n  Kapil K. Bharadwaj, Kevikumar A. Lad, Shubhendra N. Das, Ashirbad Nayak","authorsParsed":[["Baliwal","Sanjay",""],["Sharma","Rishikesh",""],["Chakraborty","Abhijit",""],["Khandelwal","Akanksha",""],["Nikitha","K. J.",""],["Safonov","Boris S.",""],["Strakhov","Ivan A.",""],["Montalto","Marco",""],["Eastman","Jason D.",""],["Latham","David W.",""],["Bieryla","Allyson",""],["Prasad","Neelam J. S. S. V.",""],["Bharadwaj","Kapil K.",""],["Lad","Kevikumar A.",""],["Das","Shubhendra N.",""],["Nayak","Ashirbad",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 10:27:49 GMT"}],"updateDate":"2024-09-02","timestamp":1725013669000,"abstract":"  We report the discovery and characterization of a transiting sub-Saturn\nexoplanet TOI-6651b using PARAS-2 spectroscopic observations. The host,\nTOI-6651 ($m_{V}\\approx 10.2$), is a sub-giant, metal-rich G-type star with\n$[{\\rm Fe/H}] = 0.225^{+0.044}_{-0.045}$, $T_{\\rm eff} = 5940\\pm110\\\n\\mathrm{K}$, and $\\log{g} = 4.087^{+0.035}_{-0.032}$. Joint fitting of the\nradial velocities from PARAS-2 spectrograph and transit photometric data from\nTransiting Exoplanet Survey Satellite (TESS) reveals a planetary mass of\n$61.0^{+7.6}_{-7.9}\\ M_\\oplus$ and radius of $5.09^{+0.27}_{-0.26}\\ R_\\oplus$,\nin a $5.056973^{+0.000016}_{-0.000018}$ day orbit with an eccentricity of\n$0.091^{+0.096}_{-0.062}$. TOI-6651b has a bulk density of\n$2.52^{+0.52}_{-0.44}\\ \\mathrm{g\\ cm^{-3}}$, positioning it among the select\nfew known dense sub-Saturns and making it notably the densest detected with\nTESS. TOI-6651b is consistent with the positive correlation between planet mass\nand the host star's metallicity. We find that a considerable portion $\\approx$\n87% of the planet's mass consists of dense materials such as rock and iron in\nthe core, while the remaining mass comprises a low-density envelope of H/He.\nTOI-6651b lies at the edge of the Neptunian desert, which will be crucial for\nunderstanding the factors shaping the desert boundaries. The existence of\nTOI-6651b challenges conventional planet formation theories and could be a\nresult of merging events or significant atmospheric mass loss through tidal\nheating, highlighting the complex interplay of dynamical processes and\natmospheric evolution in the formation of massive dense sub-Saturns.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}