{"id":"2408.04348","title":"Fuzzy to Clear: Elucidating the Threat Hunter Cognitive Process and\n  Cognitive Support Needs","authors":"Alessandra Maciel Paz Milani, Arty Starr, Samantha Hill, Callum\n  Curtis, Norman Anderson, David Moreno-Lumbreras, Margaret-Anne Storey","authorsParsed":[["Milani","Alessandra Maciel Paz",""],["Starr","Arty",""],["Hill","Samantha",""],["Curtis","Callum",""],["Anderson","Norman",""],["Moreno-Lumbreras","David",""],["Storey","Margaret-Anne",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 10:18:52 GMT"}],"updateDate":"2024-08-09","timestamp":1723112332000,"abstract":"  With security threats increasing in frequency and severity, it is critical\nthat we consider the important role of threat hunters. These highly-trained\nsecurity professionals learn to see, identify, and intercept security threats.\nMany recent works and existing tools in cybersecurity are focused on automating\nthe threat hunting process, often overlooking the critical human element. Our\nstudy shifts this paradigm by emphasizing a human-centered approach to\nunderstanding the lived experiences of threat hunters. By observing threat\nhunters during hunting sessions and analyzing the rich insights they provide,\nwe seek to advance the understanding of their cognitive processes and the tool\nsupport they need. Through an in-depth observational study of threat hunters,\nwe introduce a model of how they build and refine their mental models during\nthreat hunting sessions. We also present 23 themes that provide a foundation to\nbetter understand threat hunter needs and five actionable design propositions\nto enhance the tools that support them. Through these contributions, our work\nenriches the theoretical understanding of threat hunting and provides practical\ninsights for designing more effective, human-centered cybersecurity tools.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}