{"id":"2408.12288","title":"Demystifying Functional Random Forests: Novel Explainability Tools for\n  Model Transparency in High-Dimensional Spaces","authors":"Fabrizio Maturo, Annamaria Porreca","authorsParsed":[["Maturo","Fabrizio",""],["Porreca","Annamaria",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 10:52:32 GMT"}],"updateDate":"2024-08-23","timestamp":1724323952000,"abstract":"  The advent of big data has raised significant challenges in analysing\nhigh-dimensional datasets across various domains such as medicine, ecology, and\neconomics. Functional Data Analysis (FDA) has proven to be a robust framework\nfor addressing these challenges, enabling the transformation of\nhigh-dimensional data into functional forms that capture intricate temporal and\nspatial patterns. However, despite advancements in functional classification\nmethods and very high performance demonstrated by combining FDA and ensemble\nmethods, a critical gap persists in the literature concerning the transparency\nand interpretability of black-box models, e.g. Functional Random Forests (FRF).\nIn response to this need, this paper introduces a novel suite of explainability\ntools to illuminate the inner mechanisms of FRF. We propose using Functional\nPartial Dependence Plots (FPDPs), Functional Principal Component (FPC)\nProbability Heatmaps, various model-specific and model-agnostic FPCs'\nimportance metrics, and the FPC Internal-External Importance and Explained\nVariance Bubble Plot. These tools collectively enhance the transparency of FRF\nmodels by providing a detailed analysis of how individual FPCs contribute to\nmodel predictions. By applying these methods to an ECG dataset, we demonstrate\nthe effectiveness of these tools in revealing critical patterns and improving\nthe explainability of FRF.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning","Mathematics/Statistics Theory","Statistics/Methodology","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}