{"id":"2408.15204","title":"Can Unconfident LLM Annotations Be Used for Confident Conclusions?","authors":"Kristina Gligori\\'c, Tijana Zrnic, Cinoo Lee, Emmanuel J. Cand\\`es,\n  and Dan Jurafsky","authorsParsed":[["Gligorić","Kristina",""],["Zrnic","Tijana",""],["Lee","Cinoo",""],["Candès","Emmanuel J.",""],["Jurafsky","Dan",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 17:03:18 GMT"}],"updateDate":"2024-08-28","timestamp":1724778198000,"abstract":"  Large language models (LLMs) have shown high agreement with human raters\nacross a variety of tasks, demonstrating potential to ease the challenges of\nhuman data collection. In computational social science (CSS), researchers are\nincreasingly leveraging LLM annotations to complement slow and expensive human\nannotations. Still, guidelines for collecting and using LLM annotations,\nwithout compromising the validity of downstream conclusions, remain limited. We\nintroduce Confidence-Driven Inference: a method that combines LLM annotations\nand LLM confidence indicators to strategically select which human annotations\nshould be collected, with the goal of producing accurate statistical estimates\nand provably valid confidence intervals while reducing the number of human\nannotations needed. Our approach comes with safeguards against LLM annotations\nof poor quality, guaranteeing that the conclusions will be both valid and no\nless accurate than if we only relied on human annotations. We demonstrate the\neffectiveness of Confidence-Driven Inference over baselines in statistical\nestimation tasks across three CSS settings--text politeness, stance, and\nbias--reducing the needed number of human annotations by over 25% in each.\nAlthough we use CSS settings for demonstration, Confidence-Driven Inference can\nbe used to estimate most standard quantities across a broad range of NLP\nproblems.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}