{"id":"2408.12323","title":"EUIS-Net: A Convolutional Neural Network for Efficient Ultrasound Image\n  Segmentation","authors":"Shahzaib Iqbal, Hasnat Ahmed, Muhammad Sharif, Madiha Hena, Tariq M.\n  Khan, Imran Razzak","authorsParsed":[["Iqbal","Shahzaib",""],["Ahmed","Hasnat",""],["Sharif","Muhammad",""],["Hena","Madiha",""],["Khan","Tariq M.",""],["Razzak","Imran",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 11:57:59 GMT"}],"updateDate":"2024-08-23","timestamp":1724327879000,"abstract":"  Segmenting ultrasound images is critical for various medical applications,\nbut it offers significant challenges due to ultrasound images' inherent noise\nand unpredictability. To address these challenges, we proposed EUIS-Net, a CNN\nnetwork designed to segment ultrasound images efficiently and precisely. The\nproposed EUIS-Net utilises four encoder-decoder blocks, resulting in a notable\ndecrease in computational complexity while achieving excellent performance. The\nproposed EUIS-Net integrates both channel and spatial attention mechanisms into\nthe bottleneck to improve feature representation and collect significant\ncontextual information. In addition, EUIS-Net incorporates a region-aware\nattention module in skip connections, which enhances the ability to concentrate\non the region of the injury. To enable thorough information exchange across\nvarious network blocks, skip connection aggregation is employed from the\nnetwork's lowermost to the uppermost block. Comprehensive evaluations are\nconducted on two publicly available ultrasound image segmentation datasets. The\nproposed EUIS-Net achieved mean IoU and dice scores of 78. 12\\%, 85. 42\\% and\n84. 73\\%, 89. 01\\% in the BUSI and DDTI datasets, respectively. The findings of\nour study showcase the substantial capabilities of EUIS-Net for immediate use\nin clinical settings and its versatility in various ultrasound imaging tasks.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aZKLgPsCurv5HqtKpLj9433aBZZ_3vu9ZpOhqN5aCUA","pdfSize":"1011400"}
