{"id":"2408.12107","title":"Extrinsic Fluctuations in the p53 Cycle","authors":"Manuel Eduardo Hern\\'andez-Garc\\'ia, Mariana G\\'omez-Schiavon and\n  Jorge Vel\\'azquez-Castro","authorsParsed":[["Hernández-García","Manuel Eduardo",""],["Gómez-Schiavon","Mariana",""],["Velázquez-Castro","Jorge",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 03:44:19 GMT"}],"updateDate":"2024-08-23","timestamp":1724298259000,"abstract":"  Fluctuations are inherent to biological systems, arising from the stochastic\nnature of molecular interactions, and influence various aspects of system\nbehavior, stability, and robustness. These fluctuations can be categorized as\nintrinsic, stemming from the system's inherent structure and dynamics, and\nextrinsic, arising from external factors, such as temperature variations.\nUnderstanding the interplay between these fluctuations is crucial for obtaining\na comprehensive understanding of biological phenomena. However, studying these\neffects poses significant computational challenges. In this study, we used an\nunderexplored methodology to analyze the effect of extrinsic fluctuations in\nstochastic systems using ordinary differential equations instead of solving the\nMaster Equation with stochastic parameters. By incorporating temperature\nfluctuations into reaction rates, we explored the impact of extrinsic factors\non system dynamics. We constructed a master equation and calculated the\nequations for the dynamics of the first two moments, offering computational\nefficiency compared with directly solving the chemical master equation. We\napplied this approach to analyze a biological oscillator, focusing on the p53\nmodel and its response to temperature-induced extrinsic fluctuations. Our\nfindings underscore the impact of extrinsic fluctuations on the nature of\noscillations in biological systems, with alterations in oscillatory behavior\ndepending on the characteristics of extrinsic fluctuations. We observed an\nincreased oscillation amplitude and frequency of the p53 concentration cycle.\nThis study provides valuable insights into the effects of extrinsic\nfluctuations on biological oscillations and highlights the importance of\nconsidering them in more complex systems to prevent unwanted scenarios related\nto health issues.\n","subjects":["Quantitative Biology/Molecular Networks"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}