{"id":"2408.02280","title":"Hardware Aware Ensemble Selection for Balancing Predictive Accuracy and\n  Cost","authors":"Jannis Maier, Felix M\\\"oller, Lennart Purucker","authorsParsed":[["Maier","Jannis",""],["Möller","Felix",""],["Purucker","Lennart",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 07:30:18 GMT"}],"updateDate":"2024-08-06","timestamp":1722843018000,"abstract":"  Automated Machine Learning (AutoML) significantly simplifies the deployment\nof machine learning models by automating tasks from data preprocessing to model\nselection to ensembling. AutoML systems for tabular data often employ post hoc\nensembling, where multiple models are combined to improve predictive accuracy.\nThis typically results in longer inference times, a major limitation in\npractical deployments. Addressing this, we introduce a hardware-aware ensemble\nselection approach that integrates inference time into post hoc ensembling. By\nleveraging an existing framework for ensemble selection with quality diversity\noptimization, our method evaluates ensemble candidates for their predictive\naccuracy and hardware efficiency. This dual focus allows for a balanced\nconsideration of accuracy and operational efficiency. Thus, our approach\nenables practitioners to choose from a Pareto front of accurate and efficient\nensembles. Our evaluation using 83 classification datasets shows that our\napproach sustains competitive accuracy and can significantly improve ensembles'\noperational efficiency. The results of this study provide a foundation for\nextending these principles to additional hardware constraints, setting the\nstage for the development of more resource-efficient AutoML systems.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tl_siyO1n5QfcHZTSw64kq6mEaIDvcsZT4EIl4kIZ_Q","pdfSize":"590649","txDigest":"31VFMF2igrEqwp1WXZbVabVLLdMQjwCbiZ7dZUTBkXm6","endEpoch":"1","status":"CERTIFIED"}
