{"id":"2408.02630","title":"Learning the Latent dynamics of Fluid flows from High-Fidelity Numerical\n  Simulations using Parsimonious Diffusion Maps","authors":"Alessandro Della Pia, Dimitris Patsatzis, Lucia Russo, Constantinos\n  Siettos","authorsParsed":[["Della Pia","Alessandro",""],["Patsatzis","Dimitris",""],["Russo","Lucia",""],["Siettos","Constantinos",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 16:53:45 GMT"}],"updateDate":"2024-08-06","timestamp":1722876825000,"abstract":"  We use parsimonious diffusion maps (PDMs) to discover the latent dynamics of\nhigh-fidelity Navier-Stokes simulations with a focus on the 2D fluidic pinball\nproblem. By varying the Reynolds number, different flow regimes emerge, ranging\nfrom steady symmetric flows to quasi-periodic asymmetric and turbulence. We\nshow, that the proposed non-linear manifold learning scheme, identifies in a\ncrisp manner the expected intrinsic dimension of the underlying emerging\ndynamics over the parameter space. In particular, PDMs, estimate that the\nemergent dynamics in the oscillatory regime can be captured by just two\nvariables, while in the chaotic regime, the dominant modes are three as\nanticipated by the normal form theory. On the other hand, proper orthogonal\ndecomposition (POD)/PCA, most commonly used for dimensionality reduction in\nfluid mechanics, does not provide such a crisp separation between the dominant\nmodes. To validate the performance of PDMs, we also computed the reconstruction\nerror, by constructing a decoder using Geometric Harmonics. We show that the\nproposed scheme outperforms the POD/PCA over the whole Reynolds number range.\nThus, we believe that the proposed scheme will allow for the development of\nmore accurate reduced order models for high-fidelity fluid dynamics simulators,\nthus relaxing the curse of dimensionality in numerical analysis tasks such as\nbifurcation analysis, optimization and control.\n","subjects":["Physics/Fluid Dynamics","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis","Nonlinear Sciences/Chaotic Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}