{"id":"2408.10069","title":"LNQ 2023 challenge: Benchmark of weakly-supervised techniques for\n  mediastinal lymph node quantification","authors":"Reuben Dorent, Roya Khajavi, Tagwa Idris, Erik Ziegler, Bhanusupriya\n  Somarouthu, Heather Jacene, Ann LaCasce, Jonathan Deissler, Jan Ehrhardt,\n  Sofija Engelson, Stefan M. Fischer, Yun Gu, Heinz Handels, Satoshi Kasai,\n  Satoshi Kondo, Klaus Maier-Hein, Julia A. Schnabel, Guotai Wang, Litingyu\n  Wang, Tassilo Wald, Guang-Zhong Yang, Hanxiao Zhang, Minghui Zhang, Steve\n  Pieper, Gordon Harris, Ron Kikinis, Tina Kapur","authorsParsed":[["Dorent","Reuben",""],["Khajavi","Roya",""],["Idris","Tagwa",""],["Ziegler","Erik",""],["Somarouthu","Bhanusupriya",""],["Jacene","Heather",""],["LaCasce","Ann",""],["Deissler","Jonathan",""],["Ehrhardt","Jan",""],["Engelson","Sofija",""],["Fischer","Stefan M.",""],["Gu","Yun",""],["Handels","Heinz",""],["Kasai","Satoshi",""],["Kondo","Satoshi",""],["Maier-Hein","Klaus",""],["Schnabel","Julia A.",""],["Wang","Guotai",""],["Wang","Litingyu",""],["Wald","Tassilo",""],["Yang","Guang-Zhong",""],["Zhang","Hanxiao",""],["Zhang","Minghui",""],["Pieper","Steve",""],["Harris","Gordon",""],["Kikinis","Ron",""],["Kapur","Tina",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 15:11:01 GMT"}],"updateDate":"2024-08-20","timestamp":1724080261000,"abstract":"  Accurate assessment of lymph node size in 3D CT scans is crucial for cancer\nstaging, therapeutic management, and monitoring treatment response. Existing\nstate-of-the-art segmentation frameworks in medical imaging often rely on fully\nannotated datasets. However, for lymph node segmentation, these datasets are\ntypically small due to the extensive time and expertise required to annotate\nthe numerous lymph nodes in 3D CT scans. Weakly-supervised learning, which\nleverages incomplete or noisy annotations, has recently gained interest in the\nmedical imaging community as a potential solution. Despite the variety of\nweakly-supervised techniques proposed, most have been validated only on private\ndatasets or small publicly available datasets. To address this limitation, the\nMediastinal Lymph Node Quantification (LNQ) challenge was organized in\nconjunction with the 26th International Conference on Medical Image Computing\nand Computer Assisted Intervention (MICCAI 2023). This challenge aimed to\nadvance weakly-supervised segmentation methods by providing a new, partially\nannotated dataset and a robust evaluation framework. A total of 16 teams from 5\ncountries submitted predictions to the validation leaderboard, and 6 teams from\n3 countries participated in the evaluation phase. The results highlighted both\nthe potential and the current limitations of weakly-supervised approaches. On\none hand, weakly-supervised approaches obtained relatively good performance\nwith a median Dice score of $61.0\\%$. On the other hand, top-ranked teams, with\na median Dice score exceeding $70\\%$, boosted their performance by leveraging\nsmaller but fully annotated datasets to combine weak supervision and full\nsupervision. This highlights both the promise of weakly-supervised methods and\nthe ongoing need for high-quality, fully annotated data to achieve higher\nsegmentation performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}