{"id":"2408.11699","title":"Automating Semantic Analysis of System Assurance Cases using\n  Goal-directed ASP","authors":"Anitha Murugesan, Isaac Wong, Joaqu\\'in Arias, Robert Stroud,\n  Srivatsan Varadarajan, Elmer Salazar, Gopal Gupta, Robin Bloomfield and John\n  Rushby","authorsParsed":[["Murugesan","Anitha",""],["Wong","Isaac",""],["Arias","Joaquín",""],["Stroud","Robert",""],["Varadarajan","Srivatsan",""],["Salazar","Elmer",""],["Gupta","Gopal",""],["Bloomfield","Robin",""],["Rushby","John",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 15:22:43 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 20:52:51 GMT"},{"version":"v3","created":"Thu, 5 Sep 2024 18:37:09 GMT"}],"updateDate":"2024-09-09","timestamp":1724253763000,"abstract":"  Assurance cases offer a structured way to present arguments and evidence for\ncertification of systems where safety and security are critical. However,\ncreating and evaluating these assurance cases can be complex and challenging,\neven for systems of moderate complexity. Therefore, there is a growing need to\ndevelop new automation methods for these tasks. While most existing assurance\ncase tools focus on automating structural aspects, they lack the ability to\nfully assess the semantic coherence and correctness of the assurance arguments.\n  In prior work, we introduced the Assurance 2.0 framework that prioritizes the\nreasoning process, evidence utilization, and explicit delineation of\ncounter-claims (defeaters) and counter-evidence. In this paper, we present our\napproach to enhancing Assurance 2.0 with semantic rule-based analysis\ncapabilities using common-sense reasoning and answer set programming solvers,\nspecifically s(CASP). By employing these analysis techniques, we examine the\nunique semantic aspects of assurance cases, such as logical consistency,\nadequacy, indefeasibility, etc. The application of these analyses provides both\nsystem developers and evaluators with increased confidence about the assurance\ncase.\n","subjects":["Computing Research Repository/Logic in Computer Science","Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}