{"id":"2408.09381","title":"Channel Estimation, Interpolation and Extrapolation in Doubly-dispersive\n  Channels","authors":"Zijun Gong, Fan Jiang, Yuhui Song, Cheng Li, Xiaofeng Tao","authorsParsed":[["Gong","Zijun",""],["Jiang","Fan",""],["Song","Yuhui",""],["Li","Cheng",""],["Tao","Xiaofeng",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 06:45:07 GMT"}],"updateDate":"2024-08-20","timestamp":1723963507000,"abstract":"  The OTFS (Orthogonal Time Frequency Space) is widely acknowledged for its\nability to combat Doppler spread in time-varying channels. In this paper,\nanother advantage of OTFS over OFDM (Orthogonal Frequency Division\nMultiplexing) will be demonstrated: much reduced channel training overhead.\nSpecifically, the sparsity of the channel in delay-Doppler (D-D) domain implies\nstrong correlation of channel gains in time-frequency (T-F) domain, which can\nbe harnessed to reduce channel training overhead through interpolation. An\nimmediate question is how much training overhead is needed in doubly-dispersive\nchannels? A conventional belief is that the overhead is only dependent on the\nproduct of delay and Doppler spreads, but we will show that it's also dependent\non the T-F window size. The finite T-F window leads to infinite spreading in\nD-D domain, and aliasing will be inevitable after sampling in T-F domain. Two\ndirect consequences of the aliasing are increased channel training overhead and\ninterference. Another factor contributing to channel estimation error is the\ninter-symbol-carrier-interference (ISCI), resulting from the uncertainty\nprinciple. Both aliasing and ISCI are considered in channel modelling, a\nlow-complexity algorithm is proposed for channel estimation and interpolation\nthrough FFT. A large T-F window is necessary for reduced channel training\noverhead and aliasing, but increases processing delay. Fortunately, we show\nthat the proposed algorithm can be implemented in a pipeline fashion. Further\nmore, we showed that data-aided channel tracking is possible in D-D domain to\nfurther reduce the channel estimation frequency, i.e., channel extrapolation.\nThe impacts of aliasing and ISCI on channel interpolation error are analyzed.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}