{"id":"2408.03084","title":"Research on Autonomous Driving Decision-making Strategies based Deep\n  Reinforcement Learning","authors":"Zixiang Wang, Hao Yan, Changsong Wei, Junyu Wang, Shi Bo, Minheng Xiao","authorsParsed":[["Wang","Zixiang",""],["Yan","Hao",""],["Wei","Changsong",""],["Wang","Junyu",""],["Bo","Shi",""],["Xiao","Minheng",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 10:24:54 GMT"}],"updateDate":"2024-08-07","timestamp":1722939894000,"abstract":"  The behavior decision-making subsystem is a key component of the autonomous\ndriving system, which reflects the decision-making ability of the vehicle and\nthe driver, and is an important symbol of the high-level intelligence of the\nvehicle. However, the existing rule-based decision-making schemes are limited\nby the prior knowledge of designers, and it is difficult to cope with complex\nand changeable traffic scenarios. In this work, an advanced deep reinforcement\nlearning model is adopted, which can autonomously learn and optimize driving\nstrategies in a complex and changeable traffic environment by modeling the\ndriving decision-making process as a reinforcement learning problem.\nSpecifically, we used Deep Q-Network (DQN) and Proximal Policy Optimization\n(PPO) for comparative experiments. DQN guides the agent to choose the best\naction by approximating the state-action value function, while PPO improves the\ndecision-making quality by optimizing the policy function. We also introduce\nimprovements in the design of the reward function to promote the robustness and\nadaptability of the model in real-world driving situations. Experimental\nresults show that the decision-making strategy based on deep reinforcement\nlearning has better performance than the traditional rule-based method in a\nvariety of driving tasks.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qxNtaXRbBB5VFQh9Y2UJyWAVId0DWk3DqtKnPPFmQpw","pdfSize":"437425"}
