{"id":"2408.10190","title":"Superconductivity and spin canting in spin-orbit proximitized\n  rhombohedral trilayer graphene","authors":"Caitlin L. Patterson, Owen I. Sheekey, Trevor B. Arp, Ludwig F. W.\n  Holleis, Jin Ming Koh, Youngjoon Choi, Tian Xie, Siyuan Xu, Evgeny Redekop,\n  Grigory Babikyan, Haoxin Zhou, Xiang Cheng, Takashi Taniguchi, Kenji\n  Watanabe, Chenhao Jin, Etienne Lantagne-Hurtubise, Jason Alicea, Andrea F.\n  Young","authorsParsed":[["Patterson","Caitlin L.",""],["Sheekey","Owen I.",""],["Arp","Trevor B.",""],["Holleis","Ludwig F. W.",""],["Koh","Jin Ming",""],["Choi","Youngjoon",""],["Xie","Tian",""],["Xu","Siyuan",""],["Redekop","Evgeny",""],["Babikyan","Grigory",""],["Zhou","Haoxin",""],["Cheng","Xiang",""],["Taniguchi","Takashi",""],["Watanabe","Kenji",""],["Jin","Chenhao",""],["Lantagne-Hurtubise","Etienne",""],["Alicea","Jason",""],["Young","Andrea F.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 17:50:03 GMT"}],"updateDate":"2024-08-20","timestamp":1724089803000,"abstract":"  Graphene and transition metal dichalcogenide flat-band systems show similar\nphase diagrams, replete with magnetic and superconducting phases. An abiding\nquestion has been whether magnetic ordering competes with superconductivity or\nfacilitates pairing. The advent of crystalline graphene superconductors enables\na new generation of controlled experiments to probe the microscopic origin of\nsuperconductivity. For example, recent studies of Bernal bilayer graphene show\na dramatic increase in the observed domain and critical temperature $T_c$ of\nsuperconducting states in the presence of enhanced spin-orbit coupling; the\nmechanism for this enhancement, however, remains unclear. Here, we show that\nintroducing spin-orbit coupling in rhombohedral trilayer graphene (RTG) via\nsubstrate proximity effect generates new superconducting pockets for both\nelectron and hole doping, with maximal $T_c\\approx$ 300mK three times larger\nthan in RTG encapsulated by hexagonal boron nitride alone. Using local\nmagnetometry and thermodynamic compressibility measurements, we show that\nsuperconductivity straddles an apparently continuous transition between a\nspin-canted state with a finite in-plane magnetic moment and a state with\ncomplete spin-valley locking. This transition is reproduced in our Hartree-Fock\ncalculations, where it is driven by the competition between spin-orbit coupling\nand the carrier-density-tuned Hund's interaction. Our experiment suggests that\nthe enhancement of superconductivity by spin-orbit coupling is driven not by a\nchange in the ground state symmetry or degeneracy but rather by a quantitative\nchange in the canting angle. These results align with a recently proposed\nmechanism for the enhancement of superconductivity in spin-orbit coupled\nrhombohedral multilayers, in which fluctuations in the spin-canting order\ncontribute to the pairing interaction.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}