{"id":"2408.11726","title":"A Quantum Approximate Optimization Algorithm-based Decoder Architecture\n  for NextG Wireless Channel Codes","authors":"Srikar Kasi, James Sud, Kyle Jamieson, Gokul Subramanian Ravi","authorsParsed":[["Kasi","Srikar",""],["Sud","James",""],["Jamieson","Kyle",""],["Ravi","Gokul Subramanian",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 15:53:09 GMT"}],"updateDate":"2024-08-22","timestamp":1724255589000,"abstract":"  Forward Error Correction (FEC) provides reliable data flow in wireless\nnetworks despite the presence of noise and interference. However, its\nprocessing demands significant fraction of a wireless network's resources, due\nto its computationally-expensive decoding process. This forces network\ndesigners to compromise between performance and implementation complexity. In\nthis paper, we investigate a novel processing architecture for FEC decoding,\none based on the quantum approximate optimization algorithm (QAOA), to evaluate\nthe potential of this emerging quantum compute approach in resolving the\ndecoding performance-complexity tradeoff.\n  We present FDeQ, a QAOA-based FEC Decoder design targeting the popular NextG\nwireless Low Density Parity Check (LDPC) and Polar codes. To accelerate\nQAOA-based decoding towards practical utility, FDeQ exploits temporal\nsimilarity among the FEC decoding tasks. This similarity is enabled by the\nfixed structure of a particular FEC code, which is independent of any\ntime-varying wireless channel noise, ambient interference, and even the payload\ndata. We evaluate FDeQ at a variety of system parameter settings in both ideal\n(noiseless) and noisy QAOA simulations, and show that FDeQ achieves successful\ndecoding with error performance at par with state-of-the-art classical decoders\nat low FEC code block lengths. Furthermore, we present a holistic resource\nestimation analysis, projecting quantitative targets for future quantum devices\nin terms of the required qubit count and gate duration, for the application of\nFDeQ in practical wireless networks, highlighting scenarios where FDeQ may\noutperform state-of-the-art classical FEC decoders.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}