{"id":"2408.10547","title":"Semi-on-Demand Off-Peak Transit Services with Shared Autonomous Vehicles\n  -- Service Planning, Simulation, and Analysis in Munich, Germany","authors":"Max T.M. Ng, Roman Engelhardt, Florian Dandl, Vasileios Volakakis,\n  Hani S. Mahmassani, Klaus Bogenberger","authorsParsed":[["Ng","Max T. M.",""],["Engelhardt","Roman",""],["Dandl","Florian",""],["Volakakis","Vasileios",""],["Mahmassani","Hani S.",""],["Bogenberger","Klaus",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 04:58:47 GMT"}],"updateDate":"2024-08-21","timestamp":1724129927000,"abstract":"  This study investigates the implementation of semi-on-demand (SoD)\nhybrid-route services using Shared Autonomous Vehicles (SAVs) on existing\ntransit lines. SoD services combine the cost efficiency of fixed-route buses\nwith the flexibility of on-demand services. SAVs first serve all scheduled\nfixed-route stops, then drop off and pick up passengers in the pre-determined\nflexible-route portion, and return to the fixed route. This study addresses\nfour key questions: optimal fleet and vehicle sizes for peak-hour fixed-route\nservices with SAVs and during transition (from drivers to autonomous vehicles),\noptimal off-peak SoD service planning, and suitable use cases. The methodology\ncombines analytical modeling for service planning with agent-based simulation\nfor operational analysis. We examine ten bus routes in Munich, Germany,\nconsidering full SAV and transition scenarios with varying proportions of\ndrivers. Our findings demonstrate that the lower operating costs of SAVs\nimprove service quality through increased frequency and smaller vehicles, even\nin transition scenarios. The reduced headway lowers waiting time and also\nfavors more flexible-route operation in SoD services. The optimal SoD settings\nrange from fully flexible to hybrid routes, where higher occupancy from the\nterminus favors shorter flexible routes. During the transition phase, limited\nfleet size and higher headways constrain the benefits of flexible-route\noperations. The simulation results corroborate the SoD benefits of door-to-door\nconvenience, attracting more passengers without excessive detours and operator\ncosts at moderate flexible-route lengths, and validate the analytical model.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"D63MLIMRnRKUVAHPGvu35ptkA3GvsHNiWxGQEDS_zKI","pdfSize":"4750004"}
