{"id":"2408.07346","title":"Enabling microrobotic chemotaxis via reset-free hierarchical\n  reinforcement learning","authors":"Tongzhao Xiong and Zhaorong Liu and Chong Jin Ong and Lailai Zhu","authorsParsed":[["Xiong","Tongzhao",""],["Liu","Zhaorong",""],["Ong","Chong Jin",""],["Zhu","Lailai",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 07:41:04 GMT"}],"updateDate":"2024-08-15","timestamp":1723621264000,"abstract":"  Microorganisms have evolved diverse strategies to propel in viscous fluids,\nnavigate complex environments, and exhibit taxis in response to stimuli. This\nhas inspired the development of synthetic microrobots, where machine learning\n(ML) is playing an increasingly important role. Can ML endow these robots with\nintelligence resembling that developed by their natural counterparts over\nevolutionary timelines? Here, we demonstrate chemotactic navigation of a\nmulti-link articulated microrobot using two-level hierarchical reinforcement\nlearning (RL). The lower-level RL allows the robot -- featuring either a chain\nor ring topology -- to acquire topology-specific swimming gaits: wave\npropagation characteristic of flagella or body oscillation akin to an ameboid.\nSuch flagellar and ameboid microswimmers, further enabled by the higher-level\nRL, accomplish chemotactic navigation in prototypical biologically-relevant\nscenarios that feature conflicting chemoattractants, pursuing a swimming\nbacterial mimic, steering in vortical flows, and squeezing through tight\nconstrictions. Additionally, we achieve reset-free, partially observable RL,\nwhere the robot observes only its joint angles and local scalar quantities.\nThis advancement illuminates solutions for overcoming the persistent challenges\nof manual resets and partial observability in real-world microrobotic RL.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MmJl_VsCgW9VNZYGHgkJ92yfJgpSkhWknrpRnKOyYHQ","pdfSize":"28216472"}
