{"id":"2408.00681","title":"Alpha-VI DeepONet: A prior-robust variational Bayesian approach for\n  enhancing DeepONets with uncertainty quantification","authors":"Soban Nasir Lone and Subhayan De and Rajdip Nayek","authorsParsed":[["Lone","Soban Nasir",""],["De","Subhayan",""],["Nayek","Rajdip",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 16:22:03 GMT"}],"updateDate":"2024-08-02","timestamp":1722529323000,"abstract":"  We introduce a novel deep operator network (DeepONet) framework that\nincorporates generalised variational inference (GVI) using R\\'enyi's\n$\\alpha$-divergence to learn complex operators while quantifying uncertainty.\nBy incorporating Bayesian neural networks as the building blocks for the branch\nand trunk networks, our framework endows DeepONet with uncertainty\nquantification. The use of R\\'enyi's $\\alpha$-divergence, instead of the\nKullback-Leibler divergence (KLD), commonly used in standard variational\ninference, mitigates issues related to prior misspecification that are\nprevalent in Variational Bayesian DeepONets. This approach offers enhanced\nflexibility and robustness. We demonstrate that modifying the variational\nobjective function yields superior results in terms of minimising the mean\nsquared error and improving the negative log-likelihood on the test set. Our\nframework's efficacy is validated across various mechanical systems, where it\noutperforms both deterministic and standard KLD-based VI DeepONets in\npredictive accuracy and uncertainty quantification. The hyperparameter\n$\\alpha$, which controls the degree of robustness, can be tuned to optimise\nperformance for specific problems. We apply this approach to a range of\nmechanics problems, including gravity pendulum, advection-diffusion, and\ndiffusion-reaction systems. Our findings underscore the potential of\n$\\alpha$-VI DeepONet to advance the field of data-driven operator learning and\nits applications in engineering and scientific domains.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"lHMTS-Y52O9_wGB7JtN6dbG4UseK1K9cilMQfp3Wqoo","pdfSize":"2425318"}
