{"id":"2408.02982","title":"Practical Design of Probabilistic Constellation Shaping for Physical\n  Layer Security in Visible Light Communications","authors":"Thanh V. Pham and Susumu Ishihara","authorsParsed":[["Pham","Thanh V.",""],["Ishihara","Susumu",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 06:29:39 GMT"}],"updateDate":"2024-08-07","timestamp":1722925779000,"abstract":"  This paper studies a practical design of probabilistic constellation shaping\n(PCS) for physical layer security in visible light communications (VLC). In\nparticular, we consider a wiretap VLC channel employing a probabilistically\nshaped $M$-ary pulse amplitude modulation (PAM) constellation. Considering the\nrequirements for reliability of the legitimate user's channel, flickering-free\ntransmission, and symmetric constellation distribution, the optimal\nconstellation distributions to maximize modulation-constrained secrecy capacity\nor the bit error rate (BER) of eavesdropper's channel are investigated for both\nscenarios of known and unknown eavesdropper's channel state information (CSI).\nTo formulate the constraint on the channel reliability, tractable closed-form\nexpressions for the upper bound and approximate BER of $M$-ary PAM under an\narbitrary symbol probability are derived. The design problem is shown to be\nnon-convex due to the non-convex BER constraint. By proving that the upper\nbound BER is a concave function of the constellation distribution, a suboptimal\nsolution based on the convex-concave procedure (CCCP) is presented. Our\nfindings reveal that while the uniform signaling can only satisfy the BER\nconstraint when the optical power is beyond a certain value, the proposed PCS\ndesign works in the entire region of the optical power. Some insights into the\noptimal constellation distribution with respect to the emitted optical power\nare also discussed.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}