{"id":"2408.10003","title":"Towards a Knowledge Graph for Models and Algorithms in Applied\n  Mathematics","authors":"Bj\\\"orn Schembera and Frank W\\\"ubbeling and Hendrik Kleikamp and\n  Burkhard Schmidt and Aurela Shehu and Marco Reidelbach and Christine\n  Biedinger and Jochen Fiedler and Thomas Koprucki and Dorothea Iglezakis and\n  Dominik G\\\"oddeke","authorsParsed":[["Schembera","Björn",""],["Wübbeling","Frank",""],["Kleikamp","Hendrik",""],["Schmidt","Burkhard",""],["Shehu","Aurela",""],["Reidelbach","Marco",""],["Biedinger","Christine",""],["Fiedler","Jochen",""],["Koprucki","Thomas",""],["Iglezakis","Dorothea",""],["Göddeke","Dominik",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 13:57:49 GMT"}],"updateDate":"2024-08-20","timestamp":1724075869000,"abstract":"  Mathematical models and algorithms are an essential part of mathematical\nresearch data, as they are epistemically grounding numerical data. In order to\nrepresent models and algorithms as well as their relationship semantically to\nmake this research data FAIR, two previously distinct ontologies were merged\nand extended, becoming a living knowledge graph. The link between the two\nontologies is established by introducing computational tasks, as they occur in\nmodeling, corresponding to algorithmic tasks. Moreover, controlled vocabularies\nare incorporated and a new class, distinguishing base quantities from specific\nuse case quantities, was introduced. Also, both models and algorithms can now\nbe enriched with metadata. Subject-specific metadata is particularly relevant\nhere, such as the symmetry of a matrix or the linearity of a mathematical\nmodel. This is the only way to express specific workflows with concrete models\nand algorithms, as the feasible solution algorithm can only be determined if\nthe mathematical properties of a model are known. We demonstrate this using two\nexamples from different application areas of applied mathematics. In addition,\nwe have already integrated over 250 research assets from applied mathematics\ninto our knowledge graph.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Digital Libraries"],"license":"http://creativecommons.org/licenses/by/4.0/"}