{"id":"2408.02953","title":"Large Landscape of 4d Superconformal Field Theories from Small Gauge\n  Theories","authors":"Minseok Cho, Kazunobu Maruyoshi, Emily Nardoni, Jaewon Song","authorsParsed":[["Cho","Minseok",""],["Maruyoshi","Kazunobu",""],["Nardoni","Emily",""],["Song","Jaewon",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 04:43:45 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 02:48:30 GMT"}],"updateDate":"2024-08-23","timestamp":1722919425000,"abstract":"  We systematically explore the space of renormalization group flows of\nfour-dimensional $\\mathcal{N}=1$ superconformal field theories (SCFTs)\ntriggered by relevant deformations, as well as by coupling to free chiral\nmultiplets with relevant operators. In this way, we classify all possible fixed\npoint SCFTs that can be obtained from certain rank 1 and 2 supersymmetric gauge\ntheories with small amount of matter multiplets, identifying 7,346 inequivalent\nfixed points which pass a series of non-trivial consistency checks. This set of\nfixed points exhibits interesting statistical behaviors, including a narrow\ndistribution of central charges $(a, c)$, a correlation between the number of\nrelevant operators and the ratio $a/c$, and trends in the lightest operator\ndimension versus $a/c$. The ratio $a/c$ of this set is distributed between\n$0.7228$ and $1.2100$, where the upper bound is larger than that of previously\nknown interacting SCFTs. Moreover, we find a plethora of highly\nnon-perturbative phenomena, such as (super)symmetry enhancements, operator\ndecoupling, non-commuting renormalization group flows, and dualities. We\nespecially identify amongst these fixed points a new SCFT that has smaller\ncentral charges $(a, c) = (\\frac{633}{2000},\\frac{683}{2000})$ than that of the\ndeformed minimal Argyres-Douglas theory, as well as novel Lagrangian duals for\ncertain $\\mathcal{N}=1$ deformed Argyres-Douglas theories. We provide a website\nhttps://qft.kaist.ac.kr/landscape to navigate through our set of fixed points.\n","subjects":["Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}