{"id":"2408.14917","title":"PMSN: A Parallel Multi-compartment Spiking Neuron for Multi-scale\n  Temporal Processing","authors":"Xinyi Chen, Jibin Wu, Chenxiang Ma, Yinsong Yan, Yujie Wu, Kay Chen\n  Tan","authorsParsed":[["Chen","Xinyi",""],["Wu","Jibin",""],["Ma","Chenxiang",""],["Yan","Yinsong",""],["Wu","Yujie",""],["Tan","Kay Chen",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 09:47:46 GMT"}],"updateDate":"2024-08-28","timestamp":1724752066000,"abstract":"  Spiking Neural Networks (SNNs) hold great potential to realize\nbrain-inspired, energy-efficient computational systems. However, current SNNs\nstill fall short in terms of multi-scale temporal processing compared to their\nbiological counterparts. This limitation has resulted in poor performance in\nmany pattern recognition tasks with information that varies across different\ntimescales. To address this issue, we put forward a novel spiking neuron model\ncalled Parallel Multi-compartment Spiking Neuron (PMSN). The PMSN emulates\nbiological neurons by incorporating multiple interacting substructures and\nallows for flexible adjustment of the substructure counts to effectively\nrepresent temporal information across diverse timescales. Additionally, to\naddress the computational burden associated with the increased complexity of\nthe proposed model, we introduce two parallelization techniques that decouple\nthe temporal dependencies of neuronal updates, enabling parallelized training\nacross different time steps. Our experimental results on a wide range of\npattern recognition tasks demonstrate the superiority of PMSN. It outperforms\nother state-of-the-art spiking neuron models in terms of its temporal\nprocessing capacity, training speed, and computation cost. Specifically,\ncompared with the commonly used Leaky Integrate-and-Fire neuron, PMSN offers a\nsimulation acceleration of over 10 $\\times$ and a 30 % improvement in accuracy\non Sequential CIFAR10 dataset, while maintaining comparable computational cost.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}