{"id":"2408.01327","title":"Modeling Interfering Sources in Shared Queues for Timely Computations in\n  Edge Computing Systems","authors":"Nail Akar, Melih Bastopcu, Sennur Ulukus, Tamer Ba\\c{s}ar","authorsParsed":[["Akar","Nail",""],["Bastopcu","Melih",""],["Ulukus","Sennur",""],["Başar","Tamer",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 15:26:05 GMT"}],"updateDate":"2024-08-05","timestamp":1722612365000,"abstract":"  Most existing stochastic models on age of information (AoI) focus on a single\nshared server serving status update packets from $N>1$ sources where each\npacket update stream is Poisson, i.e., single-hop scenario. In the current\nwork, we study a two-hop edge computing system for which status updates from\nthe information sources are still Poisson but they are not immediately\navailable at the shared edge server, but instead they need to first receive\nservice from a transmission server dedicated to each source. For exponentially\ndistributed and heterogeneous service times for both the dedicated servers and\nthe edge server, and bufferless preemptive resource management, we develop an\nanalytical model using absorbing Markov chains (AMC) for obtaining the\ndistribution of AoI for any source in the system. Moreover, for a given tagged\nsource, the traffic arriving at the shared server from the $N-1$ un-tagged\nsources, namely the interference traffic, is not Poisson any more, but is\ninstead a Markov modulated Poisson process (MMPP) whose state space grows\nexponentially with $N$. Therefore, we propose to employ a model reduction\ntechnique that approximates the behavior of the MMPP interference traffic with\ntwo states only, making it possible to approximately obtain the AoI statistics\neven for a very large number of sources. Numerical examples are presented to\nvalidate the proposed exact and approximate models.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Performance","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}