{"id":"2408.09847","title":"Fashion Image-to-Image Translation for Complementary Item Retrieval","authors":"Matteo Attimonelli, Claudio Pomo, Dietmar Jannach, Tommaso Di Noia","authorsParsed":[["Attimonelli","Matteo",""],["Pomo","Claudio",""],["Jannach","Dietmar",""],["Di Noia","Tommaso",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 09:50:20 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 07:40:41 GMT"}],"updateDate":"2024-08-26","timestamp":1724061020000,"abstract":"  The increasing demand for online fashion retail has boosted research in\nfashion compatibility modeling and item retrieval, focusing on matching user\nqueries (textual descriptions or reference images) with compatible fashion\nitems. A key challenge is top-bottom retrieval, where precise compatibility\nmodeling is essential. Traditional methods, often based on Bayesian\nPersonalized Ranking (BPR), have shown limited performance. Recent efforts have\nexplored using generative models in compatibility modeling and item retrieval,\nwhere generated images serve as additional inputs. However, these approaches\noften overlook the quality of generated images, which could be crucial for\nmodel performance. Additionally, generative models typically require large\ndatasets, posing challenges when such data is scarce.\n  To address these issues, we introduce the Generative Compatibility Model\n(GeCo), a two-stage approach that improves fashion image retrieval through\npaired image-to-image translation. First, the Complementary Item Generation\nModel (CIGM), built on Conditional Generative Adversarial Networks (GANs),\ngenerates target item images (e.g., bottoms) from seed items (e.g., tops),\noffering conditioning signals for retrieval. These generated samples are then\nintegrated into GeCo, enhancing compatibility modeling and retrieval accuracy.\nEvaluations on three datasets show that GeCo outperforms state-of-the-art\nbaselines. Key contributions include: (i) the GeCo model utilizing paired\nimage-to-image translation within the Composed Image Retrieval framework, (ii)\ncomprehensive evaluations on benchmark datasets, and (iii) the release of a new\nFashion Taobao dataset designed for top-bottom retrieval, promoting further\nresearch.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7-c_tgViS2HyGqrIZUsDEMF1QWxxTyFdBgupIfqRRSQ","pdfSize":"8721226"}
