{"id":"2408.00169","title":"Strike the Balance: On-the-Fly Uncertainty based User Interactions for\n  Long-Term Video Object Segmentation","authors":"St\\'ephane Vujasinovi\\'c and Stefan Becker and Sebastian Bullinger and\n  Norbert Scherer-Negenborn and Michael Arens","authorsParsed":[["Vujasinović","Stéphane",""],["Becker","Stefan",""],["Bullinger","Sebastian",""],["Scherer-Negenborn","Norbert",""],["Arens","Michael",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 21:42:42 GMT"}],"updateDate":"2024-08-02","timestamp":1722462162000,"abstract":"  In this paper, we introduce a variant of video object segmentation (VOS) that\nbridges interactive and semi-automatic approaches, termed Lazy Video Object\nSegmentation (ziVOS). In contrast, to both tasks, which handle video object\nsegmentation in an off-line manner (i.e., pre-recorded sequences), we propose\nthrough ziVOS to target online recorded sequences. Here, we strive to strike a\nbalance between performance and robustness for long-term scenarios by\nsoliciting user feedback's on-the-fly during the segmentation process. Hence,\nwe aim to maximize the tracking duration of an object of interest, while\nrequiring minimal user corrections to maintain tracking over an extended\nperiod. We propose a competitive baseline, i.e., Lazy-XMem, as a reference for\nfuture works in ziVOS. Our proposed approach uses an uncertainty estimation of\nthe tracking state to determine whether a user interaction is necessary to\nrefine the model's prediction. To quantitatively assess the performance of our\nmethod and the user's workload, we introduce complementary metrics alongside\nthose already established in the field. We evaluate our approach using the\nrecently introduced LVOS dataset, which offers numerous long-term videos. Our\ncode is publicly available at https://github.com/Vujas-Eteph/LazyXMem.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"hp6ZWXxFEUdW3yHgHlalt32n3SewZsIxd0T__8kZnrM","pdfSize":"5275414","txDigest":"AY2b4MEUJFcDiyevVVrF1bhM18s5EopaXkCb586ykasN","endEpoch":"1","status":"CERTIFIED"}
