{"id":"2408.06182","title":"Bulk-spatiotemporal vortex correspondence in gyromagnetic\n  double-zero-index media","authors":"Ruo-Yang Zhang, Xiaohan Cui, Yuan-Song Zeng, Jin Chen, Wenzhe Liu,\n  Mudi Wang, Dongyang Wang, Zhao-Qing Zhang, Neng Wang, Geng-Bo Wu, and C. T.\n  Chan","authorsParsed":[["Zhang","Ruo-Yang",""],["Cui","Xiaohan",""],["Zeng","Yuan-Song",""],["Chen","Jin",""],["Liu","Wenzhe",""],["Wang","Mudi",""],["Wang","Dongyang",""],["Zhang","Zhao-Qing",""],["Wang","Neng",""],["Wu","Geng-Bo",""],["Chan","C. T.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 14:29:25 GMT"}],"updateDate":"2024-08-13","timestamp":1723472965000,"abstract":"  Photonic double-zero-index media, distinguished by concurrently zero-valued\npermittivity and permeability, exhibit extraordinary properties not found in\nnature. Remarkably, the notion of zero-index can be substantially expanded by\ngeneralizing the constitutive parameters from null scalars to nonreciprocal\ntensors with nonzero matrix elements but zero determinants. Here, we\nexperimentally realize such a new class of gyromagnetic double-zero-index\nmetamaterials possessing both double-zero-index features and nonreciprocal\nhallmarks. As an intrinsic property, this metamaterial always emerges at a\nspin-1/2 Dirac point of a topological phase transition. We discover and\nrigorously prove that a spatiotemporal reflection vortex singularity is always\nanchored to the metamaterial's Dirac point, with the vortex charge being\ndetermined by the topological invariant leap across the phase transition. This\nestablishes a unique bulk-spatiotemporal vortex correspondence that extends the\nprotected boundary effects into the time domain and exclusively characterizes\ntopological phase transition points, setting it apart from any pre-existing\nbulk-boundary correspondence. Based on this correspondence, we propose and\nexperimentally demonstrate a mechanism to deterministically generate optical\nspatiotemporal vortex pulses with firmly fixed central frequency and momentum,\nhence showing unparalleled robustness. Our findings uncover deep connections\nbetween zero-refractive-index photonics, topological photonics, and singular\noptics, opening the avenue for the manipulation of space-time topological light\nfields via the inherent topology of extreme-parameter metamaterials.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}