{"id":"2408.07444","title":"Costal Cartilage Segmentation with Topology Guided Deformable Mamba:\n  Method and Benchmark","authors":"Senmao Wang, Haifan Gong, Runmeng Cui, Boyao Wan, Yicheng Liu,\n  Zhonglin Hu, Haiqing Yang, Jingyang Zhou, Bo Pan, Lin Lin, Haiyue Jiang","authorsParsed":[["Wang","Senmao",""],["Gong","Haifan",""],["Cui","Runmeng",""],["Wan","Boyao",""],["Liu","Yicheng",""],["Hu","Zhonglin",""],["Yang","Haiqing",""],["Zhou","Jingyang",""],["Pan","Bo",""],["Lin","Lin",""],["Jiang","Haiyue",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 10:31:19 GMT"}],"updateDate":"2024-08-15","timestamp":1723631479000,"abstract":"  Costal cartilage segmentation is crucial to various medical applications,\nnecessitating precise and reliable techniques due to its complex anatomy and\nthe importance of accurate diagnosis and surgical planning. We propose a novel\ndeep learning-based approach called topology-guided deformable Mamba (TGDM) for\ncostal cartilage segmentation. The TGDM is tailored to capture the intricate\nlong-range costal cartilage relationships. Our method leverages a deformable\nmodel that integrates topological priors to enhance the adaptability and\naccuracy of the segmentation process. Furthermore, we developed a comprehensive\nbenchmark that contains 165 cases for costal cartilage segmentation. This\nbenchmark sets a new standard for evaluating costal cartilage segmentation\ntechniques and provides a valuable resource for future research. Extensive\nexperiments conducted on both in-domain benchmarks and out-of domain test sets\ndemonstrate the superiority of our approach over existing methods, showing\nsignificant improvements in segmentation precision and robustness.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"-pMpXS-6T5R1m0O9t6fnizfFopjugnCdBW4o04lG9us","pdfSize":"9277664"}
