{"id":"2408.03158","title":"Inner core heterogeneity induced by a large variation in lower mantle\n  heat flux","authors":"Aditya Varma, Binod Sreenivasan","authorsParsed":[["Varma","Aditya",""],["Sreenivasan","Binod",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 11:37:18 GMT"}],"updateDate":"2024-08-07","timestamp":1722685038000,"abstract":"  Seismic mapping of the top of the inner core indicates two distinct areas of\nhigh P-wave velocity, the stronger one located beneath Asia, and the other\nlocated beneath the Atlantic. This two-fold pattern supports the idea that a\nlower-mantle heterogeneity can be transmitted to the inner core through outer\ncore convection. In this study, a two-component convective dynamo model, where\nthermal convection is near critical and compositional convection is strongly\nsupercritical, produces a substantial inner core heterogeneity in the rapidly\nrotating strongly driven regime of Earth's core. While the temperature profile\nthat models secular cooling ensures that the mantle heterogeneity propagates as\nfar as the inner core boundary (ICB), the distribution of heat flux at the ICB\nis determined by the strength of compositional buoyancy. A large heat flux\nvariation $q^*$ of $O(10)$ at the core-mantle boundary (CMB), where $q^*$ is\nthe ratio of the maximum heat flux difference to the mean heat flux at the CMB,\nproduces a core flow regime of long-lived convection in the east and\ntime-varying convection in the west. Here, the P-wave velocity estimated from\nthe ICB heat flux in the dynamo is higher in the east than in the west, with\nthe hemispherical difference of the same order as the observed lower bound,\n0.5%. Additional observational constraints are satisfied in this regime -- the\nvariability of high-latitude magnetic flux in the east is lower than that in\nthe west; and the stratified F-layer at the base of the outer core, which is\nfed by the mass flux from regional melting of the inner core and magnetically\ndamped, attains a steady-state height of $\\sim$ 200 km.\n","subjects":["Physics/Geophysics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"2FbRbwYsrXG5gj-M-t_w31oBC1IWL5CSxhbok_4e2wE","pdfSize":"2750693"}
