{"id":"2408.16177","title":"The Standard Model of Particle Physics as an effective theory from two\n  non-universal $U(1)$'s","authors":"Richard H. Benavides, Yithsbey Giraldo, William A. Ponce, Oscar\n  Rodr\\'iguez, Eduardo Rojas","authorsParsed":[["Benavides","Richard H.",""],["Giraldo","Yithsbey",""],["Ponce","William A.",""],["Rodríguez","Oscar",""],["Rojas","Eduardo",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 23:56:15 GMT"}],"updateDate":"2024-08-30","timestamp":1724889375000,"abstract":"  We study the possibility of obtaining the Standard Model (SM) of particle\nphysics as an effective theory of a more fundamental one, whose electroweak\nsector includes two non-universal local $U(1)$ gauge groups, with the chiral\nanomaly cancellation taking place through an interplay among families. As a\nresult of the spontaneous symmetry breaking, a massive gauge boson $Z'$ arises,\nwhich couples differently to the third family of fermions (by assumption, we\nrestrict ourselves to the scenario in which the $Z'$ couples in the same way to\nthe first two families). Two Higgs doublets and one scalar singlet are\nnecessary to generate the SM fermion masses and break the gauge symmetries. We\nshow that in our model, the flavor-changing neutral currents (FCNC) of the\nHiggs sector are identically zero if each right-handed SM fermion is only\ncoupled with a single Higgs doublet. This result represents a FCNC cancellation\nmechanism different from the usual procedure in Two-Higgs Doublet\nModels~(2HDM). The non-universal nature of our solutions requires the presence\nof three right-handed neutrino fields, one for each family. Our model generates\nall elements of the Dirac mass matrix for quarks and leptons, which is quite\nnon-trivial for non-universal models. Thus, we can fit all the masses and\nmixing angles with two scalar doublets. Finally, we show the distribution of\nsolutions for the scalar boson masses in our model by scanning well-motivated\nintervals for the model parameters. We consider two possibilities for the\nscalar potential and compare these results with the Higgs-like resonant signals\nrecently reported by the ATLAS and CMS experiments at the LHC. Finally, we also\nreport collider, electroweak, and flavor constraints on the model parameters.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}