{"id":"2408.00040","title":"Barlow Twins Deep Neural Network for Advanced 1D Drug-Target Interaction\n  Prediction","authors":"Maximilian G. Schuh, Davide Boldini, Annkathrin I. Bohne, Stephan A.\n  Sieber","authorsParsed":[["Schuh","Maximilian G.",""],["Boldini","Davide",""],["Bohne","Annkathrin I.",""],["Sieber","Stephan A.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 14:06:18 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 12:00:23 GMT"}],"updateDate":"2024-09-04","timestamp":1722434778000,"abstract":"  Accurate prediction of drug-target interactions is critical for advancing\ndrug discovery. By reducing time and cost, machine learning and deep learning\ncan accelerate this laborious discovery process. In a novel approach,\nBarlowDTI, we utilise the powerful Barlow Twins architecture for\nfeature-extraction while considering the structure of the target protein. Our\nmethod achieves state-of-the-art predictive performance against multiple\nestablished benchmarks using only one-dimensional input. The use of gradient\nboosting machine as the underlying predictor ensures fast and efficient\npredictions without the need for substantial computational resources. We also\ninvestigate how the model reaches its decision based on individual training\nsamples. By comparing co-crystal structures, we find that BarlowDTI effectively\nexploits catalytically active and stabilising residues, highlighting the\nmodel's ability to generalise from one-dimensional input data. In addition, we\nfurther benchmark new baselines against existing methods. Together, these\ninnovations improve the efficiency and effectiveness of drug-target interaction\npredictions, providing robust tools for accelerating drug development and\ndeepening the understanding of molecular interactions. Therefore, we provide an\neasy-to-use web interface that can be freely accessed at\nhttps://www.bio.nat.tum.de/oc2/barlowdti .\n","subjects":["Quantitative Biology/Biomolecules","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}