{"id":"2408.06912","title":"New refinements of Narayana polynomials and Motzkin polynomials","authors":"Janet J.W. Dong, Lora R. Du, Kathy Q. Ji and Dax T.X. Zhang","authorsParsed":[["Dong","Janet J. W.",""],["Du","Lora R.",""],["Ji","Kathy Q.",""],["Zhang","Dax T. X.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 14:05:19 GMT"},{"version":"v2","created":"Sun, 18 Aug 2024 07:14:44 GMT"}],"updateDate":"2024-08-20","timestamp":1723557919000,"abstract":"  Chen, Deutsch and Elizalde introduced a refinement of the Narayana\npolynomials by distinguishing between old (leftmost child) and young leaves of\nplane trees. They also provided a refinement of Coker's formula by constructing\na bijection. In fact, Coker's formula establishes a connection between the\nNarayana polynomials and the Motzkin polynomials, which implies the\n$\\gamma$-positivity of the Narayana polynomials. In this paper, we introduce\nthe polynomial $G_{n}(x_{11},x_{12},x_2;y_{11},y_{12},y_2)$, which further\nrefine the Narayana polynomials by considering leaves of plane trees that have\nno siblings. We obtain the generating function for\n$G_n(x_{11},x_{12},x_2;y_{11},y_{12},y_2)$. To achieve further refinement of\nCoker's formula based on the polynomial\n$G_n(x_{11},x_{12},x_2;y_{11},y_{12},y_2)$, we consider a refinement\n$M_n(u_1,u_2,u_3;v_1,v_2)$ of the Motzkin polynomials by classifying the old\nleaves of a tip-augmented plane tree into three categories and the young leaves\ninto two categories. The generating function for $M_n(u_1,u_2,u_3;v_1,v_2)$ is\nalso established, and the refinement of Coker's formula is immediately derived\nby combining the generating function for\n$G_n(x_{11},x_{12},x_2;y_{11},y_{12},y_2)$ and the generating function for\n$M_n(u_1,u_2,u_3;v_1,v_2)$. We derive several interesting consequences from\nthis refinement of Coker's formula. The method used in this paper is the\ngrammatical approach introduced by Chen. We develop a unified grammatical\napproach to exploring polynomials associated with the statistics defined on\nplane trees. As you will see, the derivations of the generating functions for\n$G_n(x_{11},x_{12},x_2;{y}_{11},{{y}}_{12},y_2)$ and $M_n(u_1,u_2,u_3;v_1,v_2)$\nbecome quite simple once their grammars are established.\n","subjects":["Mathematics/Combinatorics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}