{"id":"2408.11390","title":"Ultra-Fast and Efficient Design Method Using Deep Learning for\n  Capacitive Coupling WPT System","authors":"Rasool Keshavarz, Ehsan Majidi, Ali Raza, and Negin Shariati","authorsParsed":[["Keshavarz","Rasool",""],["Majidi","Ehsan",""],["Raza","Ali",""],["Shariati","Negin",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 07:33:32 GMT"}],"updateDate":"2024-08-22","timestamp":1724225612000,"abstract":"  Capacitive coupling wireless power transfer (CCWPT) is one of the pervasive\nmethods to transfer power in the reactive near-field zone. In this paper, a\nflexible design methodology based on Binary Particle Swarm Optimization (BPSO)\nalgorithm is proposed for a pixelated microstrip structure. The pixel\nconfiguration of each parallel plate (43x43 pixels) determines the frequency\nresponse of the system (S-parameters) and by changing this configuration, we\ncan achieve the dedicated operating frequency (resonance frequency) and its\nrelated |S21| value. Due to the large number of pixels, iterative optimization\nalgorithm (BPSO) is the solution for designing a CCWPT system. However, the\noutput of each iteration should be simulated in electromagnetic simulators\n(e.g., CST, HFSS, etc.), hence, the whole optimization process is\ntime-consuming. This paper develops a rapid, agile and efficient method for\ndesigning two parallel pixelated microstrip plates of a CCWPT system based on\ndeep neural networks. In the proposed method, CST-based BPSO algorithm is\nreplaced with an AI-based method using ResNet-18. Advantages of the AI-based\niterative method are automatic design process, more efficient, less\ntime-consuming, less computational resource-consuming and less background EM\nknowledge requirements compared to the conventional techniques. Finally, the\nprototype of the proposed simulated structure is fabricated and measured. The\nsimulation and measurement results validate the design procedure accuracy,\nusing AI-based BPSO algorithm. The MAE (Mean Absolute Error) of prediction for\nthe main resonance frequency and related |S21| are 110 MHz and 0.18 dB,\nrespectively and according to the simulation results, the whole design process\nis 3629 times faster than the CST-based BPSO algorithm.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}