{"id":"2408.03138","title":"Predictive Performance Test based on the Exhaustive Nested\n  Cross-Validation for High-dimensional data","authors":"Iris Ivy Gauran, Hernando Ombao, and Zhaoxia Yu","authorsParsed":[["Gauran","Iris Ivy",""],["Ombao","Hernando",""],["Yu","Zhaoxia",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 12:28:16 GMT"}],"updateDate":"2024-08-07","timestamp":1722947296000,"abstract":"  It is crucial to assess the predictive performance of a model in order to\nestablish its practicality and relevance in real-world scenarios, particularly\nfor high-dimensional data analysis. Among data splitting or resampling methods,\ncross-validation (CV) is extensively used for several tasks such as estimating\nthe prediction error, tuning the regularization parameter, and selecting the\nmost suitable predictive model among competing alternatives. The K-fold\ncross-validation is a popular CV method but its limitation is that the risk\nestimates are highly dependent on the partitioning of the data (for training\nand testing). Here, the issues regarding the reproducibility of the K-fold CV\nestimator is demonstrated in hypothesis testing wherein different partitions\nlead to notably disparate conclusions. This study presents an alternative novel\npredictive performance test and valid confidence intervals based on exhaustive\nnested cross-validation for determining the difference in prediction error\nbetween two model-fitting algorithms. A naive implementation of the exhaustive\nnested cross-validation is computationally costly. Here, we address concerns\nregarding computational complexity by devising a computationally tractable\nclosed-form expression for the proposed cross-validation estimator using ridge\nregularization. Our study also investigates strategies aimed at enhancing\nstatistical power within high-dimensional scenarios while controlling the Type\nI error rate. To illustrate the practical utility of our method, we apply it to\nan RNA sequencing study and demonstrate its effectiveness in the context of\nbiological data analysis.\n","subjects":["Statistics/Methodology","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}