{"id":"2408.13109","title":"Empirical Power of Quantum Encoding Methods for Binary Classification","authors":"Gennaro De Luca, Andrew Vlasic, Michael Vitz, and Anh Pham","authorsParsed":[["De Luca","Gennaro",""],["Vlasic","Andrew",""],["Vitz","Michael",""],["Pham","Anh",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 14:34:57 GMT"}],"updateDate":"2024-08-26","timestamp":1724423697000,"abstract":"  Quantum machine learning is one of the many potential applications of quantum\ncomputing, each of which is hoped to provide some novel computational\nadvantage. However, quantum machine learning applications often fail to\noutperform classical approaches on real-world classical data. The ability of\nthese models to generalize well from few training data points is typically\nconsidered one of the few definitive advantages of this approach. In this work,\nwe will instead focus on encoding schemes and their effects on various machine\nlearning metrics. Specifically, we focus on real-world data encoding to\ndemonstrate differences between quantum encoding strategies for several\nreal-world datasets and the classification model standard, LightGBM. In\nparticular, we apply the following encoding strategies, including three\nstandard approaches and two modified approaches: Angle, Amplitude, IQP,\nEntangled Angle, and Alternative IQP. As these approaches require either a\nsignificant number of qubits or gates to encode larger datasets, we perform\nfeature selection to support the limited computing power of quantum simulators.\nThis feature selection is performed through a quantum annealing enhanced\napproach that builds on a QUBO formulation of the problem. In this work, we\nprovide a preliminary demonstration that quantum machine learning with the IQP\nencoding and LightGBM produce statistically equivalent results for a large\nmajority of the assigned learning tasks.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fD1kQPmemE5LKP8mpQ0EL-j-jiz7sBEoRSCc-CQMMFw","pdfSize":"2310458"}
