{"id":"2408.05825","title":"Gravitational Radiation in Generalized Brans Dicke Theory: Compact\n  Binary Systems","authors":"S. Mahmoudi and S. H. Hendi","authorsParsed":[["Mahmoudi","S.",""],["Hendi","S. H.",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 17:00:01 GMT"}],"updateDate":"2024-08-13","timestamp":1723395601000,"abstract":"  This paper investigates the generation and properties of\n  gravitational radiation within the framework of Generalized\n  Brans-Dicke (GBD) theory, with a specific emphasis on its\n  manifestation in compact binary systems. The primary focus of this study lies\nin the\n  comprehensive exploration of gravitational radiation generated by\n  compact binaries. The energy momentum tensor and the associated\n  gravitational wave (GW) radiation power in GBD theory are\n  investigated, elucidating the relationship between these\n  fundamental concepts. Furthermore, detailed calculations are\n  provided for the GW radiation power originating from both tensor\n  fields and scalar fields. Based on our calculations, both scalar\n  fields contribute to GW radiation by producing dipole radiation.\n  We also study the period derivative of compact binaries in this\n  theory. By comparing with the observational data of the orbital\n  period derivative of the quasicircular white dwarf-neutron star\n  binary PSR J1012+5307, we put bounds on the two parameters of the\n  theory: the Brans-Dicke coupling parameter $\\omega_{0}$ and the\n  mass of geometrical scalar field $m_f$, \\textcolor{black}{resulting\n  in a lower bound $\\omega_{0}>6.09723\\times10^6$ for a massless BD\n  scalar field and the geometrical field whose mass is smaller than\n  $10^{-29} \\text{GeV}$. The obtained bound on $\\omega_0$ is two\n  orders of magnitude stricter than those derived from solar system\n  data.} Finally, we find the phase shift that GWs experience in the\n  frequency domain during their propagation.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}