{"id":"2408.12715","title":"Programmable scanning diffuse speckle contrast imaging of cerebral blood\n  flow","authors":"Faezeh Akbari, Xuhui Liu, Fatemeh Hamedi, Mehrana Mohtasebi, Lei Chen,\n  Guoqiang Yu","authorsParsed":[["Akbari","Faezeh",""],["Liu","Xuhui",""],["Hamedi","Fatemeh",""],["Mohtasebi","Mehrana",""],["Chen","Lei",""],["Yu","Guoqiang",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 20:04:59 GMT"}],"updateDate":"2024-08-26","timestamp":1724357099000,"abstract":"  Significance: Cerebral blood flow (CBF) imaging is crucial for diagnosing\ncerebrovascular diseases. However, existing large neuroimaging techniques with\nhigh cost, low sampling rate, and poor mobility make them unsuitable for\ncontinuous and longitudinal CBF monitoring at the bedside. Aim: This study\naimed to develop a low-cost, portable, programmable scanning diffuse speckle\ncontrast imaging (PS-DSCI) technology for fast, high-density, and\ndepth-sensitive imaging of CBF in rodents. Approach: The PS-DSCI employed a\nprogrammable digital micromirror device (DMD) for remote line-shape laser (785\nnm) scanning on tissue surface and synchronized a 2D camera for capturing\nboundary diffuse laser speckle contrasts. New algorithms were developed to\naddress deformations of line-shape scanning, thus minimizing CBF reconstruction\nartifacts. The PS-DSCI was examined in head-simulating phantoms and adult mice.\nResults: The PS-DSCI enables resolving Intralipid particle flow contrasts at\ndifferent tissue depths. In vivo experiments in adult mice demonstrated the\ncapability of PS-DSCI to image global/regional CBF variations induced by 8% CO2\ninhalation and transient carotid artery ligations. Conclusions: Compared to\nconventional point scanning, the line scanning in PS-DSCI significantly\nincreases spatiotemporal resolution. The high sampling rate of PS-DSCI is\ncrucial for capturing rapid CBF changes while high spatial resolution is\nimportant for visualizing brain vasculature.\n","subjects":["Quantitative Biology/Tissues and Organs"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}