{"id":"2408.06844","title":"Stateful protocol fuzzing with statemap-based reverse state selection","authors":"Liu Yu, Shen Yanlong, Zhou Ying","authorsParsed":[["Yu","Liu",""],["Yanlong","Shen",""],["Ying","Zhou",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 12:11:41 GMT"}],"updateDate":"2024-08-14","timestamp":1723551101000,"abstract":"  Stateful Coverage-Based Greybox Fuzzing (SCGF) is considered the\nstate-of-the-art method for network protocol greybox fuzzing. During the\nprotocol fuzzing process, SCGF constructs the state machine of the target\nprotocol by identifying protocol states. Optimal states are selected for\nfuzzing using heuristic methods, along with corresponding seeds and mutation\nregions, to effectively conduct fuzz testing. Nevertheless, existing SCGF\nmethodologies prioritise the selection of protocol states without considering\nthe correspondence between program basic block coverage information and\nprotocol states. To address this gap, this paper proposes a statemap-based\nreverse state selection method for SCGF. This approach prioritises the coverage\ninformation of fuzzy test seeds, and delves deeper into the correspondence\nbetween the basic block coverage information of the programme and the protocol\nstate, with the objective of improving the bitmap coverage. The state map is\nemployed to simplify the state machine representation method. Furthermore, the\ndesign of different types of states has enabled the optimisation of the method\nof constructing message sequences, the reduction in the length of message\nsequences further improve the efficiency of test case execution. By optimising\nthe SCGF, we developed SMGFuzz and conducted experiments utilising Profuzzbench\nin order to assess the testing efficiency of SMGFuzz.The results indicate that\ncompared to AFLNet, SMGFuzz achieved an average increase of 12.48% in edges\ncoverage, a 50.1% increase in unique crashes and a 40.2% increase in test case\nexecution speed over a period of 24 hours.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}