{"id":"2408.02329","title":"From Generalist to Specialist: Exploring CWE-Specific Vulnerability\n  Detection","authors":"Syafiq Al Atiiq, Christian Gehrmann, Kevin Dahl\\'en, Karim Khalil","authorsParsed":[["Atiiq","Syafiq Al",""],["Gehrmann","Christian",""],["Dahlén","Kevin",""],["Khalil","Karim",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 09:12:39 GMT"}],"updateDate":"2024-08-06","timestamp":1722849159000,"abstract":"  Vulnerability Detection (VD) using machine learning faces a significant\nchallenge: the vast diversity of vulnerability types. Each Common Weakness\nEnumeration (CWE) represents a unique category of vulnerabilities with distinct\ncharacteristics, code semantics, and patterns. Treating all vulnerabilities as\na single label with a binary classification approach may oversimplify the\nproblem, as it fails to capture the nuances and context-specific to each CWE.\nAs a result, a single binary classifier might merely rely on superficial text\npatterns rather than understanding the intricacies of each vulnerability type.\nRecent reports showed that even the state-of-the-art Large Language Model (LLM)\nwith hundreds of billions of parameters struggles to generalize well to detect\nvulnerabilities. Our work investigates a different approach that leverages\nCWE-specific classifiers to address the heterogeneity of vulnerability types.\nWe hypothesize that training separate classifiers for each CWE will enable the\nmodels to capture the unique characteristics and code semantics associated with\neach vulnerability category. To confirm this, we conduct an ablation study by\ntraining individual classifiers for each CWE and evaluating their performance\nindependently. Our results demonstrate that CWE-specific classifiers outperform\na single binary classifier trained on all vulnerabilities. Building upon this,\nwe explore strategies to combine them into a unified vulnerability detection\nsystem using a multiclass approach. Even if the lack of large and high-quality\ndatasets for vulnerability detection is still a major obstacle, our results\nshow that multiclass detection can be a better path toward practical\nvulnerability detection in the future. All our models and code to produce our\nresults are open-sourced.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vh9WnaucgGqApQbHaE5G4YgRW53Snbwm65rqyJuxA24","pdfSize":"869280","txDigest":"7dgDRekiT21QCzyXyFoN4kpx7NdLZyzu2Uh5YhvN3GeV","endEpoch":"1","status":"CERTIFIED"}
