{"id":"2408.03559","title":"Monitoring of Hermit Crabs Using drone-captured imagery and Deep\n  Learning based Super-Resolution Reconstruction and Improved YOLOv8","authors":"Fan Zhao, Yijia Chen, Dianhan Xi, Yongying Liu, Jiaqi Wang, Shigeru\n  Tabeta, Katsunori Mizuno","authorsParsed":[["Zhao","Fan",""],["Chen","Yijia",""],["Xi","Dianhan",""],["Liu","Yongying",""],["Wang","Jiaqi",""],["Tabeta","Shigeru",""],["Mizuno","Katsunori",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 05:47:15 GMT"}],"updateDate":"2024-08-08","timestamp":1723009635000,"abstract":"  Hermit crabs play a crucial role in coastal ecosystems by dispersing seeds,\ncleaning up debris, and disturbing soil. They serve as vital indicators of\nmarine environmental health, responding to climate change and pollution.\nTraditional survey methods, like quadrat sampling, are labor-intensive,\ntime-consuming, and environmentally dependent. This study presents an\ninnovative approach combining UAV-based remote sensing with Super-Resolution\nReconstruction (SRR) and the CRAB-YOLO detection network, a modification of\nYOLOv8s, to monitor hermit crabs. SRR enhances image quality by addressing\nissues such as motion blur and insufficient resolution, significantly improving\ndetection accuracy over conventional low-resolution fuzzy images. The CRAB-YOLO\nnetwork integrates three improvements for detection accuracy, hermit crab\ncharacteristics, and computational efficiency, achieving state-of-the-art\n(SOTA) performance compared to other mainstream detection models. The RDN\nnetworks demonstrated the best image reconstruction performance, and CRAB-YOLO\nachieved a mean average precision (mAP) of 69.5% on the SRR test set, a 40%\nimprovement over the conventional Bicubic method with a magnification factor of\n4. These results indicate that the proposed method is effective in detecting\nhermit crabs, offering a cost-effective and automated solution for extensive\nhermit crab monitoring, thereby aiding coastal benthos conservation.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"WTuqJ1lb8Ot9tE9JTIPnqwUCEP9a56nT6ySZycG-GYE","pdfSize":"8319467"}
