{"id":"2408.00924","title":"Phonon screening of excitons in atomically thin semiconductors","authors":"Woncheol Lee, Antonios M. Alvertis, Zhenglu Li, Steven G. Louie,\n  Marina R. Filip, Jeffrey B. Neaton, Emmanouil Kioupakis","authorsParsed":[["Lee","Woncheol",""],["Alvertis","Antonios M.",""],["Li","Zhenglu",""],["Louie","Steven G.",""],["Filip","Marina R.",""],["Neaton","Jeffrey B.",""],["Kioupakis","Emmanouil",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 21:28:21 GMT"}],"updateDate":"2024-08-05","timestamp":1722547701000,"abstract":"  Atomically thin semiconductors, encompassing both 2D materials and quantum\nwells, exhibit a pronounced enhancement of excitonic effects due to geometric\nconfinement. Consequently, these materials have become foundational platforms\nfor the exploration and utilization of excitons. Recent ab initio studies have\ndemonstrated that phonons can substantially screen electron-hole interactions\nin bulk semiconductors and strongly modify the properties of excitons. While\nexcitonic properties of atomically thin semiconductors have been the subject of\nextensive theoretical investigations, the role of phonon screening on excitons\nin atomically thin structures remains unexplored. In this work, we demonstrate\nvia ab initio GW-Bethe-Salpeter equation calculations that phonon screening can\nhave a significant impact on optical excitations in atomically thin\nsemiconductors. We further show that the degree of phonon screening can be\ntuned by structural engineering. We focus on atomically thin GaN quantum wells\nembedded in AlN and identify specific phonons in the surrounding material, AlN,\nthat dramatically alter the lowest-lying exciton in monolayer GaN via\nscreening. Our studies provide new intuition beyond standard models into the\ninterplay among structural properties, phonon characteristics, and exciton\nproperties in atomically thin semiconductors, and have implications for future\nexperiments.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"okRRZeQjKdydau4JX_l0Ack3G-1PTeYSYE4Ej7Ys9M4","pdfSize":"3740355","txDigest":"CcoTeLYin7uurKRD9QURC79GABK94KJEU2t7ZtC6Ktw4","endEpoch":"1","status":"CERTIFIED"}
