{"id":"2408.16027","title":"Toward Time-Continuous Data Inference in Sparse Urban CrowdSensing","authors":"Ziyu Sun, Haoyang Su, Hanqi Sun, En Wang, Wenbin Liu","authorsParsed":[["Sun","Ziyu",""],["Su","Haoyang",""],["Sun","Hanqi",""],["Wang","En",""],["Liu","Wenbin",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 19:25:41 GMT"}],"updateDate":"2024-08-30","timestamp":1724786741000,"abstract":"  Mobile Crowd Sensing (MCS) is a promising paradigm that leverages mobile\nusers and their smart portable devices to perform various real-world tasks.\nHowever, due to budget constraints and the inaccessibility of certain areas,\nSparse MCS has emerged as a more practical alternative, collecting data from a\nlimited number of target subareas and utilizing inference algorithms to\ncomplete the full sensing map. While existing approaches typically assume a\ntime-discrete setting with data remaining constant within each sensing cycle,\nthis simplification can introduce significant errors, especially when dealing\nwith long cycles, as real-world sensing data often changes continuously. In\nthis paper, we go from fine-grained completion, i.e., the subdivision of\nsensing cycles into minimal time units, towards a more accurate,\ntime-continuous completion. We first introduce Deep Matrix Factorization (DMF)\nas a neural network-enabled framework and enhance it with a Recurrent Neural\nNetwork (RNN-DMF) to capture temporal correlations in these finer time slices.\nTo further deal with the continuous data, we propose TIME-DMF, which captures\ntemporal information across unequal intervals, enabling time-continuous\ncompletion. Additionally, we present the Query-Generate (Q-G) strategy within\nTIME-DMF to model the infinite states of continuous data. Extensive experiments\nacross five types of sensing tasks demonstrate the effectiveness of our models\nand the advantages of time-continuous completion.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}