{"id":"2408.00467","title":"The impact of the phase transition on Quark-Gluon Plasma with an\n  extremely strong magnetic field in holographic QCD","authors":"Xuanmin Cao, Hui Liu","authorsParsed":[["Cao","Xuanmin",""],["Liu","Hui",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 11:10:53 GMT"}],"updateDate":"2024-08-02","timestamp":1722510653000,"abstract":"  We investigate the phase transition within an extremely strong magnetic\nbackground field, employing a holographic Quantum Chromodynamics (QCD) model\nwith a focus on entropy and pressure properties. At relatively modest magnetic\nfield strengths, our study discerns a crossover transition between the normal\nphase and the Quark-Gluon Plasma (QGP) phase as the temperature rises. In\ncontrast, under the influence of an extremely strong magnetic field, a\nfirst-order phase transition is observed. A critical point is identified at $\n(eB_c, T_c) \\approx (2.8623 \\, \\text{GeV}^2, 0.1191 \\, \\text{GeV}) $, which\ncorresponds to a second-order phase transition. This phase structure is found\nto be in qualitative agreement with lattice simulation predictions reported in\n[Phys. Rev. D \\textbf{105}, 034511 (2022)]. Furthermore, we explore the impact\nof the magnetic field on the jet quenching parameter across various phases. At\nzero magnetic field ($ eB = 0$ ), the normalized jet quenching parameter $\n\\hat{q} / T^3 $ exhibits a monotonic increase with temperature. However, in the\npresence of a magnetic background field, the normalized jet quenching\nparameters not only display directional anisotropy but also experience a\nuniversal enhancement, particularly in the vicinity of the critical temperature\nregion. This observation suggests that the jet quenching parameter could\npotentially act as an indicator of phase transitions.\n","subjects":["Physics/High Energy Physics - Theory","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fRd1Xs56UiszbEZJa4r0cE8R0tGLIy4QTbnesGFAk7E","pdfSize":"1229431"}
