{"id":"2408.00907","title":"The Harmonic Exponential Filter for Nonparametric Estimation on Motion\n  Groups","authors":"Miguel Saavedra-Ruiz, Steven A. Parkison, Ria Arora, James Richard\n  Forbes, Liam Paull","authorsParsed":[["Saavedra-Ruiz","Miguel",""],["Parkison","Steven A.",""],["Arora","Ria",""],["Forbes","James Richard",""],["Paull","Liam",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 20:56:28 GMT"}],"updateDate":"2024-08-05","timestamp":1722545788000,"abstract":"  Bayesian estimation is a vital tool in robotics as it allows systems to\nupdate the belief of the robot state using incomplete information from noisy\nsensors. To render the state estimation problem tractable, many systems assume\nthat the motion and measurement noise, as well as the state distribution, are\nall unimodal and Gaussian. However, there are numerous scenarios and systems\nthat do not comply with these assumptions. Existing non-parametric filters that\nare used to model multimodal distributions have drawbacks that limit their\nability to represent a diverse set of distributions. In this paper, we\nintroduce a novel approach to nonparametric Bayesian filtering to cope with\nmultimodal distributions using harmonic exponential distributions. This\napproach leverages two key insights of harmonic exponential distributions: a)\nthe product of two distributions can be expressed as the element-wise addition\nof their log-likelihood Fourier coefficients, and b) the convolution of two\ndistributions can be efficiently computed as the tensor product of their\nFourier coefficients. These observations enable the development of an efficient\nand exact solution to the Bayes filter up to the band limit of a Fourier\ntransform. We demonstrate our filter's superior performance compared with\nestablished nonparametric filtering methods across a range of simulated and\nreal-world localization tasks.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}