{"id":"2408.13111","title":"Time series forecasting of multiphase microstructure evolution using\n  deep learning","authors":"Saurabh Tiwari, Prathamesh Satpute, Supriyo Ghosh","authorsParsed":[["Tiwari","Saurabh",""],["Satpute","Prathamesh",""],["Ghosh","Supriyo",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 06:14:06 GMT"}],"updateDate":"2024-08-26","timestamp":1724307246000,"abstract":"  Microstructure evolution, which plays a critical role in determining\nmaterials properties, is commonly simulated by the high-fidelity but\ncomputationally expensive phase-field method. To address this, we approximate\nmicrostructure evolution as a time series forecasting problem within the domain\nof deep learning. Our approach involves implementing a cost-effective surrogate\nmodel that accurately predicts the spatiotemporal evolution of microstructures,\ntaking an example of spinodal decomposition in binary and ternary mixtures. Our\nsurrogate model combines a convolutional autoencoder to reduce the dimensional\nrepresentation of these microstructures with convolutional recurrent neural\nnetworks to forecast their temporal evolution. We use different variants of\nrecurrent neural networks to compare their efficacy in developing surrogate\nmodels for phase-field predictions. On average, our deep learning framework\ndemonstrates excellent accuracy and speedup relative to phase-field\nsimulations. Moreover, we use quantitative measures to demonstrate how\nsurrogate model predictions can replace phase-field timesteps without\ncompromising accuracy in the long-term evolution trajectory. Finally, by\nemulating a transfer learning approach, our framework performs satisfactorily\nin predicting new microstructures resulting from alloy composition and physics\nunknown to the model. As such, our approach demonstrates a useful data-driven\nalternative or accelerator to microstructure simulation workflow.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"5MLssiPaCbu9HjLDnf8-xc42dJO1onUPAhykWQ3P8bA","pdfSize":"10538591"}
