{"id":"2408.08284","title":"Accurate and efficient structure elucidation from routine\n  one-dimensional NMR spectra using multitask machine learning","authors":"Frank Hu, Michael S. Chen, Grant M. Rotskoff, Matthew W. Kanan, Thomas\n  E. Markland","authorsParsed":[["Hu","Frank",""],["Chen","Michael S.",""],["Rotskoff","Grant M.",""],["Kanan","Matthew W.",""],["Markland","Thomas E.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 17:37:36 GMT"}],"updateDate":"2024-08-16","timestamp":1723743456000,"abstract":"  Rapid determination of molecular structures can greatly accelerate workflows\nacross many chemical disciplines. However, elucidating structure using only\none-dimensional (1D) NMR spectra, the most readily accessible data, remains an\nextremely challenging problem because of the combinatorial explosion of the\nnumber of possible molecules as the number of constituent atoms is increased.\nHere, we introduce a multitask machine learning framework that predicts the\nmolecular structure (formula and connectivity) of an unknown compound solely\nbased on its 1D 1H and/or 13C NMR spectra. First, we show how a transformer\narchitecture can be constructed to efficiently solve the task, traditionally\nperformed by chemists, of assembling large numbers of molecular fragments into\nmolecular structures. Integrating this capability with a convolutional neural\nnetwork (CNN), we build an end-to-end model for predicting structure from\nspectra that is fast and accurate. We demonstrate the effectiveness of this\nframework on molecules with up to 19 heavy (non-hydrogen) atoms, a size for\nwhich there are trillions of possible structures. Without relying on any prior\nchemical knowledge such as the molecular formula, we show that our approach\npredicts the exact molecule 69.6% of the time within the first 15 predictions,\nreducing the search space by up to 11 orders of magnitude.\n","subjects":["Physics/Chemical Physics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eV2WcXu0EICsMCC7wUXmK41Vi_g5ecVjVld7WWZ6tX8","pdfSize":"3582925"}
