{"id":"2408.01580","title":"Controlling Dataflows with a Bolt-on Data Escrow","authors":"Zhiru Zhu, Raul Castro Fernandez","authorsParsed":[["Zhu","Zhiru",""],["Fernandez","Raul Castro",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 21:26:57 GMT"}],"updateDate":"2024-08-06","timestamp":1722634017000,"abstract":"  The data-driven economy has created tremendous value in our society.\nIndividuals share their data with platforms in exchange for services such as\nsearch, social networks, and health recommendations. Platforms use the data to\nprovide those services and create other revenue-generating opportunities, e.g.,\nselling the data to data brokers. With the ever-expanding data economy comes\nthe growing concern about potential data misuse. While most platforms give\nindividuals certain control over their data (i.e., what data is being shared),\nindividuals do not know how the data will be used once shared; they cannot\ncontrol the purpose.\n  In this paper, we introduce a data escrow design that permits individuals to\nobserve all dataflows - not just what is shared but for what purpose. Rather\nthan data flowing to the platform, the platform delegates their computation to\nthe escrow, where individuals can observe and manage their data. To make the\ndata escrow practical, we design and implement a prototype that works alongside\nthe Apple ecosystem; specifically, we retrofit the Apple SDKs with a\nprogramming interface to enable delegated computation. Our solution does not\ndepend on Apple's software and can be applied to other platforms, but building\nfor Apple lets us study the main hypothesis of our work: whether such a data\nescrow solution is a feasible alternative to today's data governance. We show\nthat our escrow prototype implementation is efficient, and we analyze the\ndataflows in real-world apps and show that the escrow's programming interface\nsupports implementing a wide range of dataflows.\n","subjects":["Computing Research Repository/Databases"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}