{"id":"2408.10727","title":"T-matrix representation of optical scattering response: Suggestion for a\n  data format","authors":"Nigar Asadova, Karim Achouri, Kristian Arjas, Baptiste Augui\\'e,\n  Roland Aydin, Alexandre Baron, Dominik Beutel, Bernd Bodermann, Kaoutar\n  Boussaoud, Sven Burger, Minseok Choi, Krzysztof M. Czajkowski, Andrey B.\n  Evlyukhin, Atefeh Fazel-Najafabadi, Ivan Fernandez-Corbaton, Puneet Garg,\n  David Globosits, Ulrich Hohenester, Hongyoon Kim, Seokwoo Kim, Philippe\n  Lalanne, Eric C. Le Ru, J\\\"org Meyer, Jungho Mun, Lorenzo Pattelli, Lukas\n  Pflug, Carsten Rockstuhl, Junsuk Rho, Stefan Rotter, Brian Stout, P\\\"aivi\n  T\\\"orm\\\"a, Jorge Olmos Trigo, Frank Tristram, Nikolaos L. Tsitsas, Renaud\n  Vall\\'ee, Kevin Vynck, Thomas Weiss, Peter Wiecha, Thomas Wriedt, Vassilios\n  Yannopapas, Maxim A. Yurkin, Grigorios P. Zouros","authorsParsed":[["Asadova","Nigar",""],["Achouri","Karim",""],["Arjas","Kristian",""],["Auguié","Baptiste",""],["Aydin","Roland",""],["Baron","Alexandre",""],["Beutel","Dominik",""],["Bodermann","Bernd",""],["Boussaoud","Kaoutar",""],["Burger","Sven",""],["Choi","Minseok",""],["Czajkowski","Krzysztof M.",""],["Evlyukhin","Andrey B.",""],["Fazel-Najafabadi","Atefeh",""],["Fernandez-Corbaton","Ivan",""],["Garg","Puneet",""],["Globosits","David",""],["Hohenester","Ulrich",""],["Kim","Hongyoon",""],["Kim","Seokwoo",""],["Lalanne","Philippe",""],["Ru","Eric C. Le",""],["Meyer","Jörg",""],["Mun","Jungho",""],["Pattelli","Lorenzo",""],["Pflug","Lukas",""],["Rockstuhl","Carsten",""],["Rho","Junsuk",""],["Rotter","Stefan",""],["Stout","Brian",""],["Törmä","Päivi",""],["Trigo","Jorge Olmos",""],["Tristram","Frank",""],["Tsitsas","Nikolaos L.",""],["Vallée","Renaud",""],["Vynck","Kevin",""],["Weiss","Thomas",""],["Wiecha","Peter",""],["Wriedt","Thomas",""],["Yannopapas","Vassilios",""],["Yurkin","Maxim A.",""],["Zouros","Grigorios P.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 10:55:39 GMT"}],"updateDate":"2024-08-21","timestamp":1724151339000,"abstract":"  The transition matrix, frequently abbreviated as T-matrix, contains the\ncomplete information in a linear approximation of how a spatially localized\nobject scatters an incident field. The T-matrix is used to study the scattering\nresponse of an isolated object and describes the optical response of complex\nphotonic materials made from ensembles of individual objects. T-matrices of\ncertain common structures, potentially, have been repeatedly calculated all\nover the world again and again. This is not necessary and constitutes a major\nchallenge for various reasons. First, the resources spent on their computation\nrepresent an unsustainable financial and ecological burden. Second, with the\nonset of machine learning, data is the gold of our era, and it should be freely\navailable to everybody to address novel scientific challenges. Finally, the\npossibility of reproducing simulations could tremendously improve if the\nconsidered T-matrices could be shared. To address these challenges, we found it\nimportant to agree on a common data format for T-matrices and to enable their\ncollection from different sources and distribution. This document aims to\ndevelop the specifications for storing T-matrices and associated metadata. The\nspecifications should allow maximum freedom to accommodate as many use cases as\npossible without introducing any ambiguity in the stored data. The common\nformat will assist in setting up a public database of T-matrices.\n","subjects":["Physics/Optics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"PJiuu-YebLKCXLnyRGtt76kVRHrk53Mr6WwwkCUZS7I","pdfSize":"2169289"}
