{"id":"2408.16979","title":"Cross Fusion RGB-T Tracking with Bi-directional Adapter","authors":"Zhirong Zeng, Xiaotao Liu, Meng Sun, Hongyu Wang, Jing Liu","authorsParsed":[["Zeng","Zhirong",""],["Liu","Xiaotao",""],["Sun","Meng",""],["Wang","Hongyu",""],["Liu","Jing",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 02:45:56 GMT"}],"updateDate":"2024-09-02","timestamp":1724985956000,"abstract":"  Many state-of-the-art RGB-T trackers have achieved remarkable results through\nmodality fusion. However, these trackers often either overlook temporal\ninformation or fail to fully utilize it, resulting in an ineffective balance\nbetween multi-modal and temporal information. To address this issue, we propose\na novel Cross Fusion RGB-T Tracking architecture (CFBT) that ensures the full\nparticipation of multiple modalities in tracking while dynamically fusing\ntemporal information. The effectiveness of CFBT relies on three newly designed\ncross spatio-temporal information fusion modules: Cross Spatio-Temporal\nAugmentation Fusion (CSTAF), Cross Spatio-Temporal Complementarity Fusion\n(CSTCF), and Dual-Stream Spatio-Temporal Adapter (DSTA). CSTAF employs a\ncross-attention mechanism to enhance the feature representation of the template\ncomprehensively. CSTCF utilizes complementary information between different\nbranches to enhance target features and suppress background features. DSTA\nadopts the adapter concept to adaptively fuse complementary information from\nmultiple branches within the transformer layer, using the RGB modality as a\nmedium. These ingenious fusions of multiple perspectives introduce only less\nthan 0.3\\% of the total modal parameters, but they indeed enable an efficient\nbalance between multi-modal and temporal information. Extensive experiments on\nthree popular RGB-T tracking benchmarks demonstrate that our method achieves\nnew state-of-the-art performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}