{"id":"2408.06117","title":"Modelling of measuring systems -- From white box models to cognitive\n  approaches","authors":"Nadine Schiering, Sascha Eichstaedt, Michael Heizmann, Wolfgang Koch,\n  Linda-Sophie Schneider, Stephan Scheele, Klaus-Dieter Sommer","authorsParsed":[["Schiering","Nadine",""],["Eichstaedt","Sascha",""],["Heizmann","Michael",""],["Koch","Wolfgang",""],["Schneider","Linda-Sophie",""],["Scheele","Stephan",""],["Sommer","Klaus-Dieter",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 12:58:20 GMT"}],"updateDate":"2024-08-13","timestamp":1723467500000,"abstract":"  Mathematical models of measuring systems and processes play an essential role\nin metrology and practical measurements. They form the basis for understanding\nand evaluating measurements, their results and their trustworthiness. Classic\nanalytical parametric modelling is based on largely complete knowledge of\nmeasurement technology and the measurement process. But due to digital\ntransformation towards the Internet of Things (IIoT) with an increasing number\nof intensively and flexibly networked measurement systems and consequently ever\nlarger amounts of data to be processed, data-based modelling approaches have\ngained enormous importance. This has led to new approaches in measurement\ntechnology and industry like Digital Twins, Self-X Approaches, Soft Sensor\nTechnology and Data and Information Fusion. In the future, data-based modelling\nwill be increasingly dominated by intelligent, cognitive systems. Evaluating of\nthe accuracy, trustworthiness and the functional uncertainty of the\ncorresponding models is required.\n  This paper provides a concise overview of modelling in metrology from\nclassical white box models to intelligent, cognitive data-driven solutions\nidentifying advantages and limitations. Additionally, the approaches to merge\ntrustworthiness and metrological uncertainty will be discussed.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}