{"id":"2408.00622","title":"Quantum Order by Disorder: A Key to Understanding the Magnetic Phases of\n  BaCo$_2$(AsO$_4$)$_2$","authors":"Sangyun Lee, Shengzhi Zhang, S. M. Thomas, L. Pressley, C. A. Bridges,\n  Eun Sang Choi, Vivien S. Zapf, Stephen M. Winter, Minseong Lee","authorsParsed":[["Lee","Sangyun",""],["Zhang","Shengzhi",""],["Thomas","S. M.",""],["Pressley","L.",""],["Bridges","C. A.",""],["Choi","Eun Sang",""],["Zapf","Vivien S.",""],["Winter","Stephen M.",""],["Lee","Minseong",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 15:06:45 GMT"}],"updateDate":"2024-08-02","timestamp":1722524805000,"abstract":"  BaCo$_2$(AsO$_4$)$_2$ (BCAO), a honeycomb cobaltate, is considered a\npromising candidate for materials displaying the Kitaev quantum spin liquid\nstate. This assumption is based on the distinctive characteristics of Co$^{2+}$\nions (3$d^7$) within an octahedral crystal environment, resulting in\nspin-orbit-coupled $J_{\\rm eff}$~=~1/2 doublet states. However, recent\nexperimental observations and theoretical analyses have raised questions\nregarding this hypothesis. Despite these uncertainties, reports of continuum\nexcitations reminiscent of spinon excitations have prompted further\ninvestigations. In this study, we explore the magnetic phases of BCAO under\nboth in-plane and out-of-plane magnetic fields, employing dc and ac magnetic\nsusceptibilities, capacitance, and torque magnetometry measurement. Our results\naffirm the existence of multiple field-induced magnetic phases, with strong\nanisotropy of the phase boundaries between in-plane and out-of-plane fields. To\nelucidate the nature of these phases, we develop a minimal anisotropic exchange\nmodel. This model, supported by combined first principles calculations and\ntheoretical modeling, quantitatively reproduces our experimental data. In BCAO,\nthe combination of strong bond-independent XXZ anisotropy and geometric\nfrustration leads to significant quantum order by disorder effects that\nstabilize collinear phases under both zero and finite magnetic fields.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}