{"id":"2408.08656","title":"LLMs Are Biased Towards Output Formats! Systematically Evaluating and\n  Mitigating Output Format Bias of LLMs","authors":"Do Xuan Long, Hai Nguyen Ngoc, Tiviatis Sim, Hieu Dao, Shafiq Joty,\n  Kenji Kawaguchi, Nancy F. Chen, Min-Yen Kan","authorsParsed":[["Long","Do Xuan",""],["Ngoc","Hai Nguyen",""],["Sim","Tiviatis",""],["Dao","Hieu",""],["Joty","Shafiq",""],["Kawaguchi","Kenji",""],["Chen","Nancy F.",""],["Kan","Min-Yen",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 10:45:45 GMT"}],"updateDate":"2024-08-19","timestamp":1723805145000,"abstract":"  We present the first systematic evaluation examining format bias in\nperformance of large language models (LLMs). Our approach distinguishes between\ntwo categories of an evaluation metric under format constraints to reliably and\naccurately assess performance: one measures performance when format constraints\nare adhered to, while the other evaluates performance regardless of constraint\nadherence. We then define a metric for measuring the format bias of LLMs and\nestablish effective strategies to reduce it. Subsequently, we present our\nempirical format bias evaluation spanning four commonly used categories --\nmultiple-choice question-answer, wrapping, list, and mapping -- covering 15\nwidely-used formats. Our evaluation on eight generation tasks uncovers\nsignificant format bias across state-of-the-art LLMs. We further discover that\nimproving the format-instruction following capabilities of LLMs across formats\npotentially reduces format bias. Based on our evaluation findings, we study\nprompting and fine-tuning with synthesized format data techniques to mitigate\nformat bias. Our methods successfully reduce the variance in ChatGPT's\nperformance among wrapping formats from 235.33 to 0.71 (%$^2$).\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7sm9GYru0BGS4FYgV0MR8I4PutaIWbBbN5DcKs4Xx2Y","pdfSize":"5248868"}
