{"id":"2408.09730","title":"Fragment and Geometry Aware Tokenization of Molecules for\n  Structure-Based Drug Design Using Language Models","authors":"Cong Fu, Xiner Li, Blake Olson, Heng Ji, Shuiwang Ji","authorsParsed":[["Fu","Cong",""],["Li","Xiner",""],["Olson","Blake",""],["Ji","Heng",""],["Ji","Shuiwang",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 06:33:43 GMT"}],"updateDate":"2024-08-20","timestamp":1724049223000,"abstract":"  Structure-based drug design (SBDD) is crucial for developing specific and\neffective therapeutics against protein targets but remains challenging due to\ncomplex protein-ligand interactions and vast chemical space. Although language\nmodels (LMs) have excelled in natural language processing, their application in\nSBDD is underexplored. To bridge this gap, we introduce a method, known as\nFrag2Seq, to apply LMs to SBDD by generating molecules in a fragment-based\nmanner in which fragments correspond to functional modules. We transform 3D\nmolecules into fragment-informed sequences using SE(3)-equivariant molecule and\nfragment local frames, extracting SE(3)-invariant sequences that preserve\ngeometric information of 3D fragments. Furthermore, we incorporate protein\npocket embeddings obtained from a pre-trained inverse folding model into the\nLMs via cross-attention to capture protein-ligand interaction, enabling\neffective target-aware molecule generation. Benefiting from employing LMs with\nfragment-based generation and effective protein context encoding, our model\nachieves the best performance on binding vina score and chemical properties\nsuch as QED and Lipinski, which shows our model's efficacy in generating\ndrug-like ligands with higher binding affinity against target proteins.\nMoreover, our method also exhibits higher sampling efficiency compared to\natom-based autoregressive and diffusion baselines with at most ~300x speedup.\n","subjects":["Quantitative Biology/Biomolecules"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}