{"id":"2408.02167","title":"Embedding generalization within the learning dynamics: An approach\n  based-on sample path large deviation theory","authors":"Getachew K. Befekadu","authorsParsed":[["Befekadu","Getachew K.",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 23:31:35 GMT"}],"updateDate":"2024-08-06","timestamp":1722814295000,"abstract":"  We consider a typical learning problem of point estimations for modeling of\nnonlinear functions or dynamical systems in which generalization, i.e.,\nverifying a given learned model, can be embedded as an integral part of the\nlearning process or dynamics. In particular, we consider an empirical risk\nminimization based learning problem that exploits gradient methods from\ncontinuous-time perspective with small random perturbations, which is guided by\nthe training dataset loss. Here, we provide an asymptotic probability estimate\nin the small noise limit based-on the Freidlin-Wentzell theory of large\ndeviations, when the sample path of the random process corresponding to the\nrandomly perturbed gradient dynamical system hits a certain target set, i.e., a\nrare event, when the latter is specified by the testing dataset loss landscape.\nInterestingly, the proposed framework can be viewed as one way of improving\ngeneralization and robustness in learning problems that provides new insights\nleading to optimal point estimates which is guided by training data loss,\nwhile, at the same time, the learning dynamics has an access to the testing\ndataset loss landscape in some form of future achievable or anticipated target\ngoal. Moreover, as a by-product, we establish a connection with optimal control\nproblem, where the target set, i.e., the rare event, is considered as the\ndesired outcome or achievable target goal for a certain optimal control\nproblem, for which we also provide a verification result reinforcing the\nrationale behind the proposed framework. Finally, we present a computational\nalgorithm that solves the corresponding variational problem leading to an\noptimal point estimates and, as part of this work, we also present some\nnumerical results for a typical case of nonlinear regression problem.\n","subjects":["Mathematics/Optimization and Control","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"d5QP7wcE27fvKmcAQnYybLKbsh9S1FYlIynHMOaXyYA","pdfSize":"2946413"}
