{"id":"2408.03839","title":"Exploring the Impacts of Air Quality on Travel Behavior and Activity\n  Participation: Evidence from Travel Diary Surveys in Northern Utah","authors":"Fariba Soltani Mandolakani and Mahyar Vahedi Saheli and Patrick A.\n  Singleton","authorsParsed":[["Mandolakani","Fariba Soltani",""],["Saheli","Mahyar Vahedi",""],["Singleton","Patrick A.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 15:25:25 GMT"}],"updateDate":"2024-08-08","timestamp":1723044325000,"abstract":"  In this study, we explored whether and how area-wide air pollution affected\nindividuals' activity participation and travel behaviors, and how these effects\ndiffered by neighborhood context. Using multi-day travel survey data provided\nby 403 adults from 230 households in a small urban area in northern Utah, US,\nwe analyzed a series of 20 activity and travel outcomes. We investigated the\nassociations of three different metrics of (measured and perceived) air quality\nwith these outcomes, separately for residents of urban and suburban/rural\nneighborhoods, and controlled for personal and household characteristics. Our\nmodels found some measurable changes in activity and travel patterns on days\nwith poor air quality. In urban areas, people engaged in more mandatory\n(work/school) activities, whereas there was no discernible change in\nsuburban/rural areas. The total travel time for urban residents increased,\ndriven by increases in trip-making and travel time by public modes (bus) and\nincreases in travel time by private modes (car). On the other hand,\nsuburban/rural residents traveled shorter total distances (mostly through lower\nvehicle miles traveled), and there was a notable uptick in the probability of\nbeing an active mode user (walk/bike). Air quality perceptions also seemed to\nplay a role, at least for urban residents who walked/biked longer distances,\nrode the bus for longer distances/times, and drove fewer miles on days with\nworse perceived air pollution. Overall, the results are somewhat encouraging,\nfinding more evidence of altruistic than risk-averse travel behavioral\nresponses to episodes of area-wide air pollution; although, more research is\nneeded.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}