{"id":"2408.05239","title":"The Literature Review Network: An Explainable Artificial Intelligence\n  for Systematic Literature Reviews, Meta-analyses, and Method Development","authors":"Joshua Morriss, Tod Brindle, Jessica Bah R\\\"osman, Daniel Reibsamen,\n  Andreas Enz","authorsParsed":[["Morriss","Joshua",""],["Brindle","Tod",""],["Rösman","Jessica Bah",""],["Reibsamen","Daniel",""],["Enz","Andreas",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 17:25:16 GMT"}],"updateDate":"2024-08-13","timestamp":1722878716000,"abstract":"  Systematic literature reviews are the highest quality of evidence in\nresearch. However, the review process is hindered by significant resource and\ndata constraints. The Literature Review Network (LRN) is the first of its kind\nexplainable AI platform adhering to PRISMA 2020 standards, designed to automate\nthe entire literature review process. LRN was evaluated in the domain of\nsurgical glove practices using 3 search strings developed by experts to query\nPubMed. A non-expert trained all LRN models. Performance was benchmarked\nagainst an expert manual review. Explainability and performance metrics\nassessed LRN's ability to replicate the experts' review. Concordance was\nmeasured with the Jaccard index and confusion matrices. Researchers were\nblinded to the other's results until study completion. Overlapping studies were\nintegrated into an LRN-generated systematic review. LRN models demonstrated\nsuperior classification accuracy without expert training, achieving 84.78% and\n85.71% accuracy. The highest performance model achieved high interrater\nreliability (k = 0.4953) and explainability metrics, linking 'reduce',\n'accident', and 'sharp' with 'double-gloving'. Another LRN model covered 91.51%\nof the relevant literature despite diverging from the non-expert's judgments (k\n= 0.2174), with the terms 'latex', 'double' (gloves), and 'indication'. LRN\noutperformed the manual review (19,920 minutes over 11 months), reducing the\nentire process to 288.6 minutes over 5 days. This study demonstrates that\nexplainable AI does not require expert training to successfully conduct\nPRISMA-compliant systematic literature reviews like an expert. LRN summarized\nthe results of surgical glove studies and identified themes that were nearly\nidentical to the clinical researchers' findings. Explainable AI can accurately\nexpedite our understanding of clinical practices, potentially revolutionizing\nhealthcare research.\n","subjects":["Computing Research Repository/Digital Libraries","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}