{"id":"2408.12938","title":"Unveiling the chemical fingerprint of phosphorus-rich stars II.\n  Heavy-element abundances from UVES/VLT spectra","authors":"Maren Brauner, Marco Pignatari, Thomas Masseron, D. A.\n  Garc\\'ia-Hern\\'andez, Maria Lugaro","authorsParsed":[["Brauner","Maren",""],["Pignatari","Marco",""],["Masseron","Thomas",""],["García-Hernández","D. A.",""],["Lugaro","Maria",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 09:39:35 GMT"}],"updateDate":"2024-08-26","timestamp":1724405975000,"abstract":"  The atmospheres of phosphorus-rich stars have been shown to contain between\n10 and 100 times more P than our Sun. Given its crucial role as an essential\nelement for life, it is especially necessary to uncover the origin of P-rich\nstars to gain insights into the still unknown nucleosynthetic formation\npathways of P in our Galaxy. Our objective is to obtain the extensive chemical\nabundance inventory of four P-rich stars, covering a large range of heavy\nelements. This characterization will serve as a milestone for the nuclear\nastrophysics community to uncover the processes that form the unique chemical\nfingerprint of P-rich stars. We performed a detailed 1D local thermodynamic\nequilibrium abundance analysis on the optical UVES spectra of four P-rich\nstars. Our focus lay on the neutron-capture elements, in particular, on the\nelements between Sr and Ba, as well as on Pb, as they provide valuable\nconstraints to nucleosynthesis calculations. We compare the obtained abundances\nwith three different nucleosynthetic scenarios: a single i-process, a double\ni-process, and a combination of s- and i-processes. We have performed the most\nextensive abundance analysis of P-rich stars to date, including the elements\nbetween Sr and Ba, such as Ag, which are rarely measured in any type of stars.\nWe found overabundances with respect to solar in the s-process peak elements,\naccompanied by an extremely high Ba abundance and slight enhancements in some\nelements between Rb and Sn. No global solution explaining all four stars could\nbe found for the nucleosynthetic origin of the pattern. The model that produces\nthe least number of discrepancies in three of the four stars is a combination\nof s- and i-processes, but the current lack of extensive multidimensional\nhydrodynamic simulations to follow the occurrence of the i-process in different\ntypes of stars makes this scenario highly uncertain.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WTwpdWZnB7c96G5_nbgQBtLdfKlW7nk8mJevO-aabyI","pdfSize":"1529526"}
