{"id":"2408.06037","title":"Hyperion: Unveiling DApp Inconsistencies using LLM and Dataflow-Guided\n  Symbolic Execution","authors":"Shuo Yang, Xingwei Lin, Jiachi Chen, Qingyuan Zhong, Lei Xiao, Renke\n  Huang, Yanlin Wang, Zibin Zheng","authorsParsed":[["Yang","Shuo",""],["Lin","Xingwei",""],["Chen","Jiachi",""],["Zhong","Qingyuan",""],["Xiao","Lei",""],["Huang","Renke",""],["Wang","Yanlin",""],["Zheng","Zibin",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 09:59:47 GMT"}],"updateDate":"2024-08-13","timestamp":1723456787000,"abstract":"  The rapid advancement of blockchain platforms has significantly accelerated\nthe growth of decentralized applications (DApps). Similar to traditional\napplications, DApps integrate front-end descriptions that showcase their\nfeatures to attract users, and back-end smart contracts for executing their\nbusiness logic. However, inconsistencies between the features promoted in\nfront-end descriptions and those actually implemented in the contract can\nconfuse users and undermine DApps's trustworthiness. In this paper, we first\nconducted an empirical study to identify seven types of inconsistencies, each\nexemplified by a real-world DApp. Furthermore, we introduce HYPERION, an\napproach designed to automatically identify inconsistencies between front-end\ndescriptions and back-end code implementation in DApps. This method leverages a\nfine-tuned large language model LLaMA2 to analyze DApp descriptions and employs\ndataflow-guided symbolic execution for contract bytecode analysis. Finally,\nHYPERION reports the inconsistency based on predefined detection patterns. The\nexperiment on our ground truth dataset consisting of 54 DApps shows that\nHYPERION reaches 84.06% overall recall and 92.06% overall precision in\nreporting DApp inconsistencies. We also implement HYPERION to analyze 835\nreal-world DApps. The experimental results show that HYPERION discovers 459\nreal-world DApps containing at least one inconsistency.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}