{"id":"2408.12067","title":"Distributed Noncoherent Joint Transmission Based on Multi-Agent\n  Reinforcement Learning for Dense Small Cell MISO Systems","authors":"Shaozhuang Bai, Zhenzhen Gao and Xuewen Liao","authorsParsed":[["Bai","Shaozhuang",""],["Gao","Zhenzhen",""],["Liao","Xuewen",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 02:11:14 GMT"},{"version":"v2","created":"Wed, 11 Sep 2024 04:06:45 GMT"}],"updateDate":"2024-09-12","timestamp":1724292674000,"abstract":"  We consider a dense small cell (DSC) network where multi-antenna small cell\nbase stations (SBSs) transmit data to single-antenna users over a shared\nfrequency band. To enhance capacity, a state-of-the-art technique known as\nnoncoherent joint transmission (JT) is applied, enabling users to receive data\nfrom multiple coordinated SBSs. However, the sum rate maximization problem with\nnoncoherent JT is inherently nonconvex and NP-hard. While existing\noptimization-based noncoherent JT algorithms can provide near-optimal\nperformance, they require global channel state information (CSI) and multiple\niterations, which makes them difficult to be implemeted in DSC networks.To\novercome these challenges, we first prove that the optimal beamforming\nstructure is the same for both the power minimization problem and the sum rate\nmaximization problem, and then mathematically derive the optimal beamforming\nstructure for both problems by solving the power minimization problem.The\noptimal beamforming structure can effectively reduces the variable\ndimensions.By exploiting the optimal beamforming structure, we propose a deep\ndeterministic policy gradient-based distributed noncoherent JT scheme to\nmaximize the system sum rate.In the proposed scheme, each SBS utilizes global\ninformation for training and uses local CSI to determine beamforming vectors.\nSimulation results demonstrate that the proposed scheme achieves comparable\nperformance with considerably lower computational complexity and information\noverhead compared to centralized iterative optimization-based techniques,\nmaking it more attractive for practical deployment.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}