{"id":"2408.11477","title":"How to use the dispersion in the $\\chi^{(3)}$ tensor for broadband\n  generation of polarization-entangled photons","authors":"Valeria Vento, Francesco Ciccarello, Sakthi Pryia Amirtharaj and\n  Christophe Galland","authorsParsed":[["Vento","Valeria",""],["Ciccarello","Francesco",""],["Amirtharaj","Sakthi Pryia",""],["Galland","Christophe",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 09:43:23 GMT"}],"updateDate":"2024-08-22","timestamp":1724233403000,"abstract":"  Polarization-entangled photon pairs are a widely used resource in quantum\noptics and technologies, and are often produced using a nonlinear process. Most\nsources based on spontaneous parametric downconversion have relatively narrow\noptical bandwidth because the pump, signal and idler frequencies must satisfy a\nphase-matching condition. Extending the bandwidth, for example to achieve\nspectral multiplexing, requires changing some experimental parameters such as\ntemperature, crystal angle, poling period, etc. Here, we demonstrate broadband\n(tens of THz for each photon) generation of polarization-entangled photon pairs\nby spontaneous four-wave mixing in a diamond crystal, with a simple colinear\ngeometry requiring no further optical engineering. Our approach leverages the\nquantum interference between electronic and vibrational contributions to the\n$\\chi^{(3)}$ tensor. Entanglement is characterized in a single realization of a\nBell test over the entire bandwidth using fiber dispersion spectroscopy and\nfast single-photon detectors. The results agree with the biphoton wavefunction\npredicted from the knowledge of the $\\chi^{(3)}$ and Raman tensors and\ndemonstrate the general applicability of our approach to other crystalline\nmaterials.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Materials Science","Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"EFVkw4EULNH6j8YiCAZvmJMkMrUpYZb5zdtt7oDj_wc","pdfSize":"8981997"}
