{"id":"2408.15820","title":"Possibilities for enhanced electron-phonon interactions and high-$T_c$\n  superconductivity in engineered bimetallic nano-structured superlattices","authors":"Shinjan Mandal, Shrihari Soundararajan, Manish Jain and H. R.\n  Krishnamurthy","authorsParsed":[["Mandal","Shinjan",""],["Soundararajan","Shrihari",""],["Jain","Manish",""],["Krishnamurthy","H. R.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 14:34:20 GMT"}],"updateDate":"2024-08-29","timestamp":1724855660000,"abstract":"  We explore theoretically the properties of engineered bimetallic\nnano-structured superlattices where an array of nano-clusters of a simple\n(single band) metal are embedded periodically inside another simple metal with\na different work function. The exploration is done using a simplified\ntight-binding model with Coulomb interactions included, as well as density\nfunctional theory. Taking arrays of \"Ag\" clusters of fixed sizes and\nconfigurations (when unrelaxed) embedded periodically in an \"Au\" matrix as an\nexample, we show that a significant enhancement of electron-phonon interactions\nensues, implying possibilities for high-$T_c$ superconductivity. The\nenhancement stems from a strong coupling, via Coulomb interactions, between the\ndipolar charge distribution that forms at the Au-Ag interfaces and the\nbreathing and other modes of vibration of the light Ag atoms caged inside the\nheavier Au matrix. The interface dipoles form because of the interplay between\nthe mismatch of the local potential seen by the conduction electrons localised\nin Wannier orbitals at the Ag and Au sites (the Ag sites being slightly\nrepulsive relative to the Au sites) and the (long-range) Coulomb repulsion\nbetween electrons occupying these Wannier orbitals. We also discuss the DC\ntransport in such systems.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}