{"id":"2408.13731","title":"Verification of Fast Ion Effects on Turbulence through Comparison of\n  GENE and CGYRO with L-mode Plasmas in KSTAR","authors":"Donguk Kim, Taeuk Moon, Choongki Sung, Eisung Yoon, Sumin Yi, Jisung\n  Kang, Jae-Min Kwon, Tobias G\\\"orler, Emily Belli, and Jeff Candy","authorsParsed":[["Kim","Donguk",""],["Moon","Taeuk",""],["Sung","Choongki",""],["Yoon","Eisung",""],["Yi","Sumin",""],["Kang","Jisung",""],["Kwon","Jae-Min",""],["Görler","Tobias",""],["Belli","Emily",""],["Candy","Jeff",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 05:58:27 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 16:54:54 GMT"}],"updateDate":"2024-09-02","timestamp":1724565507000,"abstract":"  This study presents a cross-verification of fast ion effects on turbulence\nthrough a systematic comparison of two leading gyrokinetic codes, GENE\n[T.Gorler et al., J. Comput. Phys. 230 7053-7071 (2011)] and CGYRO [J.Candy et\nal, J. Comput. Phys. 324 73-93 (2016)], using L-mode plasma profiles from KSTAR\nfor local linear and nonlinear electromagnetic simulations. The focus is on the\nimpact of fast ions and rotation effects on energy flux, aiming to identify the\nsimilarities and differences between these codes in the context of turbulence\ntransport research. The analysis shows consistency in linear stability results,\nfractional changes in energy flux, and zonal shearing between the codes.\nHowever, discrepancies arise in absolute thermal energy levels, phase angle\ndistribution, and rotation effects on energy transport, especially in the\npresence of fast ions. The study underscores the critical importance of phase\nangle analysis in gyrokinetic code verification, particularly when assessing\nfast ion effects on turbulence. Additionally, it highlights the need to examine\nquantities at lower levels of the primacy hierarchy, as discrepancies at higher\nlevels can lead to divergent results at lower levels. These findings indicate\nthe necessity for further investigation into these discrepancies and the novel\nphase angle structures observed, contributing to the advancement of accurate\ntransport predictions in fusion plasmas.\n","subjects":["Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}