{"id":"2408.02006","title":"LLaSA: Large Language and E-Commerce Shopping Assistant","authors":"Shuo Zhang, Boci Peng, Xinping Zhao, Boren Hu, Yun Zhu, Yanjia Zeng,\n  Xuming Hu","authorsParsed":[["Zhang","Shuo",""],["Peng","Boci",""],["Zhao","Xinping",""],["Hu","Boren",""],["Zhu","Yun",""],["Zeng","Yanjia",""],["Hu","Xuming",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 12:10:51 GMT"}],"updateDate":"2024-08-06","timestamp":1722773451000,"abstract":"  The e-commerce platform has evolved rapidly due to its widespread popularity\nand convenience. Developing an e-commerce shopping assistant for customers is\ncrucial to aiding them in quickly finding desired products and recommending\nprecisely what they need. However, most previous shopping assistants face two\nmain problems: (1) task-specificity, which necessitates the development of\ndifferent models for various tasks, thereby increasing development costs and\nlimiting effectiveness; and (2) poor generalization, where the trained model\nperforms inadequately on up-to-date products. To resolve these issues, we\nemploy Large Language Models (LLMs) to construct an omnipotent assistant,\nleveraging their adeptness at handling multiple tasks and their superior\ngeneralization capability. Nonetheless, LLMs lack inherent knowledge of\ne-commerce concepts. To address this, we create an instruction dataset\ncomprising 65,000 samples and diverse tasks, termed as EshopInstruct. Through\ninstruction tuning on our dataset, the assistant, named LLaSA, demonstrates the\npotential to function as an omnipotent assistant. Additionally, we propose\nvarious inference optimization strategies to enhance performance with limited\ninference resources. In the Amazon KDD Cup 2024 Challenge, our proposed method,\nLLaSA, achieved an overall ranking of 3rd place on ShopBench, including 57\ntasks and approximately 20,000 questions, and we secured top-5 rankings in each\ntrack, especially in track4, where we achieved the best performance result\namong all student teams. Our extensive practices fully demonstrate that LLMs\npossess the great potential to be competent e-commerce shopping assistants.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}