{"id":"2408.06030","title":"Developing Smart MAVs for Autonomous Inspection in GPS-denied\n  Constructions","authors":"Paoqiang Pan, Kewei Hu, Xiao Huang, Wei Ying, Xiaoxuan Xie, Yue Ma,\n  Naizhong Zhang, and Hanwen Kang","authorsParsed":[["Pan","Paoqiang",""],["Hu","Kewei",""],["Huang","Xiao",""],["Ying","Wei",""],["Xie","Xiaoxuan",""],["Ma","Yue",""],["Zhang","Naizhong",""],["Kang","Hanwen",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 09:47:20 GMT"}],"updateDate":"2024-08-13","timestamp":1723456040000,"abstract":"  Smart Micro Aerial Vehicles (MAVs) have transformed infrastructure inspection\nby enabling efficient, high-resolution monitoring at various stages of\nconstruction, including hard-to-reach areas. Traditional manual operation of\ndrones in GPS-denied environments, such as industrial facilities and\ninfrastructure, is labour-intensive, tedious and prone to error. This study\npresents an innovative framework for smart MAV inspections in such complex and\nGPS-denied indoor environments. The framework features a hierarchical\nperception and planning system that identifies regions of interest and\noptimises task paths. It also presents an advanced MAV system with enhanced\nlocalisation and motion planning capabilities, integrated with Neural\nReconstruction technology for comprehensive 3D reconstruction of building\nstructures. The effectiveness of the framework was empirically validated in a\n4,000 square meters indoor infrastructure facility with an interior length of\n80 metres, a width of 50 metres and a height of 7 metres. The main structure\nconsists of columns and walls. Experimental results show that our MAV system\nperforms exceptionally well in autonomous inspection tasks, achieving a 100\\%\nsuccess rate in generating and executing scan paths. Extensive experiments\nvalidate the manoeuvrability of our developed MAV, achieving a 100\\% success\nrate in motion planning with a tracking error of less than 0.1 metres. In\naddition, the enhanced reconstruction method using 3D Gaussian Splatting\ntechnology enables the generation of high-fidelity rendering models from the\nacquired data. Overall, our novel method represents a significant advancement\nin the use of robotics for infrastructure inspection.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"volNSxjUCks1JdvrlolBYiq8wKpeD06acWYvrX_H9u0","pdfSize":"15016242"}
