{"id":"2408.08627","title":"A Tight ($3/2 + \\varepsilon$)-Approximation Algorithm for Demand Strip\n  Packing","authors":"Franziska Eberle and Felix Hommelsheim and Malin Rau and Stefan Walzer","authorsParsed":[["Eberle","Franziska",""],["Hommelsheim","Felix",""],["Rau","Malin",""],["Walzer","Stefan",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 09:41:58 GMT"}],"updateDate":"2024-08-19","timestamp":1723801318000,"abstract":"  We consider the Demand Strip Packing problem (DSP), in which we are given a\nset of jobs, each specified by a processing time and a demand. The task is to\nschedule all jobs such that they are finished before some deadline $D$ while\nminimizing the peak demand, i.e., the maximum total demand of tasks executed at\nany point in time. DSP is closely related to the Strip Packing problem (SP), in\nwhich we are given a set of axis-aligned rectangles that must be packed into a\nstrip of fixed width while minimizing the maximum height. DSP and SP are known\nto be NP-hard to approximate to within a factor below $\\frac{3}{2}$.\n  To achieve the essentially best possible approximation guarantee, we prove a\nstructural result. Any instance admits a solution with peak demand at most\n$\\big(\\frac32+\\varepsilon\\big)OPT$ satisfying one of two properties. Either (i)\nthe solution leaves a gap for a job with demand $OPT$ and processing time\n$\\mathcal O(\\varepsilon D)$ or (ii) all jobs with demand greater than\n$\\frac{OPT}2$ appear sorted by demand in immediate succession. We then provide\ntwo efficient algorithms that find a solution with maximum demand at most\n$\\big(\\frac32+\\varepsilon\\big)OPT$ in the respective case. A central\nobservation, which sets our approach apart from previous ones for DSP, is that\nthe properties (i) and (ii) need not be efficiently decidable: We can simply\nrun both algorithms and use whichever solution is the better one.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"48nNdNO1lhhfHCO6HDmJ_b37C6sYYQKzKtj3iONnNPo","pdfSize":"1114716"}
