{"id":"2408.16826","title":"QSO MUSEUM II: Search for extended Ly$\\alpha$ emission around 8 $z \\sim\n  3$ quasar pairs","authors":"Eileen Herwig, Fabrizio Arrigoni Battaia, Jay Gonz\\'alez Lobos,\n  Emanuele P. Farina, Allison W. S. Man, Eduardo Ba\\~nados, Guinevere\n  Kauffmann, Zheng Cai, Aura Obreja, J. Xavier Prochaska","authorsParsed":[["Herwig","Eileen",""],["Battaia","Fabrizio Arrigoni",""],["Lobos","Jay González",""],["Farina","Emanuele P.",""],["Man","Allison W. S.",""],["Bañados","Eduardo",""],["Kauffmann","Guinevere",""],["Cai","Zheng",""],["Obreja","Aura",""],["Prochaska","J. Xavier",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:00:03 GMT"}],"updateDate":"2024-09-02","timestamp":1724954403000,"abstract":"  Extended Ly$\\alpha$ emission is routinely found around single quasars (QSO)\nacross cosmic time. However, few studies have investigated how such emission\nchanges in fields with physically associated QSO pairs, which should reside in\ndense environments and are predicted to be linked through intergalactic\nfilaments. We present VLT/MUSE snapshot observations (45 min./source) to unveil\nextended Ly$\\alpha$ emission on scales of the circumgalactic medium (CGM)\naround the largest sample of physically associated QSO pairs to date,\nencompassing 8 pairs (14 observed QSOs) at $z$~3 with $i$-band magnitude\nbetween 18 and 22.75. The pairs are either at close (~50-100 kpc, 5 pairs) or\nwide (~450-500 kpc, 3 pairs) separation with velocity differences of $\\Delta$v\n< 2000 km s$^{-1}$. We detect extended emission around 12 of the 14 targeted\nQSOs and investigate the luminosity, size, kinematics and morphology of these\nLy$\\alpha$ nebulae. On average, they span 90 kpc and are 2.8 $\\times 10^{43}$\nerg s$^{-1}$ bright. Irrespective of the QSOs' projected distance, the nebulae\noften (~45 %) extend toward the other QSO in the pair, leading to asymmetric\nemission whose flux-weighted centroid is at an offset position from any QSO\nlocation. We show that large nebulae are preferentially aligned with the\nlarge-scale structure as traced by the two QSOs, and conclude that the cool gas\n(10$^4$ K) in the CGM traces well the direction of cosmic web filaments.\nAdditionally, the radial profile of the Ly$\\alpha$ surface brightness around\nQSO pairs can be described by a power law with a shallower slope (~$-1.6$) with\nrespect to single QSOs (~$-2$), indicative of increased CGM densities out to\nlarge radii and/or enhanced contribution from the intergalactic medium (IGM).\nThe sample presented in this study contains excellent targets for ultra-deep\nobservations to directly study filamentary IGM structures in emission.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0dxK-1gpy5ayw13Vw_LuU1kk-ekzkqB4JlEmTh8tOFk","pdfSize":"1809460"}
