{"id":"2408.09005","title":"Comparative Performance Analysis of Transformer-Based Pre-Trained Models\n  for Detecting Keratoconus Disease","authors":"Nayeem Ahmed, Md Maruf Rahman, Md Fatin Ishrak, Md Imran Kabir Joy, Md\n  Sanowar Hossain Sabuj, Md. Sadekur Rahman","authorsParsed":[["Ahmed","Nayeem",""],["Rahman","Md Maruf",""],["Ishrak","Md Fatin",""],["Joy","Md Imran Kabir",""],["Sabuj","Md Sanowar Hossain",""],["Rahman","Md. Sadekur",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 20:15:24 GMT"}],"updateDate":"2024-08-20","timestamp":1723839324000,"abstract":"  This study compares eight pre-trained CNNs for diagnosing keratoconus, a\ndegenerative eye disease. A carefully selected dataset of keratoconus, normal,\nand suspicious cases was used. The models tested include DenseNet121,\nEfficientNetB0, InceptionResNetV2, InceptionV3, MobileNetV2, ResNet50, VGG16,\nand VGG19. To maximize model training, bad sample removal, resizing, rescaling,\nand augmentation were used. The models were trained with similar parameters,\nactivation function, classification function, and optimizer to compare\nperformance. To determine class separation effectiveness, each model was\nevaluated on accuracy, precision, recall, and F1-score. MobileNetV2 was the\nbest accurate model in identifying keratoconus and normal cases with few\nmisclassifications. InceptionV3 and DenseNet121 both performed well in\nkeratoconus detection, but they had trouble with questionable cases. In\ncontrast, EfficientNetB0, ResNet50, and VGG19 had more difficulty\ndistinguishing dubious cases from regular ones, indicating the need for model\nrefining and development. A detailed comparison of state-of-the-art CNN\narchitectures for automated keratoconus identification reveals each model's\nbenefits and weaknesses. This study shows that advanced deep learning models\ncan enhance keratoconus diagnosis and treatment planning. Future research\nshould explore hybrid models and integrate clinical parameters to improve\ndiagnostic accuracy and robustness in real-world clinical applications, paving\nthe way for more effective AI-driven ophthalmology tools.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}