{"id":"2408.04886","title":"Automated PMC-based Power Modeling Methodology for Modern Mobile GPUs","authors":"Pranab Dash (Purdue University), Y. Charlie Hu (Purdue University),\n  Abhilash Jindal (IIT Delhi)","authorsParsed":[["Dash","Pranab","","Purdue University"],["Hu","Y. Charlie","","Purdue University"],["Jindal","Abhilash","","IIT Delhi"]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 06:20:34 GMT"}],"updateDate":"2024-08-12","timestamp":1723184434000,"abstract":"  The rise of machine learning workload on smartphones has propelled GPUs into\none of the most power-hungry components of modern smartphones and elevates the\nneed for optimizing the GPU power draw by mobile apps. Optimizing the power\nconsumption of mobile GPUs in turn requires accurate estimation of their power\ndraw during app execution. In this paper, we observe that the prior-art,\nutilization-frequency based GPU models cannot capture the diverse\nmicro-architectural usage of modern mobile GPUs.We show that these models\nsuffer poor modeling accuracy under diverse GPU workload, and study whether\nperformance monitoring counter (PMC)-based models recently proposed for\ndesktop/server GPUs can be applied to accurately model mobile GPU power. Our\nstudy shows that the PMCs that come with dominating mobile GPUs used in modern\nsmartphones are sufficient to model mobile GPU power, but exhibit\nmulticollinearity if used altogether. We present APGPM, the mobile GPU power\nmodeling methodology that automatically selects an optimal set of PMCs that\nmaximizes the GPU power model accuracy. Evaluation on two representative mobile\nGPUs shows that APGPM-generated GPU power models reduce the MAPE modeling error\nof prior-art by 1.95x to 2.66x (i.e., by 11.3% to 15.4%) while using only 4.66%\nto 20.41% of the total number of available PMCs.\n","subjects":["Computing Research Repository/Performance"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"VguRqigR_IORwhILQ1LCRiosoH2ILkthYpM6yqB_5Lk","pdfSize":"1339503"}
