{"id":"2408.12811","title":"Decentralized MIMO Systems with LMMSE Receivers and Imperfect CSI","authors":"Zeyan Zhuang, Xin Zhang, Dongfang Xu, Shenghui Song, Yonina C. Eldar","authorsParsed":[["Zhuang","Zeyan",""],["Zhang","Xin",""],["Xu","Dongfang",""],["Song","Shenghui",""],["Eldar","Yonina C.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 03:11:23 GMT"}],"updateDate":"2024-08-26","timestamp":1724382683000,"abstract":"  Centralized baseband processing (CBP) is required to achieve the full\npotential of massive multiple-input multiple-output (MIMO) systems. However,\ndue to the large number of antennas, CBP suffers from two major issues: 1)\nTremendous data interconnection between radio frequency (RF) circuitry and\nprocessing fabrics; and 2) high-dimensional computation. To this end,\ndecentralized baseband processing (DBP) has been proposed, where the antennas\nat the BS are partitioned into clusters connected to separate RF circuits and\nequipped with separate computing units. Unfortunately, due to the decentralized\nstructure, the optimal fusion scheme and performance analysis for DBP with\ngeneral spatial correlation between clusters and imperfect channel state\ninformation (CSI) are not available in the literature. In this paper, we\nconsider a decentralized MIMO system where all clusters adopt linear minimum\nmean-square error (LMMSE) receivers with imperfect CSI. Specifically, we first\nestablish the optimal linear fusion scheme which has high computational and\ndata input/output (I/O) costs. To reduce the costs, we further propose two\nsub-optimal fusion schemes with reduced complexity. For all three schemes, we\nderive the closed-form expressions for the signal-to-interference-and-noise\nratio (SINR) by leveraging random matrix theory (RMT) and demonstrate the\nconditions under which the sub-optimal schemes are optimal. Furthermore, we\ndetermine the optimal regularization parameter for decentralized LMMSE\nreceivers, identify the best antenna partitioning strategy, and prove that the\nSINR will decrease as the number of clusters increases. Numerical simulations\nvalidate the accuracy of the theoretical results.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}