{"id":"2408.14218","title":"LIMO: Load-balanced Offloading with MAPE and Particle Swarm Optimization\n  in Mobile Fog Networks","authors":"Yasaman Seraj, Soheil Fadaei, Bardia Safaei, Ali Javadi, Amir Mahdi\n  Hosseini Monazzah, Ali Mohammad Afshin Hemmatyar","authorsParsed":[["Seraj","Yasaman",""],["Fadaei","Soheil",""],["Safaei","Bardia",""],["Javadi","Ali",""],["Monazzah","Amir Mahdi Hosseini",""],["Hemmatyar","Ali Mohammad Afshin",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 12:32:08 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 10:13:29 GMT"}],"updateDate":"2024-08-29","timestamp":1724675528000,"abstract":"  Fog computing is essentially the expansion of cloud computing towards the\nnetwork edge, reducing user access time to computing resources and services.\nVarious advantages attribute to fog computing, including reduced latency, and\nimproved user experience. However, user mobility may limit the benefits of fog\ncomputing. The displacement of users from one location to another, may increase\ntheir distance from a fog server, leading into latency amplification. This\nwould also increase the probability of over utilization of fog servers which\nare located in popular destinations of mobile edge devices. This creates an\nunbalanced network of fog devices failing to provide lower makespan and fewer\ncloud accesses. One solution to maintain latency within an acceptable range is\nthe migration of fog tasks and preserve the distance between the edge devices\nand the available resources. Although some studies have focused on fog task\nmigration, none of them have considered load balancing in fog nodes.\nAccordingly, this paper introduces LIMO; an allocation and migration strategy\nfor establishing load balancing in fog networks based on the control loop MAPE\n(Monitor-Analyze-Plan-Execute) and the Particle Swarm Optimization (PSO)\nalgorithm. The periodical migration of tasks for load balancing aims to enhance\nthe system's efficiency. The performance of LIMO has been modeled and evaluated\nusing the Mobfogsim toolkit. The results show that this technique outperforms\nthe state-of-the-art in terms of network resource utilization with 10%\nimprovement. Furthermore, LIMO reduces the task migration to cloud by more than\n15%, while it reduces the request response time by 18%.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/"}