{"id":"2408.03342","title":"Graph Residual based Method for Molecular Property Prediction","authors":"Kanad Sen, Saksham Gupta, Abhishek Raj, Alankar Alankar","authorsParsed":[["Sen","Kanad",""],["Gupta","Saksham",""],["Raj","Abhishek",""],["Alankar","Alankar",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 09:01:36 GMT"}],"updateDate":"2024-08-08","timestamp":1722070896000,"abstract":"  Property prediction of materials has recently been of high interest in the\nrecent years in the field of material science. Various Physics-based and\nMachine Learning models have already been developed, that can give good\nresults. However, they are not accurate enough and are inadequate for critical\napplications. The traditional machine learning models try to predict properties\nbased on the features extracted from the molecules, which are not easily\navailable most of the time. In this paper, a recently developed novel Deep\nLearning method, the Graph Neural Network (GNN), has been applied, allowing us\nto predict properties directly only the Graph-based structures of the\nmolecules. SMILES (Simplified Molecular Input Line Entry System) representation\nof the molecules has been used in the present study as input data format, which\nhas been further converted into a graph database, which constitutes the\ntraining data. This article highlights the detailed description of the novel\nGRU-based methodology to map the inputs that have been used. Emphasis on\nhighlighting both the regressive property as well as the classification-based\nproperty of the GNN backbone. A detailed description of the Variational\nAutoencoder (VAE) and the end-to-end learning method has been given to\nhighlight the multi-class multi-label property prediction of the backbone. The\nresults have been compared with standard benchmark datasets as well as some\nnewly developed datasets. All performance metrics which have been used have\nbeen clearly defined as well as their reason for choice. Keywords: GNN, VAE,\nSMILES, multi-label multi-class classification, GRU\n","subjects":["Quantitative Biology/Quantitative Methods","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"LUB4QRwNyhWqITqMEphjNWlqOTa6_h0o_AQiDIlPuNc","pdfSize":"1971335"}
