{"id":"2408.10982","title":"GreediRIS: Scalable Influence Maximization using Distributed Streaming\n  Maximum Cover","authors":"Reet Barik, Wade Cappa, S M Ferdous, Marco Minutoli, Mahantesh\n  Halappanavar, Ananth Kalyanaraman","authorsParsed":[["Barik","Reet",""],["Cappa","Wade",""],["Ferdous","S M",""],["Minutoli","Marco",""],["Halappanavar","Mahantesh",""],["Kalyanaraman","Ananth",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 16:18:19 GMT"}],"updateDate":"2024-08-21","timestamp":1724170699000,"abstract":"  Influence maximization--the problem of identifying a subset of k influential\nseeds (vertices) in a network--is a classical problem in network science with\nnumerous applications. The problem is NP-hard, but there exist efficient\npolynomial time approximations. However, scaling these algorithms still remain\na daunting task due to the complexities associated with steps involving\nstochastic sampling and large-scale aggregations. In this paper, we present a\nnew parallel distributed approximation algorithm for influence maximization\nwith provable approximation guarantees. Our approach, which we call GreediRIS,\nleverages the RandGreedi framework--a state-of-the-art approach for distributed\nsubmodular optimization--for solving a step that computes a maximum k cover.\nGreediRIS combines distributed and streaming models of computations, along with\npruning techniques, to effectively address the communication bottlenecks of the\nalgorithm. Experimental results on up to 512 nodes (32K cores) of the NERSC\nPerlmutter supercomputer show that GreediRIS can achieve good strong scaling\nperformance, preserve quality, and significantly outperform the other\nstate-of-the-art distributed implementations. For instance, on 512 nodes, the\nmost performant variant of GreediRIS achieves geometric mean speedups of 28.99x\nand 36.35x for two different diffusion models, over a state-of-the-art parallel\nimplementation. We also present a communication-optimized version of GreediRIS\nthat further improves the speedups by two orders of magnitude.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"sDs8rSzrYEQ8EorAg17a-aenjgX5sxwXW4zIlGqcF0s","pdfSize":"701789"}
