{"id":"2408.12800","title":"Cap2Sum: Learning to Summarize Videos by Generating Captions","authors":"Cairong Zhao, Chutian Wang, Zifan Song, Guosheng Hu, Haonan Chen,\n  Xiaofan Zhai","authorsParsed":[["Zhao","Cairong",""],["Wang","Chutian",""],["Song","Zifan",""],["Hu","Guosheng",""],["Chen","Haonan",""],["Zhai","Xiaofan",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 02:28:54 GMT"}],"updateDate":"2024-08-26","timestamp":1724380134000,"abstract":"  With the rapid growth of video data on the internet, video summarization is\nbecoming a very important AI technology. However, due to the high labelling\ncost of video summarization, existing studies have to be conducted on\nsmall-scale datasets, leading to limited performance and generalization\ncapacity. In this work, we introduce the use of dense video captions as a\nsupervision signal to train video summarization models. Motivated by this, we\npropose Cap2Sum, a model that learns to summarize videos by generating\ncaptions, to exploit dense video caption annotations. This weakly-supervised\napproach allows us to train the models on large-scale dense video caption\ndatasets to achieve better performance and generalization capacity. To further\nimprove the generalization capacity, we introduce a CLIP (a strong\nvision-language model) Prior mechanism to enhance the learning of important\nobjects that captions may ignore in the videos. In practice, Cap2Sum can\nperform zero-shot video summarization or be fine-tuned by the ground-truth\nsummary or video caption of the target dataset. To examine the performance of\nCap2Sum after weakly-supervised fine-tuning by the video captions, we propose\ntwo new datasets, TVSum-Caption and SumMe-Caption, which are derived from two\ncommon video summarization datasets and will be publicly released. We conduct\nextensive experiments and the results demonstrate that our method achieves\nsignificant improvements in performance and generalization capacity compared\nwith previous methods.\n","subjects":["Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bsRenYeJduRnjKHig_PLDYWgllZ5qq287q-zcOLiCpg","pdfSize":"7400221"}
