{"id":"2408.11619","title":"Data-driven Modeling of Combined Sewer Systems for Urban Sustainability:\n  An Empirical Evaluation","authors":"Vipin Singh, Tianheng Ling, Teodor Chiaburu, Felix Biessmann","authorsParsed":[["Singh","Vipin",""],["Ling","Tianheng",""],["Chiaburu","Teodor",""],["Biessmann","Felix",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 13:46:58 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 12:39:36 GMT"}],"updateDate":"2024-09-19","timestamp":1724248018000,"abstract":"  Climate change poses complex challenges, with extreme weather events becoming\nincreasingly frequent and difficult to model. Examples include the dynamics of\nCombined Sewer Systems (CSS). Overburdened CSS during heavy rainfall will\noverflow untreated wastewater into surface water bodies. Classical approaches\nto modeling the impact of extreme rainfall events rely on physical simulations,\nwhich are particularly challenging to create for large urban infrastructures.\nDeep Learning (DL) models offer a cost-effective alternative for modeling the\ncomplex dynamics of sewer systems. In this study, we present a comprehensive\nempirical evaluation of several state-of-the-art DL time series models for\npredicting sewer system dynamics in a large urban infrastructure, utilizing\nthree years of measurement data. We especially investigate the potential of DL\nmodels to maintain predictive precision during network outages by comparing\nglobal models, which have access to all variables within the sewer system, and\nlocal models, which are limited to data from a restricted set of local sensors.\nOur findings demonstrate that DL models can accurately predict the dynamics of\nsewer system load, even under network outage conditions. These results suggest\nthat DL models can effectively aid in balancing the load redistribution in CSS,\nthereby enhancing the sustainability and resilience of urban infrastructures.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}