{"id":"2408.12948","title":"E-code: Mastering Efficient Code Generation through Pretrained Models\n  and Expert Encoder Group","authors":"Yue Pan, Chen Lyu, Zhenyu Yang, Lantian Li, Qi Liu, Xiuting Shao","authorsParsed":[["Pan","Yue",""],["Lyu","Chen",""],["Yang","Zhenyu",""],["Li","Lantian",""],["Liu","Qi",""],["Shao","Xiuting",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 09:57:37 GMT"}],"updateDate":"2024-08-26","timestamp":1724407057000,"abstract":"  Context: With the waning of Moore's Law, the software industry is placing\nincreasing importance on finding alternative solutions for continuous\nperformance enhancement. The significance and research results of software\nperformance optimization have been on the rise in recent years, especially with\nthe advancement propelled by Large Language Models(LLMs). However, traditional\nstrategies for rectifying performance flaws have shown significant limitations\nat the competitive code efficiency optimization level, and research on this\ntopic is surprisingly scarce. Objective: This study aims to address the\nresearch gap in this domain, offering practical solutions to the various\nchallenges encountered. Specifically, we have overcome the constraints of\ntraditional performance error rectification strategies and developed a Language\nModel (LM) tailored for the competitive code efficiency optimization realm.\nMethod: We introduced E-code, an advanced program synthesis LM. Inspired by the\nrecent success of expert LMs, we designed an innovative structure called the\nExpert Encoder Group. This structure employs multiple expert encoders to\nextract features tailored for different input types. We assessed the\nperformance of E-code against other leading models on a competitive dataset and\nconducted in-depth ablation experiments. Results: Upon systematic evaluation,\nE-code achieved a 54.98% improvement in code efficiency, significantly\noutperforming other advanced models. In the ablation experiments, we further\nvalidated the significance of the expert encoder group and other components\nwithin E-code. Conclusion: The research findings indicate that the expert\nencoder group can effectively handle various inputs in efficiency optimization\ntasks, significantly enhancing the model's performance.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}