{"id":"2408.14505","title":"Empowering Pre-Trained Language Models for Spatio-Temporal Forecasting\n  via Decoupling Enhanced Discrete Reprogramming","authors":"Hao Wang, Jindong Han, Wei Fan, Hao Liu","authorsParsed":[["Wang","Hao",""],["Han","Jindong",""],["Fan","Wei",""],["Liu","Hao",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 07:59:36 GMT"}],"updateDate":"2024-08-28","timestamp":1724486376000,"abstract":"  Spatio-temporal time series forecasting plays a critical role in various\nreal-world applications, such as transportation optimization, energy\nmanagement, and climate analysis. The recent advancements in Pre-trained\nLanguage Models (PLMs) have inspired efforts to reprogram these models for time\nseries forecasting tasks, by leveraging their superior reasoning and\ngeneralization capabilities. However, existing approaches fall short in\nhandling complex spatial inter-series dependencies and intrinsic intra-series\nfrequency components, limiting their spatio-temporal forecasting performance.\nMoreover, the linear mapping of continuous time series to a compressed subset\nvocabulary in reprogramming constrains the spatio-temporal semantic\nexpressivity of PLMs and may lead to potential information bottleneck. To\novercome the above limitations, we propose \\textsc{RePST}, a tailored PLM\nreprogramming framework for spatio-temporal forecasting. The key insight of\n\\textsc{RePST} is to decouple the spatio-temporal dynamics in the frequency\ndomain, allowing better alignment with the PLM text space. Specifically, we\nfirst decouple spatio-temporal data in Fourier space and devise a structural\ndiffusion operator to obtain temporal intrinsic and spatial diffusion signals,\nmaking the dynamics more comprehensible and predictable for PLMs. To avoid\ninformation bottleneck from a limited vocabulary, we further propose a discrete\nreprogramming strategy that selects relevant discrete textual information from\nan expanded vocabulary space in a differentiable manner. Extensive experiments\non four real-world datasets show that our proposed approach significantly\noutperforms state-of-the-art spatio-temporal forecasting models, particularly\nin data-scarce scenarios.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}