{"id":"2408.15629","title":"On the art of designing effective space-times with free surface flows in\n  Analogue Gravity","authors":"Alexis Bossard (PPrime (Poitiers)), Nicolas James (LMA (Poitiers)),\n  Valentin Jules (PPrime (Poitiers)), Johan Fourdrinoy, Scott Robertson (PPrime\n  (Poitiers)), Germain Rousseaux (PPrime (Poitiers))","authorsParsed":[["Bossard","Alexis","","PPrime"],["James","Nicolas","","LMA"],["Jules","Valentin","","PPrime"],["Fourdrinoy","Johan","","PPrime"],["Robertson","Scott","","PPrime"],["Rousseaux","Germain","","PPrime"]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 08:31:57 GMT"}],"updateDate":"2024-08-29","timestamp":1724833917000,"abstract":"  Accelerating/decelerating trans-critical flows (waterfalls/cataracts) are\nanalogous to space-times of black holes/white fountains since the pioneering\nwork of Sch{\\\"u}tzhold \\&amp; Unruh in 2002. A single number is usually\nemployed to classify trans-criticality namely the local depth Froude number\nwhich is the ratio between the local current speed and the local celerity of\nlong gravity waves analogous to the light celerity. When the former reaches\none, water waves are no more able to propagate upstream: the hydraulic black\nhole is a river of no return for them. At a higher level of understanding, two\nglobal dimensionless numbers, the upstream Froude number F r up and the\nobstruction ratio r up (the height of a bottom obstacle, the underlying\ngeometry inducing the effective space-time, divided by the upstream water\ndepth) are essential to distinguish subcritical, trans-critical and\nsupercritical zones in the -F r up versus r up -hydraulic and nondispersive\ndiagram. The relationship between both global parameters for transcritical\nflows turns out to be a peculiar limit of the behaviour of boats navigating in\nconfined media like canals or locks with a generalized obstruction factor based\non the ratio between the boat section and the canal section. Here, we revisit\nthe classification of flows over obstacles in open water channel taking into\naccount both effects of dispersion and scale, two neglected topics so far. For\nthe first time, we give a complete classification of flows in an open water\nchannel based on sub-pixel detection method measurements of the free surface\nsupported by numerical simulations. We generalized the obstruction factor by a\nfilling factor taking into account the maximum height of the water channel, a\ncrucial parameter that was overlooked so far. Our ultimate purpose is to\nunderstand how to reproduce in the laboratory analogues of curved space-times\nfrom the dynamical point of view.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}