{"id":"2408.01462","title":"Faculty Perspectives on the Potential of RAG in Computer Science Higher\n  Education","authors":"Sagnik Dakshit","authorsParsed":[["Dakshit","Sagnik",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 14:55:22 GMT"}],"updateDate":"2024-08-06","timestamp":1722178522000,"abstract":"  The emergence of Large Language Models (LLMs) has significantly impacted the\nfield of Natural Language Processing and has transformed conversational tasks\nacross various domains because of their widespread integration in applications\nand public access. The discussion surrounding the application of LLMs in\neducation has raised ethical concerns, particularly concerning plagiarism and\npolicy compliance. Despite the prowess of LLMs in conversational tasks, the\nlimitations of reliability and hallucinations exacerbate the need to guardrail\nconversations, motivating our investigation of RAG in computer science higher\neducation. We developed Retrieval Augmented Generation (RAG) applications for\nthe two tasks of virtual teaching assistants and teaching aids. In our study,\nwe collected the ratings and opinions of faculty members in undergraduate and\ngraduate computer science university courses at various levels, using our\npersonalized RAG systems for each course. This study is the first to gather\nfaculty feedback on the application of LLM-based RAG in education. The\ninvestigation revealed that while faculty members acknowledge the potential of\nRAG systems as virtual teaching assistants and teaching aids, certain barriers\nand features are suggested for their full-scale deployment. These findings\ncontribute to the ongoing discussion on the integration of advanced language\nmodels in educational settings, highlighting the need for careful consideration\nof ethical implications and the development of appropriate safeguards to ensure\nresponsible and effective implementation.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Emerging Technologies","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ogQ7c2-49U-vs9_yR96z4XkwJREHTa1d_WOFl9AltYg","pdfSize":"548260","txDigest":"FfsxpfPxUDrZxNdrbWvnF8KJ8KeTdptGvHNKuxCqMbPK","endEpoch":"1","status":"CERTIFIED"}
