{"id":"2408.04973","title":"On the correlation between young massive star clusters and gamma-ray\n  unassociated sources","authors":"Giada Peron, Giovanni Morlino, Stefano Gabici, Elena Amato, Archana\n  Purushothaman, and Marcella Brusa","authorsParsed":[["Peron","Giada",""],["Morlino","Giovanni",""],["Gabici","Stefano",""],["Amato","Elena",""],["Purushothaman","Archana",""],["Brusa","Marcella",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 09:53:52 GMT"}],"updateDate":"2024-08-12","timestamp":1723197232000,"abstract":"  Star clusters (SCs) are potential cosmic-ray (CR) accelerators and therefore\nare expected to emit high-energy radiation. However, a clear detection of\ngamma-ray emission from this source class has only been possible for a handful\nof cases. This could in principle result from two different reasons: either\ndetectable SCs are limited to a small fraction of the total number of Galactic\nSCs, or gamma-ray-emitting SCs are not recognized as such and therefore are\nlisted in the ensemble of unidentified sources. In this Letter we investigate\nthis latter scenario, by comparing available catalogs of SCs and HII regions,\nobtained from Gaia and WISE observations, to the gamma-ray GeV and TeV catalogs\nbuilt from Fermi-LAT, H.E.S.S. and LHAASO data. The significance of the\ncorrelation between catalogs is evaluated by comparing the results with\nsimulations of synthetic populations. A strong correlation emerges between\nFermi-LAT unidentified sources and HII regions which trace massive SCs in the\nearliest (< 1-2 Myr) phase of their life, where no supernova explosions have\nhappened yet, confirming that winds of massive stars can alone accelerate\nparticles and produce gamma-ray emission at least up to GeV energies. The\nassociation with TeV-energies sources is less evident. Similarly, no\nsignificant association is found between Gaia SCs and GeV nor TeV sources. We\nascribe this fact to the larger extension of these objects, but also to an\nintrinsic bias in the Gaia selection towards SCs surrounded by a lower target\ngas density, that would otherwise hinder the detection in the optical waveband.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"UNVt3OREwyXLioOES6zBDxyWKEd24A8USXld-i0OF2Q","pdfSize":"1205401"}
