{"id":"2408.07504","title":"Numerical $\\texttt{AXP4}$ Simulations of Pulse Profiles for Binary\n  Accreting X-ray Pulsars $-$ II: A Case Study of Centaurus X-3","authors":"Parisee S. Shirke and Gulab C. Dewangan","authorsParsed":[["Shirke","Parisee S.",""],["Dewangan","Gulab C.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 12:31:02 GMT"}],"updateDate":"2024-08-15","timestamp":1723638662000,"abstract":"  The pulse shapes simulated in the accompanying paper Part $-$ I are compared\nwith observations of a model binary accreting X-ray pulsar, Centaurus X-3. With\nknown Cen X-3 inclination angles provided as input to the $\\texttt{AXP4}$ code,\nthe generated pulse profile is suitably compared with the corresponding\nobserved energy-resolved $\\textit{AstroSat}$/LAXPC pulse profile. The pulsed\nfraction is proposed as a robust, quantitative measure for estimating the size\nof the emission region of Centaurus X-3 by extending the simulations to include\nspherical caps of varying fractional surface coverage of the neutron star $-$\nover the full range of $0-100\\%$, up to very large caps (with polar half angle\n$> 30^{\\circ}$). The hotspot radius thus derived drops by an order of magnitude\nfrom $12.27$ km to $1.36^{+0.29}_{-0.26}$ km, within the ballpark of the\nstandard model value of $\\sim$$1$ km, after including the effect of\ngravitational light bending, lending further weight to its routine emphasis in\nthe literature. The energy- and luminosity-dependence of the composite\ngravitationally bent and slab-integrated pulse profiles is further studied. As\nthe pulse profile is sensitive to luminosity variations, the correlation of the\nsize of a finite polar cap and its dependence on X-ray luminosity $-$ through\nthe rate and subsequently, the geometry of accretion $-$ is discussed. Although\na single, model pulsar was chosen for this work to exhibit the depth of the\nphysical and astrophysical prospects of such a probe, this exercise can be\nextended to a wide range of existing X-ray pulse profiles of known binary\naccreting pulsars available in galactic catalogs, especially, with the possible\ninclusion of accretion columns (with cylindrical co-ordinate transformation) in\nthe future.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}