{"id":"2408.05674","title":"PS-TTL: Prototype-based Soft-labels and Test-Time Learning for Few-shot\n  Object Detection","authors":"Yingjie Gao, Yanan Zhang, Ziyue Huang, Nanqing Liu, Di Huang","authorsParsed":[["Gao","Yingjie",""],["Zhang","Yanan",""],["Huang","Ziyue",""],["Liu","Nanqing",""],["Huang","Di",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 02:21:43 GMT"}],"updateDate":"2024-08-13","timestamp":1723342903000,"abstract":"  In recent years, Few-Shot Object Detection (FSOD) has gained widespread\nattention and made significant progress due to its ability to build models with\na good generalization power using extremely limited annotated data. The\nfine-tuning based paradigm is currently dominating this field, where detectors\nare initially pre-trained on base classes with sufficient samples and then\nfine-tuned on novel ones with few samples, but the scarcity of labeled samples\nof novel classes greatly interferes precisely fitting their data distribution,\nthus hampering the performance. To address this issue, we propose a new\nframework for FSOD, namely Prototype-based Soft-labels and Test-Time Learning\n(PS-TTL). Specifically, we design a Test-Time Learning (TTL) module that\nemploys a mean-teacher network for self-training to discover novel instances\nfrom test data, allowing detectors to learn better representations and\nclassifiers for novel classes. Furthermore, we notice that even though\nrelatively low-confidence pseudo-labels exhibit classification confusion, they\nstill tend to recall foreground. We thus develop a Prototype-based Soft-labels\n(PS) strategy through assessing similarities between low-confidence\npseudo-labels and category prototypes as soft-labels to unleash their\npotential, which substantially mitigates the constraints posed by few-shot\nsamples. Extensive experiments on both the VOC and COCO benchmarks show that\nPS-TTL achieves the state-of-the-art, highlighting its effectiveness. The code\nand model are available at https://github.com/gaoyingjay/PS-TTL.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}