{"id":"2408.11214","title":"Generalized Path Integral Energy and Heat Capacity Estimators of Quantum\n  Oscillators and Crystals using Harmonic Mapping","authors":"Sabry G. Moustafa and Andrew J. Schultz","authorsParsed":[["Moustafa","Sabry G.",""],["Schultz","Andrew J.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 22:19:54 GMT"}],"updateDate":"2024-08-22","timestamp":1724192394000,"abstract":"  Imaginary-time path integral (PI) is a rigorous tool to treat nuclear quantum\neffects in static properties. However, with its high computational demand, it\nis crucial to devise precise estimators. We introduce generalized PI estimators\nfor the energy and heat capacity that utilize coordinate mapping. While it can\nreduce to the standard thermodynamic and centroid virial (CVir) estimators, the\nformulation can also take advantage of harmonic character of quantum\noscillators and crystals to construct a coordinate mapping. This yields\nharmonically mapped averaging (HMA) estimators, with mappings that decouple\n(HMAc) or couple (HMAq) the centroid and internal modes. The HMAq is\nconstructed with normal mode coordinates (HMAq-NM) with quadratic scaling of\ncost or harmonic oscillator staging (HMAq-SG) coordinates with linear scaling.\nThe estimator performance is examined for a 1D anharmonic oscillator and a 3D\nLennard-Jones crystal using path integral molecular dynamics (PIMD) simulation.\nThe HMA estimators consistently provide more precise estimates compared to\nCVir, with the best performance obtained by HMAq-NM, followed by HMAq-SG, and\nthen HMAc. We also examine the effect of anharmonicity (for AO), intrinsic\nquantumness, and Trotter number. The HMA formulation introduced assumes the\navailability of forces and Hessian matrix; however, an equally efficient finite\ndifference alternative is possible when these derivatives are inaccessible. The\nremarkable improvement in precision offered by HMAq estimators provides a\nframework for efficient PI simulation of more challenging systems, such as\nthose based on \\textit{ab initio} calculations.\n","subjects":["Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YdVNARY8XUv7P-11MepVJs7-g3aBLLHz5s-pkGh3HsU","pdfSize":"812676"}
