{"id":"2408.10520","title":"Efficient and Deployable Knowledge Infusion for Open-World\n  Recommendations via Large Language Models","authors":"Yunjia Xi, Weiwen Liu, Jianghao Lin, Muyan Weng, Xiaoling Cai, Hong\n  Zhu, Jieming Zhu, Bo Chen, Ruiming Tang, Yong Yu, Weinan Zhang","authorsParsed":[["Xi","Yunjia",""],["Liu","Weiwen",""],["Lin","Jianghao",""],["Weng","Muyan",""],["Cai","Xiaoling",""],["Zhu","Hong",""],["Zhu","Jieming",""],["Chen","Bo",""],["Tang","Ruiming",""],["Yu","Yong",""],["Zhang","Weinan",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 03:45:24 GMT"}],"updateDate":"2024-08-21","timestamp":1724125524000,"abstract":"  Recommender systems (RSs) play a pervasive role in today's online services,\nyet their closed-loop nature constrains their access to open-world knowledge.\nRecently, large language models (LLMs) have shown promise in bridging this gap.\nHowever, previous attempts to directly implement LLMs as recommenders fall\nshort in meeting the requirements of industrial RSs, particularly in terms of\nonline inference latency and offline resource efficiency. Thus, we propose REKI\nto acquire two types of external knowledge about users and items from LLMs.\nSpecifically, we introduce factorization prompting to elicit accurate knowledge\nreasoning on user preferences and items. We develop individual knowledge\nextraction and collective knowledge extraction tailored for different scales of\nscenarios, effectively reducing offline resource consumption. Subsequently,\ngenerated knowledge undergoes efficient transformation and condensation into\naugmented vectors through a hybridized expert-integrated network, ensuring\ncompatibility. The obtained vectors can then be used to enhance any\nconventional recommendation model. We also ensure efficient inference by\npreprocessing and prestoring the knowledge from LLMs. Experiments demonstrate\nthat REKI outperforms state-of-the-art baselines and is compatible with lots of\nrecommendation algorithms and tasks. Now, REKI has been deployed to Huawei's\nnews and music recommendation platforms and gained a 7% and 1.99% improvement\nduring the online A/B test.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}