{"id":"2408.00854","title":"Gridlines Mitigate Sine Illusion in Line Charts","authors":"Clayton Knittel, Jane Awuah, Steven Franconeri, and Cindy Xiong\n  Bearfield","authorsParsed":[["Knittel","Clayton",""],["Awuah","Jane",""],["Franconeri","Steven",""],["Bearfield","Cindy Xiong",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 18:09:05 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 08:27:03 GMT"}],"updateDate":"2024-08-09","timestamp":1722535745000,"abstract":"  Sine illusion happens when the more quickly changing pairs of lines lead to\nbigger underestimates of the delta between them.\n  We evaluate three visual manipulations on mitigating sine illusions: dotted\nlines, aligned gridlines, and offset gridlines via a user study.\n  We asked participants to compare the deltas between two lines at two time\npoints and found aligned gridlines to be the most effective in mitigating sine\nillusions.\n  Using data from the user study, we produced a model that predicts the impact\nof the sine illusion in line charts by accounting for the ratio of the vertical\ndistance between the two points of comparison.\n  When the ratio is less than 50\\%, participants begin to be influenced by the\nsine illusion. This effect can be significantly exacerbated when the difference\nbetween the two deltas falls under 30\\%.\n  We compared two explanations for the sine illusion based on our data: either\nparticipants were mistakenly using the perpendicular distance between the two\nlines to make their comparison (the perpendicular explanation), or they\nincorrectly relied on the length of the line segment perpendicular to the angle\nbisector of the bottom and top lines (the equal triangle explanation).\n  We found the equal triangle explanation to be the more predictive model\nexplaining participant behaviors.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PRUpUrpFGZvALCe4k-VvAW74P5anMaDnxwfTmqNH0D0","pdfSize":"795938"}
