{"id":"2408.16515","title":"CanCal: Towards Real-time and Lightweight Ransomware Detection and\n  Response in Industrial Environments","authors":"Shenao Wang, Feng Dong, Hangfeng Yang, Jingheng Xu, Haoyu Wang","authorsParsed":[["Wang","Shenao",""],["Dong","Feng",""],["Yang","Hangfeng",""],["Xu","Jingheng",""],["Wang","Haoyu",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 13:26:26 GMT"}],"updateDate":"2024-08-30","timestamp":1724937986000,"abstract":"  Ransomware attacks have emerged as one of the most significant cybersecurity\nthreats. Despite numerous proposed detection and defense methods, existing\napproaches face two fundamental limitations in large-scale industrial\napplications: intolerable system overheads and notorious alert fatigue. To\naddress these challenges, we propose CanCal, a real-time and lightweight\nransomware detection system. Specifically, CanCal selectively filters\nsuspicious processes by the monitoring layers and then performs in-depth\nbehavioral analysis to isolate ransomware activities from benign operations,\nminimizing alert fatigue while ensuring lightweight computational and storage\noverhead. The experimental results on a large-scale industrial\nenvironment~(1,761 ransomware, ~3 million events, continuous test over 5\nmonths) indicate that CanCal is as effective as state-of-the-art techniques\nwhile enabling rapid inference within 30ms and real-time response within a\nmaximum of 3 seconds. CanCal dramatically reduces average CPU utilization by\n91.04% (from 6.7% to 0.6%) and peak CPU utilization by 76.69% (from 26.6% to\n6.2%), while avoiding 76.50% (from 3,192 to 750) of the inspection efforts from\nsecurity analysts. By the time of this writing, CanCal has been integrated into\na commercial product and successfully deployed on 3.32 million endpoints for\nover a year. From March 2023 to April 2024, CanCal successfully detected and\nthwarted 61 ransomware attacks, demonstrating the effectiveness of CanCal in\ncombating sophisticated ransomware threats in real-world scenarios.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}