{"id":"2408.15520","title":"Understanding long-range opposite charge repulsion in multivalent salt\n  solutions","authors":"Nikhil R. Agrawal, Carlo Carrao, Rui Wang","authorsParsed":[["Agrawal","Nikhil R.",""],["Carrao","Carlo",""],["Wang","Rui",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 04:13:09 GMT"}],"updateDate":"2024-08-29","timestamp":1724818389000,"abstract":"  The electrostatic correlations between ions profoundly influence the\nstructure and forces within electrical double layers. Here, we apply the\nmodified Gaussian Renormalized Fluctuation theory to investigate the\ncounter-intuitive phenomenon of repulsion between two oppositely charged\nsurfaces and discuss its relationship with overcharging. By accurately\naccounting for the effect of spatially varying ion-ion correlations, we capture\nthese repulsive forces for divalent, trivalent as well as tetravalent ions, in\nquantitative agreement with reported simulation results. We show that the\nopposite-charge repulsion is long-ranged with an effective length scale of a\nfew nanometers. The strength of opposite-charge repulsion increases\nmonotonically with the multivalent salt concentration, in stark contrast with\nthe non-monotonic salt concentration dependence of other ion correlation-driven\nphenomena, such as overcharging and like-charge attraction. We also elucidate\nthat the origin of the opposite-charge repulsion is the large amount of ions\nattracted to the double layer as a result of ion-ion correlations, leading to\nhigher osmotic pressure and stronger screening of the electrostatic attraction,\nwhich results in an overall repulsive force between two oppositely charged\nsurfaces. Furthermore, we demonstrate that there is no causal relationship\nbetween opposite-charge repulsion and the overcharging of the surface.\nOpposite-charge repulsion is accompanied by overcharging at large separation\ndistances, but can also occur in normal double layers without overcharging at\nintermediate separation distances.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Materials Science","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}