{"id":"2408.05329","title":"Spin-Orbit Alignment of Early-type Astrometric Binaries and the Origin\n  of Slow Rotators","authors":"Chase L. Smith, Maxwell Moe, and Kaitlin M. Kratter","authorsParsed":[["Smith","Chase L.",""],["Moe","Maxwell",""],["Kratter","Kaitlin M.",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 20:35:37 GMT"}],"updateDate":"2024-08-13","timestamp":1723235737000,"abstract":"  The spin-orbit alignment of binary stars traces their formation and accretion\nhistory. Previous studies of spin-orbit alignment have been limited to small\nsamples, slowly rotating solar-type stars, and/or wide visual binaries that not\nsurprisingly manifest random spin-orbit orientations. We analyze 917 Gaia\nastrometric binaries across periods $P$ = 100-3,000 days ($a$ = 0.5-5 au) that\nhave B8-F1 IV/V primaries ($M_1$ = 1.5-3 M$_{\\odot}$) and measured projected\nrotational velocities $v$sin$i$. The primary stars in face-on orbits exhibit\nsubstantially smaller $v$sin$i$ compared to those in edge-on orbits at the\n6$\\sigma$ level, demonstrating significant spin-orbit alignment. The primaries\nin our astrometric binaries are rotating more slowly than their single-star or\nwide-binary counterparts and therefore comprise the slow-rotator population in\nthe observed bimodal rotational velocity distribution of early-type stars. We\ndiscuss formation models of close binaries where some of the disk angular\nmomentum is transferred to the orbit and/or secondary spin, quenching angular\nmomentum flow to the primary spin. The primaries in astrometric binaries with\nsmall mass ratios $q$ = $M_2$/$M_1<$0.3 possess even smaller $v$sin$i$,\nconsistent with model predictions. Meanwhile, astrometric binaries with large\neccentricities $e>$0.4 do not display spin-orbit alignment or spin reduction.\nUsing a Monte Carlo technique, we measure a spin-orbit alignment fraction of\n$F_{\\rm align}$ = 75% $\\pm$ 5% and an average spin reduction factor of $\\langle\nS_{\\rm align} \\rangle$ = 0.43 $\\pm$ 0.04. We conclude that 75% of close A-type\nbinaries likely experienced circumbinary disk accretion and probably formed via\ndisk fragmentation and inward disk migration. The remaining 25%, mostly those\nwith $e>$0.4, likely formed via core fragmentation and orbital decay via\ndynamical friction.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GIx0WhUHdYLmALHHQ7SPuWX9NL405ORuanJnYZPnlFo","pdfSize":"2553768"}
