{"id":"2408.13568","title":"A Divide-and-Conquer Machine Learning Approach for Modelling Turbulent\n  Flows","authors":"Anthony Man, Mohammad Jadidi, Amir Keshmiri, Hujun Yin, and Yasser\n  Mahmoudi","authorsParsed":[["Man","Anthony",""],["Jadidi","Mohammad",""],["Keshmiri","Amir",""],["Yin","Hujun",""],["Mahmoudi","Yasser",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 12:44:19 GMT"}],"updateDate":"2024-08-27","timestamp":1724503459000,"abstract":"  In this paper, a novel zonal machine learning (ML) approach for\nReynolds-averaged Navier-Stokes (RANS) turbulence modelling based on the\ndivide-and-conquer technique is introduced. This approach involves partitioning\nthe flow domain into regions of flow physics called zones, training one ML\nmodel in each zone, then validating and testing them on their respective zones.\nThe approach was demonstrated with the tensor basis neural network (TBNN) and\nanother neural net called the turbulent kinetic energy neural network (TKENN).\nThese were used to predict Reynolds stress anisotropy and turbulent kinetic\nenergy respectively in test cases of flow over a solid block, which contain\nregions of different flow physics including separated flows. The results show\nthat the combined predictions given by the zonal TBNNs and TKENNs were\nsignificantly more accurate than their corresponding standard non-zonal models.\nMost notably, shear anisotropy component in the test cases was predicted at\nleast 20% and 55% more accurately on average by the zonal TBNNs compared to the\nnon-zonal TBNN and RANS, respectively. The Reynolds stress constructed with the\nzonal predictions was also found to be at least 23% more accurate than those\nobtained with the non-zonal approach and 30% more accurate than the Reynolds\nstress predicted by RANS on average. These improvements were attributed to the\nshape of the zones enabling the zonal models to become highly locally optimized\nat predicting the output.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}