{"id":"2408.06328","title":"HeLiMOS: A Dataset for Moving Object Segmentation in 3D Point Clouds\n  From Heterogeneous LiDAR Sensors","authors":"Hyungtae Lim and Seoyeon Jang and Benedikt Mersch and Jens Behley and\n  Hyun Myung and Cyrill Stachniss","authorsParsed":[["Lim","Hyungtae",""],["Jang","Seoyeon",""],["Mersch","Benedikt",""],["Behley","Jens",""],["Myung","Hyun",""],["Stachniss","Cyrill",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 17:44:33 GMT"}],"updateDate":"2024-08-13","timestamp":1723484673000,"abstract":"  Moving object segmentation (MOS) using a 3D light detection and ranging\n(LiDAR) sensor is crucial for scene understanding and identification of moving\nobjects. Despite the availability of various types of 3D LiDAR sensors in the\nmarket, MOS research still predominantly focuses on 3D point clouds from\nmechanically spinning omnidirectional LiDAR sensors. Thus, we are, for example,\nlacking a dataset with MOS labels for point clouds from solid-state LiDAR\nsensors which have irregular scanning patterns. In this paper, we present a\nlabeled dataset, called \\textit{HeLiMOS}, that enables to test MOS approaches\non four heterogeneous LiDAR sensors, including two solid-state LiDAR sensors.\nFurthermore, we introduce a novel automatic labeling method to substantially\nreduce the labeling effort required from human annotators. To this end, our\nframework exploits an instance-aware static map building approach and\ntracking-based false label filtering. Finally, we provide experimental results\nregarding the performance of commonly used state-of-the-art MOS approaches on\nHeLiMOS that suggest a new direction for a sensor-agnostic MOS, which generally\nworks regardless of the type of LiDAR sensors used to capture 3D point clouds.\nOur dataset is available at https://sites.google.com/view/helimos.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"XleKCy67nRJ1uMjDIFiH6iRRV_2x5mx_HaWX3usQxLI","pdfSize":"8821017"}
