{"id":"2408.02340","title":"A Landscape-Aware Differential Evolution for Multimodal Optimization\n  Problems","authors":"Guo-Yun Lin, Zong-Gan Chen, Yuncheng Jiang, Zhi-Hui Zhan, Jun Zhang","authorsParsed":[["Lin","Guo-Yun",""],["Chen","Zong-Gan",""],["Jiang","Yuncheng",""],["Zhan","Zhi-Hui",""],["Zhang","Jun",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 09:37:55 GMT"}],"updateDate":"2024-08-06","timestamp":1722850675000,"abstract":"  How to simultaneously locate multiple global peaks and achieve certain\naccuracy on the found peaks are two key challenges in solving multimodal\noptimization problems (MMOPs). In this paper, a landscape-aware differential\nevolution (LADE) algorithm is proposed for MMOPs, which utilizes landscape\nknowledge to maintain sufficient diversity and provide efficient search\nguidance. In detail, the landscape knowledge is efficiently utilized in the\nfollowing three aspects. First, a landscape-aware peak exploration helps each\nindividual evolve adaptively to locate a peak and simulates the regions of the\nfound peaks according to search history to avoid an individual locating a found\npeak. Second, a landscape-aware peak distinction distinguishes whether an\nindividual locates a new global peak, a new local peak, or a found peak.\nAccuracy refinement can thus only be conducted on the global peaks to enhance\nthe search efficiency. Third, a landscape-aware reinitialization specifies the\ninitial position of an individual adaptively according to the distribution of\nthe found peaks, which helps explore more peaks. The experiments are conducted\non 20 widely-used benchmark MMOPs. Experimental results show that LADE obtains\ngenerally better or competitive performance compared with seven well-performed\nalgorithms proposed recently and four winner algorithms in the IEEE CEC\ncompetitions for multimodal optimization.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}