{"id":"2408.10518","title":"BAUST Lipi: A BdSL Dataset with Deep Learning Based Bangla Sign Language\n  Recognition","authors":"Md Hadiuzzaman, Mohammed Sowket Ali, Tamanna Sultana, Abdur Raj Shafi,\n  Abu Saleh Musa Miah, Jungpil Shin","authorsParsed":[["Hadiuzzaman","Md",""],["Ali","Mohammed Sowket",""],["Sultana","Tamanna",""],["Shafi","Abdur Raj",""],["Miah","Abu Saleh Musa",""],["Shin","Jungpil",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 03:35:42 GMT"}],"updateDate":"2024-08-21","timestamp":1724124942000,"abstract":"  People commonly communicate in English, Arabic, and Bengali spoken languages\nthrough various mediums. However, deaf and hard-of-hearing individuals\nprimarily use body language and sign language to express their needs and\nachieve independence. Sign language research is burgeoning to enhance\ncommunication with the deaf community. While many researchers have made strides\nin recognizing sign languages such as French, British, Arabic, Turkish, and\nAmerican, there has been limited research on Bangla sign language (BdSL) with\nless-than-satisfactory results. One significant barrier has been the lack of a\ncomprehensive Bangla sign language dataset. In our work, we introduced a new\nBdSL dataset comprising alphabets totaling 18,000 images, with each image being\n224x224 pixels in size. Our dataset encompasses 36 Bengali symbols, of which 30\nare consonants and the remaining six are vowels. Despite our dataset\ncontribution, many existing systems continue to grapple with achieving\nhigh-performance accuracy for BdSL. To address this, we devised a hybrid\nConvolutional Neural Network (CNN) model, integrating multiple convolutional\nlayers, activation functions, dropout techniques, and LSTM layers. Upon\nevaluating our hybrid-CNN model with the newly created BdSL dataset, we\nachieved an accuracy rate of 97.92\\%. We are confident that both our BdSL\ndataset and hybrid CNN model will be recognized as significant milestones in\nBdSL research.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JNqqRKwCWRCbLscX_qUaQuyoyl23TaGP-pwCb68JXmM","pdfSize":"768595"}
