{"id":"2408.02990","title":"Joint Design of Probabilistic Constellation Shaping and Precoding for\n  Multi-user VLC Systems","authors":"Thang K. Nguyen, Thanh V. Pham, Hoang D. Le, Chuyen T. Nguyen and Anh\n  T. Pham","authorsParsed":[["Nguyen","Thang K.",""],["Pham","Thanh V.",""],["Le","Hoang D.",""],["Nguyen","Chuyen T.",""],["Pham","Anh T.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 06:47:23 GMT"}],"updateDate":"2024-08-07","timestamp":1722926843000,"abstract":"  This paper proposes a joint design of probabilistic constellation shaping\n(PCS) and precoding to enhance the sum-rate performance of multi-user visible\nlight communications (VLC) broadcast channels subject to signal amplitude\nconstraint. In the proposed design, the transmission probabilities of bipolar\n$M$-pulse amplitude modulation ($M$-PAM) symbols for each user and the transmit\nprecoding matrix are jointly optimized to improve the sum-rate performance. The\njoint design problem is shown to be a complex non-convex problem due to the\nnon-convexity of the objective function. To tackle the problem, the firefly\nalgorithm (FA), a nature-inspired heuristic optimization approach, is employed\nto solve a local optima to the original non-convex optimization problem. The\nFA-based approach, however, suffers from high computational complexity.\nTherefore, we propose a low-complexity design based on zero-forcing (ZF)\nprecoding, which is solved using an alternating optimization (AO) approach.\nSimulation results reveal that the proposed joint design with PCS significantly\nimproves the sum-rate performance compared to the conventional design with\nuniform signaling. Some insights into the optimal symbol distributions of the\ntwo joint design approaches are also provided.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3RwjOaFAk4JePf54M8jpMhoiSX7G3DvSlBO6qNfX2KY","pdfSize":"426113"}
