{"id":"2408.12821","title":"Examining the Commitments and Difficulties Inherent in Multimodal\n  Foundation Models for Street View Imagery","authors":"Zhenyuan Yang, Xuhui Lin, Qinyi He, Ziye Huang, Zhengliang Liu, Hanqi\n  Jiang, Peng Shu, Zihao Wu, Yiwei Li, Stephen Law, Gengchen Mai, Tianming Liu,\n  and Tao Yang","authorsParsed":[["Yang","Zhenyuan",""],["Lin","Xuhui",""],["He","Qinyi",""],["Huang","Ziye",""],["Liu","Zhengliang",""],["Jiang","Hanqi",""],["Shu","Peng",""],["Wu","Zihao",""],["Li","Yiwei",""],["Law","Stephen",""],["Mai","Gengchen",""],["Liu","Tianming",""],["Yang","Tao",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 03:45:31 GMT"}],"updateDate":"2024-08-26","timestamp":1724384731000,"abstract":"  The emergence of Large Language Models (LLMs) and multimodal foundation\nmodels (FMs) has generated heightened interest in their applications that\nintegrate vision and language. This paper investigates the capabilities of\nChatGPT-4V and Gemini Pro for Street View Imagery, Built Environment, and\nInterior by evaluating their performance across various tasks. The assessments\ninclude street furniture identification, pedestrian and car counts, and road\nwidth measurement in Street View Imagery; building function classification,\nbuilding age analysis, building height analysis, and building structure\nclassification in the Built Environment; and interior room classification,\ninterior design style analysis, interior furniture counts, and interior length\nmeasurement in Interior. The results reveal proficiency in length measurement,\nstyle analysis, question answering, and basic image understanding, but\nhighlight limitations in detailed recognition and counting tasks. While\nzero-shot learning shows potential, performance varies depending on the problem\ndomains and image complexities. This study provides new insights into the\nstrengths and weaknesses of multimodal foundation models for practical\nchallenges in Street View Imagery, Built Environment, and Interior. Overall,\nthe findings demonstrate foundational multimodal intelligence, emphasizing the\npotential of FMs to drive forward interdisciplinary applications at the\nintersection of computer vision and language.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}