{"id":"2408.16944","title":"FlowRetrieval: Flow-Guided Data Retrieval for Few-Shot Imitation\n  Learning","authors":"Li-Heng Lin, Yuchen Cui, Amber Xie, Tianyu Hua, Dorsa Sadigh","authorsParsed":[["Lin","Li-Heng",""],["Cui","Yuchen",""],["Xie","Amber",""],["Hua","Tianyu",""],["Sadigh","Dorsa",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 23:48:08 GMT"}],"updateDate":"2024-09-02","timestamp":1724975288000,"abstract":"  Few-shot imitation learning relies on only a small amount of task-specific\ndemonstrations to efficiently adapt a policy for a given downstream tasks.\nRetrieval-based methods come with a promise of retrieving relevant past\nexperiences to augment this target data when learning policies. However,\nexisting data retrieval methods fall under two extremes: they either rely on\nthe existence of exact behaviors with visually similar scenes in the prior\ndata, which is impractical to assume; or they retrieve based on semantic\nsimilarity of high-level language descriptions of the task, which might not be\nthat informative about the shared low-level behaviors or motions across tasks\nthat is often a more important factor for retrieving relevant data for policy\nlearning. In this work, we investigate how we can leverage motion similarity in\nthe vast amount of cross-task data to improve few-shot imitation learning of\nthe target task. Our key insight is that motion-similar data carries rich\ninformation about the effects of actions and object interactions that can be\nleveraged during few-shot adaptation. We propose FlowRetrieval, an approach\nthat leverages optical flow representations for both extracting similar motions\nto target tasks from prior data, and for guiding learning of a policy that can\nmaximally benefit from such data. Our results show FlowRetrieval significantly\noutperforms prior methods across simulated and real-world domains, achieving on\naverage 27% higher success rate than the best retrieval-based prior method. In\nthe Pen-in-Cup task with a real Franka Emika robot, FlowRetrieval achieves 3.7x\nthe performance of the baseline imitation learning technique that learns from\nall prior and target data. Website: https://flow-retrieval.github.io\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"iUuei7R9nWEXOjJZVaUx5-fZqRAglT1etDZAw5z_IsU","pdfSize":"12571041"}
