{"id":"2408.10404","title":"Accelerating Point Cloud Ground Segmentation: From Mechanical to\n  Solid-State Lidars","authors":"Xiao Zhang, Zhanhong Huang, Garcia Gonzalez Antony, and Xinming Huang","authorsParsed":[["Zhang","Xiao",""],["Huang","Zhanhong",""],["Antony","Garcia Gonzalez",""],["Huang","Xinming",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 20:39:21 GMT"},{"version":"v2","created":"Tue, 17 Sep 2024 18:23:16 GMT"}],"updateDate":"2024-09-19","timestamp":1724099961000,"abstract":"  In this study, we propose a novel parallel processing method for point cloud\nground segmentation, aimed at the technology evolution from mechanical to\nsolid-state Lidar (SSL). We first benchmark point-based, grid-based, and range\nimage-based ground segmentation algorithms using the SemanticKITTI dataset. Our\nresults indicate that the range image-based method offers superior performance\nand robustness, particularly in resilience to frame slicing. Implementing the\nproposed algorithm on an FPGA demonstrates significant improvements in\nprocessing speed and scalability of resource usage. Additionally, we develop a\ncustom dataset using camera-SSL equipment on our test vehicle to validate the\neffectiveness of the parallel processing approach for SSL frames in real world,\nachieving processing rates up to 30.9 times faster than CPU implementations.\nThese findings underscore the potential of parallel processing strategies to\nenhance Lidar technologies for advanced perception tasks in autonomous vehicles\nand robotics. The data and code will be available post-publication on our\nGitHub repository:\n\\url{https://github.com/WPI-APA-Lab/GroundSeg-Solid-State-Lidar-Parallel-Processing}\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Rb-JwyO9DaMa_WA5yUenPpPZvUTFv5QEic-tn2HHFu4","pdfSize":"9922112"}
