{"id":"2408.15668","title":"Movable Antennas Meet Intelligent Reflecting Surface: When Do We Need\n  Movable Antennas?","authors":"Xin Wei, Weidong Mei, Qingqing Wu, Boyu Ning, Zhi Chen","authorsParsed":[["Wei","Xin",""],["Mei","Weidong",""],["Wu","Qingqing",""],["Ning","Boyu",""],["Chen","Zhi",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 09:41:21 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 14:35:00 GMT"},{"version":"v3","created":"Sun, 1 Sep 2024 07:33:22 GMT"}],"updateDate":"2024-09-04","timestamp":1724838081000,"abstract":"  Intelligent reflecting surface (IRS) and movable antenna (MA)/fluid antenna\n(FA) techniques have both received increasing attention in the realm of\nwireless communications due to their ability to reconfigure and improve\nwireless channel conditions. In this paper, we investigate the integration of\nMAs/FAs into an IRS-assisted wireless communication system. In particular, we\nconsider the downlink transmission from a multi-MA base station (BS) to a\nsingle-antenna user with the aid of an IRS, aiming to maximize the user's\nreceived signal-to-noise ratio (SNR), by jointly optimizing the BS/IRS\nactive/passive beamforming and the MAs' positions. Due to the similar\ncapability of MAs and IRS for channel reconfiguration, we first conduct\ntheoretical analyses of the performance gain of MAs over conventional\nfixed-position antennas (FPAs) under the line-of-sight (LoS) BS-IRS channel and\nderive the conditions under which the performance gain becomes more or less\nsignificant. Next, to solve the received SNR maximization problem, we propose\nan alternating optimization (AO) algorithm that decomposes it into two\nsubproblems and solve them alternately. Numerical results are provided to\nvalidate our analytical results and evaluate the performance gains of MAs over\nFPAs under different setups.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}