{"id":"2408.12142","title":"MDD-5k: A New Diagnostic Conversation Dataset for Mental Disorders\n  Synthesized via Neuro-Symbolic LLM Agents","authors":"Congchi Yin, Feng Li, Shu Zhang, Zike Wang, Jun Shao, Piji Li, Jianhua\n  Chen, Xun Jiang","authorsParsed":[["Yin","Congchi",""],["Li","Feng",""],["Zhang","Shu",""],["Wang","Zike",""],["Shao","Jun",""],["Li","Piji",""],["Chen","Jianhua",""],["Jiang","Xun",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 05:59:47 GMT"}],"updateDate":"2024-08-23","timestamp":1724306387000,"abstract":"  The clinical diagnosis of most mental disorders primarily relies on the\nconversations between psychiatrist and patient. The creation of such diagnostic\nconversation datasets is promising to boost the AI mental healthcare community.\nHowever, directly collecting the conversations in real diagnosis scenarios is\nnear impossible due to stringent privacy and ethical considerations. To address\nthis issue, we seek to synthesize diagnostic conversation by exploiting\nanonymous patient cases that are easier to access. Specifically, we design a\nneuro-symbolic multi-agent framework for synthesizing the diagnostic\nconversation of mental disorders with large language models. It takes patient\ncase as input and is capable of generating multiple diverse conversations with\none single patient case. The framework basically involves the interaction\nbetween a doctor agent and a patient agent, and achieves text generation under\nsymbolic control via a dynamic diagnosis tree from a tool agent. By applying\nthe proposed framework, we develop the largest Chinese mental disorders\ndiagnosis dataset MDD-5k, which is built upon 1000 cleaned real patient cases\nby cooperating with a pioneering psychiatric hospital, and contains 5000\nhigh-quality long conversations with diagnosis results as labels. To the best\nof our knowledge, it's also the first labelled Chinese mental disorders\ndiagnosis dataset. Human evaluation demonstrates the proposed MDD-5k dataset\nsuccessfully simulates human-like diagnostic process of mental disorders. The\ndataset and code will become publicly accessible in\nhttps://github.com/lemonsis/MDD-5k.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}