{"id":"2408.02113","title":"Dise\\~no de sonido para producciones audiovisuales e historias sonoras\n  en el aula. Hacia una docencia creativa mediante el uso de herramientas\n  inteligentes","authors":"Miguel Civit and Francisco Cuadrado","authorsParsed":[["Civit","Miguel",""],["Cuadrado","Francisco",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 18:54:59 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 11:44:10 GMT"}],"updateDate":"2024-08-13","timestamp":1722797699000,"abstract":"  This study aims to share a teaching experience teaching sound design for\naudiovisual productions and compares different projects tackled by students. It\nis not intended to be a comparative analysis of different types of teaching but\nrather an analysis of different problems observed in different profiles of\nstudents of the subject who study it in different grades. The world of audio\ncan be very interesting for a large part of the students, both those with\ncreative and technical inclinations. Musical creation and production,\nsynchronization with images, dubbing, etc. They are disciplines that are\ngenerally interesting but can have a very high barrier to entry due to their\ngreat technical complexity. Sometimes it can take weeks or even months for the\nuninitiated to begin to use audio editing programs with the necessary ease,\nwhich are not always particularly intuitive for students. Learning through the\nuse of PBL methodologies generates, in our experience, results much superior to\nthose that can be observed through the use of other teaching methods such as\nmaster classes. Students acquire technical skills while developing creative\nprojects in which they get personally involved. Despite everything mentioned\nabove, most interactions between teachers and students focus on aspects of\ntechnical correction. From different parameters in reverbs (such as pre-delay,\ndecay, modulation...) to how to correctly adjust compressors, noise gates,\netc.; The number of tools with which to work with audio is incredibly\nextensive, as well as many of its features that can present serious differences\ndepending on their manufacturers.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multimedia","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"zTK4FVaGZIWlFao3embKOGj9xC-xLiH8XprTPj6rQTc","pdfSize":"541099"}
