{"id":"2408.03916","title":"Building spectral templates and reconstructing parameters for core\n  collapse supernovae with CASTOR","authors":"Andrea Simongini, Fabio Ragosta, Silvia Piranomonte and Irene Di Palma","authorsParsed":[["Simongini","Andrea",""],["Ragosta","Fabio",""],["Piranomonte","Silvia",""],["Di Palma","Irene",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 17:22:11 GMT"}],"updateDate":"2024-08-08","timestamp":1723051331000,"abstract":"  The future of time-domain optical astronomy relies on the development of\ntechniques and software capable of handling a rising amount of data and\ngradually complementing, or replacing if necessary, real observations. Next\ngeneration surveys, like the Large Synoptic Survey Telescope (LSST), will open\nthe door to the new era of optical astrophysics, creating, at the same time, a\ndeficiency in spectroscopic data necessary to confirm the nature of each event\nand to fully recover the parametric space. In this framework, we developed Core\ncollApse Supernovae parameTers estimatOR (CASTOR), a novel software for data\nanalysis. CASTOR combines Gaussian Process and other Machine Learning\ntechniques to build time-series templates of synthetic spectra and to estimate\nparameters of core collapse supernovae for which only multi-band photometry is\navailable. Techniques to build templates are fully data driven and\nnon-parametric through empirical and robust models, and rely on the direct\ncomparison with a training set of 111 core collapse supernovae from the\nliterature. Furthermore, CASTOR employees the real photometric data and the\nreconstructed synthetic spectra of an event to estimate parameters that belong\nto the supernova ejecta, to the stellar progenitor and to the event itself, in\na rapid and user-friendly framework. In this work we provide a demonstration of\nhow CASTOR works, studying available data from SN2015ap and comparing our\nresults with those available in literature.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}