{"id":"2408.12881","title":"Spectroscopic Analysis of Singly Heavy Pentaquarks in the Symmetric\n  15-Plet Representation Using Phenomenological Models","authors":"Ankush Sharma, Alka Upadhyay","authorsParsed":[["Sharma","Ankush",""],["Upadhyay","Alka",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 07:34:05 GMT"}],"updateDate":"2024-08-26","timestamp":1724398445000,"abstract":"  We analyze the ground state pentaquark structures with a single heavy quark\n($qqqq\\Bar{Q}$) using various phenomenological models. The recent observations\nof singly heavy tetraquark structures at LHCb serve as a significant motivation\nfor this investigation. We studied the symmetric 15-plet configuration of SU(3)\nflavor representation with the spin-parity assignment of $5/2^-$, representing\nthe symmetric spin state for the pentaquark systems. We employed an extended\nGursey-Radicati mass formula and an effective mass scheme to compute the mass\nspectra of pentaquark states. Additionally, the methodology of the screened\ncharge scheme is introduced to calculate the magnetic moment assignments,\nspecifically for configurations involving both charm and bottom quarks. We also\nproposed the potential production modes originating from the weak decay of\nheavy baryons. We identified the strong decay channels where pentaquark\ntransitions into a light baryon and a heavy meson. Our analysis of mass\nspectra, magnetic moments, and possible strong decay channels helps us to\nexplore the inner structure of pentaquarks and their underlying quark dynamics.\nThis work not only augments the theoretical frameworks used to describe such\nsystems but is also helpful for future experimental pursuits at facilities like\nLHCb, fostering further experimental validations and discoveries in heavy quark\nspectroscopy.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zdXV-kf8eBHZ4ZPwfx9I4IEr40uIj888RXzRsBjVTJk","pdfSize":"494589"}
