{"id":"2408.10138","title":"Angstrom-scale ion-beam engineering of ultrathin buried oxides for\n  quantum and neuro-inspired computing","authors":"N. Smirnov, E. Krivko, D. Moskaleva, D. Moskalev, A. Solovieva, V.\n  Echeistov, E. Zikiy, N. Korshakov, A. Ivanov, E. Malevannaya, A. Matanin, V.\n  Polozov, M. Teleganov, N. Zhitkov, R. Romashkin, I. Korobenko, A. Yanilkin,\n  A. Lebedev, I. Ryzhikov, A. Andriyash and I. Rodionov","authorsParsed":[["Smirnov","N.",""],["Krivko","E.",""],["Moskaleva","D.",""],["Moskalev","D.",""],["Solovieva","A.",""],["Echeistov","V.",""],["Zikiy","E.",""],["Korshakov","N.",""],["Ivanov","A.",""],["Malevannaya","E.",""],["Matanin","A.",""],["Polozov","V.",""],["Teleganov","M.",""],["Zhitkov","N.",""],["Romashkin","R.",""],["Korobenko","I.",""],["Yanilkin","A.",""],["Lebedev","A.",""],["Ryzhikov","I.",""],["Andriyash","A.",""],["Rodionov","I.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 16:38:48 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 11:58:38 GMT"}],"updateDate":"2024-08-22","timestamp":1724085528000,"abstract":"  Multilayer nanoscale systems incorporating buried ultrathin tunnel oxides, 2D\nmaterials, and solid electrolytes are crucial for next-generation logics,\nmemory, quantum and neuro-inspired computing. Still, an ultrathin layer control\nat angstrom scale is challenging for cutting-edge applications. Here we\nintroduce a scalable approach utilizing focused ion-beam annealing for buried\nultrathin oxides engineering with angstrom-scale thickness control. Our\nmolecular dynamics simulations of Ne+ irradiation on Al/a-AlOx/Al structure\nconfirms the pivotal role of ion generated crystal defects. We experimentally\ndemonstrate its performance on Josephson junction tunning in the resistance\nrange of 2 to 37% with a standard deviation of 0.86% across 25x25 mm chip.\nMoreover, we showcase +-17 MHz frequency control (+-0.172 A tunnel barrier\nthickness) for superconducting transmon qubits with coherence times up to 500\nus, which is promising for useful fault-tolerant quantum computing. This work\nensures ultrathin multilayer nanosystems engineering at the ultimate scale by\ndepth-controlled crystal defects generation.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Physics/Applied Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}