{"id":"2408.00904","title":"Demonstrating the Potential of Adaptive LMS Filtering on FPGA-Based\n  Qubit Control Platforms for Improved Qubit Readout in 2D and 3D Quantum\n  Processing Units","authors":"Hans Johnson, Nicholas Bornman, Taeyoon Kim, David Van Zanten, Silvia\n  Zorzetti, and Jafar Saniie","authorsParsed":[["Johnson","Hans",""],["Bornman","Nicholas",""],["Kim","Taeyoon",""],["Van Zanten","David",""],["Zorzetti","Silvia",""],["Saniie","Jafar",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 20:42:49 GMT"}],"updateDate":"2024-08-05","timestamp":1722544969000,"abstract":"  Advancements in quantum computing underscore the critical need for\nsophisticated qubit readout techniques to accurately discern quantum states.\nThis abstract presents our research intended for optimizing readout pulse\nfidelity for 2D and 3D Quantum Processing Units (QPUs), the latter coupled with\nSuperconducting Radio Frequency (SRF) cavities. Focusing specifically on the\napplication of the Least Mean Squares (LMS) adaptive filtering algorithm, we\nexplore its integration into the FPGA-based control systems to enhance the\naccuracy and efficiency of qubit state detection by improving Signal-to-Noise\nRatio (SNR). Implementing the LMS algorithm on the Zynq UltraScale+ RFSoC Gen 3\ndevices (RFSoC 4x2 FPGA and ZCU216 FPGA) using the Quantum Instrumentation\nControl Kit (QICK) open-source platform, we aim to dynamically test and adjust\nthe filtering parameters in real-time to characterize and adapt to the noise\nprofile presented in quantum computing readout signals. Our preliminary results\ndemonstrate the LMS filter's capability to maintain high readout accuracy while\nefficiently managing FPGA resources. These findings are expected to contribute\nto developing more reliable and scalable quantum computing architectures,\nhighlighting the pivotal role of adaptive signal processing in quantum\ntechnology advancements.\n","subjects":["Physics/Quantum Physics","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}