{"id":"2408.15810","title":"Multi-view Pose Fusion for Occlusion-Aware 3D Human Pose Estimation","authors":"Laura Bragagnolo, Matteo Terreran, Davide Allegro, and Stefano Ghidoni","authorsParsed":[["Bragagnolo","Laura",""],["Terreran","Matteo",""],["Allegro","Davide",""],["Ghidoni","Stefano",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 14:10:57 GMT"}],"updateDate":"2024-08-29","timestamp":1724854257000,"abstract":"  Robust 3D human pose estimation is crucial to ensure safe and effective\nhuman-robot collaboration. Accurate human perception,however, is particularly\nchallenging in these scenarios due to strong occlusions and limited camera\nviewpoints. Current 3D human pose estimation approaches are rather vulnerable\nin such conditions. In this work we present a novel approach for robust 3D\nhuman pose estimation in the context of human-robot collaboration. Instead of\nrelying on noisy 2D features triangulation, we perform multi-view fusion on 3D\nskeletons provided by absolute monocular methods. Accurate 3D pose estimation\nis then obtained via reprojection error optimization, introducing limbs length\nsymmetry constraints. We evaluate our approach on the public dataset Human3.6M\nand on a novel version Human3.6M-Occluded, derived adding synthetic occlusions\non the camera views with the purpose of testing pose estimation algorithms\nunder severe occlusions. We further validate our method on real human-robot\ncollaboration workcells, in which we strongly surpass current 3D human pose\nestimation methods. Our approach outperforms state-of-the-art multi-view human\npose estimation techniques and demonstrates superior capabilities in handling\nchallenging scenarios with strong occlusions, representing a reliable and\neffective solution for real human-robot collaboration setups.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dxxIMF1EM3y40qfzmpefhXm5o5pSfwD7zuTWa9gV-MA","pdfSize":"4590699"}
