{"id":"2408.07024","title":"The Gaia Ultracool Dwarf Sample -- V: The Ultracool Dwarf Companion\n  catalogue","authors":"Sayan Baig, R. L. Smart, Hugh R.A. Jones, Jonathan Gagn\\'e, D.J.\n  Pinfield, Gemma Cheng, Leslie Moranta","authorsParsed":[["Baig","Sayan",""],["Smart","R. L.",""],["Jones","Hugh R. A.",""],["Gagné","Jonathan",""],["Pinfield","D. J.",""],["Cheng","Gemma",""],["Moranta","Leslie",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 16:41:28 GMT"}],"updateDate":"2024-08-14","timestamp":1723567288000,"abstract":"  We present the Ultracool Dwarf Companion Catalogue of 278 multiple systems,\n32 of which are newly discovered, each with at least one spectroscopically\nconfirmed Ultracool Dwarf, within a 100 pc volume-limited sample. This\ncatalogue is compiled using the Gaia Catalogue of Nearby Stars for stellar\nprimaries and the Gaia Ultracool Dwarf Sample for low-mass companions and\nincludes 241 doubles, 33 triples, and 4 higher-order systems established from\npositional, proper motion, and parallax constraints. The catalogue seeks to\nidentify probable benchmark systems within 100 pc to obtain model-independent\nastrophysical parameters of Ultracool Dwarfs. Chance alignment probabilities\nare calculated to evaluate the physical nature of each system. Astrometric and\nphotometric data from Gaia Data Release 3 and the Two Micron All Sky Survey are\nincluded for all objects. We identify potential unseen companions using a\ncombination of the Renormalised Unit Weight Error, Image Parameter\nDetermination statistics, Non-Single Star solutions, and photometric blending\nas provided by Gaia, identifying hierarchical Ultracool triple systems. Our\ncatalogue includes 17 White Dwarf - Ultracool Dwarf systems, whose ages are\ndetermined using cooling models. We also use the Gaia FLAME results and the\nBANYAN $\\Sigma$ procedures to age 40 and 34 systems respectively, and derive\nmass estimates from evolutionary models.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}