{"id":"2408.00142","title":"Machine Learning Boosted Entropy-Engineered Synthesis of stable\n  Nanometric Solid Solution CuCo Alloys for Efficient Nitrate Reduction to\n  Ammonia","authors":"Yao Hu, Haihui Lan, Bo Hu, Jiaxuan Gong, Donghui Wang, Wen-Da Zhang,\n  Mo Yan, Huicong Xia, Mingde Yao, Mingliang Du","authorsParsed":[["Hu","Yao",""],["Lan","Haihui",""],["Hu","Bo",""],["Gong","Jiaxuan",""],["Wang","Donghui",""],["Zhang","Wen-Da",""],["Yan","Mo",""],["Xia","Huicong",""],["Yao","Mingde",""],["Du","Mingliang",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 20:02:04 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 18:01:21 GMT"}],"updateDate":"2024-08-08","timestamp":1722456124000,"abstract":"  Nanometric solid solution alloys are utilized in a broad range of fields,\nincluding catalysis, energy storage, medical application, and sensor\ntechnology. Unfortunately, the synthesis of these alloys becomes increasingly\nchallenging as the disparity between the metal elements grows, due to\ndifferences in atomic sizes, melting points, and chemical affinities. This\nstudy utilized a data-driven approach incorporating sample balancing\nenhancement techniques and multilayer perceptron (MLP) algorithms to improve\nthe model's ability to handle imbalanced data, significantly boosting the\nefficiency of experimental parameter optimization. Building on this enhanced\ndata processing framework, we developed an entropy-engineered synthesis\napproach specifically designed to produce stable, nanometric copper and cobalt\n(CuCo) solid solution alloys. Under conditions of -0.425 V (vs. RHE), the CuCo\nalloy exhibited nearly 100% Faraday efficiency (FE) and a high ammonia\nproduction rate of 232.17 mg h-1 mg-1. Stability tests in a simulated\nindustrial environment showed that the catalyst maintained over 80% FE and an\nammonia production rate exceeding 170 mg h-1 mg-1 over a testing period of 120\nhours, outperforming most reported catalysts. To delve deeper into the\nsynergistic interaction mechanisms between Cu and Co, in situ Raman\nspectroscopy was utilized for realtime monitoring, and density functional\ntheory (DFT) calculations further substantiated our findings. These results not\nonly highlight the exceptional catalytic performance of the CuCo alloy but also\nreflect the effective electronic and energy interactions between the two\nmetals.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}