{"id":"2408.00096","title":"From Attributes to Natural Language: A Survey and Foresight on\n  Text-based Person Re-identification","authors":"Fanzhi Jiang, Su Yang, Mark W. Jones, Liumei Zhang","authorsParsed":[["Jiang","Fanzhi",""],["Yang","Su",""],["Jones","Mark W.",""],["Zhang","Liumei",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:16:18 GMT"}],"updateDate":"2024-08-02","timestamp":1722449778000,"abstract":"  Text-based person re-identification (Re-ID) is a challenging topic in the\nfield of complex multimodal analysis, its ultimate aim is to recognize specific\npedestrians by scrutinizing attributes/natural language descriptions. Despite\nthe wide range of applicable areas such as security surveillance, video\nretrieval, person tracking, and social media analytics, there is a notable\nabsence of comprehensive reviews dedicated to summarizing the text-based person\nRe-ID from a technical perspective. To address this gap, we propose to\nintroduce a taxonomy spanning Evaluation, Strategy, Architecture, and\nOptimization dimensions, providing a comprehensive survey of the text-based\nperson Re-ID task. We start by laying the groundwork for text-based person\nRe-ID, elucidating fundamental concepts related to attribute/natural\nlanguage-based identification. Then a thorough examination of existing\nbenchmark datasets and metrics is presented. Subsequently, we further delve\ninto prevalent feature extraction strategies employed in text-based person\nRe-ID research, followed by a concise summary of common network architectures\nwithin the domain. Prevalent loss functions utilized for model optimization and\nmodality alignment in text-based person Re-ID are also scrutinized. To\nconclude, we offer a concise summary of our findings, pinpointing challenges in\ntext-based person Re-ID. In response to these challenges, we outline potential\navenues for future open-set text-based person Re-ID and present a baseline\narchitecture for text-based pedestrian image generation-guided\nre-identification(TBPGR).\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"LuqrPy0WWt2O432obJh-E3q7mwwC2FNTCMUi6eUXmsg","pdfSize":"2205736","txDigest":"2qabVLCUA2sg2Sir7YGyovUUAx1e3HdzuxKa9B9BD52k","endEpoch":"100","status":"CERTIFIED"}
