{"id":"2408.08658","title":"Online Matching with Delays and Size-based Costs","authors":"Yasushi Kawase and Tomohiro Nakayoshi","authorsParsed":[["Kawase","Yasushi",""],["Nakayoshi","Tomohiro",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 10:59:55 GMT"}],"updateDate":"2024-08-19","timestamp":1723805995000,"abstract":"  In this paper, we introduce the problem of Online Matching with Delays and\nSize-based Costs (OMDSC). The OMDSC problem involves $m$ requests arriving\nonline. At any time, a group can be formed by matching any number of these\nrequests that have been received but are still unmatched. The cost associated\nwith each group is determined by the waiting time for each request within the\ngroup and a size-dependent cost. Our goal is to partition all incoming requests\ninto multiple groups while minimizing the total associated cost. The problem\nextends the TCP acknowledgment problem proposed by Dooly et al. (JACM 2001). It\ngeneralizes the cost model for sending acknowledgments. This paper reveals the\ncompetitive ratios for a fundamental case where the range of the penalty\nfunction is limited to $0$ and $1$. We classify such penalty functions into\nthree distinct cases: (i) a fixed penalty of $1$ regardless of group size, (ii)\na penalty of $0$ if and only if the group size is a multiple of a specific\ninteger $k$, and (iii) other situations. The problem of case (i) is equivalent\nto the TCP acknowledgment problem, for which Dooly et al. proposed a\n$2$-competitive algorithm. For case (ii), we first show that natural algorithms\nthat match all the remaining requests are $\\Omega(\\sqrt{k})$-competitive. We\nthen propose an $O(\\log k / \\log \\log k)$-competitive deterministic algorithm\nby carefully managing match size and timing, and we also prove its optimality.\nFor case (iii), we demonstrate the non-existence of a competitive online\nalgorithm. Additionally, we discuss competitive ratios for other typical\npenalty functions.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}