{"id":"2408.13314","title":"Finding the Fuse: Prospects for the Detection and Characterization of\n  Hydrogen-Rich Core-Collapse Supernova Precursor Emission with the LSST","authors":"A. Gagliano, E. Berger, V. A. Villar, D. Hiramatsu, R. Kessler, T.\n  Matsumoto, A. Gilkis, and E. Laplace","authorsParsed":[["Gagliano","A.",""],["Berger","E.",""],["Villar","V. A.",""],["Hiramatsu","D.",""],["Kessler","R.",""],["Matsumoto","T.",""],["Gilkis","A.",""],["Laplace","E.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 18:00:11 GMT"}],"updateDate":"2024-08-27","timestamp":1724436011000,"abstract":"  Enhanced emission in the months to years preceding explosion has been\ndetected for several core-collapse supernovae (SNe). Though the physical\nmechanisms driving the emission remain hotly debated, the light curves of\ndetected events show long-lived ($\\geq$50 days), plateau-like behavior,\nsuggesting hydrogen recombination may significantly contribute to the total\nenergy budget. The Vera C. Rubin Observatory's Legacy Survey of Space and Time\n(LSST) will provide a decade-long photometric baseline to search for this\nemission, both in binned pre-explosion observations after an SN is detected and\nin single-visit observations prior to the SN explosion. In anticipation of\nthese searches, we simulate a range of eruptive precursor models to\ncore-collapse SNe and forecast the discovery rates of these phenomena in LSST\ndata. We find a detection rate of ~40-130 yr$^{-1}$ for SN IIP/IIL precursors\nand ~110 yr$^{-1}$ for SN IIn precursors in single-epoch photometry.\nConsidering the first three years of observations with the effects of rolling\nand observing triplets included, this number grows to a total of 150-400 in\nbinned photometry, with the highest number recovered when binning in 100-day\nbins for 2020tlf-like precursors and in 20-day bins for other\nrecombination-driven models from the literature. We quantify the impact of\nusing templates contaminated by residual light (from either long-lived or\nseparate precursor emission) on these detection rates, and explore strategies\nfor estimating baseline flux to mitigate these issues. Spectroscopic follow-up\nof the eruptions preceding core-collapse SNe and detected with LSST will offer\nimportant clues to the underlying drivers of terminal-stage mass loss in\nmassive stars.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}