{"id":"2408.11018","title":"PIP-II Linac Cryogenic Distribution System Design Challenges","authors":"T. Banaszkiewicz (1), M. Chorowski (1), P. Duda (1), M. Stanclik (1),\n  R. Dhuley (2), A. Martinez (2), W. Soyars (2) (the PIP-II Collaboration) ((1)\n  Wroclaw University of Science and Technology, Wroclaw, Poland, (2) Fermi\n  National Accelerator Laboratory, Batavia, USA)","authorsParsed":[["Banaszkiewicz","T.",""],["Chorowski","M.",""],["Duda","P.",""],["Stanclik","M.",""],["Dhuley","R.",""],["Martinez","A.",""],["Soyars","W.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 17:17:08 GMT"}],"updateDate":"2024-08-21","timestamp":1724174228000,"abstract":"  The PIP-II linac Cryogenic Distribution System (CDS) is characterized by\nextremely small heat inflows and robust mechanical design. It consists of a\nDistribution Valve Box (DVB), Intermediate Transfer Line, Tunnel Transfer Line,\ncomprising 25 Bayonet Cans, and ends with a Turnaround Can. Multiple helium\nstreams, each characterized by distinct helium parameters, flow through each of\nthese elements. The CDS geometry allows maintaining an acceptable pressure drop\nfor each helium stream, considering the planned flows and helium parameters in\ndifferent operation modes. This is particularly crucial for the return line of\nhelium vapors, which return from cryomodules to the cold compressors and thus\nhave very restrictive pressure drop requirements. On both sides of the DVB\nthere are fixed supports for process pipes. One of the DVB design challenges\nwas to route the process pipes in such a way that their shape provided\nsufficient compensation for thermal shrinkage. This ensures th at the forces\nresulting from thermal shrinkage acting on the cryogenic valves remain at a\nlevel acceptable to the manufacturer. The required thermal budget of the CDS\nwas achieved by thermo-mechanical optimization of its components, like process\npipes fixed supports in Bayonet Cans.\n","subjects":["Physics/Accelerator Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9IwhnwsOi-gzBFmo8Bc8KPhhINMYsv6-yKXRzitV948","pdfSize":"1935017"}
