{"id":"2408.00753","title":"A deep learning-enabled smart garment for versatile sleep behaviour\n  monitoring","authors":"Chenyu Tang, Wentian Yi, Muzi Xu, Yuxuan Jin, Zibo Zhang, Xuhang Chen,\n  Caizhi Liao, Peter Smielewski, Luigi G. Occhipinti","authorsParsed":[["Tang","Chenyu",""],["Yi","Wentian",""],["Xu","Muzi",""],["Jin","Yuxuan",""],["Zhang","Zibo",""],["Chen","Xuhang",""],["Liao","Caizhi",""],["Smielewski","Peter",""],["Occhipinti","Luigi G.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 17:56:25 GMT"}],"updateDate":"2024-08-02","timestamp":1722534985000,"abstract":"  Continuous monitoring and accurate detection of complex sleep patterns\nassociated to different sleep-related conditions is essential, not only for\nenhancing sleep quality but also for preventing the risk of developing chronic\nillnesses associated to unhealthy sleep. Despite significant advances in\nresearch, achieving versatile recognition of various unhealthy and sub-healthy\nsleep patterns with simple wearable devices at home remains a significant\nchallenge. Here, we report a robust and durable ultrasensitive strain sensor\narray printed on a smart garment, in its collar region. This solution allows\ndetecting subtle vibrations associated with multiple sleep patterns at the\nextrinsic laryngeal muscles. Equipped with a deep learning neural network, it\ncan precisely identify six sleep states-nasal breathing, mouth breathing,\nsnoring, bruxism, central sleep apnea (CSA), and obstructive sleep apnea\n(OSA)-with an impressive accuracy of 98.6%, all without requiring specific\npositioning. We further demonstrate its explainability and generalization\ncapabilities in practical applications. Explainable artificial intelligence\n(XAI) visualizations reflect comprehensive signal pattern analysis with low\nbias. Transfer learning tests show that the system can achieve high accuracy\n(overall accuracy of 95%) on new users with very few-shot learning (less than\n15 samples per class). The scalable manufacturing process, robustness, high\naccuracy, and excellent generalization of the smart garment make it a promising\ntool for next-generation continuous sleep monitoring.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3RHhuiUKZicO_JW9ZQtB3ccxuWwsh86iH9hGoM86RZU","pdfSize":"5251376"}
