{"id":"2408.17199","title":"Numerical Simulation of a Two-Dimensional Blume-Capel Ferromagnet in an\n  Oscillating Magnetic Field with a Constant Bias","authors":"Celeste Mendes and Gloria M. Buendia and Per Arne Rikvold","authorsParsed":[["Mendes","Celeste",""],["Buendia","Gloria M.",""],["Rikvold","Per Arne",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 10:53:09 GMT"},{"version":"v2","created":"Tue, 17 Sep 2024 14:24:23 GMT"}],"updateDate":"2024-09-18","timestamp":1725015189000,"abstract":"  We perform a numerical study of the kinetic Blume-Capel (BC) model to find if\nit exhibits the metamagnetic anomalies previously observed in the kinetic Ising\nmodel for supercritical periods. We employ a heat-bath Monte Carlo (MC)\nalgorithm on a square lattice in which spins can take values of $\\pm 1, 0$,\nwith a non-zero crystal field, subjected to a sinusoidal oscillating field in\nconjunction with a constant bias. In the ordered region, we find an equivalent\nhysteretic response of the order parameters with its respective conjugate\nfields between the kinetic and the equilibrium model. In the disordered region\n(supercritical periods), we observed two peaks, symmetrical with respect to\nzero bias, in the susceptibility and scaled variance curves, consistent with\nthe numerical and experimental findings on the kinetic Ising model. This\nbehavior does not have a counterpart in the equilibrium model. Furthermore, we\nfind that the peaks occur at higher values of the bias field and become\nprogressively smaller as the density of zeros, or the amplitude of the\noscillating field, increases. Using nucleation theory, we demonstrate that\nthese fluctuations, as in the Ising model, are not a critical phenomenon, but\nthat they are associated with a crossover between a single-droplet (SD) and a\nmulti-droplet (MD) magnetization switching mechanism. For strong (weak) bias,\nthe SD (MD) mechanism dominates. We also found that the zeros concentrate on\nthe droplets' surfaces, which may cause a reduced interface tension in\ncomparison with the Ising model . Our results suggest that metamagnetic\nanomalies are not particular to the kinetic Ising model, but rather are a\ngeneral characteristic of spin kinetic models, and provide further evidence\nthat the equivalence between dynamical phase transitions and equilibrium ones\nis only valid near the critical point.\n","subjects":["Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}