{"id":"2408.10798","title":"Universal Novelty Detection Through Adaptive Contrastive Learning","authors":"Hossein Mirzaei, Mojtaba Nafez, Mohammad Jafari, Mohammad Bagher\n  Soltani, Mohammad Azizmalayeri, Jafar Habibi, Mohammad Sabokrou, Mohammad\n  Hossein Rohban","authorsParsed":[["Mirzaei","Hossein",""],["Nafez","Mojtaba",""],["Jafari","Mohammad",""],["Soltani","Mohammad Bagher",""],["Azizmalayeri","Mohammad",""],["Habibi","Jafar",""],["Sabokrou","Mohammad",""],["Rohban","Mohammad Hossein",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 12:46:23 GMT"}],"updateDate":"2024-08-21","timestamp":1724157983000,"abstract":"  Novelty detection is a critical task for deploying machine learning models in\nthe open world. A crucial property of novelty detection methods is\nuniversality, which can be interpreted as generalization across various\ndistributions of training or test data. More precisely, for novelty detection,\ndistribution shifts may occur in the training set or the test set. Shifts in\nthe training set refer to cases where we train a novelty detector on a new\ndataset and expect strong transferability. Conversely, distribution shifts in\nthe test set indicate the methods' performance when the trained model\nencounters a shifted test sample. We experimentally show that existing methods\nfalter in maintaining universality, which stems from their rigid inductive\nbiases. Motivated by this, we aim for more generalized techniques that have\nmore adaptable inductive biases. In this context, we leverage the fact that\ncontrastive learning provides an efficient framework to easily switch and adapt\nto new inductive biases through the proper choice of augmentations in forming\nthe negative pairs. We propose a novel probabilistic auto-negative pair\ngeneration method AutoAugOOD, along with contrastive learning, to yield a\nuniversal novelty detector method. Our experiments demonstrate the superiority\nof our method under different distribution shifts in various image benchmark\ndatasets. Notably, our method emerges universality in the lens of adaptability\nto different setups of novelty detection, including one-class, unlabeled\nmulti-class, and labeled multi-class settings. Code:\nhttps://github.com/mojtaba-nafez/UNODE\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}