{"id":"2408.09938","title":"Minimal Sensor Placement for Generic State and Unknown Input\n  Observability","authors":"Ranbo Cheng, Yuan Zhang, Amin MD Al, and Yuanqing Xia","authorsParsed":[["Cheng","Ranbo",""],["Zhang","Yuan",""],["Al","Amin MD",""],["Xia","Yuanqing",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 12:20:35 GMT"}],"updateDate":"2024-08-20","timestamp":1724070035000,"abstract":"  This paper addresses the problem of selecting the minimum number of dedicated\nsensors to achieve observability in the presence of unknown inputs, namely, the\nstate and input observability, for linear time-invariant systems. We assume\nthat the only available information is the zero-nonzero structure of system\nmatrices, and approach this problem within a structured system model. We\nrevisit the concept of state and input observability for structured systems,\nproviding refined necessary and sufficient conditions for placing dedicated\nsensors via the Dulmage-Mendelsohn decomposition. Based on these conditions, we\nprove that determining the minimum number of dedicated sensors to achieve\ngeneric state and input observability is NP-hard, which contrasts sharply with\nthe polynomial-time complexity of the corresponding problem with known inputs.\nWe also demonstrate that this problem is hard to approximate within a factor of\n$(1-o(1)){\\rm{log}}(n)$, where $n$ is the state dimension. Notwithstanding, we\npropose nontrivial upper and lower bounds that can be computed in polynomial\ntime, which confine the optimal value of this problem to an interval with\nlength being the number of inputs. We further present a special case for which\nthe exact optimal value can be determined in polynomial time. Additionally, we\npropose a two-stage algorithm to solve this problem approximately. Each stage\nof the algorithm is either optimal or suboptimal and can be completed in\npolynomial time.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}