{"id":"2408.04164","title":"Molecular dynamics simulations of head-on low-velocity collisions\n  between particles","authors":"Yuki Yoshida, Eiichiro Kokubo, Hidekazu Tanaka","authorsParsed":[["Yoshida","Yuki",""],["Kokubo","Eiichiro",""],["Tanaka","Hidekazu",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 02:23:34 GMT"}],"updateDate":"2024-08-09","timestamp":1723083814000,"abstract":"  The particle contact model is important for powder simulations. Although\nseveral contact models have been proposed, their validity has not yet been well\nestablished. Therefore, we perform molecular dynamics (MD) simulations to\nclarify the particle interaction. We simulate head-on collisions of two\nparticles with impact velocities less than a few percent of the sound velocity\nto investigate the dependence of the interparticle force and the coefficient of\nrestitution (COR) on the impact velocity and particle radius. In this study, we\ntreat particles with a radius of 10-100 nm and perform simulations. We find\nthat the interparticle force exhibits hysteresis between the loading and\nunloading phases. Larger impact velocities result in strong hysteresis and\nplastic deformation. For all impact velocities and particle radii, the\ncoefficient of restitution is smaller than that given by the\nJohnson-Kendall-Robert theory. An inelastic contact model cannot reproduce our\nMD simulations. In particular, the COR is significantly reduced when the impact\nvelocity exceeds a certain value. This significant energy dissipation cannot be\nexplained even by the contact models including plastic deformation. We also\nfind that the COR increases with increasing particle radius. We also find that\nthe previous contact models including plastic deformation cannot explain the\nstrong energy dissipation obtained in our MD simulations, although they agree\nwith the MD results for very low impact velocities. Accordingly, we have\nconstructed a new dissipative contact model in which the dissipative force\nincreases with the stress generated by collisions. The new stress dependent\nmodel successfully reproduces our MD results over a wider range of impact\nvelocities than the conventional models do. In addition, we proposed another,\nsimpler, dissipative contact model that can also reproduce the MD results.\n","subjects":["Condensed Matter/Soft Condensed Matter","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}