{"id":"2408.16933","title":"Network Inference in Public Administration: Questions, Challenges, and\n  Models of Causality","authors":"Travis A. Whetsell, Michael D. Siciliano","authorsParsed":[["Whetsell","Travis A.",""],["Siciliano","Michael D.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 22:29:19 GMT"}],"updateDate":"2024-09-02","timestamp":1724970559000,"abstract":"  Descriptive and inferential social network analysis has become common in\npublic administration studies of network governance and management. A large\nliterature has developed in two broad categories: antecedents of network\nstructure, and network effects and outcomes. A new topic is emerging on network\ninterventions that applies knowledge of network formation and effects to\nactively intervene in the social context of interaction. Yet, the question\nremains how might scholars deploy and determine the impact of network\ninterventions. Inferential network analysis has primarily focused on\nstatistical simulations of network distributions to produce probability\nestimates on parameters of interest in observed networks, e.g. ERGMs. There is\nless attention to design elements for causal inference in the network context,\nsuch as experimental interventions, randomization, control and comparison\nnetworks, and spillovers. We advance a number of important questions for\nnetwork research, examine important inferential challenges and other issues\nrelated to inference in networks, and focus on a set of possible network\ninference models. We categorize models of network inference into (i)\nobservational studies of networks, using descriptive and stochastic methods\nthat lack intervention, randomization, or comparison networks; (ii) simulation\nstudies that leverage computational resources for generating inference; (iii)\nnatural network experiments, with unintentional network-based interventions;\n(iv) network field experiments, with designed interventions accompanied by\ncomparison networks; and (v) laboratory experiments that design and implement\nrandomization to treatment and control networks. The article offers a guide to\nnetwork researchers interested in questions, challenges, and models of\ninference for network analysis in public administration.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/"}