{"id":"2408.06230","title":"The Distributionally Robust Infinite-Horizon LQR","authors":"Joudi Hajar, Taylan Kargin, Vikrant Malik, Babak Hassibi","authorsParsed":[["Hajar","Joudi",""],["Kargin","Taylan",""],["Malik","Vikrant",""],["Hassibi","Babak",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 15:33:26 GMT"}],"updateDate":"2024-08-13","timestamp":1723476806000,"abstract":"  We explore the infinite-horizon Distributionally Robust (DR) linear-quadratic\ncontrol. While the probability distribution of disturbances is unknown and\npotentially correlated over time, it is confined within a Wasserstein-2 ball of\na radius $r$ around a known nominal distribution. Our goal is to devise a\ncontrol policy that minimizes the worst-case expected Linear-Quadratic\nRegulator (LQR) cost among all probability distributions of disturbances lying\nin the Wasserstein ambiguity set. We obtain the optimality conditions for the\noptimal DR controller and show that it is non-rational. Despite lacking a\nfinite-order state-space representation, we introduce a computationally\ntractable fixed-point iteration algorithm. Our proposed method computes the\noptimal controller in the frequency domain to any desired fidelity. Moreover,\nfor any given finite order, we use a convex numerical method to compute the\nbest rational approximation (in $H_\\infty$-norm) to the optimal non-rational DR\ncontroller. This enables efficient time-domain implementation by finite-order\nstate-space controllers and addresses the computational hurdles associated with\nthe finite-horizon approaches to DR-LQR problems, which typically necessitate\nsolving a Semi-Definite Program (SDP) with a dimension scaling with the time\nhorizon. We provide numerical simulations to showcase the effectiveness of our\napproach.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"hSUbOyakwDVtIlyqcrymIGT0kpCqgOahEdwChOgctq0","pdfSize":"507655"}
