{"id":"2408.03145","title":"Quantum Simulations of Chemistry in First Quantization with any Basis\n  Set","authors":"Timothy N. Georges, Marius Bothe, Christoph S\\\"underhauf, Bjorn K.\n  Berntson, R\\'obert Izs\\'ak, Aleksei V. Ivanov","authorsParsed":[["Georges","Timothy N.",""],["Bothe","Marius",""],["Sünderhauf","Christoph",""],["Berntson","Bjorn K.",""],["Izsák","Róbert",""],["Ivanov","Aleksei V.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 12:40:32 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 15:58:52 GMT"}],"updateDate":"2024-08-13","timestamp":1722948032000,"abstract":"  Quantum computation of the energy of molecules and materials is one of the\nmost promising applications of fault-tolerant quantum computers. However,\npractical applications require algorithms with reduced resource requirements.\nPrevious work has mainly represented the Hamiltonian of the system in second\nquantization. Existing methods in first quantization are limited to grid-based\napproaches that do not allow for active space calculations. In this work, we\npresent a method to solve the generic ground-state chemistry problem in first\nquantization on a fault-tolerant quantum computer using any basis set. This\nallows for calculations in the active space using modern quantum chemistry\nbasis sets. We derive a linear-combination-of-unitaries decomposition for a\nchemical Hamiltonian in first quantization and then construct an efficient\nblock encoding, exploiting sparsity of the Hamiltonian. For active space\ncalculations using a molecular orbital basis set, we achieve an asymptotic\nspeed up in Toffoli-gate count compared to the equivalent method in second\nquantization [Berry, et. al. Quantum 3, 208 (2019)]. We also consider the dual\nplane waves for materials simulations and find that in physically interesting\nregimes we achieve orders of magnitude improvement in quantum resources\ncompared to the second quantization counterpart. In some instances, our\napproach provides similar or even lower resources compared to the first\nquantization plane wave algorithm of Refs.[Babbush, et. al npj Quantum Inf 5(1)\n92 (2019), Su et. al PRX Quantum 2(4), 040332 (2021)] that, unlike our\napproach, avoids loading the classical data from quantum memory. This work\nopens up possibilities to reduce quantum resources even further using\nfactorization methods of a Hamiltonian or modern pseudopotentials. Furthermore,\nour approach can be adapted to other applications, such as the vibrational\nproperties of chemical systems.\n","subjects":["Physics/Quantum Physics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}