{"id":"2408.15667","title":"Towards reliable respiratory disease diagnosis based on cough sounds and\n  vision transformers","authors":"Qian Wang, Zhaoyang Bu, Jiaxuan Mao, Wenyu Zhu, Jingya Zhao, Wei Du,\n  Guochao Shi, Min Zhou, Si Chen, Jieming Qu","authorsParsed":[["Wang","Qian",""],["Bu","Zhaoyang",""],["Mao","Jiaxuan",""],["Zhu","Wenyu",""],["Zhao","Jingya",""],["Du","Wei",""],["Shi","Guochao",""],["Zhou","Min",""],["Chen","Si",""],["Qu","Jieming",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 09:40:40 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 03:22:18 GMT"}],"updateDate":"2024-09-04","timestamp":1724838040000,"abstract":"  Recent advancements in deep learning techniques have sparked performance\nboosts in various real-world applications including disease diagnosis based on\nmulti-modal medical data. Cough sound data-based respiratory disease (e.g.,\nCOVID-19 and Chronic Obstructive Pulmonary Disease) diagnosis has also\nattracted much attention. However, existing works usually utilise traditional\nmachine learning or deep models of moderate scales. On the other hand, the\ndeveloped approaches are trained and evaluated on small-scale data due to the\ndifficulty of curating and annotating clinical data on scale. To address these\nissues in prior works, we create a unified framework to evaluate various deep\nmodels from lightweight Convolutional Neural Networks (e.g., ResNet18) to\nmodern vision transformers and compare their performance in respiratory disease\nclassification. Based on the observations from such an extensive empirical\nstudy, we propose a novel approach to cough-based disease classification based\non both self-supervised and supervised learning on a large-scale cough data\nset. Experimental results demonstrate our proposed approach outperforms prior\narts consistently on two benchmark datasets for COVID-19 diagnosis and a\nproprietary dataset for COPD/non-COPD classification with an AUROC of 92.5%.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}