{"id":"2408.09987","title":"Ultrabroadband Coherent Perfect Absorption with Composite Graphene\n  Metasurfaces","authors":"Wei Zou, Tianjing Guo, and Christos Argyropoulos","authorsParsed":[["Zou","Wei",""],["Guo","Tianjing",""],["Argyropoulos","Christos",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 13:37:25 GMT"}],"updateDate":"2024-08-30","timestamp":1724074645000,"abstract":"  We investigate the design and performance of a new multilayer graphene\nmetasurface for achieving ultrabroadband coherent perfect absorption (CPA) in\nthe THz regime. The proposed structure comprises of three graphene patterned\nmetasurfaces separated by thin dielectric spacer layers. The top and bottom\nmetasurfaces have cross shape unit cells with varying sizes, while the middle\ngraphene metasurface is square-shaped. This distinctive geometrical asymmetry\nand the presence of multiple layers within the structure facilitate the\nachievement of wideband asymmetric reflection under incoherent illumination.\nThis interesting property serves as a crucial step towards achieving near-total\nabsorption under coherent illumination across a broad frequency range.\nNumerical simulations demonstrate that the absorption efficiency surpasses 90%\nacross an ultrabroadband frequency range from 2.8 to 5.7 THz, i.e., bandwidth\nof 2.9 THz. The CPA effect can be selectively tuned by manipulating the phase\ndifference between the two incident coherent beams. Moreover, the absorption\nresponse can be dynamically adjusted by altering the Fermi level of graphene.\nThe study also examines the influence of geometric parameters on the absorption\ncharacteristics. The results of this research work offer valuable insights into\nthe design of broadband graphene metasurfaces for coherent absorption\napplications, and they contribute to the advancement of sophisticated optical\ndevices operating in the THz frequency range.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}