{"id":"2408.15516","title":"Predicting Parameter Change's Effect on Cellular Network Time Series","authors":"Mingjie Li, Yongqian Sun, Xiaolei Hua, Renkai Yu, Xinwen Fan, Lin Zhu,\n  Junlan Feng, Dan Pei","authorsParsed":[["Li","Mingjie",""],["Sun","Yongqian",""],["Hua","Xiaolei",""],["Yu","Renkai",""],["Fan","Xinwen",""],["Zhu","Lin",""],["Feng","Junlan",""],["Pei","Dan",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 04:04:31 GMT"}],"updateDate":"2024-08-29","timestamp":1724817871000,"abstract":"  The cellular network provides convenient network access for ever-growing\nmobile phones. During the continuous optimization, operators can adjust cell\nparameters to enhance the Quality of Service (QoS) flexibly. A precise\nprediction of the parameter change's effect can help operators make proper\nparameter adjustments. This work focuses on predicting cell status (like the\nworkload and QoS) after adjusting the cell parameters. The prediction will be\nconducted before an adjustment is actually applied to provide an early\ninspection. As it can be hard for available parameter adjustments with a\nlimited number to cover all the parameter and user behavior combinations, we\npropose ParaSeer fusing domain knowledge on parameter adjustments into\ndata-driven time series forecasting. ParaSeer organizes several pre-trained\nTransformers for adjustment-free time series forecasting, utilizing plenty of\nadjustment-free data. On the other hand, ParaSeer models the effect of\nadjusting the transmission power and cell individual offset (CIO) as a\nmultiplier for the workload. We derive a formula to calculate the multiplier\nfrom the underlying mechanism of those two parameters, helping ParaSeer\neliminate the thirst for data with parameter adjustments. We compare ParaSeer\nwith baselines on two real-world datasets, where ParaSeer outperforms the best\nbaseline by more than 25.8% in terms of RMSE. The extensive experiments further\nillustrate the contributions of ParaSeer's components.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}