{"id":"2408.02884","title":"Improved Electrical Conductivity of Copper and Nitrogen Functionalized\n  Carbon Nanotubes","authors":"Mina Yoon and German D. Samolyuk and Kai Li and James A. Hayne and\n  Tolga Aytug","authorsParsed":[["Yoon","Mina",""],["Samolyuk","German D.",""],["Li","Kai",""],["Hayne","James A.",""],["Aytug","Tolga",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 01:26:51 GMT"}],"updateDate":"2024-08-07","timestamp":1722907611000,"abstract":"  In this work, we investigate the electrical conductivity of carbon nanotubes\n(CNTs), with a particular focus on the effects of doping. Using a\nfirst-principles approach, we study the electronic structure, phonon\ndispersion, and electron-phonon scattering to understand the finite-temperature\nelectrical transport properties in CNTs. Our study covers both prototypical\nmetallic and semiconducting CNTs, with special emphasis on the influence of\ntypical defects such as vacancies and the incorporation of copper or nitrogen,\nsuch as pyridinic N, pyrrolic N, graphitic N, and oxidized N. Our theoretical\nstudy shows significant improvements in the electrical conduction properties of\ncopper-CNT composites, especially when semiconducting CNTs are functionalized\nwith nitrogen. Doping is found to cause significant changes in the electronic\ndensity of states near the Fermi level, which affects the electrical\nconductivity. Calculations show that certain types of functional groups, such\nas N-pyrrolic, result in a ~30-fold increase in the conductivity of\nsemiconducting CNTs compared to Cu-incorporated CNTs alone. For metallic CNTs,\nthe conductivity is in agreement with existing experimental data, and our\nprediction of significant increases in conductivity with N-pyrrolic functional\ngroup is consistent with recent experimental results, demonstrating the\neffectiveness of doping in modifying conductivity. Our study provides valuable\ninsight into the electronic properties of doped CNTs and contributes to the\ndevelopment of ultra-high conductivity CNT composites.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}