{"id":"2408.14384","title":"Eighteen new fast radio bursts in the High Time Resolution Universe\n  survey","authors":"M. Trudu, A. Possenti, M. Pilia, M. Bailes, E. F. Keane, M. Kramer, V.\n  Balakrishnan, S. Bhandari, N. D. R. Bhat, M. Burgay, A. Cameron, D. J.\n  Champion, A. Jameson, S. Johnston, M. J. Keith, L. Levin, C. Ng, R. Sengar\n  and C. Tiburzi","authorsParsed":[["Trudu","M.",""],["Possenti","A.",""],["Pilia","M.",""],["Bailes","M.",""],["Keane","E. F.",""],["Kramer","M.",""],["Balakrishnan","V.",""],["Bhandari","S.",""],["Bhat","N. D. R.",""],["Burgay","M.",""],["Cameron","A.",""],["Champion","D. J.",""],["Jameson","A.",""],["Johnston","S.",""],["Keith","M. J.",""],["Levin","L.",""],["Ng","C.",""],["Sengar","R.",""],["Tiburzi","C.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 16:06:46 GMT"}],"updateDate":"2024-08-27","timestamp":1724688406000,"abstract":"  Current observational evidence reveals that fast radio bursts (FRBs) exhibit\nbandwidths ranging from a few dozen MHz to several GHz. Traditional FRB\nsearches primarily employ matched filter methods on time series collapsed\nacross the entire observational bandwidth. However, with modern ultra-wideband\nreceivers featuring GHz-scale observational bandwidths, this approach may\noverlook a significant number of events. We investigate the efficacy of\nsub-banded searches for FRBs, a technique seeking bursts within limited\nportions of the bandwidth. These searches aim to enhance the significance of\nFRB detections by mitigating the impact of noise outside the targeted frequency\nrange, thereby improving signal-to-noise ratios. We conducted a series of Monte\nCarlo simulations, for the $400$-MHz bandwidth Parkes 21-cm multi-beam (PMB)\nreceiver system and the Parkes Ultra-Wideband Low (UWL) receiver, simulating\nbursts down to frequency widths of about $100$\\,MHz. Additionally, we performed\na complete reprocessing of the high-latitude segment of the High Time\nResolution Universe South survey (HTRU-S) of the Parkes-Murriyang telescope\nusing sub-banded search techniques. Simulations reveal that a sub-banded search\ncan enhance the burst search efficiency by $67_{-42}^{+133}$ % for the PMB\nsystem and $1433_{-126}^{+143}$ % for the UWL receiver. Furthermore, the\nreprocessing of HTRU led to the confident detection of eighteen new bursts,\nnearly tripling the count of FRBs found in this survey. These results\nunderscore the importance of employing sub-banded search methodologies to\neffectively address the often modest spectral occupancy of these signals.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yEDAk1PnJm1LF7OPqCYSlN2x41ZtScnvKUO8igxAebI","pdfSize":"6247438"}
