{"id":"2408.08818","title":"Revisiting the propagation of highly-energetic gamma rays in the Galaxy","authors":"Gaetano Di Marco, Rafael Alves Batista and Miguel \\'Angel\n  S\\'anchez-Conde","authorsParsed":[["Di Marco","Gaetano",""],["Batista","Rafael Alves",""],["Sánchez-Conde","Miguel Ángel",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 16:03:45 GMT"}],"updateDate":"2024-08-19","timestamp":1723824225000,"abstract":"  Recent gamma-ray observations have detected photons up to energies of a few\nPeV. These highly energetic gamma rays are emitted by the most powerful sources\nin the Galaxy. Propagating over astrophysical distances, gamma rays might\ninteract with background photons producing electron-positron pairs, then\ndeflected by astrophysical magnetic fields. In turn, these charged particles\nmight scatter through inverse Compton galactic radiation fields, triggering\nelectromagnetic cascades. In this scenario, the characterisation of\nastrophysical environment in which gamma rays travel, specifically background\nphotons and magnetic fields, is crucial. We explore the impact of propagation\neffects on observables at Earth by simulating galactic sources emitting gamma\nrays with energy between $100 \\; \\text{GeV}$ and $100 \\; \\text{PeV}$. We\nanalyse the imprint of the galactic environment on observed energy spectra and\narrival direction maps, revealing gamma-ray absorption features in the former\nand ``deflection\" of gamma rays in the latter. Specifically, owing to\ninterstellar radiation field spatial distribution and the galactic magnetic\nfield structure, propagation effects on observables are found to be related to\nthe specific gamma-ray source position and to the prompt emission model.\nDetailed investigations of the propagation effect on galactic gamma rays will\nimprove the robustness of both current and future gamma-ray detections and\nindirect dark matter searches.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}