{"id":"2408.13544","title":"Fragmented perspective of self-organized criticality and disorder in log\n  gravity","authors":"Yannick Mvondo-She","authorsParsed":[["Mvondo-She","Yannick",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 10:28:09 GMT"}],"updateDate":"2024-08-27","timestamp":1724495289000,"abstract":"  We use a statistical model to discuss nonequilibrium fragmentation phenomena\ntaking place in the stochastic dynamics of the log sector in log gravity. From\nthe canonical Gibbs model, a combinatorial analysis reveals an important aspect\nof the $n$-particle evolution previously shown to generate a collection of\nrandom partitions according to the Ewens distribution realized in a\ndisconnected double Hurwitz number in genus zero. By treating each possible\npartition as a member of an ensemble of fragmentations, and ensemble averaging\nover all partitions with the Hurwitz number as a special case of the Gibbs\ndistribution, a resulting distribution of cluster sizes appears to fall as a\npower of the size of the cluster. Dynamical systems that exhibit a distribution\nof sizes giving rise to a scale-invariant power-law behavior at a critical\npoint possess an important property called self-organized criticality. As a\ncorollary, the log sector of log gravity is a self-organized critical system at\nthe critical point $\\mu l =1$. A similarity between self-organized critical\nsystems, spin glass models and the dynamics of the log sector which exhibits\naging behavior reminiscent of glassy systems is pointed out by means of the\nP\\`{o}lya distribution, also known to classify various models of (randomly\nfragmented) disordered systems, and by presenting the cluster distribution in\nthe log sector of log gravity as a distinguished member of this probability\ndistribution.\n","subjects":["Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"S1-3V56fo5a77VbpE7rIcQILllU0tj2YfbWwXyCo-TQ","pdfSize":"195165"}
