{"id":"2408.16021","title":"XG-NID: Dual-Modality Network Intrusion Detection using a Heterogeneous\n  Graph Neural Network and Large Language Model","authors":"Yasir Ali Farrukh, Syed Wali, Irfan Khan and Nathaniel D. Bastian","authorsParsed":[["Farrukh","Yasir Ali",""],["Wali","Syed",""],["Khan","Irfan",""],["Bastian","Nathaniel D.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 01:14:34 GMT"}],"updateDate":"2024-08-30","timestamp":1724721274000,"abstract":"  In the rapidly evolving field of cybersecurity, the integration of flow-level\nand packet-level information for real-time intrusion detection remains a\nlargely untapped area of research. This paper introduces \"XG-NID,\" a novel\nframework that, to the best of our knowledge, is the first to fuse flow-level\nand packet-level data within a heterogeneous graph structure, offering a\ncomprehensive analysis of network traffic. Leveraging a heterogeneous graph\nneural network (GNN) with graph-level classification, XG-NID uniquely enables\nreal-time inference while effectively capturing the intricate relationships\nbetween flow and packet payload data. Unlike traditional GNN-based\nmethodologies that predominantly analyze historical data, XG-NID is designed to\naccommodate the heterogeneous nature of network traffic, providing a robust and\nreal-time defense mechanism. Our framework extends beyond mere classification;\nit integrates Large Language Models (LLMs) to generate detailed, human-readable\nexplanations and suggest potential remedial actions, ensuring that the insights\nproduced are both actionable and comprehensible. Additionally, we introduce a\nnew set of flow features based on temporal information, further enhancing the\ncontextual and explainable inferences provided by our model. To facilitate\npractical application and accessibility, we developed \"GNN4ID,\" an open-source\ntool that enables the extraction and transformation of raw network traffic into\nthe proposed heterogeneous graph structure, seamlessly integrating flow and\npacket-level data. Our comprehensive quantitative comparative analysis\ndemonstrates that XG-NID achieves an F1 score of 97\\% in multi-class\nclassification, outperforming existing baseline and state-of-the-art methods.\nThis sets a new standard in Network Intrusion Detection Systems by combining\ninnovative data fusion with enhanced interpretability and real-time\ncapabilities.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KN2QvdaBR6-8FVOYZweK1dU6D04Kz82aM1Wss6LxT84","pdfSize":"2916980"}
