{"id":"2408.02808","title":"Spectral statistics of the Laplacian on random covers of a closed\n  negatively curved surface","authors":"Julien Moy","authorsParsed":[["Moy","Julien",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 20:04:05 GMT"}],"updateDate":"2024-08-07","timestamp":1722888245000,"abstract":"  Let $(X,g)$ be a closed, connected surface, with variable negative curvature.\nWe consider the distribution of eigenvalues of the Laplacian on random covers\n$X_n\\to X$ of degree $n$. We focus on the ensemble variance of the smoothed\nnumber of eigenvalues of the square root of the positive Laplacian\n$\\sqrt{\\Delta}$ in windows $[\\lambda-\\frac 1L,\\lambda+\\frac 1L]$, over the set\nof $n$-sheeted covers of $X$. We first take the limit of large degree $n\\to\n+\\infty$, then we let the energy $\\lambda$ go to $+\\infty$ while the window\nsize $\\frac 1L$ goes to $0$. In this ad hoc limit, local energy averages of the\nvariance converge to an expression corresponding to the variance of the same\nstatistic when considering instead spectra of large random matrices of the\nGaussian Orthogonal Ensemble (GOE). By twisting the Laplacian with unitary\nrepresentations, we are able to observe different statistics, corresponding to\nthe Gaussian Unitary Ensemble (GUE) when time reversal symmetry is broken.\nThese results were shown by F. Naud for the model of random covers of a\nhyperbolic surface.\n  For an individual cover $X_n\\to X$, we consider spectral fluctuations of the\ncounting function on $X_n$ around the ensemble average. In the large energy\nregime, for a typical cover $X_n\\to X$ of large degree, these fluctuations are\nshown to approach the GOE result, a phenomenon called ergodicity in Random\nMatrix Theory. An analogous result for random covers of hyperbolic surfaces was\nobtained by Y. Maoz.\n","subjects":["Mathematics/Spectral Theory","Physics/Mathematical Physics","Mathematics/Dynamical Systems","Mathematics/Mathematical Physics","Mathematics/Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}