{"id":"2408.05300","title":"High-Precision Ringdown Surrogate Model for Non-Precessing Binary Black\n  Holes","authors":"Lorena Maga\\~na Zertuche, Leo C. Stein, Keefe Mitman, Scott E. Field,\n  Vijay Varma, Michael Boyle, Nils Deppe, Lawrence E. Kidder, Jordan Moxon,\n  Harald P. Pfeiffer, Mark A. Scheel, Kyle C. Nelli, William Throwe, and Nils\n  L. Vu","authorsParsed":[["Zertuche","Lorena Magaña",""],["Stein","Leo C.",""],["Mitman","Keefe",""],["Field","Scott E.",""],["Varma","Vijay",""],["Boyle","Michael",""],["Deppe","Nils",""],["Kidder","Lawrence E.",""],["Moxon","Jordan",""],["Pfeiffer","Harald P.",""],["Scheel","Mark A.",""],["Nelli","Kyle C.",""],["Throwe","William",""],["Vu","Nils L.",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 18:51:54 GMT"}],"updateDate":"2024-08-13","timestamp":1723229514000,"abstract":"  Highly precise and robust waveform models are required as improvements in\ndetector sensitivity enable us to test general relativity with more precision\nthan ever before. In this work, we introduce a spin-aligned surrogate ringdown\nmodel. This ringdown surrogate, NRSur3dq8_RD, is built with numerical waveforms\nproduced using Cauchy-characteristic evolution. In addition, these waveforms\nare in the superrest frame of the remnant black hole allowing us to do a\ncorrect analysis of the ringdown spectrum. The novel prediction of our\nsurrogate model is complex-valued quasinormal mode (QNM) amplitudes, with\nmedian relative errors of $10^{-2}-10^{-3}$ over the parameter space. Like\nprevious remnant surrogates, we also predict the remnant black hole's mass and\nspin. The QNM mode amplitude errors translate into median errors on ringdown\nwaveforms of $10^{-4}$. The high accuracy and QNM mode content provided by our\nsurrogate will enable high-precision ringdown analyses such as tests of general\nrelativity. Our ringdown model is publicly available through the python package\nsurfinBH.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}