{"id":"2408.05314","title":"rule4ml: An Open-Source Tool for Resource Utilization and Latency\n  Estimation for ML Models on FPGA","authors":"Mohammad Mehdi Rahimifar, Hamza Ezzaoui Rahali, Audrey C. Therrien","authorsParsed":[["Rahimifar","Mohammad Mehdi",""],["Rahali","Hamza Ezzaoui",""],["Therrien","Audrey C.",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 19:35:10 GMT"}],"updateDate":"2024-08-13","timestamp":1723232110000,"abstract":"  Implementing Machine Learning (ML) models on Field-Programmable Gate Arrays\n(FPGAs) is becoming increasingly popular across various domains as a\nlow-latency and low-power solution that helps manage large data rates generated\nby continuously improving detectors. However, developing ML models for FPGAs is\ntime-consuming, as optimization requires synthesis to evaluate FPGA area and\nlatency, making the process slow and repetitive. This paper introduces a novel\nmethod to predict the resource utilization and inference latency of Neural\nNetworks (NNs) before their synthesis and implementation on FPGA. We leverage\nHLS4ML, a tool-flow that helps translate NNs into high-level synthesis (HLS)\ncode, to synthesize a diverse dataset of NN architectures and train resource\nutilization and inference latency predictors. While HLS4ML requires full\nsynthesis to obtain resource and latency insights, our method uses trained\nregression models for immediate pre-synthesis predictions. The prediction\nmodels estimate the usage of Block RAM (BRAM), Digital Signal Processors (DSP),\nFlip-Flops (FF), and Look-Up Tables (LUT), as well as the inference clock\ncycles. The predictors were evaluated on both synthetic and existing benchmark\narchitectures and demonstrated high accuracy with R2 scores ranging between 0.8\nand 0.98 on the validation set and sMAPE values between 10% and 30%. Overall,\nour approach provides valuable preliminary insights, enabling users to quickly\nassess the feasibility and efficiency of NNs on FPGAs, accelerating the\ndevelopment and deployment processes. The open-source repository can be found\nat https://github.com/IMPETUS-UdeS/rule4ml, while the datasets are publicly\navailable at https://borealisdata.ca/dataverse/rule4ml.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"P4HGdsqkrcUOjXBSf_gY9enCotg9LLyp63-Yy8zJCxo","pdfSize":"5132002"}
