{"id":"2408.01190","title":"Spontaneous magnetization and effective interactions in QGP at high\n  temperature","authors":"Volodymyr Skalozub","authorsParsed":[["Skalozub","Volodymyr",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 11:18:14 GMT"}],"updateDate":"2024-08-05","timestamp":1722597494000,"abstract":"  In quark-gluon plasma (QGP), at higher deconfinement temperatures $T \\ge T_d$\nthe spontaneous generation of color magnetic fields, $b^3(T), b^8(T) \\not = 0$\n(3, 8 are color indexes), and usual magnetic field $b(T) \\not = 0$ happens.\nSimultaneously, the Polyakov loop and/or algebraically related to it $A_0(T)$\ncondensate, which is solution to Yang-Mills imaginary time equations, are also\ncreated. Usually, in analytic quantum field theory these effects are\ninvestigated independently of each other within the effective potentials having\ndifferent mathematical structures. The common generation of these condensates\nwas detected in lattice Monte Carlo simulations.\n  Recently, with the new type two-loop effective potential, which generalizes\nthe known integral representation for the Bernoulli polynomials and takes into\nconsideration the magnetic background, this effect has been derived\nanalytically.\n  The corresponding effective potential W(T, b^3, A_0 ) was investigated either\nin SU(2) gluodynamics or full QCD. The gauge fixing independence of it was\nproved within the Nielsen identity approach. The values of magnetic field\nstrengths at different temperatures were calculated and the mechanism of\nstabilizing fields due to A_0(T) condensate has been discovered. In the present\nreview, we describe this important phenomenon in more details, as well as a\nnumber of specific effects - induced color charges, effective\nphoton-photon-gluon vertexes - happening due to vacuum polarization at this\nbackground. They could serve as the signals of the QGP creation in the heavy\nion collision experiments.\n  Key words: spontaneous magnetization, high temperature, asymptotic freedom,\neffective potential, A_0 condensate, effective charge, effective vertexes.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"6xJEnJXriCCUWcQSrLJ4zKs_iGRnODpqc3xNoRGi1mM","pdfSize":"389824"}
