{"id":"2408.00046","title":"Measuring the speed of quantum particles without a round-trip under\n  non-synchronized quantum clocks","authors":"Tomer Shushi","authorsParsed":[["Shushi","Tomer",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:04:26 GMT"}],"updateDate":"2024-08-02","timestamp":1722438266000,"abstract":"  One of the main issues in measuring the speed of light when it only travels\nfrom one spatial position into another position, known as the one-way speed of\nlight, is that the clocks belonging to each separated spatial position are not\nand, in principle, cannot be synchronized with sufficient precision. This issue\nis the main reason why all of the measurements of the speed of light until now\nhave measured the two-way speed of light, i.e., measuring the speed of light\nthat travels from a source to another location and back to the source, and so\nthere is a need for only one clock to measure the speed. Here, we show that it\nis possible, in principle, to measure the velocity of particles that travel at\nthe speed of light without assuming a round-trip once we adopt a quantum\nmechanical description under two boundary conditions to the state of the\nquantum system followed by the two-state-vector formalism while assuming\nnon-synchronized quantum clocks with unknown time dilation. We show that the\nweak value of velocity can be measured for a test particle that has a clock\nthat is not synchronized with the clock of the quantum particle. Following the\nproposed setup, when the weak value of the velocity is known even without\nknowing the time states of the system, such a weak velocity is the two-way\nspeed of light. Otherwise, one has to impose assumptions regarding the time\nstates of the quantum clocks, which then give weak velocities that can be\nslower or even faster than the two-way speed of light. We further explore some\nfundamental implications of the setup. The proposed approach opens a new avenue\ntoward measuring the velocities of quantum particles while overcoming\nrelativistic issues regarding the synchronization of clocks.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sOuN1YrMCFbH6oeSOztDUiZMj71bYqLRLzavyUM5obA","pdfSize":"407196","txDigest":"mNFSzuSsDw5X5orbrTXJzhK3BXph8pNDLUa24xq4K5N","endEpoch":"100","status":"CERTIFIED"}
