{"id":"2408.14859","title":"Molecular saturation determines distinct plasmonic enhancement scenarios\n  for two-photon absorption signal","authors":"Saeid Izadshenas and Karolina S{\\l}owik","authorsParsed":[["Izadshenas","Saeid",""],["Słowik","Karolina",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 08:26:40 GMT"}],"updateDate":"2024-08-28","timestamp":1724747200000,"abstract":"  Two-photon absorption in molecules, of significance for high-resolution\nimaging applications, is typically characterised with low cross sections. To\nenhance the TPA signal, one effective approach exploits plasmonic enhancement.\nFor this method to be efficient, it must meet several criteria, including\nbroadband operational capability and a high fluorescence rate to ensure\neffective signal detection. In this context, we introduce a novel plus-shaped\nsilver nanostructure designed to exploit the coupling of bright and dark\nplasmonic modes. This configuration considerably improves both the absorption\nand fluorescence of molecules across near-infrared and visible spectra. By\nfine-tuning the geometrical parameters of the nanostructure, we align the\nplasmonic resonances with the optical properties of specific TPA-active dyes,\ni.e., ATTO 700, Rhodamine 6G, and ATTO 610.\n  The expected TPA signal enhancement is evaluated using classical estimations\nbased on the assumption of independent enhancement of absorption and\nfluorescence. These results are then compared with outcomes obtained in a\nquantum-mechanical approach to evaluate the stationary photon emission rate.\nOur findings reveal the important role of molecular saturation determining the\nregimes where either absorption or fluorescence enhancement leads to an\nimproved TPA signal intensity, considerably below the classical predictions.\n  The proposed nanostructure design not only addresses these findings, but also\nmight serve for their experimental verification, allowing for active\npolarization tuning of the plasmonic response targeting the absorption,\nfluorescence, or both. The insight into quantum-mechanical mechanisms of\nplasmonic signal enhancement provided in our work is a step forward in the more\neffective control of light-matter interactions at the nanoscale.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}