{"id":"2408.17020","title":"Experimental realization of metastable target skyrmion states in\n  continuous films","authors":"Elizabeth M. Jefremovas, Noah Kent, Jorge Marqu\\'es-March\\'an, Miriam\n  G. Fischer, Agustina Asenjo, Mathias Kl\\\"aui","authorsParsed":[["Jefremovas","Elizabeth M.",""],["Kent","Noah",""],["Marqués-Marchán","Jorge",""],["Fischer","Miriam G.",""],["Asenjo","Agustina",""],["Kläui","Mathias",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 05:27:15 GMT"}],"updateDate":"2024-09-02","timestamp":1724995635000,"abstract":"  Target skyrmions (TSks) are topological spin textures where the out-of-plane\ncomponent of the magnetization twists an integer number of $m$-$\\pi$ rotations.\nBased on a magnetic multilayer stack in the form of $n\\times$[CoFeB/MgO/Ta],\nengineered to host topological spin textures via dipole and DMI energies, we\nhave successfully stabilized 1$\\pi$, 2$\\pi$ and 3$\\pi$ target skyrmions by\ntuning material properties and thermal excitations close to room temperature.\nThe nucleated textures, imaged via Kerr and Magnetic Force Microscopies, are\nstable at zero magnetic field and robust within a range of temperatures (tens\nof Kelvin) close to room temperature (RT = 292 K) and over long time scales\n(months). Under applied field (mT), the TSks collapse into the central skyrmion\ncore, which resists against higher magnetic fields ($\\approx$ 2 $\\times$ TSk\nannihilation field), as the core is topologically protected. Micromagnetic\nsimulations support our experimental findings, showing no TSk nucleation at 0\nK, but a $\\approx$ 30 $\\%$ probability at 300 K for the experimental sample\nparameters. Our work provides a simple method to tailor spin textures in\ncontinuous films, enabling free movement in 2D space, creating a platform\ntransferable to technological applications where the dynamics of the\ntopological textures can be exploited beyond geometrical confinements.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}