{"id":"2408.14928","title":"Targeting the partition function of chemically disordered materials with\n  a generative approach based on inverse variational autoencoders","authors":"Maciej J. Karcz, Luca Messina, Eiji Kawasaki, Emeric Bourasseau","authorsParsed":[["Karcz","Maciej J.",""],["Messina","Luca",""],["Kawasaki","Eiji",""],["Bourasseau","Emeric",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 10:05:37 GMT"},{"version":"v2","created":"Tue, 10 Sep 2024 07:02:27 GMT"}],"updateDate":"2024-09-11","timestamp":1724753137000,"abstract":"  Computing atomic-scale properties of chemically disordered materials requires\nan efficient exploration of their vast configuration space. Traditional\napproaches such as Monte Carlo or Special Quasirandom Structures either entail\nsampling an excessive amount of configurations or do not ensure that the\nconfiguration space has been properly covered. In this work, we propose a novel\napproach where generative machine learning is used to yield a representative\nset of configurations for accurate property evaluation and provide accurate\nestimations of atomic-scale properties with minimal computational cost. Our\nmethod employs a specific type of variational autoencoder with inverse roles\nfor the encoder and decoder, enabling the application of an unsupervised active\nlearning scheme that does not require any initial training database. The model\niteratively generates configuration batches, whose properties are computed with\nconventional atomic-scale methods. These results are then fed back into the\nmodel to estimate the partition function, repeating the process until\nconvergence. We illustrate our approach by computing point-defect formation\nenergies and concentrations in (U, Pu)O2 mixed-oxide fuels. In addition, the ML\nmodel provides valuable insights into the physical factors influencing the\ntarget property. Our method is generally applicable to explore other\nproperties, such as atomic-scale diffusion coefficients, in ideally or\nnon-ideally disordered materials like high-entropy alloys.\n","subjects":["Condensed Matter/Materials Science","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}