{"id":"2408.02560","title":"Minimal actuation and control of a soft hydrogel swimmer from flutter\n  instability","authors":"Ariel Surya Boiardi and Giovanni Noselli","authorsParsed":[["Boiardi","Ariel Surya",""],["Noselli","Giovanni",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 15:37:04 GMT"}],"updateDate":"2024-08-06","timestamp":1722872224000,"abstract":"  Micro-organisms propel themselves in viscous environments by the periodic,\nnonreciprocal beating of slender appendages known as flagella. Active materials\nhave been widely exploited to mimic this form of locomotion. However, the\nrealization of such coordinated beating in biomimetic flagella requires complex\nactuation modulated in space and time. We prove through experiments on\npolyelectrolyte hydrogel samples that directed undulatory locomotion of a soft\nrobotic swimmer can be achieved by untethered actuation from a uniform and\nstatic electric field. A minimal mathematical model is sufficient to reproduce,\nand thus explain, the observed behavior. The periodic beating of the swimming\nhydrogel robot emerges from flutter instability thanks to the interplay between\nits active and passive reconfigurations in the viscous environment.\nInterestingly, the flutter-driven soft robot exhibits a form of electrotaxis\nwhereby its swimming trajectory can be controlled by simply reorienting the\nelectric field. Our findings trace the route for the embodiment of mechanical\nintelligence in soft robotic systems by the exploitation of flutter instability\nto achieve complex functional responses to simple stimuli. While the\nexperimental study is conducted on millimeter-scale hydrogel swimmers, the\ndesign principle we introduce requires simple geometry and is hence amenable\nfor miniaturization via micro-fabrication techniques. We believe it may also be\ntransferred to a wider class of soft active materials.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}