{"id":"2408.07074","title":"Sharing and Compatibility Studies between International Mobile\n  Telecommunications Systems (Mobile Cellular) and Earth-Exploration Satellite\n  Service (active) in 10-10.5 GHz","authors":"Heykel Houas","authorsParsed":[["Houas","Heykel",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 22:24:34 GMT"}],"updateDate":"2024-08-15","timestamp":1722205474000,"abstract":"  The World Radiocommunications Conference 2023 (WRC-23), held in Dubai,\nintensively discussed several Agenda Items related to possible new\nInternational Mobile Telecommunications (IMT) identifications of several radio\nfrequency bands. One example of a frequency band is 10-10.5 GHz, which has a\nprimary allocation to Radiolocation, Earth-Exploration Satellite services. In\norder to ensure continued protection of such incumbent services, sharing and\ncompatibility studies were conducted, and debated at length, at the ITU-R Study\nGroups from the year 2020 to 2023. This document presents a coexistence study.\nDuring the 41st Meeting of Permanent Consultative Committee II:\nRadiocommunications of the Inter American Telecommunication Commission (CITEL),\none administration modified its previous Draft Inter-American Proposal, to\ninclude additional protection to the incumbent services (e.g., EESS (Active)).\nThe same administration introduced three conditions meant to ensure protection\nof the incumbent services, in particular for the EESS (Active) and\nRadiolocation Service. Such conditions were: Administrations shall take\npractical measures to ensure the transmitting antennas of outdoor IMT base\nstations (BSs) are normally pointing below the true horizon when deployed\nwithin 10-10.5 GHz; additionally, the mechanical pointing needs to be at or\nbelow the horizon; Administrations shall use side lobe suppression techniques\nproviding 29.5 dB of attenuation for elevation angles above 30 degrees where 0\ndegrees relates to the horizon and 90 degrees to the zenith, referenced to the\nmaximum antenna gain at the boresight; The maximum equivalent isotropically\nradiated power (e.i.r.p.) emitted by an IMT base station shall not exceed 32 dB\nW/100 MHz.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"25Up6ickzTaNBbZAVg_Tr1MuptyJMepP0k7ipfCtQ8Q","pdfSize":"1265629"}
