{"id":"2408.04092","title":"Programmable Dataflows: Abstraction and Programming Model for Data\n  Sharing","authors":"Siyuan Xia, Chris Zhu, Tapan Srivastava, Bridget Fahey, Raul Castro\n  Fernandez","authorsParsed":[["Xia","Siyuan",""],["Zhu","Chris",""],["Srivastava","Tapan",""],["Fahey","Bridget",""],["Fernandez","Raul Castro",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 21:15:57 GMT"}],"updateDate":"2024-08-09","timestamp":1723065357000,"abstract":"  Data sharing is central to a wide variety of applications such as fraud\ndetection, ad matching, and research. The lack of data sharing abstractions\nmakes the solution to each data sharing problem bespoke and cost-intensive,\nhampering value generation. In this paper, we first introduce a data sharing\nmodel to represent every data sharing problem with a sequence of dataflows.\nFrom the model, we distill an abstraction, the contract, which agents use to\ncommunicate the intent of a dataflow and evaluate its consequences, before the\ndataflow takes place. This helps agents move towards a common sharing goal\nwithout violating any regulatory and privacy constraints. Then, we design and\nimplement the contract programming model (CPM), which allows agents to program\ndata sharing applications catered to each problem's needs.\n  Contracts permit data sharing, but their interactive nature may introduce\ninefficiencies. To mitigate those inefficiencies, we extend the CPM so that it\ncan save intermediate outputs of dataflows, and skip computation if a dataflow\ntries to access data that it does not have access to. In our evaluation, we\nshow that 1) the contract abstraction is general enough to represent a wide\nrange of sharing problems, 2) we can write programs for complex data sharing\nproblems and exhibit qualitative improvements over other alternate\ntechnologies, and 3) quantitatively, our optimizations make sharing programs\nwritten with the CPM efficient.\n","subjects":["Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"SWlLQ0kiN1W1dbUebJkxlrkfIivBrWYyVuYITj_2On4","pdfSize":"1115555"}
