{"id":"2408.06681","title":"Coherence Awareness in Diffractive Neural Networks","authors":"Matan Kleiner, Lior Michaeli, Tomer Michaeli","authorsParsed":[["Kleiner","Matan",""],["Michaeli","Lior",""],["Michaeli","Tomer",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 07:19:40 GMT"}],"updateDate":"2024-08-14","timestamp":1723533580000,"abstract":"  Diffractive neural networks hold great promise for applications requiring\nintensive computational processing. Considerable attention has focused on\ndiffractive networks for either spatially coherent or spatially incoherent\nillumination. Here we illustrate that, as opposed to imaging systems, in\ndiffractive networks the degree of spatial coherence has a dramatic effect. In\nparticular, we show that when the spatial coherence length on the object is\ncomparable to the minimal feature size preserved by the optical system, neither\nthe incoherent nor the coherent extremes serve as acceptable approximations.\nImportantly, this situation is inherent to many settings involving active\nillumination, including reflected light microscopy, autonomous vehicles and\nsmartphones. Following this observation, we propose a general framework for\ntraining diffractive networks for any specified degree of spatial and temporal\ncoherence, supporting all types of linear and nonlinear layers. Using our\nmethod, we numerically optimize networks for image classification, and\nthoroughly investigate their performance dependence on the illumination\ncoherence properties. We further introduce the concept of coherence-blind\nnetworks, which have enhanced resilience to changes in illumination conditions.\nOur findings serve as a steppingstone toward adopting all-optical neural\nnetworks in real-world applications, leveraging nothing but natural light.\n","subjects":["Physics/Optics","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AopHokxhUY6G8k-7ljgrjY-FjMA_G9BUJ5bBK572i9M","pdfSize":"9689700"}
