{"id":"2408.11970","title":"Rooftop and Community Solar Adoption with Income Heterogeneity","authors":"Swapnil Rayal, Apurva Jain, Matthew Lorig","authorsParsed":[["Rayal","Swapnil",""],["Jain","Apurva",""],["Lorig","Matthew",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 19:49:51 GMT"}],"updateDate":"2024-08-23","timestamp":1724269791000,"abstract":"  Each household in a population characterized by income heterogeneity faces\nrandom demand for electricity and decides if and when it should adopt a solar\nproduct, rooftop solar or community solar. A central planner, aiming to meet an\nadoption level target within a set time, offers net metering and subsidy on\nsolar products and minimizes its total cost. Our focus is on analyzing the\ninteractions of three new features we add to the literature: income diversity,\navailability of community solar, and consideration of adoption timing.\n{Methodology and results:} We develop a bilevel optimization formulation to\nderive the optimal subsidy policy. The upper level (planner's) problem is a\nconstrained non-linear optimization model in which the planner aims to minimize\nthe average subsidy cost. The lower level (household's) problem is an optimal\nstopping formulation, which captures the adoption decisions of the households.\nWe derive a closed-form expression for the distribution of optimal adoption\ntime of households for a given subsidy policy. We show that the planner's\nproblem is convex in the case of homogeneous subsidy for the two products.\n{Managerial implications:} Our results underscore the importance for planners\nto consider three factors - adoption level target, time target, and subsidy\nbudget - simultaneously as they work in tandem to influence the adoption\noutcome. The planners must also consider the inclusion of community solar in\ntheir plans because, as we show, community and rooftop solar attract households\nfrom different sides of the income spectrum. In the presence of income\ninequality, the availability of community makes it easier to meet solar\nadoption targets.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}