{"id":"2408.17397","title":"End-to-End Learning for Task-Oriented Semantic Communications Over MIMO\n  Channels: An Information-Theoretic Framework","authors":"Chang Cai, Xiaojun Yuan, Ying-Jun Angela Zhang","authorsParsed":[["Cai","Chang",""],["Yuan","Xiaojun",""],["Zhang","Ying-Jun Angela",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 16:30:03 GMT"}],"updateDate":"2024-09-02","timestamp":1725035403000,"abstract":"  This paper addresses the problem of end-to-end (E2E) design of learning and\ncommunication in a task-oriented semantic communication system. In particular,\nwe consider a multi-device cooperative edge inference system over a wireless\nmultiple-input multiple-output (MIMO) multiple access channel, where multiple\ndevices transmit extracted features to a server to perform a classification\ntask. We formulate the E2E design of feature encoding, MIMO precoding, and\nclassification as a conditional mutual information maximization problem.\nHowever, it is notoriously difficult to design and train an E2E network that\ncan be adaptive to both the task dataset and different channel realizations.\nRegarding network training, we propose a decoupled pretraining framework that\nseparately trains the feature encoder and the MIMO precoder, with a maximum a\nposteriori (MAP) classifier employed at the server to generate the inference\nresult. The feature encoder is pretrained exclusively using the task dataset,\nwhile the MIMO precoder is pretrained solely based on the channel and noise\ndistributions. Nevertheless, we manage to align the pretraining objectives of\neach individual component with the E2E learning objective, so as to approach\nthe performance bound of E2E learning. By leveraging the decoupled pretraining\nresults for initialization, the E2E learning can be conducted with minimal\ntraining overhead. Regarding network architecture design, we develop two deep\nunfolded precoding networks that effectively incorporate the domain knowledge\nof the solution to the decoupled precoding problem. Simulation results on both\nthe CIFAR-10 and ModelNet10 datasets verify that the proposed method achieves\nsignificantly higher classification accuracy compared to various baselines.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}