{"id":"2408.04290","title":"Efficient and Accurate Pneumonia Detection Using a Novel Multi-Scale\n  Transformer Approach","authors":"Alireza Saber, Pouria Parhami, Alimihammad Siahkarzadeh, Amirreza\n  Fateh","authorsParsed":[["Saber","Alireza",""],["Parhami","Pouria",""],["Siahkarzadeh","Alimihammad",""],["Fateh","Amirreza",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 08:06:42 GMT"}],"updateDate":"2024-08-09","timestamp":1723104402000,"abstract":"  Pneumonia, a severe respiratory disease, poses significant diagnostic\nchallenges, especially in underdeveloped regions. Traditional diagnostic\nmethods, such as chest X-rays, suffer from variability in interpretation among\nradiologists, necessitating reliable automated tools. In this study, we propose\na novel approach combining deep learning and transformer-based attention\nmechanisms to enhance pneumonia detection from chest X-rays. Our method begins\nwith lung segmentation using a TransUNet model that integrates our specialized\ntransformer module, which has fewer parameters compared to common transformers\nwhile maintaining performance. This model is trained on the \"Chest Xray Masks\nand Labels\" dataset and then applied to the Kermany and Cohen datasets to\nisolate lung regions, enhancing subsequent classification tasks. For\nclassification, we employ pre-trained ResNet models (ResNet-50 and ResNet-101)\nto extract multi-scale feature maps, processed through our modified transformer\nmodule. By employing our specialized transformer, we attain superior results\nwith significantly fewer parameters compared to common transformer models. Our\napproach achieves high accuracy rates of 92.79% on the Kermany dataset and\n95.11% on the Cohen dataset, ensuring robust and efficient performance suitable\nfor resource-constrained environments.\n\"https://github.com/amirrezafateh/Multi-Scale-Transformer-Pneumonia\"\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}