{"id":"2408.00894","title":"On the Effect of Driving Turbulent-like Fluctuations on a Harris-Current\n  Sheet Configuration and the Formation of Plasmoids","authors":"Jeffersson Andres Agudelo Rueda, Yi-Hsin Liu, Kai Germaschewski,\n  Michael Hesse and Naoki Bessho","authorsParsed":[["Rueda","Jeffersson Andres Agudelo",""],["Liu","Yi-Hsin",""],["Germaschewski","Kai",""],["Hesse","Michael",""],["Bessho","Naoki",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 20:17:49 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 09:52:42 GMT"}],"updateDate":"2024-08-07","timestamp":1722543469000,"abstract":"  Energy dissipation in collisionless plasmas is one of the most outstanding\nopen questions in plasma physics. Magnetic reconnection and turbulence are two\nphenomena that can produce the conditions for energy dissipation. These two\nphenomena are closely related to each other in a wide range of plasmas.\nTurbulent fluctuations can emerge in critical regions of reconnection events,\nand magnetic reconnection can occur as a product of the turbulent cascade. In\nthis study, we perform 2D particle-in-cell simulations of a reconnecting Harris\ncurrent sheet in the presence of turbulent fluctuations to explore the effect\nof turbulence on the reconnection process in collisionless non-relativistic\npair-plasmas. We find that the presence of a turbulent field can affect the\nonset and evolution of magnetic reconnection. Moreover, we observe the\nexistence of a scale dependent amplitude of magnetic field fluctuations above\nwhich these fluctuations are able to disrupt the growing of magnetic islands.\nThese fluctuations provide thermal energy to the particles within the current\nsheet and preferential perpendicular thermal energy to the background\npopulation.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ISozNPdKZgtfwXQIMcsgJqi8B-Td9qbNxDG4fih9Sdw","pdfSize":"7203751","txDigest":"B4tWz3xmjQn56zJAZqYA47sj9EaaYxdzQDxXgpf7W9be","endEpoch":"1","status":"CERTIFIED"}
