{"id":"2408.10045","title":"Gapless spin excitations in nanographene-based antiferromagnetic\n  spin-1/2 Heisenberg chains","authors":"Chenxiao Zhao, Lin Yang, Jo\\~ao C. G. Henriques, Mar Ferri-Cort\\'es,\n  Gon\\c{c}alo Catarina, Carlo A. Pignedoli, Ji Ma, Xinliang Feng, Pascal\n  Ruffieux, Joaqu\\'in Fern\\'andez-Rossier, Roman Fasel","authorsParsed":[["Zhao","Chenxiao",""],["Yang","Lin",""],["Henriques","João C. G.",""],["Ferri-Cortés","Mar",""],["Catarina","Gonçalo",""],["Pignedoli","Carlo A.",""],["Ma","Ji",""],["Feng","Xinliang",""],["Ruffieux","Pascal",""],["Fernández-Rossier","Joaquín",""],["Fasel","Roman",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 14:36:33 GMT"}],"updateDate":"2024-08-20","timestamp":1724078193000,"abstract":"  Haldane's seminal work established two fundamentally different types of\nexcitation spectra for antiferromagnetic Heisenberg quantum spin chains: gapped\nexcitations in integer-spin chains and gapless excitations in half-integer-spin\nchains. In finite-length half-integer spin chains, quantization, however,\ninduces a gap in the excitation spectrum, with the upper bound given by the\nLieb-Schulz-Mattis (LSM) theorem. Here, we investigate the length-dependent\nexcitations in spin-1/2 Heisenberg chains obtained by covalently linking\nolympicenes--Olympic rings shaped nanographenes carrying spin-1/2--into\none-dimensional chains. The large exchange interaction (J~38 mV) between\nolympicenes and the negligible magnetic anisotropy in these nanographenes make\nthem an ideal platform for studying quantum spin excitations, which we directly\nmeasure using inelastic electron tunneling spectroscopy. We observe a power-law\ndecay of the lowest excitation energy with increasing chain length L, remaining\nbelow the LSM boundary. In a long chain with L = 50, a nearly V-shaped\nexcitation continuum is observed, reinforcing the system's gapless nature in\nthe thermodynamic limit. Finally, we visualize the standing wave of a single\nspinon confined in odd-numbered chains using low-bias current maps. Our results\nprovide compelling evidence for the realization of a one-dimensional analog of\na gapless spin liquid.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}