{"id":"2408.13169","title":"Rules governing Jahn-Teller order in Prussian blue analogues","authors":"Elodie A. Harbourne, John Cattermull, Hanna L. B. Bostr\\\"om, Rebecca\n  Witte, Nikolaj Roth, Mauro Pasta, David A. Keen, Andrew L. Goodwin","authorsParsed":[["Harbourne","Elodie A.",""],["Cattermull","John",""],["Boström","Hanna L. B.",""],["Witte","Rebecca",""],["Roth","Nikolaj",""],["Pasta","Mauro",""],["Keen","David A.",""],["Goodwin","Andrew L.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 15:42:53 GMT"}],"updateDate":"2024-08-26","timestamp":1724427773000,"abstract":"  Jahn-Teller distortions of transition-metal coordination environments link\norbital occupancies to structure. In the solid state, such distortions can be\nstrongly correlated through the propagation of strain and/or through orbital\ninteractions. Cooperative Jahn-Teller (CJT) order of this kind affects the\nelectronic, magnetic, and structural properties of the materials in which it\noccurs. Conventionally studied in dense ceramics, CJT order also occurs in\nhybrid materials, albeit the underlying phenomenology is not well established.\nHere we use synchrotron powder X-ray diffraction measurements to determine\nlinks between composition and Jahn-Teller effects in a series of Prussian blue\nanalogue (PBA) families. We develop a simple model based on the dual\nconsiderations of strain and crystal-field stabilisation that can account for\nthe stability, extent of CJT order, and crystallite strain measured\nexperimentally. This model shows how PBA compositions might be tuned to control\nthe emergence and nature of CJT effects. A key implication of the model is that\nPBAs harbour their own complex interplay between compositional, structural,\norbital, and magnetic degrees of freedom related to that of strongly-correlated\nfunctional materials such as the manganite perovskites.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}