{"id":"2408.06885","title":"Voltran: Unlocking Trust and Confidentiality in Decentralized Federated\n  Learning Aggregation","authors":"Hao Wang, Yichen Cai, Jun Wang, Chuan Ma, Chunpeng Ge, Xiangmou Qu, Lu\n  Zhou","authorsParsed":[["Wang","Hao",""],["Cai","Yichen",""],["Wang","Jun",""],["Ma","Chuan",""],["Ge","Chunpeng",""],["Qu","Xiangmou",""],["Zhou","Lu",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 13:33:35 GMT"}],"updateDate":"2024-08-14","timestamp":1723556015000,"abstract":"  The decentralized Federated Learning (FL) paradigm built upon blockchain\narchitectures leverages distributed node clusters to replace the single server\nfor executing FL model aggregation. This paradigm tackles the vulnerability of\nthe centralized malicious server in vanilla FL and inherits the trustfulness\nand robustness offered by blockchain. However, existing blockchain-enabled\nschemes face challenges related to inadequate confidentiality on models and\nlimited computational resources of blockchains to perform large-scale FL\ncomputations. In this paper, we present Voltran, an innovative hybrid platform\ndesigned to achieve trust, confidentiality, and robustness for FL based on the\ncombination of the Trusted Execution Environment (TEE) and blockchain\ntechnology. We offload the FL aggregation computation into TEE to provide an\nisolated, trusted and customizable off-chain execution, and then guarantee the\nauthenticity and verifiability of aggregation results on the blockchain.\nMoreover, we provide strong scalability on multiple FL scenarios by introducing\na multi-SGX parallel execution strategy to amortize the large-scale FL\nworkload. We implement a prototype of Voltran and conduct a comprehensive\nperformance evaluation. Extensive experimental results demonstrate that Voltran\nincurs minimal additional overhead while guaranteeing trust, confidentiality,\nand authenticity, and it significantly brings a significant speed-up compared\nto state-of-the-art ciphertext aggregation schemes.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}