{"id":"2408.01114","title":"PSP-GEN: Stochastic inversion of the Process-Structure-Property chain in\n  materials design through deep, generative probabilistic modeling","authors":"Yaohua Zang, Phaedon-Stelios Koutsourelakis","authorsParsed":[["Zang","Yaohua",""],["Koutsourelakis","Phaedon-Stelios",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 08:50:29 GMT"}],"updateDate":"2024-08-05","timestamp":1722588629000,"abstract":"  Inverse material design is a cornerstone challenge in materials science, with\nsignificant applications across many industries. Traditional approaches that\ninvert the structure-property (SP) linkage to identify microstructures with\ntargeted properties often overlook the feasibility of production processes,\nleading to microstructures that may not be manufacturable. Achieving both\ndesired properties and a realizable manufacturing procedure necessitates\ninverting the entire Process-Structure-Property (PSP) chain. However, this task\nis fraught with challenges, including stochasticity along the whole modeling\nchain, the high dimensionality of microstructures and process parameters, and\nthe inherent ill-posedness of the inverse problem. This paper proposes a novel\nframework, named PSP-GEN, for the goal-oriented material design that\neffectively addresses these challenges by modeling the entire PSP chain with a\ndeep generative model. It employs two sets of continuous, microstructure- and\nproperty-aware, latent variables, the first of which provides a\nlower-dimensional representation that captures the stochastic aspects of\nmicrostructure generation, while the second is a direct link to processing\nparameters. This structured, low-dimensional embedding not only simplifies the\nhandling of high-dimensional microstructure data but also facilitates the\napplication of gradient-based optimization techniques. The effectiveness and\nefficiency of this method are demonstrated in the inverse design of two-phase\nmaterials, where the objective is to design microstructures with target\neffective permeability. We compare state-of-the-art alternatives in challenging\nsettings involving limited training data, target property regions for which no\ntraining data is available, and design tasks where the process parameters and\nmicrostructures have high-dimensional representations.\n","subjects":["Condensed Matter/Materials Science","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}