{"id":"2408.01871","title":"Post-Newtonian observables for aligned-spin binaries to sixth order in\n  spin from gravitational self-force and Compton amplitudes","authors":"Yilber Fabian Bautista, Mohammed Khalil, Matteo Sergola, Chris\n  Kavanagh, Justin Vines","authorsParsed":[["Bautista","Yilber Fabian",""],["Khalil","Mohammed",""],["Sergola","Matteo",""],["Kavanagh","Chris",""],["Vines","Justin",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 22:33:01 GMT"}],"updateDate":"2024-08-06","timestamp":1722724381000,"abstract":"  Accurate modeling of compact binaries is essential for gravitational-wave\ndetection and parameter estimation, with spin being an important effect to\ninclude in waveform models. In this paper, we derive new post-Newtonian (PN)\nresults for the conservative aligned-spin dynamics at next-to-next-to-leading\norder for the spin$^3$ and spin$^4$ contributions, in addition to the\nnext-to-leading order (NLO) spin$^5$ and spin$^6$ contributions. One approach\nwe follow is the Tutti Frutti method, which relates PN and gravitational\nself-force (GSF) results through the redshift and spin-precession invariants,\nby making use of the simple dependence of the scattering angle on the symmetric\nmass ratio. However, an ambiguity arises at the NLO spin$^5$ contribution, due\nto transcendental functions of the Kerr spin in the redshift; this is also the\norder at which Compton amplitudes calculations are affected by spurious poles.\nTherefore, we follow an additional approach to determine the NLO spin$^5$ and\nspin$^6$ dynamics: using on-shell Compton amplitudes obtained from black hole\nperturbation theory. The Compton amplitude used in this work is composed of the\nunambiguous tree-level far-zone part reported in [Phys. Rev. D 109, no.8,\n084071 (2024)], as well as the full, non-interfering with the far-zone,\n$\\ell=2$ partial wave contributions from the near zone, which are responsible\nfor capturing Kerr finite-size effects. Other results in this paper include\nderiving the scattering angle of a spinning test body in a Kerr background from\na parametrized worldline action, and computing the redshift and spin-precession\ninvariants for eccentric orbits without an eccentricity expansion.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}