{"id":"2408.03903","title":"Role of time-frequency correlations in two-photon-two-atom resonance\n  energy transfer","authors":"Roberto de J. Le\\'on-Montiel, Arturo Pedroza-Rojas and Jorge A.\n  Peralta-\\'Angeles","authorsParsed":[["León-Montiel","Roberto de J.",""],["Pedroza-Rojas","Arturo",""],["Peralta-Ángeles","Jorge A.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 17:00:23 GMT"}],"updateDate":"2024-08-08","timestamp":1723050023000,"abstract":"  Excitation energy transfer is a photophysical process upon which many\nchemical and biological phenomena are built. From natural small systems to\nsynthetic multichromophoric macromolecules, energy transfer deals with the\nprocess of migration of electronic excitation energy from an excited donor to\nan acceptor. Although this phenomenon has been extensively studied in the past,\nthe rapid evolution of quantum-enabled technologies has motivated the question\non whether nonclassical sources of light, such as entangled photon pairs, may\nprovide us with a better control (or enhancement) of energy transfer at the\nnanoscale. In this work, we provide a comprehensive study of the joint\nexcitation of two non-interacting two-level atoms by time-frequency correlated\nphoton pairs -- whose central frequencies are not resonant with the individual\nparticles -- generated by means of spontaneous parametric down conversion\n(SPDC). We demonstrate that while strong frequency anti-correlation between\nphotons guarantees a large two-photon excitation (TPE) probability, photons\nbearing a sine cardinal spectral shape exhibit a $\\sim$3.8 times larger TPE\nsignal than photons with a Gaussian spectrum. More importantly, we find that\nsuppression of time-ordered excitation pathways does not substantially modify\nthe TPE probability for two-photon states with a Gaussian spectral shape;\nwhereas photons with a sine cardinal spectrum exhibit the strongest TPE signals\nwhen two-photon excitation pathways are not suppressed. Our results not only\nhelp elucidating the role of time-frequency correlations in resonance energy\ntransfer with SPDC photons, but also provide valuable information regarding the\noptimal source to be used in its experimental implementation.\n","subjects":["Physics/Quantum Physics","Physics/Chemical Physics","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}