{"id":"2408.02230","title":"Mock Observations: Three Different Types of Galaxy Alignment in TNG100\n  Simulations","authors":"Yanyao Lan, Lin Tang, Weipeng Lin and Junyu Gong","authorsParsed":[["Lan","Yanyao",""],["Tang","Lin",""],["Lin","Weipeng",""],["Gong","Junyu",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 04:51:41 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 02:08:59 GMT"}],"updateDate":"2024-08-08","timestamp":1722833501000,"abstract":"  In this study, galaxy samples have been generated using mock observation\ntechniques based on the results of TNG100-1 simulations to investigate three\nforms of intrinsic alignment: satellite-central alignment between the\norientation of the brightest group galaxies (BGG) and the spatial distribution\nof their satellites, radial alignment between the satellites' orientation and\nthe direction towards their BGG, as well as direct alignment between the\norientation of BGG and that of its satellites. Overall, the predictions of\ngalaxy alignment generally align with observations, although minor\ndiscrepancies have been identified. For satellite-central alignment, the\nalignment strength and color-dependence trends are well replicated by the mock\nobservations. Regarding radial alignment, the signals are weak but discernible,\nwith no apparent color dependence. As for direct alignment, no signal is\ndetected, nor is there any color dependence. We also investigate the alignment\ndependencies on halo or the BGG properties, and proximity effect. For\nsatellite-central alignment, the predicted alignment signal shows a positive\ncorrelation with halo and BGG mass, consistent with observations and previous\npredictions. Similar correlations have also been observed with the BGG age and\nmetallicity, which merit future observational analysis for confirmation.\nProximity effects have been observed for all three types of alignment, with\nsatellites closer to the BGG exhibiting stronger alignment signals. The\ninfluence of galaxy definition and shape determination on alignment studies is\nalso analyzed. This study underscores the importance of employing mock\nobservation techniques for a fair comparison between predictions and\nobservations.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}