{"id":"2408.11660","title":"Anteumbler: Non-Invasive Antenna Orientation Error Measurement for WiFi\n  APs","authors":"Dawei Yan, Panlong Yang, Fei Shang, Nikolaos M. Freris, Yubo Yan","authorsParsed":[["Yan","Dawei",""],["Yang","Panlong",""],["Shang","Fei",""],["Freris","Nikolaos M.",""],["Yan","Yubo",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 14:34:22 GMT"}],"updateDate":"2024-08-22","timestamp":1724250862000,"abstract":"  The performance of WiFi-based localization systems is affected by the spatial\naccuracy of WiFi AP. Compared with the imprecision of AP location and antenna\nseparation, the imprecision of AP's or antenna's orientation is more important\nin real scenarios, including AP rotation and antenna irregular tilt. In this\npaper, we propose Anteumbler that non-invasively, accurately and efficiently\nmeasures the orientation of each antenna in physical space. Based on the fact\nthat the received power is maximized when a Tx-Rx antenna pair is perfectly\naligned, we construct a spatial angle model that can obtain the antennas'\norientations without prior knowledge. However, the sampling points of\ntraversing the spatial angle need to cover the entire space. We use the\northogonality of antenna directivity and polarization and adopt an iterative\nalgorithm to reduce the sampling points by hundreds of times, which greatly\nimproves the efficiency. To achieve the required antenna orientation accuracy,\nwe eliminate the influence of propagation distance using a dual plane\nintersection model and filter out ambient noise. Our real-world experiments\nwith six antenna types, two antenna layouts and two antenna separations show\nthat Anteumbler achieves median errors below 6 degree for both elevation and\nazimuth angles, and is robust to NLoS and dynamic environments. Last but not\nleast, for the reverse localization system, we deploy Anteumbler over LocAP and\nreduce the antenna separation error by 10 mm, while for the user localization\nsystem, we deploy Anteumbler over SpotFi and reduce the user localization error\nby more than 1 m.\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}