{"id":"2408.13724","title":"PhysPart: Physically Plausible Part Completion for Interactable Objects","authors":"Rundong Luo, Haoran Geng, Congyue Deng, Puhao Li, Zan Wang, Baoxiong\n  Jia, Leonidas Guibas, Siyuan Huang","authorsParsed":[["Luo","Rundong",""],["Geng","Haoran",""],["Deng","Congyue",""],["Li","Puhao",""],["Wang","Zan",""],["Jia","Baoxiong",""],["Guibas","Leonidas",""],["Huang","Siyuan",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 04:56:09 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 18:09:49 GMT"}],"updateDate":"2024-08-30","timestamp":1724561769000,"abstract":"  Interactable objects are ubiquitous in our daily lives. Recent advances in 3D\ngenerative models make it possible to automate the modeling of these objects,\nbenefiting a range of applications from 3D printing to the creation of robot\nsimulation environments. However, while significant progress has been made in\nmodeling 3D shapes and appearances, modeling object physics, particularly for\ninteractable objects, remains challenging due to the physical constraints\nimposed by inter-part motions. In this paper, we tackle the problem of\nphysically plausible part completion for interactable objects, aiming to\ngenerate 3D parts that not only fit precisely into the object but also allow\nsmooth part motions. To this end, we propose a diffusion-based part generation\nmodel that utilizes geometric conditioning through classifier-free guidance and\nformulates physical constraints as a set of stability and mobility losses to\nguide the sampling process. Additionally, we demonstrate the generation of\ndependent parts, paving the way toward sequential part generation for objects\nwith complex part-whole hierarchies. Experimentally, we introduce a new metric\nfor measuring physical plausibility based on motion success rates. Our model\noutperforms existing baselines over shape and physical metrics, especially\nthose that do not adequately model physical constraints. We also demonstrate\nour applications in 3D printing, robot manipulation, and sequential part\ngeneration, showing our strength in realistic tasks with the demand for high\nphysical plausibility.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/"}