{"id":"2408.13825","title":"RoCP-GNN: Robust Conformal Prediction for Graph Neural Networks in\n  Node-Classification","authors":"S. Akansha","authorsParsed":[["Akansha","S.",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 12:51:19 GMT"}],"updateDate":"2024-08-27","timestamp":1724590279000,"abstract":"  Graph Neural Networks (GNNs) have emerged as powerful tools for predicting\noutcomes in graph-structured data. However, a notable limitation of GNNs is\ntheir inability to provide robust uncertainty estimates, which undermines their\nreliability in contexts where errors are costly. One way to address this issue\nis by providing prediction sets that contain the true label with a predefined\nprobability margin. Our approach builds upon conformal prediction (CP), a\nframework that promises to construct statistically robust prediction sets or\nintervals. There are two primary challenges: first, given dependent data like\ngraphs, it is unclear whether the critical assumption in CP - exchangeability -\nstill holds when applied to node classification. Second, even if the\nexchangeability assumption is valid for conformalized link prediction, we need\nto ensure high efficiency, i.e., the resulting prediction set or the interval\nlength is small enough to provide useful information. In this article, we\npropose a novel approach termed Robust Conformal Prediction for GNNs\n(RoCP-GNN), which integrates conformal prediction (CP) directly into the GNN\ntraining process. This method generates prediction sets, instead of just point\npredictions, that are valid at a user-defined confidence level, assuming only\nexchangeability. Our approach robustly predicts outcomes with any predictive\nGNN model while quantifying the uncertainty in predictions within the realm of\ngraph-based semi-supervised learning (SSL). Experimental results demonstrate\nthat GNN models with size loss provide a statistically significant increase in\nperformance. We validate our approach on standard graph benchmark datasets by\ncoupling it with various state-of-the-art GNNs in node classification. The code\nwill be made available after publication.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VkBS6-rYgEjs1Iux_r5UsWGwUtTo1_GFJe0cIxz2qno","pdfSize":"526141"}
