{"id":"2408.00380","title":"EXAONEPath 1.0 Patch-level Foundation Model for Pathology","authors":"Juseung Yun, Yi Hu, Jinhyung Kim, Jongseong Jang and Soonyoung Lee","authorsParsed":[["Yun","Juseung",""],["Hu","Yi",""],["Kim","Jinhyung",""],["Jang","Jongseong",""],["Lee","Soonyoung",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 08:41:13 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 02:45:50 GMT"},{"version":"v3","created":"Thu, 22 Aug 2024 05:07:18 GMT"}],"updateDate":"2024-08-23","timestamp":1722501673000,"abstract":"  Recent advancements in digital pathology have led to the development of\nnumerous foundational models that utilize self-supervised learning on patches\nextracted from gigapixel whole slide images (WSIs). While this approach\nleverages vast amounts of unlabeled data, we have discovered a significant\nissue: features extracted from these self-supervised models tend to cluster by\nindividual WSIs, a phenomenon we term WSI-specific feature collapse. This\nproblem can potentially limit the model's generalization ability and\nperformance on various downstream tasks. To address this issue, we introduce\nEXAONEPath, a novel foundational model trained on patches that have undergone\nstain normalization. Stain normalization helps reduce color variability arising\nfrom different laboratories and scanners, enabling the model to learn more\nconsistent features. EXAONEPath is trained using 285,153,903 patches extracted\nfrom a total of 34,795 WSIs. Our experiments demonstrate that EXAONEPath\nsignificantly mitigates the feature collapse problem, indicating that the model\nhas learned more generalized features rather than overfitting to individual WSI\ncharacteristics. We compared EXAONEPath with state-of-the-art models across six\ndownstream task datasets, and our results show that EXAONEPath achieves\nsuperior performance relative to the number of WSIs used and the model's\nparameter count. This suggests that the application of stain normalization has\nsubstantially improved the model's efficiency and generalization capabilities.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"mrMRS-Nb5u25H4syZ3PZaaCyFmZyUoSPBjpJrb58N2Q","pdfSize":"789215","txDigest":"APYkCJX85fhof7vGH6UudcGnLezH9XhTSXHDMkJGibH9","endEpoch":"1","status":"CERTIFIED"}
