{"id":"2408.05544","title":"Optical frequency combs significantly spanned to broad bandwidths by an\n  optomechanical resonance","authors":"Xin Gu, Jinlian Zhang, Shulin Ding, Xiaoshun Jiang, Bing He, and Qing\n  Lin","authorsParsed":[["Gu","Xin",""],["Zhang","Jinlian",""],["Ding","Shulin",""],["Jiang","Xiaoshun",""],["He","Bing",""],["Lin","Qing",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 13:03:17 GMT"}],"updateDate":"2024-08-13","timestamp":1723294997000,"abstract":"  Optical frequency comb, as a spectrum made of discrete and equally spaced\nspectral lines, is a light source with essential applications in modern\ntechnology. Cavity optomechanical systems were found to be a feasible candidate\nfor realizing on-chip frequency comb with low repetition rate. However, it was\ndifficult to increase the comb line numbers of this type of frequency combs\nbecause the mechanical oscillation amplitude of such system, which determines\nthe frequency comb bandwidth, cannot quickly increase with pump laser power.\nHere, we develop a new approach to generate broadband optomechanical frequency\ncomb by employing a different mechanism to enhance the mechanical oscillation.\nTwo pump tones with their frequency difference matching the mechanical\nfrequency will drive the system into a self-organized nonlinear resonance and\nthus tremendously transfer the energy to the mechanical resonator. As a result,\nmore than $10000$ or even more comb lines become available under the pump laser\npower in the order of milliwatt. A unique feature of the self-organized\nresonance is the mechanical frequency locking so that, within a certain range\nof the frequency difference between two drive tones, the distance between comb\nteeth can be locked by the two drive tones and becomes independent of any\nchange of pump power. This property guarantees a stable repetition rate of the\ngenerated frequency comb.\n","subjects":["Physics/Optics","Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"F4NM_jzYrZsGmJl3bVqGRdL2nF6nLEUjvoAOI7pPfjQ","pdfSize":"15192115"}
