{"id":"2408.08340","title":"METR: Image Watermarking with Large Number of Unique Messages","authors":"Alexander Varlamov, Daria Diatlova, Egor Spirin","authorsParsed":[["Varlamov","Alexander",""],["Diatlova","Daria",""],["Spirin","Egor",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 12:22:28 GMT"}],"updateDate":"2024-08-19","timestamp":1723724548000,"abstract":"  Improvements in diffusion models have boosted the quality of image\ngeneration, which has led researchers, companies, and creators to focus on\nimproving watermarking algorithms. This provision would make it possible to\nclearly identify the creators of generative art. The main challenges that\nmodern watermarking algorithms face have to do with their ability to withstand\nattacks and encrypt many unique messages, such as user IDs. In this paper, we\npresent METR: Message Enhanced Tree-Ring, which is an approach that aims to\naddress these challenges. METR is built on the Tree-Ring watermarking\nalgorithm, a technique that makes it possible to encode multiple distinct\nmessages without compromising attack resilience or image quality. This ensures\nthe suitability of this watermarking algorithm for any Diffusion Model. In\norder to surpass the limitations on the quantity of encoded messages, we\npropose METR++, an enhanced version of METR. This approach, while limited to\nthe Latent Diffusion Model architecture, is designed to inject a virtually\nunlimited number of unique messages. We demonstrate its robustness to attacks\nand ability to encrypt many unique messages while preserving image quality,\nwhich makes METR and METR++ hold great potential for practical applications in\nreal-world settings. Our code is available at https://github.com/deepvk/metr\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Cryptography and Security","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iudpRsFcHQqy60q7TC2WqfixKdM4jmcY_gLc5hJXa5Q","pdfSize":"4829179"}
