{"id":"2408.13846","title":"Low injection rate of cosmic-ray protons in the turbulent reacceleration\n  model of radio halos in galaxy clusters","authors":"Kosuke Nishiwaki, Katsuaki Asano","authorsParsed":[["Nishiwaki","Kosuke",""],["Asano","Katsuaki",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 14:32:33 GMT"}],"updateDate":"2024-08-27","timestamp":1724596353000,"abstract":"  A giant radio halo (RH) is a diffuse synchrotron emission observed on the\nscale of megaparsecs (Mpc), typically found in the central region of merging\ngalaxy clusters. Its large size and steep spectrum suggest that it originates\nfrom the re-energization of an aged population of cosmic ray electrons (CREs),\nwhile the secondary leptons produced in the $pp$ hadronic collision of cosmic\nray protons (CRPs) may contribute to the emission. In this study, we\ninvestigate the reacceleration model including both primary and secondary CREs,\nassuming that the primary CRs originate from internal galaxies. In our new\nmethod, we follow the cosmological evolution of each cluster and calculate the\nenergy spectra and one-dimensional spatial distributions of CRs. The primary\nCRE model with $\\sim 3$ Gyr duration of reacceleration successfully reproduces\nthe statistical properties of the RHs observed in the recent LOFAR survey, as\nwell as the spectrum and profile of the Coma cluster. The gamma-ray and\nneutrino emissions produced by reaccelerated CRPs are consistent with the upper\nlimits. However, if the CRP injection rate is high and the secondary CREs\nbecome significant, the model with the required $\\sim 3$ Gyr reacceleration\noverproduces the number of RHs. The limit on the CRP injection rate, $L_{\\rm p}\n\\lesssim 10^{41}$ erg/s, is significantly lower than that expected from the\nearly starburst activity or jets from active galactic nuclei. This discrepancy\nrequires a revision of either the model of CR supply from galaxies or the\nturbulent reacceleration model.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6V4IQVMIDSgUUPz4Cn2PrOgpdQd5vte4wbUCZoetNRE","pdfSize":"1374612"}
