{"id":"2408.17180","title":"Identifying and Clustering Counter Relationships of Team Compositions in\n  PvP Games for Efficient Balance Analysis","authors":"Chiu-Chou Lin, Yu-Wei Shih, Kuei-Ting Kuo, Yu-Cheng Chen, Chien-Hua\n  Chen, Wei-Chen Chiu, I-Chen Wu","authorsParsed":[["Lin","Chiu-Chou",""],["Shih","Yu-Wei",""],["Kuo","Kuei-Ting",""],["Chen","Yu-Cheng",""],["Chen","Chien-Hua",""],["Chiu","Wei-Chen",""],["Wu","I-Chen",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 10:28:36 GMT"}],"updateDate":"2024-09-02","timestamp":1725013716000,"abstract":"  How can balance be quantified in game settings? This question is crucial for\ngame designers, especially in player-versus-player (PvP) games, where analyzing\nthe strength relations among predefined team compositions-such as hero\ncombinations in multiplayer online battle arena (MOBA) games or decks in card\ngames-is essential for enhancing gameplay and achieving balance. We have\ndeveloped two advanced measures that extend beyond the simplistic win rate to\nquantify balance in zero-sum competitive scenarios. These measures are derived\nfrom win value estimations, which employ strength rating approximations via the\nBradley-Terry model and counter relationship approximations via vector\nquantization, significantly reducing the computational complexity associated\nwith traditional win value estimations. Throughout the learning process of\nthese models, we identify useful categories of compositions and pinpoint their\ncounter relationships, aligning with the experiences of human players without\nrequiring specific game knowledge. Our methodology hinges on a simple technique\nto enhance codebook utilization in discrete representation with a deterministic\nvector quantization process for an extremely small state space. Our framework\nhas been validated in popular online games, including Age of Empires II,\nHearthstone, Brawl Stars, and League of Legends. The accuracy of the observed\nstrength relations in these games is comparable to traditional pairwise win\nvalue predictions, while also offering a more manageable complexity for\nanalysis. Ultimately, our findings contribute to a deeper understanding of PvP\ngame dynamics and present a methodology that significantly improves game\nbalance evaluation and design.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning","Computing Research Repository/Multiagent Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}