{"id":"2408.01735","title":"Something from Nothing: A Theoretical Framework for Enhancing or\n  Enabling Cooling of a Mechanical Resonator via the anti-Stokes or Stokes\n  Interaction and Zero-Photon Detection","authors":"Jack Clarke, Evan A. Cryer-Jenkins, Arjun Gupta, Kyle D. Major,\n  Jinglei Zhang, Georg Enzian, Magdalena Szczykulska, Anthony C. Leung, Harsh\n  Rathee, Andreas \\O. Svela, Anthony K. C. Tan, Almut Beige, Klaus M{\\o}lmer,\n  and Michael R. Vanner","authorsParsed":[["Clarke","Jack",""],["Cryer-Jenkins","Evan A.",""],["Gupta","Arjun",""],["Major","Kyle D.",""],["Zhang","Jinglei",""],["Enzian","Georg",""],["Szczykulska","Magdalena",""],["Leung","Anthony C.",""],["Rathee","Harsh",""],["Svela","Andreas Ø.",""],["Tan","Anthony K. C.",""],["Beige","Almut",""],["Mølmer","Klaus",""],["Vanner","Michael R.",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 10:25:15 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 15:37:08 GMT"}],"updateDate":"2024-08-07","timestamp":1722680715000,"abstract":"  We develop a theoretical framework to describe how zero-photon detection may\nbe utilized to enhance laser cooling via the anti-Stokes interaction and,\nsomewhat surprisingly, enable cooling via the Stokes interaction commonly\nassociated with heating. Our description includes both pulsed and continuous\nmeasurements as well as optical detection efficiency and open-system dynamics.\nFor both cases, we discuss how the cooling depends on the system parameters\nsuch as detection efficiency and optomechanical cooperativity, and we study the\ncontinuous-measurement-induced dynamics, contrasting to single-photon detection\nevents. For the Stokes case, we explore the interplay between cooling and\nheating via optomechanical parametric amplification, and we find the efficiency\nrequired to cool a mechanical oscillator via zero-photon detection. This work\nserves as a companion article to the recent experiment [E. A. Cryer-Jenkins, K.\nD. Major, et al., arXiv:2408.01734 (2024)], which demonstrated enhanced laser\ncooling of a mechanical oscillator via zero-photon detection on the anti-Stokes\nsignal. The framework developed here provides new approaches for cooling\nmechanical resonators that can be applied to a wide range of areas including\nnonclassical state preparation, quantum thermodynamics, and avoiding the often\nunwanted heating effects of parametric amplification.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}