{"id":"2408.00852","title":"Detection of a new sample of Galactic White Dwarfs in the direction of\n  the Small Magellanic Cloud","authors":"A.V. Sidharth, B. Shridharan, Blesson Mathew, A. Devaraj, T.B. Cysil,\n  C. S. Stalin, R. Arun, Suman Bhattacharyya, Sreeja S. Kartha, and T. Robin","authorsParsed":[["Sidharth","A. V.",""],["Shridharan","B.",""],["Mathew","Blesson",""],["Devaraj","A.",""],["Cysil","T. B.",""],["Stalin","C. S.",""],["Arun","R.",""],["Bhattacharyya","Suman",""],["Kartha","Sreeja S.",""],["Robin","T.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 18:05:58 GMT"}],"updateDate":"2024-08-05","timestamp":1722535558000,"abstract":"  In this study, we demonstrate the efficacy of the Ultraviolet Imaging\nTelescope (UVIT) in identifying and characterizing white dwarfs (WDs) within\nthe Milky Way Galaxy. Leveraging the UVIT point source catalogue towards SMC\nand crossmatching with Gaia DR3 data, we identified 43 single WDs (37 new\ndetections), 13 new WD+main sequence (MS) candidates and 161 UV bright MS stars\nby analysing their Spectral Energy Distributions (SED). Using the WD\nevolutionary models, we determine the masses, effective temperatures, and\ncooling ages of these identified WDs. Masses of these WDs range from 0.2 to 1.3\nM$_{\\odot}$ and effective temperatures (T$_{eff}$) between 10000 K to 15000 K,\nwith cooling ages spanning 0.1 to 2 Gyr. Notably, we detect hotter WDs compared\nto literature values, which is attributed to the sensitivity of UVIT.\nFurthermore, we report the detection of 20 new extremely low-mass (ELM)\ncandidates from our analysis. Future spectroscopic studies of the ELM\ncandidates will help us understand the formation scenarios of these exotic\nobjects. Despite limitations in Gaia DR3 distance measurements for optically\nfaint WDs, we provide a crude estimate of the WD space density within 1kpc as\n1.3 $\\times$ 10$^{-3}$ pc$^{-3}$, which is higher than previous estimates in\nthe literature. Our results underscore the instrumental capabilities of UVIT\nand anticipate the forthcoming UV missions like INSIST for systematic WD\ndiscovery. Our methodology sets a precedent for future analyses in other UVIT\nfields to find more WDs and perform spectroscopic studies to verify their\ncandidacy.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4G3l4lkZC7_S6u6_DHnC3U1DzoLZPKP2UV-_jwoRdTE","pdfSize":"8719634","txDigest":"BQjpfku7S5kw4ZH7zwbxVKTdfsiC1V7GpaVTD5p9gymz","endEpoch":"1","status":"CERTIFIED"}
