{"id":"2408.01502","title":"Design Optimization of Permanent-Magnet Based Compact Transport Systems\n  for Laser-Driven Proton Beams","authors":"Jared T. De Chant (1), Kei Nakamura (1), Qing Ji (1), Lieselotte\n  Obst-Huebl (1), Samuel K. Barber (1), Antoine M. Snijders (1), Thomas\n  Schenkel (1), Jeroen van Tilborg (1), Cameron G. R. Geddes (1), Carl B.\n  Schroeder (1), Eric Esarey (1) ((1) Lawrence Berkeley National Laboratory,\n  Berkeley, CA USA)","authorsParsed":[["De Chant","Jared T.",""],["Nakamura","Kei",""],["Ji","Qing",""],["Obst-Huebl","Lieselotte",""],["Barber","Samuel K.",""],["Snijders","Antoine M.",""],["Schenkel","Thomas",""],["van Tilborg","Jeroen",""],["Geddes","Cameron G. R.",""],["Schroeder","Carl B.",""],["Esarey","Eric",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 18:02:44 GMT"}],"updateDate":"2024-08-06","timestamp":1722621764000,"abstract":"  Laser-driven (LD) ion acceleration has been explored in a newly constructed\nshort focal length beamline at the BELLA petawatt facility (interaction point\n2, iP2). For applications utilizing such LD ion beams, a beam transport system\nis required, which for reasons of compactness be ideally contained within 3 m.\nThe large divergence and energy spread of LD ion beams present a unique\nchallenge to transporting them compared to beams from conventional\naccelerators. This work gives an overview of proposed compact transport designs\nthat can satisfy different requirements depending on the application for the\niP2 proton beamline such as radiation biology, material science, and high\nenergy density science. These designs are optimized for different parameters\nsuch as energy spread and peak proton density according to an application's\nneed. The various designs consist solely of permanent magnet elements, which\ncan provide high magnetic field gradients on a small footprint. While the field\nstrengths are fixed, we have shown that the beam size and energy can be tuned\neffectively by varying the placement of the magnets. The performance of each\ndesign was evaluated based on high order particle tracking simulations of\ntypical LD proton beams. A more detailed investigation was carried out for a\ndesign to deliver 10 MeV LD accelerated ions for radiation biology\napplications. With these transport system designs, the iP2 beamline is ready to\nhouse various application experiments.\n","subjects":["Physics/Accelerator Physics","Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}