{"id":"2408.10285","title":"BatGPT-Chem: A Foundation Large Model For Retrosynthesis Prediction","authors":"Yifei Yang, Runhan Shi, Zuchao Li, Shu Jiang, Bao-Liang Lu, Yang Yang,\n  Hai Zhao","authorsParsed":[["Yang","Yifei",""],["Shi","Runhan",""],["Li","Zuchao",""],["Jiang","Shu",""],["Lu","Bao-Liang",""],["Yang","Yang",""],["Zhao","Hai",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 05:17:40 GMT"}],"updateDate":"2024-08-21","timestamp":1724044660000,"abstract":"  Retrosynthesis analysis is pivotal yet challenging in drug discovery and\norganic chemistry. Despite the proliferation of computational tools over the\npast decade, AI-based systems often fall short in generalizing across diverse\nreaction types and exploring alternative synthetic pathways. This paper\npresents BatGPT-Chem, a large language model with 15 billion parameters,\ntailored for enhanced retrosynthesis prediction. Integrating chemical tasks via\na unified framework of natural language and SMILES notation, this approach\nsynthesizes extensive instructional data from an expansive chemical database.\nEmploying both autoregressive and bidirectional training techniques across over\none hundred million instances, BatGPT-Chem captures a broad spectrum of\nchemical knowledge, enabling precise prediction of reaction conditions and\nexhibiting strong zero-shot capabilities. Superior to existing AI methods, our\nmodel demonstrates significant advancements in generating effective strategies\nfor complex molecules, as validated by stringent benchmark tests. BatGPT-Chem\nnot only boosts the efficiency and creativity of retrosynthetic analysis but\nalso establishes a new standard for computational tools in synthetic design.\nThis development empowers chemists to adeptly address the synthesis of novel\ncompounds, potentially expediting the innovation cycle in drug manufacturing\nand materials science. We release our trial platform at\n\\url{https://www.batgpt.net/dapp/chem}.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}