{"id":"2408.06819","title":"Enhancing Multiview Synergy: Robust Learning by Exploiting the Wave Loss\n  Function with Consensus and Complementarity Principles","authors":"A. Quadir, Mushir Akhtar, M. Tanveer","authorsParsed":[["Quadir","A.",""],["Akhtar","Mushir",""],["Tanveer","M.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 11:25:22 GMT"}],"updateDate":"2024-08-14","timestamp":1723548322000,"abstract":"  Multiview learning (MvL) is an advancing domain in machine learning,\nleveraging multiple data perspectives to enhance model performance through\nview-consistency and view-discrepancy. Despite numerous successful\nmultiview-based SVM models, existing frameworks predominantly focus on the\nconsensus principle, often overlooking the complementarity principle.\nFurthermore, they exhibit limited robustness against noisy, error-prone, and\nview-inconsistent samples, prevalent in multiview datasets. To tackle the\naforementioned limitations, this paper introduces Wave-MvSVM, a novel multiview\nsupport vector machine framework leveraging the wave loss (W-loss) function,\nspecifically designed to harness both consensus and complementarity principles.\nUnlike traditional approaches that often overlook the complementary information\namong different views, the proposed Wave-MvSVM ensures a more comprehensive and\nresilient learning process by integrating both principles effectively. The\nW-loss function, characterized by its smoothness, asymmetry, and bounded\nnature, is particularly effective in mitigating the adverse effects of noisy\nand outlier data, thereby enhancing model stability. Theoretically, the W-loss\nfunction also exhibits a crucial classification-calibrated property, further\nboosting its effectiveness. Wave-MvSVM employs a between-view co-regularization\nterm to enforce view consistency and utilizes an adaptive combination weight\nstrategy to maximize the discriminative power of each view. The optimization\nproblem is efficiently solved using a combination of GD and the ADMM, ensuring\nreliable convergence to optimal solutions. Theoretical analyses, grounded in\nRademacher complexity, validate the generalization capabilities of the\nWave-MvSVM model. Extensive empirical evaluations across diverse datasets\ndemonstrate the superior performance of Wave-MvSVM in comparison to existing\nbenchmark models.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}