{"id":"2408.16786","title":"Jammer Mitigation in Absorptive RIS-Assisted Uplink NOMA","authors":"Azadeh Tabeshnezhad, Yuqing Zhu, Artem Vilenskiy, Van Ly Nguyen, A.\n  Lee Swindlehurst, Tommy Svensson","authorsParsed":[["Tabeshnezhad","Azadeh",""],["Zhu","Yuqing",""],["Vilenskiy","Artem",""],["Nguyen","Van Ly",""],["Swindlehurst","A. Lee",""],["Svensson","Tommy",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 10:05:37 GMT"}],"updateDate":"2024-09-02","timestamp":1724407537000,"abstract":"  Non-orthogonal multiple access (NOMA) is a promising technology for\nnext-generation wireless communication systems due to its enhanced spectral\nefficiency. In this paper, we consider an uplink NOMA system operating together\nwith a high-dimensional absorptive reconfigurable intelligent surface (A-RIS).\nWe aim to minimize the total power transmitted by the users in order to meet\nsignal-to-interference-plus-noise constraints at the base station in the\npresence of a jammer. We propose an iterative algorithm to solve the\nhigh-dimensional non-convex optimization problem using linear programming to\nfind the transmit powers and a fractional programming algorithm based on the\nDinkelbach algorithm with a sequential convex relaxation procedure to optimize\nthe reflection coefficients. We show that our algorithm converges on large\noptimization problems, with a jammer comprising as many as $64$ antennas, and\nan A-RIS with $128$ elements. Our numerical results show that, compared with a\nstandard RIS that reflects all impinging energy, the A-RIS can dramatically\nreduce the users' required transmit power and successfully mitigate\ninterference from the jammer. The absorption capability of the A-RIS is in\nparticular useful in cases when the number of jammer antennas is of the same\norder as the number of A-RIS elements.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}