{"id":"2408.15823","title":"Benchmarking foundation models as feature extractors for\n  weakly-supervised computational pathology","authors":"Peter Neidlinger, Omar S. M. El Nahhas, Hannah Sophie Muti, Tim Lenz,\n  Michael Hoffmeister, Hermann Brenner, Marko van Treeck, Rupert Langer,\n  Bastian Dislich, Hans Michael Behrens, Christoph R\\\"ocken, Sebastian Foersch,\n  Daniel Truhn, Antonio Marra, Oliver Lester Saldanha, Jakob Nikolas Kather","authorsParsed":[["Neidlinger","Peter",""],["Nahhas","Omar S. M. El",""],["Muti","Hannah Sophie",""],["Lenz","Tim",""],["Hoffmeister","Michael",""],["Brenner","Hermann",""],["van Treeck","Marko",""],["Langer","Rupert",""],["Dislich","Bastian",""],["Behrens","Hans Michael",""],["Röcken","Christoph",""],["Foersch","Sebastian",""],["Truhn","Daniel",""],["Marra","Antonio",""],["Saldanha","Oliver Lester",""],["Kather","Jakob Nikolas",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 14:34:45 GMT"}],"updateDate":"2024-08-29","timestamp":1724855685000,"abstract":"  Advancements in artificial intelligence have driven the development of\nnumerous pathology foundation models capable of extracting clinically relevant\ninformation. However, there is currently limited literature independently\nevaluating these foundation models on truly external cohorts and\nclinically-relevant tasks to uncover adjustments for future improvements. In\nthis study, we benchmarked ten histopathology foundation models on 13 patient\ncohorts with 6,791 patients and 9,493 slides from lung, colorectal, gastric,\nand breast cancers. The models were evaluated on weakly-supervised tasks\nrelated to biomarkers, morphological properties, and prognostic outcomes. We\nshow that a vision-language foundation model, CONCH, yielded the highest\nperformance in 42% of tasks when compared to vision-only foundation models. The\nexperiments reveal that foundation models trained on distinct cohorts learn\ncomplementary features to predict the same label, and can be fused to\noutperform the current state of the art. Creating an ensemble of complementary\nfoundation models outperformed CONCH in 66% of tasks. Moreover, our findings\nsuggest that data diversity outweighs data volume for foundation models. Our\nwork highlights actionable adjustments to improve pathology foundation models.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tNhnAy2jyeCxVJT1Jfh_wgJTDMd3b1YuO1_AWKTTZCM","pdfSize":"5118193"}
