{"id":"2408.01828","title":"Properties of promising cartilage implants based on\n  cellulose-polyacrylamide composite hydrogels: results of in vivo tests\n  carried out over a period of 90-120 days","authors":"Alexander Buyanov, Iosif Gofman, Svetlana Bozhkova, Natalia Saprykina,\n  Georgii Netylko and Evgenii Panarin","authorsParsed":[["Buyanov","Alexander",""],["Gofman","Iosif",""],["Bozhkova","Svetlana",""],["Saprykina","Natalia",""],["Netylko","Georgii",""],["Panarin","Evgenii",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 17:34:10 GMT"}],"updateDate":"2024-08-06","timestamp":1722706450000,"abstract":"  High-strength composite hydrogels cellulose-polyacrylamide were synthesized\nby free-radical polymerization of acrylamide conducted inside the previously\nformed physical network of regenerated plant cellulose. Partial hydrolysis of\nthe amide groups of these hydrogels yielded their ionic forms with a degree of\nhydrolysis of 0.1 and 0.25. The cylindrical hydrogel samples of three\ncompositions were implanted in the preformed osteochondral defects of the\nrabbit's femoral knee joints. No signs of migration or disintegration of the\ntested implants were revealed in the course of in vivo tests as long as 90 and\n120 days after the implantation. The mechanical behavior of both the virgin\nhydrogels-implants and the implants extracted from the joints after in vivo\nexperiments was studied in detail. The morphology and chemical composition of\nthe extracted implants were studied by SEM combined with the EDX method. The\nresults obtained were shown that the mechanical characteristics of hydrogel\nimplants remained practically unchanged after in vivo tests. The extracted\nimplants, as well as the initial hydrogels, endured cyclic compression loading\nat the amplitude up to 50 %. Compression stresses up to 3-10 MPa were recorded\nin these tests, which is close to the data obtained by several authors for\nnatural articular cartilages in the same conditions of loading. The principal\ndifferences in the chemical composition and morphology of the implant area\nadjacent to the subchondral bone for non-ionic and ionic types of implants have\nbeen revealed. If for non-ionic types of implants in this area intensive\nmineralization with formation of calcium phosphates inside the polymeric\nhydrogel network is observed, the border area of ionic implants practically\ndoes not undergo mineralization.\n","subjects":["Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}