{"id":"2408.15357","title":"On the effectiveness of smartphone IMU sensors and Deep Learning in the\n  detection of cardiorespiratory conditions","authors":"Lorenzo Simone, Luca Miglior, Vincenzo Gervasi, Luca Moroni, Emanuele\n  Vignali, Emanuele Gasparotti, Simona Celi","authorsParsed":[["Simone","Lorenzo",""],["Miglior","Luca",""],["Gervasi","Vincenzo",""],["Moroni","Luca",""],["Vignali","Emanuele",""],["Gasparotti","Emanuele",""],["Celi","Simona",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 18:29:47 GMT"}],"updateDate":"2024-08-29","timestamp":1724783387000,"abstract":"  This research introduces an innovative method for the early screening of\ncardiorespiratory diseases based on an acquisition protocol, which leverages\ncommodity smartphone's Inertial Measurement Units (IMUs) and deep learning\ntechniques. We collected, in a clinical setting, a dataset featuring recordings\nof breathing kinematics obtained by accelerometer and gyroscope readings from\nfive distinct body regions. We propose an end-to-end deep learning pipeline for\nearly cardiorespiratory disease screening, incorporating a preprocessing step\nsegmenting the data into individual breathing cycles, and a recurrent\nbidirectional module capturing features from diverse body regions. We employed\nLeave-one-out-cross-validation with Bayesian optimization for hyperparameter\ntuning and model selection. The experimental results consistently demonstrated\nthe superior performance of a bidirectional Long-Short Term Memory (Bi-LSTM) as\na feature encoder architecture, yielding an average sensitivity of $0.81 \\pm\n0.02$, specificity of $0.82 \\pm 0.05$, F1 score of $0.81 \\pm 0.02$, and\naccuracy of $80.2\\% \\pm 3.9$ across diverse seed variations. We also assessed\ngeneralization capabilities on a skewed distribution, comprising exclusively\nhealthy patients not used in training, revealing a true negative rate of $74.8\n\\% \\pm 4.5$. The sustained accuracy of predictions over time during breathing\ncycles within a single patient underscores the efficacy of the preprocessing\nstrategy, highlighting the model's ability to discern significant patterns\nthroughout distinct phases of the respiratory cycle. This investigation\nunderscores the potential usefulness of widely available smartphones as devices\nfor timely cardiorespiratory disease screening in the general population, in\nat-home settings, offering crucial assistance to public health efforts\n(especially during a pandemic outbreaks, such as the recent COVID-19).\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"E9pUTv_x7TGH-EBTXYbCcJmA8XG9z0qUnjmgFuEvcpM","pdfSize":"5007852"}
