{"id":"2408.05054","title":"Graph Neural Networks as Ordering Heuristics for Parallel Graph Coloring","authors":"Kenneth Langedal and Fredrik Manne","authorsParsed":[["Langedal","Kenneth",""],["Manne","Fredrik",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 13:21:08 GMT"}],"updateDate":"2024-08-12","timestamp":1723209668000,"abstract":"  The graph coloring problem asks for an assignment of the minimum number of\ndistinct colors to vertices in an undirected graph with the constraint that no\npair of adjacent vertices share the same color. The problem is a thoroughly\nstudied NP-hard combinatorial problem with several real-world applications. As\nsuch, a number of greedy heuristics have been suggested that strike a good\nbalance between coloring quality, execution time, and also parallel\nscalability. In this work, we introduce a graph neural network (GNN) based\nordering heuristic and demonstrate that it outperforms existing greedy ordering\nheuristics both on quality and performance. Previous results have demonstrated\nthat GNNs can produce high-quality colorings but at the expense of excessive\nrunning time. The current paper is the first that brings the execution time\ndown to compete with existing greedy heuristics. Our GNN model is trained using\nboth supervised and unsupervised techniques. The experimental results show that\na 2-layer GNN model can achieve execution times between the largest degree\nfirst (LF) and smallest degree last (SL) ordering heuristics while\noutperforming both on coloring quality. Increasing the number of layers\nimproves the coloring quality further, and it is only at four layers that SL\nbecomes faster than the GNN. Finally, our GNN-based coloring heuristic achieves\nsuperior scaling in the parallel setting compared to both SL and LF.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fHtHuTpjFMfNI4Dn-74MQCXzDgWXl5lX2oMDQmV2qzU","pdfSize":"239969"}
