{"id":"2408.00840","title":"Violent White Dwarf Mergers or Collisions Produce Type Ia Supernovae in\n  Elliptical Galaxies","authors":"Michael A. Tucker","authorsParsed":[["Tucker","Michael A.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 18:00:07 GMT"}],"updateDate":"2024-08-05","timestamp":1722535207000,"abstract":"  I find that Type Ia supernovae (SNe Ia) with bimodal nebular emission\nprofiles occur almost exclusively in massive ($M_\\star \\gtrsim\n10^{11}~M_\\odot$) galaxies with low star-formation rates (SFR~$\\lesssim\n0.5~M_\\odot$/yr). The bimodal profiles are likely produced by two white dwarfs\nthat exploded during a merger or collision, supported by a correlation between\nthe peak-to-peak velocity separation ($v_{\\rm sep}$) and the SN Ia peak\nluminosity ($M_V$) which arises naturally from more massive white dwarf\nbinaries synthesizing more $^{56}$Ni during the explosion. The quiescent hosts\nare consistent with the long delay times required to form double white dwarf\nbinaries. The distributions of SNe Ia with and without bimodal nebular lines\ndiffer in host mass, SFR, and specific SFR with K-S test probabilities of\n$3.1\\%$, $0.03\\%$, and $0.02\\%$, respectively. Viewing angle effects can fully\nexplain the SNe Ia in quiescent hosts without bimodal emission profiles and the\ndearth of merger/collision driven SNe Ia in star-forming hosts requires at\nleast two distinct progenitor channels for normal SNe Ia. $30-40\\%$ of all SNe\nIa originate from mergers or collisions depending on how cleanly host\nenvironment distinguishes progenitor scenarios. The bimodal SNe Ia share some\ncharacteristics with the underluminous 91bg-like SNe Ia that also prefer older\npopulations, but there is no unambiguous connection between the two\nclassifications. This may suggest separate processes or multiple axes of ejecta\n(a)symmetry. Existing models for WD mergers and collisions broadly reproduce\nthe $v_{\\rm sep} - M_V$ correlation and future analyses may be able to infer\nthe masses/mass-ratios of merging white dwarfs in external galaxies.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}