{"id":"2408.04566","title":"Randomness versus Nonlocality in Multi-input and Multi-output Quantum\n  Scenario","authors":"Chao Zhang, Yi Li, Xiao-Min Hu, Yu Xiang, Chuan-Feng Li, Guang-Can\n  Guo, Jordi Tura, Qihuang Gong, Qiongyi He, and Bi-Heng Liu","authorsParsed":[["Zhang","Chao",""],["Li","Yi",""],["Hu","Xiao-Min",""],["Xiang","Yu",""],["Li","Chuan-Feng",""],["Guo","Guang-Can",""],["Tura","Jordi",""],["Gong","Qihuang",""],["He","Qiongyi",""],["Liu","Bi-Heng",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 16:25:23 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 12:57:47 GMT"}],"updateDate":"2024-09-06","timestamp":1723134323000,"abstract":"  Device-independent randomness certification based on Bell nonlocality does\nnot require any assumptions about the devices and therefore provides adequate\nsecurity. Great effort has been made to demonstrate that nonlocality is\nnecessary for generating quantum randomness, but the minimal resource required\nfor random number generation has not been clarified. Here we first prove and\nexperimentally demonstrate that violating any two-input Bell inequality is both\nnecessary and sufficient for certifying randomness, however, for the\nmulti-input cases, this sufficiency ceases to apply, leading to certain states\nexhibiting Bell nonlocality without the capability to certify randomness. We\nexamine two typical classes of Bell inequalities with multi-input and\nmulti-output, the facet inequalities and\nSalavrakos-Augusiak-Tura-Wittek-Ac\\'in-Pironio Bell inequalities, in the\nhigh-dimensional photonic system, and observe the violation of the latter one\ncan always certify randomness which is not true for the former. The private\nrandomness with a generation rate of 1.867\\pm0.018 bits per photon pair is\nobtained in the scenario of Salavrakos-Augusiak-Tura-Wittek-Ac\\'in-Pironio Bell\ninequalities with 3-input and 4-output. Our work unravels the internal\nconnection between randomness and nonlocality, and effectively enhances the\nperformance of tasks such as device-independent random number generation.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}