{"id":"2408.11805","title":"ACE: A Cross-Platform Visual-Exoskeletons System for Low-Cost Dexterous\n  Teleoperation","authors":"Shiqi Yang and Minghuan Liu and Yuzhe Qin and Runyu Ding and Jialong\n  Li and Xuxin Cheng and Ruihan Yang and Sha Yi and Xiaolong Wang","authorsParsed":[["Yang","Shiqi",""],["Liu","Minghuan",""],["Qin","Yuzhe",""],["Ding","Runyu",""],["Li","Jialong",""],["Cheng","Xuxin",""],["Yang","Ruihan",""],["Yi","Sha",""],["Wang","Xiaolong",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 17:48:31 GMT"}],"updateDate":"2024-08-22","timestamp":1724262511000,"abstract":"  Learning from demonstrations has shown to be an effective approach to robotic\nmanipulation, especially with the recently collected large-scale robot data\nwith teleoperation systems. Building an efficient teleoperation system across\ndiverse robot platforms has become more crucial than ever. However, there is a\nnotable lack of cost-effective and user-friendly teleoperation systems for\ndifferent end-effectors, e.g., anthropomorphic robot hands and grippers, that\ncan operate across multiple platforms. To address this issue, we develop ACE, a\ncross-platform visual-exoskeleton system for low-cost dexterous teleoperation.\nOur system utilizes a hand-facing camera to capture 3D hand poses and an\nexoskeleton mounted on a portable base, enabling accurate real-time capture of\nboth finger and wrist poses. Compared to previous systems, which often require\nhardware customization according to different robots, our single system can\ngeneralize to humanoid hands, arm-hands, arm-gripper, and quadruped-gripper\nsystems with high-precision teleoperation. This enables imitation learning for\ncomplex manipulation tasks on diverse platforms.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"faBgZgE2gwI-qJsTrfyP7QJhjDJW-uQjsOINLMGrUv8","pdfSize":"11389670"}
