{"id":"2408.13922","title":"COMPOSE: Comprehensive Portrait Shadow Editing","authors":"Andrew Hou, Zhixin Shu, Xuaner Zhang, He Zhang, Yannick Hold-Geoffroy,\n  Jae Shin Yoon, Xiaoming Liu","authorsParsed":[["Hou","Andrew",""],["Shu","Zhixin",""],["Zhang","Xuaner",""],["Zhang","He",""],["Hold-Geoffroy","Yannick",""],["Yoon","Jae Shin",""],["Liu","Xiaoming",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 19:18:18 GMT"}],"updateDate":"2024-08-27","timestamp":1724613498000,"abstract":"  Existing portrait relighting methods struggle with precise control over\nfacial shadows, particularly when faced with challenges such as handling hard\nshadows from directional light sources or adjusting shadows while remaining in\nharmony with existing lighting conditions. In many situations, completely\naltering input lighting is undesirable for portrait retouching applications:\none may want to preserve some authenticity in the captured environment.\nExisting shadow editing methods typically restrict their application to just\nthe facial region and often offer limited lighting control options, such as\nshadow softening or rotation. In this paper, we introduce COMPOSE: a novel\nshadow editing pipeline for human portraits, offering precise control over\nshadow attributes such as shape, intensity, and position, all while preserving\nthe original environmental illumination of the portrait. This level of\ndisentanglement and controllability is obtained thanks to a novel decomposition\nof the environment map representation into ambient light and an editable\ngaussian dominant light source. COMPOSE is a four-stage pipeline that consists\nof light estimation and editing, light diffusion, shadow synthesis, and finally\nshadow editing. We define facial shadows as the result of a dominant light\nsource, encoded using our novel gaussian environment map representation.\nUtilizing an OLAT dataset, we have trained models to: (1) predict this light\nsource representation from images, and (2) generate realistic shadows using\nthis representation. We also demonstrate comprehensive and intuitive shadow\nediting with our pipeline. Through extensive quantitative and qualitative\nevaluations, we have demonstrated the robust capability of our system in shadow\nediting.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}