{"id":"2408.00882","title":"Benchmarking Attacks on Learning with Errors","authors":"Emily Wenger, Eshika Saxena, Mohamed Malhou, Ellie Thieu, Kristin\n  Lauter","authorsParsed":[["Wenger","Emily",""],["Saxena","Eshika",""],["Malhou","Mohamed",""],["Thieu","Ellie",""],["Lauter","Kristin",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 19:21:20 GMT"}],"updateDate":"2024-08-05","timestamp":1722540080000,"abstract":"  Lattice cryptography schemes based on the learning with errors (LWE) hardness\nassumption have been standardized by NIST for use as post-quantum\ncryptosystems, and by HomomorphicEncryption.org for encrypted compute on\nsensitive data. Thus, understanding their concrete security is critical. Most\nwork on LWE security focuses on theoretical estimates of attack performance,\nwhich is important but may overlook attack nuances arising in real-world\nimplementations. The sole existing concrete benchmarking effort, the Darmstadt\nLattice Challenge, does not include benchmarks relevant to the standardized LWE\nparameter choices - such as small secret and small error distributions, and\nRing-LWE (RLWE) and Module-LWE (MLWE) variants. To improve our understanding of\nconcrete LWE security, we provide the first benchmarks for LWE secret recovery\non standardized parameters, for small and low-weight (sparse) secrets. We\nevaluate four LWE attacks in these settings to serve as a baseline: the\nSearch-LWE attacks uSVP, SALSA, and Cool & Cruel, and the Decision-LWE attack:\nDual Hybrid Meet-in-the-Middle (MitM). We extend the SALSA and Cool & Cruel\nattacks in significant ways, and implement and scale up MitM attacks for the\nfirst time. For example, we recover hamming weight $9-11$ binomial secrets for\nKYBER ($\\kappa=2$) parameters in $28-36$ hours with SALSA and Cool\\&Cruel,\nwhile we find that MitM can solve Decision-LWE instances for hamming weights up\nto $4$ in under an hour for Kyber parameters, while uSVP attacks do not recover\nany secrets after running for more than $1100$ hours. We also compare concrete\nperformance against theoretical estimates. Finally, we open source the code to\nenable future research.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YfE0BSl0oL6sDqhBoaW_tpIYPD90np02VZ_63IQ1mnE","pdfSize":"858296","txDigest":"739QG3xZ96Nk2RHD8UkzSWTVhraUB91R3eGTfvD12KkW","endEpoch":"1","status":"CERTIFIED"}
