{"id":"2408.16352","title":"Embedding classic chaotic maps in simple discrete-time memristor\n  circuits","authors":"Mauro Di Marco, Mauro Forti, Giacomo Innocenti, Luca Pancioni, Alberto\n  Tesi","authorsParsed":[["Di Marco","Mauro",""],["Forti","Mauro",""],["Innocenti","Giacomo",""],["Pancioni","Luca",""],["Tesi","Alberto",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 08:47:06 GMT"},{"version":"v2","created":"Sat, 31 Aug 2024 07:27:42 GMT"}],"updateDate":"2024-09-04","timestamp":1724921226000,"abstract":"  In the last few years the literature has witnessed a remarkable surge of\ninterest for chaotic maps implemented by discrete-time (DT) memristor circuits.\nThis paper investigates on the reasons underlying this type of chaotic\nbehavior. To this end, the papers considers the map implemented by the simplest\nmemristor circuit given by a capacitor and an ideal flux-controlled memristor\nor an inductor and an ideal charge-controlled memristor. In particular, the\nmanuscript uses the DT flux-charge analysis method (FCAM) introduced in a\nrecent paper to ensure that the first integrals and foliation in invariant\nmanifolds of continuous-time (CT) memristor circuits are preserved exactly in\nthe discretization for any step size. DT-FCAM yields a two-dimensional map in\nthe voltage-current domain (VCD) and a manifold-dependent one-dimensional map\nin the flux-charge domain (FCD), i.e., a one-dimensional map on each invariant\nmanifold. One main result is that, for suitable choices of the circuit\nparameters and memristor nonlinearities, both DT circuits can exactly embed two\nclassic chaotic maps, i.e., the logistic map and the tent map. Moreover, due to\nthe property of extreme multistability, the DT circuits can simultaneously\nembed in the manifolds all the dynamics displayed by varying one parameter in\nthe logistic and tent map. The paper then considers a DT memristor\nMurali-Lakshmanan-Chua circuit and its dual. Via DT-FCAM these circuits\nimplement a three-dimensional map in the VCD and a two-dimensional map on each\ninvariant manifold in the FCD. It is shown that both circuits can\nsimultaneously embed in the manifolds all the dynamics displayed by two other\nclassic chaotic maps, i.e., the Henon map and the Lozi map, when varying one\nparameter in such maps. In essence, these results provide an explanation of why\nit is not surprising to observe complex dynamics even in simple DT memristor\ncircuits.\n","subjects":["Nonlinear Sciences/Chaotic Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"D03L6BEFzCBZn7GLWacq7QHOPjNZbrAuZN1fKvuo5NA","pdfSize":"11411321"}
