{"id":"2408.07764","title":"Constant-Overhead Magic State Distillation","authors":"Adam Wills, Min-Hsiu Hsieh, Hayata Yamasaki","authorsParsed":[["Wills","Adam",""],["Hsieh","Min-Hsiu",""],["Yamasaki","Hayata",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 18:31:22 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 03:22:09 GMT"}],"updateDate":"2024-08-22","timestamp":1723660282000,"abstract":"  Magic state distillation is a crucial yet resource-intensive process in\nfault-tolerant quantum computation. The protocol's overhead, defined as the\nnumber of input magic states required per output magic state with an error rate\nbelow $\\epsilon$, typically grows as $\\mathcal{O}(\\log^\\gamma(1/\\epsilon))$.\nAchieving smaller overheads, i.e., smaller exponents $\\gamma$, is highly\ndesirable; however, all existing protocols require polylogarithmically growing\noverheads with some $\\gamma > 0$, and identifying the smallest achievable\nexponent $\\gamma$ for distilling magic states of qubits has remained\nchallenging. To address this issue, we develop magic state distillation\nprotocols for qubits with efficient, polynomial-time decoding that achieve an\n$\\mathcal{O}(1)$ overhead, meaning the optimal exponent $\\gamma = 0$; this\nimproves over the previous best of $\\gamma \\approx 0.678$ due to Hastings and\nHaah. In our construction, we employ algebraic geometry codes to explicitly\npresent asymptotically good quantum codes for $2^{10}$-dimensional qudits that\nsupport transversally implementable logical gates in the third level of the\nClifford hierarchy. The use of asymptotically good codes with non-vanishing\nrate and relative distance leads to the constant overhead. These codes can be\nrealised by representing each $2^{10}$-dimensional qudit as a set of $10$\nqubits, using stabiliser operations on qubits. The $10$-qubit magic states\ndistilled with these codes can be converted to and from conventional magic\nstates for the controlled-controlled-$Z$ ($CCZ$) and $T$ gates on qubits with\nonly a constant overhead loss, making it possible to achieve constant-overhead\ndistillation of such standard magic states for qubits. These results resolve\nthe fundamental open problem in quantum information theory concerning the\nconstruction of magic state distillation protocols with the optimal exponent.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}