{"id":"2408.09196","title":"Maintainability Challenges in ML: A Systematic Literature Review","authors":"Karthik Shivashankar, Antonio Martini","authorsParsed":[["Shivashankar","Karthik",""],["Martini","Antonio",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 13:24:15 GMT"}],"updateDate":"2024-08-20","timestamp":1723901055000,"abstract":"  Background: As Machine Learning (ML) advances rapidly in many fields, it is\nbeing adopted by academics and businesses alike. However, ML has a number of\ndifferent challenges in terms of maintenance not found in traditional software\nprojects. Identifying what causes these maintainability challenges can help\nmitigate them early and continue delivering value in the long run without\ndegrading ML performance. Aim: This study aims to identify and synthesise the\nmaintainability challenges in different stages of the ML workflow and\nunderstand how these stages are interdependent and impact each other's\nmaintainability. Method: Using a systematic literature review, we screened more\nthan 13000 papers, then selected and qualitatively analysed 56 of them.\nResults: (i) a catalogue of maintainability challenges in different stages of\nData Engineering, Model Engineering workflows and the current challenges when\nbuilding ML systems are discussed; (ii) a map of 13 maintainability challenges\nto different interdependent stages of ML that impact the overall workflow;\n(iii) Provided insights to developers of ML tools and researchers. Conclusions:\nIn this study, practitioners and organisations will learn about maintainability\nchallenges and their impact at different stages of ML workflow. This will\nenable them to avoid pitfalls and help to build a maintainable ML system. The\nimplications and challenges will also serve as a basis for future research to\nstrengthen our understanding of the ML system's maintainability.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"pkddTuSdM2KLwdVCf2nWAeS-Nr4Ymrq56jdYsfuExlk","pdfSize":"547428"}
