{"id":"2408.13095","title":"Energy-efficient field-free unconventional spin-orbit torque\n  magnetization switching dynamics in van der Waals heterostructures","authors":"Lalit Pandey, Bing Zhao, Roselle Ngaloy, Himanshu Bangar, Aya Ali,\n  Mahmoud Abdel-Hafiez, Gaojie Zhang, Hao Wu, Haixin Chang, Lars Sj\\\"ostr\\\"om,\n  Prasanna Rout, Saroj P. Dash","authorsParsed":[["Pandey","Lalit",""],["Zhao","Bing",""],["Ngaloy","Roselle",""],["Bangar","Himanshu",""],["Ali","Aya",""],["Abdel-Hafiez","Mahmoud",""],["Zhang","Gaojie",""],["Wu","Hao",""],["Chang","Haixin",""],["Sjöström","Lars",""],["Rout","Prasanna",""],["Dash","Saroj P.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 14:20:19 GMT"}],"updateDate":"2024-08-26","timestamp":1724422819000,"abstract":"  The van der Waals (vdW) heterostructure of emerging two-dimensional (2D)\nquantum materials, with control over their quantum geometries, crystal\nsymmetries, spin-orbit coupling, and magnetic anisotropies, provides a new\nplatform for generating unconventional nonlinear Hall effects, spin\npolarization and efficiently controlling the magnetization dynamics for\nnon-volatile spin-based computing. However, so far, the generation of a large\nout-of-plane spin polarization is limited to achieve energy-efficient\nfield-free magnetization switching and spin dynamics measurements in all-2D vdW\nheterostructure are so far missing, where the interplay between spins and\nmagnetization dynamics should enable the design of ultrafast spintronic\ndevices. Here, we demonstrate magnetization dynamics and energy-efficient\nfield-free spin-orbit torque (SOT) switching of out-of-plane magnet Fe3GaTe2\ndue to unconventional Berry curvature-induced out-of-plane spin polarization\nfrom a topological Weyl semimetal TaIrTe4 in a vdW heterostructure at room\ntemperature. We observed a large non-linear 2nd harmonic Hall signal at room\ntemperature and evaluated the SOT-induced magnetization dynamics with a large\ndamping-like torque. Deterministic field-free SOT magnetization switching in\nvdW heterostructure of TaIrTe4/Fe3GaTe2 is observed at room temperature with a\nlow current and power density, which is an order of magnitude better than that\nof conventional systems. From the magnetization switching experiments, a large\nSOT efficiency and a very large spin Hall conductivity. These findings on\nall-vdW heterostructures offer a promising route to energy-efficient and\nexternal field-free ultrafast spintronic technologies.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}