{"id":"2408.10329","title":"Hysteretic response to different modes of ramping an external field in\n  sparse and dense Ising spin glasses","authors":"Mahajabin Rahman and Stefan Boettcher (Emory U)","authorsParsed":[["Rahman","Mahajabin","","Emory U"],["Boettcher","Stefan","","Emory U"]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:11:58 GMT"}],"updateDate":"2024-08-21","timestamp":1724091118000,"abstract":"  We consider the hysteretic behavior of Ising spin glasses at $T=0$ for\nvarious modes of driving. Previous studies mostly focused on an infinitely slow\nspeed $\\dot{H}$ by which the external field $H$ was ramped to trigger\navalanches of spin flips by starting with destabilizing a single spin while few\nhave focused on the effect of different driving methods. First, we show that\nthis conventional protocol imposes a system size dependence. Then, we\nnumerically analyze the response of Ising spin glasses at rates $\\dot{H}$ that\nare fixed as well, to elucidate the differences in the response. Specifically,\nwe compare three different modes of ramping ($\\dot{H}=c/N$,\n$\\dot{H}=c/\\sqrt{N}$, and $\\dot{H}=c$ for constant $c$) for two types of spin\nglass systems of size $N$, representing dense networks by the\nSherrington-Kirkpatrick model and sparse networks by the lattice spin glass in\n$d=3$ dimensions known as the Edwards Anderson model. Depending on the mode of\nramping, we find that the response of each system, in form of spin-flip\navalanches and other observables, can vary considerably. In particular, in the\n$N$-independent mode applied to the lattice spin glass, which is closest to\nexperimental reality, we observe a percolation transition with a broad\navalanche distribution between phases of localized and system-spanning\nresponses. We explore implications for combinatorial optimization problems\npertaining to sparse systems.\n","subjects":["Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Soft Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}