{"id":"2408.13077","title":"The Radio Spectra of High Luminosity Compact Symmetric Objects (CSO-2s):\n  Implications for Studies of Compact Jetted Active Galactic Nuclei","authors":"P. V. de la Parra, A.C.S Readhead, T. Herbig, S. Kiehlmann, M.L.\n  Lister, V. Pavlidou, R.A. Reeves, A. Siemiginowska, A. G. Sullivan, T. Surti,\n  A. Synani, K. Tassis, G.B. Taylor, P.N. Wilkinson, M.F. Aller, R. D.\n  Blandford, N. Globus, C. R. Lawrence, B. Molina, S. O'Neill, T. J. Pearson","authorsParsed":[["de la Parra","P. V.",""],["Readhead","A. C. S",""],["Herbig","T.",""],["Kiehlmann","S.",""],["Lister","M. L.",""],["Pavlidou","V.",""],["Reeves","R. A.",""],["Siemiginowska","A.",""],["Sullivan","A. G.",""],["Surti","T.",""],["Synani","A.",""],["Tassis","K.",""],["Taylor","G. B.",""],["Wilkinson","P. N.",""],["Aller","M. F.",""],["Blandford","R. D.",""],["Globus","N.",""],["Lawrence","C. R.",""],["Molina","B.",""],["O'Neill","S.",""],["Pearson","T. J.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 14:00:31 GMT"}],"updateDate":"2024-08-26","timestamp":1724421631000,"abstract":"  This paper addresses, for the first time, a key aspect of the phenomenology\nof Compact Symmetric Objects (CSOs) -- the characteristics of their radio\nspectra. We present a radio-spectrum description of a complete sample of high\nluminosity CSOs (CSO-2s), which shows that they exhibit the \\textit{complete}\nrange of spectral types, including flat-spectrum sources ($\\alpha \\ge -0.5$),\nsteep-spectrum sources ($\\alpha < -0.5$), and peaked-spectrum sources. We show\nthat there is no clear correlation between spectral type and size, but there is\na correlation between the high-frequency spectral index and both object type\nand size. We also show that, to avoid biasing the data and to understand the\nvarious classes of jetted-AGN involved, the complete range of spectral types\nshould be included in studying the general phenomenology of compact jetted-AGN,\nand that complete samples must be used, selected over a wide range of\nfrequencies. We discuss examples that demonstrate these points. We find that\nthe high-frequency spectral indices of CSO-2s span $-1.3 <\\alpha_{\\rm hi} <\n-0.3$, and hence that radio spectral signatures cannot be used to discriminate\ndefinitively between CSO-2s, binary galactic nuclei, and millilensed objects,\nunless they have $\\alpha_{\\rm hi} >-0.3$.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}