{"id":"2408.01076","title":"Exploiting the Semantic Knowledge of Pre-trained Text-Encoders for\n  Continual Learning","authors":"Lu Yu, Zhe Tao, Hantao Yao, Joost Van de Weijer and Changsheng Xu","authorsParsed":[["Yu","Lu",""],["Tao","Zhe",""],["Yao","Hantao",""],["Van de Weijer","Joost",""],["Xu","Changsheng",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 07:51:44 GMT"}],"updateDate":"2024-08-05","timestamp":1722585104000,"abstract":"  Deep neural networks (DNNs) excel on fixed datasets but struggle with\nincremental and shifting data in real-world scenarios. Continual learning\naddresses this challenge by allowing models to learn from new data while\nretaining previously learned knowledge. Existing methods mainly rely on visual\nfeatures, often neglecting the rich semantic information encoded in text. The\nsemantic knowledge available in the label information of the images, offers\nimportant semantic information that can be related with previously acquired\nknowledge of semantic classes. Consequently, effectively leveraging this\ninformation throughout continual learning is expected to be beneficial. To\naddress this, we propose integrating semantic guidance within and across tasks\nby capturing semantic similarity using text embeddings. We start from a\npre-trained CLIP model, employ the \\emph{Semantically-guided Representation\nLearning (SG-RL)} module for a soft-assignment towards all current task\nclasses, and use the Semantically-guided Knowledge Distillation (SG-KD) module\nfor enhanced knowledge transfer. Experimental results demonstrate the\nsuperiority of our method on general and fine-grained datasets. Our code can be\nfound in\nhttps://github.com/aprilsveryown/semantically-guided-continual-learning.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"QT6-pPd1HvPN5n7UQmAMpcQs0Hvye0hrerUKWWE5V4g","pdfSize":"10368655","txDigest":"9ooqxhSWgtms59PKBhCqvCiMtun95Rp1rQddZc4r2Bsk","endEpoch":"1","status":"CERTIFIED"}
