{"id":"2408.07491","title":"Soliton radiation and role of the energy dissipation in soliton dynamics\n  in an oscillating magnetic field","authors":"Larissa Brizhik","authorsParsed":[["Brizhik","Larissa",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 12:12:50 GMT"}],"updateDate":"2024-08-15","timestamp":1723637570000,"abstract":"  Dynamics of the Davydov's soliton in an external oscillating in time magnetic\nfield is studied analytically. It is shown that in a field perpendicular to the\nmolecular chain axis, soliton wavefunction is a product of the electron plane\nwave in the plane perpendicular to the molecular chain, and longitudinal\ncomponent of the wavefunction which satisfies the modified nonlinear\nSchroedinger equation with an extra term determined by the field. It is shown\nthat soliton width and amplitude are constant, while its velocity and phase are\noscillating functions of time with the frequency of the main harmonic equal to\nthe magnetic field frequency. It is shown that soliton dynamics has two\ndifferent regimes at low and high frequencies of the magnetic field as\ncomparing with the characteristic soliton frequency. Due to time-depending\nvelocity and nonzero acceleration, soliton radiates linear waves in both\ndirections from its center of mass. In the presence of energy dissipation,\nsoliton velocity is bound from above due to the balance of the energy gain from\nthe magnetic field, and its loss because of the dissipation and radiation of\nlinear sound waves. This balance occurs at the resonant frequency of the\nmagnetic field. It is concluded that such significant impact of time-depending\nmagnetic field on charge transport, provided by solitons, can affect\nfunctioning of the devices based on low-dimensional moolecular systems. These\nresults suggest the physical mechanism of therapeutic effects of oscillating\nmagnetic fields.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}