{"id":"2408.14464","title":"Eclipse mapping study of the eclipsing binary KIC~3858884 with hybrid\n  $\\delta$~Sct/$\\gamma$~Dor component","authors":"A. B\\'okon, I. B. B\\'ir\\'o, A. Derekas","authorsParsed":[["Bókon","A.",""],["Bíró","I. B.",""],["Derekas","A.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 17:54:46 GMT"}],"updateDate":"2024-08-27","timestamp":1724694886000,"abstract":"  Pulsating stars in eclipsing binary systems offer a unique possibility to\nempirically identify pulsation modes using the geometric effect of the eclipses\non the pulsation signals. Here we explore the $\\delta$ Scuti type pulsations in\nthe eclipsing binary system KIC~3858884 with the aim of identifying the\ndominant modes using various photometric methods. We used the \\textit{Kepler}\nshort cadence photometry data. Refined binary model and pulsation parameters\nwere determined using an iterative separation of the eclipsing binary and\npulsation signals. We used various methods to identify the host stars of the\ndominant pulsations. \\'Echelle diagram diagnostics were employed to locate the\nfrequencies with most influence from the eclipses. Direct Fitting methods\nassuming spherical harmonic surface patterns were explored to determine an\norientation for the symmetry axis and to infer surface mode numbers $\\ell$ and\n$m$. General surface patterns were reconstructed using dynamic eclipse mapping,\nand provided ancillary mode number estimates. We established the secondary star\nas the main source of the pulsations. Seven peaks, including the two strongest\nmodes, were found to show modulations during the secondary eclipses. For the\nfirst time ever, we could detect two hidden modes with amplitude\nintensification during the eclipses. Only one frequency appears to originate\nfrom the primary. We successfully reconstructed surface patterns and determined\nmode numbers for most of the selected frequencies with both of our methods. One\nradial and three sectoral modes, among them hidden modes. The two hidden modes\nwere identified as (3,$\\pm$1) and (2,$\\pm$1). One additional radial mode turned\nout to be a combination frequency. Partial disagreement between EM and DF\nresults may indicate that the strongest modes deviate from strict spherical\nharmonics.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"JuflOaT7oyacHOPVAV25TdbESJQN6_bQK2OmbhS6w1Y","pdfSize":"1385978"}
