{"id":"2408.01241","title":"Exchange control in a MOS double quantum dot made using a 300 mm wafer\n  process","authors":"Jacob F. Chittock-Wood, Ross C. C. Leon, Michael A. Fogarty, Tara\n  Murphy, Sofia M. Patom\\\"aki, Giovanni A. Oakes, Felix-Ekkehard von Horstig,\n  Nathan Johnson, Julien Jussot, Stefan Kubicek, Bogdan Govoreanu, David F.\n  Wise, M. Fernando Gonzalez-Zalba, John J. L. Morton","authorsParsed":[["Chittock-Wood","Jacob F.",""],["Leon","Ross C. C.",""],["Fogarty","Michael A.",""],["Murphy","Tara",""],["Patomäki","Sofia M.",""],["Oakes","Giovanni A.",""],["von Horstig","Felix-Ekkehard",""],["Johnson","Nathan",""],["Jussot","Julien",""],["Kubicek","Stefan",""],["Govoreanu","Bogdan",""],["Wise","David F.",""],["Gonzalez-Zalba","M. Fernando",""],["Morton","John J. L.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 13:00:10 GMT"},{"version":"v2","created":"Sat, 10 Aug 2024 18:02:11 GMT"}],"updateDate":"2024-08-13","timestamp":1722603610000,"abstract":"  Leveraging the advanced manufacturing capabilities of the semiconductor\nindustry promises to help scale up silicon-based quantum processors by\nincreasing yield, uniformity and integration. Recent studies of quantum dots\nfabricated on 300 mm wafer metal-oxide-semiconductor (MOS) processes have shown\ncontrol and readout of individual spin qubits, yet quantum processors require\ntwo-qubit interactions to operate. Here, we use a 300 mm wafer MOS process\ncustomized for spin qubits and demonstrate coherent control of two electron\nspins using the spin-spin exchange interaction, forming the basis of an\nentangling gate such as $\\sqrt{\\text{SWAP}}$. We observe gate dephasing times\nof up to $T_2^{*}\\approx500$ ns and a gate quality factor of 10. We further\nextend the coherence by up to an order of magnitude using an echo sequence. For\nreadout, we introduce a dispersive readout technique, the radiofrequency\nelectron cascade, that amplifies the signal while retaining the spin-projective\nnature of dispersive measurements. Our results demonstrate an industrial grade\nplatform for two-qubit operations, alongside integration with dispersive\nsensing techniques.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}