{"id":"2408.09955","title":"MegaAgent: A Practical Framework for Autonomous Cooperation in\n  Large-Scale LLM Agent Systems","authors":"Qian Wang, Tianyu Wang, Qinbin Li, Jingsheng Liang, Bingsheng He","authorsParsed":[["Wang","Qian",""],["Wang","Tianyu",""],["Li","Qinbin",""],["Liang","Jingsheng",""],["He","Bingsheng",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 12:55:16 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 05:51:46 GMT"}],"updateDate":"2024-08-21","timestamp":1724072116000,"abstract":"  With the emergence of large language models (LLMs), LLM-powered multi-agent\nsystems (LLM-MA systems) have been proposed to tackle real-world tasks.\nHowever, their agents mostly follow predefined Standard Operating Procedures\n(SOPs) that remain unchanged across the whole interaction, lacking autonomy and\nscalability. Additionally, current solutions often overlook the necessity for\neffective agent cooperation. To address the above limitations, we propose\nMegaAgent, a practical framework designed for autonomous cooperation in\nlarge-scale LLM Agent systems. MegaAgent leverages the autonomy of agents to\ndynamically generate agents based on task requirements, incorporating features\nsuch as automatically dividing tasks, systematic planning and monitoring of\nagent activities, and managing concurrent operations. In addition, MegaAgent is\ndesigned with a hierarchical structure and employs system-level parallelism to\nenhance performance and boost communication. We demonstrate the effectiveness\nof MegaAgent through Gobang game development, showing that it outperforms\npopular LLM-MA systems; and national policy simulation, demonstrating its high\nautonomy and potential to rapidly scale up to 590 agents while ensuring\neffective cooperation among them. Our results indicate that MegaAgent is the\nfirst autonomous large-scale LLM-MA system with no pre-defined SOPs, high\neffectiveness and scalability, paving the way for further research in this\nfield. Our code is at https://anonymous.4open.science/r/MegaAgent-81F3.\n","subjects":["Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by/4.0/"}