{"id":"2408.08907","title":"What should I wear to a party in a Greek taverna? Evaluation for\n  Conversational Agents in the Fashion Domain","authors":"Antonis Maronikolakis, Ana Peleteiro Ramallo, Weiwei Cheng, Thomas\n  Kober","authorsParsed":[["Maronikolakis","Antonis",""],["Ramallo","Ana Peleteiro",""],["Cheng","Weiwei",""],["Kober","Thomas",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 11:11:27 GMT"}],"updateDate":"2024-08-20","timestamp":1723547487000,"abstract":"  Large language models (LLMs) are poised to revolutionize the domain of online\nfashion retail, enhancing customer experience and discovery of fashion online.\nLLM-powered conversational agents introduce a new way of discovery by directly\ninteracting with customers, enabling them to express in their own ways, refine\ntheir needs, obtain fashion and shopping advice that is relevant to their taste\nand intent. For many tasks in e-commerce, such as finding a specific product,\nconversational agents need to convert their interactions with a customer to a\nspecific call to different backend systems, e.g., a search system to showcase a\nrelevant set of products. Therefore, evaluating the capabilities of LLMs to\nperform those tasks related to calling other services is vital. However, those\nevaluations are generally complex, due to the lack of relevant and high quality\ndatasets, and do not align seamlessly with business needs, amongst others. To\nthis end, we created a multilingual evaluation dataset of 4k conversations\nbetween customers and a fashion assistant in a large e-commerce fashion\nplatform to measure the capabilities of LLMs to serve as an assistant between\ncustomers and a backend engine. We evaluate a range of models, showcasing how\nour dataset scales to business needs and facilitates iterative development of\ntools.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"anFng8AGlu_lPc-HmEUShzISGAlbxruLRdsPr8dskOI","pdfSize":"813858"}
