{"id":"2408.04947","title":"Revealing the Fate of Exoplanet Systems: Asteroseismic Identification of\n  Host Star in the Red Clump or Red Giant Branch","authors":"Wen-Xu Lin and Sheng-Bang Qian and Li-Ying Zhu","authorsParsed":[["Lin","Wen-Xu",""],["Qian","Sheng-Bang",""],["Zhu","Li-Ying",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 09:05:59 GMT"}],"updateDate":"2024-09-05","timestamp":1723194359000,"abstract":"  Determining the evolutionary stage of stars is crucial for understanding the\nevolution of exoplanetary systems. In this context, Red Giant Branch (RGB) and\nRed Clump (RC) stars, stages in the later evolution of stars situated before\nand after the helium flash, harbor critical clues to unveiling the evolution of\nplanets. The first step in revealing these clues is to confirm the evolutionary\nstage of the host stars through asteroseismology. However, up to now, host\nstars confirmed to be RGB or RC stars are extremely rare. In this\ninvestigation, we present a comprehensive asteroseismic analysis of two evolved\nstars, HD 120084 and HD 29399, known to harbor exoplanets, using data from the\nTransiting Exoplanet Survey Satellite (TESS). We have discovered for the first\ntime that HD 120084 is a Red Clump star in the helium-core burning phase, and\nconfirmed that HD 29399 is a Red Giant Branch star in the hydrogen-shell\nburning phase. Through the precise measurement of asteroseismic parameters such\nas $\\nu_{max}$, $\\Delta\\nu$ and $\\Delta\\Pi_{1}$ we have determined the\nevolutionary states of these stars and derived their fundamental stellar\nparameters.\n  The significance of this study lies in the application of automated\ntechniques to measure asymptotic period spacings in red giants, which provides\ncritical insights into the evolutionary outcomes of exoplanet systems. We\ndemonstrate that asteroseismology is a potent tool for probing the internal\nstructures of stars, thereby offering a window into the past and future\ndynamics of planetary orbits. The presence of a long-period giant planet\norbiting HD 120084, in particular, raises intriguing questions about the\npotential engulfment of inner planets during the host star's expansion, a\nhypothesis that warrants further investigation.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}