{"id":"2408.03105","title":"Revealing the Berry phase under the tunneling barrier","authors":"Lior Faeyrman, Eduardo B. Molinero, Roni Weiss, Vladimir Narovlansky,\n  Omer Kneller, Talya Arusi-Parpar, Barry D. Bruner, Binghai Yan, Misha Ivanov,\n  Olga Smirnova, Alvaro Jimenez-Galan, Riccardo Piccoli, Rui E.F. Silva, Nirit\n  Dudovich, and Ayelet J. Uzan-Narovlansky","authorsParsed":[["Faeyrman","Lior",""],["Molinero","Eduardo B.",""],["Weiss","Roni",""],["Narovlansky","Vladimir",""],["Kneller","Omer",""],["Arusi-Parpar","Talya",""],["Bruner","Barry D.",""],["Yan","Binghai",""],["Ivanov","Misha",""],["Smirnova","Olga",""],["Jimenez-Galan","Alvaro",""],["Piccoli","Riccardo",""],["Silva","Rui E. F.",""],["Dudovich","Nirit",""],["Uzan-Narovlansky","Ayelet J.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 11:18:04 GMT"}],"updateDate":"2024-08-07","timestamp":1722943084000,"abstract":"  In quantum mechanics, a quantum wavepacket may acquire a geometrical phase as\nit evolves along a cyclic trajectory in parameter space. In condensed matter\nsystems, the Berry phase plays a crucial role in fundamental phenomena such as\nthe Hall effect, orbital magnetism, and polarization. Resolving the quantum\nnature of these processes commonly requires sensitive quantum techniques, as\ntunneling, being the dominant mechanism in STM microscopy and tunneling\ntransport devices. In this study, we integrate these two phenomena -\ngeometrical phases and tunneling - and observe a complex-valued Berry phase via\nstrong field light matter interactions in condensed matter systems. By\nmanipulating the tunneling barrier, with attoseconds precision, we measure the\nimaginary Berry phase accumulated as the electron tunnels during a fraction of\nthe optical cycle. Our work opens new theoretical and experimental directions\nin geometrical phases physics and their realization in condensed matter\nsystems, expanding solid state strong field light metrology to study\ntopological quantum phenomena.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Physics/Optics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}