{"id":"2408.08573","title":"Meta-creatures: Developing an omnipotent hydrogel cell to construct\n  bio-inspired systems","authors":"Hanqing Dai, Wenqing Dai, Yuanyuan Chen, Wanlu Zhang, Yimeng Wang,\n  Ruiqian Guo, Guoqi Zhang","authorsParsed":[["Dai","Hanqing",""],["Dai","Wenqing",""],["Chen","Yuanyuan",""],["Zhang","Wanlu",""],["Wang","Yimeng",""],["Guo","Ruiqian",""],["Zhang","Guoqi",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 07:21:39 GMT"}],"updateDate":"2024-08-19","timestamp":1723792899000,"abstract":"  Due to current technological challenges, including the complexity of precise\ncontrol, low long-term survival and success rates, difficulty in maintaining\nfunction over extended periods, and high energy consumption, the construction\nof life-like creatures with multilevel structures and varied physiological\ncharacteristics is a goal that has yet to be achieved1-3. Here, to create a\nparallel entity termed a meta-creature with similar functions and\ncharacteristics to those of natural organisms, we introduce a process for the\ntransformation of an omnipotent hydrogel cell (OHC), which is inspired by\ntotipotent stem cells and carries bio-inspired bioelectricity, into a\nmeta-creature. We captured the electrical signals transmitted between the\nmeta-nerve fibres and rat sciatic nerves, the physicochemical signals perceived\nby the meta-mouth, and the information exchanged between the meta-skin and the\nexternal environment. Notably, the meta-cardiovascular system, which is capable\nof exchanging matter and energy with external environments, exhibited similar\nelectrocardiogram signals during testing in rabbits; these results indicated\nfeedback with a biological system and the potential for ex vivo bioelectric\nremodelling. Finally, a meta-creature was designed and exhibited bio-inspired\nbioelectricity signals during the simulated outdoor flight. This work reveals\nnew possibilities for constructing bio-inspired systems, thereby improving our\nunderstanding of bioelectricity and biomimicry.\n","subjects":["Physics/Chemical Physics","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}