{"id":"2408.05470","title":"Fourth-Order Paired-Explicit Runge-Kutta Methods","authors":"Daniel Doehring, Lars Christmann, Michael Schlottke-Lakemper, Gregor\n  J. Gassner and Manuel Torrilhon","authorsParsed":[["Doehring","Daniel",""],["Christmann","Lars",""],["Schlottke-Lakemper","Michael",""],["Gassner","Gregor J.",""],["Torrilhon","Manuel",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 07:34:49 GMT"}],"updateDate":"2024-08-13","timestamp":1723275289000,"abstract":"  In this paper, we extend the Paired-Explicit Runge-Kutta schemes by Vermeire\net. al. to fourth-order of consistency. Based on the order conditions for\npartitioned Runge-Kutta methods we motivate a specific form of the Butcher\narrays which leads to a family of fourth-order accurate methods. The employed\nform of the Butcher arrays results in a special structure of the stability\npolynomials, which needs to be adhered to for an efficient optimization of the\ndomain of absolute stability. We demonstrate that the constructed fourth-order\nPaired-Explicit Runge-Kutta methods satisfy linear stability, internal\nconsistency, designed order of convergence, and conservation of linear\ninvariants. At the same time, these schemes are seamlessly coupled for codes\nemploying a method-of-lines approach, in particular without any modifications\nof the spatial discretization. We apply the multirate Paired-Explicit\nRunge-Kutta (P-ERK) schemes to inviscid and viscous problems with locally\nvarying wave speeds, which may be induced by non-uniform grids or multiscale\nproperties of the governing partial differential equation. Compared to\nstate-of-the-art optimized standalone methods, the multirate P-ERK schemes\nallow significant reductions in right-hand-side evaluations and wall-clock\ntime, ranging from 40% up to factors greater than three.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8Xn6DIrndOXTeulYsyABpznZp1qwEMOyIvdRsLk9gkA","pdfSize":"2341012"}
