{"id":"2408.04345","title":"Beyond Nearest-neighbour Universality of Spectral Fluctuations in\n  Quantum Chaotic and Complex Many-body Systems","authors":"Debojyoti Kundu, Santosh Kumar, and Subhra Sen Gupta","authorsParsed":[["Kundu","Debojyoti",""],["Kumar","Santosh",""],["Gupta","Subhra Sen",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 10:05:00 GMT"}],"updateDate":"2024-08-09","timestamp":1723111500000,"abstract":"  Discerning chaos in quantum systems is an important problem as the usual\nroute of Lyapunov exponents in classical systems is not straightforward in\nquantum systems. A standard route is the comparison of statistics derived from\nmodel physical systems to those from random matrix theory (RMT) ensembles, of\nwhich the most popular is the nearest-neighbour-spacings distribution (NNSD),\nwhich almost always shows good agreement with chaotic quantum systems. However,\neven in these cases, the long-range statistics (like number variance, spectral\nrigidity etc.), which are also more difficult to calculate, often show\ndisagreements with RMT. As such, a more stringent test for chaos in quantum\nsystems, via an analysis of intermediate-range statistics is needed, which will\nadditionally assess the extent of agreement with RMT universality. In this\npaper, we deduce the effective level-repulsion parameters and the corresponding\nWigner-surmise-like results of the next-nearest-neighbor spacing distribution\n(nNNSD) for integrable systems (semi-Poissonian statistics) as well as the\nthree classical quantum-chaotic Wigner-Dyson regimes, by stringent comparisons\nto numerical RMT models and benchmarking against our exact analytical results\nfor $3\\times 3$ Gaussian matrix models, along with a semi-analytical form for\nthe nNNSD in the Orthogonal-to-Unitary symmetry crossover. To illustrate the\nrobustness of these RMT based results, we test these predictions against the\nnNNSD obtained from quantum chaotic models as well as disordered lattice spin\nmodels. This reinforces the Bohigas-Giannoni-Schmit and the Berry-Tabor\nconjectures, extending the associated universality to longer range statistics.\nIn passing, we also highlight the equivalence of nNNSD in the apparently\ndistinct Orthogonal-to-Unitary and diluted-Symplectic-to-Unitary crossovers.\n","subjects":["Condensed Matter/Statistical Mechanics","Condensed Matter/Disordered Systems and Neural Networks","Nonlinear Sciences/Chaotic Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}