{"id":"2408.00502","title":"Hacked in Translation -- from Subtitles to Complete Takeover","authors":"Omri Herscovici, Omer Gull","authorsParsed":[["Herscovici","Omri",""],["Gull","Omer",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 12:12:25 GMT"}],"updateDate":"2024-08-02","timestamp":1722514345000,"abstract":"  Check Point researchers revealed a new attack vector which threatens millions\nof users worldwide - attack by subtitles. By crafting malicious subtitle files,\nwhich are then downloaded by a victim's media player, attackers can take\ncomplete control over any type of device via vulnerabilities found in many\npopular streaming platforms, including VLC, Kodi (XBMC), Popcorn-Time and\nstrem.io. We estimate there are approximately 200 million video players and\nstreamers that currently run the vulnerable software, making this one of the\nmost widespread, easily accessed and zero-resistance vulnerability reported in\nrecent years.\n  Our research reveals a new possible attack vector, using a completely\noverlooked technique in which the cyberattack is delivered when movie subtitles\nare automatically loaded from online repositories by the user's media player.\nThese subtitles repositories are, in practice, treated as a trusted source by\nthe user or media player; our research also reveals that those repositories can\nbe manipulated and be made to award the attacker's malicious subtitles a high\nscore, which results in those specific subtitles being served to the user. This\nmethod requires little or no deliberate action on the part of the user, making\nit all the more dangerous.\n  Unlike traditional attack vectors, which security firms and users are widely\naware of, movie subtitles are perceived as nothing more than benign text files.\nThis means users, Anti-Virus software, and other security solutions vet them\nwithout trying to assess their real nature, leaving millions of users exposed\nto this risk.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"J683lXh6pqvbZkR5YpXgcxhrl4JJBHA5dpgWrCcfI_8","pdfSize":"670815"}
