{"id":"2408.09113","title":"Planning of Off-Grid Renewable Power to Ammonia Systems with\n  Heterogeneous Flexibility: A Multistakeholder Equilibrium Perspective","authors":"Yangjun Zeng (1), Yiwei Qiu (1), Jie Zhu (1), Shi Chen (1), Tianlei\n  Zang (1), Buxiang Zhou (1), Ge He (2), Xu Ji (2) ((1) College of Electrical\n  Engineering, Sichuan University, (2) School of Chemical Engineering, Sichuan\n  University)","authorsParsed":[["Zeng","Yangjun",""],["Qiu","Yiwei",""],["Zhu","Jie",""],["Chen","Shi",""],["Zang","Tianlei",""],["Zhou","Buxiang",""],["He","Ge",""],["Ji","Xu",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 06:31:19 GMT"}],"updateDate":"2024-08-20","timestamp":1723876279000,"abstract":"  Off-grid renewable power to ammonia (ReP2A) systems present a promising\npathway toward carbon neutrality in both the energy and chemical industries.\nHowever, due to chemical safety requirements, the limited flexibility of\nammonia synthesis poses a challenge when attempting to align with the variable\nhydrogen flow produced from renewable power. This necessitates the optimal\nsizing of equipment capacity for effective and coordinated production across\nthe system. Additionally, an ReP2A system may involve multiple stakeholders\nwith varying degrees of operational flexibility, complicating the planning\nproblem. This paper first examines the multistakeholder sizing equilibrium\n(MSSE) of the ReP2A system. First, we propose an MSSE model that accounts for\nindividual planning decisions and the competing economic interests of the\nstakeholders of power generation, hydrogen production, and ammonia synthesis.\nWe then construct an equivalent optimization problem based on\nKarush--Kuhn--Tucker (KKT) conditions to determine the equilibrium. Following\nthis, we decompose the problem in the temporal dimension and solve it via\nmulticut generalized Benders decomposition (GBD) to address long-term balancing\nissues. Case studies based on a realistic project reveal that the equilibrium\ndoes not naturally balance the interests of all stakeholders due to their\nheterogeneous characteristics. Our findings suggest that benefit transfer\nagreements ensure mutual benefits and the successful implementation of ReP2A\nprojects.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}