{"id":"2408.07865","title":"Capturing the Complexity of Human Strategic Decision-Making with Machine\n  Learning","authors":"Jian-Qiao Zhu, Joshua C. Peterson, Benjamin Enke, Thomas L. Griffiths","authorsParsed":[["Zhu","Jian-Qiao",""],["Peterson","Joshua C.",""],["Enke","Benjamin",""],["Griffiths","Thomas L.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 00:39:42 GMT"}],"updateDate":"2024-08-16","timestamp":1723682382000,"abstract":"  Understanding how people behave in strategic settings--where they make\ndecisions based on their expectations about the behavior of others--is a\nlong-standing problem in the behavioral sciences. We conduct the largest study\nto date of strategic decision-making in the context of initial play in\ntwo-player matrix games, analyzing over 90,000 human decisions across more than\n2,400 procedurally generated games that span a much wider space than previous\ndatasets. We show that a deep neural network trained on these data predicts\npeople's choices better than leading theories of strategic behavior, indicating\nthat there is systematic variation that is not explained by those theories. We\nthen modify the network to produce a new, interpretable behavioral model,\nrevealing what the original network learned about people: their ability to\noptimally respond and their capacity to reason about others are dependent on\nthe complexity of individual games. This context-dependence is critical in\nexplaining deviations from the rational Nash equilibrium, response times, and\nuncertainty in strategic decisions. More broadly, our results demonstrate how\nmachine learning can be applied beyond prediction to further help generate\nnovel explanations of complex human behavior.\n","subjects":["Economics/General Economics","Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Machine Learning","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vV9cbLSNr3LKmbW8fehcK6cuwFTADFF8zWOVr0Mcogs","pdfSize":"1578209"}
