{"id":"2408.10228","title":"ECG Unveiled: Analysis of Client Re-identification Risks in Real-World\n  ECG Datasets","authors":"Ziyu Wang, Anil Kanduri, Seyed Amir Hossein Aqajari, Salar Jafarlou,\n  Sanaz R. Mousavi, Pasi Liljeberg, Shaista Malik, Amir M. Rahmani","authorsParsed":[["Wang","Ziyu",""],["Kanduri","Anil",""],["Aqajari","Seyed Amir Hossein",""],["Jafarlou","Salar",""],["Mousavi","Sanaz R.",""],["Liljeberg","Pasi",""],["Malik","Shaista",""],["Rahmani","Amir M.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 19:24:55 GMT"}],"updateDate":"2024-08-21","timestamp":1722626695000,"abstract":"  While ECG data is crucial for diagnosing and monitoring heart conditions, it\nalso contains unique biometric information that poses significant privacy\nrisks. Existing ECG re-identification studies rely on exhaustive analysis of\nnumerous deep learning features, confining to ad-hoc explainability towards\nclinicians decision making. In this work, we delve into explainability of ECG\nre-identification risks using transparent machine learning models. We use\nSHapley Additive exPlanations (SHAP) analysis to identify and explain the key\nfeatures contributing to re-identification risks. We conduct an empirical\nanalysis of identity re-identification risks using ECG data from five diverse\nreal-world datasets, encompassing 223 participants. By employing transparent\nmachine learning models, we reveal the diversity among different ECG features\nin contributing towards re-identification of individuals with an accuracy of\n0.76 for gender, 0.67 for age group, and 0.82 for participant ID\nre-identification. Our approach provides valuable insights for clinical experts\nand guides the development of effective privacy-preserving mechanisms. Further,\nour findings emphasize the necessity for robust privacy measures in real-world\nhealth applications and offer detailed, actionable insights for enhancing data\nanonymization techniques.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}