{"id":"2408.01737","title":"Real-time Localization and Mapping in Architectural Plans with\n  Deviations","authors":"Muhammad Shaheer, Jose Andres Millan-Romera, Hriday Bavle, Marco\n  Giberna, Jose Luis Sanchez-Lopez, Javier Civera and Holger Voos","authorsParsed":[["Shaheer","Muhammad",""],["Millan-Romera","Jose Andres",""],["Bavle","Hriday",""],["Giberna","Marco",""],["Sanchez-Lopez","Jose Luis",""],["Civera","Javier",""],["Voos","Holger",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 10:39:42 GMT"}],"updateDate":"2024-08-06","timestamp":1722681582000,"abstract":"  Having prior knowledge of an environment boosts the localization and mapping\naccuracy of robots. Several approaches in the literature have utilized\narchitectural plans in this regard. However, almost all of them overlook the\ndeviations between actual as-built environments and as-planned architectural\ndesigns, introducing bias in the estimations. To address this issue, we present\na novel localization and mapping method denoted as deviations-informed\nSituational Graphs or diS-Graphs that integrates prior knowledge from\narchitectural plans even in the presence of deviations. It is based on\nSituational Graphs (S-Graphs) that merge geometric models of the environment\nwith 3D scene graphs into a multi-layered jointly optimizable factor graph. Our\ndiS-Graph extracts information from architectural plans by first modeling them\nas a hierarchical factor graph, which we will call an Architectural Graph\n(A-Graph). While the robot explores the real environment, it estimates an\nS-Graph from its onboard sensors. We then use a novel matching algorithm to\nregister the A-Graph and S-Graph in the same reference, and merge both of them\nwith an explicit model of deviations. Finally, an alternating graph\noptimization strategy allows simultaneous global localization and mapping, as\nwell as deviation estimation between both the A-Graph and the S-Graph. We\nperform several experiments in simulated and real datasets in the presence of\ndeviations. On average, our diS-Graphs outperforms the baselines by a margin of\napproximately 43% in simulated environments and by 7% in real environments,\nwhile being able to estimate deviations up to 35 cm and 15 degrees.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/"}