{"id":"2408.12463","title":"Smartphone-based Eye Tracking System using Edge Intelligence and Model\n  Optimisation","authors":"Nishan Gunawardena, Gough Yumu Lui, Jeewani Anupama Ginige, Bahman\n  Javadi","authorsParsed":[["Gunawardena","Nishan",""],["Lui","Gough Yumu",""],["Ginige","Jeewani Anupama",""],["Javadi","Bahman",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 15:04:59 GMT"}],"updateDate":"2024-08-23","timestamp":1724339099000,"abstract":"  A significant limitation of current smartphone-based eye-tracking algorithms\nis their low accuracy when applied to video-type visual stimuli, as they are\ntypically trained on static images. Also, the increasing demand for real-time\ninteractive applications like games, VR, and AR on smartphones requires\novercoming the limitations posed by resource constraints such as limited\ncomputational power, battery life, and network bandwidth. Therefore, we\ndeveloped two new smartphone eye-tracking techniques for video-type visuals by\ncombining Convolutional Neural Networks (CNN) with two different Recurrent\nNeural Networks (RNN), namely Long Short Term Memory (LSTM) and Gated Recurrent\nUnit (GRU). Our CNN+LSTM and CNN+GRU models achieved an average Root Mean\nSquare Error of 0.955cm and 1.091cm, respectively. To address the computational\nconstraints of smartphones, we developed an edge intelligence architecture to\nenhance the performance of smartphone-based eye tracking. We applied various\noptimisation methods like quantisation and pruning to deep learning models for\nbetter energy, CPU, and memory usage on edge devices, focusing on real-time\nprocessing. Using model quantisation, the model inference time in the CNN+LSTM\nand CNN+GRU models was reduced by 21.72% and 19.50%, respectively, on edge\ndevices.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning","Computing Research Repository/Performance"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}