{"id":"2408.05671","title":"Research on Heterogeneous Computation Resource Allocation based on\n  Data-driven Method","authors":"Xirui Tang, Zeyu Wang, Xiaowei Cai, Honghua Su, Changsong Wei","authorsParsed":[["Tang","Xirui",""],["Wang","Zeyu",""],["Cai","Xiaowei",""],["Su","Honghua",""],["Wei","Changsong",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 01:32:47 GMT"}],"updateDate":"2024-08-13","timestamp":1723339967000,"abstract":"  The rapid development of the mobile Internet and the Internet of Things is\nleading to a diversification of user devices and the emergence of new mobile\napplications on a regular basis. Such applications include those that are\ncomputationally intensive, such as pattern recognition, interactive gaming,\nvirtual reality, and augmented reality. However, the computing and energy\nresources available on the user's equipment are limited, which presents a\nchallenge in effectively supporting such demanding applications. In this work,\nwe propose a heterogeneous computing resource allocation model based on a\ndata-driven approach. The model first collects and analyzes historical workload\ndata at scale, extracts key features, and builds a detailed data set. Then, a\ndata-driven deep neural network is used to predict future resource\nrequirements. Based on the prediction results, the model adopts a dynamic\nadjustment and optimization resource allocation strategy. This strategy not\nonly fully considers the characteristics of different computing resources, but\nalso accurately matches the requirements of various tasks, and realizes dynamic\nand flexible resource allocation, thereby greatly improving the overall\nperformance and resource utilization of the system. Experimental results show\nthat the proposed method is significantly better than the traditional resource\nallocation method in a variety of scenarios, demonstrating its excellent\naccuracy and adaptability.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}