{"id":"2408.00886","title":"Two young eclipsing binaries in Orion with temperatures and radii\n  affected by spots and third bodies","authors":"Marina Kounkel, Keivan G. Stassun","authorsParsed":[["Kounkel","Marina",""],["Stassun","Keivan G.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 19:32:03 GMT"}],"updateDate":"2024-08-05","timestamp":1722540723000,"abstract":"  In this work we present a model of two young eclipsing binaries in the Orion\nComplex. Both heavily spotted, they present radii and temperatures that are in\ndisagreement with the predictions of standard stellar models. 2M05-06 consists\nof two stars with different masses (~0.52 and ~0.42 Msun) but with very similar\nradii (~0.9 Rsun), and with the less massive star having a highly spotted\nsurface that causes it to have a hotter (unspotted) photosphere than the\nhigher-mass star. The other system, 2M05-00, consists of two stars of very\nsimilar masses (~0.34 Msun), but very different radii (~0.7 and ~1.0 Rsun),\nwhich creates an appearance of the two eclipsing stars being non-coeval.\n2M05-00 appears to have a tertiary companion that could offer an explanation\nfor the unusual properties of the eclipsing stars, as has been seen in some\nother young triple systems. Comparing the empirically measured properties of\nthese eclipsing binaries to the predictions of stellar models, both standard\nand magnetic, we find that only the magnetic models correctly predict the\nobserved relationship between mass and effective temperature. However, standard\n(non-magnetic) models better predict the temperatures of the unspotted\nphotospheres. These observations represent an important step in improving our\nunderstanding of pre-main-sequence stellar evolution and the roles of spots and\ntertiaries on fundamental stellar properties.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uP_w5hLTVLCnEOru65vWWxKjgUc9p9tIrmri6CTMniM","pdfSize":"1138857","txDigest":"BGjpeDrVWfHU6Uq4wcCu4Kdq1c57BxCz3qwsx84ZuNVP","endEpoch":"1","status":"CERTIFIED"}
