{"id":"2408.01133","title":"Interpretation of the Boundary Current Synchronization as a Maxwell's\n  Demon","authors":"Yuki Yasuda and Tsubasa Kohyama","authorsParsed":[["Yasuda","Yuki",""],["Kohyama","Tsubasa",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 09:21:35 GMT"}],"updateDate":"2024-08-05","timestamp":1722590495000,"abstract":"  This study has applied information thermodynamics to a bivariate linear\nstochastic differential equation (SDE) that describes a synchronization\nphenomenon of sea surface temperatures (SSTs) between the Gulf Stream and the\nKuroshio Current, which is referred to as the boundary current synchronization\n(BCS). Information thermodynamics divides the entire system fluctuating with\nstochastic noise into subsystems and describes the interactions between these\nsubsystems from the perspective of information transfer. The SDE coefficients\nhave been estimated through regression analysis using observational and\nnumerical simulation data. In the absence of stochastic noise, the solution of\nthe estimated SDE shows that the SSTs relax toward zero without oscillating.\nThe estimated SDE can be interpreted as a Maxwell's demon system, with the Gulf\nStream playing the role of the \"Particle\" and the Kuroshio Current playing the\nrole of the \"Demon.\" This interpretation gives the asymmetric roles of both\nocean currents. The Gulf Stream forces the SST of the Kuroshio Current to be in\nphase. By contrast, the Kuroshio Current maintains the phase by interfering\nwith the relaxation of the Gulf Stream SST. In the framework of Maxwell's\ndemon, the Gulf Stream is interpreted as being measured by the Kuroshio\nCurrent, whereas the Kuroshio Current is interpreted as performing feedback\ncontrol on the Gulf Stream. When the Gulf Stream and the Kuroshio Current are\ncoupled in an appropriate parameter regime, synchronization is realized with\natmospheric and oceanic noise as the driving source.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}