{"id":"2408.12069","title":"Rotatable Block-Controlled RIS: Bridging the Performance Gap to\n  Element-Controlled Systems","authors":"Weicong Chen, Xinyi Yang, Chao-Kai Wen, Wankai Tang, Jinghe Wang,\n  Yifei Yuan, Xiao Li, and Shi Jin","authorsParsed":[["Chen","Weicong",""],["Yang","Xinyi",""],["Wen","Chao-Kai",""],["Tang","Wankai",""],["Wang","Jinghe",""],["Yuan","Yifei",""],["Li","Xiao",""],["Jin","Shi",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 02:18:29 GMT"}],"updateDate":"2024-08-23","timestamp":1724293109000,"abstract":"  The passive reconfigurable intelligent surface (RIS) requires numerous\nelements to achieve adequate array gain, which linearly increases power\nconsumption (PC) with the number of reflection phases. To address this, this\nletter introduces a rotatable block-controlled RIS (BC-RIS) that preserves\nspectral efficiency (SE) while reducing power costs. Unlike the\nelement-controlled RIS (EC-RIS), which necessitates independent phase control\nfor each element, the BC-RIS uses a single phase control circuit for each\nblock, substantially lowering power requirements. In the maximum ratio\ntransmission, by customizing specular reflection channels through the rotation\nof blocks and coherently superimposing signals with optimized reflection phase\nof blocks, the BC-RIS achieves the same averaged SE as the EC-RIS. To\ncounteract the added power demands from rotation, influenced by block size, we\nhave developed a segmentation scheme to minimize overall PC. Furthermore,\nconstraints for rotation power-related parameters have been established to\nenhance the energy efficiency of the BC-RIS compared to the EC-RIS. Numerical\nresults confirm that this approach significantly improves energy efficiency\nwhile maintaining performance.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}