{"id":"2408.17056","title":"Role of magma oceans in controlling carbon and oxygen of sub-Neptune\n  atmospheres","authors":"Chanoul Seo, Yuichi Ito, Yuka Fujii","authorsParsed":[["Seo","Chanoul",""],["Ito","Yuichi",""],["Fujii","Yuka",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 07:31:28 GMT"}],"updateDate":"2024-09-02","timestamp":1725003088000,"abstract":"  Most exoplanets with a few Earth radii are more inflated than bare-rock\nplanets with the same mass, indicating a substantial volatile amount. Neither\nthe origin of the volatiles nor the planet's bulk composition can be\nconstrained from the mass-radius relation alone, and the spectral\ncharacterization of their atmospheres is needed to solve this degeneracy.\nPrevious studies showed that chemical interaction between accreted volatile and\npossible molten rocky surface (i.e., magma ocean) can greatly affects the\natmospheric composition. However, a variety in the atmospheric compositions of\nsuch planets with different properties remains elusive. In this work, we\nexamine the dependence of atmospheric H, O, and C on planetary parameters\n(atmospheric thickness, planetary mass, equilibrium temperature, and magma\nproperties such as redox state) assuming nebula gas accretion on an Earth-like\ncore, using an atmosphere-magma chemical equilibrium model. Consistent with\nprevious work, we show that atmospheric $\\rm H_{2}O$ fraction on a fully molten\nrocky interior with an Earth-like redox state is on the order of\n$10^{-2}$-$10^{-1}$ regardless of other planetary parameters. Despite the\nsolubility difference between H- and C-bearing species, C/H increases only a\nfew times above the nebula value except for atmospheric pressure $\\lesssim$1000\nbar and $\\rm H_{2}O$ fraction $\\gtrsim$10\\%. This results in a negative O/H-C/O\ntrend and depleted C/O below one-tenth of the nebula gas value under an\noxidized atmosphere, which could provide a piece of evidence of rocky interior\nand endogenic water. We also highlight the importance of constraints on the\nhigh-pressure material properties for interpreting the magma-atmospheric\ninteraction of inflated planets.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}