{"id":"2408.01830","title":"Ferroelectricity in Hafnia: The Origin of Nanoscale Stabilization","authors":"Xin Li, Guodong Ren, Haidong Lu, Kartik Samanta, Amit Kumar Shah,\n  Pravan Omprakash, Yu Yun, Pratyush Buragohain, Huibo Cao, Jordan A. Hachtel,\n  Andrew R. Lupini, Miaofang Chi, Evgeny Y. Tsymbal, Alexei Gruverman, Rohan\n  Mishra, Xiaoshan Xu","authorsParsed":[["Li","Xin",""],["Ren","Guodong",""],["Lu","Haidong",""],["Samanta","Kartik",""],["Shah","Amit Kumar",""],["Omprakash","Pravan",""],["Yun","Yu",""],["Buragohain","Pratyush",""],["Cao","Huibo",""],["Hachtel","Jordan A.",""],["Lupini","Andrew R.",""],["Chi","Miaofang",""],["Tsymbal","Evgeny Y.",""],["Gruverman","Alexei",""],["Mishra","Rohan",""],["Xu","Xiaoshan",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 17:45:14 GMT"}],"updateDate":"2024-08-06","timestamp":1722707114000,"abstract":"  The discovery of ferroelectricity in hafnia-based materials have boosted the\npotential of incorporating ferroelectrics in advanced electronics, thanks to\ntheir compatibility with silicon technology. However, comprehending why these\nmaterials defy the common trend of reduced ferroelectric ordering at the\nnanoscale, and the mechanism that stabilizes the ferroelectric phase (absent in\nhafnia phase diagram) presents significant challenges to traditional knowledge\nof ferroelectricity. In this work, we show that the formation of the\northorhombic ferroelectric phase (o-FE, space group Pca21) of the\nsingle-crystalline epitaxial films of 10% La-doped HfO2 (LHO) on (111)-oriented\nyttria stabilized zirconia (YSZ) relies on the stability of the high-pressure\northorhombic antiferroelectric phase (o-AFE, space group Pbca). Our detailed\nstructural characterizations demonstrate that as-grown LHO films represent\nlargely the o-AFE phase being thermodynamically stabilized by the compressive\nstrain. Our Kelvin probe force microscopy studies show, under mechanical\npoling, the o-AFE phase is converted to the o-FE phase which remains stable\nunder ambient conditions. We find that the orthorhombic phase stability is\nenhanced in thinner films down to one-unit-cell thickness, a trend that is\nunknown in any other ferroelectric films. This is due to the vanishing\ndepolarization field of the o-AFE phase and the isomorphic LHO/YSZ interface,\nsupporting strain-enhanced ferroelectricity in the ultrathin films. This\nresults in an unprecedented increase of the Curie temperature up to 850\n{\\deg}C, the highest reported for sub-nanometer-thick ferroelectrics. Overall,\nour findings opens the way for advanced engineering of hafnia-based materials\nfor ferroelectric applications and heralding a new frontier of high-temperature\nferroelectrics at the two-dimensional limit.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}