{"id":"2408.05710","title":"Efficient Diffusion Transformer with Step-wise Dynamic Attention\n  Mediators","authors":"Yifan Pu, Zhuofan Xia, Jiayi Guo, Dongchen Han, Qixiu Li, Duo Li,\n  Yuhui Yuan, Ji Li, Yizeng Han, Shiji Song, Gao Huang, Xiu Li","authorsParsed":[["Pu","Yifan",""],["Xia","Zhuofan",""],["Guo","Jiayi",""],["Han","Dongchen",""],["Li","Qixiu",""],["Li","Duo",""],["Yuan","Yuhui",""],["Li","Ji",""],["Han","Yizeng",""],["Song","Shiji",""],["Huang","Gao",""],["Li","Xiu",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 07:01:39 GMT"}],"updateDate":"2024-08-13","timestamp":1723359699000,"abstract":"  This paper identifies significant redundancy in the query-key interactions\nwithin self-attention mechanisms of diffusion transformer models, particularly\nduring the early stages of denoising diffusion steps. In response to this\nobservation, we present a novel diffusion transformer framework incorporating\nan additional set of mediator tokens to engage with queries and keys\nseparately. By modulating the number of mediator tokens during the denoising\ngeneration phases, our model initiates the denoising process with a precise,\nnon-ambiguous stage and gradually transitions to a phase enriched with detail.\nConcurrently, integrating mediator tokens simplifies the attention module's\ncomplexity to a linear scale, enhancing the efficiency of global attention\nprocesses. Additionally, we propose a time-step dynamic mediator token\nadjustment mechanism that further decreases the required computational FLOPs\nfor generation, simultaneously facilitating the generation of high-quality\nimages within the constraints of varied inference budgets. Extensive\nexperiments demonstrate that the proposed method can improve the generated\nimage quality while also reducing the inference cost of diffusion transformers.\nWhen integrated with the recent work SiT, our method achieves a\nstate-of-the-art FID score of 2.01. The source code is available at\nhttps://github.com/LeapLabTHU/Attention-Mediators.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"7SPiWlhiTq6Shtj7HPKnXpyWhkXw8ZyYK1finp2NS_w","pdfSize":"2752465"}
