{"id":"2408.00054","title":"Post-Quantum Cryptography (PQC) Network Instrument: Measuring PQC\n  Adoption Rates and Identifying Migration Pathways","authors":"Jakub Sowa, Bach Hoang, Advaith Yeluru, Steven Qie, Anita Nikolich,\n  Ravishankar Iyer, Phuong Cao","authorsParsed":[["Sowa","Jakub",""],["Hoang","Bach",""],["Yeluru","Advaith",""],["Qie","Steven",""],["Nikolich","Anita",""],["Iyer","Ravishankar",""],["Cao","Phuong",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 16:48:40 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 19:33:38 GMT"},{"version":"v3","created":"Wed, 7 Aug 2024 22:45:09 GMT"}],"updateDate":"2024-08-09","timestamp":1722444520000,"abstract":"  The problem of adopting quantum-resistant cryptographic network protocols or\npost-quantum cryptography (PQC) is critically important to democratizing\nquantum computing. The problem is urgent because practical quantum computers\nwill break classical encryption in the next few decades. Past encrypted data\nhas already been collected and can be decrypted in the near future. The main\nchallenges of adopting post-quantum cryptography lie in algorithmic complexity\nand hardware/software/network implementation. The grand question of how\nexisting cyberinfrastructure will support post-quantum cryptography remains\nunanswered.\n  This paper describes: i) the design of a novel Post-Quantum Cryptography\n(PQC) network instrument placed at the National Center for Supercomputing\nApplications (NCSA) at the University of Illinois at Urbana-Champaign and a\npart of the FABRIC testbed; ii) the latest results on PQC adoption rate across\na wide spectrum of network protocols (Secure Shell -- SSH, Transport Layer\nSecurity -- TLS, etc.); iii) the current state of PQC implementation in key\nscientific applications (e.g., OpenSSH or SciTokens); iv) the challenges of\nbeing quantum-resistant; and v) discussion of potential novel attacks.\n  This is the first large-scale measurement of PQC adoption at national-scale\nsupercomputing centers and FABRIC testbeds. Our results show that only OpenSSH\nand Google Chrome have successfully implemented PQC and achieved an initial\nadoption rate of 0.029% (6,044 out of 20,556,816) for OpenSSH connections at\nNCSA coming from major Internet Service Providers or Autonomous Systems (ASes)\nsuch as OARNET, GTT, Google Fiber Webpass (U.S.) and Uppsala Lans Landsting\n(Sweden), with an overall increasing adoption rate year-over-year for\n2023-2024. Our analyses identify pathways to migrate current applications to be\nquantum-resistant.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Cryptography and Security","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"pFyTcSceiDi8_7x9qLb6vUARTpC_sLK9D_GpkLmPsXk","pdfSize":"1052965"}
