{"id":"2408.08629","title":"Navigating Uncertainties in Machine Learning for Structural Dynamics: A\n  Comprehensive Review of Probabilistic and Non-Probabilistic Approaches in\n  Forward and Inverse Problems","authors":"Wang-Ji Yan (1 and 2), Lin-Feng Mei (1), Jiang Mo (1), Costas\n  Papadimitriou (3), Ka-Veng Yuen (1 and 2), and Michael Beer (4,5, and 6) ((1)\n  State Key Laboratory of Internet of Things for Smart City and Department of\n  Civil and Environmental Engineering, University of Macau, (2) Guangdong-Hong\n  Kong-Macau Joint Laboratory for Smart Cities, China, (3) Department of\n  Mechanical Engineering, University of Thessaly, (4) Leibniz University\n  Hannover, Institute for Risk and Reliability, (5) Department of Civil and\n  Environmental Engineering, University of Liverpool, (6) International Joint\n  Research Center for Resilient Infrastructure & International Joint Research\n  Center for Engineering Reliability and Stochastic Mechanics, Tongji\n  University)","authorsParsed":[["Yan","Wang-Ji","","1 and 2"],["Mei","Lin-Feng","","1 and 2"],["Mo","Jiang","","1 and 2"],["Papadimitriou","Costas","","1 and 2"],["Yuen","Ka-Veng","","1 and 2"],["Beer","Michael","","4,5, and 6"]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 09:43:01 GMT"}],"updateDate":"2024-08-19","timestamp":1723801381000,"abstract":"  In the era of big data, machine learning (ML) has become a powerful tool in\nvarious fields, notably impacting structural dynamics. ML algorithms offer\nadvantages by modeling physical phenomena based on data, even in the absence of\nunderlying mechanisms. However, uncertainties such as measurement noise and\nmodeling errors can compromise the reliability of ML predictions, highlighting\nthe need for effective uncertainty awareness to enhance prediction robustness.\nThis paper presents a comprehensive review on navigating uncertainties in ML,\ncategorizing uncertainty-aware approaches into probabilistic methods (including\nBayesian and frequentist perspectives) and non-probabilistic methods (such as\ninterval learning and fuzzy learning). Bayesian neural networks, known for\ntheir uncertainty quantification and nonlinear mapping capabilities, are\nemphasized for their superior performance and potential. The review covers\nvarious techniques and methodologies for addressing uncertainties in ML,\ndiscussing fundamentals and implementation procedures of each method. While\nproviding a concise overview of fundamental concepts, the paper refrains from\nin-depth critical explanations. Strengths and limitations of each approach are\nexamined, along with their applications in structural dynamic forward problems\nlike response prediction, sensitivity assessment, and reliability analysis, and\ninverse problems like system identification, model updating, and damage\nidentification. Additionally, the review identifies research gaps and suggests\nfuture directions for investigations, aiming to provide comprehensive insights\nto the research community. By offering an extensive overview of both\nprobabilistic and non-probabilistic approaches, this review aims to assist\nresearchers and practitioners in making informed decisions when utilizing ML\ntechniques to address uncertainties in structural dynamic problems.\n","subjects":["Computing Research Repository/Machine Learning","Mathematics/Dynamical Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}