{"id":"2408.06487","title":"Implementation and Characterization of the Vector Vortex Coronagraph on\n  the SEAL Testbed","authors":"Ashai Moreno, Vincent Chambouleyron, Rebecca M. Jensen-Clem, Daren\n  Dillon, Philip M. Hinz, and Bruce Macintosh","authorsParsed":[["Moreno","Ashai",""],["Chambouleyron","Vincent",""],["Jensen-Clem","Rebecca M.",""],["Dillon","Daren",""],["Hinz","Philip M.",""],["Macintosh","Bruce",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 20:47:10 GMT"}],"updateDate":"2024-08-14","timestamp":1723495630000,"abstract":"  The Santa Cruz Extreme AO Lab (SEAL) testbed is an optical bench meant to\ndesign and develop new wavefront control techniques for high-contrast imaging\nfor segmented telescopes. These techniques allow for astronomical efficiency in\nexoplanet imaging and characterization. SEAL consists of several wavefront\nsensors (WFS) and deformable mirrors (DM) that are currently performing\ntechniques like predictive control or non-linear reconstruction. In this paper,\nwe present the implementation and characterization of a new coronagraphic\nbranch on SEAL and assess the contrast limitations in the testbed. For our\ncoronagraphic branch, we used a vector vortex coronagraph which has high\ncontrast performance. The W. M. Keck Observatory also uses a vortex\ncoronagraph, allowing us to compare the limitations with our own coronagraph.\nWe relied on the testbed and simulations of the vortex coronagraph to compare\nperformance with expected ones. To create a more reliable simulation, we also\ninjected in our numerical model data collected by a Zernike Wavefront sensor\n(ZWFS) used to perform fine wavefront sensing on the bench. Now that the\ncoronagraphic branch is aligned on SEAL, we will be able to use contrast as a\nmetric for the performance of wavefront control methods on the bench.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"l_lkjfW_O22Hp9pKWQiwp_xgk9Z9VGJRPl6w6i_asSs","pdfSize":"4873328"}
