{"id":"2408.10646","title":"Beneath the Surface of Consistency: Exploring Cross-lingual Knowledge\n  Representation Sharing in LLMs","authors":"Maxim Ifergan, Leshem Choshen, Roee Aharoni, Idan Szpektor, Omri Abend","authorsParsed":[["Ifergan","Maxim",""],["Choshen","Leshem",""],["Aharoni","Roee",""],["Szpektor","Idan",""],["Abend","Omri",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 08:38:30 GMT"}],"updateDate":"2024-08-21","timestamp":1724143110000,"abstract":"  The veracity of a factoid is largely independent of the language it is\nwritten in. However, language models are inconsistent in their ability to\nanswer the same factual question across languages. This raises questions about\nhow LLMs represent a given fact across languages. We explore multilingual\nfactual knowledge through two aspects: the model's ability to answer a query\nconsistently across languages, and the ability to ''store'' answers in a shared\nrepresentation for several languages. We propose a methodology to measure the\nextent of representation sharing across languages by repurposing knowledge\nediting methods. We examine LLMs with various multilingual configurations using\na new multilingual dataset. We reveal that high consistency does not\nnecessarily imply shared representation, particularly for languages with\ndifferent scripts. Moreover, we find that script similarity is a dominant\nfactor in representation sharing. Finally, we observe that if LLMs could fully\nshare knowledge across languages, their accuracy in their best-performing\nlanguage could benefit an increase of up to 150\\% on average. These findings\nhighlight the need for improved multilingual knowledge representation in LLMs\nand suggest a path for the development of more robust and consistent\nmultilingual LLMs.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Y_jJELk_2eFGa-fEBVWiQ9b_ZM22_0Fzj_FKjLlDHBU","pdfSize":"1332688"}
