{"id":"2408.10235","title":"Multi-Source EEG Emotion Recognition via Dynamic Contrastive Domain\n  Adaptation","authors":"Yun Xiao, Yimeng Zhang, Xiaopeng Peng, Shuzheng Han, Xia Zheng, Dingyi\n  Fang, and Xiaojiang Chen","authorsParsed":[["Xiao","Yun",""],["Zhang","Yimeng",""],["Peng","Xiaopeng",""],["Han","Shuzheng",""],["Zheng","Xia",""],["Fang","Dingyi",""],["Chen","Xiaojiang",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 03:51:35 GMT"}],"updateDate":"2024-08-21","timestamp":1722743495000,"abstract":"  Electroencephalography (EEG) provides reliable indications of human cognition\nand mental states. Accurate emotion recognition from EEG remains challenging\ndue to signal variations among individuals and across measurement sessions. To\naddress these challenges, we introduce a multi-source dynamic contrastive\ndomain adaptation method (MS-DCDA), which models coarse-grained inter-domain\nand fine-grained intra-class adaptations through a multi-branch contrastive\nneural network and contrastive sub-domain discrepancy learning. Our model\nleverages domain knowledge from each individual source and a complementary\nsource ensemble and uses dynamically weighted learning to achieve an optimal\ntradeoff between domain transferability and discriminability. The proposed\nMS-DCDA model was evaluated using the SEED and SEED-IV datasets, achieving\nrespectively the highest mean accuracies of $90.84\\%$ and $78.49\\%$ in\ncross-subject experiments as well as $95.82\\%$ and $82.25\\%$ in cross-session\nexperiments. Our model outperforms several alternative domain adaptation\nmethods in recognition accuracy, inter-class margin, and intra-class\ncompactness. Our study also suggests greater emotional sensitivity in the\nfrontal and parietal brain lobes, providing insights for mental health\ninterventions, personalized medicine, and development of preventive strategies.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}