{"id":"2408.14080","title":"SONICS: Synthetic Or Not -- Identifying Counterfeit Songs","authors":"Md Awsafur Rahman, Zaber Ibn Abdul Hakim, Najibul Haque Sarker,\n  Bishmoy Paul and Shaikh Anowarul Fattah","authorsParsed":[["Rahman","Md Awsafur",""],["Hakim","Zaber Ibn Abdul",""],["Sarker","Najibul Haque",""],["Paul","Bishmoy",""],["Fattah","Shaikh Anowarul",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 08:02:57 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 04:14:14 GMT"}],"updateDate":"2024-08-28","timestamp":1724659377000,"abstract":"  The recent surge in AI-generated songs presents exciting possibilities and\nchallenges. While these tools democratize music creation, they also necessitate\nthe ability to distinguish between human-composed and AI-generated songs for\nsafeguarding artistic integrity and content curation. Existing research and\ndatasets in fake song detection only focus on singing voice deepfake detection\n(SVDD), where the vocals are AI-generated but the instrumental music is sourced\nfrom real songs. However, this approach is inadequate for contemporary\nend-to-end AI-generated songs where all components (vocals, lyrics, music, and\nstyle) could be AI-generated. Additionally, existing datasets lack lyrics-music\ndiversity, long-duration songs, and open fake songs. To address these gaps, we\nintroduce SONICS, a novel dataset for end-to-end Synthetic Song Detection\n(SSD), comprising over 97k songs with over 49k synthetic songs from popular\nplatforms like Suno and Udio. Furthermore, we highlight the importance of\nmodeling long-range temporal dependencies in songs for effective authenticity\ndetection, an aspect overlooked in existing methods. To capture these patterns,\nwe propose a novel model, SpecTTTra, that is up to 3 times faster and 6 times\nmore memory efficient compared to popular CNN and Transformer-based models\nwhile maintaining competitive performance. Finally, we offer both AI-based and\nHuman evaluation benchmarks, addressing another deficiency in current research.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MgTgq10bwzFiKPa30hdN9zzNucjH-KDxdJy9GPF5gj4","pdfSize":"11383158"}
