{"id":"2408.16808","title":"Ultrafast unidirectional spin Hall magnetoresistance driven by terahertz\n  light field","authors":"Ruslan Salikhov, Igor Ilyakov, Anneke Reinold, Jan-Christoph Deinert,\n  Thales de Oliveira, Alexey Ponomaryov, Gulloo Lal Prajapati, Patrick Pilch,\n  Ahmed Ghalgaoui, Max Koch, J\\\"urgen Fassbender, J\\\"urgen Lindner, Zhe Wang,\n  Sergey Kovalev","authorsParsed":[["Salikhov","Ruslan",""],["Ilyakov","Igor",""],["Reinold","Anneke",""],["Deinert","Jan-Christoph",""],["de Oliveira","Thales",""],["Ponomaryov","Alexey",""],["Prajapati","Gulloo Lal",""],["Pilch","Patrick",""],["Ghalgaoui","Ahmed",""],["Koch","Max",""],["Fassbender","Jürgen",""],["Lindner","Jürgen",""],["Wang","Zhe",""],["Kovalev","Sergey",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 17:34:00 GMT"}],"updateDate":"2024-09-02","timestamp":1724952840000,"abstract":"  The ultrafast control of magnetisation states in magnetically ordered systems\nis a key technological challenge for developing memory devices operable at\npicosecond timescales or terahertz (THz) frequencies. Despite significant\nefforts in ultrafast magnetic switching, convenient ultrafast readout of\nmagnetic states remains under investigation. Currently, many experiments\nexploit magneto-optical effects for detecting magnetisation states,\nnecessitating laser sources and optical components. However, energy-efficient\nand cost-effective electrical detection is preferred for practical\napplications. Unidirectional spin-Hall magnetoresistance (USMR) was proposed as\na simple two-terminal geometry for the electrical detection of the\nmagnetisation state in magnetic heterostructures. Here, we demonstrate that\nUSMR is active at THz frequencies for picosecond time readouts, and can be\ninitiated with light fields. We detect ultrafast USMR in various types of\nferromagnet/heavy metal thin film heterostructures through THz second harmonic\ngeneration. Our studies, combined with temperature-dependent measurements of\nUSMR, reveal a significant contribution from electron-magnon spin-flip\nscattering. This suggests possibilities for all-electrical detection of THz\nmagnon modes.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}