{"id":"2408.01343","title":"StitchFusion: Weaving Any Visual Modalities to Enhance Multimodal\n  Semantic Segmentation","authors":"Bingyu Li, Da Zhang, Zhiyuan Zhao, Junyu Gao and Xuelong Li","authorsParsed":[["Li","Bingyu",""],["Zhang","Da",""],["Zhao","Zhiyuan",""],["Gao","Junyu",""],["Li","Xuelong",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 15:41:16 GMT"}],"updateDate":"2024-08-05","timestamp":1722613276000,"abstract":"  Multimodal semantic segmentation shows significant potential for enhancing\nsegmentation accuracy in complex scenes. However, current methods often\nincorporate specialized feature fusion modules tailored to specific modalities,\nthereby restricting input flexibility and increasing the number of training\nparameters. To address these challenges, we propose StitchFusion, a\nstraightforward yet effective modal fusion framework that integrates\nlarge-scale pre-trained models directly as encoders and feature fusers. This\napproach facilitates comprehensive multi-modal and multi-scale feature fusion,\naccommodating any visual modal inputs. Specifically, Our framework achieves\nmodal integration during encoding by sharing multi-modal visual information. To\nenhance information exchange across modalities, we introduce a\nmulti-directional adapter module (MultiAdapter) to enable cross-modal\ninformation transfer during encoding. By leveraging MultiAdapter to propagate\nmulti-scale information across pre-trained encoders during the encoding\nprocess, StitchFusion achieves multi-modal visual information integration\nduring encoding. Extensive comparative experiments demonstrate that our model\nachieves state-of-the-art performance on four multi-modal segmentation datasets\nwith minimal additional parameters. Furthermore, the experimental integration\nof MultiAdapter with existing Feature Fusion Modules (FFMs) highlights their\ncomplementary nature. Our code is available at StitchFusion_repo.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"i_np3E95FBUG-U3YFFDZHko8ZHdcjrR9W7yK6wDkxmw","pdfSize":"15783992"}
