{"id":"2408.15358","title":"NSVS 14256825: period variation and orbital stability analysis of two\n  possible substellar companions","authors":"Konstantinos Zervas and Panagiota-Eleftheria Christopoulou","authorsParsed":[["Zervas","Konstantinos",""],["Christopoulou","Panagiota-Eleftheria",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 18:35:53 GMT"},{"version":"v2","created":"Sat, 7 Sep 2024 10:19:51 GMT"}],"updateDate":"2024-09-10","timestamp":1724783753000,"abstract":"  Recent period investigations of the Post-Common Envelop Binary (PCEB) NSVS\n14256825 suggested that two circumbinary companions were necessary to explain\nthe observed Eclipse Timing Variations (ETVs). Our objective was to search for\nthe best-fitting curve of two LTTE terms in the ETV diagram, implementing a\ngrid search optimization scheme of Keplerian (kinematic) and Newtonian (N-body)\nfits, alongside a dynamical stability analysis of N-body simulations. We\ncompiled two datasets of archival photometric data covering a different\ntimeline and updated them with new observations and with three new times of\nminima (TOMs) calculated from the Transiting Exoplanet Survey Satellite\n(\\textit{TESS}). A grid search optimization process was implemented and the\nresulted solutions, that fell within the $90\\%$ confidence interval of the\nbest-fitting curve of the ETV diagram, were tested for orbital stability using\nN-body simulations and the MEGNO chaos indicator. The Keplerian and Netwonian\nfits are in close agreement and hundreds of stable configurations were\nidentified for both datasets reaching a lifetime of 1 Myr. Our results suggest\nthat the ETV data can be explained by the presence of a circumbinary planet\nwith mass $m_b=11 M_{Jup.}$ in a nearly circular inner orbit of period $P_b =\n7$ yr. The outer orbit is unconstrained with a period range $P_c=20-50$ yr\n(from 3:1 to 7:1 MMR) for a circumbinary body of substellar mass ($m_c=11-70\nM_{Jup.}$). The stable solutions of the minimum and maximum reduced chi-square\nvalue were integrated for 100 Myr and confirmed a non-chaotic behavior. Their\nresiduals in the ETV data could be explained by a spin-orbit-coupling model\n(Applegate-Lanza). Continuous monitoring of the system is required in order to\nrefine and constrain the proposed solutions.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"vJEAyT62CxRU7be5oQSBhFsfhPPFl4wUsXrhbT99oIU","pdfSize":"13759006"}
