{"id":"2408.11006","title":"Security Attacks on LLM-based Code Completion Tools","authors":"Wen Cheng, Ke Sun, Xinyu Zhang, Wei Wang","authorsParsed":[["Cheng","Wen",""],["Sun","Ke",""],["Zhang","Xinyu",""],["Wang","Wei",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 17:00:04 GMT"},{"version":"v2","created":"Mon, 16 Sep 2024 17:35:10 GMT"}],"updateDate":"2024-09-17","timestamp":1724173204000,"abstract":"  The rapid development of large language models (LLMs) has significantly\nadvanced code completion capabilities, giving rise to a new generation of\nLLM-based Code Completion Tools (LCCTs). Unlike general-purpose LLMs, these\ntools possess unique workflows, integrating multiple information sources as\ninput and prioritizing code suggestions over natural language interaction,\nwhich introduces distinct security challenges. Additionally, LCCTs often rely\non proprietary code datasets for training, raising concerns about the potential\nexposure of sensitive data. This paper exploits these distinct characteristics\nof LCCTs to develop targeted attack methodologies on two critical security\nrisks: jailbreaking and training data extraction attacks. Our experimental\nresults expose significant vulnerabilities within LCCTs, including a 99.4%\nsuccess rate in jailbreaking attacks on GitHub Copilot and a 46.3% success rate\non Amazon Q. Furthermore, We successfully extracted sensitive user data from\nGitHub Copilot, including 54 real email addresses and 314 physical addresses\nassociated with GitHub usernames. Our study also demonstrates that these\ncode-based attack methods are effective against general-purpose LLMs, such as\nthe GPT series, highlighting a broader security misalignment in the handling of\ncode by modern LLMs. These findings underscore critical security challenges\nassociated with LCCTs and suggest essential directions for strengthening their\nsecurity frameworks. The example code and attack samples from our research are\nprovided at https://github.com/Sensente/Security-Attacks-on-LCCTs.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tA-yzD4UQVpv7bKC6UYoaXWaVZRRz5CqFhW1jskiq8A","pdfSize":"924877"}
