{"id":"2408.05022","title":"Robust Backstepping Control of a Quadrotor Unmanned Aerial Vehicle Under\n  Colored Noises","authors":"Mehmet Karahan","authorsParsed":[["Karahan","Mehmet",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 12:22:35 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 20:28:10 GMT"}],"updateDate":"2024-08-29","timestamp":1723206155000,"abstract":"  Advances in software and hardware technologies have facilitated the\nproduction of quadrotor unmanned aerial vehicles (UAVs). Quadrotor UAVs are\nused in important missions such as search and rescue, counter terrorism,\nfirefighting, surveillance and cargo transportation. While performing these\ntasks, quadrotors must operate in noisy environments. Therefore, a robust\ncontroller design that can control the altitude and attitude of the quadrotor\nin noisy environments is of great importance. While many researchers focus only\non white Gaussian noise in their studies, all colored noises should be\nconsidered during quadrotor's operation. In this study, it is aimed to design a\nrobust controller that is resistant to all colored noises. Firstly, a nonlinear\nmodel of the quadrotor was created with MATLAB. Then, a backstepping control\ndesign that is resistant to colored noises was realized. The designed\nbackstepping controller was tested under Gaussian white noise, pink noise,\nbrown noise, blue noise and purple noise. PID and Lyapunov-based controller\ndesigns were also carried out and their time responses (rise time, overshoot,\nsettling time) were compared with those of backstepping controller. When the\nvalues obtained was examined, it was proven that the proposed backstepping\ncontroller had the least overshoot and shortest settling time under all noise\ntypes.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LJS88c9wNLaSzJj32vtCSgKb_YGpEHcqkuGdogus4V0","pdfSize":"2153669"}
