{"id":"2408.15640","title":"GANs Conditioning Methods: A Survey","authors":"Anis Bourou, Val\\'erie Mezger, Auguste Genovesio","authorsParsed":[["Bourou","Anis",""],["Mezger","Valérie",""],["Genovesio","Auguste",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 08:52:14 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 13:47:38 GMT"},{"version":"v3","created":"Tue, 3 Sep 2024 08:35:15 GMT"}],"updateDate":"2024-09-04","timestamp":1724835134000,"abstract":"  In recent years, Generative Adversarial Networks (GANs) have seen significant\nadvancements, leading to their widespread adoption across various fields. The\noriginal GAN architecture enables the generation of images without any specific\ncontrol over the content, making it an unconditional generation process.\nHowever, many practical applications require precise control over the generated\noutput, which has led to the development of conditional GANs (cGANs) that\nincorporate explicit conditioning to guide the generation process. cGANs extend\nthe original framework by incorporating additional information (conditions),\nenabling the generation of samples that adhere to that specific criteria.\nVarious conditioning methods have been proposed, each differing in how they\nintegrate the conditioning information into both the generator and the\ndiscriminator networks. In this work, we review the conditioning methods\nproposed for GANs, exploring the characteristics of each method and\nhighlighting their unique mechanisms and theoretical foundations. Furthermore,\nwe conduct a comparative analysis of these methods, evaluating their\nperformance on various image datasets. Through these analyses, we aim to\nprovide insights into the strengths and limitations of various conditioning\ntechniques, guiding future research and application in generative modeling.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}