{"id":"2408.17061","title":"Robotic Object Insertion with a Soft Wrist through Sim-to-Real\n  Privileged Training","authors":"Yuni Fuchioka, Cristian C. Beltran-Hernandez, Hai Nguyen, and Masashi\n  Hamaya","authorsParsed":[["Fuchioka","Yuni",""],["Beltran-Hernandez","Cristian C.",""],["Nguyen","Hai",""],["Hamaya","Masashi",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 07:47:19 GMT"}],"updateDate":"2024-09-02","timestamp":1725004039000,"abstract":"  This study addresses contact-rich object insertion tasks under unstructured\nenvironments using a robot with a soft wrist, enabling safe contact\ninteractions. For the unstructured environments, we assume that there are\nuncertainties in object grasp and hole pose and that the soft wrist pose cannot\nbe directly measured. Recent methods employ learning approaches and\nforce/torque sensors for contact localization; however, they require data\ncollection in the real world. This study proposes a sim-to-real approach using\na privileged training strategy. This method has two steps. 1) The teacher\npolicy is trained to complete the task with sensor inputs and ground truth\nprivileged information such as the peg pose, and then 2) the student encoder is\ntrained with data produced from teacher policy rollouts to estimate the\nprivileged information from sensor history. We performed sim-to-real\nexperiments under grasp and hole pose uncertainties. This resulted in 100\\%,\n95\\%, and 80\\% success rates for circular peg insertion with 0, +5, and -5\ndegree peg misalignments, respectively, and start positions randomly shifted\n$\\pm$ 10 mm from a default position. Also, we tested the proposed method with a\nsquare peg that was never seen during training. Additional simulation\nevaluations revealed that using the privileged strategy improved success rates\ncompared to training with only simulated sensor data. Our results demonstrate\nthe advantage of using sim-to-real privileged training for soft robots, which\nhas the potential to alleviate human engineering efforts for robotic assembly.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}