{"id":"2408.02188","title":"The Role of Superlattice Phonons in Charge Localization Across Quantum\n  Dot Arrays","authors":"Bokang Hou, Matthew Coley-O'Rourke, Uri Banin, Michael Thoss, Eran\n  Rabani","authorsParsed":[["Hou","Bokang",""],["Coley-O'Rourke","Matthew",""],["Banin","Uri",""],["Thoss","Michael",""],["Rabani","Eran",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 02:25:07 GMT"}],"updateDate":"2024-08-06","timestamp":1722824707000,"abstract":"  Semiconductor quantum dot (QD) assemblies are utilized in solar cells and\nlight-harvesting devices because of their distinct physical and optical\nproperties. Recent experiments have successfully synthesized QD molecules,\narrays, and assemblies with precision by directly attaching QDs. These systems\ndemonstrate high carrier mobility while preserving the optical properties of\nthe individual QD components. However, despite advancements in fabricating\nthese superstructures, a comprehensive understanding of the charge transfer\nprocess at the microscopic level is still lacking. Here, we theoretically\ninvestigated the electron transfer dynamics across finite 1-dimensional\nCdSe-CdS core-shell QD arrays, with $N_{\\rm dot}=2,3, \\cdots$ QDs. The\nelectronic and vibronic properties of the QD arrays were calculated using a\nsemiempirical pseudopotential method and the electron transfer dynamics were\nstudied using a mixed quantum-classical mapping approach. We find that as\n$N_{\\rm dot}$ increases, the superlattice bending and the symmetric stretch\nmodes can significantly localize electron transfer in the nonadiabatic regime,\nparticularly when the connecting neck between the QDs is narrow, resulting in\ncharge localization for large values of $N_{\\rm dot}$. This behavior is quite\ndifferent in the adiabatic limit when the neck connecting the QDs is wide,\nwhere such modes can facilitate electron transfer, partially governed by\ndecoherence times. The interplay between electronic and super-lattice couplings\nis thus crucial for designing high-mobility devices based on QD superlattices\nand avoiding charge localization.\n","subjects":["Physics/Chemical Physics","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gYz61xlaXt8jPRepeI8axyia8NXx7k9OdeoqoAg1VQM","pdfSize":"4742542"}
