{"id":"2408.15672","title":"Understanding Field-Free Single-Shot Laser-Induced Reversal of Exchange\n  Bias","authors":"Floris J. F. van Riel, Stoyan M. Vercruysse, Bert Koopmans, Diana C.\n  Leitao","authorsParsed":[["van Riel","Floris J. F.",""],["Vercruysse","Stoyan M.",""],["Koopmans","Bert",""],["Leitao","Diana C.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 09:52:59 GMT"}],"updateDate":"2024-08-29","timestamp":1724838779000,"abstract":"  Exchange bias is applied ubiquitously throughout the spintronics industry for\nits ability to provide a reference direction robust to external magnetic field\ndisturbances. For some applications, reorienting the exchange-biased reference\naxis may add to or enhance functionality of devices. Conventional methods for\nachieving this reorientation require assisting magnetic fields with long\nsetting times and are thus limited in terms of speed and versatility. In this\nstudy, we show that by integrating functionalized materials (Co/Gd multilayers)\ninto an existing thin film stack (Pt/Co/IrMn), perpendicular exchange bias can\nbe reoriented $180^\\circ$ by exciting it with a single femtosecond laser pulse,\nwithout an external field and on an ultrafast timescale. We found this effect\nto be repeatable arbitrarily many times, with only the first laser pulse\nincurring a loss of the initial exchange bias magnitude, yet preserving the\nunidirectionality required for referencing. By combining an experimental\nmapping of three key parameters (stack, laser and magnetic field properties)\nwith microscopic models we were able to unravel the processes and features of\nthe exchange bias reversal by considering the relevance of Curie, N\\'eel and\nblocking temperatures. The outcomes of this study provide guiding principles\ntowards designing fully optically reprogrammable magnetic sensing devices.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}