{"id":"2408.03253","title":"Ultra-thin strain-relieving Si$_{1-x}$Ge$_x$ layers enabling III-V\n  epitaxy on Si","authors":"Trevor R. Smith, Spencer McDermott, Vatsalkumar Patel, Ross Anthony,\n  Manu Hedge, Andrew P. Knights, Ryan B. Lewis","authorsParsed":[["Smith","Trevor R.",""],["McDermott","Spencer",""],["Patel","Vatsalkumar",""],["Anthony","Ross",""],["Hedge","Manu",""],["Knights","Andrew P.",""],["Lewis","Ryan B.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 15:23:45 GMT"}],"updateDate":"2024-08-07","timestamp":1722957825000,"abstract":"  The explosion of artificial intelligence, possible end of Moore's law, dawn\nof quantum computing and continued exponential growth of data communications\ntraffic have brought new urgency to the need for laser integration on the\ndiversified Si platform. While diode lasers on III-V platforms have long\npowered internet data communications and other optoelectronic technologies,\ndirect integration with Si remains problematic. A paradigm-shifting solution\nrequires exploring new and unconventional materials and integration approaches.\nIn this work, we show that a sub-10-nm ultra-thin Si$_{1-x}$Ge$_x$ buffer layer\nfabricated by an oxidative solid-phase epitaxy process can facilitate\nextraordinarily efficient strain relaxation. The Si$_{1-x}$Ge$_x$ layer is\nformed by ion implanting Ge into Si(111) and selectively oxidizing Si atoms in\nthe resulting ion-damaged layer, precipitating a fully strain-relaxed Ge-rich\nlayer between the Si substrate and surface oxide. The efficient strain\nrelaxation results from the high oxidation temperature, producing a periodic\nnetwork of dislocations at the substrate interface, coinciding with modulations\nof the Ge content in the Si$_{1-x}$Ge$_x$ layer and indicating the presence of\ndefect-mediated diffusion of Si through the layer. The epitaxial growth of\nhigh-quality GaAs is demonstrated on this ultra-thin Si$_{1-x}$Ge$_x$ layer,\ndemonstrating a promising new pathway for integrating III-V lasers directly on\nthe Si platform.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"nqJyRptwD3uITG62b6HneKH15yeLI93ziLbLtlG-JN8","pdfSize":"1284131"}
