{"id":"2408.11519","title":"Towards an Inclusive Approach to Corporate Social Responsibility (CSR)\n  in Morocco: CGEM's Commitment","authors":"Gnaoui Imane and Moutahaddib Aziz","authorsParsed":[["Imane","Gnaoui",""],["Aziz","Moutahaddib",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 10:51:27 GMT"}],"updateDate":"2024-08-22","timestamp":1724237487000,"abstract":"  Corporate social responsibility encourages companies to integrate social and\nenvironmental concerns into their activities and their relations with\nstakeholders. It encompasses all actions aimed at the social good, above and\nbeyond corporate interests and legal requirements. Various international\norganizations, authors and researchers have explored the notion of CSR and\nproposed a range of definitions reflecting their perspectives on the concept.\nIn Morocco, although Moroccan companies are not overwhelmingly embracing CSR,\nseveral factors are encouraging them to integrate the CSR approach not only\ninto their discourse, but also into their strategies. The CGEM is actively\ninvolved in promoting CSR within Moroccan companies, awarding the \"CGEM Label\nfor CSR\" to companies that meet the criteria set out in the CSR Charter. The\nprocess of labeling Moroccan companies is in full expansion. The graphs\npresented in this article are broken down according to several criteria, such\nas company size, sector of activity and listing on the Casablanca Stock\nExchange, in order to provide an overview of CSR-labeled companies in Morocco.\nThe approach adopted for this article is a qualitative one aimed at presenting,\nfirstly, the different definitions of the CSR concept and its evolution over\ntime. In this way, the study focuses on the Moroccan context to dissect and\nanalyze the state of progress of CSR integration in Morocco and the various\nefforts made by the CGEM to implement it. According to the data, 124 Moroccan\ncompanies have been awarded the CSR label. For a label in existence since 2006,\nthis figure reflects a certain reluctance on the part of Moroccan companies to\nfully implement the CSR approach in their strategies. Nevertheless, Morocco is\nin a transitional phase, marked by the gradual adoption of various socially\nresponsible practices.\n","subjects":["Economics/Econometrics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}