{"id":"2408.07908","title":"Time-Dependent VAE for Building Latent Factor from Visual Neural\n  Activity with Complex Dynamics","authors":"Liwei Huang, ZhengYu Ma, Liutao Yu, Huihui Zhou, Yonghong Tian","authorsParsed":[["Huang","Liwei",""],["Ma","ZhengYu",""],["Yu","Liutao",""],["Zhou","Huihui",""],["Tian","Yonghong",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 03:27:23 GMT"}],"updateDate":"2024-08-16","timestamp":1723692443000,"abstract":"  Seeking high-quality neural latent representations to reveal the intrinsic\ncorrelation between neural activity and behavior or sensory stimulation has\nattracted much interest. Currently, some deep latent variable models rely on\nbehavioral information (e.g., movement direction and position) as an aid to\nbuild expressive embeddings while being restricted by fixed time scales. Visual\nneural activity from passive viewing lacks clearly correlated behavior or task\ninformation, and high-dimensional visual stimulation leads to intricate neural\ndynamics. To cope with such conditions, we propose Time-Dependent SwapVAE,\nfollowing the approach of separating content and style spaces in Swap-VAE, on\nthe basis of which we introduce state variables to construct conditional\ndistributions with temporal dependence for the above two spaces. Our model\nprogressively generates latent variables along neural activity sequences, and\nwe apply self-supervised contrastive learning to shape its latent space. In\nthis way, it can effectively analyze complex neural dynamics from sequences of\narbitrary length, even without task or behavioral data as auxiliary inputs. We\ncompare TiDe-SwapVAE with alternative models on synthetic data and neural data\nfrom mouse visual cortex. The results show that our model not only accurately\ndecodes complex visual stimuli but also extracts explicit temporal neural\ndynamics, demonstrating that it builds latent representations more relevant to\nvisual stimulation.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Quantitative Biology/Neurons and Cognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}