{"id":"2408.14259","title":"Towards Synthetic Trace Generation of Modeling Operations using\n  In-Context Learning Approach","authors":"Vittoriano Muttillo, Claudio Di Sipio, Riccardo Rubei, Luca\n  Berardinelli, and MohammadHadi Dehghani","authorsParsed":[["Muttillo","Vittoriano",""],["Di Sipio","Claudio",""],["Rubei","Riccardo",""],["Berardinelli","Luca",""],["Dehghani","MohammadHadi",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 13:26:44 GMT"}],"updateDate":"2024-08-27","timestamp":1724678804000,"abstract":"  Producing accurate software models is crucial in model-driven software\nengineering (MDE). However, modeling complex systems is an error-prone task\nthat requires deep application domain knowledge. In the past decade, several\nautomated techniques have been proposed to support academic and industrial\npractitioners by providing relevant modeling operations. Nevertheless, those\ntechniques require a huge amount of training data that cannot be available due\nto several factors, e.g., privacy issues. The advent of large language models\n(LLMs) can support the generation of synthetic data although state-of-the-art\napproaches are not yet supporting the generation of modeling operations. To\nfill the gap, we propose a conceptual framework that combines modeling event\nlogs, intelligent modeling assistants, and the generation of modeling\noperations using LLMs. In particular, the architecture comprises modeling\ncomponents that help the designer specify the system, record its operation\nwithin a graphical modeling environment, and automatically recommend relevant\noperations. In addition, we generate a completely new dataset of modeling\nevents by telling on the most prominent LLMs currently available. As a proof of\nconcept, we instantiate the proposed framework using a set of existing modeling\ntools employed in industrial use cases within different European projects. To\nassess the proposed methodology, we first evaluate the capability of the\nexamined LLMs to generate realistic modeling operations by relying on\nwell-founded distance metrics. Then, we evaluate the recommended operations by\nconsidering real-world industrial modeling artifacts. Our findings demonstrate\nthat LLMs can generate modeling events even though the overall accuracy is\nhigher when considering human-based operations.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}