{"id":"2408.00050","title":"Algorithms for Collaborative Machine Learning under Statistical\n  Heterogeneity","authors":"Seok-Ju Hahn","authorsParsed":[["Hahn","Seok-Ju",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 16:32:34 GMT"}],"updateDate":"2024-08-02","timestamp":1722443554000,"abstract":"  Learning from distributed data without accessing them is undoubtedly a\nchallenging and non-trivial task. Nevertheless, the necessity for distributed\ntraining of a statistical model has been increasing, due to the privacy\nconcerns of local data owners and the cost in centralizing the massively\ndistributed data. Federated learning (FL) is currently the de facto standard of\ntraining a machine learning model across heterogeneous data owners, without\nleaving the raw data out of local silos. Nevertheless, several challenges must\nbe addressed in order for FL to be more practical in reality. Among these\nchallenges, the statistical heterogeneity problem is the most significant and\nrequires immediate attention. From the main objective of FL, three major\nfactors can be considered as starting points -- \\textit{parameter},\ntextit{mixing coefficient}, and \\textit{local data distributions}. In alignment\nwith the components, this dissertation is organized into three parts. In\nChapter II, a novel personalization method, \\texttt{SuPerFed}, inspired by the\nmode-connectivity is introduced. In Chapter III, an adaptive decision-making\nalgorithm, \\texttt{AAggFF}, is introduced for inducing uniform performance\ndistributions in participating clients, which is realized by online convex\noptimization framework. Finally, in Chapter IV, a collaborative synthetic data\ngeneration method, \\texttt{FedEvg}, is introduced, leveraging the flexibility\nand compositionality of an energy-based modeling approach. Taken together, all\nof these approaches provide practical solutions to mitigate the statistical\nheterogeneity problem in data-decentralized settings, paving the way for\ndistributed systems and applications using collaborative machine learning\nmethods.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LGvkKtk766gRsN1gZI6EZ1dSSSEzhfPphi1HPjFlj94","pdfSize":"32603404"}
