{"id":"2408.07216","title":"Extreme Enhancement-Mode Operation Accumulation Channel\n  Hydrogen-Terminated Diamond FETs with $V_{th} < -6V$ and High On-Current","authors":"Chunlin Qu, Isha Maini, Qing Guo, Alastair Stacey, David A.J. Moran","authorsParsed":[["Qu","Chunlin",""],["Maini","Isha",""],["Guo","Qing",""],["Stacey","Alastair",""],["Moran","David A. J.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 21:54:47 GMT"}],"updateDate":"2024-08-15","timestamp":1723586087000,"abstract":"  In this work we demonstrate a new Field Effect Transistor device concept\nbased on hydrogen-terminated diamond (H-diamond) that operates in an\nAccumulation Channel rather than Transfer Doping regime. Our FET devices\ndemonstrate both extreme enhancement-mode operation and high on-current with\nimproved channel charge mobility compared to Transfer-Doped equivalents.\nElectron-beam evaporated $Al_2O_3$ is used on H-diamond to suppress the\nTransfer Doping mechanism and produce an extremely high ungated channel\nresistance. A high-quality H-diamond surface with an unpinned Fermi level is\ncrucially achieved, allowing for formation of a high-density hole accumulation\nlayer by gating the entire device channel which is encapsulated in dual-stacks\nof $Al_2O_3$. Completed devices with gate/channel length of $1 \\mu m$\ndemonstrate record threshold voltage $< -6 V$ with on-current $> 80 mA/mm$.\nCarrier density and mobility figures extracted by CV analysis indicate high 2D\ncharge density of $~ 2 \\times 10^{12} cm^{-2}$ and increased hole mobility of\n$110 cm^2 /V \\cdot s$ in comparison with more traditional Transfer-Doped\nH-diamond FETs. These results demonstrate the most negative threshold voltage\nyet reported for H-diamond FETs and highlight a new strategy for the\ndevelopment of high-performance power devices that better exploit diamond's\nintrinsic dielectric properties and high hole mobility.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}