{"id":"2408.09845","title":"Predicting Long-term Dynamics of Complex Networks via Identifying\n  Skeleton in Hyperbolic Space","authors":"Ruikun Li and Huandong Wang and Jinghua Piao and Qingmin Liao and Yong\n  Li","authorsParsed":[["Li","Ruikun",""],["Wang","Huandong",""],["Piao","Jinghua",""],["Liao","Qingmin",""],["Li","Yong",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 09:47:37 GMT"}],"updateDate":"2024-08-20","timestamp":1724060857000,"abstract":"  Learning complex network dynamics is fundamental for understanding, modeling,\nand controlling real-world complex systems. Though great efforts have been made\nto predict the future states of nodes on networks, the capability of capturing\nlong-term dynamics remains largely limited. This is because they overlook the\nfact that long-term dynamics in complex network are predominantly governed by\ntheir inherent low-dimensional manifolds, i.e., skeletons. Therefore, we\npropose the Dynamics-Invariant Skeleton Neural Net}work (DiskNet), which\nidentifies skeletons of complex networks based on the renormalization group\nstructure in hyperbolic space to preserve both topological and dynamics\nproperties. Specifically, we first condense complex networks with various\ndynamics into simple skeletons through physics-informed hyperbolic embeddings.\nFurther, we design graph neural ordinary differential equations to capture the\ncondensed dynamics on the skeletons. Finally, we recover the skeleton networks\nand dynamics to the original ones using a degree-based super-resolution module.\nExtensive experiments across three representative dynamics as well as five\nreal-world and two synthetic networks demonstrate the superior performances of\nthe proposed DiskNet, which outperforms the state-of-the-art baselines by an\naverage of 10.18\\% in terms of long-term prediction accuracy. Code for\nreproduction is available at: https://github.com/tsinghua-fib-lab/DiskNet.\n","subjects":["Computing Research Repository/Social and Information Networks","Physics/Physics and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}