{"id":"2408.07657","title":"Imaging strain-controlled magnetic reversal in thin CrSBr","authors":"Kousik Bagani, Andriani Vervelaki, Daniel Jetter, Aravind Devarakonda,\n  M\\\"arta A. Tschudin, Boris Gross, Daniel G. Chica, David A. Broadway, Cory R.\n  Dean, Xavier Roy, Patrick Maletinsky, Martino Poggio","authorsParsed":[["Bagani","Kousik",""],["Vervelaki","Andriani",""],["Jetter","Daniel",""],["Devarakonda","Aravind",""],["Tschudin","Märta A.",""],["Gross","Boris",""],["Chica","Daniel G.",""],["Broadway","David A.",""],["Dean","Cory R.",""],["Roy","Xavier",""],["Maletinsky","Patrick",""],["Poggio","Martino",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 16:32:29 GMT"}],"updateDate":"2024-08-15","timestamp":1723653149000,"abstract":"  Two-dimensional materials are extraordinarily sensitive to external stimuli,\nmaking them ideal for studying fundamental properties and for engineering\ndevices with new functionalities. One such stimulus, strain, affects the\nmagnetic properties of the layered magnetic semiconductor CrSBr to such a\ndegree that it can induce a reversible antiferromagnetic-to-ferromagnetic phase\ntransition. Given the pervasiveness of non-uniform strain in exfoliated\ntwo-dimensional magnets, it is crucial to understand its impact on their\nmagnetic behavior. Using scanning SQUID-on-lever microscopy, we directly image\nthe effects of spatially inhomogeneous strain on the magnetization of layered\nCrSBr as it is polarized by a field applied along its easy axis. The evolution\nof this magnetization and the formation of domains is reproduced by a\nmicromagnetic model, which incorporates the spatially varying strain and the\ncorresponding changes in the local interlayer exchange stiffness. The observed\nsensitivity to small strain gradients along with similar images of a nominally\nunstrained CrSBr sample suggest that unintentional strain inhomogeneity\ninfluences the magnetic behavior of exfoliated samples and must be considered\nin the design of future devices.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}