{"id":"2408.16305","title":"Semantics-Oriented Multitask Learning for DeepFake Detection: A Joint\n  Embedding Approach","authors":"Mian Zou, Baosheng Yu, Yibing Zhan, Siwei Lyu, and Kede Ma","authorsParsed":[["Zou","Mian",""],["Yu","Baosheng",""],["Zhan","Yibing",""],["Lyu","Siwei",""],["Ma","Kede",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 07:11:50 GMT"}],"updateDate":"2024-08-30","timestamp":1724915510000,"abstract":"  In recent years, the multimedia forensics and security community has seen\nremarkable progress in multitask learning for DeepFake (i.e., face forgery)\ndetection. The prevailing strategy has been to frame DeepFake detection as a\nbinary classification problem augmented by manipulation-oriented auxiliary\ntasks. This strategy focuses on learning features specific to face\nmanipulations, which exhibit limited generalizability. In this paper, we delve\ndeeper into semantics-oriented multitask learning for DeepFake detection,\nleveraging the relationships among face semantics via joint embedding. We first\npropose an automatic dataset expansion technique that broadens current face\nforgery datasets to support semantics-oriented DeepFake detection tasks at both\nthe global face attribute and local face region levels. Furthermore, we resort\nto joint embedding of face images and their corresponding labels (depicted by\ntextual descriptions) for prediction. This approach eliminates the need for\nmanually setting task-agnostic and task-specific parameters typically required\nwhen predicting labels directly from images. In addition, we employ a bi-level\noptimization strategy to dynamically balance the fidelity loss weightings of\nvarious tasks, making the training process fully automated. Extensive\nexperiments on six DeepFake datasets show that our method improves the\ngeneralizability of DeepFake detection and, meanwhile, renders some degree of\nmodel interpretation by providing human-understandable explanations.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}