{"id":"2408.01692","title":"A Comparative Analysis of CNN-based Deep Learning Models for Landslide\n  Detection","authors":"Omkar Oak, Rukmini Nazre, Soham Naigaonkar, Suraj Sawant, Himadri\n  Vaidya","authorsParsed":[["Oak","Omkar",""],["Nazre","Rukmini",""],["Naigaonkar","Soham",""],["Sawant","Suraj",""],["Vaidya","Himadri",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 07:20:10 GMT"}],"updateDate":"2024-08-06","timestamp":1722669610000,"abstract":"  Landslides inflict substantial societal and economic damage, underscoring\ntheir global significance as recurrent and destructive natural disasters.\nRecent landslides in northern parts of India and Nepal have caused significant\ndisruption, damaging infrastructure and posing threats to local communities.\nConvolutional Neural Networks (CNNs), a type of deep learning technique, have\nshown remarkable success in image processing. Because of their sophisticated\narchitectures, advanced CNN-based models perform better in landslide detection\nthan conventional algorithms. The purpose of this work is to investigate CNNs'\npotential in more detail, with an emphasis on comparison of CNN based models\nfor better landslide detection. We compared four traditional semantic\nsegmentation models (U-Net, LinkNet, PSPNet, and FPN) and utilized the ResNet50\nbackbone encoder to implement them. Moreover, we have experimented with the\nhyperparameters such as learning rates, batch sizes, and regularization\ntechniques to fine-tune the models. We have computed the confusion matrix for\neach model and used performance metrics including precision, recall and\nf1-score to evaluate and compare the deep learning models. According to the\nexperimental results, LinkNet gave the best results among the four models\nhaving an Accuracy of 97.49% and a F1-score of 85.7% (with 84.49% precision,\n87.07% recall). We have also presented a comprehensive comparison of all\npixel-wise confusion matrix results and the time taken to train each model.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}