{"id":"2408.13192","title":"Butterfly Diagram and Other Properties of Plage Areas from Kodaikanal Ca\n  II K Photographs Covering 1904-2007","authors":"Bibhuti Kumar Jha, Theodosios Chatzistergos, Dipankar Banerjee, Ilaria\n  Ermolli, Natalie A. Krivova, Sami K. Solanki and Aditya Priyadarshi","authorsParsed":[["Jha","Bibhuti Kumar",""],["Chatzistergos","Theodosios",""],["Banerjee","Dipankar",""],["Ermolli","Ilaria",""],["Krivova","Natalie A.",""],["Solanki","Sami K.",""],["Priyadarshi","Aditya",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 16:22:54 GMT"}],"updateDate":"2024-08-26","timestamp":1724430174000,"abstract":"  Ca II K observations of the Sun have a great potential for probing the Sun's\nmagnetism and activity, as well as for reconstructing solar irradiance. The\nKodaikanal Solar Observatory (KoSO) in India, houses one of the most prominent\nCa II K archives, spanning from 1904 to 2007, obtained under the same\nexperimental conditions over a century, a feat very few other sites have\nachieved. However, the KoSO Ca II K archive suffers from several\ninconsistencies (e.g., missing/incorrect timestamps of observations and\norientation of some images) which have limited the use of the archive. This\nstudy is a step towards bringing the KoSO archive to its full potential. We did\nthis by developing an automatic method to orient the images more accurately\nthan in previous studies. Furthermore, we included more data than in earlier\nstudies (considering images that could not previously be analyzed by other\ntechniques as well as 2845 newly digitized images), while also accounting for\nmistakes in the observational date/time. These images were accurately processed\nto identify plage regions along with their locations, enabling us to construct\nthe butterfly diagram of plage areas from the entire KoSO Ca II K archive\ncovering 1904-2007. Our butterfly diagram shows significantly fewer data gaps\ncompared to earlier versions due to the larger set of data used in this study.\nMoreover, our butterfly diagram is consistent with Sp\\\"orer's law for sunspots,\nvalidating our automatic image orientation method. Additionally, we found that\nthe mean latitude of plage areas calculated over the entire period is\n20.5%+/-2.0 higher than that of sunspots, irrespective of the phase or the\nstrength of the solar cycle. We also studied the North-South asymmetry showing\nthat the northern hemisphere dominated plage areas during solar cycles 19 and\n20, while the southern hemisphere dominated during solar cycles 21--23.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jahZf065cfy_7Q0KDKMO9tGk2JX_Yawh8sJK2ZtMl-E","pdfSize":"3743708"}
