{"id":"2408.14804","title":"Data-Driven Approach to Learning Optimal Forms of Constitutive Relations\n  in Models Describing Lithium Plating in Battery Cells","authors":"Avesta Ahmadi, Kevin J. Sanders, Gillian R. Goward and Bartosz Protas","authorsParsed":[["Ahmadi","Avesta",""],["Sanders","Kevin J.",""],["Goward","Gillian R.",""],["Protas","Bartosz",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 06:23:15 GMT"}],"updateDate":"2024-08-28","timestamp":1724739795000,"abstract":"  In this study we construct a data-driven model describing Lithium plating in\na battery cell, which is a key process contributing to degradation of such\ncells. Starting from the fundamental Doyle-Fuller-Newman (DFN) model, we use\nasymptotic reduction and spatial averaging techniques to derive a simplified\nrepresentation to track the temporal evolution of two key concentrations in the\nsystem, namely, the total intercalated Lithium on the negative electrode\nparticles and total plated Lithium. This model depends on an a priori unknown\nconstitutive relations of the cell as a function of thestate variables. An\noptimal form of this constitutive relation is then deduced from experimental\nmeasurements of the time dependent concentrations of different Lithium phases\nacquired through Nuclear Magnetic Resonance spectroscopy. This is done by\nsolving an inverse problem in which this constitutive relation is found subject\nto minimum assumptions as a minimizer of a suitable constrained optimization\nproblem where the discrepancy between the model predictions and experimental\ndata is minimized. This optimization problem is solved using a state-of-the-art\nadjoint-based technique. In contrast to some of the earlier approaches to\nmodelling Lithium plating, the proposed model is able to predict non-trivial\nevolution of the concentrations in the relaxation regime when no current\nisapplied to the cell. When equipped with an optimal constitutive relation, the\nmodel provides accurate predictions of the time evolution of both intercalated\nand plated Lithium across a wide range of charging/discharging rates. It can\ntherefore serve as a useful tool for prediction and control of degradation\nmechanism in battery cells.\n","subjects":["Physics/Chemical Physics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}