{"id":"2408.09980","title":"Tailoring the Spectral and Directional Emissivity of Functionalized\n  Laser Processed Surfaces","authors":"Andrew Butler, Andrew Reicks, Dennis Alexander, George Gogos, Craig A.\n  Zuhlke, and Christos Argyropoulos","authorsParsed":[["Butler","Andrew",""],["Reicks","Andrew",""],["Alexander","Dennis",""],["Gogos","George",""],["Zuhlke","Craig A.",""],["Argyropoulos","Christos",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 13:28:28 GMT"}],"updateDate":"2024-09-10","timestamp":1724074108000,"abstract":"  Development of methods to control the directional and spectral\ncharacteristics of thermal radiation from metallic surfaces is a critical\nfactor enabling many important thermal management applications. In this paper,\nwe study the thermal emission properties of functionalized aluminum surfaces\nproduced through femtosecond laser surface processing (FLSP). These types of\nsurfaces have recently been found to exhibit near-unity broadband\nomnidirectional emissivity. However, their ultrabroadband absorption response\nincludes visible and near-infrared (IR) radiation, in addition to the mid-IR\nrange, which limits their use as daytime passive radiative cooling devices.\nHere, we present ways to solve this problem by demonstrating a new design that\nuses a dielectric Bragg visible light reflector to accurately control the\nthermal emission spectra of the FLSP surface with the goal of achieving high\nperformance daytime radiative cooling operation. In addition, we propose other\ndesigns based on dielectric multilayer structures to further tailor and control\nthe spectra and thermal emission angles of the FLSP surfaces leading to\nnarrowband and broadband directional thermal radiation. The presented photonic\nengineering approach combined with FLSP structures will be beneficial to\nvarious emerging applications, such as radiative cooling, thermal sensing, and\nthermophotovoltaics.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}