{"id":"2408.01065","title":"Computation of $\\gamma$-linear projected barcodes for multiparameter\n  persistence","authors":"Alex Fernandes, Steve Oudot, Francois Petit","authorsParsed":[["Fernandes","Alex",""],["Oudot","Steve",""],["Petit","Francois",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 07:40:14 GMT"}],"updateDate":"2024-08-05","timestamp":1722584414000,"abstract":"  The $\\gamma$-linear projected barcode was recently introduced as an\nalternative to the well-known fibered barcode for multiparameter persistence,\nin which restrictions of the modules to lines are replaced by pushforwards of\nthe modules along linear forms in the polar of some fixed cone $\\gamma$. So\nfar, the computation of the $\\gamma$-linear projected barcode has only been\nstudied in the functional setting, in which persistence modules come from the\npersistent cohomology of $\\mathbb{R}^n$-valued functions. Here we develop a\nmethod that works in the algebraic setting directly, for any multiparameter\npersistence module over $\\mathbb{R}^n$ that is given via a finite free\nresolution. Our approach is similar to that of RIVET: first, it pre-processes\nthe resolution to build an arrangement in the dual of $\\mathbb{R}^n$ and a\nbarcode template in each face of the arrangement; second, given any query\nlinear form $u$ in the polar of $\\gamma$, it locates $u$ within the arrangement\nto produce the corresponding barcode efficiently. While our theoretical\ncomplexity bounds are similar to the ones of RIVET, our arrangement turns out\nto be simpler thanks to the linear structure of the space of linear forms. Our\ntheoretical analysis combines sheaf-theoretic and module-theoretic techniques,\nshowing that multiparameter persistence modules can be converted into a special\ntype of complexes of sheaves on vector spaces called conic-complexes, whose\nderived pushforwards by linear forms have predictable barcodes.\n","subjects":["Mathematics/Algebraic Topology","Computing Research Repository/Computational Geometry"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}