{"id":"2408.17075","title":"A survey on multi-fidelity surrogates for simulators with functional\n  outputs: unified framework and benchmark","authors":"Lucas Brunel, Mathieu Balesdent, Lo\\\"ic Brevault, Rodolphe Le Riche\n  and Bruno Sudret","authorsParsed":[["Brunel","Lucas",""],["Balesdent","Mathieu",""],["Brevault","Loïc",""],["Riche","Rodolphe Le",""],["Sudret","Bruno",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 08:01:58 GMT"}],"updateDate":"2024-09-02","timestamp":1725004918000,"abstract":"  Multi-fidelity surrogate models combining dimensionality reduction and an\nintermediate surrogate in the reduced space allow a cost-effective emulation of\nsimulators with functional outputs. The surrogate is an input-output mapping\nlearned from a limited number of simulator evaluations. This computational\nefficiency makes surrogates commonly used for many-query tasks. Diverse methods\nfor building them have been proposed in the literature, but they have only been\npartially compared.\n  This paper introduces a unified framework encompassing the different\nsurrogate families, followed by a methodological comparison and the exposition\nof practical considerations. More than a dozen of existing multi-fidelity\nsurrogates have been implemented under the unified framework and evaluated on a\nset of benchmark problems. Based on the results, guidelines and recommendations\nare proposed regarding multi-fidelity surrogates with functional outputs.\n  Our study shows that most multi-fidelity surrogates outperform their tested\nsingle-fidelity counterparts under the considered settings. But no particular\nsurrogate is performing better on every test case. Therefore, the selection of\na surrogate should consider the specific properties of the emulated functions,\nin particular the correlation between the low- and high-fidelity simulators,\nthe size of the training set, the local nonlinear variations in the residual\nfields, and the size of the training datasets.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}