{"id":"2408.07762","title":"Particle motion and accretion disk around rotating accelerating black\n  holes","authors":"Amjad Ashoorioon, Mohammad Bagher Jahani Poshteh, Orlando Luongo","authorsParsed":[["Ashoorioon","Amjad",""],["Poshteh","Mohammad Bagher Jahani",""],["Luongo","Orlando",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 18:29:27 GMT"}],"updateDate":"2024-08-16","timestamp":1723660167000,"abstract":"  We investigate the motion of test particles and the properties of accretion\ndisks around rotating, accelerating black hole spacetimes with non-zero\ncosmological constants. To do so, we explore the impact of both rotation and\nacceleration on massive particle dynamics in motion around these\nconfigurations. In this respect, we derive the geodesic equations in the\nPleba{\\'n}ski-Demia{\\'n}ski spacetime and analyse the characteristics of\ncircular orbits, including the innermost and outermost stable circular orbits.\nAccordingly, we find that the acceleration parameter significantly influences\nthe radii and angular momenta of these orbits. Further, we examine the\nprecession of non-circular orbits and find that the precession is in the same\ndirection as the black hole rotation regardless of the direction of the black\nhole spin. We also investigate the thermal spectra of geometrically thin,\noptically thick accretion disks described by the Novikov-Thorne model. We\nconsider both co-rotating and counter-rotating disks and show that the\nradiative flux and luminosity are significantly larger for co-rotating disks.\nWe compare the spectral features and luminosity of accretion disks around\naccelerating black holes with those around non-accelerating Kerr black holes,\nrevealing that acceleration generally reduces the luminosity and flux of\nemitted light. Our results provide insights into the complex interplay between\nblack hole acceleration, rotation, and the surrounding accretion disk dynamics.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}