{"id":"2408.01879","title":"An evidence of pion condensation","authors":"Wei Zhu, Yu-Chen Tang and Lei Feng","authorsParsed":[["Zhu","Wei",""],["Tang","Yu-Chen",""],["Feng","Lei",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 23:14:13 GMT"}],"updateDate":"2024-08-06","timestamp":1722726853000,"abstract":"  Pion condensation is a theoretical prediction, where pions form a special\nstate of matter under certain extreme conditions in heavy ion collisions or\nneutron stars. However, there is currently no solid experimental evidence\nconfirming the existence of pion condensation. We present a near-direct\nevidence for the existence of pion condensation. In actively changing galactic\nprocesses protons can be accelerated to very high energies and collide with the\nmedium (protons or nuclei). The kinetic energy of the protons is mainly used to\nproduce a large number of pions in the central region via gluons. When the\ncollision energy exceeds a certain threshold, the huge amount of soft gluons\ncondensed in protons pour into the central region, the number of pion increases\nabruptly to the saturation limit, and almost all the available collision energy\nis used to make pions, creating a dense, low-temperature pion condensation\nenvironment. Due to energy conservation and relativistic covariance, the gamma\nray spectra produced by condensed pions exhibit recognizable broken power law\nwith the gluon condensation characteristics. We find that they are already\npresent in many recorded gamma ray spectra. Our findings reveal a novel\nmechanism for the generation of pion condensation, which is prevalent in the\nformation of high-energy cosmic rays, and deepen our understanding of related\ntopics in a variety of disciplines, including particle physics, astrophysics,\ncondensed matter physics and nuclear physics.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/High Energy Astrophysical Phenomena","Condensed Matter/Other Condensed Matter","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MjKlCHTrtmQ7_U7qEnrf5Qee5qd_4YV7tQqowBs8xdo","pdfSize":"1601562"}
