{"id":"2408.06516","title":"Quantifying Phase Unbalance and Coordination Impacts on Distribution\n  Network Flexibility","authors":"Andrey Churkin, Wangwei Kong, Pierluigi Mancarella, Eduardo A.\n  Mart\\'inez Cese\\~na","authorsParsed":[["Churkin","Andrey",""],["Kong","Wangwei",""],["Mancarella","Pierluigi",""],["Ceseña","Eduardo A. Martínez",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 22:20:18 GMT"}],"updateDate":"2024-08-14","timestamp":1723501218000,"abstract":"  The increasing integration of distributed energy resources (DER) provides\ndistribution system operators (DSO) with new flexible resources to support more\nefficient operation and planning of distribution networks. To utilise these\nresources, various DER flexibility aggregation methods have been proposed in\nthe literature, such as aggregated P-Q flexibility areas at the interface with\nother networks. However, whereas focusing on estimating the limits of\nflexibility services, existing studies make the critical assumption that all\navailable flexible units are perfectly coordinated to jointly provide\nflexibility and manage network constraints. Moreover, due to the extensive use\nof single-phase power flow analysis, the impacts of phase unbalance on DER\nflexibility aggregation remain largely unexplored. To address these gaps in\nknowledge, this work proposes a framework for modelling flexibility services in\nlow voltage (LV) distribution networks which enables explicitly imposing\nvoltage unbalance and phase coordination constraints. The simulations,\nperformed for an illustrative 5-bus system and a real 221-bus LV network in the\nUK, demonstrate that a significant share (over 30%) of total aggregated DER\nflexibility potential may be unavailable due to voltage unbalances and lack of\ncoordination between DER connected to different phases.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}