{"id":"2408.03070","title":"Probing structural constraints of negation in Pretrained Language Models","authors":"David Kletz (Lattice, LLF - UMR7110, UPCit\\'e), Marie Candito\n  (UPCit\\'e, LLF - UMR7110), Pascal Amsili (Lattice)","authorsParsed":[["Kletz","David","","Lattice, LLF - UMR7110, UPCité"],["Candito","Marie","","UPCité, LLF - UMR7110"],["Amsili","Pascal","","Lattice"]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 09:54:49 GMT"}],"updateDate":"2024-08-07","timestamp":1722938089000,"abstract":"  Contradictory results about the encoding of the semantic impact of negation\nin pretrained language models (PLMs). have been drawn recently (e.g. Kassner\nand Sch{\\\"u}tze (2020); Gubelmann and Handschuh (2022)). In this paper we focus\nrather on the way PLMs encode negation and its formal impact, through the\nphenomenon of the Negative Polarity Item (NPI) licensing in English. More\nprecisely, we use probes to identify which contextual representations best\nencode 1) the presence of negation in a sentence, and 2) the polarity of a\nneighboring masked polarity item. We find that contextual representations of\ntokens inside the negation scope do allow for (i) a better prediction of the\npresence of not compared to those outside the scope and (ii) a better\nprediction of the right polarity of a masked polarity item licensed by not,\nalthough the magnitude of the difference varies from PLM to PLM. Importantly,\nin both cases the trend holds even when controlling for distance to not. This\ntends to indicate that the embeddings of these models do reflect the notion of\nnegation scope, and do encode the impact of negation on NPI licensing. Yet,\nfurther control experiments reveal that the presence of other lexical items is\nalso better captured when using the contextual representation of a token within\nthe same syntactic clause than outside from it, suggesting that PLMs simply\ncapture the more general notion of syntactic clause.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}