{"id":"2408.05044","title":"Infrared Beam-shaping on Demand via Tailored Geometric Phase\n  Metasurfaces employing the Plasmonic Phase-Change Material In3SbTe2","authors":"Lukas Conrads, Florian Bontke, Andreas Mathwieser, Paul Buske,\n  Matthias Wuttig, Robert Schmitt, Carlo Holly, Thomas Taubner","authorsParsed":[["Conrads","Lukas",""],["Bontke","Florian",""],["Mathwieser","Andreas",""],["Buske","Paul",""],["Wuttig","Matthias",""],["Schmitt","Robert",""],["Holly","Carlo",""],["Taubner","Thomas",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 12:58:07 GMT"}],"updateDate":"2024-08-12","timestamp":1723208287000,"abstract":"  Conventional optical elements are bulky and limited to specific\nfunctionalities, contradicting the increasing demand of miniaturization and\nmulti-functionalities. Optical metasurfaces enable tailoring light-matter\ninteraction at will, especially important for the infrared spectral range which\nlacks commercially available beam-shaping elements. While the fabrication of\nthose metasurfaces usually requires cumbersome techniques, direct laser writing\npromises a simple and convenient alternative. Here, we exploit the non-volatile\nlaser-induced insulator-to-metal transition of the plasmonic phase-change\nmaterial In3SbTe2 (IST) for optical programming of large-area metasurfaces for\ninfrared beam-shaping. We tailor the geometric phase of metasurfaces with\nrotated crystalline IST rod antennas to achieve beam steering, lensing, and\nbeams carrying orbital angular momenta. Finally, we investigate\nmulti-functional and cascaded metasurfaces exploiting enlarged holography, and\ndesign a single metasurface creating two different holograms along the optical\naxis. Our approach facilitates fabrication of large-area metasurfaces within\nhours, enabling rapid-prototyping of customized infrared meta-optics for\nsensing, imaging and quantum information.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}