{"id":"2408.15251","title":"TrajFM: A Vehicle Trajectory Foundation Model for Region and Task\n  Transferability","authors":"Yan Lin, Tonglong Wei, Zeyu Zhou, Haomin Wen, Jilin Hu, Shengnan Guo,\n  Youfang Lin, Huaiyu Wan","authorsParsed":[["Lin","Yan",""],["Wei","Tonglong",""],["Zhou","Zeyu",""],["Wen","Haomin",""],["Hu","Jilin",""],["Guo","Shengnan",""],["Lin","Youfang",""],["Wan","Huaiyu",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 07:40:44 GMT"}],"updateDate":"2024-08-29","timestamp":1723189244000,"abstract":"  Vehicle trajectories provide valuable movement information that supports\nvarious downstream tasks and powers real-world applications. A desirable\ntrajectory learning model should transfer between different regions and tasks\nwithout retraining, thus improving computational efficiency and effectiveness\nwith limited training data. However, a model's ability to transfer across\nregions is limited by the unique spatial features and POI arrangements of each\nregion, which are closely linked to vehicle movement patterns and difficult to\ngeneralize. Additionally, achieving task transferability is challenging due to\nthe differing generation schemes required for various tasks. Existing efforts\ntowards transferability primarily involve learning embedding vectors for\ntrajectories, which perform poorly in region transfer and still require\nretraining of prediction modules for task transfer.\n  To address these challenges, we propose TrajFM, a vehicle trajectory\nfoundation model that excels in both region and task transferability. For\nregion transferability, we introduce STRFormer as the main learnable model\nwithin TrajFM. It integrates spatial, temporal, and POI modalities of\ntrajectories to effectively manage variations in POI arrangements across\nregions and includes a learnable spatio-temporal Rotary position embedding\nmodule for handling spatial features. For task transferability, we propose a\ntrajectory masking and recovery scheme. This scheme unifies the generation\nprocesses of various tasks into the masking and recovery of modalities and\nsub-trajectories, allowing TrajFM to be pre-trained once and transferred to\ndifferent tasks without retraining. Experiments on two real-world vehicle\ntrajectory datasets under various settings demonstrate the effectiveness of\nTrajFM. Code is available at https://anonymous.4open.science/r/TrajFM-30E4.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}