{"id":"2408.11600","title":"A Novel $\\delta$-SBM-OPA Approach for Policy-Driven Analysis of Carbon\n  Emission Efficiency under Uncertainty in the Chinese Industrial Sector","authors":"Shutian Cui, Renlong Wang, Xiaoyan Li","authorsParsed":[["Cui","Shutian",""],["Wang","Renlong",""],["Li","Xiaoyan",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 13:13:27 GMT"}],"updateDate":"2024-08-22","timestamp":1724246007000,"abstract":"  Regional differences in carbon emission efficiency arise from disparities in\nresource distribution, industrial structure, and development level, which are\noften influenced by government policy preferences. However, currently, most\nstudies fail to consider the impact of government policy preferences and data\nuncertainty on carbon emission efficiency. To address the above limitations,\nthis study proposes a hybrid model based on $\\delta$-slack-based model\n($\\delta$-SBM) and ordinal priority approach (OPA) for measuring carbon\nemission efficiency driven by government policy preferences under data\nuncertainty. The proposed $\\delta$-SBM-OPA model incorporates constraints on\nthe importance of input and output variables under different policy preference\nscenarios. It then develops the efficiency optimization model with Farrell\nfrontiers and efficiency tapes to deal with the data uncertainty in input and\noutput variables. This study demonstrates the proposed model by analyzing\nindustrial carbon emission efficiency of Chinese provinces in 2021. It examines\nthe carbon emission efficiency and corresponding clustering results of\nprovinces under three types of policies: economic priority, environmental\npriority, and technological priority, with varying priority preferences. The\nresults indicate that the carbon emission efficiency of the 30 provinces can\nmainly be categorized into technology-driven, development-balanced, and\ntransition-potential types, with most provinces achieving optimal efficiency\nunder the technology-dominant preferences across all policy scenarios.\nUltimately, this study suggests a tailored roadmap and crucial initiatives for\ndifferent provinces to progressively and systematically work towards achieving\nthe low carbon goal.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}