{"id":"2408.14491","title":"Multimodal Methods for Analyzing Learning and Training Environments: A\n  Systematic Literature Review","authors":"Clayton Cohn, Eduardo Davalos, Caleb Vatral, Joyce Horn Fonteles,\n  Hanchen David Wang, Meiyi Ma, Gautam Biswas","authorsParsed":[["Cohn","Clayton",""],["Davalos","Eduardo",""],["Vatral","Caleb",""],["Fonteles","Joyce Horn",""],["Wang","Hanchen David",""],["Ma","Meiyi",""],["Biswas","Gautam",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 22:42:23 GMT"}],"updateDate":"2024-08-28","timestamp":1724366543000,"abstract":"  Recent technological advancements have enhanced our ability to collect and\nanalyze rich multimodal data (e.g., speech, video, and eye gaze) to better\ninform learning and training experiences. While previous reviews have focused\non parts of the multimodal pipeline (e.g., conceptual models and data fusion),\na comprehensive literature review on the methods informing multimodal learning\nand training environments has not been conducted. This literature review\nprovides an in-depth analysis of research methods in these environments,\nproposing a taxonomy and framework that encapsulates recent methodological\nadvances in this field and characterizes the multimodal domain in terms of five\nmodality groups: Natural Language, Video, Sensors, Human-Centered, and\nEnvironment Logs. We introduce a novel data fusion category -- mid fusion --\nand a graph-based technique for refining literature reviews, termed citation\ngraph pruning. Our analysis reveals that leveraging multiple modalities offers\na more holistic understanding of the behaviors and outcomes of learners and\ntrainees. Even when multimodality does not enhance predictive accuracy, it\noften uncovers patterns that contextualize and elucidate unimodal data,\nrevealing subtleties that a single modality may miss. However, there remains a\nneed for further research to bridge the divide between multimodal learning and\ntraining studies and foundational AI research.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}