{"id":"2408.00160","title":"Hierarchical Conditioning of Diffusion Models Using Tree-of-Life for\n  Studying Species Evolution","authors":"Mridul Khurana, Arka Daw, M. Maruf, Josef C. Uyeda, Wasila Dahdul,\n  Caleb Charpentier, Yasin Bak{\\i}\\c{s}, Henry L. Bart Jr., Paula M. Mabee,\n  Hilmar Lapp, James P. Balhoff, Wei-Lun Chao, Charles Stewart, Tanya\n  Berger-Wolf, Anuj Karpatne","authorsParsed":[["Khurana","Mridul",""],["Daw","Arka",""],["Maruf","M.",""],["Uyeda","Josef C.",""],["Dahdul","Wasila",""],["Charpentier","Caleb",""],["Bakış","Yasin",""],["Bart","Henry L.","Jr."],["Mabee","Paula M.",""],["Lapp","Hilmar",""],["Balhoff","James P.",""],["Chao","Wei-Lun",""],["Stewart","Charles",""],["Berger-Wolf","Tanya",""],["Karpatne","Anuj",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 21:06:14 GMT"}],"updateDate":"2024-08-02","timestamp":1722459974000,"abstract":"  A central problem in biology is to understand how organisms evolve and adapt\nto their environment by acquiring variations in the observable characteristics\nor traits of species across the tree of life. With the growing availability of\nlarge-scale image repositories in biology and recent advances in generative\nmodeling, there is an opportunity to accelerate the discovery of evolutionary\ntraits automatically from images. Toward this goal, we introduce\nPhylo-Diffusion, a novel framework for conditioning diffusion models with\nphylogenetic knowledge represented in the form of HIERarchical Embeddings\n(HIER-Embeds). We also propose two new experiments for perturbing the embedding\nspace of Phylo-Diffusion: trait masking and trait swapping, inspired by\ncounterpart experiments of gene knockout and gene editing/swapping. Our work\nrepresents a novel methodological advance in generative modeling to structure\nthe embedding space of diffusion models using tree-based knowledge. Our work\nalso opens a new chapter of research in evolutionary biology by using\ngenerative models to visualize evolutionary changes directly from images. We\nempirically demonstrate the usefulness of Phylo-Diffusion in capturing\nmeaningful trait variations for fishes and birds, revealing novel insights\nabout the biological mechanisms of their evolution.\n","subjects":["Quantitative Biology/Populations and Evolution","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"iGdA1BkZtlL_-QwSasoTuKdMIqcybqBpV86kNXyxre4","pdfSize":"14246263"}
