{"id":"2408.07601","title":"Microgrid Building Blocks for Dynamic Decoupling and Black Start\n  Applications","authors":"Samrat Acharya, Priya Mana, Hisham Mahmood, Francis Tuffner, and Alok\n  Kumar Bharati","authorsParsed":[["Acharya","Samrat",""],["Mana","Priya",""],["Mahmood","Hisham",""],["Tuffner","Francis",""],["Bharati","Alok Kumar",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 15:06:23 GMT"}],"updateDate":"2024-08-15","timestamp":1723647983000,"abstract":"  Microgrids offer increased self-reliance and resilience at the grid's edge.\nThey promote a significant transition to decentralized and renewable energy\nproduction by optimizing the utilization of local renewable sources. However,\nto maintain stable operations under all conditions and harness microgrids' full\neconomic and technological potential, it is essential to integrate with the\nbulk grid and neighboring microgrids seamlessly. In this paper, we explore the\ncapabilities of Back-to-Back (BTB) converters as a pivotal technology for\ninterfacing microgrids, hybrid AC/DC grids, and bulk grids, by leveraging a\ncomprehensive phasor-domain model integrated into GridLAB-D. The phasor-domain\nmodel is computationally efficient for simulating BTB with bulk grids and\nnetworked microgrids. We showcase the versatility of BTB converters (an\nintegrated Microgrid Building Block) by configuring a two-microgrid network\nfrom a modified IEEE 13-node distribution system. These microgrids are equipped\nwith diesel generators, photovoltaic units, and Battery Energy Storage Systems\n(BESS). The simulation studies are focused on use cases demonstrating dynamic\ndecoupling and controlled support that a microgrid can provide via a BTB\nconverter.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oXF_7ek7DtVyQKsxeEShC1aeKcKIdFfo-ziO-0v6gq4","pdfSize":"599830"}
