{"id":"2408.01159","title":"Robust Curve Detection in Volumetric Medical Imaging via Attraction\n  Field","authors":"Farukh Yaushev, Daria Nogina, Valentin Samokhin, Mariya Dugova,\n  Ekaterina Petrash, Dmitry Sevryukov, Mikhail Belyaev and Maxim Pisov","authorsParsed":[["Yaushev","Farukh",""],["Nogina","Daria",""],["Samokhin","Valentin",""],["Dugova","Mariya",""],["Petrash","Ekaterina",""],["Sevryukov","Dmitry",""],["Belyaev","Mikhail",""],["Pisov","Maxim",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 10:21:10 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 17:24:25 GMT"}],"updateDate":"2024-08-15","timestamp":1722594070000,"abstract":"  Understanding body part geometry is crucial for precise medical diagnostics.\nCurves effectively describe anatomical structures and are widely used in\nmedical imaging applications related to cardiovascular, respiratory, and\nskeletal diseases. Traditional curve detection methods are often task-specific,\nrelying heavily on domain-specific features, limiting their broader\napplicability. This paper introduces a novel approach for detecting\nnon-branching curves, which does not require prior knowledge of the object's\norientation, shape, or position. Our method uses neural networks to predict (1)\nan attraction field, which offers subpixel accuracy, and (2) a closeness map,\nwhich limits the region of interest and essentially eliminates outliers far\nfrom the desired curve. We tested our curve detector on several clinically\nrelevant tasks with diverse morphologies and achieved impressive subpixel-level\naccuracy results that surpass existing methods, highlighting its versatility\nand robustness. Additionally, to support further advancements in this field, we\nprovide our private annotations of aortic centerlines and masks, which can\nserve as a benchmark for future research. The dataset can be found at\nhttps://github.com/neuro-ml/curve-detection.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"JVEKwN8O_S5K8r3X-3u8cPEsKiXFN-ryB3efI7clVWk","pdfSize":"5370790","txDigest":"4EMEkqw3FUftdFeGASnoyiFa8CrSzkZtX8XwUqwEn3Cp","endEpoch":"1","status":"CERTIFIED"}
