{"id":"2408.13503","title":"Exploring the nature of an ultraluminous X-ray source in NGC 628","authors":"Hasan Avdan and Senay Avdan","authorsParsed":[["Avdan","Hasan",""],["Avdan","Senay",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 07:09:58 GMT"}],"updateDate":"2024-08-27","timestamp":1724483398000,"abstract":"  In this work, we study the X-ray spectral and temporal properties of an\nultraluminous X-ray source (ULX) in NGC 628 by using multi-epoch archival X-ray\ndata. The physical parameters were estimated in each epoch in order to\nconstrain the nature of the compact object in the system. Also, the optical\ncounterpart candidates of the ULX were examined using the archival {\\it Hubble}\nSpace Telescope (HST)/Wide Field Camera 3 (WFC3) data. {\\it XMM-Newton}, {\\it\nChandra}, and {\\it Swift} data were used to create the long-term light curve\n(which covers a period of 22 years) and perform the spectral analysis.\nLomb-Scargle periodograms of the source were constructed to examine the\nshort-term variability in each epoch. In order to search for an optical\ncounterpart in the HST/WFC3 images, a relative astrometric correction was\ninitially applied to the {\\it Chandra} and HST/WFC3 images. The X-ray flux of\nthe source changes by a factor of $\\sim 200$ throughout the observations. The\npreviously detected quasi-periodic signal (in the range of 0.1$-$0.4 mHz) was\nconfirmed by using the Lomb-Scargle method. After astrometric correction, two\noptical counterpart candidates were detected for the source. The obtained\nspectral energy distributions in the optical band for both candidates indicate\nthat the optical emission is dominated by the irradiation of the accretion\ndisc. Considering the best-fit model parameters of the multi-colour disc\nblack-body model, we derived the mass of the black hole in the system as being\nin the range of (3$-$16) $M_{\\odot}$. Nonetheless, the long-term variability\nand the spectral transitions in the hardness-luminosity diagram make it\ndifficult to rule out the neutron star scenario.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}