{"id":"2408.02066","title":"PromptSAM+: Malware Detection based on Prompt Segment Anything Model","authors":"Xingyuan Wei, Yichen Liu, Ce Li, Ning Li, Degang Sun, Yan Wang","authorsParsed":[["Wei","Xingyuan",""],["Liu","Yichen",""],["Li","Ce",""],["Li","Ning",""],["Sun","Degang",""],["Wang","Yan",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 15:42:34 GMT"}],"updateDate":"2024-08-06","timestamp":1722786154000,"abstract":"  Machine learning and deep learning (ML/DL) have been extensively applied in\nmalware detection, and some existing methods demonstrate robust performance.\nHowever, several issues persist in the field of malware detection: (1) Existing\nwork often overemphasizes accuracy at the expense of practicality, rarely\nconsidering false positive and false negative rates as important metrics. (2)\nConsidering the evolution of malware, the performance of classifiers\nsignificantly declines over time, greatly reducing the practicality of malware\ndetectors. (3) Prior ML/DL-based efforts heavily rely on ample labeled data for\nmodel training, largely dependent on feature engineering or domain knowledge to\nbuild feature databases, making them vulnerable if correct labels are scarce.\nWith the development of computer vision, vision-based malware detection\ntechnology has also rapidly evolved. In this paper, we propose a visual malware\ngeneral enhancement classification framework, `PromptSAM+', based on a large\nvisual network segmentation model, the Prompt Segment Anything Model(named\nPromptSAM+). Our experimental results indicate that 'PromptSAM+' is effective\nand efficient in malware detection and classification, achieving high accuracy\nand low rates of false positives and negatives. The proposed method outperforms\nthe most advanced image-based malware detection technologies on several\ndatasets. 'PromptSAM+' can mitigate aging in existing image-based malware\nclassifiers, reducing the considerable manpower needed for labeling new malware\nsamples through active learning. We conducted experiments on datasets for both\nWindows and Android platforms, achieving favorable outcomes. Additionally, our\nablation experiments on several datasets demonstrate that our model identifies\neffective modules within the large visual network.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}