{"id":"2408.08890","title":"Pedestrian Safety and Traffic Operations Around Near-Side Versus\n  Far-Side Transit Stops: Emerging Observational Evidence from Utah","authors":"Fariba Soltani Mandolakani and Atul Subedi and Patrick A. Singleton\n  and Michelle Mekker","authorsParsed":[["Mandolakani","Fariba Soltani",""],["Subedi","Atul",""],["Singleton","Patrick A.",""],["Mekker","Michelle",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 15:28:56 GMT"}],"updateDate":"2024-08-20","timestamp":1723044536000,"abstract":"  This research project's objective was to investigate the impacts of transit\nstop location (near-side versus far-side) on pedestrian safety and traffic\noperations. Three different video-based behavioral observation data collections\nat signalized intersections in Utah were utilized, studying: (1) transit\nvehicle stop events and transit rider crossing behaviors and vehicle conflicts;\n(2) pedestrian conflicts with right-turning vehicles (driver/pedestrian\nreactions, conflict severity); and (3) pedestrian crossing behaviors (crossing\nlocation, crossing behaviors). These outcomes were statistically compared for\nnear-side versus far-side transit stop locations. Far-side transit stops appear\nbetter for general traffic operations. Although transit departure delays are\nmore likely and impactful at far-side stops, actions can be taken to improve\ntransit operations there. On the other hand, far-side transit stops appear to\nbe worse for pedestrian safety, corroborating prior crash-based research\nfindings. Specifically, conflicts at far-side stops were more severe, and\ndrivers were less likely to slow or stop for pedestrians. Reconciling these\ndiffering findings likely requires improving pedestrian safety at some far-side\ntransit stops, and prioritizing safety over operational efficiency at other\nnear-side transit stops.\n","subjects":["Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6YcPAT_piX1fhqhSWRyz3v_bNAbvy9fSfcEyl2RSIik","pdfSize":"581864"}
