{"id":"2408.05649","title":"Advancing Pavement Distress Detection in Developing Countries: A Novel\n  Deep Learning Approach with Locally-Collected Datasets","authors":"Blessing Agyei Kyem, Eugene Kofi Okrah Denteh, Joshua Kofi Asamoah,\n  Kenneth Adomako Tutu, Armstrong Aboah","authorsParsed":[["Kyem","Blessing Agyei",""],["Denteh","Eugene Kofi Okrah",""],["Asamoah","Joshua Kofi",""],["Tutu","Kenneth Adomako",""],["Aboah","Armstrong",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 23:20:36 GMT"}],"updateDate":"2024-08-13","timestamp":1723332036000,"abstract":"  Road infrastructure maintenance in developing countries faces unique\nchallenges due to resource constraints and diverse environmental factors. This\nstudy addresses the critical need for efficient, accurate, and locally-relevant\npavement distress detection methods in these regions. We present a novel deep\nlearning approach combining YOLO (You Only Look Once) object detection models\nwith a Convolutional Block Attention Module (CBAM) to simultaneously detect and\nclassify multiple pavement distress types. The model demonstrates robust\nperformance in detecting and classifying potholes, longitudinal cracks,\nalligator cracks, and raveling, with confidence scores ranging from 0.46 to\n0.93. While some misclassifications occur in complex scenarios, these provide\ninsights into unique challenges of pavement assessment in developing countries.\nAdditionally, we developed a web-based application for real-time distress\ndetection from images and videos. This research advances automated pavement\ndistress detection and provides a tailored solution for developing countries,\npotentially improving road safety, optimizing maintenance strategies, and\ncontributing to sustainable transportation infrastructure development.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cXhOe3Tn7qpu7rY2I92s2eHU3uPkU04IG3PpPPKFcBE","pdfSize":"2017852"}
