{"id":"2408.06667","title":"Joint Source-Channel Optimization for UAV Video Coding and Transmission","authors":"Kesong Wu, Xianbin Cao, Peng Yang, Haijun Zhang, Tony Q. S. Quek, and\n  Dapeng Oliver Wu","authorsParsed":[["Wu","Kesong",""],["Cao","Xianbin",""],["Yang","Peng",""],["Zhang","Haijun",""],["Quek","Tony Q. S.",""],["Wu","Dapeng Oliver",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 06:38:45 GMT"},{"version":"v2","created":"Mon, 19 Aug 2024 09:10:22 GMT"}],"updateDate":"2024-08-20","timestamp":1723531125000,"abstract":"  This paper is concerned with unmanned aerial vehicle (UAV) video coding and\ntransmission in scenarios such as emergency rescue and environmental\nmonitoring. Unlike existing methods of modeling UAV video source coding and\nchannel transmission separately, we investigate the joint source-channel\noptimization issue for video coding and transmission. Particularly, we design\neight-dimensional delay-power-rate-distortion models in terms of source coding\nand channel transmission and characterize the correlation between video coding\nand transmission, with which a joint source-channel optimization problem is\nformulated. Its objective is to minimize end-to-end distortion and UAV power\nconsumption by optimizing fine-grained parameters related to UAV video coding\nand transmission. This problem is confirmed to be a challenging\nsequential-decision and non-convex optimization problem. We therefore decompose\nit into a family of repeated optimization problems by Lyapunov optimization and\ndesign an approximate convex optimization scheme with provable performance\nguarantees to tackle these problems. Based on the theoretical transformation,\nwe propose a Lyapunov repeated iteration (LyaRI) algorithm. Both objective and\nsubjective experiments are conducted to comprehensively evaluate the\nperformance of LyaRI. The results indicate that, compared to its counterparts,\nLyaRI achieves better video quality and stability performance, with a 47.74%\nreduction in the variance of the obtained encoding bitrate.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}