{"id":"2408.09041","title":"Strain stiffening due to stretching of entangled particles in random\n  packings of granular materials","authors":"Eric Brown, Kevin A. Mitchell, Alice Nasto, Athanasios Athanassiadis,\n  and Heinrich M. Jaeger","authorsParsed":[["Brown","Eric",""],["Mitchell","Kevin A.",""],["Nasto","Alice",""],["Athanassiadis","Athanasios",""],["Jaeger","Heinrich M.",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 22:41:15 GMT"}],"updateDate":"2024-08-20","timestamp":1723848075000,"abstract":"  Stress-strain relations for random packings of entangling chains under\ntriaxial compression can exhibit strain stiffening and sustain stresses several\norders-of-magnitude beyond typical granular materials. X-ray tomography reveals\nthe transition to this strong strain stiffening occurs when chains are long\nenough to entangle an average of about one chain each, which results in\nsystem-filling clusters of entangled chains. The number of entanglements is\nnearly proportional to the area surrounded by entangling particles with an\nexcluded volume effect. A tendency was found for chain links to stretch when\nthe packing was strained. The slope of the stress-strain relation of the\npacking can be calculated from a mean-field model consisting of the product of\nthe effective extensional modulus of the chain, packing fraction, probability\nof stretched links, and the ratio of strain of stretched links to packing\nstrain. The stress-strain model requires as input measurements of the ratio\nbetween local particle deformation and global average strain, and the\nprobability of stretching for non-rigid particles. This results in a quadratic\nprediction for the stress-strain curve, with a curvature that agrees with\nexperiments within the model uncertainties. This model explains that the\nstrength of these packings comes from stretching of the links of chains, but\nonly when the system-filling network of entanglements provides constraints that\nprevents failure by shear banding, so that particles must be deformed to move\nfurther under strain. In this model, the increasing slope of the stress-strain\ncurve is mainly due to the fraction of stretched links increasing with strain.\nThis model for the stress-strain relation is shown to be generalizable to\ndifferent shapes of entangling particles by applying it to staples.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}