{"id":"2408.15098","title":"CLIP-AGIQA: Boosting the Performance of AI-Generated Image Quality\n  Assessment with CLIP","authors":"Zhenchen Tang, Zichuan Wang, Bo Peng, and Jing Dong","authorsParsed":[["Tang","Zhenchen",""],["Wang","Zichuan",""],["Peng","Bo",""],["Dong","Jing",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 14:30:36 GMT"},{"version":"v2","created":"Thu, 19 Sep 2024 09:55:39 GMT"}],"updateDate":"2024-09-20","timestamp":1724769036000,"abstract":"  With the rapid development of generative technologies, AI-Generated Images\n(AIGIs) have been widely applied in various aspects of daily life. However, due\nto the immaturity of the technology, the quality of the generated images\nvaries, so it is important to develop quality assessment techniques for the\ngenerated images. Although some models have been proposed to assess the quality\nof generated images, they are inadequate when faced with the ever-increasing\nand diverse categories of generated images. Consequently, the development of\nmore advanced and effective models for evaluating the quality of generated\nimages is urgently needed. Recent research has explored the significant\npotential of the visual language model CLIP in image quality assessment,\nfinding that it performs well in evaluating the quality of natural images.\nHowever, its application to generated images has not been thoroughly\ninvestigated. In this paper, we build on this idea and further explore the\npotential of CLIP in evaluating the quality of generated images. We design\nCLIP-AGIQA, a CLIP-based regression model for quality assessment of generated\nimages, leveraging rich visual and textual knowledge encapsulated in CLIP.\nParticularly, we implement multi-category learnable prompts to fully utilize\nthe textual knowledge in CLIP for quality assessment. Extensive experiments on\nseveral generated image quality assessment benchmarks, including AGIQA-3K and\nAIGCIQA2023, demonstrate that CLIP-AGIQA outperforms existing IQA models,\nachieving excellent results in evaluating the quality of generated images.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}