{"id":"2408.15181","title":"On the parameterized complexity of computing good edge-labelings","authors":"Davi de Andrade, J\\'ulio Ara\\'ujo, Laure Morelle, Ignasi Sau, Ana\n  Silva","authorsParsed":[["de Andrade","Davi",""],["Araújo","Júlio",""],["Morelle","Laure",""],["Sau","Ignasi",""],["Silva","Ana",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 16:33:37 GMT"}],"updateDate":"2024-08-28","timestamp":1724776417000,"abstract":"  A good edge-labeling (gel for short) of a graph $G$ is a function $\\lambda:\nE(G) \\to \\mathbb{R}$ such that, for any ordered pair of vertices $(x, y)$ of\n$G$, there do not exist two distinct increasing paths from $x$ to $y$, where\n``increasing'' means that the sequence of labels is non-decreasing. This notion\nwas introduced by Bermond et al. [Theor. Comput. Sci. 2013] motivated by\npractical applications arising from routing and wavelength assignment problems\nin optical networks. Prompted by the lack of algorithmic results about the\nproblem of deciding whether an input graph admits a gel, called GEL, we\ninitiate its study from the viewpoint of parameterized complexity. We first\nintroduce the natural version of GEL where one wants to use at most $c$\ndistinct labels, which we call $c$-GEL, and we prove that it is NP-complete for\nevery $c \\geq 2$ on very restricted instances. We then provide several positive\nresults, starting with simple polynomial kernels for GEL and $c$-\\GEL\nparameterized by neighborhood diversity or vertex cover. As one of our main\ntechnical contributions, we present an FPT algorithm for GEL parameterized by\nthe size of a modulator to a forest of stars, based on a novel approach via a\n2-SAT formulation which we believe to be of independent interest. We also\npresent FPT algorithms based on dynamic programming for $c$-GEL parameterized\nby treewidth and $c$, and for GEL parameterized by treewidth and the maximum\ndegree. Finally, we answer positively a question of Bermond et al. [Theor.\nComput. Sci. 2013] by proving the NP-completeness of a problem strongly related\nto GEL, namely that of deciding whether an input graph admits a so-called\nUPP-orientation.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Computational Complexity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}