{"id":"2408.11090","title":"High detection significance of the dark substructure in gravitational\n  lens SDSSJ0946+1006 is revealed by image pixel supersampling","authors":"Quinn E. Minor","authorsParsed":[["Minor","Quinn E.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-22","timestamp":1724176801000,"abstract":"  Recent studies have shown that the dark substructure reported in the\ngravitational lens SDSSJ0946+1006 has a high central density which is in\napparent tension with the $\\Lambda$CDM paradigm. However, the detection\nsignificance of the substructure has been found in Ballard et al. (2024) to be\nsensitive to the assumed prior on the smoothness of the source galaxy: a\nsufficiently noisy source allows for noise-level residuals even without\nincluding a subhalo in the model. Here we show that the detection significance\nof the substructure is higher than previously reported ($\\Delta\\ln Z \\approx\n143$, equivalent to a $\\sim17\\sigma$ detection) by approximating the\nintegration of light over each pixel via ray tracing and averaging over many\nsubpixels--a technique known as supersampling--and this result is insensitive\nto the assumed prior on the source galaxy smoothness. Assuming a dark matter\nsubhalo, supersampling also tightens the subhalo constraints: we find that the\nsubhalo's projected mass enclosed within 1 kpc lies within the range\n$(2.2-3.4)\\times10^9M_\\odot$ at the 95\\% confidence level in our highest\nevidence model, while the log-slope of the subhalo's projected density profile\nat 1 kpc is steeper than $-1.75$ at the 95\\% confidence level, further\nestablishing it as an outlier compared to expectations from CDM. Supersampling\nalso allows us to identify a systematic within the data that has biased the\nslope of the primary lensing galaxy's density profile in prior studies, which\nwe speculate might be due to the presence of dust or an imperfect foreground\nsubtraction. Our analysis places the existence of the substructure in\nSDSSJ0946+1006 on firmer ground, and should motivate deeper follow-up\nobservations to better constrain the properties of this substructure and\nclarify the severity of its apparent tension with $\\Lambda$CDM.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}