{"id":"2408.00126","title":"Characterization of the $\\delta$ Scuti eclipsing binary KIC 4851217 and\n  its tertiary companion as well as detection of tidally tilted pulsations","authors":"Z. Jennings, J. Southworth, S. A. Rappaport, T. Borkovits, G. Handler,\n  D. W. Kurtz","authorsParsed":[["Jennings","Z.",""],["Southworth","J.",""],["Rappaport","S. A.",""],["Borkovits","T.",""],["Handler","G.",""],["Kurtz","D. W.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 19:29:16 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 15:42:44 GMT"}],"updateDate":"2024-08-07","timestamp":1722454156000,"abstract":"  Stellar theory enables us to understand the properties of stars at different\nstages of their evolution, and contributes to other fields of astrophysics such\nas galactic and exoplanet studies. Assessing the accuracy of stellar theories\nnecessitates high precision, model-independent measurements of the properties\nof real stars, such as those obtainable for the components of double lined\neclipsing binaries (DLEBs), while asteroseismology offers probing power of the\nstellar interior if one or both components pulsate. KIC 4851217 is a DLEB\ncontaining two late A-type stars and exhibits pulsations of the $\\delta$ Scuti\ntype. By analysing high resolution HERMES and moderate resolution ISIS spectra,\njointly with Kepler and TESS light curves, we measured the masses, radii and\neffective temperatures of the components to precisions of ~0.5, ~1.1 and ~1 per\ncent, respectively. We additionally report the discovery and characterisation\nof a tertiary M-dwarf companion. Models of the system's spectral energy\ndistribution agree with an age of 0.82 Gyr, with the more massive and larger\nsecondary component near the end of the main sequence lifetime. An examination\nof the pulsating component's pulsation frequencies reveals 39 pulsation\nmultiplets that are split by the orbital frequency. For most of these, it is\nevident that the pulsation axes have been tilted into the orbital plane. This\nmakes KIC 4851217 a tidally tilted pulsator (TTP). This precisely characterized\n$\\delta$ Scuti DLEB is an ideal candidate for advancing intermediate-mass\nstellar theory, contributing to our understanding of hierarchichal systems as\nwell as to the topic of TTPs.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}