{"id":"2408.07926","title":"Enhanced Equivalent Circuit Model for High Current Discharge of\n  Lithium-Ion Batteries with Application to Electric Vertical Takeoff and\n  Landing Aircraft","authors":"Alireza Goshtasbi, Ruxiu Zhao, Ruiting Wang, Sangwoo Han, Wenting Ma,\n  Jeremy Neubauer","authorsParsed":[["Goshtasbi","Alireza",""],["Zhao","Ruxiu",""],["Wang","Ruiting",""],["Han","Sangwoo",""],["Ma","Wenting",""],["Neubauer","Jeremy",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 04:39:43 GMT"}],"updateDate":"2024-08-16","timestamp":1723696783000,"abstract":"  Conventional battery equivalent circuit models (ECMs) have limited capability\nto predict performance at high discharge rates, where lithium depleted regions\nmay develop and cause a sudden exponential drop in the cell's terminal voltage.\nHaving accurate predictions of performance under such conditions is necessary\nfor electric vertical takeoff and landing (eVTOL) aircraft applications, where\nhigh discharge currents can be required during fault scenarios and the\ninability to provide these currents can be safety-critical. To address this\nchallenge, we utilize data-driven modeling methods to derive a parsimonious\naddition to a conventional ECM that can capture the observed rapid voltage drop\nwith only one additional state. We also provide a detailed method for\nidentifying the resulting model parameters, including an extensive\ncharacterization data set along with a well-regularized objective function\nformulation. The model is validated against a novel data set of over 150\nflights encompassing a wide array of conditions for an eVTOL aircraft using an\napplication-specific and safety-relevant reserve duration metric for\nquantifying accuracy. The model is shown to predict the landing hover\ncapability with an error mean and standard deviation of 2.9 and 6.2 seconds,\nrespectively, defining the model's ability to capture the cell voltage behavior\nunder high discharge currents.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}