{"id":"2408.10307","title":"The streaming model for the three-point correlation function and its\n  connection to standard perturbation theory","authors":"Anna Pugno, Alexander Eggemeier, Cristiano Porciani and Joseph\n  Kuruvilla","authorsParsed":[["Pugno","Anna",""],["Eggemeier","Alexander",""],["Porciani","Cristiano",""],["Kuruvilla","Joseph",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-21","timestamp":1724090401000,"abstract":"  Redshift-space distortions present a significant challenge in building models\nfor the three-point correlation function (3PCF). We compare two possible lines\nof attack: the streaming model and standard perturbation theory (SPT). The two\napproaches differ in their treatment of the non-linear mapping from real to\nredshift space: SPT expands this mapping perturbatively, while the streaming\nmodel retains its non-linear form but relies on simplifying assumptions about\nthe probability density function (PDF) of line-of-sight velocity differences\nbetween pairs or triplets of tracers. To assess the quality of the predictions\nand the validity of the assumptions of these models, we measure the monopole of\nthe matter 3PCF and the first two moments of the pair- and triplewise velocity\nPDF from a suite of N-body simulations. We also evaluate the large-scale limit\nof the streaming model and determine under which conditions it aligns to SPT.\nOn scales $>10\\,h^{-1}\\mathrm{Mpc}$, we find that the streaming model for the\n3PCF monopole is dominated by the first two velocity moments, making the exact\nshape of the PDF irrelevant. This model can match the accuracy of a Stage-IV\ngalaxy survey, if the velocity moments are measured directly from the\nsimulations. However, replacing the measurements with perturbative expressions\nto leading order generates large errors already on scales of $60-70\nh^{-1}\\mathrm{Mpc}$. This is the main drawback of the streaming model.\nConversely, the SPT model for the 3PCF cannot account for the significant\nvelocity dispersion that is present at all scales, and consequently provides\npredictions with limited accuracy. We demonstrate that this issue can be\naddressed by isolating the large-scale limit of the dispersion, which leads to\ntypical Fingers-of-God damping functions. Overall, the SPT model with a damping\nfunction provides the best deal in terms of accuracy and computing time.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}