{"id":"2408.02372","title":"Strip-Loaded Nanophotonic Interfaces for Resonant Coupling and\n  Single-Photon Routing","authors":"Katharine Snow, Fatemeh Moradiani, and Hamidreza Siampour","authorsParsed":[["Snow","Katharine",""],["Moradiani","Fatemeh",""],["Siampour","Hamidreza",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 10:53:20 GMT"}],"updateDate":"2024-08-06","timestamp":1722855200000,"abstract":"  We report on the design and simulation of strip-loaded nanophotonic\ninterfaces aimed at improving resonant coupling and photon routing efficiency.\nIn our design, the guided mode is confined within a plane by a high-index thin\nfilm and is loosely confined laterally by a lower index strip. Using a hydrogen\nsilsesquioxane (HSQ) strip, titanium dioxide core, and silicon dioxide\nsubstrate, we optimise the waveguide dimensions for maximum lateral confinement\nof light. Specifically, we propose a polymer-based Bragg grating cavity and\nring resonator that achieve near-optimal mode volumes and high Q-factors. Our\nsimulations suggest that a cavity with a mode volume of V_{\\text{eff}} \\approx\n7.0 \\left(\\frac{\\lambda}{n}\\right)^3 and a Q-factor of 7000 can produce photons\nwith 97% indistinguishability at 4K. Additionally, we investigate directional\ncouplers for efficient photon routing, comparing photonic and plasmonic\nmaterial structures. While pure photonic structures demonstrate lower loss and\nimproved quality factors, they face practical limitations in terms of bending\nradius. Conversely, plasmonic structures offer shorter bending radii but higher\npropagation losses. This research lays the groundwork for future nanophotonic\ndesigns, aiming to enhance photon generation and routing capabilities for\nquantum optical applications.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Applied Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2bUsZRIKuHEK-7ygQZlwd6PLBFlD8f0c1PsNaf_aypc","pdfSize":"728906","txDigest":"7kKeN4xBNTfy5Db5VJP9Lc6ddBpknU6ivrtgzvbiibLN","endEpoch":"1","status":"CERTIFIED"}
