{"id":"2408.10922","title":"Theoretical Analysis of the Structure, Thermodynamics, and Shear\n  Elasticity of Deeply Metastable Hard Sphere Fluids","authors":"Subhashish Chaki, Baicheng Mei, and Kenneth S. Schweizer","authorsParsed":[["Chaki","Subhashish",""],["Mei","Baicheng",""],["Schweizer","Kenneth S.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 15:04:45 GMT"}],"updateDate":"2024-08-21","timestamp":1724166285000,"abstract":"  The structure, thermodynamics and slow activated dynamics of the equilibrated\nmetastable regime of glass-forming fluids remains a poorly understood problem\nof high theoretical and experimental interest. We apply a highly accurate\nmicroscopic equilibrium liquid state integral equation theory that has not been\npreviously explored in the deeply metastable regime, in conjunction with\nna\\\"ive mode coupling theory of particle localization, to study in a unified\nmanner the structural correlations, thermodynamic properties, and dynamic\nelastic shear modulus in deeply metastable hard sphere fluids. New and\ndistinctive behaviors are predicted including divergent inverse critical power\nlaws for the contact value of the pair correlation function, pressure, and\ninverse dimensionless compressibility, and a splitting of the second peak and\nlarge suppression of interstitial configurations of the pair correlation\nfunction. The dynamic elastic modulus is predicted to exhibit two distinct\nexponential growth regimes with packing fraction that have strongly different\nslopes. These new thermodynamic, structural, and elastic modulus results are\nconsistent with simulations and experiments. Perhaps most unexpectedly,\nconnections between the amplitude of long wavelength density fluctuations,\ndimensionless compressibility, local structure, and the dynamic elastic shear\nmodulus are discovered. These connections are more broadly relevant to\nunderstand the slow activated relaxation and mechanical response of colloidal\nsuspensions in the ultra-dense metastable region and deeply supercooled thermal\nliquids in equilibrium.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/"}