{"id":"2408.17183","title":"Causal Reasoning in Software Quality Assurance: A Systematic Review","authors":"Luca Giamattei, Antonio Guerriero, Roberto Pietrantuono, Stefano Russo","authorsParsed":[["Giamattei","Luca",""],["Guerriero","Antonio",""],["Pietrantuono","Roberto",""],["Russo","Stefano",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 10:34:11 GMT"}],"updateDate":"2024-09-02","timestamp":1725014051000,"abstract":"  Context: Software Quality Assurance (SQA) is a fundamental part of software\nengineering to ensure stakeholders that software products work as expected\nafter release in operation. Machine Learning (ML) has proven to be able to\nboost SQA activities and contribute to the development of quality software\nsystems. In this context, Causal Reasoning is gaining increasing interest as a\nmethodology to solve some of the current ML limitations. It aims to go beyond a\npurely data-driven approach by exploiting the use of causality for more\neffective SQA strategies. Objective: Provide a broad and detailed overview of\nthe use of causal reasoning for SQA activities, in order to support researchers\nto access this research field, identifying room for application, main\nchallenges and research opportunities. Methods: A systematic literature review\nof causal reasoning in the SQA research area. Scientific papers have been\nsearched, classified, and analyzed according to established guidelines for\nsoftware engineering secondary studies. Results: Results highlight the primary\nareas within SQA where causal reasoning has been applied, the predominant\nmethodologies used, and the level of maturity of the proposed solutions. Fault\nlocalization is the activity where causal reasoning is more exploited,\nespecially in the web services/microservices domain, but other tasks like\ntesting are rapidly gaining popularity. Both causal inference and causal\ndiscovery are exploited, with the Pearl's graphical formulation of causality\nbeing preferred, likely due to its intuitiveness. Tools to favour their\napplication are appearing at a fast pace - most of them after 2021.\nConclusions: The findings show that causal reasoning is a valuable means for\nSQA tasks with respect to multiple quality attributes, especially during V&V,\nevolution and maintenance to ensure reliability, while it is not yet fully\nexploited for phases like ...\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}