{"id":"2408.16317","title":"Healthcare Utilization Patterns Among Migrant Populations: Increased\n  Readmissions Suggest Poorer Access. A Population-Wide Retrospective Cohort\n  Study","authors":"Elma Dervi\\'c, Ola Ali, Carola Deischinger, Rafael Prieto-Curiel,\n  Rainer St\\\"utz, Ellenor Mittendorfer-Rutz, Peter Klimek","authorsParsed":[["Dervić","Elma",""],["Ali","Ola",""],["Deischinger","Carola",""],["Prieto-Curiel","Rafael",""],["Stütz","Rainer",""],["Mittendorfer-Rutz","Ellenor",""],["Klimek","Peter",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 07:35:57 GMT"}],"updateDate":"2024-08-30","timestamp":1724916957000,"abstract":"  Equal access to health ensures that all citizens, regardless of\nsocio-economic status, can achieve optimal health, leading to a more\nproductive, equitable, and resilient society. Yet, migrant populations were\nfrequently observed to have lower access to health. The reasons for this are\nnot entirely clear and may include language barriers, a lack of knowledge of\nthe healthcare system, and selective migration (a \"healthy migrant\" effect). We\nuse extensive medical claims data from Austria (13 million hospital stays of\napproximately 4 million individuals) to compare the healthcare utilization\npatterns between Austrians and non-Austrians. We looked at the differences in\nprimary diagnoses and hospital sections of initial hospital admission across\ndifferent nationalities. We hypothesize that cohorts experiencing the healthy\nmigrant effect show lower readmission rates after hospitalization compared to\nmigrant populations that are in poorer health but show lower hospitalization\nrates due to barriers in access. We indeed find that all nationalities showed\nlower hospitalization rates than Austrians, except for Germans, who exhibit a\nsimilar healthcare usage to Austrians. Although around 20\\% of the population\nhas a migration background, non-Austrian citizens account for only 9.4% of the\nhospital patients and 9.79% of hospital nights. However, results for\nreadmission rates are much more divergent. Nationalities like Hungary, Romania,\nand Turkey (females) show decreased readmission rates in line with the healthy\nmigrant effect. Patients from Russia, Serbia, and Turkey (males) show increased\nreadmissions, suggesting that their lower hospitalization rates are more likely\ndue to access barriers. Considering the surge in migration, our findings shed\nlight on healthcare access and usage behaviours across patients with different\nnationalities, offering new insights and perspectives.\n","subjects":["Physics/Medical Physics","Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"8iJ07ox5j1JogKXaBbu5VFF6abukKq8T5SB-aWawLGY","pdfSize":"2152812"}
