{"id":"2408.01216","title":"Exact average many-body interatomic interaction model for random alloys","authors":"Max Hodapp","authorsParsed":[["Hodapp","Max",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 12:11:16 GMT"}],"updateDate":"2024-08-05","timestamp":1722600676000,"abstract":"  Understanding the physical origin of deformation mechanisms in random alloys\nrequires an understanding of their average behavior and, equally important, the\nrole of local fluctuations around the average. Material properties of random\nalloys can be computed using direct simulations on random configurations but\nsome properties are very difficult to compute, for others it is not even fully\nunderstood how to compute them using random sampling, in particular,\ninteraction energies between multiple defects. To that end, we develop an\natomistic model that does the averaging on the level of interatomic potentials.\nThen, the problem of averaging via random sampling is bypassed since computing\nmaterial properties on random configurations reduces to computing material\nproperties on a single crystal, the average alloy.\n  We develop our average model on the class of linear machine-learning\ninteratomic potentials. To that end, using tools from higher-order statistics,\nwe derive an analytic expansion of the average many-body per-atom energy in\nterms of average tensor products of the feature vectors that scales linearly\nwith the size of an atomic neighborhood. In order to avoid forming higher-order\ntensors composed of products of feature vectors, we develop an implementation\nusing equivariant tensor network potentials in which the feature vectors are\ncontracted to small-sized tensors before taking the average. We show that our\naverage model predicts the compact screw dislocation core structure in the\nNbMoTaW medium-entropy alloy, in agreement with density functional theory, as\nopposed to state-of-the-art average embedded atom method potentials that\npredict artificial polarized cores. Hence, we anticipate that our model will\nbecome useful for understanding mechanistic origins of material properties and\nfor developing predictive models of mechanical properties of random alloys.\n","subjects":["Physics/Computational Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}