{"id":"2408.07754","title":"Local Cold Load Pick-up Estimation Using Customer Energy Consumption\n  Measurements","authors":"Sanja Bajic and Fran\\c{c}ois Bouffard and Hannah Michalska and G\\'eza\n  Jo\\'os","authorsParsed":[["Bajic","Sanja",""],["Bouffard","François",""],["Michalska","Hannah",""],["Joós","Géza",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 18:06:29 GMT"}],"updateDate":"2024-08-16","timestamp":1723658789000,"abstract":"  Thermostatically-controlled loads have a significant impact on electricity\ndemand after service is restored following an outage, a phenomenon known as\ncold load pick-up (CLPU). Active management of CLPU is becoming an essential\ntool for distribution system operators who seek to defer network upgrades and\nspeed up post-outage customer restoration. One key functionality needed for\nactively managing CLPU is its forecast at various scales. The widespread\ndeployment of smart metering devices is also opening up new opportunities for\ndata-driven load modeling and forecast. In this paper, we propose an approach\nfor customer-side estimation of CLPU using time-stamped local load\nmeasurements. The proposed method uses Auto-Regressive Integrated Moving\nAverage (ARIMA) modeling for short-term foregone energy consumption forecast\nduring an outage. Forecasts are made on an hourly basis to estimate the energy\nto potentially recover after outages lasting up to several hours. Moreover, to\naccount for changing customer behavior and weather, the model order is adjusted\ndynamically. Simulation results based on actual smart meter measurements are\npresented for 50 residential customers over the duration of one year. These\nresults are validated using physical modeling of residential loads and are\nshown to match well the ARIMA-based forecasts. Additionally, accuracy and\nexecution speed has been compared with other state-of-the-art approaches for\ntime-series forecasting including Long Short Term Memory Network (LSTM) and\nHolt-Winters Exponential Smoothing (HWES). ARIMA-based forecast is found to\noffer superior performance both in terms of accuracy and computation speed.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}