{"id":"2408.08863","title":"Instability and Evolution of Shocked Clouds Formed by Orthogonal\n  Collisions between Magnetized Filamentary Molecular Clouds","authors":"Raiga Kashiwagi, Kazunari Iwasaki, and Kohji Tomisaka","authorsParsed":[["Kashiwagi","Raiga",""],["Iwasaki","Kazunari",""],["Tomisaka","Kohji",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 17:44:59 GMT"}],"updateDate":"2024-08-19","timestamp":1723830299000,"abstract":"  Filamentary molecular clouds are recognized as primary sites for the\nformation of stars. Specifically, regions characterized by the overlapping\npoint of multiple filaments, known as hub regions, often associated with active\nstar formation. However, the formation mechanism of this hub structure is not\nwell understood. Therefore, to understand the formation mechanism and star\nformation in hub structures, as a first step, we investigate the orthogonal\ncollisions between two filaments using three-dimensional ideal\nmagnetohydrodynamical simulations. As a model of initial filaments, we use an\ninfinitely long filament in magnetohydrostatic equilibrium under a global\nmagnetic field running perpendicular to the filament axis. Two identical\nequilibrium filaments, sharing the same magnetic flux, are arranged with their\nlong axes perpendicular to each other and given an initial velocity\nperpendicular to their long axes to replicate an orthogonal collision. We find\nthree types of evolution after the shocked cloud is formed: collapse, stable,\nand expansion modes. The energy balance just after the filaments completely\ncollide explains the future evolution of the shocked cloud. If the magnitude of\ngravitational energy is larger than the sum of the kinetic, thermal, and\nmagnetic energies, the shocked cloud evolves in collapse mode. If the magnitude\nof gravitational energy is less than the sum of these energies, the cloud\nevolves in stable mode when the kinetic energy is relatively small and in\nexpansion mode when the kinetic energy is sufficiently large.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}