{"id":"2408.10414","title":"Towards Automation of Human Stage of Decay Identification: An Artificial\n  Intelligence Approach","authors":"Anna-Maria Nau, Phillip Ditto, Dawnie Wolfe Steadman, Audris Mockus","authorsParsed":[["Nau","Anna-Maria",""],["Ditto","Phillip",""],["Steadman","Dawnie Wolfe",""],["Mockus","Audris",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 21:00:40 GMT"}],"updateDate":"2024-08-21","timestamp":1724101240000,"abstract":"  Determining the stage of decomposition (SOD) is crucial for estimating the\npostmortem interval and identifying human remains. Currently, labor-intensive\nmanual scoring methods are used for this purpose, but they are subjective and\ndo not scale for the emerging large-scale archival collections of human\ndecomposition photos. This study explores the feasibility of automating two\ncommon human decomposition scoring methods proposed by Megyesi and Gelderman\nusing artificial intelligence (AI). We evaluated two popular deep learning\nmodels, Inception V3 and Xception, by training them on a large dataset of human\ndecomposition images to classify the SOD for different anatomical regions,\nincluding the head, torso, and limbs. Additionally, an interrater study was\nconducted to assess the reliability of the AI models compared to human forensic\nexaminers for SOD identification. The Xception model achieved the best\nclassification performance, with macro-averaged F1 scores of .878, .881, and\n.702 for the head, torso, and limbs when predicting Megyesi's SODs, and .872,\n.875, and .76 for the head, torso, and limbs when predicting Gelderman's SODs.\nThe interrater study results supported AI's ability to determine the SOD at a\nreliability level comparable to a human expert. This work demonstrates the\npotential of AI models trained on a large dataset of human decomposition images\nto automate SOD identification.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kF6JrXsjGnTHC5fxEzJ9xF0xVbuyTHIuWw6wjIYG0V8","pdfSize":"519986"}
