{"id":"2408.17032","title":"Accretion of the earliest inner solar system planetesimals beyond the\n  water-snowline","authors":"Damanveer S. Grewal, Nicole X. Nie, Bidong Zhang, Andre Izidoro, Paul\n  D. Asimow","authorsParsed":[["Grewal","Damanveer S.",""],["Nie","Nicole X.",""],["Zhang","Bidong",""],["Izidoro","Andre",""],["Asimow","Paul D.",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 06:07:04 GMT"}],"updateDate":"2024-09-02","timestamp":1724998024000,"abstract":"  How and where the first generation of inner solar system planetesimals formed\nremains poorly understood. Potential formation regions are the silicate\ncondensation line and water-snowline of the solar protoplanetary disk. Whether\nthe chemical compositions of these planetesimals align with accretion at the\nsilicate condensation line (water-free and reduced) or water-snowline\n(water-bearing and oxidized) is, however, unknown. Here we use Fe/Ni and Fe/Co\nratios of magmatic iron meteorites to quantify the oxidation states of the\nearliest planetesimals associated with non-carbonaceous (NC) and carbonaceous\n(CC) reservoirs, representing the inner and outer solar system, respectively.\nOur results show that the earliest NC planetesimals contained substantial\namounts of oxidized Fe in their mantles (3-19 wt% FeO). In turn, we argue that\nthis required the accretion of water-bearing materials into these NC\nplanetesimals. The presence of substantial quantities of moderately and highly\nvolatile elements in their parent cores is also inconsistent with their\naccretion at the silicate condensation line and favors instead their formation\nat or beyond the water-snowline. Similar oxidation states in the early-formed\nparent bodies of NC iron meteorites and those of NC achondrites and chondrites\nwith diverse accretion ages suggests that the formation of oxidized\nplanetesimals from water-bearing materials was widespread in the early history\nof the inner solar system.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"LkItYjim_jt9iL1pcu2XZeiZg9EXP0wxWMVZ6kmSwKs","pdfSize":"1112205"}
