{"id":"2408.05472","title":"FuXi Weather: An end-to-end machine learning weather data assimilation\n  and forecasting system","authors":"Xiuyu Sun and Xiaohui Zhong and Xiaoze Xu and Yuanqing Huang and Hao\n  Li and Jie Feng and Wei Han and Libo Wu and Yuan Qi","authorsParsed":[["Sun","Xiuyu",""],["Zhong","Xiaohui",""],["Xu","Xiaoze",""],["Huang","Yuanqing",""],["Li","Hao",""],["Feng","Jie",""],["Han","Wei",""],["Wu","Libo",""],["Qi","Yuan",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 07:42:01 GMT"}],"updateDate":"2024-08-13","timestamp":1723275721000,"abstract":"  Operational numerical weather prediction systems consist of three fundamental\ncomponents: the global observing system for data collection, data assimilation\nfor generating initial conditions, and the forecasting model to predict future\nweather conditions. While NWP have undergone a quiet revolution, with forecast\nskills progressively improving over the past few decades, their advancement has\nslowed due to challenges such as high computational costs and the complexities\nassociated with assimilating an increasing volume of observational data and\nmanaging finer spatial grids. Advances in machine learning offer an alternative\npath towards more efficient and accurate weather forecasts. The rise of machine\nlearning based weather forecasting models has also spurred the development of\nmachine learning based DA models or even purely machine learning based weather\nforecasting systems. This paper introduces FuXi Weather, an end-to-end machine\nlearning based weather forecasting system. FuXi Weather employs specialized\ndata preprocessing and multi-modal data fusion techniques to integrate\ninformation from diverse sources under all-sky conditions, including microwave\nsounders from 3 polar-orbiting satellites and radio occultation data from\nGlobal Navigation Satellite System. Operating on a 6-hourly DA and forecasting\ncycle, FuXi Weather independently generates robust and accurate 10-day global\nweather forecasts at a spatial resolution of 0.25\\textdegree. It surpasses the\nEuropean Centre for Medium-range Weather Forecasts high-resolution forecasts in\nterms of predictability, extending the skillful forecast lead times for several\nkey weather variables such as the geopotential height at 500 hPa from 9.25 days\nto 9.5 days. The system's high computational efficiency and robust performance,\neven with limited observations, demonstrates its potential as a promising\nalternative to traditional NWP systems.\n","subjects":["Computing Research Repository/Machine Learning","Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}