{"id":"2408.08412","title":"Penny-Wise and Pound-Foolish in Deepfake Detection","authors":"Yabin Wang, Zhiwu Huang, Su Zhou, Adam Prugel-Bennett, Xiaopeng Hong","authorsParsed":[["Wang","Yabin",""],["Huang","Zhiwu",""],["Zhou","Su",""],["Prugel-Bennett","Adam",""],["Hong","Xiaopeng",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 20:38:31 GMT"}],"updateDate":"2024-08-19","timestamp":1723754311000,"abstract":"  The diffusion of deepfake technologies has sparked serious concerns about its\npotential misuse across various domains, prompting the urgent need for robust\ndetection methods. Despite advancement, many current approaches prioritize\nshort-term gains at expense of long-term effectiveness. This paper critiques\nthe overly specialized approach of fine-tuning pre-trained models solely with a\npenny-wise objective on a single deepfake dataset, while disregarding the\npound-wise balance for generalization and knowledge retention. To address this\n\"Penny-Wise and Pound-Foolish\" issue, we propose a novel learning framework\n(PoundNet) for generalization of deepfake detection on a pre-trained\nvision-language model. PoundNet incorporates a learnable prompt design and a\nbalanced objective to preserve broad knowledge from upstream tasks (object\nclassification) while enhancing generalization for downstream tasks (deepfake\ndetection). We train PoundNet on a standard single deepfake dataset, following\ncommon practice in the literature. We then evaluate its performance across 10\npublic large-scale deepfake datasets with 5 main evaluation metrics-forming the\nlargest benchmark test set for assessing the generalization ability of deepfake\ndetection models, to our knowledge. The comprehensive benchmark evaluation\ndemonstrates the proposed PoundNet is significantly less \"Penny-Wise and\nPound-Foolish\", achieving a remarkable improvement of 19% in deepfake detection\nperformance compared to state-of-the-art methods, while maintaining a strong\nperformance of 63% on object classification tasks, where other deepfake\ndetection models tend to be ineffective. Code and data are open-sourced at\nhttps://github.com/iamwangyabin/PoundNet.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"C_fpFVsv9Hbyp3vt0UuhcsV5rqZmfGNPlYaCyLOyO9k","pdfSize":"9819654"}
