{"id":"2408.11763","title":"Modeling multiband SEDs and light curves of BL Lacertae using a\n  time-dependent shock-in-jet model","authors":"Rukaiya Khatoon, Markus Boettcher, Raj Prince","authorsParsed":[["Khatoon","Rukaiya",""],["Boettcher","Markus",""],["Prince","Raj",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 16:38:10 GMT"}],"updateDate":"2024-08-22","timestamp":1724258290000,"abstract":"  The origin of fast flux variability in blazars is a long-standing problem,\nwith many theoretical models proposed to explain it. In this study, we focus on\nBL Lacertae to model its spectral energy distribution (SED) and broadband light\ncurves using a diffusive shock acceleration process involving multiple mildly\nrelativistic shocks, coupled with a time-dependent radiation transfer code. BL\nLacertae was the target of a comprehensive multiwavelength monitoring campaign\nin early July 2021. We present a detailed investigation of the source's\nbroadband spectral and light curve features using simultaneous observations at\noptical-UV frequencies with Swift-UVOT, in X-rays with Swift-XRT and\nAstroSat-SXT/LAXPC, and in gamma-rays with Fermi-LAT, covering the period from\nJuly to August 2021 (MJD 59400 to 59450). A fractional variability analysis\nshows that the source is most variable in gamma-rays, followed by X-rays, UV,\nand optical. This allowed us to determine the fastest variability time in\ngamma-rays to be on the order of a few hours. The AstroSat-SXT and LAXPC light\ncurves indicate X-ray variability on the order of a few kiloseconds. Modeling\nsimultaneously the SEDs of low and high flux states of the source and the\nmultiband light curves provided insights into the particle acceleration\nmechanisms at play. This is the first instance of a physical model that\naccurately captures the multi-band temporal variability of BL Lacertae,\nincluding the hour-scale fluctuations observed during the flare.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}