{"id":"2408.13486","title":"Power corrections to quasi-distribution amplitudes of a heavy meson","authors":"Chao Han, Wei Wang, Jia-Lu Zhang, and Jian-Hui Zhang","authorsParsed":[["Han","Chao",""],["Wang","Wei",""],["Zhang","Jia-Lu",""],["Zhang","Jian-Hui",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 06:11:27 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 01:34:53 GMT"},{"version":"v3","created":"Tue, 3 Sep 2024 01:00:42 GMT"}],"updateDate":"2024-09-04","timestamp":1724479887000,"abstract":"  It has been recently demonstrated that lightcone distribution amplitudes\n(LCDAs) for a heavy meson, defined in the heavy quark limit, can be extracted\nby simulating quasi-distribution amplitudes on the lattice with a large meson\nmomentum $P^z$. This extraction involves a two-step procedure. In the\nfirst-step, the quasi-distribution amplitudes are matched onto the QCD LCDAs in\nthe large $P^z$ limit. In the second step, the QCD LCDAs are matched onto the\ndesired LCDAs defined in HQET. In this work, we present the\n$m_H^{2n}/(P^z)^{2n}$ and $\\Lambda_\\text{QCD}^2/(P^z)^2$ corrections in the\nfirst step with $m_H$ being the heavy meson mass. To account for\n$m_H^{2n}/(P^z)^{2n}$ corrections, we employ two methods: the moment relation\nthat can provide mass corrections to all orders, and a leading-twist projector\nthat gives the leading-order mass corrections. For the\n$\\Lambda_\\text{QCD}^2/(P^z)^2$ corrections, we employ a renormalon model that\naddresses the renormalon ambiguity stemming from the divergence of the\nperturbative series. We adopt two parametrizations for QCD LCDAs to conduct a\nnumerical analysis. The results suggest that these corrections are typically\nsmaller than 20\\% in most regions, and should be included in a precision\nanalysis. These findings will serve as a valuable guide for future studies on\nheavy meson LCDAs, particularly in the context of Lattice QCD, where accounting\nfor such corrections is crucial for improving the accuracy and reliability of\nthe results.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}