{"id":"2408.00312","title":"Adversarial Text Rewriting for Text-aware Recommender Systems","authors":"Sejoon Oh, Gaurav Verma, Srijan Kumar","authorsParsed":[["Oh","Sejoon",""],["Verma","Gaurav",""],["Kumar","Srijan",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 06:14:42 GMT"}],"updateDate":"2024-08-02","timestamp":1722492882000,"abstract":"  Text-aware recommender systems incorporate rich textual features, such as\ntitles and descriptions, to generate item recommendations for users. The use of\ntextual features helps mitigate cold-start problems, and thus, such recommender\nsystems have attracted increased attention. However, we argue that the\ndependency on item descriptions makes the recommender system vulnerable to\nmanipulation by adversarial sellers on e-commerce platforms. In this paper, we\nexplore the possibility of such manipulation by proposing a new text rewriting\nframework to attack text-aware recommender systems. We show that the rewriting\nattack can be exploited by sellers to unfairly uprank their products, even\nthough the adversarially rewritten descriptions are perceived as realistic by\nhuman evaluators. Methodologically, we investigate two different variations to\ncarry out text rewriting attacks: (1) two-phase fine-tuning for greater attack\nperformance, and (2) in-context learning for higher text rewriting quality.\nExperiments spanning 3 different datasets and 4 existing approaches demonstrate\nthat recommender systems exhibit vulnerability against the proposed text\nrewriting attack. Our work adds to the existing literature around the\nrobustness of recommender systems, while highlighting a new dimension of\nvulnerability in the age of large-scale automated text generation.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning","Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}