{"id":"2408.16072","title":"Our Stories, Our Data: Co-designing Visualizations with People with\n  Intellectual and Developmental Disabilities","authors":"Keke Wu, Ghulam Jilani Quadri, Arran Zeyu Wang, David Kwame Osei-Tutu,\n  Emma Petersen, Varsha Koushik, Danielle Albers Szafir","authorsParsed":[["Wu","Keke",""],["Quadri","Ghulam Jilani",""],["Wang","Arran Zeyu",""],["Osei-Tutu","David Kwame",""],["Petersen","Emma",""],["Koushik","Varsha",""],["Szafir","Danielle Albers",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:13:46 GMT"}],"updateDate":"2024-08-30","timestamp":1724868826000,"abstract":"  Individuals with Intellectual and Developmental Disabilities (IDD) have\nunique needs and challenges when working with data. While visualization aims to\nmake data more accessible to a broad audience, our understanding of how to\ndesign cognitively accessible visualizations remains limited. In this study, we\nengaged 20 participants with IDD as co-designers to explore how they approach\nand visualize data. Our preliminary investigation paired four participants as\ndata pen-pals in a six-week online asynchronous participatory design workshop.\nIn response to the observed conceptual, technological, and emotional struggles\nwith data, we subsequently organized a two-day in-person co-design workshop\nwith 16 participants to further understand relevant visualization authoring and\nsensemaking strategies. Reflecting on how participants engaged with and\nrepresented data, we propose two strategies for cognitively accessible data\nvisualizations: transforming numbers into narratives and blending data design\nwith everyday aesthetics. Our findings emphasize the importance of involving\nindividuals with IDD in the design process, demonstrating their capacity for\ndata analysis and expression, and underscoring the need for a narrative and\ntangible approach to accessible data visualization.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}