{"id":"2408.15066","title":"Constraining Participation: Affordances of Feedback Features in\n  Interfaces to Large Language Models","authors":"Ned Cooper and Alexandra Zafiroglu","authorsParsed":[["Cooper","Ned",""],["Zafiroglu","Alexandra",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 13:50:37 GMT"}],"updateDate":"2024-08-28","timestamp":1724766637000,"abstract":"  Large language models (LLMs) are now accessible to anyone with a computer, a\nweb browser, and an internet connection via browser-based interfaces, shifting\nthe dynamics of participation in AI development. This paper examines the\naffordances of interactive feedback features in ChatGPT's interface, analysing\nhow they shape user input and participation in LLM iteration. Drawing on a\nsurvey of ChatGPT users and applying the mechanisms and conditions framework of\naffordances, we demonstrate that these features encourage simple, frequent, and\nperformance-focused feedback while discouraging collective input and\ndiscussions among users. We argue that this feedback format significantly\nconstrains user participation, reinforcing power imbalances between users, the\npublic, and companies developing LLMs. Our analysis contributes to the growing\nbody of literature on participatory AI by critically examining the limitations\nof existing feedback processes and proposing directions for their redesign. To\nenable more meaningful public participation in AI development, we advocate for\na shift away from processes focused on aligning model outputs with specific\nuser preferences. Instead, we emphasise the need for processes that facilitate\ndialogue between companies and diverse 'publics' about the purpose and\napplications of LLMs. This approach requires attention to the ongoing work of\ninfrastructuring - creating and sustaining the social, technical, and\ninstitutional structures necessary to address matters of concern to groups\nimpacted by AI development and deployment.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}