{"id":"2408.04039","title":"Broadband mode exchanger based on subwavelength Y-junctions","authors":"Raquel Fern\\'andez de Cabo, Alejandro S\\'anchez-S\\'anchez, Yijun Yang,\n  Daniele Melati, Carlos Alonso-Ramos, Aitor V. Velasco and David\n  Gonz\\'alez-Andrade","authorsParsed":[["de Cabo","Raquel Fern치ndez",""],["S치nchez-S치nchez","Alejandro",""],["Yang","Yijun",""],["Melati","Daniele",""],["Alonso-Ramos","Carlos",""],["Velasco","Aitor V.",""],["Gonz치lez-Andrade","David",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 18:44:05 GMT"}],"updateDate":"2024-08-09","timestamp":1723056245000,"abstract":"  Multimode silicon photonics, leveraging mode-division multiplexing\ntechnologies, offers significant potential to increase capacity of large-scale\nmultiprocessing systems for on-chip optical interconnects. These technologies\nhave implications not only for telecom and datacom applications, but also for\ncutting-edge fields such as quantum and nonlinear photonics. Thus, the\ndevelopment of compact, low-loss and low-crosstalk multimode devices, in\nparticular mode exchangers, is crucial for effective on-chip mode manipulation.\nThis work introduces a novel mode exchanger that exploits the properties of\nsubwavelength grating metamaterials and symmetric Y-junctions, achieving low\nlosses and crosstalk over a broad bandwidth and a compact size of only 6.5\n{\\mu}m {\\times} 2.6 {\\mu}m. The integration of SWG nanostructures in our design\nenables precise control of mode exchange through different propagation\nconstants in the arms and metamaterial, and takes advantage of dispersion\nengineering to broaden the operating bandwidth. Experimental characterization\ndemonstrates, to the best of our knowledge, the broadest operational bandwidth\ncovering from 1420 nm to 1620 nm, with measured losses as low as 0.5 dB and\nextinction ratios higher than 10 dB. Enhanced performance is achieved within a\n149 nm bandwidth (1471-1620 nm), showing measured losses below 0.4 dB and\nextinction ratios greater than 18 dB.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PhwOHpGhb0Nl4ZAztX-s7Ndi8eGeSOYS988tX-tGy6w","pdfSize":"624743"}
