{"id":"2408.10789","title":"Learning Part-aware 3D Representations by Fusing 2D Gaussians and\n  Superquadrics","authors":"Zhirui Gao, Renjiao Yi, Yuhang Huang, Wei Chen, Chenyang Zhu, Kai Xu","authorsParsed":[["Gao","Zhirui",""],["Yi","Renjiao",""],["Huang","Yuhang",""],["Chen","Wei",""],["Zhu","Chenyang",""],["Xu","Kai",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 12:30:37 GMT"}],"updateDate":"2024-08-21","timestamp":1724157037000,"abstract":"  Low-level 3D representations, such as point clouds, meshes, NeRFs, and 3D\nGaussians, are commonly used to represent 3D objects or scenes. However, humans\nusually perceive 3D objects or scenes at a higher level as a composition of\nparts or structures rather than points or voxels. Representing 3D as semantic\nparts can benefit further understanding and applications. We aim to solve\npart-aware 3D reconstruction, which parses objects or scenes into semantic\nparts. In this paper, we introduce a hybrid representation of superquadrics and\n2D Gaussians, trying to dig 3D structural clues from multi-view image inputs.\nAccurate structured geometry reconstruction and high-quality rendering are\nachieved at the same time. We incorporate parametric superquadrics in mesh\nforms into 2D Gaussians by attaching Gaussian centers to faces in meshes.\nDuring the training, superquadrics parameters are iteratively optimized, and\nGaussians are deformed accordingly, resulting in an efficient hybrid\nrepresentation. On the one hand, this hybrid representation inherits the\nadvantage of superquadrics to represent different shape primitives, supporting\nflexible part decomposition of scenes. On the other hand, 2D Gaussians are\nincorporated to model the complex texture and geometry details, ensuring\nhigh-quality rendering and geometry reconstruction. The reconstruction is fully\nunsupervised. We conduct extensive experiments on data from DTU and ShapeNet\ndatasets, in which the method decomposes scenes into reasonable parts,\noutperforming existing state-of-the-art approaches.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}