{"id":"2408.08770","title":"Pessimistic Iterative Planning for Robust POMDPs","authors":"Maris F. L. Galesloot, Marnix Suilen, Thiago D. Sim\\~ao, Steven Carr,\n  Matthijs T. J. Spaan, Ufuk Topcu, Nils Jansen","authorsParsed":[["Galesloot","Maris F. L.",""],["Suilen","Marnix",""],["Simão","Thiago D.",""],["Carr","Steven",""],["Spaan","Matthijs T. J.",""],["Topcu","Ufuk",""],["Jansen","Nils",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 14:25:20 GMT"}],"updateDate":"2024-08-19","timestamp":1723818320000,"abstract":"  Robust partially observable Markov decision processes (robust POMDPs) extend\nclassical POMDPs to handle additional uncertainty on the transition and\nobservation probabilities via so-called uncertainty sets. Policies for robust\nPOMDPs must not only be memory-based to account for partial observability but\nalso robust against model uncertainty to account for the worst-case instances\nfrom the uncertainty sets. We propose the pessimistic iterative planning (PIP)\nframework, which finds robust memory-based policies for robust POMDPs. PIP\nalternates between two main steps: (1) selecting an adversarial (non-robust)\nPOMDP via worst-case probability instances from the uncertainty sets; and (2)\ncomputing a finite-state controller (FSC) for this adversarial POMDP. We\nevaluate the performance of this FSC on the original robust POMDP and use this\nevaluation in step (1) to select the next adversarial POMDP. Within PIP, we\npropose the rFSCNet algorithm. In each iteration, rFSCNet finds an FSC through\na recurrent neural network trained using supervision policies optimized for the\nadversarial POMDP. The empirical evaluation in four benchmark environments\nshowcases improved robustness against a baseline method in an ablation study\nand competitive performance compared to a state-of-the-art robust POMDP solver.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}