{"id":"2408.09436","title":"Nuclear spin polarization in silicon carbide at room temperature in the\n  Earth's magnetic field","authors":"A. N. Anisimov, A. V. Poshakinskiy, G. V. Astakhov","authorsParsed":[["Anisimov","A. N.",""],["Poshakinskiy","A. V.",""],["Astakhov","G. V.",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 10:44:07 GMT"}],"updateDate":"2024-08-20","timestamp":1723977847000,"abstract":"  Coupled electron-nuclear spins represent a promising quantum system, where\nthe optically induced electron spin polarization can be dynamically transferred\nto nuclear spins via the hyperfine interaction. Most experiments on dynamic\nnuclear polarization (DNP) are performed at cryogenic temperatures and/or in\nmoderate external magnetic fields, the latter approach being very sensitive to\nthe magnetic field orientation. Here, we demonstrate that the $^{29}$Si nuclear\nspins in SiC can be efficiently polarized at room temperature even in the\nEarth's magnetic field. We exploit the asymmetric splitting of the optically\ndetected magnetic resonance (ODMR) lines inherent to half-integer $S = 3/2$\nelectron spins, such that the certain transitions involving $^{29}$Si nuclei\ncan be clearly separated and selectively addressed using radiofrequency (RF)\nfields. As a model system, we use the V3 silicon vacancy in 6H-SiC, which has\nthe zero-filed splitting parameter comparable with the hyperfine interaction\nconstant. Our theoretical model considers DNP under optical excitation in\ncombination with RF driving and agrees very well with the experimental data. In\nthe case of high-fidelity electron spin polarization, the proposed DNP protocol\nleads to ultra-deep optical cooling of nuclear spins with an effective\ntemperature of about 50 nK. These results provide a straightforward approach\nfor controlling the nuclear spin under ambient conditions, representing an\nimportant step toward realizing nuclear hyperpolarization for magnetic\nresonance imaging and long nuclear spin memory for quantum logic gates.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}