{"id":"2408.13581","title":"Scaling mean annual peak flow scaling with upstream basin area","authors":"Behzad Ghanbarian","authorsParsed":[["Ghanbarian","Behzad",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 13:34:02 GMT"}],"updateDate":"2024-09-04","timestamp":1724506442000,"abstract":"  Understanding how annual peak flow, $Q_p$, relates to upstream basin area,\n$A$, and their scaling have been one of the challenges in surface hydrology.\nAlthough a power-law scaling relationship (i.e., $Q_p \\propto A^\\alpha$) has\nbeen widely applied in the literature, it is purely empirical, and due to its\nempiricism the interpretation of its exponent, a, and its variations from one\nbasin to another is not clear. In the literature, different values of a have\nbeen reported for various datasets and drainage basins of different areas.\nInvoking concepts of percolation theory as well as self-affinity, we derived\nuniversal and non-universal scaling laws to theoretically link $Q_p$ to $A$. In\nthe universal scaling, we related the exponent $\\alpha$ to the fractal\ndimensionality of percolation, $D_x$. In the non-universal scaling, in addition\nto $D_x$, the exponent a was related to the Hurst exponent, $H$, characterizing\nthe boundaries of the drainage basin. The $D_x$ depends on the dimensionality\nof the drainage system (e.g., two or three dimensions) and percolation class\n(e.g., random or invasion percolation). We demonstrated that the theoretical\nuniversal and non-universal bounds were in well agreement with experimental\nranges of a reported in the literature. More importantly, our theoretical\nframework revealed that greater a values are theoretically expected when basins\nare more quasi two-dimensional, while smaller values when basins are mainly\nquasi three-dimensional. This is well consistent with the experimental data. We\nattributed it to the fact that small basins most probably display\nquasi-two-dimensional topography, while large basins quasi-three-dimensional\none.\n","subjects":["Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/"}