{"id":"2408.15108","title":"Assembly Theory Reduced to Shannon Entropy and Rendered Redundant by\n  Naive Statistical Algorithms","authors":"Luan Ozelim, Abicumaran Uthamacumaran, Felipe S. Abrah\\~ao, Santiago\n  Hern\\'andez-Orozco, Narsis A. Kiani, Jesper Tegn\\'er, Hector Zenil","authorsParsed":[["Ozelim","Luan",""],["Uthamacumaran","Abicumaran",""],["Abrahão","Felipe S.",""],["Hernández-Orozco","Santiago",""],["Kiani","Narsis A.",""],["Tegnér","Jesper",""],["Zenil","Hector",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 14:47:17 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 00:25:40 GMT"}],"updateDate":"2024-09-04","timestamp":1724770037000,"abstract":"  Previously, we formally proved that any implementation of the concept of\n`copy number' underlying Assembly Theory (AT) and its assembly index (Ai) was\nequivalent to Shannon Entropy and not fundamentally or methodologically\ndifferent from algorithms like ZIP and PNG via an LZ grammar. We show that the\nweak empirical correlation between Ai and LZW, which the authors offered as a\ndefence against the previously proven result that the assembly index\ncalculation method is an LZ scheme, is based on a misleading experiment. When\nthe experiment is conducted properly the asymptotic convergence to LZ\ncompression and Shannon Entropy is evident, and aligns with the mathematical\nproof previously provided. This completes both the theoretical and empirical\ndemonstrations that any variation of the copy-number concept underlying AT,\nwhich resorts to counting the number of repetitions to arrive at a measure for\nlife, is equivalent to statistical compression and Shannon Entropy. We\ndemonstrate that the authors' `we-are-better-because-we-are-worse argument'\ndoes not withstand basic scrutiny, and that their primary empirical results\nseparating organic from inorganic compounds have not only been previously\nreported -- sans claims to unify physics and biology -- but are also driven\nsolely by molecular length, not by any special feature of life captured by\ntheir assembly index. Finally, we show that Ai is a special subcase of our\nBlock Decomposition Method introduced almost a decade earlier.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Computational Complexity","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}