{"id":"2408.03159","title":"Quantum Computation of Electronic Structure with Projector\n  Augmented-Wave Method and Plane Wave Basis Set","authors":"Aleksei V. Ivanov, Andrew Patterson, Marius Bothe, Christoph\n  S\\\"underhauf, Bjorn K. Berntson, Jens J{\\o}rgen Mortensen, Mikael Kuisma,\n  Earl Campbell, R\\'obert Izs\\'ak","authorsParsed":[["Ivanov","Aleksei V.",""],["Patterson","Andrew",""],["Bothe","Marius",""],["Sünderhauf","Christoph",""],["Berntson","Bjorn K.",""],["Mortensen","Jens Jørgen",""],["Kuisma","Mikael",""],["Campbell","Earl",""],["Izsák","Róbert",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 12:56:10 GMT"}],"updateDate":"2024-08-07","timestamp":1722948970000,"abstract":"  Quantum simulation of materials is a promising application area of quantum\ncomputers. In order to realize this promise, finding ways to reduce quantum\nresources while maintaining the accuracy of results will be necessary. In\nelectronic structure calculations on classical computer the reduction of\nresources has been achieved by using the projector augmented-wave method (PAW)\nand plane wave basis sets. In this work, we present an implementation of the\nPAW with plane waves for quantum computation of the energy. We first generalize\nthe approach to many-body wavefunctions and develop the unitary version of the\nPAW which preserves the orthonormality of orbitals. Then, we provide a\nlinear-combination-of-unitaries decomposition which explicitly accounts for the\natomic two-body PAW correction and provide the corresponding block encodings of\nthe Hamiltonian used in qubitized quantum phase estimation. We then estimate\nquantum resources for crystalline solids using down-sampling to estimate the\nenergy within chemical accuracy with respect to the full basis set limit, and\nalso consider a supercell approach which is more suitable for calculations of\ndefect states. We provide the quantum resources for energy estimation of a\nnitrogen-vacancy defect centre in diamond which is a challenging system for\nclassical algorithms and a quintessential problem in the studies of quantum\npoint defects.\n","subjects":["Physics/Quantum Physics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}