{"id":"2408.04500","title":"\"I Am Human, Just Like You\": What Intersectional, Neurodivergent Lived\n  Experiences Bring to Accessibility Research","authors":"Lindy Le","authorsParsed":[["Le","Lindy",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 14:55:13 GMT"}],"updateDate":"2024-08-09","timestamp":1723128913000,"abstract":"  The increasing prevalence of neurodivergence has led society to give greater\nrecognition to the importance of neurodiversity. Yet societal perceptions of\nneurodivergence continue to be predominantly negative. Drawing on Critical\nDisability Studies, accessibility researchers have demonstrated how\nneuronormative assumptions dominate HCI. Despite their guidance, neurodivergent\nand disabled individuals are still marginalized in technology research. In\nparticular, intersectional identities remain largely absent from HCI\nneurodivergence research. In this paper, I share my perspective as an outsider\nof the academic research community: I use critical autoethnography to analyze\nmy experiences of coming to understand, accept, and value my neurodivergence\nwithin systems of power, privilege, and oppression. Using Data Feminism as an\naccessible and practical guide to intersectionality, I derive three tenets for\nreconceptualizing neurodivergence to be more inclusive of intersectional\nexperiences: (1) neurodivergence is a functional difference, not a deficit; (2)\nneurodivergent disability is a moment of friction, not a static label; and (3)\nneurodivergence accessibility is a collaborative practice, not a one-sided\nsolution. Then, I discuss the tenets in the context of existing HCI research,\napplying the same intersectional lens. Finally, I offer three suggestions for\nhow accessibility research can apply these tenets in future work, to bridge the\ngap between accessibility theory and practice in HCI neurodivergence research\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}