{"id":"2408.13828","title":"Decentralized Stochastic Control in Standard Borel Spaces: Centralized\n  MDP Reductions, Near Optimality of Finite Window Local Information, and\n  Q-Learning","authors":"Omar Mrani-Zentar and Serdar Y\\\"uksel","authorsParsed":[["Mrani-Zentar","Omar",""],["Yüksel","Serdar",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 13:07:34 GMT"}],"updateDate":"2024-08-27","timestamp":1724591254000,"abstract":"  Decentralized stochastic control problems are intrinsically difficult to\nstudy because of the inapplicability of standard tools from centralized control\nsuch as dynamic programming and the resulting computational complexity. In this\npaper, we address some of these challenges for decentralized stochastic control\nwith Borel spaces under three different but tightly related information\nstructures under a unified theme: the one-step delayed information sharing\npattern, the K-step periodic information sharing pattern, and the completely\ndecentralized information structure where no sharing of information occurs. We\nwill show that the one-step delayed and K-step periodic problems can be reduced\nto a centralized MDP, generalizing prior results which considered finite,\nlinear, or static models, by addressing several measurability questions. The\nseparated nature of policies under both information structures is then\nestablished. We then provide sufficient conditions for the transition kernels\nof both centralized reductions to be weak-Feller, which facilitates rigorous\napproximation and learning theoretic results. We will then show that for the\ncompletely decentralized control problem finite memory local policies are near\noptimal under a joint conditional mixing condition. This is achieved by\nobtaining a bound for finite memory policies which goes to zero as memory size\nincreases. We will also provide a performance bound for the K-periodic problem,\nwhich results from replacing the full common information by a finite sliding\nwindow of information. The latter will depend on the condition of predictor\nstability in expected total variation, which we will establish. We finally show\nthat under the periodic information sharing pattern, a quantized Q-learning\nalgorithm converges asymptotically towards a near optimal solution. Each of the\nabove, to our knowledge, is a new contribution to the literature.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}