{"id":"2408.08208","title":"LLM4DSR: Leveraing Large Language Model for Denoising Sequential\n  Recommendation","authors":"Bohao Wang, Feng Liu, Jiawei Chen, Yudi Wu, Xingyu Lou, Jun Wang, Yan\n  Feng, Chun Chen, Can Wang","authorsParsed":[["Wang","Bohao",""],["Liu","Feng",""],["Chen","Jiawei",""],["Wu","Yudi",""],["Lou","Xingyu",""],["Wang","Jun",""],["Feng","Yan",""],["Chen","Chun",""],["Wang","Can",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 15:18:46 GMT"}],"updateDate":"2024-08-16","timestamp":1723735126000,"abstract":"  Sequential recommendation systems fundamentally rely on users' historical\ninteraction sequences, which are often contaminated by noisy interactions.\nIdentifying these noisy interactions accurately without additional information\nis particularly difficult due to the lack of explicit supervisory signals to\ndenote noise. Large Language Models (LLMs), equipped with extensive open\nknowledge and semantic reasoning abilities, present a promising avenue to\nbridge this information gap. However, employing LLMs for denoising in\nsequential recommendation introduces notable challenges: 1) Direct application\nof pretrained LLMs may not be competent for the denoising task, frequently\ngenerating nonsensical responses; 2) Even after fine-tuning, the reliability of\nLLM outputs remains questionable, especially given the complexity of the task\nand th inherent hallucinatory issue of LLMs.\n  To tackle these challenges, we propose LLM4DSR, a tailored approach for\ndenoising sequential recommendation using LLMs. We constructed a\nself-supervised fine-tuning task to activate LLMs' capabilities to identify\nnoisy items and suggest replacements. Furthermore, we developed an uncertainty\nestimation module that ensures only high-confidence responses are utilized for\nsequence corrections. Remarkably, LLM4DSR is model-agnostic, allowing the\ncorrected sequences to be flexibly applied across various recommendation\nmodels. Extensive experiments validate the superiority of LLM4DSR over existing\nmethods across three datasets and three recommendation backbones.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}