{"id":"2408.10348","title":"A single spin in hexagonal boron nitride for vectorial quantum\n  magnetometry","authors":"Carmem M. Gilardoni, Simone Eizagirre Barker, Catherine L. Curtin,\n  Stephanie A. Fraser, Oliver. F.J. Powell, Dillon K. Lewis, Xiaoxi Deng,\n  Andrew J. Ramsay, Chi Li, Igor Aharonovich, Hark Hoe Tan, Mete Atat\\\"ure,\n  Hannah L. Stern","authorsParsed":[["Gilardoni","Carmem M.",""],["Barker","Simone Eizagirre",""],["Curtin","Catherine L.",""],["Fraser","Stephanie A.",""],["Powell","Oliver. F. J.",""],["Lewis","Dillon K.",""],["Deng","Xiaoxi",""],["Ramsay","Andrew J.",""],["Li","Chi",""],["Aharonovich","Igor",""],["Tan","Hark Hoe",""],["Atatüre","Mete",""],["Stern","Hannah L.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:40:44 GMT"}],"updateDate":"2024-08-21","timestamp":1724092844000,"abstract":"  Quantum sensing based on solid-state spin defects provides a uniquely\nversatile platform for imaging physical properties at the nanoscale under\ndiverse environmental conditions. Operation of most sensors used to-date is\nbased on projective measurement along a single axis combined with computational\nextrapolation. Here, we show that the individually addressable carbon-related\nspin defect in hexagonal boron nitride is a multi-axis spin system for\nvectorial nanoscale magnetometry. We demonstrate how its low symmetry and\nstrongly spin-selective direct and reverse intersystem crossing dynamics\nprovide sub-$\\mu$T/$\\sqrt{\\text{Hz}}$ magnetic-field sensitivity for both on\nand off-axis bias magnetic field exceeding 50 mT. Alongside these features, the\nroom-temperature operation and the nanometer-scale proximity enabled by the van\nder Waals host material further consolidate this system as an exciting quantum\nsensing platform.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4n8seD2CX5pvVF5YTRhWbxkvr5eGL34UGHYJ7DZQBrk","pdfSize":"9579066"}
