{"id":"2408.11605","title":"Optimizing QoS in HD Map Updates: Cross-Layer Multi-Agent with\n  Hierarchical and Independent Learning","authors":"Jeffrey Redondo, Nauman Aslam, Juan Zhang, Zhenhui Yuan","authorsParsed":[["Redondo","Jeffrey",""],["Aslam","Nauman",""],["Zhang","Juan",""],["Yuan","Zhenhui",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 13:27:17 GMT"}],"updateDate":"2024-08-22","timestamp":1724246837000,"abstract":"  The data collected by autonomous vehicle (AV) sensors such as LiDAR and\ncameras is crucial for creating high-definition (HD) maps to provide higher\naccuracy and enable a higher level of automation. Nevertheless, offloading this\nlarge volume of raw data to edge servers leads to increased latency due to\nnetwork congestion in highly dense environments such as Vehicular Adhoc\nnetworks (VANET). To address this challenge, researchers have focused on the\ndynamic allocation of minimum contention window (CWmin) value. While this\napproach could be sufficient for fairness, it might not be adequate for\nprioritizing different services, as it also involves other parameters such as\nmaximum contention window (CWmax) and infer-frame space number (IFSn). In\nresponse to this, we extend the scope of previous solutions to include the\ncontrol of not only CWmin but also the adjustment of two other parameters in\nthe standard IEEE802.11: CWmax and IFSn, alongside waiting transmission time.\nTo achieve this, we introduced a methodology involving a cross-layer solution\nbetween the application and MAC layers. Additionally, we utilised multi-agent\ntechniques, emphasising a hierarchical structure and independent learning (IL)\nto improve latency to efficiently handle map updates while interacting with\nmultiple services. This approach demonstrated an improvement in latency against\nthe standard IEEE802.11p EDCA by $31\\%$, $49\\%$, $87.3\\%$, and $64\\%$ for\nVoice, Video, HD Map, and Best-effort, respectively.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}