{"id":"2408.09975","title":"Conditional Image Prior for Uncertainty Quantification in Full Waveform\n  Inversion","authors":"Lingyun Yang, Omar M. Saad, Guochen Wu and Tariq Alkhalifah","authorsParsed":[["Yang","Lingyun",""],["Saad","Omar M.",""],["Wu","Guochen",""],["Alkhalifah","Tariq",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 13:22:16 GMT"}],"updateDate":"2024-08-20","timestamp":1724073736000,"abstract":"  Full Waveform Inversion (FWI) is a technique employed to attain a high\nresolution subsurface velocity model. However, FWI results are effected by the\nlimited illumination of the model domain and the quality of that illumination,\nwhich is related to the quality of the data. Additionally, the high\ncomputational cost of FWI, compounded by the high dimensional nature of the\nmodel space, complicates the evaluation of model uncertainties. Recent work on\napplying neural networks to represent the velocity model for FWI demonstrated\nthe network's ability to capture the salient features of the velocity model.\nThe question we ask here is how reliable are these features in representing the\nobserved data contribution within the model space (the posterior distribution).\nTo address this question, we propose leveraging a conditional Convolutional\nNeural Network (CNN) as image prior to quantify the neural network\nuncertainties. Specifically, we add to the deep image prior concept a\nconditional channel, enabling the generation of various models corresponding to\nthe specified condition. We initially train the conditional CNN to learn\n(store) samples from the prior distribution given by Gaussian Random Fields\n(GRF) based perturbations of the current velocity model. Subsequently, we use\nFWI to update the CNN model representation of the priors so that it can\ngenerate samples from the posterior distribution. These samples can be used to\nmeasure the approximate mean and standard deviation of the posterior\ndistribution, as well as draw samples representing the posterior distribution.\nWe demonstrate the effectiveness of the proposed approach on the Marmousi model\nand in a field data application.\n","subjects":["Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}