{"id":"2408.02949","title":"Few-shot Scooping Under Domain Shift via Simulated Maximal Deployment\n  Gaps","authors":"Yifan Zhu, Pranay Thangeda, Erica L Tevere, Ashish Goel, Erik Kramer,\n  Hari D Nayar, Melkior Ornik, and Kris Hauser","authorsParsed":[["Zhu","Yifan",""],["Thangeda","Pranay",""],["Tevere","Erica L",""],["Goel","Ashish",""],["Kramer","Erik",""],["Nayar","Hari D",""],["Ornik","Melkior",""],["Hauser","Kris",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 04:25:09 GMT"}],"updateDate":"2024-08-07","timestamp":1722918309000,"abstract":"  Autonomous lander missions on extraterrestrial bodies need to sample granular\nmaterials while coping with domain shifts, even when sampling strategies are\nextensively tuned on Earth. To tackle this challenge, this paper studies the\nfew-shot scooping problem and proposes a vision-based adaptive scooping\nstrategy that uses the deep kernel Gaussian process method trained with a novel\nmeta-training strategy to learn online from very limited experience on\nout-of-distribution target terrains. Our Deep Kernel Calibration with Maximal\nDeployment Gaps (kCMD) strategy explicitly trains a deep kernel model to adapt\nto large domain shifts by creating simulated maximal deployment gaps from an\noffline training dataset and training models to overcome these deployment gaps\nduring training. Employed in a Bayesian Optimization sequential decision-making\nframework, the proposed method allows the robot to perform high-quality\nscooping actions on out-of-distribution terrains after a few attempts,\nsignificantly outperforming non-adaptive methods proposed in the excavation\nliterature as well as other state-of-the-art meta-learning methods. The\nproposed method also demonstrates zero-shot transfer capability, successfully\nadapting to the NASA OWLAT platform, which serves as a state-of-the-art\nsimulator for potential future planetary missions. These results demonstrate\nthe potential of training deep models with simulated deployment gaps for more\ngeneralizable meta-learning in high-capacity models. Furthermore, they\nhighlight the promise of our method in autonomous lander sampling missions by\nenabling landers to overcome the deployment gap between Earth and\nextraterrestrial bodies.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"h1CFqs8F4tb8Db_22zBeG9nCbfecud3-EZSt9PPlszo","pdfSize":"3067154"}
