{"id":"2408.12984","title":"Zeoformer: Coarse-Grained Periodic Graph Transformer for OSDA-Zeolite\n  Affinity Prediction","authors":"Xiangxiang Shen, Zheng Wan, Lingfeng Wen, Licheng Sun, Ou Yang Ming\n  Jie, Xuan Tang, Xian Zeng, Mingsong Chen, Xiao He, Xian Wei","authorsParsed":[["Shen","Xiangxiang",""],["Wan","Zheng",""],["Wen","Lingfeng",""],["Sun","Licheng",""],["Jie","Ou Yang Ming",""],["Tang","Xuan",""],["Zeng","Xian",""],["Chen","Mingsong",""],["He","Xiao",""],["Wei","Xian",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 11:05:48 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 02:42:23 GMT"}],"updateDate":"2024-08-27","timestamp":1724411148000,"abstract":"  To date, the International Zeolite Association Structure Commission (IZA-SC)\nhas cataloged merely 255 distinct zeolite structures, with millions of\ntheoretically possible structures yet to be discovered. The synthesis of a\nspecific zeolite typically necessitates the use of an organic\nstructure-directing agent (OSDA), since the selectivity for a particular\nzeolite is largely determined by the affinity between the OSDA and the zeolite.\nTherefore, finding the best affinity OSDA-zeolite pair is the key to the\nsynthesis of targeted zeolite. However, OSDA-zeolite pairs frequently exhibit\ncomplex geometric structures, i.e., a complex crystal structure formed by a\nlarge number of atoms. Although some existing machine learning methods can\nrepresent the periodicity of crystals, they cannot accurately represent crystal\nstructures with local variability. To address this issue, we propose a novel\napproach called Zeoformer, which can effectively represent coarse-grained\ncrystal periodicity and fine-grained local variability. Zeoformer reconstructs\nthe unit cell centered around each atom and encodes the pairwise distances\nbetween this central atom and other atoms within the reconstructed unit cell.\nThe introduction of pairwise distances within the reconstructed unit cell more\neffectively represents the overall structure of the unit cell and the\ndifferences between different unit cells, enabling the model to more accurately\nand efficiently predict the properties of OSDA-zeolite pairs and general\ncrystal structures. Through comprehensive evaluation, our Zeoformer model\ndemonstrates the best performance on OSDA-zeolite pair datasets and two types\nof crystal material datasets.\n","subjects":["Condensed Matter/Materials Science","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}