{"id":"2408.07183","title":"Tunable Doping and Mobility Enhancement in 2D Channel Field-Effect\n  Transistors via Damage-Free Atomic Layer Deposition of AlOX Dielectrics","authors":"Ardeshir Esteki, Sarah Riazimehr, Agata Piacentini, Harm Knoops, Bart\n  Macco, Martin Otto, Gordon Rinke, Zhenxing Wang, Ke Ran, Joachim Mayer,\n  Annika Grundmann, Holger Kalisch, Michael Heuken, Andrei Vescan, Daniel\n  Neumaier, Alwin Daus, Max C. Lemme","authorsParsed":[["Esteki","Ardeshir",""],["Riazimehr","Sarah",""],["Piacentini","Agata",""],["Knoops","Harm",""],["Macco","Bart",""],["Otto","Martin",""],["Rinke","Gordon",""],["Wang","Zhenxing",""],["Ran","Ke",""],["Mayer","Joachim",""],["Grundmann","Annika",""],["Kalisch","Holger",""],["Heuken","Michael",""],["Vescan","Andrei",""],["Neumaier","Daniel",""],["Daus","Alwin",""],["Lemme","Max C.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 19:51:13 GMT"}],"updateDate":"2024-08-15","timestamp":1723578673000,"abstract":"  Two-dimensional materials (2DMs) have been widely investigated because of\ntheir potential for heterogeneous integration with modern electronics. However,\nseveral major challenges remain, such as the deposition of high-quality\ndielectrics on 2DMs and the tuning of the 2DM doping levels. Here, we report a\nscalable plasma-enhanced atomic layer deposition (PEALD) process for direct\ndeposition of a nonstoichiometric aluminum oxide (AlOX) dielectric, overcoming\nthe damage issues associated with conventional methods. Furthermore, we control\nthe thickness of the dielectric layer to systematically tune the doping level\nof 2DMs. The experimental results demonstrate successful deposition without\ndetectable damage, as confirmed by Raman spectroscopy and electrical\nmeasurements. Our method enables tuning of the Dirac and threshold voltages of\nback-gated graphene and MoS${_2}$ field-effect transistors (FETs),\nrespectively, while also increasing the charge carrier mobility in both device\ntypes. We further demonstrate the method in top-gated MoS${_2}$ FETs with\ndouble-stack dielectric layers (AlOX+Al${_2}$O${_3}$), achieving critical\nbreakdown field strengths of 7 MV/cm and improved mobility compared with the\nback gate configuration. In summary, we present a PEALD process that offers a\nscalable and low-damage solution for dielectric deposition on 2DMs, opening new\npossibilities for precise tuning of device characteristics in heterogeneous\nelectronic circuits.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}