{"id":"2408.12318","title":"Exploring the Possibility of Testing the No-Hair Theorem with\n  Minkowski-deformed Regular Hairy Black Holes Via Photon Rings","authors":"Xilong Yang and Meirong Tang and Zhaoyi Xu","authorsParsed":[["Yang","Xilong",""],["Tang","Meirong",""],["Xu","Zhaoyi",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 11:54:59 GMT"}],"updateDate":"2024-08-23","timestamp":1724327699000,"abstract":"  In this paper, we investigate the optical appearance of a regular static\nspherically symmetric hairy black hole within the context of Minkowski\ndeformation governed by the parameter \\(\\alpha\\). This black hole describes a\nhairy black hole with geometric deformations in the radial and temporal metric\ncomponents, parameterized by \\(\\alpha\\). The optical appearance of the black\nhole, illuminated by a static thin accretion disk in three toy emission\nfunction models, exhibits distinctive shadows and photon rings. Our findings\nreveal that for static spherically symmetric hairy Minkowski-deformed regular\nblack holes, the event horizon radius \\(r_h\\), photon sphere radius \\(r_{ph}\\),\ncritical impact parameter \\(b_{ph}\\), and innermost stable circular orbit\nradius \\(r_{isco}\\) all have a positive correlation with \\(\\alpha\\). These\nparameters affect the null geodesic trajectories, shadows, and the optical\nappearance of the photon rings illuminated by a static thin accretion disk\naround the black hole. Utilizing this, we obtained the optical appearance of\nthis black hole when observed in the forward direction of the optical and\ngeometric thin accretion disk models. In all three models, the radius of the\nphoton ring images also shows a positive correlation with the parameter\n\\(\\alpha\\). Therefore, under the static spherically symmetric hairy\nMinkowski-deformed regular black hole, there is no degeneracy of photon rings\ndependent on the parameter \\(\\alpha\\). Theoretically, this allows for the\ndistinction of different spacetime metrics of hairy Minkowski-deformed regular\nblack holes, providing a potential method for testing the no-hair theorem\nthrough future observations of black hole photon rings.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}