{"id":"2408.06264","title":"Audio Enhancement for Computer Audition -- An Iterative Training\n  Paradigm Using Sample Importance","authors":"Manuel Milling, Shuo Liu, Andreas Triantafyllopoulos, Ilhan Aslan, and\n  Bj\\\"orn W. Schuller","authorsParsed":[["Milling","Manuel",""],["Liu","Shuo",""],["Triantafyllopoulos","Andreas",""],["Aslan","Ilhan",""],["Schuller","Björn W.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 16:23:58 GMT"}],"updateDate":"2024-08-13","timestamp":1723479838000,"abstract":"  Neural network models for audio tasks, such as automatic speech recognition\n(ASR) and acoustic scene classification (ASC), are susceptible to noise\ncontamination for real-life applications. To improve audio quality, an\nenhancement module, which can be developed independently, is explicitly used at\nthe front-end of the target audio applications. In this paper, we present an\nend-to-end learning solution to jointly optimise the models for audio\nenhancement (AE) and the subsequent applications. To guide the optimisation of\nthe AE module towards a target application, and especially to overcome\ndifficult samples, we make use of the sample-wise performance measure as an\nindication of sample importance. In experiments, we consider four\nrepresentative applications to evaluate our training paradigm, i.e., ASR,\nspeech command recognition (SCR), speech emotion recognition (SER), and ASC.\nThese applications are associated with speech and non-speech tasks concerning\nsemantic and non-semantic features, transient and global information, and the\nexperimental results indicate that our proposed approach can considerably boost\nthe noise robustness of the models, especially at low signal-to-noise ratios\n(SNRs), for a wide range of computer audition tasks in everyday-life noisy\nenvironments.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}