{"id":"2408.06783","title":"Deep reinforcement learning for the management of the wall regeneration\n  cycle in wall-bounded turbulent flows","authors":"Giorgio Maria Cavallazzi, Luca Guastoni, Ricardo Vinuesa, Alfredo\n  Pinelli","authorsParsed":[["Cavallazzi","Giorgio Maria",""],["Guastoni","Luca",""],["Vinuesa","Ricardo",""],["Pinelli","Alfredo",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 10:11:28 GMT"}],"updateDate":"2024-08-14","timestamp":1723543888000,"abstract":"  The wall cycle in wall-bounded turbulent flows is a complex turbulence\nregeneration mechanism that remains not fully understood. This study explores\nthe potential of deep reinforcement learning (DRL) for managing the wall\nregeneration cycle to achieve desired flow dynamics. We integrate the\nStableBaselines3 DRL libraries with the open-source DNS solver CaNS to create a\nrobust platform for dynamic flow control. The DRL agent interacts with the DNS\nenvironment, learning policies that modify wall boundary conditions to optimize\nobjectives such as the reduction of the skin-friction coefficient or the\nenhancement of certain coherent structures features.\n  Initial experiments demonstrate the capability of DRL to achieve\ndrag-reduction rates comparable with those achieved via traditional methods,\nthough limited to short time periods. We also propose a strategy to enhance the\ncoherence of velocity streaks, assuming that maintaining straight streaks can\ninhibit instability and further reduce skin friction. The implementation makes\nuse of the message-passing-interface (MPI) wrappers for efficient communication\nbetween the Python-based DRL agent and the DNS solver, ensuring scalability on\nhigh-performance computing architectures.\n  Our results highlight the promise of DRL in flow control applications and\nunderscore the need for more advanced control laws and objective functions.\nFuture work will focus on optimizing actuation periods and exploring new\ncomputational architectures to extend the applicability and the efficiency of\nDRL in turbulent flow management.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}