{"id":"2408.07293","title":"Discriminating retinal microvascular and neuronal differences related to\n  migraines: Deep Learning based Crossectional Study","authors":"Feilong Tang, Matt Trinh, Annita Duong, Angelica Ly, Fiona Stapleton,\n  Zhe Chen, Zongyuan Ge, Imran Razzak","authorsParsed":[["Tang","Feilong",""],["Trinh","Matt",""],["Duong","Annita",""],["Ly","Angelica",""],["Stapleton","Fiona",""],["Chen","Zhe",""],["Ge","Zongyuan",""],["Razzak","Imran",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 01:40:59 GMT"}],"updateDate":"2024-08-15","timestamp":1722303659000,"abstract":"  Migraine, a prevalent neurological disorder, has been associated with various\nocular manifestations suggestive of neuronal and microvascular deficits.\nHowever, there is limited understanding of the extent to which retinal imaging\nmay discriminate between individuals with migraines versus without migraines.\nIn this study, we apply convolutional neural networks to color fundus\nphotography (CFP) and optical coherence tomography (OCT) data to investigate\ndifferences in the retina that may not be apparent through traditional\nhuman-based interpretations of retinal imaging. Retrospective data of CFP type\n1 [posterior pole] and type 2 [optic nerve head (ONH)] from 369 and 336\nparticipants respectively were analyzed. All participants had bilaterally\nnormal optic nerves and maculae, with no retinal-involving diseases. CFP images\nwere concatenated with OCT default ONH measurements, then inputted through\nthree convolutional neural networks - VGG-16, ResNet-50, and Inceptionv3. The\nprimary outcome was performance of discriminating between with migraines versus\nwithout migraines, using retinal microvascular and neuronal imaging\ncharacteristics. Using CFP type 1 data, discrimination (AUC [95% CI]) was high\n(0.84 [0.8, 0.88] to 0.87 [0.84, 0.91]) and not significantly different between\nVGG-16, ResNet-50, and Inceptionv3. Using CFP type 2 [ONH] data, discrimination\nwas reduced and ranged from poor to fair (0.69 [0.62, 0.77] to 0.74 [0.67,\n0.81]). OCT default ONH measurements overall did not significantly contribute\nto model performance. Class activation maps (CAMs) highlighted that the\nparavascular arcades were regions of interest. The findings suggest that\nindividuals with migraines demonstrate microvascular differences more so than\nneuronal differences in comparison to individuals without migraines.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}