{"id":"2408.03117","title":"The Role of Biomarkers on Haemodynamics in Atherosclerotic Artery","authors":"Ruchira Ray and Bibaswan Dey","authorsParsed":[["Ray","Ruchira",""],["Dey","Bibaswan",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 11:47:28 GMT"}],"updateDate":"2024-08-07","timestamp":1722944848000,"abstract":"  Atherosclerosis, a chronic inflammatory cardiovascular disease, leads to\narterial constriction caused by the accumulation of lipids, cholesterol, and\nvarious substances within artery walls. Such plaque can rupture, resulting in a\nblood clot that obstructs major arteries and may initiate myocardial\ninfarction, ischemic stroke, etc. Atherosclerotic plaque formation begins with\nthe accumulation of foam cells and macrophages within the intima layer of the\narterial wall. At the latter stage, the smooth muscle cells migrated from\ndeeper artery wall layers, contributing to the fibrous cap formation and plaque\nstabilizing. A developed plaque gradually enters the lumen and narrows down the\nlumen to impede blood flow. We introduce a two-phase and macroscopic model to\ninvestigate the progression of plaque growth in its advanced stage and analyze\nthe minimum gap (Lumen Clearance) within an atherosclerotic artery so that\nblood cells can pass through. Cardiac troponin, a high specificity and\nsensitivity biomarker, facilitates early detection of elevated myocardial\ninfarction, Ischemic stroke, etc. risks. This study aims to establish a\nrelationship between the troponin concentration in atherosclerotic arteries and\ntheir internal clearance, which could significantly improve our understanding\nof disease progression. Our observations show that the plaque undergoes rapid\nevolution in its initial stages, gradually slowing down over time to reach a\nsteady state. At the same time, the lumen clearance exhibits an opposite\nbehavior, decreasing slowly over time. Our study finds a positive correlation\nbetween plaque depth and troponin concentration in the blood and a negative\nrelationship between troponin concentrations and lumen clearance in\natherosclerotic arteries.\n","subjects":["Quantitative Biology/Tissues and Organs","Physics/Biological Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}