{"id":"2408.04915","title":"Benchmark Computations of Nearly Degenerate Singlet and Triplet states\n  of N-heterocyclic Chromophores : II. Density-based Methods","authors":"Shamik Chanda and Subhasish Saha and Sangita Sen","authorsParsed":[["Chanda","Shamik",""],["Saha","Subhasish",""],["Sen","Sangita",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 07:47:38 GMT"}],"updateDate":"2024-08-12","timestamp":1723189658000,"abstract":"  In this paper we demonstrate the performance of several density-based methods\nin predicting the inversion of S$_1$ and T$_1$ states of a few N-heterocyclic\nfused ring molecules (popularly known as INVEST molecules) with an eye to\nidentify a well performing but cheap preliminary screening method. Both\nconventional LR-TDDFT and $\\Delta$SCF methods (namely MOM, SGM, ROKS) are\nconsidered for excited state computations using exchange-correlation (XC)\nfunctionals from different rungs of the Jacob's ladder. A well-justified\nsystematism is observed in the performance of the functionals when compared\nagainst FICMRCISD and/or EOM-CCSD, with the most important feature being the\ncapture of spin-polarization in presence of correlation. A set of functionals\nwith the least mean absolute error (MAE) is proposed for both the approaches,\nLR-TDDFT and $\\Delta$SCF, which can be cheaper alternatives for computations on\nsynthesizable larger derivatives of the templates studied here. We have based\nour findings on extensive studies of three cyclazine-based molecular templates,\nwith additional studies on a set of six related templates. Previous benchmark\nstudies for subsets of the functionals were conducted against the\nDLPNO-STEOM-CCSD, which resulted in an inadequate evaluation due to\ndeficiencies in the benchmark theory. The role of exact-exchange,\nspin-contamination and spin-polarization in the context of DFT comes to the\nforefront in our studies and supports the numerical evaluation of XC\nfunctionals for these applications. Suitable connections are drawn to two and\nthree state exciton models which identify the minimal physics governing the\ninteractions in these molecules.\n","subjects":["Physics/Chemical Physics","Physics/Atomic and Molecular Clusters","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}