{"id":"2408.07780","title":"An exercise in Color-Dual Cut Tiling: $\\mathcal{N}=8$ Supergravity from\n  Positivity","authors":"John Joseph M. Carrasco, Alex Edison, Nia Robles Del Pino, Suna\n  Zekio\\u{g}lu","authorsParsed":[["Carrasco","John Joseph M.",""],["Edison","Alex",""],["Del Pino","Nia Robles",""],["Zekioğlu","Suna",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 19:25:47 GMT"}],"updateDate":"2024-08-16","timestamp":1723663547000,"abstract":"  The BCJ duality between color and kinematics brings two advantages to\ncalculating multi-loop scattering amplitudes. First the number of ordered cuts\nthat need to be performed to fix the integrand to a gauge theory is minimal --\nreducing the factorially-growing number of diagrams to a single-digit basis in\nall known cases. Second is the trivial generation of related gravitational\namplitudes from gauge theory amplitudes via double-copy. Mounting evidence\nsuggests there are some cases where no local color-dual representations exist,\neven when the semi-classical theory is color-dual. Can we still simplify the\ncalculations without making the duality manifest at the level of the integrand?\nHere we take a non-trivial step in this direction by showing that the\nsatisfaction of tree-level BCJ relations is sufficient to dramatically reduce\nthe number of explicit cuts that must be performed, even when the loop-level\nrelations are not explicitly satisfied. We introduce an agglomerative\nalgorithm, color-dual cut tiling, that identifies and builds the entire\nintegrand from the simplest on-shell conditions applied to a seed of off-shell\nintegrand information. Specifically, we demonstrate that for two-to-two\nscattering at three loops in the maximally supersymmetric gauge theory there is\nsufficient information contained in planar cuts -- completely determined by\npositivity constraints -- to generate all of the non-planar sector.\nAdditionally, we make use of the generalized double copy to generate a\nrepresentation of maximally supersymmetric gravity as a functional of the\nplanar SYM input. We discuss how the process might generalize, and then close\nby commenting on the applicability of this method for additional cases of\ninterest where performing explicit unitarity cuts is expensive.\n","subjects":["Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}