{"id":"2408.09344","title":"GitHub is an effective platform for collaborative and reproducible\n  laboratory research","authors":"Katharine Y. Chen, Maria Toro-Moreno, and Arvind Rasi Subramaniam","authorsParsed":[["Chen","Katharine Y.",""],["Toro-Moreno","Maria",""],["Subramaniam","Arvind Rasi",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 03:35:26 GMT"}],"updateDate":"2024-08-20","timestamp":1723952126000,"abstract":"  Laboratory research is a complex, collaborative process that involves several\nstages, including hypothesis formulation, experimental design, data generation\nand analysis, and manuscript writing. Although reproducibility and data sharing\nare increasingly prioritized at the publication stage, integrating these\nprinciples at earlier stages of laboratory research has been hampered by the\nlack of broadly applicable solutions. Here, we propose that the workflow used\nin modern software development offers a robust framework for enhancing\nreproducibility and collaboration in laboratory research. In particular, we\nshow that GitHub, a platform widely used for collaborative software projects,\ncan be effectively adapted to organize and document all aspects of a research\nproject's lifecycle in a molecular biology laboratory. We outline a three-step\napproach for incorporating the GitHub ecosystem into laboratory research\nworkflows: 1. designing and organizing experiments using issues and project\nboards, 2. documenting experiments and data analyses with a version control\nsystem, and 3. ensuring reproducible software environments for data analyses\nand writing tasks with containerized packages. The versatility, scalability,\nand affordability of this approach make it suitable for various scenarios,\nranging from small research groups to large, cross-institutional\ncollaborations. Adopting this framework from a project's outset can increase\nthe efficiency and fidelity of knowledge transfer within and across research\nlaboratories. An example GitHub repository based on the above approach is\navailable at https://github.com/rasilab/github_demo.\n","subjects":["Quantitative Biology/Other Quantitative Biology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aputHBeSQ009cJlkfW3sgpqyIegETZ2kaiSMESQ41VA","pdfSize":"1544693"}
