{"id":"2408.12548","title":"Human-In-The-Loop Machine Learning for Safe and Ethical Autonomous\n  Vehicles: Principles, Challenges, and Opportunities","authors":"Yousef Emami, Luis Almeida, Kai Li, Wei Ni, Zhu Han","authorsParsed":[["Emami","Yousef",""],["Almeida","Luis",""],["Li","Kai",""],["Ni","Wei",""],["Han","Zhu",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 17:02:29 GMT"},{"version":"v2","created":"Sun, 8 Sep 2024 03:18:40 GMT"}],"updateDate":"2024-09-10","timestamp":1724346149000,"abstract":"  Rapid advances in Machine Learning (ML) have triggered new trends in\nAutonomous Vehicles (AVs). ML algorithms play a crucial role in interpreting\nsensor data, predicting potential hazards, and optimizing navigation\nstrategies. However, achieving full autonomy in cluttered and complex\nsituations, such as intricate intersections, diverse sceneries, varied\ntrajectories, and complex missions, is still challenging, and the cost of data\nlabeling remains a significant bottleneck. The adaptability and robustness of\nhumans in complex scenarios motivate the inclusion of humans in the ML process,\nleveraging their creativity, ethical power, and emotional intelligence to\nimprove ML effectiveness. The scientific community knows this approach as\nHuman-In-The-Loop Machine Learning (HITL-ML). Towards safe and ethical\nautonomy, we present a review of HITL-ML for AVs, focusing on Curriculum\nLearning (CL), Human-In-The-Loop Reinforcement Learning (HITL-RL), Active\nLearning (AL), and ethical principles. In CL, human experts systematically\ntrain ML models by starting with simple tasks and gradually progressing to more\ndifficult ones. HITL-RL significantly enhances the RL process by incorporating\nhuman input through techniques like reward shaping, action injection, and\ninteractive learning. AL streamlines the annotation process by targeting\nspecific instances that need to be labeled with human oversight, reducing the\noverall time and cost associated with training. Ethical principles must be\nembedded in AVs to align their behavior with societal values and norms. In\naddition, we provide insights and specify future research directions.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}