{"id":"2408.05040","title":"BoFire: Bayesian Optimization Framework Intended for Real Experiments","authors":"Johannes P. D\\\"urholt, Thomas S. Asche, Johanna Kleinekorte, Gabriel\n  Mancino-Ball, Benjamin Schiller, Simon Sung, Julian Keupp, Aaron Osburg, Toby\n  Boyne, Ruth Misener, Rosona Eldred, Wagner Steuer Costa, Chrysoula Kappatou,\n  Robert M. Lee, Dominik Linzner, David Walz, Niklas Wulkow, Behrang Shafei","authorsParsed":[["Dürholt","Johannes P.",""],["Asche","Thomas S.",""],["Kleinekorte","Johanna",""],["Mancino-Ball","Gabriel",""],["Schiller","Benjamin",""],["Sung","Simon",""],["Keupp","Julian",""],["Osburg","Aaron",""],["Boyne","Toby",""],["Misener","Ruth",""],["Eldred","Rosona",""],["Costa","Wagner Steuer",""],["Kappatou","Chrysoula",""],["Lee","Robert M.",""],["Linzner","Dominik",""],["Walz","David",""],["Wulkow","Niklas",""],["Shafei","Behrang",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 12:50:48 GMT"}],"updateDate":"2024-08-12","timestamp":1723207848000,"abstract":"  Our open-source Python package BoFire combines Bayesian Optimization (BO)\nwith other design of experiments (DoE) strategies focusing on developing and\noptimizing new chemistry. Previous BO implementations, for example as they\nexist in the literature or software, require substantial adaptation for\neffective real-world deployment in chemical industry. BoFire provides a rich\nfeature-set with extensive configurability and realizes our vision of\nfast-tracking research contributions into industrial use via maintainable\nopen-source software. Owing to quality-of-life features like\nJSON-serializability of problem formulations, BoFire enables seamless\nintegration of BO into RESTful APIs, a common architecture component for both\nself-driving laboratories and human-in-the-loop setups. This paper discusses\nthe differences between BoFire and other BO implementations and outlines ways\nthat BO research needs to be adapted for real-world use in a chemistry setting.\n","subjects":["Computing Research Repository/Machine Learning","Mathematics/Optimization and Control","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BZKNuzxwOc755HH2OkR3Ef3bavaIH-6TmMZivFmQEGM","pdfSize":"117088"}
