{"id":"2408.03313","title":"Ninety percent circular polarization detected in a repeating fast radio\n  burst","authors":"J. C. Jiang, J. W. Xu, J. R. Niu, K. J. Lee, W. W. Zhu, B. Zhang, Y.\n  Qu, H. Xu, D. J. Zhou, S. S. Cao, W. Y. Wang, B. J. Wang, S. Cao, Y. K.\n  Zhang, C. F. Zhang, H. Q. Gan, J. L. Han, L. F. Hao, Y. X. Huang, P. Jiang,\n  D. Z. Li, H. Li, Y. Li, Z. X. Li, R. Luo, Y. P. Men, L. Qian, J. H. Sun, L.\n  Wang, Y. H. Xu, R. X. Xu, Y. P. Yang, R. Yao, Y. L. Yue, D. J. Yu, J. P.\n  Yuan, Y. Zhu","authorsParsed":[["Jiang","J. C.",""],["Xu","J. W.",""],["Niu","J. R.",""],["Lee","K. J.",""],["Zhu","W. W.",""],["Zhang","B.",""],["Qu","Y.",""],["Xu","H.",""],["Zhou","D. J.",""],["Cao","S. S.",""],["Wang","W. Y.",""],["Wang","B. J.",""],["Cao","S.",""],["Zhang","Y. K.",""],["Zhang","C. F.",""],["Gan","H. Q.",""],["Han","J. L.",""],["Hao","L. F.",""],["Huang","Y. X.",""],["Jiang","P.",""],["Li","D. Z.",""],["Li","H.",""],["Li","Y.",""],["Li","Z. X.",""],["Luo","R.",""],["Men","Y. P.",""],["Qian","L.",""],["Sun","J. H.",""],["Wang","L.",""],["Xu","Y. H.",""],["Xu","R. X.",""],["Yang","Y. P.",""],["Yao","R.",""],["Yue","Y. L.",""],["Yu","D. J.",""],["Yuan","J. P.",""],["Zhu","Y.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 17:34:00 GMT"}],"updateDate":"2024-08-07","timestamp":1722965640000,"abstract":"  Fast radio bursts (FRBs) are extra-galactic sources with unknown physical\nmechanisms. They emit millisecond-duration radio pulses with isotropic\nequivalent energy of $10^{36}\\sim10^{41}$ ergs. This corresponds to a\nbrightness temperature of FRB emission typically reaching the level of\n$10^{36}$ K, but can be as high as above $10^{40}$ K for sub-microsecond\ntimescale structures, suggesting the presence of underlying coherent\nrelativistic radiation mechanisms. polarization carries the key information to\nunderstand the physical origin of FRBs, with linear polarization usually\ntracing the geometric configuration of magnetic fields and circular\npolarization probing both intrinsic radiation mechanisms and propagation\neffects. Here we show that the repeating sources FRB 20201124A emits $90.9\\pm\n1.1\\%$ circularly polarized radio pulses. Such a high degree of circular\npolarization was unexpected in theory and unprecedented in observation in the\ncase of FRBs, since such a high degree of circular polarization was only common\namong Solar or Jovian radio activities, attributed to the sub-relativistic\nelectrons. We note that there is no obvious correlation between the degree of\ncircular polarization and burst fluence. Besides the high degree of circular\npolarization, we also detected rapid swing and orthogonal jump in the position\nangle of linear polarization. The detection of the high degree circular\npolarization in FRB 20201124A, together with its linear polarization properties\nthat show orthogonal modes, place strong constraints on FRB physical\nmechanisms, calling for an interplay between magnetospheric radiation and\npropagation effects in shaping the observed FRB radiation.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}