{"id":"2408.15874","title":"Robust Statistical Scaling of Outlier Scores: Improving the Quality of\n  Outlier Probabilities for Outliers (Extended Version)","authors":"Philipp R\\\"ochner, Henrique O. Marques, Ricardo J. G. B. Campello,\n  Arthur Zimek, Franz Rothlauf","authorsParsed":[["Röchner","Philipp",""],["Marques","Henrique O.",""],["Campello","Ricardo J. G. B.",""],["Zimek","Arthur",""],["Rothlauf","Franz",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 15:44:34 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 11:18:08 GMT"}],"updateDate":"2024-09-02","timestamp":1724859874000,"abstract":"  Outlier detection algorithms typically assign an outlier score to each\nobservation in a dataset, indicating the degree to which an observation is an\noutlier. However, these scores are often not comparable across algorithms and\ncan be difficult for humans to interpret. Statistical scaling addresses this\nproblem by transforming outlier scores into outlier probabilities without using\nground-truth labels, thereby improving interpretability and comparability\nacross algorithms. However, the quality of this transformation can be different\nfor outliers and inliers. Missing outliers in scenarios where they are of\nparticular interest - such as healthcare, finance, or engineering - can be\ncostly or dangerous. Thus, ensuring good probabilities for outliers is\nessential. This paper argues that statistical scaling, as commonly used in the\nliterature, does not produce equally good probabilities for outliers as for\ninliers. Therefore, we propose robust statistical scaling, which uses robust\nestimators to improve the probabilities for outliers. We evaluate several\nvariants of our method against other outlier score transformations for\nreal-world datasets and outlier detection algorithms, where it can improve the\nprobabilities for outliers.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}