{"id":"2408.04749","title":"DaedalusData: Exploration, Knowledge Externalization and Labeling of\n  Particles in Medical Manufacturing -- A Design Study","authors":"Alexander Wyss, Gabriela Morgenshtern, Amanda Hirsch-H\\\"usler,\n  J\\\"urgen Bernard","authorsParsed":[["Wyss","Alexander",""],["Morgenshtern","Gabriela",""],["Hirsch-Hüsler","Amanda",""],["Bernard","Jürgen",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 20:27:26 GMT"}],"updateDate":"2024-08-12","timestamp":1723148846000,"abstract":"  In medical diagnostics of both early disease detection and routine patient\ncare, particle-based contamination of in-vitro diagnostics consumables poses a\nsignificant threat to patients. Objective data-driven decision-making on the\nseverity of contamination is key for reducing patient risk, while saving time\nand cost in quality assessment. Our collaborators introduced us to their\nquality control process, including particle data acquisition through image\nrecognition, feature extraction, and attributes reflecting the production\ncontext of particles. Shortcomings in the current process are limitations in\nexploring thousands of images, data-driven decision making, and ineffective\nknowledge externalization. Following the design study methodology, our\ncontributions are a characterization of the problem space and requirements, the\ndevelopment and validation of DaedalusData, a comprehensive discussion of our\nstudy's learnings, and a generalizable framework for knowledge externalization.\nDaedalusData is a visual analytics system that enables domain experts to\nexplore particle contamination patterns, label particles in label alphabets,\nand externalize knowledge through semi-supervised label-informed data\nprojections. The results of our case study and user study show high usability\nof DaedalusData and its efficient support of experts in generating\ncomprehensive overviews of thousands of particles, labeling of large quantities\nof particles, and externalizing knowledge to augment the dataset further.\nReflecting on our approach, we discuss insights on dataset augmentation via\nhuman knowledge externalization, and on the scalability and trade-offs that\ncome with the adoption of this approach in practice.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}