{"id":"2408.10401","title":"Spatial Knockoff Bayesian Variable Selection in Genome-Wide Association\n  Studies","authors":"Justin J. Van Ee, Diana Gamba, Jesse R. Lasky, Megan L. Vahsen, and\n  Mevin B. Hooten","authorsParsed":[["Van Ee","Justin J.",""],["Gamba","Diana",""],["Lasky","Jesse R.",""],["Vahsen","Megan L.",""],["Hooten","Mevin B.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 20:33:35 GMT"}],"updateDate":"2024-08-21","timestamp":1724099615000,"abstract":"  High-dimensional variable selection has emerged as one of the prevailing\nstatistical challenges in the big data revolution. Many variable selection\nmethods have been adapted for identifying single nucleotide polymorphisms\n(SNPs) linked to phenotypic variation in genome-wide association studies. We\ndevelop a Bayesian variable selection regression model for identifying SNPs\nlinked to phenotypic variation. We modify our Bayesian variable selection\nregression models to control the false discovery rate of SNPs using a knockoff\nvariable approach. We reduce spurious associations by regressing the phenotype\nof interest against a set of basis functions that account for the relatedness\nof individuals. Using a restricted regression approach, we simultaneously\nestimate the SNP-level effects while removing variation in the phenotype that\ncan be explained by population structure. We also accommodate the spatial\nstructure among causal SNPs by modeling their inclusion probabilities jointly\nwith a reduced rank Gaussian process. In a simulation study, we demonstrate\nthat our spatial Bayesian variable selection regression model controls the\nfalse discovery rate and increases power when the relevant SNPs are clustered.\nWe conclude with an analysis of Arabidopsis thaliana flowering time, a\npolygenic trait that is confounded with population structure, and find the\ndiscoveries of our method cluster near described flowering time genes.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}