{"id":"2408.03343","title":"A Modified Landau-de Gennes Theory for Smectic Liquid Crystals: Phase\n  Transitions and Structural Transitions","authors":"Baoming Shi, Yucen Han, Chengdi Ma, Apala Majumdar, Lei Zhang","authorsParsed":[["Shi","Baoming",""],["Han","Yucen",""],["Ma","Chengdi",""],["Majumdar","Apala",""],["Zhang","Lei",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:20:38 GMT"}],"updateDate":"2024-08-08","timestamp":1722439238000,"abstract":"  We study the behaviour of Smectic-A (SmA) liquid crystals with a modified\nLandau-de Gennes (mLdG) model. The director and orientational order of SmA are\ndescribed by a tensor-order parameter $\\mathbf{Q}$, and the positional order is\ndescribed by a real scalar $u$, which represents the deviation from the average\nconcentration of liquid crystal molecules. Firstly, we prove the existence and\nregularity of the global minimiser of the mLdG free energy. Then, we\nanalytically prove that the mLdG model can exhibit Isotropic-Nematic-Smectic\nphase transition in terms of the critical temperatures and stabilities of\nphases. Furthermore, we explore smectic configurations confined within a square\ndomain with edge length $\\lambda$. We analytically study the positional order\nfar from and near the defects and the limiting cases with $\\lambda\\to 0$ and\n$\\lambda\\to\\infty$, to potentially guide the behavior of SmA in finite domain\nsize.With finite $\\lambda$, we numerically recover BD-like and D-like states\nobserved in experiments. The stability of a BD-like state is enhanced by the\nlayer structure of positional order. The analogous $\\mathbf{Q}$ profile of\nD-like states in nematics and smectics indicates the memory of the director in\nthe N-S phase transition. We also study the frustrated smectic energy landscape\nand the strategy to alleviate the frustration.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}