{"id":"2408.17365","title":"Nonlinear dynamical Casimir effect and Unruh entanglement in waveguide\n  QED with parametrically modulated coupling","authors":"Egor S. Vyatkin, Alexander V. Poshakinskiy, Alexander N. Poddubny","authorsParsed":[["Vyatkin","Egor S.",""],["Poshakinskiy","Alexander V.",""],["Poddubny","Alexander N.",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 15:54:33 GMT"}],"updateDate":"2024-09-02","timestamp":1725033273000,"abstract":"  We study theoretically an array of two-level qubits moving relative to a\none-dimensional waveguide. This motion can be implemented mechanically or\nsimulated via the modulation of the couplings between the qubits and the\nwaveguide. When the frequency of this motion approaches twice the qubit\nresonance frequency, it induces parametric generation of photons and excitation\nof the qubits. The proposed quantum optomechanical system offers a plethora of\npossibilities for exploring various quantum electrodynamics phenomena. However,\ntheir theoretical analysis is challenging due to the presence of quantum\nnonlinearity, a continuum of propagating photonic modes, and the excitation of\nstrongly nonequilibrium qubit states, which make many conventional analytical\ntools inapplicable. To address these challenges, we develop a comprehensive\ngeneral theoretical framework that incorporates both perturbative diagrammatic\ntechniques and a rigorous master-equation approach. Our calculations reveal\nseveral intriguing effects, including the directional dynamical Casimir effect,\nwhere momenta of emitted photon pairs are correlated, and the\nwaveguide-mediated collective Unruh effect, where motion drives the qubits to a\nnontrivial steady state that can be entangled and exhibit phase transitions.\nAdditionally, we examine the radiation back-action on the qubit motion, which\nbecomes particularly pronounced when subradiant modes in the qubit array are\nexcited. The back-action can significantly alter the mechanical spectra,\npotentially leading to the formation of hybrid phonon-biphoton modes.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/General Relativity and Quantum Cosmology","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}