{"id":"2408.02655","title":"Local ergotropy and its fluctuations across a dissipative quantum phase\n  transition","authors":"G. Di Bello, D. Farina, D. Jansen, C. A. Perroni, V. Cataudella, and\n  G. De Filippis","authorsParsed":[["Di Bello","G.",""],["Farina","D.",""],["Jansen","D.",""],["Perroni","C. A.",""],["Cataudella","V.",""],["De Filippis","G.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 17:40:43 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 18:31:40 GMT"},{"version":"v3","created":"Thu, 22 Aug 2024 17:35:26 GMT"}],"updateDate":"2024-08-23","timestamp":1722879643000,"abstract":"  We investigate a two-qubit open Rabi model, focusing on local ergotropy--the\nmaximum extractable work by acting solely on the two qubits--within a parameter\nregime where a Berezinskii-Kosterlitz-Thouless dissipative phase transition\noccurs. First, we aim to define a protocol for charging, storing, and\ndischarging the two-qubit system, interpreted as the working principle of an\nopen quantum battery. Second, we examine the impact of the phase transition on\nergotropy and identify potential markers. To achieve these goals, we construct\nan ad-hoc charging unitary operator, leveraging our knowledge of the ground\nstate near the transition to bring it into a decoherence-free state during\nstorage. Using state-of-the-art numerics based on matrix product state\nrepresentation, we reveal that high couplings to an external bath approximately\ndouble the local ergotropy immediately post-charging. Over time we observe\noscillatory behaviors in ergotropy and its fluctuations, which undergo\nsignificant changes near the transition, signaling its occurrence. Furthermore,\nwe optimize local ergotropy over time using a physically inspired ansatz,\nenabling work extraction at a generic time (local ergotropy never reaches\nzero). Our work proposes a tunable, experimentally realizable protocol for work\nextraction, leveraging decoherence-free states and phase transitions.\nAdditionally, it sheds light on the complex interaction between local ergotropy\nand quantum phase transitions.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/"}