{"id":"2408.16709","title":"Hydrogen reaction rate modeling based on convolutional neural network\n  for large eddy simulation","authors":"Quentin Mal\\'e and Corentin J Lapeyre and Nicolas Noiray","authorsParsed":[["Malé","Quentin",""],["Lapeyre","Corentin J",""],["Noiray","Nicolas",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 17:05:10 GMT"}],"updateDate":"2024-08-30","timestamp":1724951110000,"abstract":"  This paper establishes a data-driven modeling framework for lean Hydrogen\n(H2)-air reaction rates for the Large Eddy Simulation (LES) of turbulent\nreactive flows. This is particularly challenging since H2 molecules diffuse\nmuch faster than heat, leading to large variations in burning rates,\nthermodiffusive instabilities at the subfilter scale, and complex\nturbulence-chemistry interactions. Our data-driven approach leverages a\nConvolutional Neural Network (CNN), trained to approximate filtered burning\nrates from emulated LES data. First, five different lean premixed turbulent\nH2-air flame Direct Numerical Simulations (DNSs) are computed each with a\nunique global equivalence ratio. Second, DNS snapshots are filtered and\ndownsampled to emulate LES data. Third, a CNN is trained to approximate the\nfiltered burning rates as a function of LES scalar quantities: progress\nvariable, local equivalence ratio and flame thickening due to filtering.\nFinally, the performances of the CNN model are assessed on test solutions never\nseen during training. The model retrieves burning rates with very high\naccuracy. It is also tested on two filter and downsampling parameters and two\nglobal equivalence ratios between those used during training. For these\ninterpolation cases, the model approximates burning rates with low error even\nthough the cases were not included in the training dataset. This a priori study\nshows that the proposed data-driven machine learning framework is able to\naddress the challenge of modeling lean premixed H2-air burning rates. It paves\nthe way for a new modeling paradigm for the simulation of carbon-free hydrogen\ncombustion systems.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5tiqK5Bpi_LY7cgI-dUHHjQ42BXaRh_-u5y4UfkwlEs","pdfSize":"2931265"}
