{"id":"2408.04699","title":"Artemis-enabled Stellar Imager (AeSI): A Lunar Long-Baseline UV/Optical\n  Imaging Interferometer","authors":"Gioia Rau, Kenneth G. Carpenter, Tabetha Boyajian, Michelle\n  Creech-Eakman, Julianne Foster, Margarita Karovska, David Leisawitz, Jon A.\n  Morse, David Mozurkewich, Sarah Peacock, Noah Petro, Paul Scowen, Breann\n  Sitarski, Gerard van Belle, Erik Wilkinson","authorsParsed":[["Rau","Gioia",""],["Carpenter","Kenneth G.",""],["Boyajian","Tabetha",""],["Creech-Eakman","Michelle",""],["Foster","Julianne",""],["Karovska","Margarita",""],["Leisawitz","David",""],["Morse","Jon A.",""],["Mozurkewich","David",""],["Peacock","Sarah",""],["Petro","Noah",""],["Scowen","Paul",""],["Sitarski","Breann",""],["van Belle","Gerard",""],["Wilkinson","Erik",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 18:00:05 GMT"}],"updateDate":"2024-08-12","timestamp":1723140005000,"abstract":"  NASA's return to the Moon presents unparalleled opportunities to advance\nhigh-impact scientific capabilities. At the cutting edge of these possibilities\nare extremely high-resolution interferometric observations at visible and\nultraviolet wavelengths. Such technology can resolve the surfaces of stars,\nexplore the inner accretion disks of nascent stars and black holes, and\neventually enable us to observe surface features and weather patterns on nearby\nexoplanets. We have been awarded Phase 1 support from NASA's Innovative\nAdvanced Concepts (NIAC) program to explore the feasibility of constructing a\nhigh-resolution, long-baseline UV/optical imaging interferometer on the lunar\nsurface, in conjunction with the Artemis Program. A 1996 study comparing\ninterferometers on the Moon versus free-flyers in space concluded that, without\npre-existing lunar infrastructure, free-flyers were preferable. However, with\nthe advent of the Artemis Program, it is now crucial to revisit the potential\nof building lunar interferometers. Our objective is to conduct a study with the\nsame level of rigor applied to large baseline, free-flying interferometers\nduring the 2003-2005 NASA Vision Missions Studies. This preparation is\nessential for timely and effective utilization of the forthcoming lunar\ninfrastructure. In this paper, we highlight the groundbreaking potential of a\nlunar surface-based interferometer. This concept study will be a huge step\nforward to larger arrays on both the moon and free-flying in space, over a wide\nvariety of wavelengths and science topics. Our Phase 1 study began in April\n2024, and here we present a concise overview of our vision and the progress\nmade so far.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}