{"id":"2408.15344","title":"Conformal Disentanglement: A Neural Framework for Perspective Synthesis\n  and Differentiation","authors":"George A. Kevrekidis, Eleni D. Koronaki, Yannis G. Kevrekidis","authorsParsed":[["Kevrekidis","George A.",""],["Koronaki","Eleni D.",""],["Kevrekidis","Yannis G.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 18:06:45 GMT"}],"updateDate":"2024-08-29","timestamp":1724782005000,"abstract":"  For multiple scientific endeavors it is common to measure a phenomenon of\ninterest in more than one ways. We make observations of objects from several\ndifferent perspectives in space, at different points in time; we may also\nmeasure different properties of a mixture using different types of instruments.\nAfter collecting this heterogeneous information, it is necessary to be able to\nsynthesize a complete picture of what is `common' across its sources: the\nsubject we ultimately want to study. However, isolated (`clean') observations\nof a system are not always possible: observations often contain information\nabout other systems in its environment, or about the measuring instruments\nthemselves. In that sense, each observation may contain information that `does\nnot matter' to the original object of study; this `uncommon' information\nbetween sensors observing the same object may still be important, and\ndecoupling it from the main signal(s) useful. We introduce a neural network\nautoencoder framework capable of both tasks: it is structured to identify\n`common' variables, and, making use of orthogonality constraints to define\ngeometric independence, to also identify disentangled `uncommon' information\noriginating from the heterogeneous sensors. We demonstrate applications in\nseveral computational examples.\n","subjects":["Computing Research Repository/Machine Learning","Mathematics/Dynamical Systems"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"WPGs48BVgkOi9MP972L9QlnkVIeabaRzg2uoSUTN0vk","pdfSize":"5729099"}
