{"id":"2408.03333","title":"A Modal Analysis of Electromagnetic Fields Coupling into an Open-Ended\n  Waveguide Mounted on a Finite Flange: Evaluation of a Rectangular Waveguide\n  with a Square Flange","authors":"Mohammad Eskandari and Mojtaba Joodaki","authorsParsed":[["Eskandari","Mohammad",""],["Joodaki","Mojtaba",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 13:33:49 GMT"}],"updateDate":"2024-08-08","timestamp":1721482429000,"abstract":"  This paper presents a modal analysis based on the reciprocity theorem to\ncalculate the coupled/penetrated fields into an open-ended waveguide mounted on\na finite flange. Although there is no limitation on the geometry and type of\nthe external source, an infinitesimal dipole is chosen to produce a plane wave\nincident to the waveguide aperture. The proposed method relates the amplitude\nof each penetrated mode into the waveguide to the far-field radiation\ncomponents of that mode from the waveguide aperture. The accuracy of the final\nresult depends on the accuracy of the calculated radiated fields. The radiated\nfield components are calculated considering the reflected fields due to the\naperture and the diffracted fields due to the flange edges. For the first time,\nthe impact of a finite flange on the penetrated fields into a waveguide is\ndiscussed comprehensively. The geometry of a rectangular waveguide mounted on a\nthick square flange is selected to be evaluated. The effects of changing the\nmain parameters of the geometry on the penetrated fields are discussed\nrigorously in various examples. Our results are compared with 3D full-wave\nsimulations, and an excellent agreement was found between the results while our\nanalytical approach showing a 60 times faster performance. In addition, we\ncompared our results with the measurement reported in a previous study.\n","subjects":["Physics/Applied Physics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Physics/Instrumentation and Detectors","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}