{"id":"2408.09532","title":"Deep Limit Model-free Prediction in Regression","authors":"Kejin Wu and Dimitris N. Politis","authorsParsed":[["Wu","Kejin",""],["Politis","Dimitris N.",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 16:37:53 GMT"},{"version":"v2","created":"Fri, 6 Sep 2024 17:27:10 GMT"},{"version":"v3","created":"Wed, 11 Sep 2024 23:30:45 GMT"}],"updateDate":"2024-09-13","timestamp":1723999073000,"abstract":"  In this paper, we provide a novel Model-free approach based on Deep Neural\nNetwork (DNN) to accomplish point prediction and prediction interval under a\ngeneral regression setting. Usually, people rely on parametric or\nnon-parametric models to bridge dependent and independent variables (Y and X).\nHowever, this classical method relies heavily on the correct model\nspecification. Even for the non-parametric approach, some additive form is\noften assumed. A newly proposed Model-free prediction principle sheds light on\na prediction procedure without any model assumption. Previous work regarding\nthis principle has shown better performance than other standard alternatives.\nRecently, DNN, one of the machine learning methods, has received increasing\nattention due to its great performance in practice. Guided by the Model-free\nprediction idea, we attempt to apply a fully connected forward DNN to map X and\nsome appropriate reference random variable Z to Y. The targeted DNN is trained\nby minimizing a specially designed loss function so that the randomness of Y\nconditional on X is outsourced to Z through the trained DNN. Our method is more\nstable and accurate compared to other DNN-based counterparts, especially for\noptimal point predictions. With a specific prediction procedure, our prediction\ninterval can capture the estimation variability so that it can render a better\ncoverage rate for finite sample cases. The superior performance of our method\nis verified by simulation and empirical studies.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/"}