{"id":"2408.14707","title":"Sub-Riemannian Geometry, Mixing, and the Holonomy of Optimal Mass\n  Transport","authors":"Mahmoud Abdelgalil and Tryphon T. Georgiou","authorsParsed":[["Abdelgalil","Mahmoud",""],["Georgiou","Tryphon T.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 00:22:23 GMT"}],"updateDate":"2024-08-28","timestamp":1724718143000,"abstract":"  The theory of Monge-Kantorovich Optimal Mass Transport (OMT) has in recent\nyears spurred a fast developing phase of research in stochastic control,\ncontrol of ensemble systems, thermodynamics, data science, and several other\nfields in engineering and science. Specifically, OMT endowed the space of\nprobability distributions with a rich Riemannian-like geometry, the Wasserstein\ngeometry and the Wasserstein $\\mathcal W_2$-metric. This geometry proved\nfruitful in quantifying and regulating the uncertainty of deterministic and\nstochastic systems, and in dealing with problems related to the transport of\nensembles in continuous and discrete spaces.\n  We herein introduce a new type of transportation problems. The salient\nfeature of these problems is that particles/agents in the ensemble, that are to\nbe transported, are labeled and their relative position along their journey is\nof interest. Of particular importance in our program are closed orbits where\nparticles return to their original place after being transported along closed\npaths. Thereby, control laws are sought so that the distribution of the\nensemble traverses a closed orbit in the Wasserstein manifold without mixing.\nThis feature is in contrast with the classical theory of optimal transport\nwhere the primary object of study is the path of probability densities, without\nany concern about mixing of the flow, which is expected and allowed when\ntraversing curves in the Wasserstein space.\n  In the theory that we present, we explore a hitherto unstudied sub-Riemannian\nstructure of Monge-Kantorovich transport where the relative position of\nparticles along their journey is modeled by the holonomy of the transportation\nschedule. From this vantage point, we discuss several other problems of\nindependent interest.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}