{"id":"2408.13108","title":"Logarithmic morphisms, tangential basepoints, and little disks","authors":"Cl\\'ement Dupont, Erik Panzer, and Brent Pym","authorsParsed":[["Dupont","Clément",""],["Panzer","Erik",""],["Pym","Brent",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 14:33:29 GMT"}],"updateDate":"2024-08-26","timestamp":1724423609000,"abstract":"  We develop the theory of ``virtual morphisms'' in logarithmic algebraic\ngeometry, introduced by Howell. It allows one to give algebro-geometric meaning\nto various useful maps of topological spaces that do not correspond to\nmorphisms of (log) schemes in the classical sense, while retaining\nfunctoriality of key constructions. In particular, we explain how virtual\nmorphisms provide a natural categorical home for Deligne's theory of tangential\nbasepoints: the latter are simply the virtual morphisms from a point. We also\nextend Howell's results on the functoriality of Betti and de Rham cohomology.\n  Using this framework, we lift the topological operad of little $2$-disks to\nan operad in log schemes over the integers, whose virtual points are\nisomorphism classes of stable marked curves of genus zero equipped with a\ntangential basepoint. The gluing of such curves along marked points is\nperformed using virtual morphisms that transport tangential basepoints around\nthe curves. This builds on Vaintrob's analogous construction for framed little\ndisks, for which the classical notion of morphism in logarithmic geometry\nsufficed. In this way, we obtain a direct algebro-geometric proof of the\nformality of the little disks operad, following the strategy envisioned by\nBeilinson. Furthermore, Bar-Natan's parenthesized braids naturally appear as\nthe fundamental groupoids of our moduli spaces, with all virtual basepoints\ndefined over the integers.\n","subjects":["Mathematics/Algebraic Geometry","Mathematics/Algebraic Topology","Mathematics/Number Theory","Mathematics/Quantum Algebra"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}