{"id":"2408.01752","title":"Advancing Green AI: Efficient and Accurate Lightweight CNNs for Rice\n  Leaf Disease Identification","authors":"Khairun Saddami, Yudha Nurdin, Mutia Zahramita, Muhammad Shahreeza\n  Safiruz","authorsParsed":[["Saddami","Khairun",""],["Nurdin","Yudha",""],["Zahramita","Mutia",""],["Safiruz","Muhammad Shahreeza",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 11:16:00 GMT"}],"updateDate":"2024-08-06","timestamp":1722683760000,"abstract":"  Rice plays a vital role as a primary food source for over half of the world's\npopulation, and its production is critical for global food security.\nNevertheless, rice cultivation is frequently affected by various diseases that\ncan severely decrease yield and quality. Therefore, early and accurate\ndetection of rice diseases is necessary to prevent their spread and minimize\ncrop losses. In this research, we explore three mobile-compatible CNN\narchitectures, namely ShuffleNet, MobileNetV2, and EfficientNet-B0, for rice\nleaf disease classification. These models are selected due to their\ncompatibility with mobile devices, as they demand less computational power and\nmemory compared to other CNN models. To enhance the performance of the three\nmodels, we added two fully connected layers separated by a dropout layer. We\nused early stop creation to prevent the model from being overfiting. The\nresults of the study showed that the best performance was achieved by the\nEfficientNet-B0 model with an accuracy of 99.8%. Meanwhile, MobileNetV2 and\nShuffleNet only achieved accuracies of 84.21% and 66.51%, respectively. This\nstudy shows that EfficientNet-B0 when combined with the proposed layer and\nearly stop, can produce a high-accuracy model.\n  Keywords: rice leaf detection; green AI; smart agriculture; EfficientNet;\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}