{"id":"2408.01038","title":"UNER: A Unified Prediction Head for Named Entity Recognition in\n  Visually-rich Documents","authors":"Yi Tu, Chong Zhang, Ya Guo, Huan Chen, Jinyang Tang, Huijia Zhu, Qi\n  Zhang","authorsParsed":[["Tu","Yi",""],["Zhang","Chong",""],["Guo","Ya",""],["Chen","Huan",""],["Tang","Jinyang",""],["Zhu","Huijia",""],["Zhang","Qi",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 06:21:36 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 03:44:13 GMT"}],"updateDate":"2024-08-13","timestamp":1722579696000,"abstract":"  The recognition of named entities in visually-rich documents (VrD-NER) plays\na critical role in various real-world scenarios and applications. However, the\nresearch in VrD-NER faces three major challenges: complex document layouts,\nincorrect reading orders, and unsuitable task formulations. To address these\nchallenges, we propose a query-aware entity extraction head, namely UNER, to\ncollaborate with existing multi-modal document transformers to develop more\nrobust VrD-NER models. The UNER head considers the VrD-NER task as a\ncombination of sequence labeling and reading order prediction, effectively\naddressing the issues of discontinuous entities in documents. Experimental\nevaluations on diverse datasets demonstrate the effectiveness of UNER in\nimproving entity extraction performance. Moreover, the UNER head enables a\nsupervised pre-training stage on various VrD-NER datasets to enhance the\ndocument transformer backbones and exhibits substantial knowledge transfer from\nthe pre-training stage to the fine-tuning stage. By incorporating universal\nlayout understanding, a pre-trained UNER-based model demonstrates significant\nadvantages in few-shot and cross-linguistic scenarios and exhibits zero-shot\nentity extraction abilities.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SuJkCOaOOkAn2se9QqCLW0iaqRsdjK7pkCWlTdD0erY","pdfSize":"2401648","txDigest":"3rZiMV7AZhu7diGU5FrQ1D37ML7fvkub5Nf4mXD1bfvo","endEpoch":"1","status":"CERTIFIED"}
