{"id":"2408.00625","title":"Nitrogen Loss from Pluto's Birth to the Present Day via Atmospheric\n  Escape, Photochemical Destruction, and Impact Erosion","authors":"Perianne E. Johnson, Leslie A. Young, David Nesvorny, Xi Zhang","authorsParsed":[["Johnson","Perianne E.",""],["Young","Leslie A.",""],["Nesvorny","David",""],["Zhang","Xi",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 15:09:40 GMT"}],"updateDate":"2024-08-02","timestamp":1722524980000,"abstract":"  We estimate the loss of nitrogen from Pluto over its lifetime, including the\ngiant planet instability period, which we term the \"Wild Years.\" We analyze the\norbital migration of 53 simulated Plutinos, which are Kuiper Belt Objects\n(KBOs) captured into 3:2 mean-motion resonance with Neptune during the\ninstability. This orbital migration brought the Plutinos from 20 to 30 au to\ntheir present-day orbits near 40 au along a nonlinear path that includes orbits\nwith semimajor axes from 10 to 100 au. We model the thermal history that\nresults from this migration and estimate the volatile loss rates due to the\never-changing thermal environment. Due to the early Sun's enhanced ultraviolet\nradiation, the photochemical destruction rate during the Wild Years was a\nfactor of 100 higher than the present-day rate, but this only results in a loss\nof ~10 m global equivalent layer (GEL). The enhanced Jeans escape rate varies\nwildly with time, and a net loss of ~100 cm GEL is predicted. Additionally, we\nmodel the impact history during the migration and find that impacts are a net\nsource, not loss, of N2, contributing ~100 cm GEL. The 100 cm GEL is 0.1% of\nthe amount of N2 in Sputnik Planitia. We therefore conclude that Pluto did not\nlose an excessive amount of volatiles during the Wild Years, and its primordial\nvolatile inventory can be approximated as its present-day inventory. However,\nsignificant fractions of this small total loss of N2 occurred during the Wild\nYears, so estimates made using present-day rates will be underestimates.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tPN8wGaDVBn-2-rkFRQEx6uWKrHIWvdKg05zOZNZ718","pdfSize":"1791880","txDigest":"DQSFyzrj8nzxKGNUgLxhE3odZy99jhiHqmSrxFPfAmK3","endEpoch":"1","status":"CERTIFIED"}
