{"id":"2408.07434","title":"Object Augmentation Algorithm: Computing virtual object motion and\n  object induced interaction wrench from optical markers","authors":"Christopher Herneth, Junnan Li, Muhammad Hilman Fatoni, Amartya\n  Ganguly, and Sami Haddadin","authorsParsed":[["Herneth","Christopher",""],["Li","Junnan",""],["Fatoni","Muhammad Hilman",""],["Ganguly","Amartya",""],["Haddadin","Sami",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 10:09:00 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 07:35:14 GMT"}],"updateDate":"2024-08-28","timestamp":1723630140000,"abstract":"  This study addresses the critical need for diverse and comprehensive data\nfocused on human arm joint torques while performing activities of daily living\n(ADL). Previous studies have often overlooked the influence of objects on joint\ntorques during ADL, resulting in limited datasets for analysis. To address this\ngap, we propose an Object Augmentation Algorithm (OAA) capable of augmenting\nexisting marker-based databases with virtual object motions and object-induced\njoint torque estimations. The OAA consists of five phases: (1) computing hand\ncoordinate systems from optical markers, (2) characterising object movements\nwith virtual markers, (3) calculating object motions through inverse kinematics\n(IK), (4) determining the wrench necessary for prescribed object motion using\ninverse dynamics (ID), and (5) computing joint torques resulting from object\nmanipulation. The algorithm's accuracy is validated through trajectory tracking\nand torque analysis on a 7+4 degree of freedom (DoF) robotic hand-arm system,\nmanipulating three unique objects. The results show that the OAA can accurately\nand precisely estimate 6 DoF object motion and object-induced joint torques.\nCorrelations between computed and measured quantities were > 0.99 for object\ntrajectories and > 0.93 for joint torques. The OAA was further shown to be\nrobust to variations in the number and placement of input markers, which are\nexpected between databases. Differences between repeated experiments were minor\nbut significant (p < 0.05). The algorithm expands the scope of available data\nand facilitates more comprehensive analyses of human-object interaction\ndynamics.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}