{"id":"2408.07667","title":"Possible wormholes in $f(R)$ gravity sourced by solitonic quantum wave\n  and cold dark matter halos and their repulsive gravity effect","authors":"Abdelghani Errehymy, Youssef Khedif, Orhan Donmez, Mohammed Daoud,\n  Kairat Myrzakulov, Sabit Bekov","authorsParsed":[["Errehymy","Abdelghani",""],["Khedif","Youssef",""],["Donmez","Orhan",""],["Daoud","Mohammed",""],["Myrzakulov","Kairat",""],["Bekov","Sabit",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 17:03:16 GMT"}],"updateDate":"2024-08-15","timestamp":1723654996000,"abstract":"  In this paper, we present new generalized wormhole (WH) solutions within the\ncontext of $f(R)$ gravity. Specifically, we focus on $f(R)$ gravitational\ntheories formulated in the metric formalism, with our investigation centered on\na power-law form represented by $f(R) = \\epsilon R^{\\chi}$. Here, $\\epsilon$ is\nan arbitrary constant, and $\\chi$ is a real number. Notably, this form\npossesses the advantageous property of reducing to Einstein gravity when\n$\\epsilon=1$ and $\\chi=1$. To obtain these novel WH solutions, we establish the\ngeneral field equations for any $f(R)$ theory within the framework of\nMorris-Thorne spacetime, assuming metric coefficients that are independent of\ntime. By utilizing an anisotropic matter source and a specific type of energy\ndensity associated with solitonic quantum wave (SQW) and cold dark matter (CDM)\nhalos, we calculate two distinct WH solutions. We thoroughly investigate the\nproperties of the exotic matter (ExoM) residing within the WH geometry and\nanalyze the matter contents through energy conditions (ECs). Both analytical\nand graphical methods are employed in this analysis to examine the validity of\ndifferent regions. Notably, the calculated shape functions for the WH geometry\nsatisfy the necessary conditions in both scenarios, emphasizing their\nreliability. This ExoM is characterized by an energy-momentum tensor that\nviolates the null energy condition (NEC) and, consequently, the weak energy\ncondition as well, in the vicinity of the WH throats. Furthermore, we\ninvestigated the repulsive effect of gravity and discovered that its presence\nresults in a negative deflection angle for photons following null geodesics.\nImportantly, we observed that the deflection angle consistently exhibits\nnegative values across all $r_0$ values in both scenarios, indicating the\nmanifestation of the repulsive gravity effect.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}