{"id":"2408.11818","title":"Extended quantum anomalous Hall effect in moir\\'e structures: phase\n  transitions and transport","authors":"Adarsh S. Patri, Zhihuan Dong, T. Senthil","authorsParsed":[["Patri","Adarsh S.",""],["Dong","Zhihuan",""],["Senthil","T.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 17:59:55 GMT"},{"version":"v2","created":"Sun, 8 Sep 2024 17:05:06 GMT"}],"updateDate":"2024-09-10","timestamp":1724263195000,"abstract":"  Recent experiments on multilayer rhombohedral graphene have unearthed a\nnumber of interesting phenomena in the regime where Integer and Fractional\nQuantum Anomalous Hall phenomena were previously reported. Specifically at low\ntemperature ($T$) and low applied currents, an \"Extended\" Integer Quantum\nAnomalous Hall (EIQAH) is seen over a wide range of the phase diagram. As the\ncurrent is increased, at low $T$, the EIQAH undergoes a phase transition to a\nmetallic state at generic fillings, and to the fractional quantum anomalous\nHall (FQAH) state at the Jain fillings. Increasing temperature at the Jain\nfillings also leads to an evolution out of the EIQAH to the Jain state. Here we\nprovide an interpretation of many of these observations. We describe the EIQAH\nas a crystalline state (either of holes doped into the $\\nu = 1$ state, or an\nAnomalous Hall Crystal of electrons) that breaks moir\\'e translation symmetry.\nAt generic fillings, we show how an electric current-induced depinning\ntransition of the crystalline order leads to peculiar non-linear\ncurrent-voltage curves consistent with the experiment. At Jain fillings, we\npropose that the depinning transition is pre-empted by an equilibrium\ntransition between EIQAH and Jain FQAH states. This transition occurs due to\nthe large polarizability of the Jain FQAH states which enables them to lower\ntheir energy effectively in an applied electric field compared to the crystal\nstates. We also discuss the finite temperature evolution in terms of the\nrelative entropies of the crystalline and FQAH states.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}