{"id":"2408.13574","title":"PointDGMamba: Domain Generalization of Point Cloud Classification via\n  Generalized State Space Model","authors":"Hao Yang, Qianyu Zhou, Haijia Sun, Xiangtai Li, Fengqi Liu, Xuequan\n  Lu, Lizhuang Ma, Shuicheng Yan","authorsParsed":[["Yang","Hao",""],["Zhou","Qianyu",""],["Sun","Haijia",""],["Li","Xiangtai",""],["Liu","Fengqi",""],["Lu","Xuequan",""],["Ma","Lizhuang",""],["Yan","Shuicheng",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 12:53:48 GMT"}],"updateDate":"2024-08-27","timestamp":1724504028000,"abstract":"  Domain Generalization (DG) has been recently explored to improve the\ngeneralizability of point cloud classification (PCC) models toward unseen\ndomains. However, they often suffer from limited receptive fields or quadratic\ncomplexity due to the use of convolution neural networks or vision\nTransformers. In this paper, we present the first work that studies the\ngeneralizability of state space models (SSMs) in DG PCC and find that directly\napplying SSMs into DG PCC will encounter several challenges: the inherent\ntopology of the point cloud tends to be disrupted and leads to noise\naccumulation during the serialization stage. Besides, the lack of designs in\ndomain-agnostic feature learning and data scanning will introduce unanticipated\ndomain-specific information into the 3D sequence data. To this end, we propose\na novel framework, PointDGMamba, that excels in strong generalizability toward\nunseen domains and has the advantages of global receptive fields and efficient\nlinear complexity. PointDGMamba consists of three innovative components: Masked\nSequence Denoising (MSD), Sequence-wise Cross-domain Feature Aggregation\n(SCFA), and Dual-level Domain Scanning (DDS). In particular, MSD selectively\nmasks out the noised point tokens of the point cloud sequences, SCFA introduces\ncross-domain but same-class point cloud features to encourage the model to\nlearn how to extract more generalized features. DDS includes intra-domain\nscanning and cross-domain scanning to facilitate information exchange between\nfeatures. In addition, we propose a new and more challenging benchmark\nPointDG-3to1 for multi-domain generalization. Extensive experiments demonstrate\nthe effectiveness and state-of-the-art performance of our presented\nPointDGMamba.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}