{"id":"2408.13545","title":"IQA-EVAL: Automatic Evaluation of Human-Model Interactive Question\n  Answering","authors":"Ruosen Li, Barry Wang, Ruochen Li, Xinya Du","authorsParsed":[["Li","Ruosen",""],["Wang","Barry",""],["Li","Ruochen",""],["Du","Xinya",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 10:34:20 GMT"}],"updateDate":"2024-08-27","timestamp":1724495660000,"abstract":"  To evaluate Large Language Models (LLMs) for question answering (QA),\ntraditional methods typically focus on directly assessing the immediate\nresponses generated by the models based on the given question and context. In\nthe common use case of humans seeking AI assistant's help in finding\ninformation, these non-interactive evaluations do not account for the dynamic\nnature of human-model conversations, and interaction-aware evaluations have\nshown that accurate QA models are preferred by humans (Lee et al., 2023).\nRecent works in human-computer interaction (HCI) have employed human evaluators\nto conduct interactions and evaluations, but they are often prohibitively\nexpensive and time-consuming to scale. In this work, we introduce an automatic\nevaluation framework IQA-EVAL to Interactive Question Answering Evaluation.\nMore specifically, we introduce LLM-based Evaluation Agent (LEA) that can: (1)\nsimulate human behaviors to generate interactions with IQA models; (2)\nautomatically evaluate the generated interactions. Moreover, we propose\nassigning personas to LEAs to better simulate groups of real human evaluators.\nWe show that: (1) our evaluation framework with GPT-4 (or Claude) as the\nbackbone model achieves a high correlation with human evaluations on the IQA\ntask; (2) assigning personas to LEA to better represent the crowd further\nsignificantly improves correlations. Finally, we use our automatic metric to\nevaluate five recent representative LLMs with over 1000 questions from complex\nand ambiguous question answering tasks, which comes with a substantial cost of\n$5k if evaluated by humans.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}