{"id":"2408.14379","title":"Synergistic and Efficient Edge-Host Communication for Energy Harvesting\n  Wireless Sensor Networks","authors":"Cyan Subhra Mishra, Jack Sampson, Mahmut Taylan Kandmeir,\n  Vijaykrishnan Narayanan, Chita R Das","authorsParsed":[["Mishra","Cyan Subhra",""],["Sampson","Jack",""],["Kandmeir","Mahmut Taylan",""],["Narayanan","Vijaykrishnan",""],["Das","Chita R",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 16:00:40 GMT"}],"updateDate":"2024-08-28","timestamp":1724688040000,"abstract":"  There is an increasing demand for intelligent processing on ultra-low-power\ninternet of things (IoT) device. Recent works have shown substantial efficiency\nboosts by executing inferences directly on the IoT device (node) rather than\ntransmitting data. However, the computation and power demands of Deep Neural\nNetwork (DNN)-based inference pose significant challenges in an\nenergy-harvesting wireless sensor network (EH-WSN). Moreover, these tasks often\nrequire responses from multiple physically distributed EH sensor nodes, which\nimpose crucial system optimization challenges in addition to per-node\nconstraints. To address these challenges, we propose Seeker, a\nhardware-software co-design approach for increasing on-sensor computation,\nreducing communication volume, and maximizing inference completion, without\nviolating the quality of service, in EH-WSNs coordinated by a mobile device.\nSeeker uses a store-and-execute approach to complete a subset of inferences on\nthe EH sensor node, reducing communication with the mobile host. Further, for\nthose inferences unfinished because of the harvested energy constraints, it\nleverages task-aware coreset construction to efficiently communicate compact\nfeatures to the host device. We evaluate Seeker for human activity recognition,\nas well as predictive maintenance and show ~8.9x reduction in communication\ndata volume with 86.8% accuracy, surpassing the 81.2% accuracy of the\nstate-of-the-art.\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}