{"id":"2408.03526","title":"Minimum Enclosing Ball Synthetic Minority Oversampling Technique from a\n  Geometric Perspective","authors":"Yi-Yang Shangguan, Shi-Shun Chen and Xiao-Yang Li","authorsParsed":[["Shangguan","Yi-Yang",""],["Chen","Shi-Shun",""],["Li","Xiao-Yang",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 03:37:25 GMT"}],"updateDate":"2024-08-08","timestamp":1723001845000,"abstract":"  Class imbalance refers to the significant difference in the number of samples\nfrom different classes within a dataset, making it challenging to identify\nminority class samples correctly. This issue is prevalent in real-world\nclassification tasks, such as software defect prediction, medical diagnosis,\nand fraud detection. The synthetic minority oversampling technique (SMOTE) is\nwidely used to address class imbalance issue, which is based on interpolation\nbetween randomly selected minority class samples and their neighbors. However,\ntraditional SMOTE and most of its variants only interpolate between existing\nsamples, which may be affected by noise samples in some cases and synthesize\nsamples that lack diversity. To overcome these shortcomings, this paper\nproposes the Minimum Enclosing Ball SMOTE (MEB-SMOTE) method from a geometry\nperspective. Specifically, MEB is innovatively introduced into the oversampling\nmethod to construct a representative point. Then, high-quality samples are\nsynthesized by interpolation between this representative point and the existing\nsamples. The rationale behind constructing a representative point is discussed,\ndemonstrating that the center of MEB is more suitable as the representative\npoint. To exhibit the superiority of MEB-SMOTE, experiments are conducted on 15\nreal-world imbalanced datasets. The results indicate that MEB-SMOTE can\neffectively improve the classification performance on imbalanced datasets.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computational Geometry"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qFWTK129uYMyn2A_YxkAsFtsf9Hm4gyNWmZQTNqqFF8","pdfSize":"749675"}
