{"id":"2408.03278","title":"The characterisation of water ice in debris discs: implications for JWST\n  scattered light observations","authors":"Minjae Kim and Grant M. Kennedy and Veronica Roccatagliata","authorsParsed":[["Kim","Minjae",""],["Kennedy","Grant M.",""],["Roccatagliata","Veronica",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 16:20:23 GMT"}],"updateDate":"2024-08-07","timestamp":1722961223000,"abstract":"  Water ice plays a crucial role throughout the different stages of planetary\nevolution and is abundant in the Universe. However, its presence and nature in\ndebris discs of exoplanetary systems are not yet strongly established\nobservationally. In this study, we quantify and discuss the impact of ice\nparameters such as volume fraction ${\\mathcal{F}}_{\\rm ice}$, blow-out grain\nsize, size distribution, and its phase on the observational appearance of\ndebris discs, considering the diverse nature of these systems around stellar\nspectral types ranging from A to M. Our findings reveal that the prominent ice\nfeatures at approximately 2.7 and 3.3\\,$\\mu$m depend on both the water ice\nfraction ${\\mathcal{F}}_{\\rm ice}$ and the scattering angle, with\nbackscattering geometries yielding the most prominent signatures. When the\nphase function is considered and data are not background limited, strong\nforward and backward scattering (near edge-on discs) are expected to yield the\nstrongest detections in images/spectra for A or F-type stars, while scattering\nangle matters less for later type stars. The Fresnel peak at 3.1\\,$\\mu$m serves\nas a viable discriminant for the transitional phase (crystalline/amorphous),\nwhile simultaneously constraining the water ice temperature. For JWST imaging,\nwe find that the F356W and F444W filter combination is most effective for\nconstraining the grain size distribution, while the F356W and F277W filter\ncombination provides better constraints on the ice fraction ${\\mathcal{F}}_{\\rm\nice}$ in debris discs. However, degeneracy between the grain size distribution\nand ice fraction when using photometric flux ratios means that obtaining robust\nconstraints will likely require more than two filters, or spectroscopic data.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"INESsiCZv2uRQWRLTlUBSTRphBACrKb0Qodq5QCxcPM","pdfSize":"4123366"}
