{"id":"2408.17252","title":"A Homogeneous Graph Neural Network for Precoding and Power Allocation in\n  Scalable Wireless Networks","authors":"Mingjun Sun, Zeng Li, Shaochuan Wu, Yuanwei Liu, Guoyu Li, Tong Zhang","authorsParsed":[["Sun","Mingjun",""],["Li","Zeng",""],["Wu","Shaochuan",""],["Liu","Yuanwei",""],["Li","Guoyu",""],["Zhang","Tong",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 12:51:51 GMT"}],"updateDate":"2024-09-02","timestamp":1725022311000,"abstract":"  Deep learning is widely used in wireless communications but struggles with\nfixed neural network sizes, which limit their adaptability in environments\nwhere the number of users and antennas varies. To overcome this, this paper\nintroduced a generalization strategy for precoding and power allocation in\nscalable wireless networks. Initially, we employ an innovative approach to\nabstract the wireless network into a homogeneous graph. This primarily focuses\non bypassing the heterogeneous features between transmitter (TX) and user\nentities to construct a virtual homogeneous graph serving optimization\nobjectives, thereby enabling all nodes in the virtual graph to share the same\nneural network. This \"TX entity\" is known as a base station (BS) in cellular\nnetworks and an access point (AP) in cell-free networks. Subsequently, we\ndesign a universal graph neural network, termed the information carrying graph\nneural network (ICGNN), to capture and integrate information from this graph,\nmaintaining permutation invariance. Lastly, using ICGNN as the core algorithm,\nwe tailor the neural network's input and output for specific problem\nrequirements and validate its performance in two scenarios: 1) in cellular\nnetworks, we develop a matrix-inverse-free multi-user multi-input multi-output\n(MU-MIMO) precoding scheme using the conjugate gradient (CG) method, adaptable\nto varying user and antenna numbers; 2) in a cell-free network, facing dynamic\nvariations in the number of users served by APs, the number of APs serving each\nuser, and the number of antennas per AP, we propose a universal power\nallocation scheme. Simulations demonstrate that the proposed approach not only\nsignificantly reduces computational complexity but also achieves, and\npotentially exceeds, the spectral efficiency (SE) of conventional algorithms.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}