{"id":"2408.01857","title":"Using Linearized Optimal Transport to Predict the Evolution of\n  Stochastic Particle Systems","authors":"Nicholas Karris, Evangelos A. Nikitopoulos, Ioannis Kevrekidis,\n  Seungjoon Lee, Alexander Cloninger","authorsParsed":[["Karris","Nicholas",""],["Nikitopoulos","Evangelos A.",""],["Kevrekidis","Ioannis",""],["Lee","Seungjoon",""],["Cloninger","Alexander",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 20:00:36 GMT"}],"updateDate":"2024-08-06","timestamp":1722715236000,"abstract":"  We develop an algorithm to approximate the time evolution of a probability\nmeasure without explicitly learning an operator that governs the evolution. A\nparticular application of interest is discrete measures $\\mu_t^N$ that arise\nfrom particle systems. In many such situations, the individual particles move\nchaotically on short time scales, making it difficult to learn the dynamics of\na governing operator, but the bulk distribution $\\mu_t^N$ approximates an\nabsolutely continuous measure $\\mu_t$ that evolves ``smoothly.'' If $\\mu_t$ is\nknown on some time interval, then linearized optimal transport theory provides\nan Euler-like scheme for approximating the evolution of $\\mu_t$ using its\n``tangent vector field'' (represented as a time-dependent vector field on\n$\\mathbb R^d$), which can be computed as a limit of optimal transport maps. We\npropose an analog of this Euler approximation to predict the evolution of the\ndiscrete measure $\\mu_t^N$ (without knowing $\\mu_t$). To approximate the\nanalogous tangent vector field, we use a finite difference over a time step\nthat sits between the two time scales of the system -- long enough for the\nlarge-$N$ evolution ($\\mu_t$) to emerge but short enough to satisfactorily\napproximate the derivative object used in the Euler scheme. By allowing the\nlimiting behavior to emerge, the optimal transport maps closely approximate the\nvector field describing the bulk distribution's smooth evolution instead of the\nindividual particles' more chaotic movements. We demonstrate the efficacy of\nthis approach with two illustrative examples, Gaussian diffusion and a cell\nchemotaxis model, and show that our method succeeds in predicting the bulk\nbehavior over relatively large steps.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Machine Learning","Computing Research Repository/Numerical Analysis","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VK8-qLH4QnLQN88GVC0Lr0VVGEa8iCe3oQBcluTZg6M","pdfSize":"5552811"}
