{"id":"2408.01013","title":"Understanding and Enhancing Linux Kernel-based Packet Switching on WiFi\n  Access Points","authors":"Shiqi Zhang, Mridul Gupta, and Behnam Dezfouli","authorsParsed":[["Zhang","Shiqi",""],["Gupta","Mridul",""],["Dezfouli","Behnam",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 05:15:38 GMT"}],"updateDate":"2024-08-05","timestamp":1722575738000,"abstract":"  As the number of WiFi devices and their traffic demands continue to rise, the\nneed for a scalable and high-performance wireless infrastructure becomes\nincreasingly essential. Central to this infrastructure are WiFi Access Points\n(APs), which facilitate packet switching between Ethernet and WiFi interfaces.\nDespite APs' reliance on the Linux kernel's data plane for packet switching,\nthe detailed operations and complexities of switching packets between Ethernet\nand WiFi interfaces have not been investigated in existing works. This paper\nmakes the following contributions towards filling this research gap. Through\nmacro and micro-analysis of empirical experiments, our study reveals insights\nin two distinct categories. Firstly, while the kernel's statistics offer\nvaluable insights into system operations, we identify and discuss potential\npitfalls that can severely affect system analysis. For instance, we reveal the\nimplications of device drivers on the meaning and accuracy of the statistics\nrelated to packet-switching tasks and processor utilization. Secondly, we\nanalyze the impact of the packet switching path and core configuration on\nperformance and power consumption. Specifically, we identify the differences in\nEthernet-to-WiFi and WiFi-to-Ethernet data paths regarding processing\ncomponents, multi-core utilization, and energy efficiency. We show that the\nWiFi-to-Ethernet data path leverages better multi-core processing and exhibits\nlower power consumption.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Hardware Architecture","Computing Research Repository/Operating Systems","Computing Research Repository/Performance"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}