{"id":"2408.10379","title":"Testable predictions of outside-in age gradients in dwarf galaxies of\n  all types","authors":"Claire L. Riggs, Alyson M. Brooks, Ferah Munshi, Charlotte R.\n  Christensen, Roger E. Cohen, Thomas R. Quinn, James Wadsley","authorsParsed":[["Riggs","Claire L.",""],["Brooks","Alyson M.",""],["Munshi","Ferah",""],["Christensen","Charlotte R.",""],["Cohen","Roger E.",""],["Quinn","Thomas R.",""],["Wadsley","James",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 19:49:25 GMT"}],"updateDate":"2024-08-21","timestamp":1724096965000,"abstract":"  We use a sample of 73 simulated satellite and central dwarf galaxies spanning\na stellar mass range of $10^{5.3}-10^{9.1} M_\\odot$ to investigate the origin\nof their stellar age gradients. We find that dwarf galaxies often form their\nstars \"inside-out,\" i.e., the stars form at successively larger radii over\ntime. However, the oldest stars get reshuffled beyond the star forming radius\nby fluctuations in the gravitational potential well caused by stellar feedback\n(the same mechanisms that cause dwarfs to form dark matter cores). The result\nis that many dwarfs appear to have an \"outside-in\" age gradient at $z=0$, with\nyounger stellar populations more centrally concentrated. However, for the\nreshuffled galaxies with the most extended star formation, young stars can form\nout to the large radii to which the old stars have been reshuffled, erasing the\nage gradient. We find that major mergers do not play a significant role in\nsetting the age gradients of dwarfs. We find similar age gradient trends in\nsatellites and field dwarfs, suggesting environment plays only a minor role, if\nany. Finally, we find that the age gradient trends are imprinted on the\ngalaxies at later times, suggesting that the stellar reshuffling dominates\nafter the galaxies have formed 50% of their stellar mass. The later reshuffling\nis at odds with results from the FIRE-2 simulations. Hence, age gradients offer\na test of current star formation and feedback models that can be probed via\nobservations of resolved stellar populations.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rh4YS1OGIjel1Tfhk6lMOweXmaQtZDVpHayC5AyddfA","pdfSize":"4520754"}
