{"id":"2408.09182","title":"Utility Optimal Scheduling with a Slow Time-Scale Index-Bias for\n  Achieving Rate Guarantees in Cellular Networks","authors":"Anurag Kumar and Rajesh Sundaresan","authorsParsed":[["Kumar","Anurag",""],["Sundaresan","Rajesh",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 12:16:35 GMT"}],"updateDate":"2024-08-20","timestamp":1723896995000,"abstract":"  One of the requirements of network slicing in 5G networks is RAN (radio\naccess network) scheduling with rate guarantees. We study a three-time-scale\nalgorithm for maximum sum utility scheduling, with minimum rate constraints. As\nusual, the scheduler computes an index for each UE in each slot, and schedules\nthe UE with the maximum index. This is at the fastest, natural time-scale of\nchannel fading. The next time-scale is of the exponentially weighted moving\naverage (EWMA) rate update. The slowest time scale in our algorithm is an\n\"index-bias\" update by a stochastic approximation algorithm, with a step-size\nsmaller than the EWMA. The index-biases are related to Lagrange multipliers,\nand bias the slot indices of the UEs with rate guarantees, promoting their more\nfrequent scheduling. We obtain a pair of coupled ordinary differential\nequations (o.d.e.) such that the unique stable points of the two o.d.e.s are\nthe primal and dual solutions of the constrained utility optimization problem.\nThe UE rate and index-bias iterations track the asymptotic behaviour of the\no.d.e. system for small step-sizes of the two slower time-scale iterations.\nSimulations show that, by running the index-bias iteration at a slower\ntime-scale than the EWMA iteration and using the EWMA throughput itself in the\nindex-bias update, the UE rates stabilize close to the optimum operating point\non the rate region boundary, and the index-biases have small fluctuations\naround the optimum Lagrange multipliers. We compare our results with a prior\ntwo-time-scale algorithm and show improved performance.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}