{"id":"2408.05708","title":"Tunable atomically enhanced moir\\'e Berry curvatures in twisted triple\n  bilayer graphene","authors":"Konstantin Davydov, Ziyan Zhu, Noah Friedman, Ethan Gramowski, Yaotian\n  Li, Jack Tavakley, Kenji Watanabe, Takashi Taniguchi, Mitchell Luskin,\n  Efthimios Kaxiras, Ke Wang","authorsParsed":[["Davydov","Konstantin",""],["Zhu","Ziyan",""],["Friedman","Noah",""],["Gramowski","Ethan",""],["Li","Yaotian",""],["Tavakley","Jack",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Luskin","Mitchell",""],["Kaxiras","Efthimios",""],["Wang","Ke",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 06:55:10 GMT"}],"updateDate":"2024-08-13","timestamp":1723359310000,"abstract":"  We report a twisted triple bilayer graphene platform consisting of three\nunits of Bernal bilayer graphene (BLG) consecutively twisted at 1.49{\\deg} and\n1.68{\\deg}. We observe inter-moir\\'e Hofstadter butterflies from two\nco-existing moir\\'e superlattices and a Hofstadter butterfly from reconstructed\nmoir\\'e-of-moir\\'e lattice, and show that their Brown-Zak (BZ) oscillations\nquantitatively agree with each other, both evidencing strong atomic\nreconstruction with a lattice constant of 18.1 nm. We further demonstrate such\natomic reconstruction strongly enhances the Berry curvature of each moir\\'e and\nmoir\\'e-of-moir\\'e band-insulator state, characterized by measured strong\nnon-local valley Hall effect (VHE) that sensitively depends on the\ninter-moir\\'e competition strength, tunable by manipulating the\nout-of-the-plane carrier distribution which controls the magnitude of the\nvalley currents. Our study sheds new light on the microscopic mechanism of\natomic and electronic reconstruction in twisted-multilayer systems, by\ninvestigating novel emergent quantum phenomena of reconstructed\nquasi-crystalline moir\\'e-of-moir\\'e superlattice, including a new type of\nmoir\\'e-of-moir\\'e band-insulator states and atomically enhanced moir\\'e Berry\ncurvature. We show that the reconstructed electronic band can be versatilely\ntuned by electrostatics, providing an approach towards engineering the band\nstructure and its topology for a novel quantum material platform with designer\nelectrical and optical properties.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}