{"id":"2408.14371","title":"SelEx: Self-Expertise in Fine-Grained Generalized Category Discovery","authors":"Sarah Rastegar, Mohammadreza Salehi, Yuki M. Asano, Hazel Doughty,\n  Cees G. M. Snoek","authorsParsed":[["Rastegar","Sarah",""],["Salehi","Mohammadreza",""],["Asano","Yuki M.",""],["Doughty","Hazel",""],["Snoek","Cees G. M.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 15:53:50 GMT"}],"updateDate":"2024-08-27","timestamp":1724687630000,"abstract":"  In this paper, we address Generalized Category Discovery, aiming to\nsimultaneously uncover novel categories and accurately classify known ones.\nTraditional methods, which lean heavily on self-supervision and contrastive\nlearning, often fall short when distinguishing between fine-grained categories.\nTo address this, we introduce a novel concept called `self-expertise', which\nenhances the model's ability to recognize subtle differences and uncover\nunknown categories. Our approach combines unsupervised and supervised\nself-expertise strategies to refine the model's discernment and generalization.\nInitially, hierarchical pseudo-labeling is used to provide `soft supervision',\nimproving the effectiveness of self-expertise. Our supervised technique differs\nfrom traditional methods by utilizing more abstract positive and negative\nsamples, aiding in the formation of clusters that can generalize to novel\ncategories. Meanwhile, our unsupervised strategy encourages the model to\nsharpen its category distinctions by considering within-category examples as\n`hard' negatives. Supported by theoretical insights, our empirical results\nshowcase that our method outperforms existing state-of-the-art techniques in\nGeneralized Category Discovery across several fine-grained datasets. Our code\nis available at: https://github.com/SarahRastegar/SelEx.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}