{"id":"2408.04774","title":"Local Analogs of Primordial Galaxies: In Search of Intermediate Mass\n  Black Holes with JWST NIRSpec","authors":"Sara Doan, Shobita Satyapal, William Matzko, Nicholas P. Abel, Torsten\n  B\\\"oker, Thomas Bohn, Gabriela Canalizo, Jenna M. Cann, Jacqueline Fischer,\n  Stephanie LaMassa, Suzanne C. Madden, Jeffrey D. McKaig, D. Schaerer, Nathan\n  J. Secrest, Anil Seth, Laura Blecha, Mallory Molina, Barry Rothberg","authorsParsed":[["Doan","Sara",""],["Satyapal","Shobita",""],["Matzko","William",""],["Abel","Nicholas P.",""],["Böker","Torsten",""],["Bohn","Thomas",""],["Canalizo","Gabriela",""],["Cann","Jenna M.",""],["Fischer","Jacqueline",""],["LaMassa","Stephanie",""],["Madden","Suzanne C.",""],["McKaig","Jeffrey D.",""],["Schaerer","D.",""],["Secrest","Nathan J.",""],["Seth","Anil",""],["Blecha","Laura",""],["Molina","Mallory",""],["Rothberg","Barry",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 22:14:02 GMT"}],"updateDate":"2024-08-12","timestamp":1723155242000,"abstract":"  Local low metallicity galaxies with signatures of possible accretion activity\nare ideal laboratories in which to search for the lowest mass black holes and\nstudy their impact on the host galaxy. Here we present the first JWST NIRSpec\nIFS observations of SDSS J120122.30+021108.3, a nearby ($z=0.00354$) extremely\nmetal poor dwarf galaxy with no optical signatures of accretion activity but\nidentified by WISE to have extremely red mid-infrared colors consistent with\nAGNs. We identify over one hundred lines between $\\sim$ 1.7-5.2 microns, an\nunresolved nuclear continuum source with an extremely steep spectral slope\nconsistent with hot dust from an AGN ($F_\\nu \\approx\\nu^{-1.5}$), and a\nplethora of H I, He I, and H$_2$ lines, with no lines from heavier elements, CO\nor ice absorption features, or PAHs.Our observations reveal that the red WISE\nsource arises exclusively from a bright central unresolved source ($<$ 3pc)\nsuggestive of an AGN, yet there are no He II lines or coronal lines identified\nin the spectrum, and, importantly, there is no evidence that the radiation\nfield is harder in the nuclear source compared with surrounding regions. These\nobservations can be explained with a young ($<$ 5 Myr) nuclear star cluster\nwith stellar mass $\\sim3\\times 10^4$ M$_\\odot$ and a deeply embedded AGN with\nbolometric luminosity $\\sim$ $2\\times10^{41}$ ergs $^{-1}$. The implied black\nhole mass is $\\sim$ 1450 M$_\\odot$, based on the Eddington limit, roughly\nconsistent with that expected based on extrapolations of black hole galaxy\nscaling relations derived for more massive black holes. Longer wavelength\nobservations are crucial to confirm this scenario.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"R9V5UPVtvJ9pq0zVdWC9BWXXBWi5-q4Ke51zviBC9IQ","pdfSize":"3494357"}
