{"id":"2408.05928","title":"Adapting General Disentanglement-Based Speaker Anonymization for\n  Enhanced Emotion Preservation","authors":"Xiaoxiao Miao, Yuxiang Zhang, Xin Wang, Natalia Tomashenko, Donny\n  Cheng Lock Soh, Ian Mcloughlin","authorsParsed":[["Miao","Xiaoxiao",""],["Zhang","Yuxiang",""],["Wang","Xin",""],["Tomashenko","Natalia",""],["Soh","Donny Cheng Lock",""],["Mcloughlin","Ian",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 05:40:21 GMT"}],"updateDate":"2024-08-13","timestamp":1723441221000,"abstract":"  A general disentanglement-based speaker anonymization system typically\nseparates speech into content, speaker, and prosody features using individual\nencoders. This paper explores how to adapt such a system when a new speech\nattribute, for example, emotion, needs to be preserved to a greater extent.\nWhile existing systems are good at anonymizing speaker embeddings, they are not\ndesigned to preserve emotion. Two strategies for this are examined. First, we\nshow that integrating emotion embeddings from a pre-trained emotion encoder can\nhelp preserve emotional cues, even though this approach slightly compromises\nprivacy protection. Alternatively, we propose an emotion compensation strategy\nas a post-processing step applied to anonymized speaker embeddings. This\nconceals the original speaker's identity and reintroduces the emotional traits\nlost during speaker embedding anonymization. Specifically, we model the emotion\nattribute using support vector machines to learn separate boundaries for each\nemotion. During inference, the original speaker embedding is processed in two\nways: one, by an emotion indicator to predict emotion and select the\nemotion-matched SVM accurately; and two, by a speaker anonymizer to conceal\nspeaker characteristics. The anonymized speaker embedding is then modified\nalong the corresponding SVM boundary towards an enhanced emotional direction to\nsave the emotional cues. The proposed strategies are also expected to be useful\nfor adapting a general disentanglement-based speaker anonymization system to\npreserve other target paralinguistic attributes, with potential for a range of\ndownstream tasks.\n","subjects":["Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}