{"id":"2408.12370","title":"Basis-independent quantum coherence and its distribution under\n  relativistic motion","authors":"Ming-Ming Du, Hong-Wei Li, Zhen Tao, Shu-Ting Shen, Xiao-Jing Yan.\n  Xi-Yun Li, Wei Zhong, Yu-Bo Sheng, Lan Zhou","authorsParsed":[["Du","Ming-Ming",""],["Li","Hong-Wei",""],["Tao","Zhen",""],["Shen","Shu-Ting",""],["Li","Xiao-Jing Yan. Xi-Yun",""],["Zhong","Wei",""],["Sheng","Yu-Bo",""],["Zhou","Lan",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 13:14:45 GMT"}],"updateDate":"2024-08-23","timestamp":1724332485000,"abstract":"  Recent studies have increasingly focused on the effect of relativistic motion\non quantum coherence. Prior research predominantly examined the influence of\nrelative motion on basis-dependent quantum coherence, underscoring its\nsusceptibility to decoherence under accelerated conditions. Yet, the effect of\nrelativistic motion on basis-independent quantum coherence, which is critical\nfor understanding the intrinsic quantum features of a system, remains an\ninteresting open question. This paper addresses this question by examining how\ntotal, collective, and localized coherence are affected by acceleration and\ncoupling strength. Our analysis reveals that both total and collective\ncoherence significantly decrease with increasing acceleration and coupling\nstrength, ultimately vanishing at high levels of acceleration. This underscores\nthe profound impact of Unruh thermal noise. Conversely, localized coherence\nexhibits relative stability, decreasing to zero only under the extreme\ncondition of infinite acceleration. Moreover, we demonstrate that collective,\nlocalized, and basis-independent coherence collectively satisfy the triangle\ninequality. These findings are crucial for enhancing our understanding of\nquantum information dynamics in environments subjected to high acceleration and\noffer valuable insights on the behavior of quantum coherence under relativistic\nconditions.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}