{"id":"2408.01726","title":"Quantum Lotka-Volterra dynamics","authors":"Yuechun Jiao, Yu Zhang, Jingxu Bai, Weilun Jiang, Yunhui He, Heng\n  Shen, Suotang Jia, Jianming Zhao, C. Stuart Adams","authorsParsed":[["Jiao","Yuechun",""],["Zhang","Yu",""],["Bai","Jingxu",""],["Jiang","Weilun",""],["He","Yunhui",""],["Shen","Heng",""],["Jia","Suotang",""],["Zhao","Jianming",""],["Adams","C. Stuart",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 09:50:03 GMT"}],"updateDate":"2024-08-06","timestamp":1722678603000,"abstract":"  Physical systems that display competitive non-linear dynamics have played a\nkey role in the development of mathematical models of Nature. Important\nexamples include predator-prey models in ecology, biology, consumer-resource\nmodels in economics, and reaction-diffusion equations in chemical reactions.\nHowever, as real world systems are embedded in complex environments, where it\nis difficult or even impossible to control external parameters, quantitative\ncomparison between measurements and simple models remains challenging. This\nmotivates the search for competitive dynamics in isolated physical systems,\nwith precise control. An ideal candidate is laser excitation in dilute atomic\nensembles. For example, atoms in highly-excited Rydberg states display rich\nmany-body dynamics including ergodicity breaking, synchronisation and time\ncrystals. Here, we demonstrate predator-prey dynamics by laser excitation and\nionisation of Rydberg atoms in a room temperature vapour cell. Ionisation of\nexcited atoms produce electric fields that suppress further excitation. This\nstarves the ionisation process of resource, giving rise to predator-prey\ndynamics. By comparing our results to the Lotka-Volterra model, we demonstrate\nthat as well applications in non-linear dynamics, our experiment has\napplications in metrology, and remote sensing of localised plasmas.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}