{"id":"2408.01469","title":"Solid-State Oxide-Ion Synaptic Transistor for Neuromorphic Computing","authors":"Philipp Langner, Francesco Chiabrera, Nerea Alayo, Paul Nizet, Luigi\n  Morrone, Carlota Bozal-Ginesta, Alex Morata, Albert Taranc\\`on","authorsParsed":[["Langner","Philipp",""],["Chiabrera","Francesco",""],["Alayo","Nerea",""],["Nizet","Paul",""],["Morrone","Luigi",""],["Bozal-Ginesta","Carlota",""],["Morata","Alex",""],["Tarancòn","Albert",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 10:15:51 GMT"}],"updateDate":"2024-08-06","timestamp":1722507351000,"abstract":"  Neuromorphic hardware facilitates rapid and energy-efficient training and\noperation of neural network models for artificial intelligence. However,\nexisting analog in-memory computing devices, like memristors, continue to face\nsignificant challenges that impede their commercialization. These challenges\ninclude high variability due to their stochastic nature. Microfabricated\nelectrochemical synapses offer a promising approach by functioning as an analog\nprogrammable resistor based on deterministic ion-insertion mechanisms. Here, we\ndeveloped an all-solid-state oxide-ion synaptic transistor employing\n$\\text{Bi}_2\\text{V}_{0.9}\\text{Cu}_{0.1}\\text{O}_{5.35}$ as a superior\noxide-ion conductor electrolyte and\n$\\text{La}_\\text{0.5}\\text{Sr}_\\text{0.5}\\text{F}\\text{O}_\\text{3-$\\delta$}$ as\na variable resistance channel able to efficiently operate at temperatures\ncompatible with conventional electronics. Our transistor exhibits essential\nsynaptic behaviors such as long- and short-term potentiation, paired-pulse\nfacilitation, and post-tetanic potentiation, mimicking fundamental properties\nof biological neural networks. Key criteria for efficient neuromorphic\ncomputing are satisfied, including excellent linear and symmetric synaptic\nplasticity, low energy consumption per programming pulse, and high endurance\nwith minimal cycle-to-cycle variation. Integrated into an artificial neural\nnetwork (ANN) simulation for handwritten digit recognition, the presented\nsynaptic transistor achieved a 96% accuracy on the MNIST dataset, illustrating\nthe effective implementation of our device in ANNs. These findings demonstrate\nthe potential of oxide-ion based synaptic transistors for effective\nimplementation in analog neuromorphic computing based on iontronics.\n","subjects":["Computing Research Repository/Emerging Technologies","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}