{"id":"2408.07357","title":"Mixing of active scalars due to random shock waves in two dimensions","authors":"Joaquim P. Jossy and Prateek Gupta","authorsParsed":[["Jossy","Joaquim P.",""],["Gupta","Prateek",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 08:11:12 GMT"}],"updateDate":"2024-08-15","timestamp":1723623072000,"abstract":"  In this work, we investigate the mixing of active scalars in two dimensions\nby the stirring action of stochastically generated shock waves. We use direct\nnumerical simulations (DNS) of the interaction of shock waves with two\nnon-reacting species to analyse the mixing dynamics for different Atwood\nnumbers (At). Unlike passive scalars, the presence of density gradients in\nactive scalars makes the species diffusion nonlinear, introducing a\nconcentration gradient-driven term and a density gradient-driven nonlinear\ndissipation term in the concentration evolution equation. We show that the\ndirection of the concentration gradient causes the interface across which\nmolecular diffusion occurs to expand outward or inward, even without any\nstirring action. Shock waves enhance the mixing process by increasing the\nperimeter of the interface and by sustaining concentration gradients. Negative\nAtwood number mixtures sustain concentration gradients for longer time than\npositive Atwood number mixtures due to the so-called nonlinear dissipation\nterms. We estimate the time till when the action of stirring is dominant over\nmolecular mixing. We also highlight the role of baroclinicity in increasing the\ninterface perimeter in the stirring dominant regime. We compare the stirring\neffect of shock waves on mixing of passive scalars with active scalars and show\nthat the vorticity generated by baroclinicity is responsible for the folding\nand stretching of the interface in the case of active scalars. We conclude by\nshowing that lighter mixtures with denser inhomogeneities (At < 0) take longer\ntime to homogenise than the denser mixtures with lighter inhomogeneities (At >\n0).\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}