{"id":"2408.03538","title":"PRTGS: Precomputed Radiance Transfer of Gaussian Splats for Real-Time\n  High-Quality Relighting","authors":"Yijia Guo, Yuanxi Bai, Liwen Hu, Ziyi Guo, Mianzhi Liu, Yu Cai, Tiejun\n  Huang, Lei Ma","authorsParsed":[["Guo","Yijia",""],["Bai","Yuanxi",""],["Hu","Liwen",""],["Guo","Ziyi",""],["Liu","Mianzhi",""],["Cai","Yu",""],["Huang","Tiejun",""],["Ma","Lei",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 04:35:06 GMT"}],"updateDate":"2024-08-08","timestamp":1723005306000,"abstract":"  We proposed Precomputed RadianceTransfer of GaussianSplats (PRTGS), a\nreal-time high-quality relighting method for Gaussian splats in low-frequency\nlighting environments that captures soft shadows and interreflections by\nprecomputing 3D Gaussian splats' radiance transfer. Existing studies have\ndemonstrated that 3D Gaussian splatting (3DGS) outperforms neural fields'\nefficiency for dynamic lighting scenarios. However, the current relighting\nmethod based on 3DGS still struggles to compute high-quality shadow and\nindirect illumination in real time for dynamic light, leading to unrealistic\nrendering results. We solve this problem by precomputing the expensive\ntransport simulations required for complex transfer functions like shadowing,\nthe resulting transfer functions are represented as dense sets of vectors or\nmatrices for every Gaussian splat. We introduce distinct precomputing methods\ntailored for training and rendering stages, along with unique ray tracing and\nindirect lighting precomputation techniques for 3D Gaussian splats to\naccelerate training speed and compute accurate indirect lighting related to\nenvironment light. Experimental analyses demonstrate that our approach achieves\nstate-of-the-art visual quality while maintaining competitive training times\nand allows high-quality real-time (30+ fps) relighting for dynamic light and\nrelatively complex scenes at 1080p resolution.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}