{"id":"2408.09447","title":"Deconvoluting Thermomechanical Effects in X-ray Diffraction Data using\n  Machine Learning","authors":"Rachel E. Lim and Shun-Li Shang and Chihpin Chuang and Thien Q. Phan\n  and Zi-Kui Liu and Darren C. Pagan","authorsParsed":[["Lim","Rachel E.",""],["Shang","Shun-Li",""],["Chuang","Chihpin",""],["Phan","Thien Q.",""],["Liu","Zi-Kui",""],["Pagan","Darren C.",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 12:02:42 GMT"}],"updateDate":"2024-08-20","timestamp":1723982562000,"abstract":"  X-ray diffraction is ideal for probing sub-surface state during complex or\nrapid thermomechanical loading of crystalline materials. However, challenges\narise as the size of diffraction volumes increase due to spatial broadening and\ninability to deconvolute the effects of different lattice deformation\nmechanisms. Here we present a novel approach to use combinations of\nphysics-based modeling and machine learning to deconvolve thermal and\nmechanical elastic strains for diffraction data analysis. The method builds on\na previous effort to extract thermal strain distribution information from\ndiffraction data. The new approach is applied to extract the evolution of\nthermomechanical state during laser melting of an Inconel 625 wall specimen\nwhich produces significant residual stress upon cooling. A combination of heat\ntransfer and fluid flow, elasto-plasticity, and X-ray diffraction simulations\nare used to generate training data for machine-learning (Gaussian Process\nRegression, GPR) models that map diffracted intensity distributions to\nunderlying thermomechanical strain fields. First-principles density functional\ntheory is used to determine accurate temperature-dependent thermal expansion\nand elastic stiffness used in the elasto-plasticity modeling. The trained GPR\nmodels are found to be capable of deconvoluting the effects of thermal and\nmechanical strains, in addition to providing information about underlying\nstrain distributions, even from complex diffraction patterns with irregularly\nshaped peaks.\n","subjects":["Condensed Matter/Materials Science","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RgUJ3o9Mxzlc37l-gc-TMVcKJTlDzRw2LjWTEv5IMEM","pdfSize":"9917455"}
