{"id":"2408.10628","title":"Finding the DeepDream for Time Series: Activation Maximization for\n  Univariate Time Series","authors":"Udo Schlegel, Daniel A. Keim, Tobias Sutter","authorsParsed":[["Schlegel","Udo",""],["Keim","Daniel A.",""],["Sutter","Tobias",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 08:09:44 GMT"}],"updateDate":"2024-08-21","timestamp":1724141384000,"abstract":"  Understanding how models process and interpret time series data remains a\nsignificant challenge in deep learning to enable applicability in\nsafety-critical areas such as healthcare. In this paper, we introduce Sequence\nDreaming, a technique that adapts Activation Maximization to analyze sequential\ninformation, aiming to enhance the interpretability of neural networks\noperating on univariate time series. By leveraging this method, we visualize\nthe temporal dynamics and patterns most influential in model decision-making\nprocesses. To counteract the generation of unrealistic or excessively noisy\nsequences, we enhance Sequence Dreaming with a range of regularization\ntechniques, including exponential smoothing. This approach ensures the\nproduction of sequences that more accurately reflect the critical features\nidentified by the neural network. Our approach is tested on a time series\nclassification dataset encompassing applications in predictive maintenance. The\nresults show that our proposed Sequence Dreaming approach demonstrates targeted\nactivation maximization for different use cases so that either centered class\nor border activation maximization can be generated. The results underscore the\nversatility of Sequence Dreaming in uncovering salient temporal features\nlearned by neural networks, thereby advancing model transparency and\ntrustworthiness in decision-critical domains.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"h3yWliO0WufVJZ_e2shSgJOrZvukekssGKLKlAhUpKY","pdfSize":"6074243"}
