{"id":"2408.08350","title":"MSA-3D: dissecting galaxies at z~1 with high spatial and spectral\n  resolution","authors":"Ivana Bari\\v{s}i\\'c, Tucker Jones, Kris Mortensen, Themiya\n  Nanayakkara, Yuguang Chen, Ryan Sanders, James S. Bullock, Kevin Bundy,\n  Claude-Andr\\'e Faucher-Gigu\\`ere, Karl Glazebrook, Alaina Henry, Mengting Ju,\n  Matthew Malkan, Takahiro Morishita, Danail Obreschkow, Namrata Roy, Juan M.\n  Espejo Salcedo, Alice E. Shapley, Tommaso Treu, Xin Wang, Kyle B. Westfall","authorsParsed":[["Barišić","Ivana",""],["Jones","Tucker",""],["Mortensen","Kris",""],["Nanayakkara","Themiya",""],["Chen","Yuguang",""],["Sanders","Ryan",""],["Bullock","James S.",""],["Bundy","Kevin",""],["Faucher-Giguère","Claude-André",""],["Glazebrook","Karl",""],["Henry","Alaina",""],["Ju","Mengting",""],["Malkan","Matthew",""],["Morishita","Takahiro",""],["Obreschkow","Danail",""],["Roy","Namrata",""],["Salcedo","Juan M. Espejo",""],["Shapley","Alice E.",""],["Treu","Tommaso",""],["Wang","Xin",""],["Westfall","Kyle B.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-19","timestamp":1723744801000,"abstract":"  Integral field spectroscopy (IFS) is a powerful tool for understanding the\nformation of galaxies across cosmic history. We present the observing strategy\nand first results of MSA-3D, a novel JWST program using multi-object\nspectroscopy in a slit-stepping strategy to produce IFS data cubes. The program\nobserved 43 normal star-forming galaxies at redshifts $0.5 \\lesssim z \\lesssim\n1.5$, corresponding to the epoch when spiral thin-disk galaxies of the modern\nHubble sequence are thought to emerge, obtaining kpc-scale maps of rest-frame\noptical nebular emission lines with spectral resolution $R\\simeq2700$. Here we\ndescribe the multiplexed slit-stepping method which is $>15$ times more\nefficient than the NIRSpec IFS mode for our program. As an example of the data\nquality, we present a case study of an individual galaxy at $z=1.104$ (stellar\nmass $M_{*} = 10^{10.3}~M_{\\odot}$, star formation rate~$=3~M_{\\odot}$\nyr$^{-1}$) with prominent face-on spiral structure. We show that the galaxy\nexhibits a rotationally supported disk with moderate velocity dispersion\n($\\sigma = 36^{+5}_{-4}$~\\kms), a negative radial metallicity gradient\n($-0.020\\pm0.002$~dex\\,kpc$^{-1}$), a dust attenuation gradient, and an\nexponential star formation rate density profile which closely matches the\nstellar continuum. These properties are characteristic of local spirals,\nindicating that mature galaxies are in place at $z\\sim1$. We also describe the\ncustomized data reduction and original cube-building software pipelines which\nwe have developed to exploit the powerful slit-stepping technique. Our results\ndemonstrate the ability of JWST slit-stepping to study galaxy populations at\nintermediate to high redshifts, with data quality similar to current surveys of\nthe $z\\sim0.1$ universe.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}