{"id":"2408.01002","title":"A Logarithmic Depth Quantum Carry-Lookahead Modulo $(2^n-1)$ Adder","authors":"Bhaskar Gaur, Edgard Mu\\~noz-Coreas, Himanshu Thapliyal","authorsParsed":[["Gaur","Bhaskar",""],["Muñoz-Coreas","Edgard",""],["Thapliyal","Himanshu",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 04:31:22 GMT"}],"updateDate":"2024-08-05","timestamp":1722573082000,"abstract":"  Quantum Computing is making significant advancements toward creating machines\ncapable of implementing quantum algorithms in various fields, such as quantum\ncryptography, quantum image processing, and optimization. The development of\nquantum arithmetic circuits for modulo addition is vital for implementing these\nquantum algorithms. While it is ideal to use quantum circuits based on\nfault-tolerant gates to overcome noise and decoherence errors, the current\nNoisy Intermediate Scale Quantum (NISQ) era quantum computers cannot handle the\nadditional computational cost associated with fault-tolerant designs. Our\nresearch aims to minimize circuit depth, which can reduce noise and facilitate\nthe implementation of quantum modulo addition circuits on NISQ machines. This\nwork presents quantum carry-lookahead modulo $(2^n - 1)$ adder (QCLMA), which\nis designed to receive two n-bit numbers and perform their addition with an\nO(log n) depth. Compared to existing work of O(n) depth, our proposed QCLMA\nreduces the depth and helps increase the noise fidelity. In order to increase\nerror resilience, we also focus on creating a tree structure based Carry path,\nunlike the chain based Carry path of the current work. We run experiments on\nQuantum Computer IBM Cairo to evaluate the performance of the proposed QCLMA\nagainst the existing work and define Quantum State Fidelity Ratio (QSFR) to\nquantify the closeness of the correct output to the top output. When compared\nagainst existing work, the proposed QCLMA achieves a 47.21% increase in QSFR\nfor 4-qubit modulo addition showcasing its superior noise fidelity.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kLT18mQsNKEOI8uCutq5LDfZI-NoSy4Bh9fc7-jvZoM","pdfSize":"651842","txDigest":"9kqVCQFY2MxxpjsgVqbJukPj2bBUC1d2xtZyTshvTS5Z","endEpoch":"1","status":"CERTIFIED"}
