{"id":"2408.16301","title":"Influence of anti-ferromagnetic ordering and electron correlation on the\n  electronic structure of MnTiO$_3$","authors":"Asif Ali, R. K. Maurya, Sakshi Bansal, B. H. Reddy and Ravi Shankar\n  Singh","authorsParsed":[["Ali","Asif",""],["Maurya","R. K.",""],["Bansal","Sakshi",""],["Reddy","B. H.",""],["Singh","Ravi Shankar",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 07:02:42 GMT"}],"updateDate":"2024-08-30","timestamp":1724914962000,"abstract":"  Electron correlation and long-range magnetic ordering have a significant\nimpact on the electronic structure and physical properties of solids. Here, we\ninvestigate the electronic structure of ilmenite MnTiO$_{3}$ using room\ntemperature photoemission spectroscopy and theoretical approaches within\ndensity functional theory (DFT), DFT+$U$ and DFT+dynamical mean field theory\n(DMFT). Mn 2$p$ (Ti 2$p$) core level photoemission spectra, confirming\nMn$^{2+}$ (Ti$^{4+}$) oxidation state, exhibit multiple satellites which are\nvery similar to that of MnO (TiO$_{2}$), suggesting similar strength of various\ninteractions in this system. Valence band spectra collected at different photon\nenergies suggest dominant Mn 3$d$ character in the highest occupied band with a\nwide insulating gap. DFT(+$U$) correctly predicts the experimentally observed\nanti-ferromagnetic (AFM) insulating ground state for MnTiO$_3$ where the\nrequirement of a large $U$ to reproduce the experimental values of magnetic\nmoment and band gap signifies the importance of electron correlation.\nMagnetically disordered paramagnetic (PM) phase could be well captured within\nDFT+DMFT, which provides an excellent agreement for the experimental band gap,\nparamagnetic moment, valence band spectra as well as dominant Mn 3$d$ character\nin the highest occupied band. The calculated spectral function remains largely\nunaffected and exhibits sharper features in the magnetically ordered AFM phase.\nWe show that the electronic structure of MnTiO$_{3}$ in both the PM and AFM\nphases can be accurately described within DFT+DMFT.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wrzfQKmBks7OWBYLYxKWWedQO0t1DrNCU33NcWXMM4Q","pdfSize":"2402697"}
