{"id":"2408.05614","title":"ICGMM: CXL-enabled Memory Expansion with Intelligent Caching Using\n  Gaussian Mixture Model","authors":"Hanqiu Chen, Yitu Wang, Luis Vitorio Cargnini, Mohammadreza\n  Soltaniyeh, Dongyang Li, Gongjin Sun, Pradeep Subedi, Andrew Chang, Yiran\n  Chen and Cong Hao","authorsParsed":[["Chen","Hanqiu",""],["Wang","Yitu",""],["Cargnini","Luis Vitorio",""],["Soltaniyeh","Mohammadreza",""],["Li","Dongyang",""],["Sun","Gongjin",""],["Subedi","Pradeep",""],["Chang","Andrew",""],["Chen","Yiran",""],["Hao","Cong",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 19:17:46 GMT"}],"updateDate":"2024-08-13","timestamp":1723317466000,"abstract":"  Compute Express Link (CXL) emerges as a solution for wide gap between\ncomputational speed and data communication rates among host and multiple\ndevices. It fosters a unified and coherent memory space between host and CXL\nstorage devices such as such as Solid-state drive (SSD) for memory expansion,\nwith a corresponding DRAM implemented as the device cache. However, this\nintroduces challenges such as substantial cache miss penalties, sub-optimal\ncaching due to data access granularity mismatch between the DRAM \"cache\" and\nSSD \"memory\", and inefficient hardware cache management. To address these\nissues, we propose a novel solution, named ICGMM, which optimizes caching and\neviction directly on hardware, employing a Gaussian Mixture Model (GMM)-based\napproach. We prototype our solution on an FPGA board, which demonstrates a\nnoteworthy improvement compared to the classic Least Recently Used (LRU) cache\nstrategy. We observe a decrease in the cache miss rate ranging from 0.32% to\n6.14%, leading to a substantial 16.23% to 39.14% reduction in the average SSD\naccess latency. Furthermore, when compared to the state-of-the-art Long\nShort-Term Memory (LSTM)-based cache policies, our GMM algorithm on FPGA\nshowcases an impressive latency reduction of over 10,000 times. Remarkably,\nthis is achieved while demanding much fewer hardware resources.\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Emerging Technologies","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}