{"id":"2408.01431","title":"Building an Ethical and Trustworthy Biomedical AI Ecosystem for the\n  Translational and Clinical Integration of Foundational Models","authors":"Simha Sankar Baradwaj, Destiny Gilliland, Jack Rincon, Henning\n  Hermjakob, Yu Yan, Irsyad Adam, Gwyneth Lemaster, Dean Wang, Karol Watson,\n  Alex Bui, Wei Wang, and Peipei Ping","authorsParsed":[["Baradwaj","Simha Sankar",""],["Gilliland","Destiny",""],["Rincon","Jack",""],["Hermjakob","Henning",""],["Yan","Yu",""],["Adam","Irsyad",""],["Lemaster","Gwyneth",""],["Wang","Dean",""],["Watson","Karol",""],["Bui","Alex",""],["Wang","Wei",""],["Ping","Peipei",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 15:57:58 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 02:28:09 GMT"}],"updateDate":"2024-08-15","timestamp":1721318278000,"abstract":"  Foundational Models (FMs) are gaining increasing attention in the biomedical\nAI ecosystem due to their ability to represent and contextualize multimodal\nbiomedical data. These capabilities make FMs a valuable tool for a variety of\ntasks, including biomedical reasoning, hypothesis generation, and interpreting\ncomplex imaging data. In this review paper, we address the unique challenges\nassociated with establishing an ethical and trustworthy biomedical AI\necosystem, with a particular focus on the development of FMs and their\ndownstream applications. We explore strategies that can be implemented\nthroughout the biomedical AI pipeline to effectively tackle these challenges,\nensuring that these FMs are translated responsibly into clinical and\ntranslational settings. Additionally, we emphasize the importance of key\nstewardship and co-design principles that not only ensure robust regulation but\nalso guarantee that the interests of all stakeholders, especially those\ninvolved in or affected by these clinical and translational applications are\nadequately represented. We aim to empower the biomedical AI community to\nharness these models responsibly and effectively. As we navigate this exciting\nfrontier, our collective commitment to ethical stewardship, co-design, and\nresponsible translation will be instrumental in ensuring that the evolution of\nFMs truly enhances patient care and medical decision making, ultimately leading\nto a more equitable and trustworthy biomedical AI ecosystem.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"G6_vqC90hVmSFXq_1a0perC8ptkwIQmLdjdanVBbrGg","pdfSize":"753096","txDigest":"FceZTZpmZkWtNJMRM5gfmQSvfrkx7xtPBej6DU6LxcS4","endEpoch":"1","status":"CERTIFIED"}
