{"id":"2408.01927","title":"Step-to-Charge: mW-scale power transfer to on-body devices for long\n  channel (> 1m) with EQS Resonant Human Body Powering","authors":"Arunashish Datta, Lingke Ding and Shreyas Sen","authorsParsed":[["Datta","Arunashish",""],["Ding","Lingke",""],["Sen","Shreyas",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 04:47:59 GMT"}],"updateDate":"2024-08-06","timestamp":1722746879000,"abstract":"  Current limits of harvested energy in wearables are governed by three\nfundamental quantities, the physical limits of available energy density in\nambient powering, safety limits in intentional powering, and the size of the\nwearable device. Typical energy harvested, except for solar power in favorable\noutdoor conditions, ranges from 5 uW to a maximum of 100 - 200 uW depending\nupon the available energy. Further, traditional intentional powering\nmethodologies using ultrasound and radio-frequency either have a severe\nlimitation in range of powering or are inefficient due to high path loss in\nNon-Line-of-Sight scenarios due to absorption by the body. In this study, we\npropose a novel approach using the human body, the common medium connecting the\nwearable devices, as a channel to transfer power. We demonstrate Human Body\nPowering using ``Step-to-Charge,\" a first-of-its-kind non-radiative,\nmeter-scale powering methodology using a floor-based source and the human body\nas the channel to transfer power at lower channel losses to charge and power\nwearable devices across the whole body. The proposed powering methodology\nallows more than 2 mW peak power to be transferred to a wearable device for >1m\nchannel lengths, which is > 90X greater than the state-of-the-art over previous\nHuman Body Powering attempts. Step-to-Charge enables the powering of a new,\nextended range of wearable devices across the human body, bringing us closer to\nenabling battery-less perpetual operation using Human Body Power transfer.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}