{"id":"2408.16093","title":"Validation of Thin-foil proton recoil neutron spectrometer prototype for\n  application in high yield DT fusion devices","authors":"B. Marcinkevicius, E. Andersson Sunden, G. Ericsson, A. Hjalmarsson","authorsParsed":[["Marcinkevicius","B.",""],["Sunden","E. Andersson",""],["Ericsson","G.",""],["Hjalmarsson","A.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:49:38 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 11:24:40 GMT"}],"updateDate":"2024-09-02","timestamp":1724870978000,"abstract":"  The use of Thin-foil Proton Recoil (TPR) spectrometers for application in\nneutron spectroscopy is of high relevance for future fusion devices such as\nITER, where neutron spectroscopy will play a crucial role in fuel content\nmonitoring. Existing research based on simulations of the performance of TPR\nspectrometers at ITER has demonstrated positive results. However, experimental\nvalidation of the simulations would greatly benefit the reliability of\nconclusions. In this study, we designed and constructed a prototype TPR neutron\nspectrometer and employed a DT neutron generator as a neutron source to perform\nmeasurements. We compared the experimental results with the simulation results\nusing the Geant4 model of the experiment. The simulation and experimental\nresults match within silicon detector intrinsic energy resolution. This\napproach ensures the experimental validation of the Geant4 based simulations of\nthe TPR spectrometer. The experimental results demonstrated the feasibility of\nutilizing nuclear reactions measured in silicon detectors, specifically\n$^{28}$Si(n,d) and $^{28}$Si(n,$\\alpha$), for energy calibration purposes. A\ncomparison of the experiment and the simulation shows that the mean peak energy\nand full width at half maximum are within 150 keV. The calculated detector\nefficiency underestimates the experimentally determined efficiency up to 33\\%.\nDiscrepancies in the measured energy spectrum indicate the need for a more\nrefined model and experiment control. Overall, the successful validation of the\ndeveloped Geant4 simulation model against the experimentally measured energy\nspectra increases confidence in the applicability of such simulation results in\nother devices. The demonstrated energy calibration highlights new possibilities\nfor neutron spectrometer monitoring during operation at ITER.\n","subjects":["Physics/Instrumentation and Detectors","Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xxCfscjPktLHyITb6a-BsJnr3_CH7Hub3w7qEG0dhlQ","pdfSize":"10990442"}
