{"id":"2408.05467","title":"Differential image motion in astrometric observations with very large\n  seeing-limited telescopes","authors":"P.F. Lazorenko, J. Sahlmann, M. Mayor and E. L. Martin","authorsParsed":[["Lazorenko","P. F.",""],["Sahlmann","J.",""],["Mayor","M.",""],["Martin","E. L.",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 07:28:32 GMT"}],"updateDate":"2024-08-13","timestamp":1723274912000,"abstract":"  We investigate how to quantitatively model the observed differential image\nmotion (DIM) in relative astrometric observations. As a test bed we used\ndifferential astrometric observations from the FORS2 camera of the Very Large\nTelescope (VLT) obtained during 2010-2019 under several programs of\nobservations of southern brown dwarfs. The measured image motion was compared\nto models that decompose atmospheric turbulence in frequency space and\ntranslate the vertical turbulence profile into DIM amplitude. This approach\naccounts for the spatial filtering by the telescope's entrance pupil and the\nobservation parameters (field size, zenith angle, reference star brightness and\ndistribution, and exposure time), and it aggregates that information into a\nnewly defined metric integral term. We demonstrate excellent agreement (within\n1%) between the model parameters derived from the DIM variance and determined\nby the observations. For a 30s exposure of a typical 1 arcmin-radius field\nclose to the Galactic plane, image motion limits astrometric precision to ~60\nmu-as when sixth-order transformation polynomial is applicable. We confirm that\nthe measured image motion variance is well described by Kolmogorov-type\nturbulence with exponent 11/3 dependence on the field size at effective\naltitudes of 16-18~km, where the best part of the DIM is generated.\nExtrapolation to observations with extremely large telescopes enables the\nestimation of the astrometric precision limit for seeing-limited observations\nof ~5 mu-as, which has a variety of exciting scientific applications.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}