{"id":"2408.09229","title":"cuVegas: Accelerate Multidimensional Monte Carlo Integration through a\n  Parallelized CUDA-based Implementation of the VEGAS Enhanced Algorithm","authors":"Emiliano Tolotti, Anas Jnini, Flavio Vella, Roberto Passerone","authorsParsed":[["Tolotti","Emiliano",""],["Jnini","Anas",""],["Vella","Flavio",""],["Passerone","Roberto",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 15:21:16 GMT"}],"updateDate":"2024-08-20","timestamp":1723908076000,"abstract":"  This paper introduces cuVegas, a CUDA-based implementation of the Vegas\nEnhanced Algorithm (VEGAS+), optimized for multi-dimensional integration in GPU\nenvironments. The VEGAS+ algorithm is an advanced form of Monte Carlo\nintegration, recognized for its adaptability and effectiveness in handling\ncomplex, high-dimensional integrands. It employs a combination of variance\nreduction techniques, namely adaptive importance sampling and a variant of\nadaptive stratified sampling, that make it particularly adept at managing\nintegrands with multiple peaks or those aligned with the diagonals of the\nintegration volume. Being a Monte Carlo integration method, the task is well\nsuited for parallelization and for GPU execution. Our implementation, cuVegas,\naims to harness the inherent parallelism of GPUs, addressing the challenge of\nworkload distribution that often hampers efficiency in standard\nimplementations. We present a comprehensive analysis comparing cuVegas with\nexisting CPU and GPU implementations, demonstrating significant performance\nimprovements, from two to three orders of magnitude on CPUs, and from a factor\nof two on GPUs over the best existing implementation. We also demonstrate the\nspeedup for integrands for which VEGAS+ was designed, with multiple peaks or\nother significant structures aligned with diagonals of the integration volume.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Az5FiF8obkNBybw_iUBjYchGoAQXj7IzLyO7gXk-qAo","pdfSize":"918670"}
