{"id":"2408.14884","title":"Multimedia Traffic Anomaly Detection","authors":"Tongtong Feng, Qi Qi, Jingyu Wang","authorsParsed":[["Feng","Tongtong",""],["Qi","Qi",""],["Wang","Jingyu",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 08:55:41 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 02:20:35 GMT"},{"version":"v3","created":"Sun, 1 Sep 2024 07:45:52 GMT"}],"updateDate":"2024-09-04","timestamp":1724748941000,"abstract":"  Accuracy anomaly detection in user-level social multimedia traffic is crucial\nfor privacy security. Compared with existing models that passively detect\nspecific anomaly classes with large labeled training samples, user-level social\nmultimedia traffic contains sizeable new anomaly classes with few labeled\nsamples and has an imbalance, self-similar, and data-hungry nature. Recent\nadvances, such as Generative Adversarial Networks (GAN), solve it by learning a\nsample generator only from seen class samples to synthesize new samples.\nHowever, if we detect many new classes, the number of synthesizing samples\nwould be unfeasibly estimated, and this operation will drastically increase\ncomputational complexity and energy consumption. Motivation on these\nlimitations, in this paper, we propose \\textit{Meta-UAD}, a Meta-learning\nscheme for User-level social multimedia traffic Anomaly Detection. This scheme\nrelies on the episodic training paradigm and learns from the collection of\nK-way-M-shot classification tasks, which can use the pre-trained model to adapt\nany new class with few samples by going through few iteration steps. Since\nuser-level social multimedia traffic emerges from a complex interaction process\nof users and social applications, we further develop a feature extractor to\nimprove scheme performance. It extracts statistical features using cumulative\nimportance ranking and time-series features using an LSTM-based AutoEncoder. We\nevaluate our scheme on two public datasets and the results further demonstrate\nthe superiority of Meta-UAD.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}