{"id":"2408.01567","title":"Terahertz high-harmonic generation in gapped antiferromagnetic chains","authors":"Mohsen Yarmohammadi and Michael H. Kolodrubetz","authorsParsed":[["Yarmohammadi","Mohsen",""],["Kolodrubetz","Michael H.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 20:41:31 GMT"}],"updateDate":"2024-08-06","timestamp":1722631291000,"abstract":"  The nonlinear dynamics of magnetization in antiferromagnets, resulting in\nhigh-frequency spin waves (high-order harmonics) as signal carriers, enable\nfast magnetic state switching in spintronic devices. More harmonic orders\npotentially allow more information to be conveyed by the spins. Developing\ntheoretical models to describe these waves in antiferromagnets is essential for\npredicting their properties and guiding experimental efforts. Here, we consider\nthe role of linear and quadratic spin-phonon couplings (SPCs) in achieving\nhigh-order harmonics in the THz magnetization of a gapped antiferromagnetic\nspin chain. A THz steady laser's electric field indirectly drives spins via\nphonons. Using spin-wave theory, mean-field theory, and the Lindblad formalism,\nwe analyze the resulting nonlinear dynamics. We highlight the distinct\nmechanisms for harmonic generation when a phonon is coupled to the easy-plane\nand easy-axis of spins. Moreover, we observe that quadratic SPC blocks odd\nharmonics due to invariant inversion symmetry, while linear SPC generates both\nodd and even harmonics. We also investigate the effects of drive frequency,\ndrive amplitude, phonon damping, and spin damping on the number of harmonics.\nOur findings offer an alternative pathway for developing nonlinear magnonics.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bLvYltJRo00JIPx7twJhEcmrzuw9_Xkp7iRvTf8-76U","pdfSize":"2138333","txDigest":"9G1QCsywpPvp1DEHisLRadEEG6WUKwATv2yzSZnCUYMp","endEpoch":"1","status":"CERTIFIED"}
