{"id":"2408.16529","title":"S3C2 Summit 2023-11: Industry Secure Supply Chain Summit","authors":"Nusrat Zahan, Yasemin Acar, Michel Cukier, William Enck, Christian\n  K\\\"astner, Alexandros Kapravelos, Dominik Wermke, Laurie Williams","authorsParsed":[["Zahan","Nusrat",""],["Acar","Yasemin",""],["Cukier","Michel",""],["Enck","William",""],["Kästner","Christian",""],["Kapravelos","Alexandros",""],["Wermke","Dominik",""],["Williams","Laurie",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 13:40:06 GMT"}],"updateDate":"2024-08-30","timestamp":1724938806000,"abstract":"  Cyber attacks leveraging or targeting the software supply chain, such as the\nSolarWinds and the Log4j incidents, affected thousands of businesses and their\ncustomers, drawing attention from both industry and government stakeholders. To\nfoster open dialogue, facilitate mutual sharing, and discuss shared challenges\nencountered by stakeholders in securing their software supply chain,\nresearchers from the NSF-supported Secure Software Supply Chain Center (S3C2)\norganize Secure Supply Chain Summits with stakeholders. This paper summarizes\nthe Industry Secure Supply Chain Summit held on November 16, 2023, which\nconsisted of \\panels{} panel discussions with a diverse set of \\participants{}\npractitioners from the industry. The individual panels were framed with\nopen-ended questions and included the topics of Software Bills of Materials\n(SBOMs), vulnerable dependencies, malicious commits, build and deploy\ninfrastructure, reducing entire classes of vulnerabilities at scale, and\nsupporting a company culture conductive to securing the software supply chain.\nThe goal of this summit was to enable open discussions, mutual sharing, and\nshedding light on common challenges that industry practitioners with practical\nexperience face when securing their software supply chain.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}