{"id":"2408.08447","title":"SpectralEarth: Training Hyperspectral Foundation Models at Scale","authors":"Nassim Ait Ali Braham, Conrad M Albrecht, Julien Mairal, Jocelyn\n  Chanussot, Yi Wang, Xiao Xiang Zhu","authorsParsed":[["Braham","Nassim Ait Ali",""],["Albrecht","Conrad M",""],["Mairal","Julien",""],["Chanussot","Jocelyn",""],["Wang","Yi",""],["Zhu","Xiao Xiang",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 22:55:59 GMT"}],"updateDate":"2024-08-19","timestamp":1723762559000,"abstract":"  Foundation models have triggered a paradigm shift in computer vision and are\nincreasingly being adopted in remote sensing, particularly for multispectral\nimagery. Yet, their potential in hyperspectral imaging (HSI) remains untapped\ndue to the absence of comprehensive and globally representative hyperspectral\ndatasets. To close this gap, we introduce SpectralEarth, a large-scale\nmulti-temporal dataset designed to pretrain hyperspectral foundation models\nleveraging data from the Environmental Mapping and Analysis Program (EnMAP).\nSpectralEarth comprises 538,974 image patches covering 415,153 unique locations\nfrom more than 11,636 globally distributed EnMAP scenes spanning two years of\narchive. Additionally, 17.5% of these locations include multiple timestamps,\nenabling multi-temporal HSI analysis. Utilizing state-of-the-art\nself-supervised learning (SSL) algorithms, we pretrain a series of foundation\nmodels on SpectralEarth. We integrate a spectral adapter into classical vision\nbackbones to accommodate the unique characteristics of HSI. In tandem, we\nconstruct four downstream datasets for land-cover and crop-type mapping,\nproviding benchmarks for model evaluation. Experimental results support the\nversatility of our models, showcasing their generalizability across different\ntasks and sensors. We also highlight computational efficiency during model\nfine-tuning. The dataset, models, and source code will be made publicly\navailable.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FdHjvng595CILq0jcIOVDXFOyXNgeFxpBdMCm2zPeXk","pdfSize":"20686138"}
