{"id":"2408.04748","title":"Dynamic cluster field modeling of collective chemotaxis","authors":"Aditya Paspunurwar, Adrian Moure, Hector Gomez","authorsParsed":[["Paspunurwar","Aditya",""],["Moure","Adrian",""],["Gomez","Hector",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 20:24:07 GMT"}],"updateDate":"2024-08-12","timestamp":1723148647000,"abstract":"  Collective migration of eukaryotic cells is often guided by chemotaxis, and\nis critical in several biological processes, such as cancer metastasis, wound\nhealing, and embryogenesis. Understanding collective chemotaxis has challenged\nexperimental, theoretical and computational scientists because cells can sense\nvery small chemoattractant gradients that are tightly controlled by cell-cell\ninteractions and the regulation of the chemoattractant distribution by the\ncells. Computational models of collective cell migration that offer a\nhigh-fidelity resolution of the cell motion and chemoattractant dynamics in the\nextracellular space have been limited to a small number of cells. Here, we\npresent Dynamic cluster field modeling (DCF), a novel computational method that\nenables simulations of collective chemotaxis of cellular systems with O(1000)\ncells and high-resolution transport dynamics of the chemoattractant in the\ntime-evolving extracellular space. We illustrate the efficiency and predictive\ncapabilities of our approach by comparing our numerical simulations with\nexperiments in multiple scenarios that involve chemoattractant secretion and\nuptake by the migrating cells, regulation of the attractant distribution by\ncell motion, and interactions of the chemoattractant with an enzyme. The\nproposed algorithm opens new opportunities to address outstanding problems that\ninvolve collective cell migration in the central nervous system, immune\nresponse and cancer metastasis.\n","subjects":["Physics/Biological Physics","Quantitative Biology/Cell Behavior"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}