{"id":"2408.10654","title":"Incorporating a 'ladder of trust' into dynamic Allocation of Function in\n  Human-Autonomous Agent Collectives","authors":"Chris Baber, Patrick Waterson, Sanja Milivojevic, Sally Maynard,\n  Edmund R. Hunt, Sagir Yusuf","authorsParsed":[["Baber","Chris",""],["Waterson","Patrick",""],["Milivojevic","Sanja",""],["Maynard","Sally",""],["Hunt","Edmund R.",""],["Yusuf","Sagir",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 08:49:02 GMT"}],"updateDate":"2024-08-21","timestamp":1724143742000,"abstract":"  A major, ongoing social transition is the inclusion of autonomous agents into\nhuman organizations. For example, in defence and security applications, robots\nmay be used alongside human operatives to reduce risk or add capability. But a\nkey barrier to the transition to successful human-autonomous agent collectives\nis the need for sufficient trust between team members. A critical enabling\nfactor for this trust will be a suitably designed dynamic allocation of\nfunction (AoF). We consider AoF in terms of a 'ladder of trust' (from low to\nhigh) with individual team members adjusting trust in their teammates based on\nvariation in 'score' over time. The score is derived by the ability of team\nmember to perceive and understand its situation based on the gathered\ninformation and act to acheive team or self goals. Combining these trust scores\ngives a system-level perspective on how AoF might be adjusted during a mission.\nThat is, the most suitable teammate for a function might have a low trust\nrating from its fellow teammates, so it might be preferable to choose the next\nmost suitable teammate for the function at that point in time. Of course, this\nis only in the situation where the next most suitable teammate is also likely\nto perform within the set framework of moral, ethical, and legal constraints.\nThe trade-offs between trust in the individual agent's capability and\npredictability need to be considered within the broader context of the agent's\nintegrity and accountability. From this perspective, the Allocation Space is\ndefined by more than ability of each agent to perform a function.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}