{"id":"2408.08299","title":"Dynamical Accretion Flows -- ALMAGAL: Flows along filamentary structures\n  in high-mass star-forming clusters","authors":"M. R. A. Wells, H. Beuther, S. Molinari, P. Schilke, C. Battersby, P.\n  Ho, \\'A. S\\'anchez-Monge, B. Jones, M. B. Scheuck, J. Syed, C. Gieser, R.\n  Kuiper, D. Elia, A. Coletta, A. Traficante, J. Wallace, A. J. Rigby, R. S.\n  Klessen, Q. Zhang, S. Walch, M. T. Beltr\\'an, Y. Tang, G. A. Fuller, D. C.\n  Lis, T. M\\\"oller, F. van der Tak, P. D. Klaassen, S. D. Clarke, L.\n  Moscadelli, C. Mininni, H. Zinnecker, Y. Maruccia, S. Pezzuto, M.\n  Benedettini, J. D. Soler, C. L. Brogan, A. Avison, P. Sanhueza, E. Schisano,\n  T. Liu, F. Fontani, K. L. J. Rygl, F. Wyrowski, J. Bally, D. L. Walker, A.\n  Ahmadi, P. Koch, M. Merello, C. Y. Law and L. Testi","authorsParsed":[["Wells","M. R. A.",""],["Beuther","H.",""],["Molinari","S.",""],["Schilke","P.",""],["Battersby","C.",""],["Ho","P.",""],["Sánchez-Monge","Á.",""],["Jones","B.",""],["Scheuck","M. B.",""],["Syed","J.",""],["Gieser","C.",""],["Kuiper","R.",""],["Elia","D.",""],["Coletta","A.",""],["Traficante","A.",""],["Wallace","J.",""],["Rigby","A. J.",""],["Klessen","R. S.",""],["Zhang","Q.",""],["Walch","S.",""],["Beltrán","M. T.",""],["Tang","Y.",""],["Fuller","G. A.",""],["Lis","D. C.",""],["Möller","T.",""],["van der Tak","F.",""],["Klaassen","P. D.",""],["Clarke","S. D.",""],["Moscadelli","L.",""],["Mininni","C.",""],["Zinnecker","H.",""],["Maruccia","Y.",""],["Pezzuto","S.",""],["Benedettini","M.",""],["Soler","J. D.",""],["Brogan","C. L.",""],["Avison","A.",""],["Sanhueza","P.",""],["Schisano","E.",""],["Liu","T.",""],["Fontani","F.",""],["Rygl","K. L. J.",""],["Wyrowski","F.",""],["Bally","J.",""],["Walker","D. L.",""],["Ahmadi","A.",""],["Koch","P.",""],["Merello","M.",""],["Law","C. Y.",""],["Testi","L.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 17:54:21 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 10:29:13 GMT"}],"updateDate":"2024-08-19","timestamp":1723744461000,"abstract":"  We use data from the ALMA Evolutionary Study of High Mass Protocluster\nFormation in the Galaxy (ALMAGAL) survey to study 100 ALMAGAL regions at $\\sim$\n1 arsecond resolution located between $\\sim$ 2 and 6 kpc distance. Using\nALMAGAL $\\sim$ 1.3mm line and continuum data we estimate flow rates onto\nindividual cores. We focus specifically on flow rates along filamentary\nstructures associated with these cores. Our primary analysis is centered around\nposition velocity cuts in H$_2$CO (3$_{0,3}$ - 2$_{0,2}$) which allow us to\nmeasure the velocity fields, surrounding these cores. Combining this work with\ncolumn density estimates we derive the flow rates along the extended\nfilamentary structures associated with cores in these regions. We select a\nsample of 100 ALMAGAL regions covering four evolutionary stages from quiescent\nto protostellar, Young Stellar Objects (YSOs), and HII regions (25 each). Using\ndendrogram and line analysis, we identify a final sample of 182 cores in 87\nregions. In this paper, we present 728 flow rates for our sample (4 per core),\nanalysed in the context of evolutionary stage, distance from the core, and core\nmass. On average, for the whole sample, we derive flow rates on the order of\n$\\sim$10$^{-4}$ M$_{sun}$yr$^{-1}$ with estimated uncertainties of $\\pm$50%. We\nsee increasing differences in the values among evolutionary stages, most\nnotably between the less evolved (quiescent/protostellar) and more evolved\n(YSO/HII region) sources. We also see an increasing trend as we move further\naway from the centre of these cores. We also find a clear relationship between\nthe flow rates and core masses $\\sim$M$^{2/3}$ which is in line with the result\nexpected from the tidal-lobe accretion mechanism. Overall, we see increasing\ntrends in the relationships between the flow rate and the three investigated\nparameters; evolutionary stage, distance from the core, and core mass.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}