{"id":"2408.05223","title":"Economic Struggles and Inflation: How Does that affect voting decision?","authors":"Muhammad Hassan Bin Afzal","authorsParsed":[["Afzal","Muhammad Hassan Bin",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 18:55:36 GMT"}],"updateDate":"2024-08-13","timestamp":1722106536000,"abstract":"  Economic hardships significantly affect public perception and voting\nintentions in general elections. The primary focus of my study is to capture\nthe degree of influence that individual economic hardships have on their\nvoting. I utilize the ANES 2024 Pilot Study1 Survey dataset and introduce a\nnovel composite Inflation Behavior Index (IBR) that captures individuals'\ncumulative economic and cost of living experience. To that effect, the primary\nobjectives of the current study are threefold: first, to develop a composite\neconomic behavior index from available data and variables to capture the\noverall economic experience of U.S. individuals due to ongoing inflation;\nsecond, to examine how this economic behavior impacts political engagement and\nvoting behavior utilizing appropriate and fitting mathematical models; and\nfinally which specific personal experiences and perceptions about economy and\ncost of living likely to revoke party loyalty in upcoming U.S. presidential\nelection. My study finds that increased personal economic struggles (pocketbook\nvoting) due to inflation make it more likely for individuals to express an\nintention to vote against the Incumbent even if the Incumbent is from their\nself-identified political party. Conversely, having a negative perception of\nthe national economy (sociotropic voting) is less likely to revoke party\nloyalty in the upcoming General election. In simpler terms, voters are more\nlikely to vote along party lines even if they perceive their party (the\nIncumbent) is not handling the economy and cost of living well.\n","subjects":["Economics/General Economics","Computing Research Repository/Emerging Technologies","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"l_kmXl_9T5jOvD4d0KXLG5s_mzeYJkGCI9kJJ12Fjzk","pdfSize":"798037"}
