{"id":"2408.14689","title":"Federated User Preference Modeling for Privacy-Preserving Cross-Domain\n  Recommendation","authors":"Li Wang, Shoujin Wang, Quangui Zhang, Qiang Wu, Min Xu","authorsParsed":[["Wang","Li",""],["Wang","Shoujin",""],["Zhang","Quangui",""],["Wu","Qiang",""],["Xu","Min",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 23:29:03 GMT"}],"updateDate":"2024-08-28","timestamp":1724714943000,"abstract":"  Cross-domain recommendation (CDR) aims to address the data-sparsity problem\nby transferring knowledge across domains. Existing CDR methods generally assume\nthat the user-item interaction data is shareable between domains, which leads\nto privacy leakage. Recently, some privacy-preserving CDR (PPCDR) models have\nbeen proposed to solve this problem. However, they primarily transfer simple\nrepresentations learned only from user-item interaction histories, overlooking\nother useful side information, leading to inaccurate user preferences.\nAdditionally, they transfer differentially private user-item interaction\nmatrices or embeddings across domains to protect privacy. However, these\nmethods offer limited privacy protection, as attackers may exploit external\ninformation to infer the original data. To address these challenges, we propose\na novel Federated User Preference Modeling (FUPM) framework. In FUPM, first, a\nnovel comprehensive preference exploration module is proposed to learn users'\ncomprehensive preferences from both interaction data and additional data\nincluding review texts and potentially positive items. Next, a private\npreference transfer module is designed to first learn differentially private\nlocal and global prototypes, and then privately transfer the global prototypes\nusing a federated learning strategy. These prototypes are generalized\nrepresentations of user groups, making it difficult for attackers to infer\nindividual information. Extensive experiments on four CDR tasks conducted on\nthe Amazon and Douban datasets validate the superiority of FUPM over SOTA\nbaselines. Code is available at https://github.com/Lili1013/FUPM.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}