{"id":"2408.16604","title":"Mapping safety transitions as batteries degrade: A model-based analysis\n  towards full-lifespan battery safety management","authors":"Xinlei Gao, Ruihe Li, Gregory J. Offer, Huizhi Wang","authorsParsed":[["Gao","Xinlei",""],["Li","Ruihe",""],["Offer","Gregory J.",""],["Wang","Huizhi",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 15:14:39 GMT"}],"updateDate":"2024-08-30","timestamp":1724944479000,"abstract":"  Battery safety is important, yet safety limits are normally static and do not\nevolve as batteries degrade. Consequently, many battery systems are\noverengineered to meet increasingly stringent safety demands. In this work we\nshow that failure behaviour evolves over time as batteries degrade, and discuss\nthe challenges and opportunities to manage battery safety dynamically\nthroughout its lifetime. We introduce the first framework for capturing how the\nlikelihood and severity of battery failures change over time based upon the\nconcepts of safety zones and their boundaries. Through the development of a\ncomprehensive physics-based model that integrates multiple degradation and\nthermal runaway failure mechanisms, we then show how the safety zones and\nboundaries of a commercial 21700 battery change after varied use and how these\nchanges may lead to false negatives with existing management strategies.\nFurther analyses reveal that degradation mechanisms strongly affect safety\ncharacteristics, causing significant changes despite similar capacity fade,\nhighlighting the limitations of using capacity fade alone to assess batteries'\nusability. By synthesising our results with literature, we map possible\ndegradation-to-failure pathways and recommend future research needs to achieve\nfull-lifespan battery safety management, with advanced diagnostic and modelling\ntechniques to accurately define state-of-safety for real-world applications as\nkey priorities.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-6olxV-U7Bp0FpkGmYuzwTh7y0jwrt699c6VSie5i9c","pdfSize":"3542588"}
