{"id":"2408.02303","title":"PROF: Protected Order Flow in a Profit-Seeking World","authors":"Kushal Babel, Nerla Jean-Louis, Yan Ji, Ujval Misra, Mahimna Kelkar,\n  Kosala Yapa Mudiyanselage, Andrew Miller, Ari Juels","authorsParsed":[["Babel","Kushal",""],["Jean-Louis","Nerla",""],["Ji","Yan",""],["Misra","Ujval",""],["Kelkar","Mahimna",""],["Mudiyanselage","Kosala Yapa",""],["Miller","Andrew",""],["Juels","Ari",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 08:26:10 GMT"}],"updateDate":"2024-08-06","timestamp":1722846370000,"abstract":"  Users of decentralized finance (DeFi) applications face significant risks\nfrom adversarial actions that manipulate the order of transactions to extract\nvalue from users. Such actions -- an adversarial form of what is called\nmaximal-extractable value (MEV) -- impact both individual outcomes and the\nstability of the DeFi ecosystem. MEV exploitation, moreover, is being\ninstitutionalized through an architectural paradigm known Proposer-Builder\nSeparation (PBS).\n  This work introduces a system called PROF (PRotected Order Flow) that is\ndesigned to limit harmful forms of MEV in existing PBS systems. PROF aims at\nthis goal using two ideas. First, PROF imposes an ordering on a set (\"bundle\")\nof privately input transactions and enforces that ordering all the way through\nto block production -- preventing transaction-order manipulation. Second, PROF\ncreates bundles whose inclusion is profitable to block producers, thereby\nensuring that bundles see timely inclusion in blocks.\n  PROF is backward-compatible, meaning that it works with existing and future\nPBS designs. PROF is also compatible with any desired algorithm for ordering\ntransactions within a PROF bundle (e.g., first-come, first-serve, fee-based,\netc.). It executes efficiently, i.e., with low latency, and requires no\nadditional trust assumptions among PBS entities. We quantitatively and\nqualitatively analyze incentive structure of PROF, and its utility to users\ncompared with existing solutions. We also report on inclusion likelihood of\nPROF transactions, and concrete latency numbers through our end-to-end\nimplementation.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FzpFu1DPIVMn82HAj-NGoA5a0yW6xoZNWhiUE5Z8ZFE","pdfSize":"2251593","txDigest":"5Gz989ntqMe9J86TFQkCBiXNaC7FdjJTviFjho9QfPzP","endEpoch":"1","status":"CERTIFIED"}
