{"id":"2408.03248","title":"Optimizing Density Functional Theory for Strain-Dependent Magnetic\n  Properties of MnBi$_2$Te$_4$ with Diffusion Monte Carlo","authors":"Swarnava Ghosh and Jeonghwan Ann and Seoung-Hun Kang and Dameul Jeong\n  and Markus Eisenbach and Young-Kyun Kwon and Fernando A. Reboredo and Jaron\n  T. Krogel and Mina Yoon","authorsParsed":[["Ghosh","Swarnava",""],["Ann","Jeonghwan",""],["Kang","Seoung-Hun",""],["Jeong","Dameul",""],["Eisenbach","Markus",""],["Kwon","Young-Kyun",""],["Reboredo","Fernando A.",""],["Krogel","Jaron T.",""],["Yoon","Mina",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 15:07:47 GMT"}],"updateDate":"2024-08-07","timestamp":1722956867000,"abstract":"  In this study, we evaluate the predictive power of density functional theory\n(DFT) for the magnetic properties of MnBi\\(_2\\)Te\\(_4\\) (MBT), an intrinsically\nmagnetic topological insulator with potential applications in spintronics and\nquantum computing. Our theoretical understanding of MBT has been challenged by\ndiscrepancies between experimental results and \\textit{ab initio} calculations,\nparticularly with respect to its electronic and magnetic properties. Our\nresults show that the magnetic phase diagram of MBT varies significantly\ndepending on the Hubbard $U$ parameter in the DFT framework, highlighting the\nimportance of benchmark calculations. To address these challenges, we establish\nan optimized Hubbard $U$ approach derived from Diffusion Monte Carlo (DMC)\ncalculations, which directly solves the many-body Schr\\\"{o}dinger equation\nbased on the stochastic process, and implement it in the DFT framework. Once\nthe optimized $U$ value is determined as a function of strain, we apply it to\nachieve DMC-level accuracy within our DFT framework. This approach is\ninstrumental in accurately describing the magnetic states of MBT and\nunderstanding the underlying mechanisms governing its magnetic properties and\ntheir dependence on external factors.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}