{"id":"2408.12446","title":"EX-DRL: Hedging Against Heavy Losses with EXtreme Distributional\n  Reinforcement Learning","authors":"Parvin Malekzadeh, Zissis Poulos, Jacky Chen, Zeyu Wang, Konstantinos\n  N. Plataniotis","authorsParsed":[["Malekzadeh","Parvin",""],["Poulos","Zissis",""],["Chen","Jacky",""],["Wang","Zeyu",""],["Plataniotis","Konstantinos N.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 14:41:49 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 14:59:25 GMT"}],"updateDate":"2024-08-28","timestamp":1724337709000,"abstract":"  Recent advancements in Distributional Reinforcement Learning (DRL) for\nmodeling loss distributions have shown promise in developing hedging strategies\nin derivatives markets. A common approach in DRL involves learning the\nquantiles of loss distributions at specified levels using Quantile Regression\n(QR). This method is particularly effective in option hedging due to its direct\nquantile-based risk assessment, such as Value at Risk (VaR) and Conditional\nValue at Risk (CVaR). However, these risk measures depend on the accurate\nestimation of extreme quantiles in the loss distribution's tail, which can be\nimprecise in QR-based DRL due to the rarity and extremity of tail data, as\nhighlighted in the literature. To address this issue, we propose EXtreme DRL\n(EX-DRL), which enhances extreme quantile prediction by modeling the tail of\nthe loss distribution with a Generalized Pareto Distribution (GPD). This method\nintroduces supplementary data to mitigate the scarcity of extreme quantile\nobservations, thereby improving estimation accuracy through QR. Comprehensive\nexperiments on gamma hedging options demonstrate that EX-DRL improves existing\nQR-based models by providing more precise estimates of extreme quantiles,\nthereby improving the computation and reliability of risk metrics for complex\nfinancial risk management.\n","subjects":["Quantitative Finance/Risk Management","Computing Research Repository/Machine Learning","Quantitative Finance/Statistical Finance"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}