{"id":"2408.14966","title":"High fidelity TiN processing modes for multi-gate Ge-based quantum\n  devices","authors":"Sinan Bugu, Sheshank Biradar, Alan Blake, CheWee Liu, Maksym Myronovd,\n  Ray Duffy, Giorgos Fagas and Nikolay Petkov","authorsParsed":[["Bugu","Sinan",""],["Biradar","Sheshank",""],["Blake","Alan",""],["Liu","CheWee",""],["Myronovd","Maksym",""],["Duffy","Ray",""],["Fagas","Giorgos",""],["Petkov","Nikolay",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 11:18:58 GMT"}],"updateDate":"2024-08-28","timestamp":1724757538000,"abstract":"  Charge or spin-qubits can be realized by using gate-defined quantum dots\n(QDs) in semiconductors in a similar fashion to the processes used in CMOS for\nconventional field-effect transistors or more recent fin FET technology.\nHowever, to realize larger number of gate-defined qubits, multiples of gates\nwith ultimately high resolution and fidelity is required. Electron beam\nlithography (EBL) offers flexible and tunable patterning of gate-defined\nspin-qubit devices for studying important quantum phenomena. While such devices\nare commonly realized by a positive resist process using metal lift-off, there\nare several clear limitations related to the resolution and the fidelity of\npatterning. Herein, we report a systematic study of an alternative TiN\nmulti-gates definition approach based on the highest resolution hydrogen\nsilsesquioxane (HSQ) EBL resist and all associated processing modes. The TiN\ngate arrays formed show excellent fidelity, dimensions down to 15 nm, various\ndensities, and complexities. The processing modes developed were used to\ndemonstrate applicability of this approach to forming multi-gate architectures\nfor two types of spin-qubit devices prototypic to i) NW/fin-type FETs and ii)\nplanar quantum well-type devices, both utilizing epi-grown Ge device layers on\nSi, where GeSn or Ge are the host materials for the QDs.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}