{"id":"2408.05681","title":"SRTFD: Scalable Real-Time Fault Diagnosis through Online Continual\n  Learning","authors":"Dandan Zhao, Karthick Sharma, Hongpeng Yin, Yuxin Qi, Shuhao Zhang","authorsParsed":[["Zhao","Dandan",""],["Sharma","Karthick",""],["Yin","Hongpeng",""],["Qi","Yuxin",""],["Zhang","Shuhao",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 03:26:22 GMT"}],"updateDate":"2024-08-13","timestamp":1723346782000,"abstract":"  Fault diagnosis (FD) is essential for maintaining operational safety and\nminimizing economic losses by detecting system abnormalities. Recently, deep\nlearning (DL)-driven FD methods have gained prominence, offering significant\nimprovements in precision and adaptability through the utilization of extensive\ndatasets and advanced DL models. Modern industrial environments, however,\ndemand FD methods that can handle new fault types, dynamic conditions,\nlarge-scale data, and provide real-time responses with minimal prior\ninformation. Although online continual learning (OCL) demonstrates potential in\naddressing these requirements by enabling DL models to continuously learn from\nstreaming data, it faces challenges such as data redundancy, imbalance, and\nlimited labeled data. To overcome these limitations, we propose SRTFD, a\nscalable real-time fault diagnosis framework that enhances OCL with three\ncritical methods: Retrospect Coreset Selection (RCS), which selects the most\nrelevant data to reduce redundant training and improve efficiency; Global\nBalance Technique (GBT), which ensures balanced coreset selection and robust\nmodel performance; and Confidence and Uncertainty-driven Pseudo-label Learning\n(CUPL), which updates the model using unlabeled data for continuous adaptation.\nExtensive experiments on a real-world dataset and two public simulated datasets\ndemonstrate SRTFD's effectiveness and potential for providing advanced,\nscalable, and precise fault diagnosis in modern industrial systems.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XcsLPO0EIFK8tq9c1jHo2ZarTZRj9PXLrXaDD_CmJC4","pdfSize":"587578"}
