{"id":"2408.01779","title":"MathLearner: A Large Language Model Agent Framework for Learning to\n  Solve Mathematical Problems","authors":"Wenbei Xie, Donglin Liu, Haoran Yan, Wenjie Wu, Zongyang Liu","authorsParsed":[["Xie","Wenbei",""],["Liu","Donglin",""],["Yan","Haoran",""],["Wu","Wenjie",""],["Liu","Zongyang",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 13:28:19 GMT"}],"updateDate":"2024-08-06","timestamp":1722691699000,"abstract":"  With the development of artificial intelligence (AI), large language models\n(LLM) are widely used in many fields. However, the reasoning ability of LLM is\nstill very limited when it comes to mathematical reasoning. Mathematics plays\nan important role in all aspects of human society and is a technical guarantee\nin the fields of healthcare, transport and aerospace, for this reason, the\ndevelopment of AI big language models in the field of mathematics has great\npotential significance. To improve the mathematical reasoning ability of large\nlanguage models, we proposed an agent framework for learning to solve\nmathematical problems based on inductive reasoning. By emulating the human\nlearning process of generalization of learned information and effective\napplication of previous knowledge in new reasoning tasks, this framework has\ngreat performance in the mathematical reasoning process. It improves global\naccuracy over the baseline method (chain-of-thought) by 20.96% and solves\n17.54% of the mathematical problems that the baseline cannot solve. Benefiting\nfrom the efficient RETRIEVAL method, our model improves the ability of large\nlanguage models to efficiently use external knowledge, i.e., the mathematical\ncomputation of the model can be based on written procedures. In education, our\nmodel can be used as a personalised learning aid, thus reducing the inequality\nof educational resources.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}