{"id":"2408.12815","title":"Staircase Cascaded Fusion of Lightweight Local Pattern Recognition and\n  Long-Range Dependencies for Structural Crack Segmentation","authors":"Hui Liu, Chen Jia, Fan Shi, Xu Cheng, Mianzhao Wang, and Shengyong\n  Chen","authorsParsed":[["Liu","Hui",""],["Jia","Chen",""],["Shi","Fan",""],["Cheng","Xu",""],["Wang","Mianzhao",""],["Chen","Shengyong",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 03:21:51 GMT"}],"updateDate":"2024-08-26","timestamp":1724383311000,"abstract":"  Detecting cracks with pixel-level precision for key structures is a\nsignificant challenge, as existing methods struggle to effectively integrate\nlocal textures and pixel dependencies of cracks. Furthermore, these methods\noften possess numerous parameters and substantial computational requirements,\ncomplicating deployment on edge devices. In this paper, we propose a staircase\ncascaded fusion crack segmentation network (CrackSCF) that generates\nhigh-quality crack segmentation maps using minimal computational resources. We\nconstructed a staircase cascaded fusion module that effectively captures local\npatterns of cracks and long-range dependencies of pixels, and it can suppress\nbackground noise well. To reduce the computational resources required by the\nmodel, we introduced a lightweight convolution block, which replaces all\nconvolution operations in the network, significantly reducing the required\ncomputation and parameters without affecting the network's performance. To\nevaluate our method, we created a challenging benchmark dataset called TUT and\nconducted experiments on this dataset and five other public datasets. The\nexperimental results indicate that our method offers significant advantages\nover existing methods, especially in handling background noise interference and\ndetailed crack segmentation. The F1 and mIoU scores on the TUT dataset are\n0.8382 and 0.8473, respectively, achieving state-of-the-art (SOTA) performance\nwhile requiring the least computational resources. The code and dataset is\navailable at https://github.com/Karl1109/CrackSCF.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}