{"id":"2408.11247","title":"Unboxing Occupational Bias: Grounded Debiasing of LLMs with U.S. Labor\n  Data","authors":"Atmika Gorti, Manas Gaur, Aman Chadha","authorsParsed":[["Gorti","Atmika",""],["Gaur","Manas",""],["Chadha","Aman",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 23:54:26 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 02:11:32 GMT"}],"updateDate":"2024-08-28","timestamp":1724198066000,"abstract":"  Large Language Models (LLMs) are prone to inheriting and amplifying societal\nbiases embedded within their training data, potentially reinforcing harmful\nstereotypes related to gender, occupation, and other sensitive categories. This\nissue becomes particularly problematic as biased LLMs can have far-reaching\nconsequences, leading to unfair practices and exacerbating social inequalities\nacross various domains, such as recruitment, online content moderation, or even\nthe criminal justice system. Although prior research has focused on detecting\nbias in LLMs using specialized datasets designed to highlight intrinsic biases,\nthere has been a notable lack of investigation into how these findings\ncorrelate with authoritative datasets, such as those from the U.S. National\nBureau of Labor Statistics (NBLS). To address this gap, we conduct empirical\nresearch that evaluates LLMs in a ``bias-out-of-the-box\" setting, analyzing how\nthe generated outputs compare with the distributions found in NBLS data.\nFurthermore, we propose a straightforward yet effective debiasing mechanism\nthat directly incorporates NBLS instances to mitigate bias within LLMs. Our\nstudy spans seven different LLMs, including instructable, base, and\nmixture-of-expert models, and reveals significant levels of bias that are often\noverlooked by existing bias detection techniques. Importantly, our debiasing\nmethod, which does not rely on external datasets, demonstrates a substantial\nreduction in bias scores, highlighting the efficacy of our approach in creating\nfairer and more reliable LLMs.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5KIkLzrkbam5R912aggBgofPDK5ZVqXAAHSIo5d_s5s","pdfSize":"379767"}
