{"id":"2408.12809","title":"DutyTTE: Deciphering Uncertainty in Origin-Destination Travel Time\n  Estimation","authors":"Xiaowei Mao, Yan Lin, Shengnan Guo, Yubin Chen, Xingyu Xian, Haomin\n  Wen, Qisen Xu, Youfang Lin, and Huaiyu Wan","authorsParsed":[["Mao","Xiaowei",""],["Lin","Yan",""],["Guo","Shengnan",""],["Chen","Yubin",""],["Xian","Xingyu",""],["Wen","Haomin",""],["Xu","Qisen",""],["Lin","Youfang",""],["Wan","Huaiyu",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 03:06:04 GMT"}],"updateDate":"2024-08-26","timestamp":1724382364000,"abstract":"  Uncertainty quantification in travel time estimation (TTE) aims to estimate\nthe confidence interval for travel time, given the origin (O), destination (D),\nand departure time (T). Accurately quantifying this uncertainty requires\ngenerating the most likely path and assessing travel time uncertainty along the\npath. This involves two main challenges: 1) Predicting a path that aligns with\nthe ground truth, and 2) modeling the impact of travel time in each segment on\noverall uncertainty under varying conditions. We propose DutyTTE to address\nthese challenges. For the first challenge, we introduce a deep reinforcement\nlearning method to improve alignment between the predicted path and the ground\ntruth, providing more accurate travel time information from road segments to\nimprove TTE. For the second challenge, we propose a mixture of experts guided\nuncertainty quantification mechanism to better capture travel time uncertainty\nfor each segment under varying contexts. Additionally, we calibrate our results\nusing Hoeffding's upper-confidence bound to provide statistical guarantees for\nthe estimated confidence intervals. Extensive experiments on two real-world\ndatasets demonstrate the superiority of our proposed method.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZQ7RKrietziMgAjZ4FBVd-Pir-VnlDLegJNFVLkNcJ0","pdfSize":"1883812"}
