{"id":"2408.02098","title":"Three-phase equilibria of hydrates from computer simulation. I.\n  Finite-size effects in the methane hydrate","authors":"S. Blazquez, J. Algaba, J. M. M\\'iguez, C. Vega, F. J. Blas, and M. M.\n  Conde","authorsParsed":[["Blazquez","S.",""],["Algaba","J.",""],["Míguez","J. M.",""],["Vega","C.",""],["Blas","F. J.",""],["Conde","M. M.",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 17:39:13 GMT"}],"updateDate":"2024-08-06","timestamp":1722793153000,"abstract":"  Clathrate hydrates are vital in energy research and environmental\napplications. Understanding their stability is crucial for harnessing their\npotential. In this work, we employ direct coexistence simulations to study\nfinite-size effects in the determination of the three-phase equilibrium\ntemperature ($T_3$) for methane hydrates. Two popular water models, TIP4P/Ice\nand TIP4P/2005, are employed, exploring various system sizes by varying the\nnumber of molecules in the hydrate, liquid, and gas phases. The results reveal\nthat finite-size effects play a crucial role in determining $T_3$. The study\nincludes nine configurations with varying system sizes, demonstrating that\nsmaller systems, particularly those leading to stoichiometric conditions and\nbubble formation, may yield inaccurate $T_3$ values. The emergence of methane\nbubbles within the liquid phase, observed in smaller configurations,\nsignificantly influences the behavior of the system and can lead to erroneous\ntemperature estimations. Our findings reveal finite size effects on the\ncalculation of the $T_3$ by direct coexistence simulations and clarify the\nsystem size convergence for both models, shedding light on discrepancies found\nin the literature. The results contribute to a deeper understanding of the\nphase equilibrium of gas hydrates and offer valuable information for future\nresearch in this field.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/"}