{"id":"2408.02804","title":"GEO600 beam splitter thermal compensation system: new design and\n  commissioning","authors":"S\\'everin Nadji, Holger Wittel, Nikhil Mukund, James Lough, Christoph\n  Affeldt, Fabio Bergamin, Marc Brinkmann, Volker Kringel, Harald L\\\"uck,\n  Michael Weinert and Karsten Danzmann","authorsParsed":[["Nadji","Séverin",""],["Wittel","Holger",""],["Mukund","Nikhil",""],["Lough","James",""],["Affeldt","Christoph",""],["Bergamin","Fabio",""],["Brinkmann","Marc",""],["Kringel","Volker",""],["Lück","Harald",""],["Weinert","Michael",""],["Danzmann","Karsten",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 19:48:12 GMT"}],"updateDate":"2024-08-07","timestamp":1722887292000,"abstract":"  Gravitational waves have revolutionised the field of astronomy by providing\nscientists with a new way to observe the universe and gain a better\nunderstanding of exotic objects like black holes. Several large-scale laser\ninterferometric gravitational wave detectors (GWDs) have been constructed\nworldwide, with a focus on achieving the best sensitivity possible. However, in\norder for a detector to operate at its intended sensitivity, its optics must be\nfree from imperfections such as thermal lensing effects. In the GEO\\,600\ngravitational wave detector, the beam splitter (BS) experiences a significant\nthermal lensing effect due to the high power build-up in the Power Recycling\nCavity (PRC) combined with a very small beam waist. This causes the fundamental\nmode to be converted into higher order modes (HOMs), subsequently impacting the\ndetector's performance. To address this issue, the GEO\\,600 detector is\nequipped with a thermal compensation system (TCS) applied to the BS. This\ninvolves projecting a spatially tunable heating pattern through an optical\nsystem onto the beam splitter. The main objective of the TCS is to counteract\nthe thermal lens at the BS and restore the detector to its ideal operating\ncondition. This paper presents the new beam splitter TCS in GEO\\,600, its\ncommissioning, and its effect on strain sensitivity. It also outlines the\nplanned upgrade to further enhance the performance of the TCS.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Instrumentation and Detectors"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}