{"id":"2408.13763","title":"Characterisation of local halo building blocks: Thamnos and Sequoia","authors":"Emma Dodd, Tom\\'as Ruiz-Lara, Amina Helmi, Carme Gallart, Thomas M.\n  Callingham, Santi Cassisi, Emma Fern\\'andez-Alvar, Fransisco Surot","authorsParsed":[["Dodd","Emma",""],["Ruiz-Lara","Tomás",""],["Helmi","Amina",""],["Gallart","Carme",""],["Callingham","Thomas M.",""],["Cassisi","Santi",""],["Fernández-Alvar","Emma",""],["Surot","Fransisco",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 08:15:06 GMT"}],"updateDate":"2024-08-27","timestamp":1724573706000,"abstract":"  A crucial aspect of galaxy evolution is the pace at which galaxies build up\ntheir mass. We can investigate this hierarchical assembly by uncovering and\ntiming accretion events that our galaxy has experienced. In the Milky Way,\naccreted debris has been previously identified in the local halo, thanks to the\nadvent of Gaia data. We aim to couple this dataset with advancements in\ncolour-magnitude diagram fitting techniques to characterise the building blocks\nof the Galaxy. Here we focus on the retrograde halo, specifically Thamnos and\nSequoia. We do this as part of the ChronoGal project by fitting absolute\ncolour-magnitude diagrams (using CMDft.Gaia) of samples of stars associated\nwith these substructures, extracted from a local 5D Gaia DR3 dataset. Comparing\ntheir derived age and metallicity distributions with those of the expected\ncontamination, from the dominant Gaia Enceladus and low energy in-situ\npopulations, we can unveil the stellar population signatures of the progenitors\nof Sequoia and Thamnos. We show that both Thamnos and Sequoia have a metal-poor\npopulation ([Fe/H]<-1.5 dex) that is distinct from the expected contamination.\nThe age distributions allow us to see that Sequoia formed half of its stars by\na lookback time of 12 Gyr, while Thamnos is on average older, having formed\nhalf its stars at 12.3 Gyr. Gaia Enceladus and the low energy in-situ\npopulations formed half of their stars by 12.1 Gyr and 12.9 Gyr respectively.\nThis suggests that Thamnos was accreted earlier than Gaia Enceladus and Sequoia\nis the most recent accretion event. We have presented, for the first time, age\ndistributions of the retrograde halo substructures: Sequoia and Thamnos. These\nare derived purely photometrically using CMD fitting techniques, which also\nprovide metallicity distributions that successfully reproduce the spectroscopic\ndistributions, highlighting the capability of CMDft.Gaia.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}