{"id":"2408.02974","title":"Coupling of magnetism and transport properties to the lattice degrees of\n  freedom in NdBaCo_2O_{5+{\\delta}} ({\\delta} ~ 0.65)","authors":"Himanshu Pant, Saurabh Singh, Jaskirat Brar, Priyamedha Sharma, M.\n  Bharath, Kentaro Kuga, Tsunehiro Takeuchi, and R. Bindu","authorsParsed":[["Pant","Himanshu",""],["Singh","Saurabh",""],["Brar","Jaskirat",""],["Sharma","Priyamedha",""],["Bharath","M.",""],["Kuga","Kentaro",""],["Takeuchi","Tsunehiro",""],["Bindu","R.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 06:12:58 GMT"}],"updateDate":"2024-08-07","timestamp":1722924778000,"abstract":"  We have studied the origin of zero volume expansion below the Curie\ntemperature (Tc), variable range hopping (VRH) behaviour using structural,\nmagnetic, transport and thermal studies on the oxygen deficient double\nperovskite NdBaCo_2O_{5+{\\delta}} ({\\delta} = 0.65). The valence state of Co\nions and the possible properties exhibited by such compound were studied using\nelectronic structure calculations for {\\delta} = 0.75. Careful investigation of\nstructure shows that the compound stabilizes in tetragonal structure (P4/mmm)\nhaving 2a_p X 2a_p X 2a_p (222) superstructure, where a_p is the cubic\nperovskite lattice parameter. The compound exhibits a minimum in resistivity,\nferromagnetic and ferrimagnetic transitions around 375 K, 120 K (T_c) and 60 K,\nrespectively with signature of Griffiths phase above T_c. Our detailed\nstructural analysis suggests signature of the onset of the above magnetic\ntransitions at temperatures well above its stabilisation at long range level\nthereby leading to VRH behaviour. The observed zero thermal expansion in volume\nbelow Tc appears to be due to competing magnetic interactions within and\nbetween the magnetic sublattices. Our electronic structure calculations show\n(a) the importance of electron-electron correlation in Nd 4f and Co 3d states\n(b) Co ions stabilize in intermediate spin (IS) state, having oxidation state\nless than +3 (c) half metallicity. Our results show the possibility of coupling\nbetween magnetism and ferroelectricity. We believe that our results especially\non the valence state of the Co ion, zero thermal expansion in volume, short\nrange magnetic orderings and the connection between different degrees of\nfreedom will be helpful in clearing the ambiguities existing in literature on\nthe nature of magnetism and thereby aiding in designing new functionalities.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}