{"id":"2408.16135","title":"$\\texttt{MEDEA}$: A New Model for Emulating Radio Antenna Beam Patterns\n  for 21-cm Cosmology and Antenna Design Studies","authors":"Joshua J. Hibbard, Bang D. Nhan, David Rapetti, Jack O. Burns","authorsParsed":[["Hibbard","Joshua J.",""],["Nhan","Bang D.",""],["Rapetti","David",""],["Burns","Jack O.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 20:51:56 GMT"}],"updateDate":"2024-08-30","timestamp":1724878316000,"abstract":"  In 21-cm experimental cosmology, accurate characterization of a radio\ntelescope's antenna beam response is essential to measure the 21-cm signal.\nComputational electromagnetic (CEM) simulations estimate the antenna beam\npattern and frequency response by subjecting the EM model to different\ndependencies, or beam hyper-parameters, such as soil dielectric constant or\norientation with the environment. However, it is computationally expensive to\nsearch all possible parameter spaces to optimize the antenna design or\naccurately represent the beam to the level required for use as a systematic\nmodel in 21-cm cosmology. We therefore present $\\texttt{MEDEA}$, an emulator\nwhich rapidly and accurately generates farfield radiation patterns over a large\nhyper-parameter space. $\\texttt{MEDEA}$ takes a subset of beams simulated by\nCEM software, spatially decomposes them into coefficients in a complete, linear\nbasis, and then interpolates them to form new beams at arbitrary\nhyper-parameters. We test $\\texttt{MEDEA}$ on an analytical dipole and two\nnumerical beams motivated by upcoming lunar lander missions, and then employ\n$\\texttt{MEDEA}$ as a model to fit mock radio spectrometer data to extract\ncovariances on the input beam hyper-parameters. We find that the interpolated\nbeams have RMS relative errors of at most $10^{-2}$ using 20 input beams or\nless, and that fits to mock data are able to recover the input beam\nhyper-parameters when the model and mock derive from the same set of beams.\nWhen a systematic bias is introduced into the mock data, extracted beam\nhyper-parameters exhibit bias, as expected. We propose several future\nextensions to $\\texttt{MEDEA}$ to potentially account for such bias.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2CFc7oAedm5iZS9SAwH2nqUD87uDB7FZ0p4hOHBvQdo","pdfSize":"3465387"}
