{"id":"2408.06008","title":"Harmonic Stability Analysis of Microgrids with Converter-Interfaced\n  Distributed Energy Resources, Part II: Case Studies","authors":"Johanna Kristin Maria Becker, Andreas Martin Kettner, Mario Paolone","authorsParsed":[["Becker","Johanna Kristin Maria",""],["Kettner","Andreas Martin",""],["Paolone","Mario",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 08:54:38 GMT"}],"updateDate":"2024-08-13","timestamp":1723452878000,"abstract":"  In Part I of this paper a method for the Harmonic Stability Assessment (HSA)\nof power systems with a high share of Converter-Interfaced Distributed Energy\nResources (CIDERs) was proposed. Specifically, the Harmonic State-Space (HSS)\nmodel of a generic power system is derived through combination of the\ncomponents HSS models. The HSS models of CIDERs and grid are based on Linear\nTime-Periodic (LTP) models, capable of representing the coupling between\ndifferent harmonics. In Part II, the HSA of a grid-forming, and two\ngrid-following CIDERs (i.e., ex- and including the DC-side modelling) is\nperformed. More precisely, the classification of the eigenvalues, the impact of\nthe maximum harmonic order on the locations of the eigenvalues, and the\nsensitivity curves of the eigenvalues w.r.t. to control parameters are\nprovided. These analyses allow to study the physical meaning and origin of the\nCIDERs eigenvalues. Additionally, the HSA is performed for a representative\nexample system derived from the CIGRE low-voltage benchmark system. A case of\nharmonic instability is identified through the system eigenvalues, and\nvalidated with Time-Domain Simulations (TDS) in Simulink. It is demonstrated\nthat, as opposed to stability analyses based on Linear Time-Invariant (LTI)\nmodels, the HSA is suitable for the detection of harmonic instability.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}