{"id":"2408.04256","title":"Exploring the origin of cold gas and star formation in a rare population\n  of strongly bulge-dominated early-type Galaxies","authors":"Fujia Li, Enci Wang, Ming Zhu, Yingjie Peng, Jing Wang, Chuanpeng\n  Zhang, Zesen Lin, Yu Rong, Hongxin Zhang, Xu Kong","authorsParsed":[["Li","Fujia",""],["Wang","Enci",""],["Zhu","Ming",""],["Peng","Yingjie",""],["Wang","Jing",""],["Zhang","Chuanpeng",""],["Lin","Zesen",""],["Rong","Yu",""],["Zhang","Hongxin",""],["Kong","Xu",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 06:49:35 GMT"}],"updateDate":"2024-08-09","timestamp":1723099775000,"abstract":"  We analyze the properties of a rare population, the strongly bulge-dominated\nearly-type galaxies (referred to as sBDEs) with significant HI gas, using the\ndatabases from the FAST All Sky HI survey (FASHI) and the Arecibo Legacy Fast\nALFA (ALFALFA) survey. We select the sBDEs from the Sloan Digital Sky Survey\n(SDSS) and cross-match with the FASHI-ALFALFA combined HI sample, resulting in\n104 HI-rich sBDEs. These sBDEs tend to have extremely high HI reservoirs, which\nis rare in previous studies such as ATLAS$^{3D}$. 70% of the selected sBDEs are\nclassified as quiescent galaxies, even though they have a large HI reservoir.\nWe study the properties of these sBDEs from five main aspects: stellar\npopulation, gas-phase metallicity, stacked HI spectra, environment, and\nspatially resolved MaNGA data. The majority of HI-rich sBDEs appear to show\nlower gas-phase metallicity and are located in significantly lower-density\nenvironments, suggesting an external origin for their HI gas. We find that\nstar-forming sBDEs exhibit statistically higher star formation efficiency and\nslightly older stellar populations compared to normal star-forming galaxies,\nsuggesting a recent star formation on Gyr-timescale. They also show narrower\nand more concentrated HI profiles compared to control star-forming galaxies,\nwhich may explain their higher star formation efficiency.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}