{"id":"2408.14242","title":"Intracellular order formation through stepwise phase transitions","authors":"Yuika Ueda and Shinji Deguchi","authorsParsed":[["Ueda","Yuika",""],["Deguchi","Shinji",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 12:57:10 GMT"}],"updateDate":"2024-08-27","timestamp":1724677030000,"abstract":"  Living cells inherently exhibit the ability to spontaneously reorganize their\nstructures in response to changes in both their internal and external\nenvironments. Among these responses, the organization of stress fibers composed\nof actin molecules changes in direct accordance with the mechanical stiffness\nof their environments. On soft substrates, SFs are rarely formed, but as\nstiffness increases, they emerge with random orientation, progressively align,\nand eventually form thicker bundles as stiffness surpasses successive\nthresholds. These transformations share similarities with phase transitions\nstudied in condensed matter physics, yet despite extensive research on cellular\ndynamics, the introduction of the statistical mechanics perspective to the\nenvironmental dependence of intracellular structures remains underexplored.\nWith this physical framework, we identify key relationships governing these\nintracellular transitions, highlighting the delicate balance between energy and\nentropy. Our analysis provides a unified understanding of the stepwise phase\ntransitions of actin structures, offering new insights into related biological\nmechanisms. Notably, our study suggests the existence of mechanical checkpoints\nin the G1 phase of the cell cycle, which sequentially regulate the formation of\nintracellular structures to ensure proper cell cycle progression.\n","subjects":["Quantitative Biology/Cell Behavior","Quantitative Biology/Molecular Networks","Quantitative Biology/Subcellular Processes"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"-MTF0jzCw6lmannCcDrJr-3_UuTFLiAwR2R3v0xlXU8","pdfSize":"2158575"}
