{"id":"2408.03829","title":"PeerSwap: A Peer-Sampler with Randomness Guarantees","authors":"Rachid Guerraoui, Anne-Marie Kermarrec, Anastasiia Kucherenko, Rafael\n  Pinot, Marijn de Vos","authorsParsed":[["Guerraoui","Rachid",""],["Kermarrec","Anne-Marie",""],["Kucherenko","Anastasiia",""],["Pinot","Rafael",""],["de Vos","Marijn",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 15:08:26 GMT"}],"updateDate":"2024-08-08","timestamp":1723043306000,"abstract":"  The ability of a peer-to-peer (P2P) system to effectively host decentralized\napplications often relies on the availability of a peer-sampling service, which\nprovides each participant with a random sample of other peers. Despite the\npractical effectiveness of existing peer samplers, their ability to produce\nrandom samples within a reasonable time frame remains poorly understood from a\ntheoretical standpoint. This paper contributes to bridging this gap by\nintroducing PeerSwap, a peer-sampling protocol with provable randomness\nguarantees. We establish execution time bounds for PeerSwap, demonstrating its\nability to scale effectively with the network size. We prove that PeerSwap\nmaintains the fixed structure of the communication graph while allowing\nsequential peer position swaps within this graph. We do so by showing that\nPeerSwap is a specific instance of an interchange process, a renowned model for\nparticle movement analysis. Leveraging this mapping, we derive execution time\nbounds, expressed as a function of the network size N. Depending on the network\nstructure, this time can be as low as a polylogarithmic function of N,\nhighlighting the efficiency of PeerSwap. We implement PeerSwap and conduct\nnumerical evaluations using regular graphs with varying connectivity and\ncontaining up to 32768 (2^15) peers. Our evaluation demonstrates that PeerSwap\nquickly provides peers with uniform random samples of other peers.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nX7_EgES3vRHIu0-8H5e6hsrWQ48JwQRL1yA9VV7pw0","pdfSize":"802213"}
