{"id":"2408.10801","title":"Solving an Industrially Relevant Quantum Chemistry Problem on Quantum\n  Hardware","authors":"Ludwig N\\\"utzel, Alexander Gresch, Lukas Hehn, Lucas Marti, Robert\n  Freund, Alex Steiner, Christian D. Marciniak, Timo Eckstein, Nina Stockinger,\n  Stefan Wolf, Thomas Monz, Michael K\\\"uhn and Michael J. Hartmann","authorsParsed":[["Nützel","Ludwig",""],["Gresch","Alexander",""],["Hehn","Lukas",""],["Marti","Lucas",""],["Freund","Robert",""],["Steiner","Alex",""],["Marciniak","Christian D.",""],["Eckstein","Timo",""],["Stockinger","Nina",""],["Wolf","Stefan",""],["Monz","Thomas",""],["Kühn","Michael",""],["Hartmann","Michael J.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 12:50:15 GMT"}],"updateDate":"2024-08-21","timestamp":1724158215000,"abstract":"  Quantum chemical calculations are among the most promising applications for\nquantum computing. Implementations of dedicated quantum algorithms on available\nquantum hardware were so far, however, mostly limited to comparatively simple\nsystems without strong correlations. As such, they can also be addressed by\nclassically efficient single-reference methods. In this work, we calculate the\nlowest energy eigenvalue of active space Hamiltonians of industrially relevant\nand strongly correlated metal chelates on trapped ion quantum hardware, and\nintegrate the results into a typical industrial quantum chemical workflow to\narrive at chemically meaningful properties. We are able to achieve chemical\naccuracy by training a variational quantum algorithm on quantum hardware,\nfollowed by a classical diagonalization in the subspace of states measured as\noutputs of the quantum circuit. This approach is particularly\nmeasurement-efficient, requiring 600 single-shot measurements per cost function\nevaluation on a ten qubit system, and allows for efficient post-processing to\nhandle erroneous runs.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}