{"id":"2408.16198","title":"Chain-of-Experts (CoE): Reverse Engineering Software Bills of Materials\n  for JavaScript Application Bundles through Code Clone Search","authors":"Leo Song, Steven H. H. Ding, Yuan Tian, Li Tao Li, Philippe Charland,\n  Andrew Walenstein","authorsParsed":[["Song","Leo",""],["Ding","Steven H. H.",""],["Tian","Yuan",""],["Li","Li Tao",""],["Charland","Philippe",""],["Walenstein","Andrew",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 01:32:49 GMT"}],"updateDate":"2024-08-30","timestamp":1724895169000,"abstract":"  A Software Bill of Materials (SBoM) is a detailed inventory of all\ncomponents, libraries, and modules in a software artifact, providing\ntraceability throughout the software supply chain. With the increasing\npopularity of JavaScript in software engineering due to its dynamic syntax and\nseamless supply chain integration, the exposure to vulnerabilities and attacks\nhas risen significantly. A JavaScript application bundle, which is a\nconsolidated, symbol-stripped, and optimized assembly of code for deployment\npurpose. Generating a SBoM from a JavaScript application bundle through a\nreverse-engineering process ensures the integrity, security, and compliance of\nthe supplier's software release, even without access to the original dependency\ngraphs.\n  This paper presents the first study on SBoM generation for JavaScript\napplication bundles. We identify three key challenges for this task, i.e.,\nnested code scopes, extremely long sequences, and large retrieval spaces. To\naddress these challenges, we introduce Chain-of-Experts (CoE), a multi-task\ndeep learning model designed to generate SBoMs through three tasks: code\nsegmentation, code classification, and code clone retrieval. We evaluate CoE\nagainst individual task-specific solutions on 500 web application bundles with\nover 66,000 dependencies. Our experimental results demonstrate that CoE offers\ncompetitive outcomes with less training and inference time when compared with\ncombined individual task-specific solutions. Consequently, CoE provides the\nfirst scalable, efficient, and end-to-end solution for the SBoM generation of\nreal-world JavaScript application bundles.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/"}