{"id":"2408.08746","title":"Accelerating Iteratively Linear Detectors in Multi-User (ELAA-)MIMO\n  Systems with UW-SVD","authors":"Jiuyu Liu, Yi Ma, Jinfei Wang, Rahim Tafazolli","authorsParsed":[["Liu","Jiuyu",""],["Ma","Yi",""],["Wang","Jinfei",""],["Tafazolli","Rahim",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 13:46:42 GMT"}],"updateDate":"2024-08-19","timestamp":1723816002000,"abstract":"  Current iterative multiple-input multiple-output (MIMO) detectors suffer from\nslow convergence when the wireless channel is ill-conditioned. The\nill-conditioning is mainly caused by spatial correlation between channel\ncolumns corresponding to the same user equipment, known as intra-user\ninterference. In addition, in the emerging MIMO systems using an extremely\nlarge aperture array (ELAA), spatial non-stationarity can make the channel even\nmore ill-conditioned. In this paper, user-wise singular value decomposition\n(UW-SVD) is proposed to accelerate the convergence of iterative MIMO detectors.\nIts basic principle is to perform SVD on each user's sub-channel matrix to\neliminate intra-user interference. Then, the MIMO signal model is effectively\ntransformed into an equivalent signal (e-signal) model, comprising an e-channel\nmatrix and an e-signal vector. Existing iterative algorithms can be used to\nrecover the e-signal vector, which undergoes post-processing to obtain the\nsignal vector. It is proven that the e-channel matrix is better conditioned\nthan the original MIMO channel for spatially correlated (ELAA-)MIMO channels.\nThis implies that UW-SVD can accelerate current iterative algorithms, which is\nconfirmed by our simulation results. Specifically, it can speed up convergence\nby up to 10 times in both uncoded and coded systems.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}