{"id":"2408.14260","title":"Validation of the RR Lyrae period determination in the Pan-STARRS PS1\n  3$\\pi$ survey with K2","authors":"Adrienn Forr\\'o, L\\'aszl\\'o Moln\\'ar, Emese Plachy, \\'Aron Juh\\'asz\n  and R\\'obert Szab\\'o","authorsParsed":[["Forró","Adrienn",""],["Molnár","László",""],["Plachy","Emese",""],["Juhász","Áron",""],["Szabó","Róbert",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 13:26:56 GMT"}],"updateDate":"2024-08-27","timestamp":1724678816000,"abstract":"  The Pan-STARRS 3$\\pi$ survey has detected hundreds of thousands of variable\nstars thanks to its coverage and 4-year time span, even though the sampling of\nthe light curves is relatively sparse. These light curves contain only 10-15\ndetections in each of the five filters (g,r,i,z,y). During the K2 mission, the\nKepler space telescope observed with a high sampling frequency, although only\nfor about 80 days in each of its campaigns. Crossmatching and investigating the\nRR Lyrae stars observed by both K2 and Pan-STARRS can serve as a valuable tool\nto validate the classification and period determination of the survey. We used\nthe Sesar catalogue of RR Lyrae stars detected by Pan-STARRS. After determining\nthe overlap, we also considered the Gaia DR3 RR Lyrae catalogue data for these\nstars wherever it was available. The frequencies of the light variations were\ncalculated by applying the Lomb-Scargle periodogram method on the K2 light\ncurves that were prepared with autoEAP photometry. The calculated frequencies\nof the stars then were compared with those given in the Sesar catalogue and the\nGaia DR3 RR Lyrae catalogue. We found that for the majority of the stars, the\nclassification (95.6%) and the frequency determination (90.1%) of the PanSTARRS\nRR Lyrae stars were consistent within 0.03 d-1 with those that we derived from\nthe K2 autoEAP light curves. For a significant subset of the sample, 7.4%,\nhowever, an offset of 1 or 2 d-1 was found in the frequencies. These are the\nresult of the sampling of the detections, because Pan-STARRS observations are\naffected by diurnal cycles, whereas Kepler carried out measurements\nquasicontinuously. We found that RRc subtypes are significantly more affected\n(25.3%) than RRab subtypes (3.7%), which is most likely caused by RRc stars\nhaving less sharp light curve features. Validation via space-based data will be\nimportant for future ground-based surveys, as well.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}