{"id":"2408.14078","title":"Superluminal proper motion in the X-ray jet of Centaurus A","authors":"David Bogensberger, Jon M. Miller, Richard Mushotzky, W. N. Brandt,\n  Elias Kammoun, Abderahmen Zoghbi, Ehud Behar","authorsParsed":[["Bogensberger","David",""],["Miller","Jon M.",""],["Mushotzky","Richard",""],["Brandt","W. N.",""],["Kammoun","Elias",""],["Zoghbi","Abderahmen",""],["Behar","Ehud",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 08:02:25 GMT"}],"updateDate":"2024-08-27","timestamp":1724659345000,"abstract":"  The structure of the jet in Cen A is likely better revealed in X-rays than in\nthe radio band, which is usually used to investigate jet proper motions. In\nthis paper, we analyze Chandra ACIS observations of Cen A from 2000 to 2022 and\ndevelop an algorithm for systematically fitting the proper motions of its X-ray\njet knots. Most of the knots had an apparent proper motion below the detection\nlimit. However, one knot at a transverse distance of $520~\\mathrm{pc}$ had an\napparent superluminal proper motion of $2.7\\pm0.4~\\mathrm{c}$. This constrains\nthe inclination of the jet to be $i<41\\pm6^{\\circ}$, and the velocity of this\nknot to be $\\beta>0.94\\pm0.02$. This agrees well with the inclination measured\nin the inner jet by the EHT, but contradicts previous estimates based on jet\nand counterjet brightness. It also disagrees with the proper motion of the\ncorresponding radio knot, of $0.8\\pm0.1~\\mathrm{c}$, which further indicates\nthat the X-ray and radio bands trace distinct structures in the jet. There are\nfour prominent X-ray jet knots closer to the nucleus, but only one of these is\ninconsistent with being stationary. A few jet knots also have a significant\nproper motion component in the non-radial direction. This component is\ntypically larger closer to the center of the jet. We also detect brightness and\nmorphology variations at a transverse distance of $100~\\mathrm{pc}$ from the\nnucleus.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}