{"id":"2408.11761","title":"D-RMGPT: Robot-assisted collaborative tasks driven by large multimodal\n  models","authors":"M. Forlini, M. Babcinschi, G. Palmieri, P. Neto","authorsParsed":[["Forlini","M.",""],["Babcinschi","M.",""],["Palmieri","G.",""],["Neto","P.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 16:34:21 GMT"}],"updateDate":"2024-08-22","timestamp":1724258061000,"abstract":"  Collaborative robots are increasingly popular for assisting humans at work\nand daily tasks. However, designing and setting up interfaces for human-robot\ncollaboration is challenging, requiring the integration of multiple components,\nfrom perception and robot task control to the hardware itself. Frequently, this\nleads to highly customized solutions that rely on large amounts of costly\ntraining data, diverging from the ideal of flexible and general interfaces that\nempower robots to perceive and adapt to unstructured environments where they\ncan naturally collaborate with humans. To overcome these challenges, this paper\npresents the Detection-Robot Management GPT (D-RMGPT), a robot-assisted\nassembly planner based on Large Multimodal Models (LMM). This system can assist\ninexperienced operators in assembly tasks without requiring any markers or\nprevious training. D-RMGPT is composed of DetGPT-V and R-ManGPT. DetGPT-V,\nbased on GPT-4V(vision), perceives the surrounding environment through one-shot\nanalysis of prompted images of the current assembly stage and the list of\ncomponents to be assembled. It identifies which components have already been\nassembled by analysing their features and assembly requirements. R-ManGPT,\nbased on GPT-4, plans the next component to be assembled and generates the\nrobot's discrete actions to deliver it to the human co-worker. Experimental\ntests on assembling a toy aircraft demonstrated that D-RMGPT is flexible and\nintuitive to use, achieving an assembly success rate of 83% while reducing the\nassembly time for inexperienced operators by 33% compared to the manual\nprocess. http://robotics-and-ai.github.io/LMMmodels/\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}