{"id":"2408.02132","title":"Investigating the hyperparameter space of deep neural network models for\n  reaction coordinate optimization: Application to alanine dipeptide in water","authors":"Kyohei Kawashima, Takumi Sato, Kei-ichi Okazaki, Kang Kim, Nobuyuki\n  Matubayasi, Toshifumi Mori","authorsParsed":[["Kawashima","Kyohei",""],["Sato","Takumi",""],["Okazaki","Kei-ichi",""],["Kim","Kang",""],["Matubayasi","Nobuyuki",""],["Mori","Toshifumi",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 20:03:49 GMT"}],"updateDate":"2024-08-06","timestamp":1722801829000,"abstract":"  Identifying reaction coordinates (RCs) from many collective variable\ncandidates have been of great challenge in understanding reaction mechanisms in\ncomplex systems. Machine learning approaches, especially the deep neural\nnetwork (DNN), have become a powerful tool and are actively applied. On the\nother hand, selecting the hyperparameters that define the DNN model structure\nremains to be a nontrivial and tedious task. Here we develop the hyperparameter\ntuning approach to determine the parameters in an automatic fashion from the\ntrajectory data. The DNN models are constructed to obtain a RC from many\ncollective variables that can adequately describe the changes of the committor\nfrom the reactant to product. The approach is applied to study the\nisomerization of alanine dipeptide in vacuum and in water. We find that\nmultiple DNN models with similar accuracy can be obtained, indicating that\nhyperparameter space is multimodal. Nevertheless, despite the differences in\nthe DNN model structure, the key features extracted using the explainable AI\n(XAI) tools show that all RC share the same character. In particular, the\nreaction in vacuum is characterized by the dihedral angles $\\phi$ and $\\theta$.\nThe reaction in water also involves these dihedral angles as key features, and\nin addition, the electrostatic potential from the solvent to the hydrogen\n(H${}_{18}$) plays a role at about the transition state. The current study thus\nshows that, in contrast to the diversity in the DNN models, suitably optimized\nDNN models share the same features and share the common mechanism for the\nreaction of interest.\n","subjects":["Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}