{"id":"2408.05567","title":"Diffusion Model-based Contrastive Learning for Human Activity\n  Recognition","authors":"Chunjing Xiao, Yanhui Han, Wei Yang, Yane Hou, Fangzhan Shi, Kevin\n  Chetty","authorsParsed":[["Xiao","Chunjing",""],["Han","Yanhui",""],["Yang","Wei",""],["Hou","Yane",""],["Shi","Fangzhan",""],["Chetty","Kevin",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 14:25:38 GMT"}],"updateDate":"2024-08-13","timestamp":1723299938000,"abstract":"  WiFi Channel State Information (CSI)-based activity recognition has sparked\nnumerous studies due to its widespread availability and privacy protection.\nHowever, when applied in practical applications, general CSI-based recognition\nmodels may face challenges related to the limited generalization capability,\nsince individuals with different behavior habits will cause various\nfluctuations in CSI data and it is difficult to gather enough training data to\ncover all kinds of motion habits. To tackle this problem, we design a diffusion\nmodel-based Contrastive Learning framework for human Activity Recognition\n(CLAR) using WiFi CSI. On the basis of the contrastive learning framework, we\nprimarily introduce two components for CLAR to enhance CSI-based activity\nrecognition. To generate diverse augmented data and complement limited training\ndata, we propose a diffusion model-based time series-specific augmentation\nmodel. In contrast to typical diffusion models that directly apply conditions\nto the generative process, potentially resulting in distorted CSI data, our\ntailored model dissects these condition into the high-frequency and\nlow-frequency components, and then applies these conditions to the generative\nprocess with varying weights. This can alleviate data distortion and yield\nhigh-quality augmented data. To efficiently capture the difference of the\nsample importance, we present an adaptive weight algorithm. Different from\ntypical contrastive learning methods which equally consider all the training\nsamples, this algorithm adaptively adjusts the weights of positive sample pairs\nfor learning better data representations. The experiments suggest that CLAR\nachieves significant gains compared to state-of-the-art methods.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}