{"id":"2408.02691","title":"Symmetric Graph Contrastive Learning against Noisy Views for\n  Recommendation","authors":"Chu Zhao, Enneng Yang, Yuliang Liang, Jianzhe Zhao, Guibing Guo, and\n  Xingwei Wang","authorsParsed":[["Zhao","Chu",""],["Yang","Enneng",""],["Liang","Yuliang",""],["Zhao","Jianzhe",""],["Guo","Guibing",""],["Wang","Xingwei",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 06:58:07 GMT"}],"updateDate":"2024-08-07","timestamp":1722668287000,"abstract":"  Graph Contrastive Learning (GCL) leverages data augmentation techniques to\nproduce contrasting views, enhancing the accuracy of recommendation systems\nthrough learning the consistency between contrastive views. However, existing\naugmentation methods, such as directly perturbing interaction graph (e.g.,\nnode/edge dropout), may interfere with the original connections and generate\npoor contrasting views, resulting in sub-optimal performance. In this paper, we\ndefine the views that share only a small amount of information with the\noriginal graph due to poor data augmentation as noisy views (i.e., the last 20%\nof the views with a cosine similarity value less than 0.1 to the original\nview). We demonstrate through detailed experiments that noisy views will\nsignificantly degrade recommendation performance. Further, we propose a\nmodel-agnostic Symmetric Graph Contrastive Learning (SGCL) method with\ntheoretical guarantees to address this issue. Specifically, we introduce\nsymmetry theory into graph contrastive learning, based on which we propose a\nsymmetric form and contrast loss resistant to noisy interference. We provide\ntheoretical proof that our proposed SGCL method has a high tolerance to noisy\nviews. Further demonstration is given by conducting extensive experiments on\nthree real-world datasets. The experimental results demonstrate that our\napproach substantially increases recommendation accuracy, with relative\nimprovements reaching as high as 12.25% over nine other competing models. These\nresults highlight the efficacy of our method.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bPBiHLIUz7L8wZQ690sl4xGjBXxyfXI8aCsN3rFCZYQ","pdfSize":"2022246"}
