{"id":"2408.15646","title":"{\\mu}gat: Improving Single-Page Document Parsing by Providing Multi-Page\n  Context","authors":"Fabio Quattrini, Carmine Zaccagnino, Silvia Cascianelli, Laura Righi,\n  Rita Cucchiara","authorsParsed":[["Quattrini","Fabio",""],["Zaccagnino","Carmine",""],["Cascianelli","Silvia",""],["Righi","Laura",""],["Cucchiara","Rita",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 09:01:18 GMT"}],"updateDate":"2024-08-29","timestamp":1724835678000,"abstract":"  Regesta are catalogs of summaries of other documents and, in some cases, are\nthe only source of information about the content of such full-length documents.\nFor this reason, they are of great interest to scholars in many social and\nhumanities fields. In this work, we focus on Regesta Pontificum Romanum, a\nlarge collection of papal registers. Regesta are visually rich documents, where\nthe layout is as important as the text content to convey the contained\ninformation through the structure, and are inherently multi-page documents.\nAmong Digital Humanities techniques that can help scholars efficiently exploit\nregesta and other documental sources in the form of scanned documents, Document\nParsing has emerged as a task to process document images and convert them into\nmachine-readable structured representations, usually markup language. However,\ncurrent models focus on scientific and business documents, and most of them\nconsider only single-paged documents. To overcome this limitation, in this\nwork, we propose {\\mu}gat, an extension of the recently proposed Document\nparsing Nougat architecture, which can handle elements spanning over the single\npage limits. Specifically, we adapt Nougat to process a larger, multi-page\ncontext, consisting of the previous and the following page, while parsing the\ncurrent page. Experimental results, both qualitative and quantitative,\ndemonstrate the effectiveness of our proposed approach also in the case of the\nchallenging Regesta Pontificum Romanorum.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Digital Libraries"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"eBcQVjhYTlLVFue2h6dTD_AY0-xLQ95o7JK8yYzSHos","pdfSize":"21954740"}
