{"id":"2408.17057","title":"LAR-IQA: A Lightweight, Accurate, and Robust No-Reference Image Quality\n  Assessment Model","authors":"Nasim Jamshidi Avanaki, Abhijay Ghildyal, Nabajeet Barman and Saman\n  Zadtootaghaj","authorsParsed":[["Avanaki","Nasim Jamshidi",""],["Ghildyal","Abhijay",""],["Barman","Nabajeet",""],["Zadtootaghaj","Saman",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 07:32:19 GMT"},{"version":"v2","created":"Fri, 6 Sep 2024 17:15:49 GMT"}],"updateDate":"2024-09-09","timestamp":1725003139000,"abstract":"  Recent advancements in the field of No-Reference Image Quality Assessment\n(NR-IQA) using deep learning techniques demonstrate high performance across\nmultiple open-source datasets. However, such models are typically very large\nand complex making them not so suitable for real-world deployment, especially\non resource- and battery-constrained mobile devices. To address this\nlimitation, we propose a compact, lightweight NR-IQA model that achieves\nstate-of-the-art (SOTA) performance on ECCV AIM UHD-IQA challenge validation\nand test datasets while being also nearly 5.7 times faster than the fastest\nSOTA model. Our model features a dual-branch architecture, with each branch\nseparately trained on synthetically and authentically distorted images which\nenhances the model's generalizability across different distortion types. To\nimprove robustness under diverse real-world visual conditions, we additionally\nincorporate multiple color spaces during the training process. We also\ndemonstrate the higher accuracy of recently proposed Kolmogorov-Arnold Networks\n(KANs) for final quality regression as compared to the conventional Multi-Layer\nPerceptrons (MLPs). Our evaluation considering various open-source datasets\nhighlights the practical, high-accuracy, and robust performance of our proposed\nlightweight model. Code: https://github.com/nasimjamshidi/LAR-IQA.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"okBjnd4buPyCk61SaqLFgO94yN8-gxKUcGDDVEWam-0","pdfSize":"3482299"}
