{"id":"2408.07308","title":"Interlayer excitons in double-layer transition metal dichalcogenides\n  quantum dots","authors":"Xiang Liu, Zheng Tao, Wenchen Luo, and Tapash Chakraborty","authorsParsed":[["Liu","Xiang",""],["Tao","Zheng",""],["Luo","Wenchen",""],["Chakraborty","Tapash",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 06:00:51 GMT"}],"updateDate":"2024-08-15","timestamp":1723615251000,"abstract":"  Various properties of interlayer excitons in double-layer transition metal\ndichalcogenides quantum dots are analyzed using a low-energy effective\nHamiltonian with Coulomb interaction. We solve the single-particle Hamiltonian\nwith and without a magnetic field analytically, then present the electron-hole\npairing features of interlayer exciton by employing the exact diagonalization\ntechnique, where the electron and hole are located in two layers respectively.\nIn a magnetic field, the Landau level gap, as well as the electron-hole\nseparation of an exciton varies non-monotonously as the interlayer distance\nincreases, attributed to the pseudospin-orbit coupling which also leads to the\nemergence of topological non-trivial pseudospin textures in the exciton states.\nWe examine the influence of different materials in quantum dots stacking on the\nexciton states, comparing their impact to variations in layer distances and\nquantum dot sizes. We further explore two interacting interlayer excitons\nnumerically. The binding energy is significantly enhanced by the exchange\ninteraction when the two electrons have different spins. The optical absorption\nspectra from the ground state to low-lying excited states reveal distinct\nbehaviors for different interlayer excitons, which can be utilized to\ndistinguish the spin of electrons in excitons. Our results highlight the\npotential for controlling interlayer excitons and applications of optical\ndevices in a magnetic field and tunable layer distance.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}