{"id":"2408.06543","title":"HDRGS: High Dynamic Range Gaussian Splatting","authors":"Jiahao Wu, Lu Xiao, Chao Wang, Rui Peng, Kaiqiang Xiong, Ronggang Wang","authorsParsed":[["Wu","Jiahao",""],["Xiao","Lu",""],["Wang","Chao",""],["Peng","Rui",""],["Xiong","Kaiqiang",""],["Wang","Ronggang",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 00:32:36 GMT"}],"updateDate":"2024-08-14","timestamp":1723509156000,"abstract":"  Recent years have witnessed substantial advancements in the field of 3D\nreconstruction from 2D images, particularly following the introduction of the\nneural radiance field (NeRF) technique. However, reconstructing a 3D high\ndynamic range (HDR) radiance field, which aligns more closely with real-world\nconditions, from 2D multi-exposure low dynamic range (LDR) images continues to\npose significant challenges. Approaches to this issue fall into two categories:\ngrid-based and implicit-based. Implicit methods, using multi-layer perceptrons\n(MLP), face inefficiencies, limited solvability, and overfitting risks.\nConversely, grid-based methods require significant memory and struggle with\nimage quality and long training times. In this paper, we introduce Gaussian\nSplatting-a recent, high-quality, real-time 3D reconstruction technique-into\nthis domain. We further develop the High Dynamic Range Gaussian Splatting\n(HDR-GS) method, designed to address the aforementioned challenges. This method\nenhances color dimensionality by including luminance and uses an asymmetric\ngrid for tone-mapping, swiftly and precisely converting pixel irradiance to\ncolor. Our approach improves HDR scene recovery accuracy and integrates a novel\ncoarse-to-fine strategy to speed up model convergence, enhancing robustness\nagainst sparse viewpoints and exposure extremes, and preventing local optima.\nExtensive testing confirms that our method surpasses current state-of-the-art\ntechniques in both synthetic and real-world scenarios. Code will be released at\n\\url{https://github.com/WuJH2001/HDRGS}\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}