{"id":"2408.12155","title":"F\\'eeton dark matter above the $e^-e^+$ threshold","authors":"Tatsuya Hayashi, Shigeki Matsumoto, Yuki Watanabe, Tsutomu T. Yanagida","authorsParsed":[["Hayashi","Tatsuya",""],["Matsumoto","Shigeki",""],["Watanabe","Yuki",""],["Yanagida","Tsutomu T.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 06:45:27 GMT"}],"updateDate":"2024-08-23","timestamp":1724309127000,"abstract":"  The new gauge boson introduced in the minimal extension of the standard model\n(SM) by gauging the U(1)$_{\\rm B-L}$ symmetry plays the role of dark matter\nwhen the U(1)$_{\\rm B-L}$ gauge coupling is highly suppressed. This dark\nmatter, named the F\\'eeton dark matter is known to be efficiently created in\nthe early universe by inflationary fluctuations with minimal gravity coupling,\nhence the framework, the gauged U(1)$_{\\rm B-L}$ extended SM + inflation,\nsolves the four major problems of the SM; neutrino masses/mixings, dark matter,\nbaryon asymmetry of the universe, and the initial condition of the universe\n(inflation). We comprehensively study the phenomenology of the dark matter when\nit is heavier than the $e^- e^+$ threshold, namely twice the electron mass,\nconsidering the threshold effect on the dark matter decay into $e^- e^+$. The\nviable parameter region is found only in the threshold region, while the\nbranching fraction of the decay into $e^- e^+$ (i.e., the $e^- e^+$ signal)\nnever vanishes even at the threshold due to the effect. As a result, the pure\nU(1)$_{\\rm B-L}$ extension without the kinetic mixing between the U(1)$_{\\rm\nB-L}$ and hyper-charge gauge bosons have already been excluded by the present\nobservation of the 511\\,keV photon from the galactic center. So, the F\\'eeton\ndark matter requires a non-zero kinetic mixing to be a viable dark matter\ncandidate and will be efficiently explored by future MeV-gamma ray telescopes\nthanks to the non-vanishing decay process into $e^- e^+$.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}