{"id":"2408.17206","title":"Modelling Growth, Remodelling and Damage of a Thick-walled\n  Fibre-reinforced Artery with Active Response: Application to Cerebral\n  Vasospasm and Treatment","authors":"Giulia Pederzani, Andrii Grytsan, Alfons G. Hoekstra, Anne M.\n  Robertson, Paul N. Watton","authorsParsed":[["Pederzani","Giulia",""],["Grytsan","Andrii",""],["Hoekstra","Alfons G.",""],["Robertson","Anne M.",""],["Watton","Paul N.",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 11:14:36 GMT"}],"updateDate":"2024-09-02","timestamp":1725016476000,"abstract":"  Cerebral vasospasm, a prolonged constriction of cerebral arteries, is the\nfirst cause of morbidity and mortality for patients who survive hospitalisation\nafter aneurysmal subarachnoid haemorrhage. The recent finding that\nstent-retrievers can successfully treat the disease has challenged the\nviewpoint that damage to the extracellular matrix is necessary. We apply a 3D\nfinite element rate-based constrained mixture model (rb-CMM) to simulate\nvasospasm, remodelling and treatment with stents. The artery is modelled as a\nthick-walled fibre-reinforced constrained mixture subject to physiological\npressure and axial stretch. The model accounts for distributions of collagen\nfibre homeostatic stretches, VSMC active response, remodelling and damage.\nAfter simulating vasospasm and subsequent remodelling of the artery to a new\nhomeostatic state, we simulate treatment with commonly available\nstent-retrievers. We perform a parameter study to examine how arterial diameter\nand thickness affect the success of stent treatment. The model predictions on\nthe pressure required to mechanically resolve the constriction are consistent\nwith stent-retrievers. In agreement with clinical observations, our model\npredicts that stent-retrievers tend to be effective in arteries of up to 3mm\ndiameter, but fail in larger ones. Variations in arterial wall thickness\nsignificantly affect stent pressure requirements. We have developed a novel\nrb-CMM that accounts for VSMC active response, remodelling and damage.\nConsistently with clinical observations, simulations predict that\nstent-retrievers can mechanically resolve vasospasm. Moreover, accounting for a\npatient's arterial properties is important for predicting likelihood of stent\nsuccess. This in silico tool has the potential to support clinical\ndecision-making and guide the development and evaluation of dedicated stents\nfor personalised treatment of vasospasm.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"i-zl0eiBh48pF-jdrxGRPy3pp5YSFoZR1JJJvvqd7rU","pdfSize":"2399283"}
