{"id":"2408.06956","title":"PayOff: A Regulated Central Bank Digital Currency with Private Offline\n  Payments","authors":"Carolin Beer, Sheila Zingg, Kari Kostiainen, Karl W\\\"ust, Vedran\n  Capkun, Srdjan Capkun","authorsParsed":[["Beer","Carolin",""],["Zingg","Sheila",""],["Kostiainen","Kari",""],["Wüst","Karl",""],["Capkun","Vedran",""],["Capkun","Srdjan",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 15:15:06 GMT"}],"updateDate":"2024-08-14","timestamp":1723562106000,"abstract":"  The European Central Bank is preparing for the potential issuance of a\ncentral bank digital currency (CBDC), called the digital euro. A recent\nregulatory proposal by the European Commission defines several requirements for\nthe digital euro, such as support for both online and offline payments. Offline\npayments are expected to enable cash-like privacy, local payment settlement,\nand the enforcement of holding limits. While other central banks have expressed\nsimilar desired functionality, achieving such offline payments poses a novel\ntechnical challenge. We observe that none of the existing research solutions,\nincluding offline E-cash schemes, are fully compliant. Proposed solutions based\non secure elements offer no guarantees in case of compromise and can therefore\nlead to significant payment fraud.\n  The main contribution of this paper is PayOff, a novel CBDC design motivated\nby the digital euro regulation, which focuses on offline payments. We analyze\nthe security implications of local payment settlement and identify new security\nobjectives. PayOff protects user privacy, supports complex regulations such as\nholding limits, and implements safeguards to increase robustness against secure\nelement failure. Our analysis shows that PayOff provides strong privacy and\nidentifies residual leakages that may arise in real-world deployments. Our\nevaluation shows that offline payments can be fast and that the central bank\ncan handle high payment loads with moderate computing resources. However, the\nmain limitation of PayOff is that offline payment messages and storage\nrequirements grow in the number of payments that the sender makes or receives\nwithout going online in between.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CjBP8AKN3Hg8zrIfDukw98Byq12J0smYrR_51JqhtQk","pdfSize":"1253755"}
