{"id":"2408.06501","title":"Radiative corrections relating leptoquark-fermion couplings probed at\n  low and high energy","authors":"Innes Bigaran, Rodolfo Capdevilla, Ulrich Nierste","authorsParsed":[["Bigaran","Innes",""],["Capdevilla","Rodolfo",""],["Nierste","Ulrich",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 21:28:06 GMT"}],"updateDate":"2024-08-14","timestamp":1723498086000,"abstract":"  Scalar leptoquarks (LQ) with masses between 2 TeV and 50 TeV are prime\ncandidates to explain deviations between measurements and Standard-Model\npredictions in decay observables of $b$-flavored hadrons (``flavor\nanomalies''). Explanations of low-energy data often involve order-one\nLQ-quark-lepton Yukawa couplings, especially when collider bounds enforce a\nlarge LQ mass. This calls for the calculation of radiative corrections\ninvolving these couplings. Studying such corrections to LQ-mediated $b\\to c\\tau\n\\nu$ and $b\\to s\\ell^+\\ell^-$ amplitudes, we find that they can be absorbed\ninto finite renormalizations of the LQ Yukawa couplings. If one wants to use\nYukawa couplings extracted from low-energy data for the prediction of on-shell\nLQ decay rates, one must convert the low-energy couplings to their high-energy\ncounterparts, which subsume the corrections to the on-shell LQ-quark-lepton\nvertex. We present compact formulae for these correction factors and find that\nin scenarios with $S_1$, $R_2$, or $S_3$ LQ the high-energy coupling is always\nsmaller than the low-energy one, which weakens the impact of collider data on\nthe determination of the allowed parameter spaces. For the $R_2$ scenario\naddressing $b\\to c\\tau \\nu$, in which one of the two involved Yukawa coupling\nmust be significantly larger than 1, we find this coupling reduced by 15\\% at\nhigh energy. If both $S_1$ and $R_2$ are present, the high-energy coupling can\nalso be larger and the size of the correction is unbounded, because tree\ncontribution and vertex corrections involve different couplings. We further\npresent the conversion formula to the $\\overline{\\rm MS}$ scheme for the Yukawa\ncouplings of the $S_3$ scenario.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4USN3ulDWy05HneyQ2tXhI868FcuYG026EdC_wEwJWw","pdfSize":"789342"}
