{"id":"2408.00226","title":"Shadow of a Renormalization Group Improved Rotating Black Hole","authors":"Luis A. S\\'anchez","authorsParsed":[["Sánchez","Luis A.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 01:44:10 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 03:41:19 GMT"},{"version":"v3","created":"Mon, 5 Aug 2024 14:42:46 GMT"},{"version":"v4","created":"Sat, 10 Aug 2024 05:15:51 GMT"}],"updateDate":"2024-08-13","timestamp":1722476650000,"abstract":"  We present a study on quantum gravity effects on the shadow of a rotating\nblack hole (BH) obtained in the setting of the asymptotically safe gravity. The\nrotating metric, which results from a static regular one recently presented in\nthe literature, is generated by using the generalized Newman-Janis algorithm.\nThe novelty of the static regular metric lies in the fact that it is the\noutcome of an effective Lagrangian which describes dust whose spherically\nsymmetric collapse is non-singular as a consequence of the antiscreening\ncharacter of gravity at small distances. The effective Lagrangian includes a\nmultiplicative coupling, denoted as chi, with the Lagrangian of the collapsing\nfluid. The resulting exterior metric for large radii depends on a free\nparameter xi which captures the quantum gravity effects. The form of the\ncoupling chi and its connection with the quantum parameter xi are determined by\nthe running of the Newton coupling G(k) along a renormalization group\ntrajectory that stops at the ultraviolet non-gaussian fixed point of the\nasymptotic safety theory for quantum gravity. Varying both the spin parameter\na/M and the quantum parameter xi, we explore the quantum gravity effects on\nseveral astronomical observables used to describe the morphology of the shadow\ncast by rotating BHs. In order to obtain constraints on the parameter xi, we\nconfront our results with the recent Event Horizon Telescope (EHT) observations\nof the shadows of the supermassive BHs M87 and Sgr A. We find that the ranges\nof variation of all the studied shadow observables fall entirely within the\nranges determined by the EHT collaboration. We then conclude that the current\nastronomical data do not rule out the renormalization group improved rotating\nBH.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}