{"id":"2408.09665","title":"SG-GS: Photo-realistic Animatable Human Avatars with Semantically-Guided\n  Gaussian Splatting","authors":"Haoyu Zhao, Chen Yang, Hao Wang, Xingyue Zhao, Wei Shen","authorsParsed":[["Zhao","Haoyu",""],["Yang","Chen",""],["Wang","Hao",""],["Zhao","Xingyue",""],["Shen","Wei",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 02:58:20 GMT"}],"updateDate":"2024-08-20","timestamp":1724036300000,"abstract":"  Reconstructing photo-realistic animatable human avatars from monocular videos\nremains challenging in computer vision and graphics. Recently, methods using 3D\nGaussians to represent the human body have emerged, offering faster\noptimization and real-time rendering. However, due to ignoring the crucial role\nof human body semantic information which represents the intrinsic structure and\nconnections within the human body, they fail to achieve fine-detail\nreconstruction of dynamic human avatars. To address this issue, we propose\nSG-GS, which uses semantics-embedded 3D Gaussians, skeleton-driven rigid\ndeformation, and non-rigid cloth dynamics deformation to create photo-realistic\nanimatable human avatars from monocular videos. We then design a Semantic\nHuman-Body Annotator (SHA) which utilizes SMPL's semantic prior for efficient\nbody part semantic labeling. The generated labels are used to guide the\noptimization of Gaussian semantic attributes. To address the limited receptive\nfield of point-level MLPs for local features, we also propose a 3D network that\nintegrates geometric and semantic associations for human avatar deformation. We\nfurther implement three key strategies to enhance the semantic accuracy of 3D\nGaussians and rendering quality: semantic projection with 2D regularization,\nsemantic-guided density regularization and semantic-aware regularization with\nneighborhood consistency. Extensive experiments demonstrate that SG-GS achieves\nstate-of-the-art geometry and appearance reconstruction performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}