{"id":"2408.05669","title":"StealthDiffusion: Towards Evading Diffusion Forensic Detection through\n  Diffusion Model","authors":"Ziyin Zhou, Ke Sun, Zhongxi Chen, Huafeng Kuang, Xiaoshuai Sun,\n  Rongrong Ji","authorsParsed":[["Zhou","Ziyin",""],["Sun","Ke",""],["Chen","Zhongxi",""],["Kuang","Huafeng",""],["Sun","Xiaoshuai",""],["Ji","Rongrong",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 01:22:29 GMT"}],"updateDate":"2024-08-13","timestamp":1723339349000,"abstract":"  The rapid progress in generative models has given rise to the critical task\nof AI-Generated Content Stealth (AIGC-S), which aims to create AI-generated\nimages that can evade both forensic detectors and human inspection. This task\nis crucial for understanding the vulnerabilities of existing detection methods\nand developing more robust techniques. However, current adversarial attacks\noften introduce visible noise, have poor transferability, and fail to address\nspectral differences between AI-generated and genuine images. To address this,\nwe propose StealthDiffusion, a framework based on stable diffusion that\nmodifies AI-generated images into high-quality, imperceptible adversarial\nexamples capable of evading state-of-the-art forensic detectors.\nStealthDiffusion comprises two main components: Latent Adversarial\nOptimization, which generates adversarial perturbations in the latent space of\nstable diffusion, and Control-VAE, a module that reduces spectral differences\nbetween the generated adversarial images and genuine images without affecting\nthe original diffusion model's generation process. Extensive experiments show\nthat StealthDiffusion is effective in both white-box and black-box settings,\ntransforming AI-generated images into high-quality adversarial forgeries with\nfrequency spectra similar to genuine images. These forgeries are classified as\ngenuine by advanced forensic classifiers and are difficult for humans to\ndistinguish.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}