{"id":"2408.07172","title":"UHECR Clustering: Lightest Nuclei from Local Sheet Galaxies","authors":"Daniele Fargion, Pier Giorgio De Sanctis Lucentini, Maxim Yu. Khlopov","authorsParsed":[["Fargion","Daniele",""],["Lucentini","Pier Giorgio De Sanctis",""],["Khlopov","Maxim Yu.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 19:30:24 GMT"}],"updateDate":"2024-08-15","timestamp":1723577424000,"abstract":"  The ultra-high-energy cosmic ray (UHECR) puzzle is reviewed under the hints\nof a few basic results: clustering, anisotropy, asymmetry, bending, and\ncomposition changes with energies. We show how the lightest UHECR nuclei from\nthe nearest AGN or Star-Burst sources, located inside a few Mpc Local Sheets,\nmay explain, at best, the observed clustering of Hot Spots at tens EeV energy.\nAmong the possible local extragalactic candidate sources, we derived the main\ncontribution of very few galactic sources. These are located in the Local Sheet\nplane within a distance of a few Mpc, ejecting UHECR at a few tens of EeV\nenergy. UHECR also shine at lower energies of several EeV, partially feeding\nthe Auger dipole by LMC and possibly a few nearer galactic sources. For the\nvery recent highest energy UHECR event, if a nucleon, it may be explained by a\nmodel based on the scattering of UHE ZeV neutrinos on low-mass relic neutrinos.\nSuch scatterings are capable of correlating, via Z boson resonance, the most\ndistant cosmic sources above the GZK bound with such an enigmatic UHECR event.\nOtherwise, these extreme events, if made by the heaviest composition, could\noriginate from the largest bending trajectory of heaviest nuclei or from nearby\nsources, even galactic ones. In summary, the present lightest to heavy nuclei\nmodel UHECR from the Local Sheet could successfully correlate UHECR clustering\nwith the nearest galaxies and AGN. Heavy UHECR may shine by being widely\ndeflected from the Local Sheet or from past galactic, GRB, or SGR explosive\nejection.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IzMr6uTfJKGHnNux2A_V03nxcafZqasH9ALcR6GhIhU","pdfSize":"11700049"}
