{"id":"2408.12061","title":"Spin-Orbit Coupling for Optical Vortex Generation in van der Waals\n  Materials","authors":"Jaegang Jo, Sujeong Byun, Munseong Bae, Jianwei Wang, Haejun Chung and\n  Sejeong Kim","authorsParsed":[["Jo","Jaegang",""],["Byun","Sujeong",""],["Bae","Munseong",""],["Wang","Jianwei",""],["Chung","Haejun",""],["Kim","Sejeong",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 01:45:53 GMT"}],"updateDate":"2024-08-23","timestamp":1724291153000,"abstract":"  An optical vortex beam has attracted significant attention across diverse\napplications, including optical manipulation, phase-contrast microscopy,\noptical communication, and quantum photonics. To utilize vortex generators for\nintegrated photonics, researchers have developed ultra-compact vortex\ngenerators using fork gratings, metasurfaces, and integrated microcombs.\nHowever, those devices depend on costly, time-consuming nanofabrication and are\nconstrained by the low signal-to-noise ratio due to the fabrication error. As\nan alternative maneuver, spin-orbit coupling has emerged as a method to obtain\nthe vortex beam by converting spin angular momentum (SAM) without\nnanostructures. Here, we demonstrate the creation of an optical vortex beam\nusing van der Waals (vdW) materials. The significantly high birefringence of\nvdW materials allows generations of optical vortex beams with high efficiency\nin a sub-wavelength thickness. In this work, we utilize an 8-um-thick hexagonal\nboron nitride (hBN) crystal for the creation of optical vortices carrying\ntopological charges of +2 and -2. We also present the generation of an optical\nvortex beam in a 320-nm-thick MoS2 crystal with a conversion efficiency of\n0.09. This study paves the way for fabrication-less and ultra-compact optical\nvortex generators, which can be applied for integrated photonics and\nlarge-scale vortex generator arrays.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}