{"id":"2408.13807","title":"DIES: Parallel dust radiative transfer program with the immediate\n  re-emission method","authors":"Mika Juvela","authorsParsed":[["Juvela","Mika",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 11:00:19 GMT"}],"updateDate":"2024-08-27","timestamp":1724583619000,"abstract":"  Radiative transfer (RT) modelling is a necessary tool in the interpretation\nof observations of the thermal emission of interstellar dust. It is also often\npart of multi-physics modelling. In this context, the efficiency of radiative\ntransfer calculations is important, even for one-dimensional models. We\ninvestigate the use of the so-called immediate re-emission (IRE) method for\nfast calculation of one-dimensional spherical cloud models. We wish to\ndetermine whether weighting methods similar to those used in traditional Monte\nCarlo simulations can speed up the estimation of dust temperature. We present\nthe program DIES, a parallel implementation of the IRE method, which makes it\npossible to do the calculations also on graphics processing units (GPUs). We\ntested the program with externally and internally heated cloud models, and\nexamined the potential improvements from the use of different weighted sampling\nschemes. The execution times of the program compare favourably with previous\nprograms, especially when run on GPUs. On the other hand, weighting schemes\nproduce only limited improvements. In the case of an internal radiation source,\nthe basic IRE method samples the re-emission well, while traditional Monte\nCarlo requires the use of spatial importance sampling. Some noise reduction\ncould be achieved for externally heated models by weighting the initial photon\ndirections. Only in optically very thin models does weighting - such as the\nproposed method of forced first interaction - result in noise reduction by a\nfactor of several. The IRE method performs well for both internally and\nexternally heated models, typically without the need for any additional\nweighting schemes. With run times of the order of one second for our test\nmodels, the DIES program is suitable even for larger parameter studies.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}