{"id":"2408.09136","title":"Highly Sensitive and Compact Quad-Band Ambient RF Energy Harvester","authors":"Rasool Keshavarz, and Negin Shariati","authorsParsed":[["Keshavarz","Rasool",""],["Shariati","Negin",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 08:23:53 GMT"}],"updateDate":"2024-08-20","timestamp":1723883033000,"abstract":"  A highly efficient and compact quad band energy harvester (QBEH) circuit\nbased on the extended composite right and left handed transmission lines\n(ECRLHTLs) technique is presented.The design procedure based on ECRLHTLs at\nfour desired frequency bands is introduced to realize a quad band matching\nnetwork (QBMN).The proposed QBEH operates at four frequency bands f1=0.75\nGHz,f2=1.8 GHz,f3=2.4 GHz and f4=5.8 GHz. The simulations and experimental\nresults of the proposed QBEH exhibit overall (end to end) efficiency of\n55percent and 70percent while excited at four frequency bands simultaneously\nwith negative 20dBm (10 microWatt) and negative 10dBm (100 microWatt) input\npower, respectively.Due to applying multi band excitation technique and radio\nfrequency (RF) combining method in the QBEH circuit, the sensitivity is\nimproved, and sufficient power is generated to realize a self sustainable\nsensor (S3) using ambient low level RF signals.A favorable impedance matching\nover a broad low input power range of negative 50 to negative 10 dBm (0.01 to\n100 microWatt) is achieved, enabling the proposed QBEH to harvest ambient RF\nenergy in urban environments. Moreover, an accurate theoretical analyses based\non the Volterra series and Laplace transformation are presented to maximize the\noutput DC current of the rectifier over a wide input power range.Theoretical,\nsimulation and measurement results are in excellent agreement, which validate\nthe design accuracy for the proposed quad band structure.The proposed new\nenergy harvesting technique has the potential to practically realize a green\nenergy harvesting solution to generate a viable energy source for low powered\nsensors and IoT devices, anytime, anywhere.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}