{"id":"2408.00248","title":"Joint Vehicle Connection and Beamforming Optimization in Digital Twin\n  Assisted Integrated Sensing and Communication Vehicular Networks","authors":"Weihang Ding, Zhaohui Yang, Mingzhe Chen, Yuchen Liu, and Mohammad\n  Shikh-Bahaei","authorsParsed":[["Ding","Weihang",""],["Yang","Zhaohui",""],["Chen","Mingzhe",""],["Liu","Yuchen",""],["Shikh-Bahaei","Mohammad",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 02:56:33 GMT"}],"updateDate":"2024-08-02","timestamp":1722480993000,"abstract":"  This paper introduces an approach to harness digital twin (DT) technology in\nthe realm of integrated sensing and communications (ISAC) in the\nsixth-generation (6G) Internet-of-everything (IoE) applications. We consider\nmoving targets in a vehicular network and use DT to track and predict the\nmotion of the vehicles. After predicting the location of the vehicle at the\nnext time slot, the DT designs the assignment and beamforming for each vehicle.\nThe real time sensing information is then utilized to update and refine the DT,\nenabling further processing and decision-making. This model incorporates a\ndynamic Kalman gain, which is updated at each time slot based on the received\necho signals. The state representation encompasses both vehicle motion\ninformation and the error matrix, with the posterior Cram\\'er-Rao bound (PCRB)\nemployed to assess sensing accuracy. We consider a network with two roadside\nunits (RSUs), and the vehicles need to be allocated to one of them. To optimize\nthe overall transmission rate while maintaining an acceptable sensing accuracy,\nan optimization problem is formulated. Since it is generally hard to solve the\noriginal problem, Lagrange multipliers and fractional programming are employed\nto simplify this optimization problem. To solve the simplified problem, this\npaper introduces both greedy and heuristic algorithms through optimizing both\nvehicle assignments and predictive beamforming. The optimized results are then\ntransferred back to the real space for ISAC applications. Recognizing the\ncomputational complexity of the greedy and heuristic algorithms, a\nbidirectional long short-term memory (LSTM)-based recurrent neural network\n(RNN) is proposed for efficient beamforming design within the DT. Simulation\nresults demonstrate the effectiveness of the DT-based ISAC network.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}