{"id":"2408.04948","title":"HybridRAG: Integrating Knowledge Graphs and Vector Retrieval Augmented\n  Generation for Efficient Information Extraction","authors":"Bhaskarjit Sarmah, Benika Hall, Rohan Rao, Sunil Patel, Stefano\n  Pasquali, Dhagash Mehta","authorsParsed":[["Sarmah","Bhaskarjit",""],["Hall","Benika",""],["Rao","Rohan",""],["Patel","Sunil",""],["Pasquali","Stefano",""],["Mehta","Dhagash",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 09:07:48 GMT"}],"updateDate":"2024-08-12","timestamp":1723194468000,"abstract":"  Extraction and interpretation of intricate information from unstructured text\ndata arising in financial applications, such as earnings call transcripts,\npresent substantial challenges to large language models (LLMs) even using the\ncurrent best practices to use Retrieval Augmented Generation (RAG) (referred to\nas VectorRAG techniques which utilize vector databases for information\nretrieval) due to challenges such as domain specific terminology and complex\nformats of the documents. We introduce a novel approach based on a combination,\ncalled HybridRAG, of the Knowledge Graphs (KGs) based RAG techniques (called\nGraphRAG) and VectorRAG techniques to enhance question-answer (Q&A) systems for\ninformation extraction from financial documents that is shown to be capable of\ngenerating accurate and contextually relevant answers. Using experiments on a\nset of financial earning call transcripts documents which come in the form of\nQ&A format, and hence provide a natural set of pairs of ground-truth Q&As, we\nshow that HybridRAG which retrieves context from both vector database and KG\noutperforms both traditional VectorRAG and GraphRAG individually when evaluated\nat both the retrieval and generation stages in terms of retrieval accuracy and\nanswer generation. The proposed technique has applications beyond the financial\ndomain\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning","Quantitative Finance/Statistical Finance","Statistics/Applications","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}