{"id":"2408.04768","title":"The 2023 Dengue Outbreak in Lombardy, Italy: A One-Health Perspective","authors":"Francesca Rovida, Marino Faccini, Carla Molina Gran\\'e, Irene\n  Cassaniti, Sabrina Senatore, Eva Rossetti, Giuditta Scardina, Manuela Piazza,\n  Giulia Campanini, Daniele Lilleri, Stefania Paolucci, Guglielmo Ferrari,\n  Antonio Piralla, Francesco Defilippo, Davide Lelli, Ana Moreno, Luigi\n  Vezzosi, Federica Attanasi, Soresini Marzia, Barozzi Manuela, Lorenzo\n  Cerutti, Stefano Paglia, Angelo Regazzetti, Maurilia Marcacci, Guido Di\n  Donato, Marco Farioli, Mattia Manica, Piero Poletti, Antonio Lavazza, Maira\n  Bonini, Stefano Merler, Fausto Baldanti, Danilo Cereda, Lombardy Dengue\n  network","authorsParsed":[["Rovida","Francesca",""],["Faccini","Marino",""],["Grané","Carla Molina",""],["Cassaniti","Irene",""],["Senatore","Sabrina",""],["Rossetti","Eva",""],["Scardina","Giuditta",""],["Piazza","Manuela",""],["Campanini","Giulia",""],["Lilleri","Daniele",""],["Paolucci","Stefania",""],["Ferrari","Guglielmo",""],["Piralla","Antonio",""],["Defilippo","Francesco",""],["Lelli","Davide",""],["Moreno","Ana",""],["Vezzosi","Luigi",""],["Attanasi","Federica",""],["Marzia","Soresini",""],["Manuela","Barozzi",""],["Cerutti","Lorenzo",""],["Paglia","Stefano",""],["Regazzetti","Angelo",""],["Marcacci","Maurilia",""],["Di Donato","Guido",""],["Farioli","Marco",""],["Manica","Mattia",""],["Poletti","Piero",""],["Lavazza","Antonio",""],["Bonini","Maira",""],["Merler","Stefano",""],["Baldanti","Fausto",""],["Cereda","Danilo",""],["network","Lombardy Dengue",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 21:49:39 GMT"}],"updateDate":"2024-08-12","timestamp":1723153779000,"abstract":"  Introduction. Here we reported the virological, entomological and\nepidemiological characteristics of the large autochthonous outbreak of dengue\n(DENV) occurred in a small village of the Lombardy region (Northern Italy)\nduring summer 2023.\n  Methods. After the diagnosis of the first autochthonous case on 18 August\n2023, public health measures, including epidemiological investigation and\nvector control measures, were carried out. A serological screening for DENV\nantibodies detection was offered to the population. In the case of positive\nDENV IgM, a second sample was collected to detect DENV RNA and verify\nseroconversion. Entomological and epidemiological investigations were also\nperformed. A modeling analysis was conducted to estimate the dengue generation\ntime, transmission potential, distance of transmission, and assess diagnostic\ndelays.\n  Results. Overall, 416 subjects participated to the screening program and 20\nwere identified as DENV-1 cases (15 confirmed and 5 probable). In addition,\nDENV-1 infection was diagnosed in 24 symptomatic subjects referred to the local\nEmergency Room Department for suggestive symptoms and 1 case was identified\nthrough blood donation screening. The average generation time was estimated to\nbe 18.3 days (95% CI: 13.1-23.5 days). R0 was estimated at 1.31 (95% CI:\n0.76-1.98); 90% of transmission occurred within 500m. Entomological\ninvestigations performed in 46 pools of mosquitoes revealed the presence of\nonly one positive pool for DENV-1.\n  Discussion. This report highlights the importance of synergic surveillance,\nincluding virological, entomological and public health measures to control the\nspread of arboviral infections.\n","subjects":["Quantitative Biology/Populations and Evolution"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ie9u-Jt73ZVxPvyRCCpeHswD-IfA6K3m6VLX_1FxzlA","pdfSize":"1894457"}
