{"id":"2408.08105","title":"Multimodal Causal Reasoning Benchmark: Challenging Vision Large Language\n  Models to Infer Causal Links Between Siamese Images","authors":"Zhiyuan Li, Heng Wang, Dongnan Liu, Chaoyi Zhang, Ao Ma, Jieting Long,\n  Weidong Cai","authorsParsed":[["Li","Zhiyuan",""],["Wang","Heng",""],["Liu","Dongnan",""],["Zhang","Chaoyi",""],["Ma","Ao",""],["Long","Jieting",""],["Cai","Weidong",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 12:04:32 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 05:25:22 GMT"}],"updateDate":"2024-09-17","timestamp":1723723472000,"abstract":"  Large Language Models (LLMs) have showcased exceptional ability in causal\nreasoning from textual information. However, will these causalities remain\nstraightforward for Vision Large Language Models (VLLMs) when only visual hints\nare provided? Motivated by this, we propose a novel Multimodal Causal Reasoning\nbenchmark, namely MuCR, to challenge VLLMs to infer semantic cause-and-effect\nrelationship when solely relying on visual cues such as action, appearance,\nclothing, and environment. Specifically, we introduce a prompt-driven image\nsynthesis approach to create siamese images with embedded semantic causality\nand visual cues, which can effectively evaluate VLLMs' causal reasoning\ncapabilities. Additionally, we develop tailored metrics from multiple\nperspectives, including image-level match, phrase-level understanding, and\nsentence-level explanation, to comprehensively assess VLLMs' comprehension\nabilities. Our extensive experiments reveal that the current state-of-the-art\nVLLMs are not as skilled at multimodal causal reasoning as we might have hoped.\nFurthermore, we perform a comprehensive analysis to understand these models'\nshortcomings from different views and suggest directions for future research.\nWe hope MuCR can serve as a valuable resource and foundational benchmark in\nmultimodal causal reasoning research. The project is available at:\nhttps://github.com/Zhiyuan-Li-John/MuCR\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}