{"id":"2408.08626","title":"Cross-Chip Partial Reconfiguration for the Initialisation of Modular and\n  Scalable Heterogeneous Systems","authors":"Marvin Fuchs, Hendrik Krause, Timo Muscheid, Lukas Scheller, Luis E.\n  Ardila-Perez, Oliver Sander","authorsParsed":[["Fuchs","Marvin",""],["Krause","Hendrik",""],["Muscheid","Timo",""],["Scheller","Lukas",""],["Ardila-Perez","Luis E.",""],["Sander","Oliver",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 09:40:23 GMT"}],"updateDate":"2024-08-19","timestamp":1723801223000,"abstract":"  The almost unlimited possibilities to customize the logic in an FPGA are one\nof the main reasons for the versatility of these devices. Partial\nreconfiguration exploits this capability even further by allowing to replace\nlogic in predefined FPGA regions at runtime. This is especially relevant in\nheterogeneous SoCs, combining FPGA fabric with conventional processors on a\nsingle die. Tight integration and supporting frameworks like the FPGA subsystem\nin Linux facilitate use, for example, to dynamically load custom hardware\naccelerators. Although this example is one of the most common use cases for\npartial reconfiguration, the possible applications go far beyond. We propose to\nuse partial reconfiguration in combination with the AXI C2C cross-chip bus to\nextend the resources of heterogeneous MPSoC and RFSoC devices by connecting\nperipheral FPGAs. With AXI C2C it is easily possible to link the programmable\nlogic of the individual devices, but partial reconfiguration on peripheral\nFPGAs utilising the same channel is not officially supported. By using an AXI\nICAP controller in combination with custom Linux drivers, we show that it is\npossible to enable the PS of the heterogeneous SoC to perform partial\nreconfiguration on peripheral FPGAs, and thus to seamlessly access and manage\nthe entire multi-device system. As a result, software and FPGA firmware updates\ncan be applied to the entire system at runtime, and peripheral FPGAs can be\nadded and removed during operation.\n","subjects":["Physics/Instrumentation and Detectors","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}