{"id":"2408.07057","title":"A Survey on Model MoErging: Recycling and Routing Among Specialized\n  Experts for Collaborative Learning","authors":"Prateek Yadav, Colin Raffel, Mohammed Muqeeth, Lucas Caccia, Haokun\n  Liu, Tianlong Chen, Mohit Bansal, Leshem Choshen, Alessandro Sordoni","authorsParsed":[["Yadav","Prateek",""],["Raffel","Colin",""],["Muqeeth","Mohammed",""],["Caccia","Lucas",""],["Liu","Haokun",""],["Chen","Tianlong",""],["Bansal","Mohit",""],["Choshen","Leshem",""],["Sordoni","Alessandro",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 17:49:00 GMT"}],"updateDate":"2024-08-14","timestamp":1723571340000,"abstract":"  The availability of performant pre-trained models has led to a proliferation\nof fine-tuned expert models that are specialized to a particular domain or\ntask. Model MoErging methods aim to recycle expert models to create an\naggregate system with improved performance or generalization. A key component\nof MoErging methods is the creation of a router that decides which expert\nmodel(s) to use for a particular input or application. The promise,\neffectiveness, and large design space of MoErging has spurred the development\nof many new methods over the past few years. This rapid pace of development has\nmade it challenging to compare different MoErging methods, which are rarely\ncompared to one another and are often validated in different experimental\nsetups. To remedy such gaps, we present a comprehensive survey of MoErging\nmethods that includes a novel taxonomy for cataloging key design choices and\nclarifying suitable applications for each method. Apart from surveying MoErging\nresearch, we inventory software tools and applications that make use of\nMoErging. We additionally discuss related fields of study such as model\nmerging, multitask learning, and mixture-of-experts models. Taken as a whole,\nour survey provides a unified overview of existing MoErging methods and creates\na solid foundation for future work in this burgeoning field.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}