{"id":"2408.05760","title":"Unlocking the Power of Numbers: Log Compression via Numeric Token\n  Parsing","authors":"Siyu Yu, Yifan Wu, Ying Li, Pinjia He","authorsParsed":[["Yu","Siyu",""],["Wu","Yifan",""],["Li","Ying",""],["He","Pinjia",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 12:30:41 GMT"}],"updateDate":"2024-08-13","timestamp":1723379441000,"abstract":"  Parser-based log compressors have been widely explored in recent years\nbecause the explosive growth of log volumes makes the compression performance\nof general-purpose compressors unsatisfactory. These parser-based compressors\npreprocess logs by grouping the logs based on the parsing result and then feed\nthe preprocessed files into a general-purpose compressor. However, parser-based\ncompressors have their limitations. First, the goals of parsing and compression\nare misaligned, so the inherent characteristics of logs were not fully\nutilized. In addition, the performance of parser-based compressors depends on\nthe sample logs and thus it is very unstable. Moreover, parser-based\ncompressors often incur a long processing time. To address these limitations,\nwe propose Denum, a simple, general log compressor with high compression ratio\nand speed. The core insight is that a majority of the tokens in logs are\nnumeric tokens (i.e. pure numbers, tokens with only numbers and special\ncharacters, and numeric variables) and effective compression of them is\ncritical for log compression. Specifically, Denum contains a Numeric Token\nParsing module, which extracts all numeric tokens and applies tailored\nprocessing methods (e.g. store the differences of incremental numbers like\ntimestamps), and a String Processing module, which processes the remaining log\ncontent without numbers. The processed files of the two modules are then fed as\ninput to a general-purpose compressor and it outputs the final compression\nresults. Denum has been evaluated on 16 log datasets and it achieves an\n8.7%-434.7% higher average compression ratio and 2.6x-37.7x faster average\ncompression speed (i.e. 26.2MB/S) compared to the baselines. Moreover,\nintegrating Denum's Numeric Token Parsing into existing log compressors can\nprovide an 11.8% improvement in their average compression ratio and achieve 37%\nfaster average compression speed.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/"}