{"id":"2408.03586","title":"Clinical Challenges and AI Opportunities in Decision-Making for Cancer\n  Treatment-Induced Cardiotoxicity","authors":"Siyi Wu, Weidan Cao, Shihan Fu, Bingsheng Yao, Ziqi Yang, Changchang\n  Yin, Varun Mishra, Daniel Addison, Ping Zhang, Dakuo Wang","authorsParsed":[["Wu","Siyi",""],["Cao","Weidan",""],["Fu","Shihan",""],["Yao","Bingsheng",""],["Yang","Ziqi",""],["Yin","Changchang",""],["Mishra","Varun",""],["Addison","Daniel",""],["Zhang","Ping",""],["Wang","Dakuo",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 06:58:27 GMT"}],"updateDate":"2024-08-08","timestamp":1723013907000,"abstract":"  Cardiotoxicity induced by cancer treatment has become a major clinical\nconcern, affecting the long-term survival and quality of life of cancer\npatients. Effective clinical decision-making, including the detection of cancer\ntreatment-induced cardiotoxicity and the monitoring of associated symptoms,\nremains a challenging task for clinicians. This study investigates the current\npractices and needs of clinicians in the clinical decision making of cancer\ntreatment-induced cardiotoxicity and explores the potential of digital health\ntechnologies to support this process. Through semi-structured interviews with\nseven clinical experts, we identify a three-step decision-making paradigm: 1)\nsymptom identification, 2) diagnostic testing and specialist collaboration, and\n3) clinical decision-making and intervention. Our findings highlight the\ndifficulties of diagnosing cardiotoxicity (absence of unified protocols and\nhigh variability in symptoms) and monitoring patient symptoms (lacking accurate\nand timely patient self-reported symptoms). The clinicians also expressed their\nneed for effective early detection tools that can integrate remote patient\nmonitoring capabilities. Based on these insights, we discuss the importance of\nunderstanding the dynamic nature of clinical workflows, and the design\nconsiderations for future digital tools to support cancer-treatment-induced\ncardiotoxicity decision-making.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"tIkfVqAK2-f-0KxBFhqXWSB18KmWV7ZPoEDpBG0AWwE","pdfSize":"896813"}
