{"id":"2408.16426","title":"COIN: Control-Inpainting Diffusion Prior for Human and Camera Motion\n  Estimation","authors":"Jiefeng Li, Ye Yuan, Davis Rempe, Haotian Zhang, Pavlo Molchanov, Cewu\n  Lu, Jan Kautz, Umar Iqbal","authorsParsed":[["Li","Jiefeng",""],["Yuan","Ye",""],["Rempe","Davis",""],["Zhang","Haotian",""],["Molchanov","Pavlo",""],["Lu","Cewu",""],["Kautz","Jan",""],["Iqbal","Umar",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 10:36:29 GMT"}],"updateDate":"2024-08-30","timestamp":1724927789000,"abstract":"  Estimating global human motion from moving cameras is challenging due to the\nentanglement of human and camera motions. To mitigate the ambiguity, existing\nmethods leverage learned human motion priors, which however often result in\noversmoothed motions with misaligned 2D projections. To tackle this problem, we\npropose COIN, a control-inpainting motion diffusion prior that enables\nfine-grained control to disentangle human and camera motions. Although\npre-trained motion diffusion models encode rich motion priors, we find it\nnon-trivial to leverage such knowledge to guide global motion estimation from\nRGB videos. COIN introduces a novel control-inpainting score distillation\nsampling method to ensure well-aligned, consistent, and high-quality motion\nfrom the diffusion prior within a joint optimization framework. Furthermore, we\nintroduce a new human-scene relation loss to alleviate the scale ambiguity by\nenforcing consistency among the humans, camera, and scene. Experiments on three\nchallenging benchmarks demonstrate the effectiveness of COIN, which outperforms\nthe state-of-the-art methods in terms of global human motion estimation and\ncamera motion estimation. As an illustrative example, COIN outperforms the\nstate-of-the-art method by 33% in world joint position error (W-MPJPE) on the\nRICH dataset.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}