{"id":"2408.06430","title":"Data-driven MHD Simulation of the Formation of a Magnetic Flux Rope and\n  an Inclined Solar Eruption","authors":"Yeongmin Kang, Takafumi Kaneko, K.D. Leka, Kanya Kusano","authorsParsed":[["Kang","Yeongmin",""],["Kaneko","Takafumi",""],["Leka","K. D.",""],["Kusano","Kanya",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 18:11:12 GMT"}],"updateDate":"2024-08-14","timestamp":1723486272000,"abstract":"  Solar energetic events are caused by the release of magnetic energy\naccumulated in the solar atmosphere. To understand their initiating physical\nmechanisms, the dynamics of the coronal magnetic fields must be studied.\nUnfortunately, the dominant mechanisms are still unclear due to lack of direct\nmeasurements. Numerical simulations based on magnetohydrodynamics (MHD) can\nreproduce the dynamical evolution of solar coronal magnetic field providing a\nuseful tool to explore flare initiation. Data-driven MHD simulations, in which\nthe time-series observational data of the photospheric magnetic field is used\nas the simulation boundary condition, can explore different mechanisms. To\ninvestigate the accumulation of free magnetic energy through to a solar\neruption, we simulated the first of several large flares in NOAA Active Region\n11283. We used a data-driven model (Kaneko et al 2021) that was governed by\nzero-beta MHD, focusing on the free magnetic energy accumulation prior to the\nM5.3 flare (September 6, 01:59 UT, 2011). We reproduced the flare-associated\neruption following the formation of twisted magnetic fields, or a magnetic flux\nrope (MFR), formed by photospheric motions at its footpoints. We found that the\neruption was first triggered by the growth of the torus instability. The\nerupting MFR caused magnetic reconnections with neighboring magnetic field\nlines located along the direction of the eruption. Using the simulation results\nand an axial-radial decay index centered on the MFR, we find a natural\nexplanation for the inclination of the eruption and a possible approach to\npredict the direction of solar eruptive events.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}