{"id":"2408.02706","title":"Bayesian Kolmogorov Arnold Networks (Bayesian_KANs): A Probabilistic\n  Approach to Enhance Accuracy and Interpretability","authors":"Masoud Muhammed Hassan","authorsParsed":[["Hassan","Masoud Muhammed",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 10:38:34 GMT"}],"updateDate":"2024-08-07","timestamp":1722854314000,"abstract":"  Because of its strong predictive skills, deep learning has emerged as an\nessential tool in many industries, including healthcare. Traditional deep\nlearning models, on the other hand, frequently lack interpretability and omit\nto take prediction uncertainty into account two crucial components of clinical\ndecision making. In order to produce explainable and uncertainty aware\npredictions, this study presents a novel framework called Bayesian Kolmogorov\nArnold Networks (BKANs), which combines the expressive capacity of Kolmogorov\nArnold Networks with Bayesian inference. We employ BKANs on two medical\ndatasets, which are widely used benchmarks for assessing machine learning\nmodels in medical diagnostics: the Pima Indians Diabetes dataset and the\nCleveland Heart Disease dataset. Our method provides useful insights into\nprediction confidence and decision boundaries and outperforms traditional deep\nlearning models in terms of prediction accuracy. Moreover, BKANs' capacity to\nrepresent aleatoric and epistemic uncertainty guarantees doctors receive more\nsolid and trustworthy decision support. Our Bayesian strategy improves the\ninterpretability of the model and considerably minimises overfitting, which is\nimportant for tiny and imbalanced medical datasets, according to experimental\nresults. We present possible expansions to further use BKANs in more\ncomplicated multimodal datasets and address the significance of these\ndiscoveries for future research in building reliable AI systems for healthcare.\nThis work paves the way for a new paradigm in deep learning model deployment in\nvital sectors where transparency and reliability are crucial.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"II7ZIOVNI4hnkpd1G--hu8XLTqJ9_5CFNvCK-PDzQNw","pdfSize":"595349","txDigest":"8wDRutMNm1dcHGtMbLPtw4KPoMAF2cbU34noDdtCU2pH","endEpoch":"1","status":"CERTIFIED"}
