{"id":"2408.05693","title":"Modeling collagen fibril degradation as a function of matrix\n  microarchitecture","authors":"B. Debnath, B. N. Narasimhan, S. I. Fraley, P. Rangamani","authorsParsed":[["Debnath","B.",""],["Narasimhan","B. N.",""],["Fraley","S. I.",""],["Rangamani","P.",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 04:29:08 GMT"}],"updateDate":"2024-08-13","timestamp":1723350548000,"abstract":"  Collagenolytic degradation is a process fundamental to tissue remodeling. The\nmicroarchitecture of collagen fibril networks changes during development,\naging, and disease. Such changes to microarchitecture are often accompanied by\nchanges in matrix degradability. In vitro, collagen matrices of the same\nconcentration but different microarchitectures also vary in degradation rate.\nHow do different microarchitectures affect matrix degradation? To answer this\nquestion, we developed a computational model of collagen degradation. We first\ndeveloped a lattice model that describes collagen degradation at the scale of a\nsingle fibril. We then extended this model to investigate the role of\nmicroarchitecture using Brownian dynamics simulation of enzymes in a\nmulti-fibril three dimensional matrix to predict its degradability. Our\nsimulations predict that the distribution of enzymes around the fibrils is\nnon-uniform and depends on the microarchitecture of the matrix. This\nnon-uniformity in enzyme distribution can lead to different extents of\ndegradability for matrices of different microarchitectures. Our model\npredictions were tested using in vitro experiments with synthesized collagen\ngels of different microarchitectures. Experiments showed that indeed\ndegradation of collagen depends on the matrix architecture and fibril\nthickness. In summary, our study shows that the microarchitecture of the\ncollagen matrix is an important determinant of its degradability.\n","subjects":["Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}