{"id":"2408.14564","title":"Nonlinear memory in cell division dynamics across species","authors":"Shijie Zhang, Chenyi Fei, and J\\\"orn Dunkel","authorsParsed":[["Zhang","Shijie",""],["Fei","Chenyi",""],["Dunkel","Jörn",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 18:30:18 GMT"}],"updateDate":"2024-08-28","timestamp":1724697018000,"abstract":"  Regulation of cell growth and division is essential to achieve cell-size\nhomeostasis. Recent advances in imaging technologies, such as ``mother\nmachines\" for bacteria or yeast, have allowed long-term tracking of cell-size\ndynamics across many generations, and thus have brought major insights into the\nmechanisms underlying cell-size control. However, understanding the governing\nrules of cell growth and division within a quantitative dynamical-systems\nframework remains a major challenge. Here, we implement and apply a framework\nthat makes it possible to infer stochastic differential equation (SDE) models\nwith Poisson noise directly from experimentally measured time series for\ncellular growth and divisions. To account for potential nonlinear memory\neffects, we parameterize the Poisson intensity of stochastic cell division\nevents in terms of both the cell's current size and its ancestral history. By\napplying the algorithm to experimentally measured cell size trajectories, we\nare able to quantitatively evaluate the linear one-step memory hypothesis\nunderlying the popular ``sizer\",``adder\", and ``timer\" models of cell\nhomeostasis. For Escherichia coli and Bacillus subtilis bacteria,\nSchizosaccharomyces pombe yeast and Dictyostelium discoideum amoebae, we find\nthat in many cases the inferred stochastic models have a substantial nonlinear\nmemory component. This suggests a need to reevaluate and generalize the\ncurrently prevailing linear-memory paradigm of cell homeostasis. More broadly,\nthe underlying inference framework is directly applicable to identify\nquantitative models for stochastic jump processes in a wide range of scientific\ndisciplines.\n","subjects":["Quantitative Biology/Quantitative Methods","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ILWt8iwZlwkf5KfPYi6soKD6rGS5HtqzLH8uiR5sZLQ","pdfSize":"33885568"}
