{"id":"2408.08460","title":"Field mixing in a thermal medium: A quantum master equation approach","authors":"Shuyang Cao","authorsParsed":[["Cao","Shuyang",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 00:02:08 GMT"},{"version":"v2","created":"Mon, 19 Aug 2024 04:11:31 GMT"}],"updateDate":"2024-08-20","timestamp":1723766528000,"abstract":"  We studied the nonequilibrium dynamics of the indirect mixing of two\n(pseudo-)scalar fields induced by their couplings to common decay channels in a\nmedium. The effective non-Markovian quantum master equation (QME) for the two\nfields' reduced density matrix is derived to leading order in the couplings of\nthe two fields with the medium, but to all orders of the couplings among\ndegrees of freedom in the medium. The self-energy and noise-kernel in the QME\nsatisfy a fluctuation-dissipation relation. The solutions show that an initial\nexpectation value (condensate) of one field induces a condensate of the other\nfield through the indirect mixing and that the populations and coherence of the\ntwo fields thermalize and approach to non-vanishing values asymptotically. The\nnearly-degenerate field masses and coupling strengths resonantly enhance the\nquantum beats and asymptotic coherence, and induce a prominent dynamics of the\nvacuum after the switch-on of the couplings. We argue that a time-dependent\ndefinitions of particles due to the changing vacuum must be introduced so as to\nobtain results consistent with the calculations of equilibrium states in the\nasymptotic limit. A coupling strength hierarchy breaks down the resonant\nenhancement in the nearly-degenerate case but leads to different power\ncountings of the coupling strengths in the magnitudes of the observables and\ntime-scales in the evolution, suggesting the possibility of detecting extremely\nlong-lived particles using prepared short-lived particles within a practical\nexperimental period.\n","subjects":["Physics/Quantum Physics","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}