{"id":"2408.12549","title":"Modeling Time-Variant Responses of Optical Compressors with Selective\n  State Space Models","authors":"Riccardo Simionato and Stefano Fasciani","authorsParsed":[["Simionato","Riccardo",""],["Fasciani","Stefano",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 17:03:08 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 09:46:54 GMT"}],"updateDate":"2024-08-30","timestamp":1724346188000,"abstract":"  This paper presents a method for modeling optical dynamic range compressors\nusing deep neural networks with Selective State Space models. The proposed\napproach surpasses previous methods based on recurrent layers by employing a\nSelective State Space block to encode the input audio. It features a refined\ntechnique integrating Feature-wise Linear Modulation and Gated Linear Units to\nadjust the network dynamically, conditioning the compression's attack and\nrelease phases according to external parameters. The proposed architecture is\nwell-suited for low-latency and real-time applications, crucial in live audio\nprocessing. The method has been validated on the analog optical compressors\nTubeTech CL 1B and Teletronix LA-2A, which possess distinct characteristics.\nEvaluation is performed using quantitative metrics and subjective listening\ntests, comparing the proposed method with other state-of-the-art models.\nResults show that our black-box modeling methods outperform all others,\nachieving accurate emulation of the compression process for both seen and\nunseen settings during training. We further show a correlation between this\naccuracy and the sampling density of the control parameters in the dataset and\nidentify settings with fast attack and slow release as the most challenging to\nemulate.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"WVlyYDHS41M2QR9NdfYMb_6Bv3jOjztDQ2UY1EZpPI4","pdfSize":"10800291"}
