{"id":"2408.15807","title":"Simulation and analysis of a high-k electron scale turbulence diagnostic\n  for MAST-U","authors":"David C. Speirs, Juan Ruiz-Ruiz, Maurizio Giacomin, Valerian H.\n  Hall-Chen, Alan D. R. Phelps, Roddy Vann, Peter G. Huggard, Hui Wang, Anthony\n  Field and Kevin Ronald","authorsParsed":[["Speirs","David C.",""],["Ruiz-Ruiz","Juan",""],["Giacomin","Maurizio",""],["Hall-Chen","Valerian H.",""],["Phelps","Alan D. R.",""],["Vann","Roddy",""],["Huggard","Peter G.",""],["Wang","Hui",""],["Field","Anthony",""],["Ronald","Kevin",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 14:03:54 GMT"}],"updateDate":"2024-08-29","timestamp":1724853834000,"abstract":"  Plasma turbulence on disparate spatial and temporal scales plays a key role\nin defining the level of confinement achievable in tokamaks, with the\ndevelopment of reduced numerical models for cross-scale turbulence effects\ninformed by experimental measurements an essential step. MAST-U is a\nwell-equipped facility having instruments to measure ion and electron scale\nturbulence at the plasma edge. However, measurement of core electron scale\nturbulence is challenging, especially in H mode. Using a novel synthetic\ndiagnostic approach, we present simulated measurement specifications of a\nproposed mm-wave based collective scattering instrument optimised for measuring\nboth normal and binormal electron scale turbulence in the core and edge of\nMAST-U. A powerful modelling framework has been developed that combines\nbeam-tracing techniques with gyrokinetic simulations to predict the\nsensitivity, localisation and spectral range of measurement. For the\nreconstructed MAST 022769 shot, a maximum measurable normalised bi-normal\nwavenumber of $k_{\\perp} \\rho_{e} \\sim 0.6$ was predicted in the core and\n$k_{\\perp} \\rho_{e} \\sim 0.79$ near the pedestal, with localisation lengths\n$L_{FWHM}$ ranging from $\\sim$ 0.4 m in the core at $k_{\\perp} \\rho_{e} \\sim\n0.1$ to ~0.08m at $k_{\\perp} \\rho_{e} \\sim 0.45$. Synthetic diagnostic analysis\nfor the 022769 shot using CGYRO gyrokinetic simulation spectra reveal that ETG\nturbulence wavenumbers of peak spectral intensity comfortably fall within the\nmeasurable range of the instrument from the core to the pedestal. The proposed\ndiagnostic opens up opportunities to study new regimes of turbulence and\nconfinement in association with upcoming non-inductive, microwave based current\ndrive experiments on MAST-U and can provide insight into cross-scale turbulence\neffects, while having suitability to operate during burning plasma scenarios on\nfuture reactors such as STEP.\n","subjects":["Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}