{"id":"2408.11532","title":"Classification of Mitral Regurgitation from Cardiac Cine MRI using\n  Clinically-Interpretable Morphological Features","authors":"Y. On, K. Vimalesvaran, S. Zaman, M. Shun-Shin, J. Howard, N. Linton,\n  G. Cole, A.A. Bharath, M. Varela","authorsParsed":[["On","Y.",""],["Vimalesvaran","K.",""],["Zaman","S.",""],["Shun-Shin","M.",""],["Howard","J.",""],["Linton","N.",""],["Cole","G.",""],["Bharath","A. A.",""],["Varela","M.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 11:14:07 GMT"}],"updateDate":"2024-08-22","timestamp":1724238847000,"abstract":"  The assessment of mitral regurgitation (MR) using cardiac MRI, particularly\nCine MRI, is a promising technique due to its wide availability. However, some\nof the temporal information available in clinical Cine MRI may not be fully\nutilised, as it requires detailed temporal analysis across different cardiac\nviews. We propose a new approach to identify MR which automatically extracts\n4-dimensional (3D + Time) morphological features from the reconstructed mitral\nannulus (MA) using Cine long-axis (LAX) views MRI.\n  Our feature extraction involves locating the MA insertion points to derive\nthe reconstructed MA geometry and displacements, resulting in a total of 187\ncandidate features. We identify the 25 most relevant mitral valve features\nusing minimum-redundancy maximum-relevance (MRMR) feature selection technique.\nWe then apply linear discriminant analysis (LDA) and random forest (RF) model\nto determine the presence of MR. Both LDA and RF demonstrate good performance,\nwith accuracies of 0.72 +/- 0.05 and 0.73 +/- 0.09, respectively, in a 5-fold\ncross-validation analysis.\n  This approach will be incorporated in an automatic tool to identify valvular\ndiseases from Cine MRI by integrating both handcrafted and deep features. Our\ntool will facilitate the diagnosis of valvular disease from conventional\ncardiac MRI scans with no additional scanning or image analysis penalty.\n  All code is made available on an open-source basis at:\nhttps://github.com/HenryOn2021/MA_Morphological_Features.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}