{"id":"2408.00132","title":"Aspects of Stability, Rigidity and Unitarity in String Vacua","authors":"Giorgio Leone","authorsParsed":[["Leone","Giorgio",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 19:46:15 GMT"}],"updateDate":"2024-08-02","timestamp":1722455175000,"abstract":"  In this Thesis we investigate properties of stability, rigidity and unitarity\nof the string landscape in ten and lower dimensions. The dissertation explores\nthese aspects by intertwining a detailed analysis of string vacua, with and\nwithout supersymmetry, with a bottom-up study driven by unitarity. In\nparticular, in Chapter 1 the possibility of formulating a necessary and\nsufficient condition for the classical stability of non-supersymmetric string\nvacua is discussed, emphasising the examples in ten and nine dimensions. In\nChapter 2, new solutions are presented in six dimensions both for BSB and\nsupersymmetric $T^4/\\mathbb{Z}_6$ orientifold vacua, arising from a non-trivial\ncancellation of the R-R tadpoles. The consitency of these theories is shown by\nchecking the cancellation of local anomalies and verifying the unitarity\nconstraints arising from the introduction of string defects. Finally, Chapter 3\ndiscusses the role played by a new kind of global anomaly, arising from the\ninconsistency of effective field theories under topology change. A systematic\nanalysis of six-dimensional supergravity theories with $\\text{SU}(2)$ gauge\ngroup and one tensor multiplet and $\\text{U}(1)$ gauge group with no tensor\nmultiplets is discussed. Novel constraints are found and their cancellation in\nstring vacua is verified. In addition, we have investigated the\n$\\text{SO}(16)\\times \\text{SO}(16)$ heterotic theory compactified on the\n$T^4/\\mathbb{Z}_6$ orbifold and the Gepner orientifold with no tensor\nmultiples, showing how such anomalies are cancelled. Even though expected, this\nresult provides a non-trivial consistency check that is not guaranteed by any\ntheorem known in the literature.\n","subjects":["Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}