{"id":"2408.03036","title":"Modeling and measuring the anisotropic halo 3-point correlation\n  function: a coordinated study","authors":"Antonio Farina, Alfonso Veropalumbo, Enzo Branchini, Massimo Guidi","authorsParsed":[["Farina","Antonio",""],["Veropalumbo","Alfonso",""],["Branchini","Enzo",""],["Guidi","Massimo",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 08:38:35 GMT"}],"updateDate":"2024-08-07","timestamp":1722933515000,"abstract":"  Ongoing spectroscopic galaxy surveys like DESI (arXiv:1611.00037,\narXiv:1611.00036) and Euclid (arXiv:2405.13491) will cover unprecedented\nvolumes with a number of objects large enough to effectively probe clustering\nanisotropies through higher-order statistics. In this work, we present an\noriginal and efficient implementation of both a model for the multipole moments\nof the anisotropic 3-point correlation function (3PCF) and for their estimator.\nTo assess the adequacy of our model, we have predicted the anisotropic 3PCF for\na set of dark matter halos at redshift $z = 1$ and compared our prediction with\nthe 3PCF measurement obtained by applying our estimator to a suite of 298\nN-body + 3000 approximate mock halo catalogs at the same redshift. The use of\nthe anisotropic component of the 3PCF effectively breaks the degeneracy between\nthe growth rate $f$ and the linear bias $b_1$, allowing us to obtain unbiased\nestimates for both parameters from a Euclid-like survey. A joint, full\nanisotropic, 2 and 3-point correlation analysis would also allow us to measure\nthe clustering amplitude $\\sigma_8$ along with $f$ and $b_1$ with a precision\nof approximately 17%, and to effectively constrain all galaxy biasing\nparameters of the model. However, these results largely exploit information\nfrom the isotropic part of the 3PCF signal. The addition of the anisotropic\nmultipoles tightens parameter estimates by just 5% at most. We argue that this\nmodest improvement likely reflects the use of a simplified cosmological model\nwith relatively few free parameters. The 3PCF anisotropic multipoles will prove\nuseful in reducing the impact of projection effects that affect\nhigh-dimensional cosmological analyses. To support this conjecture, we provide\nan example in which an additional source of anisotropy, the Alcock-Paczynski\neffect, is added to the system.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}