{"id":"2408.03257","title":"Dissociation line and driving force for nucleation of the nitrogen\n  hydrate from computer simulation. II. Effect of multiple occupancy","authors":"Miguel J. Torrej\\'on, Jes\\'us Algaba, and Felipe J. Blas","authorsParsed":[["Torrejón","Miguel J.",""],["Algaba","Jesús",""],["Blas","Felipe J.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 15:43:33 GMT"}],"updateDate":"2024-08-07","timestamp":1722959013000,"abstract":"  In this work, we determine the dissociation line of the nitrogen (N$_{2}$)\nhydrate by computer simulation using the TIP4P/Ice model for water and the\nTraPPE force field for N$_{2}$. This work is the natural extension of our\nprevious paper in which the dissociation temperature of the N$_2$ hydrate has\nbeen obtained at $500$, $1000$, and $1500\\,\\text{bar}$ [\\emph{J. Chem. Phys.}\n\\textbf{159}, 224707 (2023)] using the solubility method and assuming single\noccupancy. We extend our previous study and determine the dissociation\ntemperature of the N$_2$ hydrate at different pressures, from $500$ to\n$4500\\,\\text{bar}$, taking into account single and double occupancy of the\nN$_{2}$ molecules in the hydrate structure. We calculate the solubility of\nN$_2$ in the aqueous solution, as a function of temperature, when it is in\ncontact with a N$_{2}$-rich liquid phase and when in contact with the hydrate\nphase with single and double occupancy via planar interfaces. Both curves\nintersect at a certain temperature that determines the dissociation temperature\nat a given pressure. We observe a negligible effect of the occupancy on the\ndissociation temperature. Our findings are in very good agreement with the\nexperimental data taken from the literature. We have also obtained the driving\nforce for nucleation of the hydrate as a function of the temperature and\noccupancy at several pressures. As in the case of the dissociation line, the\neffect of the occupancy on the driving force for nucleation is negligible. To\nthe best of our knowledge, this is the first time that the effect of the\noccupancy on the driving force for nucleation of a hydrate that exhibits sII\ncrystallographic structure is studied from computer simulation.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/"}