{"id":"2408.03613","title":"A Predictive Approach for Selecting the Best Quantum Solver for an\n  Optimization Problem","authors":"Deborah Volpe, Nils Quetschlich, Mariagrazia Graziano, Giovanna\n  Turvani, Robert Wille","authorsParsed":[["Volpe","Deborah",""],["Quetschlich","Nils",""],["Graziano","Mariagrazia",""],["Turvani","Giovanna",""],["Wille","Robert",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 08:14:58 GMT"}],"updateDate":"2024-08-08","timestamp":1723018498000,"abstract":"  Leveraging quantum computers for optimization problems holds promise across\nvarious application domains. Nevertheless, utilizing respective quantum\ncomputing solvers requires describing the optimization problem according to the\nQuadratic Unconstrained Binary Optimization (QUBO) formalism and selecting a\nproper solver for the application of interest with a reasonable setting. Both\ndemand significant proficiency in quantum computing, QUBO formulation, and\nquantum solvers, a background that usually cannot be assumed by end users who\nare domain experts rather than quantum computing specialists. While tools aid\nin QUBO formulations, support for selecting the best-solving approach remains\nabsent. This becomes even more challenging because selecting the best solver\nfor a problem heavily depends on the problem itself. In this work, we are\naccepting this challenge and propose a predictive selection approach, which\naids end users in this task. To this end, the solver selection task is first\nformulated as a classification task that is suitable to be solved by supervised\nmachine learning. Based on that, we then propose strategies for adjusting\nsolver parameters based on problem size and characteristics. Experimental\nevaluations, considering more than 500 different QUBO problems, confirm the\nbenefits of the proposed solution. In fact, we show that in more than 70% of\nthe cases, the best solver is selected, and in about 90% of the problems, a\nsolver in the top two, i.e., the best or its closest suboptimum, is selected.\nThis exploration proves the potential of machine learning in quantum solver\nselection and lays the foundations for its automation, broadening access to\nquantum optimization for a wider range of users.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ngFiub9zvGbnqMNX_M6SOOn_e7GP_KVgtmSVAx1TCCI","pdfSize":"837318"}
