{"id":"2408.14522","title":"Methodology of safety evaluation of In-Vessel Retention","authors":"Florian Fichot (IRSN/PSN-RES/SAM/LEPC), Laure Car\\'enini\n  (IRSN/PSN-RES/SAM/LEPC), Stephan Brumm (JRC), Marco Sangiorgi (JRC)","authorsParsed":[["Fichot","Florian","","IRSN/PSN-RES/SAM/LEPC"],["Carénini","Laure","","IRSN/PSN-RES/SAM/LEPC"],["Brumm","Stephan","","JRC"],["Sangiorgi","Marco","","JRC"]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 07:48:31 GMT"}],"updateDate":"2024-08-28","timestamp":1724658511000,"abstract":"  Molten corium stabilization following a severe accident is of crucial\nimportance in order to ensure containment integrity on a long-term basis and\nminimizing radioactive elements releases outside the plant. Among the possible\noptions, In-Vessel Retention (IVR) through external cooling appears as an\nattractive solution that would limit the dispersion of corium in the plant and\nminimize the risks of containment failure. Nevertheless its feasibility has to\nbe proved.The IVR strategy is already adopted in Europe for some VVER 440 type\n213 reactors thanks to thorough research work started in the '90s for the\nFinnish Loviisa power plant, and subsequently extended to Bohunice and Mochovce\n(Slovakia), Dukovany (Czech Republic) and Paks (Hungary) power plants. The\nstrategy is also included in the design of some high power new Gen.III reactors\nsuch as AP1000, APR 1400 and Chinese HPR1000 and CAP1400. It has also been\nstudied in the past for other reactor concepts like KERENA (1250 MWe - BWR),\nAP600 or VVER-640.Current approaches for reactors with relatively small power,\nsuch as VVER 440 or AP600, use conservative assumptions for the safety\ndemonstration. However, for higher power reactors (around 1000 MWe), the safety\nmargin is reduced and it is necessary to evaluate the IVR strategy with\nbest-estimate methods in order to reduce the uncertainties associated with the\ninvolved phenomena. Additional R&D as well as a revision of the methodology are\nneeded to ensure and demonstrate adequate safety margins, including, in\nparticular, best-estimate evaluations of thermal load applied on the vessel and\nmechanical resistance of the ablated vessel.The IVMR project (In-Vessel Melt\nRetention) was built with the goal of providing new knowledge (experimental,\ntheoretical and technical) and a new methodology able to provide a\nbest-estimate evaluation of IVR strategy for large power reactors. The main\nobjective of Task 2.1 within WP2 was to define a common methodology to analyse\nIVR Severe Accident Management (SAM) strategy for the different types of EU\nNPPs. It started by reviewing the status of existing methodology and aimed at\nelaborating a more general, updated and less conservative one applicable to\nseveral types of reactors.This paper describes the proposed new methodology. It\nstarts with the identification of the deficiencies of the standard methodology\nwhen it is applied to a high power reactor. It introduces the minimum vessel\nthickness as a parameter representing the cumulated imbalance between internal\nheat load and external cooling. Then it explains how to use that parameter in\nthe evaluation of the safety margin. Although some examples are given as\nillustrations, it must be kept in mind that this paper proposes a generic\nmethodology but there cannot be any generic conclusion: any reactor design must\nbe evaluated independently.\n","subjects":["Physics/Medical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}