{"id":"2408.08810","title":"Multipolar Anisotropy in Anomalous Hall Effect from Spin-Group Symmetry\n  Breaking","authors":"Zheng Liu, Mengjie Wei, Dazhi Hou, Yang Gao, and Qian Niu","authorsParsed":[["Liu","Zheng",""],["Wei","Mengjie",""],["Hou","Dazhi",""],["Gao","Yang",""],["Niu","Qian",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 15:44:00 GMT"}],"updateDate":"2024-08-19","timestamp":1723823040000,"abstract":"  Traditional view of the anomalous Hall effect~(AHE) in ferromagnets is that\nit arises from the magnetization perpendicular to the measurement plane and\nthat there is a linear dependence on the latter. Underlying such a view is the\nthinking that the AHE is a time-reversal symmetry breaking phenomenon and can\ntherefore be treated in terms of a power series in the magnetic order. However,\nthis view is squarely challenged by a number of experiments recently, urging\nfor a thorough theoretical investigation on the fundamental level. We find that\nfor strong magnets, it is more appropriate and fruitful to regard the AHE as a\nspin-group symmetry breaking phenomenon where the critical parameter is the\nspin-orbit interaction strength, which involves a much smaller energy scale. In\nferromagnets, the spin-orbit coupling breaks the $\\infty 2^\\prime$ spin\nrotation symmetry, and the key to characterizing such symmetry breaking is the\nidentification of spin-orbit vectors which transform regularly under spin group\noperations. Born out of our framework is a rich multi-polar relationship\nbetween the anomalous Hall conductivity and the magnetization direction, with\neach pole being expanded progressively in powers of the spin-orbit coupling\nstrength. For the leading order contribution, i.e., the dipole, its isotropic\npart corresponds to the traditional view, and its anisotropic part can lead to\nthe in-plane AHE where the magnetization lies within the measurement plane.\nBeyond the dipolar one, the octupolar structure offers the leading order source\nof nonlinearity and hence introduces unique anisotropy where the dipolar\nstructure cannot. The dipolar and octupolar structure offers a unified\nexplanation for the in-plane AHE recently observed in various ferromagnets, and\nour comprehensive analysis further extends the candidate material systems.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"SiY3Du25o7eBaDmvBAjXEVhW-jM20tLAofzoe4cQBDw","pdfSize":"5785749"}
