{"id":"2408.00773","title":"Spike Talk: Genesis and Neural Coding Scheme Translations","authors":"Subham Sahoo","authorsParsed":[["Sahoo","Subham",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 06:49:00 GMT"}],"updateDate":"2024-08-05","timestamp":1721112540000,"abstract":"  Although digitalization of future power grids offer several coordination\nincentives, the reliability and security of information and communication\ntechnologies (ICT) hinders its overall performance. In this paper, we introduce\na novel architecture Spike Talk via a unified representation of power and\ninformation as a means of data normalization using spikes for coordinated\ncontrol of microgrids. This grid-edge technology allows each distributed energy\nresource (DER) to execute decentralized secondary control philosophy\nindependently by interacting among each other using power flow along the\ntie-lines. Inspired from the field of computational neuroscience, Spike Talk\nbasically builds on a fine-grained parallelism on the information transfer\ntheory in our brains, particularly when neurons (modeled as DERs) transmit\ninformation (inferred from power streams measurable at each DER) through\nsynapses (modeled as tie-lines). Not only does Spike Talk simplify and address\nthe current bottlenecks of the cyber-physical architectural operation by\ndismissing the ICT layer, it provides intrinsic operational and cost-effective\nopportunities in terms of infrastructure development, computations and\nmodeling. Hence, this paper provides a pedagogic illustration of the key\nconcepts and design theories. Since we focus on coordinated control of\nmicrogrids in this paper, the signaling accuracy and system performance is\nstudied for several neural coding schemes responsible for converting the\nreal-valued local measurements into spikes.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Information Theory","Computing Research Repository/Multiagent Systems","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"fgoOefU7Y91Zg3wksZO3RF4sSiskymrJxQg997tJfmc","pdfSize":"2133606"}
