{"id":"2408.14910","title":"Deep learning classification system for coconut maturity levels based on\n  acoustic signals","authors":"June Anne Caladcad and Eduardo Jr Piedad","authorsParsed":[["Caladcad","June Anne",""],["Piedad","Eduardo Jr",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 09:37:19 GMT"}],"updateDate":"2024-08-28","timestamp":1724751439000,"abstract":"  The advancement of computer image processing, pattern recognition, signal\nprocessing, and other technologies has gradually replaced the manual methods of\nclassifying fruit with computer and mechanical methods. In the field of\nagriculture, the intelligent classification of post-harvested fruit has enabled\nthe use of smart devices that creates a direct impact on farmers, especially on\nexport products. For coconut classification, it remains to be traditional in\nprocess. This study presents a classification of the coconut dataset based on\nacoustic signals. To address the imbalanced dataset, a data augmentation\ntechnique was conducted through audiomentation and procedural audio generation\nmethods. Audio signals under premature, mature, and overmature now have 4,050,\n4,050, and 5,850 audio signals, respectively. To address the updation of the\nclassification system and the classification accuracy performance, deep\nlearning models were utilized for classifying the generated audio signals from\ndata generation. Specifically, RNN and LSTM models were trained and tested, and\ntheir performances were compared with each other and the machine learning\nmethods used by Caladcad et al. (2020). The two DL models showed impressive\nperformance with both having an accuracy of 97.42% and neither of them\noutperformed the other since there are no significant differences in their\nclassification performance.\n","subjects":["Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"dvMp3zOtZMSS4puGQKG6wvG0xI5a36tdhxL3gz8oN3M","pdfSize":"758720"}
