{"id":"2408.07586","title":"Plasmonic Particle Integration into Near-Infrared Photodetectors and\n  Photoactivated Gas Sensors: Towards Sustainable Next-Generation Ubiquitous\n  Sensing","authors":"Hendrik Schlicke, Roman Maletz, Christina Dornack, Andreas Fery","authorsParsed":[["Schlicke","Hendrik",""],["Maletz","Roman",""],["Dornack","Christina",""],["Fery","Andreas",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 14:35:16 GMT"}],"updateDate":"2024-08-15","timestamp":1723646116000,"abstract":"  Current challenges in environmental science, medicine, food chemistry as well\nas the emerging use of artificial intelligence for solving problems in these\nfields require distributed, local sensing. Such ubiquitous sensing requires\ncomponents with (1) high sensitivity, (2) power efficiency, (3)\nminiaturizability and (4) the ability to directly interface with electronic\ncircuitry, i.e., electronic readout of sensing signals. Over the recent years,\nseveral nanoparticle-based approaches have found their way into this field and\nhave demonstrated high performance. However, challenges remain, such as the\ntoxicity of many of today's narrow bandgap semiconductors for NIR detection and\nthe high energy consumption as well as low selectivity of state-of-the-art\ncommercialized gas sensors. With their unique light-matter interaction and\nink-based fabrication schemes, plasmonic nanostructures provide potential\ntechnological solutions to these challenges, leading also to better\nenvironmental performance. In this perspective we discuss recent approaches of\nusing plasmonic nanoparticles for the fabrication of NIR photodetectors and\nlight-activated, energy-efficient gas sensing devices. In addition, we point\nout new strategies implying computational approaches for miniaturizable\nspectrometers, exploiting the wide spectral tunability of plasmonic\nnanocomposites, and for selective gas sensors, utilizing dynamic light\nactivation. The benefits of colloidal approaches for device fabrication are\ndiscussed with regard to technological advantages and environmental aspects,\nwhich have been barely considered so far.\n","subjects":["Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}