{"id":"2408.03337","title":"PsyDI: Towards a Personalized and Progressively In-depth Chatbot for\n  Psychological Measurements","authors":"Xueyan Li, Xinyan Chen, Yazhe Niu, Shuai Hu, Yu Liu","authorsParsed":[["Li","Xueyan",""],["Chen","Xinyan",""],["Niu","Yazhe",""],["Hu","Shuai",""],["Liu","Yu",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 07:19:12 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 07:34:18 GMT"},{"version":"v3","created":"Thu, 15 Aug 2024 06:58:08 GMT"}],"updateDate":"2024-08-16","timestamp":1721632752000,"abstract":"  In the field of psychology, traditional assessment methods, such as\nstandardized scales, are frequently critiqued for their static nature, lack of\npersonalization, and reduced participant engagement, while comprehensive\ncounseling evaluations are often inaccessible. The complexity of quantifying\npsychological traits further limits these methods. Despite advances with large\nlanguage models (LLMs), many still depend on single-round Question-and-Answer\ninteractions. To bridge this gap, we introduce PsyDI, a personalized and\nprogressively in-depth chatbot designed for psychological measurements,\nexemplified by its application in the Myers-Briggs Type Indicator (MBTI)\nframework. PsyDI leverages user-related multi-modal information and engages in\ncustomized, multi-turn interactions to provide personalized, easily accessible\nmeasurements, while ensuring precise MBTI type determination. To address the\nchallenge of unquantifiable psychological traits, we introduce a novel training\nparadigm that involves learning the ranking of proxy variables associated with\nthese traits, culminating in a robust score model for MBTI measurements. The\nscore model enables PsyDI to conduct comprehensive and precise measurements\nthrough multi-turn interactions within a unified estimation context. Through\nvarious experiments, we validate the efficacy of both the score model and the\nPsyDI pipeline, demonstrating its potential to serve as a general framework for\npsychological measurements. Furthermore, the online deployment of PsyDI has\ngarnered substantial user engagement, with over 3,000 visits, resulting in the\ncollection of numerous multi-turn dialogues annotated with MBTI types, which\nfacilitates further research. The source code for the training and web service\ncomponents is publicly available as a part of OpenDILab at:\nhttps://github.com/opendilab/PsyDI\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}