{"id":"2408.10501","title":"Generative Diffusion Models for High Dimensional Channel Estimation","authors":"Xingyu Zhou, Le Liang, Jing Zhang, Peiwen Jiang, Yong Li, Shi Jin","authorsParsed":[["Zhou","Xingyu",""],["Liang","Le",""],["Zhang","Jing",""],["Jiang","Peiwen",""],["Li","Yong",""],["Jin","Shi",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 02:47:24 GMT"}],"updateDate":"2024-08-21","timestamp":1724122044000,"abstract":"  Along with the prosperity of generative artificial intelligence (AI), its\npotential for solving conventional challenges in wireless communications has\nalso surfaced. Inspired by this trend, we investigate the application of the\nadvanced diffusion models (DMs), a representative class of generative AI\nmodels, to high dimensional wireless channel estimation. By capturing the\nstructure of multiple-input multiple-output (MIMO) wireless channels via a deep\ngenerative prior encoded by DMs, we develop a novel posterior inference method\nfor channel reconstruction. We further adapt the proposed method to recover\nchannel information from low-resolution quantized measurements. Additionally,\nto enhance the over-the-air viability, we integrate the DM with the\nunsupervised Stein's unbiased risk estimator to enable learning from noisy\nobservations and circumvent the requirements for ground truth channel data that\nis hardly available in practice. Results reveal that the proposed estimator\nachieves high-fidelity channel recovery while reducing estimation latency by a\nfactor of 10 compared to state-of-the-art schemes, facilitating real-time\nimplementation. Moreover, our method outperforms existing estimators while\nreducing the pilot overhead by half, showcasing its scalability to\nultra-massive antenna arrays.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}