{"id":"2408.02975","title":"Single Molecule Spectral Fluctuation Originates from the Variation in\n  Dipole Orientation Connected to Accessible Vibrational Modes","authors":"Aranyak Sarkar, Vinu Namboodiri, Manoj Kumbhakar","authorsParsed":[["Sarkar","Aranyak",""],["Namboodiri","Vinu",""],["Kumbhakar","Manoj",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 06:15:31 GMT"}],"updateDate":"2024-08-07","timestamp":1722924931000,"abstract":"  Fluctuation in fluorescence emission of immobilized single molecule is\ntypically ascribed to the chromophore's intrinsic structural conformations and\nthe influence of local environmental factors. Despite extensive research over\nseveral decades since its initial observation, a direct connection between\nthese spectral fluctuations and the rearrangement of emission dipole\norientations has remained elusive. In this study, we elucidate this fundamental\nmolecular behavior and its underlying mechanisms by employing unique\nsingle-molecule multi-dimensional tracking to simultaneously monitor both the\nemission spectrum and the three-dimensional dipole orientation of individual\nfluorophore. For the first time, we present compelling evidence demonstrating a\ncorrelation between spectral fluctuations and dipolar rearrangements at room\ntemperature. Our observations reveal that variations in the radiative\nrelaxation probabilities among different vibronic emission bands, coupled with\nthe interaction of associated vibrational modes, drive these spectral\nfluctuations. We identify significant out-of-plane dipole reorientations during\npronounced spectral fluctuations - commonly known as spectral jumps - which\nprimarily arise from transitions between dominant vibrational modes.\nFurthermore, we emphasize the potential for con-structing vibrational spectra\nand optical nanoscopy with vibrational specificity, leveraging the vibronic\nemissions from single emitters.\n","subjects":["Physics/Chemical Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}