{"id":"2408.04018","title":"Case studies on pre-eruptive X-class flares using R-value in the lower\n  solar atmosphere","authors":"Shreeyesh Biswal, Marianna B. Kors\\'os, Manolis K. Georgoulis,\n  Alexander Nindos, Spiros Patsourakos, Robertus Erd\\'elyi","authorsParsed":[["Biswal","Shreeyesh",""],["Korsós","Marianna B.",""],["Georgoulis","Manolis K.",""],["Nindos","Alexander",""],["Patsourakos","Spiros",""],["Erdélyi","Robertus",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 18:05:10 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 12:39:00 GMT"}],"updateDate":"2024-08-13","timestamp":1723053910000,"abstract":"  The R-value is a measure of the strength of photospheric magnetic Polarity\nInversion Lines (PILs) in Active Regions (ARs). This work investigates the\npossibility of a relation between R-value variations and the occurrence of\nX-class flares in ARs, not in the solar photosphere, as usual, but above it in\nregions, closer to where flares occur. The modus operandi is to extrapolate the\nSolar Dynamic Observatory's (SDO) Helioseismic and Magnetic Imager (HMI)\nmagnetogram data up to a height of 3.24 Mm above the photosphere and then\ncompute the R-value based on the extrapolated magnetic field. Recent studies\nhave shown that certain flare-predictive parameters such as the horizontal\ngradient of the vertical magnetic field and magnetic helicity may improve flare\nprediction lead times significantly if studied at a specific height range above\nthe photosphere, called the Optimal Height Range (OHR). Here we define the OHR\nas a collection of heights where a sudden but sustained increase in R-value is\nfound. For the eight case studies discussed in this paper, our results indicate\nthat it is possible for OHRs to exist in the low solar atmosphere (between 0.36\n- 3.24 Mm), where R-value spikes occur 48-68 hrs before the first X-class flare\nof an emerging AR. The temporal evolution of R-value before the first X-class\nflare for an emerging AR is also found to be distinct from that of non-flaring\nARs. For X-class flares associated with non-emerging ARs, an OHR could not be\nfound.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Space Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}