{"id":"2408.01834","title":"The Quark-Nova model for FRBs: model comparison with observational data","authors":"Rachid Ouyed, Denis Leahy, Nico Koning (Department of Physics and\n  Astronomy, University of Calgary, Canada)","authorsParsed":[["Ouyed","Rachid","","Department of Physics and\n  Astronomy, University of Calgary, Canada"],["Leahy","Denis","","Department of Physics and\n  Astronomy, University of Calgary, Canada"],["Koning","Nico","","Department of Physics and\n  Astronomy, University of Calgary, Canada"]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 17:59:41 GMT"}],"updateDate":"2024-08-06","timestamp":1722707981000,"abstract":"  We utilize the Quark-Nova (QN) model for Fast Radio Bursts (FRBs; Ouyed et\nal. 2021) to evaluate its performance in reproducing the distribution and\nstatistical properties of key observations. These include frequency, duration,\nfluence, dispersion measure (DM), and other relevant features such as\nrepetition, periodicity, and the sad trombone effect. In our model, FRBs are\nattributed to coherent synchrotron emission (CSE) originating from\ncollisionless QN chunks that traverse ionized media both within and outside\ntheir host galaxies. By considering burst repetition from a single chunk and\naccounting for the intrinsic DM of the chunks, we discover a significant\nagreement between our model and the observed properties of FRBs. This agreement\nenhances our confidence in the model's effectiveness for interpreting FRB\nobservations. One notable characteristic of our model is that QN chunks can\nundergo bursts after traveling significant distances from their host galaxies.\nAs a result, these bursts appear to observers as hostless thus lacking a\ndiscernible progenitor. This unique aspect of our model provides valuable\ninsights into the nature of FRBs. Furthermore, our model generates testable\npredictions, allowing for future experiments and observations to validate and\nfurther refine our understanding of FRBs.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}