{"id":"2408.10249","title":"Unique multistable states in periodic structures with saturable\n  nonlinearity","authors":"S. Vignesh Raja, A. Govindarajan, M. Lakshmanan","authorsParsed":[["Raja","S. Vignesh",""],["Govindarajan","A.",""],["Lakshmanan","M.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 17:35:56 GMT"}],"updateDate":"2024-08-21","timestamp":1722879356000,"abstract":"  We report that conventional saturable periodic structures, in sharp contrast\nto the conventional systems with different nonlinearities which exhibit the\ntypical S- shaped optical bi- and multi-stable states, reveal some unusual and\nunique nonlinear dynamics. These include the onset of ramp-like optical\nbistability (OB) and optical multistability (OM) curves which further transit\ninto mixed OM states combining both ramp-like states followed by the S-shaped\nmultistable curves. We also extend this study to another domain of physics,\nnamely parity-time ($\\mathcal{PT}$)- symmetry, by including equal amount of\ngain and loss into the system which then establishes additional degree of\nfreedom by enabling the investigation into additional two domains which are the\nunbroken and broken $\\mathcal{PT}$- symmetric regimes. Although these bi- and\nmulti-stable states are unusual and unique, when the frequency detuning is\nintroduced, the revival of S-shaped stable states is possible but only in the\npresence of unbroken $\\mathcal{PT}$- symmetry. Conversely, the broken\n$\\mathcal{PT}$- symmetry which usually generates ramp-like multistable states,\ngives rise to the birth of novel multistable states with a vortex like\nenvelope, (the curve that features simultaneous increase in the critical\nswitch-up and switch-down powers with an increase in the input power) causing a\nnovel structure which has not been reported in the existing literature of\ndifferent physical systems manifesting multi-stable states.\n","subjects":["Physics/Optics","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Nonlinear Sciences/Pattern Formation and Solitons"],"license":"http://creativecommons.org/licenses/by/4.0/"}