{"id":"2408.02863","title":"Enhanced Superconducting Qubit Performance Through Ammonium Fluoride\n  Etch","authors":"Cameron J. Kopas, Dominic P. Goronzy, Thang Pham, Carlos G. Torres\n  Castanedo, Matthew Cheng, Rory Cochrane, Patrick Nast, Ella Lachman, Nikolay\n  Z. Zhelev, Andre Vallieres, Akshay A. Murthy, Jin-su Oh, Lin Zhou, Matthew J.\n  Kramer, Hilal Cansizoglu, Michael J. Bedzyk, Vinayak P. Dravid, Alexander\n  Romanenko, Anna Grassellino, Josh Y. Mutus, Mark C. Hersam, Kameshwar\n  Yadavalli","authorsParsed":[["Kopas","Cameron J.",""],["Goronzy","Dominic P.",""],["Pham","Thang",""],["Castanedo","Carlos G. Torres",""],["Cheng","Matthew",""],["Cochrane","Rory",""],["Nast","Patrick",""],["Lachman","Ella",""],["Zhelev","Nikolay Z.",""],["Vallieres","Andre",""],["Murthy","Akshay A.",""],["Oh","Jin-su",""],["Zhou","Lin",""],["Kramer","Matthew J.",""],["Cansizoglu","Hilal",""],["Bedzyk","Michael J.",""],["Dravid","Vinayak P.",""],["Romanenko","Alexander",""],["Grassellino","Anna",""],["Mutus","Josh Y.",""],["Hersam","Mark C.",""],["Yadavalli","Kameshwar",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 23:25:46 GMT"}],"updateDate":"2024-08-07","timestamp":1722900346000,"abstract":"  The performance of superconducting qubits is often limited by dissipation and\ntwo-level systems (TLS) losses. The dominant sources of these losses are\nbelieved to originate from amorphous materials and defects at interfaces and\nsurfaces, likely as a result of fabrication processes or ambient exposure.\nHere, we explore a novel wet chemical surface treatment at the Josephson\njunction-substrate and the substrate-air interfaces by replacing a buffered\noxide etch (BOE) cleaning process with one that uses hydrofluoric acid followed\nby aqueous ammonium fluoride. We show that the ammonium fluoride etch process\nresults in a statistically significant improvement in median $\\text{T}_1$ by\n$\\sim22\\%$ ($p=0.002$), and a reduction in the number of strongly-coupled TLS\nin the tunable frequency range. Microwave resonator measurements on samples\ntreated with the ammonium fluoride etch prior to niobium deposition also show\n$\\sim33\\%$ lower TLS-induced loss tangent compared to the BOE treated samples.\nAs the chemical treatment primarily modifies the Josephson junction-substrate\ninterface and substrate-air interface, we perform targeted chemical and\nstructural characterizations to examine materials' differences at these\ninterfaces and identify multiple microscopic changes that could contribute to\ndecreased TLS.\n","subjects":["Condensed Matter/Materials Science","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}