{"id":"2408.09065","title":"Linking Robustness and Generalization: A k* Distribution Analysis of\n  Concept Clustering in Latent Space for Vision Models","authors":"Shashank Kotyan, Pin-Yu Chen, Danilo Vasconcellos Vargas","authorsParsed":[["Kotyan","Shashank",""],["Chen","Pin-Yu",""],["Vargas","Danilo Vasconcellos",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 01:43:51 GMT"}],"updateDate":"2024-08-20","timestamp":1723859031000,"abstract":"  Most evaluations of vision models use indirect methods to assess latent space\nquality. These methods often involve adding extra layers to project the latent\nspace into a new one. This projection makes it difficult to analyze and compare\nthe original latent space. This article uses the k* Distribution, a local\nneighborhood analysis method, to examine the learned latent space at the level\nof individual concepts, which can be extended to examine the entire latent\nspace. We introduce skewness-based true and approximate metrics for\ninterpreting individual concepts to assess the overall quality of vision\nmodels' latent space. Our findings indicate that current vision models\nfrequently fracture the distributions of individual concepts within the latent\nspace. Nevertheless, as these models improve in generalization across multiple\ndatasets, the degree of fracturing diminishes. A similar trend is observed in\nrobust vision models, where increased robustness correlates with reduced\nfracturing. Ultimately, this approach enables a direct interpretation and\ncomparison of the latent spaces of different vision models and reveals a\nrelationship between a model's generalizability and robustness. Results show\nthat as a model becomes more general and robust, it tends to learn features\nthat result in better clustering of concepts. Project Website is available\nonline at https://shashankkotyan.github.io/k-Distribution/\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}