{"id":"2408.17235","title":"AI-Driven Intrusion Detection Systems (IDS) on the ROAD Dataset: A\n  Comparative Analysis for Automotive Controller Area Network (CAN)","authors":"Lorenzo Guerra, Linhan Xu, Paolo Bellavista, Thomas Chapuis, Guillaume\n  Duc, Pavlo Mozharovskyi, Van-Tam Nguyen","authorsParsed":[["Guerra","Lorenzo",""],["Xu","Linhan",""],["Bellavista","Paolo",""],["Chapuis","Thomas",""],["Duc","Guillaume",""],["Mozharovskyi","Pavlo",""],["Nguyen","Van-Tam",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 12:26:23 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 13:59:21 GMT"}],"updateDate":"2024-09-06","timestamp":1725020783000,"abstract":"  The integration of digital devices in modern vehicles has revolutionized\nautomotive technology, enhancing safety and the overall driving experience. The\nController Area Network (CAN) bus is a central system for managing in-vehicle\ncommunication between the electronic control units (ECUs). However, the CAN\nprotocol poses security challenges due to inherent vulnerabilities, lacking\nencryption and authentication, which, combined with an expanding attack\nsurface, necessitates robust security measures. In response to this challenge,\nnumerous Intrusion Detection Systems (IDS) have been developed and deployed.\nNonetheless, an open, comprehensive, and realistic dataset to test the\neffectiveness of such IDSs remains absent in the existing literature. This\npaper addresses this gap by considering the latest ROAD dataset, containing\nstealthy and sophisticated injections. The methodology involves dataset\nlabelling and the implementation of both state-of-the-art deep learning models\nand traditional machine learning models to show the discrepancy in performance\nbetween the datasets most commonly used in the literature and the ROAD dataset,\na more realistic alternative.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}