{"id":"2408.01858","title":"Increase in the Brightness of the Cosmic Radio Background toward Galaxy\n  Clusters","authors":"S. A. Grebenev (1) and R. A. Sunyaev (1,2) ((1) Space Research\n  Institute, Moscow, (2) Max-Planck-Institut fuer Astrophysik, Garching)","authorsParsed":[["Grebenev","S. A.",""],["Sunyaev","R. A.",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 20:02:31 GMT"}],"updateDate":"2024-08-06","timestamp":1722715351000,"abstract":"  We explore the possibility of detecting the excess of the cosmic radio\nbackground (CRB) toward galaxy clusters due to its Compton scattering by\nelectrons of the hot intergalactic gas. When mapping the background\nfluctuations at frequencies < 800 MHz, this effect gives rise to a radio source\nat the cluster location. At higher frequencies, where the microwave (CMB or\nrelic) radiation dominates in the background, a 'negative' source is observed\nat this location due to the transfer of some of the relic photons upward along\nthe frequency axis (into the range > 217 GHz) upon their scattering. We have\ncomputed the spectra of the expected CRB distortions for various clusters and\nshow that in many cases in the range 30 MHz - 3 GHz their measurement will be\nhindered by the thermal bremsstrahlung from the intergalactic gas and the\nscattered radio emission from cluster galaxies associated with their past\nactivity (and the synchrotron radiation from relativistic electrons). Below 20\nMHz the scattering effect always dominates over the thermal gas radiation due\nto the general increase in the CRB intensity. We have found the frequency\nranges that are optimal for searching for the Compton CRB excess and show that\nhot (kTe > 8 keV) clusters at high (z > 0.5) redshifts are most promising for\nits observation. Because of the strong concentration of the bremsstrahlung to\nthe cluster center, the peripheral observations of this excess must be more\npreferable than the central ones. The transition from the 'negative' source on\nthe map of background fluctuations to the 'positive' one must occur not\ngradually but through the stage of a 'hybrid source' (a bright spot surrounded\nby a dark ring). This shape of the source in projection is explained by its\nunusual three-dimensional shape (a narrow bremsstrahlung peak rising from the\ncenter of a wide deep hole associated with the Compton scattering of the CMB).\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}