{"id":"2408.15974","title":"Stability and localization of nanoscale skyrmions and bimerons in an\n  all-magnetic van der Waals heterostructure","authors":"Dongzhe Li, Moritz A. Goerzen, Soumyajyoti Haldar, Tim Drevelow,\n  Hendrik Schrautzer, Stefan Heinze","authorsParsed":[["Li","Dongzhe",""],["Goerzen","Moritz A.",""],["Haldar","Soumyajyoti",""],["Drevelow","Tim",""],["Schrautzer","Hendrik",""],["Heinze","Stefan",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 17:46:59 GMT"}],"updateDate":"2024-08-29","timestamp":1724867219000,"abstract":"  Magnetic solitons such as skyrmions and bimerons show great promise for both\nfundamental research and spintronic applications. Stabilizing and controlling\ntopological spin textures in atomically thin van der Waals (vdW) materials has\ngained tremendous attention due to high tunability, enhanced functionality, and\nminiaturization. Using rigorous first-principles calculations and atomistic\nspin simulations, we predict the existence of multiple magnetic solitons in an\nall-magnetic vdW heterostructure Fe$_3$GeTe$_2$/Cr$_2$Ge$_2$Te$_6$ (FGT/CGT).\nN\\'eel-type skyrmions are formed at both sides of FGT/CGT with opposite\nchirality. Skyrmions at the FGT layer and bimerons at the CGT layer persist in\nthe heterostructure at zero field, while the latter undergoes bimeron-skyrmion\ntransformation if a field is applied. We further demonstrate that, although\nskyrmions and bimerons are topologically equivalent, they exhibit very\ndifferent localization behavior. Skyrmions are isotropically localized, while\nbimerons exhibit anisotropic nonlocality, leading to finite-size effects. We\nanalyze how this affects the stability of bimerons in confined materials. Our\nwork represents an important step forward in the fundamental properties of\ntopological spin textures and paves the way toward skyrmionic devices based on\natomically thin vdW heterostructures.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"lxPpJorrC4QS0z5jtoqU-OB6UaI3SA5DIBR7k1F_c_c","pdfSize":"15190864"}
