{"id":"2408.12413","title":"Dynamic PDB: A New Dataset and a SE(3) Model Extension by Integrating\n  Dynamic Behaviors and Physical Properties in Protein Structures","authors":"Ce Liu, Jun Wang, Zhiqiang Cai, Yingxu Wang, Huizhen Kuang, Kaihui\n  Cheng, Liwei Zhang, Qingkun Su, Yining Tang, Fenglei Cao, Limei Han, Siyu\n  Zhu, Yuan Qi","authorsParsed":[["Liu","Ce",""],["Wang","Jun",""],["Cai","Zhiqiang",""],["Wang","Yingxu",""],["Kuang","Huizhen",""],["Cheng","Kaihui",""],["Zhang","Liwei",""],["Su","Qingkun",""],["Tang","Yining",""],["Cao","Fenglei",""],["Han","Limei",""],["Zhu","Siyu",""],["Qi","Yuan",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 14:06:01 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 09:08:49 GMT"},{"version":"v3","created":"Wed, 18 Sep 2024 10:53:11 GMT"}],"updateDate":"2024-09-19","timestamp":1724335561000,"abstract":"  Despite significant progress in static protein structure collection and\nprediction, the dynamic behavior of proteins, one of their most vital\ncharacteristics, has been largely overlooked in prior research. This oversight\ncan be attributed to the limited availability, diversity, and heterogeneity of\ndynamic protein datasets. To address this gap, we propose to enhance existing\nprestigious static 3D protein structural databases, such as the Protein Data\nBank (PDB), by integrating dynamic data and additional physical properties.\nSpecifically, we introduce a large-scale dataset, Dynamic PDB, encompassing\napproximately 12.6K proteins, each subjected to all-atom molecular dynamics\n(MD) simulations lasting 1 microsecond to capture conformational changes.\nFurthermore, we provide a comprehensive suite of physical properties, including\natomic velocities and forces, potential and kinetic energies of proteins, and\nthe temperature of the simulation environment, recorded at 1 picosecond\nintervals throughout the simulations. For benchmarking purposes, we evaluate\nstate-of-the-art methods on the proposed dataset for the task of trajectory\nprediction. To demonstrate the value of integrating richer physical properties\nin the study of protein dynamics and related model design, we base our approach\non the SE(3) diffusion model and incorporate these physical properties into the\ntrajectory prediction process. Preliminary results indicate that this\nstraightforward extension of the SE(3) model yields improved accuracy, as\nmeasured by MAE and RMSD, when the proposed physical properties are taken into\nconsideration. https://fudan-generative-vision.github.io/dynamicPDB/ .\n","subjects":["Quantitative Biology/Biomolecules","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}