{"id":"2408.03911","title":"Prospects for using drones to test formation-flying CubeSat concepts,\n  and other astronomical applications","authors":"John D. Monnier, Prachet Jain, Mayra Gutierrez, Chi Han, Sara Hezi,\n  Shashank Kalluri, Hirsh Kabaria, Brennan Kompas, Vaishnavi Harikumar, Julian\n  Skifstad, Janani Peri, Emmanuel Hernandez, Ramya Bhaskarapanthula, and James\n  Cutler (University of Michigan)","authorsParsed":[["Monnier","John D.","","University of Michigan"],["Jain","Prachet","","University of Michigan"],["Gutierrez","Mayra","","University of Michigan"],["Han","Chi","","University of Michigan"],["Hezi","Sara","","University of Michigan"],["Kalluri","Shashank","","University of Michigan"],["Kabaria","Hirsh","","University of Michigan"],["Kompas","Brennan","","University of Michigan"],["Harikumar","Vaishnavi","","University of Michigan"],["Skifstad","Julian","","University of Michigan"],["Peri","Janani","","University of Michigan"],["Hernandez","Emmanuel","","University of Michigan"],["Bhaskarapanthula","Ramya","","University of Michigan"],["Cutler","James","","University of Michigan"]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 17:14:08 GMT"}],"updateDate":"2024-08-08","timestamp":1723050848000,"abstract":"  Drones provide a versatile platform for remote sensing and atmospheric\nstudies. However, strict payload mass limits and intense vibrations have proven\nobstacles to adoption for astronomy. We present a concept for system-level\ntesting of a long-baseline CubeSat space interferometer using drones, taking\nadvantage of their cm-level xyz station-keeping, 6-dof freedom of movement,\nlarge operational environment, access to guide stars for end-to-end testing of\noptical train and control algorithms, and comparable mass and power\nrequirements. We have purchased two different drone platforms (Aurelia X6 Pro,\nFreefly Alta X) and present characterization studies of vibrations, flight\nstability, gps positioning precision, and more. We also describe our progress\nin sub-system development, including inter-drone laser metrology, realtime\ngimbal control, and LED beacon tracking. Lastly, we explore whether\ncustom-built drone-borne telescopes could be used for interferometry of bright\nobjects over km-level baselines using vibration-isolation platforms and a small\nfast delay for fringe-tracking.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}