{"id":"2408.08242","title":"A Conflicts-free, Speed-lossless KAN-based Reinforcement Learning\n  Decision System for Interactive Driving in Roundabouts","authors":"Zhihao Lin, Zhen Tian, Qi Zhang, Ziyang Ye, Hanyang Zhuang, and\n  Jianglin Lan","authorsParsed":[["Lin","Zhihao",""],["Tian","Zhen",""],["Zhang","Qi",""],["Ye","Ziyang",""],["Zhuang","Hanyang",""],["Lan","Jianglin",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 16:10:25 GMT"}],"updateDate":"2024-08-16","timestamp":1723738225000,"abstract":"  Safety and efficiency are crucial for autonomous driving in roundabouts,\nespecially in the context of mixed traffic where autonomous vehicles (AVs) and\nhuman-driven vehicles coexist. This paper introduces a learning-based algorithm\ntailored to foster safe and efficient driving behaviors across varying levels\nof traffic flows in roundabouts. The proposed algorithm employs a deep\nQ-learning network to effectively learn safe and efficient driving strategies\nin complex multi-vehicle roundabouts. Additionally, a KAN (Kolmogorov-Arnold\nnetwork) enhances the AVs' ability to learn their surroundings robustly and\nprecisely. An action inspector is integrated to replace dangerous actions to\navoid collisions when the AV interacts with the environment, and a route\nplanner is proposed to enhance the driving efficiency and safety of the AVs.\nMoreover, a model predictive control is adopted to ensure stability and\nprecision of the driving actions. The results show that our proposed system\nconsistently achieves safe and efficient driving whilst maintaining a stable\ntraining process, as evidenced by the smooth convergence of the reward function\nand the low variance in the training curves across various traffic flows.\nCompared to state-of-the-art benchmarks, the proposed algorithm achieves a\nlower number of collisions and reduced travel time to destination.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"rsYrYI-9EqCfmBS6YSOhbk4nmNQk5H68w6O9HjtyotA","pdfSize":"4648621"}
