{"id":"2408.03647","title":"Real-time Event Recognition of Long-distance Distributed Vibration\n  Sensing with Knowledge Distillation and Hardware Acceleration","authors":"Zhongyao Luo, Hao Wu, Zhao Ge, and Ming Tang","authorsParsed":[["Luo","Zhongyao",""],["Wu","Hao",""],["Ge","Zhao",""],["Tang","Ming",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 09:15:47 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 17:10:27 GMT"}],"updateDate":"2024-08-23","timestamp":1723022147000,"abstract":"  Fiber-optic sensing, especially distributed optical fiber vibration (DVS)\nsensing, is gaining importance in internet of things (IoT) applications, such\nas industrial safety monitoring and intrusion detection. Despite their wide\napplication, existing post-processing methods that rely on deep learning models\nfor event recognition in DVS systems face challenges with real-time processing\nof large sample data volumes, particularly in long-distance applications. To\naddress this issue, we propose to use a four-layer convolutional neural network\n(CNN) with ResNet as the teacher model for knowledge distillation. This results\nin a significant improvement in accuracy, from 83.41% to 95.39%, on data from\npreviously untrained environments. Additionally, we propose a novel hardware\ndesign based on field-programmable gate arrays (FPGA) to further accelerate\nmodel inference. This design replaces multiplication with binary shift\noperations and quantizes model weights, enabling high parallelism and low\nlatency. Our implementation achieves an inference time of 0.083 ms for a\nspatial-temporal sample covering a 12.5 m fiber length and 0.256 s time frame.\nThis performance enables real-time signal processing over approximately 38.55\nkm of fiber, about $2.14\\times$ the capability of an Nvidia GTX 4090 GPU. The\nproposed method greatly enhances the efficiency of vibration pattern\nrecognition, promoting the use of DVS as a smart IoT system. The data and code\nare available at https://github.com/HUST-IOF/Efficient-DVS.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}