{"id":"2408.09427","title":"The temporal conceptual data modelling language TREND","authors":"Sonia Berman, C. Maria Keet, Tamindran Shunmugam","authorsParsed":[["Berman","Sonia",""],["Keet","C. Maria",""],["Shunmugam","Tamindran",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 10:01:44 GMT"}],"updateDate":"2024-08-20","timestamp":1723975304000,"abstract":"  Temporal conceptual data modelling, as an extension to regular conceptual\ndata modelling languages such as EER and UML class diagrams, has received\nintermittent attention across the decades. It is receiving renewed interest in\nthe context of, among others, business process modelling that needs robust\nexpressive data models to complement them. None of the proposed temporal\nconceptual data modelling languages have been tested on understandability and\nusability by modellers, however, nor is it clear which temporal constraints\nwould be used by modellers or whether the ones included are the relevant\ntemporal constraints. We therefore sought to investigate temporal\nrepresentations in temporal conceptual data modelling languages, design a, to\ndate, most expressive language, TREND, through small-scale qualitative\nexperiments, and finalise the graphical notation and modelling and\nunderstanding in large scale experiments. This involved a series of 11\nexperiments with over a thousand participants in total, having created 246\ntemporal conceptual data models. Key outcomes are that choice of label for\ntransition constraints had limited impact, as did extending explanations of the\nmodelling language, but expressing what needs to be modelled in controlled\nnatural language did improve model quality. The experiments also indicate that\nmore training may be needed, in particular guidance for domain experts, to\nachieve adoption of temporal conceptual data modelling by the community.\n","subjects":["Computing Research Repository/Databases"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}