{"id":"2408.08790","title":"A Disease-Specific Foundation Model Using Over 100K Fundus Images:\n  Release and Validation for Abnormality and Multi-Disease Classification on\n  Downstream Tasks","authors":"Boa Jang, Youngbin Ahn, Eun Kyung Choe, Chang Ki Yoon, Hyuk Jin Choi,\n  and Young-Gon Kim","authorsParsed":[["Jang","Boa",""],["Ahn","Youngbin",""],["Choe","Eun Kyung",""],["Yoon","Chang Ki",""],["Choi","Hyuk Jin",""],["Kim","Young-Gon",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 15:03:06 GMT"}],"updateDate":"2024-08-19","timestamp":1723820586000,"abstract":"  Artificial intelligence applied to retinal images offers significant\npotential for recognizing signs and symptoms of retinal conditions and\nexpediting the diagnosis of eye diseases and systemic disorders. However,\ndeveloping generalized artificial intelligence models for medical data often\nrequires a large number of labeled images representing various disease signs,\nand most models are typically task-specific, focusing on major retinal\ndiseases. In this study, we developed a Fundus-Specific Pretrained Model\n(Image+Fundus), a supervised artificial intelligence model trained to detect\nabnormalities in fundus images. A total of 57,803 images were used to develop\nthis pretrained model, which achieved superior performance across various\ndownstream tasks, indicating that our proposed model outperforms other general\nmethods. Our Image+Fundus model offers a generalized approach to improve model\nperformance while reducing the number of labeled datasets required.\nAdditionally, it provides more disease-specific insights into fundus images,\nwith visualizations generated by our model. These disease-specific foundation\nmodels are invaluable in enhancing the performance and efficiency of deep\nlearning models in the field of fundus imaging.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}