{"id":"2408.02234","title":"Study of Turbulence and Pressure Recovery in the Heat Pipe Vapor Flow\n  Using the Spectral-Element Method","authors":"Carolina Bourdot Dutra, Tri Nguyen, Elia Merzari, Joshua E. Hansel","authorsParsed":[["Dutra","Carolina Bourdot",""],["Nguyen","Tri",""],["Merzari","Elia",""],["Hansel","Joshua E.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 04:54:40 GMT"}],"updateDate":"2024-08-06","timestamp":1722833680000,"abstract":"  Heat pipes can efficiently and passively remove heat in nuclear\nmicroreactors. Nevertheless, the flow dynamics within heat pipes present a\nsignificant challenge in designing and optimizing them for nuclear energy\napplications. This work aims to explore the vapor core of heat pipes through\ncomprehensive two- and three-dimensional simulations, with a primary focus on\nmodeling the pressure recovery observed in the condenser section. The goal is\nto establish improved correlations for one-dimensional heat pipe codes. The\nsimulations are validated against experimental data from a vapor pipe\ndocumented in the literature. The turbulence model is employed in the\ntwo-dimensional simulations through the open-source spectral-element code\nNek5000. This model provides insights into pressure recovery within heat pipes\nwith low computational cost. In addition, Large Eddy Simulations (LES) are used\nto capture turbulent flow features in a three-dimensional vapor pipe model,\nutilizing the code NekRS. Using LES is crucial for comprehending the impact of\nlaminar-to-turbulent transition on pressure recovery. A simulation framework is\ncreated to model the heat pipe's vapor core, laying the foundation for an\nenhanced understanding of heat pipe behavior. The ultimate goal is to improve\nand optimize heat pipe designs, provide data to validate lower-fidelity\napproaches and enhance their performance in nuclear reactors.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bJ3OQ9AAiQEscaHunbIvOEajA3jPr-EE19hFPI9ZA-c","pdfSize":"6434640"}
