{"id":"2408.09954","title":"Experiment-based Models for Air Time and Current Consumption of LoRaWAN\n  LR-FHSS","authors":"Muhammad Asad Ullah, Konstantin Mikhaylov, Hirley Alves","authorsParsed":[["Ullah","Muhammad Asad",""],["Mikhaylov","Konstantin",""],["Alves","Hirley",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 12:53:51 GMT"}],"updateDate":"2024-08-20","timestamp":1724072031000,"abstract":"  Long Range - Frequency Hopping Spread Spectrum (LR-FHSS) is an emerging and\npromising technology recently introduced into the LoRaWAN protocol\nspecification for both terrestrial and non-terrestrial networks, notably\nsatellites. The higher capacity, long-range and robustness to Doppler effect\nmake LR-FHSS a primary candidate for direct-to-satellite (DtS) connectivity for\nenabling Internet-of-things (IoT) in remote areas. The LR-FHSS devices\nenvisioned for DtS IoT will be primarily battery-powered. Therefore, it is\ncrucial to investigate the current consumption characteristics and Time-on-Air\n(ToA) of LR-FHSS technology. However, to our knowledge, no prior research has\npresented the accurate ToA and current consumption models for this newly\nintroduced scheme. This paper addresses this shortcoming through extensive\nfield measurements and the development of analytical models. Specifically, we\nhave measured the current consumption and ToA for variable transmit power,\nmessage payload, and two new LR-FHSS-based Data Rates (DR8 and DR9). We also\ndevelop current consumption and ToA analytical models demonstrating a strong\ncorrelation with the measurement results exhibiting a relative error of less\nthan 0.3%. Thus, it confirms the validity of our models. Conversely, the\nexisting analytical models exhibit a higher relative error rate of -9.2 to 3.4%\ncompared to our measurement results. The presented in this paper results can be\nfurther used for simulators or in analytical studies to accurately model the\non-air time and energy consumption of LR-FHSS devices.\n","subjects":["Computing Research Repository/Emerging Technologies","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}