{"id":"2408.14149","title":"Spectro-photometry of Phobos simulants: II. Effects of porosity","authors":"Antonin Wargnier, Olivier Poch, Giovanni Poggiali, Thomas Gautier,\n  Alain Doressoundiram, Pierre Beck, Tomoki Nakamura, Hideaki Miyamoto, Shingo\n  Kameda, Nathalie Ruscassier, Arnaud Buch, Pedro H. Hasselmann, Robin Sultana,\n  Eric Quirico, Sonia Fornasier, Antonella Barucci","authorsParsed":[["Wargnier","Antonin",""],["Poch","Olivier",""],["Poggiali","Giovanni",""],["Gautier","Thomas",""],["Doressoundiram","Alain",""],["Beck","Pierre",""],["Nakamura","Tomoki",""],["Miyamoto","Hideaki",""],["Kameda","Shingo",""],["Ruscassier","Nathalie",""],["Buch","Arnaud",""],["Hasselmann","Pedro H.",""],["Sultana","Robin",""],["Quirico","Eric",""],["Fornasier","Sonia",""],["Barucci","Antonella",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 09:49:54 GMT"}],"updateDate":"2024-08-27","timestamp":1724665794000,"abstract":"  Surface porosity has been found to be an important property for small bodies.\nSome asteroids and comets can exhibit an extremely high surface porosity in the\nfirst millimeter layer. This layer may be produced by various processes and\nmaintained by the lack of an atmosphere. However, the influence of porosity on\nthe spectro-photometric properties of small body surfaces is not yet fully\nunderstood. In this study, we looked into the effect of porosity on the\nspectro-photometric properties of Phobos regolith spectroscopic simulants;\ncreated by mixing the simulants with ultra-pure water, producing ice-dust\nparticles, and then sublimating the water. The reflectance spectroscopic\nproperties in the visible and near-infrared (0.5-4.2 $\\mu$m) show no strong\nvariations between the porous and compact samples. However, one simulant\nexhibits a bluing of the slope after increasing porosity, providing possible\ninsights into the differences between the blue and red units observed on\nPhobos. In the mid-infrared range, a contrast increase of the 10-$\\mu$m\nemissivity plateau due to silicates is observed. Photometry reveals a\nmodification in the phase reddening behavior between the compact powder and the\nsublimation residue for both simulants. However, the observed behavior is\ndifferent between the simulants, suggesting that the phase reddening may be\ndependent on the composition of the simulants. The phase curve also appears to\nbe modified by the addition of porosity, with a higher contribution of forward\nscattering observed for the sublimation residue. The derivation of the Hapke\nparameters indicates an increase in roughness for the porous sample, but no\nsignificant modification of the opposition effect. This study aims to provide\nnew insights into the understanding of porosity by using two Phobos simulants\nin the context of the upcoming JAXA/Martian Moons eXploration mission.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}