{"id":"2408.00795","title":"Searches for ultra-high energy gamma-ray at the Pierre Auger Observatory\n  and implications on super-heavy dark matter","authors":"Olivier Deligny (for the Pierre Auger Collaboration)","authorsParsed":[["Deligny","Olivier","","for the Pierre Auger Collaboration"]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 09:16:57 GMT"}],"updateDate":"2024-08-05","timestamp":1721294217000,"abstract":"  The first interactions of photon-induced showers are of electromagnetic\nnature, and the transfer of energy to the hadron/muon channel is reduced with\nrespect to the bulk of hadron-induced showers. This results in a lower number\nof secondary muons. Additionally, as the development of photon showers is\ndelayed by the typically small multiplicity of electromagnetic interactions,\ntheir maximum of shower development is deeper in the atmosphere than for\nshowers initiated by hadrons. These salient features have enabled searches for\nphoton showers at the Pierre Auger Observatory. They have led to stringent\nupper limits on ultra-high-energy gamma-ray fluxes over four orders in\nmagnitude in energy. These limits are not only of considerable astrophysical\ninterest, but they also allow us to constrain beyond-standard-physics\nscenarios. For instance, dark matter particles could be superheavy, provided\ntheir lifetime is much longer than the age of the universe. Constraints on\nspecific extensions of the Standard Model of particle physics that meet the\nlifetime requirement for a superheavy particle will be presented. They include\nlimits on instanton strength as well as on mixing angle between active and\nsterile neutrinos.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"HGjaaH4Llae9HiZEvytd3SaXeDvqOYB2PyPy-MWoHHA","pdfSize":"1056421","txDigest":"GeTeR8NDMHQKq2Sh8XmRevSbHeJgpwAJTnQiCrVPq2sn","endEpoch":"1","status":"CERTIFIED"}
