{"id":"2408.14700","title":"Artificial Intelligence in Landscape Architecture: A Survey","authors":"Yue Xing, Wensheng Gan, Qidi Chen","authorsParsed":[["Xing","Yue",""],["Gan","Wensheng",""],["Chen","Qidi",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 23:54:17 GMT"}],"updateDate":"2024-08-28","timestamp":1724716457000,"abstract":"  The development history of landscape architecture (LA) reflects the human\npursuit of environmental beautification and ecological balance. With the\nadvancement of artificial intelligence (AI) technologies that simulate and\nextend human intelligence, immense opportunities have been provided for LA,\noffering scientific and technological support throughout the entire workflow.\nIn this article, we comprehensively review the applications of AI technology in\nthe field of LA. First, we introduce the many potential benefits that AI brings\nto the design, planning, and management aspects of LA. Secondly, we discuss how\nAI can assist the LA field in solving its current development problems,\nincluding urbanization, environmental degradation and ecological decline,\nirrational planning, insufficient management and maintenance, and lack of\npublic participation. Furthermore, we summarize the key technologies and\npractical cases of applying AI in the LA domain, from design assistance to\nintelligent management, all of which provide innovative solutions for the\nplanning, design, and maintenance of LA. Finally, we look ahead to the problems\nand opportunities in LA, emphasizing the need to combine human expertise and\njudgment for rational decision-making. This article provides both theoretical\nand practical guidance for LA designers, researchers, and technology\ndevelopers. The successful integration of AI technology into LA holds great\npromise for enhancing the field's capabilities and achieving more sustainable,\nefficient, and user-friendly outcomes.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}