{"id":"2408.11202","title":"Effective Off-Policy Evaluation and Learning in Contextual Combinatorial\n  Bandits","authors":"Tatsuhiro Shimizu, Koichi Tanaka, Ren Kishimoto, Haruka Kiyohara,\n  Masahiro Nomura, Yuta Saito","authorsParsed":[["Shimizu","Tatsuhiro",""],["Tanaka","Koichi",""],["Kishimoto","Ren",""],["Kiyohara","Haruka",""],["Nomura","Masahiro",""],["Saito","Yuta",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 21:25:04 GMT"}],"updateDate":"2024-08-22","timestamp":1724189104000,"abstract":"  We explore off-policy evaluation and learning (OPE/L) in contextual\ncombinatorial bandits (CCB), where a policy selects a subset in the action\nspace. For example, it might choose a set of furniture pieces (a bed and a\ndrawer) from available items (bed, drawer, chair, etc.) for interior design\nsales. This setting is widespread in fields such as recommender systems and\nhealthcare, yet OPE/L of CCB remains unexplored in the relevant literature.\nTypical OPE/L methods such as regression and importance sampling can be applied\nto the CCB problem, however, they face significant challenges due to high bias\nor variance, exacerbated by the exponential growth in the number of available\nsubsets. To address these challenges, we introduce a concept of factored action\nspace, which allows us to decompose each subset into binary indicators. This\nformulation allows us to distinguish between the ''main effect'' derived from\nthe main actions, and the ''residual effect'', originating from the\nsupplemental actions, facilitating more effective OPE. Specifically, our\nestimator, called OPCB, leverages an importance sampling-based approach to\nunbiasedly estimate the main effect, while employing regression-based approach\nto deal with the residual effect with low variance. OPCB achieves substantial\nvariance reduction compared to conventional importance sampling methods and\nbias reduction relative to regression methods under certain conditions, as\nillustrated in our theoretical analysis. Experiments demonstrate OPCB's\nsuperior performance over typical methods in both OPE and OPL.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}