{"id":"2408.16042","title":"Constraints on the properties of $\\nu$MSM dark matter using the\n  satellite galaxies of the Milky Way","authors":"Oliver Newton (1), Mark R. Lovell (2), Carlos S. Frenk (2), Adrian\n  Jenkins (2), John C. Helly (2), Shaun Cole (2) and Andrew J. Benson (3) ((1)\n  Center for Theoretical Physics, Polish Academy of Sciences, Warsaw, Poland,\n  (2) Institute for Computational Cosmology, Durham, UK, (3) Carnegie\n  Observatories, Pasadena CA, USA)","authorsParsed":[["Newton","Oliver",""],["Lovell","Mark R.",""],["Frenk","Carlos S.",""],["Jenkins","Adrian",""],["Helly","John C.",""],["Cole","Shaun",""],["Benson","Andrew J.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-30","timestamp":1724868000000,"abstract":"  Low-mass galaxies provide a powerful tool with which to investigate\ndepartures from the standard cosmological paradigm in models that suppress the\nabundance of small dark matter structures. One of the simplest metrics that can\nbe used to compare different models is the abundance of satellite galaxies in\nthe Milky Way. Viable dark matter models must produce enough substructure to\nhost the observed number of Galactic satellites. Here, we scrutinize the\npredictions of the neutrino Minimal Standard Model ($\\nu{\\rm MSM}$), a\nwell-motivated extension of the Standard Model of particle physics in which the\nproduction of sterile neutrino dark matter is resonantly enhanced by a lepton\nasymmetry in the primordial plasma. This process enables the model to evade\ncurrent constraints associated with non-resonantly produced dark matter.\nIndependently of assumptions about galaxy formation physics we rule out, with\nat least 95 per cent confidence, all parameterizations of the $\\nu{\\rm MSM}$\nwith sterile neutrino rest mass, $M_{\\rm s} \\leq 1.4\\, {\\rm keV}$.\nIncorporating physically motivated prescriptions of baryonic processes and\nmodelling the effects of reionization strengthen our constraints, and we\nexclude all $\\nu{\\rm MSM}$ parameterizations with $M_{\\rm s} \\leq 4\\, {\\rm\nkeV}$. Unlike other literature, our fiducial constraints do not rule out the\nputative 3.55 keV X-ray line, if it is indeed produced by the decay of a\nsterile neutrino; however, some of the most favoured parameter space is\nexcluded. If the Milky Way satellite count is higher than we assume, or if the\nMilky Way halo is less massive than $M^{\\rm MW}_{200} = 8 \\times 10^{11}\\, {\\rm\nM_\\odot}$, we rule out the $\\nu{\\rm MSM}$ as the origin of the 3.55 keV excess.\nIn contrast with other work, we find that the constraints from satellite counts\nare substantially weaker than those reported from X-ray non-detections.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"e7xb8GgZCTmIpSHNb37Jbqt_ssdH4hTnQhzXyMm0ZRY","pdfSize":"974044"}
