{"id":"2408.08797","title":"How exchange symmetry impacts performance of collective quantum heat\n  engines","authors":"Julia Boeyens, Benjamin Yadin, Stefan Nimmrichter","authorsParsed":[["Boeyens","Julia",""],["Yadin","Benjamin",""],["Nimmrichter","Stefan",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 15:14:28 GMT"}],"updateDate":"2024-08-19","timestamp":1723821268000,"abstract":"  Recently, multilevel collectively coupled quantum machines like heat engines\nand refrigerators have been shown to admit performance enhancements in analogy\nto superradiance. Thus far, investigations of the performance of collective\nquantum machines have largely restricted the dynamics to particles with bosonic\nexchange symmetry, especially for large numbers of particles. However,\ncollections of indistiguishable but not fundamentally identical particles may\nassume quantum states of more general exchange symmetry or combinations\nthereof, raising the question of whether collective advantages can be observed\nfor dynamics that allow the full Hilbert space to be explored. Here, we compare\na collection of single-particle three-level masers with their collectively\ncoupled counterpart, while admitting more general forms of exchange symmetry.\nWe study ergotropy and emitted power as the figures of merit and show which of\nthe known results applicable to a single three-level engine carry over to an\nengine made up of a collectively coupled ensemble. We do this using results\nfrom representation theory to characterise the full basis of the Hilbert space\nand provide general tools for the description of the dynamics of such systems.\nWe find that collective work extraction can extend beyond the temperature\nwindow of three-level lasing, whereas in the lasing regime, individual may\noutperform collective operation. In addition, the optimal parameter regime for\nwork-like energy output varies for different symmetry types. Our results show a\nrich picture in which bosonic symmetry is not always optimal and sometimes\nindividual particles may even perform best.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2PbdUV0HG5E7MldwFRXO5MhBiBJDaxTLgWsM8-Oe0EI","pdfSize":"965833"}
