{"id":"2408.13500","title":"An Evolutionary Task Scheduling Algorithm Using Fuzzy Fitness Evaluation\n  Method for Communication Satellite Network","authors":"Xuemei Jiang, Yangyang Guo, Yue Zhang, Yanjie Song, Witold Pedrycz,\n  Lining Xing","authorsParsed":[["Jiang","Xuemei",""],["Guo","Yangyang",""],["Zhang","Yue",""],["Song","Yanjie",""],["Pedrycz","Witold",""],["Xing","Lining",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 06:54:17 GMT"}],"updateDate":"2024-08-27","timestamp":1724482457000,"abstract":"  Communications satellite networks (CSNs), as an integral component of the\nnext generation of communication systems, have the capability to offer services\nglobally. Data transmission in this network primarily relies on two modes:\ninter-satellite communication and satellite-to-ground station communication.\nThe latter directly impacts the successful reception of data by users. However,\ndue to resource and task limitations, finding a satisfactory solution poses a\nsignificant challenge. The communication satellite-ground station network\nscheduling problem (CS-GSNSP) aims to optimize CSN effectiveness by devising a\nplan that maximizes link construction time while considering constraints\nassociated with satellite operation modes. The large number of tasks and\nnumerous constraints in the problem result in a time-consuming evaluation of\nfitness function values. To address this issue, we propose a fuzzy fitness\nevaluation method (FFEA) that employs fuzzy or real evaluation methods based on\nindividual similarity degrees. Additionally, we introduce an evolutionary\nalgorithm based on FFEA (FFEEA) for iteratively searching high-quality network\nconstruction schemes. In FFEEA, an adaptive crossover approach is used for\nefficient population search. Finally, extensive experiments are conducted to\ndemonstrate that our proposed fuzzy fitness evaluation method and other\nimprovement strategies significantly enhance satellite network service time.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}