{"id":"2408.00534","title":"The Monetisation of Toxicity: Analysing YouTube Content Creators and\n  Controversy-Driven Engagement","authors":"Thales Bertaglia and Catalina Goanta and Adriana Iamnitchi","authorsParsed":[["Bertaglia","Thales",""],["Goanta","Catalina",""],["Iamnitchi","Adriana",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 13:10:35 GMT"}],"updateDate":"2024-08-02","timestamp":1722517835000,"abstract":"  YouTube is a major social media platform that plays a significant role in\ndigital culture, with content creators at its core. These creators often engage\nin controversial behaviour to drive engagement, which can foster toxicity. This\npaper presents a quantitative analysis of controversial content on YouTube,\nfocusing on the relationship between controversy, toxicity, and monetisation.\nWe introduce a curated dataset comprising 20 controversial YouTube channels\nextracted from Reddit discussions, including 16,349 videos and more than 105\nmillion comments. We identify and categorise monetisation cues from video\ndescriptions into various models, including affiliate marketing and direct\nselling, using lists of URLs and keywords. Additionally, we train a machine\nlearning model to measure the toxicity of comments in these videos. Our\nfindings reveal that while toxic comments correlate with higher engagement,\nthey negatively impact monetisation, indicating that controversy-driven\ninteraction does not necessarily lead to financial gain. We also observed\nsignificant variation in monetisation strategies, with some creators showing\nextensive monetisation despite high toxicity levels. Our study introduces a\ncurated dataset, lists of URLs and keywords to categorise monetisation, a\nmachine learning model to measure toxicity, and is a significant step towards\nunderstanding the complex relationship between controversy, engagement, and\nmonetisation on YouTube. The lists used for detecting and categorising\nmonetisation cues are available on https://github.com/thalesbertaglia/toxmon.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iVbvYCiFCRLgxM6_iF_lfVgn5o8lTj7voME75dx1D0o","pdfSize":"557657","txDigest":"39wARgJNFqdPqapYFn8xGVpQfrtDLieCRPDhcLNCh8jG","endEpoch":"1","status":"CERTIFIED"}
