{"id":"2408.01510","title":"Adaptive Planning with Generative Models under Uncertainty","authors":"Pascal Jutras-Dub\\'e, Ruqi Zhang, Aniket Bera","authorsParsed":[["Jutras-Dubé","Pascal",""],["Zhang","Ruqi",""],["Bera","Aniket",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 18:07:53 GMT"}],"updateDate":"2024-08-06","timestamp":1722622073000,"abstract":"  Planning with generative models has emerged as an effective decision-making\nparadigm across a wide range of domains, including reinforcement learning and\nautonomous navigation. While continuous replanning at each timestep might seem\nintuitive because it allows decisions to be made based on the most recent\nenvironmental observations, it results in substantial computational challenges,\nprimarily due to the complexity of the generative model's underlying deep\nlearning architecture. Our work addresses this challenge by introducing a\nsimple adaptive planning policy that leverages the generative model's ability\nto predict long-horizon state trajectories, enabling the execution of multiple\nactions consecutively without the need for immediate replanning. We propose to\nuse the predictive uncertainty derived from a Deep Ensemble of inverse dynamics\nmodels to dynamically adjust the intervals between planning sessions. In our\nexperiments conducted on locomotion tasks within the OpenAI Gym framework, we\ndemonstrate that our adaptive planning policy allows for a reduction in\nreplanning frequency to only about 10% of the steps without compromising the\nperformance. Our results underscore the potential of generative modeling as an\nefficient and effective tool for decision-making.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UKa5p410QpfssJJosNpSHM1Nj52uX5ow9hr67O6GNMs","pdfSize":"328525","txDigest":"ExfvBgXy949HeMTx2z7DRExMiy5nD8XEWmw9vbZVnHcz","endEpoch":"1","status":"CERTIFIED"}
