{"id":"2408.01845","title":"Dissolution zone model of the oxide structure in additively manufactured\n  dispersion-strengthened alloys","authors":"Wenyuan Hou, Timothy Stubbs, Lisa DeBeer-Schmitt, Yen-Ting Chang,\n  Marie-Agathe Charpagne, Timothy M. Smith, Aijun Huang, Zachary C. Cordero","authorsParsed":[["Hou","Wenyuan",""],["Stubbs","Timothy",""],["DeBeer-Schmitt","Lisa",""],["Chang","Yen-Ting",""],["Charpagne","Marie-Agathe",""],["Smith","Timothy M.",""],["Huang","Aijun",""],["Cordero","Zachary C.",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 18:53:44 GMT"}],"updateDate":"2024-08-06","timestamp":1722711224000,"abstract":"  The structural evolution of oxides in dispersion-strengthened superalloys\nduring laser-powder bed fusion is considered in detail. Alloy chemistry and\nprocess parameter effects on oxide structure are assessed through a parameter\nstudy on the model alloy Ni-20Cr, doped with varying concentrations of Y2O3 and\nAl. A scaling analysis of mass and momentum transport within the melt pool,\npresented here, establishes that diffusional structural evolution mechanisms\ndominate for nanoscale dispersoids, while fluid forces and advection become\nsignificant for larger micron-scale slag inclusions. These findings are\ndeveloped into a theory of dispersoid structural evolution, integrating\nquantitative models of diffusional processes -- dispersoid dissolution,\nnucleation, growth, coarsening -- with a reduced order model of\ntime-temperature trajectories of fluid parcels within the melt pool.\nCalculations of the dispersoid size in single-pass melting reveal a zone in the\ncenter of the melt track in which the oxide feedstock fully dissolves. Within\nthis zone the final Y2O3 size is independent of feedstock size and determined\nby nucleation and growth kinetics. If the dissolution zones of adjacent melt\ntracks overlap sufficiently with each other to dissolve large oxides, formed\nduring printing or present in the powder feedstock, then the dispersoid\nstructure throughout the build volume is homogeneous and matches that from a\nsingle pass within the dissolution zone. Gaps between adjacent dissolution\nzones result in oxide accumulation into larger slag inclusions. Predictions of\nfinal dispersoid size and slag formation using this dissolution zone model\nmatch the present experimental data and explain process-structure linkages\nspeculated in the open literature.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jT2Y0MnlAxPnbQb7zxh-40xHOEpJKVpxBQrU2ifxQVQ","pdfSize":"3363130"}
