{"id":"2408.10215","title":"Comprehensive Overview of Reward Engineering and Shaping in Advancing\n  Reinforcement Learning Applications","authors":"Sinan Ibrahim, Mostafa Mostafa, Ali Jnadi, Pavel Osinenko","authorsParsed":[["Ibrahim","Sinan",""],["Mostafa","Mostafa",""],["Jnadi","Ali",""],["Osinenko","Pavel",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 09:28:12 GMT"}],"updateDate":"2024-08-21","timestamp":1721640492000,"abstract":"  The aim of Reinforcement Learning (RL) in real-world applications is to\ncreate systems capable of making autonomous decisions by learning from their\nenvironment through trial and error. This paper emphasizes the importance of\nreward engineering and reward shaping in enhancing the efficiency and\neffectiveness of reinforcement learning algorithms. Reward engineering involves\ndesigning reward functions that accurately reflect the desired outcomes, while\nreward shaping provides additional feedback to guide the learning process,\naccelerating convergence to optimal policies. Despite significant advancements\nin reinforcement learning, several limitations persist. One key challenge is\nthe sparse and delayed nature of rewards in many real-world scenarios, which\ncan hinder learning progress. Additionally, the complexity of accurately\nmodeling real-world environments and the computational demands of reinforcement\nlearning algorithms remain substantial obstacles. On the other hand, recent\nadvancements in deep learning and neural networks have significantly improved\nthe capability of reinforcement learning systems to handle high-dimensional\nstate and action spaces, enabling their application to complex tasks such as\nrobotics, autonomous driving, and game playing. This paper provides a\ncomprehensive review of the current state of reinforcement learning, focusing\non the methodologies and techniques used in reward engineering and reward\nshaping. It critically analyzes the limitations and recent advancements in the\nfield, offering insights into future research directions and potential\napplications in various domains.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}