{"id":"2408.09742","title":"Paired Completion: Flexible Quantification of Issue-framing at Scale\n  with LLMs","authors":"Simon D Angus and Lachlan O'Neill","authorsParsed":[["Angus","Simon D",""],["O'Neill","Lachlan",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 07:14:15 GMT"}],"updateDate":"2024-08-20","timestamp":1724051655000,"abstract":"  Detecting and quantifying issue framing in textual discourse - the\nperspective one takes to a given topic (e.g. climate science vs. denialism,\nmisogyny vs. gender equality) - is highly valuable to a range of end-users from\nsocial and political scientists to program evaluators and policy analysts.\nHowever, conceptual framing is notoriously challenging for automated natural\nlanguage processing (NLP) methods since the words and phrases used by either\n`side' of an issue are often held in common, with only subtle stylistic\nflourishes separating their use. Here we develop and rigorously evaluate new\ndetection methods for issue framing and narrative analysis within large text\ndatasets. By introducing a novel application of next-token log probabilities\nderived from generative large language models (LLMs) we show that issue framing\ncan be reliably and efficiently detected in large corpora with only a few\nexamples of either perspective on a given issue, a method we call `paired\ncompletion'. Through 192 independent experiments over three novel, synthetic\ndatasets, we evaluate paired completion against prompt-based LLM methods and\nlabelled methods using traditional NLP and recent LLM contextual embeddings. We\nadditionally conduct a cost-based analysis to mark out the feasible set of\nperformant methods at production-level scales, and a model bias analysis.\nTogether, our work demonstrates a feasible path to scalable, accurate and\nlow-bias issue-framing in large corpora.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}