{"id":"2408.08596","title":"Observation of strong phonon-phonon coupling in one-dimensional van der\n  Waals crystals","authors":"Shaoqi Sun, Qingyun Lin, Yihuan Li, Daichi Kozawa, Huizhen Wu, Shigeo\n  Maruyama, Pilkyung Moon, Toshikaze Kariyado, Ryo Kitaura and Sihan Zhao","authorsParsed":[["Sun","Shaoqi",""],["Lin","Qingyun",""],["Li","Yihuan",""],["Kozawa","Daichi",""],["Wu","Huizhen",""],["Maruyama","Shigeo",""],["Moon","Pilkyung",""],["Kariyado","Toshikaze",""],["Kitaura","Ryo",""],["Zhao","Sihan",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 08:05:15 GMT"}],"updateDate":"2024-08-19","timestamp":1723795515000,"abstract":"  The phenomena of pronounced electron-electron and electron-phonon\ninteractions in one-dimensional (1D) systems are ubiquitous, which are well\ndescribed by frameworks of Luttinger liquid, Peierls instability and\nconcomitant charge density wave. However, the experimental observation of\nstrong phonon-phonon coupling in 1D was not demonstrated. Herein we report the\nfirst observation of strong phonon-phonon coupling in 1D condensed matters by\nusing double-walled carbon nanotubes (DWNTs), representative 1D van der Waals\ncrystals, with combining the spectroscopic and microscopic tools as well as the\nab initio density functional theory (DFT) calculations. We observe uncharted\nphonon modes in one commensurate and three incommensurate DWNT crystals, three\nof which concurrently exhibit strongly-reconstructed electronic band\nstructures. Our DFT calculations for the experimentally observed commensurate\nDWNT (7,7) @ (12,12) reveal that this new phonon mode originates from a\n(nearly) degenerate coupling between two transverse acoustic eigenmodes (ZA\nmodes) of constituent inner and outer nanotubes having trigonal and pentagonal\nrotational symmetry along the nanotube circumferences. Such coupling strongly\nhybridizes the two phonon modes in different shells and leads to the formation\nof a unique lattice motion featuring evenly distributed vibrational amplitudes\nover inner and outer nanotubes, distinct from any known phonon modes in 1D\nsystems. All four DWNTs that exhibit the pronounced new phonon modes show small\nchiral angle twists, closely matched diameter ratios of 3/5 and decreased\nfrequencies of new phonon modes with increasing diameters, all supporting the\nuncovered coupling mechanism. Our discovery of strong phonon-phonon coupling in\nDWNTs open new opportunities for engineering phonons and exploring novel\nphonon-related phenomena in 1D condensed matters.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tGvgnViDW9HN5fYC-RXTwTT9EziTlezLfFvoeWfFUTQ","pdfSize":"3379117"}
