{"id":"2408.04551","title":"Resonant conversion of axion dark radiation into terahertz\n  electromagnetic radiation in a neutron star magnetosphere","authors":"Andrew J. Long and Enrico D. Schiappacasse","authorsParsed":[["Long","Andrew J.",""],["Schiappacasse","Enrico D.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 16:02:04 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 16:08:43 GMT"}],"updateDate":"2024-08-16","timestamp":1723132924000,"abstract":"  In the strong magnetic field of a neutron star's magnetosphere, axions\ncoupled to electromagnetism develop a nonzero probability to convert into\nphotons. Past studies have revealed that the axion-photon conversion can be\nresonantly enhanced. We recognize that the axion-photon resonance admits two\nparametrically distinct resonant solutions, which we call the mass-matched\nresonance and the Euler-Heisenberg assisted resonance. The mass-matched\nresonance occurs at a point in the magnetosphere where the radially-varying\nplasma frequency crosses the axion mass $\\omega_\\mathrm{pl} \\approx m_a$. The\nEuler-Heisenberg assisted resonance occurs where the axion energy satisfies\n$\\omega \\approx (2 \\omega_\\mathrm{pl}^2 / 7 g_{\\gamma\\gamma\\gamma\\gamma}\n\\bar{B}^2 )^{1/2}$. This second resonance is made possible though the strong\nbackground magnetic field $\\bar{B}$ as well as the nonzero Euler-Heisenberg\nfour-photon self interaction, which has the coupling\n$g_{\\gamma\\gamma\\gamma\\gamma} = 8 \\alpha^2 / 45 m_e^4$. We study the resonant\nconversion of relativistic axion dark radiation into photons via the\nEuler-Heisenberg assisted resonance, and we calculate the expected\nelectromagnetic radiation assuming different values for the axion-photon\ncoupling $g_{a\\gamma\\gamma}$ and different amplitudes for the axion flux onto\nthe neutron star $\\Phi_a$. We briefly discuss several possible sources of axion\ndark radiation. Achieving a sufficiently strong axion flux to induce a\ndetectable electromagnetic signal seems unlikely.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"3xF716xfM7Jb1r7lzogpUQMbzyed3FNX0nmthHlgYvI","pdfSize":"4626529"}
