{"id":"2408.01546","title":"The Keck-HGCA Pilot Survey II: Direct Imaging Discovery of HD 63754 B, a\n  ~20 au Massive Companion Near the Hydrogen Burning Limit","authors":"Yiting Li, Timothy D. Brandt, Kyle Franson, Qier An, Taylor Tobin,\n  Thayne Currie, Minghan Chen, Lanxuan Wang, Trent J. Dupuy, Rachel\n  Bowens-Rubin, Maissa Salama, Briley L. Lewis, Aidan Gibbs, Brendan P. Bowler,\n  Rebecca Jensen-Clem, Jacqueline Faherty, Michael P. Fitzgerald, Benjamin A.\n  Mazin","authorsParsed":[["Li","Yiting",""],["Brandt","Timothy D.",""],["Franson","Kyle",""],["An","Qier",""],["Tobin","Taylor",""],["Currie","Thayne",""],["Chen","Minghan",""],["Wang","Lanxuan",""],["Dupuy","Trent J.",""],["Bowens-Rubin","Rachel",""],["Salama","Maissa",""],["Lewis","Briley L.",""],["Gibbs","Aidan",""],["Bowler","Brendan P.",""],["Jensen-Clem","Rebecca",""],["Faherty","Jacqueline",""],["Fitzgerald","Michael P.",""],["Mazin","Benjamin A.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 19:25:48 GMT"}],"updateDate":"2024-08-06","timestamp":1722626748000,"abstract":"  We present the joint astrometric and direct imaging discovery, mass\nmeasurement, and orbital analysis of HD 63754 B (HIP 38216 B), a companion near\nthe stellar-substellar boundary orbiting ~20 AU from its Sun-like host. HD\n63754 was observed in our ongoing high-contrast imaging survey targeting stars\nwith significant proper-motion accelerations between Hipparcos and Gaia\nconsistent with wide-separation substellar companions. We utilized archival\nHIRES and HARPS radial velocity (RV) data, together with the host star's\nastrometric acceleration extracted from the Hipparcos-Gaia Catalog of\nAccelerations (HGCA), to predict the location of the candidate companion around\nHD 63754 A. We subsequently imaged HD 63754 B at its predicted location using\nthe Near Infrared Camera 2 (NIRC2) in the $L'$ band at the W. M. Keck\nObservatory. We then jointly modeled the orbit of HD 63754 B with RVs,\nHipparcos-Gaia accelerations, and our new relative astrometry, measuring a\ndynamical mass of ${81.9}_{-5.8}^{+6.4} M_{jup}$, an eccentricity of\n${0.260}_{-0.059}^{+0.065}$, and a nearly face-on inclination of\n$174.81_{-0.50}^{+0.48}$ degrees. For HD 63754 B, we obtain an L' band absolute\nmagnitude of $L' = 11.39\\pm0.06$ mag, from which we infer a bolometric\nluminosity of $log(L_{bol}/L_{\\odot})= -4.55 \\pm0.08$ dex using a comparison\nsample of L and T dwarfs with measured luminosities. Although uncertainties\nlinger in age and dynamical mass estimates, our analysis points toward HD 63754\nB's identity as a brown dwarf on the L/T transition rather than a low-mass\nstar, indicated by its inferred bolometric luminosity and model-estimated\neffective temperature. Future RV, spectroscopic, and astrometric data such as\nthose from JWST and Gaia DR4 will clarify HD 63754 B's mass, and enable\nspectral typing and atmospheric characterization.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YxvvHQQdyugbF6TIhXWKlQNwdY3THsETejzOiRE_S34","pdfSize":"3504759","txDigest":"8Q8UXHZASKTTP9miDNPXzQo1p7BQkJzKPnkZh1xjF27p","endEpoch":"1","status":"CERTIFIED"}
