{"id":"2408.07178","title":"Probing cluster magnetism with embedded and background radio sources in\n  Planck clusters","authors":"Erik Osinga, Reinout J. van Weeren, Lawrence Rudnick, Felipe\n  Andrade-Santos, Annalisa Bonafede, Tracy Clarke, Kenda Duncan, Simona\n  Giacintucci, Huub J. A. R\\\"ottgering","authorsParsed":[["Osinga","Erik",""],["van Weeren","Reinout J.",""],["Rudnick","Lawrence",""],["Andrade-Santos","Felipe",""],["Bonafede","Annalisa",""],["Clarke","Tracy",""],["Duncan","Kenda",""],["Giacintucci","Simona",""],["Röttgering","Huub J. A.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 19:40:23 GMT"}],"updateDate":"2024-08-15","timestamp":1723578023000,"abstract":"  Magnetic fields remain an enigmatic part of the content of galaxy clusters.\nFaraday rotation and depolarisation of extragalactic radio sources are useful\nprobes, but the limited availability of polarised radio sources necessitates\nstacking clusters to study average magnetic field profiles and correlation\nscales. We recently presented a VLA survey of the 124 most massive Planck\nclusters at low redshift ($z<0.35$), where a clear depolarisation trend with\nthe cluster impact parameter was found. In this study, we combine the\ndepolarisation information with the observed rotation measure (RM) and present\nan investigation into the average magnetic field properties of the sample,\nusing both background sources and sources embedded in clusters. We observe a\nsignificant increase in the RM scatter, $\\sigma_\\mathrm{RRM}$, closer to the\ncluster centres. Averaging all 124 clusters, we find a scatter within\n$R_\\mathrm{500}$ of $\\sigma_\\mathrm{RRM}=209\\pm37$ rad m$^{-2}$, with\nbackground sources and cluster members showing similar values ($200\\pm33$ and\n$219\\pm66$ rad m$^{-2}$, respectively). In the simple assumption of a uniform\nmagnetic field with a single fluctuation scale $\\Lambda_c$, this translates to\nan average magnetic field strength of $2\\,(\\Lambda_c/10\\mathrm{kpc})^{-0.5}\\,\n\\mu$G. The profile of $\\sigma_\\mathrm{RRM}$ as a function of projected radius\nis inconsistent with a model that has a simple scaling $B \\propto n_e^\\eta$,\nwith an observed deficit near the centre of clusters possibly caused by the\nfact that the highest RM sources near the centre of clusters are depolarised.\nIn a full forward model, we find that the magnetic field power spectrum agrees\nwith the Kolmogorov value, but that none of the Gaussian random field models\ncan fully explain the observed relatively flat profiles. This implies that more\nsophisticated models of cluster magnetic fields in a cosmological context are\nneeded.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}