{"id":"2408.13594","title":"Matter really does matter, or Why $f(R,{\\rm Matter})$ type theories are\n  significant for gravitational physics and cosmology","authors":"Tiberiu Harko, Miguel A. S. Pinto, Shahab Shahidi","authorsParsed":[["Harko","Tiberiu",""],["Pinto","Miguel A. S.",""],["Shahidi","Shahab",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 14:41:43 GMT"}],"updateDate":"2024-08-27","timestamp":1724510503000,"abstract":"  In a recent paper (Lacombe, Mukohyama, and Seitz, JCAP {\\bf 2024}, 05, 064\n(2024)), the authors provided an in-depth analysis of a class of modified\ngravity theories, generally called $f(R,{\\rm Matter})$ theories, which assume\nthe existence of a non-minimal coupling between geometry and matter. It was\nargued that if the matter sector consists of Standard Model particles, then\nthese theories suffer from the presence of ghosts, or are just\nscalar/vector-tensor theories. Hence, the relevance of these theories for\ncosmology was questioned. It is the goal of the present work to carefully\nanalyze, discuss, and assess the line of arguments proposed in Lacombe et al.\nJCAP {\\bf 2024}, 05, 064 (2024). After a qualitative critical discussion of the\nfive general arguments proposed for the validity of a gravitational theory, we\npresent the theoretical foundations of the $f(R,{\\rm Matter})$ theories,\nincluding their possible relations with quantum gravity, and discuss in detail\nthe role of matter. The matter source discussed in Lacombe et al., consisting\npredominantly of a massless scalar field, is extremely restrictive, and rather\nirrelevant for cosmology and the description of the observational data. We also\ndevote a detailed discussion of the problem of the energy scales of the\n$f(R,{\\rm Matter})$ theories. To test the observational relevance of this type\nof theories we present the comparison of a simple theoretical model with a\nsmall set of observational data and with the $\\Lambda$CDM paradigm. We conclude\nby pointing out that the analysis of Lacombe et al., JCAP {\\bf 2024}, 05, 064\n(2024), even very useful for the understanding of some limited aspects of the\n$f(R,{\\rm Matter})$ theories, and of their theoretical foundations, cannot be\nconsidered as a valid or definite criticism of these approaches to gravity.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}