{"id":"2408.01112","title":"Agentic LLM Workflows for Generating Patient-Friendly Medical Reports","authors":"Malavikha Sudarshan, Sophie Shih, Estella Yee, Alina Yang, John Zou,\n  Cathy Chen, Quan Zhou, Leon Chen, Chinmay Singhal and George Shih","authorsParsed":[["Sudarshan","Malavikha",""],["Shih","Sophie",""],["Yee","Estella",""],["Yang","Alina",""],["Zou","John",""],["Chen","Cathy",""],["Zhou","Quan",""],["Chen","Leon",""],["Singhal","Chinmay",""],["Shih","George",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 08:40:33 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 05:15:48 GMT"}],"updateDate":"2024-08-06","timestamp":1722588033000,"abstract":"  The application of Large Language Models (LLMs) in healthcare is expanding\nrapidly, with one potential use case being the translation of formal medical\nreports into patient-legible equivalents. Currently, LLM outputs often need to\nbe edited and evaluated by a human to ensure both factual accuracy and\ncomprehensibility, and this is true for the above use case. We aim to minimize\nthis step by proposing an agentic workflow with the Reflexion framework, which\nuses iterative self-reflection to correct outputs from an LLM. This pipeline\nwas tested and compared to zero-shot prompting on 16 randomized radiology\nreports. In our multi-agent approach, reports had an accuracy rate of 94.94%\nwhen looking at verification of ICD-10 codes, compared to zero-shot prompted\nreports, which had an accuracy rate of 68.23%. Additionally, 81.25% of the\nfinal reflected reports required no corrections for accuracy or readability,\nwhile only 25% of zero-shot prompted reports met these criteria without needing\nmodifications. These results indicate that our approach presents a feasible\nmethod for communicating clinical findings to patients in a quick, efficient\nand coherent manner whilst also retaining medical accuracy. The codebase is\navailable for viewing at\nhttp://github.com/malavikhasudarshan/Multi-Agent-Patient-Letter-Generation.\n","subjects":["Computing Research Repository/Multiagent Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}