{"id":"2408.01433","title":"Evaluating and Enhancing Trustworthiness of LLMs in Perception Tasks","authors":"Malsha Ashani Mahawatta Dona, Beatriz Cabrero-Daniel, Yinan Yu,\n  Christian Berger","authorsParsed":[["Dona","Malsha Ashani Mahawatta",""],["Cabrero-Daniel","Beatriz",""],["Yu","Yinan",""],["Berger","Christian",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 20:58:03 GMT"}],"updateDate":"2024-08-06","timestamp":1721336283000,"abstract":"  Today's advanced driver assistance systems (ADAS), like adaptive cruise\ncontrol or rear collision warning, are finding broader adoption across vehicle\nclasses. Integrating such advanced, multimodal Large Language Models (LLMs) on\nboard a vehicle, which are capable of processing text, images, audio, and other\ndata types, may have the potential to greatly enhance passenger comfort. Yet,\nan LLM's hallucinations are still a major challenge to be addressed. In this\npaper, we systematically assessed potential hallucination detection strategies\nfor such LLMs in the context of object detection in vision-based data on the\nexample of pedestrian detection and localization. We evaluate three\nhallucination detection strategies applied to two state-of-the-art LLMs, the\nproprietary GPT-4V and the open LLaVA, on two datasets (Waymo/US and PREPER\nCITY/Sweden). Our results show that these LLMs can describe a traffic situation\nto an impressive level of detail but are still challenged for further analysis\nactivities such as object localization. We evaluate and extend hallucination\ndetection approaches when applying these LLMs to video sequences in the example\nof pedestrian detection. Our experiments show that, at the moment, the\nstate-of-the-art proprietary LLM performs much better than the open LLM.\nFurthermore, consistency enhancement techniques based on voting, such as the\nBest-of-Three (BO3) method, do not effectively reduce hallucinations in LLMs\nthat tend to exhibit high false negatives in detecting pedestrians. However,\nextending the hallucination detection by including information from the past\nhelps to improve results.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"svWSbLzXvfaIw3m6hMsSkBZlkkF1YSotblAIKPx37w4","pdfSize":"2525633"}
