{"id":"2408.16715","title":"Existence and stability for the travelling waves of the Benjamin\n  equation","authors":"Sevdzhan Hakkaev, Milena Stanislavova, Atanas G. Stefanov","authorsParsed":[["Hakkaev","Sevdzhan",""],["Stanislavova","Milena",""],["Stefanov","Atanas G.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 17:06:47 GMT"}],"updateDate":"2024-08-30","timestamp":1724951207000,"abstract":"  In the seminal work of Benjamin,\\cite{Ben} in the late 70's, he has derived\nthe ubiquitous Benjamin model, which is a reduced model in the theory of water\nwaves. Notably, it contains two parameters in its dispersion part and under\nsome special circumstances, it turns into the celebrated KdV or the\nBenjamin-Ono equation, During the90's, there was renewed interest in it.\nBenjamin, \\cite{Ben1}, \\cite{Ben2} studied the problem for existence of\nsolitary waves, followed by works of Bona-Chen, \\cite{BC},\nAlbert-Bona-Restrepo, \\cite{ABR}, Pava, \\cite{Pava1}, who have showed the\nexistence of travelling waves, mostly by variational, but also bifurcation\nmethods. Some results about the stability became available, but unfortunately,\nthose were restricted to either small waves or Benjamin model, close to a\ndistinguished (i.e. KdV or BO) limit. Quite recently, in \\cite{ADM}, Abdallah,\nDarwich and Molinet, proved existence, orbital stability and uniqueness results\nfor these waves, but only for large values of $\\f{c}{\\ga^2}>>1$.\n  In this article, we present an alternative constrained maximization procedure\nfor the construction of these waves, for the full range of the parameters,\nwhich allows us to ascertain their spectral stability. Moreover, we extend this\nconstruction to all $L^2$ subcritical cases (i.e. power nonlinearities\n$(|u|^{p-2}u)_x$, $2<p\\leq 6$). Finally, we propose a different procedure,\nbased on a specific form of the Sobolev embedding inequality, which works for\nall powers $2<p<\\infty$, but produces some unstable waves, for large $p$. Some\nopen questions and a conjecture regarding this last result are proposed for\nfurther investigation.\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}