{"id":"2408.10636","title":"UWF-RI2FA: Generating Multi-frame Ultrawide-field Fluorescein\n  Angiography from Ultrawide-field Retinal Imaging Improves Diabetic\n  Retinopathy Stratification","authors":"Ruoyu Chen, Kezheng Xu, Kangyan Zheng, Weiyi Zhang, Yan Lu, Danli Shi,\n  Mingguang He","authorsParsed":[["Chen","Ruoyu",""],["Xu","Kezheng",""],["Zheng","Kangyan",""],["Zhang","Weiyi",""],["Lu","Yan",""],["Shi","Danli",""],["He","Mingguang",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 08:22:29 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 16:19:22 GMT"}],"updateDate":"2024-08-28","timestamp":1724142149000,"abstract":"  Ultrawide-field fluorescein angiography (UWF-FA) facilitates diabetic\nretinopathy (DR) detection by providing a clear visualization of peripheral\nretinal lesions. However, the intravenous dye injection with potential risks\nhamper its application. We aim to acquire dye-free UWF-FA images from\nnoninvasive UWF retinal imaging (UWF-RI) using generative artificial\nintelligence (GenAI) and evaluate its effectiveness in DR screening. A total of\n18,321 UWF-FA images of different phases were registered with corresponding\nUWF-RI images and fed into a generative adversarial networks (GAN)-based model\nfor training. The quality of generated UWF-FA images was evaluated through\nquantitative metrics and human evaluation. The DeepDRiD dataset was used to\nexternally assess the contribution of generated UWF-FA images to DR\nclassification, using area under the receiver operating characteristic curve\n(AUROC) as outcome metrics. The generated early, mid, and late phase UWF-FA\nimages achieved high authenticity, with multi-scale similarity scores ranging\nfrom 0.70 to 0.91 and qualitative visual scores ranging from 1.64 to 1.98\n(1=real UWF-FA quality). In fifty randomly selected images, 56% to 76% of the\ngenerated images were difficult to distinguish from real images in the Turing\ntest. Moreover, adding these generated UWF-FA images for DR classification\nsignificantly increased the AUROC from 0.869 to 0.904 compared to the baseline\nmodel using UWF-RI images (P < .001). The model successfully generates\nrealistic multi-frame UWF-FA images for enhancing DR stratification without\nintravenous dye injection.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}