{"id":"2408.10813","title":"Flare heating of the chromosphere: Observations of flare continuum from\n  GREGOR and IRIS","authors":"M. Garc\\'ia-Rivas, J. Ka\\v{s}parov\\'a, A. Berlicki, M. \\v{S}vanda, J.\n  Dud\\'ik, D. \\v{C}tvrte\\v{c}ka, M. Zapi\\'or, W. Liu, M. Sobotka, M.\n  Pavelkov\\'a, and G. G. Motorina","authorsParsed":[["García-Rivas","M.",""],["Kašparová","J.",""],["Berlicki","A.",""],["Švanda","M.",""],["Dudík","J.",""],["Čtvrtečka","D.",""],["Zapiór","M.",""],["Liu","W.",""],["Sobotka","M.",""],["Pavelková","M.",""],["Motorina","G. G.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 13:07:49 GMT"}],"updateDate":"2024-08-21","timestamp":1724159269000,"abstract":"  Context: On 2022 May 4, an M5.7 flare erupted in the active region NOAA\n13004, which was the target of a coordinated campaign between GREGOR, IRIS,\nHinode, and ground-based instruments at the Ond\\v{r}ejov observatory. A flare\nkernel located at the edge of a pore was co-observed by the IRIS slit and\nGREGOR HiFI+ imagers. Aims: We investigated the flare continuum enhancement at\ndifferent wavelength ranges in order to derive the temperature of the\nchromospheric layer heated during the flare. Methods: All datasets were aligned\nto IRIS slit-jaw images. We selected a pixel along the IRIS slit where the\nflare kernel was captured and evaluated multi-wavelength light curves within\nit. We defined a narrow IRIS near-UV band that comprises only continuum\nemission. The method, which assumes that the flare continuum enhancement is due\nto optically thin emission from hydrogen recombination processes, was applied\nto obtain a lower limit on the temperature in the layer where the continuum\nenhancement was formed. Results: We determined a lower limit for the\ntemperature and its time evolution in the chromospheric layer heated during the\nflare in the range of (3-15).10^3 K. The mean electron density in that layer\nwas estimated to be about 1.10^(13) cm^(-3). Conclusions: Multi-wavelength\nflare co-observations are a rich source of diagnostics. Due to the rapidly\nevolving nature of flares, the sit-and-stare mode is key to achieving a high\ntemporal cadence that allows one to thoroughly analyse the same flare\nstructure.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}