{"id":"2408.16176","title":"VLM4Bio: A Benchmark Dataset to Evaluate Pretrained Vision-Language\n  Models for Trait Discovery from Biological Images","authors":"M. Maruf, Arka Daw, Kazi Sajeed Mehrab, Harish Babu Manogaran,\n  Abhilash Neog, Medha Sawhney, Mridul Khurana, James P. Balhoff, Yasin Bakis,\n  Bahadir Altintas, Matthew J. Thompson, Elizabeth G. Campolongo, Josef C.\n  Uyeda, Hilmar Lapp, Henry L. Bart, Paula M. Mabee, Yu Su, Wei-Lun Chao,\n  Charles Stewart, Tanya Berger-Wolf, Wasila Dahdul, Anuj Karpatne","authorsParsed":[["Maruf","M.",""],["Daw","Arka",""],["Mehrab","Kazi Sajeed",""],["Manogaran","Harish Babu",""],["Neog","Abhilash",""],["Sawhney","Medha",""],["Khurana","Mridul",""],["Balhoff","James P.",""],["Bakis","Yasin",""],["Altintas","Bahadir",""],["Thompson","Matthew J.",""],["Campolongo","Elizabeth G.",""],["Uyeda","Josef C.",""],["Lapp","Hilmar",""],["Bart","Henry L.",""],["Mabee","Paula M.",""],["Su","Yu",""],["Chao","Wei-Lun",""],["Stewart","Charles",""],["Berger-Wolf","Tanya",""],["Dahdul","Wasila",""],["Karpatne","Anuj",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 23:53:57 GMT"}],"updateDate":"2024-08-30","timestamp":1724889237000,"abstract":"  Images are increasingly becoming the currency for documenting biodiversity on\nthe planet, providing novel opportunities for accelerating scientific\ndiscoveries in the field of organismal biology, especially with the advent of\nlarge vision-language models (VLMs). We ask if pre-trained VLMs can aid\nscientists in answering a range of biologically relevant questions without any\nadditional fine-tuning. In this paper, we evaluate the effectiveness of 12\nstate-of-the-art (SOTA) VLMs in the field of organismal biology using a novel\ndataset, VLM4Bio, consisting of 469K question-answer pairs involving 30K images\nfrom three groups of organisms: fishes, birds, and butterflies, covering five\nbiologically relevant tasks. We also explore the effects of applying prompting\ntechniques and tests for reasoning hallucination on the performance of VLMs,\nshedding new light on the capabilities of current SOTA VLMs in answering\nbiologically relevant questions using images. The code and datasets for running\nall the analyses reported in this paper can be found at\nhttps://github.com/sammarfy/VLM4Bio.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6-9xAdtF5vxcaZ9wrRZ6sCL3JhF0_7Ct5yQys9PyPIQ","pdfSize":"10021773"}
