{"id":"2408.00906","title":"Parkinson's Disease Detection from Resting State EEG using Multi-Head\n  Graph Structure Learning with Gradient Weighted Graph Attention Explanations","authors":"Christopher Neves, Yong Zeng, Yiming Xiao","authorsParsed":[["Neves","Christopher",""],["Zeng","Yong",""],["Xiao","Yiming",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 20:54:33 GMT"}],"updateDate":"2024-08-05","timestamp":1722545673000,"abstract":"  Parkinson's disease (PD) is a debilitating neurodegenerative disease that has\nsevere impacts on an individual's quality of life. Compared with structural and\nfunctional MRI-based biomarkers for the disease, electroencephalography (EEG)\ncan provide more accessible alternatives for clinical insights. While deep\nlearning (DL) techniques have provided excellent outcomes, many techniques fail\nto model spatial information and dynamic brain connectivity, and face\nchallenges in robust feature learning, limited data sizes, and poor\nexplainability. To address these issues, we proposed a novel graph neural\nnetwork (GNN) technique for explainable PD detection using resting state EEG.\nSpecifically, we employ structured global convolutions with contrastive\nlearning to better model complex features with limited data, a novel multi-head\ngraph structure learner to capture the non-Euclidean structure of EEG data, and\na head-wise gradient-weighted graph attention explainer to offer neural\nconnectivity insights. We developed and evaluated our method using the UC San\nDiego Parkinson's disease EEG dataset, and achieved 69.40% detection accuracy\nin subject-wise leave-one-out cross-validation while generating intuitive\nexplanations for the learnt graph topology.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"o4IEZvyymLP6vckISODXbiQyXHjYO5Mt7XycXbgZee0","pdfSize":"2363451","txDigest":"EvvXCBmFu3crMYVwk7RksLMhgSjpeRinKAgHvm34iGkW","endEpoch":"1","status":"CERTIFIED"}
