{"id":"2408.03096","title":"Enhancing Twitter Bot Detection via Multimodal Invariant Representations","authors":"Jibing Gong, Jiquan Peng, Jin Qu, ShuYing Du, Kaiyu Wang","authorsParsed":[["Gong","Jibing",""],["Peng","Jiquan",""],["Qu","Jin",""],["Du","ShuYing",""],["Wang","Kaiyu",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 10:52:50 GMT"}],"updateDate":"2024-08-07","timestamp":1722941570000,"abstract":"  Detecting Twitter Bots is crucial for maintaining the integrity of online\ndiscourse, safeguarding democratic processes, and preventing the spread of\nmalicious propaganda. However, advanced Twitter Bots today often employ\nsophisticated feature manipulation and account farming techniques to blend\nseamlessly with genuine user interactions, posing significant challenges to\nexisting detection models. In response to these challenges, this paper proposes\na novel Twitter Bot Detection framework called BotSAI. This framework enhances\nthe consistency of multimodal user features, accurately characterizing various\nmodalities to distinguish between real users and bots. Specifically, the\narchitecture integrates information from users, textual content, and\nheterogeneous network topologies, leveraging customized encoders to obtain\ncomprehensive user feature representations. The heterogeneous network encoder\nefficiently aggregates information from neighboring nodes through oversampling\ntechniques and local relationship transformers. Subsequently, a multi-channel\nrepresentation mechanism maps user representations into invariant and specific\nsubspaces, enhancing the feature vectors. Finally, a self-attention mechanism\nis introduced to integrate and refine the enhanced user representations,\nenabling efficient information interaction. Extensive experiments demonstrate\nthat BotSAI outperforms existing state-of-the-art methods on two major Twitter\nBot Detection benchmarks, exhibiting superior performance. Additionally,\nsystematic experiments reveal the impact of different social relationships on\ndetection accuracy, providing novel insights for the identification of social\nbots.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BuZH-TxLnvTQfwn936K-mtU4xGmKM5YoT3g3EMsgcoQ","pdfSize":"1235027"}
