{"id":"2408.16864","title":"The PAU Survey: Enhancing photometric redshift estimation using DEEPz","authors":"I. V. Daza-Perilla, M. Eriksen, D. Navarro-Giron\\'es, E. J. Gonzalez,\n  F. Rodriguez, E. Gazta\\~naga, C. M. Baugh, M. Lares, L. Cabayol-Garcia, F. J.\n  Castander, M. Siudek, A. Wittje, H. Hildebrandt, R. Casas, P.\n  Tallada-Cresp\\'i, J. Garcia-Bellido, E. Sanchez, I. Sevilla-Noarbe, R.\n  Miquel, C. Padilla, P. Renard, J. Carretero and J. De Vicente","authorsParsed":[["Daza-Perilla","I. V.",""],["Eriksen","M.",""],["Navarro-Gironés","D.",""],["Gonzalez","E. J.",""],["Rodriguez","F.",""],["Gaztañaga","E.",""],["Baugh","C. M.",""],["Lares","M.",""],["Cabayol-Garcia","L.",""],["Castander","F. J.",""],["Siudek","M.",""],["Wittje","A.",""],["Hildebrandt","H.",""],["Casas","R.",""],["Tallada-Crespí","P.",""],["Garcia-Bellido","J.",""],["Sanchez","E.",""],["Sevilla-Noarbe","I.",""],["Miquel","R.",""],["Padilla","C.",""],["Renard","P.",""],["Carretero","J.",""],["De Vicente","J.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 19:08:11 GMT"},{"version":"v2","created":"Mon, 9 Sep 2024 15:21:21 GMT"}],"updateDate":"2024-09-10","timestamp":1724958491000,"abstract":"  We present photometric redshifts for 1 341 559 galaxies from the Physics of\nthe Accelerating Universe Survey (PAUS) over 50.38 ${\\rm deg}^{2}$ of sky to\n$i_{\\rm AB}=23$. Redshift estimation is performed using DEEPz, a deep-learning\nphotometric redshift code. We analyse the photometric redshift precision when\nvarying the photometric and spectroscopic samples. Furthermore, we examine\nobservational and instrumental effects on the precision of the photometric\nredshifts, and we compare photometric redshift measurements with those obtained\nusing a template method-fitting BCNz2. Finally, we examine the use of\nphotometric redshifts in the identification of close galaxy pairs. We find that\nthe combination of samples from W1+W3 in the training of DEEPz significantly\nenhances the precision of photometric redshifts. This also occurs when we\nrecover narrow band fluxes using broad bands measurements. We show that DEEPz\ndetermines the redshifts of galaxies in the prevailing spectroscopic catalogue\nused in the training of DEEPz with greater precision. For the faintest galaxies\n($i_{\\rm AB}=21-23$), we find that DEEPz improves over BCNz2 both in terms of\nthe precision (20-50 per cent smaller scatter) and in returning a smaller\noutlier fraction in two of the wide fields. The catalogues were tested for the\nidentification of close galaxy pairs, showing that DEEPz is effective for the\nidentification of close galaxy pairs for samples with $i_{\\rm AB} < 22.5$ and\nredshift $0.2 < z < 0.6$. In addition, identifying close galaxy pairs common\nbetween DEEPz and BCNz2 is a promising approach to improving the purity of the\ncatalogues of these systems.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}