{"id":"2408.07892","title":"Personhood credentials: Artificial intelligence and the value of\n  privacy-preserving tools to distinguish who is real online","authors":"Steven Adler, Zo\\\"e Hitzig, Shrey Jain, Catherine Brewer, Wayne Chang,\n  Ren\\'ee DiResta, Eddy Lazzarin, Sean McGregor, Wendy Seltzer, Divya Siddarth,\n  Nouran Soliman, Tobin South, Connor Spelliscy, Manu Sporny, Varya Srivastava,\n  John Bailey, Brian Christian, Andrew Critch, Ronnie Falcon, Heather Flanagan,\n  Kim Hamilton Duffy, Eric Ho, Claire R. Leibowicz, Srikanth Nadhamuni, Alan Z.\n  Rozenshtein, David Schnurr, Evan Shapiro, Lacey Strahm, Andrew Trask, Zoe\n  Weinberg, Cedric Whitney, Tom Zick","authorsParsed":[["Adler","Steven",""],["Hitzig","Zoë",""],["Jain","Shrey",""],["Brewer","Catherine",""],["Chang","Wayne",""],["DiResta","Renée",""],["Lazzarin","Eddy",""],["McGregor","Sean",""],["Seltzer","Wendy",""],["Siddarth","Divya",""],["Soliman","Nouran",""],["South","Tobin",""],["Spelliscy","Connor",""],["Sporny","Manu",""],["Srivastava","Varya",""],["Bailey","John",""],["Christian","Brian",""],["Critch","Andrew",""],["Falcon","Ronnie",""],["Flanagan","Heather",""],["Duffy","Kim Hamilton",""],["Ho","Eric",""],["Leibowicz","Claire R.",""],["Nadhamuni","Srikanth",""],["Rozenshtein","Alan Z.",""],["Schnurr","David",""],["Shapiro","Evan",""],["Strahm","Lacey",""],["Trask","Andrew",""],["Weinberg","Zoe",""],["Whitney","Cedric",""],["Zick","Tom",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 02:41:25 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 00:38:34 GMT"},{"version":"v3","created":"Mon, 26 Aug 2024 19:02:34 GMT"}],"updateDate":"2024-08-28","timestamp":1723689685000,"abstract":"  Anonymity is an important principle online. However, malicious actors have\nlong used misleading identities to conduct fraud, spread disinformation, and\ncarry out other deceptive schemes. With the advent of increasingly capable AI,\nbad actors can amplify the potential scale and effectiveness of their\noperations, intensifying the challenge of balancing anonymity and\ntrustworthiness online. In this paper, we analyze the value of a new tool to\naddress this challenge: \"personhood credentials\" (PHCs), digital credentials\nthat empower users to demonstrate that they are real people -- not AIs -- to\nonline services, without disclosing any personal information. Such credentials\ncan be issued by a range of trusted institutions -- governments or otherwise. A\nPHC system, according to our definition, could be local or global, and does not\nneed to be biometrics-based. Two trends in AI contribute to the urgency of the\nchallenge: AI's increasing indistinguishability from people online (i.e.,\nlifelike content and avatars, agentic activity), and AI's increasing\nscalability (i.e., cost-effectiveness, accessibility). Drawing on a long\nhistory of research into anonymous credentials and \"proof-of-personhood\"\nsystems, personhood credentials give people a way to signal their\ntrustworthiness on online platforms, and offer service providers new tools for\nreducing misuse by bad actors. In contrast, existing countermeasures to\nautomated deception -- such as CAPTCHAs -- are inadequate against sophisticated\nAI, while stringent identity verification solutions are insufficiently private\nfor many use-cases. After surveying the benefits of personhood credentials, we\nalso examine deployment risks and design challenges. We conclude with\nactionable next steps for policymakers, technologists, and standards bodies to\nconsider in consultation with the public.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ya4qO3XIGBXyHkhzXx0v3hFmoJz4jFabe97_vSNVyC0","pdfSize":"1356521"}
