{"id":"2408.02725","title":"Peculiar dark matter halos inferred from gravitational lensing as a\n  manifestation of modified gravity","authors":"Michal B\\'ilek","authorsParsed":[["Bílek","Michal",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 18:00:01 GMT"},{"version":"v2","created":"Mon, 19 Aug 2024 19:26:20 GMT"}],"updateDate":"2024-08-21","timestamp":1722880801000,"abstract":"  If modified gravity holds, but the weak lensing analysis is done in the\nstandard way, one finds that dark matter halos have peculiar shapes, not\nfollowing the standard Navarro-Frenk-White profiles, and are fully predictable\nfrom the distribution of baryons. Here we study in detail the distribution of\nthe apparent dark matter around point masses, which approximate galaxies and\ngalaxy clusters, and their pairs for the QUMOND MOND gravity, taking an\nexternal gravitational acceleration $g_e$ into account. At large radii, the\napparent halo of a point mass $M$ is shifted against the direction of the\nexternal field. When averaged over all lines-of-sight, the halo has a hollow\ncenter, and denoting the by $a_0$ the MOND acceleration constant, its density\nbehaves like $\\rho(r)=\\sqrt{Ma_0/G}/(4\\pi r^2)$ between the galacticentric\nradii $\\sqrt{GM/a_0}$ and $\\sqrt{GMa_0}/g_e$, and like $\\rho\\propto\nr^{-7}G^2M^3a_0^3/g_e^5$ further away. Between a pair of point masses, there is\na region of a negative apparent dark matter density, whose mass can exceed the\nbaryonic mass of the system. The density of the combined dark matter halo is\nnot a sum of the densities of the halos of the individual points. The density\nhas a singularity near the zero-acceleration point, but remains finite in\nprojection. We compute maps of the surface density and the lensing shear for\nseveral configurations of the problem, and derive formulas to scale them to\nfurther configurations. In general, for a large subset of MOND theories in\ntheir weak field regime, for any configuration of the baryonic mass $M$ with\nthe characteristic size of $d$, the total lensing density scales as\n$\\rho({\\vec{x}})=\\sqrt{Ma_0/G}d^{-2}f\\left(\\vec{\\alpha},\\vec{x}/d,g_ed/\\sqrt{GMa_0}\\right)$,\nwhere the vector $\\vec{\\alpha}$ describes the geometry of the system.\nDistinguishing between QUMOND and cold dark matter seems possible with the\nexisting instruments.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"BiuwDjkIAg6yih0wws-wEnN9m3mOMNmSZ7UmyM5AbMw","pdfSize":"10695205","txDigest":"6gxAQRgufqqnnpbfF4W8bgJZdgLFLXhVS4ZHRzQRnbjM","endEpoch":"1","status":"CERTIFIED"}
