{"id":"2408.07796","title":"Ranking and Combining Latent Structured Predictive Scores without\n  Labeled Data","authors":"Shiva Afshar, Yinghan Chen, Shizhong Han, Ying Lin","authorsParsed":[["Afshar","Shiva",""],["Chen","Yinghan",""],["Han","Shizhong",""],["Lin","Ying",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 20:14:42 GMT"}],"updateDate":"2024-08-16","timestamp":1723666482000,"abstract":"  Combining multiple predictors obtained from distributed data sources to an\naccurate meta-learner is promising to achieve enhanced performance in lots of\nprediction problems. As the accuracy of each predictor is usually unknown,\nintegrating the predictors to achieve better performance is challenging.\nConventional ensemble learning methods assess the accuracy of predictors based\non extensive labeled data. In practical applications, however, the acquisition\nof such labeled data can prove to be an arduous task. Furthermore, the\npredictors under consideration may exhibit high degrees of correlation,\nparticularly when similar data sources or machine learning algorithms were\nemployed during their model training. In response to these challenges, this\npaper introduces a novel structured unsupervised ensemble learning model (SUEL)\nto exploit the dependency between a set of predictors with continuous\npredictive scores, rank the predictors without labeled data and combine them to\nan ensembled score with weights. Two novel correlation-based decomposition\nalgorithms are further proposed to estimate the SUEL model, constrained\nquadratic optimization (SUEL.CQO) and matrix-factorization-based (SUEL.MF)\napproaches. The efficacy of the proposed methods is rigorously assessed through\nboth simulation studies and real-world application of risk genes discovery. The\nresults compellingly demonstrate that the proposed methods can efficiently\nintegrate the dependent predictors to an ensemble model without the need of\nground truth data.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning","Statistics/Applications"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}