{"id":"2408.12364","title":"SAM-SP: Self-Prompting Makes SAM Great Again","authors":"Chunpeng Zhou, Kangjie Ning, Qianqian Shen, Sheng Zhou, Zhi Yu,\n  Haishuai Wang","authorsParsed":[["Zhou","Chunpeng",""],["Ning","Kangjie",""],["Shen","Qianqian",""],["Zhou","Sheng",""],["Yu","Zhi",""],["Wang","Haishuai",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 13:03:05 GMT"}],"updateDate":"2024-08-23","timestamp":1724331785000,"abstract":"  The recently introduced Segment Anything Model (SAM), a Visual Foundation\nModel (VFM), has demonstrated impressive capabilities in zero-shot segmentation\ntasks across diverse natural image datasets. Despite its success, SAM\nencounters noticeably performance degradation when applied to specific domains,\nsuch as medical images. Current efforts to address this issue have involved\nfine-tuning strategies, intended to bolster the generalizability of the vanilla\nSAM. However, these approaches still predominantly necessitate the utilization\nof domain specific expert-level prompts during the evaluation phase, which\nseverely constrains the model's practicality.\n  To overcome this limitation, we introduce a novel self-prompting based\nfine-tuning approach, called SAM-SP, tailored for extending the vanilla SAM\nmodel. Specifically, SAM-SP leverages the output from the previous iteration of\nthe model itself as prompts to guide subsequent iteration of the model. This\nself-prompting module endeavors to learn how to generate useful prompts\nautonomously and alleviates the dependence on expert prompts during the\nevaluation phase, significantly broadening SAM's applicability. Additionally,\nwe integrate a self-distillation module to enhance the self-prompting process\nfurther. Extensive experiments across various domain specific datasets validate\nthe effectiveness of the proposed SAM-SP. Our SAM-SP not only alleviates the\nreliance on expert prompts but also exhibits superior segmentation performance\ncomparing to the state-of-the-art task-specific segmentation approaches, the\nvanilla SAM, and SAM-based approaches.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"yVjWEa6tqgOAyaQ69dzoFhhitltXrRtjKZSCQK6AdGU","pdfSize":"1378968"}
