{"id":"2408.12632","title":"Generative Diffusion Model-based Downscaling of Observed Sea Surface\n  Height over Kuroshio Extension since 2000","authors":"Qiuchang Han, Xingliang Jiang, Yang Zhao, Xudong Wang, Zhijin Li, and\n  Renhe Zhang","authorsParsed":[["Han","Qiuchang",""],["Jiang","Xingliang",""],["Zhao","Yang",""],["Wang","Xudong",""],["Li","Zhijin",""],["Zhang","Renhe",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 13:26:19 GMT"}],"updateDate":"2024-08-26","timestamp":1724333179000,"abstract":"  Satellite altimetry has been widely utilized to monitor global sea surface\ndynamics, enabling investigation of upper ocean variability from basin-scale to\nlocalized eddy ranges. However, the sparse spatial resolution of observational\naltimetry limits our understanding of oceanic submesoscale variability,\nprevalent at horizontal scales below 0.25o resolution. Here, we introduce a\nstate-of-the-art generative diffusion model to train high-resolution sea\nsurface height (SSH) reanalysis data and demonstrate its advantage in\nobservational SSH downscaling over the eddy-rich Kuroshio Extension region. The\ndiffusion-based model effectively downscales raw satellite-interpolated data\nfrom 0.25o resolution to 1/16o, corresponding to approximately 12-km\nwavelength. This model outperforms other high-resolution reanalysis datasets\nand neural network-based methods. Also, it successfully reproduces the spatial\npatterns and power spectra of satellite along-track observations. Our\ndiffusion-based results indicate that eddy kinetic energy at horizontal scales\nless than 250 km has intensified significantly since 2004 in the Kuroshio\nExtension region. These findings underscore the great potential of deep\nlearning in reconstructing satellite altimetry and enhancing our understanding\nof ocean dynamics at eddy scales.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"MWl7vPwrnZbHQo2xjHJoyRSviEAJzo58YN469qKWJkM","pdfSize":"1809065"}
