{"id":"2408.12398","title":"A Comparative Analysis of Faithfulness Metrics and Humans in Citation\n  Evaluation","authors":"Weijia Zhang, Mohammad Aliannejadi, Jiahuan Pei, Yifei Yuan, Jia-Hong\n  Huang, Evangelos Kanoulas","authorsParsed":[["Zhang","Weijia",""],["Aliannejadi","Mohammad",""],["Pei","Jiahuan",""],["Yuan","Yifei",""],["Huang","Jia-Hong",""],["Kanoulas","Evangelos",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 13:44:31 GMT"}],"updateDate":"2024-08-23","timestamp":1724334271000,"abstract":"  Large language models (LLMs) often generate content with unsupported or\nunverifiable content, known as \"hallucinations.\" To address this,\nretrieval-augmented LLMs are employed to include citations in their content,\ngrounding the content in verifiable sources. Despite such developments,\nmanually assessing how well a citation supports the associated statement\nremains a major challenge. Previous studies tackle this challenge by leveraging\nfaithfulness metrics to estimate citation support automatically. However, they\nlimit this citation support estimation to a binary classification scenario,\nneglecting fine-grained citation support in practical scenarios. To investigate\nthe effectiveness of faithfulness metrics in fine-grained scenarios, we propose\na comparative evaluation framework that assesses the metric effectiveness in\ndistinguishing citations between three-category support levels: full, partial,\nand no support. Our framework employs correlation analysis, classification\nevaluation, and retrieval evaluation to measure the alignment between metric\nscores and human judgments comprehensively. Our results indicate no single\nmetric consistently excels across all evaluations, highlighting the complexity\nof accurately evaluating fine-grained support levels. Particularly, we find\nthat the best-performing metrics struggle to distinguish partial support from\nfull or no support. Based on these findings, we provide practical\nrecommendations for developing more effective metrics.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}