{"id":"2408.01631","title":"A Comparative Analysis of Wealth Index Predictions in Africa between\n  three Multi-Source Inference Models","authors":"M\\'arton Karsai, J\\'anos Kert\\'esz, and Lisette Esp\\'in-Noboa","authorsParsed":[["Karsai","Márton",""],["Kertész","János",""],["Espín-Noboa","Lisette",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 02:07:39 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 18:03:46 GMT"}],"updateDate":"2024-09-06","timestamp":1722650859000,"abstract":"  Poverty map inference is a critical area of research, with growing interest\nin both traditional and modern techniques, ranging from regression models to\nconvolutional neural networks applied to tabular data, images, and networks.\nDespite extensive focus on the validation of training phases, the scrutiny of\nfinal predictions remains limited. Here, we compare the Relative Wealth Index\n(RWI) inferred by Chi et al. (2022) with the International Wealth Index (IWI)\ninferred by Lee and Braithwaite (2022) and Esp\\'in-Noboa et al. (2023) across\nsix Sub-Saharan African countries. Our analysis focuses on identifying trends\nand discrepancies in wealth predictions over time. Our results show that the\npredictions by Chi et al. and Esp\\'in-Noboa et al. align with general GDP\ntrends, with differences expected due to the distinct time-frames of the\ntraining sets. However, predictions by Lee and Braithwaite diverge\nsignificantly, indicating potential issues with the validity of the model.\nThese discrepancies highlight the need for policymakers and stakeholders in\nAfrica to rigorously audit models that predict wealth, especially those used\nfor decision-making on the ground. These and other techniques require\ncontinuous verification and refinement to enhance their reliability and ensure\nthat poverty alleviation strategies are well-founded.\n","subjects":["Physics/Physics and Society","Computing Research Repository/Computers and Society","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}