{"id":"2408.11337","title":"Three-dimensional bond-order formation in kagome metals AV$_3$Sb$_5$\n  (A=Cs, Rb, K) analyzed by the density-wave equation method","authors":"Seiichiro Onari, Rina Tazai, Youichi Yamakawa, and Hiroshi Kontani","authorsParsed":[["Onari","Seiichiro",""],["Tazai","Rina",""],["Yamakawa","Youichi",""],["Kontani","Hiroshi",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 04:42:29 GMT"}],"updateDate":"2024-08-22","timestamp":1724215349000,"abstract":"  The mechanism of CDW and its 3D structure are important fundamental issues in\nkagome metals. We have previously shown that, based on a 2D model, $2\\times 2$\nbond order (BO) emerges due to the paramagnon-interference (PMI) mechanism and\nthat its fluctuations lead to $s$-wave superconductivity. This paper studies\nthese issues based on realistic 3D models for kagome metals AV$_3$Sb$_5$ (A=Cs,\nRb, K). We reveal that a commensurate 3D $2\\times 2\\times 2$ BO is caused by\nthe PMI mechanism, by performing the 3D density-wave (DW) equation analysis for\nall A=Cs, Rb, K models in detail. Our results indicate a BO transition\ntemperature $T_{\\rm BO}\\sim 100$K within the regime of moderate electron\ncorrelation. The 3D structure of BO is attributed to the three-dimensionality\nof the Fermi surface, while the 3D structure of BO is sensitively changed since\nthe Fermi surface is quasi-2D. In the DW equation analysis, the most favorable\n3D structure is (i) the alternating vertical stacking BO, where star-of-David\n(SoD) and tri-hexagonal (TrH) patterns stack alternatively. Other candidate is\n(ii) the shift-stacking BO composed of either SoD or TrH pattern. We find that\nthe 3D structure of BO can be determined by the 3rd-order Ginzburg-Landau free\nenergy $b\\phi_1\\phi_2\\phi_3$. Since $b$ depends sensitively on the band\nstructure, both (i) and (ii) can be realized. The present study enhances our\nunderstanding of the rich variety of BOs observed experimentally. It is\nconfirmed that the PMI mechanism is the essential origin of the 3D CDW of\nkagome metals.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}