{"id":"2408.08428","title":"Phononic materials with effectively scale-separated hierarchical\n  features using interpretable machine learning","authors":"Mary V. Bastawrous, Zhi Chen, Alexander C. Ogren, Chiara Daraio,\n  Cynthia Rudin, L. Catherine Brinson","authorsParsed":[["Bastawrous","Mary V.",""],["Chen","Zhi",""],["Ogren","Alexander C.",""],["Daraio","Chiara",""],["Rudin","Cynthia",""],["Brinson","L. Catherine",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 21:35:06 GMT"}],"updateDate":"2024-08-19","timestamp":1723757706000,"abstract":"  Manipulating the dispersive characteristics of vibrational waves is\nbeneficial for many applications, e.g., high-precision instruments. architected\nhierarchical phononic materials have sparked promise tunability of\nelastodynamic waves and vibrations over multiple frequency ranges. In this\narticle, hierarchical unit-cells are obtained, where features at each length\nscale result in a band gap within a targeted frequency range. Our novel\napproach, the ``hierarchical unit-cell template method,'' is an interpretable\nmachine-learning approach that uncovers global unit-cell shape/topology\npatterns corresponding to predefined band-gap objectives. A scale-separation\neffect is observed where the coarse-scale band-gap objective is mostly\nunaffected by the fine-scale features despite the closeness of their length\nscales, thus enabling an efficient hierarchical algorithm. Moreover, the\nhierarchical patterns revealed are not predefined or self-similar hierarchies\nas common in current hierarchical phononic materials. Thus, our approach offers\na flexible and efficient method for the exploration of new regions in the\nhierarchical design space, extracting minimal effective patterns for inverse\ndesign in applications targeting multiple frequency ranges.\n","subjects":["Physics/Applied Physics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"tpnFGAz3zymvkiNacqokfI1c0LIP2Sc3-PfBHh-tQe0","pdfSize":"8948429"}
