{"id":"2408.15882","title":"Recent Decade's Power Outage Data Reveals the Increasing Vulnerability\n  of U.S. Power Infrastructure","authors":"Bo Li, Junwei Ma, Femi Omitaomu, Ali Mostafavi","authorsParsed":[["Li","Bo",""],["Ma","Junwei",""],["Omitaomu","Femi",""],["Mostafavi","Ali",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 15:54:42 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 02:04:36 GMT"}],"updateDate":"2024-08-30","timestamp":1724860482000,"abstract":"  Despite significant anecdotal evidence regarding the vulnerability of the\nU.S. power infrastructure, there is a dearth of longitudinal and nation-level\ncharacterization of the spatial and temporal patterns in the frequency and\nextent of power outages. A data-driven national-level characterization of power\noutage vulnerability is particularly essential for understanding the urgency\nand formulating policies to promote the resilience of power infrastructure\nsystems. Recognizing this, we retrieved 179,053,397 county-level power outage\nrecords with a 15-minute interval across 3,022 US counties during 2014-2023 to\ncapture power outage characteristics. We focus on three dimensions--power\noutage intensity, frequency, and duration--and develop multiple metrics to\nquantify each dimension of power outage vulnerability. The results show that in\nthe past ten years, the vulnerability of U.S. power system has consistently\nbeen increasing. Counties experienced an average of 999.4 outages over the\ndecade, affecting an average of more than 540,000 customers per county, with\ndisruptions occurring approximately every week. Coastal areas, particularly in\nCalifornia, Florida and New Jersey, faced more frequent and prolonged outages,\nwhile inland regions showed higher outage rates. A concerning increase in\noutage frequency and intensity was noted, especially after 2017, with a sharp\nrise in prolonged outages since 2019. The research also found positive\nassociation between social vulnerability and outage metrics, with the\nassociation becoming stronger over the years under study. Areas with higher\nsocial vulnerability experienced more severe and frequent outages, exacerbating\nchallenges in these regions. These findings reveal the much-needed empirical\nevidence for stakeholders to inform policy formulation and program development\nfor enhancing the resilience of the U.S. power infrastructure.\n","subjects":["Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}