{"id":"2408.00482","title":"Centimeter-sized Objects at Micrometer Resolution: Extending\n  Field-of-View in Wavefront Marker X-ray Phase-Contrast Tomography","authors":"Dominik John, Junan Chen, Christoph Ga{\\ss}ner, Sara Savatovi\\'c, Lisa\n  Marie Petzold, Sami Wirtensohn, Mirko Riedel, J\\\"org U. Hammel, Julian\n  Moosmann, Felix Beckmann, Matthias Wieczorek, Julia Herzen","authorsParsed":[["John","Dominik",""],["Chen","Junan",""],["Gaßner","Christoph",""],["Savatović","Sara",""],["Petzold","Lisa Marie",""],["Wirtensohn","Sami",""],["Riedel","Mirko",""],["Hammel","Jörg U.",""],["Moosmann","Julian",""],["Beckmann","Felix",""],["Wieczorek","Matthias",""],["Herzen","Julia",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 11:38:22 GMT"}],"updateDate":"2024-08-02","timestamp":1722512302000,"abstract":"  Recent advancements in propagation-based phase-contrast imaging, such as\nhierarchical imaging, have enabled the visualization of internal structures in\nlarge biological specimens and material samples. However, wavefront\nmarker-based techniques, which provide quantitative electron density\ninformation, face challenges when imaging larger objects due to stringent beam\nstability requirements and potential structural changes in objects during\nlonger measurements. Extending the fields-of-view of these methods is crucial\nfor obtaining comparable quantitative results across beamlines and adapting to\nthe smaller beam profiles of fourth-generation synchrotron sources. We\nintroduce a novel technique combining an adapted eigenflat optimization with\ndeformable image registration to address the challenges and enable quantitative\nhigh-resolution scans of centimeter-sized objects with micrometre resolution.\nWe demonstrate the potential of the method by obtaining an electron density map\nof a rat brain sample 15 mm in diameter using speckle-based imaging, despite\nthe limited horizontal field-of-view of 6 mm of the beamline (PETRA III, P05,\noperated by Hereon at DESY). This showcases the ability of the technique to\nsignificantly widen the range of application of wavefront marker-based\ntechniques in both biological and materials science research.\n","subjects":["Physics/Medical Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/"}