{"id":"2408.10742","title":"Substrate-induced maximum optical chirality of planar dielectric\n  structures","authors":"Maxim V. Gorkunov, Alexander A. Antonov, Alena V. Mamonova, Egor A.\n  Muljarov, and Yuri S. Kivshar","authorsParsed":[["Gorkunov","Maxim V.",""],["Antonov","Alexander A.",""],["Mamonova","Alena V.",""],["Muljarov","Egor A.",""],["Kivshar","Yuri S.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 11:21:39 GMT"}],"updateDate":"2024-08-21","timestamp":1724152899000,"abstract":"  Resonant dielectric planar structures can interact selectively with light of\nparticular helicity thus providing an attractive platform for chiral flat\noptics. The absence of mirror-symmetry planes defines geometric chirality, and\nit remains the main condition for achieving strong circular dichroism. For\nplanar optical structures such as photonic-crystal membranes and metasurfaces,\nbreaking of out-of-plane mirror symmetry is especially challenging, as it\nrequires to fabricate meta-atoms with a tilt, variable height, or vertically\nshifted positions. Although transparent substrates formally break out-of-plane\nmirror symmetries, their optical effect is typically subtle being rarely\nconsidered for enhancing optical chirality. Here we reveal that\nlow-refractive-index substrates can induce up to maximum optical chirality in\notherwise achiral metastructures so that the transparency to waves of one\nhelicity is combined with resonant blocking of waves of the opposite helicity.\nThis effect originates from engineering twisted photonic eigenstates of\ndifferent parities. Our perturbation analysis developed in terms of the\nresonant-state expansion reveals how the eigenstate coupling induced by a\nsubstrate gives rise to a pair of chiral resonances of opposite handedness. Our\ngeneral theory is confirmed by the specific examples of light transmission in\nthe normal and oblique directions by a rotation-symmetric photonic-crystal\nmembrane placed on different transparent substrates.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}