{"id":"2408.06123","title":"DPDETR: Decoupled Position Detection Transformer for Infrared-Visible\n  Object Detection","authors":"Junjie Guo, Chenqiang Gao, Fangcen Liu and Deyu Meng","authorsParsed":[["Guo","Junjie",""],["Gao","Chenqiang",""],["Liu","Fangcen",""],["Meng","Deyu",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 13:05:43 GMT"}],"updateDate":"2024-08-13","timestamp":1723467943000,"abstract":"  Infrared-visible object detection aims to achieve robust object detection by\nleveraging the complementary information of infrared and visible image pairs.\nHowever, the commonly existing modality misalignment problem presents two\nchallenges: fusing misalignment complementary features is difficult, and\ncurrent methods cannot accurately locate objects in both modalities under\nmisalignment conditions. In this paper, we propose a Decoupled Position\nDetection Transformer (DPDETR) to address these problems. Specifically, we\nexplicitly formulate the object category, visible modality position, and\ninfrared modality position to enable the network to learn the intrinsic\nrelationships and output accurate positions of objects in both modalities. To\nfuse misaligned object features accurately, we propose a Decoupled Position\nMultispectral Cross-attention module that adaptively samples and aggregates\nmultispectral complementary features with the constraint of infrared and\nvisible reference positions. Additionally, we design a query-decoupled\nMultispectral Decoder structure to address the optimization gap among the three\nkinds of object information in our task and propose a Decoupled Position\nContrastive DeNosing Training strategy to enhance the DPDETR's ability to learn\ndecoupled positions. Experiments on DroneVehicle and KAIST datasets demonstrate\nsignificant improvements compared to other state-of-the-art methods. The code\nwill be released at https://github.com/gjj45/DPDETR.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}