{"id":"2408.08228","title":"Rethinking Medical Anomaly Detection in Brain MRI: An Image Quality\n  Assessment Perspective","authors":"Zixuan Pan, Jun Xia, Zheyu Yan, Guoyue Xu, Yawen Wu, Zhenge Jia,\n  Jianxu Chen, Yiyu Shi","authorsParsed":[["Pan","Zixuan",""],["Xia","Jun",""],["Yan","Zheyu",""],["Xu","Guoyue",""],["Wu","Yawen",""],["Jia","Zhenge",""],["Chen","Jianxu",""],["Shi","Yiyu",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 15:55:07 GMT"}],"updateDate":"2024-08-16","timestamp":1723737307000,"abstract":"  Reconstruction-based methods, particularly those leveraging autoencoders,\nhave been widely adopted to perform anomaly detection in brain MRI. While most\nexisting works try to improve detection accuracy by proposing new model\nstructures or algorithms, we tackle the problem through image quality\nassessment, an underexplored perspective in the field. We propose a fusion\nquality loss function that combines Structural Similarity Index Measure loss\nwith l1 loss, offering a more comprehensive evaluation of reconstruction\nquality. Additionally, we introduce a data pre-processing strategy that\nenhances the average intensity ratio (AIR) between normal and abnormal regions,\nfurther improving the distinction of anomalies. By fusing the aforementioned\ntwo methods, we devise the image quality assessment (IQA) approach. The\nproposed IQA approach achieves significant improvements (>10%) in terms of Dice\ncoefficient (DICE) and Area Under the Precision-Recall Curve (AUPRC) on the\nBraTS21 (T2, FLAIR) and MSULB datasets when compared with state-of-the-art\nmethods. These results highlight the importance of invoking the comprehensive\nimage quality assessment in medical anomaly detection and provide a new\nperspective for future research in this field.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}