{"id":"2408.05173","title":"Revisiting physical parameters of the benchmark brown dwarf LHS 6343 C\n  through a HST/WFC3 secondary eclipse observation","authors":"William Frost (1 and 2), Lo\\\"ic Albert (1 and 2), Ren\\'e Doyon (1 and\n  2), Jonathan Gagn\\'e (3 and 2), Benjamin T. Montet (4 and 5), Cl\\'emence\n  Fontanive (1 and 2), \\'Etienne Artigau (1 and 2), John Asher Johnson (6),\n  Billy Edwards (7), Bj\\\"orn Benneke (1 and 2) ((1) D\\'epartement de Physique,\n  Universit\\'e de Montr\\'eal, Montr\\'eal, QC, Canada (2) Trottier Institute for\n  Research on Exoplanets, Universit\\'e de Montr\\'eal (3) Plan\\'etarium Rio\n  Tinto Alcan, Espace pour la Vie, Montr\\'eal, QC, Canada (4) School of\n  Physics, University of New South Wales, Sydney, Australia (5) UNSW Data\n  Science Hub, University of New South Wales, Sydney, Australia (6)\n  Harvard-Smithsonian Center for Astrophysics, Cambridge, MA, USA (7) SRON,\n  Netherlands Institute for Space Research, Leiden, The Netherlands)","authorsParsed":[["Frost","William","","1 and 2"],["Albert","Loïc","","1 and 2"],["Doyon","René","","1 and\n  2"],["Gagné","Jonathan","","3 and 2"],["Montet","Benjamin T.","","4 and 5"],["Fontanive","Clémence","","1 and 2"],["Artigau","Étienne","","1 and 2"],["Johnson","John Asher","","1 and 2"],["Edwards","Billy","","1 and 2"],["Benneke","Björn","","1 and 2"]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 16:52:44 GMT"}],"updateDate":"2024-08-12","timestamp":1723222364000,"abstract":"  The LHS 6343 system consists of a resolved M-dwarf binary with an evolved,\nnegligibly irradiated brown dwarf, LHS 6343 C, orbiting the primary star. Such\nbrown dwarf eclipsing binaries present rare and unique opportunities to\ncalibrate sub-stellar evolutionary and atmosphere models since mass, radius,\ntemperature and luminosity can be directly measured. We update this brown\ndwarf's mass (62.6+/-2.2 MJup) and radius (0.788+/-0.043 RJup) using empirical\nstellar relations and a Gaia DR3 distance. We use Hubble Space Telescope/WFC3\nobservations of an LHS 6343 C secondary eclipse to obtain a NIR emission\nspectrum, which matches to a spectral type of T1.5+/-1. We combine this\nspectrum with existing Kepler and Spitzer/IRAC secondary eclipse photometry to\nperform atmospheric characterization using the ATMO-2020, Sonora-Bobcat and\nBT-Settl model grids. ATMO-2020 models with strong non-equilibrium chemistry\nyield the best fit to observations across all modelled bandpasses while\npredicting physical parameters consistent with Gaia-dependant analogs. BT-Settl\npredicts values slightly more consistent with such analogs but offers a\nsignificantly poorer fit to the WFC3 spectrum. Finally, we obtain a\nsemi-empirical measurement of LHS 6343 C's apparent luminosity by integrating\nits observed and modelled spectral energy distribution. Applying knowledge of\nthe system's distance yields a bolometric luminosity of log(Lbol/Lsun) =\n-4.77+/-0.03 and, applying the Stefan-Boltzmann law for the known radius, an\neffective temperature of 1303+/-29 K. We also use the ATMO-2020 and\nSonora-Bobcat evolutionary model grids to infer an age for LHS 6343 C of 2.86\n+0.40-0.33 Gyr and 3.11 +0.50-0.38 Gyr respectively.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}