{"id":"2408.04031","title":"Evaluating Force-based Haptics for Immersive Tangible Interactions with\n  Surface Visualizations","authors":"Hamza Afzaal and Usman Alim","authorsParsed":[["Afzaal","Hamza",""],["Alim","Usman",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 18:26:53 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 03:09:43 GMT"},{"version":"v3","created":"Mon, 9 Sep 2024 22:14:29 GMT"}],"updateDate":"2024-09-11","timestamp":1723055213000,"abstract":"  Haptic feedback provides an essential sensory stimulus crucial for\ninteraction and analyzing three-dimensional spatio-temporal phenomena on\nsurface visualizations. Given its ability to provide enhanced spatial\nperception and scene maneuverability, virtual reality (VR) catalyzes haptic\ninteractions on surface visualizations. Various interaction modes, encompassing\nboth mid-air and on-surface interactions -- with or without the application of\nassisting force stimuli -- have been explored using haptic force feedback\ndevices. In this paper, we evaluate the use of on-surface and assisted\non-surface haptic modes of interaction compared to a no-haptic interaction\nmode. A force-based haptic stylus is used for all three modalities; the\non-surface mode uses collision based forces, whereas the assisted on-surface\nmode is accompanied by an additional snapping force. We conducted a\nwithin-subjects user study involving fundamental interaction tasks performed on\nsurface visualizations. Keeping a consistent visual design across all three\nmodes, our study incorporates tasks that require the localization of the\nhighest, lowest, and random points on surfaces; and tasks that focus on\nbrushing curves on surfaces with varying complexity and occlusion levels. Our\nfindings show that participants took almost the same time to brush curves using\nall the interaction modes. They could draw smoother curves using the on-surface\ninteraction modes compared to the no-haptic mode. However, the assisted\non-surface mode provided better accuracy than the on-surface mode. The\non-surface mode was slower in point localization, but the accuracy depended on\nthe visual cues and occlusions associated with the tasks. Finally, we discuss\nparticipant feedback on using haptic force feedback as a tangible input\nmodality and share takeaways to aid the design of haptics-based tangible\ninteractions for surface visualizations.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Sx_QQUflJLrVPpsL2c0aBVnOn6Vc57LdcfhymavwWVE","pdfSize":"12946398"}
