{"id":"2408.15118","title":"DIFR3CT: Latent Diffusion for Probabilistic 3D CT Reconstruction from\n  Few Planar X-Rays","authors":"Yiran Sun, Hana Baroudi, Tucker Netherton, Laurence Court, Osama\n  Mawlawi, Ashok Veeraraghavan, Guha Balakrishnan","authorsParsed":[["Sun","Yiran",""],["Baroudi","Hana",""],["Netherton","Tucker",""],["Court","Laurence",""],["Mawlawi","Osama",""],["Veeraraghavan","Ashok",""],["Balakrishnan","Guha",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 14:58:08 GMT"}],"updateDate":"2024-08-28","timestamp":1724770688000,"abstract":"  Computed Tomography (CT) scans are the standard-of-care for the visualization\nand diagnosis of many clinical ailments, and are needed for the treatment\nplanning of external beam radiotherapy. Unfortunately, the availability of CT\nscanners in low- and mid-resource settings is highly variable. Planar x-ray\nradiography units, in comparison, are far more prevalent, but can only provide\nlimited 2D observations of the 3D anatomy. In this work we propose DIFR3CT, a\n3D latent diffusion model, that can generate a distribution of plausible CT\nvolumes from one or few (<10) planar x-ray observations. DIFR3CT works by\nfusing 2D features from each x-ray into a joint 3D space, and performing\ndiffusion conditioned on these fused features in a low-dimensional latent\nspace. We conduct extensive experiments demonstrating that DIFR3CT is better\nthan recent sparse CT reconstruction baselines in terms of standard pixel-level\n(PSNR, SSIM) on both the public LIDC and in-house post-mastectomy CT datasets.\nWe also show that DIFR3CT supports uncertainty quantification via Monte Carlo\nsampling, which provides an opportunity to measure reconstruction reliability.\nFinally, we perform a preliminary pilot study evaluating DIFR3CT for automated\nbreast radiotherapy contouring and planning -- and demonstrate promising\nfeasibility. Our code is available at https://github.com/yransun/DIFR3CT.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}