{"id":"2408.03706","title":"Local Topology Measures of Contextual Language Model Latent Spaces With\n  Applications to Dialogue Term Extraction","authors":"Benjamin Matthias Ruppik, Michael Heck, Carel van Niekerk, Renato\n  Vukovic, Hsien-chin Lin, Shutong Feng, Marcus Zibrowius, Milica Ga\\v{s}i\\'c","authorsParsed":[["Ruppik","Benjamin Matthias",""],["Heck","Michael",""],["van Niekerk","Carel",""],["Vukovic","Renato",""],["Lin","Hsien-chin",""],["Feng","Shutong",""],["Zibrowius","Marcus",""],["Gašić","Milica",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 11:44:32 GMT"}],"updateDate":"2024-08-08","timestamp":1723031072000,"abstract":"  A common approach for sequence tagging tasks based on contextual word\nrepresentations is to train a machine learning classifier directly on these\nembedding vectors. This approach has two shortcomings. First, such methods\nconsider single input sequences in isolation and are unable to put an\nindividual embedding vector in relation to vectors outside the current local\ncontext of use. Second, the high performance of these models relies on\nfine-tuning the embedding model in conjunction with the classifier, which may\nnot always be feasible due to the size or inaccessibility of the underlying\nfeature-generation model. It is thus desirable, given a collection of embedding\nvectors of a corpus, i.e., a datastore, to find features of each vector that\ndescribe its relation to other, similar vectors in the datastore. With this in\nmind, we introduce complexity measures of the local topology of the latent\nspace of a contextual language model with respect to a given datastore. The\neffectiveness of our features is demonstrated through their application to\ndialogue term extraction. Our work continues a line of research that explores\nthe manifold hypothesis for word embeddings, demonstrating that local structure\nin the space carved out by word embeddings can be exploited to infer semantic\nproperties.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"8gRAWzxTzNSk5_xDUIazCsXLO5dPT_L81S9xEXMUK-A","pdfSize":"1306034"}
