{"id":"2408.16350","title":"Adiabatic Mass Loss in Binary Stars. V. Effects of Metallicity and\n  Nonconservative Mass Transfer -- Application in High Mass X-ray Binaries","authors":"Hongwei Ge, Christopher Adam Tout, Xuefei Chen, Song Wang, Jianping\n  Xiong, Lifu Zhang, Qingzhong Liu, Zhanwen Han","authorsParsed":[["Ge","Hongwei",""],["Tout","Christopher Adam",""],["Chen","Xuefei",""],["Wang","Song",""],["Xiong","Jianping",""],["Zhang","Lifu",""],["Liu","Qingzhong",""],["Han","Zhanwen",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 08:36:24 GMT"}],"updateDate":"2024-08-30","timestamp":1724920584000,"abstract":"  Binary stars are responsible for many unusual astrophysical phenomena,\nincluding some important explosive cosmic events. The stability criteria for\nrapid mass transfer and common-envelope evolution are fundamental to binary\nstar evolution. They determine the mass, mass ratio, and orbital distribution\nof systems such as X-ray binaries and merging gravitational-wave sources. We\nuse our adiabatic mass-loss model to systematically survey metal-poor and\nsolar-metallicity donor thresholds for dynamical timescale mass transfer. The\ncritical mass ratios qad are systematically explored, and the impact of\nmetallicity and nonconservative mass transfer are studied. For metal-poor\nradiative-envelope donors, qad are smaller than those for solar-metallicity\nstars at the same evolutionary stage. However, qad do the opposite for\nconvective-envelope donors. Nonconservative mass transfer significantly\ndecreases qad for massive donors. This is because it matters how conservative\nmass transfer is during the thermal timescale phase immediately preceding a\ndelayed dynamical mass transfer. We apply our theoretical predictions to\nobserved high-mass X-ray binaries that have overfilled their Roche lobes and\nfind a good agreement with their mass ratios. Our results can be applied to\nstudy individual binary objects or large samples of binary objects with binary\npopulation synthesis codes.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}