{"id":"2408.00057","title":"GOProteinGNN: Leveraging Protein Knowledge Graphs for Protein\n  Representation Learning","authors":"Dan Kalifa, Uriel Singer, Kira Radinsky","authorsParsed":[["Kalifa","Dan",""],["Singer","Uriel",""],["Radinsky","Kira",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 17:54:22 GMT"}],"updateDate":"2024-08-02","timestamp":1722448462000,"abstract":"  Proteins play a vital role in biological processes and are indispensable for\nliving organisms. Accurate representation of proteins is crucial, especially in\ndrug development. Recently, there has been a notable increase in interest in\nutilizing machine learning and deep learning techniques for unsupervised\nlearning of protein representations. However, these approaches often focus\nsolely on the amino acid sequence of proteins and lack factual knowledge about\nproteins and their interactions, thus limiting their performance. In this\nstudy, we present GOProteinGNN, a novel architecture that enhances protein\nlanguage models by integrating protein knowledge graph information during the\ncreation of amino acid level representations. Our approach allows for the\nintegration of information at both the individual amino acid level and the\nentire protein level, enabling a comprehensive and effective learning process\nthrough graph-based learning. By doing so, we can capture complex relationships\nand dependencies between proteins and their functional annotations, resulting\nin more robust and contextually enriched protein representations. Unlike\nprevious fusion methods, GOProteinGNN uniquely learns the entire protein\nknowledge graph during training, which allows it to capture broader relational\nnuances and dependencies beyond mere triplets as done in previous work. We\nperform a comprehensive evaluation on several downstream tasks demonstrating\nthat GOProteinGNN consistently outperforms previous methods, showcasing its\neffectiveness and establishing it as a state-of-the-art solution for protein\nrepresentation learning.\n","subjects":["Quantitative Biology/Biomolecules","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"dEPvRRTjKYypF95fJjvcbRls27mX_aJ6vwDGpVPLbEU","pdfSize":"1614780","txDigest":"3x6Kst4fuEoWneNYMzwdh6Rj4KGfqQHYMdGmMKGb22LW","endEpoch":"100","status":"CERTIFIED"}
