{"id":"2408.17040","title":"Model-based clustering for covariance matrices via penalized Wishart\n  mixture models","authors":"Andrea Cappozzo and Alessandro Casa","authorsParsed":[["Cappozzo","Andrea",""],["Casa","Alessandro",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 06:36:42 GMT"}],"updateDate":"2024-09-02","timestamp":1724999802000,"abstract":"  Covariance matrices provide a valuable source of information about complex\ninteractions and dependencies within the data. However, from a clustering\nperspective, this information has often been underutilized and overlooked.\nIndeed, commonly adopted distance-based approaches tend to rely primarily on\nmean levels to characterize and differentiate between groups. Recently, there\nhave been promising efforts to cluster covariance matrices directly, thereby\ndistinguishing groups solely based on the relationships between variables. From\na model-based perspective, a probabilistic formalization has been provided by\nconsidering a mixture model with component densities following a Wishart\ndistribution. Notwithstanding, this approach faces challenges when dealing with\na large number of variables, as the number of parameters to be estimated\nincreases quadratically. To address this issue, we propose a sparse Wishart\nmixture model, which assumes that the component scale matrices possess a\ncluster-dependent degree of sparsity. Model estimation is performed by\nmaximizing a penalized log-likelihood, enforcing a covariance graphical lasso\npenalty on the component scale matrices. This penalty not only reduces the\nnumber of non-zero parameters, mitigating the challenges of high-dimensional\nsettings, but also enhances the interpretability of results by emphasizing the\nmost relevant relationships among variables. The proposed methodology is tested\non both simulated and real data, demonstrating its ability to unravel the\ncomplexities of neuroimaging data and effectively cluster subjects based on the\nrelational patterns among distinct brain regions.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/"}