{"id":"2408.10656","title":"deepmriprep: Voxel-based Morphometry (VBM) Preprocessing via Deep Neural\n  Networks","authors":"Lukas Fisch, Nils R. Winter, Janik Goltermann, Carlotta Barkhau,\n  Daniel Emden, Jan Ernsting, Maximilian Konowski, Ramona Leenings, Tiana\n  Borgers, Kira Flinkenfl\\\"ugel, Dominik Grotegerd, Anna Kraus, Elisabeth J.\n  Leehr, Susanne Meinert, Frederike Stein, Lea Teutenberg, Florian\n  Thomas-Odenthal, Paula Usemann, Marco Hermesdorf, Hamidreza Jamalabadi,\n  Andreas Jansen, Igor Nenadic, Benjamin Straube, Tilo Kircher, Klaus Berger,\n  Benjamin Risse, Udo Dannlowski, Tim Hahn","authorsParsed":[["Fisch","Lukas",""],["Winter","Nils R.",""],["Goltermann","Janik",""],["Barkhau","Carlotta",""],["Emden","Daniel",""],["Ernsting","Jan",""],["Konowski","Maximilian",""],["Leenings","Ramona",""],["Borgers","Tiana",""],["Flinkenflügel","Kira",""],["Grotegerd","Dominik",""],["Kraus","Anna",""],["Leehr","Elisabeth J.",""],["Meinert","Susanne",""],["Stein","Frederike",""],["Teutenberg","Lea",""],["Thomas-Odenthal","Florian",""],["Usemann","Paula",""],["Hermesdorf","Marco",""],["Jamalabadi","Hamidreza",""],["Jansen","Andreas",""],["Nenadic","Igor",""],["Straube","Benjamin",""],["Kircher","Tilo",""],["Berger","Klaus",""],["Risse","Benjamin",""],["Dannlowski","Udo",""],["Hahn","Tim",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 08:51:09 GMT"}],"updateDate":"2024-08-21","timestamp":1724143869000,"abstract":"  Voxel-based Morphometry (VBM) has emerged as a powerful approach in\nneuroimaging research, utilized in over 7,000 studies since the year 2000.\nUsing Magnetic Resonance Imaging (MRI) data, VBM assesses variations in the\nlocal density of brain tissue and examines its associations with biological and\npsychometric variables. Here, we present deepmriprep, a neural network-based\npipeline that performs all necessary preprocessing steps for VBM analysis of\nT1-weighted MR images using deep neural networks. Utilizing the Graphics\nProcessing Unit (GPU), deepmriprep is 37 times faster than CAT12, the leading\nVBM preprocessing toolbox. The proposed method matches CAT12 in accuracy for\ntissue segmentation and image registration across more than 100 datasets and\nshows strong correlations in VBM results. Tissue segmentation maps from\ndeepmriprep have over 95% agreement with ground truth maps, and its non-linear\nregistration, using supervised SYMNet, predicts smooth deformation fields\ncomparable to CAT12. The high processing speed of deepmriprep enables rapid\npreprocessing of extensive datasets and thereby fosters the application of VBM\nanalysis to large-scale neuroimaging studies and opens the door to real-time\napplications. Finally, deepmripreps straightforward, modular design enables\nresearchers to easily understand, reuse, and advance the underlying methods,\nfostering further advancements in neuroimaging research. deepmriprep can be\nconveniently installed as a Python package and is publicly accessible at\nhttps://github.com/wwu-mmll/deepmriprep.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Vbz87EUBeO6tCXAy1Jg9wcoi6QQSumwaZkUnQ9pVc8k","pdfSize":"6622583"}
