{"id":"2408.00940","title":"A dual-task mutual learning framework for predicting post-thrombectomy\n  cerebral hemorrhage","authors":"Caiwen Jiang, Tianyu Wang, Xiaodan Xing, Mianxin Liu, Guang Yang,\n  Zhongxiang Ding, Dinggang Shen","authorsParsed":[["Jiang","Caiwen",""],["Wang","Tianyu",""],["Xing","Xiaodan",""],["Liu","Mianxin",""],["Yang","Guang",""],["Ding","Zhongxiang",""],["Shen","Dinggang",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 22:08:52 GMT"}],"updateDate":"2024-08-05","timestamp":1722550132000,"abstract":"  Ischemic stroke is a severe condition caused by the blockage of brain blood\nvessels, and can lead to the death of brain tissue due to oxygen deprivation.\nThrombectomy has become a common treatment choice for ischemic stroke due to\nits immediate effectiveness. But, it carries the risk of postoperative cerebral\nhemorrhage. Clinically, multiple CT scans within 0-72 hours post-surgery are\nused to monitor for hemorrhage. However, this approach exposes radiation dose\nto patients, and may delay the detection of cerebral hemorrhage. To address\nthis dilemma, we propose a novel prediction framework for measuring\npostoperative cerebral hemorrhage using only the patient's initial CT scan.\nSpecifically, we introduce a dual-task mutual learning framework to takes the\ninitial CT scan as input and simultaneously estimates both the follow-up CT\nscan and prognostic label to predict the occurrence of postoperative cerebral\nhemorrhage. Our proposed framework incorporates two attention mechanisms, i.e.,\nself-attention and interactive attention. Specifically, the self-attention\nmechanism allows the model to focus more on high-density areas in the image,\nwhich are critical for diagnosis (i.e., potential hemorrhage areas). The\ninteractive attention mechanism further models the dependencies between the\ninterrelated generation and classification tasks, enabling both tasks to\nperform better than the case when conducted individually. Validated on clinical\ndata, our method can generate follow-up CT scans better than state-of-the-art\nmethods, and achieves an accuracy of 86.37% in predicting follow-up prognostic\nlabels. Thus, our work thus contributes to the timely screening of\npost-thrombectomy cerebral hemorrhage, and could significantly reform the\nclinical process of thrombectomy and other similar operations related to\nstroke.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}