{"id":"2408.06647","title":"Magnetic Field of the Quasar 1604+159 from Parsec to Kilo-parsec Scale","authors":"Xu-Zhi Hu, Xiaoyu Hong, Wei Zhao, Liang Chen, Wei-Yang Wang, and\n  Linhui Wu","authorsParsed":[["Hu","Xu-Zhi",""],["Hong","Xiaoyu",""],["Zhao","Wei",""],["Chen","Liang",""],["Wang","Wei-Yang",""],["Wu","Linhui",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 05:36:49 GMT"}],"updateDate":"2024-08-14","timestamp":1723527409000,"abstract":"  We present a multi-frequency polarimetric study for the quasar 1604+159. The\nsource was observed at the $L$ band with the American Very Long Baseline Array\n(VLBA) and the $L$, $X$, and $U$ bands with the Very Large Array (VLA). These\nobservations provide different resolutions from mas to arcsec, enabling us to\nprobe the morphology and magnetic field from tens of parsec to hundreds of\nkilo-parsec scale. We detect a symmetrical Fanaroff-Riley-Class-I-like\nstructure. The source has several lobes and bulges, forming a cocoon shape. The\npolarization is normal to the edges of the structure with high fractional\npolarization up to $\\sim 60\\%$. Two hotspots are observed at the eastern and\nwestern sides of the source, located symmetrically relative to the core. The\nflux density ratio ($>1.5$) between the two hotspots suggests the Doppler\nbeaming effect exists at a large scale. The polarized emission in the hotspots\nalso shows a symmetrical structure with an oblique direction from the jet\ndirection. In general, the jet propagates in a collimating structure with\nseveral bends. Polarization is also detected perpendicular to the local jet\nfrom $\\sim$100 mas to $\\sim$ 1 arcsec. The jet shows strong polarized intensity\nand high fractional polarization at the bending edges. We discuss the possible\norigins of the observed structure and magnetic field.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}