{"id":"2408.01271","title":"HRFT: Mining High-Frequency Risk Factor Collections End-to-End via\n  Transformer","authors":"Wenyan Xu, Rundong Wang, Chen Li, Yonghong Hu and Zhonghua Lu","authorsParsed":[["Xu","Wenyan",""],["Wang","Rundong",""],["Li","Chen",""],["Hu","Yonghong",""],["Lu","Zhonghua",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 13:47:51 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 14:01:33 GMT"}],"updateDate":"2024-08-06","timestamp":1722606471000,"abstract":"  In quantitative trading, it is common to find patterns in short term volatile\ntrends of the market. These patterns are known as High Frequency (HF) risk\nfactors, serving as key indicators of future stock price volatility.\nTraditionally, these risk factors were generated by financial models relying\nheavily on domain-specific knowledge manually added rather than extensive\nmarket data. Inspired by symbolic regression (SR), which infers mathematical\nlaws from data, we treat the extraction of formulaic risk factors from\nhigh-frequency trading (HFT) market data as an SR task. In this paper, we\nchallenge the manual construction of risk factors and propose an end-to-end\nmethodology, Intraday Risk Factor Transformer (IRFT), to directly predict\ncomplete formulaic factors, including constants. We use a hybrid\nsymbolic-numeric vocabulary where symbolic tokens represent operators/stock\nfeatures and numeric tokens represent constants. We train a Transformer model\non the HFT dataset to generate complete formulaic HF risk factors without\nrelying on a predefined skeleton of operators. It determines the general shape\nof the stock volatility law up to a choice of constants. We refine the\npredicted constants (a, b) using the Broyden Fletcher Goldfarb Shanno algorithm\n(BFGS) to mitigate non-linear issues. Compared to the 10 approaches in SRBench,\na living benchmark for SR, IRFT gains a 30% excess investment return on the\nHS300 and SP500 datasets, with inference times orders of magnitude faster than\ntheirs in HF risk factor mining tasks.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3wB5AMHsJ4WWUO6_VnT2_e8UHOGq-qJcqdxnbgIq-1A","pdfSize":"697720"}
