{"id":"2408.07483","title":"Visualization Atlases: Explaining and Exploring Complex Topics through\n  Data, Visualization, and Narration","authors":"Jinrui Wang, Xinhuan Shu, Benjamin Bach, Uta Hinrichs","authorsParsed":[["Wang","Jinrui",""],["Shu","Xinhuan",""],["Bach","Benjamin",""],["Hinrichs","Uta",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 11:55:50 GMT"}],"updateDate":"2024-08-15","timestamp":1723636550000,"abstract":"  This paper defines, analyzes, and discusses the emerging genre of\nvisualization atlases. We currently witness an increase in web-based,\ndata-driven initiatives that call themselves \"atlases\" while explaining\ncomplex, contemporary issues through data and visualizations: climate change,\nsustainability, AI, or cultural discoveries. To understand this emerging genre\nand inform their design, study, and authoring support, we conducted a\nsystematic analysis of 33 visualization atlases and semi-structured interviews\nwith eight visualization atlas creators. Based on our results, we contribute\n(1) a definition of a visualization atlas as a compendium of (web) pages aimed\nat explaining and supporting exploration of data about a dedicated topic\nthrough data, visualizations and narration. (2) a set of design patterns of 8\ndesign dimensions, (3) insights into the atlas creation from interviews and (4)\nthe definition of 5 visualization atlas genres. We found that visualization\natlases are unique in the way they combine i) exploratory visualization, ii)\nnarrative elements from data-driven storytelling and iii) structured navigation\nmechanisms. They target a wide range of audiences with different levels of\ndomain knowledge, acting as tools for study, communication, and discovery. We\nconclude with a discussion of current design practices and emerging questions\naround the ethics and potential real-world impact of visualization atlases,\naimed to inform the design and study of visualization atlases.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}