{"id":"2408.12833","title":"S3Simulator: A benchmarking Side Scan Sonar Simulator dataset for\n  Underwater Image Analysis","authors":"Kamal Basha S and Athira Nambiar","authorsParsed":[["S","Kamal Basha",""],["Nambiar","Athira",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 04:41:20 GMT"}],"updateDate":"2024-08-26","timestamp":1724388080000,"abstract":"  Acoustic sonar imaging systems are widely used for underwater surveillance in\nboth civilian and military sectors. However, acquiring high-quality sonar\ndatasets for training Artificial Intelligence (AI) models confronts challenges\nsuch as limited data availability, financial constraints, and data\nconfidentiality. To overcome these challenges, we propose a novel benchmark\ndataset of Simulated Side-Scan Sonar images, which we term as 'S3Simulator\ndataset'. Our dataset creation utilizes advanced simulation techniques to\naccurately replicate underwater conditions and produce diverse synthetic sonar\nimaging. In particular, the cutting-edge AI segmentation tool i.e. Segment\nAnything Model (SAM) is leveraged for optimally isolating and segmenting the\nobject images, such as ships and planes, from real scenes. Further, advanced\nComputer-Aided Design tools i.e. SelfCAD and simulation software such as Gazebo\nare employed to create the 3D model and to optimally visualize within realistic\nenvironments, respectively. Further, a range of computational imaging\ntechniques are employed to improve the quality of the data, enabling the AI\nmodels for the analysis of the sonar images. Extensive analyses are carried out\non S3simulator as well as real sonar datasets to validate the performance of AI\nmodels for underwater object classification. Our experimental results highlight\nthat the S3Simulator dataset will be a promising benchmark dataset for research\non underwater image analysis. https://github.com/bashakamal/S3Simulator.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ytmARU_cGhZCHq2otw57EK5lOIAiE7mTlZBwvMbbgqU","pdfSize":"15027107"}
