{"id":"2408.09397","title":"Combo: Co-speech holistic 3D human motion generation and efficient\n  customizable adaptation in harmony","authors":"Chao Xu, Mingze Sun, Zhi-Qi Cheng, Fei Wang, Yang Liu, Baigui Sun,\n  Ruqi Huang, Alexander Hauptmann","authorsParsed":[["Xu","Chao",""],["Sun","Mingze",""],["Cheng","Zhi-Qi",""],["Wang","Fei",""],["Liu","Yang",""],["Sun","Baigui",""],["Huang","Ruqi",""],["Hauptmann","Alexander",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 07:48:49 GMT"}],"updateDate":"2024-08-20","timestamp":1723967329000,"abstract":"  In this paper, we propose a novel framework, Combo, for harmonious co-speech\nholistic 3D human motion generation and efficient customizable adaption. In\nparticular, we identify that one fundamental challenge as the\nmultiple-input-multiple-output (MIMO) nature of the generative model of\ninterest. More concretely, on the input end, the model typically consumes both\nspeech signals and character guidance (e.g., identity and emotion), which not\nonly poses challenge on learning capacity but also hinders further adaptation\nto varying guidance; on the output end, holistic human motions mainly consist\nof facial expressions and body movements, which are inherently correlated but\nnon-trivial to coordinate in current data-driven generation process. In\nresponse to the above challenge, we propose tailored designs to both ends. For\nthe former, we propose to pre-train on data regarding a fixed identity with\nneutral emotion, and defer the incorporation of customizable conditions\n(identity and emotion) to fine-tuning stage, which is boosted by our novel\nX-Adapter for parameter-efficient fine-tuning. For the latter, we propose a\nsimple yet effective transformer design, DU-Trans, which first divides into two\nbranches to learn individual features of face expression and body movements,\nand then unites those to learn a joint bi-directional distribution and directly\npredicts combined coefficients. Evaluated on BEAT2 and SHOW datasets, Combo is\nhighly effective in generating high-quality motions but also efficient in\ntransferring identity and emotion. Project website:\n\\href{https://xc-csc101.github.io/combo/}{Combo}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}