{"id":"2408.05308","title":"Moving past point-contacts: Extending the ALIP model to humanoids with\n  non-trivial feet using hierarchical, full-body momentum control","authors":"Victor C. Paredes, Daniel A. Hagen, Samuel W. Chesebrough, Riley\n  Swann, Denis Garagic, Ayonga Hereid","authorsParsed":[["Paredes","Victor C.",""],["Hagen","Daniel A.",""],["Chesebrough","Samuel W.",""],["Swann","Riley",""],["Garagic","Denis",""],["Hereid","Ayonga",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 19:10:13 GMT"}],"updateDate":"2024-08-13","timestamp":1723230613000,"abstract":"  The Angular-Momentum Linear Inverted Pendulum (ALIP) model is a promising\nmotion planner for bipedal robots. However, it relies on two assumptions: (1)\nthe robot has point-contact feet or passive ankles, and (2) the angular\nmomentum around the center of mass, known as centroidal angular momentum, is\nnegligible. This paper addresses the question of whether the ALIP paradigm can\nbe applied to more general bipedal systems with complex foot geometry (e.g.,\nflat feet) and nontrivial torso/limb inertia and mass distribution (e.g.,\nnon-centralized arms). In such systems, the dynamics introduce non-negligible\ncentroidal momentum and contact wrenches at the feet, rendering the assumptions\nof the ALIP model invalid. This paper presents the ALIP planner for general\nbipedal robots with non-point-contact feet through the use of a task-space\nwhole-body controller that regulates centroidal momentum, thereby ensuring that\nthe robot's behavior aligns with the desired template dynamics. To demonstrate\nthe effectiveness of our proposed approach, we conduct simulations using the\nSarcos Guardian XO robot, which is a hybrid humanoid/exoskeleton with large,\noffset feet. The results demonstrate the practicality and effectiveness of our\napproach in achieving stable and versatile bipedal locomotion.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}