{"id":"2408.14320","title":"Characterizing Vehicle-Induced Distributed Acoustic Sensing Signals for\n  Accurate Urban Near-Surface Imaging","authors":"Jingxiao Liu, Haipeng Li, Siyuan Yuan, Hae Young Noh, Biondo Biondi","authorsParsed":[["Liu","Jingxiao",""],["Li","Haipeng",""],["Yuan","Siyuan",""],["Noh","Hae Young",""],["Biondi","Biondo",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 14:51:34 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 15:23:55 GMT"}],"updateDate":"2024-09-04","timestamp":1724683894000,"abstract":"  Continuous seismic monitoring of the near-surface structure is crucial for\nurban infrastructure safety, aiding in the detection of sinkholes, subsidence,\nand other seismic hazards. Utilizing existing telecommunication optical fibers\nas Distributed Acoustic Sensing (DAS) systems offers a cost-effective method\nfor creating dense seismic arrays in urban areas. DAS leverages roadside\nfiber-optic cables to record vehicle-induced surface waves for near-surface\nimaging. However, the influence of roadway vehicle characteristics on their\ninduced surface waves and the resulting imaging of near-surface structures is\npoorly understood. We investigate surface waves generated by vehicles of\nvarying weights and speeds to provide insights into accurate and efficient\nnear-surface characterization. We first classify vehicles into light,\nmid-weight, and heavy based on the maximum amplitudes of quasi-static DAS\nrecords. Vehicles are also classified by their traveling speed using their\narrival times at DAS channels. To investigate how vehicle characteristics\ninfluence the induced surface waves, we extract phase velocity dispersion and\ninvert the subsurface structure for each vehicle class by retrieving virtual\nshot gathers (VSGs). Our results reveal that heavy vehicles produce higher\nsignal-to-noise ratio surface waves, and a sevenfold increase in vehicle weight\ncan reduce uncertainties in phase velocity measurements from dispersion spectra\nby up to 3X. Thus, data from heavy vehicles better constrain structures at\ngreater depths. Additionally, with driving speeds ranging from 5 to 30 meters\nper second in our study, differences in the dispersion curves due to vehicle\nspeed are less pronounced than those due to vehicle weight. Our results suggest\njudiciously selecting and processing surface wave signals from certain vehicle\ntypes can improve the quality of near-surface imaging in urban environments.\n","subjects":["Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}