{"id":"2408.02127","title":"Automatic Platform Configuration and Software Integration for\n  Software-Defined Vehicles","authors":"Fengjunjie Pan, Jianjie Lin, Markus Rickert","authorsParsed":[["Pan","Fengjunjie",""],["Lin","Jianjie",""],["Rickert","Markus",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 19:54:03 GMT"}],"updateDate":"2024-08-06","timestamp":1722801243000,"abstract":"  In the automotive industry, platform configuration and software integration\nare mostly manual tasks performed during the development phase, requiring\nconsideration of various safety and non-safety requirements. This manual\nprocess often leads to prolonged development cycles and provides limited\nflexibility. This paper introduces a novel approach to automate platform\nconfiguration and software integration for software-defined vehicles (SDVs),\nshifting these activities from the development phase to runtime. Our approach\nfeatures an integration manager that combines model-based methods and\nvirtualization technologies to generate and execute deployment plans. By\nleveraging model-based systems engineering (MBSE), our method automatically\ngenerates platform configuration and software integration plans, which are then\nconverted into deployment-ready formats using code generation techniques.\nUtilizing virtualization and container orchestration technologies, the proposed\nsystem enables dynamic and flexible resource allocation while ensuring\ncompliance with safety requirements. Communication between the development and\nruntime platforms is facilitated via a REST API. A proof of concept was\nimplemented on a simulated SDV platform with the Intel Whiskey Lake Board. This\ndemonstration showcases the integration manager on an SDV with a central\ncomputer, highlighting the potential to shorten development cycles and adapt to\ndiverse vehicle configurations.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TKMmLQVnJs-RatVfnh_r--jfXRUAMIBhfQ8iu8wnKNw","pdfSize":"377393","txDigest":"92u7V5cmR3t5cxHYKQpsfaibXKjARVbYrPsAsUruYRuD","endEpoch":"1","status":"CERTIFIED"}
