{"id":"2408.01139","title":"Interpreting Global Perturbation Robustness of Image Models using\n  Axiomatic Spectral Importance Decomposition","authors":"R\\'ois\\'in Luo, James McDermott, Colm O'Riordan","authorsParsed":[["Luo","Róisín",""],["McDermott","James",""],["O'Riordan","Colm",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 09:35:06 GMT"},{"version":"v2","created":"Sun, 18 Aug 2024 17:13:31 GMT"}],"updateDate":"2024-08-23","timestamp":1722591306000,"abstract":"  Perturbation robustness evaluates the vulnerabilities of models, arising from\na variety of perturbations, such as data corruptions and adversarial attacks.\nUnderstanding the mechanisms of perturbation robustness is critical for global\ninterpretability. We present a model-agnostic, global mechanistic\ninterpretability method to interpret the perturbation robustness of image\nmodels. This research is motivated by two key aspects. First, previous global\ninterpretability works, in tandem with robustness benchmarks, e.g. mean\ncorruption error (mCE), are not designed to directly interpret the mechanisms\nof perturbation robustness within image models. Second, we notice that the\nspectral signal-to-noise ratios (SNR) of perturbed natural images exponentially\ndecay over the frequency. This power-law-like decay implies that: Low-frequency\nsignals are generally more robust than high-frequency signals -- yet high\nclassification accuracy can not be achieved by low-frequency signals alone. By\napplying Shapley value theory, our method axiomatically quantifies the\npredictive powers of robust features and non-robust features within an\ninformation theory framework. Our method, dubbed as \\textbf{I-ASIDE}\n(\\textbf{I}mage \\textbf{A}xiomatic \\textbf{S}pectral \\textbf{I}mportance\n\\textbf{D}ecomposition \\textbf{E}xplanation), provides a unique insight into\nmodel robustness mechanisms. We conduct extensive experiments over a variety of\nvision models pre-trained on ImageNet to show that \\textbf{I-ASIDE} can not\nonly \\textbf{measure} the perturbation robustness but also \\textbf{provide\ninterpretations} of its mechanisms.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dxkJxjHD9hwK6aJ96eZ99np8JwaLYf2nyuKmAK_T7Io","pdfSize":"6857599"}
