{"id":"2408.07609","title":"Modernizing an Operational Real-time Tsunami Simulator to Support\n  Diverse Hardware Platforms","authors":"Keichi Takahashi, Takashi Abe, Akihiro Musa, Yoshihiko Sato, Yoichi\n  Shimomura, Hiroyuki Takizawa, Shunichi Koshimura","authorsParsed":[["Takahashi","Keichi",""],["Abe","Takashi",""],["Musa","Akihiro",""],["Sato","Yoshihiko",""],["Shimomura","Yoichi",""],["Takizawa","Hiroyuki",""],["Koshimura","Shunichi",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 15:17:33 GMT"}],"updateDate":"2024-08-15","timestamp":1723648653000,"abstract":"  To issue early warnings and rapidly initiate disaster responses after tsunami\ndamage, various tsunami inundation forecast systems have been deployed\nworldwide. Japan's Cabinet Office operates a forecast system that utilizes\nsupercomputers to perform tsunami propagation and inundation simulation in real\ntime. Although this real-time approach is able to produce significantly more\naccurate forecasts than the conventional database-driven approach, its wider\nadoption was hindered because it was specifically developed for vector\nsupercomputers. In this paper, we migrate the simulation code to modern CPUs\nand GPUs in a minimally invasive manner to reduce the testing and maintenance\ncosts. A directive-based approach is employed to retain the structure of the\noriginal code while achieving performance portability, and hardware-specific\noptimizations including load balance improvement for GPUs are applied. The\nmigrated code runs efficiently on recent CPUs, GPUs and vector processors: a\nsix-hour tsunami simulation using over 47 million cells completes in less than\n2.5 minutes on 32 Intel Sapphire Rapids CPUs and 1.5 minutes on 32 NVIDIA H100\nGPUs. These results demonstrate that the code enables broader access to\naccurate tsunami inundation forecasts.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}