{"id":"2408.03154","title":"Fake News Detection via Wisdom of Synthetic & Representative Crowds","authors":"Fran\\c{c}ois t'Serstevens, Roberto Cerina, Giulia Piccillo","authorsParsed":[["t'Serstevens","François",""],["Cerina","Roberto",""],["Piccillo","Giulia",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 12:54:41 GMT"}],"updateDate":"2024-08-07","timestamp":1722948881000,"abstract":"  Social media companies have struggled to provide a democratically legitimate\ndefinition of \"Fake News\". Reliance on expert judgment has attracted criticism\ndue to a general trust deficit and political polarisation. Approaches reliant\non the ``wisdom of the crowds'' are a cost-effective, transparent and inclusive\nalternative. This paper provides a novel end-to-end methodology to detect fake\nnews on X via \"wisdom of the synthetic & representative crowds\". We deploy an\nonline survey on the Lucid platform to gather veracity assessments for a number\nof pandemic-related tweets from crowd-workers. Borrowing from the MrP\nliterature, we train a Hierarchical Bayesian model to predict the veracity of\neach tweet from the perspective of different personae from the population of\ninterest.\n  We then weight the predicted veracity assessments according to a\nrepresentative stratification frame, such that decisions about ``fake'' tweets\nare representative of the overall polity of interest. Based on these aggregated\nscores, we analyse a corpus of tweets and perform a second MrP to generate\nstate-level estimates of the number of people who share fake news. We find\nsmall but statistically meaningful heterogeneity in fake news sharing across US\nstates. At the individual-level: i. sharing fake news is generally rare, with\nan average sharing probability interval [0.07,0.14]; ii. strong evidence that\nDemocrats share less fake news, accounting for a reduction in the sharing odds\nof [57.3%,3.9%] relative to the average user; iii. when Republican definitions\nof fake news are used, it is the latter who show a decrease in the propensity\nto share fake news worth [50.8%, 2.0%]; iv. some evidence that women share less\nfake news than men, an effect worth a [29.5%,4.9%] decrease.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}