{"id":"2408.06720","title":"Multimodal Analysis of White Blood Cell Differentiation in Acute Myeloid\n  Leukemia Patients using a \\beta-Variational Autoencoder","authors":"Gizem Mert, Ario Sadafi, Raheleh Salehi, Nassir Navab, Carsten Marr","authorsParsed":[["Mert","Gizem",""],["Sadafi","Ario",""],["Salehi","Raheleh",""],["Navab","Nassir",""],["Marr","Carsten",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 08:24:52 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 09:10:34 GMT"}],"updateDate":"2024-08-26","timestamp":1723537492000,"abstract":"  Biomedical imaging and RNA sequencing with single-cell resolution improves\nour understanding of white blood cell diseases like leukemia. By combining\nmorphological and transcriptomic data, we can gain insights into cellular\nfunctions and trajectoriess involved in blood cell differentiation. However,\nexisting methodologies struggle with integrating morphological and\ntranscriptomic data, leaving a significant research gap in comprehensively\nunderstanding the dynamics of cell differentiation. Here, we introduce an\nunsupervised method that explores and reconstructs these two modalities and\nuncovers the relationship between different subtypes of white blood cells from\nhuman peripheral blood smears in terms of morphology and their corresponding\ntranscriptome. Our method is based on a beta-variational autoencoder\n({\\ss}-VAE) with a customized loss function, incorporating a R-CNN architecture\nto distinguish single-cell from background and to minimize any interference\nfrom artifacts. This implementation of {\\ss}-VAE shows good reconstruction\ncapability along with continuous latent embeddings, while maintaining clear\ndifferentiation between single-cell classes. Our novel approach is especially\nhelpful to uncover the correlation of two latent features in complex biological\nprocesses such as formation of granules in the cell (granulopoiesis) with gene\nexpression patterns. It thus provides a unique tool to improve the\nunderstanding of white blood cell maturation for biomedicine and diagnostics.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Quantitative Biology/Quantitative Methods"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}