{"id":"2408.00504","title":"Fast and scalable finite-element based approach for density functional\n  theory calculations using projector-augmented wave method","authors":"Kartick Ramakrishnan and Sambit Das and Phani Motamarri","authorsParsed":[["Ramakrishnan","Kartick",""],["Das","Sambit",""],["Motamarri","Phani",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 12:17:52 GMT"},{"version":"v2","created":"Sat, 3 Aug 2024 07:55:25 GMT"}],"updateDate":"2024-08-06","timestamp":1722514672000,"abstract":"  In this work, we present a computationally efficient methodology that\nutilizes a local real-space formulation of the projector augmented wave (PAW)\nmethod discretized with a finite-element (FE) basis to enable accurate and\nlarge-scale electronic structure calculations. To the best of our knowledge,\nthis is the first real-space approach for DFT calculations, combining the\nefficiency of PAW formalism involving smooth electronic fields with the ability\nof systematically improvable higher-order finite-element basis to achieve\nsignificant computational gains. In particular, we have developed efficient\nstrategies for solving the underlying FE discretized PAW generalized\neigenproblem by employing the Chebyshev filtered subspace iteration approach to\ncompute the desired eigenspace in each self-consistent field iteration. These\nstrategies leverage the low-rank perturbation of the FE basis overlap matrix in\nconjunction with reduced order quadrature rules to invert the discretized PAW\noverlap matrix while also exploiting the sparsity of both the local and\nnon-local parts of the discretized PAW Hamiltonian and overlap matrices. Using\nthe proposed approach, we benchmark the accuracy and performance on various\nrepresentative examples involving periodic and non-periodic systems with\nplane-wave-based PAW implementations. Furthermore, we also demonstrate a\nconsiderable computational advantage ($\\sim$ 5$\\times$ -- 10$\\times$) over\nstate-of-the-art plane-wave methods for medium to large-scale systems ($\\sim$\n6,000 -- 35,000 electrons). Finally, we show that our approach (PAW-FE)\nsignificantly reduces the degrees of freedom to achieve the desired accuracy,\nthereby enabling large-scale DFT simulations ($>$ 50,000 electrons) at an order\nof magnitude lower computational cost compared to norm-conserving\npseudopotential calculations.\n","subjects":["Physics/Computational Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}