{"id":"2408.01298","title":"Probabilistic Inversion Modeling of Gas Emissions: A Gradient-Based MCMC\n  Estimation of Gaussian Plume Parameters","authors":"Thomas Newman, Christopher Nemeth, Matthew Jones, Philip Jonathan","authorsParsed":[["Newman","Thomas",""],["Nemeth","Christopher",""],["Jones","Matthew",""],["Jonathan","Philip",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 14:41:03 GMT"}],"updateDate":"2024-08-05","timestamp":1722609663000,"abstract":"  In response to global concerns regarding air quality and the environmental\nimpact of greenhouse gas emissions, detecting and quantifying sources of\nemissions has become critical. To understand this impact and target mitigations\neffectively, methods for accurate quantification of greenhouse gas emissions\nare required. In this paper, we focus on the inversion of concentration\nmeasurements to estimate source location and emission rate. In practice, such\nmethods often rely on atmospheric stability class-based Gaussian plume\ndispersion models. However, incorrectly identifying the atmospheric stability\nclass can lead to significant bias in estimates of source characteristics. We\npresent a robust approach that reduces this bias by jointly estimating the\nhorizontal and vertical dispersion parameters of the Gaussian plume model,\ntogether with source location and emission rate, atmospheric background\nconcentration, and sensor measurement error variance. Uncertainty in parameter\nestimation is quantified through probabilistic inversion using gradient-based\nMCMC methods. A simulation study is performed to assess the inversion\nmethodology. We then focus on inference for the published Chilbolton dataset\nwhich contains controlled methane releases and demonstrates the practical\nbenefits of estimating dispersion parameters in source inversion problems.\n","subjects":["Statistics/Applications","Statistics/Computation","Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}