{"id":"2408.04972","title":"Digital Semantic Communications: An Alternating Multi-Phase Training\n  Strategy with Mask Attack","authors":"Mingze Gong, Shuoyao Wang, Suzhi Bi, Yuan Wu, and Liping Qian","authorsParsed":[["Gong","Mingze",""],["Wang","Shuoyao",""],["Bi","Suzhi",""],["Wu","Yuan",""],["Qian","Liping",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 09:48:33 GMT"}],"updateDate":"2024-08-12","timestamp":1723196913000,"abstract":"  Semantic communication (SemComm) has emerged as new paradigm shifts.Most\nexisting SemComm systems transmit continuously distributed signals in analog\nfashion.However, the analog paradigm is not compatible with current digital\ncommunication frameworks. In this paper, we propose an alternating multi-phase\ntraining strategy (AMP) to enable the joint training of the networks in the\nencoder and decoder through non-differentiable digital processes. AMP contains\nthree training phases, aiming at feature extraction (FE), robustness\nenhancement (RE), and training-testing alignment (TTA), respectively. AMP\ncontains three training phases, aiming at feature extraction (FE), robustness\nenhancement (RE), and training-testing alignment (TTA), respectively. In\nparticular, in the FE stage, we learn the representation ability of semantic\ninformation by end-to-end training the encoder and decoder in an analog manner.\nWhen we take digital communication into consideration, the domain shift between\ndigital and analog demands the fine-tuning for encoder and decoder. To cope\nwith joint training process within the non-differentiable digital processes, we\npropose the alternation between updating the decoder individually and jointly\ntraining the codec in RE phase. To boost robustness further, we investigate a\nmask-attack (MATK) in RE to simulate an evident and severe bit-flipping effect\nin a differentiable manner. To address the training-testing inconsistency\nintroduced by MATK, we employ an additional TTA phase, fine-tuning the decoder\nwithout MATK. Combining with AMP and an information restoration network, we\npropose a digital SemComm system for image transmission, named AMP-SC.\nComparing with the representative benchmark, AMP-SC achieves $0.82 \\sim 1.65$dB\nhigher average reconstruction performance among various representative datasets\nat different scales and a wide range of signal-to-noise ratio.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}