{"id":"2408.04180","title":"From Safeguards Application to Fundamental Physics: Advancements in\n  Reactor Neutrino Detection with the {\\nu}-Angra Experiment","authors":"E. Kemp, M. P. Albuquerque, J. C. Anjos, P. Chimenti, L. F. G.\n  Gonzalez, G. P. Guedes, P. V. Guillaumon, H. P. Lima Jr., A. Massafferri, L.\n  M. Domingues Mendes, R. A. N\\'obrega, I. M. Pepe, and W. V. Santos","authorsParsed":[["Kemp","E.",""],["Albuquerque","M. P.",""],["Anjos","J. C.",""],["Chimenti","P.",""],["Gonzalez","L. F. G.",""],["Guedes","G. P.",""],["Guillaumon","P. V.",""],["Lima","H. P.","Jr."],["Massafferri","A.",""],["Mendes","L. M. Domingues",""],["Nóbrega","R. A.",""],["Pepe","I. M.",""],["Santos","W. V.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 02:54:33 GMT"}],"updateDate":"2024-08-09","timestamp":1723085673000,"abstract":"  Operating on a surface with high noise rates and requiring susceptible, yet\nsmall-scale detectors, the Neutrinos-Angra detector is an excellent platform\nfor technological development and expertise in new detection methods. This\nreport details the primary features of the detector, the electronics involved,\nand preliminary physics results from the operational phase, particularly the\nON-OFF analysis comparing the signals with the reactor in operation (ON) and\nduring the maintenance shut-down (OFF), demonstrating the detector's capability\nto monitor reactor activity. Additionally, we will briefly discuss the\nprospects of using a cryogenic calorimeter to detect neutrinos via Coherent\nElastic Neutrino-Nucleus Scattering (CEvNS), highlighting potential\nadvancements in neutrino detection technology. Looking ahead, the project\npromises to play a crucial role in the integration of Latin American scientists\nand engineers into global scientific collaborations, significantly contributing\nto the LASF4RI and the broader HECAP strategic framework.\n","subjects":["Physics/High Energy Physics - Experiment","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vQY_VFJnNWgfCUmmFEWabbscbOjz31jFvujMat5XKII","pdfSize":"842498"}
