{"id":"2408.08660","title":"Enhanced BICM Receiver Metrics for Ultra-Reliable Low-Latency Short\n  Block Channel Communications","authors":"Mody Sy and Raymond Knopp","authorsParsed":[["Sy","Mody",""],["Knopp","Raymond",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 11:02:16 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 15:25:08 GMT"}],"updateDate":"2024-08-23","timestamp":1723806136000,"abstract":"  This paper presents bit-interleaved coded modulation metrics for joint\nestimation and detection in short block length channels, addressing scenarios\nwith unknown channel state information and low training dimension density. We\nshow that it is possible to enhance the performance and sensitivity through\njoint detection-estimation compared to standard receivers, especially when the\nchannel state information is unknown and the density of the training dimensions\nis low. The performance analysis makes use of a full 5G transmitter and\nreceiver chains for both Polar and LDPC coded transmissions paired with QPSK\nmodulation scheme. We consider transmissions where reference signals are\ninterleaved with data and both are transmitted over a small number of OFDM\nsymbols so that near-perfect channel estimation cannot be achieved. This is\nparticularly adapted to mini-slot transmissions for ultra-reliable, low-latency\ncommunications (URLLC) or for short packet random access use cases. Performance\nevaluation spans SIMO and SU-MIMO configurations, emphasizing the efficacy of\nBICM detection in realistic base station receiver scenarios. Our findings\ndemonstrate that when the detection windows used in the metric units are on the\norder of four modulated symbols, the proposed receiver metrics can be used to\nachieve detection performance that is close to that of a coherent receiver with\nperfect channel state information.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}