{"id":"2408.08642","title":"The Power of Bias: Optimizing Client Selection in Federated Learning\n  with Heterogeneous Differential Privacy","authors":"Jiating Ma, Yipeng Zhou, Qi Li, Quan Z. Sheng, Laizhong Cui,\n  Jiangchuan Liu","authorsParsed":[["Ma","Jiating",""],["Zhou","Yipeng",""],["Li","Qi",""],["Sheng","Quan Z.",""],["Cui","Laizhong",""],["Liu","Jiangchuan",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 10:19:27 GMT"}],"updateDate":"2024-08-19","timestamp":1723803567000,"abstract":"  To preserve the data privacy, the federated learning (FL) paradigm emerges in\nwhich clients only expose model gradients rather than original data for\nconducting model training. To enhance the protection of model gradients in FL,\ndifferentially private federated learning (DPFL) is proposed which incorporates\ndifferentially private (DP) noises to obfuscate gradients before they are\nexposed. Yet, an essential but largely overlooked problem in DPFL is the\nheterogeneity of clients' privacy requirement, which can vary significantly\nbetween clients and extremely complicates the client selection problem in DPFL.\nIn other words, both the data quality and the influence of DP noises should be\ntaken into account when selecting clients. To address this problem, we conduct\nconvergence analysis of DPFL under heterogeneous privacy, a generic client\nselection strategy, popular DP mechanisms and convex loss. Based on convergence\nanalysis, we formulate the client selection problem to minimize the value of\nloss function in DPFL with heterogeneous privacy, which is a convex\noptimization problem and can be solved efficiently. Accordingly, we propose the\nDPFL-BCS (biased client selection) algorithm. The extensive experiment results\nwith real datasets under both convex and non-convex loss functions indicate\nthat DPFL-BCS can remarkably improve model utility compared with the SOTA\nbaselines.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Y_-2we_as2NwmU5m1z-aZpL4w7KGHYfQo0xi7Yyb7ak","pdfSize":"5080321"}
