{"id":"2408.15978","title":"WebPilot: A Versatile and Autonomous Multi-Agent System for Web Task\n  Execution with Strategic Exploration","authors":"Yao Zhang, Zijian Ma, Yunpu Ma, Zhen Han, Yu Wu, Volker Tresp","authorsParsed":[["Zhang","Yao",""],["Ma","Zijian",""],["Ma","Yunpu",""],["Han","Zhen",""],["Wu","Yu",""],["Tresp","Volker",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 17:49:29 GMT"}],"updateDate":"2024-08-29","timestamp":1724867369000,"abstract":"  LLM-based autonomous agents often fail to execute complex web tasks that\nrequire dynamic interaction due to the inherent uncertainty and complexity of\nthese environments. Existing LLM-based web agents typically rely on rigid,\nexpert-designed policies specific to certain states and actions, which lack the\nflexibility and generalizability needed to adapt to unseen tasks. In contrast,\nhumans excel by exploring unknowns, continuously adapting strategies, and\nresolving ambiguities through exploration. To emulate human-like adaptability,\nweb agents need strategic exploration and complex decision-making. Monte Carlo\nTree Search (MCTS) is well-suited for this, but classical MCTS struggles with\nvast action spaces, unpredictable state transitions, and incomplete information\nin web tasks. In light of this, we develop WebPilot, a multi-agent system with\na dual optimization strategy that improves MCTS to better handle complex web\nenvironments. Specifically, the Global Optimization phase involves generating a\nhigh-level plan by breaking down tasks into manageable subtasks and\ncontinuously refining this plan, thereby focusing the search process and\nmitigating the challenges posed by vast action spaces in classical MCTS.\nSubsequently, the Local Optimization phase executes each subtask using a\ntailored MCTS designed for complex environments, effectively addressing\nuncertainties and managing incomplete information. Experimental results on\nWebArena and MiniWoB++ demonstrate the effectiveness of WebPilot. Notably, on\nWebArena, WebPilot achieves SOTA performance with GPT-4, achieving a 93%\nrelative increase in success rate over the concurrent tree search-based method.\nWebPilot marks a significant advancement in general autonomous agent\ncapabilities, paving the way for more advanced and reliable decision-making in\npractical environments.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"rBHwdN_6ynk5Z7rPKElejUDG3dokjtwCHD7CczRMV-A","pdfSize":"6232542"}
