{"id":"2408.01262","title":"RAGEval: Scenario Specific RAG Evaluation Dataset Generation Framework","authors":"Kunlun Zhu, Yifan Luo, Dingling Xu, Ruobing Wang, Shi Yu, Shuo Wang,\n  Yukun Yan, Zhenghao Liu, Xu Han, Zhiyuan Liu, Maosong Sun","authorsParsed":[["Zhu","Kunlun",""],["Luo","Yifan",""],["Xu","Dingling",""],["Wang","Ruobing",""],["Yu","Shi",""],["Wang","Shuo",""],["Yan","Yukun",""],["Liu","Zhenghao",""],["Han","Xu",""],["Liu","Zhiyuan",""],["Sun","Maosong",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 13:35:11 GMT"},{"version":"v2","created":"Sun, 18 Aug 2024 15:48:02 GMT"},{"version":"v3","created":"Tue, 27 Aug 2024 03:13:50 GMT"}],"updateDate":"2024-08-28","timestamp":1722605711000,"abstract":"  Retrieval-Augmented Generation (RAG) systems have demonstrated their\nadvantages in alleviating the hallucination of Large Language Models (LLMs).\nExisting RAG benchmarks mainly focus on evaluating whether LLMs can correctly\nanswer the general knowledge. However, they are unable to evaluate the\neffectiveness of the RAG system in dealing with the data from different\nvertical domains. This paper introduces RAGEval, a framework for automatically\ngenerating evaluation datasets to evaluate the knowledge usage ability of\ndifferent LLMs in different scenarios. Specifically, RAGEval summarizes a\nschema from seed documents, applies the configurations to generate diverse\ndocuments, and constructs question-answering pairs according to both articles\nand configurations. We propose three novel metrics, Completeness,\nHallucination, and Irrelevance, to carefully evaluate the responses generated\nby LLMs. By benchmarking RAG models in vertical domains, RAGEval has the\nability to better evaluate the knowledge usage ability of LLMs, which avoids\nthe confusion regarding the source of knowledge in answering question in\nexisting QA datasets--whether it comes from parameterized memory or retrieval.\nThe code and dataset will be released.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}