{"id":"2408.09181","title":"PADetBench: Towards Benchmarking Physical Attacks against Object\n  Detection","authors":"Jiawei Lian, Jianhong Pan, Lefan Wang, Yi Wang, Lap-Pui Chau, Shaohui\n  Mei","authorsParsed":[["Lian","Jiawei",""],["Pan","Jianhong",""],["Wang","Lefan",""],["Wang","Yi",""],["Chau","Lap-Pui",""],["Mei","Shaohui",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 12:11:22 GMT"}],"updateDate":"2024-08-20","timestamp":1723896682000,"abstract":"  Physical attacks against object detection have gained increasing attention\ndue to their significant practical implications. However, conducting physical\nexperiments is extremely time-consuming and labor-intensive. Moreover, physical\ndynamics and cross-domain transformation are challenging to strictly regulate\nin the real world, leading to unaligned evaluation and comparison, severely\nhindering the development of physically robust models. To accommodate these\nchallenges, we explore utilizing realistic simulation to thoroughly and\nrigorously benchmark physical attacks with fairness under controlled physical\ndynamics and cross-domain transformation. This resolves the problem of\ncapturing identical adversarial images that cannot be achieved in the real\nworld. Our benchmark includes 20 physical attack methods, 48 object detectors,\ncomprehensive physical dynamics, and evaluation metrics. We also provide\nend-to-end pipelines for dataset generation, detection, evaluation, and further\nanalysis. In addition, we perform 8064 groups of evaluation based on our\nbenchmark, which includes both overall evaluation and further detailed ablation\nstudies for controlled physical dynamics. Through these experiments, we provide\nin-depth analyses of physical attack performance and physical adversarial\nrobustness, draw valuable observations, and discuss potential directions for\nfuture research.\n  Codebase: https://github.com/JiaweiLian/Benchmarking_Physical_Attack\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}