{"id":"2408.11078","title":"Entanglement and Generalized Berry Geometrical Phases in Quantum Gravity","authors":"Diego J. Cirilo-Lombardo (Keldysh Institute of the Russian Academy of\n  Sciences and CONICET-UBA-INFINA), Norma G. Sanchez (CNRS and The Chalonge -\n  Hector de Vega International School of Astrophysics)","authorsParsed":[["Cirilo-Lombardo","Diego J.","","Keldysh Institute of the Russian Academy of\n  Sciences and CONICET-UBA-INFINA"],["Sanchez","Norma G.","","CNRS and The Chalonge -\n  Hector de Vega International School of Astrophysics"]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:33:35 GMT"}],"updateDate":"2024-08-22","timestamp":1724092415000,"abstract":"  A new formalism is introduced describe the physical and geometric content of\nquantum spacetime. It is based in the Minimum Group Representation Principle.\nNew results for entanglement and geometrical/topological phases are found and\nimplemented in cosmological and black hole space-times. Our main results here\nare: (i) The Berry phases for inflation, for the cosmological perturbations,\nand its expression in terms of observables, as the spectral scalar and tensor\nindices, $n_S$ an $n_T$, and their ratio $r$. The Berry phase for de Sitter\ninflation is imaginary, its sign describing the exponential acceleration. (ii)\nThe pure entangled states in the minimum group (metaplectic) $Mp(n)$\nrepresentation for quantum de Sitter space-time and black holes are found.\n(iii) For entanglement, the relation between the Schmidt type representation\nand the physical states of the $Mp(n)$ group is found: This is a new\nnon-diagonal coherent state representation complementary to the known Sudarshan\ndiagonal one. (iv) The mean $Mp(2)$ generator values are related to the\nspace-time topological charge. (v) The basic even and odd $n$ -sectors of the\nHilbert space are intrinsic to the quantum spacetime and its discrete levels\n(continuum for $n \\rightarrow \\infty$) and are it entangled. (vi) The gravity\nor cosmological domains on one side and another of the Planck scale are\nentangled. Examples: The primordial quantum trans-Planckian de Sitter vacuum\nand the late classical gravity de Sitter vacuum today; the central quantum\nreqion and the external classical region of black holes. The classical and\nquantum dual gravity regions of the space-time are entangled. (vii) The general\nclassical-quantum gravity duality is associated to the Metaplectic $Mp(n)$\ngroup symmetry which provides the complete full covering of the phase space and\nof the quantum space-time mapped from it.\n","subjects":["Physics/General Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jNdZv7eGeJvfiEqiLEVKTY4779WglMw7Yjnrl2LTnvo","pdfSize":"1005383"}
