{"id":"2408.00698","title":"Neglected Silicon Dioxide Polymorphs as Clouds in Substellar Atmospheres","authors":"Sarah E. Moran, Mark S. Marley, Samuel D. Crossley","authorsParsed":[["Moran","Sarah E.",""],["Marley","Mark S.",""],["Crossley","Samuel D.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 16:42:36 GMT"},{"version":"v2","created":"Sun, 11 Aug 2024 00:04:56 GMT"}],"updateDate":"2024-08-14","timestamp":1722530556000,"abstract":"  Direct mid-infrared signatures of silicate clouds in substellar atmospheres\nwere first detected in Spitzer observations of brown dwarfs, although their\nexistence was previously inferred from near-infrared spectra. With JWST's\nMid-Infrared Instrument (MIRI) instrument, we can now more deeply probe\nsilicate features from 8 to 10 microns, exploring specific particle\ncomposition, size, and structure. Recent characterization efforts have led to\nthe identification in particular of silica (silicon dioxide, SiO$_2$) cloud\nfeatures in brown dwarfs and giant exoplanets. Previous modeling, motivated by\nchemical equilibrium, has primarily focused on magnesium silicates (forsterite,\nenstatite), crystalline quartz, and amorphous silica to match observations.\nHere, we explore the previously neglected possibility that other crystalline\nstructures of silica, i.e. polymorphs, may be more likely to form at the\npressure and temperature conditions of substellar upper atmospheres. We\nevaluate JWST's diagnostic potential for these polymorphs and find that\nexisting published transmission data are only able to conclusively distinguish\ntridymite, but future higher signal-to-noise transmission observations,\ndirectly imaged planet observations, and brown dwarf observations may be able\nto disentangle all four of the silica polymorphs. We ultimately propose that\naccounting for the distinct opacities arising from the possible crystalline\nstructure of cloud materials may act as a powerful, observable diagnostic\ntracer of atmospheric conditions, where particle crystallinity records the\nhistory of the atmospheric regions through which clouds formed and evolved.\nFinally, we highlight that high fidelity, accurate laboratory measurements of\nsilica polymorphs are critically needed to draw meaningful conclusions about\nthe identities and structures of clouds in substellar atmospheres.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YcbIgH2HtDhyUrx8RLVCk18XYbk9eswC9xxTpek4h3g","pdfSize":"1919947","txDigest":"3vBmaDvaCkNkQCbNrQoQvHQghqeWJVGTT6VZqBhSVLTQ","endEpoch":"1","status":"CERTIFIED"}
