{"id":"2408.05261","title":"Theory of metastable states in many-body quantum systems","authors":"Chao Yin, Federica M. Surace, Andrew Lucas","authorsParsed":[["Yin","Chao",""],["Surace","Federica M.",""],["Lucas","Andrew",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-13","timestamp":1723226400000,"abstract":"  We present a mathematical theory of metastable pure states in closed\nmany-body quantum systems with finite-dimensional Hilbert space. Given a\nHamiltonian, a pure state is defined to be metastable when all sufficiently\nlocal operators either stabilize the state, or raise its average energy. We\nprove that short-range entangled metastable states are necessarily eigenstates\n(scars) of a perturbatively close Hamiltonian. Given any metastable eigenstate\nof a Hamiltonian, in the presence of perturbations, we prove the presence of\nprethermal behavior: local correlation functions decay at a rate bounded by a\ntime scale nonperturbatively long in the inverse metastability radius, rather\nthan Fermi's Golden Rule. Inspired by this general theory, we prove that the\nlifetime of the false vacuum in certain $d$-dimensional quantum models grows at\nleast as fast as $\\exp(\\epsilon^{-d} \\log^{-3} \\epsilon^{-1} )$, where\n$\\epsilon\\rightarrow 0$ is the relative energy density of the false vacuum; up\nto logarithms, this lower bound matches, for the first time, explicit\ncalculations using quantum field theory. We identify metastable states at\nfinite energy density in the PXP model, along with exponentially many\nmetastable states in \"helical\" spin chains and the two-dimensional Ising model.\nOur inherently quantum formalism reveals precise connections between many\nproblems, including prethermalization, robust quantum scars, and quantum\nnucleation theory, and applies to systems without known semiclassical and/or\nfield theoretic limits.\n","subjects":["Physics/Mathematical Physics","Condensed Matter/Statistical Mechanics","Physics/High Energy Physics - Theory","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}