{"id":"2408.10868","title":"Inconsistency Removal of Reduced Bases in Parametric Model Order\n  Reduction by Matrix Interpolation using Adaptive Sampling and Clustering","authors":"Sebastian Schopper, Romain Rumpler, Gerhard M\\\"uller","authorsParsed":[["Schopper","Sebastian",""],["Rumpler","Romain",""],["Müller","Gerhard",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 13:58:13 GMT"}],"updateDate":"2024-08-21","timestamp":1724162293000,"abstract":"  Parametric model order reduction by matrix interpolation allows for efficient\nprediction of the behavior of dynamic systems without requiring knowledge about\nthe underlying parametric dependency. Within this approach, reduced models are\nfirst sampled and then made consistent with each other by transforming the\nunderlying reduced bases. Finally, the transformed reduced operators can be\ninterpolated to predict reduced models for queried parameter points. However,\nthe accuracy of the predicted reduced model strongly depends on the similarity\nof the sampled reduced bases. If the local reduced bases change significantly\nover the parameter space, inconsistencies are introduced in the training data\nfor the matrix interpolation. These strong changes in the reduced bases can\noccur due to the model order reduction method used, a change of the system's\ndynamics with a change of the parameters, and mode switching and truncation. In\nthis paper, individual approaches for removing these inconsistencies are\nextended and combined into one general framework to simultaneously treat\nmultiple sources of inconsistency. For that, modal truncation is used for the\nreduction, an adaptive sampling of the parameter space is performed, and\neventually, the parameter space is partitioned into regions in which all local\nreduced bases are consistent with each other. The proposed framework is applied\nto a cantilever Timoshenko beam and the Kelvin cell for one- to\nthree-dimensional parameter spaces. Compared to the original version of\nparametric model order reduction by matrix interpolation and an existing method\nfor inconsistency removal, the proposed framework leads to parametric reduced\nmodels with significantly smaller errors.\n","subjects":["Mathematics/Dynamical Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}