{"id":"2408.07207","title":"Lightning declines over shipping lanes following regulation of fuel\n  sulfur emissions","authors":"Chris J. Wright, Joel A. Thornton, Lyatt Jaegl\\'e, Yang Cao, Yannian\n  Zhu, Jihu Liu, Randall Jones II, Robert H Holzworth, Daniel Rosenfeld, Robert\n  Wood, Peter Blossey, Daehyun Kim","authorsParsed":[["Wright","Chris J.",""],["Thornton","Joel A.",""],["Jaeglé","Lyatt",""],["Cao","Yang",""],["Zhu","Yannian",""],["Liu","Jihu",""],["Jones","Randall","II"],["Holzworth","Robert H",""],["Rosenfeld","Daniel",""],["Wood","Robert",""],["Blossey","Peter",""],["Kim","Daehyun",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 21:42:36 GMT"}],"updateDate":"2024-08-15","timestamp":1723585356000,"abstract":"  Aerosol interactions with clouds represent a significant uncertainty in our\nunderstanding of the Earth system. Deep convective clouds may respond to\naerosol perturbations in several ways that have proven difficult to elucidate\nwith observations. Here, we leverage the two busiest maritime shipping lanes in\nthe world, which emit aerosol particles and their precursors into an otherwise\nrelatively clean tropical marine boundary layer, to make headway on the\ninfluence of aerosol on deep convective clouds. The recent seven-fold change in\nallowable fuel sulfur by the International Maritime Organization allows us to\ntest the sensitivity of the lightning to changes in ship plume aerosol size\ndistributions. We find that, across a range of atmospheric thermodynamic\nconditions, the previously documented enhancement of lightning over the\nshipping lanes has fallen by over 40\\%. The enhancement is therefore at least\npartially aerosol-mediated, a conclusion that is supported by observations of\ndroplet number at cloud base, which show a similar decline over the shipping\nlane. These results have fundamental implications for our understanding of\naerosol-cloud interactions, suggesting that deep convective clouds are impacted\nby the aerosol number distribution in the remote marine environment.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dSER6kKjrojeS6DRpOqOVE_0EIjQrmz9NyJUrhAo4o4","pdfSize":"4613845"}
