{"id":"2408.14089","title":"Mini-Slot-Assisted Short Packet URLLC:Differential or Coherent\n  Detection?","authors":"Canjian Zheng, Fu-Chun Zheng, Jingjing Luo, Pengcheng Zhu, Xiaohu You\n  and Daquan Feng","authorsParsed":[["Zheng","Canjian",""],["Zheng","Fu-Chun",""],["Luo","Jingjing",""],["Zhu","Pengcheng",""],["You","Xiaohu",""],["Feng","Daquan",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 08:20:49 GMT"}],"updateDate":"2024-08-27","timestamp":1724660449000,"abstract":"  One of the primary challenges in short packet ultra-reliable and low-latency\ncommunications (URLLC) is to achieve reliable channel estimation and data\ndetection while minimizing the impact on latency performance. Given the small\npacket size in mini-slot-assisted URLLC, relying solely on pilot-based coherent\ndetection is almost impossible to meet the seemingly contradictory requirements\nof high channel estimation accuracy, high reliability, low training overhead,\nand low latency. In this paper, we explore differential modulation both in the\nfrequency domain and in the time domain, and propose adopting an adaptive\napproach that integrates both differential and coherent detection to achieve\nmini-slot-assisted short packet URLLC, striking a balance among training\noverhead, system performance, and computational complexity. Specifically,\ndifferential (especially in the frequency domain) and coherent detection\nschemes can be dynamically activated based on application scenarios, channel\nstatistics, information payloads, mini-slot deployment options, and service\nrequirements. Furthermore, we derive the block error rate (BLER) for\npilot-based, frequency domain, and time domain differential OFDM using\nnon-asymptotic information-theoretic bounds. Simulation results validate the\nfeasibility and effectiveness of adaptive differential and coherent detection.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}