{"id":"2408.00368","title":"Illumination Design for Joint Imaging and Wireless Power Transfer\n  Systems","authors":"Qianyu Yang, Haiyang Zhang, Chunguo Li, Ruiqi Liu and Baoyun Wang","authorsParsed":[["Yang","Qianyu",""],["Zhang","Haiyang",""],["Li","Chunguo",""],["Liu","Ruiqi",""],["Wang","Baoyun",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 08:20:49 GMT"}],"updateDate":"2024-08-02","timestamp":1722500449000,"abstract":"  This paper presents a novel concept termed Integrated Imaging and Wireless\nPower Transfer (IWPT), wherein the integration of imaging and wireless power\ntransfer functionalities is achieved on a unified hardware platform. IWPT\nleverages a transmitting array to efficiently illuminate a specific Region of\nInterest (ROI), enabling the extraction of ROI's scattering coefficients while\nconcurrently providing wireless power to nearby users. The integration of IWPT\noffers compelling advantages, including notable reductions in power consumption\nand spectrum utilization, pivotal for the optimization of future 6G wireless\nnetworks. As an initial investigation, we explore two antenna architectures: a\nfully digital array and a digital/analog hybrid array. Our goal is to\ncharacterize the fundamental trade-off between imaging and wireless power\ntransfer by optimizing the illumination signal. With imaging operating in the\nnear-field, we formulate the illumination signal design as an optimization\nproblem that minimizes the condition number of the equivalent channel. To\naddress this optimization problem, we propose an semi-definite relaxation-based\napproach for the fully digital array and an alternating optimization algorithm\nfor the hybrid array. Finally, numerical results verify the effectiveness of\nour proposed solutions and demonstrate the trade-off between imaging and\nwireless power transfer.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"p0NL1GVFdQPdZ6LsagbNI-yKyJF5OFKummSvjr9P9-c","pdfSize":"943381"}
