{"id":"2408.01326","title":"Mean and Covariance Estimation for Discretely Observed High-Dimensional\n  Functional Data: Rates of Convergence and Division of Observational Regimes","authors":"Alexander Petersen","authorsParsed":[["Petersen","Alexander",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 15:24:20 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 14:56:36 GMT"}],"updateDate":"2024-08-06","timestamp":1722612260000,"abstract":"  Estimation of the mean and covariance parameters for functional data is a\ncritical task, with local linear smoothing being a popular choice. In recent\nyears, many scientific domains are producing multivariate functional data for\nwhich $p$, the number of curves per subject, is often much larger than the\nsample size $n$. In this setting of high-dimensional functional data, much of\ndeveloped methodology relies on preliminary estimates of the unknown mean\nfunctions and the auto- and cross-covariance functions. This paper investigates\nthe convergence rates of local linear estimators in terms of the maximal error\nacross components and pairs of components for mean and covariance functions,\nrespectively, in both $L^2$ and uniform metrics. The local linear estimators\nutilize a generic weighting scheme that can adjust for differing numbers of\ndiscrete observations $N_{ij}$ across curves $j$ and subjects $i$, where the\n$N_{ij}$ vary with $n$. Particular attention is given to the equal weight per\nobservation (OBS) and equal weight per subject (SUBJ) weighting schemes. The\ntheoretical results utilize novel applications of concentration inequalities\nfor functional data and demonstrate that, similar to univariate functional\ndata, the order of the $N_{ij}$ relative to $p$ and $n$ divides\nhigh-dimensional functional data into three regimes (sparse, dense, and\nultra-dense), with the high-dimensional parametric convergence rate of\n$\\left\\{\\log(p)/n\\right\\}^{1/2}$ being attainable in the latter two.\n","subjects":["Mathematics/Statistics Theory","Statistics/Methodology","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}