{"id":"2408.04082","title":"Design, Construction, and Test of Compact, Distributed-Charge, X-Band\n  Accelerator Systems that Enable Image-Guided, VHEE FLASH Radiotherapy","authors":"Christopher P. J. Barty, J. Martin Algots, Alexander J. Amador, James\n  C. R. Barty, Shawn M. Betts, Marcelo A. Caste\\~nada, Matthew M. Chu, Michael\n  E. Daley, Ricardo A. De Luna Lopez, Derek A. Diviak, Haytham H. Effarah,\n  Roberto Feliciano, Adan Garcia, Keith J. Grabiel, Alex S. Griffin, Frederic\n  V. Hartemann, Leslie Heid, Yoonwoo Hwang, Gennady Imeshev, Michael Jentschel,\n  Christopher A. Johnson, Kenneth W. Kinosian, Agnese Lagzda, Russell J.\n  Lochrie, Michael W. May, Everardo Molina, Christopher L. Nagel, Henry J.\n  Nagel, Kyle R. Peirce, Zachary R. Peirce, Mauricio E. Qui\\~nonez, Ferenc\n  Raksi, Kelanu Ranganath, Trevor Reutershan, Jimmie Salazar, Mitchell E.\n  Schneider, Michael W. L. Seggebruch, Joy Y. Yang, Nathan H. Yeung, Collette\n  B. Zapata, Luis E. Zapata, Eric J. Zepeda, Jingyuan Zhang","authorsParsed":[["Barty","Christopher P. J.",""],["Algots","J. Martin",""],["Amador","Alexander J.",""],["Barty","James C. R.",""],["Betts","Shawn M.",""],["Casteñada","Marcelo A.",""],["Chu","Matthew M.",""],["Daley","Michael E.",""],["Lopez","Ricardo A. De Luna",""],["Diviak","Derek A.",""],["Effarah","Haytham H.",""],["Feliciano","Roberto",""],["Garcia","Adan",""],["Grabiel","Keith J.",""],["Griffin","Alex S.",""],["Hartemann","Frederic V.",""],["Heid","Leslie",""],["Hwang","Yoonwoo",""],["Imeshev","Gennady",""],["Jentschel","Michael",""],["Johnson","Christopher A.",""],["Kinosian","Kenneth W.",""],["Lagzda","Agnese",""],["Lochrie","Russell J.",""],["May","Michael W.",""],["Molina","Everardo",""],["Nagel","Christopher L.",""],["Nagel","Henry J.",""],["Peirce","Kyle R.",""],["Peirce","Zachary R.",""],["Quiñonez","Mauricio E.",""],["Raksi","Ferenc",""],["Ranganath","Kelanu",""],["Reutershan","Trevor",""],["Salazar","Jimmie",""],["Schneider","Mitchell E.",""],["Seggebruch","Michael W. L.",""],["Yang","Joy Y.",""],["Yeung","Nathan H.",""],["Zapata","Collette B.",""],["Zapata","Luis E.",""],["Zepeda","Eric J.",""],["Zhang","Jingyuan",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 20:53:41 GMT"}],"updateDate":"2024-08-09","timestamp":1723064021000,"abstract":"  The design and optimization of laser-Compton x-ray systems based on compact\ndistributed charge accelerator structures can enable micron-scale imaging of\ndisease and the concomitant production of beams of Very High Energy Electrons\n(VHEEs) capable of producing FLASH-relevant dose rates. The physics of\nlaser-Compton x-ray scattering ensures that the scattered x-rays follow exactly\nthe trajectory of the incident electrons, thus providing a route to\nimage-guided, VHEE FLASH radiotherapy. The keys to a compact architecture\ncapable of producing both laser-Compton x-rays and VHEEs are the use of X-band\nRF accelerator structures which have been demonstrated to operate with over 100\nMeV/m acceleration gradients. The operation of these structures in a\ndistributed charge mode in which each radiofrequency (RF) cycle of the drive RF\npulse is filled with a low-charge, high-brightness electron bunch is enabled by\nthe illumination of a high-brightness photogun with a train of UV laser pulses\nsynchronized to the frequency of the underlying accelerator system. The UV\npulse trains are created by a patented pulse synthesis approach which utilizes\nthe RF clock of the accelerator to phase and amplitude modulate a narrow band\ncontinuous wave (CW) seed laser. In this way it is possible to produce up to 10\n{\\mu}A of average beam current from the accelerator. Such high current from a\ncompact accelerator enables production of sufficient x-rays via laser-Compton\nscattering for clinical imaging and does so from a machine of \"clinical\"\nfootprint. At the same time, the production of 1000 or greater individual\nmicro-bunches per RF pulse enables > 10 nC of charge to be produced in a\nmacrobunch of < 100 ns. The design, construction, and test of the 100-MeV class\nprototype system in Irvine, CA is also presented.\n","subjects":["Physics/Accelerator Physics","Physics/Medical Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YRCFcqxlhKVcmrtC7lw6b92FRbteV0DTtqCdgHp3iig","pdfSize":"17025036"}
