{"id":"2408.14574","title":"Resurgence in Liouville Theory","authors":"Nathan Benjamin, Scott Collier, Alexander Maloney, and Viraj Meruliya","authorsParsed":[["Benjamin","Nathan",""],["Collier","Scott",""],["Maloney","Alexander",""],["Meruliya","Viraj",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 18:47:39 GMT"}],"updateDate":"2024-08-28","timestamp":1724698059000,"abstract":"  Liouville conformal field theory is a prototypical example of an exactly\nsolvable quantum field theory, in the sense that the correlation functions in\nan arbitrary background can be determined exactly using only the constraints of\nunitarity and crossing symmetry. For example, the three point correlation\nfunctions are given by the famous formula of\nDorn-Otto-Zamolodchikov-Zamolodchikov (DOZZ). Unlike many other exactly\nsolvable theories, Liouville theory has a continuously tunable parameter --\nessentially $\\hbar$ -- which is related to the central charge of the theory.\nHere we investigate the nature of the perturbative expansion in powers of\n$\\hbar$, which is the loop expansion around a semi-classical solution. We show\nthat the perturbative coefficients grow factorially, as expected of a Feynman\ndiagram expansion, and take the form of an asymptotic series. We identify the\nsingularities in the Borel plane, and show that they are associated with\ncomplex instanton solutions of Liouville theory; they correspond precisely to\nthe complex solutions described by Harlow, Maltz, and Witten. Both single- and\nmulti-valued solutions of Liouville appear. We show that the perturbative loop\nexpansions around these different saddle points mix in the way expected for a\ntrans-series expansion. Thus Liouville theory provides a calculable example of\na quantum field theory where perturbative and instanton contributions can be\nsummed up and assembled into a finite answer.\n","subjects":["Physics/High Energy Physics - Theory","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}