{"id":"2408.00941","title":"Stop-and-go waves reconstruction via iterative refinement","authors":"Junyi Ji, Alex Richardson, Derek Gloudemans, Gergely Zach\\'ar, Matthew\n  Nice, William Barbour, Jonathan Sprinkle, Benedetto Piccoli, Daniel B. Work","authorsParsed":[["Ji","Junyi",""],["Richardson","Alex",""],["Gloudemans","Derek",""],["Zachár","Gergely",""],["Nice","Matthew",""],["Barbour","William",""],["Sprinkle","Jonathan",""],["Piccoli","Benedetto",""],["Work","Daniel B.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 22:14:30 GMT"}],"updateDate":"2024-08-05","timestamp":1722550470000,"abstract":"  Stop-and-go waves are a fundamental phenomenon in freeway traffic flow,\ncontributing to inefficiencies, crashes, and emissions. Recent advancements in\nhigh-fidelity sensor technologies have improved the ability to capture detailed\ntraffic dynamics, yet such systems remain scarce and costly. In contrast,\nconventional traffic sensors are widely deployed but suffer from relatively\ncoarse-grain data resolution, potentially impeding accurate analysis of\nstop-and-go waves. This article explores whether generative AI models can\nenhance the resolution of conventional traffic sensor to approximate the\nquality of high-fidelity observations. We present a novel approach using a\nconditional diffusion denoising model, designed to reconstruct fine-grained\ntraffic speed field from radar-based conventional sensors via iterative\nrefinement. We introduce a new dataset, I24-WaveX, comprising 132 hours of data\nfrom both low and high-fidelity sensor systems, totaling over 2 million vehicle\nmiles traveled. Our approach leverages this dataset to formulate the traffic\nmeasurement enhancement problem as a spatio-temporal super-resolution task. We\ndemonstrate that our model can effectively reproduce the patterns of\nstop-and-go waves, achieving high accuracy in capturing these critical traffic\ndynamics. Our results show promising advancements in traffic data enhancement,\noffering a cost-effective way to leverage existing low spatio-temporal\nresolution sensor networks for improved traffic analysis and management. We\nalso open-sourced our trained model and code to facilitate further research and\napplications.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}