{"id":"2408.03906","title":"Achieving Human Level Competitive Robot Table Tennis","authors":"David B. D'Ambrosio, Saminda Abeyruwan, Laura Graesser, Atil Iscen,\n  Heni Ben Amor, Alex Bewley, Barney J. Reed, Krista Reymann, Leila Takayama,\n  Yuval Tassa, Krzysztof Choromanski, Erwin Coumans, Deepali Jain, Navdeep\n  Jaitly, Natasha Jaques, Satoshi Kataoka, Yuheng Kuang, Nevena Lazic, Reza\n  Mahjourian, Sherry Moore, Kenneth Oslund, Anish Shankar, Vikas Sindhwani,\n  Vincent Vanhoucke, Grace Vesom, Peng Xu, Pannag R. Sanketi","authorsParsed":[["D'Ambrosio","David B.",""],["Abeyruwan","Saminda",""],["Graesser","Laura",""],["Iscen","Atil",""],["Amor","Heni Ben",""],["Bewley","Alex",""],["Reed","Barney J.",""],["Reymann","Krista",""],["Takayama","Leila",""],["Tassa","Yuval",""],["Choromanski","Krzysztof",""],["Coumans","Erwin",""],["Jain","Deepali",""],["Jaitly","Navdeep",""],["Jaques","Natasha",""],["Kataoka","Satoshi",""],["Kuang","Yuheng",""],["Lazic","Nevena",""],["Mahjourian","Reza",""],["Moore","Sherry",""],["Oslund","Kenneth",""],["Shankar","Anish",""],["Sindhwani","Vikas",""],["Vanhoucke","Vincent",""],["Vesom","Grace",""],["Xu","Peng",""],["Sanketi","Pannag R.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 17:10:55 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 19:29:56 GMT"}],"updateDate":"2024-08-13","timestamp":1723050655000,"abstract":"  Achieving human-level speed and performance on real world tasks is a north\nstar for the robotics research community. This work takes a step towards that\ngoal and presents the first learned robot agent that reaches amateur\nhuman-level performance in competitive table tennis. Table tennis is a\nphysically demanding sport which requires human players to undergo years of\ntraining to achieve an advanced level of proficiency. In this paper, we\ncontribute (1) a hierarchical and modular policy architecture consisting of (i)\nlow level controllers with their detailed skill descriptors which model the\nagent's capabilities and help to bridge the sim-to-real gap and (ii) a high\nlevel controller that chooses the low level skills, (2) techniques for enabling\nzero-shot sim-to-real including an iterative approach to defining the task\ndistribution that is grounded in the real-world and defines an automatic\ncurriculum, and (3) real time adaptation to unseen opponents. Policy\nperformance was assessed through 29 robot vs. human matches of which the robot\nwon 45% (13/29). All humans were unseen players and their skill level varied\nfrom beginner to tournament level. Whilst the robot lost all matches vs. the\nmost advanced players it won 100% matches vs. beginners and 55% matches vs.\nintermediate players, demonstrating solidly amateur human-level performance.\nVideos of the matches can be viewed at\nhttps://sites.google.com/view/competitive-robot-table-tennis\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/"}