{"id":"2408.14566","title":"Assessing Python Style Guides: An Eye-Tracking Study with Novice\n  Developers","authors":"Pablo Roberto, Rohit Gheyi, Jos\\'e Aldo Silva da Costa, M\\'arcio\n  Ribeiro","authorsParsed":[["Roberto","Pablo",""],["Gheyi","Rohit",""],["da Costa","José Aldo Silva",""],["Ribeiro","Márcio",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 18:37:03 GMT"}],"updateDate":"2024-08-28","timestamp":1724697423000,"abstract":"  The incorporation and adaptation of style guides play an essential role in\nsoftware development, influencing code formatting, naming conventions, and\nstructure to enhance readability and simplify maintenance. However, many of\nthese guides often lack empirical studies to validate their recommendations.\nPrevious studies have examined the impact of code styles on developer\nperformance, concluding that some styles have a negative impact on code\nreadability. However, there is a need for more studies that assess other\nperspectives and the combination of these perspectives on a common basis\nthrough experiments. This study aimed to investigate, through eye-tracking, the\nimpact of guidelines in style guides, with a special focus on the PEP8 guide in\nPython, recognized for its best practices. We conducted a controlled experiment\nwith 32 Python novices, measuring time, the number of attempts, and visual\neffort through eye-tracking, using fixation duration, fixation count, and\nregression count for four PEP8 recommendations. Additionally, we conducted\ninterviews to explore the subjects' difficulties and preferences with the\nprograms. The results highlighted that not following the PEP8 Line Break after\nan Operator guideline increased the eye regression count by 70% in the code\nsnippet where the standard should have been applied. Most subjects preferred\nthe version that adhered to the PEP8 guideline, and some found the left-aligned\norganization of operators easier to understand. The other evaluated guidelines\nrevealed other interesting nuances, such as the True Comparison, which\nnegatively impacted eye metrics for the PEP8 standard, although subjects\npreferred the PEP8 suggestion. We recommend practitioners selecting guidelines\nsupported by experimental evaluations.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}