{"id":"2408.15218","title":"Histo-Diffusion: A Diffusion Super-Resolution Method for Digital\n  Pathology with Comprehensive Quality Assessment","authors":"Xuan Xu, Saarthak Kapse, Prateek Prasanna","authorsParsed":[["Xu","Xuan",""],["Kapse","Saarthak",""],["Prasanna","Prateek",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 17:31:00 GMT"}],"updateDate":"2024-08-28","timestamp":1724779860000,"abstract":"  Digital pathology has advanced significantly over the last decade, with Whole\nSlide Images (WSIs) encompassing vast amounts of data essential for accurate\ndisease diagnosis. High-resolution WSIs are essential for precise diagnosis but\ntechnical limitations in scanning equipment and variablity in slide preparation\ncan hinder obtaining these images. Super-resolution techniques can enhance\nlow-resolution images; while Generative Adversarial Networks (GANs) have been\neffective in natural image super-resolution tasks, they often struggle with\nhistopathology due to overfitting and mode collapse. Traditional evaluation\nmetrics fall short in assessing the complex characteristics of histopathology\nimages, necessitating robust histology-specific evaluation methods.\n  We introduce Histo-Diffusion, a novel diffusion-based method specially\ndesigned for generating and evaluating super-resolution images in digital\npathology. It includes a restoration module for histopathology prior and a\ncontrollable diffusion module for generating high-quality images. We have\ncurated two histopathology datasets and proposed a comprehensive evaluation\nstrategy which incorporates both full-reference and no-reference metrics to\nthoroughly assess the quality of digital pathology images.\n  Comparative analyses on multiple datasets with state-of-the-art methods\nreveal that Histo-Diffusion outperforms GANs. Our method offers a versatile\nsolution for histopathology image super-resolution, capable of handling\nmulti-resolution generation from varied input sizes, providing valuable support\nin diagnostic processes.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oMStQWXF1sNjkDQjxa5InPrkw7Z_2TEpbmcOCHkQkm8","pdfSize":"23933565"}
