{"id":"2408.10507","title":"Onset instability of inverted flags clamped by a cylinder","authors":"Haokui Jiang, Yujia Zhao, Burigede Liu, Shunxiang Cao","authorsParsed":[["Jiang","Haokui",""],["Zhao","Yujia",""],["Liu","Burigede",""],["Cao","Shunxiang",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 03:10:16 GMT"}],"updateDate":"2024-08-21","timestamp":1724123416000,"abstract":"  We numerically investigate the hydrodynamic characteristics and analyze the\ninstability mechanism of a two-dimensional inverted flag clamped by a cylinder.\nTwo transition routes and a total of six kinds of solutions exist under this\nconfiguration for different diameters of cylinders due to complex bifurcations.\nSpecifically, for small cylinders, the undeformed equilibrium transitions to\nstatic deformed equilibrium through a supercritical pitchfork bifurcation,\nwhich is judged by the weakly nonlinear analysis together with the global\nlinear instability analysis. The instability mechanism is the lifting effect of\nthe steady structure mode working at the leading edge of the elastic plate. For\nlarge cylinders, another unstable fluid mode (decoupled with structure mode)\ncauses the disappearance of the static undeformed and deformed equilibrium,\nreplaced by a small amplitude flapping. The structure mode and the flow mode\nmainly contribute to the growth of perturbations in plate and downstream\ncylinder regions respectively, which can excite multi-mode oscillating\ntransition analyzed by proper orthogonal decomposition. Moreover, we find there\nis a critical diameter $D_c$ dividing the pitchfork bifurcation and Hopf\nbifurcation, and $D_c$ decreases with the increase of Reynolds number. Finally,\nwe prove downstream vortex shedding can induce upward vortex-induced vibration\nof the plate and further improve the efficiency of energy transfer from the\nfluid to the structure during small-deflection flapping.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}