{"id":"2408.08026","title":"JWST MIRI and NIRCam observations of NGC 891 and its circumgalactic\n  medium","authors":"J\\'er\\'emy Chastenet, Ilse De Looze, Monica Rela\\~no, Daniel A. Dale,\n  Thomas G. Williams, Simone Bianchi, Emmanuel M. Xilouris, Maarten Baes,\n  Alberto D. Bolatto, Martha L. Boyer, Viviana Casasola, Christopher J. R.\n  Clark, Filippo Fraternali, Jacopo Fritz, Fr\\'ed\\'eric Galliano, Simon C. O.\n  Glover, Karl D. Gordon, Hiroyuki Hirashita, Robert Kennicutt, Kentaro\n  Nagamine, Florian Kirchschlager, Ralf S. Klessen, Eric W. Koch, Rebecca C.\n  Levy, Lewis McCallum, Suzanne C. Madden, Anna F. McLeod, Sharon E. Meidt,\n  Aleksandr V. Mosenkov, Helena M. Richie, Am\\'elie Saintonge, Karin M.\n  Sandstrom, Evan E. Schneider, Evgenia E. Sivkova, J. D. T. Smith, Matthew W.\n  L. Smith, Arjen van der Wel, Stefanie Walch, Fabian Walter, and Kenneth Wood","authorsParsed":[["Chastenet","Jérémy",""],["De Looze","Ilse",""],["Relaño","Monica",""],["Dale","Daniel A.",""],["Williams","Thomas G.",""],["Bianchi","Simone",""],["Xilouris","Emmanuel M.",""],["Baes","Maarten",""],["Bolatto","Alberto D.",""],["Boyer","Martha L.",""],["Casasola","Viviana",""],["Clark","Christopher J. R.",""],["Fraternali","Filippo",""],["Fritz","Jacopo",""],["Galliano","Frédéric",""],["Glover","Simon C. O.",""],["Gordon","Karl D.",""],["Hirashita","Hiroyuki",""],["Kennicutt","Robert",""],["Nagamine","Kentaro",""],["Kirchschlager","Florian",""],["Klessen","Ralf S.",""],["Koch","Eric W.",""],["Levy","Rebecca C.",""],["McCallum","Lewis",""],["Madden","Suzanne C.",""],["McLeod","Anna F.",""],["Meidt","Sharon E.",""],["Mosenkov","Aleksandr V.",""],["Richie","Helena M.",""],["Saintonge","Amélie",""],["Sandstrom","Karin M.",""],["Schneider","Evan E.",""],["Sivkova","Evgenia E.",""],["Smith","J. D. T.",""],["Smith","Matthew W. L.",""],["van der Wel","Arjen",""],["Walch","Stefanie",""],["Walter","Fabian",""],["Wood","Kenneth",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 08:48:58 GMT"}],"updateDate":"2024-08-16","timestamp":1723711738000,"abstract":"  We present new JWST observations of the nearby, prototypical edge-on, spiral\ngalaxy NGC 891. The northern half of the disk was observed with NIRCam in its\nF150W and F277W filters. Absorption is clearly visible in the mid-plane of the\nF150W image, along with vertical dusty plumes that closely resemble the ones\nseen in the optical. A $\\sim 10 \\times 3~{\\rm kpc}^2$ area of the lower\ncircumgalactic medium (CGM) was mapped with MIRI F770W at 12 pc scales. Thanks\nto the sensitivity and resolution of JWST, we detect dust emission out to $\\sim\n4$ kpc from the disk, in the form of filaments, arcs, and super-bubbles. Some\nof these filaments can be traced back to regions with recent star formation\nactivity, suggesting that feedback-driven galactic winds play an important role\nin regulating baryonic cycling. The presence of dust at these altitudes raises\nquestions about the transport mechanisms at play and suggests that small dust\ngrains are able to survive for several tens of million years after having been\nejected by galactic winds in the disk-halo interface. We lay out several\nscenarios that could explain this emission: dust grains may be shielded in the\nouter layers of cool dense clouds expelled from the galaxy disk, and/or the\nemission comes from the mixing layers around these cool clumps where material\nfrom the hot gas is able to cool down and mix with these cool cloudlets. This\nfirst set of data and upcoming spectroscopy will be very helpful to understand\nthe survival of dust grains in energetic environments, and their contribution\nto recycling baryonic material in the mid-plane of galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}