{"id":"2408.03501","title":"Enantiomer-Selective Magnetoresistance in Chiral Gold Nanocrystals by\n  Magnetic Control of Surface Potentials","authors":"Fengxia Wu, Ying Wang, Yufei Zhao, Yu Tian, Zuoti Xie, Wenxin Niu,\n  Binghai Yan, Cunlan Guo","authorsParsed":[["Wu","Fengxia",""],["Wang","Ying",""],["Zhao","Yufei",""],["Tian","Yu",""],["Xie","Zuoti",""],["Niu","Wenxin",""],["Yan","Binghai",""],["Guo","Cunlan",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 01:59:59 GMT"}],"updateDate":"2024-08-08","timestamp":1722995999000,"abstract":"  Chiral nanomaterials offer intriguing possibilities for novel electronic and\nchemical applications. Here, we report the discovery of an enantiomer-selective\nmagnetoresistance effect in chiral gold nanocrystals. Based on precise control\nof nanocrystal chiral morphology using amino acid-directed synthesis, we\ndemonstrate that an external magnetic field can dramatically modulate\nresistance in an enantiomer-specific manner. For a given enantiomer, a magnetic\nfield in one direction alters the resistance by over an order of magnitude,\nwhile the opposite field direction leaves it unchanged. This asymmetric\nresponse reverses for the opposite enantiomer. We attribute this phenomenon to\na novel chirality-driven charge trapping mechanism, where the interplay between\nthe chiral nanocrystal morphology and the magnetic field selectively modifies\nthe surface potential. The magnitude and sign of the magnetoresistance can be\nfurther tuned by the surface chemistry of the nanocrystal, as demonstrated\nthrough sulfide treatment. Our findings reveal a new form of\nchirality-dependent magnetoresistance, distinct from previously known effects\nsuch as chirality-induced spin selectivity and electric magnetochiral\nanisotropy. The ability to remotely control surface potentials of chiral\nnanostructures using magnetic fields could enable novel approaches in\ncatalysis, drug delivery, and nanoelectronics.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}