{"id":"2408.12158","title":"Could Bibliometrics Reveal Top Science and Technology Achievements and\n  Researchers? The Case for Evaluatology-based Science and Technology\n  Evaluation","authors":"Guoxin Kang, Wanling Gao, Lei Wang, Chunjie Luo, Hainan Ye, Qian He,\n  Shaopeng Dai, and Jianfeng Zhan","authorsParsed":[["Kang","Guoxin",""],["Gao","Wanling",""],["Wang","Lei",""],["Luo","Chunjie",""],["Ye","Hainan",""],["He","Qian",""],["Dai","Shaopeng",""],["Zhan","Jianfeng",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 06:57:46 GMT"}],"updateDate":"2024-08-23","timestamp":1724309866000,"abstract":"  By utilizing statistical methods to analyze bibliographic data, bibliometrics\nfaces inherent limitations in identifying the most significant science and\ntechnology achievements and researchers. To overcome this challenge, we present\nan evaluatology-based science and technology evaluation methodology. At the\nheart of this approach lies the concept of an extended evaluation condition,\nencompassing eight crucial components derived from a field. We define four\nrelationships that illustrate the connections among various achievements based\non their mapped extended EC components, as well as their temporal and citation\nlinks. Within a relationship under an extended evaluation condition, evaluators\ncan effectively compare these achievements by carefully addressing the\ninfluence of confounding variables. We establish a real-world evaluation system\nencompassing an entire collection of achievements, each of which is mapped to\nseveral components of an extended EC. Within a specific field like chip\ntechnology or open source, we construct a perfect evaluation model that can\naccurately trace the evolution and development of all achievements in terms of\nfour relationships based on the real-world evaluation system. Building upon the\nfoundation of the perfect evaluation model, we put forth four-round rules to\neliminate non-significant achievements by utilizing four relationships. This\nprocess allows us to establish a pragmatic evaluation model that effectively\ncaptures the essential achievements, serving as a curated collection of the top\nN achievements within a specific field during a specific timeframe. We present\na case study on the top 100 Chip achievements which highlights its practical\napplication and efficacy in identifying significant achievements and\nresearchers that otherwise can not be identified by using bibliometrics.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"BKtUcZGEwBCyNN646HUJoguUfRdKQgryaCnxpVtV5V8","pdfSize":"1721791"}
