{"id":"2408.02415","title":"A direct method for reproducing fully relativistic spectra from standard\n  accretion disks by modifying their inner boundary","authors":"Th. V. Papavasileiou, O. Kosmas and T. S. Kosmas","authorsParsed":[["Papavasileiou","Th. V.",""],["Kosmas","O.",""],["Kosmas","T. S.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 12:14:55 GMT"}],"updateDate":"2024-08-06","timestamp":1722860095000,"abstract":"  General relativistic effects are strong near the black hole of an X-ray\nbinary and significantly impact the total energy released at the innermost\naccretion disk's region. Our goal is to fully incorporate the black hole's spin\nand all the general relativistic effects on the observed spectra coming from\nX-ray binary systems while maintaining the simplicity of the standard disk\nmodel. That is possible by appropriately shifting only the disk's inner radius.\nWe employ some of the most efficient pseudo-Newtonian potentials around Kerr\nblack holes and derive two generalized disk temperature profiles, thus\nincorporating the spin's contribution to the thermal spectra. Then, we\nassociate the observed radiative efficiency with the emission pattern featuring\nall the relativistic effects included in the kerrbb model, obtaining an\nexpression about the modified inner radius of the disk. Moreover, we apply this\nmethod to Cygnus X-1 by fitting the observational data obtained during its\nhigh/soft and hard/low spectral states. The fully relativistic spectra are\nreproduced to a very good approximation with an error margin of 0.03-4%. The\ndisk is parameterized by a modified innermost radius within the range of\n$(0.2-2)R_{ISCO}$, depending on the source's viewing angle and black hole spin.\nRelativistic effects near the black hole make an otherwise standard accretion\ndisk with inclination $\\theta <60^{\\circ}$ seem truncated to larger radii to a\ndistant observer. On the other hand, an edge-on view of the disk gives the\nperspective of being pulled closer to the central object than the respective\nISCO radius. In addition, we show that the observational data of Cygnus X-1 can\nbe satisfactorily fitted by employing a reasonably simple lepto-hadronic jet\nmodel and a hybrid thermal/non-thermal corona along with the Kerr-adjusted\nstandard accretion disk.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Z6dNYmqag--ltwmGB1IRXkT4DN1cC97juR1dOyUkbgU","pdfSize":"1812938","txDigest":"EcA6jTBQYcBCGAUinjiz4YjuJ63h42iJXpTkmkDczDZn","endEpoch":"1","status":"CERTIFIED"}
