{"id":"2408.07739","title":"From the Shadows: The Impact of Nightside Thermal Emission on Ultra-hot\n  Jupiter Transmission Spectra Retrievals","authors":"John A. Kappelmeier, Ryan J. MacDonald, Nikole K. Lewis","authorsParsed":[["Kappelmeier","John A.",""],["MacDonald","Ryan J.",""],["Lewis","Nikole K.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-16","timestamp":1723658400000,"abstract":"  Transmission spectroscopy is the most widely used technique for studying\nexoplanet atmospheres. Since the planetary nightside faces the observer during\na transit, highly irradiated giant exoplanets with warm nightsides emit thermal\nradiation that can contaminate transmission spectra. Observations of ultra-hot\nJupiters in the near- and mid-infrared with JWST are especially susceptible to\nnightside contamination. However, nightside thermal emission is generally not\nconsidered in atmospheric retrievals of exoplanet transmission spectra. Here,\nwe quantify the potential biases from neglecting nightside thermal emission in\nmultidimensional atmospheric retrievals of an ultra-hot Jupiter. Using\nsimulated JWST transmission spectra of the ultra-hot Jupiter WASP-33b (0.8-12\n$\\mu$m), we find that transmission spectra retrievals without nightside\nemission can overestimate molecular abundances by almost an order-of-magnitude\nand underestimate the dayside temperature by $\\gtrsim$ 400 K. We show that a\nmodified retrieval prescription, including both transmitted light and nightside\nthermal emission, correctly recovers the atmospheric properties and is favored\nby Bayesian model comparisons. Nightside thermal contamination can be readily\nimplemented in retrieval models via a first-order approximation, and we provide\nformulae to estimate whether this effect is likely to be significant for a\ngiven planet. We recommend that nightside emission should be included as\nstandard practice when interpreting ultra-hot Jupiter transmission spectra with\nJWST.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}