{"id":"2408.11986","title":"Magnetic proximity coupling to defects in a two-dimensional\n  semiconductor","authors":"Muhammad Hassan Shaikh, Matthew Whalen, Dai Q. Ho, Aqiq Ishraq, Collin\n  Maurtua, Kenji Watanabe, Takashi Taniguchi, Yafei Ren, Anderson Janotti, John\n  Xiao, and Chitraleema Chakraborty","authorsParsed":[["Shaikh","Muhammad Hassan",""],["Whalen","Matthew",""],["Ho","Dai Q.",""],["Ishraq","Aqiq",""],["Maurtua","Collin",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Ren","Yafei",""],["Janotti","Anderson",""],["Xiao","John",""],["Chakraborty","Chitraleema",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 20:45:12 GMT"}],"updateDate":"2024-08-23","timestamp":1724273112000,"abstract":"  The ultrathin structure and efficient spin dynamics of two-dimensional (2D)\nantiferromagnetic (AFM) materials hold unprecedented opportunities for\nultrafast memory devices, artificial intelligence circuits, and novel computing\ntechnology. For example, chromium thiophosphate (CrPS4) is one of the most\npromising 2D A-type AFM materials due to its robust stability in diverse\nenvironmental conditions and net out-of-plane magnetic moment in each layer,\nattributed to anisotropy in crystal axes (a and b). However, their net zero\nmagnetic moment poses a challenge for detecting the Neel state that is used to\nencode information. In this study, we demonstrate the detection of the Neel\nvector by detecting the magnetic order of the surface layer by employing\ndefects in tungsten diselenide (WSe2). These defects are ideal candidates for\noptically active transducers to probe the magnetic order due to their narrow\nlinewidth and high susceptibility to magnetic fields. We observed\nspin-polarized charge transfer in the heterostructure of bulk CrPS4 and\nsingle-layer WSe2 indicating type-II band alignment as supported by density\nfunctional theory (DFT) calculations. In the A-type AFM regime, the intensity\nof both right-handed and left-handed circularly polarized light emanating from\nthe sample remains constant as a function of the applied magnetic field,\nindicating a constant polarized transition behavior. Our results showcase a new\napproach to optically characterizing the magnetic states of 2D bulk AFM\nmaterial, highlighting avenues for future research and technological\napplications.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}