{"id":"2408.12115","title":"Cross-border Commodity Pricing Strategy Optimization via Mixed Neural\n  Network for Time Series Analysis","authors":"Lijuan Wang and Yijia Hu and Yan Zhou","authorsParsed":[["Wang","Lijuan",""],["Hu","Yijia",""],["Zhou","Yan",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 03:59:52 GMT"}],"updateDate":"2024-08-23","timestamp":1724299192000,"abstract":"  In the context of global trade, cross-border commodity pricing largely\ndetermines the competitiveness and market share of businesses. However,\nexisting methodologies often prove inadequate, as they lack the agility and\nprecision required to effectively respond to the dynamic international markets.\nTime series data is of great significance in commodity pricing and can reveal\nmarket dynamics and trends. Therefore, we propose a new method based on the\nhybrid neural network model CNN-BiGRU-SSA. The goal is to achieve accurate\nprediction and optimization of cross-border commodity pricing strategies\nthrough in-depth analysis and optimization of time series data. Our model\nundergoes experimental validation across multiple datasets. The results show\nthat our method achieves significant performance advantages on datasets such as\nUNCTAD, IMF, WITS and China Customs. For example, on the UNCTAD dataset, our\nmodel reduces MAE to 4.357, RMSE to 5.406, and R2 to 0.961, significantly\nbetter than other models. On the IMF and WITS datasets, our method also\nachieves similar excellent performance. These experimental results verify the\neffectiveness and reliability of our model in the field of cross-border\ncommodity pricing. Overall, this study provides an important reference for\nenterprises to formulate more reasonable and effective cross-border commodity\npricing strategies, thereby enhancing market competitiveness and profitability.\nAt the same time, our method also lays a foundation for the application of deep\nlearning in the fields of international trade and economic strategy\noptimization, which has important theoretical and practical significance.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computational Engineering, Finance, and Science","Economics/General Economics","Quantitative Finance/Economics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}