{"id":"2408.02083","title":"The Commensal Real-time ASKAP Fast Transient incoherent-sum survey","authors":"R. M. Shannon, K. W. Bannister, A. Bera, S. Bhandari, C. K. Day, A. T.\n  Deller, T. Dial, D. Dobie, R. D. Ekers, W.-f. Fong, M. Glowacki, A. C.\n  Gordon, K. Gourdji, A. Jaini, C. W. James, P. Kumar, E. K. Mahony, L.\n  Marnoch, A. R. Muller, J. X. Prochaska, H. Qiu, S. D. Ryder, E. M. Sadler, D.\n  R. Scott, N. Tejos, P. A. Uttarkar, and Y. Wang","authorsParsed":[["Shannon","R. M.",""],["Bannister","K. W.",""],["Bera","A.",""],["Bhandari","S.",""],["Day","C. K.",""],["Deller","A. T.",""],["Dial","T.",""],["Dobie","D.",""],["Ekers","R. D.",""],["Fong","W. -f.",""],["Glowacki","M.",""],["Gordon","A. C.",""],["Gourdji","K.",""],["Jaini","A.",""],["James","C. W.",""],["Kumar","P.",""],["Mahony","E. K.",""],["Marnoch","L.",""],["Muller","A. R.",""],["Prochaska","J. X.",""],["Qiu","H.",""],["Ryder","S. D.",""],["Sadler","E. M.",""],["Scott","D. R.",""],["Tejos","N.",""],["Uttarkar","P. A.",""],["Wang","Y.",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 16:36:50 GMT"}],"updateDate":"2024-08-06","timestamp":1722789410000,"abstract":"  With wide-field phased array feed technology, the Australian Square Kilometre\nArray Pathfinder (ASKAP) is ideally suited to search for seemingly rare radio\ntransient sources. The Commensal Real-time ASKAP Fast Transient (CRAFT) Survey\nScience Project has developed instrumentation to continuously search for fast\nradio transients (duration $\\lesssim$ 1 second) with ASKAP, with a particular\nfocus on finding and localising Fast Radio Bursts (FRBs). Of particular\ninterest are Fast Radio Bursts (FRBs). Since 2018, the CRAFT survey has been\nsearching for FRBs and other fast transients by incoherently adding the\nintensities received by individual ASKAP antennas, and then correcting for the\nimpact of frequency dispersion on these short-duration signals in the resultant\nincoherent sum (ICS) in real-time. This low-latency detection enables the\ntriggering of voltage buffers, which facilitates the localisation of the\ntransient source and the study spectro-polarimetric properties at high time\nresolution. Here we report the sample of 43 FRBs discovered in this CRAFT/ICS\nsurvey to date. This includes 22 FRBs that had not previously been reported: 16\nFRBs localised by ASKAP to $\\lesssim$ 1 arcsec and 6 FRBs localised to\napproximately 10 arcmin. Of the new arcsecond-localised FRBs, we have\nidentified and characterised host galaxies (and measured redshifts) for 11. The\nmedian of all 30 measured host redshifts from the survey to date is z = 0.23.\nWe summarise results from the searches, in particular those contributing to our\nunderstanding of the burst progenitors and emission mechanisms, and on the use\nof bursts as probes of intervening media. We conclude by foreshadowing future\nFRB surveys with ASKAP using a coherent detection system that is currently\nbeing commissioned.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_QJaz4lA70otNiW5T1vlScCc_nf1rqRpjngUY_jC5xY","pdfSize":"8514431","txDigest":"BbMbuf8vXSDFLqF4Rma7RNgf7WGELX7gokL2C3gUsvin","endEpoch":"1","status":"CERTIFIED"}
