{"id":"2408.13948","title":"Diversity and Multiplexing for Continuous Aperture Array (CAPA)-Based\n  Communications","authors":"Chongjun Ouyang, Zhaolin Wang, Xingqi Zhang, and Yuanwei Liu","authorsParsed":[["Ouyang","Chongjun",""],["Wang","Zhaolin",""],["Zhang","Xingqi",""],["Liu","Yuanwei",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 22:04:39 GMT"}],"updateDate":"2024-08-27","timestamp":1724623479000,"abstract":"  The performance of multiplexing and diversity achieved by continuous aperture\narrays (CAPAs) over fading channels is analyzed. Angular-domain fading models\nare derived for CAPA-based multiple-input single-output (MISO), single-input\nmultiple-output (SIMO), and multiple-input multiple-output (MIMO) channels\nusing the Fourier relationship between the spatial response and its\nangular-domain counterpart. Building on these models, angular-domain\ntransmission frameworks are proposed to facilitate CAPA-based communications,\nunder which the performance of multiplexing and diversity is analyzed. 1) For\nSIMO and MISO channels, closed-form expressions are derived for the average\ndata rate (ADR) and outage probability (OP). Additionally, asymptotic analyses\nare performed in the high signal-to-noise ratio (SNR) regime to unveil the\nmaximal multiplexing gain and maximal diversity gain. The\ndiversity-multiplexing trade-off (DMT) is also characterized, along with the\narray gain within the DMT framework. 2) For MIMO channels, high-SNR\napproximations are derived for the ADR and OP, based on which the DMT and\nassociated array gain are revealed. The performance of CAPAs is further\ncompared with that of conventional spatially discrete arrays (SPDAs) to\nhighlight the superiority of CAPAs. The analytical and numerical results\ndemonstrate that: i) compared to SPDAs, CAPAs achieve a lower OP and higher\nADR, resulting in better spectral efficiency; ii) CAPAs achieve the same DMT as\nSPDAs with half-wavelength antenna spacing while attaining a larger array gain;\nand iii) CAPAs achieve a better DMT than SPDAs with antenna spacing greater\nthan half a wavelength.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}