{"id":"2408.05024","title":"MIDI-to-Tab: Guitar Tablature Inference via Masked Language Modeling","authors":"Drew Edwards, Xavier Riley, Pedro Sarmento, Simon Dixon","authorsParsed":[["Edwards","Drew",""],["Riley","Xavier",""],["Sarmento","Pedro",""],["Dixon","Simon",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 12:25:23 GMT"}],"updateDate":"2024-08-12","timestamp":1723206323000,"abstract":"  Guitar tablatures enrich the structure of traditional music notation by\nassigning each note to a string and fret of a guitar in a particular tuning,\nindicating precisely where to play the note on the instrument. The problem of\ngenerating tablature from a symbolic music representation involves inferring\nthis string and fret assignment per note across an entire composition or\nperformance. On the guitar, multiple string-fret assignments are possible for\nmost pitches, which leads to a large combinatorial space that prevents\nexhaustive search approaches. Most modern methods use constraint-based dynamic\nprogramming to minimize some cost function (e.g.\\ hand position movement). In\nthis work, we introduce a novel deep learning solution to symbolic guitar\ntablature estimation. We train an encoder-decoder Transformer model in a masked\nlanguage modeling paradigm to assign notes to strings. The model is first\npre-trained on DadaGP, a dataset of over 25K tablatures, and then fine-tuned on\na curated set of professionally transcribed guitar performances. Given the\nsubjective nature of assessing tablature quality, we conduct a user study\namongst guitarists, wherein we ask participants to rate the playability of\nmultiple versions of tablature for the same four-bar excerpt. The results\nindicate our system significantly outperforms competing algorithms.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Computation and Language","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}