{"id":"2408.09931","title":"Pose-GuideNet: Automatic Scanning Guidance for Fetal Head Ultrasound\n  from Pose Estimation","authors":"Qianhui Men, Xiaoqing Guo, Aris T. Papageorghiou, J. Alison Noble","authorsParsed":[["Men","Qianhui",""],["Guo","Xiaoqing",""],["Papageorghiou","Aris T.",""],["Noble","J. Alison",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 12:11:50 GMT"}],"updateDate":"2024-08-20","timestamp":1724069510000,"abstract":"  3D pose estimation from a 2D cross-sectional view enables healthcare\nprofessionals to navigate through the 3D space, and such techniques initiate\nautomatic guidance in many image-guided radiology applications. In this work,\nwe investigate how estimating 3D fetal pose from freehand 2D ultrasound\nscanning can guide a sonographer to locate a head standard plane. Fetal head\npose is estimated by the proposed Pose-GuideNet, a novel 2D/3D registration\napproach to align freehand 2D ultrasound to a 3D anatomical atlas without the\nacquisition of 3D ultrasound. To facilitate the 2D to 3D cross-dimensional\nprojection, we exploit the prior knowledge in the atlas to align the standard\nplane frame in a freehand scan. A semantic-aware contrastive-based approach is\nfurther proposed to align the frames that are off standard planes based on\ntheir anatomical similarity. In the experiment, we enhance the existing\nassessment of freehand image localization by comparing the transformation of\nits estimated pose towards standard plane with the corresponding probe motion,\nwhich reflects the actual view change in 3D anatomy. Extensive results on two\nclinical head biometry tasks show that Pose-GuideNet not only accurately\npredicts pose but also successfully predicts the direction of the fetal head.\nEvaluations with probe motions further demonstrate the feasibility of adopting\nPose-GuideNet for freehand ultrasound-assisted navigation in a sensor-free\nenvironment.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"f0tpx1rzzrpY-YxpkBv-3Bf6iYU7NY7RMYbqsVsWBKo","pdfSize":"1547221"}
