{"id":"2408.00373","title":"Force and kinetics of fast and slow muscle myosin determined with a\n  synthetic sarcomere-like nanomachine","authors":"Valentina Buonfiglio, Irene Pertici, Matteo Marcello, Ilaria Morotti,\n  Marco Caremani, Massimo Reconditi, Marco Linari, Duccio Fanelli, Vincenzo\n  Lombardi, Pasquale Bianco","authorsParsed":[["Buonfiglio","Valentina",""],["Pertici","Irene",""],["Marcello","Matteo",""],["Morotti","Ilaria",""],["Caremani","Marco",""],["Reconditi","Massimo",""],["Linari","Marco",""],["Fanelli","Duccio",""],["Lombardi","Vincenzo",""],["Bianco","Pasquale",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 08:31:51 GMT"}],"updateDate":"2024-08-02","timestamp":1722501111000,"abstract":"  Myosin II is the muscle molecular motor that works in two bipolar arrays in\neach thick filament of the striated (skeletal and cardiac) muscle, converting\nthe chemical energy into steady force and shortening by cyclic ATP--driven\ninteractions with the nearby actin filaments. Different isoforms of the myosin\nmotor in the skeletal muscles account for the different functional requirements\nof the slow muscles (primarily responsible for the posture) and fast muscles\n(responsible for voluntary movements). To clarify the molecular basis of the\ndifferences, here the isoform--dependent mechanokinetic parameters underpinning\nthe force of slow and fast muscles are defined with a unidimensional synthetic\nnanomachine powered by pure myosin isoforms from either slow or fast rabbit\nskeletal muscle. Data fitting with a stochastic model provides a\nself--consistent estimate of all the mechanokinetic properties of the motor\nensemble including the motor force, the fraction of actin--attached motors and\nthe rate of transition through the attachment--detachment cycle. The\nachievements in this paper set the stage for any future study on the emergent\nmechanokinetic properties of an ensemble of myosin molecules either engineered\nor purified from mutant animal models or human biopsies.\n","subjects":["Condensed Matter/Statistical Mechanics","Quantitative Biology/Biomolecules","Quantitative Biology/Populations and Evolution","Quantitative Biology/Tissues and Organs"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}