{"id":"2408.01407","title":"Free energy, rates, and mechanism of transmembrane dimerization in lipid\n  bilayers from dynamically unbiased molecular dynamics simulations","authors":"Emil Jackel, Gianmarco Lazzeri, Roberto Covino","authorsParsed":[["Jackel","Emil",""],["Lazzeri","Gianmarco",""],["Covino","Roberto",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 17:33:34 GMT"}],"updateDate":"2024-08-05","timestamp":1722620014000,"abstract":"  The assembly of proteins in membranes plays a key role in many crucial\ncellular pathways. Despite their importance, characterizing transmembrane\nassembly remains challenging for experiments and simulations. Equilibrium\nmolecular dynamics simulations do not cover the time scales required to sample\nthe typical transmembrane assembly. Hence, most studies rely on enhanced\nsampling schemes that steer the dynamics of transmembrane proteins along a\ncollective variable that should encode all slow degrees of freedom. However,\ngiven the complexity of the condensed-phase lipid environment, this is far from\ntrivial, with the consequence that free energy profiles of dimerization can be\npoorly converged. Here, we introduce an alternative approach, which relies only\non simulating short, dynamically unbiased trajectory segments, avoiding using\ncollective variables or biasing forces. By merging all trajectories, we obtain\nfree energy profiles, rates, and mechanisms of transmembrane dimerization with\nthe same set of simulations. We showcase our algorithm by sampling the\nspontaneous association and dissociation of a transmembrane protein in a lipid\nbilayer, the popular coarse-grained Martini force field. Our algorithm\nrepresents a promising way to investigate assembly processes in biologically\nrelevant membranes, overcoming some of the challenges of conventional methods.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Chemical Physics","Quantitative Biology/Biomolecules"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"NyGkRippcCioFgBdVJRR2IfW_AmmgRy9wEm2e19LOwc","pdfSize":"3856000"}
