{"id":"2408.17121","title":"Traceable AI-driven Avatars Using Multi-factors of Physical World and\n  Metaverse","authors":"Kedi Yang, Zhenyong Zhang, Youliang Tian","authorsParsed":[["Yang","Kedi",""],["Zhang","Zhenyong",""],["Tian","Youliang",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 09:04:11 GMT"}],"updateDate":"2024-09-02","timestamp":1725008651000,"abstract":"  Metaverse allows users to delegate their AI models to an AI engine, which\nbuilds corresponding AI-driven avatars to provide immersive experience for\nother users. Since current authentication methods mainly focus on human-driven\navatars and ignore the traceability of AI-driven avatars, attackers may\ndelegate the AI models of a target user to an AI proxy program to perform\nimpersonation attacks without worrying about being detected.\n  In this paper, we propose an authentication method using multi-factors to\nguarantee the traceability of AI-driven avatars. Firstly, we construct a user's\nidentity model combining the manipulator's iris feature and the AI proxy's\npublic key to ensure that an AI-driven avatar is associated with its original\nmanipulator. Secondly, we propose a chameleon proxy signature scheme that\nsupports the original manipulator to delegate his/her signing ability to an AI\nproxy. Finally, we design three authentication protocols for avatars based on\nthe identity model and the chameleon proxy signature to guarantee the\nvirtual-to-physical traceability including both the human-driven and AI-driven\navatars.\n  Security analysis shows that the proposed signature scheme is unforgeability\nand the authentication method is able to defend against false accusation.\nExtensive evaluations show that the designed authentication protocols complete\nuser login, avatar delegation, mutual authentication, and avatar tracing in\nabout 1s, meeting the actual application needs and helping to mitigate\nimpersonation attacks by AI-driven avatars.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"SycFR8NPtoyxkGvG4hRaXqITXGiqLjyv8qPYau3BT5Q","pdfSize":"2621220"}
