{"id":"2408.16306","title":"High-temperature observation of intralayer, interlayer, and Rydberg\n  excitons in bulk van der Waals alloy single crystals","authors":"Pravrati Taank, Asif Ali, Aravind Raji, Ajay K. Poonia, Matthew C.\n  Beard, Ravi Shankar Singh and K. V. Adarsh","authorsParsed":[["Taank","Pravrati",""],["Ali","Asif",""],["Raji","Aravind",""],["Poonia","Ajay K.",""],["Beard","Matthew C.",""],["Singh","Ravi Shankar",""],["Adarsh","K. V.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 07:12:03 GMT"}],"updateDate":"2024-08-30","timestamp":1724915523000,"abstract":"  Transition metal dichalcogenides (TMDs) exhibit remarkable optical properties\ndue to the diverse number of strongly bound excitons, which can be fine-tuned\nby alloying. Despite a flurry of research activity in characterizing these\nexcitons, a comprehensive and profound understanding of their behavior with\ntemperature is lacking. Here, we report the rich spectrum of excitonic features\nwithin bulk van der Waals alloy Mo$_{0.5}$W$_{0.5}$S$_2$ and\nMo$_{0.5}$W$_{0.5}$Se$_2$ single crystals through temperature-dependent\nreflectance spectroscopy and first-principle calculations. We observed Rydberg\nexcitons and interlayer excitons in both the single crystals. Notably, we\nprovide the first experimental evidence of highly energetic A$^\\prime$ and\nB$^\\prime$ excitons in Mo$_{0.5}$W$_{0.5}$S$_2$ at room temperature. The strong\ncarrier-phonon scattering significantly broadens the A$^\\prime$, B$^\\prime$ and\ninterlayer excitons at room temperature in bulk Mo$_{0.5}$W$_{0.5}$S$_2$ single\ncrystal compared to its selenide. Our findings, supported by density functional\ntheory and Bethe-Salpeter equation calculations, signify the crucial role of\ncarrier-phonon interactions. These results open pathways for next-generation\noptoelectronic devices and quantum technologies operating at high temperature.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lUTAsWOWlvp-eWA-R8uwFd590MrqGwnrM56wgMlJY-0","pdfSize":"11006559"}
