{"id":"2408.15086","title":"Sample of hydrogen-rich superluminous supernovae from the Zwicky\n  Transient Facility","authors":"P.J. Pessi, R. Lunnan, J. Sollerman, S. Schulze, A. Gkini, A.\n  Gangopadhyay, L. Yan, A. Gal-Yam, D.A. Perley, T.-W. Chen, K.R. Hinds, S.J.\n  Brennan, Y. Hu, A. Singh, I. Andreoni, D.O. Cook, C. Fremling, A.Y.Q. Ho, Y.\n  Sharma, S. van Velzen, A. Wold, E.C. Bellm, J.S. Bloom, M.J. Graham, M.M.\n  Kasliwal, S.R. Kulkarni, R. Riddle, B. Rusholme","authorsParsed":[["Pessi","P. J.",""],["Lunnan","R.",""],["Sollerman","J.",""],["Schulze","S.",""],["Gkini","A.",""],["Gangopadhyay","A.",""],["Yan","L.",""],["Gal-Yam","A.",""],["Perley","D. A.",""],["Chen","T. -W.",""],["Hinds","K. R.",""],["Brennan","S. J.",""],["Hu","Y.",""],["Singh","A.",""],["Andreoni","I.",""],["Cook","D. O.",""],["Fremling","C.",""],["Ho","A. Y. Q.",""],["Sharma","Y.",""],["van Velzen","S.",""],["Wold","A.",""],["Bellm","E. C.",""],["Bloom","J. S.",""],["Graham","M. J.",""],["Kasliwal","M. M.",""],["Kulkarni","S. R.",""],["Riddle","R.",""],["Rusholme","B.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 14:18:41 GMT"}],"updateDate":"2024-08-28","timestamp":1724768321000,"abstract":"  Hydrogen-rich superluminous supernovae (SLSNe II) are rare. The exact\nmechanism producing their extreme light curve peaks is not understood. Analysis\nof single events and small samples suggest that CSM interaction is the main\nresponsible for their features. However, other mechanisms can not be discarded.\nLarge sample analysis can provide clarification. We aim to characterize the\nlight curves of a sample of 107 SLSNe II to provide valuable information that\ncan be used to validate theoretical models. We analyze the gri light curves of\nSLSNe II obtained through ZTF. We study peak absolute magnitudes and\ncharacteristic timescales. When possible we compute g-r colors,\npseudo-bolometric light curves, and estimate lower limits for their total\nradiated energy. We also study the luminosity distribution of our sample and\nestimate the percentage of them that would be observable by the LSST. Finally,\nwe compare our sample to other H-rich SNe and to H-poor SLSNe I. SLSNe II are\nheterogeneous. Their median peak absolute magnitude is -20.3 mag in optical\nbands. Their rise can take from two weeks to over three months, and their\ndecline from twenty days to over a year. We found no significant correlations\nbetween peak magnitude and timescales. SLSNe II tend to show fainter peaks,\nlonger declines and redder colors than SLSNe I. We present the largest sample\nof SLSNe II light curves to date, comprising of 107 events. Their diversity\ncould be explained by considering different CSM morphologies. Although,\ntheoretical analysis is needed to explore alternative scenarios. Other luminous\ntransients, such as Active Galactic Nuclei, Tidal Disruption Events or SNe\nIa-CSM, can easily become contaminants. Thus, good multi-wavelength light curve\ncoverage becomes paramount. LSST could miss 30 percent of the ZTF events in the\nits footprint in gri bands. Redder bands become important to construct complete\nsamples.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}