{"id":"2408.17107","title":"How Many Lines to Paint the City: Exact Edge-Cover in Temporal Graphs","authors":"Argyrios Deligkas, Michelle D\\\"oring, Eduard Eiben, Tiger-Lily\n  Goldsmith, George Skretas, Georg Tennigkeit","authorsParsed":[["Deligkas","Argyrios",""],["Döring","Michelle",""],["Eiben","Eduard",""],["Goldsmith","Tiger-Lily",""],["Skretas","George",""],["Tennigkeit","Georg",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 08:46:09 GMT"}],"updateDate":"2024-09-02","timestamp":1725007569000,"abstract":"  Logistics and transportation networks require a large amount of resources to\nrealize necessary connections between locations and minimizing these resources\nis a vital aspect of planning research. Since such networks have dynamic\nconnections that are only available at specific times, intricate models are\nneeded to portray them accurately. In this paper, we study the problem of\nminimizing the number of resources needed to realize a dynamic network, using\nthe temporal graphs model. In a temporal graph, edges appear at specific points\nin time. Given a temporal graph and a natural number k, we ask whether we can\ncover every temporal edge exactly once using at most k temporal journeys; in a\ntemporal journey consecutive edges have to adhere to the order of time. We\nconduct a thorough investigation of the complexity of the problem with respect\nto four dimensions: (a) whether the type of the temporal journey is a walk, a\ntrail, or a path; (b) whether the chronological order of edges in the journey\nis strict or non-strict; (c) whether the temporal graph is directed or\nundirected; (d) whether the start and end points of each journey are given or\nnot. We almost completely resolve the complexity of all these problems and\nprovide dichotomies for each one of them with respect to k.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Discrete Mathematics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}