{"id":"2408.02146","title":"Video-based Pedestrian and Vehicle Traffic Analysis During Football\n  Games","authors":"Jacques P. Fleischer, Ryan Pallack, Ahan Mishra, Gustavo Riente de\n  Andrade, Subhadipto Poddar, Emmanuel Posadas, Robert Schenck, Tania Banerjee,\n  Anand Rangarajan, and Sanjay Ranka","authorsParsed":[["Fleischer","Jacques P.",""],["Pallack","Ryan",""],["Mishra","Ahan",""],["de Andrade","Gustavo Riente",""],["Poddar","Subhadipto",""],["Posadas","Emmanuel",""],["Schenck","Robert",""],["Banerjee","Tania",""],["Rangarajan","Anand",""],["Ranka","Sanjay",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 21:09:09 GMT"}],"updateDate":"2024-08-06","timestamp":1722805749000,"abstract":"  This paper utilizes video analytics to study pedestrian and vehicle traffic\nbehavior, focusing on analyzing traffic patterns during football gamedays. The\nUniversity of Florida (UF) hosts six to seven home football games on Saturdays\nduring the college football season, attracting significant pedestrian activity.\nThrough video analytics, this study provides valuable insights into the impact\nof these events on traffic volumes and safety at intersections. Comparing\npedestrian and vehicle activities on gamedays versus non-gamedays reveals\ndiffering patterns. For example, pedestrian volume substantially increases\nduring gamedays, which is positively correlated with the probability of the\naway team winning. This correlation is likely because fans of the home team\nenjoy watching difficult games. Win probabilities as an early predictor of\npedestrian volumes at intersections can be a tool to help traffic professionals\nanticipate traffic management needs. Pedestrian-to-vehicle (P2V) conflicts\nnotably increase on gamedays, particularly a few hours before games start.\nAddressing this, a \"Barnes Dance\" movement phase within the intersection is\nrecommended. Law enforcement presence during high-activity gamedays can help\nensure pedestrian compliance and enhance safety. In contrast, we identified\nthat vehicle-to-vehicle (V2V) conflicts generally do not increase on gamedays\nand may even decrease due to heightened driver caution.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}