{"id":"2408.03482","title":"Beyond App Markets: Demystifying Underground Mobile App Distribution Via\n  Telegram","authors":"Yanhui Guo, Dong Wang, Liu Wang, Yongsheng Fang, Chao Wang, Minghui\n  Yang, Tianming Liu, and Haoyu Wang","authorsParsed":[["Guo","Yanhui",""],["Wang","Dong",""],["Wang","Liu",""],["Fang","Yongsheng",""],["Wang","Chao",""],["Yang","Minghui",""],["Liu","Tianming",""],["Wang","Haoyu",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 23:55:39 GMT"}],"updateDate":"2024-08-08","timestamp":1722988539000,"abstract":"  The thriving mobile app ecosystem encompasses a wide range of\nfunctionalities. However, within this ecosystem, a subset of apps provides\nillicit services such as gambling and pornography to pursue economic gains,\ncollectively referred to as \"underground economy apps\". While previous studies\nhave examined these apps' characteristics and identification methods,\ninvestigations into their distribution via platforms beyond app markets (like\nTelegram) remain scarce, which has emerged as a crucial channel for underground\nactivities and cybercrime due to the robust encryption and user anonymity.\n  This study provides the first comprehensive exploration of the underground\nmobile app ecosystem on Telegram. Overcoming the complexities of the Telegram\nenvironment, we build a novel dataset and analyze the prevalence, promotional\nstrategies, and characteristics of these apps. Our findings reveal that these\napps reach approximately 1% of Telegram's user base, primarily catering to\ngambling and pornography services. We uncover sophisticated promotional\nstrategies involving complex networks of apps, websites, users, and channels,\nand identify significant gaps in Telegram's content moderation capabilities.\nOur analysis also exposes the misuse of iOS features for app distribution and\nthe prevalence of malicious behaviors in these apps. This research not only\nenhances our understanding of the underground app ecosystem but also provides\nvaluable insights for developing effective regulatory measures and protecting\nusers from potential risks associated with these covert operations. Our\nfindings provide implications for platform regulators, app market operators,\nlaw enforcement agencies, and cybersecurity professionals in combating the\nproliferation of underground apps on encrypted messaging platforms.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}