{"id":"2408.01545","title":"Operator space fragmentation in perturbed Floquet-Clifford circuits","authors":"Marcell D. Kov\\'acs, Christopher J. Turner, Lluis Masanes, Arijeet Pal","authorsParsed":[["Kovács","Marcell D.",""],["Turner","Christopher J.",""],["Masanes","Lluis",""],["Pal","Arijeet",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 19:18:30 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 15:13:47 GMT"}],"updateDate":"2024-09-13","timestamp":1722626310000,"abstract":"  Floquet quantum circuits are able to realise a wide range of non-equilibrium\nquantum states, exhibiting quantum chaos, topological order and localisation.\nIn this work, we investigate the stability of operator localisation and\nemergence of chaos in random Floquet-Clifford circuits subjected to unitary\nperturbations which drive them away from the Clifford limit. We construct a\nnearest-neighbour Clifford circuit with a brickwork pattern and study the\neffect of including disordered non-Clifford gates. The perturbations are\nuniformly sampled from single-qubit unitaries with probability $p$ on each\nqubit. We show that the interacting model exhibits strong localisation of\noperators for $0 \\le p < 1$ that is characterised by the fragmentation of\noperator space into disjoint sectors due to the appearance of wall\nconfigurations. Such walls give rise to emergent local integrals of motion for\nthe circuit that we construct exactly. We analytically establish the stability\nof localisation against generic perturbations and calculate the average length\nof operator spreading tunable by $p$. Although our circuit is not separable\nacross any bi-partition, we further show that the operator localisation leads\nto an entanglement bottleneck, where initially unentangled states remain weakly\nentangled across typical fragment boundaries. Finally, we study the spectral\nform factor (SFF) to characterise the chaotic properties of the operator\nfragments and spectral fluctuations as a probe of non-ergodicity. In the $p =\n1$ model, the emergence of a fragmentation time scale is found before random\nmatrix theory sets in after which the SFF can be approximated by that of the\ncircular unitary ensemble. Our work provides an explicit description of quantum\nphases in operator dynamics and circuit ergodicity which can be realised on\ncurrent NISQ devices.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Disordered Systems and Neural Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}