{"id":"2408.00181","title":"CC-SAM: SAM with Cross-feature Attention and Context for Ultrasound\n  Image Segmentation","authors":"Shreyank N Gowda, David A. Clifton","authorsParsed":[["Gowda","Shreyank N",""],["Clifton","David A.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 22:24:05 GMT"}],"updateDate":"2024-08-02","timestamp":1722464645000,"abstract":"  The Segment Anything Model (SAM) has achieved remarkable successes in the\nrealm of natural image segmentation, but its deployment in the medical imaging\nsphere has encountered challenges. Specifically, the model struggles with\nmedical images that feature low contrast, faint boundaries, intricate\nmorphologies, and small-sized objects. To address these challenges and enhance\nSAM's performance in the medical domain, we introduce a comprehensive\nmodification. Firstly, we incorporate a frozen Convolutional Neural Network\n(CNN) branch as an image encoder, which synergizes with SAM's original Vision\nTransformer (ViT) encoder through a novel variational attention fusion module.\nThis integration bolsters the model's capability to capture local spatial\ninformation, which is often paramount in medical imagery. Moreover, to further\noptimize SAM for medical imaging, we introduce feature and position adapters\nwithin the ViT branch, refining the encoder's representations. We see that\ncompared to current prompting strategies to fine-tune SAM for ultrasound\nmedical segmentation, the use of text descriptions that serve as text prompts\nfor SAM helps significantly improve the performance. Leveraging ChatGPT's\nnatural language understanding capabilities, we generate prompts that offer\ncontextual information and guidance to SAM, enabling it to better understand\nthe nuances of ultrasound medical images and improve its segmentation accuracy.\nOur method, in its entirety, represents a significant stride towards making\nuniversal image segmentation models more adaptable and efficient in the medical\ndomain.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PScIL9mG2jweCLJoZmWVmvMz7RFMQu1IZs3D1TO6L5Q","pdfSize":"3818278","txDigest":"AqLSg2V3TMchazK6ZbwoCxa4Vo3t5nz9VzwSHzybBUnN","endEpoch":"1","status":"CERTIFIED"}
