{"id":"2408.07110","title":"Physics-informed graph neural networks for flow field estimation in\n  carotid arteries","authors":"Julian Suk, Dieuwertje Alblas, Barbara A. Hutten, Albert Wiegman,\n  Christoph Brune, Pim van Ooij and Jelmer M. Wolterink","authorsParsed":[["Suk","Julian",""],["Alblas","Dieuwertje",""],["Hutten","Barbara A.",""],["Wiegman","Albert",""],["Brune","Christoph",""],["van Ooij","Pim",""],["Wolterink","Jelmer M.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 13:09:28 GMT"}],"updateDate":"2024-08-15","timestamp":1723554568000,"abstract":"  Hemodynamic quantities are valuable biomedical risk factors for\ncardiovascular pathology such as atherosclerosis. Non-invasive, in-vivo\nmeasurement of these quantities can only be performed using a select number of\nmodalities that are not widely available, such as 4D flow magnetic resonance\nimaging (MRI). In this work, we create a surrogate model for hemodynamic flow\nfield estimation, powered by machine learning. We train graph neural networks\nthat include priors about the underlying symmetries and physics, limiting the\namount of data required for training. This allows us to train the model using\nmoderately-sized, in-vivo 4D flow MRI datasets, instead of large in-silico\ndatasets obtained by computational fluid dynamics (CFD), as is the current\nstandard. We create an efficient, equivariant neural network by combining the\npopular PointNet++ architecture with group-steerable layers. To incorporate the\nphysics-informed priors, we derive an efficient discretisation scheme for the\ninvolved differential operators. We perform extensive experiments in carotid\narteries and show that our model can accurately estimate low-noise hemodynamic\nflow fields in the carotid artery. Moreover, we show how the learned relation\nbetween geometry and hemodynamic quantities transfers to 3D vascular models\nobtained using a different imaging modality than the training data. This shows\nthat physics-informed graph neural networks can be trained using 4D flow MRI\ndata to estimate blood flow in unseen carotid artery geometries.\n","subjects":["Quantitative Biology/Quantitative Methods","Computing Research Repository/Machine Learning","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"34Bd7YA37roy2GjOqN8tq1e7K2Vpe6Iy1R_5nVrzrcI","pdfSize":"6687596"}
