{"id":"2408.06788","title":"Visual Neural Decoding via Improved Visual-EEG Semantic Consistency","authors":"Hongzhou Chen, Lianghua He, Yihang Liu, Longzhen Yang","authorsParsed":[["Chen","Hongzhou",""],["He","Lianghua",""],["Liu","Yihang",""],["Yang","Longzhen",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 10:16:10 GMT"}],"updateDate":"2024-08-14","timestamp":1723544170000,"abstract":"  Visual neural decoding refers to the process of extracting and interpreting\noriginal visual experiences from human brain activity. Recent advances in\nmetric learning-based EEG visual decoding methods have delivered promising\nresults and demonstrated the feasibility of decoding novel visual categories\nfrom brain activity. However, methods that directly map EEG features to the\nCLIP embedding space may introduce mapping bias and cause semantic\ninconsistency among features, thereby degrading alignment and impairing\ndecoding performance. To further explore the semantic consistency between\nvisual and neural signals. In this work, we construct a joint semantic space\nand propose a Visual-EEG Semantic Decouple Framework that explicitly extracts\nthe semantic-related features of these two modalities to facilitate optimal\nalignment. Specifically, a cross-modal information decoupling module is\nintroduced to guide the extraction of semantic-related information from\nmodalities. Then, by quantifying the mutual information between visual image\nand EEG features, we observe a strong positive correlation between the decoding\nperformance and the magnitude of mutual information. Furthermore, inspired by\nthe mechanisms of visual object understanding from neuroscience, we propose an\nintra-class geometric consistency approach during the alignment process. This\nstrategy maps visual samples within the same class to consistent neural\npatterns, which further enhances the robustness and the performance of EEG\nvisual decoding. Experiments on a large Image-EEG dataset show that our method\nachieves state-of-the-art results in zero-shot neural decoding tasks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}