{"id":"2408.16823","title":"The cosmic rate of Pair-Instability Supernovae","authors":"Francesco Gabrielli, Andrea Lapi, Lumen Boco, Cristiano Ugolini,\n  Guglielmo Costa, Cecilia Sgalletta, Kendall Shepherd, Ugo N. Di Carlo,\n  Alessandro Bressan, Marco Limongi, Mario Spera","authorsParsed":[["Gabrielli","Francesco",""],["Lapi","Andrea",""],["Boco","Lumen",""],["Ugolini","Cristiano",""],["Costa","Guglielmo",""],["Sgalletta","Cecilia",""],["Shepherd","Kendall",""],["Di Carlo","Ugo N.",""],["Bressan","Alessandro",""],["Limongi","Marco",""],["Spera","Mario",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:00:02 GMT"}],"updateDate":"2024-09-02","timestamp":1724954402000,"abstract":"  Pair-instability supernovae (PISNe) have crucial implications for many\nastrophysical topics, including the search for very massive stars, the black\nhole mass spectrum, and galaxy chemical enrichment. To this end, we need to\nunderstand where PISNe are across cosmic time, and what are their favourable\ngalactic environments. We present a new determination of the PISN rate as a\nfunction of redshift, obtained by combining up-to-date stellar evolution tracks\nfrom the PARSEC and FRANEC codes, with an up-to-date semi-empirical\ndetermination of the star formation rate and metallicity evolution of\nstar-forming galaxies throughout cosmic history. We find the PISN rate to\nexhibit a huge dependence on the model assumptions, including the criterion to\nidentify stars unstable to pair production, and the upper limit of the stellar\ninitial mass function. Remarkably, the interplay between the maximum\nmetallicity at which stars explode as PISNe, and the dispersion of the galaxy\nmetallicity distribution, dominates the uncertainties, causing a $\\sim$\nseven-orders-of-magnitude PISN rate range. Furthermore, we show a comparison\nwith the core-collapse supernova rate, and study the properties of the\nfavourable PISN host galaxies. According to our results, the main contribution\nto the PISN rate comes from metallicities between $\\sim 10^{-3}$ and $10^{-2}$,\nagainst the common assumption that views very-low-metallicity, Population III\nstars as exclusive or dominant PISN progenitors. The strong dependencies we\nfind offer the opportunity to constrain stellar and galaxy evolution models\nbased on possible future (or the lack of) PISN observations.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}