{"id":"2408.10878","title":"DBHP: Trajectory Imputation in Multi-Agent Sports Using Derivative-Based\n  Hybrid Prediction","authors":"Hanjun Choi, Hyunsung Kim, Minho Lee, Chang-Jo Kim, Jinsung Yoon,\n  Sang-Ki Ko","authorsParsed":[["Choi","Hanjun",""],["Kim","Hyunsung",""],["Lee","Minho",""],["Kim","Chang-Jo",""],["Yoon","Jinsung",""],["Ko","Sang-Ki",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 14:08:16 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 01:27:46 GMT"}],"updateDate":"2024-08-26","timestamp":1724162896000,"abstract":"  Many spatiotemporal domains handle multi-agent trajectory data, but in\nreal-world scenarios, collected trajectory data are often partially missing due\nto various reasons. While existing approaches demonstrate good performance in\ntrajectory imputation, they face challenges in capturing the complex dynamics\nand interactions between agents due to a lack of physical constraints that\ngovern realistic trajectories, leading to suboptimal results. To address this\nissue, the paper proposes a Derivative-Based Hybrid Prediction (DBHP) framework\nthat can effectively impute multiple agents' missing trajectories. First, a\nneural network equipped with Set Transformers produces a naive prediction of\nmissing trajectories while satisfying the permutation-equivariance in terms of\nthe order of input agents. Then, the framework makes alternative predictions\nleveraging velocity and acceleration information and combines all the\npredictions with properly determined weights to provide final imputed\ntrajectories. In this way, our proposed framework not only accurately predicts\nposition, velocity, and acceleration values but also enforces the physical\nrelationship between them, eventually improving both the accuracy and\nnaturalness of the predicted trajectories. Accordingly, the experiment results\nabout imputing player trajectories in team sports show that our framework\nsignificantly outperforms existing imputation baselines.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"lWcowQ6wXATdTWRuNLYkNJ8FCz8zzSniY0dPluk0A5s","pdfSize":"2787373"}
