{"id":"2408.01958","title":"Decoherence induced by dipole-dipole couplings between atomic species in\n  rare-earth ion-doped Y$_2$SiO$_5$","authors":"Charlotte Pignol, Antonio Ortu, Louis Nicolas, Virginia D'Auria,\n  Sebastien Tanzilli, Thierry Chaneli\\`ere, Mikael Afzelius, Jean Etesse","authorsParsed":[["Pignol","Charlotte",""],["Ortu","Antonio",""],["Nicolas","Louis",""],["D'Auria","Virginia",""],["Tanzilli","Sebastien",""],["Chanelière","Thierry",""],["Afzelius","Mikael",""],["Etesse","Jean",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 08:26:03 GMT"}],"updateDate":"2024-08-06","timestamp":1722759963000,"abstract":"  Rare-earth ion doped crystals are state-of-the-art platforms for processing\nquantum information, particularly thanks to their excellent optical and spin\ncoherence properties at cryogenic temperatures. Experimental observations have\nshown that the application of a static magnetic bias field significantly\nimproves the coherence times in the rare-earth ions ensemble, but only a few\nstudies have focused on its the dependency as a function of both magnetic field\ndirection and amplitude. This is especially true for magnetic field amplitudes\nunder the mT, and for low magnetic dipole moment ions. In this paper, we\ninvestigate the relationship between the magnetic field parameters and the\ndecoherence caused by magnetic dipole-dipole coupling with the nearest\nneighbors nuclear spins in the crystal. The primary non-Kramers rare-earth ions\ninvestigated here are europium and praseodymium, but we also extend our study\nto the ytterbium Kramers ion due to its low magnetic dipole in the mT range. We\nperform theoretical investigations and simulations of the energy structure and\ncoherence time evolution and identify good correspondences between experimental\nand simulated spin echo data. This work allows us to pinpoint the most relevant\ndecoherence mechanisms in the considered magnetic field regime, and to predict\nfavorable magnetic configurations.\n","subjects":["Physics/Quantum Physics","Physics/Atomic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"q4cQSvYskQ08Yw3JLImaZHxz43zvtMeLaELeH1r4WYY","pdfSize":"6131459","txDigest":"3LHxYBP7XiUZpwz59LV2yrZsBKzKEcbKuY1KrvtDf8vs","endEpoch":"1","status":"CERTIFIED"}
