{"id":"2408.12191","title":"Transientangelo: Few-Viewpoint Surface Reconstruction Using\n  Single-Photon Lidar","authors":"Weihan Luo, Anagh Malik, David B. Lindell","authorsParsed":[["Luo","Weihan",""],["Malik","Anagh",""],["Lindell","David B.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 08:12:09 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 07:26:36 GMT"}],"updateDate":"2024-08-26","timestamp":1724314329000,"abstract":"  We consider the problem of few-viewpoint 3D surface reconstruction using raw\nmeasurements from a lidar system. Lidar captures 3D scene geometry by emitting\npulses of light to a target and recording the speed-of-light time delay of the\nreflected light. However, conventional lidar systems do not output the raw,\ncaptured waveforms of backscattered light; instead, they pre-process these data\ninto a 3D point cloud. Since this procedure typically does not accurately model\nthe noise statistics of the system, exploit spatial priors, or incorporate\ninformation about downstream tasks, it ultimately discards useful information\nthat is encoded in raw measurements of backscattered light. Here, we propose to\nleverage raw measurements captured with a single-photon lidar system from\nmultiple viewpoints to optimize a neural surface representation of a scene. The\nmeasurements consist of time-resolved photon count histograms, or transients,\nwhich capture information about backscattered light at picosecond time scales.\nAdditionally, we develop new regularization strategies that improve robustness\nto photon noise, enabling accurate surface reconstruction with as few as 10\nphotons per pixel. Our method outperforms other techniques for few-viewpoint 3D\nreconstruction based on depth maps, point clouds, or conventional lidar as\ndemonstrated in simulation and with captured data.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9XSOiJnvKEYIZ65lsyGKYkvrYwuGOGvbseVXWFm5LNk","pdfSize":"17654658"}
