{"id":"2408.06680","title":"A global summary of seafloor topography influenced by turbulent water\n  mixing","authors":"Hans van Haren and Henk de Haas","authorsParsed":[["van Haren","Hans",""],["de Haas","Henk",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 07:13:58 GMT"}],"updateDate":"2024-08-14","timestamp":1723533238000,"abstract":"  Turbulent water motions are important for the exchange of momentum, heat,\nnutrients, and suspended matter including sediments in the deep-sea that is\ngenerally stably stratified in density. To maintain ocean-density\nstratification, an irreversible diapycnal turbulent transport is needed. The\ngeological shape and texture of marine topography is important for water mixing\nas most of deep-sea turbulence is generated via breaking internal waves at\nsloping seafloors. For example, slopes of semidiurnal internal tidal\ncharacteristics can critically match the mean seafloor slope. In this paper,\nthe concept of critical slopes are revisited from a global internal\nwave-turbulence viewpoint seafloor topography -- and using moored\nhigh-resolution temperature sensor data. Observations suggest that turbulence\ngeneration via internal wave breaking at 5+/-1.5% of all seafloors is\nsufficient to maintain ocean-density stratification. However most, >90%,\nturbulence contribution is found at supercritical, rather than the more limited\ncritical, slopes measured at 1-minute-scales that cover about 50% of seafloors\nat water depths < 2000 m. Internal tides (about 60%) dominate over\nnear-inertial waves (about 40%), which is confirmed from comparison of\nNE-Atlantic data with East-Mediterranean data (no tides). Seafloor-elevation\nspectra show a wavenumber (k) fall-off rate of k^-3, which is steeper than\npreviously found. The fall-off rate is even steeper, resulting in less\nelevation-variance, in a one-order-of-magnitude bandwidth around k_T=0.5\ncycle-per-km. The corresponding length is equivalent to the internal tidal\nexcursion. The reduction in seafloor-elevation variance seems associated with\nerosion by internal wave breaking. Potential robustness of the\nseafloor-internal wave interaction is discussed.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ub29ulQwa4tHG2mLL_gODE5XAApjPwhH7m8qIgvtmHY","pdfSize":"587842"}
