{"id":"2408.13717","title":"Stochastic Generalized-Order Constitutive Modeling of Viscoelastic\n  Spectra of Polyurea-Graphene Nanocomposites","authors":"Arman Khoshnevis, Demetrios A. Tzelepis, Valeriy V. Ginzburg, Mohsen\n  Zayernouri","authorsParsed":[["Khoshnevis","Arman",""],["Tzelepis","Demetrios A.",""],["Ginzburg","Valeriy V.",""],["Zayernouri","Mohsen",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 03:56:24 GMT"}],"updateDate":"2024-08-27","timestamp":1724558184000,"abstract":"  Polyurea (PUa) elastomers are extensively used in a wide range of\napplications spanning from biomedical to defense fields due to their enabling\nmechanical properties. These materials can be further reinforced through the\nincorporation of nanoparticles to form nanocomposites. This study focuses on an\nIPDI-based PUa matrix with exfoliated graphene nanoplatelet (xGnP) fillers. We\npropose a generalized constitutive model by integrating one Fractional Maxwell\nModel (FMM) and one Fractional Maxwell Gel (FMG) branch in a parallel\nconfiguration via introducing a new dimensionless number to bridge between\nthese branches physically and mathematically. Through systematic\nlocal-to-global sensitivity analyses, we investigate the behavior of these\nnanocomposites to facilitate simulation, design, and performance prediction.\nConsistently, the constructed models share the same most/least influential\nmodel parameters. $\\alpha_1$ and $E_{c_1}$, the power exponent and the\ncharacteristic modulus of the first branch, are found to be the most\ninfluential model parameters, while $\\tau_{c_2}$ and $\\tau_{c_1}$, the\ncharacteristic time-scales of each branch, are recognized as the least\ninfluential model parameters. The proposed PU nanocomposite constitutive laws\ncan now make an impact to the design and optimization of coating and\nshock-absorbing coatings in a range of applications.\n","subjects":["Mathematics/Numerical Analysis","Condensed Matter/Materials Science","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}