{"id":"2408.04752","title":"A Multi-Level Task Framework for Event Sequence Analysis","authors":"Kazi Tasnim Zinat, Saimadhav Naga Sakhamuri, Aaron Sun Chen and\n  Zhicheng Liu","authorsParsed":[["Zinat","Kazi Tasnim",""],["Sakhamuri","Saimadhav Naga",""],["Chen","Aaron Sun",""],["Liu","Zhicheng",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 20:35:35 GMT"}],"updateDate":"2024-08-12","timestamp":1723149335000,"abstract":"  Despite the development of numerous visual analytics tools for event sequence\ndata across various domains, including but not limited to healthcare, digital\nmarketing, and user behavior analysis, comparing these domain-specific\ninvestigations and transferring the results to new datasets and problem areas\nremain challenging. Task abstractions can help us go beyond domain-specific\ndetails, but existing visualization task abstractions are insufficient for\nevent sequence visual analytics because they primarily focus on multivariate\ndatasets and often overlook automated analytical techniques. To address this\ngap, we propose a domain-agnostic multi-level task framework for event sequence\nanalytics, derived from an analysis of 58 papers that present event sequence\nvisualization systems. Our framework consists of four levels: objective,\nintent, strategy, and technique. Overall objectives identify the main goals of\nanalysis. Intents comprises five high-level approaches adopted at each analysis\nstep: augment data, simplify data, configure data, configure visualization, and\nmanage provenance. Each intent is accomplished through a number of strategies,\nfor instance, data simplification can be achieved through aggregation,\nsummarization, or segmentation. Finally, each strategy can be implemented by a\nset of techniques depending on the input and output components. We further show\nthat each technique can be expressed through a quartet of\naction-input-output-criteria. We demonstrate the framework's descriptive power\nthrough case studies and discuss its similarities and differences with previous\nevent sequence task taxonomies.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}