{"id":"2408.00041","title":"Con4m: Context-aware Consistency Learning Framework for Segmented Time\n  Series Classification","authors":"Junru Chen, Tianyu Cao, Jing Xu, Jiahe Li, Zhilong Chen, Tao Xiao,\n  Yang Yang","authorsParsed":[["Chen","Junru",""],["Cao","Tianyu",""],["Xu","Jing",""],["Li","Jiahe",""],["Chen","Zhilong",""],["Xiao","Tao",""],["Yang","Yang",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 14:06:55 GMT"}],"updateDate":"2024-08-02","timestamp":1722434815000,"abstract":"  Time Series Classification (TSC) encompasses two settings: classifying entire\nsequences or classifying segmented subsequences. The raw time series for\nsegmented TSC usually contain Multiple classes with Varying Duration of each\nclass (MVD). Therefore, the characteristics of MVD pose unique challenges for\nsegmented TSC, yet have been largely overlooked by existing works.\nSpecifically, there exists a natural temporal dependency between consecutive\ninstances (segments) to be classified within MVD. However, mainstream TSC\nmodels rely on the assumption of independent and identically distributed\n(i.i.d.), focusing on independently modeling each segment. Additionally,\nannotators with varying expertise may provide inconsistent boundary labels,\nleading to unstable performance of noise-free TSC models. To address these\nchallenges, we first formally demonstrate that valuable contextual information\nenhances the discriminative power of classification instances. Leveraging the\ncontextual priors of MVD at both the data and label levels, we propose a novel\nconsistency learning framework Con4m, which effectively utilizes contextual\ninformation more conducive to discriminating consecutive segments in segmented\nTSC tasks, while harmonizing inconsistent boundary labels for training.\nExtensive experiments across multiple datasets validate the effectiveness of\nCon4m in handling segmented TSC tasks on MVD.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}