{"id":"2408.06762","title":"Graph Neural Network Approach to Predict the Effects of Road Capacity\n  Reduction Policies: A Case Study for Paris, France","authors":"Elena Natterer, Roman Engelhardt, Sebastian H\\\"orl, Klaus Bogenberger","authorsParsed":[["Natterer","Elena",""],["Engelhardt","Roman",""],["Hörl","Sebastian",""],["Bogenberger","Klaus",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 09:38:59 GMT"}],"updateDate":"2024-08-14","timestamp":1723541939000,"abstract":"  Rapid urbanization and growing urban populations worldwide present\nsignificant challenges for cities, including increased traffic congestion and\nair pollution. Effective strategies are needed to manage traffic volumes and\nreduce emissions. In practice, traditional traffic flow simulations are used to\ntest those strategies. However, high computational intensity usually limits\ntheir applicability in investigating a magnitude of different scenarios to\nevaluate best policies. This paper introduces an innovative approach to assess\nthe effects of traffic policies using Graph Neural Networks (GNN). By\nincorporating complex transport network structures directly into the neural\nnetwork, this approach could enable rapid testing of various policies without\nthe delays associated with traditional simulations. We provide a proof of\nconcept that GNNs can learn and predict changes in car volume resulting from\ncapacity reduction policies. We train a GNN model based on a training set\ngenerated with a MATSim simulation for Paris, France. We analyze the model's\nperformance across different road types and scenarios, finding that the GNN is\ngenerally able to learn the effects on edge-based traffic volume induced by\npolicies. The model is especially successful in predicting changes on major\nstreets. Nevertheless, the evaluation also showed that the current model has\nproblems in predicting impacts of spatially small policies and changes in\ntraffic volume in regions where no policy is applied due to spillovers and/or\nrelocation of traffic.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"V7brq33ObC1n1btxd2yhgSspp0nS6wDUuPRakcaahXg","pdfSize":"5052630"}
