{"id":"2408.00366","title":"Singlet-Triplet Kondo Effect in Blatter Radical Molecular Junctions:\n  Zero-bias Anomalies and Magnetoresistance","authors":"Gautam Mitra, Jueting Zheng, Karen Schaefer, Michael Deffner, Jonathan\n  Z. Low, Luis M. Campos, Carmen Herrmann, Theo A. Costi, Elke Scheer","authorsParsed":[["Mitra","Gautam",""],["Zheng","Jueting",""],["Schaefer","Karen",""],["Deffner","Michael",""],["Low","Jonathan Z.",""],["Campos","Luis M.",""],["Herrmann","Carmen",""],["Costi","Theo A.",""],["Scheer","Elke",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 08:13:21 GMT"}],"updateDate":"2024-08-02","timestamp":1722500001000,"abstract":"  The Blatter radical has been suggested as a building block in future\nmolecular spintronic devices due to its radical character and expected\nlong-spin lifetime. However, whether and how the radical character manifests\nitself in the charge transport and magnetotransport properties seems to depend\non the environment or has not yet been studied. Here, we investigate\nsingle-molecule junctions of the Blatter radical molecule in a mechanically\ncontrolled break junction device at low temperature. Differential conductance\nspectroscopy on individual junctions shows two types of zero-bias anomalies\nattributed to Kondo resonances revealing the ability to retain the open-shell\nnature of the radical molecule in a two-terminal device. Additionally, a high\nnegative magnetoresistance is also observed in junctions without showing a\nzero-bias peak. We posit that the high negative magnetoresistance is due to the\neffect of a singlet-triplet Kondo effect under magnetic field originating from\na double-quantum-dot system consisting of a Blatter radical molecule with a\nstrong correlation to a second side-coupled molecule. Our findings not only\nprovide the possibility of using the Blatter radical in a two-terminal system\nunder cryogenic conditions but also reveal the magnetotransport properties\nemerging from different configurations of the molecule inside a junction.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/"}