{"id":"2408.11082","title":"A Study of Stochastic Low-Frequency Variability for Galactic O-type\n  Stars","authors":"Dong-Xiang Shen, Chun-Hua Zhu, Guo-Liang Lv, Xi-zhen Lu, Xiao-long He","authorsParsed":[["Shen","Dong-Xiang",""],["Zhu","Chun-Hua",""],["Lv","Guo-Liang",""],["Lu","Xi-zhen",""],["He","Xiao-long",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 04:39:10 GMT"}],"updateDate":"2024-08-22","timestamp":1724215150000,"abstract":"  In order to explore how the ubiquitous stochastic low-frequency (SLF)\nvariability of O-type stars is related to various stellar characteristics, we\ncompiled a sample of 150 O-type stars observed via ground-based spectroscopic\nsurveys, alongside photometric data obtained from the Transiting Exoplanet\nSurvey Satellite (TESS). We analyzed 298 light curves obtained from TESS\nsectors 1-65 for the stars in our sample. Leveraging the spectroscopic\nparameters, we used Bonnsai to determine masses, radii, fractional main\nsequence ages, and mass-loss rates for stars of our sample. Subsequently, we\nidentified possible correlations between the fitted parameters of SLF\nvariability and stellar properties. Our analysis unveiled four significant\ncorrelations between the amplitude and stellar parameters, including mass,\nradius, fractional main sequence ages, and mass-loss rate. For stars with $M\n\\gtrsim 30 M_{\\odot}$, we observed a decrease in characteristic frequency and\nsteepness with increasing radius. Finally, we compared various physical\nprocesses that may account for the SLF variability with our results. The\nobserved SLF variability may arise from the combined effects of FeCZ and IGWs,\nwith IGWs potentially more dominant in the early stages of stellar evolution,\nand the contribution of FeCZ becoming more significant as stars evolve.\nMeanwhile, our results indicate that the SLF variability of O-type stars bears\ncertain signatures of the line-driven wind instability and granulation.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}