{"id":"2408.06298","title":"Fermi Surface Topology and Magneto-transport Properties of\n  Superconducting Pd$_3$Bi$_2$Se$_2$","authors":"Ramakanta Chapai, Gordon Peterson, M. P. Smylie, Xinglong Chen, J. S.\n  Jiang, David Graf, J. F. Mitchell, and Ulrich Welp","authorsParsed":[["Chapai","Ramakanta",""],["Peterson","Gordon",""],["Smylie","M. P.",""],["Chen","Xinglong",""],["Jiang","J. S.",""],["Graf","David",""],["Mitchell","J. F.",""],["Welp","Ulrich",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 17:09:12 GMT"}],"updateDate":"2024-08-13","timestamp":1723482552000,"abstract":"  Pd$_3$Bi$_2$Se$_2$ is a rare realization of a superconducting metal with a\nnon-zero $Z_2$ topological invariant. We report the growth of high-quality\nsingle crystals of layered Pd$_3$Bi$_2$Se$_2$ with a superconducting transition\nat $T_c$ ~ 0.80 K and upper critical fields of ~10 mT and ~5 mT for the\nin-plane and out-of-plane directions, respectively. Our density functional\ntheory (DFT) calculations reveal three pairs of doubly degenerate bands\ncrossing the Fermi level, all displaying clear three-dimensional dispersion\nconsistent with the overall low electronic anisotropy (<2). The multiband\nelectronic nature of Pd$_3$Bi$_2$Se$_2$ is evident in magneto-transport\nmeasurements, yielding a sign-changing Hall resistivity at low temperatures.\nThe magnetoresistance is non-saturating and follows Kohler's scaling rule. We\ninterpret the magneto-transport data in terms of open orbits that are revealed\nin the DFT-calculated Fermi surface. de Haas-van Alphen (dHvA) oscillation\nmeasurements using torque magnetometry on single crystals yield four\nfrequencies for out-of-plane fields: $F_\\alpha = (150 \\pm 26)$T, $F_\\beta =\n(293 \\pm 10)$T, $F_\\gamma = (375 \\pm 20)$T, and $F_\\eta = (1017 \\pm 12)$T, with\nthe low frequency dominating the spectrum. Through the measurement of angular\ndependent dHvA oscillations and DFT calculations, we identify the $F_\\alpha$\nfrequency with an approximately ellipsoidal electron pocket centered on the\n$L_2$ point of the Brillouin zone. Lifshitz-Kosevich analysis of the dHvA\noscillations reveals a small cyclotron effective mass: $m^* = (0.11 \\pm 0.02)\nm_0$ and a nontrivial Berry phase for the dominant orbit. The presence of\nnontrivial topology in a bulk superconductor positions Pd$_3$Bi$_2$Se$_2$ as a\npotential candidate for exploring topological superconductivity.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_LoNgqA0QrLt_0PBJM6B1N8UiBHoiS5OZfSqQ0Znvqo","pdfSize":"1730536"}
