{"id":"2408.03985","title":"A Candidate Giant Planet Companion to the Massive, Young White Dwarf\n  GALEX J071816.4+373139 Informs the Occurrence of Giant Planets Orbiting B\n  Stars","authors":"Sihao Cheng, Kevin C. Schlaufman, Ilaria Caiazzo","authorsParsed":[["Cheng","Sihao",""],["Schlaufman","Kevin C.",""],["Caiazzo","Ilaria",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-09","timestamp":1723053600000,"abstract":"  It has been suggested that giant planet occurrence peaks for stars with\n$M_{\\ast}~\\approx~3~M_{\\odot}$ at a value a factor of four higher than observed\nfor solar-mass stars. This population of giant planets predicted to frequently\norbit main sequence B stars at $a~\\approx~10$ AU is difficult to characterize\nobservationally while fusion persists in their host stars. Fortunately, stars\nwith $M_{\\ast}~\\gtrsim~3~M_{\\odot}$ sustain fusion for only a few hundred\nmillion years. By the time those stars become massive, young white dwarfs, any\ngiant planets present would still be luminous as a consequence of their recent\nformation.\n  From an initial sample of 3268 Gaia-identified massive, young white dwarfs,\nwe use homogeneous Spitzer Infrared Array Camera (IRAC) photometry to search\nfor evidence of unresolved giant planets. For 30 systems, these IRAC data\nprovide sensitivity to objects with $M~\\lesssim~10~M_{\\text{Jup}}$, and we\nidentify one candidate with $M~\\approx~4~M_{\\text{Jup}}$ orbiting the white\ndwarf GALEX J071816.4+373139. Correcting for the possibility that some of the\nwhite dwarfs in our sample result from mergers, we find a giant planet\noccurrence $\\eta_{\\text{GP}}~=~0.11_{-0.07}^{+0.13}$ for stars with initial\nmasses $M_{\\ast}~\\gtrsim~3~M_{\\odot}$. Our occurrence inference is consistent\nwith both the Doppler-inferred occurrence of giant planets orbiting\n$M_{\\ast}~\\approx~2~M_{\\odot}$ giant stars and the theoretically predicted\nfactor-of-four enhancement in the occurrence of giant planets orbiting\n$M_{\\ast}~\\approx~3~M_{\\odot}$ stars relative to solar-mass stars. Future James\nWebb Space Telescope Near Infrared Camera observations of our sample would\nprovide sensitivity to Saturn-mass planets and thereby a definitive estimate of\nthe occurrence of giant planets orbiting stars with\n$M_{\\ast}~\\gtrsim~3~M_{\\odot}$.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"U4cYMPJil34Pf-Mk1fHhFMkx53qgeUnR1evuklofzgs","pdfSize":"1899953"}
