{"id":"2408.03959","title":"Semantic Enabled 6G LEO Satellite Communication for Earth Observation: A\n  Resource-Constrained Network Optimization","authors":"Sheikh Salman Hassan, Loc X. Nguyen, Yan Kyaw Tun, Zhu Han, and Choong\n  Seon Hong","authorsParsed":[["Hassan","Sheikh Salman",""],["Nguyen","Loc X.",""],["Tun","Yan Kyaw",""],["Han","Zhu",""],["Hong","Choong Seon",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 07:53:08 GMT"}],"updateDate":"2024-08-09","timestamp":1722412388000,"abstract":"  Earth observation satellites generate large amounts of real-time data for\nmonitoring and managing time-critical events such as disaster relief missions.\nThis presents a major challenge for satellite-to-ground communications\noperating under limited bandwidth capacities. This paper explores semantic\ncommunication (SC) as a potential alternative to traditional communication\nmethods. The rationality for adopting SC is its inherent ability to reduce\ncommunication costs and make spectrum efficient for 6G non-terrestrial networks\n(6G-NTNs). We focus on the critical satellite imagery downlink communications\nlatency optimization for Earth observation through SC techniques. We formulate\nthe latency minimization problem with SC quality-of-service (SC-QoS)\nconstraints and address this problem with a meta-heuristic discrete whale\noptimization algorithm (DWOA) and a one-to-one matching game. The proposed\napproach for captured image processing and transmission includes the\nintegration of joint semantic and channel encoding to ensure downlink sum-rate\noptimization and latency minimization. Empirical results from experiments\ndemonstrate the efficiency of the proposed framework for latency optimization\nwhile preserving high-quality data transmission when compared to baselines.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}