{"id":"2408.14453","title":"Reconstructing physiological signals from fMRI across the adult lifespan","authors":"Shiyu Wang, Ziyuan Xu, Yamin Li, Mara Mather, Roza G. Bayrak and Catie\n  Chang","authorsParsed":[["Wang","Shiyu",""],["Xu","Ziyuan",""],["Li","Yamin",""],["Mather","Mara",""],["Bayrak","Roza G.",""],["Chang","Catie",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 17:48:42 GMT"}],"updateDate":"2024-08-27","timestamp":1724694522000,"abstract":"  Interactions between the brain and body are of fundamental importance for\nhuman behavior and health. Functional magnetic resonance imaging (fMRI)\ncaptures whole-brain activity noninvasively, and modeling how fMRI signals\ninteract with physiological dynamics of the body can provide new insight into\nbrain function and offer potential biomarkers of disease. However,\nphysiological recordings are not always possible to acquire since they require\nextra equipment and setup, and even when they are, the recorded physiological\nsignals may contain substantial artifacts. To overcome this limitation, machine\nlearning models have been proposed to directly extract features of respiratory\nand cardiac activity from resting-state fMRI signals. To date, such work has\nbeen carried out only in healthy young adults and in a pediatric population,\nleaving open questions about the efficacy of these approaches on older adults.\nHere, we propose a novel framework that leverages Transformer-based\narchitectures for reconstructing two key physiological signals - low-frequency\nrespiratory volume (RV) and heart rate (HR) fluctuations - from fMRI data, and\ntest these models on a dataset of individuals aged 36-89 years old. Our\nframework outperforms previously proposed approaches (attaining median\ncorrelations between predicted and measured signals of r ~ .698 for RV and r ~\n.618 for HR), indicating the potential of leveraging attention mechanisms to\nmodel fMRI-physiological signal relationships. We also evaluate several model\ntraining and fine-tuning strategies, and find that incorporating young-adult\ndata during training improves the performance when predicting physiological\nsignals in the aging cohort. Overall, our approach successfully infers key\nphysiological variables directly from fMRI data from individuals across a wide\nrange of the adult lifespan.\n","subjects":["Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}