{"id":"2408.15834","title":"Characterization of dynamical systems with scanty data using Persistent\n  Homology and Machine Learning","authors":"Rishab Antosh, Sanjit Das, N. Nirmal Thyagu","authorsParsed":[["Antosh","Rishab",""],["Das","Sanjit",""],["Thyagu","N. Nirmal",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 14:48:35 GMT"}],"updateDate":"2024-08-29","timestamp":1724856515000,"abstract":"  Determination of the nature of the dynamical state of a system as a function\nof its parameters is an important problem in the study of dynamical systems.\nThis problem becomes harder in experimental systems where the obtained data is\ninadequate (low-res) or has missing values. Recent developments in the field of\ntopological data analysis have given a powerful methodology, viz. persistent\nhomology, that is particularly suited for the study of dynamical systems.\nEarlier studies have mapped the dynamical features with the topological\nfeatures of some systems. However, these mappings between the dynamical\nfeatures and the topological features are notional and inadequate for accurate\nclassification on two counts. First, the methodologies employed by the earlier\nstudies heavily relied on human validation and intervention. Second, this\nmapping done on the chaotic dynamical regime makes little sense because\nessentially the topological summaries in this regime are too noisy to extract\nmeaningful features from it. In this paper, we employ Machine Learning (ML)\nassisted methodology to minimize the human intervention and validation of\nextracting the topological summaries from the dynamical states of systems.\nFurther, we employ a metric that counts in the noisy topological summaries,\nwhich are normally discarded, to characterize the state of the dynamical system\nas periodic or chaotic. This is surprisingly different from the conventional\nmethodologies wherein only the persisting (long-lived) topological features are\ntaken into consideration while the noisy (short-lived) topological features are\nneglected. We have demonstrated our ML-assisted method on well-known systems\nsuch as the Lorentz, Duffing, and Jerk systems. And we expect that our\nmethodology will be of utility in characterizing other dynamical systems\nincluding experimental systems that are constrained with limited data.\n","subjects":["Nonlinear Sciences/Chaotic Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Mf3aYy3a_tkjjvL_At-3LIYhJGgh5hz2QdGXQTGBWPs","pdfSize":"3100272"}
