{"id":"2408.08462","title":"Predicting the Structure and Stability of Oxide Nanoscrolls from\n  Dichalcogenide Precursors","authors":"Adway Gupta, Arunima K. Singh","authorsParsed":[["Gupta","Adway",""],["Singh","Arunima K.",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 00:17:03 GMT"}],"updateDate":"2024-08-19","timestamp":1723767423000,"abstract":"  Low-dimensional nanostructures such as nanotubes, nanoscrolls, and nanofilms\nhave found applications in a wide variety of fields such as photocatalysis,\nsensing, and drug delivery. Recently, Chu et al. demonstrated that nanoscrolls\nof Mo and W transition metal oxides, which do not exhibit van der Waals (vdW)\nlayering in their bulk counterparts, can be successfully synthesized using a\nplasma processing of corresponding layered transition metal dichalcogenides. In\nthis work, we employ data mining, first-principles simulations, and\nphysio-mechanical models to theoretically examine the potential of other\ndichalcogenide precursors to form oxide nanoscrolls. Through data mining of\nbulk and two-dimensional materials databases, we first identify dichalcogenides\nthat would be mostly amenable to plasma processing on the basis of their vdW\nlayering and thermodynamic stability. To determine the propensity of forming a\nnanoscroll, we develop a first-principles simulation-based physio-mechanical\nmodel to determine the thermodynamic stability of nanoscrolling as well as the\nequilibrium structure of the nanoscrolls, i.e. their inner radius, outer\nradius, and interlayer spacing. We validate this model using the experimental\nobservations of Chu et al.'s study and find an excellent agreement for the\nequilibrium nanoscroll structure. Furthermore, we demonstrate that the model's\nenergies can be utilized for a generalized quantitative categorization of\nnanoscroll stability. We apply the model to study the oxide nanoscroll\nformation in MoS$_2$, WS$_2$, MoSe$_2$, WSe$_2$, PdS$_2$, HfS$_2$ and GeS$_2$,\npaving the way for a systematic study of oxide nanoscroll formation atop other\ndichalcogenide substrates.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"THYAGj4BeLIgtqubPl5IhKBqLUepB7fIgBMzQsgnLCg","pdfSize":"11022650"}
