{"id":"2408.07349","title":"Automated Retinal Image Analysis and Medical Report Generation through\n  Deep Learning","authors":"Jia-Hong Huang","authorsParsed":[["Huang","Jia-Hong",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 07:47:25 GMT"}],"updateDate":"2024-08-15","timestamp":1723621645000,"abstract":"  The increasing prevalence of retinal diseases poses a significant challenge\nto the healthcare system, as the demand for ophthalmologists surpasses the\navailable workforce. This imbalance creates a bottleneck in diagnosis and\ntreatment, potentially delaying critical care. Traditional methods of\ngenerating medical reports from retinal images rely on manual interpretation,\nwhich is time-consuming and prone to errors, further straining\nophthalmologists' limited resources. This thesis investigates the potential of\nArtificial Intelligence (AI) to automate medical report generation for retinal\nimages. AI can quickly analyze large volumes of image data, identifying subtle\npatterns essential for accurate diagnosis. By automating this process, AI\nsystems can greatly enhance the efficiency of retinal disease diagnosis,\nreducing doctors' workloads and enabling them to focus on more complex cases.\nThe proposed AI-based methods address key challenges in automated report\ngeneration: (1) Improved methods for medical keyword representation enhance the\nsystem's ability to capture nuances in medical terminology; (2) A multi-modal\ndeep learning approach captures interactions between textual keywords and\nretinal images, resulting in more comprehensive medical reports; (3) Techniques\nto enhance the interpretability of the AI-based report generation system,\nfostering trust and acceptance in clinical practice. These methods are\nrigorously evaluated using various metrics and achieve state-of-the-art\nperformance. This thesis demonstrates AI's potential to revolutionize retinal\ndisease diagnosis by automating medical report generation, ultimately improving\nclinical efficiency, diagnostic accuracy, and patient care.\n[https://github.com/Jhhuangkay/DeepOpht-Medical-Report-Generation-for-Retinal-Images-via-Deep-Models-and-Visual-Explanation]\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8_75z_amocJhL5lmbYGsDuNKFmhgrB9iHll4e4bguJQ","pdfSize":"15878779"}
