{"id":"2408.11609","title":"Xinyu: An Efficient LLM-based System for Commentary Generation","authors":"Yiquan Wu, Bo Tang, Chenyang Xi, Yu Yu, Pengyu Wang, Yifei Liu, Kun\n  Kuang, Haiying Deng, Zhiyu Li, Feiyu Xiong, Jie Hu, Peng Cheng, Zhonghao\n  Wang, Yi Wang, Yi Luo, Mingchuan Yang","authorsParsed":[["Wu","Yiquan",""],["Tang","Bo",""],["Xi","Chenyang",""],["Yu","Yu",""],["Wang","Pengyu",""],["Liu","Yifei",""],["Kuang","Kun",""],["Deng","Haiying",""],["Li","Zhiyu",""],["Xiong","Feiyu",""],["Hu","Jie",""],["Cheng","Peng",""],["Wang","Zhonghao",""],["Wang","Yi",""],["Luo","Yi",""],["Yang","Mingchuan",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 13:34:29 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 03:40:44 GMT"}],"updateDate":"2024-08-26","timestamp":1724247269000,"abstract":"  Commentary provides readers with a deep understanding of events by presenting\ndiverse arguments and evidence. However, creating commentary is a\ntime-consuming task, even for skilled commentators. Large language models\n(LLMs) have simplified the process of natural language generation, but their\ndirect application in commentary creation still faces challenges due to unique\ntask requirements. These requirements can be categorized into two levels: 1)\nfundamental requirements, which include creating well-structured and logically\nconsistent narratives, and 2) advanced requirements, which involve generating\nquality arguments and providing convincing evidence. In this paper, we\nintroduce Xinyu, an efficient LLM-based system designed to assist commentators\nin generating Chinese commentaries. To meet the fundamental requirements, we\ndeconstruct the generation process into sequential steps, proposing targeted\nstrategies and supervised fine-tuning (SFT) for each step. To address the\nadvanced requirements, we present an argument ranking model for arguments and\nestablish a comprehensive evidence database that includes up-to-date events and\nclassic books, thereby strengthening the substantiation of the evidence with\nretrieval augmented generation (RAG) technology. To evaluate the generated\ncommentaries more fairly, corresponding to the two-level requirements, we\nintroduce a comprehensive evaluation metric that considers five distinct\nperspectives in commentary generation. Our experiments confirm the\neffectiveness of our proposed system. We also observe a significant increase in\nthe efficiency of commentators in real-world scenarios, with the average time\nspent on creating a commentary dropping from 4 hours to 20 minutes.\nImportantly, such an increase in efficiency does not compromise the quality of\nthe commentaries.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}