{"id":"2408.11228","title":"Plasmon Mode Engineering with Electrons on Helium","authors":"C.A. Mikolas, N.R. Beysengulov, A.J. Schleusner, D.G. Rees, C.\n  Undershute, and J. Pollanen","authorsParsed":[["Mikolas","C. A.",""],["Beysengulov","N. R.",""],["Schleusner","A. J.",""],["Rees","D. G.",""],["Undershute","C.",""],["Pollanen","J.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 22:56:25 GMT"}],"updateDate":"2024-08-22","timestamp":1724194585000,"abstract":"  An ensemble of electrons trapped above the surface of superfluid helium is a\nparadigm system for investigating, and controlling, the collective charge\ndynamics of low-dimensional electronic matter. Of particular interest is the\nability to engineer the spatial and spectral structure of surface plasmon modes\nin this system for integration into hybrid quantum systems or circuit quantum\nelectrodynamic device architectures. Here we present experiments on a hybrid\nelectron-on-helium microchannel device designed to host microwave-frequency\nplasmon modes having a spatial structure dictated by the geometry of the\nmicrochannel confinement. The plasma oscillations are generated via local\nmicrowave frequency excitation of the electrons in the microchannel. When this\nexcitation is resonant with a particular surface plasmon-mode it produces a\nnon-equilibrium decrease in the electron conductance, which we detect via\nsimultaneous transport measurements. We find that the spatial structure of the\nsurface plasmons is in excellent agreement with our device design parameters\nand modeling, and their frequency can be tuned over a broad range (several GHz)\nby precisely varying the areal density of electrons in the channel. By\nmeasuring the plasma resonance spectrum lineshape, and its power dependence, we\ncan quantify the level of spatial homogeneity associated with each plasmon\nmode. The results highlight the versatility of electrons on helium as a model\nsystem for investigating, and engineering, the collective mode structure of\nlow-dimensional Coulomb liquid and solid states and demonstrate a viable path\nfor integrating precisely engineered surface plasmons in electrons on helium\nwith future hybrid circuit quantum electrodynamic systems.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}