{"id":"2408.07075","title":"UniFed: A Universal Federation of a Mixture of Highly Heterogeneous\n  Medical Image Classification Tasks","authors":"Atefe Hassani and Islem Rekik","authorsParsed":[["Hassani","Atefe",""],["Rekik","Islem",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 23:15:15 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 18:27:45 GMT"}],"updateDate":"2024-08-19","timestamp":1722294915000,"abstract":"  A fundamental challenge in federated learning lies in mixing heterogeneous\ndatasets and classification tasks while minimizing the high communication cost\ncaused by clients as well as the exchange of weight updates with the server\nover a fixed number of rounds. This results in divergent model convergence\nrates and performance, which may hinder their deployment in precision medicine.\nIn real-world scenarios, client data is collected from different hospitals with\nextremely varying components (e.g., imaging modality, organ type, etc).\nPrevious studies often overlooked the convoluted heterogeneity during the\ntraining stage where the target learning tasks vary across clients as well as\nthe dataset type and their distributions. To address such limitations, we\nunprecedentedly introduce UniFed, a universal federated learning paradigm that\naims to classify any disease from any imaging modality. UniFed also handles the\nissue of varying convergence times in the client-specific optimization based on\nthe complexity of their learning tasks. Specifically, by dynamically adjusting\nboth local and global models, UniFed considers the varying task complexities of\nclients and the server, enhancing its adaptability to real-world scenarios,\nthereby mitigating issues related to overtraining and excessive communication.\nFurthermore, our framework incorporates a sequential model transfer mechanism\nthat takes into account the diverse tasks among hospitals and a dynamic\ntask-complexity based ordering. We demonstrate the superiority of our framework\nin terms of accuracy, communication cost, and convergence time over relevant\nbenchmarks in diagnosing retina, histopathology, and liver tumour diseases\nunder federated learning. Our UniFed code is available at\nhttps://github.com/basiralab/UniFed.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6bcAl0wfvAfYGQ9KxcB2lkKeviTsZVQbMWhX_7IT_hs","pdfSize":"527442"}
