{"id":"2408.07354","title":"In-line fiber optic optofluidic sensor based on a fully open Fabry-Perot\n  interferometer","authors":"Dewen Duan, Qian Kang, Qianhui Yang, Zihao Zhao, Na Li, Guan-Xiang Du,\n  Yi-Yuan Xie","authorsParsed":[["Duan","Dewen",""],["Kang","Qian",""],["Yang","Qianhui",""],["Zhao","Zihao",""],["Li","Na",""],["Du","Guan-Xiang",""],["Xie","Yi-Yuan",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 07:59:35 GMT"}],"updateDate":"2024-08-15","timestamp":1723622375000,"abstract":"  We present an all-fiber, fully open Fabry-Perot interferometer (FPI) cavity\nthat is suitable for fluidic measurement applications. Fabrication of the FPI\ninvolves the alignment and bonding of three optical fiber sections using either\nceramic glue or low-temperature melting glass. The fabrication procedure allows\nthe protection of the cleaved optical fiber end faces, which serve as the two\nmirrors of the FPI, from damage, thus ensuring the high visibility of the FPI\nsensor. The FPI's complete openness permits the analyte of interest fluids to\nflow smoothly into the cavity and interact directly with the light, obviating\nthe need for additional assistance. The fabrication experiment demonstrates\nthat the fabrication procedure can readily achieve a visibility of over 20 dB.\nRefractive index testing indicates that the sensor exhibits a sensitivity of\nover 1116 nm/RIU within the range of 1.334-1.375. A comparison of temperature\ninvestigations indicates that the fully open cavity FPI fabricated by bonding\nwith low-temperature melting glass exhibits relatively lower temperature\nimmunity than that bonded with ceramic glue. Both have a relatively low\ntemperature fluctuation within the temperature range of 40{\\deg}C-100{\\deg}C,\nwith less than 3 nm and 4.5 nm in the over 60{\\deg}C changes, respectively. Our\nproposed fully open FPI is an economical, robust, and simple-to-fabricate\nstructure with the potential for mass production. This renders it an appealing\noption for practical optofluidics applications.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"fonMxwq9eXSTtTGM5Q5A4N3qbcHOhbv1A1aQVpm0cuQ","pdfSize":"488688"}
