{"id":"2408.15492","title":"Infinite-Horizon Optimal Wireless Control Over Shared State-Dependent\n  Fading Channels for IIoT Systems","authors":"Shuling Wang, Peizhe Li, Shanying Zhu, Cailian Chen, Xinping Guan","authorsParsed":[["Wang","Shuling",""],["Li","Peizhe",""],["Zhu","Shanying",""],["Chen","Cailian",""],["Guan","Xinping",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 02:39:21 GMT"}],"updateDate":"2024-08-29","timestamp":1724812761000,"abstract":"  Heterogeneous systems consisting of a multiloop wireless control system (WCS)\nand a mobile agent system (MAS) are ubiquitous in Industrial Internet of Things\nsystems. Within these systems, positions of mobile agents may lead to shadow\nfading on the wireless channel that the WCS is controlled over and can\nsignificantly compromise its performance. This paper focuses on the\ninfinite-horizon optimal control of MAS to ensure the performance of WCS while\nminimizing an average cost for the heterogeneous system subject to state and\ninput constraints. Firstly, the state-dependent fading channel is modeled,\nwhich characterizes the interference among transmission links, and shows that\nthe probability of a successful transmission for WCS depends on the state of\nMAS. A necessary and sufficient condition in terms of constrained set\nstabilization is then established to ensure the Lyapunov-like performance of\nWCS with expected decay rate. Secondly, using the semi-tensor product of\nmatrices and constrained reachable sets, a criterion is presented to check the\nconstrained set stabilization of MAS and to ensure the performance of WCS. In\naddition, a constrained optimal state transition graph is constructed to\naddress state and input constraints, by resorting to which the feasibility\nanalysis of the optimal control problem is presented. Finally, an algorithm is\nproposed for the construction of optimal input sequences by minimum-mean cycles\nfor weighted graph. An illustrative example is provided to demonstrate\neffectiveness of the proposed method.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}