{"id":"2408.15018","title":"Cross-subject Brain Functional Connectivity Analysis for Multi-task\n  Cognitive State Evaluation","authors":"Jun Chen, Anqi Chen, Bingkun Jiang, Mohammad S. Obaidat, Ni Li, Xinyu\n  Zhang","authorsParsed":[["Chen","Jun",""],["Chen","Anqi",""],["Jiang","Bingkun",""],["Obaidat","Mohammad S.",""],["Li","Ni",""],["Zhang","Xinyu",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 12:51:59 GMT"}],"updateDate":"2024-08-28","timestamp":1724763119000,"abstract":"  Cognition refers to the function of information perception and processing,\nwhich is the fundamental psychological essence of human beings. It is\nresponsible for reasoning and decision-making, while its evaluation is\nsignificant for the aviation domain in mitigating potential safety risks.\nExisting studies tend to use varied methods for cognitive state evaluation yet\nhave limitations in timeliness, generalisation, and interpretability.\nAccordingly, this study adopts brain functional connectivity with\nelectroencephalography signals to capture associations in brain regions across\nmultiple subjects for evaluating real-time cognitive states. Specifically, a\nvirtual reality-based flight platform is constructed with multi-screen\nembedded. Three distinctive cognitive tasks are designed and each has three\ndegrees of difficulty. Thirty subjects are acquired for analysis and\nevaluation. The results are interpreted through different perspectives,\nincluding inner-subject and cross-subject for task-wise and gender-wise\nunderlying brain functional connectivity. Additionally, this study incorporates\nquestionnaire-based, task performance-based, and physiological measure-based\napproaches to fairly label the trials. A multi-class cognitive state evaluation\nis further conducted with the active brain connections. Benchmarking results\ndemonstrate that the identified brain regions have considerable influences in\ncognition, with a multi-class accuracy rate of 95.83% surpassing existing\nstudies. The derived findings bring significance to understanding the dynamic\nrelationships among human brain functional regions, cross-subject cognitive\nbehaviours, and decision-making, which have promising practical application\nvalues.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}