{"id":"2408.12898","title":"Hydrodynamic interaction between coaxially rising bubbles in\n  elasto-visco-plastic materials: Bubbles with a wide range of relative sizes","authors":"Athanasios Kordalis, Yannis Dimakopoulos, John Tsamopoulos","authorsParsed":[["Kordalis","Athanasios",""],["Dimakopoulos","Yannis",""],["Tsamopoulos","John",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 08:03:37 GMT"}],"updateDate":"2024-08-26","timestamp":1724400217000,"abstract":"  We consider the buoyancy-driven rise and interaction between two\ngravity-aligned bubbles of wide radii ratio and constant volume in an\nelasto-visco-plastic (EVP) material, extending our previous work on equal\nbubbles [Kordalis et al., Phys. Rev. Fluids 8, 083301, (2023)]. Primarily we\nconsider a 0.1% aqueous Carbopol solution and model it with the\nSaramito-Herschel-Bulkley model. Initially, we investigate the dynamics for a\nspecific initial separation distance in a wide range of bubble radii and we\ndetermine the conditions leading to three distinct patterns: bubble approach,\nbubble separation and establishment of a constant distance between them.\nSpecifically, when the leading bubble (LB) is smaller than the trailing bubble\n(TB), the bubbles approach each other due to the smaller buoyancy of the LB.\nStrong attraction also occurs when the ratio of buoyant over viscous force of\nboth bubbles is considerable. On the other hand, when the size of the TB is\nsuch that this ratio is moderate or small, the pattern is dictated by the size\nof the LB: A significantly larger LB compared to the TB causes separation of\nthe pair. On the contrary, an only slightly larger LB may result in the bubbles\nrising with the same terminal velocity establishing a constant distance between\nthem, the magnitude of which is mainly determined by the elastic response of\nthe surrounding medium. The coupling of a negative wake behind the LB with a\nslight modification of the stresses exerted at its rear pole generates this\ndynamic equilibrium. The same equilibrium may be achieved by other specific\npairs of bubble sizes for different initial distances of the pair, if a\ncritical initial distance is exceeded. Below this critical value, the bubbles\napproach each other. Finally, we construct maps of the three patterns with TB\nradius versus bubble radii ratio for different initial separation distances and\nmaterial properties.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"om_-SqOhrFLyIZxxzwDI16cT60-47oNoupuwrYe_Jaw","pdfSize":"4142753"}
