{"id":"2408.00746","title":"On the Low-Temperature MCMC threshold: the cases of sparse tensor PCA,\n  sparse regression, and a geometric rule","authors":"Zongchen Chen, Conor Sheehan, Ilias Zadik","authorsParsed":[["Chen","Zongchen",""],["Sheehan","Conor",""],["Zadik","Ilias",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 17:49:55 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 20:16:06 GMT"}],"updateDate":"2024-08-07","timestamp":1722534595000,"abstract":"  Over the last years, there has been a significant amount of work studying the\npower of specific classes of computationally efficient estimators for multiple\nstatistical parametric estimation tasks, including the estimators classes of\nlow-degree polynomials, spectral methods, and others. Despite that, our\nunderstanding of the important class of MCMC methods remains quite poorly\nunderstood. For instance, for many models of interest, the performance of even\nzero-temperature (greedy-like) MCMC methods that simply maximize the posterior\nremains elusive.\n  In this work, we provide an easy to check condition under which the\nlow-temperature Metropolis chain maximizes the posterior in polynomial-time\nwith high probability. The result is generally applicable, and in this work, we\nuse it to derive positive MCMC results for two classical sparse estimation\ntasks: the sparse tensor PCA model and sparse regression. Interestingly, in\nboth cases, we also leverage the Overlap Gap Property framework for inference\n(Gamarnik, Zadik AoS '22) to prove that our results are tight: no\nlow-temperature local MCMC method can achieve better performance. In\nparticular, our work identifies the \"low-temperature (local) MCMC threshold\"\nfor both sparse models. Interestingly, in the sparse tensor PCA model our\nresults indicate that low-temperature local MCMC methods significantly\nunderperform compared to other studied time-efficient methods, such as the\nclass of low-degree polynomials.\n","subjects":["Mathematics/Statistics Theory","Computing Research Repository/Data Structures and Algorithms","Mathematics/Probability","Statistics/Statistics Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}