{"id":"2408.12076","title":"ConflictBank: A Benchmark for Evaluating the Influence of Knowledge\n  Conflicts in LLM","authors":"Zhaochen Su, Jun Zhang, Xiaoye Qu, Tong Zhu, Yanshu Li, Jiashuo Sun,\n  Juntao Li, Min Zhang, Yu Cheng","authorsParsed":[["Su","Zhaochen",""],["Zhang","Jun",""],["Qu","Xiaoye",""],["Zhu","Tong",""],["Li","Yanshu",""],["Sun","Jiashuo",""],["Li","Juntao",""],["Zhang","Min",""],["Cheng","Yu",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 02:33:13 GMT"}],"updateDate":"2024-08-23","timestamp":1724293993000,"abstract":"  Large language models (LLMs) have achieved impressive advancements across\nnumerous disciplines, yet the critical issue of knowledge conflicts, a major\nsource of hallucinations, has rarely been studied. Only a few research explored\nthe conflicts between the inherent knowledge of LLMs and the retrieved\ncontextual knowledge. However, a thorough assessment of knowledge conflict in\nLLMs is still missing. Motivated by this research gap, we present ConflictBank,\nthe first comprehensive benchmark developed to systematically evaluate\nknowledge conflicts from three aspects: (i) conflicts encountered in retrieved\nknowledge, (ii) conflicts within the models' encoded knowledge, and (iii) the\ninterplay between these conflict forms. Our investigation delves into four\nmodel families and twelve LLM instances, meticulously analyzing conflicts\nstemming from misinformation, temporal discrepancies, and semantic divergences.\nBased on our proposed novel construction framework, we create 7,453,853\nclaim-evidence pairs and 553,117 QA pairs. We present numerous findings on\nmodel scale, conflict causes, and conflict types. We hope our ConflictBank\nbenchmark will help the community better understand model behavior in conflicts\nand develop more reliable LLMs.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yyNpMCXf8GeRZcsExYquUNVRfV466k7CI0UYjBWl6XM","pdfSize":"6489112"}
