{"id":"2408.11740","title":"Less is more: AI Decision-Making using Dynamic Deep Neural Networks for\n  Short-Term Stock Index Prediction","authors":"CJ Finnegan, James F. McCann, Salissou Moutari","authorsParsed":[["Finnegan","CJ",""],["McCann","James F.",""],["Moutari","Salissou",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 16:04:31 GMT"}],"updateDate":"2024-08-22","timestamp":1724256271000,"abstract":"  In this paper we introduce a multi-agent deep-learning method which trades in\nthe Futures markets based on the US S&P 500 index. The method (referred to as\nModel A) is an innovation founded on existing well-established machine-learning\nmodels which sample market prices and associated derivatives in order to decide\nwhether the investment should be long/short or closed (zero exposure), on a\nday-to-day decision. We compare the predictions with some conventional\nmachine-learning methods namely, Long Short-Term Memory, Random Forest and\nGradient-Boosted-Trees. Results are benchmarked against a passive model in\nwhich the Futures contracts are held (long) continuously with the same exposure\n(level of investment). Historical tests are based on daily daytime trading\ncarried out over a period of 6 calendar years (2018-23). We find that Model A\noutperforms the passive investment in key performance metrics, placing it\nwithin the top quartile performance of US Large Cap active fund managers. Model\nA also outperforms the three machine-learning classification comparators over\nthis period. We observe that Model A is extremely efficient (doing less and\ngetting more) with an exposure to the market of only 41.95% compared to the\n100% market exposure of the passive investment, and thus provides increased\nprofitability with reduced risk.\n","subjects":["Quantitative Finance/Trading and Market Microstructure","Quantitative Finance/Portfolio Management"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"TnrIbpDmsckjo1qPUMrj6LuNbo0LbVVK__Jg3aab8m0","pdfSize":"685264"}
