{"id":"2408.02909","title":"Polymer Micro-Lattice buffer structure Free Impact absorption","authors":"Louis Catar, Ilyass Tabiai and David St-Onge","authorsParsed":[["Catar","Louis",""],["Tabiai","Ilyass",""],["St-Onge","David",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 02:48:39 GMT"}],"updateDate":"2024-08-07","timestamp":1722912519000,"abstract":"  The uncrewed aerial systems industry is rapidly expanding due to advancements\nin smaller electronics, smarter sensors, advanced flight controllers, and\nembedded perception modules leveraging artificial intelligence. These\ntechnological progress have opened new indoor applications for UAS, including\nwarehouse inventory management, security inspections of public spaces and\nfacilities, and underground exploration. Despite the innovative designs from\nUAS manufacturers, there are no existing standards to ensure UAS and human\nsafety in these environments. This study explores developing and evaluating\nmicro-lattice structures for impact resistance in lightweight UAS. We examine\npatch designs using Face-Centered Cubic (FCC), Diamond (D), Kelvin (K), and\nGyroid (GY) patterns and detail the processes for creating samples for impact\nand compression tests, including manufacturing and testing protocols.\n  Our evaluation includes compression and impact tests to assess structural\nbehavior, revealing the influence of geometry, compactness, and material\nproperties. Diamond and Kelvin patterns were particularly effective in load\ndistribution and energy absorption over the compression tests. Impact tests\ndemonstrated significant differences in response between flexible and rigid\nmaterials, with flexible patches exhibiting superior energy dissipation and\nstructural integrity under dynamic loading.\n  The study provides a detailed analysis of specific energy absorption (SEA)\nand efficiency, offering insights into optimal micro-lattice structure designs\nfor impact resistance in lightweight UAS applications.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}