{"id":"2408.10985","title":"Bounding the systematic error in quantum error mitigation due to model\n  violation","authors":"L. C. G. Govia, S. Majumder, S. V. Barron, B. Mitchell, A. Seif, Y.\n  Kim, C. J. Wood, E. J. Pritchett, S. T. Merkel and D. C. McKay","authorsParsed":[["Govia","L. C. G.",""],["Majumder","S.",""],["Barron","S. V.",""],["Mitchell","B.",""],["Seif","A.",""],["Kim","Y.",""],["Wood","C. J.",""],["Pritchett","E. J.",""],["Merkel","S. T.",""],["McKay","D. C.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 16:27:00 GMT"}],"updateDate":"2024-08-21","timestamp":1724171220000,"abstract":"  Quantum error mitigation is a promising route to achieving quantum utility,\nand potentially quantum advantage in the near-term. Many state-of-the-art error\nmitigation schemes use knowledge of the errors in the quantum processor, which\nopens the question to what extent inaccuracy in the error model impacts the\nperformance of error mitigation. In this work, we develop a methodology to\nefficiently compute upper bounds on the impact of error-model inaccuracy in\nerror mitigation. Our protocols require no additional experiments, and instead\nrely on comparisons between the error model and the error-learning data from\nwhich the model is generated. We demonstrate the efficacy of our methodology by\ndeploying it on an IBM Quantum superconducting qubit quantum processor, and\nthrough numerical simulation of standard error models. We show that our\nestimated upper bounds are typically close to the worst observed performance of\nerror mitigation on random circuits. Our methodology can also be understood as\nan operationally meaningful metric to assess the quality of error models, and\nwe further extend our methodology to allow for comparison between error models.\nFinally, contrary to what one might expect we show that observable error in\nnoisy layered circuits of sufficient depth is not always maximized by a\nClifford circuit, which may be of independent interest.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}