{"id":"2408.15505","title":"Sampling parameters of ordinary differential equations with Langevin\n  dynamics that satisfy constraints","authors":"Chris Chi, Jonathan Weare, and Aaron R. Dinner","authorsParsed":[["Chi","Chris",""],["Weare","Jonathan",""],["Dinner","Aaron R.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 03:24:59 GMT"}],"updateDate":"2024-08-29","timestamp":1724815499000,"abstract":"  Fitting models to data to obtain distributions of consistent parameter values\nis important for uncertainty quantification, model comparison, and prediction.\nStandard Markov Chain Monte Carlo (MCMC) approaches for fitting ordinary\ndifferential equations (ODEs) to time-series data involve proposing trial\nparameter sets, numerically integrating the ODEs forward in time, and accepting\nor rejecting the trial parameter sets. When the model dynamics depend\nnonlinearly on the parameters, as is generally the case, trial parameter sets\nare often rejected, and MCMC approaches become prohibitively computationally\ncostly to converge. Here, we build on methods for numerical continuation and\ntrajectory optimization to introduce an approach in which we use Langevin\ndynamics in the joint space of variables and parameters to sample models that\nsatisfy constraints on the dynamics. We demonstrate the method by sampling Hopf\nbifurcations and limit cycles of a model of a biochemical oscillator in a\nBayesian framework for parameter estimation, and we obtain more than a hundred\nfold speedup relative to a leading ensemble MCMC approach that requires\nnumerically integrating the ODEs forward in time. We describe numerical\nexperiments that provide insight into the speedup. The method is general and\ncan be used in any framework for parameter estimation and model selection.\n","subjects":["Statistics/Computation","Physics/Computational Physics","Physics/Data Analysis, Statistics and Probability","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/"}