{"id":"2408.13802","title":"TripleMixer: A 3D Point Cloud Denoising Model for Adverse Weather","authors":"Xiongwei Zhao, Congcong Wen, Yang Wang, Haojie Bai and Wenhao Dou","authorsParsed":[["Zhao","Xiongwei",""],["Wen","Congcong",""],["Wang","Yang",""],["Bai","Haojie",""],["Dou","Wenhao",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 10:45:52 GMT"}],"updateDate":"2024-08-27","timestamp":1724582752000,"abstract":"  LiDAR sensors are crucial for providing high-resolution 3D point cloud data\nin autonomous driving systems, enabling precise environmental perception.\nHowever, real-world adverse weather conditions, such as rain, fog, and snow,\nintroduce significant noise and interference, degrading the reliability of\nLiDAR data and the performance of downstream tasks like semantic segmentation.\nExisting datasets often suffer from limited weather diversity and small dataset\nsizes, which restrict their effectiveness in training models. Additionally,\ncurrent deep learning denoising methods, while effective in certain scenarios,\noften lack interpretability, complicating the ability to understand and\nvalidate their decision-making processes. To overcome these limitations, we\nintroduce two large-scale datasets, Weather-KITTI and Weather-NuScenes, which\ncover three common adverse weather conditions: rain, fog, and snow. These\ndatasets retain the original LiDAR acquisition information and provide\npoint-level semantic labels for rain, fog, and snow. Furthermore, we propose a\nnovel point cloud denoising model, TripleMixer, comprising three mixer layers:\nthe Geometry Mixer Layer, the Frequency Mixer Layer, and the Channel Mixer\nLayer. These layers are designed to capture geometric spatial information,\nextract multi-scale frequency information, and enhance the multi-channel\nfeature information of point clouds, respectively. Experiments conducted on the\nWADS dataset in real-world scenarios, as well as on our proposed Weather-KITTI\nand Weather-NuScenes datasets, demonstrate that our model achieves\nstate-of-the-art denoising performance. Additionally, our experiments show that\nintegrating the denoising model into existing segmentation frameworks enhances\nthe performance of downstream tasks.The datasets and code will be made publicly\navailable at https://github.com/Grandzxw/TripleMixer.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BHfUP30ytAuIB-_FntaD8JcSMHrdkwiyzD6qCOej-f4","pdfSize":"5109578"}
