{"id":"2408.15043","title":"Polaronic neutron in dilute alpha matter: A $p$-wave Bose polaron","authors":"Hiroyuki Tajima, Hajime Moriya, Tomoya Naito, Wataru Horiuchi, Eiji\n  Nakano, Kei Iida","authorsParsed":[["Tajima","Hiroyuki",""],["Moriya","Hajime",""],["Naito","Tomoya",""],["Horiuchi","Wataru",""],["Nakano","Eiji",""],["Iida","Kei",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 13:11:35 GMT"}],"updateDate":"2024-08-28","timestamp":1724764295000,"abstract":"  We theoretically investigate quasiparticle properties of a neutron immersed\nin an alpha condensate, which is one of the possible states of dilute symmetric\nnuclear matter. The resonant $p$-wave neutron-alpha scattering, which plays a\ncrucial role in forming halo nuclei, is considered. This system is similar to a\nBose polaron near the $p$-wave Feshbach resonance that can be realized in\ncold-atomic experiments. Calculating the low-momentum self-energy within the\nfield-theoretical approach, we give an analytical formula for the effective\nmass of a polaronic neutron as a function of alpha condensation density. Two\nadjacent neutrons in a medium, each of which behaves like a stable polaron\nhaving an enhanced effective mass, can form a bound dineutron, with the help of\n$^1S_0$ neutron-neutron attraction. This is in contrast to the case of the\nvacuum, where a dineutron is known to be unbound. Moreover, adding an\nimpurity-like neutron to symmetric nuclear matter can be regarded as a\nperturbation accompanied by an explicit breaking of Wigner's $ SU \\left( 4\n\\right) $ symmetry. The relationship between the polaron energy and the Wigner\nterm in nuclear mass formulas is discussed in the low-density limit. Our result\nwould be useful for understanding many-body physics in astrophysical\nenvironments as well as the formation of multi-nucleon clusters in neutron-halo\nnuclei.\n","subjects":["Physics/Nuclear Theory","Condensed Matter/Quantum Gases","Physics/Atomic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}