{"id":"2408.07095","title":"A Unified Manifold Similarity Measure Enhancing Few-Shot, Transfer, and\n  Reinforcement Learning in Manifold-Distributed Datasets","authors":"Sayed W Qayyumi, Laureance F Park, Oliver Obst","authorsParsed":[["Qayyumi","Sayed W",""],["Park","Laureance F",""],["Obst","Oliver",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 01:25:00 GMT"}],"updateDate":"2024-08-15","timestamp":1723425900000,"abstract":"  Training a classifier with high mean accuracy from a manifold-distributed\ndataset can be challenging. This problem is compounded further when there are\nonly few labels available for training. For transfer learning to work, both the\nsource and target datasets must have a similar manifold structure. As part of\nthis study, we present a novel method for determining the similarity between\ntwo manifold structures. This method can be used to determine whether the\ntarget and source datasets have a similar manifold structure suitable for\ntransfer learning.\n  We then present a few-shot learning method to classify manifold-distributed\ndatasets with limited labels using transfer learning. Based on the base and\ntarget datasets, a similarity comparison is made to determine if the two\ndatasets are suitable for transfer learning. A manifold structure and label\ndistribution are learned from the base and target datasets. When the structures\nare similar, the manifold structure and its relevant label information from the\nrichly labeled source dataset is transferred to target dataset. We use the\ntransferred information, together with the labels and unlabeled data from the\ntarget dataset, to develop a few-shot classifier that produces high mean\nclassification accuracy on manifold-distributed datasets.\n  In the final part of this article, we discuss the application of our manifold\nstructure similarity measure to reinforcement learning and image recognition.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}