{"id":"2408.08433","title":"A Robust Multi-Stage Intrusion Detection System for In-Vehicle Network\n  Security using Hierarchical Federated Learning","authors":"Muzun Althunayyan, Amir Javed and Omer Rana","authorsParsed":[["Althunayyan","Muzun",""],["Javed","Amir",""],["Rana","Omer",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 21:51:56 GMT"}],"updateDate":"2024-08-19","timestamp":1723758716000,"abstract":"  As connected and autonomous vehicles proliferate, the Controller Area Network\n(CAN) bus has become the predominant communication standard for in-vehicle\nnetworks due to its speed and efficiency. However, the CAN bus lacks basic\nsecurity measures such as authentication and encryption, making it highly\nvulnerable to cyberattacks. To ensure in-vehicle security, intrusion detection\nsystems (IDSs) must detect seen attacks and provide a robust defense against\nnew, unseen attacks while remaining lightweight for practical deployment.\nPrevious work has relied solely on the CAN ID feature or has used traditional\nmachine learning (ML) approaches with manual feature extraction. These\napproaches overlook other exploitable features, making it challenging to adapt\nto new unseen attack variants and compromising security. This paper introduces\na cutting-edge, novel, lightweight, in-vehicle, IDS-leveraging, deep learning\n(DL) algorithm to address these limitations. The proposed IDS employs a\nmulti-stage approach: an artificial neural network (ANN) in the first stage to\ndetect seen attacks, and a Long Short-Term Memory (LSTM) autoencoder in the\nsecond stage to detect new, unseen attacks. To understand and analyze diverse\ndriving behaviors, update the model with the latest attack patterns, and\npreserve data privacy, we propose a theoretical framework to deploy our IDS in\na hierarchical federated learning (H-FL) environment. Experimental results\ndemonstrate that our IDS achieves an F1-score exceeding 0.99 for seen attacks\nand exceeding 0.95 for novel attacks, with a detection rate of 99.99%.\nAdditionally, the false alarm rate (FAR) is exceptionally low at 0.016%,\nminimizing false alarms. Despite using DL algorithms known for their\neffectiveness in identifying sophisticated and zero-day attacks, the IDS\nremains lightweight, ensuring its feasibility for real-world deployment.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}