{"id":"2408.10925","title":"Fate of the remnant in tidal stripping event: repeating and\n  non-repeating","authors":"Jin-Hong Chen, Lixin Dai, Shang-Fei Liu, Jian-Wen Ou","authorsParsed":[["Chen","Jin-Hong",""],["Dai","Lixin",""],["Liu","Shang-Fei",""],["Ou","Jian-Wen",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 15:07:23 GMT"}],"updateDate":"2024-08-21","timestamp":1724166443000,"abstract":"  Tidal disruption events (TDE) occur when a star ventures too close to a\nmassive black hole. In a partial TDE (pTDE), the star only grazes the tidal\nradius, causing the outer envelope of the star to be stripped away while the\nstellar core survives. Previous research has shown that a star, once tidally\nstripped in a parabolic orbit, can acquire enough orbital energy for its\nremnant to become a high-velocity star potentially capable of escaping the\ngalaxy. Conversely, some studies have reported that the remnant may lose\norbital energy and undergo re-disruption, leading to a recurring pTDE. This\nstudy aims to uncover the physical mechanisms and determine the conditions that\nlead to these divergent outcomes. We find that the orbital energy change only\ndepends on the impact factor and the stellar structure, and barely depends on\nthe mass of the black hole or the exact mass or orbital eccentricity of the\nstar. For a $\\gamma=5/3$ (or $\\gamma=4/3$) polytropic star, after a pTDE its\nremnant gains orbital energy when the impact factor $\\beta \\gtrsim 0.62$ (or\n$\\gtrsim 1.1$) or loses energy vice versa. Additionally, we verify an\nanalytical equation for orbital energy change that is applicable across various\nsystems. Through hydrodynamic simulations, we also explore the structure of the\nstellar remnant post-tidal stripping. Our findings provide critical insights\nfor interpreting observed pTDEs and advancing knowledge on the orbital\nevolution and event rate of these events.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}