{"id":"2408.12258","title":"Single-molecule junctions map the interplay between electrons and\n  chirality","authors":"Anil Kumar Singh, Kevin Martin, Maurizio Mastropasqua Talamo, Axel\n  Houssin, Nicolas Vanthuyne, Narcis Avarvari, and Oren Tal","authorsParsed":[["Singh","Anil Kumar",""],["Martin","Kevin",""],["Talamo","Maurizio Mastropasqua",""],["Houssin","Axel",""],["Vanthuyne","Nicolas",""],["Avarvari","Narcis",""],["Tal","Oren",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 09:56:20 GMT"}],"updateDate":"2024-08-23","timestamp":1724320580000,"abstract":"  The interplay of electrons with a chiral medium has a diverse impact across\nscience and technology, influencing drug separation, chemical reactions, and\nelectronic transport. In particular, such electronchirality interactions can\nsignificantly affect charge and spin transport in chiral conductors, ranging\nfrom bulk semiconductors down to individual molecules. Consequentially, these\ninteractions are appealing for spintronic manipulations. However, an atomistic\nmapping of the different electron chirality interactions and their potential\nfor spintronics has yet to be reached. Here, we find that single molecule\njunctions based on helicene molecules behave as a combined magnetic diode and\nspin valve device. This dual functionality is used to identify the coexistence\nof different electron chirality interactions at the atomic scale. Specifically,\nwe find that the magnetic diode behavior arises from an interaction between the\nangular momentum of electrons in a chiral medium and magnetic fields, whereas\nthe spin valve functionality stems from an interaction between the electron\nspin and a chiral medium. The coexistence of these two interactions in the same\natomic scale system is then used to identify the distinct properties of each\ninteraction. This work uncovers the different electron chirality interactions\navailable at the atomic level. The found concurrent existence of such\ninteractions can broaden the available methods for spintronics by combining\ntheir peculiar functionalities.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}