{"id":"2408.14072","title":"Hybrid SIC Aided Hybrid NOMA: A New Approach For Improving Energy\n  Efficiency","authors":"Yanshi Sun, Wei Cao, Ning Wang, Momiao Zhou, Zhiguo Ding","authorsParsed":[["Sun","Yanshi",""],["Cao","Wei",""],["Wang","Ning",""],["Zhou","Momiao",""],["Ding","Zhiguo",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 07:56:15 GMT"}],"updateDate":"2024-08-27","timestamp":1724658975000,"abstract":"  Hybrid non-orthogonal multiple access (NOMA), which organically combines pure\nNOMA and conventional OMA, has recently received significant attention to be a\npromising multiple access framework for future wireless communication networks.\nHowever, most of the literatures on hybrid NOMA only consider fixed order of\nsuccessive interference cancellation (SIC), namely FSIC, for the NOMA\ntransmission phase of hybrid NOMA, resulting in limited performance.\nDifferently, this paper aims to reveal the potential of applying hybrid SIC\n(HSIC) to improve the energy efficiency of hybrid NOMA. Specifically, a HSIC\naided hybrid NOMA scheme is proposed, which can be treated as a simple add-on\nto the legacy orthogonal multiple access (OMA) based network. The proposed\nscheme offers some users (termed ``opportunistic users'') to have more chances\nto transmit by transparently sharing legacy users' time slots. For a fair\ncomparison, a power reducing coefficient $\\beta$ is introduced to ensure that\nthe energy consumption of the proposed scheme is less than conventional OMA.\nGiven $\\beta$, the probability for the event that the achievable rate of the\nproposed HSIC aided hybrid NOMA scheme cannot outperform its OMA counterpart is\nobtained in closed-form, by considering impact of user pairing. Furthermore,\nasymptotic analysis shows that the aforementioned probability can approach zero\nunder some given conditions in the SNR regime, indicating that the energy\nefficiency of the proposed scheme is almost surely higher than that of OMA for\nthese given conditions. Numerical results are presented to verify the analysis\nand also demonstrate the benefit of applying HSIC compared to FSIC.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}