{"id":"2408.02719","title":"Turbulent Pressure Support in Galaxy Clusters -- Impact of the\n  Hydrodynamical Solver","authors":"Frederick Groth, Milena Valentini, Ulrich P. Steinwandel, David\n  Vall\\'es-P\\'erez, Klaus Dolag","authorsParsed":[["Groth","Frederick",""],["Valentini","Milena",""],["Steinwandel","Ulrich P.",""],["Vallés-Pérez","David",""],["Dolag","Klaus",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-07","timestamp":1722880800000,"abstract":"  The amount of turbulent pressure in galaxy clusters is still debated,\nespecially as for the impact of the dynamical state and the hydro-method used\nfor simulations. We study the turbulent pressure fraction in the intra cluster\nmedium of massive galaxy clusters. We aim to understand the impact of the\nhydrodynamical scheme, analysis method, and dynamical state on the final\nproperties of galaxy clusters from cosmological simulations. We perform\nnon-radiative simulations of a set of zoom-in regions of seven galaxy clusters\nwith Meshless Finite Mass (MFM) and Smoothed Particle Hydrodynamics (SPH). We\nuse three different analysis methods based on: $(i)$ the deviation from\nhydrostatic equilibrium, $(ii)$ the solenoidal velocity component obtained by a\nHelmholtz-Hodge decomposition, and $(iii)$ the small-scale velocity obtained\nthrough a multi-scale filtering approach. We split the sample of simulated\nclusters into active and relaxed clusters. Our simulations predict an increased\nturbulent pressure fraction for active compared to relaxed clusters. This is\nespecially visible for the velocity-based methods. For these, we also find\nincreased turbulence for the MFM simulations compared to SPH, consistent with\nfindings from more idealized simulations. The predicted non-thermal pressure\nfraction varies between a few percent for relaxed clusters and $\\approx13\\%$\nfor active ones within the cluster center and increases towards the outskirts.\nNo clear trend with redshift is visible. Our analysis quantitatively assesses\nthe importance played by the hydrodynamical scheme and the analysis method to\ndetermine the non-thermal/turbulent pressure fraction. While our setup is\nrelatively simple (non-radiative runs), our simulations show agreement with\nprevious, more idealized simulations, and make a step further toward the\nunderstanding of turbulence.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}