{"id":"2408.00301","title":"A Data-Driven Model for the Field Emission from Broad-Area Electrodes","authors":"Moein Borghei and Robin Langtry","authorsParsed":[["Borghei","Moein",""],["Langtry","Robin",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 05:57:59 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 21:04:21 GMT"}],"updateDate":"2024-09-20","timestamp":1722491879000,"abstract":"  Electron emission from cathodes in high field gradients is a quantum\ntunneling effect. The 1928 Fowler-Nordheim field emission (FE) equation and the\n1956 Murphy-Good FE equation have traditionally been key in describing cold\nfield emissions, offering estimates for emitters for almost a century.\nNevertheless, applying FE theory in practice is often constrained by the lack\nof data on the distribution and geometry of the emission sites. Predictions\nbecome more challenging with an uneven electric field distribution at the\ncathode surface. Consequently, FE formulations are frequently calibrated using\ncurrent-voltage data after test, limiting their efficacy as true predictive\nmodels.\n  This study develops an alternative model for field emission using a\ndata-driven predictive approach based on (1) vast experimental data, (2)\nelectrostatic simulations of the cathode surface, and (3) detailed material and\ngeometry properties, which together overcome these limitations. The objective\nof this work is to develop and harness this comprehensive dataset to train a\nmachine learning model capable of providing precise predictions of the cathode\ncurrent in order to further the understanding and application of field emission\nphenomena. More than 259 hours of experimental data have been processed to\ntrain and benchmark some of the well-known machine learning models. After two\nstages of optimization, a coefficient of determination >98% is achieved in the\nprediction total field emission current using ensemble models.\n","subjects":["Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"g6NyKTt3rFUQhHnA0R3X902XJl1IWz8kFAz-WD4y1gg","pdfSize":"4690661"}
