{"id":"2408.07681","title":"Visualizing High Entropy Alloy Spaces: Methods and Best Practices","authors":"Brent Vela, Trevor Hastings, Raymundo Arr\\'oyave","authorsParsed":[["Vela","Brent",""],["Hastings","Trevor",""],["Arróyave","Raymundo",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 17:29:38 GMT"}],"updateDate":"2024-08-15","timestamp":1723656578000,"abstract":"  Multi-Principal Element Alloys (MPEAs) have emerged as an exciting area of\nresearch in materials science in the 2020s, owing to the vast potential for\ndiscovering alloys with unique and tailored properties enabled by the\ncombinations of elements. However, the chemical complexity of MPEAs poses a\nsignificant challenge in visualizing composition-property relationships in\nhigh-dimensional design spaces. Without effective visualization techniques,\ndesigning chemically complex alloys is practically impossible. In this\nmethods/protocols article, we present a `toolbox' of visualization techniques\nthat allow for meaningful and insightful visualizations of MPEA composition\nspaces and property spaces. Our contribution to this toolbox are UMAP\nprojections of entire alloy spaces. We deploy this visualization tool-kit on\nthe following MPEA case studies: 1) Visualizing literature reviews, 2)\nconstraint-satisfaction alloy design scheme, 3) Bayesian optimization alloy\ndesign campaigns. Furthermore, we show how this method can be applied to any\nbarycentric design space. While there is no one-size-fits-all visualization\ntechnique, our toolbox offers a range of methods and best practices that can be\ntailored to specific MPEA research needs. This article is intended for\nmaterials scientists interested in performing research on multi-principal\nelement alloys, chemically complex alloys, or high entropy alloys, and is\nexpected to facilitate the discovery of novel and tailored properties in MPEAs.\n","subjects":["Condensed Matter/Materials Science","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}