{"id":"2408.03151","title":"Optimizing Disease Prediction with Artificial Intelligence Driven\n  Feature Selection and Attention Networks","authors":"D. Dhinakaran, S. Edwin Raja, M. Thiyagarajan, J. Jeno Jasmine, P.\n  Raghavan","authorsParsed":[["Dhinakaran","D.",""],["Raja","S. Edwin",""],["Thiyagarajan","M.",""],["Jasmine","J. Jeno",""],["Raghavan","P.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 14:12:27 GMT"}],"updateDate":"2024-08-07","timestamp":1722435147000,"abstract":"  The rapid integration of machine learning methodologies in healthcare has\nignited innovative strategies for disease prediction, particularly with the\nvast repositories of Electronic Health Records (EHR) data. This article delves\ninto the realm of multi-disease prediction, presenting a comprehensive study\nthat introduces a pioneering ensemble feature selection model. This model,\ndesigned to optimize learning systems, combines statistical, deep, and\noptimally selected features through the innovative Stabilized Energy Valley\nOptimization with Enhanced Bounds (SEV-EB) algorithm. The objective is to\nachieve unparalleled accuracy and stability in predicting various disorders.\nThis work proposes an advanced ensemble model that synergistically integrates\nstatistical, deep, and optimally selected features. This combination aims to\nenhance the predictive power of the model by capturing diverse aspects of the\nhealth data. At the heart of the proposed model lies the SEV-EB algorithm, a\nnovel approach to optimal feature selection. The algorithm introduces enhanced\nbounds and stabilization techniques, contributing to the robustness and\naccuracy of the overall prediction model. To further elevate the predictive\ncapabilities, an HSC-AttentionNet is introduced. This network architecture\ncombines deep temporal convolution capabilities with LSTM, allowing the model\nto capture both short-term patterns and long-term dependencies in health data.\nRigorous evaluations showcase the remarkable performance of the proposed model.\nAchieving a 95% accuracy and 94% F1-score in predicting various disorders, the\nmodel surpasses traditional methods, signifying a significant advancement in\ndisease prediction accuracy. The implications of this research extend beyond\nthe confines of academia.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}