{"id":"2408.14402","title":"A quasi-Bayesian sequential approach to deconvolution density estimation","authors":"Stefano Favaro, Sandra Fortini","authorsParsed":[["Favaro","Stefano",""],["Fortini","Sandra",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 16:40:04 GMT"}],"updateDate":"2024-08-27","timestamp":1724690404000,"abstract":"  Density deconvolution addresses the estimation of the unknown (probability)\ndensity function $f$ of a random signal from data that are observed with an\nindependent additive random noise. This is a classical problem in statistics,\nfor which frequentist and Bayesian nonparametric approaches are available to\ndeal with static or batch data. In this paper, we consider the problem of\ndensity deconvolution in a streaming or online setting where noisy data arrive\nprogressively, with no predetermined sample size, and we develop a sequential\nnonparametric approach to estimate $f$. By relying on a quasi-Bayesian\nsequential approach, often referred to as Newton's algorithm, we obtain\nestimates of $f$ that are of easy evaluation, computationally efficient, and\nwith a computational cost that remains constant as the amount of data\nincreases, which is critical in the streaming setting. Large sample asymptotic\nproperties of the proposed estimates are studied, yielding provable guarantees\nwith respect to the estimation of $f$ at a point (local) and on an interval\n(uniform). In particular, we establish local and uniform central limit\ntheorems, providing corresponding asymptotic credible intervals and bands. We\nvalidate empirically our methods on synthetic and real data, by considering the\ncommon setting of Laplace and Gaussian noise distributions, and make a\ncomparison with respect to the kernel-based approach and a Bayesian\nnonparametric approach with a Dirichlet process mixture prior.\n","subjects":["Statistics/Methodology","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hw6xNctaTmqipvPsZhF2RfHBee74W0mdbNOKYx_ol5o","pdfSize":"1782731"}
