{"id":"2408.04579","title":"SAM2-Adapter: Evaluating & Adapting Segment Anything 2 in Downstream\n  Tasks: Camouflage, Shadow, Medical Image Segmentation, and More","authors":"Tianrun Chen, Ankang Lu, Lanyun Zhu, Chaotao Ding, Chunan Yu, Deyi Ji,\n  Zejian Li, Lingyun Sun, Papa Mao, Ying Zang","authorsParsed":[["Chen","Tianrun",""],["Lu","Ankang",""],["Zhu","Lanyun",""],["Ding","Chaotao",""],["Yu","Chunan",""],["Ji","Deyi",""],["Li","Zejian",""],["Sun","Lingyun",""],["Mao","Papa",""],["Zang","Ying",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 16:40:15 GMT"},{"version":"v2","created":"Sat, 10 Aug 2024 11:20:52 GMT"}],"updateDate":"2024-08-13","timestamp":1723135215000,"abstract":"  The advent of large models, also known as foundation models, has\nsignificantly transformed the AI research landscape, with models like Segment\nAnything (SAM) achieving notable success in diverse image segmentation\nscenarios. Despite its advancements, SAM encountered limitations in handling\nsome complex low-level segmentation tasks like camouflaged object and medical\nimaging. In response, in 2023, we introduced SAM-Adapter, which demonstrated\nimproved performance on these challenging tasks. Now, with the release of\nSegment Anything 2 (SAM2), a successor with enhanced architecture and a larger\ntraining corpus, we reassess these challenges. This paper introduces\nSAM2-Adapter, the first adapter designed to overcome the persistent limitations\nobserved in SAM2 and achieve new state-of-the-art (SOTA) results in specific\ndownstream tasks including medical image segmentation, camouflaged (concealed)\nobject detection, and shadow detection. SAM2-Adapter builds on the\nSAM-Adapter's strengths, offering enhanced generalizability and composability\nfor diverse applications. We present extensive experimental results\ndemonstrating SAM2-Adapter's effectiveness. We show the potential and encourage\nthe research community to leverage the SAM2 model with our SAM2-Adapter for\nachieving superior segmentation outcomes. Code, pre-trained models, and data\nprocessing protocols are available at\nhttp://tianrun-chen.github.io/SAM-Adaptor/\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}