{"id":"2408.07273","title":"SCOTCH Search for Clandestine Optically Thick Compact HII regions II","authors":"A. L. Patel, J. S. Urquhart, A. Y. Yang, T. Moore, M. A. Thompson, K.\n  M. Menten, T. Csengeri","authorsParsed":[["Patel","A. L.",""],["Urquhart","J. S.",""],["Yang","A. Y.",""],["Moore","T.",""],["Thompson","M. A.",""],["Menten","K. M.",""],["Csengeri","T.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 03:44:13 GMT"}],"updateDate":"2024-08-15","timestamp":1723607053000,"abstract":"  In this study we present 18 to 24 GHz and high angular resolution radio\nwavelength Australia Telescope Compact Array follow up observations towards a\nsample of 39 HC HII region candidates. These objects, taken from a sample\nhosting 6.7 GHz methanol masers, were chosen due to the compact and optically\nthick nature of their continuum emission. We have detected 27 compact radio\nsources and constructed their spectral energy distributions over the 5 to 24\nGHz range to determine the young HII regions physical properties, i.e.,\ndiameter, electron density ne, emission measure, Lyman continuum flux NLy and\nturnover frequency. The flux measurements are fitted for 20 objects assuming an\nionisation bounded HII region with uniform density model. For the remaining 7\nobjects that lack constraints spanning both their optically thick and thin\nregimes, we utilise relations from the literature to determine their physical\nproperties. Comparing these determined parameters with those of known\nhypercompact and ultracompact HII regions, we have identified 13 HC HII\nregions, 6 intermediate objects that fall between HC HII and UC HII regions, 6\nUC HII regions and one radio jet candidate which increases the known population\nof HC HII regions by 50 per cent. All the young and compact HII regions are\nembedded in dusty and dense clumps and 80 percent of the HC HII regions\nidentified in this work are associated with various maser species. Four of our\nradio sources remain optically thick at 24 GHz, we consider these to be amongst\nthe youngest HC HII regions.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}