{"id":"2408.00667","title":"Leveraging PRS and PDSCH for Integrated Sensing and Communication\n  Systems","authors":"Keivan Khosroshahi, Philippe Sehier, Sami Mekki","authorsParsed":[["Khosroshahi","Keivan",""],["Sehier","Philippe",""],["Mekki","Sami",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 16:03:20 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 15:17:52 GMT"}],"updateDate":"2024-08-05","timestamp":1722528200000,"abstract":"  From the industrial standpoint on integrated sensing and communication\n(ISAC), the preference lies in augmenting existing infrastructure with sensing\nservices while minimizing network changes and leveraging available resources.\nThis paper investigates the potential of utilizing the existing infrastructure\nof fifth-generation (5G) new radio (NR) signals as defined by the 3rd\ngeneration partnership project (3GPP), particularly focusing on pilot signals\nfor sensing within the ISAC framework. We propose to take advantage of the\nexisting positioning reference signal (PRS) for sensing and the physical\ndownlink shared channel (PDSCH) for communication, both readily available in 5G\nNR. However, the use of PRS for sensing poses challenges, leading to the\nappearance of ghost targets.\n  To overcome this obstacle, we propose two innovative approaches for different\nPRS comb sizes within the ISAC framework, leveraging the demodulation reference\nsignal (DMRS) within PDSCH to eliminate ghost targets. Subsequently, we\nformulate a resource allocation problem between PRS and PDSCH and determine the\nPareto optimal point between communication and sensing without ghost targets.\nThrough comprehensive simulation and analysis, we demonstrate that the joint\nexploitation of DMRS and PRS offers a promising solution for ghost target\nremoval, while effective time and frequency resource allocation enables the\nachievement of Pareto optimality in ISAC.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}