{"id":"2408.13532","title":"FFT-based surrogate modeling of auxetic metamaterials with real-time\n  prediction of effective elastic properties and swift inverse design","authors":"Hooman Danesh, Daniele Di Lorenzo, Francisco Chinesta, Stefanie Reese,\n  Tim Brepols","authorsParsed":[["Danesh","Hooman",""],["Di Lorenzo","Daniele",""],["Chinesta","Francisco",""],["Reese","Stefanie",""],["Brepols","Tim",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 09:20:33 GMT"}],"updateDate":"2024-08-27","timestamp":1724491233000,"abstract":"  Auxetic structures, known for their negative Poisson's ratio, exhibit\neffective elastic properties heavily influenced by their underlying structural\ngeometry and base material properties. While periodic homogenization of auxetic\nunit cells can be used to investigate these properties, it is computationally\nexpensive and limits design space exploration and inverse analysis. In this\npaper, surrogate models are developed for the real-time prediction of the\neffective elastic properties of auxetic unit cells with orthogonal voids of\ndifferent shapes. The unit cells feature orthogonal voids in four distinct\nshapes, including rectangular, diamond, oval, and peanut-shaped voids, each\ncharacterized by specific void diameters. The generated surrogate models accept\ngeometric parameters and the elastic properties of the base material as inputs\nto predict the effective elastic constants in real-time. This rapid evaluation\nenables a practical inverse analysis framework for obtaining the optimal design\nparameters that yield the desired effective response. The fast Fourier\ntransform (FFT)-based homogenization approach is adopted to efficiently\ngenerate data for developing the surrogate models, bypassing concerns about\nperiodic mesh generation and boundary conditions typically associated with the\nfinite element method (FEM). The performance of the generated surrogate models\nis rigorously examined through a train/test split methodology, a parametric\nstudy, and an inverse problem. Finally, a graphical user interface (GUI) is\ndeveloped, offering real-time prediction of the effective tangent stiffness and\nperforming inverse analysis to determine optimal geometric parameters.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}