{"id":"2408.10634","title":"Industry Perception of Security Challenges with Identity Access\n  Management Solutions","authors":"Abhishek Pratap Singh, Ievgeniia Kuzminykh, Bogdan Ghita","authorsParsed":[["Singh","Abhishek Pratap",""],["Kuzminykh","Ievgeniia",""],["Ghita","Bogdan",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 08:19:58 GMT"}],"updateDate":"2024-08-21","timestamp":1724141998000,"abstract":"  Identity Access Management (IAM) is an area posing significant challenges,\nparticularly in the context of remote connectivity and distributed or\ncloud-based systems. A wide range of technical solutions have been proposed by\nprior research, but the integration of these solutions in the commercial sector\nrepresent steps that significantly hamper their acceptance. The study aims to\noutline the current perception and security issues associated with IAMs\nsolutions from the perspective of the beneficiaries. The analysis relies on a\nseries of interviews with 45 cyber security professionals from different\norganisations all over the world. As results showed, cloud IAM solutions and on\npremises IAM solutions are affected by different issues. The main challenges\nfor cloud based IAM solutions were Default configurations, Poor management of\nNon-Human Identities such as Service accounts, Poor certificate management,\nPoor API configuration and limited Log analysis. In contrast, the challenges\nfor on premise solutions were Multi Factor Authentication, insecure Default\nconfigurations, Lack of skillsets required to manage IAM solution securely,\nPoor password policies, Unpatched vulnerabilities, and compromise of\nSingle-Sign on leading to compromise of multiple entities. The study also\ndetermined that, regardless the evolving functionality of cloud based IAM\nsolutions, 41% of respondents believe that the on premise solutions more secure\nthan the cloud-based ones. As pointed out by the respondents, cloud IAM may\npotentially expose organisations to a wider range of vulnerabilities due to the\ncomplexity of the underlying solutions, challenges with managing permissions,\nand compliance to dynamic IAM policies.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}