{"id":"2408.04150","title":"Decorrelating Structure via Adapters Makes Ensemble Learning Practical\n  for Semi-supervised Learning","authors":"Jiaqi Wu, Junbiao Pang, Qingming Huang","authorsParsed":[["Wu","Jiaqi",""],["Pang","Junbiao",""],["Huang","Qingming",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 01:31:38 GMT"}],"updateDate":"2024-08-09","timestamp":1723080698000,"abstract":"  In computer vision, traditional ensemble learning methods exhibit either a\nlow training efficiency or the limited performance to enhance the reliability\nof deep neural networks. In this paper, we propose a lightweight,\nloss-function-free, and architecture-agnostic ensemble learning by the\nDecorrelating Structure via Adapters (DSA) for various visual tasks.\nConcretely, the proposed DSA leverages the structure-diverse adapters to\ndecorrelate multiple prediction heads without any tailed regularization or\nloss. This allows DSA to be easily extensible to architecture-agnostic networks\nfor a range of computer vision tasks. Importantly, the theoretically analysis\nshows that the proposed DSA has a lower bias and variance than that of the\nsingle head based method (which is adopted by most of the state of art\napproaches). Consequently, the DSA makes deep networks reliable and robust for\nthe various real-world challenges, \\textit{e.g.}, data corruption, and label\nnoises. Extensive experiments combining the proposed method with FreeMatch\nachieved the accuracy improvements of 5.35% on CIFAR-10 dataset with 40 labeled\ndata and 0.71% on CIFAR-100 dataset with 400 labeled data. Besides, combining\nthe proposed method with DualPose achieved the improvements in the Percentage\nof Correct Keypoints (PCK) by 2.08% on the Sniffing dataset with 100 data (30\nlabeled data), 5.2% on the FLIC dataset with 100 data (including 50 labeled\ndata), and 2.35% on the LSP dataset with 200 data (100 labeled data).\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}