{"id":"2408.11992","title":"MBSS-T1: Model-Based Self-Supervised Motion Correction for Robust\n  Cardiac T1 Mapping","authors":"Eyal Hanania, Ilya Volovik, Daphna Link-Sourani, Israel Cohen, Moti\n  Freiman","authorsParsed":[["Hanania","Eyal",""],["Volovik","Ilya",""],["Link-Sourani","Daphna",""],["Cohen","Israel",""],["Freiman","Moti",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 21:03:36 GMT"},{"version":"v2","created":"Sun, 1 Sep 2024 07:04:56 GMT"}],"updateDate":"2024-09-04","timestamp":1724274216000,"abstract":"  T1 mapping is a valuable quantitative MRI technique for diagnosing diffuse\nmyocardial diseases. Traditional methods, relying on breath-hold sequences and\necho triggering, face challenges with patient compliance and arrhythmias,\nlimiting their effectiveness. Image registration can enable motion-robust T1\nmapping, but inherent intensity differences between time points pose a\nchallenge. We introduce MBSS-T1, a self-supervised model for motion correction\nin cardiac T1 mapping, constrained by physical and anatomical principles. The\nphysical constraints ensure expected signal decay behavior, while the\nanatomical constraints maintain realistic deformations. The unique combination\nof these constraints ensures accurate T1 mapping along the longitudinal\nrelaxation axis. MBSS-T1 outperformed baseline deep-learning-based image\nregistration approaches in a 5-fold experiment on a public dataset of 210\npatients (STONE sequence) and an internal dataset of 19 patients (MOLLI\nsequence). MBSS-T1 excelled in model fitting quality ($R^2$: 0.975 vs. 0.941,\n0.946), anatomical alignment (Dice score: 0.89 vs. 0.84, 0.88), and expert\nvisual quality assessment for the presence of visible motion artifacts (4.33\nvs. 3.38, 3.66). MBSS-T1 has the potential to enable motion-robust T1 mapping\nfor a broader range of patients, overcoming challenges such as arrhythmias and\nsuboptimal compliance, and allowing for free-breathing T1 mapping without\nrequiring large training datasets. Our code will be publicly available upon\nacceptance.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}