{"id":"2408.02872","title":"Rate-Splitting for Joint Unicast and Multicast Transmission in LEO\n  Satellite Networks with Non-Uniform Traffic Demand","authors":"Jaehyup Seong, Juha Park, Dong-Hyun Jung, Jeonghun Park, and Wonjae\n  Shin","authorsParsed":[["Seong","Jaehyup",""],["Park","Juha",""],["Jung","Dong-Hyun",""],["Park","Jeonghun",""],["Shin","Wonjae",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 00:13:12 GMT"}],"updateDate":"2024-08-07","timestamp":1722903192000,"abstract":"  Low Earth orbit (LEO) satellite communications (SATCOM) with ubiquitous\nglobal connectivity is deemed a pivotal catalyst in advancing wireless\ncommunication systems for 5G and beyond. LEO SATCOM excels in delivering\nversatile information services across expansive areas, facilitating both\nunicast and multicast transmissions via high-speed broadband capability.\nNonetheless, given the broadband coverage of LEO SATCOM, traffic demand\ndistribution within the service area is non-uniform, and the\ntime/frequency/power resources available at LEO satellites remain significantly\nlimited. Motivated by these challenges, we propose a rate-matching framework\nfor non-orthogonal unicast and multicast (NOUM) transmission. Our approach aims\nto minimize the difference between offered rates and traffic demands for both\nunicast and multicast messages. By multiplexing unicast and multicast\ntransmissions over the same radio resource, rate-splitting multiple access\n(RSMA) is employed to manage interference between unicast and multicast\nstreams, as well as inter-user interference under imperfect channel state\ninformation at the LEO satellite. To address the formulated problems\nnon-smoothness and non-convexity, the common rate is approximated using the\nLogSumExp technique. Thereafter, we represent the common rate portion as the\nratio of the approximated function, converting the problem into an\nunconstrained form. A generalized power iteration (GPI)-based algorithm, coined\nGPI-RS-NOUM, is proposed upon this reformulation. Through comprehensive\nnumerical analysis across diverse simulation setups, we demonstrate that the\nproposed framework outperforms various benchmarks for LEO SATCOM with uneven\ntraffic demands.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Networking and Internet Architecture","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}