{"id":"2408.03393","title":"Biomedical Image Segmentation: A Systematic Literature Review of Deep\n  Learning Based Object Detection Methods","authors":"Fazli Wahid, Yingliang Ma, Dawar Khan, Muhammad Aamir, and Syed U. K.\n  Bukhari","authorsParsed":[["Wahid","Fazli",""],["Ma","Yingliang",""],["Khan","Dawar",""],["Aamir","Muhammad",""],["Bukhari","Syed U. K.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 18:38:55 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 19:56:19 GMT"}],"updateDate":"2024-08-30","timestamp":1722969535000,"abstract":"  Biomedical image segmentation plays a vital role in diagnosis of diseases\nacross various organs. Deep learning-based object detection methods are\ncommonly used for such segmentation. There exists an extensive research in this\ntopic. However, there is no standard review on this topic. Existing surveys\noften lack a standardized approach or focus on broader segmentation techniques.\nIn this paper, we conducted a systematic literature review (SLR), collected and\nanalysed 148 articles that explore deep learning object detection methods for\nbiomedical image segmentation. We critically analyzed these methods, identified\nthe key challenges, and discussed the future directions. From the selected\narticles we extracted the results including the deep learning models, targeted\nimaging modalities, targeted diseases, and the metrics for the analysis of the\nmethods. The results have been presented in tabular and/or charted forms. The\nresults are presented in three major categories including two stage detection\nmodels, one stage detection models and point-based detection models. Each\narticle is individually analyzed along with its pros and cons. Finally, we\ndiscuss open challenges, potential benefits, and future research directions.\nThis SLR aims to provide the research community with a quick yet deeper\nunderstanding of these segmentation models, ultimately facilitating the\ndevelopment of more powerful solutions for biomedical image analysis.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}