{"id":"2408.02250","title":"Hierarchical Clustering using Reversible Binary Cellular Automata for\n  High-Dimensional Data","authors":"Baby C. J. and Kamalika Bhattacharjee","authorsParsed":[["J.","Baby C.",""],["Bhattacharjee","Kamalika",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 05:48:45 GMT"}],"updateDate":"2024-08-06","timestamp":1722836925000,"abstract":"  This work proposes a hierarchical clustering algorithm for high-dimensional\ndatasets using the cyclic space of reversible finite cellular automata. In\ncellular automaton (CA) based clustering, if two objects belong to the same\ncycle, they are closely related and considered as part of the same cluster.\nHowever, if a high-dimensional dataset is clustered using the cycles of one CA,\nclosely related objects may belong to different cycles. This paper identifies\nthe relationship between objects in two different cycles based on the median of\nall elements in each cycle so that they can be grouped in the next stage.\nFurther, to minimize the number of intermediate clusters which in turn reduces\nthe computational cost, a rule selection strategy is taken to find the best\nrules based on information propagation and cycle structure. After encoding the\ndataset using frequency-based encoding such that the consecutive data elements\nmaintain a minimum hamming distance in encoded form, our proposed clustering\nalgorithm iterates over three stages to finally cluster the data elements into\nthe desired number of clusters given by user. This algorithm can be applied to\nvarious fields, including healthcare, sports, chemical research, agriculture,\netc. When verified over standard benchmark datasets with various performance\nmetrics, our algorithm is at par with the existing algorithms with quadratic\ntime complexity.\n","subjects":["Computing Research Repository/Formal Languages and Automata Theory","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"V-c5m6JEUMB8YF9a83TSYY_TK-WLu4YJOg-FNKMctGY","pdfSize":"975417"}
