{"id":"2408.01196","title":"Game Theory Based Community-Aware Opinion Dynamics","authors":"Shanfan Zhang, Xiaoting Shen, Zhan Bu","authorsParsed":[["Zhang","Shanfan",""],["Shen","Xiaoting",""],["Bu","Zhan",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 11:24:56 GMT"}],"updateDate":"2024-08-05","timestamp":1722597896000,"abstract":"  Examining the mechanisms underlying the formation and evolution of opinions\nwithin real-world social systems, which consist of numerous individuals, can\nprovide valuable insights for effective social functioning and informed\nbusiness decision making. The focus of our study is on the dynamics of opinions\ninside a networked multi-agent system. We provide a novel approach called the\nGame Theory Based Community-Aware Opinion Formation Process (GCAOFP) to\naccurately represent the co-evolutionary dynamics of communities and opinions\nin real-world social systems. The GCAOFP algorithm comprises two distinct steps\nin each iteration. 1) The Community Dynamics Process conceptualizes the process\nof community formation as a non-cooperative game involving a finite number of\nagents. Each individual agent aims to maximize their own utility by adopting a\nresponse that leads to the most favorable update of the community label. 2) The\nOpinion Formation Process involves the updating of an individual agent's\nopinion within a community-aware framework that incorporates bounded\nconfidence. This process takes into account the updated matrix of community\nmembers and ensures that an agent's opinion aligns with the opinions of others\nwithin their community, within certain defined limits. The present study\nprovides a theoretical proof that under any initial conditions, the\naforementioned co-evolutionary dynamics process will ultimately reach an\nequilibrium state. In this state, both the opinion vector and community member\nmatrix will stabilize after a finite number of iterations. In contrast to\nconventional opinion dynamics models, the guaranteed convergence of agent\nopinion within the same community ensures that the convergence of opinions\ntakes place exclusively inside a given community.\n","subjects":["Computing Research Repository/Computer Science and Game Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}