{"id":"2408.07741","title":"The impact of cosmic variance on PTAs anisotropy searches","authors":"Thomas Konstandin, Anna-Malin Lemke, Andrea Mitridate, Enrico Perboni","authorsParsed":[["Konstandin","Thomas",""],["Lemke","Anna-Malin",""],["Mitridate","Andrea",""],["Perboni","Enrico",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-16","timestamp":1723658401000,"abstract":"  Several Pulsar Timing Array (PTA) collaborations have recently found evidence\nfor a Gravitational Wave Background (GWB) by measuring the perturbations that\nthis background induces in the time-of-arrivals of pulsar signals. These\nperturbations are expected to be correlated across different pulsars and, for\nisotropic GWBs, the expected values of these correlations (obtained by\naveraging over different GWB realizations) are a simple function of the\npulsars' angular separations, known as the Hellings-Downs (HD) correlation\nfunction. On the other hand, anisotropic GWBs would induce deviations from\nthese HD correlations in a way that can be used to search for anisotropic\ndistributions of the GWB power. However, even for isotropic GWBs, interference\nbetween GW sources radiating at overlapping frequencies induces deviations from\nthe HD correlation pattern, an effect known in the literature as \"cosmic\nvariance\". In this work, we study the impact of cosmic variance on PTA\nanisotropy searches. We find that the fluctuations in cross-correlations\nrelated to cosmic variance can lead to the miss-classification of isotropic\nGWBs as anisotropic, leading to a false detection rate of $\\sim 50\\%$ for\nfrequentist anisotropy searches. We also observe that cosmic variance\ncomplicates the reconstruction of the GWB sky map, making it more challenging\nto resolve bright GW hotspots, like the ones expected to be produced from a\nSupermassive Black Hole Binaries population. These findings highlight the need\nto refine anisotropy search techniques to improve our ability to reconstruct\nthe GWB sky map and accurately assess the significance of any isotropy\ndeviations we might find in it.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2jjIUnEo-UZJxxKXMx_ITd6nVPnJqEK_CDuN6rcf5C4","pdfSize":"2144635"}
