{"id":"2408.08370","title":"When invariance implies exchangeability (and applications to invariant\n  Keisler measures)","authors":"Samuel Braunfeld, Colin Jahel, Paolo Marimon","authorsParsed":[["Braunfeld","Samuel",""],["Jahel","Colin",""],["Marimon","Paolo",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 18:25:34 GMT"}],"updateDate":"2024-08-19","timestamp":1723746334000,"abstract":"  We study the problem of when, given a homogeneous structure $M$ and a space\n$S$ of expansions of $M$, every $\\mathrm{Aut}(M)$-invariant probability measure\non $S$ is exchangeable (i.e. $S_\\infty$-invariant). We define a condition of\n$k$-overlap closedness on $M$ which implies exchangeability of random\nexpansions by a class of structures whose finite substructures are all\ncontained in a hereditary class with labelled growth-rate $O(e^{n^{k+\\delta}})$\nfor all $\\delta>0$. For example, the generic tetrahedron-free $3$-hypergraph is\n$2$-overlap closed and so all of its random expansions by graphs are\nexchangeable. Our more general results on $k$-overlap closedness for\nhomogeneous structures imply the same for every finitely bounded homogeneous\n$3$-hypergraph with free amalgamation. Our results extend and recover both the\nwork of Angel, Kechris and Lyons on invariant random orderings of homogeneous\nstructures and some of the work of Crane and Towsner, and Ackerman on\nrelatively exchangeable structures. We also study conditions under which there\nare non-exchangeable invariant random expansions looking at the universal\nhomogeneous kay-graphs.\n  In the second part of the paper we apply our results to study invariant\nKeisler measures in homogeneous structures. We prove that invariant Keisler\nmeasures can be viewed as a particular kind of invariant random expansion.\nThus, we describe the spaces of invariant Keisler measures of various\nhomogeneous structures, obtaining the first results of this kind since the work\nof Albert and Ensley. We also show there are $2^{\\aleph_0}$ supersimple\nhomogeneous ternary structures for which there are non-forking formulas which\nare universally measure zero.\n","subjects":["Mathematics/Logic","Mathematics/Combinatorics","Mathematics/Dynamical Systems","Mathematics/Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}