{"id":"2408.14652","title":"Continuous Optimization for Decoding Errors","authors":"Shashank Srivastava","authorsParsed":[["Srivastava","Shashank",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 21:33:34 GMT"}],"updateDate":"2024-08-28","timestamp":1724708014000,"abstract":"  Error-correcting codes are one of the most fundamental objects in\npseudorandomness, with applications in communication, complexity theory, and\nbeyond. Codes are useful because of their ability to support decoding, which is\nthe task of recovering a codeword from its noisy copy. List decoding is a\nrelaxation where the decoder is allowed to output a list of codewords, and has\nseen tremendous progress over the last 25 years. In this thesis, we prove new\nalgorithmic and combinatorial results about list decoding.\n  We describe a list decoding framework that reduces the task of efficient\ndecoding to proving distance in certain restricted proof systems. We then\ninstantiate this framework for Tanner codes of Sipser and Spielman [IEEE Trans.\nInf. Theory 1996] and Alon-Edmonds-Luby (AEL) distance amplification [FOCS\n1995] of unique decodable base codes to get the first polynomial time list\ndecoding algorithms for these codes. We also show extensions to the quantum\nversion of AEL distance amplification to get polynomial-time list decodable\nquantum LDPC codes.\n  We next give an alternate viewpoint of the above framework based on abstract\nregularity lemmas. We show how to efficiently implement the regularity lemma\nfor the case of Ta-Shma's explicit codes near the Gilbert-Varshamov bound [STOC\n2017]. This leads to a near-linear time algorithm for unique decoding of\nTa-Shma's code.\n  We also give new combinatorial results that improve known list sizes beyond\nthe Johnson bound. Firstly, we adapt the AEL amplification to construct a new\nfamily of explicit codes that can be combinatorially list decoded to the\noptimal error correction radius. This is the first example of such a code that\ndoes not use significant algebraic ingredients. Secondly, we present list size\nimprovements for Folded Reed-Solomon codes, improving the state of the art list\nsize for explicit list decoding capacity achieving codes.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Data Structures and Algorithms","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YWDGi3-3S3-DY3FBwO_7kWEy9gNjAYulEMTPK0C-RnY","pdfSize":"1725206"}
