{"id":"2408.01657","title":"Towards Tractability of the Diversity of Query Answers: Ultrametrics to\n  the Rescue","authors":"Marcelo Arenas, Timo Camillo Merkl, Reinhard Pichler, and Cristian\n  Riveros","authorsParsed":[["Arenas","Marcelo",""],["Merkl","Timo Camillo",""],["Pichler","Reinhard",""],["Riveros","Cristian",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 03:57:57 GMT"}],"updateDate":"2024-08-06","timestamp":1722657477000,"abstract":"  The set of answers to a query may be very large, potentially overwhelming\nusers when presented with the entire set. In such cases, presenting only a\nsmall subset of the answers to the user may be preferable. A natural\nrequirement for this subset is that it should be as diverse as possible to\nreflect the variety of the entire population. To achieve this, the diversity of\na subset is measured using a metric that determines how different two solutions\nare and a diversity function that extends this metric from pairs to sets. In\nthe past, several studies have shown that finding a diverse subset from an\nexplicitly given set is intractable even for simple metrics (like Hamming\ndistance) and simple diversity functions (like summing all pairwise distances).\nThis complexity barrier becomes even more challenging when trying to output a\ndiverse subset from a set that is only implicitly given such as the query\nanswers of a query and a database. Until now, tractable cases have been found\nonly for restricted problems and particular diversity functions.\n  To overcome these limitations, we focus on the notion of ultrametrics, which\nhave been widely studied and used in many applications. Starting from any\nultrametric $d$ and a diversity function $\\delta$ extending $d$, we provide\nsufficient conditions over $\\delta$ for having polynomial-time algorithms to\nconstruct diverse answers. To the best of our knowledge, these conditions are\nsatisfied by all diversity functions considered in the literature. Moreover, we\ncomplement these results with lower bounds that show specific cases when these\nconditions are not satisfied and finding diverse subsets becomes intractable.\nWe conclude by applying these results to the evaluation of conjunctive queries,\ndemonstrating efficient algorithms for finding a diverse subset of solutions\nfor acyclic conjunctive queries when the attribute order is used to measure\ndiversity.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Data Structures and Algorithms"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EUcarrc-oyZNyiXTvoVL4jMuguxtKo3icDuF1Tih_Dw","pdfSize":"506928","txDigest":"FN5CNPRqkzW7fHgqnpbLEtt2HENgFnZJvXVf9ieW5p1m","endEpoch":"1","status":"CERTIFIED"}
