{"id":"2408.17254","title":"High-resolution observations of recurrent jets from an arch filament\n  system","authors":"Reetika Joshi, Luc Rouppe van der Voort, Brigitte Schmieder, Fernando\n  Moreno-Insertis, Avijeet Prasad, Guillaume Aulanier, and Daniel\n  N\\'obrega-Siverio","authorsParsed":[["Joshi","Reetika",""],["van der Voort","Luc Rouppe",""],["Schmieder","Brigitte",""],["Moreno-Insertis","Fernando",""],["Prasad","Avijeet",""],["Aulanier","Guillaume",""],["Nóbrega-Siverio","Daniel",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 12:53:08 GMT"}],"updateDate":"2024-09-02","timestamp":1725022388000,"abstract":"  Solar jets are collimated plasma ejections along magnetic field lines\nobserved in hot (EUV jets) and cool (chromospheric surges) temperature\ndiagnostics. Their trigger mechanisms and the relationship between hot and cool\njets are still not completely understood. We aim to investigate the generation\nof a sequence of active region solar jets and their evolution from the\nphotospheric to the coronal heights. Using the synergy of high spatial and\ntemporal resolution observations by the SST, along with the SDO, we analyze a\nsequence of solar jets originating in a mixed polarity region between the\nleading and following sunspots of an active region. We use a NFFF extrapolation\ntechnique for deriving the magnetic field topology of the active region. A\nmixed polarity region is formed over a long period (24 hours) with persistent\nmagnetic flux emergence. This region has been observed as an arch filament\nsystem (AFS) in chromospheric SST observations. In this region, negative\npolarities surrounded by positive polarities create a fan-surface with a null\npoint at a height of 6 Mm detected in the NFFF extrapolation. SST observations\nin H-beta spectral line reveal a large flux rope over the AFS and moving from\nthe North to South, causing successive EUV and cool jets to move in the\nEast-West direction and later towards the South along the long open loops. The\nhigh resolution SST observations (0.038 arcsec per pixel) resolve the dark area\nobserved at the jet base and reveal the existence of an AFS with an extended\ncool jet which may be the result of a peeling-like mechanism of the AFS. Based\non the combined analysis of SST and AIA observations along with extrapolated\nmagnetic topology, it is suggested that the magnetic reconnection site may move\nsouthward by approximately 20 Mm until it reaches a region where the open\nmagnetic field lines are oriented North-South.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Jw2e86eHF1ZR1vd6G7OUnG22gUSJ0yg2Ol_vbzZtRlI","pdfSize":"18066791"}
