{"id":"2408.15482","title":"Unveiling accretion in the massive YSO G033.3891. Spatial and kinematic\n  constraints from the CO bandhead emission","authors":"E. Koumpia, D. Sun, M. Koutoulaki, J. D. Ilee, W.-J. de Wit, R. D.\n  Oudmaijer, A. J. Frost","authorsParsed":[["Koumpia","E.",""],["Sun","D.",""],["Koutoulaki","M.",""],["Ilee","J. D.",""],["de Wit","W. -J.",""],["Oudmaijer","R. D.",""],["Frost","A. J.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 02:08:50 GMT"}],"updateDate":"2024-08-29","timestamp":1724810930000,"abstract":"  The inner parts of the hot discs surrounding massive young stellar objects\n(MYSOs) are still barely explored due to observational limitations in terms of\nangular resolution, scarcity of diagnostic lines and the embedded and rare\nnature of these targets. We present the first K-band spectro-interferometric\nobservations toward the MYSO G033.3891, which based on former kinematic\nevidence via the CO bandhead emission is known to host an accreting disc. Using\nthe high spectral resolution mode (R$\\sim$4000) of the GRAVITY/VLTI, we\nspatially resolve the emission of the inner dusty disc and the crucial gaseous\ninterface between the star and the dusty disc. Using detailed modelling on the\nK-band dust continuum and tracers known to be associated with the ionised and\nmolecular gaseous interface (Br$\\gamma$, CO), we report on the smallest scales\nof accretion/ejection. The new observations in combination with our geometric\nand kinematic models employed to fit former high spectral resolution\nobservations on the source (R$\\sim$30,000; CRIRES/VLTI) allow us to constrain\nthe size of the inner gaseous disc both spatially and kinematically via the CO\novertone emission at only 2 au. Our models reveal that both Br$\\gamma$ and CO\nemissions are located well within the dust sublimation radius (5~au) as traced\nby the hot 2.2~$\\mu$m dust continuum. Our paper provides the first case study\nwhere the tiniest scales of gaseous accretion around the MYSO G033.3891 are\nprobed both kinematically and spatially via the CO bandhead emission. This\nanalysis of G033.3891 stands as only the second instance of such investigation\nwithin MYSOs, underscoring the gradual accumulation of knowledge regarding how\nmassive young stars gain their mass, while further solidifying the disc nature\nof accretion at the smallest scales of MYSOs.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}