{"id":"2408.15835","title":"Neural density functional theory of liquid-gas phase coexistence","authors":"Florian Samm\\\"uller and Matthias Schmidt and Robert Evans","authorsParsed":[["Sammüller","Florian",""],["Schmidt","Matthias",""],["Evans","Robert",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 14:48:35 GMT"}],"updateDate":"2024-08-29","timestamp":1724856515000,"abstract":"  We use supervised machine learning together with the concepts of classical\ndensity functional theory to investigate the effects of interparticle\nattraction on the pair structure, thermodynamics, bulk liquid-gas coexistence,\nand associated interfacial phenomena in many-body systems. Local learning of\nthe one-body direct correlation functional is based on Monte Carlo simulations\nof inhomogeneous systems with randomized thermodynamic conditions, randomized\nplanar shapes of the external potential, and randomized box sizes. Focusing on\nthe prototypical Lennard-Jones system, we test predictions of the resulting\nneural attractive density functional across a broad spectrum of physical\nbehaviour associated with liquid-gas phase coexistence in bulk and at\ninterfaces. We analyse the bulk radial distribution function $g(r)$ obtained\nfrom automatic differentiation and the Ornstein-Zernike route and determine i)\nthe Fisher-Widom line, i.e.\\ the crossover of the asymptotic (large distance)\ndecay of $g(r)$ from monotonic to oscillatory, ii) the (Widom) line of maximal\ncorrelation length, iii) the line of maximal isothermal compressibility and iv)\nthe spinodal by calculating the poles of the structure factor in the complex\nplane. The bulk binodal and the density profile of the free liquid-gas\ninterface are obtained from density functional minimization and the\ncorresponding surface tension from functional line integration. We also show\nthat the neural functional describes accurately the phenomena of drying at a\nhard wall and of capillary evaporation for a liquid confined in a slit pore.\nOur neural framework yields results that improve significantly upon standard\nmean-field treatments of interparticle attraction. Comparison with independent\nsimulation results demonstrates a consistent picture of phase separation even\nwhen restricting the training to supercritical states only.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}