{"id":"2408.07779","title":"A New Framework for Error Analysis in Computational Paleographic Dating\n  of Greek Papyri","authors":"Giuseppe De Gregorio, Lavinia Ferretti, Rodrigo C. G. Pena, Isabelle\n  Marthot-Santaniello, Maria Konstantinidou, John Pavlopoulos","authorsParsed":[["De Gregorio","Giuseppe",""],["Ferretti","Lavinia",""],["Pena","Rodrigo C. G.",""],["Marthot-Santaniello","Isabelle",""],["Konstantinidou","Maria",""],["Pavlopoulos","John",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 19:15:32 GMT"}],"updateDate":"2024-08-16","timestamp":1723662932000,"abstract":"  The study of Greek papyri from ancient Egypt is fundamental for understanding\nGraeco-Roman Antiquity, offering insights into various aspects of ancient\nculture and textual production. Palaeography, traditionally used for dating\nthese manuscripts, relies on identifying chronologically relevant features in\nhandwriting styles yet lacks a unified methodology, resulting in subjective\ninterpretations and inconsistencies among experts. Recent advances in digital\npalaeography, which leverage artificial intelligence (AI) algorithms, have\nintroduced new avenues for dating ancient documents. This paper presents a\ncomparative analysis between an AI-based computational dating model and human\nexpert palaeographers, using a novel dataset named Hell-Date comprising\nsecurely fine-grained dated Greek papyri from the Hellenistic period. The\nmethodology involves training a convolutional neural network on visual inputs\nfrom Hell-Date to predict precise dates of papyri. In addition, experts provide\npalaeographic dating for comparison. To compare, we developed a new framework\nfor error analysis that reflects the inherent imprecision of the palaeographic\ndating method. The results indicate that the computational model achieves\nperformance comparable to that of human experts. These elements will help\nassess on a more solid basis future developments of computational algorithms to\ndate Greek papyri.\n","subjects":["Computing Research Repository/Digital Libraries"],"license":"http://creativecommons.org/licenses/by/4.0/"}