{"id":"2408.03335","title":"Explainable AI-based Intrusion Detection System for Industry 5.0: An\n  Overview of the Literature, associated Challenges, the existing Solutions,\n  and Potential Research Directions","authors":"Naseem Khan, Kashif Ahmad, Aref Al Tamimi, Mohammed M. Alani, Amine\n  Bermak, Issa Khalil","authorsParsed":[["Khan","Naseem",""],["Ahmad","Kashif",""],["Tamimi","Aref Al",""],["Alani","Mohammed M.",""],["Bermak","Amine",""],["Khalil","Issa",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 09:28:05 GMT"}],"updateDate":"2024-08-08","timestamp":1721554085000,"abstract":"  Industry 5.0, which focuses on human and Artificial Intelligence (AI)\ncollaboration for performing different tasks in manufacturing, involves a\nhigher number of robots, Internet of Things (IoTs) devices and\ninterconnections, Augmented/Virtual Reality (AR), and other smart devices. The\nhuge involvement of these devices and interconnection in various critical\nareas, such as economy, health, education and defense systems, poses several\ntypes of potential security flaws. AI itself has been proven a very effective\nand powerful tool in different areas of cybersecurity, such as intrusion\ndetection, malware detection, and phishing detection, among others. Just as in\nmany application areas, cybersecurity professionals were reluctant to accept\nblack-box ML solutions for cybersecurity applications. This reluctance pushed\nforward the adoption of eXplainable Artificial Intelligence (XAI) as a tool\nthat helps explain how decisions are made in ML-based systems. In this survey,\nwe present a comprehensive study of different XAI-based intrusion detection\nsystems for industry 5.0, and we also examine the impact of explainability and\ninterpretability on Cybersecurity practices through the lens of Adversarial\nXIDS (Adv-XIDS) approaches. Furthermore, we analyze the possible opportunities\nand challenges in XAI cybersecurity systems for industry 5.0 that elicit future\nresearch toward XAI-based solutions to be adopted by high-stakes industry 5.0\napplications. We believe this rigorous analysis will establish a foundational\nframework for subsequent research endeavors within the specified domain.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}