{"id":"2408.14425","title":"Radiance Cascades: A Novel High-Resolution Formal Solution for\n  Multidimensional Non-LTE Radiative Transfer","authors":"Christopher M. J. Osborne and Alexander Sannikov","authorsParsed":[["Osborne","Christopher M. J.",""],["Sannikov","Alexander",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 17:13:43 GMT"}],"updateDate":"2024-08-27","timestamp":1724692423000,"abstract":"  Non-LTE radiative transfer is a key tool for modern astrophysics: it is the\nmeans by which many key synthetic observables are produced, thus connecting\nsimulations and observations. Radiative transfer models also inform our\nunderstanding of the primary formation layers and parameters of different\nspectral lines, and serve as the basis of inversion tools used to infer the\nstructure of the solar atmosphere from observations. The default approach for\ncomputing the radiation field in multidimensional solar radiative transfer\nmodels has long remained the same: a short characteristics, discrete ordinates\nmethod, formal solver. In situations with complex atmospheric structure and\nmultiple transitions between optically-thick and -thin regimes these solvers\nrequire prohibitively high angular resolution to correctly resolve the\nradiation field. Here, we present the theory of radiance cascades, a technique\ndesigned to exploit structure inherent to the radiation field, allowing for\nefficient reuse of calculated samples, thus providing a very high-resolution\nresult at a fraction of the computational cost of existing methods. We\nadditionally describe our implementation of this method in the DexRT code, and\npresent initial results of the synthesis of a snapshot of a magnetohydrodynamic\nmodel of a solar prominence formed via levitation-condensation. The approach\npresented here provides a credible route for routinely performing\nmultidimensional radiative transfer calculations free from so-called ray\neffects, and scaling high-quality non-LTE models to next-generation\nhigh-performance computing systems with GPU accelerators.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}