{"id":"2408.13293","title":"Causally-Aware Spatio-Temporal Multi-Graph Convolution Network for\n  Accurate and Reliable Traffic Prediction","authors":"Pingping Dong, Xiao-Lin Wang, Indranil Bose, Kam K.H. Ng, Xiaoning\n  Zhang, Xiaoge Zhang","authorsParsed":[["Dong","Pingping",""],["Wang","Xiao-Lin",""],["Bose","Indranil",""],["Ng","Kam K. H.",""],["Zhang","Xiaoning",""],["Zhang","Xiaoge",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 14:35:54 GMT"}],"updateDate":"2024-08-27","timestamp":1724423754000,"abstract":"  Accurate and reliable prediction has profound implications to a wide range of\napplications. In this study, we focus on an instance of spatio-temporal\nlearning problem--traffic prediction--to demonstrate an advanced deep learning\nmodel developed for making accurate and reliable forecast. Despite the\nsignificant progress in traffic prediction, limited studies have incorporated\nboth explicit and implicit traffic patterns simultaneously to improve\nprediction performance. Meanwhile, the variability nature of traffic states\nnecessitates quantifying the uncertainty of model predictions in a\nstatistically principled way; however, extant studies offer no provable\nguarantee on the statistical validity of confidence intervals in reflecting its\nactual likelihood of containing the ground truth. In this paper, we propose an\nend-to-end traffic prediction framework that leverages three primary components\nto generate accurate and reliable traffic predictions: dynamic causal structure\nlearning for discovering implicit traffic patterns from massive traffic data,\ncausally-aware spatio-temporal multi-graph convolution network (CASTMGCN) for\nlearning spatio-temporal dependencies, and conformal prediction for uncertainty\nquantification. CASTMGCN fuses several graphs that characterize different\nimportant aspects of traffic networks and an auxiliary graph that captures the\neffect of exogenous factors on the road network. On this basis, a conformal\nprediction approach tailored to spatio-temporal data is further developed for\nquantifying the uncertainty in node-wise traffic predictions over varying\nprediction horizons. Experimental results on two real-world traffic datasets\ndemonstrate that the proposed method outperforms several state-of-the-art\nmodels in prediction accuracy; moreover, it generates more efficient prediction\nregions than other methods while strictly satisfying the statistical validity\nin coverage.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}