{"id":"2408.11302","title":"Modeling Reference-dependent Choices with Graph Neural Networks","authors":"Liang Zhang, Guannan Liu, Junjie Wu, Yong Tan","authorsParsed":[["Zhang","Liang",""],["Liu","Guannan",""],["Wu","Junjie",""],["Tan","Yong",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 03:14:25 GMT"}],"updateDate":"2024-08-22","timestamp":1724210065000,"abstract":"  While the classic Prospect Theory has highlighted the reference-dependent and\ncomparative nature of consumers' product evaluation processes, few models have\nsuccessfully integrated this theoretical hypothesis into data-driven preference\nquantification, particularly in the realm of recommender systems development.\nTo bridge this gap, we propose a new research problem of modeling\nreference-dependent preferences from a data-driven perspective, and design a\nnovel deep learning-based framework named Attributed Reference-dependent Choice\nModel for Recommendation (ArcRec) to tackle the inherent challenges associated\nwith this problem. ArcRec features in building a reference network from\naggregated historical purchase records for instantiating theoretical reference\npoints, which is then decomposed into product attribute specific sub-networks\nand represented through Graph Neural Networks. In this way, the reference\npoints of a consumer can be encoded at the attribute-level individually from\nher past experiences but also reflect the crowd influences. ArcRec also makes\nnovel contributions to quantifying consumers' reference-dependent preferences\nusing a deep neural network-based utility function that integrates both\ninterest-inspired and price-inspired preferences, with their complex\ninteraction effects captured by an attribute-aware price sensitivity mechanism.\nMost importantly, ArcRec introduces a novel Attribute-level Willingness-To-Pay\nmeasure to the reference-dependent utility function, which captures a\nconsumer's heterogeneous salience of product attributes via observing her\nattribute-level price tolerance to a product. Empirical evaluations on both\nsynthetic and real-world online shopping datasets demonstrate ArcRec's superior\nperformances over fourteen state-of-the-art baselines.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}