{"id":"2408.10421","title":"Itinerant A-type Antiferromagnetic Order in Co$_{0.25}$TaSe$_2$","authors":"H. Cein Mandujano, Gicela Saucedo Salas, Gicela Saucedo Salas, Peter\n  Y. Zavalij, Alicia Manj\\'on-Sanz, Nicholas P. Butch, Efrain E. Rodriguez","authorsParsed":[["Mandujano","H. Cein",""],["Salas","Gicela Saucedo",""],["Salas","Gicela Saucedo",""],["Zavalij","Peter Y.",""],["Manjón-Sanz","Alicia",""],["Butch","Nicholas P.",""],["Rodriguez","Efrain E.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 21:19:08 GMT"}],"updateDate":"2024-08-21","timestamp":1724102348000,"abstract":"  We present the magnetic behavior and resulting transport properties of\nTaSe$_2$ when intercalated by magnetically active cobalt cations. Acting as the\nlayered host, TaSe$_2$ is a transition metal dichalcogenide (TMD) that adopts\nthe 2H-polytype. We find through our single crystal and powder diffraction\nstudies that we can prepare the stoichiometry Co$_{0.25}$TaSe$_2$, which\ncrystallizes in the centrosymmetric space group $P6_3/mmc$. From magnetic\nsusceptibility and x-ray photoelectron spectroscopy measurements, we find a\ntransition consistent with antiferromagnetic order below the temperature $T_N$\n= 173 K and Co$^{2+}$ in the high-spin state. Neutron powder diffraction and\nspecific heat measurements, however, point to a much smaller than anticipated\nordered moment in this sample. From the neutron results, the magnetic structure\ncan be described as an A-type antiferromagnet with an ordered moment size of\n1.35(11) $\\mu_B$ per Co cation. The direction of the moments are all long the\nc-axis, which is consistent with the magnetization and susceptibility studies\nshowing this direction to be the easy axis. Interestingly, we find that a weak\nand subtle ferromagnetic component appears to exist along the $ab$-plane of the\nCo$_{0.25}$TaSe$_2$ crystals. We place the results of this work in the context\nof other magnetic-ion intercalated TMDs, especially those of Ta and Nb.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science","Condensed Matter/Other Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}