{"id":"2408.05465","title":"Mechanisms of de-icing by surface Rayleigh and plate Lamb acoustic waves","authors":"Shilpi Pandey, Jaime del Moral, Stefan Jacob, Laura Montes, Jorge\n  Gil-Rostra, Alejandro Frechilla, Atefeh Karimzadeh, Victor J. Rico, Raul\n  Kantar, Niklas Kandelin, Carmen Lopez Santos, Heli Koivuluoto, Luis Angurel,\n  Andreas Winkler, Ana Borras, Agustin R. Gonzalez Elipe","authorsParsed":[["Pandey","Shilpi",""],["del Moral","Jaime",""],["Jacob","Stefan",""],["Montes","Laura",""],["Gil-Rostra","Jorge",""],["Frechilla","Alejandro",""],["Karimzadeh","Atefeh",""],["Rico","Victor J.",""],["Kantar","Raul",""],["Kandelin","Niklas",""],["Santos","Carmen Lopez",""],["Koivuluoto","Heli",""],["Angurel","Luis",""],["Winkler","Andreas",""],["Borras","Ana",""],["Elipe","Agustin R. Gonzalez",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 07:26:36 GMT"}],"updateDate":"2024-08-13","timestamp":1723274796000,"abstract":"  Acoustic waves (AW) have recently emerged as an energy-efficient ice removal\nprocedure compatible with functional and industrial-relevant substrates.\nHowever, critical aspects at fundamental and experimental levels have yet to be\ndisclosed to optimize their operational conditions. Identifying the processes\nand mechanisms by which different types of AWs induce de-icing are some of\nthese issues. Herein, using model LiNbO3 systems and two types of\ninterdigitated transducers, we analyze the de-icing and anti-icing efficiencies\nand mechanisms driven by Rayleigh surface acoustic waves (R-SAW) and Lamb waves\nwith 120 and 510 um wavelengths, respectively. Through the experimental\nanalysis of de-icing and active anti-icing processes and the finite element\nsimulation of the AW generation, propagation, and interaction with small ice\naggregates, we disclose that Lamb waves are more favorable than R-SAWs to\ninduce de-icing and/or prevent the freezing of droplets. Prospects for\napplications of this study are supported by proof of concept experiments,\nincluding de-icing in an ice wind tunnel, demonstrating that Lamb waves can\nefficiently remove ice layers covering large LN substrates. Results indicate\nthat the de-icing mechanism may differ for Lamb waves or R-SAWs and that the\nwavelength must be considered as an important parameter for controlling the\nefficiency.\n","subjects":["Condensed Matter/Materials Science","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}