{"id":"2408.10825","title":"Conditional nonparametric variable screening by neural factor regression","authors":"Jianqing Fan (Princeton University), Weining Wang (University of\n  Groningen), Yue Zhao (University of York)","authorsParsed":[["Fan","Jianqing","","Princeton University"],["Wang","Weining","","University of\n  Groningen"],["Zhao","Yue","","University of York"]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 13:21:35 GMT"}],"updateDate":"2024-08-21","timestamp":1724160095000,"abstract":"  High-dimensional covariates often admit linear factor structure. To\neffectively screen correlated covariates in high-dimension, we propose a\nconditional variable screening test based on non-parametric regression using\nneural networks due to their representation power. We ask the question whether\nindividual covariates have additional contributions given the latent factors or\nmore generally a set of variables. Our test statistics are based on the\nestimated partial derivative of the regression function of the candidate\nvariable for screening and a observable proxy for the latent factors. Hence,\nour test reveals how much predictors contribute additionally to the\nnon-parametric regression after accounting for the latent factors. Our\nderivative estimator is the convolution of a deep neural network regression\nestimator and a smoothing kernel. We demonstrate that when the neural network\nsize diverges with the sample size, unlike estimating the regression function\nitself, it is necessary to smooth the partial derivative of the neural network\nestimator to recover the desired convergence rate for the derivative. Moreover,\nour screening test achieves asymptotic normality under the null after finely\ncentering our test statistics that makes the biases negligible, as well as\nconsistency for local alternatives under mild conditions. We demonstrate the\nperformance of our test in a simulation study and two real world applications.\n","subjects":["Economics/Econometrics","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vIx8V4CJq-R3dy9whe8FqJmPbpp0JUd25KWe3GsrqOE","pdfSize":"1520452"}
