{"id":"2408.06176","title":"On the KG-constrained general disformal transformation of the\n  Einstein-Hilbert action","authors":"Allan L. Alinea, Joshwa DJ. Ordonez","authorsParsed":[["Alinea","Allan L.",""],["Ordonez","Joshwa DJ.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 14:22:53 GMT"},{"version":"v2","created":"Sun, 18 Aug 2024 06:28:31 GMT"}],"updateDate":"2024-08-20","timestamp":1723472573000,"abstract":"  Although with great successes in explaining phenomena and natural behaviour\ninvolving the Universe or a part thereof, the General Theory of Relativity is\nfar from a complete theory. There are plenty of avenues to investigate its\nextensions or generalisations that, in the future, could pave the way for a\nmuch deeper understanding and possibly solutions of current problems involving\nthe Universe; e.g., dark matter, dark energy, fine-tuning, etc. Focusing on its\nextension within the framework of scalar tensor theory, we investigate the\ntransformation of the Einstein-Hilbert action under the general disformal\ntransformation coupled with set of triple KG constraints. The idea is that the\ngeneral disformal transformation leads to an extremely complicated action\nnecessitating a set of constraints to tame the resulting form. Motivated by\nprevious studies on the invertibility and invariance of the massless\nKlein-Gordon equation under the general disformal transformation, we identify\nthree constraints that significantly simplifies the transformed\nEinstein-Hilbert action. In four spacetime dimensions, we find that the\ntransformed action is a sum of the original action and a disformal contribution\ninvolving a six-term Lagrangian that includes the Ricci tensor coupled to a sum\nof derivatives of scalar fields and kinetic terms. In three spacetime\ndimensions, the disformal contribution becomes a five-term Lagrangian. Lastly,\nin two spacetime dimensions, the Einstein-Hilbert action is invariant under the\nconstrained disformal transformation.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/"}