{"id":"2408.11887","title":"The vertical velocity skewness in the atmospheric boundary layer without\n  buoyancy and Coriolis effects","authors":"Elia Buono, Gabriel Katul, Michael Heisel, Davide Poggi, Cosimo\n  Peruzzi, Davide Vettori and Costantino Manes","authorsParsed":[["Buono","Elia",""],["Katul","Gabriel",""],["Heisel","Michael",""],["Poggi","Davide",""],["Peruzzi","Cosimo",""],["Vettori","Davide",""],["Manes","Costantino",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 17:23:45 GMT"}],"updateDate":"2024-08-23","timestamp":1724261025000,"abstract":"  One of the main statistical features of near-neutral atmospheric boundary\nlayer (ABL) turbulence is the positive vertical velocity skewness $Sk_w$ above\nthe roughness sublayer or the buffer region in smooth-walls. The $Sk_w$\nvariations are receiving renewed interest in many climate-related\nparameterizations of the ABL given their significance to cloud formation and to\ntesting sub-grid schemes for Large Eddy Simulations (LES). The vertical\nvariations of $Sk_w$ are explored here using high Reynolds number wind tunnel\nand flume experiments collected above smooth, rough, and permeable-walls in the\nabsence of buoyancy and Coriolis effects. These laboratory experiments form a\nnecessary starting point to probe the canonical structure of $Sk_w$ as they\ndeal with a key limiting case (i.e. near-neutral conditions) that has received\nmuch less attention compared to its convective counterpart in atmospheric\nturbulence studies. Diagnostic models based on cumulant expansions,\nrealizability constraints, and the now-popular constant mass flux approach\nroutinely employed in the convective boundary layer as well as prognostic\nmodels based on third-order budgets are used to explain variations in $Sk_w$\nfor the idealized laboratory conditions. The failure of flux-gradient relations\nto model $Sk_w$ from the gradients of the vertical velocity variance\n$\\sigma_w^2$ are explained and corrections based on models of energy transport\noffered. Novel links between the diagnostic and prognostic models are also\nfeatured, especially for the inertial term in the third order budget of the\nvertical velocity fluctuation. The co-spectral properties of $w'/\\sigma_w$\nversus $w'^2/\\sigma_w^2$ are also presented for the first time to assess the\ndominant scales governing $Sk_w$ in the inner and outer layers, where $w'$ is\nthe fluctuating vertical velocity and $\\sigma_w$ is the vertical velocity\nstandard deviation.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}