{"id":"2408.14198","title":"Combined assessment of auditory distance perception and externalization","authors":"Henning Hoppe, Steven van de Par, Virginia Flanagin and Stephan D.\n  Ewert","authorsParsed":[["Hoppe","Henning",""],["van de Par","Steven",""],["Flanagin","Virginia",""],["Ewert","Stephan D.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 11:53:56 GMT"}],"updateDate":"2024-08-27","timestamp":1724673236000,"abstract":"  This study investigates frontal auditory distance perception (ADP) and\nexternalization in virtual audio-visual environments, considering effects of\nheadphone rendering method, room size, reverberation, and visual representation\nof the room. Either head-related impulse responses from an artificial head or a\nspherical head model were used for diotic (monophonic) and binaural\nauralizations with and without real-time head tracking. The visuals were\npresented through a head-mounted display. Two differently sized rooms as well\nas an infinitely extending space (echoic and anechoic) were used in which an\ninvisible frontal virtual sound source was located. Additionally, the effect of\na freely movable loudspeaker for visually indicating perceived distances was\ninvestigated. Both ADP and externalization were significantly affected by room\nsize, but otherwise the two perceptual quantities differed in their outcomes.\nRoom visibility significantly affected ADP, leading to considerable\noverestimations and more variability in the absence of a visual environment,\nalthough externalization was not affected. The movable loudspeaker improved\ndistance estimation significantly, however, did not affect externalization. For\nreverberation, a (non-significant) trend of improved ADP was observed, however,\nexternalization was significantly improved. Different headphone renderings did\nnot significantly affect ADP or externalization, although a clear trend was\nobserved for externalization.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Sound"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}