{"id":"2408.13428","title":"Non-Markovian Reduced Models to Unravel Transitions in Non-equilibrium\n  Systems","authors":"Micka\\\"el D. Chekroun, Honghu Liu, James C. McWilliams","authorsParsed":[["Chekroun","Mickaël D.",""],["Liu","Honghu",""],["McWilliams","James C.",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 01:43:40 GMT"}],"updateDate":"2024-08-27","timestamp":1724463820000,"abstract":"  This work proposes a general framework for capturing noise-driven transitions\nin spatially extended non-equilibrium systems and explains the emergence of\ncoherent patterns beyond the instability onset. The framework relies on\nstochastic parameterizations to reduce the original equations' complexity while\ncapturing the key effects of unresolved scales. It works for both Gaussian and\nLevy-type noise. Our parameterizations offer two key advantages. First, they\napproximate stochastic invariant manifolds when the latter exist. Second, even\nwhen such manifolds break down, our formulas can be adapted by a simple\noptimization of its constitutive parameters. This allows us to handle scenarios\nwith weak time-scale separation where the system has undergone multiple\ntransitions, resulting in large-amplitude solutions not captured by invariant\nmanifold or other time-scale separation methods. The optimized stochastic\nparameterizations capture how small-scale noise impacts larger scales through\nthe system's nonlinear interactions. This effect is achieved by the very fabric\nof our parameterizations incorporating non-Markovian coefficients into the\nreduced equation. Such coefficients account for the noise's past influence\nusing a finite memory length, selected for optimal performance. The specific\n\"memory\" function, which determines how this past influence is weighted,\ndepends on the noise's strength and how it interacts with the system's\nnonlinearities. Remarkably, training our theory-guided reduced models on a\nsingle noise path effectively learns the optimal memory length for\nout-of-sample predictions, including rare events. This success stems from our\n\"hybrid\" approach, which combines analytical understanding with data-driven\nlearning. This combination avoids a key limitation of purely data-driven\nmethods: their struggle to generalize to unseen scenarios, also known as the\n\"extrapolation problem.\"\n","subjects":["Mathematics/Dynamical Systems","Mathematics/Probability","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}