{"id":"2408.04943","title":"CBCT scatter correction with dual-layer flat-panel detector","authors":"Xin Zhang, Jixiong Xie, Ting Su, Jiongtao Zhu, Han Cui, Yuhang Tan,\n  Dongmei Xia, Hairong Zheng, Dong Liang and Yongshuai Ge","authorsParsed":[["Zhang","Xin",""],["Xie","Jixiong",""],["Su","Ting",""],["Zhu","Jiongtao",""],["Cui","Han",""],["Tan","Yuhang",""],["Xia","Dongmei",""],["Zheng","Hairong",""],["Liang","Dong",""],["Ge","Yongshuai",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 08:49:28 GMT"}],"updateDate":"2024-08-12","timestamp":1723193368000,"abstract":"  Background: Recently, the popularity of dual-layer flat-panel detector\n(DL-FPD) based dual-energy cone-beam CT (DE-CBCT) imaging has been increasing.\nHowever, the image quality of DE-CBCT remains constrained by the Compton\nscattered X-ray photons.\n  Purpose: The objective of this study is to develop an energy-modulated\nscatter correction method for DL-FPD based CBCT imaging.\n  Methods: The DLFPD can measure primary and Compton scattered X-ray photons\nhaving dfferent energies: X-ray photons with lower energies are predominantly\ncaptured by the top detector layer, while X-ray photons with higher energies\nare primarily collected by the bottom detector layer. Afterwards, the scattered\nX-ray signals acquired on both detector layers can be analytically retrieved\nvia a simple model along with several pre-calibrated parameters. Both Monte\nCarlo simulations and phantom experiments are performed to verify this\nenergy-modulated scatter correction method utilizing DL-FPD.\n  Results: Results demonstrate that the proposed energy-modulated scatter\ncorrection method can signficantly reduce the shading artifacts of both\nlow-energy and high-energy CBCT images acquired from DL-FPD. On average, the\nimage non-uniformity is reduce by over 77% in the low-energy CBCT image and by\nover 66% in the high-energy CBCT image. Moreover, the accuracy of the\ndecomposed multi-material results is also substantially improved.\n  Conclusion: In the future, Compton scattered X-ray signals can be easily\ncorrected for CBCT systems using DL-FPDs.\n","subjects":["Physics/Medical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}