{"id":"2408.01388","title":"CXOU J005245.0-722844: Discovery of a Be Star / White Dwarf binary\n  system in the SMC via a very fast, super-Eddington X-ray outburst event","authors":"Thomas M. Gaudin, Malcolm J. Coe, Jamie A. Kennea, Itumaleng M.\n  Monageng, David A. H. Buckley, Andrzej Udalski, Phil A. Evans","authorsParsed":[["Gaudin","Thomas M.",""],["Coe","Malcolm J.",""],["Kennea","Jamie A.",""],["Monageng","Itumaleng M.",""],["Buckley","David A. H.",""],["Udalski","Andrzej",""],["Evans","Phil A.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 16:58:43 GMT"}],"updateDate":"2024-08-05","timestamp":1722617923000,"abstract":"  CXOU J005245.0-722844 is an X-ray source in the Small Magellanic Cloud (SMC)\nthat has long been known as a Be/X-ray binary (BeXRB) star, containing an OBe\nmain sequence star and a compact object. In this paper, we report on a new very\nfast X-ray outburst from CXOU J005245.0-722844. X-ray observations taken by\nSwift constrain the duration of the outburst to less than 16 days and find that\nthe source reached super-Eddington X-ray luminosities during the initial phases\nof the eruption. The XRT spectrum of CXOU J005245.0-722844 during this outburst\nreveals a super-soft X-ray source, best fit by an absorbed thermal blackbody\nmodel. Optical and Ultraviolet follow-up observations from the Optical\nGravitational Lensing Experiment (OGLE), Asteroid Terrestrial-impact Last Alert\nSystem (ATLAS), and Swift identify a brief ~0.5 magnitude optical burst\ncoincident with the X-ray outburst that lasted for less than 7 days. Optical\nphotometry additionally identifies the orbital period of the system to be 17.55\ndays and identifies a shortening of the period to 17.14 days in the years\nleading up to the outburst. Optical spectroscopy from the Southern African\nLarge Telescope (SALT) confirms that the optical companion is an early-type OBe\nstar. We conclude from our observations that the compact object in this system\nis a white dwarf (WD), making this the seventh candidate Be/WD X-ray binary.\nThe X-ray outburst is found to be the result of a very-fast, ultra-luminous\nnova similar to the outburst of MAXI J0158-744.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"06lMpqLAh-TQO2_ayJIjhKhqUe7b0Haiknyq202AAB8","pdfSize":"2745597","txDigest":"pC7ppq4hPXWEwdDuuK8JzHd6BTkeKguEwCEawDWZ4Qi","endEpoch":"1","status":"CERTIFIED"}
