{"id":"2408.03379","title":"COOL-LAMPS VIII: Known wide-separation lensed quasars and their host\n  galaxies reveal a lack of evolution in $M_{\\rm{BH}}/M_\\star$ since $z\\sim 3$","authors":"Aidan P. Cloonan, Gourav Khullar, Kate A. Napier, Michael D. Gladders,\n  H{\\aa}kon Dahle, Riley Rosener, Jamar Sullivan Jr., Matthew B. Bayliss,\n  Nathalie Chicoine, Isaiah Escapa, Diego Garza, Josh Garza, Rowen Glusman,\n  Katya Gozman, Gabriela Horwath, Andi Kisare, Benjamin C. Levine, Olina Liang,\n  Natalie Malagon, Michael N. Martinez, Alexandra Masegian, Owen S. Matthews\n  Acu\\~na, Simon D. Mork, Kunwanhui Niu, M. Riley Owens, Yue Pan, Jane R.\n  Rigby, Keren Sharon, Isaac Sierra, Antony A. Stark, Ezra Sukay, Marcos\n  Tamargo-Arizmendi, Kiyan Tavangar, Raul Teixeira, Kabelo Tsiane, Grace\n  Wagner, Erik A. Zaborowski, Yunchong Zhang, and Megan Zhao","authorsParsed":[["Cloonan","Aidan P.",""],["Khullar","Gourav",""],["Napier","Kate A.",""],["Gladders","Michael D.",""],["Dahle","Håkon",""],["Rosener","Riley",""],["Sullivan","Jamar","Jr."],["Bayliss","Matthew B.",""],["Chicoine","Nathalie",""],["Escapa","Isaiah",""],["Garza","Diego",""],["Garza","Josh",""],["Glusman","Rowen",""],["Gozman","Katya",""],["Horwath","Gabriela",""],["Kisare","Andi",""],["Levine","Benjamin C.",""],["Liang","Olina",""],["Malagon","Natalie",""],["Martinez","Michael N.",""],["Masegian","Alexandra",""],["Acuña","Owen S. Matthews",""],["Mork","Simon D.",""],["Niu","Kunwanhui",""],["Owens","M. Riley",""],["Pan","Yue",""],["Rigby","Jane R.",""],["Sharon","Keren",""],["Sierra","Isaac",""],["Stark","Antony A.",""],["Sukay","Ezra",""],["Tamargo-Arizmendi","Marcos",""],["Tavangar","Kiyan",""],["Teixeira","Raul",""],["Tsiane","Kabelo",""],["Wagner","Grace",""],["Zaborowski","Erik A.",""],["Zhang","Yunchong",""],["Zhao","Megan",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 18:02:16 GMT"}],"updateDate":"2024-08-08","timestamp":1722967336000,"abstract":"  Wide-separation lensed quasars (WSLQs) are a rare class of strongly lensed\nquasars, magnified by foreground massive galaxy clusters, with typically large\nmagnifications of the multiple quasar images. They are a relatively unexplored\nopportunity for detailed study of quasar host galaxies. The current small\nsample of known WSLQs has a median redshift of $z\\approx 2.1$, larger than most\nother samples of quasar host galaxies studied to date. Here, we derive precise\nconstraints on the properties of six WSLQs and their host galaxies, using\nparametric surface brightness fitting, measurements of quasar emission lines,\nand stellar population synthesis of host galaxies in six WSLQ systems. Our\nresults, with significant uncertainty, indicate that these six hosts are a\nmixture of star-forming and quiescent galaxies. To probe for co-evolution\nbetween AGNs and host galaxies, we model the offset from the `local' ($z=0$)\n$M_{\\rm{BH}}\\unicode{x2013}M_\\star$ relation as a simple power-law in redshift.\nAccounting for selection effects, a WSLQ-based model for evolution in the\n$M_{\\rm{BH}}\\unicode{x2013}M_\\star$ relation has a power-law index of\n$\\gamma_M=-0.42\\pm0.31$, consistent with no evolution. Compared to several\nliterature samples, which mostly probe unlensed quasars at $z<2$, the WSLQ\nsample shows less evolution from the local relation, at $\\sim 4\\sigma$. We find\nthat selection affects and choices of $M_{\\rm{BH}}$ calibration are the most\nimportant systematics in these comparisons. Given that we resolve host galaxy\nflux confidently even from the ground in some instances, our work demonstrates\nthat WSLQs and highly magnified AGNs are exceptional systems for future\nAGN$\\unicode{x2013}$host co-evolution studies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}