{"id":"2408.13058","title":"Constructing Tight Quadratic Relaxations for Global Optimization: II.\n  Underestimating Difference-of-Convex (D.C.) Functions","authors":"William R. Strahl, Arvind U. Raghunathan, Nikolaos V. Sahinidis,\n  Chrysanthos E. Gounaris","authorsParsed":[["Strahl","William R.",""],["Raghunathan","Arvind U.",""],["Sahinidis","Nikolaos V.",""],["Gounaris","Chrysanthos E.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 13:32:50 GMT"}],"updateDate":"2024-08-26","timestamp":1724419970000,"abstract":"  Recent advances in the efficiency and robustness of algorithms solving convex\nquadratically constrained quadratic programming (QCQP) problems motivate\ndeveloping techniques for creating convex quadratic relaxations that, although\nmore expensive to compute, provide tighter bounds than their classical linear\ncounterparts. In the first part of this two-paper series [Strahl et al., 2024],\nwe developed a cutting plane algorithm to construct convex quadratic\nunderestimators for twice-differentiable convex functions, which we extend here\nto address the case of non-convex difference-of-convex (d.c.) functions as\nwell. Furthermore, we generalize our approach to consider a hierarchy of\nquadratic forms, thereby allowing the construction of even tighter\nunderestimators. On a set of d.c. functions extracted from benchmark libraries,\nwe demonstrate noteworthy reduction in the hypervolume between our quadratic\nunderestimators and linear ones constructed at the same points. Additionally,\nwe construct convex QCQP relaxations at the root node of a spatial\nbranch-and-bound tree for a set of systematically created d.c. optimization\nproblems in up to four dimensions, and we show that our relaxations reduce the\ngap between the lower bound computed by the state-of-the-art global\noptimization solver BARON and the optimal solution by an excess of 90%, on\naverage.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}