{"id":"2408.13735","title":"MSVM-UNet: Multi-Scale Vision Mamba UNet for Medical Image Segmentation","authors":"Chaowei Chen, Li Yu, Shiquan Min, Shunfang Wang","authorsParsed":[["Chen","Chaowei",""],["Yu","Li",""],["Min","Shiquan",""],["Wang","Shunfang",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 06:20:28 GMT"}],"updateDate":"2024-08-27","timestamp":1724566828000,"abstract":"  State Space Models (SSMs), especially Mamba, have shown great promise in\nmedical image segmentation due to their ability to model long-range\ndependencies with linear computational complexity. However, accurate medical\nimage segmentation requires the effective learning of both multi-scale detailed\nfeature representations and global contextual dependencies. Although existing\nworks have attempted to address this issue by integrating CNNs and SSMs to\nleverage their respective strengths, they have not designed specialized modules\nto effectively capture multi-scale feature representations, nor have they\nadequately addressed the directional sensitivity problem when applying Mamba to\n2D image data. To overcome these limitations, we propose a Multi-Scale Vision\nMamba UNet model for medical image segmentation, termed MSVM-UNet.\nSpecifically, by introducing multi-scale convolutions in the VSS blocks, we can\nmore effectively capture and aggregate multi-scale feature representations from\nthe hierarchical features of the VMamba encoder and better handle 2D visual\ndata. Additionally, the large kernel patch expanding (LKPE) layers achieve more\nefficient upsampling of feature maps by simultaneously integrating spatial and\nchannel information. Extensive experiments on the Synapse and ACDC datasets\ndemonstrate that our approach is more effective than some state-of-the-art\nmethods in capturing and aggregating multi-scale feature representations and\nmodeling long-range dependencies between pixels.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}