{"id":"2408.11463","title":"Low-Light Object Tracking: A Benchmark","authors":"Pengzhi Zhong, Xiaoyu Guo, Defeng Huang, Xiaojun Peng, Yian Li, Qijun\n  Zhao, and Shuiwang Li","authorsParsed":[["Zhong","Pengzhi",""],["Guo","Xiaoyu",""],["Huang","Defeng",""],["Peng","Xiaojun",""],["Li","Yian",""],["Zhao","Qijun",""],["Li","Shuiwang",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 09:27:57 GMT"}],"updateDate":"2024-08-22","timestamp":1724232477000,"abstract":"  In recent years, the field of visual tracking has made significant progress\nwith the application of large-scale training datasets. These datasets have\nsupported the development of sophisticated algorithms, enhancing the accuracy\nand stability of visual object tracking. However, most research has primarily\nfocused on favorable illumination circumstances, neglecting the challenges of\ntracking in low-ligh environments. In low-light scenes, lighting may change\ndramatically, targets may lack distinct texture features, and in some\nscenarios, targets may not be directly observable. These factors can lead to a\nsevere decline in tracking performance. To address this issue, we introduce\nLLOT, a benchmark specifically designed for Low-Light Object Tracking. LLOT\ncomprises 269 challenging sequences with a total of over 132K frames, each\ncarefully annotated with bounding boxes. This specially designed dataset aims\nto promote innovation and advancement in object tracking techniques for\nlow-light conditions, addressing challenges not adequately covered by existing\nbenchmarks. To assess the performance of existing methods on LLOT, we conducted\nextensive tests on 39 state-of-the-art tracking algorithms. The results\nhighlight a considerable gap in low-light tracking performance. In response, we\npropose H-DCPT, a novel tracker that incorporates historical and darkness clue\nprompts to set a stronger baseline. H-DCPT outperformed all 39 evaluated\nmethods in our experiments, demonstrating significant improvements. We hope\nthat our benchmark and H-DCPT will stimulate the development of novel and\naccurate methods for tracking objects in low-light conditions. The LLOT and\ncode are available at https://github.com/OpenCodeGithub/H-DCPT.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}