{"id":"2408.12265","title":"Classifying Entanglement by Algebraic Geometry","authors":"Masoud Gharahi","authorsParsed":[["Gharahi","Masoud",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 10:03:22 GMT"}],"updateDate":"2024-08-23","timestamp":1724321002000,"abstract":"  Quantum Entanglement is one of the key manifestations of quantum mechanics\nthat separate the quantum realm from the classical one. Characterization of\nentanglement as a physical resource for quantum technology became of uppermost\nimportance. While the entanglement of bipartite systems is already well\nunderstood, the ultimate goal to cope with the properties of entanglement of\nmultipartite systems is still far from being realized. This dissertation covers\ncharacterization of multipartite entanglement using algebraic-geometric tools.\nFirstly, we establish an algorithm to classify multipartite entanglement by\n$k$-secant varieties of the Segre variety and $\\ell$-multilinear ranks that are\ninvariant under Stochastic Local Operations with Classical Communication\n(SLOCC). We present a fine-structure classification of multiqubit and\ntripartite entanglement based on this algorithm. Another fundamental problem in\nquantum information theory is entanglement transformation that is quite\nchallenging regarding to multipartite systems. It is captivating that the\nproposed entanglement classification by algebraic geometry can be considered as\na reference to study SLOCC and asymptotic SLOCC interconversions among\ndifferent resources based on tensor rank and border rank, respectively. In this\nregard, we also introduce a new class of tensors that we call \\emph{persistent\ntensors} and construct a lower bound for their tensor rank. We further cover\nSLOCC convertibility of multipartite systems considering several families of\npersistent tensors.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Computational Complexity","Physics/Mathematical Physics","Mathematics/Algebraic Geometry","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"vRFQMndrIQGETlJHTzAqG6FmHmoPy5NoNPY6uSK2VCs","pdfSize":"4556210"}
