{"id":"2408.16634","title":"RLCP: A Reinforcement Learning-based Copyright Protection Method for\n  Text-to-Image Diffusion Model","authors":"Zhuan Shi, Jing Yan, Xiaoli Tang, Lingjuan Lyu, Boi Faltings","authorsParsed":[["Shi","Zhuan",""],["Yan","Jing",""],["Tang","Xiaoli",""],["Lyu","Lingjuan",""],["Faltings","Boi",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 15:39:33 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 12:15:16 GMT"}],"updateDate":"2024-09-04","timestamp":1724945973000,"abstract":"  The increasing sophistication of text-to-image generative models has led to\ncomplex challenges in defining and enforcing copyright infringement criteria\nand protection. Existing methods, such as watermarking and dataset\ndeduplication, fail to provide comprehensive solutions due to the lack of\nstandardized metrics and the inherent complexity of addressing copyright\ninfringement in diffusion models. To deal with these challenges, we propose a\nReinforcement Learning-based Copyright Protection(RLCP) method for\nText-to-Image Diffusion Model, which minimizes the generation of\ncopyright-infringing content while maintaining the quality of the\nmodel-generated dataset. Our approach begins with the introduction of a novel\ncopyright metric grounded in copyright law and court precedents on\ninfringement. We then utilize the Denoising Diffusion Policy Optimization\n(DDPO) framework to guide the model through a multi-step decision-making\nprocess, optimizing it using a reward function that incorporates our proposed\ncopyright metric. Additionally, we employ KL divergence as a regularization\nterm to mitigate some failure modes and stabilize RL fine-tuning. Experiments\nconducted on 3 mixed datasets of copyright and non-copyright images demonstrate\nthat our approach significantly reduces copyright infringement risk while\nmaintaining image quality.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}