{"id":"2408.04967","title":"ADD 2023: Towards Audio Deepfake Detection and Analysis in the Wild","authors":"Jiangyan Yi, Chu Yuan Zhang, Jianhua Tao, Chenglong Wang, Xinrui Yan,\n  Yong Ren, Hao Gu, Junzuo Zhou","authorsParsed":[["Yi","Jiangyan",""],["Zhang","Chu Yuan",""],["Tao","Jianhua",""],["Wang","Chenglong",""],["Yan","Xinrui",""],["Ren","Yong",""],["Gu","Hao",""],["Zhou","Junzuo",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 09:32:37 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 11:44:14 GMT"}],"updateDate":"2024-09-13","timestamp":1723195957000,"abstract":"  The growing prominence of the field of audio deepfake detection is driven by\nits wide range of applications, notably in protecting the public from potential\nfraud and other malicious activities, prompting the need for greater attention\nand research in this area. The ADD 2023 challenge goes beyond binary real/fake\nclassification by emulating real-world scenarios, such as the identification of\nmanipulated intervals in partially fake audio and determining the source\nresponsible for generating any fake audio, both with real-life implications,\nnotably in audio forensics, law enforcement, and construction of reliable and\ntrustworthy evidence. To further foster research in this area, in this article,\nwe describe the dataset that was used in the fake game, manipulation region\nlocation and deepfake algorithm recognition tracks of the challenge. We also\nfocus on the analysis of the technical methodologies by the top-performing\nparticipants in each task and note the commonalities and differences in their\napproaches. Finally, we discuss the current technical limitations as identified\nthrough the technical analysis, and provide a roadmap for future research\ndirections. The dataset is available for download at\nhttp://addchallenge.cn/downloadADD2023.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Sound"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}