{"id":"2408.14904","title":"Long-lived entanglement of molecules in magic-wavelength optical\n  tweezers","authors":"Daniel K. Ruttley, Tom R. Hepworth, Alexander Guttridge, Simon L.\n  Cornish","authorsParsed":[["Ruttley","Daniel K.",""],["Hepworth","Tom R.",""],["Guttridge","Alexander",""],["Cornish","Simon L.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 09:28:56 GMT"}],"updateDate":"2024-08-28","timestamp":1724750936000,"abstract":"  Realising quantum control and entanglement of particles is crucial for\nadvancing both quantum technologies and fundamental science. Significant\ndevelopments in this domain have been achieved in a variety of systems. In this\ncontext, ultracold polar molecules offer new and unique opportunities due to\ntheir more complex internal structure associated with vibration and rotation,\ncoupled to the existence of long-range interactions. However, the same\nproperties make molecules highly sensitive to their environment, impacting\ntheir coherence and utility in some applications. Here we show that by\nengineering an exceptionally controlled environment using rotationally-magic\noptical tweezers, we can achieve long-lived entanglement between pairs of\nmolecules using hertz-scale interactions. We demonstrate the highest reported\nfidelity to date for a two-molecule Bell state ($0.976^{+0.014}_{-0.016}$) and\npresent the first realisation of a microwave-driven entangling gate between two\nmolecules, preparing the molecules in a decoherence-free subspace. We show that\nthe magic-wavelength trap preserves the entanglement, with no measurable decay\nover 0.5 s, opening new avenues for quantum-enhanced metrology, ultracold\nchemistry and the use of rotational states for quantum simulation, quantum\ncomputation and as quantum memories. The extension of precise quantum control\nto complex molecular systems will allow their additional degrees of freedom to\nbe exploited across many domains of quantum science.\n","subjects":["Physics/Atomic Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"87MBbWKAkvoAmVY4l8kvXYa7lh9RbpbwffgyswyW96s","pdfSize":"1688967"}
