{"id":"2408.05273","title":"The AURORA Survey: The Nebular Attenuation Curve of a Galaxy at z=4.41\n  from Ultraviolet to Near-Infrared Wavelengths","authors":"Ryan L. Sanders, Alice E. Shapley, Michael W. Topping, Naveen A.\n  Reddy, Danielle A. Berg, Rychard J. Bouwens, Gabriel Brammer, Adam C.\n  Carnall, Fergus Cullen, Romeel Dav\\'e, James S. Dunlop, Richard S. Ellis, N.\n  M. F\\\"orster Schreiber, Steven R. Furlanetto, Karl Glazebrook, Garth D.\n  Illingworth, Tucker Jones, Mariska Kriek, Derek J. McLeod, Ross J. McLure,\n  Desika Narayanan, Pascal A. Oesch, Anthony J. Pahl, Max Pettini, Daniel\n  Schaerer, Daniel P. Stark, Charles C. Steidel, Mengtao Tang, Leonardo Clarke,\n  Callum T. Donnan, and Emily Kehoe","authorsParsed":[["Sanders","Ryan L.",""],["Shapley","Alice E.",""],["Topping","Michael W.",""],["Reddy","Naveen A.",""],["Berg","Danielle A.",""],["Bouwens","Rychard J.",""],["Brammer","Gabriel",""],["Carnall","Adam C.",""],["Cullen","Fergus",""],["Davé","Romeel",""],["Dunlop","James S.",""],["Ellis","Richard S.",""],["Schreiber","N. M. Förster",""],["Furlanetto","Steven R.",""],["Glazebrook","Karl",""],["Illingworth","Garth D.",""],["Jones","Tucker",""],["Kriek","Mariska",""],["McLeod","Derek J.",""],["McLure","Ross J.",""],["Narayanan","Desika",""],["Oesch","Pascal A.",""],["Pahl","Anthony J.",""],["Pettini","Max",""],["Schaerer","Daniel",""],["Stark","Daniel P.",""],["Steidel","Charles C.",""],["Tang","Mengtao",""],["Clarke","Leonardo",""],["Donnan","Callum T.",""],["Kehoe","Emily",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 18:00:03 GMT"}],"updateDate":"2024-08-13","timestamp":1723226403000,"abstract":"  We use JWST/NIRSpec observations from the Assembly of Ultradeep Rest-optical\nObservations Revealing Astrophysics (AURORA) survey to constrain the shape of\nthe nebular attenuation curve of a star-forming galaxy at z=4.41, GOODSN-17940.\nWe utilize 11 unblended HI recombination lines to derive the attenuation curve\nspanning optical to near-infrared wavelengths (3751-9550 \\r{A}). We then\nleverage a high-S/N spectroscopic detection of the rest-frame ultraviolet\ncontinuum in combination with rest-UV photometric measurements to constrain the\nshape of the curve at ultraviolet wavelengths. While this UV constraint is\npredominantly based on stellar emission, the large measured equivalent widths\nof H$\\alpha$ and H$\\beta$ indicate that GOODSN-17940 is dominated by an\nextremely young stellar population <10 Myr in age such that the UV stellar\ncontinuum experiences the same attenuation as the nebular emission. The\nresulting combined nebular attenuation curve spans 1400-9550 \\r{A} and has a\nshape that deviates significantly from commonly assumed dust curves in\nhigh-redshift studies. Relative to the Milky Way, SMC, and Calzetti curves, the\nnew curve has a steeper slope at long wavelengths ($\\lambda>5000$ \\r{A}) while\ndisplaying a similar slope across blue-optical wavelengths ($\\lambda=3750-5000$\n\\r{A}). In the ultraviolet, the new curve is shallower than the SMC and\nCalzetti curves and displays no significant 2175 \\r{A} bump. This work\ndemonstrates that the most commonly assumed dust curves are not appropriate for\nall high-redshift galaxies. These results highlight the ability to derive\nnebular attenuation curves for individual high-redshift sources with deep\nJWST/NIRSpec spectroscopy, thereby improving the accuracy of physical\nproperties inferred from nebular emission lines.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}