{"id":"2408.11212","title":"How many autonomous vehicles are required to stabilize traffic flow?","authors":"MirSaleh Bahavarnia and Ahmad F. Taha","authorsParsed":[["Bahavarnia","MirSaleh",""],["Taha","Ahmad F.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 22:14:19 GMT"}],"updateDate":"2024-08-22","timestamp":1724192059000,"abstract":"  Collective behavior of human-driven vehicles (HVs) results in the well-known\nstop-and-go waves potentially leading to higher fuel consumption and emissions.\nThis letter investigates the stabilization of traffic flow via a minimum number\nof autonomous vehicles (AVs) subject to constraints on the control parameters.\nThe unconstrained scenario has been well-studied in recent studies. The main\nmotivation to investigate the constrained scenario is that, in reality, lower\nand upper bounds exist on the control parameters. For the constrained scenario,\nwe optimally find the minimum number of required AVs (via computing the optimal\nlower bound on the AV penetration rate) to stabilize traffic flow for a given\nnumber of HVs. As an immediate consequence, we conclude that for a given number\nof AVs, the number of HVs in the stabilized traffic flow cannot be arbitrarily\nlarge in the constrained scenario unlike the unconstrained scenario studied in\nthe literature. Using nonlinear optimization techniques, we systematically\npropose a procedure to compute the optimal lower bound on the AV penetration\nrate. Finally, we validate the theoretical results via numerical simulations.\nNumerical simulations suggest that by enlarging the constraint intervals, a\nsmaller optimal lower bound on the AV penetration rate is attainable. However,\nit leads to a slower transient response due to a dominant pole closer to the\norigin.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VakB9oUiLUvDxwlb7UO9Z5T1Su4gQ4VXXsk81hJuikM","pdfSize":"316143"}
