{"id":"2408.03270","title":"Study of a Tilted Thin Accretion Disk around a Kerr-Taub-NUT black hole","authors":"Gargi Sen (IIT Guwahati), Chandrachur Chakraborty (MCNS, India), Sudip\n  Bhattacharyya (TIFR, India), Debaprasad Maity (IIT Guwahati), Sayan\n  Chakrabarti (IIT Guwahati), Santabrata Das (IIT Guwahati)","authorsParsed":[["Sen","Gargi","","IIT Guwahati"],["Chakraborty","Chandrachur","","MCNS, India"],["Bhattacharyya","Sudip","","TIFR, India"],["Maity","Debaprasad","","IIT Guwahati"],["Chakrabarti","Sayan","","IIT Guwahati"],["Das","Santabrata","","IIT Guwahati"]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 16:00:01 GMT"}],"updateDate":"2024-08-07","timestamp":1722960001000,"abstract":"  The accreting collapsed object GRO J1655-40 could contain the gravitomagnetic\nmonopole (GMM), and it was shown to be better described by the Kerr-Taub-NUT\n(KTN) spacetime instead of the Kerr spacetime. The warped accretion disk has\nalso been observed for the same collapsed object. Motivated by these, we study\na tilted thin inner accretion disk around a slowly-spinning KTN black hole that\ncontains a small GMM. Such a tilting could have a significant effect on the\nX-ray spectral and timing features via the Lense-Thirring effect. Taking into\naccount the contribution from the inner accretion disk for the KTN black hole,\nhere we calculate the radial profile of a tilt angle. Depending on the\nnumerical values of the viscosity of the accreting material and Kerr parameter,\nwe show that the GMM tends the angular momentum of the disk to align along the\nblack hole's spin axis, or to make it more tilted. Our solution for the radial\nprofile of the tilted disk around a KTN black hole could be useful to probe the\nstrong gravity regime, and could also give indirect evidence for the existence\nof GMM in nature.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}