{"id":"2408.10298","title":"Signature of hadron-quark crossover in binary-neutron-star mergers","authors":"Yuki Fujimoto, Kenji Fukushima, Kenta Hotokezaka, Koutarou Kyutoku","authorsParsed":[["Fujimoto","Yuki",""],["Fukushima","Kenji",""],["Hotokezaka","Kenta",""],["Kyutoku","Koutarou",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-21","timestamp":1724090400000,"abstract":"  We study observational signatures of the hadron-quark crossover in\nbinary-neutron-star mergers by systematic numerical-relativity simulations. We\nemploy two equations of state (EoSs) for matter consistent with inference from\nthe observational data. In the crossover scenario the EoS is softened in a\ndensity realized in binary-neutron-star mergers and is smoothly continued to\nquark matter. In the phase transition scenario without crossover, the EoS\nremains stiff and a first-order phase transition takes place in a density out\nof reach of mergers. A GW170817-like system forms a remnant massive neutron\nstar in both scenarios, and only the crossover scenario makes it collapse into\na black hole due to the softening while gravitational-wave emission is strong.\nThis difference is clearly reflected in the sudden shutdown of gravitational\nwaves. For a given EoS, the lifetime of the merger remnant is determined\nprimarily by the total mass of the system. These features pave the way for\nclarifying details of hadron-quark transition by compiling a wide variety of\nevents observed with future gravitational-wave detectors. The mass of the\naccretion disk surrounding the remnant black hole is affected not only by the\nlifetime of the remnant but also by the mass ratio of the system.\nElectromagnetic emission associated with the disk outflow will also be useful\nfor detailed investigation of the hadron-quark transition.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology","Physics/Nuclear Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}