{"id":"2408.06061","title":"Quantum Algorithms for Compositional Text Processing","authors":"Tuomas Laakkonen (Quantinuum), Konstantinos Meichanetzidis\n  (Quantinuum), Bob Coecke (Quantinuum)","authorsParsed":[["Laakkonen","Tuomas","","Quantinuum"],["Meichanetzidis","Konstantinos","","Quantinuum"],["Coecke","Bob","","Quantinuum"]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 11:21:40 GMT"}],"updateDate":"2024-08-13","timestamp":1723461700000,"abstract":"  Quantum computing and AI have found a fruitful intersection in the field of\nnatural language processing. We focus on the recently proposed DisCoCirc\nframework for natural language, and propose a quantum adaptation, QDisCoCirc.\nThis is motivated by a compositional approach to rendering AI interpretable:\nthe behavior of the whole can be understood in terms of the behavior of parts,\nand the way they are put together. For the model-native primitive operation of\ntext similarity, we derive quantum algorithms for fault-tolerant quantum\ncomputers to solve the task of question-answering within QDisCoCirc, and show\nthat this is BQP-hard; note that we do not consider the complexity of\nquestion-answering in other natural language processing models. Assuming\nwidely-held conjectures, implementing the proposed model classically would\nrequire super-polynomial resources. Therefore, it could provide a meaningful\ndemonstration of the power of practical quantum processors. The model\nconstruction builds on previous work in compositional quantum natural language\nprocessing. Word embeddings are encoded as parameterized quantum circuits, and\ncompositionality here means that the quantum circuits compose according to the\nlinguistic structure of the text. We outline a method for evaluating the model\non near-term quantum processors, and elsewhere we report on a recent\nimplementation of this on quantum hardware. In addition, we adapt a quantum\nalgorithm for the closest vector problem to obtain a Grover-like speedup in the\nfault-tolerant regime for our model. This provides an unconditional quadratic\nspeedup over any classical algorithm in certain circumstances, which we will\nverify empirically in future work.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}