{"id":"2408.13945","title":"Personalized Topology-Informed 12-Lead ECG Electrode Localization from\n  Incomplete Cardiac MRIs for Efficient Cardiac Digital Twins","authors":"Lei Li, Hannah Smith, Yilin Lyu, Julia Camps, Blanca Rodriguez,\n  Abhirup Banerjee, Vicente Grau","authorsParsed":[["Li","Lei",""],["Smith","Hannah",""],["Lyu","Yilin",""],["Camps","Julia",""],["Rodriguez","Blanca",""],["Banerjee","Abhirup",""],["Grau","Vicente",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 21:49:10 GMT"}],"updateDate":"2024-08-27","timestamp":1724622550000,"abstract":"  Cardiac digital twins (CDTs) offer personalized \\textit{in-silico} cardiac\nrepresentations for the inference of multi-scale properties tied to cardiac\nmechanisms. The creation of CDTs requires precise information about the\nelectrode position on the torso, especially for the personalized\nelectrocardiogram (ECG) calibration. However, current studies commonly rely on\nadditional acquisition of torso imaging and manual/semi-automatic methods for\nECG electrode localization. In this study, we propose a novel and efficient\ntopology-informed model to fully automatically extract personalized ECG\nelectrode locations from 2D clinically standard cardiac MRIs. Specifically, we\nobtain the sparse torso contours from the cardiac MRIs and then localize the\nelectrodes from the contours. Cardiac MRIs aim at imaging of the heart instead\nof the torso, leading to incomplete torso geometry within the imaging. To\ntackle the missing topology, we incorporate the electrodes as a subset of the\nkeypoints, which can be explicitly aligned with the 3D torso topology. The\nexperimental results demonstrate that the proposed model outperforms the\ntime-consuming conventional method in terms of accuracy (Euclidean distance:\n$1.24 \\pm 0.293$ cm vs. $1.48 \\pm 0.362$ cm) and efficiency ($2$~s vs.\n$30$-$35$~min). We further demonstrate the effectiveness of using the detected\nelectrodes for \\textit{in-silico} ECG simulation, highlighting their potential\nfor creating accurate and efficient CDT models. The code will be released\npublicly after the manuscript is accepted for publication.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}