{"id":"2408.12567","title":"FRB 20121102A monitoring: updated periodicity at L-band","authors":"C. A. Braga, M. Cruces, T. Cassanelli, M.C. Espinoza-Dupouy, L.\n  Rodriguez, L. G. Spitler, J. Vera-Casanova, and P. Limaye","authorsParsed":[["Braga","C. A.",""],["Cruces","M.",""],["Cassanelli","T.",""],["Espinoza-Dupouy","M. C.",""],["Rodriguez","L.",""],["Spitler","L. G.",""],["Vera-Casanova","J.",""],["Limaye","P.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 17:33:50 GMT"}],"updateDate":"2024-08-23","timestamp":1724348030000,"abstract":"  FRB 20121102A was the first fast radio burst to be observed to repeat. Since\nthen, thousands of bursts have been detected by multiple radio telescopes\naround the world. Previous work has shown an indication of a cyclic activity\nlevel with a periodicity around 160 days. Knowing when the source repeats is\nessential for planning multi-wavelength monitoring to constrain their emission\nextend and progenitor source. We report the monitoring of FRB 20121102A using\nthe 100-m Effelsberg radio telescope at L-band and update the periodicity of\nthe cyclic activity-level. We use the Lomb-Scargle periodogram on a sample of\n272 observing epochs where 41% correspond to detections and 59% to\nnon-detections. Our dataset is composed of the 7 epochs of our monitoring plus\npublicly available data. We investigate two methods, i) binary model,\ndescribing the observing epochs with 1 if there are detections and with 0 for\nnon-detections. ii) normalised rates model: which considers the inferred\ndetections rates. We report no detections in 12.5-hour observations down to a\nfluence of 0.29 Jy ms. The best period found for the cyclic activity window is\n$159.3 \\pm 0.8$ days for the binary model and $159.3 \\pm 0.3$ days for the\nnormalised rates model. The activity phase is shown to be 53%. The normalised\nrates shows a clear Gaussian-like behaviour for the activity level, where the\nnumber of detections peak at the centre of the activity window. The periodicity\nfound through both methods is consistent for the L and S-band datasets implying\nit is intrinsic to the source. The activity phase in S-band however shows an\nindication of it ending before the L-band activity phase, supporting the idea\nof chromatic dependence of the activity window. The sample at C-band however is\nnot large enough to further confirm this result.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}