{"id":"2408.11436","title":"Positive and unlabelled machine learning reveals new fast radio burst\n  repeater candidates","authors":"Arjun Sharma and Vinesh Maguire Rajpaul","authorsParsed":[["Sharma","Arjun",""],["Rajpaul","Vinesh Maguire",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 08:47:19 GMT"},{"version":"v2","created":"Wed, 11 Sep 2024 19:24:54 GMT"}],"updateDate":"2024-09-13","timestamp":1724230039000,"abstract":"  Fast radio bursts (FRBs) are astronomical radio transients of unknown origin.\nA minority of FRBs have been observed to originate from repeating sources, and\nit is unknown which apparent one-off bursts are hidden repeaters. Recent\nstudies increasingly suggest that there are intrinsic physical differences\nbetween repeating and non-repeating FRBs. Previous research has used machine\nlearning classification techniques to identify apparent non-repeaters with\nrepeater characteristics, whose sky positions would be ideal targets for future\nobservation campaigns. However, these methods have not sufficiently accounted\nfor the positive and unlabelled (PU) nature of the data, wherein true labels\nare only available for repeaters. Modified techniques that do not inadvertently\nlearn properties of hidden repeaters as characteristic of non-repeaters are\nlikely to identify additional repeater candidates with greater accuracy. We\npresent in this paper the first known attempt at applying PU-specific machine\nlearning techniques to study FRBs. We train an ensemble of five PU-specific\nclassifiers on the available data and use them to identify 66 repeater\ncandidates in burst data from the CHIME/FRB collaboration, 18 of which were not\nidentified with the use of machine learning classifiers in past research. Our\nresults additionally support repeaters and non-repeaters having intrinsically\ndifferent physical properties, particularly spectral index, frequency width,\nand burst width. This work additionally opens new possibilities to study\nrepeating and non-repeating FRBs using the framework of PU learning.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}