{"id":"2408.08577","title":"Mechanistic Modeling of Lipid Nanoparticle Formation for the Delivery of\n  Nucleic Acid Therapeutics","authors":"Pavan K. Inguva, Saikat Mukherjee, Pierre J. Walker, Mona A. Kanso,\n  Jie Wang, Yanchen Wu, Vico Tenberg, Srimanta Santra, Shalini Singh, Shin Hyuk\n  Kim, Bernhardt L. Trout, Martin Z. Bazant, Allan S. Myerson, Richard D.\n  Braatz","authorsParsed":[["Inguva","Pavan K.",""],["Mukherjee","Saikat",""],["Walker","Pierre J.",""],["Kanso","Mona A.",""],["Wang","Jie",""],["Wu","Yanchen",""],["Tenberg","Vico",""],["Santra","Srimanta",""],["Singh","Shalini",""],["Kim","Shin Hyuk",""],["Trout","Bernhardt L.",""],["Bazant","Martin Z.",""],["Myerson","Allan S.",""],["Braatz","Richard D.",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 07:24:14 GMT"}],"updateDate":"2024-08-19","timestamp":1723793054000,"abstract":"  Nucleic acids such as mRNA have emerged as a promising therapeutic modality\nwith the capability of addressing a wide range of diseases. Lipid nanoparticles\n(LNPs) as a delivery platform for nucleic acids were used in the COVID-19\nvaccines and have received much attention. While modern manufacturing processes\nwhich involve rapidly mixing an organic stream containing the lipids with an\naqueous stream containing the nucleic acids are conceptually straightforward,\ndetailed understanding of LNP formation and structure is still limited and\nscale-up can be challenging. Mathematical and computational methods are a\npromising avenue for deepening scientific understanding of the LNP formation\nprocess and facilitating improved process development and control. This article\ndescribes strategies for the mechanistic modeling of LNP formation, starting\nwith strategies to estimate and predict important physicochemical properties of\nthe various species such as diffusivities and solubilities. Subsequently, a\nframework is outlined for constructing mechanistic models of reactor- and\nparticle-scale processes. Insights gained from the various models are mapped\nback to product quality attributes and process insights. Lastly, the use of the\nmodels to guide development of advanced process control and optimization\nstrategies is discussed.\n","subjects":["Condensed Matter/Soft Condensed Matter","Computing Research Repository/Computational Engineering, Finance, and Science","Physics/Biological Physics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}