{"id":"2408.03856","title":"Invariance transformations in wave-optics lensing: implications for\n  gravitational-wave astrophysics and cosmology","authors":"Anson Chen, Paolo Cremonese, Jose Mar\\'ia Ezquiaga, David Keitel","authorsParsed":[["Chen","Anson",""],["Cremonese","Paolo",""],["Ezquiaga","Jose María",""],["Keitel","David",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 15:54:03 GMT"}],"updateDate":"2024-08-08","timestamp":1723046043000,"abstract":"  Gravitational lensing offers unique opportunities to learn about the\nastrophysical origin of distant sources, the abundance of intervening objects\nacting as lenses, and gravity and cosmology in general. However, all this\ninformation can only be retrieved as long as one can disentangle each effect\nfrom the finite number of observables. In the geometric optics regime, typical\nof electromagnetic radiation, when the wavelength of the lensed signal is small\ncompared to the size of the lens, there are invariance transformations that\nchange the mass of the lens and the source-lens configuration but leave the\nobservables unchanged. Neglecting this ``mass-sheet degeneracy'' can lead to\nbiased lens parameters or unrealistic low uncertainties, which could then\ntransfer to an incorrect cosmography study. This might be different for\ngravitational waves as their long wavelengths can be comparable to the lens\nsize and lensing enters into the wave-optics limit. We explore the existence of\ninvariance transformations in the wave-optics regime of gravitational-wave\nlensing, extending previous work and examining the implications for\nastrophysical and cosmological studies. We study these invariance\ntransformations using three different methods of increasing level of\ncomplexity: template mismatch, Fisher Matrix, and Bayesian parameter\nestimation. We find that, for a sufficiently loud signal, the degeneracy is\npartially broken and the lens and cosmological parameters, e.g. $H_0$, can be\nretrieved independently and unbiased. In current ground-based detectors,\nthough, considering also population studies, a strong constraint on these\nparameters seems quite remote and the prevailing degeneracy implies a larger\nuncertainty in the lens model reconstruction. However, with better sensitivity\nof the third-generation ground-based detectors, a meaningful constraint on\n$H_0$ is possible to obtain.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}