{"id":"2408.14639","title":"Europa's H$_2$O$_2$: Temperature Insensitivity and a Correlation with\n  CO$_2$","authors":"Peiyu Wu, Samantha K. Trumbo, Michael E. Brown, Katherine de Kleer","authorsParsed":[["Wu","Peiyu",""],["Trumbo","Samantha K.",""],["Brown","Michael E.",""],["de Kleer","Katherine",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 21:06:19 GMT"}],"updateDate":"2024-08-28","timestamp":1724706379000,"abstract":"  H$_2$O$_2$ is part of Europa's water-ice radiolytic cycle and a potential\nsource of oxidants to Europa's subsurface ocean. However, factors controlling\nthe concentration of this critical surface species remain unclear. Though\nlaboratory experiments suggest that Europa's H$_2$O$_2$ should be concentrated\nin the coldest, most ice-rich regions toward the poles, Keck adaptive optics\nobservations have shown the strongest H$_2$O$_2$ signatures in comparatively\nwarm, salt-bearing terrain at low latitudes. As a result, it was suggested that\nthe local non-ice composition of these terrains -- particularly hypothesized\nenrichments of CO$_2$ -- may be a more dominant control on H$_2$O$_2$ than\ntemperature or water-ice abundance. Here, we use observations of Europa from\nthe NASA Infrared Telescope Facility, Keck Observatory, and JWST to disentangle\nthe potential effects of temperature and composition. In order to isolate the\neffect of temperature on Europa's H$_2$O$_2$, we use the ground-based\nobservations to assess its response to temperature changes over timescales\nassociated with Europa's daily eclipse and diurnal cycle. We use JWST Cycle 1\ndata to look for any geographic correlation between Europa's H$_2$O$_2$ and\nCO$_2$. Both changes in Europa's 3.5-$\\mu$m H$_2$O$_2$ absorption band from pre\nto post eclipse and across a local day suggest minimal effects of the local\ntemperature on these timescales. In contrast, the JWST observations show a\nstrong positive correlation between Europa's H$_2$O$_2$ and CO$_2$ bands,\nsupporting the previously suggested possibility that the presence of CO$_2$ in\nthe ice may enhance H$_2$O$_2$ concentrations via electron-scavenging.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}