{"id":"2408.17293","title":"Modeling flux tunability in Josephson Traveling Wave Parametric\n  Amplifiers with an open-source frequency-domain simulator","authors":"A. Levochkina, I. Chatterjee, P. Darvehi, H. G. Ahmad, P. Mastrovito,\n  D. Massarotti, D. Montemurro, F. Tafuri, G.P. Pepe, Kevin P. O'Brien and M.\n  Esposito","authorsParsed":[["Levochkina","A.",""],["Chatterjee","I.",""],["Darvehi","P.",""],["Ahmad","H. G.",""],["Mastrovito","P.",""],["Massarotti","D.",""],["Montemurro","D.",""],["Tafuri","F.",""],["Pepe","G. P.",""],["O'Brien","Kevin P.",""],["Esposito","M.",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 13:48:16 GMT"}],"updateDate":"2024-09-02","timestamp":1725025696000,"abstract":"  Josephson Traveling Wave Parametric Amplifiers (JTWPAs) are integral parts of\nmany experiments carried out in quantum technologies. Being composed of\nhundreds of Josephson junction-based unit cells, such devices exhibit complex\nnonlinear behavior that typically cannot be fully explained with simple\nanalytical models, thus necessitating the use of numerical simulators. A very\nuseful characteristic of JTWPAs is the possibility of being biased by an\nexternal magnetic flux, allowing insitu control of the nonlinearity. It is\ntherefore very desirable for numerical simulators to support this feature.\nOpen-source numerical tools that allow to model JTWPA flux biasing, such as\nWRSPICE or PSCAN2, are based on time-domain approaches,which typically require\nlong simulation times to get accurate results. In this work, we model the gain\nperformance in a prototypical flux-tunable JTWPA by using\nJosephsonCircuits.jl,a recently developed frequency-domain open-source\nnumerical simulator, which has the benefit of simulation times about 10,000\nfaster than time-domain methods. By comparing the numerical and experimental\nresults, we validate this approach for modeling the flux dependent behavior of\nJTWPAs.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}