{"id":"2408.09649","title":"Deep Learning-based Machine Condition Diagnosis using Short-time Fourier\n  Transformation Variants","authors":"Eduardo Jr Piedad, Zherish Galvin Mayordo, Eduardo Prieto-Araujo,\n  Oriol Gomis-Bellmunt","authorsParsed":[["Piedad","Eduardo Jr",""],["Mayordo","Zherish Galvin",""],["Prieto-Araujo","Eduardo",""],["Gomis-Bellmunt","Oriol",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 02:16:17 GMT"}],"updateDate":"2024-08-20","timestamp":1724033777000,"abstract":"  In motor condition diagnosis, electrical current signature serves as an\nalternative feature to vibration-based sensor data, which is a more expensive\nand invasive method. Machine learning (ML) techniques have been emerging in\ndiagnosing motor conditions using only motor phase current signals. This study\nconverts time-series motor current signals to time-frequency 2D plots using\nShort-time Fourier Transform (STFT) methods. The motor current signal dataset\nconsists of 3,750 sample points with five classes - one healthy and four\nsynthetically-applied motor fault conditions, and with five loading conditions:\n0, 25, 50, 75, and 100%. Five transformation methods are used on the dataset:\nnon-overlap and overlap STFTs, non-overlap and overlap realigned STFTs, and\nsynchrosqueezed STFT. Then, deep learning (DL) models based on the previous\nConvolutional Neural Network (CNN) architecture are trained and validated from\ngenerated plots of each method. The DL models of overlap-STFT, overlap R-STFT,\nnon-overlap STFT, non-overlap R-STFT, and synchrosqueezed-STFT performed\nexceptionally with an average accuracy of 97.65, 96.03, 96.08, 96.32, and\n88.27%, respectively. Four methods outperformed the previous best ML method\nwith 93.20% accuracy, while all five outperformed previous 2D-plot-based\nmethods with accuracy of 80.25, 74.80, and 82.80%, respectively, using the same\ndataset, same DL architecture, and validation steps.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tOb32fK-2mlicyrntstRc4vsOCqFGySdBztIWcCW_Z4","pdfSize":"3332360"}
