{"id":"2408.11151","title":"The Cosmic Ultraviolet Baryon Survey (CUBS) IX: The enriched\n  circumgalactic and intergalactic medium around star-forming field dwarf\n  galaxies traced by O VI absorption","authors":"Nishant Mishra, Sean D. Johnson, Gwen C. Rudie, Hsiao-Wen Chen, Joop\n  Schaye, Zhijie Qu, Fakhri S. Zahedy, Erin T. Boettcher, Sebastiano Cantalupo,\n  Mandy C. Chen, Claude-Andr\\'e Faucher-Gigu\\`ere, Jenny E. Greene, Jennifer\n  I-Hsiu Li, Zhuoqi (Will) Liu, Sebastian Lopez, and Patrick Petitjean","authorsParsed":[["Mishra","Nishant","","Will"],["Johnson","Sean D.","","Will"],["Rudie","Gwen C.","","Will"],["Chen","Hsiao-Wen","","Will"],["Schaye","Joop","","Will"],["Qu","Zhijie","","Will"],["Zahedy","Fakhri S.","","Will"],["Boettcher","Erin T.","","Will"],["Cantalupo","Sebastiano","","Will"],["Chen","Mandy C.","","Will"],["Faucher-Giguère","Claude-André","","Will"],["Greene","Jenny E.","","Will"],["Li","Jennifer I-Hsiu","","Will"],["Zhuoqi","","","Will"],["Liu","",""],["Lopez","Sebastian",""],["Petitjean","Patrick",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 19:16:31 GMT"}],"updateDate":"2024-08-22","timestamp":1724181391000,"abstract":"  The shallow potential wells of star-forming dwarf galaxies make their\nsurrounding circumgalactic and intergalactic medium (CGM/IGM) sensitive\nlaboratories for studying the inflows and outflows thought to regulate galaxy\nevolution. We present new absorption-line measurements in quasar sightlines\nprobing within projected distances of $<300$ kpc from 91 star-forming field\ndwarf galaxies with a median stellar mass of $\\log{M_\\star/\\rm{M_\\odot}}\n\\approx 8.3$ at $0.077 < z < 0.73$ from the Cosmic Ultraviolet Baryon Survey\n(CUBS). In this redshift range, the CUBS quasar spectra cover a suite of\ntransitions including H I, low and intermediate metal ions (e.g., C II, Si II,\nC III, and Si III), and highly ionized O VI. This CUBS-Dwarfs survey enables\nconstraints with samples 9$\\times$ larger than past dwarf CGM/IGM studies with\nsimilar ionic coverage. We find that low and intermediate ionization metal\nabsorption is rare around dwarf galaxies, consistent with previous surveys of\nlocal dwarfs. In contrast, highly ionized O VI is commonly observed in\nsightlines that pass within the virial radius of a dwarf, and O VI detection\nrates are non-negligible at projected distances of 1$-$2$\\times$ the virial\nradius. Based on these measurements, we estimate that the O VI-bearing phase of\nthe CGM/IGM accounts for a dominant share of the metal budget of dwarf\ngalaxies. The absorption kinematics suggest that a relatively modest fraction\nof the O VI-bearing gas is formally unbound. Together, these results imply that\nlow-mass systems at $z\\lesssim 1$ effectively retain a substantial fraction of\ntheir metals within the nearby CGM and IGM.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}