{"id":"2408.13330","title":"Dissociation line and driving force for nucleation of the nitrogen\n  hydrate from computer simulation","authors":"Jes\\'us Algaba, Miguel J. Torrej\\'on, and Felipe J. Blas","authorsParsed":[["Algaba","Jesús",""],["Torrejón","Miguel J.",""],["Blas","Felipe J.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 18:36:57 GMT"}],"updateDate":"2024-08-27","timestamp":1724438217000,"abstract":"  In this work, we determine the dissociation line of the nitrogen (N$_2$)\nhydrate by computer simulation using the TIP4P/Ice model for water and the\nTraPPE force field for N$_2$. We use the solubility method proposed recently by\nsome of us to evaluate the dissociation temperature of the hydrate at different\npressures, from 500 to 1500 bar. Particularly, we calculate the solubility of\nN$_2$ in the aqueous solution when it is in contact with a N$_2$-rich liquid\nphase and when in contact with the hydrate phase via planar interfaces as\nfunctions of temperature. Since the solubility of N$_2$ decreases with\ntemperature in the first case and increases with temperature in the second\ncase, both curves intersect at a certain temperature that determines the\ndissociation temperature at a given pressure. We find a good agreement between\nthe predictions obtained in this work and the experimental data taken from the\nliterature in the range of pressures considered in this work. From our\nknowledge of the solubility curves of N$_2$ in the aqueous solution, we also\ndetermine the driving force for nucleation of the hydrate, as a function of\ntemperature, at different pressures. In particular, we use two different\nthermodynamic routes to evaluate the change in chemical potential for hydrate\nformation. Although the driving force for nucleation slightly decreases (in\nabsolute value) when the pressure is increased, our results indicate that the\neffect of pressure can be considered negligible in the range of pressures\nstudied in this work. To the best of our knowledge, this is the first time the\ndriving force for nucleation of a hydrate that exhibits crystallographic\nstructure sII, along its dissociation line, is studied from computer\nsimulation.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LWGoe9ETXZBv8TS-RvDK8F4n3cHNflzU4Q8mSlW5l0s","pdfSize":"1054133"}
