{"id":"2408.07666","title":"Model Merging in LLMs, MLLMs, and Beyond: Methods, Theories,\n  Applications and Opportunities","authors":"Enneng Yang, Li Shen, Guibing Guo, Xingwei Wang, Xiaochun Cao, Jie\n  Zhang, Dacheng Tao","authorsParsed":[["Yang","Enneng",""],["Shen","Li",""],["Guo","Guibing",""],["Wang","Xingwei",""],["Cao","Xiaochun",""],["Zhang","Jie",""],["Tao","Dacheng",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 16:58:48 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 01:49:29 GMT"},{"version":"v3","created":"Wed, 21 Aug 2024 12:47:31 GMT"},{"version":"v4","created":"Thu, 5 Sep 2024 14:37:59 GMT"}],"updateDate":"2024-09-06","timestamp":1723654728000,"abstract":"  Model merging is an efficient empowerment technique in the machine learning\ncommunity that does not require the collection of raw training data and does\nnot require expensive computation. As model merging becomes increasingly\nprevalent across various fields, it is crucial to understand the available\nmodel merging techniques comprehensively. However, there is a significant gap\nin the literature regarding a systematic and thorough review of these\ntechniques. This survey provides a comprehensive overview of model merging\nmethods and theories, their applications in various domains and settings, and\nfuture research directions. Specifically, we first propose a new taxonomic\napproach that exhaustively discusses existing model merging methods. Secondly,\nwe discuss the application of model merging techniques in large language\nmodels, multimodal large language models, and 10+ machine learning subfields,\nincluding continual learning, multi-task learning, few-shot learning, etc.\nFinally, we highlight the remaining challenges of model merging and discuss\nfuture research directions. A comprehensive list of papers about model merging\nis available at\n\\url{https://github.com/EnnengYang/Awesome-Model-Merging-Methods-Theories-Applications}.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}