{"id":"2408.07406","title":"Skin effect in Non-Hermitian systems with spin","authors":"Wenna Zhang, Yutao Hu, Hongyi Zhang, Xiang Liu, Georgios Veronis,\n  Yuecheng Shen, Yin Huang, Wenchen Luo and Andrea Alu`","authorsParsed":[["Zhang","Wenna",""],["Hu","Yutao",""],["Zhang","Hongyi",""],["Liu","Xiang",""],["Veronis","Georgios",""],["Shen","Yuecheng",""],["Huang","Yin",""],["Luo","Wenchen",""],["Alu`","Andrea",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 09:24:41 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 01:38:46 GMT"}],"updateDate":"2024-08-19","timestamp":1723627481000,"abstract":"  The skin effect, where bulk modes collapse into boundary modes, is a key\nphenomenon in topological non-Hermitian systems, has been predominantly studied\nin spinless systems. Recent studies illustrate the magnetic suppression of the\nfirst-order skin effect while ignoring spin. However, the physical significance\nof a magnetic field in non-Hermitian skin effect with spin remains elusive.\nHere, we systematically explore non-Hermitian spinful systems based on\ngeneralized Hatano-Nelson models with SU(2) gauge potential fields. In an open\none-dimensional lattice, the spin-up and spin-down states can be uniquely\nseparated and localized at the two boundaries without magnetic field. When an\nexternal magnetic field is applied, the skin effect exhibits a smooth\ntransition from bidirectional to unidirectional. Remarkably, we demonstrate\nthat the first-order skin effect can be anomalously induced by a magnetic field\nin a topologically trivial non-Hermitian spinful system without any skin effect\nat zero field. The direction of such magnetically induced skin modes can be\ncontrolled by simply changing the amplitude and polarity of the magnetic field.\nIn addition, we demonstrate a transition between non-Bloch PT and anti-PT\nsymmetries in the system, and uncover the spindependent mechanism of non-Bloch\nPT symmetry. Our results pave the way for the investigation of non-Hermitian\nskin effect with spin degrees of freedom.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}