{"id":"2408.15273","title":"Concentric UCAs Based Low-Order OAM for High Capacity in Radio Vortex\n  Wireless Communications","authors":"Haiyue Jing, Wenchi Cheng, Zan Li, and Hailin Zhang","authorsParsed":[["Jing","Haiyue",""],["Cheng","Wenchi",""],["Li","Zan",""],["Zhang","Hailin",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 03:08:16 GMT"}],"updateDate":"2024-08-29","timestamp":1723518496000,"abstract":"  Due to the potential capacity-boosting for wireless communications, the Radio\nvOrtex Wireless COMMunication (RowComm) over orthogonal states/modes of Orbital\nAngular Momentum (OAM) has been paid much attention in recent years. Uniform\ncircular array (UCA), as an efficient and convenient antenna structure, can\ntransmit/receive multiple OAM beams with different OAM-modes simultaneously\nwhen the transmitter and receiver are aligned. However, for high-order\nOAM-modes, the OAM beams are divergent accompanied by severe attenuations.\nThus, it is difficult to directly use high-order OAM-modes to achieve high\ncapacity for RowComms. To obtain high capacity potentially offered by\nOAM-modes, in this paper we transform the singular UCA into the concentric\nUCAs, where high capacity can be achieved using multiple parallel low-order\nOAM-modes instead of all high-order OAM-modes, to increase the capacity of\ntransmitter-receiver aligned RowComms. In particular, we study two cases: 1).\nConcentric UCAs based RowComms without co-mode interference; 2). Concentric\nUCAs based RowComms with co-mode interference. We propose a\nco-mode-interference-free and a co-mode-interference-contained\nmode-decomposition schemes to recover transmit signals for these two cases,\nrespectively. Also, we develop the optimal power allocation schemes to maximize\nthe capacity for these two cases. Numerical simulations are presented to\nvalidate and evaluate that our developed concentric UCAs based low-order\nRowComms can significantly increase the capacity as compared with that of\nsingular UCA based RowComms.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}