{"id":"2408.07557","title":"Band-selective simulation of photoelectron intensity and converging\n  Berry phase in trilayer graphene","authors":"Hayoon Im, Sue Hyeon Hwang, Minhee Kang, Kyoo Kim, Haeyong Kang, and\n  Choongyu Hwang","authorsParsed":[["Im","Hayoon",""],["Hwang","Sue Hyeon",""],["Kang","Minhee",""],["Kim","Kyoo",""],["Kang","Haeyong",""],["Hwang","Choongyu",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 13:43:31 GMT"}],"updateDate":"2024-08-15","timestamp":1723643011000,"abstract":"  Berry phase is one of the key elements to understand quantum-mechanical\nphenomena such as the Aharonov-Bohm effect and the unconventional Hall effect\nin graphene. The Berry phase in monolayer and bilayer graphene has been\nmanifested by the anisotropic distribution of photoelectron intensity along a\nclosed loop in the momentum space as well as its rotation by a characteristic\nangle upon rotating light polarization. Here we report the band-selective\nsimulation of photoelectron intensity of trilayer graphene to understand its\nBerry phase within the tight-binding formalism. ABC- and ABA-stacked trilayer\ngraphene show characteristic rotational angles of photoelectron intensity\ndistribution, as predicted from their well-known Berry phases. Surprisingly,\nhowever, in ABA-stacked trilayer graphene, the rotational angle changes upon\napproaching toward the band touching point between the conduction and valence\nbands, which suggest that Berry phase changes as a function of binding energy.\nThe binding energy-dependent Berry phase is attributed to the enhanced\nhybridization of the two electron bands of ABA-stacked trilayer graphene that\nconverge at the band touching point, resulting in the converging Berry phase.\nThese findings will provide an efficient way of tuning Berry phase and hence\nexotic phenomena stemming from the Berry phase.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4aEO-lgspO6VNp5Tmer7a6JBlnDhPTLGWFUw4wdOBHg","pdfSize":"2898285"}
