{"id":"2408.04777","title":"Deep Learning-based Unsupervised Domain Adaptation via a Unified Model\n  for Prostate Lesion Detection Using Multisite Bi-parametric MRI Datasets","authors":"Hao Li, Han Liu, Heinrich von Busch, Robert Grimm, Henkjan Huisman,\n  Angela Tong, David Winkel, Tobias Penzkofer, Ivan Shabunin, Moon Hyung Choi,\n  Qingsong Yang, Dieter Szolar, Steven Shea, Fergus Coakley, Mukesh\n  Harisinghani, Ipek Oguz, Dorin Comaniciu, Ali Kamen, Bin Lou","authorsParsed":[["Li","Hao",""],["Liu","Han",""],["von Busch","Heinrich",""],["Grimm","Robert",""],["Huisman","Henkjan",""],["Tong","Angela",""],["Winkel","David",""],["Penzkofer","Tobias",""],["Shabunin","Ivan",""],["Choi","Moon Hyung",""],["Yang","Qingsong",""],["Szolar","Dieter",""],["Shea","Steven",""],["Coakley","Fergus",""],["Harisinghani","Mukesh",""],["Oguz","Ipek",""],["Comaniciu","Dorin",""],["Kamen","Ali",""],["Lou","Bin",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 22:20:33 GMT"}],"updateDate":"2024-09-19","timestamp":1723155633000,"abstract":"  Our hypothesis is that UDA using diffusion-weighted images, generated with a\nunified model, offers a promising and reliable strategy for enhancing the\nperformance of supervised learning models in multi-site prostate lesion\ndetection, especially when various b-values are present. This retrospective\nstudy included data from 5,150 patients (14,191 samples) collected across nine\ndifferent imaging centers. A novel UDA method using a unified generative model\nwas developed for multi-site PCa detection. This method translates\ndiffusion-weighted imaging (DWI) acquisitions, including apparent diffusion\ncoefficient (ADC) and individual DW images acquired using various b-values, to\nalign with the style of images acquired using b-values recommended by Prostate\nImaging Reporting and Data System (PI-RADS) guidelines. The generated ADC and\nDW images replace the original images for PCa detection. An independent set of\n1,692 test cases (2,393 samples) was used for evaluation. The area under the\nreceiver operating characteristic curve (AUC) was used as the primary metric,\nand statistical analysis was performed via bootstrapping. For all test cases,\nthe AUC values for baseline SL and UDA methods were 0.73 and 0.79 (p<.001),\nrespectively, for PI-RADS>=3, and 0.77 and 0.80 (p<.001) for PI-RADS>=4 PCa\nlesions. In the 361 test cases under the most unfavorable image acquisition\nsetting, the AUC values for baseline SL and UDA were 0.49 and 0.76 (p<.001) for\nPI-RADS>=3, and 0.50 and 0.77 (p<.001) for PI-RADS>=4 PCa lesions. The results\nindicate the proposed UDA with generated images improved the performance of SL\nmethods in multi-site PCa lesion detection across datasets with various b\nvalues, especially for images acquired with significant deviations from the\nPI-RADS recommended DWI protocol (e.g. with an extremely high b-value).\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xc13FW1Io2qEEIy5wVK3DRPWMwrIecGsfyrnzPyPwnE","pdfSize":"2443385"}
