{"id":"2408.09785","title":"GoNoGo: An Efficient LLM-based Multi-Agent System for Streamlining\n  Automotive Software Release Decision-Making","authors":"Arsham Gholamzadeh Khoee, Yinan Yu, Robert Feldt, Andris Freimanis,\n  Patrick Andersson, and Dhasarathy Parthasarathy","authorsParsed":[["Khoee","Arsham Gholamzadeh",""],["Yu","Yinan",""],["Feldt","Robert",""],["Freimanis","Andris",""],["Andersson","Patrick",""],["Parthasarathy","Dhasarathy",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 08:22:20 GMT"}],"updateDate":"2024-08-20","timestamp":1724055740000,"abstract":"  Traditional methods for making software deployment decisions in the\nautomotive industry typically rely on manual analysis of tabular software test\ndata. These methods often lead to higher costs and delays in the software\nrelease cycle due to their labor-intensive nature. Large Language Models (LLMs)\npresent a promising solution to these challenges. However, their application\ngenerally demands multiple rounds of human-driven prompt engineering, which\nlimits their practical deployment, particularly for industrial end-users who\nneed reliable and efficient results. In this paper, we propose GoNoGo, an LLM\nagent system designed to streamline automotive software deployment while\nmeeting both functional requirements and practical industrial constraints.\nUnlike previous systems, GoNoGo is specifically tailored to address\ndomain-specific and risk-sensitive systems. We evaluate GoNoGo's performance\nacross different task difficulties using zero-shot and few-shot examples taken\nfrom industrial practice. Our results show that GoNoGo achieves a 100% success\nrate for tasks up to Level 2 difficulty with 3-shot examples, and maintains\nhigh performance even for more complex tasks. We find that GoNoGo effectively\nautomates decision-making for simpler tasks, significantly reducing the need\nfor manual intervention. In summary, GoNoGo represents an efficient and\nuser-friendly LLM-based solution currently employed in our industrial partner's\ncompany to assist with software release decision-making, supporting more\ninformed and timely decisions in the release process for risk-sensitive vehicle\nsystems.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}