{"id":"2408.04763","title":"Segmentation of Mental Foramen in Orthopantomographs: A Deep Learning\n  Approach","authors":"Haider Raza, Mohsin Ali, Vishal Krishna Singh, Agustin Wahjuningrum,\n  Rachel Sarig, Akhilanand Chaurasia","authorsParsed":[["Raza","Haider",""],["Ali","Mohsin",""],["Singh","Vishal Krishna",""],["Wahjuningrum","Agustin",""],["Sarig","Rachel",""],["Chaurasia","Akhilanand",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 21:40:06 GMT"}],"updateDate":"2024-08-12","timestamp":1723153206000,"abstract":"  Precise identification and detection of the Mental Foramen are crucial in\ndentistry, impacting procedures such as impacted tooth removal, cyst surgeries,\nand implants. Accurately identifying this anatomical feature facilitates\npost-surgery issues and improves patient outcomes. Moreover, this study aims to\naccelerate dental procedures, elevating patient care and healthcare efficiency\nin dentistry. This research used Deep Learning methods to accurately detect and\nsegment the Mental Foramen from panoramic radiograph images. Two mask types,\ncircular and square, were used during model training. Multiple segmentation\nmodels were employed to identify and segment the Mental Foramen, and their\neffectiveness was evaluated using diverse metrics. An in-house dataset\ncomprising 1000 panoramic radiographs was created for this study. Our\nexperiments demonstrated that the Classical UNet model performed exceptionally\nwell on the test data, achieving a Dice Coefficient of 0.79 and an Intersection\nover Union (IoU) of 0.67. Moreover, ResUNet++ and UNet Attention models showed\ncompetitive performance, with Dice scores of 0.675 and 0.676, and IoU values of\n0.683 and 0.671, respectively. We also investigated transfer learning models\nwith varied backbone architectures, finding LinkNet to produce the best\noutcomes. In conclusion, our research highlights the efficacy of the classical\nUnet model in accurately identifying and outlining the Mental Foramen in\npanoramic radiographs. While vital, this task is comparatively simpler than\nsegmenting complex medical datasets such as brain tumours or skin cancer, given\ntheir diverse sizes and shapes. This research also holds value in optimizing\ndental practice, benefiting practitioners and patients.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}