{"id":"2408.01652","title":"Complex event recognition meets hierarchical conjunctive queries","authors":"Dante Pinto and Cristian Riveros","authorsParsed":[["Pinto","Dante",""],["Riveros","Cristian",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 03:31:18 GMT"}],"updateDate":"2024-08-06","timestamp":1722655878000,"abstract":"  Hierarchical conjunctive queries (HCQ) are a subclass of conjunctive queries\n(CQ) with robust algorithmic properties. Among others, Berkholz, Keppeler, and\nSchweikardt have shown that HCQ is the subclass of CQ (without projection) that\nadmits dynamic query evaluation with constant update time and constant delay\nenumeration. On a different but related setting stands Complex Event\nRecognition (CER), a prominent technology for evaluating sequence patterns over\nstreams. Since one can interpret a data stream as an unbounded sequence of\ninserts in dynamic query evaluation, it is natural to ask to which extent CER\ncan take advantage of HCQ to find a robust class of queries that can be\nevaluated efficiently.\n  In this paper, we search to combine HCQ with sequence patterns to find a\nclass of CER queries that can get the best of both worlds. To reach this goal,\nwe propose a class of complex event automata model called Parallelized Complex\nEvent Automata (PCEA) for evaluating CER queries with correlation (i.e., joins)\nover streams. This model allows us to express sequence patterns and compare\nvalues among tuples, but it also allows us to express conjunctions by\nincorporating a novel form of non-determinism that we call parallelization. We\nshow that for every HCQ (under bag semantics), we can construct an equivalent\nPCEA. Further, we show that HCQ is the biggest class of acyclic CQ that this\nautomata model can define. Then, PCEA stands as a sweet spot that precisely\nexpresses HCQ (i.e., among acyclic CQ) and extends them with sequence patterns.\nFinally, we show that PCEA also inherits the good algorithmic properties of HCQ\nby presenting a streaming evaluation algorithm under sliding windows with\nlogarithmic update time and output-linear delay for the class of PCEA with\nequality predicates.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Formal Languages and Automata Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"syAdl-5QUS_VeLzMG6lCW4OdGJmUAM5Wspw7SHMFKAA","pdfSize":"428573"}
