{"id":"2408.14495","title":"Route to chaos and resonant triads interaction in a truncated Rotating\n  Nonlinear shallow-water model","authors":"Francesco Carbone and Denys Dutykh","authorsParsed":[["Carbone","Francesco",""],["Dutykh","Denys",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 18:26:34 GMT"}],"updateDate":"2024-09-04","timestamp":1724696794000,"abstract":"  The route to chaos and phase dynamics in a rotating shallow-water model were\nrigorously examined using a five-mode Galerkin truncated system with complex\nvariables. This system is valuable for investigating how large/meso-scales\ndestabilize and evolve into chaos. Two distinct transitions into chaotic\nbehaviour were identified as energy levels increased. The initial transition\noccurs through bifurcations following the Feigenbaum sequence. The subsequent\ntransition, at higher energy levels, shows a shift from quasi-periodic states\nto chaotic regimes. The first chaotic state is mainly due to inertial forces\ngoverning nonlinear interactions. The second chaotic state arises from the\nincreased significance of free surface elevation in the dynamics. A novel\nreformulation using phase and amplitude representations for each truncated\nvariable revealed that phase components exhibit a temporal piece-wise locking\nbehaviour, maintaining a constant value for a prolonged interval before an\nabrupt transition of $\\pm\\pi$, while amplitudes remain chaotic. It was observed\nthat phase stability duration decreases with increased energy, leading to chaos\nin phase components at high energy levels. This is attributed to the nonlinear\nterm in the equations, where phase components are introduced through linear\ncombinations of triads with different modes. When locking durations vary across\nmodes, the dynamics result in a stochastic interplay of multiple $\\pi$ phase\nshifts, creating a stochastic dynamic within the coupled phase triads,\nobservable even at minimal energy injections.\n","subjects":["Nonlinear Sciences/Chaotic Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}