{"id":"2408.09458","title":"G2Face: High-Fidelity Reversible Face Anonymization via Generative and\n  Geometric Priors","authors":"Haoxin Yang, Xuemiao Xu, Cheng Xu, Huaidong Zhang, Jing Qin, Yi Wang,\n  Pheng-Ann Heng, Shengfeng He","authorsParsed":[["Yang","Haoxin",""],["Xu","Xuemiao",""],["Xu","Cheng",""],["Zhang","Huaidong",""],["Qin","Jing",""],["Wang","Yi",""],["Heng","Pheng-Ann",""],["He","Shengfeng",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 12:36:47 GMT"}],"updateDate":"2024-08-20","timestamp":1723984607000,"abstract":"  Reversible face anonymization, unlike traditional face pixelization, seeks to\nreplace sensitive identity information in facial images with synthesized\nalternatives, preserving privacy without sacrificing image clarity. Traditional\nmethods, such as encoder-decoder networks, often result in significant loss of\nfacial details due to their limited learning capacity. Additionally, relying on\nlatent manipulation in pre-trained GANs can lead to changes in ID-irrelevant\nattributes, adversely affecting data utility due to GAN inversion inaccuracies.\nThis paper introduces G\\textsuperscript{2}Face, which leverages both generative\nand geometric priors to enhance identity manipulation, achieving high-quality\nreversible face anonymization without compromising data utility. We utilize a\n3D face model to extract geometric information from the input face, integrating\nit with a pre-trained GAN-based decoder. This synergy of generative and\ngeometric priors allows the decoder to produce realistic anonymized faces with\nconsistent geometry. Moreover, multi-scale facial features are extracted from\nthe original face and combined with the decoder using our novel identity-aware\nfeature fusion blocks (IFF). This integration enables precise blending of the\ngenerated facial patterns with the original ID-irrelevant features, resulting\nin accurate identity manipulation. Extensive experiments demonstrate that our\nmethod outperforms existing state-of-the-art techniques in face anonymization\nand recovery, while preserving high data utility. Code is available at\nhttps://github.com/Harxis/G2Face.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}