{"id":"2408.04472","title":"Can LLMs Beat Humans in Debating? A Dynamic Multi-agent Framework for\n  Competitive Debate","authors":"Yiqun Zhang, Xiaocui Yang, Shi Feng, Daling Wang, Yifei Zhang, Kaisong\n  Song","authorsParsed":[["Zhang","Yiqun",""],["Yang","Xiaocui",""],["Feng","Shi",""],["Wang","Daling",""],["Zhang","Yifei",""],["Song","Kaisong",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 14:02:45 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 12:36:06 GMT"}],"updateDate":"2024-08-21","timestamp":1723125765000,"abstract":"  Competitive debate is a complex task of computational argumentation. Large\nLanguage Models (LLMs) suffer from hallucinations and lack competitiveness in\nthis field. To address these challenges, we introduce Agent for Debate\n(Agent4Debate), a dynamic multi-agent framework based on LLMs designed to\nenhance their capabilities in competitive debate. Drawing inspiration from\nhuman behavior in debate preparation and execution, Agent4Debate employs a\ncollaborative architecture where four specialized agents, involving Searcher,\nAnalyzer, Writer, and Reviewer, dynamically interact and cooperate. These\nagents work throughout the debate process, covering multiple stages from\ninitial research and argument formulation to rebuttal and summary. To\ncomprehensively evaluate framework performance, we construct the Competitive\nDebate Arena, comprising 66 carefully selected Chinese debate motions. We\nrecruit ten experienced human debaters and collect records of 200 debates\ninvolving Agent4Debate, baseline models, and humans. The evaluation employs the\nDebatrix automatic scoring system and professional human reviewers based on the\nestablished Debatrix-Elo and Human-Elo ranking. Experimental results indicate\nthat the state-of-the-art Agent4Debate exhibits capabilities comparable to\nthose of humans. Furthermore, ablation studies demonstrate the effectiveness of\neach component in the agent structure.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}