{"id":"2408.07220","title":"Handwritten Code Recognition for Pen-and-Paper CS Education","authors":"Md Sazzad Islam, Moussa Koulako Bala Doumbouya, Christopher D.\n  Manning, Chris Piech","authorsParsed":[["Islam","Md Sazzad",""],["Doumbouya","Moussa Koulako Bala",""],["Manning","Christopher D.",""],["Piech","Chris",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 21:02:17 GMT"}],"updateDate":"2024-08-15","timestamp":1723064537000,"abstract":"  Teaching Computer Science (CS) by having students write programs by hand on\npaper has key pedagogical advantages: It allows focused learning and requires\ncareful thinking compared to the use of Integrated Development Environments\n(IDEs) with intelligent support tools or \"just trying things out\". The familiar\nenvironment of pens and paper also lessens the cognitive load of students with\nno prior experience with computers, for whom the mere basic usage of computers\ncan be intimidating. Finally, this teaching approach opens learning\nopportunities to students with limited access to computers.\n  However, a key obstacle is the current lack of teaching methods and support\nsoftware for working with and running handwritten programs. Optical character\nrecognition (OCR) of handwritten code is challenging: Minor OCR errors, perhaps\ndue to varied handwriting styles, easily make code not run, and recognizing\nindentation is crucial for languages like Python but is difficult to do due to\ninconsistent horizontal spacing in handwriting. Our approach integrates two\ninnovative methods. The first combines OCR with an indentation recognition\nmodule and a language model designed for post-OCR error correction without\nintroducing hallucinations. This method, to our knowledge, surpasses all\nexisting systems in handwritten code recognition. It reduces error from 30\\% in\nthe state of the art to 5\\% with minimal hallucination of logical fixes to\nstudent programs. The second method leverages a multimodal language model to\nrecognize handwritten programs in an end-to-end fashion. We hope this\ncontribution can stimulate further pedagogical research and contribute to the\ngoal of making CS education universally accessible. We release a dataset of\nhandwritten programs and code to support future research at\nhttps://github.com/mdoumbouya/codeocr\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"OTlRHtf_2L9-qHrEsFEH1FgOgqKyV2swSf0zd8T6yr0","pdfSize":"4839635"}
