{"id":"2408.11487","title":"Twist, turn and encounter: the trajectories of small atmospheric\n  particles unravelled","authors":"Taraprasad Bhowmick, Yong Wang, Jonas Latt and Gholamhossein Bagheri","authorsParsed":[["Bhowmick","Taraprasad",""],["Wang","Yong",""],["Latt","Jonas",""],["Bagheri","Gholamhossein",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 09:56:30 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 06:38:15 GMT"}],"updateDate":"2024-08-29","timestamp":1724234190000,"abstract":"  Every solid particle in the atmosphere, from ice crystals and pollen to dust,\nash, and microplastics, is non-spherical. These particles play significant\nroles in Earth's climate system, influencing temperature, weather patterns,\nnatural ecosystems, human health, and pollution levels. However, our\nunderstanding of these particles is largely based on the theories for extremely\nsmall particles and experiments conducted in liquid mediums. In this study, we\nused an innovative experimental setup and particle-resolved numerical\nsimulations to investigate the behaviour of sub-millimetre ellipsoids of\nvarying shapes in the air. Our results revealed complex decaying oscillation\npatterns involving numerous twists and turns in these particles, starkly\ncontrasting their dynamics in liquid mediums. We found that the frequency and\ndecay rate of these oscillations have a strong dependence on the particle\nshape. Interestingly, disk-shaped particles oscillated at nearly twice the\nfrequency of rod-shaped particles, though their oscillations also decayed more\nrapidly. During oscillation, even subtly non-spherical particles can drift\nlaterally up to ten times their volume-equivalent spherical diameter. This\nbehaviour enables particles to sweep through four times more air both\nvertically and laterally compared to a volume-equivalent sphere, significantly\nincreasing their encounter rate and aggregation possibility. Our findings\nprovide an explanation for the long-range transport and naturally occurring\naggregate formation of highly non-spherical particles such as snowflakes and\nvolcanic ash.\n","subjects":["Physics/Fluid Dynamics","Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WoKKkjfyWpYjgQL6c27XIxAICD4NONBH-5QevXDAX7g","pdfSize":"11600911"}
