{"id":"2408.06920","title":"Multi-Agent Continuous Control with Generative Flow Networks","authors":"Shuang Luo, Yinchuan Li, Shunyu Liu, Xu Zhang, Yunfeng Shao, Chao Wu","authorsParsed":[["Luo","Shuang",""],["Li","Yinchuan",""],["Liu","Shunyu",""],["Zhang","Xu",""],["Shao","Yunfeng",""],["Wu","Chao",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 14:12:03 GMT"}],"updateDate":"2024-08-14","timestamp":1723558323000,"abstract":"  Generative Flow Networks (GFlowNets) aim to generate diverse trajectories\nfrom a distribution in which the final states of the trajectories are\nproportional to the reward, serving as a powerful alternative to reinforcement\nlearning for exploratory control tasks. However, the individual-flow matching\nconstraint in GFlowNets limits their applications for multi-agent systems,\nespecially continuous joint-control problems. In this paper, we propose a novel\nMulti-Agent generative Continuous Flow Networks (MACFN) method to enable\nmultiple agents to perform cooperative exploration for various compositional\ncontinuous objects. Technically, MACFN trains decentralized\nindividual-flow-based policies in a centralized global-flow-based matching\nfashion. During centralized training, MACFN introduces a continuous flow\ndecomposition network to deduce the flow contributions of each agent in the\npresence of only global rewards. Then agents can deliver actions solely based\non their assigned local flow in a decentralized way, forming a joint policy\ndistribution proportional to the rewards. To guarantee the expressiveness of\ncontinuous flow decomposition, we theoretically derive a consistency condition\non the decomposition network. Experimental results demonstrate that the\nproposed method yields results superior to the state-of-the-art counterparts\nand better exploration capability. Our code is available at\nhttps://github.com/isluoshuang/MACFN.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multiagent Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}