{"id":"2408.11564","title":"AutoDirector: Online Auto-scheduling Agents for Multi-sensory\n  Composition","authors":"Minheng Ni, Chenfei Wu, Huaying Yuan, Zhengyuan Yang, Ming Gong,\n  Lijuan Wang, Zicheng Liu, Wangmeng Zuo, Nan Duan","authorsParsed":[["Ni","Minheng",""],["Wu","Chenfei",""],["Yuan","Huaying",""],["Yang","Zhengyuan",""],["Gong","Ming",""],["Wang","Lijuan",""],["Liu","Zicheng",""],["Zuo","Wangmeng",""],["Duan","Nan",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 12:18:22 GMT"}],"updateDate":"2024-08-22","timestamp":1724242702000,"abstract":"  With the advancement of generative models, the synthesis of different sensory\nelements such as music, visuals, and speech has achieved significant realism.\nHowever, the approach to generate multi-sensory outputs has not been fully\nexplored, limiting the application on high-value scenarios such as of directing\na film. Developing a movie director agent faces two major challenges: (1) Lack\nof parallelism and online scheduling with production steps: In the production\nof multi-sensory films, there are complex dependencies between different\nsensory elements, and the production time for each element varies. (2) Diverse\nneeds and clear communication demands with users: Users often cannot clearly\nexpress their needs until they see a draft, which requires human-computer\ninteraction and iteration to continually adjust and optimize the film content\nbased on user feedback. To address these issues, we introduce AutoDirector, an\ninteractive multi-sensory composition framework that supports long shots,\nspecial effects, music scoring, dubbing, and lip-syncing. This framework\nimproves the efficiency of multi-sensory film production through automatic\nscheduling and supports the modification and improvement of interactive tasks\nto meet user needs. AutoDirector not only expands the application scope of\nhuman-machine collaboration but also demonstrates the potential of AI in\ncollaborating with humans in the role of a film director to complete\nmulti-sensory films.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"FQJnEJCQIPyfre2a0KA8zdM1ktGx0guDHsG6BA9yCYc","pdfSize":"1411766"}
