{"id":"2408.14601","title":"3D Point Cloud Network Pruning: When Some Weights Do not Matter","authors":"Amrijit Biswas, Md. Ismail Hossain, M M Lutfe Elahi, Ali Cheraghian,\n  Fuad Rahman, Nabeel Mohammed, Shafin Rahman","authorsParsed":[["Biswas","Amrijit",""],["Hossain","Md. Ismail",""],["Elahi","M M Lutfe",""],["Cheraghian","Ali",""],["Rahman","Fuad",""],["Mohammed","Nabeel",""],["Rahman","Shafin",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 19:44:18 GMT"}],"updateDate":"2024-08-28","timestamp":1724701458000,"abstract":"  A point cloud is a crucial geometric data structure utilized in numerous\napplications. The adoption of deep neural networks referred to as Point Cloud\nNeural Networks (PC- NNs), for processing 3D point clouds, has significantly\nadvanced fields that rely on 3D geometric data to enhance the efficiency of\ntasks. Expanding the size of both neural network models and 3D point clouds\nintroduces significant challenges in minimizing computational and memory\nrequirements. This is essential for meeting the demanding requirements of\nreal-world applications, which prioritize minimal energy consumption and low\nlatency. Therefore, investigating redundancy in PCNNs is crucial yet\nchallenging due to their sensitivity to parameters. Additionally, traditional\npruning methods face difficulties as these networks rely heavily on weights and\npoints. Nonetheless, our research reveals a promising phenomenon that could\nrefine standard PCNN pruning techniques. Our findings suggest that preserving\nonly the top p% of the highest magnitude weights is crucial for accuracy\npreservation. For example, pruning 99% of the weights from the PointNet model\nstill results in accuracy close to the base level. Specifically, in the\nModelNet40 dataset, where the base accuracy with the PointNet model was 87. 5%,\npreserving only 1% of the weights still achieves an accuracy of 86.8%. Codes\nare available in: https://github.com/apurba-nsu-rnd-lab/PCNN_Pruning\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XeR-RqRo15iee-rE2zy-ZNXTgh4xtOCZifXrFHl7ouM","pdfSize":"4398779"}
