{"id":"2408.04711","title":"Pore-resolved CFD in Digital Twin of Porous Monoliths Reconstructed by\n  Micro-computed Tomography","authors":"Olivier Gu\\'evremont (1), Lucka Barbeau (1), Vaiana Moreau (2),\n  Federico Galli (3), Nick Virgilio (2), Bruno Blais (1) ((1) CHAOS,\n  Polytechnique Montr\\'eal, (2) CREPEC, Polytechnique Montr\\'eal, (3)\n  Universit\\'e de Sherbrooke)","authorsParsed":[["Guévremont","Olivier",""],["Barbeau","Lucka",""],["Moreau","Vaiana",""],["Galli","Federico",""],["Virgilio","Nick",""],["Blais","Bruno",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 18:23:02 GMT"}],"updateDate":"2024-08-12","timestamp":1723141382000,"abstract":"  Porous media are ubiquitous in the fields of energy storage and conversion,\ncatalysis, biomechanics, hydrogeology, and other chemical engineering\nprocesses. These media possess high surface-to-volume ratios and their complex\nchannels can restrict and direct the flow. This makes them key components of\nmultiple equipment despite the challenges in selecting design parameters for\nspecific applications. Pore-resolved CFD reveals the effects of their structure\nat the microscopic scale, but is currently limited by high computing costs and\nthe performance of mesh generation algorithms. This work introduces a RBF-based\nrepresentation of solids in a massively parallel immersed-boundary framework,\nenabling both the usage of non-conformal grids and dynamic mesh adaptation. We\nverify it using the method of manufactured solutions. We validate it using\npressure drop measurements through porous silicone monoliths digitized by X-ray\ncomputed microtomography for Reynolds numbers up to 30, using grids of 200 M\ncells distributed over 8 k cores. The reliable model is then used to highlight\nthat pore network structure is the main factor describing pressure evolution\nand that preferential channels are present at this scale of the porous media.\nThis work opens the door to design and optimize processes by linking\nmicroscopic flow to macroscopic properties through the usage of physics-based\ndigital twins of complex porous media.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0V9Vn-pK5JXLHdwNmY5wXbW9HnHCSDjBcxoKhHbqq3A","pdfSize":"50081945"}
