{"id":"2408.11414","title":"emPDF: Inferring the Milky Way mass with data-driven distribution\n  function in phase space","authors":"Zhaozhou Li, Jiaxin Han, Wenting Wang, Yong-Zhong Qian, Qingyang Li,\n  Yipeng Jing, Ting S. Li","authorsParsed":[["Li","Zhaozhou",""],["Han","Jiaxin",""],["Wang","Wenting",""],["Qian","Yong-Zhong",""],["Li","Qingyang",""],["Jing","Yipeng",""],["Li","Ting S.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 08:19:55 GMT"}],"updateDate":"2024-08-22","timestamp":1724228395000,"abstract":"  We introduce the emPDF (Empirical Distribution Function), a novel dynamical\nmodeling method that infers the gravitational potential from kinematic tracers\nwith optimal statistical efficiency under the minimal assumption of steady\nstate. emPDF determines the best-fit potential by maximizing the similarity\nbetween instantaneous kinematics and the time-averaged phase-space distribution\nfunction (DF), which is empirically constructed from observation upon the\ntheoretical foundation of oPDF (Han et al. 2016). This approach eliminates the\nneed for presumed functional forms of DFs or orbit libraries required by\nconventional DF- or orbit-based methods. emPDF stands out for its flexibility,\nefficiency, and capability in handling observational effects, making it\npreferable to the popular Jeans equation or other minimal assumption methods,\nespecially for the Milky Way (MW) outer halo where tracers often have limited\nsample size and poor data quality. We apply emPDF to infer the MW mass profile\nusing Gaia DR3 data of satellite galaxies and globular clusters, obtaining\nconsistent measurements with the constraints from simulation-informed DF\nfitting (Li et al. 2020). While the simulation-informed DF offers superior\nprecision owing to the additional information extracted from simulations, emPDF\nis independent of such supplementary knowledge and applicable to general tracer\npopulations. We provide tabulated measurements of the mass profile from emPDF,\nalong with updated measurements from simulation-informed DF.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}