{"id":"2408.13012","title":"Personalised Medicine: Establishing predictive machine learning models\n  for drug responses in patient derived cell culture","authors":"Abbi Abdel-Rehim, Oghenejokpeme Orhobor, Gareth Griffiths, Larisa\n  Soldatova, and Ross D. King","authorsParsed":[["Abdel-Rehim","Abbi",""],["Orhobor","Oghenejokpeme",""],["Griffiths","Gareth",""],["Soldatova","Larisa",""],["King","Ross D.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 11:58:50 GMT"}],"updateDate":"2024-08-26","timestamp":1724414330000,"abstract":"  The concept of personalised medicine in cancer therapy is becoming\nincreasingly important. There already exist drugs administered specifically for\npatients with tumours presenting well-defined mutations. However, the field is\nstill in its infancy, and personalised treatments are far from being standard\nof care. Personalised medicine is often associated with the utilisation of\nomics data. Yet, implementation of multi-omics data has proven difficult, due\nto the variety and scale of the information within the data, as well as the\ncomplexity behind the myriad of interactions taking place within the cell. An\nalternative approach to precision medicine is to employ a function-based\nprofile of the cell. This involves screening a range of drugs against patient\nderived cells. Here we demonstrate a proof-of-concept, where a collection of\ndrug screens against a highly diverse set of patient-derived cell lines, are\nleveraged to identify putative treatment options for a 'new patient'. We show\nthat this methodology is highly efficient in ranking the drugs according to\ntheir activity towards the target cells. We argue that this approach offers\ngreat potential, as activities can be efficiently imputed from various subsets\nof the drug treated cell lines that do not necessarily originate from the same\ntissue type.\n","subjects":["Quantitative Biology/Biomolecules","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"GQSRi0EUDyExM7-79lQwFDjr5jo78Jt7S03K3LZJH2U","pdfSize":"593386"}
