{"id":"2408.10017","title":"General Impedance Modeling for Modular Multilevel Converter with\n  Grid-forming and Grid-following Control","authors":"Chu Sun, Fei Zhang, Huafeng Xiao, Na Wang, Jikai Chen","authorsParsed":[["Sun","Chu",""],["Zhang","Fei",""],["Xiao","Huafeng",""],["Wang","Na",""],["Chen","Jikai",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 14:11:56 GMT"}],"updateDate":"2024-08-20","timestamp":1724076716000,"abstract":"  Modular multilevel converter (MMC) has complex topology, control architecture\nand broadband harmonic spectrum. For this, linear-time-periodic (LTP) theory,\ncovering multi-harmonic coupling relations, has been adopted for MMC impedance\nmodeling recently. However, the existing MMC impedance models usually lack\nexplicit expressions and general modeling procedure for different control\nstrategies. To this end, this paper proposes a general impedance modeling\nprocedure applicable to various power converters with grid-forming and\ngrid-following control strategies. The modeling is based on a unified\nrepresentation of MMC circuit as the input and output relation between the\nvoltage or current on the AC side and the exerted modulation index, while the\ncontrol part vice versa, thereby interconnected as closed-loop feedback. With\neach part expressed as transfer functions, the final impedance model keeps the\nexplicit form of harmonic transfer function matrix, making it convenient to\ndirectly observe and analyze the influence of each part individually. Thereby\nthe submodule capacitance is found as the main cause of difference between MMC\nimpedance compared to two-level converter, which will get closer as the\ncapacitance increases. Effectiveness and generality of the impedance modeling\nmethod is demonstrated through comprehensive comparison with impedance scanning\nusing electromagnetic transient simulation.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}