{"id":"2408.17122","title":"Mapping and characterizing magnetic fields in the Rho Ophiuchus-A\n  molecular cloud with SOFIA/HAWC$+$","authors":"Ng\\^an L\\^e, Le Ngoc Tram, Agata Karska, Thiem Hoang, Pham Ngoc Diep,\n  Micha{\\l} Hanasz, Nguyen Bich Ngoc, Nguyen Thi Phuong, Karl M. Menten,\n  Friedrich Wyrowski, Dieu D. Nguyen, Thuong Duc Hoang, and Nguyen Minh Khang","authorsParsed":[["Lê","Ngân",""],["Tram","Le Ngoc",""],["Karska","Agata",""],["Hoang","Thiem",""],["Diep","Pham Ngoc",""],["Hanasz","Michał",""],["Ngoc","Nguyen Bich",""],["Phuong","Nguyen Thi",""],["Menten","Karl M.",""],["Wyrowski","Friedrich",""],["Nguyen","Dieu D.",""],["Hoang","Thuong Duc",""],["Khang","Nguyen Minh",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 09:04:51 GMT"},{"version":"v2","created":"Wed, 11 Sep 2024 03:05:35 GMT"}],"updateDate":"2024-09-12","timestamp":1725008691000,"abstract":"  (abridged) Together with gravity, turbulence, and stellar feedback, magnetic\nfields (B-fields) are thought to play a critical role in the evolution of\nmolecular clouds and star formation processes. We aim to map the morphology and\nmeasure the strength of B-fields of the nearby molecular cloud, rho Ophiuchus-A\n($\\rho$ Oph-A), and then to understand the role of B-fields in regulating star\nformation and shaping the cloud. We have analyzed the far-infrared (FIR)\npolarization of thermal dust emission observed by SOFIA/HAWC$+$ at 89 and 154\n$\\mu$m toward the densest part of $\\rho$ Oph-A, which is irradiated by the\nnearby B3/4 star, Oph-S1. The cloud exhibits well-ordered B-fields with\nmagnetic orientations mainly perpendicular to the ridge of the cloud toward the\ndensest region and B-field strengths are in the range of 0.2-2.5 mG, using the\nDavis-Chandrasekhar-Fermi method. The B-fields are strongest at the densest\npart of the cloud, which is associated with the starless core SM1, and\ndecreases toward the outskirts of the cloud. By calculating the map of the\nmass-to-flux ratio, Alfv\\'en Mach number, and plasma $\\beta$ parameter in\n$\\rho$ Oph-A, we find that the cloud is predominantly magnetically\nsub-critical, sub-Alfv\\'enic, which implies that the cloud is supported by\nstrong B-fields that dominate over gravity, turbulence, and thermal gas energy.\nMeasured B-field strengths at two densest subregions using other methods that\naccount for the compressible mode are relatively lower than that measured with\nthe DCF method but do not significantly change our conclusions on the roles of\nB-fields relative to gravity and turbulence on star formation. A virial\nanalysis suggests that the cloud is gravitationally unbound. We find that\nB-fields are sufficiently strong to support the cloud against radiative\nfeedback and to regulate the shape of the cloud.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}