{"id":"2408.11012","title":"Discriminant Analysis in stationary time series based on robust cepstral\n  coefficients","authors":"Jonathan de Souza Matias and Valderio Anselmo Reisen","authorsParsed":[["Matias","Jonathan de Souza",""],["Reisen","Valderio Anselmo",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 17:06:16 GMT"}],"updateDate":"2024-08-21","timestamp":1724173576000,"abstract":"  Time series analysis is crucial in fields like finance, economics,\nenvironmental science, and biomedical engineering, aiding in forecasting,\npattern identification, and understanding underlying mechanisms. While\ntraditional time-domain methods focus on trends and seasonality, they often\nmiss periodicities better captured in the frequency domain. Analyzing time\nseries in the frequency domain uncovers spectral properties, offering deeper\ninsights into underlying processes, aiding in differentiating data-generating\nprocesses of various populations, and assisting in classification. Common\napproaches use smoothed estimators, such as the smoothed periodogram, to\nminimize bias by averaging spectra from individual replicates within a\npopulation. However, these methods struggle with spectral variability among\nreplicates, and abrupt values can skew estimators, complicating discrimination\nand classification. There's a gap in the literature for methods that account\nfor within-population spectral variability, separate white noise effects from\nautocorrelations, and employ robust estimators in the presence of outliers.\nThis paper fills that gap by introducing a robust framework for classifying\ntime series groups. The process involves transforming time series into the\nfrequency domain using the Fourier Transform, computing the power spectrum, and\nusing the inverse Fourier Transform to obtain the cepstrum. To enhance spectral\nestimates' robustness and consistency, we apply the multitaper periodogram and\nthe M-periodogram. These features are then used in Linear Discriminant Analysis\n(LDA) to improve classification accuracy and interpretability, offering a\npowerful tool for precise temporal pattern distinction and resilience to data\nanomalies.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}