{"id":"2408.13896","title":"RT-Attack: Jailbreaking Text-to-Image Models via Random Token","authors":"Sensen Gao, Xiaojun Jia, Yihao Huang, Ranjie Duan, Jindong Gu, Yang\n  Liu, Qing Guo","authorsParsed":[["Gao","Sensen",""],["Jia","Xiaojun",""],["Huang","Yihao",""],["Duan","Ranjie",""],["Gu","Jindong",""],["Liu","Yang",""],["Guo","Qing",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 17:33:40 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 15:13:01 GMT"}],"updateDate":"2024-08-28","timestamp":1724607220000,"abstract":"  Recently, Text-to-Image(T2I) models have achieved remarkable success in image\ngeneration and editing, yet these models still have many potential issues,\nparticularly in generating inappropriate or Not-Safe-For-Work(NSFW) content.\nStrengthening attacks and uncovering such vulnerabilities can advance the\ndevelopment of reliable and practical T2I models. Most of the previous works\ntreat T2I models as white-box systems, using gradient optimization to generate\nadversarial prompts. However, accessing the model's gradient is often\nimpossible in real-world scenarios. Moreover, existing defense methods, those\nusing gradient masking, are designed to prevent attackers from obtaining\naccurate gradient information. While some black-box jailbreak attacks have been\nexplored, these typically rely on simply replacing sensitive words, leading to\nsuboptimal attack performance. To address this issue, we introduce a two-stage\nquery-based black-box attack method utilizing random search. In the first\nstage, we establish a preliminary prompt by maximizing the semantic similarity\nbetween the adversarial and target harmful prompts. In the second stage, we use\nthis initial prompt to refine our approach, creating a detailed adversarial\nprompt aimed at jailbreaking and maximizing the similarity in image features\nbetween the images generated from this prompt and those produced by the target\nharmful prompt. Extensive experiments validate the effectiveness of our method\nin attacking the latest prompt checkers, post-hoc image checkers, securely\ntrained T2I models, and online commercial models.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}