{"id":"2408.15570","title":"Direct sum theorems beyond query complexity","authors":"Daiki Suruga","authorsParsed":[["Suruga","Daiki",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 06:53:29 GMT"}],"updateDate":"2024-08-29","timestamp":1724828009000,"abstract":"  A fundamental question in computer science is: \\emph{Is it harder to solve\n$n$ instances independently than to solve them simultaneously?} This question,\nknown as the direct sum question or direct sum theorem, has been paid much\nattention in several research fields. Despite its importance, however, little\nhas been discovered in many other research fields.\n  In this paper, we introduce a novel framework that extends to\nclassical/quantum query complexity, PAC-learning for machine learning,\nstatistical estimation theory, and more. Within this framework, we establish\nseveral fundamental direct sum theorems. The main contributions of this paper\ninclude: (i) establishing a complete characterization of the amortized\nquery/oracle complexities, and (ii) proving tight direct sum theorems when the\nerror is small. Note that in our framework, every oracle access needs to be\nperformed \\emph{classically} even in the quantum setting. This can be thought\nof one limitation of this work.\n  As a direct consequence of our results, we obtain the following: (A) The\nfirst known asymptotic separation of the randomized query complexity.\nSpecifically, we show that there is a function $f: \\{0, 1\\}^k \\to \\{0, 1\\}$ and\nsmall error $\\varepsilon > 0$ such that solving $n$ instances simultaneously\nrequires the query complexity $\\tilde{O}(n\\sqrt{k})$ but solving one instance\nwith the same error has the complexity $\\tilde{\\Omega}(k)$. In communication\ncomplexity this type of separation was previously given in~Feder, Kushilevitz,\nNaor and Nisan (1995). (B) The query complexity counterpart of the\n``information = amortized communication\" relation, one of the most influential\nresults in communication complexity shown by Braverman and Rao (2011) and\nfurther investigated by Braverman (2015).\n  We hope that our results will provide further interesting applications in the\nfuture.\n","subjects":["Computing Research Repository/Computational Complexity","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Gh7nx_693CH78ZLrqd71IJa-hr09b3XrOv9tJsofvMo","pdfSize":"750413"}
