{"id":"2408.16884","title":"Characterization of AlGaAs/GeSn heterojunction band alignment via X-ray\n  photoelectron spectroscopy","authors":"Yang Liu, Jiarui Gong, Sudip Acharya, Yiran Lia, Alireza Abrand,\n  Justin M. Rudie, Jie Zhou, Yi Lu, Haris Naeem Abbasi, Daniel Vincent, Samuel\n  Haessly, Tsung-Han Tsai, Parsian K. Mohseni, Shui-Qing Yu, and Zhenqiang Ma","authorsParsed":[["Liu","Yang",""],["Gong","Jiarui",""],["Acharya","Sudip",""],["Lia","Yiran",""],["Abrand","Alireza",""],["Rudie","Justin M.",""],["Zhou","Jie",""],["Lu","Yi",""],["Abbasi","Haris Naeem",""],["Vincent","Daniel",""],["Haessly","Samuel",""],["Tsai","Tsung-Han",""],["Mohseni","Parsian K.",""],["Yu","Shui-Qing",""],["Ma","Zhenqiang",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 20:15:13 GMT"}],"updateDate":"2024-09-02","timestamp":1724962513000,"abstract":"  GeSn-based SWIR lasers featuring imaging, sensing, and communications has\ngained dynamic development recently. However, the existing SiGeSn/GeSn double\nheterostructure lacks adequate electron confinement and is insufficient for\nroom temperature lasing. The recently demonstrated semiconductor grafting\ntechnique provides a viable approach towards AlGaAs/GeSn p-i-n heterojunctions\nwith better electron confinement and high-quality interfaces, promising for\nroom temperature electrically pumped GeSn laser devices. Therefore,\nunderstanding and quantitatively characterizing the band alignment in this\ngrafted heterojunction is crucial. In this study, we explore the band alignment\nin the grafted monocrystalline Al0.3Ga0.7As /Ge0.853Sn0.147 p-i-n\nheterojunction. We determined the bandgap values of AlGaAs and GeSn to be 1.81\neV and 0.434 eV by photoluminescence measurements, respectively. We further\nconducted X-ray photoelectron spectroscopy measurements and extracted a valence\nband offset of 0.19 eV and a conduction band offset of 1.186 eV. A Type-I band\nalignment was confirmed which effectively confining electrons at the\nAlGaAs/GeSn interface. This study improves our understanding of the interfacial\nband structure in grafted AlGaAs/GeSn heterostructure, providing experimental\nevidence of the Type-I band alignment between AlGaAs and GeSn, and paving the\nway for their application in laser technologies.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}