{"id":"2408.07825","title":"SSRFlow: Semantic-aware Fusion with Spatial Temporal Re-embedding for\n  Real-world Scene Flow","authors":"Zhiyang Lu and Qinghan Chen and Zhimin Yuan and Ming Cheng","authorsParsed":[["Lu","Zhiyang",""],["Chen","Qinghan",""],["Yuan","Zhimin",""],["Cheng","Ming",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 02:28:40 GMT"}],"updateDate":"2024-08-16","timestamp":1722392920000,"abstract":"  Scene flow, which provides the 3D motion field of the first frame from two\nconsecutive point clouds, is vital for dynamic scene perception. However,\ncontemporary scene flow methods face three major challenges. Firstly, they lack\nglobal flow embedding or only consider the context of individual point clouds\nbefore embedding, leading to embedded points struggling to perceive the\nconsistent semantic relationship of another frame. To address this issue, we\npropose a novel approach called Dual Cross Attentive (DCA) for the latent\nfusion and alignment between two frames based on semantic contexts. This is\nthen integrated into Global Fusion Flow Embedding (GF) to initialize flow\nembedding based on global correlations in both contextual and Euclidean spaces.\nSecondly, deformations exist in non-rigid objects after the warping layer,\nwhich distorts the spatiotemporal relation between the consecutive frames. For\na more precise estimation of residual flow at next-level, the Spatial Temporal\nRe-embedding (STR) module is devised to update the point sequence features at\ncurrent-level. Lastly, poor generalization is often observed due to the\nsignificant domain gap between synthetic and LiDAR-scanned datasets. We\nleverage novel domain adaptive losses to effectively bridge the gap of motion\ninference from synthetic to real-world. Experiments demonstrate that our\napproach achieves state-of-the-art (SOTA) performance across various datasets,\nwith particularly outstanding results in real-world LiDAR-scanned situations.\nOur code will be released upon publication.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rMo08EQI-fZ_huhjVQKzAhgpoZcneM1pL9e5hwP3NAQ","pdfSize":"4125165"}
