{"id":"2408.07836","title":"Learned Single-Pass Multitasking Perceptual Graphics for Immersive\n  Displays","authors":"Do\\u{g}a Y{\\i}lmaz, Towaki Takikawa, Duygu Ceylan, Kaan Ak\\c{s}it","authorsParsed":[["Yılmaz","Doğa",""],["Takikawa","Towaki",""],["Ceylan","Duygu",""],["Akşit","Kaan",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 19:05:00 GMT"}],"updateDate":"2024-08-16","timestamp":1722452700000,"abstract":"  Immersive displays are advancing rapidly in terms of delivering perceptually\nrealistic images by utilizing emerging perceptual graphics methods such as\nfoveated rendering. In practice, multiple such methods need to be performed\nsequentially for enhanced perceived quality. However, the limited power and\ncomputational resources of the devices that drive immersive displays make it\nchallenging to deploy multiple perceptual models simultaneously.\n  We address this challenge by proposing a computationally-lightweight,\ntext-guided, learned multitasking perceptual graphics model. Given RGB input\nimages, our model outputs perceptually enhanced images by performing one or\nmore perceptual tasks described by the provided text prompts. Our model\nsupports a variety of perceptual tasks, including foveated rendering, dynamic\nrange enhancement, image denoising, and chromostereopsis, through multitask\nlearning. Uniquely, a single inference step of our model supports different\npermutations of these perceptual tasks at different prompted rates (i.e.,\nmildly, lightly), eliminating the need for daisy-chaining multiple models to\nget the desired perceptual effect. We train our model on our new dataset of\nsource and perceptually enhanced images, and their corresponding text prompts.\nWe evaluate our model's performance on embedded platforms and validate the\nperceptual quality of our model through a user study. Our method achieves\non-par quality with the state-of-the-art task-specific methods using a single\ninference step, while offering faster inference speeds and flexibility to blend\neffects at various intensities.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}