{"id":"2408.12859","title":"Programmable Jumping-Droplet Condensation","authors":"Shan Gao, Jian Qu, Dehui Wang, Zhichun Liu and Weigang Ma","authorsParsed":[["Gao","Shan",""],["Qu","Jian",""],["Wang","Dehui",""],["Liu","Zhichun",""],["Ma","Weigang",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 05:58:43 GMT"}],"updateDate":"2024-08-26","timestamp":1724392723000,"abstract":"  Self-propelled droplet jumping during condensation has attractive prospects\nfor energy harvesting, water collection and thermal management, but its\nreal-life applications are greatly limited to the challenge of enabling a\nsustainable control on the entire droplet lifecycle. Herein, we propose a\nprogrammable jumping-droplet condensation that evolves along an artificially\ndesigned pathway without external stimulations, where the droplets can\nuniformly form at specific sites, spontaneously migrate and coalesce with their\nneighboring droplets, and jump off effectively to continuously refresh surface,\nsignificantly enhancing the heat transfer performance and durability of\ncondensation. The programmable jumping-droplet condensation is achieved using a\nwedge-walled rhombus lattice structure surface inspired from the structures and\nfunctions of Namib desert beetle skin, shorebird beak and setaria viridis leaf\nvein. This surface integrates wetting contrast patterns with dual-gradient\nhierarchical structures, providing persistent and multidimensional droplet\nrectifications and thus realizing a sustainable control on the entire droplet\nlifecycle. Furthermore, we systematically investigate the morphology and\nbehavior evolutions of droplets throughout their entire lifecycle, and fully\nelucidate the programmable control mechanisms of the lattice structure\ndetermined by its topology and wettability features. This work not only serves\nas theoretical foundations and reference framework to realize a durable\njumping-droplet condensation and achieve its performance ceiling in a\ncontrolled manner, but also promotes the design and fabrication of functional\nstructured surfaces for droplet manipulation and delivery, self-cleaning and\nanti-fogging/icing.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}