{"id":"2408.03895","title":"Variable Landscape Search: A Novel Metaheuristic Paradigm for Unlocking\n  Hidden Dimensions in Global Optimization","authors":"Rustam Mussabayev and Ravil Mussabayev","authorsParsed":[["Mussabayev","Rustam",""],["Mussabayev","Ravil",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 16:48:32 GMT"}],"updateDate":"2024-08-08","timestamp":1723049312000,"abstract":"  This paper presents the Variable Landscape Search (VLS), a novel\nmetaheuristic designed to globally optimize complex problems by dynamically\naltering the objective function landscape. Unlike traditional methods that\noperate within a static search space, VLS introduces an additional level of\nflexibility and diversity to the global optimization process. It does this by\ncontinuously and iteratively varying the objective function landscape through\nslight modifications to the problem formulation, the input data, or both. The\ninnovation of the VLS metaheuristic stems from its unique capability to\nseamlessly fuse dynamic adaptations in problem formulation with modifications\nin input data. This dual-modality approach enables continuous exploration of\ninterconnected and evolving search spaces, significantly enhancing the\npotential for discovering optimal solutions in complex, multi-faceted\noptimization scenarios, making it adaptable across various domains. In this\npaper, one of the theoretical results is obtained in the form of a\ngeneralization of the following three alternative metaheuristics, which have\nbeen reduced to special cases of VLS: Variable Formulation Search (VFS),\nFormulation Space Search (FSS), and Variable Search Space (VSS). As a practical\napplication, the paper demonstrates the superior efficiency of a recent big\ndata clustering algorithm through its conceptualization using the VLS paradigm.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"s4r01la5oqjDpVRuDZ9aIKrNQEc0vWY5MvNb_n1a1M4","pdfSize":"258434"}
