{"id":"2408.16003","title":"Meta-Learning for Federated Face Recognition in Imbalanced Data Regimes","authors":"Arwin Gansekoele, Emiel Hess, Sandjai Bhulai","authorsParsed":[["Gansekoele","Arwin",""],["Hess","Emiel",""],["Bhulai","Sandjai",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 14:03:10 GMT"}],"updateDate":"2024-08-30","timestamp":1723557790000,"abstract":"  The growing privacy concerns surrounding face image data demand new\ntechniques that can guarantee user privacy. One such face recognition technique\nthat claims to achieve better user privacy is Federated Face Recognition (FRR),\na subfield of Federated Learning (FL). However, FFR faces challenges due to the\nheterogeneity of the data, given the large number of classes that need to be\nhandled. To overcome this problem, solutions are sought in the field of\npersonalized FL. This work introduces three new data partitions based on the\nCelebA dataset, each with a different form of data heterogeneity. It also\nproposes Hessian-Free Model Agnostic Meta-Learning (HF-MAML) in an FFR setting.\nWe show that HF-MAML scores higher in verification tests than current FFR\nmodels on three different CelebA data partitions. In particular, the\nverification scores improve the most in heterogeneous data partitions. To\nbalance personalization with the development of an effective global model, an\nembedding regularization term is introduced for the loss function. This term\ncan be combined with HF-MAML and is shown to increase global model verification\nperformance. Lastly, this work performs a fairness analysis, showing that\nHF-MAML and its embedding regularization extension can improve fairness by\nreducing the standard deviation over the client evaluation scores.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}