{"id":"2408.02011","title":"Isolating Signatures of Cyberattacks under Stressed Grid Conditions","authors":"Sanchita Ghosh, Syed Ahsan Raza Naqvi, Sai Pushpak Nandanoori, and\n  Soumya Kundu","authorsParsed":[["Ghosh","Sanchita",""],["Naqvi","Syed Ahsan Raza",""],["Nandanoori","Sai Pushpak",""],["Kundu","Soumya",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 12:36:00 GMT"}],"updateDate":"2024-08-06","timestamp":1722774960000,"abstract":"  In a controlled cyber-physical network, such as a power grid, any malicious\ndata injection in the sensor measurements can lead to widespread impact due to\nthe actions of the closed-loop controllers. While fast identification of the\nattack signatures is imperative for reliable operations, it is challenging to\ndo so in a large dynamical network with tightly coupled nodes. A particularly\nchallenging scenario arises when the cyberattacks are strategically launched\nduring a grid stress condition, caused by non-malicious physical disturbances.\nIn this work, we propose an algorithmic framework -- based on Koopman mode (KM)\ndecomposition -- for online identification and visualization of the cyberattack\nsignatures in streaming time-series measurements from a power network. The KMs\nare capable of capturing the spatial embedding of both natural and anomalous\nmodes of oscillations in the sensor measurements and thus revealing the\nspecific influences of cyberattacks, even under existing non-malicious grid\nstress events. Most importantly, it enables us to quantitatively compare the\noutcomes of different potential cyberattacks injected by an attacker. The\nperformance of the proposed algorithmic framework is illustrated on the IEEE\n68-bus test system using synthetic attack scenarios. Such knowledge regarding\nthe detection of various cyberattacks will enable us to devise appropriate\ndiagnostic scheme while considering varied constraints arising from different\nattacks.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control","Mathematics/Dynamical Systems","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}