{"id":"2408.00637","title":"High-latitude coronal mass ejections on the young solar-like star AB Dor","authors":"K. Markus Strickert, Dag Evensberget, Aline A. Vidotto","authorsParsed":[["Strickert","K. Markus",""],["Evensberget","Dag",""],["Vidotto","Aline A.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 15:24:04 GMT"}],"updateDate":"2024-08-02","timestamp":1722525844000,"abstract":"  AB Dor is a young solar-type star with a surface large-scale magnetic field\n$10^2$ to $10^3$ times stronger than the that of the Sun. Although strong\nmagnetic fields are thought to inhibit coronal mass ejections (CMEs), dimming\nsignatures typically associated with an eruptive CME were recently observed in\nAB Dor. The uninterrupted, long-duration dimming signal suggests that a CME\ntook place at a high latitude, where it remained in view as the star rotates. A\nhigh-latitude CME is also consistent with observations that indicate that AB\nDor hosts polar active regions. To investigate magnetic confinement in AB Dor,\nwe conduct a parametric modelling study of twenty-one CMEs at latitudes $\\sim\n60^\\circ$, varying the location, mass and magnetic field strength of an\ninjected flux rope. Twelve models had the flux rope located in an open magnetic\nfield region, while the remaining nine were in a closed region. Results show\nthat CMEs in open-field regions are in general more likely to erupt. The four\neruptive CMEs from closed regions had high free magnetic energies $\\gtrsim\n3\\times 10^{35}$ erg, and ten CMEs, predominantly from the closed-field regions\n(8/10) were confined. CMEs in closed-field regions exhibited lower kinetic\nenergies, since part of the CME energy was expended to overcome magnetic\ntension and break open the overlying field. In conclusion our work suggests\nthat eruptive CMEs in AB Dor may occur in high-latitude regions of open\nmagnetic field, as the magnetic tension in such regions does not significantly\ninhibit the eruption.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}