{"id":"2408.10704","title":"$\\Lambda$CDM model against cosmography: A possible deviation after DESI\n  2024","authors":"Saeed Pourojaghi, Mohammad Malekjani and Zahra Davari","authorsParsed":[["Pourojaghi","Saeed",""],["Malekjani","Mohammad",""],["Davari","Zahra",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 09:59:06 GMT"}],"updateDate":"2024-08-21","timestamp":1724147946000,"abstract":"  In this study, we present an analysis of the standard flat-$\\Lambda$CDM model\nusing a cosmographic approach, incorporating recent DESI BAO observations and\nSupernovae Type Ia catalogues (SNIa), including the DES-SN5YR and Pantheon+\ncompilations. We find full consistency between the standard model and the\ncosmographic approach when considering DESI BAO and SNIa catalogues\nindependently. When combining DESI BAO with SNIa data, we examine the impact of\nthe Planck prior on the sound horizon at the drag epoch, $r_d$, and the Cepheid\nprior on the absolute magnitude, $M$. Applying the Planck prior on $r_d$ alone\nyields an $H_0$ value consistent with the Planck measurement, while applying\nthe Cepheid prior on $M$ alone results in an $H_0$ value consistent with the\nSH0ES measurement. Without any priors, the $H_0$ value obtained has a large\nerror margin, reconciling the Planck and SH0ES measurements. In all cases where\nindividual priors are applied, we observe no significant tension between the\nflat-$\\Lambda$CDM model and the cosmographic approach. However, when both\nPlanck and Cepheid priors are applied simultaneously, significant tensions\narise between the model and cosmography. This tension is even more pronounced\nwhen excluding LRG1 and LRG2 from the DESI measurements. These results suggest\nthat the standard model cannot simultaneously align with both high-redshift\nPlanck CMB observations and local Cepheid measurements.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}