{"id":"2408.02086","title":"A Bregman-Sinkhorn Algorithm for the Maximum Weight Independent Set\n  Problem","authors":"Stefan Haller, Bogdan Savchynskyy","authorsParsed":[["Haller","Stefan",""],["Savchynskyy","Bogdan",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 16:51:57 GMT"},{"version":"v2","created":"Sat, 24 Aug 2024 21:38:50 GMT"}],"updateDate":"2024-08-27","timestamp":1722790317000,"abstract":"  We propose a scalable approximate algorithm for the NP-hard maximum-weight\nindependent set problem. The core of our algorithm is a dual coordinate descent\napplied to a smoothed LP relaxation of the problem. This technique is referred\nto as Bregman method or Sinkhorn algorithm in the literature. Our algorithm\naddresses a family of clique cover LP relaxations, where the constraints are\ndetermined by the set of cliques covering the underlying graph. The objective\nfunction of the relaxation is smoothed with an entropy term.\n  An important question determining efficiency of our algorithm is the control\nof the smoothing level over the course of optimization. While several dedicated\ntechniques have been considered in the literature to this end, we propose a new\none based on estimation of the relaxed duality gap. To make this estimation\npossible, we developed a new projection method to the feasible set of the\nconsidered LP relaxation. We experimentally show that our technique notably\noutperforms the standard one based on feasibility estimation.\n  Additionally to solving the relaxed dual, we utilize a simple and very\nefficient primal heuristic to obtain feasible integer solutions of the initial\nnon-relaxed problem. Our heuristic is a combination of the greedy generation\nand optimal recombination applied to the reduced costs computed by the dual\noptimization.\n  Our experimental validation considers two datasets based on real-life\napplications, where our method shows competitive results being able to find\nhigh quality approximate solutions within 10 seconds for graphs with hundreds\nof thousands of nodes and dozens of millions of edges.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}