{"id":"2408.11028","title":"Radiation Resilience of $\\beta$-Ga$_2$O$_3$ Schottky Barrier Diodes\n  Under High Dose Gamma Radiation","authors":"Saleh Ahmed Khan, Sudipto Saha, Uttam Singisetti, A F M Anhar Uddin\n  Bhuiyan","authorsParsed":[["Khan","Saleh Ahmed",""],["Saha","Sudipto",""],["Singisetti","Uttam",""],["Bhuiyan","A F M Anhar Uddin",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 17:30:28 GMT"}],"updateDate":"2024-08-21","timestamp":1724175028000,"abstract":"  A systematic investigation of the electrical characteristics of\n$\\beta$-Ga$_2$O$_3$ Schottky barrier diodes (SBDs) has been conducted under\nhigh dose $^{60}$Co gamma radiation up to 5 Mrad (Si). Initial exposure of the\ndiodes to 1 Mrad (Si) resulted in a significant decrease in on-current by\n$\\sim$78% and an increase in on-resistance from $\\sim$3 m$\\Omega \\cdot$cm$^2$\nto $\\sim$14 m$\\Omega \\cdot$cm$^2$ compared to the pre-radiation condition,\nlikely due to the generation of radiation-induced deep-level acceptor traps.\nHowever, upon exposure to higher doses of gamma radiation (3 and 5 Mrad (Si))\nover a prolonged duration, the device performance partially recovered due to a\nradiation annealing effect. This effect is facilitated by secondary electrons\ngenerated through Compton scattering, which dissipate kinetic energy as heat\nthroughout the lattice, thereby annealing the trapping centers responsible for\ndevice performance degradation. The capacitance-voltage (C-V) characterization\nrevealed that the net carrier concentration in the $\\beta$-Ga$_2$O$_3$ drift\nlayer reduced from $\\sim$3.19 $\\times$ 10$^{16}$ cm$^{-3}$ to $\\sim$3.05\n$\\times$ 10$^{16}$ cm$^{-3}$ after 5 Mrad (Si) irradiation.\nTemperature-dependent I-V characteristics showed that irradiation leads to a\nreduction in both forward and reverse current across all investigated\ntemperatures ranging from 25 to 250$^\\circ$C, accompanied by slight increases\nin on-resistance, ideality factors, and Schottky barrier heights. The reverse\nbreakdown characteristics of the $\\beta$-Ga$_2$O$_3$ SBDs showed a slight\nincrease of the breakdown voltage after radiation. Overall, $\\beta$-Ga$_2$O$_3$\nSchottky diode exhibits high resilience to gamma irradiation, with performance\ndegradation mitigated by radiation-induced self-recovery, highlighting its\npotential for radiation-hardened electronic applications in extreme\nenvironments.\n","subjects":["Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}