{"id":"2408.15542","title":"Kangaroo: A Powerful Video-Language Model Supporting Long-context Video\n  Input","authors":"Jiajun Liu, Yibing Wang, Hanghang Ma, Xiaoping Wu, Xiaoqi Ma, Xiaoming\n  Wei, Jianbin Jiao, Enhua Wu, Jie Hu","authorsParsed":[["Liu","Jiajun",""],["Wang","Yibing",""],["Ma","Hanghang",""],["Wu","Xiaoping",""],["Ma","Xiaoqi",""],["Wei","Xiaoming",""],["Jiao","Jianbin",""],["Wu","Enhua",""],["Hu","Jie",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 05:34:14 GMT"}],"updateDate":"2024-08-29","timestamp":1724823254000,"abstract":"  Rapid advancements have been made in extending Large Language Models (LLMs)\nto Large Multi-modal Models (LMMs). However, extending input modality of LLMs\nto video data remains a challenging endeavor, especially for long videos. Due\nto insufficient access to large-scale high-quality video data and the excessive\ncompression of visual features, current methods exhibit limitations in\neffectively processing long videos. In this paper, we introduce Kangaroo, a\npowerful Video LMM aimed at addressing these challenges. Confronted with issue\nof inadequate training data, we develop a data curation system to build a\nlarge-scale dataset with high-quality annotations for vision-language\npre-training and instruction tuning. In addition, we design a curriculum\ntraining pipeline with gradually increasing resolution and number of input\nframes to accommodate long videos. Evaluation results demonstrate that, with 8B\nparameters, Kangaroo achieves state-of-the-art performance across a variety of\nvideo understanding benchmarks while exhibiting competitive results on others.\nParticularly, on benchmarks specialized for long videos, Kangaroo excels some\nlarger models with over 10B parameters and proprietary models.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-W2wGF_H5zSFo6USqBGRFdi4I22zziaNWR4mVdWRpHs","pdfSize":"1707330"}
