{"id":"2408.02215","title":"Exploring Query Understanding for Amazon Product Search","authors":"Chen Luo, Xianfeng Tang, Hanqing Lu, Yaochen Xie, Hui Liu, Zhenwei\n  Dai, Limeng Cui, Ashutosh Joshi, Sreyashi Nag, Yang Li, Zhen Li, Rahul\n  Goutam, Jiliang Tang, Haiyang Zhang, Qi He","authorsParsed":[["Luo","Chen",""],["Tang","Xianfeng",""],["Lu","Hanqing",""],["Xie","Yaochen",""],["Liu","Hui",""],["Dai","Zhenwei",""],["Cui","Limeng",""],["Joshi","Ashutosh",""],["Nag","Sreyashi",""],["Li","Yang",""],["Li","Zhen",""],["Goutam","Rahul",""],["Tang","Jiliang",""],["Zhang","Haiyang",""],["He","Qi",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 03:33:11 GMT"}],"updateDate":"2024-08-06","timestamp":1722828791000,"abstract":"  Online shopping platforms, such as Amazon, offer services to billions of\npeople worldwide. Unlike web search or other search engines, product search\nengines have their unique characteristics, primarily featuring short queries\nwhich are mostly a combination of product attributes and structured product\nsearch space. The uniqueness of product search underscores the crucial\nimportance of the query understanding component. However, there are limited\nstudies focusing on exploring this impact within real-world product search\nengines. In this work, we aim to bridge this gap by conducting a comprehensive\nstudy and sharing our year-long journey investigating how the query\nunderstanding service impacts Amazon Product Search. Firstly, we explore how\nquery understanding-based ranking features influence the ranking process. Next,\nwe delve into how the query understanding system contributes to understanding\nthe performance of a ranking model. Building on the insights gained from our\nstudy on the evaluation of the query understanding-based ranking model, we\npropose a query understanding-based multi-task learning framework for ranking.\nWe present our studies and investigations using the real-world system on Amazon\nSearch.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}