{"id":"2408.03575","title":"Generation of Weyl points and a nodal line by magnetization\n  reorientation in Co$_3$Sn$_2$S$_2$","authors":"F. Schilberth, M.-C. Jiang, F. Le Mardel\\'e, L. B. Papp, I. Mohelsky,\n  M. A. Kassem, Y. Tabata, T. Waki, H. Nakamura, G.-Y. Guo, M. Orlita, R.\n  Arita, I. K\\'ezsm\\'arki, and S. Bord\\'acs","authorsParsed":[["Schilberth","F.",""],["Jiang","M. -C.",""],["Mardelé","F. Le",""],["Papp","L. B.",""],["Mohelsky","I.",""],["Kassem","M. A.",""],["Tabata","Y.",""],["Waki","T.",""],["Nakamura","H.",""],["Guo","G. -Y.",""],["Orlita","M.",""],["Arita","R.",""],["Kézsmárki","I.",""],["Bordács","S.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 06:27:08 GMT"}],"updateDate":"2024-08-08","timestamp":1723012028000,"abstract":"  Topological magnets exhibit fascinating properties like topologically\nprotected surface states or anomalous transport phenomena. While these\nproperties can be significantly altered by manipulating the magnetic state, the\nexperimental verification of such predictions remains challenging. Here, we\ndemonstrate the efficient magnetic field control of the Weyl semimetallic state\nof the collinear ferromagnet Co$_3$Sn$_2$S$_2$ by magneto-optical spectroscopy.\nWe resolve a redshift of the nodal loop resonance as the magnetization is\nrotated into the kagome plane by the magnetic field. Our material-specific\ntheory, capturing the observed field-induced spectral reconstruction, shows the\ncreation of 26 Weyl points for one in-plane magnetization direction and\npredicts the emergence of a gapless nodal loop for the orthogonal in-plane\nmagnetization orientation. These findings demonstrate that while topological\nband structures are generally considered robust, breaking underlying crystal\nsymmetries with external fields provides an efficient way to manipulate them,\neven in collinear magnets. This approach opens exciting avenues to control band\ntopology also in materials with more complex magnetic structures and even to\nstudy the interplay of real- and momentum-space topological states, e.g. in\nskyrmion-lattice systems.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}