{"id":"2408.14948","title":"Decentralized Unlabeled Multi-agent Pathfinding Via Target And Priority\n  Swapping (With Supplementary)","authors":"Stepan Dergachev and Konstantin Yakovlev","authorsParsed":[["Dergachev","Stepan",""],["Yakovlev","Konstantin",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 10:45:57 GMT"}],"updateDate":"2024-08-28","timestamp":1724755557000,"abstract":"  In this paper we study a challenging variant of the multi-agent pathfinding\nproblem (MAPF), when a set of agents must reach a set of goal locations, but it\ndoes not matter which agent reaches a specific goal - Anonymous MAPF (AMAPF).\nCurrent optimal and suboptimal AMAPF solvers rely on the existence of a\ncentralized controller which is in charge of both target assignment and\npathfinding. We extend the state of the art and present the first AMAPF solver\ncapable of solving the problem at hand in a fully decentralized fashion, when\neach agent makes decisions individually and relies only on the local\ncommunication with the others. The core of our method is a priority and target\nswapping procedure tailored to produce consistent goal assignments (i.e. making\nsure that no two agents are heading towards the same goal). Coupled with an\nestablished rule-based path planning, we end up with a TP-SWAP, an efficient\nand flexible approach to solve decentralized AMAPF. On the theoretical side, we\nprove that TP-SWAP is complete (i.e. TP-SWAP guarantees that each target will\nbe reached by some agent). Empirically, we evaluate TP-SWAP across a wide range\nof setups and compare it to both centralized and decentralized baselines.\nIndeed, TP-SWAP outperforms the fully-decentralized competitor and can even\noutperform the semi-decentralized one (i.e. the one relying on the initial\nconsistent goal assignment) in terms of flowtime (a widespread cost objective\nin MAPF\n","subjects":["Computing Research Repository/Multiagent Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}