{"id":"2408.05504","title":"Efficient generation of out-of-plane polarized spin current in\n  polycrystalline heavy metal devices with broken electric symmetries","authors":"Qianbiao Liu, Xin Lin, Ariel Shaked, Zhuyang Nie, Guoqiang Yu, Lijun\n  Zhu","authorsParsed":[["Liu","Qianbiao",""],["Lin","Xin",""],["Shaked","Ariel",""],["Nie","Zhuyang",""],["Yu","Guoqiang",""],["Zhu","Lijun",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 10:04:07 GMT"}],"updateDate":"2024-08-28","timestamp":1723284247000,"abstract":"  Spin currents of perpendicularly polarized spins (z spins) by an in-plane\ncharge current have received blooming interest for the potential in\nenergy-efficient spin-orbit torque switching of perpendicular magnetization in\nthe absence of a magnetic field. However, generation of z spins is limited\nmainly to magnetically or crystallographically low-symmetry single crystals\n(such as non-colinear antiferromagnets) that are hardly compatible with the\nintegration to semiconductor circuits. Here, we report efficient generation of\nz spins in sputter-deposited polycrystalline heavy metal devices via a new\nmechanism of broken electric symmetries in both the transverse and\nperpendicular directions. Both the dampinglike and fieldlike spin-orbit torques\nof z spins can be tuned significantly by varying the degree of the electric\nasymmetries via the length, width, and thickness of devices as well as by\nvarying the type of the heavy metals. We also show that the presence of z spins\nenables deterministic, nearly-full, external-magnetic-field-free switching of a\nuniform perpendicularly magnetized FeCoB layer, the core structure of magnetic\ntunnel junctions, with high coercivity at a low current density. These results\nestablish the first universal, energy-efficient, integration-friendly approach\nto generate z-spin current by electric asymmetry design for dense and low-power\nspin-torque memory and computing technologies and will stimulate investigation\nof z-spin currents in various polycrystalline materials.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}