{"id":"2408.06351","title":"A Probabilistic Approach for Queue Length Estimation Using License Plate\n  Recognition Data: Considering Overtaking in Multi-lane Scenarios","authors":"Lyuzhou Luo, Hao Wu, Jiahao Liu, Keshuang Tang, Chaopeng Tan","authorsParsed":[["Luo","Lyuzhou",""],["Wu","Hao",""],["Liu","Jiahao",""],["Tang","Keshuang",""],["Tan","Chaopeng",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 09:52:33 GMT"}],"updateDate":"2024-08-14","timestamp":1721814753000,"abstract":"  Multi-section license plate recognition (LPR) data provides input-output\ninformation and sampled travel times of the investigated link, serving as an\nideal data source for lane-based queue length estimation in recent studies.\nHowever, most of these studies assumed the strict FIFO rule or a specific\narrival process, thus ignoring the potential impact of overtaking and the\nvariation of traffic flows, especially in multi-lane scenarios. To address this\nissue, we propose a probabilistic approach to derive the stochastic queue\nlength by constructing a conditional probability model of no-delay arrival time\n(NAT), i.e., the arrival time of vehicles without experiencing any delay, based\non multi-section LPR data. First, the NAT conditions for all vehicles are\nestablished based on upstream and downstream vehicle departure times and\nsequences. To reduce the computational dimensionality and complexity, a\nDP-based algorithm is developed for vehicle group partitioning based on\npotential interactions between vehicles. Then, the conditional probability of\nNATs of each vehicle group is derived and an MCMC sampling method is employed\nfor calculation. Subsequently, the stochastic queue profile and maximum queue\nlength for each cycle can be derived based on the NATs of vehicles. Eventually,\nto leverage the LPR data sufficiently, we extend our approach to multi-lane\nscenarios, where the problem can be converted to a weighted general exact\ncoverage problem and solved by a backtracking algorithm with heuristics.\nEmpirical and simulation experiments have shown that the proposed approach\noutperforms the state-of-the-art method, demonstrating significant improvements\nin accuracy and robustness across various traffic conditions, including\ndifferent V/C ratios, matching rates, and FIFO violation rates. In addition,\nthe performance of the proposed approach can be further improved by utilizing\nmulti-lane LPR data.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}