{"id":"2408.10513","title":"Relativistic and Electron Correlation Effects in Static Dipole\n  Polarizabilities for Main-Group Elements","authors":"YingXing Cheng","authorsParsed":[["Cheng","YingXing",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 03:28:10 GMT"},{"version":"v2","created":"Sat, 14 Sep 2024 07:11:28 GMT"}],"updateDate":"2024-09-17","timestamp":1724124490000,"abstract":"  In this study, I compute the static dipole polarizability of main-group\nelements using the finite-field method combined with relativistic\ncoupled-cluster and configuration interaction simulations. The computational\nresults closely align with the values recommended in the 2018 table of static\ndipole polarizabilities of neutral elements [Mol. Phys. 117, 1200 (2019)].\nAdditionally, I investigate the influence of relativistic effects and electron\ncorrelation on atomic dipole polarizabilities. Specifically, three types of\nrelativistic effects impacting dipole polarizabilities are studied:\nscalar-relativistic, spin-orbit coupling, and fully relativistic Dirac-Coulomb\neffects. The results indicate that scalar-relativistic effects are predominant\nfor atoms in Groups 1--2, with minimal influence from spin-orbit coupling\neffects. Conversely, for elements in Groups 13--18, scalar-relativistic effects\nare less significant, while spin-orbit coupling significantly affects elements\nstarting from the fourth row in Groups 13--14 and from the fifth row in Groups\n15--18. In each category of relativistic effects, the impact of electron\ncorrelation is evaluated. The results show that electron correlation\nsignificantly influences dipole polarizability calculations, particularly for\nGroups 1--2 and 13--14 atoms, but is less significant for Groups 15--18 atoms.\nThis study provides a comprehensive and consistent dataset of dipole\npolarizabilities and contributes to a systematic understanding of the roles of\nrelativistic and electron correlation effects in atomic dipole\npolarizabilities, serving as a valuable reference for future research.\n","subjects":["Physics/Atomic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}