{"id":"2408.16035","title":"Analysis of Diagnostics (Part II): Prevalence, Linear Independence, and\n  Unsupervised Learning","authors":"Paul N. Patrone, Raquel A. Binder, Catherine S. Forconi, Ann M.\n  Moormann, Anthony J. Kearsley","authorsParsed":[["Patrone","Paul N.",""],["Binder","Raquel A.",""],["Forconi","Catherine S.",""],["Moormann","Ann M.",""],["Kearsley","Anthony J.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 13:39:57 GMT"}],"updateDate":"2024-08-30","timestamp":1724852397000,"abstract":"  This is the second manuscript in a two-part series that uses diagnostic\ntesting to understand the connection between prevalence (i.e. number of\nelements in a class), uncertainty quantification (UQ), and classification\ntheory. Part I considered the context of supervised machine learning (ML) and\nestablished a duality between prevalence and the concept of relative\nconditional probability. The key idea of that analysis was to train a family of\ndiscriminative classifiers by minimizing a sum of prevalence-weighted empirical\nrisk functions. The resulting outputs can be interpreted as relative\nprobability level-sets, which thereby yield uncertainty estimates in the class\nlabels. This procedure also demonstrated that certain discriminative and\ngenerative ML models are equivalent. Part II considers the extent to which\nthese results can be extended to tasks in unsupervised learning through\nrecourse to ideas in linear algebra. We first observe that the distribution of\nan impure population, for which the class of a corresponding sample is unknown,\ncan be parameterized in terms of a prevalence. This motivates us to introduce\nthe concept of linearly independent populations, which have different but\nunknown prevalence values. Using this, we identify an isomorphism between\nclassifiers defined in terms of impure and pure populations. In certain cases,\nthis also leads to a nonlinear system of equations whose solution yields the\nprevalence values of the linearly independent populations, fully realizing\nunsupervised learning as a generalization of supervised learning. We illustrate\nour methods in the context of synthetic data and a research-use-only SARS-CoV-2\nenzyme-linked immunosorbent assay (ELISA).\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning","Mathematics/Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mfw7IbbqjUB9Htke42qKv4R6FiJGxSSUyRvdLtCjTqc","pdfSize":"1877683"}
