{"id":"2408.06570","title":"An Infrastructure Cost Optimised Algorithm for Partitioning of\n  Microservices","authors":"Kalyani V N S Pendyala and Rajkumar Buyya","authorsParsed":[["Pendyala","Kalyani V N S",""],["Buyya","Rajkumar",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 02:08:59 GMT"}],"updateDate":"2024-08-14","timestamp":1723514939000,"abstract":"  The evolution and advances made in the field of Cloud engineering influence\nthe constant changes in software application development cycle and practices.\nSoftware architecture has evolved along with other domains and capabilities of\nsoftware engineering. As migrating applications into the cloud is universally\nadopted by the software industry, microservices have proven to be the most\nsuitable and widely accepted architecture pattern for applications deployed on\ndistributed cloud. Their efficacy is enabled by both technical benefits like\nreliability, fault isolation, scalability and productivity benefits like ease\nof asset maintenance and clear ownership boundaries which in turn lead to fewer\ninterdependencies and shorter development cycles thereby resulting in faster\ntime to market. Though microservices have been established as an architecture\npattern over the last decade, many organizations fail to optimize the\narchitecture design to maximize efficiency. In some cases, the complexity of\nmigrating an existing application into the microservices architecture becomes\noverwhelmingly complex and expensive. Additionally, automation and tool support\nfor this problem are still at an early stage as there isn't a single\nwell-acknowledged pattern or tool which could support the decomposition. This\npaper discusses a few impactful previous research and survey efforts to\nidentify the lack of infrastructure cost optimization as a parameter in any of\nthe approaches present. This paper proposes an Infrastructure-optimised\npredictive algorithm for partitioning monolithic software into microservices.\nIt also summarizes the scope for future research opportunities within the area\nof microservices architecture and distributed cloud networks.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/"}