{"id":"2408.11435","title":"Encircling the Liouvillian exceptional points: a brief review","authors":"Konghao Sun and Wei Yi","authorsParsed":[["Sun","Konghao",""],["Yi","Wei",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 08:46:04 GMT"}],"updateDate":"2024-08-22","timestamp":1724229964000,"abstract":"  Exceptional points are the branch-point singularities of non-Hermitian\nHamiltonians, and have rich consequences in open-system dynamics. While the\nexceptional points and their critical phenomena are widely studied in the\nnon-Hermitian settings without quantum jumps, they also emerge in open quantum\nsystems depicted by the Lindblad master equations, wherein they are identified\nas the degeneracies in the Liouvillian eigenspectrum. These Liouvillian\nexceptional points often have distinct properties compared to their\ncounterparts in non-Hermitian Hamiltonians, leading to fundamental\nmodifications of the steady states or the steady-state-approaching dynamics.\nSince the Liouvillian exceptional points widely exist in quantum systems such\nas the atomic vapours, superconducting qubits, and ultracold ions and atoms,\nthey have received increasing amount of attention of late. Here we present a\nbrief review on an important aspect of the dynamic consequence of Liouvillian\nexceptional points, namely the chiral state transfer induced by the parametric\nencircling the Liouvillian exceptional points. Our review focuses on the\ntheoretical description and experimental observation of the phenomena in atomic\nsystems that are experimentally accessible. We also discuss the on-going effort\nto unveil the collective dynamic phenomena close to the Liouvillian exceptional\npoints, as a consequence of the many-body effects therein. Formally, these\nphenomena are the quantum-many-body counterparts to those in classical open\nsystems with nonlinearity, but hold intriguing new potentials for quantum\napplications.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Quantum Gases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PEGYHMdDkYsa9vgPaKEB4EDO1TWXuAa74l8PoWjcC6o","pdfSize":"3767045"}
