{"id":"2408.14697","title":"Circumventing Traps in Analog Quantum Machine Learning Algorithms\n  Through Co-Design","authors":"Rodrigo Araiza Bravo, Jorge Garcia Ponce, Hong-ye Hu, Susanne F. Yelin","authorsParsed":[["Bravo","Rodrigo Araiza",""],["Ponce","Jorge Garcia",""],["Hu","Hong-ye",""],["Yelin","Susanne F.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 23:52:20 GMT"}],"updateDate":"2024-08-28","timestamp":1724716340000,"abstract":"  Quantum machine learning QML algorithms promise to deliver near-term,\napplicable quantum computation on noisy, intermediate-scale systems. While most\nof these algorithms leverage quantum circuits for generic applications, a\nrecent set of proposals, called analog quantum machine learning (AQML)\nalgorithms, breaks away from circuit-based abstractions and favors leveraging\nthe natural dynamics of quantum systems for computation, promising to be\nnoise-resilient and suited for specific applications such as quantum\nsimulation. Recent AQML studies have called for determining best ansatz\nselection practices and whether AQML algorithms have trap-free landscapes based\non theory from quantum optimal control (QOC). We address this call by\nsystematically studying AQML landscapes on two models: those admitting\nblack-boxed expressivity and those tailored to simulating a specific unitary\nevolution. Numerically, the first kind exhibits local traps in their\nlandscapes, while the second kind is trap-free. However, both kinds violate QOC\ntheory's key assumptions for guaranteeing trap-free landscapes. We propose a\nmethodology to co-design AQML algorithms for unitary evolution simulation using\nthe ansatz's Magnus expansion. We show favorable convergence in simulating\ndynamics with applications to metrology and quantum chemistry. We conclude that\nsuch co-design is necessary to ensure the applicability of AQML algorithms.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7Z8tGVxQBArEyUr5YgOqMuIzyK3Tic5v9puIZZJFqic","pdfSize":"4603874"}
