{"id":"2408.17161","title":"Leveraging Blockchain and ANFIS for Optimal Supply Chain Management","authors":"Amirfarhad Farhadi, Homayoun Safarpour Motealegh Mahalegi, Abolfazl\n  Pourrezaeian Firouzabad, Azadeh Zamanifar, Majid Sorouri","authorsParsed":[["Farhadi","Amirfarhad",""],["Mahalegi","Homayoun Safarpour Motealegh",""],["Firouzabad","Abolfazl Pourrezaeian",""],["Zamanifar","Azadeh",""],["Sorouri","Majid",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 10:04:15 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 10:35:57 GMT"}],"updateDate":"2024-09-04","timestamp":1725012255000,"abstract":"  The supply chain is a critical segment of the product manufacturing cycle,\ncontinuously influenced by risky, uncertain, and undesirable events. Optimizing\nflexibility in the supply chain presents a complex, multi-objective, and\nnonlinear programming challenge. In the poultry supply chain, the development\nof mass customization capabilities has led manufacturing companies to\nincreasingly focus on offering tailored and customized services for individual\nproducts. To safeguard against data tampering and ensure the integrity of setup\ncosts and overall profitability, a multi-signature decentralized finance (DeFi)\nprotocol, integrated with the IoT on a blockchain platform, is proposed.\nManaging the poultry supply chain involves uncertainties that may not account\nfor parameters such as delivery time to retailers, reorder time, and the number\nof requested products. To address these challenges, this study employs an\nadaptive neuro-fuzzy inference system (ANFIS), combining neural networks with\nfuzzy logic to compensate for the lack of data training in parameter\nidentification. Through MATLAB simulations, the study investigates the average\nshop delivery duration, the reorder time, and the number of products per order.\nBy implementing the proposed technique, the average delivery time decreases\nfrom 40 to 37 minutes, the reorder time decreases from five to four days, and\nthe quantity of items requested per order grows from six to eleven.\nAdditionally, the ANFIS model enhances overall supply chain performance by\nreducing transaction times by 15\\% compared to conventional systems, thereby\nimproving real-time responsiveness and boosting transparency in supply chain\noperations, effectively resolving operational issues.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}