{"id":"2408.07143","title":"Optimal Experimental Design for Universal Differential Equations","authors":"Christoph Plate, Carl Julius Martensen, Sebastian Sager","authorsParsed":[["Plate","Christoph",""],["Martensen","Carl Julius",""],["Sager","Sebastian",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 18:24:54 GMT"},{"version":"v2","created":"Fri, 6 Sep 2024 12:50:33 GMT"}],"updateDate":"2024-09-09","timestamp":1723573494000,"abstract":"  Complex dynamic systems are typically either modeled using expert knowledge\nin the form of differential equations or via data-driven universal\napproximation models such as artificial neural networks (ANN). While the first\napproach has advantages with respect to interpretability, transparency,\ndata-efficiency, and extrapolation, the second approach is able to learn\ncompletely unknown functional relations from data and may result in models that\ncan be evaluated more efficiently. To combine the complementary advantages,\nuniversal differential equations (UDE) have been suggested. They replace\nunknown terms in the differential equations with ANN. Such hybrid models allow\nto both encode prior domain knowledge, such as first principles, and to learn\nunknown mechanisms from data. Often, data for the training of UDE can only be\nobtained via costly experiments. We consider optimal experimental design (OED)\nfor planning of experiments and generating data needed to train UDE. The number\nof weights in the embedded ANN usually leads to an overfitting of the\nregression problem. To make the OED problem tractable for optimization, we\npropose and compare dimension reduction methods that are based on lumping of\nweights and singular value decomposition of the Fisher information matrix\n(FIM), respectively. They result in lower-dimensional variational differential\nequations, which are easier to solve and yield regular FIM. Our numerical\nresults showcase the advantages of OED for UDE, such as increased\ndata-efficiency and better extrapolation properties.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}