{"id":"2408.01508","title":"Blockchain Amplification Attack","authors":"Taro Tsuchiya, Liyi Zhou, Kaihua Qin, Arthur Gervais, Nicolas Christin","authorsParsed":[["Tsuchiya","Taro",""],["Zhou","Liyi",""],["Qin","Kaihua",""],["Gervais","Arthur",""],["Christin","Nicolas",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 18:06:33 GMT"},{"version":"v2","created":"Thu, 19 Sep 2024 17:44:30 GMT"}],"updateDate":"2024-09-20","timestamp":1722621993000,"abstract":"  Strategies related to the blockchain concept of Extractable Value (MEV/BEV),\nsuch as arbitrage, front- or backrunning create an economic incentive for\nnetwork nodes to reduce latency. A modified node, that minimizes transaction\nvalidation time and neglects to filter invalid transactions in the Ethereum P2P\nnetwork, introduces a novel attack vector -- Blockchain Amplification Attack.\nAn attacker exploits those modified nodes to amplify an invalid transaction\nthousands of times, posing a threat to the entire network. To illustrate attack\nfeasibility and practicality in the current mainnet, we 1) identify thousands\nof similar attacks in the wild, 2) mathematically model propagation mechanism,\n3) empirically measure model parameters from our two monitoring nodes, and 4)\ncompare performance with existing Denial-of-Service attacks through local\nsimulation. We show that an attacker can amplify network traffic at modified\nnodes by a factor of 3,600, and cause economic damages 13,800 times greater\nthan the amount needed to carry out the attack. Despite these risks, aggressive\nlatency reduction may still be profitable enough to justify the existence of\nmodified nodes. To assess this tradeoff, we 1) simulate the transaction\nvalidation process in the local network and 2) empirically measure the latency\nreduction by deploying our modified node in the Ethereum testnet. We conclude\nwith a cost-benefit analysis of skipping validation and provide mitigation\nstrategies against this attack.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}