{"id":"2408.03886","title":"Retrieval Augmentation via User Interest Clustering","authors":"Hanjia Lyu, Hanqing Zeng, Yinglong Xia, Ren Chen, Jiebo Luo","authorsParsed":[["Lyu","Hanjia",""],["Zeng","Hanqing",""],["Xia","Yinglong",""],["Chen","Ren",""],["Luo","Jiebo",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 16:35:10 GMT"}],"updateDate":"2024-08-08","timestamp":1723048510000,"abstract":"  Many existing industrial recommender systems are sensitive to the patterns of\nuser-item engagement. Light users, who interact less frequently, correspond to\na data sparsity problem, making it difficult for the system to accurately learn\nand represent their preferences. On the other hand, heavy users with rich\ninteraction history often demonstrate a variety of niche interests that are\nhard to be precisely captured under the standard \"user-item\" similarity\nmeasurement. Moreover, implementing these systems in an industrial environment\nnecessitates that they are resource-efficient and scalable to process web-scale\ndata under strict latency constraints. In this paper, we address these\nchallenges by introducing an intermediate \"interest\" layer between users and\nitems. We propose a novel approach that efficiently constructs user interest\nand facilitates low computational cost inference by clustering engagement\ngraphs and incorporating user-interest attention. This method enhances the\nunderstanding of light users' preferences by linking them with heavy users. By\nintegrating user-interest attention, our approach allows a more personalized\nsimilarity metric, adept at capturing the complex dynamics of user-item\ninteractions. The use of interest as an intermediary layer fosters a balance\nbetween scalability and expressiveness in the model. Evaluations on two public\ndatasets reveal that our method not only achieves improved recommendation\nperformance but also demonstrates enhanced computational efficiency compared to\nitem-level attention models. Our approach has also been deployed in multiple\nproducts at Meta, facilitating short-form video related recommendation.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}