{"id":"2408.06201","title":"Investigating Characteristics of Media Recommendation Solicitation in\n  r/ifyoulikeblank","authors":"Md Momen Bhuiyan, Donghan Hu, Andrew Jelson, Tanushree Mitra, Sang Won\n  Lee","authorsParsed":[["Bhuiyan","Md Momen",""],["Hu","Donghan",""],["Jelson","Andrew",""],["Mitra","Tanushree",""],["Lee","Sang Won",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 14:50:04 GMT"}],"updateDate":"2024-08-13","timestamp":1723474204000,"abstract":"  Despite the existence of search-based recommender systems like Google,\nNetflix, and Spotify, online users sometimes may turn to crowdsourced\nrecommendations in places like the r/ifyoulikeblank subreddit. In this\nexploratory study, we probe why users go to r/ifyoulikeblank, how they look for\nrecommendation, and how the subreddit users respond to recommendation requests.\nTo answer, we collected sample posts from r/ifyoulikeblank and analyzed them\nusing a qualitative approach. Our analysis reveals that users come to this\nsubreddit for various reasons, such as exhausting popular search systems, not\nknowing what or how to search for an item, and thinking crowd have better\nknowledge than search systems. Examining users query and their description, we\nfound novel information users provide during recommendation seeking using\nr/ifyoulikeblank. For example, sometimes they ask for artifacts recommendation\nbased on the tools used to create them. Or, sometimes indicating a\nrecommendation seeker's time constraints can help better suit recommendations\nto their needs. Finally, recommendation responses and interactions revealed\npatterns of how requesters and responders refine queries and recommendations.\nOur work informs future intelligent recommender systems design.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nc5JyZqqzQD4QDGM7lzv465_jyhc9BEETiRQZ9Ydw6E","pdfSize":"1064655"}
