{"id":"2408.03311","title":"Dwarf Galaxies in the MATLAS Survey: Hubble Space Telescope Observations\n  of the Globular Cluster Systems of 74 Ultra Diffuse Galaxies","authors":"Francine R. Marleau, Pierre-Alain Duc, Melina Poulain, Oliver Mueller,\n  Sungsoon Lim, Patrick R. Durrell, Rebecca Habas, Ruben Sanchez-Janssen,\n  Sanjaya Paudel, and Jeremy Fensch","authorsParsed":[["Marleau","Francine R.",""],["Duc","Pierre-Alain",""],["Poulain","Melina",""],["Mueller","Oliver",""],["Lim","Sungsoon",""],["Durrell","Patrick R.",""],["Habas","Rebecca",""],["Sanchez-Janssen","Ruben",""],["Paudel","Sanjaya",""],["Fensch","Jeremy",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 17:28:39 GMT"}],"updateDate":"2024-08-07","timestamp":1722965319000,"abstract":"  Ultra diffuse galaxies, characterized by their low surface brightness and\nlarge physical size, constitute a subclass of dwarf galaxies that challenge our\ncurrent understanding of galaxy formation and evolution. In this paper, we\nprobe the properties of 74 UDGs, identified in the MATLAS survey, based on a\ncomprehensive study of their globular cluster (GC) populations. We obtained\nhigh resolution HST imaging of these galaxies using the ACS F606W and F814W\nfilters, allowing us to select GCs based on color and concentration index.\nAfter background subtraction and completeness correction, we calculate an\noverall total of 387 GCs. The number of GCs per galaxy ranges from 0 to 38,\nwith the majority (64%) having low counts (0-2 GCs). On average, the more\nmassive UDGs host a larger number of GCs. We find that our UDGs have specific\nfrequencies (S_N) ranging from 0 to 91, with a small population (9%) with S_N >\n30. The median S_N of our sample is similar to the one for the Perseus cluster\nUDGs, despite the fact that our UDGs are found in lower density environments.\nThe S_N measurements for individual galaxies can extend beyond those found in\nPerseus, but remain below the values found for UDGs in the Virgo and Coma\ncluster. Based on a trending analysis of the S_N values with the host galaxy\nproperties, we find trends with host galaxy size, roundness, color, and local\ndensity. For the UDGs with sufficiently high statistics, we study 2D density\nmaps of the GC distributions, which show a variety of appearances: symmetric,\nasymmetric, off-center, and elongated. The UDGs with disturbed density maps\nalso show disturbed stellar light morphologies. We further quantify the\ndistribution by modeling it with a Sersic profile, finding R_{e,GC}/R_{e,gal} ~\n1.0, which indicates that the GCs follow the stellar light of the host galaxy.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vp5i0vE_y3dM05m-T8UAkvOpXECQdtKBjyatm4RjB3k","pdfSize":"48135007"}
