{"id":"2408.08960","title":"Application of mesh refinement to relativistic magnetic reconnection","authors":"Revathi Jambunathan, Henry Jones, Lizzette Corrales, Hannah Klion,\n  Michael Rowan, Andrew Myers, Weiqun Zhang, and Jean-Luc Vay","authorsParsed":[["Jambunathan","Revathi",""],["Jones","Henry",""],["Corrales","Lizzette",""],["Klion","Hannah",""],["Rowan","Michael",""],["Myers","Andrew",""],["Zhang","Weiqun",""],["Vay","Jean-Luc",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 18:07:52 GMT"}],"updateDate":"2024-08-20","timestamp":1723831672000,"abstract":"  During relativistic magnetic reconnection, antiparallel magnetic fields\nundergo a rapid change in topology, releasing a large amount of energy in the\nform of non-thermal particle acceleration. This work explores the application\nof mesh refinement to 2D reconnection simulations to efficiently model the\nineherent disparity in length-scales. We have systematically investigated the\neffects of mesh refinement and determined necessary modifications to the\nalgorithm required to mitigate non-physical artifacts at the coarse-fine\ninterface. We have used the ultrahigh-order Pseudo-Spectral Analytical\nTime-Domain (PSATD) Maxwell solver to analyze how its use can mitigate the\nnumerical dispersion that occurs with the finite-difference time-domain (FDTD)\n(or ``Yee'') method. Absorbing layers are introduced at the coarse-fine\ninterface to eliminate spurious effects that occur with mesh refinement. We\nalso study how damping the electromagnetic fields and current density in the\nabsorbing layer can help prevent the non-physical accumulation of charge and\ncurrent density at the coarse-fine interface. Using a mesh refinement ratio of\n8 for two-dimensional magnetic reconnection simulations, we obtained good\nagreement with the high resolution baseline simulation, using only 36% of the\nmacroparticles and 71% of the node-hours needed for the baseline. The methods\npresented here are especially applicable to 3D systems where higher memory\nsavings are expected than in 2D, enabling comprehensive, computationally\nefficient 3D reconnection studies in the future.\n","subjects":["Physics/Computational Physics","Astrophysics/High Energy Astrophysical Phenomena","Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}