{"id":"2408.13697","title":"Guided and Fused: Efficient Frozen CLIP-ViT with Feature Guidance and\n  Multi-Stage Feature Fusion for Generalizable Deepfake Detection","authors":"Yingjian Chen, Lei Zhang, Yakun Niu, Pei Chen, Lei Tan and Jing Zhou","authorsParsed":[["Chen","Yingjian",""],["Zhang","Lei",""],["Niu","Yakun",""],["Chen","Pei",""],["Tan","Lei",""],["Zhou","Jing",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 01:15:52 GMT"}],"updateDate":"2024-08-27","timestamp":1724548552000,"abstract":"  The rise of generative models has sparked concerns about image authenticity\nonline, highlighting the urgent need for an effective and general detector.\nRecent methods leveraging the frozen pre-trained CLIP-ViT model have made great\nprogress in deepfake detection. However, these models often rely on\nvisual-general features directly extracted by the frozen network, which contain\nexcessive information irrelevant to the task, resulting in limited detection\nperformance. To address this limitation, in this paper, we propose an efficient\nGuided and Fused Frozen CLIP-ViT (GFF), which integrates two simple yet\neffective modules. The Deepfake-Specific Feature Guidance Module (DFGM) guides\nthe frozen pre-trained model in extracting features specifically for deepfake\ndetection, reducing irrelevant information while preserving its generalization\ncapabilities. The Multi-Stage Fusion Module (FuseFormer) captures low-level and\nhigh-level information by fusing features extracted from each stage of the ViT.\nThis dual-module approach significantly improves deepfake detection by fully\nleveraging CLIP-ViT's inherent advantages. Extensive experiments demonstrate\nthe effectiveness and generalization ability of GFF, which achieves\nstate-of-the-art performance with optimal results in only 5 training epochs.\nEven when trained on only 4 classes of ProGAN, GFF achieves nearly 99% accuracy\non unseen GANs and maintains an impressive 97% accuracy on unseen diffusion\nmodels.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}