{"id":"2408.13470","title":"Performance Analysis of Photon-Limited Free-Space Optical Communications\n  with Practical Photon-Counting Receivers","authors":"Chen Wang, Zhiyong Xu, Jingyuan Wang, Jianhua Li, Weifeng Mou, Huatao\n  Zhu, Jiyong Zhao, Yang Su, Yimin Wang, and Ailin Qi","authorsParsed":[["Wang","Chen",""],["Xu","Zhiyong",""],["Wang","Jingyuan",""],["Li","Jianhua",""],["Mou","Weifeng",""],["Zhu","Huatao",""],["Zhao","Jiyong",""],["Su","Yang",""],["Wang","Yimin",""],["Qi","Ailin",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 05:11:57 GMT"}],"updateDate":"2024-08-27","timestamp":1724476317000,"abstract":"  The non-perfect factors of practical photon-counting receiver are recognized\nas a significant challenge for long-distance photon-limited free-space optical\n(FSO) communication systems. This paper presents a comprehensive analytical\nframework for modeling the statistical properties of time-gated single-photon\navalanche diode (TG-SPAD) based photon-counting receivers in presence of dead\ntime, non-photon-number-resolving and afterpulsing effect. Drawing upon the\nnon-Markovian characteristic of afterpulsing effect, we formulate a closed-form\napproximation for the probability mass function (PMF) of photon counts, when\nhigh-order pulse amplitude modulation (PAM) is used. Unlike the photon counts\nfrom a perfect photon-counting receiver, which adhere to a Poisson arrival\nprocess, the photon counts from a practical TG-SPAD based receiver are instead\napproximated by a binomial distribution. Additionally, by employing the maximum\nlikelihood (ML) criterion, we derive a refined closed-form formula for\ndetermining the threshold in high-order PAM, thereby facilitating the\ndevelopment of an analytical model for the symbol error rate (SER). Utilizing\nthis analytical SER model, the system performance is investigated. The\nnumerical results underscore the crucial need to suppress background radiation\nbelow the tolerated threshold and to maintain a sufficient number of gates in\norder to achieve a target SER.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}