{"id":"2408.02052","title":"EOL: Transductive Few-Shot Open-Set Recognition by Enhancing Outlier\n  Logits","authors":"Mateusz Ochal and Massimiliano Patacchiola and Malik Boudiaf and Sen\n  Wang","authorsParsed":[["Ochal","Mateusz",""],["Patacchiola","Massimiliano",""],["Boudiaf","Malik",""],["Wang","Sen",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 15:00:22 GMT"}],"updateDate":"2024-08-06","timestamp":1722783622000,"abstract":"  In Few-Shot Learning (FSL), models are trained to recognise unseen objects\nfrom a query set, given a few labelled examples from a support set. In standard\nFSL, models are evaluated on query instances sampled from the same class\ndistribution of the support set. In this work, we explore the more nuanced and\npractical challenge of Open-Set Few-Shot Recognition (OSFSL). Unlike standard\nFSL, OSFSL incorporates unknown classes into the query set, thereby requiring\nthe model not only to classify known classes but also to identify outliers.\nBuilding on the groundwork laid by previous studies, we define a novel\ntransductive inference technique that leverages the InfoMax principle to\nexploit the unlabelled query set. We called our approach the Enhanced Outlier\nLogit (EOL) method. EOL refines class prototype representations through model\ncalibration, effectively balancing the inlier-outlier ratio. This calibration\nenhances pseudo-label accuracy for the query set and improves the optimisation\nobjective within the transductive inference process. We provide a comprehensive\nempirical evaluation demonstrating that EOL consistently surpasses traditional\nmethods, recording performance improvements ranging from approximately $+1.3%$\nto $+6.3%$ across a variety of classification and outlier detection metrics and\nbenchmarks, even in the presence of inlier-outlier imbalance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"g2xXvEN0EhfQd-Q35DgIQ-esXaqiDJQwkgMpLh_FdwE","pdfSize":"960216","txDigest":"E67RcFHXNBGGMiBy9z6cvfM2i3L7rrVtbwqFX6vCdWYL","endEpoch":"1","status":"CERTIFIED"}
