{"id":"2408.14810","title":"Generalist Segmentation Algorithm for Photoreceptors Analysis in\n  Adaptive Optics Imaging","authors":"Mikhail Kulyabin, Aline Sindel, Hilde Pedersen, Stuart Gilson, Rigmor\n  Baraas, and Andreas Maier","authorsParsed":[["Kulyabin","Mikhail",""],["Sindel","Aline",""],["Pedersen","Hilde",""],["Gilson","Stuart",""],["Baraas","Rigmor",""],["Maier","Andreas",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 06:49:21 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 14:38:22 GMT"}],"updateDate":"2024-08-30","timestamp":1724741361000,"abstract":"  Analyzing the cone photoreceptor pattern in images obtained from the living\nhuman retina using quantitative methods can be crucial for the early detection\nand management of various eye conditions. Confocal adaptive optics scanning\nlight ophthalmoscope (AOSLO) imaging enables visualization of the cones from\nreflections of waveguiding cone photoreceptors. While there have been\nsignificant improvements in automated algorithms for segmenting cones in\nconfocal AOSLO images, the process of labelling data remains labor-intensive\nand manual. This paper introduces a method based on deep learning (DL) for\ndetecting and segmenting cones in AOSLO images. The models were trained on a\nsemi-automatically labelled dataset of 20 AOSLO batches of images of 18\nparticipants for 0$^{\\circ}$, 1$^{\\circ}$, and 2$^{\\circ}$ from the foveal\ncenter. F1 scores were 0.968, 0.958, and 0.954 for 0$^{\\circ}$, 1$^{\\circ}$,\nand 2$^{\\circ}$, respectively, which is better than previously reported DL\napproaches. Our method minimizes the need for labelled data by only\nnecessitating a fraction of labelled cones, which is especially beneficial in\nthe field of ophthalmology, where labelled data can often be limited.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VXnG4vi2CcsGQ8kN81jztfS-pFVmsC4pyp2XEHdpKFU","pdfSize":"12077713"}
