{"id":"2408.04334","title":"A Node-Based Polar List Decoder with Frame Interleaving and Ensemble\n  Decoding Support","authors":"Yuqing Ren, Leyu Zhang, Ludovic Damien Blanc, Yifei Shen, Xinwei Li,\n  Alexios Balatsoukas-Stimming, Chuan Zhang, Andreas Burg","authorsParsed":[["Ren","Yuqing",""],["Zhang","Leyu",""],["Blanc","Ludovic Damien",""],["Shen","Yifei",""],["Li","Xinwei",""],["Balatsoukas-Stimming","Alexios",""],["Zhang","Chuan",""],["Burg","Andreas",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 09:38:03 GMT"}],"updateDate":"2024-08-09","timestamp":1723109883000,"abstract":"  Node-based successive cancellation list (SCL) decoding has received\nconsiderable attention in wireless communications for its significant reduction\nin decoding latency, particularly with 5G New Radio (NR) polar codes. However,\nthe existing node-based SCL decoders are constrained by sequential processing,\nleading to complicated and data-dependent computational units that introduce\nunavoidable stalls, reducing hardware efficiency. In this paper, we present a\nframe-interleaving hardware architecture for a generalized node-based SCL\ndecoder. By efficiently reusing otherwise idle computational units, two\nindependent frames can be decoded simultaneously, resulting in a significant\nthroughput gain. Based on this new architecture, we further exploit graph\nensembles to diversify the decoding space, thus enhancing the error-correcting\nperformance with a limited list size. Two dynamic strategies are proposed to\neliminate the residual stalls in the decoding schedule, which eventually\nresults in nearly 2x throughput compared to the state-of-the-art baseline\nnode-based SCL decoder. To impart the decoder rate flexibility, we develop a\nnovel online instruction generator to identify the generalized nodes and\nproduce instructions on-the-fly. The corresponding 28nm FD-SOI ASIC SCL decoder\nwith a list size of 8 has a core area of 1.28 mm2 and operates at 692 MHz. It\nis compatible with all 5G NR polar codes and achieves a throughput of 3.34 Gbps\nand an area efficiency of 2.62 Gbps/mm2 for uplink (1024, 512) codes, which is\n1.41x and 1.69x better than the state-of-the-art node-based SCL decoders.\n","subjects":["Computing Research Repository/Hardware Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}