{"id":"2408.16928","title":"ACE-2005-PT: Corpus for Event Extraction in Portuguese","authors":"Lu\\'is Filipe Cunha, Purifica\\c{c}\\~ao Silvano, Ricardo Campos,\n  Al\\'ipio Jorge","authorsParsed":[["Cunha","Luís Filipe",""],["Silvano","Purificação",""],["Campos","Ricardo",""],["Jorge","Alípio",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 22:05:08 GMT"}],"updateDate":"2024-09-02","timestamp":1724969108000,"abstract":"  Event extraction is an NLP task that commonly involves identifying the\ncentral word (trigger) for an event and its associated arguments in text.\nACE-2005 is widely recognised as the standard corpus in this field. While other\ncorpora, like PropBank, primarily focus on annotating predicate-argument\nstructure, ACE-2005 provides comprehensive information about the overall event\nstructure and semantics. However, its limited language coverage restricts its\nusability. This paper introduces ACE-2005-PT, a corpus created by translating\nACE-2005 into Portuguese, with European and Brazilian variants. To speed up the\nprocess of obtaining ACE-2005-PT, we rely on automatic translators. This,\nhowever, poses some challenges related to automatically identifying the correct\nalignments between multi-word annotations in the original text and in the\ncorresponding translated sentence. To achieve this, we developed an alignment\npipeline that incorporates several alignment techniques: lemmatization, fuzzy\nmatching, synonym matching, multiple translations and a BERT-based word\naligner. To measure the alignment effectiveness, a subset of annotations from\nthe ACE-2005-PT corpus was manually aligned by a linguist expert. This subset\nwas then compared against our pipeline results which achieved exact and relaxed\nmatch scores of 70.55\\% and 87.55\\% respectively. As a result, we successfully\ngenerated a Portuguese version of the ACE-2005 corpus, which has been accepted\nfor publication by LDC.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ygvoUA4C4NGGgLqh4SDYt0uKQmxObyP0htkFD1MHOcw","pdfSize":"849407"}
