{"id":"2408.11524","title":"What you saw is what you got? -- Correcting reported incidence data for\n  testing intensity","authors":"Rasmus Kristoffer Pedersen, Christian Berrig, Tam\\'as Tekeli, Gergely\n  R\\\"ost, Viggo Andreasen","authorsParsed":[["Pedersen","Rasmus Kristoffer",""],["Berrig","Christian",""],["Tekeli","Tamás",""],["Röst","Gergely",""],["Andreasen","Viggo",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 10:59:56 GMT"},{"version":"v2","created":"Mon, 9 Sep 2024 05:53:52 GMT"}],"updateDate":"2024-09-10","timestamp":1724237996000,"abstract":"  During the COVID-19 pandemic, different types of non-pharmaceutical\ninterventions played an important role in the efforts to control outbreaks and\nto limit the spread of the SARS-CoV-2 virus. In certain countries, large-scale\nvoluntary testing of non-symptomatic individuals was done, with the aim of\nidentifying asymptomatic and pre-symptomatic infections as well as gauging the\nprevalence in the general population. In this work, we present a mathematical\nmodel, used to investigate the dynamics of both observed and unobserved\ninfections as a function of the rate of voluntary testing. The model indicate\nthat increasing the rate of testing causes the observed prevalence to increase,\ndespite a decrease in the true prevalence. For large testing rates, the\nobserved prevalence also decrease. The non-monotonicity of observed prevalence\nexplains some of the discrepancies seen when comparing uncorrected case-counts\nbetween countries. An example of such discrepancy is the COVID-19 epidemics\nobserved in Denmark and Hungary during winter 2020/2021, for which the reported\ncase-counts were comparable but the true prevalence were very different. The\nmodel provides a quantitative measure for the ascertainment rate between\nobserved and true incidence, allowing for test-intensity correction of\nincidence data. By comparing the model to the country-wide epidemic of the\nOmicron variant (BA.1 and BA.2) in Denmark during the winter 2021/2022, we find\na good agreement between the cumulative incidence as estimated by the model and\nas suggested by serology-studies. While the model does not capture the full\ncomplexity of epidemic outbreaks and the effect of different interventions, it\nprovides a simple way to correct raw case-counts for differences in voluntary\ntesting, making comparison across international borders and testing behaviour\npossible.\n","subjects":["Quantitative Biology/Populations and Evolution"],"license":"http://creativecommons.org/licenses/by/4.0/"}