{"id":"2408.04284","title":"LLM-DetectAIve: a Tool for Fine-Grained Machine-Generated Text Detection","authors":"Mervat Abassy, Kareem Elozeiri, Alexander Aziz, Minh Ngoc Ta, Raj\n  Vardhan Tomar, Bimarsha Adhikari, Saad El Dine Ahmed, Yuxia Wang, Osama\n  Mohammed Afzal, Zhuohan Xie, Jonibek Mansurov, Ekaterina Artemova, Vladislav\n  Mikhailov, Rui Xing, Jiahui Geng, Hasan Iqbal, Zain Muhammad Mujahid, Tarek\n  Mahmoud, Akim Tsvigun, Alham Fikri Aji, Artem Shelmanov, Nizar Habash, Iryna\n  Gurevych, Preslav Nakov","authorsParsed":[["Abassy","Mervat",""],["Elozeiri","Kareem",""],["Aziz","Alexander",""],["Ta","Minh Ngoc",""],["Tomar","Raj Vardhan",""],["Adhikari","Bimarsha",""],["Ahmed","Saad El Dine",""],["Wang","Yuxia",""],["Afzal","Osama Mohammed",""],["Xie","Zhuohan",""],["Mansurov","Jonibek",""],["Artemova","Ekaterina",""],["Mikhailov","Vladislav",""],["Xing","Rui",""],["Geng","Jiahui",""],["Iqbal","Hasan",""],["Mujahid","Zain Muhammad",""],["Mahmoud","Tarek",""],["Tsvigun","Akim",""],["Aji","Alham Fikri",""],["Shelmanov","Artem",""],["Habash","Nizar",""],["Gurevych","Iryna",""],["Nakov","Preslav",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 07:43:17 GMT"}],"updateDate":"2024-08-09","timestamp":1723102997000,"abstract":"  The widespread accessibility of large language models (LLMs) to the general\npublic has significantly amplified the dissemination of machine-generated texts\n(MGTs). Advancements in prompt manipulation have exacerbated the difficulty in\ndiscerning the origin of a text (human-authored vs machinegenerated). This\nraises concerns regarding the potential misuse of MGTs, particularly within\neducational and academic domains. In this paper, we present\n$\\textbf{LLM-DetectAIve}$ -- a system designed for fine-grained MGT detection.\nIt is able to classify texts into four categories: human-written,\nmachine-generated, machine-written machine-humanized, and human-written\nmachine-polished. Contrary to previous MGT detectors that perform binary\nclassification, introducing two additional categories in LLM-DetectiAIve offers\ninsights into the varying degrees of LLM intervention during the text creation.\nThis might be useful in some domains like education, where any LLM intervention\nis usually prohibited. Experiments show that LLM-DetectAIve can effectively\nidentify the authorship of textual content, proving its usefulness in enhancing\nintegrity in education, academia, and other domains. LLM-DetectAIve is publicly\naccessible at https://huggingface.co/spaces/raj-tomar001/MGT-New. The video\ndescribing our system is available at https://youtu.be/E8eT_bE7k8c.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}