{"id":"2408.06595","title":"Recent advances in solar data-driven MHD simulations of the formation\n  and evolution of CME flux ropes","authors":"Brigitte Schmieder, Jinhan Guo, Stefaan Poedts","authorsParsed":[["Schmieder","Brigitte",""],["Guo","Jinhan",""],["Poedts","Stefaan",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 03:15:23 GMT"}],"updateDate":"2024-08-14","timestamp":1723518923000,"abstract":"  Filament eruptions and coronal mass ejections are physical phenomena related\nto magnetic flux ropes carrying electric current. A magnetic flux rope is a key\nstructure for solar eruptions, and when it carries a southward magnetic field\ncomponent when propagating to the Earth. It is the primary driver of strong\ngeomagnetic storms. As a result, developing a numerical model capable of\ncapturing the entire progression of a flux rope, from its inception to its\neruptive phase, is crucial for forecasting adverse space weather. The existence\nof such flux ropes is revealed by the presence of sigmoids in active regions or\nhot channels by observations from space and ground instruments. After proposing\ncartoons in 2D, potential, linear, non-linear-force-free-field (NLFFF) and\nnon-force-free-field (NFFF) magnetic extrapolations, 3D numerical\nmagnetohydrodynamic (MHD) simulation models were developed, first in a static\nconfiguration and later dynamic data-driven MHD models using high resolution\nobserved vector magnetograms. This paper reviews a few recent developments in\ndata-driven mode, such as the time-dependent magneto-frictional (TMF) and\nthermodynamic magnetohydrodynamic (MHD) models. Hereafter, to demonstrate the\ncapacity of these models to reveal the physics of observations, we present the\nresults for three events explored in our group: 1. the eruptive X1.0 flare on\n28 October 2021; 2. the filament eruption on 18 August 2022; and 3. the\nconfined X2.2 flare on 6 September 2017. These case studies validate the\nability of data-driven models to retrieve observations, including the formation\nand eruption of flux ropes, 3D magnetic reconnection, CME three-part structures\nand the failed eruption. Based on these results, we provide some arguments for\nthe formation mechanisms of flux ropes, the physical nature of the CME leading\nfront, and the constraints of failed eruptions.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Space Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}