{"id":"2408.06295","title":"Dual Threats in RIS-Aided RF-UOWC Mixed Networks: Secrecy Performance\n  Analysis under Simultaneous RF and UOWC Eavesdropping","authors":"Md. Abdur Rakib, Md. Ibrahim, A. S. M. Badrudduza, Imran Shafique\n  Ansari","authorsParsed":[["Rakib","Md. Abdur",""],["Ibrahim","Md.",""],["Badrudduza","A. S. M.",""],["Ansari","Imran Shafique",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 17:04:28 GMT"}],"updateDate":"2024-08-13","timestamp":1723482268000,"abstract":"  In the dynamic realm of 6G technology, emphasizing security is essential,\nparticularly for optimizing high-performance communication. A notable strategy\ninvolves the use of reconfigurable intelligent surfaces (RISs), an emerging and\ncost-efficient technology aimed at fortifying incoming signals, broadening\ncoverage, and ultimately improving the overall performance of systems. In this\npaper, we introduce a comprehensive framework to analyze the secrecy\nperformance of an RIS-assisted mixed radio frequency (RF) - underwater optical\nwireless communication (UOWC) network. Here, all the RF links undergo alpha-mu\nfading distribution, whereas the UOWC links experience a mixture of Exponential\nGeneralized Gamma distribution. Specifically, we examine three potential\neavesdropping situations: 1) eavesdropping on the RF link, 2) eavesdropping on\nthe UOWC link, and 3) a simultaneous eavesdropping attack affecting both RF and\nUOWC links. To achieve this, we derive novel mathematical expressions such as\naverage secrecy capacity, secrecy outage probability, strictly positive secrecy\ncapacity, and effective secrecy throughput in closed form. Using these derived\nexpressions, we carry out an investigation to assess the influences of fading\nparameters, pointing errors, receiver detection technique, underwater\nturbulence severity, and water salinity on the system. Furthermore, our study\ninvestigates the significance of RIS in improving secrecy performance due to\nthe proposed model. To provide deeper insights, we also perform asymptotic\nanalysis for the high signal-to-noise region. Finally, to verify our analytical\nresults, we conduct Monte Carlo simulation using a computer-based technique.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}