{"id":"2408.15908","title":"Constraints on Acoustic Wave Energy Fluxes and Radiative Losses in the\n  Solar Chromosphere from Non-LTE Inversions","authors":"J. M. da Silva Santos, M. Molnar, I. Mili\\'c, M. Rempel, K. Reardon,\n  J. de la Cruz Rodr\\'iguez","authorsParsed":[["Santos","J. M. da Silva",""],["Molnar","M.",""],["Milić","I.",""],["Rempel","M.",""],["Reardon","K.",""],["Rodríguez","J. de la Cruz",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 16:22:33 GMT"}],"updateDate":"2024-08-29","timestamp":1724862153000,"abstract":"  Accurately assessing the balance between acoustic wave energy fluxes and\nradiative losses is critical for understanding how the solar chromosphere is\nthermally regulated. We investigate the energy balance in the chromosphere by\ncomparing deposited acoustic flux and radiative losses under quiet and active\nsolar conditions using non-local thermodynamic equilibrium (NLTE) inversions\nwith the Stockholm Inversion Code (STiC). To achieve this, we utilize\nspectroscopic observations from the Interferometric BIdimensional Spectrometer\n(IBIS) in the Na I 5896 \\r{A} and Ca II 8542 \\r{A} lines and from the Interface\nRegion Imaging Spectrograph (IRIS) in the Mg II h and k lines to\nself-consistently derive spatially resolved velocity power spectra and cooling\nrates across different heights in the atmosphere. Additionally, we use\nsnapshots of a three-dimensional radiative-magnetohydrodynamics simulation to\ninvestigate the systematic effects of the inversion approach, particularly the\nattenuation effect on the velocity power spectra and the determination of the\ncooling rates. The results indicate that inversions potentially underestimate\nacoustic fluxes at all chromospheric heights while slightly overestimating the\nradiative losses when fitting these spectral lines. However, even after\naccounting for these biases, the ratio of acoustic flux to radiative losses\nremains below unity in most observed regions, particularly in the higher layers\nof the chromosphere. We also observe a correlation between the magnetic field\ninclination in the photosphere and radiative losses in the low chromosphere in\nplage, which is evidence that the field topology plays a role in the\nchromospheric losses.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}