{"id":"2408.10735","title":"On the kinematic nature of apparent discs at high redshifts: Local\n  counterparts are not dominated by ordered rotation but by tangentially\n  anisotropic random motion","authors":"Bitao Wang, Yingjie Peng, Michele Cappellari, Hua Gao, and Houjun Mo","authorsParsed":[["Wang","Bitao",""],["Peng","Yingjie",""],["Cappellari","Michele",""],["Gao","Hua",""],["Mo","Houjun",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 11:06:39 GMT"}],"updateDate":"2024-08-21","timestamp":1724151999000,"abstract":"  It is not straightforward to physically interpret the apparent morphology of\ngalaxies. Recent observations by James Webb Space Telescope (JWST) revealed a\ndominant galaxy population at high redshifts ($z>2$) that were visually\nclassified as discs for their flattened shapes and/or exponential light\nprofiles. The extensively accepted interpretation is that they are dynamically\ncold discs supported by bulk rotation. However, it is long known that flattened\nshapes and exponential profiles are not exclusive for rotating disc structure.\nTo break degeneracy and assess the rotational support of typical high-$z$\ngalaxies in the JWST samples, those with active star formation and stellar\nmasses $\\mathrm{lg}(\\mathcal{M}_{\\star}/\\mathcal{M}_{\\odot})\\sim9$, we study\nthe kinematics of their equal-mass counterparts at $z=0$. While these local\nstar-forming low-mass galaxies are photometrically similar to real dynamically\ncold discs, they are not supported by ordered rotation but primarily by random\nmotion, and their flattened shapes result largely from tangential orbital\nanisotropy. Given the empirical and theoretical evidence that young galaxies\nare dynamically hotter at higher redshifts, our results suggest that the\nhigh-$z$ JWST galaxies may not be cold discs but are dynamically warm/hot\ngalaxies with flattened shapes driven by anisotropy. While both having low\nrotational support, local low-mass galaxies possess oblate shapes, contrasting\nthe prolate shapes (i.e. cigar-like) of low-mass systems at high redshifts.\nSuch shape transition (prolate$\\Rightarrow$oblate) indicates an associated\nchange in orbital anisotropy (radial$\\Rightarrow$tangential), with roots likely\nin the assembly of their host dark matter halos.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}