{"id":"2408.14676","title":"Stable dynamic pricing scheme independent of lane-choice models for\n  high-occupancy-toll lanes","authors":"Wen-Long Jin, Xuting Wang, Yingyan Lou","authorsParsed":[["Jin","Wen-Long",""],["Wang","Xuting",""],["Lou","Yingyan",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 22:54:09 GMT"}],"updateDate":"2024-08-28","timestamp":1724712849000,"abstract":"  A stable dynamic pricing scheme is essential to guarantee the desired\nperformance of high-occupancy-toll (HOT) lanes, where single-occupancy vehicles\n(SOVs) can pay a price to use the HOT lanes. But existing methods apply to\neither only one type of lane-choice models with unknown parameters or different\ntypes of lane-choice models but with known parameters. In this study we present\na new dynamic pricing scheme that is stable and applies to different types of\nlane-choice models with unknown parameters. There are two operational\nobjectives for operating HOT lanes: (i) to maintain the free-flow condition to\nguarantee the travel time reliability; and (ii) to maximize the HOT lanes'\nthroughput to minimize the system's total delay. The traffic dynamics on both\nHOT and general purpose (GP) lanes are described by point queue models, where\nthe queueing times are determined by the demands and capacities. We consider\nthree types of lane-choice models: the multinomial logit model when SOVs share\nthe same value of time, the vehicle-based user equilibrium model when SOVs'\nvalues of time are heterogeneous and follow a distribution, and a general\nlane-choice model. We demonstrate that the second objective is approximately\nequivalent to the social welfare optimization principle for the logit model.\nObserving that the dynamic price and the excess queueing time on the GP lanes\nare linearly correlated in all the lane-choice models, we propose a feedback\ncontrol method to determine the dynamic prices based on two integral\ncontrollers. We further present a method to estimate the parameters of a\nlane-choice model once its type is known. Analytically we prove that the\nequilibrium state of the closed-loop system with constant demand patterns is\nideal, since the two objectives are achieved in it, and that it is\nasymptotically stable. With numerical examples we verify the effectiveness of\nthe solution method.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}