{"id":"2408.16436","title":"Role of nuclear deformation and orientation about symmetry axis of\n  target nucleus on heavy-ion fusion dynamics","authors":"Shilpa Rana, M. Bhuyan, Raj Kumar and B. V. Carlson","authorsParsed":[["Rana","Shilpa",""],["Bhuyan","M.",""],["Kumar","Raj",""],["Carlson","B. V.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 10:54:08 GMT"}],"updateDate":"2024-08-30","timestamp":1724928848000,"abstract":"  Nuclear shape and orientation degrees of freedom are incorporated into the\ncalculation of the double-folding nuclear potential within the relativistic\nmean-field (RMF) formalism. The quadrupole deformations ($\\beta_2$), nuclear\ndensities and the effective nucleon-nucleon (NN) interaction potential are\nobtained using the RMF approach for the Hybrid, NL3$^*$ and NL3\nparameterizations. The calculated quadrupole deformations are included in the\ntarget densities through the nuclear radius. The deformation and\norientation-dependent microscopic nuclear potentials are further employed to\nobtain fusion barrier characteristics and cross-sections for 12 even-even\nheavy-ion reactions with doubly magic spherical $^{16}$O and $^{48}$Ca as\nprojectiles along with deformed targets from different mass regions. The\nresults obtained for the relativistic R3Y NN potential are compared with those\nof the Reid version of the non-relativistic M3Y NN potential as well as with\nthe available experimental data. A decrease in the barrier height and increase\nin the cross-section is observed upon the inclusion of target quadrupole\ndeformations in the nuclear density distributions at the target orientation\nangles, $\\theta_2\\le58^\\circ$ for the R3Y NN potential and at\n$\\theta_2\\le60^\\circ$ for the M3Y NN potential. On comparing the\n$\\theta_2$-integrated cross-section calculated using M3Y and R3Y NN potentials\nwith spherical and deformed densities, one observes that the deformed densities\nand the relativistic R3Y NN potential obtained for the Hybrid parameter set\nprovide better agreement with the available experimental data for all the\nconsidered reactions. Moreover, the modifications in the characteristics of the\nfusion barrier and hence in the cross-section with the inclusion of nuclear\nshape degrees of freedom and orientations are found to become more prominent in\nreactions forming heavier compound nuclei.\n","subjects":["Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"rAwUfW61UftseQHiwMcixCxMaAdlj8O6gIDWQvHJzmU","pdfSize":"1206568"}
