{"id":"2408.15770","title":"Unprecedented Enhancement of Piezoelectricity in Wurtzite Nitride\n  Semiconductors via Thermal Annealing","authors":"Shubham Mondal, Md Mehedi Hasan Tanim, Garrett Baucom, Shaurya S.\n  Dabas, Jinghan Gao, Venkateswarlu Gaddam, Jiangnan Liu, Aiden Ross, Long-Qing\n  Chen, Honggyu Kim, Roozbeh Tabrizian and Zetian Mi","authorsParsed":[["Mondal","Shubham",""],["Tanim","Md Mehedi Hasan",""],["Baucom","Garrett",""],["Dabas","Shaurya S.",""],["Gao","Jinghan",""],["Gaddam","Venkateswarlu",""],["Liu","Jiangnan",""],["Ross","Aiden",""],["Chen","Long-Qing",""],["Kim","Honggyu",""],["Tabrizian","Roozbeh",""],["Mi","Zetian",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 13:06:09 GMT"}],"updateDate":"2024-08-29","timestamp":1724850369000,"abstract":"  The incorporation of rare-earth elements in wurtzite nitride semiconductors,\ne.g., scandium alloyed aluminum nitride (ScAlN), promises dramatically enhanced\npiezoelectric responses, critical to a broad range of acoustic, electronic,\nphotonic, and quantum devices and applications. Experimentally, however, the\nmeasured piezoelectric responses of nitride semiconductors are far below what\ntheory has predicted. Here, we show that the use of a simple, scalable,\npost-growth thermal annealing process can dramatically boost the piezoelectric\nresponse of ScAlN thin films. We achieve a remarkable 3.5-fold increase in the\npiezoelectric modulus, d33 for 30% Sc content ScAlN, from 12.3 pC/N in the\nas-grown state to 45.5 pC/N, which is eight times larger than that of AlN. The\nenhancement in piezoelectricity has been unambiguously confirmed by three\nseparate measurement techniques. Such a dramatic enhancement of d33 has been\nshown to impact the effective electromechanical coupling coefficient kt2 :\nincreasing it from 13.8% to 76.2%, which matches the highest reported values in\nmillimeter thick lithium niobate films but is achieved in a 100 nm ScAlN with a\n10,000 fold reduction in thickness, thus promising extreme frequency scaling\nopportunities for bulk acoustic wave resonators for beyond 5G applications. By\nutilizing a range of material characterization techniques, we have elucidated\nthe underlying mechanisms for the dramatically enhanced piezoelectric\nresponses, including improved structural quality at the macroscopic scale, more\nhomogeneous and ordered distribution of domain structures at the mesoscopic\nscale, and the reduction of lattice parameter ratio (c/a) for the wurtzite\ncrystal structure at the atomic scale. Overall, the findings present a simple\nyet highly effective pathway that can be extended to other material families to\nfurther enhance their piezo responses.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"N-XaGXuWtWzn7yYb66B8gI2luA8Kb5gnMP3zTJ5OQl8","pdfSize":"1076379"}
