{"id":"2408.08060","title":"Reliable Communication in Hybrid Authentication and Trust Models","authors":"Rowdy Chotkan, Bart Cox, Vincent Rahli, J\\'er\\'emie Decouchant","authorsParsed":[["Chotkan","Rowdy",""],["Cox","Bart",""],["Rahli","Vincent",""],["Decouchant","Jérémie",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 10:01:24 GMT"}],"updateDate":"2024-08-16","timestamp":1723716084000,"abstract":"  Reliable communication is a fundamental distributed communication abstraction\nthat allows any two nodes of a network to communicate with each other. It is\nnecessary for more powerful communication primitives, such as broadcast and\nconsensus. Using different authentication models, two classical protocols\nimplement reliable communication in unknown and sufficiently connected\nnetworks. In the first one, network links are authenticated, and processes rely\non dissemination paths to authenticate messages. In the second one, processes\ngenerate digital signatures that are flooded in the network. This work\nconsiders the hybrid system model that combines authenticated links and\nauthenticated processes. We additionally aim to leverage the possible presence\nof trusted nodes and trusted components in networks, which have been assumed in\nthe scientific literature and in practice. We first extend the two classical\nreliable communication protocols to leverage trusted nodes. We then propose\nDualRC, a novel algorithm that enables reliable communication in the hybrid\nauthentication model by manipulating both dissemination paths and digital\nsignatures, and leverages the possible presence of trusted nodes (e.g., network\ngateways) and trusted components (e.g., Intel SGX enclaves). We provide\ncorrectness verification algorithms to assess whether our algorithms implement\nreliable communication for all nodes on a given network.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/"}