{"id":"2408.09915","title":"Optically pumped vector magnetometer using a strong bias magnetic field","authors":"Thomas Sch\\\"onau, Theo Scholtes, Florian Wittk\\\"amper, Alexander\n  Sekels, Stefan Hiebel, Gregor Oelsner, Ronny Stolz","authorsParsed":[["Schönau","Thomas",""],["Scholtes","Theo",""],["Wittkämper","Florian",""],["Sekels","Alexander",""],["Hiebel","Stefan",""],["Oelsner","Gregor",""],["Stolz","Ronny",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 11:40:54 GMT"}],"updateDate":"2024-08-20","timestamp":1724067654000,"abstract":"  We present a novel approach allowing an optically pumped magnetometer (OPM)\nto be operated within Earth's magnetic field as a vector magnetometer whose\nsensitive axis can be freely defined. This approach enables the measurement of\nany vector component of the Earth's magnetic field with the same sensitivity.\nThe OPM is realized by a microfabricated cesium vapor cell with nitrogen buffer\ngas, which is immersed into a homogeneous bias field of about 730 $\\mathrm{\\mu\nT}$. Since this bias field is about one order of magnitude stronger than\nEarth's magnetic field, it defines the sensitive axis of the OPM. The bias\nfield is generated by solid-state magnets and was designed to exhibit a very\nlow relative inhomogeneity ($< 10^{-4}$ in relative units) within the vapor\ncell dimensions as well as a point of vanishing temperature dependence at\naround 40{\\deg}C. The OPM utilizes the light narrowing effect, which enables\neffective suppression of spin-exchange relaxation even in such large magnetic\nfield amplitude. Based on this implementation, we demonstrate a white noise\nfloor of below 60 $\\mathrm{fT/\\sqrt{Hz}}$ in the interval between 100 Hz and\n600 Hz and a sensor bandwidth of $> 2$ kHz. Our approach enables unshielded\nultrasensitive vectorial measurement capabilities relevant in many important\napplications.\n","subjects":["Physics/Instrumentation and Detectors","Physics/Atomic Physics","Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}