{"id":"2408.04815","title":"Towards improving Alzheimer's intervention: a machine learning approach\n  for biomarker detection through combining MEG and MRI pipelines","authors":"Alwani Liyana Ahmad, Jose Sanchez-Bornot, Roberto C. Sotero, Damien\n  Coyle, Zamzuri Idris, and Ibrahima Faye","authorsParsed":[["Ahmad","Alwani Liyana",""],["Sanchez-Bornot","Jose",""],["Sotero","Roberto C.",""],["Coyle","Damien",""],["Idris","Zamzuri",""],["Faye","Ibrahima",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 02:15:01 GMT"}],"updateDate":"2024-08-12","timestamp":1723169701000,"abstract":"  MEG are non invasive neuroimaging techniques with excellent temporal and\nspatial resolution, crucial for studying brain function in dementia and\nAlzheimer Disease. They identify changes in brain activity at various Alzheimer\nstages, including preclinical and prodromal phases. MEG may detect pathological\nchanges before clinical symptoms, offering potential biomarkers for\nintervention. This study evaluates classification techniques using MEG features\nto distinguish between healthy controls and mild cognitive impairment\nparticipants from the BioFIND study. We compare MEG based biomarkers with MRI\nbased anatomical features, both independently and combined. We used 3 Tesla MRI\nand MEG data from 324 BioFIND participants;158 MCI and 166 HC. Analyses were\nperformed using MATLAB with SPM12 and OSL toolboxes. Machine learning analyses,\nincluding 100 Monte Carlo replications of 10 fold cross validation, were\nconducted on sensor and source spaces. Combining MRI with MEG features achieved\nthe best performance; 0.76 accuracy and AUC of 0.82 for GLMNET using LCMV\nsource based MEG. MEG only analyses using LCMV and eLORETA also performed well,\nsuggesting that combining uncorrected MEG with z-score-corrected MRI features\nis optimal.\n","subjects":["Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing","Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"F3FUX-uAtgyC90rigectSRasMkGdWkMz8Hn4rUZZ7t0","pdfSize":"11968302"}
