{"id":"2408.06952","title":"High-speed ditching of double curvature specimens with cavitation and\n  ventilation","authors":"Emanuele Spinosa, Silvano Grizzi, Alessandro Iafrati","authorsParsed":[["Spinosa","Emanuele",""],["Grizzi","Silvano",""],["Iafrati","Alessandro",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 15:11:44 GMT"}],"updateDate":"2024-08-14","timestamp":1723561904000,"abstract":"  The water entry at high horizontal speed of double-curvature specimens,\nreproducing the rear part of the fuselage that first gets in contact with the\nwater during aircraft ditching, is investigated experimentally. Three shapes\nare analysed, representing different aircraft types. Pressure and load\nmeasurements are taken, supported by underwater high-speed visualization. The\neffects of different horizontal speeds, pitch angles, and curvatures are\nanalysed, while keeping a constant vertical-to-horizontal velocity ratio. It is\nobserved that the longitudinal curvature plays a significant role in the\nhydrodynamics, potentially leading to cavitation and ventilation in the rear\npart of the specimen at high speeds. The transverse curvature affects the\npressures and loads both at the front and at the rear, since a lower transverse\ncurvature increases the possibility of the fluid to escape from the sides. An\nincrease in pitch angle results in an increased loading, in terms of both\namplitude and distribution. Finally, an increased horizontal speed leads to\nhigher loads at the front but also affects the cavitation and ventilation\nmodalities at the rear. The load scaling for flat plates also applies to these\nspecimens at the front, but the occurrence of cavitation and ventilation\ninvalidates it at the rear. The time evolution of the cavitation region and of\nthe wetted area are examined through advanced image processing techniques and\npressure data analysis. The comparison with the geometric intersection area of\nthe specimen with the still water surface provides further insight into the\nhydrodynamic phenomena during the water entry.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}