{"id":"2408.08092","title":"OC3D: Weakly Supervised Outdoor 3D Object Detection with Only Coarse\n  Click Annotation","authors":"Qiming Xia, Hongwei Lin, Wei Ye, Hai Wu, Yadan Luo, Shijia Zhao, Xin\n  Li, Chenglu Wen","authorsParsed":[["Xia","Qiming",""],["Lin","Hongwei",""],["Ye","Wei",""],["Wu","Hai",""],["Luo","Yadan",""],["Zhao","Shijia",""],["Li","Xin",""],["Wen","Chenglu",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 11:34:53 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 02:28:12 GMT"}],"updateDate":"2024-08-19","timestamp":1723721693000,"abstract":"  LiDAR-based outdoor 3D object detection has received widespread attention.\nHowever, training 3D detectors from the LiDAR point cloud typically relies on\nexpensive bounding box annotations. This paper presents OC3D, an innovative\nweakly supervised method requiring only coarse clicks on the bird's eye view of\nthe 3D point cloud. A key challenge here is the absence of complete geometric\ndescriptions of the target objects from such simple click annotations. To\naddress this problem, our proposed OC3D adopts a two-stage strategy. In the\nfirst stage, we initially design a novel dynamic and static classification\nstrategy and then propose the Click2Box and Click2Mask modules to generate\nbox-level and mask-level pseudo-labels for static and dynamic instances,\nrespectively. In the second stage, we design a Mask2Box module, leveraging the\nlearning capabilities of neural networks to update mask-level pseudo-labels,\nwhich contain less information, to box-level pseudo-labels. Experimental\nresults on the widely used KITTI and nuScenes datasets demonstrate that our\nOC3D with only coarse clicks achieves state-of-the-art performance compared to\nweakly-supervised 3D detection methods. Combining OC3D with a missing click\nmining strategy, we propose an OC3D++ pipeline, which requires only 0.2%\nannotation cost in the KITTI dataset to achieve performance comparable to fully\nsupervised methods. The code will be made publicly available.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}