{"id":"2408.11122","title":"First joint MUSE, HST, and JWST spectro-photometric analysis of the\n  intracluster light: the case of the relaxed cluster RX J2129.7+0005","authors":"Yolanda Jim\\'enez-Teja, Antonio Gimenez-Alcazar, Renato A. Dupke,\n  Patrick Prado-Santos, Jose M. V\\'ilchez, N\\'icolas O. L. de Oliveira, Paola\n  Dimauro, Anton M. Koekemoer, Patrick Kelly, Jens Hjorth, and Wenlei Chen","authorsParsed":[["Jiménez-Teja","Yolanda",""],["Gimenez-Alcazar","Antonio",""],["Dupke","Renato A.",""],["Prado-Santos","Patrick",""],["Vílchez","Jose M.",""],["de Oliveira","Nícolas O. L.",""],["Dimauro","Paola",""],["Koekemoer","Anton M.",""],["Kelly","Patrick",""],["Hjorth","Jens",""],["Chen","Wenlei",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 18:24:26 GMT"}],"updateDate":"2024-08-22","timestamp":1724178266000,"abstract":"  We present the most detailed spectrum of the intracluster light (ICL) in an\nindividual cluster to date, the relaxed system RX J2129.7+0005, at $z\\sim\n0.234$. Using 15 broad-band, deep images observed with HST and JWST in the\noptical and the infrared, plus deep integral field spectroscopy from MUSE, we\ncomputed a total of 3696 ICL maps spanning the spectral range $\\sim 0.4-5$\n$\\mu$m with our algorithm CICLE, a method that is extremely well suited to\nanalyzing large samples of data in a fully automated way. We used both\nparametric and non-parametric approaches to fit the spectral energy\ndistribution of the ICL and infer its physical properties, yielding a stellar\nmass $log_{10}(M_*/M_{\\odot})$ between $11.5-12.7$ and an average age between\n$9.7-10.5$ Gyr, from CIGALE and Prospector results. This implies that the ICL\nin RX J2129.7+0005 is, on average, older than that of disturbed clusters,\nsuggesting that the contribution from different stellar populations to the ICL\nare at play depending on the cluster's dynamical state. Coupled with X-ray\nobservations of the hot gas distribution, we confirm the relaxed state of RX\nJ2129.7+0005, showing clear signs of sloshing after a last major merger with a\nhigh-mass ratio satellite that could have happened $\\sim 6.6$ Gyr ago in a\nrelatively radial orbit. The presence of substructure in the ICL, such as\nshells, clouds with different densities and a certain degree of boxyness, and a\nclump, supports this scenario.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"uRkIft_V5uj2i_3E3N4taQBmR_c1bOhv86xfD1DDv5Y","pdfSize":"34294422"}
