{"id":"2408.13630","title":"DeepVoting: Learning Voting Rules with Tailored Embeddings","authors":"Leonardo Matone, Ben Abramowitz, Nicholas Mattei, Avinash Balakrishnan","authorsParsed":[["Matone","Leonardo",""],["Abramowitz","Ben",""],["Mattei","Nicholas",""],["Balakrishnan","Avinash",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 17:15:20 GMT"}],"updateDate":"2024-08-28","timestamp":1724519720000,"abstract":"  Aggregating the preferences of multiple agents into a collective decision is\na common step in many important problems across areas of computer science\nincluding information retrieval, reinforcement learning, and recommender\nsystems. As Social Choice Theory has shown, the problem of designing algorithms\nfor aggregation rules with specific properties (axioms) can be difficult, or\nprovably impossible in some cases. Instead of designing algorithms by hand, one\ncan learn aggregation rules, particularly voting rules, from data. However, the\nprior work in this area has required extremely large models, or been limited by\nthe choice of preference representation, i.e., embedding. We recast the problem\nof designing a good voting rule into one of learning probabilistic versions of\nvoting rules that output distributions over a set of candidates. Specifically,\nwe use neural networks to learn probabilistic social choice functions from the\nliterature. We show that embeddings of preference profiles derived from the\nsocial choice literature allows us to learn existing voting rules more\nefficiently and scale to larger populations of voters more easily than other\nwork if the embedding is tailored to the learning objective. Moreover, we show\nthat rules learned using embeddings can be tweaked to create novel voting rules\nwith improved axiomatic properties. Namely, we show that existing voting rules\nrequire only minor modification to combat a probabilistic version of the No\nShow Paradox.\n","subjects":["Computing Research Repository/Multiagent Systems","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Machine Learning","Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/"}