{"id":"2408.14584","title":"DIAGen: Diverse Image Augmentation with Generative Models","authors":"Tobias Lingenberg, Markus Reuter, Gopika Sudhakaran, Dominik Gojny,\n  Stefan Roth, Simone Schaub-Meyer","authorsParsed":[["Lingenberg","Tobias",""],["Reuter","Markus",""],["Sudhakaran","Gopika",""],["Gojny","Dominik",""],["Roth","Stefan",""],["Schaub-Meyer","Simone",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 19:09:13 GMT"}],"updateDate":"2024-08-28","timestamp":1724699353000,"abstract":"  Simple data augmentation techniques, such as rotations and flips, are widely\nused to enhance the generalization power of computer vision models. However,\nthese techniques often fail to modify high-level semantic attributes of a\nclass. To address this limitation, researchers have explored generative\naugmentation methods like the recently proposed DA-Fusion. Despite some\nprogress, the variations are still largely limited to textural changes, thus\nfalling short on aspects like varied viewpoints, environment, weather\nconditions, or even class-level semantic attributes (eg, variations in a dog's\nbreed). To overcome this challenge, we propose DIAGen, building upon DA-Fusion.\nFirst, we apply Gaussian noise to the embeddings of an object learned with\nTextual Inversion to diversify generations using a pre-trained diffusion\nmodel's knowledge. Second, we exploit the general knowledge of a text-to-text\ngenerative model to guide the image generation of the diffusion model with\nvaried class-specific prompts. Finally, we introduce a weighting mechanism to\nmitigate the impact of poorly generated samples. Experimental results across\nvarious datasets show that DIAGen not only enhances semantic diversity but also\nimproves the performance of subsequent classifiers. The advantages of DIAGen\nover standard augmentations and the DA-Fusion baseline are particularly\npronounced with out-of-distribution samples.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}