{"id":"2408.06976","title":"Optical Control of Ultrafast Photocurrent in Graphene","authors":"Navdeep Rana and Gopal Dixit","authorsParsed":[["Rana","Navdeep",""],["Dixit","Gopal",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 15:33:09 GMT"}],"updateDate":"2024-08-14","timestamp":1723563189000,"abstract":"  The ability to manipulate electrons with the intense laser pulse enables an\nunprecedented control over the electronic motion on its intrinsic timescale.\nPresent work explores the desired control of photocurrent generation in\nmonolayer graphene on ultrafast timescale. The origin of photocurrent is\nattributed to the asymmetric residual electronic population in the conduction\nband after the end of the laser pulse, which also facilitates valley\npolarization. Present study offers a comprehensive analysis of the differences\nbetween these two observables, namely photocurrent and valley polarization. It\nis found that the corotating circularly polarized $\\omega-2\\omega$ laser pulses\nallow the generation of photocurrent but no valley polarization, whereas\ncounterrotating circularly polarized $\\omega-2\\omega$ laser pulses yield\nsignificant valley polarization without any photocurrent in graphene. Different\nlaser parameters, such as subcycle phase, wavelength, and intensity provide\ndifferent knobs to control the generation of the photocurrent. In addition,\nthreefold increase in the photocurrent's amplitude can be achieved by altering\nelectronic properties of graphene via strain engineering. Our findings reveal\nintriguing underlying mechanisms into the interplay between the symmetries of\nthe graphene's electronic structure and the driving laser pulses, shedding\nlight on the potential for harnessing graphene's properties for novel\napplications in ultrafast photonics, optoelectronic devices, and quantum\ntechnologies.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"edhcR_x2-UWvHU8DXdKDw2YZvCzLPiwTrgOM22-4YR4","pdfSize":"830894"}
