{"id":"2408.09213","title":"Complexions at the Iron-Magnetite Interface","authors":"Xuyang Zhou and Baptiste Bienvenu and Yuxiang Wu and Alisson\n  Kwiatkowski da Silva and Colin Ophus and Dierk Raabe","authorsParsed":[["Zhou","Xuyang",""],["Bienvenu","Baptiste",""],["Wu","Yuxiang",""],["da Silva","Alisson Kwiatkowski",""],["Ophus","Colin",""],["Raabe","Dierk",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 14:44:49 GMT"}],"updateDate":"2024-08-20","timestamp":1723905889000,"abstract":"  Synthesizing distinct phases and controlling the crystalline defects in them\nare key concepts in materials and process design. These approaches are usually\ndescribed by decoupled theories, with the former resting on equilibrium\nthermodynamics and the latter on nonequilibrium kinetics. By combining them\ninto a holistic form of defect phase diagrams, we can apply phase equilibrium\nmodels to the thermodynamic evaluation of defects such as vacancies,\ndislocations, surfaces, grain boundaries, and phase boundaries, placing the\nunderstanding of material imperfections and their role on properties on solid\nthermodynamic and theoretical grounds. In this study, we characterize an\ninterface-stabilized phase between Fe and Fe3O4 (magnetite) with differential\nphase contrast (DPC) imaging in scanning transmission electron microscopy\n(STEM). This method uniquely enables the simultaneous imaging of both heavy Fe\natoms and light O atoms, providing precise mapping of the atomic structure and\nchemical composition at this heterogeneous metal-oxide interface. We identify a\nwell-ordered two-layer interface-stabilized phase state (referred to as\ncomplexion) at the Fe[001]/Fe3O4[001] interface. Using density-functional\ntheory (DFT), we not only explain the observed complexion but also map out\nvarious interface-stabilized phases as a function of the O chemical potential.\nWe show that the formation of complexions influences the properties of the\ninterface, increasing its adhesion by 20 % and changing the charge transfer\nbetween adjacent materials, also leveraging impact on the transport properties\nacross such interfaces. Our findings highlight the potential of tunable phase\nstates at defects as a new asset in advanced materials design, paving the way\nfor knowledge-based and optimized corrosion protection, catalysis, magnetism,\nand redox-driven phase transitions.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}