{"id":"2408.02071","title":"Scientific Exploration with Expert Knowledge (SEEK) in Autonomous\n  Scanning Probe Microscopy with Active Learning","authors":"Utkarsh Pratiush, Hiroshi Funakubo, Rama Vasudevan, Sergei V. Kalinin,\n  Yongtao Liu","authorsParsed":[["Pratiush","Utkarsh",""],["Funakubo","Hiroshi",""],["Vasudevan","Rama",""],["Kalinin","Sergei V.",""],["Liu","Yongtao",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 15:47:14 GMT"}],"updateDate":"2024-08-06","timestamp":1722786434000,"abstract":"  Microscopy techniques have played vital roles in materials science, biology,\nand nanotechnology, offering high-resolution imaging and detailed insights into\nproperties at nanoscale and atomic level. The automation of microscopy\nexperiments, in combination with machine learning approaches, is a\ntransformative advancement, offering increased efficiency, reproducibility, and\nthe capability to perform complex experiments. Our previous work on autonomous\nexperimentation with scanning probe microscopy (SPM) demonstrated an active\nlearning framework using deep kernel learning (DKL) for structure-property\nrelationship discovery. This approach has demonstrated broad applications in\nvarious microscopy techniques. Here, to address limitations of workflows based\non DKL, we developed methods to incorporate prior knowledge and human interest\ninto DKL-based workflows and implemented these workflows in SPM. By integrating\nexpected rewards from structure libraries or spectroscopic features, we\nenhanced the exploration efficiency of autonomous microscopy, demonstrating\nmore efficient and targeted exploration in autonomous microscopy. We\ndemonstrated the application of these methods in SPM, but we suggest that these\nmethods can be seamlessly applied to other microscopy and imaging techniques.\nFurthermore, the concept can be adapted for general Bayesian optimization in\nmaterial discovery across a broad range of autonomous experimental fields.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}