{"id":"2408.13590","title":"Engineering biphoton spectral wavefunction in a silicon micro-ring\n  resonator with split resonances","authors":"Liao Ye, Haoran Ma, Xiaoqing Guo, Fanjie Ruan, Yuehai Wang, and Jianyi\n  Yang","authorsParsed":[["Ye","Liao",""],["Ma","Haoran",""],["Guo","Xiaoqing",""],["Ruan","Fanjie",""],["Wang","Yuehai",""],["Yang","Jianyi",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 14:23:21 GMT"}],"updateDate":"2024-08-27","timestamp":1724509401000,"abstract":"  Frequency-time is a degree of freedom suitable for photonic high-dimensional\nentanglement, with advantages such as compatibility with single-mode devices\nand insensitivity to dispersion. The engineering control of the frequency-time\namplitude of a photon's electric field has been demonstrated on platforms with\nsecond-order optical nonlinearity. For integrated photonic platforms with only\nthird-order optical nonlinearity, the engineered generation of the state\nremains unexplored. Here, we demonstrate a cavity-enhanced photon-pair source\non the silicon-on-insulator (SOI) platform that can generate both separable\nstates and controllable entangled states in the frequency domain without\npost-manipulation. By choosing different resonance combinations and employing\non-chip optical field differentiation, we achieve independent control over two\nfunctions that affect the joint spectral intensity (JSI) of the state. A\nsemi-analytical model is derived to simulate the biphoton spectral wavefunction\nin the presence of resonance splitting and pump differentiation, and its\nparameters can be fully determined through fitting-based parameter extraction\nfrom the resonator's measured linear response. The measured spectral purity for\nthe separable state is $95.5\\pm 1.2\\%$, while the measured JSIs for the\nentangled states show two- or four-peaked functions in two-dimensional\nfrequency space. The experiments and simulations demonstrate the capacity to\nmanipulate the frequency-domain wavefunction in a silicon-based device, which\nis promising for applications like quantum information processing using pulsed\ntemporal-mode encoding or long-distance quantum key distribution.\n","subjects":["Physics/Quantum Physics","Physics/Applied Physics","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}