{"id":"2408.03156","title":"Iterative CT Reconstruction via Latent Variable Optimization of Shallow\n  Diffusion Models","authors":"Sho Ozaki, Shizuo Kaji, Toshikazu Imae, Kanabu Nawa, Hideomi\n  Yamashita, Keiichi Nakagawa","authorsParsed":[["Ozaki","Sho",""],["Kaji","Shizuo",""],["Imae","Toshikazu",""],["Nawa","Kanabu",""],["Yamashita","Hideomi",""],["Nakagawa","Keiichi",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 12:55:17 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 11:28:07 GMT"}],"updateDate":"2024-09-13","timestamp":1722948917000,"abstract":"  Image-generative artificial intelligence (AI) has garnered significant\nattention in recent years. In particular, the diffusion model, a core component\nof generative AI, produces high-quality images with rich diversity. In this\nstudy, we proposed a novel computed tomography (CT) reconstruction method by\ncombining the denoising diffusion probabilistic model with iterative CT\nreconstruction. In sharp contrast to previous studies, we optimized the\nfidelity loss of CT reconstruction with respect to the latent variable of the\ndiffusion model, instead of the image and model parameters. To suppress the\nchanges in anatomical structures produced by the diffusion model, we shallowed\nthe diffusion and reverse processes and fixed a set of added noises in the\nreverse process to make it deterministic during the inference. We demonstrated\nthe effectiveness of the proposed method through the sparse-projection CT\nreconstruction of 1/10 projection data. Despite the simplicity of the\nimplementation, the proposed method has the potential to reconstruct\nhigh-quality images while preserving the patient's anatomical structures and\nwas found to outperform existing methods, including iterative reconstruction,\niterative reconstruction with total variation, and the diffusion model alone in\nterms of quantitative indices such as the structural similarity index and peak\nsignal-to-noise ratio. We also explored further sparse-projection CT\nreconstruction using 1/20 projection data with the same trained diffusion\nmodel. As the number of iterations increased, the image quality improved\ncomparable to that of 1/10 sparse-projection CT reconstruction. In principle,\nthis method can be widely applied not only to CT but also to other imaging\nmodalities.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Physics/Medical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}