{"id":"2408.08901","title":"Bayesian inference to improve quality of Retrieval Augmented Generation","authors":"Dattaraj Rao","authorsParsed":[["Rao","Dattaraj",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 08:54:32 GMT"}],"updateDate":"2024-08-20","timestamp":1723452872000,"abstract":"  Retrieval Augmented Generation or RAG is the most popular pattern for modern\nLarge Language Model or LLM applications. RAG involves taking a user query and\nfinding relevant paragraphs of context in a large corpus typically captured in\na vector database. Once the first level of search happens over a vector\ndatabase, the top n chunks of relevant text are included directly in the\ncontext and sent as prompt to the LLM. Problem with this approach is that\nquality of text chunks depends on effectiveness of search. There is no strong\npost processing after search to determine if the chunk does hold enough\ninformation to include in prompt. Also many times there may be chunks that have\nconflicting information on the same subject and the model has no prior\nexperience which chunk to prioritize to make a decision. Often times, this\nleads to the model providing a statement that there are conflicting statements,\nand it cannot produce an answer. In this research we propose a Bayesian\napproach to verify the quality of text chunks from the search results. Bayes\ntheorem tries to relate conditional probabilities of the hypothesis with\nevidence and prior probabilities. We propose that, finding likelihood of text\nchunks to give a quality answer and using prior probability of quality of text\nchunks can help us improve overall quality of the responses from RAG systems.\nWe can use the LLM itself to get a likelihood of relevance of a context\nparagraph. For prior probability of the text chunk, we use the page number in\nthe documents parsed. Assumption is that that paragraphs in earlier pages have\na better probability of being findings and more relevant to generalizing an\nanswer.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/"}