{"id":"2408.12224","title":"The MAGPI Survey: the evolution and drivers of gas turbulence in\n  intermediate-redshift galaxies","authors":"Yifan Mai, Scott M. Croom, Emily Wisnioski, Sam P. Vaughan, Mathew R.\n  Varidel, Andrew J. Battisti, J. Trevor Mendel, Marcie Mun, Takafumi Tsukui,\n  Caroline Foster, Katherine E. Harborne, Claudia D. P. Lagos, Di Wang, Sabine\n  Bellstedt, Joss Bland-Hawthorn, Matthew Colless, Francesco D'Eugenio, Kathryn\n  Grasha, Yingjie Peng, Giulia Santucci, Sarah M. Sweet, Sabine Thater, Lucas\n  M. Valenzuela, and Bodo Ziegler","authorsParsed":[["Mai","Yifan",""],["Croom","Scott M.",""],["Wisnioski","Emily",""],["Vaughan","Sam P.",""],["Varidel","Mathew R.",""],["Battisti","Andrew J.",""],["Mendel","J. Trevor",""],["Mun","Marcie",""],["Tsukui","Takafumi",""],["Foster","Caroline",""],["Harborne","Katherine E.",""],["Lagos","Claudia D. P.",""],["Wang","Di",""],["Bellstedt","Sabine",""],["Bland-Hawthorn","Joss",""],["Colless","Matthew",""],["D'Eugenio","Francesco",""],["Grasha","Kathryn",""],["Peng","Yingjie",""],["Santucci","Giulia",""],["Sweet","Sarah M.",""],["Thater","Sabine",""],["Valenzuela","Lucas M.",""],["Ziegler","Bodo",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 08:50:01 GMT"}],"updateDate":"2024-08-23","timestamp":1724316601000,"abstract":"  We measure the ionised gas velocity dispersions of star-forming galaxies in\nthe MAGPI survey ($z\\sim0.3$) and compare them with galaxies in the SAMI\n($z\\sim0.05$) and KROSS ($z\\sim1$) surveys to investigate how the ionised gas\nvelocity dispersion evolves. For the first time, we use a consistent method\nthat forward models galaxy kinematics from $z=0$ to $z=1$. This method accounts\nfor spatial substructure in emission line flux and beam smearing. We\ninvestigate the correlation between gas velocity dispersion and galaxy\nproperties to understand the mechanisms that drive gas turbulence. We find that\nin both MAGPI and SAMI galaxies, the gas velocity dispersion more strongly\ncorrelates with the star-formation rate surface density ($\\Sigma_{\\rm SFR}$)\nthan with a variety of other physical properties, and the average gas velocity\ndispersion is similar, at the same $\\Sigma_{\\rm SFR}$, for SAMI, MAGPI and\nKROSS galaxies. The results indicate that mechanisms related to $\\Sigma_{\\rm\nSFR}$ could be the dominant driver of gas turbulence from $z\\sim1$ to $z\\sim0$,\nfor example, stellar feedback and/or gravitational instability. The gas\nvelocity dispersion of MAGPI galaxies is also correlated with the\nnon-rotational motion of the gas, illustrating that in addition to\nstar-formation feedback, gas transportation and accretion may also contribute\nto the gas velocity dispersion for galaxies at $z\\sim 0.3$. KROSS galaxies only\nhave a moderate correlation between gas velocity dispersion and $\\Sigma_{\\rm\nSFR}$ and a higher scatter of gas velocity dispersion with respect to\n$\\Sigma_{\\rm SFR}$, in agreement with the suggestion that other mechanisms,\nsuch as gas transportation and accretion, are relatively more important at\nhigher redshift galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}