{"id":"2408.13284","title":"From Radiologist Report to Image Label: Assessing Latent Dirichlet\n  Allocation in Training Neural Networks for Orthopedic Radiograph\n  Classification","authors":"Jakub Olczak and Max Gordon","authorsParsed":[["Olczak","Jakub",""],["Gordon","Max",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 19:47:25 GMT"}],"updateDate":"2024-08-27","timestamp":1724356045000,"abstract":"  Background: Radiography (X-rays) is the dominant modality in orthopedics, and\nimproving the interpretation of radiographs is clinically relevant. Machine\nlearning (ML) has revolutionized data analysis and has been applied to\nmedicine, with some success, in the form of natural language processing (NLP)\nand artificial neural networks (ANN). Latent Dirichlet allocation (LDA) is an\nNLP method that automatically categorizes documents into topics. Successfully\napplying ML to orthopedic radiography could enable the creation of\ncomputer-aided decision systems for use in the clinic. We studied how an\nautomated ML pipeline could classify orthopedic trauma radiographs from\nradiologist reports. Methods: Wrist and ankle radiographs from Danderyd\nHospital in Sweden taken between 2002 and 2015, with radiologist reports. LDA\nwas used to create image labels for radiographs from the radiologist reports.\nRadiographs and labels were used to train an image recognition ANN. The ANN\noutcomes were manually reviewed to get an accurate estimate of the method's\nutility and accuracy. Results: Image Labels generated via LDA could\nsuccessfully train the ANN. The ANN reached an accuracy between 91% and 60%\ncompared to a gold standard, depending on the label. Conclusions: We found that\nLDA was unsuited to label orthopedic radiographs from reports with high\naccuracy. However, despite this, the ANN could learn to detect some features in\nradiographs with high accuracy. The study also illustrates how ML and ANN can\nbe applied to medical research.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"2OX76YrmM_0d5AXYBh56FKygsBBG9eXOXPyk83BHXtc","pdfSize":"764771"}
