{"id":"2408.10389","title":"Enhancement of Photoresponse for InGaAs Infrared Photodetectors Using\n  Plasmonic WO3-x/CsyWO3-x Nanocrystals","authors":"Zach D. Merino, Gyorgy Jaics, Andrew W. M. Jordan, Arjun Shetty,\n  Penghui Yin, Man C. Tam, Xinning Wang, Zbig. R. Wasilewski, Pavle V.\n  Radovanovic and Jonathan Baugh","authorsParsed":[["Merino","Zach D.",""],["Jaics","Gyorgy",""],["Jordan","Andrew W. M.",""],["Shetty","Arjun",""],["Yin","Penghui",""],["Tam","Man C.",""],["Wang","Xinning",""],["Wasilewski","Zbig. R.",""],["Radovanovic","Pavle V.",""],["Baugh","Jonathan",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 20:14:35 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 17:20:07 GMT"}],"updateDate":"2024-08-27","timestamp":1724098475000,"abstract":"  Fast and accurate detection of light in the near-infrared (NIR) spectral\nrange plays a crucial role in modern society, from alleviating speed and\ncapacity bottlenecks in optical communications to enhancing the control and\nsafety of autonomous vehicles through NIR imaging systems. Several\ntechnological platforms are currently under investigation to improve NIR\nphotodetection, aiming to surpass the performance of established III-V\nsemiconductor p-i-n (PIN) junction technology. These platforms include in\nsitu-grown inorganic nanocrystals and nanowire arrays, as well as hybrid\norganic-inorganic materials such as graphene-perovskite heterostructures.\nHowever, challenges remain in nanocrystal and nanowire growth, large-area\nfabrication of high-quality 2D materials, and the fabrication of devices for\npractical applications. Here, we explore the potential for tailored\nsemiconductor nanocrystals to enhance the responsivity of planar\nmetal-semiconductor-metal (MSM) photodetectors. MSM technology offers ease of\nfabrication and fast response times compared to PIN detectors. We observe\nenhancement of the optical-to-electric conversion efficiency by up to a factor\nof ~2.5 through the application of plasmonically-active semiconductor nanorods\nand nanocrystals. We present a protocol for synthesizing and rapidly testing\nthe performance of non-stoichiometric tungsten oxide (WO$_{3-x}$) nanorods and\ncesium-doped tungsten oxide (Cs$_y$WO$_{3-x}$) hexagonal nanoprisms prepared in\ncolloidal suspensions and drop-cast onto photodetector surfaces. The results\ndemonstrate the potential for a cost-effective and scalable method exploiting\ntailored nanocrystals to improve the performance of NIR optoelectronic devices.\n","subjects":["Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}