{"id":"2408.11056","title":"Detection of the large-scale tidal field with galaxy multiplet alignment\n  in the DESI Y1 spectroscopic survey","authors":"Claire Lamman, Daniel Eisenstein, Jaime E. Forero-Romero, Jessica\n  Nicole Aguilar, Steven Ahlen, Stephen Bailey, Davide Bianchi, David Brooks,\n  Todd Claybaugh, Axel de la Macorra, Peter Doel, Simone Ferraro, Andreu\n  Font-Ribera, Enrique Gazta\\~naga, Satya Gontcho A Gontcho, Gaston Gutierrez,\n  Klaus Honscheid, Cullan Howlett, Anthony Kremin, Andrew Lambert, Martin\n  Landriau, Laurent Le Guillou, Michael E. Levi, Aaron Meisner, Ramon Miquel,\n  John Moustakas, Jeffrey A. Newman, Gustavo Niz, Francisco Prada, Ignasi\n  P\\'erez-R\\`afols, Ashley J. Ross, Graziano Rossi, Eusebio Sanchez, Michael\n  Schubnell, David Sprayberry, Gregory Tarl\\'e, Mariana Vargas-Maga\\~na,\n  Benjamin Alan Weaver, Hu Zou","authorsParsed":[["Lamman","Claire",""],["Eisenstein","Daniel",""],["Forero-Romero","Jaime E.",""],["Aguilar","Jessica Nicole",""],["Ahlen","Steven",""],["Bailey","Stephen",""],["Bianchi","Davide",""],["Brooks","David",""],["Claybaugh","Todd",""],["de la Macorra","Axel",""],["Doel","Peter",""],["Ferraro","Simone",""],["Font-Ribera","Andreu",""],["Gaztañaga","Enrique",""],["Gontcho","Satya Gontcho A",""],["Gutierrez","Gaston",""],["Honscheid","Klaus",""],["Howlett","Cullan",""],["Kremin","Anthony",""],["Lambert","Andrew",""],["Landriau","Martin",""],["Guillou","Laurent Le",""],["Levi","Michael E.",""],["Meisner","Aaron",""],["Miquel","Ramon",""],["Moustakas","John",""],["Newman","Jeffrey A.",""],["Niz","Gustavo",""],["Prada","Francisco",""],["Pérez-Ràfols","Ignasi",""],["Ross","Ashley J.",""],["Rossi","Graziano",""],["Sanchez","Eusebio",""],["Schubnell","Michael",""],["Sprayberry","David",""],["Tarlé","Gregory",""],["Vargas-Magaña","Mariana",""],["Weaver","Benjamin Alan",""],["Zou","Hu",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 17:59:42 GMT"}],"updateDate":"2024-08-21","timestamp":1724176782000,"abstract":"  We explore correlations between the orientations of small galaxy groups, or\n\"multiplets\", and the large-scale gravitational tidal field. Using data from\nthe Dark Energy Spectroscopic Instrument (DESI) Y1 survey, we detect the\nintrinsic alignment (IA) of multiplets to the galaxy-traced matter field out to\nseparations of 100 Mpc/h. Unlike traditional IA measurements of individual\ngalaxies, this estimator is not limited by imaging of galaxy shapes and allows\nfor direct IA detection beyond redshift z = 1. Multiplet alignment is a form of\nhigher-order clustering, for which the scale-dependence traces the underlying\ntidal field and amplitude is a result of small-scale (< 1 Mpc/h) dynamics.\nWithin samples of bright galaxies (BGS), luminous red galaxies (LRG) and\nemission-line galaxies (ELG), we find similar scale-dependence regardless of\nintrinsic luminosity or colour. This is promising for measuring tidal alignment\nin galaxy samples that typically display no intrinsic alignment. DESI's LRG\nmock galaxy catalogues created from the AbacusSummit N-body simulations produce\na similar alignment signal, though with a 33% lower amplitude at all scales. An\nanalytic model using a non-linear power spectrum (NLA) only matches the signal\ndown to 20 Mpc/h. Our detection demonstrates that galaxy clustering in the\nnon-linear regime of structure formation preserves an interpretable memory of\nthe large-scale tidal field. Multiplet alignment complements traditional\ntwo-point measurements by retaining directional information imprinted by tidal\nforces, and contains additional line-of-sight information compared to weak\nlensing. This is a more effective estimator than the alignment of individual\ngalaxies in dense, blue, or faint galaxy samples.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}