{"id":"2408.11269","title":"Real-time Hosting Capacity Assessment for Electric Vehicles: A\n  Sequential Forecast-then-Optimize Method","authors":"Yingrui Zhuang, Lin Cheng, Ning Qi, Xinyi Wang and Yue Chen","authorsParsed":[["Zhuang","Yingrui",""],["Cheng","Lin",""],["Qi","Ning",""],["Wang","Xinyi",""],["Chen","Yue",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 01:44:42 GMT"}],"updateDate":"2024-08-22","timestamp":1724204682000,"abstract":"  Hosting capacity (HC) assessment for electric vehicles (EVs) is of great\nsignificance to ensure the safe integration of EVs and the reliable operation\nof power systems. Existing HC assessment methods mainly focus on a long-term\nperspective (e.g., system planning), and model the EV charging demands as\nscalar values. However, HC estimated from a long-term perspective may be\ninaccurate and unreliable for real-time operation, since long-term peak\nestimation differs from the real-time stochasticity of EV charging demands. In\nthis regard, this paper proposes a real-time HC assessment method for EVs\nthrough a three-step process of real-time probabilistic forecasting, real-time\nrisk analysis and probabilistic optimization. Specifically, we first conduct\nreal-time probabilistic forecasting through an adaptive spatio-temporal graph\nconvolutional network to describe the stochasticity in EV charging demands\nacross multiple charging stations. This model leverages adaptive spatial\nfeature extraction, attention-based temporal feature extraction, and\nsecond-order graph representation to capture the spatio-temporal features of EV\ncharging demands. Subsequently, based on the probabilistic forecasting, we\npropose a real-time risk analysis method, which is achieved by calculating the\nprobabilistic power flow based on an improved Gaussian mixture model.\nFurthermore, we provide a real-time formulation of the HC of EVs and propose an\noptimization model to assess it. Numerical experiments on a real-world dataset\ndemonstrate that the proposed forecasting model outperforms state-of-the-art\nforecasting methods by achieving the lowest RMSE value of 0.0442, the proposed\nreal-time risk analysis method maintains over 96.6% accuracy with 99.99%\nreduction in computational complexity, and the real-time HC is improved by\n66.3% compared to long-term assessment.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dxnu7XB2EfPYWTn4w0tUiywYCLnH47toZQCN_rteiiY","pdfSize":"12805799"}
