{"id":"2408.05537","title":"S-SIRUS: an explainability algorithm for spatial regression Random\n  Forest","authors":"Luca Patelli, Natalia Golini, Rosaria Ignaccolo, Michela Cameletti","authorsParsed":[["Patelli","Luca",""],["Golini","Natalia",""],["Ignaccolo","Rosaria",""],["Cameletti","Michela",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 12:41:43 GMT"}],"updateDate":"2024-08-13","timestamp":1723293703000,"abstract":"  Random Forest (RF) is a widely used machine learning algorithm known for its\nflexibility, user-friendliness, and high predictive performance across various\ndomains. However, it is non-interpretable. This can limit its usefulness in\napplied sciences, where understanding the relationships between predictors and\nresponse variable is crucial from a decision-making perspective. In the\nliterature, several methods have been proposed to explain RF, but none of them\naddresses the challenge of explaining RF in the context of spatially dependent\ndata. Therefore, this work aims to explain regression RF in the case of\nspatially dependent data by extracting a compact and simple list of rules. In\nthis respect, we propose S-SIRUS, a spatial extension of SIRUS, the latter\nbeing a well-established regression rule algorithm able to extract a stable and\nshort list of rules from the classical regression RF algorithm. A simulation\nstudy was conducted to evaluate the explainability capability of the proposed\nS-SIRUS, in comparison to SIRUS, by considering different levels of spatial\ndependence among the data. The results suggest that S-SIRUS exhibits a higher\ntest predictive accuracy than SIRUS when spatial correlation is present.\nMoreover, for higher levels of spatial correlation, S-SIRUS produces a shorter\nlist of rules, easing the explanation of the mechanism behind the predictions.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Lk-htdVowys0DFlkcisZbtMtHUsiX2Bgpv0mwCe524o","pdfSize":"2144808"}
