{"id":"2408.10557","title":"Speech Representation Learning Revisited: The Necessity of Separate\n  Learnable Parameters and Robust Data Augmentation","authors":"Hemant Yadav, Sunayana Sitaram, Rajiv Ratn Shah","authorsParsed":[["Yadav","Hemant",""],["Sitaram","Sunayana",""],["Shah","Rajiv Ratn",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 05:45:04 GMT"}],"updateDate":"2024-08-21","timestamp":1724132704000,"abstract":"  Speech modeling methods learn one embedding for a fixed segment of speech,\ntypically in between 10-25 ms. The information present in speech can be divided\ninto two categories: \"what is being said\" (content) and \"how it is expressed\"\n(other) and these two are orthogonal in nature causing the optimization\nalgorithm to find a sub-optimal solution if forced to optimize together. This\nleads to sub-optimal performance in one or all downstream tasks as shown by\nprevious studies. Current self-supervised learning (SSL) methods such as HuBERT\nare very good at modeling the content information present in speech. Data\naugmentation improves the performance on tasks which require effective modeling\nof other information but this leads to a divided capacity of the model. In this\nwork, we conduct a preliminary study to understand the importance of modeling\nother information using separate learnable parameters. We propose a modified\nversion of HuBERT, termed Other HuBERT (O-HuBERT), to test our hypothesis. Our\nfindings are twofold: first, the O-HuBERT method is able to utilize all layers\nto build complex features to encode other information; second, a robust data\naugmentation strategy is essential for learning the information required by\ntasks that depend on other information and to achieve state-of-the-art (SOTA)\nperformance on the SUPERB benchmark with a similarly sized model (100 million\nparameters) and pre-training data (960 hours).\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"62hrihHEr_lgFifI2qBSwq5-s8ZWVa_qIxXUu7krBj8","pdfSize":"1430219"}
