{"id":"2408.11093","title":"Analysis of the JWST spectra of the kilonova accompanying GRB 230307A","authors":"J. H. Gillanders and S. J. Smartt","authorsParsed":[["Gillanders","J. H.",""],["Smartt","S. J.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-22","timestamp":1724176801000,"abstract":"  Kilonovae are key to advancing our understanding of r-process\nnucleosynthesis. To date, only two kilonovae have been spectroscopically\nobserved, AT 2017gfo and AT 2023vfi. Here, we present an analysis of the James\nWebb Space Telescope spectra obtained +29 and +61 days post-merger for AT\n2023vfi. After re-reducing and photometrically flux-calibrating the data, we\nempirically model the observed X-ray to mid-infrared continua with a power law\nand a blackbody, to replicate the non-thermal afterglow and apparent thermal\ncontinuum $\\gtrsim 2 \\, \\mu$m. We fit Gaussians to the apparent emission\nfeatures, obtaining line centroids of $20218_{-38}^{+37}$, $21874 \\pm 89$ and\n$44168_{-152}^{+153}$\\,\\AA, and velocity widths spanning $0.057 - 0.110$\\,c.\nThese line centroid constraints facilitated a detailed forbidden line\nidentification search, from which we shortlist a number of r-process species\nspanning all three r-process peaks. We rule out Ba II and Ra II as candidates\nand propose Te I-III, Er I-III and W III as the most promising ions for further\ninvestigation, as they plausibly produce multiple emission features from one (W\nIII) or multiple (Te I-III, Er I-III) ion stages. We compare to the spectra of\nAT 2017gfo, which also exhibit prominent emission at $\\sim 2.1 \\, \\mu$m, and\nconclude that [Te III] $\\lambda$21050 remains the most plausible cause of the\nobserved $\\sim 2.1 \\, \\mu$m emission in both kilonovae. However, the observed\nline centroids are not consistent between both objects, and they are\nsignificantly offset from [Te III] $\\lambda$21050. The next strongest [Te III]\ntransition at 29290\\,\\AA\\ is not observed, and we quantify its detectability.\nFurther study is required, with particular emphasis on expanding the available\natomic data to enable quantitative non-LTE spectral modelling.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}