{"id":"2408.12664","title":"Multilevel Interpretability Of Artificial Neural Networks: Leveraging\n  Framework And Methods From Neuroscience","authors":"Zhonghao He, Jascha Achterberg, Katie Collins, Kevin Nejad, Danyal\n  Akarca, Yinzhu Yang, Wes Gurnee, Ilia Sucholutsky, Yuhan Tang, Rebeca Ianov,\n  George Ogden, Chole Li, Kai Sandbrink, Stephen Casper, Anna Ivanova, Grace W.\n  Lindsay","authorsParsed":[["He","Zhonghao",""],["Achterberg","Jascha",""],["Collins","Katie",""],["Nejad","Kevin",""],["Akarca","Danyal",""],["Yang","Yinzhu",""],["Gurnee","Wes",""],["Sucholutsky","Ilia",""],["Tang","Yuhan",""],["Ianov","Rebeca",""],["Ogden","George",""],["Li","Chole",""],["Sandbrink","Kai",""],["Casper","Stephen",""],["Ivanova","Anna",""],["Lindsay","Grace W.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 18:17:20 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 02:35:50 GMT"}],"updateDate":"2024-08-27","timestamp":1724350640000,"abstract":"  As deep learning systems are scaled up to many billions of parameters,\nrelating their internal structure to external behaviors becomes very\nchallenging. Although daunting, this problem is not new: Neuroscientists and\ncognitive scientists have accumulated decades of experience analyzing a\nparticularly complex system - the brain. In this work, we argue that\ninterpreting both biological and artificial neural systems requires analyzing\nthose systems at multiple levels of analysis, with different analytic tools for\neach level. We first lay out a joint grand challenge among scientists who study\nthe brain and who study artificial neural networks: understanding how\ndistributed neural mechanisms give rise to complex cognition and behavior. We\nthen present a series of analytical tools that can be used to analyze\nbiological and artificial neural systems, organizing those tools according to\nMarr's three levels of analysis: computation/behavior,\nalgorithm/representation, and implementation. Overall, the multilevel\ninterpretability framework provides a principled way to tackle neural system\ncomplexity; links structure, computation, and behavior; clarifies assumptions\nand research priorities at each level; and paves the way toward a unified\neffort for understanding intelligent systems, may they be biological or\nartificial.\n","subjects":["Computing Research Repository/Artificial Intelligence","Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}