{"id":"2408.10620","title":"Fast Grid Emissions Sensitivities using Parallel Decentralized Implicit\n  Differentiation","authors":"Anthony Degleris, Lucas Fuentes Valenzuela, Ram Rajagopal, Marco\n  Pavone, Abbas El Gamal","authorsParsed":[["Degleris","Anthony",""],["Valenzuela","Lucas Fuentes",""],["Rajagopal","Ram",""],["Pavone","Marco",""],["Gamal","Abbas El",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 07:56:28 GMT"}],"updateDate":"2024-08-21","timestamp":1724140588000,"abstract":"  Marginal emissions rates -- the sensitivity of carbon emissions to\nelectricity demand -- are important for evaluating the impact of emissions\nmitigation measures. Like locational marginal prices, locational marginal\nemissions rates (LMEs) can vary geographically, even between nearby locations,\nand may be coupled across time periods because of, for example, storage and\nramping constraints. This temporal coupling makes computing LMEs\ncomputationally expensive for large electricity networks with high storage and\nrenewable penetrations. Recent work demonstrates that decentralized algorithms\ncan mitigate this problem by decoupling timesteps during differentiation.\nUnfortunately, we show these potential speedups are negated by the sparse\nstructure inherent in power systems problems. We address these limitations by\nintroducing a parallel, reverse-mode decentralized differentiation scheme that\nnever explicitly instantiates the solution map Jacobian. We show both\ntheoretically and empirically that parallelization is necessary to achieve\nnon-trivial speedups when computing grid emissions sensitivities. Numerical\nresults on a 500 node system indicate that our method can achieve greater than\n10x speedups over centralized and serial decentralized approaches.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"f53dFSgfBmsIcPlrtBAqmRqx6IqftvC9AXbsv5GTdBQ","pdfSize":"382184"}
