{"id":"2408.01110","title":"Unraveling the hybrid origins of the X-ray non-thermal emission from IGR\n  J17091-3624","authors":"Zikun Lin, Yanan Wang, Santiago del Palacio, Mariano M\\'endez,\n  Shuang-Nan Zhang, Thomas D. Russell, Long Ji, Jin Zhang, Liang Zhang, Diego\n  Altamirano, and Jifeng Liu","authorsParsed":[["Lin","Zikun",""],["Wang","Yanan",""],["del Palacio","Santiago",""],["Méndez","Mariano",""],["Zhang","Shuang-Nan",""],["Russell","Thomas D.",""],["Ji","Long",""],["Zhang","Jin",""],["Zhang","Liang",""],["Altamirano","Diego",""],["Liu","Jifeng",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 08:39:40 GMT"}],"updateDate":"2024-08-05","timestamp":1722587980000,"abstract":"  We present a comprehensive study based on multi-wavelength observations from\nthe NuSTAR, NICER, Swift, Fermi, NEOWISE, and ATCA telescopes during the 2022\noutburst of the black hole X-ray binary IGR J17091-3624. Our investigation\nconcentrates on the heartbeat-like variability in the X-ray emission, with the\naim of using it as a tool to unravel the origin of the non-thermal emission\nduring the heartbeat state. Through X-ray timing and spectral analysis, we\nobserve that the heartbeat-like variability correlates with changes in the disk\ntemperature, supporting the disk radiation pressure instability scenario.\nMoreover, in addition to a Comptonization component, our time-averaged and\nphase-resolved spectroscopy reveal the presence of a power-law component that\nvaries independently from the disk component. Combined with the radio to X-ray\nspectral energy distribution fitting, our results suggest that the power-law\ncomponent could originate from synchrotron self-Compton radiation in the jet,\nwhich requires a strong magnetic field of about $B = (0.3$-$3.5)\\times10^6$ G.\nAdditionally, assuming that IGR J17091-3624 and GRS 1915+105 share the same\nradio-X-ray correlation coefficient during both the hard and the heartbeat\nstates, we obtain a distance of $13.7\\pm2.3$ kpc for IGR J17091-3624.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ilc25kB1SuR_wDcIDzR4Qg_L6XvYXXZapNMfU9NSKPM","pdfSize":"4629929","txDigest":"3LEgsYtaZhBUz62q6dkCAikrW2jnDkbLKzdvRQso9yQv","endEpoch":"1","status":"CERTIFIED"}
