{"id":"2408.03605","title":"A public grid of radiative transfer simulations for Lyman-alpha and\n  metal lines in idealised galactic outflows","authors":"Thibault Garel, L\\'eo Michel-Dansac, Anne Verhamme, Valentin\n  Mauerhofer, Harley Katz, J\\'er\\'emy Blaizot, Floriane Leclercq and Gr\\'egory\n  Salvignol","authorsParsed":[["Garel","Thibault",""],["Michel-Dansac","Léo",""],["Verhamme","Anne",""],["Mauerhofer","Valentin",""],["Katz","Harley",""],["Blaizot","Jérémy",""],["Leclercq","Floriane",""],["Salvignol","Grégory",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 07:48:59 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 07:30:51 GMT"}],"updateDate":"2024-08-09","timestamp":1723016939000,"abstract":"  The vast majority of star-forming galaxies are surrounded by large reservoirs\nof gas ejected from the interstellar medium. Ultraviolet absorption and\nemission lines represent powerful diagnostics to constrain the cool phase of\nthese outflows, through resonant transitions of hydrogen and metal ions. The\ninterpretation of these observations is often remarkably difficult as it\nrequires detailed modelling of the propagation of the continuum and emission\nlines in the gas. To this aim, we present a large public grid of about 20000\nsimulated spectra which includes HI Lyman-alpha (Lya) and five metal\ntransitions associated with MgII, CII, SiII, and FeII that is accessible online\nat https://rascas.univ-lyon1.fr/app/idealised_models_grid/. The spectra have\nbeen computed with the RASCAS radiative transfer code for 5760 idealised\nspherical configurations surrounding a central point source emission, and\ncharacterised by their column density, Doppler parameter, dust opacity, wind\nvelocity, as well as various density/velocity gradients. Designed to interpret\nLya and metal line profiles, our grid exhibits a wide diversity of resonant\nabsorption and emission features, as well as fluorescent lines. We illustrate\nhow it can help better constrain wind properties by performing a joint\nmodelling of observed Lya, CII, and SiII spectra. Using CLOUDY simulations and\nvirial scaling relations, we show that Lya is expected to be a faithful tracer\nof the gas at T=10^4-10^5 K, even if the medium is highly-ionised. While CII is\nfound to probe the same range of temperatures as Lya, other metal lines merely\ntrace cooler phases (T=10^4 K). As their gas opacity strongly depends on gas\ntemperature, incident radiation field, metallicity and dust depletion, we\ncaution that optically thin metal lines do not necessarily originate from low\nHI column densities and may not accurately probe Lyman continuum leakage.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}