{"id":"2408.07367","title":"Risk Occupancy: A New and Efficient Paradigm through Vehicle-Road-Cloud\n  Collaboration","authors":"Jiaxing Chen, Wei Zhong, Bolin Gao, Yifei Liu, Hengduo Zou, Jiaxi Liu,\n  Yanbo Lu, Jin Huang, Zhihua Zhong","authorsParsed":[["Chen","Jiaxing",""],["Zhong","Wei",""],["Gao","Bolin",""],["Liu","Yifei",""],["Zou","Hengduo",""],["Liu","Jiaxi",""],["Lu","Yanbo",""],["Huang","Jin",""],["Zhong","Zhihua",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 08:26:50 GMT"},{"version":"v2","created":"Sat, 17 Aug 2024 04:18:59 GMT"}],"updateDate":"2024-08-20","timestamp":1723624010000,"abstract":"  This study introduces the 4D Risk Occupancy within a vehicle-road-cloud\narchitecture, integrating the road surface spatial, risk, and temporal\ndimensions, and endowing the algorithm with beyond-line-of-sight, all-angles,\nand efficient abilities. The algorithm simplifies risk modeling by focusing on\ndirectly observable information and key factors, drawing on the concept of\nOccupancy Grid Maps (OGM), and incorporating temporal prediction to effectively\nmap current and future risk occupancy.\n  Compared to conventional driving risk fields and grid occupancy maps, this\nalgorithm can map global risks more efficiently, simply, and reliably. It can\nintegrate future risk information, adapting to dynamic traffic environments.\nThe 4D Risk Occupancy also unifies the expression of BEV detection and lane\nline detection results, enhancing the intuitiveness and unity of environmental\nperception. Using DAIR-V2X data, this paper validates the 4D Risk Occupancy\nalgorithm and develops a local path planning model based on it. Qualitative\nexperiments under various road conditions demonstrate the practicality and\nrobustness of this local path planning model. Quantitative analysis shows that\nthe path planning based on risk occupation significantly improves trajectory\nplanning performance, increasing safety redundancy by 12.5% and reducing\naverage deceleration by 5.41% at an initial braking speed of 8 m/s, thereby\nimproving safety and comfort. This work provides a new global perception method\nand local path planning method through Vehicle-Road-Cloud architecture,\noffering a new perceptual paradigm for achieving safer and more efficient\nautonomous driving.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}