{"id":"2408.01501","title":"Galaxy populations in the Hydra I cluster from the VEGAS survey III. The\n  realm of low surface brightness features and intra-cluster light","authors":"Marilena Spavone, Enrichetta Iodice, Felipe S. Lohmann, Magda\n  Arnaboldi, Michael Hilker, Antonio La Marca, Rosa Calvi, Michele Cantiello,\n  Enrico M. Corsini, Giuseppe D'Ago, Duncan A. Forbes, Marco Mirabile, and\n  Marina Rejkuba","authorsParsed":[["Spavone","Marilena",""],["Iodice","Enrichetta",""],["Lohmann","Felipe S.",""],["Arnaboldi","Magda",""],["Hilker","Michael",""],["La Marca","Antonio",""],["Calvi","Rosa",""],["Cantiello","Michele",""],["Corsini","Enrico M.",""],["D'Ago","Giuseppe",""],["Forbes","Duncan A.",""],["Mirabile","Marco",""],["Rejkuba","Marina",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 18:02:19 GMT"}],"updateDate":"2024-08-06","timestamp":1722621739000,"abstract":"  In this paper, we analyse the light distribution in the Hydra I cluster of\ngalaxies to explore their low surface brightness features, measure the\nintra-cluster light, and address the assembly history of the cluster. For this\npurpose, we used deep wide-field g- and r-band images obtained with the VST as\npart of the VEGAS project. The VST mosaic covers ~0.4 times the virial radius\naround the core of the cluster, which enabled us to map the light distribution\ndown to faint surface brightness levels of mu_g ~ 28 mag/arcsec^2. In this\nregion of the cluster, 44 cluster members are brighter than m_B<16 mag, and the\nregion includes more than 300 dwarf galaxies. Similar to the projected\ndistribution of all cluster members (bright galaxies and dwarfs), we find that\nthe bulk of the galaxy light is concentrated in the cluster core, which also\nemits in the X-rays, and there are two overdensities: in the north (N) and\nsouth-east (SE) with respect to the cluster core. We present the analysis of\nthe light distribution of all the bright cluster members. After removing\nforeground stars and other objects, we measured the diffuse intra-cluster light\nand compared its distribution with that of the globular clusters and dwarf\ngalaxies in the cluster. We find that most of the diffuse light low surface\nbrightness features, and signs of possible gravitational interaction between\ngalaxies reside in the core and in the group in the N, while ram-pressure\nstripping is frequently found to affect galaxies within the SE group. All these\nfeatures confirm that the mass assembly in this cluster is still ongoing. By\ncombining the projected phase-space with these observed properties, we trace\nthe different stages of the assembly history. We also address the main\nformation channels for the intra-cluster light detected in the cluster, which\ncontributes ~ 12% to the total luminosity of the cluster.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}