{"id":"2408.09463","title":"Convergence of a moving window method for the Schr\\\"odinger equation\n  with potential on $\\mathbb{R}^d$","authors":"Arieh Iserles, Buyang Li, Fangyan Yao","authorsParsed":[["Iserles","Arieh",""],["Li","Buyang",""],["Yao","Fangyan",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 13:04:14 GMT"}],"updateDate":"2024-08-20","timestamp":1723986254000,"abstract":"  We propose a novel framework, called moving window method, for solving the\nlinear Schr\\\"odinger equation with an external potential in $\\mathbb{R}^d$.\nThis method employs a smooth cut-off function to truncate the equation from\nCauchy boundary conditions in the whole space to a bounded window of scaled\ntorus, which is itself moving with the solution. This allows for the\napplication of established schemes on this scaled torus to design algorithms\nfor the whole-space problem. Rigorous analysis of the error in approximating\nthe whole-space solution by numerical solutions on a bounded window is\nestablished. Additionally, analytical tools for periodic cases are used to\nrigorously estimate the error of these whole-space algorithms. By integrating\nthe proposed framework with a classical first-order exponential integrator on\nthe scaled torus, we demonstrate that the proposed scheme achieves first-order\nconvergence in time and $\\gamma/2$-order convergence in space for initial data\nin $H^\\gamma(\\mathbb{R}^d) \\cap L^2(\\mathbb{R}^d;|x|^{2\\gamma} dx)$ with\n$\\gamma \\geq 2$. In the case where $\\gamma = 1$, the numerical scheme is shown\nto have half-order convergence under an additional CFL condition. In practice,\nwe can dynamically adjust the window when waves reach its boundary, allowing\nfor continued computation beyond the initial window. Extensive numerical\nexamples are presented to support the theoretical analysis and demonstrate the\neffectiveness of the proposed method.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}