{"id":"2408.13451","title":"Structures and infrared spectroscopy of Au$_{10}$ cluster at different\n  temperatures","authors":"Francisco Eduardo Rojas-Gonz\\'alez, Jorge Padilla-Alvarez, C\\'esar\n  Castillo-Quevedo, Rajagopal Dashinamoorthy Eithiraj, Jose Luis Cabellos","authorsParsed":[["Rojas-González","Francisco Eduardo",""],["Padilla-Alvarez","Jorge",""],["Castillo-Quevedo","César",""],["Eithiraj","Rajagopal Dashinamoorthy",""],["Cabellos","Jose Luis",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 03:32:37 GMT"}],"updateDate":"2024-08-27","timestamp":1724470357000,"abstract":"  Understanding the properties of Au$_{10}$ clusters entails identifying the\nlowest energy structure at cold and warm temperatures. While functional\nmaterials operate at finite temperatures, energy computations using density\nfunctional theory are typically performed at zero temperature, resulting in\nunexplored properties. Our study undertook an exploration of the potential and\nfree energy surface of the neutral Au$_{10}$ nanocluster at finite temperatures\nby employing a genetic algorithm combined with density functional theory and\nnanothermodynamics. We computed the thermal population and infrared Boltzmann\nspectrum at a finite temperature, aligning the results with validated\nexperimental data. The Zero-Order Regular Approximation (ZORA) gave\nconsideration to relativistic effects, and dispersion was incorporated using\nGrimme's dispersion D3BJ with Becke-Johnson damping. Moreover,\nnanothermodynamics was utilized to account for temperature contributions. The\ncomputed thermal population strongly supports the dominance of the 2D elongated\nhexagon configuration within a temperature range of 50 to 800 K. Importantly,\nat a temperature of 100 K, the calculated IR Boltzmann spectrum aligns with the\nexperimental IR spectrum. Lastly, the chemical bonding analysis on the lowest\nenergy structure indicates a closed-shell Au-Au interaction with a weak or\npartially covalent character.\n","subjects":["Condensed Matter/Materials Science","Physics/Atomic and Molecular Clusters"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}