{"id":"2408.12423","title":"Multi-Knowledge Fusion Network for Time Series Representation Learning","authors":"Sagar Srinivas Sakhinana, Shivam Gupta, Krishna Sai Sudhir Aripirala,\n  Venkataramana Runkana","authorsParsed":[["Sakhinana","Sagar Srinivas",""],["Gupta","Shivam",""],["Aripirala","Krishna Sai Sudhir",""],["Runkana","Venkataramana",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 14:18:16 GMT"}],"updateDate":"2024-08-23","timestamp":1724336296000,"abstract":"  Forecasting the behaviour of complex dynamical systems such as interconnected\nsensor networks characterized by high-dimensional multivariate time series(MTS)\nis of paramount importance for making informed decisions and planning for the\nfuture in a broad spectrum of applications. Graph forecasting networks(GFNs)\nare well-suited for forecasting MTS data that exhibit spatio-temporal\ndependencies. However, most prior works of GFN-based methods on MTS forecasting\nrely on domain-expertise to model the nonlinear dynamics of the system, but\nneglect the potential to leverage the inherent relational-structural\ndependencies among time series variables underlying MTS data. On the other\nhand, contemporary works attempt to infer the relational structure of the\ncomplex dependencies between the variables and simultaneously learn the\nnonlinear dynamics of the interconnected system but neglect the possibility of\nincorporating domain-specific prior knowledge to improve forecast accuracy. To\nthis end, we propose a hybrid architecture that combines explicit prior\nknowledge with implicit knowledge of the relational structure within the MTS\ndata. It jointly learns intra-series temporal dependencies and inter-series\nspatial dependencies by encoding time-conditioned structural spatio-temporal\ninductive biases to provide more accurate and reliable forecasts. It also\nmodels the time-varying uncertainty of the multi-horizon forecasts to support\ndecision-making by providing estimates of prediction uncertainty. The proposed\narchitecture has shown promising results on multiple benchmark datasets and\noutperforms state-of-the-art forecasting methods by a significant margin. We\nreport and discuss the ablation studies to validate our forecasting\narchitecture.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"rv9oXQyCboSVJj73rVEPzyRTEy0LErZeV3JdtvIVNFU","pdfSize":"1698853"}
