{"id":"2408.16851","title":"New magnetic topological materials from high-throughput search","authors":"I\\~nigo Robredo and Yuanfeng Xu and Yi Jiang and Claudia Felser and B.\n  Andrei Bernevig and Luis Elcoro and Nicolas Regnault and Maia G. Vergniory","authorsParsed":[["Robredo","Iñigo",""],["Xu","Yuanfeng",""],["Jiang","Yi",""],["Felser","Claudia",""],["Bernevig","B. Andrei",""],["Elcoro","Luis",""],["Regnault","Nicolas",""],["Vergniory","Maia G.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:34:20 GMT"}],"updateDate":"2024-09-02","timestamp":1724956460000,"abstract":"  We conducted a high-throughput search for topological magnetic materials on\n522 new, experimentally reported commensurate magnetic structures from\nMAGNDATA, doubling the number of available materials on the Topological\nMagnetic Materials database. This brings up to date the previous studies which\nhad become incomplete due to the discovery of new materials. For each material,\nwe performed first-principle electronic calculations and diagnosed the topology\nas a function of the Hubbard U parameter. Our high-throughput calculation led\nus to the prediction of 250 experimentally relevant topologically non-trivial\nmaterials, which represent 47.89% of the newly analyzed materials. We present\nfive remarkable examples of these materials, each showcasing a different\ntopological phase: Mn${}_2$AlB${}_2$ (BCSID 1.508), which exhibits a nodal line\nsemimetal to topological insulator transition as a function of SOC, CaMnSi\n(BCSID 0.599), a narrow gap axion insulator, UAsS (BCSID 0.594) a 5f-orbital\nWeyl semimetal, CsMnF${}_4$ (BCSID 0.327), a material presenting a new type of\nquasi-symmetry protected closed nodal surface and FeCr${}_2$S${}_4$ (BCSID\n0.613), a symmetry-enforced semimetal with double Weyls and spin-polarised\nsurface states.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fjyHFfqqBSJbuZ4MeBu1-AgnBMP_1VsStDPBbVihCDI","pdfSize":"46636583"}
