{"id":"2408.10689","title":"Genesis: Towards the Automation of Systems Biology Research","authors":"Ievgeniia A. Tiukova, Daniel Brunns{\\aa}ker, Erik Y. Bjurstr\\\"om,\n  Alexander H. Gower, Filip Kronstr\\\"om, Gabriel K. Reder, Ronald S. Reiserer,\n  Konstantin Korovin, Larisa B. Soldatova, John P. Wikswo, Ross D. King","authorsParsed":[["Tiukova","Ievgeniia A.",""],["Brunnsåker","Daniel",""],["Bjurström","Erik Y.",""],["Gower","Alexander H.",""],["Kronström","Filip",""],["Reder","Gabriel K.",""],["Reiserer","Ronald S.",""],["Korovin","Konstantin",""],["Soldatova","Larisa B.",""],["Wikswo","John P.",""],["King","Ross D.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 09:40:43 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 09:56:27 GMT"}],"updateDate":"2024-09-05","timestamp":1724146843000,"abstract":"  The cutting edge of applying AI to science is the closed-loop automation of\nscientific research: robot scientists. We have previously developed two robot\nscientists: `Adam' (for yeast functional biology), and `Eve' (for early-stage\ndrug design)). We are now developing a next generation robot scientist Genesis.\nWith Genesis we aim to demonstrate that an area of science can be investigated\nusing robot scientists unambiguously faster, and at lower cost, than with human\nscientists. Here we report progress on the Genesis project. Genesis is designed\nto automatically improve system biology models with thousands of interacting\ncausal components. When complete Genesis will be able to initiate and execute\nin parallel one thousand hypothesis-led closed-loop cycles of experiment\nper-day. Here we describe the core Genesis hardware: the one thousand\ncomputer-controlled $\\mu$-bioreactors. For the integrated Mass Spectrometry\nplatform we have developed AutonoMS, a system to automatically run, process,\nand analyse high-throughput experiments. We have also developed Genesis-DB, a\ndatabase system designed to enable software agents access to large quantities\nof structured domain information. We have developed RIMBO (Revisions for\nImprovements of Models in Biology Ontology) to describe the planned hundreds of\nthousands of changes to the models. We have demonstrated the utility of this\ninfrastructure by developed two relational learning bioinformatic projects.\nFinally, we describe LGEM+ a relational learning system for the automated\nabductive improvement of genome-scale metabolic models.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kU3gkHRU8dteUQS-ewrsFt0PyG3YGepnZ26APAqWSNs","pdfSize":"2538354"}
