{"id":"2408.00696","title":"Attosecond Probing of Coherent Vibrational Dynamics in CBr$_4$","authors":"Jen-Hao Ou, Diptarka Hait, Patrick Rupprecht, John E. Beetar, Todd J.\n  Mart\\'inez, and Stephen R. Leone","authorsParsed":[["Ou","Jen-Hao",""],["Hait","Diptarka",""],["Rupprecht","Patrick",""],["Beetar","John E.",""],["Martínez","Todd J.",""],["Leone","Stephen R.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 16:39:27 GMT"}],"updateDate":"2024-08-02","timestamp":1722530367000,"abstract":"  A coherent vibrational wavepacket is launched and manipulated in the\nsymmetric stretch (a$_1$) mode of CBr$_4$, by impulsive stimulated Raman\nscattering from non-resonant 400 nm laser pump pulses with various peak\nintensities on the order of tens of 10$^{12}$ W/cm$^2$. Extreme ultraviolet\n(XUV) attosecond transient absorption spectroscopy (ATAS) records the\nwavepacket dynamics as temporal oscillations in XUV absorption energy at the\nbromine M$_{4,5}$ 3d$_{3/2,5/2}$ edges around 70 eV. The results are augmented\nby nuclear time-dependent Schr\\\"odinger equation simulations. Slopes of the\n(Br-3d$_{3/2,5/2}$)$^{-1}$10a$_1^*$ core-excited state potential energy surface\n(PES) along the a$_1$ mode are calculated to be -9.4 eV/{\\AA} from restricted\nopen-shell Kohn-Sham calculations. Using analytical relations derived for the\nsmall-displacement limit with the calculated slopes of the core-excited state\nPES, a deeper insight into the vibrational dynamics is obtained by retrieving\nthe experimental excursion amplitude of the vibrational wavepacket and the\namount of population transferred to the vibrational first-excited state, as a\nfunction of pump-pulse peak intensity. Experimentally, the results show that\nXUV ATAS is capable of easily resolving oscillations in the XUV absorption\nenergy on the order of few to tens of meV and tens of femtosecond time\nprecision, limited only by the averaging times in the experimental scans. This\ncorresponds to oscillations of C-Br bond length on the order of 10$^{-4}$ to\n10$^{-3}$ {\\AA}. The results and the analytic relationships offer a clear\nphysical picture, on multiple levels of understanding, for how the pump-pulse\nintensity controls the vibrational dynamics launched by non-resonant ISRS in\nthe small-displacement limit.\n","subjects":["Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}