{"id":"2408.08352","title":"The formation of black holes from rapidly accreting supermassive stars\n  is not trivial: Simulations of thermonuclear pulsations and explosions","authors":"Chris Nagele, Hideyuki Umeda","authorsParsed":[["Nagele","Chris",""],["Umeda","Hideyuki",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 18:00:03 GMT"}],"updateDate":"2024-08-19","timestamp":1723744803000,"abstract":"  In recent years, the formation and evolution of rapidly accreting\nsupermassive stars has received significant attention in the hope of better\nunderstanding the origin of high redshift quasars. It is often taken for\ngranted that once formed, these supermassive stars will encounter the general\nrelativistic radial instability and collapse to form massive black holes. Here,\nwe present the first ever general relativistic hydrodynamical simulations of\nthe collapse of rapidly accreting supermassive stars. We find that black hole\nformation is in many cases prevented by nuclear burning due to the long\ntimescales of the collapse of these stars ($10^6$ s). Consequently, this is a\nnovel astrophysical site for hot CNO burning and hydrogen burning via proton\ncaptures. For Pop III accreting supermassive stars, we find that only stars\nwith very high (100 $\\rm{M_\\odot}/$yr) or low (0.1 $\\rm{M_\\odot}/$yr) accretion\nrates can form black holes, with models in between undergoing energetic\nthermonuclear pulsations. The final fate of these pulsating models may be to\nundergo subsequent pulsations or explosions or to collapse to black holes. For\nmetal rich accreting supermassive stars ($Z\\geq 0.1 \\rm{Z_\\odot}$), we do not\nfind any black hole formation, with some models undergoing extremely energetic\nexplosions ($10^{55}$ ergs). Our results invite further study on the formation\nof massive black holes from rapidly accreting supermassive stars which have\nreached the general relativistic radial instability.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}