{"id":"2408.13225","title":"ResSR: A Residual Approach to Super-Resolving Multispectral Images","authors":"Haley Duba-Sullivan, Emma J. Reid, Sophie Voisin, Charles A. Bouman,\n  and Gregery T. Buzzard","authorsParsed":[["Duba-Sullivan","Haley",""],["Reid","Emma J.",""],["Voisin","Sophie",""],["Bouman","Charles A.",""],["Buzzard","Gregery T.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 17:00:50 GMT"}],"updateDate":"2024-08-26","timestamp":1724432450000,"abstract":"  Multispectral imaging sensors typically have wavelength-dependent resolution,\nwhich reduces the ability to distinguish small features in some spectral bands.\nExisting super-resolution methods upsample a multispectral image (MSI) to\nachieve a common resolution across all bands but are typically sensor-specific,\ncomputationally expensive, and may assume invariant image statistics across\nmultiple length scales.\n  In this paper, we introduce ResSR, an efficient and modular residual-based\nmethod for super-resolving the lower-resolution bands of a multispectral image.\nResSR uses singular value decomposition (SVD) to identify correlations across\nspectral bands and then applies a residual correction process that corrects\nonly the high-spatial frequency components of the upsampled bands. The SVD\nformulation improves the conditioning and simplifies the super-resolution\nproblem, and the residual method retains accurate low-spatial frequencies from\nthe measured data while incorporating high-spatial frequency detail from the\nSVD solution. While ResSR is formulated as the solution to an optimization\nproblem, we derive an approximate closed-form solution that is fast and\naccurate. We formulate ResSR for any number of distinct resolutions, enabling\neasy application to any MSI.\n  In a series of experiments on simulated and measured Sentinel-2 MSIs, ResSR\nis shown to produce image quality comparable to or better than alternative\nalgorithms. However, it is computationally faster and can run on larger images,\nmaking it useful for processing large data sets.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}