{"id":"2408.15024","title":"Glacierware: Hotspot-aware Microfluidic Cooling for High TDP Chips using\n  Topology Optimization","authors":"Athanasios Boutsikakis, Emile Soutter, Miguel A. Salazar de Troya,\n  Nicola Esposito, Dasha Mukasheva, Hanane Bouras, Remco van Erp","authorsParsed":[["Boutsikakis","Athanasios",""],["Soutter","Emile",""],["de Troya","Miguel A. Salazar",""],["Esposito","Nicola",""],["Mukasheva","Dasha",""],["Bouras","Hanane",""],["van Erp","Remco",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 09:16:45 GMT"}],"updateDate":"2024-08-28","timestamp":1724577405000,"abstract":"  The continuous increase in computational power of GPUs, essential for\nadvancements in areas like artificial intelligence and data processing, is\ndriving the adoption of liquid cooling in data centers. Skived copper cold\nplates featuring parallel straight channels are a mature technology, but they\nlack design freedom due to manufacturing limitations. As chips become\nincreasingly complex in their design with the transition towards heterogeneous\nintegration, these parallel straight channels are not able to address critical\nareas of concentrated high heat flux (hotspots) on a chip. A single hotspot\nexceeding the upper temperature limit can cause the full chip to throttle and\nhence limit performance. In addition, this would require a reduction in coolant\ninlet temperature in the data center, causing an increase in electricity and\nwater consumption. Ideally, areas of the cold plate in contact with hotspots of\nthe chip need smaller channels to increase convective heat transfer, whereas\nareas with low heat flux may benefit from larger channels to compensate for the\nincreased pressure drop. However, manual optimization of such a cooling design\nis challenging due to the nonlinearity of the problem. In this paper, we\nexplore the usage of topology optimization as a method to tailor microfluidic\ncooling design to the power distribution of a chip to address the hotspot\ntemperatures in high-power chips, using a platform called Glacierware. We\ncompare the hotspot-aware, topology-optimized microfluidic design to straight\nchannels of various widths to benchmark its performance. Evaluations of this\noptimized design show a 13% lower temperature rise or a 55% lower pressure than\nthe best-performing straight channels, indicating highly competitive\nperformance in industrial settings where both pressure and flow rate are\nconstrained.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}