{"id":"2408.13320","title":"Online Zero-Shot Classification with CLIP","authors":"Qi Qian, Juhua Hu","authorsParsed":[["Qian","Qi",""],["Hu","Juhua",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 18:12:12 GMT"}],"updateDate":"2024-08-27","timestamp":1724436732000,"abstract":"  Vision-language pre-training such as CLIP enables zero-shot transfer that can\nclassify images according to the candidate class names. While CLIP demonstrates\nan impressive zero-shot performance on diverse downstream tasks, the\ndistribution from the target data has not been leveraged sufficiently. In this\nwork, we study a novel online zero-shot transfer scenario, where each image\narrives in a random order for classification and is visited only once to obtain\nprediction immediately without storing its representation. Compared with the\nvanilla zero-shot classification, the proposed framework preserves its\nflexibility for online service while considering the statistics of the arrived\nimages as the side information to capture the distribution of target data,\nwhich can help improve the performance of real-world applications. To tackle\nthe challenge of effective online optimization, we first develop online label\nlearning to model the target data distribution. Then, the proxy of each class\nin the vision space is further optimized with the proposed online proxy\nlearning method to mitigate the modality gap between images and text. The\nconvergence of both online strategies can be theoretically guaranteed. By\ncombining the predicted label from the online label learning and proxy\nlearning, our online zero-shot transfer method (OnZeta) achieves $78.94\\%$\naccuracy on ImageNet without accessing the entire data set. Moreover, extensive\nexperiments on other 13 downstream tasks with different vision encoders show a\nmore than $3\\%$ improvement on average, which demonstrates the effectiveness of\nour proposal. Code is available at \\url{https://github.com/idstcv/OnZeta}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}