{"id":"2408.15169","title":"Theory of High-Temperature Superfluorescence in Hybrid Perovskite Thin\n  Films","authors":"B. D. Fainberg and V. Al. Osipov","authorsParsed":[["Fainberg","B. D.",""],["Osipov","V. Al.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 16:07:42 GMT"}],"updateDate":"2024-08-28","timestamp":1724774862000,"abstract":"  The recent discovery of high-temperature superfluorescence in hybrid\nperovskite thin films has opened new possibilities for harnessing macroscopic\nquantum phenomena in nanotechnology. This study aimed to elucidate the\nmechanism that enables high-temperature superfluorescence in these systems. The\nproposed model describes a quasi-2D Wannier exciton in a thin film that\ninteracts with phonons via the longitudinal optical phonon-exciton Frohlich\ninteraction. We show that the superradiant properties of the coherent state in\nhybrid perovskites are stable against perturbations caused by the longitudinal\noptical phonon-exciton Frohlich interaction. Using the multiconfiguration\nHartree approach, we derive semiclassical equations of motion for a\nsingle-exciton wavefunction, where the vibrational degrees of freedom interact\nwith the Wannier exciton through a mean-field Hartree term. Superradiance is\neffectively described by a non-Hermitian term in the Hamiltonian. The analysis\nwas then extended to multiple excited states using the semiclassical\nHamiltonian as the basic model. We demonstrate that the ground state of the\nmodel exciton Hamiltonian with long-range interactions is a symmetric Dicke\nsuperradiant state, where the Frohlich interaction is nullified. The additional\ndensity matrix-based consideration draws an analogy between this system and\nstable systems, where the conservation laws determine the nullification of the\nconstant (momentum-independent) decay rate part. In the exciton-phonon system,\nnullification is associated with the absence of a momentum-independent\ncomponent in the Wannier exciton-phonon interaction coupling function.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}