{"id":"2408.16043","title":"Gravitino Thermal Production, Dark Matter, and Reheating of the Universe","authors":"Helmut Eberl, Ioannis D. Gialamas, Vassilis C. Spanos","authorsParsed":[["Eberl","Helmut",""],["Gialamas","Ioannis D.",""],["Spanos","Vassilis C.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-30","timestamp":1724868000000,"abstract":"  We present a full one-loop calculation of the gravitino thermal production\nrate, beyond the so-called hard thermal loop approximation, using the\ncorresponding thermal spectral functions in numerical form on both sides of the\nlight cone. This framework requires a full numerical evaluation. We interpret\nour results within the framework of a general supergravity-based model,\nremaining agnostic about the specifics of supersymmetry breaking. In this\ncontext, assuming that gravitinos constitute the entirety of the dark matter in\nthe Universe imposes strict constraints on the reheating temperature. For\nexample, with a gluino mass at the current LHC limit, a maximum reheating\ntemperature of $T_\\mathrm{reh} \\simeq 10^9$ GeV is compatible with a gravitino\nmass of $m_{3/2} \\simeq 1$ TeV. Additionally, with a reheating temperature an\norder of magnitude lower at $T_\\mathrm{reh} \\simeq 10^8$ GeV, the common\ngaugino mass $M_{1/2}$ can range from $2$ to $4 $ TeV within the same gravitino\nmass range. For much higher values of $M_{1/2}$, which are favored by current\naccelerator and cosmological data in the context of supersymmetric models, such\nas $M_{1/2} = 10$ TeV, and for $m_{3/2} \\simeq 1$ TeV the reheating temperature\ncompatible with the gravitino dark matter scenario is $ 10^7$ GeV. If other\ndark matter particles are considered, the reheating temperature could be much\nlower.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}