{"id":"2408.01448","title":"15 Years of Algorithmic Fairness -- Scoping Review of Interdisciplinary\n  Developments in the Field","authors":"Daphne Lenders and Anne Oloo","authorsParsed":[["Lenders","Daphne",""],["Oloo","Anne",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 07:50:01 GMT"}],"updateDate":"2024-08-06","timestamp":1721721001000,"abstract":"  This paper presents a scoping review of algorithmic fairness research over\nthe past fifteen years, utilising a dataset sourced from Web of Science, HEIN\nOnline, FAccT and AIES proceedings. All articles come from the computer science\nand legal field and focus on AI algorithms with potential discriminatory\neffects on population groups. Each article is annotated based on their\ndiscussed technology, demographic focus, application domain and geographical\ncontext. Our analysis reveals a growing trend towards specificity in addressed\ndomains, approaches, and demographics, though a substantial portion of\ncontributions remains generic. Specialised discussions often concentrate on\ngender- or race-based discrimination in classification tasks. Regarding the\ngeographical context of research, the focus is overwhelming on North America\nand Europe (Global North Countries), with limited representation from other\nregions. This raises concerns about overlooking other types of AI applications,\ntheir adverse effects on different types of population groups, and the cultural\nconsiderations necessary for addressing these problems. With the help of some\nhighlighted works, we advocate why a wider range of topics must be discussed\nand why domain-, technological, diverse geographical and demographic-specific\napproaches are needed. This paper also explores the interdisciplinary nature of\nalgorithmic fairness research in law and computer science to gain insight into\nhow researchers from these fields approach the topic independently or in\ncollaboration. By examining this, we can better understand the unique\ncontributions that both disciplines can bring.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}