{"id":"2408.04014","title":"New versus past silica crush curve experiments: application to Dimorphos\n  benchmarking impact simulations","authors":"Uri Malamud, Christoph M. Schafer, Irina Luciana San Sebastian,\n  Maximilian Timpe, Karl Alexander Essink, Christopher Kreuzig, Gerwin Meier,\n  J\\\"urgen Blum, Hagai B. Perets, Christoph Burger","authorsParsed":[["Malamud","Uri",""],["Schafer","Christoph M.",""],["Sebastian","Irina Luciana San",""],["Timpe","Maximilian",""],["Essink","Karl Alexander",""],["Kreuzig","Christopher",""],["Meier","Gerwin",""],["Blum","Jürgen",""],["Perets","Hagai B.",""],["Burger","Christoph",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 18:02:56 GMT"}],"updateDate":"2024-08-09","timestamp":1723053776000,"abstract":"  Crush curves are of fundamental importance to numerical modeling of small and\nporous astrophysical bodies. The empirical literature often measures them for\nsilica grains, and different studies have used various methods, sizes,\ntextures, and pressure conditions. Here we review past studies and supplement\nfurther experiments in order to develop a full and overarching understanding of\nthe silica crush curve behavior. We suggest a new power-law function that can\nbe used in impact simulations of analog materials similar to micro-granular\nsilica. We perform a benchmarking study to compare this new crush curve to the\nparametric quadratic crush curve often used in other studies, based on the\nstudy case of the DART impact onto the asteroid Dimorphos. We find that the\ntypical quadratic crush curve parameters do not closely follow the silica\ncrushing experiments, and as a consequence they under (over) estimate\ncompression close (far) from the impact site. The new crush curve presented\nhere, applicable to pressures between a few hundred Pa and up to 1.1 GPa, might\ntherefore be more precise. Additionally, it is not calibrated by case-specific\nparameters, and can be used universally for comet- or asteroid-like bodies,\ngiven an assumed composition similar to micro-granular silica.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}