{"id":"2408.00047","title":"Ponder: Online Prediction of Task Memory Requirements for Scientific\n  Workflows","authors":"Fabian Lehmann, Jonathan Bader, Ninon De Mecquenem, Xing Wang, Vasilis\n  Bountris, Florian Friederici, Ulf Leser, Lauritz Thamsen","authorsParsed":[["Lehmann","Fabian",""],["Bader","Jonathan",""],["De Mecquenem","Ninon",""],["Wang","Xing",""],["Bountris","Vasilis",""],["Friederici","Florian",""],["Leser","Ulf",""],["Thamsen","Lauritz",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:04:33 GMT"}],"updateDate":"2024-08-02","timestamp":1722438273000,"abstract":"  Scientific workflows are used to analyze large amounts of data. These\nworkflows comprise numerous tasks, many of which are executed repeatedly,\nrunning the same custom program on different inputs. Users specify resource\nallocations for each task, which must be sufficient for all inputs to prevent\ntask failures. As a result, task memory allocations tend to be overly\nconservative, wasting precious cluster resources, limiting overall parallelism,\nand increasing workflow makespan.\n  In this paper, we first benchmark a state-of-the-art method on four real-life\nworkflows from the nf-core workflow repository. This analysis reveals that\ncertain assumptions underlying current prediction methods, which typically were\nevaluated only on simulated workflows, cannot generally be confirmed for real\nworkflows and executions. We then present Ponder, a new online task-sizing\nstrategy that considers and chooses between different methods to cater to\ndifferent memory demand patterns. We implemented Ponder for Nextflow and made\nthe code publicly available. In an experimental evaluation that also considers\nthe impact of memory predictions on scheduling, Ponder improves Memory\nAllocation Quality on average by 71.0% and makespan by 21.8% in comparison to a\nstate-of-the-art method. Moreover, Ponder produces 93.8% fewer task failures.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}