{"id":"2408.12975","title":"The UK Submillimetre and Millimetre Astronomy Roadmap 2024","authors":"K. Pattle, P. S. Barry, A. W. Blain, M. Booth, R. A. Booth, D. L.\n  Clements, M. J. Currie, S. Doyle, D. Eden, G. A. Fuller, M. Griffin, P. G.\n  Huggard, J. D. Ilee, J. Karoly, Z. A. Khan, N. Klimovich, E. Kontar, P.\n  Klaassen, A. J. Rigby, P. Scicluna, S. Serjeant, B.-K. Tan, D. Ward-Thompson,\n  T. G. Williams, T. A. Davis, J. Greaves, R. Ivison, J. Marin, M. Matsuura, J.\n  M. C. Rawlings, A. Saintonge, G. Savini, M. W. L. Smith, and D. J. Taylor","authorsParsed":[["Pattle","K.",""],["Barry","P. S.",""],["Blain","A. W.",""],["Booth","M.",""],["Booth","R. A.",""],["Clements","D. L.",""],["Currie","M. J.",""],["Doyle","S.",""],["Eden","D.",""],["Fuller","G. A.",""],["Griffin","M.",""],["Huggard","P. G.",""],["Ilee","J. D.",""],["Karoly","J.",""],["Khan","Z. A.",""],["Klimovich","N.",""],["Kontar","E.",""],["Klaassen","P.",""],["Rigby","A. J.",""],["Scicluna","P.",""],["Serjeant","S.",""],["Tan","B. -K.",""],["Ward-Thompson","D.",""],["Williams","T. G.",""],["Davis","T. A.",""],["Greaves","J.",""],["Ivison","R.",""],["Marin","J.",""],["Matsuura","M.",""],["Rawlings","J. M. C.",""],["Saintonge","A.",""],["Savini","G.",""],["Smith","M. W. L.",""],["Taylor","D. J.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 10:48:38 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 17:22:18 GMT"},{"version":"v3","created":"Tue, 3 Sep 2024 10:56:21 GMT"}],"updateDate":"2024-09-04","timestamp":1724410118000,"abstract":"  In this Roadmap, we present a vision for the future of submillimetre and\nmillimetre astronomy in the United Kingdom over the next decade and beyond.\nThis Roadmap has been developed in response to the recommendation of the\nAstronomy Advisory Panel (AAP) of the STFC in the AAP Astronomy Roadmap 2022.\nIn order to develop our stragetic priorities and recommendations, we surveyed\nthe UK submillimetre and millimetre community to determine their key priorities\nfor both the near-term and long-term future of the field. We further performed\ndetailed reviews of UK leadership in submillimetre/millimetre science and\ninstrumentation. Our key strategic priorities are as follows: 1. The UK must be\na key partner in the forthcoming AtLAST telescope, for which it is essential\nthat the UK remains a key partner in the JCMT in the intermediate term. 2. The\nUK must maintain, and if possible enhance, access to ALMA and aim to lead parts\nof instrument development for ALMA2040. Our strategic priorities complement one\nanother: AtLAST (a 50m single-dish telescope) and an upgraded ALMA (a large\nconfigurable interferometric array) would be in synergy, not competition, with\none another. Both have identified and are working towards the same overarching\nscience goals, and both are required in order to fully address these goals.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}