{"id":"2408.14608","title":"Meta Flow Matching: Integrating Vector Fields on the Wasserstein\n  Manifold","authors":"Lazar Atanackovic, Xi Zhang, Brandon Amos, Mathieu Blanchette, Leo J.\n  Lee, Yoshua Bengio, Alexander Tong, Kirill Neklyudov","authorsParsed":[["Atanackovic","Lazar",""],["Zhang","Xi",""],["Amos","Brandon",""],["Blanchette","Mathieu",""],["Lee","Leo J.",""],["Bengio","Yoshua",""],["Tong","Alexander",""],["Neklyudov","Kirill",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 20:05:31 GMT"}],"updateDate":"2024-08-28","timestamp":1724702731000,"abstract":"  Numerous biological and physical processes can be modeled as systems of\ninteracting entities evolving continuously over time, e.g. the dynamics of\ncommunicating cells or physical particles. Learning the dynamics of such\nsystems is essential for predicting the temporal evolution of populations\nacross novel samples and unseen environments. Flow-based models allow for\nlearning these dynamics at the population level - they model the evolution of\nthe entire distribution of samples. However, current flow-based models are\nlimited to a single initial population and a set of predefined conditions which\ndescribe different dynamics. We argue that multiple processes in natural\nsciences have to be represented as vector fields on the Wasserstein manifold of\nprobability densities. That is, the change of the population at any moment in\ntime depends on the population itself due to the interactions between samples.\nIn particular, this is crucial for personalized medicine where the development\nof diseases and their respective treatment response depends on the\nmicroenvironment of cells specific to each patient. We propose Meta Flow\nMatching (MFM), a practical approach to integrating along these vector fields\non the Wasserstein manifold by amortizing the flow model over the initial\npopulations. Namely, we embed the population of samples using a Graph Neural\nNetwork (GNN) and use these embeddings to train a Flow Matching model. This\ngives MFM the ability to generalize over the initial distributions unlike\npreviously proposed methods. We demonstrate the ability of MFM to improve\nprediction of individual treatment responses on a large scale multi-patient\nsingle-cell drug screen dataset.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}