{"id":"2408.14598","title":"Next Generation Multiple Access with Cell-Free Massive MIMO","authors":"Mohammadali Mohammadi and Zahra Mobini and Hien Quoc Ngo and Michail\n  Matthaiou","authorsParsed":[["Mohammadi","Mohammadali",""],["Mobini","Zahra",""],["Ngo","Hien Quoc",""],["Matthaiou","Michail",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 19:38:21 GMT"}],"updateDate":"2024-08-28","timestamp":1724701101000,"abstract":"  To meet the unprecedented mobile traffic demands of future wireless networks,\na paradigm shift from conventional cellular networks to distributed\ncommunication systems is imperative. Cell-free massive multiple-input\nmultiple-output (CF-mMIMO) represents a practical and scalable embodiment of\ndistributed/network MIMO systems. It inherits not only the key benefits of\nco-located massive MIMO systems but also the macro-diversity gains from\ndistributed systems. This innovative architecture has demonstrated significant\npotential in enhancing network performance from various perspectives,\noutperforming co-located mMIMO and conventional small-cell systems. Moreover,\nCF-mMIMO offers flexibility in integration with emerging wireless technologies\nsuch as full-duplex (FD), non-orthogonal transmission schemes, millimeter-wave\n(mmWave) communications, ultra-reliable low-latency communication (URLLC),\nunmanned aerial vehicle (UAV)-aided communication, and reconfigurable\nintelligent surfaces (RISs). In this paper, we provide an overview of current\nresearch efforts on CF-mMIMO systems and their promising future application\nscenarios. We then elaborate on new requirements for CF-mMIMO networks in the\ncontext of these technological breakthroughs. We also present several current\nopen challenges and outline future research directions aimed at fully realizing\nthe potential of CF mMIMO systems in meeting the evolving demands of future\nwireless networks.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0hRU5dJ1UlhA8t0vLa_8an_9kUGmRmldAkj42YCIfqU","pdfSize":"6586586"}
