{"id":"2408.00363","title":"Coexistence of large anomalous Hall effect and topological magnetic\n  skyrmions in a Weyl nodal ring ferromagnet Mn5Ge3","authors":"Hang Li, Feng Zhou, Bei Ding, Jie Chen, Linxuan Song, Wenyun Yang,\n  Yong-Chang Lau, Jinbo Yang, Yue Li, Yong Jiang, Wenhong Wang","authorsParsed":[["Li","Hang",""],["Zhou","Feng",""],["Ding","Bei",""],["Chen","Jie",""],["Song","Linxuan",""],["Yang","Wenyun",""],["Lau","Yong-Chang",""],["Yang","Jinbo",""],["Li","Yue",""],["Jiang","Yong",""],["Wang","Wenhong",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 08:05:53 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 02:32:54 GMT"}],"updateDate":"2024-08-05","timestamp":1722499553000,"abstract":"  Topological magnetic materials are expected to show multiple transport\nresponses because of their unusual bulk electronic topology in momentum space\nand topological spin texture in real space. However, such multiple topological\nproperties-hosting materials are rare in nature. In this work, we reveal the\ncoexistence of a large tunable anomalous Hall effect and topological magnetic\nskyrmions in a Weyl nodal ring ferromagnet Mn5Ge3, by using electrical\ntransport and Lorentz transmission electronic microscope (TEM) measurements. It\nwas found that the intrinsic anomalous Hall conductivity (AHC) can reach up to\n979.7 S/cm with current along [120] and magnetic field along [001] of the\nMn5Ge3 single crystals. Our theoretical calculations reveal that the large AHC\nis closely related with two Weyl nodal rings in band structure near the Fermi\nlevel and is strongly modified by the content of Ge. Moreover, our Lorentz-TEM\nimages and micromagnetic simulation results, together with the sizable\ntopological Hall effect clearly point to the robust formation of magnetic\nskyrmions over a wide temperature-magnetic field region. These results prove\nMn5Ge3 as a rare magnetic topological nodal-line semimetal with great\nsignificance to explore novel multiple topological phenomena, which facilitates\nthe development of spintronics.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pyB9O3t7l7LV5obgBbUf3akXyc0nbxS2kuRtZRQC0i4","pdfSize":"6142962"}
