{"id":"2408.01321","title":"Low-Frequency Stabilizations of the PMCHWT Equation for Dielectric and\n  Conductive Media: On a Full-Wave Alternative to Eddy-Current Solvers","authors":"V. Giunzioni, A. Scazzola, A. Merlini, F.P. Andriulli","authorsParsed":[["Giunzioni","V.",""],["Scazzola","A.",""],["Merlini","A.",""],["Andriulli","F. P.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 15:20:22 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 08:45:40 GMT"}],"updateDate":"2024-08-07","timestamp":1722612022000,"abstract":"  We propose here a novel stabilization strategy for the PMCHWT equation that\ncures its frequency and conductivity related instabilities and is obtained by\nleveraging quasi-Helmholtz projectors. The resulting formulation is\nwell-conditioned in the entire low-frequency regime, including the eddy current\none, and can be applied to arbitrarily penetrable materials, ranging from\ndielectric to conductive ones. In addition, by choosing the rescaling\ncoefficients of the quasi-Helmholtz components appropriately, we prevent the\ntypical loss of accuracy occurring at low frequency in the presence of\ninductive and capacitive type magnetic frill excitations, commonly used in\ncircuit modeling to impose a potential difference. Finally, leveraging on\nquasi-Helmholtz projectors instead than on the standard Loop-Star\ndecomposition, our formulation is also compatible with most fast solvers and is\namenable to multiply connected geometries, without any computational overhead\nfor the search for the global loops of the structure. The efficacy of the\nproposed preconditioning scheme when applied to both simply and multiply\nconnected geometries is corroborated by numerical examples.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_YSTM4zyIfftNKOspAaBnrfIyQj0BdZH4FWyPlwNpd4","pdfSize":"1202347","txDigest":"4Y6eWKC7xe8dMTAMDKGrRRBauKVHz5P8nm5CHBXChywy","endEpoch":"1","status":"CERTIFIED"}
