{"id":"2408.03611","title":"Feasibility of iMagLS-BSM -- ILD Informed Binaural Signal Matching with\n  Arbitrary Microphone Arrays","authors":"Or Berebi, Zamir Ben-Hur, David Lou Alon and Boaz Rafaely","authorsParsed":[["Berebi","Or",""],["Ben-Hur","Zamir",""],["Alon","David Lou",""],["Rafaely","Boaz",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 08:04:30 GMT"}],"updateDate":"2024-08-08","timestamp":1723017870000,"abstract":"  Binaural reproduction for headphone-centric listening has become a focal\npoint in ongoing research, particularly within the realm of advancing\ntechnologies such as augmented and virtual reality (AR and VR). The demand for\nhigh-quality spatial audio in these applications is essential to uphold a\nseamless sense of immersion. However, challenges arise from wearable recording\ndevices equipped with only a limited number of microphones and irregular\nmicrophone placements due to design constraints. These factors contribute to\nlimited reproduction quality compared to reference signals captured by\nhigh-order microphone arrays. This paper introduces a novel optimization loss\ntailored for a beamforming-based, signal-independent binaural reproduction\nscheme. This method, named iMagLS-BSM incorporates an interaural level\ndifference (ILD) error term into the previously proposed binaural signal\nmatching (BSM) magnitude least squares (MagLS) rendering loss for lateral plane\nangles. The method leverages nonlinear programming to minimize the introduced\nloss. Preliminary results show a substantial reduction in ILD error, while\nmaintaining a binaural magnitude error comparable to that achieved with a MagLS\nBSM solution. These findings hold promise for enhancing the overall spatial\nquality of resultant binaural signals.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Sound"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"lD1SvBqmJXE8ajEzs26zlBkuvNelwxghDGJAdsN6AYg","pdfSize":"411133"}
