{"id":"2408.10470","title":"Inverse Design of Snap-Actuated Jumping Robots Powered by\n  Mechanics-Aided Machine Learning","authors":"Dezhong Tong, Zhuonan Hao, Mingchao Liu, Weicheng Huang","authorsParsed":[["Tong","Dezhong",""],["Hao","Zhuonan",""],["Liu","Mingchao",""],["Huang","Weicheng",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 00:50:34 GMT"}],"updateDate":"2024-08-21","timestamp":1724115034000,"abstract":"  Exploring the design and control strategies of soft robots through simulation\nis highly attractive due to its cost-effectiveness. Although many existing\nmodels (e.g., finite element analysis) are effective for simulating soft\nrobotic dynamics, there remains a need for a general and efficient numerical\nsimulation approach in the soft robotics community. In this paper, we develop a\ndiscrete differential geometry-based numerical framework to achieve the\nmodel-based inverse design of a novel snap-actuated jumping robot. It is found\nthat the dynamic process of a snapping beam can be either symmetric or\nasymmetric, such that the trajectory of the jumping robot can be tunable (e.g.,\nhorizontal or vertical). By employing this novel mechanism of the bistable beam\nas the robotic actuator, we next propose a physics-data hybrid inverse design\nstrategy for the snap-jump robot with a broad spectrum of jumping capabilities.\nWe first use the physical engine to study the influences of the robot's design\nparameters on the jumping capabilities, then generate extensive simulation data\nto formulate a data-driven inverse design solution. The inverse design solution\ncan rapidly explore the combination of design parameters for achieving a target\njump, which provides valuable guidance for the fabrication and control of the\njumping robot. The proposed methodology paves the way for exploring the design\nand control insights of soft robots with the help of simulations.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}