{"id":"2408.15682","title":"A quantitative model of takeover request time budget for conditionally\n  automated driving","authors":"Foghor Tanshi, Dirk S\\\"offker","authorsParsed":[["Tanshi","Foghor",""],["Söffker","Dirk",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 10:12:44 GMT"}],"updateDate":"2024-08-29","timestamp":1724839964000,"abstract":"  In conditional automation, the automated driving system assumes full control\nand only issues a takeover request to a human driver to resume driving in\ncritical situations. Previous studies have concluded that the time budget\nrequired by drivers to resume driving after a takeover request varies with\nsituations and different takeover variables. However, no comprehensive\ngeneralized approaches for estimating in advance the time budget required by\ndrivers to takeover have been provided. In this contribution, fixed (7 s) and\nvariable time budgets (6 s, 5 s, and 4 s) with and without visual imagery\nassistance were investigated for suitability in three takeover scenarios using\nperformance measures such as average lateral displacement. The results indicate\nthat 7 s is suitable for two of the studied scenarios based on their\ncharacteristics. Using the obtained results and known relations between\ntakeover variables, a mathematical formula for estimating takeover request time\nbudget is proposed. The proposed formula integrates individual stimulus\nresponse time, driving experience, scenario specific requirements and allows\nincreased safety for takeover maneuvers. Furthermore, the visual imagery\nresulted in increased takeover time which invariably increases the time budget.\nThus the time demand of the visualized information if applicable (such as\nvisual imagery) should be included in the time budget.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Robotics","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"DX1-HZJop6kmZKsoeqwIfBs5VExhtpYV8yaw7HQCQ3s","pdfSize":"6876068"}
