{"id":"2408.01802","title":"First results on new helium based eco-gas mixtures for the Extreme\n  Energy Events Project","authors":"M. Abbrescia, C. Avanzini, L. Baldini, R. Baldini Ferroli, G.\n  Batignani, M. Battaglieri, S. Boi, E. Bossini, F. Carnesecchi, F. Cavazza, C.\n  Cical\\`o, L. Cifarelli, F. Coccetti, E. Coccia, A. Corvaglia, D. De Gruttola,\n  S. De Pasquale, L. Galante, M. Garbini, I. Gnesi, F. Gramegna, S. Grazzi, D.\n  Hatzifotiadou, P. La Rocca, Z. Liu, G. Mandaglio, A. Margotti, G. Maron, M.\n  N. Mazziotta, A. Mulliri, R. Nania, F. Noferini, F. Nozzoli, F. Palmonari, M.\n  Panareo, M. P. Panetta, R. Paoletti, C. Pellegrino, L. Perasso, O. Pinazza,\n  C. Pinto, S. Pisano, F. Riggi, G. Righini, C. Ripoli, M. Rizzi, G.\n  Sartorelli, E. Scapparone, M. Schioppa, G. Scioli, A. Scribano, M. Selvi, M.\n  Taiuti, G. Terreni, A. Trifir\\`o, M. Trimarchi, C. Vistoli, L. Votano, M. C.\n  S. Williams, A. Zichichi, R. Zuyeuski","authorsParsed":[["Abbrescia","M.",""],["Avanzini","C.",""],["Baldini","L.",""],["Ferroli","R. Baldini",""],["Batignani","G.",""],["Battaglieri","M.",""],["Boi","S.",""],["Bossini","E.",""],["Carnesecchi","F.",""],["Cavazza","F.",""],["Cicalò","C.",""],["Cifarelli","L.",""],["Coccetti","F.",""],["Coccia","E.",""],["Corvaglia","A.",""],["De Gruttola","D.",""],["De Pasquale","S.",""],["Galante","L.",""],["Garbini","M.",""],["Gnesi","I.",""],["Gramegna","F.",""],["Grazzi","S.",""],["Hatzifotiadou","D.",""],["La Rocca","P.",""],["Liu","Z.",""],["Mandaglio","G.",""],["Margotti","A.",""],["Maron","G.",""],["Mazziotta","M. N.",""],["Mulliri","A.",""],["Nania","R.",""],["Noferini","F.",""],["Nozzoli","F.",""],["Palmonari","F.",""],["Panareo","M.",""],["Panetta","M. P.",""],["Paoletti","R.",""],["Pellegrino","C.",""],["Perasso","L.",""],["Pinazza","O.",""],["Pinto","C.",""],["Pisano","S.",""],["Riggi","F.",""],["Righini","G.",""],["Ripoli","C.",""],["Rizzi","M.",""],["Sartorelli","G.",""],["Scapparone","E.",""],["Schioppa","M.",""],["Scioli","G.",""],["Scribano","A.",""],["Selvi","M.",""],["Taiuti","M.",""],["Terreni","G.",""],["Trifirò","A.",""],["Trimarchi","M.",""],["Vistoli","C.",""],["Votano","L.",""],["Williams","M. C. S.",""],["Zichichi","A.",""],["Zuyeuski","R.",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 15:06:56 GMT"}],"updateDate":"2024-08-06","timestamp":1722697616000,"abstract":"  The Extreme Energy Events (EEE) Project, a joint project of the Centro Fermi\n(Museo Storico della Fisica e Centro Studi e Ricerche \"E.Fermi\") and INFN, has\na dual purpose: a scientific research program on cosmic rays at ground level\nand an intense outreach and educational program. The project consists in a\nnetwork of about 60 tracking detectors, called telescopes, mostly hosted in\nItalian High Schools. Each telescope is made by three Multigap Resistive Plate\nChambers, operated so far with a gas mixture composed by 98% C$_2$H$_2$F$_4$\nand 2% SF$_6$. Due to its high Global Warming Potential, a few years ago the\nEEE collaboration has started an extensive R&D on alternative mixtures\nenvironmentally sustainable and compatible with the current experimental setup\nand operational environment. Among other gas mixtures, the one with helium and\nhydrofluoroolefin R1234ze gave the best result during the preliminary tests\nperformed with two of the network telescopes. The detector has proved to reach\nperformance levels comparable to those obtained with previous mixtures, without\nany modification of the hardware. We will discuss the first results obtained\nwith the new mixture, tested with different percentages of the two components.\n","subjects":["Physics/High Energy Physics - Experiment","Physics/Instrumentation and Detectors"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}