{"id":"2408.03002","title":"Damage identification for bridges using machine learning: Development\n  and application to KW51 bridge","authors":"Yuqing Qiu, Bilal Ahmed, Diab W. Abueidda, Waleed El-Sekelly, Borja\n  Garcia de Soto, Tarek Abdoun, Hongli Ji, Jinhao Qiu, Mostafa E. Mobasher","authorsParsed":[["Qiu","Yuqing",""],["Ahmed","Bilal",""],["Abueidda","Diab W.",""],["El-Sekelly","Waleed",""],["de Soto","Borja Garcia",""],["Abdoun","Tarek",""],["Ji","Hongli",""],["Qiu","Jinhao",""],["Mobasher","Mostafa E.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 07:20:51 GMT"}],"updateDate":"2024-08-07","timestamp":1722928851000,"abstract":"  Over the past few decades, structural health monitoring (SHM) has drawn\nsignificant attention to identifying damage in structures. However, there are\nopen challenges related to the efficiency and applicability of the existing\ndamage identification approaches. This paper proposes an effective approach\nthat integrates both modal analysis and dynamic analysis strategies for damage\nidentification and applies it to the KW51 railway bridge in Leuven, Belgium.\nThe ML-based damage identification utilizes four types of features: modal\nanalysis input, frequency characteristics, time-frequency characteristics, and\nstacked time series feature extraction from forced acceleration response.\nSignal processing methods such as stacking, Fourier transform, and wavelet\ntransform are employed to extract damage-sensitive features from the\nacceleration series. The ML methods, including the k-nearest neighbors (kNN)\nalgorithm, stacked gated recurrent unit (stacked GRU) network, and\nconvolutional neural network (CNN), are then combined to assess the existence,\nextent, and location of damage. The proposed method is applied to the KW51\nrailway bridge. A finite element model (FEM) of the KW51 bridge is developed,\nwhich is validated by modal analysis. Various extents and locations of damage\nare simulated to generate the \"Damaged\" data, while the \"Intact\" data from FEM\nor measured data serve as a baseline for comparison. The identification results\nfor the KW51 bridge demonstrate the high accuracy and robustness of the\nproposed approach, confirming its effectiveness in damage identification\nproblems.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}