{"id":"2408.14005","title":"The Calibration of Polycyclic Aromatic Hydrocarbon Dust Emission as a\n  Star Formation Rate Indicator in the AKARI NEP Survey","authors":"Helen Kyung Kim, Matthew A. Malkan, Toshinobu Takagi, Nagisa Oi, Denis\n  Burgarella, Takamitsu Miyaji, Hyunjin Shim, Hideo Matsuhara, Tomotsugu Goto,\n  Yoichi Ohyama, Veronique Buat, Seong Jin Kim","authorsParsed":[["Kim","Helen Kyung",""],["Malkan","Matthew A.",""],["Takagi","Toshinobu",""],["Oi","Nagisa",""],["Burgarella","Denis",""],["Miyaji","Takamitsu",""],["Shim","Hyunjin",""],["Matsuhara","Hideo",""],["Goto","Tomotsugu",""],["Ohyama","Yoichi",""],["Buat","Veronique",""],["Kim","Seong Jin",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 04:15:12 GMT"}],"updateDate":"2024-08-27","timestamp":1724645712000,"abstract":"  Polycyclic aromatic hydrocarbon (PAH) dust emission has been proposed as an\neffective extinction-independent star formation rate (SFR) indicator in the\nmid-infrared (MIR), but this may depend on conditions in the interstellar\nmedium. The coverage of the AKARI/Infrared Camera (IRC) allows us to study the\neffects of metallicity, starburst intensity, and active galactic nuclei on PAH\nemission in galaxies with $f_{\\nu}(L18W)\\lesssim 19$ AB mag. Observations\ninclude follow-up, rest-frame optical spectra of 443 galaxies within the AKARI\nNorth Ecliptic Pole survey that have IRC detections from 7-24 $\\mu$m. We use\noptical emission line diagnostics to infer SFR based on H$\\alpha$ and [O\nII]$\\lambda\\lambda 3726,3729$ emission line luminosities. The PAH 6.2 $\\mu$m\nand PAH 7.7 $\\mu$m luminosities ($L(PAH\\ 6.2\\ \\mu m)$ and $L(PAH\\ 7.7\\ \\mu m)$,\nrespectively) derived using multi-wavelength model fits are consistent with\nthose derived from slitless spectroscopy within 0.2 dex. $L(PAH\\ 6.2\\ \\mu m)$\nand $L(PAH\\ 7.7\\ \\mu m)$ correlate linearly with the 24 $\\mu$m-dust corrected\nH$\\alpha$ luminosity only for normal, star-forming ``main-sequence\" galaxies.\nAssuming multi-linear correlations, we quantify the additional dependencies on\nmetallicity and starburst intensity, which we use to correct our PAH SFR\ncalibrations at $0<z<1.2$ for the first time. We derive the cosmic star\nformation rate density (SFRD) per comoving volume from $0.15 \\lesssim z\n\\lesssim 1$. The PAH SFRD is consistent with that of the far-infrared and\nreaches an order of magnitude higher than that of uncorrected UV observations\nat $z\\sim1$. Starburst galaxies contribute $\\gtrsim 0.7$ of the total SFRD at\n$z\\sim1$ compared to main-sequence galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}