{"id":"2408.16181","title":"A Minibatch-SGD-Based Learning Meta-Policy for Inventory Systems with\n  Myopic Optimal Policy","authors":"Jiameng Lyu, Jinxing Xie, Shilin Yuan, Yuan Zhou","authorsParsed":[["Lyu","Jiameng",""],["Xie","Jinxing",""],["Yuan","Shilin",""],["Zhou","Yuan",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 00:36:34 GMT"}],"updateDate":"2024-08-30","timestamp":1724891794000,"abstract":"  Stochastic gradient descent (SGD) has proven effective in solving many\ninventory control problems with demand learning. However, it often faces the\npitfall of an infeasible target inventory level that is lower than the current\ninventory level. Several recent works (e.g., Huh and Rusmevichientong (2009),\nShi et al.(2016)) are successful to resolve this issue in various inventory\nsystems. However, their techniques are rather sophisticated and difficult to be\napplied to more complicated scenarios such as multi-product and\nmulti-constraint inventory systems.\n  In this paper, we address the infeasible-target-inventory-level issue from a\nnew technical perspective -- we propose a novel minibatch-SGD-based\nmeta-policy. Our meta-policy is flexible enough to be applied to a general\ninventory systems framework covering a wide range of inventory management\nproblems with myopic clairvoyant optimal policy. By devising the optimal\nminibatch scheme, our meta-policy achieves a regret bound of\n$\\mathcal{O}(\\sqrt{T})$ for the general convex case and $\\mathcal{O}(\\log T)$\nfor the strongly convex case. To demonstrate the power and flexibility of our\nmeta-policy, we apply it to three important inventory control problems:\nmulti-product and multi-constraint systems, multi-echelon serial systems, and\none-warehouse and multi-store systems by carefully designing\napplication-specific subroutines.We also conduct extensive numerical\nexperiments to demonstrate that our meta-policy enjoys competitive regret\nperformance, high computational efficiency, and low variances among a wide\nrange of applications.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ORdR3YXbam26ZIKLLSoK8qNO3yiExnAkJY6I65lapoU","pdfSize":"2795996"}
