{"id":"2408.04411","title":"Higher-order effects in the dynamics of hierarchical triple systems. II.\n  Second-order and dotriacontapole-order effects","authors":"Landen Conway and Clifford M. Will","authorsParsed":[["Conway","Landen",""],["Will","Clifford M.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 12:25:56 GMT"}],"updateDate":"2024-08-09","timestamp":1723119956000,"abstract":"  We analyze the long-term evolution of hierarchical triple systems in\nNewtonian gravity to second order in the quadrupolar perturbation parameter,\nand to sixth order in $\\epsilon = a/A$, the ratio of the semimajor axes of the\ninner and outer orbits. We apply the ``two-timescale'' method from applied\nmathematics to the Lagrange Planetary Equations for the inner and outer orbits,\nin which each osculating orbit element is split into an orbit averaged part\nthat evolves on the long perturbative timescale, and an ``average-free'' part\nthat is oscillatory in the orbital timescales. Averages over the two orbital\ntimescales are performed using the well-known secular approximation. We also\nincorporate perturbative corrections to the relation between time and the\norbital phases. We place no restrictions on the masses, on the relative orbit\ninclinations or on the eccentricities, beyond the requirement that the\nquadrupolar parameter and $\\epsilon$ both be small. The result is a complete\nset of long-timescale evolution equations for the averaged elements of the\ninner and outer orbits. At first order in perturbation theory, we obtain the\ndotriacontapole contributions explicitly at order $\\epsilon^6$. At second order\nin perturbation theory, i.e. quadratic in the quadrupole perturbation\namplitude, we find contributions that scale as $\\epsilon^{9/2}$ (found in\nearlier work), $\\epsilon^{5}$, $\\epsilon^{11/2}$, and $\\epsilon^{6}$. At first\nperturbative order and dotriacontapole order, the two averaged semimajor axes\nare constant in time (and we prove that this holds to arbitrary multipole\norders); but at second perturbative order, beginning at $O( \\epsilon^{5})$,\nthey are no longer constant. Nevertheless we verify that the total averaged\nenergy of the system is conserved, and we argue that this behavior is not\nincompatible with classical theorems on secular evolution of the semimajor\naxes.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/"}