{"id":"2408.11681","title":"Variational autoencoder inverse mapper for extraction of Compton form\n  factors: Benchmarks and conditional learning","authors":"Fayaz Hossen, Douglas Adams, Joshua Bautista, Yaohang Li, Gia-Wei\n  Chern, Simonetta Liuti, Marie Boer, Marija Cuic, Gari R. Goldstein, Michael\n  Engelhardt, Huey-Wen Li","authorsParsed":[["Hossen","Fayaz",""],["Adams","Douglas",""],["Bautista","Joshua",""],["Li","Yaohang",""],["Chern","Gia-Wei",""],["Liuti","Simonetta",""],["Boer","Marie",""],["Cuic","Marija",""],["Goldstein","Gari R.",""],["Engelhardt","Michael",""],["Li","Huey-Wen",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 15:01:51 GMT"}],"updateDate":"2024-08-22","timestamp":1724252511000,"abstract":"  Deeply virtual exclusive scattering processes (DVES) serve as precise probes\nof nucleon quark and gluon distributions in coordinate space. These\ndistributions are derived from generalized parton distributions (GPDs) via\nFourier transform relative to proton momentum transfer. QCD factorization\ntheorems enable DVES to be parameterized by Compton form factors (CFFs), which\nare convolutions of GPDs with perturbatively calculable kernels. Accurate\nextraction of CFFs from DVCS, benefiting from interference with the\nBethe-Heitler (BH) process and a simpler final state structure, is essential\nfor inferring GPDs. This paper focuses on extracting CFFs from DVCS data using\na variational autoencoder inverse mapper (VAIM) and its constrained variant\n(C-VAIM). VAIM is shown to be consistent with Markov Chain Monte Carlo (MCMC)\nmethods in extracting multiple CFF solutions for given kinematics, while C-VAIM\neffectively captures correlations among CFFs across different kinematic values,\nproviding more constrained solutions. This study represents a crucial first\nstep towards a comprehensive analysis pipeline towards the extraction of GPDs.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}