{"id":"2408.09741","title":"Observation of electrical high-harmonic generation","authors":"Xiaozhou Zan, Ming Gong, Zitian Pan, Haiwen Liu, Jingwei Dong, Jundong\n  Zhu, Le Liu, Yanbang Chu, Kenji Watanabe, Takashi Taniguchi, Dongxia Shi, Wei\n  Yang, Luojun Du, Xin-Cheng Xie and Guangyu Zhang","authorsParsed":[["Zan","Xiaozhou",""],["Gong","Ming",""],["Pan","Zitian",""],["Liu","Haiwen",""],["Dong","Jingwei",""],["Zhu","Jundong",""],["Liu","Le",""],["Chu","Yanbang",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Shi","Dongxia",""],["Yang","Wei",""],["Du","Luojun",""],["Xie","Xin-Cheng",""],["Zhang","Guangyu",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 07:13:22 GMT"}],"updateDate":"2024-08-20","timestamp":1724051602000,"abstract":"  High-harmonic generation (HHG), an extreme nonlinear effect, introduces an\nunprecedented paradigm to detect emergent quantum phases and electron dynamics\ninconceivable in the framework of linear and low-order nonlinear processes. As\nan important manifestation, the optical HHG (o-HHG) enables extraordinary\nopportunities to underpin attosecond physics. In addition to nonlinear optics,\nemerging nonlinear electric transport has been demonstrated recently and opens\nnew paradigms to probe quantum phase transition, symmetry breaking, band\ngeometrical and topological properties. Thus far, only electrical\nsecond-/third-harmonic generation in perturbative regime has been elucidated,\nwhile the electrical HHG (e-HHG) that can advance to extreme non-perturbative\nphysics remains elusive. Here we report the observation of e-HHG up to\n300th-order. Remarkably, the e-HHG shows a clear non-perturbative character and\nexhibits periodic oscillations with the reciprocal of driving current. Further,\ntheoretical simulations corroborate the experiments, suggesting the\ncontribution of singular distribution of Berry curvature near band edges. Our\nresults demonstrate e-HHG in extreme nonlinear regime and may shed light on a\nplethora of exotic physics and applications, such as extreme non-equilibrium\nquantum phenomena, ultra-fast and coherent electrical signal generations and\ndetections.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}