{"id":"2408.16817","title":"Dark matter halo properties from spatially integrated HI flux profiles","authors":"Tariq Yasin and Harry Desmond","authorsParsed":[["Yasin","Tariq",""],["Desmond","Harry",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-09-02","timestamp":1724954400000,"abstract":"  Resolved rotation curves (RCs) are our best probe of the dark matter\ndistribution around individual galaxies. However their acquisition is\nresource-intensive, rendering them impractical for large-scale surveys and\nstudies at higher redshift. Spatially integrated HI flux profiles on the other\nhand are observationally abundant and also probe dynamics across the whole HI\ndisc. Despite this, they are typically only studied using the highly compressed\nlinewidth summary statistic, discarding much of the available information. Here\nwe construct a Bayesian model to infer halo properties from the full shape of\nthe spatially integrated 21-cm line profile of a galaxy, utilising all the\navailable information. We validate our model by assessing the consistency of\nhalo parameters obtained from the flux profile with those obtained from RC fits\nfor galaxies where both are available, finding good agreement provided the\nprofile is not strongly asymmetric. We study the relative constraining power\n(quantified using the Kullback--Leibler divergence of the posterior from the\nprior), finding the flux profile inference recovers posteriors on generalised\nNavarro--Frenk--White halo parameters on average three times tighter than those\nfrom the linewidth, and in some cases as tight as those from resolved RCs.\nFinally we introduce and validate a probabilistic empirical model for the\nspatial distribution of HI, enabling our model to be applied to datasets for\nwhich no spatially resolved HI information is available. As the next-generation\nof HI observatories comes online, our framework will enable mass modelling in\nnew regimes, with particular utility for constraining the dark matter content\nof galaxies across cosmic time.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}