{"id":"2408.17009","title":"Utilizing Speaker Profiles for Impersonation Audio Detection","authors":"Hao Gu and JiangYan Yi and Chenglong Wang and Yong Ren and Jianhua Tao\n  and Xinrui Yan and Yujie Chen and Xiaohui Zhang","authorsParsed":[["Gu","Hao",""],["Yi","JiangYan",""],["Wang","Chenglong",""],["Ren","Yong",""],["Tao","Jianhua",""],["Yan","Xinrui",""],["Chen","Yujie",""],["Zhang","Xiaohui",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 04:42:01 GMT"}],"updateDate":"2024-09-02","timestamp":1724992921000,"abstract":"  Fake audio detection is an emerging active topic. A growing number of\nliteratures have aimed to detect fake utterance, which are mostly generated by\nText-to-speech (TTS) or voice conversion (VC). However, countermeasures against\nimpersonation remain an underexplored area. Impersonation is a fake type that\ninvolves an imitator replicating specific traits and speech style of a target\nspeaker. Unlike TTS and VC, which often leave digital traces or signal\nartifacts, impersonation involves live human beings producing entirely natural\nspeech, rendering the detection of impersonation audio a challenging task.\nThus, we propose a novel method that integrates speaker profiles into the\nprocess of impersonation audio detection. Speaker profiles are inherent\ncharacteristics that are challenging for impersonators to mimic accurately,\nsuch as speaker's age, job. We aim to leverage these features to extract\ndiscriminative information for detecting impersonation audio. Moreover, there\nis no large impersonated speech corpora available for quantitative study of\nimpersonation impacts. To address this gap, we further design the first\nlarge-scale, diverse-speaker Chinese impersonation dataset, named ImPersonation\nAudio Detection (IPAD), to advance the community's research on impersonation\naudio detection. We evaluate several existing fake audio detection methods on\nour proposed dataset IPAD, demonstrating its necessity and the challenges.\nAdditionally, our findings reveal that incorporating speaker profiles can\nsignificantly enhance the model's performance in detecting impersonation audio.\n","subjects":["Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}