{"id":"2408.06149","title":"On the Peril of Inferring Phytoplankton Properties from Remote-Sensing\n  Observations","authors":"J. Xavier Prochaska (1,2,3,4) and Robert J. Frouin (4) ((1) Affiliate\n  of the Ocean Sciences Department, University of California, Santa Cruz, (2)\n  Department of Astronomy & Astrophysics, UCSC, (3) Kavli IPMU, (4) Scripps\n  Institution of Oceanography, University of California, San Diego)","authorsParsed":[["Prochaska","J. Xavier",""],["Frouin","Robert J.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 13:43:41 GMT"}],"updateDate":"2024-08-13","timestamp":1723470221000,"abstract":"  Since 1978, sensors on remote-sensing satellites have provided global,\nmulti-band images at optical wavelengths to assess ocean color. In parallel,\nsophisticated radiative transfer models account for attenuation and emission by\nthe Earth's atmosphere and ocean, thereby estimating the water-leaving radiance\nor and remote-sensing reflectance Rrs. From these Rrs measurements, estimates\nof the absorption and scattering by seawater are inferred. We emphasize an\ninherent, physical degeneracy in the radiative transfer equation that relates\nRrs to the absorption and backscattering coefficients a and b_b, aka inherent\noptical properties (IOPs). Because Rrs depends solely on the ratio of b_b to a,\nmeaning one cannot retrieve independent functions for the non-water IOPs, a_nw\nand b_bnw, without a priori knowledge. Moreover, water generally dominates\nscattering at blue wavelengths and absorption at red wavelengths, further\nlimiting retrievals of IOPs in the presence of noise. We demonstrate that all\nprevious and current multi-spectral satellite observations lack the statistical\npower to measure more than 3 parameters total to describe a_nw and b_bnw. Due\nto the ubiquitous exponential-like absorption by color dissolved organic matter\nat short wavelengths (l<500nm), multi-spectral Rrs do not permit the detection\nof phytoplankton absorption a_ph without very strict priors. Furthermore, such\npriors lead to biased and uncertain retrievals of a_ph. Hyperspectral\nobservations may recover a 4th and possibly 5th parameter describing only one\nor two aspects of the complexity of a_ph. These results cast doubt on decades\nof literature on IOP retrievals, including estimates of phytoplankton growth\nand biomass. We further conclude that NASA/PACE will greatly enhance our\nability to measure the phytoplankton biomass of Earth, but challenges remain in\nresolving the IOPs.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GcYWhaQikfswGMQ6-o8u4fOeGAJXTxjEHb7ViX-Lhq4","pdfSize":"6241948"}
