{"id":"2408.13321","title":"Simulation of the THF hydrate-water interfacial free energy from\n  computer simulation","authors":"Miguel J. Torrej\\'on, Crist\\'obal Romero-Guzm\\'an, Manuel M.\n  Pi\\~neiro, Felipe J. Blas, and Jes\\'us Algaba","authorsParsed":[["Torrejón","Miguel J.",""],["Romero-Guzmán","Cristóbal",""],["Piñeiro","Manuel M.",""],["Blas","Felipe J.",""],["Algaba","Jesús",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 18:13:25 GMT"}],"updateDate":"2024-08-27","timestamp":1724436805000,"abstract":"  In this work, the tetrahydrofuran (THF) hydrate-water interfacial free energy\nis determined at $500\\,\\text{bar}$, at one point of the univariant two-phase\ncoexistence line of the THF hydrate, by molecular dynamics simulation. The Mold\nIntegration-Host methodology, an extension of the original Mold Integration\ntechnique to deal with hydrate-fluid interfaces, is used to calculate the\ninterfacial energy. Water is described using the well-known TIP4P/Ice model and\nTHF is described using a rigid version of the TraPPE model. We have recently\nused the combination of these two models to accurately describe the univariant\ntwo-phase dissociation line of the THF hydrate, in a wide range of pressures,\nfrom computer simulation [J. Chem. Phys. 160, 164718 (2024)]. The THF\nhydrate-water interfacial free energy predicted in this work is compared with\nthe only experimental data available in the literature. The value obtained,\n$27(2)\\,\\text{mJ/m}^{2}$, is in excellent agreement with the experimental data\ntaken from the literature, $24(8)\\,\\text{mJ/m}^{2}$. To the best of our\nknowledge, this is the first time that the THF hydrate-water interfacial free\nenergy is predicted from computer simulation. This work confirms that the Mold\nIntegration technique can be used with confidence to predict solid-fluid\ninterfaces of complex structures, including hydrates that exhibit sI and sII\ncrystallographic structures.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/"}