{"id":"2408.14795","title":"Electron ptychography reveals a ferroelectricity dominated by anion\n  displacements","authors":"Harikrishnan K. P., Ruijuan Xu, Kinnary Patel, Kevin J. Crust, Aarushi\n  Khandelwal, Chenyu Zhang, Sergey Prosandeev, Hua Zhou, Yu-Tsun Shao, Laurent\n  Bellaiche, Harold Y. Hwang, David A. Muller","authorsParsed":[["P.","Harikrishnan K.",""],["Xu","Ruijuan",""],["Patel","Kinnary",""],["Crust","Kevin J.",""],["Khandelwal","Aarushi",""],["Zhang","Chenyu",""],["Prosandeev","Sergey",""],["Zhou","Hua",""],["Shao","Yu-Tsun",""],["Bellaiche","Laurent",""],["Hwang","Harold Y.",""],["Muller","David A.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 05:58:37 GMT"}],"updateDate":"2024-08-28","timestamp":1724738317000,"abstract":"  Sodium niobate, a lead-free ferroic material, hosts delicately-balanced,\ncompeting order parameters, including ferroelectric states that can be\nstabilized by epitaxial strain. Here, we show that the resulting macroscopic\nferroelectricity exhibits an unconventional microscopic structure using\nmultislice electron ptychography. This technique overcomes multiple scattering\nartifacts limiting conventional electron microscopy, enabling both lateral\nspatial resolution beyond the diffraction limit and recovery of\nthree-dimensional structural information. These imaging capabilities allow us\nto separate the ferroelectric interior of the sample from the relaxed surface\nstructure and identify the soft phonon mode and related structural distortions\nwith picometer precision. Unlike conventional ferroelectric perovskites, we\nfind that the polar distortion in this material involves minimal distortions of\nthe cation sublattices and is instead dominated by anion displacements. We\nestablish limits on film thickness for interfacial octahedral rotation\nengineering and directly visualize an incommensurate octahedral rotation\npattern, arising from the flat dispersion of the associated phonon mode.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}