{"id":"2408.03120","title":"Benchmarking In-the-wild Multimodal Disease Recognition and A Versatile\n  Baseline","authors":"Tianqi Wei, Zhi Chen, Zi Huang, Xin Yu","authorsParsed":[["Wei","Tianqi",""],["Chen","Zhi",""],["Huang","Zi",""],["Yu","Xin",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 11:49:13 GMT"}],"updateDate":"2024-08-07","timestamp":1722944953000,"abstract":"  Existing plant disease classification models have achieved remarkable\nperformance in recognizing in-laboratory diseased images. However, their\nperformance often significantly degrades in classifying in-the-wild images.\nFurthermore, we observed that in-the-wild plant images may exhibit similar\nappearances across various diseases (i.e., small inter-class discrepancy) while\nthe same diseases may look quite different (i.e., large intra-class variance).\nMotivated by this observation, we propose an in-the-wild multimodal plant\ndisease recognition dataset that contains the largest number of disease classes\nbut also text-based descriptions for each disease. Particularly, the newly\nprovided text descriptions are introduced to provide rich information in\ntextual modality and facilitate in-the-wild disease classification with small\ninter-class discrepancy and large intra-class variance issues. Therefore, our\nproposed dataset can be regarded as an ideal testbed for evaluating disease\nrecognition methods in the real world. In addition, we further present a strong\nyet versatile baseline that models text descriptions and visual data through\nmultiple prototypes for a given class. By fusing the contributions of\nmultimodal prototypes in classification, our baseline can effectively address\nthe small inter-class discrepancy and large intra-class variance issues.\nRemarkably, our baseline model can not only classify diseases but also\nrecognize diseases in few-shot or training-free scenarios. Extensive\nbenchmarking results demonstrate that our proposed in-the-wild multimodal\ndataset sets many new challenges to the plant disease recognition task and\nthere is a large space to improve for future works.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}