{"id":"2408.08522","title":"The Steepest Slope toward a Quantum Few-body Solution: Gradient\n  Variational Methods for the Quantum Few-body Problem","authors":"Paolo Recchia, Debabrota Basu, Mario Gattobigio, Christian Miniatura,\n  St\\'ephane Bressan","authorsParsed":[["Recchia","Paolo",""],["Basu","Debabrota",""],["Gattobigio","Mario",""],["Miniatura","Christian",""],["Bressan","Stéphane",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 04:32:47 GMT"},{"version":"v2","created":"Mon, 19 Aug 2024 12:31:49 GMT"}],"updateDate":"2024-08-20","timestamp":1723782767000,"abstract":"  Quantum few-body systems are deceptively simple. Indeed, with the notable\nexception of a few special cases, their associated Schrodinger equation cannot\nbe solved analytically for more than two particles. One has to resort to\napproximation methods to tackle quantum few-body problems. In particular,\nvariational methods have been proposed to ease numerical calculations and\nobtain precise solutions. One such method is the Stochastic Variational Method,\nwhich employs a stochastic search to determine the number and parameters of\ncorrelated Gaussian basis functions used to construct an ansatz of the wave\nfunction. Stochastic methods, however, face numerical and optimization\nchallenges as the number of particles increases.\n  We introduce a family of gradient variational methods that replace stochastic\nsearch with gradient optimization. We comparatively and empirically evaluate\nthe performance of the baseline Stochastic Variational Method, several\ninstances of the gradient variational method family, and some hybrid methods\nfor selected few-body problems. We show that gradient and hybrid methods can be\nmore efficient and effective than the Stochastic Variational Method. We discuss\nthe role of singularities, oscillations, and gradient optimization strategies\nin the performance of the respective methods.\n","subjects":["Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"bFJHwpHw80zEhtEWxxEfWUb8LfGDceaukTD5Lvp6nqY","pdfSize":"958648"}
