{"id":"2408.09044","title":"Explore Cross-Codec Quality-Rate Convex Hulls Relation for Adaptive\n  Streaming","authors":"Masoumeh Farhadi Nia","authorsParsed":[["Nia","Masoumeh Farhadi",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 22:52:00 GMT"}],"updateDate":"2024-08-20","timestamp":1723848720000,"abstract":"  With the ongoing advancement of video technology and the emergence of new\nvideo platforms, suppliers of video contents are striving to ensure that the\nvideo quality meets the desire of consumers. Accessing a limited amount of\nchannel bandwidth, they are often looking for a novel approach to decrease the\nuse of data and thus the required energy and cost. This study evaluates the\nQuality Rate performance of H.264, H.265, and VP9 codecs across resolutions\n(960*544, 1920*1080, 3840*2160) to optimize video quality while minimizing\nbitrate, crucial for energy and cost efficiency. At this approach, original\nvideos at native resolutions were encoded, decoded, and rescaled using FFmpeg.\nFor each resolution, encoding and decoding were performed at various\nquantization levels. Quality Rate (QR) curves were generated using PSNR and\nVMAF metric against bitrate. Convex Hull curves were then derived and\nmathematically modelled for each resolution. The procedure was systematically\napplied to H.264, H.265, and VP9 codecs. Results indicate that increasing CRF\nvalues reduce bitrate, PSNR, and VMAF, with PSNR ranging between 20-40 dB.\nLogarithmic polynomial modelling of convex hulls demonstrated high accuracy,\nwith low RMSE and high R-Squared values. These findings suggest that the convex\nhull of one codec can predict the performance of others, aiding future\ncontent-driven prediction methodologies and enhancing adaptive streaming\nefficiency. Keywords: Video Codecs, Adaptive Streaming, Compression, Bitrate,\nPSNR, VMAF, H.264, H.265, VP9\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}