{"id":"2408.02450","title":"An Evaluation of Requirements Modeling for Cyber-Physical Systems via\n  LLMs","authors":"Dongming Jin, Shengxin Zhao, Zhi Jin, Xiaohong Chen, Chunhui Wang,\n  Zheng Fang, Hongbin Xiao","authorsParsed":[["Jin","Dongming",""],["Zhao","Shengxin",""],["Jin","Zhi",""],["Chen","Xiaohong",""],["Wang","Chunhui",""],["Fang","Zheng",""],["Xiao","Hongbin",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 13:20:14 GMT"}],"updateDate":"2024-08-06","timestamp":1722864014000,"abstract":"  Cyber-physical systems (CPSs) integrate cyber and physical components and\nenable them to interact with each other to meet user needs. The needs for CPSs\nspan rich application domains such as healthcare and medicine, smart home,\nsmart building, etc. This indicates that CPSs are all about solving real-world\nproblems. With the increasing abundance of sensing devices and effectors, the\nproblems wanted to solve with CPSs are becoming more and more complex. It is\nalso becoming increasingly difficult to extract and express CPS requirements\naccurately. Problem frame approach aims to shape real-world problems by\ncapturing the characteristics and interconnections of components, where the\nproblem diagram is central to expressing the requirements. CPSs requirements\nare generally presented in domain-specific documents that are normally\nexpressed in natural language. There is currently no effective way to extract\nproblem diagrams from natural language documents. CPSs requirements extraction\nand modeling are generally done manually, which is time-consuming,\nlabor-intensive, and error-prone. Large language models (LLMs) have shown\nexcellent performance in natural language understanding. It can be interesting\nto explore the abilities of LLMs to understand domain-specific documents and\nidentify modeling elements, which this paper is working on. To achieve this\ngoal, we first formulate two tasks (i.e., entity recognition and interaction\nextraction) and propose a benchmark called CPSBench. Based on this benchmark,\nextensive experiments are conducted to evaluate the abilities and limitations\nof seven advanced LLMs. We find some interesting insights. Finally, we\nestablish a taxonomy of LLMs hallucinations in CPSs requirements modeling using\nproblem diagrams. These results will inspire research on the use of LLMs for\nautomated CPSs requirements modeling.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"x2QychM2xPkUX9NBW2lGcPk-D_q9qWGHVxFFSVplgjs","pdfSize":"898247","txDigest":"2rveK7hsUwcnp48TAjQFoXUCxgqD4bsaivXQN7BG8e6H","endEpoch":"1","status":"CERTIFIED"}
