{"id":"2408.03228","title":"Red Type-1 Quasars after Cosmic Noon and Impact on $L_{\\rm UV}$-related\n  Quasar Statistics","authors":"Yongjung Kim, Dohyeong Kim, Myungshin Im, and Minjin Kim","authorsParsed":[["Kim","Yongjung",""],["Kim","Dohyeong",""],["Im","Myungshin",""],["Kim","Minjin",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 14:41:48 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 03:19:00 GMT"},{"version":"v3","created":"Thu, 8 Aug 2024 06:01:59 GMT"}],"updateDate":"2024-08-09","timestamp":1722955308000,"abstract":"  Over the past decades, nearly a million quasars have been explored to shed\nlight on the evolution of supermassive black holes and galaxies. The\nultraviolet-to-optical spectra of type-1 quasars particularly offer insights\ninto their black hole activities. Recent findings, however, raise questions\nabout the prevalence of red type-1 quasars of which colors might be due to\ndust-obscuration and their potential influence on luminosity-related properties\nof quasars. We examine the fraction of red type-1 quasars within the redshift\nrange of $0.68\\leq z < 2.20$, applying spectral energy distribution (SED)\nfitting using optical-to-MIR photometric data of Sloan Digital Sky Survey Data\nRelease 14 quasars. Approximately 10\\,\\% of the type-1 quasars exhibit red\ncolors suggestive of dust obscuration. There is an association between the\nbrightness of the MIR luminosity and a higher fraction of red type-1 quasars,\nalbeit with negligible redshift evolution. By employing $E(B-V)$ values from\nthe SED fitting, we obtained dereddened luminosity of the red type-1 quasars\nand reassess the quasar luminosity function (QLF) and black hole mass ($M_{\\rm\nBH}$) estimates. Result shows a modest increase in the number density of bright\nquasars, linking to more flatten bright-end slope of QLFs, while $M_{\\rm BH}$\nadjustments are minimal. Current SDSS selections in optical could miss a\nsignificant population of heavily dust-obscured quasars. As future MIR surveys\nlike SPHEREx expand, they may reveal enough obscured quasars to prompt a more\nprofound revision of fundamental quasar properties.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}