{"id":"2408.08101","title":"Stochastic Real-Time Economic Dispatch for Integrated Electric and Gas\n  Systems Considering Uncertainty Propagation and Pipeline Leakage","authors":"eiyao Zhao, Zhengshuo Li, Jiahui Zhang, Xiang Bai, Jia Su","authorsParsed":[["Zhao","eiyao",""],["Li","Zhengshuo",""],["Zhang","Jiahui",""],["Bai","Xiang",""],["Su","Jia",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 11:57:12 GMT"}],"updateDate":"2024-08-16","timestamp":1723723032000,"abstract":"  Gas-fired units (GFUs) with rapid regulation capabilities are considered an\neffective tool to mitigate fluctuations in the generation of renewable energy\nsources and have coupled electricity power systems (EPSs) and natural gas\nsystems (NGSs) more tightly. However, this tight coupling leads to uncertainty\npropagation, a challenge for the real-time dispatch of such integrated electric\nand gas systems (IEGSs). Moreover, pipeline leakage failures in the NGS may\nthreaten the electricity supply reliability of the EPS through GFUs. To address\nthese problems, this paper first establishes an operational model considering\ngas pipeline dynamic characteristics under uncertain leakage failures for the\nNGS and then presents a stochastic IEGS real-time economic dispatch (RTED)\nmodel considering both uncertainty propagation and pipeline leakage\nuncertainty. To quickly solve this complicated large-scale stochastic\noptimization problem, a novel notion of the coupling boundary dynamic\nadjustment region considering pipeline leakage failure (LCBDAR) is proposed to\ncharacterize the dynamic characteristics of the NGS boundary connecting GFUs.\nBased on the LCBDAR, a noniterative decentralized solution is proposed to\ndecompose the original stochastic RTED model into two subproblems that are\nsolved separately by the EPS and NGS operators, thus preserving their data\nprivacy. In particular, only one-time data interaction from the NGS to the EPS\nis required. Case studies on several IEGSs at different scales demonstrate the\neffectiveness of the proposed method.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}