{"id":"2408.00214","title":"Large Language Model (LLM)-enabled In-context Learning for Wireless\n  Network Optimization: A Case Study of Power Control","authors":"Hao Zhou, Chengming Hu, Dun Yuan, Ye Yuan, Di Wu, Xue Liu, and Charlie\n  Zhang","authorsParsed":[["Zhou","Hao",""],["Hu","Chengming",""],["Yuan","Dun",""],["Yuan","Ye",""],["Wu","Di",""],["Liu","Xue",""],["Zhang","Charlie",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 00:53:02 GMT"}],"updateDate":"2024-08-02","timestamp":1722473582000,"abstract":"  Large language model (LLM) has recently been considered a promising technique\nfor many fields. This work explores LLM-based wireless network optimization via\nin-context learning. To showcase the potential of LLM technologies, we consider\nthe base station (BS) power control as a case study, a fundamental but crucial\ntechnique that is widely investigated in wireless networks. Different from\nexisting machine learning (ML) methods, our proposed in-context learning\nalgorithm relies on LLM's inference capabilities. It avoids the complexity of\ntedious model training and hyper-parameter fine-tuning, which is a well-known\nbottleneck of many ML algorithms. Specifically, the proposed algorithm first\ndescribes the target task via formatted natural language, and then designs the\nin-context learning framework and demonstration examples. After that, it\nconsiders two cases, namely discrete-state and continuous-state problems, and\nproposes state-based and ranking-based methods to select appropriate examples\nfor these two cases, respectively. Finally, the simulations demonstrate that\nthe proposed algorithm can achieve comparable performance as conventional deep\nreinforcement learning (DRL) techniques without dedicated model training or\nfine-tuning. Such an efficient and low-complexity approach has great potential\nfor future wireless network optimization.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}