{"id":"2408.04113","title":"UpLIF: An Updatable Self-Tuning Learned Index Framework","authors":"Alireza Heidari, Amirhossein Ahmadi, Wei Zhang","authorsParsed":[["Heidari","Alireza",""],["Ahmadi","Amirhossein",""],["Zhang","Wei",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 22:30:43 GMT"}],"updateDate":"2024-08-09","timestamp":1723069843000,"abstract":"  The emergence of learned indexes has caused a paradigm shift in our\nperception of indexing by considering indexes as predictive models that\nestimate keys' positions within a data set, resulting in notable improvements\nin key search efficiency and index size reduction; however, a significant\nchallenge inherent in learned index modeling is its constrained support for\nupdate operations, necessitated by the requirement for a fixed distribution of\nrecords. Previous studies have proposed various approaches to address this\nissue with the drawback of high overhead due to multiple model retraining. In\nthis paper, we present UpLIF, an adaptive self-tuning learned index that\nadjusts the model to accommodate incoming updates, predicts the distribution of\nupdates for performance improvement, and optimizes its index structure using\nreinforcement learning. We also introduce the concept of balanced model\nadjustment, which determines the model's inherent properties (i.e. bias and\nvariance), enabling the integration of these factors into the existing index\nmodel without the need for retraining with new data. Our comprehensive\nexperiments show that the system surpasses state-of-the-art indexing solutions\n(both traditional and ML-based), achieving an increase in throughput of up to\n3.12 times with 1000 times less memory usage.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Machine Learning","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Ovp-E6eAOTfbchpl9QkWkxBjxHiCagEcOf7K4PjLVws","pdfSize":"2685843"}
