{"id":"2408.09033","title":"Error Bounds For Gaussian Process Regression Under Bounded Support Noise\n  With Applications To Safety Certification","authors":"Robert Reed, Luca Laurenti, Morteza Lahijanian","authorsParsed":[["Reed","Robert",""],["Laurenti","Luca",""],["Lahijanian","Morteza",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 22:03:32 GMT"}],"updateDate":"2024-08-20","timestamp":1723845812000,"abstract":"  Gaussian Process Regression (GPR) is a powerful and elegant method for\nlearning complex functions from noisy data with a wide range of applications,\nincluding in safety-critical domains. Such applications have two key features:\n(i) they require rigorous error quantification, and (ii) the noise is often\nbounded and non-Gaussian due to, e.g., physical constraints. While error bounds\nfor applying GPR in the presence of non-Gaussian noise exist, they tend to be\noverly restrictive and conservative in practice. In this paper, we provide\nnovel error bounds for GPR under bounded support noise. Specifically, by\nrelying on concentration inequalities and assuming that the latent function has\nlow complexity in the reproducing kernel Hilbert space (RKHS) corresponding to\nthe GP kernel, we derive both probabilistic and deterministic bounds on the\nerror of the GPR. We show that these errors are substantially tighter than\nexisting state-of-the-art bounds and are particularly well-suited for GPR with\nneural network kernels, i.e., Deep Kernel Learning (DKL). Furthermore,\nmotivated by applications in safety-critical domains, we illustrate how these\nbounds can be combined with stochastic barrier functions to successfully\nquantify the safety probability of an unknown dynamical system from finite\ndata. We validate the efficacy of our approach through several benchmarks and\ncomparisons against existing bounds. The results show that our bounds are\nconsistently smaller, and that DKLs can produce error bounds tighter than\nsample noise, significantly improving the safety probability of control\nsystems.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bj8OV1PuVHOChic-0HRwZyFAoQASEnsfcPbP993oebA","pdfSize":"720118"}
