{"id":"2408.02511","title":"Superconductivity of Co-Doped CaKFe4As4 Investigated via Point-Contact\n  Spectroscopy and London Penetration Depth Measurements","authors":"Erik Piatti, Daniele Torsello, Francesca Breccia, Tsuyoshi Tamegai,\n  Gianluca Ghigo and Dario Daghero","authorsParsed":[["Piatti","Erik",""],["Torsello","Daniele",""],["Breccia","Francesca",""],["Tamegai","Tsuyoshi",""],["Ghigo","Gianluca",""],["Daghero","Dario",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 14:33:56 GMT"}],"updateDate":"2024-08-06","timestamp":1722868436000,"abstract":"  The iron-based superconductors (IBSs) of the recently discovered 1144 class,\nunlike many other IBSs, display superconductivity in their stoichiometric form\nand are intrinsically hole doped. The effects of chemical substitutions with\nelectron donors are thus particularly interesting to investigate. Here, we\nstudy the effect of Co substitution in the Fe site of CaKFe$_4$As$_4$ single\ncrystals on the critical temperature, on the energy gaps, and on the superfluid\ndensity by using transport, point-contact Andreev-reflection spectroscopy\n(PCARS), and London penetration depth measurements. The pristine compound\n(T$_\\mathrm{c}\\simeq$ 36 K) shows two isotropic gaps whose amplitudes\n($\\Delta_1$ = 1.4$-$3.9 meV and $\\Delta_2$ = 5.2$-$8.5 meV) are perfectly\ncompatible with those reported in the literature. Upon Co doping (up to\n$\\approx$7% Co), T$_\\mathrm{c}$ decreases down to $\\simeq$ 20 K, the\nspin-vortex-crystal order appears, and the low-temperature superfluid density\nis gradually suppressed. PCARS and London penetration depth measurements\nperfectly agree in demonstrating that the nodeless multigap structure is robust\nupon Co doping, while the gap amplitudes decrease as a function of\nT$_\\mathrm{c}$ in a linear way with almost constant values of the gap ratios\n2$\\Delta_i$/k$_\\mathrm{B}$T$_\\mathrm{c}$.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}