{"id":"2408.00191","title":"S-SYNTH: Knowledge-Based, Synthetic Generation of Skin Images","authors":"Andrea Kim, Niloufar Saharkhiz, Elena Sizikova, Miguel Lago, Berkman\n  Sahiner, Jana Delfino, Aldo Badano","authorsParsed":[["Kim","Andrea",""],["Saharkhiz","Niloufar",""],["Sizikova","Elena",""],["Lago","Miguel",""],["Sahiner","Berkman",""],["Delfino","Jana",""],["Badano","Aldo",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 23:16:29 GMT"}],"updateDate":"2024-08-02","timestamp":1722467789000,"abstract":"  Development of artificial intelligence (AI) techniques in medical imaging\nrequires access to large-scale and diverse datasets for training and\nevaluation. In dermatology, obtaining such datasets remains challenging due to\nsignificant variations in patient populations, illumination conditions, and\nacquisition system characteristics. In this work, we propose S-SYNTH, the first\nknowledge-based, adaptable open-source skin simulation framework to rapidly\ngenerate synthetic skin, 3D models and digitally rendered images, using an\nanatomically inspired multi-layer, multi-component skin and growing lesion\nmodel. The skin model allows for controlled variation in skin appearance, such\nas skin color, presence of hair, lesion shape, and blood fraction among other\nparameters. We use this framework to study the effect of possible variations on\nthe development and evaluation of AI models for skin lesion segmentation, and\nshow that results obtained using synthetic data follow similar comparative\ntrends as real dermatologic images, while mitigating biases and limitations\nfrom existing datasets including small dataset size, lack of diversity, and\nunderrepresentation.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"hvim0WOKtH0RzLPbzlrMS9R4rTVA8znA2ypVvBAd_UI","pdfSize":"13373338","txDigest":"FwSdDo1QNPQCLXqh7YXSg3HRU1i9uSoD7fkuJPPWiwoX","endEpoch":"1","status":"CERTIFIED"}
