{"id":"2408.12190","title":"A Safety-Oriented Self-Learning Algorithm for Autonomous Driving:\n  Evolution Starting from a Basic Model","authors":"Shuo Yang, Caojun Wang, Zhenyu Ma, Yanjun Huang, Hong Chen","authorsParsed":[["Yang","Shuo",""],["Wang","Caojun",""],["Ma","Zhenyu",""],["Huang","Yanjun",""],["Chen","Hong",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 08:11:37 GMT"}],"updateDate":"2024-08-23","timestamp":1724314297000,"abstract":"  Autonomous driving vehicles with self-learning capabilities are expected to\nevolve in complex environments to improve their ability to cope with different\nscenarios. However, most self-learning algorithms suffer from low learning\nefficiency and lacking safety, which limits their applications. This paper\nproposes a safety-oriented self-learning algorithm for autonomous driving,\nwhich focuses on how to achieve evolution from a basic model. Specifically, a\nbasic model based on the transformer encoder is designed to extract and output\npolicy features from a small number of demonstration trajectories. To improve\nthe learning efficiency, a policy mixed approach is developed. The basic model\nprovides initial values to improve exploration efficiency, and the\nself-learning algorithm enhances the adaptability and generalization of the\nmodel, enabling continuous improvement without external intervention. Finally,\nan actor approximator based on receding horizon optimization is designed\nconsidering the constraints of the environmental input to ensure safety. The\nproposed method is verified in a challenging mixed traffic environment with\npedestrians and vehicles. Simulation and real-vehicle test results show that\nthe proposed method can safely and efficiently learn appropriate autonomous\ndriving behaviors. Compared reinforcement learning and behavior cloning\nmethods, it can achieve comprehensive improvement in learning efficiency and\nperformance under the premise of ensuring safety.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}