{"id":"2408.00481","title":"HBot: A Chatbot for Healthcare Applications in Traditional Chinese\n  Medicine Based on Human Body 3D Visualization","authors":"Bolin Zhang, Zhiwei Yi, Jiahao Wang, Dianbo Sui, Zhiying Tu, Dianhui\n  Chu","authorsParsed":[["Zhang","Bolin",""],["Yi","Zhiwei",""],["Wang","Jiahao",""],["Sui","Dianbo",""],["Tu","Zhiying",""],["Chu","Dianhui",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 11:36:18 GMT"}],"updateDate":"2024-08-02","timestamp":1722512178000,"abstract":"  The unique diagnosis and treatment techniques and remarkable clinical\nefficacy of traditional Chinese medicine (TCM) make it play an important role\nin the field of elderly care and healthcare, especially in the rehabilitation\nof some common chronic diseases of the elderly. Therefore, building a TCM\nchatbot for healthcare application will help users obtain consultation services\nin a direct and natural way. However, concepts such as acupuncture points\n(acupoints) and meridians involved in TCM always appear in the consultation,\nwhich cannot be displayed intuitively. To this end, we develop a\n\\textbf{h}ealthcare chat\\textbf{bot} (HBot) based on a human body model in 3D\nand knowledge graph, which provides conversational services such as knowledge\nQ\\&A, prescription recommendation, moxibustion therapy recommendation, and\nacupoint search. When specific acupoints are involved in the conversations\nbetween user and HBot, the 3D body will jump to the corresponding acupoints and\nhighlight them. Moreover, Hbot can also be used in training scenarios to\naccelerate the teaching process of TCM by intuitively displaying acupuncture\npoints and knowledge cards. The demonstration video is available at\nhttps://www.youtube.com/watch?v=UhQhutSKkTU . Our code and dataset are publicly\navailable at Gitee: https://gitee.com/plabrolin/interactive-3d-acup.git\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"G28aW0px_2KPerJBovfrgk3QpcyI9qs8JDiwLexv6Qo","pdfSize":"1149151","txDigest":"GXS2CimtUCatBNV1JTDrkBWj4Bj5JySCsoQK54gLyQ2U","endEpoch":"1","status":"CERTIFIED"}
