{"id":"2408.13041","title":"A Comparison of Deep Learning and Established Methods for Calf Behaviour\n  Monitoring","authors":"Oshana Dissanayake, Lucile Riaboff, Sarah E. McPherson, Emer Kennedy,\n  P\\'adraig Cunningham","authorsParsed":[["Dissanayake","Oshana",""],["Riaboff","Lucile",""],["McPherson","Sarah E.",""],["Kennedy","Emer",""],["Cunningham","Pádraig",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 13:02:24 GMT"}],"updateDate":"2024-08-26","timestamp":1724418144000,"abstract":"  In recent years, there has been considerable progress in research on human\nactivity recognition using data from wearable sensors. This technology also has\npotential in the context of animal welfare in livestock science. In this paper,\nwe report on research on animal activity recognition in support of welfare\nmonitoring. The data comes from collar-mounted accelerometer sensors worn by\nHolstein and Jersey calves, the objective being to detect changes in behaviour\nindicating sickness or stress. A key requirement in detecting changes in\nbehaviour is to be able to classify activities into classes, such as drinking,\nrunning or walking. In Machine Learning terms, this is a time-series\nclassification task, and in recent years, the Rocket family of methods have\nemerged as the state-of-the-art in this area. We have over 27 hours of labelled\ntime-series data from 30 calves for our analysis. Using this data as a\nbaseline, we present Rocket's performance on a 6-class classification task.\nThen, we compare this against the performance of 11 Deep Learning (DL) methods\nthat have been proposed as promising methods for time-series classification.\nGiven the success of DL in related areas, it is reasonable to expect that these\nmethods will perform well here as well. Surprisingly, despite taking care to\nensure that the DL methods are configured correctly, none of them match\nRocket's performance. A possible explanation for the impressive success of\nRocket is that it has the data encoding benefits of DL models in a much simpler\nclassification framework.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}