{"id":"2408.05187","title":"All optical excitation of spin polarization in d-wave altermagnets","authors":"Marius Weber, Stephan Wust, Luca Haag, Akashdeep Akashdeep, Kai\n  Leckron, Christin Schmitt, Rafael Ramos, Takashi Kikkawa, Eiji Saitoh,\n  Mathias Kl\\\"aui, Libor \\v{S}mejkal, Jairo Sinova, Martin Aeschlimann, Gerhard\n  Jakob, Benjamin Stadtm\\\"uller, Hans Christian Schneider","authorsParsed":[["Weber","Marius",""],["Wust","Stephan",""],["Haag","Luca",""],["Akashdeep","Akashdeep",""],["Leckron","Kai",""],["Schmitt","Christin",""],["Ramos","Rafael",""],["Kikkawa","Takashi",""],["Saitoh","Eiji",""],["Kläui","Mathias",""],["Šmejkal","Libor",""],["Sinova","Jairo",""],["Aeschlimann","Martin",""],["Jakob","Gerhard",""],["Stadtmüller","Benjamin",""],["Schneider","Hans Christian",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 17:19:54 GMT"}],"updateDate":"2024-08-12","timestamp":1723223994000,"abstract":"  The recently discovered altermagnets exhibit collinear magnetic order with\nzero net magnetization but with unconventional spin-polarized d/g/i-wave band\nstructures, expanding the known paradigms of ferromagnets and antiferromagnets.\nIn addition to novel current-driven electronic transport effects, the\nunconventional time-reversal symmetry breaking in these systems also makes it\npossible to obtain a spin response to linearly polarized fields in the optical\nfrequency domain. We show through ab-initio calculations of the prototypical\nd-wave altermagnet RuO$_2$, with $[C_2\\|C_{4z}]$ symmetry combining twofold\nspin rotation with fourfold lattice rotation, that there is an optical analogue\nof a spin splitter effect, as the coupling to a linearly polarized exciting\nlaser field makes the d-wave character of the altermagnet directly visible. By\nmagneto-optical measurements on RuO$_2$ films of a few nanometer thickness, we\ndemonstrate the predicted connection between the polarization of an ultrashort\npump pulse and the sign and magnitude of a persistent optically excited\nelectronic spin polarization. Our results point to the possibility of exciting\nand controlling the electronic spin polarization in altermagnets by such\nultrashort optical pulses. In addition, the possibility of exciting an\nelectronic spin polarization by linearly polarized optical fields in a\ncompensated system is a unique consequence of the altermagnetic material\nproperties, and our experimental results therefore present an indication for\nthe existence of an altermagnetic phase in ultrathin RuO$_2$ films.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}