{"id":"2408.13549","title":"A Superdirective Beamforming Approach based on MultiTransUNet-GAN","authors":"Yali Zhang, Haifan Yin and Liangcheng Han","authorsParsed":[["Zhang","Yali",""],["Yin","Haifan",""],["Han","Liangcheng",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 11:19:57 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 04:54:59 GMT"}],"updateDate":"2024-08-28","timestamp":1724498397000,"abstract":"  In traditional multiple-input multiple-output (MIMO) communication systems,\nthe antenna spacing is often no smaller than half a wavelength. However, by\nexploiting the coupling between more closely-spaced antennas, a superdirective\narray may achieve a much higher beamforming gain than traditional MIMO. In this\npaper, we present a novel utilization of neural networks in the context of\nsuperdirective arrays. Specifically, a new model called MultiTransUNet-GAN is\nproposed, which aims to forecast the excitation coefficients to achieve\n``superdirectivity\" or ``super-gain\" in the compact uniform linear or planar\nantenna arrays. In this model, we integrate a multi-level guided attention and\na multi-scale skip connection. Furthermore, generative adversarial networks are\nintegrated into our model. To improve the prediction accuracy and convergence\nspeed of our model, we introduce the warm up aided cosine learning rate (LR)\nschedule during the model training, and the objective function is improved by\nincorporating the normalized mean squared error (NMSE) between the generated\nvalue and the actual value. Simulations demonstrate that the array directivity\nand array gain achieved by our model exhibit a strong agreement with the\ntheoretical values. Overall, it shows the advantage of enhanced precision over\nthe existing models, and a reduced requirement for measurement and the\ncomputation of the excitation coefficients.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}