{"id":"2408.16258","title":"Advancing Architectural Floorplan Design with Geometry-enhanced Graph\n  Diffusion","authors":"Sizhe Hu, Wenming Wu, Yuntao Wang, Benzhu Xu, Liping Zheng","authorsParsed":[["Hu","Sizhe",""],["Wu","Wenming",""],["Wang","Yuntao",""],["Xu","Benzhu",""],["Zheng","Liping",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 04:40:31 GMT"}],"updateDate":"2024-08-30","timestamp":1724906431000,"abstract":"  Automating architectural floorplan design is vital for housing and interior\ndesign, offering a faster, cost-effective alternative to manual sketches by\narchitects. However, existing methods, including rule-based and learning-based\napproaches, face challenges in design complexity and constrained generation\nwith extensive post-processing, and tend to obvious geometric inconsistencies\nsuch as misalignment, overlap, and gaps. In this work, we propose a novel\ngenerative framework for vector floorplan design via structural graph\ngeneration, called GSDiff, focusing on wall junction generation and wall\nsegment prediction to capture both geometric and semantic aspects of structural\ngraphs. To improve the geometric rationality of generated structural graphs, we\npropose two innovative geometry enhancement methods. In wall junction\ngeneration, we propose a novel alignment loss function to improve geometric\nconsistency. In wall segment prediction, we propose a random self-supervision\nmethod to enhance the model's perception of the overall geometric structure,\nthereby promoting the generation of reasonable geometric structures. Employing\nthe diffusion model and the Transformer model, as well as the geometry\nenhancement strategies, our framework can generate wall junctions, wall\nsegments and room polygons with structural and semantic information, resulting\nin structural graphs that accurately represent floorplans. Extensive\nexperiments show that the proposed method surpasses existing techniques,\nenabling free generation and constrained generation, marking a shift towards\nstructure generation in architectural design.\n","subjects":["Computing Research Repository/Graphics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}