{"id":"2408.06701","title":"DiffSG: A Generative Solver for Network Optimization with Diffusion\n  Model","authors":"Ruihuai Liang, Bo Yang, Zhiwen Yu, Bin Guo, Xuelin Cao, M\\'erouane\n  Debbah, H. Vincent Poor, and Chau Yuen","authorsParsed":[["Liang","Ruihuai",""],["Yang","Bo",""],["Yu","Zhiwen",""],["Guo","Bin",""],["Cao","Xuelin",""],["Debbah","Mérouane",""],["Poor","H. Vincent",""],["Yuen","Chau",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 07:56:21 GMT"}],"updateDate":"2024-08-14","timestamp":1723535781000,"abstract":"  Diffusion generative models, famous for their performance in image\ngeneration, are popular in various cross-domain applications. However, their\nuse in the communication community has been mostly limited to auxiliary tasks\nlike data modeling and feature extraction. These models hold greater promise\nfor fundamental problems in network optimization compared to traditional\nmachine learning methods. Discriminative deep learning often falls short due to\nits single-step input-output mapping and lack of global awareness of the\nsolution space, especially given the complexity of network optimization's\nobjective functions. In contrast, diffusion generative models can consider a\nbroader range of solutions and exhibit stronger generalization by learning\nparameters that describe the distribution of the underlying solution space,\nwith higher probabilities assigned to better solutions. We propose a new\nframework Diffusion Model-based Solution Generation (DiffSG), which leverages\nthe intrinsic distribution learning capabilities of diffusion generative models\nto learn high-quality solution distributions based on given inputs. The optimal\nsolution within this distribution is highly probable, allowing it to be\neffectively reached through repeated sampling. We validate the performance of\nDiffSG on several typical network optimization problems, including\nmixed-integer non-linear programming, convex optimization, and hierarchical\nnon-convex optimization. Our results show that DiffSG outperforms existing\nbaselines. In summary, we demonstrate the potential of diffusion generative\nmodels in tackling complex network optimization problems and outline a\npromising path for their broader application in the communication community.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}