{"id":"2408.01960","title":"AnomalySD: Few-Shot Multi-Class Anomaly Detection with Stable Diffusion\n  Model","authors":"Zhenyu Yan, Qingqing Fang, Wenxi Lv, Qinliang Su","authorsParsed":[["Yan","Zhenyu",""],["Fang","Qingqing",""],["Lv","Wenxi",""],["Su","Qinliang",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 08:33:44 GMT"}],"updateDate":"2024-08-06","timestamp":1722760424000,"abstract":"  Anomaly detection is a critical task in industrial manufacturing, aiming to\nidentify defective parts of products. Most industrial anomaly detection methods\nassume the availability of sufficient normal data for training. This assumption\nmay not hold true due to the cost of labeling or data privacy policies.\nAdditionally, mainstream methods require training bespoke models for different\nobjects, which incurs heavy costs and lacks flexibility in practice. To address\nthese issues, we seek help from Stable Diffusion (SD) model due to its\ncapability of zero/few-shot inpainting, which can be leveraged to inpaint\nanomalous regions as normal. In this paper, a few-shot multi-class anomaly\ndetection framework that adopts Stable Diffusion model is proposed, named\nAnomalySD. To adapt SD to anomaly detection task, we design different\nhierarchical text descriptions and the foreground mask mechanism for\nfine-tuning SD. In the inference stage, to accurately mask anomalous regions\nfor inpainting, we propose multi-scale mask strategy and prototype-guided mask\nstrategy to handle diverse anomalous regions. Hierarchical text prompts are\nalso utilized to guide the process of inpainting in the inference stage. The\nanomaly score is estimated based on inpainting result of all masks. Extensive\nexperiments on the MVTec-AD and VisA datasets demonstrate the superiority of\nour approach. We achieved anomaly classification and segmentation results of\n93.6%/94.8% AUROC on the MVTec-AD dataset and 86.1%/96.5% AUROC on the VisA\ndataset under multi-class and one-shot settings.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DJQrHSCNijZbnZkh-7gcCc1rT57_KC3fwgXRvt9woxM","pdfSize":"3224441","txDigest":"D5PkxvxEbxqowFGWCzpqrK1VYXDaoQS56xV3XVbLhSoe","endEpoch":"1","status":"CERTIFIED"}
