{"id":"2408.03549","title":"Enhanced hydrogen evolution reaction activity of nitrogen deficient\n  $hg-C_{3}N_{4}$ quantum dot","authors":"Khushboo Dange, Vaishali Roondhe and Alok Shukla","authorsParsed":[["Dange","Khushboo",""],["Roondhe","Vaishali",""],["Shukla","Alok",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 05:03:21 GMT"}],"updateDate":"2024-08-08","timestamp":1723007001000,"abstract":"  The present study investigates the catalytic performance of a $hg-C_{3}N_{4}$\nquantum dot aimed at enhancing electrochemical water splitting, using the\nfirst-principles density functional theory. The size of the considered quantum\ndot lies within the range reported experimentally (2nm - 4nm) [Zhou et al. ACS\nNano 9, 12480 (2015)]. The nitrogen vacancies are created in the considered\n$hg-C_{3}N_{4}$ structure to simulate the realistic scenario, as the presence\nof nitrogen and carbon defects are reported in the synthesized $hg-C_{3}N_{4}$\nquantum dots. First, the structural and vibrational properties are computed to\nensure the stability of the nitrogen deficient $hg-C_{3}N_{4}$ quantum dots,\nand subsequently, their electronic and hydrogen evolution reaction (HER)\nproperties are investigated. The calculate HER parameters, i.e., adsorption\nenergies, Gibbs free energies, and overpotentials demonstrate that the\nconsidered $hg-C_{3}N_{4}$ quantum dot with nitrogen vacancies can be used as a\nmoderately effective electrocatalyst for HER performance. We also considered\nthe quantum dot to be dissolved in water and ethanol, and find that the\noverpotential gets drastically reduced to 16 mV for the alcohol dissolved\nquantum dot, while some significant reduction is seen for the aqueous solution\nalso. As a result, this study suggests that the nitrogen-deficient\n$hg-C_{3}N_{4}$ quantum dots dissolved in ethanol are excellent candidates for\ncatalysis aimed at sustainable hydrogen production via electrochemical water\nsplitting.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}