{"id":"2408.16550","title":"Two Dimensional Magnetic Current Imaging Via L1-Curl Regularized\n  Divergence Free Wavelet Reconstruction","authors":"Christopher Miller, Adrian Mariano, Sean Oliver, Jacob Lenz, Dmitro\n  Martynowych","authorsParsed":[["Miller","Christopher",""],["Mariano","Adrian",""],["Oliver","Sean",""],["Lenz","Jacob",""],["Martynowych","Dmitro",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 14:13:31 GMT"}],"updateDate":"2024-08-30","timestamp":1724940811000,"abstract":"  The reconstruction of current distributions from samples of their induced\nmagnetic field is a challenging problem due to multiple factors. First, the\nproblem of reconstructing general three dimensional current distributions is\nill-posed. Second, the current-to-field operator performs a low-pass filter\nthat dampens high-spatial frequency information, so that even in situations\nwhere the inversion is formally possible, attempting to employ the formal\ninverse will result in solutions with unacceptable noise. Most contemporary\nmethods for reconstructing current distributions in two dimensions are based on\nFourier techniques and apply a low pass filter to the $B$-field data, which\nprevents excessive noise amplification during reconstruction at the cost of\nadmitting blurring in the reconstructed solution. In this report, we present a\nmethod of current recovery based on penalizing the $L1$ norm of the curl of the\ncurrent distribution. The utility of this method is based on the observation\nthat in microelectronics settings, the conductivity is piecewise constant. We\nalso reconstruct the current fields using a divergence-free wavelet basis. This\nhas the advantage of automatically enforcing current continuity and halving the\nnumber of unknowns that must be solved for. Additionally, the curl operator can\nbe computed exactly and analytically in this wavelet expansion, which\nsimplifies the application of the $L1-\\textrm{curl}$ regularizer. We\ndemonstrate improved reconstruction quality relative to Fourier-based\ntechniques on both simulated and laboratory-acquired magnetic field data.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}