{"id":"2408.11835","title":"AdS4/CFT3 : ABJM Theory, Brane Geometry, Correlators and Mellin Space","authors":"Manikantt Mummalaneni","authorsParsed":[["Mummalaneni","Manikantt",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 22:02:58 GMT"}],"updateDate":"2024-08-23","timestamp":1722981778000,"abstract":"  This thesis delves into the $AdS_4/CFT_3$ correspondence (M-theory on $AdS_4\n\\times S^7 / \\mathbb{Z}_k$ $\\leftrightarrow$ ABJM theory) in a comprehensive\nand detailed manner. The ABJM theory i.e. $\\mathcal{N} = 6$ $U(N)_k \\times\nU(N)_{-k}$ Chern-Simons matter theory, is presented in $\\mathcal{N} = 2$\nsuperspace, with explicit demonstration of R-symmetry invariance. The\nassociated brane configuration in type IIB string theory is examined, and the\nlow-energy effective field content is shown to align with that of the ABJM\ntheory, by considering string modes and boundary conditions in a new intuitive\nperspective on brane intersection boundaries and staged compactification. The\nconsequent lift to M-theory, along with the resulting geometry and its Killing\nspinors in 11D supergravity, is thoroughly analyzed. The $AdS_4/CFT_3$\nstatement is then articulated, and its implications are explored, with a focus\non the computational machinery of Witten diagrams, first in position space and\nsubsequently in the more convenient Mellin space. The thesis culminates with\nthe computation of the four-point function of the stress-tensor multiplet\nsuperconformal primary, incorporating contributions from additional short\nmultiplets involving Spin-3 and Spin-4 exchanges not previously considered in\nthe literature. These computations hold significant practical implications for\nthe M-theory S-matrix. As an overall remark, the streamlined nature of this\ncomprehensive work also aims to inspire fresh insights from $AdS_4/CFT_3$, a\nduality that probes the non-perturbative aspects of M-theory; a theory that, if\nit exists, is a promising candidate for the theory of everything, yet remains\nshrouded in Mystery with much still unknown.\n","subjects":["Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}