{"id":"2408.01729","title":"A Survey on Robotic Prosthetics: Neuroprosthetics, Soft Actuators, and\n  Control Strategies","authors":"Kumar J. Jyothish, Subhankar Mishra","authorsParsed":[["Jyothish","Kumar J.",""],["Mishra","Subhankar",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 10:01:44 GMT"}],"updateDate":"2024-08-06","timestamp":1722679304000,"abstract":"  The field of robotics is a quickly evolving feat of technology that accepts\ncontributions from various genres of science. Neuroscience, Physiology,\nChemistry, Material science, Computer science, and the wide umbrella of\nmechatronics have all simultaneously contributed to many innovations in the\nprosthetic applications of robotics. This review begins with a discussion of\nthe scope of the term robotic prosthetics and discusses the evolving domain of\nNeuroprosthetics. The discussion is then constrained to focus on various\nactuation and control strategies for robotic prosthetic limbs. This review\ndiscusses various soft robotic actuators such as EAP, SMA, FFA, etc., and the\nmerits of such actuators over conventional hard robotic actuators. Options in\ncontrol strategies for robotic prosthetics, that are in various states of\nresearch and development, are reviewed. This paper concludes the discussion\nwith an analysis regarding the prospective direction in which this field of\nrobotic prosthetics is evolving in terms of actuation, control, and other\nfeatures relevant to artificial limbs. This paper intends to review some of the\nemerging research and development trends in the field of robotic prosthetics\nand summarize many tangents that are represented under this broad domain in an\napproachable manner.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rHOtco56LqLV5RYAQIMmcQBuB1mkF6sT7Kw17OdS3y8","pdfSize":"4598177"}
