{"id":"2408.06183","title":"Centralized and Federated Heart Disease Classification Models Using UCI\n  Dataset and their Shapley-value Based Interpretability","authors":"Mario Padilla Rodriguez, Mohamed Nafea","authorsParsed":[["Rodriguez","Mario Padilla",""],["Nafea","Mohamed",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 14:29:54 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 14:59:52 GMT"}],"updateDate":"2024-08-19","timestamp":1723472994000,"abstract":"  Cardiovascular diseases are a leading cause of mortality worldwide,\nhighlighting the need for accurate diagnostic methods. This study benchmarks\ncentralized and federated machine learning algorithms for heart disease\nclassification using the UCI dataset which includes 920 patient records from\nfour hospitals in the USA, Hungary and Switzerland. Our benchmark is supported\nby Shapley-value interpretability analysis to quantify features' importance for\nclassification. In the centralized setup, various binary classification\nalgorithms are trained on pooled data, with a support vector machine (SVM)\nachieving the highest testing accuracy of 83.3\\%, surpassing the established\nbenchmark of 78.7\\% with logistic regression. Additionally, federated learning\nalgorithms with four clients (hospitals) are explored, leveraging the dataset's\nnatural partition to enhance privacy without sacrificing accuracy. Federated\nSVM, an uncommon approach in the literature, achieves a top testing accuracy of\n73.8\\%. Our interpretability analysis aligns with existing medical knowledge of\nheart disease indicators. Overall, this study establishes a benchmark for\nefficient and interpretable pre-screening tools for heart disease while\nmaintaining patients' privacy. This work is available at\nhttps://github.com/padillma1/Heart-Disease-Classification-on-UCI-dataset-and-Shapley-Interpretability-Analysis.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}