{"id":"2408.04924","title":"A Comprehensive System Architecture using Field Programmable Gate Arrays\n  Technology, Dijkstra's Algorithm, and Edge Computing for Emergency Response\n  in Smart Cities","authors":"Mahamat Abdel Aziz Assoul, Abakar Mahamat Tahir, Taibi Mahmoud, Garrik\n  Brel Jagho Mdemaya, Milliam Maxime Zekeng Ndadji","authorsParsed":[["Assoul","Mahamat Abdel Aziz",""],["Tahir","Abakar Mahamat",""],["Mahmoud","Taibi",""],["Mdemaya","Garrik Brel Jagho",""],["Ndadji","Milliam Maxime Zekeng",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 08:09:33 GMT"}],"updateDate":"2024-08-12","timestamp":1723190973000,"abstract":"  Efficient emergency response systems are crucial for smart cities. But their\nimplementation is highly challenging, particularly in regions like Chad where\ninfrastructural constraints are prevalent. The urgency for optimized response\ntimes and resource allocation in emergency scenarios is magnified in these\ncontexts, yet existing solutions often assume robust infrastructure and\nuninterrupted connectivity, which is not always available. Most of the time,\nthey are based on system architectures pre-designed for other purposes. This\npaper addresses these critical challenges by proposing a comprehensive system\narchitecture that integrates Field Programmable Gate Arrays (FPGAs), Dijkstra's\nalgorithm, and Edge Computing. The objective is to enhance emergency response\nthrough accelerated route planning and resource allocation, addressing gaps\nleft by traditional cloud-based systems. Methodologically, key characteristics\nof the desired system are identified, then its components are described and\ntheir integration is explained; the system leverages FPGA-based computations\nand a distributed implementation of Dijkstra's algorithm to compute the\nshortest paths rapidly, while Edge Computing ensures decentralized and\nresilient processing. A theoretical analysis highlights promising improvements\nin response times and resource management. The proposed system architecture not\nonly enhances emergency response efficiency but is also adaptable to\ninfrastructural constraints of Chadian-like environments.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Hardware Architecture","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}