{"id":"2408.07638","title":"Force Fields for Deep Eutectic Mixtures: Application to Structure and\n  2D-Infrared Spectroscopy","authors":"Kai T\\\"opfer, Eric Boittier, Michael Devereux, Andrea Pasti, Peter\n  Hamm and Markus Meuwly","authorsParsed":[["Töpfer","Kai",""],["Boittier","Eric",""],["Devereux","Michael",""],["Pasti","Andrea",""],["Hamm","Peter",""],["Meuwly","Markus",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 16:06:23 GMT"}],"updateDate":"2024-08-15","timestamp":1723651583000,"abstract":"  Parametrizing energy functions for ionic systems can be challenging. Here,\nthe total energy function for an eutectic system consisting of water, SCN$^-$,\nK$^+$ and acetamide is improved vis-a-vis experimentally measured properties.\nGiven the importance of electrostatic interactions, two different types of\nmodels are considered: the first (model M0) uses atom-centered multipole\nwhereas the other two (models M1 and M2) are based on fluctuating minimal\ndistributed charges (fMDCM) that respond to geometrical changes of SCN$^-$. The\nLennard-Jones parameters of the anion are adjusted to best reproduce\nexperimentally known hydration free energies and densities which are matched to\nwithin a few percent for the final models irrespective of the electrostatic\nmodel. Molecular dynamics simulations of the eutectic mixtures with varying\nwater content (between 0% and 100%) yield radial distribution functions and\nfrequency correlation functions for the CN-stretch vibration. Comparison with\nexperiments indicate that models based on fMDCM are considerably more\nconsistent that those using multipoles. Computed viscosities from models M1 and\nM2 are within 30% of measured values and their change with increasing water\ncontent is consistent with experiments. This is not the case for model M0.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"pO2pJ6qrrXCrFtu8QnSOCuNYPOjzKPnVE7NMcl0_UHA","pdfSize":"3394663"}
