{"id":"2408.07655","title":"Development of simulation model for Single Carrier Transceiver for\n  Nanosatellite","authors":"Pallewela R.C.K, Rohana Thilakuamra, Prabath Buddhika","authorsParsed":[["K","Pallewela R. C.",""],["Thilakuamra","Rohana",""],["Buddhika","Prabath",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 16:29:57 GMT"}],"updateDate":"2024-08-31","timestamp":1723652997000,"abstract":"  CubeSat is a nanosatellite concept emerged from a paper published by Stanford\nUniversity and with their low cost nature and extreme feasibility , more\nstarted researching on nano satellites. New technology emerged , paving path to\nmany academics and small vendors to create their own CubeSat models .\n  This nanosatellite requires a transceiver to maintain its communication\nbetween it's systems and the ground station, which helps it navigate and\ncollects data gained from its programmed functions. This transceiver system\nconsists mainly of a transmitter and a receiver. The transmitter manages\nsending data from the satellite to ground station while the receiver captures\nthe data and instruction sent from the ground station to the satellite. These\nsystems were built using separate digital communication devices in the\nbeginning, with many critical limitations with respect to the space and\nscalability of the modules to be attached and the programmability of hardware\nmaterials and the concept of system-on -board emerged. Meanwhile, As the size\nof electronic devices minimized with the research conducted, FPGA (Filed\nProgrammable Logic Array) was introduced as an architecture to be used in\nvarious applications and research needs. The reason FPGA was mention was for\nthe fact that it provides flexibility in the designing of transceiver ed with\ndesign and prototypes implementation at a low cost competitional electronic\nware and the system -on chip Concept was introduced . This research describes\nthe development a system-on-chip transceiver model for nanosatellites which\ncontains a single carrier . Keywords-Single Carrier, transceiver, system C,\nFPGA\n","subjects":["Computing Research Repository/Hardware Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}