{"id":"2408.10269","title":"OpenCity: Open Spatio-Temporal Foundation Models for Traffic Prediction","authors":"Zhonghang Li, Long Xia, Lei Shi, Yong Xu, Dawei Yin, Chao Huang","authorsParsed":[["Li","Zhonghang",""],["Xia","Long",""],["Shi","Lei",""],["Xu","Yong",""],["Yin","Dawei",""],["Huang","Chao",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 15:20:36 GMT"}],"updateDate":"2024-08-21","timestamp":1723821636000,"abstract":"  Accurate traffic forecasting is crucial for effective urban planning and\ntransportation management, enabling efficient resource allocation and enhanced\ntravel experiences. However, existing models often face limitations in\ngeneralization, struggling with zero-shot prediction on unseen regions and\ncities, as well as diminished long-term accuracy. This is primarily due to the\ninherent challenges in handling the spatial and temporal heterogeneity of\ntraffic data, coupled with the significant distribution shift across time and\nspace. In this work, we aim to unlock new possibilities for building versatile,\nresilient and adaptive spatio-temporal foundation models for traffic\nprediction. To achieve this goal, we introduce a novel foundation model, named\nOpenCity, that can effectively capture and normalize the underlying\nspatio-temporal patterns from diverse data characteristics, facilitating\nzero-shot generalization across diverse urban environments. OpenCity integrates\nthe Transformer architecture with graph neural networks to model the complex\nspatio-temporal dependencies in traffic data. By pre-training OpenCity on\nlarge-scale, heterogeneous traffic datasets, we enable the model to learn rich,\ngeneralizable representations that can be seamlessly applied to a wide range of\ntraffic forecasting scenarios. Experimental results demonstrate that OpenCity\nexhibits exceptional zero-shot predictive performance. Moreover, OpenCity\nshowcases promising scaling laws, suggesting the potential for developing a\ntruly one-for-all traffic prediction solution that can adapt to new urban\ncontexts with minimal overhead. We made our proposed OpenCity model open-source\nand it is available at the following link: https://github.com/HKUDS/OpenCity.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}