{"id":"2408.10958","title":"Kilometer-Scale Convection Allowing Model Emulation using Generative\n  Diffusion Modeling","authors":"Jaideep Pathak, Yair Cohen, Piyush Garg, Peter Harrington, Noah\n  Brenowitz, Dale Durran, Morteza Mardani, Arash Vahdat, Shaoming Xu, Karthik\n  Kashinath, Michael Pritchard","authorsParsed":[["Pathak","Jaideep",""],["Cohen","Yair",""],["Garg","Piyush",""],["Harrington","Peter",""],["Brenowitz","Noah",""],["Durran","Dale",""],["Mardani","Morteza",""],["Vahdat","Arash",""],["Xu","Shaoming",""],["Kashinath","Karthik",""],["Pritchard","Michael",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 15:56:01 GMT"}],"updateDate":"2024-08-21","timestamp":1724169361000,"abstract":"  Storm-scale convection-allowing models (CAMs) are an important tool for\npredicting the evolution of thunderstorms and mesoscale convective systems that\nresult in damaging extreme weather. By explicitly resolving convective dynamics\nwithin the atmosphere they afford meteorologists the nuance needed to provide\noutlook on hazard. Deep learning models have thus far not proven skilful at\nkm-scale atmospheric simulation, despite being competitive at coarser\nresolution with state-of-the-art global, medium-range weather forecasting. We\npresent a generative diffusion model called StormCast, which emulates the\nhigh-resolution rapid refresh (HRRR) model-NOAA's state-of-the-art 3km\noperational CAM. StormCast autoregressively predicts 99 state variables at km\nscale using a 1-hour time step, with dense vertical resolution in the\natmospheric boundary layer, conditioned on 26 synoptic variables. We present\nevidence of successfully learnt km-scale dynamics including competitive 1-6\nhour forecast skill for composite radar reflectivity alongside physically\nrealistic convective cluster evolution, moist updrafts, and cold pool\nmorphology. StormCast predictions maintain realistic power spectra for multiple\npredicted variables across multi-hour forecasts. Together, these results\nestablish the potential for autoregressive ML to emulate CAMs -- opening up new\nkm-scale frontiers for regional ML weather prediction and future climate hazard\ndynamical downscaling.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}