{"id":"2408.05941","title":"Multimodal Large Language Models for Phishing Webpage Detection and\n  Identification","authors":"Jehyun Lee, Peiyuan Lim, Bryan Hooi, Dinil Mon Divakaran","authorsParsed":[["Lee","Jehyun",""],["Lim","Peiyuan",""],["Hooi","Bryan",""],["Divakaran","Dinil Mon",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 06:36:08 GMT"}],"updateDate":"2024-08-13","timestamp":1723444568000,"abstract":"  To address the challenging problem of detecting phishing webpages,\nresearchers have developed numerous solutions, in particular those based on\nmachine learning (ML) algorithms. Among these, brand-based phishing detection\nthat uses models from Computer Vision to detect if a given webpage is imitating\na well-known brand has received widespread attention. However, such models are\ncostly and difficult to maintain, as they need to be retrained with labeled\ndataset that has to be regularly and continuously collected. Besides, they also\nneed to maintain a good reference list of well-known websites and related\nmeta-data for effective performance.\n  In this work, we take steps to study the efficacy of large language models\n(LLMs), in particular the multimodal LLMs, in detecting phishing webpages.\nGiven that the LLMs are pretrained on a large corpus of data, we aim to make\nuse of their understanding of different aspects of a webpage (logo, theme,\nfavicon, etc.) to identify the brand of a given webpage and compare the\nidentified brand with the domain name in the URL to detect a phishing attack.\nWe propose a two-phase system employing LLMs in both phases: the first phase\nfocuses on brand identification, while the second verifies the domain. We carry\nout comprehensive evaluations on a newly collected dataset. Our experiments\nshow that the LLM-based system achieves a high detection rate at high\nprecision; importantly, it also provides interpretable evidence for the\ndecisions. Our system also performs significantly better than a\nstate-of-the-art brand-based phishing detection system while demonstrating\nrobustness against two known adversarial attacks.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"F701E_iibu-toMC9f5AhoWZbfDmY83pG6l2Y6sZaHpE","pdfSize":"2927354"}
