{"id":"2408.00119","title":"Pulse family optimization for parametrized quantum gates using spectral\n  clustering","authors":"Robert de Keijzer, Jurgen Snijders, Andr\\'e Carvalho, Servaas\n  Kokkelmans","authorsParsed":[["de Keijzer","Robert",""],["Snijders","Jurgen",""],["Carvalho","André",""],["Kokkelmans","Servaas",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 19:17:29 GMT"}],"updateDate":"2024-08-02","timestamp":1722453449000,"abstract":"  Parametrized gate circuits are used in plentiful applications in the current\nNISQ era of quantum computing. These parametrized gates are chiefly implemented\nusing analytically found pulse protocols, often yielding suboptimal gate times,\nand consequently, fidelities. Alternatively, gate optimization algorithms are\ndesigned to construct high fidelity pulses for individual, fixed points in\ncontinuous parameter space. Gates for intermediate parameters can subsequently\nbe found by some form of interpolation between previously constructed pulses.\nNevertheless, it is not guaranteed (as with analytic protocols) that the pulses\nfound by the optimization algorithms belong to the same \\textit{family} of\nsolutions and thus show resemblance. Interpolation between two pulses of\ndiffering solution families often leads to high infidelities, as the pulse\nstrays away from the minimum in the parameter/fidelity landscape. In this work,\nwe introduce a \\textit{spectral clustering} method to sort high-fidelity,\noptimized pulses in families, and interpolating solely between pulses of the\nsame family. Accordingly, interpolations will always approach maximal fidelity.\nFurthermore, as more than one pulse family is constructed, the parameter space\ncan be partitioned according to which family prevails fidelity-wise. This work\nprovides a meticulous demonstration of our constitutive continuous gate family\nconstruction by applying it to a universal gate set for Rydberg and Cat qubits\nunder noise.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}