{"id":"2408.10824","title":"Emerging clean technologies: policy-driven cost reductions, implications\n  and perspectives","authors":"Mohamed Atouife and Jesse Jenkins","authorsParsed":[["Atouife","Mohamed",""],["Jenkins","Jesse",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 13:21:21 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 12:38:10 GMT"},{"version":"v3","created":"Tue, 10 Sep 2024 20:30:36 GMT"}],"updateDate":"2024-09-12","timestamp":1724160081000,"abstract":"  Hydrogen production from water electrolysis, direct air capture (DAC), and\nsynthetic kerosene derived from hydrogen and CO2 (`e-kerosene') are expected to\nplay an important role in global decarbonization efforts. So far, the economics\nof these nascent technologies hamper their market diffusion. However, a wave of\nrecent policy support in the United States, Europe, China, and elsewhere is\nanticipated to drive their commercial liftoff and bring their costs down. To\nthis end, we evaluate the potential cost reductions driven by policy-induced\nscale-up of these emerging technologies through 2030 using an experience curves\napproach accounting for both local and global learning effects. We then analyze\nthe consequences of projected cost declines on the competitiveness of these\nnascent technologies compared to conventional fossil alternatives, where\napplicable, and highlight some of the tradeoffs associated with their\nexpansion. Our findings indicate that enacted policies could lead to\nsubstantial capital cost reductions for electrolyzers. Nevertheless,\nelectrolytic hydrogen production at $1-2/kg would still require some form of\npolicy support. Given expected costs and experience curves, it is unlikely that\nliquid solvent DAC (L-DAC) scale-up will bring removal costs to stated targets\nof $100/tCO2, though a $200/tCO2 may eventually be within reach. We also\nunderscore the importance of tackling methane leakage for natural gas-powered\nL-DAC: unmitigated leaks amplify net removal costs, exacerbate the investment\nrequirements to reach targeted costs, and cast doubt on L-DAC's role in the\nclean energy transition. Lastly, despite reductions in electrolysis and L-DAC\ncosts, e-kerosene remains considerably more expensive than fossil jet fuel. The\neconomics of e-kerosene and the resources required for production raise\nquestions about the fuel's ultimate viability as a decarbonization tool for\naviation.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3BxAESGKn4I51BUqvBZMXnN3ChzxPuO61LAYS8VZdUg","pdfSize":"1659769"}
