{"id":"2408.11467","title":"How to Read and Update Coded Distributed Storage Robustly and Optimally?","authors":"Haobo Jia and Zhuqing Jia","authorsParsed":[["Jia","Haobo",""],["Jia","Zhuqing",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 09:37:31 GMT"}],"updateDate":"2024-08-22","timestamp":1724233051000,"abstract":"  We consider the problem of robust dynamic coded distributed storage (RDCDS)\nthat is associated with the coded distributed storage of a message with $N$\nservers where 1) it suffices to recover the message from the storage at any\n$R_r$ servers; and 2) each of the servers stores a coded portion of the message\nthat is at most $\\frac{1}{K_c}$ the size of the message. The goal is to enable\ntwo main functionalities: the read operation and the update operation of the\nmessage. Specifically, at time slot $t$, the user may execute either the read\noperation or the update operation, where the read operation allows the user to\nrecover the message from the servers, and the update operation allows the user\nto update the message to the servers in the form of an additive increment so\nthat any up to $X^{(t)}$ colluding servers reveal nothing about the increment.\nThe two functionalities are robust if at any time slot $t$ 1) they tolerate\ntemporarily dropout servers up to certain thresholds (the read threshold is\n$R_r$ and the update threshold is denoted as $R_u^{(t)}$); and 2) the user may\nremain oblivious to prior server states. The communication efficiency is\nmeasured by the download cost $C_r^{(t)}$ of the read operation and the upload\ncost $C_u^{(t)}$ of the update operation. Given $K_c$ and $R_r$, we are curious\nabout the optimal $(R_u^{(t)},C_r^{(t)},C_u^{(t)})$ tuple. In this work, we\nsettle the fundamental limits of RDCDS. In particular, denoting the number of\ndropout servers at time slot $t$ as $|\\mathcal{D}^{(t)}|$, we first show that\n1) $R_u^{(t)}\\geq N-R_r+\\lceil K_c\\rceil+X^{(t)}$; and 2) $C_r^{(t)}\\geq\n\\frac{N-|\\mathcal{D}^{(t)}|}{N-R_r+\\lceil K_c\\rceil-|\\mathcal{D}^{(t)}|},\nC_u^{(t)}\\geq \\frac{N-|\\mathcal{D}^{(t)}|}{R_r-X^{(t)}-|\\mathcal{D}^{(t)}|}$.\nThen, inspired by the idea of staircase codes, we construct an RDCDS scheme\nthat simultaneously achieves the above lower bounds.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}