{"id":"2408.15167","title":"On some minimal characteristics in a model of a system of N particles\n  with interaction","authors":"Igor Pavlov","authorsParsed":[["Pavlov","Igor",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 16:06:47 GMT"}],"updateDate":"2024-08-28","timestamp":1724774807000,"abstract":"  For the well-known model of a system of N particles with interaction (N-body\nproblem), we consider the spatial problem of finding the minimum of the\nfunction of the kinetic energy of a system on its phase space under conditions\non its size and angular momentum. Based on the solution to this problem, we\nprove that the minimum possible kinetic energy of a system at the current value\nof its size can be achieved only on flat trajectories of the system. And under\nsome natural additional conditions these trajectories are flat finite and\nperiodic (elliptical) trajectories generated by flat central configurations.\nThe solution to this problem also provides a simpler solution to a similar\noptimization dual problem of finding the minimum of the size of a system under\nconditions on its kinetic energy and angular momentum. This leads to a similar\nresult that the minimum possible size of the system at the current value of its\nkinetic energy can also be achieved only on flat trajectories. Under some\nadditional conditions these trajectories are also flat periodic elliptical\ntrajectories generated by flat central configurations. Next, we consider the\nmore complex spatial problem of finding local minima of the function of the\nkinetic energy of a system on its phase space at fixed values of the integrals\nof motion: angular momentum and total energy of a system. Based on the solution\nof this problem, we prove further that under some natural additional conditions\nthe local minima of the system kinetic and potential energy functions at fixed\nvalues of these integrals of motion can be achieved only on flat periodic\nelliptical trajectories generated by some flat central configurations. And at\nthe points of these local minima the minimum possible kinetic energy of the\nsystem at the current value of its size and the minimum possible size of the\nsystem at the current value of its kinetic energy are also achieved.\n","subjects":["Physics/Mathematical Physics","Astrophysics/Astrophysics of Galaxies","Mathematics/Mathematical Physics","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}