{"id":"2408.10670","title":"A Noncontact Technique for Wave Measurement Based on Thermal\n  Stereography and Deep Learning","authors":"Deyu Li, Longfei Xiao, Handi Wei, Yan Li, and Binghua Zhang","authorsParsed":[["Li","Deyu",""],["Xiao","Longfei",""],["Wei","Handi",""],["Li","Yan",""],["Zhang","Binghua",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 09:13:12 GMT"}],"updateDate":"2024-08-21","timestamp":1724145192000,"abstract":"  The accurate measurement of the wave field and its spatiotemporal evolution\nis essential in many hydrodynamic experiments and engineering applications. The\nbinocular stereo imaging technique has been widely used to measure waves.\nHowever, the optical properties of indoor water surfaces, including\ntransparency, specular reflection, and texture absence, pose challenges for\nimage processing and stereo reconstruction. This study proposed a novel\ntechnique that combined thermal stereography and deep learning to achieve fully\nnoncontact wave measurements. The optical imaging properties of water in the\nlong-wave infrared spectrum were found to be suitable for stereo matching,\neffectively avoiding the issues in the visible-light spectrum. After capturing\nwave images using thermal stereo cameras, a reconstruction strategy involving\ndeep learning techniques was proposed to improve stereo matching performance. A\ngenerative approach was employed to synthesize a dataset with ground-truth\ndisparity from unannotated infrared images. This dataset was then fed to a\npretrained stereo neural network for fine-tuning to achieve domain adaptation.\nWave flume experiments were conducted to validate the feasibility and accuracy\nof the proposed technique. The final reconstruction results indicated great\nagreement and high accuracy with a mean bias of less than 2.1% compared with\nthe measurements obtained using wave probes, suggesting that the novel\ntechnique effectively measures the spatiotemporal distribution of wave surface\nin hydrodynamic experiments.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}