{"id":"2408.11650","title":"CIPHER: Cybersecurity Intelligent Penetration-testing Helper for Ethical\n  Researcher","authors":"Derry Pratama, Naufal Suryanto, Andro Aprila Adiputra, Thi-Thu-Huong\n  Le, Ahmada Yusril Kadiptya, Muhammad Iqbal, and Howon Kim","authorsParsed":[["Pratama","Derry",""],["Suryanto","Naufal",""],["Adiputra","Andro Aprila",""],["Le","Thi-Thu-Huong",""],["Kadiptya","Ahmada Yusril",""],["Iqbal","Muhammad",""],["Kim","Howon",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 14:24:04 GMT"}],"updateDate":"2024-08-22","timestamp":1724250244000,"abstract":"  Penetration testing, a critical component of cybersecurity, typically\nrequires extensive time and effort to find vulnerabilities. Beginners in this\nfield often benefit from collaborative approaches with the community or\nexperts. To address this, we develop CIPHER (Cybersecurity Intelligent\nPenetration-testing Helper for Ethical Researchers), a large language model\nspecifically trained to assist in penetration testing tasks. We trained CIPHER\nusing over 300 high-quality write-ups of vulnerable machines, hacking\ntechniques, and documentation of open-source penetration testing tools.\nAdditionally, we introduced the Findings, Action, Reasoning, and Results (FARR)\nFlow augmentation, a novel method to augment penetration testing write-ups to\nestablish a fully automated pentesting simulation benchmark tailored for large\nlanguage models. This approach fills a significant gap in traditional\ncybersecurity Q\\&A benchmarks and provides a realistic and rigorous standard\nfor evaluating AI's technical knowledge, reasoning capabilities, and practical\nutility in dynamic penetration testing scenarios. In our assessments, CIPHER\nachieved the best overall performance in providing accurate suggestion\nresponses compared to other open-source penetration testing models of similar\nsize and even larger state-of-the-art models like Llama 3 70B and Qwen1.5 72B\nChat, particularly on insane difficulty machine setups. This demonstrates that\nthe current capabilities of general LLMs are insufficient for effectively\nguiding users through the penetration testing process. We also discuss the\npotential for improvement through scaling and the development of better\nbenchmarks using FARR Flow augmentation results. Our benchmark will be released\npublicly at https://github.com/ibndias/CIPHER.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}