{"id":"2408.09647","title":"C2P-CLIP: Injecting Category Common Prompt in CLIP to Enhance\n  Generalization in Deepfake Detection","authors":"Chuangchuang Tan, Renshuai Tao, Huan Liu, Guanghua Gu, Baoyuan Wu, Yao\n  Zhao, Yunchao Wei","authorsParsed":[["Tan","Chuangchuang",""],["Tao","Renshuai",""],["Liu","Huan",""],["Gu","Guanghua",""],["Wu","Baoyuan",""],["Zhao","Yao",""],["Wei","Yunchao",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 02:14:25 GMT"}],"updateDate":"2024-08-20","timestamp":1724033665000,"abstract":"  This work focuses on AIGC detection to develop universal detectors capable of\nidentifying various types of forgery images. Recent studies have found large\npre-trained models, such as CLIP, are effective for generalizable deepfake\ndetection along with linear classifiers. However, two critical issues remain\nunresolved: 1) understanding why CLIP features are effective on deepfake\ndetection through a linear classifier; and 2) exploring the detection potential\nof CLIP. In this study, we delve into the underlying mechanisms of CLIP's\ndetection capabilities by decoding its detection features into text and\nperforming word frequency analysis. Our finding indicates that CLIP detects\ndeepfakes by recognizing similar concepts (Fig. \\ref{fig:fig1} a). Building on\nthis insight, we introduce Category Common Prompt CLIP, called C2P-CLIP, which\nintegrates the category common prompt into the text encoder to inject\ncategory-related concepts into the image encoder, thereby enhancing detection\nperformance (Fig. \\ref{fig:fig1} b). Our method achieves a 12.41\\% improvement\nin detection accuracy compared to the original CLIP, without introducing\nadditional parameters during testing. Comprehensive experiments conducted on\ntwo widely-used datasets, encompassing 20 generation models, validate the\nefficacy of the proposed method, demonstrating state-of-the-art performance.\nThe code is available at\n\\url{https://github.com/chuangchuangtan/C2P-CLIP-DeepfakeDetection}\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}