{"id":"2408.00527","title":"Contrastive Learning with Dynamic Localized Repulsion for Brain Age\n  Prediction on 3D Stiffness Maps","authors":"Jakob Tr\\\"auble, Lucy Hiscox, Curtis Johnson, Carola-Bibiane\n  Sch\\\"onlieb, Gabriele Kaminski Schierle, Angelica Aviles-Rivero","authorsParsed":[["Träuble","Jakob",""],["Hiscox","Lucy",""],["Johnson","Curtis",""],["Schönlieb","Carola-Bibiane",""],["Schierle","Gabriele Kaminski",""],["Aviles-Rivero","Angelica",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 12:58:19 GMT"}],"updateDate":"2024-08-02","timestamp":1722517099000,"abstract":"  In the field of neuroimaging, accurate brain age prediction is pivotal for\nuncovering the complexities of brain aging and pinpointing early indicators of\nneurodegenerative conditions. Recent advancements in self-supervised learning,\nparticularly in contrastive learning, have demonstrated greater robustness when\ndealing with complex datasets. However, current approaches often fall short in\ngeneralizing across non-uniformly distributed data, prevalent in medical\nimaging scenarios. To bridge this gap, we introduce a novel contrastive loss\nthat adapts dynamically during the training process, focusing on the localized\nneighborhoods of samples. Moreover, we expand beyond traditional structural\nfeatures by incorporating brain stiffness, a mechanical property previously\nunderexplored yet promising due to its sensitivity to age-related changes. This\nwork presents the first application of self-supervised learning to brain\nmechanical properties, using compiled stiffness maps from various clinical\nstudies to predict brain age. Our approach, featuring dynamic localized loss,\nconsistently outperforms existing state-of-the-art methods, demonstrating\nsuperior performance and laying the way for new directions in brain aging\nresearch.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kKUlTVQUKfM6fb2t1KHrwo_gkeYdaJl5n66GIqq1O0o","pdfSize":"1565597","txDigest":"4FFQTtZqeecKgrYYo6QKHfrs6bpv3YaZ8REAAdtnYb41","endEpoch":"1","status":"CERTIFIED"}
