{"id":"2408.04694","title":"The Star Clusters As Links between galaxy Evolution and Star formation\n  (SCALES) project I: Numerical method","authors":"Marta Reina-Campos, Oleg Y. Gnedin, Alison Sills and Hui Li","authorsParsed":[["Reina-Campos","Marta",""],["Gnedin","Oleg Y.",""],["Sills","Alison",""],["Li","Hui",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-12","timestamp":1723140000000,"abstract":"  Stellar clusters are critical constituents within galaxies: they are the\nresult of highest-density star formation, and through their spatially and\ntemporally correlated feedback they regulate their host galaxy evolution. We\npresent a novel numerical method to model star clusters as individual units of\nstar formation using sink particles. In our method, star clusters grow via gas\naccretion and via merging with less massive clusters. We describe the\nimplementation in the radiation hydrodynamics code GIZMO and run a large grid\nof marginally bound, turbulent clouds of $10^7~{\\rm M}_{\\odot}$ to explore the\neffect of modeling ingredients on the evolution of the clouds and the star\nclusters. We find both gas accretion and mergers to be critical processes to\nform star clusters of masses up to $\\sim10^5$-$10^6~{\\rm M}_{\\odot}$, while\nionising radiation is the main feedback mechanism regulating the growth of star\nclusters. The majority of our star clusters assemble their mass in\n$0.3$-$2.6~{\\rm Myr}$, and the most massive ones take $\\sim10~{\\rm Myr}$. By\nremoving high density gas by accretion, our sink-based cluster formation\nprescription allows the newly-formed star clusters to inject their stellar\nfeedback in less dense environments. This makes feedback more efficient at\nionising and disrupting the cloud than if we were to use a standard star\nformation approach, indicating that our numerical method is the missing\ncritical step to model the interplay between star clusters and their host\ngalaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JfLpjJFoshhgfSKpcG96bbEMaOotavvGHAo9HJoLQ1k","pdfSize":"2616666"}
