{"id":"2408.15044","title":"Enabling Efficient and Scalable DRAM Read Disturbance Mitigation via New\n  Experimental Insights into Modern DRAM Chips","authors":"Abdullah Giray Ya\\u{g}l{\\i}k\\c{c}{\\i}","authorsParsed":[["Yağlıkçı","Abdullah Giray",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 13:12:03 GMT"}],"updateDate":"2024-08-28","timestamp":1724764323000,"abstract":"  Increasing storage density exacerbates DRAM read disturbance, a circuit-level\nvulnerability exploited by system-level attacks. Unfortunately, existing\ndefenses are either ineffective or prohibitively expensive. Efficient\nmitigation is critical to ensure robust (reliable, secure, and safe) execution\nin future DRAM-based systems. This dissertation tackles two problems: 1)\nprotecting DRAM-based systems becomes more expensive as technology scaling\nincreases read disturbance vulnerability, and 2) many existing solutions depend\non proprietary knowledge of DRAM internals. First, we build a detailed\nunderstanding of DRAM read disturbance by rigorously characterizing\noff-the-shelf modern DRAM chips under varying 1) temperatures, 2) memory access\npatterns, 3) in-chip locations, and 4) voltage. Our novel observations\ndemystify the implications of large DRAM read disturbance variation on future\nDRAM read disturbance attacks and solutions. Second, we propose new mechanisms\nthat mitigate read disturbance bitflips efficiently and scalably by leveraging\ninsights into DRAM chip design: 1) subarray-level parallelism and 2) variation\nin read disturbance across DRAM rows in off-the-shelf DRAM chips. Third, we\npropose a novel solution that mitigates DRAM read disturbance by selectively\nthrottling unsafe memory accesses that might otherwise cause read disturbance\nbitflips without proprietary knowledge of DRAM chip internals. We demonstrate\nthat it is possible to mitigate DRAM read disturbance efficiently and scalably\nwith worsening DRAM read disturbance by 1) building a detailed understanding of\nDRAM read disturbance, 2) leveraging insights into DRAM chips, and 3) devising\nnovel solutions that do not require proprietary knowledge of DRAM chip\ninternals. Our experimental insights and solutions enable future works\ntargeting robust memory systems.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/"}