{"id":"2408.10406","title":"The GT and GHC models for molecular clouds compared. Differences,\n  similarities, and myths","authors":"Enrique V\\'azquez-Semadeni, Aina Palau, Gilberto C. G\\'omez, Griselda\n  Arroyo-Ch\\'avez, Christian Alig, Javier Ballesteros-Paredes, Vianey Camacho,\n  Alejandro Gonz\\'alez-Samaniego, and Andreas Burkert","authorsParsed":[["V치zquez-Semadeni","Enrique",""],["Palau","Aina",""],["G칩mez","Gilberto C.",""],["Arroyo-Ch치vez","Griselda",""],["Alig","Christian",""],["Ballesteros-Paredes","Javier",""],["Camacho","Vianey",""],["Gonz치lez-Samaniego","Alejandro",""],["Burkert","Andreas",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 20:45:51 GMT"}],"updateDate":"2024-08-21","timestamp":1724100351000,"abstract":"  We provide a detailed comparison between the ``gravoturbulent'' (GT) and\n``global hierarchical collapse'' (GHC) models for molecular clouds and star\nformation, their respective interpretations of the observational data, the\nfeatures they share, and suggested tests and observations to discern between\nthem. Also, we clarify common misconceptions in recent literature about the\nglobal and hierarchical nature of the GHC scenario, and briefly discuss the\nevolution of some aspects of both models toward convergence. GT assumes that\nmolecular clouds and their substructures are in approximate virial equilibrium\nand are in a near-stationary state, interprets the linewidth-derived nonthermal\nmotions exclusively as turbulence, which provides additional pressure against\nself-gravity. Conversely, GHC assumes that most star-forming molecular clouds\nand their substructures are part of a continuous gravitationally-driven flow,\neach accreting from their parent structure. Thus, the clouds and their star\nformation rate evolve in time. GHC interprets nonthermal motions as a mixture\nof infall and turbulent components, with the relative importance of the former\nincreasing as the objects become denser and/or more massive. Tests that may\nprovide clues to distinguishing between GT and GHC must take into account that\nthe innermost parts of globally gravitationally bound structures may not\nlocally appear bound, and thus the binding may have to be searched for at the\nlargest scale of the structure.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"X33iLaZMS83ewohiT1lM1NhuO0p_uUs8s-H48rtnRjA","pdfSize":"6670846"}
