{"id":"2408.01636","title":"The pre-perihelion evolution of the activity of comet C/2017 K2\n  (PANSTARRS) during the water ice-line crossover","authors":"Yuna G. Kwon, Stefano Bagnulo, Johannes Markkanen, Ludmilla\n  Kolokolova, Jessica Agarwal, Manuela Lippi, Zuri Gray","authorsParsed":[["Kwon","Yuna G.",""],["Bagnulo","Stefano",""],["Markkanen","Johannes",""],["Kolokolova","Ludmilla",""],["Agarwal","Jessica",""],["Lippi","Manuela",""],["Gray","Zuri",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 02:38:57 GMT"}],"updateDate":"2024-08-06","timestamp":1722652737000,"abstract":"  Comets, relics from the early solar system, consist of dust and ice. The ice\nsublimates as comets approach the Sun, ejecting dust from their nuclei seen as\nactivity. Different volatiles sublimate at different Sun-comet distances and\neject dust of unique sizes, structures, and compositions. In this study, we\npresent new polarimetric observations of Oort-cloud comet C/2017 K2 (PANSTARRS)\nin R and I-filter domains before, during, and after its crossover of the\nwater-ice sublimation regime at phase angles of 15.9\\arcdeg, 10.5\\arcdeg, and\n20.0\\arcdeg, respectively. Combining multiband optical imaging data covering a\nwide range of heliocentric distances ($\\sim$14$-$2.3 au), we aim to\ncharacterize the preperihelion evolution of cometary activity as well as the\nproperties of its coma dust. Two discontinuous brightening events were\nobserved: at $\\sim$6 au presumably associated with changes in CO-like\nsupervolatile ice activity, and at $\\sim$2.9 au when water ice took over.\nParticularly, the latter activation is accompanied by changes in coma\nmorphology and color whose trends differ between the inner ($\\sim$10$^3$-km)\nand outer ($\\sim$10$^4$-km) parts of the coma. No polarimetric discontinuities\non the comet were observed over the inner coma region, all epochs showing\nphase-angle and wavelength dependencies compatible with those of active comets\nobserved in similar observing geometry. During this period, the underlying dust\ncontinuum overwhelmed H$\\alpha$ emission at around 656.3 nm, suggesting less\nwater ice on the comet's surface than expected. We discuss K2's coma\nenvironment by combining numerical simulations of light scattered by dust and\nplace the observations within the context of the comet's evolution.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}