{"id":"2408.06336","title":"Moo-ving Beyond Tradition: Revolutionizing Cattle Behavioural\n  Phenotyping with Pose Estimation Techniques","authors":"Navid Ghassemi, Ali Goldani, Ian Q. Whishaw, Majid H. Mohajerani","authorsParsed":[["Ghassemi","Navid",""],["Goldani","Ali",""],["Whishaw","Ian Q.",""],["Mohajerani","Majid H.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 17:52:29 GMT"}],"updateDate":"2024-08-13","timestamp":1723485149000,"abstract":"  The cattle industry has been a major contributor to the economy of many\ncountries, including the US and Canada. The integration of Artificial\nIntelligence (AI) has revolutionized this sector, mirroring its transformative\nimpact across all industries by enabling scalable and automated monitoring and\nintervention practices. AI has also introduced tools and methods that automate\nmany tasks previously performed by human labor with the help of computer\nvision, including health inspections. Among these methods, pose estimation has\na special place; pose estimation is the process of finding the position of\njoints in an image of animals. Analyzing the pose of animal subjects enables\nprecise identification and tracking of the animal's movement and the movements\nof its body parts. By summarizing the video and imagery data into movement and\njoint location using pose estimation and then analyzing this information, we\ncan address the scalability challenge in cattle management, focusing on health\nmonitoring, behavioural phenotyping and welfare concerns. Our study reviews\nrecent advancements in pose estimation methodologies, their applicability in\nimproving the cattle industry, existing challenges, and gaps in this field.\nFurthermore, we propose an initiative to enhance open science frameworks within\nthis field of study by launching a platform designed to connect industry and\nacademia.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}