{"id":"2408.03457","title":"Transit Rider Heat Stress in Atlanta, GA under Current and Future\n  Climate Scenarios","authors":"Huiying Fan, Geyu Lyu, Hongyu Lu, Angshuman Guin, Randall Guensler","authorsParsed":[["Fan","Huiying",""],["Lyu","Geyu",""],["Lu","Hongyu",""],["Guin","Angshuman",""],["Guensler","Randall",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 21:37:38 GMT"}],"updateDate":"2024-08-08","timestamp":1722980258000,"abstract":"  Transit is a crucial mode of transportation, especially in urban areas and\nfor urban and rural disadvantaged communities. Because extreme temperatures\noften pose threats to the elderly, members of the disability community, and\nother vulnerable populations, this study seeks to understand the level of\ninfluence that extreme temperatures may have on transit users across different\ndemographic groups. In this case study for Atlanta, GA, heat stress is\npredicted for 2019 transit riders (using transit rider activity survey data)\nand for three future climate scenarios, SSP245, SSP370, and SSP585, into the\nyear 2100. The HeatPath Analyzer and TransitSim 4.0 models were applied to\npredict cumulative heat exposure and trip-level risk for 35,999 trip\nequivalents for an average Atlanta area weekday in the summer of 2019. The\nanalyses show that under 2019 weather conditions, 8.33% of summer trips were\nestimated to be conducted under extreme heat. With the projected future climate\nconditions, the percentage of trips under extreme heat risk grows steadily. By\n2100, 37.1%, 56.1%, and 76.4% are projected to be under extreme heat risk for\nscenarios SSP245, SSP370, and SSP585, respectively. Under current weather\nconditions, Atlanta transit riders that own no vehicles and transit riders that\nare African American are disproportionately influenced by extreme heat. The\ndisparity between these two groups and other groups of transit riders becomes\nwider as climate change continues to exacerbate. The findings of the study\nhighlight an urgent need to implement heat mitigation and adaptation strategies\nin urban transit networks.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Computers and Society","Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"-O-eK1zPvBPA6xHB_iksqEYBRtZzXllJcXQWM-sldT4","pdfSize":"2082532"}
