{"id":"2408.16075","title":"Topological superconductivity from repulsive interactions in twisted\n  WSe$_2$","authors":"Daniele Guerci, Daniel Kaplan, Julian Ingham, J. H. Pixley and Andrew\n  J. Millis","authorsParsed":[["Guerci","Daniele",""],["Kaplan","Daniel",""],["Ingham","Julian",""],["Pixley","J. H.",""],["Millis","Andrew J.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:16:18 GMT"}],"updateDate":"2024-08-30","timestamp":1724868978000,"abstract":"  The recent observation of superconductivity in twisted bilayer WSe$_2$ raises\nintriguing questions concerning the origin and the properties of\nsuperconducting states realized in bands with non-trivial topological\nproperties and repulsive electron-electron interactions. Using a continuum band\nstructure model, we analyze a mechanism for Coulomb interaction-driven\nsuperconductivity in twisted bilayers of WSe$_2$. We discuss the symmetries and\nthe phenomenological properties of the resulting superconducting phases and\ntheir evolution with interlayer potential difference, tunable via an out of\nplane electric field. The pairing strength is a non-monotonic function of\ninterlayer potential, being larger at intermediate values due to mixing of\nsinglet and triplet pairing. In contrast, at larger interlayer potential, the\npairing tendency is suppressed due to enhanced Coulomb repulsion. The\nsuperconducting state is chiral in a large regime of parameters and undergoes a\ntransition to a nodal nematic superconductor at a critical potential\ndifference. The chiral state, characterized by an intervalley-symmetric\nsuperposition of triplet and singlet pairs, is classified as a topological\nsuperconductor within the Altland-Zirnbauer class C. At zero interlayer\npotential difference, the superconducting state is instead of class D, which\nhosts Majorana zero modes, making it a promising candidate for applications in\nquantum computation.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/"}