{"id":"2408.05981","title":"CAD-Mesher: A Convenient, Accurate, Dense Mesh-based Mapping Module in\n  SLAM for Dynamic Environments","authors":"Yanpeng Jia, Fengkui Cao, Ting Wang, Yandong Tang, Shiliang Shao and\n  Lianqing Liu","authorsParsed":[["Jia","Yanpeng",""],["Cao","Fengkui",""],["Wang","Ting",""],["Tang","Yandong",""],["Shao","Shiliang",""],["Liu","Lianqing",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 08:16:40 GMT"}],"updateDate":"2024-08-13","timestamp":1723450600000,"abstract":"  Most LiDAR odometry and SLAM systems construct maps in point clouds, which\nare discrete and sparse when zoomed in, making them not directly suitable for\nnavigation. Mesh maps represent a dense and continuous map format with low\nmemory consumption, which can approximate complex structures with simple\nelements, attracting significant attention of researchers in recent years.\nHowever, most implementations operate under a static environment assumption. In\neffect, moving objects cause ghosting, potentially degrading the quality of\nmeshing. To address these issues, we propose a plug-and-play meshing module\nadapting to dynamic environments, which can easily integrate with various LiDAR\nodometry to generally improve the pose estimation accuracy of odometry. In our\nmeshing module, a novel two-stage coarse-to-fine dynamic removal method is\ndesigned to effectively filter dynamic objects, generating consistent,\naccurate, and dense mesh maps. To our best know, this is the first mesh\nconstruction method with explicit dynamic removal. Additionally, conducive to\nGaussian process in mesh construction, sliding window-based keyframe\naggregation and adaptive downsampling strategies are used to ensure the\nuniformity of point cloud. We evaluate the localization and mapping accuracy on\nfive publicly available datasets. Both qualitative and quantitative results\ndemonstrate the superiority of our method compared with the state-of-the-art\nalgorithms. The code and introduction video are publicly available at\nhttps://yaepiii.github.io/CAD-Mesher/.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}