{"id":"2408.10794","title":"Tapping in a Remote Vehicle's onboard LLM to Complement the Ego\n  Vehicle's Field-of-View","authors":"Malsha Ashani Mahawatta Dona, Beatriz Cabrero-Daniel, Yinan Yu,\n  Christian Berger","authorsParsed":[["Dona","Malsha Ashani Mahawatta",""],["Cabrero-Daniel","Beatriz",""],["Yu","Yinan",""],["Berger","Christian",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 12:38:34 GMT"}],"updateDate":"2024-08-21","timestamp":1724157514000,"abstract":"  Today's advanced automotive systems are turning into intelligent\nCyber-Physical Systems (CPS), bringing computational intelligence to their\ncyber-physical context. Such systems power advanced driver assistance systems\n(ADAS) that observe a vehicle's surroundings for their functionality. However,\nsuch ADAS have clear limitations in scenarios when the direct line-of-sight to\nsurrounding objects is occluded, like in urban areas. Imagine now automated\ndriving (AD) systems that ideally could benefit from other vehicles'\nfield-of-view in such occluded situations to increase traffic safety if, for\nexample, locations about pedestrians can be shared across vehicles. Current\nliterature suggests vehicle-to-infrastructure (V2I) via roadside units (RSUs)\nor vehicle-to-vehicle (V2V) communication to address such issues that stream\nsensor or object data between vehicles. When considering the ongoing revolution\nin vehicle system architectures towards powerful, centralized processing units\nwith hardware accelerators, foreseeing the onboard presence of large language\nmodels (LLMs) to improve the passengers' comfort when using voice assistants\nbecomes a reality. We are suggesting and evaluating a concept to complement the\nego vehicle's field-of-view (FOV) with another vehicle's FOV by tapping into\ntheir onboard LLM to let the machines have a dialogue about what the other\nvehicle ``sees''. Our results show that very recent versions of LLMs, such as\nGPT-4V and GPT-4o, understand a traffic situation to an impressive level of\ndetail, and hence, they can be used even to spot traffic participants. However,\nbetter prompts are needed to improve the detection quality and future work is\nneeded towards a standardised message interchange format between vehicles.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}