{"id":"2408.15371","title":"Temporal Graph Neural Network-Powered Paper Recommendation on Dynamic\n  Citation Networks","authors":"Junhao Shen, Mohammad Ausaf Ali Haqqani, Beichen Hu, Cheng Huang,\n  Xihao Xie, Tsengdar Lee and Jia Zhang","authorsParsed":[["Shen","Junhao",""],["Haqqani","Mohammad Ausaf Ali",""],["Hu","Beichen",""],["Huang","Cheng",""],["Xie","Xihao",""],["Lee","Tsengdar",""],["Zhang","Jia",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 19:10:21 GMT"}],"updateDate":"2024-08-29","timestamp":1724785821000,"abstract":"  Due to the rapid growth of scientific publications, identifying all related\nreference articles in the literature has become increasingly challenging yet\nhighly demanding. Existing methods primarily assess candidate publications from\na static perspective, focusing on the content of articles and their structural\ninformation, such as citation relationships. There is a lack of research\nregarding how to account for the evolving impact among papers on their\nembeddings. Toward this goal, this paper introduces a temporal dimension to\npaper recommendation strategies. The core idea is to continuously update a\npaper's embedding when new citation relationships appear, enhancing its\nrelevance for future recommendations. Whenever a citation relationship is added\nto the literature upon the publication of a paper, the embeddings of the two\nrelated papers are updated through a Temporal Graph Neural Network (TGN). A\nlearnable memory update module based on a Recurrent Neural Network (RNN) is\nutilized to study the evolution of the embedding of a paper in order to predict\nits reference impact in a future timestamp. Such a TGN-based model learns a\npattern of how people's views of the paper may evolve, aiming to guide paper\nrecommendations more precisely. Extensive experiments on an open citation\nnetwork dataset, including 313,278 articles from\nhttps://paperswithcode.com/about PaperWithCode, have demonstrated the\neffectiveness of the proposed approach.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}