{"id":"2408.16374","title":"Concept Study of a Storage Ring-based Gravitational Wave Observatory:\n  Gravitational Wave Strain and Synchrotron Radiation Noise","authors":"Thorben Schmirander, Velizar Miltchev, Suvrat Rao, Marcus Br\\\"uggen,\n  Florian Gr\\\"uner, Wolfgang Hillert and Jochen Liske","authorsParsed":[["Schmirander","Thorben",""],["Miltchev","Velizar",""],["Rao","Suvrat",""],["Brüggen","Marcus",""],["Grüner","Florian",""],["Hillert","Wolfgang",""],["Liske","Jochen",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 09:32:02 GMT"}],"updateDate":"2024-08-30","timestamp":1724923922000,"abstract":"  This work for the first time addresses the feasibility of measuring\nmillihertz gravitational waves (mHz GWs) with a storage ring-based detector.\nWhile this overall challenge consists of several partial problems, here we\nfocus solely on quantifying design limitations imposed by the kinetic energy\nand radiated power of circulating ions at relativistic velocities. We propose\nan experiment based on the measurement of the time-of-flight signal of an ion\nchain. One of the dominant noise sources inherent to the measurement principle\nfor such a GW detector is the shot noise of the emitted synchrotron radiation.\nWe compute the noise amplitude of arrival time signals obtained by analytical\nestimates and simulations of ions with different masses and velocities\ncirculating in a storage ring with the circumference of the Large Hadron\nCollider (LHC). Thereby, we show that our experiment design could reduce the\nnoise amplitude due to the synchrotron radiation in the frequency range\n$10^{-4} - 10^{-2}$ Hz to one or two orders of magnitude below the expected GW\nsignals from of astrophysical sources, such as super-massive binary black holes\nor extreme mass-ratio inspirals. Other key requirements for building a working\nstorage ring-based GW detector include the generation and acceleration of heavy\nion chains with the required energy resolution, their injection and continued\nstorage, as well as the detection method to be used for the determination of\nthe particle arrival time. However, these are not the focus of the work\npresented here, in which we instead concentrate on the definition of a working\nprinciple in terms of ion type, kinetic energy, and ring design, which will\nlater serve as a starting point when addressing a more complete experimental\nsetup.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/"}