{"id":"2408.12912","title":"Real-time control of non-Abelian anyons in Kitaev spin liquid under\n  energy dissipation","authors":"Chihiro Harada, Atsushi Ono, Joji Nasu","authorsParsed":[["Harada","Chihiro",""],["Ono","Atsushi",""],["Nasu","Joji",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 08:40:00 GMT"}],"updateDate":"2024-08-26","timestamp":1724402400000,"abstract":"  Quantum spin liquids realized in the Kitaev model offer a platform for\nfractionalization of spin into two quasiparticles: itinerant Majoranas and\nlocalized visons. Introducing a uniform weak magnetic field associates a\nMajorana zero mode with each vison excitation. The vison accompanied by a\nMajorana zero mode is known to behave as a non-Abelian anyon, which has\ngarnered significant attention for its potential applications in topological\nquantum computing. Although spatial and temporal control of these anyons is\nessential for exploring their applicability in quantum computing, numerical\nsimulations of creating, moving, and annihilating anyons by an external field\nremain challenging as this field violates the exact solvability of the Kitaev\nmodel. Moreover, such a field to control anyons may disturb the quantum state\ndue to the energy injection it causes. In this study, by introducing energy\ndissipation phenomenologically in real-time simulations, we demonstrate that\nthe generation, movement, and annihilation of vison excitations can be achieved\nwhile maintaining their localization. We find that a vison can be moved in a\ndesired direction by using time-dependent local magnetic fields or gradient\nfields, and it remains accompanied by a Majorana zero mode even after its\nmovement. We also reveal that a larger spatial extent of the Majorana zero\nmodes bound to a vison facilitates the movement of the vison with smaller field\ngradients. Furthermore, our numerical simulations demonstrate pair creation and\nannihilation of visons, triggered by time-dependent magnetic fields. The\nresults obtained in this study highlight the significance of energy dissipation\nin controlling non-Abelian anyons, which will stimulate further investigations\ninto the nonequilibrium dynamics of fractional quasiparticles in strongly\ncorrelated electron systems, as well as studies for applications in quantum\ncomputation.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}