{"id":"2408.04878","title":"Modelling DSA, FAST and CRAFT surveys in a z-DM analysis and\n  constraining a minimum FRB energy","authors":"Jordan Hoffmann, Clancy W. James, Marcin Glowacki, Jason X. Prochaska,\n  Alexa C. Gordon, Adam T. Deller, Ryan M. Shannon and Stuart D. Ryder","authorsParsed":[["Hoffmann","Jordan",""],["James","Clancy W.",""],["Glowacki","Marcin",""],["Prochaska","Jason X.",""],["Gordon","Alexa C.",""],["Deller","Adam T.",""],["Shannon","Ryan M.",""],["Ryder","Stuart D.",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 05:48:05 GMT"}],"updateDate":"2024-08-12","timestamp":1723182485000,"abstract":"  Fast radio burst (FRB) science primarily revolves around two facets: the\norigin of these bursts and their use in cosmological studies. This work follows\nfrom previous redshift-dispersion measure ($z$-DM) analyses in which we model\ninstrumental biases and simultaneously fit population parameters and\ncosmological parameters to the observed population of FRBs. This sheds light on\nboth the progenitors of FRBs and cosmological questions. Previously, we have\ncompleted similar analyses with data from the Australian Square Kilometer Array\nPathfinder (ASKAP) and the Murriyang (Parkes) Multibeam system. With this\nmanuscript, we additionally incorporate data from the Deep Synoptic Array (DSA)\nand the Five-hundred-meter Aperture Spherical Telescope (FAST), invoke a Markov\nchain Monte Carlo (MCMC) sampler and implement uncertainty in the Galactic DM\ncontributions. The latter leads to larger uncertainties in derived model\nparameters than previous estimates despite the additional data. We provide\nrefined constraints on FRB population parameters and derive a new constraint on\nthe minimum FRB energy of log$\\,E_{\\mathrm{min}}$(erg)=39.49$^{+0.39}_{-1.48}$\nwhich is significantly higher than bursts detected from strong repeaters. This\nresult may indicate a low-energy turnover in the luminosity function or may\nsuggest that strong repeaters have a different luminosity function to single\nbursts. We also predict that FAST will detect 25-41% of their FRBs at $z\n\\gtrsim 2$ and DSA will detect 2-12% of their FRBs at $z \\gtrsim 1$.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}