{"id":"2408.14507","title":"Cost-Aware Uncertainty Reduction in Schema Matching with GPT-4: The\n  Prompt-Matcher Framework","authors":"Longyu Feng and Huahang Li and Chen Jason Zhang","authorsParsed":[["Feng","Longyu",""],["Li","Huahang",""],["Zhang","Chen Jason",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 16:54:08 GMT"}],"updateDate":"2024-08-28","timestamp":1724518448000,"abstract":"  Schema matching is the process of identifying correspondences between the\nelements of two given schemata, essential for database management systems, data\nintegration, and data warehousing. The inherent uncertainty of current schema\nmatching algorithms leads to the generation of a set of candidate matches.\nStoring these results necessitates the use of databases and systems capable of\nhandling probabilistic queries. This complicates the querying process and\nincreases the associated storage costs. Motivated by GPT-4 outstanding\nperformance, we explore its potential to reduce uncertainty. Our proposal is to\nsupplant the role of crowdworkers with GPT-4 for querying the set of candidate\nmatches. To get more precise correspondence verification responses from GPT-4,\nWe have crafted Semantic-match and Abbreviation-match prompt for GPT-4,\nachieving state-of-the-art results on two benchmark datasets DeepMDatasets 100%\n(+0.0) and Fabricated-Datasets 91.8% (+2.2) recall rate. To optimise budget\nutilisation, we have devised a cost-aware solution. Within the constraints of\nthe budget, our solution delivers favourable outcomes with minimal time\nexpenditure.\n  We introduce a novel framework, Prompt-Matcher, to reduce the uncertainty in\nthe process of integration of multiple automatic schema matching algorithms and\nthe selection of complex parameterization. It assists users in diminishing the\nuncertainty associated with candidate schema match results and in optimally\nranking the most promising matches. We formally define the Correspondence\nSelection Problem, aiming to optimise the revenue within the confines of the\nGPT-4 budget. We demonstrate that CSP is NP-Hard and propose an approximation\nalgorithm with minimal time expenditure. Ultimately, we demonstrate the\nefficacy of Prompt-Matcher through rigorous experiments.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}