{"id":"2408.02668","title":"Searching for dark matter with a 1000 km baseline interferometer","authors":"Daniel Gavilan-Martin, Grzegorz Lukasiewicz, Mikhail Padniuk, Emmanuel\n  Klinger, Magdalena Smolis, Nataniel L. Figueroa, Derek F. Jackson Kimball,\n  Alexander O. Sushkov, Szymon Pustelny, Dmitry Budker, and Arne Wickenbrock","authorsParsed":[["Gavilan-Martin","Daniel",""],["Lukasiewicz","Grzegorz",""],["Padniuk","Mikhail",""],["Klinger","Emmanuel",""],["Smolis","Magdalena",""],["Figueroa","Nataniel L.",""],["Kimball","Derek F. Jackson",""],["Sushkov","Alexander O.",""],["Pustelny","Szymon",""],["Budker","Dmitry",""],["Wickenbrock","Arne",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 17:58:58 GMT"}],"updateDate":"2024-08-06","timestamp":1722880738000,"abstract":"  Axion-like particles (ALPs) arise from well-motivated extensions to the\nStandard Model and could account for dark matter. ALP dark matter would\nmanifest as a nearly monochromatic field oscillating at an (as of yet) unknown\nfrequency. The frequency depends on the ALP mass, which could plausibly range\nfrom $10^{-22}$ eV/$c^2$ to $10$ eV/$c^2$. We report on a direct search for ALP\ndark matter through the ALP-nucleon interaction by interfering the signals of\ntwo atomic K-Rb-$^3$He comagnetometers, with one situated in Mainz, Germany,\nand the other in Krak\\'ow, Poland. We use the ALP dark matter's spatiotemporal\ncoherence properties assuming the standard halo model of dark matter in the\nMilky Way to improve the sensitivity and exclude spurious candidates. The\nsearch extends over nine orders of magnitude in ALP mass. In this range, no\nsignificant evidence of an ALP signal is found. We thus place new upper limits\non the ALP-neutron and ALP-proton couplings of $g_{aNN}<10^{-5}$ GeV$^{-1}$ and\n$g_{aPP}<5 \\times 10^{-4}$ GeV$^{-1}$ at a mass of $10^{-22}$ eV/$c^2$ and\nextending to a mass of $10^{-15}$ eV/$c^2$ where the upper limits reach below\n$g_{aNN}<10^{-9}$ GeV$^{-1}$ and $g_{aPP}<10^{-7}$ GeV$^{-1}$, respectively.\nFor both neutron and proton couplings, this work is an improvement of up to\nfour orders of magnitude compared to previous laboratory constraints.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0I0_0QJIAhk3CgFXz_0yCErB0EA-wc5PZ3-vTuHeJ9U","pdfSize":"8182540","txDigest":"CtCHgw9ptWV7WHPhewoPehXekoC9Ksg86Y4uBVLW95Ux","endEpoch":"1","status":"CERTIFIED"}
