{"id":"2408.01697","title":"Invariant Graph Learning Meets Information Bottleneck for\n  Out-of-Distribution Generalization","authors":"Wenyu Mao, Jiancan Wu, Haoyang Liu, Yongduo Sui, Xiang Wang","authorsParsed":[["Mao","Wenyu",""],["Wu","Jiancan",""],["Liu","Haoyang",""],["Sui","Yongduo",""],["Wang","Xiang",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 07:38:04 GMT"}],"updateDate":"2024-08-06","timestamp":1722670684000,"abstract":"  Graph out-of-distribution (OOD) generalization remains a major challenge in\ngraph learning since graph neural networks (GNNs) often suffer from severe\nperformance degradation under distribution shifts. Invariant learning, aiming\nto extract invariant features across varied distributions, has recently emerged\nas a promising approach for OOD generation. Despite the great success of\ninvariant learning in OOD problems for Euclidean data (i.e., images), the\nexploration within graph data remains constrained by the complex nature of\ngraphs. Existing studies, such as data augmentation or causal intervention,\neither suffer from disruptions to invariance during the graph manipulation\nprocess or face reliability issues due to a lack of supervised signals for\ncausal parts. In this work, we propose a novel framework, called Invariant\nGraph Learning based on Information bottleneck theory (InfoIGL), to extract the\ninvariant features of graphs and enhance models' generalization ability to\nunseen distributions. Specifically, InfoIGL introduces a redundancy filter to\ncompress task-irrelevant information related to environmental factors.\nCooperating with our designed multi-level contrastive learning, we maximize the\nmutual information among graphs of the same class in the downstream\nclassification tasks, preserving invariant features for prediction to a great\nextent. An appealing feature of InfoIGL is its strong generalization ability\nwithout depending on supervised signal of invariance. Experiments on both\nsynthetic and real-world datasets demonstrate that our method achieves\nstate-of-the-art performance under OOD generalization for graph classification\ntasks. The source code is available at https://github.com/maowenyu-11/InfoIGL.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4VjUxhFmQg4RGAebQRxZFdT3pFDSu4N7mPehUgd85q0","pdfSize":"1381639"}
