{"id":"2408.08456","title":"Efficient Data-Sketches and Fine-Tuning for Early Detection of\n  Distributional Drift in Medical Imaging","authors":"Yusen Wu, Hao Chen, Alex Pissinou Makki, Phuong Nguyen, Yelena Yesha","authorsParsed":[["Wu","Yusen",""],["Chen","Hao",""],["Makki","Alex Pissinou",""],["Nguyen","Phuong",""],["Yesha","Yelena",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 23:46:37 GMT"}],"updateDate":"2024-08-19","timestamp":1723765597000,"abstract":"  Distributional drift detection is important in medical applications as it\nhelps ensure the accuracy and reliability of models by identifying changes in\nthe underlying data distribution that could affect diagnostic or treatment\ndecisions. However, current methods have limitations in detecting drift; for\nexample, the inclusion of abnormal datasets can lead to unfair comparisons.\nThis paper presents an accurate and sensitive approach to detect distributional\ndrift in CT-scan medical images by leveraging data-sketching and fine-tuning\ntechniques. We developed a robust baseline library model for real-time anomaly\ndetection, allowing for efficient comparison of incoming images and\nidentification of anomalies. Additionally, we fine-tuned a vision transformer\npre-trained model to extract relevant features using breast cancer images as an\nexample, significantly enhancing model accuracy to 99.11\\%. Combining with\ndata-sketches and fine-tuning, our feature extraction evaluation demonstrated\nthat cosine similarity scores between similar datasets provide greater\nimprovements, from around 50\\% increased to 100\\%. Finally, the sensitivity\nevaluation shows that our solutions are highly sensitive to even 1\\%\nsalt-and-pepper and speckle noise, and it is not sensitive to lighting noise\n(e.g., lighting conditions have no impact on data drift). The proposed methods\noffer a scalable and reliable solution for maintaining the accuracy of\ndiagnostic models in dynamic clinical environments.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}