{"id":"2408.08034","title":"Centralized Network Utility Maximization with Accelerated Gradient\n  Method","authors":"Ying Tian, Zhiliang Wang, Xia Yin, Xingang Shi, Jiahai Yang, Han Zhang","authorsParsed":[["Tian","Ying",""],["Wang","Zhiliang",""],["Yin","Xia",""],["Shi","Xingang",""],["Yang","Jiahai",""],["Zhang","Han",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 09:00:35 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 01:28:25 GMT"}],"updateDate":"2024-08-19","timestamp":1723712435000,"abstract":"  Network utility maximization (NUM) is a well-studied problem for network\ntraffic management and resource allocation. Because of the inherent\ndecentralization and complexity of networks, most researches develop\ndecentralized NUM algorithms. In recent years, the Software Defined Networking\n(SDN) architecture has been widely used, especially in cloud networks and\ninter-datacenter networks managed by large enterprises, promoting the design of\ncentralized NUM algorithms. To cope with the large and increasing number of\nflows in such SDN networks, existing researches about centralized NUM focus on\nthe scalability of the algorithm with respect to the number of flows, however\nthe efficiency is ignored. In this paper, we focus on the SDN scenario, and\nderive a centralized, efficient and scalable algorithm for the NUM problem. By\nthe designing of a smooth utility function and a smooth penalty function, we\nformulate the NUM problem with a smooth objective function, which enables the\nuse of Nesterov's accelerated gradient method. We prove that the proposed\nmethod has $O(d/t^2)$ convergence rate, which is the fastest with respect to\nthe number of iterations $t$, and our method is scalable with respect to the\nnumber of flows $d$ in the network. Experiments show that our method obtains\naccurate solutions with less iterations, and achieves close-to-optimal network\nutility.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"8z07hguH0eYK0hwA29IA1BsmNP0kZ239IThGZcU6LYY","pdfSize":"18309640"}
