{"id":"2408.13764","title":"Strichartz estimates for orthonormal functions and probabilistic\n  convergence of density functions of compact operators on manifolds","authors":"Wei Yan, Jinqiao Duan, Jianhua Huang, Haoyuan Xu, Meihua Yang","authorsParsed":[["Yan","Wei",""],["Duan","Jinqiao",""],["Huang","Jianhua",""],["Xu","Haoyuan",""],["Yang","Meihua",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 08:16:57 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 05:08:00 GMT"}],"updateDate":"2024-09-06","timestamp":1724573817000,"abstract":"  In this paper, we establish some Strichartz estimates for orthonormal\nfunctions and probabilistic convergence of density functions related to compact\noperators on manifolds. Firstly, we present the suitable bound of\n$\\int_{a\\leq|s|\\leq b}e^{isx}s^{-1+i\\gamma}ds$ for the cases $\\gamma \\in\n\\mathbb{R},a\\geq0,b>0,$ $\\gamma \\in \\mathbb{R},\\gamma\\neq0,a,b\\in \\mathbb{R}$\nand $\\gamma \\in \\mathbb{R}$, which extends the result of Page 204 of Vega\n(199-211,IMA Vol. Math. Appl., 42, 1992.) Secondly, we prove that\n$\\left|\\gamma\\int_{a}^{b}e^{isx}s^{-1+i\\gamma}ds\\right|\\leq\nC(1+|\\gamma|)^{2}(\\gamma \\in \\mathbb{R},a,b\\in \\mathbb{R}),$ where $C$ is\nindependent of $\\gamma,a, b$, which extends Lemma 1 of Bez et al. (Forum of\nMathematics, Sigma, 9(2021), 1-52). Thirdly, we extend the result of Theorems\n8, 9 of R. Frank, J. Sabin (Amer. J. Math. 139(2017), 1649-1691.) with the aid\nof the suitable bound of the above complex integrals established in this paper.\nFourthly, we establish the Strichartz estimates for orthonormal functions\nrelated to Boussinesq operator on the real line for both small time interval\nand large time interval and on the torus with small time interval; we also\nestablish the convergence result of some compact operators in Schatten norm.\nFifthly, we establish the convergence result related to nonlinear part of the\nsolution to some operator equations in Schatten spaces. Finally, inspired by\nthe work of Hadama and Yamamoto (Probabilistic Strichartz estimates in Schatten\nclasses and their applications to Hartree equation, arxiv:2311.02713v1.), for\n$\\gamma_{0}\\in \\mathfrak{S}^{2}$, we establish the probabilistic convergence of\ndensity functions of compact operator on manifolds with full randomization,\nwhich improves the result of Corollary 1.2 of Bez et al. (Selecta Math.\n26(2020), 24 pp) in the probabilistic sense.\n","subjects":["Mathematics/Probability","Mathematics/Analysis of PDEs"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"V5QS5xTvbwHU7LYGrXPaTBdTwBjicQk3GyBP2Rwr6Ws","pdfSize":"664105"}
