{"id":"2408.08317","title":"Thermal and microclimatic behavior of OASIS schoolyard paving materials","authors":"Ghid Karam, Ma\\\"ilys Chanial, Arnaud Grados, Martin Hendel (LIED),\n  Laurent Royon","authorsParsed":[["Karam","Ghid","","LIED"],["Chanial","Maïlys","","LIED"],["Grados","Arnaud","","LIED"],["Hendel","Martin","","LIED"],["Royon","Laurent",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 12:13:29 GMT"}],"updateDate":"2024-08-19","timestamp":1722428009000,"abstract":"  As part of its Resilience Strategy, the City of Paris' OASIS program aims to\ncontribute ot its adaptation to heatwaves and climate change by transforming\nschoolyards into climate shelters, namely via desealing and greening. In this\ncontext, a variety of alternative pavement materials have been proposed to\nreplace the initial schoolyard pavement, composed of an asphalt sidewalk\nstructure. In the context of the EU-funded ERDF UIA OASIS project, the thermal\nperformance of these alternative materials and their impact in terms of urban\ncooling was explored. To this aim, five samples of reference and innovative\nschoolyard pavements were studied in the lab under heat-wave conditions.\nAlternative green, biosourced, recycled and reflective pavement solutions were\ncompared to standard fine-aggregate asphalt concrete. Their performance was\nevaluated with regards to their contribution to the urban heat island\nphenomenon and to pedestrian heat stress, account for the typical use schedule\nof schoolyards. Green and biosourced materials were found to perform well for\nboth indicators, while the standard and recycled solutions had poor UHI\nperformance but had limited negative effects on daytime heat stress. The\nreflective pavement had better UHI performance but had high radiosity during\ndaytime which can negatively affect pedestrian heat stress.\n","subjects":["Physics/Physics and Society","Physics/Atmospheric and Oceanic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}