{"id":"2408.05025","title":"Rag and Roll: An End-to-End Evaluation of Indirect Prompt Manipulations\n  in LLM-based Application Frameworks","authors":"Gianluca De Stefano, Lea Sch\\\"onherr, Giancarlo Pellegrino","authorsParsed":[["De Stefano","Gianluca",""],["Schönherr","Lea",""],["Pellegrino","Giancarlo",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 12:26:05 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 13:57:42 GMT"}],"updateDate":"2024-08-13","timestamp":1723206365000,"abstract":"  Retrieval Augmented Generation (RAG) is a technique commonly used to equip\nmodels with out of distribution knowledge. This process involves collecting,\nindexing, retrieving, and providing information to an LLM for generating\nresponses. Despite its growing popularity due to its flexibility and low cost,\nthe security implications of RAG have not been extensively studied. The data\nfor such systems are often collected from public sources, providing an attacker\na gateway for indirect prompt injections to manipulate the responses of the\nmodel. In this paper, we investigate the security of RAG systems against\nend-to-end indirect prompt manipulations. First, we review existing RAG\nframework pipelines, deriving a prototypical architecture and identifying\ncritical parameters. We then examine prior works searching for techniques that\nattackers can use to perform indirect prompt manipulations. Finally, we\nimplemented Rag 'n Roll, a framework to determine the effectiveness of attacks\nagainst end-to-end RAG applications. Our results show that existing attacks are\nmostly optimized to boost the ranking of malicious documents during the\nretrieval phase. However, a higher rank does not immediately translate into a\nreliable attack. Most attacks, against various configurations, settle around a\n40% success rate, which could rise to 60% when considering ambiguous answers as\nsuccessful attacks (those that include the expected benign one as well).\nAdditionally, when using unoptimized documents, attackers deploying two of them\n(or more) for a target query can achieve similar results as those using\noptimized ones. Finally, exploration of the configuration space of a RAG showed\nlimited impact in thwarting the attacks, where the most successful combination\nseverely undermines functionality.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}