{"id":"2408.16893","title":"Exploring Multiple Strategies to Improve Multilingual Coreference\n  Resolution in CorefUD","authors":"Ond\\v{r}ej Pra\\v{z}\\'ak and Miloslav Konop\\'ik","authorsParsed":[["Pražák","Ondřej",""],["Konopík","Miloslav",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 20:27:05 GMT"}],"updateDate":"2024-09-02","timestamp":1724963225000,"abstract":"  Coreference resolution, the task of identifying expressions in text that\nrefer to the same entity, is a critical component in various natural language\nprocessing (NLP) applications. This paper presents our end-to-end neural\ncoreference resolution system, utilizing the CorefUD 1.1 dataset, which spans\n17 datasets across 12 languages. We first establish strong baseline models,\nincluding monolingual and cross-lingual variations, and then propose several\nextensions to enhance performance across diverse linguistic contexts. These\nextensions include cross-lingual training, incorporation of syntactic\ninformation, a Span2Head model for optimized headword prediction, and advanced\nsingleton modeling. We also experiment with headword span representation and\nlong-documents modeling through overlapping segments. The proposed extensions,\nparticularly the heads-only approach, singleton modeling, and long document\nprediction significantly improve performance across most datasets. We also\nperform zero-shot cross-lingual experiments, highlighting the potential and\nlimitations of cross-lingual transfer in coreference resolution. Our findings\ncontribute to the development of robust and scalable coreference systems for\nmultilingual coreference resolution. Finally, we evaluate our model on CorefUD\n1.1 test set and surpass the best model from CRAC 2023 shared task of a\ncomparable size by a large margin. Our nodel is available on GitHub:\n\\url{https://github.com/ondfa/coref-multiling}\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"8Ld6YmjYY1fY5nlJCnqPgMoyfRNTmb-OTaGUCxHGL5E","pdfSize":"883589"}
