{"id":"2408.10664","title":"Federated Clustering: An Unsupervised Cluster-Wise Training for\n  Decentralized Data Distributions","authors":"Mirko Nardi, Lorenzo Valerio, Andrea Passarella","authorsParsed":[["Nardi","Mirko",""],["Valerio","Lorenzo",""],["Passarella","Andrea",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 09:05:44 GMT"}],"updateDate":"2024-08-21","timestamp":1724144744000,"abstract":"  Federated Learning (FL) is a pivotal approach in decentralized machine\nlearning, especially when data privacy is crucial and direct data sharing is\nimpractical. While FL is typically associated with supervised learning, its\npotential in unsupervised scenarios is underexplored. This paper introduces a\nnovel unsupervised federated learning methodology designed to identify the\ncomplete set of categories (global K) across multiple clients within\nlabel-free, non-uniform data distributions, a process known as Federated\nClustering. Our approach, Federated Cluster-Wise Refinement (FedCRef), involves\nclients that collaboratively train models on clusters with similar data\ndistributions. Initially, clients with diverse local data distributions (local\nK) train models on their clusters to generate compressed data representations.\nThese local models are then shared across the network, enabling clients to\ncompare them through reconstruction error analysis, leading to the formation of\nfederated groups.In these groups, clients collaboratively train a shared model\nrepresenting each data distribution, while continuously refining their local\nclusters to enhance data association accuracy. This iterative process allows\nour system to identify all potential data distributions across the network and\ndevelop robust representation models for each. To validate our approach, we\ncompare it with traditional centralized methods, establishing a performance\nbaseline and showcasing the advantages of our distributed solution. We also\nconduct experiments on the EMNIST and KMNIST datasets, demonstrating FedCRef's\nability to refine and align cluster models with actual data distributions,\nsignificantly improving data representation precision in unsupervised federated\nsettings.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8e1I4xRvc4RCuHtNNXLZrjmcnakkUGaCdPCGk4igSQ4","pdfSize":"4719616"}
