{"id":"2408.11536","title":"A white dwarf binary showing sporadic radio pulses at the orbital period","authors":"I. de Ruiter, K.M. Rajwade, C.G. Bassa, A. Rowlinson, R.A.M.J. Wijers,\n  C.D. Kilpatrick, G. Stefansson, J.R. Callingham, J.W.T. Hessels, T.E. Clarke,\n  W. Peters, R.A.D. Wijnands, T.W. Shimwell, S. ter Veen, V. Morello, G.R.\n  Zeimann, S. Mahadevan","authorsParsed":[["de Ruiter","I.",""],["Rajwade","K. M.",""],["Bassa","C. G.",""],["Rowlinson","A.",""],["Wijers","R. A. M. J.",""],["Kilpatrick","C. D.",""],["Stefansson","G.",""],["Callingham","J. R.",""],["Hessels","J. W. T.",""],["Clarke","T. E.",""],["Peters","W.",""],["Wijnands","R. A. D.",""],["Shimwell","T. W.",""],["ter Veen","S.",""],["Morello","V.",""],["Zeimann","G. R.",""],["Mahadevan","S.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 11:26:21 GMT"}],"updateDate":"2024-08-22","timestamp":1724239581000,"abstract":"  Recent observations have revealed rare, previously unknown flashes of cosmic\nradio waves lasting from milliseconds to minutes, and with periodicity of\nminutes to an hour [1-4]. These transient radio signals must originate from\nsources in the Milky Way, and from coherent emission processes in astrophysical\nplasma. They are theorised to be produced in the extreme and highly magnetised\nenvironments around white dwarfs or neutron stars [5-8]. However, the\nastrophysical origin of these signals remains contested, and multiple\nprogenitor models may be needed to explain their diverse properties. Here we\npresent the discovery of a transient radio source, ILT J1101+5521, whose\nroughly minute-long pulses arrive with a periodicity of 125.5 minutes. We find\nthat ILT J1101+5521 is an M dwarf - white dwarf binary system with an orbital\nperiod that matches the period of the radio pulses, which are observed when the\ntwo stars are in conjunction. The binary nature of ILT J1101+5521 establishes\nthat some long-period radio transients originate from orbital motion modulating\nthe observed emission, as opposed to an isolated rotating star. We conclude\nthat ILT J1101+5521 is likely a polar system where magnetic interaction has\nsynchronised the rotational and orbital periods of the white dwarf [9].\nMagnetic interaction and plasma exchange between the two stars may generate the\nsporadic radio emission. Such mechanisms have been previously theorised\n[10-13], but not observationally established.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}