{"id":"2408.07418","title":"Gravitational odd-parity perturbation of a Horndeski hairy black hole:\n  quasinormal mode and parameter constraint","authors":"Zhen-Hao Yang, Yun-He Lei, Xiao-Mei Kuang and Bin Wang","authorsParsed":[["Yang","Zhen-Hao",""],["Lei","Yun-He",""],["Kuang","Xiao-Mei",""],["Wang","Bin",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 09:54:38 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 00:08:52 GMT"}],"updateDate":"2024-09-04","timestamp":1723629278000,"abstract":"  In the binary black hole coalescence, the gravitational wave emitted at the\nringdown stage can be well described within the black hole perturbation theory,\nwhere the quasinormal modes (QNMs) become the important ingredient in modeling\nthe pattern wave form. In general ralativity (GR), the QNMs can be obtained\nfrom solving the Regge-Wheeler equation in static black hole, while in\nHorndeski gravity, the metric perturbation equation can be simplified into a\nmodified Regge-Wheeler equation from the perturbed action. In this paper, we\ncalculate the QNMs frequencies of the gravitational odd-parity perturbation of\na specific hairy black hole in Horndeski gravity with the use of the matrix\nmethod and pseudo spectral method. Our results indicate that such a Horndeski\nhairy black hole is stable under the odd perturbation, which is also verified\nby the time evolution of the perturbation. In particular, we find that for a\ncertain range of the Horndeski hair, the $\\ell>2$ modes become the long-lived\nmode instead of $\\ell=2$ mode in GR. Then, we use the ringdown QNMs to\npreliminarily investigate the signal-to-noise-ratio (SNR) rescaled measurement\nerror of the Horndeski hair. We obtained significant effects of the angular\nmomentum and overtone on the error bound of the hairy parameter. We hope that\nour findings could inspire more theoretical and phenomenal work on the test of\nno-hair theorem of black hole from gravitational wave physics.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"I15SSU4yJBXsk62aRIFOwGZzjHbw8eVX-DEVMGJQNm4","pdfSize":"1676284"}
