{"id":"2408.07849","title":"Molecular gas budget of strongly magnified low-mass star-forming\n  galaxies at cosmic noon","authors":"V. Cat\\'an, J. Gonz\\'alez-L\\'opez, M. Solimano, L. F. Barrientos, A.\n  Afruni, M. Aravena, M. Bayliss, J. A.Hern\\'andez, C. Ledoux, G. Mahler and N.\n  Tejos","authorsParsed":[["Cat치n","V.",""],["Gonz치lez-L칩pez","J.",""],["Solimano","M.",""],["Barrientos","L. F.",""],["Afruni","A.",""],["Aravena","M.",""],["Bayliss","M.",""],["Hern치ndez","J. A.",""],["Ledoux","C.",""],["Mahler","G.",""],["Tejos","N.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 23:21:36 GMT"}],"updateDate":"2024-08-16","timestamp":1723677696000,"abstract":"  This study aims to investigate the molecular gas content of strongly\nmagnified low-mass star-forming galaxies around the cosmic noon period\n($z\\sim2$) through observations of CO emission lines and dust continuum\nemission, both of which serve as tracers for molecular gas. We observed twelve\nstrongly lensed galaxies with the Atacama Compact Array to detect CO mid-j\nrotational transitions and dust continuum. Thanks to the strong lensing, we\nwere able to probe the low-mass regime, previously understudied. With a\ncompiled set of observations, we recalibrate empirical relations between star\nformation rate density and the CO line ratios. Using SED fitting, we derived\ngalaxy properties and performed galaxy stacking to combine the faint signals.\nIn all cases, molecular gas masses were estimated using both tracers. We\ndetected CO emission in three out of 12 galaxies and dust continuum emission in\nthree of them. The obtained molecular gas masses indicate that most of these\ngalaxies ($\\rm{M}_* < 10^{10.7}$ $\\rm{M}_\\odot$) have lower molecular gas\nfractions and shorter depletion times compared to the expectations from\nestablished scaling relations at these redshifts. Several possible explanations\nfor this gas deficit were explored, including uncertainties in mass estimates,\neffects of low metallicity environments, larger atomic gas reservoirs in\nlow-mass systems, and the possibility that these represent low-mass analogs of\n\"main sequence starburst\" galaxies, which are undergoing sustained star\nformation due to gas compaction despite low overall gas fractions. We conclude\nthat there is a molecular gas deficit at these mass and metallicity regimes.\nOur results suggest that this deficit is likely due to a significant amount of\natomic gas, which our stacking indicates is about 91% of the total gas.\nHowever, this estimation might be an upper limit in the case of our galaxies\ncontaining CO-dark gas.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"m0CtP9hj3tf2zAatL4Nbx95XEg4iG25thYK4-L7PIDA","pdfSize":"26785104"}
