{"id":"2408.12993","title":"Assessing the nature of nanoscale ferroelectric domain walls in lead\n  titanate multilayers","authors":"Edoardo Zatterin, Petr Ondrejkovic, Louis Bastogne, C\\'eline\n  Lichtensteiger, Ludovica Tovaglieri, Daniel A. Chaney, Alireza Sasani, Tobias\n  Sch\\\"ulli, Alexei Bosak, Steven Leake, Pavlo Zubko, Philippe Ghosez, Jirka\n  Hlinka, Jean-Marc Triscone, Marios Hadjimichael","authorsParsed":[["Zatterin","Edoardo",""],["Ondrejkovic","Petr",""],["Bastogne","Louis",""],["Lichtensteiger","Céline",""],["Tovaglieri","Ludovica",""],["Chaney","Daniel A.",""],["Sasani","Alireza",""],["Schülli","Tobias",""],["Bosak","Alexei",""],["Leake","Steven",""],["Zubko","Pavlo",""],["Ghosez","Philippe",""],["Hlinka","Jirka",""],["Triscone","Jean-Marc",""],["Hadjimichael","Marios",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 11:22:45 GMT"}],"updateDate":"2024-08-26","timestamp":1724412165000,"abstract":"  The observation of unexpected polarisation textures such as vortices,\nskyrmions and merons in various oxide heterostructures has challenged the\nwidely accepted picture of ferroelectric domain walls as being Ising-like.\nBloch components in the 180{\\deg} domain walls of PbTiO3 have recently been\nreported in PbTiO3/SrTiO3 superlattices and linked to domain wall chirality.\nWhile this opens exciting perspectives, the ubiquitous nature of this Bloch\ncomponent remains to be further explored. In this work, we present a\ncomprehensive investigation of domain walls in PbTiO3/SrTiO3 superlattices,\ninvolving a combination of first- and second-principles calculations,\nphase-field simulations, diffuse scattering calculations, and synchrotron based\ndiffuse x-ray scattering. Our theoretical calculations highlight that the\npreviously predicted Bloch polarisation in the 180{\\deg} domain walls in\nPbTiO3/SrTiO3 superlattices might be more sensitive to the boundary conditions\nthan initially thought and is not always expected to appear. Employing diffuse\nscattering calculations for larger systems we develop a method to probe the\ncomplex structure of domain walls in these superlattices via diffuse x-ray\nscattering measurements. Through this approach, we investigate\ndepolarization-driven ferroelectric polarization rotation at the domain walls.\nOur experimental findings, consistent with our theoretical predictions for\nrealistic domain periods, do not reveal any signatures of a Bloch component in\nthe centres of the 180{\\deg} domain walls of PbTiO3/SrTiO3 superlattices,\nsuggesting that the precise nature of domain walls in the ultrathin PbTiO3\nlayers is more intricate than previously thought and deserves further\nattention.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}