{"id":"2408.00818","title":"Y Social: an LLM-powered Social Media Digital Twin","authors":"Giulio Rossetti and Massimo Stella and R\\'emy Cazabet and Katherine\n  Abramski and Erica Cau and Salvatore Citraro and Andrea Failla and Riccardo\n  Improta and Virginia Morini and Valentina Pansanella","authorsParsed":[["Rossetti","Giulio",""],["Stella","Massimo",""],["Cazabet","Rémy",""],["Abramski","Katherine",""],["Cau","Erica",""],["Citraro","Salvatore",""],["Failla","Andrea",""],["Improta","Riccardo",""],["Morini","Virginia",""],["Pansanella","Valentina",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 17:16:21 GMT"}],"updateDate":"2024-08-05","timestamp":1722532581000,"abstract":"  In this paper we introduce Y, a new-generation digital twin designed to\nreplicate an online social media platform. Digital twins are virtual replicas\nof physical systems that allow for advanced analyses and experimentation. In\nthe case of social media, a digital twin such as Y provides a powerful tool for\nresearchers to simulate and understand complex online interactions. {\\tt Y}\nleverages state-of-the-art Large Language Models (LLMs) to replicate\nsophisticated agent behaviors, enabling accurate simulations of user\ninteractions, content dissemination, and network dynamics. By integrating these\naspects, Y offers valuable insights into user engagement, information spread,\nand the impact of platform policies. Moreover, the integration of LLMs allows Y\nto generate nuanced textual content and predict user responses, facilitating\nthe study of emergent phenomena in online environments.\n  To better characterize the proposed digital twin, in this paper we describe\nthe rationale behind its implementation, provide examples of the analyses that\ncan be performed on the data it enables to be generated, and discuss its\nrelevance for multidisciplinary research.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/"}