{"id":"2408.01264","title":"Quantum Delocalization of a Levitated Nanoparticle","authors":"Massimiliano Rossi, Andrei Militaru, Nicola Carlon Zambon, Andreu\n  Riera-Campeny, Oriol Romero-Isart, Martin Frimmer, Lukas Novotny","authorsParsed":[["Rossi","Massimiliano",""],["Militaru","Andrei",""],["Zambon","Nicola Carlon",""],["Riera-Campeny","Andreu",""],["Romero-Isart","Oriol",""],["Frimmer","Martin",""],["Novotny","Lukas",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 13:36:42 GMT"}],"updateDate":"2024-08-05","timestamp":1722605802000,"abstract":"  Every massive particle behaves like a wave, according to quantum physics.\nYet, this characteristic wave nature has only been observed in double-slit\nexperiments with microscopic systems, such as atoms and molecules. The key\naspect is that the wavefunction describing the motion of these systems extends\ncoherently over a distance comparable to the slit separation, much larger than\nthe size of the system itself. Preparing these states of more massive and\ncomplex objects remains an outstanding challenge. While the motion of\nsolid-state oscillators can now be controlled at the level of single quanta,\ntheir coherence length remains comparable to the zero-point motion, limited to\nsubatomic distances. Here, we prepare a delocalized state of a levitating\nsolid-state nanosphere with coherence length exceeding the zero-point motion.\nWe first cool its motion to the ground state. Then, by modulating the stiffness\nof the confinement potential, we achieve more than a threefold increment of the\ninitial coherence length with minimal added noise. Optical levitation gives us\nthe necessary control over the confinement that other mechanical platforms\nlack. Our work is a stepping stone towards the generation of delocalization\nscales comparable to the object size, a crucial regime for macroscopic quantum\nexperiments, and towards quantum-enhanced force sensing with levitated\nparticles.\n","subjects":["Physics/Quantum Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Y0clB8WMX2sK9g9r5-0O4LdehPOC7tz6PXkcAUQpRnI","pdfSize":"6026365","txDigest":"D78QQeozuEhoUD2MkBLuQ2bV7oV41NWxN8nuosaShR5e","endEpoch":"1","status":"CERTIFIED"}
