{"id":"2408.10820","title":"CMB Implications of Multi-field Axio-dilaton Cosmology","authors":"Adam Smith, Maria Mylova, Philippe Brax, Carsten van de Bruck, C.P.\n  Burgess, Anne-Christine Davis","authorsParsed":[["Smith","Adam",""],["Mylova","Maria",""],["Brax","Philippe",""],["van de Bruck","Carsten",""],["Burgess","C. P.",""],["Davis","Anne-Christine",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 13:14:32 GMT"},{"version":"v2","created":"Fri, 6 Sep 2024 16:36:57 GMT"}],"updateDate":"2024-09-09","timestamp":1724159672000,"abstract":"  Axio-dilaton models are among the simplest scalar-tensor theories that\ncontain the two-derivative interactions that naturally compete at low energies\nwith the two-derivative inter-actions of General Relativity. Such models are\nwell-motivated as the low energy fields arising from string theory\ncompactification. We summarize these motivations and compute their cosmological\nevolution, in which the dilaton acts as dark energy and its evolution provides\na framework for dynamically evolving particle masses. The derivative\naxion-dilaton couplings play an important role in the success of these\ncosmologies. We derive the equations for fluctuations needed to study their\nimplications for the CMB anisotropy, matter spectra and structure growth. We\nuse a modified Boltzmann code to study in detail four benchmark parameter\nchoices, including the vanilla Yoga model, and identify couplings that give\nviable cosmologies, including some with surprisingly large matter-scalar\ninteractions. The axion has negligible potential for most of the cosmologies we\nconsider but we also examine a simplified model for which the axion potential\nplays a role, using axion-matter couplings motivated by phenomenological\nscreening considerations. We find such choices can also lead to viable\ncosmologies.\n","subjects":["Physics/High Energy Physics - Theory","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}