{"id":"2408.15886","title":"Enhancing Intrusion Detection in IoT Environments: An Advanced Ensemble\n  Approach Using Kolmogorov-Arnold Networks","authors":"Amar Amouri, Mohamad Mahmoud Al Rahhal, Yakoub Bazi, Ismail Butun,\n  Imad Mahgoub","authorsParsed":[["Amouri","Amar",""],["Rahhal","Mohamad Mahmoud Al",""],["Bazi","Yakoub",""],["Butun","Ismail",""],["Mahgoub","Imad",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 15:58:49 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 15:54:31 GMT"}],"updateDate":"2024-08-30","timestamp":1724860729000,"abstract":"  In recent years, the evolution of machine learning techniques has\nsignificantly impacted the field of intrusion detection, particularly within\nthe context of the Internet of Things (IoT). As IoT networks expand, the need\nfor robust security measures to counteract potential threats has become\nincreasingly critical. This paper introduces a hybrid Intrusion Detection\nSystem (IDS) that synergistically combines Kolmogorov-Arnold Networks (KANs)\nwith the XGBoost algorithm. Our proposed IDS leverages the unique capabilities\nof KANs, which utilize learnable activation functions to model complex\nrelationships within data, alongside the powerful ensemble learning techniques\nof XGBoost, known for its high performance in classification tasks. This hybrid\napproach not only enhances the detection accuracy but also improves the\ninterpretability of the model, making it suitable for dynamic and intricate IoT\nenvironments. Experimental evaluations demonstrate that our hybrid IDS achieves\nan impressive detection accuracy exceeding 99% in distinguishing between benign\nand malicious activities. Additionally, we were able to achieve F1 scores,\nprecision, and recall that exceeded 98%. Furthermore, we conduct a comparative\nanalysis against traditional Multi-Layer Perceptron (MLP) networks, assessing\nperformance metrics such as Precision, Recall, and F1-score. The results\nunderscore the efficacy of integrating KANs with XGBoost, highlighting the\npotential of this innovative approach to significantly strengthen the security\nframework of IoT networks.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"7DbaOMGhBeZlwgfA8m6J23SS0uaP2thzsQB1GHkgNpA","pdfSize":"393538"}
