{"id":"2408.03464","title":"AI Foundation Models in Remote Sensing: A Survey","authors":"Siqi Lu, Junlin Guo, James R Zimmer-Dauphinee, Jordan M Nieusma, Xiao\n  Wang, Parker VanValkenburgh, Steven A Wernke, Yuankai Huo","authorsParsed":[["Lu","Siqi",""],["Guo","Junlin",""],["Zimmer-Dauphinee","James R",""],["Nieusma","Jordan M",""],["Wang","Xiao",""],["VanValkenburgh","Parker",""],["Wernke","Steven A",""],["Huo","Yuankai",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 22:39:34 GMT"}],"updateDate":"2024-08-08","timestamp":1722983974000,"abstract":"  Artificial Intelligence (AI) technologies have profoundly transformed the\nfield of remote sensing, revolutionizing data collection, processing, and\nanalysis. Traditionally reliant on manual interpretation and task-specific\nmodels, remote sensing has been significantly enhanced by the advent of\nfoundation models--large-scale, pre-trained AI models capable of performing a\nwide array of tasks with unprecedented accuracy and efficiency. This paper\nprovides a comprehensive survey of foundation models in the remote sensing\ndomain, covering models released between June 2021 and June 2024. We categorize\nthese models based on their applications in computer vision and domain-specific\ntasks, offering insights into their architectures, pre-training datasets, and\nmethodologies. Through detailed performance comparisons, we highlight emerging\ntrends and the significant advancements achieved by these foundation models.\nAdditionally, we discuss the technical challenges, practical implications, and\nfuture research directions, addressing the need for high-quality data,\ncomputational resources, and improved model generalization. Our research also\nfinds that pre-training methods, particularly self-supervised learning\ntechniques like contrastive learning and masked autoencoders, significantly\nenhance the performance and robustness of foundation models in remote sensing\ntasks such as scene classification, object detection, and other applications.\nThis survey aims to serve as a resource for researchers and practitioners by\nproviding a panorama of advances and promising pathways for continued\ndevelopment and application of foundation models in remote sensing.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}