{"id":"2408.16580","title":"Schwarz methods with PMLs for Helmholtz problems: fast convergence at\n  high frequency","authors":"Jeffrey Galkowski, Shihua Gong, Ivan G. Graham, David Lafontaine, Euan\n  A. Spence","authorsParsed":[["Galkowski","Jeffrey",""],["Gong","Shihua",""],["Graham","Ivan G.",""],["Lafontaine","David",""],["Spence","Euan A.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 14:44:28 GMT"}],"updateDate":"2024-08-30","timestamp":1724942668000,"abstract":"  We discuss parallel (additive) and sequential (multiplicative) variants of\noverlapping Schwarz methods for the Helmholtz equation in $\\mathbb{R}^d$, with\nlarge real wavenumber and smooth variable wave speed. The radiation condition\nis approximated by a Cartesian perfectly-matched layer (PML). The\ndomain-decomposition subdomains are overlapping hyperrectangles with Cartesian\nPMLs at their boundaries. In a recent paper ({\\tt arXiv:2404.02156}), the\ncurrent authors proved (for both variants) that, after a specified number of\niterations -- depending on the behaviour of the geometric-optic rays -- the\nerror is smooth and smaller than any negative power of the wavenumber $k$. For\nthe parallel method, the specified number of iterations is less than the\nmaximum number of subdomains, counted with their multiplicity, that a\ngeometric-optic ray can intersect. The theory, which is given at the continuous\nlevel and makes essential use of semi-classical analysis, assumes that the\noverlaps of the subdomains and the widths of the PMLs are all independent of\nthe wavenumber. In this paper we extend the results of {\\tt arXiv:2404.02156}\nby experimentally studying the behaviour of the methods in the practically\nimportant case when both the overlap and the PML width decrease as the\nwavenumber increases. We find that (at least for constant wavespeed), the\nmethods remain robust to increasing $k$, even for miminal overlap, when the PML\nis one wavelength wide.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/"}