{"id":"2408.07913","title":"A Systematic Mapping Study of Crowd Knowledge Enhanced Software\n  Engineering Research Using Stack Overflow","authors":"Minaoar Tanzil, Shaiful Chowdhury, Somayeh Modaberi, Gias Uddin and\n  Hadi Hemmati","authorsParsed":[["Tanzil","Minaoar",""],["Chowdhury","Shaiful",""],["Modaberi","Somayeh",""],["Uddin","Gias",""],["Hemmati","Hadi",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 03:40:44 GMT"}],"updateDate":"2024-08-16","timestamp":1723693244000,"abstract":"  Developers continuously interact in crowd-sourced community-based\nquestion-answer (Q&A) sites. Reportedly, 30% of all software professionals\nvisit the most popular Q&A site StackOverflow (SO) every day. Software\nengineering (SE) research studies are also increasingly using SO data. To find\nout the trend, implication, impact, and future research potential utilizing SO\ndata, a systematic mapping study needs to be conducted. Following a rigorous\nreproducible mapping study approach, from 18 reputed SE journals and\nconferences, we collected 384 SO-based research articles and categorized them\ninto 10 facets (i.e., themes). We found that SO contributes to 85% of SE\nresearch compared with popular Q&A sites such as Quora, and Reddit. We found\nthat 18 SE domains directly benefited from SO data whereas Recommender Systems,\nand API Design and Evolution domains use SO data the most (15% and 16% of all\nSO-based research studies, respectively). API Design and Evolution, and Machine\nLearning with/for SE domains have consistent upward publication. Deep Learning\nBug Analysis and Code Cloning research areas have the highest potential\nresearch impact recently. With the insights, recommendations, and facet-based\ncategorized paper list from this mapping study, SE researchers can find\npotential research areas according to their interest to utilize large-scale SO\ndata.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PTqvlguzAFhA4raGpy2QDMxPYvVcIFaGqfTRZid7sLk","pdfSize":"901811"}
