{"id":"2408.05058","title":"Variational Bayesian Phylogenetic Inference with Semi-implicit Branch\n  Length Distributions","authors":"Tianyu Xie, Frederick A. Matsen IV, Marc A. Suchard, Cheng Zhang","authorsParsed":[["Xie","Tianyu",""],["Matsen","Frederick A.","IV"],["Suchard","Marc A.",""],["Zhang","Cheng",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 13:29:08 GMT"}],"updateDate":"2024-08-12","timestamp":1723210148000,"abstract":"  Reconstructing the evolutionary history relating a collection of molecular\nsequences is the main subject of modern Bayesian phylogenetic inference.\nHowever, the commonly used Markov chain Monte Carlo methods can be inefficient\ndue to the complicated space of phylogenetic trees, especially when the number\nof sequences is large. An alternative approach is variational Bayesian\nphylogenetic inference (VBPI) which transforms the inference problem into an\noptimization problem. While effective, the default diagonal lognormal\napproximation for the branch lengths of the tree used in VBPI is often\ninsufficient to capture the complexity of the exact posterior. In this work, we\npropose a more flexible family of branch length variational posteriors based on\nsemi-implicit hierarchical distributions using graph neural networks. We show\nthat this semi-implicit construction emits straightforward permutation\nequivariant distributions, and therefore can handle the non-Euclidean branch\nlength space across different tree topologies with ease. To deal with the\nintractable marginal probability of semi-implicit variational distributions, we\ndevelop several alternative lower bounds for stochastic optimization. We\ndemonstrate the effectiveness of our proposed method over baseline methods on\nbenchmark data examples, in terms of both marginal likelihood estimation and\nbranch length posterior approximation.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9DrBbBzGWTXDOBMM0ZtyWcM6_JgSKC1RNTmmjCadqKo","pdfSize":"5343071"}
