{"id":"2408.04724","title":"Performance Analysis of FAS-Aided NOMA-ISAC: A Backscattering Scenario","authors":"Farshad Rostami Ghadi, Kai-Kit Wong, F. Javier Lopez-Martinez,\n  Hyundong Shin, and Lajos Hanzo","authorsParsed":[["Ghadi","Farshad Rostami",""],["Wong","Kai-Kit",""],["Lopez-Martinez","F. Javier",""],["Shin","Hyundong",""],["Hanzo","Lajos",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 18:47:31 GMT"}],"updateDate":"2024-08-12","timestamp":1723142851000,"abstract":"  This paper investigates a two-user downlink system for integrated sensing and\ncommunication (ISAC) in which the two users deploy a fluid antenna system (FAS)\nand adopt the nonorthogonal multiple access (NOMA) strategy. Specifically, the\nintegrated sensing and backscatter communication (ISABC) model is considered,\nwhere a dual-functional base station (BS) serves to communicate the two users\nand sense a tag's surrounding. In contrast to conventional ISAC, the\nbackscattering tag reflects the signals transmitted by the BS to the NOMA users\nand enhances their communication performance. Furthermore, the BS extracts\nenvironmental information from the same backscatter signal in the sensing\nstage. Firstly, we derive closed-form expressions for both the cumulative\ndistribution function (CDF) and probability density function (PDF) of the\nequivalent channel at the users utilizing the moment matching method and the\nGaussian copula. Then in the communication stage, we obtain closed-form\nexpressions for both the outage probability and for the corresponding\nasymptotic expressions in the high signal-to-noise ratio (SNR) regime.\nMoreover, using numerical integration techniques such as the Gauss-Laguerre\nquadrature (GLQ), we have series-form expressions for the user ergodic\ncommunication rates (ECRs). In addition, we get a closed-form expression for\nthe ergodic sensing rate (ESR) using the Cramer-Rao lower bound (CRLB).\nFinally, the accuracy of our analytical results is validated numerically, and\nwe confirm the superiority of employing FAS over traditional fixed-position\nantenna systems in both ISAC and ISABC.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}