{"id":"2408.05849","title":"An End-to-End Model for Time Series Classification In the Presence of\n  Missing Values","authors":"Pengshuai Yao, Mengna Liu, Xu Cheng, Fan Shi, Huan Li, Xiufeng Liu,\n  Shengyong Chen","authorsParsed":[["Yao","Pengshuai",""],["Liu","Mengna",""],["Cheng","Xu",""],["Shi","Fan",""],["Li","Huan",""],["Liu","Xiufeng",""],["Chen","Shengyong",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 19:39:12 GMT"}],"updateDate":"2024-08-13","timestamp":1723405152000,"abstract":"  Time series classification with missing data is a prevalent issue in time\nseries analysis, as temporal data often contain missing values in practical\napplications. The traditional two-stage approach, which handles imputation and\nclassification separately, can result in sub-optimal performance as label\ninformation is not utilized in the imputation process. On the other hand, a\none-stage approach can learn features under missing information, but feature\nrepresentation is limited as imputed errors are propagated in the\nclassification process. To overcome these challenges, this study proposes an\nend-to-end neural network that unifies data imputation and representation\nlearning within a single framework, allowing the imputation process to take\nadvantage of label information. Differing from previous methods, our approach\nplaces less emphasis on the accuracy of imputation data and instead prioritizes\nclassification performance. A specifically designed multi-scale feature\nlearning module is implemented to extract useful information from the\nnoise-imputation data. The proposed model is evaluated on 68 univariate time\nseries datasets from the UCR archive, as well as a multivariate time series\ndataset with various missing data ratios and 4 real-world datasets with missing\ninformation. The results indicate that the proposed model outperforms\nstate-of-the-art approaches for incomplete time series classification,\nparticularly in scenarios with high levels of missing data.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6j4IAkG6EngiuzBV9Hvm8o1KDbPd7l3XMPVZQe7uaaI","pdfSize":"1140048"}
