{"id":"2408.09554","title":"Screen Them All: High-Throughput Pan-Cancer Genetic and Phenotypic\n  Biomarker Screening from H&E Whole Slide Images","authors":"Yi Kan Wang, Ludmila Tydlitatova, Jeremy D. Kunz, Gerard Oakley, Ran\n  A. Godrich, Matthew C. H. Lee, Chad Vanderbilt, Razik Yousfi, Thomas Fuchs,\n  David S. Klimstra, Siqi Liu","authorsParsed":[["Wang","Yi Kan",""],["Tydlitatova","Ludmila",""],["Kunz","Jeremy D.",""],["Oakley","Gerard",""],["Godrich","Ran A.",""],["Lee","Matthew C. H.",""],["Vanderbilt","Chad",""],["Yousfi","Razik",""],["Fuchs","Thomas",""],["Klimstra","David S.",""],["Liu","Siqi",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 17:44:00 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 12:47:35 GMT"}],"updateDate":"2024-08-21","timestamp":1724003040000,"abstract":"  Many molecular alterations serve as clinically prognostic or\ntherapy-predictive biomarkers, typically detected using single or multi-gene\nmolecular assays. However, these assays are expensive, tissue destructive and\noften take weeks to complete. Using AI on routine H&E WSIs offers a fast and\neconomical approach to screen for multiple molecular biomarkers. We present a\nhigh-throughput AI-based system leveraging Virchow2, a foundation model\npre-trained on 3 million slides, to interrogate genomic features previously\ndetermined by an next-generation sequencing (NGS) assay, using 47,960 scanned\nhematoxylin and eosin (H&E) whole slide images (WSIs) from 38,984 cancer\npatients. Unlike traditional methods that train individual models for each\nbiomarker or cancer type, our system employs a unified model to simultaneously\npredict a wide range of clinically relevant molecular biomarkers across cancer\ntypes. By training the network to replicate the MSK-IMPACT targeted biomarker\npanel of 505 genes, it identified 80 high performing biomarkers with a mean\nAU-ROC of 0.89 in 15 most common cancer types. In addition, 40 biomarkers\ndemonstrated strong associations with specific cancer histologic subtypes.\nFurthermore, 58 biomarkers were associated with targets frequently assayed\nclinically for therapy selection and response prediction. The model can also\npredict the activity of five canonical signaling pathways, identify defects in\nDNA repair mechanisms, and predict genomic instability measured by tumor\nmutation burden, microsatellite instability (MSI), and chromosomal instability\n(CIN). The proposed model can offer potential to guide therapy selection,\nimprove treatment efficacy, accelerate patient screening for clinical trials\nand provoke the interrogation of new therapeutic targets.\n","subjects":["Quantitative Biology/Quantitative Methods","Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}