{"id":"2408.08710","title":"Magnetophotonic waveguide nanostructure for selective ultrafast optical\n  excitation of high-K spin dynamics","authors":"Savelii V. Lutsenko, Anastasia E. Khramova, Daria O. Ignatyeva, Daniil\n  V. Konkov, Natalia S. Kaurova, Anatoly A. Syrov, Alexander L. Kudryashov,\n  Grigory N. Goltsman, Vladimir N. Berzhansky, Vladimir I. Belotelov","authorsParsed":[["Lutsenko","Savelii V.",""],["Khramova","Anastasia E.",""],["Ignatyeva","Daria O.",""],["Konkov","Daniil V.",""],["Kaurova","Natalia S.",""],["Syrov","Anatoly A.",""],["Kudryashov","Alexander L.",""],["Goltsman","Grigory N.",""],["Berzhansky","Vladimir N.",""],["Belotelov","Vladimir I.",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 12:46:19 GMT"}],"updateDate":"2024-08-19","timestamp":1723812379000,"abstract":"  Optomagnonics provides a promising method of a Joule-loss-free spin control\nthat can be performed at ultrafast timescale. However, the cornerstone of\noptomagnonics is impossibility to focus the light tighter than a diffraction\nlimit. This constrains minimal size of the optically switched magnetic bits and\nminimal wavelengths of the optically excited spin waves in optomagnonic devices\nthus preventing its further progress. Here we propose and experimentally\ndemonstrate a novel method of the selective optical excitation of the short\nexchange spin waves by using a specially designed magnetophotonic grating. This\nmethod is based on the creation of the sign-changing profile of the inverse\nFaraday effect (IFE) induced in a magnetic film due to excitation of the\noptical guided TE-mode by a femtosecond laser pulse. The spatial period of the\nIFE profile is subdiffractive which allows to launch narrow band short spin\nwaves whose wavelengths are around 300 nm as was experimentally demonstrated\nand potentially can be made down to ~ 100 nm. This opens new horizons for\noptomagnetic applications that are wide ranging, from logical elements to data\nprocessing devices.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"p6gBIlg6YgvxpFi05UnoiiKBa8u4UK7OLyzbGkerQ8M","pdfSize":"7093143"}
