{"id":"2408.08435","title":"Automated Design of Agentic Systems","authors":"Shengran Hu, Cong Lu, Jeff Clune","authorsParsed":[["Hu","Shengran",""],["Lu","Cong",""],["Clune","Jeff",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 21:59:23 GMT"}],"updateDate":"2024-08-19","timestamp":1723759163000,"abstract":"  Researchers are investing substantial effort in developing powerful\ngeneral-purpose agents, wherein Foundation Models are used as modules within\nagentic systems (e.g. Chain-of-Thought, Self-Reflection, Toolformer). However,\nthe history of machine learning teaches us that hand-designed solutions are\neventually replaced by learned solutions. We formulate a new research area,\nAutomated Design of Agentic Systems (ADAS), which aims to automatically create\npowerful agentic system designs, including inventing novel building blocks\nand/or combining them in new ways. We further demonstrate that there is an\nunexplored yet promising approach within ADAS where agents can be defined in\ncode and new agents can be automatically discovered by a meta agent programming\never better ones in code. Given that programming languages are Turing Complete,\nthis approach theoretically enables the learning of any possible agentic\nsystem: including novel prompts, tool use, control flows, and combinations\nthereof. We present a simple yet effective algorithm named Meta Agent Search to\ndemonstrate this idea, where a meta agent iteratively programs interesting new\nagents based on an ever-growing archive of previous discoveries. Through\nextensive experiments across multiple domains including coding, science, and\nmath, we show that our algorithm can progressively invent agents with novel\ndesigns that greatly outperform state-of-the-art hand-designed agents.\nImportantly, we consistently observe the surprising result that agents invented\nby Meta Agent Search maintain superior performance even when transferred across\ndomains and models, demonstrating their robustness and generality. Provided we\ndevelop it safely, our work illustrates the potential of an exciting new\nresearch direction toward automatically designing ever-more powerful agentic\nsystems to benefit humanity.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bQF1w7TUBlvZohB4FJS5DJ8gV57gmtafOi5f5AcyERc","pdfSize":"1088046"}
