{"id":"2408.12485","title":"Spectral Mechanisms of Solid/Liquid Interfacial Heat Transfer in the\n  Presence of a Meniscus","authors":"Abdullah El-Rifai, Liudmyla Klochko, Sreehari Perumanath, David\n  Lacroix, Rohit Pillai, and Mykola Isaiev","authorsParsed":[["El-Rifai","Abdullah",""],["Klochko","Liudmyla",""],["Perumanath","Sreehari",""],["Lacroix","David",""],["Pillai","Rohit",""],["Isaiev","Mykola",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 15:26:02 GMT"}],"updateDate":"2024-08-23","timestamp":1724340362000,"abstract":"  In this study, we employ molecular simulations to investigate the enhancement\nin thermal conductance at the solid/liquid interface in the presence of a\nmeniscus reported previously (Klochko et al., Phys. Chem. Chem. Phys.\n25(4):3298-3308, 2023). We vary the solid/liquid interaction strength at\nLennard-Jones interfaces for both confined liquid and meniscus systems, finding\nthat the presence of a meniscus yields an enhancement in the interfacial\nthermal conductance across all wettabilities. However, the magnitude of the\nenhancement is found to depend on the surface wettability, initially rising\nmonotonously for low to moderate wettabilities, followed by a sharp rise\nbetween moderate and high wettabilities. The spectral decomposition of heat\nflux formalism was applied to understand the nature of this phenomenon further.\nBy computing the in-plane and out-of-plane components of the heat fluxes within\nboth the interfacial solid and liquid, we show that the initial monotonous rise\nin conductance enhancement predominantly stems from a rise in the coupling of\nout-of-plane vibrations within both the solid and the liquid. In contrast, the\nsubsequent sharp rise at more wetting interfaces is linked to sharp increases\nin the utilization of the in-plane modes of the solid and liquid. These\nobservations result from the interplay between the solid/liquid adhesive forces\nand the liquid/vapor interfacial tension. Our results can aid engineers in\noptimizing thermal transport at realistic interfaces, which is critical to\ndesigning effective cooling solutions for electronics, among other\napplications.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"RD2ou4xwKKQEvzEhX9OX0nA11NgG7fpkLblB634VnXI","pdfSize":"6761583"}
