{"id":"2408.16197","title":"Economic Optimal Power Management of Second-Life Battery Energy Storage\n  Systems","authors":"Amir Farakhor, Di Wu, Pingen Chen, Junmin Wang, Yebin Wang, Huazhen\n  Fang","authorsParsed":[["Farakhor","Amir",""],["Wu","Di",""],["Chen","Pingen",""],["Wang","Junmin",""],["Wang","Yebin",""],["Fang","Huazhen",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 01:32:23 GMT"}],"updateDate":"2024-08-30","timestamp":1724895143000,"abstract":"  Second-life battery energy storage systems (SL-BESS) are an economical means\nof long-duration grid energy storage. They utilize retired battery packs from\nelectric vehicles to store and provide electrical energy at the utility scale.\nHowever, they pose critical challenges in achieving optimal utilization and\nextending their remaining useful life. These complications primarily result\nfrom the constituent battery packs' inherent heterogeneities in terms of their\nsize, chemistry, and degradation. This paper proposes an economic optimal power\nmanagement approach to ensure the cost-minimized operation of SL-BESS while\nadhering to safety regulations and maintaining a balance between the power\nsupply and demand. The proposed approach takes into account the costs\nassociated with the degradation, energy loss, and decommissioning of the\nbattery packs. In particular, we capture the degradation costs of the retired\nbattery packs through a weighted average Ah-throughput aging model. The\npresented model allows us to quantify the capacity fading for second-life\nbattery packs for different operating temperatures and C-rates. To evaluate the\nperformance of the proposed approach, we conduct extensive simulations on a\nSL-BESS consisting of various heterogeneous retired battery packs in the\ncontext of grid operation. The results offer novel insights into SL-BESS\noperation and highlight the importance of prudent power management to ensure\neconomically optimal utilization.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}