{"id":"2408.15531","title":"Multi-component multi-scale hydrodynamic plasma flow models in\n  mechanical and thermal disequilibria","authors":"Chao Zhang","authorsParsed":[["Zhang","Chao",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 04:38:12 GMT"}],"updateDate":"2024-08-29","timestamp":1724819892000,"abstract":"  The present work is motivated by the mixing mechanism in inertial confinement\nfusion (ICF), which remarkably degrades the ignition performance. The mixing is\na direct result of velocity disequilibrium and affected by temperature\ndisequilibrium.To deal with these disequilibria, we propose a\nfully-disequilibrium hydrodynamic model (termed as Baer-Nunziato-Zeldovich\nmodel or BNZ model) with 9 equations, 4 temperatures (two for ions, and two for\nelectrons), 4 pressures (two for ions, and two for electrons) and 2 ion\nvelocities for two-component dense plasma flows. The model can be used for\ndescribing both grain and atomic mixing by choosing corresponding relaxation\nmechanism. The derivation starts from a multi-component conservative\nentropy-dissipative Bhatnagar-Gross-Krook (BGK) model to obtain a 14-equation\nmodel. It is then reduced to more practical 9-equation BNZ model and further to\nsimpler 8-equation model, 6-equation model (the Kapila-Zeldovich model or the\nKZ model), and the 5-equation model. The reductions are performed on the basis\nof various relaxation time evaluations, the plasma neutrality and the smallness\nof the electron mass. The models are thermodynamics-compatible, and capable of\ndealing with mechanical and thermal disequilibria at both atomic and grain\nscales. Moreover, the corresponding hydrodynamic subsystems are shown to be\nhyperbolic and solved with the Godunov finite volume method. The BNZ model and\nsolution methods are verified and validated by some benchmark problems and\n1D-2D comparisons. We then consider the velocity, pressure and temperature\ndisequilibria during the passage of an ablation shock in ICF.\n","subjects":["Physics/Plasma Physics","Mathematics/Analysis of PDEs"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}