{"id":"2408.05926","title":"BI-MDRG: Bridging Image History in Multimodal Dialogue Response\n  Generation","authors":"Hee Suk Yoon, Eunseop Yoon, Joshua Tian Jin Tee, Kang Zhang, Yu-Jung\n  Heo, Du-Seong Chang, Chang D. Yoo","authorsParsed":[["Yoon","Hee Suk",""],["Yoon","Eunseop",""],["Tee","Joshua Tian Jin",""],["Zhang","Kang",""],["Heo","Yu-Jung",""],["Chang","Du-Seong",""],["Yoo","Chang D.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 05:22:42 GMT"}],"updateDate":"2024-08-13","timestamp":1723440162000,"abstract":"  Multimodal Dialogue Response Generation (MDRG) is a recently proposed task\nwhere the model needs to generate responses in texts, images, or a blend of\nboth based on the dialogue context. Due to the lack of a large-scale dataset\nspecifically for this task and the benefits of leveraging powerful pre-trained\nmodels, previous work relies on the text modality as an intermediary step for\nboth the image input and output of the model rather than adopting an end-to-end\napproach. However, this approach can overlook crucial information about the\nimage, hindering 1) image-grounded text response and 2) consistency of objects\nin the image response. In this paper, we propose BI-MDRG that bridges the\nresponse generation path such that the image history information is utilized\nfor enhanced relevance of text responses to the image content and the\nconsistency of objects in sequential image responses. Through extensive\nexperiments on the multimodal dialogue benchmark dataset, we show that BI-MDRG\ncan effectively increase the quality of multimodal dialogue. Additionally,\nrecognizing the gap in benchmark datasets for evaluating the image consistency\nin multimodal dialogue, we have created a curated set of 300 dialogues\nannotated to track object consistency across conversations.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}