{"id":"2408.02966","title":"Fast Point Cloud Geometry Compression with Context-based Residual Coding\n  and INR-based Refinement","authors":"Hao Xu, Xi Zhang, Xiaolin Wu","authorsParsed":[["Xu","Hao",""],["Zhang","Xi",""],["Wu","Xiaolin",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 05:24:06 GMT"}],"updateDate":"2024-08-07","timestamp":1722921846000,"abstract":"  Compressing a set of unordered points is far more challenging than\ncompressing images/videos of regular sample grids, because of the difficulties\nin characterizing neighboring relations in an irregular layout of points. Many\nresearchers resort to voxelization to introduce regularity, but this approach\nsuffers from quantization loss. In this research, we use the KNN method to\ndetermine the neighborhoods of raw surface points. This gives us a means to\ndetermine the spatial context in which the latent features of 3D points are\ncompressed by arithmetic coding. As such, the conditional probability model is\nadaptive to local geometry, leading to significant rate reduction.\nAdditionally, we propose a dual-layer architecture where a non-learning base\nlayer reconstructs the main structures of the point cloud at low complexity,\nwhile a learned refinement layer focuses on preserving fine details. This\ndesign leads to reductions in model complexity and coding latency by two orders\nof magnitude compared to SOTA methods. Moreover, we incorporate an implicit\nneural representation (INR) into the refinement layer, allowing the decoder to\nsample points on the underlying surface at arbitrary densities. This work is\nthe first to effectively exploit content-aware local contexts for compressing\nirregular raw point clouds, achieving high rate-distortion performance, low\ncomplexity, and the ability to function as an arbitrary-scale upsampling\nnetwork simultaneously.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}