{"id":"2408.11828","title":"Online Electric Vehicle Charging Detection Based on Memory-based\n  Transformer using Smart Meter Data","authors":"Ammar Mansoor Kamoona, Hui Song, Mahdi Jalili, Hao Wang, Reza Razzaghi\n  and Xinghuo Yu","authorsParsed":[["Kamoona","Ammar Mansoor",""],["Song","Hui",""],["Jalili","Mahdi",""],["Wang","Hao",""],["Razzaghi","Reza",""],["Yu","Xinghuo",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 03:19:14 GMT"}],"updateDate":"2024-08-23","timestamp":1722914354000,"abstract":"  The growing popularity of Electric Vehicles (EVs) poses unique challenges for\ngrid operators and infrastructure, which requires effectively managing these\nvehicles' integration into the grid. Identification of EVs charging is\nessential to electricity Distribution Network Operators (DNOs) for better\nplanning and managing the distribution grid. One critical aspect is the ability\nto accurately identify the presence of EV charging in the grid. EV charging\nidentification using smart meter readings obtained from behind-the-meter\ndevices is a challenging task that enables effective managing the integration\nof EVs into the existing power grid. Different from the existing supervised\nmodels that require addressing the imbalance problem caused by EVs and non-EVs\ndata, we propose a novel unsupervised memory-based transformer (M-TR) that can\nrun in real-time (online) to detect EVs charging from a streaming smart meter.\nIt dynamically leverages coarse-scale historical information using an M-TR\nencoder from an extended global temporal window, in conjunction with an M-TR\ndecoder that concentrates on a limited time frame, local window, aiming to\ncapture the fine-scale characteristics of the smart meter data. The M-TR is\nbased on an anomaly detection technique that does not require any prior\nknowledge about EVs charging profiles, nor it does only require real power\nconsumption data of non-EV users. In addition, the proposed model leverages the\npower of transfer learning. The M-TR is compared with different\nstate-of-the-art methods and performs better than other unsupervised learning\nmodels. The model can run with an excellent execution time of 1.2 sec. for\n1-minute smart recordings.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}