{"id":"2408.02995","title":"Patterning of Fine Features on Material Surfaces Using a Ga Ion-Beam in\n  a FIB-SEM","authors":"Supriya Ghosh and K. Andre Mkhoyan","authorsParsed":[["Ghosh","Supriya",""],["Mkhoyan","K. Andre",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 07:05:25 GMT"}],"updateDate":"2024-08-07","timestamp":1722927925000,"abstract":"  Since an ion-beam is a viable attractive alternative to other material\nsurface patterning techniques like an electron-beam, a study of the structure,\ncomposition and dimension of patterned lines created on surfaces of Si and\nSrTiO3 wafers with a Ga ion-beam was carried out. A combination of top-view SEM\nand cross-sectional STEM imaging and EDX spectroscopy applied to the patterned\nlines showed that the total ion-dose (DI) is the key parameter affecting the\ncharacteristics of the patterned lines, which can be adjusted by the degree of\noverlap between adjacent spots, beam dwell time at each spot, and the number of\nbeam-passes for every beam size and current. A strong dependence between the\nused ion-doses and the patterned lines sizes was observed and quantified. At\nhigher ion-doses (DI > 10^15 ions/cm^2), the Ga ions remove part of the\nmaterial in the exposed area creating channels surrounded with amorphized\nregions whereas, at lower ion-doses only amorphization occurs, creating a ridge\non the wafer surface. Further, to pattern lines with similar sizes, an order of\nmagnitude different ion-doses might be required in different materials as was\nthe case with Si and SrTiO3. The quantification of line sizes showed that with\nthis approach, lines as fine as 10 nm can be reproducibly patterned and\ncharacterized on the surfaces of materials, when low ion-doses are used,\ntypically in the range of 10^14-10^15 ions/cm^2.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"_vXFMNMsM3dzvzgYWUh06HSUBdU-vlHrjCam9L8oynU","pdfSize":"1260884"}
