{"id":"2408.11322","title":"Transfer Learning and the Early Estimation of Single-Photon Source\n  Quality using Machine Learning Methods","authors":"David Jacob Kedziora, Anna Musia{\\l}, Wojciech Rudno-Rudzi\\'nski, and\n  Bogdan Gabrys","authorsParsed":[["Kedziora","David Jacob",""],["Musiał","Anna",""],["Rudno-Rudziński","Wojciech",""],["Gabrys","Bogdan",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 04:10:38 GMT"}],"updateDate":"2024-08-22","timestamp":1724213438000,"abstract":"  The use of single-photon sources (SPSs) is central to numerous systems and\ndevices proposed amidst a modern surge in quantum technology. However,\nmanufacturing schemes remain imperfect, and single-photon emission purity must\noften be experimentally verified via interferometry. Such a process is\ntypically slow and costly, which has motivated growing research into whether\nSPS quality can be more rapidly inferred from incomplete emission statistics.\nHence, this study is a sequel to previous work that demonstrated significant\nuncertainty in the standard method of quality estimation, i.e. the\nleast-squares fitting of a physically motivated function, and asks: can machine\nlearning (ML) do better? The study leverages eight datasets obtained from\nmeasurements involving an exemplary quantum emitter, i.e. a single InGaAs/GaAs\nepitaxial quantum dot; these eight contexts predominantly vary in the intensity\nof the exciting laser. Specifically, via a form of `transfer learning', five ML\nmodels, three linear and two ensemble-based, are trained on data from seven of\nthe contexts and tested on the eighth. Validation metrics quickly reveal that\neven a linear regressor can outperform standard fitting when it is tested on\nthe same contexts it was trained on, but the success of transfer learning is\nless assured, even though statistical analysis, made possible by data\naugmentation, suggests its superiority as an early estimator. Accordingly, the\nstudy concludes by discussing future strategies for grappling with the problem\nof SPS context dissimilarity, e.g. feature engineering and model adaptation.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}