{"id":"2408.11464","title":"MambaOcc: Visual State Space Model for BEV-based Occupancy Prediction\n  with Local Adaptive Reordering","authors":"Yonglin Tian, Songlin Bai, Zhiyao Luo, Yutong Wang, Yisheng Lv, and\n  Fei-Yue Wang","authorsParsed":[["Tian","Yonglin",""],["Bai","Songlin",""],["Luo","Zhiyao",""],["Wang","Yutong",""],["Lv","Yisheng",""],["Wang","Fei-Yue",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 09:29:45 GMT"}],"updateDate":"2024-08-22","timestamp":1724232585000,"abstract":"  Occupancy prediction has attracted intensive attention and shown great\nsuperiority in the development of autonomous driving systems. The fine-grained\nenvironmental representation brought by occupancy prediction in terms of both\ngeometry and semantic information has facilitated the general perception and\nsafe planning under open scenarios. However, it also brings high computation\ncosts and heavy parameters in existing works that utilize voxel-based 3d dense\nrepresentation and Transformer-based quadratic attention. To address these\nchallenges, in this paper, we propose a Mamba-based occupancy prediction method\n(MambaOcc) adopting BEV features to ease the burden of 3D scenario\nrepresentation, and linear Mamba-style attention to achieve efficient\nlong-range perception. Besides, to address the sensitivity of Mamba to sequence\norder, we propose a local adaptive reordering (LAR) mechanism with deformable\nconvolution and design a hybrid BEV encoder comprised of convolution layers and\nMamba. Extensive experiments on the Occ3D-nuScenes dataset demonstrate that\nMambaOcc achieves state-of-the-art performance in terms of both accuracy and\ncomputational efficiency. For example, compared to FlashOcc, MambaOcc delivers\nsuperior results while reducing the number of parameters by 42\\% and\ncomputational costs by 39\\%. Code will be available at\nhttps://github.com/Hub-Tian/MambaOcc.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}