{"id":"2408.06524","title":"From Graphs to Qubits: A Critical Review of Quantum Graph Neural\n  Networks","authors":"Andrea Ceschini, Francesco Mauro, Francesca De Falco, Alessandro\n  Sebastianelli, Alessio Verdone, Antonello Rosato, Bertrand Le Saux, Massimo\n  Panella, Paolo Gamba and Silvia L. Ullo","authorsParsed":[["Ceschini","Andrea",""],["Mauro","Francesco",""],["De Falco","Francesca",""],["Sebastianelli","Alessandro",""],["Verdone","Alessio",""],["Rosato","Antonello",""],["Saux","Bertrand Le",""],["Panella","Massimo",""],["Gamba","Paolo",""],["Ullo","Silvia L.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 22:53:14 GMT"}],"updateDate":"2024-08-14","timestamp":1723503194000,"abstract":"  Quantum Graph Neural Networks (QGNNs) represent a novel fusion of quantum\ncomputing and Graph Neural Networks (GNNs), aimed at overcoming the\ncomputational and scalability challenges inherent in classical GNNs that are\npowerful tools for analyzing data with complex relational structures but suffer\nfrom limitations such as high computational complexity and over-smoothing in\nlarge-scale applications. Quantum computing, leveraging principles like\nsuperposition and entanglement, offers a pathway to enhanced computational\ncapabilities. This paper critically reviews the state-of-the-art in QGNNs,\nexploring various architectures. We discuss their applications across diverse\nfields such as high-energy physics, molecular chemistry, finance and earth\nsciences, highlighting the potential for quantum advantage. Additionally, we\naddress the significant challenges faced by QGNNs, including noise,\ndecoherence, and scalability issues, proposing potential strategies to mitigate\nthese problems. This comprehensive review aims to provide a foundational\nunderstanding of QGNNs, fostering further research and development in this\npromising interdisciplinary field.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vYw9INRALqKwIX1usj86bIUNn0ElZm6UMycOnr_Cdrw","pdfSize":"2750789"}
