{"id":"2408.08540","title":"Convergence Framework of Deep Learning-based Hybrid Iterative Methods\n  and the Application to Designing a Fourier Neural Solver for Parametric PDEs","authors":"Chen Cui, Kai Jiang, Yun Liu and Shi Shu","authorsParsed":[["Cui","Chen",""],["Jiang","Kai",""],["Liu","Yun",""],["Shu","Shi",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 05:52:29 GMT"}],"updateDate":"2024-08-19","timestamp":1723787549000,"abstract":"  Recently, deep learning-based hybrid iterative methods (DL-HIM) have emerged\nas a promising approach for designing fast neural solvers to tackle large-scale\nsparse linear systems. DL-HIM combine the smoothing effect of simple iterative\nmethods with the spectral bias of neural networks, which allows them to\neffectively eliminate both high-frequency and low-frequency error components.\nHowever, their efficiency may decrease if simple iterative methods can not\nprovide effective smoothing, making it difficult for the neural network to\nlearn mid-frequency and high-frequency components. This paper first establishes\na convergence analysis framework for general DL-HIM from a spectral viewpoint,\nconcluding that under reasonable assumptions, DL-HIM exhibit a convergence rate\nindependent of grid size $h$ and physical parameters $\\boldsymbol{\\mu}$. To\nmeet these assumptions, we design a neural network from an eigen perspective,\nfocusing on learning the eigenvalues and eigenvectors corresponding to error\ncomponents that simple iterative methods struggle to eliminate. Specifically,\nthe eigenvalues are learned by a meta subnet, while the eigenvectors are\napproximated using Fourier modes with a transition matrix provided by another\nmeta subnet. The resulting DL-HIM, termed the Fourier Neural Solver (FNS), is\nexpected to achieve a $h, \\boldsymbol{\\mu}$-independent convergence rate with\nthe guarantee of universal approximation and the discretization invariant\nproperty of the meta subnets. We verify the performance of FNS on four types of\nlinear parametric PDEs.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}