{"id":"2408.11607","title":"Networked Communication for Mean-Field Games with Function Approximation\n  and Empirical Mean-Field Estimation","authors":"Patrick Benjamin, Alessandro Abate","authorsParsed":[["Benjamin","Patrick",""],["Abate","Alessandro",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 13:32:46 GMT"}],"updateDate":"2024-08-22","timestamp":1724247166000,"abstract":"  Recent works have provided algorithms by which decentralised agents, which\nmay be connected via a communication network, can learn equilibria in\nMean-Field Games from a single, non-episodic run of the empirical system.\nHowever, these algorithms are given for tabular settings: this computationally\nlimits the size of players' observation space, meaning that the algorithms are\nnot able to handle anything but small state spaces, nor to generalise beyond\npolicies depending on the ego player's state to so-called\n'population-dependent' policies. We address this limitation by introducing\nfunction approximation to the existing setting, drawing on the Munchausen\nOnline Mirror Descent method that has previously been employed only in\nfinite-horizon, episodic, centralised settings. While this permits us to\ninclude the population's mean-field distribution in the observation for each\nplayer's policy, it is arguably unrealistic to assume that decentralised agents\nwould have access to this global information: we therefore additionally provide\nnew algorithms that allow agents to estimate the global empirical distribution\nbased on a local neighbourhood, and to improve this estimate via communication\nover a given network. Our experiments showcase how the communication network\nallows decentralised agents to estimate the mean-field distribution for\npopulation-dependent policies, and that exchanging policy information helps\nnetworked agents to outperform both independent and even centralised agents in\nfunction-approximation settings, by an even greater margin than in tabular\nsettings.\n","subjects":["Computing Research Repository/Multiagent Systems","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zX0VxX_Hvqf-D_0Isw5pbOKDxe5MDTZ0tNHOd7u81sI","pdfSize":"4798233"}
