{"id":"2408.03451","title":"Molecular Absorption-Aware User Assignment, Spectrum, and Power\n  Allocation in Dense THz Networks with Multi-Connectivity","authors":"Mohammad Amin Saeidi, Hina Tabassum, Mehrazin Alizadeh","authorsParsed":[["Saeidi","Mohammad Amin",""],["Tabassum","Hina",""],["Alizadeh","Mehrazin",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 21:03:34 GMT"}],"updateDate":"2024-08-08","timestamp":1722978214000,"abstract":"  This paper develops a unified framework to maximize the network sum-rate in a\nmulti-user, multi-BS downlink terahertz (THz) network by optimizing user\nassociations, number and bandwidth of sub-bands in a THz transmission window\n(TW), bandwidth of leading and trailing edge-bands in a TW, sub-band\nassignment, and power allocations. The proposed framework incorporates\nmulti-connectivity and captures the impact of molecular absorption coefficient\nvariations in a TW, beam-squint, molecular absorption noise, and link\nblockages. To make the problem tractable, we first propose a convex\napproximation of the molecular absorption coefficient using curve fitting in a\nTW, determine the feasible bandwidths of the leading and trailing edge-bands,\nand then derive closed-form optimal solution for the number of sub-bands\nconsidering beam-squint constraints. We then decompose joint user associations,\nsub-band assignment, and power allocation problem into two sub-problems, i.e.,\n\\textbf{(i)} joint user association and sub-band assignment, and \\textbf{(ii)}\npower allocation. To solve the former problem, we analytically prove the\nunimodularity of the constraint matrix which enables us to relax the integer\nconstraint without loss of optimality. To solve power allocation sub-problem, a\nfractional programming (FP)-based centralized solution as well as an\nalternating direction method of multipliers (ADMM)-based light-weight\ndistributed solution is proposed. The overall problem is then solved using\nalternating optimization until convergence. Complexity analysis of the\nalgorithms and numerical convergence are presented. Numerical findings validate\nthe effectiveness of the proposed algorithms and extract useful insights about\nthe interplay of the density of base stations (BSs), Average order of\nmulti-connectivity (AOM), molecular absorption, {hardware impairment},\n{imperfect CSI}, and link blockages.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Emerging Technologies","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}