{"id":"2408.05556","title":"Evolutionary Neural Architecture Search for 3D Point Cloud Analysis","authors":"Yisheng Yang, Guodong Du, Chean Khim Toa, Ho-Kin Tang, Sim Kuan Goh","authorsParsed":[["Yang","Yisheng",""],["Du","Guodong",""],["Toa","Chean Khim",""],["Tang","Ho-Kin",""],["Goh","Sim Kuan",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 13:41:18 GMT"}],"updateDate":"2024-08-13","timestamp":1723297278000,"abstract":"  Neural architecture search (NAS) automates neural network design by using\noptimization algorithms to navigate architecture spaces, reducing the burden of\nmanual architecture design. While NAS has achieved success, applying it to\nemerging domains, such as analyzing unstructured 3D point clouds, remains\nunderexplored due to the data lying in non-Euclidean spaces, unlike images.\nThis paper presents Success-History-based Self-adaptive Differential Evolution\nwith a Joint Point Interaction Dimension Search (SHSADE-PIDS), an evolutionary\nNAS framework that encodes discrete deep neural network architectures to\ncontinuous spaces and performs searches in the continuous spaces for efficient\npoint cloud neural architectures. Comprehensive experiments on challenging 3D\nsegmentation and classification benchmarks demonstrate SHSADE-PIDS's\ncapabilities. It discovered highly efficient architectures with higher\naccuracy, significantly advancing prior NAS techniques. For segmentation on\nSemanticKITTI, SHSADE-PIDS attained 64.51% mean IoU using only 0.55M parameters\nand 4.5GMACs, reducing overhead by over 22-26X versus other top methods. For\nModelNet40 classification, it achieved 93.4% accuracy with just 1.31M\nparameters, surpassing larger models. SHSADE-PIDS provided valuable insights\ninto bridging evolutionary algorithms with neural architecture optimization,\nparticularly for emerging frontiers like point cloud learning.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by/4.0/"}