{"id":"2408.14680","title":"On-Chip Learning with Memristor-Based Neural Networks: Assessing\n  Accuracy and Efficiency Under Device Variations, Conductance Errors, and\n  Input Noise","authors":"M. Reza Eslami, Dhiman Biswas, Soheib Takhtardeshir, Sarah S. Sharif,\n  and Yaser M. Banad","authorsParsed":[["Eslami","M. Reza",""],["Biswas","Dhiman",""],["Takhtardeshir","Soheib",""],["Sharif","Sarah S.",""],["Banad","Yaser M.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 23:10:01 GMT"}],"updateDate":"2024-08-28","timestamp":1724713801000,"abstract":"  This paper presents a memristor-based compute-in-memory hardware accelerator\nfor on-chip training and inference, focusing on its accuracy and efficiency\nagainst device variations, conductance errors, and input noise. Utilizing\nrealistic SPICE models of commercially available silver-based metal\nself-directed channel (M-SDC) memristors, the study incorporates inherent\ndevice non-idealities into the circuit simulations. The hardware, consisting of\n30 memristors and 4 neurons, utilizes three different M-SDC structures with\ntungsten, chromium, and carbon media to perform binary image classification\ntasks. An on-chip training algorithm precisely tunes memristor conductance to\nachieve target weights. Results show that incorporating moderate noise (<15%)\nduring training enhances robustness to device variations and noisy input data,\nachieving up to 97% accuracy despite conductance variations and input noises.\nThe network tolerates a 10% conductance error without significant accuracy\nloss. Notably, omitting the initial memristor reset pulse during training\nconsiderably reduces training time and energy consumption. The hardware\ndesigned with chromium-based memristors exhibits superior performance,\nachieving a training time of 2.4 seconds and an energy consumption of 18.9 mJ.\nThis research provides insights for developing robust and energy-efficient\nmemristor-based neural networks for on-chip learning in edge applications.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Condensed Matter/Materials Science","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wmUTxEJrQcvQSGDXfAzAxZn1_7EBSTRL9xOmpVx477E","pdfSize":"1936486"}
