{"id":"2408.05171","title":"Time-resolved measurement of neutron energy isotropy in a\n  sheared-flow-stabilized Z pinch","authors":"R. A. Ryan, P. E. Tsai, A. R. Johansen, A. Youmans, D. P. Higginson,\n  J. M. Mitrani, C. S. Adams, D. A. Sutherland, B. Levitt, U. Shumlak","authorsParsed":[["Ryan","R. A.",""],["Tsai","P. E.",""],["Johansen","A. R.",""],["Youmans","A.",""],["Higginson","D. P.",""],["Mitrani","J. M.",""],["Adams","C. S.",""],["Sutherland","D. A.",""],["Levitt","B.",""],["Shumlak","U.",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 16:48:01 GMT"}],"updateDate":"2024-08-12","timestamp":1723222081000,"abstract":"  Previous measurements of neutron energy using fast plastic scintillators\nwhile operating the Fusion Z Pinch Experiment (FuZE) constrained the energy of\nany yield-producing deuteron beams to less than $4.65 keV$. FuZE has since been\noperated at increasingly higher input power, resulting in increased plasma\ncurrent and larger fusion neutron yields. A detailed experimental study of the\nneutron energy isotropy in these regimes applies more stringent limits to\npossible contributions from beam-target fusion. The FuZE device operated at\n$-25~kV$ charge voltage has resulted in average plasma currents of $370~kA$ and\nD-D fusion neutron yields of $4\\times10^7$ neutrons per discharge. Measurements\nof the neutron energy isotropy under these operating conditions demonstrates\nthe energy of deuteron beams is less than $7.4 \\pm 5.6^\\mathrm{(stat)} \\pm\n3.7^\\mathrm{(syst)}~keV$. Characterization of the detector response has reduced\nthe number of free parameters in the fit of the neutron energy distribution,\nimproving the confidence in the forward-fit method. Gamma backgrounds have been\nmeasured and the impact of these contributions on the isotropy results have\nbeen studied. Additionally, a time dependent measurement of the isotropy has\nbeen resolved for the first time, indicating increases to possible deuteron\nbeam energies at late times. This suggests the possible growth of $m$=0\ninstabilities at the end of the main radiation event but confirms that the\nmajority of the neutron production exhibits isotropy consistent with\nthermonuclear origin.\n","subjects":["Physics/Plasma Physics","Physics/Nuclear Experiment"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}