{"id":"2408.12673","title":"Enhancing Transferability of Adversarial Attacks with GE-AdvGAN+: A\n  Comprehensive Framework for Gradient Editing","authors":"Zhibo Jin, Jiayu Zhang, Zhiyu Zhu, Yuchen Zhang, Jiahao Huang,\n  Jianlong Zhou, Fang Chen","authorsParsed":[["Jin","Zhibo",""],["Zhang","Jiayu",""],["Zhu","Zhiyu",""],["Zhang","Yuchen",""],["Huang","Jiahao",""],["Zhou","Jianlong",""],["Chen","Fang",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 18:26:31 GMT"},{"version":"v2","created":"Sat, 31 Aug 2024 09:38:41 GMT"}],"updateDate":"2024-09-04","timestamp":1724351191000,"abstract":"  Transferable adversarial attacks pose significant threats to deep neural\nnetworks, particularly in black-box scenarios where internal model information\nis inaccessible. Studying adversarial attack methods helps advance the\nperformance of defense mechanisms and explore model vulnerabilities. These\nmethods can uncover and exploit weaknesses in models, promoting the development\nof more robust architectures. However, current methods for transferable attacks\noften come with substantial computational costs, limiting their deployment and\napplication, especially in edge computing scenarios. Adversarial generative\nmodels, such as Generative Adversarial Networks (GANs), are characterized by\ntheir ability to generate samples without the need for retraining after an\ninitial training phase. GE-AdvGAN, a recent method for transferable adversarial\nattacks, is based on this principle. In this paper, we propose a novel general\nframework for gradient editing-based transferable attacks, named GE-AdvGAN+,\nwhich integrates nearly all mainstream attack methods to enhance\ntransferability while significantly reducing computational resource\nconsumption. Our experiments demonstrate the compatibility and effectiveness of\nour framework. Compared to the baseline AdvGAN, our best-performing method,\nGE-AdvGAN++, achieves an average ASR improvement of 47.8. Additionally, it\nsurpasses the latest competing algorithm, GE-AdvGAN, with an average ASR\nincrease of 5.9. The framework also exhibits enhanced computational efficiency,\nachieving 2217.7 FPS, outperforming traditional methods such as BIM and\nMI-FGSM. The implementation code for our GE-AdvGAN+ framework is available at\nhttps://github.com/GEAdvGANP\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}