{"id":"2408.02219","title":"IRS-Assisted OTFS: Beamforming Design and Signal Detection","authors":"Sushmita Singh, Kuntal Deka, Sanjeev Sharma, and Neelakandan Rajamohan","authorsParsed":[["Singh","Sushmita",""],["Deka","Kuntal",""],["Sharma","Sanjeev",""],["Rajamohan","Neelakandan",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 03:47:15 GMT"}],"updateDate":"2024-08-06","timestamp":1722829635000,"abstract":"  Intelligent reflecting surface (IRS) technology has become a crucial enabler\nfor creating cost effective, innovative, and adaptable wireless communication\nenvironments. This study investigates an IRS-assisted orthogonal time frequency\nspace (OTFS) modulation that facilitates communication between users and the\nbase station (BS). The users attainable downlink rate can be boosted by\ncollaboratively improving the reflection coefficient (RC) matrix at the IRS and\nbeamforming matrix at the BS. Then, in the IRS-aided OTFS network, the problem\nof cooperative precoding at BS and IRS to improve the network throughput is\nframed. The precoding design problem is non-convex and highly complicated; an\nalternate optimization (AO) approach is proposed to solve this. Specifically,\nan approach based on strongest tap maximization (STM) and fractional\nprogramming is proposed. It solves RC matrix (at IRS) and beamforming matrix\n(at BS) alternatively. Moreover, an efficient signal detector for IRS-aided\nOTFS communication systems using the alternating direction method of\nmultipliers (ADMM) is proposed. Finally, to estimate the cascaded MIMO channel,\nusing a parallel factor tensor model that separates the IRS-User and BS-IRS\nMIMO channels, respectively is suggested. Simulation results show that the\nproposed method significantly enhances the system capacity and bit error rate\n(BER) performance compared to conventional OTFS.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"q-D4vaLABgvXk-Os2wZ-ZFHVylSHfhqxea1o_O5mpCM","pdfSize":"755067"}
