{"id":"2408.10624","title":"WRIM-Net: Wide-Ranging Information Mining Network for Visible-Infrared\n  Person Re-Identification","authors":"Yonggan Wu, Ling-Chao Meng, Yuan Zichao, Sixian Chan, Hong-Qiang Wang","authorsParsed":[["Wu","Yonggan",""],["Meng","Ling-Chao",""],["Zichao","Yuan",""],["Chan","Sixian",""],["Wang","Hong-Qiang",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 08:06:16 GMT"}],"updateDate":"2024-08-21","timestamp":1724141176000,"abstract":"  For the visible-infrared person re-identification (VI-ReID) task, one of the\nprimary challenges lies in significant cross-modality discrepancy. Existing\nmethods struggle to conduct modality-invariant information mining. They often\nfocus solely on mining singular dimensions like spatial or channel, and\noverlook the extraction of specific-modality multi-dimension information. To\nfully mine modality-invariant information across a wide range, we introduce the\nWide-Ranging Information Mining Network (WRIM-Net), which mainly comprises a\nMulti-dimension Interactive Information Mining (MIIM) module and an\nAuxiliary-Information-based Contrastive Learning (AICL) approach. Empowered by\nthe proposed Global Region Interaction (GRI), MIIM comprehensively mines\nnon-local spatial and channel information through intra-dimension interaction.\nMoreover, Thanks to the low computational complexity design, separate MIIM can\nbe positioned in shallow layers, enabling the network to better mine\nspecific-modality multi-dimension information. AICL, by introducing the novel\nCross-Modality Key-Instance Contrastive (CMKIC) loss, effectively guides the\nnetwork in extracting modality-invariant information. We conduct extensive\nexperiments not only on the well-known SYSU-MM01 and RegDB datasets but also on\nthe latest large-scale cross-modality LLCM dataset. The results demonstrate\nWRIM-Net's superiority over state-of-the-art methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}