{"id":"2408.00072","title":"Leveraging protohalos and scale-dependent bias to calibrate the BAO\n  scale in real space","authors":"Sasha Gaines, Farnik Nikakhtar, Nikhil Padmanabhan, Ravi K. Sheth","authorsParsed":[["Gaines","Sasha",""],["Nikakhtar","Farnik",""],["Padmanabhan","Nikhil",""],["Sheth","Ravi K.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:00:02 GMT"}],"updateDate":"2024-08-02","timestamp":1722448802000,"abstract":"  The location of the baryon acoustic oscillation (BAO) feature in the\ntwo-point correlation function (2PCF) of matter produces a standard ruler that\nis useful for the measurement of the expansion history of the Universe.\nInspired by the possibility of reconstructing the positions of protohalos in\nthe initial density field with a novel method rooted in optimal transport\ntheory, we revisit the BAO signal in the protohalo correlation function. Our\nwork examines the performance of a template 2PCF built on a tracer bias\nrelation that includes scale dependence -- a term that can be motivated by\npeaks theory or a general bias expansion. Working in protohalos, halos, and the\nlinear combination of the protohalo and matter fields that is motivated by the\ncontinuity equation, we demonstrate that this model accurately captures the\nshape of the BAO feature and improves the precision of the BAO scale\nmeasurement relative to a model that does not include scale-dependent bias by\n47% in protohalos, 15% in halos, and 14% in the linear combination of the\nprotohalo and matter fields. Allowing for scale dependence does not appear to\nintroduce any shift in the BAO feature. The precision of the BAO distance scale\nestimate is highest with the linear combination of the protohalo and matter\nfields, which offers a factor of 3.5 improvement over Eulerian-space\nmeasurements and a factor of 4-8 improvement over the estimate made with\nprotohalos alone.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NU7kM2A7B_-Vg0_iZpl0Ys5oSXBvQ0hW38dXMhB36dg","pdfSize":"1327164"}
