{"id":"2408.09557","title":"Markov modeling for a satellite tag data record of whale diving behavior","authors":"Joshua Hewitt, Nicola J. Quick, Alan E. Gelfand, Robert S. Schick","authorsParsed":[["Hewitt","Joshua",""],["Quick","Nicola J.",""],["Gelfand","Alan E.",""],["Schick","Robert S.",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 17:53:25 GMT"}],"updateDate":"2024-08-20","timestamp":1724003605000,"abstract":"  Cuvier's beaked whales (Ziphius cavirostris) are the deepest diving marine\nmammal, consistently diving to depths exceeding 1,000m for durations longer\nthan an hour, making them difficult animals to study. They are important to\nstudy because they are sensitive to disturbances from naval sonar.\nSatellite-linked telemetry devices provide up to 14-day long records of dive\nbehavior. However, the time series of depths is discretized to coarse bins due\nto bandwidth limitations. We analyze telemetry data from beaked whales that\nwere exposed to moderate levels of sonar within controlled exposure experiments\n(CEEs) to study behavioral responses to sound exposure. We model the data as a\nhidden Markov model (HMM) over the time series of discrete depth bins,\nintroducing partially observed movement types and recent diving activity\ncovariates to model marginal non-stationarity. Movement types provide more\nflexible modeling for CEEs than partially observed dive stages, which are more\ncommonly used in dive behavior HMMs. We estimate the proposed model within a\nhierarchical Bayesian framework, using HMM methods to compute marginalized\nlikelihoods and posterior predictive distributions. We assess behavioral\nresponse by comparing observed post-exposure behavior to usual unexposed\nbehavior via the posterior predictive distribution. The model quantifies\npatterns in baseline diving behavior and finds evidence that beaked whales\ndeviate in response to sound. We find evidence that (i) beaked whales initially\nshorten the time they spend between deep dives, which may have physiological\neffects and (ii) subsequently avoid deep dives, which can result in lost\nforaging opportunities.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"n3QCnbvlOdnannBCbERIHmlBSMgxqiKm9fa3akUX7g4","pdfSize":"696866"}
