{"id":"2408.11066","title":"Development of a Dual-Spectroscopic System to Rapidly Measure\n  Diisopropyl Methyl Phosphonate (DIMP) Decomposition and Temperature in a\n  Reactive Powder Environment","authors":"Preetom Borah, Milad Alemohammad, Mark Foster, Timothy P. Weihs","authorsParsed":[["Borah","Preetom",""],["Alemohammad","Milad",""],["Foster","Mark",""],["Weihs","Timothy P.",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 22:08:19 GMT"}],"updateDate":"2024-08-22","timestamp":1723846099000,"abstract":"  The development of systems to measure and optimize emerging energetic\nmaterial performance is critical for CWA defeat. This study documents a\ncombination of two spectroscopic systems designed to monitor decomposition of a\nCWA simulant and temperature. The first system is a custom benchtop Polygonal\nRotating Mirror Infrared Spectrometer (PRiMIRS) incorporating a fully\ncustomizable sample cell to observe decomposition of DIMP as it interacts with\ncombusting composite metal particles. The second is TDLAS used to monitor\nincreases in background gas temperatures as the composite metal powders\ncombust. The PRiMIRS system demonstrates a very high SNR at Hz, reasonable SNR\nwhen operating at 100 Hz, and capabilities of resolving spectral features with\na FWHM resolution of 15 cm^-1. TDLAS was able to monitor temperature rises\nbetween room temperature and 230C +/- 5C at 100 Hz.For testing, liquid DIMP was\ninserted in a preheated SS cell to generate DIMP vapor and (Al-8Mg):Zr metal\npowders were ignited in a SS mount with a resistively heated nichrome wire at\none end of the cell. The ignited particles propagated across the cell\ncontaining DIMP vapor. The path averaged gas temperature in the preheated SS\ncell rises rapidly (100ms) and decays slowly (< 5 s) but remains below 230C\nduring particle combustion, a temperature at which the thermal decomposition of\nDIMP is not observed over similarly short timescales (seconds). However, when\ncombusting particles were introduced to the DIMP vapor (heterogenous\nenvironment), spectral signatures indicative of decomposition products such as\nIMP and IPA were observed within seconds.\n","subjects":["Physics/Instrumentation and Detectors","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8gu4VWOcCvsES_QaLJ_v3Qn03SIxyEE4Js2OwKUYNoY","pdfSize":"5512337"}
