{"id":"2408.16393","title":"Illuminating the Diversity-Fitness Trade-Off in Black-Box Optimization","authors":"Maria Laura Santoni, Elena Raponi, Aneta Neumann, Frank Neumann, Mike\n  Preuss, Carola Doerr","authorsParsed":[["Santoni","Maria Laura",""],["Raponi","Elena",""],["Neumann","Aneta",""],["Neumann","Frank",""],["Preuss","Mike",""],["Doerr","Carola",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 09:55:55 GMT"}],"updateDate":"2024-08-30","timestamp":1724925355000,"abstract":"  In real-world applications, users often favor structurally diverse design\nchoices over one high-quality solution. It is hence important to consider more\nsolutions that decision-makers can compare and further explore based on\nadditional criteria. Alongside the existing approaches of evolutionary\ndiversity optimization, quality diversity, and multimodal optimization, this\npaper presents a fresh perspective on this challenge by considering the problem\nof identifying a fixed number of solutions with a pairwise distance above a\nspecified threshold while maximizing their average quality.\n  We obtain first insight into these objectives by performing a subset\nselection on the search trajectories of different well-established search\nheuristics, whether specifically designed with diversity in mind or not. We\nemphasize that the main goal of our work is not to present a new algorithm but\nto look at the problem in a more fundamental and theoretically tractable way by\nasking the question: What trade-off exists between the minimum distance within\nbatches of solutions and the average quality of their fitness? These insights\nalso provide us with a way of making general claims concerning the properties\nof optimization problems that shall be useful in turn for benchmarking\nalgorithms of the approaches enumerated above.\n  A possibly surprising outcome of our empirical study is the observation that\nnaive uniform random sampling establishes a very strong baseline for our\nproblem, hardly ever outperformed by the search trajectories of the considered\nheuristics. We interpret these results as a motivation to develop algorithms\ntailored to produce diverse solutions of high average quality.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}