{"id":"2408.08031","title":"Spectral Projections for Density Matrices in Quantum Field Theories","authors":"Wu-zhong Guo","authorsParsed":[["Guo","Wu-zhong",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 08:53:05 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 03:06:32 GMT"}],"updateDate":"2024-09-06","timestamp":1723711985000,"abstract":"  In this paper, we investigate the spectral projection of density matrices in\nquantum field theory. With appropriate regularization, the spectral projectors\nof density matrices are expected to be well-defined. These projectors can be\nobtained using the Riesz projection formula, which allows us to compute both\nthe density of eigenvalues and the expectation values of local operators in the\nprojected states. We find that there are universal divergent terms in the\nexpectation value of the stress energy tensor, where the coefficients depend\nuniversally on the density of eigenvalues and a function that describes the\ndependence of eigenvalues on boundary location. Using projection states, we can\nconstruct a series of new states in quantum field theories and discuss their\ngeneral properties, focusing on the holographic aspects. We observe that\nquantum fluctuations are suppressed in the semiclassical limit. We also\ndemonstrate that the fixed area state, previously constructed using\ngravitational path integrals, can be constructed by suitably superposition of\nappromiate amount of projection states. Additionally, we apply spectral\nprojection to non-Hermitian operators, such as transition matrices, to obtain\ntheir eigenvalues and densities. Finally, we highlight potential applications\nof spectral projections, including the construction of new density and\ntransition matrices and the understanding of superpositions of geometric\nstates.\n","subjects":["Physics/High Energy Physics - Theory","Condensed Matter/Statistical Mechanics","Physics/General Relativity and Quantum Cosmology","Physics/Quantum Physics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}