{"id":"2408.01743","title":"Ultrafast tunable photonic integrated Pockels extended-DBR laser","authors":"Anat Siddharth, Simone Bianconi, Rui Ning Wang, Zheru Qiu, Andrey S.\n  Voloshin, Mohammad J. Bereyhi, Johann Riemensberger, and Tobias J. Kippenberg","authorsParsed":[["Siddharth","Anat",""],["Bianconi","Simone",""],["Wang","Rui Ning",""],["Qiu","Zheru",""],["Voloshin","Andrey S.",""],["Bereyhi","Mohammad J.",""],["Riemensberger","Johann",""],["Kippenberg","Tobias J.",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 11:03:13 GMT"}],"updateDate":"2024-08-06","timestamp":1722682993000,"abstract":"  Frequency-agile lasers that can simultaneously feature low noise\ncharacteristics as well as fast mode hop-free frequency tuning are keystone\ncomponents for applications ranging from frequency modulated continuous wave\n(FMCW) LiDAR, to coherent optical communication and gas sensing. The hybrid\nintegration of III-V gain media with low-loss photonic integrated circuits\n(PICs) has recently enabled integrated lasers with faster tuning and lower\nphase noise than the best legacy systems, including fiber lasers. In addition,\nlithium niobate on insulator (LNOI) PICs have enabled to exploit the Pockels\neffect to demonstrate self-injection locked hybrid lasers with tuning rates\nreaching peta-hertz per second. However, Pockels-tunable laser archetypes\nrelying on high-Q optical microresonators have thus far only achieved limited\noutput powers, are difficult to operate and stabilize due to the dynamics of\nself-injection locking, and require many analog control parameters. Here, we\novercome this challenge by leveraging an extended distributed Bragg reflector\n(E-DBR) architecture to demonstrate a simple and turn-key operable\nfrequency-agile Pockels laser that can be controlled with single analog\noperation and modulation inputs. Our laser supports a continuous mode hop-free\ntuning range of over 10 GHz with good linearity and flat actuation bandwidth up\nto 10 MHz, while achieving over 15 mW in-fiber output power at 1545 nm and\nkHz-level intrinsic linewidth, a combination unmet by legacy bulk lasers. This\nhybrid laser design combines an inexpensive reflective semiconductor optical\namplifier (RSOA) with an electro-optic DBR PIC manufactured at wafer-scale on a\nLNOI platform. We showcase the performance and flexibility of this laser in\nproof-of-concept coherent optical ranging (FMCW LiDAR) demonstration, achieving\na 4 cm distance resolution and in a hydrogen cyanide spectroscopy experiment.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JdUFaC1BCAUp7gGJTRq5tGWjpDu5Cnssbiqj9FIl--Y","pdfSize":"11028527"}
