{"id":"2408.17036","title":"CP-VoteNet: Contrastive Prototypical VoteNet for Few-Shot Point Cloud\n  Object Detection","authors":"Xuejing Li and Weijia Zhang and Chao Ma","authorsParsed":[["Li","Xuejing",""],["Zhang","Weijia",""],["Ma","Chao",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 06:13:49 GMT"}],"updateDate":"2024-09-02","timestamp":1724998429000,"abstract":"  Few-shot point cloud 3D object detection (FS3D) aims to identify and localise\nobjects of novel classes from point clouds, using knowledge learnt from\nannotated base classes and novel classes with very few annotations. Thus far,\nthis challenging task has been approached using prototype learning, but the\nperformance remains far from satisfactory. We find that in existing methods,\nthe prototypes are only loosely constrained and lack of fine-grained awareness\nof the semantic and geometrical correlation embedded within the point cloud\nspace. To mitigate these issues, we propose to leverage the inherent\ncontrastive relationship within the semantic and geometrical subspaces to learn\nmore refined and generalisable prototypical representations. To this end, we\nfirst introduce contrastive semantics mining, which enables the network to\nextract discriminative categorical features by constructing positive and\nnegative pairs within training batches. Meanwhile, since point features\nrepresenting local patterns can be clustered into geometric components, we\nfurther propose to impose contrastive relationship at the primitive level.\nThrough refined primitive geometric structures, the transferability of feature\nencoding from base to novel classes is significantly enhanced. The above\ndesigns and insights lead to our novel Contrastive Prototypical VoteNet\n(CP-VoteNet). Extensive experiments on two FS3D benchmarks FS-ScanNet and\nFS-SUNRGBD demonstrate that CP-VoteNet surpasses current state-of-the-art\nmethods by considerable margins across different FS3D settings. Further\nablation studies conducted corroborate the rationale and effectiveness of our\ndesigns.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}