{"id":"2408.04955","title":"Model Debiasing by Learnable Data Augmentation","authors":"Pietro Morerio, Ruggero Ragonesi, Vittorio Murino","authorsParsed":[["Morerio","Pietro",""],["Ragonesi","Ruggero",""],["Murino","Vittorio",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 09:19:59 GMT"}],"updateDate":"2024-08-12","timestamp":1723195199000,"abstract":"  Deep Neural Networks are well known for efficiently fitting training data,\nyet experiencing poor generalization capabilities whenever some kind of bias\ndominates over the actual task labels, resulting in models learning\n\"shortcuts\". In essence, such models are often prone to learn spurious\ncorrelations between data and labels. In this work, we tackle the problem of\nlearning from biased data in the very realistic unsupervised scenario, i.e.,\nwhen the bias is unknown. This is a much harder task as compared to the\nsupervised case, where auxiliary, bias-related annotations, can be exploited in\nthe learning process. This paper proposes a novel 2-stage learning pipeline\nfeaturing a data augmentation strategy able to regularize the training. First,\nbiased/unbiased samples are identified by training over-biased models. Second,\nsuch subdivision (typically noisy) is exploited within a data augmentation\nframework, properly combining the original samples while learning mixing\nparameters, which has a regularization effect. Experiments on synthetic and\nrealistic biased datasets show state-of-the-art classification accuracy,\noutperforming competing methods, ultimately proving robust performance on both\nbiased and unbiased examples. Notably, being our training method totally\nagnostic to the level of bias, it also positively affects performance for any,\neven apparently unbiased, dataset, thus improving the model generalization\nregardless of the level of bias (or its absence) in the data.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-mZLJUsMlhEM8YjCGizE5vTNqj-EOGbHgHXsqx3WyVM","pdfSize":"2013639"}
