{"id":"2408.07451","title":"First-principles exploration of the pressure dependent physical\n  properties of Sn4Au: a superconducting topological semimetal","authors":"M. Abdul Hadi Shah, M.I. Naher, S.H. Naqib","authorsParsed":[["Shah","M. Abdul Hadi",""],["Naher","M. I.",""],["Naqib","S. H.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 10:43:48 GMT"}],"updateDate":"2024-08-15","timestamp":1723632228000,"abstract":"  First-principles investigation within the density functional theory is\nutilized to explore the physical properties of a superconducting topological\nsemimetal Sn4Au under pressure within the range of 0-5 GPa. According to the\ncomputed elastic moduli, the compound under study is classified as ductile and\napplied pressure enhances the ductility. The compound has very high level of\ndry lubricity and machinability index. All the anisotropy factors demonstrate\nan elastically anisotropic nature. The electronic properties are investigated\nin view of the electronic band structure and density of states. The band\nstructure reveals the topological semimetallic feature of Sn4Au while the\ndensity of states at the Fermi level decreases gradually with increasing\npressure. Both ionic and covalent bondings are observed in Sn4Au. Optical\nparameters of Sn4Au are investigated at different pressures. The characteristic\npeaks in reflectivity, refractive index and photoconductivity exhibit a shift\ntowards higher energy with increasing pressure for all polarizations of the\nelectric field vector. The absorption coefficient and reflectivity spectra\ndesignate Sn4Au as a suitable system for optoelectronic applications. Moreover,\nthe pressure dependent shifts in the electronic density of states at the Fermi\nlevel, the changes in the Debye temperature, and pressure induced variations in\nthe repulsive Coulomb pseudopotential have been used to explore the effect of\npressure on the superconducting transition temperature in this study.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zStDimz-2tLGOtHXUd4zzRTofircyNFqxXgYnteOGq4","pdfSize":"2410978"}
