{"id":"2408.02979","title":"Scattering theory for $C^2$ long-range potentials","authors":"K. Ito, E. Skibsted","authorsParsed":[["Ito","K.",""],["Skibsted","E.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 06:24:56 GMT"}],"updateDate":"2024-08-07","timestamp":1722925496000,"abstract":"  We develop a complete stationary scattering theory for Schr\\\"odinger\noperators on $\\mathbb R^d$, $d\\ge 2$, with $C^2$ long-range potentials. This\nextends former results in the literature, in particular [Is1, Is2, II, GY],\nwhich all require a higher degree of smoothness. In this sense the spirit of\nour paper is similar to [H\\\"o2, Chapter XXX], which also develops a scattering\ntheory under the $C^2$ condition, however being very different from ours. While\nthe Agmon-H\\\"ormander theory is based on the Fourier transform, our theory is\nnot and may be seen as more related to our previous approach to scattering\ntheory on manifolds [IS1,IS2,IS3]. The $C^2$ regularity is natural in the\nAgmon-H\\\"ormander theory as well as in our theory, in fact probably being\n`optimal' in the Euclidean setting. We prove equivalence of the stationary and\ntime-dependent theories by giving stationary representations of associated\ntime-dependent wave operators. Furthermore we develop a related stationary\nscattering theory at fixed energy in terms of asymptotics of generalized\neigenfunctions of minimal growth. A basic ingredient of our approach is a\nsolution to the eikonal equation constructed from the geometric variational\nscheme of [CS]. Another key ingredient is strong radiation condition bounds for\nthe limiting resolvents originating in [HS]. They improve formerly known ones\n[Is1, Sa] and considerably simplify the stationary approach. We obtain the\nbounds by a new commutator scheme whose elementary form allows a small degree\nof smoothness.\n","subjects":["Physics/Mathematical Physics","Mathematics/Analysis of PDEs","Mathematics/Functional Analysis","Mathematics/Mathematical Physics","Mathematics/Spectral Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}