{"id":"2408.15276","title":"A Survey of Deep Learning for Group-level Emotion Recognition","authors":"Xiaohua Huang, Jinke Xu, Wenming Zheng, Qirong Mao, Abhinav Dhall","authorsParsed":[["Huang","Xiaohua",""],["Xu","Jinke",""],["Zheng","Wenming",""],["Mao","Qirong",""],["Dhall","Abhinav",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 11:54:09 GMT"}],"updateDate":"2024-08-29","timestamp":1723550049000,"abstract":"  With the advancement of artificial intelligence (AI) technology, group-level\nemotion recognition (GER) has emerged as an important area in analyzing human\nbehavior. Early GER methods are primarily relied on handcrafted features.\nHowever, with the proliferation of Deep Learning (DL) techniques and their\nremarkable success in diverse tasks, neural networks have garnered increasing\ninterest in GER. Unlike individual's emotion, group emotions exhibit diversity\nand dynamics. Presently, several DL approaches have been proposed to\neffectively leverage the rich information inherent in group-level image and\nenhance GER performance significantly. In this survey, we present a\ncomprehensive review of DL techniques applied to GER, proposing a new taxonomy\nfor the field cover all aspects of GER based on DL. The survey overviews\ndatasets, the deep GER pipeline, and performance comparisons of the\nstate-of-the-art methods past decade. Moreover, it summarizes and discuss the\nfundamental approaches and advanced developments for each aspect. Furthermore,\nwe identify outstanding challenges and suggest potential avenues for the design\nof robust GER systems. To the best of our knowledge, thus survey represents the\nfirst comprehensive review of deep GER methods, serving as a pivotal references\nfor future GER research endeavors.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}