{"id":"2408.06197","title":"Lancelot: Towards Efficient and Privacy-Preserving Byzantine-Robust\n  Federated Learning within Fully Homomorphic Encryption","authors":"Siyang Jiang, Hao Yang, Qipeng Xie, Chuan Ma, Sen Wang and Guoliang\n  Xing","authorsParsed":[["Jiang","Siyang",""],["Yang","Hao",""],["Xie","Qipeng",""],["Ma","Chuan",""],["Wang","Sen",""],["Xing","Guoliang",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 14:48:25 GMT"}],"updateDate":"2024-08-13","timestamp":1723474105000,"abstract":"  In sectors such as finance and healthcare, where data governance is subject\nto rigorous regulatory requirements, the exchange and utilization of data are\nparticularly challenging. Federated Learning (FL) has risen as a pioneering\ndistributed machine learning paradigm that enables collaborative model training\nacross multiple institutions while maintaining data decentralization. Despite\nits advantages, FL is vulnerable to adversarial threats, particularly poisoning\nattacks during model aggregation, a process typically managed by a central\nserver. However, in these systems, neural network models still possess the\ncapacity to inadvertently memorize and potentially expose individual training\ninstances. This presents a significant privacy risk, as attackers could\nreconstruct private data by leveraging the information contained in the model\nitself. Existing solutions fall short of providing a viable, privacy-preserving\nBRFL system that is both completely secure against information leakage and\ncomputationally efficient. To address these concerns, we propose Lancelot, an\ninnovative and computationally efficient BRFL framework that employs fully\nhomomorphic encryption (FHE) to safeguard against malicious client activities\nwhile preserving data privacy. Our extensive testing, which includes medical\nimaging diagnostics and widely-used public image datasets, demonstrates that\nLancelot significantly outperforms existing methods, offering more than a\ntwenty-fold increase in processing speed, all while maintaining data privacy.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PUKaBWEbjAiK_jFLPp6RkjAw39D5mJchbfgK0hCp2XM","pdfSize":"1376461"}
