{"id":"2408.03186","title":"The interplay between disk wind and magnetospheric accretion mechanisms\n  in the innermost environment of RU Lup","authors":"J. A. Wojtczak, B. Tessore, L. Labadie, K. Perraut, J. Bouvier, C.\n  Dougados, H. Nowacki, A. Soulain, E. Al\\'ecian, G. Pantolmos, J. Ferreira, C.\n  Straubmeier, A. Eckart","authorsParsed":[["Wojtczak","J. A.",""],["Tessore","B.",""],["Labadie","L.",""],["Perraut","K.",""],["Bouvier","J.",""],["Dougados","C.",""],["Nowacki","H.",""],["Soulain","A.",""],["Alécian","E.",""],["Pantolmos","G.",""],["Ferreira","J.",""],["Straubmeier","C.",""],["Eckart","A.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 13:37:30 GMT"}],"updateDate":"2024-08-07","timestamp":1722951450000,"abstract":"  Aims: Our aim is to build upon the analysis presented in our previous work by\nattempting to match the observational data obtained with VLTI GRAVITY for RU\nLup in 2021 with an expanded radiative transfer model of Br$\\gamma$ emission.\nSpecifically, we will determine if the inclusion of an additional disk wind as\na Br$\\gamma$ emitter in the inner disk will be able to reproduce the trend of\nincreasing sizes at higher velocities, as well as the observed photocenter\nshifts.\n  Methods: We make use of the MCFOST radiative transfer code to solve for\nBr$\\gamma$ line formation in the innermost disk of an RU Lupl-like system. From\nthe resulting images we compute synthetic interferometric observables. We first\ninvestigate how individual parameter variations in a pure magnetospheric\naccretion model and a pure parameteric disk wind model translate to changes in\nthese derived quantities. Then we attempt to reproduce the RU Lup GRAVITY data\nwith different parameter variants of magnetospheric accretion models, disk wind\nmodels, and combined hybrid models.\n  Results: We demonstrate that magnetospheric accretion models and disk wind\nmodels on their own can emulate certain individual characteristics from the\nobservational results, but individually fail to comprehensively reproduce the\nobservational trends. Disk wind plus accretion hybrid models are in principle\ncapable of explaining the variation in characteristic radii across the line and\nthe corresponding flux ratios. While the model parameters of the hybrid models\nare mostly in good agreement with the known attributes of RU Lup, we find that\nour best-fitting models deviate in terms of rotational period and the size of\nthe magnetosphere. The best-fitting hybrid model does not respect the\nco-rotation criterion, as the magnetospheric truncation radius is about 50%\nlarger than the co-rotation radius.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LIYkzPjIHXuh99LBopTg3GPiTDjQ808o0wHxF1vHUzI","pdfSize":"4353559"}
