{"id":"2408.13149","title":"Focus on Neighbors and Know the Whole: Towards Consistent Dense\n  Multiview Text-to-Image Generator for 3D Creation","authors":"Bonan Li, Zicheng Zhang, Xingyi Yang, Xinchao Wang","authorsParsed":[["Li","Bonan",""],["Zhang","Zicheng",""],["Yang","Xingyi",""],["Wang","Xinchao",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 15:16:01 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 11:05:58 GMT"}],"updateDate":"2024-08-27","timestamp":1724426161000,"abstract":"  Generating dense multiview images from text prompts is crucial for creating\nhigh-fidelity 3D assets. Nevertheless, existing methods struggle with\nspace-view correspondences, resulting in sparse and low-quality outputs. In\nthis paper, we introduce CoSER, a novel consistent dense Multiview\nText-to-Image Generator for Text-to-3D, achieving both efficiency and quality\nby meticulously learning neighbor-view coherence and further alleviating\nambiguity through the swift traversal of all views. For achieving neighbor-view\nconsistency, each viewpoint densely interacts with adjacent viewpoints to\nperceive the global spatial structure, and aggregates information along motion\npaths explicitly defined by physical principles to refine details. To further\nenhance cross-view consistency and alleviate content drift, CoSER rapidly scan\nall views in spiral bidirectional manner to aware holistic information and then\nscores each point based on semantic material. Subsequently, we conduct weighted\ndown-sampling along the spatial dimension based on scores, thereby facilitating\nprominent information fusion across all views with lightweight computation.\nTechnically, the core module is built by integrating the attention mechanism\nwith a selective state space model, exploiting the robust learning capabilities\nof the former and the low overhead of the latter. Extensive evaluation shows\nthat CoSER is capable of producing dense, high-fidelity, content-consistent\nmultiview images that can be flexibly integrated into various 3D generation\nmodels.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}