{"id":"2408.07839","title":"Fast computation of the statistical significance test for\n  spatio-temporal receptive field estimates obtained using spike-triggered\n  averaging of binary pseudo-random sequences","authors":"Murat Okatan","authorsParsed":[["Okatan","Murat",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 22:24:35 GMT"}],"updateDate":"2024-08-16","timestamp":1723674275000,"abstract":"  Background: Spatio-temporal receptive fields (STRF) of visual neurons are\noften estimated using spike-triggered averaging of binary pseudo-random\nstimulus sequences. The stimuli are visual displays that contain black and\nwhite pixels that flicker randomly at a fixed frame rate without any spatial or\ntemporal correlation. The spike train of a visual neuron, such as a retinal\nganglion cell, is recorded simultaneously with the stimulus presentation. The\nneuron's STRF is estimated by averaging the stimulus frames that coincide with\nspikes at fixed latencies. Recently, an exact analytical method for determining\nthe statistical significance of the estimated value of the STRF pixels has been\ndeveloped. Application of the method on spike trains collected from individual\nmouse retinal ganglion cells revealed that the time required to compute the\ntest ranged from a couple of minutes to half a day for different neurons. New\nmethod: Here, this method is accelerated by using the Normal approximation to\nthe null distribution of STRF pixel estimates. Results: The significance\nthreshold and computation time obtained under the approximate distribution are\nexamined systematically as a function of various input spike trains collected\nfrom individual mouse retinal ganglion cells. Comparison with existing methods:\nThe accuracy and the time saved by the use of the approximate distribution are\nexamined in comparison with the exact distribution. Conclusions: For the real\ndata analyzed here, the approximate distribution yields the same significance\nthresholds as the exact distribution within a much shorter computation time.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}