{"id":"2408.14074","title":"Abstraction Engineering","authors":"Nelly Bencomo, Jordi Cabot, Marsha Chechik, Betty H.C. Cheng, Benoit\n  Combemale, Andrzej W\\k{a}sowski, Steffen Zschaler","authorsParsed":[["Bencomo","Nelly",""],["Cabot","Jordi",""],["Chechik","Marsha",""],["Cheng","Betty H. C.",""],["Combemale","Benoit",""],["Wąsowski","Andrzej",""],["Zschaler","Steffen",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 07:56:32 GMT"}],"updateDate":"2024-08-27","timestamp":1724658992000,"abstract":"  Modern software-based systems operate under rapidly changing conditions and\nface ever-increasing uncertainty. In response, systems are increasingly\nadaptive and reliant on artificial-intelligence methods. In addition to the\nubiquity of software with respect to users and application areas (e.g.,\ntransportation, smart grids, medicine, etc.), these high-impact software\nsystems necessarily draw from many disciplines for foundational principles,\ndomain expertise, and workflows. Recent progress with lowering the barrier to\nentry for coding has led to a broader community of developers, who are not\nnecessarily software engineers. As such, the field of software engineering\nneeds to adapt accordingly and offer new methods to systematically develop\nhigh-quality software systems by a broad range of experts and non-experts. This\npaper looks at these new challenges and proposes to address them through the\nlens of Abstraction. Abstraction is already used across many disciplines\ninvolved in software development -- from the time-honored classical deductive\nreasoning and formal modeling to the inductive reasoning employed by modern\ndata science. The software engineering of the future requires Abstraction\nEngineering -- a systematic approach to abstraction across the inductive and\ndeductive spaces. We discuss the foundations of Abstraction Engineering,\nidentify key challenges, highlight the research questions that help address\nthese challenges, and create a roadmap for future research.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mBQmbQPgJYk3JUju340XMESjeevCErJl97jWZAUW8ls","pdfSize":"574719"}
