{"id":"2408.06766","title":"Robust Black-box Testing of Deep Neural Networks using Co-Domain\n  Coverage","authors":"Aishwarya Gupta, Indranil Saha, Piyush Rai","authorsParsed":[["Gupta","Aishwarya",""],["Saha","Indranil",""],["Rai","Piyush",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 09:42:57 GMT"}],"updateDate":"2024-08-14","timestamp":1723542177000,"abstract":"  Rigorous testing of machine learning models is necessary for trustworthy\ndeployments. We present a novel black-box approach for generating test-suites\nfor robust testing of deep neural networks (DNNs). Most existing methods create\ntest inputs based on maximizing some \"coverage\" criterion/metric such as a\nfraction of neurons activated by the test inputs. Such approaches, however, can\nonly analyze each neuron's behavior or each layer's output in isolation and are\nunable to capture their collective effect on the DNN's output, resulting in\ntest suites that often do not capture the various failure modes of the DNN\nadequately. These approaches also require white-box access, i.e., access to the\nDNN's internals (node activations). We present a novel black-box coverage\ncriterion called Co-Domain Coverage (CDC), which is defined as a function of\nthe model's output and thus takes into account its end-to-end behavior.\nSubsequently, we develop a new fuzz testing procedure named CoDoFuzz, which\nuses CDC to guide the fuzzing process to generate a test suite for a DNN. We\nextensively compare the test suite generated by CoDoFuzz with those generated\nusing several state-of-the-art coverage-based fuzz testing methods for the DNNs\ntrained on six publicly available datasets. Experimental results establish the\nefficiency and efficacy of CoDoFuzz in generating the largest number of\nmisclassified inputs and the inputs for which the model lacks confidence in its\ndecision.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"IQoV1K5ZNoZpyFh5SJKqeEe37J_3peAZMn2l-PdiFiE","pdfSize":"1209420"}
