{"id":"2408.05285","title":"Semi-Supervised One-Shot Imitation Learning","authors":"Philipp Wu and Kourosh Hakhamaneshi and Yuqing Du and Igor Mordatch\n  and Aravind Rajeswaran and Pieter Abbeel","authorsParsed":[["Wu","Philipp",""],["Hakhamaneshi","Kourosh",""],["Du","Yuqing",""],["Mordatch","Igor",""],["Rajeswaran","Aravind",""],["Abbeel","Pieter",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 18:11:26 GMT"}],"updateDate":"2024-08-13","timestamp":1723227086000,"abstract":"  One-shot Imitation Learning~(OSIL) aims to imbue AI agents with the ability\nto learn a new task from a single demonstration. To supervise the learning,\nOSIL typically requires a prohibitively large number of paired expert\ndemonstrations -- i.e. trajectories corresponding to different variations of\nthe same semantic task. To overcome this limitation, we introduce the\nsemi-supervised OSIL problem setting, where the learning agent is presented\nwith a large dataset of trajectories with no task labels (i.e. an unpaired\ndataset), along with a small dataset of multiple demonstrations per semantic\ntask (i.e. a paired dataset). This presents a more realistic and practical\nembodiment of few-shot learning and requires the agent to effectively leverage\nweak supervision from a large dataset of trajectories. Subsequently, we develop\nan algorithm specifically applicable to this semi-supervised OSIL setting. Our\napproach first learns an embedding space where different tasks cluster\nuniquely. We utilize this embedding space and the clustering it supports to\nself-generate pairings between trajectories in the large unpaired dataset.\nThrough empirical results on simulated control tasks, we demonstrate that OSIL\nmodels trained on such self-generated pairings are competitive with OSIL models\ntrained with ground-truth labels, presenting a major advancement in the\nlabel-efficiency of OSIL.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}