{"id":"2408.04395","title":"Enhanced Semantic Graph Based Approach With Sentiment Analysis For User\n  Interest Retrieval From Social Sites","authors":"Usama Ahmed Jamal","authorsParsed":[["Jamal","Usama Ahmed",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 11:58:41 GMT"}],"updateDate":"2024-08-09","timestamp":1723118321000,"abstract":"  Blogs and social networking sites serve as a platform to the users for\nexpressing their interests, ideas and thoughts. Targeted marketing uses the\nrecommendation systems for suggesting their services and products to the users\nor clients. So the method used by target marketing is extraction of keywords\nand main topics from the user generated texts. Most of conventional methods\ninvolve identifying the personal interests just on the basis of surveys and\nrating systems. But the proposed research differs in manner that it aim at\nusing the user generated text as a source medium for identifying and analyzing\nthe personal interest as a knowledge base area of users. Semantic graph based\napproach is proposed research work that identifies the references of clients\nand users by analyzing their own texts such as tweets. The keywords need to be\nextracted from the text generated by the user on the social networking sites.\nThis can be made possible by using several algorithms that extracts the\nkeywords automatically from the available content provided by the user. Based\non frequency and degree it ranks the extracted keywords. Furthermore, semantic\ngraph based model assists in providing useful suggestions just by extracting\nthe interests of users by analyzing their contents from social media. In this\napproach graph comprises of nodes and edges where nodes represents the keywords\nextracted by the algorithm and edges shows the semantic connection between the\nnodes. The method does not require internet related user activities like\nsurveys or ratings to gather user interest related information.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Information Retrieval","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"CzeLn1hd-ym-dtUpjXbFFjRAxa2ZtHSnoTSnigdGMRE","pdfSize":"245484"}
