{"id":"2408.05162","title":"Evaluating fracture energy predictions using phase-field and\n  gradient-enhanced damage models for elastomers","authors":"S. Mohammad Mousavi, Ida Ang, Jason Mulderrig, Nikolaos Bouklas","authorsParsed":[["Mousavi","S. Mohammad",""],["Ang","Ida",""],["Mulderrig","Jason",""],["Bouklas","Nikolaos",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 16:32:22 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 17:13:26 GMT"}],"updateDate":"2024-08-22","timestamp":1723221142000,"abstract":"  Recently, the phase field method has been increasingly used for brittle\nfractures in soft materials like polymers, elastomers, and biological tissues.\nWhen considering finite deformations to account for the highly deformable\nnature of soft materials, the convergence of the phase-field method becomes\nchallenging, especially in scenarios of unstable crack growth. To overcome\nthese numerical difficulties, several approaches have been introduced, with\nartificial viscosity being among the most widely utilized. This study\ninvestigates the energy release rate due to crack propagation in hyperelastic\nnearly-incompressible materials and compares the phase-field method and a novel\ngradient-enhanced damage (GED) approach. First, we simulate unstable loading\nscenarios using the phase-field method, which leads to convergence problems. To\naddress these issues, we introduce artificial viscosity to stabilize the\nproblem and analyze its impact on the energy release rate utilizing a domain\nJ-integral approach giving quantitative measurements during crack propagation.\nIt is observed that the measured energy released rate during crack propagation\ndoes not comply with the imposed critical energy release rate, and shows\nnon-monotonic behavior. In the second part of the paper, we introduce a novel\nstretch-based GED model as an alternative to the phase-field method for\nmodeling crack evolution in elastomers. It is demonstrated that in this method,\nthe energy release rate can be obtained as an output of the simulation rather\nthan as an input which could be useful in the exploration of rate-dependent\nresponses, as one could directly impose chain-level criteria for damage\ninitiation. We show that while this novel approach provides reasonable results\nfor fracture simulations, it still suffers from some numerical issues that\nstrain-based GED formulations are known to be susceptible to.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Soft Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}