{"id":"2408.04467","title":"The challenge of detecting remote spectroscopic signatures from\n  radionuclides","authors":"Jacob Haqq-Misra, Vincent Kofman, Ravi K. Kopparapu","authorsParsed":[["Haqq-Misra","Jacob",""],["Kofman","Vincent",""],["Kopparapu","Ravi K.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 13:55:16 GMT"}],"updateDate":"2024-08-09","timestamp":1723125316000,"abstract":"  The characterization of exoplanetary atmospheres through transit spectra is\nbecoming increasingly feasible, and technology for direct detection remains\nongoing. The possibility of detecting spectral features could enable\nquantitative constraints on atmospheric composition or even serve as a\npotential biosignature, with the sensitivity of the instrument and observation\ntime as key limiting factors. This paper discusses the possibility that future\nremote observations could detect the presence of radioactive elements in the\natmospheres of exoplanets. Such radionuclides could arise from cosmogenic or\ngeologic sources, as well as from industrial sources, all of which occur on\nEarth. The detection of radionuclides in an exoplanetary atmosphere could\nreveal important properties about the planet's geology or space environment,\nand potentially could serve as a technosignature. However, many radionuclides,\nincluding those from industrial sources, attach to aerosol or other particles\nthat cannot be remotely characterized. Limited experimental and theoretical\nspectral data exist for long-lived radionuclides, but the sensitivity required\nto detect the spectral features of some known radionuclides would be at least\nseveral orders of magnitude greater than required to detect the spectral\nfeatures of molecular oxygen. Present-day remote spectroscopic observing\nmission concepts at ultraviolet to mid-infrared wavelengths are not sensitive\nto discern the presence of radionuclides in exoplanetary atmospheres.\nInterplanetary fly-by or probe missions may be more likely to provide such data\nin the future.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}