{"id":"2408.07644","title":"SigmaRL: A Sample-Efficient and Generalizable Multi-Agent Reinforcement\n  Learning Framework for Motion Planning","authors":"Jianye Xu, Pan Hu, Bassam Alrifaee","authorsParsed":[["Xu","Jianye",""],["Hu","Pan",""],["Alrifaee","Bassam",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 16:16:51 GMT"}],"updateDate":"2024-08-15","timestamp":1723652211000,"abstract":"  This paper introduces an open-source, decentralized framework named SigmaRL,\ndesigned to enhance both sample efficiency and generalization of multi-agent\nReinforcement Learning (RL) for motion planning of connected and automated\nvehicles. Most RL agents exhibit a limited capacity to generalize, often\nfocusing narrowly on specific scenarios, and are usually evaluated in similar\nor even the same scenarios seen during training. Various methods have been\nproposed to address these challenges, including experience replay and\nregularization. However, how observation design in RL affects sample efficiency\nand generalization remains an under-explored area. We address this gap by\nproposing five strategies to design information-dense observations, focusing on\ngeneral features that are applicable to most traffic scenarios. We train our RL\nagents using these strategies on an intersection and evaluate their\ngeneralization through numerical experiments across completely unseen traffic\nscenarios, including a new intersection, an on-ramp, and a roundabout.\nIncorporating these information-dense observations reduces training times to\nunder one hour on a single CPU, and the evaluation results reveal that our RL\nagents can effectively zero-shot generalize. Code:\ngithub.com/cas-lab-munich/SigmaRL\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Machine Learning","Computing Research Repository/Multiagent Systems","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}