{"id":"2408.08905","title":"PATopics: An automatic framework to extract useful information from\n  pharmaceutical patents documents","authors":"Pablo Cecilio, Ant\\^onio Perreira, Juliana Santos Rosa Viegas,\n  Washington Cunha, Felipe Viegas, Elisa Tuler, Fabiana Testa Moura de Carvalho\n  Vicentini, Leonardo Rocha","authorsParsed":[["Cecilio","Pablo",""],["Perreira","Antônio",""],["Viegas","Juliana Santos Rosa",""],["Cunha","Washington",""],["Viegas","Felipe",""],["Tuler","Elisa",""],["Vicentini","Fabiana Testa Moura de Carvalho",""],["Rocha","Leonardo",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 19:18:51 GMT"}],"updateDate":"2024-08-20","timestamp":1723490331000,"abstract":"  Pharmaceutical patents play an important role by protecting the innovation\nfrom copies but also drive researchers to innovate, create new products, and\npromote disruptive innovations focusing on collective health. The study of\npatent management usually refers to an exhaustive manual search. This happens,\nbecause patent documents are complex with a lot of details regarding the claims\nand methodology/results explanation of the invention. To mitigate the manual\nsearch, we proposed PATopics, a framework specially designed to extract\nrelevant information for Pharmaceutical patents. PATopics is composed of four\nbuilding blocks that extract textual information from the patents, build\nrelevant topics that are capable of summarizing the patents, correlate these\ntopics with useful patent characteristics and then, summarize the information\nin a friendly web interface to final users. The general contributions of\nPATopics are its ability to centralize patents and to manage patents into\ngroups based on their similarities. We extensively analyzed the framework using\n4,832 pharmaceutical patents concerning 809 molecules patented by 478\ncompanies. In our analysis, we evaluate the use of the framework considering\nthe demands of three user profiles -- researchers, chemists, and companies. We\nalso designed four real-world use cases to evaluate the framework's\napplicability. Our analysis showed how practical and helpful PATopics are in\nthe pharmaceutical scenario.\n","subjects":["Computing Research Repository/Digital Libraries","Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}