{"id":"2408.02838","title":"Interpretation of the Intent Detection Problem as Dynamics in a\n  Low-dimensional Space","authors":"Eduardo Sanchez-Karhunen, Jose F. Quesada-Moreno, Miguel A.\n  Guti\\'errez-Naranjo","authorsParsed":[["Sanchez-Karhunen","Eduardo",""],["Quesada-Moreno","Jose F.",""],["Gutiérrez-Naranjo","Miguel A.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 21:22:36 GMT"}],"updateDate":"2024-08-07","timestamp":1722892956000,"abstract":"  Intent detection is a text classification task whose aim is to recognize and\nlabel the semantics behind a users query. It plays a critical role in various\nbusiness applications. The output of the intent detection module strongly\nconditions the behavior of the whole system. This sequence analysis task is\nmainly tackled using deep learning techniques. Despite the widespread use of\nthese techniques, the internal mechanisms used by networks to solve the problem\nare poorly understood. Recent lines of work have analyzed the computational\nmechanisms learned by RNNs from a dynamical systems perspective. In this work,\nwe investigate how different RNN architectures solve the SNIPS intent detection\nproblem. Sentences injected into trained networks can be interpreted as\ntrajectories traversing a hidden state space. This space is constrained to a\nlow-dimensional manifold whose dimensionality is related to the embedding and\nhidden layer sizes. To generate predictions, RNN steers the trajectories\ntowards concrete regions, spatially aligned with the output layer matrix rows\ndirections. Underlying the system dynamics, an unexpected fixed point topology\nhas been identified with a limited number of attractors. Our results provide\nnew insights into the inner workings of networks that solve the intent\ndetection task.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computation and Language","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"405ETQj49xDqV0EAe7eokNKqsidxse3fP0Pkj-bfqLo","pdfSize":"1575617"}
