{"id":"2408.01233","title":"CLIP4Sketch: Enhancing Sketch to Mugshot Matching through Dataset\n  Augmentation using Diffusion Models","authors":"Kushal Kumar Jain, Steve Grosz, Anoop M. Namboodiri, Anil K. Jain","authorsParsed":[["Jain","Kushal Kumar",""],["Grosz","Steve",""],["Namboodiri","Anoop M.",""],["Jain","Anil K.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 12:48:36 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 12:46:39 GMT"}],"updateDate":"2024-08-14","timestamp":1722602916000,"abstract":"  Forensic sketch-to-mugshot matching is a challenging task in face\nrecognition, primarily hindered by the scarcity of annotated forensic sketches\nand the modality gap between sketches and photographs. To address this, we\npropose CLIP4Sketch, a novel approach that leverages diffusion models to\ngenerate a large and diverse set of sketch images, which helps in enhancing the\nperformance of face recognition systems in sketch-to-mugshot matching. Our\nmethod utilizes Denoising Diffusion Probabilistic Models (DDPMs) to generate\nsketches with explicit control over identity and style. We combine CLIP and\nAdaface embeddings of a reference mugshot, along with textual descriptions of\nstyle, as the conditions to the diffusion model. We demonstrate the efficacy of\nour approach by generating a comprehensive dataset of sketches corresponding to\nmugshots and training a face recognition model on our synthetic data. Our\nresults show significant improvements in sketch-to-mugshot matching accuracy\nover training on an existing, limited amount of real face sketch data,\nvalidating the potential of diffusion models in enhancing the performance of\nface recognition systems across modalities. We also compare our dataset with\ndatasets generated using GAN-based methods to show its superiority.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9Ewf2x6ZQI__YGP1w-W2fzUd-rkWWDRlCQ_NalIKKdo","pdfSize":"2754931","txDigest":"7LVnYQasHdrHLiMnY5ju4eWst24W8JJd2TKt19Rmzfrr","endEpoch":"1","status":"CERTIFIED"}
