{"id":"2408.09630","title":"Second-Order Moment Quantum Fluctuations and Quantum Equivalence\n  Principle","authors":"M.J.Luo","authorsParsed":[["Luo","M. J.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 01:26:01 GMT"}],"updateDate":"2024-08-20","timestamp":1724030761000,"abstract":"  The second-order moment quantum fluctuations or uncertainties are\nmass-dependent, the incompatibility between the quantum uncertainty principle\nand the equivalence principle is at the second-order moment (variation) level,\nbut the first-order moment (mean) level. To reconcile the two fundamental\nprinciples, we find that the second-order moment quantum fluctuations are\nactually distinguished into two parts: a dynamic part and a geometric part. The\ndynamic part is indeed mass-dependent and governed by a non-zero Hamiltonian in\na non-general-covariant inertial frame, and the geometric part is\nmass-independent and comes from coarse-graining and/or geometric effects. The\ndynamic part is coordinate dependent, it can be canceled away by a coordinate\ntransformation, and hence it plays no role in general covariant theories whose\nHamiltonian automatically vanishes. However, the geometric part is valid for\ngeneral coordinate, and it can not be eliminated by a coordinate\ntransformation. On the contrary, the geometric part of second-order moment\nfluctuation of quantum spacetime leads to coordinate transformation anomaly,\nwhich induces an effective Einstein's gravity theory. The geometric part is\nmass-independent and universal, so it is only this part measures the universal\nsecond-order moment quantum fluctuation of the spacetime, while the dynamic\npart plays no role in the general covariant description. The observation\ngeneralizes the classical equivalence principle to the quantum level. And\naccording to the principle, a general covariant theory with only geometric part\nquantum fluctuation, i.e. a non-linear sigma model, is proposed as a theory of\na material quantum reference frame system. The effects of the universal\nsecond-order moment quantum fluctuations in the material quantum reference\nsystem and its implications to an effective gravity theory are also discussed.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}