{"id":"2408.04191","title":"Resonant Beam Enabled DoA Estimation in Passive Positioning System","authors":"Yixuan Guo, Qingwei Jiang, Mengyuan Xu, Wen Fang, Qingwen Liu, Gang\n  Yan, Qunhui Yang, and Hai Lu","authorsParsed":[["Guo","Yixuan",""],["Jiang","Qingwei",""],["Xu","Mengyuan",""],["Fang","Wen",""],["Liu","Qingwen",""],["Yan","Gang",""],["Yang","Qunhui",""],["Lu","Hai",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 03:22:47 GMT"}],"updateDate":"2024-08-09","timestamp":1723087367000,"abstract":"  The rapid advancement of the next generation of communications and internet\nof things (IoT) technologies has made the provision of location-based services\nfor diverse devices an increasingly pressing necessity. Localizing devices\nwith/without intelligent computing abilities, including both active and passive\ndevices is essential, especially in indoor scenarios. For traditional RF\npositioning systems, aligning transmission signals and dealing with signal\ninterference in complex environments are inevitable challenges. Therefore, this\npaper proposed a new passive positioning system, the RF-band resonant beam\npositioning system (RF-RBPS), which achieves energy concentration and beam\nalignment by amplifying echoes between the base station (BS) and the passive\ntarget (PT), without the need for complex channel estimation and time-consuming\nbeamforming and provides high-precision direction of arrival (DoA) estimation\nfor battery-free targets using the resonant mechanism. The direction\ninformation of the PT is estimated using the multiple signal classification\n(MUSIC) algorithm at the end of BS. The feasibility of the proposed system is\nvalidated through theoretical analysis and simulations. Results indicate that\nthe proposed RF-RBPS surpasses RF-band active positioning system (RF-APS) in\nprecision, achieving millimeter-level precision at 2m within an elevation angle\nof 35$^\\circ$, and an error of less than 3cm at 2.5m within an elevation angle\nof 35$^\\circ$.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}