{"id":"2408.12242","title":"New-record-Tc and three-gap 2D superconductors with electronic and\n  phononic topology: KB2C2","authors":"Hao-Dong Liu, Xin-Peng Fu, Zhen-Guo Fu, Hong-Yan Lu, and Ping Zhang","authorsParsed":[["Liu","Hao-Dong",""],["Fu","Xin-Peng",""],["Fu","Zhen-Guo",""],["Lu","Hong-Yan",""],["Zhang","Ping",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 09:19:48 GMT"}],"updateDate":"2024-08-23","timestamp":1724318388000,"abstract":"  Pursuing higher-temperature superconductors under ambient pressure continues\nto be a prominent topic in materials discovery. Isomorphic structures like MgB2\nexhibit potential for conventional BCS-type superconductivity, but their\ntransition temperatures (Tc) have remained below 100 K based on both\nexperimental findings and theoretical predictions. In this study, two new\ntwo-dimensional (2D) superconductors with sandwich structures,KB2C2,featuring\nBC layers in AA and AB stacking configurations,are designed, whose Tc can\nexceed 112 K,setting a new record in 2D superconductors. The analyses suggest\nthat electrons in {\\sigma}-states covalent bonds and high-frequency E phonon\nmodes dominated by the in-plane vibrations of B/C atoms are predominately\nresponsible for electron-phonon coupling (EPC). An exciting robust three-gap\nsuperconducting nature stems from the strong and evident three-region\ndistribution characteristic of electronic EPC parameters {\\lambda}. When\nbiaxial tensile strain (BTS) is applied, their Tc are boosted above 153 K. The\nincrease in Tc originates from the softening of optical E phonon modes around\nthe {\\Gamma} point and acoustic modes around the Q point, rather than an\nincrease of electrons at the Fermi level (EF ) as observed in other similar\nsystems. Thus, phonon plays a more beneficial role in the EPC of BTS cases,\nhighlighting its significance as a medium in BCS superconductors. Moreover, we\nfind KB2C2 exhibits interesting topological properties, spin antivortex, and\nIsing-type spin splitting. This is the first report of the coexistence of\nnontrivial topology and superconductivity with such a high Tc. Therefore, KB2C2\nmay offer promising sandwich structures to explore higher-Tc 2D\nsuperconductors, alongside present potential avenues for investigating\nfundamental quantum physics.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/"}