{"id":"2408.13728","title":"3D-RCNet: Learning from Transformer to Build a 3D Relational ConvNet for\n  Hyperspectral Image Classification","authors":"Haizhao Jing, Liuwei Wan, Xizhe Xue, Haokui Zhang, Ying Li","authorsParsed":[["Jing","Haizhao",""],["Wan","Liuwei",""],["Xue","Xizhe",""],["Zhang","Haokui",""],["Li","Ying",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 05:41:47 GMT"}],"updateDate":"2024-08-27","timestamp":1724564507000,"abstract":"  Recently, the Vision Transformer (ViT) model has replaced the classical\nConvolutional Neural Network (ConvNet) in various computer vision tasks due to\nits superior performance. Even in hyperspectral image (HSI) classification\nfield, ViT-based methods also show promising potential. Nevertheless, ViT\nencounters notable difficulties in processing HSI data. Its self-attention\nmechanism, which exhibits quadratic complexity, escalates computational costs.\nAdditionally, ViT's substantial demand for training samples does not align with\nthe practical constraints posed by the expensive labeling of HSI data. To\novercome these challenges, we propose a 3D relational ConvNet named 3D-RCNet,\nwhich inherits both strengths of ConvNet and ViT, resulting in high performance\nin HSI classification. We embed the self-attention mechanism of Transformer\ninto the convolutional operation of ConvNet to design 3D relational\nconvolutional operation and use it to build the final 3D-RCNet. The proposed\n3D-RCNet maintains the high computational efficiency of ConvNet while enjoying\nthe flexibility of ViT. Additionally, the proposed 3D relational convolutional\noperation is a plug-and-play operation, which can be inserted into previous\nConvNet-based HSI classification methods seamlessly. Empirical evaluations on\nthree representative benchmark HSI datasets show that the proposed model\noutperforms previous ConvNet-based and ViT-based HSI approaches.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}