{"id":"2408.17230","title":"cosimmr: an R package for fast fitting of Stable Isotope Mixing Models\n  with covariates","authors":"Emma Govan, Andrew L Jackson, Stuart Bearhop, Richard Inger, Brian C\n  Stock, Brice X Semmens, Eric J Ward, Andrew C Parnell","authorsParsed":[["Govan","Emma",""],["Jackson","Andrew L",""],["Bearhop","Stuart",""],["Inger","Richard",""],["Stock","Brian C",""],["Semmens","Brice X",""],["Ward","Eric J",""],["Parnell","Andrew C",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 12:17:42 GMT"}],"updateDate":"2024-09-02","timestamp":1725020262000,"abstract":"  The study of animal diets and the proportional contribution that different\nfoods make to their diets is an important task in ecology. Stable Isotope\nMixing Models (SIMMs) are an important tool for studying an animal's diet and\nunderstanding how the animal interacts with its environment. We present\ncosimmr, a new R package designed to include covariates when estimating diet\nproportions in SIMMs, with simple functions to produce plots and summary\nstatistics. The inclusion of covariates allows for users to perform a more\nin-depth analysis of their system and to gain new insights into the diets of\nthe organisms being studied. A common problem with the previous generation of\nSIMMs is that they are very slow to produce a posterior distribution of dietary\nestimates, especially for more complex model structures, such as when\ncovariates are included. The widely-used Markov chain Monte Carlo (MCMC)\nalgorithm used by many traditional SIMMs often requires a very large number of\niterations to reach convergence. In contrast, cosimmr uses Fixed Form\nVariational Bayes (FFVB), which we demonstrate gives up to an order of\nmagnitude speed improvement with no discernible loss of accuracy. We provide a\nfull mathematical description of the model, which includes corrections for\ntrophic discrimination and concentration dependence, and evaluate its\nperformance against the state of the art MixSIAR model. Whilst MCMC is\nguaranteed to converge to the posterior distribution in the long term, FFVB\nconverges to an approximation of the posterior distribution, which may lead to\nsub-optimal performance. However we show that the package produces equivalent\nresults in a fraction of the time for all the examples on which we test. The\npackage is designed to be user-friendly and is based on the existing simmr\nframework.\n","subjects":["Statistics/Applications","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jr8BpZSNvE9pL3tQn8smW2cln0k4wxsqxrYVjciyqcI","pdfSize":"1607965"}
