{"id":"2408.07081","title":"MathBridge: A Large Corpus Dataset for Translating Spoken Mathematical\n  Expressions into $LaTeX$ Formulas for Improved Readability","authors":"Kyudan Jung, Sieun Hyeon, Jeong Youn Kwon, Nam-Joon Kim, Hyun Gon Ryu,\n  Hyuk-Jae Lee, Jaeyoung Do","authorsParsed":[["Jung","Kyudan",""],["Hyeon","Sieun",""],["Kwon","Jeong Youn",""],["Kim","Nam-Joon",""],["Ryu","Hyun Gon",""],["Lee","Hyuk-Jae",""],["Do","Jaeyoung",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 18:07:15 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 04:51:43 GMT"},{"version":"v3","created":"Fri, 16 Aug 2024 09:54:23 GMT"}],"updateDate":"2024-08-19","timestamp":1723054035000,"abstract":"  Improving the readability of mathematical expressions in text-based document\nsuch as subtitle of mathematical video, is an significant task. To achieve\nthis, mathematical expressions should be convert to compiled formulas. For\ninstance, the spoken expression ``x equals minus b plus or minus the square\nroot of b squared minus four a c, all over two a'' from automatic speech\nrecognition is more readily comprehensible when displayed as a compiled formula\n$x = \\frac{-b \\pm \\sqrt{b^2 - 4ac}}{2a}$. To convert mathematical spoken\nsentences to compiled formulas, two processes are required: spoken sentences\nare converted into LaTeX formulas, and LaTeX formulas are converted into\ncompiled formulas. The latter can be managed by using LaTeX engines. However,\nthere is no way to do the former effectively. Even if we try to solve this\nusing language models, there is no paired data between spoken sentences and\nLaTeX formulas to train it. In this paper, we introduce MathBridge, the first\nextensive dataset for translating mathematical spoken sentences into LaTeX\nformulas. MathBridge comprises approximately 23 million LaTeX formulas paired\nwith the corresponding mathematical spoken sentences. Through comprehensive\nevaluations, including fine-tuning with proposed data, we discovered that\nMathBridge significantly enhances the capabilities of pretrained language\nmodels for converting to LaTeX formulas from mathematical spoken sentences.\nSpecifically, for the T5-large model, the sacreBLEU score increased from 4.77\nto 46.8, demonstrating substantial enhancement.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}