{"id":"2408.01550","title":"Interplay between Exchange Interaction and Magnetic Shape Anisotropy of\n  ferromagnetic nanoparticles in a non-magnetic matrix for rare-earth-free\n  permanent magnets","authors":"Shouvik Sarker, Md Mahadi Rajib, Radhika Barua, Jayasimha Atulasimha","authorsParsed":[["Sarker","Shouvik",""],["Rajib","Md Mahadi",""],["Barua","Radhika",""],["Atulasimha","Jayasimha",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 19:43:33 GMT"}],"updateDate":"2024-08-06","timestamp":1722627813000,"abstract":"  Developing permanent magnets with fewer critical elements requires\nunderstanding hysteresis effects and coercivity through visualizing\nmagnetization reversal. Here, we numerically investigate the effect of the\ngeometry of nanoscale ferromagnetic inclusions in a paramagnetic/non-magnetic\nmatrix to understand the key factors that maximize the magnetic energy product\nof such nanocomposite systems. Specifically, we have considered a matrix of 3\nmicron x 3 micron x40 nanometer dimension, which is a sufficiently large\nvolume, two-dimensional representation considering that the ferromagnetic\ninclusions thickness is less than 3.33% of the lateral dimensions simulated.\nUsing this approach that is representative of bulk behavior while being\ncomputationally tractable for simulation, we systematically studied the effect\nof the thickness of ferromagnetic strips, the separation between the\nferromagnetic strips due to the nonmagnetic matrix material, and the length of\nthese ferromagnetic strips on magnetic coercivity and remanence by simulating\nthe hysteresis loop plots for each geometry. Furthermore, we study the\nunderlying micromagnetic mechanism for magnetic reversal to understand the\nfactors that could help attain the maximum magnetic energy densities for\nferromagnetic nanocomposite systems in a paramagnetic/non-magnetic material\nmatrix. In this study, we have used material parameters of an exemplary Alnico\nalloy system, a rare-earth-free, thermally stable nanocomposite, which could\npotentially replace high-strength NdFeB magnets in applications that don't\nrequire large energy products. This can stimulate further experimental work on\nthe fabrication and large-scale manufacturing of RE-free PMs with such\nnanocomposite systems.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"N6TgDsW9EAbUzXqi--fDPA0CIrbiXaFE5A8UVFNKqso","pdfSize":"1664469","txDigest":"GBsfx9HPGMZXGT9yLTCAPPyejgogoCrupdp39MJNydUL","endEpoch":"1","status":"CERTIFIED"}
