{"id":"2408.08166","title":"Infrared Spectra of Solid HCN Embedded in Various Molecular Environments\n  for Comparison with the Data Obtained with JWST","authors":"Maksim Ozhiganov, Mikhail Medvedev, Varvara Karteyeva, Ruslan Nakibov,\n  Uliana Sapunova, Vadim Krushinsky, Ksenia Stepanova, Anastasia Tryastsina,\n  Aleksandr Gorkovenko, Gleb Fedoseev, Anton Vasyunin","authorsParsed":[["Ozhiganov","Maksim",""],["Medvedev","Mikhail",""],["Karteyeva","Varvara",""],["Nakibov","Ruslan",""],["Sapunova","Uliana",""],["Krushinsky","Vadim",""],["Stepanova","Ksenia",""],["Tryastsina","Anastasia",""],["Gorkovenko","Aleksandr",""],["Fedoseev","Gleb",""],["Vasyunin","Anton",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 14:00:08 GMT"}],"updateDate":"2024-08-16","timestamp":1723730408000,"abstract":"  HCN molecules serve as an important tracer for chemical evolution of\nelemental nitrogen in the regions of star and planet formation. This is largely\nexplained by the fact that N atoms and N$_2$ molecules are poorly accessible\nfor the observation in the radio and infrared ranges. In turn, gas-phase HCN\ncan be observed at various stages of star formation including disks arounds\nyoung stars, cometary comas and atmospheres of the planetary satellites.\nDespite the large geography of gas-phase observations, an identification of\ninterstellar HCN ice is still lacking. In this work we present a series of\ninfrared spectroscopic measurements performed at the new ultra-high vacuum\ncryogenic apparatus aiming to facilitate the search for interstellar HCN ice. A\nseries of high resolution laboratory infrared spectra of HCN molecules embedded\nin the H$_2$O, H$_2$O:NH$_3$, CO, CO$_2$ and CH$_3$OH ices at 10~K temperature\nis obtained. These interstellar ice analogues aim to simulate the surroundings\nof HCN molecules by the main constituents of the icy mantles on the surface of\nthe interstellar grains. In addition, the spectra of HCN molecules embedded in\nthe solid C$_6$H$_6$, C$_5$H$_5$N and C$_6$H$_5$NH$_2$ are obtained to somehow\nsimulate the interaction of HCN molecules with carbonaceous material of the\ngrains rich in polycyclic aromatic hydrocarbons. The acquired laboratory\nspectroscopic data are compared with the publicly available results of NIRSpec\nJames Webb Space Telescope observations towards quiescent molecular clouds\nperformed by the ICEAge team.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}