{"id":"2408.00809","title":"Understanding and Tuning Magnetism in van der Waals-type Metal\n  Thiophosphates","authors":"Rabindra Basnet and Jin Hu","authorsParsed":[["Basnet","Rabindra",""],["Hu","Jin",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 21:02:30 GMT"}],"updateDate":"2024-08-05","timestamp":1722459750000,"abstract":"  Over the past two decades, significant progress in two-dimensional (2D)\nmaterials has invigorated research in condensed matter and material physics in\nlow dimensions. While traditionally studied in three-dimensional systems,\nmagnetism has now been extended to the 2D realm. Recent breakthroughs in 2D\nmagnetism have captured substantial interest from the scientific community,\nowing to the stable magnetic order achievable in atomically thin layers of the\nvan der Waals (vdW)-type layered magnetic materials. These advances offer an\nexciting platform for investigating related phenomena in low dimensions and\nhold promise for spintronic applications. Consequently, vdW magnetic materials\nwith tunable magnetism have attracted significant attention. Specifically,\nantiferromagnetic metal thiophosphates MPX3 (M = transition metal, P =\nphosphorus, X = chalcogen) have been investigated extensively. These materials\nexhibit long-range magnetic orders spanning from bulk to the 2D limit. The\nmagnetism in MPX3 arises from localized moments associated with transition\nmetal ions, making it tunable via substitutions and intercalations. In this\nreview, we focus on such tuning by providing a comprehensive summary of various\nmetal- and chalcogen-substitution and intercalation studies, along with the\nmechanism of magnetism modulation, and a perspective on the development of this\nemergent material family.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"aOWTzxdDVOxMLcvYUadbr2_9tkxJOkBLopkaTPq5_2E","pdfSize":"2957358","txDigest":"2qaWjoWFLf55F53EnXNWmCYiRehMSSb7A9NrBdaqfQMP","endEpoch":"1","status":"CERTIFIED"}
