{"id":"2408.15261","title":"Civiverse: A Dataset for Analyzing User Engagement with Open-Source\n  Text-to-Image Models","authors":"Maria-Teresa De Rosa Palmini and Laura Wagner and Eva Cetinic","authorsParsed":[["Palmini","Maria-Teresa De Rosa",""],["Wagner","Laura",""],["Cetinic","Eva",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 21:41:03 GMT"}],"updateDate":"2024-08-29","timestamp":1723326063000,"abstract":"  Text-to-image (TTI) systems, particularly those utilizing open-source\nframeworks, have become increasingly prevalent in the production of Artificial\nIntelligence (AI)-generated visuals. While existing literature has explored\nvarious problematic aspects of TTI technologies, such as bias in generated\ncontent, intellectual property concerns, and the reinforcement of harmful\nstereotypes, open-source TTI frameworks have not yet been systematically\nexamined from a cultural perspective. This study addresses this gap by\nanalyzing the CivitAI platform, a leading open-source platform dedicated to TTI\nAI. We introduce the Civiverse prompt dataset, encompassing millions of images\nand related metadata. We focus on prompt analysis, specifically examining the\nsemantic characteristics of text prompts, as it is crucial for addressing\nsocietal issues related to generative technologies. This analysis provides\ninsights into user intentions, preferences, and behaviors, which in turn shape\nthe outputs of these models. Our findings reveal a predominant preference for\ngenerating explicit content, along with a focus on homogenization of semantic\ncontent. These insights underscore the need for further research into the\nperpetuation of misogyny, harmful stereotypes, and the uniformity of visual\nculture within these models.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}