{"id":"2408.07103","title":"Orbital-Angular-Momentum Embedded Massive MIMO: Achieving Multiplicative\n  Spectrum-Efficiency for mmWave Communications","authors":"Wenchi Cheng, Hailin Zhang, Liping Liang, Haiyue Jing, and Zan Li","authorsParsed":[["Cheng","Wenchi",""],["Zhang","Hailin",""],["Liang","Liping",""],["Jing","Haiyue",""],["Li","Zan",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 03:24:37 GMT"}],"updateDate":"2024-08-15","timestamp":1723519477000,"abstract":"  By enabling very high bandwidth for radio communications, the millimeter-wave\n(mmWave), which can easily be integrated with\nmassive-multiple-input-multiple-output (massive-MIMO) due to small antenna\nsize, has been attracting growing attention as a candidate for the\nfifth-generation (5G) and 5G-beyond wireless communications networks. On the\nother hand, the communication over the orthogonal states/modes of orbital\nangular momentum (OAM) is a subset of the solutions offered by massive-MIMO\ncommunications. Traditional massive-MIMO based mmWave communications did not\nconcern the potential spectrum-efficiency-gain (SE-gain) offered by orthogonal\nstates of OAM. However, the highly expecting maximum SE-gain for OAM and\nmassive-MIMO communications is the product of SE-gains offered by OAM and\nmultiplexing-MIMO. In this paper, we propose the OAM-embedded-MIMO (OEM)\ncommunication framework to obtain the multiplicative SE-gain for joint OAM and\nmassive-MIMO based mmWave wireless communications. We design the parabolic\nantenna for each uniform circular array antenna to converge OAM signals. Then,\nwe develop the mode-decomposition and multiplexing-detection scheme to obtain\nthe transmit signal on each OAM-mode of each transmit antenna. Also, we develop\nthe OEM-water-filling power allocation policy to achieve the maximum\nmultiplicative SE-gain for OEM communications. The extensive simulations\nobtained validate and evaluate our developed parabolic antenna based converging\nmethod, mode-decomposition and multiplexing-detection scheme, and\nOEM-water-filling policy, showing that our proposed OEM mmWave communications\ncan significantly increase the spectrum-efficiency as compared with traditional\nmassive-MIMO based mmWave communications.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}