{"id":"2408.10601","title":"Wavelength-agnostic Metasurface Design for Next Generation 2D\n  Photodetectors","authors":"Ayush Mukund Jamdar, Rituraj, Srini Krishnamurthy, Vidya Praveen\n  Bhallamudi, Sivarama Krishnan","authorsParsed":[["Jamdar","Ayush Mukund",""],["Rituraj","",""],["Krishnamurthy","Srini",""],["Bhallamudi","Vidya Praveen",""],["Krishnan","Sivarama",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 07:28:28 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 05:20:46 GMT"}],"updateDate":"2024-08-22","timestamp":1724138908000,"abstract":"  We explore a versatile technique for inverse designing 2D photonic crystal\nmetasurfaces. These surfaces, known for their ability to manipulate\nlight-matter interactions, can be precisely controlled to achieve specific\nfunctionalities. The key lies in efficiently optimizing the geometric patterns\nand dimensions of the metasurface. Through a composite method which exploits\ntwo well-established paradigms - Covariance Matrix Adaptation optimization and\nRigorous Coupled Wave Analysis (RCWA), we demonstrate our ability to design and\noptimize resonances in metaelements to achieve desired optical performance such\nas near-perfect absorption at chosen wavelengths/optical modes, which otherwise\nproves to be challenging or even impossible with conventional inverse design\nimplementations. We apply our method to design three-layered structures\ninvolving a monolayer absorber, transparent metasubstrate, and a back mirror to\nget near 100% absorption at one or two chosen wavelengths. For illustration, we\nchoose black phosphorus and silicon metasurface to predict ~100% absorption in\na monolayer at 1550 nm. The versatile technique can be applied to tailor\nreflectance and transmittance for any optical mode and wavelength. This\ncomputationally efficient design method paves the way for creating\nhigh-performance 2D metasurface-based devices with a variety of applications,\nincluding quantum technology components such as single photon sensors and\nbiphoton sources, communication systems, and non-linear light conversion.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}