{"id":"2408.12098","title":"Temporal discontinuity trials and randomization: success rates versus\n  design strength","authors":"Brian Knaeble and Erich Kummerfeld","authorsParsed":[["Knaeble","Brian",""],["Kummerfeld","Erich",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 03:18:04 GMT"}],"updateDate":"2024-08-23","timestamp":1724296684000,"abstract":"  We consider the following comparative effectiveness scenario. There are two\ntreatments for a particular medical condition: a randomized experiment has\ndemonstrated mediocre effectiveness for the first treatment, while a\nnon-randomized study of the second treatment reports a much higher success\nrate. On what grounds might one justifiably prefer the second treatment over\nthe first treatment, given only the information from those two studies,\nincluding design details? This situation occurs in reality and warrants study.\nWe consider a particular example involving studies of treatments for Crohn's\ndisease. In order to help resolve these cases of asymmetric evidence, we make\nthree contributions and apply them to our example. First, we demonstrate the\npotential to improve success rates above those found in a randomized trial,\ngiven heterogeneous effects. Second, we prove that deliberate treatment\nassignment can be more efficient than randomization when study results are to\nbe transported to formulate an intervention policy on a wider population.\nThird, we provide formal conditions under which a temporal-discontinuity design\napproximates a randomized trial, and we introduce a novel design parameter to\ninform researchers about the strength of that approximation. Overall, our\nresults indicate that while randomization certainly provides special\nadvantages, other study designs such as temporal-discontinuity designs also\nhave distinct advantages, and can produce valuable evidence that informs\ntreatment decisions and intervention policy.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yT2NROkGISW3SmxsA6Avu-2K68o5fG4h2kkUheiU6no","pdfSize":"459558"}
