{"id":"2408.00574","title":"Investigation of Novel Preclinical Total Body PET Designed With J-PET\n  Technology:A Simulation Study","authors":"M. Dadgar, S. Parzych, F. Tayefi Ardebili, J. Baran, N. Chug, C.\n  Curceanu, E. Czerwinski, K. Dulski, K. Eliyan, A. Gajos, B. C. Hiesmayr, K.\n  Kacprzak, L. Kaplon, K. Klimaszewski, P. Konieczka, G. Korcyl, T. Kozik, W.\n  Krzemien, D. Kumar, S. Niedzwiecki, D. Panek, E. Perez del Rio, L. Raczynski,\n  S. Sharma, Shivani, R.Y. Shopa, M. Skurzok, K. Tayefi Ardebili, S.\n  Vandenberghe, W. Wislicki, E. Stepien, and P. Moskal","authorsParsed":[["Dadgar","M.",""],["Parzych","S.",""],["Ardebili","F. Tayefi",""],["Baran","J.",""],["Chug","N.",""],["Curceanu","C.",""],["Czerwinski","E.",""],["Dulski","K.",""],["Eliyan","K.",""],["Gajos","A.",""],["Hiesmayr","B. C.",""],["Kacprzak","K.",""],["Kaplon","L.",""],["Klimaszewski","K.",""],["Konieczka","P.",""],["Korcyl","G.",""],["Kozik","T.",""],["Krzemien","W.",""],["Kumar","D.",""],["Niedzwiecki","S.",""],["Panek","D.",""],["del Rio","E. Perez",""],["Raczynski","L.",""],["Sharma","S.",""],["Shivani","",""],["Shopa","R. Y.",""],["Skurzok","M.",""],["Ardebili","K. Tayefi",""],["Vandenberghe","S.",""],["Wislicki","W.",""],["Stepien","E.",""],["Moskal","P.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 14:06:37 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 09:28:02 GMT"}],"updateDate":"2024-08-07","timestamp":1722521197000,"abstract":"  The growing interest in human-grade total body positron emission tomography\n(PET) systems has also application in small animal research. Due to the\nexisting limitations in human-based studies involving drug development and\nnovel treatment monitoring, animal-based research became a necessary step for\ntesting and protocol preparation. In this simulation-based study two\nunconventional, cost-effective small animal total body PET scanners (for mouse\nand rat studies) have been investigated in order to inspect their feasibility\nfor preclinical research. They were designed with the novel technology explored\nby the Jagiellonian-PET (J-PET) Collaboration. Two main PET characteristics:\nsensitivity and spatial resolution were mainly inspected to evaluate their\nperformance. Moreover, the impact of the scintillator dimension and\ntime-of-flight on the latter parameter was examined in order to design the most\nefficient tomographs. The presented results show that for mouse TB J-PET the\nachievable system sensitivity is equal to 2.35% and volumetric spatial\nresolution to 9.46 +- 0.54 mm3, while for rat TB J-PET they are equal to 2.6%\nand 14.11 +- 0.80 mm3, respectively. Furthermore, it was shown that the\ndesigned tomographs are almost parallax-free systems, hence, they resolve the\nproblem of the acceptance criterion tradeoff between enhancing spatial\nresolution and reducing sensitivity.\n","subjects":["Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"t8vUR-MirBlQyNQF0prtJu6I5H6lFdw1B4N4hCl388I","pdfSize":"1465677"}
