{"id":"2408.00321","title":"Do all the quasars and high-excitation radio galaxies (HERGs) in the\n  3CRR catalog contain a magnetically arrested disk (MAD)?","authors":"Shuang-Liang Li, Wenwen Zuo, Xinwu Cao","authorsParsed":[["Li","Shuang-Liang",""],["Zuo","Wenwen",""],["Cao","Xinwu",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 06:43:10 GMT"}],"updateDate":"2024-08-02","timestamp":1722494590000,"abstract":"  Based on the magnetization, an accretion disk with large-scale magnetic field\ncan be separated into either standard and normal evolution (SANE) or\nmagnetically arrested disk (MAD), which are difficult to identify from\nobservations. It is still unclear whether all the radio-loud active galactic\nnuclei (RLAGNs) with a thin disk and strong radio emissions contain a MAD. We\ninvestigate this issue by utilizing the 3CRR catalog. We compile a sample of 35\nquasars and 14 high-excitation radio galaxies powered by a thin accretion disk.\nIn order to consistently compare with the MAD sample given by Li et al. (2022),\nthe optical-UV emissions of our sample are all detected by the Hubble Space\nTelescope (HST). It is found that the average X-ray luminosity ($L_{\\rm X}$) of\nour sample is about 5.0 times higher than that of radio-quiet AGNs (RQAGNs)\nwith matching optical-UV luminosity ($L_{\\rm UV}$), in general accord with the\nfactor of 4.5 times in MAD sample within the uncertainty. The relationship\nbetween radio (5~GHz) and X-ray (2 keV) luminosities in the 3CRR sources is\nalso found to be consistent with the MAD sample. Furthermore, the jet\nefficiencies of 3CRR sources are consistent with those from the GRMHD\nsimulations of MAD. Therefore, we suggest that probably all the quasars and at\nleast a fraction of high-excitation radio galaxies in the 3CRR catalog, and\nperhaps all the RLAGNs with strong radio emissions contain a MAD.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}