{"id":"2408.12680","title":"Can LLMs Understand Social Norms in Autonomous Driving Games?","authors":"Boxuan Wang, Haonan Duan, Yanhao Feng, Xu Chen, Yongjie Fu, Zhaobin\n  Mo, Xuan Di","authorsParsed":[["Wang","Boxuan",""],["Duan","Haonan",""],["Feng","Yanhao",""],["Chen","Xu",""],["Fu","Yongjie",""],["Mo","Zhaobin",""],["Di","Xuan",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 18:39:00 GMT"},{"version":"v2","created":"Sun, 1 Sep 2024 05:24:15 GMT"}],"updateDate":"2024-09-04","timestamp":1724351940000,"abstract":"  Social norm is defined as a shared standard of acceptable behavior in a\nsociety. The emergence of social norms fosters coordination among agents\nwithout any hard-coded rules, which is crucial for the large-scale deployment\nof AVs in an intelligent transportation system. This paper explores the\napplication of LLMs in understanding and modeling social norms in autonomous\ndriving games. We introduce LLMs into autonomous driving games as intelligent\nagents who make decisions according to text prompts. These agents are referred\nto as LLM-based agents. Our framework involves LLM-based agents playing Markov\ngames in a multi-agent system (MAS), allowing us to investigate the emergence\nof social norms among individual agents. We aim to identify social norms by\ndesigning prompts and utilizing LLMs on textual information related to the\nenvironment setup and the observations of LLM-based agents. Using the OpenAI\nChat API powered by GPT-4.0, we conduct experiments to simulate interactions\nand evaluate the performance of LLM-based agents in two driving scenarios:\nunsignalized intersection and highway platoon. The results show that LLM-based\nagents can handle dynamically changing environments in Markov games, and social\nnorms evolve among LLM-based agents in both scenarios. In the intersection\ngame, LLM-based agents tend to adopt a conservative driving policy when facing\na potential car crash. The advantage of LLM-based agents in games lies in their\nstrong operability and analyzability, which facilitate experimental design.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"1rZKwyqwn5TwlCD259OrUZj0JofGIsx5I_GVrJk5iPg","pdfSize":"966862"}
