{"id":"2408.15246","title":"Multi-Slice Spatial Transcriptomics Data Integration Analysis with\n  STG3Net","authors":"Donghai Fang, Fangfang Zhu and Wenwen Min","authorsParsed":[["Fang","Donghai",""],["Zhu","Fangfang",""],["Min","Wenwen",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 02:31:12 GMT"}],"updateDate":"2024-08-29","timestamp":1723170672000,"abstract":"  With the rapid development of the latest Spatially Resolved Transcriptomics\n(SRT) technology, which allows for the mapping of gene expression within tissue\nsections, the integrative analysis of multiple SRT data has become increasingly\nimportant. However, batch effects between multiple slices pose significant\nchallenges in analyzing SRT data. To address these challenges, we have\ndeveloped a plug-and-play batch correction method called Global Nearest\nNeighbor (G2N) anchor pairs selection. G2N effectively mitigates batch effects\nby selecting representative anchor pairs across slices. Building upon G2N, we\npropose STG3Net, which cleverly combines masked graph convolutional\nautoencoders as backbone modules. These autoencoders, integrated with\ngenerative adversarial learning, enable STG3Net to achieve robust multi-slice\nspatial domain identification and batch correction. We comprehensively evaluate\nthe feasibility of STG3Net on three multiple SRT datasets from different\nplatforms, considering accuracy, consistency, and the F1LISI metric (a measure\nof batch effect correction efficiency). Compared to existing methods, STG3Net\nachieves the best overall performance while preserving the biological\nvariability and connectivity between slices. Source code and all public\ndatasets used in this paper are available at\nhttps://github.com/wenwenmin/STG3Net and https://zenodo.org/records/12737170.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}