{"id":"2408.00740","title":"Matched Guiding and Controlled Injection in Dark-Current-Free,\n  10-GeV-Class, Channel-Guided Laser Plasma Accelerators","authors":"A. Picksley, J. Stackhouse, C. Benedetti, K. Nakamura, H. E. Tsai, R.\n  Li, B. Miao, J. E. Shrock, E. Rockafellow, H. M. Milchberg, C. B. Schroeder,\n  J. van Tilborg, E. Esarey, C. G. R. Geddes, A. J. Gonsalves","authorsParsed":[["Picksley","A.",""],["Stackhouse","J.",""],["Benedetti","C.",""],["Nakamura","K.",""],["Tsai","H. E.",""],["Li","R.",""],["Miao","B.",""],["Shrock","J. E.",""],["Rockafellow","E.",""],["Milchberg","H. M.",""],["Schroeder","C. B.",""],["van Tilborg","J.",""],["Esarey","E.",""],["Geddes","C. G. R.",""],["Gonsalves","A. J.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 17:39:43 GMT"}],"updateDate":"2024-08-02","timestamp":1722533983000,"abstract":"  We measure the high intensity laser propagation throughout meter-scale,\nchannel-guided LPAs by adjusting the length of the plasma channel on a\nshot-by-shot basis, showing high quality guiding of 500 TW laser pulses over 30\ncm in a hydrogen plasma of density $n_0 \\approx 1 \\times 10^{17} \\,\n\\mathrm{cm^{-3}}$. We observed transverse energy transport of higher-order\nmodes in the first $\\approx 12 \\, \\mathrm{cm}$ of the plasma channel, followed\nby quasi-matched propagation, and the gradual, dark-current-free depletion of\nlaser energy to the wakefield. We quantify the laser-to-wake transfer\nefficiency limitations of currently available PW-class laser systems, and\ndemonstrate via simulation how control over the laser mode can significantly\nimprove accelerated beam parameters. Using just 21.3 J of laser energy, and\ntriggering localized electron injection into the accelerator, we observed\nelectron bunches with single, quasimonoenergetic peaks, relative energy spreads\nas low as 3 % and energy up to 9.2 GeV with charge extending beyond 10 GeV.\n","subjects":["Physics/Plasma Physics","Physics/Accelerator Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KtWhTWsq-l9apZOsYb26_OXFruS-9_aKJLBVzfaBg0g","pdfSize":"3310175","txDigest":"CAdvvtjVJLz79ebujnKwS82Y4dzChDvaDR9geKR9CEZ4","endEpoch":"1","status":"CERTIFIED"}
