{"id":"2408.17047","title":"PIB: Prioritized Information Bottleneck Framework for Collaborative Edge\n  Video Analytics","authors":"Zhengru Fang, Senkang Hu, Liyan Yang, Yiqin Deng, Xianhao Chen,\n  Yuguang Fang","authorsParsed":[["Fang","Zhengru",""],["Hu","Senkang",""],["Yang","Liyan",""],["Deng","Yiqin",""],["Chen","Xianhao",""],["Fang","Yuguang",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 07:08:48 GMT"}],"updateDate":"2024-09-02","timestamp":1725001728000,"abstract":"  Collaborative edge sensing systems, particularly in collaborative perception\nsystems in autonomous driving, can significantly enhance tracking accuracy and\nreduce blind spots with multi-view sensing capabilities. However, their limited\nchannel capacity and the redundancy in sensory data pose significant\nchallenges, affecting the performance of collaborative inference tasks. To\ntackle these issues, we introduce a Prioritized Information Bottleneck (PIB)\nframework for collaborative edge video analytics. We first propose a\npriority-based inference mechanism that jointly considers the signal-to-noise\nratio (SNR) and the camera's coverage area of the region of interest (RoI). To\nenable efficient inference, PIB reduces video redundancy in both spatial and\ntemporal domains and transmits only the essential information for the\ndownstream inference tasks. This eliminates the need to reconstruct videos on\nthe edge server while maintaining low latency. Specifically, it derives\ncompact, task-relevant features by employing the deterministic information\nbottleneck (IB) method, which strikes a balance between feature informativeness\nand communication costs. Given the computational challenges caused by IB-based\nobjectives with high-dimensional data, we resort to variational approximations\nfor feasible optimization. Compared to TOCOM-TEM, JPEG, and HEVC, PIB achieves\nan improvement of up to 15.1\\% in mean object detection accuracy (MODA) and\nreduces communication costs by 66.7% when edge cameras experience poor channel\nconditions.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/"}