{"id":"2408.01646","title":"Feasibility of Liquid-phase Xenon Proportional Scintillation for\n  Low-energy Physics","authors":"Jianyang Qi, Kaixuan Ni, Haiwen Xu, Yue Ma, Yuechen Liu","authorsParsed":[["Qi","Jianyang",""],["Ni","Kaixuan",""],["Xu","Haiwen",""],["Ma","Yue",""],["Liu","Yuechen",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 03:18:03 GMT"}],"updateDate":"2024-08-06","timestamp":1722655083000,"abstract":"  Dual phase xenon time projection chambers (TPCs) detect both the\nscintillation photons and ionization electrons created by energy depositions\nwithin the liquid xenon (LXe) volume. The electrons are extracted from the\ninteraction site through a gas gap, where they meet a high electric field where\nproportional scintillation occurs. This converts the electron signal into a\nlight signal, and yields a high electron detection efficiency with a gain of\ntens of photoelectrons (PE) per electron. This technique of detecting both\nscintillation and ionization gives dual phase xenon TPCs the capability to\ndistinguish between electronic and nuclear recoils, which is a key part of how\nthese detectors are able to reach world-leading limits on Weakly Interacting\nMassive Particle (WIMP) dark matter. However, not all electrons can be\nextracted through the liquid-gas interface, and a constant millimeter-scale gas\ngap needs to be maintained, which may be a technological challenge if\ndual-phase xenon TPCs are to be scaled up for future dark matter searches.\nFurthermore, there is a background of single-electron peaks that follow a large\nionization signal (S2) of unclear origin which may be due in part to the\nliquid-gas interface, and limits the sensitivity of these detectors towards low\nmass dark matter. In this paper, we demonstrate that a purely single-phase\nliquid xenon TPC which produces proportional scintillation directly in the\nliquid is still capable of discriminating between electronic and nuclear\nrecoils, but that the background of single-electrons following an S2 is still\nlikely unrelated to the liquid-gas interface.\n","subjects":["Physics/Instrumentation and Detectors","Physics/High Energy Physics - Experiment"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}