{"id":"2408.04112","title":"Patchview: LLM-Powered Worldbuilding with Generative Dust and Magnet\n  Visualization","authors":"John Joon Young Chung and Max Kreminski","authorsParsed":[["Chung","John Joon Young",""],["Kreminski","Max",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 22:27:19 GMT"}],"updateDate":"2024-08-09","timestamp":1723069639000,"abstract":"  Large language models (LLMs) can help writers build story worlds by\ngenerating world elements, such as factions, characters, and locations.\nHowever, making sense of many generated elements can be overwhelming. Moreover,\nif the user wants to precisely control aspects of generated elements that are\ndifficult to specify verbally, prompting alone may be insufficient. We\nintroduce Patchview, a customizable LLM-powered system that visually aids\nworldbuilding by allowing users to interact with story concepts and elements\nthrough the physical metaphor of magnets and dust. Elements in Patchview are\nvisually dragged closer to concepts with high relevance, facilitating\nsensemaking. The user can also steer the generation with verbally elusive\nconcepts by indicating the desired position of the element between concepts.\nWhen the user disagrees with the LLM's visualization and generation, they can\ncorrect those by repositioning the element. These corrections can be used to\nalign the LLM's future behaviors to the user's perception. With a user study,\nwe show that Patchview supports the sensemaking of world elements and steering\nof element generation, facilitating exploration during the worldbuilding\nprocess. Patchview provides insights on how customizable visual representation\ncan help sensemake, steer, and align generative AI model behaviors with the\nuser's intentions.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"I4II6xFRzEZX6AQYCa-mpuedE9Q0Pf77orkQkybtIE0","pdfSize":"5633818"}
