{"id":"2408.16203","title":"Magnetically dead layer in interacting ultrafine NiFe2O4 nanoparticles","authors":"Yu. V. Knyazev, D. A. Balaev, S.V. Stolyar, A.O. Shokhrina, D. A.\n  Velikanov, A. I. Pankrats, A. M. Vorotynov, A. A. Krasikov, S.A.\n  Skorobogatov, M.N. Volochaev, O. A. Bayukov, R. S. Iskhakov","authorsParsed":[["Knyazev","Yu. V.",""],["Balaev","D. A.",""],["Stolyar","S. V.",""],["Shokhrina","A. O.",""],["Velikanov","D. A.",""],["Pankrats","A. I.",""],["Vorotynov","A. M.",""],["Krasikov","A. A.",""],["Skorobogatov","S. A.",""],["Volochaev","M. N.",""],["Bayukov","O. A.",""],["Iskhakov","R. S.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 01:47:27 GMT"}],"updateDate":"2024-08-30","timestamp":1724896047000,"abstract":"  The relation of the magnetically dead layer and structural defects in\nultrafine interacting NiFe2O4 nanoparticles (<d> = 4 nm) have been investigated\nusing transmission electron microscopy, X-ray diffraction, ^57Fe M\\\"ossbauer\nspectroscopy, and dc magnetization and ac susceptibility measurements.\nAccording to the magnetic data, we found out three magnetic subsystems in\nNiFe2O4 nanoparticles. The first one with the lowest blocking (spin freezing)\ntemperature (TS = 8 K) established by atomic magnetic moments of magnetically\ndisordered particles with the d < 4 nm. The other two subsystems are formed by\nthe magnetic moments of the \"core\" of nanoparticles having size more than 4 nm\nand correlated surface spins in nanoparticle clusters, correspondingly.\nMagnetic moments of ferrimagnetically ordered \"core\" are blocking at a higher\ntemperature ( \\approx 40 K). It has been shown that the most significant\ncontribution to the energy dissipation is made upon blocking of the correlated\nnanoparticle surface spins from the magnetically dead layer on the\nnanoparticles' surface. By the magnetic data, the thickness of this layer is\ndmd \\approx 1 nm for a particle with the <d> \\approx 4 nm. At the same time or\nmeanwhile, the ^57Fe M\\\"ossbauer spectroscopy has revealed a structural\ndisorder penetrating to a depth of up to dcd \\approx 0.6 nm in a particle with\n<d> = 4 nm. This evidences for a faster destruction of the magnetic order as\ncompared with the crystal order upon moving away from the center of a particle\nto its periphery.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}