{"id":"2408.10893","title":"The Programmable Liquid-crystal Active Coronagraphic Imager for the DAG\n  telescope (PLACID) instrument: On-site status update ahead of first light","authors":"Jonas G. K\\\"uhn, Laurent Jolissaint, Audrey Baur, Liurong Lin, Axel\n  Potier, Ruben Tandon, Derya \\\"Ozt\\\"urk \\c{C}etni, Daniele Piazza, Mathias\n  Br\\\"andli, Iljadin Manurung, Martin Rieder","authorsParsed":[["Kühn","Jonas G.",""],["Jolissaint","Laurent",""],["Baur","Audrey",""],["Lin","Liurong",""],["Potier","Axel",""],["Tandon","Ruben",""],["Çetni","Derya Öztürk",""],["Piazza","Daniele",""],["Brändli","Mathias",""],["Manurung","Iljadin",""],["Rieder","Martin",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 14:21:10 GMT"}],"updateDate":"2024-08-21","timestamp":1724163670000,"abstract":"  The Programmable Liquid-crystal Active Coronagraphic Imager for the DAG\ntelescope (PLACID) instrument is a novel high-contrast direct imaging facility\nthat was recently delivered to the Turkish 4-m DAG telescope, with first light\nanticipated by the end of 2024. In a nutshell, PLACID consists in a fore-optics\ncoronagraphic intermediate stage platform, installed in-between the TROIA XAO\nsystem and the DIRAC HAWAII-1RG focal-plane array. The PLACID project, led by a\nconsortium of Swiss Universities contracted by the Atat\\\"urk University\nAstrophysics Research and Application Center (ATASAM), has passed the Delivery\nReadiness Review (DRR) milestone in September 2023, and was delivered to ATASAM\ncampus facilities in March 2024. The PLACID commissioning activities with the\ncalibration light source at the summit, on the DAG telescope Nasmyth platform,\nare foreseen to take place this fall, with first light scheduled to take place\nbefore the end of the year. When on-sky, PLACID will be the world's first\n''active coronagraph'' facility, fielding a customized spatial light modulator\n(SLM) acting as a dynamically programmable focal-plane phase mask (FPM)\ncoronagraph from H- to Ks-band. This will provide a wealth of novel options to\nobservers, among which software-only abilities to change or re-align the FPM\npattern in function of conditions or science requirements, free of any actuator\nmotion. Future features will include non-common path aberrations (NCPA)\nself-calibration, optimized coronagraphy for binary stars, as well as coherent\ndifferential imaging (CDI). We hereby present the delivered PLACID instrument,\nits current capabilities, and Factory Acceptance commissioning results with\nrelevant performance metrics.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ELDM78t-FIiSuzeWXbT6fzF7noCVSfTjBULj5touYV0","pdfSize":"2341691"}
