{"id":"2408.01176","title":"Power Aware Container Placement in Cloud Computing with Affinity and\n  Cubic Power Model","authors":"Suvarthi Sarkar, Nandini Sharma, Akshat Mittal, Aryabartta Sahu","authorsParsed":[["Sarkar","Suvarthi",""],["Sharma","Nandini",""],["Mittal","Akshat",""],["Sahu","Aryabartta",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 10:59:13 GMT"}],"updateDate":"2024-08-05","timestamp":1722596353000,"abstract":"  Modern data centres are increasingly adopting containers to enhance power and\nperformance efficiency. These data centres consist of multiple heterogeneous\nmachines, each equipped with varying amounts of resources such as CPU, I/O,\nmemory, and network bandwidth. Data centers rent their resources to\napplications, which demand different amounts of resources and execute on\nmachines for extended durations if the machines provide the demanded resources\nto the applications. Certain applications run efficiently on specific machines,\nreferred to as system affinity between applications and machines. In contrast,\nothers are incompatible with specific machines, referred to as anti-affinity\nbetween applications and machines. We consider that there are multiple\napplications, and data centers need to execute as many applications as\npossible. Data centers incur electricity based on CPU usage due to the\nexecution of applications, with the cost being proportional to the cube of the\ntotal CPU usage. It is a challenging problem to place applications on the\nmachines they have an affinity for while keeping the electricity cost in check.\nOur work addresses the placement problem of matching applications to machines\nto minimize overall electricity costs while maximizing the number of affinity\npairs of machines and applications. We propose three solution approaches: (a)\nPower-Aware Placement (PAP): applications are placed on machines where power\nusage is minimized, (b) Affinity-Aware Placement (AAP): applications are placed\non machines where affinity is maximized, (c) Combined Power-Affinity Placement\n(CPAAP): this approach integrates the benefits of both PAP and AAP. Our\nproposed approach improves the affinity satisfaction ratio by up to 4% while\nreducing the total system cost by up to 26% and improving the affinity payoff\nratio by up to 37% compared to state-of-the-art approaches for real-life\ndatasets.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}