{"id":"2408.07795","title":"Exoskeleton-Assisted Balance and Task Evaluation During Quiet Stance and\n  Kneeling in Construction","authors":"Gayatri Sreenivasan, Chunchu Zhu, Jingang Yi","authorsParsed":[["Sreenivasan","Gayatri",""],["Zhu","Chunchu",""],["Yi","Jingang",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 20:14:03 GMT"}],"updateDate":"2024-08-16","timestamp":1723666443000,"abstract":"  Construction workers exert intense physical effort and experience serious\nsafety and health risks in hazardous working environments. Quiet stance and\nkneeling are among the most common postures performed by construction workers\nduring their daily work. This paper analyzes lower-limb joint influence on\nneural balance control strategies using the frequency behavior of the\nintersection point of ground reaction forces. To evaluate the impact of\nelevation and wearable knee exoskeletons on postural balance and welding task\nperformance, we design and integrate virtual- and mixed-reality (VR/MR) to\nsimulate elevated environments and welding tasks. A linear quadratic\nregulator-controlled triple- and double-link inverted pendulum model is used\nfor balance strategy quantification in quiet stance and kneeling, respectively.\nExtensive multi-subject experiments are conducted to evaluate the usability of\noccupational exoskeletons in destabilizing construction environments. The\nquantified balance strategies capture the significance of knee joint during\nbalance control of quiet stance and kneeling gaits. Results show that center of\npressure sway area reduced up to 62% in quiet stance and 39% in kneeling for\nsubjects tested in high-elevation VR/MR worksites when provided knee\nexoskeleton assistance. The comprehensive balance and multitask evaluation\nmethodology developed aims to reveal exoskeleton design considerations to\nmitigate the fall risk in construction.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}