{"id":"2408.03262","title":"Towards Fixing Panic Bugs for Real-world Rust Programs","authors":"Yunbo Ni, Yang Feng, Zixi Liu, Runtao Chen, Baowen Xu","authorsParsed":[["Ni","Yunbo",""],["Feng","Yang",""],["Liu","Zixi",""],["Chen","Runtao",""],["Xu","Baowen",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 15:53:46 GMT"}],"updateDate":"2024-08-07","timestamp":1722959626000,"abstract":"  The Rust programming language has garnered significant attention due to its\nrobust safety features and memory management capabilities. Despite its\nguaranteed memory safety, Rust programs still suffer from runtime errors that\nare unmanageable, i.e., panic errors. Notably, over half of the bugs in rustc,\nRust's own compiler, are attributable to crash stemming from panic errors.\nHowever, understanding root causes and resolving these panics often requires\nsubstantial effort due to the limited information provided, and the stack\nbacktrace could be intricate, often omitting the actual fault locations.\nAlthough numerous automated program repair techniques exist, we observe that\nthe prevailing fix patterns do not readily apply to Rust programs due to\nnatural differences in language mechanisms. To tackle the above challenges,\nthis paper introduces a systematic study aimed at fixing Rust panic bugs. We\ncommence by assembling a dataset, namely Panic4R, which includes 102 real panic\nbugs and their fixes from the top 500 most downloaded open-source crates. By\nanalyzing Rust's implementation, we identify Rust-specific patterns for fixing\npanic bugs, which can aid in understanding and providing guidance for\ngenerating patches. Finally, we design and implement the first automated fixing\ntool, PanicKiller, for Rust panic bugs, which effectively generates correct\npatches on the real-world large-scale dataset, and has already assisted in the\nresolution of 28 panic bugs in open-source projects. Each resolved issue has\nbeen validated by the developers and merged into the respective codebases.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}