{"id":"2408.10707","title":"High-redshift Cosmology by Gamma-Ray Bursts: an overview","authors":"Giada Bargiacchi, Maria Giovanna Dainotti, Salvatore Capozziello","authorsParsed":[["Bargiacchi","Giada",""],["Dainotti","Maria Giovanna",""],["Capozziello","Salvatore",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 10:13:23 GMT"}],"updateDate":"2024-08-21","timestamp":1724148803000,"abstract":"  Several correlations among Gamma-Ray Bursts (GRBs) quantities, both in the\nprompt and afterglow emissions, have been established during the last decades,\nthus enabling the standardization of GRBs as cosmological probes. Since GRBs\nare observed up to redshift $z \\sim 9$, they represent a valuable tool to fill\nin the gap of information on the Universe evolution between the farthest type\nIa supernovae and the Cosmic Microwave Background Radiation and to shed new\nlight on the current challenging cosmological tensions. Without claiming for\ncompleteness, here we describe the state of the art of GRB correlations, their\ntheoretical interpretations, and their cosmological applications both as\nstandalone probes and in combination with other probes. In this framework, we\npinpoint the importance of correcting the correlations for selection biases and\nredshift evolution to derive intrinsic relations, the assets of combining\nprobes at different scales, and the need for the employment of the appropriate\ncosmological likelihood to precisely constrain cosmological parameters.\nFurthermore, we emphasize the benefits of the cosmographic approach to avoid\nany cosmological assumptions and the valuable applications of machine learning\ntechniques to reconstruct GRB light curves and predict unknown GRB redshifts.\nFinally, we stress the relevance of all these factors, along with future\nobservations, to definitely boost the power of GRBs in cosmology.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}