{"id":"2408.10214","title":"A Memory Reduction Compact Gas Kinetic Scheme on 3D Unstructured Meshes","authors":"Hongyu Liu, Xing Ji, Yunpeng Mao, Zhe Qian, Kun Xu","authorsParsed":[["Liu","Hongyu",""],["Ji","Xing",""],["Mao","Yunpeng",""],["Qian","Zhe",""],["Xu","Kun",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 04:21:26 GMT"}],"updateDate":"2024-08-21","timestamp":1721622086000,"abstract":"  This paper introduces a memory-reduction third-order compact gas-kinetic\nscheme (CGKS) for solving compressible Euler and Navier-Stokes equations on 3D\nunstructured meshes. The scheme utilizes a time-evolution gas distribution\nfunction to provide a time-evolution solution at cell interfaces, enabling the\nimplementation of Hermite WENO techniques for high-order reconstruction.\nHowever, the HWENO method needs to store a coefficients matrix for the\nquadratic polynomial to achieve third-order accuracy, resulting in high memory\nusage. A novel reconstruction method, built upon HWENO reconstruction, has been\ndesigned to enhance computational efficiency and reduce memory usage compared\nto the original CGKS. The simple idea is that the first-order and second-order\nterms of the quadratic polynomials are determined in a two-step way. In the\nfirst step, the second-order terms are obtained from the reconstruction of a\nlinear polynomial of the first-order derivatives by only using the\ncell-averaged slopes, since the second-order derivatives are nothing but the\n\"derivatives of derivatives\". Subsequently, the first-order terms left can be\ndetermined by the linear reconstruction only using cell-averaged values. Thus,\nwe successfully split one quadratic least-square regression into several linear\nleast-square regressions, which are commonly used in a second-order finite\nvolume code. Since only a small matrix inversion is needed in a 3-D linear\nleast-square regression, the computational cost for the new reconstruction is\ndramatically reduced and the storage of the reconstruction-coefficient matrix\nis no longer necessary. The proposed new reconstruction technique can reduce\nthe overall computational cost by about 20 to 30 percent. The challenging\nlarge-scale unsteady numerical simulation is performed, which demonstrates that\nthe current improvement brings the CGKS to a new level for industrial\napplications.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}