{"id":"2408.13084","title":"Avatar Visual Similarity for Social HCI: Increasing Self-Awareness","authors":"Bernhard Hilpert, Claudio Alves da Silva, Leon Christidis, Chirag\n  Bhuvaneshwara, Patrick Gebhard, Fabrizio Nunnari and Dimitra Tsovaltzi","authorsParsed":[["Hilpert","Bernhard",""],["da Silva","Claudio Alves",""],["Christidis","Leon",""],["Bhuvaneshwara","Chirag",""],["Gebhard","Patrick",""],["Nunnari","Fabrizio",""],["Tsovaltzi","Dimitra",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 14:11:35 GMT"}],"updateDate":"2024-08-26","timestamp":1724422295000,"abstract":"  Self-awareness is a critical factor in social human-human interaction and,\nhence, in social HCI interaction. Increasing self-awareness through mirrors or\nvideo recordings is common in face-to-face trainings, since it influences\nantecedents of self-awareness like explicit identification and implicit\naffective identification (affinity). However, increasing self-awareness has\nbeen scarcely examined in virtual trainings with virtual avatars, which allow\nfor adjusting the similarity, e.g. to avoid negative effects of\nself-consciousness. Automatic visual similarity in avatars is an open issue\nrelated to high costs. It is important to understand which features need to be\nmanipulated and which degree of similarity is necessary for self-awareness to\nleverage the added value of using avatars for self-awareness. This article\nexamines the relationship between avatar visual similarity and increasing\nself-awareness in virtual training environments. We define visual similarity\nbased on perceptually important facial features for human-human identification\nand develop a theory-based methodology to systematically manipulate visual\nsimilarity of virtual avatars and support self-awareness. Three personalized\nversions of virtual avatars with varying degrees of visual similarity to\nparticipants were created (weak, medium and strong facial features\nmanipulation). In a within-subject study (N=33), we tested effects of degree of\nsimilarity on perceived similarity, explicit identification and implicit\naffective identification (affinity). Results show significant differences\nbetween the weak similarity manipulation, and both the strong manipulation and\nthe random avatar for all three antecedents of self-awareness. An increasing\ndegree of avatar visual similarity influences antecedents of self-awareness in\nvirtual environments.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}