{"id":"2408.02907","title":"Leveraging Inter-Chunk Interactions for Enhanced Retrieval in Large\n  Language Model-Based Question Answering","authors":"Tiezheng Guo, Chen Wang, Yanyi Liu, Jiawei Tang, Pan Li, Sai Xu,\n  Qingwen Yang, Xianlin Gao, Zhi Li, Yingyou Wen","authorsParsed":[["Guo","Tiezheng",""],["Wang","Chen",""],["Liu","Yanyi",""],["Tang","Jiawei",""],["Li","Pan",""],["Xu","Sai",""],["Yang","Qingwen",""],["Gao","Xianlin",""],["Li","Zhi",""],["Wen","Yingyou",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 02:39:55 GMT"}],"updateDate":"2024-08-07","timestamp":1722911995000,"abstract":"  Retrieving external knowledge and prompting large language models with\nrelevant information is an effective paradigm to enhance the performance of\nquestion-answering tasks. Previous research typically handles paragraphs from\nexternal documents in isolation, resulting in a lack of context and ambiguous\nreferences, particularly in multi-document and complex tasks. To overcome these\nchallenges, we propose a new retrieval framework IIER, that leverages\nInter-chunk Interactions to Enhance Retrieval. This framework captures the\ninternal connections between document chunks by considering three types of\ninteractions: structural, keyword, and semantic. We then construct a unified\nChunk-Interaction Graph to represent all external documents comprehensively.\nAdditionally, we design a graph-based evidence chain retriever that utilizes\nprevious paths and chunk interactions to guide the retrieval process. It\nidentifies multiple seed nodes based on the target question and iteratively\nsearches for relevant chunks to gather supporting evidence. This retrieval\nprocess refines the context and reasoning chain, aiding the large language\nmodel in reasoning and answer generation. Extensive experiments demonstrate\nthat IIER outperforms strong baselines across four datasets, highlighting its\neffectiveness in improving retrieval and reasoning capabilities.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}