{"id":"2408.17035","title":"Study And Implementation of Unitary Gates in Quantum Computation Using\n  Schrodinger Dynamics","authors":"Kumar Gautam","authorsParsed":[["Gautam","Kumar",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 06:08:35 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 05:54:06 GMT"}],"updateDate":"2024-09-04","timestamp":1724998115000,"abstract":"  This thesis explores the concept of realizing quantum gates using physical\nsystems like atoms and oscillators perturbed by electric and magnetic fields.\nThe basic idea is that if a time-independent Hamiltonian $H_0$ is perturbed by\na time-varying Hamiltonian of the form $f(t)V$, where $f(t)$ is a scalar\nfunction of time and $V$ is a Hermitian operator that does not commute with\n$H_0$, then a large class of unitary operators can be realized via the\nSchrodinger evolution corresponding to the time-varying Hamiltonian\n$H_0+f(t)V$. This is a consequence of the Baker-Campbell-Hausdorff formula in\nLie groups and Lie algebras. The thesis addresses two problems based on this\nidea: first, taking a Harmonic oscillator and perturbing it with a\ntime-independent anharmonic term, and then computing $U_g=e^{-\\iota T H_1}$.\nThen, perturbing the harmonic Hamiltonian with a linear time-dependent term,\nand calculating the unitary evolution corresponding to $H(t)$ at time $T$. This\ngate can be expressed as\n$U(T)=U(T,\\epsilon,f)=T\\{e^{-\\iota\\int_0^TH(t)dt}\\}$.The anharmonic gate $U_g$\nis replaced by a host of commonly used gates in quantum computation, such as\ncontrolled unitary gates and quantum Fourier transform gates. The control\nelectric field is selected appropriately. The thesis also addresses the\ncontrollability issue, determining under what conditions there exists a scalar\nreal valued function of time $f(t), 0\\leq t\\leq T$ such that if\n$|\\psi_\\iota\\rangle$ is any initial wave function and $|\\psi_f\\rangle$ is any\nfinal wave function, then $U(T,f)|\\psi_i\\rangle=|\\psi_f\\rangle$. A partial\nsolution was obtained by replacing the unitary evolution kernel by its Dyson\nseries truncated version. In all design procedures, the gates that appear are\ninfinite-dimensional, with an interaction between the atom and the\nelectromagnetic field modulated by a controllable function of time.\n","subjects":["Physics/Quantum Physics","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PgLAfXbU3W7t9rGPUKOuKZET3xbIBVPwYzY93E7iH2M","pdfSize":"682452"}
