{"id":"2408.02402","title":"Enhancing AI-based Generation of Software Exploits with Contextual\n  Information","authors":"Pietro Liguori, Cristina Improta, Roberto Natella, Bojan Cukic and\n  Domenico Cotroneo","authorsParsed":[["Liguori","Pietro",""],["Improta","Cristina",""],["Natella","Roberto",""],["Cukic","Bojan",""],["Cotroneo","Domenico",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 11:52:34 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 10:19:26 GMT"},{"version":"v3","created":"Fri, 6 Sep 2024 12:51:35 GMT"}],"updateDate":"2024-09-09","timestamp":1722858754000,"abstract":"  This practical experience report explores Neural Machine Translation (NMT)\nmodels' capability to generate offensive security code from natural language\n(NL) descriptions, highlighting the significance of contextual understanding\nand its impact on model performance. Our study employs a dataset comprising\nreal shellcodes to evaluate the models across various scenarios, including\nmissing information, necessary context, and unnecessary context. The\nexperiments are designed to assess the models' resilience against incomplete\ndescriptions, their proficiency in leveraging context for enhanced accuracy,\nand their ability to discern irrelevant information. The findings reveal that\nthe introduction of contextual data significantly improves performance.\nHowever, the benefits of additional context diminish beyond a certain point,\nindicating an optimal level of contextual information for model training.\nMoreover, the models demonstrate an ability to filter out unnecessary context,\nmaintaining high levels of accuracy in the generation of offensive security\ncode. This study paves the way for future research on optimizing context use in\nAI-driven code generation, particularly for applications requiring a high\ndegree of technical precision such as the generation of offensive code.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}