{"id":"2408.07035","title":"Impact of evanescent scattering modes and finite dispersion in\n  superconducting junctions","authors":"Daniel Kruti and Roman-Pascal Riwar","authorsParsed":[["Kruti","Daniel",""],["Riwar","Roman-Pascal",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 17:00:03 GMT"}],"updateDate":"2024-08-14","timestamp":1723568403000,"abstract":"  Superconducting junctions are essential building blocks for quantum hardware,\nand their fundamental behavior remains a highly active research field. The\nbehaviour of generic junctions is conveniently described by Beenakker's\ndeterminant formula, linking the subgap energy spectrum to the scattering\nmatrix characterizing the junction. In particular, the gap closing between\nbound and continuum states in short junctions follows from unitarity of the\nscattering matrix, and thus, from probability conservation. In this work, we\ncritically reassess two assumptions: that scattering in short junctions is\napproximately energy-independent and dominated by planar channels. We argue\nthat strongly energy-dependent scattering follows from finite dispersion of the\nconductor electrons even when they spend little time within the scattering\nregion, and show that evanescent modes play a central role when cross-channel\nscattering is important. By generalizing Beenakker's equation and performing a\nmapping to an effective Hamiltonian, we show that the gap closing is linked to\na chiral symmetry. While finite energy-dependence in the scattering breaks the\nchiral symmetry, we show two distinct mechanisms preserving the gap closing,\neach connected to new types of constraints on energy-dependent scattering\nmatrices beyond unitarity. If the dispersive mode is planar, the gap closing is\nstill preserved through a time-dependent probability conservation analysis of\nthe scattering process. If the dispersive channel is evanescent, we derive a\nconstraint which, notably, cannot follow from probability conservation. We thus\ndemonstrate that Andreev physics reveal a much wider variety of properties of\nnormal metal scattering than commonly expected. We expect that our findings\nwill have an impact on the dissipative behavior of driven junctions, and offer\na new perspective on fundamental properties of scattering matrices.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Other Condensed Matter","Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}