{"id":"2408.05992","title":"Transfer learning of state-based potential games for process\n  optimization in decentralized manufacturing systems","authors":"Steve Yuwono, Dorothea Schwung, Andreas Schwung","authorsParsed":[["Yuwono","Steve",""],["Schwung","Dorothea",""],["Schwung","Andreas",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 08:40:20 GMT"}],"updateDate":"2024-08-13","timestamp":1723452020000,"abstract":"  This paper presents a novel transfer learning approach in state-based\npotential games (TL-SbPGs) for enhancing distributed self-optimization in\nmanufacturing systems. The approach focuses on the practical relevant\nindustrial setting where sharing and transferring gained knowledge among\nsimilar-behaved players improves the self-learning mechanism in large-scale\nsystems. With TL-SbPGs, the gained knowledge can be reused by other players to\noptimize their policies, thereby improving the learning outcomes of the players\nand accelerating the learning process. To accomplish this goal, we develop\ntransfer learning concepts and similarity criteria for players, which offer two\ndistinct settings: (a) predefined similarities between players and (b)\ndynamically inferred similarities between players during training. We formally\nprove the applicability of the SbPG framework in transfer learning.\nAdditionally, we introduce an efficient method to determine the optimal timing\nand weighting of the transfer learning procedure during the training phase.\nThrough experiments on a laboratory-scale testbed, we demonstrate that TL-SbPGs\nsignificantly boost production efficiency while reducing power consumption of\nthe production schedules while also outperforming native SbPGs.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Science and Game Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"BQp9PIO7_cWUrpDTbhLlYCLKnWjV104ADArRipB3rMI","pdfSize":"11605966"}
