{"id":"2408.04122","title":"Overcoming Brittleness in Pareto-Optimal Learning-Augmented Algorithms","authors":"Spyros Angelopoulos, Christoph D\\\"urr, Alex Elenter and Yanni Lefki","authorsParsed":[["Angelopoulos","Spyros",""],["Dürr","Christoph",""],["Elenter","Alex",""],["Lefki","Yanni",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 23:15:21 GMT"}],"updateDate":"2024-08-09","timestamp":1723072521000,"abstract":"  The study of online algorithms with machine-learned predictions has gained\nconsiderable prominence in recent years. One of the common objectives in the\ndesign and analysis of such algorithms is to attain (Pareto) optimal tradeoffs\nbetween the consistency of the algorithm, i.e., its performance assuming\nperfect predictions, and its robustness, i.e., the performance of the algorithm\nunder adversarial predictions. In this work, we demonstrate that this\noptimization criterion can be extremely brittle, in that the performance of\nPareto-optimal algorithms may degrade dramatically even in the presence of\nimperceptive prediction error. To remedy this drawback, we propose a new\nframework in which the smoothness in the performance of the algorithm is\nenforced by means of a user-specified profile. This allows us to regulate the\nperformance of the algorithm as a function of the prediction error, while\nsimultaneously maintaining the analytical notion of consistency/robustness\ntradeoffs, adapted to the profile setting. We apply this new approach to a\nwell-studied online problem, namely the one-way trading problem. For this\nproblem, we further address another limitation of the state-of-the-art\nPareto-optimal algorithms, namely the fact that they are tailored to\nworst-case, and extremely pessimistic inputs. We propose a new Pareto-optimal\nalgorithm that leverages any deviation from the worst-case input to its\nbenefit, and introduce a new metric that allows us to compare any two\nPareto-optimal algorithms via a dominance relation.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Data Structures and Algorithms"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"8YoG-lteKwQR5yGLkg_l3lRZ1sRqd_Yhp9qxQbsTaTM","pdfSize":"580259"}
