{"id":"2408.05276","title":"postmerger: A flexible mapping of ringdown amplitudes for non-precessing\n  binary black holes","authors":"Costantino Pacilio, Swetha Bhagwat, Francesco Nobili, Davide Gerosa","authorsParsed":[["Pacilio","Costantino",""],["Bhagwat","Swetha",""],["Nobili","Francesco",""],["Gerosa","Davide",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 18:00:08 GMT"}],"updateDate":"2024-08-13","timestamp":1723226408000,"abstract":"  The remnant black hole from a binary coalescence emits ringdown gravitational\nwaves characterized by quasi-normal modes, which depend solely on the remnant's\nmass and spin. In contrast, the ringdown amplitudes and phases are determined\nby the properties of the merging progenitors. Accurately modeling these\namplitudes and phases reduces systematic biases in parameter estimation and\nenables the development and performance of rigorous tests of general\nrelativity. We present a state-of-the-art, data-driven surrogate model for\nringdown amplitudes and phases, leveraging Gaussian Process Regression trained\nagainst SXS numerical-relativity simulations. Focusing on non-precessing,\nquasi-circular binary black holes, our model offers the most comprehensive fit\nthat includes 16 emission modes, incorporating overtones and quadratic\ncontributions. Our surrogate model achieves reconstruction errors that are\napproximately two orders of magnitude smaller than the typical measurement\nerrors of current gravitational-wave interferometers. An additional benefit of\nour approach is its flexibility, which allows for future extensions to include\nfeatures such as eccentricity and precession, broadening the scope of its\napplicability to more generic astrophysical scenarios. Finally, we are\nreleasing our model in a ready-to-use package called postmerger.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}