{"id":"2408.00893","title":"Unveiling the bi-stable character of stealthy hydrogen-air flames","authors":"Ruben Palomeque-Santiago, Alba Dominguez-Gonzalez, Daniel\n  Martinez-Ruiz, Mariano Rubio-Rubio Eduardo Fernandez-Tarrazo, and Mario\n  Sanchez-Sanz","authorsParsed":[["Palomeque-Santiago","Ruben",""],["Dominguez-Gonzalez","Alba",""],["Martinez-Ruiz","Daniel",""],["Fernandez-Tarrazo","Mariano Rubio-Rubio Eduardo",""],["Sanchez-Sanz","Mario",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 20:16:27 GMT"}],"updateDate":"2024-08-05","timestamp":1722543387000,"abstract":"  Ultra-lean hydrogen-air flames propagating in narrow gaps, under the\ninfluence of cold walls and high preferential diffusion, can form two distinct\nisolated structures. They exhibit either circular or double-cell shapes and\npropagate at different speeds, with the latter roughly doubling in size and\ntraveling speed to the former. Hydrogen mass diffusivity, convective effects\nand conductive heat losses are the physical mechanisms that explain the\nalterations in morphology and propagation speed. In previous experiments, Veiga\net al. Phys. Rev. Lett. 124, 174501 (2020) found these clearly distinguished\nflame structures for different combinations of equivalence ratio, channel gap\nand the effect of gravity on the dynamics of upwards and downwards propagating\nflames in a vertical chamber. Present observations in horizontal channels show\nthe simultaneous appearance of these two stable structures, which arise under\nidentical experimental conditions and conform the first evidence that\nmultiplicity of stable solutions coexists in real devices. To explain the\nobservations, we performed numerical simulations using the simplified model,\nwhich show that symmetry-breaking details during the ignition transient explain\nthe concurrent emergence of the two stable configurations. This discovery urges\nthe need to implement additional engineering tools to account for the\npossibility of formation and propagation of isolated flame kernels at different\nspeeds in hydrogen-fueled systems.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"lrnw5LM5k1uLknNI9RbRhp_uRC2q4mZQs-Slauw4f7M","pdfSize":"16272263"}
