{"id":"2408.05712","title":"DeepAir: A Multi-Agent Deep Reinforcement Learning Based Scheme for an\n  Unknown User Location Problem","authors":"Baris Yamansavascilar, Atay Ozgovde, and Cem Ersoy","authorsParsed":[["Yamansavascilar","Baris",""],["Ozgovde","Atay",""],["Ersoy","Cem",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 07:28:35 GMT"}],"updateDate":"2024-08-13","timestamp":1723361315000,"abstract":"  The deployment of unmanned aerial vehicles (UAVs) in many different settings\nhas provided various solutions and strategies for networking paradigms.\nTherefore, it reduces the complexity of the developments for the existing\nproblems, which otherwise require more sophisticated approaches. One of those\nexisting problems is the unknown user locations in an infrastructure-less\nenvironment in which users cannot connect to any communication device or\ncomputation-providing server, which is essential to task offloading in order to\nachieve the required quality of service (QoS). Therefore, in this study, we\ninvestigate this problem thoroughly and propose a novel deep reinforcement\nlearning (DRL) based scheme, DeepAir. DeepAir considers all of the necessary\nsteps including sensing, localization, resource allocation, and multi-access\nedge computing (MEC) to achieve QoS requirements for the offloaded tasks\nwithout violating the maximum tolerable delay. To this end, we use two types of\nUAVs including detector UAVs, and serving UAVs. We utilize detector UAVs as DRL\nagents which ensure sensing, localization, and resource allocation. On the\nother hand, we utilize serving UAVs to provide MEC features. Our experiments\nshow that DeepAir provides a high task success rate by deploying fewer detector\nUAVs in the environment, which includes different numbers of users and user\nattraction points, compared to benchmark methods.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}