{"id":"2408.16650","title":"Towards Efficient Modelling of String Dynamics: A Comparison of State\n  Space and Koopman based Deep Learning Methods","authors":"Rodrigo Diaz, Carlos De La Vega Martin, Mark Sandler","authorsParsed":[["Diaz","Rodrigo",""],["Martin","Carlos De La Vega",""],["Sandler","Mark",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 15:55:27 GMT"}],"updateDate":"2024-08-30","timestamp":1724946927000,"abstract":"  This paper presents an examination of State Space Models (SSM) and\nKoopman-based deep learning methods for modelling the dynamics of both linear\nand non-linear stiff strings. Through experiments with datasets generated under\ndifferent initial conditions and sample rates, we assess the capacity of these\nmodels to accurately model the complex behaviours observed in string dynamics.\nOur findings indicate that our proposed Koopman-based model performs as well as\nor better than other existing approaches in non-linear cases for long-sequence\nmodelling.\n  We inform the design of these architectures with the structure of the\nproblems at hand. Although challenges remain in extending model predictions\nbeyond the training horizon (i.e., extrapolation), the focus of our\ninvestigation lies in the models' ability to generalise across different\ninitial conditions within the training time interval. This research contributes\ninsights into the physical modelling of dynamical systems (in particular those\naddressing musical acoustics) by offering a comparative overview of these and\nprevious methods and introducing innovative strategies for model improvement.\nOur results highlight the efficacy of these models in simulating non-linear\ndynamics and emphasise their wide-ranging applicability in accurately modelling\ndynamical systems over extended sequences.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Audio and Speech Processing","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}