{"id":"2408.13391","title":"Generating Analytic Specifications for Data Visualization from Natural\n  Language Queries using Large Language Models","authors":"Subham Sah, Rishab Mitra, Arpit Narechania, Alex Endert, John Stasko,\n  Wenwen Dou","authorsParsed":[["Sah","Subham",""],["Mitra","Rishab",""],["Narechania","Arpit",""],["Endert","Alex",""],["Stasko","John",""],["Dou","Wenwen",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 22:06:54 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 02:55:28 GMT"}],"updateDate":"2024-08-28","timestamp":1724450814000,"abstract":"  Recently, large language models (LLMs) have shown great promise in\ntranslating natural language (NL) queries into visualizations, but their\n\"black-box\" nature often limits explainability and debuggability. In response,\nwe present a comprehensive text prompt that, given a tabular dataset and an NL\nquery about the dataset, generates an analytic specification including\n(detected) data attributes, (inferred) analytic tasks, and (recommended)\nvisualizations. This specification captures key aspects of the query\ntranslation process, affording both explainability and debuggability. For\ninstance, it provides mappings from the detected entities to the corresponding\nphrases in the input query, as well as the specific visual design principles\nthat determined the visualization recommendations. Moreover, unlike prior\nLLM-based approaches, our prompt supports conversational interaction and\nambiguity detection capabilities. In this paper, we detail the iterative\nprocess of curating our prompt, present a preliminary performance evaluation\nusing GPT-4, and discuss the strengths and limitations of LLMs at various\nstages of query translation. The prompt is open-source and integrated into\nNL4DV, a popular Python-based natural language toolkit for visualization, which\ncan be accessed at https://nl4dv.github.io.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}