{"id":"2408.08602","title":"Discrete-time SIS Social Contagion Processes on Hypergraphs","authors":"Lidan Liang, Shaoxuan Cui, and Fangzhou Liu","authorsParsed":[["Liang","Lidan",""],["Cui","Shaoxuan",""],["Liu","Fangzhou",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 08:39:13 GMT"}],"updateDate":"2024-08-19","timestamp":1723797553000,"abstract":"  Recent research on social contagion processes has revealed the limitations of\ntraditional networks, which capture only pairwise relationships, to\ncharacterize complex multiparty relationships and group influences properly.\nSocial contagion processes on higher-order networks (simplicial complexes and\ngeneral hypergraphs) have therefore emerged as a novel frontier. In this work,\nwe investigate discrete-time Susceptible-Infected-Susceptible (SIS) social\ncontagion processes occurring on weighted and directed hypergraphs and their\nextensions to bivirus cases and general higher-order SIS processes with the aid\nof tensor algebra. Our focus lies in comprehensively characterizing the healthy\nstate and endemic equilibria within this framework. The emergence of\nbistability or multistability behavior phenomena, where multiple equilibria\ncoexist and are simultaneously locally asymptotically stable, is demonstrated\nin view of the presence of the higher-order interaction. The novel sufficient\nconditions of the appearance for system behaviors, which are determined by both\n(higher-order) network topology and transition rates, are provided to assess\nthe likelihood of the SIS social contagion processes causing an outbreak. More\nimportantly, given the equilibrium is locally stable, an explicit domain of\nattraction associated with the system parameters is constructed. Moreover, a\nlearning method to estimate the transition rates is presented. In the end, the\nattained theoretical results are supplemented via numerical examples.\nSpecifically, we evaluate the effectiveness of the networked SIS social\ncontagion process by comparing it with the $2^n$-state Markov chain model.\nThese numerical examples are given to highlight the performance of parameter\nlearning algorithms and the system behaviors of the discrete-time SIS social\ncontagion process.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}