{"id":"2408.16237","title":"MQRLD: A Multimodal Data Retrieval Platform with Query-aware Feature\n  Representation and Learned Index Based on Data Lake","authors":"Ming Sheng, Shuliang Wang, Yong Zhang, Kaige Wang, Jingyi Wang, Yi Luo\n  and Rui Hao","authorsParsed":[["Sheng","Ming",""],["Wang","Shuliang",""],["Zhang","Yong",""],["Wang","Kaige",""],["Wang","Jingyi",""],["Luo","Yi",""],["Hao","Rui",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 03:28:13 GMT"}],"updateDate":"2024-08-30","timestamp":1724902093000,"abstract":"  Multimodal data has become a crucial element in the realm of big data\nanalytics, driving advancements in data exploration, data mining, and\nempowering artificial intelligence applications. To support high-quality\nretrieval for these cutting-edge applications, a robust data retrieval platform\nshould meet the requirements for transparent data storage, rich hybrid queries,\neffective feature representation, and high query efficiency. However, among the\nexisting platforms, traditional schema-on-write systems, multi-model databases,\nvector databases, and data lakes, which are the primary options for multimodal\ndata retrieval, are difficult to fulfill these requirements simultaneously.\nTherefore, there is an urgent need to develop a more versatile multimodal data\nretrieval platform to address these issues.\n  In this paper, we introduce a Multimodal Data Retrieval Platform with\nQuery-aware Feature Representation and Learned Index based on Data Lake\n(MQRLD). It leverages the transparent storage capabilities of data lakes,\nintegrates the multimodal open API to provide a unified interface that supports\nrich hybrid queries, introduces a query-aware multimodal data feature\nrepresentation strategy to obtain effective features, and offers\nhigh-dimensional learned indexes to optimize data query. We conduct a\ncomparative analysis of the query performance of MQRLD against other methods\nfor rich hybrid queries. Our results underscore the superior efficiency of\nMQRLD in handling multimodal data retrieval tasks, demonstrating its potential\nto significantly improve retrieval performance in complex environments. We also\nclarify some potential concerns in the discussion.\n","subjects":["Computing Research Repository/Databases"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}