{"id":"2408.12373","title":"Cell-ontology guided transcriptome foundation model","authors":"Xinyu Yuan, Zhihao Zhan, Zuobai Zhang, Manqi Zhou, Jianan Zhao, Boyu\n  Han, Yue Li, Jian Tang","authorsParsed":[["Yuan","Xinyu",""],["Zhan","Zhihao",""],["Zhang","Zuobai",""],["Zhou","Manqi",""],["Zhao","Jianan",""],["Han","Boyu",""],["Li","Yue",""],["Tang","Jian",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 13:15:49 GMT"}],"updateDate":"2024-08-23","timestamp":1724332549000,"abstract":"  Transcriptome foundation models TFMs hold great promises of deciphering the\ntranscriptomic language that dictate diverse cell functions by self-supervised\nlearning on large-scale single-cell gene expression data, and ultimately\nunraveling the complex mechanisms of human diseases. However, current TFMs\ntreat cells as independent samples and ignore the taxonomic relationships\nbetween cell types, which are available in cell ontology graphs. We argue that\neffectively leveraging this ontology information during the TFM pre-training\ncan improve learning biologically meaningful gene co-expression patterns while\npreserving TFM as a general purpose foundation model for downstream zero-shot\nand fine-tuning tasks. To this end, we present \\textbf{s}ingle \\textbf{c}ell,\n\\textbf{Cell}-\\textbf{o}ntology guided TFM scCello. We introduce cell-type\ncoherence loss and ontology alignment loss, which are minimized along with the\nmasked gene expression prediction loss during the pre-training. The novel loss\ncomponent guide scCello to learn the cell-type-specific representation and the\nstructural relation between cell types from the cell ontology graph,\nrespectively. We pre-trained scCello on 22 million cells from CellxGene\ndatabase leveraging their cell-type labels mapped to the cell ontology graph\nfrom Open Biological and Biomedical Ontology Foundry. Our TFM demonstrates\ncompetitive generalization and transferability performance over the existing\nTFMs on biologically important tasks including identifying novel cell types of\nunseen cells, prediction of cell-type-specific marker genes, and cancer drug\nresponses.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}