{"id":"2408.10086","title":"ARMADA: Attribute-Based Multimodal Data Augmentation","authors":"Xiaomeng Jin, Jeonghwan Kim, Yu Zhou, Kuan-Hao Huang, Te-Lin Wu,\n  Nanyun Peng, Heng Ji","authorsParsed":[["Jin","Xiaomeng",""],["Kim","Jeonghwan",""],["Zhou","Yu",""],["Huang","Kuan-Hao",""],["Wu","Te-Lin",""],["Peng","Nanyun",""],["Ji","Heng",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 15:27:25 GMT"}],"updateDate":"2024-08-20","timestamp":1724081245000,"abstract":"  In Multimodal Language Models (MLMs), the cost of manually annotating\nhigh-quality image-text pair data for fine-tuning and alignment is extremely\nhigh. While existing multimodal data augmentation frameworks propose ways to\naugment image-text pairs, they either suffer from semantic inconsistency\nbetween texts and images, or generate unrealistic images, causing knowledge gap\nwith real world examples. To address these issues, we propose Attribute-based\nMultimodal Data Augmentation (ARMADA), a novel multimodal data augmentation\nmethod via knowledge-guided manipulation of visual attributes of the mentioned\nentities. Specifically, we extract entities and their visual attributes from\nthe original text data, then search for alternative values for the visual\nattributes under the guidance of knowledge bases (KBs) and large language\nmodels (LLMs). We then utilize an image-editing model to edit the images with\nthe extracted attributes. ARMADA is a novel multimodal data generation\nframework that: (i) extracts knowledge-grounded attributes from symbolic KBs\nfor semantically consistent yet distinctive image-text pair generation, (ii)\ngenerates visually similar images of disparate categories using neighboring\nentities in the KB hierarchy, and (iii) uses the commonsense knowledge of LLMs\nto modulate auxiliary visual attributes such as backgrounds for more robust\nrepresentation of original entities. Our empirical results over four downstream\ntasks demonstrate the efficacy of our framework to produce high-quality data\nand enhance the model performance. This also highlights the need to leverage\nexternal knowledge proxies for enhanced interpretability and real-world\ngrounding.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}