{"id":"2408.03678","title":"Revisiting multiple trapping and release electronic transport in\n  amorphous semiconductors exemplified by a-Si:H","authors":"Yuezhou Luo and Andrew John Flewitt","authorsParsed":[["Luo","Yuezhou",""],["Flewitt","Andrew John",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 10:37:15 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 10:52:36 GMT"}],"updateDate":"2024-09-13","timestamp":1723027035000,"abstract":"  Multiple trapping and release (MTR) is a typical transport mechanism of\nelectron carriers in amorphous and other disordered semiconductors where\nlocalized states are significant. Quantitative description of MTR, however, has\nbeen based on an \"abrupt\" mobility edge model, which relies on two underpinning\nsimplifications: (i) states above the conduction band mobility edge are\nextended and any of them is omnipresent in space, whereas states below the\nmobility edge are localized and they exist in space as pointlike sites; (ii)\nall states are evenly distributed in space, and the local density of states\n(DOS) distribution is spatially invariant. The prequel to this paper [Y. Luo\nand A. J. Flewitt, Phys. Rev. B 109, 104203 (2024)] demonstrates that neither\nof these simplifications is valid. Hence, this paper reinvestigates MTR\ntransport. Through a probabilistic analysis of the microscopic charge transport\ndetails, this paper rigorously demonstrates that, first, the experimentally\nmeasured mobility edge is an effective quantity which is different from the\nactual critical energy that demarcates extended states and localized states of\nan amorphous semiconductor. Second, the experimentally derived extended-state\nmobility is also an effective quantity which turns out to be higher than the\nactual mobility of free electrons in the material. The hydrogenated amorphous\nsilicon (a-Si:H) discussed in the prequel, being an intensively studied sample\nin the past, is used as an example to concretize the analysis.\n","subjects":["Condensed Matter/Disordered Systems and Neural Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EQFcVDxVzhgJUmk_uLiusF1mlQ1pi5b4FoKfz-O9g3Y","pdfSize":"1039217"}
