{"id":"2408.00651","title":"A Dirichlet stochastic block model for composition-weighted networks","authors":"Iuliia Promskaia, Adrian O'Hagan, Michael Fop","authorsParsed":[["Promskaia","Iuliia",""],["O'Hagan","Adrian",""],["Fop","Michael",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 15:41:07 GMT"}],"updateDate":"2024-08-02","timestamp":1722526867000,"abstract":"  Network data are observed in various applications where the individual\nentities of the system interact with or are connected to each other, and often\nthese interactions are defined by their associated strength or importance.\nClustering is a common task in network analysis that involves finding groups of\nnodes displaying similarities in the way they interact with the rest of the\nnetwork. However, most clustering methods use the strengths of connections\nbetween entities in their original form, ignoring the possible differences in\nthe capacities of individual nodes to send or receive edges. This often leads\nto clustering solutions that are heavily influenced by the nodes' capacities.\nOne way to overcome this is to analyse the strengths of connections in relative\nrather than absolute terms, expressing each edge weight as a proportion of the\nsending (or receiving) capacity of the respective node. This, however, induces\nadditional modelling constraints that most existing clustering methods are not\ndesigned to handle. In this work we propose a stochastic block model for\ncomposition-weighted networks based on direct modelling of compositional weight\nvectors using a Dirichlet mixture, with the parameters determined by the\ncluster labels of the sender and the receiver nodes. Inference is implemented\nvia an extension of the classification expectation-maximisation algorithm that\nuses a working independence assumption, expressing the complete data likelihood\nof each node of the network as a function of fixed cluster labels of the\nremaining nodes. A model selection criterion is derived to aid the choice of\nthe number of clusters. The model is validated using simulation studies, and\nshowcased on network data from the Erasmus exchange program and a bike sharing\nnetwork for the city of London.\n","subjects":["Statistics/Methodology","Statistics/Computation","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WpF8SH-TV7_rZZ41cPwTSgb_EJYdOZaxuPDoIdOJMHw","pdfSize":"3175776","txDigest":"7cG4RaP6SbFUG75bLRsDrgLZqFdUC3dXrYrSx1CDQ9zD","endEpoch":"1","status":"CERTIFIED"}
