{"id":"2408.02100","title":"View-consistent Object Removal in Radiance Fields","authors":"Yiren Lu, Jing Ma and Yu Yin","authorsParsed":[["Lu","Yiren",""],["Ma","Jing",""],["Yin","Yu",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 17:57:23 GMT"}],"updateDate":"2024-08-06","timestamp":1722794243000,"abstract":"  Radiance Fields (RFs) have emerged as a crucial technology for 3D scene\nrepresentation, enabling the synthesis of novel views with remarkable realism.\nHowever, as RFs become more widely used, the need for effective editing\ntechniques that maintain coherence across different perspectives becomes\nevident. Current methods primarily depend on per-frame 2D image inpainting,\nwhich often fails to maintain consistency across views, thus compromising the\nrealism of edited RF scenes. In this work, we introduce a novel RF editing\npipeline that significantly enhances consistency by requiring the inpainting of\nonly a single reference image. This image is then projected across multiple\nviews using a depth-based approach, effectively reducing the inconsistencies\nobserved with per-frame inpainting. However, projections typically assume\nphotometric consistency across views, which is often impractical in real-world\nsettings. To accommodate realistic variations in lighting and viewpoint, our\npipeline adjusts the appearance of the projected views by generating multiple\ndirectional variants of the inpainted image, thereby adapting to different\nphotometric conditions. Additionally, we present an effective and robust\nmulti-view object segmentation approach as a valuable byproduct of our\npipeline. Extensive experiments demonstrate that our method significantly\nsurpasses existing frameworks in maintaining content consistency across views\nand enhancing visual quality. More results are available at\nhttps://vulab-ai.github.io/View-consistent_Object_Removal_in_Radiance_Fields.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}