{"id":"2408.05459","title":"A Versatile Framework for Attributed Network Clustering via K-Nearest\n  Neighbor Augmentation","authors":"Yiran Li, Gongyao Guo, Jieming Shi, Renchi Yang, Shiqi Shen, Qing Li,\n  Jun Luo","authorsParsed":[["Li","Yiran",""],["Guo","Gongyao",""],["Shi","Jieming",""],["Yang","Renchi",""],["Shen","Shiqi",""],["Li","Qing",""],["Luo","Jun",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 06:59:51 GMT"}],"updateDate":"2024-08-13","timestamp":1723273191000,"abstract":"  Attributed networks containing entity-specific information in node attributes\nare ubiquitous in modeling social networks, e-commerce, bioinformatics, etc.\nTheir inherent network topology ranges from simple graphs to hypergraphs with\nhigh-order interactions and multiplex graphs with separate layers. An important\ngraph mining task is node clustering, aiming to partition the nodes of an\nattributed network into k disjoint clusters such that intra-cluster nodes are\nclosely connected and share similar attributes, while inter-cluster nodes are\nfar apart and dissimilar. It is highly challenging to capture multi-hop\nconnections via nodes or attributes for effective clustering on multiple types\nof attributed networks. In this paper, we first present AHCKA as an efficient\napproach to attributed hypergraph clustering (AHC). AHCKA includes a\ncarefully-crafted K-nearest neighbor augmentation strategy for the optimized\nexploitation of attribute information on hypergraphs, a joint hypergraph random\nwalk model to devise an effective AHC objective, and an efficient solver with\nspeedup techniques for the objective optimization. The proposed techniques are\nextensible to various types of attributed networks, and thus, we develop ANCKA\nas a versatile attributed network clustering framework, capable of attributed\ngraph clustering (AGC), attributed multiplex graph clustering (AMGC), and AHC.\nMoreover, we devise ANCKA with algorithmic designs tailored for GPU\nacceleration to boost efficiency. We have conducted extensive experiments to\ncompare our methods with 19 competitors on 8 attributed hypergraphs, 16\ncompetitors on 6 attributed graphs, and 16 competitors on 3 attributed\nmultiplex graphs, all demonstrating the superb clustering quality and\nefficiency of our methods.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}