{"id":"2408.02852","title":"Usability of back support, shoulder support and sit-stand passive\n  occupational exoskeletons: A heuristic evaluation of the designs","authors":"Alejandra Martinez, Laura Tovar, Carla Irigoyen Amparan, Karen\n  Gonzalez, Prajina Edayath, Priyadarshini Pennathur, and Arunkumar Pennathur","authorsParsed":[["Martinez","Alejandra",""],["Tovar","Laura",""],["Amparan","Carla Irigoyen",""],["Gonzalez","Karen",""],["Edayath","Prajina",""],["Pennathur","Priyadarshini",""],["Pennathur","Arunkumar",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 22:27:00 GMT"}],"updateDate":"2024-08-07","timestamp":1722896820000,"abstract":"  Occupational exoskeletons promise to alleviate musculoskeletal injuries among\nindustrial workers. Knowledge of the usability of the exoskeleton designs with\nrespect to the user device interaction points, and the problems in design\nfeatures, functions and parts, evaluated and rated using design principles is\nstill limited. Further, the usability of exoskeletons when assembling, donning,\ndoffing and disassembling them, tasks that can be considered pre and post use\ntasks are also critical to evaluate, especially from a device design\nstandpoint. We conducted a heuristic evaluation of the usability of three\npopular exoskeletons, a back support device, a shoulder support device, and a\nsit stand exoskeleton when assembling, donning, doffing and disassembling them.\nSeven evaluators used Nielsen and Shneiderman usability heuristics to evaluate\nthe devices. Results indicate that none of the three exoskeletons had any\ncatastrophic usability problems, but all three had major usability problems\nincluding accommodating diverse users, the assembly, donning and doffing being\na two person operation, poor documentation, a lack of sequence indicators\nduring assembly of the devices, presence of safety hazards while donning and\ndoffing the devices, and manual strength requirements. Further, the assembly\ntask is the most difficult task resulting in the most violations of usability\nheuristics. The exoskeleton human factors research community should include\ndiverse users in their evaluations and conduct usability, accessibility, and\nsafety evaluations of these devices to provide design feedback to device\ndesigners.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}