{"id":"2408.10222","title":"Near-Orthogonal Overlay Communications in LoS Channel Enabled by Novel\n  OAM Beams without Central Energy Voids: An Experimental Study","authors":"Yufei Zhao, Xiaoyan Ma, Yong Liang Guan, Yile Liu, Afkar Mohamed\n  Ismail, Xiaobei Liu, Siew Yam Yeo, and Chau Yuen","authorsParsed":[["Zhao","Yufei",""],["Ma","Xiaoyan",""],["Guan","Yong Liang",""],["Liu","Yile",""],["Ismail","Afkar Mohamed",""],["Liu","Xiaobei",""],["Yeo","Siew Yam",""],["Yuen","Chau",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 08:00:13 GMT"}],"updateDate":"2024-08-21","timestamp":1722067213000,"abstract":"  This paper introduces a groundbreaking Line-of-Sight (LoS) Multiple-Input\nMultiple-Output (MIMO) communication architecture leveraging non-traditional\nOrbital Angular Momentum (OAM) beams. Challenging the conventional paradigm of\nhollow-emitting OAM beams, this study presents an innovative OAM transmitter\ndesign that produces directional OAM beams without central energy voids,\naligning their radiation patterns with those of conventional planar wave horn\nantennas. Within the main lobe of these antennas, the phase variation\ncharacteristics inherent to OAM beams are ingeniously maintained, linking\ndifferent OAM modes to the linear wavefront variation gradients, thereby\nreducing channel correlation in LoS scenarios and significantly augmenting the\nchannel capacity of LoS-MIMO frameworks. Empirical validations conducted\nthrough a meticulously designed LoS-MIMO experimental platform reveal\nsignificant improvements in channel correlation coefficients, communication\nstability, and Bit Error Rate (BER) compared to systems utilizing traditional\nplanar wave antennas. The experiment results underscore the potential of the\nnovel OAM-based system to improve current LoS-MIMO communication protocols, and\noffer both academic and engineering guidance for the construction of practical\ncommunication infrastructures. Beyond its immediate contributions, this paper\nunderscores a pivotal shift in the field of communications, pointing out that\ntraditional communication algorithms have primarily focused on baseband signal\nprocessing while often overlooking the electromagnetic characteristics of the\nphysical world.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}