{"id":"2408.05837","title":"Enhancing Eye-Tracking Performance through Multi-Task Learning\n  Transformer","authors":"Weigeng Li, Neng Zhou, Xiaodong Qu","authorsParsed":[["Li","Weigeng",""],["Zhou","Neng",""],["Qu","Xiaodong",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 17:53:05 GMT"}],"updateDate":"2024-08-13","timestamp":1723398785000,"abstract":"  In this study, we introduce an innovative EEG signal reconstruction\nsub-module designed to enhance the performance of deep learning models on EEG\neye-tracking tasks. This sub-module can integrate with all\nEncoder-Classifier-based deep learning models and achieve end-to-end training\nwithin a multi-task learning framework. Additionally, as the module operates\nunder unsupervised learning, it is versatile and applicable to various tasks.\nWe demonstrate its effectiveness by incorporating it into advanced\ndeep-learning models, including Transformers and pre-trained Transformers. Our\nresults indicate a significant enhancement in feature representation\ncapabilities, evidenced by a Root Mean Squared Error (RMSE) of 54.1mm. This\nrepresents a notable improvement over existing methods, showcasing the\nsub-module's potential in refining EEG-based model performance.\n  The success of this approach suggests that this reconstruction sub-module is\ncapable of enhancing the feature extraction ability of the encoder. Due to the\nsub-module being mounted as a sub-task under the main task and maintained\nthrough a multi-task learning framework, our model preserves the end-to-end\ntraining process of the original model. In contrast to pre-training methods\nlike autoencoder, our model saves computational costs associated with\npre-training and exhibits greater flexibility in adapting to various model\nstructures. Benefiting from the unsupervised nature of the sub-module, it can\nbe applied across diverse tasks. We believe it represents a novel paradigm for\nimproving the performance of deep learning models in EEG-related challenges.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jn39EQIr9CtZTqXXdq4ubswCcC9WBg6xPLu6mY9fY_A","pdfSize":"1098967"}
