{"id":"2408.03460","title":"Real time parameter estimation for adaptive OFDM/OTFS selection","authors":"Amina Darghouthi, Abdelhakim Khlifi, Belgacem Chibani","authorsParsed":[["Darghouthi","Amina",""],["Khlifi","Abdelhakim",""],["Chibani","Belgacem",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 12:23:07 GMT"}],"updateDate":"2024-08-09","timestamp":1722082987000,"abstract":"  Future wireless communication systems must simultaneously address multiple\nchallenges to ensure accurate data detection, deliver high Quality of Service\n(QoS), adding enable a high data transmission with low system design.\nAdditionally, they need to reduce energy consumption and latency without\nincreasing system complexity. Orthogonal Frequency Division Multiplexing (OFDM)\nis a commonly used waveform in 4G and 5G systems, it has limitations in\nhandling significant delay and Doppler spread in high mobility scenarios. To\novercome these weaknesses, a novel waveform named Orthogonal Time Frequency\nSpace (OTFS) has been proposed, which aims to improve upon OFDM by closely\nmatching signals to channel behavior. In this study, we propose a novel\nstrategy that enables operators to dynamically select the best waveform based\non estimated mobile user parameters. We use an Integrated Radar Sensing and\nCommunication System (ISAC) to estimate delay and Doppler, as well as speed and\nrange. This approach allows the base station to adapt to the mobile target,\nthereby enhancing the performance of wireless communication systems in high\nmobility and low complexity scenarios. Simulation results demonstrate the\neffectiveness of our proposed approach and show that it outperforms existing\nmethods.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"MzRPyOOhLFmqNoYBTTwJZxS-1PLHw5TanHiwxvNjhyQ","pdfSize":"2038003"}
