{"id":"2408.11398","title":"Generative AI based Secure Wireless Sensing for ISAC Networks","authors":"Jiacheng Wang, Hongyang Du, Yinqiu Liu, Geng Sun, Dusit Niyato, Shiwen\n  Mao, Dong In Kim, and Xuemin Shen","authorsParsed":[["Wang","Jiacheng",""],["Du","Hongyang",""],["Liu","Yinqiu",""],["Sun","Geng",""],["Niyato","Dusit",""],["Mao","Shiwen",""],["Kim","Dong In",""],["Shen","Xuemin",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 07:45:43 GMT"}],"updateDate":"2024-08-22","timestamp":1724226343000,"abstract":"  Integrated sensing and communications (ISAC) is expected to be a key\ntechnology for 6G, and channel state information (CSI) based sensing is a key\ncomponent of ISAC. However, current research on ISAC focuses mainly on\nimproving sensing performance, overlooking security issues, particularly the\nunauthorized sensing of users. In this paper, we propose a secure sensing\nsystem (DFSS) based on two distinct diffusion models. Specifically, we first\npropose a discrete conditional diffusion model to generate graphs with nodes\nand edges, guiding the ISAC system to appropriately activate wireless links and\nnodes, which ensures the sensing performance while minimizing the operation\ncost. Using the activated links and nodes, DFSS then employs the continuous\nconditional diffusion model to generate safeguarding signals, which are next\nmodulated onto the pilot at the transmitter to mask fluctuations caused by user\nactivities. As such, only ISAC devices authorized with the safeguarding signals\ncan extract the true CSI for sensing, while unauthorized devices are unable to\nachieve the same sensing. Experiment results demonstrate that DFSS can reduce\nthe activity recognition accuracy of the unauthorized devices by approximately\n70%, effectively shield the user from the unauthorized surveillance.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2BJ1_APJD0-hUUJUWD2PUx-hwQqrCAX5XgEv2faIHlk","pdfSize":"6086255"}
