{"id":"2408.03100","title":"Huge Ensembles Part I: Design of Ensemble Weather Forecasts using\n  Spherical Fourier Neural Operators","authors":"Ankur Mahesh, William Collins, Boris Bonev, Noah Brenowitz, Yair\n  Cohen, Joshua Elms, Peter Harrington, Karthik Kashinath, Thorsten Kurth,\n  Joshua North, Travis OBrien, Michael Pritchard, David Pruitt, Mark Risser,\n  Shashank Subramanian, Jared Willard","authorsParsed":[["Mahesh","Ankur",""],["Collins","William",""],["Bonev","Boris",""],["Brenowitz","Noah",""],["Cohen","Yair",""],["Elms","Joshua",""],["Harrington","Peter",""],["Kashinath","Karthik",""],["Kurth","Thorsten",""],["North","Joshua",""],["OBrien","Travis",""],["Pritchard","Michael",""],["Pruitt","David",""],["Risser","Mark",""],["Subramanian","Shashank",""],["Willard","Jared",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 11:04:25 GMT"}],"updateDate":"2024-08-08","timestamp":1722942265000,"abstract":"  Studying low-likelihood high-impact extreme weather events in a warming world\nis a significant and challenging task for current ensemble forecasting systems.\nWhile these systems presently use up to 100 members, larger ensembles could\nenrich the sampling of internal variability. They may capture the long tails\nassociated with climate hazards better than traditional ensemble sizes. Due to\ncomputational constraints, it is infeasible to generate huge ensembles\n(comprised of 1,000-10,000 members) with traditional, physics-based numerical\nmodels. In this two-part paper, we replace traditional numerical simulations\nwith machine learning (ML) to generate hindcasts of huge ensembles. In Part I,\nwe construct an ensemble weather forecasting system based on Spherical Fourier\nNeural Operators (SFNO), and we discuss important design decisions for\nconstructing such an ensemble. The ensemble represents model uncertainty\nthrough perturbed-parameter techniques, and it represents initial condition\nuncertainty through bred vectors, which sample the fastest growing modes of the\nforecast. Using the European Centre for Medium-Range Weather Forecasts\nIntegrated Forecasting System (IFS) as a baseline, we develop an evaluation\npipeline composed of mean, spectral, and extreme diagnostics. Using\nlarge-scale, distributed SFNOs with 1.1 billion learned parameters, we achieve\ncalibrated probabilistic forecasts. As the trajectories of the individual\nmembers diverge, the ML ensemble mean spectra degrade with lead time,\nconsistent with physical expectations. However, the individual ensemble\nmembers' spectra stay constant with lead time. Therefore, these members\nsimulate realistic weather states, and the ML ensemble thus passes a crucial\nspectral test in the literature. The IFS and ML ensembles have similar Extreme\nForecast Indices, and we show that the ML extreme weather forecasts are\nreliable and discriminating.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9Zlh0wlrJOhTTHoJ26peyjSL1lI0T-8JLj1AqLwzsUk","pdfSize":"12798503"}
