{"id":"2408.02823","title":"Effect of uniaxial magnetic anisotropy on charge transport in a junction\n  with a precessing anisotropic molecular spin","authors":"Milena Filipovic","authorsParsed":[["Filipovic","Milena",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 20:45:01 GMT"},{"version":"v2","created":"Fri, 6 Sep 2024 18:37:05 GMT"}],"updateDate":"2024-09-10","timestamp":1722890701000,"abstract":"  Anisotropic molecular magnets can be employed to manipulate charge transport\nin molecular nanojunctions. The charge transport through an electronic level\nconnected to source and drain metallic contacts and exchange-coupled with a\nprecessing anisotropic molecular spin in a constant external magnetic field is\nstudied here. Both the magnetic field and the uniaxial magnetic anisotropy\nparameter of the molecular spin control the total precession frequency. The\nKeldysh nonequilibrium Green's functions method is used to derive expressions\nfor charge current and current noise. The precessing molecular magnetization\ndrives inelastic tunnelling processes between electronic quasienergy levels.\nThe dc-bias voltages allow to unveil the quasienergy levels, Larmor frequency\nand the anisotropy parameter, through characteristics of charge-transport\nmeasurements involving features such as steps, peaks and dips. Under zero-bias\nvoltage conditions, for a sufficiently large anisotropy parameter that enables\nthe decrease of the total precession frequency or change of the precession\ndirection with respect to Larmor precession, the shot noise is reduced.\nFurthermore, it is possible to adjust the magnetic anisotropy parameter to\nsuppress the precession frequency, leading to the suppression of shot noise.\nThe results show that in the given setup, the charge current and shot noise can\nbe controlled by the uniaxial magnetic anisotropy of the molecular magnet.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}