{"id":"2408.07100","title":"Pattern-Matching Dynamic Memory Network for Dual-Mode Traffic Prediction","authors":"Wenchao Weng, Mei Wu, Hanyu Jiang, Wanzeng Kong, Xiangjie Kong, Feng\n  Xia","authorsParsed":[["Weng","Wenchao",""],["Wu","Mei",""],["Jiang","Hanyu",""],["Kong","Wanzeng",""],["Kong","Xiangjie",""],["Xia","Feng",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 15:12:30 GMT"}],"updateDate":"2024-08-15","timestamp":1723475550000,"abstract":"  In recent years, deep learning has increasingly gained attention in the field\nof traffic prediction. Existing traffic prediction models often rely on GCNs or\nattention mechanisms with O(N^2) complexity to dynamically extract traffic node\nfeatures, which lack efficiency and are not lightweight. Additionally, these\nmodels typically only utilize historical data for prediction, without\nconsidering the impact of the target information on the prediction. To address\nthese issues, we propose a Pattern-Matching Dynamic Memory Network (PM-DMNet).\nPM-DMNet employs a novel dynamic memory network to capture traffic pattern\nfeatures with only O(N) complexity, significantly reducing computational\noverhead while achieving excellent performance. The PM-DMNet also introduces\ntwo prediction methods: Recursive Multi-step Prediction (RMP) and Parallel\nMulti-step Prediction (PMP), which leverage the time features of the prediction\ntargets to assist in the forecasting process. Furthermore, a transfer attention\nmechanism is integrated into PMP, transforming historical data features to\nbetter align with the predicted target states, thereby capturing trend changes\nmore accurately and reducing errors. Extensive experiments demonstrate the\nsuperiority of the proposed model over existing benchmarks. The source codes\nare available at: https://github.com/wengwenchao123/PM-DMNet.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"464cPm7CzPfQ2geZ9nyMqsczYunfLdAnKdKc8HaMs24","pdfSize":"3673784"}
