{"id":"2408.09021","title":"Stealth Non-standard-model Confined Flare Eruptions: Sudden Reconnection\n  Events in Ostensibly Inert Magnetic Arches from Sunspots","authors":"Ronald L. Moore, Sanjiv K. Tiwari, Navdeep K. Panesar, V. Aparna,\n  Alphonse C. Sterling","authorsParsed":[["Moore","Ronald L.",""],["Tiwari","Sanjiv K.",""],["Panesar","Navdeep K.",""],["Aparna","V.",""],["Sterling","Alphonse C.",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 21:25:09 GMT"}],"updateDate":"2024-08-20","timestamp":1723843509000,"abstract":"  We report seven examples of a long-ignored type of confined solar flare\neruption that does not fit the standard model for confined flare eruptions.\nBecause they are confined eruptions, do not fit the standard model, and\nunexpectedly erupt in ostensibly inert magnetic arches, we have named them\nstealth non-standard-model confined flare eruptions. Each of our flaring\nmagnetic arches stems from a big sunspot. We tracked each eruption in\nfull-cadence UV and EUV images from the Atmospheric Imaging Assembly (AIA) of\nSolar Dynamics Observatory (SDO) in combination with magnetograms from SDO's\nHelioseismic and Magnetic Imager (HMI). We present the onset and evolution of\ntwo eruptions in detail: one of six that each make two side-by-side main flare\nloops, and one that makes two crossed main flare loops. For these two cases, we\npresent cartoons of the proposed pre-eruption field configuration and how\nsudden reconnection makes the flare ribbons and flare loops. Each of the seven\neruptions is consistent with being made by sudden reconnection at an interface\nbetween two internal field strands of the magnetic arch, where they cross at a\nsmall (10 - 20 degrees) angle. These stealth non-standard-model confined flare\neruptions therefore plausibly support the idea of E. N. Parker for coronal\nheating in solar coronal magnetic loops by nanoflare bursts of reconnection at\ninterfaces of internal field strands that cross at angles of 10 - 20 degrees.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"JIxYObdaeYBcnrvIsr5bCBgBdeXOEw_U1SIQxxanzbY","pdfSize":"10995824"}
