{"id":"2408.06614","title":"ViMo: Generating Motions from Casual Videos","authors":"Liangdong Qiu, Chengxing Yu, Yanran Li, Zhao Wang, Haibin Huang,\n  Chongyang Ma, Di Zhang, Pengfei Wan, Xiaoguang Han","authorsParsed":[["Qiu","Liangdong",""],["Yu","Chengxing",""],["Li","Yanran",""],["Wang","Zhao",""],["Huang","Haibin",""],["Ma","Chongyang",""],["Zhang","Di",""],["Wan","Pengfei",""],["Han","Xiaoguang",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 03:57:35 GMT"}],"updateDate":"2024-08-14","timestamp":1723521455000,"abstract":"  Although humans have the innate ability to imagine multiple possible actions\nfrom videos, it remains an extraordinary challenge for computers due to the\nintricate camera movements and montages. Most existing motion generation\nmethods predominantly rely on manually collected motion datasets, usually\ntediously sourced from motion capture (Mocap) systems or Multi-View cameras,\nunavoidably resulting in a limited size that severely undermines their\ngeneralizability. Inspired by recent advance of diffusion models, we probe a\nsimple and effective way to capture motions from videos and propose a novel\nVideo-to-Motion-Generation framework (ViMo) which could leverage the immense\ntrove of untapped video content to produce abundant and diverse 3D human\nmotions. Distinct from prior work, our videos could be more causal, including\ncomplicated camera movements and occlusions. Striking experimental results\ndemonstrate the proposed model could generate natural motions even for videos\nwhere rapid movements, varying perspectives, or frequent occlusions might\nexist. We also show this work could enable three important downstream\napplications, such as generating dancing motions according to arbitrary music\nand source video style. Extensive experimental results prove that our model\noffers an effective and scalable way to generate diversity and realistic\nmotions. Code and demos will be public soon.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}