{"id":"2408.13120","title":"Resolvent-Based Optimisation for Approximating the Statistics of Chaotic\n  Dynamics","authors":"Thomas Burton, Sean Symon, Ati Sharma, Davide Lasagna","authorsParsed":[["Burton","Thomas",""],["Symon","Sean",""],["Sharma","Ati",""],["Lasagna","Davide",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 14:47:16 GMT"}],"updateDate":"2024-08-26","timestamp":1724424436000,"abstract":"  We propose a novel framework for approximating the statistical properties of\nturbulent flows by combining variational methods for the search of unstable\nperiodic orbits with resolvent analysis for dimensionality reduction.\nTraditional approaches relying on identifying all short, fundamental Unstable\nPeriodic Orbits to compute ergodic averages via cycle expansion are\ncomputationally prohibitive for high-dimensional fluid systems. Our framework\nstems from the observation in Lasagna, Phys. Rev. E (2020), that a single\nunstable periodic orbit with a period sufficiently long to span a large\nfraction of the attractor captures the statistical properties of chaotic\ntrajectories. Given the difficulty of identifying unstable periodic orbits for\nhigh-dimensional fluid systems, approximate trajectories residing in a\nlow-dimensional subspace are instead constructed using resolvent modes, which\ninherently capture the temporal periodicity of unstable periodic orbits. The\namplitude coefficients of these modes are adjusted iteratively with\ngradient-based optimisation to minimise the violation of the projected\ngoverning equations, producing trajectories that approximate, rather than\nexactly solve, the system dynamics. A first attempt at utilising this framework\non a chaotic system is made here on the Lorenz 1963 equations, where resolvent\nanalysis enables an exact dimensionality reduction from three to two\ndimensions. Key observables averaged over these trajectories produced by the\napproach as well as probability distributions and spectra rapidly converge to\nvalues obtained from long chaotic simulations, even with a limited number of\niterations. This indicates that exact solutions may not necessary to\napproximate the system's statistical behaviour, as the trajectories obtained\nfrom partial optimisation provide a sufficient ``sketch'' of the attractor in\nstate space.\n","subjects":["Nonlinear Sciences/Chaotic Dynamics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2gYX1sPMLQLZ82iEF6UM4ohtAILjnlrkcyzAJQ9miLo","pdfSize":"5908883"}
