{"id":"2408.08358","title":"On the correlation between Ly$\\alpha$ forest opacity and galaxy density\n  in late reionization models","authors":"Nakul Gangolli, Anson D'Aloisio, Christopher Cain, George D. Becker,\n  and Holly Christenson","authorsParsed":[["Gangolli","Nakul",""],["D'Aloisio","Anson",""],["Cain","Christopher",""],["Becker","George D.",""],["Christenson","Holly",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 18:00:06 GMT"}],"updateDate":"2024-08-19","timestamp":1723744806000,"abstract":"  The relationship between Ly$\\alpha$ forest opacity and local galaxy density\n(the opacity-density relation) is a key observational test of late reionization\nmodels. Using narrow-band surveys of z=5.7 Ly$\\alpha$ emitters centered on\nquasar sight lines, Christenson et al. (2023) showed that two of the most\ntransmissive forest segments at this redshift intersect galaxy underdensities.\nThis is in tension with models of a strongly fluctuating ionizing background,\nincluding some late reionization models, which predict that the vast majority\nof these segments should intersect overdensities where the ionizing intensity\nis strongest. We use radiative transfer simulations to explore in detail the\nopacity-density relation in late reionization models. Fields like the one\ntoward quasar PSO J359-06 -- the more underdense of the two transmissive sight\nlines in Christenson et al. (2023) -- typically contain recently reionized gas\nin cosmic voids where the hot temperatures and low densities enhance Ly$\\alpha$\ntransmission. The opacity-density relation's transmissive end is sensitive to\nthe amount of neutral gas in voids, and its morphology, set by the reionization\nsource clustering. These effects are, however, degenerate. We demonstrate that\nmodels with very different source clustering can yield similar opacity-density\nrelations when their reionization histories are calibrated to match Ly$\\alpha$\nforest mean flux measurements at z<6. In models with fixed source clustering, a\nlower neutral fraction increases the likelihood of intersecting hot, recently\nreionized gas in voids, increasing the likelihood of observing PSO J359-06. For\ninstance, the probability of observing this field is 15% in a model with\nneutral fraction $x_{\\rm HI}=5\\%$ at z=5.7, three times more likely than in a\nmodel with $x_{\\rm HI}=15\\%$. The opacity-density relation may thus provide a\ncomplementary probe of reionization's end.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}