{"id":"2408.06559","title":"Asymptotic perpendicular transport in low-beta collisionless plasma","authors":"Jack Coughlin, Jingwei Hu, Uri Shumlak","authorsParsed":[["Coughlin","Jack",""],["Hu","Jingwei",""],["Shumlak","Uri",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 01:44:07 GMT"}],"updateDate":"2024-08-14","timestamp":1723513447000,"abstract":"  Kinetic physics, including finite Larmor radius (FLR) effects, are known to\naffect the physics of magnetized plasma phenomena such as the Kelvin-Helmholtz\nand Rayleigh-Taylor instabilities. Accurately incorporating FLR effects into\nfluid simulations requires moment closures for the heat flux and stress tensor,\nincluding the gyroviscous stress in collisionless magnetized plasmas. However,\nthe most commonly used gyroviscous stress tensor closure (Braginskii Rev.\nPlasma Phys., 1965) is based on a strongly collisional assumption for the\nasymptotic expansion of the kinetic equation in the so-called fast-dynamics\nordering. This collisional assumption becomes less valid for some\nhigh-temperature plasmas. To explore perpendicular transport in collisionless\nand weakly collisional plasmas, an asymptotic analysis of the weakly\ncollisional Vlasov equation in the slow-dynamics or drift ordering is performed\nin a new \"semi-fluid\" formalism, which integrates in perpendicular velocity to\nobtain a five-moment system. The associated heat flux and stress tensor\nclosures are determined via a Hilbert expansion of the kinetic equation. A\nnumerically affordable approximation to the stress tensor is proposed which\nadjusts the Braginskii closure to account for temperature gradient-driven\nstress. Continuum kinetic simulations of a family of sheared-flow\nconfigurations with variable magnetization and temperature gradients are\nperformed to validate the drift ordering semi-fluid expansion. The expected\nconvergence with magnetization is observed, and residuals are examined and\ndiscussed in terms of their relationship to higher-order terms in the\nexpansion. The adjusted Braginskii closure is found to accurately correct for\nthe error committed by the Braginskii gyroviscous stress tensor closure in the\npresence of temperature gradients.\n","subjects":["Physics/Computational Physics","Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5wEOnb_Q1tBodi0JOgoKMm4tk1Pf9wxF4hvQYFaD4BM","pdfSize":"10106691"}
