{"id":"2408.08902","title":"Audit-LLM: Multi-Agent Collaboration for Log-based Insider Threat\n  Detection","authors":"Chengyu Song, Linru Ma, Jianming Zheng, Jinzhi Liao, Hongyu Kuang, Lin\n  Yang","authorsParsed":[["Song","Chengyu",""],["Ma","Linru",""],["Zheng","Jianming",""],["Liao","Jinzhi",""],["Kuang","Hongyu",""],["Yang","Lin",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 11:33:45 GMT"}],"updateDate":"2024-08-20","timestamp":1723462425000,"abstract":"  Log-based insider threat detection (ITD) detects malicious user activities by\nauditing log entries. Recently, large language models (LLMs) with strong common\nsense knowledge have emerged in the domain of ITD. Nevertheless, diverse\nactivity types and overlong log files pose a significant challenge for LLMs in\ndirectly discerning malicious ones within myriads of normal activities.\nFurthermore, the faithfulness hallucination issue from LLMs aggravates its\napplication difficulty in ITD, as the generated conclusion may not align with\nuser commands and activity context. In response to these challenges, we\nintroduce Audit-LLM, a multi-agent log-based insider threat detection framework\ncomprising three collaborative agents: (i) the Decomposer agent, breaking down\nthe complex ITD task into manageable sub-tasks using Chain-of-Thought (COT)\nreasoning;(ii) the Tool Builder agent, creating reusable tools for sub-tasks to\novercome context length limitations in LLMs; and (iii) the Executor agent,\ngenerating the final detection conclusion by invoking constructed tools. To\nenhance conclusion accuracy, we propose a pair-wise Evidence-based Multi-agent\nDebate (EMAD) mechanism, where two independent Executors iteratively refine\ntheir conclusions through reasoning exchange to reach a consensus.\nComprehensive experiments conducted on three publicly available ITD\ndatasets-CERT r4.2, CERT r5.2, and PicoDomain-demonstrate the superiority of\nour method over existing baselines and show that the proposed EMAD\nsignificantly improves the faithfulness of explanations generated by LLMs.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}