{"id":"2408.06895","title":"X-ray spectral properties of the accreting millisecond pulsar IGR\n  J17498-2921 during its 2023 outburst","authors":"Giulia Illiano, Alessandro Papitto, Alessio Marino, Tod E. Strohmayer,\n  Andrea Sanna, Tiziana Di Salvo, Riccardo La Placa, Filippo Ambrosino, Arianna\n  Miraval Zanon, Francesco Coti Zelati, Caterina Ballocco, Christian Malacaria,\n  Adriano Ghedina, Massimo Cecconi, Manuel Gonzales, Franco Leone","authorsParsed":[["Illiano","Giulia",""],["Papitto","Alessandro",""],["Marino","Alessio",""],["Strohmayer","Tod E.",""],["Sanna","Andrea",""],["Di Salvo","Tiziana",""],["La Placa","Riccardo",""],["Ambrosino","Filippo",""],["Zanon","Arianna Miraval",""],["Zelati","Francesco Coti",""],["Ballocco","Caterina",""],["Malacaria","Christian",""],["Ghedina","Adriano",""],["Cecconi","Massimo",""],["Gonzales","Manuel",""],["Leone","Franco",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 13:44:00 GMT"}],"updateDate":"2024-08-14","timestamp":1723556640000,"abstract":"  We present a comprehensive study of the X-ray spectral properties of the\naccreting millisecond pulsar IGR J17498$-$2921 during its 2023 outburst.\nSimilar to other accreting millisecond pulsars, the broad-band spectral\nemission observed quasi-simultaneously by NICER and NuSTAR is well described by\nan absorbed Comptonized emission with an electron temperature of $\\sim$17 keV\nplus a disk reflection component. The broadening of the disk reflection\nspectral features, such as a prominent iron emission line at 6.4-6.7 keV, is\nconsistent with the relativistic motion of matter in a disk truncated at\n$\\sim$$21 \\, \\mathrm{R_g}$ from the source, near the Keplerian co-rotation\nradius. From the high-cadence monitoring data obtained with NICER, we observe\nthat the evolution of the photon index and the temperature of seed photons\ntracks variations in the X-ray flux. This is particularly evident close to a\nsudden $\\sim$-0.25 cycles jump in the pulse phase, which occurs immediately\nfollowing an X-ray flux flare and a drop in the pulse amplitude below the\n$3\\sigma$ detection threshold. We also report on the non-detection of optical\npulsations with TNG/SiFAP2 from the highly absorbed optical counterpart.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}