{"id":"2408.03410","title":"Precession and higher order multipoles in binary black holes (and lack\n  thereof)","authors":"Charlie Hoy, Stephen Fairhurst, Ilya Mandel","authorsParsed":[["Hoy","Charlie",""],["Fairhurst","Stephen",""],["Mandel","Ilya",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 19:17:46 GMT"}],"updateDate":"2024-08-08","timestamp":1722971866000,"abstract":"  The latest binary black hole population estimates argue for a subpopulation\nof unequal component mass binaries with spins that are likely small but\nisotropically distributed. This implies a non-zero probability of detecting\nspin-induced orbital precession and higher order multipoles moments in the\nobserved gravitational-wave signals. In this work we directly calculate the\nprobability for precession and higher order multipoles in each significant\ngravitational-wave candidate observed by the LIGO--Virgo--KAGRA collaborations\n(LVK). We find that only one event shows substantial evidence for precession:\nGW200129_065458, and two events show substantial evidence for higher order\nmultipoles: GW190412 and GW190814; any evidence for precession and higher order\nmultipoles in other gravitational-wave signals is consistent with random\nfluctuations caused by noise. We then compare our observations with\nexpectations from population models, and confirm that current population\nestimates from the LVK accurately predict the number of observed events with\nsignificant evidence for precession and higher order multipole moments. In\nparticular, we find that this population model predicts that a binary with\nsignificant evidence for precession will occur once in every $\\sim 50$\ndetections, and a binary with significant evidence for higher order multipole\nmoments will occur once in every $\\sim 70$ observations. However, we emphasise\nthat since substantial evidence for precession and higher order multipole\nmoments have only been observed in three events, any population model that\nincludes a subpopulation of binaries yielding $\\sim 2\\%$ of events with\ndetectable precession and higher order multipole moments will likely be\nconsistent with the data.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}