{"id":"2408.14711","title":"The impact of dark matter on tidal signatures in neutron star mergers\n  with Einstein Telescope","authors":"Hauke Koehn and Edoardo Giangrandi and Nina Kunert and Rahul\n  Somasundaram and Violetta Sagun and Tim Dietrich","authorsParsed":[["Koehn","Hauke",""],["Giangrandi","Edoardo",""],["Kunert","Nina",""],["Somasundaram","Rahul",""],["Sagun","Violetta",""],["Dietrich","Tim",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 00:34:54 GMT"}],"updateDate":"2024-08-28","timestamp":1724718894000,"abstract":"  If dark matter (DM) accumulates inside neutron stars (NS), it changes their\ninternal structure and causes a shift of the tidal deformability from the value\npredicted by the dense-matter equation of state (EOS). In principle, this shift\ncould be observable in the gravitational-wave (GW) signal of binary neutron\nstar (BNS) mergers. We investigate the effect of fermionic, non-interacting DM\nwhen observing a large number of GW events from DM-admixed BNSs with the\nprecision of the proposed Einstein telescope (ET). Specifically, we study the\nimpact on the recovery of the baryonic EOS and whether DM properties can be\nconstrained. For this purpose, we create event catalogues of BNS mock events\nwith DM fraction up to 1%, from which we reconstruct the posterior\nuncertainties with the Fisher matrix approach. Using this data, we perform\njoint Bayesian inference on the baryonic EOS, DM particle mass, and DM particle\nfraction in each event. Our results reveal that when falsely ignoring DM\neffects, the EOS posterior is biased towards softer EOSs, though the offset is\nrather small. Further, we find that within our assumptions of our DM model and\npopulation, ET will likely not be able to test the presence of DM in BNSs, even\nwhen combining many events and adding Cosmic Explorer (CE) to the\nnext-generation detector network. Likewise, the potential constraints on the DM\nparticle mass will remain weak because of degeneracies with the fraction and\nEOS.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zlhoNs4_VE8qtMOALbWkTIuGqg5dGBpF-uBzRsIWItA","pdfSize":"896223"}
