{"id":"2408.00172","title":"Holographic Beam Measurements of the Canadian Hydrogen Intensity Mapping\n  Experiment (CHIME)","authors":"Mandana Amiri, Arnab Chakraborty, Simon Foreman, Mark Halpern, Alex S\n  Hill, Gary Hinshaw, T.L. Landecker, Joshua MacEachern, Kiyoshi W. Masui, Juan\n  Mena-Parra, Nikola Milutinovic, Laura Newburgh, Anna Ordog, Ue-Li Pen,\n  Tristan Pinsonneault-Marotte, Alex Reda, Seth R. Siegel, Saurabh Singh,\n  Haochen Wang, Dallas Wulf","authorsParsed":[["Amiri","Mandana",""],["Chakraborty","Arnab",""],["Foreman","Simon",""],["Halpern","Mark",""],["Hill","Alex S",""],["Hinshaw","Gary",""],["Landecker","T. L.",""],["MacEachern","Joshua",""],["Masui","Kiyoshi W.",""],["Mena-Parra","Juan",""],["Milutinovic","Nikola",""],["Newburgh","Laura",""],["Ordog","Anna",""],["Pen","Ue-Li",""],["Pinsonneault-Marotte","Tristan",""],["Reda","Alex",""],["Siegel","Seth R.",""],["Singh","Saurabh",""],["Wang","Haochen",""],["Wulf","Dallas",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 21:52:01 GMT"}],"updateDate":"2024-08-02","timestamp":1722462721000,"abstract":"  We present the first results of the holographic beam mapping program for the\nCanadian Hydrogen Intensity Mapping Experiment (CHIME). We describe the\nimplementation of the holographic technique as adapted for CHIME, and introduce\nthe processing pipeline which prepares the raw holographic timestreams for\nanalysis of beam features. We use data from six bright sources across the full\n400-800\\,MHz observing band of CHIME to provide measurements of the co-polar\nand cross-polar beam response of CHIME in both amplitude and phase for the 1024\ndual-polarized feeds instrumented on CHIME. In addition, we present comparisons\nwith independent probes of the CHIME beam which indicate the presence of\npolarized beam leakage in CHIME. Holographic measurements of the CHIME beam\nhave already been applied in science with CHIME, e.g. in estimating detection\nsignificance of far sidelobe FRBs, and in validating the beam models used for\nCHIME's first detections of \\tcm emission (in cross-correlation with\nmeasurements of large-scale structure from galaxy surveys and the\nLyman-$\\alpha$ forest). Measurements presented in this paper, and future\nholographic results, will provide a unique data set to characterize the CHIME\nbeam and improve the experiment's prospects for a detection of BAO.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zeaZjfql9t71Aj1qd2r2OooVZSepRaHauIDb72Y7vEI","pdfSize":"46314546"}
