{"id":"2408.05529","title":"Quasi-Fractal UCA Based OAM for Highly Efficient Orthogonal Transmission","authors":"Wenchi Cheng, Haiyue Jing, Wei Zhang, Keyi Zhang, and Hailin Zhang","authorsParsed":[["Cheng","Wenchi",""],["Jing","Haiyue",""],["Zhang","Wei",""],["Zhang","Keyi",""],["Zhang","Hailin",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 12:04:59 GMT"}],"updateDate":"2024-08-13","timestamp":1723291499000,"abstract":"  The development of orbital angular momentum (OAM)-based radio vortex\ntransmission presents a promising opportunity for increasing the capacity of\nwireless communication in correlated channels due to its inherent orthogonality\namong different OAM modes. One of the most popular schemes for high-efficient\nOAM transmission is the digital baseband associated with uniform circular array\n(UCA) based transceiver. However, the periodicity of complex-exponential feed\nmakes the maximum number of orthogonal signals carried by multiple OAM modes\ngenerally restricted to the array-element number of UCA antenna, which poses an\nopen question of how to employ more OAM modes given a fixed number of array\nelements. Furthermore, signals modulated with high-order OAM modes are\ndifficult to be captured by the receiver due to their serious divergence as\npropagating in free space, thus severely limiting the capacity of radio vortex\ncommunications. To overcome the above challenges, in this paper based on the\npartly element-overlapped fractal geometry layout and effectively using\nlow-order OAM modes, we propose the quasi-fractal UCA (QF-UCA) antenna based\nOAM multiplexing transmission. We perform the two-dimension OAM modulation\n(TOM) and demodulation (TOD) schemes with the orthogonal OAM mode number\nexceeding the array-element number, which is beyond the traditional concept of\nmultiple antennas based wireless communications. Simulation results show that\nour proposed scheme can achieve more number of orthogonal multiplexing streams\nthan the maximum number of orthogonal multiplexing corresponding to traditional\nmultiple antenna systems.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}