{"id":"2408.14254","title":"Integrated Brain Connectivity Analysis with fMRI, DTI, and sMRI Powered\n  by Interpretable Graph Neural Networks","authors":"Gang Qu and Ziyu Zhou and Vince D. Calhoun and Aiying Zhang and\n  Yu-Ping Wang","authorsParsed":[["Qu","Gang",""],["Zhou","Ziyu",""],["Calhoun","Vince D.",""],["Zhang","Aiying",""],["Wang","Yu-Ping",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 13:16:42 GMT"}],"updateDate":"2024-08-27","timestamp":1724678202000,"abstract":"  Multimodal neuroimaging modeling has becomes a widely used approach but\nconfronts considerable challenges due to heterogeneity, which encompasses\nvariability in data types, scales, and formats across modalities. This\nvariability necessitates the deployment of advanced computational methods to\nintegrate and interpret these diverse datasets within a cohesive analytical\nframework. In our research, we amalgamate functional magnetic resonance\nimaging, diffusion tensor imaging, and structural MRI into a cohesive\nframework. This integration capitalizes on the unique strengths of each\nmodality and their inherent interconnections, aiming for a comprehensive\nunderstanding of the brain's connectivity and anatomical characteristics.\nUtilizing the Glasser atlas for parcellation, we integrate imaging derived\nfeatures from various modalities: functional connectivity from fMRI, structural\nconnectivity from DTI, and anatomical features from sMRI within consistent\nregions. Our approach incorporates a masking strategy to differentially weight\nneural connections, thereby facilitating a holistic amalgamation of multimodal\nimaging data. This technique enhances interpretability at connectivity level,\ntranscending traditional analyses centered on singular regional attributes. The\nmodel is applied to the Human Connectome Project's Development study to\nelucidate the associations between multimodal imaging and cognitive functions\nthroughout youth. The analysis demonstrates improved predictive accuracy and\nuncovers crucial anatomical features and essential neural connections,\ndeepening our understanding of brain structure and function.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}