{"id":"2408.03813","title":"Talk to the Wall: The Role of Speech Interaction in Collaborative Visual\n  Analytics","authors":"Gabriela Molina Le\\'on, Anastasia Bezerianos, Olivier Gladin, Petra\n  Isenberg","authorsParsed":[["León","Gabriela Molina",""],["Bezerianos","Anastasia",""],["Gladin","Olivier",""],["Isenberg","Petra",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 14:48:49 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 22:03:03 GMT"}],"updateDate":"2024-08-13","timestamp":1723042129000,"abstract":"  We present the results of an exploratory study on how pairs interact with\nspeech commands and touch gestures on a wall-sized display during a\ncollaborative sensemaking task. Previous work has shown that speech commands,\nalone or in combination with other input modalities, can support visual data\nexploration by individuals. However, it is still unknown whether and how speech\ncommands can be used in collaboration, and for what tasks. To answer these\nquestions, we developed a functioning prototype that we used as a technology\nprobe. We conducted an in-depth exploratory study with 10 participant pairs to\nanalyze their interaction choices, the interplay between the input modalities,\nand their collaboration. While touch was the most used modality, we found that\nparticipants preferred speech commands for global operations, used them for\ndistant interaction, and that speech interaction contributed to the awareness\nof the partner's actions. Furthermore, the likelihood of using speech commands\nduring collaboration was related to the personality trait of agreeableness.\nRegarding collaboration styles, participants interacted with speech equally\noften whether they were in loosely or closely coupled collaboration. While the\npartners stood closer to each other during close collaboration, they did not\ndistance themselves to use speech commands. From our findings, we derive and\ncontribute a set of design considerations for collaborative and multimodal\ninteractive data analysis systems. All supplemental materials are available at\nhttps://osf.io/8gpv2\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}