{"id":"2408.08504","title":"Percolation analysis of spatio-temporal distribution of population in\n  Seoul and Helsinki","authors":"Yunwoo Nam and Young-Ho Eom","authorsParsed":[["Nam","Yunwoo",""],["Eom","Young-Ho",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 03:04:11 GMT"}],"updateDate":"2024-08-19","timestamp":1723777451000,"abstract":"  Spatio-temporal distribution of urban population is crucial to understand the\nstructure and dynamics of cities. Most studies, however, have focused on the\nmicroscopic structure of cities such as their few most crowded areas. In this\nwork, we investigate the macroscopic structure of cities such as their clusters\nof highly populated areas. To do this, we analyze the spatial distribution of\nurban population and its intra-day dynamics in Seoul and Helsinki with a\npercolation framework. We observe that the growth patterns of the largest\nclusters in the real and randomly shuffled population data are significantly\ndifferent, and highly populated areas during daytime are denser and form larger\nclusters than during nighttime. An analysis of the cluster size distributions\nat percolation criticality shows that their power-law exponents during daytime\nare lower than during nighttime, indicating that the spatial distributions of\nurban population during daytime and nighttime fall into different universality\nclasses. Finally measuring the area-perimeter fractal dimension of the\ncollection of clusters at criticality demonstrates that the fractal dimensions\nduring daytime are higher than during nighttime, indicating that the perimeters\nof clusters during daytime are more rough than during nighttime. Our findings\nsuggest that even the same city can have qualitatively different spatial\ndistributions of population over time, and propose a way to quantitatively\ncompare the macrostructure of cities based on population distribution data.\n","subjects":["Physics/Physics and Society","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}