{"id":"2408.15928","title":"Observing Time-Dependent Energy Level Renormalisation in an\n  Ultrastrongly Coupled Open System","authors":"Alessandra Colla, Florian Hasse, Deviprasath Palani, Tobias Schaetz,\n  Heinz-Peter Breuer, and Ulrich Warring","authorsParsed":[["Colla","Alessandra",""],["Hasse","Florian",""],["Palani","Deviprasath",""],["Schaetz","Tobias",""],["Breuer","Heinz-Peter",""],["Warring","Ulrich",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 16:40:55 GMT"}],"updateDate":"2024-08-29","timestamp":1724863255000,"abstract":"  Understanding how strong coupling and memory effects influence the energy\nlevels of open quantum systems is a complex and challenging problem. Here, we\nshow these effects by probing the transition frequency of an open two-level\nsystem within the Jaynes-Cummings model, experimentally realised using Ramsey\ninterferometry in a single trapped 25Mg+ ion. Measurements of the system,\ncoupled to a single-mode environment, reveal a time-dependent shift in the\nsystem's energy levels of up to 15% of the bare system frequency. This shift,\naccurately predicted using an open system ansatz of minimal dissipation,\nresults purely from ultra-strong system-mode interactions and the buildup of\ncorrelations. Time-averaged measurements converge to the dispersive Lamb shift\npredictions and match dressed-state energies, indicating that this observed\nshift represents a generalised Lamb shift applicable across all coupling and\ndetuning regimes. Our findings provide direct evidence of dynamic energy level\nrenormalisation in strongly coupled open quantum systems, although the total\nsystem-environment Hamiltonian is static; this underscores the significance of\nmemory effects in shaping the reduced system's energy landscape. These results\noffer more profound insights into Hamiltonian renormalisation, essential for\nstrong-coupling quantum thermodynamics and advancements in all quantum\nplatforms.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}