{"id":"2408.11219","title":"CoDi: Conversational Distillation for Grounded Question Answering","authors":"Patrick Huber, Arash Einolghozati, Rylan Conway, Kanika Narang, Matt\n  Smith, Waqar Nayyar, Adithya Sagar, Ahmed Aly, Akshat Shrivastava","authorsParsed":[["Huber","Patrick",""],["Einolghozati","Arash",""],["Conway","Rylan",""],["Narang","Kanika",""],["Smith","Matt",""],["Nayyar","Waqar",""],["Sagar","Adithya",""],["Aly","Ahmed",""],["Shrivastava","Akshat",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 22:35:47 GMT"}],"updateDate":"2024-08-22","timestamp":1724193347000,"abstract":"  Distilling conversational skills into Small Language Models (SLMs) with\napproximately 1 billion parameters presents significant challenges. Firstly,\nSLMs have limited capacity in their model parameters to learn extensive\nknowledge compared to larger models. Secondly, high-quality conversational\ndatasets are often scarce, small, and domain-specific. Addressing these\nchallenges, we introduce a novel data distillation framework named CoDi (short\nfor Conversational Distillation, pronounced \"Cody\"), allowing us to synthesize\nlarge-scale, assistant-style datasets in a steerable and diverse manner.\nSpecifically, while our framework is task agnostic at its core, we explore and\nevaluate the potential of CoDi on the task of conversational grounded reasoning\nfor question answering. This is a typical on-device scenario for specialist\nSLMs, allowing for open-domain model responses, without requiring the model to\n\"memorize\" world knowledge in its limited weights. Our evaluations show that\nSLMs trained with CoDi-synthesized data achieve performance comparable to\nmodels trained on human-annotated data in standard metrics. Additionally, when\nusing our framework to generate larger datasets from web data, our models\nsurpass larger, instruction-tuned models in zero-shot conversational grounded\nreasoning tasks.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"N11k9fSevmkGlc0SHWZTiRQIUsmMMYuo3gLxRHS3qrE","pdfSize":"1081852"}
