{"id":"2408.14190","title":"Harnessing the Digital Revolution: A Comprehensive Review of mHealth\n  Applications for Remote Monitoring in Transforming Healthcare Delivery","authors":"Avnish Singh Jat and Tor-Morten Gr{\\o}nli","authorsParsed":[["Jat","Avnish Singh",""],["Grønli","Tor-Morten",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 11:32:43 GMT"}],"updateDate":"2024-08-27","timestamp":1724671963000,"abstract":"  The utilization of mHealth applications for remote monitoring has the\npotential to revolutionize healthcare delivery by enhancing patient outcomes,\nincreasing access to healthcare services, and reducing healthcare costs. This\nliterature review aims to provide a comprehensive overview of the current state\nof knowledge on mHealth applications for remote monitoring, including their\ntypes, benefits, challenges, and limitations, as well as future directions and\nresearch gaps. A systematic search of databases such as PubMed, MEDLINE,\nEMBASE, CINAHL, and Google Scholar was conducted to identify relevant articles\npublished within the last 5 years. Thematic analysis was used to synthesize the\nfindings. The review highlights various types of mHealth applications used for\nremote monitoring, such as telemedicine platforms, mobile apps for chronic\ndisease management, and wearable devices. The benefits of these applications\ninclude improved patient outcomes, increased access to healthcare, reduced\nhealthcare costs, and addressing healthcare disparities. However, challenges\nand limitations, such as privacy and security concerns, lack of technical\ninfrastructure, regulatory is-sues, data accuracy, user adherence, and the\ndigital divide, need to be addressed to ensure successful adoption and\nutilization of mHealth applications. Further research is required in areas such\nas the long-term effects of mHealth applications on patient outcomes,\nintegration of mHealth data with electronic health records, and the development\nof artificial intelligence-driven mHealth applica-tions. By harnessing the\npotential of mHealth applications and addressing the existing challenges,\nhealthcare delivery can be transformed towards a more accessible,\ncost-effective, and patient-centered model.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_iiBrJUZjOgjBYaYbKaVsvaY45ScRWCJojZ2gT6K4GA","pdfSize":"177086"}
