{"id":"2408.07374","title":"Coupling Between Local and Global Oscillations in Palladium-Catalysed\n  Methane Oxidation","authors":"Yuxiong Hu, Jianyu Hu, Mengzhao Sun, Aowen Li, Shucheng Shi, P. J. Hu,\n  Wu Zhou, Marc-Georg Willinger, Dan Zhou, Zhi Liu, Xi Liu, Wei-Xue Li, Zhu-Jun\n  Wang","authorsParsed":[["Hu","Yuxiong",""],["Hu","Jianyu",""],["Sun","Mengzhao",""],["Li","Aowen",""],["Shi","Shucheng",""],["Hu","P. J.",""],["Zhou","Wu",""],["Willinger","Marc-Georg",""],["Zhou","Dan",""],["Liu","Zhi",""],["Liu","Xi",""],["Li","Wei-Xue",""],["Wang","Zhu-Jun",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 08:48:53 GMT"}],"updateDate":"2024-08-15","timestamp":1723625333000,"abstract":"  The interplay between order and disorder is crucial across various fields,\nespecially in understanding oscillatory phenomena. Periodic oscillations are\nfrequently observed in heterogeneous catalysis, yet their underlying mechanisms\nneed deeper exploration. Here, we investigate how periodic oscillations arise\nduring methane oxidation catalysed by palladium nanoparticles (Pd NPs),\nutilizing a suite of complementary operando techniques across various spatial\nscales. We found that reaction intensity and collective dynamic modes can be\ntuned by the reactant gas-flow rate. At lower gas-flow rates, we observed\nperiodic facet reconstruction of Pd NPs correlated with repeated bubbling\nbehaviour at the Pd/PdO interface, without evident global oscillatory\nresponses. Conversely, at higher gas-flow rates, Pd NPs undergo chaotic\ntransformations between metallic and oxidized states, resulting in overall\noscillation. Integrating our observations at different gas-flow rates, we\nattributed the emergence of global oscillation to thermal coupling regulated by\ngas flow and connected local and global dynamics through a weak synchronization\nmechanism. This work demonstrates the correlations between open surfaces and\ninterfaces, chaos and regularity, and dissipative processes and coupling\nbehaviour. Our findings offer critical insights into the complexity behind\ncatalytic oscillations and provide guidance for modulating oscillatory\nbehaviours in catalytic processes, with significant implications for both\nscience and industry.\n","subjects":["Physics/Chemical Physics","Nonlinear Sciences/Adaptation and Self-Organizing Systems","Nonlinear Sciences/Chaotic Dynamics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}