{"id":"2408.10616","title":"A toolbox for calculating objective image properties in aesthetics\n  research","authors":"Christoph Redies, Ralf Bartho, Lisa Ko{\\ss}mann, Branka Spehar, Ronald\n  H\\\"ubner, Johan Wagemans, Gregor U. Hayn-Leichsenring","authorsParsed":[["Redies","Christoph",""],["Bartho","Ralf",""],["Koßmann","Lisa",""],["Spehar","Branka",""],["Hübner","Ronald",""],["Wagemans","Johan",""],["Hayn-Leichsenring","Gregor U.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 07:49:43 GMT"}],"updateDate":"2024-08-21","timestamp":1724140183000,"abstract":"  Over the past two decades, researchers in the field of visual aesthetics have\nstudied numerous quantitative (objective) image properties and how they relate\nto visual aesthetic appreciation. However, results are difficult to compare\nbetween research groups. One reason is that researchers use different sets of\nimage properties in their studies. But even if the same properties are used,\nthe image pre-processing techniques may differ and often researchers use their\nown customized scripts to calculate the image properties. To provide greater\naccessibility and comparability of research results in visual experimental\naesthetics, we developed an open-access and easy-to-use toolbox (called the\n'Aesthetics Toolbox'). The Toolbox allows users to calculate a well-defined set\nof quantitative image properties popular in contemporary research. The\nproperties include lightness and color statistics, Fourier spectral properties,\nfractality, self-similarity, symmetry, as well as different entropy measures\nand CNN-based variances. Compatible with most devices, the Toolbox provides an\nintuitive click-and-drop web interface. In the Toolbox, we integrated the\noriginal scripts of four different research groups and translated them into\nPython 3. To ensure that results were consistent across analyses, we took care\nthat results from the Python versions of the scripts were the same as those\nfrom the original scripts. The toolbox, detailed documentation, and a link to\nthe cloud version are available via Github:\nhttps://github.com/RBartho/Aesthetics-Toolbox. In summary, we developed a\ntoolbox that helps to standardize and simplify the calculation of quantitative\nimage properties for visual aesthetics research.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}