{"id":"2408.14913","title":"Integrated Bundling and Pricing of Unique Items","authors":"Maxime Bouscary, Mazen Danaf, Saurabh Amin","authorsParsed":[["Bouscary","Maxime",""],["Danaf","Mazen",""],["Amin","Saurabh",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 09:43:04 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 18:49:06 GMT"}],"updateDate":"2024-09-06","timestamp":1724751784000,"abstract":"  Retailers have significant potential to improve recommendations through\nstrategic bundling and pricing. By taking into account different types of\ncustomers and their purchasing decisions, retailers can better accommodate\ncustomer preferences and increase revenues while reducing unsold items. We\nconsider a retailer seeking to maximize its expected revenue by selling unique\nand non-replenishable items over a finite horizon. The retailer may offer each\nitem individually or as part of a bundle.\n  Our approach provides tractable bounds on expected revenue that are tailored\nto unique items and suitable for a rich class of choice models. We leverage\nthese bounds to propose a bundling algorithm that efficiently selects bundles\nin a column-generation fashion. Under the multinomial logit model, our bounds\nare asymptotically optimal as the expected number of arrivals $\\lambda$ grows,\nyielding a performance bound in $O(1/\\lambda)$. In contrast, we show that both\nthe static and fluid approximations are not asymptotically optimal. Moreover,\nwe propose a greedy algorithm that allows for tractable dynamic bundling.\n  We show through numerical experiments that third-party logistics providers\n(3PL) in particular can benefit from improved load recommendations and pricing\ndecisions. By not only minimizing shipping costs, but also reducing empty miles\nand suggesting options that better match carrier preferences, our methodology\nbenefits digital brokerage platforms while contributing to the transportation\nindustry's sustainability efforts. In a Texas Triangle simulation powered by\nUber Freight data, dynamic bundling and pricing reduces costs by 6%, empty\nmiles by 25%, and more than halves the number of unmatched loads over dynamic\npricing alone.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"BZYKsktKaBpTp7H1tUSrJb9bVAh_gPAdZq7zXJW7WFc","pdfSize":"2244644"}
