{"id":"2408.10327","title":"An Empirical Study on Package-Level Deprecation in Python Ecosystem","authors":"Zhiqing Zhong, Shilin He, Haoxuan Wang, Boxi Yu, Haowen Yang, Pinjia\n  He","authorsParsed":[["Zhong","Zhiqing",""],["He","Shilin",""],["Wang","Haoxuan",""],["Yu","Boxi",""],["Yang","Haowen",""],["He","Pinjia",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:08:21 GMT"}],"updateDate":"2024-08-21","timestamp":1724090901000,"abstract":"  Open-source software (OSS) plays a crucial role in modern software\ndevelopment. Utilizing OSS code can greatly accelerate software development,\nreduce redundancy, and enhance reliability. Python, a widely adopted\nprogramming language, is renowned for its extensive and diverse third-party\npackage ecosystem. However, a significant number of OSS packages within the\nPython ecosystem are in poor maintenance, leading to potential risks in\nfunctionality and security. Consequently, it is essential to establish a\ndeprecation mechanism to assist package developers and users in managing\npackages effectively.\n  To facilitate the establishment of the package-level deprecation mechanism,\nthis paper presents a mixed-method empirical study, including data analysis and\nsurveys. We investigate the current practices of announcing, receiving, and\nhandling package-level deprecation in the Python ecosystem. We also assess the\nbenefits of having deprecation announcements for inactively maintained\npackages. Furthermore, we investigate the challenges faced by package\ndevelopers and users and their expectations for future deprecation practices.\nOur findings reveal that 75.4% of inactive package developers have no intention\nof releasing deprecation declarations for various reasons, while 89.5% of users\nexpress a desire to be notified about the deprecation, highlighting a gap\nbetween developers and users; in many cases, no alternative solutions are\navailable when deprecation occurs, emphasizing the need to explore practical\napproaches that enable seamless package handover and require less maintenance\neffort. Our work aims to enhance the understanding of existing package-level\ndeprecation patterns within the Python OSS realm and facilitate the development\nof deprecation practices for the Python community in the future.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fJ0oWrJsmWJR8kDYhrUbdIQvCZNpMSHUoOk1p5QkJr4","pdfSize":"650617"}
