{"id":"2408.08005","title":"Inversion-DeepONet: A Novel DeepONet-Based Network with Encoder-Decoder\n  for Full Waveform Inversion","authors":"Zekai Guo, Lihui Chai, Shengjun Huang, Ye Li","authorsParsed":[["Guo","Zekai",""],["Chai","Lihui",""],["Huang","Shengjun",""],["Li","Ye",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 08:15:06 GMT"}],"updateDate":"2024-08-16","timestamp":1723709706000,"abstract":"  Full waveform inversion (FWI) plays a crucial role in the field of\ngeophysics. There has been lots of research about applying deep learning (DL)\nmethods to FWI. The success of DL-FWI relies significantly on the quantity and\ndiversity of the datasets. Nevertheless, existing FWI datasets, like OpenFWI,\nwhere sources have fixed locations or identical frequencies, provide limited\ninformation and do not represent the complex real-world scene. For instance,\nlow frequencies help in resolving larger-scale structures. High frequencies\nallow for a more detailed subsurface features. %A single source frequency is\ninsufficient to describe subsurface structural properties. We consider that\nsimultaneously using sources with different frequencies, instead of performing\ninversion using low frequencies data and then gradually introducing higher\nfrequencies data, has rationale and potential advantages. Hence, we develop\nthree enhanced datasets based on OpenFWI where each source have varying\nlocations, frequencies or both. Moreover, we propose a novel deep operator\nnetwork (DeepONet) architecture Inversion-DeepONet for FWI. We utilize\nconvolutional neural network (CNN) to extract the features from seismic data in\nbranch net. Source parameters, such as locations and frequencies, are fed to\ntrunk net. Then another CNN is employed as the decoder of DeepONet to\nreconstruct the velocity models more effectively. Through experiments, we\nconfirm the superior performance on accuracy and generalization ability of our\nnetwork, compared with existing data-driven FWI methods.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}