{"id":"2408.13739","title":"Literary and Colloquial Tamil Dialect Identification","authors":"M. Nanmalar, P. Vijayalakshmi, T. Nagarajan","authorsParsed":[["Nanmalar","M.",""],["Vijayalakshmi","P.",""],["Nagarajan","T.",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 06:52:48 GMT"}],"updateDate":"2024-08-27","timestamp":1724568768000,"abstract":"  Culture and language evolve together. The old literary form of Tamil is used\ncommonly for writing and the contemporary colloquial Tamil is used for\nspeaking. Human-computer interaction applications require Colloquial Tamil (CT)\nto make it more accessible and easy for the everyday user and, it requires\nLiterary Tamil (LT) when information is needed in a formal written format.\nContinuing the use of LT alongside CT in computer aided language learning\napplications will both preserve LT, and provide ease of use via CT, at the same\ntime. Hence there is a need for the conversion between LT and CT dialects,\nwhich demands as a first step, dialect identification. Dialect Identification\n(DID) of LT and CT is an unexplored area of research. In the current work,\nkeeping the nuances of both these dialects in mind, five methods are explored\nwhich include two implicit methods - Gaussian Mixture Model (GMM) and\nConvolutional Neural Network (CNN); two explicit methods - Parallel Phone\nRecognition (PPR) and Parallel Large Vocabulary Continuous Speech Recognition\n(P-LVCSR); two versions of the proposed explicit Unified Phone Recognition\nmethod (UPR-1 and UPR-2). These methods vary based on: the need for annotated\ndata, the size of the unit, the way in which modelling is carried out, and the\nway in which the final decision is made. Even though the average duration of\nthe test utterances is less - 4.9s for LT and 2.5s for CT - the systems\nperformed well, offering the following identification accuracies: 87.72% (GMM),\n93.97% (CNN), 89.24% (PPR), 94.21% (P-LVCSR), 88.57% (UPR-1), 93.53% (UPR-1\nwith P-LVCSR), 94.55% (UPR-2), and 95.61% (UPR-2 with P-LVCSR).\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Computation and Language","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning","Computing Research Repository/Sound"],"license":"http://creativecommons.org/licenses/by/4.0/"}