{"id":"2408.05852","title":"Characterisation of the stellar wind in Cyg X-1 via modelling of\n  colour-colour diagrams","authors":"E. V. Lai, B. De Marco, Y. Cavecchi, I. El Mellah, M. Cinus, C. M.\n  Diez, V. Grinberg, A. A. Zdziarski, P. Uttley, M. Bachetti, J. Jos\\'e, G.\n  Sala, A. R\\'o\\.za\\'nska and J. Wilms","authorsParsed":[["Lai","E. V.",""],["De Marco","B.",""],["Cavecchi","Y.",""],["Mellah","I. El",""],["Cinus","M.",""],["Diez","C. M.",""],["Grinberg","V.",""],["Zdziarski","A. A.",""],["Uttley","P.",""],["Bachetti","M.",""],["José","J.",""],["Sala","G.",""],["Różańska","A.",""],["Wilms","J.",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 19:47:53 GMT"}],"updateDate":"2024-08-13","timestamp":1723405673000,"abstract":"  Cygnus X-1 is a high mass X-ray binary where accretion onto the black hole is\nmediated by the stellar wind from the blue supergiant companion star HDE\n226868. Depending on the position of the black hole along the orbit, X-ray\nobservations can probe different layers of the stellar wind. Deeper wind layers\ncan be investigated at superior conjunction (i.e. null orbital phases). We aim\nat characterising the stellar wind in the Cyg X-1/HDE 226868 system analysing\none passage at superior conjunction covered by XMM-Newton during the CHOCBOX\ncampaign via modelling of colour-colour diagrams. Since X-ray absorption is\nenergy-dependent, colour indices provide information on the parameters of the\nstellar wind, such as the column density $N_{H,w}$ and the covering factor\n$f_c$. We fitted colour-colour diagrams with models that include both a\ncontinuum and a stellar wind component. We used the KDE method to infer the\nunknown probability distribution of the data points in the colour-colour\ndiagram, and selected the model corresponding to the highest likelihood. In\norder to study the temporal evolution of the wind around superior conjunction,\nwe extracted and fitted time-resolved colour-colour diagrams. We found that the\nmodel that best describes the shape of the colour-colour diagram of Cyg X-1 at\nsuperior conjunction requires the wind to be partially ionised. The shape of\nthe colour-colour diagram strongly varies during the analysed observation, as\ndue to concurrent changes of the mean $N_{H,w}$ and the $f_c$ of the wind. Our\nresults suggest the existence of a linear scaling between the rapid variability\namplitude of $N_{H,w}$ (on time scales between 10 s and 11 ks) and its long\nterm variations (on time scales 11>ks). Using the inferred best-fit values, we\nestimated the stellar mass loss rate to be $\\sim 7\\times10^{-6} {\\rm\nM_{\\odot}yr^{-1}}$ and the clumps to have a mass of $\\sim10^{17}$ g.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AJVOlG9YvU2nNc3HHZOuBeoVBOQ0KpGI-SidtiS7O2k","pdfSize":"6801263"}
