{"id":"2408.06568","title":"MORCoRA: Multi-Objective Refactoring Recommendation Considering Review\n  Availability","authors":"Lei Chen, Shinpei Hayashi","authorsParsed":[["Chen","Lei",""],["Hayashi","Shinpei",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 02:08:16 GMT"}],"updateDate":"2024-08-14","timestamp":1723514896000,"abstract":"  Background: Search-based refactoring involves searching for a sequence of\nrefactorings to achieve specific objectives. Although a typical objective is\nimproving code quality, a different perspective is also required; the searched\nsequence must undergo review before being applied and may not be applied if the\nreview fails or is postponed due to no proper reviewers. Aim: Therefore, it is\nessential to ensure that the searched sequence of refactorings can be reviewed\npromptly by reviewers who meet two criteria: 1) having enough expertise and 2)\nbeing free of heavy workload. The two criteria are regarded as the review\navailability of the refactoring sequence. Method: We propose MORCoRA, a\nmulti-objective search-based technique that can search for code quality\nimprovable, semantic preserved, and high review availability possessed\nrefactoring sequences and corresponding proper reviewers. Results: We evaluate\nMORCoRA on six open-source repositories. The quantitative analysis reveals that\nMORCoRA can effectively recommend refactoring sequences that fit the\nrequirements. The qualitative analysis demonstrates that the refactorings\nrecommended by MORCoRA can enhance code quality and effectively address code\nsmells. Furthermore, the recommended reviewers for those refactorings possess\nhigh expertise and are available to review. Conclusions: We recommend that\nrefactoring recommenders consider both the impact on quality improvement and\nthe developer resources required for review when recommending refactorings.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}