{"id":"2408.08744","title":"Noisy information channel mediated prevention of the tragedy of the\n  commons","authors":"Samrat Sohel Mondal and Sagar Chakraborty","authorsParsed":[["Mondal","Samrat Sohel",""],["Chakraborty","Sagar",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 13:43:56 GMT"}],"updateDate":"2024-08-19","timestamp":1723815836000,"abstract":"  Synergy between evolutionary dynamics of cooperation and fluctuating state of\nshared resource being consumed by the cooperators is essential for averting the\ntragedy of the commons. Not only in humans, but also in the cognitively-limited\norganisms, this interplay between the resource and the cooperation is\nubiquitously witnessed. The strategically interacting players engaged in such\ngame-environment feedback scenarios naturally pick strategies based on their\nperception of the environmental state. Such perception invariably happens\nthrough some sensory information channels that the players are endowed with.\nThe unfortunate reality is that any sensory channel must be noisy due to\nvarious factors; consequently, the perception of the environmental state\nbecomes faulty rendering the players incapable of adopting the strategy that\nthey otherwise would. Intriguingly, situation is not as bad as it sounds. Here\nwe introduce the hitherto neglected information channel between players and the\nenvironment into the paradigm of stochastic evolutionary games with a view to\nbringing forward the counterintuitive possibility of emergence and sustenance\nof cooperation on account of the noise in the channel. Our primary study is in\nthe simplest non-trivial setting of two-state stochastically fluctuating\nresource harnessed by a large unstructured population of cooperators and\ndefectors adopting either memory-1 strategies or reactive strategies while\nengaged in repeated two-player interactions. The effect of noisy information\nchannel in enhancing the cooperation in reactive-strategied population is\nunprecedented. We find that the propensity of cooperation in the population is\ninversely related to the mutual information (normalized by the channel\ncapacity) of the corresponding information channel.\n","subjects":["Quantitative Biology/Populations and Evolution","Physics/Physics and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}