{"id":"2408.14990","title":"Beltrami fields, dispersive electromagnetic waves and gravitational\n  spheromaks from chiral anomaly","authors":"Sergey N. Solodukhin","authorsParsed":[["Solodukhin","Sergey N.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 12:11:34 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 08:37:11 GMT"}],"updateDate":"2024-09-05","timestamp":1724760694000,"abstract":"  In this note we focus on the backreaction effects due to the chiral anomaly.\nThe chiral anomaly gives rise to certain modifications in the conserved\ncurrents. In the case of the Maxwell gauge fields there appears a new\ncontribution to the electric current proportional to the background magnetic\nfield. This phenomenon is known as the chiral magnetic effect and it is widely\ndiscussed in the current literature. In the case of the gravitational field,\nthe anomaly, as we show here, induces a new contribution to the stress-energy\ntensor. We analyze the possible manifestations of these modifications in the\ngravitational field and in hydrodynamics in the chiral media. We also make some\ncomments regarding the backreaction effects in electrodynamics in the chiral\nmedia. In each of these directions we observe the systematical appearance of\nthe Beltrami type fields. In electrodynamics or in hydrodynamics the Beltrami\nfield (e.g., magnetic field or fluid velocity) is a vector that is parallel to\nits own curl. We suggest a generalization of the Beltrami fields for the\ntensorial gravitational perturbations. The respective solutions to the\ngravitational equations we call gravitational spheromaks by analogy with a\nsimilar phenomenon in electrodynamics. In the modified hydrodynamics in the\nchiral media the vorticity is asymptotically a Beltrami vector field in a\ngeneralized Gromeka-Beltrami flow.\n","subjects":["Physics/High Energy Physics - Theory","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/General Relativity and Quantum Cosmology","Mathematics/Analysis of PDEs"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}