{"id":"2408.08543","title":"Language-Driven Interactive Shadow Detection","authors":"Hongqiu Wang, Wei Wang, Haipeng Zhou, Huihui Xu, Shaozhi Wu, Lei Zhu","authorsParsed":[["Wang","Hongqiu",""],["Wang","Wei",""],["Zhou","Haipeng",""],["Xu","Huihui",""],["Wu","Shaozhi",""],["Zhu","Lei",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 05:57:22 GMT"}],"updateDate":"2024-08-19","timestamp":1723787842000,"abstract":"  Traditional shadow detectors often identify all shadow regions of static\nimages or video sequences. This work presents the Referring Video Shadow\nDetection (RVSD), which is an innovative task that rejuvenates the classic\nparadigm by facilitating the segmentation of particular shadows in videos based\non descriptive natural language prompts. This novel RVSD not only achieves\nsegmentation of arbitrary shadow areas of interest based on descriptions\n(flexibility) but also allows users to interact with visual content more\ndirectly and naturally by using natural language prompts (interactivity),\npaving the way for abundant applications ranging from advanced video editing to\nvirtual reality experiences. To pioneer the RVSD research, we curated a\nwell-annotated RVSD dataset, which encompasses 86 videos and a rich set of\n15,011 paired textual descriptions with corresponding shadows. To the best of\nour knowledge, this dataset is the first one for addressing RVSD. Based on this\ndataset, we propose a Referring Shadow-Track Memory Network (RSM-Net) for\naddressing the RVSD task. In our RSM-Net, we devise a Twin-Track Synergistic\nMemory (TSM) to store intra-clip memory features and hierarchical inter-clip\nmemory features, and then pass these memory features into a memory read module\nto refine features of the current video frame for referring shadow detection.\nWe also develop a Mixed-Prior Shadow Attention (MSA) to utilize physical priors\nto obtain a coarse shadow map for learning more visual features by weighting it\nwith the input video frame. Experimental results show that our RSM-Net achieves\nstate-of-the-art performance for RVSD with a notable Overall IOU increase of\n4.4\\%. Our code and dataset are available at https://github.com/whq-xxh/RVSD.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}