{"id":"2408.10744","title":"Can we rely on EUV emission to identify coronal waveguides?","authors":"P. Kohutova, P. Antolin, M. Szydlarski, N. Poirier","authorsParsed":[["Kohutova","P.",""],["Antolin","P.",""],["Szydlarski","M.",""],["Poirier","N.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 11:25:58 GMT"}],"updateDate":"2024-08-21","timestamp":1724153158000,"abstract":"  Traditional models of coronal oscillations rely on modelling the coronal\nstructures that support them as compact cylindrical waveguides. Recently, an\nalternative model of the structure of the corona has been proposed, where the\nthin strand-like coronal loops observable in the EUV emission are a result of\nline-of-sight integration of warps in more complex coronal structures, referred\nto as the coronal veil model. We extend the implications of the coronal veil\nmodel of the solar corona to models of coronal oscillations. Using the\nconvection-zone-to-corona simulations with the radiation-magnetohydrodynamics\ncode Bifrost, we analysed the structure of the self-consistently formed\nsimulated corona. We focus on the spatial variability of the volumetric\nemissivity of the Fe IX 171.073 {\\AA} EUV line, and on the variability of the\nAlfv\\'en speed, which captures the density and magnetic structuring of the\nsimulated corona. We traced features associated with large magnitudes of the\nAlfv\\'en speed gradient, which are the most likely to trap MHD waves and act as\ncoronal waveguides, and looked for the correspondence with emitting regions\nwhich appear as strand-like loops in line-of-sight-integrated EUV emission. The\nwaveguide filling factors corresponding to the fraction of the waveguides\nfilled with plasma emitting in the given EUV wavelength range from 0.09 to\n0.44. This suggests that we can observe only a small fraction of the waveguide.\nSimilarly, the projected waveguide widths in the plane of the sky are several\ntimes larger than the widths of the apparent loops observable in EUV. We\nconclude that the 'coronal veil' structure is model-independent. As a result,\nwe find a lack of straightforward correspondence between a peak in the\nintegrated emission profile which constitutes an apparent coronal loop and\nregions of plasma bound by a large Alfv\\'en speed gradient acting as\nwaveguides.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}