{"id":"2408.10994","title":"Microsatellite-based real-time quantum key distribution","authors":"Yang Li, Wen-Qi Cai, Ji-Gang Ren, Chao-Ze Wang, Meng Yang, Liang\n  Zhang, Hui-Ying Wu, Liang Chang, Jin-Cai Wu, Biao Jin, Hua-Jian Xue, Xue-Jiao\n  Li, Hui Liu, Guang-Wen Yu, Xue-Ying Tao, Ting Chen, Chong-Fei Liu, Wen-Bin\n  Luo, Jie Zhou, Hai-Lin Yong, Yu-Huai Li, Feng-Zhi Li, Cong Jiang, Hao-Ze\n  Chen, Chao Wu, Xin-Hai Tong, Si-Jiang Xie, Fei Zhou, Wei-Yue Liu, Nai-Le Liu,\n  Li Li, Feihu Xu, Yuan Cao, Juan Yin, Rong Shu, Xiang-Bin Wang, Qiang Zhang,\n  Jian-Yu Wang, Sheng-Kai Liao, Cheng-Zhi Peng and Jian-Wei Pan","authorsParsed":[["Li","Yang",""],["Cai","Wen-Qi",""],["Ren","Ji-Gang",""],["Wang","Chao-Ze",""],["Yang","Meng",""],["Zhang","Liang",""],["Wu","Hui-Ying",""],["Chang","Liang",""],["Wu","Jin-Cai",""],["Jin","Biao",""],["Xue","Hua-Jian",""],["Li","Xue-Jiao",""],["Liu","Hui",""],["Yu","Guang-Wen",""],["Tao","Xue-Ying",""],["Chen","Ting",""],["Liu","Chong-Fei",""],["Luo","Wen-Bin",""],["Zhou","Jie",""],["Yong","Hai-Lin",""],["Li","Yu-Huai",""],["Li","Feng-Zhi",""],["Jiang","Cong",""],["Chen","Hao-Ze",""],["Wu","Chao",""],["Tong","Xin-Hai",""],["Xie","Si-Jiang",""],["Zhou","Fei",""],["Liu","Wei-Yue",""],["Liu","Nai-Le",""],["Li","Li",""],["Xu","Feihu",""],["Cao","Yuan",""],["Yin","Juan",""],["Shu","Rong",""],["Wang","Xiang-Bin",""],["Zhang","Qiang",""],["Wang","Jian-Yu",""],["Liao","Sheng-Kai",""],["Peng","Cheng-Zhi",""],["Pan","Jian-Wei",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 16:42:15 GMT"}],"updateDate":"2024-08-21","timestamp":1724172135000,"abstract":"  A quantum network provides an infrastructure connecting quantum devices with\nrevolutionary computing, sensing, and communication capabilities. As the\nbest-known application of a quantum network, quantum key distribution (QKD)\nshares secure keys guaranteed by the laws of quantum mechanics. A quantum\nsatellite constellation offers a solution to facilitate the quantum network on\na global scale. The Micius satellite has verified the feasibility of satellite\nquantum communications, however, scaling up quantum satellite constellations is\nchallenging, requiring small lightweight satellites, portable ground stations\nand real-time secure key exchange. Here we tackle these challenges and report\nthe development of a quantum microsatellite capable of performing\nspace-to-ground QKD using portable ground stations. The quantum microsatellite\nfeatures a payload weighing approximately 23 kg, while the portable ground\nstation weighs about 100 kg. These weights represent reductions by more than an\norder and two orders of magnitude, respectively, compared to the Micius\nsatellite. Additionally, we multiplex bidirectional satellite-ground optical\ncommunication with quantum communication, enabling key distillation and secure\ncommunication in real-time. Using the microsatellite and the portable ground\nstations, we demonstrate satellite-based QKD with multiple ground stations and\nachieve the sharing of up to 0.59 million bits of secure keys during a single\nsatellite pass. The compact quantum payload can be readily assembled on\nexisting space stations or small satellites, paving the way for a\nsatellite-constellation-based quantum and classical network for widespread\nreal-life applications.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"eailA_wLDJ9d7oEb5aouWORseSrKRCYfDnumGKOYea0","pdfSize":"7845075"}
