{"id":"2408.05680","title":"Swarm-Net: Firmware Attestation in IoT Swarms using Graph Neural\n  Networks and Volatile Memory","authors":"Varun Kohli and Bhavya Kohli and Muhammad Naveed Aman and Biplab\n  Sikdar","authorsParsed":[["Kohli","Varun",""],["Kohli","Bhavya",""],["Aman","Muhammad Naveed",""],["Sikdar","Biplab",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 03:19:29 GMT"}],"updateDate":"2024-08-13","timestamp":1723346369000,"abstract":"  The Internet of Things (IoT) is a network of billions of interconnected,\nprimarily low-end embedded devices. Despite large-scale deployment, studies\nhave highlighted critical security concerns in IoT networks, many of which stem\nfrom firmware-related issues. Furthermore, IoT swarms have become more\nprevalent in industries, smart homes, and agricultural applications, among\nothers. Malicious activity on one node in a swarm can propagate to larger\nnetwork sections. Although several Remote Attestation (RA) techniques have been\nproposed, they are limited by their latency, availability, complexity, hardware\nassumptions, and uncertain access to firmware copies under Intellectual\nProperty (IP) rights. We present Swarm-Net, a novel swarm attestation technique\nthat exploits the inherent, interconnected, graph-like structure of IoT\nnetworks along with the runtime information stored in the Static Random Access\nMemory (SRAM) using Graph Neural Networks (GNN) to detect malicious firmware\nand its downstream effects. We also present the first datasets on SRAM-based\nswarm attestation encompassing different types of firmware and edge\nrelationships. In addition, a secure swarm attestation protocol is presented.\nSwarm-Net is not only computationally lightweight but also does not require a\ncopy of the firmware. It achieves a 99.96% attestation rate on authentic\nfirmware, 100% detection rate on anomalous firmware, and 99% detection rate on\npropagated anomalies, at a communication overhead and inference latency of ~1\nsecond and ~10^{-5} seconds (on a laptop CPU), respectively. In addition to the\ncollected datasets, Swarm-Net's effectiveness is evaluated on simulated trace\nreplay, random trace perturbation, and dropped attestation responses, showing\nrobustness against such threats. Lastly, we compare Swarm-Net with past works\nand present a security analysis.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}