{"id":"2408.06090","title":"Quasi Monolithic Fiber Collimators","authors":"Jonathan Joseph Carter, Steffen B\\\"ohme, Kevin Weber, Nina Bode,\n  Karina Jorke, Anja Grobecker, Tobias Koch, Simone Fabia, and Sina Maria\n  Koehlenbeck","authorsParsed":[["Carter","Jonathan Joseph",""],["Böhme","Steffen",""],["Weber","Kevin",""],["Bode","Nina",""],["Jorke","Karina",""],["Grobecker","Anja",""],["Koch","Tobias",""],["Fabia","Simone",""],["Koehlenbeck","Sina Maria",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 12:14:53 GMT"}],"updateDate":"2024-08-13","timestamp":1723464893000,"abstract":"  Interferometric displacement measurements, especially in space interferometry\napplications, face challenges from thermal expansion. Bonded assemblies of\nultra-low thermal expansion glass-ceramics offer a solution; however,\ntransitioning from light transport in fibers to free beam propagation presents\na notable challenge. These experiments often need an interface to convert\nbetween laser beams propagating through fiber optics into a well-defined free\nbeam and vice versa. These interfaces must also be made of rigid glass pieces\nthat can be bonded to a glass base plate. Current designs for these fiber\ncollimators, often called fiber injector optical sub-assemblies, require\nmultiple glass parts fabricated to very tight tolerances and assembled with\nspecial alignment tools. We present a simplified quasi-monolithic fiber\ncollimator that can generate a well-collimated laser beam. The complexity and\ntolerances of bonding are reduced by combining the alignment of the fiber mode\nto the imaging lens in one step with active mode control: the welding of the\nfiber to the glass body. We produce several of these designs and test that the\ndesired light field is achieved, its profile is described as a Gaussian beam,\nand the beam-pointing stability is acceptable for such a piece. In each case,\nthey perform at least as well as a standard commercial fiber collimator. These\nQuasi Monolithic Fiber Collimators offer a promising and easy-to-implement\nsolution to convert between free beam and fiber-coupled lasers in experiments\nsensitive to long term thermal drifts.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/"}