{"id":"2408.08362","title":"Multiplet Supercurrents in a Josephson Circuit","authors":"Ethan G. Arnault, John Chiles, Trevyn F.Q. Larson, Chun-Chia Chen,\n  Lingfei Zhao, Kenji Watanabe, Takashi Taniguchi, Francois Amet, Gleb\n  Finkelstein","authorsParsed":[["Arnault","Ethan G.",""],["Chiles","John",""],["Larson","Trevyn F. Q.",""],["Chen","Chun-Chia",""],["Zhao","Lingfei",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Amet","Francois",""],["Finkelstein","Gleb",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 18:05:23 GMT"}],"updateDate":"2024-08-19","timestamp":1723745123000,"abstract":"  Multiterminal Josephson junctions are a promising platform to host synthetic\ntopological phases of matter and Floquet states. However, the energy scales\ngoverning topological protection in these devices are on the order of the\nspacing between Andreev bound states. Recent theories suggest that similar\nphenomena may instead be explored in circuits composed of two-terminal\nJosephson junctions, allowing for the topological protection to be controlled\nby the comparatively large Josephson energy. Here, we explore a Josephson\ncircuit, in which three superconducting electrodes are connected through\nJosephson junctions to a common superconducting island. We demonstrate the\ndynamic generation of multiplet resonances, which have previously been observed\nin multiterminal Josephson junctions. The multiplets are found to be robust to\nelevated temperatures and are confirmed by exhibiting the expected Shapiro step\nquantization under a microwave drive. We also find an unexpected novel\nsupercurrent, which couples a pair of contacts that are both voltage-biased\nwith respect to the common superconducting island. We show that this\nsupercurrent results from synchronization of the phase dynamics and pose the\nquestion whether it should also carry a topological contribution.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}