{"id":"2408.06837","title":"How Aligned are Human Chart Takeaways and LLM Predictions? A Case Study\n  on Bar Charts with Varying Layouts","authors":"Huichen Will Wang, Jane Hoffswell, Sao Myat Thazin Thane, Victor S.\n  Bursztyn, Cindy Xiong Bearfield","authorsParsed":[["Wang","Huichen Will",""],["Hoffswell","Jane",""],["Thane","Sao Myat Thazin",""],["Bursztyn","Victor S.",""],["Bearfield","Cindy Xiong",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 11:54:18 GMT"}],"updateDate":"2024-08-14","timestamp":1723550058000,"abstract":"  Large Language Models (LLMs) have been adopted for a variety of\nvisualizations tasks, but how far are we from perceptually aware LLMs that can\npredict human takeaways? Graphical perception literature has shown that human\nchart takeaways are sensitive to visualization design choices, such as spatial\nlayouts. In this work, we examine the extent to which LLMs exhibit such\nsensitivity when generating takeaways, using bar charts with varying spatial\nlayouts as a case study. We conducted three experiments and tested four common\nbar chart layouts: vertically juxtaposed, horizontally juxtaposed, overlaid,\nand stacked. In Experiment 1, we identified the optimal configurations to\ngenerate meaningful chart takeaways by testing four LLMs, two temperature\nsettings, nine chart specifications, and two prompting strategies. We found\nthat even state-of-the-art LLMs struggled to generate semantically diverse and\nfactually accurate takeaways. In Experiment 2, we used the optimal\nconfigurations to generate 30 chart takeaways each for eight visualizations\nacross four layouts and two datasets in both zero-shot and one-shot settings.\nCompared to human takeaways, we found that the takeaways LLMs generated often\ndid not match the types of comparisons made by humans. In Experiment 3, we\nexamined the effect of chart context and data on LLM takeaways. We found that\nLLMs, unlike humans, exhibited variation in takeaway comparison types for\ndifferent bar charts using the same bar layout. Overall, our case study\nevaluates the ability of LLMs to emulate human interpretations of data and\npoints to challenges and opportunities in using LLMs to predict human chart\ntakeaways.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BmUdAO3n1rIqfXGiy5IkmPz2zf10-g0dkROCrCLdV3I","pdfSize":"1203555"}
