{"id":"2408.05535","title":"Latent class analysis for multi-layer categorical data","authors":"Huan Qing","authorsParsed":[["Qing","Huan",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 12:31:31 GMT"}],"updateDate":"2024-08-13","timestamp":1723293091000,"abstract":"  Traditional categorical data, often collected in psychological tests and\neducational assessments, are typically single-layer and gathered only once.This\npaper considers a more general case, multi-layer categorical data with\npolytomous responses. To model such data, we present a novel statistical model,\nthe multi-layer latent class model (multi-layer LCM). This model assumes that\nall layers share common subjects and items. To discover subjects' latent\nclasses and other model parameters under this model, we develop three efficient\nspectral methods based on the sum of response matrices, the sum of Gram\nmatrices, and the debiased sum of Gram matrices, respectively. Within the\nframework of multi-layer LCM, we demonstrate the estimation consistency of\nthese methods under mild conditions regarding data sparsity. Our theoretical\nfindings reveal two key insights: (1) increasing the number of layers can\nenhance the performance of the proposed methods, highlighting the advantages of\nconsidering multiple layers in latent class analysis; (2) we theoretically show\nthat the algorithm based on the debiased sum of Gram matrices usually performs\nbest. Additionally, we propose an approach that combines the averaged\nmodularity metric with our methods to determine the number of latent classes.\nExtensive experiments are conducted to support our theoretical results and show\nthe powerfulness of our methods in the task of learning latent classes and\nestimating the number of latent classes in multi-layer categorical data with\npolytomous responses.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}