{"id":"2408.01814","title":"Calculation of Some Integrals over Gaussian Measure with Nuclear\n  Covariance Operator in Separable Hilbert Space","authors":"Nikita A. Ignatyuk, Anna A. Ogarkova and Stanislav L. Ogarkov","authorsParsed":[["Ignatyuk","Nikita A.",""],["Ogarkova","Anna A.",""],["Ogarkov","Stanislav L.",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 15:48:24 GMT"}],"updateDate":"2024-08-06","timestamp":1722700104000,"abstract":"  The main purpose of this paper is to construct convergent series for the\napproximate calculation of certain integrals over the Gaussian measure with a\nnuclear covariance operator, nonlocal propagator, in separable Hilbert space.\nSuch series arise, for example, in the model with the interaction Lagrangian\n$\\sinh^{2(p+1)}\\varphi$, where $p \\in \\mathbb{N}$ and $\\varphi$ is the scalar\nfield, although the problem can be solved in general form for a fairly wide\nclass of Lagrangians: an even, strictly convex, continuous, non-negative\nfunction with a single zero value for $\\varphi=0$ and for $|\\varphi|\\rightarrow\n+\\infty$ growing faster than $\\varphi^{2}$. We strictly define the scattering\nmatrix, $\\mathcal{S}$-matrix, at the zero value of the classical field,\nargument of the $\\mathcal{S}$-matrix, of such a theory in terms of the\ncorresponding integral, find the iterated expansion for the integrand (the\nGaussian measure doesn't expand) over two orthonormal bases of functions, prove\nthe validity of summation and integration interchange and thus find the\nexpansion of the $\\mathcal{S}$-matrix at the zero value of the classical field\ninto the iterated series in powers of the interaction action. The individual\nterms of the resulting series have the form of a canonical partition function\n(CPF), and the methods of statistical physics are applicable to them. In\nparticular, we express them in terms of Bell polynomials. It is important to\nnote that such iterated series cannot be reduced to the perturbation theory\n(PT) series, since in the proposed model the latter diverges as $e^{n^{2}}$,\nwhere $n \\in \\mathbb {N}$ is the PT order. Along the way, we provide detailed\nmathematical background, including Beppo Levi's monotone convergence theorem\n(MCT) and Henri Lebesgue's dominated convergence theorem (DCT), without which\nthe presented calculation would be significantly more complex.\n","subjects":["Physics/High Energy Physics - Theory","Condensed Matter/Statistical Mechanics","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pQwqPEcEdYoErzlWyrdOFTUcPxGywGXv4DepuOf-ATE","pdfSize":"544293","txDigest":"3JY8jr6YCvPHcXcvqPHnq3RveZHLdcsbkodVFbwsrLkX","endEpoch":"1","status":"CERTIFIED"}
