{"id":"2408.01530","title":"A Structured Framework for Predicting Sustainable Aviation Fuel\n  Properties using Liquid-Phase FTIR and Machine Learning","authors":"Ana E. Comesana, Sharon S. Chen, Kyle E. Niemeyer, Vi H. Rapp","authorsParsed":[["Comesana","Ana E.",""],["Chen","Sharon S.",""],["Niemeyer","Kyle E.",""],["Rapp","Vi H.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 18:43:22 GMT"}],"updateDate":"2024-08-06","timestamp":1722624202000,"abstract":"  Sustainable aviation fuels have the potential for reducing emissions and\nenvironmental impact. To help identify viable sustainable aviation fuels and\naccelerate research, several machine learning models have been developed to\npredict relevant physiochemical properties. However, many of the models have\nlimited applicability, leverage data from complex analytical techniques with\nconfined spectral ranges, or use feature decomposition methods that have\nlimited interpretability. Using liquid-phase Fourier Transform Infrared (FTIR)\nspectra, this study presents a structured method for creating accurate and\ninterpretable property prediction models for neat molecules, aviation fuels,\nand blends. Liquid-phase FTIR spectra measurements can be collected quickly and\nconsistently, offering high reliability, sensitivity, and component specificity\nusing less than 2 mL of sample. The method first decomposes FTIR spectra into\nfundamental building blocks using Non-negative Matrix Factorization (NMF) to\nenable scientific analysis of FTIR spectra attributes and fuel properties. The\nNMF features are then used to create five ensemble models for predicting final\nboiling point, flash point, freezing point, density at 15C, and kinematic\nviscosity at -20C. All models were trained using experimental property data\nfrom neat molecules, aviation fuels, and blends. The models accurately predict\nproperties while enabling interpretation of relationships between compositional\nelements of a fuel, such as functional groups or chemical classes, and its\nproperties. To support sustainable aviation fuel research and development, the\nmodels and data are available on an interactive web tool.\n","subjects":["Physics/Chemical Physics","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}