{"id":"2408.05427","title":"Detecting Masquerade Attacks in Controller Area Networks Using Graph\n  Machine Learning","authors":"William Marfo, Pablo Moriano, Deepak K. Tosh, Shirley V. Moore","authorsParsed":[["Marfo","William",""],["Moriano","Pablo",""],["Tosh","Deepak K.",""],["Moore","Shirley V.",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 04:17:58 GMT"}],"updateDate":"2024-08-13","timestamp":1723263478000,"abstract":"  Modern vehicles rely on a myriad of electronic control units (ECUs)\ninterconnected via controller area networks (CANs) for critical operations.\nDespite their ubiquitous use and reliability, CANs are susceptible to\nsophisticated cyberattacks, particularly masquerade attacks, which inject false\ndata that mimic legitimate messages at the expected frequency. These attacks\npose severe risks such as unintended acceleration, brake deactivation, and\nrogue steering. Traditional intrusion detection systems (IDS) often struggle to\ndetect these subtle intrusions due to their seamless integration into normal\ntraffic. This paper introduces a novel framework for detecting masquerade\nattacks in the CAN bus using graph machine learning (ML). We hypothesize that\nthe integration of shallow graph embeddings with time series features derived\nfrom CAN frames enhances the detection of masquerade attacks. We show that by\nrepresenting CAN bus frames as message sequence graphs (MSGs) and enriching\neach node with contextual statistical attributes from time series, we can\nenhance detection capabilities across various attack patterns compared to using\nonly graph-based features. Our method ensures a comprehensive and dynamic\nanalysis of CAN frame interactions, improving robustness and efficiency.\nExtensive experiments on the ROAD dataset validate the effectiveness of our\napproach, demonstrating statistically significant improvements in the detection\nrates of masquerade attacks compared to a baseline that uses only graph-based\nfeatures, as confirmed by Mann-Whitney U and Kolmogorov-Smirnov tests (p <\n0.05).\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}