{"id":"2408.08861","title":"The computational power of a human society: a new model of social\n  evolution","authors":"David H. Wolpert, Kyle Harper","authorsParsed":[["Wolpert","David H.",""],["Harper","Kyle",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 17:42:28 GMT"}],"updateDate":"2024-08-19","timestamp":1723830148000,"abstract":"  Social evolutionary theory seeks to explain increases in the scale and\ncomplexity of human societies, from origins to present. Over the course of the\ntwentieth century, social evolutionary theory largely fell out of favor as a\nway of investigating human history, just as advances in complex systems science\nand computer science saw the emergence of powerful new conceptions of complex\nsystems, and in particular new methods of measuring complexity. We propose that\nthese advances in our understanding of complex systems and computer science\nshould be brought to bear on our investigations into human history. To that\nend, we present a new framework for modeling how human societies co-evolve with\ntheir biotic environments, recognizing that both a society and its environment\nare computers. This leads us to model the dynamics of each of those two systems\nusing the same, new kind of computational machine, which we define here. For\nsimplicity, we construe a society as a set of interacting occupations and\ntechnologies. Similarly, under such a model, a biotic environment is a set of\ninteracting distinct ecological and climatic processes. This provides novel\nways to characterize social complexity, which we hope will cast new light on\nthe archaeological and historical records. Our framework also provides a\nnatural way to formalize both the energetic (thermodynamic) costs required by a\nsociety as it runs, and the ways it can extract thermodynamic resources from\nthe environment in order to pay for those costs -- and perhaps to grow with any\nleft-over resources.\n","subjects":["Computing Research Repository/Multiagent Systems","Economics/General Economics","Physics/Physics and Society","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}