{"id":"2408.06390","title":"Approximate ADCs for In-Memory Computing","authors":"Arkapravo Ghosh, Hemkar Reddy Sadana, Mukut Debnath, Panthadip Maji,\n  Shubham Negi, Sumeet Gupta, Mrigank Sharad, Kaushik Roy","authorsParsed":[["Ghosh","Arkapravo",""],["Sadana","Hemkar Reddy",""],["Debnath","Mukut",""],["Maji","Panthadip",""],["Negi","Shubham",""],["Gupta","Sumeet",""],["Sharad","Mrigank",""],["Roy","Kaushik",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 05:59:59 GMT"}],"updateDate":"2024-08-14","timestamp":1723355999000,"abstract":"  In memory computing (IMC) architectures for deep learning (DL) accelerators\nleverage energy-efficient and highly parallel matrix vector multiplication\n(MVM) operations, implemented directly in memory arrays. Such IMC designs have\nbeen explored based on CMOS as well as emerging non-volatile memory (NVM)\ntechnologies like RRAM. IMC architectures generally involve a large number of\ncores consisting of memory arrays, storing the trained weights of the DL model.\nPeripheral units like DACs and ADCs are also used for applying inputs and\nreading out the output values. Recently reported designs reveal that the ADCs\nrequired for reading out the MVM results, consume more than 85% of the total\ncompute power and also dominate the area, thereby eschewing the benefits of the\nIMC scheme. Mitigation of imperfections in the ADCs, namely, non-linearity and\nvariations, incur significant design overheads, due to dedicated calibration\nunits. In this work we present peripheral aware design of IMC cores, to\nmitigate such overheads. It involves incorporating the non-idealities of ADCs\nin the training of the DL models, along with that of the memory units. The\nproposed approach applies equally well to both current mode as well as charge\nmode MVM operations demonstrated in recent years., and can significantly\nsimplify the design of mixed-signal IMC units.\n","subjects":["Computing Research Repository/Emerging Technologies","Computing Research Repository/Hardware Architecture","Computing Research Repository/Machine Learning","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"fWXvysSsOzXHtgDgTw9uP3A1P0m9mFymtlg_Ox7vIPM","pdfSize":"2090448"}
