{"id":"2408.13091","title":"Analysis of child development facts and myths using text mining\n  techniques and classification models","authors":"Mehedi Tajrian, Azizur Rahman, Muhammad Ashad Kabir, Md Rafiqul Islam","authorsParsed":[["Tajrian","Mehedi",""],["Rahman","Azizur",""],["Kabir","Muhammad Ashad",""],["Islam","Md Rafiqul",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 14:16:54 GMT"}],"updateDate":"2024-08-26","timestamp":1724422614000,"abstract":"  The rapid dissemination of misinformation on the internet complicates the\ndecision-making process for individuals seeking reliable information,\nparticularly parents researching child development topics. This misinformation\ncan lead to adverse consequences, such as inappropriate treatment of children\nbased on myths. While previous research has utilized text-mining techniques to\npredict child abuse cases, there has been a gap in the analysis of child\ndevelopment myths and facts. This study addresses this gap by applying text\nmining techniques and classification models to distinguish between myths and\nfacts about child development, leveraging newly gathered data from publicly\navailable websites. The research methodology involved several stages. First,\ntext mining techniques were employed to pre-process the data, ensuring enhanced\naccuracy. Subsequently, the structured data was analysed using six robust\nMachine Learning (ML) classifiers and one Deep Learning (DL) model, with two\nfeature extraction techniques applied to assess their performance across three\ndifferent training-testing splits. To ensure the reliability of the results,\ncross-validation was performed using both k-fold and leave-one-out methods.\nAmong the classification models tested, Logistic Regression (LR) demonstrated\nthe highest accuracy, achieving a 90% accuracy with the Bag-of-Words (BoW)\nfeature extraction technique. LR stands out for its exceptional speed and\nefficiency, maintaining low testing time per statement (0.97 microseconds).\nThese findings suggest that LR, when combined with BoW, is effective in\naccurately classifying child development information, thus providing a valuable\ntool for combating misinformation and assisting parents in making informed\ndecisions.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yfZ_-fQ-f97f9DHier-37c_tTg-xvfMcSQaoWdexZ-o","pdfSize":"858931"}
