{"id":"2408.03207","title":"Relationship between the shear modulus and volume relaxation in\n  high-entropy metallic glasses: experiment and physical origin","authors":"R.S. Khmyrov, A.S. Makarov, J.C. Qiao, N.P. Kobelev, V.A. Khonik","authorsParsed":[["Khmyrov","R. S.",""],["Makarov","A. S.",""],["Qiao","J. C.",""],["Kobelev","N. P.",""],["Khonik","V. A.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 14:06:34 GMT"}],"updateDate":"2024-08-07","timestamp":1722953194000,"abstract":"  We performed parallel measurements of the high-frequency shear modulus $G$\nand relative volume $\\Delta V/V$ for high-entropy\nTi$_{20}$Zr$_{20}$Hf$_{20}$Be$_{20}$Cu$_{20}$ and\nTi$_{20}$Zr$_{20}$Hf$_{20}$Be$_{20}$Ni$_{20}$ glasses upon heating from room\ntemperature up to the complete crystallization. The changes of these properties\ndue to structural relaxation both below and above the glass transition\ntemperature are singled out. It is shown that these changes for both initial\nand preannealed samples can be well described within the framework of the\nInterstitialcy theory. It is found that the whole relaxation process in the\nfull temperature range of the experiments for both samples' states can be\ncharacterized by a single dimensionless temperature-independent parameter\n$K_i=dln\\;G/dln\\;V$, which equals to -44 and -53 for the above glasses,\nrespectively, and strongly points at interstitial-type defects as a source of\nrelaxation. We also show that the relaxation of the relative volume linearly\ndepends on the defect concentration. This behavior can be described by another\ndimensionless temperature-independent parameter, which is related with the\nrelaxation volume of defects. Possible contribution of vacancy-like defects\ninto the relaxation is discussed.\n","subjects":["Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qusAcgInBEdM3b3BvLevDoSg3_NdMXnmiXZ9Ee4CZqo","pdfSize":"432175"}
