{"id":"2408.15789","title":"A Stochastic Robust Adaptive Systems Level Approach to Stabilizing\n  Large-Scale Uncertain Markovian Jump Linear Systems","authors":"SooJean Han, Minwoo M. Kim, Ieun Choo","authorsParsed":[["Han","SooJean",""],["Kim","Minwoo M.",""],["Choo","Ieun",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 13:32:40 GMT"}],"updateDate":"2024-08-29","timestamp":1724851960000,"abstract":"  We propose a unified framework for robustly and adaptively stabilizing\nlarge-scale networked uncertain Markovian jump linear systems (MJLS) under\nexternal disturbances and mode switches that can change the network's topology.\nAdaptation is achieved by using minimal information on the disturbance to\nidentify modes that are consistent with observable data. Robust control is\nachieved by extending the system level synthesis (SLS) approach, which allows\nus to pose the problem of simultaneously stabilizing multiple plants as a\ntwo-step convex optimization procedure. Our control pipeline computes a\nlikelihood distribution of the system's current mode, uses them as\nprobabilistic weights during simultaneous stabilization, then updates the\nlikelihood via Bayesian inference. Because of this \"softer\" probabilistic\napproach to robust stabilization, our control pipeline does not suffer from\nabrupt destabilization issues due to changes in the system's true mode, which\nwere observed in a previous method. Separability of SLS also lets us compute\nlocalized robust controllers for each subsystem, allowing for network\nscalability; we use several information consensus methods so that mode\nestimation can also be done locally. We apply our algorithms to\ndisturbance-rejection on two sample dynamic power grid networks, a small-scale\nsystem with 7 nodes and a large-scale grid of 25 nodes.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}