{"id":"2408.00062","title":"Modelling the multi-wavelength detection of protoclusters. I: An excess\n  of submillimetre galaxies in protocluster cores","authors":"Pablo Araya-Araya, Rachel K. Cochrane, Christopher C. Hayward, Robert\n  M. Yates, Laerte Sodr\\'e Jr., Marcelo C. Vicentin, Douglas Rennehan, Roderik\n  Overzier, and Marcel van Daalen","authorsParsed":[["Araya-Araya","Pablo",""],["Cochrane","Rachel K.",""],["Hayward","Christopher C.",""],["Yates","Robert M.",""],["Sodré","Laerte","Jr."],["Vicentin","Marcelo C.",""],["Rennehan","Douglas",""],["Overzier","Roderik",""],["van Daalen","Marcel",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-08-02","timestamp":1722448800000,"abstract":"  Studies of galaxy protoclusters yield insights into galaxy cluster formation\ncomplementary to those obtained via `archaeological' studies of present-day\ngalaxy clusters. Submillimetre-selected galaxies (SMGs) are one class of\nsources used to find high-redshift protoclusters. However, due to the rarity of\nprotoclusters (and thus the large simulation volume required) and the\ncomplexity of modeling dust emission from galaxies, the relationship between\nSMGs and protoclusters has not been adequately addressed in the theoretical\nliterature. In this work, we apply the L-GALAXIES semi-analytic model (SAM) to\nthe Millennium N-body simulation. We assign submillimetre (submm) flux\ndensities to the model galaxies using a scaling relation from previous work, in\nwhich dust radiative transfer was performed on high-resolution galaxy zoom\nsimulations. We find that the fraction of model galaxies that are submm-bright\nis higher in protocluster cores than in both protocluster `outskirts' and the\nfield; the fractions for the latter two are similar. This excess is not driven\nby an enhanced starburst frequency. Instead, the primary reason is that\noverdense environments have a relative overdensity of high-mass halos and thus\n`oversample' the high-mass end of the star formation main sequence relative to\nless-dense environments. The fraction of SMGs that are optically bright is\ndependent on stellar mass and redshift but independent of environment. The\nfraction of galaxies for which the majority of star formation is dust-obscured\nis higher in protocluster cores, primarily due to the dust-obscured fraction\nbeing correlated with stellar mass. Our results can be used to guide and\ninterpret multi-wavelength studies of galaxy populations in protoclusters.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}