{"id":"2408.06049","title":"Hardware Architecture Design of Model-Based Image Reconstruction Towards\n  Palm-size Photoacoustic Tomography","authors":"Yuwei Zheng, Zijian Gao, Yuting Shen, Jiadong Zhang, Daohuai Jiang,\n  Fengyu Liu, Feng Gao, and Fei Gao","authorsParsed":[["Zheng","Yuwei",""],["Gao","Zijian",""],["Shen","Yuting",""],["Zhang","Jiadong",""],["Jiang","Daohuai",""],["Liu","Fengyu",""],["Gao","Feng",""],["Gao","Fei",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 10:51:17 GMT"}],"updateDate":"2024-08-13","timestamp":1723459877000,"abstract":"  Photoacoustic (PA) imaging technology combines the advantages of optical\nimaging and ultrasound imaging, showing great potential in biomedical\napplications. Many preclinical studies and clinical applications urgently\nrequire fast, high-quality, low-cost and portable imaging system. Translating\nadvanced image reconstruction algorithms into hardware implementations is\nhighly desired. However, existing iterative PA image reconstructions, although\nexhibit higher accuracy than delay-and-sum algorithm, suffer from high\ncomputational cost. In this paper, we introduce a model-based hardware\nacceleration architecture based on superposed Wave (s-Wave) for palm-size PA\ntomography (palm-PAT), aiming at enhancing both the speed and performance of\nimage reconstruction at a much lower system cost. To achieve this, we propose\nan innovative data reuse method that significantly reduces hardware storage\nresource consumption. We conducted experiments by FPGA implementation of the\nalgorithm, using both phantoms and in vivo human finger data to verify the\nfeasibility of the proposed method. The results demonstrate that our proposed\narchitecture can substantially reduce system cost while maintaining high\nimaging performance. The hardware-accelerated implementation of the model-based\nalgorithm achieves a speedup of up to approximately 270 times compared to the\nCPU, while the corresponding energy efficiency ratio is improved by more than\n2700 times.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}