{"id":"2408.05937","title":"The impact of the FREDDA dedispersion algorithm on $H_0$ estimations\n  with FRBs","authors":"Jordan Hoffmann, Clancy W. James, Hao Qiu, Marcin Glowacki, Keith W.\n  Bannister, Vivek Gupta, Jason X. Prochaska, Apurba Bera, Adam T. Deller,\n  Kelly Gourdji, Lachlan Marnoch, Stuart D. Ryder, Danica R. Scott, Ryan M.\n  Shannon and Nicolas Tejos","authorsParsed":[["Hoffmann","Jordan",""],["James","Clancy W.",""],["Qiu","Hao",""],["Glowacki","Marcin",""],["Bannister","Keith W.",""],["Gupta","Vivek",""],["Prochaska","Jason X.",""],["Bera","Apurba",""],["Deller","Adam T.",""],["Gourdji","Kelly",""],["Marnoch","Lachlan",""],["Ryder","Stuart D.",""],["Scott","Danica R.",""],["Shannon","Ryan M.",""],["Tejos","Nicolas",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 06:24:56 GMT"}],"updateDate":"2024-08-13","timestamp":1723443896000,"abstract":"  Fast radio bursts (FRBs) are transient radio signals of extragalactic origins\nthat are subjected to propagation effects such as dispersion and scattering. It\nfollows then that these signals hold information regarding the medium they have\ntraversed and are hence useful as cosmological probes of the Universe.\nRecently, FRBs were used to make an independent measure of the Hubble Constant\n$H_0$, promising to resolve the Hubble tension given a sufficient number of\ndetected FRBs. Such cosmological studies are dependent on FRB population\nstatistics, cosmological parameters and detection biases, and thus it is\nimportant to accurately characterise each of these. In this work, we\nempirically characterise the sensitivity of the Fast Real-time Engine for\nDedispersing Amplitudes (FREDDA) which is the current detection system for the\nAustralian Square Kilometer Array Pathfinder (ASKAP). We coherently redisperse\nhigh-time resolution data of 13 ASKAP-detected FRBs and inject them into FREDDA\nto determine the recovered signal-to-noise ratios as a function of dispersion\nmeasure (DM). We find that for 11 of the 13 FRBs, these results are consistent\nwith injecting idealised pulses. Approximating this sensitivity function with\ntheoretical predictions results in a systematic error of\n0.3$\\,$km$\\,$s$^{-1}\\,$Mpc$^{-1}$ on $H_0$ when it is the only free parameter.\nAllowing additional parameters to vary could increase this systematic by up to\n$\\sim1\\,$km$\\,$s$^{-1}\\,$Mpc$^{-1}$. We estimate that this systematic will not\nbe relevant until $\\sim$400 localised FRBs have been detected, but will likely\nbe significant in resolving the Hubble tension.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}