{"id":"2408.04027","title":"Multiple Notch ligands in the synchronization of the segmentation clock","authors":"Marcos Wappner, Koichiro Uriu, Andrew C. Oates and Luis G. Morelli","authorsParsed":[["Wappner","Marcos",""],["Uriu","Koichiro",""],["Oates","Andrew C.",""],["Morelli","Luis G.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 18:19:59 GMT"}],"updateDate":"2024-08-09","timestamp":1723054799000,"abstract":"  Notch signaling is a ubiquitous and versatile intercellular signaling system\nthat drives collective behaviors and pattern formation in biological tissues.\nDuring embryonic development, Notch is involved in generation of collective\nbiochemical oscillations that form the vertebrate body segments, and its\nfailure results in embryonic defects. Notch ligands of the Delta family are key\ncomponents of this collective rhythm, but it is unclear how different Delta\nligands with distinct properties contribute to relaying information among\ncells. Motivated by the zebrafish segmentation clock, in this work we propose a\ntheory describing interactions between biochemical oscillators, where Notch\nreceptor is bound by both oscillatory and nonoscillatory Delta ligands. Based\non previous in vitro binding studies, we first consider Notch activation by\nDelta dimers. This hypothesis is consistent with experimental observations in\nconditions of perturbed Notch signaling. Then we test an alternative hypothesis\nwhere Delta monomers directly bind and activate Notch, and show that this\nsecond model can also describe the experimental observations. We show that\nthese two hypotheses assign different roles for a non-oscillatory ligand, as a\nbinding partner or as a baseline signal. Finally, we discuss experiments to\ndistinguish between the two scenarios. Broadly, this work highlights how a\nmultiplicity of ligands may be harnessed by a signaling system to generate\nversatile responses.\n","subjects":["Quantitative Biology/Molecular Networks"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"HZcNFc54fuiq_IyR_fVwARtCFI1jJUpGW88mPbbGoTA","pdfSize":"4005903"}
