{"id":"2408.10943","title":"SysBench: Can Large Language Models Follow System Messages?","authors":"Yanzhao Qin, Tao Zhang, Tao Zhang, Yanjun Shen, Wenjing Luo, Haoze\n  Sun, Yan Zhang, Yujing Qiao, Weipeng Chen, Zenan Zhou, Wentao Zhang, Bin Cui","authorsParsed":[["Qin","Yanzhao",""],["Zhang","Tao",""],["Zhang","Tao",""],["Shen","Yanjun",""],["Luo","Wenjing",""],["Sun","Haoze",""],["Zhang","Yan",""],["Qiao","Yujing",""],["Chen","Weipeng",""],["Zhou","Zenan",""],["Zhang","Wentao",""],["Cui","Bin",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 15:33:16 GMT"}],"updateDate":"2024-08-21","timestamp":1724167996000,"abstract":"  Large Language Models (LLMs) have become instrumental across various\napplications, with the customization of these models to specific scenarios\nbecoming increasingly critical. System message, a fundamental component of\nLLMs, is consist of carefully crafted instructions that guide the behavior of\nmodel to meet intended goals. Despite the recognized potential of system\nmessages to optimize AI-driven solutions, there is a notable absence of a\ncomprehensive benchmark for evaluating how well different LLMs follow these\nsystem messages. To fill this gap, we introduce SysBench, a benchmark that\nsystematically analyzes system message following ability in terms of three\nchallenging aspects: constraint complexity, instruction misalignment and\nmulti-turn stability. In order to enable effective evaluation, SysBench\nconstructs multi-turn user conversations covering various interaction\nrelationships, based on six common types of constraints from system messages in\nreal-world scenarios. Our dataset contains 500 system messages from various\ndomains, each paired with 5 turns of user conversations, which have been\nmanually formulated and checked to guarantee high quality. SysBench provides\nextensive evaluation across various LLMs, measuring their ability to follow\nspecified constraints given in system messages. The results highlight both the\nstrengths and weaknesses of existing models, offering key insights and\ndirections for future research. The open source library SysBench is available\nat https://github.com/PKU-Baichuan-MLSystemLab/SysBench.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}