{"id":"2408.06097","title":"Mode identification and ensemble asteroseismology of 164 \\beta Cep stars\n  discovered from Gaia light curves and monitored by TESS","authors":"D. J. Fritzewski, M. Vanrespaille, C. Aerts, D. Hey, J. De Ridder","authorsParsed":[["Fritzewski","D. J.",""],["Vanrespaille","M.",""],["Aerts","C.",""],["Hey","D.",""],["De Ridder","J.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 12:29:52 GMT"}],"updateDate":"2024-08-13","timestamp":1723465792000,"abstract":"  The Gaia mission discovered many new candidate \\beta Cephei (\\beta Cep)\npulsators, which are meanwhile confirmed from TESS space photometry. We aim to\nanalyse all currently available TESS data for these \\beta Cep pulsators, of\nwhich 145 were new discoveries, in order to exploit their asteroseismic\npotential. \\beta Cep stars belong to an under-represented class of pulsators in\nthe current space photometry revolution while being of critical importance to\nimprove evolution models of massive stars. We extracted light curves for 216\nstar from the TESS full-frame images and performed pre-whitening. Based on Gaia\nDR3, we deduced stellar properties and compared them to those of known \\beta\nCep stars. We developed a methodology to identify the dominant pulsation modes\nof the \\beta Cep stars from Gaia and TESS amplitude ratios and from the\ndetection of rotationally-split multiplets. We used grid modelling to gain\ninsights into the population of \\beta Cep stars. With the combination of TESS\nand Gaia, we successfully identified the mode degrees for 176 stars. of which\nthe majority are dipole non-radial modes. Many non-radial modes show splittings\nin their TESS frequency spectra allowing us to assemble a large set of split\nmultiplets in \\beta Cep stars and to calculate their envelope rotation, spin\nparameter, and the level of differential envelope-to-surface rotation. For the\nlatter, we find an upper limit of 4, with most stars rotating almost rigidly.\nWe also provide the asymmetries of the multiplets. Based on grid modelling, we\nprovide mass, convective core mass, and ages for 164 stars. By combining Gaia\nand TESS, we enable asteroseismology of \\beta Cep stars as a population. Our\nstudy prepares for future detailed modelling based on individual frequencies of\nidentified modes leading towards a better understanding of these massive\npulsators, as crucial probes of stellar evolution theory. (abridged)\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}