{"id":"2408.08272","title":"Is Knowledge Power? On the (Im)possibility of Learning from Strategic\n  Interaction","authors":"Nivasini Ananthakrishnan, Nika Haghtalab, Chara Podimata, Kunhe Yang","authorsParsed":[["Ananthakrishnan","Nivasini",""],["Haghtalab","Nika",""],["Podimata","Chara",""],["Yang","Kunhe",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 17:17:56 GMT"}],"updateDate":"2024-08-16","timestamp":1723742276000,"abstract":"  When learning in strategic environments, a key question is whether agents can\novercome uncertainty about their preferences to achieve outcomes they could\nhave achieved absent any uncertainty. Can they do this solely through\ninteractions with each other? We focus this question on the ability of agents\nto attain the value of their Stackelberg optimal strategy and study the impact\nof information asymmetry. We study repeated interactions in fully strategic\nenvironments where players' actions are decided based on learning algorithms\nthat take into account their observed histories and knowledge of the game. We\nstudy the pure Nash equilibria (PNE) of a meta-game where players choose these\nalgorithms as their actions. We demonstrate that if one player has perfect\nknowledge about the game, then any initial informational gap persists. That is,\nwhile there is always a PNE in which the informed agent achieves her\nStackelberg value, there is a game where no PNE of the meta-game allows the\npartially informed player to achieve her Stackelberg value. On the other hand,\nif both players start with some uncertainty about the game, the quality of\ninformation alone does not determine which agent can achieve her Stackelberg\nvalue. In this case, the concept of information asymmetry becomes nuanced and\ndepends on the game's structure. Overall, our findings suggest that repeated\nstrategic interactions alone cannot facilitate learning effectively enough to\nearn an uninformed player her Stackelberg value.\n","subjects":["Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}