{"id":"2408.14493","title":"Extraction of Typical Operating Scenarios of New Power System Based on\n  Deep Time Series Aggregation","authors":"Zhaoyang Qu, Zhenming Zhang, Nan Qu, Yuguang Zhou, Yang Li, Tao Jiang,\n  Min Li, Chao Long","authorsParsed":[["Qu","Zhaoyang",""],["Zhang","Zhenming",""],["Qu","Nan",""],["Zhou","Yuguang",""],["Li","Yang",""],["Jiang","Tao",""],["Li","Min",""],["Long","Chao",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 08:39:25 GMT"}],"updateDate":"2024-08-28","timestamp":1724402365000,"abstract":"  Extracting typical operational scenarios is essential for making flexible\ndecisions in the dispatch of a new power system. This study proposed a novel\ndeep time series aggregation scheme (DTSAs) to generate typical operational\nscenarios, considering the large amount of historical operational snapshot\ndata. Specifically, DTSAs analyze the intrinsic mechanisms of different\nscheduling operational scenario switching to mathematically represent typical\noperational scenarios. A gramian angular summation field (GASF) based\noperational scenario image encoder was designed to convert operational scenario\nsequences into high-dimensional spaces. This enables DTSAs to fully capture the\nspatiotemporal characteristics of new power systems using deep feature\niterative aggregation models. The encoder also facilitates the generation of\ntypical operational scenarios that conform to historical data distributions\nwhile ensuring the integrity of grid operational snapshots. Case studies\ndemonstrate that the proposed method extracted new fine-grained power system\ndispatch schemes and outperformed the latest high-dimensional featurescreening\nmethods. In addition, experiments with different new energy access ratios were\nconducted to verify the robustness of the proposed method. DTSAs enables\ndispatchers to master the operation experience of the power system in advance,\nand actively respond to the dynamic changes of the operation scenarios under\nthe high access rate of new energy.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}