{"id":"2408.12434","title":"BKL bounces outside homogeneity: Einstein-Maxwell-scalar field in\n  surface symmetry","authors":"Warren Li","authorsParsed":[["Li","Warren",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 14:32:41 GMT"}],"updateDate":"2024-08-23","timestamp":1724337161000,"abstract":"  We study the phenomenon of bounces, as predicted by Belinski, Khalatnikov and\nLifshitz (BKL) in the study of singularities arising from Einstein's equations,\nas an instability mechanism within the setting of the (inhomogeneous)\nEinstein-Maxwell-scalar field system in surface symmetry. This article can be\nviewed as a companion to our other article \"BKL bounces outside homogeneity:\nGowdy symmetric spacetimes\" [27], where we study bounces for the Einstein\nvacuum equations in Gowdy symmetry. That is, we show many features of such\nbounces generalize to the matter model described, albeit in a different\nsymmetry class. The articles may be read independently.\n  In analogy to [27], we describe a wide class of inhomogeneous initial data\nwhich permit formation of a spacelike singularity, but such that the dynamics\ntowards different spatial points at the singularity are well-described by\nindependent nonlinear ODEs reminiscent of BKL bounces. A major ingredient is\nthe proof of so-called Asymptotically Velocity Term Dominated behaviour even in\nthe presence of such bounces, though one difference from [27] is that our model\ndoes not permit the existence of so-called \"spikes\".\n  One particular application is the study of (past) instability of certain\ngeneralized Kasner spacetimes with no electromagnetic field present.\nPerturbations of such spacetimes are such that the singularity persists, but\nfor perturbations with electromagnetism turned on the intermediate dynamics -\nbetween data and the singularity - features up to one BKL-like bounce. This is\nin analogy with the instability of polarized Gowdy spacetimes due to\nnon-polarized perturbations in [27].\n","subjects":["Physics/General Relativity and Quantum Cosmology","Mathematics/Analysis of PDEs"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VIPkWKOh91dkpqy9SSn5xS5Jgi50Qe4OxR0VysGsA3c","pdfSize":"755913"}
