{"id":"2408.00853","title":"Real-time Dexterous Telemanipulation with an End-Effect-Oriented\n  Learning-based Approach","authors":"Haoyang Wang, He Bai, Xiaoli Zhang, Yunsik Jung, Michel Bowman,\n  Lingfeng Tao","authorsParsed":[["Wang","Haoyang",""],["Bai","He",""],["Zhang","Xiaoli",""],["Jung","Yunsik",""],["Bowman","Michel",""],["Tao","Lingfeng",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 18:07:13 GMT"}],"updateDate":"2024-08-05","timestamp":1722535633000,"abstract":"  Dexterous telemanipulation is crucial in advancing human-robot systems,\nespecially in tasks requiring precise and safe manipulation. However, it faces\nsignificant challenges due to the physical differences between human and\nrobotic hands, the dynamic interaction with objects, and the indirect control\nand perception of the remote environment. Current approaches predominantly\nfocus on mapping the human hand onto robotic counterparts to replicate motions,\nwhich exhibits a critical oversight: it often neglects the physical interaction\nwith objects and relegates the interaction burden to the human to adapt and\nmake laborious adjustments in response to the indirect and counter-intuitive\nobservation of the remote environment. This work develops an\nEnd-Effects-Oriented Learning-based Dexterous Telemanipulation (EFOLD)\nframework to address telemanipulation tasks. EFOLD models telemanipulation as a\nMarkov Game, introducing multiple end-effect features to interpret the human\noperator's commands during interaction with objects. These features are used by\na Deep Reinforcement Learning policy to control the robot and reproduce such\nend effects. EFOLD was evaluated with real human subjects and two end-effect\nextraction methods for controlling a virtual Shadow Robot Hand in\ntelemanipulation tasks. EFOLD achieved real-time control capability with low\ncommand following latency (delay<0.11s) and highly accurate tracking (MSE<0.084\nrad).\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}