{"id":"2408.10531","title":"Leveraging Temporal Contexts to Enhance Vehicle-Infrastructure\n  Cooperative Perception","authors":"Jiaru Zhong, Haibao Yu, Tianyi Zhu, Jiahui Xu, Wenxian Yang, Zaiqing\n  Nie, Chao Sun","authorsParsed":[["Zhong","Jiaru",""],["Yu","Haibao",""],["Zhu","Tianyi",""],["Xu","Jiahui",""],["Yang","Wenxian",""],["Nie","Zaiqing",""],["Sun","Chao",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 04:16:13 GMT"}],"updateDate":"2024-08-21","timestamp":1724127373000,"abstract":"  Infrastructure sensors installed at elevated positions offer a broader\nperception range and encounter fewer occlusions. Integrating both\ninfrastructure and ego-vehicle data through V2X communication, known as\nvehicle-infrastructure cooperation, has shown considerable advantages in\nenhancing perception capabilities and addressing corner cases encountered in\nsingle-vehicle autonomous driving. However, cooperative perception still faces\nnumerous challenges, including limited communication bandwidth and practical\ncommunication interruptions. In this paper, we propose CTCE, a novel framework\nfor cooperative 3D object detection. This framework transmits queries with\ntemporal contexts enhancement, effectively balancing transmission efficiency\nand performance to accommodate real-world communication conditions.\nAdditionally, we propose a temporal-guided fusion module to further improve\nperformance. The roadside temporal enhancement and vehicle-side\nspatial-temporal fusion together constitute a multi-level temporal contexts\nintegration mechanism, fully leveraging temporal information to enhance\nperformance. Furthermore, a motion-aware reconstruction module is introduced to\nrecover lost roadside queries due to communication interruptions. Experimental\nresults on V2X-Seq and V2X-Sim datasets demonstrate that CTCE outperforms the\nbaseline QUEST, achieving improvements of 3.8% and 1.3% in mAP, respectively.\nExperiments under communication interruption conditions validate CTCE's\nrobustness to communication interruptions.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}