{"id":"2408.11227","title":"OCTCube: A 3D foundation model for optical coherence tomography that\n  improves cross-dataset, cross-disease, cross-device and cross-modality\n  analysis","authors":"Zixuan Liu, Hanwen Xu, Addie Woicik, Linda G. Shapiro, Marian Blazes,\n  Yue Wu, Cecilia S. Lee, Aaron Y. Lee, Sheng Wang","authorsParsed":[["Liu","Zixuan",""],["Xu","Hanwen",""],["Woicik","Addie",""],["Shapiro","Linda G.",""],["Blazes","Marian",""],["Wu","Yue",""],["Lee","Cecilia S.",""],["Lee","Aaron Y.",""],["Wang","Sheng",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 22:55:19 GMT"}],"updateDate":"2024-08-22","timestamp":1724194519000,"abstract":"  Optical coherence tomography (OCT) has become critical for diagnosing retinal\ndiseases as it enables 3D images of the retina and optic nerve. OCT acquisition\nis fast, non-invasive, affordable, and scalable. Due to its broad\napplicability, massive numbers of OCT images have been accumulated in routine\nexams, making it possible to train large-scale foundation models that can\ngeneralize to various diagnostic tasks using OCT images. Nevertheless, existing\nfoundation models for OCT only consider 2D image slices, overlooking the rich\n3D structure. Here, we present OCTCube, a 3D foundation model pre-trained on\n26,605 3D OCT volumes encompassing 1.62 million 2D OCT images. OCTCube is\ndeveloped based on 3D masked autoencoders and exploits FlashAttention to reduce\nthe larger GPU memory usage caused by modeling 3D volumes. OCTCube outperforms\n2D models when predicting 8 retinal diseases in both inductive and\ncross-dataset settings, indicating that utilizing the 3D structure in the model\ninstead of 2D data results in significant improvement. OCTCube further shows\nsuperior performance on cross-device prediction and when predicting systemic\ndiseases, such as diabetes and hypertension, further demonstrating its strong\ngeneralizability. Finally, we propose a\ncontrastive-self-supervised-learning-based OCT-IR pre-training framework (COIP)\nfor cross-modality analysis on OCT and infrared retinal (IR) images, where the\nOCT volumes are embedded using OCTCube. We demonstrate that COIP enables\naccurate alignment between OCT and IR en face images. Collectively, OCTCube, a\n3D OCT foundation model, demonstrates significantly better performance against\n2D models on 27 out of 29 tasks and comparable performance on the other two\ntasks, paving the way for AI-based retinal disease diagnosis.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}