{"id":"2408.10990","title":"Commutator technique for the heat kernel of minimal higher derivative\n  operators","authors":"Andrei O. Barvinsky, Alexander V. Kurov and W. Wachowski","authorsParsed":[["Barvinsky","Andrei O.",""],["Kurov","Alexander V.",""],["Wachowski","W.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 16:35:12 GMT"}],"updateDate":"2024-08-21","timestamp":1724171712000,"abstract":"  We suggest a new technique of the asymptotic heat kernel expansion for\nminimal higher derivative operators of a generic $2M$-th order,\n$F(\\nabla)=(-\\Box)^M+\\cdots$, in the background field formalism of gauge\ntheories and quantum gravity. This technique represents the conversion of the\nrecently suggested Fourier integral method of generalized exponential functions\n[Phys. Rev. D105, 065013 (2022), arXiv:2112.03062] into the commutator algebra\nof special differential operators, which allows one to express expansion\ncoefficients for $F(\\nabla)$ in terms of the Schwinger-DeWitt coefficients of a\nminimal second order operator $H(\\nabla)$. This procedure is based on special\nfunctorial properties of the formalism including the Mellin-Barnes\nrepresentation of the complex operator power $H^M(\\nabla)$ and naturally leads\nto the origin of generalized exponential functions without directly appealing\nto the Fourier integral method. The algorithm is essentially more\nstraightforward than the Fourier method and consists of three steps ready for\ncomputer codification by symbolic manipulation programs. They begin with the\ndecomposition of the operator into a power of some minimal second order\noperator $H(\\nabla)$ and its lower derivative \"perturbation part\" $W(\\nabla)$,\n$F(\\nabla)=H^M(\\nabla)+W(\\nabla)$, followed by considering their multiple\nnested commutators. The second step is the construction of special local\ndifferential operators -- the perturbation theory in powers of the lower\nderivative part $W(\\nabla)$. The final step is the so-called procedure of their\n{\\em syngification} consisting in a special modification of the covariant\nderivative monomials in these operators by Synge world function $\\sigma(x,x')$\nwith their subsequent action on the HaMiDeW coefficients of $H(\\nabla)$.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}