{"id":"2408.14156","title":"Integrated Sensing, Communication, and Powering over Multi-antenna OFDM\n  Systems","authors":"Yilong Chen, Chao Hu, Zixiang Ren, Han Hu, Jie Xu, Lexi Xu, Lei Liu,\n  and Shuguang Cui","authorsParsed":[["Chen","Yilong",""],["Hu","Chao",""],["Ren","Zixiang",""],["Hu","Han",""],["Xu","Jie",""],["Xu","Lexi",""],["Liu","Lei",""],["Cui","Shuguang",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 10:03:26 GMT"}],"updateDate":"2024-08-27","timestamp":1724666606000,"abstract":"  This paper considers a multi-functional orthogonal frequency division\nmultiplexing (OFDM) system with integrated sensing, communication, and powering\n(ISCAP), in which a multi-antenna base station (BS) transmits OFDM signals to\nsimultaneously deliver information to multiple information receivers (IRs),\nprovide energy supply to multiple energy receivers (ERs), and sense potential\ntargets based on the echo signals. To facilitate ISCAP, the BS employs the\njoint transmit beamforming design by sending dedicated sensing/energy beams\njointly with information beams. Furthermore, we consider the beam scanning for\nsensing, in which the joint beams scan in different directions over time to\nsense potential targets. In order to ensure the sensing beam scanning\nperformance and meet the communication and powering requirements, it is\nessential to properly schedule IRs and ERs and design the resource allocation\nover time, frequency, and space. More specifically, we optimize the joint\ntransmit beamforming over multiple OFDM symbols and subcarriers, with the\nobjective of minimizing the average beampattern matching error of beam scanning\nfor sensing, subject to the constraints on the average communication rates at\nIRs and the average harvested power at ERs. We find converged high-quality\nsolutions to the formulated problem by proposing efficient iterative algorithms\nbased on advanced optimization techniques. We also develop various heuristic\ndesigns based on the principles of zero-forcing (ZF) beamforming, round-robin\nuser scheduling, and time switching, respectively. Numerical results show that\nour proposed algorithms adaptively generate information and sensing/energy\nbeams at each time-frequency slot to match the scheduled IRs/ERs with the\ndesired scanning beam, significantly outperforming the heuristic designs.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}