{"id":"2408.11572","title":"Powerful explosions from the collapse of rotating supermassive stars","authors":"Sho Fujibayashi, C\\'edric Jockel, Kyohei Kawaguchi, Yuichiro\n  Sekiguchi, Masaru Shibata","authorsParsed":[["Fujibayashi","Sho",""],["Jockel","Cédric",""],["Kawaguchi","Kyohei",""],["Sekiguchi","Yuichiro",""],["Shibata","Masaru",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 12:28:53 GMT"}],"updateDate":"2024-08-22","timestamp":1724243333000,"abstract":"  We perform new general relativistic hydrodynamics simulations for collapses\nof rotating supermassive star cores with an approximate nuclear burning up to\ncarbon and a detailed equation of state. For all the models we investigate, the\nenergy generation by nuclear burning plays only a minor role, leading to the\nformation of a black hole without a nuclear-powered explosion. For rotating\nmodels, however, the stellar explosion associated with shock heating is driven\nfrom a torus, which forms after the black hole formation. The explosion energy\nis up to $10^{-4}$ of the mass energy of the supermassive star cores ($\\sim\n10^{55}-10^{56}$ erg). We find that, even if we increase the rotational angular\nmomentum of the progenitor, the ejecta mass saturates at $\\sim 1$\\% of the\ntotal mass of the initial stellar core. The average ejecta velocity also\nsaturates at $\\approx 20\\%$ of the speed of light. As a result, the ejecta\nkinetic energy is approximately proportional to the initial mass of the\nsupermassive star core for the rapidly rotating case. We also perform viscous\nhydrodynamics simulations for exploring the evolution of the remnant torus.\nAlthough the viscous heating drives an outflow from the torus, we find that its\neffect is subdominant in terms of the kinetic energy because of the small\nvelocity ($\\approx 0.07c$) of the ejecta component.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NpjnIppvNAa_GWYfyTq2ixSrAR_otAMwVQeRY8l6JSk","pdfSize":"2403982"}
