{"id":"2408.14490","title":"Revisiting the Becker-Kistiakowsky-Wilson equation of state","authors":"Loann Neron (LMA, RS2N), Richard Saurel (LMA, RS2N)","authorsParsed":[["Neron","Loann","","LMA, RS2N"],["Saurel","Richard","","LMA, RS2N"]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 08:20:33 GMT"}],"updateDate":"2024-08-28","timestamp":1724314833000,"abstract":"  The Jones-Wilkins-Lee (JWL) equation of state (EOS) is the most popular\nequation of state used in hydrocodes to model detonation products\nthermodynamics resulting from high explosives. However, the JWL EOS presents\nseveral major difficulties. Namely, its range of validity and convexity is\nlimited as its parameters are adjusted on a given reference curve. When used in\nconditions where the thermodynamic state varies significantly, computational\nfailure may happen. It occurs frequently in multiphase flow computations when\nheat and mass transfers with other phases are present, as the resulting\nthermodynamic state is far from the reference curve used for adjustment.\nMoreover, the detonation products composition is absent in the JWL formulation.\nThis is another important limitation when additional physics are involved, such\nas post-combustion, phase transition, or when dealing with non-ideal\nexplosives. In this work, the Becker-Kistiakowsky-Wilson (BKW) EOS is\nconsidered instead. The BKW EOS is widely used in thermochemical codes, as\nparent EOS to provide the reference data used to fit JWL EOS parameters. The\nBKW EOS present several advantages. Its formulation considers variable gas\nspecies in the detonation products. No specific adjustment is needed for a\ngiven explosive, and only the detonation products composition requires\ncomputational efforts. Its range of validity is large, as the various\nparameters have been adjusted for each gas species separately. However, the BKW\nEOS also present difficulties which limit its application in hydrocodes. These\ndifficulties are the aim of the present work. The BKW EOS is currently\nrestricted to thermochemical codes as its mathematical formulation is\ncomputationally expensive. It also requires the gas chemical composition to be\ncomputed via an appropriate chemical equilibrium solver. In the present work,\nthe computational cost of the BKW EOS is reduced thanks to the thermodynamic\nrelaxation method of Neron et al. (2023). The variable composition of the\ndetonation products is accounted for through specific relaxation terms computed\nonce, with the help of conventional thermochemical codes. The condensed\nspecies, such as solid carbon, are modelled with the Cochran-Chan (CC) EOS,\nhaving a simpler thermodynamic formulation and being thermodynamically\nconsistent compared to usual EOSs used for condensed species. This multiphase\nformulation made of BKW gas mixture with variable composition and condensed\nphases is considered in temperature and pressure equilibrium. It is embedded in\na multiphase flow formulation, with the help of the thermodynamic relaxation\nmethod mentioned above. It shows comparable computational cost as the JWL\nformulation, with significantly enhanced physics capabilities and improved\nrobustness.\n","subjects":["Condensed Matter/Materials Science","Physics/Chemical Physics","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}