{"id":"2408.13653","title":"Evaluating the Robustness of LiDAR-based 3D Obstacles Detection and Its\n  Impacts on Autonomous Driving Systems","authors":"Tri Minh Triet Pham, Bo Yang, Jinqiu Yang","authorsParsed":[["Pham","Tri Minh Triet",""],["Yang","Bo",""],["Yang","Jinqiu",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 19:10:07 GMT"}],"updateDate":"2024-08-27","timestamp":1724526607000,"abstract":"  Autonomous driving systems (ADSs) require real-time input from multiple\nsensors to make time-sensitive decisions using deep neural networks. This makes\nthe correctness of these decisions crucial to ADSs' adoption as errors can\ncause significant loss. Sensors such as LiDAR are sensitive to environmental\nchanges and built-in inaccuracies and may fluctuate between frames. While there\nhas been extensive work to test ADSs, it remains unclear whether current ADSs\nare robust against very subtle changes in LiDAR point cloud data. In this work,\nwe study the impact of the built-in inaccuracies in LiDAR sensors on LiDAR-3D\nobstacle detection models to provide insight into how they can impact obstacle\ndetection (i.e., robustness) and by extension trajectory prediction (i.e., how\nthe robustness of obstacle detection would impact ADSs).\n  We propose a framework SORBET, that applies subtle perturbations to LiDAR\ndata, evaluates the robustness of LiDAR-3D obstacle detection, and assesses the\nimpacts on the trajectory prediction module and ADSs. We applied SORBET to\nevaluate the robustness of five classic LiDAR-3D obstacle detection models,\nincluding one from an industry-grade Level 4 ADS (Baidu's Apollo). Furthermore,\nwe studied how changes in the obstacle detection results would negatively\nimpact trajectory prediction in a cascading fashion. Our evaluation highlights\nthe importance of testing the robustness of LiDAR-3D obstacle detection models\nagainst subtle perturbations. We find that even very subtle changes in point\ncloud data (i.e., removing two points) may introduce a non-trivial decrease in\nthe detection performance. Furthermore, such a negative impact will further\npropagate to other modules, and endanger the safety of ADSs.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}