{"id":"2408.11163","title":"Tomonaga-Luttinger liquid and quantum criticality in spin-1/2\n  antiferromagnetic Heisenberg chain C14H18CuN4O10 via Wilson ratio","authors":"Sharath Kumar Channarayappa, Sankalp Kumar, N. S. Vidhyadhiraja,\n  Sumiran Pujari, M. P. Saravanan, Amal Sebastian, Eun Sang Choi, Shalinee\n  Chikara, Dolly Nambi, Athira Suresh, Siddhartha Lal and D. Jaiswal-Nagar","authorsParsed":[["Channarayappa","Sharath Kumar",""],["Kumar","Sankalp",""],["Vidhyadhiraja","N. S.",""],["Pujari","Sumiran",""],["Saravanan","M. P.",""],["Sebastian","Amal",""],["Choi","Eun Sang",""],["Chikara","Shalinee",""],["Nambi","Dolly",""],["Suresh","Athira",""],["Lal","Siddhartha",""],["Jaiswal-Nagar","D.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 19:50:06 GMT"}],"updateDate":"2024-08-22","timestamp":1724183406000,"abstract":"  The ground state of a one-dimensional spin-1/2 uniform antiferromagnetic\nHeisenberg chain (AfHc) is a Tomonaga-Luttinger liquid which is\nquantum-critical with respect to applied magnetic fields upto a saturation\nfield Hs beyond which it transforms to a fully polarised state. Wilson ratio\nhas been predicted to be a good indicator for demarcating these phases [Phys.\nRev. B 96, 220401 (2017)]. From detailed temperature and magnetic field\ndependent magnetisation, magnetic susceptibility and specific heat measurements\nin a metalorganic complex and comparisons with field theory and quantum\ntransfer matrix method calculations, the complex was found to be a very good\nrealisation of a spin-1/2 AfHc. Wilson ratio obtained from experimentally\nobtained magnetic susceptibility and magnetic contribution of specific heat\nvalues was used to map the magnetic phase diagram of the uniform spin-1/2 AfHc\nover large regions of phase space demarcating Tomonaga-Luttinger liquid,\nsaturation field quantum critical, and fully polarised states. Luttinger\nparameter and spinon velocity were found to match very well with the values\npredicted from conformal field theory.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}