{"id":"2408.12944","title":"Towards a Resource-Optimized Dynamic Quantum Algorithm via Non-iterative\n  Auxiliary Subspace Corrections","authors":"Chayan Patra, Debaarjun Mukherjee, Sonaldeep Halder, Dibyendu Mondal\n  and Rahul Maitra","authorsParsed":[["Patra","Chayan",""],["Mukherjee","Debaarjun",""],["Halder","Sonaldeep",""],["Mondal","Dibyendu",""],["Maitra","Rahul",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 09:50:15 GMT"}],"updateDate":"2024-08-26","timestamp":1724406615000,"abstract":"  Recent quantum algorithms pertaining to electronic structure theory primarily\nfocus on threshold-based dynamic construction of ansatz by selectively\nincluding important many-body operators. These methods can be made\nsystematically more accurate by tuning the threshold to include more number of\noperators into the ansatz. However, such improvements come at the cost of rapid\nproliferation of the circuit depth, especially for highly correlated molecular\nsystems. In this work, we address this issue by the development of a novel\ntheoretical framework that relies on the segregation of an ansatz into a\ndynamically selected core principal component, which is, by construction\nadiabatically decoupled from the remaining operators. This enables us to\nperform computations involving the principal component using extremely\nshallow-depth circuits whereas, the effect of the remaining auxiliary component\nis folded into the energy function via a cost-efficient non-iterative\ncorrection, ensuring the requisite accuracy. We propose a formalism that\nanalytically predicts the auxiliary parameters from the principal ones,\nfollowed by a suite of non-iterative auxiliary subspace correction techniques\nwith different levels of sophistication. The auxiliary subspace corrections\nincur no additional quantum resources, yet complement an inadequately\nexpressive core of the ansatz to recover significant amount of electronic\ncorrelations. We have numerically validated the resource efficiency and\naccuracy of our formalism with a number of strongly correlated molecular\nsystems.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Th2ZNqw8dH4eeTnBxm_sfbemlLAS2RaYFm79qBOMrgk","pdfSize":"2642789"}
