{"id":"2408.10952","title":"Cosmoglobe DR2. I. Global Bayesian analysis of COBE-DIRBE","authors":"D. J. Watts, M. Galloway, E. Gjerl{\\o}w, M. San, R. Aurlien, A.\n  Basyrov, M. Brilenkov, H. K. Eriksen, U. Fuskeland, L. T. Hergt, D. Herman,\n  H. T. Ihle, J. G. S. Lunde, S. K. N{\\ae}ss, N.-O. Stutzer, H. Thommesen, and\n  I. K. Wehus","authorsParsed":[["Watts","D. J.",""],["Galloway","M.",""],["Gjerløw","E.",""],["San","M.",""],["Aurlien","R.",""],["Basyrov","A.",""],["Brilenkov","M.",""],["Eriksen","H. K.",""],["Fuskeland","U.",""],["Hergt","L. T.",""],["Herman","D.",""],["Ihle","H. T.",""],["Lunde","J. G. S.",""],["Næss","S. K.",""],["Stutzer","N. -O.",""],["Thommesen","H.",""],["Wehus","I. K.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 15:42:10 GMT"}],"updateDate":"2024-08-21","timestamp":1724168530000,"abstract":"  We present the first global Bayesian analysis of the time-ordered DIRBE data\nwithin the Cosmoglobe framework, building on the same methodology that has\npreviously been successfully applied to Planck LFI and WMAP. These data are\nanalyzed jointly with COBE-FIRAS, Gaia, Planck HFI, and WISE, allowing for more\naccurate instrumental and astrophysical characterization than possible through\nsingle-experiment analysis. This paper provides an overview of the analysis\npipeline and main results, and we present and characterize a new set of\nzodiacal light subtracted mission average (ZSMA) DIRBE maps spanning 1.25 to\n240 $\\mu$m. A novel aspect of this processing is the characterization and\nremoval of excess radiation between 4.9 and 60$\\,\\mu$m that appears static in\nsolar-centric coordinates. The DR2 ZSMA maps have several advantages with\nrespect to the previously available maps, including 1) lower zodiacal light\n(and possibly straylight) residuals; 2) better determined zero-levels; 3)\nnatively HEALPix tessellated maps with a $7'$ pixel size; 4) nearly white noise\nat pixel scales; and 5) a more complete and accurate noise characterization\nestablished through the combination of MCMC samples and half-mission maps. In\naddition, because the model has been simultaneously fitted with both DIRBE and\nHFI data, this is the first consistent unification of the infrared and CMB\nwavelength ranges into one global sky model covering 100 GHz to 1 $\\mu$m.\nHowever, even though the new maps are improved with respect to the official\nmaps, and should be preferred for most future analyses that require DIRBE sky\nmaps, they still exhibit non-negligible zodiacal light residuals between 12 and\n60$\\,\\mu$m. Further improvements should be made through joint analysis with\ncomplementary infrared experiments such IRAS, AKARI, WISE and SPHEREx, and\nreleasing the full combined potential of all these powerful infrared\nobservatories.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gqNQDLr2dIYg3aAy7lxEVCJBHNjpRTMzv2iQ8VkKJx0","pdfSize":"18553220"}
