{"id":"2408.03485","title":"Sub-Resolution mmWave FMCW Radar-based Touch Localization using Deep\n  Learning","authors":"Raghunandan M. Rao, Amit Kachroo, Koushik A. Manjunatha, Morris Hsu,\n  Rohit Kumar","authorsParsed":[["Rao","Raghunandan M.",""],["Kachroo","Amit",""],["Manjunatha","Koushik A.",""],["Hsu","Morris",""],["Kumar","Rohit",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 00:33:56 GMT"}],"updateDate":"2024-08-08","timestamp":1722990836000,"abstract":"  Touchscreen-based interaction on display devices are ubiquitous nowadays.\nHowever, capacitive touch screens, the core technology that enables its\nwidespread use, are prohibitively expensive to be used in large displays\nbecause the cost increases proportionally with the screen area. In this paper,\nwe propose a millimeter wave (mmWave) radar-based solution to achieve\nsubresolution error performance using a network of four mmWave radar sensors.\nUnfortunately, achieving this is non-trivial due to inherent range resolution\nlimitations of mmWave radars, since the target (human hand, finger etc.) is\n'distributed' in space. We overcome this using a deep learning-based approach,\nwherein we train a deep convolutional neural network (CNN) on range-FFT (range\nvs power profile)-based features against ground truth (GT) positions obtained\nusing a capacitive touch screen. To emulate the clutter characteristics\nencountered in radar-based positioning of human fingers, we use a metallic\nfinger mounted on a metallic robot arm as the target. Using this setup, we\ndemonstrate subresolution position error performance. Compared to conventional\nsignal processing (CSP)-based approaches, we achieve a 2-3x reduction in\npositioning error using the CNN. Furthermore, we observe that the inference\ntime performance and CNN model size support real-time integration of our\napproach on general purpose processor-based computing platforms.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}