{"id":"2408.06601","title":"HiRegEx: Interactive Visual Query and Exploration of Multivariate\n  Hierarchical Data","authors":"Guozheng Li, Haotian Mi, Chi Harold Liu, Takayuki Itoh, Guoren Wang","authorsParsed":[["Li","Guozheng",""],["Mi","Haotian",""],["Liu","Chi Harold",""],["Itoh","Takayuki",""],["Wang","Guoren",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 03:33:41 GMT"}],"updateDate":"2024-08-14","timestamp":1723520021000,"abstract":"  When using exploratory visual analysis to examine multivariate hierarchical\ndata, users often need to query data to narrow down the scope of analysis.\nHowever, formulating effective query expressions remains a challenge for\nmultivariate hierarchical data, particularly when datasets become very large.\nTo address this issue, we develop a declarative grammar, HiRegEx (Hierarchical\ndata Regular Expression), for querying and exploring multivariate hierarchical\ndata. Rooted in the extended multi-level task topology framework for tree\nvisualizations (e-MLTT), HiRegEx delineates three query targets (node, path,\nand subtree) and two aspects for querying these targets (features and\npositions), and uses operators developed based on classical regular expressions\nfor query construction. Based on the HiRegEx grammar, we develop an exploratory\nframework for querying and exploring multivariate hierarchical data and\nintegrate it into the TreeQueryER prototype system. The exploratory framework\nincludes three major components: top-down pattern specification, bottom-up\ndata-driven inquiry, and context-creation data overview. We validate the\nexpressiveness of HiRegEx with the tasks from the e-MLTT framework and showcase\nthe utility and effectiveness of TreeQueryER system through a case study\ninvolving expert users in the analysis of a citation tree dataset.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Graphics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}