{"id":"2408.01319","title":"A Comprehensive Review of Multimodal Large Language Models: Performance\n  and Challenges Across Different Tasks","authors":"Jiaqi Wang, Hanqi Jiang, Yiheng Liu, Chong Ma, Xu Zhang, Yi Pan,\n  Mengyuan Liu, Peiran Gu, Sichen Xia, Wenjun Li, Yutong Zhang, Zihao Wu,\n  Zhengliang Liu, Tianyang Zhong, Bao Ge, Tuo Zhang, Ning Qiang, Xintao Hu, Xi\n  Jiang, Xin Zhang, Wei Zhang, Dinggang Shen, Tianming Liu, Shu Zhang","authorsParsed":[["Wang","Jiaqi",""],["Jiang","Hanqi",""],["Liu","Yiheng",""],["Ma","Chong",""],["Zhang","Xu",""],["Pan","Yi",""],["Liu","Mengyuan",""],["Gu","Peiran",""],["Xia","Sichen",""],["Li","Wenjun",""],["Zhang","Yutong",""],["Wu","Zihao",""],["Liu","Zhengliang",""],["Zhong","Tianyang",""],["Ge","Bao",""],["Zhang","Tuo",""],["Qiang","Ning",""],["Hu","Xintao",""],["Jiang","Xi",""],["Zhang","Xin",""],["Zhang","Wei",""],["Shen","Dinggang",""],["Liu","Tianming",""],["Zhang","Shu",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 15:14:53 GMT"}],"updateDate":"2024-08-05","timestamp":1722611693000,"abstract":"  In an era defined by the explosive growth of data and rapid technological\nadvancements, Multimodal Large Language Models (MLLMs) stand at the forefront\nof artificial intelligence (AI) systems. Designed to seamlessly integrate\ndiverse data types-including text, images, videos, audio, and physiological\nsequences-MLLMs address the complexities of real-world applications far beyond\nthe capabilities of single-modality systems. In this paper, we systematically\nsort out the applications of MLLM in multimodal tasks such as natural language,\nvision, and audio. We also provide a comparative analysis of the focus of\ndifferent MLLMs in the tasks, and provide insights into the shortcomings of\ncurrent MLLMs, and suggest potential directions for future research. Through\nthese discussions, this paper hopes to provide valuable insights for the\nfurther development and application of MLLM.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}