{"id":"2408.05059","title":"Democratic Favor Channel","authors":"Ziho Park","authorsParsed":[["Park","Ziho",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 13:30:13 GMT"}],"updateDate":"2024-08-12","timestamp":1723210213000,"abstract":"  A large body of literature in economics and political science examines the\nimpact of democracy and political freedoms on various outcomes using\ncross-country comparisons. This paper explores the possibility that any\npositive impact of democracy observed in these studies might be attributed to\npowerful democratic nations, their allies, and international organizations\ntreating democracies more favorably than nondemocracies, a concept I refer to\nas democratic favor channel. Firstly, after I control for being targeted by\nsanctions from G7 or the United Nations and having military confrontations and\ncooperation with the West, most of the positive effects of democracy on growth\nin cross-country panel regressions become insignificant or negatively\nsignificant. Secondly, using the same empirical specification as this\nliterature for demonstrating intermediating forces, I show that getting\nsanctioned, militarily attacked, and not having defense cooperation with the\nWest are plausible channels through which democracy causes growth. Lastly, in\nthe pre-Soviet-collapse period, which coincides with the time when democracy\npromotion was less often used as a justification for sanctions, the impact of\ndemocracy on GDP per capita is already weak or negative without any additional\ncontrols, and it becomes further negative once democratic favor is controlled.\nThese findings support the democratic favor channel and challenge the idea that\nthe institutional qualities of democracy per se lead to desirable outcomes. The\ncritique provided in this paper applies to the broader comparative institutions\nliterature in social sciences and political philosophy.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ftUdoqsT3dtRXqRC_wwJnG4SSlogohNZ2730EgCouwE","pdfSize":"195798"}
