{"id":"2408.14762","title":"Explainable Hierarchical Urban Representation Learning for Commuting\n  Flow Prediction","authors":"Mingfei Cai, Yanbo Pang, Yoshihide Sekimoto","authorsParsed":[["Cai","Mingfei",""],["Pang","Yanbo",""],["Sekimoto","Yoshihide",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 03:30:01 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 08:30:01 GMT"}],"updateDate":"2024-09-06","timestamp":1724729401000,"abstract":"  Commuting flow prediction is an essential task for municipal operations in\nthe real world. Previous studies have revealed that it is feasible to estimate\nthe commuting origin-destination (OD) demand within a city using multiple\nauxiliary data. However, most existing methods are not suitable to deal with a\nsimilar task at a large scale, namely within a prefecture or the whole nation,\nowing to the increased number of geographical units that need to be maintained.\nIn addition, region representation learning is a universal approach for gaining\nurban knowledge for diverse metropolitan downstream tasks. Although many\nresearchers have developed comprehensive frameworks to describe urban units\nfrom multi-source data, they have not clarified the relationship between the\nselected geographical elements. Furthermore, metropolitan areas naturally\npreserve ranked structures, like cities and their inclusive districts, which\nmakes elucidating relations between cross-level urban units necessary.\nTherefore, we develop a heterogeneous graph-based model to generate meaningful\nregion embeddings at multiple spatial resolutions for predicting different\ntypes of inter-level OD flows. To demonstrate the effectiveness of the proposed\nmethod, extensive experiments were conducted using real-world aggregated mobile\nphone datasets collected from Shizuoka Prefecture, Japan. The results indicate\nthat our proposed model outperforms existing models in terms of a uniform urban\nstructure. We extend the understanding of predicted results using reasonable\nexplanations to enhance the credibility of the model.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}