{"id":"2408.10110","title":"Electrically Reconfigurable Non-Volatile On-Chip Bragg Filter with\n  Multilevel Operation","authors":"Amged Alquliah, Jay Ke-Chieh Sun, Christopher Mekhiel, Chengkuan Gao,\n  Guli Gulinihali, Yeshaiahu Fainman, and Abdoulaye Ndao","authorsParsed":[["Alquliah","Amged",""],["Sun","Jay Ke-Chieh",""],["Mekhiel","Christopher",""],["Gao","Chengkuan",""],["Gulinihali","Guli",""],["Fainman","Yeshaiahu",""],["Ndao","Abdoulaye",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 15:59:30 GMT"}],"updateDate":"2024-08-20","timestamp":1724083170000,"abstract":"  Photonic integrated circuits (PICs) demand tailored spectral responses for\nvarious applications. On-chip Bragg filters offer a promising solution, yet\ntheir static nature hampers scalability. Current tunable filters rely on\nvolatile switching mechanisms plagued by high static power consumption and\nthermal crosstalk. Here, we introduce, for the first time, a non-volatile,\nelectrically programmable on-chip Bragg filter. This device incorporates a\nnanoscale layer of wide-bandgap phase change material (Sb2S3) atop a\nperiodically structured silicon waveguide. The reversible phase transitions and\ndrastic refractive index modulation of Sb2S3 enable dynamic spectral tuning via\nfoundry-compatible microheaters. Our design surpasses traditional passive Bragg\ngratings and active volatile filters by offering electrically controlled,\nreconfigurable spectral responses in a non-volatile manner. The proposed filter\nachieves a peak reflectivity exceeding 99% and a high tuning range\n($\\Delta\\lambda$=20 nm) when transitioning between the amorphous and\ncrystalline states of Sb2S3. Additionally, we demonstrate quasi-continuous\nspectral control of the filter stopband by modulating the amorphous/crystalline\ndistribution within Sb2S3. Our approach offers substantial benefits for\nlow-power, programmable PICs, thereby laying the groundwork for prospective\napplications in optical communications, optical interconnects, microwave\nphotonics, optical signal processing, and adaptive multi-parameter sensing.\n","subjects":["Physics/Optics","Electrical Engineering and Systems Science/Signal Processing","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}