{"id":"2408.08481","title":"A Multivariate Multilevel Longitudinal Functional Model for Repeatedly\n  Observed Human Movement Data","authors":"Edward Gunning, Steven Golovkine, Andrew J. Simpkin, Aoife Burke,\n  Sarah Dillon, Shane Gore, Kieran Moran, Siobhan O'Connor, Enda Whyte and\n  Norma Bargary","authorsParsed":[["Gunning","Edward",""],["Golovkine","Steven",""],["Simpkin","Andrew J.",""],["Burke","Aoife",""],["Dillon","Sarah",""],["Gore","Shane",""],["Moran","Kieran",""],["O'Connor","Siobhan",""],["Whyte","Enda",""],["Bargary","Norma",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 01:57:07 GMT"}],"updateDate":"2024-08-19","timestamp":1723773427000,"abstract":"  Biomechanics and human movement research often involves measuring multiple\nkinematic or kinetic variables regularly throughout a movement, yielding data\nthat present as smooth, multivariate, time-varying curves and are naturally\namenable to functional data analysis. It is now increasingly common to record\nthe same movement repeatedly for each individual, resulting in curves that are\nserially correlated and can be viewed as longitudinal functional data. We\npresent a new approach for modelling multivariate multilevel longitudinal\nfunctional data, with application to kinematic data from recreational runners\ncollected during a treadmill run. For each stride, the runners' hip, knee and\nankle angles are modelled jointly as smooth multivariate functions that depend\non subject-specific covariates. Longitudinally varying multivariate functional\nrandom effects are used to capture the dependence among adjacent strides and\nchanges in the multivariate functions over the course of the treadmill run. A\nbasis modelling approach is adopted to fit the model -- we represent each\nobservation using a multivariate functional principal components basis and\nmodel the basis coefficients using scalar longitudinal mixed effects models.\nThe predicted random effects are used to understand and visualise changes in\nthe multivariate functional data over the course of the treadmill run. In our\napplication, our method quantifies the effects of scalar covariates on the\nmultivariate functional data, revealing a statistically significant effect of\nrunning speed at the hip, knee and ankle joints. Analysis of the predicted\nrandom effects reveals that individuals' kinematics are generally stable but\ncertain individuals who exhibit strong changes during the run can also be\nidentified. A simulation study is presented to demonstrate the efficacy of the\nproposed methodology under realistic data-generating scenarios.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"F5x11_CMxRlMew99D1TzY9ibVhEpCjTTS2-6bdTRiHg","pdfSize":"8463422"}
