{"id":"2408.00110","title":"The Aldous--Lyons Conjecture I: Subgroup Tests","authors":"Lewis Bowen, Michael Chapman, Alexander Lubotzky and Thomas Vidick","authorsParsed":[["Bowen","Lewis",""],["Chapman","Michael",""],["Lubotzky","Alexander",""],["Vidick","Thomas",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:37:19 GMT"}],"updateDate":"2024-08-02","timestamp":1722451039000,"abstract":"  This paper, and its companion [BCV24], are devoted to a negative resolution\nof the Aldous--Lyons Conjecture [AL07, Ald07]. This conjecture, originated in\nprobability theory, is well known (cf. [Gel18]) to be equivalent to the\nstatement that every invariant random subgroup of the free group is co-sofic.\nWe disprove this last statement.\n  In this part we introduce subgroup tests. These tests are finite\ndistributions over continuous functions from the space of subgroups of the free\ngroup to $\\{0,1\\}$. Subgroup tests provide a general framework in which one can\nstudy invariant random subgroups of the free group. Classical notions such as\ngroup soficity and group stability arise naturally in this framework. By the\ncorrespondence between subgroups of the free group and Schreier graphs, one can\nview subgroup tests as a property testing model for certain edge-labeled\ngraphs. This correspondence also provides the connection to random networks.\n  Subgroup tests have values, which are their asymptotic optimal expectations\nwhen integrated against co-sofic invariant random subgroups. Our first main\nresult is that, if every invariant random subgroup of the free group is\nco-sofic, then one can approximate the value of a subgroup test up to any\npositive additive constant. Our second main result is an essentially value\npreserving correspondence between certain non-local games and subgroup tests.\nBy composing this correspondence with a stronger variant of the reduction in\nMIP*=RE [JNV+21], proved in the companion paper [BCV24], we deduce that\napproximating the sofic value of a subgroup test is as hard as the Halting\nProblem, and in particular, undecidable. The combination of our two main\nresults proves the existence of non co-sofic invariant random subgroups of the\nfree group.\n","subjects":["Mathematics/Group Theory","Mathematics/Combinatorics","Mathematics/Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"19sMb_icPELBwxSx8VlciPYMuZWnEEjAZ7BnrtF30e8","pdfSize":"680065","txDigest":"5PuyNv8dE3zc359xwd3MvjmNJFVNq6jtnDCfZRMdZzfU","endEpoch":"100","status":"CERTIFIED"}
