{"id":"2408.02977","title":"Experimental minimum of condensed-phase optical refrigeration","authors":"Zhuoming Zhang, Yang Ding, Peter J. Pauzauskie, Mansoor Sheik-Bahae,\n  Denis V. Seletskiy, Masaru Kuno","authorsParsed":[["Zhang","Zhuoming",""],["Ding","Yang",""],["Pauzauskie","Peter J.",""],["Sheik-Bahae","Mansoor",""],["Seletskiy","Denis V.",""],["Kuno","Masaru",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 06:20:17 GMT"}],"updateDate":"2024-08-07","timestamp":1722925217000,"abstract":"  Since the first demonstration of optical refrigeration in a rare-earth-doped\nglass nearly 30 years ago, the nascent field of laser cooling solids has\nprogressed significantly. It is now possible to demonstrate payload cooling to\n~91 K using laser-excited ytterbium-doped fluoride crystals. Realizing lower\ntemperatures, however, requires achieving ultrahigh purities in existing rare\nearth-doped crystals or establishing new cooling media. For the latter,\nsemiconductors are an obvious choice given higher cooling power densities and\npredicted cooling floors as low as 10 K. This has stimulated a race to\ndemonstrate the optical refrigeration of a semiconductor. It is therefore\ntimely to systematize the necessary and sufficient experimental minimum\ncriteria for reporting optical refrigeration results to elevate the reliability\nand reproducibility of current and future optical refrigeration claims.\n  We distill an optical refrigeration Experimental Minimum (EM) that we propose\nwill standardize the reporting of new cooling results. EM tenets fall into the\nfollowing categories: demonstrations of explicit heating vs cooling, optical\ncooling metrics, thermodynamic consistency, and reliable temperature\nmeasurements.\n  All optical refrigeration claims should demonstrate the above four criteria\nto ensure their reliability and verifiability. We further propose that the EM\nserve as a guide for reviewing literature claims in the field.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}