{"id":"2408.09746","title":"Enhanced Cascade Prostate Cancer Classifier in mp-MRI Utilizing Recall\n  Feedback Adaptive Loss and Prior Knowledge-Based Feature Extraction","authors":"Kun Luo, Bowen Zheng, Shidong Lv, Jie Tao, Qiang Wei","authorsParsed":[["Luo","Kun",""],["Zheng","Bowen",""],["Lv","Shidong",""],["Tao","Jie",""],["Wei","Qiang",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 07:18:06 GMT"}],"updateDate":"2024-08-20","timestamp":1724051886000,"abstract":"  Prostate cancer is the second most common cancer in males worldwide, and\nmpMRI is commonly used for diagnosis. However, interpreting mpMRI is\nchallenging and requires expertise from radiologists. This highlights the\nurgent need for automated grading in mpMRI. Existing studies lack integration\nof clinical prior information and suffer from uneven training sample\ndistribution due to prevalence. Therefore, we propose a solution that\nincorporates prior knowledge, addresses the issue of uneven medical sample\ndistribution, and maintains high interpretability in mpMRI. Firstly, we\nintroduce Prior Knowledge-Based Feature Extraction, which mathematically models\nthe PI-RADS criteria for prostate cancer as diagnostic information into model\ntraining. Secondly, we propose Adaptive Recall Feedback Loss to address the\nextremely imbalanced data problem. This method adjusts the training dynamically\nbased on accuracy and recall in the validation set, resulting in high accuracy\nand recall simultaneously in the testing set.Thirdly, we design an Enhanced\nCascade Prostate Cancer Classifier that classifies prostate cancer into\ndifferent levels in an interpretable way, which refines the classification\nresults and helps with clinical intervention. Our method is validated through\nexperiments on the PI-CAI dataset and outperforms other methods with a more\nbalanced result in both accuracy and recall rate.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}