{"id":"2408.11989","title":"Controlling nonergodicity in quantum many-body systems by reinforcement\n  learning","authors":"Li-Li Ye, and Ying-Cheng Lai","authorsParsed":[["Ye","Li-Li",""],["Lai","Ying-Cheng",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 20:55:44 GMT"},{"version":"v2","created":"Mon, 9 Sep 2024 21:03:46 GMT"}],"updateDate":"2024-09-11","timestamp":1724273744000,"abstract":"  Finding optimal control strategies to suppress quantum thermalization for\narbitrarily initial states, the so-called quantum nonergodicity control, is\nimportant for quantum information science and technologies. Previous control\nmethods largely relied on theoretical model of the target quantum system, but\ninvertible model approximations and inaccuracies can lead to control failures.\nWe develop a model-free and deep-reinforcement learning (DRL) framework for\nquantum nonergodicity control. It is a machine-learning method with the unique\nfocus on balancing exploration and exploitation strategies to maximize the\ncumulative rewards so as to preserve the initial memory in the time-dependent\nnonergodic metrics over a long stretch of time. We use the paradigmatic\none-dimensional tilted Fermi-Hubbard system to demonstrate that the DRL agent\ncan efficiently learn the quantum many-body system solely through the\ninteractions with the environment. The optimal policy obtained by the DRL\nprovides broader control scenarios for managing nonergodicity in the phase\ndiagram as compared to, e.g., the specific protocol for Wannier-Stark\nlocalization. The continuous control protocols and observations are\nexperimentally feasible. The model-free nature of DRL and its versatile search\nspace for control functions render promising nonergodicity control in more\ncomplex quantum many-body systems.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Statistical Mechanics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}