{"id":"2408.15256","title":"Improving Ontology Requirements Engineering with OntoChat and\n  Participatory Prompting","authors":"Yihang Zhao, Bohui Zhang, Xi Hu, Shuyin Ouyang, Jongmo Kim, Nitisha\n  Jain, Jacopo de Berardinis, Albert Mero\\~no-Pe\\~nuela, Elena Simperl","authorsParsed":[["Zhao","Yihang",""],["Zhang","Bohui",""],["Hu","Xi",""],["Ouyang","Shuyin",""],["Kim","Jongmo",""],["Jain","Nitisha",""],["de Berardinis","Jacopo",""],["Meroño-Peñuela","Albert",""],["Simperl","Elena",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 19:21:14 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 09:34:48 GMT"},{"version":"v3","created":"Wed, 18 Sep 2024 16:09:40 GMT"}],"updateDate":"2024-09-19","timestamp":1723231274000,"abstract":"  Past ontology requirements engineering (ORE) has primarily relied on manual\nmethods, such as interviews and collaborative forums, to gather user\nrequirements from domain experts, especially in large projects. Current\nOntoChat offers a framework for ORE that utilises large language models (LLMs)\nto streamline the process through four key functions: user story creation,\ncompetency question (CQ) extraction, CQ filtration and analysis, and ontology\ntesting support. In OntoChat, users are expected to prompt the chatbot to\ngenerate user stories. However, preliminary evaluations revealed that they\nstruggle to do this effectively. To address this issue, we experimented with a\nresearch method called participatory prompting, which involves\nresearcher-mediated interactions to help users without deep knowledge of LLMs\nuse the chatbot more effectively. This participatory prompting user study\nproduces pre-defined prompt templates based on user queries, focusing on\ncreating and refining personas, goals, scenarios, sample data, and data\nresources for user stories. These refined user stories will subsequently be\nconverted into CQs.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}