{"id":"2408.00185","title":"Anharmonic quantum muon effects in the kagome antiferromagnet\n  Zn-Barlowite","authors":"Fabian Hotz, Matja\\v{z} Gomil\\v{s}ek, Tina Arh, Andrej Zorko and\n  Hubertus Luetkens","authorsParsed":[["Hotz","Fabian",""],["Gomilšek","Matjaž",""],["Arh","Tina",""],["Zorko","Andrej",""],["Luetkens","Hubertus",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 22:36:54 GMT"}],"updateDate":"2024-08-02","timestamp":1722465414000,"abstract":"  Muon spin spectroscopy ($\\mu$SR) is a powerful local probe technique e.g.\nused for the investigation of exotic frustrated magnetism. Ab initio\nsimulations using Density Functional Theory with the muon treated as a\npoint-like defect (DFT+$\\mu$) are commonly employed to determine the\ninterstitial lattice positions where the muon comes to rest after implantation.\nThese muon stopping sites are critical for accurately interpreting $\\mu$SR\ndata. For example, for the quantum spin liquid candidate Zn-Barlowite,\nDFT+$\\mu$ simulations identify two types of muon stopping sites: a\nhigher-energy site where the muon is located between a fluorine and a bromine\natom and three similar sites near an OH group. However, our study shows that\nthe $\\mu$SR spectra of Zn-Barlowite cannot be adequately described using muon\nsites determined by the conventional DFT+$\\mu$ approach. Instead, accurate\nreproduction of the $\\mu$SR data requires treating the muon as a spatially\nextended quantum particle with a skewed wavefunction due to the anharmonicity\nof the surrounding electrostatic potential. The quantum nature of the muon\nsignificantly affects its lattice position and, consequently, the observed\n$\\mu$SR spectra. Our findings highlight the potential of $\\mu$SR to study the\nlocalization of quantum particles, using the muon as the probe and particle\nunder investigation. The light mass of the muon amplifies quantum effects,\nenhancing the sensitivity of our measurements and enabling a detailed\ncomparison between experimental data and theoretical calculations. These\nresults can be directly applied to the theoretical calculations of hydrogen\nlocalization, where quantum effects, though smaller, may still be relevant in\nreal materials.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"V-qWTH6wvP-csNpBxgUn4NRtg8yurCifSZZwsesUSlQ","pdfSize":"3363522"}
