{"id":"2408.12419","title":"4D Diffusion for Dynamic Protein Structure Prediction with Reference\n  Guided Motion Alignment","authors":"Kaihui Cheng, Ce Liu, Qingkun Su, Jun Wang, Liwei Zhang, Yining Tang,\n  Yao Yao, Siyu Zhu, Yuan Qi","authorsParsed":[["Cheng","Kaihui",""],["Liu","Ce",""],["Su","Qingkun",""],["Wang","Jun",""],["Zhang","Liwei",""],["Tang","Yining",""],["Yao","Yao",""],["Zhu","Siyu",""],["Qi","Yuan",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 14:12:50 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 08:03:36 GMT"}],"updateDate":"2024-09-13","timestamp":1724335970000,"abstract":"  Protein structure prediction is pivotal for understanding the\nstructure-function relationship of proteins, advancing biological research, and\nfacilitating pharmaceutical development and experimental design. While deep\nlearning methods and the expanded availability of experimental 3D protein\nstructures have accelerated structure prediction, the dynamic nature of protein\nstructures has received limited attention. This study introduces an innovative\n4D diffusion model incorporating molecular dynamics (MD) simulation data to\nlearn dynamic protein structures. Our approach is distinguished by the\nfollowing components: (1) a unified diffusion model capable of generating\ndynamic protein structures, including both the backbone and side chains,\nutilizing atomic grouping and side-chain dihedral angle predictions; (2) a\nreference network that enhances structural consistency by integrating the\nlatent embeddings of the initial 3D protein structures; and (3) a motion\nalignment module aimed at improving temporal structural coherence across\nmultiple time steps. To our knowledge, this is the first diffusion-based model\naimed at predicting protein trajectories across multiple time steps\nsimultaneously. Validation on benchmark datasets demonstrates that our model\nexhibits high accuracy in predicting dynamic 3D structures of proteins\ncontaining up to 256 amino acids over 32 time steps, effectively capturing both\nlocal flexibility in stable states and significant conformational changes.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}