{"id":"2408.16565","title":"SPH modelling of AGB wind morphology in hierarchical triple systems \\&\n  comparison to observation of R Aql","authors":"Jolien Malfait, Lionel Siess, Owen Vermeulen, Mats Esseldeurs, Sofia\n  H. J. Wallstr\\\"om, Anita M. S. Richards, Frederik De Ceuster, Silke Maes, Jan\n  Bolte, and Leen Decin","authorsParsed":[["Malfait","Jolien",""],["Siess","Lionel",""],["Vermeulen","Owen",""],["Esseldeurs","Mats",""],["Wallström","Sofia H. J.",""],["Richards","Anita M. S.",""],["De Ceuster","Frederik",""],["Maes","Silke",""],["Bolte","Jan",""],["Decin","Leen",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 14:30:59 GMT"}],"updateDate":"2024-08-30","timestamp":1724941859000,"abstract":"  Asymmetric 3D structures are observed in the outflows of evolved low- and\nintermediate-mass stars, and are believed to be shaped through the interaction\nof companions that are hidden within the dense wind. We investigate how triple\nsystems can shape the outflow of AGB stars. We focus on coplanar systems in a\nhierarchical, stable orbit, consisting of an AGB star with one relatively close\ncompanion, and one at large orbital separation. We model a grid of hierarchical\ntriple systems including a wind-launching AGB star, with the\nsmoothed-particle-hydrodynamic Phantom code. We vary the outer companion mass,\nthe AGB wind velocity and the orbital eccentricities to study the impact of\nthese parameters on the wind morphology. Further, we investigate if the outflow\nof the AGB star R Aql could be shaped by a triple system, by post-processing\none of our triple models with a radiative transfer routine, and comparing this\nto data of the ALMA ATOMIUM programme. The characteristic wind structures\nresulting from a hierarchical triple system are the following. A large\ntwo-edged spiral wake results behind the outer companion star. This structure\nlies on top of the spiral structure formed by the close binary, which is\naffected by the orbital motion around the system centre-of-mass. This dense\ninner spiral pattern interacts with, and strongly impacts, the spiral wake of\nthe outer companion, resulting in a waved-pattern on the outer edge of this\nspiral wake. From the comparison of our models to the observations of R Aql, we\nconclude that this circumstellar environment might be shaped by a similar\nsystem as the ones modelled in this work, but an elaborate study of the\nobservational data is needed to determine better the orbital parameters and\ncharacteristics of the central system.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}