{"id":"2408.14210","title":"A model of generation of a jet in stratified nonequilibrium plasma","authors":"O. G. Onishchenko, S. N. Artekha, N. S. Artekha","authorsParsed":[["Onishchenko","O. G.",""],["Artekha","S. N.",""],["Artekha","N. S.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 12:10:51 GMT"}],"updateDate":"2024-08-27","timestamp":1724674251000,"abstract":"  In the magnetohydrodynamic approximation, system of equations is proposed\nwhich analytically describes the initial stage of origination of axially\nsymmetric directed flows in nonequilibrium stratified plasma. The mechanism of\ngeneration is based on the Schwarzschild's convective instability and uses the\nfrozen-in flux condition for magnetic field lines. A solution to the nonlinear\nequation for the stream function is obtained and analyzed, and it is shown that\njets with poloidal velocity fields are generated in such a plasma. The\ncorresponding expressions for the R-dependences of the radial and vertical\nvelocity components in the internal and external regions of the jet include\nBessel functions and modified Bessel functions. For jets localized in height\nand radius, the proposed new nonlinear analytical model makes it possible to\nstudy their structure and nonlinear dynamics in the radial and vertical\ndirections. The emerging instability in a stratified plasma leads to an\nincrease in the radial and vertical velocities of flows according to the law of\nthe hyperbolic sine. The characteristic growth time depends on the value of the\nimaginary part of the Brunt-Vyaisyalya frequency. The formation of jets with\nfinite velocity components increasing with time is analyzed. The radial\nstructure of the azimuthal components is determined by the structure of the\ninitial perturbation and can vary with altitude. Along with studying the\ndynamics of the velocity field, the change in the vertical magnetic field, as\nwell as the dynamics and structure of the emerging toroidal electric current,\nare investigated.\n","subjects":["Physics/Plasma Physics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"uUg7idv16240aFnnvFQWurPRkcx39fmMZHMYeozYxh4","pdfSize":"1090639"}
