{"id":"2408.08209","title":"Modeling Domain and Feedback Transitions for Cross-Domain Sequential\n  Recommendation","authors":"Changshuo Zhang, Teng Shi, Xiao Zhang, Qi Liu, Ruobing Xie, Jun Xu,\n  Ji-Rong Wen","authorsParsed":[["Zhang","Changshuo",""],["Shi","Teng",""],["Zhang","Xiao",""],["Liu","Qi",""],["Xie","Ruobing",""],["Xu","Jun",""],["Wen","Ji-Rong",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 15:18:55 GMT"}],"updateDate":"2024-08-16","timestamp":1723735135000,"abstract":"  Nowadays, many recommender systems encompass various domains to cater to\nusers' diverse needs, leading to user behaviors transitioning across different\ndomains. In fact, user behaviors across different domains reveal changes in\npreference toward recommended items. For instance, a shift from negative\nfeedback to positive feedback indicates improved user satisfaction. However,\nexisting cross-domain sequential recommendation methods typically model user\ninterests by focusing solely on information about domain transitions, often\noverlooking the valuable insights provided by users' feedback transitions. In\nthis paper, we propose $\\text{Transition}^2$, a novel method to model\ntransitions across both domains and types of user feedback. Specifically,\n$\\text{Transition}^2$ introduces a transition-aware graph encoder based on user\nhistory, assigning different weights to edges according to the feedback type.\nThis enables the graph encoder to extract historical embeddings that capture\nthe transition information between different domains and feedback types.\nSubsequently, we encode the user history using a cross-transition multi-head\nself-attention, incorporating various masks to distinguish different types of\ntransitions. Finally, we integrate these modules to make predictions across\ndifferent domains. Experimental results on two public datasets demonstrate the\neffectiveness of $\\text{Transition}^2$.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}