{"id":"2408.08303","title":"DIISC-IV: DIISCovery of Anomalously Low Metallicity H II Regions in NGC\n  99: Indirect Evidence of Gas Inflows","authors":"Alejandro J. Olvera (1), Sanchayeeta Borthakur (1), Mansi Padave (1),\n  Timothy Heckman (1 and 2), Hansung B. Gim (1 and 3), Brad Koplitz (1),\n  Christopher Dupuis (1), Emmanuel Momjian (4), Rolf A. Jansen (1) ((1) Arizona\n  State University, (2) Johns Hopkins University, (3) Montana State University\n  (4) National Radio Astronomy Observatory)","authorsParsed":[["Olvera","Alejandro J.","","1 and 2"],["Borthakur","Sanchayeeta","","1 and 2"],["Padave","Mansi","","1 and 2"],["Heckman","Timothy","","1 and 2"],["Gim","Hansung B.","","1 and 3"],["Koplitz","Brad",""],["Dupuis","Christopher",""],["Momjian","Emmanuel",""],["Jansen","Rolf A.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 17:57:05 GMT"}],"updateDate":"2024-08-16","timestamp":1723744625000,"abstract":"  As a part of the Deciphering the Interplay between the Interstellar medium,\nStars, and the Circumgalactic medium (DIISC) survey, we investigate indirect\nevidence of gas inflow into the disk of the galaxy NGC 99. We combine optical\nspectra from the Binospec spectrograph on the MMT telescope with optical\nimaging data from the Vatican Advanced Technology Telescope, radio HI 21 cm\nemission images from the NSF Karl G. Jansky's Very Large Array, and UV\nspectroscopy from the Cosmic Origins Spectrograph on the Hubble Space\nTelescope. We measure emission lines (H$\\alpha$, H$\\beta$, [O\nIII]$\\lambda5007$, [N II]$\\lambda6583$, and [S II]$\\lambda6717,31$) in 26 H II\nregions scattered about the galaxy and estimate a radial metallicity gradient\nof $-0.017$ dex kpc$^{-1}$ using the N2 metallicity indicator. Two regions in\nthe sample exhibit an anomalously low metallicity (ALM) of 12+log(O/H) = 8.36\ndex, which is $\\sim$0.16 dex lower than other regions at that galactocentric\nradius. They also show a high difference between their HI and H$\\alpha$ line of\nsight velocities on the order of 35 km s$^{-1}$. Chemical evolution modeling\nindicates gas accretion as the cause of the ALM regions. We find evidence for\ncorotation between the interstellar medium of NGC 99 and Ly$\\alpha$ clouds in\nits circumgalactic medium, which suggests a possible pathway for low\nmetallicity gas accretion. We also calculate the resolved Fundamental\nMetallicity Relation (rFMR) on sub-kpc scales using localized gas-phase\nmetallicity, stellar mass surface density, and star-formation rate surface\ndensity. The rFMR shows a similar trend as that found by previous localized and\nglobal FMR relations.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YYYvtN7A5Hp-bMABOg2ykH0gc9MnJrU1vBRgWp5cIM0","pdfSize":"3271394"}
