{"id":"2408.17364","title":"Physics-Informed Neural Networks for Transonic Flows around an Airfoil","authors":"Simon Wassing, Stefan Langer, Philipp Bekemeyer","authorsParsed":[["Wassing","Simon",""],["Langer","Stefan",""],["Bekemeyer","Philipp",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 15:54:29 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 07:10:31 GMT"}],"updateDate":"2024-09-16","timestamp":1725033269000,"abstract":"  Physics-informed neural networks have gained popularity as a deep-learning\nbased method for solving problems governed by partial differential equations.\nEspecially for engineering applications, this new method seems to be promising\nsince it can solve parametric problems. Therefore, a single neural network\ncould substitute many classical simulations in parameter studies. The\nsimulation of inviscid, compressible flows around an airfoil, has been a\nchallenging task for classical numerical methods for many decades and is\nrelevant for industrial applications to this day. Only recently, researchers\nhave been able to successfully simulate subsonic flows around an airfoil with\nphysics-informed neural networks by utilizing mesh transformations to\nprecondition the optimization problem that needs to be solved. Here, we extend\nthis methodology into the transonic regime. Previous attempts showed\ndifficulties to capture the normal shock waves that occur at these flow\nconditions. Inspired by classical numerical methods, we introduce an analytic\nsensor function that locally introduces artificial viscosity at the shock\nlocations to stabilize the training process. We validate the method at\ndifferent transonic flow conditions for the NACA0012 airfoil, obtaining errors\nof less than one percent, compared to finite volume simulations. In addition we\nshow how a parametric model can approximate the solution in a continuous range\nof angle of attacks. The presented method could help to pave the way for\nphysics-informed neural networks towards industrial applications in\naerodynamics.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}