{"id":"2408.12535","title":"Impact of the Inflation Reduction Act and Carbon Capture on\n  Transportation Electrification for a Net-Zero Western U.S. Grid","authors":"Samrat Acharya, Malini Ghosal, Travis Thurber, Ying Zhang, Casey D.\n  Burleyson, and Nathalie Voisin","authorsParsed":[["Acharya","Samrat",""],["Ghosal","Malini",""],["Thurber","Travis",""],["Zhang","Ying",""],["Burleyson","Casey D.",""],["Voisin","Nathalie",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 16:42:32 GMT"}],"updateDate":"2024-08-23","timestamp":1724344952000,"abstract":"  The electrification of transportation is critical to mitigate Greenhouse Gas\n(GHG) emissions. The United States (U.S.) government's Inflation Reduction Act\n(IRA) of 2022 introduces policies to promote the electrification of\ntransportation. In addition to electrifying transportation, clean energy\ntechnologies such as Carbon Capture and Storage (CCS) may play a major role in\nachieving a net-zero energy system. Utilizing scenarios simulated by the U.S.\nversion of the Global Change Analysis Model (GCAM-USA), we analyze the\nindividual and compound contributions of the IRA and CCS to reach a clean U.S.\ngrid by 2035 and net-zero GHG emissions by 2050. We analyze the contributions\nbased on three metrics: i) transportation electrification rate, ii)\ntransportation fuel mix, and iii) spatio-temporal charging loads. Our findings\nindicate that the IRA significantly accelerates transportation electrification\nin the near-term (until 2035). In contrast, CCS technologies, by enabling the\ncontinued use of internal combustion vehicles while still advancing torward\nnet-zero, potentially suppresses the rate of transportation electrification in\nthe long-term. This study underscores how policy and technology innovation can\ninteract and sensitivity studies with different combination are essential to\ncharacterize the potential contributions of each to the transportation\nelectrification.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}