{"id":"2408.15913","title":"A simulation platform for slender, semiflexible, and inextensible fibers\n  with Brownian hydrodynamics and steric repulsion","authors":"Ondrej Maxian and Aleksandar Donev","authorsParsed":[["Maxian","Ondrej",""],["Donev","Aleksandar",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 16:26:02 GMT"}],"updateDate":"2024-08-29","timestamp":1724862362000,"abstract":"  The last few years have seen an explosion of new numerical methods for\nfilament hydrodynamics. Aside from their ubiquity in biology, physics, and\nengineering, filaments present unique challenges from an applied-mathematical\npoint of view. Their slenderness, inextensibility, semiflexibility, and\nmeso-scale nature all require numerical methods that can handle multiple\nlengthscales in the presence of constraints. Accounting for Brownian motion\nwhile keeping the dynamics in detailed balance and on the constraint is\ndifficult, as is including a background solvent, which couples the dynamics of\nmultiple filaments together in a suspension. In this paper, we present a\nsimulation platform for deterministic and Brownian inextensible filament\ndynamics which includes nonlocal fluid dynamics and steric repulsion. We first\nreview previous work, in which we formulated the equations and spatial\ndiscretization for deterministic and Brownian inextensible filament dynamics.\nWe then present novel methods for nonlocal fluid dynamics and steric replusion.\nIn the former case, we define the mobility on a single filament using line\nintegrals of Rotne-Prager-Yamakawa regularized singularities, and numerically\npreserve the symmetric positive definite property by using a thicker\nregularization width for the nonlocal integrals than for the self term. For\nsteric repulsion, we introduce a soft local repulsive potential defined as a\ndouble-integral over two filaments, then present a scheme to identify and\nevaluate the nonzero components of the integrand. We demonstrate that Langevin\ndynamics sample from the equilibrium distribution of free filament shapes, and\nthat the modeling error in using the thicker regularization is small. We\nconclude with two examples, sedimenting filaments and cross-linked fiber\nnetworks, in which nonlocal hydrodynamics does and does not generate long-range\nflow fields, respectively.\n","subjects":["Mathematics/Numerical Analysis","Condensed Matter/Soft Condensed Matter","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ol1fUXrVqwOdOrqx5ORRELk91aPA86rSdiMDy_21ox0","pdfSize":"15441180"}
