{"id":"2408.12658","title":"Hierarchical Generative Modeling of Melodic Vocal Contours in Hindustani\n  Classical Music","authors":"Nithya Shikarpur, Krishna Maneesha Dendukuri, Yusong Wu, Antoine\n  Caillon, Cheng-Zhi Anna Huang","authorsParsed":[["Shikarpur","Nithya",""],["Dendukuri","Krishna Maneesha",""],["Wu","Yusong",""],["Caillon","Antoine",""],["Huang","Cheng-Zhi Anna",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 18:04:29 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 13:02:46 GMT"}],"updateDate":"2024-08-27","timestamp":1724349869000,"abstract":"  Hindustani music is a performance-driven oral tradition that exhibits the\nrendition of rich melodic patterns. In this paper, we focus on generative\nmodeling of singers' vocal melodies extracted from audio recordings, as the\nvoice is musically prominent within the tradition. Prior generative work in\nHindustani music models melodies as coarse discrete symbols which fails to\ncapture the rich expressive melodic intricacies of singing. Thus, we propose to\nuse a finely quantized pitch contour, as an intermediate representation for\nhierarchical audio modeling. We propose GaMaDHaNi, a modular two-level\nhierarchy, consisting of a generative model on pitch contours, and a pitch\ncontour to audio synthesis model. We compare our approach to non-hierarchical\naudio models and hierarchical models that use a self-supervised intermediate\nrepresentation, through a listening test and qualitative analysis. We also\nevaluate audio model's ability to faithfully represent the pitch contour input\nusing Pearson correlation coefficient. By using pitch contours as an\nintermediate representation, we show that our model may be better equipped to\nlisten and respond to musicians in a human-AI collaborative setting by\nhighlighting two potential interaction use cases (1) primed generation, and (2)\ncoarse pitch conditioning.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"D5qtXEa3FVjdGBpVs8XWraAzlbHPr4ygX9OC4kE8Da8","pdfSize":"925473"}
