{"id":"2408.15281","title":"NeR-VCP: A Video Content Protection Method Based on Implicit Neural\n  Representation","authors":"Yangping Lin, Yan Ke, Ke Niu, Jia Liu, Xiaoyuan Yang","authorsParsed":[["Lin","Yangping",""],["Ke","Yan",""],["Niu","Ke",""],["Liu","Jia",""],["Yang","Xiaoyuan",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 16:23:51 GMT"}],"updateDate":"2024-08-29","timestamp":1724171031000,"abstract":"  With the popularity of video applications, the security of video content has\nemerged as a pressing issue that demands urgent attention. Most video content\nprotection methods mainly rely on encryption technology, which needs to be\nmanually designed or implemented in an experience-based manner. To address this\nproblem, we propose an automatic encryption technique for video content\nprotection based on implicit neural representation. We design a\nkey-controllable module, which serves as a key for encryption and decryption.\nNeR-VCP first pre-distributes the key-controllable module trained by the sender\nto the recipients, and then uses Implicit Neural Representation (INR) with a\n(pre-distributed) key-controllable module to encrypt plain video as an implicit\nneural network, and the legal recipients uses a pre-distributed\nkey-controllable module to decrypt this cipher neural network (the\ncorresponding implicit neural network). Under the guidance of the\nkey-controllable design, our method can improve the security of video content\nand provide a novel video encryption scheme. Moreover, using model compression\ntechniques, this method can achieve video content protection while effectively\nmitigating the amount of encrypted data transferred. We experimentally find\nthat it has superior performance in terms of visual representation,\nimperceptibility to illegal users, and security from a cryptographic viewpoint.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}