{"id":"2408.06972","title":"Revisiting de Broglie's Double-Solution Pilot-Wave Theory with a\n  Lorentz-Covariant Lagrangian Framework","authors":"David Darrow and John W. M. Bush","authorsParsed":[["Darrow","David",""],["Bush","John W. M.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 15:29:18 GMT"}],"updateDate":"2024-08-14","timestamp":1723562958000,"abstract":"  The relation between de Broglie's double-solution approach to quantum\ndynamics and the hydrodynamic pilot-wave system has motivated a number of\nrecent revisitations and extensions of de Broglie's theory. Building upon these\nrecent developments, we here introduce a rich family of pilot-wave systems,\nwith a view to reformulating and studying de Broglie's double-solution program\nin the modern language of classical field theory. Notably, the entire family is\nlocal and Lorentz-invariant, follows from a variational principle, and exhibits\ntime-invariant, two-way coupling between particle and pilot-wave field. We\nfirst introduce a variational framework for generic pilot-wave systems,\nincluding a derivation of particle-wave exchange of Noether currents. We then\nfocus on a particular limit of our system, in which the particle is propelled\nby the local gradient of its pilot wave. In this case, we see that the\nCompton-scale oscillations proposed by de Broglie emerge naturally in the form\nof particle vibrations, and that the vibration modes dynamically adjust to\nmatch the Compton frequency in the rest frame of the particle. The underlying\nfield dynamically changes its radiation patterns in order to satisfy the de\nBroglie relation $p=\\hbar k$ at the particle's position, even as the particle\nmomentum $p$ changes. The wave form and frequency thus evolve so as to conform\nto de Broglie's \"harmony of phases\", even for unsteady particle motion. We show\nthat the particle is always dressed with a Compton-scale Yukawa wavepacket,\nindependent of its trajectory, and that the associated energy imparts a\nconstant increase to the particle's inertial mass. Finally, we see that the\nparticle's wave-induced Compton-scale oscillation gives rise to a classical\nversion of the Heisenberg uncertainty principle.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}