{"id":"2408.04901","title":"CTE-MLO: Continuous-time and Efficient Multi-LiDAR Odometry with\n  Localizability-aware Point Cloud Sampling","authors":"Hongming Shen, Zhenyu Wu, Wei Wang, Qiyang Lyu, Huiqin Zhou, Tianchen\n  Deng, Yeqing Zhu, Danwei Wang","authorsParsed":[["Shen","Hongming",""],["Wu","Zhenyu",""],["Wang","Wei",""],["Lyu","Qiyang",""],["Zhou","Huiqin",""],["Deng","Tianchen",""],["Zhu","Yeqing",""],["Wang","Danwei",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 07:04:19 GMT"}],"updateDate":"2024-08-12","timestamp":1723187059000,"abstract":"  In recent years, LiDAR-based localization and mapping methods have achieved\nsignificant progress thanks to their reliable and real-time localization\ncapability. Considering single LiDAR odometry often faces hardware failures and\ndegradation in practical scenarios, Multi-LiDAR Odometry (MLO), as an emerging\ntechnology, is studied to enhance the performance of LiDAR-based localization\nand mapping systems. However, MLO can suffer from high computational complexity\nintroduced by dense point clouds that are fused from multiple LiDARs, and the\ncontinuous-time measurement characteristic is constantly neglected by existing\nLiDAR odometry. This motivates us to develop a Continuous-Time and Efficient\nMLO, namely CTE-MLO, which can achieve accurate and real-time state estimation\nusing multi-LiDAR measurements through a continuous-time perspective. In this\npaper, the Gaussian process estimation is naturally combined with the Kalman\nfilter, which enables each LiDAR point in a point stream to query the\ncorresponding continuous-time trajectory within its time instants. A\ndecentralized multi-LiDAR synchronization scheme also be devised to combine\npoints from separate LiDARs into a single point cloud without the requirement\nfor primary LiDAR assignment. Moreover, with the aim of improving the real-time\nperformance of MLO without sacrificing robustness, a point cloud sampling\nstrategy is designed with the consideration of localizability. The\neffectiveness of the proposed method is demonstrated through various scenarios,\nincluding public datasets and real-world autonomous driving experiments. The\nresults demonstrate that the proposed CTE-MLO can achieve high-accuracy\ncontinuous-time state estimations in real-time and is demonstratively\ncompetitive compared to other state-of-the-art methods.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}