{"id":"2408.14916","title":"Towards Real-world Event-guided Low-light Video Enhancement and\n  Deblurring","authors":"Taewoo Kim, Jaeseok Jeong, Hoonhee Cho, Yuhwan Jeong, and Kuk-Jin Yoon","authorsParsed":[["Kim","Taewoo",""],["Jeong","Jaeseok",""],["Cho","Hoonhee",""],["Jeong","Yuhwan",""],["Yoon","Kuk-Jin",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 09:44:54 GMT"}],"updateDate":"2024-08-28","timestamp":1724751894000,"abstract":"  In low-light conditions, capturing videos with frame-based cameras often\nrequires long exposure times, resulting in motion blur and reduced visibility.\nWhile frame-based motion deblurring and low-light enhancement have been\nstudied, they still pose significant challenges. Event cameras have emerged as\na promising solution for improving image quality in low-light environments and\naddressing motion blur. They provide two key advantages: capturing scene\ndetails well even in low light due to their high dynamic range, and effectively\ncapturing motion information during long exposures due to their high temporal\nresolution. Despite efforts to tackle low-light enhancement and motion\ndeblurring using event cameras separately, previous work has not addressed both\nsimultaneously. To explore the joint task, we first establish real-world\ndatasets for event-guided low-light enhancement and deblurring using a hybrid\ncamera system based on beam splitters. Subsequently, we introduce an end-to-end\nframework to effectively handle these tasks. Our framework incorporates a\nmodule to efficiently leverage temporal information from events and frames.\nFurthermore, we propose a module to utilize cross-modal feature information to\nemploy a low-pass filter for noise suppression while enhancing the main\nstructural information. Our proposed method significantly outperforms existing\napproaches in addressing the joint task. Our project pages are available at\nhttps://github.com/intelpro/ELEDNet.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"A3p66GfOUiEP6ukpTdEi44exe-gpxn2SPxbXSfTyGnU","pdfSize":"2375643"}
