{"id":"2408.12462","title":"Unveiling the Physics of Core-Collapse Supernovae with the Line Emission\n  Mapper: Observing Cassiopeia A","authors":"S. Orlando, M. Miceli, D.J. Patnaude, P.P. Plucinsky, S.-H. Lee, C.\n  Badenes, H.-T. Janka, A. Wongwathanarat, J. Raymond, M. Sasaki, E. Churazov,\n  I. Khabibullin, F. Bocchino, D. Castro, M. Millard","authorsParsed":[["Orlando","S.",""],["Miceli","M.",""],["Patnaude","D. J.",""],["Plucinsky","P. P.",""],["Lee","S. -H.",""],["Badenes","C.",""],["Janka","H. -T.",""],["Wongwathanarat","A.",""],["Raymond","J.",""],["Sasaki","M.",""],["Churazov","E.",""],["Khabibullin","I.",""],["Bocchino","F.",""],["Castro","D.",""],["Millard","M.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 15:04:33 GMT"}],"updateDate":"2024-08-23","timestamp":1724339073000,"abstract":"  (Abridged) Core-collapse supernova remnants (SNRs) display complex\nmorphologies and asymmetries, reflecting anisotropies from the explosion and\nearly interactions with the circumstellar medium (CSM). Spectral analysis of\nthese remnants can provide critical insights into supernova (SN) engine\ndynamics, the nature of progenitor stars, and the final stages of stellar\nevolution, including mass-loss mechanisms in the millennia leading up to the\nSN.\n  This white paper evaluates the potential of the Line Emission Mapper (LEM),\nan advanced X-ray probe concept proposed in response to NASA 2023 APEX call, to\ndeliver high-resolution spectra of SNRs. Such capabilities would allow detailed\nanalysis of parent SNe and progenitor stars, currently beyond our\npossibilities. We employed a hydrodynamic model that simulates the evolution of\na neutrino-driven SN from core-collapse to a 2000-year-old mature remnant. This\nmodel successfully replicates the large-scale properties of Cassiopeia A at an\nage of about 350 years.\n  Using this model, we synthesized mock LEM spectra from different regions of\nthe SNR, considering factors like line shifts and broadening due to plasma bulk\nmotion and thermal ion motion, deviations from ionization and temperature\nequilibrium, and interstellar medium absorption. Analyzing these mock spectra\nwith standard tools revealed LEM impressive capabilities. We demonstrated that\nfitting these spectra with plasma models accurately recovers the line-of-sight\nvelocity of the ejecta, enabling 3D structure exploration of shocked ejecta,\nsimilar to optical methods. LEM also distinguishes between Doppler and thermal\nbroadening of ion lines and measures ion temperatures near the limb of SNRs,\nproviding insights into ion heating at shock fronts and cooling in post-shock\nflows. This study highlights LEM potential to advance our understanding of\ncore-collapse SN dynamics and related processes.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DnLvKexyU1evdOfGaHRdQrfoqKcQ5bwXmXZ6VTgIzM8","pdfSize":"10053066"}
