{"id":"2408.07613","title":"Rethinking the Key Factors for the Generalization of Remote Sensing\n  Stereo Matching Networks","authors":"Liting Jiang, Feng Wang, Wenyi Zhang, Peifeng Li, Hongjian You, and\n  Yuming Xiang","authorsParsed":[["Jiang","Liting",""],["Wang","Feng",""],["Zhang","Wenyi",""],["Li","Peifeng",""],["You","Hongjian",""],["Xiang","Yuming",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 15:26:10 GMT"}],"updateDate":"2024-08-15","timestamp":1723649170000,"abstract":"  Stereo matching, a critical step of 3D reconstruction, has fully shifted\ntowards deep learning due to its strong feature representation of remote\nsensing images. However, ground truth for stereo matching task relies on\nexpensive airborne LiDAR data, thus making it difficult to obtain enough\nsamples for supervised learning. To improve the generalization ability of\nstereo matching networks on cross-domain data from different sensors and\nscenarios, in this paper, we dedicate to study key training factors from three\nperspectives. (1) For the selection of training dataset, it is important to\nselect data with similar regional target distribution as the test set instead\nof utilizing data from the same sensor. (2) For model structure, cascaded\nstructure that flexibly adapts to different sizes of features is preferred. (3)\nFor training manner, unsupervised methods generalize better than supervised\nmethods, and we design an unsupervised early-stop strategy to help retain the\nbest model with pre-trained weights as the basis. Extensive experiments are\nconducted to support the previous findings, on the basis of which we present an\nunsupervised stereo matching network with good generalization performance. We\nrelease the source code and the datasets at\nhttps://github.com/Elenairene/RKF_RSSM to reproduce the results and encourage\nfuture work.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}