{"id":"2408.15588","title":"Opposition control applied to turbulent wings","authors":"Yuning Wang and Marco Atzori and Ricardo Vinuesa","authorsParsed":[["Wang","Yuning",""],["Atzori","Marco",""],["Vinuesa","Ricardo",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 07:24:52 GMT"}],"updateDate":"2024-08-29","timestamp":1724829892000,"abstract":"  We conducted high-resolution large-eddy simulations (LESs) to explore the\neffects of opposition control (OC) on turbulent boundary layers (TBLs) over a\nwing at a chord-based Reynolds number (${Re}_c$) of 200,000. Two scenarios were\nstudied: flow over the suction sides of the NACA0012 wing section at a\n$0^{\\circ}$ angle of attack, and the NACA4412 wing section at a $5^{\\circ}$\nangle of attack, representing TBLs under mild and strong nonuniform adverse\npressure gradients (APGs), respectively. Our results show that the\neffectiveness of OC in reducing friction drag decreases significantly with\nincreasing APG intensity. This reduction is linked to intensified wall-normal\nconvection caused by the stronger APG. OC, designed to reduce near-wall\nfluctuations, attenuates the outer peak of streamwise velocity fluctuations and\nthe production term of the turbulent kinetic energy budget. We also confirmed\nthe formation of a \"virtual wall,\" where the balance between viscous diffusion\nand dissipation at the virtual wall plane mirrors that at the physical wall.\nSpectral analyses reveal that the wall-normal transport of small-scale\nstructures to the outer region due to the APG negatively impacts OC\nperformance. We also examined uniform blowing and body-force damping as control\nstrategies. Uniform blowing mimics the effects of a stronger APG, while\nbody-force damping shares similarities with OC in the streamwise development of\nthe TBL, despite differences in turbulent statistics. This study is the first\ndetailed analysis of OC applied to TBLs under nonuniform APGs with complex\ngeometries.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}