{"id":"2408.00398","title":"Log Diameter Rounds MST Verification and Sensitivity in MPC","authors":"Sam Coy, Artur Czumaj, Gopinath Mishra, Anish Mukherjee","authorsParsed":[["Coy","Sam",""],["Czumaj","Artur",""],["Mishra","Gopinath",""],["Mukherjee","Anish",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 09:08:03 GMT"}],"updateDate":"2024-08-02","timestamp":1722503283000,"abstract":"  We consider two natural variants of the problem of minimum spanning tree\n(MST) of a graph in the parallel setting: MST verification (verifying if a\ngiven tree is an MST) and the sensitivity analysis of an MST (finding the\nlowest cost replacement edge for each edge of the MST). These two problems have\nbeen studied extensively for sequential algorithms and for parallel algorithms\nin the PRAM model of computation. In this paper, we extend the study to the\nstandard model of Massive Parallel Computation (MPC).\n  It is known that for graphs of diameter $D$, the connectivity problem can be\nsolved in $O(\\log D + \\log\\log n)$ rounds on an MPC with low local memory (each\nmachine can store only $O(n^{\\delta})$ words for an arbitrary constant $\\delta\n> 0$) and with linear global memory, that is, with optimal utilization.\nHowever, for the related task of finding an MST, we need $\\Omega(\\log\nD_{\\text{MST}})$ rounds, where $D_{\\text{MST}}$ denotes the diameter of the\nminimum spanning tree. The state of the art upper bound for MST is $O(\\log n)$\nrounds; the result follows by simulating existing PRAM algorithms. While this\nbound may be optimal for general graphs, the benchmark of connectivity and\nlower bound for MST suggest the target bound of $O(\\log D_{\\text{MST}})$\nrounds, or possibly $O(\\log D_{\\text{MST}} + \\log\\log n)$ rounds. As for now,\nwe do not know if this bound is achievable for the MST problem on an MPC with\nlow local memory and linear global memory. In this paper, we show that two\nnatural variants of the MST problem: MST verification and sensitivity analysis\nof an MST, can be completed in $O(\\log D_T)$ rounds on an MPC with low local\nmemory and with linear global memory; here $D_T$ is the diameter of the input\n``candidate MST'' $T$. The algorithms asymptotically match our lower bound,\nconditioned on the 1-vs-2-cycle conjecture.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"i8e6swTA7Eh2Yfg1cBPzFLAWA4ErQzJE4yvsIqpop9A","pdfSize":"781711"}
