{"id":"2408.05678","title":"Efficient Federated Learning Using Dynamic Update and Adaptive Pruning\n  with Momentum on Shared Server Data","authors":"Ji Liu and Juncheng Jia and Hong Zhang and Yuhui Yun and Leye Wang and\n  Yang Zhou and Huaiyu Dai and Dejing Dou","authorsParsed":[["Liu","Ji",""],["Jia","Juncheng",""],["Zhang","Hong",""],["Yun","Yuhui",""],["Wang","Leye",""],["Zhou","Yang",""],["Dai","Huaiyu",""],["Dou","Dejing",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 02:59:11 GMT"}],"updateDate":"2024-08-13","timestamp":1723345151000,"abstract":"  Despite achieving remarkable performance, Federated Learning (FL) encounters\ntwo important problems, i.e., low training efficiency and limited computational\nresources. In this paper, we propose a new FL framework, i.e., FedDUMAP, with\nthree original contributions, to leverage the shared insensitive data on the\nserver in addition to the distributed data in edge devices so as to efficiently\ntrain a global model. First, we propose a simple dynamic server update\nalgorithm, which takes advantage of the shared insensitive data on the server\nwhile dynamically adjusting the update steps on the server in order to speed up\nthe convergence and improve the accuracy. Second, we propose an adaptive\noptimization method with the dynamic server update algorithm to exploit the\nglobal momentum on the server and each local device for superior accuracy.\nThird, we develop a layer-adaptive model pruning method to carry out specific\npruning operations, which is adapted to the diverse features of each layer so\nas to attain an excellent trade-off between effectiveness and efficiency. Our\nproposed FL model, FedDUMAP, combines the three original techniques and has a\nsignificantly better performance compared with baseline approaches in terms of\nefficiency (up to 16.9 times faster), accuracy (up to 20.4% higher), and\ncomputational cost (up to 62.6% smaller).\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"awH9fB_f4hp-66HSQnd9A_nt4i4CzISPaTa14hGi2Ig","pdfSize":"2327419"}
