{"id":"2408.13999","title":"Variations in the Inferred Cosmic-Ray Spectral Index as Measured by\n  Neutron Monitors in Antarctica","authors":"Pradiphat Muangha (1), David Ruffolo (1), Alejandro S\\'aiz (1),\n  Chanoknan Banglieng (2), Paul Evenson (3), Surujhdeo Seunarine (4), Suyeon Oh\n  (5), Jongil Jung (6), Marc Duldig (7), and John Humble (7) ((1) Department of\n  Physics, Faculty of Science, Mahidol University, Bangkok, Thailand, (2)\n  Division of Physics, Faculty of Science and Technology, Rajamangala\n  University of Technology Thanyaburi, Pathum Thani, Thailand, (3) Department\n  of Physics and Astronomy, University of Delaware, Newark, DE, (4) Department\n  of Physics, University of Wisconsin River Falls, River Falls, WI, (5)\n  Department of Earth Science Education, Chonnam National University, Gwangju,\n  South Korea, (6) Korea Astronomy and Space Science Institute, Daejeon, South\n  Korea, (7) School of Natural Sciences, University of Tasmania, Hobart,\n  Tasmania, Australia)","authorsParsed":[["Muangha","Pradiphat",""],["Ruffolo","David",""],["Sáiz","Alejandro",""],["Banglieng","Chanoknan",""],["Evenson","Paul",""],["Seunarine","Surujhdeo",""],["Oh","Suyeon",""],["Jung","Jongil",""],["Duldig","Marc",""],["Humble","John",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 03:55:21 GMT"}],"updateDate":"2024-08-27","timestamp":1724644521000,"abstract":"  A technique has recently been developed for tracking short-term spectral\nvariations in Galactic cosmic rays (GCRs) using data from a single neutron\nmonitor (NM), by collecting histograms of the time delay between successive\nneutron counts and extracting the leader fraction $L$ as a proxy of the\nspectral index. Here we analyze $L$ from four Antarctic NMs during 2015 March\nto 2023 September. We have calibrated $L$ from the South Pole NM with respect\nto a daily spectral index determined from published data of GCR proton fluxes\nduring 2015--2019 from the Alpha Magnetic Spectrometer (AMS-02) aboard the\nInternational Space Station. Our results demonstrate a robust correlation\nbetween the leader fraction and the spectral index fit over the rigidity range\n2.97--16.6 GV for AMS-02 data, with uncertainty 0.018 in the daily spectral\nindex as inferred from $L$. In addition to the 11-year solar activity cycle, a\nwavelet analysis confirms a 27-day periodicity in the GCR flux and spectral\nindex corresponding to solar rotation, especially near sunspot minimum, while\nthe flux occasionally exhibited a strong harmonic at 13.5 days, and that the\nmagnetic field component along a nominal Parker spiral (i.e., the magnetic\nsector structure) is a strong determinant of such spectral and flux variations,\nwith the solar wind speed exerting an additional, nearly rigidity-independent\ninfluence on flux variations. Our investigation affirms the capability of\nground-based NM stations to accurately and continuously monitor cosmic ray\nspectral variations in the long-term future.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}