{"id":"2408.01512","title":"Frustrated hopping from orbital decoration of a primitive\n  two-dimensional lattice","authors":"Aravind Devarakonda, Christie S. Koay, Daniel G. Chica, Morgan Thinel,\n  Asish K. Kundu, Zhi Lin, Alexandru B. Georgescu, Sebastian Rossi, Sae Young\n  Han, Michael E. Ziebel, Madisen A. Holbrook, Anil Rajapitamahuni, Elio\n  Vescovo, K. Watanabe, T. Taniguchi, Milan Delor, Xiaoyang Zhu, Abhay N.\n  Pasupathy, Raquel Queiroz, Cory R. Dean, and Xavier Roy","authorsParsed":[["Devarakonda","Aravind",""],["Koay","Christie S.",""],["Chica","Daniel G.",""],["Thinel","Morgan",""],["Kundu","Asish K.",""],["Lin","Zhi",""],["Georgescu","Alexandru B.",""],["Rossi","Sebastian",""],["Han","Sae Young",""],["Ziebel","Michael E.",""],["Holbrook","Madisen A.",""],["Rajapitamahuni","Anil",""],["Vescovo","Elio",""],["Watanabe","K.",""],["Taniguchi","T.",""],["Delor","Milan",""],["Zhu","Xiaoyang",""],["Pasupathy","Abhay N.",""],["Queiroz","Raquel",""],["Dean","Cory R.",""],["Roy","Xavier",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 18:09:51 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 16:37:37 GMT"}],"updateDate":"2024-08-07","timestamp":1722622191000,"abstract":"  Materials hosting flat electronic bands are a central focus of condensed\nmatter physics as promising venues for novel electronic ground states.\nTwo-dimensional (2D) geometrically frustrated lattices such as the kagome,\ndice, and Lieb lattices are attractive targets in this direction, anticipated\nto realize perfectly flat bands. Synthesizing these special structures,\nhowever, poses a formidable challenge, exemplified by the absence of\nsolid-state materials realizing the dice and Lieb lattices. An alternative\nroute leverages atomic orbitals to create the characteristic electron hopping\nof geometrically frustrated lattices. This strategy promises to expand the list\nof candidate materials to simpler structures, but is yet to be demonstrated\nexperimentally. Here, we report the realization of frustrated hopping in the\nvan der Waals (vdW) intermetallic Pd$_5$AlI$_2$, emerging from orbital\ndecoration of a primitive square lattice. Using angle-resolved photoemission\nspectroscopy and quantum oscillations measurements, we demonstrate that the\nband structure of Pd$_5$AlI$_2$ includes linear Dirac-like bands intersected at\ntheir crossing point by a flat band, essential characteristics of frustrated\nhopping in the Lieb and dice lattices. Moreover, Pd$_5$AlI$_2$ is exceptionally\nstable, with the unusual bulk band structure and metallicity persisting in\nambient conditions down to the monolayer limit. Our ability to realize an\nelectronic structure characteristic of geometrically frustrated lattices\nestablishes orbital decoration of primitive lattices as a new approach towards\nelectronic structures that remain elusive to prevailing lattice-centric\nsearches.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}