{"id":"2408.04991","title":"Searching for blue in the dark","authors":"Jessie de Kruijf, Eleonora Vanzan, Kimberly K. Boddy, Alvise\n  Raccanelli, Nicola Bartolo","authorsParsed":[["de Kruijf","Jessie",""],["Vanzan","Eleonora",""],["Boddy","Kimberly K.",""],["Raccanelli","Alvise",""],["Bartolo","Nicola",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 10:50:18 GMT"}],"updateDate":"2024-08-12","timestamp":1723200618000,"abstract":"  The primordial power spectrum of curvature perturbations has been\nwell-measured on large scales but remains fairly unconstrained at smaller\nscales, where significant deviations from $\\Lambda$CDM may occur. Measurements\nof 21-cm intensity mapping in the dark ages promise to access very small scales\nthat have yet to be probed, extending beyond the reach of CMB and galaxy\nsurveys. In this paper, we investigate how small-scale power-law enhancements\n-- or blue tilts -- of the primordial power spectrum affect the 21-cm power\nspectrum. We consider generic enhancements due to curvature modes, isocurvature\nmodes, and runnings of the spectral tilt. We present forecasts for Earth- and\nlunar-based instruments to detect a blue-tilted primordial spectrum. We find\nthat an Earth-based instrument capable of reaching the dark ages could detect\nany enhancements of power on nearly all the scales it can observe, which\ndepends on the baseline of the interferometer. The smallest scales observed by\nsuch an instrument can only detect a very strong enhancement. However, an\ninstrument on the far side of the Moon of the same size would be able to probe\nshallower slopes with higher precision. We forecast results for instruments\nwith $100 \\, {\\rm km} \\, (3000 \\, {\\rm km})$ baselines and find that they can\nprobe up to scales of order $k_{\\rm max} \\sim 8 \\, {\\rm Mpc}^{-1} \\, (k_{\\rm\nmax} \\sim 250 \\, {\\rm Mpc}^{-1})$, thereby providing invaluable information on\nexotic physics and testing inflationary models on scales not otherwise\naccessible.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}