{"id":"2408.13631","title":"Ancient but Digitized: Developing Handwritten Optical Character\n  Recognition for East Syriac Script Through Creating KHAMIS Dataset","authors":"Ameer Majeed and Hossein Hassani","authorsParsed":[["Majeed","Ameer",""],["Hassani","Hossein",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 17:17:46 GMT"}],"updateDate":"2024-08-27","timestamp":1724519866000,"abstract":"  Many languages have vast amounts of handwritten texts, such as ancient\nscripts about folktale stories and historical narratives or contemporary\ndocuments and letters. Digitization of those texts has various applications,\nsuch as daily tasks, cultural studies, and historical research. Syriac is an\nancient, endangered, and low-resourced language that has not received the\nattention it requires and deserves. This paper reports on a research project\naimed at developing a optical character recognition (OCR) model based on the\nhandwritten Syriac texts as a starting point to build more digital services for\nthis endangered language. A dataset was created, KHAMIS (inspired by the East\nSyriac poet, Khamis bar Qardahe), which consists of handwritten sentences in\nthe East Syriac script. We used it to fine-tune the Tesseract-OCR engine's\npretrained Syriac model on handwritten data. The data was collected from\nvolunteers capable of reading and writing in the language to create KHAMIS.\nKHAMIS currently consists of 624 handwritten Syriac sentences collected from 31\nuniversity students and one professor, and it will be partially available\nonline and the whole dataset available in the near future for development and\nresearch purposes. As a result, the handwritten OCR model was able to achieve a\ncharacter error rate of 1.097-1.610% and 8.963-10.490% on both training and\nevaluation sets, respectively, and both a character error rate of 18.89-19.71%\nand a word error rate of 62.83-65.42% when evaluated on the test set, which is\ntwice as better than the default Syriac model of Tesseract.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}