{"id":"2408.15969","title":"Stability of Primal-Dual Gradient Flow Dynamics for Multi-Block Convex\n  Optimization Problems","authors":"Ibrahim K. Ozaslan, Panagiotis Patrinos, Mihailo R. Jovanovi\\'c","authorsParsed":[["Ozaslan","Ibrahim K.",""],["Patrinos","Panagiotis",""],["Jovanović","Mihailo R.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 17:43:18 GMT"}],"updateDate":"2024-08-29","timestamp":1724866998000,"abstract":"  We examine stability properties of primal-dual gradient flow dynamics for\ncomposite convex optimization problems with multiple, possibly nonsmooth, terms\nin the objective function under the generalized consensus constraint. The\nproposed dynamics are based on the proximal augmented Lagrangian and they\nprovide a viable alternative to ADMM which faces significant challenges from\nboth analysis and implementation viewpoints in large-scale multi-block\nscenarios. In contrast to customized algorithms with individualized convergence\nguarantees, we provide a systematic approach for solving a broad class of\nchallenging composite optimization problems. We leverage various structural\nproperties to establish global (exponential) convergence guarantees for the\nproposed dynamics. Our assumptions are much weaker than those required to prove\n(exponential) stability of various primal-dual dynamics as well as (linear)\nconvergence of discrete-time methods, e.g., standard two-block and multi-block\nADMM and EXTRA algorithms. Finally, we show necessity of some of our structural\nassumptions for exponential stability and provide computational experiments to\ndemonstrate the convenience of the proposed dynamics for parallel and\ndistributed computing applications.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"f0jWrGcuZdv0RuvnHzsTjsmo12nIwrS_Yl5m5fr-LpE","pdfSize":"872570"}
