{"id":"2408.02722","title":"Generalized Quantum Stein's Lemma and Second Law of Quantum Resource\n  Theories","authors":"Masahito Hayashi, Hayata Yamasaki","authorsParsed":[["Hayashi","Masahito",""],["Yamasaki","Hayata",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-07","timestamp":1722880800000,"abstract":"  The second law of thermodynamics is the cornerstone of physics,\ncharacterizing the convertibility between thermodynamic states through a single\nfunction, entropy. Given the universal applicability of thermodynamics, a\nfundamental question in quantum information theory is whether an analogous\nsecond law can be formulated to characterize the convertibility of resources\nfor quantum information processing by such a single function. In 2008, a\npromising formulation was proposed, linking resource convertibility to the\noptimal performance of a variant of the quantum version of hypothesis testing.\nCentral to this formulation was the generalized quantum Stein's lemma, which\naimed to characterize this optimal performance by a measure of quantum\nresources, the regularized relative entropy of resource. If proven valid, the\ngeneralized quantum Stein's lemma would lead to the second law for quantum\nresources, with the regularized relative entropy of resource taking the role of\nentropy in thermodynamics. However, in 2023, a logical gap was found in the\noriginal proof of this lemma, casting doubt on the possibility of such a\nformulation of the second law. In this work, we address this problem by\ndeveloping alternative techniques and successfully proving the generalized\nquantum Stein's lemma. Based on our proof, we reestablish and extend the\nformulation of quantum resource theories with the second law, applicable to\nboth static and dynamical resources. These results resolve the fundamental\nproblem of bridging the analogy between thermodynamics and quantum information\ntheory.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}