{"id":"2408.08089","title":"AgentCourt: Simulating Court with Adversarial Evolvable Lawyer Agents","authors":"Guhong Chen, Liyang Fan, Zihan Gong, Nan Xie, Zixuan Li, Ziqiang Liu,\n  Chengming Li, Qiang Qu, Shiwen Ni, Min Yang","authorsParsed":[["Chen","Guhong",""],["Fan","Liyang",""],["Gong","Zihan",""],["Xie","Nan",""],["Li","Zixuan",""],["Liu","Ziqiang",""],["Li","Chengming",""],["Qu","Qiang",""],["Ni","Shiwen",""],["Yang","Min",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 11:33:20 GMT"}],"updateDate":"2024-08-16","timestamp":1723721600000,"abstract":"  In this paper, we present a simulation system called AgentCourt that\nsimulates the entire courtroom process. The judge, plaintiff's lawyer, defense\nlawyer, and other participants are autonomous agents driven by large language\nmodels (LLMs). Our core goal is to enable lawyer agents to learn how to argue a\ncase, as well as improving their overall legal skills, through courtroom\nprocess simulation. To achieve this goal, we propose an adversarial\nevolutionary approach for the lawyer-agent. Since AgentCourt can simulate the\noccurrence and development of court hearings based on a knowledge base and LLM,\nthe lawyer agents can continuously learn and accumulate experience from real\ncourt cases. The simulation experiments show that after two lawyer-agents have\nengaged in a thousand adversarial legal cases in AgentCourt (which can take a\ndecade for real-world lawyers), compared to their pre-evolutionary state, the\nevolved lawyer agents exhibit consistent improvement in their ability to handle\nlegal tasks. To enhance the credibility of our experimental results, we\nenlisted a panel of professional lawyers to evaluate our simulations. The\nevaluation indicates that the evolved lawyer agents exhibit notable\nadvancements in responsiveness, as well as expertise and logical rigor. This\nwork paves the way for advancing LLM-driven agent technology in legal\nscenarios. Code is available at https://github.com/relic-yuexi/AgentCourt.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}