{"id":"2408.17141","title":"Excitation and spatial study of a prestellar cluster towards\n  G+0.693-0.027 in the Galactic centre","authors":"L. Colzi, J. Mart\\'in-Pintado, S. Zeng, I. Jim\\'enez-Serra, V. M.\n  Rivilla, M. Sanz-Novo, S. Mart\\'in, Q. Zhang, X. Lu","authorsParsed":[["Colzi","L.",""],["Martín-Pintado","J.",""],["Zeng","S.",""],["Jiménez-Serra","I.",""],["Rivilla","V. M.",""],["Sanz-Novo","M.",""],["Martín","S.",""],["Zhang","Q.",""],["Lu","X.",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 09:29:15 GMT"}],"updateDate":"2024-09-02","timestamp":1725010155000,"abstract":"  Star formation in the central molecular zone (CMZ) is suppressed with respect\nto that of the Galactic disk, and this is likely related to its high turbulent\nenvironment. This turbulence impedes the potential detection of prestellar\ncores. We present the temperature, density, and spatial structure of the CMZ\nmolecular cloud G+0.693-0.027, which has been proposed to host a prestellar\ncluster in the Sgr B2 region. We analysed multiple HC$_{3}$N rotational\ntransitions that were observed with the IRAM 30m, APEX, Yebes 40m, and GBT\nradio telescopes, together with SMA+APEX spatially resolved maps. The spectral\nshape of HC$_{3}$N lines shows three velocity components: a broad component\nwith a line width of 23 km s$^{-1}$ (C1), and two narrow components with line\nwidths of 7.2 and 8.8 km s$^{-1}$ (C2 and C3). This suggests that a fraction of\nthe molecular gas in this cloud is undergoing turbulence dissipation. From a\nnon-local thermodynamic equilibrium analysis we have found H$_{2}$ densities of\n2$\\times$10$^{4}$ cm$^{-3}$, 5$\\times$10$^{4}$ cm$^{-3}$, and 4$\\times$10$^{5}$\ncm$^{-3}$ and kinetic temperatures of 140 K, 30 K, and 80 K for C1, C2, and C3,\nrespectively. The spatially resolved maps confirm that the colder and\nhigh-density condensations C2 and C3, which peak in the 70-85 km s$^{-1}$\nvelocity range, are embedded in a more diffuse and warmer gas (C1). The\nlarger-scale structure of the Sgr B2 region shows a hole at 40-50 km s$^{-1}$\nthat is likely due to a small cloud that shocked the Sgr B2 region and is\nspatially related with a massive cloud at 60-80 km s$^{-1}$. We propose that\nthe impacting small cloud sequentially triggered the formation of Sgr B2(M),\n(N), and (S) and the condensations in G+0.693-0.027 during its passage. Based\non the analysis of the masses of the two condensations and on the virial\nparameters, C2 might expand, while C3 might further fragment or collapse.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}