{"id":"2408.12336","title":"Laboratory x-ray nano-computed tomography for biomedical research","authors":"Till Dreier (1 and 2), Robin Kr\\\"uger (1), Gustaf Bernstr\\\"om (3),\n  Karin Tran-Lundmark (3 and 4 and 5), Isabel Gon\\c{c}alves (6), Martin Bech\n  (1) ((1) Lund University Department of Medical Radiation Physics, (2)\n  Excillum AB, (3) Lund University Department of Experimental Medical Science,\n  (4) Lund University Wallenberg Center for Molecular Medicine, (5) The\n  Pediatric Heart Center, Sk{\\aa}ne University Hospital, (6) Cardiology,\n  Sk{\\aa}ne University Hospital, (7) LINXS Institute for Advanced X-ray and\n  Neutron Science)","authorsParsed":[["Dreier","Till","","1 and 2"],["Krüger","Robin","","3 and 4 and 5"],["Bernström","Gustaf","","3 and 4 and 5"],["Tran-Lundmark","Karin","","3 and 4 and 5"],["Gonçalves","Isabel",""],["Bech","Martin",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 12:23:10 GMT"}],"updateDate":"2024-08-23","timestamp":1724329390000,"abstract":"  High-resolution x-ray tomography is a common technique for biomedical\nresearch using synchrotron sources. With advancements in laboratory x-ray\nsources, an increasing number of experiments can be performed in the lab. In\nthis paper, the design, implementation, and verification of a laboratory setup\nfor x-ray nano-computed tomography is presented using a nano-focus x-ray source\nand high geometric magnification not requiring any optical elements. Comparing\na scintillator-based detector to a photon counting detector shows a clear\nbenefit of using photon counting detectors for these applications, where the\nflux of the x-ray source is limited and samples have low contrast. Sample\ncontrast is enhanced using propagation-based phase contrast. The resolution of\nthe system is verified using 2D resolution charts and using Fourier Ring\nCorrelation on reconstructed CT slices. Evaluating noise and contrast\nhighlights the benefits of photon counting detectors and the contrast\nimprovement through phase contrast. The implemented setup is capable of\nreaching sub-micron resolution and satisfying contrast in biological samples,\nlike paraffin embedded tissue.\n","subjects":["Physics/Instrumentation and Detectors","Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}