{"id":"2408.13680","title":"Modeling Spitzer 3.6 and 4.5 $\\mu$m Eclipse Depths for the Inflated Hot\n  Jupiter in the Evolved Binary System HD 202772","authors":"Arthur D. Adams, Kimberly Bott, Paul A. Dalba, Tara Fetherolf, Stephen\n  R. Kane, Ian Crossfield, Drake Deming, Diana Dragomir, Varoujan Gorjian,\n  Laura Kreidberg, Farisa Y. Morales and Michael W. Werner","authorsParsed":[["Adams","Arthur D.",""],["Bott","Kimberly",""],["Dalba","Paul A.",""],["Fetherolf","Tara",""],["Kane","Stephen R.",""],["Crossfield","Ian",""],["Deming","Drake",""],["Dragomir","Diana",""],["Gorjian","Varoujan",""],["Kreidberg","Laura",""],["Morales","Farisa Y.",""],["Werner","Michael W.",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 22:15:29 GMT"}],"updateDate":"2024-08-27","timestamp":1724537729000,"abstract":"  As an inflated Hot Jupiter orbiting an early-type primary star in the evolved\nbinary HD 202772 system, HD 202772 A b's presence invites a study of how such a\nplanet forms and evolves. As a prelude to potential atmospheric\ncharacterization with the latest generation of observatories, we present a\nreduction and analysis of eclipse light curve observations of HD 202772 A b\nacquired with the Spitzer Space Telescope using the 3.6 and 4.5 $\\mu$m\nchannels. We find eclipse depths of $680\\pm68$ and $1081^{+54}_{-53}$ ppm,\nrespectively, corresponding to day-side effective temperatures of\n$2130^{+102}_{-91}$ and $2611^{+46}_{-49}$ K. The corresponding Bond albedos\nare consistent with the distribution of albedos for Hot Jupiters observed with\nboth Spitzer and TESS. The heat redistribution efficiencies consistent with the\nBond albedo range predicted by 1-D atmospheric models in radiative-convective\nequilibrium are $0.71\\pm0.10$ and $0.03^{+0.03}_{-0.02}$, respectively,\nindicating a weak day-night contrast for the former and a strong contrast for\nthe latter. Given this, and the unique environment in which this planet\nresides, we recommend follow-up observations with JWST to more precisely\nconstrain its atmospheric composition and structure, as well as its host\nstellar environment, to elucidate if and how the atmospheres of these close-in\ngiants evolve with host stars in binaries past the main sequence.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}