{"id":"2408.13215","title":"Morphology of 137 Fast Radio Bursts down to Microseconds Timescales from\n  The First CHIME/FRB Baseband Catalog","authors":"Ketan R. Sand, Alice P. Curtin, Daniele Michilli, Victoria M. Kaspi,\n  Emmanuel Fonseca, Kenzie Nimmo, Ziggy Pleunis, Kaitlyn Shin, Mohit Bhardwaj,\n  Charanjot Brar, Matt Dobbs, Gwendolyn Eadie, B.M. Gaensler, Ronniy C. Joseph,\n  Calvin Leung, Robert Main, Kiyoshi W. Masui, Ryan Mckinven, Ayush Pandhi,\n  Aaron B. Pearlman, Masoud Rafiei-Ravandi, Mawson W. Sammons, Kendrick Smith,\n  Ingrid H. Stairs","authorsParsed":[["Sand","Ketan R.",""],["Curtin","Alice P.",""],["Michilli","Daniele",""],["Kaspi","Victoria M.",""],["Fonseca","Emmanuel",""],["Nimmo","Kenzie",""],["Pleunis","Ziggy",""],["Shin","Kaitlyn",""],["Bhardwaj","Mohit",""],["Brar","Charanjot",""],["Dobbs","Matt",""],["Eadie","Gwendolyn",""],["Gaensler","B. M.",""],["Joseph","Ronniy C.",""],["Leung","Calvin",""],["Main","Robert",""],["Masui","Kiyoshi W.",""],["Mckinven","Ryan",""],["Pandhi","Ayush",""],["Pearlman","Aaron B.",""],["Rafiei-Ravandi","Masoud",""],["Sammons","Mawson W.",""],["Smith","Kendrick",""],["Stairs","Ingrid H.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 16:46:42 GMT"}],"updateDate":"2024-08-26","timestamp":1724431602000,"abstract":"  We present a spectro-temporal analysis of 137 fast radio bursts (FRBs) from\nthe first CHIME/FRB baseband catalog, including 125 one-off bursts and 12\nrepeat bursts, down to microsecond resolution using the least-squares\noptimization fitting routine: fitburst. Our measured values are compared with\nthose in the first CHIME/FRB intensity catalog, revealing that nearly one-third\nof our sample exhibits additional burst components at higher time resolutions.\nWe measure sub-burst components within burst envelopes as narrow as $\\sim$23\n$\\mu$s (FWHM), with 20% of the sample displaying sub-structures narrower than\n100 $\\mu$s, offering constraints on emission mechanisms. Scattering timescales\nin the sample range from 30 $\\mu$s to 13 ms at 600 MHz. We observe no\ncorrelations between scattering time and dispersion measure, rotation measure,\nor linear polarization fraction, with the latter suggesting that depolarization\ndue to multipath propagation is negligible in our sample. Bursts with narrower\nenvelopes ($\\leq$ 1 ms) in our sample exhibit higher flux densities, indicating\nthe potential presence of sub-ms FRBs that are being missed by our real-time\nsystem below a brightness threshold. Most multicomponent bursts in our sample\nexhibit sub-burst separations of $\\leq$ 1 ms, with no bursts showing\nseparations $<$41 $\\mu$s, even at a time resolution of 2.56 $\\mu$s, but both\nscattering and low signal-to-noise ratio can hinder detection of additional\ncomponents. Lastly, given the morphological diversity of our sample, we suggest\nthat one-off and repeating FRBs can come from different classes but have\noverlapping property distributions.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jC6_tbUpPX-dGOHfSjgkf9ijm4-CS8bfVIvpfMtkqes","pdfSize":"5688426"}
