{"id":"2408.02534","title":"Quantifying the coincidence between gravitational waves and fast radio\n  bursts from neutron star--black hole mergers","authors":"Teagan A. Clarke, Nikhil Sarin, Eric J. Howell, Paul D. Lasky, Eric\n  Thrane","authorsParsed":[["Clarke","Teagan A.",""],["Sarin","Nikhil",""],["Howell","Eric J.",""],["Lasky","Paul D.",""],["Thrane","Eric",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 15:04:08 GMT"}],"updateDate":"2024-08-06","timestamp":1722870248000,"abstract":"  Fast radio bursts (FRBs) are mysterious astrophysical transients whose origin\nand mechanism remain unclear. Compact object mergers may be a promising channel\nto produce some FRBs. Neutron star-black hole (NSBH) mergers could produce FRBs\nthrough mechanisms involving neutron star tidal disruption or magnetospheric\ndisturbances. This could present an opportunity for multi-messenger\ngravitational-wave observations, providing new insight into the nature of FRBs\nand nuclear matter. However, some of the gravitational-wave signals may be\nmarginal detections with signal-to-noise ratios < 8 or have large sky location\nand distance uncertainties, making it less straightforward to confidently\nassociate an FRB with the gravitational-wave signal. One must therefore take\ncare to avoid a false positive association. We demonstrate how to do this with\nsimulated data. We calculate the posterior odds -- a measurement of our\nrelative belief for a common versus unrelated origin of a coincident NSBH and\nFRB. We find that a coincident FRB+NSBH from a common source can yield a\nstatistically significant posterior odds in a network with at least two\nobservatories, but only if we require a coincidence in time and and sky\nlocation, rather than time alone. However, we find that for our model, we\nrequire a network signal-to-noise ratio greater than 10 to be confident in the\ncommon-source detection, when using a threshold of ln odds > 8. We suggest that\na coincident NSBH+FRB detection could help distinguish between FRB engines by\ndiscriminating between disrupting and non-disrupting models.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}