{"id":"2408.10771","title":"SSL-TTS: Leveraging Self-Supervised Embeddings and kNN Retrieval for\n  Zero-Shot Multi-speaker TTS","authors":"Karl El Hajal, Ajinkya Kulkarni, Enno Hermann, Mathew Magimai.-Doss","authorsParsed":[["Hajal","Karl El",""],["Kulkarni","Ajinkya",""],["Hermann","Enno",""],["-Doss","Mathew Magimai.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 12:09:58 GMT"}],"updateDate":"2024-08-21","timestamp":1724155798000,"abstract":"  While recent zero-shot multispeaker text-to-speech (TTS) models achieve\nimpressive results, they typically rely on extensive transcribed speech\ndatasets from numerous speakers and intricate training pipelines. Meanwhile,\nself-supervised learning (SSL) speech features have emerged as effective\nintermediate representations for TTS. It was also observed that SSL features\nfrom different speakers that are linearly close share phonetic information\nwhile maintaining individual speaker identity, which enables straight-forward\nand robust voice cloning. In this study, we introduce SSL-TTS, a lightweight\nand efficient zero-shot TTS framework trained on transcribed speech from a\nsingle speaker. SSL-TTS leverages SSL features and retrieval methods for simple\nand robust zero-shot multi-speaker synthesis. Objective and subjective\nevaluations show that our approach achieves performance comparable to\nstate-of-the-art models that require significantly larger training datasets.\nThe low training data requirements mean that SSL-TTS is well suited for the\ndevelopment of multi-speaker TTS systems for low-resource domains and\nlanguages. We also introduce an interpolation parameter which enables fine\ncontrol over the output speech by blending voices. Demo samples are available\nat https://idiap.github.io/ssl-tts\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Sound"],"license":"http://creativecommons.org/licenses/by/4.0/"}