{"id":"2408.12465","title":"Water flow model on vegetated hillslopes with erosion","authors":"Stelian Ion, Dorin Marinescu, Stefan-Gicu Cruceanu","authorsParsed":[["Ion","Stelian",""],["Marinescu","Dorin",""],["Cruceanu","Stefan-Gicu",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 15:06:18 GMT"}],"updateDate":"2024-08-23","timestamp":1724339178000,"abstract":"  The water circulation in the Soil-Plant-Atmosphere continuum and particularly\nthe soil erosion induced by water are problems of main concern in the new era\nof climate change. The present paper aims to provide a mathematical tool to\ninvestigate the water-soil and water-plant interactions involved in the complex\nprocess of water flow on plant-covered soil surfaces. Basically, the\nmathematical model consists of an extended Saint-Venant system of equations for\nwater flow coupled with Hairsine-Rose equations for soil erosion. The classical\nSaint-Venant model is thus modified in order to take into account the presence\nof plants on the soil surface. On the premise that the model adequately\nreflects the essence of the reality, a series of numerical experiments are\nperformed to analyze the plant induced effects on water dynamics and soil\nerosion intensity.\n  Given that both, the mathematical model and the accompanying software are\nflexible enough to reflect the variability of the environmental variables such\nas soil structure, soil surface roughness, or plant cover structure, each\nnumerical experiment is constructed as an image of a target hydrological\ncontext. The dam break problem, flash floods, water-induced soil erosion in a\ncatchment basin are all subjects of numerical analysis. It is shown that the\npresence of the plant cover drastically modifies the water dynamics and the\ndistribution of the soil eroded particles and one can quantitatively evaluate\nsuch effects. The methods described in the paper can also help one to manage\nthe environmental resources in order to avoid the water induced disasters.\n","subjects":["Physics/Fluid Dynamics","Mathematics/Dynamical Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}