{"id":"2408.14206","title":"Lemon and Orange Disease Classification using CNN-Extracted Features and\n  Machine Learning Classifier","authors":"Khandoker Nosiba Arifin, Sayma Akter Rupa, Md Musfique Anwar and Israt\n  Jahan","authorsParsed":[["Arifin","Khandoker Nosiba",""],["Rupa","Sayma Akter",""],["Anwar","Md Musfique",""],["Jahan","Israt",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 12:09:38 GMT"}],"updateDate":"2024-08-28","timestamp":1724674178000,"abstract":"  Lemons and oranges, both are the most economically significant citrus fruits\nglobally. The production of lemons and oranges is severely affected due to\ndiseases in its growth stages. Fruit quality has degraded due to the presence\nof flaws. Thus, it is necessary to diagnose the disease accurately so that we\ncan avoid major loss of lemons and oranges. To improve citrus farming, we\nproposed a disease classification approach for lemons and oranges. This\napproach would enable early disease detection and intervention, reduce yield\nlosses, and optimize resource allocation. For the initial modeling of disease\nclassification, the research uses innovative deep learning architectures such\nas VGG16, VGG19 and ResNet50. In addition, for achieving better accuracy, the\nbasic machine learning algorithms used for classification problems include\nRandom Forest, Naive Bayes, K-Nearest Neighbors (KNN) and Logistic Regression.\nThe lemon and orange fruits diseases are classified more accurately (95.0% for\nlemon and 99.69% for orange) by the model. The model's base features were\nextracted from the ResNet50 pre-trained model and the diseases are classified\nby the Logistic Regression which beats the performance given by VGG16 and VGG19\nfor other classifiers. Experimental outcomes show that the proposed model also\noutperforms existing models in which most of them classified the diseases using\nthe Softmax classifier without using any individual classifiers.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}