{"id":"2408.03722","title":"Improving the Intelligent Driver Model by Incorporating Vehicle\n  Dynamics: Microscopic Calibration and Macroscopic Validation","authors":"Dominik Salles, Steve Oswald, Hans-Christian Reuss","authorsParsed":[["Salles","Dominik",""],["Oswald","Steve",""],["Reuss","Hans-Christian",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 12:19:28 GMT"}],"updateDate":"2024-08-08","timestamp":1723033168000,"abstract":"  Microscopic traffic simulations are used to evaluate the impact of\ninfrastructure modifications and evolving vehicle technologies, such as\nconnected and automated driving. Simulated vehicles are controlled via\ncar-following, lane-changing and junction models, which are designed to imitate\nhuman driving behavior. However, physics-based car-following models (CFMs)\ncannot fully replicate measured vehicle trajectories. Therefore, we present\nmodel extensions for the Intelligent Driver Model (IDM), of which some are\nalready included in the Extended Intelligent Driver Model (EIDM), to improve\ncalibration and validation results. They consist of equations based on vehicle\ndynamics and drive off procedures. In addition, parameter selection plays a\ndecisive role. Thus, we introduce a framework to calibrate CFMs using drone\ndata captured at a signalized intersection in Stuttgart, Germany. We compare\nthe calibration error of the Krauss Model with the IDM and EIDM. In this setup,\nthe EIDM achieves a 17.78 % lower mean error than the IDM, based on the\ndistance difference between real world and simulated vehicles. Adding vehicle\ndynamics equations to the EIDM further improves the results by an additional\n18.97 %. The calibrated vehicle-driver combinations are then investigated by\nsimulating the traffic in three different scenarios: at the original\nintersection, in a closed loop and in a stop-and-go wave. The data shows that\nthe improved calibration process of individual vehicles, openly available at\nhttps://www.github.com/stepeos/pycarmodel_calibration, also provides more\naccurate macroscopic results.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}