{"id":"2408.06925","title":"Enhancing Material Screening at Boulby Underground Laboratory with XIA\n  UltraLo-1800 Alpha Particle Detectors","authors":"Sid El Moctar Ahmed Maouloud, James Edward Young Dobson, Chamkaur\n  Ghag, L\\'ena Le Floch, XinRan Liu, Emma Meehan, Alexander St. John Murphy,\n  Anh Nguyen, Sean Paling, Ruben Saakyan, Paul Robert Scovell, Christopher Toth","authorsParsed":[["Maouloud","Sid El Moctar Ahmed",""],["Dobson","James Edward Young",""],["Ghag","Chamkaur",""],["Floch","Léna Le",""],["Liu","XinRan",""],["Meehan","Emma",""],["Murphy","Alexander St. John",""],["Nguyen","Anh",""],["Paling","Sean",""],["Saakyan","Ruben",""],["Scovell","Paul Robert",""],["Toth","Christopher",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 14:22:20 GMT"}],"updateDate":"2024-08-14","timestamp":1723558940000,"abstract":"  The Boulby UnderGround Screening (BUGS) facility, located at the Boulby\nUnderground Laboratory, has significantly advanced its material screening\ncapabilities by installing two XIA UltraLo-1800 alpha particle detectors. This\nstudy presents a comprehensive evaluation of one of these detectors, operated\n1,100 meters underground at the Boulby Underground Laboratory, which provides\nsignificant shielding from cosmic radiation and maintains a low ambient radon\nactivity of 2.30 $\\pm$ 0.03 Bq/m$^3$. Our evaluation focuses on energy\nreconstruction accuracy, background radiation rates, and operational stability.\nThe XIA UltraLo-1800 detector demonstrates remarkable stability in energy\nreconstruction, with less than 0.1 MeV variation over four years. Moreover, the\nimplementation of a graphite-filled PTFE liner in the sample tray resulted in a\nsignificant reduction in background radiation levels compared to measurements\nwith the original stainless steel tray, achieving an average activity of 0.15\n$\\pm$ 0.01 $\\alpha$/cm$^2$/khr. Copper sample assays, performed before and\nafter radon exposure, demonstrated the detector's ability to accurately\nidentify and quantify $^{210}$Po contamination. By implementing the robust\ncleanliness procedures and protocols described in this article, we observed a\nreduction in $^{210}$Po activity from 0.504 $\\pm$ 0.022 mBq to 0.336 $\\pm$\n0.013 mBq, highlighting the crucial role of refined cleaning methods in\nminimizing background for sensitive experiments. Additionally, observations of\nelevated background activity levels post-high-activity sample measurements\nillustrate the need for careful management of assay conditions and environment\nto maintain low background levels. These results highlight the potential of the\nXIA UltraLo-1800 in enhancing the precision of material assays essential for\nreducing background interference in rare event experiments.\n","subjects":["Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/"}