{"id":"2408.07726","title":"Graph neural network surrogate for strategic transport planning","authors":"Nikita Makarov, Santhanakrishnan Narayanan, Constantinos Antoniou","authorsParsed":[["Makarov","Nikita",""],["Narayanan","Santhanakrishnan",""],["Antoniou","Constantinos",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 14:18:47 GMT"}],"updateDate":"2024-08-16","timestamp":1723645127000,"abstract":"  As the complexities of urban environments continue to grow, the modelling of\ntransportation systems become increasingly challenging. This paper explores the\napplication of advanced Graph Neural Network (GNN) architectures as surrogate\nmodels for strategic transport planning. Building upon a prior work that laid\nthe foundation with graph convolution networks (GCN), our study delves into the\ncomparative analysis of established GCN with the more expressive Graph\nAttention Network (GAT). Additionally, we propose a novel GAT variant (namely\nGATv3) to address over-smoothing issues in graph-based models. Our\ninvestigation also includes the exploration of a hybrid model combining both\nGCN and GAT architectures, aiming to investigate the performance of the\nmixture. The three models are applied to various experiments to understand\ntheir limits. We analyse hierarchical regression setups, combining\nclassification and regression tasks, and introduce fine-grained classification\nwith a proposal of a method to convert outputs to precise values. Results\nreveal the superior performance of the new GAT in classification tasks. To the\nbest of the authors' knowledge, this is the first GAT model in literature to\nachieve larger depths. Surprisingly, the fine-grained classification task\ndemonstrates the GCN's unexpected dominance with additional training data. This\nshows that synthetic data generators can increase the training data, without\noverfitting issues whilst improving model performance. In conclusion, this\nresearch advances GNN based surrogate modelling, providing insights for\nrefining GNN architectures. The findings open avenues for investigating the\npotential of the newly proposed GAT architecture and the modelling setups for\nother transportation problems.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Iz_CBZ0ObXckilPSSzL_Xi3SDRpyn39EViRPXfMSkUo","pdfSize":"1387665"}
