{"id":"2408.10851","title":"Geodynamics of super-Earth GJ 486b","authors":"Tobias G. Meier, Dan J. Bower, Tim Lichtenberg, Mark Hammond, Paul J.\n  Tackley, Raymond T. Pierrehumbert, Jos\\'e A. Caballero, Shang-Min Tsai, Megan\n  Weiner Mansfield, Nicola Tosi, Philipp Baumeister","authorsParsed":[["Meier","Tobias G.",""],["Bower","Dan J.",""],["Lichtenberg","Tim",""],["Hammond","Mark",""],["Tackley","Paul J.",""],["Pierrehumbert","Raymond T.",""],["Caballero","José A.",""],["Tsai","Shang-Min",""],["Mansfield","Megan Weiner",""],["Tosi","Nicola",""],["Baumeister","Philipp",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 13:45:19 GMT"}],"updateDate":"2024-08-21","timestamp":1724161519000,"abstract":"  Many super-Earths are on very short orbits around their host star and,\ntherefore, more likely to be tidally locked. Because this locking can lead to a\nstrong contrast between the dayside and nightside surface temperatures, these\nsuper-Earths could exhibit mantle convection patterns and tectonics that could\ndiffer significantly from those observed in the present-day solar system. The\npresence of an atmosphere, however, would allow transport of heat from the\ndayside towards the nightside and thereby reduce the surface temperature\ncontrast between the two hemispheres. On rocky planets, atmospheric and\ngeodynamic regimes are closely linked, which directly connects the question of\natmospheric thickness to the potential interior dynamics of the planet. Here,\nwe study the interior dynamics of super-Earth GJ 486b ($R=1.34$ $R_{\\oplus}$,\n$M=3.0$ $M_{\\oplus}$, T$_\\mathrm{eq}\\approx700$ K), which is one of the most\nsuitable M-dwarf super-Earth candidates for retaining an atmosphere produced by\ndegassing from the mantle and magma ocean. We investigate how the geodynamic\nregime of GJ 486b is influenced by different surface temperature contrasts by\nvarying possible atmospheric circulation regimes. We also investigate how the\nstrength of the lithosphere affects the convection pattern. We find that\nhemispheric tectonics, the surface expression of degree-1 convection with\ndownwellings forming on one hemisphere and upwelling material rising on the\nopposite hemisphere, is a consequence of the strong lithosphere rather than\nsurface temperature contrast. Anchored hemispheric tectonics, where\ndownwellings und upwellings have a preferred (day/night) hemisphere, is\nfavoured for strong temperature contrasts between the dayside and nightside and\nhigher surface temperatures.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uSpPMxIQBXhqIQyvOOHOIO6fTZXjaSJxrYJXlsOm7zw","pdfSize":"16334838"}
