{"id":"2408.06913","title":"Dispersive gains enhance wireless power transfer with asymmetric\n  resonance","authors":"Xianglin Hao, Ke Yin, Shiqing Cai, Jianlong Zou, Ruibin Wang, Xikui\n  Ma, Chi K. Tse, Tianyu Dong","authorsParsed":[["Hao","Xianglin",""],["Yin","Ke",""],["Cai","Shiqing",""],["Zou","Jianlong",""],["Wang","Ruibin",""],["Ma","Xikui",""],["Tse","Chi K.",""],["Dong","Tianyu",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 14:05:53 GMT"}],"updateDate":"2024-08-14","timestamp":1723557953000,"abstract":"  Parity-time symmetry is a fundamental concept in non-Hermitian physics that\nhas recently gained attention for its potential in engineering advanced\nelectronic systems and achieving robust wireless power transfer even in the\npresence of disturbances, through the incorporation of nonlinearity. However,\nthe current parity-time-symmetric scheme falls short of achieving the\ntheoretical maximum efficiency of wireless power transfer and faces challenges\nwhen applied to non-resistive loads. In this study, we propose a theoretical\nframework and provide experimental evidence demonstrating that asymmetric\nresonance, based on dispersive gain, can greatly enhance the efficiency of\nwireless power transfer beyond the limits of symmetric approaches. By\nleveraging the gain spectrum interleaving resulting from dispersion, we observe\na mode switching phenomenon in asymmetric systems similar to the\nsymmetry-breaking effect. This phenomenon reshapes the distribution of\nresonance energy and enables more efficient wireless power transfer compared to\nconventional methods. Our findings open up new possibilities for harnessing\ndispersion effects in various domains such as electronics, microwaves, and\noptics. This work represents a significant step towards exploiting dispersion\nas a means to optimize wireless power transfer and lays the foundation for\nfuture advancements in these fields.\n","subjects":["Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}