{"id":"2408.16626","title":"A Score-based Generative Solver for PDE-constrained Inverse Problems\n  with Complex Priors","authors":"Yankun Hong and Harshit Bansal and Karen Veroy","authorsParsed":[["Hong","Yankun",""],["Bansal","Harshit",""],["Veroy","Karen",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 15:34:35 GMT"}],"updateDate":"2024-08-30","timestamp":1724945675000,"abstract":"  In the field of inverse estimation for systems modeled by partial\ndifferential equations (PDEs), challenges arise when estimating high- (or even\ninfinite-) dimensional parameters. Typically, the ill-posed nature of such\nproblems necessitates leveraging prior information to achieve well-posedness.\nIn most existing inverse solvers, the prior distribution is assumed to be of\neither Gaussian or Laplace form which, in many practical scenarios, is an\noversimplification. In case the prior is complex and the likelihood model is\ncomputationally expensive (e.g., due to expensive forward models), drawing the\nsample from such posteriors can be computationally intractable, especially when\nthe unknown parameter is high-dimensional. In this work, to sample efficiently,\nwe propose a score-based diffusion model, which combines a score-based\ngenerative sampling tool with a noising and denoising process driven by\nstochastic differential equations. This tool is used for iterative sample\ngeneration in accordance with the posterior distribution, while simultaneously\nlearning and leveraging the underlying information and constraints inherent in\nthe given complex prior. A time-varying time schedule is proposed to adapt the\nmethod for posterior sampling. To expedite the simulation of non-parameterized\nPDEs and enhance the generalization capacity, we introduce a physics-informed\nconvolutional neural network (CNN) surrogate for the forward model. Finally,\nnumerical experiments, including a hyper-elastic problem and a multi-scale\nmechanics problem, demonstrate the efficacy of the proposed approach. In\nparticular, the score-based diffusion model, coupled with the physics-informed\nCNN surrogate, effectively learns geometrical features from provided prior\nsamples, yielding better inverse estimation results compared to the\nstate-of-the-art techniques.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}