{"id":"2408.00792","title":"A Scalable and Generalized Deep Learning Framework for Anomaly Detection\n  in Surveillance Videos","authors":"Sabah Abdulazeez Jebur, Khalid A. Hussein, Haider Kadhim Hoomod, Laith\n  Alzubaidi, Ahmed Ali Saihood, YuanTong Gu","authorsParsed":[["Jebur","Sabah Abdulazeez",""],["Hussein","Khalid A.",""],["Hoomod","Haider Kadhim",""],["Alzubaidi","Laith",""],["Saihood","Ahmed Ali",""],["Gu","YuanTong",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 22:41:12 GMT"}],"updateDate":"2024-08-05","timestamp":1721256072000,"abstract":"  Anomaly detection in videos is challenging due to the complexity, noise, and\ndiverse nature of activities such as violence, shoplifting, and vandalism.\nWhile deep learning (DL) has shown excellent performance in this area, existing\napproaches have struggled to apply DL models across different anomaly tasks\nwithout extensive retraining. This repeated retraining is time-consuming,\ncomputationally intensive, and unfair. To address this limitation, a new DL\nframework is introduced in this study, consisting of three key components:\ntransfer learning to enhance feature generalization, model fusion to improve\nfeature representation, and multi-task classification to generalize the\nclassifier across multiple tasks without training from scratch when new task is\nintroduced. The framework's main advantage is its ability to generalize without\nrequiring retraining from scratch for each new task. Empirical evaluations\ndemonstrate the framework's effectiveness, achieving an accuracy of 97.99% on\nthe RLVS dataset (violence detection), 83.59% on the UCF dataset (shoplifting\ndetection), and 88.37% across both datasets using a single classifier without\nretraining. Additionally, when tested on an unseen dataset, the framework\nachieved an accuracy of 87.25%. The study also utilizes two explainability\ntools to identify potential biases, ensuring robustness and fairness. This\nresearch represents the first successful resolution of the generalization issue\nin anomaly detection, marking a significant advancement in the field.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"otj8CHs1bXn69vaWH80O2OHC3kc563VWGjyyRRa6-7o","pdfSize":"3162229"}
