{"id":"2408.15002","title":"Knowledge Discovery in Optical Music Recognition: Enhancing Information\n  Retrieval with Instance Segmentation","authors":"Elona Shatri and George Fazekas","authorsParsed":[["Shatri","Elona",""],["Fazekas","George",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 12:34:41 GMT"},{"version":"v2","created":"Mon, 16 Sep 2024 11:38:10 GMT"}],"updateDate":"2024-09-17","timestamp":1724762081000,"abstract":"  Optical Music Recognition (OMR) automates the transcription of musical\nnotation from images into machine-readable formats like MusicXML, MEI, or MIDI,\nsignificantly reducing the costs and time of manual transcription. This study\nexplores knowledge discovery in OMR by applying instance segmentation using\nMask R-CNN to enhance the detection and delineation of musical symbols in sheet\nmusic. Unlike Optical Character Recognition (OCR), OMR must handle the\nintricate semantics of Common Western Music Notation (CWMN), where symbol\nmeanings depend on shape, position, and context. Our approach leverages\ninstance segmentation to manage the density and overlap of musical symbols,\nfacilitating more precise information retrieval from music scores. Evaluations\non the DoReMi and MUSCIMA++ datasets demonstrate substantial improvements, with\nour method achieving a mean Average Precision (mAP) of up to 59.70\\% in dense\nsymbol environments, achieving comparable results to object detection.\nFurthermore, using traditional computer vision techniques, we add a parallel\nstep for staff detection to infer the pitch for the recognised symbols. This\nstudy emphasises the role of pixel-wise segmentation in advancing accurate\nmusic symbol recognition, contributing to knowledge discovery in OMR. Our\nfindings indicate that instance segmentation provides more precise\nrepresentations of musical symbols, particularly in densely populated scores,\nadvancing OMR technology. We make our implementation, pre-processing scripts,\ntrained models, and evaluation results publicly available to support further\nresearch and development.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Sound"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sneM18uucAOsYklfwvIsBwkwkeU0IjA8-SHXejNhgMg","pdfSize":"3027424"}
