{"id":"2408.06427","title":"Quantification of Multi-Compartment Flow with Spectral Diffusion MRI","authors":"Mira M. Liu, Jonathan Dyke, Thomas Gladytz, Jonas Jasse, Ian Bolger,\n  Sergio Calle, Swathi Pavaluri, Tanner Crews, Surya Seshan, Steven Salvatore,\n  Isaac Stillman, Thangamani Muthukumar, Bachir Taouli, Samira Farouk, Sara\n  Lewis, Octavia Bane","authorsParsed":[["Liu","Mira M.",""],["Dyke","Jonathan",""],["Gladytz","Thomas",""],["Jasse","Jonas",""],["Bolger","Ian",""],["Calle","Sergio",""],["Pavaluri","Swathi",""],["Crews","Tanner",""],["Seshan","Surya",""],["Salvatore","Steven",""],["Stillman","Isaac",""],["Muthukumar","Thangamani",""],["Taouli","Bachir",""],["Farouk","Samira",""],["Lewis","Sara",""],["Bane","Octavia",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 18:07:59 GMT"}],"updateDate":"2024-08-14","timestamp":1723486079000,"abstract":"  Purpose: Estimation of multi-compartment intravoxel flow in fD in ml/100g/min\nwith multi-b-value diffusion weighted imaging and a multi-Gaussian model in the\nkidneys. Theory and Methods: A multi-Gaussian model of intravoxel flow using\nwater transport time to quantify fD is presented and simulated.\nMulti-compartment anisotropic DWI signal is simulated analyzed with (1) a rigid\nbi-exponential, (2) a rigid tri-exponential, and (3) diffusion spectrum imaging\nmodel of intravoxel incoherent motion (spectral diffusion). The application is\ndemonstrated in a two-center study of 54 kidney allografts with 9 b-value\nadvanced DWI that were split by function (CKD-EPI 2021 eGFR<45ml/min/1.73m2)\nand fibrosis (Banff 2017 interstitial fibrosis and tubular atrophy score 0-6).\nResults: Spectral diffusion demonstrated strong correlation to truth for\nsimulated three-compartment anisotropic diffusion (y=1.08x+0.1, R2=0.71) and\ntwo-compartment anisotropic diffusion (y=0.91x+0.6, R2=0.74), outperforming\nrigid models in cases of variable compartment number. Use of a fixed\nregularization parameter set to {\\lambda}=0.1 increased computation up to\n208-fold and agreed with voxel-wise cross-validated regularization (concordance\ncorrelation coefficient=0.99). Spectral diffusion of renal allografts showed\nsignificant increase in tissue parenchyma compartment fD (f-stat=3.86, p=0.02).\nTubular fD was significantly decreased in allografts with impaired function\n(Mann-Whitney Utest t-stat=-2.14, p=0.04). Conclusions: Quantitative\nmulti-compartment intravoxel flow can be estimated in ml/100g/min with fD from\nmulti-Gaussian diffusion, even with moderate anisotropy such as in kidneys. The\nuse of spectral diffusion with a multi-Gaussian model and a fixed\nregularization parameter shows promise in organs such as the kidney with\nvariable numbers of physiologic compartments.\n","subjects":["Physics/Medical Physics","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}