{"id":"2408.04248","title":"Absorption and scattering properties of nanoparticles in an absorbing\n  medium: revisiting with experimental validation","authors":"Pham Thi Hong, Nguyen Trung Kien, Nguyen Viet Tuyen, Hung Q. Nguyen,\n  H. T. M. Nghiem","authorsParsed":[["Hong","Pham Thi",""],["Kien","Nguyen Trung",""],["Tuyen","Nguyen Viet",""],["Nguyen","Hung Q.",""],["Nghiem","H. T. M.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 06:25:23 GMT"}],"updateDate":"2024-08-09","timestamp":1723098323000,"abstract":"  Absorption and scattering properties of nanoparticles immersed in an\nabsorbing medium are essential in understanding the overall properties of\ncomposites and in designing materials with expected functionalities. In this\npaper, we establish the model that links the absorption and scattering\ncoefficients of individual particles with the reflectance and transmittance\nspectra of thin-film composite, supported by well-controlled experiments. Thin\nfilms consisting of TiO$_2$ nanoparticles embedded in PMMA are fabricated on\nglass substrates using spin-coating and then peeled off to form standalone\nsamples for spectroscopy measurements. The absorption $K$ and scattering $S$\ncoefficients of multiple nanoparticles are calculated from the measured\ntransmittance and reflectance using the Kubelka-Munk theory in combination with\nthe Saunderson correction. From the theoretical side, the absorption $K$ and\nscattering $S$ coefficients are the accumulation of absorption and scattering\nof individual particles, which are derived from the Mie theory. The agreement\nbetween the $K$ and $S$ coefficients extracted from experimental data and from\ntheoretical calculations gives deep insight into the significant attenuating\neffect of absorption and scattering on each particle due to the surrounding\nmedium. Furthermore, the validated model of nanoparticles immersed in an\nabsorbing medium can be used to obtain the preliminary results for materials\ndesigned toward radiative cooling.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}