{"id":"2408.07612","title":"Long-Term Aging Study of a Silicon Nitride Nanomechanical Resonator","authors":"Michel Stephan (1), Alexandre Bouchard (1), Timothy Hodges (1 and 2),\n  Richard G. Green (2), Triantafillos Koukoulas (2), Lixue Wu (2), Raphael\n  St-Gelais (1,3,4) ((1) Department of Mechanical Engineering, University of\n  Ottawa, (2) Metrology Research Centre, National Research Council Canada, (3)\n  Department of Physics, University of Ottawa, (4) Centre for Research in\n  Photonics, University of Ottawa)","authorsParsed":[["Stephan","Michel","","1 and 2"],["Bouchard","Alexandre","","1 and 2"],["Hodges","Timothy","","1 and 2"],["Green","Richard G.",""],["Koukoulas","Triantafillos",""],["Wu","Lixue",""],["St-Gelais","Raphael",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 15:19:23 GMT"}],"updateDate":"2024-08-15","timestamp":1723648763000,"abstract":"  Short-term changes in the resonance frequency of silicon nitride (SiN)\nnanomechanical resonators can be measured very precisely due to low\nthermomechanical fluctuations resulting from large mechanical quality factors.\nThese properties enable high-performance detection of quasi-instantaneous\nstimuli, such as sudden exposure to radiation or adsorption of mass. However,\npractical use of such sensors will eventually raise questions regarding their\nless-studied longer-term stability, notably for calibration purposes. We\ncharacterize aging of an as-fabricated SiN membrane by continuously tracking\nchanges of its resonance frequency over 135 days in a temperature-controlled\nhigh vacuum environment. The aging behavior is consistent with previously\nreported double-logarithmic and drift-reversal aging trends observed in quartz\noscillators. The aging magnitude (300 ppm) is also comparable to typical\ntemperature compensated quartz oscillators (TCXO), after normalization to\naccount for the greater importance of interfaces in our thin (90 nm) resonator,\ncompared to several microns thick TCXOs. Possible causes of aging due to\nsurface adsorption are investigated. We review models on how water adsorption\nand desorption can cause significant frequency changes, predominantly due to\nchemisorption stress. Chemical species adsorbed on the resonator surface are\nalso identified by X-ray photoelectron spectroscopy (XPS). These measurements\nshow a significant increase in carbon every time the sample is placed under\nvacuum, while subsequent exposure to air causes an increase in oxidated carbon.\nDeveloping models for the contribution of carbon and oxygen to the membrane\nstress should therefore be an important future direction. Other contaminants,\nnotably alkaline and halide ions, are detected in smaller quantities and\nbriefly discussed.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}