{"id":"2408.10403","title":"A Big Red Dot: Scattered light, host galaxy signatures and multi-phase\n  gas flows in a luminous, heavily reddened quasar at cosmic noon","authors":"Matthew Stepney, Manda Banerji, Shenli Tang, Paul C. Hewett, Matthew\n  J. Temple, Clare F. Wethers, Annagrazia Puglisi and Stephen J. Molyneux","authorsParsed":[["Stepney","Matthew",""],["Banerji","Manda",""],["Tang","Shenli",""],["Hewett","Paul C.",""],["Temple","Matthew J.",""],["Wethers","Clare F.",""],["Puglisi","Annagrazia",""],["Molyneux","Stephen J.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 20:38:58 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 08:28:34 GMT"}],"updateDate":"2024-08-22","timestamp":1724099938000,"abstract":"  We present a deep X-Shooter rest-frame UV to optical spectral analysis of the\nheavily reddened quasar, ULASJ2315+043 at z=2.566, known to reside in a\nmajor-merger host galaxy. The rest-frame optical is best-fit by a dust-reddened\nquasar E(B-V)_QSO = 1.55 with black-hole mass log10(Hbeta, MBH [M_sol]) = 10.26\n+\\- 0.05, bolometric luminosity L_Bol = 10^48.16 erg s^-1 and Eddington-scaled\naccretion rate log10(\\lambda_Edd) = -0.19. We find remarkable similarities\nbetween ULASJ2315+043 and the high-redshift Little Red Dots (LRDs). The\nrest-frame UV cannot be explained by a dusty quasar component alone and\nrequires an additional blue component consistent with either a star-forming\nhost galaxy or scattered AGN light. We detect broad high-ionisation emission\nlines in the rest-UV, supporting the scattered light interpretation for the UV\nexcess. The scattering fraction represents just 0.05% of the total luminosity\nof ULASJ2315+043. Analysis of the mid infra-red SED suggests an absence of hot\ndust on torus-scales similar to what is observed for LRDs. The obscuring medium\nis therefore likely on galaxy scales. We detect narrow, blueshifted associated\nabsorption line systems in CIV, NV, SiIV and SiIII. There is evidence for\nsignificant high-velocity (>1000 km s^-1) outflows in both the broad and narrow\nline regions as traced by CIV and [OIII] emission. The kinetic power of the\n[OIII] wind is e_ion = 10^44.61 erg s^-1 ~ 0.001 L_Bol. ULASJ2315+043 is likely\nin an important transition phase where star formation, black-hole accretion and\nmulti-phase gas flows are simultaneously occurring.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}