{"id":"2408.03336","title":"Few-Shot Transfer Learning for Individualized Braking Intent Detection\n  on Neuromorphic Hardware","authors":"Nathan Lutes, Venkata Sriram Siddhardh Nadendla, K. Krishnamurthy","authorsParsed":[["Lutes","Nathan",""],["Nadendla","Venkata Sriram Siddhardh",""],["Krishnamurthy","K.",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 15:35:46 GMT"}],"updateDate":"2024-08-08","timestamp":1721576146000,"abstract":"  Objective: This work explores use of a few-shot transfer learning method to\ntrain and implement a convolutional spiking neural network (CSNN) on a\nBrainChip Akida AKD1000 neuromorphic system-on-chip for developing\nindividual-level, instead of traditionally used group-level, models using\nelectroencephalographic data. The efficacy of the method is studied on an\nadvanced driver assist system related task of predicting braking intention.\nMain Results: Efficacy of the above methodology to develop individual specific\nbraking intention predictive models by rapidly adapting the group-level model\nin as few as three training epochs while achieving at least 90% accuracy, true\npositive rate and true negative rate is presented. Further, results show an\nenergy reduction of over 97% with only a 1.3x increase in latency when using\nthe Akida AKD1000 processor for network inference compared to an Intel Xeon\nCPU. Similar results were obtained in a subsequent ablation study using a\nsubset of five out of 19 channels. Significance: Especially relevant to\nreal-time applications, this work presents an energy-efficient, few-shot\ntransfer learning method that is implemented on a neuromorphic processor\ncapable of training a CSNN as new data becomes available, operating conditions\nchange, or to customize group-level models to yield personalized models unique\nto each individual.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}