{"id":"2408.06754","title":"DMRG Analysis of Magnetic Order in the Zigzag Edges of Hexagonal CrN\n  Nanoribbons","authors":"Micha{\\l} Kupczy\\'nski, Jaros{\\l}aw Paw{\\l}owski, Aybey Mogulkoc,\n  Mohsen Modarresi","authorsParsed":[["Kupczyński","Michał",""],["Pawłowski","Jarosław",""],["Mogulkoc","Aybey",""],["Modarresi","Mohsen",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 09:26:38 GMT"}],"updateDate":"2024-08-14","timestamp":1723541198000,"abstract":"  We investigate the finite temperature magnetic order at the edges of\nhexagonal CrN nanoribbons by using the density-functional theory combined with\nthe density-matrix renormalization group method. Moreover, the spin-dependent\ntransport in nanoribbons is calculated within the semi-classical Boltzmann\ntransport theory. We find out that the zigzag edges have lower energy with\nrespect to armchair edges. The zigzag edge of CrN nanoribbon shows half\nmetallic electronic character which is the same as for the 2D monolayer. The\nlocalized electronic states on the zigzag edges reduce the electronic band gap\nenergy for spin down electrons. The ab-initio electronic results are mapped\ninto an effective 1D Heisenberg spin model up to the next nearest neighbor\nexchange interaction term. For zigzag ribbons, the nearest neighbor and next\nnearest neighbor magnetic exchange are around $10$ to $12$, and $-2$ to\n$0$~meV/Cr atom, respectively. The finite spin correlation length in 1D\nnanoribbons drops sharply to zero with temperature. The absence of long range\nspin correlations at the edges is a practical drawback for future room\ntemperature 2D spintronic devices. The maximally localized Wannier functions\nare used for band interpolation and spin-dependent transport calculations by\nusing the semi-classical Boltzmann equation. We show that zigzag edges of CrN\nare perfect spin filter under both electron and hole doping.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BAF3WZiJEkV6SfZq523C8LSNef32Q7u3zhMDf5viCC8","pdfSize":"2944820"}
