{"id":"2408.10833","title":"Evolution of Semi-convective Staircases in Rotating Flows: Consequences\n  for Fuzzy Cores in Giant Planets","authors":"J. R. Fuentes, Bradley W. Hindman, Adrian E. Fraser, Evan H. Anders","authorsParsed":[["Fuentes","J. R.",""],["Hindman","Bradley W.",""],["Fraser","Adrian E.",""],["Anders","Evan H.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 13:29:30 GMT"}],"updateDate":"2024-08-21","timestamp":1724160570000,"abstract":"  Recent observational constraints on the internal structure of Jupiter and\nSaturn suggest that these planets have ``fuzzy\" cores, i.e., radial gradients\nof the concentration of heavy elements that might span $50\\%$ to $70\\%$ of each\nplanet's radius. These cores could be composed of a semi-convective staircase,\ni.e., multiple convective layers separated by diffusive interfaces arising from\ndouble-diffusive instabilities. However, to date, no study has demonstrated how\nsuch staircases can avoid layer mergers and persist over evolutionary time\nscales. In fact, previous work has found that these mergers occur rapidly,\nquickly leading to only a single convective layer. Using 3D simulations of\nconvective staircases in non-rotating and rotating flows, we demonstrate that\nrotation prolongs the lifetime of a convective staircase by increasing the\ntimescale for both layer merger and erosion of the interface between the final\ntwo layers. We present an analytic model for the erosion phase, predicting that\nrotation increases the erosion time by a factor of approximately\n$\\mathrm{Ro}^{-1/2}$, where $\\mathrm{Ro}$ is the Rossby number of the\nconvective flows (the ratio of the rotation period to the convective turnover\ntime). For Jovian conditions at early times after formation (when convection is\nvigorous enough to mix a large fraction of the planet), we find the erosion\ntime to be roughly $10^{9}~\\mathrm{yrs}$ in the non-rotating case and\n$10^{11}~\\mathrm{yrs}$ in the rotating case. Thus, the current existence of\nconvective staircases within the deep interiors of giant planets is a strong\npossibility, and rotation could be an important factor in the preservation of\ntheir fuzzy cores.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics","Physics/Atmospheric and Oceanic Physics","Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}