{"id":"2408.09208","title":"Parametric Sensitivity Analysis for Models of Reaction Networks within\n  Interacting Compartments","authors":"David F. Anderson and Aidan S. Howells","authorsParsed":[["Anderson","David F.",""],["Howells","Aidan S.",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 14:15:23 GMT"}],"updateDate":"2024-08-20","timestamp":1723904123000,"abstract":"  Models of reaction networks within interacting compartments (RNIC) are a\ngeneralization of stochastic reaction networks. It is most natural to think of\nthe interacting compartments as ``cells'' that can appear, degrade, split, and\neven merge, with each cell containing an evolving copy of the underlying\nstochastic reaction network. Such models have a number of parameters, including\nthose associated with the internal chemical model and those associated with the\ncompartment interactions, and it is natural to want efficient computational\nmethods for the numerical estimation of sensitivities of model statistics with\nrespect to these parameters. Motivated by the extensive work on computational\nmethods for parametric sensitivity analysis in the context of stochastic\nreaction networks over the past few decades, we provide a number of methods in\nthe RNIC setting. Provided methods include the (unbiased) Girsanov\ntransformation method (also called the Likelihood Ratio method) and a number of\ncoupling methods for the implementation of finite differences. We provide\nseveral numerical examples and conclude that the method associated with the\n``Split Coupling'' provides the most efficient algorithm. This finding is in\nline with the conclusions from the work related to sensitivity analysis of\nstandard stochastic reaction networks. We have made all of the Matlab code used\nto implement the various methods freely available for download.\n","subjects":["Quantitative Biology/Molecular Networks","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis","Mathematics/Probability","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Xmfi-MGDLWrhCjTuOZqogi0_qIB7T6VUEe2kHmEJR3Y","pdfSize":"358202"}
