{"id":"2408.08853","title":"CPS-TaskForge: Generating Collaborative Problem Solving Environments for\n  Diverse Communication Tasks","authors":"Nikita Haduong (1), Irene Wang, Bo-Ru Lu (1), Prithviraj Ammanabrolu\n  (2), Noah A. Smith (1 and 3) ((1) Paul G. Allen School of Computer Science &\n  Engineering, University of Washington, (2) University of California, San\n  Diego, (3) Allen Institute for AI)","authorsParsed":[["Haduong","Nikita","","1 and 3"],["Wang","Irene","","1 and 3"],["Lu","Bo-Ru","","1 and 3"],["Ammanabrolu","Prithviraj","","1 and 3"],["Smith","Noah A.","","1 and 3"]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 17:28:19 GMT"}],"updateDate":"2024-08-19","timestamp":1723829299000,"abstract":"  Teams can outperform individuals; could adding AI teammates further bolster\nperformance of teams solving problems collaboratively? Collaborative problem\nsolving (CPS) research commonly studies teams with two agents (human-human or\nhuman-AI), but team research literature finds that, for complex tasks, larger\nteams are more effective. Progress in studying collaboration with more than two\nagents, through textual records of team interactions, is hindered by a major\ndata challenge: available CPS corpora are predominantly dyadic, and adapting\npre-existing CPS tasks to more agents is non-trivial. We address this data\nchallenge by developing a CPS task generator, CPS-TaskForge, that can produce\nenvironments for studying CPS under a wide array of conditions, and releasing a\nCPS task design checklist grounded in the theoretical PISA 2015 CPS framework\nto help facilitate the development of CPS corpora with more agents.\nCPS-TaskForge takes the form of a resource management (tower defense) game, and\ndifferent CPS tasks can be studied by manipulating game design parameters. We\nconduct a case study with groups of 3-4 humans to validate production of\ndiverse natural language CPS communication in a game instance produced by\nCPS-TaskForge. We discuss opportunities for advancing research in CPS (both\nwith human-only and human-AI teams) using different task configurations. We\nwill release data and code.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}