{"id":"2408.14974","title":"Finding Convincing Views to Endorse a Claim","authors":"Shunit Agmon (1), Amir Gilad (2), Brit Youngmann (1), Shahar Zoarets\n  (1) and Benny Kimelfeld (1) ((1) Technion - Israel Institute of Technology,\n  (2) Hebrew University)","authorsParsed":[["Agmon","Shunit",""],["Gilad","Amir",""],["Youngmann","Brit",""],["Zoarets","Shahar",""],["Kimelfeld","Benny",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 11:29:08 GMT"}],"updateDate":"2024-08-28","timestamp":1724758148000,"abstract":"  Recent studies investigated the challenge of assessing the strength of a\ngiven claim extracted from a dataset, particularly the claim's potential of\nbeing misleading and cherry-picked. We focus on claims that compare answers to\nan aggregate query posed on a view that selects tuples. The strength of a claim\namounts to the question of how likely it is that the view is carefully chosen\nto support the claim, whereas less careful choices would lead to contradictory\nclaims. We embark on the study of the reverse task that offers a complementary\nangle in the critical assessment of data-based claims: given a claim, find\nuseful supporting views. The goal of this task is twofold. On the one hand, we\naim to assist users in finding significant evidence of phenomena of interest.\nOn the other hand, we wish to provide them with machinery to criticize or\ncounter given claims by extracting evidence of opposing statements.\n  To be effective, the supporting sub-population should be significant and\ndefined by a ``natural'' view. We discuss several measures of naturalness and\npropose ways of extracting the best views under each measure (and combinations\nthereof). The main challenge is the computational cost, as na\\\"ive search is\ninfeasible. We devise anytime algorithms that deploy two main steps: (1) a\npreliminary construction of a ranked list of attribute combinations that are\nassessed using fast-to-compute features, and (2) an efficient search for the\nactual views based on each attribute combination. We present a thorough\nexperimental study that shows the effectiveness of our algorithms in terms of\nquality and execution cost. We also present a user study to assess the\nusefulness of the naturalness measures.\n","subjects":["Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"e9N84Yq2NfQSo6OHKK864uRik4yvkHAS70bf7vVcnLg","pdfSize":"1009981"}
