{"id":"2408.10973","title":"Emergent cavity junction around metal-on-graphene contacts","authors":"Yuhao Zhao, Ma\\\"elle Kapfer, Kenji Watanabe, Takashi Taniguchi, Oded\n  Zilberberg, Bjarke S. Jessen","authorsParsed":[["Zhao","Yuhao",""],["Kapfer","Maëlle",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Zilberberg","Oded",""],["Jessen","Bjarke S.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 16:06:26 GMT"}],"updateDate":"2024-08-21","timestamp":1724169986000,"abstract":"  Harnessing graphene devices for applications relies on a comprehensive\nunderstanding of how to interact with them. Specifically, scattering processes\nat the interface with metallic contacts can induce reproducible abnormalities\nin measurements. Here, we report on emergent transport signatures appearing\nwhen contacting sub-micrometer high-quality metallic top contacts to graphene.\nUsing electrostatic simulations and first-principle calculations, we reveal\ntheir origin: the contact induces an n-doped radial cavity around it, which is\ncooperatively defined by the metal-induced electrostatic potential and Klein\ntunneling. This intricate mechanism leads to secondary resistance peaks as a\nfunction of graphene doping that decreases with increasing contact size.\nInterestingly, in the presence of a perpendicular magnetic field, the cavity\nspawns a distinct set of Landau levels that interferes with the Landau fan\nemanating from the graphene bulk. Essentially, an emergent 'second bulk' forms\naround the contact, as a result of the interplay between the magnetic field and\nthe contact-induced electrostatic potential. The interplay between the\nintrinsic and emergent bulks leads to direct observation of bulk-boundary\ncorrespondence in our experiments. Our work unveils the microscopic mechanisms\nmanifesting at metal-graphene interfaces, opening new avenues for understanding\nand devising graphene-based electronic devices.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}