{"id":"2408.06653","title":"Hierarchical Structured Neural Network for Retrieval","authors":"Kaushik Rangadurai, Siyang Yuan, Minhui Huang, Yiqun Liu, Golnaz\n  Ghasemiesfeh, Yunchen Pu, Xinfeng Xie, Xingfeng He, Fangzhou Xu, Andrew Cui,\n  Vidhoon Viswanathan, Yan Dong, Liang Xiong, Lin Yang, Liang Wang, Jiyan Yang,\n  Chonglin Sun","authorsParsed":[["Rangadurai","Kaushik",""],["Yuan","Siyang",""],["Huang","Minhui",""],["Liu","Yiqun",""],["Ghasemiesfeh","Golnaz",""],["Pu","Yunchen",""],["Xie","Xinfeng",""],["He","Xingfeng",""],["Xu","Fangzhou",""],["Cui","Andrew",""],["Viswanathan","Vidhoon",""],["Dong","Yan",""],["Xiong","Liang",""],["Yang","Lin",""],["Wang","Liang",""],["Yang","Jiyan",""],["Sun","Chonglin",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 05:53:46 GMT"}],"updateDate":"2024-08-14","timestamp":1723528426000,"abstract":"  Embedding Based Retrieval (EBR) is a crucial component of the retrieval stage\nin (Ads) Recommendation System that utilizes Two Tower or Siamese Networks to\nlearn embeddings for both users and items (ads). It then employs an Approximate\nNearest Neighbor Search (ANN) to efficiently retrieve the most relevant ads for\na specific user. Despite the recent rise to popularity in the industry, they\nhave a couple of limitations. Firstly, Two Tower model architecture uses a\nsingle dot product interaction which despite their efficiency fail to capture\nthe data distribution in practice. Secondly, the centroid representation and\ncluster assignment, which are components of ANN, occur after the training\nprocess has been completed. As a result, they do not take into account the\noptimization criteria used for retrieval model. In this paper, we present\nHierarchical Structured Neural Network (HSNN), a deployed jointly optimized\nhierarchical clustering and neural network model that can take advantage of\nsophisticated interactions and model architectures that are more common in the\nranking stages while maintaining a sub-linear inference cost. We achieve 6.5%\nimprovement in offline evaluation and also demonstrate 1.22% online gains\nthrough A/B experiments. HSNN has been successfully deployed into the Ads\nRecommendation system and is currently handling major portion of the traffic.\nThe paper shares our experience in developing this system, dealing with\nchallenges like freshness, volatility, cold start recommendations, cluster\ncollapse and lessons deploying the model in a large scale retrieval production\nsystem.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}