{"id":"2408.12251","title":"Earth-like planets hosting systems: Architecture and properties","authors":"Jeanne Davoult, Yann Alibert and Lokesh Mishra","authorsParsed":[["Davoult","Jeanne",""],["Alibert","Yann",""],["Mishra","Lokesh",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 09:39:20 GMT"}],"updateDate":"2024-08-23","timestamp":1724319560000,"abstract":"  The discovery of Earth-like planets is a major focus of current planetology\nresearch and faces a significant technological challenge. Indeed, when it comes\nto detecting planets as small and cold as the Earth, the cost of observation\ntime is massive. Understanding in what type of systems Earth-like planets\n(ELPs) form and how to identify them is crucial for preparing future missions\nsuch as PLATO, LIFE, or others. Theoretical models suggest that ELPs\npredominantly form within a certain type of system architecture. Therefore, the\npresence or absence of ELPs could be inferred from the arrangement of other\nplanets within the same system. This study aims to identify the profile of a\ntypical system that harbours an ELP by investigating the architecture of\nsystems and the properties of their innermost detectable planets. Here, we\nintroduce a novel method for determining the architecture of planetary systems\nand categorising them into four distinct classes. Using three populations of\nsynthetic planetary systems generated using the Bern model around three\ndifferent types of stars, we studied the `theoretical' architecture (the\narchitecture of a complete planetary system) and the `biased' architecture (the\narchitecture of a system in which only detectable planets are taken into\naccount) of the synthetic systems. The biased architecture of a system, studied\nin conjunction with the mass, radius, and period of the innermost detectable\nplanet, appears to correlate with the presence or absence of an ELP in the same\nsystem. We conclude that the detections of ELPs can be predicted thanks to the\nalready known properties of their systems, and we present a list of the\nproperties of the systems most likely to host such a planet.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}