{"id":"2408.04870","title":"ConfusedPilot: Confused Deputy Risks in RAG-based LLMs","authors":"Ayush RoyChowdhury, Mulong Luo, Prateek Sahu, Sarbartha Banerjee,\n  Mohit Tiwari","authorsParsed":[["RoyChowdhury","Ayush",""],["Luo","Mulong",""],["Sahu","Prateek",""],["Banerjee","Sarbartha",""],["Tiwari","Mohit",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 05:20:05 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 22:51:30 GMT"},{"version":"v3","created":"Thu, 15 Aug 2024 05:24:19 GMT"}],"updateDate":"2024-08-16","timestamp":1723180805000,"abstract":"  Retrieval augmented generation (RAG) is a process where a large language\nmodel (LLM) retrieves useful information from a database and then generates the\nresponses. It is becoming popular in enterprise settings for daily business\noperations. For example, Copilot for Microsoft 365 has accumulated millions of\nbusinesses. However, the security implications of adopting such RAG-based\nsystems are unclear.\n  In this paper, we introduce ConfusedPilot, a class of security\nvulnerabilities of RAG systems that confuse Copilot and cause integrity and\nconfidentiality violations in its responses. First, we investigate a\nvulnerability that embeds malicious text in the modified prompt in RAG,\ncorrupting the responses generated by the LLM. Second, we demonstrate a\nvulnerability that leaks secret data, which leverages the caching mechanism\nduring retrieval. Third, we investigate how both vulnerabilities can be\nexploited to propagate misinformation within the enterprise and ultimately\nimpact its operations, such as sales and manufacturing. We also discuss the\nroot cause of these attacks by investigating the architecture of a RAG-based\nsystem. This study highlights the security vulnerabilities in today's RAG-based\nsystems and proposes design guidelines to secure future RAG-based systems.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Orb2zGoaHLvh9ecsARDyq2knrYdIEG7vRglHNHnSSjE","pdfSize":"1075303"}
