{"id":"2408.03388","title":"A Non-negative VAE:the Generalized Gamma Belief Network","authors":"Zhibin Duan, Tiansheng Wen, Muyao Wang, Bo Chen, Mingyuan Zhou","authorsParsed":[["Duan","Zhibin",""],["Wen","Tiansheng",""],["Wang","Muyao",""],["Chen","Bo",""],["Zhou","Mingyuan",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 18:18:37 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 04:24:00 GMT"}],"updateDate":"2024-08-16","timestamp":1722968317000,"abstract":"  The gamma belief network (GBN), often regarded as a deep topic model, has\ndemonstrated its potential for uncovering multi-layer interpretable latent\nrepresentations in text data. Its notable capability to acquire interpretable\nlatent factors is partially attributed to sparse and non-negative\ngamma-distributed latent variables. However, the existing GBN and its\nvariations are constrained by the linear generative model, thereby limiting\ntheir expressiveness and applicability. To address this limitation, we\nintroduce the generalized gamma belief network (Generalized GBN) in this paper,\nwhich extends the original linear generative model to a more expressive\nnon-linear generative model. Since the parameters of the Generalized GBN no\nlonger possess an analytic conditional posterior, we further propose an\nupward-downward Weibull inference network to approximate the posterior\ndistribution of the latent variables. The parameters of both the generative\nmodel and the inference network are jointly trained within the variational\ninference framework. Finally, we conduct comprehensive experiments on both\nexpressivity and disentangled representation learning tasks to evaluate the\nperformance of the Generalized GBN against state-of-the-art Gaussian\nvariational autoencoders serving as baselines.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}