{"id":"2408.17202","title":"Impact of ice growth on the physical and chemical properties of dense\n  cloud cores","authors":"O. Sipil\\\"a, P. Caselli, M. Juvela","authorsParsed":[["Sipilä","O.",""],["Caselli","P.",""],["Juvela","M.",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 11:01:06 GMT"}],"updateDate":"2024-09-02","timestamp":1725015666000,"abstract":"  We investigated the effect of time-dependent ice growth on dust grains on the\nopacity and hence on the dust temperature in a collapsing molecular cloud core,\nwith the aim of quantifying the effect of the dust temperature variations on\nice abundances as well as the evolution of the collapse. We employed a\none-dimensional collapse model that self-consistently and time-dependently\ncombines hydrodynamics with chemical and radiative transfer simulations. The\ndust opacity was updated on-the-fly based on the ice growth as a function of\nlocation in the core. The results of the fully dynamical model were compared\nagainst simulations assuming fixed ice thickness. We found that the ice\nthickness increases fast and reaches a saturation value of approximately 90\nmonolayers in the central core (volume density $\\sim$$10^4\\,\\rm cm^{-3}$), and\nseveral tens of monolayers at a volume density of $\\sim$$10^3\\,\\rm cm^{-3}$,\nafter only a few $10^5\\,\\rm yr$ of evolution. The results thus exclude the\nadoption of thin ($\\sim$10 monolayer) ices in molecular cloud simulations\nexcept at very short timescales. The differences in abundances and dust\ntemperature between the fully dynamic simulation and those with fixed dust\nopacity are small; abundances change between the solutions generally within a\nfactor of two. The assumptions on the dust opacity do have an effect on the\ncollapse dynamics through the influence of the photoelectric effect on the gas\ntemperature, and the simulations take a different time to reach a common\ncentral density. In conclusion, carrying out chemical simulations using a dust\ntemperature corresponding to a fixed opacity seems to be a good approximation.\nStill, although at least in the present case its effect on the overall results\nis limited - as long as the grains are monodisperse - ice growth should be\nconsidered to obtain the most accurate representation of the collapse dynamics.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}