{"id":"2408.08301","title":"VLPG-Nav: Object Navigation Using Visual Language Pose Graph and Object\n  Localization Probability Maps","authors":"Senthil Hariharan Arul, Dhruva Kumar, Vivek Sugirtharaj, Richard Kim,\n  Xuewei (Tony) Qi, Rajasimman Madhivanan, Arnie Sen, Dinesh Manocha","authorsParsed":[["Arul","Senthil Hariharan","","Tony"],["Kumar","Dhruva","","Tony"],["Sugirtharaj","Vivek","","Tony"],["Kim","Richard","","Tony"],["Xuewei","","","Tony"],["Qi","",""],["Madhivanan","Rajasimman",""],["Sen","Arnie",""],["Manocha","Dinesh",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 17:54:55 GMT"}],"updateDate":"2024-08-16","timestamp":1723744495000,"abstract":"  We present VLPG-Nav, a visual language navigation method for guiding robots\nto specified objects within household scenes. Unlike existing methods primarily\nfocused on navigating the robot toward objects, our approach considers the\nadditional challenge of centering the object within the robot's camera view.\nOur method builds a visual language pose graph (VLPG) that functions as a\nspatial map of VL embeddings. Given an open vocabulary object query, we plan a\nviewpoint for object navigation using the VLPG. Despite navigating to the\nviewpoint, real-world challenges like object occlusion, displacement, and the\nrobot's localization error can prevent visibility. We build an object\nlocalization probability map that leverages the robot's current observations\nand prior VLPG. When the object isn't visible, the probability map is updated\nand an alternate viewpoint is computed. In addition, we propose an\nobject-centering formulation that locally adjusts the robot's pose to center\nthe object in the camera view. We evaluate the effectiveness of our approach\nthrough simulations and real-world experiments, evaluating its ability to\nsuccessfully view and center the object within the camera field of view.\nVLPG-Nav demonstrates improved performance in locating the object, navigating\naround occlusions, and centering the object within the robot's camera view,\noutperforming the selected baselines in the evaluation metrics.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}