{"id":"2408.11058","title":"LLM Agents Improve Semantic Code Search","authors":"Sarthak Jain (University of Illinois Urbana Champaign and Cisco),\n  Aditya Dora (University of Illinois Urbana Champaign), Ka Seng Sam\n  (University of Illinois Urbana Champaign), and Prabhat Singh (Cisco)","authorsParsed":[["Jain","Sarthak","","University of Illinois Urbana Champaign and Cisco"],["Dora","Aditya","","University of Illinois Urbana Champaign"],["Sam","Ka Seng","","University of Illinois Urbana Champaign"],["Singh","Prabhat","","Cisco"]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 00:43:56 GMT"}],"updateDate":"2024-08-22","timestamp":1722818636000,"abstract":"  Code Search is a key task that many programmers often have to perform while\ndeveloping solutions to problems. Current methodologies suffer from an\ninability to perform accurately on prompts that contain some ambiguity or ones\nthat require additional context relative to a code-base. We introduce the\napproach of using Retrieval Augmented Generation (RAG) powered agents to inject\ninformation into user prompts allowing for better inputs into embedding models.\nBy utilizing RAG, agents enhance user queries with relevant details from GitHub\nrepositories, making them more informative and contextually aligned.\nAdditionally, we introduce a multi-stream ensemble approach which when paired\nwith agentic workflow can obtain improved retrieval accuracy, which we deploy\non application called repo-rift.com. Experimental results on the CodeSearchNet\ndataset demonstrate that RepoRift significantly outperforms existing methods,\nachieving an 78.2% success rate at Success@10 and a 34.6% success rate at\nSuccess@1. This research presents a substantial advancement in semantic code\nsearch, highlighting the potential of agentic LLMs and RAG to enhance code\nretrieval systems.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}