{"id":"2408.00409","title":"Within-vector viral dynamics challenges how to model the extrinsic\n  incubation period for major arboviruses: dengue, Zika, and chikungunya","authors":"L\\'ea Loisel, Vincent Raquin, Maxime Ratinier, Pauline Ezanno, Ga\\\"el\n  Beaun\\'ee","authorsParsed":[["Loisel","Léa",""],["Raquin","Vincent",""],["Ratinier","Maxime",""],["Ezanno","Pauline",""],["Beaunée","Gaël",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 09:28:19 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 23:14:03 GMT"}],"updateDate":"2024-08-06","timestamp":1722504499000,"abstract":"  Arboviruses represent a significant threat to human, animal, and plant health\nworldwide. To elucidate transmission, anticipate their spread and efficiently\ncontrol them, mechanistic modelling has proven its usefulness. However, most\nmodels rely on assumptions about how the extrinsic incubation period (EIP) is\nrepresented: the intra-vector viral dynamics (IVD), occurring during the EIP,\nis approximated by a single state. After an average duration, all exposed\nvectors become infectious. Behind this are hidden two strong hypotheses: (i)\nEIP is exponentially distributed in the vector population; (ii) viruses\nsuccessfully cross the infection, dissemination, and transmission barriers in\nall exposed vectors. To assess these hypotheses, we developed a stochastic\ncompartmental model which represents successive IVD stages, associated to the\ncrossing or not of these three barriers. We calibrated the model using an\nABC-SMC (Approximate Bayesian Computation - Sequential Monte Carlo) method with\nmodel selection. We systematically searched for literature data on experimental\ninfections of Aedes mosquitoes infected by either dengue, chikungunya, or Zika\nviruses. We demonstrated the discrepancy between the exponential hypothesis and\nobserved EIP distributions for dengue and Zika viruses and identified more\nrelevant EIP distributions . We also quantified the fraction of infected\nmosquitoes eventually becoming infectious, highlighting that often only a small\nfraction crosses the three barriers. This work provides a generic modelling\nframework applicable to other arboviruses for which similar data are available.\nOur model can also be coupled to population-scale models to aid future\narbovirus control.\n","subjects":["Quantitative Biology/Populations and Evolution","Quantitative Biology/Quantitative Methods","Statistics/Computation"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}