{"id":"2408.01563","title":"Discriminating among cosmological models by data-driven methods","authors":"Simone Vilardi, Salvatore Capozziello, Massimo Brescia","authorsParsed":[["Vilardi","Simone",""],["Capozziello","Salvatore",""],["Brescia","Massimo",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 20:31:51 GMT"}],"updateDate":"2024-08-06","timestamp":1722630711000,"abstract":"  We explores the Pantheon+SH0ES dataset to identify patterns that can\ndiscriminate between different cosmological models. We focus on determining\nwhether the behaviour of dark energy is consistent with the standard\n$\\Lambda$CDM model or suggests novel cosmological features. The central goal is\nto evaluate the robustness of the $\\Lambda$CDM model compared with other dark\nenergy models, and to investigate whether there are deviations that might\nindicate new cosmological insights. The study takes into account a data-driven\napproach, using both traditional statistical methods and machine learning\ntechniques. Initially, we evaluate six different dark energy models using\ntraditional statistical methods like Markov Chain Monte Carlo (MCMC), Static\nand Dynamic Nested Sampling to infer the cosmological parameters. Subsequently,\nwe adopt a machine learning approach, developing a regression model to compute\nthe distance modulus of each supernova, expanding the feature set to 74\nstatistical features. Traditional statistical analysis confirms that the\n$\\Lambda$CDM model is robust, yielding expected parameter values. Other models\nshow deviations, with the Generalised and Modified Chaplygin Gas models\nperforming poorly. In the machine learning analysis, feature selection\ntechniques, particularly Boruta, significantly improve model performance. In\nparticular, models initially considered weak (Generalised/Modified Chaplygin\nGas) show significant improvement after feature selection. The study\ndemonstrates the effectiveness of a data-driven approach to cosmological model\nevaluation. The $\\Lambda$CDM model remains robust, while machine learning\ntechniques, in particular feature selection, reveal potential improvements in\nalternative models which could be relevant for new observational campaigns like\nthe recent DESI survey.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"S2fYfWyU3nMFWwuhsWaTynTxK6ejUcqKbizPf7cc1OQ","pdfSize":"1727182","txDigest":"oczLf121GUKYGpJK5ecHLDe9xBWWoFPoj6fgFNRfGCA","endEpoch":"1","status":"CERTIFIED"}
