{"id":"2408.03787","title":"Asymmetric deformations of a perturbed spherical bubble in an\n  incompressible fluid","authors":"Chen-Chih Lai, Michael I. Weinstein","authorsParsed":[["Lai","Chen-Chih",""],["Weinstein","Michael I.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 14:13:25 GMT"}],"updateDate":"2024-08-08","timestamp":1723040005000,"abstract":"  We study the dynamics of a gas bubble in a fluid with surface tension,\ninitially near a spherical equilibrium. While there are many studies and\napplications of radial bubble dynamics, the theory of general deformations from\na spherical equilibrium is less developed. We aim to understand how\nasymmetrically perturbed equilibrium bubbles evolve toward spherical\nequilibrium due to thermal or viscous dissipation in an incompressible liquid.\nWe focus on the isobaric approximation [Prosperetti, JFM, 1991], under which\nthe gas pressure within the bubble is spatially uniform and obeys the ideal gas\nlaw. The liquid outside the bubble is incompressible, irrotational, and has\nsurface tension. We prove that any equilibrium gas bubble must be spherical by\nshowing that the bubble boundary is a closed surface of constant mean\ncurvature. We then study the initial value problem (IVP) for the coupled PDEs,\nconstitutive laws and interface conditions of the isobaric approximation for\ngeneral (asymmetric) small initial perturbations of the spherical bubble in the\nlinearized approximation. Our first result, considering thermal damping without\nviscosity, proves that the linearized IVP is globally well-posed. The monopole\n(radial) component of the perturbation decays exponentially over time, while\nthe multipole (non-radial) components undergo undamped oscillations. This\nindicates a limitation of the isobaric model for non-spherical dynamics. Our\nsecond result, incorporating viscous dissipation, shows that the IVP is linear\nand nonlinearly ill-posed due to an incompatibility of normal stress boundary\nconditions, for non-spherical solutions, and the irrotationality assumption.\nOur study concludes that to accurately capture the dynamics of general\ndeformations of a gas bubble, the model must account for either vorticity\ngenerated at the bubble-fluid boundary, spatial non-uniformities in the gas\npressure, or both.\n","subjects":["Mathematics/Analysis of PDEs","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Nonlinear Sciences/Pattern Formation and Solitons","Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}