{"id":"2408.16865","title":"Measuring Transparency in Intelligent Robots","authors":"Georgios Angelopoulos, Dimitri Lacroix, Ricarda Wullenkord, Alessandra\n  Rossi, Silvia Rossi, Friederike Eyssel","authorsParsed":[["Angelopoulos","Georgios",""],["Lacroix","Dimitri",""],["Wullenkord","Ricarda",""],["Rossi","Alessandra",""],["Rossi","Silvia",""],["Eyssel","Friederike",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 19:09:25 GMT"}],"updateDate":"2024-09-02","timestamp":1724958565000,"abstract":"  As robots become increasingly integrated into our daily lives, the need to\nmake them transparent has never been more critical. Yet, despite its importance\nin human-robot interaction, a standardized measure of robot transparency has\nbeen missing until now. This paper addresses this gap by presenting the first\ncomprehensive scale to measure perceived transparency in robotic systems,\navailable in English, German, and Italian languages. Our approach\nconceptualizes transparency as a multidimensional construct, encompassing\nexplainability, legibility, predictability, and meta-understanding. The\nproposed scale was a product of a rigorous three-stage process involving 1,223\nparticipants. Firstly, we generated the items of our scale, secondly, we\nconducted an exploratory factor analysis, and thirdly, a confirmatory factor\nanalysis served to validate the factor structure of the newly developed TOROS\nscale. The final scale encompasses 26 items and comprises three factors:\nIllegibility, Explainability, and Predictability. TOROS demonstrates high\ncross-linguistic reliability, inter-factor correlation, model fit, internal\nconsistency, and convergent validity across the three cross-national samples.\nThis empirically validated tool enables the assessment of robot transparency\nand contributes to the theoretical understanding of this complex construct. By\noffering a standardized measure, we facilitate consistent and comparable\nresearch in human-robot interaction in which TOROS can serve as a benchmark.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WKiVrQpzDH3PbVbXuqbm2s-guNLK7ymy9s4iqCJykzw","pdfSize":"2880687"}
