{"id":"2408.12365","title":"Enhancing Uncertainty Communication in Time Series Predictions: Insights\n  and Recommendations","authors":"Apoorva Karagappa and Pawandeep Kaur Betz and Jonas Gilg and Moritz\n  Zeumer and Andreas Gerndt and Bernhard Preim","authorsParsed":[["Karagappa","Apoorva",""],["Betz","Pawandeep Kaur",""],["Gilg","Jonas",""],["Zeumer","Moritz",""],["Gerndt","Andreas",""],["Preim","Bernhard",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 13:03:55 GMT"}],"updateDate":"2024-08-23","timestamp":1724331835000,"abstract":"  As the world increasingly relies on mathematical models for forecasts in\ndifferent areas, effective communication of uncertainty in time series\npredictions is important for informed decision making. This study explores how\nusers estimate probabilistic uncertainty in time series predictions under\ndifferent variants of line charts depicting uncertainty. It examines the role\nof individual characteristics and the influence of user-reported metrics on\nuncertainty estimations. By addressing these aspects, this paper aims to\nenhance the understanding of uncertainty visualization and for improving\ncommunication in time series forecast visualizations and the design of\nprediction data dashboards.As the world increasingly relies on mathematical\nmodels for forecasts in different areas, effective communication of uncertainty\nin time series predictions is important for informed decision making. This\nstudy explores how users estimate probabilistic uncertainty in time series\npredictions under different variants of line charts depicting uncertainty. It\nexamines the role of individual characteristics and the influence of\nuser-reported metrics on uncertainty estimations. By addressing these aspects,\nthis paper aims to enhance the understanding of uncertainty visualization and\nfor improving communication in time series forecast visualizations and the\ndesign of prediction data dashboards.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kTwclUkrqN_pFFHEQGpguKKRZaAqFA5YwapHkibHs84","pdfSize":"690508"}
