{"id":"2408.04644","title":"Lower bounds of uncertainty and upper limits on the accuracy of\n  forecasts of macroeconomic variables","authors":"Victor Olkhov","authorsParsed":[["Olkhov","Victor",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 17:48:54 GMT"}],"updateDate":"2024-08-12","timestamp":1722620934000,"abstract":"  We consider the randomness of values and volumes of market deals as a major\nfactor that describes lower bounds of uncertainty and upper limits on the\naccuracy of the forecasts of macroeconomic variables, prices, and returns. We\nintroduce random macroeconomic variables, whose average values coincide with\nusual macroeconomic variables, and describe their uncertainty by coefficients\nof variation that depend on the volatilities, correlations, and coefficients of\nvariation of random values or volumes of trades. The same approach describes\nbounds of uncertainty and limits on the accuracy of forecasts for growth rates,\ninflation, interest rates, etc. Limits on the accuracy of forecasts of\nmacroeconomic variables depend on the certainty of predictions of their\nprobabilities. The number of predicted statistical moments determines the\nveracity of macroeconomic probability. To quantify macroeconomic 2nd\nstatistical moments, one needs additional econometric methodologies, data, and\ncalculations of variables determined as sums of squares of values or volumes of\nmarket trades. Forecasting of macroeconomic 2nd statistical moments requires\n2nd order economic theories. All of that is absent and for many years to come,\nthe accuracy of forecasts of the probabilities of random macroeconomic\nvariables, prices, and returns will be limited by the Gaussian approximations,\nwhich are determined by the first two statistical moments.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics","Quantitative Finance/General Finance","Quantitative Finance/Statistical Finance"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}