{"id":"2408.12135","title":"Improved accuracy for decoding surface codes with matching synthesis","authors":"Cody Jones","authorsParsed":[["Jones","Cody",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 05:34:36 GMT"}],"updateDate":"2024-08-23","timestamp":1724304876000,"abstract":"  We present a method, called matching synthesis, for decoding quantum codes\nthat produces an enhanced assignment of errors from an ensemble of decoders. We\napply matching synthesis to develop a decoder named Libra, and show in\nsimulations that Libra increases the error-suppression ratio $\\Lambda$ by about\n$10\\%$. Matching synthesis takes the solutions of an ensemble of approximate\nsolvers for the minimum-weight hypergraph matching problem, and produces a new\nsolution that combines the best local solutions, where locality depends on the\nhypergraph. We apply matching synthesis to an example problem of decoding\nsurface codes with error correlations in the conventional circuit model, which\ninduces a hypergraph with hyperedges that are local in space and time. We call\nthe matching-synthesis decoder Libra, and in this example the ensemble consists\nof correlated minimum-weight matching using a different hypergraph with\nrandomly perturbed error probabilities for each ensemble member. Furthermore,\nwe extend matching synthesis to perform summation of probability for multiple\nlow-weight solutions and at small computational overhead, approximating the\nprobability of an equivalence class; in our surface code problem, this shows a\nmodest additional benefit. We show that matching synthesis has favorable\nscaling properties where accuracy begins to saturate with an ensemble size of\n60, and we remark on pathways to real-time decoding at near-optimal decoding\naccuracy if one has an accurate model for the distribution of errors.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AQjxCBrjbjmq0p1Hs3V8Gf50_CPdnBxd6L0t1aSfDt0","pdfSize":"1512609"}
