{"id":"2408.07832","title":"LADDER: Language Driven Slice Discovery and Error Rectification","authors":"Shantanu Ghosh, Rayan Syed, Chenyu Wang, Clare B. Poynton, Kayhan\n  Batmanghelich","authorsParsed":[["Ghosh","Shantanu",""],["Syed","Rayan",""],["Wang","Chenyu",""],["Poynton","Clare B.",""],["Batmanghelich","Kayhan",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 14:49:35 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 19:22:10 GMT"},{"version":"v3","created":"Wed, 4 Sep 2024 17:31:00 GMT"}],"updateDate":"2024-09-05","timestamp":1722437375000,"abstract":"  Error slice discovery associates structured patterns with model errors.\nExisting methods discover error slices by clustering the error-prone samples\nwith similar patterns or assigning discrete attributes to each sample for\npost-hoc analysis. While these methods aim for interpretability and easier\nmitigation through reweighting or rebalancing, they may not capture the full\ncomplexity of error patterns due to incomplete or missing attributes. Contrary\nto the existing approach, this paper utilizes the reasoning capabilities of the\nLarge Language Model (LLM) to analyze complex error patterns and generate\ntestable hypotheses. This paper proposes LADDER: Language Driven slice\nDiscovery and Error Rectification. It first projects the model's representation\ninto a language-aligned feature space (eg CLIP) to preserve semantics in the\noriginal model feature space. This ensures the accurate retrieval of sentences\nthat highlight the model's errors. Next, the LLM utilizes the sentences and\ngenerates hypotheses to discover error slices. Finally, we mitigate the error\nby fine-tuning the classification head by creating a group-balanced dataset\nusing the hypotheses. Our entire method does not require any attribute\nannotation, either explicitly or through external tagging models. We validate\nour method with \\textbf{five} image classification datasets. The code is\navailable (https://github.com/batmanlab/Ladder).\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}