{"id":"2408.13848","title":"High-Dimensional PCA Revisited: Insights from General Spiked Models and\n  Data Normalization Effects","authors":"Yanqing Yin and Wang Zhou","authorsParsed":[["Yin","Yanqing",""],["Zhou","Wang",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 14:36:50 GMT"}],"updateDate":"2024-08-27","timestamp":1724596610000,"abstract":"  Principal Component Analysis (PCA) is a critical tool for dimensionality\nreduction and data analysis. This paper revisits PCA through the lens of\ngeneralized spiked covariance and correlation models, which allow for more\nrealistic and complex data structures. We explore the asymptotic properties of\nthe sample principal components (PCs) derived from both the sample covariance\nand correlation matrices, focusing on how data normalization-an essential step\nfor scale-invariant analysis-affects these properties. Our results reveal that\nwhile normalization does not alter the first-order limits of spiked eigenvalues\nand eigenvectors, it significantly influences their second-order behavior. We\nestablish new theoretical findings, including a joint central limit theorem for\nbilinear forms of the sample covariance matrix's resolvent and diagonal\nentries, providing a robust framework for understanding spiked models in high\ndimensions. Our theoretical results also reveal an intriguing phenomenon\nregarding the effect of data normalization when the variances of covariates are\nequal. Specifically, they suggest that high-dimensional PCA based on the\ncorrelation matrix may not only perform comparably to, but potentially even\noutperform, PCA based on the covariance matrix-particularly when the leading\nprincipal component is sufficiently large. This study not only extends the\nexisting literature on spiked models but also offers practical guidance for\napplying PCA in real-world scenarios, particularly when dealing with normalized\ndata.\n","subjects":["Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}