{"id":"2408.05074","title":"RT-Surv: Improving Mortality Prediction After Radiotherapy with Large\n  Language Model Structuring of Large-Scale Unstructured Electronic Health\n  Records","authors":"Sangjoon Park, Chan Woo Wee, Seo Hee Choi, Kyung Hwan Kim, Jee Suk\n  Chang, Hong In Yoon, Ik Jae Lee, Yong Bae Kim, Jaeho Cho, Ki Chang Keum,\n  Chang Geol Lee, Hwa Kyung Byun, and Woong Sub Koom","authorsParsed":[["Park","Sangjoon",""],["Wee","Chan Woo",""],["Choi","Seo Hee",""],["Kim","Kyung Hwan",""],["Chang","Jee Suk",""],["Yoon","Hong In",""],["Lee","Ik Jae",""],["Kim","Yong Bae",""],["Cho","Jaeho",""],["Keum","Ki Chang",""],["Lee","Chang Geol",""],["Byun","Hwa Kyung",""],["Koom","Woong Sub",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 14:02:24 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 06:04:31 GMT"},{"version":"v3","created":"Wed, 4 Sep 2024 23:47:08 GMT"},{"version":"v4","created":"Fri, 13 Sep 2024 05:12:52 GMT"}],"updateDate":"2024-09-16","timestamp":1723212144000,"abstract":"  Accurate patient selection is critical in radiotherapy (RT) to prevent\nineffective treatments. Traditional survival prediction models, relying on\nstructured data, often lack precision. This study explores the potential of\nlarge language models (LLMs) to structure unstructured electronic health record\n(EHR) data, thereby improving survival prediction accuracy through\ncomprehensive clinical information integration. Data from 34,276 patients\ntreated with RT at Yonsei Cancer Center between 2013 and 2023 were analyzed,\nencompassing both structured and unstructured data. An open-source LLM was used\nto structure the unstructured EHR data via single-shot learning, with its\nperformance compared against a domain-specific medical LLM and a smaller\nvariant. Survival prediction models were developed using statistical, machine\nlearning, and deep learning approaches, incorporating both structured and\nLLM-structured data. Clinical experts evaluated the accuracy of the\nLLM-structured data. The open-source LLM achieved 87.5% accuracy in structuring\nunstructured EHR data without additional training, significantly outperforming\nthe domain-specific medical LLM, which reached only 35.8% accuracy. Larger LLMs\nwere more effective, particularly in extracting clinically relevant features\nlike general condition and disease extent, which closely correlated with\npatient survival. Incorporating LLM-structured clinical features into survival\nprediction models significantly improved accuracy, with the C-index of deep\nlearning models increasing from 0.737 to 0.820. These models also became more\ninterpretable by emphasizing clinically significant factors. This study shows\nthat general-domain LLMs, even without specific medical training, can\neffectively structure large-scale unstructured EHR data, substantially\nenhancing the accuracy and interpretability of clinical predictive models.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}