{"id":"2408.16034","title":"Systematic Evaluation of Synthetic Data Augmentation for Multi-class\n  NetFlow Traffic","authors":"Maximilian Wolf, Dieter Landes, Andreas Hotho, Daniel Schl\\\"or","authorsParsed":[["Wolf","Maximilian",""],["Landes","Dieter",""],["Hotho","Andreas",""],["Schlör","Daniel",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 12:44:07 GMT"}],"updateDate":"2024-08-30","timestamp":1724849047000,"abstract":"  The detection of cyber-attacks in computer networks is a crucial and ongoing\nresearch challenge. Machine learning-based attack classification offers a\npromising solution, as these models can be continuously updated with new data,\nenhancing the effectiveness of network intrusion detection systems (NIDS).\nUnlike binary classification models that simply indicate the presence of an\nattack, multi-class models can identify specific types of attacks, allowing for\nmore targeted and effective incident responses. However, a significant drawback\nof these classification models is their sensitivity to imbalanced training\ndata. Recent advances suggest that generative models can assist in data\naugmentation, claiming to offer superior solutions for imbalanced datasets.\nClassical balancing methods, although less novel, also provide potential\nremedies for this issue. Despite these claims, a comprehensive comparison of\nthese methods within the NIDS domain is lacking. Most existing studies focus\nnarrowly on individual methods, making it difficult to compare results due to\nvarying experimental setups. To close this gap, we designed a systematic\nframework to compare classical and generative resampling methods for class\nbalancing across multiple popular classification models in the NIDS domain,\nevaluated on several NIDS benchmark datasets. Our experiments indicate that\nresampling methods for balancing training data do not reliably improve\nclassification performance. Although some instances show performance\nimprovements, the majority of results indicate decreased performance, with no\nconsistent trend in favor of a specific resampling technique enhancing a\nparticular classifier.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}