{"id":"2408.13927","title":"Uncovering the complex mechanisms behind nanomaterials-based\n  plasmon-driven photocatalysis through the utilization of Surface-Enhanced\n  Raman Spectroscopies","authors":"Mahadi Hasan and Mahamadu Tiah Mahama","authorsParsed":[["Hasan","Mahadi",""],["Mahama","Mahamadu Tiah",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 19:53:53 GMT"}],"updateDate":"2024-08-27","timestamp":1724615633000,"abstract":"  Plasmonic materials have got wide attention as a potential candidate for\nlight driven catalysis of chemical conversions by harnessing solar energy to\nreduce the environmental issues generated by fossil fuels-based bulk chemical\nindustries. Toward diluting this crisis, many reported the utilization of\nplasmonic nanostructured materials in driving industrially important reactions\nat normal temperature and pressure. However, these chemical conversions often\nsuffer from low yield difficulties, and poor efficiency problems. Also, the\nmechanism of energy transfer from plasmon to desired molecules is still not\nproperly understood which retards the efforts of scaling them up. Recent\nendeavors of using SERS to explore the complex mechanisms associated with\nplasmonic photocatalysis have shown great promises because of the higher\nsensitivity of the technique. In this article, our aim is to analyze the role\nof ultrafast SERS in revealing charge transfer as the primary mechanism of\nphotocatalytic reaction of 4-nitrothiophenol to azobenzene-4,4-dithiol and how\nnanoparticles other than noble metals can also drive this dimerization reaction\nwith similar potential of noble metals. We also intend to investigate why\nplasmonic heating occurring at metal surface is inadequate to run\nphotocatalytic conversions. A series of analysis has been done in these works\nusing SERS to gather data and understand the mechanisms involved in the\nprocesses by pumping plasmonic resonance simultaneously and investigating\nsignals from molecules at various time delays. These results open the door for\nresearchers to consider SERS as a promising technique to uncover the physical\nand chemical processes involved in plasmon-driven photocatalysis and to advance\ntoward environment friendly and cost-efficient photochemical conversions in\nfuture.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}