{"id":"2408.14449","title":"The limitations of a standard phase-field model in reproducing jointing\n  in sedimentary rock layers","authors":"Edoardo Pezzulli and Patrick Zulian and Alena Kopani\\v{c}\\'akov\\'a and\n  Rolf Krause and Thomas Driesner","authorsParsed":[["Pezzulli","Edoardo",""],["Zulian","Patrick",""],["Kopaničáková","Alena",""],["Krause","Rolf",""],["Driesner","Thomas",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 17:44:05 GMT"}],"updateDate":"2024-08-27","timestamp":1724694245000,"abstract":"  Geological applications of phase-field methods for fracture are notably\nscarce. This work conducts a numerical examination of the applicability of\nstandard phase-field models in reproducing jointing within sedimentary layers.\nWe explore how the volumetric-deviatoric split alongside the AT1 and AT2\nphase-field formulations have several advantages in simulating jointing, but\nalso have intrinsic limitations that prevent a reliable quantitative analysis\nof rock fracture. The formulations qualitatively reproduce the process of joint\nsaturation, along with the negative correlation between joint spacing and the\nheight of the sedimentary layer. However, in quantitative comparison to\nalternative numerical methods and outcrop observations, the phase-field method\noverestimates joint spacings by a factor of 2 and induces unrealistic\ncompressive fractures in the AT1 model, alongside premature shearing at layer\ninterfaces for the AT2 model. The causes are identified to be intrinsic to the\nphase-field lengthscale and the unsuitable strength envelope arising from the\nVolumetric-Deviatoric split. Finally, our analysis elucidates on the\nphase-field lengthscale's distortion of the stress field around dilating\nfractures, causing the sedimentary layer to reach joint saturation prematurely,\nthereby stopping the nucleation of new fractures and leading to larger joint\nspacings than in natural examples. Decreasing the lengthscale results in\ngradual improvement but becomes prohibitively computationally expensive for\nvery small lengthscales such that the limit of ``natural'' behavior was not\nreached in this study. Overall, our results motivate the development of\nconstitutive phase-field models that are more suitable for geological\napplications and their benchmarking against geological observations.\n","subjects":["Physics/Geophysics","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}