{"id":"2408.03958","title":"Optimizing Emotion Recognition with Wearable Sensor Data: Unveiling\n  Patterns in Body Movements and Heart Rate through Random Forest\n  Hyperparameter Tuning","authors":"Zikri Kholifah Nur, Rifki Wijaya and Gia Septiana Wulandari","authorsParsed":[["Nur","Zikri Kholifah",""],["Wijaya","Rifki",""],["Wulandari","Gia Septiana",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 10:48:42 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 15:35:13 GMT"}],"updateDate":"2024-08-14","timestamp":1722163722000,"abstract":"  This research delves into the utilization of smartwatch sensor data and heart\nrate monitoring to discern individual emotions based on body movement and heart\nrate. Emotions play a pivotal role in human life, influencing mental\nwell-being, quality of life, and even physical and physiological responses. The\ndata were sourced from prior research by Juan C. Quiroz, PhD. The study\nenlisted 50 participants who donned smartwatches and heart rate monitors while\ncompleting a 250-meter walk. Emotions were induced through both audio-visual\nand audio stimuli, with participants' emotional states evaluated using the\nPANAS questionnaire. The study scrutinized three scenarios: viewing a movie\nbefore walking, listening to music before walking, and listening to music while\nwalking. Personal baselines were established using DummyClassifier with the\n'most_frequent' strategy from the sklearn library, and various models,\nincluding Logistic Regression and Random Forest, were employed to gauge the\nimpacts of these activities. Notably, a novel approach was undertaken by\nincorporating hyperparameter tuning to the Random Forest model using\nRandomizedSearchCV. The outcomes showcased substantial enhancements with\nhyperparameter tuning in the Random Forest model, yielding mean accuracies of\n86.63% for happy vs. sad and 76.33% for happy vs. neutral vs. sad.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}