{"id":"2408.16829","title":"Maven: A Multimodal Foundation Model for Supernova Science","authors":"Gemma Zhang, Thomas Helfer, Alexander T. Gagliano, Siddharth\n  Mishra-Sharma, V. Ashley Villar","authorsParsed":[["Zhang","Gemma",""],["Helfer","Thomas",""],["Gagliano","Alexander T.",""],["Mishra-Sharma","Siddharth",""],["Villar","V. Ashley",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:00:05 GMT"}],"updateDate":"2024-09-02","timestamp":1724954405000,"abstract":"  A common setting in astronomy is the availability of a small number of\nhigh-quality observations, and larger amounts of either lower-quality\nobservations or synthetic data from simplified models. Time-domain astrophysics\nis a canonical example of this imbalance, with the number of supernovae\nobserved photometrically outpacing the number observed spectroscopically by\nmultiple orders of magnitude. At the same time, no data-driven models exist to\nunderstand these photometric and spectroscopic observables in a common context.\nContrastive learning objectives, which have grown in popularity for aligning\ndistinct data modalities in a shared embedding space, provide a potential\nsolution to extract information from these modalities. We present Maven, the\nfirst foundation model for supernova science. To construct Maven, we first\npre-train our model to align photometry and spectroscopy from 0.5M synthetic\nsupernovae using a constrastive objective. We then fine-tune the model on 4,702\nobserved supernovae from the Zwicky Transient Facility. Maven reaches\nstate-of-the-art performance on both classification and redshift estimation,\ndespite the embeddings not being explicitly optimized for these tasks. Through\nablation studies, we show that pre-training with synthetic data improves\noverall performance. In the upcoming era of the Vera C. Rubin Observatory,\nMaven serves as a Rosetta Stone for leveraging large, unlabeled and multimodal\ntime-domain datasets.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Instrumentation and Methods for Astrophysics","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}