{"id":"2408.03467","title":"The Galactic Center in Color: Measuring Extinction with\n  High-Proper-Motion Stars","authors":"Z. Haggard, A. M. Ghez, S. Sakai, A. K. Gautam, T. Do, J. R. Lu, M.\n  Hosek, M. R. Morris, S. Granados","authorsParsed":[["Haggard","Z.",""],["Ghez","A. M.",""],["Sakai","S.",""],["Gautam","A. K.",""],["Do","T.",""],["Lu","J. R.",""],["Hosek","M.",""],["Morris","M. R.",""],["Granados","S.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 22:42:21 GMT"}],"updateDate":"2024-08-13","timestamp":1722984141000,"abstract":"  The Milky Way's central parsec is a highly extinguished region with a\npopulation of high-proper-motion stars. We have tracked 145 stars for $\\sim$10\nyears at wavelengths between 1 and 4 microns to analyze extinction effects in\ncolor-magnitude space. Approximately $30\\%$ of this sample dims and reddens\nover the course of years, likely from the motion of sources relative to an\ninhomogeneous screen of dust. We correct previous measurements of the intrinsic\nvariability fraction for differential extinction effects, resulting in a\nreduced stellar variability fraction of $34\\%$. The extinction variability\nsub-sample shows that the extinguishing material has sub-arcsecond scales, much\nsmaller variations than previously reported. The observed extinction events\nimply a typical cross-section of 500 AU and a density of around $3 \\times\n10^{4} \\ \\mathrm{atoms/cm^{3}}$ for the extinguishing material, which are\nconsistent with measurements of filamentary dust and gas at the Galactic\nCenter. Furthermore, given that the stars showing extinction variability tend\nto be more highly reddened than the rest of the sample, the extinction changes\nare likely due to material localized to the Galactic Center region. We estimate\nthe relative extinction between 1 and 4 microns as,\n$\\mathrm{A}_{\\mathrm{H}}:\\mathrm{A}_{\\mathrm{K'}}:\\mathrm{A}_{\\mathrm{L'}} =\n1.67 \\pm 0.05:1:0.69 \\pm 0.03$. Our measurement of extinction at longer\nwavelengths -- L' (3.8 $\\mu$m) -- is inconsistent with recent estimations of\nthe integrated extinction towards the central parsec. One interpretation of\nthis difference is that the dust variations this experiment is sensitive to --\nwhich are local to the Galactic Center -- are dominated by grains of larger\nradius than the foreground.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}