{"id":"2408.09464","title":"3C: Confidence-Guided Clustering and Contrastive Learning for\n  Unsupervised Person Re-Identification","authors":"Mingxiao Zheng, Yanpeng Qu, Changjing Shang, Longzhi Yang, Qiang Shen","authorsParsed":[["Zheng","Mingxiao",""],["Qu","Yanpeng",""],["Shang","Changjing",""],["Yang","Longzhi",""],["Shen","Qiang",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 13:14:20 GMT"}],"updateDate":"2024-08-20","timestamp":1723986860000,"abstract":"  Unsupervised person re-identification (Re-ID) aims to learn a feature network\nwith cross-camera retrieval capability in unlabelled datasets. Although the\npseudo-label based methods have achieved great progress in Re-ID, their\nperformance in the complex scenario still needs to sharpen up. In order to\nreduce potential misguidance, including feature bias, noise pseudo-labels and\ninvalid hard samples, accumulated during the learning process, in this pa per,\na confidence-guided clustering and contrastive learning (3C) framework is\nproposed for unsupervised person Re-ID. This 3C framework presents three\nconfidence degrees. i) In the clustering stage, the confidence of the\ndiscrepancy between samples and clusters is proposed to implement a harmonic\ndiscrepancy clustering algorithm (HDC). ii) In the forward-propagation training\nstage, the confidence of the camera diversity of a cluster is evaluated via a\nnovel camera information entropy (CIE). Then, the clusters with high CIE values\nwill play leading roles in training the model. iii) In the back-propagation\ntraining stage, the confidence of the hard sample in each cluster is designed\nand further used in a confidence integrated harmonic discrepancy (CHD), to\nselect the informative sample for updating the memory in contrastive learning.\nExtensive experiments on three popular Re-ID benchmarks demonstrate the\nsuperiority of the proposed framework. Particularly, the 3C framework achieves\nstate-of-the-art results: 86.7%/94.7%, 45.3%/73.1% and 47.1%/90.6% in terms of\nmAP/Rank-1 accuracy on Market-1501, the com plex datasets MSMT17 and VeRi-776,\nrespectively. Code is available at https://github.com/stone5265/3C-reid.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}