{"id":"2408.02680","title":"Recording First-person Experiences to Build a New Type of Foundation\n  Model","authors":"Dionis Barcari, David Gamez and Aliya Grig","authorsParsed":[["Barcari","Dionis",""],["Gamez","David",""],["Grig","Aliya",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 11:51:26 GMT"}],"updateDate":"2024-08-07","timestamp":1722426686000,"abstract":"  Foundation models have had a big impact in recent years and billions of\ndollars are being invested in them in the current AI boom. The more popular\nones, such as Chat-GPT, are trained on large amounts of Internet data. However,\nit is becoming apparent that this data is likely to be exhausted soon, and\ntechnology companies are looking for new sources of data to train the next\ngeneration of foundation models.\n  Reinforcement learning, RAG, prompt engineering and cognitive modelling are\noften used to fine-tune and augment the behaviour of foundation models. These\ntechniques have been used to replicate people, such as Caryn Marjorie. These\nchatbots are not based on people's actual emotional and physiological responses\nto their environment, so they are, at best, a surface-level approximation to\nthe characters they are imitating.\n  To address these issues, we have developed a recording rig that captures what\nthe wearer is seeing and hearing as well as their skin conductance (GSR),\nfacial expression and brain state (14 channel EEG). AI algorithms are used to\nprocess this data into a rich picture of the environment and internal states of\nthe subject. Foundation models trained on this data could replicate human\nbehaviour much more accurately than the personality models that have been\ndeveloped so far. This type of model has many potential applications, including\nrecommendation, personal assistance, GAN systems, dating and recruitment.\n  This paper gives some background to this work and describes the recording rig\nand preliminary tests of its functionality. It then suggests how a new type of\nfoundation model could be created from the data captured by the rig and\noutlines some applications. Data gathering and model training are expensive, so\nwe are currently working on the launch of a start-up that could raise funds for\nthe next stage of the project.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"pME-j1-864gzVdISl3YmrQkUjAcXV8USo9p-qBVjA_Q","pdfSize":"7765732"}
