{"id":"2408.14744","title":"RSTeller: Scaling Up Visual Language Modeling in Remote Sensing with\n  Rich Linguistic Semantics from Openly Available Data and Large Language\n  Models","authors":"Junyao Ge, Yang Zheng, Kaitai Guo, Jimin Liang","authorsParsed":[["Ge","Junyao",""],["Zheng","Yang",""],["Guo","Kaitai",""],["Liang","Jimin",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 02:45:26 GMT"}],"updateDate":"2024-08-28","timestamp":1724726726000,"abstract":"  Abundant, well-annotated multimodal data in remote sensing are pivotal for\naligning complex visual remote sensing (RS) scenes with human language,\nenabling the development of specialized vision language models across diverse\nRS interpretation tasks. However, annotating RS images with rich linguistic\nsemantics at scale demands expertise in RS and substantial human labor, making\nit costly and often impractical. In this study, we propose a workflow that\nleverages large language models (LLMs) to generate multimodal datasets with\nsemantically rich captions at scale from plain OpenStreetMap (OSM) data for\nimages sourced from the Google Earth Engine (GEE) platform. This approach\nfacilitates the generation of paired remote sensing data and can be readily\nscaled up using openly available data. Within this framework, we present\nRSTeller, a multimodal dataset comprising over 1 million RS images, each\naccompanied by multiple descriptive captions. Extensive experiments demonstrate\nthat RSTeller enhances the performance of multiple existing vision language\nmodels for RS scene understanding through continual pre-training. Our\nmethodology significantly reduces the manual effort and expertise needed for\nannotating remote sensing imagery while democratizing access to high-quality\nannotated data. This advancement fosters progress in visual language modeling\nand encourages broader participation in remote sensing research and\napplications. The RSTeller dataset is available at\nhttps://github.com/SlytherinGe/RSTeller.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"PQVn3bJGnQh4Q1d4wauSzMMzYDtzxLgTvYX0bFReJLA","pdfSize":"3054450"}
