{"id":"2408.10891","title":"Future exoplanet direct imaging instruments: Simulating spatial light\n  modulator-based pixelated focal-plane coronagraphy","authors":"Liurong Lin, Axel Potier, Ruben Tandon, Jonas G. K\\\"uhn","authorsParsed":[["Lin","Liurong",""],["Potier","Axel",""],["Tandon","Ruben",""],["Kühn","Jonas G.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 14:20:55 GMT"}],"updateDate":"2024-08-21","timestamp":1724163655000,"abstract":"  The programmable Liquid-crystal Active Coronagraphic Imager for the DAG\nTelescope (PLACID) instrument will be installed on the Turkish 4-m Telescope by\nthe fall of 2024 and is expected to be on-sky by the end of the year. PLACID\nwill be the first ''active stellar coronagraph instrument'', equipped with a\ncustomized spatial light modulator (SLM), which performs as a dynamically\nprogrammable focal-plane phase mask (FPM) from H- to Ks- band. A Python-based\nnumerical simulator of SLM-based focal-plane phase coronagraph is developed to\ninvestigate the effects of discrete pixelated FPM patterns in place of\nclassical phase masks. The simulator currently explores the impacts of two\ndesign choices, spatial sampling in the coronagraphic focal-plane (number of\nSLM pixels per $\\lambda$/D) and phase resolution (SLM greylevel steps). The\npreliminary results of the monochromatic simulations show that in ideal\nconditions (no wavefront errors) it is sufficient to use FPMs with spatial\nsampling of 10 SLM pixel per $\\lambda$/D and phase resolution of 8 bits. The\ntool is expected to enable detailed simulations of PLACID or similar SLM-based\ninstruments, and to help with real-time operations (optimal choice of FPM for\ngiven observing conditions) and interpretation of real data. Additionally, the\ntool is designed to integrate and simulate advanced operation modes, in\nparticular focal-plane phase diversity for coherent differential imaging (CDI)\nof exoplanets.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}