{"id":"2408.06260","title":"Exploring the links between quasar winds and radio emission along the\n  Main Sequence at high redshift","authors":"A. Deconto-Machado, A. del Olmo, P. Marziani","authorsParsed":[["Deconto-Machado","A.",""],["del Olmo","A.",""],["Marziani","P.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 16:18:24 GMT"}],"updateDate":"2024-08-13","timestamp":1723479504000,"abstract":"  Despite the increasing prevalence of RL sources at cosmic noon, our\nunderstanding of the underlying physics that governs the accretion disc\noutflows in these particular sources and its dissimilarity with RQ quasars\nremains somewhat limited. Disentangling the real impact of the radio-loudness\nand accretion on the outflow parameters remains a challenge to this day. We\npresent 10 new spectra of high-z high-L quasars, combined with previous data at\nboth high and low z and evaluate the role of the feedback from RL and RQ AGN.\nThe final high-z high-L sample consists of a combination of 60 quasars from our\nISAAC and the Hamburg-ESO surveys. The low-z sample has 84 quasars with optical\nand FOS reanalyzed data. We perform a multicomponent analysis of optical and UV\nemission line profiles along the quasar MS, and provide a relation to estimate\nthe outflow main parameters in both the BLR and NLR through the analysis of the\n[OIII]5007 and CIV1549 emission lines. High-ionization lines usually present a\nsignificant asymmetry towards the blue especially in RQ that is strong evidence\nof outflow motions. In the ISAAC sample, 72% of the quasars present significant\nO[III] outflows, with c(1/2) ~ -250 km/s. RL tend to present slightly more\nmodest blueshifted components. The behavior of [OIII]5007 mirrors the one of\nCIV1549, with blueshift amplitudes between the two lines showing a high degree\nof correlation that appears unaffected by the presence of radio emission. Both\nRL and RQ AGN outflow parameters at high L appear in the range needed to\nprovide feedback effects on their host galaxies. Both high- and low-z RL\nquasars exhibit smaller outflows compared to RQ, suggesting a potential role of\nradioloudness in mitigating outflow effects. Nevertheless, the radio-loudness\neffect on the AGN feedback is much less significant than the one of accretion\nthat emerges as the main driver of the nuclear outflows.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}