{"id":"2408.04491","title":"Towards Synergistic Deep Learning Models for Volumetric Cirrhotic Liver\n  Segmentation in MRIs","authors":"Vandan Gorade, Onkar Susladkar, Gorkem Durak, Elif Keles, Ertugrul\n  Aktas, Timurhan Cebeci, Alpay Medetalibeyoglu, Daniela Ladner, Debesh Jha,\n  and Ulas Bagci","authorsParsed":[["Gorade","Vandan",""],["Susladkar","Onkar",""],["Durak","Gorkem",""],["Keles","Elif",""],["Aktas","Ertugrul",""],["Cebeci","Timurhan",""],["Medetalibeyoglu","Alpay",""],["Ladner","Daniela",""],["Jha","Debesh",""],["Bagci","Ulas",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 14:41:32 GMT"}],"updateDate":"2024-08-09","timestamp":1723128092000,"abstract":"  Liver cirrhosis, a leading cause of global mortality, requires precise\nsegmentation of ROIs for effective disease monitoring and treatment planning.\nExisting segmentation models often fail to capture complex feature interactions\nand generalize across diverse datasets. To address these limitations, we\npropose a novel synergistic theory that leverages complementary latent spaces\nfor enhanced feature interaction modeling. Our proposed architecture,\nnnSynergyNet3D integrates continuous and discrete latent spaces for 3D volumes\nand features auto-configured training. This approach captures both fine-grained\nand coarse features, enabling effective modeling of intricate feature\ninteractions. We empirically validated nnSynergyNet3D on a private dataset of\n628 high-resolution T1 abdominal MRI scans from 339 patients. Our model\noutperformed the baseline nnUNet3D by approximately 2%. Additionally, zero-shot\ntesting on healthy liver CT scans from the public LiTS dataset demonstrated\nsuperior cross-modal generalization capabilities. These results highlight the\npotential of synergistic latent space models to improve segmentation accuracy\nand robustness, thereby enhancing clinical workflows by ensuring consistency\nacross CT and MRI modalities.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}