{"id":"2408.10883","title":"DAAD: Dynamic Analysis and Adaptive Discriminator for Fake News\n  Detection","authors":"Xinqi Su, Yawen Cui, Ajian Liu, Xun Lin, Yuhao Wang, Haochen Liang,\n  Wenhui Li, Zitong Yu","authorsParsed":[["Su","Xinqi",""],["Cui","Yawen",""],["Liu","Ajian",""],["Lin","Xun",""],["Wang","Yuhao",""],["Liang","Haochen",""],["Li","Wenhui",""],["Yu","Zitong",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 14:13:54 GMT"}],"updateDate":"2024-08-21","timestamp":1724163234000,"abstract":"  In current web environment, fake news spreads rapidly across online social\nnetworks, posing serious threats to society. Existing multimodal fake news\ndetection (MFND) methods can be classified into knowledge-based and\nsemantic-based approaches. However, these methods are overly dependent on human\nexpertise and feedback, lacking flexibility. To address this challenge, we\npropose a Dynamic Analysis and Adaptive Discriminator (DAAD) approach for fake\nnews detection. For knowledge-based methods, we introduce the Monte Carlo Tree\nSearch (MCTS) algorithm to leverage the self-reflective capabilities of large\nlanguage models (LLMs) for prompt optimization, providing richer,\ndomain-specific details and guidance to the LLMs, while enabling more flexible\nintegration of LLM comment on news content. For semantic-based methods, we\ndefine four typical deceit patterns: emotional exaggeration, logical\ninconsistency, image manipulation, and semantic inconsistency, to reveal the\nmechanisms behind fake news creation. To detect these patterns, we carefully\ndesign four discriminators and expand them in depth and breadth, using the\nsoft-routing mechanism to explore optimal detection models. Experimental\nresults on three real-world datasets demonstrate the superiority of our\napproach. The code will be available at: https://github.com/SuXinqi/DAAD.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}