{"id":"2408.15811","title":"Identifying Influential and Vulnerable Nodes in Interaction Networks\n  through Estimation of Transfer Entropy Between Univariate and Multivariate\n  Time Series","authors":"Julian Lee","authorsParsed":[["Lee","Julian",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 14:11:59 GMT"}],"updateDate":"2024-08-29","timestamp":1724854319000,"abstract":"  Transfer entropy (TE) is a powerful tool for measuring causal relationships\nwithin interaction networks. Traditionally, TE and its conditional variants are\napplied pairwise between dynamic variables to infer these causal relationships.\nHowever, identifying the most influential or vulnerable node in a system\nrequires measuring the causal influence of each component on the entire system\nand vice versa. In this paper, I propose using outgoing and incoming transfer\nentropy-where outgoing TE quantifies the influence of a node on the rest of the\nsystem, and incoming TE measures the influence of the rest of the system on the\nnode. The node with the highest outgoing TE is identified as the most\ninfluential, or \"hub\", while the node with the highest incoming TE is the most\nvulnerable, or \"anti-hub\". Since these measures involve transfer entropy\nbetween univariate and multivariate time series, naive estimation methods can\nresult in significant errors, particularly when the number of variables is\ncomparable to or exceeds the number of samples. To address this, I introduce a\nnovel estimation scheme that computes outgoing and incoming TE only between\nsignificantly interacting partners. The feasibility of this approach is\ndemonstrated by using synthetic data, and by applying it to a real data of oral\nmicrobiota. The method successfully identifies the bacterial species known to\nbe key players in the bacterial community, demonstrating the power of the new\nmethod.\n","subjects":["Condensed Matter/Statistical Mechanics","Physics/Biological Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}