{"id":"2408.10733","title":"Classification of Endoscopy and Video Capsule Images using\n  CNN-Transformer Model","authors":"Aliza Subedi, Smriti Regmi, Nisha Regmi, Bhumi Bhusal, Ulas Bagci, and\n  Debesh Jha","authorsParsed":[["Subedi","Aliza",""],["Regmi","Smriti",""],["Regmi","Nisha",""],["Bhusal","Bhumi",""],["Bagci","Ulas",""],["Jha","Debesh",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 11:05:32 GMT"}],"updateDate":"2024-08-21","timestamp":1724151932000,"abstract":"  Gastrointestinal cancer is a leading cause of cancer-related incidence and\ndeath, making it crucial to develop novel computer-aided diagnosis systems for\nearly detection and enhanced treatment. Traditional approaches rely on the\nexpertise of gastroenterologists to identify diseases; however, this process is\nsubjective, and interpretation can vary even among expert clinicians.\nConsidering recent advancements in classifying gastrointestinal anomalies and\nlandmarks in endoscopic and video capsule endoscopy images, this study proposes\na hybrid model that combines the advantages of Transformers and Convolutional\nNeural Networks (CNNs) to enhance classification performance. Our model\nutilizes DenseNet201 as a CNN branch to extract local features and integrates a\nSwin Transformer branch for global feature understanding, combining both to\nperform the classification task. For the GastroVision dataset, our proposed\nmodel demonstrates excellent performance with Precision, Recall, F1 score,\nAccuracy, and Matthews Correlation Coefficient (MCC) of 0.8320, 0.8386, 0.8324,\n0.8386, and 0.8191, respectively, showcasing its robustness against class\nimbalance and surpassing other CNNs as well as the Swin Transformer model.\nSimilarly, for the Kvasir-Capsule, a large video capsule endoscopy dataset, our\nmodel outperforms all others, achieving overall Precision, Recall, F1 score,\nAccuracy, and MCC of 0.7007, 0.7239, 0.6900, 0.7239, and 0.3871. Moreover, we\ngenerated saliency maps to explain our model's focus areas, demonstrating its\nreliable decision-making process. The results underscore the potential of our\nhybrid CNN-Transformer model in aiding the early and accurate detection of\ngastrointestinal (GI) anomalies.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}