{"id":"2408.08363","title":"GraphQL Adoption and Challenges: Community-Driven Insights from\n  StackOverflow Discussions","authors":"Saleh Amareen and Obed Soto Dector and Ali Dado and Amiangshu Bosu","authorsParsed":[["Amareen","Saleh",""],["Dector","Obed Soto",""],["Dado","Ali",""],["Bosu","Amiangshu",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 18:08:13 GMT"}],"updateDate":"2024-08-19","timestamp":1723745293000,"abstract":"  GraphQL is a query language and web application programming interface (API)\nfor client-server architecture. Its advantages include type-safe queries, which\nallow clients to retrieve the data they require precisely in a single request.\nAs organizations adopt GraphQL for API implementations, it is imperative to\nunderstand its challenges and the software community's interests. To achieve\nthis goal, we conducted a five-step mixed-method empirical analysis of 45K\nStackOverflow questions and answers on GraphQL. In the first step, we derive a\nreference architecture for the GraphQL ecosystem with five key layers. Second,\nwe used topic modeling based on Latent Dirichlet Allocation (LDA) to\nautomatically identify 14 topics and 47 subtopics. Third, we mapped discussion\ntopics to architecture layers. Fourth, we manually investigate questions on\neach topic and subtopics to provide additional insight to the GraphQL\nstakeholders. Finally, we study topic difficulty, popularity, trends, and\ntradeoffs to provide insights into evolving community interests and challenges.\nOur results indicate that Client and Server are the top two architectural\nlayers attracting discussion on SO. While earlier discussions on SO focused on\nbuilding third-party applications consuming GraphQL APIs (i.e., API\nIntegration) released by large organizations, recent trends suggest more\norganizations implementing APIs using GraphQL servers. Due to difficulty and\nlack of well-defined solutions, security remains a difficult and low-interest\narea. However, such a practice can lead to vulnerable APIs.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}