{"id":"2408.08127","title":"The evolution of inharmonicity and noisiness in contemporary popular\n  music","authors":"Emmanuel Deruty, David Meredith and Stefan Lattner","authorsParsed":[["Deruty","Emmanuel",""],["Meredith","David",""],["Lattner","Stefan",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 12:52:40 GMT"}],"updateDate":"2024-08-16","timestamp":1723726360000,"abstract":"  Much of Western classical music uses instruments based on acoustic resonance.\nSuch instruments produce harmonic or quasi-harmonic sounds. On the other hand,\nsince the early 1970s, popular music has largely been produced in the recording\nstudio. As a result, popular music is not bound to be based on harmonic or\nquasi-harmonic sounds. In this study, we use modified MPEG-7 features to\nexplore and characterise the way in which the use of noise and inharmonicity\nhas evolved in popular music since 1961. We set this evolution in the context\nof other broad categories of music, including Western classical piano music,\nWestern classical orchestral music, and musique concr\\`ete. We propose new\nfeatures that allow us to distinguish between inharmonicity resulting from\nnoise and inharmonicity resulting from interactions between relatively discrete\npartials. When the history of contemporary popular music is viewed through the\nlens of these new features, we find that the period since 1961 can be divided\ninto three phases. From 1961 to 1972, there was a steady increase in\ninharmonicity but no significant increase in noise. From 1972 to 1986, both\ninharmonicity and noise increased. Then, since 1986, there has been a steady\ndecrease in both inharmonicity and noise to today's popular music which is\nsignificantly less noisy but more inharmonic than the music of the sixties. We\nrelate these observed trends to the development of music production practice\nover the period and illustrate them with focused analyses of certain key\nartists and tracks.\n","subjects":["Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}