{"id":"2408.16628","title":"Sliding Wigner crystals in bilayer graphene at zero and finite magnetic\n  fields","authors":"Anna M. Seiler, Martin Statz, Christian Eckel, Isabell Weimer, Jonas\n  P\\\"ohls, Kenji Watanabe, Takashi Taniguchi, Fan Zhang, R. Thomas Weitz","authorsParsed":[["Seiler","Anna M.",""],["Statz","Martin",""],["Eckel","Christian",""],["Weimer","Isabell",""],["Pöhls","Jonas",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Zhang","Fan",""],["Weitz","R. Thomas",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 15:36:07 GMT"}],"updateDate":"2024-08-30","timestamp":1724945767000,"abstract":"  AB-stacked bilayer graphene has emerged as a fascinating yet simple platform\nfor exploring macroscopic quantum phenomena of correlated electrons.\nUnexpectedly, an insulating phase has recently been observed when a large\nelectric displacement field is applied and the charge carrier density is tuned\nto the vicinity of an ultra-low-density van Hove singularity. This phase\nexhibits features consistent with Wigner crystallization, including a\ncharacteristic temperature dependence and non-linear current bias behavior.\nHowever, more direct evidence for the emergence of an electron crystal in\nAB-stacked bilayer graphene at zero magnetic field remains elusive. Here we\nexplore the low-frequency noise generated by the depinning and sliding of the\nWigner crystal lattice. The current bias and frequency dependence of these\nnoise spectra align well with findings from previous experimental and\ntheoretical studies on the quantum electron solids. Our results offer a\ncompelling transport signature of Wigner crystallization in AB-stacked bilayer\ngraphene at zero and finite magnetic fields, paving the way for further\nsubstantiating an anomalous Hall crystal in its original form.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}