{"id":"2408.16460","title":"Unveiling Low-Frequency Eclipses in Spider MSPs using wideband GMRT\n  Observations","authors":"Sangita Kumari, Bhaswati Bhattacharyya, Devojyoti Kansabanik, Rahul\n  Sharan, Ankita Ghosh, Jayanta Roy","authorsParsed":[["Kumari","Sangita",""],["Bhattacharyya","Bhaswati",""],["Kansabanik","Devojyoti",""],["Sharan","Rahul",""],["Ghosh","Ankita",""],["Roy","Jayanta",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 11:47:54 GMT"}],"updateDate":"2024-08-30","timestamp":1724932074000,"abstract":"  Eclipses of radio emission have been reported for ~ 58 spider millisecond\npulsars (MSP), of which only around 19% have been extensively studied. Such\nstudies at low frequencies are crucial for probing the properties of the\neclipse medium, as eclipses are more prominent at such frequencies. This study\ninvestigates eclipses in 10 MSPs in compact orbit using wide-bandwidth\nobservations with the upgraded Giant Metrewave Radio Telescope. We report the\nfirst evidence of eclipsing for PSR J2234+0944 and J2214+3000 in one epoch,\nwhile no evidence of eclipsing was observed in the subsequent two epochs,\nindicating temporal evolution of the eclipse cutoff frequency in these systems.\nConstraints on the eclipse cutoff frequency were obtained for PSR J1555-2908,\nJ1810+1744, and J2051-0827. Moreover, for the first time, we detected an\neclipse at a non-standard orbital phase (~ 0.5) for PSR J1810+1744, with a\nduration longer than the eclipse observed at superior conjunction. No eclipses\nwere detected for PSR J0751+1807, J1738+0333, and J1807-2459A at 300-500 MHz\nand 550-750 MHz, for which we discuss the possible reasons. We calculated the\nmass loss rates of the companions for PSR J1555-2908 and PSR J1810+1744, and\nfound that these rates are insufficient to ablate the companion stars. We\ncataloged the $\\dot{E}/a^2$, mass function, roche lobe filling factor, and\ninclination angle for compact MSP binaries with low-mass companions and found\nthat higher spin-down flux does not guarantee eclipses. Our analysis, supported\nby the Kolmogorov-Smirnov statistic, reveals that eclipsing black widow\nbinaries generally exhibit a higher mass function compared to non-eclipsing\nblack widow binaries, as reported by previous studies for a limited sample of\nblack widow MSPs.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}