{"id":"2408.02033","title":"Enhancing Human Action Recognition and Violence Detection Through Deep\n  Learning Audiovisual Fusion","authors":"Pooya Janani (1), Amirabolfazl Suratgar (1), Afshin Taghvaeipour (2)\n  ((1) Distributed and Intelligent Optimization Research Laboratory, Dept. of\n  Electrical Engineering, Amirkabir University of Technology, Tehran, Iran, (2)\n  Dept. of Mechanical Engineering, Amirkabir University of Technology, Tehran,\n  Iran)","authorsParsed":[["Janani","Pooya",""],["Suratgar","Amirabolfazl",""],["Taghvaeipour","Afshin",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 13:51:18 GMT"}],"updateDate":"2024-08-06","timestamp":1722779478000,"abstract":"  This paper proposes a hybrid fusion-based deep learning approach based on two\ndifferent modalities, audio and video, to improve human activity recognition\nand violence detection in public places. To take advantage of audiovisual\nfusion, late fusion, intermediate fusion, and hybrid fusion-based deep learning\n(HFBDL) are used and compared. Since the objective is to detect and recognize\nhuman violence in public places, Real-life violence situation (RLVS) dataset is\nexpanded and used. Simulating results of HFBDL show 96.67\\% accuracy on\nvalidation data, which is more accurate than the other state-of-the-art methods\non this dataset. To showcase our model's ability in real-world scenarios,\nanother dataset of 54 sounded videos of both violent and non-violent situations\nwas recorded. The model could successfully detect 52 out of 54 videos\ncorrectly. The proposed method shows a promising performance on real scenarios.\nThus, it can be used for human action recognition and violence detection in\npublic places for security purposes.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Computing Research Repository/Multimedia","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}