{"id":"2408.09142","title":"NP-TCMtarget: a network pharmacology platform for exploring mechanisms\n  of action of Traditional Chinese medicine","authors":"Aoyi Wang, Yingdong Wang, Haoyang Peng, Haoran Zhang, Caiping Cheng,\n  Jinzhong Zhao, Wuxia Zhang, Jianxin Chen, Peng Li","authorsParsed":[["Wang","Aoyi",""],["Wang","Yingdong",""],["Peng","Haoyang",""],["Zhang","Haoran",""],["Cheng","Caiping",""],["Zhao","Jinzhong",""],["Zhang","Wuxia",""],["Chen","Jianxin",""],["Li","Peng",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 08:45:38 GMT"}],"updateDate":"2024-08-20","timestamp":1723884338000,"abstract":"  The biological targets of traditional Chinese medicine (TCM) are the core\neffectors mediating the interaction between TCM and the human body.\nIdentification of TCM targets is essential to elucidate the chemical basis and\nmechanisms of TCM for treating diseases. Given the chemical complexity of TCM,\nboth in silico high-throughput drug-target interaction predicting models and\nbiological profile-based methods have been commonly applied for identifying TCM\ntargets based on the structural information of TCM chemical components and\nbiological information, respectively. However, the existing methods lack the\nintegration of TCM chemical and biological information, resulting in difficulty\nin the systematic discovery of TCM action pathways. To solve this problem, we\npropose a novel target identification model NP-TCMtarget to explore the TCM\ntarget path by combining the overall chemical and biological profiles. First,\nNP-TCMtarget infers TCM effect targets by calculating associations between\ndrug/disease inducible gene expression profiles and specific gene signatures\nfor 8,233 targets. Then, NP-TCMtarget utilizes a constructed binary\nclassification model to predict binding targets of herbal ingredients. Finally,\nwe can distinguish TCM direct and indirect targets by comparing the effect\ntargets and binding targets to establish the action pathways of herbal\ncomponents-direct targets-indirect targets by mapping TCM targets in the\nbiological molecular network. We apply NP-TCMtarget to the formula XiaoKeAn to\ndemonstrate the power of revealing the action pathways of herbal formula. We\nexpect that this novel model could provide a systematic framework for exploring\nthe molecular mechanisms of TCM at the target level. NP-TCMtarget is available\nat http://www.bcxnfz.top/NP-TCMtarget.\n","subjects":["Quantitative Biology/Molecular Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}