{"id":"2408.09319","title":"On the Formation of Planets in the Milky Way's Thick Disk","authors":"Tim Hallatt and Eve J. Lee","authorsParsed":[["Hallatt","Tim",""],["Lee","Eve J.",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 00:56:34 GMT"}],"updateDate":"2024-08-20","timestamp":1723942594000,"abstract":"  Exoplanet demographic surveys have revealed that close-in (${\\lesssim}$1 au)\nsmall planets orbiting stars in the Milky Way's thick disk are ${\\sim}50\\%$\nless abundant than those orbiting stars in the Galactic thin disk. One key\ndifference between the two stellar populations is the time at which they\nemerged: thick disk stars are the likely product of cosmic noon (redshift $z\n{\\sim}2$), an era characterized by high star formation rate, massive and dense\nmolecular clouds, and strong supersonic turbulence. Solving for the background\nradiation field in these early star-forming regions, we demonstrate that\nprotoplanetary disks at cosmic noon experienced radiation fields up to\n${\\sim}7$ orders of magnitude more intense than in solar neighborhood\nconditions. Coupling the radiation field to a one-dimensional protoplanetary\ndisk evolution model, we find that external UV photoevaporation destroys\nprotoplanetary disks in just ${\\sim}$0.2--0.5 Myr, limiting the timescale over\nwhich planets can assemble. Disk temperatures exceed the sublimation\ntemperatures of common volatile species for ${\\gtrsim}$Myr timescales,\npredicting more spatial homogeneity in gas chemical composition. Our\ncalculations imply that the deficit in planet occurrence around thick disk\nstars should be even more pronounced for giant planets, particularly those at\nwide orbital separations, predicting a higher rocky-to-giant planet ratio in\nthe Galactic thick disk vs.~thin disk.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}