{"id":"2408.04372","title":"A Space-Time Multigrid Method for Space-Time Finite Element\n  Discretizations of Parabolic and Hyperbolic PDEs","authors":"Nils Margenberg and Peter Munch","authorsParsed":[["Margenberg","Nils",""],["Munch","Peter",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 11:09:15 GMT"}],"updateDate":"2024-08-12","timestamp":1723115355000,"abstract":"  We present a space-time multigrid method based on tensor-product space-time\nfinite element discretizations. The method is facilitated by the matrix-free\ncapabilities of the {\\ttfamily deal.II} library. It addresses both high-order\ncontinuous and discontinuous variational time discretizations with spatial\nfinite element discretizations. The effectiveness of multigrid methods in\nlarge-scale stationary problems is well established. However, their application\nin the space-time context poses significant challenges, mainly due to the\nconstruction of suitable smoothers. To address these challenges, we develop a\nspace-time cell-wise additive Schwarz smoother and demonstrate its\neffectiveness on the heat and acoustic wave equations. The matrix-free\nframework of the {\\ttfamily deal.II} library supports various multigrid\nstrategies, including $h$-, $p$-, and $hp$-refinement across spatial and\ntemporal dimensions. Extensive empirical evidence, provided through scaling and\nconvergence tests on high-performance computing platforms, demonstrate high\nperformance on perturbed meshes and problems with heterogeneous and\ndiscontinuous coefficients. Throughputs of over a billion degrees of freedom\nper second are achieved on problems with more than a trillion global degrees of\nfreedom. The results prove that the space-time multigrid method can effectively\nsolve complex problems in high-fidelity simulations and show great potential\nfor use in coupled problems.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}