{"id":"2408.04158","title":"Efficient Single Image Super-Resolution with Entropy Attention and\n  Receptive Field Augmentation","authors":"Xiaole Zhao, Linze Li, Chengxing Xie, Xiaoming Zhang, Ting Jiang,\n  Wenjie Lin, Shuaicheng Liu, Tianrui Li","authorsParsed":[["Zhao","Xiaole",""],["Li","Linze",""],["Xie","Chengxing",""],["Zhang","Xiaoming",""],["Jiang","Ting",""],["Lin","Wenjie",""],["Liu","Shuaicheng",""],["Li","Tianrui",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 02:03:10 GMT"}],"updateDate":"2024-08-09","timestamp":1723082590000,"abstract":"  Transformer-based deep models for single image super-resolution (SISR) have\ngreatly improved the performance of lightweight SISR tasks in recent years.\nHowever, they often suffer from heavy computational burden and slow inference\ndue to the complex calculation of multi-head self-attention (MSA), seriously\nhindering their practical application and deployment. In this work, we present\nan efficient SR model to mitigate the dilemma between model efficiency and SR\nperformance, which is dubbed Entropy Attention and Receptive Field Augmentation\nnetwork (EARFA), and composed of a novel entropy attention (EA) and a shifting\nlarge kernel attention (SLKA). From the perspective of information theory, EA\nincreases the entropy of intermediate features conditioned on a Gaussian\ndistribution, providing more informative input for subsequent reasoning. On the\nother hand, SLKA extends the receptive field of SR models with the assistance\nof channel shifting, which also favors to boost the diversity of hierarchical\nfeatures. Since the implementation of EA and SLKA does not involve complex\ncomputations (such as extensive matrix multiplications), the proposed method\ncan achieve faster nonlinear inference than Transformer-based SR models while\nmaintaining better SR performance. Extensive experiments show that the proposed\nmodel can significantly reduce the delay of model inference while achieving the\nSR performance comparable with other advanced models.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}