{"id":"2408.11272","title":"High-Dimensional Overdispersed Generalized Factor Model with Application\n  to Single-Cell Sequencing Data Analysis","authors":"Jinyu Nie, Zhilong Qin, Wei Liu","authorsParsed":[["Nie","Jinyu",""],["Qin","Zhilong",""],["Liu","Wei",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 01:47:06 GMT"}],"updateDate":"2024-08-22","timestamp":1724204826000,"abstract":"  The current high-dimensional linear factor models fail to account for the\ndifferent types of variables, while high-dimensional nonlinear factor models\noften overlook the overdispersion present in mixed-type data. However,\noverdispersion is prevalent in practical applications, particularly in fields\nlike biomedical and genomics studies. To address this practical demand, we\npropose an overdispersed generalized factor model (OverGFM) for performing\nhigh-dimensional nonlinear factor analysis on overdispersed mixed-type data.\nOur approach incorporates an additional error term to capture the\noverdispersion that cannot be accounted for by factors alone. However, this\nintroduces significant computational challenges due to the involvement of two\nhigh-dimensional latent random matrices in the nonlinear model. To overcome\nthese challenges, we propose a novel variational EM algorithm that integrates\nLaplace and Taylor approximations. This algorithm provides iterative explicit\nsolutions for the complex variational parameters and is proven to possess\nexcellent convergence properties. We also develop a criterion based on the\nsingular value ratio to determine the optimal number of factors. Numerical\nresults demonstrate the effectiveness of this criterion. Through comprehensive\nsimulation studies, we show that OverGFM outperforms state-of-the-art methods\nin terms of estimation accuracy and computational efficiency. Furthermore, we\ndemonstrate the practical merit of our method through its application to two\ndatasets from genomics. To facilitate its usage, we have integrated the\nimplementation of OverGFM into the R package GFM.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"_mN9TR76uMYLOvoVslD3Yij78oNp2UjVV41YJXjWXz0","pdfSize":"5884400"}
