{"id":"2408.07111","title":"Vestigial Gapless Boson Density Wave Emerging between $\\nu = 1/2$\n  Fractional Chern Insulator and Finite-Momentum Supersolid","authors":"Hongyu Lu and Han-Qing Wu and Bin-Bin Chen and Zi Yang Meng","authorsParsed":[["Lu","Hongyu",""],["Wu","Han-Qing",""],["Chen","Bin-Bin",""],["Meng","Zi Yang",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 14:54:20 GMT"}],"updateDate":"2024-08-15","timestamp":1723560860000,"abstract":"  The roton-triggered charge-density-wave (CDW)is widely studied in fractional\nquantum Hall (FQH) and fractional Chern insulator (FCI) systems, and there also\nexist field theoretical and numerical realizations of continuous transition\nfrom FCI to superfluid (SF). However, the theory and numerical explorations of\nthe transition between FCI and supersolid (SS) are still lacking. In this work,\nwe study the topological flat-band lattice models with $\\nu$ = 1/2 hard-core\nbosons, where the previous studies have discovered the existence of FCI states\nand possible direct FCI-SS transitions. While the FCI is robust, we find the\ndirect FCI-SS transition is absent, and there exist more intriguing scenarios.\nIn the case of checkerboard lattice, we find an intermediate gapless CDW state\nwithout SF, sandwiched between FCI and SS. This novel state is triggered by the\nroton instability in FCI and it further continuously brings about the\nintertwined finite-momentum SF fluctuation when the CDW order is strong enough,\neventually transiting into an unconventional finite-momentum SS state. The\nintermediate gapless CDW state is a vestige from the SS state, since the\nincreasing quantum fluctuation melts only the Larkin-Ovchinnikov-type SF order\nin SS but its (secondary) product -- the CDW order -- survives. On honeycomb\nlattice, we find no evidence of SS, but discover an interesting sequence of\nFCI-Solid I-Solid II transitions, with both solids incompressible. Moreover, in\ncontrast to previous single-roton condensation, this sequence of FCI-Solid\nI-Solid II transitions is triggered by the softening of multi-roton modes in\nFCI. Considering the intertwined wave vectors of the CDW orders, Solid I is a\nvestige of Solid II. Our work provides new horizon not only for the quantum\nphase transitions in FCI but also for the intertwined orders and gapless states\nin bosonic systems, which will inspire future studies.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}