{"id":"2408.04207","title":"Theoretical Advantage of Multiobjective Evolutionary Algorithms for\n  Problems with Different Degrees of Conflict","authors":"Weijie Zheng","authorsParsed":[["Zheng","Weijie",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 04:09:52 GMT"}],"updateDate":"2024-08-09","timestamp":1723090192000,"abstract":"  The field of multiobjective evolutionary algorithms (MOEAs) often emphasizes\nits popularity for optimization problems with conflicting objectives. However,\nit is still theoretically unknown how MOEAs perform for different degrees of\nconflict, even for no conflicts, compared with typical approaches outside this\nfield.\n  As the first step to tackle this question, we propose the OneMaxMin$_k$\nbenchmark class with the degree of the conflict $k\\in[0..n]$, a generalized\nvariant of COCZ and OneMinMax. Two typical non-MOEA approaches, scalarization\n(weighted-sum approach) and $\\epsilon$-constraint approach, are considered. We\nprove that for any set of weights, the set of optima found by scalarization\napproach cannot cover the full Pareto front. Although the set of the optima of\nconstrained problems constructed via $\\epsilon$-constraint approach can cover\nthe full Pareto front, the general used ways (via exterior or nonparameter\npenalty functions) to solve such constrained problems encountered difficulties.\nThe nonparameter penalty function way cannot construct the set of optima whose\nfunction values are the Pareto front, and the exterior way helps (with expected\nruntime of $O(n\\ln n)$ for the randomized local search algorithm for reaching\nany Pareto front point) but with careful settings of $\\epsilon$ and $r$\n($r>1/(\\epsilon+1-\\lceil \\epsilon \\rceil)$).\n  In constrast, the generally analyzed MOEAs can efficiently solve\nOneMaxMin$_k$ without above careful designs. We prove that (G)SEMO, MOEA/D,\nNSGA-II, and SMS-EMOA can cover the full Pareto front in $O(\\max\\{k,1\\}n\\ln n)$\nexpected number of function evaluations, which is the same asymptotic runtime\nas the exterior way in $\\epsilon$-constraint approach with careful settings. As\na side result, our results also give the performance analysis of solving a\nconstrained problem via multiobjective way.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}