{"id":"2408.05661","title":"Performance Evaluation of YOLOv8 Model Configurations, for Instance\n  Segmentation of Strawberry Fruit Development Stages in an Open Field\n  Environment","authors":"Abdul-Razak Alhassan Gamani, Ibrahim Arhin, and Adrena Kyeremateng\n  Asamoah","authorsParsed":[["Gamani","Abdul-Razak Alhassan",""],["Arhin","Ibrahim",""],["Asamoah","Adrena Kyeremateng",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 00:33:45 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 08:41:26 GMT"}],"updateDate":"2024-08-14","timestamp":1723336425000,"abstract":"  Accurate identification of strawberries during their maturing stages is\ncrucial for optimizing yield management, and pest control, and making informed\ndecisions related to harvest and post-harvest logistics. This study evaluates\nthe performance of YOLOv8 model configurations for instance segmentation of\nstrawberries into ripe and unripe stages in an open field environment. The\nYOLOv8n model demonstrated superior segmentation accuracy with a mean Average\nPrecision (mAP) of 80.9\\%, outperforming other YOLOv8 configurations. In terms\nof inference speed, YOLOv8n processed images at 12.9 milliseconds, while\nYOLOv8s, the least-performing model, processed at 22.2 milliseconds. Over 86\ntest images with 348 ground truth labels, YOLOv8n detected 235 ripe fruit\nclasses and 51 unripe fruit classes out of 251 ground truth ripe fruits and 97\nunripe ground truth labels, respectively. In comparison, YOLOv8s detected 204\nripe fruits and 37 unripe fruits. Overall, YOLOv8n achieved the fastest\ninference speed of 24.2 milliseconds, outperforming YOLOv8s, YOLOv8m, YOLOv8l,\nand YOLOv8x, which processed images at 33.0 milliseconds, 44.3 milliseconds,\n53.6 milliseconds, and 62.5 milliseconds, respectively. These results\nunderscore the potential of advanced object segmentation algorithms to address\ncomplex visual recognition tasks in open-field agriculture effectively to\naddress complex visual recognition tasks in open-field agriculture effectively.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TdeCNy36Yj5wwtwx4GiTIC3PjCdt9R_aBr-jls66f0Y","pdfSize":"33725371"}
