{"id":"2408.12774","title":"Semi-Supervised Variational Adversarial Active Learning via Learning to\n  Rank and Agreement-Based Pseudo Labeling","authors":"Zongyao Lyu, William J. Beksi","authorsParsed":[["Lyu","Zongyao",""],["Beksi","William J.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 00:35:07 GMT"}],"updateDate":"2024-08-26","timestamp":1724373307000,"abstract":"  Active learning aims to alleviate the amount of labor involved in data\nlabeling by automating the selection of unlabeled samples via an acquisition\nfunction. For example, variational adversarial active learning (VAAL) leverages\nan adversarial network to discriminate unlabeled samples from labeled ones\nusing latent space information. However, VAAL has the following shortcomings:\n(i) it does not exploit target task information, and (ii) unlabeled data is\nonly used for sample selection rather than model training. To address these\nlimitations, we introduce novel techniques that significantly improve the use\nof abundant unlabeled data during training and take into account the task\ninformation. Concretely, we propose an improved pseudo-labeling algorithm that\nleverages information from all unlabeled data in a semi-supervised manner, thus\nallowing a model to explore a richer data space. In addition, we develop a\nranking-based loss prediction module that converts predicted relative ranking\ninformation into a differentiable ranking loss. This loss can be embedded as a\nrank variable into the latent space of a variational autoencoder and then\ntrained with a discriminator in an adversarial fashion for sample selection. We\ndemonstrate the superior performance of our approach over the state of the art\non various image classification and segmentation benchmark datasets.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WMaSa3_NSUrWclmC5OZqfYlzZtwxZrgSBlXjbxnY2IQ","pdfSize":"1284010"}
