{"id":"2408.02992","title":"Towards Smart Microfarming in an Urban Computing Continuum","authors":"Marla Grunewald, Mounir Bensalem, Jasenka Dizdarevi\\'c and Admela\n  Jukan","authorsParsed":[["Grunewald","Marla",""],["Bensalem","Mounir",""],["Dizdarević","Jasenka",""],["Jukan","Admela",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 06:57:49 GMT"}],"updateDate":"2024-08-07","timestamp":1722927469000,"abstract":"  Microfarming and urban computing have evolved as two distinct sustainability\npillars of urban living today. In this paper, we combine these two concepts,\nwhile majorly extending them jointly towards novel concepts of smart\nmicrofarming and urban computing continuum. Smart microfarming is proposed with\napplications of artificial intelligence in microfarming, while an urban\ncomputing continuum is proposed as a major extension of the concept towards an\nefficient IoT-edge-cloud continuum. We propose and build a system architecture\nfor a plant recommendation system that uses machine learning at the edge to\nfind, from a pool of given plants, the most suitable ones for a given microfarm\nusing monitored soil values obtained from IoT sensor devices. Moreover, we\npropose to integrate long-distance LoRa communication solution for sending the\ndata from IoT to the edge system, due to its unlicensed nature and potential\nfor open source implementations. Finally, we propose to integrate open source\nand less constrained application protocol solutions, such as AMQP and HTTP\nprotocols, for storing the data in the cloud. An experimental setup is used to\nevaluate and analyze the performance and reliability of the data collection\nprocedure and the quality of the recommendation solution. Furthermore,\ncollaborative filtering is used for the completion of an incomplete information\nabout soils and plants. Finally, various ML algorithms are applied to identify\nand recommend the optimal plan for a specific microfarm in an urban area.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}