{"id":"2408.04292","title":"Electronic structure of UTe$_2$ under pressure","authors":"Makoto Shimizu and Youichi Yanase","authorsParsed":[["Shimizu","Makoto",""],["Yanase","Youichi",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 08:11:49 GMT"}],"updateDate":"2024-08-09","timestamp":1723104709000,"abstract":"  A heavy-fermion paramagnet UTe$_2$ has been a strong candidate for a\nspin-triplet superconductor. Experiments on \\ute under pressure have been\nvigorously conducted, and rich phase diagrams have been suggested. Multiple\nsuperconducting phases exist in the pressure region of $0 \\leq P < 1.8\n\\mathrm{\\;GPa}$, and an antiferromagnetic ordered state is observed in the\nhigh-pressure region $P > 1.8 \\mathrm{\\;GPa}$. However, under pressure, an\nunderlying electronic structure in the normal state has not been clarified,\nalthough knowledge of electronic structures is essential for studying magnetic\nand superconducting states. As an indispensable step toward understanding the\nphase diagram of UTe$_2$, we study the electronic structure under hydrostatic\nand uniaxial pressures based on density functional theory with and without\nemploying structural optimization. It is shown that the low-energy band\nstructure and Fermi surfaces are not sensitive to pressure for parameters where\nitinerant $f$-electrons are not essential. However, we find significant\npressure dependence for particular Coulomb interaction $U$ of the GGA+$U$\ncalculation, where the large weight of $f$-electrons appears on the Fermi\nlevel. We also discuss the possibility of a pressure-induced Lifshitz\ntransition accompanied by the topological superconducting transition. The\nelectronic structure can change from three-dimensional to two-dimensional under\nuniaxial pressure along the [010] and [001] axes.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mPWxrdgq3UM0ClrdBz4_XAoATj-YywCwjNR9TA_haHo","pdfSize":"2098181"}
