{"id":"2408.06405","title":"Interacting Dirac fields in an expanding universe: dynamical condensates\n  and particle production","authors":"Carlos Fulgado-Claudio, Pablo Sala, Daniel Gonz\\'alez-Cuadra,\n  Alejandro Bermudez","authorsParsed":[["Fulgado-Claudio","Carlos",""],["Sala","Pablo",""],["González-Cuadra","Daniel",""],["Bermudez","Alejandro",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 14:21:25 GMT"}],"updateDate":"2024-08-14","timestamp":1723472485000,"abstract":"  The phenomenon of particle production for quantum field theories in curved\nspacetimes is crucial to understand the large-scale structure of a universe\nfrom an inflationary epoch. In contrast to the free and fixed-background case,\nthe production of particles with strong interactions and back reaction is not\ncompletely understood, especially in situations that require going beyond\nperturbation theory. In this work, we present advances in this direction by\nfocusing on a self-interacting field theory of Dirac fermions in an expanding\nFriedmann-Robertson-Walker universe. By using a Hamiltonian lattice\nregularization with continuous conformal time and rescaled fields, this model\nbecomes amenable to either a cold-atom analogue-gravity quantum simulation, or\na dynamical variational approach. Leveraging a family of variational fermionic\nGaussian states, we investigate how dynamical mass generation and the formation\nof fermion condensates associated to certain broken symmetries modify some\nwell-known results of the free field theory. In particular, we study how the\nnon-perturbative condensates arise and, more importantly, how their real-time\nevolution has an impact on particle production. Depending on the Hubble\nexpansion rate, we find an interesting interplay of interactions and particle\nproduction, including a non-trivial back reaction on the condensates and a\nparity-breaking spectrum of produced particles.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Condensed Matter/Quantum Gases","Physics/High Energy Physics - Lattice","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7caxiWnR_45hprZRywf0pwi88BdrbGcMQcoDPVHf0Ec","pdfSize":"7426031"}
