{"id":"2408.10694","title":"MsMemoryGAN: A Multi-scale Memory GAN for Palm-vein Adversarial\n  Purification","authors":"Huafeng Qin, Yuming Fu, Huiyan Zhang, Mounim A. El-Yacoubi, Xinbo Gao,\n  Qun Song, Jun Wang","authorsParsed":[["Qin","Huafeng",""],["Fu","Yuming",""],["Zhang","Huiyan",""],["El-Yacoubi","Mounim A.",""],["Gao","Xinbo",""],["Song","Qun",""],["Wang","Jun",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 09:46:30 GMT"}],"updateDate":"2024-08-21","timestamp":1724147190000,"abstract":"  Deep neural networks have recently achieved promising performance in the vein\nrecognition task and have shown an increasing application trend, however, they\nare prone to adversarial perturbation attacks by adding imperceptible\nperturbations to the input, resulting in making incorrect recognition. To\naddress this issue, we propose a novel defense model named MsMemoryGAN, which\naims to filter the perturbations from adversarial samples before recognition.\nFirst, we design a multi-scale autoencoder to achieve high-quality\nreconstruction and two memory modules to learn the detailed patterns of normal\nsamples at different scales. Second, we investigate a learnable metric in the\nmemory module to retrieve the most relevant memory items to reconstruct the\ninput image. Finally, the perceptional loss is combined with the pixel loss to\nfurther enhance the quality of the reconstructed image. During the training\nphase, the MsMemoryGAN learns to reconstruct the input by merely using fewer\nprototypical elements of the normal patterns recorded in the memory. At the\ntesting stage, given an adversarial sample, the MsMemoryGAN retrieves its most\nrelevant normal patterns in memory for the reconstruction. Perturbations in the\nadversarial sample are usually not reconstructed well, resulting in purifying\nthe input from adversarial perturbations. We have conducted extensive\nexperiments on two public vein datasets under different adversarial attack\nmethods to evaluate the performance of the proposed approach. The experimental\nresults show that our approach removes a wide variety of adversarial\nperturbations, allowing vein classifiers to achieve the highest recognition\naccuracy.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}