{"id":"2408.13918","title":"Geo-Llama: Leveraging LLMs for Human Mobility Trajectory Generation with\n  Spatiotemporal Constraints","authors":"Siyu Li, Toan Tran, Haowen Lin, John Krumm, Cyrus Shahabi, Li Xiong","authorsParsed":[["Li","Siyu",""],["Tran","Toan",""],["Lin","Haowen",""],["Krumm","John",""],["Shahabi","Cyrus",""],["Xiong","Li",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 19:03:46 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 06:16:42 GMT"},{"version":"v3","created":"Tue, 10 Sep 2024 18:34:23 GMT"}],"updateDate":"2024-09-12","timestamp":1724612626000,"abstract":"  Simulating human mobility data is essential for various application domains,\nincluding transportation, urban planning, and epidemic control, since real data\nare often inaccessible to researchers due to expensive costs and privacy\nissues. Several existing deep generative solutions propose learning from real\ntrajectories to generate synthetic ones. Despite the progress, most of them\nsuffer from training stability issues and scale poorly with growing data size.\nMore importantly, they generally lack control mechanisms to steer the generated\ntrajectories based on spatiotemporal constraints such as fixing specific\nvisits. To address such limitations, we formally define the controlled\ntrajectory generation problem with spatiotemporal constraints and propose\nGeo-Llama. This novel LLM-inspired framework enforces explicit visit\nconstraints in a contextually coherent way. It fine-tunes pre-trained LLMs on\ntrajectories with a visit-wise permutation strategy where each visit\ncorresponds to a time and location. This enables the model to capture the\nspatiotemporal patterns regardless of visit orders and allows flexible and\nin-context constraint integration through prompts during generation. Extensive\nexperiments on real-world and synthetic datasets validate the effectiveness of\nGeo-Llama, demonstrating its versatility and robustness in handling a broad\nrange of constraints to generate more realistic trajectories compared to\nexisting methods.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}