{"id":"2408.16056","title":"Extremal rotating BTZ black holes cannot be dressed in (anti-)self-dual\n  Maxwell field","authors":"Hideki Maeda, Jiri Podolsky","authorsParsed":[["Maeda","Hideki",""],["Podolsky","Jiri",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:00:14 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 12:21:59 GMT"}],"updateDate":"2024-09-06","timestamp":1724868014000,"abstract":"  Under the (anti-)self-dual condition for orthonormal components of the\nFaraday tensor, the 3D Einstein-Maxwell system with a negative cosmological\nconstant $\\Lambda$ admits a solution obtained by Kamata and Koikawa and later\nby Cataldo and Salgado in the most general form. Actually, Clement first\nobtained this solution and interpreted it as a regular particle-like solution\nwithout horizon. Nevertheless, it has been erroneously stated in some\nliterature that this Clement-Cataldo-Salgado (CCS) solution, locally\ncharacterized by a single parameter, describes a black hole even in the charged\ncase as it reduces to the extremal rotating Banados-Teitelboim-Zanelli (BTZ)\nsolution in the vacuum limit and its curvature invariants are constant. In this\npaper, we supplement Clement's interpretation by showing that there appears a\nparallelly propagated curvature singularity corresponding to an infinite affine\nparameter along spacelike geodesics at the location of the Killing horizon in\nthe extremal rotating BTZ solution when the (anti-)self-dual Maxwell field is\nadded. If the spatial coordinate $\\theta$ is periodic, closed timelike curves\nexist near the singularity. It is also shown that the CCS solution is of the\nCotton type N (in contrast to charged rotating BTZ black holes which are of\ntype I away from the horizon), and the energy-momentum tensor of the Maxwell\nfield is of the Hawking-Ellis type II. The metric solves the Einstein-$\\Lambda$\nequations also with a massless scalar field or a null dust fluid. We\ndemonstrate that it belongs to the Kundt shear-free, non-twisting,\nnon-expanding class of geometries, whereas extremal rotating BTZ black holes\nhave expanding principal null directions. It means that the CCS metric\nrepresents the specific null (\"radiative\") Maxwell field generated by a\nsingular source, rather than an extremal rotating BTZ black hole dressed in an\n(anti-)self-dual Maxwell field.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}