{"id":"2408.05706","title":"Decoder Pre-Training with only Text for Scene Text Recognition","authors":"Shuai Zhao and Yongkun Du and Zhineng Chen and Yu-Gang Jiang","authorsParsed":[["Zhao","Shuai",""],["Du","Yongkun",""],["Chen","Zhineng",""],["Jiang","Yu-Gang",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 06:36:42 GMT"}],"updateDate":"2024-08-13","timestamp":1723358202000,"abstract":"  Scene text recognition (STR) pre-training methods have achieved remarkable\nprogress, primarily relying on synthetic datasets. However, the domain gap\nbetween synthetic and real images poses a challenge in acquiring feature\nrepresentations that align well with images on real scenes, thereby limiting\nthe performance of these methods. We note that vision-language models like\nCLIP, pre-trained on extensive real image-text pairs, effectively align images\nand text in a unified embedding space, suggesting the potential to derive the\nrepresentations of real images from text alone. Building upon this premise, we\nintroduce a novel method named Decoder Pre-training with only text for STR\n(DPTR). DPTR treats text embeddings produced by the CLIP text encoder as pseudo\nvisual embeddings and uses them to pre-train the decoder. An Offline Randomized\nPerturbation (ORP) strategy is introduced. It enriches the diversity of text\nembeddings by incorporating natural image embeddings extracted from the CLIP\nimage encoder, effectively directing the decoder to acquire the potential\nrepresentations of real images. In addition, we introduce a Feature Merge Unit\n(FMU) that guides the extracted visual embeddings focusing on the character\nforeground within the text image, thereby enabling the pre-trained decoder to\nwork more efficiently and accurately. Extensive experiments across various STR\ndecoders and language recognition tasks underscore the broad applicability and\nremarkable performance of DPTR, providing a novel insight for STR pre-training.\nCode is available at https://github.com/Topdu/OpenOCR\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"L61Y72rOmFIMGwJzetQ0w3_1IfmA0HpIZErQhP9f9wI","pdfSize":"2793660"}
