{"id":"2408.11100","title":"Distinguishing between light curves of ellipsoidal variables with\n  massive dark companions, contact binaries, and semidetached binaries using\n  principal component analysis","authors":"Milan Pe\\v{s}ta and Ond\\v{r}ej Pejcha","authorsParsed":[["Pešta","Milan",""],["Pejcha","Ondřej",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 18:00:05 GMT"}],"updateDate":"2024-08-22","timestamp":1724176805000,"abstract":"  Photometric methods for identifying dark companion binaries - binary systems\nhosting quiescent black holes and neutron stars - operate by detecting\nellipsoidal variations caused by tidal interactions. The limitation of this\napproach is that contact and semidetached binaries can produce similarly\nlooking light curves. In this work, we address the degeneracy of ellipsoidal\nlight curves by studying the differences between synthetically generated light\ncurves of dark companion, semidetached, and contact binary systems. We inject\nthe light curves with various levels of uncorrelated and correlated Gaussian\nnoise to simulate the effects of instrumental noise and stellar spots. Using\nprincipal component analysis (PCA) and Fourier decomposition, we construct\nlow-dimensional representations of the light curves. We find that the first two\nto five PCA components are sufficient to explain $99\\%$ of variance in the\ndata. The PCA representations are generally more informative than the Fourier\nrepresentation for the same number of coefficients as measured by both the\nsilhouette scores of the representations and the macro recalls of random forest\nclassifiers trained on the representations. The random forest classifiers reach\nmacro recalls from $0.97$ to $0.70$, indicating that the classes remain largely\nseparable even under adverse conditions. We find that instrumental noise\nsignificantly impacts the class separation only when its standard deviation\nexceeds $10^{-3}$ mag, whereas the presence of spots can markedly reduce the\nclass separation even when they contribute as little as $1\\%$ of the light\ncurve amplitude. We discuss the application of our method to real ellipsoidal\nsamples, and we show that we can increase the purity of a sample of dark\ncompanion candidates by a factor of up to $27$ if we assume a prior purity of\n$1\\%$, significantly improving the cost-efficiency of follow-up observations.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"CrmhjzRBc8hUWISS--qrYl8mPTRn9eAUSSk5L-Q8mrM","pdfSize":"12332649"}
