{"id":"2408.06823","title":"Temperature dependence of the AB-lines and Optical Properties of the\n  Carbon-Antisite Vacancy Pair in 4H-SiC","authors":"Oscar Bulancea-Lindvall, Joel Davidsson, Ivan G. Ivanov, Adam Gali,\n  Viktor Iv\\'ady, Rickard Armiento, and Igor A. Abrikosov","authorsParsed":[["Bulancea-Lindvall","Oscar",""],["Davidsson","Joel",""],["Ivanov","Ivan G.",""],["Gali","Adam",""],["Ivády","Viktor",""],["Armiento","Rickard",""],["Abrikosov","Igor A.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 11:30:42 GMT"}],"updateDate":"2024-08-14","timestamp":1723548642000,"abstract":"  Defects in semiconductors have in recent years been revealed to have\ninteresting properties in the venture towards quantum technologies. In this\nregard, silicon carbide has shown great promise as a host for quantum defects.\nIn particular, the ultra-bright AB photoluminescence lines in 4H-SiC are\nobservable at room temperature and have been proposed as a single-photon\nquantum emitter. These lines have been previously studied and assigned to the\ncarbon antisite-vacancy pair (CAV). In this paper, we report on new\nmeasurements of the AB-lines' temperature dependence, and carry out an in-depth\ncomputational study on the optical properties of the CAV defect. We find that\nthe CAV defect has the potential to exhibit several different zero-phonon\nluminescences with emissions in the near-infrared telecom band, in its neutral\nand positive charge states. However, our measurements show that the AB-lines\nonly consist of three non-thermally activated lines instead of the previously\nreported four lines, meanwhile our calculations on the CAV defect are unable to\nfind optical transitions in full agreement with the AB-line assignment. In the\nlight of our results, the identification of the AB-lines and the associated\nroom temperature emission require further study.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}