{"id":"2408.12766","title":"Learning Robust Features for Scatter Removal and Reconstruction in\n  Dynamic ICF X-Ray Tomography","authors":"Siddhant Gautam, Marc L. Klasky, Balasubramanya T. Nadiga, Trevor\n  Wilcox, Gary Salazar, and Saiprasad Ravishankar","authorsParsed":[["Gautam","Siddhant",""],["Klasky","Marc L.",""],["Nadiga","Balasubramanya T.",""],["Wilcox","Trevor",""],["Salazar","Gary",""],["Ravishankar","Saiprasad",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 23:42:34 GMT"}],"updateDate":"2024-08-26","timestamp":1724370154000,"abstract":"  Density reconstruction from X-ray projections is an important problem in\nradiography with key applications in scientific and industrial X-ray computed\ntomography (CT). Often, such projections are corrupted by unknown sources of\nnoise and scatter, which when not properly accounted for, can lead to\nsignificant errors in density reconstruction. In the setting of this problem,\nrecent deep learning-based methods have shown promise in improving the accuracy\nof density reconstruction. In this article, we propose a deep learning-based\nencoder-decoder framework wherein the encoder extracts robust features from\nnoisy/corrupted X-ray projections and the decoder reconstructs the density\nfield from the features extracted by the encoder. We explore three options for\nthe latent-space representation of features: physics-inspired supervision,\nself-supervision, and no supervision. We find that variants based on\nself-supervised and physicsinspired supervised features perform better over a\nrange of unknown scatter and noise. In extreme noise settings, the variant with\nself-supervised features performs best. After investigating further details of\nthe proposed deep-learning methods, we conclude by demonstrating that the newly\nproposed methods are able to achieve higher accuracy in density reconstruction\nwhen compared to a traditional iterative technique.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}