{"id":"2408.06024","title":"Layer-Specific Optimization: Sensitivity Based Convolution Layers Basis\n  Search","authors":"Vasiliy Alekseev, Ilya Lukashevich, Ilia Zharikov, Ilya Vasiliev","authorsParsed":[["Alekseev","Vasiliy",""],["Lukashevich","Ilya",""],["Zharikov","Ilia",""],["Vasiliev","Ilya",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 09:24:48 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 20:01:59 GMT"}],"updateDate":"2024-08-15","timestamp":1723454688000,"abstract":"  Deep neural network models have a complex architecture and are\noverparameterized. The number of parameters is more than the whole dataset,\nwhich is highly resource-consuming. This complicates their application and\nlimits its usage on different devices. Reduction in the number of network\nparameters helps to reduce the size of the model, but at the same time,\nthoughtlessly applied, can lead to a deterioration in the quality of the\nnetwork. One way to reduce the number of model parameters is matrix\ndecomposition, where a matrix is represented as a product of smaller matrices.\nIn this paper, we propose a new way of applying the matrix decomposition with\nrespect to the weights of convolutional layers. The essence of the method is to\ntrain not all convolutions, but only the subset of convolutions (basis\nconvolutions), and represent the rest as linear combinations of the basis ones.\nExperiments on models from the ResNet family and the CIFAR-10 dataset\ndemonstrate that basis convolutions can not only reduce the size of the model\nbut also accelerate the forward and backward passes of the network. Another\ncontribution of this work is that we propose a fast method for selecting a\nsubset of network layers in which the use of matrix decomposition does not\ndegrade the quality of the final model.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YQpoahrSgdmlGxCRUMumK7sTWc_cifSWLRuFm9375Sk","pdfSize":"3177158"}
