{"id":"2408.06134","title":"Learned Indexes with Distribution Smoothing via Virtual Points","authors":"Kasun Amarasinghe, Farhana Choudhury, Jianzhong Qi, James Bailey","authorsParsed":[["Amarasinghe","Kasun",""],["Choudhury","Farhana",""],["Qi","Jianzhong",""],["Bailey","James",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 13:23:49 GMT"}],"updateDate":"2024-08-13","timestamp":1723469029000,"abstract":"  Recent research on learned indexes has created a new perspective for indexes\nas models that map keys to their respective storage locations. These learned\nindexes are created to approximate the cumulative distribution function of the\nkey set, where using only a single model may have limited accuracy. To overcome\nthis limitation, a typical method is to use multiple models, arranged in a\nhierarchical manner, where the query performance depends on two aspects: (i)\ntraversal time to find the correct model and (ii) search time to find the key\nin the selected model. Such a method may cause some key space regions that are\ndifficult to model to be placed at deeper levels in the hierarchy. To address\nthis issue, we propose an alternative method that modifies the key space as\nopposed to any structural or model modifications. This is achieved through\nmaking the key set more learnable (i.e., smoothing the distribution) by\ninserting virtual points. Further, we develop an algorithm named CSV to\nintegrate our virtual point insertion method into existing learned indexes,\nreducing both their traversal and search time. We implement CSV on\nstate-of-the-art learned indexes and evaluate them on real-world datasets. The\nextensive experimental results show significant query performance improvement\nfor the keys in deeper levels of the index structures at a low storage cost.\n","subjects":["Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"fyjGydWWY9g-utzzGA0EPyDZqJr6D3SJbIiC__R5KSs","pdfSize":"1104954"}
