{"id":"2408.15028","title":"Mapping global offshore wind resource: wake losses, optimisation\n  potential and climate effects","authors":"Simon C Warder and Matthew D Piggott","authorsParsed":[["Warder","Simon C",""],["Piggott","Matthew D",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 12:57:17 GMT"}],"updateDate":"2024-08-28","timestamp":1724763437000,"abstract":"  In this work, we assess global offshore wind energy resources, wake-induced\nlosses, array layout optimisation potential and climate change impacts. We\nfirst map global offshore ambient wind resource from reanalysis data. We\nestimate wake-induced losses using an engineering wake model, revealing that\nlocations with low (high) resource typically experience larger (smaller)\npercentage losses. However, we further find that the specific wind speed\ndistribution is important, with narrower distributions generally leading to\ngreater losses. This is due to the overlap between the wind speed distribution\nand the high-sensitivity region of the turbine thrust and power curves.\nBroadly, this leads to much stronger wake-induced losses in the tropics (which\nexperience the trade winds) than mid-latitudes. However, the tropics also\nexperience a narrower wind direction distribution; our results demonstrate that\nthis leads to greater potential for mitigation of wake effects via layout\noptimisation. Finally, we assess projected changes in wind resource and wake\nlosses due to climate change under a high-emission scenario. Many regions are\nprojected to decrease in ambient wind resources, and furthermore these regions\nwill typically experience greater wake-induced losses, exacerbating the climate\nimpact. These results highlight the different challenges and opportunities\nassociated with exploiting offshore wind resources across the globe.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"aLMv8C9SqG_vgXDwQK_DVqXLV0qyKzZi5OQJi8BHMQc","pdfSize":"8606369"}
