{"id":"2408.07251","title":"The possible origin of three Apollo asteroids 3200 Phaethon, 2005UD, and\n  1999YC","authors":"Nikola Kne\\v{z}evi\\'c and Nata\\v{s}a Todorovi\\'c (Astronomical\n  Observatory, Belgrade, Serbia)","authorsParsed":[["Knežević","Nikola","","Astronomical\n  Observatory, Belgrade, Serbia"],["Todorović","Nataša","","Astronomical\n  Observatory, Belgrade, Serbia"]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 01:41:17 GMT"}],"updateDate":"2024-08-15","timestamp":1723599677000,"abstract":"  $\\textit{Aims.}$ We study the possible dynamical background of three Apollo\nasteroids: 3200 Phaethon, 2005 UD, and 1999 YC. The source regions under\nconsideration are the asteroid families (2) Pallas, in the outer belt, and two\ninner-belt families (329) Svea and (142) Polana. We also aim to explain some of\nthe contradictions in the literature in regards to the origin of Phaethon.\n$\\textit{Methods.}$ Our methodology relies on the precise dynamical mapping of\nseveral mean motion resonances (MMRs), which are considered the main transport\nchannels. This approach allows the clear detection of chaotic structures in an\nMMR and efficient selection of test asteroids for diffusion. We tracked the\norbital evolution of the selected particles over 5 million years and registered\nall their eventual entries into the orbital neighborhood of the asteroids 3200\nPhaethon, 2005 UD and 1999 YC. We performed massive calculations for different\norbital and integration parameters using Orbit9 and Rebound software packages.\n$\\textit{Results.}$ We observed possible connections between three targeted\nApollo asteroids and asteroid families we considered as their sources. The (2)\nPallas family has the highest chance of being the origin of targeted asteroids,\nand (142) Polana has the lowest. The amount of transported material largely\ndepends on the integrator, the integration step, and even the choice of the\ninitial epoch, though to a lesser extent. There is a systematic discrepancy\nbetween the results obtained with Orbit9 and Rebound regarding the efficiency\nof the transport, but they show good agreement over delivery times and\ndynamical maps. A non-negligible number of objects approached all three target\nasteroids, which could indicate that the breakup of the precursor body occurred\nduring its dynamical evolution.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JbvVuxlad9kKEyycpaPKD-T6qHXAChXm9EvFg6y0EaA","pdfSize":"4023523"}
