{"id":"2408.02292","title":"Learning Atoms from Crystal Structure","authors":"Andrij Vasylenko (1), Dmytro Antypov (1), Sven Schewe (2), Luke M.\n  Daniels (1), John B. Claridge (1), Matthew S. Dyer (1), Matthew J. Rosseinsky\n  (1), ((1) Department of Chemistry, University of Liverpool, Crown Street,\n  United Kingdom, (2) Department of Computer Science, University of Liverpool,\n  Ashton Building, United Kingdom)","authorsParsed":[["Vasylenko","Andrij",""],["Antypov","Dmytro",""],["Schewe","Sven",""],["Daniels","Luke M.",""],["Claridge","John B.",""],["Dyer","Matthew S.",""],["Rosseinsky","Matthew J.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 08:05:59 GMT"}],"updateDate":"2024-08-06","timestamp":1722845159000,"abstract":"  Computational modelling of materials using machine learning, ML, and\nhistorical data has become integral to materials research. The efficiency of\ncomputational modelling is strongly affected by the choice of the numerical\nrepresentation for describing the composition, structure and chemical elements.\nStructure controls the properties, but often only the composition of a\ncandidate material is available. Existing elemental descriptors lack direct\naccess to structural insights such as the coordination geometry of an element.\nIn this study, we introduce Local Environment-induced Atomic Features, LEAFs,\nwhich incorporate information about the statistically preferred local\ncoordination geometry for atoms in crystal structure into descriptors for\nchemical elements, enabling the modelling of materials solely as compositions\nwithout requiring knowledge of their crystal structure. In the crystal\nstructure, each atomic site can be described by similarity to common local\nstructural motifs; by aggregating these features of similarity from the\nexperimentally verified crystal structures of inorganic materials, LEAFs\nformulate a set of descriptors for chemical elements and compositions. The\ndirect connection of LEAFs to the local coordination geometry enables the\nanalysis of ML model property predictions, linking compositions to the\nunderlying structure-property relationships. We demonstrate the versatility of\nLEAFs in structure-informed property predictions for compositions, mapping of\nchemical space in structural terms, and prioritising elemental substitutions.\nBased on the latter for predicting crystal structures of binary ionic\ncompounds, LEAFs achieve the state-of-the-art accuracy of 86 per cent. These\nresults suggest that the structurally informed description of chemical elements\nand compositions developed in this work can effectively guide synthetic efforts\nin discovering new materials.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Disordered Systems and Neural Networks","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}