{"id":"2408.00663","title":"Fleet-mix Electric Vehicle Routing Problem for the E-commerce Delivery\n  with Limited Off-Hour Delivery Implementation","authors":"Hyun-Seop Uhm, Abdelrahman Ismael, Natalia Zuniga-Garcia, Olcay Sahin,\n  James Cook, Joshua Auld, Monique Stinson","authorsParsed":[["Uhm","Hyun-Seop",""],["Ismael","Abdelrahman",""],["Zuniga-Garcia","Natalia",""],["Sahin","Olcay",""],["Cook","James",""],["Auld","Joshua",""],["Stinson","Monique",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 15:58:53 GMT"}],"updateDate":"2024-08-02","timestamp":1722527933000,"abstract":"  Freight truck electrification for last-mile delivery is one of the most\nimportant research topics to reduce the dependency on fossil fuel operations.\nAlthough a battery electric truck still has limitations on daily operations\nwith lower driving ranges and higher purchasing cost than a conventional truck,\noperations with electrified trucks reduce total energy usage and driving noise\non routes. In this paper, we propose a fleet-mix and multi-shift electric\nvehicle routing problem for joint implementation of fleet electrification and\noff-hour delivery in urban e-commerce delivery systems. Every electrified truck\nis assumed to have two shifts for both daytime and nighttime delivery\noperations while conventional trucks can operate during daytime only because of\nmunicipal restrictions on nighttime deliveries, which are related to engine\nnoise. Also, every electrified truck must recharge between shifts at its depot.\nA fleet owner decides the best electrification ratio of the fleet and the\nproper number of chargers which gives the minimum total cost. The optimization\nproblem is described as a mixed-integer linear programming model including\ncommon constraints for vehicle routing problem, recharging constraints, and\ntwo-shift operation of electrified trucks. A bi-level VNS-TS heuristic is also\nsuggested for efficient solution search. The upper-level problem assigns trucks\nwith engine type and brief route information using variable neighborhood search\nheuristic, and the lower-level problem finds the best route of each assigned\ntruck using a tabu search heuristic. Scenarios with different EV driving ranges\nand nighttime operation availabilities are developed and evaluated with the\nPOLARIS transportation simulation framework, and results are reported.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}