{"id":"2408.05593","title":"Experimental Investigation of Tidally-Forced Internal Wave Turbulence at\n  High Reynolds Number","authors":"Zachary Taebel (1), Alberto Scotti (2), Pierre-Yves Passaggia (3),\n  Dylan Bruney (4) ((1) University of North Carolina, (2) Arizona State\n  University, (3) University of Orl\\'eans, (4) Wake Forest University)","authorsParsed":[["Taebel","Zachary",""],["Scotti","Alberto",""],["Passaggia","Pierre-Yves",""],["Bruney","Dylan",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 16:42:56 GMT"}],"updateDate":"2024-08-13","timestamp":1723308176000,"abstract":"  Through basin-scale circulations, the ocean regulates global distributions of\nheat, nutrients, and greenhouse gases. To properly predict the future of the\nocean under climate change, we need to develop a thorough understanding of the\nunderlying mechanisms that drive global circulations. An estimated 2 TW of\npower is required to support interior mixing. Roughly half of this power is\nbelieved to come from tidal flow over topography, producing internal gravity\nwaves (IGW's), which can radiate energy throughout the ocean interior. But it\nis difficult to track the subsequent journey from tidal injection to\ndissipation, as the energy cascade spans an enormous range of spatio-temporal\nscales and multiple different nonlinear transfer mechanisms. To investigate the\nfull energy pathway from topographic forcing to irreversible mixing, we built a\nmodel ocean in a large-scale laboratory wavetank (9 m x 2.9 m x 0.75 m)\nallowing Reynolds numbers up to O(10$^5$). We replicate the tidal forcing by\noscillating an idealized ocean ridge. We track energy transfer across the first\ncascade, driven by wave turbulence, using Background Oriented Schlieren (BOS)\nover the full tank. Through the BOS we observe the formation of various sets of\nsubharmonics, driven by Triadic Resonant Instabilities (TRI). At later times,\nthe subharmonics born from TRI engage in different interactions, which\nultimately develop a continuum of waves at frequencies up to $N$. We validate\nthe three-wave resonant conditions through a Fourier decomposition and confirm\na backward cascade in frequency but a forward cascade in vertical wavenumber.\nThrough our spatial analysis, we identify relevant three-wave interactions and\nshow the significance of elastic scattering, a nonlocal interaction, in our\nfully evolved system. We note however that the majority of our triads are\nlocal, which have been historically overlooked.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}