{"id":"2408.01443","title":"Framework for Adoption of Generative Artificial Intelligence (GenAI) in\n  Education","authors":"Samar Shailendra, Rajan Kadel, Aakanksha Sharma","authorsParsed":[["Shailendra","Samar",""],["Kadel","Rajan",""],["Sharma","Aakanksha",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 12:02:28 GMT"}],"updateDate":"2024-08-06","timestamp":1721563348000,"abstract":"  Contributions: An adoption framework to include GenAI in the university\ncurriculum. It identifies and highlights the role of different stakeholders\n(university management, students, staff, etc.) during the adoption process. It\nalso proposes an objective approach based upon an evaluation matrix to assess\nthe success and outcome of the GenAI adoption.\n  Background: Universities worldwide are debating and struggling with the\nadoption of GenAI in their curriculum. Both the faculty and students are unsure\nabout the approach in the absence of clear guidelines through the\nadministration and regulators. This requires an established framework to define\na process and articulate the roles and responsibilities of each stakeholder\ninvolved.\n  Research Questions: Whether the academic ecosystem requires a methodology to\nadopt GenAI into its curriculum? A systematic approach for the academic staff\nto ensure the students' learning outcomes are met with the adoption of GenAI.\nHow to measure and communicate the adoption of GenAI in the university setup?\n  Methodology: The methodology employed in this study focuses on examining the\nuniversity education system and assessing the opportunities and challenges\nrelated to incorporating GenAI in teaching and learning. Additionally, it\nidentifies a gap and the absence of a comprehensive framework that obstructs\nthe effective integration of GenAI within the academic environment.\n  Findings: The literature survey results indicate the limited or no adoption\nof GenAI by the university, which further reflects the dilemma in the minds of\ndifferent stakeholders. For the successful adoption of GenAI, a standard\nframework is proposed i) for effective redesign of the course curriculum, ii)\nfor enabling staff and students, iii) to define an evaluation matrix to measure\nthe effectiveness and success of the adoption process.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"zIATowru9uUQ02AgkVvDjKeY1i0F2hrZQzkEfvlPCqg","pdfSize":"1470076"}
