{"id":"2408.14255","title":"MSFMamba: Multi-Scale Feature Fusion State Space Model for Multi-Source\n  Remote Sensing Image Classification","authors":"Feng Gao, Xuepeng Jin, Xiaowei Zhou, Junyu Dong, Qian Du","authorsParsed":[["Gao","Feng",""],["Jin","Xuepeng",""],["Zhou","Xiaowei",""],["Dong","Junyu",""],["Du","Qian",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 13:18:16 GMT"}],"updateDate":"2024-08-27","timestamp":1724678296000,"abstract":"  In multi-source remote sensing image classification field, remarkable\nprogress has been made by convolutional neural network and Transformer.\nHowever, existing methods are still limited due to the inherent local reductive\nbias. Recently, Mamba-based methods built upon the State Space Model have shown\ngreat potential for long-range dependency modeling with linear complexity, but\nit has rarely been explored for the multi-source remote sensing image\nclassification task. To this end, we propose Multi-Scale Feature Fusion Mamba\n(MSFMamba) network for hyperspectral image (HSI) and LiDAR/SAR data joint\nclassification. Specifically, MSFMamba mainly comprises three parts:\nMulti-Scale Spatial Mamba (MSpa-Mamba) block, Spectral Mamba (Spe-Mamba) block,\nand Fusion Mamba (Fus-Mamba) block. Specifically, to solve the feature\nredundancy in multiple canning routes, the MSpa-Mamba block incorporates the\nmulti-scale strategy to minimize the computational redundancy and alleviate the\nfeature redundancy of SSM. In addition, Spe-Mamba is designed for spectral\nfeature exploration, which is essential for HSI feature modeling. Moreover, to\nalleviate the heterogeneous gap between HSI and LiDAR/SAR data, we design\nFus-Mamba block for multi-source feature fusion. The original Mamba is extended\nto accommodate dual inputs, and cross-modal feature interaction is enhanced.\nExtensive experimental results on three multi-source remote sensing datasets\ndemonstrate the superiority performance of the proposed MSFMamba over the\nstate-of-the-art models. Source codes of MSFMamba will be made public available\nat https://github.com/summitgao/MSFMamba .\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}