{"id":"2408.15673","title":"Electrical Impedance Tomography meets Reduced Order Modelling: a\n  framework for faster and more reliable electrical conductivity estimations","authors":"Matthew R. Walker, Mariano Fern\\'andez-Corazza, Sergei Turovets and\n  Leandro Beltrachini","authorsParsed":[["Walker","Matthew R.",""],["Fernández-Corazza","Mariano",""],["Turovets","Sergei",""],["Beltrachini","Leandro",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 09:53:56 GMT"}],"updateDate":"2024-08-29","timestamp":1724838836000,"abstract":"  Objective: Inclusion of individualised electrical conductivities of head\ntissues is crucial for the accuracy of electrical source imaging techniques\nbased on electro/magnetoencephalography and the efficacy of transcranial\nelectrical stimulation. Parametric electrical impedance tomography (pEIT) is a\nmethod to cheaply and non-invasively estimate them using electrode arrays on\nthe scalp to apply currents and measure the resulting potential distribution.\nConductivities are then estimated by iteratively fitting a forward model to the\nmeasurements, incurring a prohibitive computational cost that is generally\nlowered at the expense of accuracy. Reducing the computational cost associated\nwith the forward solutions would improve the accessibility of this method and\nunlock new capabilities. Approach: We introduce reduced order modelling (ROM)\nto massively speed up the calculations of these solutions for arbitrary\nconductivity values. Main results: We demonstrate this new ROM-pEIT framework\nusing a realistic head model with six tissue compartments, with minimal errors\nin both the approximated numerical solutions and conductivity estimations. We\nshow that the computational complexity required to reach a multi-parameter\nestimation with a negligible relative error is reduced by more than an order of\nmagnitude when using this framework. Furthermore, we illustrate the benefits of\nthis new framework in a number of practical cases, including its application to\nreal pEIT data from three subjects. Significance: Results suggest that this\nframework can transform the use of pEIT for seeking personalised head\nconductivities, making it a valuable tool for researchers and clinicians.\n","subjects":["Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}