{"id":"2408.12133","title":"Self-supervised Learning for Geospatial AI: A Survey","authors":"Yile Chen, Weiming Huang, Kaiqi Zhao, Yue Jiang, Gao Cong","authorsParsed":[["Chen","Yile",""],["Huang","Weiming",""],["Zhao","Kaiqi",""],["Jiang","Yue",""],["Cong","Gao",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 05:28:22 GMT"}],"updateDate":"2024-08-23","timestamp":1724304502000,"abstract":"  The proliferation of geospatial data in urban and territorial environments\nhas significantly facilitated the development of geospatial artificial\nintelligence (GeoAI) across various urban applications. Given the vast yet\ninherently sparse labeled nature of geospatial data, there is a critical need\nfor techniques that can effectively leverage such data without heavy reliance\non labeled datasets. This requirement aligns with the principles of\nself-supervised learning (SSL), which has attracted increasing attention for\nits adoption in geospatial data. This paper conducts a comprehensive and\nup-to-date survey of SSL techniques applied to or developed for three primary\ndata (geometric) types prevalent in geospatial vector data: points, polylines,\nand polygons. We systematically categorize various SSL techniques into\npredictive and contrastive methods, discussing their application with respect\nto each data type in enhancing generalization across various downstream tasks.\nFurthermore, we review the emerging trends of SSL for GeoAI, and several\ntask-specific SSL techniques. Finally, we discuss several key challenges in the\ncurrent research and outline promising directions for future investigation. By\npresenting a structured analysis of relevant studies, this paper aims to\ninspire continued advancements in the integration of SSL with GeoAI,\nencouraging innovative methods to harnessing the power of geospatial data.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WywOM7dKswFnxW_m3I6w14Nxmo-a4WGYi_TpI9H5E0Y","pdfSize":"1476219"}
