{"id":"2408.01226","title":"Regular Grammars for Graph Sets of Tree-Width $\\leq2$","authors":"Marius Bozga and Radu Iosif and Florian Zuleger","authorsParsed":[["Bozga","Marius",""],["Iosif","Radu",""],["Zuleger","Florian",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 12:30:24 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 06:34:19 GMT"}],"updateDate":"2024-08-07","timestamp":1722601824000,"abstract":"  Regular and context-free languages form a central pillar of formal language\ntheory. This is because a variety of formalisms are known that define these\nclasses of languages. For example, we have that finite automata, monoids,\nalgebraic recognizability, regular expressions, regular grammars,\nmonadic-second order logic, etc., can be used to represent regular word\nlanguages. However, the situation is less clear for formal languages over\ngraphs, and open problems persist. This is because generalizing notions from\nwords to graphs has been more successful for some of the cited formalisms than\nfor the other ones. Bruno Courcelle has introduced hyper-edge replacement (\\hr)\nalgebras for generalizing the notion of context-free languages from words to\ngraphs. At the same time, \\hr-algebras support the generalization of algebraic\nrecognizability from words to graphs, a notion that has been proven to be\nequivalent to definability in (counting) monadic-second order logic (\\cmso)\nover graphs of bounded tree-width. In this paper, we deal with generalizing\nregular word grammars to graphs. We propose regular grammars for (unordered and\nunranked) trees, series-parallel graphs, and graphs of tree-width $\\le 2$,\nwhere the qualifier regular is justified because these grammars define exactly\nthe recognizable resp. \\cmso-definable subsets of the respective graph classes.\n","subjects":["Computing Research Repository/Formal Languages and Automata Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8bspsR07YCzAvusg8Rcj9m--S1BV1Ca7gtcbj4-0qEE","pdfSize":"779742","txDigest":"ALxt6x6rEpXKpWffi5hREUHpwGs18VRN3TBUiVKMHrbm","endEpoch":"1","status":"CERTIFIED"}
