{"id":"2408.05226","title":"Gravitational Wave emission in Binary Neutron Star early post-merger\n  within a dark environment","authors":"D. Su\\'arez-Fontanella, D. Barba-Gonz\\'alez, C. Albertus, M.\\'Angeles\n  P\\'erez-Garc\\'ia","authorsParsed":[["Suárez-Fontanella","D.",""],["Barba-González","D.",""],["Albertus","C.",""],["Pérez-García","M. Ángeles",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:01:01 GMT"}],"updateDate":"2024-08-13","timestamp":1722276061000,"abstract":"  Using an effective Lagrangian model inspired by [1] we describe the early\npost-merger of a binary Neutron Star (BNS) merger event with a non-vanishing\nambient fraction of dark matter. For this we mimic the dynamics of two\noscillating Neutron Star (NS) masses in the gravitational potential well as\nthey merge. We parametrize the ejected baryonic matter fraction in the\ncoalescence event forming a surrounding debris disk containing a non-vanishing\ndark matter fraction. In order to analyze the dark contribution, we start from\na dark-matter free modelization using Monte Carlo Markov Chain (MCMC)\ntechniques to replicate the gravitational waveforms obtained from simulations\nin the CoRe database for three selected equations of state for NS matter (DD2,\nBHBlp, SFHo). Later, we explore the impact of a dark viscous fluid under a\nprescribed velocity dependent force and obtain the waveforms and spectral\nproperties originating in the first few ms in the BNS post-merger. Finally we\ndiscuss our findings in light of the prospects of detectability of a\nnon-vanishing fraction of dark matter arising in the waveforms and power\nspectral distribution in present or future experimental settings.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vmgotuI_eOAH_af9hROepuIuPHPwRMajUxOMwjiTp4s","pdfSize":"760621"}
