{"id":"2408.06356","title":"Enhancing Ecological Monitoring with Multi-Objective Optimization: A\n  Novel Dataset and Methodology for Segmentation Algorithms","authors":"Sophia J. Abraham, Jin Huang, Brandon RichardWebster, Michael Milford,\n  Jonathan D. Hauenstein, Walter Scheirer","authorsParsed":[["Abraham","Sophia J.",""],["Huang","Jin",""],["RichardWebster","Brandon",""],["Milford","Michael",""],["Hauenstein","Jonathan D.",""],["Scheirer","Walter",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 18:27:27 GMT"}],"updateDate":"2024-08-14","timestamp":1721932047000,"abstract":"  We introduce a unique semantic segmentation dataset of 6,096 high-resolution\naerial images capturing indigenous and invasive grass species in Bega Valley,\nNew South Wales, Australia, designed to address the underrepresented domain of\necological data in the computer vision community. This dataset presents a\nchallenging task due to the overlap and distribution of grass species, which is\ncritical for advancing models in ecological and agronomical applications. Our\nstudy features a homotopy-based multi-objective fine-tuning approach that\nbalances segmentation accuracy and contextual consistency, applicable to\nvarious models. By integrating DiceCELoss for pixel-wise classification and a\nsmoothness loss for spatial coherence, this method evolves during training to\nenhance robustness against noisy data. Performance baselines are established\nthrough a case study on the Segment Anything Model (SAM), demonstrating its\neffectiveness. Our annotation methodology, emphasizing pen size, zoom control,\nand memory management, ensures high-quality dataset creation. The dataset and\ncode will be made publicly available, aiming to drive research in computer\nvision, machine learning, and ecological studies, advancing environmental\nmonitoring and sustainable development.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5G5VvAR3Ve4uY6IW6W2YwHPilHL0mHmI4FwSuwSG3s0","pdfSize":"812797"}
