{"id":"2408.13079","title":"Sub-wavelength localized all-optical helicity-independent magnetic\n  switching using plasmonic gold nanostructures","authors":"Themistoklis Sidiropoulos, Puloma Singh, Tino Noll, Michael Schneider,\n  Dieter Engel, Denny Sommer, Felix Steinbach, Ingo Will, Bastian Pfau, Clemens\n  von Korff Schmising, Stefan Eisebitt","authorsParsed":[["Sidiropoulos","Themistoklis",""],["Singh","Puloma",""],["Noll","Tino",""],["Schneider","Michael",""],["Engel","Dieter",""],["Sommer","Denny",""],["Steinbach","Felix",""],["Will","Ingo",""],["Pfau","Bastian",""],["Schmising","Clemens von Korff",""],["Eisebitt","Stefan",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 14:03:15 GMT"}],"updateDate":"2024-08-26","timestamp":1724421795000,"abstract":"  All-optical helicity-independent switching (AO-HIS) is of interest for\nultrafast and energy efficient magnetic switching in future magnetic data\nstorage approaches. Yet, to achieve high bit density magnetic recording it is\nnecessary to reduce the size of the magnetic bits addressed by laser pulses at\nwell-controlled positions. Metallic nanostructures that support localized\nsurface plasmons enable spatial electromagnetic confinement well below the\ndiffraction limit and rare-earth transition metal alloys such as GdTbCo have\ndemonstrated nanometre-sized stable domains. Here, we deposit plasmonic gold\nnanostructures on a GdTbCo film and probe the magnetic state using magnetic\nforce microscopy. We observe localized AO-HIS down to a critical dimension of\n240 nm after excitation of the gold nanostructures by a single 370 fs long\nlaser pulse with a centre wavelength of 1030 nm. We demonstrate that the strong\nlocalization of optical fields through plasmonic nanostructures enables\nreproducible localized nanoscale AO-HIS at sub-wavelength length scales. We\nstudy the influence of the localized electromagnetic field enhancement by the\nplasmonic nanostructures on the required fluence to switch the magnetization.\n","subjects":["Condensed Matter/Materials Science","Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Egcy0rgMOBJkqoxlc0x0aktHqQOCpjF3Y48vWbaZB4k","pdfSize":"808908"}
