{"id":"2408.00237","title":"Empirical Bayes Linked Matrix Decomposition","authors":"Eric F. Lock","authorsParsed":[["Lock","Eric F.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 02:13:11 GMT"}],"updateDate":"2024-08-02","timestamp":1722478391000,"abstract":"  Data for several applications in diverse fields can be represented as\nmultiple matrices that are linked across rows or columns. This is particularly\ncommon in molecular biomedical research, in which multiple molecular \"omics\"\ntechnologies may capture different feature sets (e.g., corresponding to rows in\na matrix) and/or different sample populations (corresponding to columns). This\nhas motivated a large body of work on integrative matrix factorization\napproaches that identify and decompose low-dimensional signal that is shared\nacross multiple matrices or specific to a given matrix. We propose an empirical\nvariational Bayesian approach to this problem that has several advantages over\nexisting techniques, including the flexibility to accommodate shared signal\nover any number of row or column sets (i.e., bidimensional integration), an\nintuitive model-based objective function that yields appropriate shrinkage for\nthe inferred signals, and a relatively efficient estimation algorithm with no\ntuning parameters. A general result establishes conditions for the uniqueness\nof the underlying decomposition for a broad family of methods that includes the\nproposed approach. For scenarios with missing data, we describe an associated\niterative imputation approach that is novel for the single-matrix context and a\npowerful approach for \"blockwise\" imputation (in which an entire row or column\nis missing) in various linked matrix contexts. Extensive simulations show that\nthe method performs very well under different scenarios with respect to\nrecovering underlying low-rank signal, accurately decomposing shared and\nspecific signals, and accurately imputing missing data. The approach is applied\nto gene expression and miRNA data from breast cancer tissue and normal breast\ntissue, for which it gives an informative decomposition of variation and\noutperforms alternative strategies for missing data imputation.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WAembuVR71vrLFusAKGaHWChknfVYlniNPHa7WDzp1Q","pdfSize":"3814716","txDigest":"5gTjeqtpgaGuGvg9YCEEY1VE91VSGSQKkUU83dhi1mC6","endEpoch":"1","status":"CERTIFIED"}
