{"id":"2408.11994","title":"Fast and robust cross-validation-based scoring rule inference for\n  spatial statistics","authors":"Helga Kristin Olafsdottir, Holger Rootz\\'en, David Bolin","authorsParsed":[["Olafsdottir","Helga Kristin",""],["Rootzén","Holger",""],["Bolin","David",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 21:07:57 GMT"}],"updateDate":"2024-08-23","timestamp":1724274477000,"abstract":"  Scoring rules are aimed at evaluation of the quality of predictions, but can\nalso be used for estimation of parameters in statistical models. We propose\nestimating parameters of multivariate spatial models by maximising the average\nleave-one-out cross-validation score. This method, LOOS, thus optimises\npredictions instead of maximising the likelihood. The method allows for fast\ncomputations for Gaussian models with sparse precision matrices, such as\nspatial Markov models. It also makes it possible to tailor the estimator's\nrobustness to outliers and their sensitivity to spatial variations of\nuncertainty through the choice of the scoring rule which is used in the\nmaximisation. The effects of the choice of scoring rule which is used in LOOS\nare studied by simulation in terms of computation time, statistical efficiency,\nand robustness. Various popular scoring rules and a new scoring rule, the root\nscore, are compared to maximum likelihood estimation. The results confirmed\nthat for spatial Markov models the computation time for LOOS was much smaller\nthan for maximum likelihood estimation. Furthermore, the standard deviations of\nparameter estimates were smaller for maximum likelihood estimation, although\nthe differences often were small. The simulations also confirmed that the usage\nof a robust scoring rule results in robust LOOS estimates and that the\nrobustness provides better predictive quality for spatial data with outliers.\nFinally, the new inference method was applied to ERA5 temperature reanalysis\ndata for the contiguous United States and the average July temperature for the\nyears 1940 to 2023, and this showed that the LOOS estimator provided parameter\nestimates that were more than a hundred times faster to compute compared to\nmaximum-likelihood estimation, and resulted in a model with better predictive\nperformance.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6W8S-dEpZegkL437M4fSjnVhxw9zucjfqkqxb2GMtGc","pdfSize":"747715"}
