{"id":"2408.06539","title":"Conformal predictive intervals in survival analysis: a re-sampling\n  approach","authors":"Jing Qin, Jin Piao, Jing Ning and Yu Shen","authorsParsed":[["Qin","Jing",""],["Piao","Jin",""],["Ning","Jing",""],["Shen","Yu",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 00:20:02 GMT"}],"updateDate":"2024-08-14","timestamp":1723508402000,"abstract":"  The distribution-free method of conformal prediction (Vovk et al, 2005) has\ngained considerable attention in computer science, machine learning, and\nstatistics. Candes et al. (2023) extended this method to right-censored\nsurvival data, addressing right-censoring complexity by creating a covariate\nshift setting, extracting a subcohort of subjects with censoring times\nexceeding a fixed threshold. Their approach only estimates the lower prediction\nbound for type I censoring, where all subjects have available censoring times\nregardless of their failure status. In medical applications, we often encounter\nmore general right-censored data, observing only the minimum of failure time\nand censoring time. Subjects with observed failure times have unavailable\ncensoring times. To address this, we propose a bootstrap method to construct\none -- as well as two-sided conformal predictive intervals for general\nright-censored survival data under different working regression models. Through\nsimulations, our method demonstrates excellent average coverage for the lower\nbound and good coverage for the two-sided predictive interval, regardless of\nworking model is correctly specified or not, particularly under moderate\ncensoring. We further extend the proposed method to several directions in\nmedical applications. We apply this method to predict breast cancer patients'\nfuture survival times based on tumour characteristics and treatment.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rr6UBCG_nkPovWG0qSKi-B-SEaHrr_DWwjmIS--g8Hw","pdfSize":"486776"}
