{"id":"2408.09898","title":"Anatomy of the Star-formation in a Tidally Disturbed Disk galaxy: NGC\n  3718","authors":"Chandan Watts, Mousumi Das, Sudhanshu Barway","authorsParsed":[["Watts","Chandan",""],["Das","Mousumi",""],["Barway","Sudhanshu",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 11:12:51 GMT"}],"updateDate":"2024-08-20","timestamp":1724065971000,"abstract":"  We present a UV, optical and near-infrared (near-IR) study of the\nstar-forming complexes in the nearby peculiar galaxy NGC 3718, using UVIT,\nGALEX, Spitzer and DECaLS imaging data. The galaxy has a disturbed optical\nmorphology due to the multiple tidal arms, the warped disk and the prominent\ncurved dust lanes, but in the near-IR, it appears to be a bulge-dominated\ngalaxy. Its disturbed morphology makes it an excellent case to study star\nformation in a tidally disturbed galaxy that may have undergone a recent minor\nmerger. To study the distribution and properties of the star-forming clumps\n(SFCs), we divided the galaxy within the R$_{25}$ (B band) radius into three\nparts --the upper, central and lower regions. Using the UV band images, we\ninvestigated the warped star-forming disk, the extended tidal arms, and the\ndistribution and sizes of the 182 SFCs. Their distribution is 49, 60 and 73 in\nthe galaxy's upper, central and lower regions, respectively. We determined the\nUV color, star-formation rates (SFRs), star-formation density ($\\Sigma_{SFR}$)\nand ages of the SFCs.The central disk of the galaxy has a larger mean\n$\\Sigma_{SFR}$ which is $\\sim$3.3 and $\\sim$1.6 times higher than the upper and\nlower regions, respectively. We also find that the SFCs in the central disk are\nolder than those in the tidal arms. Our study thus shows that minor mergers can\ntrigger the inside-out growth of galaxy disks, where the younger SFCs are in\nouter tidal arms and not in the inner disk.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"k_Iwr7WdiNfiD2L3hpb6_t3orUYcIBR_3b9EpXjwfKs","pdfSize":"7858158"}
