{"id":"2408.17237","title":"A nonlinear elasticity model in computer vision","authors":"John M. Ball and Christopher L. Horner","authorsParsed":[["Ball","John M.",""],["Horner","Christopher L.",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 12:27:22 GMT"}],"updateDate":"2024-09-02","timestamp":1725020842000,"abstract":"  The purpose of this paper is to analyze a nonlinear elasticity model\npreviously introduced by the authors for comparing two images, regarded as\nbounded open subsets of $\\R^n$ together with associated vector-valued intensity\nmaps. Optimal transformations between the images are sought as minimisers of an\nintegral functional among orientation-preserving homeomorphisms. The existence\nof minimisers is proved under natural coercivity and polyconvexity conditions,\nassuming only that the intensity functions are bounded measurable. Variants of\nthe existence theorem are also proved, first under the constraint that finite\nsets of landmark points in the two images are mapped one to the other, and\nsecond when one image is to be compared to an unknown part of another.\n  The question is studied as to whether for images related by a linear mapping\nthe unique minimizer is given by that linear mapping. For a natural class of\nfunctional integrands an example is given guaranteeing that this property holds\nfor pairs of images in which the second is a scaling of the first by a constant\nfactor. However for the property to hold for arbitrary pairs of linearly\nrelated images it is shown that the integrand has to depend on the gradient of\nthe transformation as a convex function of its determinant alone. This suggests\na new model in which the integrand depends also on second derivatives of the\ntransformation, and an example is given for which both existence of minimizers\nis assured and the above property holds for all pairs of linearly related\nimages.\n","subjects":["Mathematics/Analysis of PDEs","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fqPUxoFDQc9LXkUDiMVV65HQyKw-WKey-u4UltuZ1BQ","pdfSize":"293505"}
