{"id":"2408.07266","title":"Enhanced Scale-aware Depth Estimation for Monocular Endoscopic Scenes\n  with Geometric Modeling","authors":"Ruofeng Wei, Bin Li, Kai Chen, Yiyao Ma, Yunhui Liu, Qi Dou","authorsParsed":[["Wei","Ruofeng",""],["Li","Bin",""],["Chen","Kai",""],["Ma","Yiyao",""],["Liu","Yunhui",""],["Dou","Qi",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 03:18:04 GMT"}],"updateDate":"2024-08-15","timestamp":1723605484000,"abstract":"  Scale-aware monocular depth estimation poses a significant challenge in\ncomputer-aided endoscopic navigation. However, existing depth estimation\nmethods that do not consider the geometric priors struggle to learn the\nabsolute scale from training with monocular endoscopic sequences. Additionally,\nconventional methods face difficulties in accurately estimating details on\ntissue and instruments boundaries. In this paper, we tackle these problems by\nproposing a novel enhanced scale-aware framework that only uses monocular\nimages with geometric modeling for depth estimation. Specifically, we first\npropose a multi-resolution depth fusion strategy to enhance the quality of\nmonocular depth estimation. To recover the precise scale between relative depth\nand real-world values, we further calculate the 3D poses of instruments in the\nendoscopic scenes by algebraic geometry based on the image-only geometric\nprimitives (i.e., boundaries and tip of instruments). Afterwards, the 3D poses\nof surgical instruments enable the scale recovery of relative depth maps. By\ncoupling scale factors and relative depth estimation, the scale-aware depth of\nthe monocular endoscopic scenes can be estimated. We evaluate the pipeline on\nin-house endoscopic surgery videos and simulated data. The results demonstrate\nthat our method can learn the absolute scale with geometric modeling and\naccurately estimate scale-aware depth for monocular scenes.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vdWBhn5qnQjuBSwKuOJDHjH9vkz-jRu4wDK_JSjDV74","pdfSize":"5853181"}
