{"id":"2408.12899","title":"Harmonic maps of finite uniton number into inner symmetric spaces via\n  based normalized extended frames","authors":"Josef F. Dorfmeister, Peng Wang","authorsParsed":[["Dorfmeister","Josef F.",""],["Wang","Peng",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 08:05:38 GMT"}],"updateDate":"2024-08-26","timestamp":1724400338000,"abstract":"  In this paper, we develop a loop group description of harmonic maps\n$\\mathcal{F}: M \\rightarrow G/K$ of finite uniton number, from a Riemann\nsurface $M,$ compact or non-compact, into inner symmetric spaces of compact or\nnon-compact type. As a main result we show that the theory of [Burstall-Guest,\nMath Ann, 97], largely based on Bruhat cells, can be transformed into the DPW\ntheory which is mainly based on Birkhoff cells. Moreover, it turns out that the\npotentials constructed in [Burstall-Guest, Math Ann, 97], mainly see section 5,\ncan be used to carry out the DPW procedure which uses essentially the fixed\ninitial condition $e$ at a fixed base point $z_0$. This extends work of\nUhlenbeck, Segal, and Burstall-Guest to non-compact inner symmetric spaces as\ntarget spaces (as a consequence of a \"Duality Theorem\"). It also permits to say\nthat there is a 1-1-relation between finite uniton number harmonic maps and\nnormalized potentials of a very specific and very controllable type. In\nparticular, we prove that every harmonic map of finite uniton type from any\n(compact or non-compact) Riemann surface into any {compact or non-compact}\ninner symmetric space has a normalized potential taking values in some\nnilpotent Lie subalgebra, as well as a normalized frame with initial condition\nidentity. This provides a straightforward way to construct all such harmonic\nmaps. We also illustrate the above results exclusively by Willmore surfaces,\nsince this problem is motivated by the study of Willmore two--spheres in\nspheres.\n","subjects":["Mathematics/Differential Geometry"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}