{"id":"2408.00411","title":"Low-level I/O Monitoring for Scientific Workflows","authors":"Joel Witzke, Ansgar L\\\"o{\\ss}er, Vasilis Bountris, Florian Schintke,\n  Bj\\\"orn Scheuermann","authorsParsed":[["Witzke","Joel",""],["Lößer","Ansgar",""],["Bountris","Vasilis",""],["Schintke","Florian",""],["Scheuermann","Björn",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 09:29:24 GMT"}],"updateDate":"2024-08-02","timestamp":1722504564000,"abstract":"  While detailed resource usage monitoring is possible on the low-level using\nproper tools, associating such usage with higher-level abstractions in the\napplication layer that actually cause the resource usage in the first place\npresents a number of challenges. Suppose a large-scale scientific data analysis\nworkflow is run using a distributed execution environment such as a compute\ncluster or cloud environment and we want to analyze the I/O behaviour of it to\nfind and alleviate potential bottlenecks. Different tasks of the workflow can\nbe assigned to arbitrary compute nodes and may even share the same compute\nnodes. Thus, locally observed resource usage is not directly associated with\nthe individual workflow tasks. By acquiring resource usage profiles of the\ninvolved nodes, we seek to correlate the trace data to the workflow and its\nindividual tasks. To accomplish that, we select the proper set of metadata\nassociated with low-level traces that let us associate them with higher-level\ntask information obtained from log files of the workflow execution as well as\nthe job management using a task orchestrator such as Kubernetes with its\ncontainer management. Ensuring a proper information chain allows the\nclassification of observed I/O on a logical task level and may reveal the most\ncostly or inefficient tasks of a scientific workflow that are most promising\nfor optimization.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"axPZqCCaih8i4v1ZVzNb-g7QwGLKSTAUSMOrYza1cew","pdfSize":"565836","txDigest":"CsYybhQvtohZyX6WVqtNAqLjPT4MLBqZXX8mhGEfNJrK","endEpoch":"1","status":"CERTIFIED"}
