{"id":"2408.09424","title":"OVOSE: Open-Vocabulary Semantic Segmentation in Event-Based Cameras","authors":"Muhammad Rameez Ur Rahman, Jhony H. Giraldo, Indro Spinelli,\n  St\\'ephane Lathuili\\`ere, Fabio Galasso","authorsParsed":[["Rahman","Muhammad Rameez Ur",""],["Giraldo","Jhony H.",""],["Spinelli","Indro",""],["Lathuilière","Stéphane",""],["Galasso","Fabio",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 09:56:32 GMT"}],"updateDate":"2024-08-20","timestamp":1723974992000,"abstract":"  Event cameras, known for low-latency operation and superior performance in\nchallenging lighting conditions, are suitable for sensitive computer vision\ntasks such as semantic segmentation in autonomous driving. However, challenges\narise due to limited event-based data and the absence of large-scale\nsegmentation benchmarks. Current works are confined to closed-set semantic\nsegmentation, limiting their adaptability to other applications. In this paper,\nwe introduce OVOSE, the first Open-Vocabulary Semantic Segmentation algorithm\nfor Event cameras. OVOSE leverages synthetic event data and knowledge\ndistillation from a pre-trained image-based foundation model to an event-based\ncounterpart, effectively preserving spatial context and transferring\nopen-vocabulary semantic segmentation capabilities. We evaluate the performance\nof OVOSE on two driving semantic segmentation datasets DDD17, and\nDSEC-Semantic, comparing it with existing conventional image open-vocabulary\nmodels adapted for event-based data. Similarly, we compare OVOSE with\nstate-of-the-art methods designed for closed-set settings in unsupervised\ndomain adaptation for event-based semantic segmentation. OVOSE demonstrates\nsuperior performance, showcasing its potential for real-world applications. The\ncode is available at https://github.com/ram95d/OVOSE.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"_ob4x3refAnUsWddT4Vl6RgcunpFZci1WNWWR91pxPY","pdfSize":"9907101"}
