{"id":"2408.15426","title":"Electron FLASH platform for pre-clinical research: LINAC modification,\n  simplification of pulse control and dosimetry","authors":"Banghao Zhou (1), Lixiang Guo (1), Weiguo Lu (2), Mahbubur Rahman (2),\n  Rongxiao Zhang (3), Varghese Anto Chirayath (4), Yang Kyun Park (2),\n  Strahinja Stojadinovic (2), Marvin Garza (2), and Ken Kang-Hsin Wang (1) ((1)\n  Biomedical Imaging and Radiation Technology Laboratory (BIRTLab), Department\n  of Radiation Oncology, University of Texas Southwestern Medical Center,\n  Dallas, Texas, USA (2) Department of Radiation Oncology, University of Texas\n  Southwestern Medical Center, Dallas, Texas, USA (3) Department of Radiation\n  Medicine, New York Medical College, Valhalla, NY (4) Department of Physics,\n  College of Science, The University of Texas at Arlington, Arlington, TX, USA)","authorsParsed":[["Zhou","Banghao",""],["Guo","Lixiang",""],["Lu","Weiguo",""],["Rahman","Mahbubur",""],["Zhang","Rongxiao",""],["Chirayath","Varghese Anto",""],["Park","Yang Kyun",""],["Stojadinovic","Strahinja",""],["Garza","Marvin",""],["Wang","Ken Kang-Hsin",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 21:57:39 GMT"}],"updateDate":"2024-08-29","timestamp":1724795859000,"abstract":"  Background: FLASH radiotherapy is a treatment regime that delivers\ntherapeutic dose to tumors at an ultra-high dose rate while maintaining\nadequate normal tissue sparing. However, a comprehensive understanding of the\nunderlying mechanisms, potential late toxicities, and optimal fractionation\nschemes is important for successful clinical translation. This has necessitated\nextensive pre-clinical investigations, leading several research institutions to\ninitiate dedicated FLASH research programs. Purpose: This work describes a\nworkflow for establishing an easily accessible electron FLASH (eFLASH)\nplatform. The platform incorporates simplified pulse control, optimized dose\nrate delivery, and validated Monte Carlo (MC) dose engine for accurate in vivo\ndosimetry dedicated to FLASH pre-clinical studies. Methods: Adjustment of the\nautomatic frequency control (AFC) module allowed us to optimize the LINAC pulse\nform to achieve a uniform dose rate. A MC model for the 6 MeV FLASH beam was\ncommissioned to ensure accurate dose calculation necessary for reproducible in\nvivo studies. Results: Optimizing the AFC module enabled the generation of a\nuniform pulse form, ensuring consistent dose per pulse and a uniform dose rate\nthroughout FLASH irradiation. The MC model closely agreed with film\nmeasurements. MC dose calculations indicated that 6 MeV FLASH is adequate to\nachieve a uniform dose distribution for mouse whole brain irradiation but may\nnot be optimal for the spinal cord study. Conclusions: We present a novel\nworkflow for establishing a LINAC-based eFLASH research platform, incorporating\ntechniques for optimized dose rate delivery, a simplified pulse control system,\nand validated MC engine. This work provides researchers with valuable new\napproaches to facilitate the development of robust and accessible LINAC-based\nsystem for FLASH studies.\n","subjects":["Physics/Medical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}