{"id":"2408.03167","title":"Stacking fault segregation imaging with analytical field ion microscopy","authors":"F.F. Morgado, L.T. Stephenson, S. Bhatt, C. Freysoldt, S. Neumeier, S.\n  Katnagallu, A.P.A. Subramanyam, I. Pietka, T. Hammerschmidt, F. Vurpillot, B.\n  Gault","authorsParsed":[["Morgado","F. F.",""],["Stephenson","L. T.",""],["Bhatt","S.",""],["Freysoldt","C.",""],["Neumeier","S.",""],["Katnagallu","S.",""],["Subramanyam","A. P. A.",""],["Pietka","I.",""],["Hammerschmidt","T.",""],["Vurpillot","F.",""],["Gault","B.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 13:10:42 GMT"}],"updateDate":"2024-08-07","timestamp":1722949842000,"abstract":"  Stacking faults (SF) are important structural defects that play an essential\nrole in the deformation of engineering alloys. However, direct observation of\nstacking faults at the atomic scale can be challenging. Here, we use the\nanalytical field ion microscopy (aFIM), including density-functional theory\ninformed contrast estimation, to image local elemental segregation at SFs in a\ncreep-deformed solid solution single crystal alloy of Ni-2 at.% W. The\nsegregated atoms are imaged brightly, and time-of-flight spectrometry allows\nfor their identification as W. We also provide the first quantitative analysis\nof trajectory aberration, with a deviation of approximately 0.4 nm, explaining\nwhy atom probe tomography could not resolve these segregations. Atomistic\nsimulations of substitutional W atoms at an edge dislocation in fcc Ni using an\nanalytic bond-order potential indicate that the experimentally observed\nsegregation is due to the energetic preference of W for the center of the\nstacking fault, contrasting with e.g., Re segregating to partial dislocations.\nSolute segregation to SF can hinder dislocation motion, increasing the strength\nof Ni-based superalloys. Yet direct substitution of Re by W envisaged to lower\nsuperalloys' costs, requires extra consideration in alloy design since these\ntwo solutes do not have comparable interactions with structural defects during\ndeformation.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}