{"id":"2408.08648","title":"Understanding Enthymemes in Argument Maps: Bridging Argument Mining and\n  Logic-based Argumentation","authors":"Jonathan Ben-Naim and Victor David and Anthony Hunter","authorsParsed":[["Ben-Naim","Jonathan",""],["David","Victor",""],["Hunter","Anthony",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 10:30:30 GMT"}],"updateDate":"2024-08-19","timestamp":1723804230000,"abstract":"  Argument mining is natural language processing technology aimed at\nidentifying arguments in text. Furthermore, the approach is being developed to\nidentify the premises and claims of those arguments, and to identify the\nrelationships between arguments including support and attack relationships. In\nthis paper, we assume that an argument map contains the premises and claims of\narguments, and support and attack relationships between them, that have been\nidentified by argument mining. So from a piece of text, we assume an argument\nmap is obtained automatically by natural language processing. However, to\nunderstand and to automatically analyse that argument map, it would be\ndesirable to instantiate that argument map with logical arguments. Once we have\nthe logical representation of the arguments in an argument map, we can use\nautomated reasoning to analyze the argumentation (e.g. check consistency of\npremises, check validity of claims, and check the labelling on each arc\ncorresponds with thw logical arguments). We address this need by using\nclassical logic for representing the explicit information in the text, and\nusing default logic for representing the implicit information in the text. In\norder to investigate our proposal, we consider some specific options for\ninstantiation.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"EyoNIpAk6xYXPNfIoGHpJexmED-X6dwIIoi3Iw1j2yA","pdfSize":"376249"}
