{"id":"2408.10156","title":"Stacking Polymorphism of PtSe$_{2}$: Its Implication to Layer-dependent\n  Metal-insulator Transitions","authors":"Jeonghwan Ahn, Iuegyun Hong, Gwangyoung Lee, Hyeondeok Shin, Anouar\n  Benali, Yongkyung Kwon, and Jaron T. Krogel","authorsParsed":[["Ahn","Jeonghwan",""],["Hong","Iuegyun",""],["Lee","Gwangyoung",""],["Shin","Hyeondeok",""],["Benali","Anouar",""],["Kwon","Yongkyung",""],["Krogel","Jaron T.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 17:05:38 GMT"}],"updateDate":"2024-08-20","timestamp":1724087138000,"abstract":"  Using diffusion Monte Carlo (DMC) and density functional theory (DFT)\ncalculations, we examined the structural stability and interlayer binding\nproperties of PtSe$_2$, a representative transition metal dichalcogenide (TMD)\nwith strong interlayer interaction. Our DMC results for the bilayer revealed\nthat AA and AB-r stacking modes are nearly degenerate, highlighting the\nsignificant role of interlayer hybridization in offsetting the energy cost due\nto larger interlayer separations in the AB-r mode. Additionally, our\nDMC-benchmarked DFT studies with the r$^2$SCAN+rVV10 functional demonstrated\npronounced stacking polymorphism in few-layer PtSe$_2$, suggesting the\npotential for stacking faults and the formation of grain boundaries between\ndifferent stacking domains which could develop metallic electronic structures.\nThus this polymorphism, along with selenium vacancies, influences a\nlayer-dependent metal-insulator transition observed in few-layer PtSe$_2$. Our\nfindings emphasize the importance of both van der Waals interactions and\ninterlayer hybridization in determining the phase stability and electronic\nproperties of TMDs, advancing our understanding of their fundamental properties\nand refining theoretical models for practical applications in nanoelectronic\ndevices.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"muGSBwJ9KT8RWn0iE0LqL8cudBDSQGJrx6nNEkX6Emw","pdfSize":"5278816"}
