{"id":"2408.00896","title":"A Novel Highway Traffic Capacity Analyzing Method under Road Region\n  Atmospheric Environment Constrains Based on Computational Fluid Dynamics\n  Model","authors":"Ruohan Li, Hualan Wang, Qiyang Zhang, Ting Nie","authorsParsed":[["Li","Ruohan",""],["Wang","Hualan",""],["Zhang","Qiyang",""],["Nie","Ting",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 20:29:58 GMT"}],"updateDate":"2024-08-05","timestamp":1722544198000,"abstract":"  Highways always have a huge impact on the environment, quantifying the level\nof pollution and calculating the traffic capacity under environmental\nconstraints is an important part of practicing environmental protection.\nAvailable traffic capacity methods do not focus on the traffic emissions impact\non road region environment. To fill this research gap, this paper proposes a\nmethod consisting of Computational Fluid Dynamics (CFD) model and Traffic Flow\nField and the Gas Flow Field coupled model for the traffic capacity model. The\nCOPERT 5 model is adopted to simulate the traffic emissions on highways with\nfield measurement data and traffic conditions as initial conditions. Then,\nthese are served as the inputs, set and further calculated using coupled model\nin the CFD numerical simulation phase. Finally, modeling the Traffic Capacity\nmodel and calculating the traffic capacity. The experiment results in G30\nYongshan highway section demonstrate that, with the proposed method, the CFD\nsimulation model for traffic emissions in highway region can reflect the\npractical conditions (the overall error is within 10%), while the traffic\ncapacity can be well performance with the traffic capacity model under the\natmospheric pollution constraints. The annual average traffic capacity of G30\nYongshan is 739,800 vehicles, and SO2 under different constraints has the\ngreatest limitation on traffic capacity (90,9662 vehicles), which is the most\ndominant impact in the environmental constraints of the road region, rest are\nranked in: NO2 (246,5373), PM2.5 (323,6022), CO (771,8717), CO2 (803,7217), and\nPM10 (2202,0013).\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}