{"id":"2408.07532","title":"Improved 3D Whole Heart Geometry from Sparse CMR Slices","authors":"Yiyang Xu, Hao Xu, Matthew Sinclair, Esther Puyol-Ant\\'on, Steven A\n  Niederer, Amedeo Chiribiri, Steven E Williams, Michelle C Williams, Alistair\n  A Young","authorsParsed":[["Xu","Yiyang",""],["Xu","Hao",""],["Sinclair","Matthew",""],["Puyol-Antón","Esther",""],["Niederer","Steven A",""],["Chiribiri","Amedeo",""],["Williams","Steven E",""],["Williams","Michelle C",""],["Young","Alistair A",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 13:03:48 GMT"}],"updateDate":"2024-08-15","timestamp":1723640628000,"abstract":"  Cardiac magnetic resonance (CMR) imaging and computed tomography (CT) are two\ncommon non-invasive imaging methods for assessing patients with cardiovascular\ndisease. CMR typically acquires multiple sparse 2D slices, with unavoidable\nrespiratory motion artefacts between slices, whereas CT acquires isotropic\ndense data but uses ionising radiation. In this study, we explore the\ncombination of Slice Shifting Algorithm (SSA), Spatial Transformer Network\n(STN), and Label Transformer Network (LTN) to: 1) correct respiratory motion\nbetween segmented slices, and 2) transform sparse segmentation data into dense\nsegmentation. All combinations were validated using synthetic motion-corrupted\nCMR slice segmentation generated from CT in 1699 cases, where the dense CT\nserves as the ground truth. In 199 testing cases, SSA-LTN achieved the best\nresults for Dice score and Huasdorff distance (94.0% and 4.7 mm respectively,\naverage over 5 labels) but gave topological errors in 8 cases. STN was\neffective as a plug-in tool for correcting all topological errors with minimal\nimpact on overall performance (93.5% and 5.0 mm respectively). SSA also proves\nto be a valuable plug-in tool, enhancing performance over both STN-based and\nLTN-based models. The code for these different combinations is available at\nhttps://github.com/XESchong/STACOM2024.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7PmWbAqsdcfhG3-iHQIOB4i3bUzSznGpAhdxUI87918","pdfSize":"3397812"}
