{"id":"2408.00027","title":"Simulating Monolithic Active Pixel Sensors: A Technology-Independent\n  Approach Using Generic Doping Profiles","authors":"H{\\aa}kan Wennl\\\"of (1), Dominik Dannheim (2), Manuel Del Rio Viera (1\n  and 3), Katharina Dort (2 and 4), Doris Eckstein (1), Finn Feindt (1),\n  Ingrid-Maria Gregor (1), Lennart Huth (1), Stephan Lachnit (1 and 5), Larissa\n  Mendes (1 and 3), Daniil Rastorguev (1 and 6), Sara Ruiz Daza (1 and 3), Paul\n  Sch\\\"utze (1), Adriana Simancas (1 and 3), Walter Snoeys (2), Simon Spannagel\n  (1), Marcel Stanitzki (1), Alessandra Tomal (7), Anastasiia Velyka (1),\n  Gianpiero Vignola (1 and 3) ((1) Deutsches Elektronen-Synchrotron DESY, (2)\n  CERN, (3) University of Bonn, (4) University of Giessen, (5) University of\n  Hamburg, (6) University of Wuppertal, (7) University of Campinas)","authorsParsed":[["Wennlöf","Håkan","","1\n  and 3"],["Dannheim","Dominik","","1\n  and 3"],["Viera","Manuel Del Rio","","1\n  and 3"],["Dort","Katharina","","2 and 4"],["Eckstein","Doris","","1 and 5"],["Feindt","Finn","","1 and 5"],["Gregor","Ingrid-Maria","","1 and 5"],["Huth","Lennart","","1 and 5"],["Lachnit","Stephan","","1 and 5"],["Mendes","Larissa","","1 and 3"],["Rastorguev","Daniil","","1 and 6"],["Daza","Sara Ruiz","","1 and 3"],["Schütze","Paul","","1 and 3"],["Simancas","Adriana","","1 and 3"],["Snoeys","Walter","","1 and 3"],["Spannagel","Simon","","1 and 3"],["Stanitzki","Marcel","","1 and 3"],["Tomal","Alessandra","","1 and 3"],["Velyka","Anastasiia","","1 and 3"],["Vignola","Gianpiero","","1 and 3"]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 09:00:38 GMT"}],"updateDate":"2024-08-02","timestamp":1722416438000,"abstract":"  The optimisation of the sensitive region of CMOS sensors with complex\nnon-uniform electric fields requires precise simulations, and this can be\nachieved by a combination of electrostatic field simulations and Monte Carlo\nmethods. This paper presents the guiding principles of such simulations, using\na CMOS pixel sensor with a small collection electrode and a high-resistivity\nepitaxial layer as an example. The full simulation workflow is described, along\nwith possible pitfalls and how to avoid them. For commercial CMOS processes,\ndetailed doping profiles are confidential, but the presented method provides an\noptimisation tool that is sufficiently accurate to investigate sensor behaviour\nand trade-offs of different sensor designs without knowledge of proprietary\ninformation.\n  The workflow starts with detailed electric field finite element method\nsimulations in TCAD, using generic doping profiles. Examples of the effect of\nvarying different parameters of the simulated sensor are shown, as well as the\ncreation of weighting fields, and transient pulse simulations. The fields\nresulting from TCAD simulations can be imported into the Allpix Squared Monte\nCarlo simulation framework, which enables high-statistics simulations,\nincluding modelling of stochastic fluctuations from the underlying physics\nprocesses of particle interaction. Example Monte Carlo simulation setups are\npresented and the different parts of a simulation chain are described.\n  Simulation studies from small collection electrode CMOS sensors are\npresented, and example results are shown for both single sensors and multiple\nsensors in a test beam telescope configuration. The studies shown are those\ntypically performed on sensor prototypes in test beam campaigns, and a\ncomparison is made to test beam data, showing a maximum deviation of 4% and\ndemonstrating that the approach is viable for generating realistic results.\n","subjects":["Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"2Gxn6XCXhM6xoXJ8NDcyFh5apcKmD9u1B3esw5egVJw","pdfSize":"9031486"}
