{"id":"2408.05932","title":"Constructing accurate and efficient general-purpose atomistic machine\n  learning model with transferable accuracy for quantum chemistry","authors":"Yicheng Chen, Wenjie Yan, Zhanfeng Wang, Jianming Wu and Xin Xu","authorsParsed":[["Chen","Yicheng",""],["Yan","Wenjie",""],["Wang","Zhanfeng",""],["Wu","Jianming",""],["Xu","Xin",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 06:09:01 GMT"}],"updateDate":"2024-08-13","timestamp":1723442941000,"abstract":"  Density Functional Theory (DFT) has been a cornerstone in computational\nscience, providing powerful insights into structure-property relationships for\nmolecules and materials through first-principles quantum-mechanical (QM)\ncalculations. However, the advent of atomistic machine learning (ML) is\nreshaping the landscape by enabling large-scale dynamics simulations and\nhigh-throughput screening at DFT-equivalent accuracy with drastically reduced\ncomputational cost. Yet, the development of general-purpose atomistic ML models\nas surrogates for QM calculations faces several challenges, particularly in\nterms of model capacity, data efficiency, and transferability across chemically\ndiverse systems. This work introduces a novel extension of the polarizable atom\ninteraction neural network (namely, XPaiNN) to address these challenges. Two\ndistinct training strategies have been employed, one direct-learning and the\nother $\\Delta$-ML on top of a semi-empirical QM method. These methodologies\nhave been implemented within the same framework, allowing for a detailed\ncomparison of their results. The XPaiNN models, in particular the one using\n$\\Delta$-ML, not only demonstrate competitive performance on standard\nbenchmarks, but also demonstrate the effectiveness against other ML models and\nQM methods on comprehensive downstream tasks, including non-covalent\ninteractions, reaction energetics, barrier heights, geometry optimization and\nreaction thermodynamics, etc. This work represents a significant step forward\nin the pursuit of accurate and efficient atomistic ML models of\ngeneral-purpose, capable of handling complex chemical systems with transferable\naccuracy.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}