{"id":"2408.03003","title":"Cross-cultural analysis of pedestrian group behaviour influence on\n  crossing decisions in interactions with autonomous vehicles","authors":"Sergio Mart\\'in Serrano, \\'Oscar M\\'endez Blanco, Stewart Worrall,\n  Miguel \\'Angel Sotelo, David Fern\\'andez-Llorca","authorsParsed":[["Serrano","Sergio Martín",""],["Blanco","Óscar Méndez",""],["Worrall","Stewart",""],["Sotelo","Miguel Ángel",""],["Fernández-Llorca","David",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 07:28:59 GMT"}],"updateDate":"2024-08-07","timestamp":1722929339000,"abstract":"  Understanding cultural backgrounds is crucial for the seamless integration of\nautonomous driving into daily life as it ensures that systems are attuned to\ndiverse societal norms and behaviours, enhancing acceptance and safety in\nvaried cultural contexts. In this work, we investigate the impact of co-located\npedestrians on crossing behaviour, considering cultural and situational\nfactors. To accomplish this, a full-scale virtual reality (VR) environment was\ncreated in the CARLA simulator, enabling the identical experiment to be\nreplicated in both Spain and Australia. Participants (N=30) attempted to cross\nthe road at an urban crosswalk alongside other pedestrians exhibiting\nconservative to more daring behaviours, while an autonomous vehicle (AV)\napproached with different driving styles. For the analysis of interactions, we\nutilized questionnaires and direct measures of the moment when participants\nentered the lane.\n  Our findings indicate that pedestrians tend to cross the same traffic gap\ntogether, even though reckless behaviour by the group reduces confidence and\nmakes the situation perceived as more complex. Australian participants were\nwilling to take fewer risks than Spanish participants, adopting more cautious\nbehaviour when it was uncertain whether the AV would yield.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}