{"id":"2408.09906","title":"Diverse Impacts of Spin-Orbit Coupling on Superconductivity in\n  Rhombohedral Graphene","authors":"Jixiang Yang, Xiaoyan Shi, Shenyong Ye, Chiho Yoon, Zhengguang Lu,\n  Vivek Kakani, Tonghang Han, Junseok Seo, Lihan Shi, Kenji Watanabe, Takashi\n  Taniguchi, Fan Zhang, Long Ju","authorsParsed":[["Yang","Jixiang",""],["Shi","Xiaoyan",""],["Ye","Shenyong",""],["Yoon","Chiho",""],["Lu","Zhengguang",""],["Kakani","Vivek",""],["Han","Tonghang",""],["Seo","Junseok",""],["Shi","Lihan",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Zhang","Fan",""],["Ju","Long",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 11:26:23 GMT"}],"updateDate":"2024-08-20","timestamp":1724066783000,"abstract":"  Engineering non-Abelian quasiparticles by combining superconductivity and\ntopological states have been proposed as a route to realize topological quantum\ncomputation. Rhombohedral multilayer graphene with layer number N>=3 has been\nshown as a promising platform, as it hosts integer and fractional quantum\nanomalous Hall effects when proximitized by transition metal dichalcogenide\n(TMD) and a moire potential. However, superconductivity in similar devices have\nremained largely unexplored, although proximitized spin-orbit-coupling (SOC)\neffect has been shown to strengthen or induce superconductivity in both\ncrystalline and twisted graphene. Here we report electron transport\nmeasurements of TMD-proximitized rhombohedral trilayer graphene (RTG) at\ntemperatures down to 40 mK. We observed a new hole-doped superconducting state\nSC4 with a transition temperature Tc of 230 mK. On the electron-doped side, we\nidentified a new isospin-symmetry breaking three-quarter-metal (TQM) phase.\nNear this three-quarter-metal state, the state SC3, very weak in bare RTG, is\nfully developed into a superconducting state at 110 mK. By performing\nfermiology analysis based on the quantum oscillation measurement, we showed\nthat the SC3 and SC4 states reside at the phase boundaries between different\nisospin-symmetry-breaking states. These observations are aligned with the\nexisting understanding that SOC enhances graphene superconductivity.\nSurprisingly, the original superconducting state SC1 in bare RTG is strongly\nsuppressed in the presence of TMD, and we cannot find it down to the base\ntemperature of our measurement. Our observations form the basis of exploring\nsuperconductivity and non-Abelian quasiparticles in rhombohedral graphene\ndevices, and provide experimental evidence that challenges the understanding of\nthe impacts of SOC on graphene superconductivity.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}