{"id":"2408.04187","title":"Medical Graph RAG: Towards Safe Medical Large Language Model via Graph\n  Retrieval-Augmented Generation","authors":"Junde Wu, Jiayuan Zhu, Yunli Qi","authorsParsed":[["Wu","Junde",""],["Zhu","Jiayuan",""],["Qi","Yunli",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 03:11:12 GMT"}],"updateDate":"2024-08-09","timestamp":1723086672000,"abstract":"  We introduce a novel graph-based Retrieval-Augmented Generation (RAG)\nframework specifically designed for the medical domain, called\n\\textbf{MedGraphRAG}, aimed at enhancing Large Language Model (LLM)\ncapabilities and generating evidence-based results, thereby improving safety\nand reliability when handling private medical data. Our comprehensive pipeline\nbegins with a hybrid static-semantic approach to document chunking,\nsignificantly improving context capture over traditional methods. Extracted\nentities are used to create a three-tier hierarchical graph structure, linking\nentities to foundational medical knowledge sourced from medical papers and\ndictionaries. These entities are then interconnected to form meta-graphs, which\nare merged based on semantic similarities to develop a comprehensive global\ngraph. This structure supports precise information retrieval and response\ngeneration. The retrieval process employs a U-retrieve method to balance global\nawareness and indexing efficiency of the LLM. Our approach is validated through\na comprehensive ablation study comparing various methods for document chunking,\ngraph construction, and information retrieval. The results not only demonstrate\nthat our hierarchical graph construction method consistently outperforms\nstate-of-the-art models on multiple medical Q\\&A benchmarks, but also confirms\nthat the responses generated include source documentation, significantly\nenhancing the reliability of medical LLMs in practical applications. Code will\nbe at: https://github.com/MedicineToken/Medical-Graph-RAG/tree/main\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}