{"id":"2408.09333","title":"SkyScript-100M: 1,000,000,000 Pairs of Scripts and Shooting Scripts for\n  Short Drama","authors":"Jing Tang, Quanlu Jia, Yuqiang Xie, Zeyu Gong, Xiang Wen, Jiayi Zhang,\n  Yalong Guo, Guibin Chen, Jiangping Yang","authorsParsed":[["Tang","Jing",""],["Jia","Quanlu",""],["Xie","Yuqiang",""],["Gong","Zeyu",""],["Wen","Xiang",""],["Zhang","Jiayi",""],["Guo","Yalong",""],["Chen","Guibin",""],["Yang","Jiangping",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 02:27:25 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 07:34:37 GMT"}],"updateDate":"2024-08-29","timestamp":1723948045000,"abstract":"  Generating high-quality shooting scripts containing information such as scene\nand shot language is essential for short drama script generation. We collect\n6,660 popular short drama episodes from the Internet, each with an average of\n100 short episodes, and the total number of short episodes is about 80,000,\nwith a total duration of about 2,000 hours and totaling 10 terabytes (TB). We\nperform keyframe extraction and annotation on each episode to obtain about\n10,000,000 shooting scripts. We perform 100 script restorations on the\nextracted shooting scripts based on our self-developed large short drama\ngeneration model SkyReels. This leads to a dataset containing 1,000,000,000\npairs of scripts and shooting scripts for short dramas, called SkyScript-100M.\nWe compare SkyScript-100M with the existing dataset in detail and demonstrate\nsome deeper insights that can be achieved based on SkyScript-100M. Based on\nSkyScript-100M, researchers can achieve several deeper and more far-reaching\nscript optimization goals, which may drive a paradigm shift in the entire field\nof text-to-video and significantly advance the field of short drama video\ngeneration. The data and code are available at\nhttps://github.com/vaew/SkyScript-100M.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}