{"id":"2408.13339","title":"Rate Coefficients for Rotational State-to-State Transitions in H$_2$O +\n  H$_2$ Collisions as Predicted by Mixed Quantum/Classical Theory (MQCT)","authors":"Carolin Joy, Dulat Bostan, Bikramaditya Mandal, and Dmitri Babikov","authorsParsed":[["Joy","Carolin",""],["Bostan","Dulat",""],["Mandal","Bikramaditya",""],["Babikov","Dmitri",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 19:19:53 GMT"}],"updateDate":"2024-08-27","timestamp":1724440793000,"abstract":"  A new database of collisional rate coefficients for transitions between the\nrotational states of H$_2$O collided with H$_2$ background gas is developed.\nThe goal is to expand over the other existing databases in terms of the\nrotational states of water (200 states are included here) and the rotational\nstates of hydrogen (10 states). All four symmetries of ortho and para water\ncombined with ortho, and para hydrogen are considered.The mixed\nquantum/classical theory of inelastic scattering implemented in the code MQCT\nis employed. A detailed comparison with previous databases is conducted to\nensure that this approximate method is sufficiently accurate. Integration over\ncollision energies, summation over the final states of H$_2$ and averaging over\nthe initial states of H$_2$ is carried out to provide state-to-state,\neffective, and thermal rate coefficients in a broad range of temperatures.The\nrate coefficients for collisions with highly excited H$_2$ molecules are\npresented for the first time. It is found that rate coefficients for rotational\ntransitions in H$_2$O molecules grow with the rotational excitation of H$_2$\nprojectiles and exceed those of the ground state H$_2$, roughly, by a factor of\n2. These data enable more accurate description of water molecules in\nhigh-temperature environments, where the hydrogen molecules of background gas\nare rotationally excited, and the H$_2$O + H$_2$ collision energy is high. The\nrate coefficients presented here are expected to be accurate up to the\ntemperature of $\\sim$ 2000 K.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}