{"id":"2408.09725","title":"State surveillance in the digital age: Factors associated with citizens'\n  attitudes towards trust registers","authors":"Katja Turha, Simon Vrhovec, Igor Bernik","authorsParsed":[["Turha","Katja",""],["Vrhovec","Simon",""],["Bernik","Igor",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 06:29:29 GMT"}],"updateDate":"2024-08-20","timestamp":1724048969000,"abstract":"  This paper investigates factors related to the acceptance of trust registers\n(e.g., the Chinese Social Credit System - SCS) in Western settings. To avoid a\nnegative connotation, we first define the concept of trust register which\nencompasses surveillance systems in other settings beyond China, such as FICO\nin the US. Then, we explore which factors are associated with people's attitude\ntowards trust registers leaning on the technology acceptance and privacy\nconcern theories. A cross-sectional survey among Slovenian Facebook and\nInstagram users (N=147) was conducted. Covariance-based structural equation\nmodeling (CB-SEM) was used to test the hypothesized associations between the\nstudied constructs. Results indicate that attitude towards trust register is\ndirectly associated with perceived general usefulness of the trust register.\nAdditionally, perceived general usefulness is associated with perceived\nusefulness of the trust register for ensuring national security and fighting\ncrime, its ease of use, and privacy concern regarding data collection. As one\nof the first studies investigating attitude towards trust registers in a\nWestern country, it provides pioneering insights into factors that may be\nrelevant in case such registers would be implemented in a Western context, and\nprovides some practical implications regarding messaging for would-be\nimplementers of such systems.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}