{"id":"2408.08106","title":"Adaptation of uncertainty-penalized Bayesian information criterion for\n  parametric partial differential equation discovery","authors":"Pongpisit Thanasutives, Ken-ichi Fukui","authorsParsed":[["Thanasutives","Pongpisit",""],["Fukui","Ken-ichi",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 12:10:50 GMT"}],"updateDate":"2024-08-16","timestamp":1723723850000,"abstract":"  Data-driven discovery of partial differential equations (PDEs) has emerged as\na promising approach for deriving governing physics when domain knowledge about\nobserved data is limited. Despite recent progress, the identification of\ngoverning equations and their parametric dependencies using conventional\ninformation criteria remains challenging in noisy situations, as the criteria\ntend to select overly complex PDEs. In this paper, we introduce an extension of\nthe uncertainty-penalized Bayesian information criterion (UBIC), which is\nadapted to solve parametric PDE discovery problems efficiently without\nrequiring computationally expensive PDE simulations. This extended UBIC uses\nquantified PDE uncertainty over different temporal or spatial points to prevent\noverfitting in model selection. The UBIC is computed with data transformation\nbased on power spectral densities to discover the governing parametric PDE that\ntruly captures qualitative features in frequency space with a few significant\nterms and their parametric dependencies (i.e., the varying PDE coefficients),\nevaluated with confidence intervals. Numerical experiments on canonical PDEs\ndemonstrate that our extended UBIC can identify the true number of terms and\ntheir varying coefficients accurately, even in the presence of noise. The code\nis available at\n\\url{https://github.com/Pongpisit-Thanasutives/parametric-discovery}.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4t1A0Mn-EF2a-Pse4r4S6Tjb2clZeEUEZIZujio6edA","pdfSize":"1186451"}
