{"id":"2408.12312","title":"MakeupAttack: Feature Space Black-box Backdoor Attack on Face\n  Recognition via Makeup Transfer","authors":"Ming Sun, Lihua Jing, Zixuan Zhu, Rui Wang","authorsParsed":[["Sun","Ming",""],["Jing","Lihua",""],["Zhu","Zixuan",""],["Wang","Rui",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 11:39:36 GMT"}],"updateDate":"2024-08-23","timestamp":1724326776000,"abstract":"  Backdoor attacks pose a significant threat to the training process of deep\nneural networks (DNNs). As a widely-used DNN-based application in real-world\nscenarios, face recognition systems once implanted into the backdoor, may cause\nserious consequences. Backdoor research on face recognition is still in its\nearly stages, and the existing backdoor triggers are relatively simple and\nvisible. Furthermore, due to the perceptibility, diversity, and similarity of\nfacial datasets, many state-of-the-art backdoor attacks lose effectiveness on\nface recognition tasks. In this work, we propose a novel feature space backdoor\nattack against face recognition via makeup transfer, dubbed MakeupAttack. In\ncontrast to many feature space attacks that demand full access to target\nmodels, our method only requires model queries, adhering to black-box attack\nprinciples. In our attack, we design an iterative training paradigm to learn\nthe subtle features of the proposed makeup-style trigger. Additionally,\nMakeupAttack promotes trigger diversity using the adaptive selection method,\ndispersing the feature distribution of malicious samples to bypass existing\ndefense methods. Extensive experiments were conducted on two widely-used facial\ndatasets targeting multiple models. The results demonstrate that our proposed\nattack method can bypass existing state-of-the-art defenses while maintaining\neffectiveness, robustness, naturalness, and stealthiness, without compromising\nmodel performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}