{"id":"2408.06563","title":"Insights, opportunities and challenges provided by large cell atlases","authors":"Martin Hemberg, Federico Marini, Shila Ghazanfar, Ahmad Al Ajami,\n  Najla Abassi, Benedict Anchang, B\\'er\\'enice A. Benayoun, Yue Cao, Ken Chen,\n  Yesid Cuesta-Astroz, Zach DeBruine, Calliope A. Dendrou, Iwijn De Vlaminck,\n  Katharina Imkeller, Ilya Korsunsky, Alex R. Lederer, Pieter Meysman, Clint\n  Miller, Kerry Mullan, Uwe Ohler, Nikolaos Patikas, Jonas Schuck, Jacqueline\n  HY Siu, Timothy J. Triche Jr., Alex Tsankov, Sander W. van der Laan, Masanao\n  Yajima, Jean Yang, Fabio Zanini, Ivana Jelic","authorsParsed":[["Hemberg","Martin",""],["Marini","Federico",""],["Ghazanfar","Shila",""],["Ajami","Ahmad Al",""],["Abassi","Najla",""],["Anchang","Benedict",""],["Benayoun","Bérénice A.",""],["Cao","Yue",""],["Chen","Ken",""],["Cuesta-Astroz","Yesid",""],["DeBruine","Zach",""],["Dendrou","Calliope A.",""],["De Vlaminck","Iwijn",""],["Imkeller","Katharina",""],["Korsunsky","Ilya",""],["Lederer","Alex R.",""],["Meysman","Pieter",""],["Miller","Clint",""],["Mullan","Kerry",""],["Ohler","Uwe",""],["Patikas","Nikolaos",""],["Schuck","Jonas",""],["Siu","Jacqueline HY",""],["Triche","Timothy J.","Jr."],["Tsankov","Alex",""],["van der Laan","Sander W.",""],["Yajima","Masanao",""],["Yang","Jean",""],["Zanini","Fabio",""],["Jelic","Ivana",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 01:55:06 GMT"}],"updateDate":"2024-08-14","timestamp":1723514106000,"abstract":"  The field of single-cell biology is growing rapidly and is generating large\namounts of data from a variety of species, disease conditions, tissues, and\norgans. Coordinated efforts such as CZI CELLxGENE, HuBMAP, Broad Institute\nSingle Cell Portal, and DISCO, allow researchers to access large volumes of\ncurated datasets. Although the majority of the data is from scRNAseq\nexperiments, a wide range of other modalities are represented as well. These\nresources have created an opportunity to build and expand the computational\nbiology ecosystem to develop tools necessary for data reuse, and for extracting\nnovel biological insights. Here, we highlight achievements made so far, areas\nwhere further development is needed, and specific challenges that need to be\novercome.\n","subjects":["Quantitative Biology/Genomics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}