{"id":"2408.13029","title":"Indoor scene recognition from images under visual corruptions","authors":"Willams de Lima Costa, Raul Ismayilov, Nicola Strisciuglio, Estefania\n  Talavera Martinez","authorsParsed":[["Costa","Willams de Lima",""],["Ismayilov","Raul",""],["Strisciuglio","Nicola",""],["Martinez","Estefania Talavera",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 12:35:45 GMT"}],"updateDate":"2024-08-26","timestamp":1724416545000,"abstract":"  The classification of indoor scenes is a critical component in various\napplications, such as intelligent robotics for assistive living. While deep\nlearning has significantly advanced this field, models often suffer from\nreduced performance due to image corruption. This paper presents an innovative\napproach to indoor scene recognition that leverages multimodal data fusion,\nintegrating caption-based semantic features with visual data to enhance both\naccuracy and robustness against corruption. We examine two multimodal networks\nthat synergize visual features from CNN models with semantic captions via a\nGraph Convolutional Network (GCN). Our study shows that this fusion markedly\nimproves model performance, with notable gains in Top-1 accuracy when evaluated\nagainst a corrupted subset of the Places365 dataset. Moreover, while standalone\nvisual models displayed high accuracy on uncorrupted images, their performance\ndeteriorated significantly with increased corruption severity. Conversely, the\nmultimodal models demonstrated improved accuracy in clean conditions and\nsubstantial robustness to a range of image corruptions. These results highlight\nthe efficacy of incorporating high-level contextual information through\ncaptions, suggesting a promising direction for enhancing the resilience of\nclassification systems.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"a-AXCZdkarJSjManilLvcerAM_XFBYIj5SbyJYF2I-Q","pdfSize":"7176280"}
