{"id":"2408.15147","title":"Blackbox optimization for origami-inspired bistable structures","authors":"Luca Boisneault, Charles Audet, David Melancon","authorsParsed":[["Boisneault","Luca",""],["Audet","Charles",""],["Melancon","David",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 15:40:11 GMT"}],"updateDate":"2024-08-28","timestamp":1724773211000,"abstract":"  Bistable mechanical systems exhibit two stable configurations where the\nelastic energy is locally minimized. To realize such systems, origami\ntechniques have been proposed as a versatile platform to design deployable\nstructures with both compact and functional stable states. Conceptually, a\nbistable origami motif is composed of two-dimensional surfaces connected by\none-dimensional fold lines. This leads to stable configurations exhibiting\nzero-energy local minima. Physically, origami-inspired structures are\nthree-dimensional, comprising facets and hinges fabricated in a distinct stable\nstate where residual stresses are minimized. This leads to the dominance of one\nstable state over the other. To improve mechanical performance, one can solve\nthe constrained optimization problem of maximizing the bistability of origami\nstructures, defined as the amount of elastic energy required to switch between\nstable states, while ensuring materials used for the facets and hinges remain\nwithin their elastic regime. In this study, the Mesh Adaptive Direct Search\n(MADS) algorithm, a blackbox optimization technique, is used to solve the\nconstrained optimization problem. The bistable waterbomb-base origami motif is\nselected as a case-study to present the methodology. The elastic energy of this\norigami pattern under deployment is calculated via Finite Element simulations\nwhich serve as the blackbox in the MADS optimization loop. To validate the\nresults, optimized waterbomb-base geometries are built via Fused Filament\nFabrication and their response under loading is characterized experimentally on\na Uniaxial Test Machine. Ultimately, our method offers a general framework for\noptimizing bistability in mechanical systems, presenting opportunities for\nadvancement across various engineering applications.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}