{"id":"2408.12436","title":"Selective Amplification of a Gravitational Wave Signal Using an Atomic\n  Array","authors":"Navdeep Arya, Magdalena Zych","authorsParsed":[["Arya","Navdeep",""],["Zych","Magdalena",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 14:36:00 GMT"},{"version":"v2","created":"Thu, 19 Sep 2024 14:50:17 GMT"}],"updateDate":"2024-09-20","timestamp":1724337360000,"abstract":"  We present a novel principle for quantum sensing of gravitational waves by\nexploiting the collective emission rate of a one-dimensional array of initially\nuncorrelated atoms to selectively amplify a gravitational wave signal over flat\nspacetime contributions. In contrast to a single atom, we find that the\ncollective emission rate of the array is sensitive to the gravitational wave at\nfirst order in its amplitude. We quantify the collective response of the array\nto an incident gravitational wave by introducing the notion of the effective\nnumber of atoms cooperating to sense the gravitational wave. We determine the\noptimal interatomic spacing such that the flat spacetime collective effects\nvanish, but the imprint of the gravitational wave in the emission rate of the\narray scales nearly quadratically with the number of atoms. The near-quadratic\nscaling counteracts the small amplitude of the gravitational wave. Furthermore,\nthe coherent photon emission, which encodes the gravitational wave imprint,\nexhibits well-defined directionality and occurs at frequencies shifted by the\nwave's frequency. We analyze the setup's response to prototypical gravitational\nwave signals and show that, for coherent array sizes potentially realizable in\nthe near-term, the two advancements - collective response at first order in the\ngravitational wave's amplitude, and near-quadratic scaling with the number of\natoms - yield a photon emission rate large enough to be resolved by current\ntechnology in photon detectors.\n","subjects":["Physics/Quantum Physics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"E_Zfm-QM9jMvc9af2XgduCjRmV9kB3VSfZcsMLxfSbg","pdfSize":"3253764"}
