{"id":"2408.01268","title":"Rumour Spreading Depends on the Latent Geometry and Degree Distribution\n  in Social Network Models","authors":"Marc Kaufmann and Kostas Lakis and Johannes Lengler and Raghu Raman\n  Ravi and Ulysse Schaller and Konstantin Sturm","authorsParsed":[["Kaufmann","Marc",""],["Lakis","Kostas",""],["Lengler","Johannes",""],["Ravi","Raghu Raman",""],["Schaller","Ulysse",""],["Sturm","Konstantin",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 13:45:13 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 15:25:53 GMT"}],"updateDate":"2024-08-08","timestamp":1722606313000,"abstract":"  We study push-pull rumour spreading in small-world models for social networks\nwhere the degrees follow a power-law. In a non-geometric setting Fountoulakis,\nPanagiotou and Sauerwald have shown that rumours always spread fast (SODA\n2012). On the other hand, Janssen and Mehrabian have found that rumours spread\nslowly in a spatial preferential attachment model (SIDMA 2017). We study the\nquestion systematically for the model of geometric inhomogeneous random graphs\n(GIRGs), which has been found to be a good theoretical and empirical fit for\nsocial networks. Our result is two-fold: with classical Euclidean geometry both\nslow and fast rumour spreading may occur, depending on the exponent of the\npower law and the prevalence of weak ties in the networks, and we fully\ncharacterise the phase boundaries between those two regimes. Depending on the\nparameters, fast spreading may either mean polylogarithmic time or even doubly\nlogarithmic time. Secondly, we show that rumour spreading is always fast in a\nnon-metric geometry. The considered non-metric geometry allows to model social\nconnections where resemblance of vertices in a single attribute, such as\nfamilial kinship, already strongly indicates the presence of an edge. Classical\nEuclidean Geometry fails to capture such ties.\n  For some regimes in the Euclidean setting, the efficient pathways for\nspreading rumours differ from previously identified paths. A vertex of degree\n$d$ can transmit the rumour efficiently to a vertex of larger degree by a chain\nof length $3$, where one of the two intermediaries has constant degree, and the\nother has degree $d^{c}$ for some constant $c<1$.\n","subjects":["Mathematics/Probability","Computing Research Repository/Social and Information Networks","Mathematics/Combinatorics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}