{"id":"2408.03749","title":"Suppression of the type Ia supernova host galaxy step in the outer\n  regions of galaxies","authors":"M. Toy, P. Wiseman, M. Sullivan, D. Scolnic, M. Vincenzi, D. Brout, T.\n  M. Davis, C. Frohmaier, L. Galbany, C. Lidman, J. Lee, L. Kelsey, R. Kessler,\n  A. M\\\"oller, B. Popovic, B. O. S\\'anchez, P. Shah, M. Smith, S. Allam, M.\n  Aguena, O. Alves, D. Bacon, D. Brooks, D. L. Burke, A. Carnero Rosell, J.\n  Carretero, L. N. da Costa, M. E. S. Pereira, S. Desai, H. T. Diehl, P. Doel,\n  A. Drlica-Wagner, S. Everett, I. Ferrero, B. Flaugher, J. Frieman, J.\n  Garc\\'ia-Bellido, M. Gatti, E. Gaztanaga, G. Giannini, R. A. Gruendl, G.\n  Gutierrez, S. R. Hinton, D. L. Hollowood, K. Honscheid, D. J. James, O.\n  Lahav, S. Lee, J. L. Marshall, J. Mena-Fern\\'andez, R. Miquel, A. Palmese, A.\n  Pieres, A. A. Plazas Malag\\'on, A. K. Romer, S. Samuroff, E. Sanchez, D.\n  Sanchez Cid, M. Schubnell, E. Suchyta, M. E. C. Swanson, G. Tarle, D. L.\n  Tucker, V. Vikram, A. R. Walker and N. Weaverdyck","authorsParsed":[["Toy","M.",""],["Wiseman","P.",""],["Sullivan","M.",""],["Scolnic","D.",""],["Vincenzi","M.",""],["Brout","D.",""],["Davis","T. M.",""],["Frohmaier","C.",""],["Galbany","L.",""],["Lidman","C.",""],["Lee","J.",""],["Kelsey","L.",""],["Kessler","R.",""],["Möller","A.",""],["Popovic","B.",""],["Sánchez","B. O.",""],["Shah","P.",""],["Smith","M.",""],["Allam","S.",""],["Aguena","M.",""],["Alves","O.",""],["Bacon","D.",""],["Brooks","D.",""],["Burke","D. L.",""],["Rosell","A. Carnero",""],["Carretero","J.",""],["da Costa","L. N.",""],["Pereira","M. E. S.",""],["Desai","S.",""],["Diehl","H. T.",""],["Doel","P.",""],["Drlica-Wagner","A.",""],["Everett","S.",""],["Ferrero","I.",""],["Flaugher","B.",""],["Frieman","J.",""],["García-Bellido","J.",""],["Gatti","M.",""],["Gaztanaga","E.",""],["Giannini","G.",""],["Gruendl","R. A.",""],["Gutierrez","G.",""],["Hinton","S. R.",""],["Hollowood","D. L.",""],["Honscheid","K.",""],["James","D. J.",""],["Lahav","O.",""],["Lee","S.",""],["Marshall","J. L.",""],["Mena-Fernández","J.",""],["Miquel","R.",""],["Palmese","A.",""],["Pieres","A.",""],["Malagón","A. A. Plazas",""],["Romer","A. K.",""],["Samuroff","S.",""],["Sanchez","E.",""],["Cid","D. Sanchez",""],["Schubnell","M.",""],["Suchyta","E.",""],["Swanson","M. E. C.",""],["Tarle","G.",""],["Tucker","D. L.",""],["Vikram","V.",""],["Walker","A. R.",""],["Weaverdyck","N.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 13:01:26 GMT"}],"updateDate":"2024-08-08","timestamp":1723035686000,"abstract":"  Using 1533 type Ia supernovae (SNe Ia) from the five-year sample of the Dark\nEnergy Survey (DES), we investigate the effects of projected galactocentric\nseparation between the SNe and their host galaxies on their light curves and\nstandardization. We show, for the first time, that the difference in SN Ia\npost-standardization brightnesses between high and low-mass hosts reduces from\n$0.078\\pm0.011$ mag in the full sample to $0.036 \\pm 0.018$ mag for SNe Ia\nlocated in the outer regions of their host galaxies, while increasing to $0.100\n\\pm 0.014$ mag for SNe in the inner regions. In these inner regions, the step\ncan be reduced (but not removed) using a model where the $R_V$ of dust along\nthe line-of-sight to the SN changes as a function of galaxy properties. To\nexplain the remaining difference, we use the distributions of the SN Ia stretch\nparameter to test whether the inferred age of SN progenitors are more varied in\nthe inner regions of galaxies. We find that the proportion of high-stretch SNe\nIa in red (older) environments is more prominent in outer regions and that the\nouter regions stretch distributions are overall more homogeneous compared to\ninner regions, but conclude that this effect cannot explain the reduction in\nsignificance of any Hubble residual step in outer regions. We conclude that the\nstandardized distances of SNe Ia located in the outer regions of galaxies are\nless affected by their global host galaxy properties than those in the inner\nregions.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"E6lDykJGfVU_RvcVJCoTIH0h_5ZVagSZS_APWZc2z5k","pdfSize":"1924374"}
