{"id":"2408.04837","title":"Multi-User MISO with Stacked Intelligent Metasurfaces: A DRL-Based\n  Sum-Rate Optimization Approach","authors":"Hao Liu, Jiancheng An, George C. Alexandropoulos, Derrick Wing Kwan\n  Ng, Chau Yuen, and Lu Gan","authorsParsed":[["Liu","Hao",""],["An","Jiancheng",""],["Alexandropoulos","George C.",""],["Ng","Derrick Wing Kwan",""],["Yuen","Chau",""],["Gan","Lu",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 03:19:01 GMT"}],"updateDate":"2024-08-12","timestamp":1723173541000,"abstract":"  Stacked intelligent metasurfaces (SIMs) represent a novel signal processing\nparadigm that enables over-the-air processing of electromagnetic waves at the\nspeed of light. Their multi-layer architecture exhibits customizable\ncomputational capabilities compared to conventional single-layer reconfigurable\nintelligent surfaces and metasurface lenses. In this paper, we deploy SIM to\nimprove the performance of multi-user multiple-input single-output (MISO)\nwireless systems through a low complexity manner with reduced numbers of\ntransmit radio frequency chains. In particular, an optimization formulation for\nthe joint design of the SIM phase shifts and the transmit power allocation is\npresented, which is efficiently tackled via a customized deep reinforcement\nlearning (DRL) approach that systematically explores pre-designed states of the\nSIM-parametrized smart wireless environment. The presented performance\nevaluation results demonstrate the proposed method's capability to effectively\nlearn from the wireless environment, while consistently outperforming\nconventional precoding schemes under low transmit power conditions.\nFurthermore, the implementation of hyperparameter tuning and whitening process\nsignificantly enhance the robustness of the proposed DRL framework.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}