{"id":"2408.11359","title":"Hypergraph Learning based Recommender System for Anomaly Detection,\n  Control and Optimization","authors":"Sakhinana Sagar Srinivas, Rajat Kumar Sarkar, Venkataramana Runkana","authorsParsed":[["Srinivas","Sakhinana Sagar",""],["Sarkar","Rajat Kumar",""],["Runkana","Venkataramana",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 06:04:02 GMT"}],"updateDate":"2024-08-22","timestamp":1724220242000,"abstract":"  Anomaly detection is fundamental yet, challenging problem with practical\napplications in industry. The current approaches neglect the higher-order\ndependencies within the networks of interconnected sensors in the\nhigh-dimensional time series(multisensor data) for anomaly detection. To this\nend, we present a self-adapting anomaly detection framework for joint learning\nof (a) discrete hypergraph structure and (b) modeling the temporal trends and\nspatial relations among the interdependent sensors using the hierarchical\nencoder-decoder architecture to overcome the challenges. The hypergraph\nrepresentation learning-based framework exploits the relational inductive\nbiases in the hypergraph-structured data to learn the pointwise\nsingle-step-ahead forecasts through the self-supervised autoregressive task and\npredicts the anomalies based on the forecast error. Furthermore, our framework\nincentivizes learning the anomaly-diagnosis ontology through a differentiable\napproach. It derives the anomaly information propagation-based computational\nhypergraphs for root cause analysis and provides recommendations through an\noffline, optimal predictive control policy to remedy an anomaly. We conduct\nextensive experiments to evaluate the proposed method on the benchmark datasets\nfor fair and rigorous comparison with the popular baselines. The proposed\nmethod outperforms the baseline models and achieves SOTA performance. We report\nthe ablation studies to support the efficacy of the framework.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}