{"id":"2408.05475","title":"Cross-view image geo-localization with Panorama-BEV Co-Retrieval Network","authors":"Junyan Ye and Zhutao Lv and Weijia Li and Jinhua Yu and Haote Yang and\n  Huaping Zhong and Conghui He","authorsParsed":[["Ye","Junyan",""],["Lv","Zhutao",""],["Li","Weijia",""],["Yu","Jinhua",""],["Yang","Haote",""],["Zhong","Huaping",""],["He","Conghui",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 08:03:58 GMT"}],"updateDate":"2024-08-13","timestamp":1723277038000,"abstract":"  Cross-view geolocalization identifies the geographic location of street view\nimages by matching them with a georeferenced satellite database. Significant\nchallenges arise due to the drastic appearance and geometry differences between\nviews. In this paper, we propose a new approach for cross-view image\ngeo-localization, i.e., the Panorama-BEV Co-Retrieval Network. Specifically, by\nutilizing the ground plane assumption and geometric relations, we convert\nstreet view panorama images into the BEV view, reducing the gap between street\npanoramas and satellite imagery. In the existing retrieval of street view\npanorama images and satellite images, we introduce BEV and satellite image\nretrieval branches for collaborative retrieval. By retaining the original\nstreet view retrieval branch, we overcome the limited perception range issue of\nBEV representation. Our network enables comprehensive perception of both the\nglobal layout and local details around the street view capture locations.\nAdditionally, we introduce CVGlobal, a global cross-view dataset that is closer\nto real-world scenarios. This dataset adopts a more realistic setup, with\nstreet view directions not aligned with satellite images. CVGlobal also\nincludes cross-regional, cross-temporal, and street view to map retrieval\ntests, enabling a comprehensive evaluation of algorithm performance. Our method\nexcels in multiple tests on common cross-view datasets such as CVUSA, CVACT,\nVIGOR, and our newly introduced CVGlobal, surpassing the current\nstate-of-the-art approaches. The code and datasets can be found at\n\\url{https://github.com/yejy53/EP-BEV}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}