{"id":"2408.11142","title":"ISLES 2024: The first longitudinal multimodal multi-center real-world\n  dataset in (sub-)acute stroke","authors":"Evamaria O. Riedel, Ezequiel de la Rosa, The Anh Baran, Moritz\n  Hernandez Petzsche, Hakim Baazaoui, Kaiyuan Yang, David Robben, Joaquin Oscar\n  Seia, Roland Wiest, Mauricio Reyes, Ruisheng Su, Claus Zimmer, Tobias\n  Boeckh-Behrens, Maria Berndt, Bjoern Menze, Benedikt Wiestler, Susanne\n  Wegener, Jan S. Kirschke","authorsParsed":[["Riedel","Evamaria O.",""],["de la Rosa","Ezequiel",""],["Baran","The Anh",""],["Petzsche","Moritz Hernandez",""],["Baazaoui","Hakim",""],["Yang","Kaiyuan",""],["Robben","David",""],["Seia","Joaquin Oscar",""],["Wiest","Roland",""],["Reyes","Mauricio",""],["Su","Ruisheng",""],["Zimmer","Claus",""],["Boeckh-Behrens","Tobias",""],["Berndt","Maria",""],["Menze","Bjoern",""],["Wiestler","Benedikt",""],["Wegener","Susanne",""],["Kirschke","Jan S.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 18:59:52 GMT"}],"updateDate":"2024-08-22","timestamp":1724180392000,"abstract":"  Stroke remains a leading cause of global morbidity and mortality, placing a\nheavy socioeconomic burden. Over the past decade, advances in endovascular\nreperfusion therapy and the use of CT and MRI imaging for treatment guidance\nhave significantly improved patient outcomes and are now standard in clinical\npractice. To develop machine learning algorithms that can extract meaningful\nand reproducible models of brain function for both clinical and research\npurposes from stroke images - particularly for lesion identification, brain\nhealth quantification, and prognosis - large, diverse, and well-annotated\npublic datasets are essential. While only a few datasets with (sub-)acute\nstroke data were previously available, several large, high-quality datasets\nhave recently been made publicly accessible. However, these existing datasets\ninclude only MRI data. In contrast, our dataset is the first to offer\ncomprehensive longitudinal stroke data, including acute CT imaging with\nangiography and perfusion, follow-up MRI at 2-9 days, as well as acute and\nlongitudinal clinical data up to a three-month outcome. The dataset includes a\ntraining dataset of n = 150 and a test dataset of n = 100 scans. Training data\nis publicly available, while test data will be used exclusively for model\nvalidation. We are making this dataset available as part of the 2024 edition of\nthe Ischemic Stroke Lesion Segmentation (ISLES) challenge\n(https://www.isles-challenge.org/), which continuously aims to establish\nbenchmark methods for acute and sub-acute ischemic stroke lesion segmentation,\naiding in creating open stroke imaging datasets and evaluating cutting-edge\nimage processing algorithms.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}