{"id":"2408.14414","title":"Closed-loop control of active nematic flows","authors":"Katsu Nishiyama, John Berezney, Michael M. Norton, Akshit Aggarwal,\n  Saptorshi Ghosh, Michael F. Hagan, Zvonimir Dogic, and Seth Fraden","authorsParsed":[["Nishiyama","Katsu",""],["Berezney","John",""],["Norton","Michael M.",""],["Aggarwal","Akshit",""],["Ghosh","Saptorshi",""],["Hagan","Michael F.",""],["Dogic","Zvonimir",""],["Fraden","Seth",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 17:02:16 GMT"}],"updateDate":"2024-08-27","timestamp":1724691736000,"abstract":"  Living things enact control of non-equilibrium, dynamical structures through\ncomplex biochemical networks, accomplishing spatiotemporally-orchestrated\nphysiological tasks such as cell division, motility, and embryogenesis. While\nthe exact minimal mechanisms needed to replicate these behaviors using\nsynthetic active materials are unknown, controlling the complex, often chaotic,\ndynamics of active materials is essential to their implementation as engineered\nlife-like materials. Here, we demonstrate the use of external feedback control\nto regulate and control the spatially-averaged speed of a model active material\nwith time-varying actuation through applied light. We systematically vary the\ncontroller parameters to analyze the steady-state flow speed and temporal\nfluctuations, finding the experimental results in excellent agreement with\npredictions from both a minimal coarse-grained model and full\nnematohydrodynamic simulations. Our findings demonstrate that\nproportional-integral control can effectively regulate the dynamics of active\nnematics in light of challenges posed by the constituents, such as sample\naging, protein aggregation, and sample-to-sample variability. As in living\nthings, deviations of active materials from their steady-state behavior can\narise from internal processes and we quantify the important consequences of\nthis coupling on the controlled behavior of the active nematic. Finally, the\ninteraction between the controller and the intrinsic timescales of the active\nmaterial can induce oscillatory behaviors in a regime of parameter space that\nqualitatively matches predictions from our model. This work underscores the\npotential of feedback control in manipulating the complex dynamics of active\nmatter, paving the way for more sophisticated control strategies in the design\nof responsive, life-like materials.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Biological Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}