{"id":"2408.08833","title":"Intra-symbol Differential Amplitude Shift Keying-aided Blind Detector\n  for Ambient Backscatter Communication Systems","authors":"Shuaijun Ma, Peng Wei, Sa Xiao, Jianquan Wang, Wanbin Tang, and Wei\n  Xiang","authorsParsed":[["Ma","Shuaijun",""],["Wei","Peng",""],["Xiao","Sa",""],["Wang","Jianquan",""],["Tang","Wanbin",""],["Xiang","Wei",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 16:35:08 GMT"}],"updateDate":"2024-08-19","timestamp":1723826108000,"abstract":"  Ambient backscatter communications (AmBC) are a promising technology for\naddressing the energy consumption challenge in wireless communications through\nthe reflection or absorption of surrounding radio frequency (RF) signals.\nHowever, it grapples with the intricacies of ambient RF signal and the\nround-trip path loss. For traditional detectors, the incorporation of pilot\nsequences results in a reduction in spectral efficiency. Furthermore,\ntraditional energy-based detectors are inherently susceptible to a notable\nerror floor issue, attributed to the co-channel direct link interference (DLI).\nConsequently, this paper proposes a blind symbol detector without the prior\nknowledge of the channel state information, signal variance, and noise\nvariance. By leveraging the intra-symbol differential amplitude shift keying\n(IDASK) scheme, this detector effectively redirects the majority of the DLI\nenergy towards the largest eigenvalue of the received sample covariance matrix,\nthereby utilizing the second largest eigenvalue for efficient symbol detection.\nIn addition, this paper conducts theoretical performance analyses of the\nproposed detector in terms of the false alarm probability, missed detection\nprobability, and the bit-error rate (BER) lower bound. Simulation results\ndemonstrate that the proposed blind detector exhibits a significant enhancement\nin symbol detection performance compared to its traditional counterparts.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}