{"id":"2408.15200","title":"SpecGuard: Specification Aware Recovery for Robotic Autonomous Vehicles\n  from Physical Attacks","authors":"Pritam Dash and Ethan Chan and Karthik Pattabiraman","authorsParsed":[["Dash","Pritam",""],["Chan","Ethan",""],["Pattabiraman","Karthik",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 17:01:13 GMT"}],"updateDate":"2024-08-28","timestamp":1724778073000,"abstract":"  Robotic Autonomous Vehicles (RAVs) rely on their sensors for perception, and\nfollow strict mission specifications (e.g., altitude, speed, and geofence\nconstraints) for safe and timely operations. Physical attacks can corrupt the\nRAVs' sensors, resulting in mission failures. Recovering RAVs from such attacks\ndemands robust control techniques that maintain compliance with mission\nspecifications even under attacks to ensure the RAV's safety and timely\noperations.\n  We propose SpecGuard, a technique that complies with mission specifications\nand performs safe recovery of RAVs. There are two innovations in SpecGuard.\nFirst, it introduces an approach to incorporate mission specifications and\nlearn a recovery control policy using Deep Reinforcement Learning (Deep-RL). We\ndesign a compliance-based reward structure that reflects the RAV's complex\ndynamics and enables SpecGuard to satisfy multiple mission specifications\nsimultaneously. Second, SpecGuard incorporates state reconstruction, a\ntechnique that minimizes attack induced sensor perturbations. This\nreconstruction enables effective adversarial training, and optimizing the\nrecovery control policy for robustness under attacks. We evaluate SpecGuard in\nboth virtual and real RAVs, and find that it achieves 92% recovery success rate\nunder attacks on different sensors, without any crashes or stalls. SpecGuard\nachieves 2X higher recovery success than prior work, and incurs about 15%\nperformance overhead on real RAVs.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Cryptography and Security","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}