{"id":"2408.02858","title":"Medium-entropy Engineering of magnetism in layered antiferromagnet\n  CuxNi2(1-x)CrxP2S6","authors":"Dinesh Upreti, Rabindra Basnet, M. M. Sharma, Santosh Karki Chhetri,\n  Gokul Acharya, Md Rafique Un Nabi, Josh Sakon, Mansour Mortazavi, Jin Hu","authorsParsed":[["Upreti","Dinesh",""],["Basnet","Rabindra",""],["Sharma","M. M.",""],["Chhetri","Santosh Karki",""],["Acharya","Gokul",""],["Nabi","Md Rafique Un",""],["Sakon","Josh",""],["Mortazavi","Mansour",""],["Hu","Jin",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 22:54:09 GMT"}],"updateDate":"2024-08-07","timestamp":1722898449000,"abstract":"  Engineering magnetism in layered magnets could result in novel phenomena\nrelated to two-dimensional (2D) magnetism, which can be useful for fundamental\nresearch and practical applications. Extensive doping efforts such as\nsubstitution and intercalation have been adopted to tune antiferromagnetic\n(AFM) properties in M2P2X6 compounds. The substitutional doping in this\nmaterial family has mainly focused on bimetallic substitution. Recently, the\nmetal substitution can also be extended to more than two metal elements,\nleading to medium and high-entropy alloys (MEAs and HEAs), which are fairly\nunderexplored in layered magnetic systems including M2P2X6. In this work, we\nexplored the magnetic properties of the previously unreported Cu- and\nCr-substituted Ni2P2S6 i.e., CuxNi2(1-x)CrxP2S6. Our study reveals a relatively\nsystematic evolution of AFM phases with substitution than that observed in\ntraditional bimetallic substitution in M2P2X6. Furthermore, the Cu and Cr\nsubstitutions in Ni2P2S6 are found to enhance the ferromagnetic (FM)\ncorrelation, which is also accompanied by a possible weak FM phase at low\ntemperatures for the intermediate compositions from 0.32 to 0.80. Our work\nprovides a strategy to establish ferromagnetism in AFM M2P2X6 that can also be\nused for property tuning in other layered magnets.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"pRLffzCvTm2YnWVEetb7G3TGGjNs48Y6y4jpdNISOnc","pdfSize":"884630"}
