{"id":"2408.06941","title":"OpenResearcher: Unleashing AI for Accelerated Scientific Research","authors":"Yuxiang Zheng, Shichao Sun, Lin Qiu, Dongyu Ru, Cheng Jiayang, Xuefeng\n  Li, Jifan Lin, Binjie Wang, Yun Luo, Renjie Pan, Yang Xu, Qingkai Min, Zizhao\n  Zhang, Yiwen Wang, Wenjie Li, Pengfei Liu","authorsParsed":[["Zheng","Yuxiang",""],["Sun","Shichao",""],["Qiu","Lin",""],["Ru","Dongyu",""],["Jiayang","Cheng",""],["Li","Xuefeng",""],["Lin","Jifan",""],["Wang","Binjie",""],["Luo","Yun",""],["Pan","Renjie",""],["Xu","Yang",""],["Min","Qingkai",""],["Zhang","Zizhao",""],["Wang","Yiwen",""],["Li","Wenjie",""],["Liu","Pengfei",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 14:59:44 GMT"}],"updateDate":"2024-08-14","timestamp":1723561184000,"abstract":"  The rapid growth of scientific literature imposes significant challenges for\nresearchers endeavoring to stay updated with the latest advancements in their\nfields and delve into new areas. We introduce OpenResearcher, an innovative\nplatform that leverages Artificial Intelligence (AI) techniques to accelerate\nthe research process by answering diverse questions from researchers.\nOpenResearcher is built based on Retrieval-Augmented Generation (RAG) to\nintegrate Large Language Models (LLMs) with up-to-date, domain-specific\nknowledge. Moreover, we develop various tools for OpenResearcher to understand\nresearchers' queries, search from the scientific literature, filter retrieved\ninformation, provide accurate and comprehensive answers, and self-refine these\nanswers. OpenResearcher can flexibly use these tools to balance efficiency and\neffectiveness. As a result, OpenResearcher enables researchers to save time and\nincrease their potential to discover new insights and drive scientific\nbreakthroughs. Demo, video, and code are available at:\nhttps://github.com/GAIR-NLP/OpenResearcher.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}