{"id":"2408.03503","title":"Opening the Black Box of 3D Reconstruction Error Analysis with VECTOR","authors":"Racquel Fygenson, Kazi Jawad, Isabel Li, Francois Ayoub, Robert G.\n  Deen, Scott Davidoff, Dominik Moritz, Mauricio Hess-Flores","authorsParsed":[["Fygenson","Racquel",""],["Jawad","Kazi",""],["Li","Isabel",""],["Ayoub","Francois",""],["Deen","Robert G.",""],["Davidoff","Scott",""],["Moritz","Dominik",""],["Hess-Flores","Mauricio",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 02:03:32 GMT"}],"updateDate":"2024-08-08","timestamp":1722996212000,"abstract":"  Reconstruction of 3D scenes from 2D images is a technical challenge that\nimpacts domains from Earth and planetary sciences and space exploration to\naugmented and virtual reality. Typically, reconstruction algorithms first\nidentify common features across images and then minimize reconstruction errors\nafter estimating the shape of the terrain. This bundle adjustment (BA) step\noptimizes around a single, simplifying scalar value that obfuscates many\npossible causes of reconstruction errors (e.g., initial estimate of the\nposition and orientation of the camera, lighting conditions, ease of feature\ndetection in the terrain). Reconstruction errors can lead to inaccurate\nscientific inferences or endanger a spacecraft exploring a remote environment.\nTo address this challenge, we present VECTOR, a visual analysis tool that\nimproves error inspection for stereo reconstruction BA. VECTOR provides\nanalysts with previously unavailable visibility into feature locations, camera\npose, and computed 3D points. VECTOR was developed in partnership with the\nPerseverance Mars Rover and Ingenuity Mars Helicopter terrain reconstruction\nteam at the NASA Jet Propulsion Laboratory. We report on how this tool was used\nto debug and improve terrain reconstruction for the Mars 2020 mission.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}