{"id":"2408.02176","title":"Field-Tunable Valley Coupling and Localization in a Dodecagonal\n  Semiconductor Quasicrystal","authors":"Zhida Liu, Qiang Gao, Yanxing Li, Xiaohui Liu, Fan Zhang, Dong Seob\n  Kim, Yue Ni, Miles Mackenzie, Hamza Abudayyeh, Kenji Watanabe, Takashi\n  Taniguchi, Chih-Kang Shih, Eslam Khalaf, and Xiaoqin Li","authorsParsed":[["Liu","Zhida",""],["Gao","Qiang",""],["Li","Yanxing",""],["Liu","Xiaohui",""],["Zhang","Fan",""],["Kim","Dong Seob",""],["Ni","Yue",""],["Mackenzie","Miles",""],["Abudayyeh","Hamza",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Shih","Chih-Kang",""],["Khalaf","Eslam",""],["Li","Xiaoqin",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 01:12:58 GMT"}],"updateDate":"2024-08-06","timestamp":1722820378000,"abstract":"  Quasicrystals are characterized by atomic arrangements possessing long-range\norder without periodicity. Van der Waals (vdW) bilayers provide a unique\nopportunity to controllably vary atomic alignment between two layers from a\nperiodic moir\\'e crystal to an aperiodic quasicrystal. Here, we reveal a\nremarkable consequence of the unique atomic arrangement in a dodecagonal WSe2\nquasicrystal: the K and Q valleys in separate layers are brought arbitrarily\nclose in momentum space via higher-order Umklapp scatterings. A modest\nperpendicular electric field is sufficient to induce strong interlayer K-Q\nhybridization, manifested as a new hybrid excitonic doublet. Concurrently, we\nobserve the disappearance of the trion resonance and attribute it to\nquasicrystal potential driven localization. Our findings highlight the\nremarkable attribute of incommensurate systems to bring any pair of momenta\ninto close proximity, thereby introducing a novel aspect to valley engineering.\n","subjects":["Condensed Matter/Materials Science","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7M-L5_kfeyXHiLAuBf8FZx5AmEHjkWTNe1onzr14KKU","pdfSize":"8036693","txDigest":"9oeC58kQVRfAeuH4mArM4zUBRJmW2yeJ5ZnTV1BYTb2n","endEpoch":"1","status":"CERTIFIED"}
