{"id":"2408.00767","title":"Quantification and Validation for Degree of Understanding in M2M\n  Semantic Communications","authors":"Linhan Xia, Jiaxin Cai, Ricky Yuen-Tan Hou and Seon-Phil Jeong","authorsParsed":[["Xia","Linhan",""],["Cai","Jiaxin",""],["Hou","Ricky Yuen-Tan",""],["Jeong","Seon-Phil",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 03:37:42 GMT"}],"updateDate":"2024-08-05","timestamp":1721014662000,"abstract":"  With the development of Artificial Intelligence (AI) and Internet of Things\n(IoT) technologies, network communications based on the Shannon-Nyquist theorem\ngradually reveal their limitations due to the neglect of semantic information\nin the transmitted content. Semantic communication (SemCom) provides a solution\nfor extracting information meanings from the transmitted content. The semantic\ninformation can be successfully interpreted by a receiver with the help of a\nshared knowledge base (KB). This paper proposes a two-stage hierarchical\nqualification and validation model for natural language-based\nmachine-to-machine (M2M) SemCom. The approach can be applied in various\napplications, such as autonomous driving and edge computing. In the proposed\nmodel, we quantitatively measure the degree of understanding (DoU) between two\ncommunication parties at the word and sentence levels. The DoU is validated and\nensured at each level before moving to the next step. The model's effectiveness\nis verified through a series of experiments, and the results show that the\nquantification and validation method proposed in this paper can significantly\nimprove the DoU of inter-machine SemCom.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Computation and Language","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HoC0PKzP4VO79M90ep8ocZGuJ71uR5k17oMWuYFCPXY","pdfSize":"2900522","txDigest":"DF3jdF1xHqWD8uokWacZTgXLK23rz8y7tm2BWjeESrmq","endEpoch":"1","status":"CERTIFIED"}
