{"id":"2408.10731","title":"Towards reliable real-time trajectory optimization","authors":"Fatemeh Rastgar","authorsParsed":[["Rastgar","Fatemeh",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 11:01:41 GMT"}],"updateDate":"2024-08-21","timestamp":1724151701000,"abstract":"  Motion planning is a key aspect of robotics. A common approach to address\nmotion planning problems is trajectory optimization. Trajectory optimization\ncan represent the high-level behaviors of robots through mathematical\nformulations. However, current trajectory optimization approaches have two main\nchallenges. Firstly, their solution heavily depends on the initial guess, and\nthey are prone to get stuck in local minima. Secondly, they face scalability\nlimitations by increasing the number of constraints. This thesis endeavors to\ntackle these challenges by introducing four innovative trajectory optimization\nalgorithms to improve reliability, scalability, and computational efficiency.\nThere are two novel aspects of the proposed algorithms. The first key\ninnovation is remodeling the kinematic constraints and collision avoidance\nconstraints. Another key innovation lies in the design of algorithms that\neffectively utilize parallel computation on GPU accelerators. By using\nreformulated constraints and leveraging the computational power of GPUs, the\nproposed algorithms of this thesis demonstrate significant improvements in\nefficiency and scalability compared to the existing methods. Parallelization\nenables faster computation times, allowing for real-time decision-making in\ndynamic environments. Moreover, the algorithms are designed to adapt to changes\nin the environment, ensuring robust performance. Extensive benchmarking for\neach proposed optimizer validates their efficacy. Overall, this thesis makes a\nsignificant contribution to the field of trajectory optimization algorithms. It\nintroduces innovative solutions that specifically address the challenges faced\nby existing methods. The proposed algorithms pave the way for more efficient\nand robust motion planning solutions in robotics by leveraging parallel\ncomputation and specific mathematical structures.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}