{"id":"2408.07580","title":"Theoretical and Practical Progress in Hyperspectral Pixel Unmixing with\n  Large Spectral Libraries from a Sparse Perspective","authors":"Jade Preston and William Basener","authorsParsed":[["Preston","Jade",""],["Basener","William",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 14:24:56 GMT"}],"updateDate":"2024-08-15","timestamp":1723645496000,"abstract":"  Hyperspectral unmixing is the process of determining the presence of\nindividual materials and their respective abundances from an observed pixel\nspectrum. Unmixing is a fundamental process in hyperspectral image analysis,\nand is growing in importance as increasingly large spectral libraries are\ncreated and used. Unmixing is typically done with ordinary least squares (OLS)\nregression. However, unmixing with large spectral libraries where the materials\npresent in a pixel are not a priori known, solving for the coefficients in OLS\nrequires inverting a non-invertible matrix from a large spectral library. A\nnumber of regression methods are available that can produce a numerical\nsolution using regularization, but with considerably varied effectiveness.\nAlso, simple methods that are unpopular in the statistics literature (i.e.\nstep-wise regression) are used with some level of effectiveness in\nhyperspectral analysis. In this paper, we provide a thorough performance\nevaluation of the methods considered, evaluating methods based on how often\nthey select the correct materials in the models. Investigated methods include\nordinary least squares regression, non-negative least squares regression, ridge\nregression, lasso regression, step-wise regression and Bayesian model\naveraging. We evaluated these unmixing approaches using multiple criteria:\nincorporation of non-negative abundances, model size, accurate mineral\ndetection and root mean squared error (RMSE). We provide a taxonomy of the\nregression methods, showing that most methods can be understood as Bayesian\nmethods with specific priors. We conclude that methods that can be derived with\npriors that correspond to the phenomenology of hyperspectral imagery outperform\nthose with priors that are optimal for prediction performance under the\nassumptions of ordinary least squares linear regression.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8mGStj5jSV79MyAQN7_kBeRwK1cHHvEX-uLnyjYuISk","pdfSize":"1374868"}
