{"id":"2408.08513","title":"Arecibo Wow! I: An Astrophysical Explanation for the Wow! Signal","authors":"Abel M\\'endez, Kevin Ortiz Ceballos, Jorge I. Zuluaga","authorsParsed":[["Méndez","Abel",""],["Ceballos","Kevin Ortiz",""],["Zuluaga","Jorge I.",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 03:59:22 GMT"},{"version":"v2","created":"Wed, 11 Sep 2024 00:23:20 GMT"}],"updateDate":"2024-09-12","timestamp":1723780762000,"abstract":"  The Ohio State University Big Ear radio telescope detected in 1977 the Wow!\nSignal, one of the most famous and intriguing signals of extraterrestrial\norigin. Characterized by its strong relative intensity and narrow bandwidth\nnear the 1420 MHz hydrogen line, its source has never been detected again\ndespite numerous follow-up attempts. Arecibo Wow! is a new technosignature\nproject using archived data from the Arecibo Observatory. Here we present our\nfirst results of drift scans made between February and May 2020 at 1420 MHz.\nThe methods, frequency, and bandwidth of these observations are similar to\nthose used to detect the Wow! Signal. However, our observations are more\nsensitive, have better temporal resolution, and include polarization\nmeasurements. We report the detection of narrowband signals (10 kHz) near the\nhydrogen line similar to the Wow! Signal, although two-orders of magnitude less\nintense and in multiple locations. Despite the similarities, these signals are\neasily identifiable as small interstellar clouds of cold hydrogen (HI) in the\ngalaxy. We hypothesize that the Wow! Signal was caused by a sudden brightening\nof the hydrogen line in these clouds triggered by a strong transient radiation\nsource, such as a magnetar flare or a soft gamma repeater (SGR). A maser flare\nor superradiance mechanisms can produce stimulated emission consistent with the\nWow! Signal. Our hypothesis explains all observed properties of the Wow!\nSignal, proposes a new source of false positives in technosignature searches,\nand suggests that the Wow! Signal could be the first recorded event of an\nastronomical maser-like flare in the hydrogen line.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2v5Th6MEuj25FXtjwsPIh1iqO43VYUZEYWLHZhu3Ubs","pdfSize":"6847800"}
