{"id":"2408.03750","title":"Chirality in the Kagome Metal CsV$_3$Sb$_5$","authors":"H.J. Elmers, O. Tkach, Y. Lytvynenko, P. Yogi, M. Schmitt, D. Biswas,\n  J. Liu, S. V. Chernov, M. Hoesch, D. Kutnyakhov, N. Wind, L. Wenthaus, M.\n  Scholz, K. Rossnagel, A. Gloskovskii, C. Schlueter, A. Winkelmann, A.-A.\n  Haghighirad, T.-L. Lee, M. Sing, R. Claessen, M. Le Tacon, J. Demsar, G.\n  Schonhense, and O. Fedchenko","authorsParsed":[["Elmers","H. J.",""],["Tkach","O.",""],["Lytvynenko","Y.",""],["Yogi","P.",""],["Schmitt","M.",""],["Biswas","D.",""],["Liu","J.",""],["Chernov","S. V.",""],["Hoesch","M.",""],["Kutnyakhov","D.",""],["Wind","N.",""],["Wenthaus","L.",""],["Scholz","M.",""],["Rossnagel","K.",""],["Gloskovskii","A.",""],["Schlueter","C.",""],["Winkelmann","A.",""],["Haghighirad","A. -A.",""],["Lee","T. -L.",""],["Sing","M.",""],["Claessen","R.",""],["Tacon","M. Le",""],["Demsar","J.",""],["Schonhense","G.",""],["Fedchenko","O.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 13:04:35 GMT"}],"updateDate":"2024-08-08","timestamp":1723035875000,"abstract":"  Using x-ray photoelectron diffraction (XPD) and angle-resolved photoemission\nspectroscopy, we study photoemission intensity changes related to changes in\nthe geometric and electronic structure in the kagome metal CsV$_3$Sb$_5$ upon\ntransition to an unconventional charge density wave (CDW) state. The XPD\npatterns reveal the presence of a chiral atomic structure in the CDW phase.\nFurthermore, using circularly polarized x-rays, we have found a pronounced\nnon-trivial circular dichroism in the angular distribution of the valence band\nphotoemission in the CDW phase, indicating a chirality of the electronic\nstructure. This observation is consistent with the proposed orbital loop\ncurrent order. In view of a negligible spontaneous Kerr signal in recent\nmagneto-optical studies, the results suggest an antiferromagnetic coupling of\nthe orbital magnetic moments along the $c$-axis. While the inherent structural\nchirality may also induce circular dichroism, the observed asymmetry values\nseem to be too large in the case of the weak structural distortions caused by\nthe CDW.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/"}