{"id":"2408.14996","title":"Evidence for magnetic boundary layer accretion in RU Lup. A\n  spectrophotometric analysis","authors":"A. Armeni, B. Stelzer, A. Frasca, C. F. Manara, F. M. Walter, J. M.\n  Alcal\\'a, P. C. Schneider, A. Sicilia-Aguilar, J. Campbell-White, E.\n  Fiorellino, J. F. Gameiro, and M. Gangi","authorsParsed":[["Armeni","A.",""],["Stelzer","B.",""],["Frasca","A.",""],["Manara","C. F.",""],["Walter","F. M.",""],["Alcalá","J. M.",""],["Schneider","P. C.",""],["Sicilia-Aguilar","A.",""],["Campbell-White","J.",""],["Fiorellino","E.",""],["Gameiro","J. F.",""],["Gangi","M.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 12:24:20 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 10:35:52 GMT"}],"updateDate":"2024-08-29","timestamp":1724761460000,"abstract":"  The aim of this work is to characterize the accretion process of the\nclassical T Tauri Star RU Lup. We studied optical high-resolution spectroscopic\nobservations from CHIRON and ESPRESSO, obtained simultaneously with photometric\ndata from AAVSO and TESS. We detected a periodic modulation in the narrow\ncomponent of the He I 5876 line with a period that is compatible with the\nstellar rotation period, indicating the presence of a compact region on the\nstellar surface that we identified as the footprint of the accretion shock. We\nshow that this region is responsible for the veiling spectrum, which is made up\nof a continuum component plus narrow line emission. An analysis of the\nhigh-cadence TESS light curve reveals quasi-periodic oscillations on timescales\nshorter than the stellar rotation period, suggesting that the accretion disk in\nRU~Lup extends inward of the corotation radius, with a truncation radius at\n$\\sim 2 ~ R_{\\star}$. This is compatible with predictions from\nthree-dimensional magnetohydrodynamic models of accretion through a magnetic\nboundary layer (MBL). In this scenario, the photometric variability of RU Lup\nis produced by a nonstationary hot spot on the stellar surface that rotates\nwith the Keplerian period at the truncation radius. The analysis of the broad\ncomponents of selected emission lines reveals the existence of a\nnon-axisymmetric, temperature-stratified flow around the star, in which the gas\nleaves the accretion disk at the truncation radius and accretes onto the star\nchanneled by the magnetic field lines. The unusually rich metallic emission\nline spectrum of RU Lup might be characteristic of the MBL regime of accretion.\nIn conclusion, the behavior of RU Lup reveals many similarities to predictions\nfrom the MBL accretion scenario. Alternative explanations would require the\nexistence of a hot spot with a complex shape, or a warped structure in the\ninner disk.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nrtzVXNuv7DYg7sUtHO-4UCyOdpdmewApJFijWCI4q4","pdfSize":"4138376"}
