{"id":"2408.12717","title":"Comparing Gaia, NED and SIMBAD source classifications in nearby galaxies","authors":"J. Hales, P. Barmby","authorsParsed":[["Hales","J.",""],["Barmby","P.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 20:14:05 GMT"}],"updateDate":"2024-09-06","timestamp":1724357645000,"abstract":"  Gaia Data Release 3 (DR3) provides the first classifications for the sources\nin Gaia's all-sky database. Most Gaia sources are stars in the Milky Way, but\nDR3 also contains many sources that belong to nearby galaxies, as well as\nbackground galaxies and quasars. In this work, we compare the Gaia\nclassifications from the Discrete Source Classifier (CU8-DSC) module to the\nmore detailed and heterogeneous classifications in NED and/or SIMBAD for\nsources with sky positions within twice the Holmberg radius of nearby galaxies.\nMatching these catalogues gives approximately 3.2e5 unique Gaia matches for 4e5\nsources over 1040 galaxies (excluding some large Local Group galaxies) in the\nLocal Volume Galaxy catalogue. Matched sources contain a lower fraction of\nGaia-classified stars and higher fractions of galaxies and quasars (~95, 2 and\n2 per cent, respectively) than DR3 overall. Considering NED (SIMBAD)\nclassifications as truth values, the balanced accuracy of Gaia classification\nis 0.80 (0.83): the most common disagreements are literature-classified\ngalaxies Gaia-classified as stars and literature-classified stars\nGaia-classified as quasars. Purity (P) and completeness (C) metrics show that\nagreement between Gaia classification and NED/SIMBAD classification is best for\nstars (P,C~0.9), and decreases for quasars (P<0.3, 0.7<C<0.8), galaxies\n(0.7<P<0.8, 0.3<C<0.6), white dwarfs (0.04<P<0.6, C~0.6), and binary stars\n(P,C<0.1). NED or SIMBAD sources classified only by detection wavelength are\nmost often Gaia-classified as stars, while non-stellar components of galaxies\nappear in all Gaia classes.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}