{"id":"2408.03990","title":"Signatures of mass segregation from competitive accretion and monolithic\n  collapse","authors":"Richard J. Parker (1), Emily J. Pinson (1), Hayley L. Alcock (1) and\n  James E. Dale (2) (1. University of Sheffield, UK, 2. Universitet Uppsala,\n  Sweden)","authorsParsed":[["Parker","Richard J.",""],["Pinson","Emily J.",""],["Alcock","Hayley L.",""],["Dale","James E.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-09","timestamp":1723053600000,"abstract":"  The two main competing theories proposed to explain the formation of massive\n($>10$M$_\\odot$) stars -- competitive accretion and monolithic core collapse --\nmake different observable predictions for the environment of the massive stars\nduring, and immediately after, their formation. Proponents of competitive\naccretion have long predicted that the most massive stars should have a\ndifferent spatial distribution to lower-mass stars, either through the stars\nbeing mass segregated, or being in areas of higher relative densities, or\nsitting deeper in gravitational potential wells. We test these predictions by\nanalysing a suite of SPH simulations where star clusters form massive stars via\ncompetitive accretion with and without feedback. We find that the most massive\nstars have higher relative densities, and sit in deeper potential wells, only\nin simulations in which feedback is not present. When feedback is included,\nonly half of the simulations have the massive stars residing in deeper\npotential wells, and there are no other distinguishing signals in their spatial\ndistributions. Intriguingly, in our simple models for monolithic core collapse,\nthe massive stars may also end up in deeper potential wells, because if massive\ncores fragment the stars are still massive, and dominate their local environs.\nWe find no robust diagnostic test in the spatial distributions of massive stars\nthat can distinguish their formation mechanisms, and so other predictions for\ndistinguishing between competitive accretion and monolithic collapse are\nrequired.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}