{"id":"2408.11070","title":"Nonlinear scintillation effects in the intrinsic luminescence from\n  Sc$_{1.318}$Y$_{0.655}$Si$_{1.013}$O$_{4.987}$ crystal excited by electrons\n  and gamma-quanta","authors":"M. V. Belov, V. A. Kozlov, N. V. Pestovskii, S. Yu. Savinov, V. S.\n  Tskhay, V. I. Vlasov, A. I. Zagumennyi, Yu. D. Zavartsev and M. V. Zavertyaev","authorsParsed":[["Belov","M. V.",""],["Kozlov","V. A.",""],["Pestovskii","N. V.",""],["Savinov","S. Yu.",""],["Tskhay","V. S.",""],["Vlasov","V. I.",""],["Zagumennyi","A. I.",""],["Zavartsev","Yu. D.",""],["Zavertyaev","M. V.",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 22:03:52 GMT"}],"updateDate":"2024-08-22","timestamp":1723932232000,"abstract":"  The spectral and kinetic properties of intrinsic luminescence from\n(Y$_2$Sc$_1$)$_{0.(3)}$(Sc)[Si]O$_5$ crystal are studied. The emission is\nexcited by electrons and gamma-quanta. The composition\n(Y$_2$Sc$_1$)$_{0.(3)}$(Sc)[Si]O$_5$ is the congruent one for\nSc$_2$SiO$_5$-Y$_2$SiO$_5$ solid solutions. It is found, that the crystal emits\nfairly bright intrinsic cathodololuminescence (CL) and radioluminescence (RL)\nat room temperature. In particular, the light yield of scintillation excited by\n-quanta with the energies of 661.7 keV is of 12000 photons/MeV. An increase in\nthe beam flux by $\\sim$20 times leads to the shift in the maximum CL energy\nspectral density from 315 to 340 nm and to the decrease in the CL decay time at\n415 nm from 1377 +/- 3 ns to 1165 +/- 1 ns. Simultaneously, the decay time of\nRL excited by a photoelectron with the energy of 644.7 keV is of 1310 +/- 10 ns\nwhile a Compton electron with the energy of 477 keV excites RL with the decay\ntime of 1050 +/- 10 ns. Also, we observed differences in the CL yield\ndependencies on the volume-averaged density of electronic excitations (EEs) at\ndifferent wavelengths. An explanation of the results is given considering the\nnonlinear scintillation phenomena induced by an interaction between EEs. It is\nbased on a conception that an increase in EE volume density leads to an\nincrease in EEs nonradiative quenching due to these interactions.\n","subjects":["Physics/Instrumentation and Detectors","Condensed Matter/Materials Science","Physics/High Energy Physics - Experiment","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}