{"id":"2408.01819","title":"Three-phase equilibria of hydrates from computer simulation. III. Effect\n  of dispersive interactions in the methane and carbon dioxide hydrates","authors":"J. Algaba, S. Blazquez, J. M. M\\'iguez, M. M. Conde, and F. J. Blas","authorsParsed":[["Algaba","J.",""],["Blazquez","S.",""],["Míguez","J. M.",""],["Conde","M. M.",""],["Blas","F. J.",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 16:28:05 GMT"}],"updateDate":"2024-08-06","timestamp":1722702485000,"abstract":"  In this work, the effect of the range of the dispersive interactions in the\ndetermination of the three-phase coexistence line of the CO$_2$ and CH$_4$\nhydrates has been studied. In particular, the temperature ($T_3$) at which\nsolid hydrate, water, and liquid CO$_2$/gas CH$_4$ coexist has been determined\nthrough molecular dynamics simulations using different cut-off values (from 0.9\nto 1.6 nm) for the dispersive interactions. The $T_3$ of both hydrates has been\ndetermined using the direct coexistence simulation technique. Following this\nmethod, the three phases in equilibrium are put together in the same simulation\nbox, the pressure is fixed, and simulations are performed at different\ntemperatures $T$. If the hydrate melts, then $T>T_3$. Contrary, if the hydrate\ngrows, then $T<T_3$. The effect of the cut-off distance on the dissociation\ntemperature has been analyzed at three different pressures for CO$_{2}$\nhydrate, namely, $100$, $400$, and $1000\\,\\text{bar}$. Then, we have changed\nthe guest and studied the effect of the cut-off distance on the dissociation\ntemperature of the CH$_{4}$ hydrate at $400\\,\\text{bar}$. Also, the effect of\nlong-range corrections for dispersive interactions has been analyzed by running\nsimulations with homo- and inhomogeneous corrections and a cut-off value of 0.9\nnm. The results obtained in this work highlight that the cut-off distance for\nthe dispersive interactions affects the stability conditions of these hydrates.\nThis effect is enhanced when the pressure is decreased, displacing the $T_{3}$\nabout $2-4\\,\\text{K}$ depending on the system and the pressure.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"e1dP6AfWHCbuAJkyuTikQPENZQtn0QDhoEwBu1Mszvo","pdfSize":"3052015","txDigest":"FxxUPzHhuJMmhqdzcmDdN7SevW55UG3L3khPjhKSJLdJ","endEpoch":"1","status":"CERTIFIED"}
