{"id":"2408.14934","title":"Discontinuous Galerkin finite element method for the continuum radiative\n  transfer problem inside axis-symmetric circumstellar envelopes","authors":"J. Perdigon, M. Faurobert and G. Niccolini","authorsParsed":[["Perdigon","J.",""],["Faurobert","M.",""],["Niccolini","G.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 10:14:33 GMT"}],"updateDate":"2024-08-28","timestamp":1724753673000,"abstract":"  The study of the continuum radiative transfer problem inside circumstellar\nenvelopes is both a theoretical and numerical challenge, especially in the\nfrequency-dependent and multi-dimensional case. While approximate methods are\neasier to handle numerically, they often fail to accurately describe the\nradiation field inside complex geometries. For these cases, it is necessary to\ndirectly solve numerically the radiative transfer equation. We investigate the\naccuracy of a discontinuous Galerkin finite element method (DGFEM hereafter)\napplied to the frequency-dependent two dimensional radiative transfer equation,\ncoupled with the radiative equilibrium equation, inside axis-symmetric\ncircumstellar envelopes. The DGFEM is a variant of finite element methods. It\nemploys discontinuous elements and flux integrals along their boundaries,\nensuring local conservation. However, as opposed to the classical\nfinite-element methods, the solution is discontinuous across element edges. We\nimplemented the method in a code and tested its accuracy by comparing our\nresults with the benchmarks from the literature. For all the tested cases, the\ntemperature profile agrees within one percent. Additionally, the emerging\nspectral energy distributions (SEDs) and images, obtained subsequently by\nray-tracing techniques from the DGFEM solution, agree on average within\n$5~\\mathrm{\\%}$ and $10~\\mathrm{\\%}$, respectively. We show that the DGFEM can\naccurately describe the temperature profile inside axis-symmetric circumstellar\nenvelopes. Consecutively the emerging SEDs and images are also well reproduced.\nThe discontinuous Galerkin finite element method provides an alternative method\n(other than Monte Carlo methods for instance) for solving the radiative\ntransfer equation, and could be used in cases that are more difficult to handle\nwith the other methods.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"32PFiAFedXDgB0XxvGgmuDNW7mCq4KPkUUY3i6TUzTM","pdfSize":"923118"}
