{"id":"2408.15768","title":"Started Off Local, Now We're in the Cloud: Forensic Examination of the\n  Amazon Echo Show 15 Smart Display","authors":"Jona Crasselt and Gaston Pugliese","authorsParsed":[["Crasselt","Jona",""],["Pugliese","Gaston",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 13:01:16 GMT"}],"updateDate":"2024-08-29","timestamp":1724850076000,"abstract":"  Amazon Echo is one of the most popular product families of smart speakers and\ndisplays. Considering their growing presence in modern households as well as\nthe digital traces associated with residents' interactions with these devices,\nanalyses of Echo products are likely to become more common for forensic\ninvestigators at \"smart home\" crime scenes. With this in mind, we present the\nfirst forensic examination of the Echo Show 15, Amazon's largest smart display\nrunning on Fire OS and the first Echo device with Visual ID, a face recognition\nfeature. We unveil a non-invasive method for accessing the unencrypted file\nsystem of the Echo Show 15 based on an undocumented pinout for the eMMC\ninterface which we discovered on the main logic board. On the device, we\nidentify various local usage artifacts, such as searched products, streamed\nmovies, visited websites, metadata of photos and videos as well as logged\nevents of Visual ID about movements and users detected by the built-in camera.\nFurthermore, we utilize an insecurely stored token on the Echo Show 15 to\nobtain access to remote user artifacts in Amazon's cloud, including Alexa voice\nrequests, calendars, contacts, conversations, photos, and videos. In this\nregard, we also identify new Amazon APIs through network traffic analysis of\ntwo companion apps, namely Alexa and Photos. Overall, in terms of practical\nrelevance, our findings demonstrate a non-destructive way of data acquisition\nfor Echo Show 15 devices as well as how to lift the scope of forensic traces\nfrom local artifacts on the device to remote artifacts stored in the cloud.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}