{"id":"2408.00842","title":"Surface Code with Imperfect Erasure Checks","authors":"Kathleen Chang, Shraddha Singh, Jahan Claes, Kaavya Sahay, James Teoh,\n  Shruti Puri","authorsParsed":[["Chang","Kathleen",""],["Singh","Shraddha",""],["Claes","Jahan",""],["Sahay","Kaavya",""],["Teoh","James",""],["Puri","Shruti",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 18:00:37 GMT"}],"updateDate":"2024-08-05","timestamp":1722535237000,"abstract":"  Recently, a lot of effort has been devoted towards designing erasure qubits\nin which dominant physical noise excites leakage states whose population can be\ndetected and returned to the qubit subspace. Interest in these erasure qubits\nhas been driven by studies showing that the requirements for fault-tolerant\nquantum error correction are significantly relaxed when noise in every gate\noperation is dominated by erasures. However, these studies assume perfectly\naccurate erasure checks after every gate operation which generally come with\nundesirable time and hardware overhead costs. In this work, we investigate the\nconsequences of using an imperfect but overhead-efficient erasure check for\nfault-tolerant quantum error correction with the surface code. We show that,\nunder physically reasonable assumptions on the imperfect erasure checks, the\nthreshold error rate is still at least over twice that for Pauli noise. We also\nstudy the impact of imperfect erasure checks on the effective error distance\nand find that it degrades the effective distance under a general error model in\nwhich a qubit suffers from depolarizing noise when interacting with a leaked\nqubit. We then identify a more restrictive but realistic noise model for a\nqubit that interacts with a leaked qubit, under which the effective error\ndistance is twice that for Pauli noise. We apply our analysis to recently\nproposed superconducting dual-rail erasure qubits and show that achieving good\nperformance surface code quantum memories with relaxed system requirements is\npossible.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}