{"id":"2408.02501","title":"Fair Resource Allocation For Hierarchical Federated Edge Learning in\n  Space-Air-Ground Integrated Networks via Deep Reinforcement Learning with\n  Hybrid Control","authors":"Chong Huang, Gaojie Chen, Pei Xiao, Jonathon A. Chambers, Wei Huang","authorsParsed":[["Huang","Chong",""],["Chen","Gaojie",""],["Xiao","Pei",""],["Chambers","Jonathon A.",""],["Huang","Wei",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 14:22:52 GMT"}],"updateDate":"2024-08-06","timestamp":1722867772000,"abstract":"  The space-air-ground integrated network (SAGIN) has become a crucial research\ndirection in future wireless communications due to its ubiquitous coverage,\nrapid and flexible deployment, and multi-layer cooperation capabilities.\nHowever, integrating hierarchical federated learning (HFL) with edge computing\nand SAGINs remains a complex open issue to be resolved. This paper proposes a\nnovel framework for applying HFL in SAGINs, utilizing aerial platforms and low\nEarth orbit (LEO) satellites as edge servers and cloud servers, respectively,\nto provide multi-layer aggregation capabilities for HFL. The proposed system\nalso considers the presence of inter-satellite links (ISLs), enabling\nsatellites to exchange federated learning models with each other. Furthermore,\nwe consider multiple different computational tasks that need to be completed\nwithin a limited satellite service time. To maximize the convergence\nperformance of all tasks while ensuring fairness, we propose the use of the\ndistributional soft-actor-critic (DSAC) algorithm to optimize resource\nallocation in the SAGIN and aggregation weights in HFL. Moreover, we address\nthe efficiency issue of hybrid action spaces in deep reinforcement learning\n(DRL) through a decoupling and recoupling approach, and design a new dynamic\nadjusting reward function to ensure fairness among multiple tasks in federated\nlearning. Simulation results demonstrate the superiority of our proposed\nalgorithm, consistently outperforming baseline approaches and offering a\npromising solution for addressing highly complex optimization problems in\nSAGINs.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}