{"id":"2408.12450","title":"Thermal and non-thermal dark matters with gravitational neutrino\n  reheating","authors":"Md Riajul Haque, Debaprasad Maity, Rajesh Mondal","authorsParsed":[["Haque","Md Riajul",""],["Maity","Debaprasad",""],["Mondal","Rajesh",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 14:46:54 GMT"}],"updateDate":"2024-08-23","timestamp":1724338014000,"abstract":"  We have discussed in detail how neutrinos produced from inflaton solely\nthrough gravitational interaction can successfully reheat the universe. For\nthis, we have introduced the well-known Type-I seesaw neutrino model. Depending\non seesaw model parameters, two distinct reheating histories have been realized\nand dubbed as i) Neutrino dominating: Following the inflaton domination, the\nuniverse becomes neutrino dominated, and their subsequent decay concludes the\nreheating process, and ii) Neutrino heating: Despite being sub-dominant\ncompared to inflaton energy, neutrinos efficiently heat the thermal bath and\nproduce the radiation dominated universe. Imposing baryon asymmetric yield, the\n$\\Delta N_{\\rm eff}$ constraint at Big Bang Nucleosynthesis (BBN) considering\nprimordial gravitational waves (PGW), we have arrived at the following\nconstraints on reheating equation of state to lie within $0.5\\lesssim\nw_\\phi\\lesssim1.0$. In these neutrino-driven reheating backgrounds, we further\nperformed a detailed analysis of both thermal and non-thermal production of\ndark matter (DM), invoking two minimal models, namely the Higgs portal DM and\nclassical QCD pseudo scalar axion. An interesting correlation between seemingly\nuncorrelated DM and Type-I seesaw parameters has emerged when confronting\nvarious direct and indirect observations. When DMs are set to freeze-in,\nfreeze-out, or oscillate during reheating, new parameter spaces open, which\ncould be potentially detectable in future experiments, paving an indirect way\nto look into the early universe in the laboratory.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}