{"id":"2408.09713","title":"Carbon Footprint Accounting Driven by Large Language Models and\n  Retrieval-augmented Generation","authors":"Haijin Wang, Mianrong Zhang, Zheng Chen, Nan Shang, Shangheng Yao,\n  Fushuan Wen, Junhua Zhao","authorsParsed":[["Wang","Haijin",""],["Zhang","Mianrong",""],["Chen","Zheng",""],["Shang","Nan",""],["Yao","Shangheng",""],["Wen","Fushuan",""],["Zhao","Junhua",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 06:05:24 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 12:22:16 GMT"}],"updateDate":"2024-08-21","timestamp":1724047524000,"abstract":"  Carbon footprint accounting is crucial for quantifying greenhouse gas\nemissions and achieving carbon neutrality.The dynamic nature of processes,\naccounting rules, carbon-related policies, and energy supply structures\nnecessitates real-time updates of CFA. Traditional life cycle assessment\nmethods rely heavily on human expertise, making near-real-time updates\nchallenging. This paper introduces a novel approach integrating large language\nmodels (LLMs) with retrieval-augmented generation technology to enhance the\nreal-time, professional, and economical aspects of carbon footprint information\nretrieval and analysis. By leveraging LLMs' logical and language understanding\nabilities and RAG's efficient retrieval capabilities, the proposed method\nLLMs-RAG-CFA can retrieve more relevant professional information to assist\nLLMs, enhancing the model's generative abilities. This method offers broad\nprofessional coverage, efficient real-time carbon footprint information\nacquisition and accounting, and cost-effective automation without frequent\nLLMs' parameter updates. Experimental results across five industries(primary\naluminum, lithium battery, photovoltaic, new energy vehicles, and\ntransformers)demonstrate that the LLMs-RAG-CFA method outperforms traditional\nmethods and other LLMs, achieving higher information retrieval rates and\nsignificantly lower information deviations and carbon footprint accounting\ndeviations. The economically viable design utilizes RAG technology to balance\nreal-time updates with cost-effectiveness, providing an efficient, reliable,\nand cost-saving solution for real-time carbon emission management, thereby\nenhancing environmental sustainability practices.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}