{"id":"2408.03010","title":"Fact Finder -- Enhancing Domain Expertise of Large Language Models by\n  Incorporating Knowledge Graphs","authors":"Daniel Steinigen, Roman Teucher, Timm Heine Ruland, Max Rudat, Nicolas\n  Flores-Herr, Peter Fischer, Nikola Milosevic, Christopher Schymura, Angelo\n  Ziletti","authorsParsed":[["Steinigen","Daniel",""],["Teucher","Roman",""],["Ruland","Timm Heine",""],["Rudat","Max",""],["Flores-Herr","Nicolas",""],["Fischer","Peter",""],["Milosevic","Nikola",""],["Schymura","Christopher",""],["Ziletti","Angelo",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 07:45:05 GMT"}],"updateDate":"2024-08-07","timestamp":1722930305000,"abstract":"  Recent advancements in Large Language Models (LLMs) have showcased their\nproficiency in answering natural language queries. However, their effectiveness\nis hindered by limited domain-specific knowledge, raising concerns about the\nreliability of their responses. We introduce a hybrid system that augments LLMs\nwith domain-specific knowledge graphs (KGs), thereby aiming to enhance factual\ncorrectness using a KG-based retrieval approach. We focus on a medical KG to\ndemonstrate our methodology, which includes (1) pre-processing, (2) Cypher\nquery generation, (3) Cypher query processing, (4) KG retrieval, and (5)\nLLM-enhanced response generation. We evaluate our system on a curated dataset\nof 69 samples, achieving a precision of 78\\% in retrieving correct KG nodes.\nOur findings indicate that the hybrid system surpasses a standalone LLM in\naccuracy and completeness, as verified by an LLM-as-a-Judge evaluation method.\nThis positions the system as a promising tool for applications that demand\nfactual correctness and completeness, such as target identification -- a\ncritical process in pinpointing biological entities for disease treatment or\ncrop enhancement. Moreover, its intuitive search interface and ability to\nprovide accurate responses within seconds make it well-suited for\ntime-sensitive, precision-focused research contexts. We publish the source code\ntogether with the dataset and the prompt templates used.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cQlWVcz0TReXCYRIaof191Qw8R4jn93837aDTPH1cbs","pdfSize":"3585565"}
