{"id":"2408.00480","title":"Enhance the Detection of DoS and Brute Force Attacks within the MQTT\n  Environment through Feature Engineering and Employing an Ensemble Technique","authors":"Abdulelah Al Hanif and Mohammad Ilyas","authorsParsed":[["Hanif","Abdulelah Al",""],["Ilyas","Mohammad",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 11:36:05 GMT"}],"updateDate":"2024-08-02","timestamp":1722512165000,"abstract":"  The rapid development of the Internet of Things (IoT) environment has\nintroduced unprecedented levels of connectivity and automation. The Message\nQueuing Telemetry Transport (MQTT) protocol has become recognized in IoT\napplications due to its lightweight and efficient features; however, this\nsimplicity also renders MQTT vulnerable to multiple attacks that can be\nlaunched against the protocol, including denial of service (DoS) and\nbrute-force attacks. This study aims to improve the detection of intrusion DoS\nand brute-force attacks in an MQTT traffic intrusion detection system (IDS).\nOur approach utilizes the MQTT dataset for model training by employing\neffective feature engineering and ensemble learning techniques. Following our\nanalysis and comparison, we identified the top 10 features demonstrating the\nhighest effectiveness, leading to improved model accuracy. We used supervised\nmachine learning models, including Random Forest, Decision Trees, k-Nearest\nNeighbors, and XGBoost, in combination with ensemble classifiers. Stacking,\nvoting, and bagging ensembles utilize these four supervised machine-learning\nmethods to combine models. This study's results illustrate the proposed\ntechnique's efficacy in enhancing the accuracy of detecting DoS and brute-force\nattacks in MQTT traffic. Stacking and voting classifiers achieved the highest\naccuracy of 0.9538. Our approach outperforms the most recent study that\nutilized the same dataset.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jChr_dwDCyANIzXCgDoVB2QEePjqC0FvqlSLuF6-0b0","pdfSize":"475412"}
