{"id":"2408.06629","title":"Fast Information Streaming Handler (FisH): A Unified Seismic Neural\n  Network for Single Station Real-Time Earthquake Early Warning","authors":"Tianning Zhang, Feng Liu, Yuming Yuan, Rui Su, Wanli Ouyang, and Lei\n  Bai","authorsParsed":[["Zhang","Tianning",""],["Liu","Feng",""],["Yuan","Yuming",""],["Su","Rui",""],["Ouyang","Wanli",""],["Bai","Lei",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 04:33:23 GMT"}],"updateDate":"2024-08-14","timestamp":1723523603000,"abstract":"  Existing EEW approaches often treat phase picking, location estimation, and\nmagnitude estimation as separate tasks, lacking a unified framework.\nAdditionally, most deep learning models in seismology rely on full\nthree-component waveforms and are not suitable for real-time streaming data. To\naddress these limitations, we propose a novel unified seismic neural network\ncalled Fast Information Streaming Handler (FisH). FisH is designed to process\nreal-time streaming seismic data and generate simultaneous results for phase\npicking, location estimation, and magnitude estimation in an end-to-end\nfashion. By integrating these tasks within a single model, FisH simplifies the\noverall process and leverages the nonlinear relationships between tasks for\nimproved performance. The FisH model utilizes RetNet as its backbone, enabling\nparallel processing during training and recurrent handling during inference.\nThis capability makes FisH suitable for real-time applications, reducing\nlatency in EEW systems. Extensive experiments conducted on the STEAD benchmark\ndataset provide strong validation for the effectiveness of our proposed FisH\nmodel. The results demonstrate that FisH achieves impressive performance across\nmultiple seismic event detection and characterization tasks. Specifically, it\nachieves an F1 score of 0.99/0.96. Also, FisH demonstrates precise earthquake\nlocation estimation, with location error of only 6.0km, a distance error of\n2.6km, and a back-azimuth error of 19{\\deg}. The model also exhibits accurate\nearthquake magnitude estimation, with a magnitude error of just 0.14.\nAdditionally, FisH is capable of generating real-time estimations, providing\nlocation and magnitude estimations with a location error of 8.06km and a\nmagnitude error of 0.18 within a mere 3 seconds after the P-wave arrives.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uzOgX2EEj6S4vAUk4URkkPc0hBdxl-eiMoL027n4OZQ","pdfSize":"3007313"}
