{"id":"2408.01392","title":"MoonLITE: a CLPS-delivered NASA Astrophysics Pioneers lunar optical\n  interferometer for sensitive, milliarcsecond observing","authors":"Gerard T. van Belle, David Ciardi, Daniel Hillsberry, Anders\n  Jorgensen, John Monnier, Krista Lynne Smith, Tabetha Boyajian, Kenneth\n  Carpenter, Catherine Clark, Gioia Rau, and Gail Schaefer","authorsParsed":[["van Belle","Gerard T.",""],["Ciardi","David",""],["Hillsberry","Daniel",""],["Jorgensen","Anders",""],["Monnier","John",""],["Smith","Krista Lynne",""],["Boyajian","Tabetha",""],["Carpenter","Kenneth",""],["Clark","Catherine",""],["Rau","Gioia",""],["Schaefer","Gail",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 17:07:04 GMT"}],"updateDate":"2024-08-05","timestamp":1722618424000,"abstract":"  MoonLITE (Lunar InTerferometry Explorer) is an Astrophysics Pioneers proposal\nto develop, build, fly, and operate the first separated-aperture optical\ninterferometer in space, delivering sub-mas science results. MoonLITE will\nleverage the Pioneers opportunity for utilizing NASA's Commercial Lunar Payload\nServices (CLPS) to deliver an optical interferometer to the lunar surface,\nenabling unprecedented discovery power by combining high spatial resolution\nfrom optical interferometry with deep sensitivity from the stability of the\nlunar surface. Following landing, the CLPS-provided rover will deploy the\npre-loaded MoonLITE outboard optical telescope 100 meters from the lander's\ninboard telescope, establishing a two-element interferometric observatory with\na single deployment. MoonLITE will observe targets as faint as 17th magnitude\nin the visible, exceeding ground-based interferometric sensitivity by many\nmagnitudes, and surpassing space-based optical systems resolution by a factor\nof 50 times. The capabilities of MoonLITE open a unique discovery space that\nincludes direct size measurements of the smallest, coolest stars and substellar\nbrown dwarfs; searches for close-in stellar companions orbiting\nexoplanet-hosting stars that could confound our understanding and\ncharacterization of the frequency of Earth-like planets; direct size\nmeasurements of young stellar objects and characterization of the terrestrial\nplanet-forming regions of these young stars; measurements of the inner regions\nand binary fraction of active galactic nuclei; and a probe of the very nature\nof spacetime foam itself. A portion of the observing time will also be made\navailable to the broader community via a guest observer program. MoonLITE takes\nadvantage of the CLPS opportunity and delivers an unprecedented combination of\nsensitivity and angular resolution at the remarkably affordable cost point of\nPioneers.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}