{"id":"2408.06668","title":"Estimation of material parameter uncertainties using probabilistic and\n  interval approaches","authors":"Thomas Most","authorsParsed":[["Most","Thomas",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 06:40:02 GMT"}],"updateDate":"2024-08-14","timestamp":1723531202000,"abstract":"  Within the calibration of material models, often the numerical results of a\nsimulation model $y$ are compared with the experimental measurements $y^*$.\nUsually, the differences between measurements and simulation are minimized\nusing least squares approaches including global and local optimization\ntechniques. In this paper, the resulting scatter or uncertainty of the\nidentified material parameters p are investigated by assuming the measurement\ncurves as non-deterministic. Based on classical probabilistic approaches as the\nMarkov estimator or the Bayesian updating procedure, the scatter of the\nidentified parameters can be estimated as a multi-variate probability density\nfunction. Both procedures require a sufficient accurate knowledge or estimate\nof the scatter of the measurement points, often modeled by a Gaussian\ncovariance matrix. In this paper, we present a different idea by assuming the\nscatter of the measurements not as correlated random numbers but just as\nindividual intervals with known minimum and maximum values. The corresponding\npossible minimum and maximum values for each input parameter can be obtained\nfor this assumption using a constrained optimization approach. However, the\nidentification of the whole possible parameter domain for the given measurement\nbounds is not straight forward. Therefore, we introduce an efficient\nline-search method, where not only the bounds itself but also the shape of the\nfeasible parameter domain can be identified. This enables the quantification of\nthe interaction and the uniqueness of the input parameters. As a numerical\nexample, we identify the fracture parameters of plain concrete with respect to\na wedge splitting test, where five unknown material parameters could be\nidentified.\n","subjects":["Condensed Matter/Materials Science","Mathematics/Probability","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"j9r7CDfoSGR_-MPMBWPP0VFWrfVK9hnDsquSonpKPs0","pdfSize":"940784"}
