{"id":"2408.13535","title":"Partial entanglement entropy threads in island phase","authors":"Qiang Wen, Mingshuai Xu, Haocheng Zhong","authorsParsed":[["Wen","Qiang",""],["Xu","Mingshuai",""],["Zhong","Haocheng",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 09:27:21 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 11:18:58 GMT"}],"updateDate":"2024-08-28","timestamp":1724491641000,"abstract":"  In the context of AdS/CFT, it was recently proposed that the boundary partial\nentanglement entropy structure can be represented by the so-called partial\nentanglement entropy (PEE) threads in the AdS bulk, which are bulk geodesics\nwith the density determined by the boundary PEE structure\n\\cite{Lin:2023rbd,Lin:2024dho}. In Poincar\\'e AdS space, it was shown that the\nPEE threads cover the AdS space uniformly, such that the number of\nintersections between any bulk surface and the bulk PEE threads is always given\nby the area of the surface divided by 4G.\n  In this paper, we investigate the configurations of PEE threads when the\nboundary state is in island phase. The island phase was studied in the context\nof the holographic Weyl transformed CFT$_2$, which has been shown to capture\nall the main features of AdS/BCFT. Compared with AdS$_3$/CFT$_2$, in island\nphase instead of modifying the distribution of the bulk PEE threads, we should\nreplace the boundary points with the corresponding cutoff spheres. Then the\ntwo-point and four-point functions of twist operators can be reproduced by\nidentifying the bulk homologous surfaces anchored on the corresponding cutoff\nspheres that has the minimal number of intersections with the bulk PEE threads.\nThis gives us a better understanding about the PEE structure in island phase\nand reproduces the island formula for entanglement entropy by allowing\nhomologous surfaces to anchor on any cutoff surfaces. Furthermore, it gives a\ndemonstration for the two basic proposals and a better understanding for the\nentanglement contribution that makes the foundation to compute the balanced\npartial entanglement entropy (BPE) \\cite{Basu:2023wmv} which reproduces the\nentanglement wedge cross-section in island phase.\n","subjects":["Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}