{"id":"2408.15571","title":"Power spectra of Dyson's circular ensembles","authors":"Peter J. Forrester and Nicholas S. Witte","authorsParsed":[["Forrester","Peter J.",""],["Witte","Nicholas S.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 06:56:49 GMT"}],"updateDate":"2024-08-29","timestamp":1724828209000,"abstract":"  The power spectrum is a Fourier series statistic associated with the\ncovariances of the displacement from average positions of the members of an\neigen-sequence. When this eigen-sequence has rotational invariance, as for the\neigen-angles of Dyson's circular ensembles, recent work of Riser and Kanzieper\nhas uncovered an exact identity expressing the power spectrum in terms of the\ngenerating function for the conditioned gap probability of having $k$\neigenvalues in an interval. These authors moreover showed how for the circular\nunitary ensemble integrability properties of the generating function, via a\nparticular Painlev\\'e VI system, imply a computational scheme for the\ncorresponding power spectrum, and allow for the determination of its large $N$\nlimit. In the present work, these results are extended to the case of the\ncircular orthogonal ensemble and circular symplectic ensemble, where the\nintegrability is expressed through four particular Painlev\\'e VI systems for\nfinite $N$, and two Painlev\\'e III$'$ systems for the limit $N\\to\\infty$, and\nalso via corresponding Fredholm determinants. The relation between the limiting\npower spectrum $S_\\infty(\\omega)$, where $\\omega$ denotes the Fourier variable,\nand the limiting generating function for the conditioned gap probabilities is\nparticular direct, involving just a single integration over the gap endpoint in\nthe latter. Interpreting this generating function as the characteristic\nfunction of a counting statistic allows for it to be shown that\n$S_\\infty(\\omega) \\mathop{\\sim} \\limits_{\\omega \\to 0} {1 \\over \\pi \\beta |\n\\omega|}$, where $\\beta$ is the Dyson index.\n","subjects":["Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}