{"id":"2408.16140","title":"SoK: Identifying Limitations and Bridging Gaps of Cybersecurity\n  Capability Maturity Models (CCMMs)","authors":"Lasini Liyanage, Nalin Asanka Gamagedara Arachchilage, Giovanni\n  Russello","authorsParsed":[["Liyanage","Lasini",""],["Arachchilage","Nalin Asanka Gamagedara",""],["Russello","Giovanni",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 21:00:20 GMT"}],"updateDate":"2024-08-30","timestamp":1724878820000,"abstract":"  In the rapidly evolving digital landscape, where organisations are\nincreasingly vulnerable to cybersecurity threats, Cybersecurity Capability\nMaturity Models (CCMMs) emerge as pivotal tools in enhancing organisational\ncybersecurity posture. CCMMs provide a structured framework to guide\norganisations in assessing their current cybersecurity capabilities,\nidentifying critical gaps, and prioritising improvements. However, the full\npotential of CCMMs is often not realised due to inherent limitations within the\nmodels and challenges encountered during their implementation and adoption\nprocesses. These limitations and challenges can significantly hamper the\nefficacy of CCMMs in improving cybersecurity. As a result, organisations remain\nvulnerable to cyber threats as they may fail to identify and address critical\nsecurity gaps, implement necessary improvements or allocate resources\neffectively. To address these limitations and challenges, conducting a thorough\ninvestigation into existing models is essential. Therefore, we conducted a\nSystematic Literature Review (SLR) analysing 43 publications to identify\nexisting CCMMs, their limitations, and the challenges organisations face when\nimplementing and adopting them. By understanding these barriers, we aim to\nexplore avenues for enhancing the efficacy of CCMMs, ensuring they more\neffectively meet the cybersecurity needs of organisational entities.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DOa3oneeGtEFMKCPhXpZQ_HXbGgGB4MZ39bTaEf0qjE","pdfSize":"1460467"}
