{"id":"2408.08360","title":"Dark matter cooling during early matter-domination boosts sub-earth\n  halos","authors":"Avik Banerjee, Debtosh Chowdhury, Arpan Hait, Md Sariful Islam","authorsParsed":[["Banerjee","Avik",""],["Chowdhury","Debtosh",""],["Hait","Arpan",""],["Islam","Md Sariful",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 18:00:07 GMT"}],"updateDate":"2024-08-19","timestamp":1723744807000,"abstract":"  The existence of an early matter-dominated epoch prior to the big bang\nnucleosynthesis may lead to a scenario where the thermal dark matter cools\nfaster than plasma before the radiation dominated era begins. In the\nradiation-dominated epoch, dark matter free-streams after it decouples both\nchemically and kinetically from the plasma. In the presence of an early\nmatter-dominated era, chemical decoupling of the dark matter may succeed by a\npartial kinetic decoupling before reheating ends, depending upon the\ncontributions of different partial wave amplitudes in the elastic scattering\nrate of the dark matter. We show that the s-wave scattering is sufficient to\npartially decouple the dark matter from the plasma, if the entropy injection\nduring the reheating era depends on the bath temperature, while p-wave\nscattering leads to full decoupling in such cosmological backdrop. The\ndecoupling of dark matter before the end of reheating causes an additional\namount of cooling, reducing its free-streaming horizon compared to usual\nradiation-dominated cosmology. The enhanced matter perturbations for scales\nentering the horizon prior to the end of reheating, combined with the reduced\nfree-steaming horizon, increase the number density of sub-earth mass halos.\nResulting boost in the dark matter annihilation signatures could offer an\nintriguing probe to differentiate pre-BBN non-standard cosmological epochs. We\nshow that the free-streaming horizon of the dark matter requires to be smaller\nthan a cut-off to ensure boost in the sub-earth halo populations. As case\nstudies we present two examples: one for a scalar dark matter with s-wave\nelastic scattering and the other one featuring a fermionic dark matter with\np-wave elastic scattering. We identify regions of parameter space in both\nmodels where the dark matter kinetically decouples during reheating, amplifying\nsmall scale structure formation.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}