{"id":"2408.13338","title":"LalaEval: A Holistic Human Evaluation Framework for Domain-Specific\n  Large Language Models","authors":"Chongyan Sun, Ken Lin, Shiwei Wang, Hulong Wu, Chengfei Fu, Zhen Wang","authorsParsed":[["Sun","Chongyan",""],["Lin","Ken",""],["Wang","Shiwei",""],["Wu","Hulong",""],["Fu","Chengfei",""],["Wang","Zhen",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 19:12:45 GMT"}],"updateDate":"2024-08-27","timestamp":1724440365000,"abstract":"  This paper introduces LalaEval, a holistic framework designed for the human\nevaluation of domain-specific large language models (LLMs). LalaEval proposes a\ncomprehensive suite of end-to-end protocols that cover five main components\nincluding domain specification, criteria establishment, benchmark dataset\ncreation, construction of evaluation rubrics, and thorough analysis and\ninterpretation of evaluation outcomes. This initiative aims to fill a crucial\nresearch gap by providing a systematic methodology for conducting standardized\nhuman evaluations within specific domains, a practice that, despite its\nwidespread application, lacks substantial coverage in the literature and human\nevaluation are often criticized to be less reliable due to subjective factors,\nso standardized procedures adapted to the nuanced requirements of specific\ndomains or even individual organizations are in great need. Furthermore, the\npaper demonstrates the framework's application within the logistics industry,\npresenting domain-specific evaluation benchmarks, datasets, and a comparative\nanalysis of LLMs for the logistics domain use, highlighting the framework's\ncapacity to elucidate performance differences and guide model selection and\ndevelopment for domain-specific LLMs. Through real-world deployment, the paper\nunderscores the framework's effectiveness in advancing the field of\ndomain-specific LLM evaluation, thereby contributing significantly to the\nongoing discussion on LLMs' practical utility and performance in\ndomain-specific applications.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ZhPsKxxI2bS2ZWX0sMcyWRN1bpXGDb2mkwR_-AYwM8c","pdfSize":"1286849"}
