{"id":"2408.10060","title":"Facial Wrinkle Segmentation for Cosmetic Dermatology: Pretraining with\n  Texture Map-Based Weak Supervision","authors":"Junho Moon, Haejun Chung, Ikbeom Jang","authorsParsed":[["Moon","Junho",""],["Chung","Haejun",""],["Jang","Ikbeom",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 14:54:12 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 12:39:33 GMT"},{"version":"v3","created":"Fri, 13 Sep 2024 02:33:22 GMT"}],"updateDate":"2024-09-16","timestamp":1724079252000,"abstract":"  Facial wrinkle detection plays a crucial role in cosmetic dermatology.\nPrecise manual segmentation of facial wrinkles is challenging and\ntime-consuming, with inherent subjectivity leading to inconsistent results\namong graders. To address this issue, we propose two solutions. First, we build\nand release the first public facial wrinkle dataset, 'FFHQ-Wrinkle', an\nextension of the NVIDIA FFHQ dataset. It includes 1,000 images with human\nlabels and 50,000 images with automatically generated weak labels. This dataset\ncould serve as a foundation for the research community to develop advanced\nwrinkle detection algorithms. Second, we introduce a simple training strategy\nutilizing texture maps, applicable to various segmentation models, to detect\nwrinkles across the face. Our two-stage training strategy first pretrain models\non a large dataset with weak labels (N=50k), or masked texture maps generated\nthrough computer vision techniques, without human intervention. We then\nfinetune the models using human-labeled data (N=1k), which consists of manually\nlabeled wrinkle masks. The network takes as input a combination of RGB and\nmasked texture map of the image, comprising four channels, in finetuning. We\neffectively combine labels from multiple annotators to minimize subjectivity in\nmanual labeling. Our strategies demonstrate improved segmentation performance\nin facial wrinkle segmentation both quantitatively and visually compared to\nexisting pretraining methods. The dataset is available at\nhttps://github.com/labhai/ffhq-wrinkle-dataset.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}