{"id":"2408.02504","title":"Exploring magnetic and topological complexity in MgMn$_6$Sn$_6$: from\n  frustrated ground states to nontrivial Hall conductivity","authors":"Jyotirmoy Sau, Hrishit Banerjee, Sourabh Saha, Nitesh Kumar, and\n  Manoranjan Kumar","authorsParsed":[["Sau","Jyotirmoy",""],["Banerjee","Hrishit",""],["Saha","Sourabh",""],["Kumar","Nitesh",""],["Kumar","Manoranjan",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 14:30:17 GMT"}],"updateDate":"2024-08-06","timestamp":1722868217000,"abstract":"  We explore the intriguing topological itinerant magnet MgMn$_6$Sn$_6$,\ncharacterized by bilayer kagome Mn layers encasing a hexagonal Sn layer. Using\n\\textit{ab initio} Density functional theory and Dynamical mean-field theory\ncalculations, we uncover the complex electronic properties and many-body\nconfiguration of its magnetic ground state. Mn d-orbital electrons form a\nfrustrated many-body ground state with significant quantum fluctuations,\nresulting in competing antiferromagnetic and ferromagnetic spin exchanges. Our\nband dispersion calculations reveal a mirror symmetry-protected nodal line in\nthe \\textit{k}$_z$ = 0 plane. When spin-orbit coupling (SOC) is introduced, the\ngap is formed along the nodal line lifted due to broken time-reversal symmetry\nwith magnetic ordering, leading to substantial intrinsic Berry curvature. We\nidentify Dirac fermions, van Hove singularities, and flat band near the Fermi\nenergy (\\textit{E}$_F$), with SOC introducing a finite gap at key points. The\nunique proximity of the flat band to \\textit{E}$_F$ suggests potential\ninstabilities. Spin-orbit coupling opens a 20 meV gap at the quadratic touching\npoint between the Dirac and flat band, bestowing a nonzero Z$_2$ invariant.\nThis leads to a significant spin Hall conductivity. Despite the presence of\nlarge incoherent scattering due to electronic interactions, band crossings and\nflat band features persist at finite temperatures. MgMn$_6$Sn$_6$ exhibits\nintriguing topological and magnetic properties, with promising applications in\nspintronics.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"6AbqOotkHqubyMYlRMgnX9nJ6nrPw_OwW2dft6hQpcY","pdfSize":"3409965","txDigest":"4jqGedmDg3MJHkKyMapDKCUrC7Z4mp2ZEk9sTmeUHBVk","endEpoch":"1","status":"CERTIFIED"}
