{"id":"2408.03790","title":"Vision-Language Guidance for LiDAR-based Unsupervised 3D Object\n  Detection","authors":"Christian Fruhwirth-Reisinger, Wei Lin, Du\\v{s}an Mali\\'c, Horst\n  Bischof, Horst Possegger","authorsParsed":[["Fruhwirth-Reisinger","Christian",""],["Lin","Wei",""],["Malić","Dušan",""],["Bischof","Horst",""],["Possegger","Horst",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 14:14:53 GMT"}],"updateDate":"2024-08-08","timestamp":1723040093000,"abstract":"  Accurate 3D object detection in LiDAR point clouds is crucial for autonomous\ndriving systems. To achieve state-of-the-art performance, the supervised\ntraining of detectors requires large amounts of human-annotated data, which is\nexpensive to obtain and restricted to predefined object categories. To mitigate\nmanual labeling efforts, recent unsupervised object detection approaches\ngenerate class-agnostic pseudo-labels for moving objects, subsequently serving\nas supervision signal to bootstrap a detector. Despite promising results, these\napproaches do not provide class labels or generalize well to static objects.\nFurthermore, they are mostly restricted to data containing multiple drives from\nthe same scene or images from a precisely calibrated and synchronized camera\nsetup. To overcome these limitations, we propose a vision-language-guided\nunsupervised 3D detection approach that operates exclusively on LiDAR point\nclouds. We transfer CLIP knowledge to classify point clusters of static and\nmoving objects, which we discover by exploiting the inherent spatio-temporal\ninformation of LiDAR point clouds for clustering, tracking, as well as box and\nlabel refinement. Our approach outperforms state-of-the-art unsupervised 3D\nobject detectors on the Waymo Open Dataset ($+23~\\text{AP}_{3D}$) and Argoverse\n2 ($+7.9~\\text{AP}_{3D}$) and provides class labels not solely based on object\nsize assumptions, marking a significant advancement in the field.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"6YL1am9E-B68z6F1bXGHzZMJEItmMDuBd6rl0AfKlqE","pdfSize":"1409763"}
