{"id":"2408.13085","title":"Map-Free Visual Relocalization Enhanced by Instance Knowledge and Depth\n  Knowledge","authors":"Mingyu Xiao, Runze Chen, Haiyong Luo, Fang Zhao, Juan Wang, Xuepeng Ma","authorsParsed":[["Xiao","Mingyu",""],["Chen","Runze",""],["Luo","Haiyong",""],["Zhao","Fang",""],["Wang","Juan",""],["Ma","Xuepeng",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 14:12:03 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 09:02:33 GMT"},{"version":"v3","created":"Thu, 19 Sep 2024 02:55:48 GMT"}],"updateDate":"2024-09-20","timestamp":1724422323000,"abstract":"  Map-free relocalization technology is crucial for applications in autonomous\nnavigation and augmented reality, but relying on pre-built maps is often\nimpractical. It faces significant challenges due to limitations in matching\nmethods and the inherent lack of scale in monocular images. These issues lead\nto substantial rotational and metric errors and even localization failures in\nreal-world scenarios. Large matching errors significantly impact the overall\nrelocalization process, affecting both rotational and translational accuracy.\nDue to the inherent limitations of the camera itself, recovering the metric\nscale from a single image is crucial, as this significantly impacts the\ntranslation error. To address these challenges, we propose a map-free\nrelocalization method enhanced by instance knowledge and depth knowledge. By\nleveraging instance-based matching information to improve global matching\nresults, our method significantly reduces the possibility of mismatching across\ndifferent objects. The robustness of instance knowledge across the scene helps\nthe feature point matching model focus on relevant regions and enhance matching\naccuracy. Additionally, we use estimated metric depth from a single image to\nreduce metric errors and improve scale recovery accuracy. By integrating\nmethods dedicated to mitigating large translational and rotational errors, our\napproach demonstrates superior performance in map-free relocalization\ntechniques.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}