{"id":"2408.12129","title":"Deep Analysis of Time Series Data for Smart Grid Startup Strategies: A\n  Transformer-LSTM-PSO Model Approach","authors":"Zecheng Zhang","authorsParsed":[["Zhang","Zecheng",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 04:52:02 GMT"}],"updateDate":"2024-08-23","timestamp":1724302322000,"abstract":"  Grid startup, an integral component of the power system, holds strategic\nimportance for ensuring the reliability and efficiency of the electrical grid.\nHowever, current methodologies for in-depth analysis and precise prediction of\ngrid startup scenarios are inadequate. To address these challenges, we propose\na novel method based on the Transformer-LSTM-PSO model. This model uniquely\ncombines the Transformer's self-attention mechanism, LSTM's temporal modeling\ncapabilities, and the parameter tuning features of the particle swarm\noptimization algorithm. It is designed to more effectively capture the complex\ntemporal relationships in grid startup schemes. Our experiments demonstrate\nsignificant improvements, with our model achieving lower RMSE and MAE values\nacross multiple datasets compared to existing benchmarks, particularly in the\nNYISO Electric Market dataset where the RMSE was reduced by approximately 15%\nand the MAE by 20% compared to conventional models. Our main contribution is\nthe development of a Transformer-LSTM-PSO model that significantly enhances the\naccuracy and efficiency of smart grid startup predictions. The application of\nthe Transformer-LSTM-PSO model represents a significant advancement in smart\ngrid predictive analytics, concurrently fostering the development of more\nreliable and intelligent grid management systems.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}