{"id":"2408.14418","title":"MEDSAGE: Enhancing Robustness of Medical Dialogue Summarization to ASR\n  Errors with LLM-generated Synthetic Dialogues","authors":"Kuluhan Binici, Abhinav Ramesh Kashyap, Viktor Schlegel, Andy T. Liu,\n  Vijay Prakash Dwivedi, Thanh-Tung Nguyen, Xiaoxue Gao, Nancy F. Chen, Stefan\n  Winkler","authorsParsed":[["Binici","Kuluhan",""],["Kashyap","Abhinav Ramesh",""],["Schlegel","Viktor",""],["Liu","Andy T.",""],["Dwivedi","Vijay Prakash",""],["Nguyen","Thanh-Tung",""],["Gao","Xiaoxue",""],["Chen","Nancy F.",""],["Winkler","Stefan",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 17:04:00 GMT"},{"version":"v2","created":"Fri, 6 Sep 2024 03:05:29 GMT"}],"updateDate":"2024-09-09","timestamp":1724691840000,"abstract":"  Automatic Speech Recognition (ASR) systems are pivotal in transcribing speech\ninto text, yet the errors they introduce can significantly degrade the\nperformance of downstream tasks like summarization. This issue is particularly\npronounced in clinical dialogue summarization, a low-resource domain where\nsupervised data for fine-tuning is scarce, necessitating the use of ASR models\nas black-box solutions. Employing conventional data augmentation for enhancing\nthe noise robustness of summarization models is not feasible either due to the\nunavailability of sufficient medical dialogue audio recordings and\ncorresponding ASR transcripts. To address this challenge, we propose MEDSAGE,\nan approach for generating synthetic samples for data augmentation using Large\nLanguage Models (LLMs). Specifically, we leverage the in-context learning\ncapabilities of LLMs and instruct them to generate ASR-like errors based on a\nfew available medical dialogue examples with audio recordings. Experimental\nresults show that LLMs can effectively model ASR noise, and incorporating this\nnoisy data into the training process significantly improves the robustness and\naccuracy of medical dialogue summarization systems. This approach addresses the\nchallenges of noisy ASR outputs in critical applications, offering a robust\nsolution to enhance the reliability of clinical dialogue summarization.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}