{"id":"2408.06359","title":"An Adaptive CSI Feedback Model Based on BiLSTM for Massive MIMO-OFDM\n  Systems","authors":"Hongrui Shen, Long Zhao, Kan Zheng, Yuhua Cao, Pingzhi Fan","authorsParsed":[["Shen","Hongrui",""],["Zhao","Long",""],["Zheng","Kan",""],["Cao","Yuhua",""],["Fan","Pingzhi",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 07:07:34 GMT"}],"updateDate":"2024-08-14","timestamp":1721977654000,"abstract":"  Deep learning (DL)-based channel state information (CSI) feedback has the\npotential to improve the recovery accuracy and reduce the feedback overhead in\nmassive multiple-input multiple-output orthogonal frequency division\nmultiplexing (MIMO-OFDM) systems. However, the length of input CSI and the\nnumber of feedback bits should be adjustable in different scenarios, which can\nnot be efficiently achieved by the existing CSI feedback models. Therefore, an\nadaptive bidirectional long short-term memory network (ABLNet) for CSI feedback\nis first designed to process various input CSI lengths, where the number of\nfeedback bits is in proportion to the CSI length. Then, to realize a more\nflexible feedback bit number, a feedback bit control unit (FBCU) module is\nproposed to control the output length of feedback bits. Based on which, a\ntarget feedback performance can be adaptively achieved by a designed bit number\nadjusting (BNA) algorithm. Furthermore, a novel separate training approach is\ndevised to solve the model protection problem that the UE and gNB are from\ndifferent manufacturers. Experiments demonstrate that the proposed ABLNet with\nFBCU can fit for different input CSI lengths and feedback bit numbers; the CSI\nfeedback performance can be stabilized by the BNA algorithm; and the proposed\nseparate training approach can maintain the feedback performance and reduce the\ncomplexity of feedback model.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}