{"id":"2408.05962","title":"HiCCL: A Hierarchical Collective Communication Library","authors":"Mert Hidayetoglu, Simon Garcia de Gonzalo, Elliott Slaughter, Pinku\n  Surana, Wen-mei Hwu, William Gropp, Alex Aiken","authorsParsed":[["Hidayetoglu","Mert",""],["de Gonzalo","Simon Garcia",""],["Slaughter","Elliott",""],["Surana","Pinku",""],["Hwu","Wen-mei",""],["Gropp","William",""],["Aiken","Alex",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 07:26:20 GMT"}],"updateDate":"2024-08-13","timestamp":1723447580000,"abstract":"  HiCCL (Hierarchical Collective Communication Library) addresses the growing\ncomplexity and diversity in high-performance network architectures. As GPU\nsystems have envolved into networks of GPUs with different multilevel\ncommunication hierarchies, optimizing each collective function for a specific\nsystem has become a challenging task. Consequently, many collective libraries\nstruggle to adapt to different hardware and software, especially across systems\nfrom different vendors. HiCCL's library design decouples the collective\ncommunication logic from network-specific optimizations through a compositional\nAPI. The communication logic is composed using multicast, reduction, and fence\nprimitives, which are then factorized for a specified network hieararchy using\nonly point-to-point operations within a level. Finally, striping and pipelining\noptimizations applied as specified for streamlining the execution.\n  Performance evaluation of HiCCL across four different\nmachines$\\unicode{x2014}$two with Nvidia GPUs, one with AMD GPUs, and one with\nIntel GPUs$\\unicode{x2014}$demonstrates an average 17$\\times$ higher throughput\nthan the collectives of highly specialized GPU-aware MPI implementations, and\ncompetitive throughput with those of vendor-specific libraries (NCCL, RCCL, and\nOneCCL), while providing portability across all four machines.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/"}