{"id":"2408.07770","title":"User-Centric Machine Learning for Resource Allocation in MPTCP-Enabled\n  Hybrid LiFi and WiFi Networks","authors":"Han Ji, Declan T. Delaney, Xiping Wu","authorsParsed":[["Ji","Han",""],["Delaney","Declan T.",""],["Wu","Xiping",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 18:46:05 GMT"}],"updateDate":"2024-08-16","timestamp":1723661165000,"abstract":"  As an emerging paradigm of heterogeneous networks (HetNets) towards 6G, the\nhybrid light fidelity (LiFi) and wireless fidelity (WiFi) networks (HLWNets)\nhave potential to explore the complementary advantages of the optical and radio\nspectra. Like other cooperation-native HetNets, HLWNets face a crucial load\nbalancing (LB) problem due to the heterogeneity of access points (APs). The\nexisting literature mostly formulates this problem as joint AP selection and\nresource allocation (RA), presuming that each user equipment (UE) is served by\none AP at a time, under the constraint of the traditional transmission control\nprotocol (TCP). In contrast, multipath TCP (MPTCP), which allows for the\nsimultaneous use of multiple APs, can significantly boost the UE's throughput\nas well as enhancing its network resilience. However, the existing TCP-based LB\nmethods, particularly those aided by machine learning, are not suitable for the\nMPTCP scenario. In this paper, we discuss the challenges when developing\nlearning-aided LB in MPTCP-enabled HLWNets, and propose a novel user-centric\nlearning model to tackle this tricky problem. Unlike the conventional\nnetwork-centric learning methods, the proposed method determines the LB\nsolution for a single target UE, rendering low complexity and high flexibility\nin practical implementations. Results show that the proposed user-centric\napproach can greatly outperform the network-centric learning method. Against\nthe TCP-based LB method such as game theory, the proposed method can increase\nthe throughput of HLWNets by up to 40\\%.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7m9EL6bZ9YiqTF_tK0xl5_p97FC-1MLNmjFm1lH7cVY","pdfSize":"462989"}
