{"id":"2408.00024","title":"Deceptive AI systems that give explanations are more convincing than\n  honest AI systems and can amplify belief in misinformation","authors":"Valdemar Danry, Pat Pataranutaporn, Matthew Groh, Ziv Epstein and\n  Pattie Maes","authorsParsed":[["Danry","Valdemar",""],["Pataranutaporn","Pat",""],["Groh","Matthew",""],["Epstein","Ziv",""],["Maes","Pattie",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 05:39:07 GMT"}],"updateDate":"2024-08-02","timestamp":1722404347000,"abstract":"  Advanced Artificial Intelligence (AI) systems, specifically large language\nmodels (LLMs), have the capability to generate not just misinformation, but\nalso deceptive explanations that can justify and propagate false information\nand erode trust in the truth. We examined the impact of deceptive AI generated\nexplanations on individuals' beliefs in a pre-registered online experiment with\n23,840 observations from 1,192 participants. We found that in addition to being\nmore persuasive than accurate and honest explanations, AI-generated deceptive\nexplanations can significantly amplify belief in false news headlines and\nundermine true ones as compared to AI systems that simply classify the headline\nincorrectly as being true/false. Moreover, our results show that personal\nfactors such as cognitive reflection and trust in AI do not necessarily protect\nindividuals from these effects caused by deceptive AI generated explanations.\nInstead, our results show that the logical validity of AI generated deceptive\nexplanations, that is whether the explanation has a causal effect on the\ntruthfulness of the AI's classification, plays a critical role in countering\ntheir persuasiveness - with logically invalid explanations being deemed less\ncredible. This underscores the importance of teaching logical reasoning and\ncritical thinking skills to identify logically invalid arguments, fostering\ngreater resilience against advanced AI-driven misinformation.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7yiPq4dNA6cK-2CeqorhEdGv2j_2u9YSThgvVak8cwo","pdfSize":"2866921","txDigest":"BMc3eEvxfvvdwrrd5DvTaxtMyt4oNF3HK4zTUTD6Ez7k","endEpoch":"100","status":"CERTIFIED"}
