{"id":"2408.12610","title":"Using a negative spatial auto-correlation index to evaluate and improve\n  intrinsic TagMap's multi-scale visualization capabilities","authors":"Zhiwei Wei and Nai Yang","authorsParsed":[["Wei","Zhiwei",""],["Yang","Nai",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 08:52:27 GMT"}],"updateDate":"2024-08-26","timestamp":1723107147000,"abstract":"  The popularity of tag clouds has sparked significant interest in the\ngeographic research community, leading to the development of map-based\nadaptations known as intrinsic tag maps. However, existing methodologies for\ntag maps primarily focus on tag layout at specific scales, which may result in\nlarge empty areas or close proximity between tags when navigating across\nmultiple scales. This issue arises because initial tag layouts may not ensure\nan even distribution of tags with varying sizes across the region. To address\nthis problem, we incorporate the negative spatial auto-correlation index into\ntag maps to assess the uniformity of tag size distribution. Subsequently, we\nintegrate this index into a TIN-based intrinsic tag map layout approach to\nenhance its ability to support multi-scale visualization. This enhancement\ninvolves iteratively filtering out candidate tags and selecting optimal tags\nthat meet the defined index criteria. Experimental findings from two\nrepresentative areas (the USA and Italy) demonstrate the efficacy of our\napproach in enhancing multi-scale visualization capabilities, albeit with\ntrade-offs in compactness and time efficiency. Specifically, when retaining the\nsame number of tags in the layout, our approach achieves higher compactness but\nrequires more time. Conversely, when reducing the number of tags in the layout,\nour approach exhibits reduced time requirements but lower compactness.\nFurthermore, we discuss the effectiveness of various applied strategies aligned\nwith existing approaches to generate diverse intrinsic tag maps tailored to\nuser preferences. Additional details and resources can be found on our project\nwebsite: https://github.com/TrentonWei/Multi-scale-TagMap.git.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/"}