{"id":"2408.03997","title":"Formation of carbonyl sulfide (OCS) via SH radicals in interstellar\n  CO-rich ice under dense cloud conditions","authors":"Julia C. Santos, Harold Linnartz, Ko-Ju Chuang","authorsParsed":[["Santos","Julia C.",""],["Linnartz","Harold",""],["Chuang","Ko-Ju",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 18:00:02 GMT"}],"updateDate":"2024-08-09","timestamp":1723053602000,"abstract":"  Carbonyl sulfide (OCS) is widely observed in the gas phase towards\nstar-forming regions and was the first of the only two sulfur-bearing species\ndetected in interstellar ices so far. However, the chemical network governing\nits formation is still not fully understood. While the sulfurization of CO and\nthe oxidation of CS are often invoked to form OCS, other mechanisms could have\na significant contribution. In particular, the multistep reaction involving CO\nand SH is a good candidate to forming OCS in dense cloud environments. We aim\nto constrain the viability of the CO + SH route to forming solid OCS in the\ninterstellar medium, in a similar manner as CO + OH is known to produce CO2\nice. This is achieved by conducting a systematic laboratory investigation of\nthe targeted reactions on interstellar ice analogues under dense cloud\nconditions. An ultrahigh vacuum chamber is utilized to simultaneously deposit\nCO, H2S, and atomic H at 10 K. SH radicals produced in situ via hydrogen\nabstraction from H2S react with CO to form OCS. OCS is efficiently formed\nthrough surface reactions involving CO, H2S, and H atoms. The suggested\nunderlying mechanism behind OCS formation is CO + SH -> HSCO followed by HSCO +\nH -> OCS + H2. The OCS yield reduces slowly, but remains significant with\nincreasing CO:H2S mixing ratios (CO:H2S = 1:1, 5:1, 10:1, and 20:1). Our\nexperiments provide unambiguous evidence that OCS can be formed from CO + SH in\nthe presence of H atoms. This route remains efficient for large H2S dilutions\n(5% w.r.t CO), suggesting that it is a viable mechanism in interstellar ices.\nGiven that SH radicals can be created in clouds throughout a wide evolutionary\ntimescale, this mechanism could have a non-negligible contribution to forming\ninterstellar OCS ice.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KyU1XT1FnI8tnLemhP-CJPml4_0eerfJAhYJgbAyfws","pdfSize":"322808"}
