{"id":"2408.14179","title":"Pressure-induced toroidal order in molecular Sn$_2$P$_2$S$_6$\n  ferroelectrics","authors":"Konstantin Z. Rushchanskii, Mykola Medulych, Vitalii Liubachko, Yulian\n  M. Vysochanskii","authorsParsed":[["Rushchanskii","Konstantin Z.",""],["Medulych","Mykola",""],["Liubachko","Vitalii",""],["Vysochanskii","Yulian M.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 11:05:24 GMT"}],"updateDate":"2024-08-27","timestamp":1724670324000,"abstract":"  For the Sn$_2$P$_2$S$_6$ crystalline compound with a rich\ntemperature--pressure phase diagram that contains the ferroelectric phase,\nsemiconductor-to-metal transition, and superconductive state, \\mbox{\\textit{ab\ninitio}} molecular dynamics calculations were performed on a single unit cell\nand on a superstructure using an evolutionary algorithm in combination with\ndensity functional theory calculations to study structural transformations\nresulting from rearrangements in chemical bonds under pressure. The structure\nmodels of the pressure-induced lowest energy phases in the molecular\nSn$_2$P$_2$S$_6$ crystal demonstrate the possibility of space-arranged chains\nor rings of P$_2$S$_6$ molecules. Pressure can break P-P bonds of P$_2$S$_6$\nmolecules, causing one of the phosphorous atoms to displace into the\nsulfur-formed octahedron and providing another phosphorous atom into an\noctahedral coordination with two tin atoms and four sulfur atoms. The results\nof the modeling correlate with the gradual rise of deviation of the pressure\ndependence of the unit cell volume of the Sn$_2$P$_2$S$_6$ structure, as\ndetermined by X-ray diffraction experiments, from the dependence calculated\nwith the Birch-Murnaghan equation of state. It also reveals toroidally ordered\nlocal dipoles in the centrosymmetric phase, which may be related to the\npreviously observed superconductivity in the high-pressure metallic phase of\nSn$_2$P$_2$S$_6$.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}