{"id":"2408.05219","title":"LightPHE: Integrating Partially Homomorphic Encryption into Python with\n  Extensive Cloud Environment Evaluations","authors":"Sefik Ilkin Serengil, Alper Ozpinar","authorsParsed":[["Serengil","Sefik Ilkin",""],["Ozpinar","Alper",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 12:23:31 GMT"}],"updateDate":"2024-08-13","timestamp":1721910211000,"abstract":"  Homomorphic encryption enables computations on encrypted data without\naccessing private keys, enhancing security in cloud environments. Without this\ntechnology, updates need to be performed on-premises or require transmitting\nprivate keys to the cloud, increasing security risks. Fully homomorphic\nencryption (FHE) supports both additive and multiplicative operations on\nciphertexts, while partially homomorphic encryption (PHE) supports either\naddition or multiplication, offering a more efficient and practical solution.\n  This study introduces LightPHE, a lightweight hybrid PHE framework for\nPython, designed to address the lack of existing PHE libraries. LightPHE\nintegrates multiple PHE algorithms with a modular and extensible design,\nensuring robustness and usability for rapid prototyping and secure application\ndevelopment.\n  Cloud-based experiments were conducted on Google Colab (Normal, A100 GPU, L4\nGPU, T4 High RAM, TPU2) and Microsoft Azure Spark to evaluate LightPHE's\nperformance and scalability. Key metrics such as key generation, encryption,\ndecryption, and homomorphic operations were assessed. Results showed LightPHE's\nsuperior performance in high-computation environments like Colab A100 GPU and\nTPU2, while also offering viable options for cost-effective setups like Colab\nNormal and Azure Spark.\n  Comparative analyses demonstrated LightPHE's efficiency and scalability,\nmaking it suitable for various applications. The benchmarks offer insights into\nselecting appropriate cloud environments based on performance needs,\nhighlighting LightPHE's potential to advance homomorphic encryption for secure\nand efficient cloud-based data processing.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"D5Kx6Gz3x2J0xPFtDdEYB2AteX4XWY5xo92syXQLUw0","pdfSize":"1373460"}
