{"id":"2408.04286","title":"Stability Mechanisms of Unconventional Stoichiometric Crystals Exampled\n  by Two-Dimensional Na2Cl on Graphene under Ambient Conditions","authors":"Liuhua Mu, Xuchang Su, Haiping Fang, Lei Zhang","authorsParsed":[["Mu","Liuhua",""],["Su","Xuchang",""],["Fang","Haiping",""],["Zhang","Lei",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 07:51:21 GMT"}],"updateDate":"2024-08-09","timestamp":1723103481000,"abstract":"  Compounds harboring active valence electrons, such as unconventional\nstoichiometric compounds of main group elements including sodium, chlorine, and\ncarbon, have conventionally been perceived as unstable under ambient\nconditions, requiring extreme conditions including extra-high pressure\nenvironments for stability. Recent discoveries challenge this notion,\nshowcasing the ambient stability of two-dimensional Na2Cl and other\nunconventional stoichiometric compounds on reduced graphene oxide (rGO)\nmembranes. Focusing on the Na2Cl crystal as a case study, we reveal a mechanism\nwherein electron delocalization on the aromatic rings of graphene effectively\nmitigates the reactivity of Na2Cl, notably countering oxygen-induced\noxidation--a phenomenon termed the Surface Delocalization-Induced Electron Trap\n(SDIET) mechanism. Theoretical calculations also show a substantial activation\nenergy barrier emerges, impeding oxygen infiltration into and reaction with\nNa2Cl. The remarkable stability was further demonstrated by the experiment that\nNa2Cl crystals on rGO membranes remain almost intact even after prolonged\nexposure to a pure oxygen atmosphere for 9 days. The discovered SDIET mechanism\npresents a significant leap in stabilizing chemically active substances\nharboring active valence electrons under ambient conditions. Its implications\ntranscend unconventional stoichiometric compounds, encompassing main group and\ntransition element compounds, potentially influencing various scientific\ndisciplines.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}