{"id":"2408.07096","title":"OFL-W3: A One-shot Federated Learning System on Web 3.0","authors":"Linshan Jiang, Moming Duan, Bingsheng He, Yulin Sun, Peishen Yan, Yang\n  Hua, Tao Song","authorsParsed":[["Jiang","Linshan",""],["Duan","Moming",""],["He","Bingsheng",""],["Sun","Yulin",""],["Yan","Peishen",""],["Hua","Yang",""],["Song","Tao",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 07:31:12 GMT"}],"updateDate":"2024-08-15","timestamp":1723447872000,"abstract":"  Federated Learning (FL) addresses the challenges posed by data silos, which\narise from privacy, security regulations, and ownership concerns. Despite these\nbarriers, FL enables these isolated data repositories to participate in\ncollaborative learning without compromising privacy or security. Concurrently,\nthe advancement of blockchain technology and decentralized applications (DApps)\nwithin Web 3.0 heralds a new era of transformative possibilities in web\ndevelopment. As such, incorporating FL into Web 3.0 paves the path for\novercoming the limitations of data silos through collaborative learning.\nHowever, given the transaction speed constraints of core blockchains such as\nEthereum (ETH) and the latency in smart contracts, employing one-shot FL, which\nminimizes client-server interactions in traditional FL to a single exchange, is\nconsidered more apt for Web 3.0 environments. This paper presents a practical\none-shot FL system for Web 3.0, termed OFL-W3. OFL-W3 capitalizes on blockchain\ntechnology by utilizing smart contracts for managing transactions. Meanwhile,\nOFL-W3 utilizes the Inter-Planetary File System (IPFS) coupled with Flask\ncommunication, to facilitate backend server operations to use existing one-shot\nFL algorithms. With the integration of the incentive mechanism, OFL-W3\nshowcases an effective implementation of one-shot FL on Web 3.0, offering\nvaluable insights and future directions for AI combined with Web 3.0 studies.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ld0Nii5gxJyq8CCFlD_E6A-7DAh1JNutM9pqMozTbDM","pdfSize":"2099264"}
