{"id":"2408.13844","title":"The long-term influence of a magnetar power in stripped-envelope\n  supernovae. Radiative-transfer modeling of He-star explosions from 1 to 10\n  years","authors":"Luc Dessart","authorsParsed":[["Dessart","Luc",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 14:24:45 GMT"}],"updateDate":"2024-08-27","timestamp":1724595885000,"abstract":"  Much interest surrounds the nature of the compact remnant formed in core\ncollapse supernovae (SNe). One means to constrain its nature is to search for\nsignatures of power injection from the remnant in the SN observables years\nafter explosion. In this work, we conduct a large grid of 1D nonlocal\nthermodynamic equilibrium radiative transfer calculations of He-star explosions\nunder the influence of magnetar-power injection from post-explosion age of\nabout one to ten years. Our results for SN observables vary with He-star mass,\nSN age, injected power, or ejecta clumping. At high mass, the ejecta coolants\nare primarily O and Ne, with [OI]6330A, [OII]7325A, and [OIII]5000A dominating\nin the optical, and with strong [NeII]12.81micron in the infrared -- this line\nmay carry more than half the total SN luminosity. For lower He-star masses, a\ngreater diversity of coolants appear, in particular Fe, S, Ar, or Ni from the\nSi- and Fe-rich regions. All models tend to rise in ionization in time, with\ntwice-ionized species (i.e., OIII, NeIII, SIII, or FeIII) dominating at ~10yr,\nalthough this ionization is significantly reduced if clumping is introduced.\nOur treatment of magnetar power in the form of high-energy electrons or X-ray\nirradiation yields similar results -- no X-rays emerge from our ejecta even at\nten years because of high-optical depth in the keV range. An uncertainty of our\nwork concerns the power deposition profile, which is not known from first\nprinciples, although this profile could be constrained from observations. Our\nmagnetar-powered model he8p00 with moderate clumping yields a good match to the\noptical and near-infrared observations of Type Ib SN2012au at both ~300d (power\nof 1-2x10^41erg/s) and 2269d (power of 10^40erg/s). Unless overly ionized, we\nfind that all massive magnetar-powered ejecta should be infrared luminous at\n5-10yr through strong [NeII]12.81micron line emission.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iS-tzHDk96xFiM0asLJinEWii1smYzfNYbF2IeEM_TM","pdfSize":"12680755"}
