{"id":"2408.16367","title":"Dust mineralogy and variability of the inner PDS 70 disk","authors":"Hyerin Jang, Rens Waters, Till Kaeufer, Akemi Tamanai, Giulia Perotti,\n  Valentin Christiaens, Inga Kamp, Thomas Henning, Michiel Min, Aditya M.\n  Arabhavi, David Barrado, Ewine F. van Dishoeck, Danny Gasman, Sierra L.\n  Grant, Manuel G\\\"udel, Pierre-Olivier Lagage, Fred Lahuis, Kamber Schwarz,\n  Beno\\^it Tabone, Milou Temmink","authorsParsed":[["Jang","Hyerin",""],["Waters","Rens",""],["Kaeufer","Till",""],["Tamanai","Akemi",""],["Perotti","Giulia",""],["Christiaens","Valentin",""],["Kamp","Inga",""],["Henning","Thomas",""],["Min","Michiel",""],["Arabhavi","Aditya M.",""],["Barrado","David",""],["van Dishoeck","Ewine F.",""],["Gasman","Danny",""],["Grant","Sierra L.",""],["Güdel","Manuel",""],["Lagage","Pierre-Olivier",""],["Lahuis","Fred",""],["Schwarz","Kamber",""],["Tabone","Benoît",""],["Temmink","Milou",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 09:25:02 GMT"}],"updateDate":"2024-08-30","timestamp":1724923502000,"abstract":"  The inner disk of the young star PDS 70 may be a site of rocky planet\nformation, with two giant planets detected further out. Solids in the inner\ndisk may inform us about the origin of this inner disk water and nature of the\ndust in the rocky planet-forming regions. We aim to constrain the chemical\ncomposition, lattice structure, and grain sizes of small silicate grains in the\ninner disk of PDS 70, observed both in JWST/MIRI MRS and Spitzer IRS. We use a\ndust fitting model, called DuCK, based on a two-layer disk model. We use\nGaussian Random Field and Distribution of Hollow Spheres models to obtain two\nsets of dust opacities. The third set of opacities is obtained from aerosol\nspectroscopy. We use stoichiometric amorphous silicates, forsterite, and\nenstatite in our analysis. We also used iron-rich and magnesium-rich amorphous\nsilicate and fayalite dust species to study the iron content. The Gaussian\nRandom Field opacity agrees well with the observed spectrum. In both MIRI and\nSpitzer spectra, amorphous silicates are the dominant dust species. Crystalline\nsilicates are dominated by iron-poor olivine. We do not find strong evidence\nfor enstatite. Moreover, the MIRI spectrum indicates larger grain sizes than\nthe Spitzer spectrum, indicating a time-variable small grain reservoir. The\ninner PDS 70 disk is dominated by a variable reservoir of optically thin warm\namorphous silicates. We suggest that the small grains detected in the inner PDS\n70 disk are likely transported inward from the outer disk as a result of\nfiltration and fragmentation at the ice line. In addition, the variation\nbetween MIRI and Spitzer data can be explained by the grain growth over 15\nyears and a dynamical inner disk where opacity changes occur resulting from the\nhighly variable hot innermost dust reservoir.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HamTxhd7GAfe7eLTN2myra85j1P7A4p5rG1r0MAEuKc","pdfSize":"4501242"}
