{"id":"2408.16966","title":"UserSumBench: A Benchmark Framework for Evaluating User Summarization\n  Approaches","authors":"Chao Wang, Neo Wu, Lin Ning, Jiaxing Wu, Luyang Liu, Jun Xie, Shawn\n  O'Banion, Bradley Green","authorsParsed":[["Wang","Chao",""],["Wu","Neo",""],["Ning","Lin",""],["Wu","Jiaxing",""],["Liu","Luyang",""],["Xie","Jun",""],["O'Banion","Shawn",""],["Green","Bradley",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 01:56:57 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 23:18:00 GMT"}],"updateDate":"2024-09-09","timestamp":1724983017000,"abstract":"  Large language models (LLMs) have shown remarkable capabilities in generating\nuser summaries from a long list of raw user activity data. These summaries\ncapture essential user information such as preferences and interests, and\ntherefore are invaluable for LLM-based personalization applications, such as\nexplainable recommender systems. However, the development of new summarization\ntechniques is hindered by the lack of ground-truth labels, the inherent\nsubjectivity of user summaries, and human evaluation which is often costly and\ntime-consuming. To address these challenges, we introduce \\UserSumBench, a\nbenchmark framework designed to facilitate iterative development of LLM-based\nsummarization approaches. This framework offers two key components: (1) A\nreference-free summary quality metric. We show that this metric is effective\nand aligned with human preferences across three diverse datasets (MovieLens,\nYelp and Amazon Review). (2) A novel robust summarization method that leverages\ntime-hierarchical summarizer and self-critique verifier to produce high-quality\nsummaries while eliminating hallucination. This method serves as a strong\nbaseline for further innovation in summarization techniques.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}