{"id":"2408.00374","title":"Conformal Trajectory Prediction with Multi-View Data Integration in\n  Cooperative Driving","authors":"Xi Chen, Rahul Bhadani, Larry Head","authorsParsed":[["Chen","Xi",""],["Bhadani","Rahul",""],["Head","Larry",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 08:32:03 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 13:00:46 GMT"}],"updateDate":"2024-08-05","timestamp":1722501123000,"abstract":"  Current research on trajectory prediction primarily relies on data collected\nby onboard sensors of an ego vehicle. With the rapid advancement in connected\ntechnologies, such as vehicle-to-vehicle (V2V) and vehicle-to-infrastructure\n(V2I) communication, valuable information from alternate views becomes\naccessible via wireless networks. The integration of information from\nalternative views has the potential to overcome the inherent limitations\nassociated with a single viewpoint, such as occlusions and limited field of\nview. In this work, we introduce V2INet, a novel trajectory prediction\nframework designed to model multi-view data by extending existing single-view\nmodels. Unlike previous approaches where the multi-view data is manually fused\nor formulated as a separate training stage, our model supports end-to-end\ntraining, enhancing both flexibility and performance. Moreover, the predicted\nmultimodal trajectories are calibrated by a post-hoc conformal prediction\nmodule to get valid and efficient confidence regions. We evaluated the entire\nframework using the real-world V2I dataset V2X-Seq. Our results demonstrate\nsuperior performance in terms of Final Displacement Error (FDE) and Miss Rate\n(MR) using a single GPU. The code is publicly available at:\n\\url{https://github.com/xichennn/V2I_trajectory_prediction}.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SWnWbc19eQxno45qoPRWcjPglwoKJzH9wKtBduXWQ5Y","pdfSize":"14397466","txDigest":"5e238qSGDta6PKTBf8QmS9sp7KK6vueVnQkABJpaYZVY","endEpoch":"1","status":"CERTIFIED"}
