{"id":"2408.02986","title":"Structural evolution of international crop trade networks","authors":"Yin-Ting Zhang, Wei-Xing Zhou","authorsParsed":[["Zhang","Yin-Ting",""],["Zhou","Wei-Xing",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 06:42:38 GMT"}],"updateDate":"2024-08-07","timestamp":1722926558000,"abstract":"  Food security is a critical issue closely linked to human being. With the\nincreasing demand for food, international trade has become the main access to\nsupplementing domestic food shortages, which not only alleviates local food\nshocks, but also exposes economies to global food crises. In this paper, we\nconstruct four temporal international crop trade networks (iCTNs) based on\ntrade values of maize, rice, soybean and wheat, and describe the structural\nevolution of different iCTNs from{ {1993}} to 2018. We find that the size of\nall the four iCTNs expanded from{ {1993}} to 2018 with more participants and\nlarger trade values. Our results show that the iCTNs not only become tighter\naccording to the increasing in network density and clustering coefficient, but\nalso get more similar. We also find that the iCTNs are not always\ndisassortative, unlike the world cereal trade networks and other international\ncommodity trade networks. The degree assortative coefficients depend on degree\ndirections and crop types. The analysis about assortativity also indicates that\neconomies with high out-degrees tend to connect with economies with low\nin-degrees and low out-degrees. Additionally, we compare the structure of the\nfour iCTNs to enhance our understanding of the international food trade system.\nAlthough the overall evolutionary patterns of different iCTNs are similar, some\ncrops exhibit idiosyncratic trade patterns. It highlights the need to consider\ndifferent crop networks' idiosyncratic features while making food policies. Our\nfindings about the dynamics of the iCTNs play an important role in\nunderstanding vulnerabilities in the global food system.\n","subjects":["Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}