{"id":"2408.06526","title":"Operator Learning Using Random Features: A Tool for Scientific Computing","authors":"Nicholas H. Nelsen, Andrew M. Stuart","authorsParsed":[["Nelsen","Nicholas H.",""],["Stuart","Andrew M.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 23:10:39 GMT"}],"updateDate":"2024-08-14","timestamp":1723504239000,"abstract":"  Supervised operator learning centers on the use of training data, in the form\nof input-output pairs, to estimate maps between infinite-dimensional spaces. It\nis emerging as a powerful tool to complement traditional scientific computing,\nwhich may often be framed in terms of operators mapping between spaces of\nfunctions. Building on the classical random features methodology for scalar\nregression, this paper introduces the function-valued random features method.\nThis leads to a supervised operator learning architecture that is practical for\nnonlinear problems yet is structured enough to facilitate efficient training\nthrough the optimization of a convex, quadratic cost. Due to the quadratic\nstructure, the trained model is equipped with convergence guarantees and error\nand complexity bounds, properties that are not readily available for most other\noperator learning architectures. At its core, the proposed approach builds a\nlinear combination of random operators. This turns out to be a low-rank\napproximation of an operator-valued kernel ridge regression algorithm, and\nhence the method also has strong connections to Gaussian process regression.\nThe paper designs function-valued random features that are tailored to the\nstructure of two nonlinear operator learning benchmark problems arising from\nparametric partial differential equations. Numerical results demonstrate the\nscalability, discretization invariance, and transferability of the\nfunction-valued random features method.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}