{"id":"2408.15328","title":"Artificially intelligent Maxwell's demon for optimal control of open\n  quantum systems","authors":"Paolo Andrea Erdman, Robert Czupryniak, Bibek Bhandari, Andrew N.\n  Jordan, Frank No\\'e, Jens Eisert, Giacomo Guarnieri","authorsParsed":[["Erdman","Paolo Andrea",""],["Czupryniak","Robert",""],["Bhandari","Bibek",""],["Jordan","Andrew N.",""],["Noé","Frank",""],["Eisert","Jens",""],["Guarnieri","Giacomo",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 18:00:02 GMT"}],"updateDate":"2024-08-29","timestamp":1724781602000,"abstract":"  Feedback control of open quantum systems is of fundamental importance for\npractical applications in various contexts, ranging from quantum computation to\nquantum error correction and quantum metrology. Its use in the context of\nthermodynamics further enables the study of the interplay between information\nand energy. However, deriving optimal feedback control strategies is highly\nchallenging, as it involves the optimal control of open quantum systems, the\nstochastic nature of quantum measurement, and the inclusion of policies that\nmaximize a long-term time- and trajectory-averaged goal. In this work, we\nemploy a reinforcement learning approach to automate and capture the role of a\nquantum Maxwell's demon: the agent takes the literal role of discovering\noptimal feedback control strategies in qubit-based systems that maximize a\ntrade-off between measurement-powered cooling and measurement efficiency.\nConsidering weak or projective quantum measurements, we explore different\nregimes based on the ordering between the thermalization, the measurement, and\nthe unitary feedback timescales, finding different and highly non-intuitive,\nyet interpretable, strategies. In the thermalization-dominated regime, we find\nstrategies with elaborate finite-time thermalization protocols conditioned on\nmeasurement outcomes. In the measurement-dominated regime, we find that optimal\nstrategies involve adaptively measuring different qubit observables reflecting\nthe acquired information, and repeating multiple weak measurements until the\nquantum state is \"sufficiently pure\", leading to random walks in state space.\nFinally, we study the case when all timescales are comparable, finding new\nfeedback control strategies that considerably outperform more intuitive ones.\nWe discuss a two-qubit example where we explore the role of entanglement and\nconclude discussing the scaling of our results to quantum many-body systems.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HS-LVJ9ZiXspZkCfFwhMPAqMKtruM4Ndhy79Fx3TOJo","pdfSize":"2115776"}
