{"id":"2408.15555","title":"Latent Relationship Mining of Glaucoma Biomarkers: a TRI-LSTM based Deep\n  Learning","authors":"Cheng Huang, Junhao Shen, Qiuyu Luo, Karanjit Kooner, Tsengdar Lee,\n  Yishen Liu, Jia Zhang","authorsParsed":[["Huang","Cheng",""],["Shen","Junhao",""],["Luo","Qiuyu",""],["Kooner","Karanjit",""],["Lee","Tsengdar",""],["Liu","Yishen",""],["Zhang","Jia",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 06:08:46 GMT"}],"updateDate":"2024-08-29","timestamp":1724825326000,"abstract":"  In recently years, a significant amount of research has been conducted on\napplying deep learning methods for glaucoma classification and detection.\nHowever, the explainability of those established machine learning models\nremains a big concern. In this research, in contrast, we learn from cognitive\nscience concept and study how ophthalmologists judge glaucoma detection.\nSimulating experts' efforts, we propose a hierarchical decision making system,\ncentered around a holistic set of carefully designed biomarker-oriented machine\nlearning models. While biomarkers represent the key indicators of how\nophthalmologists identify glaucoma, they usually exhibit latent\ninter-relations. We thus construct a time series model, named TRI-LSTM, capable\nof calculating and uncovering potential and latent relationships among various\nbiomarkers of glaucoma. Our model is among the first efforts to explore the\nintrinsic connections among glaucoma biomarkers. We monitor temporal\nrelationships in patients' disease states over time and to capture and retain\nthe progression of disease-relevant clinical information from prior visits,\nthereby enriching biomarker's potential relationships. Extensive experiments\nover real-world dataset have demonstrated the effectiveness of the proposed\nmodel.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wnuZhEbuAki-AdHlSG63phnCDRllZHFqj7bmOL-EUik","pdfSize":"4503016"}
