{"id":"2408.05104","title":"Generalised rank-constrained approximations of Hilbert-Schmidt operators\n  on separable Hilbert spaces and applications","authors":"Giuseppe Carere, Han Cheng Lie","authorsParsed":[["Carere","Giuseppe",""],["Lie","Han Cheng",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 14:53:12 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 07:37:16 GMT"}],"updateDate":"2024-08-23","timestamp":1723215192000,"abstract":"  In this work we solve, for given bounded operators $B,C$ and Hilbert--Schmidt\noperator $M$ acting on potentially infinite-dimensional separable Hilbert\nspaces, the reduced rank approximation problem,\n$\\text{min}\\{\\Vert{M-BXC}\\Vert_{HS}:\\ \\text{dim}\\ \\text{ran}(X)\\leq r\\}$. This\nextends the result of Sondermann (Statistische Hefte, 1986) and Friedland and\nTorokhti (SIAM J. Matrix Analysis and Applications, 2007), which studies this\nproblem in the case of matrices $M$, $B$, $C$, $X$, and the analysis involves\nthe Moore-Penrose inverse. In classical approximation problems that can be\nsolved by the singular value decomposition or Moore--Penrose inverse, the\nsolution satisfies a minimal norm property. Friedland and Torokhti also state\nsuch a minimal norm property of the solution. However, we show that this\nminimal norm property does not hold in general and give a modified minimality\nproperty that is satisfied in general. We also show that the solution may be\ndiscontinuous in infinite-dimensional settings. Necessary and sufficient\nconditions for continuity of the solutions are given and continuous\napproximations are constructed when such conditions are not met. Finally, we\nstudy problems from signal processing, reduced rank regression and linear\noperator learning under a rank constraint. We show that our theoretical results\nenable us to explicitly find the solutions to these problems and to fully\ncharacterise their existence, uniqueness and minimality property.\n","subjects":["Mathematics/Functional Analysis","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}