{"id":"2408.14415","title":"LoG-VMamba: Local-Global Vision Mamba for Medical Image Segmentation","authors":"Trung Dinh Quoc Dang, Huy Hoang Nguyen, Aleksei Tiulpin","authorsParsed":[["Dang","Trung Dinh Quoc",""],["Nguyen","Huy Hoang",""],["Tiulpin","Aleksei",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 17:02:25 GMT"}],"updateDate":"2024-08-27","timestamp":1724691745000,"abstract":"  Mamba, a State Space Model (SSM), has recently shown competitive performance\nto Convolutional Neural Networks (CNNs) and Transformers in Natural Language\nProcessing and general sequence modeling. Various attempts have been made to\nadapt Mamba to Computer Vision tasks, including medical image segmentation\n(MIS). Vision Mamba (VM)-based networks are particularly attractive due to\ntheir ability to achieve global receptive fields, similar to Vision\nTransformers, while also maintaining linear complexity in the number of tokens.\nHowever, the existing VM models still struggle to maintain both spatially local\nand global dependencies of tokens in high dimensional arrays due to their\nsequential nature. Employing multiple and/or complicated scanning strategies is\ncomputationally costly, which hinders applications of SSMs to high-dimensional\n2D and 3D images that are common in MIS problems. In this work, we propose\nLocal-Global Vision Mamba, LoG-VMamba, that explicitly enforces spatially\nadjacent tokens to remain nearby on the channel axis, and retains the global\ncontext in a compressed form. Our method allows the SSMs to access the local\nand global contexts even before reaching the last token while requiring only a\nsimple scanning strategy. Our segmentation models are computationally efficient\nand substantially outperform both CNN and Transformers-based baselines on a\ndiverse set of 2D and 3D MIS tasks. The implementation of LoG-VMamba is\navailable at \\url{https://github.com/Oulu-IMEDS/LoG-VMamba}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}