{"id":"2408.11948","title":"Topological Representational Similarity Analysis in Brains and Beyond","authors":"Baihan Lin","authorsParsed":[["Lin","Baihan",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 19:02:00 GMT"}],"updateDate":"2024-08-23","timestamp":1724266920000,"abstract":"  Understanding how the brain represents and processes information is crucial\nfor advancing neuroscience and artificial intelligence. Representational\nsimilarity analysis (RSA) has been instrumental in characterizing neural\nrepresentations, but traditional RSA relies solely on geometric properties,\noverlooking crucial topological information. This thesis introduces Topological\nRSA (tRSA), a novel framework combining geometric and topological properties of\nneural representations.\n  tRSA applies nonlinear monotonic transforms to representational\ndissimilarities, emphasizing local topology while retaining intermediate-scale\ngeometry. The resulting geo-topological matrices enable model comparisons\nrobust to noise and individual idiosyncrasies. This thesis introduces several\nkey methodological advances: (1) Topological RSA (tRSA) for identifying\ncomputational signatures and testing topological hypotheses; (2) Adaptive\nGeo-Topological Dependence Measure (AGTDM) for detecting complex multivariate\nrelationships; (3) Procrustes-aligned Multidimensional Scaling (pMDS) for\nrevealing neural computation stages; (4) Temporal Topological Data Analysis\n(tTDA) for uncovering developmental trajectories; and (5) Single-cell\nTopological Simplicial Analysis (scTSA) for characterizing cell population\ncomplexity.\n  Through analyses of neural recordings, biological data, and neural network\nsimulations, this thesis demonstrates the power and versatility of these\nmethods in understanding brains, computational models, and complex biological\nsystems. They not only offer robust approaches for adjudicating among competing\nmodels but also reveal novel theoretical insights into the nature of neural\ncomputation. This work lays the foundation for future investigations at the\nintersection of topology, neuroscience, and time series analysis, paving the\nway for more nuanced understanding of brain function and dysfunction.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Machine Learning","Mathematics/Geometric Topology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}