{"id":"2408.11472","title":"High Performance Simulation of Spaceborne Radar for Remote-Sensing\n  Oceanography: Application to an Altimetry Scenario","authors":"Goulven Monnier, Benjamin Camus, Yann-Herv\\'e Hellouvry","authorsParsed":[["Monnier","Goulven",""],["Camus","Benjamin",""],["Hellouvry","Yann-Hervé",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 09:39:14 GMT"}],"updateDate":"2024-08-22","timestamp":1724233154000,"abstract":"  In this paper, we detail the high-performance implementation of our\nspaceborne radar simulator for satellite oceanography. Our software simulates\nthe sea surface and the signal to imitate, as far as possible, the measurement\nprocess, starting from its lowest level mechanisms. In this perspective, raw\ndata are computed as the sum of many illuminated scatterers, whose\ntime-evolving properties are related to the surface roughness, topography, and\nkinematics. To achieve efficient performance, we intensively use GPU computing.\nMoreover, we propose a fast simulation mode based on the assumption that the\ninstantaneous Doppler spectrum within a range gate varies on a timescale\nsignificantly larger than the PRI. The sea surface can then be updated at a\nfrequency much smaller than the PRF, drastically reducing the computational\ncost. When the surface is updated, Doppler spectra are computed for all range\ngates. Signals segments are then obtained through 1D inverse Fourier transforms\nand pondered to ensure a smooth time evolution between surface updates. We\nvalidate this fast simulation mode with a radar altimeter simulation case of\nthe Sentinel-3 SRAL instrument, showing that simulated raw data can be focused\nand retrieved using state-of-the-art algorithms. Finally, we show that, using a\nmodest hardware configuration, our simulator can generate enough data in one\nday to compute the SWH and SSH spectra of a scene. This demonstrate that we\nachieved an important state-of-the-art speed-up.\n","subjects":["Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}