{"id":"2408.14663","title":"Optically Resolved Exchange Splittings in the Doped Van der Waals\n  Ferromagnet CrBr3:Yb3+","authors":"Thom J. Snoeren, Kimo Pressler, Daniel R. Gamelin","authorsParsed":[["Snoeren","Thom J.",""],["Pressler","Kimo",""],["Gamelin","Daniel R.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 22:07:12 GMT"}],"updateDate":"2024-08-28","timestamp":1724710032000,"abstract":"  The chromium-trihalides (CrX3; X = Cl, Br, I) have long served as model\nsystems for understanding magnetism and magneto-optics in ionic crystals, and\nthey have recently also emerged as archetypes of magnetic two-dimensional (2D)\nVan der Waals materials. Although the physical properties of CrX3 compounds\nhave now been explored in great depth, the use of impurity doping to generate\nnew properties remains surprisingly underexplored. Here we report on the\nmagnetic and magneto-optical properties of lanthanide-doped CrBr3, in which\nYb3+ is introduced as a spin-bearing optical point defect. Narrow-line\nnear-infrared dopant photoluminescence is efficiently sensitized by\nCrBr3-to-Yb3+ energy transfer. Magneto-optical measurements show facile spin\nmanipulation of the paramagnetic Yb3+ impurities by the surrounding CrBr3\nlattice. Photoluminescence data reveal that the Kramers spin degeneracies of\nthe ground- and excited-state Yb3+ doublets are spontaneously lifted by strong\nmagnetic exchange with neighboring Cr3+ ions, such that individual Yb3+ spin\ntransitions are easily resolved even at zero external magnetic field. The\ntemperature and field dependence of these splittings can be used to probe both\nlocal and long-range spin correlations. These results highlight the use of\nextrinsic optical impurities to add new spin-photonic functionality to this\nclassic 2D Van der Waals magnet.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yeQ0bTIWQKLGWvxVKxGOQKk4t7MKLpvFXk1Med1Y0EU","pdfSize":"5609186"}
