{"id":"2408.04775","title":"Hybrid Student-Teacher Large Language Model Refinement for Cancer\n  Toxicity Symptom Extraction","authors":"Reza Khanmohammadi, Ahmed I. Ghanem, Kyle Verdecchia, Ryan Hall,\n  Mohamed Elshaikh, Benjamin Movsas, Hassan Bagher-Ebadian, Bing Luo, Indrin J.\n  Chetty, Tuka Alhanai, Kundan Thind, and Mohammad M. Ghassemi","authorsParsed":[["Khanmohammadi","Reza",""],["Ghanem","Ahmed I.",""],["Verdecchia","Kyle",""],["Hall","Ryan",""],["Elshaikh","Mohamed",""],["Movsas","Benjamin",""],["Bagher-Ebadian","Hassan",""],["Luo","Bing",""],["Chetty","Indrin J.",""],["Alhanai","Tuka",""],["Thind","Kundan",""],["Ghassemi","Mohammad M.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 22:18:01 GMT"}],"updateDate":"2024-08-12","timestamp":1723155481000,"abstract":"  Large Language Models (LLMs) offer significant potential for clinical symptom\nextraction, but their deployment in healthcare settings is constrained by\nprivacy concerns, computational limitations, and operational costs. This study\ninvestigates the optimization of compact LLMs for cancer toxicity symptom\nextraction using a novel iterative refinement approach. We employ a\nstudent-teacher architecture, utilizing Zephyr-7b-beta and Phi3-mini-128 as\nstudent models and GPT-4o as the teacher, to dynamically select between prompt\nrefinement, Retrieval-Augmented Generation (RAG), and fine-tuning strategies.\nOur experiments on 294 clinical notes covering 12 post-radiotherapy toxicity\nsymptoms demonstrate the effectiveness of this approach. The RAG method proved\nmost efficient, improving average accuracy scores from 0.32 to 0.73 for\nZephyr-7b-beta and from 0.40 to 0.87 for Phi3-mini-128 during refinement. In\nthe test set, both models showed an approximate 0.20 increase in accuracy\nacross symptoms. Notably, this improvement was achieved at a cost 45 times\nlower than GPT-4o for Zephyr and 79 times lower for Phi-3. These results\nhighlight the potential of iterative refinement techniques in enhancing the\ncapabilities of compact LLMs for clinical applications, offering a balance\nbetween performance, cost-effectiveness, and privacy preservation in healthcare\nsettings.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/"}