{"id":"2408.15875","title":"A Model-Free Method to Quantify Memory Utilization in Neural Point\n  Processes","authors":"Gorana Mijatovic, Sebastiano Stramaglia, Luca Faes","authorsParsed":[["Mijatovic","Gorana",""],["Stramaglia","Sebastiano",""],["Faes","Luca",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 15:46:05 GMT"}],"updateDate":"2024-08-29","timestamp":1724859965000,"abstract":"  Quantifying the predictive capacity of a neural system, intended as the\ncapability to store information and actively use it for dynamic system\nevolution, is a key component of neural information processing. Information\nstorage (IS), the main measure quantifying the active utilization of memory in\na dynamic system, is only defined for discrete-time processes. While recent\ntheoretical work laid the foundations for the continuous-time analysis of the\npredictive capacity stored in a process, methods for the effective computation\nof the related measures are needed to favor widespread utilization on neural\ndata. This work introduces a method for the model-free estimation of the\nso-called memory utilization rate (MUR), the continuous-time counterpart of the\nIS, specifically designed to quantify the predictive capacity stored in neural\npoint processes. The method employs nearest-neighbor entropy estimation applied\nto the inter-spike intervals measured from point-process realizations to\nquantify the extent of memory used by a spike train. An empirical procedure\nbased on surrogate data is implemented to compensate the estimation bias and\ndetect statistically significant levels of memory. The method is validated in\nsimulated Poisson processes and in realistic models of coupled cortical\ndynamics and heartbeat dynamics. It is then applied to real spike trains\nreflecting central and autonomic nervous system activities: in spontaneously\ngrowing cortical neuron cultures, the MUR detected increasing memory\nutilization across maturation stages, associated to emergent bursting\nsynchronized activity; in the study of the neuro-autonomic modulation of human\nheartbeats, the MUR reflected the sympathetic activation occurring with\npostural but not with mental stress. The proposed approach offers a\ncomputationally reliable tool to analyze spike train data in computational\nneuroscience and physiology.\n","subjects":["Quantitative Biology/Neurons and Cognition","Statistics/Computation"],"license":"http://creativecommons.org/licenses/by/4.0/"}