{"id":"2408.11072","title":"Potential Enabling Technologies for 7G Networks: Survey","authors":"Savo Glisic","authorsParsed":[["Glisic","Savo",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 08:03:50 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 12:03:34 GMT"}],"updateDate":"2024-08-29","timestamp":1723968230000,"abstract":"  Every new generation of mobile networks brings significant advances in two\nsegments, enhancement of the network parameters within the legacy technologies\nand introduction of new technologies enabling new paradigms in designing the\nnetworks. In the first class of enhancements the effort is to increase data\nrates, improve energy efficiency, enhance connectivity, reduce data\ntransmission latency etc. In the second class of innovations for 6G and 7G, we\nanticipate focus on optimum integration of advanced ML and AI in general, and\nquantum computing with the continuous interest in the satellite networks for\noptimal quantum key distribution . By introducing quantum technology 7G will be\nable to speed up computing processes in the net, enhance network security as\nwell as to enable distributed QC, which is a new paradigm in computer sciences.\n  Using advanced networks as a basic ingredient of inter system integration,\nhere we focus only on the second segment of anticipated innovations in\nnetworking and present a survey of the subset of potential technology enablers\nfor the above concept with special emphasis on the inter dependency of the\nsolutions chosen in different segments of the network. In Section II, we\npresent several anticipated 6G/7G (system of systems type) network optimization\nexamples resulting in a new paradigm of network optimization indicating a need\nfor quantum computing and quantum computing based optimization algorithms. In\nSection III we survey work on quantum cryptography and QKD.\n","subjects":["Computing Research Repository/Emerging Technologies","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}