{"id":"2408.17209","title":"Updateable Data-Driven Cardinality Estimator with Bounded Q-error","authors":"Yingze Li, Xianglong Liu, Hongzhi Wang, Kaixin Zhang, Zixuan Wang","authorsParsed":[["Li","Yingze",""],["Liu","Xianglong",""],["Wang","Hongzhi",""],["Zhang","Kaixin",""],["Wang","Zixuan",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 11:28:05 GMT"}],"updateDate":"2024-09-02","timestamp":1725017285000,"abstract":"  Modern Cardinality Estimators struggle with data updates. This research\ntackles this challenge within single-table. We introduce ICE, an Index-based\nCardinality Estimator, the first data-driven estimator that enables instant,\ntuple-leveled updates.\n  ICE has learned two key lessons from the multidimensional index and applied\nthem to solve cardinality estimation in dynamic scenarios: (1) Index possesses\nthe capability for swift training and seamless updating amidst vast\nmultidimensional data. (2) Index offers precise data distribution, staying\nsynchronized with the latest database version. These insights endow the index\nwith the ability to be a highly accurate, data-driven model that rapidly adapts\nto data updates and is resilient to out-of-distribution challenges during query\ntesting. To make a solitary index support cardinality estimation, we have\ncrafted sophisticated algorithms for training, updating, and estimating,\nanalyzing unbiasedness and variance.\n  Extensive experiments demonstrate the superiority of ICE. ICE offers precise\nestimations and fast updates/construction across diverse workloads. Compared to\nstate-of-the-art real-time query-driven models, ICE boasts superior accuracy\n(2-3 orders of magnitude more precise), faster updates (4.7-6.9 times faster),\nand significantly reduced training time (up to 1-3 orders of magnitude faster).\n","subjects":["Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0acMezvC3BItfzqfj8P0Cfu4drZ2Dl5C25wiSZB8Hts","pdfSize":"2115668"}
