{"id":"2408.08876","title":"Covariant Jacobi-Legendre expansion for total energy calculations within\n  the projector-augmented-wave formalism","authors":"Bruno Focassio, Michelangelo Domina, Urvesh Patil, Adalberto Fazzio,\n  Stefano Sanvito","authorsParsed":[["Focassio","Bruno",""],["Domina","Michelangelo",""],["Patil","Urvesh",""],["Fazzio","Adalberto",""],["Sanvito","Stefano",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 14:05:04 GMT"}],"updateDate":"2024-08-20","timestamp":1722607504000,"abstract":"  Machine-learning models can be trained to predict the converged electron\ncharge density of a density functional theory (DFT) calculation. In general,\nthe value of the density at a given point in space is invariant under global\ntranslations and rotations having that point as a centre. Hence, one can\nconstruct locally invariant machine-learning density predictors. However, the\nwidely used projector augmented wave (PAW) implementation of DFT requires the\nevaluation of the one-center augmentation contributions, that are not\nrotationally invariant. Building on our recently proposed Jacobi-Legendre\ncharge-density scheme, we construct a covariant Jacobi-Legendre model capable\nof predicting the local occupancies needed to compose the augmentation charge\ndensity. Our formalism is then applied to the prediction of the energy barrier\nfor the 1H-to-1T phase transition of two-dimensional MoS$_2$. With extremely\nmodest training, the model is capable of performing a non-self-consistent\nnudged elastic band calculation at virtually the same accuracy as a fully\nDFT-converged one, thus saving thousands of self-consistent DFT steps.\nFurthermore, at variance with machine-learning force fields, the charge density\nis here available for any nudged elastic band image, so that we can trace the\nevolution of the electronic structure across the phase transition.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/"}