{"id":"2408.05029","title":"Collaborative Static-Dynamic Teaching: A Semi-Supervised Framework for\n  Stripe-Like Space Target Detection","authors":"Zijian Zhu, Ali Zia, Xuesong Li, Bingbing Dan, Yuebo Ma, Hongfeng\n  Long, Kaili Lu, Enhai Liu, Rujin Zhao","authorsParsed":[["Zhu","Zijian",""],["Zia","Ali",""],["Li","Xuesong",""],["Dan","Bingbing",""],["Ma","Yuebo",""],["Long","Hongfeng",""],["Lu","Kaili",""],["Liu","Enhai",""],["Zhao","Rujin",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 12:33:27 GMT"}],"updateDate":"2024-08-12","timestamp":1723206807000,"abstract":"  Stripe-like space target detection (SSTD) is crucial for space situational\nawareness. Traditional unsupervised methods often fail in low signal-to-noise\nratio and variable stripe-like space targets scenarios, leading to weak\ngeneralization. Although fully supervised learning methods improve model\ngeneralization, they require extensive pixel-level labels for training. In the\nSSTD task, manually creating these labels is often inaccurate and\nlabor-intensive. Semi-supervised learning (SSL) methods reduce the need for\nthese labels and enhance model generalizability, but their performance is\nlimited by pseudo-label quality. To address this, we introduce an innovative\nCollaborative Static-Dynamic Teacher (CSDT) SSL framework, which includes\nstatic and dynamic teacher models as well as a student model. This framework\nemploys a customized adaptive pseudo-labeling (APL) strategy, transitioning\nfrom initial static teaching to adaptive collaborative teaching, guiding the\nstudent model's training. The exponential moving average (EMA) mechanism\nfurther enhances this process by feeding new stripe-like knowledge back to the\ndynamic teacher model through the student model, creating a positive feedback\nloop that continuously enhances the quality of pseudo-labels. Moreover, we\npresent MSSA-Net, a novel SSTD network featuring a multi-scale dual-path\nconvolution (MDPC) block and a feature map weighted attention (FMWA) block,\ndesigned to extract diverse stripe-like features within the CSDT SSL training\nframework. Extensive experiments verify the state-of-the-art performance of our\nframework on the AstroStripeSet and various ground-based and space-based\nreal-world datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}