{"id":"2408.11110","title":"Towards a theory of phase transitions in quantum control landscapes","authors":"Nicol\\`o Beato, Pranay Patil and Marin Bukov","authorsParsed":[["Beato","Nicolò",""],["Patil","Pranay",""],["Bukov","Marin",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 18:08:49 GMT"}],"updateDate":"2024-08-22","timestamp":1724177329000,"abstract":"  Control landscape phase transitions (CLPTs) occur as abrupt changes in the\ncost function landscape upon varying a control parameter, and can be revealed\nby non-analytic points in statistical order parameters. A prime example are\nquantum speed limits (QSL) which mark the onset of controllability as the\nprotocol duration is increased. Here we lay the foundations of an analytical\ntheory for CLPTs by developing Dyson, Magnus, and cumulant expansions for the\ncost function that capture the behavior of CLPTs with a controlled precision.\nUsing linear and quadratic stability analysis, we reveal that CLPTs can be\nassociated with different types of instabilities of the optimal protocol. This\nallows us to explicitly relate CLPTs to critical structural rearrangements in\nthe extrema of the control landscape: utilizing path integral methods from\nstatistical field theory, we trace back the critical scaling of the order\nparameter at the QSL to the topological and geometric properties of the set of\noptimal protocols, such as the number of connected components and its\ndimensionality. We verify our predictions by introducing a numerical sampling\nalgorithm designed to explore this optimal set via a homotopic stochastic\nupdate rule. We apply this new toolbox explicitly to analyze CLPTs in the\nsingle- and two-qubit control problems whose landscapes are analytically\ntractable, and compare the landscapes for bang-bang and continuous protocols.\nOur work provides the first steps towards a systematic theory of CLPTs and\npaves the way for utilizing statistical field theory techniques for generic\ncomplex control landscapes.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Other Condensed Matter","Condensed Matter/Quantum Gases","Condensed Matter/Statistical Mechanics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}