{"id":"2408.08736","title":"Task-Aware Dynamic Transformer for Efficient Arbitrary-Scale Image\n  Super-Resolution","authors":"Tianyi Xu, Yiji Zhou, Xiaotao Hu, Kai Zhang, Anran Zhang, Xingye Qiu,\n  Jun Xu","authorsParsed":[["Xu","Tianyi",""],["Zhou","Yiji",""],["Hu","Xiaotao",""],["Zhang","Kai",""],["Zhang","Anran",""],["Qiu","Xingye",""],["Xu","Jun",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 13:35:52 GMT"},{"version":"v2","created":"Sun, 25 Aug 2024 12:00:05 GMT"}],"updateDate":"2024-08-27","timestamp":1723815352000,"abstract":"  Arbitrary-scale super-resolution (ASSR) aims to learn a single model for\nimage super-resolution at arbitrary magnifying scales. Existing ASSR networks\ntypically comprise an off-the-shelf scale-agnostic feature extractor and an\narbitrary scale upsampler. These feature extractors often use fixed network\narchitectures to address different ASSR inference tasks, each of which is\ncharacterized by an input image and an upsampling scale. However, this\noverlooks the difficulty variance of super-resolution on different inference\nscenarios, where simple images or small SR scales could be resolved with less\ncomputational effort than difficult images or large SR scales. To tackle this\ndifficulty variability, in this paper, we propose a Task-Aware Dynamic\nTransformer (TADT) as an input-adaptive feature extractor for efficient image\nASSR. Our TADT consists of a multi-scale feature extraction backbone built upon\ngroups of Multi-Scale Transformer Blocks (MSTBs) and a Task-Aware Routing\nController (TARC). The TARC predicts the inference paths within feature\nextraction backbone, specifically selecting MSTBs based on the input images and\nSR scales. The prediction of inference path is guided by a new loss function to\ntrade-off the SR accuracy and efficiency. Experiments demonstrate that, when\nworking with three popular arbitrary-scale upsamplers, our TADT achieves\nstate-of-the-art ASSR performance when compared with mainstream feature\nextractors, but with relatively fewer computational costs. The code will be\npublicly released.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"y3t4BgRTIRDcFuaJsFdV2AmweaBJ5bcVmCAxSj4AeYQ","pdfSize":"10036939"}
