{"id":"2408.08198","title":"On Edge Multiscale Space based Hybrid Schwarz Preconditioner for\n  Helmholtz Problems with Large Wavenumbers","authors":"Shubin Fu, Shihua Gong, Guanglian Li and Yueqi Wang","authorsParsed":[["Fu","Shubin",""],["Gong","Shihua",""],["Li","Guanglian",""],["Wang","Yueqi",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 15:07:16 GMT"}],"updateDate":"2024-08-16","timestamp":1723734436000,"abstract":"  In this work, we develop a novel hybrid Schwarz method, termed as edge\nmultiscale space based hybrid Schwarz (EMs-HS), for solving the Helmholtz\nproblem with large wavenumbers. The problem is discretized using\n$H^1$-conforming nodal finite element methods on meshes of size $h$ decreasing\nfaster than $k^{-1}$ such that the discretization error remains bounded as the\nwavenumber $k$ increases. EMs-HS consists of a one-level Schwarz preconditioner\n(RAS-imp) and a coarse solver in a multiplicative way. The RAS-imp\npreconditioner solves local problems on overlapping subdomains with impedance\nboundary conditions in parallel, and combines the local solutions using\npartition of unity. The coarse space is an edge multiscale space proposed in\n[13]. The key idea is to first establish a local splitting of the solution over\neach subdomain by a local bubble part and local Helmholtz harmonic extension\npart, and then to derive a global splitting by means of the partition of unity.\nThis facilitates representing the solution as the sum of a global bubble part\nand a global Helmholtz harmonic extension part.\n  We prove that the EMs-HS preconditioner leads to a convergent fixed-point\niteration uniformly for large wavenumbers, by rigorously analyzing the\napproximation properties of the coarse space to the global Helmholtz harmonic\nextension part and to the solution of the adjoint problem. Distinctly, the\ntheoretical convergence analysis are valid in two extreme cases: using minimal\noverlapping size among subdomains (of order $h$), or using coarse spaces of\noptimal dimension (of magnitude $k^d$, where $d$ is the spatial dimension). We\nprovide extensive numerical results on the sharpness of the theoretical\nfindings and also demonstrate the method on challenging heterogeneous models.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}