{"id":"2408.00917","title":"On the fate of the secondary white dwarf in double-degenerate\n  double-detonation Type Ia supernovae -- II. 3D synthetic observables","authors":"J. M. Pollin, S. A. Sim, R. Pakmor, F. P. Callan, C. E. Collins, L. J.\n  Shingles, F. K. Roepke and S. Srivastav","authorsParsed":[["Pollin","J. M.",""],["Sim","S. A.",""],["Pakmor","R.",""],["Callan","F. P.",""],["Collins","C. E.",""],["Shingles","L. J.",""],["Roepke","F. K.",""],["Srivastav","S.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 21:15:50 GMT"}],"updateDate":"2024-08-05","timestamp":1722546950000,"abstract":"  A leading model for Type Ia supernovae involves the double-detonation of a\nsub-Chandrasekhar mass white dwarf. Double-detonations arise when a surface\nhelium shell detonation generates shockwaves that trigger a core detonation;\nthis mechanism may be triggered via accretion or during the merger of binaries.\nMost previous double-detonation simulations only included the primary white\ndwarf; however, the fate of the secondary has significant observational\nconsequences. Recently, hydrodynamic simulations accounted for the companion in\ndouble-degenerate double-detonation mergers. In the merger of a\n1.05$\\text{M}_{\\odot}$ primary white dwarf and 0.7$\\text{M}_{\\odot}$ secondary\nwhite dwarf, the primary consistently detonates while the fate of the secondary\nremains uncertain. We consider two versions of this scenario, one in which the\nsecondary survives and another in which it detonates. We present the first 3D\nradiative transfer calculations for these models and show that the synthetic\nobservables for both models are similar and match properties of the peculiar\n02es-like subclass of Type Ia supernovae. Our calculations show angle\ndependencies sensitive to the companion's fate, and we can obtain a closer\nspectroscopic match to normal Type Ia supernovae when the secondary detonates\nand the effects of helium detonation ash are minimised. The asymmetry in the\nwidth-luminosity relationship is comparable to previous double-detonation\nmodels, but the overall spread is increased with a secondary detonation. The\nsecondary detonation has a meaningful impact on all synthetic observables;\nhowever, multidimensional nebular phase calculations are needed to support or\nrule out either model as a likely explanation for Type Ia supernovae.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}