{"id":"2408.15323","title":"Review: Quantum Metrology and Sensing with Many-Body Systems","authors":"Victor Montenegro, Chiranjib Mukhopadhyay, Rozhin Yousefjani, Saubhik\n  Sarkar, Utkarsh Mishra, Matteo G. A. Paris, Abolfazl Bayat","authorsParsed":[["Montenegro","Victor",""],["Mukhopadhyay","Chiranjib",""],["Yousefjani","Rozhin",""],["Sarkar","Saubhik",""],["Mishra","Utkarsh",""],["Paris","Matteo G. A.",""],["Bayat","Abolfazl",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-29","timestamp":1724781601000,"abstract":"  The main power of quantum sensors is achieved when the probe is composed of\nseveral particles. In this situation, quantum features such as entanglement\ncontribute in enhancing the precision of quantum sensors beyond the capacity of\nclassical sensors. Originally, quantum sensing was formulated for\nnon-interacting particles which are prepared in a special form of maximally\nentangled states. These probes are extremely sensitive to decoherence and any\ninteraction between particles is detrimental to their performance. An\nalternative framework for quantum sensing has been developed exploiting quantum\nmany-body systems, where the interaction between particles plays a crucial\nrole. In this review, we investigate different aspects of the latter approach\nfor quantum metrology and sensing. Many-body probes have been used in both\nequilibrium and non-equilibrium scenarios. Quantum criticality has been\nidentified as a resource for achieving quantum enhanced sensitivity in both\nscenarios. In equilibrium, various types of criticalities, such as first order,\nsecond order, topological, and localization phase transitions have been\nexploited for sensing purposes. In non-equilibrium scenarios, quantum enhanced\nsensitivity has been discovered for Floquet, dissipative, and time crystal\nphase transitions. While each type of these criticalities has its own\ncharacteristics, the presence of one feature is crucial for achieving quantum\nenhanced sensitivity: the energy/quasi-energy gap closing. In non-equilibrium\nquantum sensing, time is another parameter which can affect the sensitivity of\nthe probe. Typically, the sensitivity enhances as the probe evolves in time. In\ngeneral, a more complete understanding of resources for non-equilibrium quantum\nsensors is now rapidly evolving. In this review, we provide an overview of\nrecent progress in quantum metrology and sensing using many-body systems.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Statistical Mechanics","Condensed Matter/Strongly Correlated Electrons","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}