{"id":"2408.08057","title":"Optimal Joint Fronthaul Compression and Beamforming Design for Networked\n  ISAC Systems","authors":"Kexin Zhang, Yanqing Xu, Ruisi He, Chao Shen, Tsung-hui Chang","authorsParsed":[["Zhang","Kexin",""],["Xu","Yanqing",""],["He","Ruisi",""],["Shen","Chao",""],["Chang","Tsung-hui",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 09:54:55 GMT"}],"updateDate":"2024-08-16","timestamp":1723715695000,"abstract":"  This study investigates a networked integrated sensing and communication\n(ISAC) system, where multiple base stations (BSs), connected to a central\nprocessor (CP) via capacity-limited fronthaul links, cooperatively serve\ncommunication users while simultaneously sensing a target. The primary\nobjective is to minimize the total transmit power while meeting the\nsignal-to-interference-plus-noise ratio (SINR) requirements for communication\nand sensing under fronthaul capacity constraints, resulting in a joint\nfronthaul compression and beamforming design (J-FCBD) problem. We demonstrate\nthat the optimal fronthaul compression variables can be determined in closed\nform alongside the beamformers, a novel finding in this field. Leveraging this\ninsight, we show that the remaining beamforming design problem can be solved\nglobally using the semidefinite relaxation (SDR) technique, albeit with\nconsiderable complexity. Furthermore, the tightness of its SDR reveals zero\nduality gap between the considered problem and its Lagrangian dual. Building on\nthis duality result, we exploit the novel UL-DL duality within the ISAC\nframework to develop an efficient primal-dual (PD)-based algorithm. The\nalgorithm alternates between solving beamforming with a fixed dual variable via\nfixed-point iteration and updating dual variable via bisection, ensuring global\noptimality and achieving high efficiency due to the computationally inexpensive\niterations. Numerical results confirm the global optimality, effectiveness, and\nefficiency of the proposed PD-based algorithm.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}