{"id":"2408.14722","title":"Pervasive impact of spatial dependence on predictability","authors":"Peng Luo, Yongze Song, Wenwen Li, Liqiu Meng","authorsParsed":[["Luo","Peng",""],["Song","Yongze",""],["Li","Wenwen",""],["Meng","Liqiu",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 01:11:17 GMT"},{"version":"v2","created":"Sun, 15 Sep 2024 19:39:29 GMT"}],"updateDate":"2024-09-17","timestamp":1724721077000,"abstract":"  Understanding the complex nature of spatial information is crucial for\nproblem solving in social and environmental sciences. This study investigates\nhow the underlying patterns of spatial data can significantly influence the\noutcomes of spatial predictions. Recognizing unique characteristics of spatial\ndata, such as spatial dependence and spatial heterogeneity, we delve into the\nfundamental differences and similarities between spatial and non-geospatial\nprediction models. Through the analysis of six different datasets of\nenvironment and socio-economic variables, comparing geospatial models with\nnon-geospatial models, our research highlights the pervasive nature of spatial\ndependence beyond geographical boundaries. This innovative approach not only\nrecognizes spatial dependence in geographic spaces defined by latitude and\nlongitude but also identifies its presence in non-geographic, attribute-based\ndimensions. Our findings reveal the pervasive influence of spatial dependence\non prediction outcomes across various domains, and spatial dependence\nsignificantly influences prediction performance across all spaces. Our findings\nsuggest that the strongest spatial dependence is typically found in geographic\nspace for environment variables, a trend that does not uniformly apply to\nsocio-economic variables. This investigation not only advances the theoretical\nframework for spatial data analysis, but also proposes new methodologies for\naccurately capturing and expressing spatial dependence under complex\nconditions. Our research extends spatial analysis to non-geographic dimensions\nsuch as social networks and gene expression patterns, emphasizing the role of\nspatial dependence in improving prediction accuracy, thereby supporting\ninterdisciplinary applications across fields such as geographic information\nscience, environmental science, economics, sociology, and bioinformatics.\n","subjects":["Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}