{"id":"2408.00023","title":"On the Perturbed States for Transformed Input-robust Reinforcement\n  Learning","authors":"Tung M. Luu, Haeyong Kang, Tri Ton, Thanh Nguyen, and Chang D. Yoo","authorsParsed":[["Luu","Tung M.",""],["Kang","Haeyong",""],["Ton","Tri",""],["Nguyen","Thanh",""],["Yoo","Chang D.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 05:31:28 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 06:05:19 GMT"}],"updateDate":"2024-08-05","timestamp":1722403888000,"abstract":"  Reinforcement Learning (RL) agents demonstrating proficiency in a training\nenvironment exhibit vulnerability to adversarial perturbations in input\nobservations during deployment. This underscores the importance of building a\nrobust agent before its real-world deployment. To alleviate the challenging\npoint, prior works focus on developing robust training-based procedures,\nencompassing efforts to fortify the deep neural network component's robustness\nor subject the agent to adversarial training against potent attacks. In this\nwork, we propose a novel method referred to as Transformed Input-robust RL\n(TIRL), which explores another avenue to mitigate the impact of adversaries by\nemploying input transformation-based defenses. Specifically, we introduce two\nprinciples for applying transformation-based defenses in learning robust RL\nagents: (1) autoencoder-styled denoising to reconstruct the original state and\n(2) bounded transformations (bit-depth reduction and vector quantization (VQ))\nto achieve close transformed inputs. The transformations are applied to the\nstate before feeding it into the policy network. Extensive experiments on\nmultiple MuJoCo environments demonstrate that input transformation-based\ndefenses, i.e., VQ, defend against several adversaries in the state\nobservations. The official code is available at\nhttps://github.com/tunglm2203/tirl\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4nRzjFbQurQwV-npNlAN_HwsbygnPb2CuzvJy8RLjJs","pdfSize":"1139309"}
