{"id":"2408.00352","title":"Autonomous LLM-Enhanced Adversarial Attack for Text-to-Motion","authors":"Honglei Miao, Fan Ma, Ruijie Quan, Kun Zhan, Yi Yang","authorsParsed":[["Miao","Honglei",""],["Ma","Fan",""],["Quan","Ruijie",""],["Zhan","Kun",""],["Yang","Yi",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 07:44:11 GMT"}],"updateDate":"2024-08-02","timestamp":1722498251000,"abstract":"  Human motion generation driven by deep generative models has enabled\ncompelling applications, but the ability of text-to-motion (T2M) models to\nproduce realistic motions from text prompts raises security concerns if\nexploited maliciously. Despite growing interest in T2M, few methods focus on\nsafeguarding these models against adversarial attacks, with existing work on\ntext-to-image models proving insufficient for the unique motion domain. In the\npaper, we propose ALERT-Motion, an autonomous framework leveraging large\nlanguage models (LLMs) to craft targeted adversarial attacks against black-box\nT2M models. Unlike prior methods modifying prompts through predefined rules,\nALERT-Motion uses LLMs' knowledge of human motion to autonomously generate\nsubtle yet powerful adversarial text descriptions. It comprises two key\nmodules: an adaptive dispatching module that constructs an LLM-based agent to\niteratively refine and search for adversarial prompts; and a multimodal\ninformation contrastive module that extracts semantically relevant motion\ninformation to guide the agent's search. Through this LLM-driven approach,\nALERT-Motion crafts adversarial prompts querying victim models to produce\noutputs closely matching targeted motions, while avoiding obvious\nperturbations. Evaluations across popular T2M models demonstrate ALERT-Motion's\nsuperiority over previous methods, achieving higher attack success rates with\nstealthier adversarial prompts. This pioneering work on T2M adversarial attacks\nhighlights the urgency of developing defensive measures as motion generation\ntechnology advances, urging further research into safe and responsible\ndeployment.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"C5wa-Fsd6xZ1WePJ5kTPok8m-Lvr2JsiXG9vXqxtW5A","pdfSize":"1112800"}
