{"id":"2408.15911","title":"Accelerating Image-based Pest Detection on a Heterogeneous Multi-core\n  Microcontroller","authors":"Luca Bompani, Luca Crupi, Daniele Palossi, Olmo Baldoni, Davide\n  Brunelli, Francesco Conti, Manuele Rusci, Luca Benini","authorsParsed":[["Bompani","Luca",""],["Crupi","Luca",""],["Palossi","Daniele",""],["Baldoni","Olmo",""],["Brunelli","Davide",""],["Conti","Francesco",""],["Rusci","Manuele",""],["Benini","Luca",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 16:25:04 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 11:51:34 GMT"}],"updateDate":"2024-08-30","timestamp":1724862304000,"abstract":"  The codling moth pest poses a significant threat to global crop production,\nwith potential losses of up to 80% in apple orchards. Special camera-based\nsensor nodes are deployed in the field to record and transmit images of trapped\ninsects to monitor the presence of the pest. This paper investigates the\nembedding of computer vision algorithms in the sensor node using a novel\nState-of-the-Art Microcontroller Unit (MCU), the GreenWaves Technologies' GAP9\nSystem-on-Chip, which combines 10 RISC-V general purposes cores with a\nconvolution hardware accelerator. We compare the performance of a lightweight\nViola-Jones detector algorithm with a Convolutional Neural Network (CNN),\nMobileNetV3-SSDLite, trained for the pest detection task. On two datasets that\ndifferentiate for the distance between the camera sensor and the pest targets,\nthe CNN generalizes better than the other method and achieves a detection\naccuracy between 83% and 72%. Thanks to the GAP9's CNN accelerator, the CNN\ninference task takes only 147 ms to process a 320$\\times$240 image. Compared to\nthe GAP8 MCU, which only relies on general-purpose cores for processing, we\nachieved 9.5$\\times$ faster inference speed. When running on a 1000 mAh battery\nat 3.7 V, the estimated lifetime is approximately 199 days, processing an image\nevery 30 seconds. Our study demonstrates that the novel heterogeneous MCU can\nperform end-to-end CNN inference with an energy consumption of just 4.85 mJ,\nmatching the efficiency of the simpler Viola-Jones algorithm and offering power\nconsumption up to 15$\\times$ lower than previous methods. Code at:\nhttps://github.com/Bomps4/TAFE_Pest_Detection\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}