{"id":"2408.11091","title":"Calculating the energy profile of an enzymatic reaction on a quantum\n  computer","authors":"Patrick Ettenhuber, Mads B{\\o}ttger Hansen, Irfansha Shaik, Stig\n  Elkj{\\ae}r Rasmussen, Pier Paolo Poier, Niels Kristian Madsen, Marco Majland,\n  Frank Jensen, Lars Olsen, Nikolaj Thomas Zinner","authorsParsed":[["Ettenhuber","Patrick",""],["Hansen","Mads Bøttger",""],["Shaik","Irfansha",""],["Rasmussen","Stig Elkjær",""],["Poier","Pier Paolo",""],["Madsen","Niels Kristian",""],["Majland","Marco",""],["Jensen","Frank",""],["Olsen","Lars",""],["Zinner","Nikolaj Thomas",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-22","timestamp":1724176801000,"abstract":"  Quantum computing (QC) provides a promising avenue toward enabling quantum\nchemistry calculations, which are classically impossible due to a computational\ncomplexity that increases exponentially with system size. As fully\nfault-tolerant algorithms and hardware, for which an exponential speedup is\npredicted, are currently out of reach, recent research efforts are dedicated to\ndeveloping and scaling algorithms for Noisy Intermediate-Scale Quantum (NISQ)\ndevices to showcase the practical utility of such machines. To demonstrate the\nutility of NISQ devices in the field of chemistry, we apply our recently\ndeveloped FAST-VQE algorithm and a novel quantum gate reduction strategy based\non propositional satisfiability together with standard optimization tools for\nthe simulation of the rate-determining proton transfer step for CO2 hydration\ncatalysed by carbonic anhydrase resulting in the first application of a quantum\ncomputing device for the simulation of an enzymatic reaction. To this end, we\nhave combined classical force field simulations with quantum mechanical methods\non classical and quantum computers in a hybrid calculation approach. The\npresented technique significantly enhances the accuracy and capabilities of\nQC-based molecular modeling and finally pushes it into compelling and realistic\napplications. The framework is general and can be applied beyond the case of\ncomputational enzymology.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}