{"id":"2408.04709","title":"Quantum Neural Network Training of a Repeater Node","authors":"Diego Fuentealba, Jack Dahn, James Steck, and Elizabeth Behrman","authorsParsed":[["Fuentealba","Diego",""],["Dahn","Jack",""],["Steck","James",""],["Behrman","Elizabeth",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 18:19:09 GMT"}],"updateDate":"2024-08-12","timestamp":1723141149000,"abstract":"  The construction of robust and scalable quantum gates is a uniquely hard\nproblem in the field of quantum computing. Real-world quantum computers suffer\nfrom many forms of noise, characterized by the decoherence and relaxation times\nof a quantum circuit, which make it very hard to construct efficient quantum\nalgorithms. One example is a quantum repeater node, a circuit that swaps the\nstates of two entangled input and output qubits. Robust quantum repeaters are a\nnecessary building block of long-distance quantum networks. A solution exists\nfor this problem, known as a swap gate, but its noise tolerance is poor.\nMachine learning may hold the key to efficient and robust quantum algorithm\ndesign, as demonstrated by its ability to learn to control other noisy and\nhighly nonlinear systems. Here, a quantum neural network (QNN) is constructed\nto perform the swap operation and compare a trained QNN solution to the\nstandard swap gate. The system of qubits and QNN is constructed in MATLAB and\ntrained under ideal conditions before noise is artificially added to the system\nto test robustness. We find that the QNN easily generalizes for two qubits and\ncan be scaled up to more qubits without additional training. We also find that\nas the number of qubits increases, the noise tolerance increases with it,\nmeaning a sufficiently large system can produce extremely noise-tolerant\nresults. This begins to explore the ability of neural networks to construct\nthose robust systems.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}