{"id":"2408.11299","title":"Substrate-induced spin-torque-like signal in spin-torque ferromagnetic\n  resonance measurement","authors":"Dingsong Jiang, Hetian Chen, Guiping Ji, Yahong Chai, Chenye Zhang,\n  Yuhan Liang, Jingchun Liu, Witold Skowro\\'nski, Pu Yu, Di Yi and Tianxiang\n  Nan","authorsParsed":[["Jiang","Dingsong",""],["Chen","Hetian",""],["Ji","Guiping",""],["Chai","Yahong",""],["Zhang","Chenye",""],["Liang","Yuhan",""],["Liu","Jingchun",""],["Skowroński","Witold",""],["Yu","Pu",""],["Yi","Di",""],["Nan","Tianxiang",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 03:01:57 GMT"}],"updateDate":"2024-08-22","timestamp":1724209317000,"abstract":"  Oxide thin films and interfaces with strong spin-orbit coupling have recently\nshown exceptionally high charge-to-spin conversion, making them potential\nspin-source materials for spintronics. Epitaxial strain engineering using oxide\nsubstrates with different lattice constants and symmetries has emerged as a\nmean to further enhance charge-to-spin conversion. However, high relative\npermittivity and dielectric loss of commonly used oxide substrates, such as\nSrTiO3, can cause significant current shunting in substrates at high frequency,\nwhich may strongly affect spin-torque measurement and potentially result in an\ninaccurate estimation of charge-to-spin conversion efficiency. In this study,\nwe systematically evaluate the influence of various oxide substrates for the\nwidely-used spin-torque ferromagnetic resonance (ST-FMR) measurement.\nSurprisingly, we observed substantial spin-torque signals in samples comprising\nonly ferromagnetic metal on oxide substrates with high relative permittivity\n(e.g., SrTiO3 and KTaO3), where negligible signal should be initially expected.\nNotably, this unexpected signal shows a strong correlation with the capacitive\nreactance of oxide substrates and the leakage radio frequency (RF) current\nwithin the substrate. By revising the conventional ST-FMR analysis model, we\nattribute this phenomenon to a 90-degree phase difference between the RF\ncurrent flowing in the metal layer and in the substrate. We suggest that extra\nattention should be paid during the ST-FMR measurements, as this artifact could\ndominate over the real spin-orbit torque signal from high-resistivity\nspin-source materials grown on substrate with high relative permittivity.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}