{"id":"2408.08451","title":"AlGaAs/GeSn p-i-n diode interfaced with ultrathin Al$_2$O$_3$","authors":"Yang Liu, Yiran Li, Sudip Acharya, Jie Zhou, Jiarui Gong, Alireza\n  Abrand, Yi Lu, Daniel Vincent, Samuel Haessly, Parsian K. Mohseni, Shui-Qing\n  Yu, and Zhenqiang Ma","authorsParsed":[["Liu","Yang",""],["Li","Yiran",""],["Acharya","Sudip",""],["Zhou","Jie",""],["Gong","Jiarui",""],["Abrand","Alireza",""],["Lu","Yi",""],["Vincent","Daniel",""],["Haessly","Samuel",""],["Mohseni","Parsian K.",""],["Yu","Shui-Qing",""],["Ma","Zhenqiang",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 23:06:13 GMT"}],"updateDate":"2024-08-19","timestamp":1723763173000,"abstract":"  This study presents the fabrication and characterizations of an\nAl$_{0.3}$Ga$_{0.7}$As/Ge$_{0.87}$Sn$_{0.13}$/GeSn p-i-n double heterostructure\n(DHS) diode following the grafting approach for enhanced optoelectronic\napplications. By integrating ultra-thin Al$_2$O$_3$ as a quantum tunneling\nlayer and enhancing interfacial double-side passivation, we achieved a\nheterostructure with a substantial 1.186 eV conduction band barrier between\nAlGaAs and GeSn, along with a low interfacial density of states. The diode\ndemonstrated impressive electrical characteristics with high uniformity,\nincluding a mean ideality factor of 1.47 and a mean rectification ratio of\n2.95E103 at +/-2 V across 326 devices, indicating high-quality device\nfabrication. Comprehensive electrical characterizations, including C-V and I-V\nprofiling, affirm the diode's capability to provide robust electrical\nconfinement and efficient carrier injection. These properties make the\nAl$_{0.3}$Ga$_{0.7}$As/Ge$_{0.87}$Sn$_{0.13}$/GeSn DHS a promising candidate\nfor next-generation electrically pumped GeSn lasers, potentially operable at\nhigher temperatures. Our results provide a viable pathway for further\nadvancements in various GeSn-based devices.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}