{"id":"2408.11511","title":"Re-evaluation of the cosmic-ray ionization rate in diffuse clouds","authors":"M. Obolentseva, A. V. Ivlev, K. Silsbee, D. A. Neufeld, P. Caselli, G.\n  Edenhofer, N. Indriolo, T. G. Bisbas, D. Lomeli","authorsParsed":[["Obolentseva","M.",""],["Ivlev","A. V.",""],["Silsbee","K.",""],["Neufeld","D. A.",""],["Caselli","P.",""],["Edenhofer","G.",""],["Indriolo","N.",""],["Bisbas","T. G.",""],["Lomeli","D.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 10:39:01 GMT"}],"updateDate":"2024-08-22","timestamp":1724236741000,"abstract":"  All current estimates of the cosmic-ray (CR) ionization rate rely on\nassessments of the gas density along the probed sight lines. Until now, these\nhave been based on observations of different tracers, with C$_2$ being the most\nwidely used in diffuse molecular clouds for this purpose. However,\nthree-dimensional dust extinction maps have recently reached sufficient\naccuracy as to give an independent measurement of the gas density on parsec\nscales. In addition, they allow us to identify the gas clumps along each sight\nline, thus localizing the regions where CR ionization is probed. We re-evaluate\nH$_3^+$ observations, which are often considered as the most reliable method to\nmeasure the H$_2$ ionization rate $\\zeta_{\\rm H_2}$ in diffuse clouds. The peak\ndensity values derived from the extinction maps for 12 analyzed sight lines\nturn out to be, on average, an order of magnitude lower than the previous\nestimates, and agree with the values obtained from revised analysis of C$_2$\ndata. We use the extinction maps in combination with the 3D-PDR code to\nself-consistently compute the H$_3^+$ and H$_2$ abundances in the identified\nclumps for different values of $\\zeta_{\\rm H_2}$. For each sight line, we\nobtain the optimum value by comparing the simulation results with observations.\nWe show that $\\zeta_{\\rm H_2}$ is systematically reduced with respect to the\nearlier estimates by a factor of $\\approx 9$ on average, to\n$\\approx6\\times10^{-17}$ s$^{-1}$, primarily as a result of the density\nreduction. We emphasize that these results have profound consequences for all\navailable measurements of the ionization rate.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2KNQsrtVQc4CaaB4BVDgic5cg0wNUDiVOEeU0LxS1uw","pdfSize":"6402096"}
