{"id":"2408.07743","title":"Testing galaxy formation models with the stellar mass-halo mass\n  relations for star-forming and quiescent galaxies","authors":"Kai Wang, Yingjie Peng","authorsParsed":[["Wang","Kai",""],["Peng","Yingjie",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-16","timestamp":1723658401000,"abstract":"  The tight relationship between the stellar mass and halo mass of galaxies is\none of the most fundamental scaling relations in galaxy formation and\nevolution. It has become a critical constraint for galaxy formation models.\nOver the past decade, growing evidence has convincingly shown that the stellar\nmass-halo mass relations (SHMRs) for star-forming and quiescent central\ngalaxies differ significantly: at a given stellar mass, the average host halo\nmass of quiescent centrals is more massive than that of the star-forming\ncentrals. Despite the importance of this feature, its scientific implications\nhave been largely overlooked and inadequately discussed. In this work, we\ndemonstrate that the semi-analytical model L-GALAXIES successfully reproduces\nthese observational results, whereas three state-of-the-art hydrodynamic galaxy\nformation simulations (TNG, Illustris, and EAGLE) do not. Consequently, in\nL-GALAXIES, star-forming central galaxies are more efficient at converting\nbaryons into stars than quiescent central galaxies at a given halo mass, while\nthe other models predict similar efficiencies for both populations. Further\nanalysis reveals that these fundamental discrepancies stem from distinct\nevolutionary paths on the stellar mass-halo mass plane. We show that the\nobserved SHMRs for star-forming and quiescent galaxies support galaxy formation\nmodels in which quenching only weakly correlates with halo assembly histories,\nand in which the stellar mass of star-forming galaxies can increase\nsignificantly since cosmic noon. In contrast, models in which quenching\nstrongly prefers to happen in early-formed halos are disfavored. Additionally,\nwe find that galaxy downsizing is present in L-GALAXIES and TNG, but absent in\nIllustris and EAGLE.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}