{"id":"2408.15647","title":"Leveraging Persistent Homology for Differential Diagnosis of Mild\n  Cognitive Impairment","authors":"Ninad Aithal, Debanjali Bhattacharya, Neelam Sinha and Thomas Gregor\n  Issac","authorsParsed":[["Aithal","Ninad",""],["Bhattacharya","Debanjali",""],["Sinha","Neelam",""],["Issac","Thomas Gregor",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 09:01:55 GMT"}],"updateDate":"2024-08-29","timestamp":1724835715000,"abstract":"  Mild cognitive impairment (MCI) is characterized by subtle changes in\ncognitive functions, often associated with disruptions in brain connectivity.\nThe present study introduces a novel fine-grained analysis to examine\ntopological alterations in neurodegeneration pertaining to six different brain\nnetworks of MCI subjects (Early/Late MCI). To achieve this, fMRI time series\nfrom two distinct populations are investigated: (i) the publicly accessible\nADNI dataset and (ii) our in-house dataset. The study utilizes sliding window\nembedding to convert each fMRI time series into a sequence of 3-dimensional\nvectors, facilitating the assessment of changes in regional brain topology.\nDistinct persistence diagrams are computed for Betti descriptors of\ndimension-0, 1, and 2. Wasserstein distance metric is used to quantify\ndifferences in topological characteristics. We have examined both (i)\nROI-specific inter-subject interactions and (ii) subject-specific inter-ROI\ninteractions. Further, a new deep learning model is proposed for\nclassification, achieving a maximum classification accuracy of 95% for the ADNI\ndataset and 85% for the in-house dataset. This methodology is further adapted\nfor the differential diagnosis of MCI sub-types, resulting in a peak accuracy\nof 76.5%, 91.1% and 80% in classifying HC Vs. EMCI, HC Vs. LMCI and EMCI Vs.\nLMCI, respectively. We showed that the proposed approach surpasses current\nstate-of-the-art techniques designed for classifying MCI and its sub-types\nusing fMRI.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"vWx9hhI0XUPH79Aa3ALW4o8sUEppTmNZCNtnU9xc-wc","pdfSize":"4094846"}
