{"id":"2408.06689","title":"Comparative Analysis of Digital Tools and Traditional Teaching Methods\n  in Educational Effectiveness","authors":"Aarush Kandukoori, Aditya Kandukoori, Faizan Wajid","authorsParsed":[["Kandukoori","Aarush",""],["Kandukoori","Aditya",""],["Wajid","Faizan",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 07:28:42 GMT"}],"updateDate":"2024-08-14","timestamp":1723534122000,"abstract":"  In today's world technology comprises a large aspect of our lives so this\nstudy aimed to investigate if using computers and digital tools are better than\ntraditional methods like using textbooks and worksheets for learning math. This\nstudy was done at Clarksburg Elementary School with help from MoCo Innovation\nwhich is a club that focuses on fostering an interest in technology among\nstudents. A major question that sparked our minds was: Are digital tools like\nlearning on computers better than traditional methods for improving students\nmath skills? We believe students who use digital tools might improve more in\ntheir math skills. To find out we worked with 30 students from the school. We\nsplit them into two groups and gave each group a pre assessment and post\nassessment. One group learned math using computers and were able to use\ninteractive math websites such as Khan Academy while the other group used\nworksheets. After some learning we gave them a post assessment to see how much\nthey had improved. Our results showed that the students who used the digital\ntools improved test scores averages by 24.2 percent from 70 percent to 87\npercent while the students who used traditional methods only improved by 8.3\npercent from 72 percent to 78 percent in math. These results show that digital\ntools are superior to regular teaching methods especially for subjects like\nmath. But more research is required to see if digital tools are the main reason\nfor this improvement. This research is definitely important to help schools\ndecide if they want to use more technology.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fFLmETcWBz_W9ylbHo4vH34-K8rRktY_FH1E26tQGgY","pdfSize":"556581"}
