{"id":"2408.03690","title":"Prioritising Response-able IP Practices in Digitization of Electoral\n  Processes in Africa","authors":"Angella Ndaka, Samwel Oando, Eucabeth Majiwa","authorsParsed":[["Ndaka","Angella",""],["Oando","Samwel",""],["Majiwa","Eucabeth",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 11:07:09 GMT"}],"updateDate":"2024-08-08","timestamp":1723028829000,"abstract":"  Globally, people widely regard technology as a solution to global social\nproblems. In a democratic society, its citizens view technology as a way to\nensure commitment and sustaining the nation's democracy by allowing them to\nparticipate actively in the democratic process. However, despite the hype\nsurrounding technology and development, many developing countries still\nexperience democratic challenges. The democratic challenges have further led to\nbarriers that shape the political landscape, resulting in delusion,\ndisappointment, and failures in the democratic and public good processes, such\nas the electoral process. This paper explores the relationship between\nintellectual property (IP) practices and the adoption of digital technologies\nused in democratic electoral processes. Specifically, it examines how the\nprioritisation of IP by technology service providers can disrupt socio-material\nrelationships in democratic electoral processes and outcomes. Because of the\nhard boundaries associated with IP it creates an environment where the systems\nare controlled solely by technology IP owners, while the consequences of\nelectoral processes are borne by citizens. This questions the response-ability\nand trust-ability of digital technologies in running democratic processes.\nDrawing from the parallels in Kenya's general elections of 2017 and 2022, this\npaper illustrates how IP practices form a hard boundary that impels technology\nowners to micromanage electoral processes, leading to tensions that potentially\ncreate conflict. This finding can be used by decision-makers to adopt digital\ntechnologies and protect IP without compromising electoral processes and\ndisrupting relationships in the wider society.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}