{"id":"2408.01615","title":"Three-dimensional Morphological Reconstruction of Millimeter-Scale Soft\n  Continuum Robots based on Dual-Stereo-Vision","authors":"Tian-Ao Ren, Wenyan Liu, Tao Zhang, Lei Zhao, Hongliang Ren, Jiewen\n  Lai","authorsParsed":[["Ren","Tian-Ao",""],["Liu","Wenyan",""],["Zhang","Tao",""],["Zhao","Lei",""],["Ren","Hongliang",""],["Lai","Jiewen",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 00:45:01 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 05:00:47 GMT"},{"version":"v3","created":"Thu, 15 Aug 2024 22:20:02 GMT"}],"updateDate":"2024-08-19","timestamp":1722645901000,"abstract":"  Continuum robots can be miniaturized to just a few millimeters in diameter.\nAmong these, notched tubular continuum robots (NTCR) show great potential in\nmany delicate applications. Existing works in robotic modeling focus on\nkinematics and dynamics but still face challenges in reproducing the robot's\nmorphology -- a significant factor that can expand the research landscape of\ncontinuum robots, especially for those with asymmetric continuum structures.\nThis paper proposes a dual stereo vision-based method for the three-dimensional\nmorphological reconstruction of millimeter-scale NTCRs. The method employs two\noppositely located stationary binocular cameras to capture the point cloud of\nthe NTCR, then utilizes predefined geometry as a reference for the KD tree\nmethod to relocate the capture point clouds, resulting in a morphologically\ncorrect NTCR despite the low-quality raw point cloud collection. The method has\nbeen proved feasible for an NTCR with a 3.5 mm diameter, capturing 14 out of 16\nnotch features, with the measurements generally centered around the standard of\n1.5 mm, demonstrating the capability of revealing morphological details. Our\nproposed method paves the way for 3D morphological reconstruction of\nmillimeter-scale soft robots for further self-modeling study.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}