{"id":"2408.10038","title":"Single-Star Warm-Jupiter Systems Tend to Be Aligned, Even Around Hot\n  Stellar Hosts: No $T_{\\rm eff}-\\lambda$ Dependency","authors":"Xian-Yu Wang, Malena Rice, Songhu Wang, Shubham Kanodia, Fei Dai,\n  Sarah E. Logsdon, Heidi Schweiker, Johanna K. Teske, R. Paul Butler, Jeffrey\n  D. Crane, Stephen A. Shectman, Samuel N. Quinn, Veselin B. Kostov, Hugh P.\n  Osborn, Robert F. Goeke, Jason D. Eastman, Avi Shporer, David Rapetti, Karen\n  A. Collins, Cristilyn Watkins, Howard M. Relles, George R. Ricker, Sara\n  Seager, Joshua N. Winn, Jon M. Jenkins","authorsParsed":[["Wang","Xian-Yu",""],["Rice","Malena",""],["Wang","Songhu",""],["Kanodia","Shubham",""],["Dai","Fei",""],["Logsdon","Sarah E.",""],["Schweiker","Heidi",""],["Teske","Johanna K.",""],["Butler","R. Paul",""],["Crane","Jeffrey D.",""],["Shectman","Stephen A.",""],["Quinn","Samuel N.",""],["Kostov","Veselin B.",""],["Osborn","Hugh P.",""],["Goeke","Robert F.",""],["Eastman","Jason D.",""],["Shporer","Avi",""],["Rapetti","David",""],["Collins","Karen A.",""],["Watkins","Cristilyn",""],["Relles","Howard M.",""],["Ricker","George R.",""],["Seager","Sara",""],["Winn","Joshua N.",""],["Jenkins","Jon M.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 14:31:40 GMT"}],"updateDate":"2024-08-20","timestamp":1724077900000,"abstract":"  The stellar obliquity distribution of warm-Jupiter systems is crucial for\nconstraining the dynamical history of Jovian exoplanets, as the warm Jupiters'\ntidal detachment likely preserves their primordial obliquity. However, the\nsample size of warm-Jupiter systems with measured stellar obliquities has\nhistorically been limited compared to that of hot Jupiters, particularly in\nhot-star systems. In this work, we present newly obtained sky-projected stellar\nobliquity measurements for warm-Jupiter systems, TOI-559, TOI-2025, TOI-2031,\nTOI-2485, TOI-2524, and TOI-3972, derived from the Rossiter-McLaughlin effect,\nand show that all six systems display alignment with a median measurement\nuncertainty of 13 degrees. Combining these new measurements with the set of\npreviously reported stellar obliquity measurements, our analysis reveals that\nsingle-star warm-Jupiter systems tend to be aligned, even around hot stellar\nhosts. This alignment exhibits a 3.4-$\\sigma$ deviation from the $T_{\\rm\neff}-\\lambda$ dependency observed in hot-Jupiter systems, where planets around\ncool stars tend to be aligned, while those orbiting hot stars show considerable\nmisalignment. The current distribution of spin-orbit measurements for Jovian\nexoplanets indicates that misalignments are neither universal nor primordial\nphenomena affecting all types of planets. The absence of misalignments in\nsingle-star warm-Jupiter systems further implies that many hot Jupiters, by\ncontrast, have experienced a dynamically violent history.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}