{"id":"2408.05533","title":"Radiance Field Learners As UAV First-Person Viewers","authors":"Liqi Yan, Qifan Wang, Junhan Zhao, Qiang Guan, Zheng Tang, Jianhui\n  Zhang, Dongfang Liu","authorsParsed":[["Yan","Liqi",""],["Wang","Qifan",""],["Zhao","Junhan",""],["Guan","Qiang",""],["Tang","Zheng",""],["Zhang","Jianhui",""],["Liu","Dongfang",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 12:29:11 GMT"}],"updateDate":"2024-08-13","timestamp":1723292951000,"abstract":"  First-Person-View (FPV) holds immense potential for revolutionizing the\ntrajectory of Unmanned Aerial Vehicles (UAVs), offering an exhilarating avenue\nfor navigating complex building structures. Yet, traditional Neural Radiance\nField (NeRF) methods face challenges such as sampling single points per\niteration and requiring an extensive array of views for supervision. UAV videos\nexacerbate these issues with limited viewpoints and significant spatial scale\nvariations, resulting in inadequate detail rendering across diverse scales. In\nresponse, we introduce FPV-NeRF, addressing these challenges through three key\nfacets: (1) Temporal consistency. Leveraging spatio-temporal continuity ensures\nseamless coherence between frames; (2) Global structure. Incorporating various\nglobal features during point sampling preserves space integrity; (3) Local\ngranularity. Employing a comprehensive framework and multi-resolution\nsupervision for multi-scale scene feature representation tackles the\nintricacies of UAV video spatial scales. Additionally, due to the scarcity of\npublicly available FPV videos, we introduce an innovative view synthesis method\nusing NeRF to generate FPV perspectives from UAV footage, enhancing spatial\nperception for drones. Our novel dataset spans diverse trajectories, from\noutdoor to indoor environments, in the UAV domain, differing significantly from\ntraditional NeRF scenarios. Through extensive experiments encompassing both\ninterior and exterior building structures, FPV-NeRF demonstrates a superior\nunderstanding of the UAV flying space, outperforming state-of-the-art methods\nin our curated UAV dataset. Explore our project page for further insights:\nhttps://fpv-nerf.github.io/.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}