{"id":"2408.04182","title":"Adapting to Reality: Over-the-Air Validation of AI-Based Receivers\n  Trained with Simulated Channels","authors":"Riku Luostari, Dani Korpi, Mikko Honkala, Janne M.J. Huttunen","authorsParsed":[["Luostari","Riku",""],["Korpi","Dani",""],["Honkala","Mikko",""],["Huttunen","Janne M. J.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 02:58:35 GMT"}],"updateDate":"2024-08-09","timestamp":1723085915000,"abstract":"  Recent research has shown that integrating artificial intelligence (AI) into\nwireless communication systems can significantly improve spectral efficiency.\nHowever, the prevalent use of simulated radio channel data for training and\nvalidating neural network-based radios raises concerns about their\ngeneralization capability to diverse real-world environments. To address this,\nwe conducted empirical over-the-air (OTA) experiments using software-defined\nradio (SDR) technology to test the performance of an NN-based orthogonal\nfrequency division multiplexing (OFDM) receiver in a real-world small cell\nscenario. Our assessment reveals that the performance of receivers trained on\ndiverse 3GPP TS38.901 channel models and broad parameter ranges significantly\nsurpasses conventional receivers in our testing environment, demonstrating\nstrong generalization to a new environment. Conversely, setting simulation\nparameters to narrowly reflect the actual measurement environment led to\nsuboptimal OTA performance, highlighting the crucial role of rich and\nrandomized training data in improving the NN-based receiver's performance.\nWhile our empirical test results are promising, they also suggest that\ndeveloping new channel models tailored for training these learned receivers\nwould enhance their generalization capability and reduce training time. Our\ntesting was limited to a relatively narrow environment, and we encourage\nfurther testing in more complex environments.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}