{"id":"2408.09406","title":"Uncovering multi-order Popularity and Similarity Mechanisms in Link\n  Prediction by graphlet predictors","authors":"Yong-Jian He, Yijun Ran, Zengru Di, Tao Zhou, Xiao-Ke Xu","authorsParsed":[["He","Yong-Jian",""],["Ran","Yijun",""],["Di","Zengru",""],["Zhou","Tao",""],["Xu","Xiao-Ke",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 08:33:39 GMT"}],"updateDate":"2024-08-20","timestamp":1723970019000,"abstract":"  Link prediction has become a critical problem in network science and has thus\nattracted increasing research interest. Popularity and similarity are two\nprimary mechanisms in the formation of real networks. However, the roles of\npopularity and similarity mechanisms in link prediction across various domain\nnetworks remain poorly understood. Accordingly, this study used orbit degrees\nof graphlets to construct multi-order popularity- and similarity-based network\nlink predictors, demonstrating that traditional popularity- and\nsimilarity-based indices can be efficiently represented in terms of orbit\ndegrees. Moreover, we designed a supervised learning model that fuses multiple\norbit-degree-based features and validated its link prediction performance. We\nalso evaluated the mean absolute Shapley additive explanations of each feature\nwithin this model across 550 real-world networks from six domains. We observed\nthat the homophily mechanism, which is a similarity-based feature, dominated\nsocial networks, with its win rate being 91\\%. Moreover, a different\nsimilarity-based feature was prominent in economic, technological, and\ninformation networks. Finally, no single feature dominated the biological and\ntransportation networks. The proposed approach improves the accuracy and\ninterpretability of link prediction, thus facilitating the analysis of complex\nnetworks.\n","subjects":["Computing Research Repository/Social and Information Networks","Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}