{"id":"2408.03805","title":"A theory of locally convex Hopf algebras","authors":"Hua Wang","authorsParsed":[["Wang","Hua",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 14:31:10 GMT"}],"updateDate":"2024-08-08","timestamp":1723041070000,"abstract":"  Using the completed inductive, projective and injective tensor products of\nGrothendieck for locally convex topological vector spaces, we develop a\nsystematic theory of locally convex Hopf algebras with an emphasis on\nPontryagin-type dualities. We describe how classical Hopf algebras, real and\ncomplex Lie groups, as well as compact and discrete quantum groups, can all\ngive rise to natural examples of this theory in a variety of different ways. We\nalso show that the space of all continuous functions on a topological group $ G\n$ whose topological structures are compactly generated has an $ \\varepsilon\n$-Hopf algebra structure, and we can recover $ G $ fully as a topological group\nfrom this locally convex Hopf algebra. The latter is done via a generalization\nof Gelfand duality, which is of its own interest. Certain projective and\ninductive limits are also considered in this framework, and it is shown that\nhow this can lead to examples seemingly outside of the framework of locally\ncompact quantum groups in the sense of Kustermans-Vaes. As an illustration, we\npropose a version of the infinite quantum permutation group $ S^{+}_{\\infty} $,\nthe free orthogonal group $ O^{+}_{\\infty} $, and the free unitary group $\nU^{+}_{\\infty} $ as certain strict inductive limits, all of which still retain\na nice duality. Combined with our duality theory, this may be seen as an\nalternative tentative approach to the Kac program of developing a\nPontryagin-type duality to a wider class, while at the same time, we include\nmany more interesting examples of classical and quantum groups.\n","subjects":["Mathematics/Functional Analysis","Mathematics/Operator Algebras","Mathematics/Quantum Algebra"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"74NAjUx7vD04rVtlzWMVfq2vaW8e36YwQT4b3hvxuaw","pdfSize":"984373"}
