{"id":"2408.14466","title":"Bayesian functional data analysis in astronomy","authors":"Thomas Loredo, Tamas Budavari, David Kent, David Ruppert","authorsParsed":[["Loredo","Thomas",""],["Budavari","Tamas",""],["Kent","David",""],["Ruppert","David",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 17:55:18 GMT"}],"updateDate":"2024-08-27","timestamp":1724694918000,"abstract":"  Cosmic demographics -- the statistical study of populations of astrophysical\nobjects -- has long relied on *multivariate statistics*, providing methods for\nanalyzing data comprising fixed-length vectors of properties of objects, as\nmight be compiled in a tabular astronomical catalog (say, with sky coordinates,\nand brightness measurements in a fixed number of spectral passbands). But\nbeginning with the emergence of automated digital sky surveys, ca. ~2000,\nastronomers began producing large collections of data with more complex\nstructure: light curves (brightness time series) and spectra (brightness vs.\nwavelength). These comprise what statisticians call *functional data* --\nmeasurements of populations of functions. Upcoming automated sky surveys will\nsoon provide astronomers with a flood of functional data. New methods are\nneeded to accurately and optimally analyze large ensembles of light curves and\nspectra, accumulating information both along and across measured functions.\nFunctional data analysis (FDA) provides tools for statistical modeling of\nfunctional data. Astronomical data presents several challenges for FDA\nmethodology, e.g., sparse, irregular, and asynchronous sampling, and\nheteroscedastic measurement error. Bayesian FDA uses hierarchical Bayesian\nmodels for function populations, and is well suited to addressing these\nchallenges. We provide an overview of astronomical functional data, and of some\nkey Bayesian FDA modeling approaches, including functional mixed effects\nmodels, and stochastic process models. We briefly describe a Bayesian FDA\nframework combining FDA and machine learning methods to build low-dimensional\nparametric models for galaxy spectra.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kX--7TApBci0ZaNnwAHTQw8P5oereJn5B59O5js5Bto","pdfSize":"2303346"}
