{"id":"2408.01869","title":"MALADE: Orchestration of LLM-powered Agents with Retrieval Augmented\n  Generation for Pharmacovigilance","authors":"Jihye Choi, Nils Palumbo, Prasad Chalasani, Matthew M. Engelhard,\n  Somesh Jha, Anivarya Kumar, David Page","authorsParsed":[["Choi","Jihye",""],["Palumbo","Nils",""],["Chalasani","Prasad",""],["Engelhard","Matthew M.",""],["Jha","Somesh",""],["Kumar","Anivarya",""],["Page","David",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 22:14:13 GMT"}],"updateDate":"2024-08-06","timestamp":1722723253000,"abstract":"  In the era of Large Language Models (LLMs), given their remarkable text\nunderstanding and generation abilities, there is an unprecedented opportunity\nto develop new, LLM-based methods for trustworthy medical knowledge synthesis,\nextraction and summarization. This paper focuses on the problem of\nPharmacovigilance (PhV), where the significance and challenges lie in\nidentifying Adverse Drug Events (ADEs) from diverse text sources, such as\nmedical literature, clinical notes, and drug labels. Unfortunately, this task\nis hindered by factors including variations in the terminologies of drugs and\noutcomes, and ADE descriptions often being buried in large amounts of narrative\ntext. We present MALADE, the first effective collaborative multi-agent system\npowered by LLM with Retrieval Augmented Generation for ADE extraction from drug\nlabel data. This technique involves augmenting a query to an LLM with relevant\ninformation extracted from text resources, and instructing the LLM to compose a\nresponse consistent with the augmented data. MALADE is a general LLM-agnostic\narchitecture, and its unique capabilities are: (1) leveraging a variety of\nexternal sources, such as medical literature, drug labels, and FDA tools (e.g.,\nOpenFDA drug information API), (2) extracting drug-outcome association in a\nstructured format along with the strength of the association, and (3) providing\nexplanations for established associations. Instantiated with GPT-4 Turbo or\nGPT-4o, and FDA drug label data, MALADE demonstrates its efficacy with an Area\nUnder ROC Curve of 0.90 against the OMOP Ground Truth table of ADEs. Our\nimplementation leverages the Langroid multi-agent LLM framework and can be\nfound at https://github.com/jihyechoi77/malade.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning","Computing Research Repository/Multiagent Systems","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ymPRpFhgMMR8EQ7o4UaMKLaWs7CrLnqb0OAU5O1BAW4","pdfSize":"1497285","txDigest":"6ac4mnX7g3iLkrEvHWXZPdQQ3FLSrmfj7owxFMSK1kFV","endEpoch":"1","status":"CERTIFIED"}
