{"id":"2408.05757","title":"Nonrelativistic limit of QFT in curved spacetime","authors":"Riccardo Falcone","authorsParsed":[["Falcone","Riccardo",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 12:23:49 GMT"}],"updateDate":"2024-08-13","timestamp":1723379029000,"abstract":"  The formalism of nonrelativistic quantum physics was originally considered in\nthe context of inertial frames. Here, we report on a more general framework\nthat includes noninertial frames and arbitrarily strong gravitational fields.\nWe derive from first principles the nonrelativistic limit of quantum fields in\ncurved spacetime. Unique features and subtleties of the fully covariant theory\nin curved spacetime affect nonrelativistic quantum systems in accelerated\nframes when the acceleration is sufficiently high. This includes the frame\ndependent notion of particles, energies, vacuum states and nonrelativistic\nconditions. By using the algebraic approach to quantum field theory, we detail\nthese effects in the noninertial nonrelativistic regime. The theoretical\nframework developed here gives predictions about the phenomenology of\nnonrelativistic quantum systems that are put in noninertial motion. As an\napplication, we derive the realistic model of accelerated nonrelativistic atoms\nby using Dirac field theory in Rindler spacetime. We report on the experimental\nconstraints for the indirect observation of the Unruh effect by means of atomic\ndetectors via hyperfine structure. Then, we address the problem of localization\nof quantum states and observables in inertial and accelerated frames. We show\nhow the Born probabilistic notion emerges in both cases as a consequence of the\nrespective nonrelativistic limit. As a result, we find that nonrelativistic\nstates can be described in terms of wave functions that quantify the\nprobability to find particles in each space position. Also, we report on\nnonlocal effects that originate from the frame dependent nature of vacuum\nstates and nonrelativistic conditions in the quantum field theory in curved\nspacetime.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}