{"id":"2408.02837","title":"Modular Architectures and Entanglement Schemes for Error-Corrected\n  Distributed Quantum Computation","authors":"Siddhant Singh, Fenglei Gu, S\\'ebastian de Bone, Eduardo Villase\\~nor,\n  David Elkouss, Johannes Borregaard","authorsParsed":[["Singh","Siddhant",""],["Gu","Fenglei",""],["de Bone","Sébastian",""],["Villaseñor","Eduardo",""],["Elkouss","David",""],["Borregaard","Johannes",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 21:20:03 GMT"}],"updateDate":"2024-08-07","timestamp":1722892803000,"abstract":"  Connecting multiple smaller qubit modules by generating high-fidelity\nentangled states is a promising path for scaling quantum computing hardware.\nThe performance of such a modular quantum computer is highly dependent on the\nquality and rate of entanglement generation. However, the optimal architectures\nand entanglement generation schemes are not yet established. Focusing on\nmodular quantum computers with solid-state quantum hardware, we investigate a\ndistributed surface code's error-correcting threshold and logical failure rate.\nWe consider both emission-based and scattering-based entanglement generation\nschemes for the measurement of non-local stabilizers. Through quantum optical\nmodeling, we link the performance of the quantum error correction code to the\nparameters of the underlying physical hardware and identify the necessary\nparameter regime for fault-tolerant modular quantum computation. In addition,\nwe compare modular architectures with one or two data qubits per module. We\nfind that the performance of the code depends significantly on the choice of\nentanglement generation scheme, while the two modular architectures have\nsimilar error-correcting thresholds. For some schemes, thresholds nearing the\nthresholds of non-distributed implementations ($\\sim0.4 \\%$) appear feasible\nwith future parameters.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}