{"id":"2408.10512","title":"Approximate Estimation of High-dimension Execution Skill for Dynamic\n  Agents in Continuous Domains","authors":"Delma Nieves-Rivera and Christopher Archibald","authorsParsed":[["Nieves-Rivera","Delma",""],["Archibald","Christopher",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 03:27:09 GMT"}],"updateDate":"2024-08-21","timestamp":1724124429000,"abstract":"  In many real-world continuous action domains, human agents must decide which\nactions to attempt and then execute those actions to the best of their ability.\nHowever, humans cannot execute actions without error. Human performance in\nthese domains can potentially be improved by the use of AI to aid in\ndecision-making. One requirement for an AI to correctly reason about what\nactions a human agent should attempt is a correct model of that human's\nexecution error, or skill. Recent work has demonstrated successful techniques\nfor estimating this execution error with various types of agents across\ndifferent domains. However, this previous work made several assumptions that\nlimit the application of these ideas to real-world settings. First, previous\nwork assumed that the error distributions were symmetric normal, which meant\nthat only a single parameter had to be estimated. In reality, agent error\ndistributions might exhibit arbitrary shapes and should be modeled more\nflexibly. Second, it was assumed that the execution error of the agent remained\nconstant across all observations. Especially for human agents, execution error\nchanges over time, and this must be taken into account to obtain effective\nestimates. To overcome both of these shortcomings, we propose a novel\nparticle-filter-based estimator for this problem. After describing the details\nof this approximate estimator, we experimentally explore various design\ndecisions and compare performance with previous skill estimators in a variety\nof settings to showcase the improvements. The outcome is an estimator capable\nof generating more realistic, time-varying execution skill estimates of agents,\nwhich can then be used to assist agents in making better decisions and improve\ntheir overall performance.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"VFVkBK7maj5VFRX0O2Xe0nXBUuyYALis946P_weuilU","pdfSize":"1621633"}
