{"id":"2408.09295","title":"Multi-Camera Multi-Person Association using Transformer-Based Dense\n  Pixel Correspondence Estimation and Detection-Based Masking","authors":"Daniel Kathein, Byron Hernandez, and Henry Medeiros","authorsParsed":[["Kathein","Daniel",""],["Hernandez","Byron",""],["Medeiros","Henry",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 20:58:16 GMT"}],"updateDate":"2024-08-20","timestamp":1723928296000,"abstract":"  Multi-camera Association (MCA) is the task of identifying objects and\nindividuals across camera views and is an active research topic, given its\nnumerous applications across robotics, surveillance, and agriculture. We\ninvestigate a novel multi-camera multi-target association algorithm based on\ndense pixel correspondence estimation with a Transformer-based architecture and\nunderlying detection-based masking. After the algorithm generates a set of\ncorresponding keypoints and their respective confidence levels between every\npair of detections in the camera views are computed, an affinity matrix is\ndetermined containing the probabilities of matches between each pair. Finally,\nthe Hungarian algorithm is applied to generate an optimal assignment matrix\nwith all the predicted associations between the camera views. Our method is\nevaluated on the WILDTRACK Seven-Camera HD Dataset, a high-resolution dataset\ncontaining footage of walking pedestrians as well as precise annotations and\ncamera calibrations. Our results conclude that the algorithm performs\nexceptionally well associating pedestrians on camera pairs that are positioned\nclose to each other and observe the scene from similar perspectives. On camera\npairs with orientations that are drastically different in distance or angle,\nthere is still significant room for improvement.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"e_248geQPGlYizdz0sQ_8ojHJUqu6yq_XSiY0HwYv_U","pdfSize":"703927"}
