{"id":"2408.14451","title":"Multiscale Design of Au-Based Alloys for Improved Plasmon Delivery and\n  Nanoheating in Near-Field Transducers","authors":"Okan K. Orhan, Frank Daniel Bello, Nicol\\'as Abad\\'ia, Ortwin Hess,\n  John F. Donegan, David D. O'Regan","authorsParsed":[["Orhan","Okan K.",""],["Bello","Frank Daniel",""],["Abadía","Nicolás",""],["Hess","Ortwin",""],["Donegan","John F.",""],["O'Regan","David D.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 17:45:21 GMT"}],"updateDate":"2024-08-27","timestamp":1724694321000,"abstract":"  Plasmonic near-field transducers (NFTs) play a key role in administering\nnanoscale heating for a number of applications ranging from medical devices to\nnext generation data processing technology. We present a novel multi-scale\napproach, combining quantum many-body perturbation theory with finite-element\nmodelling, to predict the electric and thermal material parameters of various\nAu-based, noble metal (M) alloys. Specifically, we focus on modelling their\nperformance within an NFT designed to focus high-intensity, sub-diffracted\nlight for technologies such as nanoscale etching, manipulation, sensing, and\nheat-assisted magnetic recording (HAMR). Elemental Au is the long-standing\ngeneral-purpose NFT medium due its excellent plasmonic performance at relevant\nwavelengths. However, elemental Au is a soft, ductile material that tends to\nextrude and deform in response to extreme temperature gradients. Therefore,\nalloying Au with other noble metals such as Ag, Cu, Pd or Pt, has attracted\nconsiderable interest for improved mechanical and thermal robustness while\nreaching threshold plasmonic generation at standard optoelectronics operating\nwavelengths (e.g., $\\approx 830$~nm) and approximate high-power NFT\ntemperatures ($\\approx 400$~K). We predict that certain Au-Ag alloys may offer\nimproved thermal stability as whole-NFT media compared to elemental Au,\nalongside plasmonic figures of merit comparable to that of Au. Simulations of\ncertain solid solution Au-Pd/Pt alloys enable us to predict significantly\nenhanced thermal conductivity. We predict that alloying with Pd at low\nconcentrations $\\sim 10\\%$ may preserve the NFT performance of Au, while\noffering the benefits of improved thermal and mechanical stability.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Applied Physics","Physics/Computational Physics","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}