{"id":"2408.16470","title":"CooTest: An Automated Testing Approach for V2X Communication Systems","authors":"An Guo, Xinyu Gao, Zhenyu Chen, Yuan Xiao, Jiakai Liu, Xiuting Ge,\n  Weisong Sun, Chunrong Fang","authorsParsed":[["Guo","An",""],["Gao","Xinyu",""],["Chen","Zhenyu",""],["Xiao","Yuan",""],["Liu","Jiakai",""],["Ge","Xiuting",""],["Sun","Weisong",""],["Fang","Chunrong",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 12:01:21 GMT"}],"updateDate":"2024-08-30","timestamp":1724932881000,"abstract":"  Perceiving the complex driving environment precisely is crucial to the safe\noperation of autonomous vehicles. With the tremendous advancement of deep\nlearning and communication technology, Vehicle-to-Everything (V2X)\ncollaboration has the potential to address limitations in sensing distant\nobjects and occlusion for a single-agent perception system. However, despite\nspectacular progress, several communication challenges can undermine the\neffectiveness of multi-vehicle cooperative perception. The low interpretability\nof Deep Neural Networks (DNNs) and the high complexity of communication\nmechanisms make conventional testing techniques inapplicable for the\ncooperative perception of autonomous driving systems (ADS). Besides, the\nexisting testing techniques, depending on manual data collection and labeling,\nbecome time-consuming and prohibitively expensive.\n  In this paper, we design and implement CooTest, the first automated testing\ntool of the V2X-oriented cooperative perception module. CooTest devises the\nV2X-specific metamorphic relation and equips communication and weather\ntransformation operators that can reflect the impact of the various cooperative\ndriving factors to produce transformed scenes. Furthermore, we adopt a\nV2X-oriented guidance strategy for the transformed scene generation process and\nimprove testing efficiency. We experiment CooTest with multiple cooperative\nperception models with different fusion schemes to evaluate its performance on\ndifferent tasks. The experiment results show that CooTest can effectively\ndetect erroneous behaviors under various V2X-oriented driving conditions. Also,\nthe results confirm that CooTest can improve detection average precision and\ndecrease misleading cooperation errors by retraining with the generated scenes.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}