{"id":"2408.04755","title":"Automation Configuration in Smart Home Systems: Challenges and\n  Opportunities","authors":"Sheik Murad Hassan Anik, Xinghua Gao, Hao Zhong, Xiaoyin Wang, Na Meng","authorsParsed":[["Anik","Sheik Murad Hassan",""],["Gao","Xinghua",""],["Zhong","Hao",""],["Wang","Xiaoyin",""],["Meng","Na",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 21:05:44 GMT"}],"updateDate":"2024-08-12","timestamp":1723151144000,"abstract":"  As the innovation of smart devices and internet-of-things (IoT), smart homes\nhave become prevalent. People tend to transform residences into smart homes by\ncustomizing off-the-shelf smart home platforms, instead of creating IoT systems\nfrom scratch. Among the alternatives, Home Assistant (HA) is one of the most\npopular platforms. It allows end-users (i.e., home residents) to smartify homes\nby (S1) integrating selected devices into the system, and (S2) creating YAML\nfiles to control those devices. Unfortunately, due to the diversity of devices\nand complexity of automatic configurations, many users have difficulty\ncorrectly creating YAML files. Consequently, their smart homes may not work as\nexpected, causing frustration and concern in users.\n  This paper presents a novel study on issues of YAML-based automation\nconfiguration in smart homes (issues related to S2). We mined the online forum\nHome Assistant Community for discussion threads related to automation\nconfiguration. By manually inspecting 190 threads, we revealed 3 categories of\nconcerns: implementation, optimization, and debugging. Under each category, we\nclassified discussions based on the issue locations and technical concepts\ninvolved. Among debugging discussions, we further classified discussions based\non users' resolution strategies; we also applied existing analysis tools to\nbuggy YAML files, to assess the tool effectiveness. Our study reveals the\ncommon challenges faced by users and frequently applied resolution strategies.\nThere are 129 (68%) examined issues concerning debugging, but existing tools\ncan detect at most 14 issues and fix none. It implies that existing tools\nprovide limited assistance in automation configuration. Our research sheds\nlight on future directions in smart home development.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rf5AG4DxdQY2072_J_0Ld392F4AT-nJ0da5CpKvhlfQ","pdfSize":"549141"}
