{"id":"2408.02773","title":"Refined Infrared Small Target Detection Scheme with Single-Point\n  Supervision","authors":"Jinmiao Zhao, Zelin Shi, Chuang Yu, Yunpeng Liu","authorsParsed":[["Zhao","Jinmiao",""],["Shi","Zelin",""],["Yu","Chuang",""],["Liu","Yunpeng",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 18:49:58 GMT"}],"updateDate":"2024-08-07","timestamp":1722883798000,"abstract":"  Recently, infrared small target detection with single-point supervision has\nattracted extensive attention. However, the detection accuracy of existing\nmethods has difficulty meeting actual needs. Therefore, we propose an\ninnovative refined infrared small target detection scheme with single-point\nsupervision, which has excellent segmentation accuracy and detection rate.\nSpecifically, we introduce label evolution with single point supervision\n(LESPS) framework and explore the performance of various excellent infrared\nsmall target detection networks based on this framework. Meanwhile, to improve\nthe comprehensive performance, we construct a complete post-processing\nstrategy. On the one hand, to improve the segmentation accuracy, we use a\ncombination of test-time augmentation (TTA) and conditional random field (CRF)\nfor post-processing. On the other hand, to improve the detection rate, we\nintroduce an adjustable sensitivity (AS) strategy for post-processing, which\nfully considers the advantages of multiple detection results and reasonably\nadds some areas with low confidence to the fine segmentation image in the form\nof centroid points. In addition, to further improve the performance and explore\nthe characteristics of this task, on the one hand, we construct and find that a\nmulti-stage loss is helpful for fine-grained detection. On the other hand, we\nfind that a reasonable sliding window cropping strategy for test samples has\nbetter performance for actual multi-size samples. Extensive experimental\nresults show that the proposed scheme achieves state-of-the-art (SOTA)\nperformance. Notably, the proposed scheme won the third place in the \"ICPR 2024\nResource-Limited Infrared Small Target Detection Challenge Track 1: Weakly\nSupervised Infrared Small Target Detection\".\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}