{"id":"2408.09598","title":"Anytime-Valid Inference for Double/Debiased Machine Learning of Causal\n  Parameters","authors":"Abhinandan Dalal, Patrick Bl\\\"obaum, Shiva Kasiviswanathan, Aaditya\n  Ramdas","authorsParsed":[["Dalal","Abhinandan",""],["Blöbaum","Patrick",""],["Kasiviswanathan","Shiva",""],["Ramdas","Aaditya",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 21:19:56 GMT"},{"version":"v2","created":"Tue, 10 Sep 2024 21:10:47 GMT"}],"updateDate":"2024-09-12","timestamp":1724015996000,"abstract":"  Double (debiased) machine learning (DML) has seen widespread use in recent\nyears for learning causal/structural parameters, in part due to its flexibility\nand adaptability to high-dimensional nuisance functions as well as its ability\nto avoid bias from regularization or overfitting. However, the classic\ndouble-debiased framework is only valid asymptotically for a predetermined\nsample size, thus lacking the flexibility of collecting more data if sharper\ninference is needed, or stopping data collection early if useful inferences can\nbe made earlier than expected. This can be of particular concern in large scale\nexperimental studies with huge financial costs or human lives at stake, as well\nas in observational studies where the length of confidence of intervals do not\nshrink to zero even with increasing sample size due to partial identifiability\nof a structural parameter. In this paper, we present time-uniform counterparts\nto the asymptotic DML results, enabling valid inference and confidence\nintervals for structural parameters to be constructed at any arbitrary\n(possibly data-dependent) stopping time. We provide conditions which are only\nslightly stronger than the standard DML conditions, but offer the stronger\nguarantee for anytime-valid inference. This facilitates the transformation of\nany existing DML method to provide anytime-valid guarantees with minimal\nmodifications, making it highly adaptable and easy to use. We illustrate our\nprocedure using two instances: a) local average treatment effect in online\nexperiments with non-compliance, and b) partial identification of average\ntreatment effect in observational studies with potential unmeasured\nconfounding.\n","subjects":["Statistics/Methodology","Economics/Econometrics","Mathematics/Statistics Theory","Statistics/Machine Learning","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}