{"id":"2408.06973","title":"Deepest limits on scattered light emission from the Epsilon Eridani\n  inner debris disk with HST/STIS","authors":"Sai Krishanth P.M., Ewan S. Douglas, Ramya M. Anche, Justin Hom, Kerri\n  L. Cahoy, John H. Debes, Hannah Jang-Condell, Isabel Rebollido, Bin B. Ren,\n  Christopher C. Stark, Robert Thompson, Yinzi Xin","authorsParsed":[["M.","Sai Krishanth P.",""],["Douglas","Ewan S.",""],["Anche","Ramya M.",""],["Hom","Justin",""],["Cahoy","Kerri L.",""],["Debes","John H.",""],["Jang-Condell","Hannah",""],["Rebollido","Isabel",""],["Ren","Bin B.",""],["Stark","Christopher C.",""],["Thompson","Robert",""],["Xin","Yinzi",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 15:30:34 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 19:10:14 GMT"}],"updateDate":"2024-08-16","timestamp":1723563034000,"abstract":"  Epsilon Eridani ($\\epsilon$ Eri) is one of the first debris disk systems\ndetected by the Infrared Astronomical Satellite (IRAS). However, the system has\nthus far eluded detection in scattered light with no components having been\ndirectly imaged. Its similarity to a relatively young Solar System combined\nwith its proximity makes it an excellent candidate to further our understanding\nof planetary system evolution. We present a set of coronagraphic images taken\nusing the Space Telescope Imaging Spectrograph (STIS) coronagraph on the Hubble\nspace telescope at a small inner working angle to detect a predicted warm inner\ndebris disk inside 1\". We used three different post-processing approaches;\nNon-negative Matrix Factorization (NMF), Karhunen-Lo`eve Image Processing\n(KLIP), and Classical reference differential imaging (RDI), to best optimize\nreference star subtraction, and find that NMF performed the best overall while\nKLIP produced the absolute best contrast inside 1\". We present limits on\nscattered light from warm dust, with constraints on surface brightness at 6\nmJy/as$^2$ at our inner working angle of 0.6\". We also place a constraint of\n0.5 mJy/as$^2$ outside 1\", which gives us an upper limit on the brightness for\nouter disks and substellar companions. Finally, we calculated an upper limit on\nthe dust albedo at $\\omega <$ 0.487.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}