{"id":"2408.02058","title":"Quantum Bayesian Games","authors":"John B. DeBrota, Peter J. Love","authorsParsed":[["DeBrota","John B.",""],["Love","Peter J.",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 15:15:42 GMT"}],"updateDate":"2024-08-06","timestamp":1722784542000,"abstract":"  We apply a Bayesian agent-based framework inspired by QBism to iterations of\ntwo quantum games, the CHSH game and the quantum prisoners' dilemma. In each\ntwo-player game, players hold beliefs about an amount of shared entanglement\nand about the actions or beliefs of the other player. Each takes actions which\nmaximize their expected utility and revises their beliefs with the classical\nBayes rule between rounds. We simulate iterated play to see if and how players\ncan learn about the presence of shared entanglement and to explore how their\nperformance, their beliefs, and the game's structure interrelate. In the CHSH\ngame, we find that players can learn that entanglement is present and use this\nto achieve quantum advantage. We find that they can only do so if they also\nbelieve the other player will act correctly to exploit the entanglement. In the\ncase of low or zero entanglement in the CHSH game, the players cannot achieve\nquantum advantage, even in the case where they believe the entanglement is\nhigher than it is. For the prisoners dilemma, we show that assuming 1-fold\nrational players (rational players who believe the other player is also\nrational) reduces the quantum extension [Eisert, Wilkens, and Lewenstein, Phys.\nRev. Lett. 83, 3077 (1999)] of the prisoners dilemma to a game with only two\nstrategies, one of which (defect) is dominant for low entanglement, and the\nother (the quantum strategy Q) is dominant for high entanglement. For\nintermediate entanglement, neither strategy is dominant. We again show that\nplayers can learn entanglement in iterated play. We also show that strong\nbelief in entanglement causes optimal play even in the absence of entanglement\n-- showing that belief in entanglement is acting as a proxy for the players\ntrusting each other. Our work points to possible future applications in\nresource detection and quantum algorithm design.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}