{"id":"2408.13369","title":"Beyond Winning Strategies: Admissible and Admissible Winning Strategies\n  for Quantitative Reachability Games","authors":"Karan Muvvala and Qi Heng Ho and Morteza Lahijanian","authorsParsed":[["Muvvala","Karan",""],["Ho","Qi Heng",""],["Lahijanian","Morteza",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 21:03:59 GMT"}],"updateDate":"2024-08-27","timestamp":1724447039000,"abstract":"  Classical reactive synthesis approaches aim to synthesize a reactive system\nthat always satisfies a given specifications. These approaches often reduce to\nplaying a two-player zero-sum game where the goal is to synthesize a winning\nstrategy. However, in many pragmatic domains, such as robotics, a winning\nstrategy does not always exist, yet it is desirable for the system to make an\neffort to satisfy its requirements instead of \"giving up\". To this end, this\npaper investigates the notion of admissible strategies, which formalize\n\"doing-your-best\", in quantitative reachability games. We show that, unlike the\nqualitative case, quantitative admissible strategies are history-dependent even\nfor finite payoff functions, making synthesis a challenging task. In addition,\nwe prove that admissible strategies always exist but may produce undesirable\noptimistic behaviors. To mitigate this, we propose admissible winning\nstrategies, which enforce the best possible outcome while being admissible. We\nshow that both strategies always exist but are not memoryless. We provide\nnecessary and sufficient conditions for the existence of both strategies and\npropose synthesis algorithms. Finally, we illustrate the strategies on\ngridworld and robot manipulator domains.\n","subjects":["Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Formal Languages and Automata Theory","Computing Research Repository/Logic in Computer Science","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}