{"id":"2408.01446","title":"Estimating Environmental Cost Throughout Model's Adaptive Life Cycle","authors":"Vishwesh Sangarya and Richard Bradford and Jung-Eun Kim","authorsParsed":[["Sangarya","Vishwesh",""],["Bradford","Richard",""],["Kim","Jung-Eun",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 03:58:06 GMT"}],"updateDate":"2024-08-06","timestamp":1721707086000,"abstract":"  With the rapid increase in the research, development, and application of\nneural networks in the current era, there is a proportional increase in the\nenergy needed to train and use models. Crucially, this is accompanied by the\nincrease in carbon emissions into the environment. A sustainable and socially\nbeneficial approach to reducing the carbon footprint and rising energy demands\nassociated with the modern age of AI/deep learning is the adaptive and\ncontinuous reuse of models with regard to changes in the environment of model\ndeployment or variations/changes in the input data. In this paper, we propose\nPreIndex, a predictive index to estimate the environmental and compute\nresources associated with model retraining to distributional shifts in data.\nPreIndex can be used to estimate environmental costs such as carbon emissions\nand energy usage when retraining from current data distribution to new data\ndistribution. It also correlates with and can be used to estimate other\nresource indicators associated with deep learning, such as epochs, gradient\nnorm, and magnitude of model parameter change. PreIndex requires only one\nforward pass of the data, following which it provides a single concise value to\nestimate resources associated with retraining to the new distribution shifted\ndata. We show that PreIndex can be reliably used across various datasets, model\narchitectures, different types, and intensities of distribution shifts. Thus,\nPreIndex enables users to make informed decisions for retraining to different\ndistribution shifts and determine the most cost-effective and sustainable\noption, allowing for the reuse of a model with a much smaller footprint in the\nenvironment. The code for this work is available here:\nhttps://github.com/JEKimLab/AIES2024PreIndex\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}