{"id":"2408.05510","title":"Experimental observation of relativistic field-derivative torque in\n  nonlinear THz response of magnetization dynamics","authors":"Arpita Dutta, Christian Tzschaschel, Debankit Priyadarshi, Kouki\n  Mikuni, Takuya Satoh, Ritwik Mondal, Shovon Pal","authorsParsed":[["Dutta","Arpita",""],["Tzschaschel","Christian",""],["Priyadarshi","Debankit",""],["Mikuni","Kouki",""],["Satoh","Takuya",""],["Mondal","Ritwik",""],["Pal","Shovon",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 10:32:02 GMT"}],"updateDate":"2024-08-13","timestamp":1723285922000,"abstract":"  Understanding the complete light-spin interactions in magnetic systems is the\nkey to manipulating the magnetization using optical means at ultrafast\ntimescales. The selective addressing of spins by terahertz (THz)\nelectromagnetic fields via Zeeman torque is, by far, one of the most successful\nultrafast means of controlling magnetic excitations. Here we show that this\ntraditional Zeeman torque on the spins is not sufficient, rather an additional\nrelativistic field-derivative torque is essential to realize the observed\nmagnetization dynamics. We accomplish this by exploring the ultrafast nonlinear\nmagnetization dynamics of rare-earth, Bi-doped iron garnet when excited by two\nco-propagating THz pulses. By non-thermal optical pump-probe technique, we,\nfirst, find the collective exchange resonance mode between rare-earth and\ntransition metal sublattices at 0.48 THz. We further explore the magnetization\ndynamics via a rather direct and efficient THz time-domain spectroscopic means.\nWe find that the observed nonlinear trace of the magnetic response cannot be\nmapped to the magnetization precession induced by the Zeeman torque, while the\nZeeman torque supplemented by an additional field-derivative torque follows the\nexperimental evidences. This breakthrough not only enhances our comprehension\nof ultra-relativistic effects but also paves the way for the development of\nnovel technologies harnessing light-induced control over magnetic systems.\n","subjects":["Condensed Matter/Materials Science","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/"}