{"id":"2408.11720","title":"On Learnable Parameters of Optimal and Suboptimal Deep Learning Models","authors":"Ziwei Zheng, Huizhi Liang, Vaclav Snasel, Vito Latora, Panos Pardalos,\n  Giuseppe Nicosia, Varun Ojha","authorsParsed":[["Zheng","Ziwei",""],["Liang","Huizhi",""],["Snasel","Vaclav",""],["Latora","Vito",""],["Pardalos","Panos",""],["Nicosia","Giuseppe",""],["Ojha","Varun",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 15:50:37 GMT"}],"updateDate":"2024-08-22","timestamp":1724255437000,"abstract":"  We scrutinize the structural and operational aspects of deep learning models,\nparticularly focusing on the nuances of learnable parameters (weight)\nstatistics, distribution, node interaction, and visualization. By establishing\ncorrelations between variance in weight patterns and overall network\nperformance, we investigate the varying (optimal and suboptimal) performances\nof various deep-learning models. Our empirical analysis extends across widely\nrecognized datasets such as MNIST, Fashion-MNIST, and CIFAR-10, and various\ndeep learning models such as deep neural networks (DNNs), convolutional neural\nnetworks (CNNs), and vision transformer (ViT), enabling us to pinpoint\ncharacteristics of learnable parameters that correlate with successful\nnetworks. Through extensive experiments on the diverse architectures of deep\nlearning models, we shed light on the critical factors that influence the\nfunctionality and efficiency of DNNs. Our findings reveal that successful\nnetworks, irrespective of datasets or models, are invariably similar to other\nsuccessful networks in their converged weights statistics and distribution,\nwhile poor-performing networks vary in their weights. In addition, our research\nshows that the learnable parameters of widely varied deep learning models such\nas DNN, CNN, and ViT exhibit similar learning characteristics.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YMPDXxK_nYoODntKE-DyfQuLMDzV0DZVqmbp3LkL8_4","pdfSize":"8356208"}
