{"id":"2408.01130","title":"Closed-loop underwater soft robotic foil shape control using flexible\n  e-skin","authors":"Leo Micklem, Huazhi Dong, Francesco Giorgio-Serchi, Yunjie Yang,\n  Gabriel D. Weymouth, Blair Thornton","authorsParsed":[["Micklem","Leo",""],["Dong","Huazhi",""],["Giorgio-Serchi","Francesco",""],["Yang","Yunjie",""],["Weymouth","Gabriel D.",""],["Thornton","Blair",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 09:19:24 GMT"}],"updateDate":"2024-08-05","timestamp":1722590364000,"abstract":"  The use of soft robotics for real-world underwater applications is limited,\neven more than in terrestrial applications, by the ability to accurately\nmeasure and control the deformation of the soft materials in real time without\nthe need for feedback from an external sensor. Real-time underwater shape\nestimation would allow for accurate closed-loop control of soft propulsors,\nenabling high-performance swimming and manoeuvring. We propose and demonstrate\na method for closed-loop underwater soft robotic foil control based on a\nflexible capacitive e-skin and machine learning which does not necessitate\nfeedback from an external sensor. The underwater e-skin is applied to a highly\nflexible foil undergoing deformations from 2% to 9% of its camber by means of\nsoft hydraulic actuators. Accurate set point regulation of the camber is\nsuccessfully tracked during sinusoidal and triangle actuation routines with an\namplitude of 5% peak-to-peak and 10-second period with a normalised RMS error\nof 0.11, and 2% peak-to-peak amplitude with a period of 5 seconds with a\nnormalised RMS error of 0.03. The tail tip deflection can be measured across a\n30 mm (0.15 chords) range. These results pave the way for using e-skin\ntechnology for underwater soft robotic closed-loop control applications.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cdHrRShZ-7P-mzquvpgjkLl5JWBI0hrcHOUuIfRRVtE","pdfSize":"1586899"}
