{"id":"2408.10701","title":"Ferret: Faster and Effective Automated Red Teaming with Reward-Based\n  Scoring Technique","authors":"Tej Deep Pala, Vernon Y.H. Toh, Rishabh Bhardwaj, Soujanya Poria","authorsParsed":[["Pala","Tej Deep",""],["Toh","Vernon Y. H.",""],["Bhardwaj","Rishabh",""],["Poria","Soujanya",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 09:58:01 GMT"}],"updateDate":"2024-08-21","timestamp":1724147881000,"abstract":"  In today's era, where large language models (LLMs) are integrated into\nnumerous real-world applications, ensuring their safety and robustness is\ncrucial for responsible AI usage. Automated red-teaming methods play a key role\nin this process by generating adversarial attacks to identify and mitigate\npotential vulnerabilities in these models. However, existing methods often\nstruggle with slow performance, limited categorical diversity, and high\nresource demands. While Rainbow Teaming, a recent approach, addresses the\ndiversity challenge by framing adversarial prompt generation as a\nquality-diversity search, it remains slow and requires a large fine-tuned\nmutator for optimal performance. To overcome these limitations, we propose\nFerret, a novel approach that builds upon Rainbow Teaming by generating\nmultiple adversarial prompt mutations per iteration and using a scoring\nfunction to rank and select the most effective adversarial prompt. We explore\nvarious scoring functions, including reward models, Llama Guard, and\nLLM-as-a-judge, to rank adversarial mutations based on their potential harm to\nimprove the efficiency of the search for harmful mutations. Our results\ndemonstrate that Ferret, utilizing a reward model as a scoring function,\nimproves the overall attack success rate (ASR) to 95%, which is 46% higher than\nRainbow Teaming. Additionally, Ferret reduces the time needed to achieve a 90%\nASR by 15.2% compared to the baseline and generates adversarial prompts that\nare transferable i.e. effective on other LLMs of larger size. Our codes are\navailable at https://github.com/declare-lab/ferret.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"RAaFqtQpfuKxQhiw7ONQgofzCv4vI7WLBKHOazum7og","pdfSize":"2148328"}
