{"id":"2408.08061","title":"Security Challenges of Complex Space Applications: An Empirical Study","authors":"Tomas Paulik","authorsParsed":[["Paulik","Tomas",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 10:02:46 GMT"}],"updateDate":"2024-08-16","timestamp":1723716166000,"abstract":"  Software applications in the space and defense industries have their unique\ncharacteristics: They are complex in structure, mission-critical, and often\ntargets of state-of-the-art cyber attacks sponsored by adversary nation states.\nThese applications have typically a high number of stakeholders in their\nsoftware component supply chain, data supply chain, and user base. The\naforementioned factors make such software applications potentially vulnerable\nto bad actors, as the widely adopted DevOps tools and practices were not\ndesigned for high-complexity and high-risk environments.\n  In this study, I investigate the security challenges of the development and\nmanagement of complex space applications, which differentiate the process from\nthe commonly used practices. My findings are based on interviews with five\ndomain experts from the industry and are further supported by a comprehensive\nreview of relevant publications.\n  To illustrate the dynamics of the problem, I present and discuss an actual\nsoftware supply chain structure used by Thales Alenia Space, which is one of\nthe largest suppliers of the European Space Agency. Subsequently, I discuss the\nfour most critical security challenges identified by the interviewed experts:\nVerification of software artifacts, verification of the deployed application,\nsingle point of security failure, and data tampering by trusted stakeholders.\nFurthermore, I present best practices which could be used to overcome each of\nthe given challenges, and whether the interviewed experts think their\norganization has access to the right tools to address them. Finally, I propose\nfuture research of new DevSecOps strategies, practices, and tools which would\nenable better methods of software integrity verification in the space and\ndefense industries.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}