{"id":"2408.04195","title":"Design and Implementation of Smart Infrastructures and Connected\n  Vehicles in A Mini-city Platform","authors":"Daniel Vargas, Ethan Haque, Matthew Carroll, Daniel Perez, Tyler\n  Roman, Phong Nguyen, Golnaz Habibi","authorsParsed":[["Vargas","Daniel",""],["Haque","Ethan",""],["Carroll","Matthew",""],["Perez","Daniel",""],["Roman","Tyler",""],["Nguyen","Phong",""],["Habibi","Golnaz",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 03:31:04 GMT"}],"updateDate":"2024-08-09","timestamp":1723087864000,"abstract":"  This paper presents a 1/10th scale mini-city platform used as a testing bed\nfor evaluating autonomous and connected vehicles. Using the mini-city platform,\nwe can evaluate different driving scenarios including human-driven and\nautonomous driving. We provide a unique, visual feature-rich environment for\nevaluating computer vision methods. The conducted experiments utilize onboard\nsensors mounted on a robotic platform we built, allowing them to navigate in a\ncontrolled real-world urban environment. The designed city is occupied by cars,\nstop signs, a variety of residential and business buildings, and complex\nintersections mimicking an urban area. Furthermore, We have designed an\nintelligent infrastructure at one of the intersections in the city which helps\nsafer and more efficient navigation in the presence of multiple cars and\npedestrians. We have used the mini-city platform for the analysis of three\ndifferent applications: city mapping, depth estimation in challenging occluded\nenvironments, and smart infrastructure for connected vehicles. Our smart\ninfrastructure is among the first to develop and evaluate\nVehicle-to-Infrastructure (V2I) communication at intersections. The\nintersection-related result shows how inaccuracy in perception, including\nmapping and localization, can affect safety. The proposed mini-city platform\ncan be considered as a baseline environment for developing research and\neducation in intelligent transportation systems.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HGWL516AWvdXFFeMNOtrvakcMlN7hF1x5W4-v7K8Xes","pdfSize":"31693816"}
