{"id":"2408.15322","title":"Spin the black circle: horizon absorption on non-circular, planar binary\n  black hole dynamics","authors":"Danilo Chiaramello, Rossella Gamba","authorsParsed":[["Chiaramello","Danilo",""],["Gamba","Rossella",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-29","timestamp":1724781601000,"abstract":"  Binary systems of black holes emit gravitational waves as they move through\ntheir orbits. While most of the emitted radiation escapes to future null\ninfinity, a small fraction is absorbed by the black holes themselves. This is\nknown as horizon absorption or tidal heating/torquing, and causes the black\nholes' masses and spins to change as the system evolves. In this work, we\nquantify the effects of the horizon flux on binary black holes dynamics by\ncomputing them up to next-to-next-to-leading order on generic planar orbits,\nalso exploring physically motivated factorizations of the results. We integrate\nthese fluxes over unbound, hyperbolic-like trajectories obtained with the\nEffective-One-Body model TEOBResumS. We discuss the resulting phenomenology\nacross a sizable slice of the relevant parameter space, finding a very small\neffect in most cases, except on highly energetic orbits. However, the predicted\nmass and spin variations are quantitatively and qualitatively very sensitive to\nthe analytical representation chosen for the fluxes in that regime. We then\nperform comparisons with numerical relativity data of induced spins from\nhyperbolic encounters of initially nonrotating black holes, finding that the\nnext-to-next-to-leading order factorized expressions we derive are crucial to\nreproduce the data. An optimization on the initial conditions (energy, angular\nmomentum) is necessary for this, however, with differences of up to $9\\%$\nbetween the numerical and optimal initial data. Finally, we use our analytical\nexpressions to model possible astrophysical implications for black holes in\nglobular clusters.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}