{"id":"2408.11402","title":"Video Diffusion Models are Strong Video Inpainter","authors":"Minhyeok Lee, Suhwan Cho, Chajin Shin, Jungho Lee, Sunghun Yang,\n  Sangyoun Lee","authorsParsed":[["Lee","Minhyeok",""],["Cho","Suhwan",""],["Shin","Chajin",""],["Lee","Jungho",""],["Yang","Sunghun",""],["Lee","Sangyoun",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 08:01:00 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 05:46:43 GMT"}],"updateDate":"2024-09-04","timestamp":1724227260000,"abstract":"  Propagation-based video inpainting using optical flow at the pixel or feature\nlevel has recently garnered significant attention. However, it has limitations\nsuch as the inaccuracy of optical flow prediction and the propagation of noise\nover time. These issues result in non-uniform noise and time consistency\nproblems throughout the video, which are particularly pronounced when the\nremoved area is large and involves substantial movement. To address these\nissues, we propose a novel First Frame Filling Video Diffusion Inpainting model\n(FFF-VDI). We design FFF-VDI inspired by the capabilities of pre-trained\nimage-to-video diffusion models that can transform the first frame image into a\nhighly natural video. To apply this to the video inpainting task, we propagate\nthe noise latent information of future frames to fill the masked areas of the\nfirst frame's noise latent code. Next, we fine-tune the pre-trained\nimage-to-video diffusion model to generate the inpainted video. The proposed\nmodel addresses the limitations of existing methods that rely on optical flow\nquality, producing much more natural and temporally consistent videos. This\nproposed approach is the first to effectively integrate image-to-video\ndiffusion models into video inpainting tasks. Through various comparative\nexperiments, we demonstrate that the proposed model can robustly handle diverse\ninpainting types with high quality.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}