{"id":"2408.15312","title":"Constraints on the parameter space in dark matter admixed neutron stars","authors":"Ankit Kumar and Hajime Sotani","authorsParsed":[["Kumar","Ankit",""],["Sotani","Hajime",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 17:29:28 GMT"}],"updateDate":"2024-08-29","timestamp":1724779768000,"abstract":"  We investigate the impact of dark matter on neutron star properties using the\nrelativistic mean-field theory. By incorporating the dark matter model, we\nexplore how dark matter parameters, specifically dark matter mass and Fermi\nmomentum, influence nuclear saturation properties, the equation of state, and\nthe mass-radius relationship of neutron stars. We also examine the universal\nrelation between dimensionless tidal deformability and compactness in the\npresence of dark matter. Our results show that the inclusion of dark matter\nsignificantly alters nuclear saturation properties, leading to higher\nincompressibility and symmetry energy values. Notably, higher dark matter Fermi\nmomenta and masses result in more compact neutron star configurations with\nreduced radii and lower maximum masses, highlighting a complex interplay\nbetween dark matter and nuclear matter. Deviations from the universal relation\nare observed with dark matter inclusion, particularly for neutron stars with\nlower compactness. By leveraging observational data from PSR J0740+6620,\nGW170817, and Neutron star Interior Composition Explorer (NICER) measurements\nof PSR J0030+0451, we derive stringent constraints on dark matter parameter\nspace within neutron stars, emphasizing the necessity of integrating multimodal\nobservations to delineate the properties of dark matter along with neutron\nstars. Our findings underscore the importance of considering dark matter\neffects in neutron star modeling and suggest potential refinements for current\ntheoretical frameworks to accurately predict neutron star properties under\nvarious astrophysical conditions.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}