{"id":"2408.11038","title":"Multiple Topology Replica Exchange of Expanded Ensembles (MT-REXEE) for\n  Multidimensional Alchemical Calculations","authors":"Anika J. Friedman, Wei-Tse Hsu, Michael R. Shirts","authorsParsed":[["Friedman","Anika J.",""],["Hsu","Wei-Tse",""],["Shirts","Michael R.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 17:45:16 GMT"}],"updateDate":"2024-08-21","timestamp":1724175916000,"abstract":"  Relative free energy calculations are now widely used in academia and\nindustry, but the accuracy is often limited by poor sampling of the complexes\nconformational ensemble. To address this, we have developed a novel method\ntermed Multi-Topology Replica Exchange of Expanded Ensembles (MT-REXEE). This\nmethod enables parallel expanded ensemble calculations, facilitating iterative\nrelative free energy computations while allowing conformational exchange\nbetween parallel transformations. These iterative transformations are adaptable\nto any set of systems with a common backbone or central substructure. We\ndemonstrate that the MT-REXEE method maintains thermodynamic cycle closure to\nthe same extent as standard expanded ensemble for both solvation free energy\nand relative binding free energy. The transformations tested involve simple\nsystems that incorporate diverse heavy atoms and multi-site perturbations of a\nsmall molecule core resembling multi-site $\\lambda$ dynamics, without\nnecessitating modifications to the MD code, which in our initial implementation\nis GROMACS. We outline a systematic approach for topology set-up and provide\ninstructions on how to perform inter-replicate coordinate modifications. This\nwork shows that MT-REEXE can be used to perform accurate and reproducible free\nenergy estimates and prompts expansion to more complex test systems and other\nmolecular dynamics simulation infrastructures.\n","subjects":["Physics/Chemical Physics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}