{"id":"2408.13419","title":"Diffusion Driven Transient Hydrogenation in Metal Superhydrides at\n  Extreme Conditions","authors":"Yishan Zhou, Yunhua Fu, Meng Yang, Israel Osmond, Rajesh Jana, Takeshi\n  Nakagawa, Owen Moulding, Jonathan Buhot, Sven Friedemann, Dominique Laniel\n  and Thomas Meier","authorsParsed":[["Zhou","Yishan",""],["Fu","Yunhua",""],["Yang","Meng",""],["Osmond","Israel",""],["Jana","Rajesh",""],["Nakagawa","Takeshi",""],["Moulding","Owen",""],["Buhot","Jonathan",""],["Friedemann","Sven",""],["Laniel","Dominique",""],["Meier","Thomas",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 01:15:04 GMT"}],"updateDate":"2024-08-27","timestamp":1724462104000,"abstract":"  In recent years, metal hydride research has become one of the driving forces\nof the high-pressure community, as it is believed to hold the key to\nsuperconductivity close to ambient temperature. While numerous novel metal\nhydride compounds have been reported and extensively investigated for their\nsuperconducting properties, little attention has been focused on the atomic and\nelectronic states of hydrogen, the main ingredient in these novel compounds.\nHere, we present combined $^{1}H$- and $^{139}La$-NMR data on lanthanum\nsuperhydrides, $LaH_{x}$, ($x = 10.2 - 11.1$), synthesized after laser heating\nat pressures above 160 GPa. Strikingly, we found hydrogen to be in a highly\ndiffusive state at room temperature, with diffusion coefficients in the order\nof $10^{-6}~cm^2s^{-1}$. We found that this diffusive state of hydrogen results\nin a dynamic de-hydrogenation of the sample over the course of several weeks,\napproaching a composition similar to its precursor materials. Quantitative\nmeasurements demonstrate that the synthesized superhydrides continuously\ndecompose over time. Transport measurements underline this conclusion as\nsuperconducting critical temperatures were found to decrease significantly over\ntime as well. This observation sheds new light on formerly unanswered questions\non the long-term stability of metal superhydrides.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XGkyYVpZuvEdKSvqn0D-0GQHfcEfRWFzCflqPyJ3pJI","pdfSize":"2106661"}
