{"id":"2408.07704","title":"Empathic Responding for Digital Interpersonal Emotion Regulation via\n  Content Recommendation","authors":"Akriti Verma, Shama Islam, Valeh Moghaddam, Adnan Anwar, Sharon\n  Horwood","authorsParsed":[["Verma","Akriti",""],["Islam","Shama",""],["Moghaddam","Valeh",""],["Anwar","Adnan",""],["Horwood","Sharon",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 10:27:28 GMT"}],"updateDate":"2024-08-16","timestamp":1722853648000,"abstract":"  Interpersonal communication plays a key role in managing people's emotions,\nespecially on digital platforms. Studies have shown that people use social\nmedia and consume online content to regulate their emotions and find support\nfor rest and recovery. However, these platforms are not designed for emotion\nregulation, which limits their effectiveness in this regard. To address this\nissue, we propose an approach to enhance Interpersonal Emotion Regulation (IER)\non online platforms through content recommendation. The objective is to empower\nusers to regulate their emotions while actively or passively engaging in online\nplatforms by crafting media content that aligns with IER strategies,\nparticularly empathic responding. The proposed recommendation system is\nexpected to blend system-initiated and user-initiated emotion regulation,\npaving the way for real-time IER practices on digital media platforms. To\nassess the efficacy of this approach, a mixed-method research design is used,\nincluding the analysis of text-based social media data and a user survey.\nDigital applications has served as facilitators in this process, given the\nwidespread recognition of digital media applications for Digital Emotion\nRegulation (DER). The study collects 37.5K instances of user posts and\ninteractions on Reddit over a year to design a Contextual Multi-Armed Bandits\n(CMAB) based recommendation system using features from user activity and\npreferences. The experimentation shows that the empathic recommendations\ngenerated by the proposed recommendation system are preferred by users over\nwidely accepted ER strategies such as distraction and avoidance.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZMd5JNEiJ75bqIeeDdOhiNXjUS1NUcNB90RMYIbw56g","pdfSize":"619560"}
