{"id":"2408.17424","title":"CinePreGen: Camera Controllable Video Previsualization via\n  Engine-powered Diffusion","authors":"Yiran Chen, Anyi Rao, Xuekun Jiang, Shishi Xiao, Ruiqing Ma, Zeyu\n  Wang, Hui Xiong, Bo Dai","authorsParsed":[["Chen","Yiran",""],["Rao","Anyi",""],["Jiang","Xuekun",""],["Xiao","Shishi",""],["Ma","Ruiqing",""],["Wang","Zeyu",""],["Xiong","Hui",""],["Dai","Bo",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 17:16:18 GMT"}],"updateDate":"2024-09-02","timestamp":1725038178000,"abstract":"  With advancements in video generative AI models (e.g., SORA), creators are\nincreasingly using these techniques to enhance video previsualization. However,\nthey face challenges with incomplete and mismatched AI workflows. Existing\nmethods mainly rely on text descriptions and struggle with camera placement, a\nkey component of previsualization. To address these issues, we introduce\nCinePreGen, a visual previsualization system enhanced with engine-powered\ndiffusion. It features a novel camera and storyboard interface that offers\ndynamic control, from global to local camera adjustments. This is combined with\na user-friendly AI rendering workflow, which aims to achieve consistent results\nthrough multi-masked IP-Adapter and engine simulation guidelines. In our\ncomprehensive evaluation study, we demonstrate that our system reduces\ndevelopment viscosity (i.e., the complexity and challenges in the development\nprocess), meets users' needs for extensive control and iteration in the design\nprocess, and outperforms other AI video production workflows in cinematic\ncamera movement, as shown by our experiments and a within-subjects user study.\nWith its intuitive camera controls and realistic rendering of camera motion,\nCinePreGen shows great potential for improving video production for both\nindividual creators and industry professionals.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}