{"id":"2408.07477","title":"Ternary superhydrides under pressure of Anderson's theorem: Near-record\n  superconductivity in (La,Sc)H$_{12}$","authors":"Dmitrii V. Semenok, Ivan A. Troyan, Di Zhou, Andrei V. Sadakov, Kirill\n  S. Pervakov, Oleg A. Sobolevskiy, Anna G. Ivanova, Michele Galasso, Frederico\n  Gil Alabarse, Wuhao Chen, Chuanying Xi, Toni Helm, Sven Luther, Vladimir M.\n  Pudalov and Viktor V. Struzhkin","authorsParsed":[["Semenok","Dmitrii V.",""],["Troyan","Ivan A.",""],["Zhou","Di",""],["Sadakov","Andrei V.",""],["Pervakov","Kirill S.",""],["Sobolevskiy","Oleg A.",""],["Ivanova","Anna G.",""],["Galasso","Michele",""],["Alabarse","Frederico Gil",""],["Chen","Wuhao",""],["Xi","Chuanying",""],["Helm","Toni",""],["Luther","Sven",""],["Pudalov","Vladimir M.",""],["Struzhkin","Viktor V.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 11:47:28 GMT"}],"updateDate":"2024-08-15","timestamp":1723636048000,"abstract":"  Lanthanum-hydrogen system and its derivatives remain among the most promising\nfor achieving room-temperature superconductivity. In this study, we examined\nthe formation of ternary lanthanum-scandium superhydrides at pressures up to\n220 GPa. The primary product of the LaSc alloy's reaction with hydrogen is\nnewly discovered cubic (La,Sc)H$_{12}$, demonstrating clear superconducting\ntransition in all six channels of the van der Pauw scheme below 244-248 K. In\nthis compound with an unusually large unit cell volume, virtually no\nmagnetoresistance was observed in fields up to 68 Tesla. Synthesized samples of\n(La,Sc)H$_{12}$ demonstrate pronounced superconducting diode and SQUID-like\neffects at a record high temperature of 226 K. Furthermore, our analysis\nrevealed the formation of lower hexagonal polyhydrides (La,Sc)H$_{6-7}$, which\ncould potentially account for the anomaly in electrical resistance observed\nnear 274 K. This anomalous behavior may be of a superconducting nature, since\nlow-temperature diffraction studies indicate the absence of corresponding\nstructural phase transitions in La-Sc polyhydrides.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}