{"id":"2408.05603","title":"Linear polarization study of open clusters towards the anticenter\n  direction: Signature of the spiral arms","authors":"Namita Uppal, Shashikiran Ganesh, Vincent Pelgrims, Santosh Joshi,\n  Mrinmoy Sarkar","authorsParsed":[["Uppal","Namita",""],["Ganesh","Shashikiran",""],["Pelgrims","Vincent",""],["Joshi","Santosh",""],["Sarkar","Mrinmoy",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 17:39:28 GMT"}],"updateDate":"2024-08-13","timestamp":1723311568000,"abstract":"  Our objective is to investigate the distribution of dust and associated\nlarge-scale structures of the Galaxy using optical linear polarization\nmeasurements of various open clusters located at different distances in the\nGalactic anticenter direction. We present R-band linear polarization\nobservations of stars towards five open clusters: Kronberger~1, Berkeley~69,\nBerkeley~71, Berkeley~19, and King~8 in the anticenter direction. The\npolarization observations were carried out using AIMPOL instrument mounted on\nthe 104 cm Sampurnanand telescope of ARIES, Nainital, making it the first study\nto target the polarization observations towards distant clusters ($\\sim$6~kpc).\nWe combined the observed polarization data with the distance information from\nthe Gaia space telescope to infer the dust distribution along the line of\nsight. The variation in the degree of polarization and extinction with distance\nreveals the presence of multiple dust layers along each cluster direction. In\naddition, common foreground dust layers detected towards different cluster\ndirections highlight the presence of global features such as spiral arms. Our\nresults show that the dust clouds at 2~kpc towards Berkeley~69 and Berkeley~71\ncoincide with the Perseus arm, while the dust layer at $\\sim$4~kpc towards\ndistant clusters, Berkeley~19 and King~8, indicates the presence of the Outer\narm. The large-scale dust distribution obtained by combining our polarization\nresults with the previous polarization studies of nearby open clusters suggests\nthat the anticenter direction is characterized by low extinction, homogeneous\ndust distribution with somewhat uniform orientation of the plane-of-sky\ncomponent of the magnetic field along the line of sight. Our study demonstrates\nthe utility of polarization as a tool to study the large-scale dust\ndistribution.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}