{"id":"2408.02886","title":"Strain-modulated Intercalated Phases of Pb Monolayer with Dual\n  Periodicity in SiC(0001)-Graphene Interface","authors":"Lin-Lin Wang, Shen Chen, Marek Kolmer, Yong Han, Michael C. Tringides","authorsParsed":[["Wang","Lin-Lin",""],["Chen","Shen",""],["Kolmer","Marek",""],["Han","Yong",""],["Tringides","Michael C.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 01:31:48 GMT"}],"updateDate":"2024-08-07","timestamp":1722907908000,"abstract":"  Intercalation of metal atoms at the SiC(0001)-graphene (Gr) interface can\nprovide confined 2D metal layers with interesting properties. The intercalated\nPb monolayer (ML) has shown the coexistence of the Gr(10x10)-moire and a stripe\nphase, which still lacks understanding. Using density functional theory\ncalculation and thermal annealing with ab initio molecular dynamics, we have\nstudied the formation energy of SiC(0001)/Pb/Gr for different coverages of\nintercalated Pb. Near the coverage of a Pb(111)-like ML mimicking the\n(10x10)-moire, we find a slightly more stable stripe structure, where one half\nof the structure has compressive strain with Pb occupying the Si-top sites and\nthe other half has tensile strain with Pb off the Si-top sites. This stripe\nstructure along the Gr zigzag direction has a periodicity of 2.3 nm across the\n[1-210] direction agreeing with the previous observations using scanning\ntunneling microscopy. Analysis with electron density difference and density of\nstates show the tensile region has a more metallic character than the\ncompressive region, while both are dominated by the charge transfer from the Pb\nML to SiC(0001). The small energy difference between the stripe and\nPb(111)-like structures means the two phases are almost degenerate and can\ncoexist, which explains the experimental observations.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DYIsF2hcbDxwWL1j6vHd4SKzKZEBk7Eb3D9jBt0B8nM","pdfSize":"2935475"}
