{"id":"2408.16496","title":"An automated and time efficient framework for simulation of coronary\n  blood flow under steady and pulsatile conditions","authors":"Guido Nannini, Simone Saitta, Luca Mariani, Riccardo Maragna, Andrea\n  Baggiano, Saima Mushtaq, Gianluca Pontone, Alberto Redaelli","authorsParsed":[["Nannini","Guido",""],["Saitta","Simone",""],["Mariani","Luca",""],["Maragna","Riccardo",""],["Baggiano","Andrea",""],["Mushtaq","Saima",""],["Pontone","Gianluca",""],["Redaelli","Alberto",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 12:51:20 GMT"}],"updateDate":"2024-08-30","timestamp":1724935880000,"abstract":"  Fractional flow reserve (FFR) is the gold standard for diagnosing coronary\nartery disease (CAD). FFRCT uses computational fluid dynamics (CFD) to evaluate\nFFR non-invasively by simulating coronary flow in geometries reconstructed from\ncomputed tomography (CT). However, it faces challenges related to the cost of\ncomputing and uncertainties in defining patient-specific boundary conditions\n(BCs). We investigated using time-averaged steady BCs instead of pulsatile ones\nto reduce computational time and deployed a self-adjusting method for tuning\nBCs to patient clinical data. 133 coronary arteries were reconstructed from CT\nimages of CAD patients. For each vessel, invasive FFR was measured. Steady BCs\nfor CFD were defined in two steps: i) rest BCs were extrapolated from clinical\nand image-derived data; ii) hyperemic BCs were computed from resting\nconditions. Flow rate was iteratively adjusted during the simulation until\npatient aortic pressure was matched. Pulsatile BCs were defined using the\nconvergence values of steady BCs. Lesion-specific hemodynamic indexes were\ncomputed and compared between groups of patients indicated for surgery and\nthose not. The whole pipeline was implemented as a straightforward, fully\nautomated process. Steady and pulsatile FFRCT showed a strong correlation\n(r=0.988) and correlated with invasive FFR (r=0.797). The per-point difference\nbetween the pressure and FFRCT field predicted by the two methods was below\n0.01 and 0.02, respectively. Both approaches exhibited good diagnostic\nperformance: accuracy was 0.860 and 0.864, with AUCs of 0.923 and 0.912, for\nsteady and pulsatile cases, respectively. Computational time for steady BCs CFD\nwas approximately 30-fold lower than for the pulsatile case. This work\ndemonstrates the feasibility of using steady BCs CFD for computing FFRCT in\ncoronary arteries and its performance in a fully automated pipeline.\n","subjects":["Physics/Medical Physics","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}