{"id":"2408.00507","title":"Spatial Weather, Socio-Economic and Political Risks in Probabilistic\n  Load Forecasting","authors":"Monika Zimmermann and Florian Ziel","authorsParsed":[["Zimmermann","Monika",""],["Ziel","Florian",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 12:28:15 GMT"}],"updateDate":"2024-08-02","timestamp":1722515295000,"abstract":"  Accurate forecasts of the impact of spatial weather and pan-European\nsocio-economic and political risks on hourly electricity demand for the\nmid-term horizon are crucial for strategic decision-making amidst the inherent\nuncertainty. Most importantly, these forecasts are essential for the\noperational management of power plants, ensuring supply security and grid\nstability, and in guiding energy trading and investment decisions. The primary\nchallenge for this forecasting task lies in disentangling the multifaceted\ndrivers of load, which include national deterministic (daily, weekly, annual,\nand holiday patterns) and national stochastic weather and autoregressive\neffects. Additionally, transnational stochastic socio-economic and political\neffects add further complexity, in particular, due to their non-stationarity.\nTo address this challenge, we present an interpretable probabilistic mid-term\nforecasting model for the hourly load that captures, besides all deterministic\neffects, the various uncertainties in load. This model recognizes transnational\ndependencies across 24 European countries, with multivariate modeled\nsocio-economic and political states and cross-country dependent forecasting.\nBuilt from interpretable Generalized Additive Models (GAMs), the model enables\nan analysis of the transmission of each incorporated effect to the\nhour-specific load. Our findings highlight the vulnerability of countries\nreliant on electric heating under extreme weather scenarios. This emphasizes\nthe need for high-resolution forecasting of weather effects on pan-European\nelectricity consumption especially in anticipation of widespread electric\nheating adoption.\n","subjects":["Statistics/Applications","Computing Research Repository/Computational Engineering, Finance, and Science","Economics/General Economics","Quantitative Finance/Economics","Quantitative Finance/Risk Management","Statistics/Computation"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}