{"id":"2408.05183","title":"Uncontrolled learning: co-design of neuromorphic hardware topology for\n  neuromorphic algorithms","authors":"Frank Barrows, Jonathan Lin, Francesco Caravelli, Dante R. Chialvo","authorsParsed":[["Barrows","Frank",""],["Lin","Jonathan",""],["Caravelli","Francesco",""],["Chialvo","Dante R.",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 17:13:39 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 16:57:45 GMT"}],"updateDate":"2024-08-14","timestamp":1723223619000,"abstract":"  Hardware-based neuromorphic computing remains an elusive goal with the\npotential to profoundly impact future technologies and deepen our understanding\nof emergent intelligence. The learning-from-mistakes algorithm is one of the\nfew training algorithms inspired by the brain's simple learning rules,\nutilizing inhibition and pruning to demonstrate self-organized learning. Here\nwe implement this algorithm in purely neuromorphic memristive hardware through\na co-design process. This implementation requires evaluating hardware\ntrade-offs and constraints. It has been shown that learning-from-mistakes\nsuccessfully trains small networks to function as binary classifiers and\nperceptrons. However, without tailoring the hardware to the algorithm,\nperformance decreases exponentially as the network size increases. When\nimplementing neuromorphic algorithms on neuromorphic hardware, we investigate\nthe trade-offs between depth, controllability, and capacity, the latter being\nthe number of learnable patterns. We emphasize the significance of topology and\nthe use of governing equations, demonstrating theoretical tools to aid in the\nco-design of neuromorphic hardware and algorithms. We provide quantitative\ntechniques to evaluate the computational capacity of a neuromorphic device\nbased on the measurements performed and the underlying circuit structure. This\napproach shows that breaking the symmetry of a neural network can increase both\nthe controllability and average network capacity. By pruning the circuit,\nneuromorphic algorithms in all-memristive device circuits leverage stochastic\nresources to drive local contrast in network weights. Our combined experimental\nand simulation efforts explore the parameters that make a network suited for\ndisplaying emergent intelligence from simple rules.\n","subjects":["Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Statistical Mechanics","Computing Research Repository/Hardware Architecture","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wiv3dafyhefllsa4oj442Homi9a2SLONcLRp7yEBgzQ","pdfSize":"30752318"}
