{"id":"2408.05751","title":"Advancing Re-Ranking with Multimodal Fusion and Target-Oriented\n  Auxiliary Tasks in E-Commerce Search","authors":"Enqiang Xu, Xinhui Li, Zhigong Zhou, Jiahao Ji, Jinyuan Zhao, Dadong\n  Miao, Songlin Wang, Lin Liu, Sulong Xu","authorsParsed":[["Xu","Enqiang",""],["Li","Xinhui",""],["Zhou","Zhigong",""],["Ji","Jiahao",""],["Zhao","Jinyuan",""],["Miao","Dadong",""],["Wang","Songlin",""],["Liu","Lin",""],["Xu","Sulong",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 11:46:21 GMT"}],"updateDate":"2024-08-13","timestamp":1723376781000,"abstract":"  In the rapidly evolving field of e-commerce, the effectiveness of search\nre-ranking models is crucial for enhancing user experience and driving\nconversion rates. Despite significant advancements in feature representation\nand model architecture, the integration of multimodal information remains\nunderexplored. This study addresses this gap by investigating the computation\nand fusion of textual and visual information in the context of re-ranking. We\npropose \\textbf{A}dvancing \\textbf{R}e-Ranking with\n\\textbf{M}ulti\\textbf{m}odal Fusion and \\textbf{T}arget-Oriented Auxiliary\nTasks (ARMMT), which integrates an attention-based multimodal fusion technique\nand an auxiliary ranking-aligned task to enhance item representation and\nimprove targeting capabilities. This method not only enriches the understanding\nof product attributes but also enables more precise and personalized\nrecommendations. Experimental evaluations on JD.com's search platform\ndemonstrate that ARMMT achieves state-of-the-art performance in multimodal\ninformation integration, evidenced by a 0.22\\% increase in the Conversion Rate\n(CVR), significantly contributing to Gross Merchandise Volume (GMV). This\npioneering approach has the potential to revolutionize e-commerce re-ranking,\nleading to elevated user satisfaction and business growth.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}