{"id":"2408.15027","title":"European Quantum Ecosystems -- Preparing the Industry for the Quantum\n  Security and Communications Revolution","authors":"Noel Farrugia, Daniel Bonanno, Nicholas Frendo, Andr\\'e Xuereb,\n  Evangelos Kosmatos, Alexandros Stavdas, Marco Russo, Bartolomeo Montrucchio,\n  Marco Menchetti, Davide Bacco, Silvia Marigonda, Francesco Stocco, Guglielmo\n  Morgari and Antonio Manzalini","authorsParsed":[["Farrugia","Noel",""],["Bonanno","Daniel",""],["Frendo","Nicholas",""],["Xuereb","André",""],["Kosmatos","Evangelos",""],["Stavdas","Alexandros",""],["Russo","Marco",""],["Montrucchio","Bartolomeo",""],["Menchetti","Marco",""],["Bacco","Davide",""],["Marigonda","Silvia",""],["Stocco","Francesco",""],["Morgari","Guglielmo",""],["Manzalini","Antonio",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 12:56:13 GMT"}],"updateDate":"2024-08-28","timestamp":1724763373000,"abstract":"  There is mounting evidence that a second quantum revolution based on the\ntechnological capabilities to detect and manipulate single quantum particles\n(e.g., electrons, photons, ions, etc), a feat not achieved during the first\nquantum revolution, is progressing fast. It is expected that in less than 10\nyears, this second quantum revolution shall have a significant impact over\nnumerous industries, including finance, medicine, energy, transportation, etc.\nQuantum computers threaten the status quo of cybersecurity, due to known\nquantum algorithms that can break asymmetric encryption, which is what gives us\nthe ability to communicate securely using a public channel. Considering the\nworld's dependence on digital communication through data exchange and\nprocessing, retaining the ability to communicate securely even once quantum\ncomputers come into play, cannot be stressed enough. Two solutions are\navailable: Quantum Key Distribution (QKD) and Post-Quantum Cryptography (PQC);\nwhich, we emphasise, are not mutually exclusive. The EuroQCI initiative, of\nwhich EQUO is a part of, focuses on QKD and aims to build a network whereby EU\ncountries can communicate securely through QKD. To this aim, the DEP (Digital\nEurope Programme) project aims to bring technological matureness to QKD by\ndeploying a QKD test network and, through this exercise, understand what is\nlacking from an operator's point of view when the time to integrate QKD in\ntheir network comes.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Emerging Technologies","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}