{"id":"2408.01070","title":"Single photon emitters in monolayer semiconductors coupled to transition\n  metal dichalcogenide nanoantennas on silica and gold substrates","authors":"Panaiot G. Zotev, Sam A. Randerson, Xuerong Hu, Yue Wang, Alexander I.\n  Tartakovskii","authorsParsed":[["Zotev","Panaiot G.",""],["Randerson","Sam A.",""],["Hu","Xuerong",""],["Wang","Yue",""],["Tartakovskii","Alexander I.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 07:44:29 GMT"}],"updateDate":"2024-08-05","timestamp":1722584669000,"abstract":"  Transition metal dichalcogenide (TMD) single photon emitters (SPEs) offer\nnumerous advantages to quantum information applications, such as high single\nphoton purity and deterministic positioning. Strain in the host monolayer,\ninduced by underlying dielectric Mie resonators, is known to localize their\nformation to positions co-located with near-field photonic hotspots providing\nfurther control over their optical properties. However, traditional materials\nused for the fabrication of nanoresonators, such as silicon or gallium\nphosphide (GaP), often require a high refractive index substrate resulting in\nlosses of the emitted light and limited photonic enhancement. Here, we use\nnanoantennas (NAs) fabricated from multilayer TMDs, which allow complete\nflexibility with the choice of substrate due to the adhesive van der Waals\nforces, enabling high refractive index contrast or the use of highly reflective\nmetallic surfaces. We demonstrate the localized formation of SPEs in WSe$_2$\nmonolayers transferred onto WS$_2$ NAs on both SiO$_2$ and Au substrates,\nenabling strong photonic enhancements and increased single photon collection.\nWe provide evidence for enhanced quantum efficiencies (QE) reaching an average\nvalue of 43% (7%) for SPEs on WS$_2$ NAs on a SiO$_2$ (Au) substrate. We\nfurther combine the advantages offered by both dielectric and metallic\nsubstrates to numerically simulate an optimized NA geometry for maximum WSe$_2$\nsingle photon excitation, emission, collection. Thus, the fluorescence is\nenhanced by a factor of over 4 orders of magnitude compared to vacuum and 5\norders of magnitude compared to a flat SiO$_2$/Si surface. Our work showcases\nthe advantages offered by employing TMD material nanoresonators on various\nsubstrates for SPE formation and photonic enhancement.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Optics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IFrQsS8X0hqOjnHTjim3Kz4NM1cwrVqybRse5BKgRzg","pdfSize":"7458466"}
