{"id":"2408.00229","title":"Invariant Discovery of Features Across Multiple Length Scales:\n  Applications in Microscopy and Autonomous Materials Characterization","authors":"Aditya Raghavan, Utkarsh Pratiush, Mani Valleti, Richard Liu, Reece\n  Emery, Hiroshi Funakubo, Yongtao Liu, Philip Rack, Sergei Kalinin","authorsParsed":[["Raghavan","Aditya",""],["Pratiush","Utkarsh",""],["Valleti","Mani",""],["Liu","Richard",""],["Emery","Reece",""],["Funakubo","Hiroshi",""],["Liu","Yongtao",""],["Rack","Philip",""],["Kalinin","Sergei",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 01:48:46 GMT"}],"updateDate":"2024-08-02","timestamp":1722476926000,"abstract":"  Physical imaging is a foundational characterization method in areas from\ncondensed matter physics and chemistry to astronomy and spans length scales\nfrom atomic to universe. Images encapsulate crucial data regarding atomic\nbonding, materials microstructures, and dynamic phenomena such as\nmicrostructural evolution and turbulence, among other phenomena. The challenge\nlies in effectively extracting and interpreting this information. Variational\nAutoencoders (VAEs) have emerged as powerful tools for identifying underlying\nfactors of variation in image data, providing a systematic approach to\ndistilling meaningful patterns from complex datasets. However, a significant\nhurdle in their application is the definition and selection of appropriate\ndescriptors reflecting local structure. Here we introduce the scale-invariant\nVAE approach (SI-VAE) based on the progressive training of the VAE with the\ndescriptors sampled at different length scales. The SI-VAE allows the discovery\nof the length scale dependent factors of variation in the system. Here, we\nillustrate this approach using the ferroelectric domain images and generalize\nit to the movies of the electron-beam induced phenomena in graphene and\ntopography evolution across combinatorial libraries. This approach can further\nbe used to initialize the decision making in automated experiments including\nstructure-property discovery and can be applied across a broad range of imaging\nmethods. This approach is universal and can be applied to any spatially\nresolved data including both experimental imaging studies and simulations, and\ncan be particularly useful for exploration of phenomena such as turbulence,\nscale-invariant transformation fronts, etc.\n","subjects":["Physics/Computational Physics","Condensed Matter/Materials Science","Computing Research Repository/Machine Learning","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}