{"id":"2408.08597","title":"Breaking the cosmological invariance of the dark matter halos shape as a\n  new probe of modified gravity theory","authors":"Remy Koskas, Jean-Michel Alimi","authorsParsed":[["Koskas","Remy",""],["Alimi","Jean-Michel",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 08:19:36 GMT"}],"updateDate":"2024-08-19","timestamp":1723796376000,"abstract":"  In a recent paper in Astronomy & Astrophysics, Alimi & Koskas (2024) have\nhighlighted in wCDM models derived from general relativity (with Dark Energy\nUniverse numerical simulation data), a cosmological invariance of the\ndistribution of dark matter (DM) halo shapes when expressed in terms of the\nnon-linear fluctuations of the cosmic matter field. We show in this paper that\nthis invariance persists when tested on numerical simulations performed with a\ndifferent code, i.e. a different N-body solver, DUSTGRAIN-pathfinder simulation\n(Giocoli et al. 2018) and that it is also robust to the addition of neutrinos\nto the cold component of dark matter. However, this discovery raises crucial\nquestions about the validity of this invariance in modified gravity models.\nThus, we examine whether the invariance observed by Alimi & Koskas (2024)\nremains robust in the case of Hu & Sawicki models of modified gravity using\nnumerical simulations performed by Giocoli et al. (2018). By comparing the\nresults of advanced numerical simulations in these different theoretical\nframeworks, we found significant deviations from the invariance observed in the\nframework of wCDM models of GR. These deviations suggest that the nature of the\ngravitation significantly influences the shape of the DM halos. We then\ninterpret this deviation observed in the modified gravity models from the GR\nmodels as due to the scalar-field screening effect corresponding to such\nf(R)-type theories. This one modifies the sphericalization process of DM halos\nduring their formation, precisely because the critical mass at which this\nscalar field becomes non-negligible is the mass at which the deviation appears.\nTo this extent, the deviation from cosmological invariance in the shape of DM\nhalos is a cosmological probe of the nature of gravity, and the mass scale at\nwhich it appears can be used to estimate the $f_{R0}$ parameter of such\ntheories.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/"}