{"id":"2408.00388","title":"Deepfake Media Forensics: State of the Art and Challenges Ahead","authors":"Irene Amerini, Mauro Barni, Sebastiano Battiato, Paolo Bestagini,\n  Giulia Boato, Tania Sari Bonaventura, Vittoria Bruni, Roberto Caldelli,\n  Francesco De Natale, Rocco De Nicola, Luca Guarnera, Sara Mandelli, Gian Luca\n  Marcialis, Marco Micheletto, Andrea Montibeller, Giulia Orru', Alessandro\n  Ortis, Pericle Perazzo, Giovanni Puglisi, Davide Salvi, Stefano Tubaro,\n  Claudia Melis Tonti, Massimo Villari, Domenico Vitulano","authorsParsed":[["Amerini","Irene",""],["Barni","Mauro",""],["Battiato","Sebastiano",""],["Bestagini","Paolo",""],["Boato","Giulia",""],["Bonaventura","Tania Sari",""],["Bruni","Vittoria",""],["Caldelli","Roberto",""],["De Natale","Francesco",""],["De Nicola","Rocco",""],["Guarnera","Luca",""],["Mandelli","Sara",""],["Marcialis","Gian Luca",""],["Micheletto","Marco",""],["Montibeller","Andrea",""],["Orru'","Giulia",""],["Ortis","Alessandro",""],["Perazzo","Pericle",""],["Puglisi","Giovanni",""],["Salvi","Davide",""],["Tubaro","Stefano",""],["Tonti","Claudia Melis",""],["Villari","Massimo",""],["Vitulano","Domenico",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 08:57:47 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 15:10:20 GMT"}],"updateDate":"2024-08-14","timestamp":1722502667000,"abstract":"  AI-generated synthetic media, also called Deepfakes, have significantly\ninfluenced so many domains, from entertainment to cybersecurity. Generative\nAdversarial Networks (GANs) and Diffusion Models (DMs) are the main frameworks\nused to create Deepfakes, producing highly realistic yet fabricated content.\nWhile these technologies open up new creative possibilities, they also bring\nsubstantial ethical and security risks due to their potential misuse. The rise\nof such advanced media has led to the development of a cognitive bias known as\nImpostor Bias, where individuals doubt the authenticity of multimedia due to\nthe awareness of AI's capabilities. As a result, Deepfake detection has become\na vital area of research, focusing on identifying subtle inconsistencies and\nartifacts with machine learning techniques, especially Convolutional Neural\nNetworks (CNNs). Research in forensic Deepfake technology encompasses five main\nareas: detection, attribution and recognition, passive authentication,\ndetection in realistic scenarios, and active authentication. This paper reviews\nthe primary algorithms that address these challenges, examining their\nadvantages, limitations, and future prospects.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}