{"id":"2408.03821","title":"The Biot stress -- right stretch relation for the compressible\n  Neo-Hooke-Ciarlet-Geymonat model and Rivlin's cube problem","authors":"Ionel-Dumitrel Ghiba and Franz Gmeineder and Sebastian Holthausen and\n  Robert J. Martin and Patrizio Neff","authorsParsed":[["Ghiba","Ionel-Dumitrel",""],["Gmeineder","Franz",""],["Holthausen","Sebastian",""],["Martin","Robert J.",""],["Neff","Patrizio",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 14:55:36 GMT"}],"updateDate":"2024-08-08","timestamp":1723042536000,"abstract":"  The aim of the paper is to recall the importance of the study of\ninvertibility and monotonicity of stress-strain relations for investigating the\nnon-uniqueness and bifurcation of homogeneous solutions of the equilibrium\nproblem of a hyperelastic cube subjected to equiaxial tensile forces. In other\nwords, we reconsider a remarkable possibility in this nonlinear scenario: Does\nsymmetric loading lead only to symmetric deformations or also to asymmetric\ndeformations? If so, what can we say about monotonicity for these homogeneous\nsolutions, a property which is less restrictive than the energetic stability\ncriteria of homogeneous solutions for Rivlin's cube problem. For the Neo-Hooke\ntype materials we establish what properties the volumetric function $h$\ndepending on ${\\rm det}\\, F$ must have to ensure the existence of a unique\nradial solution (i.e. the cube must continue to remain a cube) for any\nmagnitude of radial stress acting on the cube. The function $h$ proposed by\nCiarlet and Geymonat satisfies these conditions. However, discontinuous\nequilibrium trajectories may occur, characterized by abruptly appearing\nnon-symmetric deformations with increasing load, and a cube can instantaneously\nbecome a parallelepiped. Up to the load value for which the bifurcation in the\nradial solution is realized local monotonicity holds true. However, after\nexceeding this value, monotonicity no longer occurs on homogeneous deformations\nwhich, in turn, preserve the cube shape.\n","subjects":["Mathematics/Analysis of PDEs","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}