{"id":"2408.12708","title":"Revisiting Cross-Domain Problem for LiDAR-based 3D Object Detection","authors":"Ruixiao Zhang, Juheon Lee, Xiaohao Cai, and Adam Prugel-Bennett","authorsParsed":[["Zhang","Ruixiao",""],["Lee","Juheon",""],["Cai","Xiaohao",""],["Prugel-Bennett","Adam",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 19:52:44 GMT"}],"updateDate":"2024-08-26","timestamp":1724356364000,"abstract":"  Deep learning models such as convolutional neural networks and transformers\nhave been widely applied to solve 3D object detection problems in the domain of\nautonomous driving. While existing models have achieved outstanding performance\non most open benchmarks, the generalization ability of these deep networks is\nstill in doubt. To adapt models to other domains including different cities,\ncountries, and weather, retraining with the target domain data is currently\nnecessary, which hinders the wide application of autonomous driving. In this\npaper, we deeply analyze the cross-domain performance of the state-of-the-art\nmodels. We observe that most models will overfit the training domains and it is\nchallenging to adapt them to other domains directly. Existing domain adaptation\nmethods for 3D object detection problems are actually shifting the models'\nknowledge domain instead of improving their generalization ability. We then\npropose additional evaluation metrics -- the side-view and front-view AP -- to\nbetter analyze the core issues of the methods' heavy drops in accuracy levels.\nBy using the proposed metrics and further evaluating the cross-domain\nperformance in each dimension, we conclude that the overfitting problem happens\nmore obviously on the front-view surface and the width dimension which usually\nfaces the sensor and has more 3D points surrounding it. Meanwhile, our\nexperiments indicate that the density of the point cloud data also\nsignificantly influences the models' cross-domain performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}