{"id":"2408.10173","title":"Fringing analysis and forward modeling of Keck Planet Imager and\n  Characterizer (KPIC) spectra","authors":"Katelyn A. Horstman, Jean-Baptiste Ruffio, Jason J. Wang, Chih-Chun\n  Hsu, Ashley Baker, Luke Finnerty, Jerry Xuan, Daniel Echeverri, Dimitri\n  Mawet, Geoffrey A. Blake, Randall Bartos, Charlotte Z. Bond, Benjamin Calvin,\n  Sylvain Cetre, Jacques-Robert Delorme, Greg Doppmann, Michael P. Fitzgerald,\n  Nemanja Jovanovic, Ronald Lopez, Emily C. Martin, Evan Morris, Jacklyn\n  Pezzato, Garreth Ruane, Ben Sappey, Tobias Schofield, Andrew Skemer, Taylor\n  Venenciano, J. Kent Wallace, Ji Wang, and Peter Wizinowich","authorsParsed":[["Horstman","Katelyn A.",""],["Ruffio","Jean-Baptiste",""],["Wang","Jason J.",""],["Hsu","Chih-Chun",""],["Baker","Ashley",""],["Finnerty","Luke",""],["Xuan","Jerry",""],["Echeverri","Daniel",""],["Mawet","Dimitri",""],["Blake","Geoffrey A.",""],["Bartos","Randall",""],["Bond","Charlotte Z.",""],["Calvin","Benjamin",""],["Cetre","Sylvain",""],["Delorme","Jacques-Robert",""],["Doppmann","Greg",""],["Fitzgerald","Michael P.",""],["Jovanovic","Nemanja",""],["Lopez","Ronald",""],["Martin","Emily C.",""],["Morris","Evan",""],["Pezzato","Jacklyn",""],["Ruane","Garreth",""],["Sappey","Ben",""],["Schofield","Tobias",""],["Skemer","Andrew",""],["Venenciano","Taylor",""],["Wallace","J. Kent",""],["Wang","Ji",""],["Wizinowich","Peter",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 17:27:24 GMT"}],"updateDate":"2024-08-20","timestamp":1724088444000,"abstract":"  The Keck Planet Imager and Characterizer (KPIC) combines high contrast\nimaging with high resolution spectroscopy (R$\\sim$35,000 in K band) to study\ndirectly imaged exoplanets and brown dwarfs in unprecedented detail. KPIC aims\nto spectrally characterize substellar companions through measurements of\nplanetary radial velocities, spins, and atmospheric composition. Currently, the\ndominant source of systematic noise for KPIC is fringing, or oscillations in\nthe spectrum as a function of wavelength. The fringing signal can dominate\nresiduals by up to 10% of the continuum for high S/N exposures, preventing\naccurate wavelength calibration, retrieval of atmospheric parameters, and\ndetection of planets with flux ratios less than 1% of the host star. To combat\ncontamination from fringing, we first identify its three unique sources and\nadopt a physically informed model of Fabry-P\\'{e}rot cavities to apply to\npost-processed data. We find this strategy can effectively model the fringing\nin observations of A0V/F0V stars, reducing the residual systematics caused by\nfringing by a factor of 2. Next, we wedge two of the transmissive optics\ninternal to KPIC to eliminate two sources of fringing and confirm the third\nsource as the entrance window to the spectrograph. Finally, we apply our\nprevious model of the Fabry-P\\'{e}rot cavity to new data taken with the wedged\noptics to reduce the amplitude of the residuals by a factor of 10.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4pACeqb62RR9KqOAv62_zilE3D_uwIpoMktqL8g-XHw","pdfSize":"1892093"}
