{"id":"2408.01640","title":"Leveraging GNSS and Onboard Visual Data from Consumer Vehicles for\n  Robust Road Network Estimation","authors":"Bal\\'azs Opra, Betty Le Dem, Jeffrey M. Walls, Dimitar Lukarski and\n  Cyrill Stachniss","authorsParsed":[["Opra","Balázs",""],["Dem","Betty Le",""],["Walls","Jeffrey M.",""],["Lukarski","Dimitar",""],["Stachniss","Cyrill",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 02:57:37 GMT"}],"updateDate":"2024-08-06","timestamp":1722653857000,"abstract":"  Maps are essential for diverse applications, such as vehicle navigation and\nautonomous robotics. Both require spatial models for effective route planning\nand localization. This paper addresses the challenge of road graph construction\nfor autonomous vehicles. Despite recent advances, creating a road graph remains\nlabor-intensive and has yet to achieve full automation. The goal of this paper\nis to generate such graphs automatically and accurately. Modern cars are\nequipped with onboard sensors used for today's advanced driver assistance\nsystems like lane keeping. We propose using global navigation satellite system\n(GNSS) traces and basic image data acquired from these standard sensors in\nconsumer vehicles to estimate road-level maps with minimal effort. We exploit\nthe spatial information in the data by framing the problem as a road centerline\nsemantic segmentation task using a convolutional neural network. We also\nutilize the data's time series nature to refine the neural network's output by\nusing map matching. We implemented and evaluated our method using a fleet of\nreal consumer vehicles, only using the deployed onboard sensors. Our evaluation\ndemonstrates that our approach not only matches existing methods on simpler\nroad configurations but also significantly outperforms them on more complex\nroad geometries and topologies. This work received the 2023 Woven by Toyota\nInvention Award.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"MCJfLZsS0dfBecl0KqFGJD9OzZLWlzJJjy3dImvhGPk","pdfSize":"10663413"}
