{"id":"2408.14095","title":"Morphology of molecular clouds at kiloparsec scale in the Milky Way:\n  Shear-induced alignment and vertical confinement","authors":"Yi-Heng Xie, Guang-Xing Li, Bing-Qiu Chen","authorsParsed":[["Xie","Yi-Heng",""],["Li","Guang-Xing",""],["Chen","Bing-Qiu",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 08:35:27 GMT"}],"updateDate":"2024-08-27","timestamp":1724661327000,"abstract":"  The shape of the cold interstellar molecular gas is determined by several\nprocesses, including self-gravity, tidal force, turbulence, magnetic field, and\ngalactic shear. Based on the 3D dust extinction map derived by Vergely et al.,\nwe identify a sample of 550 molecular clouds (MCs) within $3\\hspace{0.2em}\\rm\nkpc$ of the solar vicinity in the Galactic disk. Our sample contains clouds\nwhose size ranges from pc to kiloparsec, which enables us to study the effect\nof Galactic-scale processes, such as shear, on cloud evolution. We find that\nour sample clouds follow a power-law mass-size relation of $M\\propto\n32.00\\hspace{0.2em}{R_{\\rm{max}}}^{1.77}$, $M\\propto\n20.59\\hspace{0.2em}{R_S}^{2.04}$ and $M\\propto\n14.41\\hspace{0.2em}{R_V}^{2.29}$, where $R_{\\rm{max}}$ is the major axis-based\ncloud radius, $R_S$ is the area-based radius, and $R_V$ is the volume-based\nradius, respectively. These clouds have a mean constant surface density of\n$\\sim 7 \\hspace{0.2em} \\rm {M_{\\odot}pc^{-2}}$, and follow a volume\ndensity-size relation of $\\rho \\propto\n2.60\\hspace{0.2em}{R_{\\rm{max}}}^{-0.55}$. As cloud size increases, their\nshapes gradually transition from ellipsoidal to disk-like to bar-like\nstructures. Large clouds tend to have a pitch angle of $28^{\\circ} -\n45^{\\circ}$, where the angle is measured concerning the Galactic tangential\ndirection. These giant clouds also tend to stay parallel to the Galactic disk\nplane and are confined within the Galactic molecular gas disk. Our results show\nthat large molecular clouds in the Milky Way can be shaped by Galactic shear\nand confined in the vertical direction by gravity.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}