{"id":"2408.12283","title":"On the convergence of higher order finite element methods for nonlinear\n  magnetostatics","authors":"Herbert Egger and Felix Engertsberger and Bogdan Radu","authorsParsed":[["Egger","Herbert",""],["Engertsberger","Felix",""],["Radu","Bogdan",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 10:39:37 GMT"}],"updateDate":"2024-08-23","timestamp":1724323177000,"abstract":"  The modeling of electric machines and power transformers typically involves\nsystems of nonlinear magnetostatics or -quasistatics, and their efficient and\naccurate simulation is required for the reliable design, control, and\noptimization of such devices. We study the numerical solution of the vector\npotential formulation of nonlinear magnetostatics by means of higher-order\nfinite element methods. Numerical quadrature is used for the efficient handling\nof the nonlinearities and domain mappings are employed for the consideration of\ncurved boundaries. The existence of a unique solution is proven on the\ncontinuous and discrete level and a full convergence analysis of the resulting\nfinite element schemes is presented indicating order optimal convergence rates\nunder appropriate smoothness assumptions. For the solution of the nonlinear\ndiscretized problems, we consider a Newton method with line search for which we\nestablish global linear convergence with convergence rates that are independent\nof the discretization parameters. We further prove local quadratic convergence\nin a mesh-dependent neighborhood of the solution which becomes effective when\nhigh accuracy of the nonlinear solver is demanded. The assumptions required for\nour analysis cover inhomogeneous, nonlinear, and anisotropic materials, which\nmay arise in typical applications, including the presence of permanent magnets.\nThe theoretical results are illustrated by numerical tests for some typical\nbenchmark problems.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DwybqbObyjLz_foYfhM0Ug_Xpn3NIav_BRS4xPfDJdk","pdfSize":"1762406"}
