{"id":"2408.12062","title":"Enhancing Sampling Protocol for Robust Point Cloud Classification","authors":"Chongshou Li, Pin Tang, Xinke Li, Tianrui Li","authorsParsed":[["Li","Chongshou",""],["Tang","Pin",""],["Li","Xinke",""],["Li","Tianrui",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 01:48:31 GMT"}],"updateDate":"2024-08-23","timestamp":1724291311000,"abstract":"  Established sampling protocols for 3D point cloud learning, such as Farthest\nPoint Sampling (FPS) and Fixed Sample Size (FSS), have long been recognized and\nutilized. However, real-world data often suffer from corrputions such as sensor\nnoise, which violates the benignness assumption of point cloud in current\nprotocols. Consequently, they are notably vulnerable to noise, posing\nsignificant safety risks in critical applications like autonomous driving. To\naddress these issues, we propose an enhanced point cloud sampling protocol,\nPointDR, which comprises two components: 1) Downsampling for key point\nidentification and 2) Resampling for flexible sample size. Furthermore,\ndifferentiated strategies are implemented for training and inference processes.\nParticularly, an isolation-rated weight considering local density is designed\nfor the downsampling method, assisting it in performing random key points\nselection in the training phase and bypassing noise in the inference phase. A\nlocal-geometry-preserved upsampling is incorporated into resampling,\nfacilitating it to maintain a stochastic sample size in the training stage and\ncomplete insufficient data in the inference. It is crucial to note that the\nproposed protocol is free of model architecture altering and extra learning,\nthus minimal efforts are demanded for its replacement of the existing one.\nDespite the simplicity, it substantially improves the robustness of point cloud\nlearning, showcased by outperforming the state-of-the-art methods on multiple\nbenchmarks of corrupted point cloud classification. The code will be available\nupon the paper's acceptance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"CQPvDxArjqEwoljANzU8KlaFKQPy-FmT-FB4ia1ZrHk","pdfSize":"6757870"}
