{"id":"2408.15922","title":"DiffAge3D: Diffusion-based 3D-aware Face Aging","authors":"Junaid Wahid, Fangneng Zhan, Pramod Rao, Christian Theobalt","authorsParsed":[["Wahid","Junaid",""],["Zhan","Fangneng",""],["Rao","Pramod",""],["Theobalt","Christian",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 16:36:09 GMT"}],"updateDate":"2024-08-29","timestamp":1724862969000,"abstract":"  Face aging is the process of converting an individual's appearance to a\nyounger or older version of themselves. Existing face aging techniques have\nbeen limited to 2D settings, which often weaken their applications as there is\na growing demand for 3D face modeling. Moreover, existing aging methods\nstruggle to perform faithful aging, maintain identity, and retain the fine\ndetails of the input images. Given these limitations and the need for a\n3D-aware aging method, we propose DiffAge3D, the first 3D-aware aging framework\nthat not only performs faithful aging and identity preservation but also\noperates in a 3D setting. Our aging framework allows to model the aging and\ncamera pose separately by only taking a single image with a target age. Our\nframework includes a robust 3D-aware aging dataset generation pipeline by\nutilizing a pre-trained 3D GAN and the rich text embedding capabilities within\nCLIP model. Notably, we do not employ any inversion bottleneck in dataset\ngeneration. Instead, we randomly generate training samples from the latent\nspace of 3D GAN, allowing us to manipulate the rich latent space of GAN to\ngenerate ages even with large gaps. With the generated dataset, we train a\nviewpoint-aware diffusion-based aging model to control the camera pose and\nfacial age. Through quantitative and qualitative evaluations, we demonstrate\nthat DiffAge3D outperforms existing methods, particularly in\nmultiview-consistent aging and fine details preservation.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WaTXJd4oWiGIk87UGejgkL1lCSfBqWq9h8-uFaQfm8g","pdfSize":"4682591"}
