{"id":"2408.04864","title":"The evolving role of astrophysical modelling in dark matter halo\n  relaxation response","authors":"Premvijay Velmani and Aseem Paranjape","authorsParsed":[["Velmani","Premvijay",""],["Paranjape","Aseem",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 05:01:39 GMT"}],"updateDate":"2024-08-12","timestamp":1723179699000,"abstract":"  We study the change in the radial distribution of dark matter within haloes\nin response to baryonic astrophysical processes in galaxies at different\nepochs, investigating the role of astrophysical modeling in cosmological\nhydrodynamic simulations in producing the response. We find that the linear\nquasi-adiabatic relaxation with additional dependence on the halo-centric\ndistance provides a good description not only at $z=0$, but also at an earlier\nepoch ($z=1$) in the IllustrisTNG simulation suite, with parameters being more\nuniversal across a much larger variety of haloes at $z=1$ than at $z=0$.\nThrough systematic analysis of a large collection of simulations from the\nCAMELS project, we find that the baryonic prescriptions for both AGN and\nstellar feedbacks have a strong influence on the relaxation response of the\ndark matter halo. In particular, only the parameters controlling the overall\nfeedback energy flux have an effect on the relaxation response, while the wind\nspeed and burstiness have negligible effect on the relaxation at a fixed amount\nof energy flux. However, the exact role of these parameters on the relaxation\ndepends on the redshift. We also study the role of a variety of baryonic\nastrophysical processes through the EAGLE physics variation simulations. While\nthese depict a similar picture regarding the importance of feedback effects,\nthey also reveal that the gas equation of state has one of the strongest\ninfluences on the relaxation response, consistent with the expectation from\nself-similar analyses.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}