{"id":"2408.06821","title":"Quantifying the checkerboard problem to reduce numerical dissipation","authors":"Johannes Arend Hopman, Daniel Santos, \\`Adel Alsalti-Baldellou,\n  Joaquim Rigola and Francesc Xavier Trias","authorsParsed":[["Hopman","Johannes Arend",""],["Santos","Daniel",""],["Alsalti-Baldellou","Àdel",""],["Rigola","Joaquim",""],["Trias","Francesc Xavier",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 11:28:33 GMT"}],"updateDate":"2024-08-14","timestamp":1723548513000,"abstract":"  This work provides a comprehensive exploration of various methods in solving\nincompressible flows using a projection method, and their relation to the\noccurrence and management of checkerboard oscillations. It employs an algebraic\nsymmetry-preserving framework, clarifying the derivation and implementation of\ndiscrete operators while also addressing the associated numerical errors. The\nlack of a proper definition for the checkerboard problem is addressed by\nproposing a physics-based coefficient. This coefficient, rooted in the\ndisparity between the compact- and wide-stencil Laplacian operators, is able to\nquantify oscillatory solution fields with a physics-based, global, normalised,\nnon-dimensional value. The influence of mesh and time-step refinement on the\noccurrence of checkerboarding is highlighted. Therefore, single measurements\nusing this coefficient should be considered with caution, as the value presents\nlittle use without any context and can either suggest mesh refinement or use of\na different solver. In addition, an example is given on how to employ this\ncoefficient, by establishing a negative feedback between the level of\ncheckerboarding and the inclusion of a pressure predictor, to dynamically\nbalance the checkerboarding and numerical dissipation. This method is tested\nfor laminar and turbulent flows, demonstrating its capabilities in obtaining\nthis dynamical balance, without requiring user input. The method is able to\nachieve low numerical dissipation in absence of oscillations or diminish\noscillation on skew meshes, while it shows minimal loss in accuracy for a\nturbulent test case. Despite its advantages, the method exhibits a slight\ndecrease in the second-order relation between time-step size and pressure\nerror, suggesting that other feedback mechanisms could be of interest.\n","subjects":["Physics/Fluid Dynamics","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}