{"id":"2408.12451","title":"Dissipation and Interaction-Controlled Non-Hermitian Skin Effects","authors":"Yang Li and Zhao-Fan Cai and Tao Liu and Franco Nori","authorsParsed":[["Li","Yang",""],["Cai","Zhao-Fan",""],["Liu","Tao",""],["Nori","Franco",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 14:49:13 GMT"},{"version":"v2","created":"Sat, 24 Aug 2024 10:35:27 GMT"}],"updateDate":"2024-08-27","timestamp":1724338153000,"abstract":"  Non-Hermitian skin effects (NHSEs) have recently been investigated\nextensively at the single-particle level. When many-body interactions become\ndominant, novel non-Hermitian physical phenomena can emerge. In this work, we\ntheoretically study NHSEs controlled by dissipation and interaction. We\nconsider a 1D zigzag Bose-Hubbard lattice, subject to magnetic flux, staggered\nonsite single-particle loss, and uniform onsite two-particle loss. When the\ntwo-particle loss is small, two-body bound eigenstates (i.e., doublons) are all\nlocalized at the same boundary due to the interplay of the magnetic flux and\nstaggered single-particle loss. While, for strong two-particle loss, the\nlocalization direction of doublons is unexpectedly reversed. This is attributed\nto the effective strong nonreciprocal hopping of doublons contributing from the\nvirtual second-order and third-order hopping processes of particle pairs in\ncombination with the magnetic flux, the strong two-particle loss, and the\nmany-body interaction. Moreover, a two-particle gain can induce the same\nskin-localization of doublons, which can be utilized to dynamically observe the\nNHSE and its reversal of doublons controlled by interactions. Our results open\nup a new avenue for exploring novel non-Hermitian phenomena in many-body\nsystems.\n","subjects":["Condensed Matter/Quantum Gases","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}