{"id":"2408.11358","title":"Gender Bias Evaluation in Text-to-image Generation: A Survey","authors":"Yankun Wu, Yuta Nakashima, Noa Garcia","authorsParsed":[["Wu","Yankun",""],["Nakashima","Yuta",""],["Garcia","Noa",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 06:01:23 GMT"}],"updateDate":"2024-08-22","timestamp":1724220083000,"abstract":"  The rapid development of text-to-image generation has brought rising ethical\nconsiderations, especially regarding gender bias. Given a text prompt as input,\ntext-to-image models generate images according to the prompt. Pioneering models\nsuch as Stable Diffusion and DALL-E 2 have demonstrated remarkable capabilities\nin producing high-fidelity images from natural language prompts. However, these\nmodels often exhibit gender bias, as studied by the tendency of generating man\nfrom prompts such as \"a photo of a software developer\". Given the widespread\napplication and increasing accessibility of these models, bias evaluation is\ncrucial for regulating the development of text-to-image generation. Unlike\nwell-established metrics for evaluating image quality or fidelity, the\nevaluation of bias presents challenges and lacks standard approaches. Although\nbiases related to other factors, such as skin tone, have been explored, gender\nbias remains the most extensively studied. In this paper, we review recent work\non gender bias evaluation in text-to-image generation, involving bias\nevaluation setup, bias evaluation metrics, and findings and trends. We\nprimarily focus on the evaluation of recent popular models such as Stable\nDiffusion, a diffusion model operating in the latent space and using CLIP text\nembedding, and DALL-E 2, a diffusion model leveraging Seq2Seq architectures\nlike BART. By analyzing recent work and discussing trends, we aim to provide\ninsights for future work.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GAAmHzC8rFLz1jmMhzDwO3Gxy1whu3KBeyjf4SYWaZ0","pdfSize":"166365"}
