{"id":"2408.17395","title":"Mapping radial abundance gradients with Gaia-ESO open clusters: Evidence\n  of recent gas accretion in the Milky Way disk","authors":"Marco Palla, Laura Magrini, Emanuele Spitoni, Francesca Matteucci,\n  Carlos Viscasillas V\\'azquez, Mariagrazia Franchini, Marta Molero, Sofia\n  Randich","authorsParsed":[["Palla","Marco",""],["Magrini","Laura",""],["Spitoni","Emanuele",""],["Matteucci","Francesca",""],["Vázquez","Carlos Viscasillas",""],["Franchini","Mariagrazia",""],["Molero","Marta",""],["Randich","Sofia",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 16:29:12 GMT"},{"version":"v2","created":"Tue, 10 Sep 2024 09:01:50 GMT"}],"updateDate":"2024-09-11","timestamp":1725035352000,"abstract":"  Context. Recent evidences from spectroscopic surveys point towards the\npresence of a metal-poor, young stellar population in the chemical thin disk.\nIn this context, the investigation of the spatial distribution and time\nevolution of precise, unbiased abundances is fundamental to disentangle the\nscenarios of evolution of the Galaxy. Aims. We study the evolution of abundance\ngradients in the Milky Way by taking advantage of a large sample of open\nclusters, which are among the best tracers for this purpose. In particular, we\nuse data from the last release of the Gaia-ESO survey. Methods. We perform\ncareful selection of open cluster stars excluding those that may be affected by\nbiases in spectral analysis. The cleaned open clusters sample is compared with\ndetailed chemical evolution models for the Milky Way, using well tested stellar\nyields and prescription for radial migration. Different scenarios of Galaxy\nevolution are tested to explain the data, i.e. the two-infall and the\nthree-infall frameworks, suggesting that the chemical thin disk is formed by\none or two subsequent gas accretion episodes, respectively. Results. With the\nperformed selection in cluster stars, we still find a metallicity decrease\nbetween intermediate age (1<Age/Gyr<3) and young (Age<1Gyr) open clusters. This\ndecrease cannot be explained in the context of the two-infall scenario, even by\naccounting for the effect of migration and yield prescriptions. The\nthree-infall model, with its late gas accretion in the last 3 Gyr, can explain\nthe low metallic content in young clusters. However, we invoke a milder metal\ndilution relative to previous findings. Conclusions. To explain the observed\nlow metallic content in young clusters, we propose that a late gas accretion\nepisode triggering metal dilution should have taken place, extending the\nframework of the three-infall model for the first time to the entire Galactic\ndisk.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}