{"id":"2408.05679","title":"Sustainable Quantum Computing: Opportunities and Challenges of\n  Benchmarking Carbon in the Quantum Computing Lifecycle","authors":"Nivedita Arora, Prem Kumar","authorsParsed":[["Arora","Nivedita",""],["Kumar","Prem",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 03:02:19 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 00:39:49 GMT"}],"updateDate":"2024-08-14","timestamp":1723345339000,"abstract":"  While researchers in both industry and academia are racing to build Quantum\nComputing (QC) platforms with viable performance and functionality, the\nenvironmental impacts of this endeavor, such as its carbon footprint, e-waste\ngeneration, mineral use, and water and energy consumption, remain largely\nunknown. A similar oversight occurred during the semiconductor revolution and\ncontinues to have disastrous consequences for the health of our planet. As we\nbuild the quantum computing stack from the ground up, it is crucial to\ncomprehensively assess it through an environmental sustainability lens for its\nentire life-cycle: production, use, and disposal. In this paper, we highlight\nthe need and challenges in establishing a QC sustainability benchmark that\nenables researchers to make informed architectural design decisions and\ncelebrate the potential quantum environmental advantage. We propose a\ncarbon-aware quantum computing (CQC) framework that provides the foundational\nmethodology and open research questions for calculating the total life-cycle\ncarbon footprint of a QC platform. Our call to action to the research community\nis the establishment of a new research direction known as, sustainable quantum\ncomputing that promotes both quantum computing for sustainability-oriented\napplications and the sustainability of quantum computing.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0bf9F1uIZpc7RYLFPQaFq2v3Rz22W6ZJhZ5N_nJdJKo","pdfSize":"2024838"}
