{"id":"2408.07670","title":"Performance Analysis of Double Reconfigurable Intelligent Surfaces\n  Assisted NOMA Networks","authors":"Xuehua Li, Xuanhao Lian, Xinwei Yue, Zhiping Lu, Chongwen Huang,\n  Tianwei Hou","authorsParsed":[["Li","Xuehua",""],["Lian","Xuanhao",""],["Yue","Xinwei",""],["Lu","Zhiping",""],["Huang","Chongwen",""],["Hou","Tianwei",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 17:11:34 GMT"}],"updateDate":"2024-08-15","timestamp":1723655494000,"abstract":"  This paper introduces double cascaded reconfigurable intelligent surfaces\n(RISs) to non-orthogonal multiple access (NOMA) networks over cascaded Rician\nfading and Nakagami-$m$ fading channels, where two kinds of passive RIS (PRIS)\nand active RIS (ARIS) are taken into consideration, called PRIS-ARIS-NOMA\nnetworks. Additionally, new closed-form and asymptotic expressions for outage\nprobability and ergodic data rate of two non-orthogonal users are derived with\nthe imperfect/perfect successive interference cancellation schemes. The\nscenario is modelled around two non-orthogonal users and focuses on analyzing\ntheir communication characteristics. Based on the approximate results, the\ndiversity orders and ergodic data rate slopes of two users are obtained in the\nhigh signal-to-noise ratios. In addition, the system throughput of\nPRIS-ARIS-NOMA in delay-limited mode and delay-tolerant mode are discussed\naccording to the outage probability and ergodic data rate. The simulation\nresults verify the correctness of the formulas and yields the following\ninsights: 1) The outage behaviors of PRIS-ARIS-NOMA outperforms than that of\nPRIS-ARIS assisted orthogonal multiple access (OMA); 2)Use of PRIS-ARIS-NOMA is\nbetter than use of PRIS-ARIS-OMA in small transmit power threshold scenarios 3)\nBy increasing the number of reflecting elements of RISs, the PRIS-ARIS-NOMA is\nable to achieve the enhanced outage performance; and 4) The PRIS-ARIS-NOMA has\nthe higher ergodic data rate and system throughput than double PRISs-NOMA.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}