{"id":"2408.17390","title":"High-order finite element methods for three-dimensional multicomponent\n  convection-diffusion","authors":"Aaron Baier-Reinio and Patrick E. Farrell","authorsParsed":[["Baier-Reinio","Aaron",""],["Farrell","Patrick E.",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 16:27:54 GMT"}],"updateDate":"2024-09-02","timestamp":1725035274000,"abstract":"  We derive and analyze a broad class of finite element methods for numerically\nsimulating the stationary, low Reynolds number flow of concentrated mixtures of\nseveral distinct chemical species in a common thermodynamic phase. The\nunderlying partial differential equations that we discretize are the\nStokes$\\unicode{x2013}$Onsager$\\unicode{x2013}$Stefan$\\unicode{x2013}$Maxwell\n(SOSM) equations, which model bulk momentum transport and multicomponent\ndiffusion within ideal and non-ideal mixtures. Unlike previous approaches, the\nmethods are straightforward to implement in two and three spatial dimensions,\nand allow for high-order finite element spaces to be employed. The key idea in\nderiving the discretization is to suitably reformulate the SOSM equations in\nterms of the species mass fluxes and chemical potentials, and discretize these\nunknown fields using stable $H(\\textrm{div}) \\unicode{x2013} L^2$ finite\nelement pairs. We prove that the methods are convergent and yield a symmetric\nlinear system for a Picard linearization of the SOSM equations, which staggers\nthe updates for concentrations and chemical potentials. We also discuss how the\nproposed approach can be extended to the Newton linearization of the SOSM\nequations, which requires the simultaneous solution of mole fractions, chemical\npotentials, and other variables. Our theoretical results are supported by\nnumerical experiments and we present an example of a physical application\ninvolving the microfluidic non-ideal mixing of hydrocarbons.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SgZbs-2VCNvJROpIierXG1w8qnf8YA_e7j_W2v1_pYk","pdfSize":"3550828"}
