{"id":"2408.11224","title":"Optimal Guarantees for Online Selection Over Time","authors":"Sebastian Perez-Salazar, Victor Verdugo","authorsParsed":[["Perez-Salazar","Sebastian",""],["Verdugo","Victor",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 22:50:41 GMT"}],"updateDate":"2024-08-22","timestamp":1724194241000,"abstract":"  Prophet inequalities are a cornerstone in optimal stopping and online\ndecision-making. Traditionally, they involve the sequential observation of $n$\nnon-negative independent random variables and face irrevocable accept-or-reject\nchoices. The goal is to provide policies that provide a good approximation\nratio against the optimal offline solution that can access all the values\nupfront -- the so-called prophet value. In the prophet inequality over time\nproblem (POT), the decision-maker can commit to an accepted value for $\\tau$\nunits of time, during which no new values can be accepted. This creates a\ntrade-off between the duration of commitment and the opportunity to capture\npotentially higher future values.\n  In this work, we provide best possible worst-case approximation ratios in the\nIID setting of POT for single-threshold algorithms and the optimal dynamic\nprogramming policy. We show a single-threshold algorithm that achieves an\napproximation ratio of $(1+e^{-2})/2\\approx 0.567$, and we prove that no\nsingle-threshold algorithm can surpass this guarantee. With our techniques, we\ncan analyze simple algorithms using $k$ thresholds and show that with $k=3$ it\nis possible to get an approximation ratio larger than $\\approx 0.602$. Then,\nfor each $n$, we prove it is possible to compute the tight worst-case\napproximation ratio of the optimal dynamic programming policy for instances\nwith $n$ values by solving a convex optimization program. A limit analysis of\nthe first-order optimality conditions yields a nonlinear differential equation\nshowing that the optimal dynamic programming policy's asymptotic worst-case\napproximation ratio is $\\approx 0.618$. Finally, we extend the discussion to\nadversarial settings and show an optimal worst-case approximation ratio of\n$\\approx 0.162$ when the values are streamed in random order.\n","subjects":["Computing Research Repository/Computer Science and Game Theory","Economics/Theoretical Economics","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}