{"id":"2408.06641","title":"Impact of Ge, Ga, and Al doping on the mechanical properties and\n  anisotropy of Cr$_3$Si: a first-principles investigation","authors":"Siavash Karbasizadeh, Mohammad Amirabbasi","authorsParsed":[["Karbasizadeh","Siavash",""],["Amirabbasi","Mohammad",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 05:21:41 GMT"}],"updateDate":"2024-08-14","timestamp":1723526501000,"abstract":"  The mechanical properties of cubic Cr$_3$Si doped with Ge, Ga, and Al are\nsystematically investigated using first-principles calculations based on\ndensity functional theory. We examine the effects of doping on the lattice\nconstants, formation enthalpies, elastic moduli, wave velocities, Debye\ntemperature, and mechanical anisotropy to understand how these dopants\ninfluence the structural stability and mechanical behavior of Cr$_3$Si. Our\nresults indicate that doping with Ge, Ga, and Al lead to an increase in lattice\nconstants, reflecting lattice expansion. Despite the negative formation\nenthalpies across all doped configurations, indicating thermodynamic stability,\nhigher dopant concentrations reduce the stability of the alloys. The elastic\nmoduli, including bulk modulus, shear modulus, and Young's modulus, decrease\nwith increasing dopant concentration, suggesting a reduction in mechanical\nstiffness and rigidity. Wave velocity and Debye temperature also grow smaller,\nfurther indicating a softer material structure with diminished thermal\nconductivity. Additionally, the study reveals that Al and Ga doping\nsignificantly increases mechanical anisotropy, as demonstrated by the\nanisotropy indices and three-dimensional contour analyses. In contrast, Ge\nmaintains a more isotropic mechanical behavior, making it the most favorable\ndopant for applications requiring balanced mechanical and thermal properties.\nThese findings provide critical insights into the design and optimization of\nCr$_3$Si-based materials, highlighting the trade-offs between mechanical\nstrength, anisotropy, and other functional properties introduced by doping. The\nresults underscore the potential of tailoring Cr$_3$Si alloys for specific\nhigh-performance applications where directional mechanical properties and\nthermal stability are of paramount importance.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}