{"id":"2408.15425","title":"Fast and Modular Autonomy Software for Autonomous Racing Vehicles","authors":"Andrew Saba, Aderotimi Adetunji, Adam Johnson, Aadi Kothari, Matthew\n  Sivaprakasam, Joshua Spisak, Prem Bharatia, Arjun Chauhan, Brendan Duff Jr.,\n  Noah Gasparro, Charles King, Ryan Larkin, Brian Mao, Micah Nye, Anjali\n  Parashar, Joseph Attias, Aurimas Balciunas, Austin Brown, Chris Chang, Ming\n  Gao, Cindy Heredia, Andrew Keats, Jose Lavariega, William Muckelroy III,\n  Andre Slavescu, Nickolas Stathas, Nayana Suvarna, Chuan Tian Zhang, Sebastian\n  Scherer, Deva Ramanan","authorsParsed":[["Saba","Andrew",""],["Adetunji","Aderotimi",""],["Johnson","Adam",""],["Kothari","Aadi",""],["Sivaprakasam","Matthew",""],["Spisak","Joshua",""],["Bharatia","Prem",""],["Chauhan","Arjun",""],["Duff","Brendan","Jr."],["Gasparro","Noah",""],["King","Charles",""],["Larkin","Ryan",""],["Mao","Brian",""],["Nye","Micah",""],["Parashar","Anjali",""],["Attias","Joseph",""],["Balciunas","Aurimas",""],["Brown","Austin",""],["Chang","Chris",""],["Gao","Ming",""],["Heredia","Cindy",""],["Keats","Andrew",""],["Lavariega","Jose",""],["Muckelroy","William","III"],["Slavescu","Andre",""],["Stathas","Nickolas",""],["Suvarna","Nayana",""],["Zhang","Chuan Tian",""],["Scherer","Sebastian",""],["Ramanan","Deva",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 21:57:16 GMT"}],"updateDate":"2024-08-29","timestamp":1724795836000,"abstract":"  Autonomous motorsports aim to replicate the human racecar driver with\nsoftware and sensors. As in traditional motorsports, Autonomous Racing Vehicles\n(ARVs) are pushed to their handling limits in multi-agent scenarios at\nextremely high ($\\geq 150mph$) speeds. This Operational Design Domain (ODD)\npresents unique challenges across the autonomy stack. The Indy Autonomous\nChallenge (IAC) is an international competition aiming to advance autonomous\nvehicle development through ARV competitions. While far from challenging what a\nhuman racecar driver can do, the IAC is pushing the state of the art by\nfacilitating full-sized ARV competitions. This paper details the MIT-Pitt-RW\nTeam's approach to autonomous racing in the IAC. In this work, we present our\nmodular and fast approach to agent detection, motion planning and controls to\ncreate an autonomy stack. We also provide analysis of the performance of the\nsoftware stack in single and multi-agent scenarios for rapid deployment in a\nfast-paced competition environment. We also cover what did and did not work\nwhen deployed on a physical system the Dallara AV-21 platform and potential\nimprovements to address these shortcomings. Finally, we convey lessons learned\nand discuss limitations and future directions for improvement.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}