{"id":"2408.13308","title":"A Comprehensive Analysis Spitzer 4.5 $\\mu$m Phase Curve of Hot Jupiters","authors":"Lisa Dang, Taylor J. Bell, Ying (Zoe) Shu, Nicolas B. Cowan, Jacob L.\n  Bean, Drake Deming, Eliza M.-R. Kempton, Megan Weiner Mansfield, Emily\n  Rauscher, Vivien Parmentier, Kevin B. Stevenson, Mark Swain, Laura Kreidberg,\n  Tiffany Kataria, Jean-Michel D\\'esert, Robert Zellem, Jonathan J. Fortney,\n  Nikole K. Lewis, Michael Line, Caroline Morley, and Adam Showman","authorsParsed":[["Dang","Lisa","","Zoe"],["Bell","Taylor J.","","Zoe"],["Ying","","","Zoe"],["Shu","",""],["Cowan","Nicolas B.",""],["Bean","Jacob L.",""],["Deming","Drake",""],["Kempton","Eliza M. -R.",""],["Mansfield","Megan Weiner",""],["Rauscher","Emily",""],["Parmentier","Vivien",""],["Stevenson","Kevin B.",""],["Swain","Mark",""],["Kreidberg","Laura",""],["Kataria","Tiffany",""],["Désert","Jean-Michel",""],["Zellem","Robert",""],["Fortney","Jonathan J.",""],["Lewis","Nikole K.",""],["Line","Michael",""],["Morley","Caroline",""],["Showman","Adam",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-27","timestamp":1724436001000,"abstract":"  Although exoplanetary science was not initially projected to be a substantial\npart of the Spitzer mission, its exoplanet observations set the stage for\ncurrent and future surveys with JWST and Ariel. We present a comprehensive\nreduction and analysis of Spitzer's 4.5 micron phase curves of 29 hot Jupiters\non low-eccentricity orbits. The analysis, performed with the Spitzer Phase\nCurve Analysis (SPCA) pipeline, confirms that BLISS mapping is the best\ndetrending scheme for most, but not all, observations. Visual inspection\nremains necessary to ensure consistency across detrending methods due to the\ndiversity of phase curve data and systematics. Regardless of the model\nselection scheme - whether using the lowest-BIC or a uniform detrending\napproach - we observe the same trends, or lack thereof. We explore phase curve\ntrends as a function of irradiation temperature, orbital period, planetary\nradius, mass, and stellar effective temperature. We discuss the trends that are\nrobustly detected and provide potential explanations for those that are not\nobserved. While it is almost tautological that planets receiving greater\ninstellation are hotter, we are still far from confirming dynamical theories of\nheat transport in hot Jupiter atmospheres due to the sample's diversity. Even\namong planets with similar temperatures, other factors like rotation and\nmetallicity vary significantly. Larger, curated sample sizes and\nhigher-fidelity phase curve measurements from JWST and Ariel are needed to\nfirmly establish the parameters governing day-night heat transport on\nsynchronously rotating planets.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}