{"id":"2408.04413","title":"Deeploy: Enabling Energy-Efficient Deployment of Small Language Models\n  On Heterogeneous Microcontrollers","authors":"Moritz Scherer, Luka Macan, Victor Jung, Philip Wiese, Luca Bompani,\n  Alessio Burrello, Francesco Conti, Luca Benini","authorsParsed":[["Scherer","Moritz",""],["Macan","Luka",""],["Jung","Victor",""],["Wiese","Philip",""],["Bompani","Luca",""],["Burrello","Alessio",""],["Conti","Francesco",""],["Benini","Luca",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 12:40:27 GMT"}],"updateDate":"2024-08-09","timestamp":1723120827000,"abstract":"  With the rise of Embodied Foundation Models (EFMs), most notably Small\nLanguage Models (SLMs), adapting Transformers for edge applications has become\na very active field of research. However, achieving end-to-end deployment of\nSLMs on microcontroller (MCU)-class chips without high-bandwidth off-chip main\nmemory access is still an open challenge. In this paper, we demonstrate\nhigh-efficiency end-to-end SLM deployment on a multicore RISC-V (RV32) MCU\naugmented with ML instruction extensions and a hardware neural processing unit\n(NPU). To automate the exploration of the constrained, multi-dimensional memory\nvs. computation tradeoffs involved in aggressive SLM deployment on\nheterogeneous (multicore+NPU) resources, we introduce Deeploy, a novel Deep\nNeural Network (DNN) compiler, which generates highly-optimized C code\nrequiring minimal runtime support. We demonstrate that Deeploy generates\nend-to-end code for executing SLMs, fully exploiting the RV32 cores'\ninstruction extensions and the NPU: We achieve leading-edge energy and\nthroughput of \\SI{490}{\\micro\\joule \\per Token}, at \\SI{340}{Token \\per\n\\second} for an SLM trained on the TinyStories dataset, running for the first\ntime on an MCU-class device without external memory.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"8E5TM3Vc6l7RNnorbOfZJCxsu68cCVZy9JfmNQer4Iw","pdfSize":"1007450"}
