{"id":"2408.11834","title":"SCREENER: A general framework for task-specific experiment design in\n  quantitative MRI","authors":"Tianshu Zheng, Zican Wang, Timothy Bray, Daniel C. Alexander, Dan Wu,\n  Hui Zhang","authorsParsed":[["Zheng","Tianshu",""],["Wang","Zican",""],["Bray","Timothy",""],["Alexander","Daniel C.",""],["Wu","Dan",""],["Zhang","Hui",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 21:43:50 GMT"}],"updateDate":"2024-08-23","timestamp":1722980630000,"abstract":"  Quantitative magnetic resonance imaging (qMRI) is increasingly investigated\nfor use in a variety of clinical tasks from diagnosis, through staging, to\ntreatment monitoring. However, experiment design in qMRI, the identification of\nthe optimal acquisition protocols, has been focused on obtaining the most\nprecise parameter estimations, with no regard for the specific requirements of\ndownstream tasks. Here we propose SCREENER: A general framework for\ntask-specific experiment design in quantitative MRI. SCREENER incorporates a\ntask-specific objective and seeks the optimal protocol with a\ndeep-reinforcement-learning (DRL) based optimization strategy. To illustrate\nthis framework, we employ a task of classifying the inflammation status of bone\nmarrow using diffusion MRI data with intravoxel incoherent motion (IVIM)\nmodelling. Results demonstrate SCREENER outperforms previous ad hoc and\noptimized protocols under clinical signal-to-noise ratio (SNR) conditions,\nachieving significant improvement, both in binary classification tasks, e.g.\nfrom 67% to 89%, and in a multi-class classification task, from 46% to 59%.\nAdditionally, we show this improvement is robust to the SNR. Lastly, we\ndemonstrate the advantage of DRL-based optimization strategy, enabling\nzero-shot discovery of near-optimal protocols for a range of SNRs not used in\ntraining. In conclusion, SCREENER has the potential to enable wider uptake of\nqMRI in the clinic.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}