{"id":"2408.05453","title":"TOSS: Real-time Tracking and Moving Object Segmentation for Static Scene\n  Mapping","authors":"Seoyeon Jang, Minho Oh, Byeongho Yu, I Made Aswin Nahrendra, Seungjae\n  Lee, Hyungtae Lim, and Hyun Myung","authorsParsed":[["Jang","Seoyeon",""],["Oh","Minho",""],["Yu","Byeongho",""],["Nahrendra","I Made Aswin",""],["Lee","Seungjae",""],["Lim","Hyungtae",""],["Myung","Hyun",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 06:14:39 GMT"}],"updateDate":"2024-08-13","timestamp":1723270479000,"abstract":"  Safe navigation with simultaneous localization and mapping (SLAM) for\nautonomous robots is crucial in challenging environments. To achieve this goal,\ndetecting moving objects in the surroundings and building a static map are\nessential. However, existing moving object segmentation methods have been\ndeveloped separately for each field, making it challenging to perform real-time\nnavigation and precise static map building simultaneously. In this paper, we\npropose an integrated real-time framework that combines online tracking-based\nmoving object segmentation with static map building. For safe navigation, we\nintroduce a computationally efficient hierarchical association cost matrix to\nenable real-time moving object segmentation. In the context of precise static\nmapping, we present a voting-based method, DS-Voting, designed to achieve\naccurate dynamic object removal and static object recovery by emphasizing their\nspatio-temporal differences. We evaluate our proposed method quantitatively and\nqualitatively in the SemanticKITTI dataset and real-world challenging\nenvironments. The results demonstrate that dynamic objects can be clearly\ndistinguished and incorporated into static map construction, even in stairs,\nsteep hills, and dense vegetation.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"znxv9vkbxAYFrFhscPbZCWaE2bjRt4MfNGAGvAXa3gU","pdfSize":"13619813"}
