{"id":"2408.06590","title":"Adaptive variational quantum dynamics simulations with compressed\n  circuits and fewer measurements","authors":"Feng Zhang, Cai-Zhuang Wang, Thomas Iadecola, Peter P. Orth, Yong-Xin\n  Yao","authorsParsed":[["Zhang","Feng",""],["Wang","Cai-Zhuang",""],["Iadecola","Thomas",""],["Orth","Peter P.",""],["Yao","Yong-Xin",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 02:56:43 GMT"}],"updateDate":"2024-08-14","timestamp":1723517803000,"abstract":"  The adaptive variational quantum dynamics simulation (AVQDS) method performs\nreal-time evolution of quantum states using automatically generated\nparameterized quantum circuits that often contain substantially fewer gates\nthan Trotter circuits. Here we report an improved version of the method, which\nwe call AVQDS(T), by porting the Tiling Efficient Trial Circuits with Rotations\nImplemented Simultaneously (TETRIS) technique. The algorithm adaptively adds\nlayers of disjoint unitary gates to the ansatz circuit so as to keep the\nMcLachlan distance, a measure of the accuracy of the variational dynamics,\nbelow a fixed threshold. We perform benchmark noiseless AVQDS(T) simulations of\nquench dynamics in local spin models demonstrating that the TETRIS technique\nsignificantly reduces the circuit depth and two-qubit gate count. We also show\na method based on eigenvalue truncation to solve the linear equations of motion\nfor the variational parameters with enhanced noise resilience. Finally, we\npropose a way to substantially alleviate the measurement overhead of AVQDS(T)\nwhile maintaining high accuracy by synergistically integrating quantum circuit\ncalculations on quantum processing units with classical calculations using,\ne.g., tensor networks to evaluate the quantum geometric tensor. We showcase\nthat this approach enables AVQDS(T) to deliver more accurate results than\nsimulations using a fixed ansatz of comparable final depth for a significant\ntime duration with fewer quantum resources.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/"}