{"id":"2408.09709","title":"Dataset Distillation for Histopathology Image Classification","authors":"Cong Cong, Shiyu Xuan, Sidong Liu, Maurice Pagnucco, Shiliang Zhang\n  and Yang Song","authorsParsed":[["Cong","Cong",""],["Xuan","Shiyu",""],["Liu","Sidong",""],["Pagnucco","Maurice",""],["Zhang","Shiliang",""],["Song","Yang",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 05:53:38 GMT"}],"updateDate":"2024-08-20","timestamp":1724046818000,"abstract":"  Deep neural networks (DNNs) have exhibited remarkable success in the field of\nhistopathology image analysis. On the other hand, the contemporary trend of\nemploying large models and extensive datasets has underscored the significance\nof dataset distillation, which involves compressing large-scale datasets into a\ncondensed set of synthetic samples, offering distinct advantages in improving\ntraining efficiency and streamlining downstream applications. In this work, we\nintroduce a novel dataset distillation algorithm tailored for histopathology\nimage datasets (Histo-DD), which integrates stain normalisation and model\naugmentation into the distillation progress. Such integration can substantially\nenhance the compatibility with histopathology images that are often\ncharacterised by high colour heterogeneity. We conduct a comprehensive\nevaluation of the effectiveness of the proposed algorithm and the generated\nhistopathology samples in both patch-level and slide-level classification\ntasks. The experimental results, carried out on three publicly available WSI\ndatasets, including Camelyon16, TCGA-IDH, and UniToPath, demonstrate that the\nproposed Histo-DD can generate more informative synthetic patches than previous\ncoreset selection and patch sampling methods. Moreover, the synthetic samples\ncan preserve discriminative information, substantially reduce training efforts,\nand exhibit architecture-agnostic properties. These advantages indicate that\nsynthetic samples can serve as an alternative to large-scale datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}