{"id":"2408.06483","title":"Clock Auctions Augmented with Unreliable Advice","authors":"Vasilis Gkatzelis, Daniel Schoepflin, Xizhi Tan","authorsParsed":[["Gkatzelis","Vasilis",""],["Schoepflin","Daniel",""],["Tan","Xizhi",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 20:32:54 GMT"}],"updateDate":"2024-08-14","timestamp":1723494774000,"abstract":"  We provide the first analysis of clock auctions through the\nlearning-augmented framework. Deferred-acceptance clock auctions are a\ncompelling class of mechanisms satisfying a unique list of highly practical\nproperties, including obvious strategy-proofness, transparency, and\nunconditional winner privacy, making them particularly well-suited for\nreal-world applications. However, early work that evaluated their performance\nfrom a worst-case analysis standpoint concluded that no deterministic clock\nauction can achieve much better than an $O(\\log n)$ approximation of the\noptimal social welfare (where $n$ is the number of bidders participating in the\nauction), even in seemingly very simple settings.\n  To overcome this overly pessimistic impossibility result, which heavily\ndepends on the assumption that the designer has no information regarding the\npreferences of the participating bidders, we leverage the learning-augmented\nframework. This framework assumes that the designer is provided with some\nadvice regarding what the optimal solution may be. This advice may be the\nproduct of machine-learning algorithms applied to historical data, so it can\nprovide very useful guidance, but it can also be highly unreliable.\n  Our main results are learning-augmented clock auctions that use this advice\nto achieve much stronger performance guarantees whenever the advice is accurate\n(known as consistency), while simultaneously maintaining worst-case guarantees\neven if this advice is arbitrarily inaccurate (known as robustness).\nSpecifically, for the standard notion of consistency, we provide a clock\nauction that achieves the best of both worlds: $(1+\\epsilon)$-consistency for\nany constant $\\epsilon > 0$ and $O(\\log n)$ robustness. We then also consider a\nmuch stronger notion of consistency and provide an auction that achieves the\noptimal trade-off between this notion of consistency and robustness.\n","subjects":["Computing Research Repository/Computer Science and Game Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"HYsMN3eP808xz5DtaLvYSAmbPTtlXIVGaENfgiseG3U","pdfSize":"1245383"}
