{"id":"2408.06657","title":"Physics Informed Deep Learning for Strain Gradient Continuum Plasticity","authors":"Ankit Tyagi, Uttam Suman, Mariya Mamajiwala, and Debasish Roy","authorsParsed":[["Tyagi","Ankit",""],["Suman","Uttam",""],["Mamajiwala","Mariya",""],["Roy","Debasish",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 06:02:05 GMT"}],"updateDate":"2024-08-14","timestamp":1723528925000,"abstract":"  We use a space-time discretization based on physics informed deep learning\n(PIDL) to approximate solutions of a class of rate-dependent strain gradient\nplasticity models. The differential equation governing the plastic flow, the\nso-called microforce balance for this class of yield-free plasticity models, is\nvery stiff, often leading to numerical corruption and a consequent lack of\naccuracy or convergence by finite element (FE) methods. Indeed, setting up the\ndiscretized framework, especially with an elaborate meshing around the\npropagating plastic bands whose locations are often unknown a-priori, also\nscales up the computational effort significantly. Taking inspiration from\nphysics informed neural networks, we modify the loss function of a PIDL model\nin several novel ways to account for the balance laws, either through\nenergetics or via the resulting PDEs once a variational scheme is applied, and\nthe constitutive equations. The initial and the boundary conditions may either\nbe imposed strictly by encoding them within the PIDL architecture, or enforced\nweakly as a part of the loss function. The flexibility in the implementation of\na PIDL technique often makes for its ready interface with powerful optimization\nschemes, and this in turn provides for many possibilities in posing the\nproblem. We have used freely available open-source libraries that perform fast,\nparallel computations on GPUs. Using numerical illustrations, we demonstrate\nhow PIDL methods could address the computational challenges posed by strain\ngradient plasticity models. Also, PIDL methods offer abundant potentialities,\nvis-\\'a-vis a somewhat straitjacketed and poorer approximant of FE methods, in\ncustomizing the formulation as per the problem objective.\n","subjects":["Mathematics/Dynamical Systems","Condensed Matter/Statistical Mechanics","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UOYgirGoau3Lti1xrSThKIsEn22rOY_6KWLfueuDls8","pdfSize":"2984643"}
