{"id":"2408.08727","title":"A fully explicit isogeometric collocation formulation for the dynamics\n  of geometrically exact beams","authors":"Giulio Ferri, Josef Kiendl, Alessandro Reali, Enzo Marino","authorsParsed":[["Ferri","Giulio",""],["Kiendl","Josef",""],["Reali","Alessandro",""],["Marino","Enzo",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 13:20:07 GMT"}],"updateDate":"2024-08-19","timestamp":1723814407000,"abstract":"  We present a fully explicit dynamic formulation for geometrically exact\nshear-deformable beams. The starting point of this work is an existing\nisogeometric collocation (IGA-C) formulation which is explicit in the strict\nsense of the time integration algorithm, but still requires a system matrix\ninversion due to the use of a consistent mass matrix. Moreover, in that work,\nthe efficiency was also limited by an iterative solution scheme needed due to\nthe presence of a nonlinear term in the time-discretized rotational balance\nequation. In the present paper, we address these limitations and propose a\nnovel fully explicit formulation able to preserve high-order accuracy in space.\nThis is done by extending a predictor--multicorrector approach, originally\nproposed for standard elastodynamics, to the case of the rotational dynamics of\ngeometrically exact beams. The procedure relies on decoupling the Neumann\nboundary conditions and on a rearrangement and rescaling of the mass matrix. We\ndemonstrate that an additional gain in terms of computational cost is obtained\nby properly removing the angular velocity-dependent nonlinear term in the\nrotational balance equation without any significant loss in terms of accuracy.\nThe high-order spatial accuracy and the improved efficiency of the proposed\nformulation compared to the existing one are demonstrated through some\nnumerical experiments covering different combinations of boundary conditions.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}