{"id":"2408.00002","title":"Evaluating Transfer Learning in Deep Learning Models for Classification\n  on a Custom Wildlife Dataset: Can YOLOv8 Surpass Other Architectures?","authors":"Subek Sharma, Sisir Dhakal, Mansi Bhavsar","authorsParsed":[["Sharma","Subek",""],["Dhakal","Sisir",""],["Bhavsar","Mansi",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 15:03:00 GMT"}],"updateDate":"2024-08-02","timestamp":1720623780000,"abstract":"  Biodiversity plays a crucial role in maintaining the balance of the\necosystem. However, poaching and unintentional human activities contribute to\nthe decline in the population of many species. Hence, active monitoring is\nrequired to preserve these endangered species. Current human-led monitoring\ntechniques are prone to errors and are labor-intensive. Therefore, we study the\napplication of deep learning methods like Convolutional Neural Networks (CNNs)\nand transfer learning, which can aid in automating the process of monitoring\nendangered species. For this, we create our custom dataset utilizing\ntrustworthy online databases like iNaturalist and ZooChat. To choose the best\nmodel for our use case, we compare the performance of different architectures\nlike DenseNet, ResNet, VGGNet, and YOLOv8 on the custom wildlife dataset.\nTransfer learning reduces training time by freezing the pre-trained weights and\nreplacing only the output layer with custom, fully connected layers designed\nfor our dataset. Our results indicate that YOLOv8 performs better, achieving a\ntraining accuracy of 97.39 % and an F1 score of 96.50 %, surpassing other\nmodels. Our findings suggest that integrating YOLOv8 into conservation efforts\ncould revolutionize wildlife monitoring with its high accuracy and efficiency,\npotentially transforming how endangered species are monitored and protected\nworldwide.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}