{"id":"2408.02826","title":"Efficient ECC-based authentication scheme for fog-based IoT environment","authors":"Mohamed Ali Shaaban, Almohammady S. Alsharkawy, Mohammad T.\n  AbouKreisha and Mohammed Abdel Razek","authorsParsed":[["Shaaban","Mohamed Ali",""],["Alsharkawy","Almohammady S.",""],["AbouKreisha","Mohammad T.",""],["Razek","Mohammed Abdel",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 20:47:49 GMT"}],"updateDate":"2024-08-07","timestamp":1722890869000,"abstract":"  The rapid growth of cloud computing and Internet of Things (IoT) applications\nfaces several threats, such as latency, security, network failure, and\nperformance. These issues are solved with the development of fog computing,\nwhich brings storage and computation closer to IoT-devices. However, there are\nseveral challenges faced by security designers, engineers, and researchers to\nsecure this environment. To ensure the confidentiality of data that passes\nbetween the connected devices, digital signature protocols have been applied to\nthe authentication of identities and messages. However, in the traditional\nmethod, a user's private key is directly stored on IoTs, so the private key may\nbe disclosed under various malicious attacks. Furthermore, these methods\nrequire a lot of energy, which drains the resources of IoT-devices. A signature\nscheme based on the elliptic curve digital signature algorithm (ECDSA) is\nproposed in this paper to improve the security of the private key and the time\ntaken for key-pair generation. ECDSA security is based on the intractability of\nthe Elliptic Curve Discrete Logarithm Problem (ECDLP), which allows one to use\nmuch smaller groups. Smaller group sizes directly translate into shorter\nsignatures, which is a crucial feature in settings where communication\nbandwidth is limited, or data transfer consumes a large amount of energy. The\nefficiency and effectiveness of ECDSA in the IoT environment are validated by\nexperimental evaluation and comparison analysis. The results indicate that, in\ncomparison to the two-party ECDSA and RSA, the proposed ECDSA decreases\ncomputation time by 65% and 87%, respectively. Additionally, as compared to\ntwo-party ECDSA and RSA, respectively, it reduces energy consumption by 77% and\n82%.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}