{"id":"2408.12145","title":"Spectrum Sharing Between Low Earth Orbit Satellite and Terrestrial\n  Networks: A Stochastic Geometry Perspective Analysis","authors":"Daeun Kim, Jeonghun Park, Jinseok Choi, and Namyoon Lee","authorsParsed":[["Kim","Daeun",""],["Park","Jeonghun",""],["Choi","Jinseok",""],["Lee","Namyoon",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 06:15:39 GMT"}],"updateDate":"2024-08-23","timestamp":1724307339000,"abstract":"  Low Earth orbit (LEO) satellite networks with mega constellations have the\npotential to provide 5G and beyond services ubiquitously. However, these\nnetworks may introduce mutual interference to both satellite and terrestrial\nnetworks, particularly when sharing spectrum resources. In this paper, we\npresent a system-level performance analysis to address these interference\nissues using the tool of stochastic geometry. We model the spatial\ndistributions of satellites, satellite users, terrestrial base stations (BSs),\nand terrestrial users using independent Poisson point processes on the surfaces\nof concentric spheres. Under these spatial models, we derive analytical\nexpressions for the ergodic spectral efficiency of uplink (UL) and downlink\n(DL) satellite networks when they share spectrum with both UL and DL\nterrestrial networks. These derived ergodic expressions capture comprehensive\nnetwork parameters, including the densities of satellite and terrestrial\nnetworks, the path-loss exponent, and fading. From our analysis, we determine\nthe conditions under which spectrum sharing with UL terrestrial networks is\nadvantageous for both UL and DL satellite networks. Our key finding is that the\noptimal spectrum sharing configuration among the four possible configurations\ndepends on the density ratio between terrestrial BSs and users, providing a\ndesign guideline for spectrum management. Simulation results confirm the\naccuracy of our derived expressions.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}