{"id":"2408.13619","title":"STAResNet: a Network in Spacetime Algebra to solve Maxwell's PDEs","authors":"Alberto Pepe, Sven Buchholz, Joan Lasenby","authorsParsed":[["Pepe","Alberto",""],["Buchholz","Sven",""],["Lasenby","Joan",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 16:23:10 GMT"}],"updateDate":"2024-08-27","timestamp":1724516590000,"abstract":"  We introduce STAResNet, a ResNet architecture in Spacetime Algebra (STA) to\nsolve Maxwell's partial differential equations (PDEs). Recently, networks in\nGeometric Algebra (GA) have been demonstrated to be an asset for truly\ngeometric machine learning. In \\cite{brandstetter2022clifford}, GA networks\nhave been employed for the first time to solve partial differential equations\n(PDEs), demonstrating an increased accuracy over real-valued networks. In this\nwork we solve Maxwell's PDEs both in GA and STA employing the same ResNet\narchitecture and dataset, to discuss the impact that the choice of the right\nalgebra has on the accuracy of GA networks. Our study on STAResNet shows how\nthe correct geometric embedding in Clifford Networks gives a mean square error\n(MSE), between ground truth and estimated fields, up to 2.6 times lower than\nthan obtained with a standard Clifford ResNet with 6 times fewer trainable\nparameters. STAREsNet demonstrates consistently lower MSE and higher\ncorrelation regardless of scenario. The scenarios tested are: sampling period\nof the dataset; presence of obstacles with either seen or unseen\nconfigurations; the number of channels in the ResNet architecture; the number\nof rollout steps; whether the field is in 2D or 3D space. This demonstrates how\nchoosing the right algebra in Clifford networks is a crucial factor for more\ncompact, accurate, descriptive and better generalising pipelines.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}