{"id":"2408.12517","title":"Expected Impact of Rubin Observatory LSST on NEO Follow-up","authors":"Tom Wagg, Mario Juric, Peter Yoachim, Jake Kurlander, Sam Cornwall,\n  Joachim Moeyens, Siegfried Eggl, R. Lynne Jones and Peter Birtwhistle","authorsParsed":[["Wagg","Tom",""],["Juric","Mario",""],["Yoachim","Peter",""],["Kurlander","Jake",""],["Cornwall","Sam",""],["Moeyens","Joachim",""],["Eggl","Siegfried",""],["Jones","R. Lynne",""],["Birtwhistle","Peter",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 16:14:21 GMT"}],"updateDate":"2024-08-23","timestamp":1724343261000,"abstract":"  We simulate and analyse the contribution of the Rubin Observatory Legacy\nSurvey of Space and Time (LSST) to the rate of discovery of Near Earth Object\n(NEO) candidates, their submission rates to the NEO Confirmation page (NEOCP),\nand the resulting demands on the worldwide NEO follow-up observation system. We\nfind that, when using current NEOCP listing criteria, Rubin will typically\ncontribute ~129 new objects to the NEOCP each night in the first year, an\nincrease of ~8x relative to present day. Only 8.3% of the objects listed for\nfollow-up will be NEOs, with the primary contaminant being a background of yet\nundiscovered, faint, main belt asteroids (MBAs). We consider follow-up\nprioritisation strategies to lessen the impact on the NEO follow-up system. We\ndevelop an algorithm that predicts (with 68% accuracy) whether Rubin itself\nwill self recover any given tracklet; external follow-up of such candidates can\nbe de-prioritised. With this algorithm enabled, the follow-up list would be\nreduced to 64 NEO candidates per night (with ~8.4% purity). We propose\nadditional criteria based on trailing, apparent magnitude, and ecliptic\nlatitude to further prioritise follow-up. We hope observation planners and\nbrokers will adopt some of these open-source algorithms, enabling the follow-up\ncommunity to effectively keep up with the NEOCP in the early years of LSST.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"QpFP47pvgBVOYpEtu5c-hPdM33MALgatz4DHwZ1d51M","pdfSize":"1873742"}
