{"id":"2408.05185","title":"Efficient Unit Commitment Constraint Screening under Uncertainty","authors":"Xuan He, Honglin Wen, Yufan Zhang, Yize Chen, and Danny H. K. Tsang","authorsParsed":[["He","Xuan",""],["Wen","Honglin",""],["Zhang","Yufan",""],["Chen","Yize",""],["Tsang","Danny H. K.",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 17:18:20 GMT"}],"updateDate":"2024-08-12","timestamp":1723223900000,"abstract":"  Day-ahead unit commitment (UC) is a fundamental task for power system\noperators, where generator statuses and power dispatch are determined based on\nthe forecasted nodal net demands. The uncertainty inherent in renewables and\nload forecasting requires the use of techniques in optimization under\nuncertainty to find more resilient and reliable UC solutions. However, the\nsolution procedure of such specialized optimization may differ from the\ndeterministic UC. The original constraint screening approach can be unreliable\nand inefficient for them. Thus, in this work we design a novel screening\napproach under the forecasting uncertainty. Our approach accommodates such\nuncertainties in both chance-constrained and robust forms, and can greatly\nreduce the UC instance size by screening out non-binding constraints. To\nfurther improve the screening efficiency, we utilize the multi-parametric\nprogramming theory to convert the underlying optimization problem of the\nscreening model to a piecewise affine function. A multi-area screening approach\nis further developed to handle the computational intractability issues for\nlarge-scale problems. We verify the proposed method's performance on a variety\nof UC setups and uncertainty situations. Experimental results show that our\nrobust screening procedure can guarantee better feasibility, while the CC\nscreening can produce more efficient reduced models. The average screening time\nfor a single line flow constraint can be accelerated by 71.2X to 131.3X using\nour proposed method.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}