{"id":"2408.15192","title":"Simultaneously Constraining the Neutron Star Equation of State and Mass\n  Distribution through Multimessenger Observations and Nuclear Benchmarks","authors":"Bhaskar Biswas and Stephan Rosswog","authorsParsed":[["Biswas","Bhaskar",""],["Rosswog","Stephan",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 16:51:51 GMT"}],"updateDate":"2024-08-28","timestamp":1724777511000,"abstract":"  With ongoing advancements in nuclear theory and experimentation, together\nwith a growing body of neutron star (NS) observations, a wealth of information\non the equation of state (EOS) for matter at extreme densities has become\naccessible. Here, we utilize a hybrid EOS formulation that combines an\nempirical parameterization centered around the nuclear saturation density with\na generic three-segment piecewise polytrope model at higher densities. We\nincorporate data derived from chiral effective field theory ($\\chi$EFT),\nperturbative quantum chromodynamics (pQCD), and from experiments such as\nPREX-II and CREX. Furthermore, we examine the influence of a total of 129 NS\nmass measurements up to April 2023, as well as simultaneous mass and radius\nmeasurements derived from the X-ray emission from surface hot spots on NSs.\nAdditionally, we consider constraints on tidal properties inferred from the\ngravitational waves emitted by coalescing NS binaries. To integrate this\nextensive and varied array of constraints, we utilize a hierarchical Bayesian\nstatistical framework to simultaneously deduce the EOS and the distribution of\nNS masses. We find that incorporating data from $\\chi$EFT significantly\ntightens the constraints on the EOS of NSs near or below the nuclear saturation\ndensity. However, constraints derived from pQCD computations and nuclear\nexperiments such as PREX-II and CREX have minimal impact.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology","Physics/Nuclear Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}