{"id":"2408.05277","title":"Non-Fermi liquid to charge-transfer Mott insulator in flat bands of\n  copper-doped lead apatite","authors":"Sun-Woo Kim, Kristjan Haule, Gheorghe Lucian Pascut, and Bartomeu\n  Monserrat","authorsParsed":[["Kim","Sun-Woo",""],["Haule","Kristjan",""],["Pascut","Gheorghe Lucian",""],["Monserrat","Bartomeu",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 18:02:44 GMT"}],"updateDate":"2024-08-13","timestamp":1723226564000,"abstract":"  Copper-doped lead apatite, called LK-99, was initially claimed to be a room\ntemperature superconductor driven by flat electron bands, but was later found\nto be a wide gap insulator. Despite the lack of room temperature\nsuperconductivity, there is growing evidence that LK-99 and related compounds\nhost various strong electron correlation phenomena arising from their flat\nelectron bands. Depending on the copper doping site and crystal structure,\nLK-99 can exhibit two distinct flat bands crossing the Fermi level in the\nnon-interacting limit: either a single or two entangled flat bands. We explore\npotential correlated metallic and insulating phases in the flat bands of LK-99\ncompounds by constructing their correlation phase diagrams, and find both\nnon-Fermi liquid and Mott insulating states. We demonstrate that LK-99 is a\ncharge-transfer Mott insulator driven by strong electron correlations,\nregardless of the flat band type. We also find that the non-Fermi liquid state\nin the multi-flat band system exhibits strange metal behaviour, while the\ncorresponding state in the single flat band system exhibits pseudogap\nbehaviour. Our findings align with available experimental observations and\nprovide crucial insights into the correlation phenomenology of LK-99 and\nrelated compounds that could arise independently of superconductivity. Overall,\nour research highlights that LK-99 and related compounds offer a compelling\nplatform for investigating correlation physics in flat band systems.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ITCPwGTa4TCpWHn9kfB0-Wg7JFAh8aWaJ5Lp2tXaGI4","pdfSize":"2754754"}
