{"id":"2408.08671","title":"Towards Physical World Backdoor Attacks against Skeleton Action\n  Recognition","authors":"Qichen Zheng, Yi Yu, Siyuan Yang, Jun Liu, Kwok-Yan Lam, and Alex Kot","authorsParsed":[["Zheng","Qichen",""],["Yu","Yi",""],["Yang","Siyuan",""],["Liu","Jun",""],["Lam","Kwok-Yan",""],["Kot","Alex",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 11:29:33 GMT"}],"updateDate":"2024-08-19","timestamp":1723807773000,"abstract":"  Skeleton Action Recognition (SAR) has attracted significant interest for its\nefficient representation of the human skeletal structure. Despite its\nadvancements, recent studies have raised security concerns in SAR models,\nparticularly their vulnerability to adversarial attacks. However, such\nstrategies are limited to digital scenarios and ineffective in physical\nattacks, limiting their real-world applicability. To investigate the\nvulnerabilities of SAR in the physical world, we introduce the Physical\nSkeleton Backdoor Attacks (PSBA), the first exploration of physical backdoor\nattacks against SAR. Considering the practicalities of physical execution, we\nintroduce a novel trigger implantation method that integrates infrequent and\nimperceivable actions as triggers into the original skeleton data. By\nincorporating a minimal amount of this manipulated data into the training set,\nPSBA enables the system misclassify any skeleton sequences into the target\nclass when the trigger action is present. We examine the resilience of PSBA in\nboth poisoned and clean-label scenarios, demonstrating its efficacy across a\nrange of datasets, poisoning ratios, and model architectures. Additionally, we\nintroduce a trigger-enhancing strategy to strengthen attack performance in the\nclean label setting. The robustness of PSBA is tested against three distinct\nbackdoor defenses, and the stealthiness of PSBA is evaluated using two\nquantitative metrics. Furthermore, by employing a Kinect V2 camera, we compile\na dataset of human actions from the real world to mimic physical attack\nsituations, with our findings confirming the effectiveness of our proposed\nattacks. Our project website can be found at\nhttps://qichenzheng.github.io/psba-website.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}