{"id":"2408.10278","title":"Why and How do Complex Systems Self-Organize at All? Average Action\n  Efficiency as a Predictor, Measure, Driver, and Mechanism of\n  Self-Organization","authors":"Matthew J Brouillet, Georgi Yordanov Georgiev","authorsParsed":[["Brouillet","Matthew J",""],["Georgiev","Georgi Yordanov",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 18:21:25 GMT"}],"updateDate":"2024-08-21","timestamp":1723918885000,"abstract":"  Self-organization in complex systems is a process in which randomness is\nreduced and emergent structures appear that allow the system to function in a\nmore competitive way with other states of the system or with other systems. It\noccurs only in the presence of energy gradients, facilitating energy\ntransmission through the system and entropy production. Being a dynamic\nprocess, self-organization requires a dynamic measure and dynamic principles.\nThe principles of decreasing unit action and increasing total action are two\ndynamic variational principles that are viable to utilize in a self-organizing\nsystem. Based on this, average action efficiency can serve as a quantitative\nmeasure of the degree of self-organization. Positive feedback loops connect\nthis measure with all other characteristics of a complex system, providing all\nof them with a mechanism for exponential growth, and indicating power law\nrelationships between each of them as confirmed by data and simulations. In\nthis study, we apply those principles and the model to agent-based simulations.\nWe find that those principles explain self-organization well and that the\nresults confirm the model. By measuring action efficiency we can have a new\nanswer to the question: \"What is complexity and how complex is a system?\". This\nwork shows the explanatory and predictive power of those models, which can help\nunderstand and design better complex systems.\n","subjects":["Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://creativecommons.org/licenses/by/4.0/"}