{"id":"2408.13580","title":"Semi-Separable Mechanisms in Multi-Item Robust Screening","authors":"Shixin Wang","authorsParsed":[["Wang","Shixin",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 13:32:02 GMT"}],"updateDate":"2024-08-28","timestamp":1724506322000,"abstract":"  It is generally challenging to characterize the optimal selling mechanism\neven when the seller knows the buyer's valuation distributions in multi-item\nscreening. An insightful and significant result in robust mechanism design\nliterature is that if the seller knows only marginal distributions of the\nbuyer's valuation, then separable mechanisms, in which all items are sold\nindependently, are robustly optimal under the maximin revenue objectives. While\nthe separable mechanism is simple to implement, the literature also indicates\nthat separate selling can not guarantee any substantial fraction of the\npotential optimal revenue for given distributions. To design a simple mechanism\nwith a good performance guarantee, we introduce a novel class of mechanisms,\ntermed \"semi-separable mechanism\". In these mechanisms, the allocation and\npayment rule of each item is a function solely of the corresponding item's\nvaluation, which retains the separable mechanism's practical simplicity.\nHowever, the design of the allocation and payment function is enhanced by\nleveraging the joint distributional information, thereby improving the\nperformance guarantee against the hindsight optimal revenue. We establish that\na semi-separable mechanism achieves the optimal performance ratio among all\nincentive-compatible and individually rational mechanisms when only marginal\nsupport information is known. This result demonstrates that the semi-separable\nmechanisms ensure both the interpretation and implementation simplicity, and\nperformance superiority. Our framework is also applicable to scenarios where\nthe seller possesses information about the aggregate valuations of product\nbundles within any given partition of the product set. Furthermore, our results\nalso provide guidelines for the multi-item screening problem with non-standard\nambiguity sets.\n","subjects":["Economics/Theoretical Economics","Computing Research Repository/Computer Science and Game Theory","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}