{"id":"2408.07932","title":"MobileMEF: Fast and Efficient Method for Multi-Exposure Fusion","authors":"Lucas Nedel Kirsten, Zhicheng Fu, Nikhil Ambha Madhusudhana","authorsParsed":[["Kirsten","Lucas Nedel",""],["Fu","Zhicheng",""],["Madhusudhana","Nikhil Ambha",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 05:03:14 GMT"}],"updateDate":"2024-08-16","timestamp":1723698194000,"abstract":"  Recent advances in camera design and imaging technology have enabled the\ncapture of high-quality images using smartphones. However, due to the limited\ndynamic range of digital cameras, the quality of photographs captured in\nenvironments with highly imbalanced lighting often results in poor-quality\nimages. To address this issue, most devices capture multi-exposure frames and\nthen use some multi-exposure fusion method to merge those frames into a final\nfused image. Nevertheless, most traditional and current deep learning\napproaches are unsuitable for real-time applications on mobile devices due to\ntheir heavy computational and memory requirements. We propose a new method for\nmulti-exposure fusion based on an encoder-decoder deep learning architecture\nwith efficient building blocks tailored for mobile devices. This efficient\ndesign makes our model capable of processing 4K resolution images in less than\n2 seconds on mid-range smartphones. Our method outperforms state-of-the-art\ntechniques regarding full-reference quality measures and computational\nefficiency (runtime and memory usage), making it ideal for real-time\napplications on hardware-constrained devices. Our code is available at:\nhttps://github.com/LucasKirsten/MobileMEF.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"CXIgWISswHqxi0jBq9mG5rCtp0FdotS3jGj_z8Vd87w","pdfSize":"25784197"}
