{"id":"2408.14367","title":"Holstein polaron in a pseudospin-$1$ quantum spin Hall system: first and\n  second order topological phase transitions","authors":"Kuntal Bhattacharyya, Srijata Lahiri, Mijanur Islam, and Saurabh Basu","authorsParsed":[["Bhattacharyya","Kuntal",""],["Lahiri","Srijata",""],["Islam","Mijanur",""],["Basu","Saurabh",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 15:44:05 GMT"}],"updateDate":"2024-08-27","timestamp":1724687045000,"abstract":"  We theoretically propose the occurrence of a quantum spin Hall (QSH) and a\nsecond order topological phase transition (TPT) driven by electron-phonon (e-p)\ncoupling in a pseudospin-$1$ fermionic system on an $\\alpha$-$T_3$ lattice. Our\nmodel is formulated in the spirit of the Kane-Mele model modified by the\nHolstein Hamiltonian. The Lang-Firsov approach is employed to describe polarons\nreasonably well in the anti-adiabatic (high frequency) limit and to obtain an\neffective electronic Hamiltonian. It is shown that the system possesses\ntopologically nontrivial phases up to a critical e-p coupling, $\\lambda_c$ and\nare characterized by the helical QSH edge states along with a non-zero\n$\\mathbb{Z}_2$ invariant for a certain range of $\\alpha$. The topological phase\nvanishes beyond $\\lambda_c$ and is accompanied by a bulk gap closing transition\nat $\\lambda_c$, manifesting a TPT. We observe a more intriguing phenomenon for\nhigher values of $\\alpha$, where the system exhibits TPTs supported by two\ndistinct gap closing transitions at $\\lambda_{c_1}$ and $\\lambda_{c_2}$, while\na slim region at slightly lower values hosts a semi-metallic signature below\n$\\lambda_{c_1}$. Subsequently, to explore more intricate features, we introduce\na time reversal symmetry breaking magnetic field to trigger the formation of a\nsecond order topological phase. The magnetic field, by construction causes a\nboundary dependent gapping out of the edge states, consequently giving rise to\nrobust corner modes in a tailored open boundary conditions. We justify the\nformation of the higher order phase by employing an appropriate invariant,\nnamely the projected spin Chern number. Finally, we show that the e-p coupling\nsignificantly influences the corner modes (and also the real space energy\nbandstructure), corroborating a higher order TPT as we tune $\\lambda$ beyond a\ncritical value for a given value of $\\alpha$.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}