{"id":"2408.01734","title":"Something from Nothing: Enhanced Laser Cooling of a Mechanical Resonator\n  via Zero-Photon Detection","authors":"Evan A. Cryer-Jenkins, Kyle D. Major, Jack Clarke, Georg Enzian,\n  Magdalena Szczykulska, Jinglei Zhang, Arjun Gupta, Anthony C. Leung, Harsh\n  Rathee, Andreas {\\O}. Svela, Anthony K. C. Tan, Almut Beige, Klaus M{\\o}lmer,\n  and Michael R. Vanner","authorsParsed":[["Cryer-Jenkins","Evan A.",""],["Major","Kyle D.",""],["Clarke","Jack",""],["Enzian","Georg",""],["Szczykulska","Magdalena",""],["Zhang","Jinglei",""],["Gupta","Arjun",""],["Leung","Anthony C.",""],["Rathee","Harsh",""],["Svela","Andreas Ø.",""],["Tan","Anthony K. C.",""],["Beige","Almut",""],["Mølmer","Klaus",""],["Vanner","Michael R.",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 10:25:10 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 15:37:03 GMT"}],"updateDate":"2024-08-07","timestamp":1722680710000,"abstract":"  Throughout quantum science and technology, measurement is used as a powerful\nresource for nonlinear operations and quantum state engineering. In particular,\nsingle-photon detection is commonly employed for quantum-information\napplications and tests of fundamental physics. By contrast, and perhaps\ncounter-intuitively, measurement of the absence of photons also provides useful\ninformation, and offers significant potential for a wide range of new\nexperimental directions. Here, we propose and experimentally demonstrate\ncooling of a mechanical resonator below its laser-cooled mechanical occupation\nvia zero-photon detection on the anti-Stokes scattered optical field and verify\nthis cooling through heterodyne measurements. Our measurements are well\ncaptured by a stochastic master equation and the techniques introduced here\nopen new avenues for cooling, quantum thermodynamics, quantum state\nengineering, and quantum measurement and control.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}