{"id":"2408.11234","title":"Unified Deep Learning Model for Global Prediction of Aboveground\n  Biomass, Canopy Height and Cover from High-Resolution, Multi-Sensor Satellite\n  Imagery","authors":"Manuel Weber, Carly Beneke, Clyde Wheeler","authorsParsed":[["Weber","Manuel",""],["Beneke","Carly",""],["Wheeler","Clyde",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 23:15:41 GMT"}],"updateDate":"2024-08-22","timestamp":1724195741000,"abstract":"  Regular measurement of carbon stock in the world's forests is critical for\ncarbon accounting and reporting under national and international climate\ninitiatives, and for scientific research, but has been largely limited in\nscalability and temporal resolution due to a lack of ground based assessments.\nIncreasing efforts have been made to address these challenges by incorporating\nremotely sensed data. We present a new methodology which uses multi-sensor,\nmulti-spectral imagery at a resolution of 10 meters and a deep learning based\nmodel which unifies the prediction of above ground biomass density (AGBD),\ncanopy height (CH), canopy cover (CC) as well as uncertainty estimations for\nall three quantities. The model is trained on millions of globally sampled\nGEDI-L2/L4 measurements. We validate the capability of our model by deploying\nit over the entire globe for the year 2023 as well as annually from 2016 to\n2023 over selected areas. The model achieves a mean absolute error for AGBD\n(CH, CC) of 26.1 Mg/ha (3.7 m, 9.9 %) and a root mean squared error of 50.6\nMg/ha (5.4 m, 15.8 %) on a globally sampled test dataset, demonstrating a\nsignificant improvement over previously published results. We also report the\nmodel performance against independently collected ground measurements published\nin the literature, which show a high degree of correlation across varying\nconditions. We further show that our pre-trained model facilitates seamless\ntransferability to other GEDI variables due to its multi-head architecture.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"YHU8GOyP46DIk2jIeUkn5J0T5lP0etNyw6B3CHq5aLw","pdfSize":"20597360"}
