{"id":"2408.01622","title":"Positive-Unlabeled Constraint Learning (PUCL) for Inferring Nonlinear\n  Continuous Constraints Functions from Expert Demonstrations","authors":"Baiyu Peng, Aude Billard","authorsParsed":[["Peng","Baiyu",""],["Billard","Aude",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 01:09:48 GMT"}],"updateDate":"2024-08-06","timestamp":1722647388000,"abstract":"  Planning for a wide range of real-world robotic tasks necessitates to know\nand write all constraints. However, instances exist where these constraints are\neither unknown or challenging to specify accurately. A possible solution is to\ninfer the unknown constraints from expert demonstration. This paper presents a\nnovel Positive-Unlabeled Constraint Learning (PUCL) algorithm to infer a\ncontinuous arbitrary constraint function from demonstration, without requiring\nprior knowledge of the true constraint parameterization or environmental model\nas existing works. Within our framework, we treat all data in demonstrations as\npositive (feasible) data, and learn a control policy to generate potentially\ninfeasible trajectories, which serve as unlabeled data. In each iteration, we\nfirst update the policy and then a two-step positive-unlabeled learning\nprocedure is applied, where it first identifies reliable infeasible data using\na distance metric, and secondly learns a binary feasibility classifier (i.e.,\nconstraint function) from the feasible demonstrations and reliable infeasible\ndata. The proposed framework is flexible to learn complex-shaped constraint\nboundary and will not mistakenly classify demonstrations as infeasible as\nprevious methods. The effectiveness of the proposed method is verified in three\nrobotic tasks, using a networked policy or a dynamical system policy. It\nsuccessfully infers and transfers the continuous nonlinear constraints and\noutperforms other baseline methods in terms of constraint accuracy and policy\nsafety.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}