{"id":"2408.08040","title":"The inverse obstacle problem for nonlinear inclusions","authors":"Vincenzo Mottola, Antonio Corbo Esposito, Luisa Faella, Gianpaolo\n  Piscitelli, Ravi Prakash, Antonello Tamburrino","authorsParsed":[["Mottola","Vincenzo",""],["Esposito","Antonio Corbo",""],["Faella","Luisa",""],["Piscitelli","Gianpaolo",""],["Prakash","Ravi",""],["Tamburrino","Antonello",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 09:16:29 GMT"}],"updateDate":"2024-08-16","timestamp":1723713389000,"abstract":"  The Monotonocity Principle states a monotonic relationship between a possibly\nnon-linear material property and a proper corresponding boundary operator. The\nMonotonicity Principle (MP) has attracted great interest in the field of\ninverse problems, because of its fundamental role in developing real time\nimaging methods. Recently, with quite general assumptions, a MP in the presence\nof non linear materials has been established for elliptic PDE, such as those\ngoverning Electrical Resistance Tomography.\n  Together with recently introduced imaging methods and algorithms based on MP,\narises a fundamental question related to the Converse (of the MP). Indeed, the\nConverse of the MP is fundamental to define the theoretical limits of\napplicability of imaging methods and algorithms. Specifically, the Converse of\nthe MP guarantees that the outer boundary of a nonlinear anomaly can be\nreconstructed by means of MP based imaging methods.\n  In this paper, the Converse of the Monotonicity Principle for nonlinear\nanomaly embedded in a linear material is proved. The results is provided in a\nquite general setting for Electrical Resistance Tomography. Moreover, the\nnonlinear electrical conductivity of the anomaly, as function of the electric\nfield, can be either bounded or not bounded from infinity and/or zero.\n","subjects":["Mathematics/Analysis of PDEs","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}