{"id":"2408.10978","title":"First-principles investigation of elastic, vibrational, and\n  thermodynamic properties of kagome metals CsM$_3$Te$_5$ (M = Ti, Zr, Hf)","authors":"Yifan Wei, Arjyama Bordoloi, Chaon-En (Aaron) Chuang, and Sobhit Singh","authorsParsed":[["Wei","Yifan","","Aaron"],["Bordoloi","Arjyama","","Aaron"],["Chaon-En","","","Aaron"],["Chuang","",""],["Singh","Sobhit",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 16:12:18 GMT"}],"updateDate":"2024-08-21","timestamp":1724170338000,"abstract":"  Kagome metals are a unique class of quantum materials characterized by their\ndistinct atomic lattice arrangement, featuring interlocking triangles and\nexpansive hexagonal voids. These lattice structures impart exotic properties,\nincluding superconductivity, interaction-driven topological many-body\nphenomena, and magnetism, among others. The kagome metal CsM3Te5 (where M = Ti,\nZr, or Hf) exhibits both superconductivity and nontrivial topological\nelectronic properties, offering a promising platform for exploring topological\nsuperconductivity. This study employs first-principles density functional\ntheory calculations to systematically analyze the elastic, mechanical,\nvibrational, thermodynamic, and electronic properties of CsM3Te5 (M = Ti, Zr,\nHf). Our calculations reveal that the studied compounds - CsTi3Te5, CsZr3Te5,\nand CsHf3Te5 - are ductile metals with elastic properties akin to the hexagonal\nBi and Sb, with average elastic constants, including a bulk modulus of 27 GPa,\na shear modulus of 11 GPa, and Young's modulus of 29 GPa. We observe peculiar\ndispersionless, flat, phonon branches in the vibrational spectra of these\nmetals. Additionally, we thoroughly analyze the symmetries of the zone-center\nphonon eigenvectors and predict vibrational fingerprints of the Raman- and\ninfrared-active phonon modes. The analysis of thermodynamic properties reveals\nthe Einstein temperature for CsTi3Te5, CsZr3Te5, and CsHf3Te5 to be 66, 54, and\n53 K, respectively. Our orbital-decomposed electronic structure calculations\nreveal significant in-plane steric interactions and multiple Dirac band\ncrossings near the Fermi level. We further investigate the role of spin-orbit\ncoupling effect on the studied properties. This theoretical investigation sheds\nlight on the intriguing quantum behaviour of kagome metals and provides\nvaluable insights for their potential applications in future technologies.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}