{"id":"2408.01253","title":"Metareasoning in uncertain environments: a meta-BAMDP framework","authors":"Prakhar Godara, Tilman Diego Al\\'eman, Angela J. Yu","authorsParsed":[["Godara","Prakhar",""],["Aléman","Tilman Diego",""],["Yu","Angela J.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 13:15:01 GMT"}],"updateDate":"2024-08-05","timestamp":1722604501000,"abstract":"  In decision-making scenarios, \\textit{reasoning} can be viewed as an\nalgorithm $P$ that makes a choice of an action $a^* \\in \\mathcal{A}$, aiming to\noptimize some outcome such as maximizing the value function of a Markov\ndecision process (MDP). However, executing $P$ itself may bear some costs\n(time, energy, limited capacity, etc.) and needs to be considered alongside\nexplicit utility obtained by making the choice in the underlying decision\nproblem. Such costs need to be taken into account in order to accurately model\nhuman behavior, as well as optimizing AI planning, as all physical systems are\nbound to face resource constraints. Finding the right $P$ can itself be framed\nas an optimization problem over the space of reasoning processes $P$, generally\nreferred to as \\textit{metareasoning}. Conventionally, human metareasoning\nmodels assume that the agent knows the transition and reward distributions of\nthe underlying MDP. This paper generalizes such models by proposing a meta\nBayes-Adaptive MDP (meta-BAMDP) framework to handle metareasoning in\nenvironments with unknown reward/transition distributions, which encompasses a\nfar larger and more realistic set of planning problems that humans and AI\nsystems face. As a first step, we apply the framework to two-armed Bernoulli\nbandit (TABB) tasks, which have often been used to study human decision making.\nOwing to the meta problem's complexity, our solutions are necessarily\napproximate, but nevertheless robust within a range of assumptions that are\narguably realistic for human decision-making scenarios. These results offer a\nnormative framework for understanding human exploration under cognitive\nconstraints. This integration of Bayesian adaptive strategies with\nmetareasoning enriches both the theoretical landscape of decision-making\nresearch and practical applications in designing AI systems that plan under\nuncertainty and resource constraints.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"djJEzWINuDrU9qyS0260x2AAlyLZRjJIFvs0dybq1EE","pdfSize":"1106852"}
