{"id":"2408.07920","title":"Free Standing Epitaxial Oxides Through Remote Epitaxy: The Role of the\n  Evolving Graphene Microstructure","authors":"Asraful Haque, Suman Kumar Mandal, Shubham Kumar Parate, Harshal Jason\n  Dsouza, Sakshi Chandola, Pavan Nukala, Srinivasan Raghavan","authorsParsed":[["Haque","Asraful",""],["Mandal","Suman Kumar",""],["Parate","Shubham Kumar",""],["Dsouza","Harshal Jason",""],["Chandola","Sakshi",""],["Nukala","Pavan",""],["Raghavan","Srinivasan",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 04:09:36 GMT"}],"updateDate":"2024-08-16","timestamp":1723694976000,"abstract":"  Remote epitaxy has garnered considerable attention as a promising method that\nfacilitates the growth of thin films that replicate the crystallographic\ncharacteristics of a substrate by utilizing two-dimensional (2D) material\ninterlayers like graphene. The resulting film can be exfoliated to form a\nfreestanding membrane, and the substrate, if expensive, can be reused. However,\natomically thin 2-D materials are susceptible to damage before and during film\ngrowth in the chamber, leading to a poor epitaxy. Oxide remote epitaxy using\ngraphene, the most commonly available 2D material, is particularly challenging\nbecause the conventional conditions employed for the growth of epitaxial oxides\nalso degrade graphene. In this study, we show for the first time that a direct\ncorrelation exists between the microstructure of graphene, its getting\ndefective on exposure to the pulsed laser deposition plume, and the crystalline\nquality of the barium titanate film deposited on top. A controlled aperture\nmethod was used to reduce graphene damage. Even so, the degree of damage is\nmore at the graphene grain boundaries than within the grains. Large grain-sized\ngreater than 300 microns, graphene suffered less damage and yielded a film\ncomparable to that grown directly on a strontium titanate substrate with a\nrocking curve half width of 0.6 degrees. Using large grain-sized bi-layer\ngraphene, 4 mm x 5 mm oxide layers were successfully exfoliated and transferred\nonto SiOx-Si. These insights pave the way for the heterogeneous integration of\nfunctional oxides on foreign substrates, holding significant implications for\ncommercializing perovskite oxides by integrating them with Si-CMOS and flexible\nelectronics.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}