{"id":"2408.04036","title":"Structural transitions of calcium carbonate by molecular dynamics\n  simulation","authors":"Elizaveta Sidler and Raffaela Cabriolu","authorsParsed":[["Sidler","Elizaveta",""],["Cabriolu","Raffaela",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 18:32:23 GMT"}],"updateDate":"2024-08-09","timestamp":1723055543000,"abstract":"  Calcium carbonate plays a crucial role in the global carbon cycle, and its\nphase diagram has always been of significant scientific interest. In this\nstudy, we used molecular dynamics (MD) to investigate several structural phase\ntransitions of calcium carbonate. Using the Raiteri potential model, we\nexplored the structural transitions occurring at a constant pressure of 1 bar\nwith temperatures ranging from 300 K to 2500 K, and at a constant temperature\nof 1600 K with pressures ranging from 0 to 13 GPa. At increasing temperatures,\nthe transitions calcite, CaCO$_3$-IV, and CaCO$_3$-V are observed and\ncharacterized. Within the calcite structure, CO$_3^{2-}$ ions are ordered\nbetween layers. As temperature increases, the calcite to CaCO$_3$-IV transition\noccurs, determining the partial disordering of CO$_3^{2-}$ ions. At a higher\ntemperature, CaCO$_3$-IV transforms into CaCO$_3$-V. By applying free energy\nanalysis, we have classified the last transition as a continuous order-disorder\nphase transition. At a temperature of 2000 K, it appears a `disordered\nCaCO$_3$' structure, characterized by low order within the calcium and\ncarbonate sublattices and the free rotation of CO$_3^{2-}$ ions. At increasing\npressures, two calcium carbonate transformations were observed. At $P=$ 2 GPa,\nthe CaCO$_3$-IV phase undergoes a phase transition into CaCO$_3$-V,\ndemonstrating that the model can describe the transition between these two\nphases as pressure and temperature-driven. Another phase transition was\ndetected at $P=$ 4.25 GPa -- CaCO$_3$-V transits into the recently discovered\nCaCO$_3$-Vb phase. This transition is classified as a first-order phase\ntransition by structural analysis and free energy-based arguments.\n","subjects":["Condensed Matter/Statistical Mechanics","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}