{"id":"2408.11971","title":"HoSZp: An Efficient Homomorphic Error-bounded Lossy Compressor for\n  Scientific Data","authors":"Tripti Agarwal, Sheng Di, Jiajun Huang, Yafan Huang, Ganesh\n  Gopalakrishnan, Robert Underwood, Kai Zhao, Xin Liang, Guanpeng Li, Franck\n  Cappello","authorsParsed":[["Agarwal","Tripti",""],["Di","Sheng",""],["Huang","Jiajun",""],["Huang","Yafan",""],["Gopalakrishnan","Ganesh",""],["Underwood","Robert",""],["Zhao","Kai",""],["Liang","Xin",""],["Li","Guanpeng",""],["Cappello","Franck",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 19:51:03 GMT"}],"updateDate":"2024-08-23","timestamp":1724269863000,"abstract":"  Error-bounded lossy compression has been a critical technique to\nsignificantly reduce the sheer amounts of simulation datasets for\nhigh-performance computing (HPC) scientific applications while effectively\ncontrolling the data distortion based on user-specified error bound. In many\nreal-world use cases, users must perform computational operations on the\ncompressed data (a.k.a. homomorphic compression). However, none of the existing\nerror-bounded lossy compressors support the homomorphism, inevitably resulting\nin undesired decompression costs. In this paper, we propose a novel homomorphic\nerror-bounded lossy compressor (called HoSZp), which supports not only\nerror-bounding features but efficient computations (including negation,\naddition, multiplication, mean, variance, etc.) on the compressed data without\nthe complete decompression step, which is the first attempt to the best of our\nknowledge. We develop several optimization strategies to maximize the overall\ncompression ratio and execution performance. We evaluate HoSZp compared to\nother state-of-the-art lossy compressors based on multiple real-world\nscientific application datasets.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Eysq3evqG4wO9ZJ0o9C7bt3qTuH6z-HOfLdsYI9wMs0","pdfSize":"1969490"}
