{"id":"2408.03756","title":"A Versatile Pilot Design Scheme for FDD Systems Utilizing Gaussian\n  Mixture Models","authors":"Nurettin Turan, Benedikt B\\\"ock, Benedikt Fesl, Michael Joham, Deniz\n  G\\\"und\\\"uz, Wolfgang Utschick","authorsParsed":[["Turan","Nurettin",""],["Böck","Benedikt",""],["Fesl","Benedikt",""],["Joham","Michael",""],["Gündüz","Deniz",""],["Utschick","Wolfgang",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 13:15:50 GMT"}],"updateDate":"2024-08-08","timestamp":1723036550000,"abstract":"  In this work, we propose a Gaussian mixture model (GMM)-based pilot design\nscheme for downlink (DL) channel estimation in single- and multi-user\nmultiple-input multiple-output (MIMO) frequency division duplex (FDD) systems.\nIn an initial offline phase, the GMM captures prior information during\ntraining, which is then utilized for pilot design. In the single-user case, the\nGMM is utilized to construct a codebook of pilot matrices and, once shared with\nthe mobile terminal (MT), can be employed to determine a feedback index at the\nMT. This index selects a pilot matrix from the constructed codebook,\neliminating the need for online pilot optimization. We further establish a sum\nconditional mutual information (CMI)-based pilot optimization framework for\nmulti-user MIMO (MU-MIMO) systems. Based on the established framework, we\nutilize the GMM for pilot matrix design in MU-MIMO systems. The analytic\nrepresentation of the GMM enables the adaptation to any signal-to-noise ratio\n(SNR) level and pilot configuration without re-training. Additionally, an\nadaption to any number of MTs is facilitated. Extensive simulations demonstrate\nthe superior performance of the proposed pilot design scheme compared to\nstate-of-the-art approaches. The performance gains can be exploited, e.g., to\ndeploy systems with fewer pilots.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Z0ayXTB0sMz_QDHsGGE9ZNCSqM78pwSx2m2SPJzM80I","pdfSize":"626426"}
