{"id":"2408.04396","title":"Evaluating the Impact of Pulse Oximetry Bias in Machine Learning under\n  Counterfactual Thinking","authors":"In\\^es Martins, Jo\\~ao Matos, Tiago Gon\\c{c}alves, Leo A. Celi, A. Ian\n  Wong, Jaime S. Cardoso","authorsParsed":[["Martins","Inês",""],["Matos","João",""],["Gonçalves","Tiago",""],["Celi","Leo A.",""],["Wong","A. Ian",""],["Cardoso","Jaime S.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 12:03:03 GMT"}],"updateDate":"2024-08-09","timestamp":1723118583000,"abstract":"  Algorithmic bias in healthcare mirrors existing data biases. However, the\nfactors driving unfairness are not always known. Medical devices capture\nsignificant amounts of data but are prone to errors; for instance, pulse\noximeters overestimate the arterial oxygen saturation of darker-skinned\nindividuals, leading to worse outcomes. The impact of this bias in machine\nlearning (ML) models remains unclear. This study addresses the technical\nchallenges of quantifying the impact of medical device bias in downstream ML.\nOur experiments compare a \"perfect world\", without pulse oximetry bias, using\nSaO2 (blood-gas), to the \"actual world\", with biased measurements, using SpO2\n(pulse oximetry). Under this counterfactual design, two models are trained with\nidentical data, features, and settings, except for the method of measuring\noxygen saturation: models using SaO2 are a \"control\" and models using SpO2 a\n\"treatment\". The blood-gas oximetry linked dataset was a suitable test-bed,\ncontaining 163,396 nearly-simultaneous SpO2 - SaO2 paired measurements, aligned\nwith a wide array of clinical features and outcomes. We studied three\nclassification tasks: in-hospital mortality, respiratory SOFA score in the next\n24 hours, and SOFA score increase by two points. Models using SaO2 instead of\nSpO2 generally showed better performance. Patients with overestimation of O2 by\npulse oximetry of > 3% had significant decreases in mortality prediction\nrecall, from 0.63 to 0.59, P < 0.001. This mirrors clinical processes where\nbiased pulse oximetry readings provide clinicians with false reassurance of\npatients' oxygen levels. A similar degradation happened in ML models, with\npulse oximetry biases leading to more false negatives in predicting adverse\noutcomes.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}