{"id":"2408.00440","title":"An Empirical Study on Challenges of Event Management in Microservice\n  Architectures","authors":"Rodrigo Laigner and Ana Carolina Almeida and Wesley K. G.\n  Assun\\c{c}\\~ao and Yongluan Zhou","authorsParsed":[["Laigner","Rodrigo",""],["Almeida","Ana Carolina",""],["Assunção","Wesley K. G.",""],["Zhou","Yongluan",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 10:19:37 GMT"}],"updateDate":"2024-08-02","timestamp":1722507577000,"abstract":"  Microservices emerged as a popular architectural style over the last decade.\nAlthough microservices are designed to be self-contained, they must communicate\nto realize business capabilities, creating dependencies among their data and\nfunctionalities. Developers then resort to asynchronous, event-based\ncommunication to fulfill such dependencies while reducing coupling. However,\ndevelopers are often oblivious to the inherent challenges of the asynchronous\nand event-based paradigm, leading to frustrations and ultimately making them\nreconsider the adoption of microservices. To make matters worse, there is a\nscarcity of literature on the practices and challenges of designing,\nimplementing, testing, monitoring, and troubleshooting event-based\nmicroservices.\n  To fill this gap, this paper provides the first comprehensive\ncharacterization of event management practices and challenges in microservices\nbased on a repository mining study of over 8000 Stack Overflow questions.\nMoreover, 628 relevant questions were randomly sampled for an in-depth manual\ninvestigation of challenges. We find that developers encounter many problems,\nincluding large event payloads, modeling event schemas, auditing event flows,\nand ordering constraints in processing events. This suggests that developers\nare not sufficiently served by state-of-the-practice technologies. We provide\nactionable implications to developers, technology providers, and researchers to\nadvance event management in microservices.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}