{"id":"2408.08734","title":"User-centered evaluation of the Wearable Walker lower limb exoskeleton,\n  preliminary assessment based on the Experience protocol","authors":"Cristian Camardella, Vittorio Lippi, Francesco Porcini, Giulia\n  Bassani, Lucia Lencioni, Christoph Mauer, Christian Haverkamp, Carlo Alberto\n  Avizzano, Antonio Frisoli, Alessandro Filippeschi","authorsParsed":[["Camardella","Cristian",""],["Lippi","Vittorio",""],["Porcini","Francesco",""],["Bassani","Giulia",""],["Lencioni","Lucia",""],["Mauer","Christoph",""],["Haverkamp","Christian",""],["Avizzano","Carlo Alberto",""],["Frisoli","Antonio",""],["Filippeschi","Alessandro",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 13:33:27 GMT"}],"updateDate":"2024-08-19","timestamp":1723815207000,"abstract":"  Using lower-limbs exoskeletons provides potential advantages in terms of\nproductivity and safety associated with reduced stress. However, complex issues\nin human-robot interaction are still open, such as the physiological effects of\nexoskeletons and the impact on the user's subjective experience. In this work,\nan innovative exoskeleton, the Wearable Walker, is assessed using the\nEXPERIENCE benchmarking protocol from the EUROBENCH project. The Wearable\nWalker is a lower-limb exoskeleton that enhances human abilities, such as\ncarrying loads. The device uses a unique control approach called Blend Control\nthat provides smooth assistance torques. It operates two models simultaneously,\none in the case in which the left foot is grounded and another for the grounded\nright foot. These models generate assistive torques combined to provide\ncontinuous and smooth overall assistance, preventing any abrupt changes in\ntorque due to model switching. The EXPERIENCE protocol consists of walking on\nflat ground while gathering physiological signals such as heart rate, its\nvariability, respiration rate, and galvanic skin response and completing a\nquestionnaire. The test was performed with five healthy subjects. The scope of\nthe present study is twofold: to evaluate the specific exoskeleton and its\ncurrent control system to gain insight into possible improvements and to\npresent a case study for a formal and replicable benchmarking of wearable\nrobots.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wPSoOLjaFJ8u9zgV5xBbCEy3IEgTC3e_fdywhGKp17s","pdfSize":"7545599"}
