{"id":"2408.01445","title":"MiranDa: Mimicking the Learning Processes of Human Doctors to Achieve\n  Causal Inference for Medication Recommendation","authors":"Ziheng Wang, Xinhe Li, Haruki Momma, Ryoichi Nagatomi","authorsParsed":[["Wang","Ziheng",""],["Li","Xinhe",""],["Momma","Haruki",""],["Nagatomi","Ryoichi",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 01:08:57 GMT"}],"updateDate":"2024-08-06","timestamp":1721696937000,"abstract":"  To enhance therapeutic outcomes from a pharmacological perspective, we\npropose MiranDa, designed for medication recommendation, which is the first\nactionable model capable of providing the estimated length of stay in hospitals\n(ELOS) as counterfactual outcomes that guide clinical practice and model\ntraining. In detail, MiranDa emulates the educational trajectory of doctors\nthrough two gradient-scaling phases shifted by ELOS: an Evidence-based Training\nPhase that utilizes supervised learning and a Therapeutic Optimization Phase\ngrounds in reinforcement learning within the gradient space, explores optimal\nmedications by perturbations from ELOS. Evaluation of the Medical Information\nMart for Intensive Care III dataset and IV dataset, showcased the superior\nresults of our model across five metrics, particularly in reducing the ELOS.\nSurprisingly, our model provides structural attributes of medication\ncombinations proved in hyperbolic space and advocated \"procedure-specific\"\nmedication combinations. These findings posit that MiranDa enhanced medication\nefficacy. Notably, our paradigm can be applied to nearly all medical tasks and\nthose with information to evaluate predicted outcomes. The source code of the\nMiranDa model is available at https://github.com/azusakou/MiranDa.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}