{"id":"2408.06115","title":"Measurement Study of Programmable Network Coding in Cloud-native 5G and\n  Beyond Networks","authors":"Osel Lhamo, Tung V. Doan, Elif Tasdemir, Mahdi Attawna, Giang T.\n  Nguyen, Patrick Seeling, Martin Reisslein, Frank H.P. Fitzek","authorsParsed":[["Lhamo","Osel",""],["Doan","Tung V.",""],["Tasdemir","Elif",""],["Attawna","Mahdi",""],["Nguyen","Giang T.",""],["Seeling","Patrick",""],["Reisslein","Martin",""],["Fitzek","Frank H. P.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 12:56:24 GMT"}],"updateDate":"2024-08-13","timestamp":1723467384000,"abstract":"  Emerging 5G/6G use cases span various industries, necessitating flexible\nsolutions that leverage emerging technologies to meet diverse and stringent\napplication requirements under changing network conditions. The standard 5G RAN\nsolution, retransmission, reduces packet loss but can increase transmission\ndelay in the process. Random Linear Network Coding (RLNC) offers an alternative\nby proactively sending combinations of original packets, thus reducing both\ndelay and packet loss. Current research often only simulates the integration of\nRLNC in 5G while we implement and evaluate our approach on real commercially\navailable hardware in a real-world deployment.\n  We introduce Flexible Network Coding (FlexNC), which enables the flexible\nfusion of several RLNC protocols by incorporating a forwarder with multiple\nRLNC nodes. Network operators can configure FlexNC based on network conditions\nand application requirements. To further boost network programmability, our\nRecoder in the Network (RecNet) leverages intermediate network nodes to join\nthe coding process. Both the proposed algorithms have been implemented on\nOpenAirInterface and extensively tested with traffic from different\napplications in a real network. While FlexNC adapts to various application\nneeds of latency and packet loss, RecNet significantly minimizes packet loss\nfor a remote user with minimal increase in delay compared to pure RLNC.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/"}