{"id":"2408.06299","title":"Stabilizer Entanglement Distillation and Efficient Fault-Tolerant\n  Encoder","authors":"Yu Shi, Ashlesha Patil, Saikat Guha","authorsParsed":[["Shi","Yu",""],["Patil","Ashlesha",""],["Guha","Saikat",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 17:09:24 GMT"}],"updateDate":"2024-08-13","timestamp":1723482564000,"abstract":"  Entanglement is essential for quantum information processing but is limited\nby noise. We address this by developing high-yield entanglement distillation\nprotocols with several advancements. (1) We extend the 2-to-1 recurrence\nentanglement distillation protocol to higher-rate n-to-(n-1) protocols that can\ncorrect any single-qubit errors. These protocols are evaluated through\nnumerical simulations focusing on fidelity and yield. We also outline a method\nto adapt any classical error-correcting code for entanglement distillation,\nwhere the code can correct both bit-flip and phase-flip errors by incorporating\nHadamard gates. (2) We propose a constant-depth decoder for stabilizer codes\nthat transforms logical states into physical ones using single-qubit\nmeasurements. This decoder is applied to entanglement distillation protocols,\nreducing circuit depth and enabling protocols derived from advanced quantum\nerror-correcting codes. We demonstrate this by evaluating the circuit\ncomplexity for entanglement distillation protocols based on surface codes and\nquantum convolutional codes. (3) Our stabilizer entanglement distillation\ntechniques advance quantum computing. We propose a fault-tolerant protocol for\nconstant-depth encoding and decoding of arbitrary quantum states, applicable to\nquantum low-density parity-check (qLDPC) codes and surface codes. This protocol\nis feasible with state-of-the-art reconfigurable atom arrays and surpasses the\nlimits of conventional logarithmic depth encoders. Overall, our study\nintegrates stabilizer formalism, measurement-based quantum computing, and\nentanglement distillation, advancing both quantum communication and computing.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}