{"id":"2408.09901","title":"Electrostatic Control of Magneto-Optic Excitonic Resonances in the van\n  der Waals Ferromagnetic Semiconductor Cr$_2$Ge$_2$Te$_6$","authors":"Freddie Hendriks, Alexander N. Rudenko, Malte Roesner, and Marcos H.\n  D. Guimaraes","authorsParsed":[["Hendriks","Freddie",""],["Rudenko","Alexander N.",""],["Roesner","Malte",""],["Guimaraes","Marcos H. D.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 11:15:42 GMT"}],"updateDate":"2024-08-20","timestamp":1724066142000,"abstract":"  Two-dimensional magnetic materials exhibit strong magneto-optic effects and\nhigh tunability by electrostatic gating, making them very attractive for new\nmagneto-photonic devices. Here, we characterize the magneto-optic Kerr effect\n(MOKE) spectrum of thin Cr$_2$Ge$_2$Te$_6$ from 1.13 to 2.67 eV, and\ndemonstrate electrostatic control over of its magnetic and magneto-optic\nproperties. The MOKE spectrum exhibits a strong feature around 1.43 eV which we\nattribute to a magnetic exchange-split excitonic state in Cr$_2$Ge$_2$Te$_6$,\nin agreement with \\textit{ab-initio} calculations. The gate dependence of the\nMOKE signals shows that the magneto-optical efficiency - rather than the\nsaturation magnetization - is affected by electrostatic gating. We demonstrate\na modulation of the magneto-optical strength by over 1 mdeg, with some\nwavelengths showing a modulation of 65% of the total magneto-optical signals,\nopening the door for efficient electrical control over light polarization\nthrough two-dimensional magnets. Our findings bring forward the fundamental\nunderstanding of magneto-optic processes in two-dimensional magnets and are\nhighly relevant for the engineering of devices which exploit excitonic\nresonances for electrically-tunable magneto-photonic devices.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SOOiXXjf6JWEKij78LFYxUKyM7re0mKTC1_xHVvRTmQ","pdfSize":"594568"}
