{"id":"2408.16481","title":"A Deep-Learning-Based Label-free No-Reference Image Quality Assessment\n  Metric: Application in Sodium MRI Denoising","authors":"Shuaiyu Yuan, Tristan Whitmarsh, Dimitri A Kessler, Otso Arponen, Mary\n  A McLean, Gabrielle Baxter, Frank Riemer, Aneurin J Kennerley, William J\n  Brackenbury, Fiona J Gilbert, Joshua D Kaggie","authorsParsed":[["Yuan","Shuaiyu",""],["Whitmarsh","Tristan",""],["Kessler","Dimitri A",""],["Arponen","Otso",""],["McLean","Mary A",""],["Baxter","Gabrielle",""],["Riemer","Frank",""],["Kennerley","Aneurin J",""],["Brackenbury","William J",""],["Gilbert","Fiona J",""],["Kaggie","Joshua D",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 12:16:55 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 13:12:23 GMT"}],"updateDate":"2024-09-04","timestamp":1724933815000,"abstract":"  New multinuclear MRI techniques, such as sodium MRI, generally suffer from\nlow image quality due to an inherently low signal. Postprocessing methods, such\nas image denoising, have been developed for image enhancement. However, the\nassessment of these enhanced images is challenging especially considering when\nthere is a lack of high resolution and high signal images as reference, such as\nin sodium MRI. No-reference Image Quality Assessment (NR-IQA) metrics are\napproaches to solve this problem. Existing learning-based NR-IQA metrics rely\non labels derived from subjective human opinions or metrics like\nSignal-to-Noise Ratio (SNR), which are either time-consuming or lack accurate\nground truths, resulting in unreliable assessment. We note that deep learning\n(DL) models have a unique characteristic in that they are specialized to a\ncharacteristic training set, meaning that deviations between the input testing\ndata from the training data will reduce prediction accuracy. Therefore, we\npropose a novel DL-based NR-IQA metric, the Model Specialization Metric (MSM),\nwhich does not depend on ground-truth images or labels. MSM measures the\ndifference between the input image and the model's prediction for evaluating\nthe quality of the input image. Experiments conducted on both simulated\ndistorted proton T1-weighted MR images and denoised sodium MR images\ndemonstrate that MSM exhibits a superior evaluation performance on various\nsimulated noises and distortions. MSM also has a substantial agreement with the\nexpert evaluations, achieving an averaged Cohen's Kappa coefficient of 0.6528,\noutperforming the existing NR-IQA metrics.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}