{"id":"2408.00520","title":"OTCliM: generating a near-surface climatology of optical turbulence\n  strength ($C_n^2$) using gradient boosting","authors":"Maximilian Pierzyna, Sukanta Basu, Rudolf Saathof","authorsParsed":[["Pierzyna","Maximilian",""],["Basu","Sukanta",""],["Saathof","Rudolf",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 12:52:41 GMT"}],"updateDate":"2024-08-02","timestamp":1722516761000,"abstract":"  This study introduces OTCliM (Optical Turbulence Climatology using Machine\nlearning), a novel approach for deriving comprehensive climatologies of\natmospheric optical turbulence strength ($C_n^2$) using gradient boosting\nmachines. OTCliM addresses the challenge of efficiently obtaining reliable\nsite-specific $C_n^2$ climatologies, crucial for ground-based astronomy and\nfree-space optical communication. Using gradient boosting machines and global\nreanalysis data, OTCliM extrapolates one year of measured $C_n^2$ into a\nmulti-year time series. We assess OTCliM's performance using $C_n^2$ data from\n17 diverse stations in New York State, evaluating temporal extrapolation\ncapabilities and geographical generalization. Our results demonstrate accurate\npredictions of four held-out years of $C_n^2$ across various sites, including\ncomplex urban environments, outperforming traditional analytical models.\nNon-urban models also show good geographical generalization compared to urban\nmodels, which captured non-general site-specific dependencies. A feature\nimportance analysis confirms the physical consistency of the trained models. It\nalso indicates the potential to uncover new insights into the physical\nprocesses governing $C_n^2$ from data. OTCliM's ability to derive reliable\n$C_n^2$ climatologies from just one year of observations can potentially reduce\nresources required for future site surveys or enable studies for additional\nsites with the same resources.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"zYDZ6jyHeSpqb5tFTYYrLEs0bLZDNRf463lYKZW_53E","pdfSize":"2744838","txDigest":"dcWJbfq8wtVGWSFf9vL1REmrxaKECpn88Rmn22NwYLx","endEpoch":"1","status":"CERTIFIED"}
