{"id":"2408.06552","title":"HaptoFloater: Visuo-Haptic Augmented Reality by Embedding Imperceptible\n  Color Vibration Signals for Tactile Display Control in a Mid-Air Image","authors":"Rina Nagano, Takahiro Kinoshita, Shingo Hattori, Yuichi Hiroi, Yuta\n  Itoh, Takefumi Hiraki","authorsParsed":[["Nagano","Rina",""],["Kinoshita","Takahiro",""],["Hattori","Shingo",""],["Hiroi","Yuichi",""],["Itoh","Yuta",""],["Hiraki","Takefumi",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 01:31:34 GMT"}],"updateDate":"2024-08-14","timestamp":1723512694000,"abstract":"  We propose HaptoFloater, a low-latency mid-air visuo-haptic augmented reality\n(VHAR) system that utilizes imperceptible color vibrations. When adding tactile\nstimuli to the visual information of a mid-air image, the user should not\nperceive the latency between the tactile and visual information. However,\nconventional tactile presentation methods for mid-air images, based on\ncamera-detected fingertip positioning, introduce latency due to image\nprocessing and communication. To mitigate this latency, we use a color\nvibration technique; humans cannot perceive the vibration when the display\nalternates between two different color stimuli at a frequency of 25 Hz or\nhigher. In our system, we embed this imperceptible color vibration into the\nmid-air image formed by a micromirror array plate, and a photodiode on the\nfingertip device directly detects this color vibration to provide tactile\nstimulation. Thus, our system allows for the tactile perception of multiple\npatterns on a mid-air image in 59.5 ms. In addition, we evaluate the\nvisual-haptic delay tolerance on a mid-air display using our VHAR system and a\ntactile actuator with a single pattern and faster response time. The results of\nour user study indicate a visual-haptic delay tolerance of 110.6 ms, which is\nconsiderably larger than the latency associated with systems using multiple\ntactile patterns.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}