{"id":"2408.12182","title":"Perpendicular-anisotropy artificial spin ice with spontaneous ordering:\n  a platform for neuromorphic computing with flexible timescales","authors":"Aleksandr Kurenkov, Jonathan Maes, Aleksandra Pac, Gavin Martin\n  Macauley, Bartel Van Waeyenberge, Ale\\v{s} Hrabec, Laura Jane Heyderman","authorsParsed":[["Kurenkov","Aleksandr",""],["Maes","Jonathan",""],["Pac","Aleksandra",""],["Macauley","Gavin Martin",""],["Van Waeyenberge","Bartel",""],["Hrabec","Aleš",""],["Heyderman","Laura Jane",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 07:57:33 GMT"}],"updateDate":"2024-08-23","timestamp":1724313453000,"abstract":"  Arrays of coupled nanomagnets have wide-ranging fundamental and practical\napplications in artificial spin ices, neuromorphic computing and spintronics.\nHowever, lacking in these fields are nanomagnets with perpendicular magnetic\nanisotropy with sufficient magnetostatic interaction. This would not only open\nup new possibilities for artificial spin ice geometries but also enable novel\ncoupling methods for applications. Here we demonstrate a method to engineer the\nenergy landscape of artificial spin lattices with perpendicular magnetic\nanisotropy. With this, we are able to realize for the first time\nmagnetostatically-coupled 2D lattices of out-of-plane Ising spins that\nspontaneously order at room temperature on timescales that can be precisely\nengineered. We show how this property, together with straightforward electrical\ninterfacing, make this system a promising platform for reservoir computing. Our\nresults open the way to investigate the thermodynamics of out-of-plane\nmagnetostatically coupled nanomagnet arrays with novel spin ice geometries, as\nwell as to exploit such nanomagnet arrays in unconventional computing, taking\nadvantage of the adjustable temporal dynamics and strong coupling between\nnanomagnets.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}