{"id":"2408.13663","title":"A toy model for 2-dimensional spin-fluctuation-induced unconventional\n  superconductivity","authors":"Tu M. Cao and Igor I. Mazin","authorsParsed":[["Cao","Tu M.",""],["Mazin","Igor I.",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 20:00:49 GMT"}],"updateDate":"2024-08-27","timestamp":1724529649000,"abstract":"  Superconductivity had been one of the most enigmatic phenomena in condensed\nmatter physics, puzzling the best theorists for 45 years, since the original\ndiscovery by Kamerlingh-Onnes in 1911 till the final solution by Bardeen,\nCooper and Schrieffer (BCS) in 1957. The original BCS proposal assumed the\nhighest-symmetry form for the superconducting order parameter Delta, namely, a\nconstant, and a uniform pairing interaction due to attractive mediation of\nionic vibration. While it was rather soon realized that generalizations onto\nk-dependent order parameters and anisotropic pairing interaction was\nstraightforward, only thirty years later, upon the discovery of\nhigh-temperature superconductivity in cuprates, high-order angular dependence\nof Delta and repulsive interaction, mediated by spin fluctuations or Coulomb\nrepulsion brought such \"unconventional\" into the spotlight. In 2008 yet another\nsuch system was discovered, and eventually the idea of repulsion-mediated\nunconventional superconductivity was generally accepted. Apart from the two\nspecific systems mentioned above, a large number of various specific\nimplementations of this idea have been proposed, and it is becoming\nincreasingly clear that it is worth studying mathematically how unconventional\nsuperconductivity emerges, and with what properties, for a simple, but\nsufficiently general theoretical model. In our project, we study systematically\nunconventional superconductivity in an isotropic two-dimensional model system\nof electrons, subjected to repulsive interactions of a simple, but physically\nmotivated form: a Dirac-delta function peaked at a particular momentum (from 0\nto twice the Fermi momentum), or Gaussian of varying widths.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/"}