{"id":"2408.09983","title":"Integrability of Generalised Skew-Symmetric Replicator Equations via\n  Graph Embeddings","authors":"Matthew Visomirski and Christopher Griffin","authorsParsed":[["Visomirski","Matthew",""],["Griffin","Christopher",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 13:32:47 GMT"}],"updateDate":"2024-08-20","timestamp":1724074367000,"abstract":"  It is known that there is a one-to-one mapping between oriented directed\ngraphs and zero-sum replicator dynamics (Lotka-Volterra equations) and that\nfurthermore these dynamics are Hamiltonian in an appropriately defined\nnonlinear Poisson bracket. In this paper, we investigate the problem of\ndetermining whether these dynamics are Liouville-Arnold integrable, building on\nprior work graph in graph decloning by Evripidou et al. [J. Phys. A.,\n55:325201, 2022] and graph embedding by Paik and Griffin [Phys. Rev. E. 107(5):\nL052202, 2024]. Using the embedding procedure from Paik and Griffin, we show\n(with certain caveats) that when a graph producing integrable dynamics is\nembedded in another graph producing integrable dynamics, the resulting graph\nstructure also produces integrable dynamics. We also construct a new family of\ngraph structures that produces integrable dynamics that does not arise either\nfrom embeddings or decloning. We use these results to classify the dynamics\ngenerated by almost all oriented directed graphs on six vertices, with three\nhold-out graphs that generate integrable dynamics and are not part of a natural\ntaxonomy arising from known families and graph operations. These hold-out\ngraphs suggest more structure is available to be found. Moreover, the work\nsuggests that oriented directed graphs leading to integrable dynamics may be\nclassifiable in an analogous way to the classification of finite simple groups,\ncreating the possibility that there is a deep connection between integrable\ndynamics and combinatorial structures in graphs.\n","subjects":["Nonlinear Sciences/Exactly Solvable and Integrable Systems","Physics/Mathematical Physics","Mathematics/Dynamical Systems","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}