{"id":"2408.16244","title":"Quantum Advantage via Efficient Post-processing on Qudit Shadow\n  tomography","authors":"Yu Wang","authorsParsed":[["Wang","Yu",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 03:56:16 GMT"}],"updateDate":"2024-08-30","timestamp":1724903776000,"abstract":"  Efficiently computing the trace of the product of exponential-scale matrices\n$A$ and $B$ presents a significant challenge in classical computation,\nparticularly when $A$ is a $d$-dimensional positive Hermitian matrix with trace\n1, and $B$ is a Hermitian matrix with a bounded norm. This computation\ntraditionally requires $O(d^2)$ time complexity. We explore leveraging quantum\nadvantage to perform this computation in $O(\\text{poly}(\\log d))$ time for a\nbroad class of matrices $A$, offering potential applications in\nhigh-dimensional data analysis and complex systems. We propose a shadow\ntomography scheme for arbitrary $d$-dimensional systems that utilizes random\nprojective measurements onto Dense Dual Bases for efficient sampling and\npost-processing. Unlike random Clifford or mutually unbiased bases (MUB)\nmeasurements, our method is experimentally feasible on optical platforms. It\nrequires exponentially fewer computations to determine all coefficients of the\nrandomly projected states, with a constant post-processing time per\nmeasurement, as opposed to the exponential worst-case scenario seen with random\nClifford (MUB) measurements. For general dimensions $d$, the existence of $d+1$\nMUBs in general dimensions is still an open question, and the processing of\nrandomized Clifford measurements is not fully understood. While the\napplicability of matrix $A$ may be more limited compared to random Clifford\nmeasurements, our approach remains efficient in several cases, with average\nperformance that is particularly efficient. For all $A$, the computational\ncomplexity is $O(d)$, and in the approximately average case, it is\n$O(\\text{poly}(\\log d))$. This scheme holds significant potential beyond\nquantum information science; it could be instrumental in fields such as\nartificial intelligence, enabling efficient computation of $\\text{tr}(AB)$.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"gUjFmmUHUyyXlBD3Vs0Giy4SHciNXJ7bG2hakLOYzXc","pdfSize":"451077"}
