{"id":"2408.03191","title":"Integrated Intention Prediction and Decision-Making with Spectrum\n  Attention Net and Proximal Policy Optimization","authors":"Xiao Zhou, Chengzhen Meng, Wenru Liu, Zengqi Peng, Ming Liu, Jun Ma","authorsParsed":[["Zhou","Xiao",""],["Meng","Chengzhen",""],["Liu","Wenru",""],["Peng","Zengqi",""],["Liu","Ming",""],["Ma","Jun",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 13:43:52 GMT"}],"updateDate":"2024-08-07","timestamp":1722951832000,"abstract":"  For autonomous driving in highly dynamic environments, it is anticipated to\npredict the future behaviors of surrounding vehicles (SVs) and make safe and\neffective decisions. However, modeling the inherent coupling effect between the\nprediction and decision-making modules has been a long-standing challenge,\nespecially when there is a need to maintain appropriate computational\nefficiency. To tackle these problems, we propose a novel integrated intention\nprediction and decision-making approach, which explicitly models the coupling\nrelationship and achieves efficient computation. Specifically, a spectrum\nattention net is designed to predict the intentions of SVs by capturing the\ntrends of each frequency component over time and their interrelations. Fast\ncomputation of the intention prediction module is attained as the predicted\nintentions are not decoded to trajectories in the executing process.\nFurthermore, the proximal policy optimization (PPO) algorithm is employed to\naddress the non-stationary problem in the framework through a modest policy\nupdate enabled by a clipping mechanism within its objective function. On the\nbasis of these developments, the intention prediction and decision-making\nmodules are integrated through joint learning. Experiments are conducted in\nrepresentative traffic scenarios, and the results reveal that the proposed\nintegrated framework demonstrates superior performance over several deep\nreinforcement learning (DRL) baselines in terms of success rate, efficiency,\nand safety in driving tasks.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}