{"id":"2408.05695","title":"Advancements in Programmable Lipid Nanoparticles: Exploring the\n  Four-Domain Model for Targeted Drug Delivery","authors":"Zhaoyu Liu, Jingxun Chen, Mingkun Xu, David H. Gracias, Ken-Tye Yong,\n  Yuanyuan Wei, Ho-Pui Ho","authorsParsed":[["Liu","Zhaoyu",""],["Chen","Jingxun",""],["Xu","Mingkun",""],["Gracias","David H.",""],["Yong","Ken-Tye",""],["Wei","Yuanyuan",""],["Ho","Ho-Pui",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 04:50:35 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 02:11:49 GMT"},{"version":"v3","created":"Mon, 26 Aug 2024 21:10:42 GMT"}],"updateDate":"2024-08-28","timestamp":1723351835000,"abstract":"  Programmable lipid nanoparticles, or LNPs, represent a breakthrough in the\nrealm of targeted drug delivery, offering precise spatiotemporal control\nessential for the treatment of complex diseases such as cancer and genetic\ndisorders. In order to provide a more modular perspective and a more balanced\nanalysis of the mechanism, this review presents a novel Four-Domain Model that\nconsists of Architecture, Interface, Payload, and Dispersal Domain. We explored\nthe dynamical equilibrium between LNPs components and the surroundings\nthroughout their destiny, from formulation to release. On the basis of this, we\ndelve deep into manufacturing challenges, scalability issues, and regulatory\nhurdles, associated with the clinical translation of LNP technology. Within the\nframework focusing on the programmability in each domain, we prioritized\npatient-centric factors like dosing regimens, administration techniques, and\npotential consequences. Notably, this review expands to innovative anatomical\nroutes, such as intranasal and intraocular administration, offering a thorough\nexamination of the advantages and disadvantages of each route. We also offered\na comprehensive comparison between artificial LNPs and natural exosomes in\nterms of functionality, biocompatibility, and therapeutic potential.\nUltimately, this review highlights the potential of programmable LNPs to evolve\ninto more intelligent, naturally integrated systems, achieving optimal\nbiocompatibility and functionality.\n","subjects":["Quantitative Biology/Biomolecules","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}