{"id":"2408.00530","title":"Robust Implementation of Discrete-time Quantum Walks in Any\n  Finite-dimensional Quantum System","authors":"Biswayan Nandi and Sandipan Singha and Ankan Datta and Amit Saha and\n  Amlan Chakrabarti","authorsParsed":[["Nandi","Biswayan",""],["Singha","Sandipan",""],["Datta","Ankan",""],["Saha","Amit",""],["Chakrabarti","Amlan",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 13:07:13 GMT"},{"version":"v2","created":"Sat, 3 Aug 2024 08:08:47 GMT"}],"updateDate":"2024-08-06","timestamp":1722517633000,"abstract":"  Research has shown that quantum walks can accelerate certain quantum\nalgorithms and act as a universal paradigm for quantum processing. The\ndiscrete-time quantum walk (DTQW) model, owing to its discrete nature, stands\nout as one of the most suitable choices for circuit implementation.\nNevertheless, most current implementations are characterized by extensive,\nmulti-layered quantum circuits, leading to higher computational expenses and a\nnotable decrease in the number of confidently executable time steps on current\nquantum computers. Since quantum computers are not scalable enough in this NISQ\nera, we also must confine ourselves to the ancilla-free frontier zone.\nTherefore, in this paper, we have successfully cut down the circuit cost\nconcerning gate count and circuit depth by half through our proposed\nmethodology in qubit systems as compared to the state-of-the-art\nincrement-decrement approach. Furthermore, for the engineering excellence of\nour proposed approach, we implement DTQW in any finite-dimensional quantum\nsystem with akin efficiency. To ensure an efficient implementation of quantum\nwalks without requiring ancilla, we have incorporated an intermediate qudit\ntechnique for decomposing multi-qubit gates. Experimental outcomes hold\nsignificance far beyond the realm of just a few time steps, laying the\ngroundwork for dependable implementation and utilization on quantum computers.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/"}