{"id":"2408.16251","title":"Neural Network-Assisted Hybrid Model Based Message Passing for\n  Parametric Holographic MIMO Near Field Channel Estimation","authors":"Zhengdao Yuan, Yabo Guo, Dawei Gao, Qinghua Guo, Zhongyong Wang,\n  Chongwen Huang, Ming Jin and Kai-Kit Wong","authorsParsed":[["Yuan","Zhengdao",""],["Guo","Yabo",""],["Gao","Dawei",""],["Guo","Qinghua",""],["Wang","Zhongyong",""],["Huang","Chongwen",""],["Jin","Ming",""],["Wong","Kai-Kit",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 04:22:35 GMT"}],"updateDate":"2024-08-30","timestamp":1724905355000,"abstract":"  Holographic multiple-input and multiple-output (HMIMO) is a promising\ntechnology with the potential to achieve high energy and spectral efficiencies,\nenhance system capacity and diversity, etc. In this work, we address the\nchallenge of HMIMO near field (NF) channel estimation, which is complicated by\nthe intricate model introduced by the dyadic Green's function. Despite its\ncomplexity, the channel model is governed by a limited set of parameters. This\nmakes parametric channel estimation highly attractive, offering substantial\nperformance enhancements and enabling the extraction of valuable sensing\nparameters, such as user locations, which are particularly beneficial in mobile\nnetworks. However, the relationship between these parameters and channel gains\nis nonlinear and compounded by integration, making the estimation a formidable\ntask. To tackle this problem, we propose a novel neural network (NN) assisted\nhybrid method. With the assistance of NNs, we first develop a novel hybrid\nchannel model with a significantly simplified expression compared to the\noriginal one, thereby enabling parametric channel estimation. Using the readily\navailable training data derived from the original channel model, the NNs in the\nhybrid channel model can be effectively trained offline. Then, building upon\nthis hybrid channel model, we formulate the parametric channel estimation\nproblem with a probabilistic framework and design a factor graph representation\nfor Bayesian estimation. Leveraging the factor graph representation and unitary\napproximate message passing (UAMP), we develop an effective message\npassing-based Bayesian channel estimation algorithm. Extensive simulations\ndemonstrate the superior performance of the proposed method.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rO9-G9JHzvGURkkIF0nESvseNny3X7qGPECflIBCSNU","pdfSize":"1552678"}
