{"id":"2408.07758","title":"RAVE Checklist: Recommendations for Overcoming Challenges in\n  Retrospective Safety Studies of Automated Driving Systems","authors":"John M. Scanlon, Eric R. Teoh, David G. Kidd, Kristofer D. Kusano,\n  Jonas B\\\"argman, Geoffrey Chi-Johnston, Luigi Di Lillo, Francesca Favaro,\n  Carol Flannagan, Henrik Liers, Bonnie Lin, Magdalena Lindman, Shane\n  McLaughlin, Miguel Perez, Trent Victor","authorsParsed":[["Scanlon","John M.",""],["Teoh","Eric R.",""],["Kidd","David G.",""],["Kusano","Kristofer D.",""],["Bärgman","Jonas",""],["Chi-Johnston","Geoffrey",""],["Di Lillo","Luigi",""],["Favaro","Francesca",""],["Flannagan","Carol",""],["Liers","Henrik",""],["Lin","Bonnie",""],["Lindman","Magdalena",""],["McLaughlin","Shane",""],["Perez","Miguel",""],["Victor","Trent",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 18:14:40 GMT"}],"updateDate":"2024-08-16","timestamp":1723659280000,"abstract":"  The public, regulators, and domain experts alike seek to understand the\neffect of deployed SAE level 4 automated driving system (ADS) technologies on\nsafety. The recent expansion of ADS technology deployments is paving the way\nfor early stage safety impact evaluations, whereby the observational data from\nboth an ADS and a representative benchmark fleet are compared to quantify\nsafety performance. In January 2024, a working group of experts across\nacademia, insurance, and industry came together in Washington, DC to discuss\nthe current and future challenges in performing such evaluations. A subset of\nthis working group then met, virtually, on multiple occasions to produce this\npaper. This paper presents the RAVE (Retrospective Automated Vehicle\nEvaluation) checklist, a set of fifteen recommendations for performing and\nevaluating retrospective ADS performance comparisons. The recommendations are\ncentered around the concepts of (1) quality and validity, (2) transparency, and\n(3) interpretation. Over time, it is anticipated there will be a large and\nvaried body of work evaluating the observed performance of these ADS fleets.\nEstablishing and promoting good scientific practices benefits the work of\nstakeholders, many of whom may not be subject matter experts. This working\ngroup's intentions are to: i) strengthen individual research studies and ii)\nmake the at-large community more informed on how to evaluate this collective\nbody of work.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}