{"id":"2408.05505","title":"RIS-Assisted Cell-Free Massive MIMO Relying on Reflection Pattern\n  Modulation","authors":"Zeping Sui, Hien Quoc Ngo, Trinh Van Chien, Michail Matthaiou and\n  Lajos Hanzo","authorsParsed":[["Sui","Zeping",""],["Ngo","Hien Quoc",""],["Van Chien","Trinh",""],["Matthaiou","Michail",""],["Hanzo","Lajos",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 10:08:05 GMT"}],"updateDate":"2024-08-13","timestamp":1723284485000,"abstract":"  We propose reflection pattern modulation-aided reconfigurable intelligent\nsurface (RPM-RIS)-assisted cell-free massive multiple-input-multiple-output\n(CF-mMIMO) schemes for green uplink transmission. In our RPM-RIS-assisted\nCF-mMIMO system, extra information is conveyed by the indices of the active RIS\nblocks, exploiting the joint benefits of both RIS-assisted CF-mMIMO\ntransmission and RPM. Since only part of the RIS blocks are active, our\nproposed architecture strikes a flexible energy \\emph{vs.} spectral efficiency\n(SE) trade-off. We commence with introducing the system model by considering\nspatially correlated channels. Moreover, we conceive a channel estimation\nscheme subject to the linear minimum mean-square error (MMSE) constraint,\nyielding sufficient information for the subsequent signal processing steps.\nThen, upon exploiting a so-called large-scale fading decoding (LSFD) scheme,\nthe uplink signal-to-interference-and-noise ratio (SINR) is derived based on\nthe RIS ON/OFF statistics, where both maximum ratio (MR) and local minimum\nmean-square error (L-MMSE) combiners are considered. By invoking the MR\ncombiner, the closed-form expression of the uplink SE is formulated based only\non the channel statistics. Furthermore, we derive the total energy efficiency\n(EE) of our proposed RPM-RIS-assisted CF-mMIMO system. Additionally, we propose\na chaotic sequence-based adaptive particle swarm optimization (CSA-PSO)\nalgorithm to maximize the total EE by designing the RIS phase shifts. Finally,\nour simulation results demonstrate that the proposed RPM-RIS-assisted CF-mMIMO\narchitecture strikes an attractive SE \\emph{vs.} EE trade-off, while the\nCSA-PSO algorithm is capable of attaining a significant EE performance gain\ncompared to conventional solutions.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}