{"id":"2408.05402","title":"Mesh deformation-based single-view 3D reconstruction of thin eyeglasses\n  frames with differentiable rendering","authors":"Fan Zhang, Ziyue Ji, Weiguang Kang, Weiqing Li, Zhiyong Su","authorsParsed":[["Zhang","Fan",""],["Ji","Ziyue",""],["Kang","Weiguang",""],["Li","Weiqing",""],["Su","Zhiyong",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 01:40:57 GMT"}],"updateDate":"2024-08-13","timestamp":1723254057000,"abstract":"  With the support of Virtual Reality (VR) and Augmented Reality (AR)\ntechnologies, the 3D virtual eyeglasses try-on application is well on its way\nto becoming a new trending solution that offers a \"try on\" option to select the\nperfect pair of eyeglasses at the comfort of your own home. Reconstructing\neyeglasses frames from a single image with traditional depth and image-based\nmethods is extremely difficult due to their unique characteristics such as lack\nof sufficient texture features, thin elements, and severe self-occlusions. In\nthis paper, we propose the first mesh deformation-based reconstruction\nframework for recovering high-precision 3D full-frame eyeglasses models from a\nsingle RGB image, leveraging prior and domain-specific knowledge. Specifically,\nbased on the construction of a synthetic eyeglasses frame dataset, we first\ndefine a class-specific eyeglasses frame template with pre-defined keypoints.\nThen, given an input eyeglasses frame image with thin structure and few texture\nfeatures, we design a keypoint detector and refiner to detect predefined\nkeypoints in a coarse-to-fine manner to estimate the camera pose accurately.\nAfter that, using differentiable rendering, we propose a novel optimization\napproach for producing correct geometry by progressively performing free-form\ndeformation (FFD) on the template mesh. We define a series of loss functions to\nenforce consistency between the rendered result and the corresponding RGB\ninput, utilizing constraints from inherent structure, silhouettes, keypoints,\nper-pixel shading information, and so on. Experimental results on both the\nsynthetic dataset and real images demonstrate the effectiveness of the proposed\nalgorithm.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}