{"id":"2408.08505","title":"Fluctuations in Wasserstein dynamics on Graphs","authors":"Yuan Gao, Wuchen Li, Jian-Guo Liu","authorsParsed":[["Gao","Yuan",""],["Li","Wuchen",""],["Liu","Jian-Guo",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 03:05:34 GMT"}],"updateDate":"2024-08-19","timestamp":1723777534000,"abstract":"  In this paper, we propose a drift-diffusion process on the probability\nsimplex to study stochastic fluctuations in probability spaces. We construct a\ncounting process for linear detailed balanced chemical reactions with finite\nspecies such that its thermodynamic limit is a system of ordinary differential\nequations (ODE) on the probability simplex. This ODE can be formulated as a\ngradient flow with an Onsager response matrix that induces a Riemannian metric\non the probability simplex. After incorporating the induced Riemannian\nstructure, we propose a diffusion approximation of the rescaled counting\nprocess for molecular species in the chemical reactions, which leads to\nLangevin dynamics on the probability simplex with a degenerate Brownian motion\nconstructed from the eigen-decomposition of Onsager's response matrix. The\ncorresponding Fokker-Planck equation on the simplex can be regarded as the\nusual drift-diffusion equation with the extrinsic representation of the\ndivergence and Laplace-Beltrami operator. The invariant measure is the Gibbs\nmeasure, which is the product of the original macroscopic free energy and a\nvolume element. When the drift term vanishes, the Fokker-Planck equation\nreduces to the heat equation with the Laplace-Beltrami operator, which we refer\nto as canonical Wasserstein diffusions on graphs. In the case of a two-point\nprobability simplex, the constructed diffusion process is converted to one\ndimensional Wright-Fisher diffusion process, which leads to a natural boundary\ncondition ensuring that the process remains within the probability simplex.\n","subjects":["Mathematics/Probability","Mathematics/Analysis of PDEs"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}