{"id":"2408.07737","title":"A Finite Element Analysis Model for Magnetomotive Ultrasound Elastometry\n  Magnet Design with Experimental Validation","authors":"Jacquelline Nyakunu, Christopher T. Piatnichouk, Henry C. Russell,\n  Niels J. van Duijnhoven, and Benjamin E. Levy","authorsParsed":[["Nyakunu","Jacquelline",""],["Piatnichouk","Christopher T.",""],["Russell","Henry C.",""],["van Duijnhoven","Niels J.",""],["Levy","Benjamin E.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 17:55:51 GMT"}],"updateDate":"2024-08-16","timestamp":1723658151000,"abstract":"  Objective. Magnetomotive ultrasound (MMUS) using magnetic nanoparticle\ncontrast agents has shown promise for thrombosis imaging and quantitative\nelastometry via magnetomotive resonant acoustic spectroscopy (MRAS). Young's\nmodulus measurements of smaller, stiffer thrombi require an MRAS system capable\nof generating forces at higher temporal frequencies. Solenoids with fewer\nturns, and thus less inductance, could improve high frequency performance, but\nthe reduced force may compromise results. In this work, a computational model\ncapable of predicting improved MRAS magnet configurations optimized for\nelastometry is presented and validated.\n  Approach. Finite element analysis (FEA) was used to model the force and\ninductance of MRAS systems. The simulations incorporated both solenoid\nelectromagnets and permanent magnets in three-dimensional steady-state,\nfrequency domain, and time domain studies.\n  Main results. The model successfully predicted a configuration in which\npermanent magnets could be used to increase the force supplied by an existing\nMRAS system. Accordingly, the displacement measured in a magnetically labeled\nvalidation phantom increased by a factor of $2.2 \\pm 0.3$ when the force was\npredicted to increase by a factor of $2.2 \\pm 0.2$. The model additionally\nidentified a new solenoid configuration consisting of four smaller coils\ncapable of providing sufficient force at higher driving frequencies.\n  Significance. These results indicate two methods by which MRAS systems could\nbe designed to deliver higher frequency magnetic forces without the need for\nexperimental trial and error. Either the number of turns within each solenoid\ncould be reduced while permanent magnets are added at precise locations, or a\nlarger number of smaller solenoids could be used. These findings overcome a key\nchallenge toward the goal of thrombosis elastometry via MMUS.\n","subjects":["Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"slXRjQH4K95CLVDdRiMpiB8QwW3l9YPnY1sH2w5UBvs","pdfSize":"3472191"}
