{"id":"2408.15376","title":"ML-ROM Wall Shear Stress Prediction in Patient-Specific Vascular\n  Pathologies under a Limited Clinical Training Data Regime","authors":"Chotirawee Chatpattanasiri, Federica Ninno, Catriona Stokes, Alan\n  Dardik, David Strosberg, Edouard Aboian, Hendrik von Tengg-Kobligk, Vanessa\n  D\\'iaz-Zuccarini, and Stavroula Balabani","authorsParsed":[["Chatpattanasiri","Chotirawee",""],["Ninno","Federica",""],["Stokes","Catriona",""],["Dardik","Alan",""],["Strosberg","David",""],["Aboian","Edouard",""],["von Tengg-Kobligk","Hendrik",""],["Díaz-Zuccarini","Vanessa",""],["Balabani","Stavroula",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 19:27:49 GMT"}],"updateDate":"2024-08-29","timestamp":1724786869000,"abstract":"  High-fidelity numerical simulations such as Computational Fluid Dynamics\n(CFD) have been proven effective in analysing haemodynamics, offering insight\ninto many vascular conditions. However, these methods often face challenges of\nhigh computational cost and long processing times. Data-driven approaches such\nas Reduced Order Modeling (ROM) and Machine Learning (ML) are increasingly\nbeing explored alongside CFD to advance biomechanical research and application.\n  This study presents an integration of Proper Orthogonal Decomposition\n(POD)-based ROM with neural network-based ML models to predict Wall Shear\nStress (WSS) in patient-specific vascular pathologies. CFD was used to generate\nWSS data, followed by POD to construct the ROM. The ML models were trained to\npredict the ROM coefficients from the inlet flowrate waveform, which can be\nroutinely collected in the clinic. Two ML models were explored: a simpler\nflowrate-coefficients mapping model and a more advanced autoregressive model.\nBoth models were tested against two case studies: flow in Peripheral Arterial\nDisease (PAD) and flow in Aortic Dissection (AD). Despite the limited training\ndata sets (three flowrate waveforms for the PAD case and two for the AD case),\nthe models were able to predict the haemodynamic indices, with the\nflowrate-coefficients mapping model outperforming the autoregressive model in\nboth case studies. The accuracy is higher in the PAD case study, with reduced\naccuracy in the more complex case study of AD. Additionally, the computational\ncost analysis reveals a significant reduction in computational demands, with\nspeed-up ratios on the order of $10^4$ for both case studies.\n  This approach shows an effective integration of ROM and ML techniques for\nfast and reliable evaluations of haemodynamic properties that contribute to\nvascular conditions, setting the stage for clinical translation.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"3Biw8Co1zOKG88YbTKc7gdR-LHNfZ-ASMSuehCboSJQ","pdfSize":"9450800"}
