{"id":"2408.12276","title":"Spectral properties of ablating meteorite samples for improved meteoroid\n  composition diagnostics","authors":"Pavol Matlovi\\v{c}, Adriana Pisar\\v{c}\\'ikov\\'a, Veronika Pazderov\\'a,\n  Stefan Loehle, Juraj T\\'oth, Ludovic Ferri\\`ere, Peter \\v{C}erm\\'ak, David\n  Leiser, J\\'er\\'emie Vaubaillon, Ranjith Ravichandran","authorsParsed":[["Matlovič","Pavol",""],["Pisarčíková","Adriana",""],["Pazderová","Veronika",""],["Loehle","Stefan",""],["Tóth","Juraj",""],["Ferrière","Ludovic",""],["Čermák","Peter",""],["Leiser","David",""],["Vaubaillon","Jérémie",""],["Ravichandran","Ranjith",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 10:21:19 GMT"}],"updateDate":"2024-08-27","timestamp":1724322079000,"abstract":"  Emission spectra and diagnostic spectral features of a diverse range of\nablated meteorite samples with a known composition are presented. We aim to\nprovide a reference spectral dataset to improve our abilities to classify\nmeteoroid composition types from meteor spectra observations. The data were\nobtained by ablating meteorite samples in high-enthalpy plasma wind tunnel\nfacilities recreating conditions characteristic of low-speed meteors. Near-UV\nto visible-range (320 - 800 nm) emission spectra of 22 diverse meteorites\ncaptured by a high-resolution Echelle spectrometer were analyzed to identify\nthe characteristic spectral features of individual meteorite groups. The same\ndataset captured by a lower-resolution meteor spectrograph was applied to\ncompare the meteorite data with meteor spectra observations. Spectral modeling\nrevealed that the emitting meteorite plasma was characterized by temperatures\nof 3700 - 4800 K, similar to the main temperature component of meteors. The\nstudied line intensity variations were found to trace the differences in the\noriginal meteorite composition and thus can be used to constrain the individual\nmeteorite classes. We demonstrate that meteorite composition types, including\nordinary chondrites, carbonaceous chondrites, various achondrites, stony-iron\nand iron meteorites, can be spectrally distinguished by measuring relative line\nintensities of Mg I, Fe I, Na I, Cr I, Mn I, Si I, H I, CN, Ni I, and Li I.\nAdditionally, we confirm the effect of the incomplete evaporation of refractory\nelements Al, Ti, and Ca, and the presence of minor species Co I, Cu I, and V I.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}