{"id":"2408.05577","title":"Camera Perspective Transformation to Bird's Eye View via Spatial\n  Transformer Model for Road Intersection Monitoring","authors":"Rukesh Prajapati, Amr S. El-Wakeel","authorsParsed":[["Prajapati","Rukesh",""],["El-Wakeel","Amr S.",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 15:01:19 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 02:20:50 GMT"}],"updateDate":"2024-08-15","timestamp":1723302079000,"abstract":"  Road intersection monitoring and control research often utilize bird's eye\nview (BEV) simulators. In real traffic settings, achieving a BEV akin to that\nin a simulator necessitates the deployment of drones or specific sensor\nmounting, which is neither feasible nor practical. Consequently, traffic\nintersection management remains confined to simulation environments given these\nconstraints. In this paper, we address the gap between simulated environments\nand real-world implementation by introducing a novel deep-learning model that\nconverts a single camera's perspective of a road intersection into a BEV. We\ncreated a simulation environment that closely resembles a real-world traffic\njunction. The proposed model transforms the vehicles into BEV images,\nfacilitating road intersection monitoring and control model processing.\nInspired by image transformation techniques, we propose a Spatial-Transformer\nDouble Decoder-UNet (SDD-UNet) model that aims to eliminate the transformed\nimage distortions. In addition, the model accurately estimates the vehicle's\npositions and enables the direct application of simulation-trained models in\nreal-world contexts. SDD-UNet model achieves an average dice similarity\ncoefficient (DSC) above 95% which is 40% better than the original UNet model.\nThe mean absolute error (MAE) is 0.102 and the centroid of the predicted mask\nis 0.14 meters displaced, on average, indicating high accuracy.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}