{"id":"2408.17294","title":"Neutron-proton pairing correlations described on quantum computers","authors":"Jing Zhang, Denis Lacroix and Yann Beaujeault-Taudiere","authorsParsed":[["Zhang","Jing",""],["Lacroix","Denis",""],["Beaujeault-Taudiere","Yann",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 13:48:43 GMT"}],"updateDate":"2024-09-02","timestamp":1725025723000,"abstract":"  The ADAPT-VQE approach is used to solve the neutron-proton pairing problem in\natomic nuclei. This variational approach is considered today as one of the most\npowerful methods to iteratively find the ground state of a many-body problem,\nprovided a performing set of operators, called the pool of operators, is used\nto explore the Hilbert space of many-body wave-functions. Three different pools\nof operators, which might eventually break one or several symmetries of the\nHamiltonian during the descent to the ground state, are tested for the\nneutron-proton pairing problem. We observe that the breaking of some symmetries\nduring the optimization of the trial wave-function might, in general, help to\nspeed up the convergence towards the ground state. Still, we rejected the pool\nof operators that might explicitly break the total particle number because they\nbecome uncontrollable during the optimization process. Overall, we observed\nthat the iterative optimization process rapidly becomes a delicate problem when\nthe number of parameters to build the ansatz increases, and the energy might\nget stuck at energies higher than the ground state energy. To improve the\nconvergence in this case, several techniques have been proposed, with some\nbetter controlling the symmetries during the energy minimization. Among the\nproposed methods, two have proven effective: one based on an embedding\ntechnique and the other on a randomized preparation of the initial state. We\nconclude that the ADAPT-VQE, complemented by these techniques, can provide a\nvery accurate description of the neutron-proton pairing problem, and can\noutperform other standardly used techniques that break the particle number\nsymmetry and restore afterwards.\n","subjects":["Physics/Nuclear Theory","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}