{"id":"2408.01075","title":"The EAP-AIAS: Adapting the AI Assessment Scale for English for Academic\n  Purposes","authors":"Jasper Roe (1), Mike Perkins (2), Yulia Tregubova (2) ((1) James Cook\n  University Singapore, (2) British University Vietnam)","authorsParsed":[["Roe","Jasper",""],["Perkins","Mike",""],["Tregubova","Yulia",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 07:51:29 GMT"}],"updateDate":"2024-08-05","timestamp":1722585089000,"abstract":"  The rapid advancement of Generative Artificial Intelligence (GenAI) presents\nboth opportunities and challenges for English for Academic Purposes (EAP)\ninstruction. This paper proposes an adaptation of the AI Assessment Scale\n(AIAS) specifically tailored for EAP contexts, termed the EAP-AIAS.\n  This framework aims to provide a structured approach for integrating GenAI\ntools into EAP assessment practices while maintaining academic integrity and\nsupporting language development. The EAP-AIAS consists of five levels, ranging\nfrom \"No AI\" to \"Full AI\", each delineating appropriate GenAI usage in EAP\ntasks. We discuss the rationale behind this adaptation, considering the unique\nneeds of language learners and the dual focus of EAP on language proficiency\nand academic acculturation.\n  This paper explores potential applications of the EAP-AIAS across various EAP\nassessment types, including writing tasks, presentations, and research\nprojects. By offering a flexible framework, the EAP-AIAS seeks to empower EAP\npractitioners seeking to deal with the complexities of GenAI integration in\neducation and prepare students for an AI-enhanced academic and professional\nfuture. This adaptation represents a step towards addressing the pressing need\nfor ethical and pedagogically sound AI integration in language education.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"m7eU3mJwNujBNbqWjcAGG47U7dn7KIqBoyrIcvuCZdI","pdfSize":"315281"}
