{"id":"2408.03031","title":"Stretch-induced tunability of electrical transport properties of\n  three-dimensional graphene-based foam structures","authors":"Shu-Ting Guo and Fangxin Zou","authorsParsed":[["Guo","Shu-Ting",""],["Zou","Fangxin",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 08:24:54 GMT"}],"updateDate":"2024-08-07","timestamp":1722932694000,"abstract":"  The fast electron transport and superior multidirectional flexibility of\nthree-dimensional graphene-based foams (GFs) are pivotal in the realm of\nstretchable electronics. We observed pre-stretching induced modulation of the\ntemperature-dependent electrical resistivity of GFs, where, as the pre-stretch\nstrain level increased, the distinct temperature dependence of the resistivity\nof a GF sample would change and might even exhibit a notable transition from\nnegative dependence to positive dependence. We attempted to interpret the\nphenomenon by proposing a new conduction network model that represents GF\nstructures as interconnected graphene islands and island/island conduction\njunctions and incorporates three conduction mechanisms: thermally activated\nconduction, phonon-limited conduction, and fluctuation-induced tunneling\nconduction. By fitting-assisted analysis, we found that the temperature\ndependence of the resistivity of a GF sample primarily relies on the discrete\nquantities of graphene islands and island/island conduction junctions, and the\nresistivity originating from each conduction mechanism. As pre-stretch strain\nlevel increases, these factors would change due to conduction network\nalteration, local strain-induced phonon hardening, and local strain-induced\ntransport gap modulation, all resulting from pre-stretching. Our results offer\nvaluable insights into the optimization of GFs-based stretchable electronic\ndevices, such as performance enhancement through structural modifications.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}