{"id":"2408.13103","title":"DCSK-based Waveform Design for Self-sustainable RIS-aided Noncoherent\n  SWIPT","authors":"Priyadarshi Mukherjee and Constantinos Psomas and Ioannis Krikidis","authorsParsed":[["Mukherjee","Priyadarshi",""],["Psomas","Constantinos",""],["Krikidis","Ioannis",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 14:26:17 GMT"}],"updateDate":"2024-08-26","timestamp":1724423177000,"abstract":"  This paper investigates the problem of transmit waveform design in the\ncontext of a chaotic signal-based self-sustainable reconfigurable intelligent\nsurface (RIS)-aided system for simultaneous wireless information and power\ntransfer (SWIPT). Specifically, we propose a differential chaos shift keying\n(DCSK)-based RIS-aided point-to-point set-up, where the RIS is partitioned into\ntwo non-overlapping surfaces. The elements of the first sub-surface perform\nenergy harvesting (EH), which in turn, provide the required power to the other\nsub-surface operating in the information transfer (IT) mode. In this framework,\nby considering a generalized frequency-selective Nakagami-m fading scenario as\nwell as the nonlinearities of the EH process, we derive closed-form analytical\nexpressions for both the bit error rate (BER) at the receiver and the harvested\npower at the RIS. Our analysis demonstrates, that both these performance\nmetrics depend on the parameters of the wireless channel, the transmit waveform\ndesign, and the number of reflecting elements at the RIS, which switch between\nthe IT and EH modes, depending on the application requirements. Moreover, we\nshow that, having more reflecting elements in the IT mode is not always\nbeneficial and also, for a given acceptable BER, we derive a lower bound on the\nnumber of RIS elements that need to be operated in the EH mode. Furthermore,\nfor a fixed RIS configuration, we investigate a trade-off between the\nachievable BER and the harvested power at the RIS and accordingly, we propose\nappropriate transmit waveform designs. Finally, our numerical results\nillustrate the importance of our intelligent DCSK-based waveform design on the\nconsidered framework.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"86lYwtdGJqlaArQj-GddjAuGTccrsIJ8a2tTsXQf09s","pdfSize":"613396"}
