{"id":"2408.17198","title":"Towards Symbolic XAI -- Explanation Through Human Understandable Logical\n  Relationships Between Features","authors":"Thomas Schnake, Farnoush Rezaei Jafaria, Jonas Lederer, Ping Xiong,\n  Shinichi Nakajima, Stefan Gugler, Gr\\'egoire Montavon, Klaus-Robert M\\\"uller","authorsParsed":[["Schnake","Thomas",""],["Jafaria","Farnoush Rezaei",""],["Lederer","Jonas",""],["Xiong","Ping",""],["Nakajima","Shinichi",""],["Gugler","Stefan",""],["Montavon","Grégoire",""],["Müller","Klaus-Robert",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 10:52:18 GMT"}],"updateDate":"2024-09-02","timestamp":1725015138000,"abstract":"  Explainable Artificial Intelligence (XAI) plays a crucial role in fostering\ntransparency and trust in AI systems, where traditional XAI approaches\ntypically offer one level of abstraction for explanations, often in the form of\nheatmaps highlighting single or multiple input features. However, we ask\nwhether abstract reasoning or problem-solving strategies of a model may also be\nrelevant, as these align more closely with how humans approach solutions to\nproblems. We propose a framework, called Symbolic XAI, that attributes\nrelevance to symbolic queries expressing logical relationships between input\nfeatures, thereby capturing the abstract reasoning behind a model's\npredictions. The methodology is built upon a simple yet general multi-order\ndecomposition of model predictions. This decomposition can be specified using\nhigher-order propagation-based relevance methods, such as GNN-LRP, or\nperturbation-based explanation methods commonly used in XAI. The effectiveness\nof our framework is demonstrated in the domains of natural language processing\n(NLP), vision, and quantum chemistry (QC), where abstract symbolic domain\nknowledge is abundant and of significant interest to users. The Symbolic XAI\nframework provides an understanding of the model's decision-making process that\nis both flexible for customization by the user and human-readable through\nlogical formulas.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}