{"id":"2408.16116","title":"Accurate quasinormal modes of the analogue black holes","authors":"Jerzy Matyjasek, Kristian Benda, Maja Stafi\\'nska","authorsParsed":[["Matyjasek","Jerzy",""],["Benda","Kristian",""],["Stafińska","Maja",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 20:01:37 GMT"}],"updateDate":"2024-08-30","timestamp":1724875297000,"abstract":"  We study the quasinormal modes of the spherically-symmetric\n$(2+1)$-dimensional analogue black hole, modeled by the ``draining bathtub''\nfluid flow, and the $(3+1)$-dimensional canonical acoustic black hole. In the\nboth cases the emphasis is on the accuracy. Formally, the radial equation\ndescribing perturbations of the $(2+1)$-dimensional black hole is a special\ncase of the general master equation of the 5-dimensional Tangherlini black\nhole. Similarly, the $(3+1)$-dimensional equation can be obtained from the\nmaster equation of the 7-dimensional Tangherlini black hole. For the\n$(2+1)$-dimensional analogue black hole we used three major techniques: the\nhigher-order WKB method with the Pad\\'e summation, the Hill-determinant method\nand the continued fraction method, the latter two with the convergence\nacceleration. In the $(3+1)$-dimensional case, we propose the simpler\nrecurrence relations and explicitly demonstrate that both recurrences, i.e.,\nthe eight-term and the six-term recurrences yield identical results. Since the\napplication of the continued-fraction method require five (or three)\nconsecutive Gauss eliminations, we decided not to use this technique in the\n$(3+1)$-dimensional case. Instead, we used the Hill-determinant method in the\ntwo incarnations and the higher-order WKB. We accept the results of our\ncalculations if at least two (algorithmically) independent methods give the\nsame answer to some prescribed accuracy. Our results correct and extend the\nresults existing in the literature and we believe that we approached assumed\naccuracy of 9 decimal places. In most cases, there is perfect agreement between\nall the methods; however, in a few cases, the performance of the higher-order\nWKB method is slightly worse.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}