{"id":"2408.05089","title":"Viscoelastic Worthington jets \\& droplets produced by bursting bubbles","authors":"Ayush K. Dixit and Alexandros Oratis and Konstantinos Zinelis and\n  Detlef Lohse and Vatsal Sanjay","authorsParsed":[["Dixit","Ayush K.",""],["Oratis","Alexandros",""],["Zinelis","Konstantinos",""],["Lohse","Detlef",""],["Sanjay","Vatsal",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 14:27:55 GMT"}],"updateDate":"2024-08-12","timestamp":1723213675000,"abstract":"  Bubble bursting and subsequent collapse of the open cavity at free surfaces\nof contaminated liquids can generate aerosol droplets, facilitating pathogen\ntransport. After film rupture, capillary waves focus at the cavity base,\npotentially generating fast Worthington jets that are responsible for ejecting\nthe droplets away from the source. While extensively studied for Newtonian\nfluids, the influence of non-Newtonian rheology on this process remains poorly\nunderstood. Here, we employ direct numerical simulations to investigate the\nbubble cavity collapse in viscoelastic media, such as polymeric liquids,\nexamining how their elastic modulus $G$ and their relaxation time $\\lambda$\naffect jet and droplet formation. We show that the viscoelastic liquids yield\nNewtonian-like behavior as either parameter $G$ or $\\lambda$ approaches zero,\nwhile increasing them suppresses jet formation due to elastic resistance to\nelongational flows. Intriguingly, for some cases with intermediate values of\n$G$ and $\\lambda$, smaller droplets are produced compared to Newtonian fluids,\npotentially enhancing aerosol dispersal. By mapping the phase space spanned by\nthe elastocapillary number (dimensionless $G$) and the Deborah number\n(dimensionless $\\lambda$), we reveal three distinct flow regimes: (i) jets\nforming droplets, (ii) jets without droplet formation, and (iii) absence of jet\nformation. Our results elucidate the mechanisms underlying aerosol suppression\nversus fine spray formation in polymeric liquids, with implications for\npathogen transmission and industrial processes involving viscoelastic fluids.\n","subjects":["Physics/Fluid Dynamics","Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hIsFQD_ZjuQGB9wrwDdiSG3AY6VpQ_zqCf6hIXKBONc","pdfSize":"10716068"}
