{"id":"2408.13333","title":"Mastering the Digital Art of War: Developing Intelligent Combat\n  Simulation Agents for Wargaming Using Hierarchical Reinforcement Learning","authors":"Scotty Black","authorsParsed":[["Black","Scotty",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 18:50:57 GMT"}],"updateDate":"2024-08-27","timestamp":1724439057000,"abstract":"  In today's rapidly evolving military landscape, advancing artificial\nintelligence (AI) in support of wargaming becomes essential. Despite\nreinforcement learning (RL) showing promise for developing intelligent agents,\nconventional RL faces limitations in handling the complexity inherent in combat\nsimulations. This dissertation proposes a comprehensive approach, including\ntargeted observation abstractions, multi-model integration, a hybrid AI\nframework, and an overarching hierarchical reinforcement learning (HRL)\nframework. Our localized observation abstraction using piecewise linear spatial\ndecay simplifies the RL problem, enhancing computational efficiency and\ndemonstrating superior efficacy over traditional global observation methods.\nOur multi-model framework combines various AI methodologies, optimizing\nperformance while still enabling the use of diverse, specialized individual\nbehavior models. Our hybrid AI framework synergizes RL with scripted agents,\nleveraging RL for high-level decisions and scripted agents for lower-level\ntasks, enhancing adaptability, reliability, and performance. Our HRL\narchitecture and training framework decomposes complex problems into manageable\nsubproblems, aligning with military decision-making structures. Although\ninitial tests did not show improved performance, insights were gained to\nimprove future iterations. This study underscores AI's potential to\nrevolutionize wargaming, emphasizing the need for continued research in this\ndomain.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"p4wCrSz8TWOKAykpNnez23zQtQ_FRaMfCJ7SYOXXSFs","pdfSize":"16712224"}
