{"id":"2408.01406","title":"Hyperons during proto-neutron star deleptonization and the emission of\n  dark flavored particles","authors":"Tobias Fischer, Jorge Martin Camalich, Hristijan Kochankovski, Laura\n  Tolos","authorsParsed":[["Fischer","Tobias",""],["Camalich","Jorge Martin",""],["Kochankovski","Hristijan",""],["Tolos","Laura",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 17:31:36 GMT"}],"updateDate":"2024-08-05","timestamp":1722619896000,"abstract":"  Complementary to high-energy experimental efforts, indirect astrophysical\nsearches of particles beyond the standard model have long been pursued. The\npresent article follows the latter approach and considers, for the first time,\nthe self-consistent treatment of the energy losses from dark flavored particles\nproduced in the decay of hyperons during a core-collapse supernova (CCSN). To\nthis end, general relativistic supernova simulations in spherical symmetry are\nperformed, featuring six-species Boltzmann neutrino transport, and covering the\nlong-term evolution of the nascent remnant proto-neutron star (PNS)\ndeleptonization for several tens of seconds. A well-calibrated hyperon equation\nof state (EOS) is therefore implemented into the supernova simulations and\ntested against the corresponding nucleonic model. It is found that supernova\nobservables, such as the neutrino signal, are robustly insensitive to the\nappearance of hyperons for the simulation times considered in the present\nstudy. The presence of hyperons enables an additional channel for the\nappearance of dark sector particles, which is considered at the level of the\n$\\Lambda$ hyperon decay. Assuming massless particles that escape the PNS after\nbeing produced, these channels expedite the deleptonizing PNS and the cooling\nbehaviour. This, in turn, shortens the neutrino emission timescale. The present\nstudy confirms the previously estimated upper limits on the corresponding\nbranching ratios for low and high mass PNS, by effectively reducing the\nneutrino emission timescale by a factor of two. This is consistent with the\nclassical argument deduced from the neutrino detection associated with SN1987A.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Phenomenology","Physics/Nuclear Theory"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"GDwu13CE3CxoXQQLUxbojMBzvJ2pXEv39iHy-F4FTz0","pdfSize":"1662402","txDigest":"7GNHhYPd4QUUUGW4XrJXm57WhMmMZobe2885PxZALsXv","endEpoch":"1","status":"CERTIFIED"}
