{"id":"2408.03141","title":"Groupoid Graded Semisimple Rings","authors":"Zaqueu Cristiano, Wellington Marques de Souza and Javier S\\'anchez","authorsParsed":[["Cristiano","Zaqueu",""],["de Souza","Wellington Marques",""],["Sánchez","Javier",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 12:34:43 GMT"}],"updateDate":"2024-08-07","timestamp":1722947683000,"abstract":"  We develop the theory of groupoid graded semisimple rings. Our rings are\nneither unital nor one-sided artinian. Instead, they exhibit a strong version\nof having local units and being locally artinian, and we call them\n$\\Gamma_0$-artinian. One of our main results is a groupoid graded version of\nthe Wedderburn-Artin Theorem, where we characterize groupoid graded semisimple\nrings as direct sums of graded simple $\\Gamma_0$-artinian rings and we exhibit\nthe structure of this latter class of rings. In this direction, we also prove a\ngroupoid graded version of Jacobson-Chevalley density theorem. We need to\ndefine and study properties of groupoid gradings on matrix rings (possibly of\ninfinite size) over groupoid graded rings, and specially over groupoid graded\ndivision rings. Because of that, we study groupoid graded division rings and\ntheir graded modules. We consider a natural notion of freeness for groupoid\ngraded modules that, when specialized to group graded rings, gives the usual\none, and show that for a groupoid graded division ring all graded modules are\nfree (in this sense). Contrary to the group graded case, there are groupoid\ngraded rings for which all graded modules are free according to our definition,\nbut they are not graded division rings. We exhibit an easy example of this kind\nof rings and characterize such class among groupoid graded semisimple rings. We\nalso relate groupoid graded semisimple rings with the notion of semisimple\ncategory defined by B. Mitchell. For that, we show the link between functors\nfrom a preadditive category to abelian groups and graded modules over the\ngroupoid graded ring associated to this category, generalizing a result of P.\nGabriel. We characterize simple artinian categories and categories for which\nevery functor from them to abelian groups is free in the sense of B. Mitchell.\n","subjects":["Mathematics/Rings and Algebras","Mathematics/Category Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}