{"id":"2408.08294","title":"Aliasing and Label-Independent Decomposition of Risk: Beyond the\n  bias-variance trade-off","authors":"Mark K. Transtrum, Gus L. W. Hart, Tyler J. Jarvis, Jared P. Whitehead","authorsParsed":[["Transtrum","Mark K.",""],["Hart","Gus L. W.",""],["Jarvis","Tyler J.",""],["Whitehead","Jared P.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 17:49:24 GMT"}],"updateDate":"2024-08-16","timestamp":1723744164000,"abstract":"  A central problem in data science is to use potentially noisy samples of an\nunknown function to predict function values for unseen inputs. In classical\nstatistics, the predictive error is understood as a trade-off between the bias\nand the variance that balances model simplicity with its ability to fit complex\nfunctions. However, over-parameterized models exhibit counter-intuitive\nbehaviors, such as \"double descent\" in which models of increasing complexity\nexhibit decreasing generalization error. We introduce an alternative paradigm\ncalled the generalized aliasing decomposition. We explain the asymptotically\nsmall error of complex models as a systematic \"de-aliasing\" that occurs in the\nover-parameterized regime. In the limit of large models, the contribution due\nto aliasing vanishes, leaving an expression for the asymptotic total error we\ncall the invertibility failure of very large models on few training points.\nBecause the generalized aliasing decomposition can be explicitly calculated\nfrom the relationship between model class and samples without seeing any data\nlabels, it can answer questions related to experimental design and model\nselection before collecting data or performing experiments. We demonstrate this\napproach using several examples, including classical regression problems and a\ncluster expansion model used in materials science.\n","subjects":["Mathematics/Statistics Theory","Computing Research Repository/Machine Learning","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Statistics/Machine Learning","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}