{"id":"2408.07119","title":"Systematically Measuring Ultra-Diffuse Galaxies. VII. The HI Survey\n  Overview","authors":"Ananthan Karunakaran, Khadeejah Motiwala, Kristine Spekkens, Dennis\n  Zaritsky, Richard L. Donnerstein, Arjun Dey","authorsParsed":[["Karunakaran","Ananthan",""],["Motiwala","Khadeejah",""],["Spekkens","Kristine",""],["Zaritsky","Dennis",""],["Donnerstein","Richard L.",""],["Dey","Arjun",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-15","timestamp":1723572000000,"abstract":"  We present the results from the neutral hydrogen (HI) follow-up survey of 378\noptically-detected UDG candidates from the Systematically Measuring\nUltra-Diffuse Galaxies (SMUDGes) survey using the Robert C. Byrd Green Bank\nTelescope (GBT). We detect HI in 110 targets and determine 37 to be UDGs and 73\nto be low surface brightness (LSB) dwarfs based on their effective radii and\ncentral surface brightnesses. In line with previous studies, we find that: i)\nour HI detections have on average bluer $g-r$ colors and more irregular\nmorphologies than our HI non-detections, ii) our HI detections populate the\ntail end of the star-forming main sequence from the ALFALFA catalog with\nmarginally lower specific star formation rates, and iii) HI detections are\nmostly in relatively isolated (i.e. field) environments, while most\nnon-detections have at least one nearby neighbor in projection. We find that\nthe HI mass to stellar mass ratios (i.e. gas richnesses) scale with the\nphysical sizes for UDGs and LSB dwarfs alike, suggesting that mechanisms other\nthan bursty star formation feedback may be at play for UDGs. However, we find a\nstronger trend between gas richnesses and physical sizes if we define UDGs\nusing their effective surface brightness instead of their central surface\nbrightness. We are in the process of using this unprecedented sample of UDG\ncandidates to carry out detailed follow-up studies (i.e. star-formation and\nenvironmental analysis, comparisons to simulations) and are obtaining resolved\nHI observations for several of them.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}