{"id":"2408.12017","title":"Radiation Hydrodynamic Simulations of Massive Stars in Gas-rich\n  Environments: Accretion of AGN Stars Suppressed By Thermal Feedback","authors":"Yi-Xian Chen, Yan-Fei Jiang, Jeremy Goodman, and Douglas N. C. Lin","authorsParsed":[["Chen","Yi-Xian",""],["Jiang","Yan-Fei",""],["Goodman","Jeremy",""],["Lin","Douglas N. C.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 22:03:12 GMT"}],"updateDate":"2024-08-23","timestamp":1724277792000,"abstract":"  Massive stars may form in or be captured into AGN disks. Recent 1D studies\nemploying stellar-evolution codes have demonstrated the potential for rapid\ngrowth of such stars through accretion up to a few hundred $M_\\odot$. We\nperform 3D radiation hydrodynamic simulations of moderately massive stars'\nenvelopes, in order to determine the rate and critical radius $R_{\\rm crit}$ of\ntheir accretion process in an isotropic gas-rich environment in the absence of\nluminosity-driven mass loss. We find that in the ``fast-diffusion\" regime where\ncharacteristic radiative diffusion speed $c/\\tau$ is faster than the gas sound\nspeed $c_s$, the accretion rate is suppressed by feedback from gravitational\nand radiative advection energy flux, in addition to the stellar luminosity.\nAlternatively, in the ``slow-diffusion\" regime where $c/\\tau<c_s$, due to\nadiabatic accretion, the stellar envelope expands quickly to become hydrostatic\nand further net accretion occurs on thermal timescales in the absence of\nself-gravity. When the radiation entropy of the medium is less than that of the\nstar, however, this hydrostatic envelope can become more massive than the star\nitself. Within this sub-regime, self-gravity of the envelope excites runaway\ngrowth. Applying our results to realistic environments, moderately massive\nstars ($\\lesssim 100M_\\odot$) embedded in AGN disks typically accrete in the\nfast-diffusion regime, leading to reduction of steady-state accretion rate 1-2\norders of magnitudes lower than expected by previous 1D calculations and\n$R_{\\rm crit}$ smaller than the disk scale height, except in the opacity window\nat temperature $T\\sim 2000$K. Accretion in slow diffusion regime occurs in\nregions with very high density $\\rho\\gtrsim 10^{-9}$g/cm$^3$, and needs to be\ntreated with caution in 1D long-term calculations.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}