{"id":"2408.02195","title":"On the global Gaussian bending measure and its applications in\n  stationary spacetimes","authors":"Z. Zhang and R. Zhang","authorsParsed":[["Zhang","Z.",""],["Zhang","R.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 02:39:41 GMT"}],"updateDate":"2024-08-06","timestamp":1722825581000,"abstract":"  Alternative gravity theories have been put forward to address the limitations\nof general relativity, each exhibiting differences, particularly in their\nstrong-field limits. Nonetheless, there remains a lack of effective means to\ndistinguish or test these theories through local strong-field measurements. In\nthis work, we define a global Gaussian bending measure over singular spacetime\nregions, establish a corresponding global theory, and demonstrate its\napplications in a general stationary spacetime. The global theory is based on\ndifferential geometry, rather than on specific gravity theories, allowing it to\ndepict various physics within general relativity and beyond. For example, it is\napplicable to describe the gravitational bending of massless or massive\nmessengers, such as photons, neutrinos, cosmic rays, and possibly massive\ngravitational waves predicted in certain theories of gravity. Besides, the\nglobal theory can be applied to any stationary spacetime regions outside a\nrotating black hole. As an instance of its direct applications, we investigate\nthe highly-curved spacetime effects of the black hole in its immediate\nsurrounding regions and design local strong-field experiments involving\ndifferent shapes of singular lensing patches. New means can be therefore\nanticipated to be developed according to the global theory to differentiate\nbetween different gravity theories and test them in their strong-field regions.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ML9iRLwFj08Xq2tsFeXIj4gNiydd7O95kYX8n-2p5mI","pdfSize":"773882"}
