{"id":"2408.09994","title":"Conversion of linearly polarized high-harmonic radiation into the\n  circularly polarized in an optically modulated plasma-based X-ray laser:\n  taking into account the nonlinearity and finite width of the harmonic\n  spectral lines","authors":"Vladimir A. Antonov, Ilias R. Khairulin, and Mikhail Yu. Ryabikin","authorsParsed":[["Antonov","Vladimir A.",""],["Khairulin","Ilias R.",""],["Ryabikin","Mikhail Yu.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 13:45:35 GMT"}],"updateDate":"2024-08-20","timestamp":1724075135000,"abstract":"  The method proposed in [I.R. Khairulin et al., JETP Letters 117(9), 652\n(2023)] for converting the linearly polarized radiation of high-order harmonics\nof an optical field into the circularly polarized in an optically modulated\nactive medium of a plasma-based X-ray laser has been de-veloped. This method is\nextended to the case of finite width of spectral lines (finite pulse dura-tion)\nof high harmonic radiation and nonlinear interaction of radiation with matter.\nThe trans-formation of the polarization of the harmonic field is achieved by\nintroducing a phase shift of {\\pi}/2 between its polarization components,\nparallel and orthogonal to the polarization of the modulating field, through\nresonant dispersion on the spectral wings of the induced gain lines of the\nactive medium and is accompanied by an increase in the power of high harmonics.\nIt is shown that for harmonics with a finite bandwidth, the polarization of the\noutput radiation is non-uniform in time. The reasons for such non-uniformity\nare analyzed and the conditions for its minimization are found. The influence\nof nonlinearity and amplified spontaneous radiation of the active medium on the\nhigh-harmonic polarization is investigated. The possibilities for the\nexperimental implementation of this effect in a neon-like active medium of a\nplasma X-ray laser based on Ti12+ ions with an unperturbed wavelength of the\ninverted transition at 32.6 nm are analyzed.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}