{"id":"2408.02421","title":"FE-Adapter: Adapting Image-based Emotion Classifiers to Videos","authors":"Shreyank N Gowda, Boyan Gao, David A. Clifton","authorsParsed":[["Gowda","Shreyank N",""],["Gao","Boyan",""],["Clifton","David A.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 12:27:28 GMT"}],"updateDate":"2024-08-06","timestamp":1722860848000,"abstract":"  Utilizing large pre-trained models for specific tasks has yielded impressive\nresults. However, fully fine-tuning these increasingly large models is becoming\nprohibitively resource-intensive. This has led to a focus on more\nparameter-efficient transfer learning, primarily within the same modality. But\nthis approach has limitations, particularly in video understanding where\nsuitable pre-trained models are less common. Addressing this, our study\nintroduces a novel cross-modality transfer learning approach from images to\nvideos, which we call parameter-efficient image-to-video transfer learning. We\npresent the Facial-Emotion Adapter (FE-Adapter), designed for efficient\nfine-tuning in video tasks. This adapter allows pre-trained image models, which\ntraditionally lack temporal processing capabilities, to analyze dynamic video\ncontent efficiently. Notably, it uses about 15 times fewer parameters than\nprevious methods, while improving accuracy. Our experiments in video emotion\nrecognition demonstrate that the FE-Adapter can match or even surpass existing\nfine-tuning and video emotion models in both performance and efficiency. This\nbreakthrough highlights the potential for cross-modality approaches in\nenhancing the capabilities of AI models, particularly in fields like video\nemotion analysis where the demand for efficiency and accuracy is constantly\nrising.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"k0bBOgqIvP-dRCyzEWNnQ4XItH-fY2ye4TrDf6KKdFg","pdfSize":"347128","txDigest":"4A1HmxMpiu3v6offryWT3jE6AZH6mehz8d4UH9i6o5hN","endEpoch":"1","status":"CERTIFIED"}
