{"id":"2408.15252","title":"Generative AI on SpectrumNet: An Open Benchmark of Multiband 3D Radio\n  Maps","authors":"Shuhang Zhang, Shuai Jiang, Wanjie Lin, Zheng Fang, Kangjun Liu,\n  Hongliang Zhang, and Ke Chen","authorsParsed":[["Zhang","Shuhang",""],["Jiang","Shuai",""],["Lin","Wanjie",""],["Fang","Zheng",""],["Liu","Kangjun",""],["Zhang","Hongliang",""],["Chen","Ke",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 07:54:11 GMT"}],"updateDate":"2024-08-29","timestamp":1723190051000,"abstract":"  Radio map is an efficient demonstration for visually displaying the wireless\nsignal coverage within a certain region. It has been considered to be\nincreasingly helpful for the future sixth generation (6G) of wireless networks,\nas wireless nodes are becoming more crowded and complicated. However, the\nconstruction of high resolution radio map is very challenging due to the sparse\nsampling in practical systems. Generative artificial intelligence (AI), which\nis capable to create synthetic data to fill in gaps in real-world measurements,\nis an effective technique to construct high precision radio maps. Currently,\ngenerative models for radio map construction are trained with two-dimension\n(2D) single band radio maps in urban scenario, which has poor generalization in\ndiverse terrain scenarios, spectrum bands, and heights. To tackle this problem,\nwe provide a multiband three-dimension (3D) radio map dataset with\nconsideration of terrain and climate information, named SpectrumNet. It is the\nlargest radio map dataset in terms of dimensions and scale, which contains the\nradio map of 3 spacial dimensions, 5 frequency bands, 11 terrain scenarios, and\n3 climate scenarios. We introduce the parameters and settings for the\nSpectrumNet dataset generation, and evaluate three baseline methods for radio\nmap construction based on the SpectrumNet dataset. Experiments show the\nnecessity of the SpectrumNet dataset for training models with strong\ngeneralization in spacial, frequency, and scenario domains. Future works on the\nSpectrumNet dataset are also discussed, including the dataset expansion and\ncalibration, as well as the extended studies on generative models for radio map\nconstruction based on the SpectrumNet dataset.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"J2fJyclKM7vyefJtTlf6nSVypbU7euEQvBiL2vW6mW0","pdfSize":"6182435"}
