{"id":"2408.12279","title":"Developing vocal system impaired patient-aimed voice quality assessment\n  approach using ASR representation-included multiple features","authors":"Shaoxiang Dang, Tetsuya Matsumoto, Yoshinori Takeuchi, Takashi Tsuboi,\n  Yasuhiro Tanaka, Daisuke Nakatsubo, Satoshi Maesawa, Ryuta Saito, Masahisa\n  Katsuno, and Hiroaki Kudo","authorsParsed":[["Dang","Shaoxiang",""],["Matsumoto","Tetsuya",""],["Takeuchi","Yoshinori",""],["Tsuboi","Takashi",""],["Tanaka","Yasuhiro",""],["Nakatsubo","Daisuke",""],["Maesawa","Satoshi",""],["Saito","Ryuta",""],["Katsuno","Masahisa",""],["Kudo","Hiroaki",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 10:22:53 GMT"}],"updateDate":"2024-08-23","timestamp":1724322173000,"abstract":"  The potential of deep learning in clinical speech processing is immense, yet\nthe hurdles of limited and imbalanced clinical data samples loom large. This\narticle addresses these challenges by showcasing the utilization of automatic\nspeech recognition and self-supervised learning representations, pre-trained on\nextensive datasets of normal speech. This innovative approach aims to estimate\nvoice quality of patients with impaired vocal systems. Experiments involve\nchecks on PVQD dataset, covering various causes of vocal system damage in\nEnglish, and a Japanese dataset focusing on patients with Parkinson's disease\nbefore and after undergoing subthalamic nucleus deep brain stimulation\n(STN-DBS) surgery. The results on PVQD reveal a notable correlation (>0.8 on\nPCC) and an extraordinary accuracy (<0.5 on MSE) in predicting Grade, Breathy,\nand Asthenic indicators. Meanwhile, progress has been achieved in predicting\nthe voice quality of patients in the context of STN-DBS.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1INBEeO0pT4v3zIEDAqdNHgJ9-NPZBuQTZOH3f_e3-o","pdfSize":"998322"}
