{"id":"2408.03331","title":"The Wasserstein Bipolarization Index: A New Measure of Public Opinion\n  Polarization, with an Application to Cross-Country Attitudes toward COVID-19\n  Vaccination Mandates","authors":"Hane Lee, Michael E. Sobel","authorsParsed":[["Lee","Hane",""],["Sobel","Michael E.",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 00:15:13 GMT"}],"updateDate":"2024-08-08","timestamp":1721434513000,"abstract":"  Although the topic of opinion polarization receives much attention from the\nmedia, public opinion researchers and political scientists, the phenomenon\nitself has not been adequately characterized in either the lay or academic\nliterature. To study opinion polarization among the public, researchers compare\nthe distributions of respondents to survey questions or track the distribution\nof responses to a question over time using ad-hoc methods and measures such as\nvisual comparisons, variances, and bimodality coefficients. To remedy this\nsituation, we build on the axiomatic approach in the economics literature on\nincome bipolarization, specifying key properties a measure of bipolarization\nshould satisfy: in particular, it should increase as the distribution spreads\naway from a center toward the poles and/or as clustering below or above this\ncenter increases. We then show that measures of bipolarization used in public\nopinion research fail to satisfy one or more of these axioms. Next, we propose\na $p$-Wasserstein polarization index that satisfies the axioms we set forth.\nOur index measures the dissimilarity between an observed distribution and a\ndistribution with all the mass clustered on the lower and upper endpoints of\nthe scale. We use our index to examine bipolarization in attitudes toward\ngovernmental COVID-19 vaccine mandates across 11 countries, finding the U.S and\nU.K are most polarized, China, France and India the least polarized, while the\nothers (Brazil, Australia, Colombia, Canada, Italy, Spain) occupy an\nintermediate position.\n","subjects":["Physics/Physics and Society","Computing Research Repository/Social and Information Networks","Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}