{"id":"2408.15041","title":"Earth Observation Satellite Scheduling with Graph Neural Networks","authors":"Antoine Jacquet and Guillaume Infantes and Nicolas Meuleau and\n  Emmanuel Benazera and St\\'ephanie Roussel and Vincent Baudoui and Jonathan\n  Guerra","authorsParsed":[["Jacquet","Antoine",""],["Infantes","Guillaume",""],["Meuleau","Nicolas",""],["Benazera","Emmanuel",""],["Roussel","Stéphanie",""],["Baudoui","Vincent",""],["Guerra","Jonathan",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 13:10:26 GMT"}],"updateDate":"2024-08-28","timestamp":1724764226000,"abstract":"  The Earth Observation Satellite Planning (EOSP) is a difficult optimization\nproblem with considerable practical interest. A set of requested observations\nmust be scheduled on an agile Earth observation satellite while respecting\nconstraints on their visibility window, as well as maneuver constraints that\nimpose varying delays between successive observations. In addition, the problem\nis largely oversubscribed: there are much more candidate observations than what\ncan possibly be achieved. Therefore, one must select the set of observations\nthat will be performed while maximizing their weighted cumulative benefit, and\npropose a feasible schedule for these observations. As previous work mostly\nfocused on heuristic and iterative search algorithms, this paper presents a new\ntechnique for selecting and scheduling observations based on Graph Neural\nNetworks (GNNs) and Deep Reinforcement Learning (DRL). GNNs are used to extract\nrelevant information from the graphs representing instances of the EOSP, and\nDRL drives the search for optimal schedules. Our simulations show that it is\nable to learn on small problem instances and generalize to larger real-world\ninstances, with very competitive performance compared to traditional\napproaches.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"O4mDHhzbd4m2ratrkdLiYP5SIUOY3T4_sDNaIkdDHTY","pdfSize":"824245"}
