{"id":"2408.12727","title":"BankTweak: Adversarial Attack against Multi-Object Trackers by\n  Manipulating Feature Banks","authors":"Woojin Shin, Donghwa Kang, Daejin Choi, Brent Kang, Jinkyu Lee,\n  Hyeongboo Baek","authorsParsed":[["Shin","Woojin",""],["Kang","Donghwa",""],["Choi","Daejin",""],["Kang","Brent",""],["Lee","Jinkyu",""],["Baek","Hyeongboo",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 20:35:46 GMT"}],"updateDate":"2024-08-26","timestamp":1724358946000,"abstract":"  Multi-object tracking (MOT) aims to construct moving trajectories for\nobjects, and modern multi-object trackers mainly utilize the\ntracking-by-detection methodology. Initial approaches to MOT attacks primarily\naimed to degrade the detection quality of the frames under attack, thereby\nreducing accuracy only in those specific frames, highlighting a lack of\n\\textit{efficiency}. To improve efficiency, recent advancements manipulate\nobject positions to cause persistent identity (ID) switches during the\nassociation phase, even after the attack ends within a few frames. However,\nthese position-manipulating attacks have inherent limitations, as they can be\neasily counteracted by adjusting distance-related parameters in the association\nphase, revealing a lack of \\textit{robustness}. In this paper, we present\n\\textsf{BankTweak}, a novel adversarial attack designed for MOT trackers, which\nfeatures efficiency and robustness. \\textsf{BankTweak} focuses on the feature\nextractor in the association phase and reveals vulnerability in the Hungarian\nmatching method used by feature-based MOT systems. Exploiting the\nvulnerability, \\textsf{BankTweak} induces persistent ID switches (addressing\n\\textit{efficiency}) even after the attack ends by strategically injecting\naltered features into the feature banks without modifying object positions\n(addressing \\textit{robustness}). To demonstrate the applicability, we apply\n\\textsf{BankTweak} to three multi-object trackers (DeepSORT, StrongSORT, and\nMOTDT) with one-stage, two-stage, anchor-free, and transformer detectors.\nExtensive experiments on the MOT17 and MOT20 datasets show that our method\nsubstantially surpasses existing attacks, exposing the vulnerability of the\ntracking-by-detection framework to \\textsf{BankTweak}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"u3mvoF-TtwO4MrOhb59phwfr7tiCSI_fs23zT6qvKhQ","pdfSize":"1078665"}
