{"id":"2408.10446","title":"The Brittleness of AI-Generated Image Watermarking Techniques: Examining\n  Their Robustness Against Visual Paraphrasing Attacks","authors":"Niyar R Barman, Krish Sharma, Ashhar Aziz, Shashwat Bajpai,\n  Shwetangshu Biswas, Vasu Sharma, Vinija Jain, Aman Chadha, Amit Sheth and\n  Amitava Das","authorsParsed":[["Barman","Niyar R",""],["Sharma","Krish",""],["Aziz","Ashhar",""],["Bajpai","Shashwat",""],["Biswas","Shwetangshu",""],["Sharma","Vasu",""],["Jain","Vinija",""],["Chadha","Aman",""],["Sheth","Amit",""],["Das","Amitava",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 22:58:30 GMT"}],"updateDate":"2024-08-21","timestamp":1724108310000,"abstract":"  The rapid advancement of text-to-image generation systems, exemplified by\nmodels like Stable Diffusion, Midjourney, Imagen, and DALL-E, has heightened\nconcerns about their potential misuse. In response, companies like Meta and\nGoogle have intensified their efforts to implement watermarking techniques on\nAI-generated images to curb the circulation of potentially misleading visuals.\nHowever, in this paper, we argue that current image watermarking methods are\nfragile and susceptible to being circumvented through visual paraphrase\nattacks. The proposed visual paraphraser operates in two steps. First, it\ngenerates a caption for the given image using KOSMOS-2, one of the latest\nstate-of-the-art image captioning systems. Second, it passes both the original\nimage and the generated caption to an image-to-image diffusion system. During\nthe denoising step of the diffusion pipeline, the system generates a visually\nsimilar image that is guided by the text caption. The resulting image is a\nvisual paraphrase and is free of any watermarks. Our empirical findings\ndemonstrate that visual paraphrase attacks can effectively remove watermarks\nfrom images. This paper provides a critical assessment, empirically revealing\nthe vulnerability of existing watermarking techniques to visual paraphrase\nattacks. While we do not propose solutions to this issue, this paper serves as\na call to action for the scientific community to prioritize the development of\nmore robust watermarking techniques. Our first-of-its-kind visual paraphrase\ndataset and accompanying code are publicly available.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}