{"id":"2408.15765","title":"Conceptual Design on the Field of View of Celestial Navigation Systems\n  for Maritime Autonomous Surface Ships","authors":"Kouki Wakita and Fuyuki Hane and Takeshi Sekiguchi and Shigehito\n  Shimizu and Shinji Mitani and Youhei Akimoto and Atsuo Maki","authorsParsed":[["Wakita","Kouki",""],["Hane","Fuyuki",""],["Sekiguchi","Takeshi",""],["Shimizu","Shigehito",""],["Mitani","Shinji",""],["Akimoto","Youhei",""],["Maki","Atsuo",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 12:57:46 GMT"}],"updateDate":"2024-08-29","timestamp":1724849866000,"abstract":"  In order to understand the appropriate field of view (FOV) size of celestial\nautomatic navigation systems for surface ships, we investigate the variations\nof measurement accuracy of star position and probability of successful star\nidentification with respect to FOV, focusing on the decreasing number of\nobservable star magnitudes and the presence of physically covered stars in\nmarine environments. The results revealed that, although a larger FOV reduces\nthe measurement accuracy of star positions, it increases the number of\nobservable objects and thus improves the probability of star identification\nusing subgraph isomorphism-based methods. It was also found that, although at\nleast four objects need to be observed for accurate identification, four\nobjects may not be sufficient for wider FOVs. On the other hand, from the point\nof view of celestial navigation systems, a decrease in the measurement accuracy\nleads to a decrease in positioning accuracy. Therefore, it was found that\nmaximizing the FOV is required for celestial automatic navigation systems as\nlong as the desired positioning accuracy can be ensured. Furthermore, it was\nfound that algorithms incorporating more than four observed celestial objects\nare required to achieve highly accurate star identification over a wider FOV.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}