{"id":"2408.11583","title":"Constructions of Efficiently Implementable Boolean functions Possessing\n  High Nonlinearity and Good Resistance to Algebraic Attacks","authors":"Claude Carlet and Palash Sarkar","authorsParsed":[["Carlet","Claude",""],["Sarkar","Palash",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 12:46:50 GMT"}],"updateDate":"2024-08-22","timestamp":1724244410000,"abstract":"  We describe two new classes of functions which provide the presently best\nknown trade-offs between low computational complexity, nonlinearity and (fast)\nalgebraic immunity. The nonlinearity and (fast) algebraic immunity of the new\nfunctions substantially improve upon those properties of all previously known\nefficiently implementable functions. Appropriately chosen functions from the\ntwo new classes provide excellent solutions to the problem of designing\nfiltering functions for use in the nonlinear filter model of stream ciphers, or\nin any other stream ciphers using Boolean functions for ensuring confusion. In\nparticular, for $n\\leq 20$, we show that there are functions in our first\nfamily whose implementation efficiences are significantly lower than all\npreviously known functions achieving a comparable combination of nonlinearity\nand (fast) algebraic immunity. Given positive integers $\\ell$ and $\\delta$, it\nis possible to choose a function from our second family whose linear bias is\nprovably at most $2^{-\\ell}$, fast algebraic immunity is at least $\\delta$\n(based on conjecture which is well supported by experimental results), and\nwhich can be implemented in time and space which is linear in $\\ell$ and\n$\\delta$. Further, the functions in our second family are built using\nhomomorphic friendly operations, making these functions well suited for the\napplication of transciphering.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"V-261lZjwwJQ3niEVO4-kHCdOh9vjW3mBUqAiB4PG5Q","pdfSize":"442277"}
