{"id":"2408.12665","title":"Fairness-Aware Streaming Feature Selection with Causal Graphs","authors":"Leizhen Zhang, Lusi Li, Di Wu, Sheng Chen and Yi He","authorsParsed":[["Zhang","Leizhen",""],["Li","Lusi",""],["Wu","Di",""],["Chen","Sheng",""],["He","Yi",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 00:41:02 GMT"}],"updateDate":"2024-08-26","timestamp":1723855262000,"abstract":"  Its crux lies in the optimization of a tradeoff between accuracy and fairness\nof resultant models on the selected feature subset. The technical challenge of\nour setting is twofold: 1) streaming feature inputs, such that an informative\nfeature may become obsolete or redundant for prediction if its information has\nbeen covered by other similar features that arrived prior to it, and 2)\nnon-associational feature correlation, such that bias may be leaked from those\nseemingly admissible, non-protected features. To overcome this, we propose\nStreaming Feature Selection with Causal Fairness (SFCF) that builds two causal\ngraphs egocentric to prediction label and protected feature, respectively,\nstriving to model the complex correlation structure among streaming features,\nlabels, and protected information. As such, bias can be eradicated from\npredictive modeling by removing those features being causally correlated with\nthe protected feature yet independent to the labels. We theorize that the\noriginally redundant features for prediction can later become admissible, when\nthe learning accuracy is compromised by the large number of removed features\n(non-protected but can be used to reconstruct bias information). We benchmark\nSFCF\\ on five datasets widely used in streaming feature research, and the\nresults substantiate its performance superiority over six rival models in terms\nof efficiency and sparsity of feature selection and equalized odds of the\nresultant predictive models.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Graphics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}