{"id":"2408.12390","title":"Density dependence of thermal conductivity in nanoporous and amorphous\n  carbon with machine-learned molecular dynamics","authors":"Yanzhou Wang, Zheyong Fan, Ping Qian, Miguel A. Caro and Tapio\n  Ala-Nissila","authorsParsed":[["Wang","Yanzhou",""],["Fan","Zheyong",""],["Qian","Ping",""],["Caro","Miguel A.",""],["Ala-Nissila","Tapio",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 13:32:03 GMT"}],"updateDate":"2024-08-23","timestamp":1724333523000,"abstract":"  Disordered forms of carbon are an important class of materials for\napplications such as thermal management. However, a comprehensive theoretical\nunderstanding of the structural dependence of thermal transport and the\nunderlying microscopic mechanisms is lacking. Here we study the\nstructure-dependent thermal conductivity of disordered carbon by employing\nmolecular dynamics (MD) simulations driven by a machine-learned interatomic\npotential based on the efficient neuroevolution potential approach. Using\nlarge-scale MD simulations, we generate realistic nanoporous carbon (NP-C)\nsamples with density varying from $0.3$ to $1.5$ g cm$^{-3}$ dominated by\nsp$^2$ motifs, and amorphous carbon (a-C) samples with density varying from\n$1.5$ to $3.5$ g cm$^{-3}$ exhibiting mixed sp$^2$ and sp$^3$ motifs.\nStructural properties including short- and medium-range order are characterized\nby atomic coordination, pair correlation function, angular distribution\nfunction and structure factor. Using the homogeneous nonequilibrium MD method\nand the associated quantum-statistical correction scheme, we predict a linear\nand a superlinear density dependence of thermal conductivity for NP-C and a-C,\nrespectively, in good agreement with relevant experiments. The distinct density\ndependences are attributed to the different impacts of the sp$^2$ and sp$^3$\nmotifs on the spectral heat capacity, vibrational mean free paths and group\nvelocity. We additionally highlight the significant role of structural order in\nregulating the thermal conductivity of disordered carbon.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}