{"id":"2408.09465","title":"MedMAP: Promoting Incomplete Multi-modal Brain Tumor Segmentation with\n  Alignment","authors":"Tianyi Liu and Zhaorui Tan and Muyin Chen and Xi Yang and Haochuan\n  Jiang and Kaizhu Huang","authorsParsed":[["Liu","Tianyi",""],["Tan","Zhaorui",""],["Chen","Muyin",""],["Yang","Xi",""],["Jiang","Haochuan",""],["Huang","Kaizhu",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 13:16:30 GMT"}],"updateDate":"2024-08-20","timestamp":1723986990000,"abstract":"  Brain tumor segmentation is often based on multiple magnetic resonance\nimaging (MRI). However, in clinical practice, certain modalities of MRI may be\nmissing, which presents a more difficult scenario. To cope with this challenge,\nKnowledge Distillation, Domain Adaption, and Shared Latent Space have emerged\nas commonly promising strategies. However, recent efforts typically overlook\nthe modality gaps and thus fail to learn important invariant feature\nrepresentations across different modalities. Such drawback consequently leads\nto limited performance for missing modality models. To ameliorate these\nproblems, pre-trained models are used in natural visual segmentation tasks to\nminimize the gaps. However, promising pre-trained models are often unavailable\nin medical image segmentation tasks. Along this line, in this paper, we propose\na novel paradigm that aligns latent features of involved modalities to a\nwell-defined distribution anchor as the substitution of the pre-trained model}.\nAs a major contribution, we prove that our novel training paradigm ensures a\ntight evidence lower bound, thus theoretically certifying its effectiveness.\nExtensive experiments on different backbones validate that the proposed\nparadigm can enable invariant feature representations and produce models with\nnarrowed modality gaps. Models with our alignment paradigm show their superior\nperformance on both BraTS2018 and BraTS2020 datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}