{"id":"2408.00772","title":"Hybrid Deep Learning Framework for Enhanced Melanoma Detection","authors":"Peng Zhang, Divya Chaudhary","authorsParsed":[["Zhang","Peng",""],["Chaudhary","Divya",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 04:58:47 GMT"}],"updateDate":"2024-08-05","timestamp":1721105927000,"abstract":"  Cancer is a leading cause of death worldwide, necessitating advancements in\nearly detection and treatment technologies. In this paper, we present a novel\nand highly efficient melanoma detection framework that synergistically combines\nthe strengths of U-Net for segmentation and EfficientNet for the classification\nof skin images. The primary objective of our study is to enhance the accuracy\nand efficiency of melanoma detection through an innovative hybrid approach. We\nutilized the HAM10000 dataset to meticulously train the U-Net model, enabling\nit to precisely segment cancerous regions. Concurrently, we employed the ISIC\n2020 dataset to train the EfficientNet model, optimizing it for the binary\nclassification of skin cancer. Our hybrid model demonstrates a significant\nimprovement in performance, achieving a remarkable accuracy of 99.01% on the\nISIC 2020 dataset. This exceptional result underscores the superiority of our\napproach compared to existing model structures. By integrating the precise\nsegmentation capabilities of U-Net with the advanced classification prowess of\nEfficientNet, our framework offers a comprehensive solution for melanoma\ndetection. The results of our extensive experiments highlight the high accuracy\nand reliability of our method in both segmentation and classification tasks.\nThis indicates the potential of our hybrid approach to significantly enhance\ncancer detection, providing a robust tool for medical professionals in the\nearly diagnosis and treatment of melanoma. We believe that our framework can\nset a new benchmark in the field of automated skin cancer detection,\nencouraging further research and development in this crucial area of medical\nimaging.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Ud67AsVh4DAe6v8gGts1As9IkD8sWF4azQpT0W_3ACk","pdfSize":"3247146","txDigest":"AajM2m1yHHPRVFHtpo8hBGMxSRw8NQawssST6tyr3FG","endEpoch":"1","status":"CERTIFIED"}
