{"id":"2408.16054","title":"Order and disorder in geometrically frustrated magnets","authors":"Arthur P. Ramirez, Sergey Syzranov","authorsParsed":[["Ramirez","Arthur P.",""],["Syzranov","Sergey",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:00:03 GMT"}],"updateDate":"2024-08-30","timestamp":1724868003000,"abstract":"  In geometrically frustrated (GF) magnets, conventional long-range order is\nsuppressed due to the presence of primitive triangular structural units, and\nthe nature of the ensuing ground state remains elusive. One class of candidate\nstates, extensively sought in experiments and vigorously studied theoretically,\nis the quantum spin liquid (QSL), a magnetically-disordered state in which all\nspins participate in a quantum-coherent many-body state. Randomly located\nimpurities, present in all materials, may prevent QSL formation and instead\nlead to the formation of a spin-glass state. In this article, we review\navailable data on the specific heat, magnetic susceptibility, and neutron\nscattering in GF materials. Such data show that a pure GF magnet possesses a\ncharacteristic ``hidden energy scale'' significantly exceeded by the other\nmicroscopic energy scales in the material. When cooled down to a temperature\nbelow the hidden energy scale, a GF material develops significant short-range\norder that dominates its properties and, in particular, dictates the spin-glass\ntransition temperature for experimentally accessible impurity densities. We\nreview the manifestations of short-range order in the commonly observed\nthermodynamics quantities in GF materials, possible scenarios for the hidden\nenergy scale, and related open questions.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Condensed Matter/Quantum Gases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"z6khfIJ3yPZULzLx0ug3zrDgeqGp5axvUZcNKsjSOsM","pdfSize":"1025073"}
