{"id":"2408.09069","title":"Discovery of Limb-Brightening in the Parsec-Scale Jet of NGC 315 through\n  Global VLBI Observations and Its Implications for Jet Models","authors":"Jongho Park, Guang-Yao Zhao, Masanori Nakamura, Yosuke Mizuno, Hung-Yi\n  Pu, Keiichi Asada, Kazuya Takahashi, Kenji Toma, Motoki Kino, Ilje Cho,\n  Kazuhiro Hada, Phil G. Edwards, Hyunwook Ro, Minchul Kam, Kunwoo Yi, Yunjeong\n  Lee, Shoko Koyama, Do-Young Byun, Chris Phillips, Cormac Reynolds, Jeffrey A.\n  Hodgson, Sang-Sung Lee","authorsParsed":[["Park","Jongho",""],["Zhao","Guang-Yao",""],["Nakamura","Masanori",""],["Mizuno","Yosuke",""],["Pu","Hung-Yi",""],["Asada","Keiichi",""],["Takahashi","Kazuya",""],["Toma","Kenji",""],["Kino","Motoki",""],["Cho","Ilje",""],["Hada","Kazuhiro",""],["Edwards","Phil G.",""],["Ro","Hyunwook",""],["Kam","Minchul",""],["Yi","Kunwoo",""],["Lee","Yunjeong",""],["Koyama","Shoko",""],["Byun","Do-Young",""],["Phillips","Chris",""],["Reynolds","Cormac",""],["Hodgson","Jeffrey A.",""],["Lee","Sang-Sung",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 02:11:00 GMT"}],"updateDate":"2024-08-20","timestamp":1723860660000,"abstract":"  We report the first observation of the nearby giant radio galaxy NGC 315\nusing a global VLBI array consisting of 22 radio antennas located across five\ncontinents, including high-sensitivity stations, at 22 GHz. Utilizing the\nextensive $(u,v)$-coverage provided by the array, coupled with the application\nof a recently developed super-resolution imaging technique based on the\nregularized maximum likelihood method, we were able to transversely resolve the\nNGC 315 jet at parsec scales for the first time. Previously known for its\ncentral ridge-brightened morphology at similar scales in former VLBI studies,\nthe jet now clearly exhibits a limb-brightened structure. This finding suggests\nan inherent limb-brightening that was not observable before due to limited\nangular resolution. Considering that the jet is viewed at an angle of\n$\\sim50^\\circ$, the observed limb-brightening is challenging to reconcile with\nthe magnetohydrodynamic models and simulations, which predict that the\nDoppler-boosted jet edges should dominate over the non-boosted central layer.\nThe conventional jet model that proposes a fast spine and a slow sheath with\nuniform transverse emissivity may pertain to our observations. However, in this\nmodel, the relativistic spine would need to travel at speeds of\n$\\Gamma\\gtrsim6.0-12.9$ along the de-projected jet distance of (2.3-10.8)\n$\\times 10^3$ gravitational radii from the black hole. We propose an\nalternative scenario that suggests higher emissivity at the jet boundary layer,\nresulting from more efficient particle acceleration or mass loading onto the\njet edges, and consider prospects for future observations with even higher\nangular resolution.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4G3bQt4ZCd4mYGl_iK4Bh1oNAePQgQq1rZikETYaLf4","pdfSize":"4520765"}
