{"id":"2408.06863","title":"Loop induced $H^\\pm W^\\mp Z$ vertices in the general two Higgs doublet\n  model with CP violation","authors":"Shinya Kanemura and Yushi Mura","authorsParsed":[["Kanemura","Shinya",""],["Mura","Yushi",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 12:55:40 GMT"}],"updateDate":"2024-08-14","timestamp":1723553740000,"abstract":"  Understanding symmetry of extended Higgs models helps to construct the theory\nbeyond the standard model and gives important insights for testing these models\nby experiments. The custodial symmetry plays an important role as a leading\nprinciple to construct non-minimal Higgs sectors. On the other hand, new\nsources of CP violation in the Higgs sector are essentially important to\nexplain the baryon asymmetry of the Universe. In the two Higgs doublet model,\nit has been known that the CP violation and the custodial symmetry are not\ncompatible, and thus the CP violating Higgs potential in general violates the\ncustodial symmetry in the Higgs sector. In this paper, we discuss the\nloop-induced $H^\\pm W^\\mp Z$ vertices in the two Higgs doublet model, which are\ninduced due to the custodial symmetry violation of the sector of the particles\nin the loop, and study how the vertices are affected by the CP violation. We\ncalculate the $H^\\pm W^\\mp Z$ vertices in the most general two Higgs doublet\nmodel with the CP violation at the one-loop level and evaluate the decay modes\n$H^\\pm \\to W^\\pm Z$ caused by these vertices. We obtain new contributions to\nthe $H^\\pm W^\\mp Z$ vertices from the CP violating part of the model, in\naddition to the known contributions from the CP conserving part. Moreover, we\nfind that an asymmetry between the decays $H^+ \\to W^+ Z$ and $H^- \\to W^- Z$\nis caused by the CP violating phases in the model, some of which are important\nfor the electroweak baryogenesis. We also briefly mention testability of these\nvertices at future collider experiments.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}