{"id":"2408.06078","title":"CoFAR Clutter Estimation using Covariance-Free Bayesian Learning","authors":"Kunwar Pritiraj Rajput, Bhavani Shankar M. R., Kumar Vijay Mishra,\n  Muralidhar Rangaswamy, and Bjorn Ottersten","authorsParsed":[["Rajput","Kunwar Pritiraj",""],["R.","Bhavani Shankar M.",""],["Mishra","Kumar Vijay",""],["Rangaswamy","Muralidhar",""],["Ottersten","Bjorn",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 11:53:55 GMT"}],"updateDate":"2024-08-13","timestamp":1723463635000,"abstract":"  A cognitive fully adaptive radar (CoFAR) adapts its behavior on its own\nwithin a short period of time in response to changes in the target environment.\nFor the CoFAR to function properly, it is critical to understand its operating\nenvironment through estimation of the clutter channel impulse response (CCIR).\nIn general, CCIR is sparse but prior works either ignore it or estimate the\nCCIR by imposing sparsity as an explicit constraint in their optimization\nproblem. In this paper, contrary to these studies, we develop covariance-free\nBayesian learning (CoFBL) techniques for estimating sparse CCIR in a CoFAR\nsystem. In particular, we consider a multiple measurement vector scenario and\nestimate a simultaneously sparse (row sparse) CCIR matrix. Our CoFBL framework\nreduces the complexity of conventional sparse Bayesian learning through the use\nof the diagonal element estimation rule and conjugate gradient descent\nalgorithm. We show that the framework is applicable to various forms of CCIR\nsparsity models: group, joint, and joint-cum-group. We evaluate our method\nthrough numerical experiments on a data set generated using RFView, a\nhigh-fidelity modeling and simulation tool. We derive Bayesian Cram\\'{e}r-Rao\nbounds for the various considered scenarios to benchmark the performance of our\nalgorithms. Our results demonstrate that the proposed CoFBL-based approaches\nperform better than the existing popular approaches such as multiple focal\nunderdetermined system solver and simultaneous orthogonal matching pursuit.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}