{"id":"2408.16822","title":"HighSpec: A High-Resolution Spectrograph for the MAST Telescope Array","authors":"Yahel Sofer Rimalt, Sagi Ben-Ami, Eran Ofek, Na'ama Hallakoun, Ido\n  Irani, Oren Ironi, Jani Achren, Alex Bichkovsky, Arie Blumenzweig, Ofir\n  Hershko, Hanindyo Kuncarayakti, Seppo Mattila, Tsevi Mazeh, Gleb Mikhnevich,\n  David Polishook and Ofer Yaron","authorsParsed":[["Rimalt","Yahel Sofer",""],["Ben-Ami","Sagi",""],["Ofek","Eran",""],["Hallakoun","Na'ama",""],["Irani","Ido",""],["Ironi","Oren",""],["Achren","Jani",""],["Bichkovsky","Alex",""],["Blumenzweig","Arie",""],["Hershko","Ofir",""],["Kuncarayakti","Hanindyo",""],["Mattila","Seppo",""],["Mazeh","Tsevi",""],["Mikhnevich","Gleb",""],["Polishook","David",""],["Yaron","Ofer",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:00:02 GMT"}],"updateDate":"2024-09-02","timestamp":1724954402000,"abstract":"  We present the updated design of HighSpec, a high-resolution $\\mathcal{R}\n\\sim 20,000$ spectrograph designed for the Multi Aperture Spectroscopic\nTelescope (MAST). HighSpec offers three observing modes centered at the Ca II\nH&K, Mg b triplet, and H$\\alpha$ lines. Each mode is supported by a highly\noptimized ion-etched grating, contributing to an exceptional instrument peak\nefficiency of $\\gtrsim85\\%$ for the two latter bands ($\\gtrsim55\\%$ for the Ca\nII H&K band). Optimizing throughput over wavelength coverage ($\\Delta\n\\lambda=10-17$ nm), HighSpec enables the precise measurement of spectral lines\nfrom faint targets. This approach is especially relevant for stellar object\nstudies, specifically of WDs, which are intrinsically faint and have few\nspectroscopic lines. Each observing mode was tailored to target spectral\nfeatures essential for WD research. Its integration with MAST, an array of 20\ncustom-designed telescopes that can function as a single large telescope\n(equivalent to a $2.7$ m telescope in collecting area) or multiplexing over the\nentire sky, provides unique adaptability for extensive and effective\nspectroscopic campaigns. Currently in its final assembly and testing stages,\nHighSpec's on-sky commissioning is scheduled for 2025.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}