{"id":"2408.10503","title":"Adaptive Knowledge Distillation for Classification of Hand Images using\n  Explainable Vision Transformers","authors":"Thanh Thi Nguyen, Campbell Wilson, Janis Dalins","authorsParsed":[["Nguyen","Thanh Thi",""],["Wilson","Campbell",""],["Dalins","Janis",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 03:03:56 GMT"}],"updateDate":"2024-08-21","timestamp":1724123036000,"abstract":"  Assessing the forensic value of hand images involves the use of unique\nfeatures and patterns present in an individual's hand. The human hand has\ndistinct characteristics, such as the pattern of veins, fingerprints, and the\ngeometry of the hand itself. This paper investigates the use of vision\ntransformers (ViTs) for classification of hand images. We use explainability\ntools to explore the internal representations of ViTs and assess their impact\non the model outputs. Utilizing the internal understanding of ViTs, we\nintroduce distillation methods that allow a student model to adaptively extract\nknowledge from a teacher model while learning on data of a different domain to\nprevent catastrophic forgetting. Two publicly available hand image datasets are\nused to conduct a series of experiments to evaluate performance of the ViTs and\nour proposed adaptive distillation methods. The experimental results\ndemonstrate that ViT models significantly outperform traditional machine\nlearning methods and the internal states of ViTs are useful for explaining the\nmodel outputs in the classification task. By averting catastrophic forgetting,\nour distillation methods achieve excellent performance on data from both source\nand target domains, particularly when these two domains exhibit significant\ndissimilarity. The proposed approaches therefore can be developed and\nimplemented effectively for real-world applications such as access control,\nidentity verification, and authentication systems.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}