{"id":"2408.02125","title":"Abstraction in Neural Networks","authors":"Nancy Lynch","authorsParsed":[["Lynch","Nancy",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 19:44:57 GMT"}],"updateDate":"2024-08-06","timestamp":1722800697000,"abstract":"  We show how brain networks, modeled as Spiking Neural Networks, can be viewed\nat different levels of abstraction. Lower levels include complications such as\nfailures of neurons and edges. Higher levels are more abstract, making\nsimplifying assumptions to avoid these complications. We show precise\nrelationships between executions of networks at different levels, which enables\nus to understand the behavior of lower-level networks in terms of the behavior\nof higher-level networks.\n  We express our results using two abstract networks, A1 and A2, one to express\nfiring guarantees and the other to express non-firing guarantees, and one\ndetailed network D. The abstract networks contain reliable neurons and edges,\nwhereas the detailed network has neurons and edges that may fail, subject to\nsome constraints. Here we consider just initial stopping failures. To define\nthese networks, we begin with abstract network A1 and modify it systematically\nto obtain the other two networks. To obtain A2, we simply lower the firing\nthresholds of the neurons. To obtain D, we introduce failures of neurons and\nedges, and incorporate redundancy in the neurons and edges in order to\ncompensate for the failures. We also define corresponding inputs for the\nnetworks, and corresponding executions of the networks.\n  We prove two main theorems, one relating corresponding executions of A1 and D\nand the other relating corresponding executions of A2 and D. Together, these\ngive both firing and non-firing guarantees for the detailed network D. We also\ngive a third theorem, relating the effects of D on an external reliable\nactuator neuron to the effects of the abstract networks on the same actuator\nneuron.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Data Structures and Algorithms"],"license":"http://creativecommons.org/licenses/by/4.0/"}