{"id":"2408.08327","title":"Nanoscale Surfactant Transport: Bridging Molecular and Continuum Models","authors":"Muhammad Rizwanur Rahman, James P. Ewen, Li Shen, D. M. Heyes, Daniele\n  Dini and E. R. Smith","authorsParsed":[["Rahman","Muhammad Rizwanur",""],["Ewen","James P.",""],["Shen","Li",""],["Heyes","D. M.",""],["Dini","Daniele",""],["Smith","E. R.",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 18:23:47 GMT"}],"updateDate":"2024-08-19","timestamp":1723314227000,"abstract":"  Surfactant transport is central to a diverse range of natural phenomena, and\nfor many practical applications in physics and engineering. Surprisingly, this\nprocess remains relatively poorly understood at the molecular scale. This study\ninvestigates the mechanism behind the transport of surfactant monolayers on\nflat and curved liquid vapor interfaces using nonequilibrium molecular dynamics\nsimulations, which are compared with the continuum transport model. This\napproach not only provides fresh molecular level insight into surfactant\ndynamics, but also confirms the nanoscale mechanism of the lateral migration of\nsurfactant molecules along a thin film that continuously deforms as surfactants\nspread. By connecting the continuum model where the long wave approximations\nprevail, to the molecular details where such approximations break down, we\nestablish that the transport equation preserves substantial accuracy in\ncapturing the underlying physics. Moreover, the relative importance of the\ndifferent mechanisms of the transport process are identified. Consequently, we\nderive a novel, exact molecular equation for surfactant transport along a\ndeforming surface. Finally, our findings demonstrate that the spreading of\nsurfactants at the molecular scale adheres to expected scaling laws and aligns\nwell with experimental observations.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5CmA0FsXBS55YV6To89JyiZCAR3XHQ8u4Xiv0DQMzdk","pdfSize":"11815824"}
