{"id":"2408.04744","title":"Noise-augmented Chaotic Ising Machines for Combinatorial Optimization\n  and Sampling","authors":"Kyle Lee, Shuvro Chowdhury, Kerem Y. Camsari","authorsParsed":[["Lee","Kyle",""],["Chowdhury","Shuvro",""],["Camsari","Kerem Y.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 20:05:34 GMT"}],"updateDate":"2024-08-12","timestamp":1723147534000,"abstract":"  The rise of domain-specific computing has led to great interest in Ising\nmachines, dedicated hardware accelerators tailored to solve combinatorial\noptimization and probabilistic sampling problems. A key element of Ising\nmachines is stochasticity, which enables a wide exploration of configurations,\nthereby helping avoid local minima. Here, we evaluate and improve the\npreviously proposed concept of coupled chaotic bits (c-bits) that operate\nwithout any explicit stochasticity. We show that augmenting chaotic bits with\nstochasticity leads to better algorithmic scaling in combinatorial optimization\nproblems, comparable to the performance of probabilistic bits (p-bits) which\nhave explicit randomness in their update rules. We first demonstrate that\nc-bits surprisingly follow the quantum Boltzmann law in a 1D transverse field\nIsing model, despite the lack of explicit randomness. We then show that c-bits\nexhibit critical dynamics similar to those of stochastic p-bits in 2D Ising and\n3D spin glass models, with promising potential to solve challenging\noptimization problems. Finally, we propose a noise-augmented version of coupled\nc-bits via the powerful adaptive parallel tempering algorithm (APT). The\nnoise-augmented c-bit algorithm outperforms fully deterministic c-bits running\nversions of the simulated annealing algorithm. Chaotic Ising machines closely\nresemble coupled oscillator-based Ising machines, as both schemes exploit\nnonlinear dynamics for computation. Oscillator-based Ising machines may greatly\nbenefit from our proposed algorithm, which runs replicas at constant\ntemperature, eliminating the need to globally modulate coupling strengths.\nMixing stochasticity with deterministic c-bits creates a powerful hybrid\ncomputing scheme that can bring benefits in scaled, asynchronous, and massively\nparallel hardware implementations.\n","subjects":["Condensed Matter/Disordered Systems and Neural Networks","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DQpLGy8zp0jlkRWkp3wB2ZA2OsG9VK_9VM5UOqRb9QY","pdfSize":"7687640"}
