{"id":"2408.15989","title":"Software Solutions for Newcomers' Onboarding in Software Projects: A\n  Systematic Literature Review","authors":"Italo Santos, Katia Romero Felizardo, Marco A. Gerosa, Igor\n  Steinmacher","authorsParsed":[["Santos","Italo",""],["Felizardo","Katia Romero",""],["Gerosa","Marco A.",""],["Steinmacher","Igor",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 17:55:17 GMT"}],"updateDate":"2024-08-29","timestamp":1724867717000,"abstract":"  [Context] Newcomers joining an unfamiliar software project face numerous\nbarriers; therefore, effective onboarding is essential to help them engage with\nthe team and develop the behaviors, attitudes, and skills needed to excel in\ntheir roles. However, onboarding can be a lengthy, costly, and error-prone\nprocess. Software solutions can help mitigate these barriers and streamline the\nprocess without overloading senior members. [Objective] This study aims to\nidentify the state-of-the-art software solutions for onboarding newcomers.\n[Method] We conducted a systematic literature review (SLR) to answer six\nresearch questions. [Results] We analyzed 32 studies about software solutions\nfor onboarding newcomers and yielded several key findings: (1) a range of\nstrategies exists, with recommendation systems being the most prevalent; (2)\nmost solutions are web-based; (3) solutions target a variety of onboarding\naspects, with a focus on process; (4) many onboarding barriers remain\nunaddressed by existing solutions; (5) laboratory experiments are the most\ncommonly used method for evaluating these solutions; and (6) diversity and\ninclusion aspects primarily address experience level. [Conclusion] We shed\nlight on current technological support and identify research opportunities to\ndevelop more inclusive software solutions for onboarding. These insights may\nalso guide practitioners in refining existing platforms and onboarding programs\nto promote smoother integration of newcomers into software projects.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1AXX9_NNdMvLrfVFywnn-xjxA1WBVia8CuLH_81_4sA","pdfSize":"804126"}
