{"id":"2408.11797","title":"An Advanced Microscopic Energy Consumption Model for Automated\n  Vehicle:Development, Calibration, Verification","authors":"Ke Ma, Zhaohui Liang, Hang Zhou, Xiaopeng Li","authorsParsed":[["Ma","Ke",""],["Liang","Zhaohui",""],["Zhou","Hang",""],["Li","Xiaopeng",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 17:41:42 GMT"}],"updateDate":"2024-08-22","timestamp":1724262102000,"abstract":"  The automated vehicle (AV) equipped with the Adaptive Cruise Control (ACC)\nsystem is expected to reduce the fuel consumption for the intelligent\ntransportation system. This paper presents the Advanced ACC-Micro (AA-Micro)\nmodel, a new energy consumption model based on micro trajectory data,\ncalibrated and verified by empirical data. Utilizing a commercial AV equipped\nwith the ACC system as the test platform, experiments were conducted at the\nColumbus 151 Speedway, capturing data from multiple ACC and Human-Driven (HV)\ntest runs. The calibrated AA-Micro model integrates features from traditional\nenergy consumption models and demonstrates superior goodness of fit, achieving\nan impressive 90% accuracy in predicting ACC system energy consumption without\noverfitting. A comprehensive statistical evaluation of the AA-Micro model's\napplicability and adaptability in predicting energy consumption and vehicle\ntrajectories indicated strong model consistency and reliability for ACC\nvehicles, evidenced by minimal variance in RMSE values and uniform RSS\ndistributions. Conversely, significant discrepancies were observed when\napplying the model to HV data, underscoring the necessity for specialized\nmodels to accurately predict energy consumption for HV and ACC systems,\npotentially due to their distinct energy consumption characteristics.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"AyrsRd2KaBVKmo1DIb6N6qqTOnOUeHTiSH-_m7T1vMI","pdfSize":"981545"}
