{"id":"2408.01291","title":"TexGen: Text-Guided 3D Texture Generation with Multi-view Sampling and\n  Resampling","authors":"Dong Huo, Zixin Guo, Xinxin Zuo, Zhihao Shi, Juwei Lu, Peng Dai,\n  Songcen Xu, Li Cheng, Yee-Hong Yang","authorsParsed":[["Huo","Dong",""],["Guo","Zixin",""],["Zuo","Xinxin",""],["Shi","Zhihao",""],["Lu","Juwei",""],["Dai","Peng",""],["Xu","Songcen",""],["Cheng","Li",""],["Yang","Yee-Hong",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 14:24:40 GMT"}],"updateDate":"2024-08-05","timestamp":1722608680000,"abstract":"  Given a 3D mesh, we aim to synthesize 3D textures that correspond to\narbitrary textual descriptions. Current methods for generating and assembling\ntextures from sampled views often result in prominent seams or excessive\nsmoothing. To tackle these issues, we present TexGen, a novel multi-view\nsampling and resampling framework for texture generation leveraging a\npre-trained text-to-image diffusion model. For view consistent sampling, first\nof all we maintain a texture map in RGB space that is parameterized by the\ndenoising step and updated after each sampling step of the diffusion model to\nprogressively reduce the view discrepancy. An attention-guided multi-view\nsampling strategy is exploited to broadcast the appearance information across\nviews. To preserve texture details, we develop a noise resampling technique\nthat aids in the estimation of noise, generating inputs for subsequent\ndenoising steps, as directed by the text prompt and current texture map.\nThrough an extensive amount of qualitative and quantitative evaluations, we\ndemonstrate that our proposed method produces significantly better texture\nquality for diverse 3D objects with a high degree of view consistency and rich\nappearance details, outperforming current state-of-the-art methods.\nFurthermore, our proposed texture generation technique can also be applied to\ntexture editing while preserving the original identity. More experimental\nresults are available at https://dong-huo.github.io/TexGen/\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}