{"id":"2408.04178","title":"Real-time modelling of the SARS-CoV-2 pandemic in England 2020-2023: a\n  challenging data integration","authors":"Paul J Birrell, Joshua Blake, Joel Kandiah, Angelos Alexopoulos, Edwin\n  van Leeuwen, Koen Pouwels, Sanmitra Ghosh, Colin Starr, Ann Sarah Walker,\n  Thomas A House, Nigel Gay, Thomas Finnie, Nick Gent, Andr\\'e Charlett,\n  Daniela De Angelis","authorsParsed":[["Birrell","Paul J",""],["Blake","Joshua",""],["Kandiah","Joel",""],["Alexopoulos","Angelos",""],["van Leeuwen","Edwin",""],["Pouwels","Koen",""],["Ghosh","Sanmitra",""],["Starr","Colin",""],["Walker","Ann Sarah",""],["House","Thomas A",""],["Gay","Nigel",""],["Finnie","Thomas",""],["Gent","Nick",""],["Charlett","André",""],["De Angelis","Daniela",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 02:47:13 GMT"}],"updateDate":"2024-08-09","timestamp":1723085233000,"abstract":"  A central pillar of the UK's response to the SARS-CoV-2 pandemic was the\nprovision of up-to-the moment nowcasts and short term projections to monitor\ncurrent trends in transmission and associated healthcare burden. Here we\npresent a detailed deconstruction of one of the 'real-time' models that was key\ncontributor to this response, focussing on the model adaptations required over\nthree pandemic years characterised by the imposition of lockdowns, mass\nvaccination campaigns and the emergence of new pandemic strains. The Bayesian\nmodel integrates an array of surveillance and other data sources including a\nnovel approach to incorporating prevalence estimates from an unprecedented\nlarge-scale household survey. We present a full range of estimates of the\nepidemic history and the changing severity of the infection, quantify the\nimpact of the vaccination programme and deconstruct contributing factors to the\nreproduction number. We further investigate the sensitivity of model-derived\ninsights to the availability and timeliness of prevalence data, identifying its\nimportance to the production of robust estimates.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iSyaKZQ0lFq88r4w6L-3ECPqMEyo8t_G_0CdWApMcds","pdfSize":"6653896"}
