{"id":"2408.05016","title":"Optical observations of the Galactic SNR HB9 and H II region G159.2+3.3","authors":"Jiang-Tao Li, Li-Yuan Lu, Huiyang Mao, Zi-Qing Xia, Yang Chen, Ping\n  Zhou, and Xin Zhou","authorsParsed":[["Li","Jiang-Tao",""],["Lu","Li-Yuan",""],["Mao","Huiyang",""],["Xia","Zi-Qing",""],["Chen","Yang",""],["Zhou","Ping",""],["Zhou","Xin",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 12:03:39 GMT"}],"updateDate":"2024-08-12","timestamp":1723205019000,"abstract":"  Context. We present multi-wavelength observations of the Galactic SNR HB9 and\nthe H II region G159.2+3.3 apparently projected nearby, in order to study their\nproperties and potential physical connections. Results. HB9 is bright in\n$\\gamma$-rays, but the $\\gamma$-ray morphology is centrally filled and most of\nit is not clearly associated with the surrounding molecular clouds. There is a\nweak apparent connection of HB9 to the IR bright enclosing shell of G159.2+3.3\nin $\\gamma$-ray. The diffuse Balmer line has almost identical morphology as the\nradio emission in G159.2+3.3, indicating they two are thermal in origin. Using\nmedium-band high-resolution optical spectra from selected regions of the\nsoutheast (SE) shell of HB9 and G159.2+3.3, we found the radial velocity\ndispersion of HB9 along the slit is significantly higher than the FWHM of the\nlines. In contrast, these two values are both smaller and comparable to each\nother in G159.2+3.3. This indicates that the gas in HB9 may have additional\nglobal motion triggered by the SNR shock. The [N II] $\\lambda$6583A/H$\\alpha$\nline ratio of both objects can be interpreted with photo-ionisation by hot\nstars or low velocity shocks, except for the post-shock region in the SE shell\nof HB9, where the elevated [N II]/H$\\alpha$ line ratio suggests contribution\nfrom shock ionisation. The measured electron density from the [S II] 6716/6730\nline ratio is significantly lower in the brighter G159.2+3.3 compared to the SE\nshell of HB9. Conclusions. Our density estimate suggests that G159.2+3.3,\nalthough appearing brighter and more compact, is likely located at a much\nlarger distance than HB9, so the two objects have no physical connections,\nunless the shock compressed gas in HB9 has a significantly lower filling\nfactor.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}