{"id":"2408.11785","title":"Timeline and Boundary Guided Diffusion Network for Video Shadow\n  Detection","authors":"Haipeng Zhou, Honqiu Wang, Tian Ye, Zhaohu Xing, Jun Ma, Ping Li,\n  Qiong Wang, Lei Zhu","authorsParsed":[["Zhou","Haipeng",""],["Wang","Honqiu",""],["Ye","Tian",""],["Xing","Zhaohu",""],["Ma","Jun",""],["Li","Ping",""],["Wang","Qiong",""],["Zhu","Lei",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 17:16:21 GMT"}],"updateDate":"2024-08-22","timestamp":1724260581000,"abstract":"  Video Shadow Detection (VSD) aims to detect the shadow masks with frame\nsequence. Existing works suffer from inefficient temporal learning. Moreover,\nfew works address the VSD problem by considering the characteristic (i.e.,\nboundary) of shadow. Motivated by this, we propose a Timeline and Boundary\nGuided Diffusion (TBGDiff) network for VSD where we take account of the\npast-future temporal guidance and boundary information jointly. In detail, we\ndesign a Dual Scale Aggregation (DSA) module for better temporal understanding\nby rethinking the affinity of the long-term and short-term frames for the\nclipped video. Next, we introduce Shadow Boundary Aware Attention (SBAA) to\nutilize the edge contexts for capturing the characteristics of shadows.\nMoreover, we are the first to introduce the Diffusion model for VSD in which we\nexplore a Space-Time Encoded Embedding (STEE) to inject the temporal guidance\nfor Diffusion to conduct shadow detection. Benefiting from these designs, our\nmodel can not only capture the temporal information but also the shadow\nproperty. Extensive experiments show that the performance of our approach\novertakes the state-of-the-art methods, verifying the effectiveness of our\ncomponents. We release the codes, weights, and results at\n\\url{https://github.com/haipengzhou856/TBGDiff}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"3gDxby4EkAXRsnVxokYJy_YNKU309btYF9pPiqP84wg","pdfSize":"3066554"}
