{"id":"2408.15957","title":"Spin Excitation Continuum in the Exactly Solvable Triangular-Lattice\n  Spin Liquid CeMgAl11O19","authors":"Bin Gao, Tong Chen, Chunxiao Liu, Mason L. Klemm, Shu Zhang, Zhen Ma,\n  Xianghan Xu, Choongjae Won, Gregory T. McCandless, Naoki Murai, Seiko\n  Ohira-Kawamura, Stephen J. Moxim, Jason T. Ryan, Xiaozhou Huang, Xiaoping\n  Wang, Julia Y. Chan, Sang-Wook Cheong, Oleg Tchernyshyov, Leon Balents,\n  Pengcheng Dai","authorsParsed":[["Gao","Bin",""],["Chen","Tong",""],["Liu","Chunxiao",""],["Klemm","Mason L.",""],["Zhang","Shu",""],["Ma","Zhen",""],["Xu","Xianghan",""],["Won","Choongjae",""],["McCandless","Gregory T.",""],["Murai","Naoki",""],["Ohira-Kawamura","Seiko",""],["Moxim","Stephen J.",""],["Ryan","Jason T.",""],["Huang","Xiaozhou",""],["Wang","Xiaoping",""],["Chan","Julia Y.",""],["Cheong","Sang-Wook",""],["Tchernyshyov","Oleg",""],["Balents","Leon",""],["Dai","Pengcheng",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 17:19:48 GMT"}],"updateDate":"2024-08-29","timestamp":1724865588000,"abstract":"  In magnetically ordered insulators, elementary quasiparticles manifest as\nspin waves - collective motions of localized magnetic moments propagating\nthrough the lattice - observed via inelastic neutron scattering. In effective\nspin-1/2 systems where geometric frustrations suppress static magnetic order,\nspin excitation continua can emerge, either from degenerate classical spin\nground states or from entangled quantum spins characterized by emergent gauge\nfields and deconfined fractionalized excitations. Comparing the spin\nHamiltonian with theoretical models can unveil the microscopic origins of these\nzero-field spin excitation continua. Here, we use neutron scattering to study\nspin excitations of the two-dimensional (2D) triangular-lattice effective\nspin-1/2 antiferromagnet CeMgAl11O19. Analyzing the spin waves in the\nfield-polarized ferromagnetic state, we find that the spin Hamiltonian is close\nto an exactly solvable 2D triangular-lattice XXZ model, where degenerate\n120$^\\circ$ ordered ground states - umbrella states - develop in the zero\ntemperature limit. We then find that the observed zero-field spin excitation\ncontinuum matches the calculated ensemble of spin waves from the umbrella state\nmanifold, and thus conclude that CeMgAl11O19 is the first example of an exactly\nsolvable spin liquid on a triangular lattice where the spin excitation\ncontinuum arises from the ground state degeneracy.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/"}