{"id":"2408.09460","title":"Fine-Grained Building Function Recognition from Street-View Images via\n  Geometry-Aware Semi-Supervised Learning","authors":"Weijia Li, Jinhua Yu, Dairong Chen, Yi Lin, Runmin Dong, Xiang Zhang,\n  Conghui He, Haohuan Fu","authorsParsed":[["Li","Weijia",""],["Yu","Jinhua",""],["Chen","Dairong",""],["Lin","Yi",""],["Dong","Runmin",""],["Zhang","Xiang",""],["He","Conghui",""],["Fu","Haohuan",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 12:48:48 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 03:29:42 GMT"},{"version":"v3","created":"Mon, 9 Sep 2024 03:21:53 GMT"}],"updateDate":"2024-09-10","timestamp":1723985328000,"abstract":"  In this work, we propose a geometry-aware semi-supervised framework for\nfine-grained building function recognition, utilizing geometric relationships\namong multi-source data to enhance pseudo-label accuracy in semi-supervised\nlearning, broadening its applicability to various building function\ncategorization systems. Firstly, we design an online semi-supervised\npre-training stage, which facilitates the precise acquisition of building\nfacade location information in street-view images. In the second stage, we\npropose a geometry-aware coarse annotation generation module. This module\neffectively combines GIS data and street-view data based on the geometric\nrelationships, improving the accuracy of pseudo annotations. In the third\nstage, we combine the newly generated coarse annotations with the existing\nlabeled dataset to achieve fine-grained functional recognition of buildings\nacross multiple cities at a large scale. Extensive experiments demonstrate that\nour proposed framework exhibits superior performance in fine-grained functional\nrecognition of buildings. Within the same categorization system, it achieves\nimprovements of 7.6\\% and 4.8\\% compared to fully-supervised methods and\nstate-of-the-art semi-supervised methods, respectively. Additionally, our\nmethod also performs well in cross-city scenarios, i.e., extending the model\ntrained on OmniCity (New York) to new cities (i.e., Los Angeles and Boston)\nwith different building function categorization systems. This study offers a\nnew solution for large-scale multi-city applications with minimal annotation\nrequirements, facilitating more efficient data updates and resource allocation\nin urban management.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}