{"id":"2408.16548","title":"Impact of oxygen fugacity on atmospheric structure and emission spectra\n  of ultra hot rocky exoplanets","authors":"Fabian L. Seidler, Paolo A. Sossi, Simon L. Grimm","authorsParsed":[["Seidler","Fabian L.",""],["Sossi","Paolo A.",""],["Grimm","Simon L.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 14:10:43 GMT"}],"updateDate":"2024-08-30","timestamp":1724940643000,"abstract":"  Atmospheres above lava-ocean planets (LOPs) hold clues as to the properties\nof their interiors, owing to the expectation that the two reservoirs are in\nchemical equilibrium. Here we consider `mineral' atmospheres produced in\nequilibrium with silicate liquids. We treat oxygen fugacity ($f$O$_2$) as an\nindependent variable, together with temperature ($T$) and composition ($X$), to\ncompute equilibrium partial pressures ($p$) of stable gas species at the\nliquid-gas interface. Above this boundary, the atmospheric speciation and the\npressure-temperature structure are computed self-consistently to yield emission\nspectra. We explore a wide array of plausible compositions, oxygen fugacities\n(between 6 log$_{10}$ units below- and above the iron-w\\\"ustite buffer, IW) and\nirradiation temperatures (2000, 2500, 3000 and 3500 K) relevant to LOPs. We\nfind that SiO(g), Fe(g) and Mg(g) are the major species below $\\sim$IW, ceding\nto O$_2$(g) and O(g) in more oxidised atmospheres. The transition between the\ntwo regimes demarcates a minimum in total pressure ($P$). Because $p$ scales\nlinearly with $X$, emission spectra are only modest functions of composition.\nBy contrast, $f$O$_2$ can vary over orders of magnitude, thus causing\ncommensurate changes in $p$. Reducing atmospheres show intense SiO emission,\ncreating a temperature inversion in the upper atmosphere. Conversely, oxidised\natmospheres have lower $p$SiO and lack thermal inversions, with resulting\nemission spectra that mimic that of a black body. Consequently, the intensity\nof SiO emission relative to the background, generated by MgO(g), can be used to\nquantify the $f$O$_2$ of the atmosphere. Depending on the emission spectroscopy\nmetric of the target, deriving the $f$O$_2$ of known nearby LOPs is possible\nwith a few secondary occultations observed by JWST.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}