{"id":"2408.02536","title":"Cosmological constraints from calibrated $E_p-E_{iso}$ gamma-ray burst\n  correlation by using DESI 2024 data release","authors":"Anna Chiara Alfano, Orlando Luongo, Marco Muccino","authorsParsed":[["Alfano","Anna Chiara",""],["Luongo","Orlando",""],["Muccino","Marco",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 15:08:52 GMT"}],"updateDate":"2024-08-06","timestamp":1722870532000,"abstract":"  Recent outcomes by the DESI Collaboration have shed light on a possible\nslightly evolving dark energy, challenging the standard $\\Lambda$CDM paradigm.\nTo better understand dark energy nature, high-redshift observations like\ngamma-ray burst data become essential for mapping the universe expansion\nhistory, provided they are calibrated with other probes. To this aim, we\ncalibrate the $E_p-E_{iso}$ (or Amati) correlation through model-independent\nB\\'ezier interpolations of the updated Hubble rate and the novel DESI data\nsets. More precisely, we provide two B\\'ezier calibrations: i) handling the\nentire DESI sample, and ii) excluding the point at $z_{eff}=0.51$, criticized\nby the recent literature. In both the two options, we let the comoving sound\nhorizon at the drag epoch, $r_d$, vary in the range $r_d \\in [138, 156]$ Mpc.\nThe Planck value is also explored for comparison. By means of the so-calibrated\ngamma-ray bursts, we thus constrain three dark energy frameworks, namely the\nstandard $\\Lambda$CDM, the $\\omega_0$CDM and the $\\omega_0\\omega_1$CDM models,\nin both spatially flat and non-flat universes. To do so, we worked out Monte\nCarlo Markov chain analyses, making use of the Metropolis-Hastings algorithm.\nFurther, we adopt model selection criteria to check the statistically preferred\ncosmological model finding a preference towards the concordance paradigm only\nwhether the spatial curvature is zero. Conversely, and quite interestingly, the\nflat $\\omega_0$CDM and both the cases, flat/non-flat, $\\omega_0\\omega_1$CDM\nmodel, leave evidently open the chance that dark energy evolves at higher\nredshifts.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}