{"id":"2408.08379","title":"Towards Realistic Synthetic User-Generated Content: A Scaffolding\n  Approach to Generating Online Discussions","authors":"Krisztian Balog and John Palowitch and Barbara Ikica and Filip\n  Radlinski and Hamidreza Alvari and Mehdi Manshadi","authorsParsed":[["Balog","Krisztian",""],["Palowitch","John",""],["Ikica","Barbara",""],["Radlinski","Filip",""],["Alvari","Hamidreza",""],["Manshadi","Mehdi",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 18:43:50 GMT"}],"updateDate":"2024-08-19","timestamp":1723747430000,"abstract":"  The emergence of synthetic data represents a pivotal shift in modern machine\nlearning, offering a solution to satisfy the need for large volumes of data in\ndomains where real data is scarce, highly private, or difficult to obtain. We\ninvestigate the feasibility of creating realistic, large-scale synthetic\ndatasets of user-generated content, noting that such content is increasingly\nprevalent and a source of frequently sought information. Large language models\n(LLMs) offer a starting point for generating synthetic social media discussion\nthreads, due to their ability to produce diverse responses that typify online\ninteractions. However, as we demonstrate, straightforward application of LLMs\nyields limited success in capturing the complex structure of online\ndiscussions, and standard prompting mechanisms lack sufficient control. We\ntherefore propose a multi-step generation process, predicated on the idea of\ncreating compact representations of discussion threads, referred to as\nscaffolds. Our framework is generic yet adaptable to the unique characteristics\nof specific social media platforms. We demonstrate its feasibility using data\nfrom two distinct online discussion platforms. To address the fundamental\nchallenge of ensuring the representativeness and realism of synthetic data, we\npropose a portfolio of evaluation measures to compare various instantiations of\nour framework.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}