{"id":"2408.04669","title":"Short wavelength limit of the dynamic Matsubara local field correction","authors":"Tobias Dornheim and Panagiotis Tolias and Zhandos Moldabekov and Jan\n  Vorberger","authorsParsed":[["Dornheim","Tobias",""],["Tolias","Panagiotis",""],["Moldabekov","Zhandos",""],["Vorberger","Jan",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 08:34:18 GMT"}],"updateDate":"2024-08-12","timestamp":1723019658000,"abstract":"  We investigate the short wavelength limit of the dynamic Matsubara local\nfield correction $\\widetilde{G}(\\mathbf{q},z_l)$ of the uniform electron gas\nbased on direct \\emph{ab initio} path integral Monte Carlo (PIMC) results over\nan unprecedented range of wavenumbers, $q\\lesssim20q_\\textnormal{F}$, where\n$q_\\textnormal{F}$ is the Fermi wavenumber. We find excellent agreement with\nthe analytically derived asymptotic limit by Hou \\emph{et\nal.}~[\\textit{Phys.~Rev.~B}~\\textbf{106}, L081126 (2022)] for the static local\nfield correction and empirically confirm the independence of the short\nwavelength limit with respect to the Matsubara frequency $z_l$. In the warm\ndense matter regime, we find that the onset of the quantum tail in the static\nlocal field correction closely coincides with the onset of the algebraic tail\nin the momentum distribution function and the corresponding empirical criterion\nreported by Hunger \\emph{et al.}~[\\textit{Phys.~Rev.~E} \\textbf{103}, 053204\n(2021)]. In the strongly coupled electron liquid regime, our calculations\nreveal a more complicated non-monotonic convergence towards the $q\\to\\infty$\nlimit that is shaped by the spatial structure in the system. We expect our\nresults to be of broad interest for a number of fields including the study of\nmatter under extreme conditions, the development of improved dielectric\ntheories, and the construction of advanced exchange--correlation functionals\nfor thermal density functional theory.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Quantum Gases","Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}