{"id":"2408.02305","title":"Star Formation, Nebulae, and Active Galactic Nuclei in CLASH Brightest\n  Cluster Galaxies. I. Dependence on Core Entropy of Intracluster Medium","authors":"Arsen Levitskiy, Jeremy Lim, Youichi Ohyama, Juno Li, Megan Donahue","authorsParsed":[["Levitskiy","Arsen",""],["Lim","Jeremy",""],["Ohyama","Youichi",""],["Li","Juno",""],["Donahue","Megan",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 08:31:34 GMT"}],"updateDate":"2024-08-06","timestamp":1722846694000,"abstract":"  We set the stage for reassessing how star formation, emission-line nebulae,\nand active galactic nuclei (AGNs) in brightest cluster galaxies (BCGs) depend\non the thermodynamics of the intracluster medium (ICM). Our work is based on\nthe 25 clusters observed in the CLASH program for which the aforementioned\nattributes in their BCGs can be well scrutinized, as has the thermodynamics of\ntheir ICM. Nine of these BCGs display complex UV morphologies tracing recent\nstar formation, whereas the remaining 16 are characterized by a relatively\ncompact central UV enhancement. Here, we show definitively that three of the\nlatter BCGs also display star formation, whereas the diffuse UV of the\nremaining 13 is entirely consistent with old low-mass stars. The overall\nresults support the previously established dependence of star formation and\nnebulae in BCGs on an \"excess core entropy,\" K$_{0}$, for the ICM: all 11\nclusters with K$_{0}$ $\\leq$ 24 keV cm$^{2}$ (but only one of 14 clusters with\nK$_{0}$ $\\geq$ 42 keV cm$^{2}$) host star-forming BCGs that almost if not\nalways possess nebulae. Instead of an entropy floor, we show that K$_{0}$\nreflects the degree to which the radial entropy profile decreases inward within\n$\\sim$100 kpc rather than (except perhaps at large K$_{0}$) actually\nflattening: clusters with lower ICM entropies and hence shorter cooling times\nat their cores preferentially host BCGs displaying star formation, nebulae, and\nmore radio-luminous AGNs. Nearly all BCGs possess detectable AGNs, however,\nindicating multiple pathways for fuelling their AGNs.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"r5tkvG0BQV_WoaMZdRXj0JndBhP8bOtFQFt8Zozj9Tk","pdfSize":"7012648"}
