{"id":"2408.05734","title":"Helmholtz decompositions of horizontal structure functions including\n  components associated with cyclone-anticyclone symmetry breaking","authors":"Erik Lindborg","authorsParsed":[["Lindborg","Erik",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 09:50:10 GMT"}],"updateDate":"2024-08-13","timestamp":1723369810000,"abstract":"  In recent years, several studies have been made in which atmospheric and\noceanic data were used to decompose horizontal velocity statistics into a\nrotational component, associated with vertical vorticity, and a divergent\ncomponent, associated with horizontal divergence. Making the assumption of\nstatistical homogeneity in a horizontal plane, this can be accomplished by\nrelating the rotational and divergent components of the difference between the\nvelocities at two points to the corresponding longitudinal and transverse\ncomponents, where the longitudinal and transverse directions are parallel\nrespectively perpendicular to the line between the points. In previous studies,\nthe decomposition has most often been made under the assumption of statistical\nisotropy. Some attempts have also been made to analyse the anisotropic problem.\nWe derive the full anisotropic equations relating the rotational, divergent and\nthe rotational-divergent components of the second order structure functions to\nthe longitudinal, transverse and longitudinal-transverse components and solve\nthe equations analytically. We also derive some results for third order\nstructure functions, with special focus on the components associated with\ncyclone-anticyclone asymmetry. Based on the analysis of these components and\nresults from previous analyses of aircraft data, it is concluded that there is\nan exclusively rotational flow component that is giving rise to strong\ndominance of cyclonic motions in the upper troposphere and a strong dominance\nof anticyclonic motions in the lower stratosphere in the range of scales from\nten to one thousand km\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zSvuCfORof-8sBJOmbKEf8ciVfC_5YmV3mDhOTvYVl4","pdfSize":"244539"}
