{"id":"2408.16639","title":"Universal mechanistic rules for de novo design of enzymes","authors":"Michalis Chatzittofi, Jaime Agudo-Canalejo, Ramin Golestanian","authorsParsed":[["Chatzittofi","Michalis",""],["Agudo-Canalejo","Jaime",""],["Golestanian","Ramin",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 15:44:41 GMT"}],"updateDate":"2024-08-30","timestamp":1724946281000,"abstract":"  Enzymes are nano-scale machines that have evolved to drive chemical reactions\nout of equilibrium in the right place at the right time. Thermodynamically\nfavourable reactions such as ATP hydrolysis are used by the cell to convert\nchemical energy into useful structure, function, and mechanical work. This\nincludes the `fuelled' catalysis of chemical reactions that would otherwise be\nthermodynamically unfavourable. Given the complexity and specificity of\nenzymatic function, bottom-up design of enzymes presents a daunting task that\nis far more challenging than making passive molecules with specific binding\naffinities or building nano-scale mechanically active devices. Here, we present\na thermodynamically-consistent model for the operation of such a fuelled\nenzyme, which uses the energy from a favourable reaction to undergo\nnon-equilibrium conformational changes that in turn catalyze a chemical\nreaction on an attached substrate molecule. We show that enzymatic function can\nemerge through a bifurcation upon appropriate implementation of momentum\nconservation on the effective reaction coordinates of the low dimensional\ndescription of the enzyme, and thanks to a generically present dissipative\ncoupling. By considering the different aspects of the dynamics, such as the\ninterplay of the non-equilibrium drive and the geometry of the enzyme-substrate\ncomplex, we propose three golden rules that should be universally applicable\nfor de novo design of enzymes, as they are based on generic ingredients and\nphysical constraints. These rules lead to optimal combinations of parameters,\nwhich can vastly accelerate reactions, while at the same time decreasing the\nenergy dissipation of the combined reaction process, or, in other words, to an\nefficient enzyme. Our results can complement the recently developed strategies\nfor de novo enzyme design based on machine learning approaches.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Statistical Mechanics","Physics/Biological Physics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}