{"id":"2408.14596","title":"Achieving designed texture and flows in bulk active nematics using\n  optimal control theory","authors":"Saptorshi Ghosh, Aparna Baskaran and Michael F. Hagan","authorsParsed":[["Ghosh","Saptorshi",""],["Baskaran","Aparna",""],["Hagan","Michael F.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 19:27:04 GMT"}],"updateDate":"2024-08-28","timestamp":1724700424000,"abstract":"  Being intrinsically nonequilibrium, active materials can potentially perform\nfunctions that would be thermodynamically forbidden in passive materials.\nHowever, active systems have diverse local attractors that correspond to\ndistinct dynamical states, many of which exhibit chaotic turbulent-like\ndynamics and thus cannot perform work or useful functions. Designing such a\nsystem to choose a specific dynamical state is a formidable challenge.\nMotivated by recent advances enabling opto-genetic control of experimental\nactive materials, we describe an optimal control theory framework that\nidentifies a spatiotemporal sequence of light-generated activity that drives an\nactive nematic system toward a prescribed dynamical steady-state. Active\nnematics are unstable to spontaneous defect proliferation and chaotic streaming\ndynamics in the absence of control. We demonstrate that optimal control theory\ncan compute activity fields that redirect the dynamics into a variety of\nalternative dynamical programs and functions. This includes dynamically\nreconfiguring between states, and selecting and stabilizing emergent behaviors\nthat do not correspond to attractors, and are hence unstable in the\nuncontrolled system. Our results provide a roadmap to leverage optical control\nmethods to rationally design structure, dynamics, and function in a wide\nvariety of active materials.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"HPQIJNQ3T9zVb4PduP5oRU_qf7DBN_3TM8jRL13-iPs","pdfSize":"18169962"}
