{"id":"2408.00061","title":"The mass-metallicity relation as a ruler for galaxy evolution: insights\n  from the James Webb Space Telescope","authors":"A. Pallottini, A. Ferrara, S. Gallerani, L. Sommovigo, S. Carniani, L.\n  Vallini, M. Kohandel, G. Venturi","authorsParsed":[["Pallottini","A.",""],["Ferrara","A.",""],["Gallerani","S.",""],["Sommovigo","L.",""],["Carniani","S.",""],["Vallini","L.",""],["Kohandel","M.",""],["Venturi","G.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-08-02","timestamp":1722448800000,"abstract":"  Galaxy evolution emerges from the balance between cosmic gas accretion,\nfueling star formation, and supernova (SN) feedback, regulating the metal\nenrichment. Hence, the stellar mass ($M_*$) - gas metallicity relation (MZR) is\nkey to understand the physics of galaxies. High-quality JWST data enable\naccurate measurements of the MZR up to redshift z=10. Our aims are to\nunderstand the observed MZR, its connection with the star formation rate (SFR),\nthe role played by SFR stochasticity, and how it is regulated by SN feedback.\nWe compare the MZR from the JADES, CEERS, and UNCOVER surveys, which comprise\nabout 180 galaxies at $z=3-10$ with $10^6<M_*/M_\\odot<10^{10}$, with 200\ngalaxies from the SERRA cosmological simulations. To interpret the MZR, we\ndevelop a minimal model for galaxy evolution that includes: cosmic accretion\nmodulated with an amplitude $A_{100}$ on 100 Myr; a time delay $t_d$ between\nSFR and SN; SN-driven outflows with a varying mass loading factor\n$\\epsilon_{SN}$. Using our minimal model, we find the observed mean MZR is\nreproduced by weak outflows ($\\epsilon_{SN}=1/4$), in line with findings from\nJADES. Matching the observed MZR dispersion requires $t_d=20$ Myr and a\n$A_{100}=1/3$ modulation of the accretion rate. Successful models have low\nstochasticity ($\\sigma_{SFR}=0.2$), yielding a MZR dispersion of\n$\\sigma_{Z}=0.2$. Such values are close but lower than SERRA predictions\n($\\sigma_{SFR}=0.24$, $\\sigma_{Z}=0.3$), clarifying why SERRA show no clear MZR\ntrend and some tension with the observations. As the MZR is very sensitive to\nSFR stochasticity, models predicting high r.m.s. values ($\\sigma_{SFR}=0.5$)\nresult in a ``chemical chaos'' (i.e. $\\sigma_{Z}=1.4$), virtually destroying\nthe MZR. As a consequence, invoking a highly stochastic SFR\n($\\sigma_{SFR}=0.8$) to explain the overabundance of bright, super-early\ngalaxies leads to inconsistencies with the observed MZR.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}