{"id":"2408.15617","title":"Network Representation of Higher-Order Interactions Based on Information\n  Dynamics","authors":"Gorana Mijatovic, Yuri Antonacci, Michal Javorka, Daniele Marinazzo,\n  Sebastiano Stramaglia, Luca Faes","authorsParsed":[["Mijatovic","Gorana",""],["Antonacci","Yuri",""],["Javorka","Michal",""],["Marinazzo","Daniele",""],["Stramaglia","Sebastiano",""],["Faes","Luca",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 08:15:35 GMT"}],"updateDate":"2024-08-29","timestamp":1724832935000,"abstract":"  Many complex systems in science and engineering are modeled as networks whose\nnodes and links depict the temporal evolution of each system unit and the\ndynamic interaction between pairs of units, which are assessed respectively\nusing measures of auto- and cross-correlation or variants thereof. However, a\ngrowing body of work is documenting that this standard network representation\ncan neglect potentially crucial information shared by three or more dynamic\nprocesses in the form of higher-order interactions (HOIs). While several\nmeasures, mostly derived from information theory, are available to assess HOIs\nin network systems mapped by multivariate time series, none of them is able to\nprovide a compact and detailed representation of higher-order\ninterdependencies. In this work, we fill this gap by introducing a framework\nfor the assessment of HOIs in dynamic network systems at different levels of\nresolution. The framework is grounded on the dynamic implementation of the\nO-information, a new measure assessing HOIs in dynamic networks, which is here\nused together with its local counterpart and its gradient to quantify HOIs\nrespectively for the network as a whole, for each link, and for each node. The\nintegration of these measures into the conventional network representation\nresults in a tool for the representation of HOIs as networks, which is defined\nformally using measures of information dynamics, implemented in its linear\nversion by using vector regression models and statistical validation\ntechniques, illustrated in simulated network systems, and finally applied to an\nillustrative example in the field of network physiology.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hyOCazw-1nnmi4sNBFbwENRxHkjqVfkymZ5rPpkHVZ8","pdfSize":"990728"}
