{"id":"2408.09604","title":"Circuit design in biology and machine learning. I. Random networks and\n  dimensional reduction","authors":"Steven A. Frank","authorsParsed":[["Frank","Steven A.",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 22:11:24 GMT"}],"updateDate":"2024-08-20","timestamp":1724019084000,"abstract":"  A biological circuit is a neural or biochemical cascade, taking inputs and\nproducing outputs. How have biological circuits learned to solve environmental\nchallenges over the history of life? The answer certainly follows Dobzhansky's\nfamous quote that ``nothing in biology makes sense except in the light of\nevolution.'' But that quote leaves out the mechanistic basis by which natural\nselection's trial-and-error learning happens, which is exactly what we have to\nunderstand. How does the learning process that designs biological circuits\nactually work? How much insight can we gain about the form and function of\nbiological circuits by studying the processes that have made those circuits?\nBecause life's circuits must often solve the same problems as those faced by\nmachine learning, such as environmental tracking, homeostatic control,\ndimensional reduction, or classification, we can begin by considering how\nmachine learning designs computational circuits to solve problems. We can then\nask: How much insight do those computational circuits provide about the design\nof biological circuits? How much does biology differ from computers in the\nparticular circuit designs that it uses to solve problems? This article steps\nthrough two classic machine learning models to set the foundation for analyzing\nbroad questions about the design of biological circuits. One insight is the\nsurprising power of randomly connected networks. Another is the central role of\ninternal models of the environment embedded within biological circuits,\nillustrated by a model of dimensional reduction and trend prediction. Overall,\nmany challenges in biology have machine learning analogs, suggesting hypotheses\nabout how biology's circuits are designed.\n","subjects":["Quantitative Biology/Populations and Evolution","Computing Research Repository/Machine Learning","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZZoKToIQ5a8OOQS0QNHulnDTT8fJHO4qsWqJRVSLCgA","pdfSize":"742067"}
