{"id":"2408.01970","title":"SR-CIS: Self-Reflective Incremental System with Decoupled Memory and\n  Reasoning","authors":"Biqing Qi, Junqi Gao, Xinquan Chen, Dong Li, Weinan Zhang, Bowen Zhou","authorsParsed":[["Qi","Biqing",""],["Gao","Junqi",""],["Chen","Xinquan",""],["Li","Dong",""],["Zhang","Weinan",""],["Zhou","Bowen",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 09:09:35 GMT"}],"updateDate":"2024-08-06","timestamp":1722762575000,"abstract":"  The ability of humans to rapidly learn new knowledge while retaining old\nmemories poses a significant challenge for current deep learning models. To\nhandle this challenge, we draw inspiration from human memory and learning\nmechanisms and propose the Self-Reflective Complementary Incremental System\n(SR-CIS). Comprising the deconstructed Complementary Inference Module (CIM) and\nComplementary Memory Module (CMM), SR-CIS features a small model for fast\ninference and a large model for slow deliberation in CIM, enabled by the\nConfidence-Aware Online Anomaly Detection (CA-OAD) mechanism for efficient\ncollaboration. CMM consists of task-specific Short-Term Memory (STM) region and\na universal Long-Term Memory (LTM) region. By setting task-specific Low-Rank\nAdaptive (LoRA) and corresponding prototype weights and biases, it instantiates\nexternal storage for parameter and representation memory, thus deconstructing\nthe memory module from the inference module. By storing textual descriptions of\nimages during training and combining them with the Scenario Replay Module (SRM)\npost-training for memory combination, along with periodic short-to-long-term\nmemory restructuring, SR-CIS achieves stable incremental memory with limited\nstorage requirements. Balancing model plasticity and memory stability under\nconstraints of limited storage and low data resources, SR-CIS surpasses\nexisting competitive baselines on multiple standard and few-shot incremental\nlearning benchmarks.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"C8slDAngeRubdhbhRV07ZcsK5A-uf8TWrF6MWVQTCp8","pdfSize":"1950916","txDigest":"3FjZ1Rw3Yud8XK5PNXTCL5a8LE2ucS5mwKwpqyqLBwPM","endEpoch":"1","status":"CERTIFIED"}
