{"id":"2408.07872","title":"Autonomous on-Demand Shuttles for First Mile-Last Mile Connectivity:\n  Design, Optimization, and Impact Assessment","authors":"Sudipta Roy, Gabriel Dadashev, Lampros Yfantis, Bat-hen Nahmias-Biran,\n  Samiul Hasan","authorsParsed":[["Roy","Sudipta",""],["Dadashev","Gabriel",""],["Yfantis","Lampros",""],["Nahmias-Biran","Bat-hen",""],["Hasan","Samiul",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 00:58:27 GMT"}],"updateDate":"2024-08-16","timestamp":1723683507000,"abstract":"  The First-Mile Last-Mile (FMLM) connectivity is crucial for improving public\ntransit accessibility and efficiency, particularly in sprawling suburban\nregions where traditional fixed-route transit systems are often inadequate.\nAutonomous on-Demand Shuttles (AODS) hold a promising option for FMLM\nconnections due to their cost-effectiveness and improved safety features,\nthereby enhancing user convenience and reducing reliance on personal vehicles.\nA critical issue in AODS service design is the optimization of travel paths,\nfor which realistic traffic network assignment combined with optimal routing\noffers a viable solution. In this study, we have designed an AODS controller\nthat integrates a mesoscopic simulation-based dynamic traffic assignment model\nwith a greedy insertion heuristics approach to optimize the travel routes of\nthe shuttles. The controller also considers the charging\ninfrastructure/strategies and the impact of the shuttles on regular traffic\nflow for routes and fleet-size planning. The controller is implemented in\nAimsun traffic simulator considering Lake Nona in Orlando, Florida as a case\nstudy. We show that, under the present demand based on 1% of total trips as\ntransit riders, a fleet of 3 autonomous shuttles can serve about 80% of FMLM\ntrip requests on-demand basis with an average waiting time below 4 minutes.\nAdditional power sources have significant effect on service quality as the\ninactive waiting time for charging would increase the fleet size. We also show\nthat low-speed autonomous shuttles would have negligible impact on regular\nvehicle flow, making them suitable for suburban areas. These findings have\nimportant implications for sustainable urban planning and public transit\noperations.\n","subjects":["Computing Research Repository/Robotics","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"xV1rFw5WmTvBdqjwHcF9cMPYkmwDrxRtxZIOLkrLZnE","pdfSize":"1598157"}
