{"id":"2408.15681","title":"Towards a Unified Benchmark and Framework for Deep Learning-Based\n  Prediction of Nuclear Magnetic Resonance Chemical Shifts","authors":"Fanjie Xu, Wentao Guo, Feng Wang, Lin Yao, Hongshuai Wang, Fujie Tang,\n  Zhifeng Gao, Linfeng Zhang, Weinan E, Zhong-Qun Tian, Jun Cheng","authorsParsed":[["Xu","Fanjie",""],["Guo","Wentao",""],["Wang","Feng",""],["Yao","Lin",""],["Wang","Hongshuai",""],["Tang","Fujie",""],["Gao","Zhifeng",""],["Zhang","Linfeng",""],["E","Weinan",""],["Tian","Zhong-Qun",""],["Cheng","Jun",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 10:11:00 GMT"}],"updateDate":"2024-08-29","timestamp":1724839860000,"abstract":"  The study of structure-spectrum relationships is essential for spectral\ninterpretation, impacting structural elucidation and material design.\nPredicting spectra from molecular structures is challenging due to their\ncomplex relationships. Herein, we introduce NMRNet, a deep learning framework\nusing the SE(3) Transformer for atomic environment modeling, following a\npre-training and fine-tuning paradigm. To support the evaluation of NMR\nchemical shift prediction models, we have established a comprehensive benchmark\nbased on previous research and databases, covering diverse chemical systems.\nApplying NMRNet to these benchmark datasets, we achieve state-of-the-art\nperformance in both liquid-state and solid-state NMR datasets, demonstrating\nits robustness and practical utility in real-world scenarios. This marks the\nfirst integration of solid and liquid state NMR within a unified model\narchitecture, highlighting the need for domainspecific handling of different\natomic environments. Our work sets a new standard for NMR prediction, advancing\ndeep learning applications in analytical and structural chemistry.\n","subjects":["Physics/Computational Physics","Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Materials Science","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}