{"id":"2408.06511","title":"Modeling and Simulation of Traffic on I-485 via Linear Systems and\n  Iterative Methods","authors":"Dominic Kealoha, Fabiola Rojas, Xingjie Li","authorsParsed":[["Kealoha","Dominic",""],["Rojas","Fabiola",""],["Li","Xingjie",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 22:01:23 GMT"}],"updateDate":"2024-08-14","timestamp":1723500083000,"abstract":"  Iterative methods such as Jacobi, Gauss-Seidel, and Successive\nOver-Relaxation (SOR) are fundamental tools in solving large systems of linear\nequations across various scientific fields, particularly in the field of data\nscience which has become increasingly relevant in the past decade. Iterative\nmethods' use of matrix multiplication rather than matrix inverses makes them\nideal for solving large systems quickly. Our research explores the factors of\neach method that define their respective strengths, limitations, and\nconvergence behaviors to understand how these methods address drawbacks\nencountered when performing matrix operations by hand, as well as how they can\nbe used in real world applications. After implementing each method by hand to\nunderstand how the algorithms work, we developed a Python program that assesses\na user-given matrix based on each method's specific convergence criteria. The\nprogram compares the spectral radii of all three methods and chooses to execute\nwhichever will yield the fastest convergence rate. Our research revealed the\nimportance of mathematical modeling and understanding specific properties of\nthe coefficient matrix. We observed that Gauss-Seidel is usually the most\nefficient method because it is faster than Jacobi and doesn't have as strict\nrequirements as SOR, however SOR is ideal in terms of computation speed. We\napplied the knowledge we gained to create a traffic flow model of the I-485\nhighway in Charlotte. After creating a program that generates the matrix for\nthis model, we were able to iteratively approximate the flow of cars through\nneighboring exits using data from the N.C. Department of Transportation. This\ninformation identifies which areas are the most congested and can be used to\ninform future infrastructure development.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}