{"id":"2408.16538","title":"On the Schwinger effect during axion inflation","authors":"Richard von Eckardstein and Kai Schmitz and Oleksandr Sobol","authorsParsed":[["von Eckardstein","Richard",""],["Schmitz","Kai",""],["Sobol","Oleksandr",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 13:53:16 GMT"}],"updateDate":"2024-08-30","timestamp":1724939596000,"abstract":"  Pair-creation of charged particles in a strong gauge-field background - the\nrenowned Schwinger effect - can strongly alter the efficiency of gauge-field\nproduction during axion inflation. It is therefore crucial to have a clear\nunderstanding and proper description of this phenomenon to obtain reliable\npredictions for the physical observables in this model. In the present work, we\nrevisit the problem of Schwinger pair-production during axion inflation in the\npresence of both electric and magnetic fields and improve on the state of the\nart in two ways: (i) taking into account that the electric- and magnetic-field\nthree-vectors are in general noncollinear, we derive the vector decomposition\nof the Schwinger-induced current in terms of these fields and determine the\ncorresponding effective electric and magnetic conductivities; (ii) by\nidentifying the physical momentum scale associated with the pair-creation\nprocess, we incorporate Schwinger damping of the gauge field in a\nscale-dependent fashion in the relevant equations of motion. Implementing this\nnew description in the framework of the gradient-expansion formalism, we obtain\nnumerical results in a benchmark scenario of axion inflation and perform a\ncomprehensive comparison with earlier results in the literature. In some cases,\nthe resulting energy densities of the produced gauge fields differ from the old\nresults by more than one order of magnitude, which reflects the importance of\ntaking the new effects into account.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}