{"id":"2408.11765","title":"Unraveling the dynamical behaviors in a quasiperiodic mosaic lattice","authors":"Yu Zhang, Chenguang Liang and Shu Chen","authorsParsed":[["Zhang","Yu",""],["Liang","Chenguang",""],["Chen","Shu",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 16:39:35 GMT"}],"updateDate":"2024-08-22","timestamp":1724258375000,"abstract":"  Quasiperiodic mosaic systems have attracted significant attention due to\ntheir unique spectral properties with exactly known mobility edges, which do\nnot vanish even in the large quasiperiodic potential strength region, although\nthe width of energy window of extended states becomes very narrow and decreases\nwith the increase of strength of the quasiperiodic potential.In this work we\nstudy the dynamics of a quasiperiodic mosaic lattice and unravel its peculiar\ndynamical properties. By scrutinizing the expansion dynamics of wave packet and\nthe evolution of density distribution, we unveil that the long-time density\ndistribution display obviously different behaviors at odd and even sites in the\nlarge quasiperiodic potential strength region. Particularly, the time scale of\ndynamics exhibits an inverse relationship with the quasiperiodic potential\nstrength. To understand these behaviors, we derive an effective Hamiltonian in\nthe large quasiperiodic potential strength region, which is composed of\ndecoupled Hamiltonians defined on the odd and even sites, respectively. While\nall eigenstates of the effective Hamiltonian defined on even sites are\nlocalized, the eigenstates of effective Hamiltonian defined on odd sites\ninclude both localized and extended eigenstates. Our results demonstrate that\nthe effective Hamiltonian can describe the dynamical behaviors well in the\nlarge quasiperiodic potential strength region and provides an intuitive\nframework for understanding the peculiar dynamical behaviors in the\nquasiperiodic mosaic lattice.\n","subjects":["Condensed Matter/Disordered Systems and Neural Networks","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}