{"id":"2408.02431","title":"Moire exciton polaritons in twisted photonic lattices at room\n  temperature","authors":"Chunzi Xing, Yu Wang, Tobias Schneider, Xiaokun Zhai, Xinzheng Zhang,\n  Zhenyu Xiong, Hao Wu, Yuan Ren, Haitao Dai, Xiao Wang, Anlian Pan, Stefan\n  Schumacher, Xuekai Ma, and Tingge Gao","authorsParsed":[["Xing","Chunzi",""],["Wang","Yu",""],["Schneider","Tobias",""],["Zhai","Xiaokun",""],["Zhang","Xinzheng",""],["Xiong","Zhenyu",""],["Wu","Hao",""],["Ren","Yuan",""],["Dai","Haitao",""],["Wang","Xiao",""],["Pan","Anlian",""],["Schumacher","Stefan",""],["Ma","Xuekai",""],["Gao","Tingge",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 12:38:57 GMT"}],"updateDate":"2024-08-06","timestamp":1722861537000,"abstract":"  Moire lattices attract intensive attention in the double graphene/TMD layers\nand photonic crystals due to the interesting exotic physics within these\nstructures. However, precise measurement of the moir'e ground states, excited\nstates and Bloch bands in the twisted photonic lattices is still illusive. In\nthis work we report the strong coupling between the excitons of CsPbBr3\nmicroplates and the photonic modes of the moire lattice at room temperature.\nDepending on the coupling strength between the nearest potential sites, we\nobserve staggered moire polariton ground states, excited states trapped in the\npotential sites and moire polariton bands across the twisted photonic lattice.\nIn addition, the phase locking of moire zero (stable in-phase) states and moire\npi (metastable antiphase) states with different spatial distributions are\nmeasured. Moir'e polariton distribution can be tuned in the shape of\nparallelogram by controlling the depth and width of the potential in one\nphotonic lattice with another one fixed. Our work lays the foundation to study\nmoir'e exciton polariton Wigner crystals and Luttinger liquid in twisted\nphotonic lattices at room temperature.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}