{"id":"2408.15430","title":"High-granularity Dual-readout Calorimeter: Evolution of a Classic\n  Prototype","authors":"N. Akchurin, J. Cash, J. Damgov, X. Delashaw, K. Lamichhane, M.\n  Harris, M. Kelley, S. Kunori, H. Mergate-Cacace, T. Peltola, O. Schneider, J.\n  Sewell","authorsParsed":[["Akchurin","N.",""],["Cash","J.",""],["Damgov","J.",""],["Delashaw","X.",""],["Lamichhane","K.",""],["Harris","M.",""],["Kelley","M.",""],["Kunori","S.",""],["Mergate-Cacace","H.",""],["Peltola","T.",""],["Schneider","O.",""],["Sewell","J.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 22:11:06 GMT"}],"updateDate":"2024-08-29","timestamp":1724796666000,"abstract":"  The original dual-readout calorimeter prototype (DREAM), constructed two\ndecades ago, has proven instrumental in advancing our understanding of\ncalorimetry. It has facilitated a multitude of breakthroughs by leveraging\nsignals from complementary media (Cherenkov and scintillation) to capture\nfluctuations in electromagnetic energy fraction within hadronic showers. Over\nthe years, extensive studies have shed light on the performance characteristics\nof this module, rendering it exceptionally well-understood. Drawing on this\nwealth of experience, we have embarked on enhancing the detectors' capabilities\nfurther by integrating fast silicon photomultipliers (SiPMs) with finer\ntransverse segmentation, $\\sim$1 cm$^2$, as well as longitudinal segmentation\nby timing measuring better than 10 cm. This configuration will allow us to\nimage hadronic showers with high granularity (HG-DREAM). We argue that the\nspatial information provided by such a granular detector in a short time window\n($\\approx$5 ns) leads to substantial enhancement in energy resolution when\nadvanced neural networks are employed in energy reconstruction. We briefly\npresent the current status of work, new concepts that have been introduced to\nthe detector, and expectations from simulations.\n","subjects":["Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1ka4t5cGM0SBvHjZyPRu4era7jgaJrLJyU87EOig5WM","pdfSize":"1873656"}
