{"id":"2408.08621","title":"Optimal Linear Precoding Under Realistic Satellite Communications\n  Scenarios","authors":"Geoffrey Eappen, Jorge Luis Gonzalez, Vibhum Singh, Rakesh Palisetty,\n  Alireza Haqiqtnejad, Liz Martinez Marrero, Jevgenij Krivochiza, Jorge Querol,\n  Nicola Maturo, Juan Carlos Merlano Duncan, Eva Lagunas, Stefano Andrenacci,\n  and Symeon Chatzinotas","authorsParsed":[["Eappen","Geoffrey",""],["Gonzalez","Jorge Luis",""],["Singh","Vibhum",""],["Palisetty","Rakesh",""],["Haqiqtnejad","Alireza",""],["Marrero","Liz Martinez",""],["Krivochiza","Jevgenij",""],["Querol","Jorge",""],["Maturo","Nicola",""],["Duncan","Juan Carlos Merlano",""],["Lagunas","Eva",""],["Andrenacci","Stefano",""],["Chatzinotas","Symeon",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 09:23:53 GMT"}],"updateDate":"2024-08-19","timestamp":1723800233000,"abstract":"  In this paper, optimal linear precoding for the multibeam geostationary earth\norbit (GEO) satellite with the multi-user (MU) multiple-input-multiple-output\n(MIMO) downlink scenario is addressed. Multiple-user interference is one of the\nmajor issues faced by the satellites serving the multiple users operating at\nthe common time-frequency resource block in the downlink channel. To mitigate\nthis issue, the optimal linear precoders are implemented at the gateways (GWs).\nThe precoding computation is performed by utilizing the channel state\ninformation obtained at user terminals (UTs). The optimal linear precoders are\nderived considering beamformer update and power control with an iterative\nper-antenna power optimization algorithm with a limited required number of\niterations. The efficacy of the proposed algorithm is validated using the\nIn-Lab experiment for 16X16 precoding with multi-beam satellite for\ntransmitting and receiving the precoded data with digital video broadcasting\nsatellite-second generation extension (DVB- S2X) standard for the GW and the\nUTs. The software defined radio platforms are employed for emulating the GWs,\nUTs, and satellite links. The validation is supported by comparing the proposed\noptimal linear precoder with full frequency reuse (FFR), and minimum mean\nsquare error (MMSE) schemes. The experimental results demonstrate that with the\noptimal linear precoders it is possible to successfully cancel the inter-user\ninterference in the simulated satellite FFR link. Thus, optimal linear\nprecoding brings gains in terms of enhanced signal-to-noise-and-interference\nratio, and increased system throughput and spectral efficiency.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}