{"id":"2408.14032","title":"More Pictures Say More: Visual Intersection Network for Open Set Object\n  Detection","authors":"Bingcheng Dong, Yuning Ding, Jinrong Zhang, Sifan Zhang, Shenglan Liu","authorsParsed":[["Dong","Bingcheng",""],["Ding","Yuning",""],["Zhang","Jinrong",""],["Zhang","Sifan",""],["Liu","Shenglan",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 05:52:35 GMT"}],"updateDate":"2024-08-27","timestamp":1724651555000,"abstract":"  Open Set Object Detection has seen rapid development recently, but it\ncontinues to pose significant challenges. Language-based methods, grappling\nwith the substantial modal disparity between textual and visual modalities,\nrequire extensive computational resources to bridge this gap. Although\nintegrating visual prompts into these frameworks shows promise for enhancing\nperformance, it always comes with constraints related to textual semantics. In\ncontrast, viusal-only methods suffer from the low-quality fusion of multiple\nvisual prompts. In response, we introduce a strong DETR-based model, Visual\nIntersection Network for Open Set Object Detection (VINO), which constructs a\nmulti-image visual bank to preserve the semantic intersections of each category\nacross all time steps. Our innovative multi-image visual updating mechanism\nlearns to identify the semantic intersections from various visual prompts,\nenabling the flexible incorporation of new information and continuous\noptimization of feature representations. Our approach guarantees a more precise\nalignment between target category semantics and region semantics, while\nsignificantly reducing pre-training time and resource demands compared to\nlanguage-based methods. Furthermore, the integration of a segmentation head\nillustrates the broad applicability of visual intersection in various visual\ntasks. VINO, which requires only 7 RTX4090 GPU days to complete one epoch on\nthe Objects365v1 dataset, achieves competitive performance on par with\nvision-language models on benchmarks such as LVIS and ODinW35.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}