{"id":"2408.09470","title":"Rapid quench annealing of Er implanted Si for quantum networking\n  applications","authors":"Mark A. Hughes, Huan Liu, Adam Brookfield, Tianrui Wang, Iain F.\n  Crowe, Yaping Dan","authorsParsed":[["Hughes","Mark A.",""],["Liu","Huan",""],["Brookfield","Adam",""],["Wang","Tianrui",""],["Crowe","Iain F.",""],["Dan","Yaping",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 13:34:36 GMT"}],"updateDate":"2024-08-20","timestamp":1723988076000,"abstract":"  Erbium implanted silicon (Er:Si) is a promising platform for quantum\nnetworking applications, but a major obstacle is the formation of multiple Er\ncentres. We show that the previously identified cubic centre (Er-C) has C2v or\nlower symmetry. Using crystal field analysis of Er-C and other Er centres, and\nby comparison with extended X-ray absorption fine structure (EXAFS)\nmeasurements, we show that Er centres can be arranged in a sequence, ranging\nfrom entirely Si coordinated, through mixed Si and oxygen (O) coordination, to\nentirely O coordinated. G-factors calculated from our crystal field fitting\nclosely match those determined by Zeeman splitting and electron paramagnetic\nresonance (EPR) measurements. We co-implanted Si with Er and O (each to a\nconcentration of 1019 cm-3). By increasing the quenching rate of the subsequent\nthermal anneal from ~100 {\\deg}C/s to ~1000 {\\deg}C/s, we change the dominant\noptically active centre, formed from Er2O3 clusters to the less energetically\nfavourable Er-C centre with mixed Si and O coordination. Temperature dependent\nphotoluminescence (PL) shows that Er2O3 clusters and Er-C centres have an\nO-related defect state at ~200 and 90 meV above the 4I13/2 Er manifold,\nrespectively. PL lifetime measurements show that the Er2O3 clusters and Er-C\ncentres fall into two or three classes, characterised by different\nnon-radiative PL decay rates. Our high quench rate annealing process could\nfacilitate the formation of a single, optically active Er centre, which is\npreferable for quantum networking applications of Er:Si.\n","subjects":["Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"H6nllj-GG4vnenD_7Mycuq57FdB--t4ME9-mQcwIdnI","pdfSize":"972131"}
