{"id":"2408.16828","title":"A neural network emulator of the Advanced LIGO and Advanced Virgo\n  selection function","authors":"Thomas A. Callister, Reed Essick, Daniel E. Holz","authorsParsed":[["Callister","Thomas A.",""],["Essick","Reed",""],["Holz","Daniel E.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:00:04 GMT"}],"updateDate":"2024-09-02","timestamp":1724954404000,"abstract":"  Characterization of search selection effects comprises a core element of\ngravitational-wave data analysis. Knowledge of selection effects is needed to\npredict observational prospects for future surveys and is essential in the\nstatistical inference of astrophysical source populations from observed\ncatalogs of compact binary mergers. Although gravitational-wave selection\nfunctions can be directly measured via injection campaigns -- the insertion and\nattempted recovery of simulated signals added to real instrumental data -- such\nefforts are computationally expensive. Moreover, the inability to interpolate\nbetween discrete injections limits the ability to which we can study narrow or\ndiscontinuous features in the compact binary population. For this reason, there\nis a growing need for alternative representations of gravitational-wave\nselection functions that are computationally cheap to evaluate and can be\ncomputed across a continuous range of compact binary parameters. In this paper,\nwe describe one such representation. Using pipeline injections performed during\nAdvanced LIGO & Advanced Virgo's third observing run (O3), we train a neural\nnetwork emulator for $P(\\mathrm{det}|\\theta)$, the probability that given a\ncompact binary with parameters is successfully detected, averaged over the\ncourse of O3. The emulator captures the dependence of $P(\\mathrm{det}|\\theta)$\non binary masses, spins, distance, sky position, and orbital orientation, and\nit is valid for compact binaries with components masses between\n$1$--$100\\,M_\\odot$. We test the emulator's ability to produce accurate\ndistributions of detectable events, and demonstrate its use in hierarchical\ninference of the binary black hole population.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}