{"id":"2408.03662","title":"Molecular dynamics characterization of the free and encapsidated RNA2 of\n  CCMV with the oxRNA model","authors":"Giovanni Mattiotti, Manuel Micheloni, Lorenzo Petrolli, Luca Tubiana,\n  Samuela Pasquali, Raffaello Potestio","authorsParsed":[["Mattiotti","Giovanni",""],["Micheloni","Manuel",""],["Petrolli","Lorenzo",""],["Tubiana","Luca",""],["Pasquali","Samuela",""],["Potestio","Raffaello",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 10:03:54 GMT"}],"updateDate":"2024-08-08","timestamp":1723025034000,"abstract":"  The cowpea chlorotic mottle virus (CCMV) has emerged as an exemplary model\nsystem to assess the balance between electrostatic and topological features of\nssRNA viruses, specifically in the context of the viral self-assembly process.\nYet, in spite of its biophysical significance, little structural data of the\nRNA content of the CCMV virion is currently available. Here, the conformational\ndynamics of the RNA2 fragment of CCMV was assessed via coarse-grained molecular\ndynamics simulations, employing the oxRNA2 model. The behavior of RNA2 has been\ncharacterized both as a freely-folding molecule and within a mean-field\ndepiction of a CCMV-like capsid. For the latter, a multi-scale approach was\nemployed, to derive a radial potential profile of the viral cavity, from\natomistic structures of the CCMV capsid in solution. The conformational\nensembles of the encapsidated RNA2 were significantly altered with respect to\nthe freely-folding counterparts, as shown by the emergence of long-range motifs\nand pseudoknots in the former case. Finally, the role of the N-terminal tails\nof the CCMV subunits (and ionic shells thereof) is highlighted as a critical\nfeature in the construction of a proper electrostatic model of the CCMV capsid.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"X5kJVQyQ-iiQf7N2IaSj3Pm-yCZwJWWySUvFu6X5g4A","pdfSize":"16818058"}
