{"id":"2408.03899","title":"Simplifying Scholarly Abstracts for Accessible Digital Libraries","authors":"Haining Wang and Jason Clark","authorsParsed":[["Wang","Haining",""],["Clark","Jason",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 16:55:00 GMT"}],"updateDate":"2024-08-08","timestamp":1723049700000,"abstract":"  Standing at the forefront of knowledge dissemination, digital libraries\ncurate vast collections of scientific literature. However, these scholarly\nwritings are often laden with jargon and tailored for domain experts rather\nthan the general public. As librarians, we strive to offer services to a\ndiverse audience, including those with lower reading levels. To extend our\nservices beyond mere access, we propose fine-tuning a language model to rewrite\nscholarly abstracts into more comprehensible versions, thereby making scholarly\nliterature more accessible when requested. We began by introducing a corpus\nspecifically designed for training models to simplify scholarly abstracts. This\ncorpus consists of over three thousand pairs of abstracts and significance\nstatements from diverse disciplines. We then fine-tuned four language models\nusing this corpus. The outputs from the models were subsequently examined both\nquantitatively for accessibility and semantic coherence, and qualitatively for\nlanguage quality, faithfulness, and completeness. Our findings show that the\nresulting models can improve readability by over three grade levels, while\nmaintaining fidelity to the original content. Although commercial\nstate-of-the-art models still hold an edge, our models are much more compact,\ncan be deployed locally in an affordable manner, and alleviate the privacy\nconcerns associated with using commercial models. We envision this work as a\nstep toward more inclusive and accessible libraries, improving our services for\nyoung readers and those without a college degree.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society","Computing Research Repository/Digital Libraries"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"REaXvhQX7xrB2BCS3KfG85EeAIxQ4vcSiowMnIQGfts","pdfSize":"4187641"}
