{"id":"2408.00066","title":"Persistent Topological Negativity in a High-Temperature Mixed-State","authors":"Yonna Kim, Ali Lavasani, Sagar Vijay","authorsParsed":[["Kim","Yonna",""],["Lavasani","Ali",""],["Vijay","Sagar",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-08-02","timestamp":1722448800000,"abstract":"  We study the entanglement structure of the Greenberger-Horne-Zeilinger (GHZ)\nstate as it thermalizes under a strongly-symmetric quantum channel describing\nthe Metropolis-Hastings dynamics for the $d$-dimensional classical Ising model\nat inverse temperature $\\beta$. This channel outputs the classical Gibbs state\nwhen acting on a product state in the computational basis. When applying this\nchannel to a GHZ state in spatial dimension $d>1$, the resulting mixed state\nchanges character at the Ising phase transition temperature from being\nlong-range entangled to short-range-entangled as temperature increases.\nNevertheless, we show that the topological entanglement negativity of a large\nregion is insensitive to this transition and takes the same value as that of\nthe pure GHZ state at any finite temperature $\\beta>0$. We establish this\nresult by devising a local operations and classical communication (LOCC)\n``decoder\" that provides matching lower and upper bounds on the negativity in\nthe thermodynamic limit which may be of independent interest. This perspective\nconnects the negativity to an error-correction problem on the\n$(d-1)$-dimensional bipartitioning surface and explains the persistent\nnegativity in certain correlated noise models found in previous studies.\nNumerical results confirm our analysis.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Statistical Mechanics","Condensed Matter/Strongly Correlated Electrons","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FBSorzmqixO907S7MKC3QkxDlaO1dIyq0Yj2Xfb2BJA","pdfSize":"1536161","txDigest":"4gDfDyu8f6gRs3tdXpvnvFp4LXcV9LyXCUdPqCFPTfQ7","endEpoch":"100","status":"CERTIFIED"}
