{"id":"2408.08951","title":"Cosmological Quasiparticles and the Cosmological Collider","authors":"Jay Hubisz, Seung J. Lee, He Li, Bharath Sambasivam","authorsParsed":[["Hubisz","Jay",""],["Lee","Seung J.",""],["Li","He",""],["Sambasivam","Bharath",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-20","timestamp":1723831201000,"abstract":"  The interplay between cosmology and strongly coupled dynamics can yield\ntransient spectral features that vanish at late times, but which may leave\nbehind phenomenological signatures in the spectrum of primordial fluctuations.\nOf particular interest are strongly coupled extensions of the standard model\nfeaturing approximate conformal invariance. In flat space, the spectral density\nfor a scalar operator in a conformal field theory is characterized by a\ncontinuum with scaling law governed by the dimension of the operator, and is\notherwise featureless. AdS/CFT arguments suggest that for large $N$, in an\ninflationary background with Hubble rate $H$, this continuum is gapped. We\ndemonstrate that there can be additional peak structures that become sharp and\nparticle-like at phenomenologically interesting regions in parameter space, and\nwe estimate their contribution to cosmological observables. We find phenomena\nthat are potentially observable in future experiments that are unique to these\nmodels, including displaced oscillatory features in the squeezed limit of the\nbi-spectrum. These particles can be either fundamental, and localized to a UV\nbrane, or composite at the Hubble scale, $H$, and bound to a horizon in the\nbulk of the 5D geometry. We comment on how stabilization of conformal symmetry\nbreaking vacua can be correlated with these spectral features and their\nphenomenology.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"T3BUJdGAPWMUN6PwpHSKEREhPpBKIeytUSQerv_M__A","pdfSize":"1888337"}
