{"id":"2408.03670","title":"Information theoretic measures for Lifshitz system","authors":"Souvik Paul, Anirban Roy Chowdhury, Ashis Saha, Sunandan Gangopadhyay","authorsParsed":[["Paul","Souvik",""],["Chowdhury","Anirban Roy",""],["Saha","Ashis",""],["Gangopadhyay","Sunandan",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 10:25:30 GMT"}],"updateDate":"2024-08-08","timestamp":1723026330000,"abstract":"  In this work, we have studied various mixed state information theoretic\nquantities for an excited state of Lifshitz spacetime in $3+1$-dimensions. This\ngeometry is the gravity dual to a class of $2+1$-dimensional quantum field\ntheories having Lifshitz symmetry. We have holographically calculated mutual\ninformation, entanglement wedge cross section, entanglement negativity and\nmutual complexity for strip like subsystems at the boundary. For this we have\nused the results of holographic entanglement entropy and complexity present in\nthe literature. We first calculate all of these mentioned quantities for the\npure state of Lifshitz spacetime. Then we have moved on to calculate all these\nquantities for excited state of the Lifshitz spacetime. The gravity dual of\nexcited state of Lifshitz systems in field theory can be obtained by applying\nconstant perturbations along the boundary direction. Further, we would like to\nmention that for the simplicity of calculation we are only considering results\nup to the first order in perturbation. The change in the obtained holographic\ninformation theoretic quantities are then related to entanglement entropy,\nentanglement pressure, entanglement chemical potential and charge using the\nstress tensor complex. These relations are analogous to the first law of\nentanglement thermodynamics given earlier in the literature. All the\ncalculations are carried out for both values of dynamical scaling exponent\n($z$) present in the Lifshitz field theory.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}