{"id":"2408.09959","title":"Recent advancements in atomic many-body methods for high-precision\n  studies of isotope shifts","authors":"B. K. Sahoo, S. Blundell, A. V. Oleynichenko, R. F. Garcia Ruiz, L. V.\n  Skripnikov and B. Ohayon","authorsParsed":[["Sahoo","B. K.",""],["Blundell","S.",""],["Oleynichenko","A. V.",""],["Ruiz","R. F. Garcia",""],["Skripnikov","L. V.",""],["Ohayon","B.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 13:02:10 GMT"}],"updateDate":"2024-08-20","timestamp":1724072530000,"abstract":"  The development of atomic many-body methods, capable of incorporating\nelectron correlation effects accurately, is required for isotope shift (IS)\nstudies. In combination with precise measurements, such calculations help to\nextract nuclear charge radii differences, and to probe for signatures of\nphysics beyond the Standard Model of particle physics. We review here a few\nrecently-developed methods in the relativistic many-body perturbation theory\n(RMBPT) and relativistic coupled-cluster (RCC) theory frameworks for\ncalculations of IS factors in the highly charged ions (HCIs), and neutral or\nsingly-charged ions, respectively. The results are presented for a wide range\nof atomic systems in order to demonstrate the interplay between quantum\nelectrodynamics (QED) and electron correlation effects. In view of this, we\nstart our discussions with the RMBPT calculations for a few HCIs by rigorously\ntreating QED effects; then we outline methods to calculate IS factors in the\none-valence atomic systems using two formulations of the RCC approach. Then we\npresent calculations for two valence atomic systems, by employing the\nFock-space RCC methods. For completeness, we briefly discuss theoretical input\nrequired for the upcoming experiments, their possibilities to probe nuclear\nproperties and implications to fundamental physics studies.\n","subjects":["Physics/Atomic Physics","Physics/Nuclear Theory","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rtcj4HNKqXNLoC4Q0Ewi_ytj1KbESc5w_xQgTASXyg8","pdfSize":"1825765"}
