{"id":"2408.03758","title":"MTDSense: AI-Based Fingerprinting of Moving Target Defense Techniques in\n  Software-Defined Networking","authors":"Tina Moghaddam, Guowei Yang, Chandra Thapa, Seyit Camtepe, Dan\n  Dongseong Kim","authorsParsed":[["Moghaddam","Tina",""],["Yang","Guowei",""],["Thapa","Chandra",""],["Camtepe","Seyit",""],["Kim","Dan Dongseong",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 13:26:00 GMT"}],"updateDate":"2024-08-08","timestamp":1723037160000,"abstract":"  Moving target defenses (MTD) are proactive security techniques that enhance\nnetwork security by confusing the attacker and limiting their attack window.\nMTDs have been shown to have significant benefits when evaluated against\ntraditional network attacks, most of which are automated and untargeted.\nHowever, little has been done to address an attacker who is aware the network\nuses an MTD. In this work, we propose a novel approach named MTDSense, which\ncan determine when the MTD has been triggered using the footprints the MTD\noperation leaves in the network traffic. MTDSense uses unsupervised clustering\nto identify traffic following an MTD trigger and extract the MTD interval. An\nattacker can use this information to maximize their attack window and tailor\ntheir attacks, which has been shown to significantly reduce the effectiveness\nof MTD. Through analyzing the attacker's approach, we propose and evaluate two\nnew MTD update algorithms that aim to reduce the information leaked into the\nnetwork by the MTD. We present an extensive experimental evaluation by\ncreating, to our knowledge, the first dataset of the operation of an\nIP-shuffling MTD in a software-defined network. Our work reveals that despite\nprevious results showing the effectiveness of MTD as a defense, traditional\nimplementations of MTD are highly susceptible to a targeted attacker.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"YrDJoDb1HOS32zKEcB0eVFWmE6t9hHAvdRIHQlZk2Pc","pdfSize":"5510461"}
