{"id":"2408.16253","title":"Theoretical Investigation of Interstellar 3-Pyrroline: Formation,\n  Rotational and Vibrational Spectroscopy","authors":"Anshika Pandey, Akant Vats, Satyam Srivastav, Amit Pathak and K. A. P.\n  Singh","authorsParsed":[["Pandey","Anshika",""],["Vats","Akant",""],["Srivastav","Satyam",""],["Pathak","Amit",""],["Singh","K. A. P.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 04:27:43 GMT"}],"updateDate":"2024-08-30","timestamp":1724905663000,"abstract":"  The recent detection of CN-functionalized aromatics partly addresses the\nlong-standing mystery of the apparent absence of five- and six-membered rings\nin interstellar environments. N-heterocycles, which are crucial as the\nfundamental structures of nucleobases, have been a focus of these aromatic\nsearches due to their biological significance. Although N-heterocycles have not\nbeen conclusively detected in astrophysical environments, their presence in\nchondrites and meteorites signifies their interstellar and circumstellar\nconnection. Precise spectral data identifies the unique signatures of\nmolecules, confirming their presence in space. In this light, the present work\nreports an extensive computational investigation on interstellar 3-pyrroline; a\nfive-membered ring N-heterocycle. This includes an alternative formation route\nin cold interstellar environments and highly accurate rotational and\nvibrational spectroscopy. The results indicate that 3-pyrroline can form on\ndust grain surfaces from vinyl cyanide, as its formation from pyrrole through\ndouble hydrogenation may lead to the formation of pyrrole itself via a H$_{2}$\nabstraction process. 3-pyrroline's rotational transition at 52.3 GHz offers a\npotential tool for its detection in cold interstellar regions. Additionally,\nthe strongest infrared features of 3-pyrroline at 16.09 $\\mu$m and $\\sim$3.50\n$\\mu$m are observable with JWST. The provided data is crucial for laboratory\nidentification and future interstellar observations of 3-pyrroline at both\nradio and IR wavelengths.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}