{"id":"2408.12460","title":"Finding Closure: A Closer Look at the Gestalt Law of Closure in\n  Convolutional Neural Networks","authors":"Yuyan Zhang, Derya Soydaner, Lisa Ko{\\ss}mann, Fatemeh Behrad, Johan\n  Wagemans","authorsParsed":[["Zhang","Yuyan",""],["Soydaner","Derya",""],["Koßmann","Lisa",""],["Behrad","Fatemeh",""],["Wagemans","Johan",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 14:59:37 GMT"}],"updateDate":"2024-08-23","timestamp":1724338777000,"abstract":"  The human brain has an inherent ability to fill in gaps to perceive figures\nas complete wholes, even when parts are missing or fragmented. This phenomenon\nis known as Closure in psychology, one of the Gestalt laws of perceptual\norganization, explaining how the human brain interprets visual stimuli. Given\nthe importance of Closure for human object recognition, we investigate whether\nneural networks rely on a similar mechanism. Exploring this crucial human\nvisual skill in neural networks has the potential to highlight their\ncomparability to humans. Recent studies have examined the Closure effect in\nneural networks. However, they typically focus on a limited selection of\nConvolutional Neural Networks (CNNs) and have not reached a consensus on their\ncapability to perform Closure. To address these gaps, we present a systematic\nframework for investigating the Closure principle in neural networks. We\nintroduce well-curated datasets designed to test for Closure effects, including\nboth modal and amodal completion. We then conduct experiments on various CNNs\nemploying different measurements. Our comprehensive analysis reveals that VGG16\nand DenseNet-121 exhibit the Closure effect, while other CNNs show variable\nresults. We interpret these findings by blending insights from psychology and\nneural network research, offering a unique perspective that enhances\ntransparency in understanding neural networks. Our code and dataset will be\nmade available on GitHub.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}