{"id":"2408.04118","title":"Reducing Matroid Optimization to Basis Search","authors":"Robert Streit, Vijay K. Garg","authorsParsed":[["Streit","Robert",""],["Garg","Vijay K.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 22:57:48 GMT"}],"updateDate":"2024-08-09","timestamp":1723071468000,"abstract":"  In combinatorial optimization, matroids provide one of the most elegant\nstructures for algorithm design. This is perhaps best identified by the\nEdmonds-Rado theorem relating the success of the simple greedy algorithm to the\nanatomy of the optimal basis of a matroid [Edm71; Rad57]. As a response, much\nenergy has been devoted to understanding a matroid's favorable computational\nproperties. Yet surprisingly, not much is understood where parallel algorithm\ndesign is concerned. Specifically, while prior work has investigated the task\nof finding an arbitrary basis in parallel computing settings [KUW88], the more\ncomplex task of finding the optimal basis remains unexplored. We initiate this\nstudy by reexamining Bor\\r{u}vka's minimum weight spanning tree algorithm in\nthe language of matroid theory, identifying a new characterization of the\noptimal basis by way of a matroid's cocircuits as a result. Furthermore, we\nthen combine such insights with special properties of binary matroids to reduce\noptimization in a binary matroid to the simpler task of search for an arbitrary\nbasis, with only logarithmic asymptotic overhead. Consequentially, we are able\nto compose our reduction with a known basis search method of [KUW88] to obtain\na novel algorithm for finding the optimal basis of a binary matroid with only\nsublinearly many adaptive rounds of queries to an independence oracle. To the\nauthors' knowledge, this is the first parallel algorithm for matroid\noptimization to outperform the greedy algorithm in terms of adaptive\ncomplexity, for any class of matroid not represented by a graph.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Discrete Mathematics","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PBkaPG5Nwc6P2mp0N20UeaIdQdnM2Xvxhrpl5YoJeg4","pdfSize":"494209"}
