{"id":"2408.13696","title":"Revisiting DNN Training for Intermittently Powered Energy Harvesting\n  Micro Computers","authors":"Cyan Subhra Mishra, Deeksha Chaudhary, Jack Sampson, Mahmut Taylan\n  Knademir, Chita Das","authorsParsed":[["Mishra","Cyan Subhra",""],["Chaudhary","Deeksha",""],["Sampson","Jack",""],["Knademir","Mahmut Taylan",""],["Das","Chita",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 01:13:00 GMT"}],"updateDate":"2024-08-27","timestamp":1724548380000,"abstract":"  The deployment of Deep Neural Networks in energy-constrained environments,\nsuch as Energy Harvesting Wireless Sensor Networks, presents unique challenges,\nprimarily due to the intermittent nature of power availability. To address\nthese challenges, this study introduces and evaluates a novel training\nmethodology tailored for DNNs operating within such contexts. In particular, we\npropose a dynamic dropout technique that adapts to both the architecture of the\ndevice and the variability in energy availability inherent in energy harvesting\nscenarios. Our proposed approach leverages a device model that incorporates\nspecific parameters of the network architecture and the energy harvesting\nprofile to optimize dropout rates dynamically during the training phase. By\nmodulating the network's training process based on predicted energy\navailability, our method not only conserves energy but also ensures sustained\nlearning and inference capabilities under power constraints. Our preliminary\nresults demonstrate that this strategy provides 6 to 22 percent accuracy\nimprovements compared to the state of the art with less than 5 percent\nadditional compute. This paper details the development of the device model,\ndescribes the integration of energy profiles with intermittency aware dropout\nand quantization algorithms, and presents a comprehensive evaluation of the\nproposed approach using real-world energy harvesting data.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}