{"id":"2408.11126","title":"Binocular Model: A deep learning solution for online melt pool\n  temperature analysis using dual-wavelength Imaging Pyrometry","authors":"Javid Akhavan, Chaitanya Krishna Vallabh, Xiayun Zhao, Souran\n  Manoochehri","authorsParsed":[["Akhavan","Javid",""],["Vallabh","Chaitanya Krishna",""],["Zhao","Xiayun",""],["Manoochehri","Souran",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 18:26:09 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 15:19:12 GMT"}],"updateDate":"2024-08-27","timestamp":1724178369000,"abstract":"  In metal Additive Manufacturing (AM), monitoring the temperature of the Melt\nPool (MP) is crucial for ensuring part quality, process stability, defect\nprevention, and overall process optimization. Traditional methods, are slow to\nconverge and require extensive manual effort to translate data into actionable\ninsights, rendering them impractical for real-time monitoring and control. To\naddress this challenge, we propose an Artificial Intelligence (AI)-based\nsolution aimed at reducing manual data processing reliance and improving the\nefficiency of transitioning from data to insight. In our study, we utilize a\ndataset comprising dual-wavelength real-time process monitoring data and\ncorresponding temperature maps. We introduce a deep learning model called the\n\"Binocular model,\" which exploits dual input observations to perform a precise\nanalysis of MP temperature in Laser Powder Bed Fusion (L-PBF). Through advanced\ndeep learning techniques, we seamlessly convert raw data into temperature maps,\nsignificantly streamlining the process and enabling batch processing at a rate\nof up to 750 frames per second, approximately 1000 times faster than\nconventional methods. Our Binocular model achieves high accuracy in temperature\nestimation, evidenced by a 0.95 R-squared score, while simultaneously enhancing\nprocessing efficiency by a factor of $\\sim1000x$ times. This model directly\naddresses the challenge of real-time MP temperature monitoring and offers\ninsights into the encountered constraints and the benefits of our Deep\nLearning-based approach. By combining efficiency and precision, our work\ncontributes to the advancement of temperature monitoring in L-PBF, thus driving\nprogress in the field of metal AM.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}