{"id":"2408.04713","title":"DyGMamba: Efficiently Modeling Long-Term Temporal Dependency on\n  Continuous-Time Dynamic Graphs with State Space Models","authors":"Zifeng Ding, Yifeng Li, Yuan He, Antonio Norelli, Jingcheng Wu, Volker\n  Tresp, Yunpu Ma, Michael Bronstein","authorsParsed":[["Ding","Zifeng",""],["Li","Yifeng",""],["He","Yuan",""],["Norelli","Antonio",""],["Wu","Jingcheng",""],["Tresp","Volker",""],["Ma","Yunpu",""],["Bronstein","Michael",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 18:25:14 GMT"}],"updateDate":"2024-08-12","timestamp":1723141514000,"abstract":"  Learning useful representations for continuous-time dynamic graphs (CTDGs) is\nchallenging, due to the concurrent need to span long node interaction histories\nand grasp nuanced temporal details. In particular, two problems emerge: (1)\nEncoding longer histories requires more computational resources, making it\ncrucial for CTDG models to maintain low computational complexity to ensure\nefficiency; (2) Meanwhile, more powerful models are needed to identify and\nselect the most critical temporal information within the extended context\nprovided by longer histories. To address these problems, we propose a CTDG\nrepresentation learning model named DyGMamba, originating from the popular\nMamba state space model (SSM). DyGMamba first leverages a node-level SSM to\nencode the sequence of historical node interactions. Another time-level SSM is\nthen employed to exploit the temporal patterns hidden in the historical graph,\nwhere its output is used to dynamically select the critical information from\nthe interaction history. We validate DyGMamba experimentally on the dynamic\nlink prediction task. The results show that our model achieves state-of-the-art\nin most cases. DyGMamba also maintains high efficiency in terms of\ncomputational resources, making it possible to capture long temporal\ndependencies with a limited computation budget.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}