{"id":"2408.15272","title":"Estimating ECG Intervals from Lead-I Alone: External Validation of\n  Supervised Models","authors":"Ridwan Alam, Collin Stultz","authorsParsed":[["Alam","Ridwan",""],["Stultz","Collin",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 17:45:09 GMT"}],"updateDate":"2024-08-29","timestamp":1723484709000,"abstract":"  The diagnosis, prognosis, and treatment of a number of cardiovascular\ndisorders rely on ECG interval measurements, including the PR, QRS, and QT\nintervals. These quantities are measured from the 12-lead ECG, either manually\nor using automated algorithms, which are readily available in clinical\nsettings. A number of wearable devices, however, can acquire the lead-I ECG in\nan outpatient setting, thereby raising the potential for out-of-hospital\nmonitoring for disorders that involve clinically significant changes in ECG\nintervals. In this work, we therefore developed a series of deep learning\nmodels for estimating the PR, QRS, and QT intervals using lead-I ECG. From a\ncorpus of 4.2 million ECGs from patients at the Massachusetts General Hospital,\nwe train and validate each of the models. At internal holdout validation, we\nachieve mean absolute errors (MAE) of 6.3 ms for QRS durations and 11.9 ms for\nQT intervals, and an MAE of 9.2 ms for estimating PR intervals. Moreover, as a\nwell-defined P-wave does not always exist in ECG tracings - for example, when\nthere is atrial fibrillation - we trained a model that can identify when there\nis a P-wave, and consequently, a measurable PR interval. We validate our models\non three large external healthcare datasets without any finetuning or\nretraining - 3.2 million ECG from the Brigham and Womens Hospital, 668 thousand\nfrom MIMIC-IV, and 20 thousand from PTB-XL - and achieve similar performance.\nAlso, our models significantly outperform two publicly available baseline\nalgorithms. This work demonstrates that ECG intervals can be tracked from only\nlead-I ECG using deep learning, and highlights the potential for\nout-of-hospital applications.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}