{"id":"2408.11975","title":"Automatic knowledge-graph creation from historical documents: The\n  Chilean dictatorship as a case study","authors":"Camila D\\'iaz, Jocelyn Dunstan, Lorena Etcheverry, Antonia Fonck,\n  Alejandro Grez, Domingo Mery, Juan Reutter, Hugo Rojas","authorsParsed":[["Díaz","Camila",""],["Dunstan","Jocelyn",""],["Etcheverry","Lorena",""],["Fonck","Antonia",""],["Grez","Alejandro",""],["Mery","Domingo",""],["Reutter","Juan",""],["Rojas","Hugo",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 20:15:22 GMT"}],"updateDate":"2024-08-23","timestamp":1724271322000,"abstract":"  We present our results regarding the automatic construction of a knowledge\ngraph from historical documents related to the Chilean dictatorship period\n(1973-1990). Our approach consists on using LLMs to automatically recognize\nentities and relations between these entities, and also to perform resolution\nbetween these sets of values. In order to prevent hallucination, the\ninteraction with the LLM is grounded in a simple ontology with 4 types of\nentities and 7 types of relations. To evaluate our architecture, we use a gold\nstandard graph constructed using a small subset of the documents, and compare\nthis to the graph obtained from our approach when processing the same set of\ndocuments. Results show that the automatic construction manages to recognize a\ngood portion of all the entities in the gold standard, and that those not\nrecognized are mostly explained by the level of granularity in which the\ninformation is structured in the graph, and not because the automatic approach\nmisses an important entity in the graph. Looking forward, we expect this report\nwill encourage work on other similar projects focused on enhancing research in\nhumanities and social science, but we remark that better evaluation metrics are\nneeded in order to accurately fine-tune these types of architectures.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZRcfEHDv-x5kmfn_6JWu1uh4FVxtI2LryRKZzAP1n-U","pdfSize":"1250665"}
