{"id":"2408.09722","title":"Towards Few-Shot Learning in the Open World: A Review and Beyond","authors":"Hui Xue, Yuexuan An, Yongchun Qin, Wenqian Li, Yixin Wu, Yongjuan Che,\n  Pengfei Fang, Minling Zhang","authorsParsed":[["Xue","Hui",""],["An","Yuexuan",""],["Qin","Yongchun",""],["Li","Wenqian",""],["Wu","Yixin",""],["Che","Yongjuan",""],["Fang","Pengfei",""],["Zhang","Minling",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 06:23:21 GMT"}],"updateDate":"2024-08-20","timestamp":1724048601000,"abstract":"  Human intelligence is characterized by our ability to absorb and apply\nknowledge from the world around us, especially in rapidly acquiring new\nconcepts from minimal examples, underpinned by prior knowledge. Few-shot\nlearning (FSL) aims to mimic this capacity by enabling significant\ngeneralizations and transferability. However, traditional FSL frameworks often\nrely on assumptions of clean, complete, and static data, conditions that are\nseldom met in real-world environments. Such assumptions falter in the\ninherently uncertain, incomplete, and dynamic contexts of the open world. This\npaper presents a comprehensive review of recent advancements designed to adapt\nFSL for use in open-world settings. We categorize existing methods into three\ndistinct types of open-world few-shot learning: those involving varying\ninstances, varying classes, and varying distributions. Each category is\ndiscussed in terms of its specific challenges and methods, as well as its\nstrengths and weaknesses. We standardize experimental settings and metric\nbenchmarks across scenarios, and provide a comparative analysis of the\nperformance of various methods. In conclusion, we outline potential future\nresearch directions for this evolving field. It is our hope that this review\nwill catalyze further development of effective solutions to these complex\nchallenges, thereby advancing the field of artificial intelligence.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}