{"id":"2408.08342","title":"CT4D: Consistent Text-to-4D Generation with Animatable Meshes","authors":"Ce Chen, Shaoli Huang, Xuelin Chen, Guangyi Chen, Xiaoguang Han, Kun\n  Zhang, Mingming Gong","authorsParsed":[["Chen","Ce",""],["Huang","Shaoli",""],["Chen","Xuelin",""],["Chen","Guangyi",""],["Han","Xiaoguang",""],["Zhang","Kun",""],["Gong","Mingming",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 14:41:34 GMT"}],"updateDate":"2024-08-19","timestamp":1723732894000,"abstract":"  Text-to-4D generation has recently been demonstrated viable by integrating a\n2D image diffusion model with a video diffusion model. However, existing models\ntend to produce results with inconsistent motions and geometric structures over\ntime. To this end, we present a novel framework, coined CT4D, which directly\noperates on animatable meshes for generating consistent 4D content from\narbitrary user-supplied prompts. The primary challenges of our mesh-based\nframework involve stably generating a mesh with details that align with the\ntext prompt while directly driving it and maintaining surface continuity. Our\nCT4D framework incorporates a unique Generate-Refine-Animate (GRA) algorithm to\nenhance the creation of text-aligned meshes. To improve surface continuity, we\ndivide a mesh into several smaller regions and implement a uniform driving\nfunction within each area. Additionally, we constrain the animating stage with\na rigidity regulation to ensure cross-region continuity. Our experimental\nresults, both qualitative and quantitative, demonstrate that our CT4D framework\nsurpasses existing text-to-4D techniques in maintaining interframe consistency\nand preserving global geometry. Furthermore, we showcase that this enhanced\nrepresentation inherently possesses the capability for combinational 4D\ngeneration and texture editing.\n","subjects":["Computing Research Repository/Graphics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}