{"id":"2408.10477","title":"Low-vibration cryogenic test facility for next generation of\n  ground-based gravitational-wave observatories","authors":"D. P. Kapasi, T. G. McRae, J. Eichholz, P. A. Altin, D. E. McClelland\n  and B. J. J. Slagmolen","authorsParsed":[["Kapasi","D. P.",""],["McRae","T. G.",""],["Eichholz","J.",""],["Altin","P. A.",""],["McClelland","D. E.",""],["Slagmolen","B. J. J.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 01:29:46 GMT"}],"updateDate":"2024-08-21","timestamp":1724117386000,"abstract":"  We present the design and commissioning of a cryogenic low-vibration test\nfacility that measures displacement noise from a gram-scale silicon cantilever\nat the level of 10$^{-16}\\, \\mathrm{m/\\sqrt{Hz}}$ at 1kHz. A volume of $\\sim$36\nlitres is enclosed by radiation shields cooling an optical test cavity that is\nsuspended from a multi-stage pendulum chain providing isolation from acoustic\nand environmental noise. This 3kg test cavity housing a crystalline silicon\ncantilever is radiatively cooled to 123K in 41 hours and held at that\ntemperature over many months with a relative temperature stability of $\\pm$1mK.\nThe facility is capable of interferometrically measuring temperature-dependent\nbroadband displacement noise between 50Hz and 10kHz where current and future\nground-based gravitational wave observatories are most sensitive. With suitable\ncantilever design, the cryogenic facility we describe here will allow for the\nmeasurement of broadband thermal noise in crystalline silicon at 123K. This\nwill guide the design of suspensions in planned future cryogenic ground-based\ngravitational-wave detectors such as LIGO Voyager and the Einstein Telescope.\nThis facility is also suitable for the testing of new mirror coatings at\ncryogenic temperatures.\n","subjects":["Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OYF0tHnk3b3If4rAjKLn3Ac2Jt6DNRMiDBeoWuWMwbY","pdfSize":"8462376"}
