{"id":"2408.10863","title":"LavAtmos 2.0: Incorporating Volatiles Species in Vaporization Models","authors":"Christiaan P.A. van Buchem, Mantas Zilinskas, Yamila Miguel, Wim van\n  Westrenen","authorsParsed":[["van Buchem","Christiaan P. A.",""],["Zilinskas","Mantas",""],["Miguel","Yamila",""],["van Westrenen","Wim",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 13:55:15 GMT"}],"updateDate":"2024-08-21","timestamp":1724162115000,"abstract":"  Due to strong irradiation, hot rocky exoplanets are able to sustain lava\noceans. Direct interaction between these oceans and overlying atmospheres can\nprovide insight into planetary interiors. In order to fully understand how the\ncomposition of the atmosphere of such planets are affected by the properties of\nthe oceans, comprehensive chemical equilibrium models are required. Thus far,\nmost models have only taken non-volatile species into account when calculating\nlava vaporisation. We investigate the effect of including C-, H-, N-, S-, and\nP-bearing species in the equilibrium lava vaporisation calculations on the\noverall atmospheric composition of hot rocky exoplanets by expanding our\nLavAtmos code. In LavAtmos 2.0 we integrate the chemical equilibrium code\nFastChem to expand the considered gas phase species to 523. We apply this new\napproach to calculate the composition of \"pure\" atmospheres which contain only\na single volatile element and more complex atmospheres which contain C, H, N,\nS, and P. We also test two proposed compositions for the atmosphere of 55-Cnc\ne. We find that the inclusion of volatile elements in vaporisation calculations\nincreases the partial pressures of vaporised species for all tested atmospheric\ncompositions. Our models indicate that the tested volatile atmospheres above a\nlava ocean have a relatively low C-O ratio. This demonstrates the utility of\ncomplex chemical models that better describe the chemical behavior of\natmospheres across a wide range of pressures and temperatures. Volatile\nelements must be taken into account for comprehensive modeling of vaporisation\nfrom a surface lava ocean into a volatile atmosphere. Vaporised species such as\nSiO, TiO, and Na may be present in greater abundances than previously\nestimated. A low atmospheric C/O ratio may be able to function as a new tracer\nfor the presence of surface lava oceans on hot rocky exoplanets.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}