{"id":"2408.13276","title":"Non-convex matrix sensing: Breaking the quadratic rank barrier in the\n  sample complexity","authors":"Dominik St\\\"oger, Yizhe Zhu","authorsParsed":[["Stöger","Dominik",""],["Zhu","Yizhe",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 14:09:28 GMT"},{"version":"v2","created":"Tue, 10 Sep 2024 18:44:10 GMT"}],"updateDate":"2024-09-12","timestamp":1724162968000,"abstract":"  For the problem of reconstructing a low-rank matrix from a few linear\nmeasurements, two classes of algorithms have been widely studied in the\nliterature: convex approaches based on nuclear norm minimization, and\nnon-convex approaches that use factorized gradient descent. Under certain\nstatistical model assumptions, it is known that nuclear norm minimization\nrecovers the ground truth as soon as the number of samples scales linearly with\nthe number of degrees of freedom of the ground-truth. In contrast, while\nnon-convex approaches are computationally less expensive, existing recovery\nguarantees assume that the number of samples scales at least quadratically with\nthe rank $r$ of the ground-truth matrix. In this paper, we close this gap by\nshowing that the non-convex approaches can be as efficient as nuclear norm\nminimization in terms of sample complexity. Namely, we consider the problem of\nreconstructing a positive semidefinite matrix from a few Gaussian measurements.\nWe show that factorized gradient descent with spectral initialization converges\nto the ground truth with a linear rate as soon as the number of samples scales\nwith $ \\Omega (rd\\kappa^2)$, where $d$ is the dimension, and $\\kappa$ is the\ncondition number of the ground truth matrix. This improves the previous\nrank-dependence in the sample complexity of non-convex matrix factorization\nfrom quadratic to linear. Our proof relies on a probabilistic decoupling\nargument, where we show that the gradient descent iterates are only weakly\ndependent on the individual entries of the measurement matrices. We expect that\nour proof technique is of independent interest for other non-convex problems.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Information Theory","Computing Research Repository/Machine Learning","Mathematics/Information Theory","Mathematics/Optimization and Control","Mathematics/Probability","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}