{"id":"2408.03038","title":"A new code for low-resolution spectral identification of white dwarf\n  binary candidates","authors":"Genghao Liu, Baitian Tang, Liangliang Ren, Chengyuan Li, Sihao Cheng,\n  Weikai Zong, Jianning Fu, Bo Ma, Cheng Xu, Yiming Hu","authorsParsed":[["Liu","Genghao",""],["Tang","Baitian",""],["Ren","Liangliang",""],["Li","Chengyuan",""],["Cheng","Sihao",""],["Zong","Weikai",""],["Fu","Jianning",""],["Ma","Bo",""],["Xu","Cheng",""],["Hu","Yiming",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 08:48:31 GMT"}],"updateDate":"2024-08-07","timestamp":1722934111000,"abstract":"  Close white dwarf binaries (CWDBs) are considered to be progenitors of\nseveral exotic astronomical phenomena (e.g., type Ia supernovae, cataclysmic\nvariables). These violent events are broadly used in studies of general\nrelativity and cosmology. However, obtaining precise stellar parameter\nmeasurements for both components of CWDBs is a challenging task given their low\nluminosities, swift time variation, and complex orbits. High-resolution spectra\n(R$> 20 000$) are preferred but expensive, resulting in a sample size that is\ninsufficient for robust population study. To release the full potential of the\nless expensive low-resolution spectroscopic surveys, and thus greatly expand\nthe CWDB sample size, it is necessary to develop a robust pipeline for spectra\ndecomposition and analysis. We used an artificial neural network (ANN) to build\nspectrum generators for DA/DB white dwarfs and main-sequence stars. The\nbest-fit stellar parameters were obtained by finding the least $\\chi^2$\nsolution to these feature lines and the continuum simultaneously. We\ndemonstrate the reliability of our code with two well-studied CWDBs, WD\n1534+503 and PG 1224+309. We also estimate the stellar parameters of 14 newly\nidentified CWDB candidates, most of which are fitted with double component\nmodels for the first time. Our estimates agree with previous results for the\ncommon stars and follow the statistical distribution in the literature. The\napplication of our code to a large volume of white dwarf binary candidates will\noffer important statistic samples to stellar evolution studies and future\ngravitational wave monitoring.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}