{"id":"2408.11434","title":"Near-Field Signal Processing: Unleashing the Power of Proximity","authors":"Ahmet M. Elbir, \\\"Ozlem Tu\\u{g}fe Demir, Kumar Vijay Mishra, Symeon\n  Chatzinotas, Martin Haardt","authorsParsed":[["Elbir","Ahmet M.",""],["Demir","Özlem Tuğfe",""],["Mishra","Kumar Vijay",""],["Chatzinotas","Symeon",""],["Haardt","Martin",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 08:44:21 GMT"}],"updateDate":"2024-08-22","timestamp":1724229861000,"abstract":"  After nearly a century of specialized applications in optics, remote sensing,\nand acoustics, the near-field (NF) electromagnetic propagation zone is\nexperiencing a resurgence in research interest. This renewed attention is\nfueled by the emergence of promising applications in various fields such as\nwireless communications, holography, medical imaging, and quantum-inspired\nsystems. Signal processing within NF sensing and wireless communications\nenvironments entails addressing issues related to extended scatterers,\nrange-dependent beampatterns, spherical wavefronts, mutual coupling effects,\nand the presence of both reactive and radiative fields. Recent investigations\nhave focused on these aspects in the context of extremely large arrays and wide\nbandwidths, giving rise to novel challenges in channel estimation, beamforming,\nbeam training, sensing, and localization. While NF optics has a longstanding\nhistory, advancements in NF phase retrieval techniques and their applications\nhave lately garnered significant research attention. Similarly, utilizing NF\nlocalization with acoustic arrays represents a contemporary extension of\nestablished principles in NF acoustic array signal processing. This article\naims to provide an overview of state-of-the-art signal processing techniques\nwithin the NF domain, offering a comprehensive perspective on recent advances\nin diverse applications.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Information Theory","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}