{"id":"2408.04799","title":"Motion-based visual encoding can improve performance on perceptual tasks\n  with dynamic time series","authors":"Songwen Hu, Ouxun Jiang, Jeffrey Riedmiller, Cindy Xiong Bearfield","authorsParsed":[["Hu","Songwen",""],["Jiang","Ouxun",""],["Riedmiller","Jeffrey",""],["Bearfield","Cindy Xiong",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 00:52:35 GMT"}],"updateDate":"2024-08-12","timestamp":1723164755000,"abstract":"  Dynamic data visualizations can convey large amounts of information over\ntime, such as using motion to depict changes in data values for multiple\nentities. Such dynamic displays put a demand on our visual processing\ncapacities, yet our perception of motion is limited. Several techniques have\nbeen shown to improve the processing of dynamic displays. Staging the animation\nto sequentially show steps in a transition and tracing object movement by\ndisplaying trajectory histories can improve processing by reducing the\ncognitive load. In this paper, We examine the effectiveness of staging and\ntracing in dynamic displays. We showed participants animated line charts\ndepicting the movements of lines and asked them to identify the line with the\nhighest mean and variance. We manipulated the animation to display the lines\nwith or without staging, tracing and history, and compared the results to a\nstatic chart as a control. Results showed that tracing and staging are\npreferred by participants, and improve their performance in mean and variance\ntasks respectively. They also preferred display time 3 times shorter when\nstaging is used. Also, encoding animation speed with mean and variance in\ncongruent tasks is associated with higher accuracy. These findings help inform\nreal-world best practices for building dynamic displays. The supplementary\nmaterials can be found at https://osf.io/8c95v/\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lriRaCAJUmQ_nBMmzSajbSxttbE5VdH_o9UL9PGezEQ","pdfSize":"3809404"}
