{"id":"2408.16304","title":"Understanding Privacy Norms through Web Forms","authors":"Hao Cui, Rahmadi Trimananda, Athina Markopoulou","authorsParsed":[["Cui","Hao",""],["Trimananda","Rahmadi",""],["Markopoulou","Athina",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 07:11:09 GMT"}],"updateDate":"2024-08-30","timestamp":1724915469000,"abstract":"  Web forms are one of the primary ways to collect personal information online,\nyet they are relatively under-studied. Unlike web tracking, data collection\nthrough web forms is explicit and contextualized. Users (i) are asked to input\nspecific personal information types, and (ii) know the specific context (i.e.,\non which website and for what purpose). For web forms to be trusted by users,\nthey must meet the common sense standards of appropriate data collection\npractices within a particular context (i.e., privacy norms). In this paper, we\nextract the privacy norms embedded within web forms through a measurement\nstudy. First, we build a specialized crawler to discover web forms on websites.\nWe run it on 11,500 popular websites, and we create a dataset of 293K web\nforms. Second, to process data of this scale, we develop a cost-efficient way\nto annotate web forms with form types and personal information types, using\ntext classifiers trained with assistance of large language models (LLMs).\nThird, by analyzing the annotated dataset, we reveal common patterns of data\ncollection practices. We find that (i) these patterns are explained by\nfunctional necessities and legal obligations, thus reflecting privacy norms,\nand that (ii) deviations from the observed norms often signal unnecessary data\ncollection. In addition, we analyze the privacy policies that accompany web\nforms. We show that, despite their wide adoption and use, there is a disconnect\nbetween privacy policy disclosures and the observed privacy norms.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}