{"id":"2408.05052","title":"Integrating Edge Information into Ground Truth for the Segmentation of\n  the Optic Disc and Cup from Fundus Images","authors":"Yoga Sri Varshan V, Hitesh Gupta Kattamuri, Subin Sahayam, Umarani\n  Jayaraman","authorsParsed":[["Varshan","Yoga Sri","V"],["Kattamuri","Hitesh Gupta",""],["Sahayam","Subin",""],["Jayaraman","Umarani",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 13:18:50 GMT"}],"updateDate":"2024-08-12","timestamp":1723209530000,"abstract":"  Optic disc and cup segmentation helps in the diagnosis of glaucoma,\nmyocardial infarction, and diabetic retinopathy. Most deep learning methods\ndeveloped to perform segmentation tasks are built on top of a U-Net-based model\narchitecture. Nevertheless, U-Net and its variants have a tendency to\nover-segment/ under-segment the required regions of interest. Since the most\nimportant outcome is the value of cup-to-disc ratio and not the segmented\nregions themselves, we are more concerned about the boundaries rather than the\nregions under the boundaries. This makes learning edges important as compared\nto learning the regions. In the proposed work, the authors aim to extract both\nedges of the optic disc and cup from the ground truth using a Laplacian filter.\nNext, edges are reconstructed to obtain an edge ground truth in addition to the\noptic disc-cup ground truth. Utilizing both ground truths, the authors study\nseveral U-Net and its variant architectures with and without optic disc and cup\nedges as target, along with the optic disc-cup ground truth for segmentation.\nThe authors have used the REFUGE benchmark dataset and the Drishti-GS dataset\nto perform the study, and the results are tabulated for the dice and the\nHausdorff distance metrics. In the case of the REFUGE dataset, the optic disc\nmean dice score has improved from 0.7425 to 0.8859 while the mean Hausdorff\ndistance has reduced from 6.5810 to 3.0540 for the baseline U-Net model.\nSimilarly, the optic cup mean dice score has improved from 0.6970 to 0.8639\nwhile the mean Hausdorff distance has reduced from 5.2340 to 2.6323 for the\nsame model. Similar improvement has been observed for the Drishti-GS dataset as\nwell. Compared to the baseline U-Net and its variants (i.e) the Attention U-Net\nand the U-Net++, the models that learn integrated edges along with the optic\ndisc and cup regions performed well in both validation and testing datasets.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}