{"id":"2408.00984","title":"GraphAge: Unleashing the power of Graph Neural Network to Decode\n  Epigenetic Aging","authors":"Saleh Sakib Ahmed, Nahian Shabab, Md. Abul Hassan Samee and M. Sohel\n  Rahman","authorsParsed":[["Ahmed","Saleh Sakib",""],["Shabab","Nahian",""],["Samee","Md. Abul Hassan",""],["Rahman","M. Sohel",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 02:55:56 GMT"}],"updateDate":"2024-08-05","timestamp":1722567356000,"abstract":"  DNA methylation is a crucial epigenetic marker used in various clocks to\npredict epigenetic age. However, many existing clocks fail to account for\ncrucial information about CpG sites and their interrelationships, such as\nco-methylation patterns. We present a novel approach to represent methylation\ndata as a graph, using methylation values and relevant information about CpG\nsites as nodes, and relationships like co-methylation, same gene, and same\nchromosome as edges. We then use a Graph Neural Network (GNN) to predict age.\nThus our model, GraphAge, leverages both structural and positional information\nfor prediction as well as better interpretation. Although we had to train in a\nconstrained compute setting, GraphAge still showed competitive performance with\na Mean Absolute Error (MAE) of 3.207 and a Mean Squared Error (MSE) of 25.277,\nslightly outperforming the current state of the art. Perhaps more importantly,\nwe utilized GNN explainer for interpretation purposes and were able to unearth\ninteresting insights (e.g., key CpG sites, pathways, and their relationships\nthrough Methylation Regulated Networks in the context of aging), which were not\npossible to 'decode' without leveraging the unique capability of GraphAge to\n'encode' various structural relationships. GraphAge has the potential to\nconsume and utilize all relevant information (if available) about an individual\nthat relates to the complex process of aging. So, in that sense, it is one of\nits kind and can be seen as the first benchmark for a multimodal model that can\nincorporate all this information in order to close the gap in our understanding\nof the true nature of aging.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Q7JrKkDnzTEEDMtIWWYpNIJ4tOl_kvlXxAJDE4R-2ss","pdfSize":"3266792"}
