{"id":"2408.05188","title":"Current-induced spin polarisation in Rashba-Dresselhaus systems under\n  different point groups","authors":"Akash Dey, Ashis K. Nandy, Kush Saha","authorsParsed":[["Dey","Akash",""],["Nandy","Ashis K.",""],["Saha","Kush",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 17:20:46 GMT"}],"updateDate":"2024-08-12","timestamp":1723224046000,"abstract":"  Non-magnetic materials without inversion symmetry typically exhibit strong\nRashba spin-orbit coupling (SOC), enabling the well-known Rashba Edelstein\neffect where an external electrical current induces transverse spin\npolarisation. In this study, we demonstrate that electrically induced spin\npolarisation in non-magnetic materials, for example, electronic systems within\nquantum-well geometries, can significantly be influenced by the system's\npoint-group symmetries, such as $C_n$ and $C_{nv}$. These symmetries allow\nvarious linear and higher-order momentum, $k-$varying SOC Hamiltonian.\nSpecifically, we show that surfaces having $C_{n}$ point-group symmetry, which\npermits specific linear and cubic Rashba and Dresselhaus SOC terms, can lead to\nboth orthogonal and non-orthogonal spin polarisations with respect to the\napplied field. In contrast, surfaces with $C_{nv}$ symmetry exhibit only\ntransverse spin polarisation, regardless of the linear and cubic SOC terms. We\nfurther find contrasting spin polarisation for cubic-in-$k$ SOC as compared to\nthe linear-in-$k$ SOC when energy is varied, for example, through doping.\nAdditionally, we show that the surfaces with $C_{n}$ symmetry may exhibit\npersistent spin current, depending on the relative strength between different\nmomentum-dependent SOC terms. Our finding emphasizes the significance of\ncrystal symmetry in understanding and manipulating induced spin polarisation in\nnoncentrosymmetric materials, especially in surface/interface systems.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}