{"id":"2408.14492","title":"Evolvable Psychology Informed Neural Network for Memory Behavior\n  Modeling","authors":"Xiaoxuan Shen and Zhihai Hu and Qirong Chen and Shengyingjie Liu and\n  Ruxia Liang and Jianwen Sun","authorsParsed":[["Shen","Xiaoxuan",""],["Hu","Zhihai",""],["Chen","Qirong",""],["Liu","Shengyingjie",""],["Liang","Ruxia",""],["Sun","Jianwen",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 01:35:32 GMT"}],"updateDate":"2024-08-28","timestamp":1724376932000,"abstract":"  Memory behavior modeling is a core issue in cognitive psychology and\neducation. Classical psychological theories typically use memory equations to\ndescribe memory behavior, which exhibits insufficient accuracy and controversy,\nwhile data-driven memory modeling methods often require large amounts of\ntraining data and lack interpretability. Knowledge-informed neural network\nmodels have shown excellent performance in fields like physics, but there have\nbeen few attempts in the domain of behavior modeling. This paper proposed a\npsychology theory informed neural networks for memory behavior modeling named\nPsyINN, where it constructs a framework that combines neural network with\ndifferentiating sparse regression, achieving joint optimization. Specifically,\nto address the controversies and ambiguity of descriptors in memory equations,\na descriptor evolution method based on differentiating operators is proposed to\nachieve precise characterization of descriptors and the evolution of memory\ntheoretical equations. Additionally, a buffering mechanism for the sparse\nregression and a multi-module alternating iterative optimization method are\nproposed, effectively mitigating gradient instability and local optima issues.\nOn four large-scale real-world memory behavior datasets, the proposed method\nsurpasses the state-of-the-art methods in prediction accuracy. Ablation study\ndemonstrates the effectiveness of the proposed refinements, and application\nexperiments showcase its potential in inspiring psychological research.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}