{"id":"2408.13460","title":"DOPPLER: Differentially Private Optimizers with Low-pass Filter for\n  Privacy Noise Reduction","authors":"Xinwei Zhang, Zhiqi Bu, Mingyi Hong, Meisam Razaviyayn","authorsParsed":[["Zhang","Xinwei",""],["Bu","Zhiqi",""],["Hong","Mingyi",""],["Razaviyayn","Meisam",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 04:27:07 GMT"}],"updateDate":"2024-08-28","timestamp":1724473627000,"abstract":"  Privacy is a growing concern in modern deep-learning systems and\napplications. Differentially private (DP) training prevents the leakage of\nsensitive information in the collected training data from the trained machine\nlearning models. DP optimizers, including DP stochastic gradient descent\n(DPSGD) and its variants, privatize the training procedure by gradient clipping\nand DP noise injection. However, in practice, DP models trained using DPSGD and\nits variants often suffer from significant model performance degradation. Such\ndegradation prevents the application of DP optimization in many key tasks, such\nas foundation model pretraining. In this paper, we provide a novel signal\nprocessing perspective to the design and analysis of DP optimizers. We show\nthat a ``frequency domain'' operation called low-pass filtering can be used to\neffectively reduce the impact of DP noise. More specifically, by defining the\n``frequency domain'' for both the gradient and differential privacy (DP) noise,\nwe have developed a new component, called DOPPLER. This component is designed\nfor DP algorithms and works by effectively amplifying the gradient while\nsuppressing DP noise within this frequency domain. As a result, it maintains\nprivacy guarantees and enhances the quality of the DP-protected model. Our\nexperiments show that the proposed DP optimizers with a low-pass filter\noutperform their counterparts without the filter by 3%-10% in test accuracy on\nvarious models and datasets. Both theoretical and practical evidence suggest\nthat the DOPPLER is effective in closing the gap between DP and non-DP\ntraining.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Cryptography and Security","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1k74Fab_6G9bnLLkEetl0e9x-Knmdeor27mvRCprSiU","pdfSize":"2305840"}
