{"id":"2408.00419","title":"The most distant HI galaxies discovered by the 500 m dish FAST","authors":"Hongwei Xi, Bo Peng, Lister Staveley-Smith, Bi-Qing For, Bin Liu,\n  Ru-Rong Chen, Lei Yu, Dejian Ding, Wei-Jian Guo, Hu Zou, Suijian Xue, Jing\n  Wang, Thomas G. Brink, WeiKang Zheng, Alexei V. Filippenko, Yi Yang, Jianyan\n  Wei, Y. Sophia Dai, Zi-Jian Li, Zizhao He, Chengzi Jiang, Alexei Moiseev and\n  Sergey Kotov","authorsParsed":[["Xi","Hongwei",""],["Peng","Bo",""],["Staveley-Smith","Lister",""],["For","Bi-Qing",""],["Liu","Bin",""],["Chen","Ru-Rong",""],["Yu","Lei",""],["Ding","Dejian",""],["Guo","Wei-Jian",""],["Zou","Hu",""],["Xue","Suijian",""],["Wang","Jing",""],["Brink","Thomas G.",""],["Zheng","WeiKang",""],["Filippenko","Alexei V.",""],["Yang","Yi",""],["Wei","Jianyan",""],["Dai","Y. Sophia",""],["Li","Zi-Jian",""],["He","Zizhao",""],["Jiang","Chengzi",""],["Moiseev","Alexei",""],["Kotov","Sergey",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 09:40:49 GMT"}],"updateDate":"2024-08-02","timestamp":1722505249000,"abstract":"  Neutral hydrogen (HI) is the primary component of the cool interstellar\nmedium (ISM) and is the reservoir of fuel for star formation. Owing to the\nsensitivity of existing radio telescopes, our understanding of the evolution of\nthe ISM in galaxies remains limited, as it is based on only a few hundred\ngalaxies detected in HI beyond the local Universe. With the high sensitivity of\nthe Five-hundred-meter Aperture Spherical radio Telescope (FAST), we carried\nout a blind HI search, the FAST Ultra-Deep Survey (FUDS), which extends to\nredshifts up to 0.42 and a sensitivity of 50 $\\rm \\mu Jy \\cdot beam^{-1}$.\nHere, we report the first discovery of six galaxies in HI at $z>0.38$. For\nthese galaxies, the FAST angular resolution of $\\sim\\,4'$ corresponds to a mean\nlinear size of $\\sim1.3\\,h_{70}^{-1}\\,$Mpc. These galaxies are among the most\ndistant HI emission detections known, with one having the most massive HI\ncontent ($10^{10.93 \\pm 0.04}~h_{70}^{-2}\\, \\rm M_\\odot$). Using recent data\nfrom the DESI survey, and new observations with the Hale, BTA, and Keck\ntelescopes, optical counterparts are detected for all galaxies within the\n3-$\\sigma$ positional uncertainty ($0.5\\,h_{70}^{-1}\\,$Mpc) and $\\rm 200\\,km\n\\cdot s^{-1}$ in recession velocity. Assuming that the dominant source of HI is\nthe identified optical counterpart, we find an evidence of evolution in the HI\ncontent of galaxies over the last 4.2 Gyr. Our new high-redshift HI galaxy\nsample provides the opportunity to better investigate the evolution of cool gas\nin galaxies. A larger sample size in the future will allow us to refine our\nknowledge of the formation and evolution of galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}