{"id":"2408.05374","title":"Toward Reliable $0\\nu\\beta\\beta$-decay Nuclear Matrix Elements:\n  Exploring the potential of measuring $\\gamma\\gamma$-transitions","authors":"Beatriz Romeo Zaragozano","authorsParsed":[["Zaragozano","Beatriz Romeo",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 22:55:32 GMT"}],"updateDate":"2024-08-13","timestamp":1723244132000,"abstract":"  In this work, a physics process known since quite long ago, double-gamma\ndecay ($\\gamma\\gamma$), has been revisited from a new perspective: providing\nvaluable insights into neutrinoless double-beta decay ($0\\nu\\beta\\beta$)\nnuclear matrix elements. At the same time that an eager experimental search of\n$0\\nu\\beta\\beta$ decay is underway, the nuclear and particle physics\ncommunities have made huge progress during the last years. The main goal of\nthis thesis has been to investigate one of those approaches which is the\ncomputation of nuclear observables related to $0\\nu\\beta\\beta$ decay as a way\nto help in determining and reducing the theoretical uncertainties in\n$0\\nu\\beta\\beta$-decay NMEs. This way, we have proposed that the measurement of\nthe double magnetic dipole $\\gamma\\gamma$ decay from the double isobaric analog\nstate in the $\\beta\\beta$-decay final nucleus could establish the value and\nreduce the uncertainty in $0\\nu\\beta\\beta$-decay NMEs, because the NMEs of the\ntwo processes are very well correlated. We have explored the validity of this\napproach to predict and quantify NMEs uncertainties in the case where data is\navailable for the nuclear observable related to $0\\nu\\beta\\beta$ decay, that is\nfor the Standard Model allowed $2\\nu\\beta\\beta$ decay. A further objective has\nbeen to start with the theoretical characterization of the first steps toward\nthe measurement of the proposed $\\gamma\\gamma$ double magnetic dipole decay\nfrom the double isobaric analogue state. In particular, we have studied the\nmain decaying modes that can compete with this process: single gamma decay and\nproton emission, vi and we have calculated the corresponding branching ratios.\nIn addition, we have also given the first steps in the study of the relation\nbetween $\\gamma\\gamma$ and $0\\nu\\beta\\beta$-decay NMEs in the ab initio valence\nspace in-medium similarity renormalization group.\n","subjects":["Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}