{"id":"2408.03707","title":"Home Energy Management Systems: Challenges, Heterogeneity & Integration\n  Architecture Towards A Smart City Ecosystem","authors":"Georgios Kormpakis, Alexios Lekidis, Elissaios Sarmas, Giannis Papias,\n  Filippos Serepas, George Stravodimos, Vangelis Marinakis","authorsParsed":[["Kormpakis","Georgios",""],["Lekidis","Alexios",""],["Sarmas","Elissaios",""],["Papias","Giannis",""],["Serepas","Filippos",""],["Stravodimos","George",""],["Marinakis","Vangelis",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 11:44:58 GMT"}],"updateDate":"2024-08-08","timestamp":1723031098000,"abstract":"  The contemporary era is marked by rapid urban growth and increasing\npopulation. A significant, and constantly growing, portion of the global\npopulation now resides in major cities, leading to escalating energy demands in\nurban centers. As urban population is expected to keep on expanding in the near\nfuture, the same is also expected to happen with the associated energy\nrequirements. The situation with the continuously increasing energy demand,\nalong with the emergence of smart grids and the capabilities that are already\n-- or can be -- offered by Home Energy Management System (HEMS), has created a\nlot of opportunities towards a more sustainable future, with optimized energy\nconsumption and demand response, which leads to economic and environmental\nbenefits, based on the actual needs of the consumers. In this paper, we begin\nby providing an analytical exploration of the challenges faced at both the\ndevelopment and deployment levels. We proceed with a thorough analysis and\ncomparison between the abundance of devices, smart home technologies, and\nprotocols currently used by various products. Following, aiming to blunt the\ncurrently existing challenges, we propose a reliable, flexible, and extendable\narchitectural schema. Finally, we analyze a number of potential ways in which\nthe data deriving from such implementations can be analyzed and leveraged, in\norder to produce services that offer useful insights and smart solutions\ntowards enhanced energy efficiency.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/"}