{"id":"2408.15583","title":"PointEMRay: A Novel Efficient SBR Framework on Point Based Geometry","authors":"Kaiqiao Yang, Che Liu, Wenming Yu, and Tie Jun Cui","authorsParsed":[["Yang","Kaiqiao",""],["Liu","Che",""],["Yu","Wenming",""],["Cui","Tie Jun",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 07:15:17 GMT"}],"updateDate":"2024-08-29","timestamp":1724829317000,"abstract":"  The rapid computation of electromagnetic (EM) fields across various scenarios\nhas long been a challenge, primarily due to the need for precise geometric\nmodels. The emergence of point cloud data offers a potential solution to this\nissue. However, the lack of electromagnetic simulation algorithms optimized for\npoint-based models remains a significant limitation. In this study, we propose\nPointEMRay, an innovative shooting and bouncing ray (SBR) framework designed\nexplicitly for point-based geometries. To enable SBR on point clouds, we\naddress two critical challenges: point-ray intersection (PRI) and multiple\nbounce computation (MBC). For PRI, we propose a screen-based method leveraging\ndeep learning. Initially, we obtain coarse depth maps through ray tube tracing,\nwhich are then transformed by a neural network into dense depth maps, normal\nmaps, and intersection masks, collectively referred to as geometric frame\nbuffers (GFBs). For MBC, inspired by simultaneous localization and mapping\n(SLAM) techniques, we introduce a GFB-assisted approach. This involves\naggregating GFBs from various observation angles and integrating them to\nrecover the complete geometry. Subsequently, a ray tracing algorithm is applied\nto these GFBs to compute the scattering electromagnetic field. Numerical\nexperiments demonstrate the superior performance of PointEMRay in terms of both\naccuracy and efficiency, including support for real-time simulation. To the\nbest of our knowledge, this study represents the first attempt to develop an\nSBR framework specifically tailored for point-based models.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}