{"id":"2408.06337","title":"Analytical Weak Lensing Shear Inference for Precision Cosmology","authors":"Xiangchong Li, Rachel Mandelbaum and The LSST Dark Energy Science\n  Collaboration","authorsParsed":[["Li","Xiangchong",""],["Mandelbaum","Rachel",""],["Collaboration","The LSST Dark Energy Science",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 17:52:44 GMT"}],"updateDate":"2024-08-13","timestamp":1723485164000,"abstract":"  Noise bias is a significant source of systematic error in weak gravitational\nlensing measurements that must be corrected to satisfy the stringent standards\nof modern imaging surveys in the era of precision cosmology. This paper reviews\nthe analytical noise bias correction method and provides analytical derivations\ndemonstrating that we can recover shear to its second order using the\n'renoising' noise bias correction approach introduced by Metacalibration. We\nimplement this analytical noise bias correction within the AnaCal shear\nestimation framework and propose several enhancements to the noise bias\ncorrection algorithm. We evaluate the improved AnaCal using simulations\ndesigned to replicate Rubin LSST imaging data. These simulations feature\nsemi-realistic galaxies and stars, complete with representative distributions\nof magnitudes and Galactic spatial density. We conduct tests under various\nobservational challenges, including cosmic rays, defective CCD columns, bright\nstar saturation, bleed trails, and spatially variable point spread functions.\nOur results indicate a multiplicative bias in weak lensing shear recovery of\nless than a few tenths of a percent, meeting LSST DESC requirements without\nrequiring calibration from external image simulations. Additionally, our\nalgorithm achieves rapid processing, handling one galaxy in less than a\nmillisecond.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}