{"id":"2408.02079","title":"Improving Neural Surface Reconstruction with Feature Priors from\n  Multi-View Image","authors":"Xinlin Ren, Chenjie Cao, Yanwei Fu, Xiangyang Xue","authorsParsed":[["Ren","Xinlin",""],["Cao","Chenjie",""],["Fu","Yanwei",""],["Xue","Xiangyang",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 16:09:46 GMT"},{"version":"v2","created":"Sat, 14 Sep 2024 15:18:54 GMT"}],"updateDate":"2024-09-17","timestamp":1722787786000,"abstract":"  Recent advancements in Neural Surface Reconstruction (NSR) have significantly\nimproved multi-view reconstruction when coupled with volume rendering. However,\nrelying solely on photometric consistency in image space falls short of\naddressing complexities posed by real-world data, including occlusions and\nnon-Lambertian surfaces. To tackle these challenges, we propose an\ninvestigation into feature-level consistent loss, aiming to harness valuable\nfeature priors from diverse pretext visual tasks and overcome current\nlimitations. It is crucial to note the existing gap in determining the most\neffective pretext visual task for enhancing NSR. In this study, we\ncomprehensively explore multi-view feature priors from seven pretext visual\ntasks, comprising thirteen methods. Our main goal is to strengthen NSR training\nby considering a wide range of possibilities. Additionally, we examine the\nimpact of varying feature resolutions and evaluate both pixel-wise and\npatch-wise consistent losses, providing insights into effective strategies for\nimproving NSR performance. By incorporating pre-trained representations from\nMVSFormer and QuadTree, our approach can generate variations of MVS-NeuS and\nMatch-NeuS, respectively. Our results, analyzed on DTU and EPFL datasets,\nreveal that feature priors from image matching and multi-view stereo outperform\nother pretext tasks. Moreover, we discover that extending patch-wise\nphotometric consistency to the feature level surpasses the performance of\npixel-wise approaches. These findings underscore the effectiveness of these\ntechniques in enhancing NSR outcomes.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}