{"id":"2408.10807","title":"DisMix: Disentangling Mixtures of Musical Instruments for Source-level\n  Pitch and Timbre Manipulation","authors":"Yin-Jyun Luo, Kin Wai Cheuk, Woosung Choi, Toshimitsu Uesaka, Keisuke\n  Toyama, Koichi Saito, Chieh-Hsin Lai, Yuhta Takida, Wei-Hsiang Liao, Simon\n  Dixon, Yuki Mitsufuji","authorsParsed":[["Luo","Yin-Jyun",""],["Cheuk","Kin Wai",""],["Choi","Woosung",""],["Uesaka","Toshimitsu",""],["Toyama","Keisuke",""],["Saito","Koichi",""],["Lai","Chieh-Hsin",""],["Takida","Yuhta",""],["Liao","Wei-Hsiang",""],["Dixon","Simon",""],["Mitsufuji","Yuki",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 12:56:49 GMT"}],"updateDate":"2024-08-21","timestamp":1724158609000,"abstract":"  Existing work on pitch and timbre disentanglement has been mostly focused on\nsingle-instrument music audio, excluding the cases where multiple instruments\nare presented. To fill the gap, we propose DisMix, a generative framework in\nwhich the pitch and timbre representations act as modular building blocks for\nconstructing the melody and instrument of a source, and the collection of which\nforms a set of per-instrument latent representations underlying the observed\nmixture. By manipulating the representations, our model samples mixtures with\nnovel combinations of pitch and timbre of the constituent instruments. We can\njointly learn the disentangled pitch-timbre representations and a latent\ndiffusion transformer that reconstructs the mixture conditioned on the set of\nsource-level representations. We evaluate the model using both a simple dataset\nof isolated chords and a realistic four-part chorales in the style of J.S.\nBach, identify the key components for the success of disentanglement, and\ndemonstrate the application of mixture transformation based on source-level\nattribute manipulation.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lFE09A6DxAghFkuoKs5ResW380VVZGUhtNoqH6nQAow","pdfSize":"4314143"}
