{"id":"2408.13224","title":"Quadratic estimation for stochastic systems in the presence of random\n  parameter matrices, time-correlated additive noise and deception attacks","authors":"Raquel Caballero-\\'Aguila and Josefa Linares-P\\'erez","authorsParsed":[["Caballero-Águila","Raquel",""],["Linares-Pérez","Josefa",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 17:00:32 GMT"}],"updateDate":"2024-08-26","timestamp":1724432432000,"abstract":"  Networked systems usually face different random uncertainties that make the\nperformance of the least-squares (LS) linear filter decline significantly. For\nthis reason, great attention has been paid to the search for other kinds of\nsuboptimal estimators. Among them, the LS quadratic estimation approach has\nattracted considerable interest in the scientific community for its balance\nbetween computational complexity and estimation accuracy. When it comes to\nstochastic systems subject to different random uncertainties and deception\nattacks, the quadratic estimator design has not been deeply studied. In this\npaper, using covariance information, the LS quadratic filtering and fixed-point\nsmoothing problems are addressed under the assumption that the measurements are\nperturbed by a time-correlated additive noise, as well as affected by random\nparameter matrices and exposed to random deception attacks. The use of random\nparameter matrices covers a wide range of common uncertainties and random\nfailures, thus better reflecting the engineering reality. The signal and\nobservation vectors are augmented by stacking the original vectors with their\nsecond-order Kronecker powers; then, the linear estimator of the original\nsignal based on the augmented observations provides the required quadratic\nestimator. A simulation example illustrates the superiority of the proposed\nquadratic estimators over the conventional linear ones and the effect of the\ndeception attacks on the estimation performance.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}