{"id":"2408.15737","title":"TCNFormer: Temporal Convolutional Network Former for Short-Term Wind\n  Speed Forecasting","authors":"Abid Hasan Zim, Aquib Iqbal, Asad Malik, Zhicheng Dong, Hanzhou Wu","authorsParsed":[["Zim","Abid Hasan",""],["Iqbal","Aquib",""],["Malik","Asad",""],["Dong","Zhicheng",""],["Wu","Hanzhou",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 15:35:42 GMT"}],"updateDate":"2024-08-29","timestamp":1724772942000,"abstract":"  Global environmental challenges and rising energy demands have led to\nextensive exploration of wind energy technologies. Accurate wind speed\nforecasting (WSF) is crucial for optimizing wind energy capture and ensuring\nsystem stability. However, predicting wind speed remains challenging due to its\ninherent randomness, fluctuation, and unpredictability. This study proposes the\nTemporal Convolutional Network Former (TCNFormer) for short-term (12-hour) wind\nspeed forecasting. The TCNFormer integrates the Temporal Convolutional Network\n(TCN) and transformer encoder to capture the spatio-temporal features of wind\nspeed. The transformer encoder consists of two distinct attention mechanisms:\ncausal temporal multi-head self-attention (CT-MSA) and temporal external\nattention (TEA). CT-MSA ensures that the output of a step derives only from\nprevious steps, i.e., causality. Locality is also introduced to improve\nefficiency. TEA explores potential relationships between different sample\nsequences in wind speed data. This study utilizes wind speed data from the NASA\nPrediction of Worldwide Energy Resources (NASA POWER) of Patenga Sea Beach,\nChittagong, Bangladesh (latitude 22.2352{\\deg} N, longitude 91.7914{\\deg} E)\nover a year (six seasons). The findings indicate that the TCNFormer outperforms\nstate-of-the-art models in prediction accuracy. The proposed TCNFormer presents\na promising method for spatio-temporal WSF and may achieve desirable\nperformance in real-world applications of wind power systems.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CA0o5xivQ1bYpk46btv03iQqa2_wfMWicrk6eEJ0jpM","pdfSize":"3038853"}
