{"id":"2408.02631","title":"Quantum information theory on sparse wavefunctions and applications for\n  Quantum Chemistry","authors":"Davide Materia, Leonardo Ratini, Leonardo Guidoni","authorsParsed":[["Materia","Davide",""],["Ratini","Leonardo",""],["Guidoni","Leonardo",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 16:54:20 GMT"}],"updateDate":"2024-08-06","timestamp":1722876860000,"abstract":"  In recent years Quantum Computing prominently entered in the field of\nComputational Chemistry, importing and transforming computational methods and\nideas originally developed within other disciplines, such as Physics,\nMathematics and Computer Science into algorithms able to estimate quantum\nproperties of atoms and molecules on present and future quantum devices. An\nimportant role in this contamination process is attributed to Quantum\nInformation techniques, having the twofold role of contributing to the analysis\nof electron correlation and entanglements and guiding the construction of\nwavefunction variational ansatzes for the Variational Quantum Eigensolver\ntechnique.\n  This paper introduces the tool SparQ (Sparse Quantum state analysis),\ndesigned to efficiently compute fundamental quantum information theory\nobservables on post-Hartree-Fock wavefunctions sparse in their definition\nspace. The core methodology involves mapping fermionic wavefunctions to qubit\nspace using fermionic-to-qubits transformations and leveraging the sparse\nnature of these wavefunctions to evaluate observables and properties of the\nwavefunction.\n  The effectiveness of SparQ is validated by analyzing the mutual information\nmatrices of wavefunctions for the water molecule and the total entropy of $\\sim\n10^2$ qubits describing the benzene molecule. This highlights its capability to\nhandle large-scale quantum systems, limited mainly by the capabilities of\nquantum chemical methods used to retrieve the wavefunctions. The results\nindicate that quantum information theoretical analysis, so far limited to\ntraditional tensor network methods and study of transition operators, can be\napplied to all post-Hartree-Fock wavefunctions, extending their applications to\nlarger and more complex chemical systems.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"3anvKKvNCQDN9xDbVRtNDUmA-oK-JAiklBftLA8-tls","pdfSize":"801909"}
