{"id":"2408.07202","title":"Near-Field Localization with Antenna Arrays in the Presence of\n  Direction-Dependent Mutual Coupling","authors":"Zohreh Ebadi, Amir Masoud Molaei, George C. Alexandropoulos, Muhammad\n  Ali Babar Abbasi, Simon Cotton, Anvar Tukmanov and Okan Yurduseven","authorsParsed":[["Ebadi","Zohreh",""],["Molaei","Amir Masoud",""],["Alexandropoulos","George C.",""],["Abbasi","Muhammad Ali Babar",""],["Cotton","Simon",""],["Tukmanov","Anvar",""],["Yurduseven","Okan",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 21:18:26 GMT"}],"updateDate":"2024-08-15","timestamp":1723583906000,"abstract":"  Localizing near-field sources considering practical arrays is a recent\nchallenging topic for next generation wireless communication systems. Practical\nantenna array apertures with closely spaced elements exhibit\ndirection-dependent mutual coupling (MC), which can significantly degrade the\nperformance localization techniques. A conventional method for near-field\nlocalization in the presence of MC is the three-dimensional (3D) multiple\nsignal classification technique, which, however, suffers from extremely high\ncomputational complexity. Recently, two-dimensional (2D) search alternatives\nhave been presented, exhibiting increased complexity still for\ndirection-dependent MC scenarios. In this paper, we devise a low complexity\none-dimensional (1D) iterative method based on an oblique projection operator\n(IMOP) that estimates direction-dependent MC and the locations of multiple\nnear-field sources. The proposed method first estimates the initial direction\nof arrival (DOA) and MC using the approximate wavefront model, and then,\nestimates the initial range of one near-field source using the exact wavefront\nmodel. Afterwards, at each iteration, the oblique projection operator is used\nto isolate components associated with one source from those of other sources.\nThe DOA and range of this one source are estimated using the exact wavefront\nmodel and 1D searches. Finally, the direction-dependent MC is estimated for\neach pair of the estimated DOA and range. The performance of the proposed\nnear-field localization approach is comprehensively investigated and verified\nusing both a full-wave electromagnetic solver and synthetic simulations. It is\nshowcased that our IMOP scheme performs almost similarly to a state-of-the-art\napproach but with a 42 times less computational complexity.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}