{"id":"2408.11354","title":"Optical and microstructural studies of femtosecond laser treated\n  amorphous germanium thin coatings","authors":"L. Kotsedi, A. Abdelmalek, V. Bharadwaj, C.B. Mtshali, Z.Y. Nuru, B.\n  Sotillo, G. Coccia, S.M. Eaton, R. Ramponi, El-H. Amara, M. Maaza","authorsParsed":[["Kotsedi","L.",""],["Abdelmalek","A.",""],["Bharadwaj","V.",""],["Mtshali","C. B.",""],["Nuru","Z. Y.",""],["Sotillo","B.",""],["Coccia","G.",""],["Eaton","S. M.",""],["Ramponi","R.",""],["Amara","El-H.",""],["Maaza","M.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 05:46:36 GMT"}],"updateDate":"2024-08-22","timestamp":1724219196000,"abstract":"  The study of the relaxation mechanism of amorphous germanium after\nfemtosecond laser irradiation is presented in this work. In particular, a thin\ngermanium coating was deposited onto a glass substrate through the electron\nbeam vacuum coating method. The substrate was kept at room temperature during\nthe coating process, which resulted in a deposited layer characterized by an\namorphous microstructure, as observed from the X-ray diffraction. The germanium\nlayer was then irradiated with a femtosecond laser at 1030 nm wavelength, while\nvarying the net fluence from 15 J cm-2 to 90 J cm-2. Moreover, an extended two\ntemperature model was used to extract the electronic and lattice temperature of\nthe laser heated germanium coating, showing a 32% contribution from heating due\nto the thermal accumulation effect. The microstructural and morphological\nstudies of the irradiated samples were carried out using X-ray diffraction and\nhigh-resolution scanning electron microscopy. From the X-ray diffraction\nresults, it was observed that at higher laser fluence there is an emergence of\ncrystallinity on the germanium layer, with no evidence of oxidation. On the\nsurface, the morphology was observed to evolve to granular sphere, attributed\nto melting of the material. Finally, an increase in absorbance with laser\nfluence was observed and the optical band gap of the coating was calculated.\n","subjects":["Physics/Optics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"T5jUppXABKJC4ygQ7t-36nMZhOypb671ytzXPb3bJsg","pdfSize":"1100459"}
