{"id":"2408.07977","title":"Cortical network reconfiguration aligns with shifts of basal ganglia and\n  cerebellar influence","authors":"Kimberly Nestor, Javier Rasero, Richard Betzel, Peter J. Gianaros,\n  Timothy Verstynen","authorsParsed":[["Nestor","Kimberly",""],["Rasero","Javier",""],["Betzel","Richard",""],["Gianaros","Peter J.",""],["Verstynen","Timothy",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 06:43:52 GMT"}],"updateDate":"2024-08-16","timestamp":1723704232000,"abstract":"  Mammalian functional architecture flexibly adapts, transitioning from\nintegration where information is distributed across the cortex, to segregation\nwhere information is focal in densely connected communities of brain regions.\nThis flexibility in cortical brain networks is hypothesized to be driven by\ncontrol signals originating from subcortical pathways, with the basal ganglia\nshifting the cortex towards integrated processing states and the cerebellum\ntowards segregated states. In a sample of healthy human participants (N=242),\nwe used fMRI to measure temporal variation in global brain networks while\nparticipants performed two tasks with similar cognitive demands (Stroop and\nMulti-Source Inference Task (MSIT)). Using the modularity index, we determined\ncortical networks shifted from integration (low modularity) at rest to high\nmodularity during easier i.e. congruent (segregation). Increased task\ndifficulty (incongruent) resulted in lower modularity in comparison to the\neasier counterpart indicating more integration of the cortical network.\nInfluence of basal ganglia and cerebellum was measured using eigenvector\ncentrality. Results correlated with decreases and increases in cortical\nmodularity respectively, with only the basal ganglia influence preceding\ncortical integration. Our results support the theory the basal ganglia shifts\ncortical networks to integrated states due to environmental demand. Cerebellar\ninfluence correlates with shifts to segregated cortical states, though may not\nplay a causal role.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}