{"id":"2408.11884","title":"ST-USleepNet: A Spatial-Temporal Coupling Prominence Network for\n  Multi-Channel Sleep Staging","authors":"Jingying Ma, Qika Lin, Ziyu Jia, Mengling Feng","authorsParsed":[["Ma","Jingying",""],["Lin","Qika",""],["Jia","Ziyu",""],["Feng","Mengling",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 14:57:44 GMT"}],"updateDate":"2024-08-23","timestamp":1724252264000,"abstract":"  Sleep staging is critical for assessing sleep quality and diagnosing\ndisorders. Recent advancements in artificial intelligence have driven the\ndevelopment of automated sleep staging models, which still face two significant\nchallenges. 1) Simultaneously extracting prominent temporal and spatial sleep\nfeatures from multi-channel raw signals, including characteristic sleep\nwaveforms and salient spatial brain networks. 2) Capturing the spatial-temporal\ncoupling patterns essential for accurate sleep staging. To address these\nchallenges, we propose a novel framework named ST-USleepNet, comprising a\nspatial-temporal graph construction module (ST) and a U-shaped sleep network\n(USleepNet). The ST module converts raw signals into a spatial-temporal graph\nto model spatial-temporal couplings. The USleepNet utilizes a U-shaped\nstructure originally designed for image segmentation. Similar to how image\nsegmentation isolates significant targets, when applied to both raw sleep\nsignals and ST module-generated graph data, USleepNet segments these inputs to\nextract prominent temporal and spatial sleep features simultaneously. Testing\non three datasets demonstrates that ST-USleepNet outperforms existing\nbaselines, and model visualizations confirm its efficacy in extracting\nprominent sleep features and temporal-spatial coupling patterns across various\nsleep stages. The code is available at:\nhttps://github.com/Majy-Yuji/ST-USleepNet.git.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}