{"id":"2408.15012","title":"Flexible categorization using formal concept analysis and\n  Dempster-Shafer theory","authors":"Marcel Boersma, Krishna Manoorkar, Alessandra Palmigiano, Mattia\n  Panettiere, Apostolos Tzimoulis, and Nachoem Wijnberg","authorsParsed":[["Boersma","Marcel",""],["Manoorkar","Krishna",""],["Palmigiano","Alessandra",""],["Panettiere","Mattia",""],["Tzimoulis","Apostolos",""],["Wijnberg","Nachoem",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 07:28:20 GMT"}],"updateDate":"2024-08-28","timestamp":1724398100000,"abstract":"  Categorization of business processes is an important part of auditing. Large\namounts of transactional data in auditing can be represented as transactions\nbetween financial accounts using weighted bipartite graphs. We view such\nbipartite graphs as many-valued formal contexts, which we use to obtain\nexplainable categorization of these business processes in terms of financial\naccounts involved in a business process by using methods in formal concept\nanalysis. We use Dempster-Shafer mass functions to represent agendas showing\ndifferent interest in different set of financial accounts. We also model some\npossible deliberation scenarios between agents with different interrogative\nagendas to reach an aggregated agenda and categorization. The framework\ndeveloped in this paper provides a formal ground to obtain and study\nexplainable categorizations from the data represented as bipartite graphs\naccording to the agendas of different agents in an organization (e.g. an audit\nfirm), and interaction between these through deliberation. We use this\nframework to describe a machine-leaning meta algorithm for outlier detection\nand classification which can provide local and global explanations of its\nresult and demonstrate it through an outlier detection algorithm.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Of-rRnp3ng9y9wjLBC-f31WnbIgEmbD4VDp3sQrOHIk","pdfSize":"1096417"}
