{"id":"2408.17160","title":"Exploration of new 212 MAB phases: M2AB2 (M=Mo, Ta; A=Ga, Ge) via DFT\n  calculations","authors":"A. K. M Naim Ishtiaq, Md Nasir Uddin, Md. Rasel Rana, Shariful Islam,\n  Noor Afsary, Karimul Hoque, Md. Ashraf Ali","authorsParsed":[["Ishtiaq","A. K. M Naim",""],["Uddin","Md Nasir",""],["Rana","Md. Rasel",""],["Islam","Shariful",""],["Afsary","Noor",""],["Hoque","Karimul",""],["Ali","Md. Ashraf",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 10:03:25 GMT"}],"updateDate":"2024-09-02","timestamp":1725012205000,"abstract":"  The recently developed MAB phases, an extension of the MAX phase, have\nsparked interest in research among scientists because of their better\nthermo-mechanical properties. In this paper, we have explored four new MAB\nphases M2AB2 (M=Mo, Ta and A=Ga, Ge) and studied the elastic, electronic,\nthermal, and optical properties to predict the possible applications. The\nstability of the new phases has been confirmed by calculating formation energy\n(Ef), formation enthalpy (H), phonon dispersion curve (PDC), and elastic\nconstant (Cij). The study reveals that M2AB2 (M=Mo, Ta and A=Ga, Ge) exhibit\nsignificantly higher elastic constants, elastic moduli, and Vickers hardness\nvalues than their counterpart 211 borides. Higher Vickers hardness values of\nTa2AB2 (A=Ga, Ge) than Mo2AB2 (A=Ga, Ge) have been explained based on the\nvalues of the bond overlap population. The analysis of the density of states\nand electronic band structure revealed the metallic nature of the borides under\nexamination. The thermodynamic characteristics of M2AB2 (M=Mo, Ta and A=Ga, Ge)\nunder high temperatures (0 to 1000 K) are investigated using the quasi-harmonic\nDebye model. Critical thermal properties such as melting temperature (Tm),\nGruneisen parameter, minimum thermal conductivity (Kmin), Debye temperature,\nand others are also computed. Compared with 211 MAX phases, the 212 phases\nexhibit higher values of Debye temperature and Tm, along with a lower value of\nKmin. These findings suggest that the studied compounds exhibit superior\nthermal properties that are suitable for practical applications. The optical\ncharacteristics have been examined, and the reflectance spectrum indicates that\nthe materials have the potential to mitigate solar heating across various\nenergy regions.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tflYgwQvI5_kMWxaq4jOtwcArDUFOtmtO4hmcFmJkvE","pdfSize":"1704842"}
