{"id":"2408.15853","title":"An Empirical Study of API Misuses of Data-Centric Libraries","authors":"Akalanka Galappaththi, Sarah Nadi, Christoph Treude","authorsParsed":[["Galappaththi","Akalanka",""],["Nadi","Sarah",""],["Treude","Christoph",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 15:15:52 GMT"}],"updateDate":"2024-08-29","timestamp":1724858152000,"abstract":"  Developers rely on third-party library Application Programming Interfaces\n(APIs) when developing software. However, libraries typically come with\nassumptions and API usage constraints, whose violation results in API misuse.\nAPI misuses may result in crashes or incorrect behavior. Even though API misuse\nis a well-studied area, a recent study of API misuse of deep learning libraries\nshowed that the nature of these misuses and their symptoms are different from\nmisuses of traditional libraries, and as a result highlighted potential\nshortcomings of current misuse detection tools. We speculate that these\nobservations may not be limited to deep learning API misuses but may stem from\nthe data-centric nature of these APIs. Data-centric libraries often deal with\ndiverse data structures, intricate processing workflows, and a multitude of\nparameters, which can make them inherently more challenging to use correctly.\nTherefore, understanding the potential misuses of these libraries is important\nto avoid unexpected application behavior. To this end, this paper contributes\nan empirical study of API misuses of five data-centric libraries that cover\nareas such as data processing, numerical computation, machine learning, and\nvisualization. We identify misuses of these libraries by analyzing data from\nboth Stack Overflow and GitHub. Our results show that many of the\ncharacteristics of API misuses observed for deep learning libraries extend to\nmisuses of the data-centric library APIs we study. We also find that developers\ntend to misuse APIs from data-centric libraries, regardless of whether the API\ndirective appears in the documentation. Overall, our work exposes the\nchallenges of API misuse in data-centric libraries, rather than only focusing\non deep learning libraries. Our collected misuses and their characterization\nlay groundwork for future research to help reduce misuses of these libraries.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/"}