{"id":"2408.15471","title":"Phenomenological study of heavy neutral gauge boson in the left-right\n  symmetric model at future muon collider","authors":"Zongyang Lu, Jianing Qin, Honglei Li, Zhi-Long Han, Fei Huang,\n  Chun-Yuan Li, Xing-Hua Yang, and Zhong-Juan Yang","authorsParsed":[["Lu","Zongyang",""],["Qin","Jianing",""],["Li","Honglei",""],["Han","Zhi-Long",""],["Huang","Fei",""],["Li","Chun-Yuan",""],["Yang","Xing-Hua",""],["Yang","Zhong-Juan",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 01:31:21 GMT"}],"updateDate":"2024-08-29","timestamp":1724808681000,"abstract":"  The exotic neutral gauge boson is a powerful candidate for the new physics\nbeyond the standard model. As a promising model, the left-right symmetric model\nhas been proposed to explain the neutrino mass, dark matter, and\nmatter-antimatter asymmetry, etc., in which exotic gauge bosons $Z^\\prime,\nW^{\\prime \\pm}$ have been put forward as well as other new right-handed\nparticles. We investigate the $\\mu^+ \\mu^- \\to q\\bar{q} $ and $ \\mu^+ \\mu^- \\to\nl^+ l^- $ processes involving the $Z^\\prime$ boson as an intermediate particle.\nThe coupling strength, decay width and mass are the key parameters on the\nproduction and decay processes of the $Z^\\prime$ boson. The results indicate\nthat the angular distributions of final particles are sensitive to the\ncouplings of $Z^\\prime$ to the other fermions. Asymmetries defined from the\nangular distributions are ideal quantities to demonstrate the discrepancy\nbetween the standard model process and the processes with $Z^\\prime$\nparticipated and they are also appropriate observables to discriminate the\ncouplings of $Z^\\prime$ to other particles. Compared with the current results\nat the Large Hadron Collider (LHC), the future muon collider has a great\npotential to explore the new parameter space with $Z^\\prime$ boson.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}