{"id":"2408.11003","title":"DEEPEAST technique to enhance power in two-sample tests via the\n  same-attraction function","authors":"Yiting Chen, Min Gao, Wei Lin, Andrew Jirasek, Kirsty Milligan and\n  Xiaoping Shi","authorsParsed":[["Chen","Yiting",""],["Gao","Min",""],["Lin","Wei",""],["Jirasek","Andrew",""],["Milligan","Kirsty",""],["Shi","Xiaoping",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 16:55:14 GMT"}],"updateDate":"2024-08-21","timestamp":1724172914000,"abstract":"  Data depth has emerged as an invaluable nonparametric measure for the ranking\nof multivariate samples. The main contribution of depth-based two-sample\ncomparisons is the introduction of the Q statistic (Liu and Singh, 1993), a\nquality index. Unlike traditional methods, data depth does not require the\nassumption of normal distributions and adheres to four fundamental properties.\nMany existing two-sample homogeneity tests, which assess mean and/or scale\nchanges in distributions often suffer from low statistical power or\nindeterminate asymptotic distributions. To overcome these challenges, we\nintroduced a DEEPEAST (depth-explored same-attraction sample-to-sample\ncentral-outward ranking) technique for improving statistical power in\ntwo-sample tests via the same-attraction function. We proposed two novel and\npowerful depth-based test statistics: the sum test statistic and the product\ntest statistic, which are rooted in Q statistics, share a \"common attractor\"\nand are applicable across all depth functions. We further proved the asymptotic\ndistribution of these statistics for various depth functions. To assess the\nperformance of power gain, we apply three depth functions: Mahalanobis depth\n(Liu and Singh, 1993), Spatial depth (Brown, 1958; Gower, 1974), and Projection\ndepth (Liu, 1992). Through two-sample simulations, we have demonstrated that\nour sum and product statistics exhibit superior power performance, utilizing a\nstrategic block permutation algorithm and compare favourably with popular\nmethods in literature. Our tests are further validated through analysis on\nRaman spectral data, acquired from cellular and tissue samples, highlighting\nthe effectiveness of the proposed tests highlighting the effective\ndiscrimination between health and cancerous samples.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/"}