{"id":"2408.00956","title":"In-silico model of the pregnant uterus as a network of oscillators under\n  sparse adaptive control","authors":"Giuseppe Maria Ferro, Andrea Somazzi, Didier Sornette","authorsParsed":[["Ferro","Giuseppe Maria",""],["Somazzi","Andrea",""],["Sornette","Didier",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 23:36:01 GMT"}],"updateDate":"2024-08-05","timestamp":1722555361000,"abstract":"  To ensure optimal survival of the neonate, the biological timing of\nparturition must be tightly controlled. Medical studies show that a variety of\nendocrine systems play the role of a control system, establishing a dynamic\nbalance between the forces that cause uterine quiescence during pregnancy and\nthe forces that produce coordinated uterine contractility at parturition. These\ncontrol mechanism, and the factors that affect their performance, are still\npoorly understood. To help fill this gap, we propose a model of the pregnant\nuterus as a network of FitzHugh-Nagumo oscillators, with each cell symbolizing\nthe electrical activity of a myocyte. The model is augmented with sparse\nadaptive control mechanisms representing the regulating endocrine functions.\nThe control system is characterized by the fraction of controlled sites, and\nstrength of control. We quantitatively find the conditions for which the\ncontrol system exhibit a balance between robustness (resilience against\nperturbations) and flexibility (ability to switch function with minimal cost)\ncrucial for optimal neonatal survival. Specifically, we show that Braxton-Hicks\nand Alvarez contractions, which are observed sporadic contractions of the\nuterine muscle, serve as a safety valve against over-controlling, strategically\nsuppressed yet retained to optimize the control system's efficiency. Preterm\nbirth is suggested to be understood as a mis-identification of the control\nboundaries. These insights contribute to advancing our understanding of\nmaternal-fetal health.\n","subjects":["Physics/Biological Physics","Nonlinear Sciences/Adaptation and Self-Organizing Systems","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}