{"id":"2408.08359","title":"Outflows from naked singularities, infall through the black hole\n  horizon: hydrodynamic simulations of accretion in the Reissner-Nordstr\\\"om\n  space-time","authors":"W{\\l}odek Klu\\'zniak and Tomasz Krajewski","authorsParsed":[["Kluźniak","Włodek",""],["Krajewski","Tomasz",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 18:00:07 GMT"}],"updateDate":"2024-08-19","timestamp":1723744807000,"abstract":"  We performed the first simulations of accretion onto the compact objects in\nthe Reissner-Nordstr\\\"{o}m (RN) spacetime. The results obtained in general\nrelativity are representative of those for spherically symmetric naked\nsingularities and black holes in a number of modified gravity theories. A\npossible application of these calculations is to the active galactic nuclei\n(AGNs) with their powerful jets. It is now possible to compare the results of\nsuch simulations with the accreting supermassive objects in our own Milky Way\nand the nearest spiral galaxy: observations of the core regions of galactic\nnuclei (Sgr A* and M87) performed with unprecedented resolution by the Event\nHorizon Telescope (EHT) collaboration allow fairly direct tests of the\nspacetime-metric of the central compact object. In this context we present\ngeneral-relativistic hydrodynamical simulation results of accretion from an\norbiting accretion torus (with a cusp) onto a RN black hole and a RN naked\nsingularity. The results could not be more different for the two cases. For a\nblack hole, just as in the familiar Kerr/Schwarzschild case, matter overflowing\nthe cusp plunges into the black hole horizon. For the naked singularity, the\naccreting matter forms an inner structure of toroidal topology and leaves the\nsystem via powerful outflows. It is an open question whether this inner\nstructure can give rise to an image quantitatively similar to the ones reported\nby EHT for M87 and Sgr A*.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/"}