{"id":"2408.15486","title":"Compact Multi-Service Antenna for Sensing and Communication Using\n  Reconfigurable Complementary Spiral Resonator","authors":"Ali Raza, Rasool Keshavarz, Eryk Dutkiewicz, Negin Shariati","authorsParsed":[["Raza","Ali",""],["Keshavarz","Rasool",""],["Dutkiewicz","Eryk",""],["Shariati","Negin",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 02:20:10 GMT"}],"updateDate":"2024-08-29","timestamp":1724811610000,"abstract":"  In this paper, a compact multi-service antenna (MSA) is presented for sensing\nand communication using a reconfigurable complementary spiral resonator. A\nthree turns complementary spiral resonator (3-CSR) is inserted in the ground\nplane of a modified patch antenna to create a miniaturized structure. Two\nPositive-Intrinsic-Negative (PIN) diodes (D1, D2) are also integrated with the\n3-CSR to achieve frequency reconfiguration. The proposed structure operates in\nthree different modes i.e., dual-band joint communication and sensing antenna\n(JCASA), dual-band antenna, and single-band antenna. The required mode can be\nselected by changing the state of the PIN diodes. In mode-1, the first band\n(0.95-0.97 GHz) of the antenna is dedicated to sensing by using frequency\ndomain reflectometry (FDR), while the second band (1.53-1.56 GHz) is allocated\nto communication. The sensing ability of the proposed structure is utilized to\nmeasure soil moisture using FDR. Based on the frequency shift, permittivity of\nthe soil is observed to measure soil moisture. In mode-2 and mode-3, the\nstructure operates as a standard dual and single band antenna, respectively,\nwith a maximum gain of 1.5 dBi at 1.55 GHz. The proposed planar structure, with\nits simple geometry and a high sensitivity of 1.7%, is a suitable candidate for\nprecision farming. The proposed structure is versatile and capable of being\nutilized as a single or dual-band antenna and also measuring permittivity of\nmaterials within the range of 1-20. Hence, it is adaptable to a range of\napplications.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}