{"id":"2408.00848","title":"Photoevaporation of protoplanetary discs with PLUTO+PRIZMO I. Lower\n  X-ray-driven mass-loss rates due to enhanced cooling","authors":"Andrew D. Sellek, Tommaso Grassi, Giovanni Picogna, Christian Rab,\n  Cathie J. Clarke, Barbara Ercolano","authorsParsed":[["Sellek","Andrew D.",""],["Grassi","Tommaso",""],["Picogna","Giovanni",""],["Rab","Christian",""],["Clarke","Cathie J.",""],["Ercolano","Barbara",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 18:02:10 GMT"}],"updateDate":"2024-08-05","timestamp":1722535330000,"abstract":"  Context: Photoevaporation is an important process for protoplanetary disc\ndispersal but there has so far been a lack of consensus from simulations over\nthe mass-loss rates and the most important part of the high-energy spectrum for\ndriving the wind. Aims: We aim to isolate the origins of these discrepancies\nthrough carefully-benchmarked hydrodynamic simulations of X-ray\nphotoevaporation with time-dependent thermochemistry calculated on the fly.\nMethods: We conduct hydrodynamic simulations with pluto where the\nthermochemistry is calculated using prizmo. We explore the contribution of\ncertain key microphysical processes and the impact of using different spectra\nused previously in literature studies. Results: We find that additional cooling\nresults from the excitation of O by neutral H, which leads to dramatically\nreduced mass-loss across the disc compared to previous X-ray photoevaporation\nmodels, with an integrated rate of 10^-9 Msun/yr. Such rates would allow for\nlonger-lived discs than previously expected from population synthesis. An\nalternative spectrum with less soft X-ray produces mass-loss rates around a\nfactor of 2-3 times lower. The chemistry is significantly out of equilibrium,\nwith the survival of H2 into the wind aided by advection. This leads to its\nrole as the dominant coolant at 10s au - thus stabilising a larger radial\ntemperature gradient across the wind - as well as providing a possible wind\ntracer.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2u2nlZGXq4CV2b9lGBwb_s2OQtGfWY2gr4i5-dIG_l4","pdfSize":"24535761"}
