{"id":"2408.00976","title":"Controllable and Fast Growth of High-Quality Atomically Thin and\n  Atomically Flat Bi$_2$O$_2$Se Films","authors":"Yusen Feng, Pei Chen, Nian Li, Suzhe Liang, Ke Zhang, Minghui Xu, Yan\n  Zhao, Jie Gong, Shu Zhang, Huaqian Leng, Yuanyuan Zhou, Yong Wang, and Liang\n  Qiao","authorsParsed":[["Feng","Yusen",""],["Chen","Pei",""],["Li","Nian",""],["Liang","Suzhe",""],["Zhang","Ke",""],["Xu","Minghui",""],["Zhao","Yan",""],["Gong","Jie",""],["Zhang","Shu",""],["Leng","Huaqian",""],["Zhou","Yuanyuan",""],["Wang","Yong",""],["Qiao","Liang",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 02:05:11 GMT"}],"updateDate":"2024-08-05","timestamp":1722564311000,"abstract":"  As a novel and promising 2D material, bismuth oxyselenide (Bi$_2$O$_2$Se) has\ndemonstrated significant potential to overcome existing technical barriers in\nvarious electronic device applications, due to its unique physical properties\nlike high symmetry, adjustable electronic structure, ultra-high electron\nmobility. However, the rapid growth of Bi$_2$O$_2$Se films down to a few atomic\nlayers with precise control remains a significant challenge. In this work, the\ngrowth of two-dimensional (2D) Bi$_2$O$_2$Se thin films by the pulsed laser\ndeposition (PLD) method is systematically investigated. By controlling\ntemperature, oxygen pressure, laser energy density and laser emission\nfrequency, we successfully prepare atomically thin and flat Bi$_2$O$_2$Se (001)\nthin films on the (001) surface of SrTiO3. Importantly, we provide a\nfundamental and unique perspective toward understanding the growth process of\natomically thin and flat Bi$_2$O$_2$Se films, and the growth process can be\nprimarily summarized into four steps: i) anisotropic non-spontaneous nucleation\npreferentially along the step roots; ii) monolayer Bi$_2$O$_2$Se nanosheets\nexpanding across the surrounding area, and eventually covering the entire STO\nsubstrate step; iii) vertical growth of Bi$_2$O$_2$Se monolayer in a 2D\nFrank-van der Merwe (FM) epitaxial growth, and iv) with a layer-by-layer 2D FM\ngrowth mode, ultimately producing an atomically flat and epitaxially aligned\nthin film. Moreover, the combined results of the crystallinity quality, surface\nmorphology and the chemical states manifest the successful PLD-growth of\nhigh-quality Bi$_2$O$_2$Se films in a controllable and fast mode.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}