{"id":"2408.05258","title":"scASDC: Attention Enhanced Structural Deep Clustering for Single-cell\n  RNA-seq Data","authors":"Wenwen Min, Zhen Wang, Fangfang Zhu, Taosheng Xu, Shunfang Wang","authorsParsed":[["Min","Wenwen",""],["Wang","Zhen",""],["Zhu","Fangfang",""],["Xu","Taosheng",""],["Wang","Shunfang",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 09:10:36 GMT"}],"updateDate":"2024-08-13","timestamp":1723194636000,"abstract":"  Single-cell RNA sequencing (scRNA-seq) data analysis is pivotal for\nunderstanding cellular heterogeneity. However, the high sparsity and complex\nnoise patterns inherent in scRNA-seq data present significant challenges for\ntraditional clustering methods. To address these issues, we propose a deep\nclustering method, Attention-Enhanced Structural Deep Embedding Graph\nClustering (scASDC), which integrates multiple advanced modules to improve\nclustering accuracy and robustness.Our approach employs a multi-layer graph\nconvolutional network (GCN) to capture high-order structural relationships\nbetween cells, termed as the graph autoencoder module. To mitigate the\noversmoothing issue in GCNs, we introduce a ZINB-based autoencoder module that\nextracts content information from the data and learns latent representations of\ngene expression. These modules are further integrated through an attention\nfusion mechanism, ensuring effective combination of gene expression and\nstructural information at each layer of the GCN. Additionally, a\nself-supervised learning module is incorporated to enhance the robustness of\nthe learned embeddings. Extensive experiments demonstrate that scASDC\noutperforms existing state-of-the-art methods, providing a robust and effective\nsolution for single-cell clustering tasks. Our method paves the way for more\naccurate and meaningful analysis of single-cell RNA sequencing data,\ncontributing to better understanding of cellular heterogeneity and biological\nprocesses. All code and public datasets used in this paper are available at\n\\url{https://github.com/wenwenmin/scASDC} and\n\\url{https://zenodo.org/records/12814320}.\n","subjects":["Quantitative Biology/Genomics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}