{"id":"2408.06572","title":"Using $k$-means to sort spectra: electronic order mapping from scanning\n  tunneling spectroscopy measurements","authors":"V. King, Seokhwan Choi, Dong Chen, Brandon Stuart, Jisun Kim, Mohamed\n  Oudah, Jimin Kim, B. J. Kim, D. A. Bonn and S. A. Burke","authorsParsed":[["King","V.",""],["Choi","Seokhwan",""],["Chen","Dong",""],["Stuart","Brandon",""],["Kim","Jisun",""],["Oudah","Mohamed",""],["Kim","Jimin",""],["Kim","B. J.",""],["Bonn","D. A.",""],["Burke","S. A.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 02:10:11 GMT"}],"updateDate":"2024-08-14","timestamp":1723515011000,"abstract":"  Hyperspectral imaging techniques have a unique ability to probe the\ninhomogeneity of material properties whether driven by compositional variation\nor other forms of phase segregation. In the doped cuprates, iridates, and\nrelated materials, scanning tunneling microscopy/spectroscopy (STM/STS)\nmeasurements have found the emergence of pseudogap 'puddles' from the\nmacroscopically Mott insulating phase with increased doping. However,\ncategorizing this hyperspectral data by electronic order is not trivial, and\nhas often been done with ad hoc methods. In this paper we demonstrate the\nutility of $k$-means, a simple and easy-to-use unsupervised clustering method,\nas a tool for classifying heterogeneous scanning tunneling spectroscopy data by\nelectronic order for Rh-doped Sr$_2$IrO$_{4}$, a cuprate-like material. Applied\nto STM data acquired within the Mott phase, $k$-means successfully identified\nareas of Mott order and of pseudogap order. The unsupervised nature of\n$k$-means limits avenues for bias, and provides clustered spectral shapes\nwithout a priori knowledge of the physics. Additionally, we demonstrate\nsuccessful use of $k$-means as a preprocessing tool to constrain\nphenomenological function fitting. Clustering the data allows us to reduce the\nfitting parameter space, limiting over-fitting. We suggest $k$-means as a fast,\nsimple model for processing hyperspectral data on materials of mixed electronic\norder.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"rTimlKHJREx0FKKZ93cuOifhAbkCpKb8lNSyfJVVY_0","pdfSize":"8286906"}
