{"id":"2408.03996","title":"The atomic gas sequence and mass-metallicity relation from dwarfs to\n  massive galaxies","authors":"D. Scholte, A. Saintonge, J. Moustakas, B. Catinella, H. Zou, B. Dey,\n  J. Aguilar, S. Ahlen, A. Anand, R. Blum, D. Brooks, C. Circosta, T.\n  Claybaugh, A. de la Macorra, P. Doel, A. Font-Ribera, P. U. F\\\"orster, J. E.\n  Forero-Romero, E. Gazta\\~naga, S. Gontcho A Gontcho, S. Juneau, R. Kehoe, T.\n  Kisner, S. E. Koposov, A. Kremin, A. Lambert, M. Landriau, C. Maraston, P.\n  Martini, A. Meisner, A. S. Mighty, R. Miquel, A. D. Myers, J. Nie, C.\n  Poppett, F. Prada, M. Rezaie, G. Rossi, E. Sanchez, M. Schubnell, J. Silber,\n  D. Sprayberry, M. Siudek, F. Speranza, G. Tarl\\'e and B. A. Weaver","authorsParsed":[["Scholte","D.",""],["Saintonge","A.",""],["Moustakas","J.",""],["Catinella","B.",""],["Zou","H.",""],["Dey","B.",""],["Aguilar","J.",""],["Ahlen","S.",""],["Anand","A.",""],["Blum","R.",""],["Brooks","D.",""],["Circosta","C.",""],["Claybaugh","T.",""],["de la Macorra","A.",""],["Doel","P.",""],["Font-Ribera","A.",""],["Förster","P. U.",""],["Forero-Romero","J. E.",""],["Gaztañaga","E.",""],["Gontcho","S. Gontcho A",""],["Juneau","S.",""],["Kehoe","R.",""],["Kisner","T.",""],["Koposov","S. E.",""],["Kremin","A.",""],["Lambert","A.",""],["Landriau","M.",""],["Maraston","C.",""],["Martini","P.",""],["Meisner","A.",""],["Mighty","A. S.",""],["Miquel","R.",""],["Myers","A. D.",""],["Nie","J.",""],["Poppett","C.",""],["Prada","F.",""],["Rezaie","M.",""],["Rossi","G.",""],["Sanchez","E.",""],["Schubnell","M.",""],["Silber","J.",""],["Sprayberry","D.",""],["Siudek","M.",""],["Speranza","F.",""],["Tarlé","G.",""],["Weaver","B. A.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 18:00:02 GMT"}],"updateDate":"2024-08-09","timestamp":1723053602000,"abstract":"  Galaxy scaling relations provide insights into the processes that drive\ngalaxy evolution. The extension of these scaling relations into the dwarf\ngalaxy regime is of particular interest. This is because dwarf galaxies\nrepresent a crucial stage in galaxy evolution, and understanding them could\nalso shed light on their role in reionising the early Universe. There is\ncurrently no consensus on the processes that dominate the evolution of dwarfs.\nIn this work we constrain the atomic gas sequence (stellar mass vs. atomic gas\nfraction) and mass-metallicity relation (stellar mass vs. gas phase\nmetallicity) from dwarf ($10^{6.5}$ $\\textrm{M}_{\\odot}$) to massive\n($10^{11.5}$ $\\textrm{M}_{\\odot}$) galaxies in the local Universe. The combined\noptical and 21-cm spectroscopic observations of the DESI and ALFALFA surveys\nallow us to simultaneously constrain both scaling relations. We find a slope\nchange of the atomic gas sequence at a stellar mass of $\\sim 10^{9}\n~\\textrm{M}_{\\odot}$. We also find that the shape and scatter of the atomic gas\nsequence and mass-metallicity relation are strongly linked for both dwarfs and\nmore massive galaxies. Consequently, the low mass slope change of the atomic\ngas sequence is imprinted onto the mass-metallicity relation of dwarf galaxies.\nThe mass scale of the measured slope change is consistent with a predicted\nescape velocity threshold below which low mass galaxies experience significant\nsupernova-driven gas loss, as well as with a reduction in cold gas accretion\nonto more massive galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nYvEcBBtvD4rH6434PCtBItEfvkMD4iNJKxV-5k6zqo","pdfSize":"1537690"}
