{"id":"2408.04628","title":"LogogramNLP: Comparing Visual and Textual Representations of Ancient\n  Logographic Writing Systems for NLP","authors":"Danlu Chen and Freda Shi and Aditi Agarwal and Jacobo Myerston and\n  Taylor Berg-Kirkpatrick","authorsParsed":[["Chen","Danlu",""],["Shi","Freda",""],["Agarwal","Aditi",""],["Myerston","Jacobo",""],["Berg-Kirkpatrick","Taylor",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 17:58:06 GMT"}],"updateDate":"2024-08-09","timestamp":1723139886000,"abstract":"  Standard natural language processing (NLP) pipelines operate on symbolic\nrepresentations of language, which typically consist of sequences of discrete\ntokens. However, creating an analogous representation for ancient logographic\nwriting systems is an extremely labor intensive process that requires expert\nknowledge. At present, a large portion of logographic data persists in a purely\nvisual form due to the absence of transcription -- this issue poses a\nbottleneck for researchers seeking to apply NLP toolkits to study ancient\nlogographic languages: most of the relevant data are images of writing.\n  This paper investigates whether direct processing of visual representations\nof language offers a potential solution. We introduce LogogramNLP, the first\nbenchmark enabling NLP analysis of ancient logographic languages, featuring\nboth transcribed and visual datasets for four writing systems along with\nannotations for tasks like classification, translation, and parsing. Our\nexperiments compare systems that employ recent visual and text encoding\nstrategies as backbones. The results demonstrate that visual representations\noutperform textual representations for some investigated tasks, suggesting that\nvisual processing pipelines may unlock a large amount of cultural heritage data\nof logographic languages for NLP-based analyses.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}