{"id":"2408.16847","title":"Modeling the 3-point correlation function of projected scalar fields on\n  the sphere","authors":"Abraham Arvizu, Alejandro Aviles, Juan Carlos Hidalgo, Eladio Moreno,\n  Gustavo Niz, Mario A. Rodriguez-Meza, Sof\\'ia Samario, The LSST Dark Energy\n  Science Collaboration","authorsParsed":[["Arvizu","Abraham",""],["Aviles","Alejandro",""],["Hidalgo","Juan Carlos",""],["Moreno","Eladio",""],["Niz","Gustavo",""],["Rodriguez-Meza","Mario A.",""],["Samario","Sofía",""],["Collaboration","The LSST Dark Energy Science",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:24:46 GMT"}],"updateDate":"2024-09-02","timestamp":1724955886000,"abstract":"  One of the main obstacles for the signal extraction of the three point\ncorrelation function using photometric surveys, such as the Rubin Observatory\nLegacy Survey of Space and Time (LSST), will be the prohibitive computation\ntime required for dealing with a vast quantity of sources. Brute force\nalgorithms, which naively scales as $\\mathcal{O}(N^3)$ with the number of\nobjects, can be further improved with tree methods but not enough to deal with\nlarge scale correlations of Rubin's data. However, a harmonic basis\ndecomposition of these higher order statistics reduces the time dramatically,\nto scale as a two-point correlation function with the number of objects, so\nthat the signal can be extracted in a reasonable amount of time. In this work,\nwe aim to develop the framework to use these expansions within the Limber\napproximation for scalar (or spin-0) fields, such as galaxy counts, weak\nlensing convergence or aperture masses. We develop an estimator to extract the\nsignal from catalogs and different phenomenological and theoretical models for\nits description. The latter includes halo model and standard perturbation\ntheory, to which we add a simple effective field theory prescription based on\nthe short range of non-locality of cosmic fields, significantly improving the\nagreement with simulated data. In parallel to the modeling of the signal, we\ndevelop a code that can efficiently calculate three points correlations of more\nthan 200 million data points (a full sky simulation with Nside=4096) in\n$\\sim$40 minutes on a single high-performance computing node, enabling a\nfeasible analysis for the upcoming LSST data.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7amGWNsP2XQaEfJkG83Yn3b3z5LB6OVHO_9-_EpKVI0","pdfSize":"1723175"}
