{"id":"2408.10393","title":"2-process Model and Residual Abundance Analysis of the Milky Way Massive\n  Satellites","authors":"Sten Hasselquist, Christian R. Hayes, Emily J. Griffith, David\n  Weinberg, Tawny Sit, Rachael L. Beaton, Danny Horta","authorsParsed":[["Hasselquist","Sten",""],["Hayes","Christian R.",""],["Griffith","Emily J.",""],["Weinberg","David",""],["Sit","Tawny",""],["Beaton","Rachael L.",""],["Horta","Danny",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 20:22:23 GMT"}],"updateDate":"2024-08-21","timestamp":1724098943000,"abstract":"  The ``2-process Model'' is a promising technique for interpreting stellar\nchemical abundance data from large-scale surveys (e.g., SDSS-IV/V, GALAH),\nenabling more quantitative empirical studies of differences in chemical\nenrichment history between galaxies without relying on detailed yield and\nevolution models. In this work, we fit 2-process model parameters to (1) a\nluminous giant Milky Way (MW) sample and (2) stars comprising the Sagittarius\nDwarf Galaxy (Sgr). We then use these two sets of model parameters to predict\nthe abundances of 14 elements of stars belonging to the MW and in five of its\nmassive satellite galaxies, analyzing the residuals between the predicted and\nobserved abundances. We find that the model fit to (1) results in large\nresiduals (0.1-0.3 dex) for most metallicity-dependent elements in the\nmetal-rich ([Mg/H] $>$ -0.8) stars of the satellite galaxies. However, the\nmodel fit to (2) results in small or no residuals for all elements across all\nsatellite galaxies. Therefore, despite the wide variation in [X/Mg]-[Mg/H]\nabundance patterns of the satellite galaxies, the 2-process framework provides\nan accurate characterization of their abundance patterns across many elements,\nbut these multi-element patterns are systematically different between the dwarf\ngalaxy satellites and the MW disks. We consider a variety of scenarios for the\norigin of this difference, highlighting the possibility that a large inflow of\npristine gas to the MW disk diluted the metallicity of star-forming gas without\nchanging abundance ratios.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eUg75_zPAwsNu-U7PAsxwFpixfL89xhzahC7WT_3FLc","pdfSize":"6352814"}
