{"id":"2408.06696","title":"Density-gradient-driven drift waves in the solar corona","authors":"Michaela Brchnelova, MJ Pueschel, Stefaan Poedts","authorsParsed":[["Brchnelova","Michaela",""],["Pueschel","MJ",""],["Poedts","Stefaan",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 07:50:21 GMT"}],"updateDate":"2024-08-14","timestamp":1723535421000,"abstract":"  It has been suggested that under solar coronal conditions, drift waves may\ncontribute to coronal heating. Specific properties of the drift waves to be\nexpected in the solar corona have, however, not yet been determined using more\nadvanced numerical models. We investigate the linear properties of\ndensity-gradient-driven drift waves in the solar coronal plasma using\ngyrokinetic ion-electron simulations with the gyrokinetic code GENE, solving\nthe Vlasov-Maxwell equations in five dimensions assuming a simple slab\ngeometry. We determine the frequencies and growth rates of the coronal density\ngradient-driven drift waves with changing plasma parameters, such as the\nelectron \\b{eta} , the density gradient, the magnetic shear and additional\ntemperature gradients. To investigate the influence of the finite Larmor radius\neffect on the growth and structure of the modes, we also compare the\ngyrokinetic simulation results to those obtained from drift-kinetics. In most\nof the investigated conditions, the drift wave has positive growth rates that\nincrease with increasing density gradient and decreasing \\b{eta} . In the case\nof increasing magnetic shear, we find that from a certain point, the growth\nrate reaches a plateau. Depending on the considered reference environment, the\nfrequencies and growth rates of these waves lie on the order of 0.1 mHz to 1\nHz. These values correspond to the observed solar wind density fluctuations\nnear the Sun detected by WISPR, currently of unexplained origin. As a next\nstep, nonlinear simulations are required to determine the expected fluctuation\namplitudes and the plasma heating resulting from this mechanism.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Computational Physics","Physics/Plasma Physics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}