{"id":"2408.04236","title":"Cluster-Wide Task Slowdown Detection in Cloud System","authors":"Feiyi Chen, Yingying Zhang, Lunting Fan, Yuxuan Liang, Guansong Pang,\n  Qingsong Wen, Shuiguang Deng","authorsParsed":[["Chen","Feiyi",""],["Zhang","Yingying",""],["Fan","Lunting",""],["Liang","Yuxuan",""],["Pang","Guansong",""],["Wen","Qingsong",""],["Deng","Shuiguang",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 05:43:20 GMT"}],"updateDate":"2024-08-09","timestamp":1723095800000,"abstract":"  Slow task detection is a critical problem in cloud operation and maintenance\nsince it is highly related to user experience and can bring substantial\nliquidated damages. Most anomaly detection methods detect it from a single-task\naspect. However, considering millions of concurrent tasks in large-scale cloud\ncomputing clusters, it becomes impractical and inefficient. Moreover,\nsingle-task slowdowns are very common and do not necessarily indicate a\nmalfunction of a cluster due to its violent fluctuation nature in a virtual\nenvironment. Thus, we shift our attention to cluster-wide task slowdowns by\nutilizing the duration time distribution of tasks across a cluster, so that the\ncomputation complexity is not relevant to the number of tasks.\n  The task duration time distribution often exhibits compound periodicity and\nlocal exceptional fluctuations over time. Though transformer-based methods are\none of the most powerful methods to capture these time series normal variation\npatterns, we empirically find and theoretically explain the flaw of the\nstandard attention mechanism in reconstructing subperiods with low amplitude\nwhen dealing with compound periodicity.\n  To tackle these challenges, we propose SORN (i.e., Skimming Off subperiods in\ndescending amplitude order and Reconstructing Non-slowing fluctuation), which\nconsists of a Skimming Attention mechanism to reconstruct the compound\nperiodicity and a Neural Optimal Transport module to distinguish cluster-wide\nslowdowns from other exceptional fluctuations. Furthermore, since anomalies in\nthe training set are inevitable in a practical scenario, we propose a picky\nloss function, which adaptively assigns higher weights to reliable time slots\nin the training set. Extensive experiments demonstrate that SORN outperforms\nstate-of-the-art methods on multiple real-world industrial datasets.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"yWS6PvtLIJkBRWEFdkTTBlhb2Z8kJeA1iI2UgaHMBoo","pdfSize":"4111541"}
