{"id":"2408.00418","title":"Towards Reliable Advertising Image Generation Using Human Feedback","authors":"Zhenbang Du, Wei Feng, Haohan Wang, Yaoyu Li, Jingsen Wang, Jian Li,\n  Zheng Zhang, Jingjing Lv, Xin Zhu, Junsheng Jin, Junjie Shen, Zhangang Lin,\n  Jingping Shao","authorsParsed":[["Du","Zhenbang",""],["Feng","Wei",""],["Wang","Haohan",""],["Li","Yaoyu",""],["Wang","Jingsen",""],["Li","Jian",""],["Zhang","Zheng",""],["Lv","Jingjing",""],["Zhu","Xin",""],["Jin","Junsheng",""],["Shen","Junjie",""],["Lin","Zhangang",""],["Shao","Jingping",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 09:39:27 GMT"}],"updateDate":"2024-08-02","timestamp":1722505167000,"abstract":"  In the e-commerce realm, compelling advertising images are pivotal for\nattracting customer attention. While generative models automate image\ngeneration, they often produce substandard images that may mislead customers\nand require significant labor costs to inspect. This paper delves into\nincreasing the rate of available generated images. We first introduce a\nmulti-modal Reliable Feedback Network (RFNet) to automatically inspect the\ngenerated images. Combining the RFNet into a recurrent process, Recurrent\nGeneration, results in a higher number of available advertising images. To\nfurther enhance production efficiency, we fine-tune diffusion models with an\ninnovative Consistent Condition regularization utilizing the feedback from\nRFNet (RFFT). This results in a remarkable increase in the available rate of\ngenerated images, reducing the number of attempts in Recurrent Generation, and\nproviding a highly efficient production process without sacrificing visual\nappeal. We also construct a Reliable Feedback 1 Million (RF1M) dataset which\ncomprises over one million generated advertising images annotated by human,\nwhich helps to train RFNet to accurately assess the availability of generated\nimages and faithfully reflect the human feedback. Generally speaking, our\napproach offers a reliable solution for advertising image generation.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}