{"id":"2408.12331","title":"Physics of the low momentum diffusivity regime in tokamaks and its\n  experimental applicability","authors":"Haomin Sun, Justin Ball, Stephan Brunner, Anthony Field, Bhavin Patel,\n  Alessandro Balestri, Daniel Kennedy, Colin Roach, Diego Jose Cruz-Zabala,\n  Fernando Puentes Del Pozo, Eleonora Viezzer, and Manuel Garcia Munoz","authorsParsed":[["Sun","Haomin",""],["Ball","Justin",""],["Brunner","Stephan",""],["Field","Anthony",""],["Patel","Bhavin",""],["Balestri","Alessandro",""],["Kennedy","Daniel",""],["Roach","Colin",""],["Cruz-Zabala","Diego Jose",""],["Del Pozo","Fernando Puentes",""],["Viezzer","Eleonora",""],["Munoz","Manuel Garcia",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 12:19:09 GMT"}],"updateDate":"2024-08-23","timestamp":1724329149000,"abstract":"  Strong $E\\times B$ plasma flow shear is beneficial for reducing turbulent\ntransport. However, traditional methods of driving flow shear do not scale well\nto large devices such as future fusion power plants. In this paper, we use a\nlarge number of nonlinear gyrokinetic simulations to study a novel approach to\nincrease flow shear: decreasing the momentum diffusivity to make the plasma\n``easier to push''. We first use an idealized circular geometry and find that\none can obtain low momentum diffusivity at tight aspect ratio, low safety\nfactor, high magnetic shear and low temperature gradient. This is the so-called\nLow Momentum Diffusivity (LMD) regime. To drive intrinsic momentum flux, we\nthen tilt the flux surface, making it up-down asymmetric. In the LMD regime,\nthis intrinsic momentum flux drives strong flow shear that can significantly\nreduce the heat flux and increase the critical temperature gradient. We also\nconsider the actual experimental geometry of the MAST tokamak to illustrate\nthat this strategy can be practical and create experimentally significant flow\nshear. Lastly, a preliminary prediction for the SMART tokamak is made.\n","subjects":["Physics/Plasma Physics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PWP7XDlPVVDojul-VuG6m8R21TQyM5cjMFciCO7z6cI","pdfSize":"8335541"}
