{"id":"2408.09873","title":"New spectral imaging biomarkers for sepsis and mortality in intensive\n  care","authors":"Silvia Seidlitz, Katharina H\\\"olzl, Ayca von Garrel, Jan Sellner,\n  Stephan Katzenschlager, Tobias H\\\"olle, Dania Fischer, Maik von der Forst,\n  Felix C.F. Schmitt, Markus A. Weigand, Lena Maier-Hein, Maximilian Dietrich","authorsParsed":[["Seidlitz","Silvia",""],["Hölzl","Katharina",""],["von Garrel","Ayca",""],["Sellner","Jan",""],["Katzenschlager","Stephan",""],["Hölle","Tobias",""],["Fischer","Dania",""],["von der Forst","Maik",""],["Schmitt","Felix C. F.",""],["Weigand","Markus A.",""],["Maier-Hein","Lena",""],["Dietrich","Maximilian",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 10:24:57 GMT"}],"updateDate":"2024-08-20","timestamp":1724063097000,"abstract":"  With sepsis remaining a leading cause of mortality, early identification of\nseptic patients and those at high risk of death is a challenge of high\nsocioeconomic importance. The driving hypothesis of this study was that\nhyperspectral imaging (HSI) could provide novel biomarkers for sepsis diagnosis\nand treatment management due to its potential to monitor microcirculatory\nalterations. We conducted a comprehensive study involving HSI data of the palm\nand fingers from more than 480 patients on the day of their intensive care unit\n(ICU) admission. The findings demonstrate that HSI measurements can predict\nsepsis with an area under the receiver operating characteristic curve (AUROC)\nof 0.80 (95 % confidence interval (CI) [0.76; 0.84]) and mortality with an\nAUROC of 0.72 (95 % CI [0.65; 0.79]). The predictive performance improves\nsubstantially when additional clinical data is incorporated, leading to an\nAUROC of up to 0.94 (95 % CI [0.92; 0.96]) for sepsis and 0.84 (95 % CI [0.78;\n0.89]) for mortality. We conclude that HSI presents novel imaging biomarkers\nfor the rapid, non-invasive prediction of sepsis and mortality, suggesting its\npotential as an important modality for guiding diagnosis and treatment.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}