{"id":"2408.03654","title":"Unsupervised Detection of Fetal Brain Anomalies using Denoising\n  Diffusion Models","authors":"Markus Ditlev Sj{\\o}gren Olsen, Jakob Ambsdorf, Manxi Lin, Caroline\n  Taks{\\o}e-Vester, Morten Bo S{\\o}ndergaard Svendsen, Anders Nymark\n  Christensen, Mads Nielsen, Martin Gr{\\o}nneb{\\ae}k Tolsgaard, Aasa Feragen,\n  Paraskevas Pegios","authorsParsed":[["Olsen","Markus Ditlev Sjøgren",""],["Ambsdorf","Jakob",""],["Lin","Manxi",""],["Taksøe-Vester","Caroline",""],["Svendsen","Morten Bo Søndergaard",""],["Christensen","Anders Nymark",""],["Nielsen","Mads",""],["Tolsgaard","Martin Grønnebæk",""],["Feragen","Aasa",""],["Pegios","Paraskevas",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 09:40:26 GMT"}],"updateDate":"2024-08-08","timestamp":1723023626000,"abstract":"  Congenital malformations of the brain are among the most common fetal\nabnormalities that impact fetal development. Previous anomaly detection methods\non ultrasound images are based on supervised learning, rely on manual\nannotations, and risk missing underrepresented categories. In this work, we\nframe fetal brain anomaly detection as an unsupervised task using diffusion\nmodels. To this end, we employ an inpainting-based Noise Agnostic Anomaly\nDetection approach that identifies the abnormality using\ndiffusion-reconstructed fetal brain images from multiple noise levels. Our\napproach only requires normal fetal brain ultrasound images for training,\naddressing the limited availability of abnormal data. Our experiments on a\nreal-world clinical dataset show the potential of using unsupervised methods\nfor fetal brain anomaly detection. Additionally, we comprehensively evaluate\nhow different noise types affect diffusion models in the fetal anomaly\ndetection domain.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}