{"id":"2408.15286","title":"Real-time aerodynamic load estimation for hypersonics via strain-based\n  inverse maps","authors":"Julie Pham, Omar Ghattas, Noel Clemens, Karen Willcox","authorsParsed":[["Pham","Julie",""],["Ghattas","Omar",""],["Clemens","Noel",""],["Willcox","Karen",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 11:23:03 GMT"}],"updateDate":"2024-08-29","timestamp":1724498583000,"abstract":"  This work develops an efficient real-time inverse formulation for inferring\nthe aerodynamic surface pressures on a hypersonic vehicle from sparse\nmeasurements of the structural strain. The approach aims to provide real-time\nestimates of the aerodynamic loads acting on the vehicle for ground and flight\ntesting, as well as guidance, navigation, and control applications.\nSpecifically, the approach targets hypersonic flight conditions where direct\nmeasurement of the surface pressures is challenging due to the harsh\naerothermal environment. For problems employing a linear elastic structural\nmodel, we show that the inference problem can be posed as a least-squares\nproblem with a linear constraint arising from a finite element discretization\nof the governing elasticity partial differential equation. Due to the linearity\nof the problem, an explicit solution is given by the normal equations.\nPre-computation of the resulting inverse map enables rapid evaluation of the\nsurface pressure and corresponding integrated quantities, such as the force and\nmoment coefficients. The inverse approach additionally allows for uncertainty\nquantification, providing insights for theoretical recoverability and\nrobustness to sensor noise. Numerical studies demonstrate the estimator\nperformance for reconstructing the surface pressure field, as well as the force\nand moment coefficients, for the Initial Concept 3.X (IC3X) conceptual\nhypersonic vehicle.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/"}