{"id":"2408.13207","title":"Improved Recursive QAOA for Solving MAX-CUT on Bipartite Graphs","authors":"Eunok Bae and Hyukjoon Kwon and V Vijendran and Soojoon Lee","authorsParsed":[["Bae","Eunok",""],["Kwon","Hyukjoon",""],["Vijendran","V",""],["Lee","Soojoon",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 16:35:47 GMT"}],"updateDate":"2024-08-26","timestamp":1724430947000,"abstract":"  Quantum Approximate Optimization Algorithm (QAOA) is a quantum-classical\nhybrid algorithm proposed with the goal of approximately solving combinatorial\noptimization problems such as the MAX-CUT problem. It has been considered a\npotential candidate for achieving quantum advantage in the Noisy\nIntermediate-Scale Quantum (NISQ) era and has been extensively studied.\nHowever, the performance limitations of low-level QAOA have also been\ndemonstrated across various instances. In this work, we first analytically\nprove the performance limitations of level-1 QAOA in solving the MAX-CUT\nproblem on bipartite graphs. We derive an upper bound for the approximation\nratio based on the average degree of bipartite graphs. Second, we show through\nnumerical results that solving the same problem using level-1 Recursive QAOA\n(RQAOA), which is one of the variants of QAOA that uses QAOA as a subroutine to\nreduce the graph size recursively, outperforms the original QAOA but still\nexhibits limitations as the graph size increases. To address these limitations,\nwe propose a modified RQAOA that reduces the parameter regime optimized in the\nQAOA subroutine. While reducing the optimization space could generally make it\nmore challenging to find the true optimal parameters, interestingly, we prove\nthat this modified RQAOA can find the exact maximum cut for a parity\npartitioned graph which includes all weighted bipartite graphs.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FYO4u5uW6kzQsKSHtURdmF6fMs1fGMnt9ub9Lb7q0i8","pdfSize":"910313"}
