{"id":"2408.09131","title":"Thin-Plate Spline-based Interpolation for Animation Line Inbetweening","authors":"Tianyi Zhu, Wei Shang, Dongwei Ren, Wangmeng Zuo","authorsParsed":[["Zhu","Tianyi",""],["Shang","Wei",""],["Ren","Dongwei",""],["Zuo","Wangmeng",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 08:05:31 GMT"}],"updateDate":"2024-08-20","timestamp":1723881931000,"abstract":"  Animation line inbetweening is a crucial step in animation production aimed\nat enhancing animation fluidity by predicting intermediate line arts between\ntwo key frames. However, existing methods face challenges in effectively\naddressing sparse pixels and significant motion in line art key frames. In\nliterature, Chamfer Distance (CD) is commonly adopted for evaluating\ninbetweening performance. Despite achieving favorable CD values, existing\nmethods often generate interpolated frames with line disconnections, especially\nfor scenarios involving large motion. Motivated by this observation, we propose\na simple yet effective interpolation method for animation line inbetweening\nthat adopts thin-plate spline-based transformation to estimate coarse motion\nmore accurately by modeling the keypoint correspondence between two key frames,\nparticularly for large motion scenarios. Building upon the coarse estimation, a\nmotion refine module is employed to further enhance motion details before final\nframe interpolation using a simple UNet model. Furthermore, to more accurately\nassess the performance of animation line inbetweening, we refine the CD metric\nand introduce a novel metric termed Weighted Chamfer Distance, which\ndemonstrates a higher consistency with visual perception quality. Additionally,\nwe incorporate Earth Mover's Distance and conduct user study to provide a more\ncomprehensive evaluation. Our method outperforms existing approaches by\ndelivering high-quality interpolation results with enhanced fluidity. The code\nis available at \\url{https://github.com/Tian-one/tps-inbetween}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}