{"id":"2408.03580","title":"Atom-Field-Medium Interactions I: Graded Influence Actions for $N$\n  Harmonic Atoms in a Dielectric-Altered Quantum Field","authors":"Jen-Tsung Hsiang and Bei-Lok Hu","authorsParsed":[["Hsiang","Jen-Tsung",""],["Hu","Bei-Lok",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 06:33:27 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 16:20:05 GMT"}],"updateDate":"2024-08-16","timestamp":1723012407000,"abstract":"  This series of papers has two broader aims: 1) Construct a theory for\nmulti-partite open quantum systems comprising several layers of structure with\nself-consistent back-actions. Develop the graded influence action formalism\n\\cite{BehHu10,BH11} to account for the influences of successive sub-layers on\nthe dynamics of the variables of interest. 2) Apply these methods to the study\nof atom-field-medium interactions and highlight their merits over conventional\nmethods. We consider a system of $N$ harmonic oscillators, modeling the\ninternal degrees of freedom (idf) of $N$ neutral atoms (A), interacting with a\nquantum field (F), scalar here, for simplicity, altered by the presence of a\ndielectric medium (M). In this paper we use the coarse-grained and stochastic\neffective actions in the influence functional formalism to derive the\nstochastic equations for the reduced density matrices of the dynamical\nvariables in the successive layers of structure. The word `graded' refers to\nthe specific ordering of the coarse-graining procedures. Three layers of\ncoarse-graining are performed, firstly, integrating over the common bath of the\ndielectric oscillators results not only in the appearance of necessary\ndissipative properties of the dielectric but also essential nuanced features\nsuch as nonMarkovian spatial correlations in the dielectric. Secondly,\nintegrating over the medium variables as a whole results in a\ndielectric-modified quantum field, the influence of the medium on the quantum\nfield manifesting through a frequency-dependent permittivity function. Finally,\nintegrating over this dielectric-altered quantum field which interacts with the\nidfs of the atoms yields an influence action. From it we obtain the stochastic\nequation of motion which describes the nonequilibrium stochastic dynamics of\nthe idf of the atoms interacting with a dielectric medium-modified quantum\nfield.\n","subjects":["Physics/High Energy Physics - Theory","Condensed Matter/Statistical Mechanics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}