{"id":"2408.07817","title":"MyoGestic: EMG Interfacing Framework for Decoding Multiple Spared\n  Degrees of Freedom of the Hand in Individuals with Neural Lesions","authors":"Raul C. S\\^impetru, Dominik I. Braun, Arndt U. Simon, Michael M\\\"arz,\n  Vlad Cnejevici, Daniela Souza de Oliveira, Nico Weber, Jonas Walter, J\\\"org\n  Franke, Daniel H\\\"oglinger, Cosima Prahm, Matthias Ponfick, and Alessandro\n  Del Vecchio","authorsParsed":[["Sîmpetru","Raul C.",""],["Braun","Dominik I.",""],["Simon","Arndt U.",""],["März","Michael",""],["Cnejevici","Vlad",""],["de Oliveira","Daniela Souza",""],["Weber","Nico",""],["Walter","Jonas",""],["Franke","Jörg",""],["Höglinger","Daniel",""],["Prahm","Cosima",""],["Ponfick","Matthias",""],["Del Vecchio","Alessandro",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 21:12:00 GMT"}],"updateDate":"2024-08-16","timestamp":1723669920000,"abstract":"  Restoring limb motor function in individuals with spinal cord injury (SCI),\nstroke, or amputation remains a critical challenge, one which affects millions\nworldwide. Recent studies show through surface electromyography (EMG) that\nspared motor neurons can still be voluntarily controlled, even without visible\nlimb movement . These signals can be decoded and used for motor intent\nestimation; however, current wearable solutions lack the necessary hardware and\nsoftware for intuitive interfacing of the spared degrees of freedom after\nneural injuries. To address these limitations, we developed a wireless,\nhigh-density EMG bracelet, coupled with a novel software framework, MyoGestic.\nOur system allows rapid and tailored adaptability of machine learning models to\nthe needs of the users, facilitating real-time decoding of multiple spared\ndistinctive degrees of freedom. In our study, we successfully decoded the motor\nintent from two participants with SCI, two with spinal stroke , and three\namputees in real-time, achieving several controllable degrees of freedom within\nminutes after wearing the EMG bracelet. We provide a proof-of-concept that\nthese decoded signals can be used to control a digitally rendered hand, a\nwearable orthosis, a prosthesis, or a 2D cursor. Our framework promotes a\nparticipant-centered approach, allowing immediate feedback integration, thus\nenhancing the iterative development of myocontrol algorithms. The proposed\nopen-source software framework, MyoGestic, allows researchers and patients to\nfocus on the augmentation and training of the spared degrees of freedom after\nneural lesions, thus potentially bridging the gap between research and clinical\napplication and advancing the development of intuitive EMG interfaces for\ndiverse neural lesions.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}