{"id":"2408.09682","title":"Simulating Field Experiments with Large Language Models","authors":"Yaoyu Chen, Yuheng Hu, Yingda Lu","authorsParsed":[["Chen","Yaoyu",""],["Hu","Yuheng",""],["Lu","Yingda",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 03:41:43 GMT"}],"updateDate":"2024-08-20","timestamp":1724038903000,"abstract":"  Prevailing large language models (LLMs) are capable of human responses\nsimulation through its unprecedented content generation and reasoning\nabilities. However, it is not clear whether and how to leverage LLMs to\nsimulate field experiments. In this paper, we propose and evaluate two\nprompting strategies: the observer mode that allows a direct prediction on main\nconclusions and the participant mode that simulates distributions of responses\nfrom participants. Using this approach, we examine fifteen well cited field\nexperimental papers published in INFORMS and MISQ, finding encouraging\nalignments between simulated experimental results and the actual results in\ncertain scenarios. We further identify topics of which LLMs underperform,\nincluding gender difference and social norms related research. Additionally,\nthe automatic and standardized workflow proposed in this paper enables the\npossibility of a large-scale screening of more papers with field experiments.\nThis paper pioneers the utilization of large language models (LLMs) for\nsimulating field experiments, presenting a significant extension to previous\nwork which focused solely on lab environments. By introducing two novel\nprompting strategies, observer and participant modes, we demonstrate the\nability of LLMs to both predict outcomes and replicate participant responses\nwithin complex field settings. Our findings indicate a promising alignment with\nactual experimental results in certain scenarios, achieving a stimulation\naccuracy of 66% in observer mode. This study expands the scope of potential\napplications for LLMs and illustrates their utility in assisting researchers\nprior to engaging in expensive field experiments. Moreover, it sheds light on\nthe boundaries of LLMs when used in simulating field experiments, serving as a\ncautionary note for researchers considering the integration of LLMs into their\nexperimental toolkit.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kluSc-xsQWRIkecSFiMaLdEvNeA4Z4sYEHR2K2sjL1U","pdfSize":"1663333"}
