{"id":"2408.08835","title":"Altermagnetism in the layered intercalated transition metal\n  dichalcogenide CoNb$_4$Se$_8$","authors":"Resham Babu Regmi, Hari Bhandari, Bishal Thapa, Yiqing Hao, Nileema\n  Sharma, James McKenzie, Xinglong Chen, Abhijeet Nayak, Mohamed El Gazzah,\n  Bence G\\'abor M\\'arkus, L\\'aszl\\'o Forr\\'o, Xiaolong Liu, Huibo Cao, J.F.\n  Mitchell, I. I. Mazin and Nirmal J. Ghimire","authorsParsed":[["Regmi","Resham Babu",""],["Bhandari","Hari",""],["Thapa","Bishal",""],["Hao","Yiqing",""],["Sharma","Nileema",""],["McKenzie","James",""],["Chen","Xinglong",""],["Nayak","Abhijeet",""],["Gazzah","Mohamed El",""],["Márkus","Bence Gábor",""],["Forró","László",""],["Liu","Xiaolong",""],["Cao","Huibo",""],["Mitchell","J. F.",""],["Mazin","I. I.",""],["Ghimire","Nirmal J.",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 16:39:06 GMT"}],"updateDate":"2024-08-19","timestamp":1723826346000,"abstract":"  Altermagnets (AMs) are a new class of magnetic materials that combine the\nbeneficial spintronics properties of ferromagnets and antiferromagnets,\ngarnering significant attention recently. Here, we have identified\naltermagnetism in a layered intercalated transition metal diselenide,\nCoNb$_4$Se$_8$, which crystallizes with an ordered sublattice of intercalated\nCo atoms between NbSe$_2$ layers. Single crystals are synthesized, and the\nstructural characterizations are performed using single crystal diffraction and\nscanning tunneling microscopy. Magnetic measurements reveal easy-axis\nantiferromagnetism below 168 K. Density functional theory (DFT) calculations\nindicate that A-type antiferromagnetic ordering with easy-axis spin direction\nis the ground state, which is verified through single crystal neutron\ndiffraction experiments. Electronic band structure calculations in this\nmagnetic state display spin-split bands, confirming altermagnetism in this\ncompound. The layered structure of CoNb$_4$Se$_8$ presents a promising platform\nfor testing various predicted properties associated with altermagnetism.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}