{"id":"2408.05395","title":"The evolution of systems biology and systems medicine: From mechanistic\n  models to uncertainty quantification","authors":"Lingxia Qiao, Ali Khalilimeybodi, Nathaniel J Linden-Santangeli and\n  Padmini Rangamani","authorsParsed":[["Qiao","Lingxia",""],["Khalilimeybodi","Ali",""],["Linden-Santangeli","Nathaniel J",""],["Rangamani","Padmini",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 00:50:06 GMT"}],"updateDate":"2024-08-13","timestamp":1723251006000,"abstract":"  Understanding the mechanisms of interactions within cells, tissues, and\norganisms is crucial to driving developments across biology and medicine.\nMathematical modeling is an essential tool for simulating biological systems\nand revealing biochemical regulatory mechanisms. Building on experiments,\nmechanistic models are widely used to describe small-scale intracellular\nnetworks and uncover biochemical mechanisms in healthy and diseased states. The\nrapid development of high-throughput sequencing techniques and computational\ntools has recently enabled models that span multiple scales, often integrating\nsignaling, gene regulatory, and metabolic networks. These multiscale models\nenable comprehensive investigations of cellular networks and thus reveal\npreviously unknown disease mechanisms and pharmacological interventions. Here,\nwe review systems biology models from classical mechanistic models to larger,\nmultiscale models that integrate multiple layers of cellular networks. We\nintroduce several examples of models of hypertrophic cardiomyopathy, exercise,\nand cancer cell proliferation. Additionally, we discuss methods that increase\nthe certainty and accuracy of model predictions. Integrating multiscale models\nhas become a powerful tool for understanding disease and inspiring drug\ndiscoveries by incorporating omics data within the cell and across tissues and\norganisms.\n","subjects":["Quantitative Biology/Molecular Networks","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"1WricEFhHut2b7AuPYSsFx54MAjmWCpPvzcLt_0RefY","pdfSize":"2415880"}
