{"id":"2408.16077","title":"Causal Priors and Their Influence on Judgements of Causality in\n  Visualized Data","authors":"Arran Zeyu Wang, David Borland, Tabitha C. Peck, Wenyuan Wang, David\n  Gotz","authorsParsed":[["Wang","Arran Zeyu",""],["Borland","David",""],["Peck","Tabitha C.",""],["Wang","Wenyuan",""],["Gotz","David",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:20:13 GMT"}],"updateDate":"2024-08-30","timestamp":1724869213000,"abstract":"  \"Correlation does not imply causation\" is a famous mantra in statistical and\nvisual analysis. However, consumers of visualizations often draw causal\nconclusions when only correlations between variables are shown. In this paper,\nwe investigate factors that contribute to causal relationships users perceive\nin visualizations. We collected a corpus of concept pairs from variables in\nwidely used datasets and created visualizations that depict varying correlative\nassociations using three typical statistical chart types. We conducted two\nMTurk studies on (1) preconceived notions on causal relations without charts,\nand (2) perceived causal relations with charts, for each concept pair. Our\nresults indicate that people make assumptions about causal relationships\nbetween pairs of concepts even without seeing any visualized data. Moreover,\nour results suggest that these assumptions constitute causal priors that, in\ncombination with visualized association, impact how data visualizations are\ninterpreted. The results also suggest that causal priors may lead to over- or\nunder-estimation in perceived causal relations in different circumstances, and\nthat those priors can also impact users' confidence in their causal\nassessments. In addition, our results align with prior work, indicating that\nchart type may also affect causal inference. Using data from the studies, we\ndevelop a model to capture the interaction between causal priors and visualized\nassociations as they combine to impact a user's perceived causal relations. In\naddition to reporting the study results and analyses, we provide an open\ndataset of causal priors for 56 specific concept pairs that can serve as a\npotential benchmark for future studies. We also suggest remaining challenges\nand heuristic-based guidelines to help designers improve visualization design\nchoices to better support visual causal inference.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}