{"id":"2408.17277","title":"On the key kinetic interactions between NOx and unsaturated\n  hydrocarbons: H-atom abstraction from C3-C7 alkynes and dienes by NO2","authors":"Zhengyan Guo, Hongqing Wu, Ruoyue Tang, Xinrui Ren, Ting Zhang,\n  Mingrui Wang, Guojie Liang, Hengjie Guo, Song Cheng","authorsParsed":[["Guo","Zhengyan",""],["Wu","Hongqing",""],["Tang","Ruoyue",""],["Ren","Xinrui",""],["Zhang","Ting",""],["Wang","Mingrui",""],["Liang","Guojie",""],["Guo","Hengjie",""],["Cheng","Song",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 13:25:13 GMT"}],"updateDate":"2024-09-02","timestamp":1725024313000,"abstract":"  An adequate understanding of NOx interacting chemistry is a prerequisite for\na smoother transition to carbon lean and carbon free fuels such as ammonia and\nhydrogen. In this regard, this study presents a comprehensive study on the H\natom abstraction by NO2 from C3 to C7 alkynes and dienes forming 3 HNO2 isomers\n(i.e., TRANS HONO, HNO2, and CIS HONO), encompassing 8 hydrocarbons and 24\nreactions. Through a combination of high level quantum chemistry computation,\nthe rate coefficients for all studied reactions, over a temperature range from\n298 to 2000 K, are computed based on Transition State Theory using the Master\nEquation System Solver program with considering unsymmetric tunneling\ncorrections. Comprehensive analysis of branching ratios elucidates the\ndiversity and similarities between different species, different HNO2 isomers,\nand different abstraction sites. Incorporating the calculated rate parameters\ninto a recent chemistry model reveals the significant influences of this type\nof reaction on model performance, where the updated model is consistently more\nreactive for all the alkynes and dienes studied in predicting autoignition\ncharacteristics. Sensitivity and flux analyses are further conducted, through\nwhich the importance of H atom abstractions by NO2 is highlighted. With the\nupdated rate parameters, the branching ratios in fuel consumption clearly\nshifts towards H atom abstractions by NO2 while away from H atom abstractions\nby OH. The obtained results emphasize the need for adequately representing\nthese kinetics in new alkyne and diene chemistry models to be developed by\nusing the rate parameters determined in this study, and call for future efforts\nto experimentally investigate NO2 blending effects on alkynes and dienes.\n","subjects":["Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}