{"id":"2408.12088","title":"Mental-Perceiver: Audio-Textual Multimodal Learning for Mental Health\n  Assessment","authors":"Jinghui Qin, Changsong Liu, Tianchi Tang, Dahuang Liu, Minghao Wang,\n  Qianying Huang, Yang Xu, Rumin Zhang","authorsParsed":[["Qin","Jinghui",""],["Liu","Changsong",""],["Tang","Tianchi",""],["Liu","Dahuang",""],["Wang","Minghao",""],["Huang","Qianying",""],["Xu","Yang",""],["Zhang","Rumin",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 02:54:52 GMT"}],"updateDate":"2024-08-23","timestamp":1724295292000,"abstract":"  Mental disorders, such as anxiety and depression, have become a global issue\nthat affects the regular lives of people across different ages. Without proper\ndetection and treatment, anxiety and depression can hinder the sufferer's\nstudy, work, and daily life. Fortunately, recent advancements of digital and AI\ntechnologies provide new opportunities for better mental health care and many\nefforts have been made in developing automatic anxiety and depression\nassessment techniques. However, this field still lacks a publicly available\nlarge-scale dataset that can facilitate the development and evaluation of\nAI-based techniques. To address this limitation, we have constructed a new\nlarge-scale \\textbf{M}ulti-\\textbf{M}odal \\textbf{Psy}chological assessment\ncorpus (MMPsy) on anxiety and depression assessment of Mandarin-speaking\nadolescents. The MMPsy contains audios and extracted transcripts of responses\nfrom automated anxiety or depression assessment interviews along with the\nself-reported anxiety or depression evaluations of the participants using\nstandard mental health assessment questionnaires. Our dataset contains over\n7,700 post-processed recordings of interviews for anxiety assessment and over\n4,200 recordings for depression assessment. Using this dataset, we have\ndeveloped a novel deep-learning based mental disorder estimation model, named\n\\textbf{Mental-Perceiver}, to detect anxious/depressive mental states from\nrecorded audio and transcript data. Extensive experiments on our MMPsy and the\ncommonly-used DAIC-WOZ datasets have shown the effectiveness and superiority of\nour proposed Mental-Perceiver model in anxiety and depression detection. The\nMMPsy dataset will be made publicly available later to facilitate the research\nand development of AI-based techniques in the mental health care field.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}