{"id":"2408.08892","title":"Leveraging Large Language Models for Enhanced Process Model\n  Comprehension","authors":"Humam Kourani, Alessandro Berti, Jasmin Henrich, Wolfgang Kratsch,\n  Robin Weidlich, Chiao-Yun Li, Ahmad Arslan, Daniel Schuster, Wil M.P. van der\n  Aalst","authorsParsed":[["Kourani","Humam",""],["Berti","Alessandro",""],["Henrich","Jasmin",""],["Kratsch","Wolfgang",""],["Weidlich","Robin",""],["Li","Chiao-Yun",""],["Arslan","Ahmad",""],["Schuster","Daniel",""],["van der Aalst","Wil M. P.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 13:12:46 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 06:38:36 GMT"}],"updateDate":"2024-08-22","timestamp":1723122766000,"abstract":"  In Business Process Management (BPM), effectively comprehending process\nmodels is crucial yet poses significant challenges, particularly as\norganizations scale and processes become more complex. This paper introduces a\nnovel framework utilizing the advanced capabilities of Large Language Models\n(LLMs) to enhance the interpretability of complex process models. We present\ndifferent methods for abstracting business process models into a format\naccessible to LLMs, and we implement advanced prompting strategies specifically\ndesigned to optimize LLM performance within our framework. Additionally, we\npresent a tool, AIPA, that implements our proposed framework and allows for\nconversational process querying. We evaluate our framework and tool by i) an\nautomatic evaluation comparing different LLMs, model abstractions, and\nprompting strategies and ii) a user study designed to assess AIPA's\neffectiveness comprehensively. Results demonstrate our framework's ability to\nimprove the accessibility and interpretability of process models, pioneering\nnew pathways for integrating AI technologies into the BPM field.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BoDEYCTSdS94cTusYC2XKjsow0q3R58_b7wOoEgneyc","pdfSize":"1066221"}
