{"id":"2408.09616","title":"Convolutional Neural Network Approach for Emitter Association using\n  Channel Identification in a MIMO System based on Propagation Features","authors":"Michael F. Talley Jr., Kofi Nyarko, Willie L. Thompson II, Arlene\n  Cole-Rhodes, and Craig Scott","authorsParsed":[["Talley","Michael F.","Jr."],["Nyarko","Kofi",""],["Thompson","Willie L.","II"],["Cole-Rhodes","Arlene",""],["Scott","Craig",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 00:03:14 GMT"}],"updateDate":"2024-08-20","timestamp":1724025794000,"abstract":"  In this paper, an application of a 1D deep convolutional neural network\n(DCNN) and 4x4 1D DCNN Multi-channel Model (DCNN-MCM) was developed to predict\nthe probability of a channel being associated with a given transmitter for each\nemitter in a 4x4 multi-input multi-output (MIMO) system. Counterintuitively,\ncompared to the traditional approach to emitter association (EA), this research\nargues for the identification of received RF signals based on channel features\n(CFs) such as the channel impulse response (CIR) and transfer function (TF).\nBased on the CFs there are unique properties per transmit and receive pair that\ncan be used to identify the different transmitters. More specifically, CFs are\noften defined by a wide sense stationary (WSS) stochastic process which gives\nthem unique properties such as, being statistically independent and reciprocal\nfor emitter association. Given these CFs, the received RF signals can be used\nto measure the clutter and objects surrounding the emitters. Safely assuming\nthe surrounding clutter and objects are unique to each emitter, the estimation\nand tracking of this clutter provides a way of identifying what emitter is\ntransmitting the observed signal. This method successfully classifies and\nidentifies the emitters at 97.22% and 88.89% accuracy for the DCNN and DCNN-MCM\nrespectively. This method was further compared with the accuracy of previous\nmethods to test the validity of the approach and future improvements.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}