{"id":"2408.07628","title":"Embodied Biocomputing Sequential Circuits with Data Processing and\n  Storage for Neurons-on-a-chip","authors":"Giulio Basso and Reinhold Scherer and Michael Taynnan Barros","authorsParsed":[["Basso","Giulio",""],["Scherer","Reinhold",""],["Barros","Michael Taynnan",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 15:54:00 GMT"}],"updateDate":"2024-08-15","timestamp":1723650840000,"abstract":"  With conventional silicon-based computing approaching its physical and\nefficiency limits, biocomputing emerges as a promising alternative. This\napproach utilises biomaterials such as DNA and neurons as an interesting\nalternative to data processing and storage. This study explores the potential\nof neuronal biocomputing to rival silicon-based systems. We explore neuronal\nlogic gates and sequential circuits that mimic conventional computer\narchitectures. Through mathematical modelling, optimisation, and computer\nsimulation, we demonstrate the operational capabilities of neuronal sequential\ncircuits. These circuits include a neuronal NAND gate, SR Latch flip-flop, and\nD flip-flop memory units. Our approach involves manipulating neuron\ncommunication, synaptic conductance, spike buffers, neuron types, and specific\nneuronal network topology designs. The experiments demonstrate the practicality\nof encoding binary information using patterns of neuronal activity and\novercoming synchronization difficulties with neuronal buffers and inhibition\nstrategies. Our results confirm the effectiveness and scalability of neuronal\nlogic circuits, showing that they maintain a stable metabolic burden even in\ncomplex data storage configurations. Our study not only demonstrates the\nconcept of embodied biocomputing by manipulating neuronal properties for\ndigital signal processing but also establishes the foundation for cutting-edge\nbiocomputing technologies. Our designs open up possibilities for using neurons\nas energy-efficient computing solutions. These solutions have the potential to\nbecome an alternate to silicon-based systems by providing a carbon-neutral,\nbiologically feasible alternative.\n","subjects":["Computing Research Repository/Emerging Technologies","Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}