{"id":"2408.14943","title":"Stability of the Einstein Static Universe in Zero-Point Length Cosmology\n  with Topological Defects","authors":"Kalyan Bhuyan and Mrinnoy M. Gohain","authorsParsed":[["Bhuyan","Kalyan",""],["Gohain","Mrinnoy M.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 10:34:14 GMT"}],"updateDate":"2024-08-28","timestamp":1724754854000,"abstract":"  Non-singular cosmological models, particularly the idea of emergent cosmology\nhave been explored to describe the non-singular origin of the Universe.\nRecently, zero-point length cosmology has shown some positive insights into\nsome non-singular aspects of the early Universe. In addition, topological\ndefects are well-known for their major impact on the early Universe and may\nplay a significant role by its presence as a part of the energy content of the\nUniverse. We investigate the stability of the Einstein static phase of the\nemergent Universe scenario in a generalized framework of zero-point length\ncosmology in the presence of topological defects in the very early Universe. We\nderive the modified Friedmann equations, where the energy momentum tensor\nincludes an extra energy density term arising from $n$-dimensional topological\ndefects. We study the possibility of graceful exit of the Einstein Static\nUniverse (ESU) into the standard inflationary cosmology and its stability on\nthe basis of dynamical system analysis. We also study the stability of the ESU\nagainst homogeneous scalar perturbation and also its possible graceful exit\nmechanism. We analyse the stability of the ESU against density, vector and\ntensor perturbations. Through the stability analysis, it has been shown that\nindeed the model parameters associated with zero-point length setting and\n$n$-dimensional topological defects play a visible role in the graceful exit\nmechanism of the ESU to the standard inflationary Universe. Also, interestingly\nit is found that there exists a mutual interplay between the zero-point length\nparameter, and the dimension of topological defect on the stability of the ESU\non the basis of inhomogeneous density perturbation. Finally, the stability is\nalso tested against vector and tensor perturbation, which shows that the ESU is\nstable against such perturbations.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/"}