{"id":"2408.17090","title":"FissionVAE: Federated Non-IID Image Generation with Latent Space and\n  Decoder Decomposition","authors":"Chen Hu, Jingjing Deng, Xianghua Xie, Xiaoke Ma","authorsParsed":[["Hu","Chen",""],["Deng","Jingjing",""],["Xie","Xianghua",""],["Ma","Xiaoke",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 08:22:30 GMT"}],"updateDate":"2024-09-02","timestamp":1725006150000,"abstract":"  Federated learning is a machine learning paradigm that enables decentralized\nclients to collaboratively learn a shared model while keeping all the training\ndata local. While considerable research has focused on federated image\ngeneration, particularly Generative Adversarial Networks, Variational\nAutoencoders have received less attention. In this paper, we address the\nchallenges of non-IID (independently and identically distributed) data\nenvironments featuring multiple groups of images of different types.\nSpecifically, heterogeneous data distributions can lead to difficulties in\nmaintaining a consistent latent space and can also result in local generators\nwith disparate texture features being blended during aggregation. We introduce\na novel approach, FissionVAE, which decomposes the latent space and constructs\ndecoder branches tailored to individual client groups. This method allows for\ncustomized learning that aligns with the unique data distributions of each\ngroup. Additionally, we investigate the incorporation of hierarchical VAE\narchitectures and demonstrate the use of heterogeneous decoder architectures\nwithin our model. We also explore strategies for setting the latent prior\ndistributions to enhance the decomposition process. To evaluate our approach,\nwe assemble two composite datasets: the first combines MNIST and FashionMNIST;\nthe second comprises RGB datasets of cartoon and human faces, wild animals,\nmarine vessels, and remote sensing images of Earth. Our experiments demonstrate\nthat FissionVAE greatly improves generation quality on these datasets compared\nto baseline federated VAE models.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}