{"id":"2408.14244","title":"Cascaded Temporal Updating Network for Efficient Video Super-Resolution","authors":"Hao Li, Jiangxin Dong, Jinshan Pan","authorsParsed":[["Li","Hao",""],["Dong","Jiangxin",""],["Pan","Jinshan",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 12:59:32 GMT"}],"updateDate":"2024-08-27","timestamp":1724677172000,"abstract":"  Existing video super-resolution (VSR) methods generally adopt a recurrent\npropagation network to extract spatio-temporal information from the entire\nvideo sequences, exhibiting impressive performance. However, the key components\nin recurrent-based VSR networks significantly impact model efficiency, e.g.,\nthe alignment module occupies a substantial portion of model parameters, while\nthe bidirectional propagation mechanism significantly amplifies the inference\ntime. Consequently, developing a compact and efficient VSR method that can be\ndeployed on resource-constrained devices, e.g., smartphones, remains\nchallenging. To this end, we propose a cascaded temporal updating network\n(CTUN) for efficient VSR. We first develop an implicit cascaded alignment\nmodule to explore spatio-temporal correspondences from adjacent frames.\nMoreover, we propose a unidirectional propagation updating network to\nefficiently explore long-range temporal information, which is crucial for\nhigh-quality video reconstruction. Specifically, we develop a simple yet\neffective hidden updater that can leverage future information to update hidden\nfeatures during forward propagation, significantly reducing inference time\nwhile maintaining performance. Finally, we formulate all of these components\ninto an end-to-end trainable VSR network. Extensive experimental results show\nthat our CTUN achieves a favorable trade-off between efficiency and performance\ncompared to existing methods. Notably, compared with BasicVSR, our method\nobtains better results while employing only about 30% of the parameters and\nrunning time. The source code and pre-trained models will be available at\nhttps://github.com/House-Leo/CTUN.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}