{"id":"2408.12620","title":"Quantum Generative Adversarial Networks: Generating and Detecting\n  Quantum Product States","authors":"James E. Steck, Elizabeth C. Behrman","authorsParsed":[["Steck","James E.",""],["Behrman","Elizabeth C.",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 19:11:47 GMT"}],"updateDate":"2024-08-26","timestamp":1723230707000,"abstract":"  Machine learning can be used as a systematic method to non-algorithmically\nprogram quantum computers. Quantum machine learning enables us to perform\ncomputations without breaking down an algorithm into its gate building blocks,\neliminating that difficult step and potentially reducing unnecessary\ncomplexity. In addition, the machine learning approach is robust to both noise\nand to decoherence, which is ideal for running on inherently noisy NISQ devices\nwhich are limited in the number of qubits available for error correction. Here\nwe apply our prior work in quantum machine learning technique, to create a\nQGAN, a quantum analog to the classical Stylenet GANs developed by Kerras for\nimage generation and classification. A quantum system is used as a generator\nand a separate quantum system is used as a discriminator. The generator\nHamiltonian quantum parameters are augmented by quantum style parameters which\nplay the role of the style parameters used by Kerras. Both generator parameters\nare trained in a GAN MinMax problem along with quantum parameters of the\ndiscriminator Hamiltonian. We choose a problem to demonstrate the QGAN that has\npurely quantum information. The task is to generate and discriminate quantum\nproduct states. Real product states are generated to be detected and separated\nfrom fake quantum product states generated by the quantum generator. The\nproblem of detecting quantum product states is chosen to demonstrate the QGAN\nbecause is well known as purely quantum mechanical, has no classical analog and\nis an open problem for quantum product states of more than 2 qubits. With\nproper encoding of image pixels into quantum states as density matrices, the\nmethod demonstrated here is applicable to GAN image generation and detection\nthat can be hosted on and take advantage of the nature of quantum computers.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"A2ZmZNaoUzzOCgKr79V6A__fmsP_n6QF00vt7N-lzjU","pdfSize":"1067647"}
