{"id":"2408.01437","title":"Img2CAD: Reverse Engineering 3D CAD Models from Images through\n  VLM-Assisted Conditional Factorization","authors":"Yang You, Mikaela Angelina Uy, Jiaqi Han, Rahul Thomas, Haotong Zhang,\n  Suya You, Leonidas Guibas","authorsParsed":[["You","Yang",""],["Uy","Mikaela Angelina",""],["Han","Jiaqi",""],["Thomas","Rahul",""],["Zhang","Haotong",""],["You","Suya",""],["Guibas","Leonidas",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 06:53:30 GMT"}],"updateDate":"2024-08-06","timestamp":1721372010000,"abstract":"  Reverse engineering 3D computer-aided design (CAD) models from images is an\nimportant task for many downstream applications including interactive editing,\nmanufacturing, architecture, robotics, etc. The difficulty of the task lies in\nvast representational disparities between the CAD output and the image input.\nCAD models are precise, programmatic constructs that involves sequential\noperations combining discrete command structure with continuous attributes --\nmaking it challenging to learn and optimize in an end-to-end fashion.\nConcurrently, input images introduce inherent challenges such as photo-metric\nvariability and sensor noise, complicating the reverse engineering process. In\nthis work, we introduce a novel approach that conditionally factorizes the task\ninto two sub-problems. First, we leverage large foundation models, particularly\nGPT-4V, to predict the global discrete base structure with semantic\ninformation. Second, we propose TrAssembler that conditioned on the discrete\nstructure with semantics predicts the continuous attribute values. To support\nthe training of our TrAssembler, we further constructed an annotated CAD\ndataset of common objects from ShapeNet. Putting all together, our approach and\ndata demonstrate significant first steps towards CAD-ifying images in the wild.\nOur project page: https://anonymous123342.github.io/\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}