{"id":"2408.09304","title":"CyberPal.AI: Empowering LLMs with Expert-Driven Cybersecurity\n  Instructions","authors":"Matan Levi, Yair Alluouche, Daniel Ohayon, Anton Puzanov","authorsParsed":[["Levi","Matan",""],["Alluouche","Yair",""],["Ohayon","Daniel",""],["Puzanov","Anton",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 22:37:39 GMT"}],"updateDate":"2024-08-20","timestamp":1723934259000,"abstract":"  Large Language Models (LLMs) have significantly advanced natural language\nprocessing (NLP), providing versatile capabilities across various applications.\nHowever, their application to complex, domain-specific tasks, such as\ncyber-security, often faces substantial challenges. In this study, we introduce\nSecKnowledge and CyberPal.AI to address these challenges and train\nsecurity-expert LLMs. SecKnowledge is a domain-knowledge-driven cyber-security\ninstruction dataset, meticulously designed using years of accumulated expert\nknowledge in the domain through a multi-phase generation process. CyberPal.AI\nrefers to a family of LLMs fine-tuned using SecKnowledge, aimed at building\nsecurity-specialized LLMs capable of answering and following complex\nsecurity-related instructions. Additionally, we introduce SecKnowledge-Eval, a\ncomprehensive and diverse cyber-security evaluation benchmark, composed of an\nextensive set of cyber-security tasks we specifically developed to assess LLMs\nin the field of cyber-security, along with other publicly available security\nbenchmarks. Our results show a significant average improvement of up to 24%\nover the baseline models, underscoring the benefits of our expert-driven\ninstruction dataset generation process. These findings contribute to the\nadvancement of AI-based cyber-security applications, paving the way for\nsecurity-expert LLMs that can enhance threat-hunting and investigation\nprocesses.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YcPIGUOwWbJliJvsoMMEGagPAm0sMpULgfCs7PSRocc","pdfSize":"3095024"}
