{"id":"2408.02577","title":"COSMOS Brightest Group Galaxies -- III: Evolution of stellar ages","authors":"G. Gozaliasl, A. Finoguenov, A. Babul, O. Ilbert, M. Sargent, E.\n  Vardoulaki, A. L. Faisst, Z. Liu, M. Shuntov, O. Cooper, K. Dolag, S. Toft,\n  G. E. Magdis, G. Toni, B. Mobasher, R. Barr\\'e, W. Cui, D. Rennehan","authorsParsed":[["Gozaliasl","G.",""],["Finoguenov","A.",""],["Babul","A.",""],["Ilbert","O.",""],["Sargent","M.",""],["Vardoulaki","E.",""],["Faisst","A. L.",""],["Liu","Z.",""],["Shuntov","M.",""],["Cooper","O.",""],["Dolag","K.",""],["Toft","S.",""],["Magdis","G. E.",""],["Toni","G.",""],["Mobasher","B.",""],["Barré","R.",""],["Cui","W.",""],["Rennehan","D.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 15:54:16 GMT"}],"updateDate":"2024-08-20","timestamp":1722873256000,"abstract":"  The unique characteristics of the brightest group galaxies (BGGs) link the\nevolutionary continuum between galaxies like the Milky Way and more massive\nBCGs in dense clusters. This study investigates the stellar properties of BGGs\nover cosmic time (z = 0.08-1.30), extending our previous work (Gozaliasl et al.\n2016, 2018; Paper I and Paper II). We analyze data of 246 BGGs from our X-ray\ngalaxy group catalog in the COSMOS field, examining stellar age, mass, star\nformation rate (SFR), specific SFR (sSFR), and halo mass. Comparisons are made\nwith Millennium and Magneticum simulations. We explore the variation of stellar\nproperties with the projected offset from the X-ray peak or host halo center.\nUsing a mock galaxy catalog, we evaluated the accuracy of SED-derived stellar\nages, finding a mean absolute error of about one Gyr. Observed BGG age\ndistributions show a bias towards younger ages compared to semi-analytical\nmodels and the Magneticum simulation. Our analysis of stellar age versus mass\nreveals trends with a positive slope, suggesting complex evolutionary pathways\nacross redshifts. We observe a negative correlation between stellar age and SFR\nacross all redshift ranges. Using a cosmic-time-dependent main sequence\nframework, we identify star-forming BGGs, finding that about 20% of BGGs in the\nlocal universe exhibit star-forming characteristics, increasing to 50% at\n$z=1.0$. Our findings support an inside-out formation scenario for BGGs, where\nolder stellar populations are near the X-ray peak and younger populations at\nlarger offsets indicate ongoing star formation. The distribution of stellar\nages for lower-mass BGGs ($10^{10-11} M_\\odot$) deviates from constant ages\npredicted by models, highlighting current models' limitations in capturing\ngalaxies' complex star formation histories.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}