{"id":"2408.12527","title":"UMAD: University of Macau Anomaly Detection Benchmark Dataset","authors":"Dong Li, Lineng Chen, Cheng-Zhong Xu, Hui Kong","authorsParsed":[["Li","Dong",""],["Chen","Lineng",""],["Xu","Cheng-Zhong",""],["Kong","Hui",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 16:32:19 GMT"}],"updateDate":"2024-08-23","timestamp":1724344339000,"abstract":"  Anomaly detection is critical in surveillance systems and patrol robots by\nidentifying anomalous regions in images for early warning. Depending on whether\nreference data are utilized, anomaly detection can be categorized into anomaly\ndetection with reference and anomaly detection without reference. Currently,\nanomaly detection without reference, which is closely related to\nout-of-distribution (OoD) object detection, struggles with learning anomalous\npatterns due to the difficulty of collecting sufficiently large and diverse\nanomaly datasets with the inherent rarity and novelty of anomalies.\nAlternatively, anomaly detection with reference employs the scheme of change\ndetection to identify anomalies by comparing semantic changes between a\nreference image and a query one. However, there are very few ADr works due to\nthe scarcity of public datasets in this domain. In this paper, we aim to\naddress this gap by introducing the UMAD Benchmark Dataset. To our best\nknowledge, this is the first benchmark dataset designed specifically for\nanomaly detection with reference in robotic patrolling scenarios, e.g., where\nan autonomous robot is employed to detect anomalous objects by comparing a\nreference and a query video sequences. The reference sequences can be taken by\nthe robot along a specified route when there are no anomalous objects in the\nscene. The query sequences are captured online by the robot when it is\npatrolling in the same scene following the same route. Our benchmark dataset is\nelaborated such that each query image can find a corresponding reference based\non accurate robot localization along the same route in the prebuilt 3D map,\nwith which the reference and query images can be geometrically aligned using\nadaptive warping. Besides the proposed benchmark dataset, we evaluate the\nbaseline models of ADr on this dataset.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}