{"id":"2408.03655","title":"Consumer Transactions Simulation through Generative Adversarial Networks","authors":"Sergiy Tkachuk, Szymon {\\L}ukasik, Anna Wr\\'oblewska","authorsParsed":[["Tkachuk","Sergiy",""],["Łukasik","Szymon",""],["Wróblewska","Anna",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 09:45:24 GMT"}],"updateDate":"2024-08-08","timestamp":1723023924000,"abstract":"  In the rapidly evolving domain of large-scale retail data systems,\nenvisioning and simulating future consumer transactions has become a crucial\narea of interest. It offers significant potential to fortify demand forecasting\nand fine-tune inventory management. This paper presents an innovative\napplication of Generative Adversarial Networks (GANs) to generate synthetic\nretail transaction data, specifically focusing on a novel system architecture\nthat combines consumer behavior modeling with stock-keeping unit (SKU)\navailability constraints to address real-world assortment optimization\nchallenges. We diverge from conventional methodologies by integrating SKU data\ninto our GAN architecture and using more sophisticated embedding methods (e.g.,\nhyper-graphs). This design choice enables our system to generate not only\nsimulated consumer purchase behaviors but also reflects the dynamic interplay\nbetween consumer behavior and SKU availability -- an aspect often overlooked,\namong others, because of data scarcity in legacy retail simulation models. Our\nGAN model generates transactions under stock constraints, pioneering a\nresourceful experimental system with practical implications for real-world\nretail operation and strategy. Preliminary results demonstrate enhanced realism\nin simulated transactions measured by comparing generated items with real ones\nusing methods employed earlier in related studies. This underscores the\npotential for more accurate predictive modeling.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Information Retrieval","Quantitative Finance/Computational Finance"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}