{"id":"2408.15926","title":"Beating the Ramsey limit on sensing with deterministic qubit control","authors":"M. O. Hecht, Kumar Saurav, Evangelos Vlachos, Daniel A. Lidar, Eli M.\n  Levenson-Falk","authorsParsed":[["Hecht","M. O.",""],["Saurav","Kumar",""],["Vlachos","Evangelos",""],["Lidar","Daniel A.",""],["Levenson-Falk","Eli M.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 16:40:01 GMT"}],"updateDate":"2024-08-29","timestamp":1724863201000,"abstract":"  Quantum sensors promise revolutionary advances in medical imaging, energy\nproduction, mass detection, geodesy, foundational physics research, and a host\nof other fields. In many sensors, the signal takes the form of a changing qubit\nfrequency, which is detected with an interference measurement. Unfortunately,\nenvironmental noise decoheres the qubit state, reducing signal-to-noise ratio\n(SNR). Here we introduce a protocol for enhancing the sensitivity of a\nmeasurement of a qubit's frequency in the presence of decoherence. We use a\ncontinuous drive to stabilize one component of the qubit's Bloch vector,\nenhancing the effect of a small static frequency shift. We demonstrate our\nprotocol on a superconducting qubit, enhancing SNR per measurement shot by\n1.65$\\times$ and SNR per qubit evolution time by 1.09$\\times$ compared to\nstandard Ramsey interferometry. We explore the protocol theoretically and\nnumerically, finding maximum enhancements of 1.96$\\times$ and 1.18$\\times$,\nrespectively. We also show that the protocol is robust to parameter\nmiscalibrations. Our protocol provides an unconditional enhancement in\nsignal-to-noise ratio compared to standard Ramsey interferometry. It requires\nno feedback and no extra control or measurement resources, and can be\nimmediately applied in a wide variety of quantum computing and quantum sensor\ntechnologies to enhance their sensitivities.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jXrd4tEd29mLMC0D_rZp5f7NItoNdCFPRhHzbuCkdw4","pdfSize":"3859306"}
