{"id":"2408.14937","title":"From Chaos to Consistency: The Role of CSAF in Streamlining Security\n  Advisories","authors":"Julia Wunder, Janik Aurich, Zinaida Benenson","authorsParsed":[["Wunder","Julia",""],["Aurich","Janik",""],["Benenson","Zinaida",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 10:22:59 GMT"}],"updateDate":"2024-08-28","timestamp":1724754179000,"abstract":"  Security advisories have become an important part of vulnerability\nmanagement. They can be used to gather and distribute valuable information\nabout vulnerabilities. Although there is a predefined broad format for\nadvisories, it is not really standardized. As a result, their content and form\nvary greatly depending on the vendor. Thus, it is cumbersome and\nresource-intensive for security analysts to extract the relevant information.\nThe Common Security Advisory Format (CSAF) aims to bring security advisories\ninto a standardized format which is intended to solve existing problems and to\nenable automated processing of the advisories. However, a new standard only\nmakes sense if it can benefit users. Hence the questions arise: Do security\nadvisories cause issues in their current state? Which of these issues is CSAF\nable to resolve? What is the current state of automation?\n  To investigate these questions, we interviewed three security experts, and\nthen conducted an online survey with 197 participants. The results show that\nproblems exist and can often be traced back to confusing and inconsistent\nstructures and formats. CSAF attempts to solve precisely these problems.\nHowever, our results show that CSAF is currently rarely used. Although users\nperceive automation as necessary to improve the processing of security\nadvisories, many are at the same time skeptical. One of the main reasons is\nthat systems are not yet designed for automation and a migration would require\nvast amounts of resources.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}