{"id":"2408.16078","title":"Beyond Correlation: Incorporating Counterfactual Guidance to Better\n  Support Exploratory Visual Analysis","authors":"Arran Zeyu Wang, David Borland, David Gotz","authorsParsed":[["Wang","Arran Zeyu",""],["Borland","David",""],["Gotz","David",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:20:42 GMT"}],"updateDate":"2024-08-30","timestamp":1724869242000,"abstract":"  Providing effective guidance for users has long been an important and\nchallenging task for efficient exploratory visual analytics, especially when\nselecting variables for visualization in high-dimensional datasets. Correlation\nis the most widely applied metric for guidance in statistical and analytical\ntools, however a reliance on correlation may lead users towards false positives\nwhen interpreting causal relations in the data. In this work, inspired by prior\ninsights on the benefits of counterfactual visualization in supporting visual\ncausal inference, we propose a novel, simple, and efficient counterfactual\nguidance method to enhance causal inference performance in guided exploratory\nanalytics based on insights and concerns gathered from expert interviews. Our\ntechnique aims to capitalize on the benefits of counterfactual approaches while\nreducing their complexity for users. We integrated counterfactual guidance into\nan exploratory visual analytics system, and using a synthetically generated\nground-truth causal dataset, conducted a comparative user study and evaluated\nto what extent counterfactual guidance can help lead users to more precise\nvisual causal inferences. The results suggest that counterfactual guidance\nimproved visual causal inference performance, and also led to different\nexploratory behaviors compared to correlation-based guidance. Based on these\nfindings, we offer future directions and challenges for incorporating\ncounterfactual guidance to better support exploratory visual analytics.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}