{"id":"2408.08368","title":"Spin Hall Nano-Antenna","authors":"Raisa Fabiha, Pratap Kumar Pal, Michael Suche, Amrit Kumar Mondal,\n  Erdem Topsakal, Anjan Barman and Supriyo Bandyopadhyay","authorsParsed":[["Fabiha","Raisa",""],["Pal","Pratap Kumar",""],["Suche","Michael",""],["Mondal","Amrit Kumar",""],["Topsakal","Erdem",""],["Barman","Anjan",""],["Bandyopadhyay","Supriyo",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 18:22:59 GMT"}],"updateDate":"2024-08-19","timestamp":1723746179000,"abstract":"  The spin Hall effect is a celebrated phenomenon in spintronics and magnetism\nthat has found numerous applications in digital electronics (memory and logic),\nbut very few in analog electronics. Practically, the only analog application in\nwidespread use is the spin Hall nano-oscillator (SHNO) that delivers a high\nfrequency alternating current or voltage to a load. Here, we report its\nanalogue - a spin Hall nano-antenna (SHNA) that radiates a high frequency\nelectromagnetic wave (alternating electric/magnetic fields) into the\nsurrounding medium. It can also radiate an acoustic wave in an underlying\nsubstrate if the nanomagnets are made of a magnetostrictive material. That\nmakes it a dual electromagnetic/acoustic antenna. The SHNA is made of an array\nof ledged magnetostrictive nanomagnets deposited on a substrate, with a heavy\nmetal nanostrip underlying/overlying the ledges. An alternating charge current\npassed through the nanostrip generates an alternating spin-orbit torque in the\nnanomagnets via the spin Hall effect which makes their magnetizations oscillate\nin time with the frequency of the current, producing confined spin waves\n(magnons), which radiate electromagnetic waves (photons) in space with the same\nfrequency as the ac current. Despite being much smaller than the radiated\nwavelength, the SHNA surprisingly does not act as a point source which would\nradiate isotropically. Instead, there is clear directionality (anisotropy) in\nthe radiation pattern, which is frequency-dependent. This is due to the\n(frequency-dependent) intrinsic anisotropy in the confined spin wave patterns\ngenerated within the nanomagnets, which effectively endows the \"point source\"\nwith internal anisotropy.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Z4FXQL8aIkRgalpv75JOJIXafA7rxgm3l15qeIBXNKs","pdfSize":"2613854"}
