{"id":"2408.10382","title":"Tolerance to Astrophysical Model Uncertainty in Dark Siren Hubble\n  Measurement with Third-generation Gravitational-wave Detectors","authors":"Yijun Wang, Yanbei Chen","authorsParsed":[["Wang","Yijun",""],["Chen","Yanbei",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 19:52:47 GMT"}],"updateDate":"2024-08-21","timestamp":1724097167000,"abstract":"  Gravitational-wave (GW) events can serve as standard sirens for cosmology, as\nthe luminosity distance to source can be directly measured from the waveform\namplitude. Specifically, the ``dark'' siren method involves inferring\ncosmological parameters, e.g. the Hubble constant, by comparing the luminosity\ndistance distribution and that of the redshift, typically obtained through a\ncombination of galaxy survey catalog and theoretical models. Especially with\nthe prospect of third-generation GW detectors, the statistical uncertainty of\nthe Hubble measurement can be suppressed to a percent level. However, incorrect\nassumption in galaxy population models can lead to systematic bias, which\nbecomes increasingly relevant as third-generation GW detectors can detect\nlarge-redshift sources beyond the reach of currently available galaxy catalogs.\nIn this work, we adopt a Fisher information formalism and study the maximum\nmodel error tolerance given specific total error budget. We find that, to\nachieve a total error budget of 1% in the Hubble constant, the galaxy mass\nfunction redshift evolution should be known to O(1%). We find that galaxy\nredshift uncertainty, survey magnitude limit and GW angular localization error\nare important factors. We find galaxy clustering also improves model error\ntolerance, thus our results provide a conservative benchmark to future analysis\nusing real galaxy catalogs. We also investigate the effective bright siren\nscenario and highlight that the dark siren selection strategy should be catered\nto measurement uncertainty and the target total error budget. This work thus\nhighlights the challenge in the dark siren method and quantifies requirements\non both the galaxy catalog and GW measurement to contribute to constraining\ncosmology.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZGyhdbRYODqxdRPYEMXAnjuNZOzIxqukKpCI6cbriVM","pdfSize":"2891109"}
