{"id":"2408.08731","title":"Higgs production at NLL accuracy in the BFKL approach","authors":"Francesco Giovanni Celiberto, Luigi Delle Rose, Michael Fucilla,\n  Gabriele Gatto, Dmitry Yu. Ivanov, Mohammed M. A. Mohammed, Alessandro Papa","authorsParsed":[["Celiberto","Francesco Giovanni",""],["Rose","Luigi Delle",""],["Fucilla","Michael",""],["Gatto","Gabriele",""],["Ivanov","Dmitry Yu.",""],["Mohammed","Mohammed M. A.",""],["Papa","Alessandro",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 13:31:46 GMT"}],"updateDate":"2024-08-19","timestamp":1723815106000,"abstract":"  Precision physics in the Higgs sector has been one of the main challenges of\nparticle physics in the recent years. The pure fixed-order calculations\nentering the collinear factorization framework, which have been pushed up to\nnext-cube-leading-order, are not able to describe the entire kinematic\nspectrum. In particular sectors, they have to be necessarily enhanced by\nall-order resummations. In the so-called semi-hard regime, large energy-type\nlogarithms spoil the perturbative convergence of the series and must be\nresummed to all orders. This resummation is a core ingredient for a correct\ndescription of the inclusive hadroproduction of a forward Higgs boson in the\nlimit of small Bjorken $x$, as well as for a precision study of inclusive\nforward emissions of a Higgs boson in association with a backward identified\nobject. A complete resummation for these processes can be achieved at the at\nnext-to-leading logarithmic accuracy thanks to the\nBalitsky-Fadin-Kuraev-Lipatov approach. In the present work we present and\ndiscuss a series of recent phenomenological results within a partial\nnext-to-leading accuracy. They include the analysis of rapidity and\nazimuthal-angle differential rates for Higgs plus jet and Higgs plus charm\nreactions in forward and ultraforward directions of rapidity at the LHC.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment","Physics/Nuclear Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}