{"id":"2408.07984","title":"Gravitational Lensing Reveals Cool Gas within 10-20 kpc around a\n  Quiescent Galaxy","authors":"Tania M. Barone, Glenn G. Kacprzak, James W. Nightingale, Nikole M.\n  Nielsen, Karl Glazebrook, Kim-Vy H. Tran, Tucker Jones, Hasti Nateghi,\n  Keerthi Vasan G. C., Nandini Sahu, Themiya Nanayakkara, Hannah Skobe, Jesse\n  van de Sande, Sebastian Lopez and Geraint F. Lewis","authorsParsed":[["Barone","Tania M.",""],["Kacprzak","Glenn G.",""],["Nightingale","James W.",""],["Nielsen","Nikole M.",""],["Glazebrook","Karl",""],["Tran","Kim-Vy H.",""],["Jones","Tucker",""],["Nateghi","Hasti",""],["C.","Keerthi Vasan G.",""],["Sahu","Nandini",""],["Nanayakkara","Themiya",""],["Skobe","Hannah",""],["van de Sande","Jesse",""],["Lopez","Sebastian",""],["Lewis","Geraint F.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 07:09:51 GMT"}],"updateDate":"2024-08-16","timestamp":1723705791000,"abstract":"  While quiescent galaxies have comparable amounts of cool gas in their outer\ncircumgalactic medium (CGM) compared to star-forming galaxies, they have\nsignificantly less interstellar gas. However, open questions remain on the\nprocesses causing galaxies to stop forming stars and stay quiescent . Theories\nsuggest dynamical interactions with the hot corona prevent cool gas from\nreaching the galaxy, therefore predicting the inner regions of quiescent galaxy\nCGMs are devoid of cool gas. However, there is a lack of understanding of the\ninner regions of CGMs due to the lack of spatial information in\nquasar-sightline methods. We present integral-field spectroscopy probing\n10--20~kpc (2.4--4.8 R\\textsubscript{e}) around a massive quiescent galaxy\nusing a gravitationally lensed star-forming galaxy. We detect absorption from\nMagnesium (MgII) implying large amounts of cool atomic gas\n(10\\textsuperscript{8.4} -- 10\\textsuperscript{9.3} M\\textsubscript{$\\odot$}\nwith T$\\sim$10\\textsuperscript{4} Kelvin), in comparable amounts to\nstar-forming galaxies. Lens modeling of Hubble imaging also reveals a diffuse\nasymmetric component of significant mass consistent with the spatial extent of\nthe MgII absorption, and offset from the galaxy light profile. This study\ndemonstrates the power of galaxy-scale gravitational lenses to not only probe\nthe gas around galaxies, but to also independently probe the mass of the CGM\ndue to it's gravitational effect.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}