{"id":"2408.06964","title":"Multi-Layered Security System: Integrating Quantum Key Distribution with\n  Classical Cryptography to Enhance Steganographic Security","authors":"Arman Sykot, Md Shawmoon Azad, Wahida Rahman Tanha, BM Monjur Morshed,\n  Syed Emad Uddin Shubha and M.R.C. Mahdy","authorsParsed":[["Sykot","Arman",""],["Azad","Md Shawmoon",""],["Tanha","Wahida Rahman",""],["Morshed","BM Monjur",""],["Shubha","Syed Emad Uddin",""],["Mahdy","M. R. C.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 15:20:29 GMT"}],"updateDate":"2024-08-14","timestamp":1723562429000,"abstract":"  In this paper, we present a novel cryptographic system that integrates\nQuantum Key Distribution (QKD) with classical encryption techniques to secure\nsteganographic images. Our approach leverages the E91 QKD protocol to generate\na shared secret key between communicating parties, ensuring the highest level\nof security against eavesdropping through the principles of quantum mechanics.\nThis key is then hashed using the Secure Hash Algorithm (SHA) to provide a\nfixedlength, high-entropy key, which is subsequently utilized in symmetric\nencryption. We explore the use of AES (Advanced Encryption Standard) algorithms\nfor encrypting steganographic images, which hide sensitive information within\ndigital images to provide an additional layer of security through obscurity.\nThe combination of QKD, hashing, and symmetric encryption offers a robust\nsecurity framework that mitigates various attack vectors, enhancing the\nconfidentiality and integrity of the transmitted data. Our experimental results\ndemonstrate the feasibility and efficiency of the proposed system, highlighting\nits performance in terms of key generation rates, encryption/decryption speeds,\nand the computational overhead introduced by the hashing and steganographic\nprocesses. By integrating quantum and classical cryptographic methods with\nsteganography, this work provides a comprehensive security solution that is\nhighly resistant to both quantum and classical attacks, making it suitable for\napplications requiring stringent security measures. This paper contributes to\nthe ongoing research in cryptographic systems, offering insights into the\npractical implementation and potential benefits of hybrid quantumclassical\nsecurity protocols.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7FEARgxCy2CQqMiBjL9F4LE3ey7bb12h7CAzre-poKs","pdfSize":"1374824"}
