{"id":"2408.14801","title":"A versatile informative diffusion model for single-cell ATAC-seq data\n  generation and analysis","authors":"Lei Huang, Lei Xiong, Na Sun, Zunpeng Liu, Ka-Chun Wong, and Manolis\n  Kellis","authorsParsed":[["Huang","Lei",""],["Xiong","Lei",""],["Sun","Na",""],["Liu","Zunpeng",""],["Wong","Ka-Chun",""],["Kellis","Manolis",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 06:12:37 GMT"}],"updateDate":"2024-08-28","timestamp":1724739157000,"abstract":"  The rapid advancement of single-cell ATAC sequencing (scATAC-seq)\ntechnologies holds great promise for investigating the heterogeneity of\nepigenetic landscapes at the cellular level. The amplification process in\nscATAC-seq experiments often introduces noise due to dropout events, which\nresults in extreme sparsity that hinders accurate analysis. Consequently, there\nis a significant demand for the generation of high-quality scATAC-seq data in\nsilico. Furthermore, current methodologies are typically task-specific, lacking\na versatile framework capable of handling multiple tasks within a single model.\nIn this work, we propose ATAC-Diff, a versatile framework, which is based on a\nlatent diffusion model conditioned on the latent auxiliary variables to adapt\nfor various tasks. ATAC-Diff is the first diffusion model for the scATAC-seq\ndata generation and analysis, composed of auxiliary modules encoding the latent\nhigh-level variables to enable the model to learn the semantic information to\nsample high-quality data. Gaussian Mixture Model (GMM) as the latent prior and\nauxiliary decoder, the yield variables reserve the refined genomic information\nbeneficial for downstream analyses. Another innovation is the incorporation of\nmutual information between observed and hidden variables as a regularization\nterm to prevent the model from decoupling from latent variables. Through\nextensive experiments, we demonstrate that ATAC-Diff achieves high performance\nin both generation and analysis tasks, outperforming state-of-the-art models.\n","subjects":["Quantitative Biology/Genomics","Quantitative Biology/Biomolecules"],"license":"http://creativecommons.org/licenses/by/4.0/"}