{"id":"2408.14171","title":"Soft X-ray emission from the classical nova AT 2018bej","authors":"A. Tavleev, L. Ducci, V. F. Suleimanov, C. Maitra, K. Werner, A.\n  Santangelo, V. Doroshenko","authorsParsed":[["Tavleev","A.",""],["Ducci","L.",""],["Suleimanov","V. F.",""],["Maitra","C.",""],["Werner","K.",""],["Santangelo","A.",""],["Doroshenko","V.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 10:36:31 GMT"}],"updateDate":"2024-08-27","timestamp":1724668591000,"abstract":"  Classical novae are known to demonstrate a supersoft X-ray source (SSS) state\nfollowing outbursts, which is associated with residual thermonuclear burning on\nthe white dwarf (WD) surface. During its all-sky survey (eRASS1), the eROSITA\ntelescope onboard the Spectrum-Roentgen-Gamma observatory discovered a bright\nnew SSS, whose position is consistent with the known classical nova AT 2018bej\nin the Large Magellanic Cloud. There were two eROSITA spectra obtained during\neRASS1 and eRASS2 monitoring epochs and one XMM-Newton grating spectrum close\nto the eRASS1 epoch. We aim to describe the eROSITA and XMM-Newton spectra of\nAT 2018bej with our local thermodynamic equilibrium (LTE) atmosphere models. We\nfocused on the evolution of the hot WD properties between the eRASS1 and eRASS2\nepochs, especially on the change of the carbon abundance. A grid of LTE model\natmosphere spectra were calculated for different values of the effective\ntemperature (from $T_{\\rm eff}= 525$ to $700\\,\\rm kK$), surface gravity (six\nvalues) and chemical composition with five different values of carbon and\nnitrogen abundances. Both eRASS1 and XMM $0.3-0.6$ keV spectral analyses yield\na temperature of the WD of $T_{\\rm eff}{\\sim}\\,600\\, \\rm kK$ and a WD radius of\n$8000-8700\\,\\rm km$. Simultaneous fitting of the eROSITA spectra for two epochs\n(eRASS1 and eRASS2) with a common WD mass parameter demonstrates a decrease in\n$T_{\\rm eff}$ accompanied by an increase in the WD radius and a decrease in the\ncarbon abundance. However, these changes are marginal and coincide within\nerrors. The derived WD mass is estimated to be $1.05-1.15\\, M_\\odot$. We traced\na minor evolution of the source on a half-year timescale accompanied by a\ndecrease in carbon abundance and concluded that LTE model atmospheres can be\nused to analyse the available X-ray spectra of classical novae during their SSS\nstage.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}