{"id":"2408.06381","title":"Assessment of Cell Nuclei AI Foundation Models in Kidney Pathology","authors":"Junlin Guo, Siqi Lu, Can Cui, Ruining Deng, Tianyuan Yao, Zhewen Tao,\n  Yizhe Lin, Marilyn Lionts, Quan Liu, Juming Xiong, Catie Chang, Mitchell\n  Wilkes, Mengmeng Yin, Haichun Yang, Yuankai Huo","authorsParsed":[["Guo","Junlin",""],["Lu","Siqi",""],["Cui","Can",""],["Deng","Ruining",""],["Yao","Tianyuan",""],["Tao","Zhewen",""],["Lin","Yizhe",""],["Lionts","Marilyn",""],["Liu","Quan",""],["Xiong","Juming",""],["Chang","Catie",""],["Wilkes","Mitchell",""],["Yin","Mengmeng",""],["Yang","Haichun",""],["Huo","Yuankai",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 22:34:13 GMT"}],"updateDate":"2024-08-14","timestamp":1723242853000,"abstract":"  Cell nuclei instance segmentation is a crucial task in digital kidney\npathology. Traditional automatic segmentation methods often lack\ngeneralizability when applied to unseen datasets. Recently, the success of\nfoundation models (FMs) has provided a more generalizable solution, potentially\nenabling the segmentation of any cell type. In this study, we perform a\nlarge-scale evaluation of three widely used state-of-the-art (SOTA) cell nuclei\nfoundation models (Cellpose, StarDist, and CellViT). Specifically, we created a\nhighly diverse evaluation dataset consisting of 2,542 kidney whole slide images\n(WSIs) collected from both human and rodent sources, encompassing various\ntissue types, sizes, and staining methods. To our knowledge, this is the\nlargest-scale evaluation of its kind to date. Our quantitative analysis of the\nprediction distribution reveals a persistent performance gap in kidney\npathology. Among the evaluated models, CellViT demonstrated superior\nperformance in segmenting nuclei in kidney pathology. However, none of the\nfoundation models are perfect; a performance gap remains in general nuclei\nsegmentation for kidney pathology.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}