{"id":"2408.11376","title":"A GPU accelerated mixed-precision Finite Difference informed Random\n  Walker (FDiRW) solver for strongly inhomogeneous diffusion problems","authors":"Zirui Mao, Shenyang Hu, Ang Li","authorsParsed":[["Mao","Zirui",""],["Hu","Shenyang",""],["Li","Ang",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 06:58:38 GMT"}],"updateDate":"2024-08-22","timestamp":1724223518000,"abstract":"  In nature, many complex multi-physics coupling problems exhibit significant\ndiffusivity inhomogeneity, where one process occurs several orders of magnitude\nfaster than others in temporal. Simulating rapid diffusion alongside slower\nprocesses demands intensive computational resources due to the necessity for\nsmall time steps. To address these computational challenges, we have developed\nan efficient numerical solver named Finite Difference informed Random Walker\n(FDiRW). In this study, we propose a GPU-accelerated, mixed-precision\nconfiguration for the FDiRW solver to maximize efficiency through GPU\nmulti-threaded parallel computation and lower precision computation. Numerical\nevaluation results reveal that the proposed GPU-accelerated mixed-precision\nFDiRW solver can achieve a 117X speedup over the CPU baseline, while an\nadditional 1.75X speedup by employing lower precision GPU computation. Notably,\nfor large model sizes, the GPU-accelerated mixed-precision FDiRW solver\ndemonstrates strong scaling with the number of nodes used in simulation. When\nsimulating radionuclide absorption processes by porous wasteform particles with\na medium-sized model of 192x192x192, this approach reduces the total\ncomputational time to 10 minutes, enabling the simulation of larger systems\nwith strongly inhomogeneous diffusivity.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dJ28APKIs2uMiWcjzBTf5VVGevpvvC-agfw-IWbzyh4","pdfSize":"1711659"}
