{"id":"2408.08796","title":"Multi-Antenna Broadband Backscatter Communications","authors":"Hao Chen, Zhizhi Huang, Ying-Chang Liang, Robert Schober","authorsParsed":[["Chen","Hao",""],["Huang","Zhizhi",""],["Liang","Ying-Chang",""],["Schober","Robert",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 15:13:30 GMT"}],"updateDate":"2024-08-19","timestamp":1723821210000,"abstract":"  Backscatter communication offers a promising solution to connect massive\nInternet-of-Things (IoT) devices with low cost and high energy efficiency.\nNevertheless, its inherently passive nature limits transmission reliability,\nthereby hindering improvements in communication range and data rate. To\novercome these challenges, we introduce a bistatic broadband backscatter\ncommunication (BBBC) system, which equips the backscatter device (BD) with\nmultiple antennas. In the proposed BBBC system, a radio frequency (RF) source\ndirects a sinusoidal signal to the BD, facilitating single-carrier block\ntransmission at the BD. Meanwhile, without requiring channel state information\n(CSI), cyclic delay diversity (CDD) is employed at the multi-antenna BD to\nenhance transmission reliability through additional cyclically delayed\nbackscattered signals. We also propose a receiver design that includes\npreprocessing of the time-domain received signal, pilot-based parameter\nestimation, and frequency-domain equalization, enabling low-complexity\ndetection of the backscattered signal. Leveraging the matched filter bound\n(MFB), we analyze the achievable diversity gains in terms of outage\nprobability. Our analysis reveals that spatial diversity is achievable under\ngeneral Rayleigh fading conditions, and both frequency and spatial diversity\nare attainable in scenarios where the forward link experiences a line-of-sight\n(LoS) channel. Simulation results validate the effectiveness of the proposed\nBBBC system. As the number of BD antennas increases, our results show that the\nproposed scheme not only enhances array gain but also improves diversity order,\nsignificantly reducing both outage probability and bit error rate (BER).\nConsequently, it outperforms conventional schemes that yield only minor gains.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}