{"id":"2408.09129","title":"Pursuing Truth: Improving Retrievals on Mid-Infrared Exo-Earth Spectra\n  with Physically Motivated Water Abundance Profiles and Cloud Models","authors":"Bj\\\"orn S. Konrad, Sascha P. Quanz, Eleonora Alei, Robin Wordsworth","authorsParsed":[["Konrad","Björn S.",""],["Quanz","Sascha P.",""],["Alei","Eleonora",""],["Wordsworth","Robin",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 07:54:46 GMT"}],"updateDate":"2024-08-20","timestamp":1723881286000,"abstract":"  Atmospheric retrievals are widely used to constrain exoplanet properties from\nobserved spectra. We investigate how the common nonphysical retrieval\nassumptions of vertically constant molecule abundances and cloud-free\natmospheres affect our characterization of an exo-Earth (an Earth-twin orbiting\na Sun-like star). Specifically, we use a state-of-the-art retrieval framework\nto explore how assumptions for the $\\mathrm{H_2O}$ profile and clouds affect\nretrievals. In a first step, we validate different retrieval models on a\nlow-noise simulated 1D mid-infrared (MIR) spectrum of Earth. Thereafter, we\nstudy how these assumptions affect the characterization of Earth with the Large\nInterferometer For Exoplanets (LIFE). We run retrievals on LIFE mock\nobservations based on real disk-integrated MIR Earth spectra. The performance\nof different retrieval models is benchmarked against ground truths derived from\nremote sensing data. We show that assumptions for the $\\mathrm{H_2O}$ abundance\nand clouds directly affect our characterization. Overall, retrievals that use\nphysically motivated models for the $\\mathrm{H_2O}$ profile and clouds perform\nbetter on the empirical Earth data. For observations of Earth with LIFE, they\nyield accurate estimates for the radius, pressure-temperature structure, and\nthe abundances of $\\mathrm{CO_2}$, $\\mathrm{H_2O}$, and $\\mathrm{O_3}$.\nFurther, at $R=100$, a reliable and bias-free detection of the biosignature\n$\\mathrm{CH_4}$ becomes feasible. We conclude that the community must use a\ndiverse range of models for temperate exoplanet atmospheres to build an\nunderstanding of how different retrieval assumptions can affect the\ninterpretation of exoplanet spectra. This will enable the characterization of\ndistant habitable worlds and the search for life with future space-based\ninstruments.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}