{"id":"2408.06106","title":"Optical RISs Improve the Secret Key Rate of Free-Space QKD in HAP-to-UAV\n  Scenarios","authors":"Phuc V. Trinh, Shinya Sugiura, Chao Xu, Lajos Hanzo","authorsParsed":[["Trinh","Phuc V.",""],["Sugiura","Shinya",""],["Xu","Chao",""],["Hanzo","Lajos",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 12:45:46 GMT"}],"updateDate":"2024-08-13","timestamp":1723466746000,"abstract":"  Large optical reconfigurable intelligent surfaces (ORISs) are proposed for\nemployment on building rooftops to facilitate free-space quantum key\ndistribution (QKD) between high-altitude platforms (HAPs) and low-altitude\nplatforms (LAPs). Due to practical constraints, the communication terminals can\nonly be positioned beneath the LAPs, preventing direct upward links to HAPs. By\ndeploying ORISs on rooftops to reflect the beam arriving from HAPs towards LAPs\nfrom below, reliable HAP-to-LAP links can be established. To accurately\ncharacterize the optical beam propagation, we develop an analytical channel\nmodel based on extended Huygens-Fresnel principles for representing both the\natmospheric turbulence effects and the hovering fluctuations of LAPs. This\nmodel facilitates adaptive ORIS beam-width control through linear, quadratic,\nand focusing phase shifts, which are capable of effectively mitigating the\ndetrimental effects of beam broadening and pointing errors (PE). Furthermore,\nwe derive a closed-form expression for the information-theoretic bound of the\nQKD secret key rate (SKR) of the HAP-to-LAP links. Our findings demonstrate\nthat quadratic phase shifts enhance the SKR at high HAP-ORIS zenith angles or\nmild PE conditions by narrowing the beam to optimal sizes. By contrast, linear\nphase shifts are advantageous at low HAP-ORIS zenith angles under\nmoderate-to-high PE by diverging the beam to mitigate LAP fluctuations.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}