{"id":"2408.08188","title":"Scaling Up Natural Language Understanding for Multi-Robots Through the\n  Lens of Hierarchy","authors":"Shaojun Xu, Xusheng Luo, Yutong Huang, Letian Leng, Ruixuan Liu,\n  Changliu Liu","authorsParsed":[["Xu","Shaojun",""],["Luo","Xusheng",""],["Huang","Yutong",""],["Leng","Letian",""],["Liu","Ruixuan",""],["Liu","Changliu",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 14:46:13 GMT"}],"updateDate":"2024-08-16","timestamp":1723733173000,"abstract":"  Long-horizon planning is hindered by challenges such as uncertainty\naccumulation, computational complexity, delayed rewards and incomplete\ninformation. This work proposes an approach to exploit the task hierarchy from\nhuman instructions to facilitate multi-robot planning. Using Large Language\nModels (LLMs), we propose a two-step approach to translate multi-sentence\ninstructions into a structured language, Hierarchical Linear Temporal Logic\n(LTL), which serves as a formal representation for planning. Initially, LLMs\ntransform the instructions into a hierarchical representation defined as\nHierarchical Task Tree, capturing the logical and temporal relations among\ntasks. Following this, a domain-specific fine-tuning of LLM translates\nsub-tasks of each task into flat LTL formulas, aggregating them to form\nhierarchical LTL specifications. These specifications are then leveraged for\nplanning using off-the-shelf planners. Our framework not only bridges the gap\nbetween instructions and algorithmic planning but also showcases the potential\nof LLMs in harnessing hierarchical reasoning to automate multi-robot task\nplanning. Through evaluations in both simulation and real-world experiments\ninvolving human participants, we demonstrate that our method can handle more\ncomplex instructions compared to existing methods. The results indicate that\nour approach achieves higher success rates and lower costs in multi-robot task\nallocation and plan generation. Demos videos are available at\nhttps://youtu.be/7WOrDKxIMIs .\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Logic in Computer Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}