{"id":"2408.09481","title":"PanoSent: A Panoptic Sextuple Extraction Benchmark for Multimodal\n  Conversational Aspect-based Sentiment Analysis","authors":"Meng Luo, Hao Fei, Bobo Li, Shengqiong Wu, Qian Liu, Soujanya Poria,\n  Erik Cambria, Mong-Li Lee, Wynne Hsu","authorsParsed":[["Luo","Meng",""],["Fei","Hao",""],["Li","Bobo",""],["Wu","Shengqiong",""],["Liu","Qian",""],["Poria","Soujanya",""],["Cambria","Erik",""],["Lee","Mong-Li",""],["Hsu","Wynne",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 13:51:01 GMT"},{"version":"v2","created":"Mon, 9 Sep 2024 15:57:34 GMT"}],"updateDate":"2024-09-10","timestamp":1723989061000,"abstract":"  While existing Aspect-based Sentiment Analysis (ABSA) has received extensive\neffort and advancement, there are still gaps in defining a more holistic\nresearch target seamlessly integrating multimodality, conversation context,\nfine-granularity, and also covering the changing sentiment dynamics as well as\ncognitive causal rationales. This paper bridges the gaps by introducing a\nmultimodal conversational ABSA, where two novel subtasks are proposed: 1)\nPanoptic Sentiment Sextuple Extraction, panoramically recognizing holder,\ntarget, aspect, opinion, sentiment, rationale from multi-turn multi-party\nmultimodal dialogue. 2) Sentiment Flipping Analysis, detecting the dynamic\nsentiment transformation throughout the conversation with the causal reasons.\nTo benchmark the tasks, we construct PanoSent, a dataset annotated both\nmanually and automatically, featuring high quality, large scale, multimodality,\nmultilingualism, multi-scenarios, and covering both implicit and explicit\nsentiment elements. To effectively address the tasks, we devise a novel\nChain-of-Sentiment reasoning framework, together with a novel multimodal large\nlanguage model (namely Sentica) and a paraphrase-based verification mechanism.\nExtensive evaluations demonstrate the superiority of our methods over strong\nbaselines, validating the efficacy of all our proposed methods. The work is\nexpected to open up a new era for the ABSA community, and thus all our codes\nand data are open at https://PanoSent.github.io/\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}