{"id":"2408.09144","title":"SSNeRF: Sparse View Semi-supervised Neural Radiance Fields with\n  Augmentation","authors":"Xiao Cao, Beibei Lin, Bo Wang, Zhiyong Huang, Robby T. Tan","authorsParsed":[["Cao","Xiao",""],["Lin","Beibei",""],["Wang","Bo",""],["Huang","Zhiyong",""],["Tan","Robby T.",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 09:00:37 GMT"}],"updateDate":"2024-08-20","timestamp":1723885237000,"abstract":"  Sparse view NeRF is challenging because limited input images lead to an under\nconstrained optimization problem for volume rendering. Existing methods address\nthis issue by relying on supplementary information, such as depth maps.\nHowever, generating this supplementary information accurately remains\nproblematic and often leads to NeRF producing images with undesired artifacts.\nTo address these artifacts and enhance robustness, we propose SSNeRF, a sparse\nview semi supervised NeRF method based on a teacher student framework. Our key\nidea is to challenge the NeRF module with progressively severe sparse view\ndegradation while providing high confidence pseudo labels. This approach helps\nthe NeRF model become aware of noise and incomplete information associated with\nsparse views, thus improving its robustness. The novelty of SSNeRF lies in its\nsparse view specific augmentations and semi supervised learning mechanism. In\nthis approach, the teacher NeRF generates novel views along with confidence\nscores, while the student NeRF, perturbed by the augmented input, learns from\nthe high confidence pseudo labels. Our sparse view degradation augmentation\nprogressively injects noise into volume rendering weights, perturbs feature\nmaps in vulnerable layers, and simulates sparse view blurriness. These\naugmentation strategies force the student NeRF to recognize degradation and\nproduce clearer rendered views. By transferring the student's parameters to the\nteacher, the teacher gains increased robustness in subsequent training\niterations. Extensive experiments demonstrate the effectiveness of our SSNeRF\nin generating novel views with less sparse view degradation. We will release\ncode upon acceptance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}