{"id":"2408.03631","title":"Large Language Models for Base Station Siting: Intelligent Deployment\n  based on Prompt or Agent","authors":"Yanhu Wang, Muhammad Muzammil Afzal, Zhengyang Li, Jie Zhou, Chenyuan\n  Feng, Shuaishuai Guo, and Tony Q. S. Quek","authorsParsed":[["Wang","Yanhu",""],["Afzal","Muhammad Muzammil",""],["Li","Zhengyang",""],["Zhou","Jie",""],["Feng","Chenyuan",""],["Guo","Shuaishuai",""],["Quek","Tony Q. S.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 08:43:32 GMT"}],"updateDate":"2024-08-08","timestamp":1723020212000,"abstract":"  Traditional base station siting (BSS) methods rely heavily on drive testing\nand user feedback, which are laborious and require extensive expertise in\ncommunication, networking, and optimization. As large language models (LLMs)\nand their associated technologies advance, particularly in the realms of prompt\nengineering and agent engineering, network optimization will witness a\nrevolutionary approach. This approach entails the strategic use of well-crafted\nprompts to infuse human experience and knowledge into these sophisticated LLMs,\nand the deployment of autonomous agents as a communication bridge to seamlessly\nconnect the machine language based LLMs with human users using natural\nlanguage. This integration represents the future paradigm of artificial\nintelligence (AI) as a service and AI for more ease. As a preliminary\nexploration, this research first develops a novel LLM-empowered BSS\noptimization framework, and heuristically proposes four different potential\nimplementations: the strategies based on Prompt-optimized LLM (PoL),\nhuman-in-the-Loop LLM (HiLL), LLM-empowered autonomous BSS agent (LaBa), and\nCooperative multiple LLM-based autonomous BSS agents (CLaBa). Through\nevaluation on real-world data, the experiments demonstrate that prompt-assisted\nLLMs and LLM-based agents can generate more efficient, cost-effective, and\nreliable network deployments, noticeably enhancing the efficiency of BSS\noptimization and reducing trivial manual participation.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}