{"id":"2408.11770","title":"JWST Validates HST Distance Measurements: Selection of Supernova\n  Subsample Explains Differences in JWST Estimates of Local H0","authors":"Adam G. Riess, Dan Scolnic, Gagandeep S. Anand, Louise Breuval,\n  Stefano Casertano, Lucas M. Macri, Siyang Li, Wenlong Yuan, Caroline D.\n  Huang, Saurabh Jha, Yukei S. Murakami, Rachael Beaton, Dillon Brout, Tianrui\n  Wu, Graeme E. Addison, Charles Bennett, Richard I. Anderson, Alexei V.\n  Filippenko, Anthony Carr","authorsParsed":[["Riess","Adam G.",""],["Scolnic","Dan",""],["Anand","Gagandeep S.",""],["Breuval","Louise",""],["Casertano","Stefano",""],["Macri","Lucas M.",""],["Li","Siyang",""],["Yuan","Wenlong",""],["Huang","Caroline D.",""],["Jha","Saurabh",""],["Murakami","Yukei S.",""],["Beaton","Rachael",""],["Brout","Dillon",""],["Wu","Tianrui",""],["Addison","Graeme E.",""],["Bennett","Charles",""],["Anderson","Richard I.",""],["Filippenko","Alexei V.",""],["Carr","Anthony",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 16:47:09 GMT"}],"updateDate":"2024-08-22","timestamp":1724258829000,"abstract":"  JWST provides new opportunities to cross-check the HST Cepheid/SNeIa distance\nladder, which yields the most precise local measure of H0. We analyze early\nJWST subsamples (~1/4 of the HST sample) from the SH0ES and CCHP groups,\ncalibrated by a single anchor (N4258). We find HST Cepheid distances agree well\n(~1 sigma) with all 8 combinations of methods, samples, and telescopes: JWST\nCepheids, TRGB, and JAGB by either group, plus HST TRGB and Miras. The\ncomparisons explicitly include the measurement uncertainty of each method in\nN4258, an oft-neglected but dominant term. Mean differences are ~0.03 mag, far\nsmaller than the 0.18 mag \"Hubble tension.\" Combining all measures produces the\nstrongest constraint yet on the linearity of HST Cepheid distances,\n0.994+-0.010, ruling out distance-dependent bias or offset as the source of the\ntension at ~7 sigma. Yet, measurements of H0 from current JWST subsamples\nproduce large sampling differences whose size and direction we can directly\nestimate from the full HST set. We show that Delta(H0)~2.5 km/s/Mpc between the\nCCHP JWST program and the full HST sample is entirely consistent with\ndifferences in sample selection. Combining all JWST samples produces a new,\ndistance-limited set of 16 SNeIa at D<25 Mpc and more closely resembles the\nfull sample thanks to \"reversion to the mean\" of larger samples. Using JWST\nCepheids, JAGB, and TRGB, we find 73.4+-2.1, 72.2+-2.2, and 72.1+-2.2 km/s/Mpc,\nrespectively. Explicitly accounting for SNe in common, the combined-sample\nthree-method result from JWST is H0=72.6+-2.0, similar to H0=72.8 expected from\nHST Cepheids in the same galaxies. The small JWST sample trivially lowers the\nHubble tension significance due to small-sample statistics and is not yet\ncompetitive with the HST set (42 SNeIa and 4 anchors), which yields 73.2+-0.9.\nStill, the joint JWST sample provides important crosschecks which the HST data\npasses.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}