{"id":"2408.11677","title":"Beam-based Identification of Magnetic Field Errors in a Synchrotron\n  using Deep Lie Map Networks","authors":"Conrad Caliari, Adrian Oeftiger, Oliver Boine-Frankenheim","authorsParsed":[["Caliari","Conrad",""],["Oeftiger","Adrian",""],["Boine-Frankenheim","Oliver",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 14:57:31 GMT"}],"updateDate":"2024-08-22","timestamp":1724252251000,"abstract":"  We present the first experimental validation of the Deep Lie Map Network\n(DLMN) approach for recovering both linear and non-linear optics in a\nsynchrotron. The DLMN facilitates the construction of a detailed accelerator\nmodel by integrating charged particle dynamics with machine learning\nmethodology in a data-driven framework. The primary observable is the centroid\nmotion over a limited number of turns, captured by beam position monitors. The\nDLMN produces an updated description of the accelerator in terms of magnetic\nmultipole components, which can be directly utilized in established accelerator\nphysics tools and tracking codes for further analysis. In this study, we apply\nthe DLMN to the SIS18 hadron synchrotron at GSI for the first time.\n  We discuss the validity of the recovered linear and non-linear optics,\nincluding quadrupole and sextupole errors, and compare our results with\nalternative methods, such as the LOCO fit of a measured orbit response matrix\nand the evaluation of resonance driving terms. The small number of required\ntrajectory measurements, one for linear and three for non-linear optics\nreconstruction, demonstrates the method's time efficiency. Our findings\nindicate that the DLMN is well-suited for identifying linear optics, and the\nrecovery of non-linear optics is achievable within the capabilities of the\ncurrent beam position monitor system. We demonstrate the application of DLMN\nresults through simulated resonance diagrams in tune space and their comparison\nwith measurements. The DLMN provides a novel tool for analyzing the causal\norigins of resonances and exploring potential compensation schemes.\n","subjects":["Physics/Accelerator Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"HPKPV7V4wAqMGx_scIx4ZF7AIx8g1EriqtOBNNNd8Vo","pdfSize":"1010540"}
