{"id":"2408.16287","title":"Measuring the Accuracy of Automatic Speech Recognition Solutions","authors":"Korbinian Kuhn, Verena Kersken, Benedikt Reuter, Niklas Egger,\n  Gottfried Zimmermann","authorsParsed":[["Kuhn","Korbinian",""],["Kersken","Verena",""],["Reuter","Benedikt",""],["Egger","Niklas",""],["Zimmermann","Gottfried",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 06:38:55 GMT"}],"updateDate":"2024-08-30","timestamp":1724913535000,"abstract":"  For d/Deaf and hard of hearing (DHH) people, captioning is an essential\naccessibility tool. Significant developments in artificial intelligence (AI)\nmean that Automatic Speech Recognition (ASR) is now a part of many popular\napplications. This makes creating captions easy and broadly available - but\ntranscription needs high levels of accuracy to be accessible. Scientific\npublications and industry report very low error rates, claiming AI has reached\nhuman parity or even outperforms manual transcription. At the same time the DHH\ncommunity reports serious issues with the accuracy and reliability of ASR.\nThere seems to be a mismatch between technical innovations and the real-life\nexperience for people who depend on transcription. Independent and\ncomprehensive data is needed to capture the state of ASR. We measured the\nperformance of eleven common ASR services with recordings of Higher Education\nlectures. We evaluated the influence of technical conditions like streaming,\nthe use of vocabularies, and differences between languages. Our results show\nthat accuracy ranges widely between vendors and for the individual audio\nsamples. We also measured a significant lower quality for streaming ASR, which\nis used for live events. Our study shows that despite the recent improvements\nof ASR, common services lack reliability in accuracy.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2gzGaNVVFLXlA3C2UNjBslmC98WxOJKkMi_71-W578A","pdfSize":"1523459"}
