{"id":"2408.14635","title":"Low-cost Monitoring of Energetic Particle Precipitation: Weather\n  Balloon-borne Timepix Measurements During the May 2024 Superstorm","authors":"L. Olifer, P. Manavalan, D. Headrick, S. Palmers, B. Harbarenko, J.\n  Cai, J. Fourie, O. Bauer, I. Mann","authorsParsed":[["Olifer","L.",""],["Manavalan","P.",""],["Headrick","D.",""],["Palmers","S.",""],["Harbarenko","B.",""],["Cai","J.",""],["Fourie","J.",""],["Bauer","O.",""],["Mann","I.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 20:59:48 GMT"}],"updateDate":"2024-08-28","timestamp":1724705988000,"abstract":"  Understanding energetic electron precipitation is crucial for accurate space\nweather modeling and forecasting, impacting the Earth's upper atmosphere and\nhuman infrastructure. This study presents a low-cost, low-mass, and low-power\nsolution for high-fidelity analysis of electron precipitation events by\nmeasuring the resulting bremsstrahlung X-ray emissions. Specifically, we report\non results from the flight of a radiation detector payload based on a silicon\npixel read-out Timepix detector technology, and its successful utilization\nonboard a `burster' weather balloon. We launched this payload during the May\n2024 superstorm, capturing high-resolution measurements of both background\ngalactic cosmic ray radiation as well as storm-time energetic electron\nprecipitation. We further developed particle and radiation detection algorithms\nto separate bremsstrahlung X-rays from other particle species in the\npixel-resolved trajectories as seen in the Timepix detector. The measurements\nrevealed a distinctive four-peak structure in X-ray flux, corresponding to\nperiodic four-minute-long bursts of energetic electron precipitation between\n21:20 and 21:40 UT. This precipitation was also observed by a riometer station\nclose to the balloon launch path, further validating balloon measurements and\nthe developed X-ray identification algorithm. The clear periodic structure of\nthe measured precipitation is likely caused by modulation of the electron\nlosses from the radiation belt by harmonic Pc5 ULF waves, observed\ncontemporaneously on the ground. The study underscores the potential of\ncompact, low-cost payloads for advancing our understanding of space weather.\nSpecifically, we envision a potential use of such Timepix-based detectors in\nspace science, for example on sounding rockets or nano-, micro-, and small\nsatellite platforms.\n","subjects":["Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}