{"id":"2408.12607","title":"Interactive Design-of-Experiments: Optimizing a Cooling System","authors":"Rainer Splechtna, Majid Behravan, Mario Jelovic, Denis Gracanin,\n  Helwig Hauser, Kresimir Matkovic","authorsParsed":[["Splechtna","Rainer",""],["Behravan","Majid",""],["Jelovic","Mario",""],["Gracanin","Denis",""],["Hauser","Helwig",""],["Matkovic","Kresimir",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 06:24:57 GMT"}],"updateDate":"2024-08-26","timestamp":1723098297000,"abstract":"  The optimization of cooling systems is important in many cases, for example\nfor cabin and battery cooling in electric cars. Such an optimization is\ngoverned by multiple, conflicting objectives and it is performed across a\nmulti-dimensional parameter space. The extent of the parameter space, the\ncomplexity of the non-linear model of the system, as well as the time needed\nper simulation run and factors that are not modeled in the simulation\nnecessitate an iterative, semi-automatic approach. We present an interactive\nvisual optimization approach, where the user works with a p-h diagram to steer\nan iterative, guided optimization process. A deep learning (DL) model provides\nestimates for parameters, given a target characterization of the system, while\nnumerical simulation is used to compute system characteristics for an ensemble\nof parameter sets. Since the DL model only serves as an approximation of the\ninverse of the cooling system and since target characteristics can be chosen\naccording to different, competing objectives, an iterative optimization process\nis realized, developing multiple sets of intermediate solutions, which are\nvisually related to each other. The standard p-h diagram, integrated\ninteractively in this approach, is complemented by a dual, also interactive\nvisual representation of additional expressive measures representing the system\ncharacteristics. We show how the known four-points semantic of the p-h diagram\nmeaningfully transfers to the dual data representation. When evaluating this\napproach in the automotive domain, we found that our solution helped with the\noverall comprehension of the cooling system and that it lead to a faster\nconvergence during optimization.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}