{"id":"2408.11752","title":"Consensus over Clustered Networks Using Intermittent and Asynchronous\n  Output Feedback","authors":"Federico M. Zegers, Sean Phillips","authorsParsed":[["Zegers","Federico M.",""],["Phillips","Sean",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 16:23:07 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 13:06:28 GMT"}],"updateDate":"2024-08-26","timestamp":1724257387000,"abstract":"  In recent years, multi-agent teaming has garnered considerable interest since\ncomplex objectives, such as intelligence, surveillance, and reconnaissance, can\nbe divided into multiple cluster-level sub-tasks and assigned to a cluster of\nagents with the appropriate functionality. Yet, coordination and information\ndissemination between clusters may be necessary to accomplish a desired\nobjective. Distributed consensus protocols provide a mechanism for spreading\ninformation within clustered networks, allowing agents and clusters to make\ndecisions without requiring direct access to the state of the ensemble. Hence,\nwe propose a strategy for achieving system-wide consensus in the states of\nidentical linear time-invariant systems coupled by an undirected graph whose\ndirected sub-graphs are available only at sporadic times. Within this work, the\nagents of the network are organized into pairwise disjoint clusters, which\ninduce sub-graphs of the undirected parent graph. Some cluster sub-graph pairs\nare linked by an inter-cluster sub-graph, where the union of all cluster and\ninter-cluster sub-graphs yields the undirected parent graph. Each agent\nutilizes a distributed consensus protocol with components that are updated\nintermittently and asynchronously with respect to other agents. The closed-loop\nensemble dynamics is modeled as a hybrid system, and a Lyapunov-based stability\nanalysis yields sufficient conditions for rendering the agreement subspace\n(consensus set) globally exponentially stable. Furthermore, an input-to-state\nstability argument demonstrates the consensus set is robust to a class of\nperturbations. A numerical simulation considering both nominal and perturbed\nscenarios is provided for validation purposes.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}