{"id":"2408.16069","title":"Hitting the Gym: Reinforcement Learning Control of Exercise-Strengthened\n  Biohybrid Robots in Simulation","authors":"Saul Schaffer, Hima Hrithik Pamu, Victoria A. Webster-Wood","authorsParsed":[["Schaffer","Saul",""],["Pamu","Hima Hrithik",""],["Webster-Wood","Victoria A.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:09:24 GMT"}],"updateDate":"2024-08-30","timestamp":1724868564000,"abstract":"  Animals can accomplish many incredible behavioral feats across a wide range\nof operational environments and scales that current robots struggle to match.\nOne explanation for this performance gap is the extraordinary properties of the\nbiological materials that comprise animals, such as muscle tissue. Using living\nmuscle tissue as an actuator can endow robotic systems with highly desirable\nproperties such as self-healing, compliance, and biocompatibility. Unlike\ntraditional soft robotic actuators, living muscle biohybrid actuators exhibit\nunique adaptability, growing stronger with use. The dependency of a muscle's\nforce output on its use history endows muscular organisms the ability to\ndynamically adapt to their environment, getting better at tasks over time.\nWhile muscle adaptability is a benefit to muscular organisms, it currently\npresents a challenge for biohybrid researchers: how does one design and control\na robot whose actuators' force output changes over time? Here, we incorporate\nmuscle adaptability into a many-muscle biohybrid robot design and modeling\ntool, leveraging reinforcement learning as both a co-design partner and system\ncontroller. As a controller, our learning agents coordinated the independent\ncontraction of 42 muscles distributed on a lattice worm structure to\nsuccessfully steer it towards eight distinct targets while incorporating muscle\nadaptability. As a co-design tool, our agents enable users to identify which\nmuscles are important to accomplishing a given task. Our results show that\nadaptive agents outperform non-adaptive agents in terms of maximum rewards and\ntraining time. Together, these contributions can both enable the elucidation of\nmuscle actuator adaptation and inform the design and modeling of adaptive,\nperformant, many-muscle robots.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/"}