{"id":"2408.09297","title":"Out-of-distribution materials property prediction using adversarial\n  learning based fine-tuning","authors":"Qinyang Li, Nicholas Miklaucic, Jianjun Hu","authorsParsed":[["Li","Qinyang",""],["Miklaucic","Nicholas",""],["Hu","Jianjun",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 21:22:21 GMT"}],"updateDate":"2024-08-20","timestamp":1723929741000,"abstract":"  The accurate prediction of material properties is crucial in a wide range of\nscientific and engineering disciplines. Machine learning (ML) has advanced the\nstate of the art in this field, enabling scientists to discover novel materials\nand design materials with specific desired properties. However, one major\nchallenge that persists in material property prediction is the generalization\nof models to out-of-distribution (OOD) samples,i.e., samples that differ\nsignificantly from those encountered during training. In this paper, we explore\nthe application of advancements in OOD learning approaches to enhance the\nrobustness and reliability of material property prediction models. We propose\nand apply the Crystal Adversarial Learning (CAL) algorithm for OOD materials\nproperty prediction,which generates synthetic data during training to bias the\ntraining towards those samples with high prediction uncertainty. We further\npropose an adversarial learning based targeting finetuning approach to make the\nmodel adapted to a particular OOD dataset, as an alternative to traditional\nfine-tuning. Our experiments demonstrate the success of our CAL algorithm with\nits high effectiveness in ML with limited samples which commonly occurs in\nmaterials science. Our work represents a promising direction toward better OOD\nlearning and materials property prediction.\n","subjects":["Condensed Matter/Materials Science","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"hARc8HILDv4aL7IWcx62QtiYKHnk9Q0xEO8QtjdoG-c","pdfSize":"1017035"}
