{"id":"2408.08612","title":"Atomic-Scale Imaging of Fractional Spinon Quasiparticles in Open-Shell\n  Triangulene Spin-$\\frac{1}{2}$ Chains","authors":"Zhangyu Yuan, Xin-Yu Zhang, Yashi Jiang, Xiangjian Qian, Ying Wang,\n  Yufeng Liu, Liang Liu, Xiaoxue Liu, Dandan Guan, Yaoyi Li, Hao Zheng, Canhua\n  Liu, Jinfeng Jia, Mingpu Qin, Pei-Nian Liu, Deng-Yuan Li, Shiyong Wang","authorsParsed":[["Yuan","Zhangyu",""],["Zhang","Xin-Yu",""],["Jiang","Yashi",""],["Qian","Xiangjian",""],["Wang","Ying",""],["Liu","Yufeng",""],["Liu","Liang",""],["Liu","Xiaoxue",""],["Guan","Dandan",""],["Li","Yaoyi",""],["Zheng","Hao",""],["Liu","Canhua",""],["Jia","Jinfeng",""],["Qin","Mingpu",""],["Liu","Pei-Nian",""],["Li","Deng-Yuan",""],["Wang","Shiyong",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 08:55:45 GMT"}],"updateDate":"2024-08-19","timestamp":1723798545000,"abstract":"  The emergence of spinon quasiparticles, which carry spin but lack charge, is\na hallmark of collective quantum phenomena in low-dimensional quantum spin\nsystems. While the existence of spinons has been demonstrated through\nscattering spectroscopy in ensemble samples, real-space imaging of these\nquasiparticles within individual spin chains has remained elusive. In this\nstudy, we construct individual Heisenberg antiferromagnetic spin-$\\frac{1}{2}$\nchains using open-shell [2]triangulene molecules as building blocks. Each\n[2]triangulene unit, owing to its sublattice imbalance, hosts a net\nspin-$\\frac{1}{2}$ in accordance with Lieb's theorem, and these spins are\nantiferromagnetically coupled within covalent chains with a coupling strength\nof $J = 45$ meV. Through scanning tunneling microscopy and spectroscopy, we\nprobe the spin states, excitation gaps, and their spatial excitation weights\nwithin covalent spin chains of varying lengths with atomic precision. Our\ninvestigation reveals that the excitation gap decreases as the chain length\nincreases, extrapolating to zero for long chains, consistent with Haldane's\ngapless prediction. Moreover, inelastic tunneling spectroscopy reveals an\nm-shaped energy dispersion characteristic of confined spinon quasiparticles in\na one-dimensional quantum box. These findings establish a promising strategy\nfor exploring the unique properties of excitation quasiparticles and their\nbroad implications for quantum information.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}