{"id":"2408.12537","title":"Core formation by binary scouring and gravitational wave recoil in\n  massive elliptical galaxies","authors":"Nader Khonji (1), Alessia Gualandris (1), Justin I. Read (1) and\n  Walter Dehnen (2) ((1) University of Surrey, Guildford, UK, (2) Zentrum f\\\"ur\n  Astronomie der Universit\\\"at Heidelberg, Germany)","authorsParsed":[["Khonji","Nader",""],["Gualandris","Alessia",""],["Read","Justin I.",""],["Dehnen","Walter",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 16:47:22 GMT"}],"updateDate":"2024-08-23","timestamp":1724345242000,"abstract":"  Scouring by supermassive black hole (SMBH) binaries is the most accepted\nmechanism for the formation of the cores seen in giant elliptical galaxies.\nHowever, an additional mechanism is required to explain the largest observed\ncores. Gravitational wave (GW) recoil is expected to trigger further growth of\nthe core, as subsequent heating from dynamical friction of the merged SMBH\nremoves stars from the central regions. We model core formation in massive\nelliptical galaxies from both binary scouring and heating by GW recoil and\nexamine their unique signatures. We aim to determine if the nature of cores in\n3D space density can be attributed uniquely to either process and if the\nmagnitude of the kick can be inferred. We perform $N$-body simulations of\ngalactic mergers of multicomponent galaxies, based on the observed parameters\nof four massive elliptical galaxies with cores $> 0.5$ kpc. After binary\nscouring and hardening, the merged SMBH remnant is given a range of GW recoil\nkicks with $0.5$-$0.9$ of the escape speed of the galaxy. We find that binary\nscouring alone can form the cores of NGC 1600 and A2147-BCG, which are $< 1.3$\nkpc in size. However, the $> 2$ kpc cores in NGC 6166 and A2261-BCG require\nheating from GW recoil kicks of $< 0.5$ of the galaxy escape speed. A unique\nfeature of GW recoil heating is flatter cores in surface brightness,\ncorresponding to truly flat cores in 3D space density. It also preferentially\nremoves stars on low angular momentum orbits from the galactic nucleus.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}