{"id":"2408.16159","title":"Integrating Quantum Computing Resources into Scientific HPC Ecosystems","authors":"Thomas Beck, Alessandro Baroni, Ryan Bennink, Gilles Buchs, Eduardo\n  Antonio Coello Perez, Markus Eisenbach, Rafael Ferreira da Silva,\n  Muralikrishnan Gopalakrishnan Meena, Kalyan Gottiparthi, Peter Groszkowski,\n  Travis S. Humble, Ryan Landfield, Ketan Maheshwari, Sarp Oral, Michael A.\n  Sandoval, Amir Shehata, In-Saeng Suh, Christopher Zimmer","authorsParsed":[["Beck","Thomas",""],["Baroni","Alessandro",""],["Bennink","Ryan",""],["Buchs","Gilles",""],["Perez","Eduardo Antonio Coello",""],["Eisenbach","Markus",""],["da Silva","Rafael Ferreira",""],["Meena","Muralikrishnan Gopalakrishnan",""],["Gottiparthi","Kalyan",""],["Groszkowski","Peter",""],["Humble","Travis S.",""],["Landfield","Ryan",""],["Maheshwari","Ketan",""],["Oral","Sarp",""],["Sandoval","Michael A.",""],["Shehata","Amir",""],["Suh","In-Saeng",""],["Zimmer","Christopher",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 22:44:54 GMT"}],"updateDate":"2024-08-30","timestamp":1724885094000,"abstract":"  Quantum Computing (QC) offers significant potential to enhance scientific\ndiscovery in fields such as quantum chemistry, optimization, and artificial\nintelligence. Yet QC faces challenges due to the noisy intermediate-scale\nquantum era's inherent external noise issues. This paper discusses the\nintegration of QC as a computational accelerator within classical scientific\nhigh-performance computing (HPC) systems. By leveraging a broad spectrum of\nsimulators and hardware technologies, we propose a hardware-agnostic framework\nfor augmenting classical HPC with QC capabilities. Drawing on the HPC expertise\nof the Oak Ridge National Laboratory (ORNL) and the HPC lifecycle management of\nthe Department of Energy (DOE), our approach focuses on the strategic\nincorporation of QC capabilities and acceleration into existing scientific HPC\nworkflows. This includes detailed analyses, benchmarks, and code optimization\ndriven by the needs of the DOE and ORNL missions. Our comprehensive framework\nintegrates hardware, software, workflows, and user interfaces to foster a\nsynergistic environment for quantum and classical computing research. This\npaper outlines plans to unlock new computational possibilities, driving forward\nscientific inquiry and innovation in a wide array of research domains.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/"}