{"id":"2408.16840","title":"Composition, Structure and Origin of the Moon","authors":"Paolo A. Sossi, Miki Nakajima, Amir Khan","authorsParsed":[["Sossi","Paolo A.",""],["Nakajima","Miki",""],["Khan","Amir",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:06:37 GMT"}],"updateDate":"2024-09-02","timestamp":1724954797000,"abstract":"  Here we critically examine the geophysical and geochemical properties of the\nMoon in order to identify the extent to which dynamical scenarios satisfy these\nobservations. New joint inversions of existing lunar geophysical data (mean\nmass, moment of inertia, and tidal response) assuming a laterally- and\nvertically homogeneous lunar mantle show that, in all cases, a core with a\nradius of 300$\\pm$20 km ($\\sim$0.8 to 1.5 % the mass of the Moon) is required.\nHowever, an Earth-like Mg# (0.89) in the lunar mantle results in core densities\n(7800$\\pm$100 kg/m$^3$) consistent with that of Fe-Ni alloy, whereas FeO-rich\ncompositions (Mg# = 0.80--0.84) require lower densities (6100$\\pm$800\nkg/m$^3$). Geochemically, we use new data on mare basalts to reassess the bulk\ncomposition of the Moon for 70 elements, and show that the lunar core likely\nformed near 5 GPa, 2100 K and $\\sim$1 log unit below the iron-w\\\"ustite buffer.\nMoreover, the Moon is depleted relative to the Earth's mantle in elements with\nvolatilities higher than that of Li, with this volatile loss likely having\noccurred at low temperatures (1400$\\pm$100 K), consistent with mass-dependent\nstable isotope fractionation of moderately volatile elements (e.g., Zn, K, Rb).\nThe identical nucleosynthetic (O, Cr, Ti) and radiogenic (W) isotope\ncompositions of the lunar and terrestrial mantles, strongly suggest the two\nbodies were made from the same material, rather than from an Earth-like\nimpactor. Rb-Sr in FANs and Lu-Hf and Pb-Pb zircon ages point Moon formation\nclose to $\\sim$4500 Ma. Taken together, there is no unambiguous geochemical or\nisotopic evidence for the role of an impactor in the formation of the Moon,\nimplying perfect equilibration between the proto-Earth and Moon-forming\nmaterial or alternative scenarios for its genesis.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}