{"id":"2408.11020","title":"Temporal solitons in active optical resonators","authors":"Dmitry Kazakov, Federico Capasso, and Marco Piccardo","authorsParsed":[["Kazakov","Dmitry",""],["Capasso","Federico",""],["Piccardo","Marco",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 17:20:31 GMT"}],"updateDate":"2024-08-21","timestamp":1724174431000,"abstract":"  Solitons, as coherent structures that maintain their shape while traveling at\nconstant velocity, are ubiquitous across various branches of physics, from\nfluid dynamics to quantum fields. However, it is within the realm of optics\nwhere solitons have not only served as a primary testbed for understanding\nsolitary wave phenomena but have also transitioned into applications ranging\nfrom telecommunications to metrology. In the optical domain, temporal solitons\nare localized light pulses, self-reinforcing via a delicate balance between\nnonlinearity and dispersion. Among the many systems hosting temporal solitons,\nactive optical resonators stand out due to their inherent gain medium, enabling\nto actively sustain solitons. Unlike conventional modelocked lasers, active\nresonators offer a richer landscape for soliton dynamics through hybrid driving\nschemes, such as coupling to passive cavities or under external optical\ninjection, affording them unparalleled control and versatility. We discuss key\nadvantages of these systems, with a particular focus on quantum cascade lasers\nas a promising soliton technology within the class of active resonators. By\nexploring diverse architectures from traditional Fabry-Perot cavities to\nracetrack devices operated under external injection, we present the current\nstate-of-the-art and future directions for soliton-based sources in the realm\nof semiconductor lasers and hybrid integrated photonic systems.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"h6UFFlJoE6k0KSl65LM8Vjp8tsOB_pB3dWnDAYWKico","pdfSize":"11780714"}
