{"id":"2408.07989","title":"IIU: Independent Inference Units for Knowledge-based Visual Question\n  Answering","authors":"Yili Li, Jing Yu, Keke Gai, Gang Xiong","authorsParsed":[["Li","Yili",""],["Yu","Jing",""],["Gai","Keke",""],["Xiong","Gang",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 07:30:47 GMT"}],"updateDate":"2024-08-16","timestamp":1723707047000,"abstract":"  Knowledge-based visual question answering requires external knowledge beyond\nvisible content to answer the question correctly. One limitation of existing\nmethods is that they focus more on modeling the inter-modal and intra-modal\ncorrelations, which entangles complex multimodal clues by implicit embeddings\nand lacks interpretability and generalization ability. The key challenge to\nsolve the above problem is to separate the information and process it\nseparately at the functional level. By reusing each processing unit, the\ngeneralization ability of the model to deal with different data can be\nincreased. In this paper, we propose Independent Inference Units (IIU) for\nfine-grained multi-modal reasoning to decompose intra-modal information by the\nfunctionally independent units. Specifically, IIU processes each\nsemantic-specific intra-modal clue by an independent inference unit, which also\ncollects complementary information by communication from different units. To\nfurther reduce the impact of redundant information, we propose a memory update\nmodule to maintain semantic-relevant memory along with the reasoning process\ngradually. In comparison with existing non-pretrained multi-modal reasoning\nmodels on standard datasets, our model achieves a new state-of-the-art,\nenhancing performance by 3%, and surpassing basic pretrained multi-modal\nmodels. The experimental results show that our IIU model is effective in\ndisentangling intra-modal clues as well as reasoning units to provide\nexplainable reasoning evidence. Our code is available at\nhttps://github.com/Lilidamowang/IIU.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8jPPkoej5V2tBZsrfeIZxC-nzg9gJUyqsP1cadQ1Yz0","pdfSize":"6419948"}
