{"id":"2408.06340","title":"Thermodynamical string fragmentation and QGP-like effects in jets","authors":"Robert Vertesi and Antonio Ortiz","authorsParsed":[["Vertesi","Robert",""],["Ortiz","Antonio",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 17:57:49 GMT"}],"updateDate":"2024-08-13","timestamp":1723485469000,"abstract":"  It has been proposed to search for thermal and collective properties arising\nfrom parton-fragmentation processes by examining high jet charged-constituent\nmultiplicities ($N_{\\rm j,ch}$) in proton-proton (pp) collisions. This proposal\nwas initially tested using the PYTHIA 8 event generator with the Monash tune,\nwhich incorporates multiparton interactions (MPI) and the MPI-based colour\nreconnection (CR) model. These studies did not reveal any strangeness\nenhancement, nor provide conclusive evidence for the presence of radial flow.\nIn this letter, we expand upon the proposed Monte Carlo study by eliminating\nselection biases associated with triggering on charged particle multiplicities.\nFurthermore, MPI are disabled to focus exclusively on jet fragments. We analyse\npp collisions at $\\sqrt{s}$=13 TeV simulated with PYTHIA 8, exploring different\nimplementations of the generator: thermodynamical string fragmentation and the\nstandard Lund fragmentation model, considering various CR models. Surprisingly,\nthe thermodynamical string fragmentation model predicts a hint of strangeness\nenhancement in jets. Additionally, the light-flavor baryon-to-meson ratios as a\nfunction of $j_{\\rm T}$ exhibit similarities across all PYTHIA 8\nimplementations, and hint at radial flow-like effects. In contrast, the ratio\nof heavy-flavor hadrons (${\\Lambda_{\\rm c}^+}/{\\rm D^0}$) at low $j_{\\rm T}$ as\na function of $N_{\\rm j,ch}$ shows a similar trend to that observed as a\nfunction of charged-particle multiplicity in soft data, suggesting that colour\nstring junctions may play an important role in jet development.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"rBrllTD4Jn1MDunKpf6qh9GWsIeKlw3AMSGidKYsXXA","pdfSize":"518995"}
