{"id":"2408.09717","title":"SEMDR: A Semantic-Aware Dual Encoder Model for Legal Judgment Prediction\n  with Legal Clue Tracing","authors":"Pengjie Liu, Wang Zhang, Yulong Ding, Xuefeng Zhang, Shuang-Hua Yang","authorsParsed":[["Liu","Pengjie",""],["Zhang","Wang",""],["Ding","Yulong",""],["Zhang","Xuefeng",""],["Yang","Shuang-Hua",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 06:13:19 GMT"}],"updateDate":"2024-08-20","timestamp":1724047999000,"abstract":"  Legal Judgment Prediction (LJP) aims to form legal judgments based on the\ncriminal fact description. However, researchers struggle to classify confusing\ncriminal cases, such as robbery and theft, which requires LJP models to\ndistinguish the nuances between similar crimes. Existing methods usually design\nhandcrafted features to pick up necessary semantic legal clues to make more\naccurate legal judgment predictions. In this paper, we propose a Semantic-Aware\nDual Encoder Model (SEMDR), which designs a novel legal clue tracing mechanism\nto conduct fine-grained semantic reasoning between criminal facts and\ninstruments. Our legal clue tracing mechanism is built from three reasoning\nlevels: 1) Lexicon-Tracing, which aims to extract criminal facts from criminal\ndescriptions; 2) Sentence Representation Learning, which contrastively trains\nlanguage models to better represent confusing criminal facts; 3) Multi-Fact\nReasoning, which builds a reasons graph to propagate semantic clues among fact\nnodes to capture the subtle difference among criminal facts. Our legal clue\ntracing mechanism helps SEMDR achieve state-of-the-art on the CAIL2018 dataset\nand shows its advance in few-shot scenarios. Our experiments show that SEMDR\nhas a strong ability to learn more uniform and distinguished representations\nfor criminal facts, which helps to make more accurate predictions on confusing\ncriminal cases and reduces the model uncertainty during making judgments. All\ncodes will be released via GitHub.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}