{"id":"2408.16413","title":"Chemometrics-aided Surface-enhanced Raman spectrometric detection and\n  quantification of GH and TE hormones in blood","authors":"Annah M. Ondieki, Zephania Birech, Kenneth A. Kaduki, Peter W. Mwangi,\n  Moses Juma, and Boniface M. Chege","authorsParsed":[["Ondieki","Annah M.",""],["Birech","Zephania",""],["Kaduki","Kenneth A.",""],["Mwangi","Peter W.",""],["Juma","Moses",""],["Chege","Boniface M.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 10:20:32 GMT"}],"updateDate":"2024-08-30","timestamp":1724926832000,"abstract":"  This work explores the use of Surface-Enhanced Raman Spectroscopy (SERS)\ncombined with artificial neural network (ANN) models to detect and quantify\ngrowth hormone (GH) and testosterone (TE) in the blood of Sprague Dawley (SD)\nrats. SERS spectra were recorded from blood samples of SD rats injected with\nGH, TE, both hormones, and non-injected controls using 785 nm laser excitation.\nThe samples were mixed with silver nanoparticles (AgNPs) synthesized in\ndistilled water, applied onto a microscope slide, and air-dried. The resulting\nSERS spectra displayed similar profiles with intensity variations depending on\nthe hormone, revealing specific bands at 658, 798, 878, 914, 932, 1064, 1190,\n1354, 1410, and 1658 cm-1. PCA analysis indicated time-dependent intensity\nchanges in bands centered around 1378 (all groups), 658 and 1614 cm-1\n(GH-injected rats), and others for different hormone combinations. These\nvariations reflect subtle biochemical changes induced by hormone injections.\nThe ANN models, trained with six PCA scores of blood spiked with various\nhormone concentrations, showed high accuracy, with coefficients of\ndetermination greater than 87.71% and low root mean square error (RMSE) values\nbelow 0.6436. The hormone levels in injected rats increased initially and later\ndeclined, a trend confirmed by ELISA kits. Although ELISA and SERS produced\nsimilar results, SERS offered advantages such as rapid analysis (about two\nminutes), simple sample preparation, small sample volumes, and non-specificity\nto hormones. This suggests that SERS, combined with ANN models, could be used\nto detect exogenous sports dopants. These findings expand the potential\napplications of SERS in sports science, clinical diagnostics, and biomedical\nresearch.\n","subjects":["Physics/Medical Physics","Physics/Optics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}