{"id":"2408.14694","title":"Searching for GEMS: Characterizing Six Giant Planets around Cool Dwarfs","authors":"Shubham Kanodia, Arvind F. Gupta, Caleb I. Canas, Lia Marta Bernabo,\n  Varghese Reji, Te Han, Madison Brady, Andreas Seifahrt, William D. Cochran,\n  Nidia Morrell, Ritvik Basant, Jacob Bean, Chad F. Bender, Zoe L. de Beurs,\n  Allyson Bieryla, Alexina Birkholz, Nina Brown, Franklin Chapman, David R.\n  Ciardi, Catherine A. Clark, Ethan G. Cotter, Scott A. Diddams, Samuel\n  Halverson, Suzanne Hawley, Leslie Hebb, Rae Holcomb, Steve B. Howell, Henry\n  A. Kobulnicky, Adam F. Kowalski, Alexander Larsen, Jessica Libby-Roberts,\n  Andrea S.J. Lin, Michael B. Lund, Rafael Luque, Andrew Monson, Joe P. Ninan,\n  Brock A. Parker, Nishka Patel, Michael Rodruck, Gabrielle Ross, Arpita Roy,\n  Christian Schwab, Gu{\\dh}mundur Stef\\'ansson, Aubrie Thoms, Andrew Vanderburg","authorsParsed":[["Kanodia","Shubham",""],["Gupta","Arvind F.",""],["Canas","Caleb I.",""],["Bernabo","Lia Marta",""],["Reji","Varghese",""],["Han","Te",""],["Brady","Madison",""],["Seifahrt","Andreas",""],["Cochran","William D.",""],["Morrell","Nidia",""],["Basant","Ritvik",""],["Bean","Jacob",""],["Bender","Chad F.",""],["de Beurs","Zoe L.",""],["Bieryla","Allyson",""],["Birkholz","Alexina",""],["Brown","Nina",""],["Chapman","Franklin",""],["Ciardi","David R.",""],["Clark","Catherine A.",""],["Cotter","Ethan G.",""],["Diddams","Scott A.",""],["Halverson","Samuel",""],["Hawley","Suzanne",""],["Hebb","Leslie",""],["Holcomb","Rae",""],["Howell","Steve B.",""],["Kobulnicky","Henry A.",""],["Kowalski","Adam F.",""],["Larsen","Alexander",""],["Libby-Roberts","Jessica",""],["Lin","Andrea S. J.",""],["Lund","Michael B.",""],["Luque","Rafael",""],["Monson","Andrew",""],["Ninan","Joe P.",""],["Parker","Brock A.",""],["Patel","Nishka",""],["Rodruck","Michael",""],["Ross","Gabrielle",""],["Roy","Arpita",""],["Schwab","Christian",""],["Stefánsson","Guðmundur",""],["Thoms","Aubrie",""],["Vanderburg","Andrew",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 23:47:24 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 01:13:26 GMT"}],"updateDate":"2024-08-29","timestamp":1724716044000,"abstract":"  Transiting giant exoplanets around M-dwarf stars (GEMS) are rare, owing to\nthe low-mass host stars. However, the all-sky coverage of TESS has enabled the\ndetection of an increasingly large number of them to enable statistical surveys\nlike the \\textit{Searching for GEMS} survey. As part of this endeavour, we\ndescribe the observations of six transiting giant planets, which includes\nprecise mass measurements for two GEMS (K2-419Ab, TOI-6034b) and statistical\nvalidation for four systems, which includes validation and mass upper limits\nfor three of them (TOI-5218b, TOI-5616b, TOI-5634Ab), while the fourth one --\nTOI-5414b is classified as a `likely planet'. Our observations include radial\nvelocities from the Habitable-zone Planet Finder on the Hobby-Eberly Telescope,\nand MAROON-X on Gemini-North, along with photometry and high-contrast imaging\nfrom multiple ground-based facilities. In addition to TESS photometry, K2-419Ab\nwas also observed and statistically validated as part of the K2 mission in\nCampaigns 5 and 18, which provides precise orbital and planetary constraints\ndespite the faint host star and long orbital period of $\\sim 20.4$ days. With\nan equilibrium temperature of only 380 K, K2-419Ab is one of the coolest known\nwell-characterized transiting planets. TOI-6034 has a late F-type companion\nabout 40\\arcsec~away, making it the first GEMS host star to have an earlier\nmain-sequence binary companion. These confirmations add to the existing small\nsample of confirmed transiting GEMS.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OHrvlzDRC6BjliFpBBwoKGXVjeeAfkOFDKxzvdclHhw","pdfSize":"6621694"}
