{"id":"2408.11984","title":"Chemical Reaction Neural Networks for Fitting Accelerating Rate\n  Calorimetry Data","authors":"Saakaar Bhatnagar, Andrew Comerford, Zelu Xu, Davide Berti Polato,\n  Araz Banaeizadeh, Alessandro Ferraris","authorsParsed":[["Bhatnagar","Saakaar",""],["Comerford","Andrew",""],["Xu","Zelu",""],["Polato","Davide Berti",""],["Banaeizadeh","Araz",""],["Ferraris","Alessandro",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 20:39:41 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 16:31:21 GMT"}],"updateDate":"2024-09-04","timestamp":1724272781000,"abstract":"  As the demand for lithium-ion batteries rapidly increases there is a need to\ndesign these cells in a safe manner to mitigate thermal runaway. Thermal\nrunaway in batteries leads to an uncontrollable temperature rise and\npotentially fires, which is a major safety concern. Typically, when modelling\nthe chemical kinetics of thermal runaway calorimetry data ( e.g. Accelerating\nRate Calorimetry (ARC)) is needed to determine the temperature-driven\ndecomposition kinetics. Conventional methods of fitting Arrhenius Ordinary\nDifferential Equation (ODE) thermal runaway models to Accelerated Rate\nCalorimetry (ARC) data make several assumptions that reduce the fidelity and\ngeneralizability of the obtained model. In this paper, Chemical Reaction Neural\nNetworks (CRNNs) are trained to fit the kinetic parameters of N-equation\nArrhenius ODEs to ARC data obtained from a Molicel 21700 P45B. The models are\nfound to be better approximations of the experimental data. The flexibility of\nthe method is demonstrated by experimenting with two-equation and four-equation\nmodels. Thermal runaway simulations are conducted in 3D using the obtained\nkinetic parameters, showing the applicability of the obtained thermal runaway\nmodels to large-scale simulations.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}