{"id":"2408.07894","title":"System States Forecasting of Microservices with Dynamic Spatio-Temporal\n  Data","authors":"Yifei Xu, Jingguo Ge, Haina Tang, Shuai Ding, Tong Li, Hui Li","authorsParsed":[["Xu","Yifei",""],["Ge","Jingguo",""],["Tang","Haina",""],["Ding","Shuai",""],["Li","Tong",""],["Li","Hui",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 02:52:02 GMT"}],"updateDate":"2024-08-16","timestamp":1723690322000,"abstract":"  In the AIOps (Artificial Intelligence for IT Operations) era, accurately\nforecasting system states is crucial. In microservices systems, this task\nencounters the challenge of dynamic and complex spatio-temporal relationships\namong microservice instances, primarily due to dynamic deployments, diverse\ncall paths, and cascading effects among instances. Current time-series\nforecasting methods, which focus mainly on intrinsic patterns, are insufficient\nin environments where spatial relationships are critical. Similarly,\nspatio-temporal graph approaches often neglect the nature of temporal trend,\nconcentrating mostly on message passing between nodes. Moreover, current\nresearch in microservices domain frequently underestimates the importance of\nnetwork metrics and topological structures in capturing the evolving dynamics\nof systems. This paper introduces STMformer, a model tailored for forecasting\nsystem states in microservices environments, capable of handling multi-node and\nmultivariate time series. Our method leverages dynamic network connection data\nand topological information to assist in modeling the intricate spatio-temporal\nrelationships within the system. Additionally, we integrate the\nPatchCrossAttention module to compute the impact of cascading effects globally.\nWe have developed a dataset based on a microservices system and conducted\ncomprehensive experiments with STMformer against leading methods. In both\nshort-term and long-term forecasting tasks, our model consistently achieved a\n8.6% reduction in MAE(Mean Absolute Error) and a 2.2% reduction in MSE (Mean\nSquared Error). The source code is available at\nhttps://github.com/xuyifeiiie/STMformer.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}