{"id":"2408.10074","title":"Synthesis of Reward Machines for Multi-Agent Equilibrium Design (Full\n  Version)","authors":"Muhammad Najib and Giuseppe Perelli","authorsParsed":[["Najib","Muhammad",""],["Perelli","Giuseppe",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 15:17:58 GMT"}],"updateDate":"2024-08-20","timestamp":1724080678000,"abstract":"  Mechanism design is a well-established game-theoretic paradigm for designing\ngames to achieve desired outcomes. This paper addresses a closely related but\ndistinct concept, equilibrium design. Unlike mechanism design, the designer's\nauthority in equilibrium design is more constrained; she can only modify the\nincentive structures in a given game to achieve certain outcomes without the\nability to create the game from scratch. We study the problem of equilibrium\ndesign using dynamic incentive structures, known as reward machines. We use\nweighted concurrent game structures for the game model, with goals (for the\nplayers and the designer) defined as mean-payoff objectives. We show how reward\nmachines can be used to represent dynamic incentives that allocate rewards in a\nmanner that optimises the designer's goal. We also introduce the main decision\nproblem within our framework, the payoff improvement problem. This problem\nessentially asks whether there exists a dynamic incentive (represented by some\nreward machine) that can improve the designer's payoff by more than a given\nthreshold value. We present two variants of the problem: strong and weak. We\ndemonstrate that both can be solved in polynomial time using a Turing machine\nequipped with an NP oracle. Furthermore, we also establish that these variants\nare either NP-hard or coNP-hard. Finally, we show how to synthesise the\ncorresponding reward machine if it exists.\n","subjects":["Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FV4_TcwIgYwf-Rk_KXZO5uHXGxiVMUhZ5SqgBON33OI","pdfSize":"607766"}
