{"id":"2408.12758","title":"Month-long-lifetime microwave spectral holes in an erbium-doped\n  scheelite crystal at millikelvin temperature","authors":"Zhiren Wang, Sen Lin, Marianne Le Dantec, Milo\\v{s} Ran\\v{c}i\\'c,\n  Philippe Goldner, Sylvain Bertaina, Thierry Chaneli\\`ere, Ren-Bao Liu, Daniel\n  Esteve, Denis Vion, Emmanuel Flurin, Patrice Bertet","authorsParsed":[["Wang","Zhiren",""],["Lin","Sen",""],["Dantec","Marianne Le",""],["Rančić","Miloš",""],["Goldner","Philippe",""],["Bertaina","Sylvain",""],["Chanelière","Thierry",""],["Liu","Ren-Bao",""],["Esteve","Daniel",""],["Vion","Denis",""],["Flurin","Emmanuel",""],["Bertet","Patrice",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 23:01:24 GMT"}],"updateDate":"2024-08-26","timestamp":1724367684000,"abstract":"  Rare-earth-ion (REI) ensembles in crystals have remarkable optical and spin\nproperties characterized by narrow homogeneous linewidths relative to the\ninhomogeneous ensemble broadening. This makes it possible to precisely tailor\nthe ensemble spectral density and therefore the absorption profile by applying\nnarrow-linewidth radiation to transfer population into auxiliary levels, a\nprocess broadly known as spectral hole burning (SHB). REI-doped crystals find\napplications in information processing, both classical (pattern recognition,\nfiltering, spectral analysis) and quantum (photon storage), all protocols\nrequiring suitable ensemble preparation by SHB as a first step. In\nEr$^{3+}$-doped materials, the longest reported hole lifetime is one minute,\nand longer lifetimes are desirable. Here, we report SHB and accumulated echo\nmeasurements in a scheelite crystal of CaWO$_4$ by pumping the electron spin\ntransition of Er$^{3+}$ ions at microwave frequencies and millikelvin\ntemperatures, with nuclear spin states of neighboring $^{183}$W atoms serving\nas the auxiliary levels. The lifetime of the holes and accumulated echoes rises\nsteeply as the sample temperature is decreased, exceeding a month at 10 mK. Our\nresults demonstrate that millikelvin temperatures can be beneficial for signal\nprocessing applications requiring long spectral hole lifetimes.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}