{"id":"2408.01293","title":"Underwater Object Detection Enhancement via Channel Stabilization","authors":"Muhammad Ali, Salman Khan","authorsParsed":[["Ali","Muhammad",""],["Khan","Salman",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 14:28:49 GMT"}],"updateDate":"2024-08-05","timestamp":1722608929000,"abstract":"  The complex marine environment exacerbates the challenges of object detection\nmanifold. Marine trash endangers the aquatic ecosystem, presenting a persistent\nchallenge. Accurate detection of marine deposits is crucial for mitigating this\nharm. Our work addresses underwater object detection by enhancing image quality\nand evaluating detection methods. We use Detectron2's backbone with various\nbase models and configurations for this task.\n  We propose a novel channel stabilization technique alongside a simplified\nimage enhancement model to reduce haze and color cast in training images,\nimproving multi-scale object detection. Following image processing, we test\ndifferent Detectron2 backbones for optimal detection accuracy. Additionally, we\napply a sharpening filter with augmentation techniques to highlight object\nprofiles for easier recognition.\n  Results are demonstrated on the TrashCan Dataset, both instance and material\nversions. The best-performing backbone method incorporates our channel\nstabilization and augmentation techniques. We also compare our Detectron2\ndetection results with the Deformable Transformer. In the instance version of\nTrashCan 1.0, our method achieves a 9.53% absolute increase in average\nprecision for small objects and a 7% absolute gain in bounding box detection\ncompared to the baseline. The code will be available on Code:\nhttps://github.com/aliman80/Underwater-\nObject-Detection-via-Channel-Stablization\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"S0akunEBMa6HleIdXU-KB2koYB8l7vdzSBvXXtYFp7Q","pdfSize":"5688068","txDigest":"2Axg68kuu15YyE4nqj5JV1ST9v4P6gfrpRyyY2KmE2RN","endEpoch":"1","status":"CERTIFIED"}
