{"id":"2408.04485","title":"A Learning-Based Model Predictive Contouring Control for Vehicle Evasive\n  Manoeuvres","authors":"Alberto Bertipaglia, Mohsen Alirezaei, Riender Happee, Barys Shyrokau","authorsParsed":[["Bertipaglia","Alberto",""],["Alirezaei","Mohsen",""],["Happee","Riender",""],["Shyrokau","Barys",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 14:23:23 GMT"}],"updateDate":"2024-08-09","timestamp":1723127003000,"abstract":"  This paper presents a novel Learning-based Model Predictive Contouring\nControl (L-MPCC) algorithm for evasive manoeuvres at the limit of handling. The\nalgorithm uses the Student-t Process (STP) to minimise model mismatches and\nuncertainties online. The proposed STP captures the mismatches between the\nprediction model and the measured lateral tyre forces and yaw rate. The\nmismatches correspond to the posterior means provided to the prediction model\nto improve its accuracy. Simultaneously, the posterior covariances are\npropagated to the vehicle lateral velocity and yaw rate along the prediction\nhorizon. The STP posterior covariance directly depends on the variance of\nobserved data, so its variance is more significant when the online measurements\ndiffer from the recorded ones in the training set and smaller in the opposite\ncase. Thus, these covariances can be utilised in the L-MPCC's cost function to\nminimise the vehicle state uncertainties. In a high-fidelity simulation\nenvironment, we demonstrate that the proposed L-MPCC can successfully avoid\nobstacles, keeping the vehicle stable while driving a double lane change\nmanoeuvre at a higher velocity than an MPCC without STP. Furthermore, the\nproposed controller yields a significantly lower peak sideslip angle, improving\nthe vehicle's manoeuvrability compared to an L-MPCC with a Gaussian Process.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}