{"id":"2408.00030","title":"A New Type of Foundation Model Based on Recordings of People's Emotions\n  and Physiology","authors":"David Gamez, Dionis Barcari and Aliya Grig","authorsParsed":[["Gamez","David",""],["Barcari","Dionis",""],["Grig","Aliya",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 11:14:45 GMT"}],"updateDate":"2024-08-02","timestamp":1722424485000,"abstract":"  Foundation models have had a big impact in recent years and billions of\ndollars are being invested in them in the current AI boom. The more popular\nones, such as Chat-GPT, are trained on large amounts of data from the Internet,\nand then reinforcement learning, RAG, prompt engineering and cognitive\nmodelling are used to fine-tune and augment their behavior. This technology has\nbeen used to create models of individual people, such as Caryn Marjorie.\nHowever, these chatbots are not based on people's actual emotional and\nphysiological responses to their environment, so they are, at best,\nsurface-level approximations to the characters they are imitating. This paper\ndescribes how a new type of foundation model - a first-person foundation model\n- could be created from recordings of what a person sees and hears as well as\ntheir emotional and physiological reactions to these stimuli. A first-person\nfoundation model would map environmental stimuli to a person's emotional and\nphysiological states, and map a person's emotional and physiological states to\ntheir behavior. First-person foundation models have many exciting applications,\nincluding a new type of recommendation engine, personal assistants, generative\nadversarial networks, dating and recruitment. To obtain training data for a\nfirst-person foundation model, we have developed a recording rig that captures\nwhat the wearer is seeing and hearing as well as their emotional and\nphysiological states. This novel source of data could help to address the\nshortage of new data for building the next generation of foundation models.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"czneSuGv4JXAfm-2mGYLkAoJIvZ27gP6O03bHAdduPM","pdfSize":"332223","txDigest":"EdacKd6zL2LsjNWWh2574KSg4yqYBeKYppUs59W8hhyh","endEpoch":"100","status":"CERTIFIED"}
