{"id":"2408.06980","title":"A three-layer model for the dam-break flow of particulate suspensions\n  driven by sedimentation","authors":"Andrea Bondesan, Laurence Girolami, Fran\\c{c}ois James, Lo\\\"ic\n  Rousseau","authorsParsed":[["Bondesan","Andrea",""],["Girolami","Laurence",""],["James","François",""],["Rousseau","Loïc",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 15:38:45 GMT"}],"updateDate":"2024-08-14","timestamp":1723563525000,"abstract":"  We introduce a system of Saint-Venant-type equations to model laboratory\nexperiments of dam-break particle-laden flows. We explore homogeneous and\nnon-cohesive liquid-solid suspensions of monodispersed glass beads that\npropagate as single-phase flows, forming a progressively growing deposit of\nparticles at the bottom of a smooth channel and creating a thin layer of pure\nliquid at the surface. The novelty of this model is twofold. First, we fully\ncharacterize the first-order behavior of these flows (mean velocity, runout\ndistances and deposits geometry) through the sole sedimentation process of the\ngrains, thus avoiding the use of any artificial friction to stop the flow. The\nmodel remains very simple and turns out to be effective despite the complex\nnature of interactions involved in these phenomena. Secondly, the sedimentation\ndynamics of the grains is observed to not being mainly affected by the flow,\nbut remains comparable to that measured in static suspensions. The mathematical\nmodel is validated by comparing the experimental kinematics and deposit\nprofiles with the simulations. The results highlight that this simplified model\nis sufficient to describe the general features of these flows as well as their\ndeposit morphology, provided that the settling rate is adjusted starting from a\ncritical value of the Reynolds number where the flow agitation begins to\nsignificantly delay the mean sedimentation velocity.\n","subjects":["Physics/Fluid Dynamics","Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}