{"id":"2408.14923","title":"Unraveling the Airalo Ecosystem","authors":"Hyunseok Daniel Jang and Matteo Varvello and Andra Lutu and Yasir Zaki","authorsParsed":[["Jang","Hyunseok Daniel",""],["Varvello","Matteo",""],["Lutu","Andra",""],["Zaki","Yasir",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 09:59:32 GMT"}],"updateDate":"2024-08-28","timestamp":1724752772000,"abstract":"  In recent years, we have witnessed myriad flavours of Mobile Network\nAggregators (MNAs) which exploit the coverage footprint of a handful of base\noperators to provide global mobile connectivity. Under the MNA model, emerging\noperators reap the benefits of network softwarization and virtualization,\nincluding eSIM technology or control/data-plane separation. This paper\ninvestigates an emergent MNA type - a thick MNA - that relies on multiple\n(core) base operators from different economies to provision eSIM profiles,\nwhile employing gateway functions to the public internet located outside the\nrespective base operators' home country. Specifically, our work is the first to\ncapture the intricacies of Airalo - a thick MNA that operates in 219 countries.\nUnlike other MNAs that our community scrutinized, we show that Airalo often\ndecouples the geographical location of the public internet gateway from the\nnative country of the base operator via IPX Hub Breakout (IHBO). To map\nAiralo's underlying infrastructure, we ran web-based measurements that 14\nvolunteers performed while traveling and using an Airalo eSIM on their personal\ndevices. We further dive into Airalo's performance by running device-based\nmeasurements (speedtest, traceroute, video streaming, etc.) in 10 countries\nwith rooted Android devices. Finally, we examine Airalo's pricing by monitoring\nits marketplace.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OAjz2IqGmuBdIws3zdepLRfHx4GDHEfmUDMQ4Zaj5eI","pdfSize":"3477623"}
