{"id":"2408.00114","title":"Inductive or Deductive? Rethinking the Fundamental Reasoning Abilities\n  of LLMs","authors":"Kewei Cheng, Jingfeng Yang, Haoming Jiang, Zhengyang Wang, Binxuan\n  Huang, Ruirui Li, Shiyang Li, Zheng Li, Yifan Gao, Xian Li, Bing Yin, Yizhou\n  Sun","authorsParsed":[["Cheng","Kewei",""],["Yang","Jingfeng",""],["Jiang","Haoming",""],["Wang","Zhengyang",""],["Huang","Binxuan",""],["Li","Ruirui",""],["Li","Shiyang",""],["Li","Zheng",""],["Gao","Yifan",""],["Li","Xian",""],["Yin","Bing",""],["Sun","Yizhou",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:47:11 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 00:52:07 GMT"}],"updateDate":"2024-08-08","timestamp":1722451631000,"abstract":"  Reasoning encompasses two typical types: deductive reasoning and inductive\nreasoning. Despite extensive research into the reasoning capabilities of Large\nLanguage Models (LLMs), most studies have failed to rigorously differentiate\nbetween inductive and deductive reasoning, leading to a blending of the two.\nThis raises an essential question: In LLM reasoning, which poses a greater\nchallenge - deductive or inductive reasoning? While the deductive reasoning\ncapabilities of LLMs, (i.e. their capacity to follow instructions in reasoning\ntasks), have received considerable attention, their abilities in true inductive\nreasoning remain largely unexplored. To investigate into the true inductive\nreasoning capabilities of LLMs, we propose a novel framework, SolverLearner.\nThis framework enables LLMs to learn the underlying function (i.e., $y =\nf_w(x)$), that maps input data points $(x)$ to their corresponding output\nvalues $(y)$, using only in-context examples. By focusing on inductive\nreasoning and separating it from LLM-based deductive reasoning, we can isolate\nand investigate inductive reasoning of LLMs in its pure form via SolverLearner.\nOur observations reveal that LLMs demonstrate remarkable inductive reasoning\ncapabilities through SolverLearner, achieving near-perfect performance with ACC\nof 1 in most cases. Surprisingly, despite their strong inductive reasoning\nabilities, LLMs tend to relatively lack deductive reasoning capabilities,\nparticularly in tasks involving ``counterfactual'' reasoning.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XHYMkFPEOAVBXdK5PMosjsLS0Plkpi0A9srNRDcATAc","pdfSize":"1694372"}
