{"id":"2408.08063","title":"Constraining Ultralight ALP Dark Matter in Light of Cosmic Birefringence","authors":"Dongdong Zhang, Elisa G. M. Ferreira, Ippei Obata, Toshiya Namikawa","authorsParsed":[["Zhang","Dongdong",""],["Ferreira","Elisa G. M.",""],["Obata","Ippei",""],["Namikawa","Toshiya",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 10:09:12 GMT"}],"updateDate":"2024-08-16","timestamp":1723716552000,"abstract":"  Cosmic birefringence, the observed rotation of the polarization plane of the\ncosmic microwave background (CMB), serves as a compelling probe for\nparity-violating physics beyond the Standard Model. This study explores the\npotential of ultralight axion-like particle (ALP) dark matter to explain the\nobserved cosmic birefringence in the CMB. We focus on the previously\nunderstudied mass range of $10^{-25}$ eV to $10^{-23}$ eV, where ALPs start to\nundergo nonlinear clustering in the late universe. Our analysis incorporates\nrecent cosmological constraints and considers the washout effect on CMB\npolarization. We find that for models with ALP masses $10^{-25}$ eV $\\lesssim\nm_\\phi \\lesssim 10^{-23}$ eV and birefringence arising from late ALP\nclustering, the upper limit on the ALP-photon coupling constant, imposed by the\nwashout effect, is stringently lower than the coupling required to account for\nthe observed static cosmic birefringence signal. This discrepancy persists\nregardless of the ALP fraction in dark matter. Furthermore, considering ALPs\nwith masses $m_\\phi\\gtrsim$ $10^{-23}$ eV cannot explain static birefringence\ndue to their rapid field oscillations, our results indicate that, all ALP dark\nmatter candidates capable of nonlinear clustering in the late universe and thus\ncontributing mainly to the rotation angle of polarized photons, are\nincompatible with explaining the static cosmic birefringence signal observed in\nPlanck and WMAP data.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}