{"id":"2408.05853","title":"Predictors and Socio-Demographic Disparities in STEM Degree Outcomes: A\n  ten-year UK study using Hierarchical Logistic Regression","authors":"Andrew M. Low","authorsParsed":[["Low","Andrew M.",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 19:53:00 GMT"}],"updateDate":"2024-08-13","timestamp":1723405980000,"abstract":"  This research study uses hierarchical logistic regression to identify\npredictors of first-class STEM degree outcomes at a research-intensive Russell\nGroup university in the UK between 2012 and 2022. By building a multivariate\nbinary logistic model with random intercepts for different STEM degree\nsubjects, we find that prior academic attainment, ethnicity, gender,\nsocioeconomic status, age, and course duration are statistically significant\npredictors of achieving a first-class degree. By determining the odds ratios\nand average marginal effects of socio-demographic predictors, we find evidence\nfor the existence of age, ethnicity, gender, and socioeconomic awarding gaps.\nThe largest awarding gap exists between Black and White students, with Black\nstudents having 0.45 (95\\% CI: 0.30-0.68) times the odds, and a 14\\% lower\nprobability, of achieving a first-class degree compared to White students,\nholding all other variables constant. Students who graduate from 4-year degrees\nare found to have, on average, a 27\\% higher probability of achieving a\nfirst-class degree than students on 3-year degrees. Despite raw data suggesting\nthat male students outperform female students, the multivariate hierarchical\nanalysis revealed higher odds for female students after controlling for other\nfactors and accounting for nested data structures. Analysis using year-specific\naverage marginal effects indicates that awarding gaps have not significantly\nchanged between 2012 and 2022. This research study provides a robust analytical\nframework for use by other departments and institutions aiming to identify and\naddress awarding gaps.\n","subjects":["Physics/Physics Education"],"license":"http://creativecommons.org/licenses/by/4.0/"}