{"id":"2408.03881","title":"Summary of the trigger systems of the Large Hadron Collider experiments\n  ALICE, ATLAS, CMS and LHCb","authors":"Johannes Albrecht, Leon Bozianu, Lukas Calefice, Sofia Cella, Carlos\n  Eduardo Cocha Toapaxi, Caterina Doglioni, Kaare Endrup Iversen, Vladimir\n  Gligorov, James Andrew Gooding, Patin Inkaew, Daniel Magdalinski, Alexandros\n  Sopasakis, Danielle Joan Wilson-Edwards, The SMARTHEP network","authorsParsed":[["Albrecht","Johannes",""],["Bozianu","Leon",""],["Calefice","Lukas",""],["Cella","Sofia",""],["Toapaxi","Carlos Eduardo Cocha",""],["Doglioni","Caterina",""],["Iversen","Kaare Endrup",""],["Gligorov","Vladimir",""],["Gooding","James Andrew",""],["Inkaew","Patin",""],["Magdalinski","Daniel",""],["Sopasakis","Alexandros",""],["Wilson-Edwards","Danielle Joan",""],["network","The SMARTHEP",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 14:53:22 GMT"}],"updateDate":"2024-08-08","timestamp":1721832802000,"abstract":"  In modern High Energy Physics (HEP) experiments, triggers perform the\nimportant task of selecting, in real time, the data to be recorded and saved\nfor physics analyses. As a result, trigger strategies play a key role in\nextracting relevant information from the vast streams of data produced at\nfacilities like the Large Hadron Collider (LHC). As the energy and luminosity\nof the collisions increase, these strategies must be upgraded and maintained to\nsuit the experimental needs. This whitepaper compiled by the SMARTHEP Early\nStage Researchers presents a high-level overview and reviews recent\ndevelopments of triggering practices employed at the LHC. The general trigger\nprinciples applied at modern HEP experiments are highlighted, with specific\nreference to the current trigger state-of-the-art within the ALICE, ATLAS, CMS\nand LHCb collaborations. Furthermore, a brief synopsis of the new trigger\nparadigm required by the upcoming high-luminosity upgrade of the LHC is\nprovided.\n","subjects":["Physics/Instrumentation and Detectors","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"g8rTYk9PTzz6FXWz69jv2MvI7hJIB_7ftSytMm-9Vvo","pdfSize":"770461"}
