{"id":"2408.04969","title":"Towards aerodynamic surrogate modeling based on $\\beta$-variational\n  autoencoders","authors":"V\\'ictor Franc\\'es-Belda, Alberto Solera-Rico, Javier Nieto-Centenero,\n  Esther Andr\\'es, Carlos Sanmiguel Vila, Rodrigo Castellanos","authorsParsed":[["Francés-Belda","Víctor",""],["Solera-Rico","Alberto",""],["Nieto-Centenero","Javier",""],["Andrés","Esther",""],["Vila","Carlos Sanmiguel",""],["Castellanos","Rodrigo",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 09:43:10 GMT"}],"updateDate":"2024-08-12","timestamp":1723196590000,"abstract":"  Surrogate models combining dimensionality reduction and regression techniques\nare essential to reduce the need for costly high-fidelity CFD data. New\napproaches using $\\beta$-Variational Autoencoder ($\\beta$-VAE) architectures\nhave shown promise in obtaining high-quality low-dimensional representations of\nhigh-dimensional flow data while enabling physical interpretation of their\nlatent spaces. We propose a surrogate model based on latent space regression to\npredict pressure distributions on a transonic wing given the flight conditions:\nMach number and angle of attack. The $\\beta$-VAE model, enhanced with Principal\nComponent Analysis (PCA), maps high-dimensional data to a low-dimensional\nlatent space, showing a direct correlation with flight conditions.\nRegularization through $\\beta$ requires careful tuning to improve the overall\nperformance, while PCA pre-processing aids in constructing an effective latent\nspace, improving autoencoder training and performance. Gaussian Process\nRegression is used to predict latent space variables from flight conditions,\nshowing robust behavior independent of $\\beta$, and the decoder reconstructs\nthe high-dimensional pressure field data. This pipeline provides insight into\nunexplored flight conditions. Additionally, a fine-tuning process of the\ndecoder further refines the model, reducing dependency on $\\beta$ and enhancing\naccuracy. The structured latent space, robust regression performance, and\nsignificant improvements from fine-tuning collectively create a highly accurate\nand efficient surrogate model. Our methodology demonstrates the effectiveness\nof $\\beta$-VAEs for aerodynamic surrogate modeling, offering a rapid,\ncost-effective, and reliable alternative for aerodynamic data prediction.\n","subjects":["Computing Research Repository/Machine Learning","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"qiu22Pzcx9E692Mu8KjZCT-dbwTx44LnDz1tRgpZePY","pdfSize":"25686044"}
