{"id":"2408.01683","title":"Probabilistic modeling reveals coordinated social interaction states and\n  their multisensory bases","authors":"Sarah Josephine Stednitz, Andrew Lesak, Adeline L Fecker, Peregrine\n  Painter, Phil Washbourne, Luca Mazzucato, Ethan K Scott","authorsParsed":[["Stednitz","Sarah Josephine",""],["Lesak","Andrew",""],["Fecker","Adeline L",""],["Painter","Peregrine",""],["Washbourne","Phil",""],["Mazzucato","Luca",""],["Scott","Ethan K",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 06:45:42 GMT"}],"updateDate":"2024-08-06","timestamp":1722667542000,"abstract":"  Social behavior across animal species ranges from simple pairwise\ninteractions to thousands of individuals coordinating goal-directed movements.\nRegardless of the scale, these interactions are governed by the interplay\nbetween multimodal sensory information and the internal state of each animal.\nHere, we investigate how animals use multiple sensory modalities to guide\nsocial behavior in the highly social zebrafish (Danio rerio) and uncover the\ncomplex features of pairwise interactions early in development. To identify\ndistinct behaviors and understand how they vary over time, we developed a new\nhidden Markov model with constrained linear-model emissions to automatically\nclassify states of coordinated interaction, using the movements of one animal\nto predict those of another. We discovered that social behaviors alternate\nbetween two interaction states within a single experimental session,\ndistinguished by unique movements and timescales. Long-range interactions, akin\nto shoaling, rely on vision, while mechanosensation underlies rapid\nsynchronized movements and parallel swimming, precursors of schooling.\nAltogether, we observe spontaneous interactions in pairs of fish, develop novel\nhidden Markov modeling to reveal two fundamental interaction modes, and\nidentify the sensory systems involved in each. Our modeling approach to\npairwise social interactions has broad applicability to a wide variety of\nnaturalistic behaviors and species and solves the challenge of detecting\ntransient couplings between quasi-periodic time series.\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"EjHQnjIEO4L15YUl9HEN6QGZYMBDYVSdpC82BlzkogM","pdfSize":"5305935","txDigest":"98v2BuLVAdKmbGkieg8QRQY2GckDYRgVtqnEnqxbpx6M","endEpoch":"1","status":"CERTIFIED"}
