{"id":"2408.08982","title":"Deep Generative Classification of Blood Cell Morphology","authors":"Simon Deltadahl, Julian Gilbey, Christine Van Laer, Nancy Boeckx,\n  Mathie Leers, Tanya Freeman, Laura Aiken, Timothy Farren, Matthew Smith,\n  Mohamad Zeina, BloodCounts! consortium, Concetta Piazzese, Joseph Taylor,\n  Nicholas Gleadall, Carola-Bibiane Sch\\\"onlieb, Suthesh Sivapalaratnam,\n  Michael Roberts, Parashkev Nachev","authorsParsed":[["Deltadahl","Simon",""],["Gilbey","Julian",""],["Van Laer","Christine",""],["Boeckx","Nancy",""],["Leers","Mathie",""],["Freeman","Tanya",""],["Aiken","Laura",""],["Farren","Timothy",""],["Smith","Matthew",""],["Zeina","Mohamad",""],["consortium","BloodCounts!",""],["Piazzese","Concetta",""],["Taylor","Joseph",""],["Gleadall","Nicholas",""],["Schönlieb","Carola-Bibiane",""],["Sivapalaratnam","Suthesh",""],["Roberts","Michael",""],["Nachev","Parashkev",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 19:17:02 GMT"}],"updateDate":"2024-08-20","timestamp":1723835822000,"abstract":"  Accurate classification of haematological cells is critical for diagnosing\nblood disorders, but presents significant challenges for machine automation\nowing to the complexity of cell morphology, heterogeneities of biological,\npathological, and imaging characteristics, and the imbalance of cell type\nfrequencies. We introduce CytoDiffusion, a diffusion-based classifier that\neffectively models blood cell morphology, combining accurate classification\nwith robust anomaly detection, resistance to distributional shifts,\ninterpretability, data efficiency, and superhuman uncertainty quantification.\nOur approach outperforms state-of-the-art discriminative models in anomaly\ndetection (AUC 0.976 vs. 0.919), resistance to domain shifts (85.85% vs. 74.38%\nbalanced accuracy), and performance in low-data regimes (95.88% vs. 94.95%\nbalanced accuracy). Notably, our model generates synthetic blood cell images\nthat are nearly indistinguishable from real images, as demonstrated by a Turing\ntest in which expert haematologists achieved only 52.3% accuracy (95% CI:\n[50.5%, 54.2%]). Furthermore, we enhance model explainability through the\ngeneration of directly interpretable counterfactual heatmaps. Our comprehensive\nevaluation framework, encompassing these multiple performance dimensions,\nestablishes a new benchmark for medical image analysis in haematology,\nultimately enabling improved diagnostic accuracy in clinical settings. Our code\nis available at https://github.com/Deltadahl/CytoDiffusion.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}