{"id":"2408.12445","title":"HEP Benchmark Suite: Enhancing Efficiency and Sustainability in\n  Worldwide LHC Computing Infrastructures","authors":"Natalia Szczepanek, David Britton, Alessandro Di Girolamo, Ewoud\n  Ketele, Ivan Glushkov, Domenico Giordano, Ladislav Ondris, Emanuele Simili,\n  Gonzalo Menendez Borge","authorsParsed":[["Szczepanek","Natalia",""],["Britton","David",""],["Di Girolamo","Alessandro",""],["Ketele","Ewoud",""],["Glushkov","Ivan",""],["Giordano","Domenico",""],["Ondris","Ladislav",""],["Simili","Emanuele",""],["Borge","Gonzalo Menendez",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 14:41:24 GMT"}],"updateDate":"2024-08-23","timestamp":1724337684000,"abstract":"  As the scientific community continues to push the boundaries of computing\ncapabilities, there is a growing responsibility to address the associated\nenergy consumption and carbon footprint. This responsibility extends to the\nWorldwide LHC Computing Grid (WLCG), encompassing over 170 sites in 40\ncountries, supporting vital computing, disk, tape storage and network for LHC\nexperiments. Ensuring efficient operational practices across these diverse\nsites is crucial beyond mere performance metrics.\n  This paper introduces the HEP Benchmark suite, an enhanced suite designed to\nmeasure computing resource performance uniformly across all WLCG sites, using\nHEPScore23 as performance unit. The suite expands beyond assessing only the\nexecution speed via HEPScore23. In fact the suite incorporates metrics such as\nmachine load, memory usage, memory swap, and notably, power consumption. Its\nadaptability and user-friendly interface enable comprehensive acquisition of\nsystem-related data alongside benchmarking.\n  Throughout 2023, this tool underwent rigorous testing across numerous WLCG\nsites. The focus was on studying compute job slot performance and correlating\nthese with fabric metrics. Initial analysis unveiled the tool's efficacy in\nestablishing a standardized model for compute resource utilization while\npinpointing anomalies, often stemming from site misconfigurations.\n  This paper aims to elucidate the tool's functionality and present the results\nobtained from extensive testing. By disseminating this information, the\nobjective is to raise awareness within the community about this probing model,\nfostering broader adoption and encouraging responsible computing practices that\nprioritize both performance and environmental impact mitigation.\n","subjects":["Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/"}