{"id":"2408.07115","title":"Optimal quantum state tomography with local informationally complete\n  measurements","authors":"Casey Jameson, Zhen Qin, Alireza Goldar, Michael B. Wakin, Zhihui Zhu,\n  Zhexuan Gong","authorsParsed":[["Jameson","Casey",""],["Qin","Zhen",""],["Goldar","Alireza",""],["Wakin","Michael B.",""],["Zhu","Zhihui",""],["Gong","Zhexuan",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 17:58:02 GMT"}],"updateDate":"2024-08-15","timestamp":1723571882000,"abstract":"  Quantum state tomography (QST) remains the gold standard for benchmarking and\nverification of near-term quantum devices. While QST for a generic quantum\nmany-body state requires an exponentially large amount of resources, most\nphysical quantum states are structured and can often be represented by a much\nsmaller number of parameters, making efficient QST potentially possible. A\nprominent example is a matrix product state (MPS) or a matrix product density\noperator (MPDO), which is believed to represent most physical states generated\nby one-dimensional (1D) quantum devices. We study whether a general MPS/MPDO\nstate can be recovered with bounded errors using only a number of state copies\npolynomial in the number of qubits, which is necessary for efficient QST. To\nmake this question practically interesting, we assume only local measurements\nof qubits directly on the target state. By using a local symmetric\ninformationally complete positive operator-valued measurement (SIC-POVM), we\nprovide a positive answer to the above question for a variety of common\nmany-body quantum states, including typical short-range entangled states,\nrandom MPS/MPDO states, and thermal states of one-dimensional Hamiltonians. In\naddition, we also provide an affirmative no answer for certain long-range\nentangled states such as a family of generalized GHZ states, but with the\nexception of target states that are known to have real-valued wavefunctions.\nOur answers are supported by a near-perfect agreement between an efficient\ncalculation of the Cramer-Rao bound that rigorously bounds the sample\ncomplexity and numerical optimization results using a machine learning assisted\nmaximal likelihood estimation (MLE) algorithm. This agreement also leads to an\noptimal QST protocol using local SIC-POVM that can be practically implemented\non current quantum hardware and is highly efficient for most 1D physical\nstates.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}