{"id":"2408.13126","title":"CathAction: A Benchmark for Endovascular Intervention Understanding","authors":"Baoru Huang, Tuan Vo, Chayun Kongtongvattana, Giulio Dagnino, Dennis\n  Kundrat, Wenqiang Chi, Mohamed Abdelaziz, Trevor Kwok, Tudor Jianu, Tuong Do,\n  Hieu Le, Minh Nguyen, Hoan Nguyen, Erman Tjiputra, Quang Tran, Jianyang Xie,\n  Yanda Meng, Binod Bhattarai, Zhaorui Tan, Hongbin Liu, Hong Seng Gan, Wei\n  Wang, Xi Yang, Qiufeng Wang, Jionglong Su, Kaizhu Huang, Angelos Stefanidis,\n  Min Guo, Bo Du, Rong Tao, Minh Vu, Guoyan Zheng, Yalin Zheng, Francisco\n  Vasconcelos, Danail Stoyanov, Daniel Elson, Ferdinando Rodriguez y Baena, Anh\n  Nguyen","authorsParsed":[["Huang","Baoru",""],["Vo","Tuan",""],["Kongtongvattana","Chayun",""],["Dagnino","Giulio",""],["Kundrat","Dennis",""],["Chi","Wenqiang",""],["Abdelaziz","Mohamed",""],["Kwok","Trevor",""],["Jianu","Tudor",""],["Do","Tuong",""],["Le","Hieu",""],["Nguyen","Minh",""],["Nguyen","Hoan",""],["Tjiputra","Erman",""],["Tran","Quang",""],["Xie","Jianyang",""],["Meng","Yanda",""],["Bhattarai","Binod",""],["Tan","Zhaorui",""],["Liu","Hongbin",""],["Gan","Hong Seng",""],["Wang","Wei",""],["Yang","Xi",""],["Wang","Qiufeng",""],["Su","Jionglong",""],["Huang","Kaizhu",""],["Stefanidis","Angelos",""],["Guo","Min",""],["Du","Bo",""],["Tao","Rong",""],["Vu","Minh",""],["Zheng","Guoyan",""],["Zheng","Yalin",""],["Vasconcelos","Francisco",""],["Stoyanov","Danail",""],["Elson","Daniel",""],["Baena","Ferdinando Rodriguez y",""],["Nguyen","Anh",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 14:54:49 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 11:45:09 GMT"}],"updateDate":"2024-09-02","timestamp":1724424889000,"abstract":"  Real-time visual feedback from catheterization analysis is crucial for\nenhancing surgical safety and efficiency during endovascular interventions.\nHowever, existing datasets are often limited to specific tasks, small scale,\nand lack the comprehensive annotations necessary for broader endovascular\nintervention understanding. To tackle these limitations, we introduce\nCathAction, a large-scale dataset for catheterization understanding. Our\nCathAction dataset encompasses approximately 500,000 annotated frames for\ncatheterization action understanding and collision detection, and 25,000 ground\ntruth masks for catheter and guidewire segmentation. For each task, we\nbenchmark recent related works in the field. We further discuss the challenges\nof endovascular intentions compared to traditional computer vision tasks and\npoint out open research questions. We hope that CathAction will facilitate the\ndevelopment of endovascular intervention understanding methods that can be\napplied to real-world applications. The dataset is available at\nhttps://airvlab.github.io/cathaction/.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}