{"id":"2408.09644","title":"Exploring Wavelet Transformations for Deep Learning-based Machine\n  Condition Diagnosis","authors":"Eduardo Jr Piedad, Christian Ainsley Del Rosario, Eduardo\n  Prieto-Araujo, Oriol Gomis-Bellmunt","authorsParsed":[["Piedad","Eduardo Jr",""],["Del Rosario","Christian Ainsley",""],["Prieto-Araujo","Eduardo",""],["Gomis-Bellmunt","Oriol",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 02:06:33 GMT"}],"updateDate":"2024-08-20","timestamp":1724033193000,"abstract":"  Deep learning (DL) strategies have recently been utilized to diagnose motor\nfaults by simply analyzing motor phase current signals, offering a less costly\nand non-intrusive alternative to vibration sensors. This research transforms\nthese time-series current signals into time-frequency 2D representations via\nWavelet Transform (WT). The dataset for motor current signals includes 3,750\ndata points across five categories: one representing normal conditions and four\nrepresenting artificially induced faults, each under five different load\nconditions: 0, 25, 50, 75, and 100%. The study employs five WT-based\ntechniques: WT-Amor, WT-Bump, WT-Morse, WSST-Amor, and WSST-Bump. Subsequently,\nfive DL models adopting prior Convolutional Neural Network (CNN) architecture\nwere developed and tested using the transformed 2D plots from each method. The\nDL models for WT-Amor, WT-Bump, and WT-Morse showed remarkable effectiveness\nwith peak model accuracy of 90.93, 89.20, and 93.73%, respectively, surpassing\nprevious 2D-image-based methods that recorded accuracy of 80.25, 74.80, and\n82.80% respectively using the identical dataset and validation protocol.\nNotably, the WT-Morse approach slightly exceeded the formerly highest ML\ntechnique, achieving a 93.20% accuracy. However, the two WSST methods that\nutilized synchrosqueezing techniques faced difficulty accurately classifying\nmotor faults. The performance of Wavelet-based deep learning methods offers a\ncompelling alternative for machine condition monitoring.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}