{"id":"2408.02228","title":"Strong Chemical Tagging in FIRE: Intra and Inter-Cluster Chemical\n  Homogeneity in Open Clusters in Milky Way-like Galaxy Simulations","authors":"Binod Bhattarai, Sarah R. Loebman, Melissa K. Ness, Andrew Wetzel,\n  Emily C. Cunningham, Hanna Parul and Alessa Ibrahim Wiggins","authorsParsed":[["Bhattarai","Binod",""],["Loebman","Sarah R.",""],["Ness","Melissa K.",""],["Wetzel","Andrew",""],["Cunningham","Emily C.",""],["Parul","Hanna",""],["Wiggins","Alessa Ibrahim",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 04:35:35 GMT"}],"updateDate":"2024-08-06","timestamp":1722832535000,"abstract":"  Open star clusters are the essential building blocks of the Galactic disk;\n\"strong chemical tagging\" - the premise that all star clusters can be\nreconstructed given chemistry information alone - is a driving force behind\nmany current and upcoming large Galactic spectroscopic surveys. In this work,\nwe characterize abundance patterns for 9 elements (C, N, O, Ne, Mg, Si, S, Ca,\nand Fe) in open clusters (OCs) in three galaxies (m12i, m12f, and m12m) from\nthe Latte suite of FIRE-2 simulations to investigate if strong chemical tagging\nis possible in these simulations. We select young massive (>=10^(4.6) Msun) OCs\nformed in the last ~100 Myr and calculate the intra- and inter-cluster\nabundance scatter for these clusters. We compare these results with analogous\ncalculations drawn from observations of OCs in the Milky Way. We find the\nintra-cluster scatter of the observations and simulations to be comparable.\nWhile the abundance scatter within each cluster is minimal (<0.020 dex), the\nmean abundance patterns of different clusters are not unique. We also calculate\nthe chemical difference in intra- and inter-cluster star pairs and find it, in\ngeneral, to be so small that it is difficult to distinguish between stars drawn\nfrom the same OC or from different OCs. Despite tracing three distinct\nnucleosynthetic families (core-collapse supernovae, white dwarf supernovae, and\nstellar winds), we conclude that these elemental abundances do not provide\nenough discriminating information to use strong chemical tagging for reliable\nOC membership.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}