{"id":"2408.13454","title":"AdaOcc: Adaptive-Resolution Occupancy Prediction","authors":"Chao Chen, Ruoyu Wang, Yuliang Guo, Cheng Zhao, Xinyu Huang, Chen\n  Feng, Liu Ren","authorsParsed":[["Chen","Chao",""],["Wang","Ruoyu",""],["Guo","Yuliang",""],["Zhao","Cheng",""],["Huang","Xinyu",""],["Feng","Chen",""],["Ren","Liu",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 03:46:25 GMT"}],"updateDate":"2024-08-27","timestamp":1724471185000,"abstract":"  Autonomous driving in complex urban scenarios requires 3D perception to be\nboth comprehensive and precise. Traditional 3D perception methods focus on\nobject detection, resulting in sparse representations that lack environmental\ndetail. Recent approaches estimate 3D occupancy around vehicles for a more\ncomprehensive scene representation. However, dense 3D occupancy prediction\nincreases computational demands, challenging the balance between efficiency and\nresolution. High-resolution occupancy grids offer accuracy but demand\nsubstantial computational resources, while low-resolution grids are efficient\nbut lack detail. To address this dilemma, we introduce AdaOcc, a novel\nadaptive-resolution, multi-modal prediction approach. Our method integrates\nobject-centric 3D reconstruction and holistic occupancy prediction within a\nsingle framework, performing highly detailed and precise 3D reconstruction only\nin regions of interest (ROIs). These high-detailed 3D surfaces are represented\nin point clouds, thus their precision is not constrained by the predefined grid\nresolution of the occupancy map. We conducted comprehensive experiments on the\nnuScenes dataset, demonstrating significant improvements over existing methods.\nIn close-range scenarios, we surpass previous baselines by over 13% in IOU, and\nover 40% in Hausdorff distance. In summary, AdaOcc offers a more versatile and\neffective framework for delivering accurate 3D semantic occupancy prediction\nacross diverse driving scenarios.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}