{"id":"2408.07952","title":"Ionized gas in quiescent galaxies: Temperature measurement and\n  constraint on the ionization source","authors":"Man-Yin Leo Lee, Renbin Yan, Xihan Ji, Gerome Algodon, Kyle Westfall,\n  Zesen Lin, Francesco Belfiore and Kevin Bundy","authorsParsed":[["Lee","Man-Yin Leo",""],["Yan","Renbin",""],["Ji","Xihan",""],["Algodon","Gerome",""],["Westfall","Kyle",""],["Lin","Zesen",""],["Belfiore","Francesco",""],["Bundy","Kevin",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 06:01:37 GMT"}],"updateDate":"2024-08-16","timestamp":1723701697000,"abstract":"  In non-star-forming, passively evolving galaxies, regions with emission lines\ndominated by low-ionization species are classified as Low-Ionization Emission\nRegions (LIERs). The ionization mechanism behind such regions has long been a\nmystery. Active Galactic Nuclei (AGNs), which were once believed to be the\nsource, have been found not to be the dominant mechanism, especially in regions\ndistant from the galaxy nuclei. The remaining candidates, photoionization by\npost-Asymtopic Giant Branch (pAGB) stars and interstellar shocks can only be\ndistinguished with in-depth analysis. As the temperature predictions of these\ntwo models differ, temperature measurements can provide strong constraints on\nthis puzzle. We selected a sample of 2795 quiescent red-sequence galaxies from\nthe Sloan Digital Sky Survey IV (SDSS-IV) Mapping Nearby Galaxies at Apache\nPoint Observatory (MaNGA) survey. We divided the sample spectra into three\ngroups based on their [N II]/H$\\alpha$ flux ratio and utilized stacking\ntechniques to improve the signal-to-noise ratio of the observed spectra. We\ndetermined the temperature of [O III], [N II], [S II], and [O II] through their\ntemperature-sensitive emission line ratios. Subsequently, we compared the\nmeasured temperatures with predictions from different models. The results\ndemonstrate consistency with the interstellar shock model with preshock density\nn = 1 cm$^{-3}$ and solar metallicity, thus supporting shocks as the dominant\nionization source of LIERs. Additionally, we also find that the interstellar\ndust extinction value measured through the Balmer decrement appears to be\nlarger than that implied by the forbidden line ratios of low-ionization lines.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}