{"id":"2408.07331","title":"RSEA-MVGNN: Multi-View Graph Neural Network with Reliable Structural\n  Enhancement and Aggregation","authors":"Junyu Chen, Long Shi, Badong Chen","authorsParsed":[["Chen","Junyu",""],["Shi","Long",""],["Chen","Badong",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 07:13:36 GMT"}],"updateDate":"2024-08-15","timestamp":1723619616000,"abstract":"  Graph Neural Networks (GNNs) have exhibited remarkable efficacy in learning\nfrom multi-view graph data. In the framework of multi-view graph neural\nnetworks, a critical challenge lies in effectively combining diverse views,\nwhere each view has distinct graph structure features (GSFs). Existing\napproaches to this challenge primarily focus on two aspects: 1) prioritizing\nthe most important GSFs, 2) utilizing GNNs for feature aggregation. However,\nprioritizing the most important GSFs can lead to limited feature diversity, and\nexisting GNN-based aggregation strategies equally treat each view without\nconsidering view quality. To address these issues, we propose a novel\nMulti-View Graph Neural Network with Reliable Structural Enhancement and\nAggregation (RSEA-MVGNN). Firstly, we estimate view-specific uncertainty\nemploying subjective logic. Based on this uncertainty, we design reliable\nstructural enhancement by feature de-correlation algorithm. This approach\nenables each enhancement to focus on different GSFs, thereby achieving diverse\nfeature representation in the enhanced structure. Secondly, the model learns\nview-specific beliefs and uncertainty as opinions, which are utilized to\nevaluate view quality. Based on these opinions, the model enables high-quality\nviews to dominate GNN aggregation, thereby facilitating representation\nlearning. Experimental results conducted on five real-world datasets\ndemonstrate that RSEA-MVGNN outperforms several state-of-the-art GNN-based\nmethods.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}