{"id":"2408.14645","title":"3D{\\pi}: Three-Dimensional Positron Imaging, A Novel Total-Body PET\n  Scanner Using Xenon-Doped Liquid Argon Scintillator","authors":"Azam Zabihi, Xinran Li, Alejandro Ramirez, Manuel D. Da Rocha Rolo,\n  Davide Franco, Federico Gabriele, Cristiano Galbiati, Michela Lai, Daniel R.\n  Marlow, Andrew Renshaw, Shawn Westerdale, Masayuki Wada","authorsParsed":[["Zabihi","Azam",""],["Li","Xinran",""],["Ramirez","Alejandro",""],["Rolo","Manuel D. Da Rocha",""],["Franco","Davide",""],["Gabriele","Federico",""],["Galbiati","Cristiano",""],["Lai","Michela",""],["Marlow","Daniel R.",""],["Renshaw","Andrew",""],["Westerdale","Shawn",""],["Wada","Masayuki",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 21:21:04 GMT"}],"updateDate":"2024-08-28","timestamp":1724707264000,"abstract":"  Objective: This paper introduces a novel PET imaging methodology called\n3-dimensional positron imaging (3D{\\pi}), which integrates total-body (TB)\ncoverage, time-of-flight (TOF) technology, ultra-low dose imaging capabilities,\nand ultra-fast readout electronics inspired by emerging technology from the\nDarkSide collaboration. Approach: The study evaluates the performance of\n3D{\\pi} using Monte Carlo simulations based on NEMA NU 2-2018 protocols. The\nmethodology employs a homogenous, monolithic scintillator composed of liquid\nargon (LAr) doped with xenon (Xe) with silicon photomultipliers (SiPM)\noperating at cryogenic temperatures. Main results: Significant enhancements in\nsystem performance are observed, with the 3D{\\pi} system achieving a noise\nequivalent count rate (NECR) of 3.2 Mcps which is approximately two times\nhigher than uEXPLORER's peak NECR (1.5 Mcps) at 17.3 (kBq/mL). Spatial\nresolution measurements show an average FWHM of 2.7 mm across both axial\npositions. The system exhibits superior sensitivity, with values reaching 373\nkcps/MBq with a line source at the center of the field of view. Additionally,\n3D{\\pi} achieves a TOF resolution of 151 ps at 5.3 kBq/mL, highlighting its\npotential to produce high-quality images with reduced noise levels.\nSignificance: The study underscores the potential of 3D{\\pi} in improving PET\nimaging performance, offering the potential for shorter scan times and reduced\nradiation exposure for patients. The Xe-doped LAr offers advantages such as\nfast scintillation, enhanced light yield, and cost-effectiveness. Future\nresearch will focus on optimizing system geometry and further refining\nreconstruction algorithms to exploit the strengths of 3D{\\pi} for clinical\napplications.\n","subjects":["Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DnG4iUmHlKsgDwq8JU9N8XVj4GhSDEMsbwMeDD8-U54","pdfSize":"6302165"}
