{"id":"2408.12474","title":"A two-dimensional gallium phosphide optomechanical crystal in the\n  resolved-sideband regime","authors":"Sho Tamaki, Mads Bjerregaard Kristensen, Th\\'eo Martel, R\\'emy Braive\n  and Albert Schliesser","authorsParsed":[["Tamaki","Sho",""],["Kristensen","Mads Bjerregaard",""],["Martel","Théo",""],["Braive","Rémy",""],["Schliesser","Albert",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 15:13:27 GMT"}],"updateDate":"2024-08-23","timestamp":1724339607000,"abstract":"  Faithful quantum state transfer between telecom photons and microwave\nfrequency mechanical oscillations necessitate a fast conversion rate and low\nthermal noise. Two-dimensional (2D) optomechanical crystals (OMCs) are\nfavorable candidates that satisfy those requirements. 2D OMCs enable\nsufficiently high mechanical frequency (1$\\sim$10 GHz) to make the\nresolved-sideband regime achievable, a prerequisite for many quantum protocols.\nIt also supports higher thermal conductance than 1D structures, mitigating the\nparasitic laser absorption heating. Furthermore, gallium phosphide (GaP) is a\npromising material choice thanks to its large electronic bandgap of 2.26 eV,\nwhich suppresses two-photon absorption, and high refractive index $n$ = 3.05 at\nthe telecom C-band, leading to a high-$Q$ optical mode. Here, we fabricate and\ncharacterize a 2D OMC made of GaP. We realize a high optical $Q$-factor of\n$7.9\\times 10^{4}$, corresponding to a linewidth $\\kappa/2\\pi$ = 2.5 GHz at the\ntelecom frequency 195.6 THz. This optical mode couples to several mechanical\nmodes, whose frequencies all exceed the cavity linewidth. The most strongly\ncoupled mode oscillates at 7.7 GHz, more than 3 times the optical linewidth,\nwhile achieving a substantial vacuum optomechanical coupling rate\n$g_{\\mathrm{0}}/2\\pi$ = 450 kHz. This makes the platform a promising candidate\nfor a long-lived, deterministic quantum memory for telecom photons at low\ntemperatures.\n","subjects":["Physics/Quantum Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/"}