{"id":"2408.09793","title":"Obliquities of Exoplanet Host Stars: 19 New and Updated Measurements,\n  and Trends in the Sample of 205 Measurements","authors":"Emil Knudstrup, Simon H. Albrecht, Joshua N. Winn, Davide Gandolfi,\n  John J. Zanazzi, Carina M. Persson, Malcolm Fridlund, Marcus L. Marcussen,\n  Ashley Chontos, Marcelo A. F. Keniger, Nora L. Eisner, Allyson Bieryla,\n  Howard Isaacson, Andrew W. Howard, Lea A. Hirsch, Felipe Murgas, Norio\n  Narita, Enric Palle, Yugo Kawai, David Baker","authorsParsed":[["Knudstrup","Emil",""],["Albrecht","Simon H.",""],["Winn","Joshua N.",""],["Gandolfi","Davide",""],["Zanazzi","John J.",""],["Persson","Carina M.",""],["Fridlund","Malcolm",""],["Marcussen","Marcus L.",""],["Chontos","Ashley",""],["Keniger","Marcelo A. F.",""],["Eisner","Nora L.",""],["Bieryla","Allyson",""],["Isaacson","Howard",""],["Howard","Andrew W.",""],["Hirsch","Lea A.",""],["Murgas","Felipe",""],["Narita","Norio",""],["Palle","Enric",""],["Kawai","Yugo",""],["Baker","David",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 08:41:33 GMT"}],"updateDate":"2024-08-20","timestamp":1724056893000,"abstract":"  Measurements of the obliquities in exoplanet systems have revealed some\nremarkable architectures, some of which are very different from the Solar\nSystem. Nearly 200 obliquity measurements have been obtained through\nobservations of the Rossiter-McLaughlin (RM) effect. Here we report on\nobservations of 19 planetary systems that led to 17 clear detections of the RM\neffect and 2 less secure detections. After adding the new measurements to the\ntally, we use the entire collection of RM measurements to investigate four\nissues that have arisen in the literature. i) Does the obliquity distribution\nshow a peak at approximately 90$^\\circ$? We find tentative evidence that such a\npeak does exist when restricting attention to the sample of sub-Saturn planets\nand hot Jupiters orbiting F stars. ii) Are high obliquities associated with\nhigh eccentricities? We find the association to be weaker than previously\nreported, and that a stronger association exists between obliquity and orbital\nseparation, possibly due to tidal obliquity damping at small separations. iii)\nHow low are the lowest known obliquities? Among hot Jupiters around cool stars,\nwe find the dispersion to be $1.4\\pm0.7^\\circ$, smaller than the 6$^\\circ$\nobliquity of the Sun, which serves as additional evidence for tidal damping.\niv) What are the obliquities of stars with compact and flat systems of multiple\nplanets? We find that they generally have obliquities lower than $10^\\circ$,\nwith several remarkable exceptions possibly caused by wide-orbiting stellar or\nplanetary companions.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}