{"id":"2408.10940","title":"A Closer Look at Data Augmentation Strategies for Finetuning-Based\n  Low/Few-Shot Object Detection","authors":"Vladislav Li, Georgios Tsoumplekas, Ilias Siniosoglou, Vasileios\n  Argyriou, Anastasios Lytos, Eleftherios Fountoukidis and Panagiotis\n  Sarigiannidis","authorsParsed":[["Li","Vladislav",""],["Tsoumplekas","Georgios",""],["Siniosoglou","Ilias",""],["Argyriou","Vasileios",""],["Lytos","Anastasios",""],["Fountoukidis","Eleftherios",""],["Sarigiannidis","Panagiotis",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 15:29:56 GMT"}],"updateDate":"2024-08-21","timestamp":1724167796000,"abstract":"  Current methods for low- and few-shot object detection have primarily focused\non enhancing model performance for detecting objects. One common approach to\nachieve this is by combining model finetuning with data augmentation\nstrategies. However, little attention has been given to the energy efficiency\nof these approaches in data-scarce regimes. This paper seeks to conduct a\ncomprehensive empirical study that examines both model performance and energy\nefficiency of custom data augmentations and automated data augmentation\nselection strategies when combined with a lightweight object detector. The\nmethods are evaluated in three different benchmark datasets in terms of their\nperformance and energy consumption, and the Efficiency Factor is employed to\ngain insights into their effectiveness considering both performance and\nefficiency. Consequently, it is shown that in many cases, the performance gains\nof data augmentation strategies are overshadowed by their increased energy\nusage, necessitating the development of more energy efficient data augmentation\nstrategies to address data scarcity.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Performance"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}