{"id":"2408.02436","title":"Magnetic Order and Magneto-Elasticity in the Electronic Excitations of\n  Gd-$i$-MAX","authors":"Kartik Panda, Daniel Potashnikov, Asaf Pesach, Maxime Barbier, Anna\n  Eyal, Thierry Ouisse, Amit Keren, and Nimrod Bachar","authorsParsed":[["Panda","Kartik",""],["Potashnikov","Daniel",""],["Pesach","Asaf",""],["Barbier","Maxime",""],["Eyal","Anna",""],["Ouisse","Thierry",""],["Keren","Amit",""],["Bachar","Nimrod",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 12:48:33 GMT"}],"updateDate":"2024-08-06","timestamp":1722862113000,"abstract":"  We report the investigation of electronic collective modes in\nrare-earth-based magnets (Mo$_{2/3}$RE$_{1/3}$)$_2$AlC (also known as\nRE-$i$-MAX phases), where RE=Gd, Yb, and Dy, using single crystal samples. A\ndetailed investigation of the Raman spectra of Gd-$i$-MAX samples at low\ntemperatures, with a focus on the phonon behavior in relation to the\nantiferromagnetic (AFM) phase transition at 26 K is presented. Significant\nshifts in the central frequencies of several low-frequency phonon modes were\nobserved below 25 K, correlating with the N\\'{e}el transition. Integrated Raman\nintensity measurements indicated a reduction in the electronic background below\nthe AFM transition temperature, suggesting the opening of a magnetic gap. Our\nanalysis showed no new phonon modes. Therefore, we do not see any indication of\na Brillouin zone folding of phonon mode to the $\\Gamma$-point in our\nmeasurement. However, the hardening of all phonon modes at low temperatures\npoints to a strong spin-phonon coupling effect. Using a temperature-dependent\nmodel of phonon frequency, we determined the spin-phonon coupling constant\n$\\lambda$ to be less than 0.1 cm$^{-1}$ for all frequencies, which is of the\nsame order of magnitude as found in other antiferromagnetic materials such as\nMnF$_{2}$ and FeF$_{2}$ with $T_N=68~K$ and $T_N=78~K$, respectively, but\nsignificantly lower than that of $CuO$ with $T_N=213~K$.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2fWCfTOeJtT1DBbMU-MXgZ5PBIUlOmb_MulJnIm_SDk","pdfSize":"1502988"}
