{"id":"2408.13071","title":"Guiding IoT-Based Healthcare Alert Systems with Large Language Models","authors":"Yulan Gao, Ziqiang Ye, Ming Xiao, Yue Xiao, Dong In Kim","authorsParsed":[["Gao","Yulan",""],["Ye","Ziqiang",""],["Xiao","Ming",""],["Xiao","Yue",""],["Kim","Dong In",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 13:55:36 GMT"}],"updateDate":"2024-08-26","timestamp":1724421336000,"abstract":"  Healthcare alert systems (HAS) are undergoing rapid evolution, propelled by\nadvancements in artificial intelligence (AI), Internet of Things (IoT)\ntechnologies, and increasing health consciousness. Despite significant\nprogress, a fundamental challenge remains: balancing the accuracy of\npersonalized health alerts with stringent privacy protection in HAS\nenvironments constrained by resources. To address this issue, we introduce a\nuniform framework, LLM-HAS, which incorporates Large Language Models (LLM) into\nHAS to significantly boost the accuracy, ensure user privacy, and enhance\npersonalized health service, while also improving the subjective quality of\nexperience (QoE) for users. Our innovative framework leverages a Mixture of\nExperts (MoE) approach, augmented with LLM, to analyze users' personalized\npreferences and potential health risks from additional textual job\ndescriptions. This analysis guides the selection of specialized Deep\nReinforcement Learning (DDPG) experts, tasked with making precise health\nalerts. Moreover, LLM-HAS can process Conversational User Feedback, which not\nonly allows fine-tuning of DDPG but also deepen user engagement, thereby\nenhancing both the accuracy and personalization of health management\nstrategies. Simulation results validate the effectiveness of the LLM-HAS\nframework, highlighting its potential as a groundbreaking approach for\nemploying generative AI (GAI) to provide highly accurate and reliable alerts.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}