{"id":"2408.04805","title":"Improved Robustness for Deep Learning-based Segmentation of Multi-Center\n  Myocardial Perfusion MRI Datasets Using Data Adaptive Uncertainty-guided\n  Space-time Analysis","authors":"Dilek M. Yalcinkaya, Khalid Youssef, Bobak Heydari, Janet Wei, Noel\n  Bairey Merz, Robert Judd, Rohan Dharmakumar, Orlando P. Simonetti, Jonathan\n  W. Weinsaft, Subha V. Raman, Behzad Sharif","authorsParsed":[["Yalcinkaya","Dilek M.",""],["Youssef","Khalid",""],["Heydari","Bobak",""],["Wei","Janet",""],["Merz","Noel Bairey",""],["Judd","Robert",""],["Dharmakumar","Rohan",""],["Simonetti","Orlando P.",""],["Weinsaft","Jonathan W.",""],["Raman","Subha V.",""],["Sharif","Behzad",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 01:21:41 GMT"}],"updateDate":"2024-08-12","timestamp":1723166501000,"abstract":"  Background. Fully automatic analysis of myocardial perfusion MRI datasets\nenables rapid and objective reporting of stress/rest studies in patients with\nsuspected ischemic heart disease. Developing deep learning techniques that can\nanalyze multi-center datasets despite limited training data and variations in\nsoftware and hardware is an ongoing challenge.\n  Methods. Datasets from 3 medical centers acquired at 3T (n = 150 subjects)\nwere included: an internal dataset (inD; n = 95) and two external datasets\n(exDs; n = 55) used for evaluating the robustness of the trained deep neural\nnetwork (DNN) models against differences in pulse sequence (exD-1) and scanner\nvendor (exD-2). A subset of inD (n = 85) was used for training/validation of a\npool of DNNs for segmentation, all using the same spatiotemporal U-Net\narchitecture and hyperparameters but with different parameter initializations.\nWe employed a space-time sliding-patch analysis approach that automatically\nyields a pixel-wise \"uncertainty map\" as a byproduct of the segmentation\nprocess. In our approach, a given test case is segmented by all members of the\nDNN pool and the resulting uncertainty maps are leveraged to automatically\nselect the \"best\" one among the pool of solutions.\n  Results. The proposed DAUGS analysis approach performed similarly to the\nestablished approach on the internal dataset (p = n.s.) whereas it\nsignificantly outperformed on the external datasets (p < 0.005 for exD-1 and\nexD-2). Moreover, the number of image series with \"failed\" segmentation was\nsignificantly lower for the proposed vs. the established approach (4.3% vs.\n17.1%, p < 0.0005).\n  Conclusions. The proposed DAUGS analysis approach has the potential to\nimprove the robustness of deep learning methods for segmentation of\nmulti-center stress perfusion datasets with variations in the choice of pulse\nsequence, site location or scanner vendor.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}