{"id":"2408.07749","title":"From Halos to Galaxies. X: Decoding Galaxy SEDs with Physical Priors and\n  Accurate Star Formation History Reconstruction","authors":"Zeyu Gao, Yingjie Peng, Kai Wang, Luis C. Ho, Alvio Renzini, Anna R.\n  Gallazzi, Filippo Mannucci, Houjun Mo, Yipeng Jing, Xiaohu Yang, Enci Wang,\n  Dingyi Zhao, Jing Dou, Qiusheng Gu, Cheqiu Lyu, Roberto Maiolino, Bitao Wang,\n  Yu-Chen Wang, Bingxiao Xu, Feng Yuan, Xingye Zhu","authorsParsed":[["Gao","Zeyu",""],["Peng","Yingjie",""],["Wang","Kai",""],["Ho","Luis C.",""],["Renzini","Alvio",""],["Gallazzi","Anna R.",""],["Mannucci","Filippo",""],["Mo","Houjun",""],["Jing","Yipeng",""],["Yang","Xiaohu",""],["Wang","Enci",""],["Zhao","Dingyi",""],["Dou","Jing",""],["Gu","Qiusheng",""],["Lyu","Cheqiu",""],["Maiolino","Roberto",""],["Wang","Bitao",""],["Wang","Yu-Chen",""],["Xu","Bingxiao",""],["Yuan","Feng",""],["Zhu","Xingye",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 18:00:13 GMT"}],"updateDate":"2024-08-16","timestamp":1723658413000,"abstract":"  The spectral energy distribution (SED) of galaxies is essential for deriving\nfundamental properties like stellar mass and star formation history (SFH).\nHowever, conventional methods, including both parametric and non-parametric\napproaches, often fail to accurately recover the observed cosmic star formation\nrate (SFR) density due to oversimplified or unrealistic assumptions about SFH\nand their inability to account for the complex SFH variations across different\ngalaxy populations. To address this issue, we introduce a novel approach that\nimproves galaxy broad-band SED analysis by incorporating physical priors\nderived from hydrodynamical simulations. Tests using IllustrisTNG simulations\ndemonstrate that our method can reliably determine galaxy physical properties\nfrom broad-band photometry, including stellar mass within 0.05 dex, current SFR\nwithin 0.3 dex, and fractional stellar formation time within 0.2 dex, with a\nnegligible fraction of catastrophic failures. When applied to the SDSS main\nphotometric galaxy sample with spectroscopic redshift, our estimates of stellar\nmass and SFR are consistent with the widely-used MPA-JHU and GSWLC catalogs.\nNotably, using the derived SFHs of individual SDSS galaxies, we estimate the\ncosmic SFR density and stellar mass density with remarkable consistency to\ndirect observations up to $z \\sim 6$. This marks the first time SFHs derived\nfrom SEDs can accurately match observations. Consequently, our method can\nreliably recover observed spectral indices such as $\\rm D_{\\rm n}(4000)$ and\n$\\rm H\\delta_{\\rm A}$ by synthesizing the full spectra of galaxies using the\nestimated SFHs and metal enrichment histories, relying solely on broad-band\nphotometry as input. Furthermore, this method is extremely computationally\nefficient compared to conventional approaches.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}