{"id":"2408.03760","title":"Feasibility of a directional solar neutrino measurement with the\n  CYGNO/INITIUM experiment","authors":"Samuele Torelli","authorsParsed":[["Torelli","Samuele",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 13:28:47 GMT"}],"updateDate":"2024-08-08","timestamp":1723037327000,"abstract":"  Over the past five decades, solar neutrino research has been pivotal in\ndriving significant scientific advancements, enriching our comprehension of\nboth neutrino characteristics and solar processes. Despite numerous experiments\ndedicated to solar neutrino detection, a segment of the lower pp spectrum\nremains unexplored, while the precision of measurements from the CNO cycle\nremains insufficient to resolve the solar abundance problem determined by the\ndiscrepancy between the data gathered from helioseismology and the forecasts\ngenerated by stellar interior models for the Sun. The CYGNO/INITIUM experiment\naims to deploy a large 30 m3 directional detector for rare event searches\nfocusing on Dark Matter. Recently, in the CYGNUS collaboration, there has been\nconsideration for employing these time projection chamber technology in solar\nneutrino directional detection trough neutrino-electron elastic scattering.\nThis is due to their potential to conduct low-threshold, high-precision\nmeasurements with spectroscopic neutrino energy reconstruction on an\nevent-by-event basis driven by the kinematic. However, so far, no experiments\nhave been investigated on the feasibility of this measurement using actual\ndetector performances and background levels. Such a detector already with a\nvolume of O(10) m3 could perform an observation of solar neutrino from the pp\nchain with an unprecedented low threshold, while with larger volumes it could\nmeasure the CNO cycle eventually solving the solar metallicity problem.\n","subjects":["Physics/Instrumentation and Detectors","Physics/High Energy Physics - Experiment","Physics/Atomic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QffZhBR3UnUTapEGFIn5eZLmVZhnuanWoPxw_nOU9uA","pdfSize":"50540521"}
