{"id":"2408.06174","title":"Emergent superconductivity and pair density wave at antiphase boundaries\n  of charge density wave order in kagome metals","authors":"Xianghe Han, Hui Chen, Hengxin Tan, Zhongyi Cao, Zihao Huang, Yuhan\n  Ye, Zhen Zhao, Chengmin Shen, Haitao Yang, Binghai Yan, Ziqiang Wang,\n  Hong-Jun Gao","authorsParsed":[["Han","Xianghe",""],["Chen","Hui",""],["Tan","Hengxin",""],["Cao","Zhongyi",""],["Huang","Zihao",""],["Ye","Yuhan",""],["Zhao","Zhen",""],["Shen","Chengmin",""],["Yang","Haitao",""],["Yan","Binghai",""],["Wang","Ziqiang",""],["Gao","Hong-Jun",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 14:20:50 GMT"}],"updateDate":"2024-08-13","timestamp":1723472450000,"abstract":"  Central to the layered kagome lattice superconductors AV3Sb5 (A = K, Cs, Rb)\nis a cascade of novel quantum states triggered by an unconventional charge\ndensity wave (CDW) order. The three-dimensional (3D) order involves a 2x2x2\nphase coherent stacking of 2x2 charge density modulations in the kagome plane\nat low temperatures, exhibiting a CDW energy gap and evidence for time-reversal\nsymmetry breaking. Here we report the discovery of emergent superconductivity\nand primary pair density wave (PDW) at the antiphase boundaries and stacking\nfaults of bulk CDW order. We find that the {\\pi}-phase shift dislocations can\nnaturally appear on the surface as the Cs atoms form 2x2 superstructures that\nare out of phase with the bulk CDW. An incipient narrow band of surface states\ninside bulk CDW gap emerge close to the Fermi level where a particle-hole\nsymmetric energy gap develops. We demonstrate that the energy gap originates\nfrom a novel quasi-2D kagome superconducting state (Tc ~ 5.4 K) intertwined\nwith bulk CDW order, exhibiting an unprecedented vortex core spectrum and\nspatial modulations of the superconducting gap consistent with a 4x4 PDW.\nIntriguingly, the 2D kagome superconductivity is shown to be tunable on and off\nby atomically manipulating the Cs atoms on the surface. Our findings provide\nfresh new insights for understanding the interplay between the unconventional\nCDW and superconductivity in kagome metals and a pathway for atomic\nmanipulation and topological defects engineering of quantum many-body states in\ncorrelated materials.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IuPqPXeiK0mbor56XKh4unNrySC3LUVQTYbT5BdjaJI","pdfSize":"2437831"}
