{"id":"2408.00786","title":"Whether to trust: the ML leap of faith","authors":"Tory Frame, Julian Padget, George Stothart, Elizabeth Coulthard","authorsParsed":[["Frame","Tory",""],["Padget","Julian",""],["Stothart","George",""],["Coulthard","Elizabeth",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:36:19 GMT"}],"updateDate":"2024-08-05","timestamp":1721226979000,"abstract":"  Human trust is critical for trustworthy AI adoption. Trust is commonly\nunderstood as an attitude, but we cannot accurately measure this, nor manage\nit. We conflate trust in the overall system, ML, and ML's component parts; so\nmost users do not understand the leap of faith they take when they trust ML.\nCurrent efforts to build trust explain ML's process, which can be hard for\nnon-ML experts to comprehend because it is complex, and explanations are\nunrelated to their own (unarticulated) mental models. We propose an innovative\nway of directly building intrinsic trust in ML, by discerning and measuring the\nLeap of Faith (LoF) taken when a user trusts ML. Our LoF matrix identifies\nwhere an ML model aligns to a user's own mental model. This match is rigorously\nyet practically identified by feeding the user's data and objective function\nboth into an ML model and an expert-validated rules-based AI model, a verified\npoint of reference that can be tested a priori against a user's own mental\nmodel. The LoF matrix visually contrasts the models' outputs, so the remaining\nML-reasoning leap of faith can be discerned. Our proposed trust metrics measure\nfor the first time whether users demonstrate trust through their actions, and\nwe link deserved trust to outcomes. Our contribution is significant because it\nenables empirical assessment and management of ML trust drivers, to support\ntrustworthy ML adoption. Our approach is illustrated with a long-term\nhigh-stakes field study: a 3-month pilot of a sleep-improvement system with\nembedded AI.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}