{"id":"2408.10287","title":"Recognizing Beam Profiles from Silicon Photonics Gratings using\n  Transformer Model","authors":"Yu Dian Lim, Hong Yu Li, Simon Chun Kiat Goh, Xiangyu Wang, Peng Zhao,\n  Chuan Seng Tan","authorsParsed":[["Lim","Yu Dian",""],["Li","Hong Yu",""],["Goh","Simon Chun Kiat",""],["Wang","Xiangyu",""],["Zhao","Peng",""],["Tan","Chuan Seng",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 08:33:16 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 14:10:43 GMT"},{"version":"v3","created":"Thu, 22 Aug 2024 05:24:16 GMT"}],"updateDate":"2024-08-23","timestamp":1724056396000,"abstract":"  Over the past decade, there has been extensive work in developing integrated\nsilicon photonics (SiPh) gratings for the optical addressing of trapped ion\nqubits in the ion trap quantum computing community. However, when viewing beam\nprofiles from infrared (IR) cameras, it is often difficult to determine the\ncorresponding heights where the beam profiles are located. In this work, we\ndeveloped transformer models to recognize the corresponding height categories\nof beam profiles of light from SiPh gratings. The model is trained using two\ntechniques: (1) input patches, and (2) input sequence. For model trained with\ninput patches, the model achieved recognition accuracy of 0.938. Meanwhile,\nmodel trained with input sequence shows lower accuracy of 0.895. However, when\nrepeating the model-training 150 cycles, model trained with input patches shows\ninconsistent accuracy ranges between 0.445 to 0.959, while model trained with\ninput sequence exhibit higher accuracy values between 0.789 to 0.936. The\nobtained outcomes can be expanded to various applications, including\nauto-focusing of light beam and auto-adjustment of z-axis stage to acquire\ndesired beam profiles.\n","subjects":["Physics/Optics","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"y0IBRov75cvG_NwZOn_NIxVUF31dwdJmqOHZRHJs__0","pdfSize":"2069216"}
