{"id":"2408.13878","title":"Generalization of Graph Neural Networks is Robust to Model Mismatch","authors":"Zhiyang Wang and Juan Cervino and Alejandro Ribeiro","authorsParsed":[["Wang","Zhiyang",""],["Cervino","Juan",""],["Ribeiro","Alejandro",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 16:00:44 GMT"},{"version":"v2","created":"Tue, 10 Sep 2024 16:28:24 GMT"}],"updateDate":"2024-09-11","timestamp":1724601644000,"abstract":"  Graph neural networks (GNNs) have demonstrated their effectiveness in various\ntasks supported by their generalization capabilities. However, the current\nanalysis of GNN generalization relies on the assumption that training and\ntesting data are independent and identically distributed (i.i.d). This imposes\nlimitations on the cases where a model mismatch exists when generating testing\ndata. In this paper, we examine GNNs that operate on geometric graphs generated\nfrom manifold models, explicitly focusing on scenarios where there is a\nmismatch between manifold models generating training and testing data. Our\nanalysis reveals the robustness of the GNN generalization in the presence of\nsuch model mismatch. This indicates that GNNs trained on graphs generated from\na manifold can still generalize well to unseen nodes and graphs generated from\na mismatched manifold. We attribute this mismatch to both node feature\nperturbations and edge perturbations within the generated graph. Our findings\nindicate that the generalization gap decreases as the number of nodes grows in\nthe training graph while increasing with larger manifold dimension as well as\nlarger mismatch. Importantly, we observe a trade-off between the generalization\nof GNNs and the capability to discriminate high-frequency components when\nfacing a model mismatch. The most important practical consequence of this\nanalysis is to shed light on the filter design of generalizable GNNs robust to\nmodel mismatch. We verify our theoretical findings with experiments on multiple\nreal-world datasets.\n","subjects":["Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}