{"id":"2408.08555","title":"Detection and tracking of MAVs using a LiDAR with rosette scanning\n  pattern","authors":"S\\'andor Gazdag, Tom M\\\"oller, Tam\\'as Filep, Anita Keszler and\n  Andr\\'as L. Majdik","authorsParsed":[["Gazdag","Sándor",""],["Möller","Tom",""],["Filep","Tamás",""],["Keszler","Anita",""],["Majdik","András L.",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 06:40:20 GMT"}],"updateDate":"2024-08-19","timestamp":1723790420000,"abstract":"  The usage of commercial Micro Aerial Vehicles (MAVs) has increased\ndrastically during the last decade. While the added value of MAVs to society is\napparent, their growing use is also coming with increasing risks like violating\npublic airspace at airports or committing privacy violations. To mitigate these\nissues it is becoming critical to develop solutions that incorporate the\ndetection and tracking of MAVs with autonomous systems. This work presents a\nmethod for the detection and tracking of MAVs using a novel, low-cost rosette\nscanning LiDAR on a pan-tilt turret. Once the static background is captured, a\nparticle filter is utilized to detect a possible target and track its position\nwith a physical, programmable pan-tilt system. The tracking makes it possible\nto keep the MAV in the center, maximizing the density of 3D points measured on\nthe target by the LiDAR sensor. The developed algorithm was evaluated within\nthe indoor MIcro aerial vehicle and MOtion capture (MIMO) arena and has\nstate-of-the-art tracking accuracy, stability, and fast re-detection time in\ncase of tracking loss. Based on the outdoor tests, it was possible to\nsignificantly increase the detection distance and number of returned points\ncompared to other similar methods using LiDAR.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_fp0gwI0jM23UicDBvtSQujbWZMgKwnxyGqCZcobNh0","pdfSize":"4133812"}
