{"id":"2408.10350","title":"Towards Necessary and sufficient state condition for violation of a\n  multi-settings Bell inequality","authors":"Swapnil Bhowmick, Som Kanjilal, A. K. Pan and Souradeep Sasmal","authorsParsed":[["Bhowmick","Swapnil",""],["Kanjilal","Som",""],["Pan","A. K.",""],["Sasmal","Souradeep",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:45:07 GMT"}],"updateDate":"2024-08-21","timestamp":1724093107000,"abstract":"  High dimensional quantum entanglement and the advancements in their\nexperimental realization provide a playground for fundamental research and\neventually lead to quantum technological developments. The Horodecki criterion\ndetermines whether a state violates Clauser-Horne-Shimony-Holt (CHSH)\ninequality for a two-qubit entangled state, solely from the state parameters.\nHowever, it remains a challenging task to formulate similar necessary and\nsufficient criteria for a high-dimensional entangled state for the violation of\na suitable Bell inequality. Here, we develop a Horodecki-like criterion based\non the state parameters of arbitrary two-qudit states to violate a two-outcome\nBell inequality involving $2^{n-1}$ and $n$ measurement settings for Alice and\nBob, respectively. This inequality reduces to the well-known CHSH and Gisin's\nelegant Bell inequalities for $n=2$ and $n=3$, respectively. While the proposed\ncriterion is sufficient to violate the Bell inequality, it becomes necessary as\nwell for the following cases; (i) $m$ copies of Bell diagonal states for\narbitrary $n$, (ii) Non-decomposable states whose correlation matrix is\ndiagonalized by local unitaries, and (iii) for any arbitrary two-qubit state\nwhen $n=3$, where the maximal value of the Bell functional is achieved with\nBob's measurements being pairwise anticommuting. For any states, we derive the\nconstraints on Alice's measurements in achieving the maximum quantum violation\nfor this inequality.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"m1JfOAGVl2SfAlnBr1W4OjzBjr-ga59FutHsK0O418U","pdfSize":"633349"}
