{"id":"2408.09734","title":"Mutually-Aware Feature Learning for Few-Shot Object Counting","authors":"Yerim Jeon and Subeen Lee and Jihwan Kim and Jae-Pil Heo","authorsParsed":[["Jeon","Yerim",""],["Lee","Subeen",""],["Kim","Jihwan",""],["Heo","Jae-Pil",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 06:46:24 GMT"}],"updateDate":"2024-08-20","timestamp":1724049984000,"abstract":"  Few-shot object counting has garnered significant attention for its\npracticality as it aims to count target objects in a query image based on given\nexemplars without the need for additional training. However, there is a\nshortcoming in the prevailing extract-and-match approach: query and exemplar\nfeatures lack interaction during feature extraction since they are extracted\nunaware of each other and later correlated based on similarity. This can lead\nto insufficient target awareness of the extracted features, resulting in target\nconfusion in precisely identifying the actual target when multiple class\nobjects coexist. To address this limitation, we propose a novel framework,\nMutually-Aware FEAture learning(MAFEA), which encodes query and exemplar\nfeatures mutually aware of each other from the outset. By encouraging\ninteraction between query and exemplar features throughout the entire pipeline,\nwe can obtain target-aware features that are robust to a multi-category\nscenario. Furthermore, we introduce a background token to effectively associate\nthe target region of query with exemplars and decouple its background region\nfrom them. Our extensive experiments demonstrate that our model reaches a new\nstate-of-the-art performance on the two challenging benchmarks, FSCD-LVIS and\nFSC-147, with a remarkably reduced degree of the target confusion problem.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3xZkm6X0OkUyimkI-cIIAzHGKdcm471fFv-4t60lWj0","pdfSize":"3362351"}
