{"id":"2408.12297","title":"The Critical Metallization of Hydrogen in Pressurized LaBeH8 Hydride","authors":"Zihan Zhang, Tian Cui, Yansun Yao, Tianchen Ma, Qiwen Jiang, Haojun\n  Jia, Bartomeu Monserrat, Chris J. Pickard, Defang Duan","authorsParsed":[["Zhang","Zihan",""],["Cui","Tian",""],["Yao","Yansun",""],["Ma","Tianchen",""],["Jiang","Qiwen",""],["Jia","Haojun",""],["Monserrat","Bartomeu",""],["Pickard","Chris J.",""],["Duan","Defang",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 11:14:43 GMT"}],"updateDate":"2024-08-23","timestamp":1724325283000,"abstract":"  Behaviours of hydrogen, such as fluidity and metallicity, are crucial for our\nunderstanding of planetary interiors and the emerging field of high-temperature\nsuperconducting hydrides. These behaviours were discovered in complex phase\ndiagrams of hydrogen and hydrides, however, the transition mechanism of\nbehaviours driven by temperature, pressure and chemical compression remain\nunclear, particularly in the processes of metallization. Until now, a\ncomprehensive theoretical framework to quantify atomization and metallization\nof hydrogen in phase diagram of hydrides has been lacking. In this study, we\naddress this gap by combining molecular dynamics and electronic structure\nanalysis to propose a theoretical framework, which clarify the content and\nproperties of atomic hydrogen under various temperature and pressure conditions\nand chemical compression exerted by non-hydrogen elements in hydrides. Applying\nthis framework to the superconducting hydride LaBeH8, we identify three general\nhydrogen orderings within its phase diagram: molecular, sublattice and warm\nhydrogens. During the phase transition from molecule to sublattice, hydrogen\nexhibits different properties from three general hydrogen orderings, such as\nfast superionicity, metallicity and unusual atomic content response to\ntemperature. These abnormal behaviours were defined as the critical\nmetallization of hydrogen, which not only suggests a potential synthesis route\nfor the metastable phase but also provides valuable insights into the complex\nsynthetic products of superconducting hydrides.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}