{"id":"2408.16388","title":"Efficient Compression of Redshift-Space Distortion Data for Late-Time\n  Modified Gravity Models","authors":"Yo Toda, Adri\\`a G\\'omez-Valent, and Kazuya Koyama","authorsParsed":[["Toda","Yo",""],["Gómez-Valent","Adrià",""],["Koyama","Kazuya",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 09:50:31 GMT"}],"updateDate":"2024-08-30","timestamp":1724925031000,"abstract":"  Current cosmological observations allow for deviations from the standard\ngrowth of large-scale structures in the universe. These deviations could\nindicate modifications to General Relativity on cosmological scales or suggest\nthe dynamical nature of dark energy. It is important to characterize these\ndepartures in a model-independent manner to understand their significance\nobjectively and explore their fundamental causes more generically across a\nwider spectrum of theories and models. In this paper, we compress the\ninformation from redshift-space distortion data into 2-3 parameters $\\mu_i$,\nwhich control the ratio between the effective gravitational coupling in\nPoisson's equation and Newton's constant in several redshift bins in the late\nuniverse. We test the efficiency of this compression using mock final-year data\nfrom the Dark Energy Spectroscopic Instrument (DESI) and considering three\ndifferent models within the class of effective field theories of dark energy.\nThe constraints on the parameters of these models, obtained from both the\ndirect fit to the data and the projection of the compressed parameters onto the\nparameters of the models, are fully consistent, demonstrating the method's good\nperformance. Then, we apply it to current data and find hints of a suppressed\nmatter growth in the universe at $\\sim 2.7\\sigma$ C.L., in full accordance with\nprevious works in the literature. Finally, we perform a forecast with DESI data\nand show that the uncertainties on the parameters $\\mu_1$ at $z<1$ and $\\mu_2$\nat $1<z<3$ are expected to decrease by approximately $40\\%$ and $20\\%$,\nrespectively, compared to those obtained with current data. Additionally, we\nproject these forecasted constraints onto the parameters of the aforesaid\nmodels.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/"}