{"id":"2408.13318","title":"Earths within Reach: Evaluation of Strategies for Mitigating Solar\n  Variability using 3.5 years of NEID Sun-as-a-Star Observations","authors":"Eric B. Ford, Chad F. Bender, Cullen H. Blake, Arvind F. Gupta,\n  Shubham Kanodia, Andrea S.J. Lin, Sarah E. Logsdon, Jacob K. Luhn, Suvrath\n  Mahadevan, Michael L. Palumbo III, Ryan C. Terrien, Jason T. Wright, Jinglin\n  Zhao, Samuel Halverson, Emily Hunting, Paul Robertson, Arpita Roy, Gudmundur\n  Stefansson","authorsParsed":[["Ford","Eric B.",""],["Bender","Chad F.",""],["Blake","Cullen H.",""],["Gupta","Arvind F.",""],["Kanodia","Shubham",""],["Lin","Andrea S. J.",""],["Logsdon","Sarah E.",""],["Luhn","Jacob K.",""],["Mahadevan","Suvrath",""],["Palumbo","Michael L.","III"],["Terrien","Ryan C.",""],["Wright","Jason T.",""],["Zhao","Jinglin",""],["Halverson","Samuel",""],["Hunting","Emily",""],["Robertson","Paul",""],["Roy","Arpita",""],["Stefansson","Gudmundur",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 18:07:48 GMT"}],"updateDate":"2024-08-27","timestamp":1724436468000,"abstract":"  We present the results of Sun-as-a-star observations by the NEID Solar\nTelescope at WIYN Observatory, spanning January 1, 2021 through June 30, 2024.\nWe identify 117,060 observations which are unlikely to be significantly\naffected by weather, hardware or major calibration issues. We describe several\nhigh-level data products being made available to the community to aid in the\ninterpretation and inter comparisons of NEID solar observations. Solar\nobservations demonstrate excellent performance of NEID, including radial\nvelocity (RV) accuracy and long-term stability of better than $\\simeq 0.37$ m\ns$^{-1}$ over $\\simeq 3.5$ years, even though NEID was not originally designed\nor optimized for daytime observations of the Sun. Currently, intrinsic stellar\nvariability is the primary barrier to detecting Earth-analog planets for most\nnearby, Sun-like stars. We present a comparison of the effectiveness of several\nmethods proposed to mitigate the effects of solar variability on the Sun's\nestimated RV. We find that the Scalpels algorithm performs particularly well\nand substantially reduces the RMS RV of solar spectra from over 2 m s$^{-1}$ to\n0.277 m s$^{-1}$. Even when training on a subset of days with NEID solar\nobservations and testing on a held-out sample, the RMS of cleaned RV is\n0.34-0.42 m s$^{-1}$. This is significantly better than previous attempts at\nremoving solar variability and suggests that the current generation of EPRV\ninstruments are technically capable of detecting Earth-mass planets orbiting a\nsolar twin if provided with sufficient observing time allocations ($\\sim 10^3$\nnights of observations).\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"tE2kxUGkM782Orx-pE6yUIclpbdIcvgsoFYHlUpRi7g","pdfSize":"22473491"}
