{"id":"2408.12059","title":"MAC protocol classification in the ISM band using machine learning\n  methods","authors":"Hanieh Rashidpour, Hossein Bahramgiri","authorsParsed":[["Rashidpour","Hanieh",""],["Bahramgiri","Hossein",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 01:26:28 GMT"}],"updateDate":"2024-08-23","timestamp":1724289988000,"abstract":"  With the emergence of new technologies and a growing number of wireless\nnetworks, we face the problem of radio spectrum shortages. As a result,\nidentifying the wireless channel spectrum to exploit the channel's idle state\nwhile also boosting network security is a pivotal issue. Detecting and\nclassifying protocols in the MAC sublayer enables Cognitive Radio users to\nimprove spectrum utilization and minimize potential interference. In this\npaper, we classify the Wi-Fi and Bluetooth protocols, which are the most widely\nused MAC sublayer protocols in the ISM radio band. With the advent of various\nwireless technologies, especially in the 2.4 GHz frequency band, the ISM\nfrequency spectrum has become crowded and high-traffic, which faces a lack of\nspectrum resources and user interference. Therefore, identifying and\nclassifying protocols is an effective and useful method. Leveraging machine\nlearning and deep learning techniques, known for their advanced classification\ncapabilities, we apply Support Vector Machine and K-Nearest Neighbors\nalgorithms, which are machine learning algorithms, to classify protocols into\nthree classes: Wi-Fi, Wi-Fi Beacon, and Bluetooth. To capture the signals, we\nuse the USRP N210 Software Defined Radio device and sample the real data in the\nindoor environment in different conditions of the presence and absence of\ntransmitters and receivers for these two protocols. By assembling this dataset\nand studying the time and frequency features of the protocols, we extract the\nframe width and the silence gap between the two frames as time features and the\nPAPR of each frame as a power feature. By comparing the output of the protocols\nclassification in different conditions and also adding Gaussian noise, it was\nfound that the samples in the nonlinear SVM method with RBF and KNN functions\nhave the best performance, with 97.83% and 98.12% classification accuracy,\nrespectively.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Machine Learning","Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0_e07JFzT6BRilgaKnxgKbg5iuFCLjOfsUVJkIyeNiU","pdfSize":"1808905"}
