{"id":"2408.07992","title":"Intrusions and turbulent mixing above a small Eastern Mediterranean\n  seafloor-slope","authors":"Hans van Haren","authorsParsed":[["van Haren","Hans",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 07:40:51 GMT"}],"updateDate":"2024-08-16","timestamp":1723707651000,"abstract":"  Growing evidence is found in observations and numerical modelling of the\nimportance of steep seafloor topography for turbulent diapycnal mixing leading\nto redistribution of suspended matter and nutrients, especially in waters with\nabundant internal tides. One of the remaining questions is the extent of\nturbulent mixing away from and above nearly flat topography, which is addressed\nin this paper. Evaluated are observations from an opportunistic, week-long\nmooring of high-resolution temperature sensors above a small seafloor slope in\nabout 1200 m water depth of the Eastern Mediterranean. The environment has weak\ntides, so that near-inertial motions and -shear dominate internal waves.\nVertical displacement shapes suggest instabilities to represent locally\ngenerated turbulent overturns, rather than partial salinity-compensated\nintrusions dispersed isopycnally from turbulence near the slope. This\nconclusion is supported by the duration of instabilities, as all individual\noverturns last shorter than the mean buoyancy period and sequences of overturns\nlast shorter than the local inertial period. The displacement shapes are more\nerratic than observed in stronger stratified waters in which shear drives\nturbulence, and better correspond with predominantly buoyancy-driven\nconvection-turbulence. This convection-turbulence is confirmed from spectral\ninformation, generally occurring dominant close to the seafloor and only in\nweakly stratified layers well above it. Mean turbulence values are 10-100 times\nsmaller than found above steep ocean topography, but 10 times larger than found\nin the open-ocean interior.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}