{"id":"2408.14610","title":"The Impact of Group Discussion and Formation on Student Performance: An\n  Experience Report in a Large CS1 Course","authors":"Tong Wu, Xiaohang Tang, Sam Wong, Xi Chen, Clifford A. Shaffer, Yan\n  Chen","authorsParsed":[["Wu","Tong",""],["Tang","Xiaohang",""],["Wong","Sam",""],["Chen","Xi",""],["Shaffer","Clifford A.",""],["Chen","Yan",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 20:07:44 GMT"}],"updateDate":"2024-08-28","timestamp":1724702864000,"abstract":"  Programming instructors often conduct collaborative learning activities, such\nas Peer Instruction (PI), to enhance student motivation, engagement, and\nlearning gains. However, the impact of group discussion and formation\nmechanisms on student performance remains unclear. To investigate this, we\nconducted an 11-session experiment in a large, in-person CS1 course. We\nemployed both random and expertise-balanced grouping methods to examine the\nefficacy of different group mechanisms and the impact of expert students'\npresence on collaborative learning. Our observations revealed complex dynamics\nwithin the collaborative learning environment. Among 255 groups, 146 actively\nengaged in discussions, with 96 of these groups demonstrating improvement for\npoor-performing students. Interestingly, our analysis revealed that different\ngrouping methods (expertise-balanced or random) did not significantly influence\ndiscussion engagement or poor-performing students' improvement. In our deeper\nqualitative analysis, we found that struggling students often derived benefits\nfrom interactions with expert peers, but this positive effect was not\nconsistent across all groups. We identified challenges that expert students\nface in peer instruction interactions, highlighting the complexity of\nleveraging expertise within group discussions.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mygqXI4t027iqd2EBNy0FTFuA25J8xfElS_RMY7vQ_U","pdfSize":"2352592"}
