{"id":"2408.14122","title":"FG-SAT: Efficient Flow Graph for Encrypted Traffic Classification under\n  Environment Shifts","authors":"Susu Cui, Xueying Han, Dongqi Han, Zhiliang Wang, Weihang Wang, Yun\n  Li, Bo Jiang, Baoxu Liu and Zhigang Lu","authorsParsed":[["Cui","Susu",""],["Han","Xueying",""],["Han","Dongqi",""],["Wang","Zhiliang",""],["Wang","Weihang",""],["Li","Yun",""],["Jiang","Bo",""],["Liu","Baoxu",""],["Lu","Zhigang",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 09:11:36 GMT"}],"updateDate":"2024-08-27","timestamp":1724663496000,"abstract":"  Encrypted traffic classification plays a critical role in network security\nand management. Currently, mining deep patterns from side-channel contents and\nplaintext fields through neural networks is a major solution. However, existing\nmethods have two major limitations: (1) They fail to recognize the critical\nlink between transport layer mechanisms and applications, missing the\nopportunity to learn internal structure features for accurate traffic\nclassification. (2) They assume network traffic in an unrealistically stable\nand singular environment, making it difficult to effectively classify\nreal-world traffic under environment shifts. In this paper, we propose FG-SAT,\nthe first end-to-end method for encrypted traffic analysis under environment\nshifts. We propose a key abstraction, the Flow Graph, to represent flow\ninternal relationship structures and rich node attributes, which enables robust\nand generalized representation. Additionally, to address the problem of\ninconsistent data distribution under environment shifts, we introduce a novel\nfeature selection algorithm based on Jensen-Shannon divergence (JSD) to select\nrobust node attributes. Finally, we design a classifier, GraphSAT, which\nintegrates GraphSAGE and GAT to deeply learn Flow Graph features, enabling\naccurate encrypted traffic identification. FG-SAT exhibits both efficient and\nrobust classification performance under environment shifts and outperforms\nstate-of-the-art methods in encrypted attack detection and application\nclassification.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}