{"id":"2408.00913","title":"Design and Implementation of ARA Wireless Living Lab for Rural Broadband\n  and Applications","authors":"Taimoor Ul Islam, Joshua Ofori Boateng, Md Nadim, Guoying Zu, Mukaram\n  Shahid, Xun Li, Tianyi Zhang, Salil Reddy, Wei Xu, Ataberk Atalar, Vincent\n  Lee, Yung-Fu Chen, Evan Gosling, Elisabeth Permatasari, Christ Somiah, Zhibo\n  Meng, Sarath Babu, Mohammed Soliman, Ali Hussain, Daji Qiao, Mai Zheng, Ozdal\n  Boyraz, Yong Guan, Anish Arora, Mohamed Selim, Arsalan Ahmad, Myra B. Cohen,\n  Mike Luby, Ranveer Chandra, James Gross, Hongwei Zhang","authorsParsed":[["Islam","Taimoor Ul",""],["Boateng","Joshua Ofori",""],["Nadim","Md",""],["Zu","Guoying",""],["Shahid","Mukaram",""],["Li","Xun",""],["Zhang","Tianyi",""],["Reddy","Salil",""],["Xu","Wei",""],["Atalar","Ataberk",""],["Lee","Vincent",""],["Chen","Yung-Fu",""],["Gosling","Evan",""],["Permatasari","Elisabeth",""],["Somiah","Christ",""],["Meng","Zhibo",""],["Babu","Sarath",""],["Soliman","Mohammed",""],["Hussain","Ali",""],["Qiao","Daji",""],["Zheng","Mai",""],["Boyraz","Ozdal",""],["Guan","Yong",""],["Arora","Anish",""],["Selim","Mohamed",""],["Ahmad","Arsalan",""],["Cohen","Myra B.",""],["Luby","Mike",""],["Chandra","Ranveer",""],["Gross","James",""],["Zhang","Hongwei",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 21:07:08 GMT"}],"updateDate":"2024-08-05","timestamp":1722546428000,"abstract":"  To address the rural broadband challenge and to leverage the unique\nopportunities that rural regions provide for piloting advanced wireless\napplications, we design and implement the ARA wireless living lab for research\nand innovation in rural wireless systems and their applications in precision\nagriculture, community services, and so on. ARA focuses on the unique\ncommunity, application, and economic context of rural regions, and it features\nthe first-of-its-kind, real-world deployment of long-distance, high-capacity\nwireless x-haul and access platforms across a rural area of diameter over 30\nkm. With both software-defined radios and programmable COTS systems and through\neffective orchestration of these wireless resources with fiber as well as\ncompute resources embedded end-to-end across user equipment, base stations,\nedge, and cloud, ARA offers programmability, performance, robustness, and\nheterogeneity at the same time, thus enabling rural-focused co-evolution of\nwireless and applications while helping advance the frontiers of wireless\nsystems in domains such as O-RAN, NextG, and agriculture applications. Here we\npresent the design principles and implementation strategies of ARA,\ncharacterize its performance and heterogeneity, and highlight example wireless\nand application experiments uniquely enabled by ARA.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Emerging Technologies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}