{"id":"2408.13168","title":"On Information Theoretic Fairness: Compressed Representations With\n  Perfect Demographic Parity","authors":"Amirreza Zamani, Borja Rodr\\'iguez-G\\'alvez, and Mikael Skoglund","authorsParsed":[["Zamani","Amirreza",""],["Rodríguez-Gálvez","Borja",""],["Skoglund","Mikael",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 15:40:02 GMT"}],"updateDate":"2024-08-26","timestamp":1724427602000,"abstract":"  In this article, we study the fundamental limits in the design of fair and/or\nprivate representations achieving perfect demographic parity and/or perfect\nprivacy through the lens of information theory. More precisely, given some\nuseful data $X$ that we wish to employ to solve a task $T$, we consider the\ndesign of a representation $Y$ that has no information of some sensitive\nattribute or secret $S$, that is, such that $I(Y;S) = 0$. We consider two\nscenarios. First, we consider a design desiderata where we want to maximize the\ninformation $I(Y;T)$ that the representation contains about the task, while\nconstraining the level of compression (or encoding rate), that is, ensuring\nthat $I(Y;X) \\leq r$. Second, inspired by the Conditional Fairness Bottleneck\nproblem, we consider a design desiderata where we want to maximize the\ninformation $I(Y;T|S)$ that the representation contains about the task which is\nnot shared by the sensitive attribute or secret, while constraining the amount\nof irrelevant information, that is, ensuring that $I(Y;X|T,S) \\leq r$. In both\ncases, we employ extended versions of the Functional Representation Lemma and\nthe Strong Functional Representation Lemma and study the tightness of the\nobtained bounds. Every result here can also be interpreted as a coding with\nperfect privacy problem by considering the sensitive attribute as a secret.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}