{"id":"2408.08373","title":"Learning Automata-Based Enhancements to RPL: Pioneering Load-Balancing\n  and Traffic Management in IoT","authors":"Mohammadhossein Homaei","authorsParsed":[["Homaei","Mohammadhossein",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 18:33:42 GMT"},{"version":"v2","created":"Mon, 19 Aug 2024 08:30:05 GMT"}],"updateDate":"2024-08-20","timestamp":1723746822000,"abstract":"  The Internet of Things (IoT) signifies a revolutionary technological\nadvancement, enhancing various applications through device interconnectivity\nwhile introducing significant challenges due to these devices' limited hardware\nand communication capabilities. To navigate these complexities, the Internet\nEngineering Task Force (IETF) has tailored the Routing Protocol for Low-Power\nand Lossy Networks (RPL) to meet the unique demands of IoT environments.\nHowever, RPL struggles with traffic congestion and load distribution issues,\nnegatively impacting network performance and reliability. This paper presents a\nnovel enhancement to RPL by integrating learning automata designed to optimize\nnetwork traffic distribution. This enhanced protocol, the Learning\nAutomata-based Load-Aware RPL (LALARPL), dynamically adjusts routing decisions\nbased on real-time network conditions, achieving more effective load balancing\nand significantly reducing network congestion. Extensive simulations reveal\nthat this approach outperforms existing methodologies, leading to notable\nimprovements in packet delivery rates, end-to-end delay, and energy efficiency.\nThe findings highlight the potential of our approach to enhance IoT network\noperations and extend the lifespan of network components. The effectiveness of\nlearning automata in refining routing processes within RPL offers valuable\ninsights that may drive future advancements in IoT networking, aiming for more\nrobust, efficient, and sustainable network architectures.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}