{"id":"2408.00217","title":"Load Balancing in Federated Learning","authors":"Alireza Javani and Zhiying Wang","authorsParsed":[["Javani","Alireza",""],["Wang","Zhiying",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 00:56:36 GMT"}],"updateDate":"2024-08-02","timestamp":1722473796000,"abstract":"  Federated Learning (FL) is a decentralized machine learning framework that\nenables learning from data distributed across multiple remote devices,\nenhancing communication efficiency and data privacy. Due to limited\ncommunication resources, a scheduling policy is often applied to select a\nsubset of devices for participation in each FL round. The scheduling process\nconfronts significant challenges due to the need for fair workload\ndistribution, efficient resource utilization, scalability in environments with\nnumerous edge devices, and statistically heterogeneous data across devices.\nThis paper proposes a load metric for scheduling policies based on the Age of\nInformation and addresses the above challenges by minimizing the load metric\nvariance across the clients. Furthermore, a decentralized Markov scheduling\npolicy is presented, that ensures a balanced workload distribution while\neliminating the management overhead irrespective of the network size due to\nindependent client decision-making. We establish the optimal parameters of the\nMarkov chain model and validate our approach through simulations. The results\ndemonstrate that reducing the load metric variance not only promotes fairness\nand improves operational efficiency, but also enhances the convergence rate of\nthe learning models.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6uHPV74VLxYObSjGUDAa-vs6rcMVwjGGkgBPE_up3nA","pdfSize":"281454","txDigest":"3zwg5JkihkqgVT8AxurNraUBeaZf4fkTZ52Rm6Cr9Xch","endEpoch":"1","status":"CERTIFIED"}
