{"id":"2408.12192","title":"A framework for extracting the rates of photophysical processes from\n  biexponentially decaying photon emission data","authors":"Jill M. Cleveland and Tory A. Welsch and Eric Y. Chen and D. Bruce\n  Chase and Matthew F. Doty and Hanz Y. Ram\\'irez-G\\'omez","authorsParsed":[["Cleveland","Jill M.",""],["Welsch","Tory A.",""],["Chen","Eric Y.",""],["Chase","D. Bruce",""],["Doty","Matthew F.",""],["Ramírez-Gómez","Hanz Y.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 08:14:51 GMT"}],"updateDate":"2024-08-23","timestamp":1724314491000,"abstract":"  There is strong interest in designing and realizing optically-active\nsemiconductor nanostructures of greater complexity for applications in fields\nranging from biomedical engineering to quantum computing. While these\nincreasingly complex nanostructures can implement progressively sophisticated\noptical functions, the presence of more material constituents and interfaces\nalso leads to increasingly complex exciton dynamics. In particular, the rates\nof carrier trapping and detrapping in complex heterostructures are critically\nimportant for advanced optical functionality, but they can rarely be directly\nmeasured. In this work, we develop a model that includes trapping and release\nof carriers by optically inactive states. The model explains the widely\nobserved biexponential decay of the photoluminescence signal from neutral\nexcitons in low dimensional semiconductor emitters. The model also allows\ndetermination of likelihood intervals for all the transition rates involved in\nthe emission dynamics, without the use of approximations. Furthermore, in cases\nfor which the high temperature limit is suitable, the model leads to specific\nvalues of such rates, outperforming reduced models previously used to estimate\nthose quantities. We demonstrate the value of this model by applying it to time\nresolved photoluminescence measurements of CdSeTe/CdS heterostructures. We\nobtain values not only for the radiative and nonradiative lifetimes, but also\nfor the delayed photoluminescence originating in trapping and release.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}