{"id":"2408.10592","title":"Hologram Reasoning for Solving Algebra Problems with Geometry Diagrams","authors":"Litian Huang, Xinguo Yu, Feng Xiong, Bin He, Shengbing Tang, Jiawen Fu","authorsParsed":[["Huang","Litian",""],["Yu","Xinguo",""],["Xiong","Feng",""],["He","Bin",""],["Tang","Shengbing",""],["Fu","Jiawen",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 07:10:05 GMT"}],"updateDate":"2024-08-21","timestamp":1724137805000,"abstract":"  Solving Algebra Problems with Geometry Diagrams (APGDs) is still a\nchallenging problem because diagram processing is not studied as intensively as\nlanguage processing. To work against this challenge, this paper proposes a\nhologram reasoning scheme and develops a high-performance method for solving\nAPGDs by using this scheme. To reach this goal, it first defines a hologram,\nbeing a kind of graph, and proposes a hologram generator to convert a given\nAPGD into a hologram, which represents the entire information of APGD and the\nrelations for solving the problem can be acquired from it by a uniform way.\nThen HGR, a hologram reasoning method employs a pool of prepared graph models\nto derive algebraic equations, which is consistent with the geometric theorems.\nThis method is able to be updated by adding new graph models into the pool.\nLastly, it employs deep reinforcement learning to enhance the efficiency of\nmodel selection from the pool. The entire HGR not only ensures high solution\naccuracy with fewer reasoning steps but also significantly enhances the\ninterpretability of the solution process by providing descriptions of all\nreasoning steps. Experimental results demonstrate the effectiveness of HGR in\nimproving both accuracy and interpretability in solving APGDs.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computational Geometry","Computing Research Repository/Logic in Computer Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}