{"id":"2408.11217","title":"Beyond skyrmion spin texture from quantum Kelvin-Helmholtz instability","authors":"SeungJung Huh, Wooyoung Yun, Gabin Yun, Samgyu Hwang, Kiryang Kwon,\n  Junhyeok Hur, Seungho Lee, Hiromitsu Takeuchi, Se Kwon Kim, Jae-yoon Choi","authorsParsed":[["Huh","SeungJung",""],["Yun","Wooyoung",""],["Yun","Gabin",""],["Hwang","Samgyu",""],["Kwon","Kiryang",""],["Hur","Junhyeok",""],["Lee","Seungho",""],["Takeuchi","Hiromitsu",""],["Kim","Se Kwon",""],["Choi","Jae-yoon",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 22:28:01 GMT"}],"updateDate":"2024-08-22","timestamp":1724192881000,"abstract":"  Topology profoundly influences diverse fields of science, providing a\npowerful framework for classifying phases of matter and predicting nontrivial\nexcitations, such as solitons, vortices, and skyrmions. These topological\ndefects are typically characterized by integer numbers, called topological\ncharges, representing the winding number in their order parameter field. The\nclassification and prediction of topological defects, however, become\nchallenging when singularities are included within the integration domain for\ncalculating the topological charge. While such exotic nonlinear excitations\nhave been proposed in the superfluid $^3$He-A phase and spinor Bose-Einstein\ncondensate of atomic gases, experimental observation of these structures and\nstudies of their stability have long been elusive. Here we report the\nobservation of a singular skyrmion that goes beyond the framework of topology\nin a ferromagnetic superfluid. The exotic skyrmions are sustained by undergoing\nanomalous symmetry breaking associated with the eccentric spin singularity and\ncarry half of the elementary charge, distinctive from conventional skyrmions or\nmerons. By successfully realizing the universal regime of the quantum\nKelvin-Helmholtz instability, we identified the eccentric fractional skyrmions,\nproduced by emission from a magnetic domain wall and a spontaneous splitting of\nan integer skyrmion with spin singularities. The singular skyrmions are stable\nand can be observed after 2~s of hold time. Our results confirm the\nuniversality between classical and quantum Kelvin-Helmholtz instabilities and\nbroaden our understanding on complex nonlinear dynamics of nontrivial texture\nbeyond skyrmion in topological quantum systems.\n","subjects":["Condensed Matter/Quantum Gases","Physics/Atomic Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OqB65NiefIhwqmhfGAGdtPa5hZRddEBAvIRRSsrlGeM","pdfSize":"4486476"}
