{"id":"2408.04233","title":"Quantum-metric-induced giant and reversible nonreciprocal transport\n  phenomena in chiral loop-current phases of kagome metals","authors":"Rina Tazai, Youichi Yamakawa, Takahiro Morimoto, Hiroshi Kontani","authorsParsed":[["Tazai","Rina",""],["Yamakawa","Youichi",""],["Morimoto","Takahiro",""],["Kontani","Hiroshi",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 05:38:05 GMT"}],"updateDate":"2024-08-09","timestamp":1723095485000,"abstract":"  Rich spontaneous symmetry-breaking phenomena with nontrivial quantum\ngeometric properties in metals represent central issues in condensed matter\nphysics. The emergence of chiral loop-current order, accompanied by\ntime-reversal symmetry (TRS) breaking in various kagome metals, has garnered\nsignificant attention as a novel quantum topological state. Particularly\nnoteworthy is the giant electrical magnetochiral anisotropy (eMChA) in CsV3Sb5\n[Guo et al, Nature 611, 461 (2022)], which provides compelling evidence of TRS\nand inversion-symmetry breaking. However, the underlying essence of this\nobservation has remained obscured due to the lack of theoretical understanding.\nHere, we identify that the chiral loop-current induces substantial and\nswitchable eMChA in kagome metals by taking account of the experimentally\nobserved stripe charge-density-wave. The obtained eMChA coefficient is\n$\\gamma_{eM}\\propto M_{orb} \\tau$, where $M_{orb}$ is the loop-current-induced\norbital magnetization and $\\tau$ is the lifetime of conduction electrons.\nImportantly, giant eMChA arises from the quantum metric (QM), which defines\nessential quantum phases of matter and their unique functionalities, including\nnonlinear effects. This effect is resonantly amplified in the loop-current\nphase, and the derived eMChA is switched by minute magnetic fields. This\nresearch elucidates the fundamental symmetry breaking in kagome metals and also\nsets the stage for investigating the QM-induced phenomena arising from\nelectronic correlations.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}