{"id":"2408.08487","title":"Microwave Andreev bound state spectroscopy in a semiconductor-based\n  Planar Josephson junction","authors":"Bassel Heiba Elfeky, Krishna Dindial, David S. Brand\\~ao, Bar{\\i}\\c{s}\n  Pekerten, Jaewoo Lee, William M. Strickland, Patrick J. Strohbeen, Alisa\n  Danilenko, Lukas Baker, Melissa Mikalsen, William Schiela, Zixuan Liang,\n  Jacob Issokson, Ido Levy, Igor Zutic, Javad Shabani","authorsParsed":[["Elfeky","Bassel Heiba",""],["Dindial","Krishna",""],["Brandão","David S.",""],["Pekerten","Barış",""],["Lee","Jaewoo",""],["Strickland","William M.",""],["Strohbeen","Patrick J.",""],["Danilenko","Alisa",""],["Baker","Lukas",""],["Mikalsen","Melissa",""],["Schiela","William",""],["Liang","Zixuan",""],["Issokson","Jacob",""],["Levy","Ido",""],["Zutic","Igor",""],["Shabani","Javad",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 02:16:37 GMT"}],"updateDate":"2024-08-19","timestamp":1723774597000,"abstract":"  By coupling a semiconductor-based planar Josephson junction to a\nsuperconducting resonator, we investigate the Andreev bound states in the\njunction using dispersive readout techniques. Using electrostatic gating to\ncreate a narrow constriction in the junction, our measurements unveil a strong\ncoupling interaction between the resonator and the Andreev bound states. This\nenables the mapping of isolated tunable Andreev bound states, with an observed\ntransparency of up to 99.94\\% along with an average induced superconducting gap\nof $\\sim 150 \\mu$eV. Exploring the gate parameter space further elucidates a\nnon-monotonic evolution of multiple Andreev bound states with varying gate\nvoltage. Complimentary tight-binding calculations of an Al-InAs planar\nJosephson junction with strong Rashba spin-orbit coupling provide insight into\npossible mechanisms responsible for such behavior. Our findings highlight the\nsubtleties of the Andreev spectrum of Josephson junctions fabricated on\nsuperconductor-semiconductor heterostructures and offering potential\napplications in probing topological states in these hybrid platforms.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0u-YeROhQ82aKUC30BlQnbKiGTW-E1fvdL8Auunswm0","pdfSize":"39664273"}
