{"id":"2408.13031","title":"VFM-Det: Towards High-Performance Vehicle Detection via Large Foundation\n  Models","authors":"Wentao Wu, Fanghua Hong, Xiao Wang, Chenglong Li, Jin Tang","authorsParsed":[["Wu","Wentao",""],["Hong","Fanghua",""],["Wang","Xiao",""],["Li","Chenglong",""],["Tang","Jin",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 12:39:02 GMT"}],"updateDate":"2024-08-26","timestamp":1724416742000,"abstract":"  Existing vehicle detectors are usually obtained by training a typical\ndetector (e.g., YOLO, RCNN, DETR series) on vehicle images based on a\npre-trained backbone (e.g., ResNet, ViT). Some researchers also exploit and\nenhance the detection performance using pre-trained large foundation models.\nHowever, we think these detectors may only get sub-optimal results because the\nlarge models they use are not specifically designed for vehicles. In addition,\ntheir results heavily rely on visual features, and seldom of they consider the\nalignment between the vehicle's semantic information and visual\nrepresentations. In this work, we propose a new vehicle detection paradigm\nbased on a pre-trained foundation vehicle model (VehicleMAE) and a large\nlanguage model (T5), termed VFM-Det. It follows the region proposal-based\ndetection framework and the features of each proposal can be enhanced using\nVehicleMAE. More importantly, we propose a new VAtt2Vec module that predicts\nthe vehicle semantic attributes of these proposals and transforms them into\nfeature vectors to enhance the vision features via contrastive learning.\nExtensive experiments on three vehicle detection benchmark datasets thoroughly\nproved the effectiveness of our vehicle detector. Specifically, our model\nimproves the baseline approach by $+5.1\\%$, $+6.2\\%$ on the $AP_{0.5}$,\n$AP_{0.75}$ metrics, respectively, on the Cityscapes dataset.The source code of\nthis work will be released at https://github.com/Event-AHU/VFM-Det.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}