{"id":"2408.14963","title":"The future of offshore wind power production: wake and climate impacts","authors":"Simon C Warder and Matthew D Piggott","authorsParsed":[["Warder","Simon C",""],["Piggott","Matthew D",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 11:10:37 GMT"}],"updateDate":"2024-08-28","timestamp":1724757037000,"abstract":"  Rapid deployment of offshore wind is expected within the coming decades to\nhelp meet climate goals. With offshore wind turbine lifetimes of 25-30 years,\nand new offshore leases spanning 60 years, it is vital to consider long-term\nchanges in potential wind power resource at the farm planning stage. Such\nchanges may arise from multiple sources, including climate change, and\nincreasing wake-induced power losses. In this work, we investigate and compare\nthese two sources of long-term change in wind power, for a case study\nconsisting of 21 wind farms within the German Bight. Consistent with previous\nstudies, we find a small but significant reduction in wind resource due to\nclimate change by the end of the 21st century under the high-emission RCP8.5\nscenario, compared with a historical period, with a mean power reduction (over\nan ensemble of seven climate models) of 2.1%. To assess the impact of\nwake-induced losses due to increasingly dense farm build-out, we model wakes\nwithin the German Bight region using an engineering wake model, under various\nstages of (planned) build-out corresponding to the years 2010-2027. By\nidentifying clusters of wind farms, we decompose wake effects into long-range\n(inter-cluster), medium-range (intra-cluster) and short-range (intra-farm)\neffects. Inter-cluster wake-induced losses increase from 0 for the 2010\nscenario to 2.5% for the 2027 scenario, with intra-cluster losses also\nincreasing from 0 to 4.3%. Intra-farm losses are relatively constant, at around\n13%. While the evolution of wake effects therefore outweighs the climate\neffect, and impacts over a shorter timescale, both factors are significant. We\nalso find evidence of non-linear interactions between the climate and wake\neffects. Both climate change and evolving wake effects must therefore be\nconsidered within resource assessment and wind farm planning.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}