{"id":"2408.03700","title":"Entanglement Transition due to particle losses in a monitored fermionic\n  chain","authors":"Rafael D. Soares, Youenn Le Gal, Marco Schir\\`o","authorsParsed":[["Soares","Rafael D.",""],["Gal","Youenn Le",""],["Schirò","Marco",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 11:30:09 GMT"}],"updateDate":"2024-08-08","timestamp":1723030209000,"abstract":"  Recently, there has been interest in the dynamics of monitored quantum\nsystems using linear jump operators related to the creation or annihilation of\nparticles. Here we study the dynamics of the entanglement entropy under quantum\njumps that induce local particle losses in a model of free fermions with\nhopping and $\\mathbb{Z}_2$ pairing. We explore the different steady-state\nentanglement regimes by interpolating between monitored free fermions with U(1)\nsymmetry and $\\mathbb{Z}_2$ fermions. In the absence of pairing, the U(1)\nsymmetric model approaches the vacuum at long times, with the entanglement\nentropy showing non-monotonic behavior over time that we capture with a\nphenomenological quasiparticle ansatz. In this regime, quantum jumps play a key\nrole, and we highlight this by exactly computing their waiting-time\ndistribution. On the other hand, the interplay between losses and pairing in\nthe $\\mathbb{Z}_2$ case gives rise to quantum trajectories with entangled\nsteady-states. We show that by tuning the several system parameters, a\nmeasurement-induced entanglement transition occurs where the entanglement\nentropy scaling changes from logarithmic to area-law. We compare this\ntransition with the one derived in the no-click limit and observe qualitative\nagreement in most of the phase diagram. Furthermore, the statistics of\nentanglement gain and loss are analyzed to better understand the impact of the\nlinear jump operators.\n","subjects":["Condensed Matter/Statistical Mechanics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"a2J8TNiXpTfEPKOk61oHonEC6zDDo1TMTw0_VVkpd3A","pdfSize":"2025791"}
