{"id":"2408.07678","title":"Your MMM is Broken: Identification of Nonlinear and Time-varying Effects\n  in Marketing Mix Models","authors":"Ryan Dew, Nicolas Padilla, Anya Shchetkina","authorsParsed":[["Dew","Ryan",""],["Padilla","Nicolas",""],["Shchetkina","Anya",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 17:24:10 GMT"}],"updateDate":"2024-08-15","timestamp":1723656250000,"abstract":"  Recent years have seen a resurgence in interest in marketing mix models\n(MMMs), which are aggregate-level models of marketing effectiveness. Often\nthese models incorporate nonlinear effects, and either implicitly or explicitly\nassume that marketing effectiveness varies over time. In this paper, we show\nthat nonlinear and time-varying effects are often not identifiable from\nstandard marketing mix data: while certain data patterns may be suggestive of\nnonlinear effects, such patterns may also emerge under simpler models that\nincorporate dynamics in marketing effectiveness. This lack of identification is\nproblematic because nonlinearities and dynamics suggest fundamentally different\noptimal marketing allocations. We examine this identification issue through\ntheory and simulations, wherein we explore the exact conditions under which\nconflation between the two types of models is likely to occur. In doing so, we\nintroduce a flexible Bayesian nonparametric model that allows us to both\nflexibly simulate and estimate different data-generating processes. We show\nthat conflating the two types of effects is especially likely in the presence\nof autocorrelated marketing variables, which are common in practice, especially\ngiven the widespread use of stock variables to capture long-run effects of\nadvertising. We illustrate these ideas through numerous empirical applications\nto real-world marketing mix data, showing the prevalence of the conflation\nissue in practice. Finally, we show how marketers can avoid this conflation, by\ndesigning experiments that strategically manipulate spending in ways that pin\ndown model form.\n","subjects":["Economics/Econometrics","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}