{"id":"2408.14434","title":"Employing Artificial Intelligence to Steer Exascale Workflows with\n  Colmena","authors":"Logan Ward, J. Gregory Pauloski, Valerie Hayot-Sasson, Yadu Babuji,\n  Alexander Brace, Ryan Chard, Kyle Chard, Rajeev Thakur, Ian Foster","authorsParsed":[["Ward","Logan",""],["Pauloski","J. Gregory",""],["Hayot-Sasson","Valerie",""],["Babuji","Yadu",""],["Brace","Alexander",""],["Chard","Ryan",""],["Chard","Kyle",""],["Thakur","Rajeev",""],["Foster","Ian",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 17:21:19 GMT"}],"updateDate":"2024-08-27","timestamp":1724692879000,"abstract":"  Computational workflows are a common class of application on supercomputers,\nyet the loosely coupled and heterogeneous nature of workflows often fails to\ntake full advantage of their capabilities. We created Colmena to leverage the\nmassive parallelism of a supercomputer by using Artificial Intelligence (AI) to\nlearn from and adapt a workflow as it executes. Colmena allows scientists to\ndefine how their application should respond to events (e.g., task completion)\nas a series of cooperative agents. In this paper, we describe the design of\nColmena, the challenges we overcame while deploying applications on exascale\nsystems, and the science workflows we have enhanced through interweaving AI.\nThe scaling challenges we discuss include developing steering strategies that\nmaximize node utilization, introducing data fabrics that reduce communication\noverhead of data-intensive tasks, and implementing workflow tasks that cache\ncostly operations between invocations. These innovations coupled with a variety\nof application patterns accessible through our agent-based steering model have\nenabled science advances in chemistry, biophysics, and materials science using\ndifferent types of AI. Our vision is that Colmena will spur creative solutions\nthat harness AI across many domains of scientific computing.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}