{"id":"2408.01083","title":"Thermodynamic quantum Fokker-Planck equations and their application to\n  thermostatic Stirling engine","authors":"Shoki Koyanagi and Yoshitaka Tanimura","authorsParsed":[["Koyanagi","Shoki",""],["Tanimura","Yoshitaka",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 08:02:12 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 22:01:36 GMT"}],"updateDate":"2024-08-30","timestamp":1722585732000,"abstract":"  We developed a computer code for the thermodynamic quantum Fokker-Planck\nequations (T-QFPE), derived from a thermodynamic system-bath model. This model\nconsists of an anharmonic subsystem coupled to multiple Ohmic baths at\ndifferent temperatures, which are connected to or disconnected from the\nsubsystem as a function of time. The code numerically integrates the T-QFPE and\ntheir classical expression to simulate isothermal, isentropic, thermostatic,\nand entropic processes in both quantum and classical cases. The accuracy of the\nresults was verified by comparing the analytical solutions of the Brownian\noscillator. Additionally, we illustrated a breakdown of the Markovian\nLindblad-master equation in the pure quantum regime. As a demonstration, we\nsimulated a thermostatic Stirling engine under quasi-static conditions. The\nquasi-static thermodynamic potentials, described as intensive and extensive\nvariables, were depicted as work diagrams. In the classical case, the work done\nby the external field is independent of the system-bath coupling strength. In\ncontrast, in the quantum case, the work decreases as the coupling strength\nincreases due to quantum entanglement between the subsystem and bath. The codes\nwere developed for multicore processors using Open multiprocessing (OpenMP) and\nfor graphics processing units (GPU) using the Compute United Device\nArchitecture (CUDA). These codes are provided as supplementary materials.\n","subjects":["Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dUxt_kyk3ogYsxOUohm6CZHaXELppPp54GkaGklneeY","pdfSize":"1024638"}
