{"id":"2408.16192","title":"Molecular-Scale Insights into the Heterogeneous Interactions Between an\n  m-Terphenyl Isocyanide Ligand and Noble Metal Nanoparticles","authors":"Liya Bi, Yufei Wang, Zhe Wang, Alexandria Do, Alexander Fuqua, Krista\n  P. Balto, Yanning Zhang, Joshua S. Figueroa, Tod A. Pascal, Andrea R. Tao,\n  Shaowei Li","authorsParsed":[["Bi","Liya",""],["Wang","Yufei",""],["Wang","Zhe",""],["Do","Alexandria",""],["Fuqua","Alexander",""],["Balto","Krista P.",""],["Zhang","Yanning",""],["Figueroa","Joshua S.",""],["Pascal","Tod A.",""],["Tao","Andrea R.",""],["Li","Shaowei",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 01:10:03 GMT"},{"version":"v2","created":"Mon, 16 Sep 2024 18:23:34 GMT"}],"updateDate":"2024-09-18","timestamp":1724893803000,"abstract":"  The structural and chemical properties of metal nanoparticles are often\ndictated by their interactions with molecular ligand shells. These interactions\nare highly material-specific and can vary significantly even among elements\nwithin the same group or materials with similar crystal structure. Precise\ncharacterization of ligand-metal interactions is crucial for the rational\ndesign of ligands and the functionalization of nanoparticles. In this study, we\nfound that the ligation behavior with m-terphenyl isocyanide molecule differs\nsignificantly between Au and Ag nanoparticles, with distinct ligand extraction\nefficiencies and size dependencies. Surface-enhanced Raman spectroscopy\nmeasurements revealed unique enhancement factors for two molecular vibrational\nmodes between two metal surfaces, indicating different ligand binding\ngeometries. Molecular-level characterization using scanning tunneling\nmicroscopy allowed us to directly visualize these variations between Ag and Au\nsurfaces, which we assign as two distinct binding mechanisms. This\nmolecular-scale visualization provides clear insights into the different\nligand-metal interactions, as well as the chemical behavior and spectroscopic\ncharacteristics of isocyanide-functionalized nanoparticles.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CvXvCbLFOofuHyxDv-DG7qNLNG-Q9C9Mpa1ndhT0aiI","pdfSize":"533455"}
