{"id":"2408.16850","title":"MPADA: Open source framework for multimodal time series antenna array\n  measurements","authors":"Yuyi Chang, Yingzhe Zhang, Asimina Kiourti, and Emre Ertin","authorsParsed":[["Chang","Yuyi",""],["Zhang","Yingzhe",""],["Kiourti","Asimina",""],["Ertin","Emre",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:31:20 GMT"}],"updateDate":"2024-09-02","timestamp":1724956280000,"abstract":"  This paper presents an open-source framework for collecting time series\nS-parameter measurements across multiple antenna elements, dubbed MPADA:\nMulti-Port Antenna Data Acquisition. The core of MPADA relies on the standard\nSCPI protocol to be compatible with a wide range of hardware platforms. Time\nseries measurements are enabled through the use of a high-precision real-time\nclock (RTC), allowing MPADA to periodically trigger the VNA and simultaneously\nacquire other sensor data for synchronized cross-modal data fusion. A web-based\nuser interface has been developed to offer flexibility in instrumentation,\nvisualization, and analysis. The interface is accessible from a broad range of\ndevices, including mobile ones. Experiments are performed to validate the\nreliability and accuracy of the data collected using the proposed framework.\nFirst, we show the framework's capacity to collect highly repeatable\nmeasurements from a complex measurement protocol using a microwave tomography\nimaging system. The data collected from a test phantom attain high fidelity\nwhere a position-varying clutter is visible through coherent subtraction.\nSecond, we demonstrate timestamp accuracy for collecting time series motion\ndata jointly from an RF kinematic sensor and an angle sensor. We achieved an\naverage of 11.8 ms MSE timestamp accuracy at a mixed sampling rate of 10 to 20\nHz over a total of 16-minute test data. We make the framework openly available\nto benefit the antenna measurement community, providing researchers and\nengineers with a versatile tool for research and instrumentation. Additionally,\nwe offer a potential education tool to engage engineering students in the\nsubject, fostering hands-on learning through remote experimentation.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}