{"id":"2408.02129","title":"Do earthquakes \"know\" how big they will be? a neural-net aided study","authors":"Neri Berman, Oleg Zlydenko, Oren Gilon, Yossi Matias, Yohai Bar-Sinai","authorsParsed":[["Berman","Neri",""],["Zlydenko","Oleg",""],["Gilon","Oren",""],["Matias","Yossi",""],["Bar-Sinai","Yohai",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 19:54:51 GMT"}],"updateDate":"2024-08-06","timestamp":1722801291000,"abstract":"  Earthquake occurrence is notoriously difficult to predict. While some aspects\nof their spatiotemporal statistics can be relatively well captured by\npoint-process models, very little is known regarding the magnitude of future\nevents, and it is deeply debated whether it is possible to predict the\nmagnitude of an earthquake before it starts. This is due both to the lack of\ninformation about fault conditions and to the inherent complexity of rupture\ndynamics. Consequently, even state of the art forecasting models typically\nassume no knowledge about the magnitude of future events besides the\ntime-independent Gutenberg Richter (GR) distribution, which describes the\nmarginal distribution over large regions and long times. This approach\nimplicitly assumes that earthquake magnitudes are independent of previous\nseismicity and are identically distributed. In this work we challenge this view\nby showing that information about the magnitude of an upcoming earthquake can\nbe directly extracted from the seismic history. We present MAGNET - MAGnitude\nNeural EsTimation model, an open-source, geophysically-inspired neural-network\nmodel for probabilistic forecasting of future magnitudes from cataloged\nproperties: hypocenter locations, occurrence times and magnitudes of past\nearthquakes. Our history-dependent model outperforms stationary and\nquasi-stationary state of the art GR-based benchmarks, in real catalogs in\nSouthern California, Japan and New-Zealand. This demonstrates that earthquake\ncatalogs contain information about the magnitude of future earthquakes, prior\nto their occurrence. We conclude by proposing methods to apply the model in\ncharacterization of the preparatory phase of earthquakes, and in operational\nhazard alert and earthquake forecasting systems.\n","subjects":["Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZmG6G8lKLvuewMsPJIjkHywk4H97GAICQK-PLQUcUS4","pdfSize":"26489571","txDigest":"CF7EJFzp3GMns6mj3UrYSn9gia415npazrSSvokSvWUu","endEpoch":"1","status":"CERTIFIED"}
