{"id":"2408.14157","title":"Atomic-scale observation of geometric frustration in a\n  fluorine-intercalated infinite layer nickelate superlattice","authors":"Chao Yang, Roberto A. Ortiz, Hongguang Wang, Wilfried Sigle, Kelvin\n  Anggara, Eva Benckiser, Bernhard Keimer, Peter A. van Aken","authorsParsed":[["Yang","Chao",""],["Ortiz","Roberto A.",""],["Wang","Hongguang",""],["Sigle","Wilfried",""],["Anggara","Kelvin",""],["Benckiser","Eva",""],["Keimer","Bernhard",""],["van Aken","Peter A.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 10:04:56 GMT"}],"updateDate":"2024-08-30","timestamp":1724666696000,"abstract":"  Anion doping offers immense potential for tailoring material properties, but\nachieving precise control over anion incorporation remains a challenge due to\ncomplex synthesis processes and limitations in local dopant detection. Here, we\ninvestigate the F-ion intercalation within an infinite layer NdNiO2+x/SrTiO3\nsuperlattice film using a two-step synthesis approach. We employ advanced\nfour-dimensional scanning transmission electron microscopy (4D-STEM) coupled\nwith electron energy loss spectroscopy to map the F distribution and its impact\non the atomic and electronic structure. Our observations reveal a striking\ngeometric reconstruction of the infinite layer structure upon fluorination,\nresulting in a more distorted orthorhombic phase compared to the pristine\nperovskite. Notably, F-ion intercalation occurs primarily at the apical sites\nof the polyhedron, with some occupation of basal sites in localized regions.\nThis process leads to the formation of two distinct domains within the\nnickelate layer, reflecting a competition between polyhedral distortion and\ngeometric frustration-induced neodymium (Nd) displacement near domain\ninterfaces. Interestingly, we observe an anomalous structural distortion where\nbasal site anions are displaced in the same direction as Nd atoms, potentially\nlinked to the partial basal site F-ion occupation. This coexistence of diverse\nstructural distortions signifies a locally disordered F-ion distribution within\nthe infinite layer structure with distinct F-ion configurations. These findings\nprovide crucial insights into understanding and manipulating anion doping at\nthe atomic level, paving the way for the development of novel materials with\nprecisely controlled functionalities.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}