{"id":"2408.07136","title":"Toward a Comprehensive Grid of Cepheid Models with MESA I. Uncertainties\n  of the Evolutionary Tracks of Intermediate-Mass Stars","authors":"Oliwia Zi\\'o{\\l}kowska, Rados{\\l}aw Smolec, Anne Thoul, Eoin Farrell,\n  Rajeev Singh Rathour, Vincent Hocd\\'e","authorsParsed":[["Ziółkowska","Oliwia",""],["Smolec","Radosław",""],["Thoul","Anne",""],["Farrell","Eoin",""],["Rathour","Rajeev Singh",""],["Hocdé","Vincent",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 18:10:57 GMT"}],"updateDate":"2024-08-15","timestamp":1723572657000,"abstract":"  Helium-burning stars, in particular Cepheids, are especially difficult to\nmodel, as the choice of free parameters can greatly impact the shape of the\nblue loops - the part of the evolutionary track at which instability strip is\ncrossed. Contemporary one-dimensional stellar evolution codes, like MESA\n(Modules for Experiments in Stellar Astrophysics), come with a large number of\nfree parameters that allow to model the physical processes in stellar interiors\nunder many assumptions. The uncertainties that arise from this freedom are\nrarely discussed in the literature despite their impact on the evolution of the\nmodel. We calculate a grid of evolutionary models with MESA, varying several\ncontrols, like solar mixture of heavy elements, mixing length theory\nprescription, nuclear reaction rates, scheme to determine convective\nboundaries, atmosphere model, temporal and spatial resolution, and quantify\ntheir impact on age and location of the evolutionary track on the HR diagram\nfrom the main sequence till the end of core-helium burning. Our investigation\nwas conducted for a full range of masses and metallicities expected for\nclassical Cepheids. The uncertainties are significant, especially during\ncore-helium burning, reaching or exceeding the observational uncertainties of\nlog Teff and log L for detached eclipsing binary systems. For models below 9\nsolar masses, thin convective shells develop and evolve erratically, not\nallowing the models to converge. A careful inspection of Kippenhahn diagrams\nand convergence study is advised for a given mass and metallicity, to assess\nhow severe this problem is and to what extent it may affect the evolution.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}