{"id":"2408.06968","title":"Event-Stream Super Resolution using Sigma-Delta Neural Network","authors":"Waseem Shariff, Joe Lemley, Peter Corcoran","authorsParsed":[["Shariff","Waseem",""],["Lemley","Joe",""],["Corcoran","Peter",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 15:25:18 GMT"}],"updateDate":"2024-08-14","timestamp":1723562718000,"abstract":"  This study introduces a novel approach to enhance the spatial-temporal\nresolution of time-event pixels based on luminance changes captured by event\ncameras. These cameras present unique challenges due to their low resolution\nand the sparse, asynchronous nature of the data they collect. Current event\nsuper-resolution algorithms are not fully optimized for the distinct data\nstructure produced by event cameras, resulting in inefficiencies in capturing\nthe full dynamism and detail of visual scenes with improved computational\ncomplexity. To bridge this gap, our research proposes a method that integrates\nbinary spikes with Sigma Delta Neural Networks (SDNNs), leveraging\nspatiotemporal constraint learning mechanism designed to simultaneously learn\nthe spatial and temporal distributions of the event stream. The proposed\nnetwork is evaluated using widely recognized benchmark datasets, including\nN-MNIST, CIFAR10-DVS, ASL-DVS, and Event-NFS. A comprehensive evaluation\nframework is employed, assessing both the accuracy, through root mean square\nerror (RMSE), and the computational efficiency of our model. The findings\ndemonstrate significant improvements over existing state-of-the-art methods,\nspecifically, the proposed method outperforms state-of-the-art performance in\ncomputational efficiency, achieving a 17.04-fold improvement in event sparsity\nand a 32.28-fold increase in synaptic operation efficiency over traditional\nartificial neural networks, alongside a two-fold better performance over\nspiking neural networks.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}