{"id":"2408.02509","title":"Practical Attacks against Black-box Code Completion Engines","authors":"Slobodan Jenko, Jingxuan He, Niels M\\\"undler, Mark Vero, Martin Vechev","authorsParsed":[["Jenko","Slobodan",""],["He","Jingxuan",""],["Mündler","Niels",""],["Vero","Mark",""],["Vechev","Martin",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 14:31:26 GMT"}],"updateDate":"2024-08-06","timestamp":1722868286000,"abstract":"  Modern code completion engines, powered by large language models, have\ndemonstrated impressive capabilities to generate functionally correct code\nbased on surrounding context. As these tools are extensively used by millions\nof developers, it is crucial to investigate their security implications. In\nthis work, we present INSEC, a novel attack that directs code completion\nengines towards generating vulnerable code. In line with most commercial\ncompletion engines, such as GitHub Copilot, INSEC assumes only black-box query\naccess to the targeted engine, without requiring any knowledge of the engine's\ninternals. Our attack works by inserting a malicious attack string as a short\ncomment in the completion input. To derive the attack string, we design a\nseries of specialized initialization schemes and an optimization procedure for\nfurther refinement. We demonstrate the strength of INSEC not only on\nstate-of-the-art open-source models but also on black-box commercial services\nsuch as the OpenAI API and GitHub Copilot. On a comprehensive set of\nsecurity-critical test cases covering 16 CWEs across 5 programming languages,\nINSEC significantly increases the likelihood of the considered completion\nengines in generating unsafe code by >50% in absolute, while maintaining the\nability in producing functionally correct code. At the same time, our attack\nhas low resource requirements, and can be developed for a cost of well under\nten USD on commodity hardware.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning","Computing Research Repository/Programming Languages","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/"}