{"id":"2408.03712","title":"NetQIR: An Extension of QIR for Distributed Quantum Computing","authors":"Jorge V\\'azquez-P\\'erez, F. Javier Cardama, C\\'esar Pi\\~neiro, Tom\\'as\n  F. Pena, Juan C. Pichel and Andr\\'es G\\'omez","authorsParsed":[["Vázquez-Pérez","Jorge",""],["Cardama","F. Javier",""],["Piñeiro","César",""],["Pena","Tomás F.",""],["Pichel","Juan C.",""],["Gómez","Andrés",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 12:01:47 GMT"}],"updateDate":"2024-08-08","timestamp":1723032107000,"abstract":"  The rapid advance of quantum computing has highlighted the need for scalable\nand efficient software infrastructures to fully exploit its potential. While\ncurrent quantum processors have significant scalability problems due to the\nlimited number of qubits on each chip, distributed quantum computing offers a\npromising solution by networking multiple Quantum Processing Units (QPUs). To\nsupport this paradigm, robust Intermediate Representations (IRs) are crucial\nfor translating high-level quantum algorithms into executable instructions\nacross distributed systems. This paper introduces NetQIR, an extension of\nMicrosoft's Quantum Intermediate Representation (QIR), specifically designed\nfor distributed quantum computing. NetQIR is designed to meet the specific\nneeds of distributed quantum systems by incorporating functions to manage\nquantum and classical communications between QPUs. The main objective is to\nfacilitate the development of new distributed compilers by improving the\nintegration and execution of quantum programmes in a distributed\ninfrastructure, taking advantage of modular architectures to improve\nscalability. By extending QIR to support distributed quantum computing, NetQIR\naims to complement and add capabilities to an already supported quantum IR and,\nat the same time, take advantage of the tools previously created for QIR.\nThroughout this paper the specification of the intermediate representation is\nintroduced, including the basic instructions necessary to enable distributed\nquantum computing in an abstract form independent of the target machine.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}