{"id":"2408.12622","title":"The AI Risk Repository: A Comprehensive Meta-Review, Database, and\n  Taxonomy of Risks From Artificial Intelligence","authors":"Peter Slattery, Alexander K. Saeri, Emily A. C. Grundy, Jess Graham,\n  Michael Noetel, Risto Uuk, James Dao, Soroush Pour, Stephen Casper, and Neil\n  Thompson","authorsParsed":[["Slattery","Peter",""],["Saeri","Alexander K.",""],["Grundy","Emily A. C.",""],["Graham","Jess",""],["Noetel","Michael",""],["Uuk","Risto",""],["Dao","James",""],["Pour","Soroush",""],["Casper","Stephen",""],["Thompson","Neil",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 10:32:06 GMT"}],"updateDate":"2024-08-26","timestamp":1723631526000,"abstract":"  The risks posed by Artificial Intelligence (AI) are of considerable concern\nto academics, auditors, policymakers, AI companies, and the public. However, a\nlack of shared understanding of AI risks can impede our ability to\ncomprehensively discuss, research, and react to them. This paper addresses this\ngap by creating an AI Risk Repository to serve as a common frame of reference.\nThis comprises a living database of 777 risks extracted from 43 taxonomies,\nwhich can be filtered based on two overarching taxonomies and easily accessed,\nmodified, and updated via our website and online spreadsheets. We construct our\nRepository with a systematic review of taxonomies and other structured\nclassifications of AI risk followed by an expert consultation. We develop our\ntaxonomies of AI risk using a best-fit framework synthesis. Our high-level\nCausal Taxonomy of AI Risks classifies each risk by its causal factors (1)\nEntity: Human, AI; (2) Intentionality: Intentional, Unintentional; and (3)\nTiming: Pre-deployment; Post-deployment. Our mid-level Domain Taxonomy of AI\nRisks classifies risks into seven AI risk domains: (1) Discrimination &\ntoxicity, (2) Privacy & security, (3) Misinformation, (4) Malicious actors &\nmisuse, (5) Human-computer interaction, (6) Socioeconomic & environmental, and\n(7) AI system safety, failures, & limitations. These are further divided into\n23 subdomains. The AI Risk Repository is, to our knowledge, the first attempt\nto rigorously curate, analyze, and extract AI risk frameworks into a publicly\naccessible, comprehensive, extensible, and categorized risk database. This\ncreates a foundation for a more coordinated, coherent, and complete approach to\ndefining, auditing, and managing the risks posed by AI systems.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Cryptography and Security","Computing Research Repository/Emerging Technologies","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}