{"id":"2408.08785","title":"A Transparency Paradox? Investigating the Impact of Explanation\n  Specificity and Autonomous Vehicle Perceptual Inaccuracies on Passengers","authors":"Daniel Omeiza, Raunak Bhattacharyya, Marina Jirotka, Nick Hawes and\n  Lars Kunze","authorsParsed":[["Omeiza","Daniel",""],["Bhattacharyya","Raunak",""],["Jirotka","Marina",""],["Hawes","Nick",""],["Kunze","Lars",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 14:59:00 GMT"}],"updateDate":"2024-08-19","timestamp":1723820340000,"abstract":"  Transparency in automated systems could be afforded through the provision of\nintelligible explanations. While transparency is desirable, might it lead to\ncatastrophic outcomes (such as anxiety), that could outweigh its benefits? It's\nquite unclear how the specificity of explanations (level of transparency)\ninfluences recipients, especially in autonomous driving (AD). In this work, we\nexamined the effects of transparency mediated through varying levels of\nexplanation specificity in AD. We first extended a data-driven explainer model\nby adding a rule-based option for explanation generation in AD, and then\nconducted a within-subject lab study with 39 participants in an immersive\ndriving simulator to study the effect of the resulting explanations.\nSpecifically, our investigation focused on: (1) how different types of\nexplanations (specific vs. abstract) affect passengers' perceived safety,\nanxiety, and willingness to take control of the vehicle when the vehicle\nperception system makes erroneous predictions; and (2) the relationship between\npassengers' behavioural cues and their feelings during the autonomous drives.\nOur findings showed that passengers felt safer with specific explanations when\nthe vehicle's perception system had minimal errors, while abstract explanations\nthat hid perception errors led to lower feelings of safety. Anxiety levels\nincreased when specific explanations revealed perception system errors (high\ntransparency). We found no significant link between passengers' visual patterns\nand their anxiety levels. Our study suggests that passengers prefer clear and\nspecific explanations (high transparency) when they originate from autonomous\nvehicles (AVs) with optimal perceptual accuracy.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society","Computing Research Repository/Machine Learning","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"t-PO0JFFsjy6niHfIQdR_X06tVmZja1cGrh_NV63KwE","pdfSize":"6966887"}
