{"id":"2408.15119","title":"A Permuted Autoregressive Approach to Word-Level Recognition for Urdu\n  Digital Text","authors":"Ahmed Mustafa, Muhammad Tahir Rafique, Muhammad Ijlal Baig, Hasan\n  Sajid, Muhammad Jawad Khan, Karam Dad Kallu","authorsParsed":[["Mustafa","Ahmed",""],["Rafique","Muhammad Tahir",""],["Baig","Muhammad Ijlal",""],["Sajid","Hasan",""],["Khan","Muhammad Jawad",""],["Kallu","Karam Dad",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 14:58:13 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 09:11:55 GMT"},{"version":"v3","created":"Fri, 30 Aug 2024 15:29:08 GMT"}],"updateDate":"2024-09-02","timestamp":1724770693000,"abstract":"  This research paper introduces a novel word-level Optical Character\nRecognition (OCR) model specifically designed for digital Urdu text, leveraging\ntransformer-based architectures and attention mechanisms to address the\ndistinct challenges of Urdu script recognition, including its diverse text\nstyles, fonts, and variations. The model employs a permuted autoregressive\nsequence (PARSeq) architecture, which enhances its performance by enabling\ncontext-aware inference and iterative refinement through the training of\nmultiple token permutations. This method allows the model to adeptly manage\ncharacter reordering and overlapping characters, commonly encountered in Urdu\nscript. Trained on a dataset comprising approximately 160,000 Urdu text images,\nthe model demonstrates a high level of accuracy in capturing the intricacies of\nUrdu script, achieving a CER of 0.178. Despite ongoing challenges in handling\ncertain text variations, the model exhibits superior accuracy and effectiveness\nin practical applications. Future work will focus on refining the model through\nadvanced data augmentation techniques and the integration of context-aware\nlanguage models to further enhance its performance and robustness in Urdu text\nrecognition.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9fKn42iVy6qMCn1DvDTZY25PtdJDTtYxYB3QHMvIYZI","pdfSize":"515945"}
