{"id":"2408.00517","title":"Charting the Lyman-alpha escape fraction in the range 2.9<z<6.7 and\n  consequences for the LAE reionisation contribution","authors":"Ilias Goovaerts, Tran Thi Thai, Roser Pello, Pham Tuan-Anh, Nicolas\n  Laporte, Jorryt Matthee, Themiya Nanayakkara, John Pharo","authorsParsed":[["Goovaerts","Ilias",""],["Thai","Tran Thi",""],["Pello","Roser",""],["Tuan-Anh","Pham",""],["Laporte","Nicolas",""],["Matthee","Jorryt",""],["Nanayakkara","Themiya",""],["Pharo","John",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 12:47:53 GMT"}],"updateDate":"2024-08-02","timestamp":1722516473000,"abstract":"  The escape of Lyman-alpha photons at redshifts greater than two is an ongoing\nsubject of study and an important quantity to further understanding of\nLyman-alpha emitters (LAEs), the transmission of Lyman-alpha photons through\nthe interstellar medium and intergalactic medium, and the impact these LAEs\nhave on cosmic reionisation. This study aims to assess the Lyman-alpha escape\nfraction over the redshift range 2.9<z<6.7, focusing on VLT/MUSE-selected,\ngravitationally lensed, intrinsically faint LAEs. These galaxies are of\nparticular interest as the potential drivers of cosmic reionisation. We\nassessed the Lyman-alpha escape fraction in two ways: through an individual\nstudy of 96 LAEs behind the A2744 lensing cluster, with JWST/NIRCam and HST\ndata, and through a study of the global evolution of the escape fraction using\nthe state-of-the-art luminosity functions for LAEs and the UV-selected `parent'\npopulation (dust-corrected). We compared these studies to those in the\nliterature based on brighter samples. We find a negligible redshift evolution\nof the escape fraction for our individual galaxies; it is likely that it was\nwashed out by significant intrinsic scatter. We observed a more significant\nevolution towards higher escape fractions with decreasing UV magnitude and fit\nthis relation. When comparing the two luminosity functions to derive the escape\nfraction in a global sense, we saw agreement with previous literature when\nintegrating the luminosity functions to a bright limit. However, when\nintegrating using a faint limit equivalent to the observational limits of our\nsamples, we observed enhanced escape fraction values, particularly around z~6,\nwhere the escape fraction becomes consistent with 100%. This indicates for the\nfaint regimes we sampled that galaxies towards reionisation tend to allow very\nlarge fractions of Lyman-alpha photons to escape. (shortened)\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}