{"id":"2408.14159","title":"\"Hi. I'm Molly, Your Virtual Interviewer!\" -- Exploring the Impact of\n  Race and Gender in AI-powered Virtual Interview Experiences","authors":"Shreyan Biswas, Ji-Youn Jung, Abhishek Unnam, Kuldeep Yadav, Shreyansh\n  Gupta, Ujwal Gadiraju","authorsParsed":[["Biswas","Shreyan",""],["Jung","Ji-Youn",""],["Unnam","Abhishek",""],["Yadav","Kuldeep",""],["Gupta","Shreyansh",""],["Gadiraju","Ujwal",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 10:14:07 GMT"}],"updateDate":"2024-08-27","timestamp":1724667247000,"abstract":"  The persistent issue of human bias in recruitment processes poses a\nformidable challenge to achieving equitable hiring practices, particularly when\ninfluenced by demographic characteristics such as gender and race of both\ninterviewers and candidates. Asynchronous Video Interviews (AVIs), powered by\nArtificial Intelligence (AI), have emerged as innovative tools aimed at\nstreamlining the application screening process while potentially mitigating the\nimpact of such biases. These AI-driven platforms present an opportunity to\ncustomize the demographic features of virtual interviewers to align with\ndiverse applicant preferences, promising a more objective and fair evaluation.\nDespite their growing adoption, the implications of virtual interviewer\nidentities on candidate experiences within AVIs remain underexplored. We aim to\naddress this research and empirical gap in this paper. To this end, we carried\nout a comprehensive between-subjects study involving 218 participants across\nsix distinct experimental conditions, manipulating the gender and skin color of\nan AI virtual interviewer agent. Our empirical analysis revealed that while the\ndemographic attributes of the agents did not significantly influence the\noverall experience of interviewees, variations in the interviewees'\ndemographics significantly altered their perception of the AVI process.\nFurther, we uncovered that the mediating roles of Social Presence and\nPerception of the virtual interviewer critically affect interviewees'\nperceptions of fairness (+), privacy (-), and impression management (+).\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"f9vZRYRoiGyBdgUBxbWMuKk2_S7pko_MVphL8zdb-rY","pdfSize":"377008"}
