{"id":"2408.13483","title":"Transmissive RIS Enabled Transceiver Systems:Architecture, Design Issues\n  and Opportunities","authors":"Zhendong Li, Wen Chen, Qingqing Wu, Ziwei Liu, Chong He, Xudong Bai,\n  and Jun Li","authorsParsed":[["Li","Zhendong",""],["Chen","Wen",""],["Wu","Qingqing",""],["Liu","Ziwei",""],["He","Chong",""],["Bai","Xudong",""],["Li","Jun",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 05:58:33 GMT"}],"updateDate":"2024-08-27","timestamp":1724479113000,"abstract":"  Reconfigurable intelligent surface (RIS) is anticipated to augment the\nperformance of beyond fifth-generation (B5G) and sixth-generation (6G) networks\nby intelligently manipulating the state of its components. Rather than\nemploying reflective RIS for aided communications, this paper proposes an\ninnovative transmissive RIS-enabled transceiver (TRTC) architecture that can\naccomplish the functions of traditional multi-antenna systems in a\ncost-effective and energy-efficient manner. First, the proposed network\narchitecture and its corresponding transmission scheme are elaborated from the\nperspectives of downlink (DL) and uplink (UL) transmissions. Then, we\nillustrate several significant advantages and differences of TRTC compared to\nother multiantenna systems. Furthermore, the downlink modulation and extraction\nprinciple based on time-modulation array (TMA) is introduced in detail to\ntackle the multi-stream communications. Moreover, a near-far field channel\nmodel appropriate for this architecture is proposed. Based on the channel\nmodel, we summarize some state-of-the-art channel estimation schemes, and the\nchannel estimation scheme of TRTC is also provided. Considering the\noptimization for DL and UL communications, we present numerical simulations\nthat confirm the superiority of the proposed optimization algorithm. Lastly,\nnumerous prospective research avenues for TRTC systems are delineated to\ninspire further exploration.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}