{"id":"2408.14518","title":"A Survey on Reinforcement Learning Applications in SLAM","authors":"Mohammad Dehghani Tezerjani, Mohammad Khoshnazar, Mohammadhamed\n  Tangestanizadeh, Qing Yang","authorsParsed":[["Tezerjani","Mohammad Dehghani",""],["Khoshnazar","Mohammad",""],["Tangestanizadeh","Mohammadhamed",""],["Yang","Qing",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 00:13:14 GMT"}],"updateDate":"2024-08-28","timestamp":1724631194000,"abstract":"  The emergence of mobile robotics, particularly in the automotive industry,\nintroduces a promising era of enriched user experiences and adept handling of\ncomplex navigation challenges. The realization of these advancements\nnecessitates a focused technological effort and the successful execution of\nnumerous intricate tasks, particularly in the critical domain of Simultaneous\nLocalization and Mapping (SLAM). Various artificial intelligence (AI)\nmethodologies, such as deep learning and reinforcement learning, present viable\nsolutions to address the challenges in SLAM. This study specifically explores\nthe application of reinforcement learning in the context of SLAM. By enabling\nthe agent (the robot) to iteratively interact with and receive feedback from\nits environment, reinforcement learning facilitates the acquisition of\nnavigation and mapping skills, thereby enhancing the robot's decision-making\ncapabilities. This approach offers several advantages, including improved\nnavigation proficiency, increased resilience, reduced dependence on sensor\nprecision, and refinement of the decision-making process. The findings of this\nstudy, which provide an overview of reinforcement learning's utilization in\nSLAM, reveal significant advancements in the field. The investigation also\nhighlights the evolution and innovative integration of these techniques.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"bL04D9edDek9FdvwrVAPOa50pc8W-LDwc_irP5kHOz0","pdfSize":"924858"}
