{"id":"2408.04916","title":"PTrajM: Efficient and Semantic-rich Trajectory Learning with Pretrained\n  Trajectory-Mamba","authors":"Yan Lin, Yichen Liu, Zeyu Zhou, Haomin Wen, Erwen Zheng, Shengnan Guo,\n  Youfang Lin, Huaiyu Wan","authorsParsed":[["Lin","Yan",""],["Liu","Yichen",""],["Zhou","Zeyu",""],["Wen","Haomin",""],["Zheng","Erwen",""],["Guo","Shengnan",""],["Lin","Youfang",""],["Wan","Huaiyu",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 07:48:51 GMT"}],"updateDate":"2024-08-12","timestamp":1723189731000,"abstract":"  Vehicle trajectories provide crucial movement information for various\nreal-world applications. To better utilize vehicle trajectories, it is\nessential to develop a trajectory learning approach that can effectively and\nefficiently extract rich semantic information, including movement behavior and\ntravel purposes, to support accurate downstream applications. However, creating\nsuch an approach presents two significant challenges. First, movement behavior\nare inherently spatio-temporally continuous, making them difficult to extract\nefficiently from irregular and discrete trajectory points. Second, travel\npurposes are related to the functionalities of areas and road segments\ntraversed by vehicles. These functionalities are not available from the raw\nspatio-temporal trajectory features and are hard to extract directly from\ncomplex textual features associated with these areas and road segments.\n  To address these challenges, we propose PTrajM, a novel method capable of\nefficient and semantic-rich vehicle trajectory learning. To support efficient\nmodeling of movement behavior, we introduce Trajectory-Mamba as the learnable\nmodel of PTrajM, which effectively extracts continuous movement behavior while\nbeing more computationally efficient than existing structures. To facilitate\nefficient extraction of travel purposes, we propose a travel purpose-aware\npre-training procedure, which enables PTrajM to discern the travel purposes of\ntrajectories without additional computational resources during its embedding\nprocess. Extensive experiments on two real-world datasets and comparisons with\nseveral state-of-the-art trajectory learning methods demonstrate the\neffectiveness of PTrajM. Code is available at\nhttps://anonymous.4open.science/r/PTrajM-C973.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}