{"id":"2408.01377","title":"Polaron formation in insulators and the key role of hole scattering\n  processes: Band insulators, charge density waves and Mott transition","authors":"Ivan Amelio, Giacomo Mazza, Nathan Goldman","authorsParsed":[["Amelio","Ivan",""],["Mazza","Giacomo",""],["Goldman","Nathan",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 16:36:11 GMT"}],"updateDate":"2024-08-05","timestamp":1722616571000,"abstract":"  A mobile impurity immersed in a non-interacting Fermi sea is dressed by the\ngapless particle-hole excitations of the fermionic medium. This conventional\nFermi-polaron setting is well described by the so-called ladder approximation,\nwhich consists in neglecting impurity-hole scattering processes. In this work,\nwe analyze polaron formation in the context of insulating states of matter,\nconsidering increasing levels of correlation in the medium:~band insulators\noriginating from external periodic potentials, spontaneously-formed charge\ndensity waves, and a Fermi-Hubbard system undergoing a metal-Mott insulator\ntransition. The polaron spectral function is shown to exhibit striking\nsignatures of the underlying fermionic background, such as the single-particle\nband gap, particle-hole symmetry and the transition to the Mott state. These\nsignatures are identified within the framework of the Chevy ansatz, i.e. upon\nrestricting the Hilbert space to single particle-hole excitations.\nInterestingly, we find that the ladder approximation is inaccurate in these\nband systems, due to the fact that the particle and hole scattering phase\nspaces are comparable. Our results provide a step forward in the understanding\nof polaron formation in correlated many-body media, which are relevant to both\ncold-atom and semiconductor experiments.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Quantum Gases","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xJFo2HNg0AUdyHfo2ktm0FH0Cf10z-VBOiA9ZFwjfrI","pdfSize":"956295","txDigest":"DDzwzZ6uAm5bZRM1aGDTw4tdPhzkUgXRoP3KqdcEP8J7","endEpoch":"1","status":"CERTIFIED"}
