{"id":"2408.09542","title":"Correlation of Magnetic State Configurations in Nanotubes with FMR\n  spectrum","authors":"Abhishek Kumar, Chirag Kalouni, Raghvendra Posti, Vivek K Malik,\n  Dhananjay Tiwari, and Debangsu Roy","authorsParsed":[["Kumar","Abhishek",""],["Kalouni","Chirag",""],["Posti","Raghvendra",""],["Malik","Vivek K",""],["Tiwari","Dhananjay",""],["Roy","Debangsu",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 16:55:46 GMT"}],"updateDate":"2024-08-20","timestamp":1724000146000,"abstract":"  Magnetic nanotubes have garnered immense attention for their potential in\nhigh-density magnetic memory, owing to their stable flux closure configuration\nand fast, reproducible reversal processes. However, characterizing their\nmagnetic configuration through straightforward methodologies remains a\nchallenge in both scope and detail. Here, we elucidate the magnetic state\ndetails using Remanence Field Ferromagnetic Resonance Spectroscopy (RFMR) for\narrays of electrodeposited nanotubes. Micromagnetic simulations revealed\ndistinct spin configurations while coming from saturation, including the edge\nvortex, onion, uniform and curling states, with chirality variations depending\non the preparation field direction. Dynamic measurements, coupled with RFMR\nspectra analysis, unveiled multiple FMR modes corresponding to these spin\nconfigurations. The evolution of spin configurations under bias fields were\nstudied, indicating nucleation within the curling state. Observations revealed\nopposite RFMR spectra, denoting opposite magnetic spin configurations after\nremoving the positive and negative saturating fields when the magnetic field\nwas applied along {theta_H=0} and perpendicular {theta_H= 90} to the nanotube\naxis. We observed a mixture of the non-uniform curling states with the end\nvortex state (onion-like curling state) at the end of the nanotubes for the\ntheta_H=0(90) and uniform magnetization states in the middle of the nanotubes\nfor the theta_H=0 configuration. Building on RFMR information, frequency-swept\nFMR absorption spectra obtained at different bias fields allowed the\ncharacterization of magnetization states. This picture was supported by\nmicromagnetic simulations. These findings were further substantiated with First\nOrder Reversal Curve measurements (FORC).\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}