{"id":"2408.14289","title":"Non-Iterative Disentangled Unitary Coupled-Cluster based on\n  Lie-algebraic structure","authors":"Mohammad Haidar, Olivier Adjoua, Siwar Baddredine, Alberto Peruzzo,\n  Jean-Philip Piquemal","authorsParsed":[["Haidar","Mohammad",""],["Adjoua","Olivier",""],["Baddredine","Siwar",""],["Peruzzo","Alberto",""],["Piquemal","Jean-Philip",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 14:19:53 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 15:18:32 GMT"}],"updateDate":"2024-09-06","timestamp":1724681993000,"abstract":"  Due to their non-iterative nature, fixed Unitary Coupled-Cluster (UCC)\nans\\\"atze are attractive for performing quantum chemistry Variational Quantum\nEigensolver (VQE) computations as they avoid pre-circuit measurements on a\nquantum computer. However, achieving chemical accuracy for strongly correlated\nsystems with UCC requires further inclusion of higher-order fermionic\nexcitations beyond triples increasing circuit depth. We introduce $k$-NI-DUCC,\na fixed and Non-iterative Disentangled Unitary Coupled-Cluster compact ansatz,\nbased on specific $\"k\"$ sets of \"qubit\" excitations, eliminating the needs for\nfermionic-type excitations. These elements scale linearly ($\\mathcal{O}(n)$) by\nleveraging Lie algebraic structures, with $n$ being the number of qubits. The\nkey excitations are screened through specific selection criteria, including the\nenforcement of all symmetries, to ensure the construction of a robust set of\ngenerators. NI-DUCC employs $\"k\"$ products of the exponential of\n$\\mathcal{O}(n)$- anti-Hermitian Pauli operators, where each operator has a\nlength $p$. This results in a fewer two-qubit CNOT gates circuit,\n$\\mathcal{O}(knp)$, suitable for hardware implementations. Tested on LiH, H$_6$\nand BeH$_2$, NI-DUCC-VQE achieves both chemical accuracy and rapid convergence\neven for molecules deviating significantly from equilibrium. It is\nhardware-efficient, reaching the exact Full Configuration Interaction energy\nsolution at specific layers, while reducing significantly the VQE optimization\nsteps. While NI-DUCC-VQE effectively addresses the gradient measurement\nbottleneck of ADAPT-VQE-like iterative algorithms, the classical computational\ncost of constructing the $\\mathcal{O}(n)$ set of excitations increases\nexponentially with the number of qubits. We provide a first implementation for\nconstructing the generators' set able to handle up to 20 qubits and discuss the\nefficiency perspectives.\n","subjects":["Physics/Quantum Physics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}