{"id":"2408.01944","title":"RobNODDI: Robust NODDI Parameter Estimation with Adaptive Sampling under\n  Continuous Representation","authors":"Taohui Xiao, Jian Cheng, Wenxin Fan, Jing Yang, Cheng Li, Enqing Dong,\n  and Shanshan Wang","authorsParsed":[["Xiao","Taohui",""],["Cheng","Jian",""],["Fan","Wenxin",""],["Yang","Jing",""],["Li","Cheng",""],["Dong","Enqing",""],["Wang","Shanshan",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 07:04:59 GMT"}],"updateDate":"2024-08-06","timestamp":1722755099000,"abstract":"  Neurite Orientation Dispersion and Density Imaging (NODDI) is an important\nimaging technology used to evaluate the microstructure of brain tissue, which\nis of great significance for the discovery and treatment of various\nneurological diseases. Current deep learning-based methods perform parameter\nestimation through diffusion magnetic resonance imaging (dMRI) with a small\nnumber of diffusion gradients. These methods speed up parameter estimation and\nimprove accuracy. However, the diffusion directions used by most existing deep\nlearning models during testing needs to be strictly consistent with the\ndiffusion directions during training. This results in poor generalization and\nrobustness of deep learning models in dMRI parameter estimation. In this work,\nwe verify for the first time that the parameter estimation performance of\ncurrent mainstream methods will significantly decrease when the testing\ndiffusion directions and the training diffusion directions are inconsistent. A\nrobust NODDI parameter estimation method with adaptive sampling under\ncontinuous representation (RobNODDI) is proposed. Furthermore, long short-term\nmemory (LSTM) units and fully connected layers are selected to learn continuous\nrepresentation signals. To this end, we use a total of 100 subjects to conduct\nexperiments based on the Human Connectome Project (HCP) dataset, of which 60\nare used for training, 20 are used for validation, and 20 are used for testing.\nThe test results indicate that RobNODDI improves the generalization performance\nand robustness of the deep learning model, enhancing the stability and\nflexibility of deep learning NODDI parameter estimatimation applications.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}