{"id":"2408.16794","title":"A quantum random access memory (QRAM) using a polynomial encoding of\n  binary strings","authors":"Priyanka Mukhopadhyay","authorsParsed":[["Mukhopadhyay","Priyanka",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:39:56 GMT"}],"updateDate":"2024-09-02","timestamp":1724870396000,"abstract":"  Quantum algorithms claim significant speedup over their classical\ncounterparts for solving many problems. An important aspect of many of these\nalgorithms is the existence of a quantum oracle, which needs to be implemented\nefficiently in order to realize the claimed advantages. A quantum random access\nmemory (QRAM) is a promising architecture for realizing these oracles. In this\npaper we develop a new design for QRAM and implement it with Clifford+T\ncircuit. We focus on optimizing the T-count and T-depth since non-Clifford\ngates are the most expensive to implement fault-tolerantly. Integral to our\ndesign is a polynomial encoding of bit strings and so we refer to this design\nas $\\text{QRAM}_{poly}$. Compared to the previous state-of-the-art bucket\nbrigade architecture for QRAM, we achieve an exponential improvement in\nT-depth, while reducing T-count and keeping the qubit count same. Specifically,\nif $N$ is the number of memory locations, then $\\text{QRAM}_{poly}$ has T-depth\n$O(\\log\\log N)$, T-count $O(N-\\log N)$ and qubit count $O(N)$, while the bucket\nbrigade circuit has T-depth $O(\\log N)$, T-count $O(N)$ and qubit count $O(N)$.\nCombining two $\\text{QRAM}_{poly}$ we design a quantum look-up-table,\n$\\text{qLUT}_{poly}$, that has T-depth $O(\\log\\log N)$, T-count $O(\\sqrt{N})$\nand qubit count $O(\\sqrt{N})$. A qLUT or quantum read-only memory (QROM) has\nrestricted functionality than a QRAM and needs to be compiled each time the\ncontents of the memory change. The previous state-of-the-art CSWAP architecture\nhas T-depth $O(\\sqrt{N})$, T-count $O(\\sqrt{N})$ and qubit count $O(\\sqrt{N})$.\nThus we achieve a double exponential improvement in T-depth while keeping the\nT-count and qubit-count asymptotically same. Additionally, with our polynomial\nencoding of bit strings, we develop a method to optimize the Toffoli-count of\ncircuits, specially those consisting of multi-controlled-NOT gates.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}