{"id":"2408.15946","title":"Sigma Flows for Image and Data Labeling and Learning Structured\n  Prediction","authors":"Jonas Cassel, Bastian Boll, Stefania Petra, Peter Albers, Christoph\n  Schn\\\"orr","authorsParsed":[["Cassel","Jonas",""],["Boll","Bastian",""],["Petra","Stefania",""],["Albers","Peter",""],["Schnörr","Christoph",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 17:04:56 GMT"}],"updateDate":"2024-08-29","timestamp":1724864696000,"abstract":"  This paper introduces the sigma flow model for the prediction of structured\nlabelings of data observed on Riemannian manifolds, including Euclidean image\ndomains as special case. The approach combines the Laplace-Beltrami framework\nfor image denoising and enhancement, introduced by Sochen, Kimmel and Malladi\nabout 25 years ago, and the assignment flow approach introduced and studied by\nthe authors.\n  The sigma flow arises as Riemannian gradient flow of generalized harmonic\nenergies and thus is governed by a nonlinear geometric PDE which determines a\nharmonic map from a closed Riemannian domain manifold to a statistical\nmanifold, equipped with the Fisher-Rao metric from information geometry. A\nspecific ingredient of the sigma flow is the mutual dependency of the\nRiemannian metric of the domain manifold on the evolving state. This makes the\napproach amenable to machine learning in a specific way, by realizing this\ndependency through a mapping with compact time-variant parametrization that can\nbe learned from data. Proof of concept experiments demonstrate the expressivity\nof the sigma flow model and prediction performance.\n  Structural similarities to transformer network architectures and networks\ngenerated by the geometric integration of sigma flows are pointed out, which\nhighlights the connection to deep learning and, conversely, may stimulate the\nuse of geometric design principles for structured prediction in other areas of\nscientific machine learning.\n","subjects":["Mathematics/Dynamical Systems","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GPgHb5z_K88FafMi0xMd7rZ2GSH8JKcDhztGhVx1HH8","pdfSize":"9880742"}
