{"id":"2408.04977","title":"Conceptual Design and Implementation of FIDO2 compatible Smart Card for\n  Decentralized Financial Transaction System","authors":"Anisha Ghosh, Aditya Mitra, Sibi Chakkaravarthy Sethuraman, Aswani\n  Kumar Cherukuri","authorsParsed":[["Ghosh","Anisha",""],["Mitra","Aditya",""],["Sethuraman","Sibi Chakkaravarthy",""],["Cherukuri","Aswani Kumar",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 10:08:10 GMT"}],"updateDate":"2024-08-12","timestamp":1723198090000,"abstract":"  With challenges and limitations associated with security in the fintech\nindustry, the rise to the need for data protection increases. However, the\ncurrent existing passwordless and password-based peer to peer transactions in\nonline banking systems are vulnerable to advanced forms of digital attacks. The\ninflux of modern data protection methods keeps better records of the\ntransactions, but it still does not address the issue of authentication and\naccount takeovers during transactions. To the address the mentioned issue, this\npaper proposes a novel and robust peer to peer transaction system which employs\nbest cloud security practices, proper use of cryptography and trusted computing\nto mitigate common vulnerabilities. We will be implementing FIDO2 compatible\nSmart Card to securely authenticate the user using physical smart cards and\nstore the records in the cloud which enables access control by allowing access\nonly when an access is requested. The standard incorporates multiple layers of\nsecurity on cloud computing models to ensure secrecy of the said data. Services\nof the standard adhere to regulations provides by the government and assures\nprivacy to the information of the payee or the end-user. The whole system has\nbeen implemented in the Internet of Things scenario.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"_9EgoDsbO8-zVhggxv8gVIDhfG-loN618ORNZEuSmq0","pdfSize":"414628"}
