{"id":"2408.08114","title":"Quantifying the informativity of emission lines to infer physical\n  conditions in giant molecular clouds. I. Application to model predictions","authors":"Lucas Einig, Pierre Palud, Antoine Roueff, J\\'er\\^ome Pety, Emeric\n  Bron, Franck Le Petit, Maryvonne Gerin, Jocelyn Chanussot, Pierre Chainais,\n  Pierre-Antoine Thouvenin, David Languignon, Ivana Be\\v{s}li\\'c, Simon\n  Coud\\'e, Helena Mazurek, Jan H. Orkisz, Miriam G. Santa-Maria, L\\'eontine\n  S\\'egal, Antoine Zakardjian, S\\'ebastien Bardeau, Karine Demyk, Victor de\n  Souza Magalh\\~es, Javier R. Goicoechea, Pierre Gratier, Viviana V. Guzm\\'an,\n  Annie Hughes, Fran\\c{c}ois Levrier, Jacques Le Bourlot, Dariusz C. Lis,\n  Harvey S. Liszt, Nicolas Peretto, Evelyne Roueff and Albrecht Sievers","authorsParsed":[["Einig","Lucas",""],["Palud","Pierre",""],["Roueff","Antoine",""],["Pety","Jérôme",""],["Bron","Emeric",""],["Petit","Franck Le",""],["Gerin","Maryvonne",""],["Chanussot","Jocelyn",""],["Chainais","Pierre",""],["Thouvenin","Pierre-Antoine",""],["Languignon","David",""],["Bešlić","Ivana",""],["Coudé","Simon",""],["Mazurek","Helena",""],["Orkisz","Jan H.",""],["Santa-Maria","Miriam G.",""],["Ségal","Léontine",""],["Zakardjian","Antoine",""],["Bardeau","Sébastien",""],["Demyk","Karine",""],["Magalhes","Victor de Souza",""],["Goicoechea","Javier R.",""],["Gratier","Pierre",""],["Guzmán","Viviana V.",""],["Hughes","Annie",""],["Levrier","François",""],["Bourlot","Jacques Le",""],["Lis","Dariusz C.",""],["Liszt","Harvey S.",""],["Peretto","Nicolas",""],["Roueff","Evelyne",""],["Sievers","Albrecht",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 12:23:53 GMT"}],"updateDate":"2024-08-16","timestamp":1723724633000,"abstract":"  Observations of ionic, atomic, or molecular lines are performed to improve\nour understanding of the interstellar medium (ISM). However, the potential of a\nline to constrain the physical conditions of the ISM is difficult to assess\nquantitatively, because of the complexity of the ISM physics. The situation is\neven more complex when trying to assess which combinations of lines are the\nmost useful. Therefore, observation campaigns usually try to observe as many\nlines as possible for as much time as possible. We search for a quantitative\nstatistical criterion to evaluate the constraining power of a (or combination\nof) tracer(s) with respect to physical conditions in order to improve our\nunderstanding of the statistical relationships between ISM tracers and physical\nconditions and helps observers to motivate their observation proposals. The\nbest tracers are obtained by comparing the mutual information between a\nphysical parameter and different sets of lines. We apply this method to\nsimulations of radio molecular lines emitted by a photodissociation region\nsimilar to the Horsehead Nebula that would be observed at the IRAM 30m\ntelescope. We search for the best lines to constrain the visual extinction\n$A_v^{tot}$ or the far UV illumination $G_0$. The most informative lines change\nwith the physical regime (e.g., cloud extinction). Short integration time of\nthe CO isotopologue $J=1-0$ lines already yields much information on the total\ncolumn density most regimes. The best set of lines to constrain the visual\nextinction does not necessarily combine the most informative individual lines.\nPrecise constraints on $G_0$ are more difficult to achieve with molecular\nlines. They require spectral lines emitted at the cloud surface (e.g., [CII]\nand [CI] lines). This approach allows one to better explore the knowledge\nprovided by ISM codes, and to guide future observation campaigns.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}