{"id":"2408.11706","title":"FRAP: Faithful and Realistic Text-to-Image Generation with Adaptive\n  Prompt Weighting","authors":"Liyao Jiang, Negar Hassanpour, Mohammad Salameh, Mohan Sai\n  Singamsetti, Fengyu Sun, Wei Lu, Di Niu","authorsParsed":[["Jiang","Liyao",""],["Hassanpour","Negar",""],["Salameh","Mohammad",""],["Singamsetti","Mohan Sai",""],["Sun","Fengyu",""],["Lu","Wei",""],["Niu","Di",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 15:30:35 GMT"}],"updateDate":"2024-08-22","timestamp":1724254235000,"abstract":"  Text-to-image (T2I) diffusion models have demonstrated impressive\ncapabilities in generating high-quality images given a text prompt. However,\nensuring the prompt-image alignment remains a considerable challenge, i.e.,\ngenerating images that faithfully align with the prompt's semantics. Recent\nworks attempt to improve the faithfulness by optimizing the latent code, which\npotentially could cause the latent code to go out-of-distribution and thus\nproduce unrealistic images. In this paper, we propose FRAP, a simple, yet\neffective approach based on adaptively adjusting the per-token prompt weights\nto improve prompt-image alignment and authenticity of the generated images. We\ndesign an online algorithm to adaptively update each token's weight\ncoefficient, which is achieved by minimizing a unified objective function that\nencourages object presence and the binding of object-modifier pairs. Through\nextensive evaluations, we show FRAP generates images with significantly higher\nprompt-image alignment to prompts from complex datasets, while having a lower\naverage latency compared to recent latent code optimization methods, e.g., 4\nseconds faster than D&B on the COCO-Subject dataset. Furthermore, through\nvisual comparisons and evaluation on the CLIP-IQA-Real metric, we show that\nFRAP not only improves prompt-image alignment but also generates more authentic\nimages with realistic appearances. We also explore combining FRAP with prompt\nrewriting LLM to recover their degraded prompt-image alignment, where we\nobserve improvements in both prompt-image alignment and image quality.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}