{"id":"2408.09211","title":"Unified Smooth Vector Graphics: Modeling Gradient Meshes and Curve-based\n  Approaches Jointly as Poisson Problem","authors":"Xingze Tian and Tobias G\\\"unther","authorsParsed":[["Tian","Xingze",""],["Günther","Tobias",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 14:39:57 GMT"}],"updateDate":"2024-08-20","timestamp":1723905597000,"abstract":"  Research on smooth vector graphics is separated into two independent research\nthreads: one on interpolation-based gradient meshes and the other on\ndiffusion-based curve formulations. With this paper, we propose a mathematical\nformulation that unifies gradient meshes and curve-based approaches as solution\nto a Poisson problem. To combine these two well-known representations, we first\ngenerate a non-overlapping intermediate patch representation that specifies for\neach patch a target Laplacian and boundary conditions. Unifying the treatment\nof boundary conditions adds further artistic degrees of freedoms to the\nexisting formulations, such as Neumann conditions on diffusion curves. To\nsynthesize a raster image for a given output resolution, we then rasterize\nboundary conditions and Laplacians for the respective patches and compute the\nfinal image as solution to a Poisson problem. We evaluate the method on various\ntest scenes containing gradient meshes and curve-based primitives. Since our\nmathematical formulation works with established smooth vector graphics\nprimitives on the front-end, it is compatible with existing content creation\npipelines and with established editing tools. Rather than continuing two\nseparate research paths, we hope that a unification of the formulations will\nlead to new rasterization and vectorization tools in the future that utilize\nthe strengths of both approaches.\n","subjects":["Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OfgjMgYmm4PXJn4H2uibYpDFeH--KHa4TtJYO50jNCE","pdfSize":"23018750"}
