{"id":"2408.10955","title":"Multichannel Attention Networks with Ensembled Transfer Learning to\n  Recognize Bangla Handwritten Charecter","authors":"Farhanul Haque, Md. Al-Hasan, Sumaiya Tabssum Mou, Abu Saleh Musa\n  Miah, Jungpil Shin, Md Abdur Rahim","authorsParsed":[["Haque","Farhanul",""],["Al-Hasan","Md.",""],["Mou","Sumaiya Tabssum",""],["Miah","Abu Saleh Musa",""],["Shin","Jungpil",""],["Rahim","Md Abdur",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 15:51:01 GMT"}],"updateDate":"2024-08-21","timestamp":1724169061000,"abstract":"  The Bengali language is the 5th most spoken native and 7th most spoken\nlanguage in the world, and Bengali handwritten character recognition has\nattracted researchers for decades. However, other languages such as English,\nArabic, Turkey, and Chinese character recognition have contributed\nsignificantly to developing handwriting recognition systems. Still, little\nresearch has been done on Bengali character recognition because of the\nsimilarity of the character, curvature and other complexities. However, many\nresearchers have used traditional machine learning and deep learning models to\nconduct Bengali hand-written recognition. The study employed a convolutional\nneural network (CNN) with ensemble transfer learning and a multichannel\nattention network. We generated the feature from the two branches of the CNN,\nincluding Inception Net and ResNet and then produced an ensemble feature fusion\nby concatenating them. After that, we applied the attention module to produce\nthe contextual information from the ensemble features. Finally, we applied a\nclassification module to refine the features and classification. We evaluated\nthe proposed model using the CAMTERdb 3.1.2 data set and achieved 92\\% accuracy\nfor the raw dataset and 98.00\\% for the preprocessed dataset. We believe that\nour contribution to the Bengali handwritten character recognition domain will\nbe considered a great development.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_eSdDc5VjvngYQP3-6y2-oX_49E43nN6ILfX4jtHntI","pdfSize":"756123"}
