{"id":"2408.17304","title":"A Passive and Self-Characterizing Cross-Encoded Receiver for\n  Reference-Frame-Independent Quantum Key Distribution","authors":"Massimo Giacomin, Francesco B. L. Santagiustina, Giuseppe Vallone,\n  Paolo Villoresi, Costantino Agnesi","authorsParsed":[["Giacomin","Massimo",""],["Santagiustina","Francesco B. L.",""],["Vallone","Giuseppe",""],["Villoresi","Paolo",""],["Agnesi","Costantino",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 14:00:27 GMT"}],"updateDate":"2024-09-02","timestamp":1725026427000,"abstract":"  Quantum Key Distribution (QKD) promises to revolutionize the field of\nsecurity in communication, with applications ranging from state secrets to\npersonal data, making it a key player in the ongoing battle against cyber\nthreats. Reference-Frame-Independent (RFI) QKD aims to simplify QKD\nimplementations by allowing to reduce the requirements of alignment on a shared\nreference frame. This is done by performing two mutually unbiased measurements\non the control states. In this work, we present a novel fully passive receiver\nfor time-bin encoded RFI-QKD. Conversion of time-bin to polarization is\nemployed to perform the required quantum measurement in a fully passive manner.\nFurthermore, to overcome experimental errors, we retrieved a complete\ndescription of our measurement apparatus by employing a recently introduced\nQuantum Detector Self-Characterization technique, without performing\ntomographic studies on the detection stage. In fact, the security analysis\ncarried out in this work uses experimentally retrieved Positive Operator Valued\nMeasurements, which consider our receiver defects, substituting the ideal\nexpected operators and thus increasing the overall level of secrecy. Lastly, we\nconducted a proof-of-principle experiment that validated the feasibility of our\nmethod and its applicability to QKD applications.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}