{"id":"2408.01063","title":"Leveraging Large Language Models for Mobile App Review Feature\n  Extraction","authors":"Quim Motger, Alessio Miaschi, Felice Dell'Orletta, Xavier Franch,\n  Jordi Marco","authorsParsed":[["Motger","Quim",""],["Miaschi","Alessio",""],["Dell'Orletta","Felice",""],["Franch","Xavier",""],["Marco","Jordi",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 07:31:57 GMT"}],"updateDate":"2024-08-05","timestamp":1722583917000,"abstract":"  Mobile app review analysis presents unique challenges due to the low quality,\nsubjective bias, and noisy content of user-generated documents. Extracting\nfeatures from these reviews is essential for tasks such as feature\nprioritization and sentiment analysis, but it remains a challenging task.\nMeanwhile, encoder-only models based on the Transformer architecture have shown\npromising results for classification and information extraction tasks for\nmultiple software engineering processes. This study explores the hypothesis\nthat encoder-only large language models can enhance feature extraction from\nmobile app reviews. By leveraging crowdsourced annotations from an industrial\ncontext, we redefine feature extraction as a supervised token classification\ntask. Our approach includes extending the pre-training of these models with a\nlarge corpus of user reviews to improve contextual understanding and employing\ninstance selection techniques to optimize model fine-tuning. Empirical\nevaluations demonstrate that this method improves the precision and recall of\nextracted features and enhances performance efficiency. Key contributions\ninclude a novel approach to feature extraction, annotated datasets, extended\npre-trained models, and an instance selection mechanism for cost-effective\nfine-tuning. This research provides practical methods and empirical evidence in\napplying large language models to natural language processing tasks within\nmobile app reviews, offering improved performance in feature extraction.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}