{"id":"2408.13118","title":"Liquid droplet morphology on the fiber of a fog harvester mesh and the\n  droplet detachment conditions under gravity","authors":"Arani Mukhopadhyay (1 and 2), Partha Sarathi Dutta (1 and 2), Amitava\n  Datta (1), Ranjan Ganguly (1) ((1) Department of Power Engineering - Jadavpur\n  University, (2) Department of Mechanical and Industrial Engineering -\n  University of Illinois Chicago)","authorsParsed":[["Mukhopadhyay","Arani","","1 and 2"],["Dutta","Partha Sarathi","","1 and 2"],["Datta","Amitava",""],["Ganguly","Ranjan",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 12:43:39 GMT"}],"updateDate":"2024-08-26","timestamp":1723725819000,"abstract":"  Liquid droplets on fiber are often observed both in nature and in different\nengineering applications, like a fog harvesting mesh. Knowledge about\ndrop-on-fiber morphology and its shedding under the influence of gravity can\nallow for the design of better separation technology. Mutual interaction of\nsurface tension forces arising out of the surface energies of the liquid and\nthe fiber solid, and the weight of the liquid droplet gives rise to different\nmorphologies of the droplet, which may occur in a stable or meta-stable\nconfiguration. Predicting the droplet shape on a fiber of specified dimension\nand surface wettability accurately for a given volume of liquid is challenging\nsince the curvature of both the droplet and the cylinder influence the\nphenomenon. We have numerically investigated the droplet shape and transition\ncriterion for various volumes at different contact angles under the effect of\nvarying Bond numbers using an open-source surface evolver code. It is observed\nthat depending upon the relative dimensions of the liquid droplet, the fiber\ndiameter, wettability, and gravity, the liquid exists on the fiber either in\n'barrel' or in 'clamshell' shape. A relation between shedding volume and the\nBond number is deduced, and the detachment volumes are calculated.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}