{"id":"2408.00501","title":"Quantum Program Testing Through Commuting Pauli Strings on IBM's Quantum\n  Computers","authors":"Asmar Muqeet, Shaukat Ali, Paolo Arcaini","authorsParsed":[["Muqeet","Asmar",""],["Ali","Shaukat",""],["Arcaini","Paolo",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 12:10:10 GMT"}],"updateDate":"2024-08-02","timestamp":1722514210000,"abstract":"  The most promising applications of quantum computing are centered around\nsolving search and optimization tasks, particularly in fields such as physics\nsimulations, quantum chemistry, and finance. However, the current quantum\nsoftware testing methods face practical limitations when applied in industrial\ncontexts: (i) they do not apply to quantum programs most relevant to the\nindustry, (ii) they require a full program specification, which is usually not\navailable for these programs, and (iii) they are incompatible with error\nmitigation methods currently adopted by main industry actors like IBM. To\naddress these challenges, we present QOPS, a novel quantum software testing\napproach. QOPS introduces a new definition of test cases based on Pauli strings\nto improve compatibility with different quantum programs. QOPS also introduces\na new test oracle that can be directly integrated with industrial APIs such as\nIBM's Estimator API and can utilize error mitigation methods for testing on\nreal noisy quantum computers. We also leverage the commuting property of Pauli\nstrings to relax the requirement of having complete program specifications,\nmaking QOPS practical for testing complex quantum programs in industrial\nsettings. We empirically evaluate QOPS on 194,982 real quantum programs,\ndemonstrating effective performance in test assessment compared to the\nstate-of-the-art with a perfect F1-score, precision, and recall. Furthermore,\nwe validate the industrial applicability of QOPS by assessing its performance\non IBM's three real quantum computers, incorporating both industrial and\nopen-source error mitigation methods.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}