{"id":"2408.07152","title":"FedMADE: Robust Federated Learning for Intrusion Detection in IoT\n  Networks Using a Dynamic Aggregation Method","authors":"Shihua Sun, Pragya Sharma, Kenechukwu Nwodo, Angelos Stavrou, Haining\n  Wang","authorsParsed":[["Sun","Shihua",""],["Sharma","Pragya",""],["Nwodo","Kenechukwu",""],["Stavrou","Angelos",""],["Wang","Haining",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 18:42:34 GMT"}],"updateDate":"2024-08-15","timestamp":1723574554000,"abstract":"  The rapid proliferation of Internet of Things (IoT) devices across multiple\nsectors has escalated serious network security concerns. This has prompted\nongoing research in Machine Learning (ML)-based Intrusion Detection Systems\n(IDSs) for cyber-attack classification. Traditional ML models require data\ntransmission from IoT devices to a centralized server for traffic analysis,\nraising severe privacy concerns. To address this issue, researchers have\nstudied Federated Learning (FL)-based IDSs that train models across IoT devices\nwhile keeping their data localized. However, the heterogeneity of data,\nstemming from distinct vulnerabilities of devices and complexity of attack\nvectors, poses a significant challenge to the effectiveness of FL models. While\ncurrent research focuses on adapting various ML models within the FL framework,\nthey fail to effectively address the issue of attack class imbalance among\ndevices, which significantly degrades the classification accuracy of minority\nattacks. To overcome this challenge, we introduce FedMADE, a novel dynamic\naggregation method, which clusters devices by their traffic patterns and\naggregates local models based on their contributions towards overall\nperformance. We evaluate FedMADE against other FL algorithms designed for\nnon-IID data and observe up to 71.07% improvement in minority attack\nclassification accuracy. We further show that FedMADE is robust to poisoning\nattacks and incurs only a 4.7% (5.03 seconds) latency overhead in each\ncommunication round compared to FedAvg, without increasing the computational\nload of IoT devices.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}