{"id":"2408.10364","title":"CMFGEN grids of atmosphere models for massive stars: OB-type stars at\n  the Magellanic Clouds","authors":"W. Marcolino, J.-C. Bouret, F. Martins, D. J. Hillier","authorsParsed":[["Marcolino","W.",""],["Bouret","J. -C.",""],["Martins","F.",""],["Hillier","D. J.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 19:08:16 GMT"}],"updateDate":"2024-08-21","timestamp":1724094496000,"abstract":"  Large spectroscopic surveys of individual massive stars, such as ULLYSES and\nXSHOOTU, provide observational data for hundreds of massive stars. Their\nanalysis requires large numbers of synthetic spectra so that stellar parameters\ncan be determined. In addition, libraries of massive stars' spectra are needed\nto produce population synthesis models able to reproduce the observed spectra\nof unresolved young stellar populations, such as those revealed by the James\nWebb Space Telescope (JWST) in the early Universe. Our main goal is to provide\nan extensive library of synthetic spectra and spectral energy distributions of\nOB stars at metallicities of the Magellanic Clouds. This library will offer a\nwealth of spectrophotometric information, making it readily applicable to a\nvariety of astrophysical problems. We used the CMFGEN code to calculate 606\nNLTE, line-blanketed, expanding atmosphere models using a comprehensive set of\natomic data. An overall metallicity of 1/2 Z$_\\odot$ and 1/5 Z$_\\odot$ was\nadopted for the Large Magellanic Cloud (LMC) and Small Magellanic Cloud (SMC),\nrespectively. We produced high-resolution spectra from 30 angstroms to 3 $\\mu$m\nfor stars on the Main Sequence and slightly beyond. We provide spectral energy\ndistributions, normalized synthetic spectra, ionizing fluxes, and photometry in\nvarious bands: Johnson UBV, Cousins RI, Bessel JHK, selected wide JWST filters,\nGaia, and LSST ugrizy filters. For each of these filters, we compute bolometric\ncorrections for all synthetic spectra and calibrations as a function of\neffective temperature. All of our synthetic spectra are publicly available\nthrough the POLLUX database, aiming to expedite multiwavelength analyses of\nmassive stars in low metallicity environments.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}