{"id":"2408.16328","title":"The curious case of 2MASS J15594729+4403595, an ultra-fast M2 dwarf with\n  possible Rieger cycles","authors":"S. Messina, G. Catanzaro, A. F. Lanza, D. Gandolfi, M.M. Serrano, H.J.\n  Deeg, D. Garcia-Alvarez","authorsParsed":[["Messina","S.",""],["Catanzaro","G.",""],["Lanza","A. F.",""],["Gandolfi","D.",""],["Serrano","M. M.",""],["Deeg","H. J.",""],["Garcia-Alvarez","D.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 08:06:14 GMT"}],"updateDate":"2024-08-30","timestamp":1724918774000,"abstract":"  RACE-OC (Rotation and ACtivity Evolution in Open Clusters) is a project aimed\nat characterising the rotational and magnetic activity properties of the\nlate-type members of open clusters, stellar associations, and moving groups of\ndifferent ages. As part of this project, in the present paper we present the\nresults of an investigation of a likely member of the AB Doradus association,\nthe M-type star 2MASS J15594729+4403595.} {In the present study, we aim to\nreveal the real nature of our target, which turned out to be a hierarchical\ntriple system, to derive the stellar rotation period and surface differential\nrotation, and to characterise its photospheric magnetic activity.} {We have\ncollected radial velocity and photometric time series, complemented with\narchive data, to determine the orbital parameters and the rotation period and\nwe have used the spot modelling technique to explore what causes its\nphotometric variability. \\rm } {We found 2MASS J15594729 +4403595 to be a\nhierarchical triple system consisting of a dwarf, SB1 M2, and a companion, M8.\nThe M2 star has a rotation period of P = 0.37\\,d, making it the fastest among\nM-type members of AB Dor. The most relevant result is the detection of a\nperiodic variation in the spotted area on opposite stellar hemispheres, which\nresembles a sort of Rossby wave or Rieger-like cycles on an extremely short\ntimescale. Another interesting result is the occurrence of a highly significant\nphotometric periodicity, P = 0.443\\,d, which may be related to the stellar\nrotation in terms of either a Rossby wave or surface differential rotation.}\n{2MASS J15594729+4403595 may be the prototype of a new class of extremely fast\nrotating stars exibiting short Rieger-like cycles. We shall further explore\nwhat may drive these short-duration cycles and we shall also search for similar\nstars to allow for a statistical analysis.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}