{"id":"2408.11692","title":"A JWST MIRI MRS View of the $\\eta$ Tel Debris Disk and its Brown Dwarf\n  Companion","authors":"Yiwei Chai, Christine H. Chen, Kadin Worthen, Alexis Li, Antranik\n  Sefilian, William Balmer, Dean C. Hines, David R. Law, B. A. Sargent, Mark\n  Wyatt, Cicero X. Lu, Marshall D. Perrin, Isabel Rebollido, Emily Rickman, and\n  G. C. Sloan","authorsParsed":[["Chai","Yiwei",""],["Chen","Christine H.",""],["Worthen","Kadin",""],["Li","Alexis",""],["Sefilian","Antranik",""],["Balmer","William",""],["Hines","Dean C.",""],["Law","David R.",""],["Sargent","B. A.",""],["Wyatt","Mark",""],["Lu","Cicero X.",""],["Perrin","Marshall D.",""],["Rebollido","Isabel",""],["Rickman","Emily",""],["Sloan","G. C.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 15:12:48 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 19:37:30 GMT"}],"updateDate":"2024-08-29","timestamp":1724253168000,"abstract":"  We report JWST MIRI MRS observations of the $\\beta$ Pictoris moving group\nmember, $\\eta$ Telescopii ($\\eta$ Tel) A and its brown dwarf binary companion,\n$\\eta$ Tel B. Following PSF subtraction, we recover the spatially resolved flux\nfrom the debris disk around $\\eta$ Tel A, along with the position of the\ncompanion exterior to the disk. We present a new 5-26 $\\mu$m epoch of\nspectroscopy for the disk, in which we discover a 20 $\\mu$m silicate feature.\nWe also present the first ever 11-21 $\\mu$m spectrum of $\\eta$ Tel B, which\nindicates a bare photosphere. We derive a new epoch of relative astrometry for\nthe companion, extending the baseline of measurements to 25 years, and find\nthat its current location is consistent with the apocentre of an eccentric,\nlong-period orbit. The companion's orbit is close enough to the disk that it\nshould significantly perturb the planetesimals within it, resulting in a\ndetectable mid-IR pericentre glow and near-alignment with the companion.\nContrary to expectations, however, we find that the disk appears to be\naxisymmetric and potentially misaligned with the companion in the MIRI MRS\ndata. We posit that this may be due to the presence of an additional,\nyet-undetected 0.7-30 $M_J$ planet orbiting interior to the disk with a\nsemi-major axis of 3-19 au.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1hLvMNzE0hebHSfgm38cYHZ8yaUUTelOviMyGpI0KBM","pdfSize":"15826176"}
