{"id":"2408.12639","title":"The JWST/NIRISS Deep Spectroscopic Survey for Young Brown Dwarfs and\n  Free-Floating Planets","authors":"Adam B. Langeveld, Aleks Scholz, Koraljka Mu\\v{z}i\\'c, Ray\n  Jayawardhana, Daniel Capela, Lo\\\"ic Albert, Ren\\'e Doyon, Laura Flagg,\n  Matthew de Furio, Doug Johnstone, David Lafr\\`eniere, Michael Meyer","authorsParsed":[["Langeveld","Adam B.",""],["Scholz","Aleks",""],["Mužić","Koraljka",""],["Jayawardhana","Ray",""],["Capela","Daniel",""],["Albert","Loïc",""],["Doyon","René",""],["Flagg","Laura",""],["de Furio","Matthew",""],["Johnstone","Doug",""],["Lafrèniere","David",""],["Meyer","Michael",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 18:00:00 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 21:25:02 GMT"}],"updateDate":"2024-08-29","timestamp":1724349600000,"abstract":"  The discovery and characterization of free-floating planetary-mass objects\n(FFPMOs) is fundamental to our understanding of star and planet formation. Here\nwe report results from an extremely deep spectroscopic survey of the young star\ncluster NGC1333 using NIRISS WFSS on the James Webb Space Telescope. The survey\nis photometrically complete to K~21, and includes useful spectra for objects as\nfaint as K~20.5. The observations cover 19 known brown dwarfs, for most of\nwhich we confirm spectral types using NIRISS spectra. We discover six new\ncandidates with L-dwarf spectral types that are plausible planetary-mass\nmembers of NGC1333, with estimated masses between 5-15 MJup. One, at ~5 MJup,\nshows clear infrared excess emission and is a good candidate to be the lowest\nmass object known to have a disk. We do not find any objects later than mid-L\nspectral type (M < ~4 MJup). The paucity of Jupiter-mass objects, despite the\nsurvey's unprecedented sensitivity, suggests that our observations reach the\nlowest mass objects formed like stars in NGC1333. Our findings put the fraction\nof FFPMOs in NGC1333 at ~10% of the number of cluster members, significantly\nmore than expected from the typical log-normal stellar mass function. We also\nsearch for wide binaries in our images and report a young brown dwarf with a\nplanetary-mass companion.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SkhRwCJYJ1HNq4SP3j1FQR-Ixh-WS-GqJEVq9u82nn8","pdfSize":"36367491"}
