{"id":"2408.10088","title":"Recent Surge in Public Interest in Transportation: Sentiment Analysis of\n  Baidu Apollo Go Using Weibo Data","authors":"Shiqi Wang, Zhouye Zhao, Yuhang Xie, Mingchuan Ma, Zirui Chen, Zeyu\n  Wang, Bohao Su, Wenrui Xu, Tianyi Li","authorsParsed":[["Wang","Shiqi",""],["Zhao","Zhouye",""],["Xie","Yuhang",""],["Ma","Mingchuan",""],["Chen","Zirui",""],["Wang","Zeyu",""],["Su","Bohao",""],["Xu","Wenrui",""],["Li","Tianyi",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 15:29:56 GMT"}],"updateDate":"2024-08-20","timestamp":1724081396000,"abstract":"  Urban mobility and transportation systems have been profoundly transformed by\nthe advancement of autonomous vehicle technologies. Baidu Apollo Go, a pioneer\nrobotaxi service from the Chinese tech giant Baidu, has recently been widely\ndeployed in major cities like Beijing and Wuhan, sparking increased\nconversation and offering a glimpse into the future of urban mobility.\n  This study investigates public attitudes towards Apollo Go across China using\nSentiment Analysis with a hybrid BERT model on 36,096 Weibo posts from January\nto July 2024. The analysis shows that 89.56\\% of posts related to Apollo Go are\nclustered in July. From January to July, public sentiment was mostly positive,\nbut negative comments began to rise after it became a hot topic on July 21.\n  Spatial analysis indicates a strong correlation between provinces with high\ndiscussion intensity and those where Apollo Go operates. Initially, Hubei and\nGuangdong dominated online posting volume, but by July, Guangdong, Beijing, and\ninternational regions had overtaken Hubei. Attitudes varied significantly among\nprovinces, with Xinjiang and Qinghai showing optimism and Tibet and Gansu\nexpressing concerns about the impact on traditional taxi services.\n  Sentiment analysis revealed that positive comments focused on technology\napplications and personal experiences, while negative comments centered on job\ndisplacement and safety concerns. In summary, this study highlights the\ndivergence in public perceptions of autonomous ride-hailing services, providing\nvaluable insights for planners, policymakers, and service providers. The model\nis published on Hugging Face at\nhttps://huggingface.co/wsqstar/bert-finetuned-weibo-luobokuaipao and the\nrepository on GitHub at https://github.com/GIStudio/trb2024.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}