{"id":"2408.11696","title":"M2CS: A Microwave Measurement and Control System for Large-scale\n  Superconducting Quantum Processors","authors":"Jiawei Zhang, Xuandong Sun, Zechen Guo, Yuefeng Yuan, Yubin Zhang, Ji\n  Chu, Wenhui Huang, Yongqi Liang, Jiawei Qiu, Daxiong Sun, Ziyu Tao, Jiajian\n  Zhang, Weijie Guo, Ji Jiang, Xiayu Linpeng, Yang Liu, Wenhui Ren, Jingjing\n  Niu, Youpeng Zhong, Dapeng Yu","authorsParsed":[["Zhang","Jiawei",""],["Sun","Xuandong",""],["Guo","Zechen",""],["Yuan","Yuefeng",""],["Zhang","Yubin",""],["Chu","Ji",""],["Huang","Wenhui",""],["Liang","Yongqi",""],["Qiu","Jiawei",""],["Sun","Daxiong",""],["Tao","Ziyu",""],["Zhang","Jiajian",""],["Guo","Weijie",""],["Jiang","Ji",""],["Linpeng","Xiayu",""],["Liu","Yang",""],["Ren","Wenhui",""],["Niu","Jingjing",""],["Zhong","Youpeng",""],["Yu","Dapeng",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 15:14:49 GMT"}],"updateDate":"2024-08-22","timestamp":1724253289000,"abstract":"  As superconducting quantum computing continues to advance at an unprecedented\npace, there is a compelling demand for the innovation of specialized electronic\ninstruments that act as crucial conduits between quantum processors and host\ncomputers. Here, we introduce a Microwave Measurement and Control System (M2CS)\ndedicated for large-scale superconducting quantum processors. M2CS features a\ncompact modular design that balances overall performance, scalability, and\nflexibility. Electronic tests of M2CS show key metrics comparable to commercial\ninstruments. Benchmark tests on transmon superconducting qubits further show\nqubit coherence and gate fidelities comparable to state-of-the-art results,\nconfirming M2CS's capability to meet the stringent requirements of quantum\nexperiments run on intermediate-scale quantum processors. The system's compact\nand scalable design offers significant room for further enhancements that could\naccommodate the measurement and control requirements of over 1000 qubits, and\ncan also be adopted to other quantum computing platforms such as trapped ions\nand silicon quantum dots. The M2CS architecture may also be applied to wider\nrange of scenarios, such as microwave kinetic inductance detectors, as well as\nphased array radar systems.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}