{"id":"2408.15434","title":"Weighted Matching in the Random-Order Streaming and Robust Communication\n  Models","authors":"Diba Hashemi and Weronika Wrzos-Kaminska","authorsParsed":[["Hashemi","Diba",""],["Wrzos-Kaminska","Weronika",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 22:34:17 GMT"}],"updateDate":"2024-08-29","timestamp":1724798057000,"abstract":"  We study the maximum weight matching problem in the random-order\nsemi-streaming model and in the robust communication model. Unlike many other\nsublinear models, in these two frameworks, there is a large gap between the\nguarantees of the best known algorithms for the unweighted and weighted\nversions of the problem.\n  In the random-order semi-streaming setting, the edges of an $n$-vertex graph\narrive in a stream in a random order. The goal is to compute an approximate\nmaximum weight matching with a single pass over the stream using $O(n\\text{\npolylog } n)$ space. Our main result is a $(2/3-\\epsilon)$-approximation\nalgorithm for maximum weight matching in random-order streams, using space $O(n\n\\log n \\log R)$, where $R$ is the ratio between the heaviest and the lightest\nedge in the graph. Our result nearly matches the best known unweighted\n$(2/3+\\epsilon_0)$-approximation (where $\\epsilon_0 \\sim 10^{-14}$ is a small\nconstant) achieved by Assadi and Behnezhad [ICALP 2021], and significantly\nimproves upon previous weighted results.\n  Our techniques also extend to the related robust communication model, in\nwhich the edges of a graph are partitioned randomly between Alice and Bob.\nAlice sends a single message of size $O(n\\text{ polylog }n)$ to Bob, who must\ncompute an approximate maximum weight matching. We achieve a\n$(5/6-\\epsilon)$-approximation using $O(n \\log n \\log R)$ words of\ncommunication, matching the results of Azarmehr and Behnezhad [ICALP 2023] for\nunweighted graphs.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}