{"id":"2408.16530","title":"A Comprehensive Review of 3D Object Detection in Autonomous Driving:\n  Technological Advances and Future Directions","authors":"Yu Wang, Shaohua Wang, Yicheng Li, Mingchun Liu","authorsParsed":[["Wang","Yu",""],["Wang","Shaohua",""],["Li","Yicheng",""],["Liu","Mingchun",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 01:08:33 GMT"}],"updateDate":"2024-08-30","timestamp":1724807313000,"abstract":"  In recent years, 3D object perception has become a crucial component in the\ndevelopment of autonomous driving systems, providing essential environmental\nawareness. However, as perception tasks in autonomous driving evolve, their\nvariants have increased, leading to diverse insights from industry and\nacademia. Currently, there is a lack of comprehensive surveys that collect and\nsummarize these perception tasks and their developments from a broader\nperspective. This review extensively summarizes traditional 3D object detection\nmethods, focusing on camera-based, LiDAR-based, and fusion detection\ntechniques. We provide a comprehensive analysis of the strengths and\nlimitations of each approach, highlighting advancements in accuracy and\nrobustness. Furthermore, we discuss future directions, including methods to\nimprove accuracy such as temporal perception, occupancy grids, and end-to-end\nlearning frameworks. We also explore cooperative perception methods that extend\nthe perception range through collaborative communication. By providing a\nholistic view of the current state and future developments in 3D object\nperception, we aim to offer a more comprehensive understanding of perception\ntasks for autonomous driving. Additionally, we have established an active\nrepository to provide continuous updates on the latest advancements in this\nfield, accessible at:\nhttps://github.com/Fishsoup0/Autonomous-Driving-Perception.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}