{"id":"2408.06246","title":"Stable-BC: Controlling Covariate Shift with Stable Behavior Cloning","authors":"Shaunak A. Mehta, Yusuf Umut Ciftci, Balamurugan Ramachandran, Somil\n  Bansal, Dylan P. Losey","authorsParsed":[["Mehta","Shaunak A.",""],["Ciftci","Yusuf Umut",""],["Ramachandran","Balamurugan",""],["Bansal","Somil",""],["Losey","Dylan P.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 15:56:53 GMT"}],"updateDate":"2024-08-13","timestamp":1723478213000,"abstract":"  Behavior cloning is a common imitation learning paradigm. Under behavior\ncloning the robot collects expert demonstrations, and then trains a policy to\nmatch the actions taken by the expert. This works well when the robot learner\nvisits states where the expert has already demonstrated the correct action; but\ninevitably the robot will also encounter new states outside of its training\ndataset. If the robot learner takes the wrong action at these new states it\ncould move farther from the training data, which in turn leads to increasingly\nincorrect actions and compounding errors. Existing works try to address this\nfundamental challenge by augmenting or enhancing the training data. By\ncontrast, in our paper we develop the control theoretic properties of behavior\ncloned policies. Specifically, we consider the error dynamics between the\nsystem's current state and the states in the expert dataset. From the error\ndynamics we derive model-based and model-free conditions for stability: under\nthese conditions the robot shapes its policy so that its current behavior\nconverges towards example behaviors in the expert dataset. In practice, this\nresults in Stable-BC, an easy to implement extension of standard behavior\ncloning that is provably robust to covariate shift. We demonstrate the\neffectiveness of our algorithm in simulations with interactive, nonlinear, and\nvisual environments. We also conduct experiments where a robot arm uses\nStable-BC to play air hockey. See our website here:\nhttps://collab.me.vt.edu/Stable-BC/\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"P8oTvfywtz8BsgNnDoh8cME9O87QpOGicTfturVJw28","pdfSize":"3356734"}
