{"id":"2408.09715","title":"HYDEN: Hyperbolic Density Representations for Medical Images and Reports","authors":"Zhi Qiao, Linbin Han, Xiantong Zhen, Jia-Hong Gao, Zhen Qian","authorsParsed":[["Qiao","Zhi",""],["Han","Linbin",""],["Zhen","Xiantong",""],["Gao","Jia-Hong",""],["Qian","Zhen",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 06:06:30 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 03:13:41 GMT"}],"updateDate":"2024-08-21","timestamp":1724047590000,"abstract":"  In light of the inherent entailment relations between images and text,\nhyperbolic point vector embeddings, leveraging the hierarchical modeling\nadvantages of hyperbolic space, have been utilized for visual semantic\nrepresentation learning. However, point vector embedding approaches fail to\naddress the issue of semantic uncertainty, where an image may have multiple\ninterpretations, and text may refer to different images, a phenomenon\nparticularly prevalent in the medical domain. Therefor, we propose\n\\textbf{HYDEN}, a novel hyperbolic density embedding based image-text\nrepresentation learning approach tailored for specific medical domain data.\nThis method integrates text-aware local features alongside global features from\nimages, mapping image-text features to density features in hyperbolic space via\nusing hyperbolic pseudo-Gaussian distributions. An encapsulation loss function\nis employed to model the partial order relations between image-text density\ndistributions. Experimental results demonstrate the interpretability of our\napproach and its superior performance compared to the baseline methods across\nvarious zero-shot tasks and different datasets.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}