{"id":"2408.02142","title":"The Lower Limit of Dynamical Black Hole Masses Detectable in Virgo\n  Compact Stellar Systems Using the JWST/NIRSpec IFU","authors":"Behzad Tahmasebzadeh, Andrew Lapeer, Eugene Vasiliev, Monica Valluri,\n  Matthew A. Taylor, Solveig Thompson","authorsParsed":[["Tahmasebzadeh","Behzad",""],["Lapeer","Andrew",""],["Vasiliev","Eugene",""],["Valluri","Monica",""],["Taylor","Matthew A.",""],["Thompson","Solveig",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 20:55:10 GMT"},{"version":"v2","created":"Tue, 10 Sep 2024 18:56:49 GMT"}],"updateDate":"2024-09-12","timestamp":1722804910000,"abstract":"  Due to observational challenges, the mass function of black holes (BH) at\nlower masses is poorly constrained in the local universe. Understanding the\noccupation fraction of BHs in low-mass galaxies is crucial for constraining the\norigins of supermassive BH seeds. Compact stellar systems (CSSs), including\nultra-compact dwarf galaxies (UCDs) and compact elliptical galaxies (cEs), are\npotential intermediate-mass BH hosts. Despite the difficulties posed by their\nlimited spheres of influence, stellar dynamical modeling has been effective in\nestimating central BH masses in CSSs. Some CSSs may harbor a BH constituting up\nto 20% of their host stellar mass, while others might not have a central BH. In\nsupport of our ongoing efforts to determine the BH masses in select CSSs in the\nVirgo cluster using JWST/NIRSpec IFU observations and orbit-superposition\ndynamical models, we create mock kinematic data mimicking the characteristics\nof observed cEs/UCDs in the Virgo cluster with different BH masses. We then\nconstruct a series of dynamical models using the orbit-superposition code\nFORSTAND and explore the accuracy of recovering the BH mass. We find that the\nmass of BHs comprising 1% or more of the total host stellar mass can be\naccurately determined through kinematic maps featuring higher-order velocity\nmoments. We also assess how BH mass measurement is affected by deprojection\nmethods, regularization factors, anisotropy parameters, orbit initial\nconditions, the absence of higher-order velocity moments, spatial resolution,\nand the signal-to-noise ratio.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}