{"id":"2408.09601","title":"Infinite Scrolling, Finite Satisfaction: Exploring User Behavior and\n  Satisfaction on Social Media in Bangladesh","authors":"Sanzana Karim Lora, Sadia Afrin Purba, Bushra Hossain, Tanjina Oriana,\n  Ashek Seum","authorsParsed":[["Lora","Sanzana Karim",""],["Purba","Sadia Afrin",""],["Hossain","Bushra",""],["Oriana","Tanjina",""],["Seum","Ashek",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 21:58:32 GMT"}],"updateDate":"2024-08-20","timestamp":1724018312000,"abstract":"  Social media platforms continue to change our digital relationships nowadays.\nTherefore, recognizing the complex consequences of infinite scrolling is\nessential. This paper explores two distinct angles of social media engagement:\nmindless scrolling and mindful scrolling. This extensive study dives into\nnumerous aspects of social media user behavior and satisfaction via the\nperspective of multiple surveys. We investigate the psychological exploit of\ninfinite scrolling design to keep users engaged, illuminating its effect on\nusers' emotional well-being. Furthermore, we explore its diverse effects on\nvarious groups, such as teenagers, professional people, and pregnant women, to\nbetter understand how digital activity differs throughout life phases.\nFurthermore, our study reveals the psychological consequences of being exposed\nto unfavorable news material. In the context of nutritional objectives, we\nexamine the problems users confront as well as the significance of scrolling in\ndietary achievement. By taking into account the demographic effect, we can\ndetermine how factors like age, gender, and socioeconomic position affect user\nbehavior. This study presents a comprehensive knowledge of the complicated\nconnection of infinite scrolling with user satisfaction and psychological\nwell-being through a variety of surveys, opening the door for well-informed\nconversations on online engagement.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}