{"id":"2408.08095","title":"Evaluating Time-Dependent Methods and Seasonal Effects in Code Technical\n  Debt Prediction","authors":"Mikel Robredo and Nyyti Saarimaki and Davide Taibi and Rafael Penaloza\n  and Valentina Lenarduzzi","authorsParsed":[["Robredo","Mikel",""],["Saarimaki","Nyyti",""],["Taibi","Davide",""],["Penaloza","Rafael",""],["Lenarduzzi","Valentina",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 11:39:58 GMT"}],"updateDate":"2024-08-16","timestamp":1723721998000,"abstract":"  Code Technical Debt prediction has become a popular research niche in recent\nsoftware engineering literature. Technical Debt is an important metric in\nsoftware projects as it measures professionals' effort to clean the code.\nTherefore, predicting its future behavior becomes a crucial task. However, no\nwell-defined and consistent approach can completely capture the features that\nimpact the evolution of Code Technical Debt. The goal of this study is to\nevaluate the impact of considering time-dependent techniques as well as\nseasonal effects in temporal data in the prediction performance within the\ncontext of Code Technical Debt. The study adopts existing, yet not extensively\nadopted, time-dependent prediction techniques and compares their prediction\nperformance to commonly used Machine Learning models. Further, the study\nstrengthens the evaluation of time-dependent methods by extending the analysis\nto capture the impact of seasonality in Code Technical Debt data. We trained 11\nprediction models using the commit history of 31 open-source projects developed\nwith Java. We predicted the future observations of the SQALE index to evaluate\ntheir predictive performance. Our study confirms the positive impact of\nconsidering time-dependent techniques. The adopted multivariate time series\nanalysis model ARIMAX overcame the rest of the adopted models. Incorporating\nseasonal effects led to an enhancement in the predictive performance of the\nadopted time-dependent techniques. However, the impact of this effect was found\nto be relatively modest. The findings of this study corroborate our position in\nfavor of implementing techniques that capture the existing time dependence\nwithin historical data of software metrics, specifically in the context of this\nstudy, namely, Code Technical Debt. This necessitates the utilization of\ntechniques that can effectively address this evidence.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jzaCswjGe0jSYMCcRyaA6HMzkXP5EeyGhEMHp1blro8","pdfSize":"698514"}
