{"id":"2408.16637","title":"Rocking the BOAT: the ups and downs of the long-term radio light curve\n  for GRB 221009A","authors":"L. Rhodes, A. J. van der Horst, J. S. Bright, J. K. Leung, G. E.\n  Anderson, R. Fender, J. F. Ag\\\"u\\'i Fernandez, M. Bremer, P. Chandra, D.\n  Dobie, W. Farah, S. Giarratana, K. Gourdji, D. A. Green, E. Lenc, M. J.\n  Micha{\\l}owski, T. Murphy, A. J. Nayana, A. W. Pollak, A. Rowlinson, F.\n  Schussler, A. Siemion, R. L. C. Starling, P. Scott, C. C. Th\\\"one, D.\n  Titterington, A. de Ugarte Postigo","authorsParsed":[["Rhodes","L.",""],["van der Horst","A. J.",""],["Bright","J. S.",""],["Leung","J. K.",""],["Anderson","G. E.",""],["Fender","R.",""],["Fernandez","J. F. Agüí",""],["Bremer","M.",""],["Chandra","P.",""],["Dobie","D.",""],["Farah","W.",""],["Giarratana","S.",""],["Gourdji","K.",""],["Green","D. A.",""],["Lenc","E.",""],["Michałowski","M. J.",""],["Murphy","T.",""],["Nayana","A. J.",""],["Pollak","A. W.",""],["Rowlinson","A.",""],["Schussler","F.",""],["Siemion","A.",""],["Starling","R. L. C.",""],["Scott","P.",""],["Thöne","C. C.",""],["Titterington","D.",""],["Postigo","A. de Ugarte",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 15:41:43 GMT"}],"updateDate":"2024-08-30","timestamp":1724946103000,"abstract":"  We present radio observations of the long-duration gamma-ray burst (GRB)\n221009A which has become known to the community as the Brightest Of All Time or\nthe BOAT. Our observations span the first 475 days post-burst and three orders\nof magnitude in observing frequency, from 0.15 to 230GHz. By combining our new\nobservations with those available in the literature, we have the most detailed\nradio data set in terms of cadence and spectral coverage of any GRB to date,\nwhich we use to explore the spectral and temporal evolution of the afterglow.\nBy testing a series of phenomenological models, we find that three separate\nsynchrotron components best explain the afterglow. The high temporal and\nspectral resolution allows us to conclude that standard analytical afterglow\nmodels are unable to explain the observed evolution of GRB 221009A. We explore\nwhere the discrepancies between the observations and the models are most\nsignificant and place our findings in the context of the most well-studied GRB\nradio afterglows to date. Our observations are best explained by three\nsynchrotron emitting regions which we interpret as a forward shock, a reverse\nshock and an additional shock potentially from a cocoon or wider outflow.\nFinally, we find that our observations do not show any evidence of any\nlate-time spectral or temporal changes that could result from a jet break but\nnote that any lateral structure could significantly affect a jet break\nsignature.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}