{"id":"2408.04661","title":"MaterioMiner -- An ontology-based text mining dataset for extraction of\n  process-structure-property entities","authors":"Ali Riza Durmaz, Akhil Thomas, Lokesh Mishra, Rachana Niranjan Murthy,\n  Thomas Straub","authorsParsed":[["Durmaz","Ali Riza",""],["Thomas","Akhil",""],["Mishra","Lokesh",""],["Murthy","Rachana Niranjan",""],["Straub","Thomas",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 21:42:59 GMT"}],"updateDate":"2024-08-12","timestamp":1722894179000,"abstract":"  While large language models learn sound statistical representations of the\nlanguage and information therein, ontologies are symbolic knowledge\nrepresentations that can complement the former ideally. Research at this\ncritical intersection relies on datasets that intertwine ontologies and text\ncorpora to enable training and comprehensive benchmarking of neurosymbolic\nmodels. We present the MaterioMiner dataset and the linked materials mechanics\nontology where ontological concepts from the mechanics of materials domain are\nassociated with textual entities within the literature corpus. Another\ndistinctive feature of the dataset is its eminently fine-granular annotation.\nSpecifically, 179 distinct classes are manually annotated by three raters\nwithin four publications, amounting to a total of 2191 entities that were\nannotated and curated. Conceptual work is presented for the symbolic\nrepresentation of causal composition-process-microstructure-property\nrelationships. We explore the annotation consistency between the three raters\nand perform fine-tuning of pre-trained models to showcase the feasibility of\nnamed-entity recognition model training. Reusing the dataset can foster\ntraining and benchmarking of materials language models, automated ontology\nconstruction, and knowledge graph generation from textual data.\n","subjects":["Computing Research Repository/Computation and Language","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}