{"id":"2408.09489","title":"REFINE-LM: Mitigating Language Model Stereotypes via Reinforcement\n  Learning","authors":"Rameez Qureshi, Na\\\"im Es-Sebbani, Luis Gal\\'arraga, Yvette Graham,\n  Miguel Couceiro and Zied Bouraoui","authorsParsed":[["Qureshi","Rameez",""],["Es-Sebbani","Naïm",""],["Galárraga","Luis",""],["Graham","Yvette",""],["Couceiro","Miguel",""],["Bouraoui","Zied",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 14:08:31 GMT"}],"updateDate":"2024-08-20","timestamp":1723990111000,"abstract":"  With the introduction of (large) language models, there has been significant\nconcern about the unintended bias such models may inherit from their training\ndata. A number of studies have shown that such models propagate gender\nstereotypes, as well as geographical and racial bias, among other biases. While\nexisting works tackle this issue by preprocessing data and debiasing\nembeddings, the proposed methods require a lot of computational resources and\nannotation effort while being limited to certain types of biases. To address\nthese issues, we introduce REFINE-LM, a debiasing method that uses\nreinforcement learning to handle different types of biases without any\nfine-tuning. By training a simple model on top of the word probability\ndistribution of a LM, our bias agnostic reinforcement learning method enables\nmodel debiasing without human annotations or significant computational\nresources. Experiments conducted on a wide range of models, including several\nLMs, show that our method (i) significantly reduces stereotypical biases while\npreserving LMs performance; (ii) is applicable to different types of biases,\ngeneralizing across contexts such as gender, ethnicity, religion, and\nnationality-based biases; and (iii) it is not expensive to train.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ifpszI9XPNDIddf7N7P3NrGN4XIrq4UaYHdHl1PQB6Y","pdfSize":"1639540"}
