{"id":"2408.01991","title":"User Experience of Visualizations in Motion: A Case Study and Design\n  Considerations","authors":"Lijie Yao, Federica Bucchieri, Victoria McArthur, Anastasia\n  Bezerianos, Petra Isenberg","authorsParsed":[["Yao","Lijie",""],["Bucchieri","Federica",""],["McArthur","Victoria",""],["Bezerianos","Anastasia",""],["Isenberg","Petra",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 11:10:48 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 09:14:54 GMT"},{"version":"v3","created":"Fri, 13 Sep 2024 10:13:47 GMT"}],"updateDate":"2024-09-16","timestamp":1722769848000,"abstract":"  We present a systematic review, an empirical study, and a first set of\nconsiderations for designing visualizations in motion, derived from a concrete\nscenario in which these visualizations were used to support a primary task. In\npractice, when viewers are confronted with embedded visualizations, they often\nhave to focus on a primary task and can only quickly glance at a visualization\nshowing rich, often dynamically updated, information. As such, the\nvisualizations must be designed so as not to distract from the primary task,\nwhile at the same time being readable and useful for aiding the primary task.\nFor example, in games, players who are engaged in a battle have to look at\ntheir enemies but also read the remaining health of their own game character\nfrom the health bar over their character's head. Many trade-offs are possible\nin the design of embedded visualizations in such dynamic scenarios, which we\nexplore in-depth in this paper with a focus on user experience. We use video\ngames as an example of an application context with a rich existing set of\nvisualizations in motion. We begin our work with a systematic review of in-game\nvisualizations in motion. Next, we conduct an empirical user study to\ninvestigate how different embedded visualizations in motion designs impact user\nexperience. We conclude with a set of considerations and trade-offs for\ndesigning visualizations in motion more broadly as derived from what we learned\nabout video games. All supplemental materials of this paper are available at\nhttps://osf.io/3v8wm/}.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}