{"id":"2408.06686","title":"Global Bases for Nonplanar Loop Integrands, Generalized Unitarity, and\n  the Double Copy to All Loop Orders","authors":"Zvi Bern, Enrico Herrmann, Radu Roiban, Michael S. Ruf and Mao Zeng","authorsParsed":[["Bern","Zvi",""],["Herrmann","Enrico",""],["Roiban","Radu",""],["Ruf","Michael S.",""],["Zeng","Mao",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 07:26:56 GMT"}],"updateDate":"2024-08-14","timestamp":1723534016000,"abstract":"  We introduce a constructive method for defining a global loop-integrand basis\nfor scattering amplitudes, encompassing both planar and nonplanar\ncontributions. Our approach utilizes a graph-based framework to establish a\nwell-defined, non-redundant basis of integrands. This basis, constructed from a\nchosen set of non-redundant graphs together with a selection of irreducible\nscalar products, provides clear insights into various physical properties of\nscattering amplitudes and proves useful in multiple contexts, such as on-shell\nWard identities and manifesting gauge-choice independence. A key advantage of\nour integrand basis is its ability to streamline the generalized unitarity\nmethod. Specifically, we can directly read off the coefficients of basis\nelements without resorting to ansatze or solving linear equations. This novel\napproach allows us to lift generalized unitarity cuts -- expressed as products\nof tree amplitudes -- to loop-level integrands, facilitating the use of the\ntree-level double copy to generate complete gravitational integrands at any\nloop order. This method circumvents the difficulties in identifying complete\nhigher-loop-order gauge-theory integrands that adhere to the color-kinematics\nduality. Additionally, our cut-based organization is well-suited for expansion\nin hard or soft limits, aiding in the exploration of ultraviolet or classical\nlimits of scattering amplitudes.\n","subjects":["Physics/High Energy Physics - Theory","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/"}