{"id":"2408.10322","title":"Theoretical Foundation of Black Hole Image Reconstruction using PRIMO","authors":"Dimitrios Psaltis, Feryal Ozel, Lia Medeiros, Tod R. Lauer","authorsParsed":[["Psaltis","Dimitrios",""],["Ozel","Feryal",""],["Medeiros","Lia",""],["Lauer","Tod R.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:00:06 GMT"}],"updateDate":"2024-08-21","timestamp":1724090406000,"abstract":"  A new image-reconstruction algorithm, PRIMO, applied to the interferometric\ndata of the M87 black hole collected with the Event Horizon Telescope (EHT),\nresulted in an image that reached the native resolution of the telescope array.\nPRIMO is based on learning a compact set of image building blocks obtained from\na large library of high-fidelity, physics-based simulations of black hole\nimages. It uses these building blocks to fill the sparse Fourier coverage of\nthe data that results from the small number of telescopes in the array. In this\npaper, we show that this approach is readily justified. Since the angular\nextent of the image of the black hole and of its inner accretion flow is\nfinite, the Fourier space domain is heavily smoothed, with a correlation scale\nthat is at most comparable to the sizes of the data gaps in the coverage of\nFourier space with the EHT. Consequently, PRIMO or other machine-learning\nalgorithms can faithfully reconstruct the images without the need to generate\ninformation that is unconstrained by the data within the resolution of the\narray. We also address the completeness of the eigenimages and the compactness\nof the resulting representation. We show that PRIMO provides a compact set of\neigenimages that have sufficient complexity to recreate a broad set of images\nwell beyond those in the training set.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}