{"id":"2408.14593","title":"How to build trust in answers given by Generative AI for specific, and\n  vague, financial questions","authors":"Alex Zarifis, Xusen Cheng","authorsParsed":[["Zarifis","Alex",""],["Cheng","Xusen",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 19:26:48 GMT"}],"updateDate":"2024-08-28","timestamp":1724700408000,"abstract":"  Purpose: Generative artificial intelligence (GenAI) has progressed in its\nability and has seen explosive growth in adoption. However, the consumer's\nperspective on its use, particularly in specific scenarios such as financial\nadvice, is unclear. This research develops a model of how to build trust in the\nadvice given by GenAI when answering financial questions.\nDesign/methodology/approach: The model is tested with survey data using\nstructural equation modelling (SEM) and multi-group analysis (MGA). The MGA\ncompares two scenarios, one where the consumer makes a specific question and\none where a vague question is made. Findings: This research identifies that\nbuilding trust for consumers is different when they ask a specific financial\nquestion in comparison to a vague one. Humanness has a different effect in the\ntwo scenarios. When a financial question is specific, human-like interaction\ndoes not strengthen trust, while (1) when a question is vague, humanness builds\ntrust. The four ways to build trust in both scenarios are (2) human oversight\nand being in the loop, (3) transparency and control, (4) accuracy and\nusefulness and finally (5) ease of use and support. Originality/value: This\nresearch contributes to a better understanding of the consumer's perspective\nwhen using GenAI for financial questions and highlights the importance of\nunderstanding GenAI in specific contexts from specific stakeholders.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XxGIjTsB0X8GVT2AqvrxW9RrtOa6Gz6A4ZAHhen9jx0","pdfSize":"309192"}
