{"id":"2408.01966","title":"ML-EAT: A Multilevel Embedding Association Test for Interpretable and\n  Transparent Social Science","authors":"Robert Wolfe, Alexis Hiniker, Bill Howe","authorsParsed":[["Wolfe","Robert",""],["Hiniker","Alexis",""],["Howe","Bill",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 09:04:44 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 20:05:59 GMT"}],"updateDate":"2024-08-29","timestamp":1722762284000,"abstract":"  This research introduces the Multilevel Embedding Association Test (ML-EAT),\na method designed for interpretable and transparent measurement of intrinsic\nbias in language technologies. The ML-EAT addresses issues of ambiguity and\ndifficulty in interpreting the traditional EAT measurement by quantifying bias\nat three levels of increasing granularity: the differential association between\ntwo target concepts with two attribute concepts; the individual effect size of\neach target concept with two attribute concepts; and the association between\neach individual target concept and each individual attribute concept. Using the\nML-EAT, this research defines a taxonomy of EAT patterns describing the nine\npossible outcomes of an embedding association test, each of which is associated\nwith a unique EAT-Map, a novel four-quadrant visualization for interpreting the\nML-EAT. Empirical analysis of static and diachronic word embeddings, GPT-2\nlanguage models, and a CLIP language-and-image model shows that EAT patterns\nadd otherwise unobservable information about the component biases that make up\nan EAT; reveal the effects of prompting in zero-shot models; and can also\nidentify situations when cosine similarity is an ineffective metric, rendering\nan EAT unreliable. Our work contributes a method for rendering bias more\nobservable and interpretable, improving the transparency of computational\ninvestigations into human minds and societies.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"l8u_vJAyQ9nutfVodeyeW-o949mDpVaEDiubRQyL7dA","pdfSize":"705109"}
