{"id":"2408.06262","title":"DUNE: A Machine Learning Deep UNet++ based Ensemble Approach to Monthly,\n  Seasonal and Annual Climate Forecasting","authors":"Pratik Shukla and Milton Halem","authorsParsed":[["Shukla","Pratik",""],["Halem","Milton",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 16:22:30 GMT"}],"updateDate":"2024-08-13","timestamp":1723479750000,"abstract":"  Capitalizing on the recent availability of ERA5 monthly averaged long-term\ndata records of mean atmospheric and climate fields based on high-resolution\nreanalysis, deep-learning architectures offer an alternative to physics-based\ndaily numerical weather predictions for subseasonal to seasonal (S2S) and\nannual means. A novel Deep UNet++-based Ensemble (DUNE) neural architecture is\nintroduced, employing multi-encoder-decoder structures with residual blocks.\nWhen initialized from a prior month or year, this architecture produced the\nfirst AI-based global monthly, seasonal, or annual mean forecast of 2-meter\ntemperatures (T2m) and sea surface temperatures (SST). ERA5 monthly mean data\nis used as input for T2m over land, SST over oceans, and solar radiation at the\ntop of the atmosphere for each month of 40 years to train the model. Validation\nforecasts are performed for an additional two years, followed by five years of\nforecast evaluations to account for natural annual variability. AI-trained\ninference forecast weights generate forecasts in seconds, enabling ensemble\nseasonal forecasts. Root Mean Squared Error (RMSE), Anomaly Correlation\nCoefficient (ACC), and Heidke Skill Score (HSS) statistics are presented\nglobally and over specific regions. These forecasts outperform persistence,\nclimatology, and multiple linear regression for all domains. DUNE forecasts\ndemonstrate comparable statistical accuracy to NOAA's operational monthly and\nseasonal probabilistic outlook forecasts over the US but at significantly\nhigher resolutions. RMSE and ACC error statistics for other recent AI-based\ndaily forecasts also show superior performance for DUNE-based forecasts. The\nDUNE model's application to an ensemble data assimilation cycle shows\ncomparable forecast accuracy with a single high-resolution model, potentially\neliminating the need for retraining on extrapolated datasets.\n","subjects":["Computing Research Repository/Machine Learning","Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wrxdFcUenPBkXqXEzu7xDhkg35gF5nsoD8ffLrx3nV4","pdfSize":"6254177"}
