{"id":"2408.00125","title":"Shocking and Mass Loss of Compact Donor Stars in Type Ia Supernovae","authors":"Tin Long Sunny Wong, Christopher White, Lars Bildsten","authorsParsed":[["Wong","Tin Long Sunny",""],["White","Christopher",""],["Bildsten","Lars",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 19:28:08 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 23:21:57 GMT"}],"updateDate":"2024-09-02","timestamp":1722454088000,"abstract":"  Type Ia supernovae arise from thermonuclear explosions of white dwarfs\naccreting from a binary companion. Following the explosion, the surviving donor\nstar leaves at roughly its orbital velocity. The discovery of the runaway\nhelium subdwarf star US 708, and seven hypervelocity stars from Gaia data, all\nwith spatial velocities $\\gtrsim 900$ km/s, strongly support a scenario in\nwhich the donor is a low-mass helium star, or a white dwarf. Motivated by these\ndiscoveries, we perform three-dimensional hydrodynamical simulations with the\n$\\texttt{Athena++}$ code modeling the hydrodynamical interaction between a\nhelium star or helium white dwarf, and the supernova ejecta. We find that\n$\\approx 0.01-0.02\\,M_{\\odot}$ of donor material is stripped, and explain the\nlocation of the stripped material within the expanding supernova ejecta. We\ncontinue the post-explosion evolution of the shocked donor stars with the\n$\\texttt{MESA}$ code. As a result of entropy deposition, they remain luminous\nand expanded for $\\approx 10^{5}-10^{6}$ yrs. We show that the post-explosion\nproperties of our helium white dwarf donor agree reasonably with one of the\nbest-studied hypervelocity stars, D6-2.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-QKPiGRCL3w_iyfWCrvNSEwrfZT4882lC0KkfK6eTO8","pdfSize":"3179524","txDigest":"GzFRrYfgqYFGyZ9ngAj54AVNndJgZPCoZos6JJVZXWcn","endEpoch":"100","status":"CERTIFIED"}
