{"id":"2408.01920","title":"Image Clustering Algorithm Based on Self-Supervised Pretrained Models\n  and Latent Feature Distribution Optimization","authors":"Qiuyu Zhu and Liheng Hu and Sijin Wang","authorsParsed":[["Zhu","Qiuyu",""],["Hu","Liheng",""],["Wang","Sijin",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 04:08:21 GMT"},{"version":"v2","created":"Sat, 10 Aug 2024 06:14:36 GMT"}],"updateDate":"2024-08-13","timestamp":1722744501000,"abstract":"  In the face of complex natural images, existing deep clustering algorithms\nfall significantly short in terms of clustering accuracy when compared to\nsupervised classification methods, making them less practical. This paper\nintroduces an image clustering algorithm based on self-supervised pretrained\nmodels and latent feature distribution optimization, substantially enhancing\nclustering performance. It is found that: (1) For complex natural images, we\neffectively enhance the discriminative power of latent features by leveraging\nself-supervised pretrained models and their fine-tuning, resulting in improved\nclustering performance. (2) In the latent feature space, by searching for\nk-nearest neighbor images for each training sample and shortening the distance\nbetween the training sample and its nearest neighbor, the discriminative power\nof latent features can be further enhanced, and clustering performance can be\nimproved. (3) In the latent feature space, reducing the distance between sample\nfeatures and the nearest predefined cluster centroids can optimize the\ndistribution of latent features, therefore further improving clustering\nperformance. Through experiments on multiple datasets, our approach outperforms\nthe latest clustering algorithms and achieves state-of-the-art clustering\nresults. When the number of categories in the datasets is small, such as\nCIFAR-10 and STL-10, and there are significant differences between categories,\nour clustering algorithm has similar accuracy to supervised methods without\nusing pretrained models, slightly lower than supervised methods using\npre-trained models. The code linked algorithm is\nhttps://github.com/LihengHu/semi.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3fV23aiL8heHcBl59_VrRKLBxUD_3vEYoV-ZuhFltUw","pdfSize":"724245"}
