{"id":"2408.12541","title":"Clarifying the Role of the Mantel-Haenszel Risk Difference Estimator in\n  Randomized Clinical Trials","authors":"Xiaoyu Qiu, Yuhan Qian, Jaehwan Yi, Jinqiu Wang, Yu Du, Yanyao Yi,\n  Ting Ye","authorsParsed":[["Qiu","Xiaoyu",""],["Qian","Yuhan",""],["Yi","Jaehwan",""],["Wang","Jinqiu",""],["Du","Yu",""],["Yi","Yanyao",""],["Ye","Ting",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 16:53:49 GMT"}],"updateDate":"2024-08-23","timestamp":1724345629000,"abstract":"  The Mantel-Haenszel (MH) risk difference estimator, commonly used in\nrandomized clinical trials for binary outcomes, calculates a weighted average\nof stratum-specific risk difference estimators. Traditionally, this method\nrequires the stringent assumption that risk differences are homogeneous across\nstrata, also known as the common risk difference assumption. In our article, we\nrelax this assumption and adopt a modern perspective, viewing the MH risk\ndifference estimator as an approach for covariate adjustment in randomized\nclinical trials, distinguishing its use from that in meta-analysis and\nobservational studies. We demonstrate that the MH risk difference estimator\nconsistently estimates the average treatment effect within a standard\nsuper-population framework, which is often the primary interest in randomized\nclinical trials, in addition to estimating a weighted average of\nstratum-specific risk difference. We rigorously study its properties under both\nthe large-stratum and sparse-stratum asymptotic regimes. Furthermore, for\neither estimand, we propose a unified robust variance estimator that improves\nover the popular variance estimators by Greenland and Robins (1985) and Sato et\nal. (1989) and has provable consistency across both asymptotic regimes,\nregardless of assuming common risk differences. Extensions of our theoretical\nresults also provide new insights into the Cochran-Mantel-Haenszel test and the\npost-stratification estimator. Our findings are thoroughly validated through\nsimulations and a clinical trial example.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}