{"id":"2408.06900","title":"Entendre, a Social Bot Detection Tool for Niche, Fringe, and Extreme\n  Social Media","authors":"Pranav Venkatesh, Kami Vinton, Dhiraj Murthy, Kellen Sharp, Akaash\n  Kolluri","authorsParsed":[["Venkatesh","Pranav",""],["Vinton","Kami",""],["Murthy","Dhiraj",""],["Sharp","Kellen",""],["Kolluri","Akaash",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 13:50:49 GMT"}],"updateDate":"2024-08-14","timestamp":1723557049000,"abstract":"  Social bots-automated accounts that generate and spread content on social\nmedia-are exploiting vulnerabilities in these platforms to manipulate public\nperception and disseminate disinformation. This has prompted the development of\npublic bot detection services; however, most of these services focus primarily\non Twitter, leaving niche platforms vulnerable. Fringe social media platforms\nsuch as Parler, Gab, and Gettr often have minimal moderation, which facilitates\nthe spread of hate speech and misinformation. To address this gap, we introduce\nEntendre, an open-access, scalable, and platform-agnostic bot detection\nframework. Entendre can process a labeled dataset from any social platform to\nproduce a tailored bot detection model using a random forest classification\napproach, ensuring robust social bot detection. We exploit the idea that most\nsocial platforms share a generic template, where users can post content,\napprove content, and provide a bio (common data features). By emphasizing\ngeneral data features over platform-specific ones, Entendre offers rapid\nextensibility at the expense of some accuracy. To demonstrate Entendre's\neffectiveness, we used it to explore the presence of bots among accounts\nposting racist content on the now-defunct right-wing platform Parler. We\nexamined 233,000 posts from 38,379 unique users and found that 1,916 unique\nusers (4.99%) exhibited bot-like behavior. Visualization techniques further\nrevealed that these bots significantly impacted the network, amplifying\ninfluential rhetoric and hashtags (e.g., #qanon, #trump, #antilgbt). These\npreliminary findings underscore the need for tools like Entendre to monitor and\nassess bot activity across diverse platforms.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"E0Iaoo2zF5h2jKXbFxE69Rxx-HTncrXaG7EGNECh8M0","pdfSize":"407251"}
