{"id":"2408.17296","title":"The size of accretion disks from self-consistent X-ray spectra +\n  UV/optical/NIR photometry fitting: applications to ASASSN-14li and HLX-1","authors":"Muryel Guolo (JHU), Andrew Mummery (Oxford)","authorsParsed":[["Guolo","Muryel","","JHU"],["Mummery","Andrew","","Oxford"]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 13:50:30 GMT"}],"updateDate":"2024-09-02","timestamp":1725025830000,"abstract":"  We implement a standard thin disk model with the outer disk radius ($R_{\\rm\nout}$) as a free parameter, integrating it into standard X-ray fitting package\nto enable self-consistent and simultaneous fitting of X-ray spectra and\nUV/optical/NIR photometry. We apply the model to the late-time data ($\\Delta t\n\\approx 350-1300$ days) of the tidal disruption event (TDE) ASASSN-14li. We\nshow that at these late-times the multi-wavelength emission of the source can\nbe fully described by a bare compact accretion disk. We obtain a black hole\nmass ($M_{\\rm BH}$) of $7^{+3}_{-2}\\times10^{6} M_{\\odot}$, consistent with\nhost-galaxy scaling relations; and an $R_{\\rm out}$ of $45 \\pm 13 \\, R_{\\rm\ng}$, consistent with the circularization radius, with possible expansion at the\nlatest epoch. We discuss how simplistic models, such as a single-temperature\nblackbody fitted to either X-ray spectra or UV/optical photometry, lead to\nerroneous interpretations on the scale/energetics of TDE emission. We also\napply the model to the soft/high state of the intermediate-mass black hole\n(IMBH) candidate HLX-1. The model fits the full spectral energy distribution\n(from X-rays to NIR) without needing an additional stellar population\ncomponent. We investigate how relativistic effects improve our results by\nimplementing a version of the model with full ray tracing calculations in the\nKerr metric. For HLX-1, we find $M_{\\rm BH} = 4^{+3}_{-1} \\times 10^{4}\nM_{\\odot}$ and $R_{\\rm out} \\approx {\\rm few} \\times 10^{3} \\, R_{\\rm g}$, in\nagreement with previous findings. The relativistic model can constrain the\ninclination ($i$) of HLX-1 to be $20^o \\leq i \\leq 70^o$.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}