{"id":"2408.12868","title":"Effective field theories of dissipative fluids with one-form symmetries","authors":"Shreya Vardhan, Sa\\v{s}o Grozdanov, Samuel Leutheusser, and Hong Liu","authorsParsed":[["Vardhan","Shreya",""],["Grozdanov","Sašo",""],["Leutheusser","Samuel",""],["Liu","Hong",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 06:55:53 GMT"}],"updateDate":"2024-08-26","timestamp":1724396153000,"abstract":"  A system with a one-form global symmetry at finite temperature can be viewed\nas a dissipative fluid of string-like objects. In this work, we classify and\nconstruct the most general effective field theories for hydrodynamics of such\nstring fluids, in a probe limit where the one-form charge density is decoupled\nfrom the energy-momentum tensor. We show that at leading order in the\nderivative expansion, there are two distinct types of diffusive transport in a\nstring fluid depending on the discrete spacetime symmetries present in it. One\nparticular application of interest is magnetohydrodynamics (MHD), where the\neffective field theories describe the diffusion of magnetic field lines. Due to\nthe distinction between the effective field theories for different discrete\nsymmetries, we show that the MHD of a fluid with charge conjugation symmetry is\nqualitatively different from that of a neutron star, which we previously\ndiscussed in arXiv:2207.01636. The explicit effective actions that we write\ndown can be used to obtain the dispersion relations $\\omega(k)$ up to cubic\norder in momenta for each of the different discrete symmetry choices. As\nanother application of this formalism, we show that when the one-form symmetry\nis spontaneously broken, the effective action reduces to the Maxwell theory.\nThis confirms the interpretation of the photon as a Goldstone boson arising\nfrom the spontaneous breaking of a one-form symmetry.\n","subjects":["Physics/High Energy Physics - Theory","Astrophysics/High Energy Astrophysical Phenomena","Condensed Matter/Statistical Mechanics","Condensed Matter/Strongly Correlated Electrons","Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}