{"id":"2408.05230","title":"A new theory of tensor-scalar gravity coupled to Aharonov-Bohm\n  electrodynamics","authors":"F. Minotti, G. Modanese","authorsParsed":[["Minotti","F.",""],["Modanese","G.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 07:56:35 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 19:54:24 GMT"}],"updateDate":"2024-08-15","timestamp":1722498995000,"abstract":"  Tensor-scalar theories of gravitation are commonly employed as extensions of\nGeneral Relativity that allow to describe a much wider phenomenology. They are\nalso naturally generated as low energy limit of higher-dimensional or unified\ntheories, and the gravitational scalar components can represent quantum\ncorrections to the Einstein theory. The coupling of the scalars to an e.m.\nfield does not introduce any relevant new physics if the e.m. action has the\nusual Maxwell form, implying a vanishing trace of the e.m. energy-momentum\ntensor. In the case of the extended Aharonov-Bohm electrodynamics some\ninteresting new situations are possible, which in this work are analyzed in the\ngravitational weak-field approximation and for a basic version of tensor-scalar\ngravity involving only a Brans-Dicke field plus another scalar. Since the\nAharonov-Bohm theory differs from Maxwell theory only in the presence of\nanomalous sources with local violation of charge conservation, which is thought\nto be possible only at a quantum level, the resulting formal framework can be\nuseful to model interactions between gravitation and physical systems with\nmacroscopic quantization. The theory contains some unknown parameters, the most\nimportant being the VEV $\\psi_0$ of the second gravitational scalar and the\nlevel $\\gamma$ of violation of local charge conservation in the e.m. sector. An\nattempt is done to relate these parameters to some experimental constraints.\nHowever, there is presently much space left for uncertainty.\n","subjects":["Physics/General Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}