{"id":"2408.17169","title":"Secure Transmission in Cell-Free Massive MIMO under Active Eavesdropping","authors":"Yasseen Sadoon Atiya, Zahra Mobini, Hien Quoc Ngo, and Michail\n  Matthaiou","authorsParsed":[["Atiya","Yasseen Sadoon",""],["Mobini","Zahra",""],["Ngo","Hien Quoc",""],["Matthaiou","Michail",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 10:15:32 GMT"}],"updateDate":"2024-09-02","timestamp":1725012932000,"abstract":"  We study secure communications in cell-free massive multiple-input\nmultiple-output (CF-mMIMO) systems with multi-antenna access points (APs) and\nprotective partial zero-forcing (PPZF) precoding. In particular, we consider an\nactive eavesdropping attack, where an eavesdropper contaminates the uplink\nchannel estimation phase by sending an identical pilot sequence with a\nlegitimate user of interest. We formulate an optimization problem for\nmaximizing the received signal-to-noise ratio (SINR) at the legitimate user,\nsubject to a maximum allowable SINR at the eavesdropper and maximum transmit\npower at each AP, while guaranteeing specific SINR requirements on other\nlegitimate users. The optimization problem is solved using a path-following\nalgorithm. We also propose a large-scale-based greedy AP selection scheme to\nimprove the secrecy spectral efficiency (SSE). Finally, we propose a simple\nmethod for identifying the presence of an eavesdropper within the system. Our\nfindings show that PPZF can substantially outperform the conventional\nmaximum-ratio transmission (MRT) scheme by providing around 2-fold improvement\nin the SSE compared to the MRT scheme. More importantly, for PPZF precoding\nscheme, our proposed AP selection can achieve a remarkable SSE gain of up to\n220%, while our power optimization approach can provide an additional gain of\nup to 55% compared with a CF-mMIMO system with equal power allocation.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}