{"id":"2408.12900","title":"Observation and characterisation of trapped electron modes in\n  Wendelstein 7-X","authors":"A. Kr\\\"amer-Flecken, J.H.E. Proll, G. Weir, P. Costello, G. Fuchert,\n  J. Geiger, S. Heuraux, A. Knieps, A. Langenberg, S. Vaz Mendes, N. Pablant,\n  E. Pasch, K. Rahbarnia, R. Sabot, L. Salazar, H.M. Smith, H. Thomsen, T.\n  Windisch, H.M. Xiang and the W7-X-team","authorsParsed":[["Krämer-Flecken","A.",""],["Proll","J. H. E.",""],["Weir","G.",""],["Costello","P.",""],["Fuchert","G.",""],["Geiger","J.",""],["Heuraux","S.",""],["Knieps","A.",""],["Langenberg","A.",""],["Mendes","S. Vaz",""],["Pablant","N.",""],["Pasch","E.",""],["Rahbarnia","K.",""],["Sabot","R.",""],["Salazar","L.",""],["Smith","H. M.",""],["Thomsen","H.",""],["Windisch","T.",""],["Xiang","H. M.",""],["W7-X-team","the",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 08:06:40 GMT"}],"updateDate":"2024-08-26","timestamp":1724400400000,"abstract":"  In the past, quasi coherent modes were reported for nearly all tokamaks. The\ngeneral definition describes modes as quasi coherent when the magnitude squared\ncoherence is in the range of \\SIrange{0.3}{0.6}{}. Quasi coherent modes are\nobserved in the plasma core as well as in the plasma edge and can have quite\ndifferent physical origins. The one in the core are observed in plasmas with\nlow collisionality, where the electron temperature exceeds the ion temperature\nin the plasma core. This is the case for electron cyclotron heating in general.\nThe origin of these modes are electrons trapped within a magnetic mirror, as\nreported in the past from various fusion devices. The so-called\ntrapped-electron modes (TEMs) belong to drift wave instabilities and can be\ndestabilized by electron-temperature gradients in the plasma core. From the\ndiagnostic point of view, quasi coherent modes appear as fluctuations in\nelectron density and temperature. Therefore, the microwave reflectometer is\nvery well suited to monitor these modes. This paper describes experiments,\nconducted at the Wendelstein 7-X stellarator (W7-X), which aim at detecting\nquasi coherent modes at low wave numbers. A Poloidal Correlation Reflectometer\n(PCR) installed at W7-X, is able to measure low wave numbers ($k_\\perp\\le 3.5$\ncm$^{-1}$). For different magnetic configurations and plasma parameters, broad\nquasi-coherent structures are observed in the coherence spectra. From the\nanalysis of the rotation and the poloidal structure, these quasi coherent (QC)\nmodes show the properties of electron-temperature-gradient driven TEMs. A\nlinear relation between the mode velocity and the rotation frequency is found.\nThe relation is uniform and confirms the nature of QC-mode observation as TEM\nin tokamaks, too.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}