{"id":"2408.05031","title":"On the distribution of the the near-solar bound dust grains detected\n  with Parker Solar Probe","authors":"Samuel Ko\\v{c}i\\v{s}\\v{c}\\'ak, Audun Theodorsen, Ingrid Mann","authorsParsed":[["Kočiščák","Samuel",""],["Theodorsen","Audun",""],["Mann","Ingrid",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 12:36:16 GMT"}],"updateDate":"2024-08-12","timestamp":1723206976000,"abstract":"  Parker Solar Probe (PSP) counts dust impacts in the near-solar region, but\nmodelling effort is needed to understand the dust population's properties. We\naim to constrain the dust cloud's properties based on the flux observed by PSP.\nWe develop a forward-model for the bound dust detection rates using the\nformalism of 6D phase space distribution of the dust. We apply the model to the\nlocation table of different PSP's solar encounter groups. We explain some of\nthe near-perihelion features observed in the data as well as the broader\ncharacteristic of the dust flux between 0.15 AU and 0.5 AU. We compare the\nmeasurements of PSP to the measurements of Solar Orbiter (SolO) near 1 AU to\nexpose the differences between the two spacecraft. We found that the dust flux\nobserved by PSP between 0.15 AU and 0.5 AU in post-perihelia can be explained\nby dust on bound orbits and is consistent with a broad range of orbital\nparameters, including dust on circular orbits. However, the dust number density\nas a function of the heliocentric distance and the scaling of detection\nefficiency with the relative speed are important to explain the observed flux\nvariation. The data suggest that the slope of differential mass distribution\n${\\delta}$ is between 0.14 and 0.49. The near-perihelion observations, however,\nshow the flux maxima, which are inconsistent with the circular dust model, and\nadditional effects may play a role. We found indication that the sunward side\nof PSP is less sensitive to the dust impacts, compared to the other PSP's\nsurfaces. Conclusions. We show that the dust flux on PSP can be explained by\nnon-circular bound dust and the detection capabilities of PSP. The scaling of\nflux with the impact speed is especially important, and shallower than\npreviously assumed.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}