{"id":"2408.07412","title":"Lateral Mn5Ge3 spin-valve in contact with a high-mobility Ge\n  two-dimensional hole gas","authors":"David Wei{\\ss}haupt, Christoph S\\\"urgers, Dominik Bloos, Hannes Simon\n  Funk, Michael Oehme, Gerda Fischer, Markus Andreas Schubert, Christian\n  Wenger, Joris van Slageren, Inga Anita Fischer, J\\\"org Schulze","authorsParsed":[["Weißhaupt","David",""],["Sürgers","Christoph",""],["Bloos","Dominik",""],["Funk","Hannes Simon",""],["Oehme","Michael",""],["Fischer","Gerda",""],["Schubert","Markus Andreas",""],["Wenger","Christian",""],["van Slageren","Joris",""],["Fischer","Inga Anita",""],["Schulze","Jörg",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 09:40:13 GMT"}],"updateDate":"2024-08-15","timestamp":1723628413000,"abstract":"  Ge two-dimensional hole gases in strained modulation-doped quantum-wells\nrepresent a promising material platform for future spintronic applications due\nto their excellent spin transport properties and the theoretical possibility of\nefficient spin manipulation. Due to the continuous development of epitaxial\ngrowth recipes extreme high hole mobilities and low effective masses can be\nachieved, promising an efficient spin transport. Furthermore, the Ge\ntwo-dimensional hole gas (2DHG) can be integrated in the well-established\nindustrial complementary metal-oxide-semiconductor (CMOS) devices technology.\nHowever, efficient electrical spin injection into a Ge 2DHG - a prerequisite\nfor the realization of spintronic devices - has not yet been demonstrated. In\nthis work, we report the fabrication and low-temperature magnetoresistance\nmeasurements of a laterally structured Mn5Ge3/Ge 2DHG/ Mn5Ge3 device. The\nferromagnetic Mn5Ge3 contacts are grown directly into the Ge quantum well by\nmeans of an interdiffusion process with a spacing of approximately 130 nm. We\nobserve a magnetoresistance signal for temperatures below 13 K possibly arising\nfrom successful spin injection. The results represent a step forward toward the\nrealization of CMOS compatible spintronic devices based on a 2DHG.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oe2WfJ-fv7Jf45t4b6InzbEvkpTpyZX2prAk_pC75Bw","pdfSize":"404017"}
