{"id":"2408.13608","title":"SpeechCraft: A Fine-grained Expressive Speech Dataset with Natural\n  Language Description","authors":"Zeyu Jin, Jia Jia, Qixin Wang, Kehan Li, Shuoyi Zhou, Songtao Zhou,\n  Xiaoyu Qin and Zhiyong Wu","authorsParsed":[["Jin","Zeyu",""],["Jia","Jia",""],["Wang","Qixin",""],["Li","Kehan",""],["Zhou","Shuoyi",""],["Zhou","Songtao",""],["Qin","Xiaoyu",""],["Wu","Zhiyong",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 15:36:08 GMT"}],"updateDate":"2024-08-28","timestamp":1724513768000,"abstract":"  Speech-language multi-modal learning presents a significant challenge due to\nthe fine nuanced information inherent in speech styles. Therefore, a\nlarge-scale dataset providing elaborate comprehension of speech style is\nurgently needed to facilitate insightful interplay between speech audio and\nnatural language. However, constructing such datasets presents a major\ntrade-off between large-scale data collection and high-quality annotation. To\ntackle this challenge, we propose an automatic speech annotation system for\nexpressiveness interpretation that annotates in-the-wild speech clips with\nexpressive and vivid human language descriptions. Initially, speech audios are\nprocessed by a series of expert classifiers and captioning models to capture\ndiverse speech characteristics, followed by a fine-tuned LLaMA for customized\nannotation generation. Unlike previous tag/templet-based annotation frameworks\nwith limited information and diversity, our system provides in-depth\nunderstandings of speech style through tailored natural language descriptions,\nthereby enabling accurate and voluminous data generation for large model\ntraining. With this system, we create SpeechCraft, a fine-grained bilingual\nexpressive speech dataset. It is distinguished by highly descriptive natural\nlanguage style prompts, containing approximately 2,000 hours of audio data and\nencompassing over two million speech clips. Extensive experiments demonstrate\nthat the proposed dataset significantly boosts speech-language task performance\nin stylist speech synthesis and speech style understanding.\n","subjects":["Computing Research Repository/Multimedia","Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}