{"id":"2408.04216","title":"Attention Mechanism and Context Modeling System for Text Mining Machine\n  Translation","authors":"Shi Bo, Yuwei Zhang, Junming Huang, Sitong Liu, Zexi Chen, Zizheng Li","authorsParsed":[["Bo","Shi",""],["Zhang","Yuwei",""],["Huang","Junming",""],["Liu","Sitong",""],["Chen","Zexi",""],["Li","Zizheng",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 04:52:10 GMT"}],"updateDate":"2024-08-09","timestamp":1723092730000,"abstract":"  This paper advances a novel architectural schema anchored upon the\nTransformer paradigm and innovatively amalgamates the K-means categorization\nalgorithm to augment the contextual apprehension capabilities of the schema.\nThe transformer model performs well in machine translation tasks due to its\nparallel computing power and multi-head attention mechanism. However, it may\nencounter contextual ambiguity or ignore local features when dealing with\nhighly complex language structures. To circumvent this constraint, this\nexposition incorporates the K-Means algorithm, which is used to stratify the\nlexis and idioms of the input textual matter, thereby facilitating superior\nidentification and preservation of the local structure and contextual\nintelligence of the language. The advantage of this combination is that K-Means\ncan automatically discover the topic or concept regions in the text, which may\nbe directly related to translation quality. Consequently, the schema contrived\nherein enlists K-Means as a preparatory phase antecedent to the Transformer and\nrecalibrates the multi-head attention weights to assist in the discrimination\nof lexis and idioms bearing analogous semantics or functionalities. This\nensures the schema accords heightened regard to the contextual intelligence\nembodied by these clusters during the training phase, rather than merely\nfocusing on locational intelligence.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"O1SJRV0PBdfQMwg3W4RKyV8xpDM3al8LJwo1Q1s2Oz4","pdfSize":"646533"}
