{"id":"2408.05372","title":"PRISM Lite: A lightweight model for interactive 3D placenta segmentation\n  in ultrasound","authors":"Hao Li, Baris Oguz, Gabriel Arenas, Xing Yao, Jiacheng Wang, Alison\n  Pouch, Brett Byram, Nadav Schwartz, Ipek Oguz","authorsParsed":[["Li","Hao",""],["Oguz","Baris",""],["Arenas","Gabriel",""],["Yao","Xing",""],["Wang","Jiacheng",""],["Pouch","Alison",""],["Byram","Brett",""],["Schwartz","Nadav",""],["Oguz","Ipek",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 22:49:19 GMT"}],"updateDate":"2024-08-13","timestamp":1723243759000,"abstract":"  Placenta volume measured from 3D ultrasound (3DUS) images is an important\ntool for tracking the growth trajectory and is associated with pregnancy\noutcomes. Manual segmentation is the gold standard, but it is time-consuming\nand subjective. Although fully automated deep learning algorithms perform well,\nthey do not always yield high-quality results for each case. Interactive\nsegmentation models could address this issue. However, there is limited work on\ninteractive segmentation models for the placenta. Despite their segmentation\naccuracy, these methods may not be feasible for clinical use as they require\nrelatively large computational power which may be especially prohibitive in\nlow-resource environments, or on mobile devices. In this paper, we propose a\nlightweight interactive segmentation model aiming for clinical use to\ninteractively segment the placenta from 3DUS images in real-time. The proposed\nmodel adopts the segmentation from our fully automated model for initialization\nand is designed in a human-in-the-loop manner to achieve iterative\nimprovements. The Dice score and normalized surface Dice are used as evaluation\nmetrics. The results show that our model can achieve superior performance in\nsegmentation compared to state-of-the-art models while using significantly\nfewer parameters. Additionally, the proposed model is much faster for inference\nand robust to poor initial masks. The code is available at\nhttps://github.com/MedICL-VU/PRISM-placenta.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}