{"id":"2408.15949","title":"Probing Lorentz invariance with a high-energy neutrino flare","authors":"Mauricio Bustamante, John Ellis, Rostislav Konoplich, Alexander S.\n  Sakharov","authorsParsed":[["Bustamante","Mauricio",""],["Ellis","John",""],["Konoplich","Rostislav",""],["Sakharov","Alexander S.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 17:08:18 GMT"}],"updateDate":"2024-08-29","timestamp":1724864898000,"abstract":"  Time-of-flight measurements of high-energy astrophysical neutrinos can be\nused to probe Lorentz invariance, a pillar of modern physics. If\nLorentz-invariance violation (LIV) occurs, it could cause neutrinos to slow\ndown, with the delay scaling linearly or quadratically with their energy. We\nintroduce non-parametric statistical methods designed to detect LIV-induced\ndistortions in the temporal structure of a high-energy neutrino flare as it\ntravels to Earth from a distant astrophysical source, independently of the\nintrinsic timing properties of the source. Our approach, illustrated using the\n2014/2015 TeV-PeV neutrino flare from the blazar TXS 0506+056 detected by\nIceCube, finds that the LIV energy scale must exceed 10^{14} GeV (linear) or\n10^9 GeV (quadratic). Our methods provide a robust means to investigate LIV by\nfocusing solely on a neutrino flare, without relying on electromagnetic\ncounterparts, and account for realistic energy and directional uncertainties.\nFor completeness, we compare our limits inferred from TXS 0506+056 to the\nsensitivity inferred from multi-messenger detection of tentative coincidences\nbetween neutrinos and electromagnetic emission from active galactic nuclei and\ntidal disruption events.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Experiment","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}