{"id":"2408.03063","title":"Social Behavior as a Key to Learning-based Multi-Agent Pathfinding\n  Dilemmas","authors":"Chengyang He, Tanishq Duhan, Parth Tulsyan, Patrick Kim, and Guillaume\n  Sartoretti","authorsParsed":[["He","Chengyang",""],["Duhan","Tanishq",""],["Tulsyan","Parth",""],["Kim","Patrick",""],["Sartoretti","Guillaume",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 09:34:54 GMT"}],"updateDate":"2024-08-07","timestamp":1722936894000,"abstract":"  The Multi-agent Path Finding (MAPF) problem involves finding collision-free\npaths for a team of agents in a known, static environment, with important\napplications in warehouse automation, logistics, or last-mile delivery. To meet\nthe needs of these large-scale applications, current learning-based methods\noften deploy the same fully trained, decentralized network to all agents to\nimprove scalability. However, such parameter sharing typically results in\nhomogeneous behaviors among agents, which may prevent agents from breaking ties\naround symmetric conflict (e.g., bottlenecks) and might lead to\nlive-/deadlocks. In this paper, we propose SYLPH, a novel learning-based MAPF\nframework aimed to mitigate the adverse effects of homogeneity by allowing\nagents to learn and dynamically select different social behaviors (akin to\nindividual, dynamic roles), without affecting the scalability offered by\nparameter sharing. Specifically, SYLPH agents learn to select their Social\nValue Orientation (SVO) given the situation at hand, quantifying their own\nlevel of selfishness/altruism, as well as an SVO-conditioned MAPF policy\ndictating their movement actions. To these ends, each agent first determines\nthe most influential other agent in the system by predicting future\nconflicts/interactions with other agents. Each agent selects its own SVO\ntowards that agent, and trains its decentralized MAPF policy to enact this SVO\nuntil another agent becomes more influential. To further allow agents to\nconsider each others' social preferences, each agent gets access to the SVO\nvalue of their neighbors. As a result of this hierarchical decision-making and\nexchange of social preferences, SYLPH endows agents with the ability to reason\nabout the MAPF task through more latent spaces and nuanced contexts, leading to\nvaried responses that can help break ties around symmetric conflicts. [...]\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}