{"id":"2408.07325","title":"RoCoSDF: Row-Column Scanned Neural Signed Distance Fields for Freehand\n  3D Ultrasound Imaging Shape Reconstruction","authors":"Hongbo Chen, Yuchong Gao, Shuhang Zhang, Jiangjie Wu, Yuexin Ma, and\n  Rui Zheng","authorsParsed":[["Chen","Hongbo",""],["Gao","Yuchong",""],["Zhang","Shuhang",""],["Wu","Jiangjie",""],["Ma","Yuexin",""],["Zheng","Rui",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 06:53:31 GMT"}],"updateDate":"2024-08-15","timestamp":1723618411000,"abstract":"  The reconstruction of high-quality shape geometry is crucial for developing\nfreehand 3D ultrasound imaging. However, the shape reconstruction of multi-view\nultrasound data remains challenging due to the elevation distortion caused by\nthick transducer probes. In this paper, we present a novel learning-based\nframework RoCoSDF, which can effectively generate an implicit surface through\ncontinuous shape representations derived from row-column scanned datasets. In\nRoCoSDF, we encode the datasets from different views into the corresponding\nneural signed distance function (SDF) and then operate all SDFs in a normalized\n3D space to restore the actual surface contour. Without requiring pre-training\non large-scale ground truth shapes, our approach can synthesize a smooth and\ncontinuous signed distance field from multi-view SDFs to implicitly represent\nthe actual geometry. Furthermore, two regularizers are introduced to facilitate\nshape refinement by constraining the SDF near the surface. The experiments on\ntwelve shapes data acquired by two ultrasound transducer probes validate that\nRoCoSDF can effectively reconstruct accurate geometric shapes from multi-view\nultrasound data, which outperforms current reconstruction methods. Code is\navailable at https://github.com/chenhbo/RoCoSDF.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Graphics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}