{"id":"2408.13671","title":"Ultrafast Charge Transfer Dynamics at the MoS$_2$/Au Interface Observed\n  via Optical Spectroscopy under Ambient Conditions","authors":"Tao Yang, Zhipeng Huang, Stephan Sleziona, Eckart Hasselbrink, Peter\n  Kratzer, Marika Schleberger, R. Kramer Campen, and Yujin Tong","authorsParsed":[["Yang","Tao",""],["Huang","Zhipeng",""],["Sleziona","Stephan",""],["Hasselbrink","Eckart",""],["Kratzer","Peter",""],["Schleberger","Marika",""],["Campen","R. Kramer",""],["Tong","Yujin",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 21:04:06 GMT"}],"updateDate":"2024-08-27","timestamp":1724533446000,"abstract":"  To take advantage of the exceptional properties of atomically thin transition\nmetal dichalcogenides (TMDC) for advanced devices and catalysts, integration\nwith metallic surfaces is an efficacious approach for facilitating charge\ncarrier injection and extraction from TMDC monolayers. Light-matter\ninteractions predominantly occur at the K point in TMDC monolayers, making the\ncharge carrier dynamics at this point essential for their optimal performance.\nHowever, direct access to and comprehensive understanding of the charge carrier\ndynamics at the K point of TMDC monolayer on a metal substrate remains\nchallenging. In this study, we employed azimuth- and polarization-dependent\nfinal-state sum frequency generation (FS-SFG) spectroscopy to investigate the\nultrafast dynamics of charge transfer at the K point of a MoS$_2$ monolayer\ninterfaced with an Au substrate. We observed an ultrafast injection (sub-20 fs)\nof photoexcited hot electrons from the Au substrate to the conduction band\nminimum (CBM) of the MoS$_2$ monolayer. Subsequently, driven by an internal\nelectric field induced by charge redistribution, injected hot electrons in\nMoS$_2$ experience a relaxation and fast return ($\\sim2$ ps) from the CBM and a\ntrap state mediated slow return ($\\sim60$ ps) process. The direct optical\nobservation of the full electron dynamics at the K point of MoS$_2$ monolayer\nin ambient conditions provides valuable insights into the mechanisms of charge\ncarrier transfer across the TMDC-metal interface, informing the design of\nadvanced TMDC-based devices with enhanced charge transfer rates.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Gm0Mfh3EjXKmBMAGtBtcnKusvp6zCorpnKFEOOagQIE","pdfSize":"5006443"}
