{"id":"2408.09814","title":"Rapid infrared imaging for rhombohedral graphene","authors":"Zuo Feng, Wenxuan Wang, Yilong You, Yifei Chen, Kenji Watanabe,\n  Takashi Taniguchi, Chang Liu, Kaihui Liu and Xiaobo Lu","authorsParsed":[["Feng","Zuo",""],["Wang","Wenxuan",""],["You","Yilong",""],["Chen","Yifei",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Liu","Chang",""],["Liu","Kaihui",""],["Lu","Xiaobo",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 09:03:48 GMT"}],"updateDate":"2024-08-20","timestamp":1724058228000,"abstract":"  The extrinsic stacking sequence based on intrinsic crystal symmetry in\nmultilayer two-dimensional materials plays a significant role in determining\ntheir electronic and optical properties. Compared with Bernal-stacked (ABA)\nmultilayer graphene, rhombohedral (ABC) multilayer graphene hosts stronger\nelectron-electron interaction due to its unique dispersion at low-energy\nexcitations and has been utiliazed as a unique platform to explore strongly\ncorrelated physics. However, discerning the stacking sequence has always been a\nquite time-consuming process by scanning mapping methods. Here, we report a\nrapid recognition method for ABC- stacked graphene with high accuracy by\ninfrared imaging based on the distinct optical responses at infrared range. The\noptical contrast of the image between ABC and ABA stacked graphene is\nstrikingly clear, and the discernibility is comparable to traditional optical\nRaman microscopy but with higher consistency and throughput. We further\ndemonstrate that the infrared imaging technique can be integrated with dry\ntransfer techniques commonly used in the community. This rapid and convenient\ninfrared imaging technique will significantly improve the sorting efficiency\nfor differently stacked multilayer graphene, thereby accelerating the\nexploration of the novel emergent correlated phenomena in ABC stacked graphene.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"NcuyNRVZn_QY6GX90FcgN0HZA2CTjiYQof9VeNFxalg","pdfSize":"3027947"}
