{"id":"2408.09692","title":"A robust hybridizable discontinuous Galerkin scheme with harmonic\n  averaging technique for steady state of real-world semiconductor devices","authors":"Qingyuan Shi, Yongyong Cai, Chijie Zhuang, Bo Lin, Dan Wu, Rong Zeng,\n  Weizhu Bao","authorsParsed":[["Shi","Qingyuan",""],["Cai","Yongyong",""],["Zhuang","Chijie",""],["Lin","Bo",""],["Wu","Dan",""],["Zeng","Rong",""],["Bao","Weizhu",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 04:04:05 GMT"}],"updateDate":"2024-09-19","timestamp":1724040245000,"abstract":"  Solving real-world nonlinear semiconductor device problems modeled by the\ndrift-diffusion equations coupled with the Poisson equation (also known as the\nPoisson-Nernst-Planck equations) necessitates an accurate and efficient\nnumerical scheme which can avoid non-physical oscillations even for problems\nwith extremely sharp doping profiles. In this paper, we propose a flexible and\nhigh-order hybridizable discontinuous Galerkin (HDG) scheme with harmonic\naveraging (HA) technique to tackle these challenges. The proposed HDG-HA scheme\ncombines the robustness of finite volume Scharfetter-Gummel (FVSG) method with\nthe high-order accuracy and $hp$-flexibility offered by the locally\nconservative HDG scheme. The coupled Poisson equation and two drift-diffusion\nequations are simultaneously solved by the Newton method. Indicators based on\nthe gradient of net doping $N$ and solution variables are proposed to switch\nbetween cells with HA technique and high-order conventional HDG cells,\nutilizing the flexibility of HDG scheme. Numerical results suggest that the\nproposed scheme does not exhibit oscillations or convergence issues, even when\napplied to heavily doped and sharp PN-junctions. Devices with circular\njunctions and realistic doping profiles are simulated in two dimensions,\nqualifying this scheme for practical simulation of real-world semiconductor\ndevices.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}