{"id":"2408.14410","title":"Generalized Bayesian nonparametric clustering framework for\n  high-dimensional spatial omics data","authors":"Bencong Zhu, Guanyu Hu, Xiaodan Fan, and Qiwei Li","authorsParsed":[["Zhu","Bencong",""],["Hu","Guanyu",""],["Fan","Xiaodan",""],["Li","Qiwei",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 16:58:21 GMT"}],"updateDate":"2024-08-27","timestamp":1724691501000,"abstract":"  The advent of next-generation sequencing-based spatially resolved\ntranscriptomics (SRT) techniques has transformed genomic research by enabling\nhigh-throughput gene expression profiling while preserving spatial context.\nIdentifying spatial domains within SRT data is a critical task, with numerous\ncomputational approaches currently available. However, most existing methods\nrely on a multi-stage process that involves ad-hoc dimension reduction\ntechniques to manage the high dimensionality of SRT data. These low-dimensional\nembeddings are then subjected to model-based or distance-based clustering\nmethods. Additionally, many approaches depend on arbitrarily specifying the\nnumber of clusters (i.e., spatial domains), which can result in information\nloss and suboptimal downstream analysis. To address these limitations, we\npropose a novel Bayesian nonparametric mixture of factor analysis (BNPMFA)\nmodel, which incorporates a Markov random field-constrained Gibbs-type prior\nfor partitioning high-dimensional spatial omics data. This new prior\neffectively integrates the spatial constraints inherent in SRT data while\nsimultaneously inferring cluster membership and determining the optimal number\nof spatial domains. We have established the theoretical identifiability of\ncluster membership within this framework. The efficacy of our proposed approach\nis demonstrated through realistic simulations and applications to two SRT\ndatasets. Our results show that the BNPMFA model not only surpasses\nstate-of-the-art methods in clustering accuracy and estimating the number of\nclusters but also offers novel insights for identifying cellular regions within\ntissue samples.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zn-eDWSkgHpWGz1791RrxBpbnsj-Ewos5hQUrn0aYOA","pdfSize":"8536013"}
