{"id":"2408.06225","title":"Quasi-periodic Oscillations in GRB 210514A: a Case of a Newborn\n  Supra-Massive Precessing Magnetar Collapsing into a Black Hole?","authors":"Le Zou and Ji-Gui Cheng","authorsParsed":[["Zou","Le",""],["Cheng","Ji-Gui",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 15:27:42 GMT"}],"updateDate":"2024-08-13","timestamp":1723476462000,"abstract":"  Magnetar is proposed as one of the possible central engines for a gamma-ray\nburst (GRB). Recent studies show that if a magnetar has a rotational axis\nmisaligned from the magnetic one, a periodic lightcurve pattern is expected\nwith a period of seconds to minutes. Inspired by this unique feature, in this\npaper, we search for the quasi-periodic oscillation (QPO) signals in the {\\it\nSwift} observations of GRBs. Using the Lomb-Scargle periodogram and the\nweighted wavelet Z-transform algorithms, we find that the {\\it Swift}-BAT data\nof GRB 210514A has a QPO signal with a period $\\sim 11\\,{\\rm s}$. The estimated\nconfidence level of the signal is over $3 \\sigma$. The global lightcurve of\nthis GRB exhibits a double-plateau structure with a sharp decay segment between\nplateaus. The lightcurve feature resembles those of GRBs that were reported to\nhave internal plateaus. We explain the observations of GRB 210514A with a\nsupra-massive magnetar (SMM) model, where the QPO signal in the first plateau\nis produced via the dipole radiation of the SMM experiencing a precession\nmotion, the sharp decay is due to the collapse of the SMM into a black hole\n(BH), and the second plateau could be produced via the fall-back accretion of\nthe newborn BH. We fit the precession model to the observations using the\nBayesian statistic and the best-fit magnetar parameters are discussed.\nAlternative models concerning a BH central engine may also provide reasonable\nexplanations for this burst, only in this case the QPO signal could merely be a\ncoincidence.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}