{"id":"2408.01949","title":"Efficient coding with chaotic neural networks: A journey from\n  neuroscience to physics and back","authors":"Jonathan Kadmon","authorsParsed":[["Kadmon","Jonathan",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 07:34:35 GMT"}],"updateDate":"2024-08-06","timestamp":1722756875000,"abstract":"  This essay, derived from a lecture at \"The Physics Modeling of Thought\"\nworkshop in Berlin in winter 2023, explores the mutually beneficial\nrelationship between theoretical neuroscience and statistical physics through\nthe lens of efficient coding and computation in cortical circuits. It\nhighlights how the study of neural networks has enhanced our understanding of\ncomplex, nonequilibrium, and disordered systems, while also demonstrating how\nneuroscientific challenges have spurred novel developments in physics. The\npaper traces the evolution of ideas from seminal work on chaos in random neural\nnetworks to recent developments in efficient coding and the partial suppression\nof chaotic fluctuations. It emphasizes how concepts from statistical physics,\nsuch as phase transitions and critical phenomena, have been instrumental in\nelucidating the computational capabilities of neural networks.\n  By examining the interplay between order and disorder in neural computation,\nthe essay illustrates the deep connection between theoretical neuroscience and\nthe statistical physics of nonequilibrium systems. This synthesis underscores\nthe ongoing importance of interdisciplinary approaches in advancing both\nfields, offering fresh perspectives on the fundamental principles governing\ninformation processing in biological and artificial systems. This\nmultidisciplinary approach not only advances our understanding of neural\ncomputation and complex systems but also points toward future challenges at the\nintersection of neuroscience and physics.\n","subjects":["Quantitative Biology/Neurons and Cognition","Nonlinear Sciences/Chaotic Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}