{"id":"2408.11220","title":"Displacement field-controlled fractional Chern insulators and charge\n  density waves in a graphene/hBN moir\\'e superlattice","authors":"Samuel H. Aronson, Tonghang Han, Zhengguang Lu, Yuxuan Yao, Kenji\n  Watanabe, Takashi Taniguchi, Long Ju, and Raymond C. Ashoori","authorsParsed":[["Aronson","Samuel H.",""],["Han","Tonghang",""],["Lu","Zhengguang",""],["Yao","Yuxuan",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Ju","Long",""],["Ashoori","Raymond C.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 22:37:05 GMT"}],"updateDate":"2024-08-22","timestamp":1724193425000,"abstract":"  Rhombohedral multilayer graphene, with its flat electronic bands and\nconcentrated Berry curvature, is a promising material for the realization of\ncorrelated topological phases of matter. When aligned to an adjacent hexagonal\nboron nitride (hBN) layer, the graphene develops narrow minibands with\nnon-trivial topology. By tuning an externally-applied electric displacement\nfield, the conduction electrons can either be pushed towards or away from the\nmoir\\'e superlattice. Motivated by the recent observation of the fractional\nquantum anomalous Hall effect (FQAHE) in the moir\\'e-distant case, we study the\nopposite moir\\'e-proximal case, where the superlattice potential is\nconsiderably stronger. We explore the physics within the moir\\'e conduction\nbands through capacitance measurements that allow us to determine the inverse\nelectronic compressibility and extract energy gaps of incompressible states. We\nobserve integer and fractional Chern insulator states at superlattice filling\nfactors v = 1, 2/3, and 1/3 with Streda slopes of -1, -2/3, and -1/3,\nrespectively. Remarkably, the v = 1/3 state persists down to a magnetic field\nof 0.2 T. In addition, we also observe numerous trivial and topological charge\ndensity waves. We map out a phase diagram that is highly sensitive to both\ndisplacement and magnetic fields, which tune the system between various ground\nstates by modifying the band dispersion and the structure of the electronic\nwavefunctions. This work demonstrates displacement field control of topological\nphase transitions in the moir\\'e-proximal limit of rhombohedral pentalayer\ngraphene, creating a highly-tunable platform for studying the interplay between\nintrinsic band topology and strong lattice effects.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}