{"id":"2408.07901","title":"Coupling between electrons and charge density wave fluctuation and its\n  possible role in superconductivity","authors":"Yeonghoon Lee, Yeahan Sur, Sunghun Kim, Jaehun Cha, Jounghoon Hyun,\n  Chan-young Lim, Makoto Hashimoto, Donghui Lu, Younsik Kim, Soonsang Huh,\n  Changyoung Kim, Shinichiro Ideta, Kiyohisa Tanaka, Kee Hoon Kim, Yeongkwan\n  Kim","authorsParsed":[["Lee","Yeonghoon",""],["Sur","Yeahan",""],["Kim","Sunghun",""],["Cha","Jaehun",""],["Hyun","Jounghoon",""],["Lim","Chan-young",""],["Hashimoto","Makoto",""],["Lu","Donghui",""],["Kim","Younsik",""],["Huh","Soonsang",""],["Kim","Changyoung",""],["Ideta","Shinichiro",""],["Tanaka","Kiyohisa",""],["Kim","Kee Hoon",""],["Kim","Yeongkwan",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 03:12:33 GMT"}],"updateDate":"2024-08-16","timestamp":1723691553000,"abstract":"  In most of charge density wave (CDW) systems of different material classes,\nranging from traditional correlated systems in low-dimension to recent\ntopological systems with Kagome lattice, superconductivity emerges when the\nsystem is driven toward the quantum critical point (QCP) of CDW via external\nparameters of doping and pressure. Despite this rather universal trend, the\nessential hinge between CDW and superconductivity has not been established yet.\nHere, the evidence of coupling between electron and CDW fluctuation is\nreported, based on a temperature- and intercalation-dependent kink in the\nangle-resolved photoemission spectra of 2H-PdxTaSe2. Kinks are observed only\nwhen the system is in the CDW phase, regardless of whether a long- or\nshort-range order is established. Notably, the coupling strength is enhanced\nupon long-range CDW suppression, albeit the coupling energy scale is reduced.\nInterestingly, estimation of the superconducting critical temperature by\nincorporating the observed coupling characteristics into McMillan's equation\nyields result closely resembling the known values of the superconducting dome.\nOur results thus highlight a compelling possibility that this new coupling\nmediates Cooper pairs, which provides new insights on the competing\nrelationship not only for CDW, but also for other competing orders.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}