{"id":"2408.07249","title":"GQE: Generalized Query Expansion for Enhanced Text-Video Retrieval","authors":"Zechen Bai, Tianjun Xiao, Tong He, Pichao Wang, Zheng Zhang, Thomas\n  Brox, Mike Zheng Shou","authorsParsed":[["Bai","Zechen",""],["Xiao","Tianjun",""],["He","Tong",""],["Wang","Pichao",""],["Zhang","Zheng",""],["Brox","Thomas",""],["Shou","Mike Zheng",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 01:24:09 GMT"}],"updateDate":"2024-08-15","timestamp":1723598649000,"abstract":"  In the rapidly expanding domain of web video content, the task of text-video\nretrieval has become increasingly critical, bridging the semantic gap between\ntextual queries and video data. This paper introduces a novel data-centric\napproach, Generalized Query Expansion (GQE), to address the inherent\ninformation imbalance between text and video, enhancing the effectiveness of\ntext-video retrieval systems. Unlike traditional model-centric methods that\nfocus on designing intricate cross-modal interaction mechanisms, GQE aims to\nexpand the text queries associated with videos both during training and testing\nphases. By adaptively segmenting videos into short clips and employing\nzero-shot captioning, GQE enriches the training dataset with comprehensive\nscene descriptions, effectively bridging the data imbalance gap. Furthermore,\nduring retrieval, GQE utilizes Large Language Models (LLM) to generate a\ndiverse set of queries and a query selection module to filter these queries\nbased on relevance and diversity, thus optimizing retrieval performance while\nreducing computational overhead. Our contributions include a detailed\nexamination of the information imbalance challenge, a novel approach to query\nexpansion in video-text datasets, and the introduction of a query selection\nstrategy that enhances retrieval accuracy without increasing computational\ncosts. GQE achieves state-of-the-art performance on several benchmarks,\nincluding MSR-VTT, MSVD, LSMDC, and VATEX, demonstrating the effectiveness of\naddressing text-video retrieval from a data-centric perspective.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"eJrMhMByfCNEKDY9FQx-EDLNJLP8otBYz82d-XJPIeo","pdfSize":"1863333"}
