{"id":"2408.17081","title":"Stochastic Layer-Wise Shuffle: A Good Practice to Improve Vision Mamba\n  Training","authors":"Zizheng Huang, Haoxing Chen, Jiaqi Li, Jun Lan, Huijia Zhu, Weiqiang\n  Wang, Limin Wang","authorsParsed":[["Huang","Zizheng",""],["Chen","Haoxing",""],["Li","Jiaqi",""],["Lan","Jun",""],["Zhu","Huijia",""],["Wang","Weiqiang",""],["Wang","Limin",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 08:09:19 GMT"}],"updateDate":"2024-09-02","timestamp":1725005359000,"abstract":"  Recent Vision Mamba models not only have much lower complexity for processing\nhigher resolution images and longer videos but also the competitive performance\nwith Vision Transformers (ViTs). However, they are stuck into overfitting and\nthus only present up to base size (about 80M). It is still unclear how vanilla\nVision Mamba (Vim) can be efficiently scaled up to larger sizes, which is\nessentially for further exploitation. In this paper, we propose a stochastic\nlayer-wise shuffle regularization, which empowers successfully scaling\nnon-hierarchical Vision Mamba to a large size (about 300M) in a supervised\nsetting. Specifically, our base and large-scale ShuffleMamba models can\noutperform the supervised ViTs of similar size by 0.8\\% and 1.0\\%\nclassification accuracy on ImageNet1k, respectively, without auxiliary data.\nWhen evaluated on the ADE20K semantic segmentation and COCO detection tasks,\nour ShuffleMamba models also show significant improvements. Without bells and\nwhistles, the stochastic layer-wise shuffle has the following highlights: (1)\n\\textit{Plug and play:} it does not change model architectures and will be\nomitted in inference. (2) \\textit{Simple but effective:} it can improve the\noverfitting in Vim training and only introduce random token permutation\noperations. (3) \\textit{Intuitive:} the token sequences in deeper layers are\nmore likely to be shuffled as they are expected to be more semantic and less\nsensitive to patch positions. Code and models will be available at\nhttps://github.com/huangzizheng01/ShuffleMamba.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"B6UoXnCj1b4gAa_LWFAytZD9HdVQ-CD76B-DncgbkyU","pdfSize":"888498"}
