{"id":"2408.16693","title":"Gibbs free energies of Fe clusters can be approximated by Tolman\n  correction to accurately model cluster nucleation and growth","authors":"Alexander Khrabry, Louis E.S. Hoffenberg, Igor D. Kaganovich, Yuri\n  Barsukov, David B. Graves","authorsParsed":[["Khrabry","Alexander",""],["Hoffenberg","Louis E. S.",""],["Kaganovich","Igor D.",""],["Barsukov","Yuri",""],["Graves","David B.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 16:41:43 GMT"}],"updateDate":"2024-08-30","timestamp":1724949703000,"abstract":"  Accurate Gibbs free energies of Fe clusters are required for predictive\nmodeling of Fe cluster growth during condensation of a cooling vapor. We\npresent a straightforward method of calculating free energies of cluster\nformation using the data provided by molecular dynamics (MD) simulations. We\napply this method to calculate free energies of Fe clusters having from 2 to\n100 atoms. The free energies are verified by comparing to an MD-simulated\nequilibrium cluster size distribution in a sub-saturated vapor. We show that\nthese free energies differ significantly from those obtained with a commonly\nused spherical cluster approximation - which relies on a surface tension\ncoefficient of a flat surface. The spherical cluster approximation can be\nimproved by using a cluster size-dependent Tolman correction for the surface\ntension. The values for the Tolman length and effective surface tension were\nderived, which differ from the commonly used experimentally measured surface\ntension based on the potential energy. This improved approximation does not\naccount for geometric magic number effects responsible for spikes and troughs\nin densities of neighbor cluster sizes. Nonetheless, it allows to model cluster\nformation from a cooling vapor and accurately reproduce the condensation\ntimeline, overall shape of the cluster size distribution, average cluster size,\nand the distribution width. Using a constant surface tension coefficient\nresulted in distorted condensation dynamics and inaccurate cluster size\ndistributions. The analytical expression for cluster nucleation rate from\nclassical nucleation theory (CNT) was updated to account for the\nsize-dependence of cluster surface tension.\n","subjects":["Condensed Matter/Materials Science","Physics/Chemical Physics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}