{"id":"2408.09571","title":"Exploring The Dynamical Nature and Radio Halo Emission of Abell 384: A\n  Combined Radio, X-ray and Optical Study","authors":"Swarna Chatterjee, Denisha Pillay, Abhirup Datta, Ramij Raja, Kenda\n  Knowles, Majidul Rahaman, S.P. Sikhosana","authorsParsed":[["Chatterjee","Swarna",""],["Pillay","Denisha",""],["Datta","Abhirup",""],["Raja","Ramij",""],["Knowles","Kenda",""],["Rahaman","Majidul",""],["Sikhosana","S. P.",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 19:00:02 GMT"}],"updateDate":"2024-08-20","timestamp":1724007602000,"abstract":"  Multiwavelength studies of galaxy clusters are crucial for understanding the\ncomplex interconnection of the thermal and non-thermal constituents of these\nmassive structures and uncovering the physical processes involved in their\nformation and evolution. Here, we report a multiwavelength assessment of the\ngalaxy cluster A384, which was previously reported to host a radio halo with a\n660 kpc size at MeerKAT 1.28 GHz. The halo is slightly offset from the cluster\ncentre. Our uGMRT observation reveals that the halo extends up to 690 kpc at\n407 MHz with a nonuniform spectral index $\\alpha^{1284}_{407}$ distribution\nvarying from flat (-0.5) to steep (-1.3) values. In addition, we use legacy\nGMRT 608 MHz, \\textit{XMM-Newton} X-ray, and the Dark Energy Survey optical\nobservations to obtain an extensive understanding of the dynamical nature of\nthe galaxy cluster. The X-ray surface brightness concentration parameter\n(c$_{SB}$ = 0.16) and centroid shift (w = 0.057) reveal an ongoing dynamical\ndisturbance in the cluster. This is also supported by the elongated 2-D optical\ngalaxy density distribution map of the cluster. We obtain an asymmetry\nparameter of 0.35 $\\pm$ 0.04 from optical analysis, further supporting the\ndynamical disturbance in the cluster. The radio and X-ray surface brightness\nfollows a sub-linear correlation. Our observation suggests that the cluster is\ncurrently in a merging state where particle re-acceleration in the turbulent\nICM resulted in the radio halo emission.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}