{"id":"2408.12356","title":"Radiative tail of solitary waves in an extended Korteweg-de Vries\n  equation","authors":"Muneeb Mushtaq","authorsParsed":[["Mushtaq","Muneeb",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 12:55:04 GMT"}],"updateDate":"2024-08-23","timestamp":1724331304000,"abstract":"  We solve the fifth-order Korteweg-de Vries (fKdV) equation which is a\nmodified KdV equation perturbed by a fifth-order derivative term multiplied by\na small parameter $\\epsilon^2$, with $0< \\epsilon \\ll 1$. Unlike the KdV\nequation, the stationary fKdV equation does not exhibit exactly localized\n1-soliton solution, instead it allows a solution which has a well defined\ncentral core similar to that of the KdV 1-soliton solution, accompanied by\nextremely small oscillatory standing wave tails on both sides of the core. The\namplitude of the standing wave tail oscillations is\n$\\mathcal{O}(\\exp(-1/\\epsilon))$, i.e. it is beyond all orders small in\nperturbation theory. The analytical computation of the amplitude of these\ntranscendentally small tail oscillations has been carried out up to\n$\\mathcal{O}(\\epsilon^5)$ order corrections by using the complex method of\nmatched asymptotics. Also the long-standing discrepancy between the\n$\\mathcal{O}(\\epsilon^2)$ perturbative result of Grimshaw and Joshi (1995) and\nthe numerical results of Boyd (1995) has been resolved. In addition to the\nstationary symmetric weakly localized solitary wave-like solutions, we analyzed\nthe stationary asymmetric solutions of the fKdV equation which decay\nexponentially to zero on one side of the (slightly asymmetric) core and blows\nup to large negative values on other side of the core. The asymmetry is\nquantified by computing the third derivative of the solution at the origin\nwhich also turns out to be beyond all orders small in perturbation theory. The\nanalytical computation of the third derivative of a function at the origin has\nalso been carried out up to $\\mathcal{O}(\\epsilon^5)$ order corrections. We use\nthe exponentially convergent pseudo-spectral method to solve the fKdV equation\nnumerically. The analytical and the numerical results show remarkable\nagreement.\n","subjects":["Nonlinear Sciences/Pattern Formation and Solitons"],"license":"http://creativecommons.org/licenses/by/4.0/"}