{"id":"2408.15669","title":"Casting Light on Degeneracies: A Comprehensive Study of Lightcurve\n  Variations in Microlensing Events OGLE-2017-BLG-0103 and OGLE-2017-BLG-0192","authors":"Sarang Shah","authorsParsed":[["Shah","Sarang",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 09:42:26 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 11:28:02 GMT"}],"updateDate":"2024-08-30","timestamp":1724838146000,"abstract":"  This study investigates orbital parallax in gravitational microlensing\nevents, focusing on OGLE-2017-BLG-0103 and OGLE-2017-BLG-0192. For events with\ntimescales $\\leq$ 60 days, a Jerk Parallax degeneracy arises due to high Jerk\nvelocity ($\\tilde{v_{j}}$), causing a four-fold continuous parallax degeneracy.\nOGLE-2017-BLG-0103, after incorporating orbital parallax, reveals four discrete\ndegenerate parallax solutions, while OGLE-2017-BLG-0192 exhibits four discrete\nsolutions without degeneracy. {The asymmetric light curve of OGLE-2017-BLG-0103\nsuggests a more probable model where xallarap is added to the parallax model,\nintroducing tension. The galactic model analysis predicts a very low mass\nstellar lens for OGLE-2017-BLG-0192. For OGLE-2017-BLG-0103, degenerate\nsolutions suggest a low-mass star or a darker lens in the disc, while the\nXallarap+Parallax model also predicts a stellar lens in the bulge, with the\nsource being a solar-type star orbited by a dwarf star.} This study presents\nfive degenerate solutions for OGLE-2017-BLG-0103, emphasizing the potential for\nconfirmation through high-resolution Adaptive Optics (AO) observations with\nExtremely Large Telescopes in the future. The complexities of degenerate\nscenarios in these microlensing events underscore the need to analyze special\nsingle-lens events in the Roman Telescope Era.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}