{"id":"2408.07257","title":"Competing addition processes give distinct growth regimes in the\n  assembly of 1D filaments","authors":"Sk Ashif Akram, Tyler Brown, Stephen Whitelam, Georg Meisl, Tuomas\n  P.J. Knowles and Jeremy D. Schmit","authorsParsed":[["Akram","Sk Ashif",""],["Brown","Tyler",""],["Whitelam","Stephen",""],["Meisl","Georg",""],["Knowles","Tuomas P. J.",""],["Schmit","Jeremy D.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 02:25:21 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 14:47:27 GMT"}],"updateDate":"2024-08-16","timestamp":1723602321000,"abstract":"  We present a model to describe the concentration-dependent growth of protein\nfilaments. Our model contains two states, a low entropy/high affinity ordered\nstate and a high entropy/low affinity disordered state. Consistent with\nexperiments, our model shows a diffusion-limited linear growth regime at low\nconcentration, followed by a concentration independent plateau at intermediate\nconcentrations, and rapid disordered precipitation at the highest\nconcentrations. We show that growth in the linear and plateau regions is the\nresult of two processes that compete amid the rapid binding and unbinding of\nnon-specific states. The first process is the addition of ordered molecules\nduring the periods where the end of the filament is free of incorrectly bound\nmolecules. The second process is the capture of defects, which occurs when\nconsecutive ordered additions occur on top of incorrectly bound molecules. We\nshow that a key molecular property is the probability that a diffusive\ncollision results in a correctly bound state. Small values of this probability\nsuppress the defect capture growth mode, resulting in a plateau in the growth\nrate when incorrectly bound molecules become common enough to poison ordered\ngrowth. We show that conditions that non-specifically suppress or enhance\nintermolecular interactions, such as the addition of depletants or osmolytes,\nhave opposite effects on the growth rate in the linear and plateau regimes. In\nthe linear regime stronger interactions promote growth by reducing dissolution\nevents, but in the plateau regime stronger interactions inhibit growth by\nstabilizing incorrectly bound molecules.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pcMOwZ7Tqh5QPpvz8j7gDCcOISBXjD6cbehHRB8joKE","pdfSize":"1066362"}
