{"id":"2408.16333","title":"Self-Improving Diffusion Models with Synthetic Data","authors":"Sina Alemohammad, Ahmed Imtiaz Humayun, Shruti Agarwal, John\n  Collomosse, Richard Baraniuk","authorsParsed":[["Alemohammad","Sina",""],["Humayun","Ahmed Imtiaz",""],["Agarwal","Shruti",""],["Collomosse","John",""],["Baraniuk","Richard",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 08:12:18 GMT"}],"updateDate":"2024-08-30","timestamp":1724919138000,"abstract":"  The artificial intelligence (AI) world is running out of real data for\ntraining increasingly large generative models, resulting in accelerating\npressure to train on synthetic data. Unfortunately, training new generative\nmodels with synthetic data from current or past generation models creates an\nautophagous (self-consuming) loop that degrades the quality and/or diversity of\nthe synthetic data in what has been termed model autophagy disorder (MAD) and\nmodel collapse. Current thinking around model autophagy recommends that\nsynthetic data is to be avoided for model training lest the system deteriorate\ninto MADness. In this paper, we take a different tack that treats synthetic\ndata differently from real data. Self-IMproving diffusion models with Synthetic\ndata (SIMS) is a new training concept for diffusion models that uses\nself-synthesized data to provide negative guidance during the generation\nprocess to steer a model's generative process away from the non-ideal synthetic\ndata manifold and towards the real data distribution. We demonstrate that SIMS\nis capable of self-improvement; it establishes new records based on the\nFr\\'echet inception distance (FID) metric for CIFAR-10 and ImageNet-64\ngeneration and achieves competitive results on FFHQ-64 and ImageNet-512.\nMoreover, SIMS is, to the best of our knowledge, the first prophylactic\ngenerative AI algorithm that can be iteratively trained on self-generated\nsynthetic data without going MAD. As a bonus, SIMS can adjust a diffusion\nmodel's synthetic data distribution to match any desired in-domain target\ndistribution to help mitigate biases and ensure fairness.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GHdrAoK7rSbWZQUfnw0uF9B_DoSgxrJ02uF3NE1k270","pdfSize":"20739148"}
