{"id":"2408.06722","title":"Quantum cloning transformation unlocks the potential of W class of\n  states in a secret sharing protocol","authors":"Rashi Jain and Satyabrata Adhikari","authorsParsed":[["Jain","Rashi",""],["Adhikari","Satyabrata",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 08:27:58 GMT"}],"updateDate":"2024-08-14","timestamp":1723537678000,"abstract":"  One of the most challenging problems is to share a secret because the sender\ndoes not trust the receiver completely. Thus, the sender provides one part of\nthe information to the receiver and shares the other part of the information to\na third party on whom the sender can rely. The secret can be revealed when the\nreceiver and the third party agree to cooperate. This is the essence of the\nsecret-sharing protocol. A lot of studies have been done on it using the\nthree-qubit GHZ state, and only a few works have involved the W state. In this\nwork, we introduce a quantum secret sharing protocol exploiting a three-qubit W\nclass of state shared between three parties, Alice (Sender), Bob (Mediator),\nand Charlie (Receiver). In the proposed protocol, the shared state parameters\nand the secret are linked in such a way that it is very difficult to factor\nthem. We will show that these parameters can be factored out easily if the\nreceiver uses a quantum cloning machine (QCM) and thus can retrieve the secret.\nWe find that the protocol is probabilistic and have calculated the probability\nof success of the protocol. Further, we establish the relation between the\nsuccess probability and the efficiency of the QCM. In general, we find that the\nefficiency of the constructed QCM is greater than or equal to $\\frac{1}{3}$,\nbut we have shown that its efficiency can be enhanced when the parameters of\nthe shared state are used as the parameters of the QCM. Moreover, we derived\nthe linkage between the probability of success and the amount of entanglement\nin the shared W class of state. We analyzed the obtained result and found that\neven a less entangled W class of state can also play a vital role in the\nproposed secret-sharing scheme.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}