{"id":"2408.06397","title":"Distributed Stackelberg Strategies in State-based Potential Games for\n  Autonomous Decentralized Learning Manufacturing Systems","authors":"Steve Yuwono, Dorothea Schwung, Andreas Schwung","authorsParsed":[["Yuwono","Steve",""],["Schwung","Dorothea",""],["Schwung","Andreas",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 08:24:54 GMT"}],"updateDate":"2024-08-14","timestamp":1723451094000,"abstract":"  This article describes a novel game structure for autonomously optimizing\ndecentralized manufacturing systems with multi-objective optimization\nchallenges, namely Distributed Stackelberg Strategies in State-Based Potential\nGames (DS2-SbPG). DS2-SbPG integrates potential games and Stackelberg games,\nwhich improves the cooperative trade-off capabilities of potential games and\nthe multi-objective optimization handling by Stackelberg games. Notably, all\ntraining procedures remain conducted in a fully distributed manner. DS2-SbPG\noffers a promising solution to finding optimal trade-offs between objectives by\neliminating the complexities of setting up combined objective optimization\nfunctions for individual players in self-learning domains, particularly in\nreal-world industrial settings with diverse and numerous objectives between the\nsub-systems. We further prove that DS2-SbPG constitutes a dynamic potential\ngame that results in corresponding converge guarantees. Experimental validation\nconducted on a laboratory-scale testbed highlights the efficacy of DS2-SbPG and\nits two variants, such as DS2-SbPG for single-leader-follower and Stack\nDS2-SbPG for multi-leader-follower. The results show significant reductions in\npower consumption and improvements in overall performance, which signals the\npotential of DS2-SbPG in real-world applications.\n","subjects":["Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}