{"id":"2408.06077","title":"Disentangling the dust and gas contributions of the JWST/MIRI spectrum\n  of Sz28","authors":"T. Kaeufer, P. Woitke, I. Kamp, J. Kanwar, M. Min","authorsParsed":[["Kaeufer","T.",""],["Woitke","P.",""],["Kamp","I.",""],["Kanwar","J.",""],["Min","M.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 11:52:32 GMT"}],"updateDate":"2024-08-13","timestamp":1723463552000,"abstract":"  Recent spectra of protoplanetary disks around very low-mass stars (VLMS),\ncaptured by the Mid-InfraRed Instrument (MIRI) on board the James Webb Space\nTelescope (JWST), reveal a rich carbon chemistry. Current interpretations of\nthese spectra are based on 0D slab models and provide valuable estimates for\nmolecular emission temperatures and column densities in the innermost disk.\nHowever, the established fitting procedures and simplified models are\nchallenged by the many overlapping gas features. We aim to simultaneously\ndetermine the molecular and the dust composition of the disk around the VLMS\nSz28 in a Bayesian way. We model the JWST/MIRI spectrum of Sz28 up to $17\\,\\rm\n\\mu m$ using the Dust Continuum Kit with Line emission from Gas (DuCKLinG).\nSystematically excluding different molecules from the Bayesian analysis allows\nfor an evidence determination of all investigated molecules and isotopologues.\nWe continue by examining the emission conditions and locations of all\nmolecules, analysing the differences to previous 0D slab fitting, and analysing\nthe dust composition. We find very strong Bayesian evidence for the presence of\nC2H2, HCN, C6H6, CO2, HC3N, C2H6, C3H4, C4H2, and CH4 in the JWST/MIRI spectrum\nof Sz28. Additionally, we identify CH3 and find tentative indications for NH3.\nThere is no evidence for water in the spectrum. However, we show that column\ndensities of up to $2\\times10^{17}\\,\\rm cm^{-2}$ could be hidden in the\nobservational noise if assuming similar emission conditions of water as the\ndetected hydrocarbons. Contrary to previous 0D slab results, a C4H2\nquasi-continuum is robustly identified. We expect some of the stated\ndifferences to previous 0D slab fitting results to arise from an updated data\nreduction of the spectrum, but also due to the different modelling process. The\nlatter reason underpins the need for more advanced models and fitting\nprocedures.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}