{"id":"2408.09151","title":"Realistic Extreme Image Rescaling via Generative Latent Space Learning","authors":"Ce Wang and Wanjie Sun and Zhenzhong Chen","authorsParsed":[["Wang","Ce",""],["Sun","Wanjie",""],["Chen","Zhenzhong",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 09:51:42 GMT"}],"updateDate":"2024-08-20","timestamp":1723888302000,"abstract":"  Image rescaling aims to learn the optimal downscaled low-resolution (LR)\nimage that can be accurately reconstructed to its original high-resolution (HR)\ncounterpart. This process is crucial for efficient image processing and\nstorage, especially in the era of ultra-high definition media. However, extreme\ndownscaling factors pose significant challenges due to the highly ill-posed\nnature of the inverse upscaling process, causing existing methods to struggle\nin generating semantically plausible structures and perceptually rich textures.\nIn this work, we propose a novel framework called Latent Space Based Image\nRescaling (LSBIR) for extreme image rescaling tasks. LSBIR effectively\nleverages powerful natural image priors learned by a pre-trained text-to-image\ndiffusion model to generate realistic HR images. The rescaling is performed in\nthe latent space of a pre-trained image encoder and decoder, which offers\nbetter perceptual reconstruction quality due to its stronger sparsity and\nricher semantics. LSBIR adopts a two-stage training strategy. In the first\nstage, a pseudo-invertible encoder-decoder models the bidirectional mapping\nbetween the latent features of the HR image and the target-sized LR image. In\nthe second stage, the reconstructed features from the first stage are refined\nby a pre-trained diffusion model to generate more faithful and visually\npleasing details. Extensive experiments demonstrate the superiority of LSBIR\nover previous methods in both quantitative and qualitative evaluations. The\ncode will be available at: https://github.com/wwangcece/LSBIR.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}