{"id":"2408.06113","title":"IIT Bombay Racing Driverless: Autonomous Driving Stack for Formula\n  Student AI","authors":"Yash Rampuria, Deep Boliya, Shreyash Gupta, Gopalan Iyengar, Ayush\n  Rohilla, Mohak Vyas, Chaitanya Langde, Mehul Vijay Chanda, Ronak Gautam\n  Matai, Kothapalli Namitha, Ajinkya Pawar, Bhaskar Biswas, Nakul Agarwal,\n  Rajit Khandelwal, Rohan Kumar, Shubham Agarwal, Vishwam Patel, Abhimanyu\n  Singh Rathore, Amna Rahman, Ayush Mishra, Yash Tangri","authorsParsed":[["Rampuria","Yash",""],["Boliya","Deep",""],["Gupta","Shreyash",""],["Iyengar","Gopalan",""],["Rohilla","Ayush",""],["Vyas","Mohak",""],["Langde","Chaitanya",""],["Chanda","Mehul Vijay",""],["Matai","Ronak Gautam",""],["Namitha","Kothapalli",""],["Pawar","Ajinkya",""],["Biswas","Bhaskar",""],["Agarwal","Nakul",""],["Khandelwal","Rajit",""],["Kumar","Rohan",""],["Agarwal","Shubham",""],["Patel","Vishwam",""],["Rathore","Abhimanyu Singh",""],["Rahman","Amna",""],["Mishra","Ayush",""],["Tangri","Yash",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 12:49:00 GMT"}],"updateDate":"2024-08-13","timestamp":1723466940000,"abstract":"  This work presents the design and development of IIT Bombay Racing's Formula\nStudent style autonomous racecar algorithm capable of running at the racing\nevents of Formula Student-AI, held in the UK. The car employs a cutting-edge\nsensor suite of the compute unit NVIDIA Jetson Orin AGX, 2 ZED2i stereo\ncameras, 1 Velodyne Puck VLP16 LiDAR and SBG Systems Ellipse N GNSS/INS IMU. It\nfeatures deep learning algorithms and control systems to navigate complex\ntracks and execute maneuvers without any human intervention. The design process\ninvolved extensive simulations and testing to optimize the vehicle's\nperformance and ensure its safety. The algorithms have been tested on a small\nscale, in-house manufactured 4-wheeled robot and on simulation software. The\nresults obtained for testing various algorithms in perception, simultaneous\nlocalization and mapping, path planning and controls have been detailed.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}