{"id":"2408.04128","title":"Splitting Methods for Computing Matrix Functions (Elements) Based on\n  Non-Zero Diagonals Positions","authors":"Majed Hamadi and Nezam Mahdavi-Amiri","authorsParsed":[["Hamadi","Majed",""],["Mahdavi-Amiri","Nezam",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 23:29:59 GMT"}],"updateDate":"2024-08-09","timestamp":1723073399000,"abstract":"  In applications, we often need to compute functions of matrices, such as\nbanded matrices, the Kronecker sum of banded matrices, Toeplitz matrices, and\nmany other types, which all share the common feature that their non-zero\nelements are concentrated around certain diagonals. We approximate matrix\nfunctions by considering the positions of non-zero diagonals in the original\nmatrix. Focusing on non-zero diagonals provides us with simple algorithms to be\nused as tools to reduce complexity of other algorithms for computing matrix\nfunctions. Here, we first establish a decay bound for elements of matrix\nfunctions using the non-zero diagonals. Then, we develop methods that involve\ndividing the problem of computing matrix functions into functions of some\nsubmatrices of the original matrix. The size of these submatrices depends on\nthe positions and number of non-zero diagonals in a monomial of the original\nmatrix, ranging from degree zero to a given degree. For Toeplitz matrices, we\ndemonstrate that our method turns to a simpler algorithm and works more\nefficiently. The convergence analysis of our proposed methods is conducted by\nestablishing connections to the best polynomial approximation. When only\nspecific elements or the trace of matrix functions are required, we derive\nsubmatrices from the original matrix based solely on the indices of the\nelements of interest. Additionally, for the special case of banded-symmetric\nToeplitz matrices, we derive an approximation for elements of matrix functions\nwith geometrically reducing error, using closed-form formulas that depend\nsolely on the indices of the elements.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}