{"id":"2408.06602","title":"Super-intelligence or Superstition? Exploring Psychological Factors\n  Underlying Unwarranted Belief in AI Predictions","authors":"Eunhae Lee, Pat Pataranutaporn, Judith Amores, Pattie Maes","authorsParsed":[["Lee","Eunhae",""],["Pataranutaporn","Pat",""],["Amores","Judith",""],["Maes","Pattie",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 03:35:26 GMT"},{"version":"v2","created":"Mon, 19 Aug 2024 22:51:08 GMT"}],"updateDate":"2024-08-21","timestamp":1723520126000,"abstract":"  This study investigates psychological factors influencing belief in AI\npredictions about personal behavior, comparing it to belief in astrology and\npersonality-based predictions. Through an experiment with 238 participants, we\nexamined how cognitive style, paranormal beliefs, AI attitudes, personality\ntraits, and other factors affect perceived validity, reliability, usefulness,\nand personalization of predictions from different sources. Our findings reveal\nthat belief in AI predictions is positively correlated with belief in\npredictions based on astrology and personality psychology. Notably, paranormal\nbeliefs and positive AI attitudes significantly increased perceived validity,\nreliability, usefulness, and personalization of AI predictions.\nConscientiousness was negatively correlated with belief in predictions across\nall sources, and interest in the prediction topic increased believability\nacross predictions. Surprisingly, cognitive style did not significantly\ninfluence belief in predictions. These results highlight the \"rational\nsuperstition\" phenomenon in AI, where belief is driven more by mental\nheuristics and intuition than critical evaluation. We discuss implications for\ndesigning AI systems and communication strategies that foster appropriate trust\nand skepticism. This research contributes to our understanding of the\npsychology of human-AI interaction and offers insights for the design and\ndeployment of AI systems.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}