{"id":"2408.07983","title":"ArabLegalEval: A Multitask Benchmark for Assessing Arabic Legal\n  Knowledge in Large Language Models","authors":"Faris Hijazi (1), Somayah AlHarbi (1), Abdulaziz AlHussein (1),\n  Harethah Abu Shairah (2), Reem AlZahrani (2), Hebah AlShamlan (1), Omar Knio\n  (2), George Turkiyyah (2) ((1) THIQAH, (2) KAUST)","authorsParsed":[["Hijazi","Faris","","THIQAH"],["AlHarbi","Somayah","","THIQAH"],["AlHussein","Abdulaziz","","THIQAH"],["Shairah","Harethah Abu","","KAUST"],["AlZahrani","Reem","","KAUST"],["AlShamlan","Hebah","","THIQAH"],["Knio","Omar","","KAUST"],["Turkiyyah","George","","KAUST"]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 07:09:51 GMT"}],"updateDate":"2024-08-16","timestamp":1723705791000,"abstract":"  The rapid advancements in Large Language Models (LLMs) have led to\nsignificant improvements in various natural language processing tasks. However,\nthe evaluation of LLMs' legal knowledge, particularly in non-English languages\nsuch as Arabic, remains under-explored. To address this gap, we introduce\nArabLegalEval, a multitask benchmark dataset for assessing the Arabic legal\nknowledge of LLMs. Inspired by the MMLU and LegalBench datasets, ArabLegalEval\nconsists of multiple tasks sourced from Saudi legal documents and synthesized\nquestions. In this work, we aim to analyze the capabilities required to solve\nlegal problems in Arabic and benchmark the performance of state-of-the-art\nLLMs. We explore the impact of in-context learning and investigate various\nevaluation methods. Additionally, we explore workflows for generating questions\nwith automatic validation to enhance the dataset's quality. We benchmark\nmultilingual and Arabic-centric LLMs, such as GPT-4 and Jais, respectively. We\nalso share our methodology for creating the dataset and validation, which can\nbe generalized to other domains. We hope to accelerate AI research in the\nArabic Legal domain by releasing the ArabLegalEval dataset and code:\nhttps://github.com/Thiqah/ArabLegalEval\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eI2zVLBdBscpuQcZ5SWBGJXxNmXs_y696jtYzwd5OP8","pdfSize":"4106128"}
