{"id":"2408.07459","title":"On the convergence of cosmographic expansions in Lemaitre-Tolman-Bondi\n  models","authors":"Asha B. Modan and S. M. Koksbang","authorsParsed":[["Modan","Asha B.",""],["Koksbang","S. M.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 11:04:21 GMT"}],"updateDate":"2024-08-15","timestamp":1723633461000,"abstract":"  We study cosmographic expansions of the luminosity distance for a variety of\nLemaitre-Tolman-Bondi models which we specify inspired by local large-scale\nstructures of the universe. We consider cosmographic expansions valid for\ngeneral spacetimes and compare to the Friedmann-Lemaitre-Robertson-Walker\n(FLRW) limit of the expansions as well as to its naive isotropic extrapolation\nto an inhomogeneous universe. The FLRW expansions are often poor near the\nobserver but become better at higher redshifts, where the light rays have\nreached the FLRW background. In line with this we find that the effective\nHubble, deceleration and jerk parameters of the general cosmographic expansion\nare often very different from the global $\\Lambda$CDM values, with deviations\nup to several orders of magnitude. By comparing with the naive isotropic\nextrapolation of the FLRW expansion, we assess that these large deviations are\nmainly due to anisotropy. Very close to the observer, the general cosmographic\nexpansion is always best and becomes more precise when more expansion terms are\nincluded. However, we find that the convergence radius of the general\ncosmographic expansion is small for all studied models and observers and the\ngeneral cosmographic expansion becomes poor for several observers already\nbefore a single LTB structure has been traversed. The small radius of\nconvergence of the general cosmographic expansion has also been indicated by\nearlier work and may need careful attention before we can safely apply the\ngeneral cosmographic expansion to real data.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}