{"id":"2408.03942","title":"White matter tract crossing and bottleneck regions in the fetal brain","authors":"Camilo Calixto, Matheus D. Soldatelli, Bo Li, Lana Pierotich, Ali\n  Gholipour, Simon K. Warfield, Davood Karimi","authorsParsed":[["Calixto","Camilo",""],["Soldatelli","Matheus D.",""],["Li","Bo",""],["Pierotich","Lana",""],["Gholipour","Ali",""],["Warfield","Simon K.",""],["Karimi","Davood",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 21:20:50 GMT"}],"updateDate":"2024-08-09","timestamp":1721510450000,"abstract":"  There is a growing interest in using diffusion MRI to study the white matter\ntracts and structural connectivity of the fetal brain. Recent progress in data\nacquisition and processing suggests that this imaging modality has a unique\nrole in elucidating the normal and abnormal patterns of neurodevelopment in\nutero. However, there have been no efforts to quantify the prevalence of\ncrossing tracts and bottleneck regions, important issues that have been\nextensively researched for adult brains. In this work, we determined the brain\nregions with crossing tracts and bottlenecks between 23 and 36 gestational\nweeks. We performed probabilistic tractography on 59 fetal brain scans and\nextracted a set of 51 distinct white tracts, which we grouped into 10 major\ntract bundle groups. We analyzed the results to determine the patterns of tract\ncrossings and bottlenecks. Our results showed that 20-25% of the white matter\nvoxels included two or three crossing tracts. Bottlenecks were more prevalent.\nBetween 75-80% of the voxels were characterized as bottlenecks, with more than\n40% of the voxels involving four or more tracts. The results of this study\nhighlight the challenge of fetal brain tractography and structural connectivity\nassessment and call for innovative image acquisition and analysis methods to\nmitigate these problems.\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"MxRzJ5eblt74b2qTkEvAQjbH6IAqUUovnBZ6sWMZe-k","pdfSize":"10062689"}
