{"id":"2408.11793","title":"Leveraging Chemistry Foundation Models to Facilitate Structure Focused\n  Retrieval Augmented Generation in Multi-Agent Workflows for Catalyst and\n  Materials Design","authors":"Nathaniel H. Park, Tiffany J. Callahan, James L. Hedrick, Tim Erdmann,\n  Sara Capponi","authorsParsed":[["Park","Nathaniel H.",""],["Callahan","Tiffany J.",""],["Hedrick","James L.",""],["Erdmann","Tim",""],["Capponi","Sara",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 17:25:45 GMT"}],"updateDate":"2024-08-22","timestamp":1724261145000,"abstract":"  Molecular property prediction and generative design via deep learning models\nhas been the subject of intense research given its potential to accelerate\ndevelopment of new, high-performance materials. More recently, these workflows\nhave been significantly augmented with the advent of large language models\n(LLMs) and systems of LLM-driven agents capable of utilizing pre-trained models\nto make predictions in the context of more complex research tasks. While\neffective, there is still room for substantial improvement within the agentic\nsystems on the retrieval of salient information for material design tasks.\nMoreover, alternative uses of predictive deep learning models, such as\nleveraging their latent representations to facilitate cross-modal retrieval\naugmented generation within agentic systems to enable task-specific materials\ndesign, has remained unexplored. Herein, we demonstrate that large, pre-trained\nchemistry foundation models can serve as a basis for enabling semantic\nchemistry information retrieval for both small-molecules, complex polymeric\nmaterials, and reactions. Additionally, we show the use of chemistry foundation\nmodels in conjunction with image models such as OpenCLIP facilitate\nunprecedented queries and information retrieval across multiple\ncharacterization data domains. Finally, we demonstrate the integration of these\nsystems within multi-agent systems to facilitate structure and\ntopological-based natural language queries and information retrieval for\ncomplex research tasks.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"hbJDDLIXUkABA8KTcy7kqLf_JzBmaNCW08AbB3IMVRU","pdfSize":"1552804"}
