{"id":"2408.08388","title":"Classification of High-dimensional Time Series in Spectral Domain using\n  Explainable Features","authors":"Sarbojit Roy, Malik Shahid Sultan and Hernando Ombao","authorsParsed":[["Roy","Sarbojit",""],["Sultan","Malik Shahid",""],["Ombao","Hernando",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 19:10:12 GMT"}],"updateDate":"2024-08-19","timestamp":1723749012000,"abstract":"  Interpretable classification of time series presents significant challenges\nin high dimensions. Traditional feature selection methods in the frequency\ndomain often assume sparsity in spectral density matrices (SDMs) or their\ninverses, which can be restrictive for real-world applications. In this\narticle, we propose a model-based approach for classifying high-dimensional\nstationary time series by assuming sparsity in the difference between inverse\nSDMs. Our approach emphasizes the interpretability of model parameters, making\nit especially suitable for fields like neuroscience, where understanding\ndifferences in brain network connectivity across various states is crucial. The\nestimators for model parameters demonstrate consistency under appropriate\nconditions. We further propose using standard deep learning optimizers for\nparameter estimation, employing techniques such as mini-batching and learning\nrate scheduling. Additionally, we introduce a method to screen the most\ndiscriminatory frequencies for classification, which exhibits the sure\nscreening property under general conditions. The flexibility of the proposed\nmodel allows the significance of covariates to vary across frequencies,\nenabling nuanced inferences and deeper insights into the underlying problem.\nThe novelty of our method lies in the interpretability of the model parameters,\naddressing critical needs in neuroscience. The proposed approaches have been\nevaluated on simulated examples and the `Alert-vs-Drowsy' EEG dataset.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/"}