{"id":"2408.06891","title":"Automatic Feature Recognition and Dimensional Attributes Extraction From\n  CAD Models for Hybrid Additive-Subtractive Manufacturing","authors":"Muhammad Tayyab Khan, Wenhe Feng, Lequn Chen, Ye Han Ng, Nicholas Yew\n  Jin Tan, Seung Ki Moon","authorsParsed":[["Khan","Muhammad Tayyab",""],["Feng","Wenhe",""],["Chen","Lequn",""],["Ng","Ye Han",""],["Tan","Nicholas Yew Jin",""],["Moon","Seung Ki",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 13:38:32 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 05:16:46 GMT"}],"updateDate":"2024-08-15","timestamp":1723556312000,"abstract":"  The integration of Computer-Aided Design (CAD), Computer-Aided Process\nPlanning (CAPP), and Computer-Aided Manufacturing (CAM) plays a crucial role in\nmodern manufacturing, facilitating seamless transitions from digital designs to\nphysical products. However, a significant challenge within this integration is\nthe Automatic Feature Recognition (AFR) of CAD models, especially in the\ncontext of hybrid manufacturing that combines subtractive and additive\nmanufacturing processes. Traditional AFR methods, focused mainly on the\nidentification of subtractive (machined) features including holes, fillets,\nchamfers, pockets, and slots, fail to recognize features pertinent to additive\nmanufacturing. Furthermore, the traditional methods fall short in accurately\nextracting geometric dimensions and orientations, which are also key factors\nfor effective manufacturing process planning. This paper presents a novel\napproach for creating a synthetic CAD dataset that encompasses features\nrelevant to both additive and subtractive machining through Python Open\nCascade. The Hierarchical Graph Convolutional Neural Network (HGCNN) model is\nimplemented to accurately identify the composite additive-subtractive features\nwithin the synthetic CAD dataset. The key novelty and contribution of the\nproposed methodology lie in its ability to recognize a wide range of\nmanufacturing features, and precisely extracting their dimensions,\norientations, and stock sizes. The proposed model demonstrates remarkable\nfeature recognition accuracy exceeding 97% and a dimension extraction accuracy\nof 100% for identified features. Therefore, the proposed methodology enhances\nthe integration of CAD, CAPP, and CAM within hybrid manufacturing by providing\nprecise feature recognition and dimension extraction. It facilitates improved\nmanufacturing process planning, by enabling more informed decision-making.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"6XZz5zfFAjDiPl7MPWQXxC_5a8O3R25-A0JyAcs5AsA","pdfSize":"1291002"}
