{"id":"2408.13416","title":"Accelerating material melting temperature predictions by implementing\n  machine learning potentials in the SLUSCHI package","authors":"Audrey CampBell, Ligen Wang, Qi-Jun Hong","authorsParsed":[["CampBell","Audrey",""],["Wang","Ligen",""],["Hong","Qi-Jun",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 00:51:04 GMT"}],"updateDate":"2024-08-27","timestamp":1724460664000,"abstract":"  The SLUSCHI (Solid and Liquid in Ultra Small Coexistence with Hovering\nInterfaces) automated package, with interface to the first-principles code VASP\n(Vienna Ab initio Simulation Package), was developed by us for efficiently\ndetermining the melting temperatures of various materials. However, performing\nmany molecular dynamics simulations for small liquid-solid coexisting\nsupercells to predict the melting temperature of a material is still\ncomputationally expensive, often requiring weeks and tens to hundreds of\nthousands of CPU hours to complete. In the present paper, we made an attempt to\ninterface the SLUSCHI package with the highly efficient molecular dynamics\nLAMMPS code and demonstrated that it achieves a much faster melting temperature\ndetermination, outperforming the original VASP-based approach by at least one\norder of magnitude. In our melting temperature calculations, the LAMMPS\nsimulations were performed based on the LASP (Large-scale Atomic Simulation)\nmachine learning potentials which are pre-built using first-principles data.\nBesides the dramatic CPU time reduction for melting temperature predictions the\ncalculated melting temperatures for various materials (simple and transition\nmetals, alloys, oxides and carbide) are reasonably accurate. Analysis of the\ncalculated results shows that 60% of the melting temperatures are within 200 K\nof experimental values with the RMSE value of 187 K which is slightly worse\nthan the first-principles DFT RMSE value of 151 K. Therefore, interfacing\nSLUSCHI with LAMMPS molecular dynamics simulations makes it possible to quickly\nscreen out the best candidates from numerous materials in a much more efficient\nway, and facilitate the rational design of materials within the framework of\nthe materials genome paradigm.\n","subjects":["Condensed Matter/Materials Science","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2cE0deEyxi5QSOHhEtzuvRO5J9CoEvWC3uxWqxkhGJg","pdfSize":"741364"}
