{"id":"2408.00724","title":"An Empirical Analysis of Compute-Optimal Inference for Problem-Solving\n  with Language Models","authors":"Yangzhen Wu, Zhiqing Sun, Shanda Li, Sean Welleck, Yiming Yang","authorsParsed":[["Wu","Yangzhen",""],["Sun","Zhiqing",""],["Li","Shanda",""],["Welleck","Sean",""],["Yang","Yiming",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 17:16:04 GMT"}],"updateDate":"2024-08-02","timestamp":1722532564000,"abstract":"  The optimal training configurations of large language models (LLMs) with\nrespect to model sizes and compute budgets have been extensively studied. But\nhow to optimally configure LLMs during inference has not been explored in\nsufficient depth. We study compute-optimal inference: designing models and\ninference strategies that optimally trade off additional inference-time compute\nfor improved performance. As a first step towards understanding and designing\ncompute-optimal inference methods, we assessed the effectiveness and\ncomputational efficiency of multiple inference strategies such as Greedy\nSearch, Majority Voting, Best-of-N, Weighted Voting, and their variants on two\ndifferent Tree Search algorithms, involving different model sizes and\ncomputational budgets. We found that a smaller language model with a novel tree\nsearch algorithm typically achieves a Pareto-optimal trade-off. These results\nhighlight the potential benefits of deploying smaller models equipped with more\nsophisticated decoding algorithms in budget-constrained scenarios, e.g., on\nend-devices, to enhance problem-solving accuracy. For instance, we show that\nthe Llemma-7B model can achieve competitive accuracy to a Llemma-34B model on\nMATH500 while using $2\\times$ less FLOPs. Our findings could potentially apply\nto any generation task with a well-defined measure of success.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1sYBq1yxSd1ot5sBTjmbZmdPTxGpsBtZmrHCVdBbDWg","pdfSize":"2014521","txDigest":"DHWfZfotsRX6sep4d2WAQJeAgsJzGnm1zDNZ6uWgip1j","endEpoch":"1","status":"CERTIFIED"}
