{"id":"2408.02836","title":"Delivery of DART Impact Ejecta to Mars and Earth: Opportunity for Meteor\n  Observations","authors":"Eloy Pe\\~na-Asensio, Michael K\\\"uppers, Josep M. Trigo-Rodr\\'iguez,\n  and Albert Rimola","authorsParsed":[["Peña-Asensio","Eloy",""],["Küppers","Michael",""],["Trigo-Rodríguez","Josep M.",""],["Rimola","Albert",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 21:19:38 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 17:14:47 GMT"}],"updateDate":"2024-09-02","timestamp":1722892778000,"abstract":"  NASA's DART and ESA's Hera missions offer a unique opportunity to investigate\nthe delivery of impact ejecta to other celestial bodies. We performed ejecta\ndynamical simulations using 3 million particles categorized into three size\npopulations (10 cm, 0.5 cm, and 30 $\\mu$m) and constrained by early post-impact\nLICIACube observations. The main simulation explored ejecta velocities ranging\nfrom 1 to 1,000 m/s, while a secondary simulation focused on faster ejecta with\nvelocities from 1 to 2 km/s. We identified DART ejecta orbits compatible with\nthe delivery of meteor-producing particles to Mars and Earth. Our results\nindicate the possibility of ejecta reaching the Mars Hill sphere in 13 years\nfor launch velocities around 450 m/s, which is within the observed range. Some\nejecta particles launched at 770 m/s could reach Mars's vicinity in 7 years.\nFaster ejecta resulted in a higher flux delivery towards Mars and particles\nimpacting the Earth Hill sphere above 1.5 km/s. The delivery process is\nslightly sensitive to the initial observed cone range and driven by synodic\nperiods. The launch locations for material delivery to Mars were predominantly\nnorthern the DART impact site, while they displayed a southwestern tendency for\nthe Earth-Moon system. Larger particles exhibit a marginally greater likelihood\nof reaching Mars, while smaller particles favor delivery to Earth-Moon,\nalthough this effect is insignificant. To support observational campaigns for\nDART-created meteors, we provide comprehensive information on the encounter\ncharacteristics (orbital elements and radiants) and quantify the orbital\ndecoherence degree of the released meteoroids.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}