{"id":"2408.05721","title":"Extracting Urban Sound Information for Residential Areas in Smart Cities\n  Using an End-to-End IoT System","authors":"Ee-Leng Tan, Furi Andi Karnapi, Linus Junjia Ng, Kenneth Ooi,\n  Woon-Seng Gan","authorsParsed":[["Tan","Ee-Leng",""],["Karnapi","Furi Andi",""],["Ng","Linus Junjia",""],["Ooi","Kenneth",""],["Gan","Woon-Seng",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 08:22:44 GMT"}],"updateDate":"2024-08-13","timestamp":1723364564000,"abstract":"  With rapid urbanization comes the increase of community, construction, and\ntransportation noise in residential areas. The conventional approach of solely\nrelying on sound pressure level (SPL) information to decide on the noise\nenvironment and to plan out noise control and mitigation strategies is\ninadequate. This paper presents an end-to-end IoT system that extracts\nreal-time urban sound metadata using edge devices, providing information on the\nsound type, location and duration, rate of occurrence, loudness, and azimuth of\na dominant noise in nine residential areas. The collected metadata on\nenvironmental sound is transmitted to and aggregated in a cloud-based platform\nto produce detailed descriptive analytics and visualization. Our approach to\nintegrating different building blocks, namely, hardware, software, cloud\ntechnologies, and signal processing algorithms to form our real-time IoT system\nis outlined. We demonstrate how some of the sound metadata extracted by our\nsystem are used to provide insights into the noise in residential areas. A\nscalable workflow to collect and prepare audio recordings from nine residential\nareas to construct our urban sound dataset for training and evaluating a\nlocation-agnostic model is discussed. Some practical challenges of managing and\nmaintaining a sensor network deployed at numerous locations are also addressed.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Sound"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8vzjv1laoxMZDbA7a5CRKqRLfEgpV-RcHHDzA7_FeRw","pdfSize":"1373759"}
