{"id":"2408.08618","title":"Colorectal cancer risk mapping through Bayesian Networks","authors":"Daniel Corrales, Alejandro Santos-Lozano, Susana L\\'opez-Ortiz,\n  Alejandro Lucia, David R\\'ios Insua","authorsParsed":[["Corrales","Daniel",""],["Santos-Lozano","Alejandro",""],["López-Ortiz","Susana",""],["Lucia","Alejandro",""],["Insua","David Ríos",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 09:17:39 GMT"},{"version":"v2","created":"Fri, 6 Sep 2024 10:12:33 GMT"}],"updateDate":"2024-09-09","timestamp":1723799859000,"abstract":"  Background and Objective: Only about 14 % of eligible EU citizens finally\nparticipate in colorectal cancer (CRC) screening programs despite it being the\nthird most common type of cancer worldwide. The development of CRC risk models\ncan enable predictions to be embedded in decision-support tools facilitating\nCRC screening and treatment recommendations. This paper develops a predictive\nmodel that aids in characterizing CRC risk groups and assessing the influence\nof a variety of risk factors on the population.\n  Methods: A CRC Bayesian Network is learnt by aggregating extensive expert\nknowledge and data from an observational study and making use of structure\nlearning algorithms to model the relations between variables. The network is\nthen parametrized to characterize these relations in terms of local probability\ndistributions at each of the nodes. It is finally used to predict the risks of\ndeveloping CRC together with the uncertainty around such predictions.\n  Results: A graphical CRC risk mapping tool is developed from the model and\nused to segment the population into risk subgroups according to variables of\ninterest. Furthermore, the network provides insights on the predictive\ninfluence of modifiable risk factors such as alcohol consumption and smoking,\nand medical conditions such as diabetes or hypertension linked to lifestyles\nthat potentially have an impact on an increased risk of developing CRC.\n  Conclusions: CRC is most commonly developed in older individuals. However,\nsome modifiable behavioral factors seem to have a strong predictive influence\non its potential risk of development. Modelling these effects facilitates\nidentifying risk groups and targeting influential variables which are\nsubsequently helpful in the design of screening and treatment programs.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}