{"id":"2408.00531","title":"ReSi: A Comprehensive Benchmark for Representational Similarity Measures","authors":"Max Klabunde, Tassilo Wald, Tobias Schumacher, Klaus Maier-Hein,\n  Markus Strohmaier, Florian Lemmerich","authorsParsed":[["Klabunde","Max",""],["Wald","Tassilo",""],["Schumacher","Tobias",""],["Maier-Hein","Klaus",""],["Strohmaier","Markus",""],["Lemmerich","Florian",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 13:08:02 GMT"}],"updateDate":"2024-08-02","timestamp":1722517682000,"abstract":"  Measuring the similarity of different representations of neural architectures\nis a fundamental task and an open research challenge for the machine learning\ncommunity. This paper presents the first comprehensive benchmark for evaluating\nrepresentational similarity measures based on well-defined groundings of\nsimilarity. The representational similarity (ReSi) benchmark consists of (i)\nsix carefully designed tests for similarity measures, (ii) 23 similarity\nmeasures, (iii) eleven neural network architectures, and (iv) six datasets,\nspanning over the graph, language, and vision domains. The benchmark opens up\nseveral important avenues of research on representational similarity that\nenable novel explorations and applications of neural architectures. We\ndemonstrate the utility of the ReSi benchmark by conducting experiments on\nvarious neural network architectures, real world datasets and similarity\nmeasures. All components of the benchmark are publicly available and thereby\nfacilitate systematic reproduction and production of research results. The\nbenchmark is extensible, future research can build on and further expand it. We\nbelieve that the ReSi benchmark can serve as a sound platform catalyzing future\nresearch that aims to systematically evaluate existing and explore novel ways\nof comparing representations of neural architectures.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dbzVNFNES7Aww3Vp2fBj2lq2vbdxDeVkNKakyITdl14","pdfSize":"6946923","txDigest":"KEVssnZ7P4G4SGTjvH84xB34RnfP6b6B4aMRLdNhMYb","endEpoch":"1","status":"CERTIFIED"}
