{"id":"2408.07324","title":"On-the-fly Synthesis for LTL over Finite Traces: An Efficient Approach\n  that Counts","authors":"Shengping Xiao, Yongkang Li, Shufang Zhu, Jun Sun, Jianwen Li, Geguang\n  Pu, Moshe Y. Vardi","authorsParsed":[["Xiao","Shengping",""],["Li","Yongkang",""],["Zhu","Shufang",""],["Sun","Jun",""],["Li","Jianwen",""],["Pu","Geguang",""],["Vardi","Moshe Y.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 06:52:58 GMT"}],"updateDate":"2024-08-15","timestamp":1723618378000,"abstract":"  We present an on-the-fly synthesis framework for Linear Temporal Logic over\nfinite traces (LTLf) based on top-down deterministic automata construction.\nExisting approaches rely on constructing a complete Deterministic Finite\nAutomaton (DFA) corresponding to the LTLf specification, a process with doubly\nexponential complexity relative to the formula size in the worst case. In this\ncase, the synthesis procedure cannot be conducted until the entire DFA is\nconstructed. This inefficiency is the main bottleneck of existing approaches.\nTo address this challenge, we first present a method for converting LTLf into\nTransition-based DFA (TDFA) by directly leveraging LTLf semantics,\nincorporating intermediate results as direct components of the final automaton\nto enable parallelized synthesis and automata construction. We then explore the\nrelationship between LTLf synthesis and TDFA games and subsequently develop an\nalgorithm for performing LTLf synthesis using on-the-fly TDFA game solving.\nThis algorithm traverses the state space in a global forward manner combined\nwith a local backward method, along with the detection of strongly connected\ncomponents. Moreover, we introduce two optimization techniques -- model-guided\nsynthesis and state entailment -- to enhance the practical efficiency of our\napproach. Experimental results demonstrate that our on-the-fly approach\nachieves the best performance on the tested benchmarks and effectively\ncomplements existing tools and approaches.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Logic in Computer Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}