{"id":"2408.12431","title":"The Hybrid Hospital: Balancing On-Site and Remote Hospitalization","authors":"Noa Zychlinski, Gal Mendelson, Andrew Daw","authorsParsed":[["Zychlinski","Noa",""],["Mendelson","Gal",""],["Daw","Andrew",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 14:24:33 GMT"}],"updateDate":"2024-08-23","timestamp":1724336673000,"abstract":"  Hybrid hospitals offer on-site and remote hospitalization through\ntelemedicine. These new healthcare models require novel operational policies to\nbalance costs, efficiency, and patient well-being. Our study addresses two\nfirst-order questions: (i) how to direct patient admission and call-in based on\nindividual characteristics and proximity and (ii) how to determine the optimal\nallocation of medical resources between these two hospitalization options and\namong different patient types.\n  We develop a model that uses Brownian Motion to capture the patient's health\nevolution during remote/on-site hospitalization and during travel. Under\ncost-minimizing call-in policies, we find that remote hospitalization can be\ncost-effective for moderately distant patients, as the optimal call-in\nthreshold is non-monotonic in the patient's travel time. Subject to scarce\nresources, the optimal solution structure becomes equivalent to a simultaneous,\nidentically sized increase of remote and on-site costs under abundant\nresources. When limited resources must be divided among multiple patient types,\nthe optimal thresholds shift in non-obvious ways as resource availability\nchanges. Finally, we develop a practical and efficient policy that allows for\nswapping an on-site patient with a remote patient when the latter is called-in\nand sufficient resources are not available to treat both on-site.\n  Contrary to the widely held view that telemedicine can mitigate rural and\nnon-rural healthcare disparities, our research suggests that on-site care may\nactually be more cost-effective than remote hospitalization for patients in\ndistant locations, due to (potentially overlooked) risks during patient travel.\nThis finding may be of particular concern in light of the growing number of\n``hospital deserts'' amid recent rural hospital closures, as these communities\nmay in fact not be well-served through at-home care.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}