{"id":"2408.12230","title":"Tuning THz magnons in a mixed van-der-Waals antiferromagnet","authors":"F. Le Mardele, I. Mohelsky, D. Jana, A. Pawbake, J. Dzian, W.-L. Lee,\n  K. Raju, R. Sankar, C. Faugeras, M. Potemski, M. E. Zhitomirsky, and M.\n  Orlita","authorsParsed":[["Mardele","F. Le",""],["Mohelsky","I.",""],["Jana","D.",""],["Pawbake","A.",""],["Dzian","J.",""],["Lee","W. -L.",""],["Raju","K.",""],["Sankar","R.",""],["Faugeras","C.",""],["Potemski","M.",""],["Zhitomirsky","M. E.",""],["Orlita","M.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 09:04:57 GMT"}],"updateDate":"2024-08-23","timestamp":1724317497000,"abstract":"  Alloying stands out as a pivotal technological method employed across various\ncompounds, be they metallic, magnetic, or semiconducting, serving to fine-tune\ntheir properties to meet specific requirements. Ternary semiconductors\nrepresent a prominent example of such alloys. They offer fine-tuning of\nelectronic bands, the band gap in particular, thus granting the technology of\nsemiconductor heterostructures devices, key elements in current electronics and\noptoelectronics. In the realm of magnetically ordered systems, akin to\nelectronic bands in solids, spin waves exhibit characteristic dispersion\nrelations, featuring sizeable magnon gaps in many antiferromagnets. The\nengineering of the magnon gap constitutes a relevant direction in current\nresearch on antiferromagnets, aiming to leverage their distinct properties for\nTHz technologies, spintronics, or magnonics. In this study, we showcase the\ntunability of the magnon gap across the THz spectral range within an alloy\ncomprising representative semiconducting van-der-Waals antiferromagnets\nFePS$_3$ and NiPS$_3$. These constituents share identical in-plane crystal\nstructures, magnetic unit cells and the direction of the magnetic anisotropy,\nbut differ in the amplitude and sign of the latter. Altogether these attributes\nresult in the wide tunability of the magnon gap in the Fe$_{1-x}$Ni$_x$PS$_3$\nalloy in which the magnetic order is imposed by stronger, perpendicular\nanisotropy of iron.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}