{"id":"2408.06872","title":"Generative AI Tools in Academic Research: Applications and Implications\n  for Qualitative and Quantitative Research Methodologies","authors":"Mike Perkins (1), Jasper Roe (2) ((1) British University Vietnam, (2)\n  James Cook University Singapore)","authorsParsed":[["Perkins","Mike",""],["Roe","Jasper",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 13:10:03 GMT"}],"updateDate":"2024-08-14","timestamp":1723554603000,"abstract":"  This study examines the impact of Generative Artificial Intelligence (GenAI)\non academic research, focusing on its application to qualitative and\nquantitative data analysis. As GenAI tools evolve rapidly, they offer new\npossibilities for enhancing research productivity and democratising complex\nanalytical processes. However, their integration into academic practice raises\nsignificant questions regarding research integrity and security, authorship,\nand the changing nature of scholarly work. Through an examination of current\ncapabilities and potential future applications, this study provides insights\ninto how researchers may utilise GenAI tools responsibly and ethically.\n  We present case studies that demonstrate the application of GenAI in various\nresearch methodologies, discuss the challenges of replicability and consistency\nin AI-assisted research, and consider the ethical implications of increased AI\nintegration in academia. This study explores both qualitative and quantitative\napplications of GenAI, highlighting tools for transcription, coding, thematic\nanalysis, visual analytics, and statistical analysis. By addressing these\nissues, we aim to contribute to the ongoing discourse on the role of AI in\nshaping the future of academic research and provide guidance for researchers\nexploring the rapidly evolving landscape of AI-assisted research tools and\nresearch.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}