{"id":"2408.09184","title":"Der Weg zur digitalen Arbeitsmappe: Digitales Pr\\\"ufungswesen mit\n  Zertifizierung","authors":"Martin Becke, Julia Padberg","authorsParsed":[["Becke","Martin",""],["Padberg","Julia",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 12:21:37 GMT"}],"updateDate":"2024-08-20","timestamp":1723897297000,"abstract":"  The aim of the work is to present an alternative approach to recording and\nevaluating student performance that enables sustainable performance recording\nwith the possibility of integrating practical components in particular. The\nintended result is a digital portfolio with work samples - and not just\ncertificates, which can be understood as a portfolio examination in the context\nof academic assessment. This is more about the recording, evaluation and\ncertification of learning progress and competencies than the selective\nevaluation of a performance review, as is the case today, for example, with the\nsubmission of final theses. The idea is to expand and later replace final\npapers and performance tests, particularly in higher semesters, and instead\nintroduce electronically recorded portfolio examinations - based on the example\nof teaching projects.\n  Technologically, the approach is based on blockchain and wallets/repositories\nand, in the broadest sense, on an implementation of smart contracts. The\ntechnological approach of smart contracts enables a high degree of traceability\nand transparency with little administrative effort. It also offers secure\ncertification of services by the provider. It should be clearly stated that\nneither the portfolio examination nor the administration of academic\nachievements with smart contracts is the original idea, but rather the change\nin the recording of academic achievements towards an alternative approach to\nthe recording and evaluation of student performance, which enables sustainable\nperformance recording with the possibility of integrating practical components\nin particular. The desired result is a digital portfolio with work samples.\n  The primary aim of this idea sketch is to develop an individualized\nperformance record for students, which can also contribute to making\nperformance more transparent and comprehensible.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}