{"id":"2408.09090","title":"Normal-state resistivity and the depairing current density of\n  BaFe$_2$(As,P)$_2$ nanobridges along the $c$ axis","authors":"Yuki Mizukoshi, Kotaro Jimbo, Akiyoshi Park, Yue Sun, Tsuyoshi\n  Tamegai, Haruhisa Kitano","authorsParsed":[["Mizukoshi","Yuki",""],["Jimbo","Kotaro",""],["Park","Akiyoshi",""],["Sun","Yue",""],["Tamegai","Tsuyoshi",""],["Kitano","Haruhisa",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 03:58:43 GMT"}],"updateDate":"2024-08-20","timestamp":1723867123000,"abstract":"  We report precise measurements to obtain the normal-state resistivity and the\ndepairing current density of BaFe$_2$(As$_{1-x}$P$_x$)$_2$($x\\sim0.29-0.32$)\nnanobridges along the $c$ axis, which are fabricated from single crystals near\nthe optimal doping, by using focused ion beam (FIB) techniques. We obtained\nboth of the $ab$-plane and $c$-axis resistivity ($\\rho_{ab}$ and $\\rho_c$) in\nthe same part of a specimen, by fabricating the $c$-axis nanobridge in the\nmiddle of a narrow bridge extended in $ab$-plane, in spite of the slight\ndeficiency of P dopant due to the additional FIB fabrication. The normal-state\nresistivity anisotropy agreed with the previous results for bulk samples,\nshowing $\\rho_c/\\rho_{ab} < 8$ just above the superconducting transition\ntemperature, $T_c$, in the slightly underdoped region and a slight decrease\nwith increasing temperatures. The critical current density obtained in the\n$c$-axis nanobridges near the optimal doping reaches $\\sim$8 MA/cm$^2$ at\n0.15$T_c$, corresponding to about 87 % of a depairing limit derived by the\nEilenberger equations. An extrapolation to $T=$0 K using the Ginzburg-Landau\nmodel suggests that the anisotropy of the depairing current density roughly\ncorresponds to that of the normal-state resistivity. At low temperatures, we\nalso observed a step-like voltage jump before arriving at the depairing limit,\nsuggesting the occurrence of phase-slip phenomena near the depairing processes.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/"}