{"id":"2408.04125","title":"Exploring RAG-based Vulnerability Augmentation with LLMs","authors":"Seyed Shayan Daneshvar, Yu Nong, Xu Yang, Shaowei Wang, Haipeng Cai","authorsParsed":[["Daneshvar","Seyed Shayan",""],["Nong","Yu",""],["Yang","Xu",""],["Wang","Shaowei",""],["Cai","Haipeng",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 23:22:58 GMT"}],"updateDate":"2024-08-09","timestamp":1723072978000,"abstract":"  Detecting vulnerabilities is a crucial task for maintaining the integrity,\navailability, and security of software systems. Utilizing DL-based models for\nvulnerability detection has become commonplace in recent years. However, such\ndeep learning-based vulnerability detectors (DLVD) suffer from a shortage of\nsizable datasets to train effectively. Data augmentation can potentially\nalleviate the shortage of data, but augmenting vulnerable code is challenging\nand requires designing a generative solution that maintains vulnerability.\nHence, the work on generating vulnerable code samples has been limited and\nprevious works have only focused on generating samples that contain single\nstatements or specific types of vulnerabilities. Lately, large language models\n(LLMs) are being used for solving various code generation and comprehension\ntasks and have shown inspiring results, especially when fused with retrieval\naugmented generation (RAG). In this study, we explore three different\nstrategies to augment vulnerabilities both single and multi-statement\nvulnerabilities, with LLMs, namely Mutation, Injection, and Extension. We\nconducted an extensive evaluation of our proposed approach on three\nvulnerability datasets and three DLVD models, using two LLMs. Our results show\nthat our injection-based clustering-enhanced RAG method beats the baseline\nsetting (NoAug), Vulgen, and VGX (two SOTA methods), and Random Oversampling\n(ROS) by 30.80\\%, 27.48\\%, 27.93\\%, and 15.41\\% in f1-score with 5K generated\nvulnerable samples on average, and 53.84\\%, 54.10\\%, 69.90\\%, and 40.93\\% with\n15K generated vulnerable samples. Our approach demonstrates its feasibility for\nlarge-scale data augmentation by generating 1K samples at as cheap as US$ 1.88.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5sfxryA66xDPVj1GGr2lO3lgtdCyNmEHZ0WzBu9dGKc","pdfSize":"653993"}
