{"id":"2408.04333","title":"Expanding covariant cosmography of the local Universe: incorporating the\n  snap and axial symmetry","authors":"Basheer Kalbouneh, Jessica Santiago, Christian Marinoni, Roy Maartens,\n  Chris Clarkson, Maharshi Sarma","authorsParsed":[["Kalbouneh","Basheer",""],["Santiago","Jessica",""],["Marinoni","Christian",""],["Maartens","Roy",""],["Clarkson","Chris",""],["Sarma","Maharshi",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 09:36:01 GMT"}],"updateDate":"2024-08-09","timestamp":1723109761000,"abstract":"  Studies show that the model-independent, fully non-perturbative covariant\ncosmographic approach is suitable for analyzing the local Universe $(z\\lesssim\n0.1)$. However, accurately characterizing large and inhomogeneous mass\ndistributions requires the fourth-order term in the redshift expansion of the\ncovariant luminosity distance $d_L(z,\\boldsymbol{n})$. We calculate the\ncovariant snap parameter $\\mathbb{S}$ and its spherical harmonic multipole\nmoments using the matter expansion tensor and the evolution equations for\nlightray bundles. The fourth-order term adds 36 degrees of freedom, since the\nhighest independent multipole of the snap is the 32-pole (dotriacontapole)\n$(\\ell=5)$. Including this term helps to de-bias estimations of the covariant\ndeceleration parameter. Given that observations suggest axially symmetric\nanisotropies in the Hubble diagram for $z \\lesssim 0.1$ and theory shows that\nonly a subset of multipoles contributes to the signal, we demonstrate that only\n12 degrees of freedom are needed for a model-independent description of the\nlocal universe. We use an analytical axisymmetric model of the local Universe,\nwith data that matches the Zwicky Transient Facility survey, in order to\nprovide a numerical example of the amplitude of the snap multipoles and to\nforecast precision.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}