{"id":"2408.05730","title":"Optimal overlapping tomography","authors":"Kiara Hansenne, Rui Qu, Lisa T. Weinbrenner, Carlos de Gois, Haifei\n  Wang, Yang Ming, Zhengning Yang, Pawe{\\l} Horodecki, Weibo Gao, Otfried\n  G\\\"uhne","authorsParsed":[["Hansenne","Kiara",""],["Qu","Rui",""],["Weinbrenner","Lisa T.",""],["de Gois","Carlos",""],["Wang","Haifei",""],["Ming","Yang",""],["Yang","Zhengning",""],["Horodecki","Paweł",""],["Gao","Weibo",""],["Gühne","Otfried",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 08:59:08 GMT"}],"updateDate":"2024-08-13","timestamp":1723366748000,"abstract":"  Characterising large scale quantum systems is central for fundamental physics\nas well as for applications of quantum technologies. While a full\ncharacterisation requires exponentially increasing effort, focusing on\napplication-relevant information can often lead to significantly simplified\nanalysis. Overlapping tomography is such a scheme, which allows to obtain all\nthe information contained in specific subsystems of multi-particle quantum\nsystems in an efficient manner, but the ultimate limits of this approach\nremained elusive. We present protocols for optimal overlapping tomography with\nrespect to different figures of merit. First, by providing algorithmic\napproaches based on graph theory we find the optimal scheme for Pauli\nmeasurements on qubits, relating it to the problem of covering arrays in\ncombinatorics. This significantly reduces the measurement effort, showing for\ninstance that two-body overlapping tomography of nearest neighbours in\nmultiqubit quantum systems can always be performed with nine Pauli settings.\nSecond, we prove that the optimal scheme using general projective measurements\nrequires only $3^k$ settings to reconstruct all $k$-body marginals,\nindependently of the system size. Finally, we demonstrate the practical\napplicability of our methods in a six-photon experiment. Our results will find\napplications in learning noise and interaction patterns in quantum computers as\nwell as characterising fermionic systems in quantum chemistry.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}