{"id":"2408.16295","title":"IC always bad? : Information Cocooning as a Group Emotional\n  Stabilization Role in Social Networks","authors":"Jinhu Ren, Tianlong Fan, Xifei Fu and Linyuan L\\\"u","authorsParsed":[["Ren","Jinhu",""],["Fan","Tianlong",""],["Fu","Xifei",""],["Lü","Linyuan",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 06:52:57 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 06:11:08 GMT"}],"updateDate":"2024-09-02","timestamp":1724914377000,"abstract":"  This research aims to investigate the effects of information cocooning on\ngroup mood changes caused by information spreading. The simulation of the\nrealistic network evolution process is realized at the structural level by\nbuilding a network evolution model based on individual viewpoints. Abstracting\nthe accuracy of the real intelligent recommendation process by setting RA\n(Recommended Accuracy). By analyzing the information cocoon effect due to the\nrecommendation in the comment section, we provide the structural basis of\nspreading for the dynamics model. A dynamics model of emotion spreading is\ndeveloped to explore the trend of individual emotion spreading and to quantify\nthe change of group emotion. Through experiments and analysis, this paper\nconcludes that the information cocoon has a positive effect on the stability of\ngroup emotions, and that the H-CAC (Hidden Comment Area Cocoon) structure\nexists widely in real online social networks, and can produce a protective\n\"harbor\" effect in the competition of public opinion and cognitive games. The\nvalidity of the model is verified by comparison with real cases and\ngeneralization ability experiments. This work provides a multi-perspective\nanalysis and visualization, providing more quantitative results. The research\nis expected to provide new perspectives and tools for understanding the reality\nof information cocooning and expanding the scenarios of its use.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}