{"id":"2408.09135","title":"Vanilla Gradient Descent for Oblique Decision Trees","authors":"Subrat Prasad Panda, Blaise Genest, Arvind Easwaran and Ponnuthurai\n  Nagaratnam Suganthan","authorsParsed":[["Panda","Subrat Prasad",""],["Genest","Blaise",""],["Easwaran","Arvind",""],["Suganthan","Ponnuthurai Nagaratnam",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 08:18:40 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 03:28:39 GMT"}],"updateDate":"2024-08-23","timestamp":1723882720000,"abstract":"  Decision Trees (DTs) constitute one of the major highly non-linear AI models,\nvalued, e.g., for their efficiency on tabular data. Learning accurate DTs is,\nhowever, complicated, especially for oblique DTs, and does take a significant\ntraining time. Further, DTs suffer from overfitting, e.g., they proverbially\n\"do not generalize\" in regression tasks. Recently, some works proposed ways to\nmake (oblique) DTs differentiable. This enables highly efficient\ngradient-descent algorithms to be used to learn DTs. It also enables\ngeneralizing capabilities by learning regressors at the leaves simultaneously\nwith the decisions in the tree. Prior approaches to making DTs differentiable\nrely either on probabilistic approximations at the tree's internal nodes (soft\nDTs) or on approximations in gradient computation at the internal node\n(quantized gradient descent). In this work, we propose DTSemNet, a novel\nsemantically equivalent and invertible encoding for (hard, oblique) DTs as\nNeural Networks (NNs), that uses standard vanilla gradient descent. Experiments\nacross various classification and regression benchmarks show that oblique DTs\nlearned using DTSemNet are more accurate than oblique DTs of similar size\nlearned using state-of-the-art techniques. Further, DT training time is\nsignificantly reduced. We also experimentally demonstrate that DTSemNet can\nlearn DT policies as efficiently as NN policies in the Reinforcement Learning\n(RL) setup with physical inputs (dimensions $\\leq32$). The code is available at\n{\\color{blue}\\textit{\\url{https://github.com/CPS-research-group/dtsemnet}}}.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"3pfp7r0r0kpTGwDte-ZK1UjI2bodIuQ0YpVOM9ZfRcQ","pdfSize":"750092"}
