{"id":"2408.13502","title":"Enabling Wireless Communications, Energy Harvesting, and Energy Saving\n  by Using a Multimode Smart Nonlinear Circuit (MSNC)","authors":"Rasool Keshavarz, Dimitrios L. Sounas, Saeed Keshavarz, and Negin\n  Shariati","authorsParsed":[["Keshavarz","Rasool",""],["Sounas","Dimitrios L.",""],["Keshavarz","Saeed",""],["Shariati","Negin",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 07:05:00 GMT"}],"updateDate":"2024-08-27","timestamp":1724483100000,"abstract":"  In this paper, a multimode smart nonlinear circuit (MSNC) for wireless\ncommunications (Tx and Rx modes) as well as energy harvesting (EH) and power\nsaving is presented. The proposed MSNC is designed at 680 MHz and has three\nports, which are connected to an antenna, and T/R (transceiver) and\npower-saving modules. According to the input/output power level, the proposed\nMSNC has three modes of operations; Receiving (Rx), power saving and\ntransmitting (Tx), for low (<-25 dBm), mid (>-25 dBm and <0 dBm) and high (>5\ndBm) power ranges, respectively. In the power-saving mode, when the received\npower is greater than the sensitivity of the Rx module, the excess power is\ndirected to the energy harvesting load (power storage), while the receiving\ndirection is still in place. The fact that the proposed MSNC can manage the\nreceived power level smartly and without any external control, distinguishes\nthe proposed MSNC from other EH circuits. The proposed MSNC operates within a\npower range from -50 dBm to +15 dBm, demonstrates an efficiency of more than\n60% in the power-saving mode, and has acceptable matching over a large\nfrequency range. The design procedure of the proposed MSNC along with the\ntheoretical, simulation and measurement results are presented in this paper.\nGood agreement between theory, simulation and measurement results confirms the\naccuracy of design procedure.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}