{"id":"2408.03155","title":"Characterization of 3D printed micro-blades for cutting tissue-embedding\n  material","authors":"Saisneha Koppaka, David Doan, Wei Cai, Wendy Gu, and Sindy K.Y.Tang","authorsParsed":[["Koppaka","Saisneha",""],["Doan","David",""],["Cai","Wei",""],["Gu","Wendy",""],["Tang","Sindy K. Y.",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 17:15:52 GMT"}],"updateDate":"2024-08-07","timestamp":1722705352000,"abstract":"  Cutting soft materials on the microscale has emerging applications in\nsingle-cell studies, tissue microdissection for organoid culture, drug screens,\nand other analyses. However, the cutting process is complex and remains\nincompletely understood. Furthermore, precise control over blade geometries,\nsuch as the blade tip radius, has been difficult to achieve. In this work, we\nuse the Nanoscribe 3D printer to precisely fabricate micro-blades (i.e., blades\n<1 mm in length) and blade grid geometries. This fabrication method enables a\nsystematic study of the effect of blade geometry on the indentation cutting of\nparaffin wax, a common tissue-embedding material. First, we print straight\nmicro-blades with tip radius ranging from ~100 nm to 10 um. The micro-blades\nare mounted in a custom nanoindentation setup to measure the cutting energy\nduring indentation cutting of paraffin. Cutting energy, measured as the\ndifference in dissipated energy between the first and second loading cycles,\ndecreases as blade tip radius decreases, until ~357 nm when the cutting energy\nplateaus despite further decrease in tip radius. Second, we expand our method\nto blades printed in unconventional configurations, including parallel blade\nstructures and blades arranged in a square grid. Under the conditions tested,\nthe cutting energy scales approximately linearly with the total length of the\nblades comprising the blade structure. The experimental platform described can\nbe extended to investigate other blade geometries and guide the design of\nmicroscale cutting of soft materials.\n","subjects":["Physics/Medical Physics","Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}