{"id":"2408.12004","title":"CSPI-MT: Calibrated Safe Policy Improvement with Multiple Testing for\n  Threshold Policies","authors":"Brian M Cho, Ana-Roxana Pop, Kyra Gan, Sam Corbett-Davies, Israel Nir,\n  Ariel Evnine, Nathan Kallus","authorsParsed":[["Cho","Brian M",""],["Pop","Ana-Roxana",""],["Gan","Kyra",""],["Corbett-Davies","Sam",""],["Nir","Israel",""],["Evnine","Ariel",""],["Kallus","Nathan",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 21:38:03 GMT"}],"updateDate":"2024-08-23","timestamp":1724276283000,"abstract":"  When modifying existing policies in high-risk settings, it is often necessary\nto ensure with high certainty that the newly proposed policy improves upon a\nbaseline, such as the status quo. In this work, we consider the problem of safe\npolicy improvement, where one only adopts a new policy if it is deemed to be\nbetter than the specified baseline with at least pre-specified probability. We\nfocus on threshold policies, a ubiquitous class of policies with applications\nin economics, healthcare, and digital advertising. Existing methods rely on\npotentially underpowered safety checks and limit the opportunities for finding\nsafe improvements, so too often they must revert to the baseline to maintain\nsafety. We overcome these issues by leveraging the most powerful safety test in\nthe asymptotic regime and allowing for multiple candidates to be tested for\nimprovement over the baseline. We show that in adversarial settings, our\napproach controls the rate of adopting a policy worse than the baseline to the\npre-specified error level, even in moderate sample sizes. We present CSPI and\nCSPI-MT, two novel heuristics for selecting cutoff(s) to maximize the policy\nimprovement from baseline. We demonstrate through both synthetic and external\ndatasets that our approaches improve both the detection rates of safe policies\nand the realized improvement, particularly under stringent safety requirements\nand low signal-to-noise conditions.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Methodology","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}