{"id":"2408.03828","title":"More than 'Left and Right': Revealing Multilevel Online Political\n  Selective Exposure","authors":"Yuan Zhang, Laia Castro Herrero, Frank Esser, Alexandre Bovet","authorsParsed":[["Zhang","Yuan",""],["Herrero","Laia Castro",""],["Esser","Frank",""],["Bovet","Alexandre",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 15:06:51 GMT"}],"updateDate":"2024-08-08","timestamp":1723043211000,"abstract":"  Selective exposure, individuals' inclination to seek out information that\nsupports their beliefs while avoiding information that contradicts them, plays\nan important role in the emergence of polarization. In the political domain,\nselective exposure is usually measured on a left-right ideology scale, ignoring\nfiner details. Here, we combine survey and Twitter data collected during the\n2022 Brazilian Presidential Election and investigate selective exposure\npatterns between the survey respondents and political influencers. We analyze\nthe followship network between survey respondents and political influencers and\nfind a multilevel community structure that reveals a hierarchical organization\nmore complex than a simple split between left and right. Moreover, depending on\nthe level we consider, we find different associations between network indices\nof exposure patterns and 189 individual attributes of the survey respondents.\nFor example, at finer levels, the number of influencer communities a survey\nrespondent follows is associated with several factors, such as demographics,\nnews consumption frequency, and incivility perception. In comparison, only\ntheir political ideology is a significant factor at coarser levels. Our work\ndemonstrates that measuring selective exposure at a single level, such as left\nand right, misses important information necessary to capture this phenomenon\ncorrectly.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}