{"id":"2408.17100","title":"Fully Coupled Implicit Hydro-Mechanical Multiphase Flow Simulation in\n  Deformable Porous Media Using DEM","authors":"Quanwei Dai, Kang Duan, Chung-Yee Kwok","authorsParsed":[["Dai","Quanwei",""],["Duan","Kang",""],["Kwok","Chung-Yee",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 08:35:32 GMT"}],"updateDate":"2024-09-02","timestamp":1725006932000,"abstract":"  Knowledge of the underlying mechanisms of multiphase flow dynamics in porous\nmedia is crucial for optimizing subsurface engineering applications like\ngeological carbon sequestration. However, studying the micro-mechanisms of\nmultiphase fluid--grain interactions in the laboratory is challenging due to\nthe difficulty in obtaining mechanical data such as force and displacement.\nTransitional discrete element method models coupled with pore networks offer\ninsights into these interactions but struggle with accurate pressure prediction\nduring pore expansion from fracturing and efficient simulation during the slow\ndrainage of compressible fluids. To address these limitations, we develop an\nadvanced two-way coupled hydro-mechanical discrete element method model that\naccurately and efficiently captures fluid--fluid and fluid--grain interactions\nin deformable porous media. Our model integrates an unconditionally stable\nimplicit finite volume approach, enabling significant timesteps for advancing\nfluids. A pressure-volume iteration scheme dynamically balances\ninjection-induced pressure buildup with substantial pore structure deformation,\nwhile flow front-advancing criteria precisely locate the fluid--fluid interface\nand adaptively refine timesteps, particularly when capillary effects block\npotential flow paths. The model is validated against benchmark Hele-Shaw\nexperiments in both rigid and deformable porous media, providing quantitative\ninsights into the micro-mechanisms governing multiphase flow. For the first\ntime, grain-scale inputs such as viscous and capillary pressures, energies,\ncontact forces, and flow resistances are utilized to provide a detailed\nunderstanding of micro-scale fluid--fluid and fluid--grain flow patterns and\ntheir transitions.\n","subjects":["Physics/Fluid Dynamics","Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}