{"id":"2408.14134","title":"Exploring the Potential of Large Language Models for Heterophilic Graphs","authors":"Yuxia Wu, Shujie Li, Yuan Fang, Chuan Shi","authorsParsed":[["Wu","Yuxia",""],["Li","Shujie",""],["Fang","Yuan",""],["Shi","Chuan",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 09:29:56 GMT"}],"updateDate":"2024-08-28","timestamp":1724664596000,"abstract":"  Graph Neural Networks (GNNs) are essential for various graph-based learning\ntasks. Notably, classical GNN architectures operate under the assumption of\nhomophily, which posits that connected nodes are likely to share similar\nfeatures. However, this assumption limits the effectiveness of GNNs in handling\nheterophilic graphs where connected nodes often exhibit dissimilar\ncharacteristics. Existing approaches for homophily graphs such as non-local\nneighbor extension and architectural refinement overlook the rich textual data\nassociated with nodes, which could unlock deeper insights into these\nheterophilic contexts. With advancements in Large Language Models (LLMs), there\nis significant promise to enhance GNNs by leveraging the extensive open-world\nknowledge within LLMs to more effectively interpret and utilize textual data\nfor characterizing heterophilic graphs. In this work, we explore the potential\nof LLMs for modeling heterophilic graphs and propose a novel two-stage\nframework: LLM-enhanced edge discriminator and LLM-guided edge reweighting.\nSpecifically, in the first stage, we fine-tune the LLM to better identify\nhomophilic and heterophilic edges based on the textual information of their\nnodes. In the second stage, we adaptively manage message propagation in GNNs\nfor different edge types based on node features, structures, and heterophilic\nor homophilic characteristics. To cope with the computational demands when\ndeploying LLMs in practical scenarios, we further explore model distillation\ntechniques to fine-tune smaller, more efficient models that maintain\ncompetitive performance. Extensive experiments validate the effectiveness of\nour framework, demonstrating the feasibility of using LLMs to enhance GNNs for\nnode classification on heterophilic graphs.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}