{"id":"2408.02027","title":"Near-Field Sensing Enabled Predictive Beamforming: From Estimation to\n  Tracking","authors":"Hao Jiang, Zhaolin Wang, Yuanwei Liu","authorsParsed":[["Jiang","Hao",""],["Wang","Zhaolin",""],["Liu","Yuanwei",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 13:37:46 GMT"}],"updateDate":"2024-08-06","timestamp":1722778666000,"abstract":"  A near-field sensing (NISE) enabled predictive beamforming framework is\nproposed to facilitate wireless communications with high-mobility channels.\nUnlike conventional far-field sensing, which only captures the angle and the\nradial velocity of the user, NISE enables the estimation of the full motion\nstate, including additional distance and transverse velocity information. Two\nfull-motion state sensing approaches are proposed based on the concepts of\nestimation and tracking, respectively. 1)AGD-AO approach: The full motion state\nof the user is estimated within a single CPI. In particular, the gradient\ndescent is adopted to estimate the transverse and radial velocities of the user\nbased on the maximum likelihood criteria, while the distance and the angle are\ncalculated by the kinematic model. In this process, moment estimations are\nleveraged to adaptively tune the step size, thereby leading to a smoother and\nfaster gradient descent. 2) EKF approach: The full motion state of the user is\ntracked across multiple CPIs. Based on the noisy measurements in multiple CPIs,\nthe EKF iteratively predicts and updates the current motion state to achieve a\nlow tracking error. Based on the obtained full motion state, the beam\nprediction, and Doppler frequency compensation can be carried out with minimum\npilot overhead. Numerical results are provided to validate the effectiveness\nand efficiency of the proposed approach compared to the conventional far-field\npredictive beamforming and feedback-based approaches. It is also revealed that:\n1)the proposed AGD-AO can achieve stable descending with small gradients,\nthereby accelerating convergence; 2) compared to far-field predictive\nbeamforming and feedback-based schemes, both of the proposed methods exhibit\nsuperior performance; and 3) by incorporating multiple CPIs, the EKF method\nexhibits greater robustness in low SNR regions.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}