{"id":"2408.16731","title":"Impact of cosmic web on galaxy properties and their correlations:\n  Insights from Principal Component Analysis","authors":"Anindita Nandi, Biswajit Pandey","authorsParsed":[["Nandi","Anindita",""],["Pandey","Biswajit",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 17:23:29 GMT"}],"updateDate":"2024-08-30","timestamp":1724952209000,"abstract":"  We use Principal Component Analysis (PCA) to analyze a volume-limited sample\nfrom the SDSS and explore how cosmic web environments affect the interrelations\nbetween various galaxy properties, such as $(u-r)$ colour, stellar mass,\nspecific star formation rate, metallicity, concentration index, and $D4000$.\nOur analysis reveals that the first two principal components (PC1 and PC2)\naccount for approximately $\\sim 72\\%$ of the data variance. We then classify\ngalaxies into different cosmic web environments based on the eigenvalues of the\ndeformation tensor and compare PC1 and PC2 across these environments, ensuring\na mass-matched sample of equal size for each environment. We observe that PC1\ndisplays clear bimodality across all cosmic web environments, with sheets and\nclusters showing distinct preferences for negative and positive PC1 values,\nrespectively. PC2, on the other hand, shows a positively skewed unimodal\ndistribution in all environments. A Kolmogorov-Smirnov (KS) test confirms that\nthe distributions of PC1 and PC2 differ significantly across environments, with\na confidence level exceeding $99.99\\%$. Furthermore, we calculate the\nnormalized mutual information (NMI) between the principal components and\nindividual galaxy properties within different cosmic web environments. A\ntwo-tailed t-test reveals that for each relationship and each pair of\nenvironments, the null hypothesis is rejected with a confidence level\n$>99.99\\%$. Our analysis confirms that cosmic web environments play a\nsignificant role in shaping the correlations between galaxy properties.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}