{"id":"2408.15470","title":"Sofic actions on graphs","authors":"David Gao, Greg Patchell, Srivatsav Kunnawalkam Elayavalli","authorsParsed":[["Gao","David",""],["Patchell","Greg",""],["Elayavalli","Srivatsav Kunnawalkam",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 01:26:38 GMT"}],"updateDate":"2024-08-29","timestamp":1724808398000,"abstract":"  We develop a theory of soficity for actions on graphs and obtain new\napplications to the study of sofic groups. We establish various examples,\nstability and permanence properties of sofic actions on graphs, in particular\nsoficity is preserved by taking several natural graph join operations. We prove\nthat an action of a group on its Cayley graph is sofic if and only if the group\nis sofic. We show that arbitrary actions of amenable groups on graphs are\nsofic. Using a graph theoretic result of E. Hrushovski, we also show that\narbitrary actions of free groups on graphs are sofic. Notably we show that\narbitrary actions of sofic groups on graphs, with amenable stabilizers, are\nsofic, settling completely an open problem from \\cite{gao2024soficity}. We also\nshow that soficity is preserved by taking limits under a natural\nGromov-Hausdorff topology, generalizing prior work of the first author\n\\cite{gao2024actionslerfgroupssets}. Our work sheds light on a family of groups\ncalled graph wreath products, simultaneously generalizing graph products and\ngeneralized wreath products. Extending various prior results in this direction\nincluding soficity of generalized wreath products \\cite{gao2024soficity}, B.\nHayes and A. Sale \\cite{HayesSale}, and soficity of graph products \\cite{CHR,\ncharlesworth2021matrix}, we show that graph wreath products are sofic if the\naction and acting groups are sofic. These results provide several new examples\nof sofic groups in a systematic manner.\n","subjects":["Mathematics/Group Theory","Mathematics/Operator Algebras"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"mywv8jIvuul3bxe_c6rZcDJoRz-lRavvvv8svsPKTkI","pdfSize":"488689"}
