{"id":"2408.01425","title":"Comparative Evaluation of the Proximate and Cytogenotoxicity of Ash and\n  Rice Chips Used as Mango Fruit Artificial Ripening Agents in Birnin Kebbi,\n  Nigeria","authors":"CD Obadiah, TO Yahaya, AA Aliero, M Abdulkareem","authorsParsed":[["Obadiah","CD",""],["Yahaya","TO",""],["Aliero","AA",""],["Abdulkareem","M",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 12:06:44 GMT"}],"updateDate":"2024-08-06","timestamp":1719662804000,"abstract":"  The high demand for mango (Mangifera indica L.) fruits has led sellers to\nemploy ripening agents. However, concerns are growing regarding the potential\ntoxicities of induced ripening, emphasizing the need for scientific\ninvestigation. Samples of artificially and naturally ripened mangoes were\nanalyzed for proximate composition using standard protocols. Cytogenotoxicity\nwas then assessed using the Allium cepa L. toxicity test. Twenty (20)A. cepa\n(onion) bulbs were used, with 5 ripened naturally, 5 with wood ash, 5 with\nherbaceous ash, and 5 with rice chips, all grown over tap water for five days.\nThe root tips of the bulbs were assayed and examined for chromosomal\naberrations. The results revealed a significant (P<0.05) increase in moisture,\nprotein, and ash content of mangoes as ripening agents were introduced. Mangoes\nripened with wood ash exhibited the highest moisture content (81%), while those\nripened with rice chips had the highest protein (0.5%) and ash content (1.5%).\nNaturally ripened mangoes displayed the highest fat (0.0095%) and fiber\n(11.46%) contents. The A. cepa toxicity test indicated significant (p<0.05)\ndifferences in the root growth of mangoes ripened with various agents. Wood ash\nresulted in the highest root growth (2.62cm), while herbaceous ash had the\nleast (2.18%). Chromosomal aberrations, including sticky, vagrant, and laggard\nabnormalities, were observed in all agents, with herbaceous ash exhibiting the\nhighest and rice chips the least. The obtained results suggest that induced\nripening of the fruits could induce toxicities, highlighting the necessity for\npublic awareness regarding the potential dangers posed by these agents.\n","subjects":["Quantitative Biology/Other Quantitative Biology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rjD9VYZNh310WIaUEKaYWdKktCtQu_tArTMUeTxUYPw","pdfSize":"475464"}
