{"id":"2408.01206","title":"GAMBAS -- Fast Beam Arrangement Selection for Proton Therapy using a\n  Nearest Neighbour Model","authors":"Renato Bellotti, Nicola Bizzocchi, Antony J. Lomax, Andreas Adelmann,\n  Damien C. Weber, Jan Hrbacek","authorsParsed":[["Bellotti","Renato",""],["Bizzocchi","Nicola",""],["Lomax","Antony J.",""],["Adelmann","Andreas",""],["Weber","Damien C.",""],["Hrbacek","Jan",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 11:40:12 GMT"}],"updateDate":"2024-08-05","timestamp":1722598812000,"abstract":"  Purpose: Beam angle selection is critical in proton therapy treatment\nplanning, yet automated approaches remain underexplored. This study presents\nand evaluates GAMBAS, a novel, fast machine learning model for automatic beam\nangle selection.\n  Methods: The model extracts a predefined set of anatomical features from a\npatient's CT and structure contours. Using these features, it identifies the\nmost similar patient from a training database and suggests that patient's beam\narrangement. A retrospective study with 19 patients was conducted, comparing\nthis model's suggestions to human planners' choices and randomly selected beam\narrangements from the training dataset. An expert treatment planner evaluated\nthe plans on quality (scale 1-5), ranked them, and guessed the method used.\n  Results: The number of acceptable (score 4 or 5) plans was comparable between\nhuman-chosen 17 (89%) and model-selected 16(84%) beam arrangements. The fully\nautomatic treatment planning took between 4 - 7 min (mean 5 min).\n  Conclusion: The model produces beam arrangements of comparable quality to\nthose chosen by human planners, demonstrating its potential as a fast tool for\nquality assurance and patient selection, although it is not yet ready for\nclinical use.\n","subjects":["Physics/Medical Physics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xWnQB4VCUKqR6uwY9iCAGMz9CBqxOWVBh4s6hoJu3iI","pdfSize":"3175737","txDigest":"D48jtegz8TCCmGyLWQB5naR4FRzPvUpBUVmCtYEdvfcE","endEpoch":"1","status":"CERTIFIED"}
