{"id":"2408.16757","title":"Dissecting Out-of-Distribution Detection and Open-Set Recognition: A\n  Critical Analysis of Methods and Benchmarks","authors":"Hongjun Wang, Sagar Vaze, Kai Han","authorsParsed":[["Wang","Hongjun",""],["Vaze","Sagar",""],["Han","Kai",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 17:55:07 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 02:26:01 GMT"}],"updateDate":"2024-09-02","timestamp":1724954107000,"abstract":"  Detecting test-time distribution shift has emerged as a key capability for\nsafely deployed machine learning models, with the question being tackled under\nvarious guises in recent years. In this paper, we aim to provide a consolidated\nview of the two largest sub-fields within the community: out-of-distribution\n(OOD) detection and open-set recognition (OSR). In particular, we aim to\nprovide rigorous empirical analysis of different methods across settings and\nprovide actionable takeaways for practitioners and researchers. Concretely, we\nmake the following contributions: (i) We perform rigorous cross-evaluation\nbetween state-of-the-art methods in the OOD detection and OSR settings and\nidentify a strong correlation between the performances of methods for them;\n(ii) We propose a new, large-scale benchmark setting which we suggest better\ndisentangles the problem tackled by OOD detection and OSR, re-evaluating\nstate-of-the-art OOD detection and OSR methods in this setting; (iii) We\nsurprisingly find that the best performing method on standard benchmarks\n(Outlier Exposure) struggles when tested at scale, while scoring rules which\nare sensitive to the deep feature magnitude consistently show promise; and (iv)\nWe conduct empirical analysis to explain these phenomena and highlight\ndirections for future research. Code:\nhttps://github.com/Visual-AI/Dissect-OOD-OSR\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}