{"id":"2408.11200","title":"UKAN: Unbound Kolmogorov-Arnold Network Accompanied with Accelerated\n  Library","authors":"Alireza Moradzadeh, Lukasz Wawrzyniak, Miles Macklin and Saee G.\n  Paliwal","authorsParsed":[["Moradzadeh","Alireza",""],["Wawrzyniak","Lukasz",""],["Macklin","Miles",""],["Paliwal","Saee G.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 21:20:38 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 17:46:11 GMT"}],"updateDate":"2024-09-19","timestamp":1724188838000,"abstract":"  In this work, we present a GPU-accelerated library for the underlying\ncomponents of Kolmogorov-Arnold Networks (KANs), along with an algorithm to\neliminate bounded grids in KANs. The GPU-accelerated library reduces the\ncomputational complexity of Basis Spline (B-spline) evaluation by a factor of\n$\\mathcal{O}$(grid size) compared to existing codes, enabling batch computation\nfor large-scale learning. To overcome the limitations of traditional KANs, we\nintroduce Unbounded KANs (UKANs), which eliminate the need for a bounded grid\nand a fixed number of B-spline coefficients. To do so, we replace the KAN\nparameters (B-spline coefficients) with a coefficient generator (CG) model. The\ninputs to the CG model are designed based on the idea of an infinite symmetric\ngrid extending from negative infinity to positive infinity. The positional\nencoding of grid group, a sequential collection of B-spline grid indexes, is\nfed into the CG model, and coefficients are consumed by the efficient\nimplementation (matrix representations) of B-spline functions to generate\noutputs. We perform several experiments on regression, classification, and\ngenerative tasks, which are promising. In particular, UKAN does not require\ndata normalization or a bounded domain for evaluation. Additionally, our\nbenchmarking results indicate the superior memory and computational efficiency\nof our library compared to existing codes.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}