{"id":"2408.01424","title":"Generalised Circuit Partitioning for Distributed Quantum Computing","authors":"Felix Burt, Kuan-Cheng Chen, Kin Leung","authorsParsed":[["Burt","Felix",""],["Chen","Kuan-Cheng",""],["Leung","Kin",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 17:59:51 GMT"}],"updateDate":"2024-08-05","timestamp":1722621591000,"abstract":"  Distributed quantum computing (DQC) is a new paradigm aimed at scaling up\nquantum computing via the interconnection of smaller quantum processing units\n(QPUs). Shared entanglement allows teleportation of both states and gates\nbetween QPUs. This leads to an attractive horizontal scaling of quantum\nprocessing power, which comes at the expense of the additional time and noise\nintroduced by entanglement sharing protocols. Consequently, methods for\npartitioning quantum circuits across multiple QPUs should aim to minimise the\namount of entanglement-based communication required between distributed QPUs.\nExisting protocols tend to focus primarily on optimising entanglement costs for\ngate teleportation or state teleportation to cover operations between QPUs,\nrather than both at the same time. The most general form of the problem should\ntreat gate and state teleportation on the same footing, allowing minimal cost\ncircuit partitions through a combination of the two. This work introduces a\ngraph-based formulation which allows joint optimisation of gate and state\nteleportation cost, including extensions of gate teleportation which group\ngates together for distribution using common resources. The formulation permits\nlow e-bit cost for a variety of circuit types. Using a basic genetic algorithm,\nimproved performance over state-of-the-art methods is obtained in terms of both\naverage e-bit cost and time scaling.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"svW0PUQ01KITk7rMYorNUZ9itY7aHUwjf1mM2WCj5Q4","pdfSize":"911140","txDigest":"6fUNAcgUdyBGUPBoKWtX1rhKEXiAn7wDsvwJs1dwUvRi","endEpoch":"1","status":"CERTIFIED"}
