{"id":"2408.13683","title":"Submodular Maximization Approaches for Equitable Client Selection in\n  Federated Learning","authors":"Andr\\'es Catalino Castillo Jim\\'enez, Ege C. Kaya, Lintao Ye, Abolfazl\n  Hashemi","authorsParsed":[["Jiménez","Andrés Catalino Castillo",""],["Kaya","Ege C.",""],["Ye","Lintao",""],["Hashemi","Abolfazl",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 22:40:31 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 19:27:07 GMT"}],"updateDate":"2024-08-29","timestamp":1724539231000,"abstract":"  In a conventional Federated Learning framework, client selection for training\ntypically involves the random sampling of a subset of clients in each\niteration. However, this random selection often leads to disparate performance\namong clients, raising concerns regarding fairness, particularly in\napplications where equitable outcomes are crucial, such as in medical or\nfinancial machine learning tasks. This disparity typically becomes more\npronounced with the advent of performance-centric client sampling techniques.\nThis paper introduces two novel methods, namely SUBTRUNC and UNIONFL, designed\nto address the limitations of random client selection. Both approaches utilize\nsubmodular function maximization to achieve more balanced models. By modifying\nthe facility location problem, they aim to mitigate the fairness concerns\nassociated with random selection. SUBTRUNC leverages client loss information to\ndiversify solutions, while UNIONFL relies on historical client selection data\nto ensure a more equitable performance of the final model. Moreover, these\nalgorithms are accompanied by robust theoretical guarantees regarding\nconvergence under reasonable assumptions. The efficacy of these methods is\ndemonstrated through extensive evaluations across heterogeneous scenarios,\nrevealing significant improvements in fairness as measured by a client\ndissimilarity metric.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Signal Processing","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}