{"id":"2408.06155","title":"Testing the flux tube expansion factor -- solar wind speed relation with\n  Solar Orbiter data","authors":"J-B. Dakeyo, A.P. Rouillard, V. R\\'eville, P. D\\'emoulin, M.\n  Maksimovic, A. Chapiron, R. F. Pinto, and P.Louarn","authorsParsed":[["Dakeyo","J-B.",""],["Rouillard","A. P.",""],["Réville","V.",""],["Démoulin","P.",""],["Maksimovic","M.",""],["Chapiron","A.",""],["Pinto","R. F.",""],["Louarn","P.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 13:50:21 GMT"}],"updateDate":"2024-08-13","timestamp":1723470621000,"abstract":"  The properties of the solar wind measured in-situ in the heliosphere are\nlargely controlled by energy deposition in the solar. Previous studies have\nshown that long duration and large scale magnetic structures show an inverse\nrelation between the solar wind velocity measured in situ near 1 au and the\nexpansion factor of the magnetic flux tubes in the solar atmosphere. We exploit\nSolar Orbiter data in conjunction with the Potential Field Source Surface\n(PFSS) coronal model, and the solar wind trajectory to evaluate the flux\nexpansion factor - speed relation at the solar \"source surface\" at rss. We find\na statistically weak anti-correlation between the in-situ bulk velocity and the\ncoronal expansion factor, for about 1.5 years of solar data. Classification of\nthe data by source latitude reveals different levels of anticorrelation. We\nshow the existence of fast solar wind that originates in strong magnetic field\nregions at low latitudes and undergoes large expansion factor. We provide\nevidence that such winds become supersonic during the super radial expansion\n(below rss), and are theoretically governed by a positive correlation v-f. We\nfind that faster winds on average have a flux tube expansion at a larger radius\nthan slower winds. An anticorrelation between solar wind speed and expansion\nfactor is present for solar winds originating in high latitude structures in\nsolar minimum activity, typically associated with coronal hole-like structures,\nbut this cannot be generalized to lower latitude sources. Therefore, the value\nof the expansion factor alone cannot be used to predict the solar wind speed.\nOther parameters, such as the height at which the expansion gradient is the\nstrongest must also be taken into account.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"bgSEutoYd1nxZA61YFRpxXDY1TPeb5EYBZ_QNmyS9hE","pdfSize":"27481950"}
