{"id":"2408.16900","title":"Legacy Learning Using Few-Shot Font Generation Models for Automatic Text\n  Design in Metaverse Content: Cases Studies in Korean and Chinese","authors":"Younghwi Kim, Seok Chan Jeong, and Sunghyun Sim","authorsParsed":[["Kim","Younghwi",""],["Jeong","Seok Chan",""],["Sim","Sunghyun",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 20:53:13 GMT"}],"updateDate":"2024-09-02","timestamp":1724964793000,"abstract":"  Generally, the components constituting a metaverse are classified into\nhardware, software, and content categories. As a content component, text design\nis known to positively affect user immersion and usability. Unlike English,\nwhere designing texts involves only 26 letters, designing texts in Korean and\nChinese requires creating 11,172 and over 60,000 individual glyphs,\nrespectively, owing to the nature of the languages. Consequently, applying new\ntext designs to enhance user immersion within the metaverse can be tedious and\nexpensive, particularly for certain languages. Recently, efforts have been\ndevoted toward addressing this issue using generative artificial intelligence\n(AI). However, challenges remain in creating new text designs for the metaverse\nowing to inaccurate character structures. This study proposes a new AI learning\nmethod known as Legacy Learning, which enables high-quality text design at a\nlower cost. Legacy Learning involves recombining existing text designs and\nintentionally introducing variations to produce fonts that are distinct from\nthe originals while maintaining high quality. To demonstrate the effectiveness\nof the proposed method in generating text designs for the metaverse, we\nperformed evaluations from the following three aspects: 1) Quantitative\nperformance evaluation 2) Qualitative evaluationand 3) User usability\nevaluation. The quantitative and qualitative performance results indicated that\nthe generated text designs differed from the existing ones by an average of\nover 30% while still maintaining high visual quality. Additionally, the SUS\ntest performed with metaverse content designers achieved a score of 95.8,\nindicating high usability.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"vVSwlPSTduTI4JdIfolxtbwKKq9Ro5DRrnRIyRiL8hY","pdfSize":"1789212"}
