{"id":"2408.09744","title":"RealCustom++: Representing Images as Real-Word for Real-Time\n  Customization","authors":"Zhendong Mao, Mengqi Huang, Fei Ding, Mingcong Liu, Qian He, Xiaojun\n  Chang, Yongdong Zhang","authorsParsed":[["Mao","Zhendong",""],["Huang","Mengqi",""],["Ding","Fei",""],["Liu","Mingcong",""],["He","Qian",""],["Chang","Xiaojun",""],["Zhang","Yongdong",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 07:15:44 GMT"}],"updateDate":"2024-08-20","timestamp":1724051744000,"abstract":"  Text-to-image customization, which takes given texts and images depicting\ngiven subjects as inputs, aims to synthesize new images that align with both\ntext semantics and subject appearance. This task provides precise control over\ndetails that text alone cannot capture and is fundamental for various\nreal-world applications, garnering significant interest from academia and\nindustry. Existing works follow the pseudo-word paradigm, which involves\nrepresenting given subjects as pseudo-words and combining them with given texts\nto collectively guide the generation. However, the inherent conflict and\nentanglement between the pseudo-words and texts result in a dual-optimum\nparadox, where subject similarity and text controllability cannot be optimal\nsimultaneously. We propose a novel real-words paradigm termed RealCustom++ that\ninstead represents subjects as non-conflict real words, thereby disentangling\nsubject similarity from text controllability and allowing both to be optimized\nsimultaneously. Specifically, RealCustom++ introduces a novel \"train-inference\"\ndecoupled framework: (1) During training, RealCustom++ learns the alignment\nbetween vision conditions and all real words in the text, ensuring high\nsubject-similarity generation in open domains. This is achieved by the\ncross-layer cross-scale projector to robustly and finely extract subject\nfeatures, and a curriculum training recipe that adapts the generated subject to\ndiverse poses and sizes. (2) During inference, leveraging the learned general\nalignment, an adaptive mask guidance is proposed to only customize the\ngeneration of the specific target real word, keeping other subject-irrelevant\nregions uncontaminated to ensure high text-controllability in real-time.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}