{"id":"2408.13923","title":"On the conformal limit of a QED-inspired model","authors":"O Oliveira, T Frederico and W de Paula","authorsParsed":[["Oliveira","O",""],["Frederico","T",""],["de Paula","W",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 19:37:58 GMT"}],"updateDate":"2024-08-27","timestamp":1724614678000,"abstract":"  A conformal invariant QED-inspired model is solved for a general covariant\nlinear gauge using the Dyson-Schwinger equations for the propagators assuming a\npure vector like interaction. The leading corrections to the asymptotic\nsolutions and the exponents, that characterize the corrections to each of the\ntwo fermion propagator functions, are computed as a function of the coupling\nand gauge fixing parameter $\\xi$. For the scalar component of the fermion\npropagator our findings generalizes for linear covariant gauges previous\nresults found in the literature and reproduce the outcome of the perturbative\nanalysis of quenched QED in the Landau gauge. Our solution for the exponent\nassociated with vector component of the fermion propagator is new and, in the\nweak coupling regime, agrees with the estimation based on the perturbative\nanalysis of quenched QED. Of the two critical exponents describing the\nconformal limit of the vector interaction, one of them is, in QED, associated\nwith the regime where chiral symmetry is broken dynamically, which demands one\nmass scale, namely the Miransky scaling. A second mass scale has to be\nintroduced at larger coupling constants and is associated with a change on the\nnature of the fermion wave function. This provides one example, that it is\npossible to find two interwoven cycles in Quantum Field Theory, albeit in a\ntruncated framework, as it is known in the quantum few-body problem in the\nlimit of a zero-range interaction.\n","subjects":["Physics/High Energy Physics - Theory","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}