{"id":"2408.00577","title":"A Space-Time Knife-Edge In Epsilon-Near-Zero Films for Ultrafast Pulse\n  Characterization","authors":"Adam Ball, Ray Secondo, Dhruv Fomra, Jingwei Wu, Samprity Saha, Amit\n  Agrawal, Henri Lezec, Nathaniel Kinsey","authorsParsed":[["Ball","Adam",""],["Secondo","Ray",""],["Fomra","Dhruv",""],["Wu","Jingwei",""],["Saha","Samprity",""],["Agrawal","Amit",""],["Lezec","Henri",""],["Kinsey","Nathaniel",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 14:08:06 GMT"}],"updateDate":"2024-08-02","timestamp":1722521286000,"abstract":"  Epsilon-near-zero (ENZ) materials have shown strong refractive nonlinearities\nthat can be fast in an absolute sense. While continuing to advance fundamental\nscience, such as time varying interactions, the community is still searching\nfor an application that can effectively make use of the strong index modulation\noffered. Here we combine the effect of strong space-time index modulation in\nENZ materials with the beam deflection technique to introduce a new approach to\noptical pulse characterization that we term a space-time knife edge. We show\nthat in this approach, we are able to extract temporal and spatial information\nof a Gaussian beam with only two time resolved measurements. The approach\nachieves this without phase-matching requirements (<1 micron thick film) and\ncan achieve a high signal to noise ratio by combining the system with lock-in\ndetection, facilitating the measurement of weak refractive index changes\n(delta_n ~ 10^-5) for low intensity beams. Thus, the space-time knife edge can\noffer a new avenue for ultrafast light measurement and demonstrates a use cases\nof ENZ materials. In support of this, we outline temporal dynamics for\nrefractive index changes in non-colinear experiments opening avenues for better\ntheoretical understanding of both the spatial and temporal dynamics of emerging\nENZ films.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"hMR5Qm0us-Bo2QWblb1DywI8F6o2tCsjRq2OLtsG1a0","pdfSize":"1891862","txDigest":"HvomqkzueESn6KxKNqzHkRkhkDPs5jSdGxjXMakEBGoy","endEpoch":"1","status":"CERTIFIED"}
