{"id":"2408.14597","title":"On Centralized Critics in Multi-Agent Reinforcement Learning","authors":"Xueguang Lyu, Andrea Baisero, Yuchen Xiao, Brett Daley, Christopher\n  Amato","authorsParsed":[["Lyu","Xueguang",""],["Baisero","Andrea",""],["Xiao","Yuchen",""],["Daley","Brett",""],["Amato","Christopher",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 19:27:06 GMT"}],"updateDate":"2024-08-28","timestamp":1724700426000,"abstract":"  Centralized Training for Decentralized Execution where agents are trained\noffline in a centralized fashion and execute online in a decentralized manner,\nhas become a popular approach in Multi-Agent Reinforcement Learning (MARL). In\nparticular, it has become popular to develop actor-critic methods that train\ndecentralized actors with a centralized critic where the centralized critic is\nallowed access global information of the entire system, including the true\nsystem state. Such centralized critics are possible given offline information\nand are not used for online execution. While these methods perform well in a\nnumber of domains and have become a de facto standard in MARL, using a\ncentralized critic in this context has yet to be sufficiently analyzed\ntheoretically or empirically. In this paper, we therefore formally analyze\ncentralized and decentralized critic approaches, and analyze the effect of\nusing state-based critics in partially observable environments. We derive\ntheories contrary to the common intuition: critic centralization is not\nstrictly beneficial, and using state values can be harmful. We further prove\nthat, in particular, state-based critics can introduce unexpected bias and\nvariance compared to history-based critics. Finally, we demonstrate how the\ntheory applies in practice by comparing different forms of critics on a wide\nrange of common multi-agent benchmarks. The experiments show practical issues\nsuch as the difficulty of representation learning with partial observability,\nwhich highlights why the theoretical problems are often overlooked in the\nliterature.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}