{"id":"2408.00736","title":"Whistler waves in the young solar wind: statistics of amplitude and\n  propagation direction from Parker Solar Probe Encounters 1-11","authors":"Kyung-Eun Choi, Oleksiy Agapitov, Lucas Colomban, John W. Bonnell,\n  Forrest Mozer, Richard D. Sydora, Nour Raouafi, Thierry Dudok de Wit","authorsParsed":[["Choi","Kyung-Eun",""],["Agapitov","Oleksiy",""],["Colomban","Lucas",""],["Bonnell","John W.",""],["Mozer","Forrest",""],["Sydora","Richard D.",""],["Raouafi","Nour",""],["de Wit","Thierry Dudok",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 17:31:52 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 02:10:35 GMT"}],"updateDate":"2024-09-11","timestamp":1722533512000,"abstract":"  In the interplanetary space solar wind plasma, whistler waves are observed in\na wide range of heliocentric distance (from ~20 solar radii (RS) to Jupiter's\norbit). They are known to interact with solar wind suprathermal electrons\n(strahl and halo) and to regulate the solar wind heat flux through scattering\nthe strahl electrons. We present the results of applying the technique to\ndetermine the whistler wave propagation direction to the spectral data\ncontinuously collected by the FIELDS instruments aboard Parker Solar Probe\n(PSP). The technique was validated based on the results obtained from burst\nmode magnetic and electric field waveform data collected during Encounter 1. We\nestimated the effective length of the PSP electric field antennas (EFI) for a\nvariety of solar wind conditions in the whistler wave frequency range and\nutilized these estimates for determining the whistler wave properties during\nPSP Encounters 1-11. Our findings show that (1) the enhancement of the whistler\nwave occurrence rate and wave amplitudes observed between 25-35 RS is\npredominantly due to the sunward propagating whistler waves population\nassociated with the switchback-related magnetic dips; (2) the anti-sunward or\ncounter-propagating cases are observed at 30-40 RS; (3) between 40-50 RS,\nsunward and anti-sunward whistlers are observed with comparable occurrence\nrates; and (4) almost no sunward or counter-propagating whistlers were observed\nat heliocentric distances above 50 RS.\n","subjects":["Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}