{"id":"2408.00927","title":"Noise-Resilient and Reduced Depth Approximate Adders for NISQ Quantum\n  Computing","authors":"Bhaskar Gaur, Travis S. Humble, Himanshu Thapliyal","authorsParsed":[["Gaur","Bhaskar",""],["Humble","Travis S.",""],["Thapliyal","Himanshu",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 21:34:02 GMT"}],"updateDate":"2024-08-05","timestamp":1722548042000,"abstract":"  The \"Noisy intermediate-scale quantum\" NISQ machine era primarily focuses on\nmitigating noise, controlling errors, and executing high-fidelity operations,\nhence requiring shallow circuit depth and noise robustness. Approximate\ncomputing is a novel computing paradigm that produces imprecise results by\nrelaxing the need for fully precise output for error-tolerant applications\nincluding multimedia, data mining, and image processing. We investigate how\napproximate computing can improve the noise resilience of quantum adder\ncircuits in NISQ quantum computing. We propose five designs of approximate\nquantum adders to reduce depth while making them noise-resilient, in which\nthree designs are with carryout, while two are without carryout. We have used\nnovel design approaches that include approximating the Sum only from the inputs\n(pass-through designs) and having zero depth, as they need no quantum gates.\nThe second design style uses a single CNOT gate to approximate the SUM with a\nconstant depth of O(1). We performed our experimentation on IBM Qiskit on noise\nmodels including thermal, depolarizing, amplitude damping, phase damping, and\nbitflip: (i) Compared to exact quantum ripple carry adder without carryout the\nproposed approximate adders without carryout have improved fidelity ranging\nfrom 8.34% to 219.22%, and (ii) Compared to exact quantum ripple carry adder\nwith carryout the proposed approximate adders with carryout have improved\nfidelity ranging from 8.23% to 371%. Further, the proposed approximate quantum\nadders are evaluated in terms of various error metrics.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ELAvWK27qRapVIda5e0idt69s7BQK7ZTL4T2DAH4cP8","pdfSize":"621205","txDigest":"5Gdzr5ofQXrc7oYaV8uUxQSJjQi3r5GYGhUqYsA1j97W","endEpoch":"1","status":"CERTIFIED"}
