{"id":"2408.10360","title":"HaSPeR: An Image Repository for Hand Shadow Puppet Recognition","authors":"Syed Rifat Raiyan, Zibran Zarif Amio, Sabbir Ahmed","authorsParsed":[["Raiyan","Syed Rifat",""],["Amio","Zibran Zarif",""],["Ahmed","Sabbir",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:56:24 GMT"}],"updateDate":"2024-08-21","timestamp":1724093784000,"abstract":"  Hand shadow puppetry, also known as shadowgraphy or ombromanie, is a form of\ntheatrical art and storytelling where hand shadows are projected onto flat\nsurfaces to create illusions of living creatures. The skilled performers create\nthese silhouettes by hand positioning, finger movements, and dexterous gestures\nto resemble shadows of animals and objects. Due to the lack of practitioners\nand a seismic shift in people's entertainment standards, this art form is on\nthe verge of extinction. To facilitate its preservation and proliferate it to a\nwider audience, we introduce ${\\rm H{\\small A}SP{\\small E}R}$, a novel dataset\nconsisting of 8,340 images of hand shadow puppets across 11 classes extracted\nfrom both professional and amateur hand shadow puppeteer clips. We provide a\ndetailed statistical analysis of the dataset and employ a range of pretrained\nimage classification models to establish baselines. Our findings show a\nsubstantial performance superiority of traditional convolutional models over\nattention-based transformer architectures. We also find that lightweight\nmodels, such as MobileNetV2, suited for mobile applications and embedded\ndevices, perform comparatively well. We surmise that such low-latency\narchitectures can be useful in developing ombromanie teaching tools, and we\ncreate a prototype application to explore this surmission. Keeping the\nbest-performing model InceptionV3 under the limelight, we conduct comprehensive\nfeature-spatial, explainability, and error analyses to gain insights into its\ndecision-making process. To the best of our knowledge, this is the first\ndocumented dataset and research endeavor to preserve this dying art for future\ngenerations, with computer vision approaches. Our code and data are publicly\navailable.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"xrXpNhAYgYH0BzCGUFmef3ConmvMsGiTvND89BEH5Fk","pdfSize":"33951224"}
