{"id":"2408.06349","title":"Functional near-infrared spectroscopy (fNIRS) and Eye tracking for\n  Cognitive Load classification in a Driving Simulator Using Deep Learning","authors":"Mehshan Ahmed Khan, Houshyar Asadi, Mohammad Reza Chalak Qazani, Chee\n  Peng Lim, Saied Nahavandi","authorsParsed":[["Khan","Mehshan Ahmed",""],["Asadi","Houshyar",""],["Qazani","Mohammad Reza Chalak",""],["Lim","Chee Peng",""],["Nahavandi","Saied",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 03:50:37 GMT"}],"updateDate":"2024-08-14","timestamp":1721793037000,"abstract":"  Motion simulators allow researchers to safely investigate the interaction of\ndrivers with a vehicle. However, many studies that use driving simulator data\nto predict cognitive load only employ two levels of workload, leaving a gap in\nresearch on employing deep learning methodologies to analyze cognitive load,\nespecially in challenging low-light conditions. Often, studies overlook or\nsolely focus on scenarios in bright daylight. To address this gap and\nunderstand the correlation between performance and cognitive load, this study\nemploys functional near-infrared spectroscopy (fNIRS) and eye-tracking data,\nincluding fixation duration and gaze direction, during simulated driving tasks\nin low visibility conditions, inducing various mental workloads. The first\nstage involves the statistical estimation of useful features from fNIRS and\neye-tracking data. ANOVA will be applied to the signals to identify significant\nchannels from fNIRS signals. Optimal features from fNIRS, eye-tracking and\nvehicle dynamics are then combined in one chunk as input to the CNN and LSTM\nmodel to predict workload variations. The proposed CNN-LSTM model achieved 99%\naccuracy with neurological data and 89% with vehicle dynamics to predict\ncognitive load, indicating potential for real-time assessment of driver mental\nstate and guide designers for the development of safe adaptive systems.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}