{"id":"2408.08292","title":"Optimization by Decoded Quantum Interferometry","authors":"Stephen P. Jordan, Noah Shutty, Mary Wootters, Adam Zalcman, Alexander\n  Schmidhuber, Robbie King, Sergei V. Isakov, and Ryan Babbush","authorsParsed":[["Jordan","Stephen P.",""],["Shutty","Noah",""],["Wootters","Mary",""],["Zalcman","Adam",""],["Schmidhuber","Alexander",""],["King","Robbie",""],["Isakov","Sergei V.",""],["Babbush","Ryan",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 17:47:42 GMT"}],"updateDate":"2024-08-16","timestamp":1723744062000,"abstract":"  We introduce Decoded Quantum Interferometry (DQI), a quantum algorithm for\nreducing classical optimization problems to classical decoding problems by\nexploiting structure in the Fourier spectrum of the objective function. DQI\nreduces sparse max-XORSAT to decoding LDPC codes, which can be achieved using\npowerful classical algorithms such as Belief Propagation (BP). As an initial\nbenchmark, we compare DQI using belief propagation decoding against classical\noptimization via simulated annealing. In this setting we present evidence that,\nfor a certain family of max-XORSAT instances, DQI with BP decoding achieves a\nbetter approximation ratio on average than simulated annealing, although not\nbetter than specialized classical algorithms tailored to those instances. We\nalso analyze a combinatorial optimization problem corresponding to finding\npolynomials that intersect the maximum number of points. There, DQI efficiently\nachieves a better approximation ratio than any polynomial-time classical\nalgorithm known to us, thus realizing an apparent exponential quantum speedup.\nFinally, we show that the problem defined by Yamakawa and Zhandry in order to\nprove an exponential separation between quantum and classical query complexity\nis a special case of the optimization problem efficiently solved by DQI.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}