{"id":"2408.07070","title":"Large-kernel Convolutional Neural Networks for Wide Parameter-Space\n  Searches of Continuous Gravitational Waves","authors":"Prasanna Mohan Joshi, Reinhard Prix","authorsParsed":[["Joshi","Prasanna Mohan",""],["Prix","Reinhard",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 17:59:16 GMT"}],"updateDate":"2024-08-14","timestamp":1723571956000,"abstract":"  The sensitivity of wide-parameter-space searches for continuous gravitational\nwaves (CWs) is limited by their high computational cost. Deep learning is being\nstudied as an alternative method to replace various aspects of a CW search. In\nprevious work arXiv:2305.01057[gr-qc], new design principles were presented for\ndeep neural network (DNN) search of CWs and such DNNs were trained to perform a\ntargeted search with matched filtering sensitivity. In this paper, we adapt\nthese design principles to build a DNN architecture for wide parameter-space\nsearches in ten days of data from two detectors (H1 and L1). We train a DNN for\neach of the benchmark cases: six all-sky searches and eight directed searches\nat different frequencies in the search band of 20 - 1000 Hz. We compare our\nresults to the DNN sensitivity achieved from arXiv:2005.04140[gr-qc] and find\nthat our trained DNNs are more sensitive in all the cases. The absolute\nimprovement in detection probability ranges from 6.5% at 20 Hz to 38% at 1000\nHz in the all-sky cases and from 1.5% at 20 Hz to 59.4% at 500 Hz in the\ndirected cases. An all-sky DNN trained on the entire search band of 20 - 1000\nHz shows a high sensitivity at all frequencies providing a proof of concept for\ntraining a single DNN to perform the entire search. We also study the\ngeneralization of the DNN performance to signals with different signal\namplitude, frequency and the dependence of the DNN sensitivity on sky-position.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}