{"id":"2408.04732","title":"Modeling Athermal Phonons in Novel Materials using the G4CMP Simulation\n  Toolkit","authors":"Israel Hernandez, Ryan Linehan, Rakshya Khatiwada, Kester Anyang,\n  Daniel Baxter, Grace Bratrud, Enectali Figueroa-Feliciano, Lauren Hsu, Mike\n  Kelsey, Dylan Temples","authorsParsed":[["Hernandez","Israel",""],["Linehan","Ryan",""],["Khatiwada","Rakshya",""],["Anyang","Kester",""],["Baxter","Daniel",""],["Bratrud","Grace",""],["Figueroa-Feliciano","Enectali",""],["Hsu","Lauren",""],["Kelsey","Mike",""],["Temples","Dylan",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 19:11:27 GMT"}],"updateDate":"2024-08-12","timestamp":1723144287000,"abstract":"  Understanding phonon and charge propagation in superconducting devices plays\nan important role in both performing low-threshold dark matter searches and\nlimiting correlated errors in superconducting qubits. The Geant4 Condensed\nMatter Physics (G4CMP) package, originally developed for the Cryogenic Dark\nMatter Search (CDMS) experiment, models charge and phonon transport within\nsilicon and germanium detectors and has been validated by experimental\nmeasurements of phonon caustics, mean charge-carrier drift velocities, and heat\npulse propagation times. In this work, we present a concise framework for\nexpanding the capabilities for phonon transport to a number of other novel\nsubstrate materials of interest to the dark matter and quantum computing\ncommunities, including sapphire (Al$_{2}$O$_{3}$), gallium arsenide (GaAs),\nlithium fluoride (LiF), calcium tungstate (CaWO$_{4}$), and calcium fluoride\n(CaF$_{2}$). We demonstrate the use of this framework in generating phonon\ntransport properties of these materials and compare these properties with\nexperimentally-determined values where available.\n","subjects":["Physics/Instrumentation and Detectors","Condensed Matter/Materials Science","Physics/High Energy Physics - Experiment","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}