{"id":"2408.07058","title":"Categorical Framework for Typed Extensional and Intensional Models in\n  Formal Semantics","authors":"Daniel Quigley","authorsParsed":[["Quigley","Daniel",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 17:49:38 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 13:51:07 GMT"},{"version":"v3","created":"Wed, 4 Sep 2024 05:53:24 GMT"}],"updateDate":"2024-09-05","timestamp":1723571378000,"abstract":"  Intensional computation derives concrete outputs from abstract function\ndefinitions; extensional computation defines functions through explicit\ninput-output pairs. In formal semantics: intensional computation interprets\nexpressions as context-dependent functions; extensional computation evaluates\nexpressions based on their denotations in an otherwise fixed context. This\npaper reformulates typed extensional and intensional models of formal semantics\nwithin a category-theoretic framework and demonstrates their natural\nrepresentation therein. We construct $\\textbf{ModInt}$, the category of\nintensional models, building on the categories $\\textbf{Set}$ of sets,\n$\\textbf{Rel}$ of relations, and $\\textbf{Kr}$ and $\\textbf{Kr}_\\textbf{b}$ of\nKripke frames with monotone maps and bounded morphisms, respectively. We prove\nthat trivial intensional models are equivalent to extensional models, providing\na unified categorical representation of intensionality and extensionality in\nformal semantics. This approach reinterprets the relationship between\nintensions and extensions in a categorical framework and offers a modular,\norder-independent method for processing intensions and recovering extensions;\ncontextualizing the relationship between content and reference in\ncategory-theoretic terms. We discuss implications for natural language\nsemantics and propose future directions for contextual integration and\nexploring $\\textbf{ModInt}$'s algebraic properties.\n","subjects":["Mathematics/Category Theory","Mathematics/Logic"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}