{"id":"2408.03616","title":"Distillation Learning Guided by Image Reconstruction for One-Shot\n  Medical Image Segmentation","authors":"Feng Zhou, Yanjie Zhou, Longjie Wang, Yun Peng, David E. Carlson, and\n  Liyun Tu","authorsParsed":[["Zhou","Feng",""],["Zhou","Yanjie",""],["Wang","Longjie",""],["Peng","Yun",""],["Carlson","David E.",""],["Tu","Liyun",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 08:17:34 GMT"}],"updateDate":"2024-08-08","timestamp":1723018654000,"abstract":"  Traditional one-shot medical image segmentation (MIS) methods use\nregistration networks to propagate labels from a reference atlas or rely on\ncomprehensive sampling strategies to generate synthetic labeled data for\ntraining. However, these methods often struggle with registration errors and\nlow-quality synthetic images, leading to poor performance and generalization.\nTo overcome this, we introduce a novel one-shot MIS framework based on\nknowledge distillation, which allows the network to directly 'see' real images\nthrough a distillation process guided by image reconstruction. It focuses on\nanatomical structures in a single labeled image and a few unlabeled ones. A\nregistration-based data augmentation network creates realistic, labeled\nsamples, while a feature distillation module helps the student network learn\nsegmentation from these samples, guided by the teacher network. During\ninference, the streamlined student network accurately segments new images.\nEvaluations on three public datasets (OASIS for T1 brain MRI, BCV for abdomen\nCT, and VerSe for vertebrae CT) show superior segmentation performance and\ngeneralization across different medical image datasets and modalities compared\nto leading methods. Our code is available at\nhttps://github.com/NoviceFodder/OS-MedSeg.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lQFCsLRPM_qWlLYMfkmeCcev50F0nr-O0_iPqYaPOpQ","pdfSize":"7387120"}
