{"id":"2408.15530","title":"Nonlinear soft-tissue elasticity, remodeling, and degradation described\n  by an extended Finsler geometry","authors":"John D. Clayton","authorsParsed":[["Clayton","John D.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 04:27:45 GMT"}],"updateDate":"2024-08-29","timestamp":1724819265000,"abstract":"  A continuum mechanical theory incorporating an extension of Finsler geometry\nis formulated for fibrous soft solids. Especially if of biologic origin, such\nsolids are nonlinear elastic with evolving microstructures. For example,\nelongated cells or collagen fibers can stretch and rotate independently of\nmotions of their embedding matrix. Here, a director vector or internal state\nvector, not always of unit length, in generalized Finsler space relates to a\nphysical mechanism, with possible preferred direction and intensity, in the\nmicrostructure. Classical Finsler geometry is extended to accommodate multiple\ndirector vectors (i.e., multiple fibers in both a differential-geometric and\nphysical sense) at each point on the base manifold. A metric tensor can depend\non the ensemble of director vector fields. Residual or remnant strains from\nbiologic growth, remodeling, and degradation manifest as non-affine fiber and\nmatrix stretches. These remnant stretch fields are quantified by internal state\nvectors and a corresponding, generally non-Euclidean, metric tensor.\nEuler-Lagrange equations derived from a variational principle yield equilibrium\nconfigurations satisfying balances of forces from elastic energy, remodeling\nand cohesive energies, and external chemical-biological interactions. Given\ncertain assumptions, the model can reduce to a representation in Riemannian\ngeometry. Residual stresses that emerge from a non-Euclidean material metric in\nthe Riemannian setting are implicitly included in the Finslerian setting. The\ntheory is used to study stress and damage in the ventricle (heart muscle)\nexpanding or contracting under internal and external pressure. Remnant strains\nfrom remodeling can reduce stress concentrations and mitigate tissue damage\nunder severe loading.\n","subjects":["Condensed Matter/Soft Condensed Matter","Mathematics/Differential Geometry"],"license":"http://creativecommons.org/licenses/by/4.0/"}