{"id":"2408.06169","title":"New Ensemble Domain Decomposition Method for the Steady-state Random\n  Stokes-Darcy Coupled Problems with Uncertain Parameters","authors":"Chunchi Liu, Yao Rong, Yizhong Sun, Jiaping Yu, Haibiao Zheng","authorsParsed":[["Liu","Chunchi",""],["Rong","Yao",""],["Sun","Yizhong",""],["Yu","Jiaping",""],["Zheng","Haibiao",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 14:15:15 GMT"}],"updateDate":"2024-08-13","timestamp":1723472115000,"abstract":"  This paper presents two novel ensemble domain decomposition methods for\nfast-solving the Stokes-Darcy coupled models with random hydraulic conductivity\nand body force. To address such random systems, we employ the Monte Carlo (MC)\nmethod to generate a set of independent and identically distributed\ndeterministic model samples. To facilitate the fast calculation of these\nsamples, we adroitly integrate the ensemble idea with the domain decomposition\nmethod (DDM). This approach not only allows multiple linear problems to share a\nstandard coefficient matrix but also enables easy-to-use and convenient\nparallel computing. By selecting appropriate Robin parameters, we rigorously\nprove that the proposed algorithm has mesh-dependent and mesh-independent\nconvergence rates. For cases that require mesh-independent convergence, we\nadditionally provide optimized Robin parameters to achieve optimal convergence\nrates. We further adopt the multi-level Monte Carlo (MLMC) method to\nsignificantly lower the computational cost in the probability space, as the\nnumber of samples drops quickly when the mesh becomes finer. Building on our\nfindings, we propose two novel algorithms: MC ensemble DDM and MLMC ensemble\nDDM, specifically for random models. Furthermore, we strictly give the optimal\nconvergence order for both algorithms. Finally, we present several sets of\nnumerical experiments to showcase the efficiency of our algorithm.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}