{"id":"2408.15519","title":"Depth-Weighted Detection of Behaviours of Risk in People with Dementia\n  using Cameras","authors":"Pratik K. Mishra, Irene Ballester, Andrea Iaboni, Bing Ye, Kristine\n  Newman, Alex Mihailidis, Shehroz S. Khan","authorsParsed":[["Mishra","Pratik K.",""],["Ballester","Irene",""],["Iaboni","Andrea",""],["Ye","Bing",""],["Newman","Kristine",""],["Mihailidis","Alex",""],["Khan","Shehroz S.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 04:12:07 GMT"}],"updateDate":"2024-08-29","timestamp":1724818327000,"abstract":"  The behavioural and psychological symptoms of dementia, such as agitation and\naggression, present a significant health and safety risk in residential care\nsettings. Many care facilities have video cameras in place for digital\nmonitoring of public spaces, which can be leveraged to develop an automated\nbehaviours of risk detection system that can alert the staff to enable timely\nintervention and prevent the situation from escalating. However, one of the\nchallenges in our previous study was the presence of false alarms due to\nobstruction of view by activities happening close to the camera. To address\nthis issue, we proposed a novel depth-weighted loss function to train a\ncustomized convolutional autoencoder to enforce equivalent importance to the\nevents happening both near and far from the cameras; thus, helping to reduce\nfalse alarms and making the method more suitable for real-world deployment. The\nproposed method was trained using data from nine participants with dementia\nacross three cameras situated in a specialized dementia unit and achieved an\narea under the curve of receiver operating characteristic of $0.852$, $0.81$\nand $0.768$ for the three cameras. Ablation analysis was conducted for the\nindividual components of the proposed method and the performance of the\nproposed method was investigated for participant-specific and sex-specific\nbehaviours of risk detection. The proposed method performed reasonably well in\ndetecting behaviours of risk in people with dementia motivating further\nresearch toward the development of a behaviours of risk detection system\nsuitable for deployment in video surveillance systems in care facilities.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"h4PqaADDGE40qsNTFv-vz_cQtPYHzIUWrFOuuS1GfQ4","pdfSize":"2201882"}
