{"id":"2408.10064","title":"Understanding cyclists' perception of driverless vehicles through\n  eye-tracking and interviews","authors":"Siri Hegna Berge, Joost de Winter, Dimitra Dodou, Amir Pooyan Afghari,\n  Eleonora Papadimitriou, Nagarjun Reddy, Yongqi Dong, Narayana Raju, Haneen\n  Farah","authorsParsed":[["Berge","Siri Hegna",""],["de Winter","Joost",""],["Dodou","Dimitra",""],["Afghari","Amir Pooyan",""],["Papadimitriou","Eleonora",""],["Reddy","Nagarjun",""],["Dong","Yongqi",""],["Raju","Narayana",""],["Farah","Haneen",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 14:58:25 GMT"}],"updateDate":"2024-08-20","timestamp":1724079505000,"abstract":"  As automated vehicles (AVs) become increasingly popular, the question arises\nas to how cyclists will interact with such vehicles. This study investigated\n(1) whether cyclists spontaneously notice if a vehicle is driverless, (2) how\nwell they perform a driver-detection task when explicitly instructed, and (3)\nhow they carry out such tasks. Using a Wizard-of-Oz method, 37 participants\ncycled a designated route and encountered an AV multiple times in two\nexperimental sessions. In Session 1, participants cycled the route\nuninstructed, while in Session 2, they were instructed to verbally report\nwhether they detected the presence or absence of a driver. Additionally, we\nrecorded the participants' gaze behaviour with eye-tracking and their responses\nin post-session interviews. The interviews revealed that 30% of the cyclists\nspontaneously mentioned the absence of a driver (Session 1), and when\ninstructed (Session 2), they detected the absence and presence of the driver\nwith 93% accuracy. The eye-tracking data showed that cyclists looked more\nfrequently and longer at the vehicle in Session 2 compared to Session 1.\nFurthermore, participants exhibited intermittent sampling of the vehicle, and\nthey looked in front of the vehicle when it was far away and towards the\nwindshield region when it was closer. The post-session interviews also\nindicated that participants were curious, felt safe, and reported a need to\nreceive information about the AV's driving state. In conclusion, cyclists can\ndetect the absence of a driver in the AV, and this detection may influence\ntheir perceptions of safety. Further research is needed to explore these\nfindings in real-world traffic conditions.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/"}