{"id":"2408.13072","title":"Photofragmentation of Corannulene (C20H10) and Sumanene (C21H12) cations\n  in gas phase and its Astrophysical implications","authors":"P. Sundararajan, A. Candian, J. Kamer, H. Linnartz, A.G.G.M. Tielens","authorsParsed":[["Sundararajan","P.",""],["Candian","A.",""],["Kamer","J.",""],["Linnartz","H.",""],["Tielens","A. G. G. M.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 13:55:41 GMT"}],"updateDate":"2024-08-26","timestamp":1724421341000,"abstract":"  The aromatic infrared Bands (AIBs) dominate the mid-infrared spectra of many\ngalactic and extragalactic sources. These AIBs are generally attributed to\nfluorescent emission from aromatic molecules. Unified efforts from\nexperimentalists and theoreticians to assign these AIB features have recently\ngotten additional impetus with the launch of the James Webb Space Telescope\n(JWST) as the Mid-InfraRed Instrument (MIRI) delivers mid-IR spectrum with\ngreatly increased sensitivity and spectral resolution. PAHs in space can exist\nin either neutral or ionic forms, absorb UV photons and undergo fragmentation,\nbecoming a rich source of small hydrocarbons. This top-down mechanism of larger\nPAHs fragmenting into smaller species is of utmost importance in\nphoto-dissociation regions (PDR) in space. In this work, we experimentally and\ntheoretically investigate the photo-fragmentation pathways of two\nastronomically significant PAH cations - corannulene (C20H10) and sumanene\n(C21H12) that are structural motifs of fullerene C60, to understand their\nsequential fragmentation pathways. The photo-fragmentation experiments exhibit\nchannels that are much different from planar PAHs. The breakdown of carbon\nskeleton is found to have different pathways for C20H10 and C21H12 because of\nthe number and positioning of pentagon rings; yet the most abundant low mass\ncations produced by these two species are found to be similar. The low mass\ncations showcased in this work could be of interest for their astronomical\ndetections. For completeness, the qualitative photo fragmentation behaviour of\nthe dicationic corannulene and sumanene have also been experimented, but the\npotential energy surface of these dications are beyond the scope of this paper.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}