{"id":"2408.04581","title":"Probing the morphology of polarized emission induced by fluctuation\n  dynamo using Minkowski functionals","authors":"Riju Dutta, Sharanya Sur, Aritra Basu","authorsParsed":[["Dutta","Riju",""],["Sur","Sharanya",""],["Basu","Aritra",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 16:44:46 GMT"}],"updateDate":"2024-08-09","timestamp":1723135486000,"abstract":"  The morphology and the characteristic scale of polarized structures provide\ncrucial insights into the mechanisms that drives turbulence and maintains\nmagnetic fields in magneto-ionic plasma. We aim to establish the efficacy of\nMinkowski functionals as quantitative statistical probes of filamentary\nmorphology of polarized synchrotron emission resulting from fluctuation dynamo\naction. Using synthetic observations generated from magnetohydrodynamic\nsimulations of fluctuation dynamos with varying driving scales ($\\ell_{\\rm f}$)\nof turbulence in isothermal, incompressible, and subsonic media, we study the\nrelation between different morphological measures, and their connection to\nfractional polarization ($p_{\\rm f}$). We find that Faraday depolarization at\nlow frequencies give rise to small-scale polarized structures that have higher\nfilamentarity as compared to the intrinsic structures that are comparable to\n$\\ell_{\\rm f}$. Above $\\sim3\\,{\\rm GHz}$, the number of connected polarized\nstructures per unit area ($N_{\\rm CC, peak}$) is related to the mean $p_{\\rm\nf}$ ($\\langle p_{\\rm f} \\rangle$) of the emitting region as $\\langle p_{\\rm f}\n\\rangle \\propto N_{\\rm CC, peak}^{-1/4}$, provided the scale of the detectable\nemitting region is larger than $\\ell_{\\rm f}$. This implies that $N_{\\rm\nCC,peak}$ represents the number of turbulent cells projected on the plane of\nthe sky and can be directly used to infer $\\ell_{\\rm f}$ via the relation\n$\\ell_{\\rm f} \\propto N_{\\rm CC,peak}^{-1/2}$. An estimate on $\\ell_{\\rm f}$\nthus directly allows for pinning down the turbulence driving mechanism in\nastrophysical systems. While the simulated conditions are mostly prevalent in\nthe intracluster medium of galaxy clusters, the qualitative morphological\nfeatures are also applicable in the context of interstellar medium in galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UhQ8_sGCBPS0iAp5wP2Ic1SlGhKsehGzzPIPar9tOIE","pdfSize":"1389678"}
