{"id":"2408.07533","title":"Information-Theoretic Measures on Lattices for High-Order Interactions","authors":"Zhaolu Liu, Mauricio Barahona, Robert L. Peach","authorsParsed":[["Liu","Zhaolu",""],["Barahona","Mauricio",""],["Peach","Robert L.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 13:04:34 GMT"}],"updateDate":"2024-08-15","timestamp":1723640674000,"abstract":"  Traditional models reliant solely on pairwise associations often prove\ninsufficient in capturing the complex statistical structure inherent in\nmultivariate data. Yet existing methods for identifying information shared\namong groups of $d>3$ variables are often intractable; asymmetric around a\ntarget variable; or unable to consider all factorisations of the joint\nprobability distribution. Here, we present a framework that systematically\nderives high-order measures using lattice and operator function pairs, whereby\nthe lattice captures the algebraic relational structure of the variables and\nthe operator function computes measures over the lattice. We show that many\nexisting information-theoretic high-order measures can be derived by using\ndivergences as operator functions on sublattices of the partition lattice, thus\npreventing the accurate quantification of all interactions for $d>3$.\nSimilarly, we show that using the KL divergence as the operator function also\nleads to unwanted cancellation of interactions for $d>3$. To characterise all\ninteractions among $d$ variables, we introduce the Streitberg information\ndefined on the full partition lattice using generalisations of the KL\ndivergence as operator functions. We validate our results numerically on\nsynthetic data, and illustrate the use of the Streitberg information through\napplications to stock market returns and neural electrophysiology data.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}