{"id":"2408.02069","title":"Three-phase equilibria of hydrates from computer simulation. II.\n  Finite-size effects in the carbon dioxide hydrate","authors":"J. Algaba, S. Blazquez, E. Feria, J. M. M\\'iguez, M. M. Conde, and F.\n  J. Blas","authorsParsed":[["Algaba","J.",""],["Blazquez","S.",""],["Feria","E.",""],["Míguez","J. M.",""],["Conde","M. M.",""],["Blas","F. J.",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 15:44:36 GMT"}],"updateDate":"2024-08-06","timestamp":1722786276000,"abstract":"  In this work, the effects of finite size on the determination of the\nthree-phase coexistence temperature ($T_3$) of carbon dioxide (CO$_2$) hydrate\nhave been studied by molecular dynamic simulations and using the direct\ncoexistence technique. According to this technique, the three phases involved\nare placed together in the same simulation box. By varying the number of\nmolecules of each phase it is possible to analyze the effect of simulation size\nand stoichiometry on the $T_3$ determination. In this work, we have determined\nthe $T_3$ value at 8 different pressures and using 6 different simulation boxes\nwith different numbers of molecules and sizes. In 2 of these configurations,\nthe ratio of the number of water and CO$_2$ molecules in the aqueous solution\nand the liquid CO$_2$ phase is the same as in the hydrate (stoichiometric\nconfiguration). In both stoichiometric configurations, the formation of a\nliquid drop of CO$_2$ in the aqueous phase is observed. This drop, which has a\ncylindrical geometry, increases the amount of CO$_2$ available in the aqueous\nsolution and can in some cases lead to the crystallization of the hydrate at\ntemperatures above $T_3$, overestimating the $T_3$ value obtained from direct\ncoexistence simulations. The simulation results obtained for the CO$_{2}$\nhydrate confirm the sensitivity of $T_{3}$ depending on the size and\ncomposition of the system, explaining the discrepancies observed in the\noriginal work by M\\'iguez \\emph{et al.} Non-stoichiometric configurations with\nlarger unit cells show convergence of $T_{3}$ values, suggesting that\nfinite-size effects for these system sizes, regardless of drop formation, can\nbe safely neglected. The results obtained in this work highlight that the\nchoice of a correct initial configuration is essential to accurately estimate\nthe three-phase coexistence temperature of hydrates by direct coexistence\nsimulations.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AknpimkVqexoByBENNeVphrsqLnIUfqMw43C9SGFsoI","pdfSize":"7018705","txDigest":"9V4GgGCQ8zUuFoQSM6NyNzQr2aKL4AE5fWk2AZMNaLGV","endEpoch":"1","status":"CERTIFIED"}
