{"id":"2408.16596","title":"Investigations on assembly and coverage for modular focal planes of\n  multiplexed telescopes","authors":"Maxime Rombach, Xiangyu Xu, Ricardo Araujo, Markus Thurneysen, Stefane\n  Caseiro, Corentin Magnenat, Joseph H. Silber, Malak Galal, David Schlegel and\n  Jean-Paul Kneib","authorsParsed":[["Rombach","Maxime",""],["Xu","Xiangyu",""],["Araujo","Ricardo",""],["Thurneysen","Markus",""],["Caseiro","Stefane",""],["Magnenat","Corentin",""],["Silber","Joseph H.",""],["Galal","Malak",""],["Schlegel","David",""],["Kneib","Jean-Paul",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 15:03:13 GMT"}],"updateDate":"2024-08-30","timestamp":1724943793000,"abstract":"  Multiplexed surveys have the ambition to grow larger for the next generation\nof focal plane instruments. Future projects such as Spec-S5, MUST, and WST have\nan ever-growing need for multi-object spectroscopy (13,000 - 20,000\nsimultaneous objects) which demands further investigations of novel focal plane\ninstrumentation. In this paper, we present a rigorous study of focal plane\ncoverage optimization and assembly of triangular modules of alpha-beta fiber\npositioners with a 6.2 mm pitch. The main focus here is to examine different\nmodule arrangements namely, framed, semi-frameless, and fullyframeless\nassemblies. Framed and semi-frameless describe here the usage of a manufactured\nfocal plate to hold the modules together and provide the correct focus and tilt\nto the fibers. Work on automatically generating such focal plates for project\nadaptability and ease of manufacturing will also be presented. On the other\nhand, the frameless approach proposes a connection method freed from the need\nof a focal plate. The following paper will also present their capabilities to\nmeet the requirements for focal plane assembly such as focus, tilt and\ncoverage.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}