{"id":"2408.07936","title":"A quantum-classical hybrid algorithm with Ising model for the learning\n  with errors problem","authors":"Muxi Zheng, Jinfeng Zeng, Wentao Yang, Pei-Jie Chang, Bao Yan, Haoran\n  Zhang, Min Wang, Shijie Wei, Gui-Lu Long","authorsParsed":[["Zheng","Muxi",""],["Zeng","Jinfeng",""],["Yang","Wentao",""],["Chang","Pei-Jie",""],["Yan","Bao",""],["Zhang","Haoran",""],["Wang","Min",""],["Wei","Shijie",""],["Long","Gui-Lu",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 05:11:35 GMT"}],"updateDate":"2024-08-16","timestamp":1723698695000,"abstract":"  The Learning-With-Errors (LWE) problem is a crucial computational challenge\nwith significant implications for post-quantum cryptography and computational\nlearning theory. Here we propose a quantum-classical hybrid algorithm with\nIsing model (HAWI) to address the LWE problem. Our approach involves\ntransforming the LWE problem into the Shortest Vector Problem (SVP), using\nvariable qubits to encode lattice vectors into an Ising Hamiltonian. We then\nidentify the low-energy levels of the Hamiltonian to extract the solution,\nmaking it suitable for implementation on current noisy intermediate-scale\nquantum (NISQ) devices. We prove that the number of qubits required is less\nthan $m(3m-1)/2$, where $m$ is the number of samples in the algorithm. Our\nalgorithm is heuristic, and its time complexity depends on the specific quantum\nalgorithm employed to find the Hamiltonian's low-energy levels. If the Quantum\nApproximate Optimization Algorithm (QAOA) is used to solve the Ising\nHamiltonian problem, and the number of iterations satisfies $y < O\\left(m\\log\nm\\cdot 2^{0.2972k}/pk^2\\right)$, our algorithm will outperform the classical\nBlock Korkine-Zolotarev (BKZ) algorithm, where $k$ is the block size related to\nproblem parameters, and $p$ is the number of layers in QAOA. We demonstrate the\nalgorithm by solving a $2$-dimensional LWE problem on a real quantum device\nwith $5$ qubits, showing its potential for solving meaningful instances of the\nLWE problem in the NISQ era.\n","subjects":["Physics/Quantum Physics","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ZScfiLW6ugqiGfqzrYYiDO5NW5VfRy9q2QyC-swkig4","pdfSize":"1029497"}
