{"id":"2408.02272","title":"COM Kitchens: An Unedited Overhead-view Video Dataset as a\n  Vision-Language Benchmark","authors":"Koki Maeda, Tosho Hirasawa, Atsushi Hashimoto, Jun Harashima, Leszek\n  Rybicki, Yusuke Fukasawa, Yoshitaka Ushiku","authorsParsed":[["Maeda","Koki",""],["Hirasawa","Tosho",""],["Hashimoto","Atsushi",""],["Harashima","Jun",""],["Rybicki","Leszek",""],["Fukasawa","Yusuke",""],["Ushiku","Yoshitaka",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 07:00:10 GMT"}],"updateDate":"2024-08-06","timestamp":1722841210000,"abstract":"  Procedural video understanding is gaining attention in the vision and\nlanguage community. Deep learning-based video analysis requires extensive data.\nConsequently, existing works often use web videos as training resources, making\nit challenging to query instructional contents from raw video observations. To\naddress this issue, we propose a new dataset, COM Kitchens. The dataset\nconsists of unedited overhead-view videos captured by smartphones, in which\nparticipants performed food preparation based on given recipes. Fixed-viewpoint\nvideo datasets often lack environmental diversity due to high camera setup\ncosts. We used modern wide-angle smartphone lenses to cover cooking counters\nfrom sink to cooktop in an overhead view, capturing activity without in-person\nassistance. With this setup, we collected a diverse dataset by distributing\nsmartphones to participants. With this dataset, we propose the novel\nvideo-to-text retrieval task Online Recipe Retrieval (OnRR) and new video\ncaptioning domain Dense Video Captioning on unedited Overhead-View videos\n(DVC-OV). Our experiments verified the capabilities and limitations of current\nweb-video-based SOTA methods in handling these tasks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computation and Language","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gdo3rgQW8tjWdM9oLSpho09qJHc2GPpA2XYwksJJ4P0","pdfSize":"7950540"}
