{"id":"2408.03304","title":"Fusing Forces: Deep-Human-Guided Refinement of Segmentation Masks","authors":"Rafael Sterzinger, Christian Stippel, Robert Sablatnig","authorsParsed":[["Sterzinger","Rafael",""],["Stippel","Christian",""],["Sablatnig","Robert",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 17:11:40 GMT"}],"updateDate":"2024-08-07","timestamp":1722964300000,"abstract":"  Etruscan mirrors constitute a significant category in Etruscan art,\ncharacterized by elaborate figurative illustrations featured on their backside.\nA laborious and costly aspect of their analysis and documentation is the task\nof manually tracing these illustrations. In previous work, a methodology has\nbeen proposed to automate this process, involving photometric-stereo scanning\nin combination with deep neural networks. While achieving quantitative\nperformance akin to an expert annotator, some results still lack qualitative\nprecision and, thus, require annotators for inspection and potential\ncorrection, maintaining resource intensity. In response, we propose a deep\nneural network trained to interactively refine existing annotations based on\nhuman guidance. Our human-in-the-loop approach streamlines annotation,\nachieving equal quality with up to 75% less manual input required. Moreover,\nduring the refinement process, the relative improvement of our methodology over\npure manual labeling reaches peak values of up to 26%, attaining drastically\nbetter quality quicker. By being tailored to the complex task of segmenting\nintricate lines, specifically distinguishing it from previous methods, our\napproach offers drastic improvements in efficacy, transferable to a broad\nspectrum of applications beyond Etruscan mirrors.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"qVxeTHNXKyD4nJFlX5fi0MZP77155CwjgkD06pSKmRs","pdfSize":"7251560"}
