{"id":"2408.08873","title":"Accelerating Giant Impact Simulations with Machine Learning","authors":"Caleb Lammers, Miles Cranmer, Sam Hadden, Shirley Ho, Norman Murray,\n  Daniel Tamayo","authorsParsed":[["Lammers","Caleb",""],["Cranmer","Miles",""],["Hadden","Sam",""],["Ho","Shirley",""],["Murray","Norman",""],["Tamayo","Daniel",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 17:59:46 GMT"}],"updateDate":"2024-08-19","timestamp":1723831186000,"abstract":"  Constraining planet formation models based on the observed exoplanet\npopulation requires generating large samples of synthetic planetary systems,\nwhich can be computationally prohibitive. A significant bottleneck is\nsimulating the giant impact phase, during which planetary embryos evolve\ngravitationally and combine to form planets, which may themselves experience\nlater collisions. To accelerate giant impact simulations, we present a machine\nlearning (ML) approach to predicting collisional outcomes in multiplanet\nsystems. Trained on more than 500,000 $N$-body simulations of three-planet\nsystems, we develop an ML model that can accurately predict which two planets\nwill experience a collision, along with the state of the post-collision\nplanets, from a short integration of the system's initial conditions. Our model\ngreatly improves on non-ML baselines that rely on metrics from dynamics theory,\nwhich struggle to accurately predict which pair of planets will experience a\ncollision. By combining with a model for predicting long-term stability, we\ncreate an efficient ML-based giant impact emulator, which can predict the\noutcomes of giant impact simulations with a speedup of up to four orders of\nmagnitude. We expect our model to enable analyses that would not otherwise be\ncomputationally feasible. As such, we release our full training code, along\nwith an easy-to-use API for our collision outcome model and giant impact\nemulator.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}