{"id":"2408.01956","title":"Enhancing Spatial Multiplexing and Interference Suppression for Near-\n  and Far-Field Communications with Sparse MIMO","authors":"Huizhi Wang, Chao Feng, Yong Zeng, Shi Jin, Chau Yuen, Bruno Clerckx,\n  and Rui Zhang","authorsParsed":[["Wang","Huizhi",""],["Feng","Chao",""],["Zeng","Yong",""],["Jin","Shi",""],["Yuen","Chau",""],["Clerckx","Bruno",""],["Zhang","Rui",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 08:12:21 GMT"}],"updateDate":"2024-08-06","timestamp":1722759141000,"abstract":"  Multiple-input multiple-output has been a key technology for wireless systems\nfor decades. For typical MIMO communication systems, antenna array elements are\nusually separated by half of the carrier wavelength, thus termed as\nconventional MIMO. In this paper, we investigate the performance of multi-user\nMIMO communication, with sparse arrays at both the transmitter and receiver\nside, i.e., the array elements are separated by more than half wavelength.\nGiven the same number of array elements, the performance of sparse MIMO is\ncompared with conventional MIMO. On one hand, sparse MIMO has a larger\naperture, which can achieve narrower main lobe beams that make it easier to\nresolve densely located users. Besides, increased array aperture also enlarges\nthe near-field communication region, which can enhance the spatial multiplexing\ngain, thanks to the spherical wavefront property in the near-field region. On\nthe other hand, element spacing larger than half wavelength leads to undesired\ngrating lobes, which, if left unattended, may cause severe inter-user\ninterference. To gain further insights, we first study the spatial multiplexing\ngain of the basic single-user sparse MIMO communication system, where a\nclosed-form expression of the near-field effective degree of freedom is\nderived. The result shows that the EDoF increases with the array sparsity for\nsparse MIMO before reaching its upper bound, which equals to the minimum value\nbetween the transmit and receive antenna numbers. Furthermore, the scaling law\nfor the achievable data rate with varying array sparsity is analyzed and an\narray sparsity-selection strategy is proposed. We then consider the more\ngeneral multi-user sparse MIMO communication system. It is shown that sparse\nMIMO is less likely to experience severe IUI than conventional MIMO.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}