{"id":"2408.17417","title":"Magnetic and crystal electric field studies in the rare-earth-based\n  square lattice antiferromagnet NdKNaNbO$_5$","authors":"S. Guchhait, A. Painganoor, S. S. Islam, J. Sichelschmidt, M. D. Le,\n  N. B. Christensen, and R. Nath","authorsParsed":[["Guchhait","S.",""],["Painganoor","A.",""],["Islam","S. S.",""],["Sichelschmidt","J.",""],["Le","M. D.",""],["Christensen","N. B.",""],["Nath","R.",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 17:03:25 GMT"}],"updateDate":"2024-09-02","timestamp":1725037405000,"abstract":"  The interplay of magnetic correlations, crystal electric field interactions,\nand spin-orbit coupling in low-dimensional frustrated magnets fosters novel\nground states with unusual excitations. Here, we report the magnetic properties\nand crystal electric field (CEF) scheme of a rare-earth-based square-lattice\nantiferromagnet NdKNaNbO$_5$ investigated via magnetization, specific heat,\nelectron spin resonance (ESR), and inelastic neutron scattering (INS)\nexperiments. The low-temperature Curie-Weiss temperature $\\theta_{\\rm CW}\n\\simeq -0.6$ K implies net antiferromagnetic interactions between the Nd$^{3+}$\nions. Two broad maxima are observed in the low temperature specific heat data\nin magnetic fields, indicating multilevel Schottky anomalies due to the effect\nof CEF. No magnetic long-range-order is detected down to 0.4 K. The CEF\nexcitations of Kramers' ion Nd$^{3+}$ ($J=9/2$) probed via INS experiments\nevince dispersionless excitations characterizing the transitions among the CEF\nenergy levels. The fit of the INS spectra enabled the mapping of the CEF\nHamiltonian and the energy eigenvalues of the Kramers' doublets. The simulation\nusing the obtained CEF parameters reproduces the broad maxima in specific heat\nin zero-field as well as in different applied fields. The significant\ncontribution from $J_z = \\pm 1/2$ state to the wave function of the ground\nstate doublet indicates the role of strong quantum fluctuations at low\ntemperatures. The magnetic ground state is found to be a Kramers' doublet with\neffective spin $J_{\\rm eff} = 1/2$ at low temperatures.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}