{"id":"2408.05341","title":"CAR: Contrast-Agnostic Deformable Medical Image Registration with\n  Contrast-Invariant Latent Regularization","authors":"Yinsong Wang, Siyi Du, Shaoming Zheng, Xinzhe Luo, Chen Qin","authorsParsed":[["Wang","Yinsong",""],["Du","Siyi",""],["Zheng","Shaoming",""],["Luo","Xinzhe",""],["Qin","Chen",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 19:46:23 GMT"}],"updateDate":"2024-08-13","timestamp":1722714383000,"abstract":"  Multi-contrast image registration is a challenging task due to the complex\nintensity relationships between different imaging contrasts. Conventional image\nregistration methods are typically based on iterative optimizations for each\ninput image pair, which is time-consuming and sensitive to contrast variations.\nWhile learning-based approaches are much faster during the inference stage, due\nto generalizability issues, they typically can only be applied to the fixed\ncontrasts observed during the training stage. In this work, we propose a novel\ncontrast-agnostic deformable image registration framework that can be\ngeneralized to arbitrary contrast images, without observing them during\ntraining. Particularly, we propose a random convolution-based contrast\naugmentation scheme, which simulates arbitrary contrasts of images over a\nsingle image contrast while preserving their inherent structural information.\nTo ensure that the network can learn contrast-invariant representations for\nfacilitating contrast-agnostic registration, we further introduce\ncontrast-invariant latent regularization (CLR) that regularizes representation\nin latent space through a contrast invariance loss. Experiments show that CAR\noutperforms the baseline approaches regarding registration accuracy and also\npossesses better generalization ability to unseen imaging contrasts. Code is\navailable at \\url{https://github.com/Yinsong0510/CAR}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}