{"id":"2408.04641","title":"GPT-3 Powered Information Extraction for Building Robust Knowledge Bases","authors":"Ritabrata Roy Choudhury, Soumik Dey","authorsParsed":[["Choudhury","Ritabrata Roy",""],["Dey","Soumik",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 14:59:29 GMT"}],"updateDate":"2024-08-12","timestamp":1722437969000,"abstract":"  This work uses the state-of-the-art language model GPT-3 to offer a novel\nmethod of information extraction for knowledge base development. The suggested\nmethod attempts to solve the difficulties associated with obtaining relevant\nentities and relationships from unstructured text in order to extract\nstructured information. We conduct experiments on a huge corpus of text from\ndiverse fields to assess the performance of our suggested technique. The\nevaluation measures, which are frequently employed in information extraction\ntasks, include precision, recall, and F1-score. The findings demonstrate that\nGPT-3 can be used to efficiently and accurately extract pertinent and correct\ninformation from text, hence increasing the precision and productivity of\nknowledge base creation. We also assess how well our suggested approach\nperforms in comparison to the most advanced information extraction techniques\nalready in use. The findings show that by utilizing only a small number of\ninstances in in-context learning, our suggested strategy yields competitive\noutcomes with notable savings in terms of data annotation and engineering\nexpense. Additionally, we use our proposed method to retrieve Biomedical\ninformation, demonstrating its practicality in a real-world setting. All things\nconsidered, our suggested method offers a viable way to overcome the\ndifficulties involved in obtaining structured data from unstructured text in\norder to create knowledge bases. It can greatly increase the precision and\neffectiveness of information extraction, which is necessary for many\napplications including chatbots, recommendation engines, and question-answering\nsystems.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}