{"id":"2408.14033","title":"MLR-Copilot: Autonomous Machine Learning Research based on Large\n  Language Models Agents","authors":"Ruochen Li, Teerth Patel, Qingyun Wang, Xinya Du","authorsParsed":[["Li","Ruochen",""],["Patel","Teerth",""],["Wang","Qingyun",""],["Du","Xinya",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 05:55:48 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 05:55:06 GMT"}],"updateDate":"2024-09-04","timestamp":1724651748000,"abstract":"  Machine learning research, crucial for technological advancements and\ninnovation, often faces significant challenges due to its inherent complexity,\nslow pace of experimentation, and the necessity for specialized expertise.\nMotivated by this, we present a new systematic framework, autonomous Machine\nLearning Research with large language models (MLR-Copilot), designed to enhance\nmachine learning research productivity through the automatic generation and\nimplementation of research ideas using Large Language Model (LLM) agents. The\nframework consists of three phases: research idea generation, experiment\nimplementation, and implementation execution. First, existing research papers\nare used to generate hypotheses and experimental plans vis IdeaAgent powered by\nLLMs. Next, the implementation generation phase translates these plans into\nexecutables with ExperimentAgent. This phase leverages retrieved prototype code\nand optionally retrieves candidate models and data. Finally, the execution\nphase, also managed by ExperimentAgent, involves running experiments with\nmechanisms for human feedback and iterative debugging to enhance the likelihood\nof achieving executable research outcomes. We evaluate our framework on five\nmachine learning research tasks and the experimental results show the\nframework's potential to facilitate the research progress and innovations.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}