{"id":"2408.13917","title":"Obtaining the Radiated Gravitational Wave Energy via Relativistic\n  Kinetic Theory: A Kinetic Gas Model of an Idealized Coalescing Binary","authors":"Noah M. MacKay","authorsParsed":[["MacKay","Noah M.",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 19:03:18 GMT"}],"updateDate":"2024-08-27","timestamp":1724612598000,"abstract":"  The final pulse of gravitational wave emission is released in the chirp phase\nof binary coalescence. This proposes that the radiated energy of the GW is\nproportional to the chirp mass $\\mathcal{M}$, with detection reports revealing\nthe approximate scaling of $E_{\\mathrm{GW}}\\approx\\mathcal{M}/10$. While this\nscaling is evident in numerical relativity, there lacks an analytical\nexpression supporting the relation. This study utilizes a heuristic application\nof relativistic kinetic theory and massless Bose-Einstein statistics of an\nentropic graviton gas to GW formation throughout binary coalescence. This\napproach to GW formation obtains an expression of an effective thermal energy\nas the radiated GW energy, which extracts the nearly one-tenth scaling of the\nchirp mass, namely at the chirp phase. Furthermore, it agrees well with the\ndetected energies with 1:1 ratio values ranging from 0.932 for GW150914 to\n0.998 for one of three waveform models of GW190521, with 0.851 as an outlier\nfor GW170104. Utilization of a quantum-classical correspondence enabled\ndiscussions regarding the usage of equilibrium noise analysis on the graviton\ngas and kinetic characteristics of the graviton gas during and after\ncoalescence. The latter topic includes, but is not limited to, GW/graviton\nwave-particle duality, a calculation of the high-energy graviton-graviton total\ncross section as 1.16% of the chirp mass surface area $A=16\\pi\nG^2\\mathcal{M}^2$, and humoring the thought experiment of black hole gravitons.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"R5DxGqif6Tzt-cJPuW5zQ_oBFWi68gfvW_BT_SzPoMw","pdfSize":"5068334"}
