{"id":"2408.03157","title":"Narrowband-IoT (NB-IoT) and IoT Use Cases in Universities, Campuses, and\n  Educational Institutions: A Research Analysis","authors":"Lyberius Ennio F.Taruc, Arvin R.De La Cruz","authorsParsed":[["Taruc","Lyberius Ennio F.",""],["De La Cruz","Arvin R.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 12:55:20 GMT"}],"updateDate":"2024-08-16","timestamp":1722948920000,"abstract":"  The main objective of this research paper is to analyze the available use\ncases of Narrowband-IoT and IoT in universities, campuses, and educational\ninstitutions. A literature review was conducted using multiple databases such\nas IEEE Xplore, ACM Digital Library, and Scopus. The study explores the\nbenefits of IoT adoption in higher education. Various use cases of NB-IoT in\neducational institutions were analyzed, including smart campus management,\nasset tracking, monitoring, and safety and security systems. Of the six use\ncases assessed, three focused on the deployment of IoT Things, while three\nfocused on NB-IoT Connectivity. The research paper concludes that NB-IoT\ntechnology has significant potential to enhance various aspects of educational\ninstitutions, from smart campus management to improving safety and security\nsystems. The study recommends further exploration and implementation of NB-IoT\ntechnology in educational settings to improve efficiency, security, and overall\ncampus management. The research highlights the potential applications of NB-IoT\nin universities and educational institutions, paving the way for future studies\nin this area. The social implications of this research could involve enhancing\nthe overall learning experience for students, improving campus safety, and\npromoting technological advancements in educational settings.\n  Keywords: narrowband-IoT, Internet-of-Things, smart campus, smart\ninstitutions\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/"}