{"id":"2408.00239","title":"Simulating intermediate black hole mass measurements for a sample of\n  galaxies with nuclear star clusters using ELT/HARMONI high spatial resolution\n  integral-field stellar kinematics","authors":"Dieu D. Nguyen, Michele Cappellari, Hai N. Ngo, Tinh Q. T. Le, Khue N\n  .H. Ho, An K. Nguyen, Huy G .Tong, Phong T. On, Tuan N. Le, and Miguel\n  Pereira-Santaella","authorsParsed":[["Nguyen","Dieu D.",""],["Cappellari","Michele",""],["Ngo","Hai N.",""],["Le","Tinh Q. T.",""],["Ho","Khue N . H.",""],["Nguyen","An K.",""],["Tong","Huy G .",""],["On","Phong T.",""],["Le","Tuan N.",""],["Pereira-Santaella","Miguel",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 02:31:01 GMT"}],"updateDate":"2024-08-02","timestamp":1722479461000,"abstract":"  The fraction of low-mass galaxies hosting an intermediate-mass black hole\n(IMBH, with masses $M_{\\rm BH} \\approx 10^2-10^5$ M$_\\odot$), is sensitive to\nhow black hole seeds formed in the early Universe but is observationally still\nunconstrained. In this paper, we assemble a sample of dwarf galaxies within 10\nMpc hosting bright nuclear star clusters (NSCs) that could host IMBHs. For a\nsubset of them, we use their observed surface brightness from {\\it Hubble Space\nTelescope} (\\hst) images, an assumed synthetic spectrum of their stellar\npopulation, Jeans Anisotropic Model (JAM) of the stellar dynamics, and the {\\tt\nHSIM} simulator software to create mock observations with the High Angular\nResolution Monolithic Optical and Near-infrared Integral (HARMONI) field\nspectrograph for the Extremely Large Telescope (ELT). We analyze the simulated\ndata cube like real data, using JAM to infer the IMBH mass and its error in a\nBayesian framework. Our simulations show that the ELT/HARMONI instrument can\nclearly detect the existence of IMBH demographics in NSCs down to a mass of\nabout 0.5\\% of the NSC.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"euhkYtO6ptbmUwNORAbEctQ1DQUTmPU3Y0RuFWhpbhA","pdfSize":"22470473"}
