{"id":"2408.02348","title":"Earth System Data Cubes: Avenues for advancing Earth system research","authors":"David Montero, Guido Kraemer, Anca Anghelea, C\\'esar Aybar, Gunnar\n  Brandt, Gustau Camps-Valls, Felix Cremer, Ida Flik, Fabian Gans, Sarah\n  Habershon, Chaonan Ji, Teja Kattenborn, Laura Mart\\'inez-Ferrer, Francesco\n  Martinuzzi, Martin Reinhardt, Maximilian S\\\"ochting, Khalil Teber, Miguel D.\n  Mahecha","authorsParsed":[["Montero","David",""],["Kraemer","Guido",""],["Anghelea","Anca",""],["Aybar","César",""],["Brandt","Gunnar",""],["Camps-Valls","Gustau",""],["Cremer","Felix",""],["Flik","Ida",""],["Gans","Fabian",""],["Habershon","Sarah",""],["Ji","Chaonan",""],["Kattenborn","Teja",""],["Martínez-Ferrer","Laura",""],["Martinuzzi","Francesco",""],["Reinhardt","Martin",""],["Söchting","Maximilian",""],["Teber","Khalil",""],["Mahecha","Miguel D.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 09:50:16 GMT"}],"updateDate":"2024-08-06","timestamp":1722851416000,"abstract":"  Recent advancements in Earth system science have been marked by the\nexponential increase in the availability of diverse, multivariate datasets\ncharacterised by moderate to high spatio-temporal resolutions. Earth System\nData Cubes (ESDCs) have emerged as one suitable solution for transforming this\nflood of data into a simple yet robust data structure. ESDCs achieve this by\norganising data into an analysis-ready format aligned with a spatio-temporal\ngrid, facilitating user-friendly analysis and diminishing the need for\nextensive technical data processing knowledge. Despite these significant\nbenefits, the completion of the entire ESDC life cycle remains a challenging\ntask. Obstacles are not only of a technical nature but also relate to\ndomain-specific problems in Earth system research. There exist barriers to\nrealising the full potential of data collections in light of novel cloud-based\ntechnologies, particularly in curating data tailored for specific application\ndomains. These include transforming data to conform to a spatio-temporal grid\nwith minimum distortions and managing complexities such as spatio-temporal\nautocorrelation issues. Addressing these challenges is pivotal for the\neffective application of Artificial Intelligence (AI) approaches. Furthermore,\nadhering to open science principles for data dissemination, reproducibility,\nvisualisation, and reuse is crucial for fostering sustainable research.\nOvercoming these challenges offers a substantial opportunity to advance\ndata-driven Earth system research, unlocking the full potential of an\nintegrated, multidimensional view of Earth system processes. This is\nparticularly true when such research is coupled with innovative research\nparadigms and technological progress.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"m8ms-Ae0y6Z4-Yi8IrE4lFg3WdbNDphLpl8CQvnx8XI","pdfSize":"10884200"}
