{"id":"2408.06018","title":"Uncertainty-Informed Volume Visualization using Implicit Neural\n  Representation","authors":"Shanu Saklani and Chitwan Goel and Shrey Bansal and Zhe Wang and\n  Soumya Dutta and Tushar M. Athawale and David Pugmire and Christopher R.\n  Johnson","authorsParsed":[["Saklani","Shanu",""],["Goel","Chitwan",""],["Bansal","Shrey",""],["Wang","Zhe",""],["Dutta","Soumya",""],["Athawale","Tushar M.",""],["Pugmire","David",""],["Johnson","Christopher R.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 09:14:23 GMT"}],"updateDate":"2024-08-13","timestamp":1723454063000,"abstract":"  The increasing adoption of Deep Neural Networks (DNNs) has led to their\napplication in many challenging scientific visualization tasks. While advanced\nDNNs offer impressive generalization capabilities, understanding factors such\nas model prediction quality, robustness, and uncertainty is crucial. These\ninsights can enable domain scientists to make informed decisions about their\ndata. However, DNNs inherently lack ability to estimate prediction uncertainty,\nnecessitating new research to construct robust uncertainty-aware visualization\ntechniques tailored for various visualization tasks. In this work, we propose\nuncertainty-aware implicit neural representations to model scalar field data\nsets effectively and comprehensively study the efficacy and benefits of\nestimated uncertainty information for volume visualization tasks. We evaluate\nthe effectiveness of two principled deep uncertainty estimation techniques: (1)\nDeep Ensemble and (2) Monte Carlo Dropout (MCDropout). These techniques enable\nuncertainty-informed volume visualization in scalar field data sets. Our\nextensive exploration across multiple data sets demonstrates that\nuncertainty-aware models produce informative volume visualization results.\nMoreover, integrating prediction uncertainty enhances the trustworthiness of\nour DNN model, making it suitable for robustly analyzing and visualizing\nreal-world scientific volumetric data sets.\n","subjects":["Computing Research Repository/Graphics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"B9GRBs8Srn2Cy0XnzLRaJ-D4X-AC59Ew5sVDQFSFAdw","pdfSize":"4717754"}
