{"id":"2408.01078","title":"Multibeam Hybrid Transmitarray Based on Polarization Rotating\n  Metasurface With Reconfigurable Bidirectional Radiation","authors":"Fan Qin, Yifei Liu, Chao Gu, Linfeng Zeng, Wenchi Cheng, Hailin Zhang,\n  Steven Gao","authorsParsed":[["Qin","Fan",""],["Liu","Yifei",""],["Gu","Chao",""],["Zeng","Linfeng",""],["Cheng","Wenchi",""],["Zhang","Hailin",""],["Gao","Steven",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 07:53:51 GMT"}],"updateDate":"2024-08-05","timestamp":1722585231000,"abstract":"  This paper proposes a bidirectional multibeam hybrid transmitarray (HTA)\nemploying a transmission polarization-rotating metasurface (TPRM). A novel\nconfiguration is introduced to facilitate bidirectional beam scanning by\ncombining the transmitarray (TA) and folded-transmitarray (FTA). To accomplish\nthe reconfiguration of both unidirectional and bidirectional radiation states\nin the +z, -z, and +/-z directions, a polarization switchable multi-feed array\n(MFA) is placed at the focal plane between the TA and FTA, radiating\nx-polarization, y-polarization, and 45-degree oblique polarization waves,\nrespectively. Meanwhile, the proposed antenna can achieve multibeam radiation\nin the three aforementioned states by switching the polarization of the MFA. To\ndemonstrate the operating principle, a prototype has been designed, simulated,\nand fabricated. The measured results agree well with the simulated results. The\nsimulated and measured results indicate that the proposed design can generate\nreconfigurable multibeam in both forward and backward directions, either\nseparately or simultaneously. In the unidirectional states, forward and\nbackward beam scanning is achieved within an angular range of +/-30{\\deg} and\n+/-22{\\deg}, respectively, with peak gains of 23.6 dBi and 23.1 dBi. A\nsimultaneous forward and backward beam scanning of +/-40{\\deg} and +/-22{\\deg}\nis achieved in the hybrid radiation state, with peak gains of 19.4 dBi and 19.3\ndBi, respectively. The proposed antenna array design offers several advantages,\nincluding bidirectional low-loss beam scanning, a simple structure, low power\nconsumption, and a low profile.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}