{"id":"2408.03400","title":"Attacks and Defenses for Generative Diffusion Models: A Comprehensive\n  Survey","authors":"Vu Tuan Truong, Luan Ba Dang, Long Bao Le","authorsParsed":[["Truong","Vu Tuan",""],["Dang","Luan Ba",""],["Le","Long Bao",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 18:52:17 GMT"}],"updateDate":"2024-08-08","timestamp":1722970337000,"abstract":"  Diffusion models (DMs) have achieved state-of-the-art performance on various\ngenerative tasks such as image synthesis, text-to-image, and text-guided\nimage-to-image generation. However, the more powerful the DMs, the more harmful\nthey potentially are. Recent studies have shown that DMs are prone to a wide\nrange of attacks, including adversarial attacks, membership inference, backdoor\ninjection, and various multi-modal threats. Since numerous pre-trained DMs are\npublished widely on the Internet, potential threats from these attacks are\nespecially detrimental to the society, making DM-related security a worth\ninvestigating topic. Therefore, in this paper, we conduct a comprehensive\nsurvey on the security aspect of DMs, focusing on various attack and defense\nmethods for DMs. First, we present crucial knowledge of DMs with five main\ntypes of DMs, including denoising diffusion probabilistic models, denoising\ndiffusion implicit models, noise conditioned score networks, stochastic\ndifferential equations, and multi-modal conditional DMs. We further survey a\nvariety of recent studies investigating different types of attacks that exploit\nthe vulnerabilities of DMs. Then, we thoroughly review potential\ncountermeasures to mitigate each of the presented threats. Finally, we discuss\nopen challenges of DM-related security and envision certain research directions\nfor this topic.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Hlnc0SaDIpWRVhlzej109UN2Y6drNMW76WTTzwnEpVM","pdfSize":"6037775"}
