{"id":"2408.00296","title":"Head360: Learning a Parametric 3D Full-Head for Free-View Synthesis in\n  360{\\deg}","authors":"Yuxiao He and Yiyu Zhuang and Yanwen Wang and Yao Yao and Siyu Zhu and\n  Xiaoyu Li and Qi Zhang and Xun Cao and Hao Zhu","authorsParsed":[["He","Yuxiao",""],["Zhuang","Yiyu",""],["Wang","Yanwen",""],["Yao","Yao",""],["Zhu","Siyu",""],["Li","Xiaoyu",""],["Zhang","Qi",""],["Cao","Xun",""],["Zhu","Hao",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 05:46:06 GMT"}],"updateDate":"2024-08-02","timestamp":1722491166000,"abstract":"  Creating a 360{\\deg} parametric model of a human head is a very challenging\ntask. While recent advancements have demonstrated the efficacy of leveraging\nsynthetic data for building such parametric head models, their performance\nremains inadequate in crucial areas such as expression-driven animation,\nhairstyle editing, and text-based modifications. In this paper, we build a\ndataset of artist-designed high-fidelity human heads and propose to create a\nnovel parametric 360{\\deg} renderable parametric head model from it. Our scheme\ndecouples the facial motion/shape and facial appearance, which are represented\nby a classic parametric 3D mesh model and an attached neural texture,\nrespectively. We further propose a training method for decompositing hairstyle\nand facial appearance, allowing free-swapping of the hairstyle. A novel\ninversion fitting method is presented based on single image input with high\ngeneralization and fidelity. To the best of our knowledge, our model is the\nfirst parametric 3D full-head that achieves 360{\\deg} free-view synthesis,\nimage-based fitting, appearance editing, and animation within a single model.\nExperiments show that facial motions and appearances are well disentangled in\nthe parametric space, leading to SOTA performance in rendering and animating\nquality. The code and SynHead100 dataset are released at\nhttps://nju-3dv.github.io/projects/Head360.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}