{"id":"2408.03852","title":"4D de Sitter from String Theory via 6D Supergravity","authors":"C.P. Burgess, F. Muia and F. Quevedo","authorsParsed":[["Burgess","C. P.",""],["Muia","F.",""],["Quevedo","F.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 15:47:07 GMT"}],"updateDate":"2024-08-08","timestamp":1723045627000,"abstract":"  We obtain de Sitter (dS) solutions from controlled string-theory\nconstructions. We review how minimal gauged chiral 6D supergravity evades\nstandard dS no-go theorems by having a positive scalar potential and describe\nthe known 4D classical dS, AdS and Minkowski solutions. Grimm and collaborators\nrecently found a related 6D supergravity by direct F-theory Calabi-Yau flux\ncompactifications and we construct classical 4D maximally symmetric solutions\nfor this 6D supergravity. These provide explicit solutions of the\nhigher-dimensional field equations corresponding to dS, AdS and flat spacetimes\nin 4D, allowing interesting hierarchies of scales. We show how the\nsingularities of these solutions are consistent with the back-reaction of two\nspace-filling 4D brane-like sources situated within the extra dimensions and\ninfer some of the properties of these sources using the formalism of point\nparticle effective field theory (PPEFT), showing the sources are not vanilla\nobjects like D branes. These tools relate the near-source asymptotic forms of\nbulk fields to source properties and have been extensively tested for more\nprosaic physical systems involving the back-reaction of small sources, such as\nthe dependence of atomic energy levels on nuclear properties. We use it to\ndetermine the tension of the brane-like sources (that can be positive) and its\nderivatives. We verify that the solutions are in the weak coupling/large volume\nregime required to neglect quantum and $\\alpha'$ effects.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/"}