{"id":"2408.02689","title":"Spatio-Temporal Partial Sensing Forecast for Long-term Traffic","authors":"Zibo Liu, Zhe Jiang, Zelin Xu, Tingsong Xiao, Zhengkun Xiao, Haibo\n  Wang and Shigang Chen","authorsParsed":[["Liu","Zibo",""],["Jiang","Zhe",""],["Xu","Zelin",""],["Xiao","Tingsong",""],["Xiao","Zhengkun",""],["Wang","Haibo",""],["Chen","Shigang",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 21:22:22 GMT"}],"updateDate":"2024-08-07","timestamp":1722633742000,"abstract":"  Traffic forecasting uses recent measurements by sensors installed at chosen\nlocations to forecast the future road traffic. Existing work either assumes all\nlocations are equipped with sensors or focuses on short-term forecast. This\npaper studies partial sensing traffic forecast of long-term traffic, assuming\nsensors only at some locations. The study is important in lowering the\ninfrastructure investment cost in traffic management since deploying sensors at\nall locations could incur prohibitively high cost. However, the problem is\nchallenging due to the unknown distribution at unsensed locations, the\nintricate spatio-temporal correlation in long-term forecasting, as well as\nnoise in data and irregularities in traffic patterns (e.g., road closure). We\npropose a Spatio-Temporal Partial Sensing (STPS) forecast model for long-term\ntraffic prediction, with several novel contributions, including a rank-based\nembedding technique to capture irregularities and overcome noise, a spatial\ntransfer matrix to overcome the spatial distribution shift from permanently\nsensed locations to unsensed locations, and a multi-step training process that\nutilizes all available data to successively refine the model parameters for\nbetter accuracy. Extensive experiments on several real-world traffic datasets\ndemonstrate that STPS outperforms the state-of-the-art and achieves superior\naccuracy in partial sensing long-term forecasting.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}