{"id":"2408.16216","title":"Assessing the capability of a model-based stellar XUV estimation","authors":"Munehito Shoda, Kosuke Namekata, Shinsuke Takasao","authorsParsed":[["Shoda","Munehito",""],["Namekata","Kosuke",""],["Takasao","Shinsuke",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 02:18:34 GMT"}],"updateDate":"2024-08-30","timestamp":1724897914000,"abstract":"  Stellar XUV (X-ray and extreme ultraviolet) emission drives the heating and\nchemical reactions in planetary atmospheres and protoplanetary disks, and\ntherefore, a proper estimation of a stellar XUV spectrum is required for their\nstudies. One proposed solution is to estimate stellar atmospheric heating using\nnumerical models, although the validation was restricted to the Sun over a\nlimited parameter range. In this study, we extend the validation of the model\nby testing it with the Sun and three young, nearby solar-type stars with\navailable XUV observational data. We first test the model with the solar\nobservations, examining its accuracy in activity minimum and maximum phases,\nits dependence on loop length, the effect of loop length superposition, and its\nsensitivity to elemental abundance. We confirm that the model spectrum is\nmostly accurate both in activity minimum and maximum, although the high-energy\nX-rays (< 1 nm) are underestimated in the activity maximum. Applying the model\nto young solar-type stars, we find that it can reproduce the observed XUV\nspectra within a factor of 3 in the range of 1-30 nm for stars with magnetic\nflux up to 100 times that of the Sun. For a star with 300 times the solar\nmagnetic flux, although the raw numerical data show a systematically lower\nspectrum than observed, the spectra are in good agreement once corrected for\nthe effect of insufficient resolution in the transition region. For all young\nsolar-type stars, high-energy X-rays (< 1 nm) are significantly underestimated,\nwith the deviation increasing with stellar magnetic activity. Our findings\nindicate that the stellar XUV spectrum can be reasonably estimated through a\nnumerical model, given that the essential input parameters (surface magnetic\nflux and elemental abundance) are known.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}