{"id":"2408.12777","title":"Environment-Centric Active Inference","authors":"Kanako Esaki, Tadayuki Matsumura, Takeshi Kato, Shunsuke Minusa, Yang\n  Shao, and Hiroyuki Mizuno","authorsParsed":[["Esaki","Kanako",""],["Matsumura","Tadayuki",""],["Kato","Takeshi",""],["Minusa","Shunsuke",""],["Shao","Yang",""],["Mizuno","Hiroyuki",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 00:54:28 GMT"}],"updateDate":"2024-08-26","timestamp":1724374468000,"abstract":"  To handle unintended changes in the environment by agents, we propose an\nenvironment-centric active inference EC-AIF in which the Markov Blanket of\nactive inference is defined starting from the environment. In normal active\ninference, the Markov Blanket is defined starting from the agent. That is,\nfirst the agent was defined as the entity that performs the \"action\" such as a\nrobot or a person, then the environment was defined as other people or objects\nthat are directly affected by the agent's \"action,\" and the boundary between\nthe agent and the environment was defined as the Markov Blanket. This\nagent-centric definition does not allow the agent to respond to unintended\nchanges in the environment caused by factors outside of the defined\nenvironment. In the proposed EC-AIF, there is no entity corresponding to an\nagent. The environment includes all observable things, including people and\nthings conventionally considered to be the environment, as well as entities\nthat perform \"actions\" such as robots and people. Accordingly, all states,\nincluding robots and people, are included in inference targets, eliminating\nunintended changes in the environment. The EC-AIF was applied to a robot arm\nand validated with an object transport task by the robot arm. The results\nshowed that the robot arm successfully transported objects while responding to\nchanges in the target position of the object and to changes in the orientation\nof another robot arm.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}