{"id":"2408.01335","title":"Occasionally Observed Piecewise-deterministic Markov Processes","authors":"Marissa Gee and Alexander Vladimirsky","authorsParsed":[["Gee","Marissa",""],["Vladimirsky","Alexander",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 15:32:49 GMT"}],"updateDate":"2024-08-05","timestamp":1722612769000,"abstract":"  Piecewise-deterministic Markov processes (PDMPs) are often used to model\nabrupt changes in the global environment or capabilities of a controlled\nsystem. This is typically done by considering a set of \"operating modes\" (each\nwith its own system dynamics and performance metrics) and assuming that the\nmode can switch stochastically while the system state evolves. Such models have\na broad range of applications in engineering, economics, manufacturing,\nrobotics, and biological sciences. Here, we introduce and analyze an\n\"occasionally observed\" version of mode-switching PDMPs. We show how such\nsystems can be controlled optimally if the planner is not alerted to\nmode-switches as they occur but may instead have access to infrequent mode\nobservations. We first develop a general framework for handling this through\ndynamic programming on a higher-dimensional mode-belief space. While quite\ngeneral, this method is rarely practical due to the curse of dimensionality. We\nthen discuss assumptions that allow for solving the same problem much more\nefficiently, with the computational costs growing linearly (rather than\nexponentially) with the number of modes. We use this approach to derive\nHamilton-Jacobi-Bellman PDEs and quasi-variational inequalities encoding the\noptimal behavior for a variety of planning horizons (fixed, infinite,\nindefinite, random) and mode-observation schemes (at fixed times or on-demand).\nWe discuss the computational challenges associated with each version and\nillustrate the resulting methods on test problems from surveillance-evading\npath planning. We also include an example based on robotic navigation: a Mars\nrover that minimizes the expected time to target while accounting for the\npossibility of unobserved/incremental damages and dynamics-altering breakdowns.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Wdc66in_Unjyy9JKODXqOqs4Zrq8iJlBvW7wULpH9fs","pdfSize":"10704087","txDigest":"AaVoBUzrNBYMJUKvGNe5QbBY8JECT2KqNcYxuLAz3k6G","endEpoch":"1","status":"CERTIFIED"}
