{"id":"2408.06896","title":"Evolution of plane perturbations in the cosmological environment of the\n  Higgs scalar field and an ideal scalar charged fluid","authors":"Yu. G. Ignat'ev","authorsParsed":[["Ignat'ev","Yu. G.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 13:44:09 GMT"}],"updateDate":"2024-08-14","timestamp":1723556649000,"abstract":"  A phenomenological model of an ideal fluid with a scalar charge is\nformulated, on the basis of which a model with a neutral fluid and a\nvacuum-field model with rules of transition between them are constructed. A\nqualitative analysis of the obtained dynamic systems is carried out and\nnumerical cosmological models based on these systems are constructed. A\nmathematical model of plane longitudinal scalar-gravitational perturbations of\nthe Friedmann ideal charged fluid with Higgs interaction is formulated. It is\nshown that in the absence of fluid, i.e., in the vacuum-field model,\ngravitational perturbations do not arise. Perturbations of the scalar field are\npossible only in those cases when in the unperturbed state the cosmological\nsystem is at singular points. For these cases, exact solutions of the field\nequation are found, expressed in Bessel functions of the first and second kind\nand describing damped oscillations in the case of a stable unperturbed state\nand growing oscillations in the case of an unstable unperturbed state. The WKB\ntheory of plane scalar-gravitational perturbations is constructed: dispersion\nequations are obtained in general form and solved for a neutral fluid. In this\ncase, expressions are obtained for the local frequency and growth increment of\noscillations, as well as the integral increment. It is shown that only free\nwave regimes or growing standing oscillations are possible during the\nevolution. Perturbations in the WKB approximation in a neutral fluid are\nstudied and it is shown that local formulas for the evolution of perturbations\ncorrespond to the model of the 1985 article by M.Yu. The times of the beginning\nand end of the instability phase are determined and it is shown that\ninstability can develop only at the unstable inflationary stage of the\nexpansion of the Universe.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}