{"id":"2408.02869","title":"Enabling High-Throughput Parallel I/O in Particle-in-Cell Monte Carlo\n  Simulations with openPMD and Darshan I/O Monitoring","authors":"Jeremy J. Williams, Daniel Medeiros, Stefan Costea, David Tskhakaya,\n  Franz Poeschel, Ren\\'e Widera, Axel Huebl, Scott Klasky, Norbert Podhorszki,\n  Leon Kos, Ales Podolnik, Jakub Hromadka, Tapish Narwal, Klaus Steiniger,\n  Michael Bussmann, Erwin Laure, Stefano Markidis","authorsParsed":[["Williams","Jeremy J.",""],["Medeiros","Daniel",""],["Costea","Stefan",""],["Tskhakaya","David",""],["Poeschel","Franz",""],["Widera","René",""],["Huebl","Axel",""],["Klasky","Scott",""],["Podhorszki","Norbert",""],["Kos","Leon",""],["Podolnik","Ales",""],["Hromadka","Jakub",""],["Narwal","Tapish",""],["Steiniger","Klaus",""],["Bussmann","Michael",""],["Laure","Erwin",""],["Markidis","Stefano",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 00:02:33 GMT"}],"updateDate":"2024-08-07","timestamp":1722902553000,"abstract":"  Large-scale HPC simulations of plasma dynamics in fusion devices require\nefficient parallel I/O to avoid slowing down the simulation and to enable the\npost-processing of critical information. Such complex simulations lacking\nparallel I/O capabilities may encounter performance bottlenecks, hindering\ntheir effectiveness in data-intensive computing tasks. In this work, we focus\non introducing and enhancing the efficiency of parallel I/O operations in\nParticle-in-Cell Monte Carlo simulations. We first evaluate the scalability of\nBIT1, a massively-parallel electrostatic PIC MC code, determining its initial\nwrite throughput capabilities and performance bottlenecks using an HPC I/O\nperformance monitoring tool, Darshan. We design and develop an adaptor to the\nopenPMD I/O interface that allows us to stream PIC particle and field\ninformation to I/O using the BP4 backend, aggressively optimized for I/O\nefficiency, including the highly efficient ADIOS2 interface. Next, we explore\nadvanced optimization techniques such as data compression, aggregation, and\nLustre file striping, achieving write throughput improvements while enhancing\ndata storage efficiency. Finally, we analyze the enhanced high-throughput\nparallel I/O and storage capabilities achieved through the integration of\nopenPMD with rapid metadata extraction in BP4 format. Our study demonstrates\nthat the integration of openPMD and advanced I/O optimizations significantly\nenhances BIT1's I/O performance and storage capabilities, successfully\nintroducing high throughput parallel I/O and surpassing the capabilities of\ntraditional file I/O.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Performance","Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}