{"id":"2408.00064","title":"Apocalypse When? No Certainty of a Milky Way -- Andromeda Collision","authors":"Till Sawala (1 and 2), Jehanne Delhomelle (1 and 3), Alis J. Deason\n  (2), Carlos S. Frenk (2), Peter H. Johansson (1), Atte Keitaanranta (1),\n  Alexander Rawlings (1), Ruby Wright (1) ((1) University of Helsinki, (2)\n  Durham University, (3) University of Toulouse III - Paul Sabatier)","authorsParsed":[["Sawala","Till","","1 and 2"],["Delhomelle","Jehanne","","1 and 3"],["Deason","Alis J.",""],["Frenk","Carlos S.",""],["Johansson","Peter H.",""],["Keitaanranta","Atte",""],["Rawlings","Alexander",""],["Wright","Ruby",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-08-02","timestamp":1722448800000,"abstract":"  It is commonly believed that our own Milky Way is on a collision course with\nthe neighbouring Andromeda galaxy. As a result of their merger, predicted in\naround five billion years, the two large spiral galaxies that define the\npresent Local Group would form a new elliptical galaxy. Here we consider the\nlatest and most accurate observations by the Gaia and Hubble space telescopes,\nalong with recent consensus mass estimates to derive possible future scenarios\nand identify the major sources of uncertainty in the evolution of the Local\nGroup over the next 10 billion years. We find that the next most massive Local\nGroup member galaxies -- namely, M33 and the Large Magellanic Cloud --\ndistinctly and radically affect the Milky Way - Andromeda orbit. While\nincluding M33 increases the merger probability, the orbit of the Large\nMagellanic Cloud runs perpendicular to the Milky Way - Andromeda orbit and\nmakes their merger less likely. In the full system, we find that uncertainties\nin the present positions, motions, and masses of all galaxies leave room for\ndrastically different outcomes, and a probability of close to 50% that there is\nno Milky Way - Andromeda merger during the next 10 billion years.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}