{"id":"2408.03893","title":"Investigation of pion-nucleon contributions to nucleon matrix elements","authors":"Constantia Alexandrou, Giannis Koutsou, Yan Li, Marcus Petschlies,\n  Ferenc Pittler","authorsParsed":[["Alexandrou","Constantia",""],["Koutsou","Giannis",""],["Li","Yan",""],["Petschlies","Marcus",""],["Pittler","Ferenc",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 16:45:08 GMT"}],"updateDate":"2024-08-08","timestamp":1723049108000,"abstract":"  We investigate contributions of excited states to nucleon matrix elements\ncomputed in lattice QCD by employing, in addition to the standard nucleon\ninterpolating operator, pion-nucleon ($\\pi$-$N$) operators. We solve a\ngeneralized eigenvalue problem (GEVP) to obtain an optimal interpolating\noperator that minimizes overlap with the $\\pi$-$N$ states. We derive a variant\nof the standard application of the GEVP method, which allows for constructing\n3-point correlation functions using the optimized interpolating operator\nwithout requiring the computationally demanding combination that includes\n$\\pi$-$N$ operators in both sink and source. We extract nucleon matrix elements\nusing two twisted mass fermion ensembles, one ensemble generated using pion\nmass of 346 MeV and one ensemble tuned to reproduce the physical value of the\npion mass. Especially, we determine the isoscalar and isovector scalar,\npseudoscalar, vector, axial, and tensor matrix elements. We include results\nobtained using a range of kinematic setups, including momentum in the sink. Our\nresults using this variational approach are compared with previous results\nobtained using the same ensembles and multi-state fits without GEVP\nimprovement. We find that for the physical mass point ensemble, the\nimprovement, in terms of suppression of excited states using this method, is\nmost significant for the case of the matrix elements of the isovector axial and\npseudoscalar currents.\n","subjects":["Physics/High Energy Physics - Lattice","Physics/High Energy Physics - Phenomenology","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"R6awg6jUkN7u-83NknwgPkR7j3asS8Y1s9eo2M8SCGI","pdfSize":"2616392"}
