{"id":"2408.16606","title":"Design of stacked intelligent metasurfaces with reconfigurable amplitude\n  and phase for multiuser downlink beamforming","authors":"Donatella Darsena, Francesco Verde, Ivan Iudice, Vincenzo Galdi","authorsParsed":[["Darsena","Donatella",""],["Verde","Francesco",""],["Iudice","Ivan",""],["Galdi","Vincenzo",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 15:16:47 GMT"}],"updateDate":"2024-08-30","timestamp":1724944607000,"abstract":"  A novel technology based on stacked intelligent metasurfaces (SIM) has\nrecently emerged. This platform involves cascading multiple metasurfaces, each\nacting as a digitally programmable physical layer within a diffractive neural\nnetwork. SIM enable the implementation of signal-processing transformations\ndirectly in the electromagnetic wave domain, eliminating the need for\nexpensive, high-precision, and power-intensive digital platforms. However,\nexisting studies employing SIM in wireless communication applications rely\nsolely on nearly passive structures that control only the phase of the\nmeta-atoms in each layer. In this study, we propose a SIM-aided downlink\nmultiuser transmission scheme, where the SIM at the base station (BS) end is\ndesigned by combining nearly passive layers with phase-only reconfiguration\ncapabilities and active layers integrated with amplifier chips to enable\namplitude control. Our optimal design aims at maximizing the sum rate for the\nbest group of users by jointly optimizing the transmit power allocation at the\nBS and the wave-based beamforming at the SIM. In addition to the standard\nsum-power constraint at the BS, our optimization framework includes two\nadditional constraints: (i) a per-stream power preserving constraint to prevent\npropagation losses across the SIM, and (ii) an amplitude constraint to account\nfor power limitations for each active layer. To further reduce the complexity\nof the optimal beamforming solution, we explore a simple yet suboptimal\nzero-forcing (ZF) beamforming design, where the wavebased transformation\nimplemented by the SIM is selected to eliminate interference among user\nstreams. Finally, extensive Monte Carlo simulations demonstrate that\nincorporating both nearly passive and active layers within the SIM\nsignificantly enhances capacity compared to previously reported phase-only\ncoding SIM.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"b_OowqCLMS_6adUHPef4tgvxL-ciUzHMF65BdMq5Qss","pdfSize":"1216733"}
