{"id":"2408.04268","title":"Evaluating Modern Approaches in 3D Scene Reconstruction: NeRF vs\n  Gaussian-Based Methods","authors":"Yiming Zhou and Zixuan Zeng and Andi Chen and Xiaofan Zhou and Haowei\n  Ni and Shiyao Zhang and Panfeng Li and Liangxi Liu and Mengyao Zheng and\n  Xupeng Chen","authorsParsed":[["Zhou","Yiming",""],["Zeng","Zixuan",""],["Chen","Andi",""],["Zhou","Xiaofan",""],["Ni","Haowei",""],["Zhang","Shiyao",""],["Li","Panfeng",""],["Liu","Liangxi",""],["Zheng","Mengyao",""],["Chen","Xupeng",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 07:11:57 GMT"}],"updateDate":"2024-09-17","timestamp":1723101117000,"abstract":"  Exploring the capabilities of Neural Radiance Fields (NeRF) and\nGaussian-based methods in the context of 3D scene reconstruction, this study\ncontrasts these modern approaches with traditional Simultaneous Localization\nand Mapping (SLAM) systems. Utilizing datasets such as Replica and ScanNet, we\nassess performance based on tracking accuracy, mapping fidelity, and view\nsynthesis. Findings reveal that NeRF excels in view synthesis, offering unique\ncapabilities in generating new perspectives from existing data, albeit at\nslower processing speeds. Conversely, Gaussian-based methods provide rapid\nprocessing and significant expressiveness but lack comprehensive scene\ncompletion. Enhanced by global optimization and loop closure techniques, newer\nmethods like NICE-SLAM and SplaTAM not only surpass older frameworks such as\nORB-SLAM2 in terms of robustness but also demonstrate superior performance in\ndynamic and complex environments. This comparative analysis bridges theoretical\nresearch with practical implications, shedding light on future developments in\nrobust 3D scene reconstruction across various real-world applications.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DPSHfxf0vl26SAbH_cW-EFLPQwGUfiM5fSyTG4_2Hjc","pdfSize":"24251536"}
