{"id":"2408.06878","title":"PBIR-NIE: Glossy Object Capture under Non-Distant Lighting","authors":"Guangyan Cai, Fujun Luan, Milo\\v{s} Ha\\v{s}an, Kai Zhang, Sai Bi,\n  Zexiang Xu, Iliyan Georgiev, Shuang Zhao","authorsParsed":[["Cai","Guangyan",""],["Luan","Fujun",""],["Hašan","Miloš",""],["Zhang","Kai",""],["Bi","Sai",""],["Xu","Zexiang",""],["Georgiev","Iliyan",""],["Zhao","Shuang",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 13:26:24 GMT"}],"updateDate":"2024-08-14","timestamp":1723555584000,"abstract":"  Glossy objects present a significant challenge for 3D reconstruction from\nmulti-view input images under natural lighting. In this paper, we introduce\nPBIR-NIE, an inverse rendering framework designed to holistically capture the\ngeometry, material attributes, and surrounding illumination of such objects. We\npropose a novel parallax-aware non-distant environment map as a lightweight and\nefficient lighting representation, accurately modeling the near-field\nbackground of the scene, which is commonly encountered in real-world capture\nsetups. This feature allows our framework to accommodate complex parallax\neffects beyond the capabilities of standard infinite-distance environment maps.\nOur method optimizes an underlying signed distance field (SDF) through\nphysics-based differentiable rendering, seamlessly connecting surface gradients\nbetween a triangle mesh and the SDF via neural implicit evolution (NIE). To\naddress the intricacies of highly glossy BRDFs in differentiable rendering, we\nintegrate the antithetic sampling algorithm to mitigate variance in the Monte\nCarlo gradient estimator. Consequently, our framework exhibits robust\ncapabilities in handling glossy object reconstruction, showcasing superior\nquality in geometry, relighting, and material estimation.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"UPkPIbLxFr2i_rkDaVdjzmtD4ScWREtZUuBnnjf4iNI","pdfSize":"15455090"}
