{"id":"2408.14054","title":"One-dimensional Photonic Crystal Structure Enhanced\n  External-Magnetic-Field-Free Spintronic Terahertz High-Field Emitter","authors":"Zehao Yang and Jiahui Li and Shaojie Liu and Zejun Ren and Mingxuan\n  Zhang and Chunyan Geng and Xiufeng Han and Caihua Wan and Xiaojun Wu","authorsParsed":[["Yang","Zehao",""],["Li","Jiahui",""],["Liu","Shaojie",""],["Ren","Zejun",""],["Zhang","Mingxuan",""],["Geng","Chunyan",""],["Han","Xiufeng",""],["Wan","Caihua",""],["Wu","Xiaojun",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 07:25:24 GMT"}],"updateDate":"2024-08-27","timestamp":1724657124000,"abstract":"  Intense terahertz (THz) radiation in free space offers multifaceted\ncapabilities for accelerating electron, understanding the mesoscale\narchitecture in (bio)materials, elementary excitation and so on. Recently\npopularized spintronic THz emitters (STEs) with their versatility such as\nultra-broadband, cost-effectiveness, large-size and ease for-integration have\nbecome one of the most promising alternative for the next generation of intense\nTHz sources. Nevertheless, the typical W| Co20Fe60B20 | Pt necessitates an\nexternal-magnetic-field to saturate magnetization for stable operation,\nlimiting its scalability for achieving higher THz field with uniform\ndistribution over larger sample areas. Here we demonstrate the methodologies of\nenhancing the high-field THz radiation of external-magnetic-field-free IrMn3 |\nCo20Fe60B20 |W heterostructure via optimizing the substrate with superior\nthermal conductivity and integrating a one-dimensional photonic crystal (PC)\nstructure to maximize the radiation efficiency. Under the excitation of a Ti:\nsapphire femtosecond laser amplifier with central wavelength of 800 nm, pulse\nduration of 35 fs, and repetition rate of 1 kHz and maximum single pulse energy\nof 5.5 mJ, we successfully generate intense THz radiation with focal peak\nelectric field up to 1.1 MV/cm with frequency range covering 0.1-10 THz without\nexternal-magnetic-fields. These high-field STEs will also enable other\napplications such as ultra-broadband high-field THz spectroscopy and\npolarization-based large-size strong-field THz imaging.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}