{"id":"2408.08200","title":"Analysing kinematic data from recreational runners using functional data\n  analysis","authors":"Edward Gunning, Steven Golovkine, Andrew J. Simpkin, Aoife Burke,\n  Sarah Dillon, Shane Gore, Kieran Moran, Siobhan O'Connor, Enda Whyte and\n  Norma Bargary","authorsParsed":[["Gunning","Edward",""],["Golovkine","Steven",""],["Simpkin","Andrew J.",""],["Burke","Aoife",""],["Dillon","Sarah",""],["Gore","Shane",""],["Moran","Kieran",""],["O'Connor","Siobhan",""],["Whyte","Enda",""],["Bargary","Norma",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 15:08:52 GMT"}],"updateDate":"2024-08-16","timestamp":1723734532000,"abstract":"  We present a multivariate functional mixed effects model for kinematic data\nfrom a large number of recreational runners. The runners' sagittal plane hip\nand knee angles are modelled jointly as a bivariate function with random\neffects functions used to account for the dependence among measurements from\neither side of the body. The model is fitted by first applying multivariate\nfunctional principal component analysis (mv-FPCA) and then modelling the\nmv-FPCA scores using scalar linear mixed effects models. Simulation and\nbootstrap approaches are introduced to construct simultaneous confidence bands\nfor the fixed effects functions, and covariance functions are reconstructed to\nsummarise the variability structure in the data and thoroughly investigate the\nsuitability of the proposed model. In our scientific application, we observe a\nstatistically significant effect of running speed on both the hip and knee\nangles. We also observe strong within-subject correlations, reflecting the\nhighly idiosyncratic nature of running technique. Our approach is more\ngenerally applicable to modelling multiple streams of smooth kinematic or\nkinetic data measured repeatedly for multiple subjects in complex experimental\ndesigns.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"myTXZxYTd1QlgxCiYK8quu0dfE8I4dP-lmzoi4pit_M","pdfSize":"3306163"}
