{"id":"2408.01693","title":"Contribution of the Cygnus bubble to the Galactic cosmic ray spectrum\n  and diffuse $\\gamma$-ray emissions","authors":"Lin Nie, Xiang-Li Qian, Yi-Qing Guo, Si-Ming Liu","authorsParsed":[["Nie","Lin",""],["Qian","Xiang-Li",""],["Guo","Yi-Qing",""],["Liu","Si-Ming",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 07:24:29 GMT"}],"updateDate":"2024-08-06","timestamp":1722669869000,"abstract":"  Since the discovery of cosmic rays (CRs) over a century ago, their origin has\nremained a mystery and a key research question. Recently, the LHAASO experiment\nidentified the first CR super-acceleration source, the Cygnus bubble, which can\naccelerate CRs to energies exceeding 10 PeV. A pertinent question is: how much\ndoes the Cygnus bubble contribute to the CR spectrum observed on Earth? With\nthe aim of answering that question, a 3D propagation analysis was conducted on\nCRs in this study. The Cygnus bubble was incorporated into our propagation\nmodel in order to determine its contributions to the observed spectra. First,\nwe calculated the spectrum and spatial morphology of the Cygnus bubble to\nreproduce the observed LHAASO data. Subsequently, we calculated the diffuse\n$\\gamma$-ray emissions produced by the CRs from the Cygnus bubble and the\nenergy spectrum of the cosmic ray particles near Earth after propagation.\nFinally, we utilized a CR spatial-dependent propagation model to calculate the\nlarge-scale CR energy spectrum and the resulting diffuse $\\gamma$-ray\nemissions. Our results indicate that: (1) the Cygnus bubble contributes\nminimally to the CR spectrum observed on Earth, (2) the emissions produced by\nthe CR particles from the Cygnus bubble dominates the diffuse $\\gamma$-ray\nemissions in that region, (3) the structural fluctuations of the diffuse\n$\\gamma$-ray emissions observed by LHAASO are likely due to the local CR halo.\nWe anticipate that LHAASO will identify more CR halo sources to validate our\nmodel.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}