{"id":"2408.05302","title":"Lindbladian reverse engineering for general non-equilibrium steady\n  states: A scalable null-space approach","authors":"Leonardo da Silva Souza and Fernando Iemini","authorsParsed":[["Souza","Leonardo da Silva",""],["Iemini","Fernando",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 19:00:18 GMT"}],"updateDate":"2024-08-13","timestamp":1723230018000,"abstract":"  The study of open system dynamics is of paramount importance both from its\nfundamental aspects as well as from its potential applications in quantum\ntechnologies. In the simpler and most commonly studied case, the dynamics of\nthe system can be described by a Lindblad master equation. However, identifying\nthe Lindbladian that leads to general non-equilibrium steady states (NESS) is\nusually a non-trivial and challenging task. Here we introduce a method for\nreconstructing the corresponding Lindbaldian master equation given any target\nNESS, i.e., a Lindbladian Reverse Engineering ($\\mathcal{L}$RE) approach. The\nmethod maps the reconstruction task to a simple linear problem. Specifically,\nto the diagonalization of a correlation matrix whose elements are NESS\nobservables and whose size scales linearly (at most quadratically) with the\nnumber of terms in the Hamiltonian (Lindblad jump operator) ansatz. The kernel\n(null-space) of the correlation matrix corresponds to Lindbladian solutions.\nMoreover, the map defines an iff condition for $\\mathcal{L}$RE, which works as\nboth a necessary and a sufficient condition; thus, it not only defines, if\npossible, Lindbaldian evolutions leading to the target NESS, but also\ndetermines the feasibility of such evolutions in a proposed setup. We\nillustrate the method in different systems, ranging from bosonic Gaussian to\ndissipative-driven collective spins. We also discuss non-Markovian effects and\npossible forms to recover Markovianity in the reconstructed Lindbaldian.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Statistical Mechanics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}