{"id":"2408.06175","title":"Towards Unconstrained Collision Injury Protection Data Sets: Initial\n  Surrogate Experiments for the Human Hand","authors":"Robin Jeanne Kirschner, Jinyu Yang, Edonis Elshani, Carina M.\n  Micheler, Tobias Leibbrand, Dirk M\\\"uller, Claudio Glowalla, Nader Rajaei,\n  Rainer Burgkart and Sami Haddadin","authorsParsed":[["Kirschner","Robin Jeanne",""],["Yang","Jinyu",""],["Elshani","Edonis",""],["Micheler","Carina M.",""],["Leibbrand","Tobias",""],["Müller","Dirk",""],["Glowalla","Claudio",""],["Rajaei","Nader",""],["Burgkart","Rainer",""],["Haddadin","Sami",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 14:21:11 GMT"},{"version":"v2","created":"Sun, 18 Aug 2024 15:51:11 GMT"},{"version":"v3","created":"Sat, 31 Aug 2024 12:12:58 GMT"}],"updateDate":"2024-09-04","timestamp":1723472471000,"abstract":"  Safety for physical human-robot interaction (pHRI) is a major concern for all\napplication domains. While current standardization for industrial robot\napplications provide safety constraints that address the onset of pain in blunt\nimpacts, these impact thresholds are difficult to use on edged or pointed\nimpactors. The most severe injuries occur in constrained contact scenarios,\nwhere crushing is possible. Nevertheless, situations potentially resulting in\nconstrained contact only occur in certain areas of a workspace and design or\norganisational approaches can be used to avoid them. What remains are risks to\nthe human physical integrity caused by unconstrained accidental contacts, which\nare difficult to avoid while maintaining robot motion efficiency. Nevertheless,\nthe probability and severity of injuries occurring with edged or pointed\nimpacting objects in unconstrained collisions is hardly researched. In this\npaper, we propose an experimental setup and procedure using two pendulums\nmodeling human hands and arms and robots to understand the injury potential of\nunconstrained collisions of human hands with edged objects. Pig feet are used\nas ex vivo surrogate samples - as these closely resemble the physiological\ncharacteristics of human hands - to create an initial injury database on the\nseverity of injuries caused by unconstrained edged or pointed impacts. For the\neffective mass range of typical lightweight robots, the data obtained show low\nprobabilities of injuries such as skin cuts or bone/tendon injuries in\nunconstrained collisions when the velocity is reduced to < 0.5 m/s. The\nproposed experimental setups and procedures should be complemented by\nsufficient human modeling and will eventually lead to a complete understanding\nof the biomechanical injury potential in pHRI.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/"}