{"id":"2408.15824","title":"On the Nature of the C IV-bearing Circumgalactic Medium at z~1","authors":"Suyash Kumar, Hsiao-Wen Chen, Zhijie Qu, Mandy C. Chen, Fakhri S.\n  Zahedy, Sean D. Johnson, Sowgat Muzahid, Sebastiano Cantalupo","authorsParsed":[["Kumar","Suyash",""],["Chen","Hsiao-Wen",""],["Qu","Zhijie",""],["Chen","Mandy C.",""],["Zahedy","Fakhri S.",""],["Johnson","Sean D.",""],["Muzahid","Sowgat",""],["Cantalupo","Sebastiano",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 14:34:48 GMT"}],"updateDate":"2024-08-29","timestamp":1724855688000,"abstract":"  This paper presents a detailed study of the physical properties of seven C IV\nabsorbers identified at z_abs = 0.68-1.28 along the line of sight toward QSO PG\n1522+101 (z_QSO = 1.330). The study leverages high-quality QSO spectra from HST\nCOS and STIS, and Keck HIRES to resolve component structures and to constrain\nthe gas density and elemental abundances of individual components. Under the\nassumption of photoionization equilibrium (PIE), five of the 12 C IV components\nrequire a mixture of high- and low-density phases to fully explain the observed\nrelative abundances between low-, intermediate-, and high-ionization species.\nIn addition, galaxy surveys carried out using VLT MUSE and Magellan LDSS3c are\nutilized to characterize the galaxy environments. The results of this analysis\nare summarized as follows: (1) no luminous galaxies (> 0.1 L*) are found within\n100 kpc in projected distance from the C IV absorbers; (2) the C IV selection\npreferentially targets high-metallicity (near solar) and chemically-evolved gas\n(~ solar [C/O] elemental abundances) in galaxy halos; (3) the observed narrow\nline widths of individual C IV components, places a stringent limit on the gas\ntemperature (< 5e4 K) and supports a photoionization origin; (4) additional\nlocal ionizing sources beyond the UV ionizing background may be necessary for\nat least one absorber based on the observed deficit of He I relative to H I;\nand (5) a PIE assumption may not apply when the gas metallicity exceeds the\nsolar value and the component line width implies a warmer temperature than\nexpected from PIE models.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pr6NFeVjkw_P8FE8CBNjLrT87rNGIpmlvWwoSd2bvVQ","pdfSize":"3675467"}
