{"id":"2408.03332","title":"Eliminating Bias in Pedestrian Density Estimation: A Voronoi Cell\n  Perspective","authors":"Pratik Mullick, C\\'ecile Appert-Rolland, William H. Warren, Julien\n  Pettr\\'e","authorsParsed":[["Mullick","Pratik",""],["Appert-Rolland","Cécile",""],["Warren","William H.",""],["Pettré","Julien",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 06:13:45 GMT"}],"updateDate":"2024-08-08","timestamp":1721456025000,"abstract":"  For pedestrians moving without spatial constraints, extensive research has\nbeen devoted to develop methods of density estimation. In this paper we present\na new approach based on Voronoi cells, offering a means to estimate density for\nindividuals in small, unbounded pedestrian groups. A thorough evaluation of\nexisting methods, encompassing both Lagrangian and Eulerian approaches employed\nin similar contexts, reveals notable limitations. Specifically, these methods\nturn out to be ill-defined for realistic density estimation along a\npedestrian's trajectory, exhibiting systematic biases and fluctuations that\ndepend on the choice of parameters. There is thus a need for a\nparameter-independent method to eliminate this bias. We propose a modification\nof the widely used Voronoi-cell based density estimate to accommodate\npedestrian groups, irrespective of their size. The advantages of this modified\nVoronoi method are that it is an instantaneous method that requires only\nknowledge of the pedestrians' positions at a give time, does not depend on the\nchoice of parameter values, gives us a realistic estimate of density in an\nindividual's neighborhood, and has appropriate physical meaning for both small\nand large human crowds in a wide variety of situations. We conclude with\ngeneral remarks about the meaning of density measurements for small groups of\npedestrians.\n","subjects":["Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ad_i8CHMw3B2BeCD5E55sOrKMwzrUpiPZ3LrOdcVl2M","pdfSize":"1034475"}
