{"id":"2408.14830","title":"PolicyLR: A Logic Representation For Privacy Policies","authors":"Ashish Hooda, Rishabh Khandelwal, Prasad Chalasani, Kassem Fawaz,\n  Somesh Jha","authorsParsed":[["Hooda","Ashish",""],["Khandelwal","Rishabh",""],["Chalasani","Prasad",""],["Fawaz","Kassem",""],["Jha","Somesh",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 07:27:16 GMT"}],"updateDate":"2024-08-28","timestamp":1724743636000,"abstract":"  Privacy policies are crucial in the online ecosystem, defining how services\nhandle user data and adhere to regulations such as GDPR and CCPA. However,\ntheir complexity and frequent updates often make them difficult for\nstakeholders to understand and analyze. Current automated analysis methods,\nwhich utilize natural language processing, have limitations. They typically\nfocus on individual tasks and fail to capture the full context of the policies.\nWe propose PolicyLR, a new paradigm that offers a comprehensive\nmachine-readable representation of privacy policies, serving as an all-in-one\nsolution for multiple downstream tasks. PolicyLR converts privacy policies into\na machine-readable format using valuations of atomic formulae, allowing for\nformal definitions of tasks like compliance and consistency. We have developed\na compiler that transforms unstructured policy text into this format using\noff-the-shelf Large Language Models (LLMs). This compiler breaks down the\ntransformation task into a two-stage translation and entailment procedure. This\nprocedure considers the full context of the privacy policy to infer a complex\nformula, where each formula consists of simpler atomic formulae. The advantage\nof this model is that PolicyLR is interpretable by design and grounded in\nsegments of the privacy policy. We evaluated the compiler using ToS;DR, a\ncommunity-annotated privacy policy entailment dataset. Utilizing open-source\nLLMs, our compiler achieves precision and recall values of 0.91 and 0.88,\nrespectively. Finally, we demonstrate the utility of PolicyLR in three privacy\ntasks: Policy Compliance, Inconsistency Detection, and Privacy Comparison\nShopping.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dO8HBaQEj8pS32aiwhg1O6esI50Zen-wwz0eHIBG8o4","pdfSize":"1524142"}
