{"id":"2408.06452","title":"Wireless Channel Aware Data Augmentation Methods for Deep Learning-Based\n  Indoor Localization","authors":"Omer Gokalp Serbetci, Daoud Burghal and Andreas F. Molisch","authorsParsed":[["Serbetci","Omer Gokalp",""],["Burghal","Daoud",""],["Molisch","Andreas F.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 19:01:49 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 01:46:48 GMT"}],"updateDate":"2024-08-29","timestamp":1723489309000,"abstract":"  Indoor localization is a challenging problem that - unlike outdoor\nlocalization - lacks a universal and robust solution. Machine Learning (ML),\nparticularly Deep Learning (DL), methods have been investigated as a promising\napproach. Although such methods bring remarkable localization accuracy, they\nheavily depend on the training data collected from the environment. The data\ncollection is usually a laborious and time-consuming task, but Data\nAugmentation (DA) can be used to alleviate this issue. In this paper, different\nfrom previously used DA, we propose methods that utilize the domain knowledge\nabout wireless propagation channels and devices. The methods exploit the\ntypical hardware component drift in the transceivers and/or the statistical\nbehavior of the channel, in combination with the measured Power Delay Profile\n(PDP). We comprehensively evaluate the proposed methods to demonstrate their\neffectiveness. This investigation mainly focuses on the impact of factors such\nas the number of measurements, augmentation proportion, and the environment of\ninterest impact the effectiveness of the different DA methods. We show that in\nthe low-data regime (few actual measurements available), localization accuracy\nincreases up to 50%, matching non-augmented results in the high-data regime. In\naddition, the proposed methods may outperform the measurement-only high-data\nperformance by up to 33% using only 1/4 of the amount of measured data. We also\nexhibit the effect of different training data distribution and quality on the\neffectiveness of DA. Finally, we demonstrate the power of the proposed methods\nwhen employed along with Transfer Learning (TL) to address the data scarcity in\ntarget and/or source environments.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vtrCeXEKGGx773G7tZjsaJ2AAG3cz2l0OE5yR5RnXx4","pdfSize":"1196561"}
