{"id":"2408.01004","title":"Instabilities in strongly shear-thinning viscoelastic flows through\n  channels and tubes","authors":"Ramkarn Patne, Shraddha Mandloi, V. Shankar and Ganesh Subramanian","authorsParsed":[["Patne","Ramkarn",""],["Mandloi","Shraddha",""],["Shankar","V.",""],["Subramanian","Ganesh",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 04:39:03 GMT"}],"updateDate":"2024-08-05","timestamp":1722573543000,"abstract":"  The linear stability of a shear-thinning, viscoelastic fluid undergoing any\nof the canonical rectilinear shear flows, viz., plane Couette flow and\npressure-driven flow through a channel or a tube is analyzed in the\ncreeping-flow limit using the White--Metzner model with a power-law variation\nof the viscosity with shear rate. While two-dimensional disturbances are\nconsidered for plane Couette and channel flows, axisymmetric disturbances are\nconsidered for pressure-driven flow in a tube. For all these flows, when the\nshear-thinning exponent is less than $0.3$, there exists an identical\ninstability at wavelengths much smaller than the relevant geometric length\nscale (gap between the plates or tube radius). There is also a\nfinite-wavelength instability in these configurations governed by the details\nof the geometry and boundary conditions at the centerline of the channel or\ntube. The most unstable mode could be either of the short-wave or\nfinite-wavelength instabilities depending on model parameters. For\npressure-driven channel flow, it is possible to have sinuous or varicose\nunstable modes depending on the symmetry of the normal velocity eigenfunction\nabout the channel centerline. This difference in symmetry is relevant only for\nthe finite wavelength instability, in which case sinuous modes turn out to be\nmore unstable, in accordance with experimental observations. In all the three\nconfigurations, the short wavelength unstable modes are localized near the\nwalls, and are insensitive to symmetry conditions at the centerline. It is\nargued that this instability should be a generic feature in any wall-bounded\nshear flow of strongly shear-thinning viscoelastic fluids. Our predictions for\nthe finite-wavelength instability in pressure-driven channel and pipe flows are\nin good agreement with experimental observations for the flow of concentrated\npolymer solutions in these geometries.\n","subjects":["Physics/Fluid Dynamics","Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"D_nDLLg0WcaJGNKP1EgadhUxjeUE2SQrvXGtdzwIte0","pdfSize":"1612435","txDigest":"EUkt2Wqv7ZRWjdp4i4F3g8Q8W6Su8WYHDmNHHBA9sYCk","endEpoch":"1","status":"CERTIFIED"}
