{"id":"2408.06508","title":"The Kinetic Analogue of the Pressure-Strain Interaction","authors":"Sarah A. Conley, James Juno, Jason M. TenBarge, M. Hasan Barbhuiya,\n  Paul A. Cassak, Gregory G. Howes, and Emily Lichko","authorsParsed":[["Conley","Sarah A.",""],["Juno","James",""],["TenBarge","Jason M.",""],["Barbhuiya","M. Hasan",""],["Cassak","Paul A.",""],["Howes","Gregory G.",""],["Lichko","Emily",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 21:57:10 GMT"}],"updateDate":"2024-08-14","timestamp":1723499830000,"abstract":"  Energy transport in weakly collisional plasma systems is often studied with\nfluid models and diagnostics. However, the applicability of fluid models is\nnecessarily limited when collisions are weak or absent, and using a fluid\napproach can obscure kinetic processes that provide key insights into the\nphysics of energy transport. A kinetic technique that retains all of the\ninformation in 3D-3V phase-space for the study of energy transfer between\nelectromagnetic fields and particle kinetic energy, which is quantified by the\nrate of electromagnetic work per unit volume $\\mathbf{j} \\cdot \\mathbf{E}$ in\nfluid models, is the Field- Particle Correlation (FPC) technique. This\ntechnique has demonstrated that leveraging the full information contained in\nphase-space can elucidate the physical mechanisms of energy transfer. This\nprovides a significant advantage over fluid diagnostics that quantify the rate\nat which energy is exchanged but do not distinguish between different physical\nprocesses. A different channel of energy transport, between fluid flow energy\nand particle internal energy, is quantified in fluid models via the\npressure-strain interaction $-(\\mathbf{P} \\cdot \\nabla ) \\cdot \\mathbf{u}$.\nUsing a similar approach to that of the field-particle correlation technique,\nin this work we derive a kinetic analog of the pressure-strain interaction and\nuse it alongside the field-particle correlation to analyze the flow of energy\nfrom electromagnetic fields into particle internal energy in two case studies\nof electron Landau damping.\n","subjects":["Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}