{"id":"2408.00650","title":"Induced smectic ordering and blue phase formation in mixtures of\n  cyanobiphenyls and cholesterol esters","authors":"Natalia A. Kasian, Longin N. Lisetski, Serhii E. Ivanchenko, Vitalii\n  O. Chornous, Halyna V. Bogatyryova, Igor A. Gvozdovskyy","authorsParsed":[["Kasian","Natalia A.",""],["Lisetski","Longin N.",""],["Ivanchenko","Serhii E.",""],["Chornous","Vitalii O.",""],["Bogatyryova","Halyna V.",""],["Gvozdovskyy","Igor A.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 15:41:06 GMT"}],"updateDate":"2024-08-02","timestamp":1722526866000,"abstract":"  It has been found that in mixtures of nematic E7 and smectogenic cholesteryl\noleyl carbonate (COC) the S$_A$-N* transition temperature is substantially (by\n~20 K) increased, as compared with pure COC, at E7 concentrations around ~40%.\nWithin the same concentration range, the isotropic transition is preceded by\nformation of blue phase, with its maximum width of ~3.5 K clearly correlated to\nthe increased thermal stability of the S$_A$ phase. With other cholesterol\nesters or cyanobiphenyls (cholesteryl nonanoate, 5CB), this effect was either\nmuch weaker or not observed. No enhancement of smectic phase was noted when E7\nwas replaced by N$_{tb}$-forming nematic mixture based on CB7CB with two\ncyanobiphenyl moieties. Selective Bragg reflection of light (BRL) spectra were\nmeasured in all three temperature regions, including the unwinding of the\ncholesteric helix on cooling towards S$_A$ phase and characteristic selective\nBRL changes in the blue phase. In the latter case, the measured\n{\\lambda}$_{max}$ values were dependent both on the helical twisting power in\nthe cholesteric phase and on the lattice size and orientation in the blue\nphase. Also considered were the effects of ferroelectric BaTiO$_3$\nnanoparticles accumulated at disclination lines upon the blue phase thermal\nstability.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LsDQWZfjZ58ne0Z8xPCMUtwmd1eK3qj3QSvHXQ1gfgs","pdfSize":"583052","txDigest":"AzxYfpuRecvCcveq6EodwKAZzk8esXp8ePm2U6Xekgi7","endEpoch":"1","status":"CERTIFIED"}
