{"id":"2408.10997","title":"Disentangling segmental and prosodic factors to non-native speech\n  comprehensibility","authors":"Waris Quamer, and Ricardo Gutierrez-Osuna","authorsParsed":[["Quamer","Waris",""],["Gutierrez-Osuna","Ricardo",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 16:43:55 GMT"}],"updateDate":"2024-08-21","timestamp":1724172235000,"abstract":"  Current accent conversion (AC) systems do not disentangle the two main\nsources of non-native accent: segmental and prosodic characteristics. Being\nable to manipulate a non-native speaker's segmental and/or prosodic channels\nindependently is critical to quantify how these two channels contribute to\nspeech comprehensibility and social attitudes. We present an AC system that not\nonly decouples voice quality from accent, but also disentangles the latter into\nits segmental and prosodic characteristics. The system is able to generate\naccent conversions that combine (1) the segmental characteristics from a source\nutterance, (2) the voice characteristics from a target utterance, and (3) the\nprosody of a reference utterance. We show that vector quantization of acoustic\nembeddings and removal of consecutive duplicated codewords allows the system to\ntransfer prosody and improve voice similarity. We conduct perceptual listening\ntests to quantify the individual contributions of segmental features and\nprosody on the perceived comprehensibility of non-native speech. Our results\nindicate that, contrary to prior research in non-native speech, segmental\nfeatures have a larger impact on comprehensibility than prosody. The proposed\nAC system may also be used to study how segmental and prosody cues affect\nsocial attitudes towards non-native speech.\n","subjects":["Computing Research Repository/Computation and Language","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HhlHx1AFSyEy15dSNrXTkgly8S_dHYyAX6uBiZ3W4eI","pdfSize":"583730"}
