{"id":"2408.07698","title":"Gamma vectors as inverted Chebyshev expansions, type A to B\n  transformations, and connections to algebraic structures","authors":"Soohyun Park","authorsParsed":[["Park","Soohyun",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 17:55:55 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 17:56:44 GMT"}],"updateDate":"2024-08-19","timestamp":1723658155000,"abstract":"  Given a reciprocal/palindromic polynomial of even degree, we show that the\ngamma vector is essentially given by an inverted Chebyshev polynomial basis\nexpansion. As an immediate consequence, we characterize real-rootedness of a\nlinear combination of Chebyshev polynomials in terms of real-rootedness of that\nof the reciprocal polynomial built out of an inverted scaled tuple of the\ncoefficients with one fixed and the rest divided by 2. It can be taken as a\ncounterpart to a recent result of Bel-Afia--Meroni--Telen on hyperbolicity of\nChebyshev curves with respect to the origin. Apart from this, the inverted\nChebyshev expansion also yields connections between intrinsic properties of the\ngamma vector construction and the geometric combinatorics of simplicial\ncomplexes and posets.\n  We find this by applying work of Hetyei on Tchebyshev subdivisions and\nTchebyshev posets. In particular, we find that the gamma vector transformation\nis closely related to $f$-vectors of simplicial complexes resulting from\nsuccessive edge subdivisions that transform the type A Coxeter complex to the\ntype B Coxeter complex. Lifting to this to the level of $ce$-indices (a\nmodification of $cd$-indices), we show that the gamma vector inverted Chebyshev\npolynomial expansion lifts to a sum of $ce$-indices of cross polytope\ntriangulations which can be computed using descent statistics involving edge\nlabelings of maximal chains. While there are many examples in the literature\nwhere gamma positivity involving descent statistics, it is interesting to note\nthat we have this without initial structural assumptions on the input\npolynomial apart from being reciprocal/palindromic. Finally, we note that all\nof these can be repeated with Chebyshev polynomials of the second kind after\ntaking derivatives and that this gives connections to Hopf algebras and\nquasisymmetric functions.\n","subjects":["Mathematics/Combinatorics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}