{"id":"2408.16466","title":"Topological zero modes and bounded modes at smooth domain walls: exact\n  solutions and dualities","authors":"Pasquale Marra and Angela Nigro","authorsParsed":[["Marra","Pasquale",""],["Nigro","Angela",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 11:55:13 GMT"}],"updateDate":"2024-08-30","timestamp":1724932513000,"abstract":"  Topology describes global quantities invariant under continuous deformations,\nsuch as the number of elementary excitations at a phase boundary, without\ndetailing specifics. Conversely, differential laws are needed to understand the\nphysical properties of these excitations, such as their localization and\nspatial behavior. For instance, topology mandates the existence of solitonic\nzero-energy modes at the domain walls between topologically inequivalent phases\nin topological insulators and superconductors. However, the spatial dependence\nof these modes is only known in the idealized (and unrealistic) case of a sharp\ndomain wall. Here, we find the analytical solutions of these zero-modes by\nassuming a smooth and exponentially-confined domain wall. This allows us to\ncharacterize the zero-modes using a few length scales: the domain wall width,\nthe exponential decay length, and oscillation wavelength. These quantities\ndefine distinct regimes: featureless modes with \"no hair\" at sharp domain\nwalls, and nonfeatureless modes at smooth domain walls, respectively, with\n\"short hair\", i.e., featureless at long distances, and \"long hair\", i.e.,\nnonfeatureless at all length scales. We thus establish a universal relation\nbetween the bulk excitation gap, decay rate, and oscillation momentum of the\nzero modes, which quantifies the bulk-boundary correspondence in terms of\nexperimentally measurable physical quantities. Additionally, we reveal an\nunexpected duality between topological zero modes and Shockley modes, unifying\nthe understanding of topologically-protected and nontopological boundary modes.\nThese findings shed some new light on the localization properties of edge modes\nin topological insulators and Majorana zero modes in topological\nsuperconductors and on the differences and similarities between topological and\nnontopological zero modes in these systems.\n","subjects":["Physics/High Energy Physics - Theory","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Superconductivity","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}