{"id":"2408.06727","title":"Machine Learning Interventions for Weed Detection using Multispectral\n  Imagery and Unmanned Aerial Vehicles -- A Systematic Review","authors":"Drishti Goel (1), Bhavya Kapur (2) and Prem Prakash Vuppuluri (3) ((1)\n  Research Fellow, Microsoft, Bengaluru, India (2) Data Scientist, NeenOpal\n  Intelligent Solutions Inc., Bengaluru, India (3) Assistant Professor,\n  Dayalbagh Educational Institute (Deemed University), Agra, India)","authorsParsed":[["Goel","Drishti",""],["Kapur","Bhavya",""],["Vuppuluri","Prem Prakash",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 08:37:46 GMT"}],"updateDate":"2024-08-14","timestamp":1723538266000,"abstract":"  The growth of weeds poses a significant challenge to agricultural\nproductivity, necessitating efficient and accurate weed detection and\nmanagement strategies. The combination of multispectral imaging and drone\ntechnology has emerged as a promising approach to tackle this issue, enabling\nrapid and cost-effective monitoring of large agricultural fields. This\nsystematic review surveys and evaluates the state-of-the-art in machine\nlearning interventions for weed detection that utilize multispectral images\ncaptured by unmanned aerial vehicles. The study describes the various models\nused for training, features extracted from multi-spectral data, their\nefficiency and effect on the results, the performance analysis parameters, and\nalso the current challenges faced by researchers in this domain. The review was\nconducted in accordance with the PRISMA guidelines. Three sources were used to\nobtain the relevant material, and the screening and data extraction were done\non the COVIDENCE platform. The search string resulted in 600 papers from all\nsources. The review also provides insights into potential research directions\nand opportunities for further advancements in the field. These insights would\nserve as a valuable guide for researchers, agricultural scientists, and\npractitioners in developing precise and sustainable weed management strategies\nto enhance agricultural productivity and minimize ecological impact.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}