{"id":"2408.13336","title":"Oscillatory and Excitable Dynamics in an Opinion Model with Group\n  Opinions","authors":"Corbit R. Sampson, Mason A. Porter, and Juan G. Restrepo","authorsParsed":[["Sampson","Corbit R.",""],["Porter","Mason A.",""],["Restrepo","Juan G.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 19:01:46 GMT"}],"updateDate":"2024-09-02","timestamp":1724439706000,"abstract":"  In traditional models of opinion dynamics, each agent in a network has an\nopinion and changes in opinions arise from pairwise (i.e., dyadic) interactions\nbetween agents. However, in many situations, groups of individuals can possess\na collective opinion that may differ from the opinions of the individuals. In\nthis paper, we study the effects of group opinions on opinion dynamics. We\nformulate a hypergraph model in which both individual agents and groups of 3\nagents have opinions, and we examine how opinions evolve through both dyadic\ninteractions and group memberships. In some parameter regimes, we find that the\npresence of group opinions can lead to oscillatory and excitable opinion\ndynamics. In the oscillatory regime, the mean opinion of the agents in a\nnetwork has self-sustained oscillations. In the excitable regime, finite-size\neffects create large but short-lived opinion swings (as in social fads). We\ndevelop a mean-field approximation of our model and obtain good agreement with\ndirect numerical simulations. We also show, both numerically and via our\nmean-field description, that oscillatory dynamics occur only when the number of\ndyadic and polyadic interactions per agent are not completely correlated. Our\nresults illustrate how polyadic structures, such as groups of agents, can have\nimportant effects on collective opinion dynamics.\n","subjects":["Physics/Physics and Society","Computing Research Repository/Social and Information Networks","Mathematics/Dynamical Systems","Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}