{"id":"2408.09120","title":"Time Series Analysis by State Space Learning","authors":"Andr\\'e Ramos, Davi Vallad\\~ao, Alexandre Street","authorsParsed":[["Ramos","André",""],["Valladão","Davi",""],["Street","Alexandre",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 07:04:26 GMT"}],"updateDate":"2024-08-20","timestamp":1723878266000,"abstract":"  Time series analysis by state-space models is widely used in forecasting and\nextracting unobservable components like level, slope, and seasonality, along\nwith explanatory variables. However, their reliance on traditional Kalman\nfiltering frequently hampers their effectiveness, primarily due to Gaussian\nassumptions and the absence of efficient subset selection methods to\naccommodate the multitude of potential explanatory variables in today's\nbig-data applications. Our research introduces the State Space Learning (SSL),\na novel framework and paradigm that leverages the capabilities of statistical\nlearning to construct a comprehensive framework for time series modeling and\nforecasting. By utilizing a regularized high-dimensional regression framework,\nour approach jointly extracts typical time series unobservable components,\ndetects and addresses outliers, and selects the influence of exogenous\nvariables within a high-dimensional space in polynomial time and global\noptimality guarantees. Through a controlled numerical experiment, we\ndemonstrate the superiority of our approach in terms of subset selection of\nexplanatory variables accuracy compared to relevant benchmarks. We also present\nan intuitive forecasting scheme and showcase superior performances relative to\ntraditional time series models using a dataset of 48,000 monthly time series\nfrom the M4 competition. We extend the applicability of our approach to\nreformulate any linear state space formulation featuring time-varying\ncoefficients into high-dimensional regularized regressions, expanding the\nimpact of our research to other engineering applications beyond time series\nanalysis. Finally, our proposed methodology is implemented within the Julia\nopen-source package, ``StateSpaceLearning.jl\".\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"A6ok3puQeIdSHuJy-0Y_GpNtGSmabxZFIVpYM21Icpg","pdfSize":"1347286"}
