{"id":"2408.06459","title":"InfLocNet: Enhanced Lung Infection Localization and Disease Detection\n  from Chest X-Ray Images Using Lightweight Deep Learning","authors":"Md. Asiful Islam Miah, Shourin Paul, Sunanda Das, M. M. A. Hashem","authorsParsed":[["Miah","Md. Asiful Islam",""],["Paul","Shourin",""],["Das","Sunanda",""],["Hashem","M. M. A.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 19:19:23 GMT"}],"updateDate":"2024-08-14","timestamp":1723490363000,"abstract":"  In recent years, the integration of deep learning techniques into medical\nimaging has revolutionized the diagnosis and treatment of lung diseases,\nparticularly in the context of COVID-19 and pneumonia. This paper presents a\nnovel, lightweight deep learning based segmentation-classification network\ndesigned to enhance the detection and localization of lung infections using\nchest X-ray images. By leveraging the power of transfer learning with\npre-trained VGG-16 weights, our model achieves robust performance even with\nlimited training data. The architecture incorporates refined skip connections\nwithin the UNet++ framework, reducing semantic gaps and improving precision in\nsegmentation tasks. Additionally, a classification module is integrated at the\nend of the encoder block, enabling simultaneous classification and\nsegmentation. This dual functionality enhances the model's versatility,\nproviding comprehensive diagnostic insights while optimizing computational\nefficiency. Experimental results demonstrate that our proposed lightweight\nnetwork outperforms existing methods in terms of accuracy and computational\nrequirements, making it a viable solution for real-time and resource\nconstrained medical imaging applications. Furthermore, the streamlined design\nfacilitates easier hyperparameter tuning and deployment on edge devices. This\nwork underscores the potential of advanced deep learning architectures in\nimproving clinical outcomes through precise and efficient medical image\nanalysis. Our model achieved remarkable results with an Intersection over Union\n(IoU) of 93.59% and a Dice Similarity Coefficient (DSC) of 97.61% in lung area\nsegmentation, and an IoU of 97.67% and a DSC of 87.61% for infection region\nlocalization. Additionally, it demonstrated high accuracy of 93.86% and\nsensitivity of 89.55% in detecting chest diseases, highlighting its efficacy\nand reliability.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}