{"id":"2408.06210","title":"Certified Safe: A Schematic for Approval Regulation of Frontier AI","authors":"Cole Salvador","authorsParsed":[["Salvador","Cole",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 15:01:03 GMT"}],"updateDate":"2024-08-13","timestamp":1723474863000,"abstract":"  Recent and unremitting capability advances have been accompanied by calls for\ncomprehensive, rather than patchwork, regulation of frontier artificial\nintelligence (AI). Approval regulation is emerging as a promising candidate. An\napproval regulation scheme is one in which a firm cannot legally market, or in\nsome cases develop, a product without explicit approval from a regulator on the\nbasis of experiments performed upon the product that demonstrate its safety.\nThis approach is used successfully by the FDA and FAA. Further, its application\nto frontier AI has been publicly supported by many prominent stakeholders. This\nreport proposes an approval regulation schematic for only the largest AI\nprojects in which scrutiny begins before training and continues through to\npost-deployment monitoring. The centerpieces of the schematic are two major\napproval gates, the first requiring approval for large-scale training and the\nsecond for deployment. Five main challenges make implementation difficult:\nnoncompliance through unsanctioned deployment, specification of deployment\nreadiness requirements, reliable model experimentation, filtering out safe\nmodels before the process, and minimizing regulatory overhead. This report\nmakes a number of crucial recommendations to increase the feasibility of\napproval regulation, some of which must be followed urgently if such a regime\nis to succeed in the near future. Further recommendations, produced by this\nreport's analysis, may improve the effectiveness of any regulatory regime for\nfrontier AI.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"YqCQCIeurmoCVTsqKdjBFWEGxvinoUmWd6MycNL3l54","pdfSize":"7437245"}
