{"id":"2408.16543","title":"Statistical and Geometrical properties of regularized Kernel\n  Kullback-Leibler divergence","authors":"Cl\\'ementine Chazal, Anna Korba, Francis Bach","authorsParsed":[["Chazal","Clémentine",""],["Korba","Anna",""],["Bach","Francis",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 14:01:30 GMT"}],"updateDate":"2024-08-30","timestamp":1724940090000,"abstract":"  In this paper, we study the statistical and geometrical properties of the\nKullback-Leibler divergence with kernel covariance operators (KKL) introduced\nby Bach [2022]. Unlike the classical Kullback-Leibler (KL) divergence that\ninvolves density ratios, the KKL compares probability distributions through\ncovariance operators (embeddings) in a reproducible kernel Hilbert space\n(RKHS), and compute the Kullback-Leibler quantum divergence. This novel\ndivergence hence shares parallel but different aspects with both the standard\nKullback-Leibler between probability distributions and kernel embeddings\nmetrics such as the maximum mean discrepancy. A limitation faced with the\noriginal KKL divergence is its inability to be defined for distributions with\ndisjoint supports. To solve this problem, we propose in this paper a\nregularised variant that guarantees that the divergence is well defined for all\ndistributions. We derive bounds that quantify the deviation of the regularised\nKKL to the original one, as well as finite-sample bounds. In addition, we\nprovide a closed-form expression for the regularised KKL, specifically\napplicable when the distributions consist of finite sets of points, which makes\nit implementable. Furthermore, we derive a Wasserstein gradient descent scheme\nof the KKL divergence in the case of discrete distributions, and study\nempirically its properties to transport a set of points to a target\ndistribution.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning","Mathematics/Functional Analysis","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kC7xfJO-znaydopJSwgmAiiB4TGyOY91MVra_Tc0ZSo","pdfSize":"1090521"}
