{"id":"2408.16397","title":"Engineering of Hyperentangled Complex Quantum Networks","authors":"Murad Ahmad, Liaqat Ali, Muhammad Imran, Rameez-ul-Islam, Manzoor\n  Ikram, Rafi Ud Din, Ashfaq Ahmad, Iftikhar Ahmad","authorsParsed":[["Ahmad","Murad",""],["Ali","Liaqat",""],["Imran","Muhammad",""],["Rameez-ul-Islam","",""],["Ikram","Manzoor",""],["Din","Rafi Ud",""],["Ahmad","Ashfaq",""],["Ahmad","Iftikhar",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 09:58:03 GMT"}],"updateDate":"2024-08-30","timestamp":1724925483000,"abstract":"  Hyperentangled states are highly efficient and resource economical. This is\nbecause they enhance the quantum information encoding capabilities due to the\ncorrelated engagement of more than one degree of freedom of the same quantum\nentity while keeping the physical resources at their minimum. Therefore,\ninitially the photonic hyperentangled states have been explored extensively but\nthe generation and respective manipulation of the atomic counterpart states are\nstill limited to only few proposals. In this work, we propose a new and\nfeasible scheme to engineer the atomic hyperentangled cluster and ring graph\nstates invoking cavity QED technique for applicative relevance to quantum\nbiology and quantum communications utilizing the complex quantum networks.\nThese states are engineered using both external quantized momenta states and\nenergy levels of neutral atoms under off-resonant and resonant Atomic Bragg\nDiffraction (ABD) technique. The study of dynamical capacity and potential\nefficiency have certainly enhanced the range of usefulness of these states. In\norder to assess the operational behavior of such states when subjected to a\nrealistic noise environment has also been simulated, demonstrating long enough\nsustainability of the proposed states. Moreover, experimental feasibility of\nthe proposed scheme has also been elucidated under the prevailing cavity-QED\nresearch scenario.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Wt6izt1caxjT7vrpvDurVq1dptQt-VKr5JTEPV9zjJM","pdfSize":"590994"}
