{"id":"2408.03474","title":"The Chicago-Carnegie Hubble Program: The JWST J-region Asymptotic Giant\n  Branch (JAGB) Extragalactic Distance Scale","authors":"Abigail J. Lee, Wendy L. Freedman, Barry F. Madore, In Sung Jang,\n  Kayla A. Owens, Taylor J. Hoyt","authorsParsed":[["Lee","Abigail J.",""],["Freedman","Wendy L.",""],["Madore","Barry F.",""],["Jang","In Sung",""],["Owens","Kayla A.",""],["Hoyt","Taylor J.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 23:14:19 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 17:12:49 GMT"}],"updateDate":"2024-08-13","timestamp":1722986059000,"abstract":"  The J-region asymptotic giant branch (JAGB) method is a new standard candle\nbased on the constant luminosities of carbon-rich asymptotic giant branch stars\nin the J band. The JAGB method is independent of the Cepheid and TRGB distance\nindicators. Therefore, we can leverage it to both cross-check Cepheid and TRGB\ndistances for systematic errors and use it to measure an independent local\nHubble constant. The JAGB method also boasts a number of advantages in\nmeasuring distances relative to the TRGB and Cepheids, several of which are\nespecially amplified when combined with JWST's revolutionary resolving power.\nFirst, JAGB stars are 1 mag brighter in the NIR than the TRGB, and can be\ndiscovered from single-epoch NIR photometry unlike Cepheids which require\ncongruent optical imaging in at least 12 epochs. Thus, JAGB stars can be used\nto measure significantly farther distances than both the TRGB stars and\nCepheids using the same amount of observing time. Further advantages include:\nJAGB stars are easily identified solely via their colors and magnitudes, dust\nextinction is reduced in near-infrared observations, and JAGB stars are\nubiquitous in all galaxies with intermediate-age populations. In this paper, we\npresent a novel algorithm that identifies the optimal location in a galaxy for\napplying the JAGB method, so as to minimize effects from crowding. We then\ndeploy this algorithm in JWST NIRCam imaging of seven SN Ia host galaxies to\nmeasure their JAGB distances, undertaking a completely blind analysis. The\nzero-point of this JAGB distance scale is set in the water mega-maser galaxy\nNGC 4258. In our CCHP overview paper Freedman et al. (2024), we apply the JAGB\ndistances measured in this paper to the Carnegie Supernova Program (CSP) SNe Ia\nsample, measuring a Hubble constant of H0 = 67.96 +/- 1.85 (stat) +/- 1.90\n(sys) km/s/Mpc.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}