{"id":"2408.14832","title":"Cross-sectional personal network analysis of adult smoking in rural\n  areas","authors":"Bianca-Elena Mih\\u{a}il\\u{a}, Marian-Gabriel H\\^ancean, Matja\\v{z}\n  Perc, J\\\"urgen Lerner, Iulian Oan\\u{a}, Marius Geant\\u{a}, Jos\\'e Luis\n  Molina, Cosmina Cioroboiu","authorsParsed":[["Mihăilă","Bianca-Elena",""],["Hâncean","Marian-Gabriel",""],["Perc","Matjaž",""],["Lerner","Jürgen",""],["Oană","Iulian",""],["Geantă","Marius",""],["Molina","José Luis",""],["Cioroboiu","Cosmina",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 07:42:07 GMT"}],"updateDate":"2024-08-28","timestamp":1724744527000,"abstract":"  While research on adolescent smoking is extensive, little attention has been\ngiven to smoking behaviors among rural middle-aged and older adults. This study\nexamines the role of personal networks and sociodemographic factors in\npredicting smoking status in a rural Romanian community. Using a link-tracing\nsampling method, we gathered data from 76 participants out of 83 in Leresti,\nArges County. Face-to-face interviews collected sociodemographic data and\nnetwork information, including smoking status and relational dynamics. We\napplied multilevel logistic regression models to predict smoking behaviors\n(current smokers, former smokers, and non-smokers) based on individual\ncharacteristics and network influences. Results indicate that social networks\nsignificantly influence smoking behaviors. For current smokers, having a\nsmoking family member greatly increased the odds of smoking (OR = 2.51, 95% CI:\n1.62, 3.91, p < 0.001). Similarly, non-smoking family members increased the\nlikelihood of being a non-smoker (OR = 1.64, 95% CI: 1.04, 2.61, p < 0.05).\nWomen were less likely to smoke, highlighting sex differences in behavior.\nThese findings emphasize the critical role of social networks in shaping\nsmoking habits, advocating for targeted interventions in rural areas.\n","subjects":["Statistics/Applications","Statistics/Other Statistics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Chankhhf8p-eEGBFENOnIeG4-Pui5ebXaOQKfzZP08s","pdfSize":"562514"}
