{"id":"2408.04884","title":"Enhancing Relevance of Embedding-based Retrieval at Walmart","authors":"Juexin Lin, Sachin Yadav, Feng Liu, Nicholas Rossi, Praveen R. Suram,\n  Satya Chembolu, Prijith Chandran, Hrushikesh Mohapatra, Tony Lee, Alessandro\n  Magnani, and Ciya Liao","authorsParsed":[["Lin","Juexin",""],["Yadav","Sachin",""],["Liu","Feng",""],["Rossi","Nicholas",""],["Suram","Praveen R.",""],["Chembolu","Satya",""],["Chandran","Prijith",""],["Mohapatra","Hrushikesh",""],["Lee","Tony",""],["Magnani","Alessandro",""],["Liao","Ciya",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 06:17:18 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 22:17:10 GMT"}],"updateDate":"2024-08-16","timestamp":1723184238000,"abstract":"  Embedding-based neural retrieval (EBR) is an effective search retrieval\nmethod in product search for tackling the vocabulary gap between customer\nsearch queries and products. The initial launch of our EBR system at Walmart\nyielded significant gains in relevance and add-to-cart rates [1]. However,\ndespite EBR generally retrieving more relevant products for reranking, we have\nobserved numerous instances of relevance degradation. Enhancing retrieval\nperformance is crucial, as it directly influences product reranking and affects\nthe customer shopping experience. Factors contributing to these degradations\ninclude false positives/negatives in the training data and the inability to\nhandle query misspellings. To address these issues, we present several\napproaches to further strengthen the capabilities of our EBR model in terms of\nretrieval relevance. We introduce a Relevance Reward Model (RRM) based on human\nrelevance feedback. We utilize RRM to remove noise from the training data and\ndistill it into our EBR model through a multi-objective loss. In addition, we\npresent the techniques to increase the performance of our EBR model, such as\ntypo-aware training, and semi-positive generation. The effectiveness of our EBR\nis demonstrated through offline relevance evaluation, online AB tests, and\nsuccessful deployments to live production.\n  [1] Alessandro Magnani, Feng Liu, Suthee Chaidaroon, Sachin Yadav, Praveen\nReddy Suram, Ajit Puthenputhussery, Sijie Chen, Min Xie, Anirudh Kashi, Tony\nLee, et al. 2022. Semantic retrieval at walmart. In Proceedings of the 28th ACM\nSIGKDD Conference on Knowledge Discovery and Data Mining. 3495-3503.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}