{"id":"2408.09149","title":"Uncovering key predictors of high-growth firms via explainable machine\n  learning","authors":"Yiwei Huang, Shuqi Xu, Linyuan L\\\"u, Andrea Zaccaria, Manuel Sebastian\n  Mariani","authorsParsed":[["Huang","Yiwei",""],["Xu","Shuqi",""],["Lü","Linyuan",""],["Zaccaria","Andrea",""],["Mariani","Manuel Sebastian",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 09:39:07 GMT"}],"updateDate":"2024-08-20","timestamp":1723887547000,"abstract":"  Predicting high-growth firms has attracted increasing interest from the\ntechnological forecasting and machine learning communities. Most existing\nstudies primarily utilize financial data for these predictions. However,\nresearch suggests that a firm's research and development activities and its\nnetwork position within technological ecosystems may also serve as valuable\npredictors. To unpack the relative importance of diverse features, this paper\nanalyzes financial and patent data from 5,071 firms, extracting three\ncategories of features: financial features, technological features of granted\npatents, and network-based features derived from firms' connections to their\nprimary technologies. By utilizing ensemble learning algorithms, we demonstrate\nthat incorporating financial features with either technological, network-based\nfeatures, or both, leads to more accurate high-growth firm predictions compared\nto using financial features alone. To delve deeper into the matter, we evaluate\nthe predictive power of each individual feature within their respective\ncategories using explainable artificial intelligence methods. Among\nnon-financial features, the maximum economic value of a firm's granted patents\nand the number of patents related to a firms' primary technologies stand out\nfor their importance. Furthermore, firm size is positively associated with\nhigh-growth probability up to a certain threshold size, after which the\nassociation plateaus. Conversely, the maximum economic value of a firm's\ngranted patents is positively linked to high-growth probability only after a\nthreshold value is exceeded. These findings elucidate the complex predictive\nrole of various features in forecasting high-growth firms and could inform\ntechnological resource allocation as well as investment decisions.\n","subjects":["Physics/Physics and Society","Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}