{"id":"2408.12615","title":"Pediatric TSC-Related Epilepsy Classification from Clinical MR Images\n  Using Quantum Neural Network","authors":"Ling Lin, Yihang Zhou, Zhanqi Hu, Dian Jiang, Congcong Liu, Shuo Zhou,\n  Yanjie Zhu, Jianxiang Liao, Dong Liang, Hairong Zheng, Haifeng Wang","authorsParsed":[["Lin","Ling",""],["Zhou","Yihang",""],["Hu","Zhanqi",""],["Jiang","Dian",""],["Liu","Congcong",""],["Zhou","Shuo",""],["Zhu","Yanjie",""],["Liao","Jianxiang",""],["Liang","Dong",""],["Zheng","Hairong",""],["Wang","Haifeng",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 14:11:06 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 14:06:59 GMT"}],"updateDate":"2024-08-27","timestamp":1723126266000,"abstract":"  Tuberous sclerosis complex (TSC) manifests as a multisystem disorder with\nsignificant neurological implications. This study addresses the critical need\nfor robust classification models tailored to TSC in pediatric patients,\nintroducing QResNet,a novel deep learning model seamlessly integrating\nconventional convolutional neural networks with quantum neural networks. The\nmodel incorporates a two-layer quantum layer (QL), comprising ZZFeatureMap and\nAnsatz layers, strategically designed for processing classical data within a\nquantum framework. A comprehensive evaluation, demonstrates the superior\nperformance of QResNet in TSC MRI image classification compared to conventional\n3D-ResNet models. These compelling findings underscore the potential of quantum\ncomputing to revolutionize medical imaging and diagnostics.Remarkably, this\nmethod surpasses conventional CNNs in accuracy and Area Under the Curve (AUC)\nmetrics with the current dataset. Future research endeavors may focus on\nexploring the scalability and practical implementation of quantum algorithms in\nreal-world medical imaging scenarios.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}