{"id":"2408.11658","title":"Spin-orbit-splitting-driven nonlinear Hall effect in NbIrTe4","authors":"Ji-Eun Lee, Aifeng Wang, Shuzhang Chen, Minseong Kwon, Jinwoong Hwang,\n  Minhyun Cho, Ki-Hoon Son, Dong-Soo Han, Jun Woo Choi, Young Duck Kim,\n  Sung-Kwan Mo, Cedomir Petrovic, Choongyu Hwang, Se Young Park, Chaun Jang,\n  and Hyejin Ryu","authorsParsed":[["Lee","Ji-Eun",""],["Wang","Aifeng",""],["Chen","Shuzhang",""],["Kwon","Minseong",""],["Hwang","Jinwoong",""],["Cho","Minhyun",""],["Son","Ki-Hoon",""],["Han","Dong-Soo",""],["Choi","Jun Woo",""],["Kim","Young Duck",""],["Mo","Sung-Kwan",""],["Petrovic","Cedomir",""],["Hwang","Choongyu",""],["Park","Se Young",""],["Jang","Chaun",""],["Ryu","Hyejin",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 14:33:14 GMT"}],"updateDate":"2024-08-22","timestamp":1724250794000,"abstract":"  The Berry curvature dipole (BCD) serves as a one of the fundamental\ncontributors to emergence of the nonlinear Hall effect (NLHE). Despite intense\ninterest due to its potential for new technologies reaching beyond the quantum\nefficiency limit, the interplay between BCD and NLHE has been barely understood\nyet in the absence of a systematic study on the electronic band structure.\nHere, we report NLHE realized in NbIrTe4 that persists above room temperature\ncoupled with a sign change in the Hall conductivity at 150 K. First-principles\ncalculations combined with angle-resolved photoemission spectroscopy (ARPES)\nmeasurements show that BCD tuned by the partial occupancy of spin-orbit split\nbands via temperature is responsible for the temperature-dependent NLHE. Our\nfindings highlight the correlation between BCD and the electronic band\nstructure, providing a viable route to create and engineer the non-trivial Hall\neffect by tuning the geometric properties of quasiparticles in transition-metal\nchalcogen compounds.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kLVQ0QWyo9ycFzUAVm589mdl8xBVGLFtcOeDILi4wOk","pdfSize":"8941536"}
