{"id":"2408.11077","title":"Solving Oscillator Ordinary Differential Equations via Soft-constrained\n  Physics-informed Neural Network with Small Data","authors":"Kai-liang Lu, Yu-meng Su, Zhuo Bi, Cheng Qiu, Wen-jun Zhang","authorsParsed":[["Lu","Kai-liang",""],["Su","Yu-meng",""],["Bi","Zhuo",""],["Qiu","Cheng",""],["Zhang","Wen-jun",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 13:02:06 GMT"},{"version":"v2","created":"Sat, 24 Aug 2024 15:54:34 GMT"},{"version":"v3","created":"Sun, 8 Sep 2024 01:56:58 GMT"}],"updateDate":"2024-09-10","timestamp":1724072526000,"abstract":"  This paper compared physics-informed neural network (PINN), conventional\nneural network (NN) and traditional numerical discretization methods on solving\ndifferential equations (DEs) through literature investigation and experimental\nvalidation. We focused on the soft-constrained PINN approach and formalized its\nmathematical framework and computational flow for solving Ordinary DEs and\nPartial DEs (ODEs/PDEs). The working mechanism and its accuracy and efficiency\nwere experimentally verified by solving typical linear and non-linear\noscillator ODEs. We demonstrate that the DeepXDE-based implementation of PINN\nis not only light code and efficient in training, but also flexible across\nCPU/GPU platforms. PINN greatly reduces the need for labeled data: when the\nnonlinearity of the ODE is weak, a very small amount of supervised training\ndata plus a few unsupervised collocation points are sufficient to predict the\nsolution; in the minimalist case, only one or two training points (with initial\nvalues) are needed for first- or second-order ODEs, respectively. We also find\nthat, with the aid of collocation points and the use of physical information,\nPINN has the ability to extrapolate data outside the time domain of the\ntraining set, and especially is robust to noisy data, thus with enhanced\ngeneralization capabilities. Training is accelerated when the gains obtained\nalong with the reduction in the amount of data outweigh the delay caused by the\nincrease in the loss function terms. The soft-constrained PINN can easily\nimpose a physical law (e.g., conservation of energy) constraint by adding a\nregularization term to the total loss function, thus improving the solution\nperformance to ODEs that obey this physical law. Furthermore, PINN can also be\nused for stiff ODEs, PDEs, and other types of DEs, and is becoming a favorable\ncatalyst for the era of Digital Twins.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"WQ1UzNPOOMGrOZXnjqluWqd8pf-uYhhP5rSszBx-cLk","pdfSize":"1013185"}
