{"id":"2408.16269","title":"Individual or collective treatments: how to target antimicrobial use to\n  limit the spread of respiratory pathogens among beef cattle?","authors":"Baptiste Sorin-Dupont, Antoine Poyard, Sebastien Assie, Sebastien\n  Picault and Pauline Ezanno","authorsParsed":[["Sorin-Dupont","Baptiste",""],["Poyard","Antoine",""],["Assie","Sebastien",""],["Picault","Sebastien",""],["Ezanno","Pauline",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 05:13:59 GMT"}],"updateDate":"2024-08-30","timestamp":1724908439000,"abstract":"  The overuse of antibiotics has become a major global concern due to its role\nin diminishing treatment effectiveness and positively selecting\nantibiotic-resistant bacterial strains. This issue is particularly important in\nthe beef cattle sector, where Bovine Respiratory Diseases (BRD) impose\nsignificant economic and welfare burdens. BRD are complex, multifactorial\nconditions primarily affecting young calves and feedlot cattle, caused by a\ncombination of viral and bacterial pathogens, environmental factors, and\nstressors. Despite efforts to reduce antimicrobial use (AMU), the cattle\nproduction system remains heavily reliant on antibiotics to control BRD, often\nthrough the implementation of collective treatments to prevent outbreaks. This\nstudy aimed at evaluating the impact of various treatment practices on the\nspread of BRD, specifically focusing on criteria for implementing collective\ntreatments. Using a mechanistic stochastic model, we simulated the spread of\n\\textit{Mannheimia haemolytica} in a multi-pen fattening operation under\nsixteen different scenarios, considering pen composition, individual risk\nlevels, and treatment strategies. Our findings suggest that an alternative\ncriterion for collective treatments based on the speed of the disease spread,\ncould reduce BRD incidence and AMU more effectively than conventional methods.\nThis research highlights the importance of responsible treatment practices and\nthe potential benefits of novel criteria for collective treatment strategies in\nimproving animal health. Moreover, it emphasizes the need for transparency on\nthe exposure to risk factors along the production chain.\n","subjects":["Quantitative Biology/Populations and Evolution"],"license":"http://creativecommons.org/licenses/by/4.0/"}