{"id":"2408.01087","title":"+SSLIP: Automated Radon-assisted and Rotation-corrected identification\n  of complex HCP slip system activity fields from DIC data","authors":"T. Vermeij, G. Slokker, C.J.A. Mornout, D. K\\\"onig, J.P.M. Hoefnagels","authorsParsed":[["Vermeij","T.",""],["Slokker","G.",""],["Mornout","C. J. A.",""],["König","D.",""],["Hoefnagels","J. P. M.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 08:07:01 GMT"}],"updateDate":"2024-08-05","timestamp":1722586021000,"abstract":"  Identification of crystallographic slip in metals and alloys is crucial to\nunderstand and improve their mechanical behavior. Recently, a novel slip system\nidentification framework, termed SSLIP (for Slip System-based Local\nIdentification of Plasticity), was introduced to leap from conventional\ntrace-based identification to automated, point-by-point identification that\nexploits the full deformation kinematics. Using microstructure-correlated\ndeformation data, SSLIP matches the measured in-plane displacement gradient\ntensor to the kinematics of the optimal combination of multiple slip system\nactivities, at each DIC datapoint. SSLIP was applied and demonstrated to be\nsuccessful on virtual and experimental case studies of FCC and BCC metals.\nHowever, for more advanced and anisotropic HCP crystal structures the complete\nidentification of all slip systems was found to be more challenging, posing\nlimitations on automation and flexibility. Here, we propose a significant\nextension to the SSLIP framework with the aim of automated slip system\nidentification of HCP. The main extensions of the SSLIP method, hereinafter\nreferred to as the +SSLIP method, include (i) a pre-selection of slip systems\nusing a Radon transform, (ii) robustness to measured rigid body rotation by\nsimultaneous identification of the local elastic rotation field, (iii)\nidentification of the two best matching slip systems for each data point, and\n(iv) a procedure to deal with slip systems with in-plane displacement gradient\ntensors that cannot be discriminated, yielding the full slip system activity\nmaps with all slip systems for each grain. The resulting objective\nidentification method does not rely on, e.g., the Schmid factor to select which\nslip system is active at each point. We show how slip systems from multiple\nslip families are successfully identified on virtual and real experiments on a\nZn polycrystalline coating.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}