{"id":"2408.06379","title":"The probabilistic world II : Quantum mechanics from classical statistics","authors":"C. Wetterich","authorsParsed":[["Wetterich","C.",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 14:02:55 GMT"}],"updateDate":"2024-08-14","timestamp":1723212175000,"abstract":"  This work discusses simple examples how quantum systems are obtained as\nsubsystems of classical statistical systems. For a single qubit with arbitrary\nHamiltonian and for the quantum particle in a harmonic potential we provide\nexplicitly all steps how these quantum systems follow from an overall\n''classical\" probability distribution for events at all times. This overall\nprobability distribution is the analogue of Feynman's functional integral for\nquantum mechanics or for the functional integral defining a quantum field\ntheory. In our case the action and associated weight factor are real, however,\ndefining a classical probabilistic system. Nevertheless, a unitary\ntime-evolution of wave functions can be realized for suitable systems, in\nparticular probabilistic automata. Based on these insights we discuss novel\naspects for correlated computing not requiring the extreme isolation of quantum\ncomputers. A simple neuromorphic computer based on neurons in an active or\nquiet state within a probabilistic environment can learn the unitary\ntransformations of an entangled two-qubit system. Our explicit constructions\nconstitute a proof that no-go theorems for the embedding of quantum mechanics\nin classical statistics are circumvented. We show in detail how subsystems of\nclassical statistical systems can explain various ``quantum mysteries\".\nConceptually our approach is a straightforward derivation starting from an\noverall probability distribution without invoking non-locality, acausality,\ncontextuality, many worlds or other additional concepts. All quantum laws\nfollow directly from the standard properties of classical probabilities.\n","subjects":["Physics/Quantum Physics","Physics/High Energy Physics - Lattice","Physics/High Energy Physics - Theory","Nonlinear Sciences/Cellular Automata and Lattice Gases"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}