{"id":"2408.09432","title":"Deformation-aware GAN for Medical Image Synthesis with Substantially\n  Misaligned Pairs","authors":"Bowen Xin, Tony Young, Claire E Wainwright, Tamara Blake, Leo Lebrat,\n  Thomas Gaass, Thomas Benkert, Alto Stemmer, David Coman, Jason Dowling","authorsParsed":[["Xin","Bowen",""],["Young","Tony",""],["Wainwright","Claire E",""],["Blake","Tamara",""],["Lebrat","Leo",""],["Gaass","Thomas",""],["Benkert","Thomas",""],["Stemmer","Alto",""],["Coman","David",""],["Dowling","Jason",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 10:29:35 GMT"}],"updateDate":"2024-08-20","timestamp":1723976975000,"abstract":"  Medical image synthesis generates additional imaging modalities that are\ncostly, invasive or harmful to acquire, which helps to facilitate the clinical\nworkflow. When training pairs are substantially misaligned (e.g., lung MRI-CT\npairs with respiratory motion), accurate image synthesis remains a critical\nchallenge. Recent works explored the directional registration module to adjust\nmisalignment in generative adversarial networks (GANs); however, substantial\nmisalignment will lead to 1) suboptimal data mapping caused by correspondence\nambiguity, and 2) degraded image fidelity caused by morphology influence on\ndiscriminators. To address the challenges, we propose a novel Deformation-aware\nGAN (DA-GAN) to dynamically correct the misalignment during the image synthesis\nbased on multi-objective inverse consistency. Specifically, in the generative\nprocess, three levels of inverse consistency cohesively optimise symmetric\nregistration and image generation for improved correspondence. In the\nadversarial process, to further improve image fidelity under misalignment, we\ndesign deformation-aware discriminators to disentangle the mismatched spatial\nmorphology from the judgement of image fidelity. Experimental results show that\nDA-GAN achieved superior performance on a public dataset with simulated\nmisalignments and a real-world lung MRI-CT dataset with respiratory motion\nmisalignment. The results indicate the potential for a wide range of medical\nimage synthesis tasks such as radiotherapy planning.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Rtq7R-Ua7VdqIPL3hqXXZRloHSzUzKS7YDPYgEWfLXc","pdfSize":"6238278"}
