{"id":"2408.07450","title":"Dynamic Pickup-and-Delivery for Collaborative Platforms with\n  Time-Dependent Travel and Crowdshipping","authors":"Sara Stoia and Demetrio Lagan\\`a and Jeffrey W. Ohlmann","authorsParsed":[["Stoia","Sara",""],["Laganà","Demetrio",""],["Ohlmann","Jeffrey W.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 10:40:56 GMT"}],"updateDate":"2024-08-15","timestamp":1723632056000,"abstract":"  We study a pickup-and-delivery problem that arises when customers randomly\nsubmit requests over the course of a day from a choice of vendors on a\ncollaborative e-commerce portal. Based on the attributes of a customer request,\na dispatcher dynamically schedules the delivery service on either a dedicated\nvehicle or a crowdshipper, both of whom experience time dependent travel times.\nWhile dedicated vehicles are available throughout the day, the availability of\ncrowdshippers is unknown a priori and they appear randomly for only portions of\nthe day. With an objective of minimizing the sum of routing costs, piece-rate\ncrowdshipper payments, and lateness charges, we model the uncertainty in\nrequest arrivals and crowdshipper appearances as a Markov decision process. To\ndetermine an action at each decision epoch, we employ a heuristic that\npartially destroys the existing routes and repairs them guided by a\nparameterized cost function approximation that accounts for the remaining\ntemporal capacity of delivery vehicles. Through a set of computational\nexperiments, we demonstrate the improvement of our approach over a myopic\napproach in several key performance metrics. In addition, we conduct\ncomputational experiments demonstrate the impact of inserting wait time in the\nroute scheduling and the benefit of explicitly modeling time-dependent travel\ntimes. Through our computational testing, we also investigate the effect of\ndemand management mechanisms that facilitate many-to-one request bundles or\none-to-many request bundles on reducing the cost to service requests.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}