{"id":"2408.02343","title":"Unified Principal Components Analysis of Irregularly Observed Functional\n  Time Series","authors":"Zerui Guo, Jianbin Tan, Hui Huang","authorsParsed":[["Guo","Zerui",""],["Tan","Jianbin",""],["Huang","Hui",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 09:40:02 GMT"}],"updateDate":"2024-08-06","timestamp":1722850802000,"abstract":"  Irregularly observed functional time series (FTS) are increasingly available\nin many real-world applications. To analyze FTS, it is crucial to account for\nboth serial dependencies and the irregularly observed nature of functional\ndata. However, existing methods for FTS often rely on specific model\nassumptions in capturing serial dependencies, or cannot handle the irregular\nobservational scheme of functional data. To solve these issues, one can perform\ndimension reduction on FTS via functional principal component analysis (FPCA)\nor dynamic FPCA. Nonetheless, these methods may either be not theoretically\noptimal or too redundant to represent serially dependent functional data. In\nthis article, we introduce a novel dimension reduction method for FTS based on\ndynamic FPCA. Through a new concept called optimal functional filters, we unify\nthe theories of FPCA and dynamic FPCA, providing a parsimonious and optimal\nrepresentation for FTS adapting to its serial dependence structure. This\nframework is referred to as principal analysis via dependency-adaptivity\n(PADA). Under a hierarchical Bayesian model, we establish an estimation\nprocedure for dimension reduction via PADA. Our method can be used for both\nsparsely and densely observed FTS, and is capable of predicting future\nfunctional data. We investigate the theoretical properties of PADA and\ndemonstrate its effectiveness through extensive simulation studies. Finally, we\nillustrate our method via dimension reduction and prediction of daily PM2.5\ndata.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}