{"id":"2408.12348","title":"On the Origin of Quenched but Gas-rich Regions at Kiloparsec Scales in\n  Nearby Galaxies","authors":"Tao Jing, Cheng Li","authorsParsed":[["Jing","Tao",""],["Li","Cheng",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 12:45:19 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 15:31:30 GMT"}],"updateDate":"2024-08-26","timestamp":1724330719000,"abstract":"  We use resolved spectroscopy from MaNGA to investigate the significance of\nboth local and global properties of galaxies to the cessation of star formation\nat kpc scales. Quenched regions are identified from a sample of isolated disk\ngalaxies by a single-parameter criterion $\\rm {D}_n(4000)$ - $\\log$ $\\rm\n{EW}({H\\alpha})$$~>1.6-\\log 2=1.3$, and are divided into gas-rich quenched\nregions (GRQRs) and gas-poor quenched regions (GPQRs) according to the surface\ndensity of cold gas ($\\rm \\Sigma_{gas}$). Both types of quenched regions tend\nto be hosted by non-AGN galaxies with relatively high mass ($M_\\ast$$\\gtrsim\n10^{10}M_\\odot$) and red colors (${\\rm NUV}-r \\gtrsim 3$), as well as low star\nformation rate and high central density at fixed mass. They span wide ranges in\nother properties including structural parameters that are similar to the parent\nsample, indicating that the conditions responsible for quenching in gas-rich\nregions are largely independent on the global properties of galaxies. We train\nrandom forest (RF) classifiers and regressors for predicting quenching in our\nsample with 15 local/global properties. $\\Sigma_\\ast$ is the most important\nproperty for quenching, especially for GRQRs. These results strongly indicate\nthe important roles of low-mass hot evolved stars which are numerous and\nlong-lived in quenched regions and can provide substantial radiation pressure\nto support the surrounding gas against gravitational collapse. The different\nfeature importance for quenching as found previously by Bluck et al. (2020a,b)\nare partly due to the different definitions of quenched regions, particularly\nthe different requirements on $\\rm {EW}({H\\alpha})$.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}