{"id":"2408.02210","title":"ExoViP: Step-by-step Verification and Exploration with Exoskeleton\n  Modules for Compositional Visual Reasoning","authors":"Yuxuan Wang, Alan Yuille, Zhuowan Li, Zilong Zheng","authorsParsed":[["Wang","Yuxuan",""],["Yuille","Alan",""],["Li","Zhuowan",""],["Zheng","Zilong",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 03:22:10 GMT"}],"updateDate":"2024-08-06","timestamp":1722828130000,"abstract":"  Compositional visual reasoning methods, which translate a complex query into\na structured composition of feasible visual tasks, have exhibited a strong\npotential in complicated multi-modal tasks. Empowered by recent advances in\nlarge language models (LLMs), this multi-modal challenge has been brought to a\nnew stage by treating LLMs as few-shot/zero-shot planners, i.e.,\nvision-language (VL) programming. Such methods, despite their numerous merits,\nsuffer from challenges due to LLM planning mistakes or inaccuracy of visual\nexecution modules, lagging behind the non-compositional models. In this work,\nwe devise a \"plug-and-play\" method, ExoViP, to correct errors in both the\nplanning and execution stages through introspective verification. We employ\nverification modules as \"exoskeletons\" to enhance current VL programming\nschemes. Specifically, our proposed verification module utilizes a mixture of\nthree sub-verifiers to validate predictions after each reasoning step,\nsubsequently calibrating the visual module predictions and refining the\nreasoning trace planned by LLMs. Experimental results on two representative VL\nprogramming methods showcase consistent improvements on five compositional\nreasoning tasks on standard benchmarks. In light of this, we believe that\nExoViP can foster better performance and generalization on open-domain\nmulti-modal challenges.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"3kAKzP3BKVbZtOikDsRosFaho_8j_gKz1QDlmSzdZXg","pdfSize":"4218449","txDigest":"BpDMGw2EfgiiviDRRPUiSVgmugbUjYo5tep1be4gn4Zt","endEpoch":"1","status":"CERTIFIED"}
