{"id":"2408.17419","title":"Back from the dead: AT2019aalc as a candidate repeating TDE in an AGN","authors":"Patrik Mil\\'an Veres, Anna Franckowiak, Sjoert van Velzen, Bjoern\n  Adebahr, Sam Taziaux, Jannis Necker, Robert Stein, Alexander Kier, Ancla\n  Mueller, Dominik J. Bomans, Nuria Jordana-Mitjans, Marek Kowalski, Erica\n  Hammerstein, Elena Marci-Boehncke, Simeon Reusch, Simone Garrappa, Sam Rose,\n  Kaustav Kashyap Das","authorsParsed":[["Veres","Patrik Milán",""],["Franckowiak","Anna",""],["van Velzen","Sjoert",""],["Adebahr","Bjoern",""],["Taziaux","Sam",""],["Necker","Jannis",""],["Stein","Robert",""],["Kier","Alexander",""],["Mueller","Ancla",""],["Bomans","Dominik J.",""],["Jordana-Mitjans","Nuria",""],["Kowalski","Marek",""],["Hammerstein","Erica",""],["Marci-Boehncke","Elena",""],["Reusch","Simeon",""],["Garrappa","Simone",""],["Rose","Sam",""],["Das","Kaustav Kashyap",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 17:07:47 GMT"}],"updateDate":"2024-09-02","timestamp":1725037667000,"abstract":"  Context. To date, three nuclear transients have been associated with\nhigh-energy neutrino events. These transients are generally thought to be\npowered by tidal disruptions of stars (TDEs) by massive black holes. However,\nAT2019aalc, hosted in a Seyfert-1 galaxy, was not yet classified due to a lack\nof multiwavelength observations. Interestingly, the source has re-brightened 4\nyears after its discovery. Aims. We aim to classify the transient and explain\nthe mechanism responsible for its second optical flare. Methods. We conducted a\nmulti-wavelength monitoring program (from radio to X-rays) of AT2019aalc during\nits re-brightening in 2023. Results. The observations revealed a uniquely\nbright UV counterpart and multiple X-ray flares during the second optical\nflaring episode of the transient. The second flare, similarly to the first one,\nis also accompanied by IR dust echo emission. A long-term radio flare is found\nwith an inverted spectrum. Optical spectroscopic observations reveal the\npresence of Bowen Fluorescence lines and strong high-ionization coronal lines\nindicating an extreme level of ionization in the system. Conclusions. The\nresults suggest that the transient can be classified as a Bowen Fluorescence\nFlare (BFF), a relatively new sub-class of flaring active galactic nuclei\n(AGN). AT2019aalc can be also classified as an extreme coronal line emitter\n(ECLE). We found that, in addition to AT2019aalc, another BFF AT2021loi is\nspatially coincident with a high-energy neutrino event. The multi-wavelength\nproperties of these transients suggest a possible connection between ECLEs,\nBFFs and TDEs in AGN.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}