{"id":"2408.03677","title":"L4DR: LiDAR-4DRadar Fusion for Weather-Robust 3D Object Detection","authors":"Xun Huang, Ziyu Xu, Hai Wu, Jinlong Wang, Qiming Xia, Yan Xia,\n  Jonathan Li, Kyle Gao, Chenglu Wen, Cheng Wang","authorsParsed":[["Huang","Xun",""],["Xu","Ziyu",""],["Wu","Hai",""],["Wang","Jinlong",""],["Xia","Qiming",""],["Xia","Yan",""],["Li","Jonathan",""],["Gao","Kyle",""],["Wen","Chenglu",""],["Wang","Cheng",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 10:36:26 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 18:59:36 GMT"},{"version":"v3","created":"Fri, 30 Aug 2024 13:55:50 GMT"}],"updateDate":"2024-09-02","timestamp":1723026986000,"abstract":"  LiDAR-based vision systems are integral for 3D object detection, which is\ncrucial for autonomous navigation. However, they suffer from performance\ndegradation in adverse weather conditions due to the quality deterioration of\nLiDAR point clouds. Fusing LiDAR with the weather-robust 4D radar sensor is\nexpected to solve this problem. However, the fusion of LiDAR and 4D radar is\nchallenging because they differ significantly in terms of data quality and the\ndegree of degradation in adverse weather. To address these issues, we introduce\nL4DR, a weather-robust 3D object detection method that effectively achieves\nLiDAR and 4D Radar fusion. Our L4DR includes Multi-Modal Encoding (MME) and\nForeground-Aware Denoising (FAD) technique to reconcile sensor gaps, which is\nthe first exploration of the complementarity of early fusion between LiDAR and\n4D radar. Additionally, we design an Inter-Modal and Intra-Modal ({IM}2 )\nparallel feature extraction backbone coupled with a Multi-Scale Gated Fusion\n(MSGF) module to counteract the varying degrees of sensor degradation under\nadverse weather conditions. Experimental evaluation on a VoD dataset with\nsimulated fog proves that L4DR is more adaptable to changing weather\nconditions. It delivers a significant performance increase under different fog\nlevels, improving the 3D mAP by up to 20.0% over the traditional LiDAR-only\napproach. Moreover, the results on the K-Radar dataset validate the consistent\nperformance improvement of L4DR in real-world adverse weather conditions.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}