{"id":"2408.03353","title":"Adversarial Domain Adaptation for Cross-user Activity Recognition Using\n  Diffusion-based Noise-centred Learning","authors":"Xiaozhou Ye, Kevin I-Kai Wang","authorsParsed":[["Ye","Xiaozhou",""],["Wang","Kevin I-Kai",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 08:55:49 GMT"},{"version":"v2","created":"Sat, 31 Aug 2024 23:33:10 GMT"}],"updateDate":"2024-09-04","timestamp":1722934549000,"abstract":"  Human Activity Recognition (HAR) plays a crucial role in various applications\nsuch as human-computer interaction and healthcare monitoring. However,\nchallenges persist in HAR models due to the data distribution differences\nbetween training and real-world data distributions, particularly evident in\ncross-user scenarios. This paper introduces a novel framework, termed\nDiffusion-based Noise-centered Adversarial Learning Domain Adaptation\n(Diff-Noise-Adv-DA), designed to address these challenges by leveraging\ngenerative diffusion modeling and adversarial learning techniques. Traditional\nHAR models often struggle with the diversity of user behaviors and sensor data\ndistributions. Diff-Noise-Adv-DA innovatively integrates the inherent noise\nwithin diffusion models, harnessing its latent information to enhance domain\nadaptation. Specifically, the framework transforms noise into a critical\ncarrier of activity and domain class information, facilitating robust\nclassification across different user domains. Experimental evaluations\ndemonstrate the effectiveness of Diff-Noise-Adv-DA in improving HAR model\nperformance across different users, surpassing traditional domain adaptation\nmethods. The framework not only mitigates distribution mismatches but also\nenhances data quality through noise-based denoising techniques.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"yVGmxTbsveXGGZn-xfjJkKzsdr3nmfQD8gKpwEee_kM","pdfSize":"2940074"}
