{"id":"2408.10556","title":"Hokoff: Real Game Dataset from Honor of Kings and its Offline\n  Reinforcement Learning Benchmarks","authors":"Yun Qu, Boyuan Wang, Jianzhun Shao, Yuhang Jiang, Chen Chen, Zhenbin\n  Ye, Lin Liu, Junfeng Yang, Lin Lai, Hongyang Qin, Minwen Deng, Juchao Zhuo,\n  Deheng Ye, Qiang Fu, Wei Yang, Guang Yang, Lanxiao Huang, Xiangyang Ji","authorsParsed":[["Qu","Yun",""],["Wang","Boyuan",""],["Shao","Jianzhun",""],["Jiang","Yuhang",""],["Chen","Chen",""],["Ye","Zhenbin",""],["Liu","Lin",""],["Yang","Junfeng",""],["Lai","Lin",""],["Qin","Hongyang",""],["Deng","Minwen",""],["Zhuo","Juchao",""],["Ye","Deheng",""],["Fu","Qiang",""],["Yang","Wei",""],["Yang","Guang",""],["Huang","Lanxiao",""],["Ji","Xiangyang",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 05:38:50 GMT"}],"updateDate":"2024-08-21","timestamp":1724132330000,"abstract":"  The advancement of Offline Reinforcement Learning (RL) and Offline\nMulti-Agent Reinforcement Learning (MARL) critically depends on the\navailability of high-quality, pre-collected offline datasets that represent\nreal-world complexities and practical applications. However, existing datasets\noften fall short in their simplicity and lack of realism. To address this gap,\nwe propose Hokoff, a comprehensive set of pre-collected datasets that covers\nboth offline RL and offline MARL, accompanied by a robust framework, to\nfacilitate further research. This data is derived from Honor of Kings, a\nrecognized Multiplayer Online Battle Arena (MOBA) game known for its intricate\nnature, closely resembling real-life situations. Utilizing this framework, we\nbenchmark a variety of offline RL and offline MARL algorithms. We also\nintroduce a novel baseline algorithm tailored for the inherent hierarchical\naction space of the game. We reveal the incompetency of current offline RL\napproaches in handling task complexity, generalization and multi-task learning.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}