{"id":"2408.02022","title":"Scenario-based Thermal Management Parametrization Through Deep\n  Reinforcement Learning","authors":"Thomas Rudolf, Philip Muhl, S\\\"oren Hohmann, Lutz Eckstein","authorsParsed":[["Rudolf","Thomas",""],["Muhl","Philip",""],["Hohmann","Sören",""],["Eckstein","Lutz",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 13:19:45 GMT"}],"updateDate":"2024-08-06","timestamp":1722777585000,"abstract":"  The thermal system of battery electric vehicles demands advanced control. Its\nthermal management needs to effectively control active components across\nvarying operating conditions. While robust control function parametrization is\nrequired, current methodologies show significant drawbacks. They consume\nconsiderable time, human effort, and extensive real-world testing.\nConsequently, there is a need for innovative and intelligent solutions that are\ncapable of autonomously parametrizing embedded controllers. Addressing this\nissue, our paper introduces a learning-based tuning approach. We propose a\nmethodology that benefits from automated scenario generation for increased\nrobustness across vehicle usage scenarios. Our deep reinforcement learning\nagent processes the tuning task context and incorporates an image-based\ninterpretation of embedded parameter sets. We demonstrate its applicability to\na valve controller parametrization task and verify it in real-world vehicle\ntesting. The results highlight the competitive performance to baseline methods.\nThis novel approach contributes to the shift towards virtual development of\nthermal management functions, with promising potential of large-scale parameter\ntuning in the automotive industry.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}