{"id":"2408.03161","title":"An Artificial Neural Network based approach for Harmonic Component\n  Prediction in a Distribution Line","authors":"Dixant Bikal Sapkota, Puskar Neupane, Kajal Pokharel, Shahabuddin Khan","authorsParsed":[["Sapkota","Dixant Bikal",""],["Neupane","Puskar",""],["Pokharel","Kajal",""],["Khan","Shahabuddin",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 17:20:30 GMT"}],"updateDate":"2024-08-07","timestamp":1722878430000,"abstract":"  With a growth in the use of nonlinear devices, in both generation and\nconsumption, it is imminent that we require accurate and quick control for\nactive filters to suppress harmonics. Time delays between input and output is\ncatastrophic for such filters, which rely on real-time operation. Artificial\nNeural Networks (ANNs) are capable of properly modelling complex nonlinear\nsystems through adjustments in their learned parameters. Once these networks\nare properly trained, they can produce highly accurate predictions at an\ninstantaneous time frame. Leveraging these qualities, various complex control\nsystems may be replaced by neural networks to provide quick and precise\nresponses. This paper proposes an ANN based approach for the prediction of\nindividual harmonic components. By extracting and analyzing the magnitudes of\nharmonic components obtained from the survey of a particular area through\nreal-time measurements, a sequential pattern in their occurrence is observed.\nVarious neural network architectures are trained using the collected data and\ntheir performance are evaluated. The best performing model, whose loss is\nminimum, is then used to observe the harmonic cancellation for a particular\ncase through a simplified simulation in hardware-in-the-loop. These neural\nnetwork structures, that produce instantaneous and accurate outputs, provide a\nbetter response time. On top of that, it can limit the required input\nmeasurements/parameters to basic ones like time, currents and a few other\npertaining to a particular locality, such as maximum demand and number of\nhouseholds.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"am0eJ0yTptbATzEFXlHUCBoujdsqNoVyDRtgC44HFWw","pdfSize":"9000070"}
