{"id":"2408.02214","title":"More Than Positive and Negative: Communicating Fine Granularity in\n  Medical Diagnosis","authors":"Xiangyu Peng, Kai Wang, Jianfei Yang, Yingying Zhu, Yang You","authorsParsed":[["Peng","Xiangyu",""],["Wang","Kai",""],["Yang","Jianfei",""],["Zhu","Yingying",""],["You","Yang",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 03:33:00 GMT"}],"updateDate":"2024-08-06","timestamp":1722828780000,"abstract":"  With the advance of deep learning, much progress has been made in building\npowerful artificial intelligence (AI) systems for automatic Chest X-ray (CXR)\nanalysis. Most existing AI models are trained to be a binary classifier with\nthe aim of distinguishing positive and negative cases. However, a large gap\nexists between the simple binary setting and complicated real-world medical\nscenarios. In this work, we reinvestigate the problem of automatic radiology\ndiagnosis. We first observe that there is considerable diversity among cases\nwithin the positive class, which means simply classifying them as positive\nloses many important details. This motivates us to build AI models that can\ncommunicate fine-grained knowledge from medical images like human experts. To\nthis end, we first propose a new benchmark on fine granularity learning from\nmedical images. Specifically, we devise a division rule based on medical\nknowledge to divide positive cases into two subcategories, namely atypical\npositive and typical positive. Then, we propose a new metric termed\nAUC$^\\text{FG}$ on the two subcategories for evaluation of the ability to\nseparate them apart. With the proposed benchmark, we encourage the community to\ndevelop AI diagnosis systems that could better learn fine granularity from\nmedical images. Last, we propose a simple risk modulation approach to this\nproblem by only using coarse labels in training. Empirical results show that\ndespite its simplicity, the proposed method achieves superior performance and\nthus serves as a strong baseline.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ixxYaqFOJdPx4L-hEwevCbfhmFQN6UJIctRSFJpLTG4","pdfSize":"653632"}
