{"id":"2408.14000","title":"Quantitative Representation of Scenario Difficulty for Autonomous\n  Driving Based on Adversarial Policy Search","authors":"Shuo Yang, Caojun Wang, Yuanjian Zhang, Yuming Yin, Yanjun Huang,\n  Shengbo Eben Li, and Hong Chen","authorsParsed":[["Yang","Shuo",""],["Wang","Caojun",""],["Zhang","Yuanjian",""],["Yin","Yuming",""],["Huang","Yanjun",""],["Li","Shengbo Eben",""],["Chen","Hong",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 03:57:14 GMT"}],"updateDate":"2024-08-27","timestamp":1724644634000,"abstract":"  Adversarial scenario generation is crucial for autonomous driving testing\nbecause it can efficiently simulate various challenge and complex traffic\nconditions. However, it is difficult to control current existing methods to\ngenerate desired scenarios, such as the ones with different conflict levels.\nTherefore, this paper proposes a data-driven quantitative method to represent\nscenario difficulty. Compared with rule-based discrete scenario difficulty\nrepresentation method, the proposed algorithm can achieve continuous difficulty\nrepresentation. Specifically, the environment agent is introduced, and a\nreinforcement learning method combined with mechanism knowledge is constructed\nfor policy search to obtain an agent with adversarial behavior. The model\nparameters of the environment agent at different stages in the training process\nare extracted to construct a policy group, and then the agents with different\nadversarial intensity are obtained, which are used to realize data generation\nin different difficulty scenarios through the simulation environment. Finally,\na data-driven scenario difficulty quantitative representation model is\nconstructed, which is used to output the environment agent policy under\ndifferent difficulties. The result analysis shows that the proposed algorithm\ncan generate reasonable and interpretable scenarios with high discrimination,\nand can provide quantifiable difficulty representation without any expert logic\nrule design. The video link is https://www.youtube.com/watch?v=GceGdqAm9Ys.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}