{"id":"2408.05985","title":"Diffuse-UDA: Addressing Unsupervised Domain Adaptation in Medical Image\n  Segmentation with Appearance and Structure Aligned Diffusion Models","authors":"Haifan Gong, Yitao Wang, Yihan Wang, Jiashun Xiao, Xiang Wan, Haofeng\n  Li","authorsParsed":[["Gong","Haifan",""],["Wang","Yitao",""],["Wang","Yihan",""],["Xiao","Jiashun",""],["Wan","Xiang",""],["Li","Haofeng",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 08:21:04 GMT"}],"updateDate":"2024-08-13","timestamp":1723450864000,"abstract":"  The scarcity and complexity of voxel-level annotations in 3D medical imaging\npresent significant challenges, particularly due to the domain gap between\nlabeled datasets from well-resourced centers and unlabeled datasets from\nless-resourced centers. This disparity affects the fairness of artificial\nintelligence algorithms in healthcare. We introduce Diffuse-UDA, a novel method\nleveraging diffusion models to tackle Unsupervised Domain Adaptation (UDA) in\nmedical image segmentation. Diffuse-UDA generates high-quality image-mask pairs\nwith target domain characteristics and various structures, thereby enhancing\nUDA tasks. Initially, pseudo labels for target domain samples are generated.\nSubsequently, a specially tailored diffusion model, incorporating deformable\naugmentations, is trained on image-label or image-pseudo-label pairs from both\ndomains. Finally, source domain labels guide the diffusion model to generate\nimage-label pairs for the target domain. Comprehensive evaluations on several\nbenchmarks demonstrate that Diffuse-UDA outperforms leading UDA and\nsemi-supervised strategies, achieving performance close to or even surpassing\nthe theoretical upper bound of models trained directly on target domain data.\nDiffuse-UDA offers a pathway to advance the development and deployment of AI\nsystems in medical imaging, addressing disparities between healthcare\nenvironments. This approach enables the exploration of innovative AI-driven\ndiagnostic tools, improves outcomes, saves time, and reduces human error.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}