{"id":"2408.14458","title":"Partitioning statistics of a correlated few-electron droplet","authors":"Jashwanth Shaju, Elina Pavlovska, Ralfs Suba, Junliang Wang, Seddik\n  Ouacel, Thomas Vasselon, Matteo Aluffi, Lucas Mazzella, Clement Geffroy, Arne\n  Ludwig, Andreas D. Wieck, Matias Urdampiletta, Christopher B\\\"auerle,\n  Vyacheslavs Kashcheyevs, Hermann Sellier","authorsParsed":[["Shaju","Jashwanth",""],["Pavlovska","Elina",""],["Suba","Ralfs",""],["Wang","Junliang",""],["Ouacel","Seddik",""],["Vasselon","Thomas",""],["Aluffi","Matteo",""],["Mazzella","Lucas",""],["Geffroy","Clement",""],["Ludwig","Arne",""],["Wieck","Andreas D.",""],["Urdampiletta","Matias",""],["Bäuerle","Christopher",""],["Kashcheyevs","Vyacheslavs",""],["Sellier","Hermann",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 17:49:34 GMT"}],"updateDate":"2024-08-27","timestamp":1724694574000,"abstract":"  Emergence of universal collective behaviour from interactions in a\nsufficiently large group of elementary constituents is a fundamental scientific\nparadigm. In physics, correlations in fluctuating microscopic observables can\nprovide key information about collective states of matter such as deconfined\nquark-gluon plasma in heavy-ion collisions or expanding quantum degenerate\ngases. Two-particle correlations in mesoscopic colliders have provided\nsmoking-gun evidence on the nature of exotic electronic excitations such as\nfractional charges, levitons and anyon statistics. Yet the gap between\ntwo-particle collisions and the emergence of collectivity as the number of\ninteracting particles grows is hard to address at the microscopic level. Here,\nwe demonstrate all-body correlations in the partitioning of up to $N = 5$\nelectron droplets driven by a moving potential well through a Y-junction in a\nsemiconductor. We show that the measured multivariate cumulants (of order $k =\n2$ to $N$) of the electron droplet are accurately described by $k$-spin\ncorrelation functions of an effective Ising model below the N\\'eel temperature\nand can be interpreted as a Coulomb liquid in the thermodynamic limit. Finite\nsize scaling of high-order correlation functions provides otherwise\ninaccessible fingerprints of emerging order. Our demonstration of emergence in\na simple correlated electron collider opens a new way to study engineered\nstates of matter.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons","Physics/High Energy Physics - Experiment","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"260HbET8Vd92RtWYVX7JQ9axXeAl6-dZFb6vdFFQjdQ","pdfSize":"6651328"}
