{"id":"2408.15899","title":"Gen-Swarms: Adapting Deep Generative Models to Swarms of Drones","authors":"Carlos Plou, Pablo Pueyo, Ruben Martinez-Cantin, Mac Schwager, Ana C.\n  Murillo, and Eduardo Montijano","authorsParsed":[["Plou","Carlos",""],["Pueyo","Pablo",""],["Martinez-Cantin","Ruben",""],["Schwager","Mac",""],["Murillo","Ana C.",""],["Montijano","Eduardo",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 16:12:28 GMT"}],"updateDate":"2024-08-29","timestamp":1724861548000,"abstract":"  Gen-Swarms is an innovative method that leverages and combines the\ncapabilities of deep generative models with reactive navigation algorithms to\nautomate the creation of drone shows. Advancements in deep generative models,\nparticularly diffusion models, have demonstrated remarkable effectiveness in\ngenerating high-quality 2D images. Building on this success, various works have\nextended diffusion models to 3D point cloud generation. In contrast,\nalternative generative models such as flow matching have been proposed,\noffering a simple and intuitive transition from noise to meaningful outputs.\nHowever, the application of flow matching models to 3D point cloud generation\nremains largely unexplored. Gen-Swarms adapts these models to automatically\ngenerate drone shows. Existing 3D point cloud generative models create point\ntrajectories which are impractical for drone swarms. In contrast, our method\nnot only generates accurate 3D shapes but also guides the swarm motion,\nproducing smooth trajectories and accounting for potential collisions through a\nreactive navigation algorithm incorporated into the sampling process. For\nexample, when given a text category like Airplane, Gen-Swarms can rapidly and\ncontinuously generate numerous variations of 3D airplane shapes. Our\nexperiments demonstrate that this approach is particularly well-suited for\ndrone shows, providing feasible trajectories, creating representative final\nshapes, and significantly enhancing the overall performance of drone show\ngeneration.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BjXqJRcN3BNep0IRnj4yWan65f3x46w9UzD1Cc9Rw10","pdfSize":"19241930"}
