{"id":"2408.03041","title":"Helium Abundance of the Sun: A Spectroscopic Analysis","authors":"Satyajeet Moharana (1), B. P. Hema (1), Gajendra Pandey (1) ((1)\n  Indian Institute of Astrophysics)","authorsParsed":[["Moharana","Satyajeet",""],["Hema","B. P.",""],["Pandey","Gajendra",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 08:55:06 GMT"}],"updateDate":"2024-08-07","timestamp":1722934506000,"abstract":"  Determining the He/H ratio in cool stars presents a fundamental astrophysical\nchallenge. While this ratio is established for hot O and B stars, its\nextrapolation to cool stars remains uncertain due to the absence of helium\nlines in their observed spectra. We address this knowledge gap by focusing on\nthe Sun as a representative cool star. We conduct spectroscopic analyses of the\nobserved solar photospheric lines by utilizing a combination of MgH molecular\nlines and neutral Mg atomic lines including yet another combination of CH and\nC_2 molecular lines with neutral C atomic lines. Our spectroscopic analyses\nwere further exploited by adopting solar model atmospheres constructed for\ndistinct He/H ratios to determine the solar photospheric helium abundance. The\nhelium abundance is determined by enforcing the fact that for an adopted model\natmosphere with an appropriate He/H ratio, the derived Mg abundance from the\nneutral Mg atomic lines and that from the MgH molecular lines must be the same.\nDitto holds for the C abundance derived from neutral C atomic lines and that\nfrom CH lines of the CH molecular band and C_2 lines from the C_2 Swan band.\nThe estimated He/H ratio for the Sun is discussed based on the one-dimensional\nlocal thermodynamic equilibrium (1D LTE) model atmosphere. The helium abundance\n(He/H = 0.091(+0.019/+0.014)) obtained for the Sun serves as a critical\nreference point to characterize the He/H ratio of cool stars across the range\nin their effective temperature. Using this derived He/H ratio, the solar mass\nfractions are determined to be X_sun=0.7232(+0.0305/-0.0377),\nY_sun=0.2633(+0.0384/-0.0311), and Z_sun=0.0135(+0.0006/-0.0007).\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}