{"id":"2408.02903","title":"Quantum Imaging Using Spatially Entangled Photon Pairs from a Nonlinear\n  Metasurface","authors":"Jinyong Ma, Jinliang Ren, Jihua Zhang, Jiajun Meng, Caitlin\n  McManus-Barrett, Kenneth B. Crozier, Andrey A. Sukhorukov","authorsParsed":[["Ma","Jinyong",""],["Ren","Jinliang",""],["Zhang","Jihua",""],["Meng","Jiajun",""],["McManus-Barrett","Caitlin",""],["Crozier","Kenneth B.",""],["Sukhorukov","Andrey A.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 02:25:34 GMT"}],"updateDate":"2024-08-07","timestamp":1722911134000,"abstract":"  Nonlinear metasurfaces with subwavelength thickness were recently established\nas versatile platforms for the enhanced and tailorable generation of entangled\nphoton pairs. The small dimensions and inherent stability of integrated\nmetasurface sources are attractive for free-space applications in quantum\ncommunications, sensing, and imaging, yet this remarkable potential remained\nunexplored. Here, we formulate and experimentally demonstrate the unique\nbenefits and practical potential of nonlinear metasurfaces for quantum imaging\nat infrared wavelengths, facilitating an efficient protocol combining ghost and\nall-optical scanning imaging. The metasurface incorporates a\nsubwavelength-scale silica metagrating on a lithium niobate thin film. Its\ndistinguishing feature is the capability to all-optically scan the photon\nemission angle in the direction across the grating simply by tuning the pump\nbeam wavelength. Simultaneously, the photon emission is broad and\nanti-correlated along the grating direction, allowing for ghost imaging.\nThereby, we reconstruct the images of 2D objects using just a 1D detector array\nin the idler path and a bucket detector in the signal path, by recording the\ndependencies of photon coincidences on the pump wavelength. Our results reveal\nnew possibilities for quantum imaging with ultra-large field of view and\nimproved imaging resolution as compared to photon pairs from conventional bulky\ncrystals. The demonstrated concept can be extended to multi-wavelength\noperation and other applications such as quantum object tracking, paving the\nway for advancements in quantum technologies using ultra-compact nanostructured\nmetasurfaces.\n","subjects":["Physics/Optics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}