{"id":"2408.08111","title":"Analytical Model of Modular Upper Limb Rehabilitation","authors":"M. Hasanlu and M. Siavashi","authorsParsed":[["Hasanlu","M.",""],["Siavashi","M.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 12:16:26 GMT"}],"updateDate":"2024-08-16","timestamp":1723724186000,"abstract":"  Configurable robots are made up of robotic modules that can be assembled or\ncan configure themselves into multiple robot configurations. In this research\nplan, a method for upper-body rehabilitation will be discussed in the form of a\nmodular robot with different morphologies. The advantage and superiority of\ndesigning an example of a robotic module for upper body rehabilitation is the\nability to reset the modular robot system. In this research, a number of\nmodules will be designed and implemented according to the needs of one-hand\nrehabilitation with different degrees of freedom. The design modules'\nperformance and efficiency will be evaluated by simulating, making samples, and\ntesting them. This article's research includes presenting a modular upper body\nrehabilitation robot in the wrist, elbow, and shoulder areas, as well as\nproviding a suitable kinematic and dynamic model of the upper body\nrehabilitation robot to determine human-robot interaction forces and movement.\nThe research also involves analyzing the mathematical model of the upper body\nrehabilitation robot to identify advanced control strategies that rely on force\ncontrol and torque control. After reviewing the articles and research of\nothers, we concluded that no one has yet worked on the design of a prototype\nrobotic module for upper body rehabilitation in the specified order. In our\npioneering research, we intend to address this important matter.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"YXpB2sqpcaGH6ipAL0Ty-XL68lKFlS4na3zeta9lEXo","pdfSize":"4001072"}
