{"id":"2408.03401","title":"Specific heat studies of the phase transitions in multiferroic\n  Sr$_{1-x}$Ba$_x$Mn$_{1-y}$Ti$_y$O$_3$ system ($0 \\le x \\le 0.65, 0 \\le y \\le\n  0.1$)","authors":"J. Wieckowski (1), A. Szewczyk (1), M. U. Gutowska (1) and B.\n  Dabrowski (1) ((1) Institute of Physics, Polish Academy of Sciences, Warsaw,\n  Poland)","authorsParsed":[["Wieckowski","J.",""],["Szewczyk","A.",""],["Gutowska","M. U.",""],["Dabrowski","B.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 18:52:44 GMT"}],"updateDate":"2024-08-08","timestamp":1722970364000,"abstract":"  Specific heat studies of the Sr$_{1-x}$Ba$_x$Mn$_{1-y}$Ti$_y$O$_3$\npolycrystalline samples performed by the relaxation and DSC methods over the\ntemperature range 2 - 450 K are reported. Anomalies accompanying the\nantiferromagnetic-paramagnetic and ferroelectric-paraelectric phase transitions\nwere measured and analyzed. The system studied is a promising multiferroic\nmaterial of the 2$^{\\text {nd}}$ type, in which a strong coupling between the\nmagnetic and electric systems can be related to the fact that the same\nMn$^{4+}$ ions are responsible for the two orderings. Analysis of the anomaly\nat the magnetic transition was done by using the advanced theory of the\ncontinuous transitions, in which the presence of higher order terms in the free\nenergy is considered, and the parameters of the critical behavior of the system\nwere estimated. It was found that, despite of earlier predictions, the\ntransition loses the continuous character and can become the 1$^{\\text {st}}$\norder process for the Ti-containing samples. The anomalies accompanying the\n1$^{\\text{st}}$ order high-temperature ferroelectric transition were found to\nbe hardly visible by using both techniques, which was ascribed to a wide\ntemperature range of coexistence of the dielectric and ferroelectric phases.\n","subjects":["Condensed Matter/Statistical Mechanics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}