{"id":"2408.01626","title":"Weighted Brier Score -- an Overall Summary Measure for Risk Prediction\n  Models with Clinical Utility Consideration","authors":"Kehao Zhu, Yingye Zheng, Kwun Chuen Gary Chan","authorsParsed":[["Zhu","Kehao",""],["Zheng","Yingye",""],["Chan","Kwun Chuen Gary",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 01:37:45 GMT"}],"updateDate":"2024-08-06","timestamp":1722649065000,"abstract":"  As advancements in novel biomarker-based algorithms and models accelerate\ndisease risk prediction and stratification in medicine, it is crucial to\nevaluate these models within the context of their intended clinical\napplication. Prediction models output the absolute risk of disease;\nsubsequently, patient counseling and shared decision-making are based on the\nestimated individual risk and cost-benefit assessment. The overall impact of\nthe application is often referred to as clinical utility, which received\nsignificant attention in terms of model assessment lately. The classic Brier\nscore is a popular measure of prediction accuracy; however, it is insufficient\nfor effectively assessing clinical utility. To address this limitation, we\npropose a class of weighted Brier scores that aligns with the\ndecision-theoretic framework of clinical utility. Additionally, we decompose\nthe weighted Brier score into discrimination and calibration components,\nexamining how weighting influences the overall score and its individual\ncomponents. Through this decomposition, we link the weighted Brier score to the\n$H$ measure, which has been proposed as a coherent alternative to the area\nunder the receiver operating characteristic curve. This theoretical link to the\n$H$ measure further supports our weighting method and underscores the essential\nelements of discrimination and calibration in risk prediction evaluation. The\npractical use of the weighted Brier score as an overall summary is demonstrated\nusing data from the Prostate Cancer Active Surveillance Study (PASS).\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Y9bmqM_VV9TZBIpiNvi7qT_iWELeJyxvjJnnBcZktMo","pdfSize":"766633"}
