{"id":"2408.07669","title":"Two-level hybrid Schwarz Preconditioners for The Helmholtz Equation with\n  high wave number","authors":"Peipei Lu, Xuejun Xu, Bowen Zheng and Jun Zou","authorsParsed":[["Lu","Peipei",""],["Xu","Xuejun",""],["Zheng","Bowen",""],["Zou","Jun",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 17:11:17 GMT"}],"updateDate":"2024-08-15","timestamp":1723655477000,"abstract":"  In this work, we propose and analyze two two-level hybrid Schwarz\npreconditioners for solving the Helmholtz equation with high wave number in two\nand three dimensions. Both preconditioners are defined over a set of\noverlapping subdomains, with each preconditioner formed by a global coarse\nsolver and one local solver on each subdomain. The global coarse solver is\nbased on the localized orthogonal decomposition (LOD) technique, which was\nproposed in [27,28] originally for the discretization schemes for elliptic\nmultiscale problems with heterogeneous and highly oscillating coefficients and\nHelmholtz problems with high wave number to eliminate the pollution effect. The\nlocal subproblems are Helmholtz problems in subdomains with homogeneous\nboundary conditions (the first preconditioner) or impedance boundary conditions\n(the second preconditioner). Both preconditioners are shown to be optimal under\nsome reasonable conditions, that is, a uniform upper bound of the\npreconditioned operator norm and a uniform lower bound of the field of values\nare established in terms of all the key parameters, such as the fine mesh size,\nthe coarse mesh size, the subdomain size and the wave numbers. It is the first\ntime to show that the LOD solver can be a very effective coarse solver when it\nis used appropriately in the Schwarz method with multiple overlapping\nsubdomains. Numerical experiments are presented to confirm the optimality and\nefficiency of the two proposed preconditioners.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}