{"id":"2408.13171","title":"Lessons in co-creation: the inconvenient truths of inclusive sign\n  language technology development","authors":"Maartje De Meulder, Davy Van Landuyt, Rehana Omardeen","authorsParsed":[["De Meulder","Maartje",""],["Van Landuyt","Davy",""],["Omardeen","Rehana",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 15:43:34 GMT"}],"updateDate":"2024-08-26","timestamp":1724427814000,"abstract":"  In the era of AI-driven language technologies, there is a growing demand for\nthe participation and leadership of deaf communities in sign language\ntechnology development, often framed as co-creation. This paper, developed\nthrough collaborative and iterative dialogue between the authors with data from\ninformal participant observations, examines the involvement of the European\nUnion of the Deaf in two EU Horizon 2020 projects, EASIER and SignON. These\nprojects aimed to develop mobile translation applications between signed and\nspoken languages, bringing together predominantly hearing, non-signing\ntechnology experts with predominantly hearing sign language academics and\norganizations representing deaf end users in large multi-partner consortia.\nWhile co-creation is sometimes presented as the best or required way to do\nresearch or even as emancipatory, it frequently masks systemic issues of power\nimbalances and tokenism. Drawing from EUD's experiences of these projects, we\nhighlight several inconvenient truths of co-creation, and propose seven lessons\nfor future initiatives: recognizing deaf partners' invisible labour as work,\nmanaging expectations about technologies, cripping co-creation processes,\nexploring alternative methods to mitigate co-creation fatigue, seeking\nintersectional feedback, ensuring co-creation is not just virtue signalling,\nand fostering deaf leadership in AI sign language research. We argue for\nco-creation as a transformative activity that fundamentally alters the status\nquo and levels the playing field. This necessitates increasing the number of\ndeaf researchers and enhancing AI literacy among deaf communities. Without\nthese critical transformative actions, co-creation risks merely paying lip\nservice to deaf communities.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}