{"id":"2408.01706","title":"Entanglement scaling behaviors of free fermions on hyperbolic lattices","authors":"Xiang-You Huang, Yao Zhou, Peng Ye","authorsParsed":[["Huang","Xiang-You",""],["Zhou","Yao",""],["Ye","Peng",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 08:17:51 GMT"}],"updateDate":"2024-08-07","timestamp":1722673071000,"abstract":"  Recently, tight-binding models on hyperbolic lattices (discretized AdS\nspace), have gained significant attention, leading to hyperbolic band theory\nand non-Abelian Bloch states. In this paper, we investigate these quantum\nsystems from the perspective of quantum information, focusing particularly on\nthe scaling of entanglement entropy (EE) that has been regarded as a powerful\nquantum-information probe into exotic phases of matter. It is known that on\n$d$-dimensional translation-invariant Euclidean lattice, the EE of band\ninsulators scales as an area law ($\\sim L^{d-1}$; $L$ is the linear size of the\nboundary between two subsystems). Meanwhile, the EE of metals (with finite\nDensity-of-State, i.e., DOS) scales as the renowned Gioev-Klich-Widom scaling\nlaw ($\\sim L^{d-1}\\log L$). The appearance of logarithmic divergence, as well\nas the analytic form of the coefficient $c$ is mathematically controlled by the\nWidom conjecture of asymptotic behavior of Toeplitz matrices and can be\nphysically understood via the Swingle's argument. However, the hyperbolic\nlattice, which generalizes translational symmetry, results in inapplicability\nof the Widom conjecture and thus presents significant analytic difficulties.\nHere we make an initial attempt through numerical simulation. Remarkably, we\nfind that both cases adhere to the area law, indicating that the logarithmic\ndivergence arising from finite DOS is suppressed by the background hyperbolic\ngeometry. To achieve the results, we first apply the vertex inflation method to\ngenerate hyperbolic lattice on the Poincar\\'{e} disk, and then apply the\nHaydock recursion method to compute DOS. Finally, we study the scaling of EE\nfor different bipartitions via exact diagonalization and perform finite-size\nscaling. We also investigate how the coefficient of the area law is correlated\nto bulk gap and DOS. Future directions are discussed.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Statistical Mechanics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}