{"id":"2408.15015","title":"Alternating Minimization Schemes for Computing\n  Rate-Distortion-Perception Functions with $f$-Divergence Perception\n  Constraints","authors":"Giuseppe Serra, Photios A. Stavrou, Marios Kountouris","authorsParsed":[["Serra","Giuseppe",""],["Stavrou","Photios A.",""],["Kountouris","Marios",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 12:50:12 GMT"}],"updateDate":"2024-08-28","timestamp":1724763012000,"abstract":"  We study the computation of the rate-distortion-perception function (RDPF)\nfor discrete memoryless sources subject to a single-letter average distortion\nconstraint and a perception constraint that belongs to the family of\n$f$-divergences. In this setting, the RDPF forms a convex programming problem\nfor which we characterize the optimal parametric solutions. We employ the\ndeveloped solutions in an alternating minimization scheme, namely Optimal\nAlternating Minimization (OAM), for which we provide convergence guarantees.\nNevertheless, the OAM scheme does not lead to a direct implementation of a\ngeneralized Blahut-Arimoto (BA) type of algorithm due to the presence of\nimplicit equations in the structure of the iteration. To overcome this\ndifficulty, we propose two alternative minimization approaches whose\napplicability depends on the smoothness of the used perception metric: a\nNewton-based Alternating Minimization (NAM) scheme, relying on Newton's\nroot-finding method for the approximation of the optimal iteration solution,\nand a Relaxed Alternating Minimization (RAM) scheme, based on a relaxation of\nthe OAM iterates. Both schemes are shown, via the derivation of necessary and\nsufficient conditions, to guarantee convergence to a globally optimal solution.\nWe also provide sufficient conditions on the distortion and the perception\nconstraints which guarantee that the proposed algorithms converge exponentially\nfast in the number of iteration steps. We corroborate our theoretical results\nwith numerical simulations and draw connections with existing results.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LbVqHphKpPF_EusiwE_4U6oK0AuhQhfD_7zL9HWKUuA","pdfSize":"1104666"}
