{"id":"2408.04489","title":"Global Fits in the Supersymmetric Georgi-Machacek Model","authors":"Yingnan Xu","authorsParsed":[["Xu","Yingnan",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 14:37:32 GMT"}],"updateDate":"2024-08-09","timestamp":1723127852000,"abstract":"  We study a supersymmetric extension of the SM with Higgs triplets in the\nscalar sector. We begin with a review of the SM, particularly the Higgs\nmechanism. In the SM, the Higgs mechanism requires the presence of a complex\nHiggs doublet to break the electroweak symmetry and endow particles with a\nmass; this process is called Electroweak Symmetry Breaking. Although this is\nthe simplest possibility, higher scalar representations may also contribute to\nthe EWSB. The extent to which these higher representations contribute to EWSB\nis constrained by precise measurements of the $rho$ parameter. The model must\npredict $\\rho=1$ at tree level. It is a fortuitous circumstance that simple\ndoublet representations satisfy this requirement exactly. The underlying reason\nis that models with doublets satisfy an accidental custodial symmetry.\nTherefore, one can add any number of scalar doublets and still satisfy this\nexperimental constraint. For higher representations, it is a bit trickier to\nmaintain the custodial symmetry. We study in this work a supersymmetric model\nthat incorporates triplet representations and satisfies the custodial symmetry.\nThe non-supersymmetric Gorgi-Machacek model is one example of a custodial\ninvariant model of SSB with Higgs triplets. However, the GM model has a\nfine-tuning problem beyond that of the SM. The solution to both issues is the\nSupersymmetric Custodial Triplet Model. The supersymmetric GM model arises as a\nlow energy limit of the SCTM. It is this model that we study here. We make use\nof public code, GMCalc and HiggsTools, to perform global fits to the parameters\nof this model and obtain limits on model parameters at the $95%$ confidence\nlevel. For these hypothetical scalars, we identify the dominant decay channels\nand extract bounds on their branching ratios. We also examine the possible\npresence of a 95 GeV Higgs Boson in the SGM.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GGaW4X_onG6av7aWdkmVIEID7xyCx3GtEph_Z_MS_w4","pdfSize":"8335286"}
