{"id":"2408.16039","title":"Group Difference in Differences can Identify Effect Heterogeneity in\n  Non-Canonical Settings","authors":"Zach Shahn, Laura Hatfield","authorsParsed":[["Shahn","Zach",""],["Hatfield","Laura",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 17:38:35 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 15:52:03 GMT"}],"updateDate":"2024-09-05","timestamp":1724866715000,"abstract":"  Consider a very general setting in which data on an outcome of interest is\ncollected in two `groups' at two time periods, with certain group-periods\ndeemed `treated' and others `untreated'. A special case is the canonical\nDifference-in-Differences (DiD) setting in which one group is treated only in\nthe second period while the other is treated in neither period. Then it is well\nknown that under a parallel trends assumption across the two groups the classic\nDiD formula (subtracting the average change in the outcome across periods in\nthe treated group by the average change in the outcome across periods in the\nuntreated group) identifies the average treatment effect on the treated in the\nsecond period. But other relations between group, period, and treatment are\npossible. For example, the groups might be demographic (or other baseline\ncovariate) categories with all units in both groups treated in the second\nperiod and none treated in the first, i.e. a pre-post design. Or one group\nmight be treated in both periods while the other is treated in neither. In\nthese non-canonical settings (lacking a control group or a pre-period), some\nresearchers still compute DiD estimators, while others avoid causal inference\naltogether. In this paper, we will elucidate the group-period-treatment\nscenarios and corresponding parallel trends assumptions under which a DiD\nformula identifies meaningful causal estimands and what those causal estimands\nare. We find that in non-canonical settings, under a group parallel trends\nassumption the DiD formula identifies effect heterogeneity in the treated\nacross groups or across time periods (depending on the setting).\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ND0aE5qiFlxuvr_C6HJ1gS0o79LgilrmXS0g-sL_f1o","pdfSize":"258208"}
