{"id":"2408.16924","title":"Enhancing Autism Spectrum Disorder Early Detection with the Parent-Child\n  Dyads Block-Play Protocol and an Attention-enhanced GCN-xLSTM Hybrid Deep\n  Learning Framework","authors":"Xiang Li, Lizhou Fan, Hanbo Wu, Kunping Chen, Xiaoxiao Yu, Chao Che,\n  Zhifeng Cai, Xiuhong Niu, Aihua Cao, Xin Ma","authorsParsed":[["Li","Xiang",""],["Fan","Lizhou",""],["Wu","Hanbo",""],["Chen","Kunping",""],["Yu","Xiaoxiao",""],["Che","Chao",""],["Cai","Zhifeng",""],["Niu","Xiuhong",""],["Cao","Aihua",""],["Ma","Xin",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 21:53:01 GMT"}],"updateDate":"2024-09-02","timestamp":1724968381000,"abstract":"  Autism Spectrum Disorder (ASD) is a rapidly growing neurodevelopmental\ndisorder. Performing a timely intervention is crucial for the growth of young\nchildren with ASD, but traditional clinical screening methods lack objectivity.\nThis study introduces an innovative approach to early detection of ASD. The\ncontributions are threefold. First, this work proposes a novel Parent-Child\nDyads Block-Play (PCB) protocol, grounded in kinesiological and neuroscientific\nresearch, to identify behavioral patterns distinguishing ASD from typically\ndeveloping (TD) toddlers. Second, we have compiled a substantial video dataset,\nfeaturing 40 ASD and 89 TD toddlers engaged in block play with parents. This\ndataset exceeds previous efforts on both the scale of participants and the\nlength of individual sessions. Third, our approach to action analysis in videos\nemploys a hybrid deep learning framework, integrating a two-stream graph\nconvolution network with attention-enhanced xLSTM (2sGCN-AxLSTM). This\nframework is adept at capturing dynamic interactions between toddlers and\nparents by extracting spatial features correlated with upper body and head\nmovements and focusing on global contextual information of action sequences\nover time. By learning these global features with spatio-temporal correlations,\nour 2sGCN-AxLSTM effectively analyzes dynamic human behavior patterns and\ndemonstrates an unprecedented accuracy of 89.6\\% in early detection of ASD. Our\napproach shows strong potential for enhancing early ASD diagnosis by accurately\nanalyzing parent-child interactions, providing a critical tool to support\ntimely and informed clinical decision-making.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}