{"id":"2408.09844","title":"Joint Beamforming and Power Control for D2D-Assisted Integrated Sensing\n  and Communication Networks","authors":"Zhenyu Xue, Yuang Chen, Hancheng Lu, Baolin Chong, Wanqing Long","authorsParsed":[["Xue","Zhenyu",""],["Chen","Yuang",""],["Lu","Hancheng",""],["Chong","Baolin",""],["Long","Wanqing",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 09:44:52 GMT"}],"updateDate":"2024-08-20","timestamp":1724060692000,"abstract":"  Integrated sensing and communication (ISAC) is an emerging technology in\nnext-generation communication networks. However, the communication performance\nof the ISAC system may be severely affected by interference from the radar\nsystem if the sensing task has demanding performance requirements. In this\npaper, we exploit device-to-device communication (D2D) to improve system\ncommunication capacity. The ISAC system in a single cell D2D assisted-network\nis investigated, where the base station (BS) performs target sensing and\ncommunication with multiple celluar user equipments (CUEs) as well as D2D user\nequipments (DUEs) simultaneously communicating with other DUEs by multiplexing\nthe same frequency resource. To achieve the optimal communication performance\nin the D2D-assisted ISAC system, a joint beamforming and power control problem\nis formulated with the goal to maximize the sum rate of the system while\nguaranteeing the performance requirements of radar sensing. Due to the\nnon-convexity of the problem, we propose the algorithm to transform the origin\nproblem into a relaxation form and obtain the solution. We also proposed the\nzero-forcing (ZF) beamforming scheme to acquire the solution that can eliminate\nthe interference of the BS on DUEs. Extensive numerical simulations\ndemonstrated that with the assistance of the D2D communications, our proposed\nalgorithm significantly outperforms the baseline schemes in the system sum\nrate.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}