{"id":"2408.14954","title":"Stochastic Geometry Based Modelling and Analysis of Uplink Cooperative\n  Satellite-Aerial-Terrestrial Networks for Nomadic Communications with Weak\n  Satellite Coverage","authors":"Wen-Yu Dong, Shaoshi Yang, Ping Zhang, Sheng Chen","authorsParsed":[["Dong","Wen-Yu",""],["Yang","Shaoshi",""],["Zhang","Ping",""],["Chen","Sheng",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 10:58:49 GMT"}],"updateDate":"2024-08-28","timestamp":1724756329000,"abstract":"  Cooperative satellite-aerial-terrestrial networks (CSATNs), where unmanned\naerial vehicles (UAVs) are utilized as nomadic aerial relays (A), are highly\nvaluable for many important applications, such as post-disaster urban\nreconstruction. In this scenario, direct communication between terrestrial\nterminals (T) and satellites (S) is often unavailable due to poor propagation\nconditions for satellite signals, and users tend to congregate in regions of\nfinite size. There is a current dearth in the open literature regarding the\nuplink performance analysis of CSATN operating under the above constraints, and\nthe few contributions on the uplink model terrestrial terminals by a Poisson\npoint process (PPP) relying on the unrealistic assumption of an infinite area.\nThis paper aims to fill the above research gap. First, we propose a stochastic\ngeometry based innovative model to characterize the impact of the finite-size\ndistribution region of terrestrial terminals in the CSATN by jointly using a\nbinomial point process (BPP) and a type-II Mat{\\'e}rn hard-core point process\n(MHCPP). Then, we analyze the relationship between the spatial distribution of\nthe coverage areas of aerial nodes and the finite-size distribution region of\nterrestrial terminals, thereby deriving the distance distribution of the T-A\nlinks. Furthermore, we consider the stochastic nature of the spatial\ndistributions of terrestrial terminals and UAVs, and conduct a thorough\nanalysis of the coverage probability and average ergodic rate of the T-A links\nunder Nakagami fading and the A-S links under shadowed-Rician fading. Finally,\nthe accuracy of our theoretical derivations are confirmed by Monte Carlo\nsimulations. Our research offers fundamental insights into the system-level\nperformance optimization for the realistic CSATNs involving nomadic aerial\nrelays and terrestrial terminals confined in a finite-size region.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}