{"id":"2408.10938","title":"YSO Jets Magnetocentrifugally Driven by Reconnecting Atmospheric\n  Avalanche Accretion Streams Above Inner Circumstellar Disks","authors":"Yisheng Tu, Zhi-Yun Li, Zhaohuan Zhu, Xiao Hu, Chun-Yen Hsu","authorsParsed":[["Tu","Yisheng",""],["Li","Zhi-Yun",""],["Zhu","Zhaohuan",""],["Hu","Xiao",""],["Hsu","Chun-Yen",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 15:26:17 GMT"}],"updateDate":"2024-08-21","timestamp":1724167577000,"abstract":"  Fast, collimated jets are ubiquitous features of young stellar objects\n(YSOs). They are generally thought to be powered by disk accretion, but the\ndetails are debated. Through 2D (axisymmetric) MHD simulations, we find that a\nfast ($>100$~km/s) collimated bipolar jet is continuously driven along the\nnorth and south poles of the circumstellar disk that is initially magnetized by\na large-scale open poloidal field and contains a thermally ionized inner\nmagnetically active zone surrounded by a dead zone. The fast jet is primarily\ndriven magneto-centrifugally by the release of the gravitational binding energy\nof the so-called ``avalanche accretion streams\" near the boundary of an\nevacuated poloidal field-dominated polar region and a thick disk atmosphere\nraised by a toroidal magnetic field. Specifically, the fast outflow is driven\nalong the upper (open) branch of the highly pinched poloidal field lines\nthreading the (strongly magnetically braked) accretion streams where the\ndensity is relatively low so that the lightly loaded material can be\naccelerated magneto-centrifugally along the open field line to a high speed.\nThe highly pinched poloidal magnetic fields threading the avalanche accretion\nstreams tend to reconnect, enabling mass to accrete to the center without\ndragging along the poloidal magnetic flux with it. The reconnection provides a\npotential heating source for producing chondrules and calcium- and\naluminum-rich inclusions (CAIs).\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}