{"id":"2408.01994","title":"State Space Modelling for detecting and characterising Gravitational\n  Waves afterglows","authors":"Daniele d'Antonio, Martin Ellis Bell, James John Brown, Clara Grazian","authorsParsed":[["d'Antonio","Daniele",""],["Bell","Martin Ellis",""],["Brown","James John",""],["Grazian","Clara",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 11:27:12 GMT"}],"updateDate":"2024-08-06","timestamp":1722770832000,"abstract":"  We propose the usage of an innovative method for selecting transients and\nvariables. These sources are detected at different wavelengths across the\nelectromagnetic spectrum spanning from radio waves to gamma-rays. We focus on\nradio signals and use State Space Models, which are also referred to as Dynamic\nLinear Models. State Space Models (and more generally parametric autoregressive\nmodels) have been the mainstay of economic modelling for some years, but rarely\nthey have been used in Astrophysics. The statistics currently used to identify\nradio variables and transients are not sophisticated enough to distinguish\ndifferent types of variability. These methods simply report the overall\nmodulation and significance of the variability, and the ordering of the data in\ntime is insignificant. State Space Models are much more advanced and can encode\nnot only the amount and significance of the variability but also properties,\nsuch as slope, rise or decline for a given time t. In this work, we evaluate\nthe effectiveness of State Space Models for transient and variable detection\nincluding classification in time-series astronomy. We also propose a method for\ndetecting a transient source hosted in a variable active galaxy, whereby the\ntime-series of a static host galaxy and the dynamic nature of the transient in\nthe galaxy are intertwined. Furthermore, we examine the hypothetical scenario\nwhere the target transient we want to detect is the gravitational wave source\nGW170817 (or similar).\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QhkJySyy9IPp0Ne8HjEDCzQAphKe_YQ2nl0RUiUJaeE","pdfSize":"2919440","txDigest":"BmzuGEsvgRjiodNv77kRNZqrFCuzr8hktt76Dz8Hkcru","endEpoch":"1","status":"CERTIFIED"}
