{"id":"2408.12577","title":"Integrating an agent-based behavioral model in microtransit forecasting\n  and revenue management","authors":"Xiyuan Ren, Joseph Y. J. Chow, Venktesh Pandey, Linfei Yuan","authorsParsed":[["Ren","Xiyuan",""],["Chow","Joseph Y. J.",""],["Pandey","Venktesh",""],["Yuan","Linfei",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 17:43:04 GMT"}],"updateDate":"2024-08-23","timestamp":1724348584000,"abstract":"  As an IT-enabled multi-passenger mobility service, microtransit has the\npotential to improve accessibility, reduce congestion, and enhance flexibility\nin transportation options. However, due to its heterogeneous impacts on\ndifferent communities and population segments, there is a need for better tools\nin microtransit forecast and revenue management, especially when actual usage\ndata are limited. We propose a novel framework based on an agent-based mixed\nlogit model estimated with microtransit usage data and synthetic trip data. The\nframework involves estimating a lower-branch mode choice model with synthetic\ntrip data, combining lower-branch parameters with microtransit data to estimate\nan upper-branch ride pass subscription model, and applying the nested model to\nevaluate microtransit pricing and subsidy policies. The framework enables\nfurther decision-support analysis to consider diverse travel patterns and\nheterogeneous tastes of the total population. We test the framework in a case\nstudy with synthetic trip data from Replica Inc. and microtransit data from\nArlington Via. The lower-branch model result in a rho-square value of 0.603 on\nweekdays and 0.576 on weekends. Predictions made by the upper-branch model\nclosely match the marginal subscription data. In a ride pass pricing policy\nscenario, we show that a discount in weekly pass (from $25 to $18.9) and\nmonthly pass (from $80 to $71.5) would surprisingly increase total revenue by\n$102/day. In an event- or place-based subsidy policy scenario, we show that a\n100% fare discount would reduce 80 car trips during peak hours at AT&T Stadium,\nrequiring a subsidy of $32,068/year.\n","subjects":["Economics/Econometrics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"azYx9-muuYLYPRPaFM2DFLFrmHsKCdmlWI0UOSXQCg4","pdfSize":"1968848"}
