{"id":"2408.12303","title":"Cartesian and spherical multipole expansions in anisotropic media","authors":"Elias Le Boudec, Toma Oregel-Chaumont, Farhad Rachidi, Marcos\n  Rubinstein, Felix Vega","authorsParsed":[["Boudec","Elias Le",""],["Oregel-Chaumont","Toma",""],["Rachidi","Farhad",""],["Rubinstein","Marcos",""],["Vega","Felix",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 11:19:47 GMT"}],"updateDate":"2024-08-23","timestamp":1724325587000,"abstract":"  The multipole expansion, a ubiquitous tool in a variety of physical problems,\ncan be formulated in spherical and Cartesian coordinates. By constructing an\nexplicit map linking both formulations in isotropic media, we discover a lack\nof equivalence between both approaches in anisotropic media. In isotropic\nmedia, the Cartesian multipole tensor can be reduced to a spherical tensor\ncontaining significantly fewer entries. In anisotropic media, however, the loss\nof propagation symmetry prevents this reduction. In turn, non-harmonic sources\nradiate fields that can be projected onto a finite set of Cartesian multipole\nmoments but require (possibly infinitely) many spherical moments. For harmonic\nsources, the link between both approaches presents a systematic way to\nconstruct the spherical multipole expansion from the Cartesian one. The lack of\nequivalence between both approaches results in physically significant effects\nwherever the field propagation includes the Laplace operator. We illustrate\nthis issue on an electromagnetic radiation inverse problem in anisotropic\nmedia, including an analysis of a large-anisotropy regime. We show that the use\nof the Cartesian approach significantly increases the efficiency and\ninterpretability of the model. The proposed approach opens the door to wider\napplications of the multipole expansion in anisotropic media, whose importance\nis rising in multiple physical systems.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"O4TG61Dr5ZU3P_mja-NDjn3kQMPMaFVl8Fn1B4JYpec","pdfSize":"1371165"}
