{"id":"2408.12994","title":"A triaxial vectorization technique for a single-beam zero-field atomic\n  magnetometer to suppress cross-axis projection error","authors":"Rach Dawson, Marcin S. Mrozowski, Dominic Hunter, Carolyn O'Dwyer,\n  Erling Riis, Paul. F. Griffin, and Stuart Ingleby","authorsParsed":[["Dawson","Rach",""],["Mrozowski","Marcin S.",""],["Hunter","Dominic",""],["O'Dwyer","Carolyn",""],["Riis","Erling",""],["Griffin","Paul. F.",""],["Ingleby","Stuart",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 11:22:53 GMT"}],"updateDate":"2024-08-26","timestamp":1724412173000,"abstract":"  Zero-field optically pumped magnetometers (OPMs) have emerged as an important\ntechnology for biomagnetism due to their ulta-sensitive performance, contained\nwithin a non-cryogenic small-scale sensor-head. The compactness of such OPMs is\noften achieved through simplified detection schemes, which typically provide\nonly single-axis magnetic field information. However, multi-axis static\nmagnetic fields on non-measurement axes cause a systematic error that manifests\nas amplitude and phase errors across the measurement axis. Here we present a\ntriaxial operational technique for a compact zero-field OPM which suppresses\nmulti-axis systematic errors through simultaneous measurement and closed-loop\nactive control of the static magnetic fields across all axes. The demonstrated\ntechnique requires magnetic modulation across two axes while providing static\nfield information for all three axes. We demonstrate this technique on a\nrubidium laboratory-based zero-field magnetometer, achieving a bandwidth of 380\nHz with sensitivities of $<25$ fT/$\\sqrt{\\rm{Hz}}$ across both transverse axes\nand $65$ fT/$\\sqrt{\\rm{Hz}}$ along the beam axis. Using the proposed triaxial\ntechnique, we demonstrate precise tracking of a 2 Hz triaxial vector test\nsignal and suppression of systematic cross-axis projection errors over an\nextended period, $\\simeq20$~min.\n","subjects":["Physics/Atomic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0QGuWef8lz-O41FKarGxgbHIRLBdsOx_Sy-ImO3wfyw","pdfSize":"1594362"}
