{"id":"2408.09707","title":"0ptical trapping with optical magnetic field and photonic Hall effect\n  forces","authors":"Yanzeng Li, Emmanuel Valenton, Spoorthi Nagasamudram, John Parker,\n  Marcos Perez, Uttam Manna, Mahua Biswas, Stuart A. Rice and Norbert F.\n  Scherer","authorsParsed":[["Li","Yanzeng",""],["Valenton","Emmanuel",""],["Nagasamudram","Spoorthi",""],["Parker","John",""],["Perez","Marcos",""],["Manna","Uttam",""],["Biswas","Mahua",""],["Rice","Stuart A.",""],["Scherer","Norbert F.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 05:44:22 GMT"}],"updateDate":"2024-08-20","timestamp":1724046262000,"abstract":"  Optical trapping is having ever-increasing impact in science $-$ particularly\nbiophysics, photonics and most recently in quantum optomechanics $-$ owing to\nits superior capability for manipulating nanoscale structures and materials.\nHowever, essentially all experimental optical trapping studies in the optical\ndipole regime have, to date, been dominated by the interaction between a\nmaterial's electric polarizability, $\\alpha_{e}$, and the electric part of the\nincident electromagnetic field, and therefore described by electric field\nintensity gradient forces. Optical trapping based on optical magnetic\nlight-matter interactions has not been experimentally addressed despite it's\nimmediate extension of the boundaries of optical trapping research and\napplications. This paper addresses this long-standing deficiency through the\nrealization of optical magnetic trapping of large index of refraction (i.e.,\nSi) nanoparticles and also presents a formalism for quantitative understanding\nof the experimental findings. Our experimental optical trapping results require\nincluding optical magnetic polarizability, $\\alpha_{m}$, and electric-magnetic\nscattering forces associated with the Photonic Hall effect that are\nqualitatively and quantitatively validated by Maxwell stress tensor\ncalculations. Our findings bring new opportunities for nanoparticle\nmanipulation, potentially relax the limitations Ashkin claimed based on the\noptical Earnshaw's theorem, motivate optical matter formation by optical\nmagnetic interactions, and suggest new N-body effects and symmetry breaking to\ndrive dynamics of optical matter systems.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}