{"id":"2408.13934","title":"Learning to Move Like Professional Counter-Strike Players","authors":"David Durst, Feng Xie, Vishnu Sarukkai, Brennan Shacklett, Iuri\n  Frosio, Chen Tessler, Joohwan Kim, Carly Taylor, Gilbert Bernstein, Sanjiban\n  Choudhury, Pat Hanrahan, Kayvon Fatahalian","authorsParsed":[["Durst","David",""],["Xie","Feng",""],["Sarukkai","Vishnu",""],["Shacklett","Brennan",""],["Frosio","Iuri",""],["Tessler","Chen",""],["Kim","Joohwan",""],["Taylor","Carly",""],["Bernstein","Gilbert",""],["Choudhury","Sanjiban",""],["Hanrahan","Pat",""],["Fatahalian","Kayvon",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 20:43:34 GMT"}],"updateDate":"2024-08-27","timestamp":1724618614000,"abstract":"  In multiplayer, first-person shooter games like Counter-Strike: Global\nOffensive (CS:GO), coordinated movement is a critical component of high-level\nstrategic play. However, the complexity of team coordination and the variety of\nconditions present in popular game maps make it impractical to author\nhand-crafted movement policies for every scenario. We show that it is possible\nto take a data-driven approach to creating human-like movement controllers for\nCS:GO. We curate a team movement dataset comprising 123 hours of professional\ngame play traces, and use this dataset to train a transformer-based movement\nmodel that generates human-like team movement for all players in a \"Retakes\"\nround of the game. Importantly, the movement prediction model is efficient.\nPerforming inference for all players takes less than 0.5 ms per game step\n(amortized cost) on a single CPU core, making it plausible for use in\ncommercial games today. Human evaluators assess that our model behaves more\nlike humans than both commercially-available bots and procedural movement\ncontrollers scripted by experts (16% to 59% higher by TrueSkill rating of\n\"human-like\"). Using experiments involving in-game bot vs. bot self-play, we\ndemonstrate that our model performs simple forms of teamwork, makes fewer\ncommon movement mistakes, and yields movement distributions, player lifetimes,\nand kill locations similar to those observed in professional CS:GO match play.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Graphics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}