{"id":"2408.11718","title":"Scalable and non-iterative graphical model estimation","authors":"Kshitij Khare, Syed Rahman, Bala Rajaratnam and Jiayuan Zhou","authorsParsed":[["Khare","Kshitij",""],["Rahman","Syed",""],["Rajaratnam","Bala",""],["Zhou","Jiayuan",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 15:46:00 GMT"}],"updateDate":"2024-08-22","timestamp":1724255160000,"abstract":"  Graphical models have found widespread applications in many areas of modern\nstatistics and machine learning. Iterative Proportional Fitting (IPF) and its\nvariants have become the default method for undirected graphical model\nestimation, and are thus ubiquitous in the field. As the IPF is an iterative\napproach, it is not always readily scalable to modern high-dimensional data\nregimes. In this paper we propose a novel and fast non-iterative method for\npositive definite graphical model estimation in high dimensions, one that\ndirectly addresses the shortcomings of IPF and its variants. In addition, the\nproposed method has a number of other attractive properties. First, we show\nformally that as the dimension p grows, the proportion of graphs for which the\nproposed method will outperform the state-of-the-art in terms of computational\ncomplexity and performance tends to 1, affirming its efficacy in modern\nsettings. Second, the proposed approach can be readily combined with scalable\nnon-iterative thresholding-based methods for high-dimensional sparsity\nselection. Third, the proposed method has high-dimensional statistical\nguarantees. Moreover, our numerical experiments also show that the proposed\nmethod achieves scalability without compromising on statistical precision.\nFourth, unlike the IPF, which depends on the Gaussian likelihood, the proposed\nmethod is much more robust.\n","subjects":["Statistics/Methodology","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"OAvoZDYTK6QYMUSq27VE8wNWOq2kg2uATy8M388ZPVQ","pdfSize":"765440"}
