{"id":"2408.13643","title":"Temporal Divide-and-Conquer Anomaly Actions Localization in\n  Semi-Supervised Videos with Hierarchical Transformer","authors":"Nada Osman and Marwan Torki","authorsParsed":[["Osman","Nada",""],["Torki","Marwan",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 18:12:58 GMT"}],"updateDate":"2024-08-27","timestamp":1724523178000,"abstract":"  Anomaly action detection and localization play an essential role in security\nand advanced surveillance systems. However, due to the tremendous amount of\nsurveillance videos, most of the available data for the task is unlabeled or\nsemi-labeled with the video class known, but the location of the anomaly event\nis unknown. In this work, we target anomaly localization in semi-supervised\nvideos. While the mainstream direction in addressing this task is focused on\nsegment-level multi-instance learning and the generation of pseudo labels, we\naim to explore a promising yet unfulfilled direction to solve the problem by\nlearning the temporal relations within videos in order to locate anomaly\nevents. To this end, we propose a hierarchical transformer model designed to\nevaluate the significance of observed actions in anomalous videos with a\ndivide-and-conquer strategy along the temporal axis. Our approach segments a\nparent video hierarchically into multiple temporal children instances and\nmeasures the influence of the children nodes in classifying the abnormality of\nthe parent video. Evaluating our model on two well-known anomaly detection\ndatasets, UCF-crime and ShanghaiTech, proves its ability to interpret the\nobserved actions within videos and localize the anomalous ones. Our proposed\napproach outperforms previous works relying on segment-level multiple-instance\nlearning approaches while reaching a promising performance compared to the more\nrecent pseudo-labeling-based approaches.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}