{"id":"2408.17147","title":"Microscopic Structural Study on the Growth History of Granular Heaps\n  Prepared by the Raining Method","authors":"Hanyu Li, Houfei Yuan, Zhikun Zeng, Shuyang Zhang, Chijin Zhou, Xinyu\n  Ai, and Yujie Wang","authorsParsed":[["Li","Hanyu",""],["Yuan","Houfei",""],["Zeng","Zhikun",""],["Zhang","Shuyang",""],["Zhou","Chijin",""],["Ai","Xinyu",""],["Wang","Yujie",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 09:38:48 GMT"}],"updateDate":"2024-09-02","timestamp":1725010728000,"abstract":"  Granular heaps are critical in both industrial applications and natural\nprocesses, exhibiting complex behaviors that have sparked significant research\ninterest. The stress dip phenomenon observed beneath granular heaps continues\nto be a topic of significant debate. Current models based on force transmission\noften assume that the packing is near the isostatic point, overlooking the\ncritical influence of internal structure and formation history on the\nmechanical properties of granular heaps. Consequently, these models fail to\nfully account for diverse observations. In this study, we experimentally\nexplore the structural evolution of three dimensional (3D) granular heaps\ncomposed of monodisperse spherical particles prepared using the raining method.\nOur results reveal the presence of two distinct regions within the heaps,\ncharacterized by significant differences in structural properties such as\npacking fraction, contact number, and contact anisotropy. We attribute these\nstructural variations to the differing formation mechanisms during heap growth.\nOur findings emphasize the substantial influence of the preparation protocols\non the internal structure of granular heaps and provide valuable insights into\nstress distribution within granular materials. This research may contribute to\nthe development of more accurate constitutive relations for granular materials\nby informing and refining future modeling approaches\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"55sWKTznZoQrbGu8DYnB1ocxd1tMdQzPf25WKLs3mNU","pdfSize":"665840"}
