{"id":"2408.00687","title":"Speed Limit Reduction Enhances Urban Worker Safety: Evidence from a\n  Decade of Traffic Incidents in Santiago, Chile","authors":"Eduardo Graells-Garrido, Mat\\'ias Toro, Gabriel Mansilla, Mat\\'ias\n  Nicolai, Santiago Mansilla, Jocelyn Dunstan","authorsParsed":[["Graells-Garrido","Eduardo",""],["Toro","Matías",""],["Mansilla","Gabriel",""],["Nicolai","Matías",""],["Mansilla","Santiago",""],["Dunstan","Jocelyn",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 16:29:35 GMT"}],"updateDate":"2024-08-02","timestamp":1722529775000,"abstract":"  Work-related traffic incidents significantly impact urban mobility and\nproductivity. This study analyzes a decade of work-related traffic incident\ndata (2012--2021) in Santiago, Chile, using records from a major social\ninsurance company. We explore temporal, spatial, and demographic patterns in\nthese incidents in urban and rural areas. We also evaluate the impact of a 2018\nurban speed limit reduction law on incident injury severity. Using negative\nbinomial regression, we assess how various factors, including the speed limit\nchange, affect injury severity measured by prescribed medical leave days.\n  Our analysis reveals distinct incident occurrence and severity patterns\nacross different times, locations, and demographic groups. We find that\nmotorcycles and cycles are associated with more severe injuries, with marginal\neffects of 26.94 and 13.06 additional days of medical leave, respectively,\ncompared to motorized vehicles. Female workers tend to have less severe\ninjuries, with an average of 7.57 fewer days of medical leave. Age is also a\nsignificant factor, with each year associated with 0.57 additional days of\nleave.\n  Notably, the urban speed limit reduction is associated with a decrease of\n4.26 days in prescribed medical leave for incidents in urban areas, suggesting\nthat lower speed limits contribute to reduced injury severity in work-related\ntraffic incidents. Our results provide insights for urban planning,\ntransportation policy, and workplace safety initiatives, highlighting the\npotential benefits of speed management in urban areas for improving road safety\nand minimizing the economic impact of work-related incidents.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}