{"id":"2408.10693","title":"Improved Differential Evolution based Feature Selection through Quantum,\n  Chaos, and Lasso","authors":"Yelleti Vivek, Sri Krishna Vadlamani, Vadlamani Ravi, P. Radha Krishna","authorsParsed":[["Vivek","Yelleti",""],["Vadlamani","Sri Krishna",""],["Ravi","Vadlamani",""],["Krishna","P. Radha",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 09:46:11 GMT"}],"updateDate":"2024-08-21","timestamp":1724147171000,"abstract":"  Modern deep learning continues to achieve outstanding performance on an\nastounding variety of high-dimensional tasks. In practice, this is obtained by\nfitting deep neural models to all the input data with minimal feature\nengineering, thus sacrificing interpretability in many cases. However, in\napplications such as medicine, where interpretability is crucial, feature\nsubset selection becomes an important problem. Metaheuristics such as Binary\nDifferential Evolution are a popular approach to feature selection, and the\nresearch literature continues to introduce novel ideas, drawn from quantum\ncomputing and chaos theory, for instance, to improve them. In this paper, we\ndemonstrate that introducing chaos-generated variables, generated from\nconsiderations of the Lyapunov time, in place of random variables in\nquantum-inspired metaheuristics significantly improves their performance on\nhigh-dimensional medical classification tasks and outperforms other approaches.\nWe show that this chaos-induced improvement is a general phenomenon by\ndemonstrating it for multiple varieties of underlying quantum-inspired\nmetaheuristics. Performance is further enhanced through Lasso-assisted feature\npruning. At the implementation level, we vastly speed up our algorithms through\na scalable island-based computing cluster parallelization technique.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"LBTxKgibj8ouBkh1sNU9bBYDfHLBb96o_6_3Pzw6Uc0","pdfSize":"2857728"}
