{"id":"2408.06118","title":"Analysis of KIC 7023917 -- spotted low-mass ratio eclipsing binary with\n  $\\delta$ Scuti pulsations","authors":"Pavol Gajdo\\v{s}, \\v{S}tefan Parimucha, Marek Skarka, Mat\\'u\\v{s}\n  Kamenec, Jozef Lipt\\'ak, Raine Karjalainen","authorsParsed":[["Gajdoš","Pavol",""],["Parimucha","Štefan",""],["Skarka","Marek",""],["Kamenec","Matúš",""],["Lipták","Jozef",""],["Karjalainen","Raine",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 12:59:54 GMT"}],"updateDate":"2024-08-13","timestamp":1723467594000,"abstract":"  Times of minima of eclipsing binary KIC 7023917 show quasiperiodic\nanti-symmetric deviations from the calculated one with an amplitude of up to 10\nminutes and a period of 200 - 300 days. These changes correlate with the\nobserved variations of the light-curve maxima (amplitude and phase separation).\nWe used photometric data obtained by Kepler and TESS missions to analyse the\ntimes of minima and determine system parameters. The phases and amplitudes of\nthe maxima were measured to study the O'Connell effect. As an additional source\nof information, we performed ground-based multi-colour photometric observation\nand determined the radial velocities of the system from our spectroscopic\nmeasurements. We could explain long-term variations of the light-curve shape\nand times of the eclipses using the cold star spot located on the secondary\ncomponent and the modification of its size. Based on our modelling, the system\nconsists of a primary main-sequence star of spectral type A7 and an evolved,\noversized secondary component with a mass ratio of only 0.1 due to past mass\ntransfer. Calculation of absolute parameters gives us the mass of the primary\ncomponent about 1.8 M$_\\odot$ and 0.2 M$_\\odot$ for the secondary one, and\nradii of 2.2 R$_\\odot$ of the primary star and 0.9 R$_\\odot$ of secondary one,\nrespectively. The studied low-mass ratio eclipsing binary is probably a\nprogenitor of the variable star of EL CVn type. A multiple-period photometric\nvariability was disclosed in the TESS data ranging from half to two hours due\nto $\\delta$ Scuti-type pulsations of the primary component.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"PEgLFax9IYb84VMtcbI9mNgbksn8mfLE9_pdzRxsXYE","pdfSize":"2871981"}
