{"id":"2408.01205","title":"Gravitational Lensing Effects and Observational Behaviors of the\n  Rotating Short-Hairy Black Hole","authors":"Lai Zhao, Meirong Tang, Zhaoyi Xu","authorsParsed":[["Zhao","Lai",""],["Tang","Meirong",""],["Xu","Zhaoyi",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 11:38:08 GMT"}],"updateDate":"2024-08-05","timestamp":1722598688000,"abstract":"  The successful capture of black hole(BH) images by the Event Horizon\nTelescope(EHT) has sparked a surge in research on strong gravitational lensing,\nproviding new methods for studying behavior near the event horizon of BHs. For\nthe short-hair that has significant effects only near the BH event horizon,\nstudying its strong gravitational lensing effects helps to understand the\nnature of this hair. This paper explores the behaviors of the rotating\nshort-hairy BH in strong gravitational lensing. Simulations show that the\nshort-hair parameter results in a smaller event horizon radius, photon sphere,\nand impact parameter compared to the Kerr BH. Moreover, the lensing\ncoefficients $ \\bar{a} $ and $ \\bar{b} $ show opposite trends due to the\nshort-hair parameter $ Q_m $, with the former increasing and the latter\ndecreasing. It is worth mentioning that in certain cases, the short-hair\nparameter can make $ \\bar{b} $ slightly higher than that of the Kerr BH. The\ndeflection angle $ \\alpha_D $ decreases with an increasing impact parameter and\ndiverges at $ u_m $, with the divergent impact parameter of rotating\nshort-hairy BH being smaller than that of the Kerr BH. In the context of\n$M87^*$ and $Sgr A^*$ BHs, their Einstein rings, relativistic images, and time\ndelays differ significantly from those of the Kerr BH. Although current\nequipment cannot yet distinguish these differences, future high-precision\ninstruments are expected to achieve this goal, thereby differentiating rotating\nshort-hairy BH from the Kerr BH, exploring the nature of the short-hair, and\ntesting the no-hair theorem of BH. This provides a new perspective for\nunderstanding the extreme physical environments of BHs and offers necessary\nreferences for future observational and theoretical research.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}