{"id":"2408.04810","title":"UniBench: Visual Reasoning Requires Rethinking Vision-Language Beyond\n  Scaling","authors":"Haider Al-Tahan, Quentin Garrido, Randall Balestriero, Diane\n  Bouchacourt, Caner Hazirbas, Mark Ibrahim","authorsParsed":[["Al-Tahan","Haider",""],["Garrido","Quentin",""],["Balestriero","Randall",""],["Bouchacourt","Diane",""],["Hazirbas","Caner",""],["Ibrahim","Mark",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 01:41:05 GMT"}],"updateDate":"2024-08-12","timestamp":1723167665000,"abstract":"  Significant research efforts have been made to scale and improve\nvision-language model (VLM) training approaches. Yet, with an ever-growing\nnumber of benchmarks, researchers are tasked with the heavy burden of\nimplementing each protocol, bearing a non-trivial computational cost, and\nmaking sense of how all these benchmarks translate into meaningful axes of\nprogress. To facilitate a systematic evaluation of VLM progress, we introduce\nUniBench: a unified implementation of 50+ VLM benchmarks spanning a\ncomprehensive range of carefully categorized capabilities from object\nrecognition to spatial awareness, counting, and much more. We showcase the\nutility of UniBench for measuring progress by evaluating nearly 60 publicly\navailable vision-language models, trained on scales of up to 12.8B samples. We\nfind that while scaling training data or model size can boost many\nvision-language model capabilities, scaling offers little benefit for reasoning\nor relations. Surprisingly, we also discover today's best VLMs struggle on\nsimple digit recognition and counting tasks, e.g. MNIST, which much simpler\nnetworks can solve. Where scale falls short, we find that more precise\ninterventions, such as data quality or tailored-learning objectives offer more\npromise. For practitioners, we also offer guidance on selecting a suitable VLM\nfor a given application. Finally, we release an easy-to-run UniBench code-base\nwith the full set of 50+ benchmarks and comparisons across 59 models as well as\na distilled, representative set of benchmarks that runs in 5 minutes on a\nsingle GPU.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Fo5vYgJBjHoMy-AjmVw0StQ_8S3fVO9CRwSXxPptFW4","pdfSize":"3224465"}
