{"id":"2408.04685","title":"Towards the Socio-Algorithmic Construction of Fairness: The Case of\n  Automatic Price-Surging in Ride-Hailing","authors":"Mateusz Dolata, Gerhard Schwabe","authorsParsed":[["Dolata","Mateusz",""],["Schwabe","Gerhard",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 09:11:12 GMT"}],"updateDate":"2024-08-12","timestamp":1723108272000,"abstract":"  Algorithms take decisions that affect humans, and have been shown to\nperpetuate biases and discrimination. Decisions by algorithms are subject to\ndifferent interpretations. Algorithms' behaviors are basis for the construal of\nmoral assessment and standards. Yet we lack an understanding of how algorithms\nimpact on social construction processes, and vice versa. Without such\nunderstanding, social construction processes may be disrupted and, eventually,\nmay impede moral progress in society. We analyze the public discourse that\nemerged after a significant (five-fold) price-surge following the Brooklyn\nSubway Shooting on April 12, 2022, in New York City. There was much controversy\naround the two ride-hailing firms' algorithms' decisions. The discussions\nevolved around various notions of fairness and the algorithms' decisions'\njustifiability. Our results indicate that algorithms, even if not explicitly\naddressed in the discourse, strongly impact on constructing fairness\nassessments and notions. They initiate the exchange, form people's\nexpectations, evoke people's solidarity with specific groups, and are a vehicle\nfor moral crusading. However, they are also subject to adjustments based on\nsocial forces. We claim that the process of constructing notions of fairness is\nno longer just social; it has become a socio-algorithmic process. We propose a\ntheory of socio-algorithmic construction as a mechanism for establishing\nnotions of fairness and other ethical constructs.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}