{"id":"2408.10895","title":"Analytical and Empirical Study of Herding Effects in Recommendation\n  Systems","authors":"Hong Xie, Mingze Zhong, Defu Lian, Zhen Wang, Enhong Chen","authorsParsed":[["Xie","Hong",""],["Zhong","Mingze",""],["Lian","Defu",""],["Wang","Zhen",""],["Chen","Enhong",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 14:29:23 GMT"}],"updateDate":"2024-08-21","timestamp":1724164163000,"abstract":"  Online rating systems are often used in numerous web or mobile applications,\ne.g., Amazon and TripAdvisor, to assess the ground-truth quality of products.\nDue to herding effects, the aggregation of historical ratings (or historical\ncollective opinion) can significantly influence subsequent ratings, leading to\nmisleading and erroneous assessments. We study how to manage product ratings\nvia rating aggregation rules and shortlisted representative reviews, for the\npurpose of correcting the assessment error. We first develop a mathematical\nmodel to characterize important factors of herding effects in product ratings.\nWe then identify sufficient conditions (via the stochastic approximation\ntheory), under which the historical collective opinion converges to the\nground-truth collective opinion of the whole user population. These conditions\nidentify a class of rating aggregation rules and review selection mechanisms\nthat can reveal the ground-truth product quality. We also quantify the speed of\nconvergence (via the martingale theory), which reflects the efficiency of\nrating aggregation rules and review selection mechanisms. We prove that the\nherding effects slow down the speed of convergence while an accurate review\nselection mechanism can speed it up. We also study the speed of convergence\nnumerically and reveal trade-offs in selecting rating aggregation rules and\nreview selection mechanisms. To show the utility of our framework, we design a\nmaximum likelihood algorithm to infer model parameters from ratings, and\nconduct experiments on rating datasets from Amazon and TripAdvisor. We show\nthat proper recency aware rating aggregation rules can improve the speed of\nconvergence in Amazon and TripAdvisor by 41% and 62% respectively.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"p0A4-CsX0lQ4AmGNKh6ityLOb5r2CqMMgP7F-TMi7tA","pdfSize":"1822978"}
