{"id":"2408.09203","title":"When Gr\\\"unbaum meets Poncelet -- Infinite Classes of Movable $n_4$\n  Configurations","authors":"Leah Wrenn Berman, G\\'abor G\\'evay, J\\\"urgen Richter-Gebert, Serge\n  Tabachnikov","authorsParsed":[["Berman","Leah Wrenn",""],["Gévay","Gábor",""],["Richter-Gebert","Jürgen",""],["Tabachnikov","Serge",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 13:47:07 GMT"}],"updateDate":"2024-08-20","timestamp":1723902427000,"abstract":"  We study relations between $(n_4)$ incidence configurations and the classical\nPoncelet Porism. Poncelet's result studies two conics and a sequence of points\nand lines that inscribes one conic and circumscribes the other. Poncelet's\nPorism states that whether this sequence closes up after $m$ steps only depends\non the conics and not on the initial point of the sequence. In other words:\nPoncelet polygons are movable. We transfer this motion into a flexibility\nstatement about a large class of $(n_4)$ configurations, which are\nconfigurations where 4 (straight) lines pass through each point and four points\nlie on each line. A first instance of such configurations in real geometry had\nbeen given by Gr\\\"unbaum and Rigby in their classical 1990 paper where they\nconstructed the first known real geometric realisation of a well known\ncombinatorial $(21_4)$ configuration (which had been studied by Felix Klein),\nnow called the Gr\\\"unbaum-Rigby configuration. Since then, there has been an\nintensive search for movable $(n_4)$ configurations, but it is very surprising\nthat the Gr\\\"unbaum-Rigby $(21_4)$ configuration admits nontrivial motions. It\nis well-known that the Gr\\\"unbaum-Rigby configuration is the smallest example\nof an infinite class of $(n_4)$ configurations, the trivial celestial\nconfigurations. A major result of this paper is that we show that all trivial\ncelestial configurations are movable via Poncelet's Porism and results about\nproperties of Poncelet grids. Alternative approaches via geometry of billiards,\nin-circle nets, and pentagram maps that relate the subject to discrete\nintegrable systems are given as well.\n","subjects":["Mathematics/Combinatorics","Mathematics/Metric Geometry"],"license":"http://creativecommons.org/licenses/by/4.0/"}