{"id":"2408.08115","title":"Learned denoising with simulated and experimental low-dose CT data","authors":"Maximilian B. Kiss, Ander Biguri, Carola-Bibiane Sch\\\"onlieb, K. Joost\n  Batenburg, Felix Lucka","authorsParsed":[["Kiss","Maximilian B.",""],["Biguri","Ander",""],["Schönlieb","Carola-Bibiane",""],["Batenburg","K. Joost",""],["Lucka","Felix",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 12:24:22 GMT"}],"updateDate":"2024-08-16","timestamp":1723724662000,"abstract":"  Like in many other research fields, recent developments in computational\nimaging have focused on developing machine learning (ML) approaches to tackle\nits main challenges. To improve the performance of computational imaging\nalgorithms, machine learning methods are used for image processing tasks such\nas noise reduction. Generally, these ML methods heavily rely on the\navailability of high-quality data on which they are trained. This work explores\nthe application of ML methods, specifically convolutional neural networks\n(CNNs), in the context of noise reduction for computed tomography (CT) imaging.\nWe utilize a large 2D computed tomography dataset for machine learning to carry\nout for the first time a comprehensive study on the differences between the\nobserved performances of algorithms trained on simulated noisy data and on\nreal-world experimental noisy data. The study compares the performance of two\ncommon CNN architectures, U-Net and MSD-Net, that are trained and evaluated on\nboth simulated and experimental noisy data. The results show that while\nsinogram denoising performed better with simulated noisy data if evaluated in\nthe sinogram domain, the performance did not carry over to the reconstruction\ndomain where training on experimental noisy data shows a higher performance in\ndenoising experimental noisy data. Training the algorithms in an end-to-end\nfashion from sinogram to reconstruction significantly improved model\nperformance, emphasizing the importance of matching raw measurement data to\nhigh-quality CT reconstructions. The study furthermore suggests the need for\nmore sophisticated noise simulation approaches to bridge the gap between\nsimulated and real-world data in CT image denoising applications and gives\ninsights into the challenges and opportunities in leveraging simulated data for\nmachine learning in computational imaging.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}