{"id":"2408.16045","title":"Search for ultralight dark matter in the SuperMAG high-fidelity dataset","authors":"Matt Friel, Jesper W. Gjerloev, Saarik Kalia, Alvaro Zamora","authorsParsed":[["Friel","Matt",""],["Gjerloev","Jesper W.",""],["Kalia","Saarik",""],["Zamora","Alvaro",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-30","timestamp":1724868000000,"abstract":"  Ultralight dark matter, such as kinetically mixed dark-photon dark matter\n(DPDM) or axionlike-particle dark matter (axion DM), can source an oscillating\nmagnetic-field signal at Earth's surface. Previous work searched for this\nsignal in a publicly available dataset of global magnetometer measurements\nmaintained by the SuperMAG collaboration. This \"low-fidelity\" dataset reported\nmeasurements with a 1-minute time resolution, allowing the search to set\nleading direct constraints on DPDM and axion DM with Compton frequencies\n$f_\\mathrm{DM}\\leq1/(1\\,\\mathrm{min})$ [corresponding to masses\n$m_\\mathrm{DM}\\leq7\\times10^{-17}\\,\\mathrm{eV}$]. More recently, a dedicated\nexperiment undertaken by the SNIPE Hunt collaboration has also searched for\nthis same signal at higher frequencies $f_\\mathrm{DM}\\geq0.5\\,\\mathrm{Hz}$ (or\n$m_\\mathrm{DM}\\geq2\\times10^{-15}\\,\\mathrm{eV}$). In this work, we search for\nthis signal of ultralight DM in the SuperMAG \"high-fidelity\" dataset, which\nfeatures a 1-second time resolution, allowing us to probe the gap in parameter\nspace between the low-fidelity dataset and the SNIPE Hunt experiment. The\nhigh-fidelity dataset exhibits lower geomagnetic noise than the low-fidelity\ndataset and features more data than the SNIPE Hunt experiment, making it a\npowerful probe of ultralight DM. Our search finds no robust DPDM or axion DM\ncandidates. We set constraints on DPDM and axion DM parameter space for\n$10^{-3}\\,\\mathrm{Hz}\\leq f_\\mathrm{DM}\\leq0.98\\,\\mathrm{Hz}$ (or\n$4\\times10^{-18}\\,\\mathrm{eV}\\leq\nm_\\mathrm{DM}\\leq4\\times10^{-15}\\,\\mathrm{eV}$). Our results are the leading\ndirect constraints on both DPDM and axion DM in this mass range, and our DPDM\nconstraint surpasses the leading astrophysical constraint in a narrow range\naround $m_{A'}\\approx2\\times10^{-15}\\,\\mathrm{eV}$.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}