{"id":"2408.05288","title":"The impact of internal variability on benchmarking deep learning climate\n  emulators","authors":"Bj\\\"orn L\\\"utjens and Raffaele Ferrari and Duncan Watson-Parris and\n  Noelle Selin","authorsParsed":[["Lütjens","Björn",""],["Ferrari","Raffaele",""],["Watson-Parris","Duncan",""],["Selin","Noelle",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 18:17:17 GMT"}],"updateDate":"2024-08-13","timestamp":1723227437000,"abstract":"  Full-complexity Earth system models (ESMs) are computationally very\nexpensive, limiting their use in exploring the climate outcomes of multiple\nemission pathways. More efficient emulators that approximate ESMs can directly\nmap emissions onto climate outcomes, and benchmarks are being used to evaluate\ntheir accuracy on standardized tasks and datasets. We investigate a popular\nbenchmark in data-driven climate emulation, ClimateBench, on which deep\nlearning-based emulators are currently achieving the best performance. We\nimplement a linear regression-based emulator, akin to pattern scaling, and find\nthat it outperforms the incumbent 100M-parameter deep learning foundation\nmodel, ClimaX, on 3 out of 4 regionally-resolved surface-level climate\nvariables. While emulating surface temperature is expected to be predominantly\nlinear, this result is surprising for emulating precipitation. We identify that\nthis outcome is a result of high levels of internal variability in the\nbenchmark targets. To address internal variability, we update the benchmark\ntargets with ensemble averages from the MPI-ESM1.2-LR model that contain 50\ninstead of 3 climate simulations per emission pathway. Using the new targets,\nwe show that linear pattern scaling continues to be more accurate on\ntemperature, but can be outperformed by a deep learning-based model for\nemulating precipitation. We publish our code, data, and an interactive tutorial\nat github.com/blutjens/climate-emulator.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}