{"id":"2408.03954","title":"Histopathology image embedding based on foundation models features\n  aggregation for patient treatment response prediction","authors":"Bilel Guetarni, Feryal Windal, Halim Benhabiles, Mahfoud Chaibi,\n  Romain Dubois, Emmanuelle Leteurtre, Dominique Collard","authorsParsed":[["Guetarni","Bilel",""],["Windal","Feryal",""],["Benhabiles","Halim",""],["Chaibi","Mahfoud",""],["Dubois","Romain",""],["Leteurtre","Emmanuelle",""],["Collard","Dominique",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 13:31:12 GMT"}],"updateDate":"2024-08-09","timestamp":1721741472000,"abstract":"  Predicting the response of a patient to a cancer treatment is of high\ninterest. Nonetheless, this task is still challenging from a medical point of\nview due to the complexity of the interaction between the patient organism and\nthe considered treatment. Recent works on foundation models pre-trained with\nself-supervised learning on large-scale unlabeled histopathology datasets have\nopened a new direction towards the development of new methods for cancer\ndiagnosis related tasks. In this article, we propose a novel methodology for\npredicting Diffuse Large B-Cell Lymphoma patients treatment response from Whole\nSlide Images. Our method exploits several foundation models as feature\nextractors to obtain a local representation of the image corresponding to a\nsmall region of the tissue, then, a global representation of the image is\nobtained by aggregating these local representations using attention-based\nMultiple Instance Learning. Our experimental study conducted on a dataset of\n152 patients, shows the promising results of our methodology, notably by\nhighlighting the advantage of using foundation models compared to conventional\nImageNet pre-training. Moreover, the obtained results clearly demonstrates the\npotential of foundation models for characterizing histopathology images and\ngenerating more suited semantic representation for this task.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}