{"id":"2408.13409","title":"Leveraging external data in the analysis of randomized controlled\n  trials: a comparative analysis","authors":"Gopal Kotecha, Daniel E. Schwartz, Steffen Ventz, Lorenzo Trippa","authorsParsed":[["Kotecha","Gopal",""],["Schwartz","Daniel E.",""],["Ventz","Steffen",""],["Trippa","Lorenzo",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 23:33:05 GMT"}],"updateDate":"2024-08-27","timestamp":1724455985000,"abstract":"  The use of patient-level information from previous studies, registries, and\nother external datasets can support the analysis of single-arm and randomized\nclinical trials to evaluate and test experimental treatments. However, the\nintegration of external data in the analysis of clinical trials can also\ncompromise the scientific validity of the results due to selection bias,\nstudy-to-study differences, unmeasured confounding, and other distortion\nmechanisms. Therefore, leveraging external data in the analysis of a clinical\ntrial requires the use of appropriate methods that can detect, prevent or\nmitigate the risks of bias and potential distortion mechanisms. We review\nseveral methods that have been previously proposed to leverage external\ndatasets, such as matching procedures or random effects modeling. Different\nmethods present distinct trade-offs between risks and efficiencies. We conduct\na comparative analysis of statistical methods to leverage external data and\nanalyze randomized clinical trials. Multiple operating characteristics are\ndiscussed, such as the control of false positive results, power, and the bias\nof the treatment effect estimates, across candidate statistical methods. We\ncompare the statistical methods through a broad set of simulation scenarios. We\nthen compare the methods using a collection of datasets with individual\npatient-level information from several glioblastoma studies in order to provide\nrecommendations for future glioblastoma trials.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}