{"id":"2408.11754","title":"Improving the Scan-rescan Precision of AI-based CMR Biomarker Estimation","authors":"Dewmini Hasara Wickremasinghe, Yiyang Xu, Esther Puyol-Ant\\'on, Paul\n  Aljabar, Reza Razavi, Andrew P. King","authorsParsed":[["Wickremasinghe","Dewmini Hasara",""],["Xu","Yiyang",""],["Puyol-Antón","Esther",""],["Aljabar","Paul",""],["Razavi","Reza",""],["King","Andrew P.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 16:24:27 GMT"}],"updateDate":"2024-08-22","timestamp":1724257467000,"abstract":"  Quantification of cardiac biomarkers from cine cardiovascular magnetic\nresonance (CMR) data using deep learning (DL) methods offers many advantages,\nsuch as increased accuracy and faster analysis. However, only a few studies\nhave focused on the scan-rescan precision of the biomarker estimates, which is\nimportant for reproducibility and longitudinal analysis. Here, we propose a\ncardiac biomarker estimation pipeline that not only focuses on achieving high\nsegmentation accuracy but also on improving the scan-rescan precision of the\ncomputed biomarkers, namely left and right ventricular ejection fraction, and\nleft ventricular myocardial mass. We evaluate two approaches to improve the\napical-basal resolution of the segmentations used for estimating the\nbiomarkers: one based on image interpolation and one based on segmentation\ninterpolation. Using a database comprising scan-rescan cine CMR data acquired\nfrom 92 subjects, we compare the performance of these two methods against\nground truth (GT) segmentations and DL segmentations obtained before\ninterpolation (baseline). The results demonstrate that both the image-based and\nsegmentation-based interpolation methods were able to narrow Bland-Altman\nscan-rescan confidence intervals for all biomarkers compared to the GT and\nbaseline performances. Our findings highlight the importance of focusing not\nonly on segmentation accuracy but also on the consistency of biomarkers across\nrepeated scans, which is crucial for longitudinal analysis of cardiac function.\n","subjects":["Quantitative Biology/Quantitative Methods","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tEyyBxIpi3fb9gyIQEq9KQwJSUD1oBsG6eLe9FFLrC0","pdfSize":"2419945"}
