{"id":"2408.12682","title":"MultiMed: Massively Multimodal and Multitask Medical Understanding","authors":"Shentong Mo, Paul Pu Liang","authorsParsed":[["Mo","Shentong",""],["Liang","Paul Pu",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 18:41:36 GMT"}],"updateDate":"2024-08-26","timestamp":1724352096000,"abstract":"  Biomedical data is inherently multimodal, consisting of electronic health\nrecords, medical imaging, digital pathology, genome sequencing, wearable\nsensors, and more. The application of artificial intelligence tools to these\nmultifaceted sensing technologies has the potential to revolutionize the\nprognosis, diagnosis, and management of human health and disease. However,\ncurrent approaches to biomedical AI typically only train and evaluate with one\nor a small set of medical modalities and tasks. This limitation hampers the\ndevelopment of comprehensive tools that can leverage the rich interconnected\ninformation across many heterogeneous biomedical sensors. To address this\nchallenge, we present MultiMed, a benchmark designed to evaluate and enable\nlarge-scale learning across a wide spectrum of medical modalities and tasks.\nMultiMed consists of 2.56 million samples across ten medical modalities such as\nmedical reports, pathology, genomics, and protein data, and is structured into\neleven challenging tasks, including disease prognosis, protein structure\nprediction, and medical question answering. Using MultiMed, we conduct\ncomprehensive experiments benchmarking state-of-the-art unimodal, multimodal,\nand multitask models. Our analysis highlights the advantages of training\nlarge-scale medical models across many related modalities and tasks. Moreover,\nMultiMed enables studies of generalization across related medical concepts,\nrobustness to real-world noisy data and distribution shifts, and novel modality\ncombinations to improve prediction performance. MultiMed will be publicly\navailable and regularly updated and welcomes inputs from the community.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}