{"id":"2408.12232","title":"BihoT: A Large-Scale Dataset and Benchmark for Hyperspectral Camouflaged\n  Object Tracking","authors":"Hanzheng Wang, Wei Li, Xiang-Gen Xia, and Qian Du","authorsParsed":[["Wang","Hanzheng",""],["Li","Wei",""],["Xia","Xiang-Gen",""],["Du","Qian",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 09:07:51 GMT"}],"updateDate":"2024-08-23","timestamp":1724317671000,"abstract":"  Hyperspectral object tracking (HOT) has exhibited potential in various\napplications, particularly in scenes where objects are camouflaged. Existing\ntrackers can effectively retrieve objects via band regrouping because of the\nbias in existing HOT datasets, where most objects tend to have distinguishing\nvisual appearances rather than spectral characteristics. This bias allows the\ntracker to directly use the visual features obtained from the false-color\nimages generated by hyperspectral images without the need to extract spectral\nfeatures. To tackle this bias, we find that the tracker should focus on the\nspectral information when object appearance is unreliable. Thus, we provide a\nnew task called hyperspectral camouflaged object tracking (HCOT) and\nmeticulously construct a large-scale HCOT dataset, termed BihoT, which consists\nof 41,912 hyperspectral images covering 49 video sequences. The dataset covers\nvarious artificial camouflage scenes where objects have similar appearances,\ndiverse spectrums, and frequent occlusion, making it a very challenging dataset\nfor HCOT. Besides, a simple but effective baseline model, named spectral\nprompt-based distractor-aware network (SPDAN), is proposed, comprising a\nspectral embedding network (SEN), a spectral prompt-based backbone network\n(SPBN), and a distractor-aware module (DAM). Specifically, the SEN extracts\nspectral-spatial features via 3-D and 2-D convolutions. Then, the SPBN\nfine-tunes powerful RGB trackers with spectral prompts and alleviates the\ninsufficiency of training samples. Moreover, the DAM utilizes a novel statistic\nto capture the distractor caused by occlusion from objects and background.\nExtensive experiments demonstrate that our proposed SPDAN achieves\nstate-of-the-art performance on the proposed BihoT and other HOT datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}