{"id":"2408.00963","title":"MIS-ME: A Multi-modal Framework for Soil Moisture Estimation","authors":"Mohammed Rakib, Adil Aman Mohammed, D. Cole Diggins, Sumit Sharma,\n  Jeff Michael Sadler, Tyson Ochsner, Arun Bagavathi","authorsParsed":[["Rakib","Mohammed",""],["Mohammed","Adil Aman",""],["Diggins","D. Cole",""],["Sharma","Sumit",""],["Sadler","Jeff Michael",""],["Ochsner","Tyson",""],["Bagavathi","Arun",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 00:35:18 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 23:00:47 GMT"},{"version":"v3","created":"Wed, 21 Aug 2024 14:47:26 GMT"}],"updateDate":"2024-08-22","timestamp":1722558918000,"abstract":"  Soil moisture estimation is an important task to enable precision agriculture\nin creating optimal plans for irrigation, fertilization, and harvest. It is\ncommon to utilize statistical and machine learning models to estimate soil\nmoisture from traditional data sources such as weather forecasts, soil\nproperties, and crop properties. However, there is a growing interest in\nutilizing aerial and geospatial imagery to estimate soil moisture. Although\nthese images capture high-resolution crop details, they are expensive to curate\nand challenging to interpret. Imagine, an AI-enhanced software tool that\npredicts soil moisture using visual cues captured by smartphones and\nstatistical data given by weather forecasts. This work is a first step towards\nthat goal of developing a multi-modal approach for soil moisture estimation. In\nparticular, we curate a dataset consisting of real-world images taken from\nground stations and their corresponding weather data. We also propose MIS-ME -\nMeteorological & Image based Soil Moisture Estimator, a multi-modal framework\nfor soil moisture estimation. Our extensive analysis shows that MIS-ME achieves\na MAPE of 10.14%, outperforming traditional unimodal approaches with a\nreduction of 3.25% in MAPE for meteorological data and 2.15% in MAPE for image\ndata, highlighting the effectiveness of tailored multi-modal approaches. Our\ncode and dataset will be available at\nhttps://github.com/OSU-Complex-Systems/MIS-ME.git.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6Xdj2QR7h82tmoKNK60FU_xTzzfqeXENyJRoZIYb4Sg","pdfSize":"10121803"}
