{"id":"2408.10857","title":"New horizon in the statistical physics of earthquakes: Dragon-king\n  theory and dragon-king earthquakes","authors":"Jiawei Li, Didier Sornette, Zhongliang Wu, Hangwei Li","authorsParsed":[["Li","Jiawei",""],["Sornette","Didier",""],["Wu","Zhongliang",""],["Li","Hangwei",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 13:48:05 GMT"}],"updateDate":"2024-08-21","timestamp":1724161685000,"abstract":"  A systematic quantitative investigation into whether the mechanisms of large\nearthquakes are unique could significantly deepen our understanding of fault\nrupture and seismicity patterns. This research holds the potential to advance\nour ability to predict large earthquakes and enhance the effectiveness of\ndisaster prevention and mitigation strategies. In 2009, one of us introduced\nthe dragon-king theory, offering a quantitative framework for identifying and\ntesting extreme outliers-referred to as dragon-king events-that are\nendogenously generated. This theory provides valuable tools for explaining,\npredicting, and managing the risks associated with these rare but highly\nimpactful events. The present paper discusses the feasibility of applying this\ntheory to seismology, proposing that dragon-king earthquake events can be\nidentified as outliers to the Gutenberg-Richter law. It also examines several\nseismological mechanisms that may contribute to the occurrence of these\nextraordinary events. Although applying the dragon-king theory to seismology\npresents practical challenges, it offers the potential to significantly enrich\nstatistical seismology. By reexamining the classification of earthquake rupture\ntypes through a statistical testing lens and integrating these insights with\nunderlying physical mechanisms, this approach can greatly enhance the\nanalytical tools and depth of research in the field of statistical seismology.\n","subjects":["Physics/Geophysics","Physics/Data Analysis, Statistics and Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}