{"id":"2408.05688","title":"Bank Cost Efficiency and Credit Market Structure Under a Volatile\n  Exchange Rate","authors":"Mikhail Mamonov, Christopher Parmeter, Artem Prokhorov","authorsParsed":[["Mamonov","Mikhail",""],["Parmeter","Christopher",""],["Prokhorov","Artem",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 03:49:26 GMT"}],"updateDate":"2024-08-13","timestamp":1723348166000,"abstract":"  We study the impact of exchange rate volatility on cost efficiency and market\nstructure in a cross-section of banks that have non-trivial exposures to\nforeign currency (FX) operations. We use unique data on quarterly revaluations\nof FX assets and liabilities (Revals) that Russian banks were reporting between\n2004 Q1 and 2020 Q2. {\\it First}, we document that Revals constitute the\nlargest part of the banks' total costs, 26.5\\% on average, with considerable\nvariation across banks. {\\it Second}, we find that stochastic estimates of cost\nefficiency are both severely downward biased -- by 30\\% on average -- and\ngenerally not rank preserving when Revals are ignored, except for the tails, as\nour nonparametric copulas reveal. To ensure generalizability to other emerging\nmarket economies, we suggest a two-stage approach that does not rely on Revals\nbut is able to shrink the downward bias in cost efficiency estimates by\ntwo-thirds. {\\it Third}, we show that Revals are triggered by the mismatch in\nthe banks' FX operations, which, in turn, is driven by household FX deposits\nand the instability of Ruble's exchange rate. {\\it Fourth}, we find that the\nfailure to account for Revals leads to the erroneous conclusion that the credit\nmarket is inefficient, which is driven by the upper quartile of the banks'\ndistribution by total assets. Revals have considerable negative implications\nfor financial stability which can be attenuated by the cross-border\ndiversification of bank assets.\n","subjects":["Economics/Econometrics","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"30VS2LWz5cVZBzym89dpOowb9ryK-idxtvm9IWUUDXI","pdfSize":"1740144"}
