{"id":"2408.14167","title":"Thermal treatment effects on PMN-0.4PT/Fe multiferroic heterostructures","authors":"Deepak Dagur, Alice Margherita Finardi, Vincent Polewczyk, Aleksandr\n  Yu. Petrov, Simone Dolabella, Federico Motti, Hemanita Sharma, Edvard\n  Dobovicnik, Andrea Giugni, Giorgio Rossi, Claudia Fasolato, Piero Torelli,\n  and Giovanni Vinai","authorsParsed":[["Dagur","Deepak",""],["Finardi","Alice Margherita",""],["Polewczyk","Vincent",""],["Petrov","Aleksandr Yu.",""],["Dolabella","Simone",""],["Motti","Federico",""],["Sharma","Hemanita",""],["Dobovicnik","Edvard",""],["Giugni","Andrea",""],["Rossi","Giorgio",""],["Fasolato","Claudia",""],["Torelli","Piero",""],["Vinai","Giovanni",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 10:26:05 GMT"}],"updateDate":"2024-08-27","timestamp":1724667965000,"abstract":"  Multiferroic heterostructures have gained in recent years a renewed role in\nspintronic applications due to their possibility in controlling the magnetic\nproperties via interfacial coupling by exploiting the ferroelectric response to\nvarious external stimuli. Whereas the main mechanisms ruling the converse\nmagnetoelectric coupling are considered as established, the research on how to\noptimize the ferroelectric properties is an active field. In particular the\ncomplex phase diagram of [Pb(Mg1/3Nb2/3)O3]-x[PbTiO3] (PMN-xPT) single\ncrystals, that present relaxor ferroelectric and photovoltaic properties,\ndeserves further investigation. For instance, crystalline quality and thermal\nstability of the ferroelectric domains in heterostructures need assessment.\nHere we show how, by thermal annealing over the ferroelectric Curie temperature\nand then cooling PMN-0.4PT/Fe heterostructures in inert atmosphere the domain\npopulation is significantly modified, evolving from a highly disordered, mostly\nout-of-plane domain population, to improved crystallinity and prevalent\nin-plane oriented domains. Upon further annealing, the domain population\nswitches back to prevalent out-of-plane orientation suggesting that\nintermediate annealing steps can freeze PMN-0.4PT domain population in a\nmetastable configuration. The structural analysis was carried out by combining\nmicro-Raman and X-ray diffraction (XRD) measurements. In the three states the\nmagnetic properties of interfacial Fe thin film are affected by the\nferroelectric configurations as a consequence of changing interfacial strain,\nevolving from an isotropic behavior to an anisotropic one and back.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zFSv9fEW0uSdIrW9XReLd8xHBVjnoRcYymod6QxG23c","pdfSize":"1732969"}
