{"id":"2408.14562","title":"A Survey of Camouflaged Object Detection and Beyond","authors":"Fengyang Xiao, Sujie Hu, Yuqi Shen, Chengyu Fang, Jinfa Huang,\n  Chunming He, Longxiang Tang, Ziyun Yang and Xiu Li","authorsParsed":[["Xiao","Fengyang",""],["Hu","Sujie",""],["Shen","Yuqi",""],["Fang","Chengyu",""],["Huang","Jinfa",""],["He","Chunming",""],["Tang","Longxiang",""],["Yang","Ziyun",""],["Li","Xiu",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 18:23:22 GMT"}],"updateDate":"2024-08-28","timestamp":1724696602000,"abstract":"  Camouflaged Object Detection (COD) refers to the task of identifying and\nsegmenting objects that blend seamlessly into their surroundings, posing a\nsignificant challenge for computer vision systems. In recent years, COD has\ngarnered widespread attention due to its potential applications in\nsurveillance, wildlife conservation, autonomous systems, and more. While\nseveral surveys on COD exist, they often have limitations in terms of the\nnumber and scope of papers covered, particularly regarding the rapid\nadvancements made in the field since mid-2023. To address this void, we present\nthe most comprehensive review of COD to date, encompassing both theoretical\nframeworks and practical contributions to the field. This paper explores\nvarious COD methods across four domains, including both image-level and\nvideo-level solutions, from the perspectives of traditional and deep learning\napproaches. We thoroughly investigate the correlations between COD and other\ncamouflaged scenario methods, thereby laying the theoretical foundation for\nsubsequent analyses. Beyond object-level detection, we also summarize extended\nmethods for instance-level tasks, including camouflaged instance segmentation,\ncounting, and ranking. Additionally, we provide an overview of commonly used\nbenchmarks and evaluation metrics in COD tasks, conducting a comprehensive\nevaluation of deep learning-based techniques in both image and video domains,\nconsidering both qualitative and quantitative performance. Finally, we discuss\nthe limitations of current COD models and propose 9 promising directions for\nfuture research, focusing on addressing inherent challenges and exploring\nnovel, meaningful technologies. For those interested, a curated list of\nCOD-related techniques, datasets, and additional resources can be found at\nhttps://github.com/ChunmingHe/awesome-concealed-object-segmentation\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}