{"id":"2408.10633","title":"Interactive Counterfactual Generation for Univariate Time Series","authors":"Udo Schlegel, Julius Rauscher, Daniel A. Keim","authorsParsed":[["Schlegel","Udo",""],["Rauscher","Julius",""],["Keim","Daniel A.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 08:19:55 GMT"}],"updateDate":"2024-08-21","timestamp":1724141995000,"abstract":"  We propose an interactive methodology for generating counterfactual\nexplanations for univariate time series data in classification tasks by\nleveraging 2D projections and decision boundary maps to tackle interpretability\nchallenges. Our approach aims to enhance the transparency and understanding of\ndeep learning models' decision processes. The application simplifies the time\nseries data analysis by enabling users to interactively manipulate projected\ndata points, providing intuitive insights through inverse projection\ntechniques. By abstracting user interactions with the projected data points\nrather than the raw time series data, our method facilitates an intuitive\ngeneration of counterfactual explanations. This approach allows for a more\nstraightforward exploration of univariate time series data, enabling users to\nmanipulate data points to comprehend potential outcomes of hypothetical\nscenarios. We validate this method using the ECG5000 benchmark dataset,\ndemonstrating significant improvements in interpretability and user\nunderstanding of time series classification. The results indicate a promising\ndirection for enhancing explainable AI, with potential applications in various\ndomains requiring transparent and interpretable deep learning models. Future\nwork will explore the scalability of this method to multivariate time series\ndata and its integration with other interpretability techniques.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XISfCTusqtRtMpiuOwIVbZ42FAO_TbYv-37gN5ftoUE","pdfSize":"2071443"}
