{"id":"2408.02535","title":"Towards Coarse-grained Visual Language Navigation Task Planning Enhanced\n  by Event Knowledge Graph","authors":"Zhao Kaichen, Song Yaoxian, Zhao Haiquan, Liu Haoyu, Li Tiefeng, Li\n  Zhixu","authorsParsed":[["Kaichen","Zhao",""],["Yaoxian","Song",""],["Haiquan","Zhao",""],["Haoyu","Liu",""],["Tiefeng","Li",""],["Zhixu","Li",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 15:08:26 GMT"}],"updateDate":"2024-08-06","timestamp":1722870506000,"abstract":"  Visual language navigation (VLN) is one of the important research in embodied\nAI. It aims to enable an agent to understand the surrounding environment and\ncomplete navigation tasks. VLN instructions could be categorized into\ncoarse-grained and fine-grained commands. Fine-grained command describes a\nwhole task with subtasks step-by-step. In contrast, coarse-grained command\ngives an abstract task description, which more suites human habits. Most\nexisting work focuses on the former kind of instruction in VLN tasks, ignoring\nthe latter abstract instructions belonging to daily life scenarios. To overcome\nthe above challenge in abstract instruction, we attempt to consider\ncoarse-grained instruction in VLN by event knowledge enhancement. Specifically,\nwe first propose a prompt-based framework to extract an event knowledge graph\n(named VLN-EventKG) for VLN integrally over multiple mainstream benchmark\ndatasets. Through small and large language model collaboration, we realize\nknowledge-enhanced navigation planning (named EventNav) for VLN tasks with\ncoarse-grained instruction input. Additionally, we design a novel dynamic\nhistory backtracking module to correct potential error action planning in real\ntime. Experimental results in various public benchmarks show our\nknowledge-enhanced method has superiority in coarse-grained-instruction VLN\nusing our proposed VLN-EventKG with over $5\\%$ improvement in success rate. Our\nproject is available at https://sites.google.com/view/vln-eventkg\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"QPTVjTTBQwrYenCnaN1lPPYZwlEEsK1gtwdjhQ8aFGk","pdfSize":"5266543","txDigest":"HxE6Q68mNi4JWZvoi99cUQ37GHTK9drShqd9dUKnP6m4","endEpoch":"1","status":"CERTIFIED"}
