{"id":"2408.13219","title":"Bending the web: exploring the impact of modified gravity on the density\n  field and halo properties within the cosmic web","authors":"Suhani Gupta, Simon Pfeifer, Punyakoti Ganeshaiah Veena, Wojciech A.\n  Hellwing","authorsParsed":[["Gupta","Suhani",""],["Pfeifer","Simon",""],["Veena","Punyakoti Ganeshaiah",""],["Hellwing","Wojciech A.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 16:54:38 GMT"}],"updateDate":"2024-08-26","timestamp":1724432078000,"abstract":"  This work investigates the impact of different Modified Gravity (MG) models\non the large-scale structures (LSS) properties in relation to the cosmic web\n(CW), using N-body simulations of f(R) and nDGP models. We analyse the impact\nof the MG effect on the density field through density distribution and\nclustering statistics, and assess its influence on halo properties by examining\nthe halo mass function and spin. We find that the PDF of dark matter density\nfields shift towards lower densities for stronger variants of f(R) and nDGP.\nAdditionally, when segregated into CW environments, the stronger variants show\na higher mean density in knots, and a lower mean density in voids compared to\nLCDM. For higher-order clustering statistics relative to LCDM, the\nscale-dependent f(R) variants exhibit a greater non-monotonic deviation as a\nfunction of scale when segregated into environments, compared to nDGP.\nAdditionally, the halo mass function separated into CW environments shows a\nsimilar behaviour, introducing complex trends as a function of mass for f(R)\nand nDGP models. We also report up to a 15% enhancement in the angular momentum\nof halos in f(R) gravity models compared to LCDM, with similar differences when\nconsidering environmental segregation. We demonstrate that this difference in\nthe spin arises largely due to different tidal torquing across the various MG\nmodels. Therefore, studying higher-order statistics of the cosmological fields\nand halo properties separated into CW components probes the additional physics\ncontained within the MG models. We conclude that considering the effect of CW\nin MG studies increases the constraining power of these LSS statistics, and can\nfurther aid the distinction between the cosmologies that have an identical\nexpansion history to the standard LCDM but differing underlying physics, such\nas the MG models presented in this work.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}