{"id":"2408.16940","title":"Manipulating OpenFlow Link Discovery Packet Forwarding for Topology\n  Poisoning","authors":"Mingming Chen, Thomas La Porta, Teryl Taylor, Frederico Araujo, Trent\n  Jaeger","authorsParsed":[["Chen","Mingming",""],["La Porta","Thomas",""],["Taylor","Teryl",""],["Araujo","Frederico",""],["Jaeger","Trent",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 23:30:36 GMT"}],"updateDate":"2024-09-02","timestamp":1724974236000,"abstract":"  Software-defined networking (SDN) is a centralized, dynamic, and programmable\nnetwork management technology that enables flexible traffic control and\nscalability. SDN facilitates network administration through a centralized view\nof the underlying physical topology; tampering with this topology view can\nresult in catastrophic damage to network management and security. To underscore\nthis issue, we introduce Marionette, a new topology poisoning technique that\nmanipulates OpenFlow link discovery packet forwarding to alter topology\ninformation. Our approach exposes an overlooked yet widespread attack vector,\ndistinguishing itself from traditional link fabrication attacks that tamper,\nspoof, or relay discovery packets at the data plane. Unlike localized attacks\nobserved in existing methods, our technique introduces a globalized topology\npoisoning attack that leverages control privileges. Marionette implements a\nreinforcement learning algorithm to compute a poisoned topology target, and\ninjects flow entries to achieve a long-lived stealthy attack. Our evaluation\nshows that Marionette successfully attacks five open-source controllers and\nnine OpenFlow-based discovery protocols. Marionette overcomes the\nstate-of-the-art topology poisoning defenses, showcasing a new class of\ntopology poisoning that initiates on the control plane. This security\nvulnerability was ethically disclosed to OpenDaylight, and CVE-2024-37018 has\nbeen assigned.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}