{"id":"2408.04896","title":"A Method of Rapidly Deriving Late-type Contact Binary Parameters and Its\n  Application in the Catalina Sky Survey","authors":"JinLiang Wang, Xu Ding, JiaJia Li, JianPing Xiong, Qiyuan Cheng, and\n  KaiFan Ji","authorsParsed":[["Wang","JinLiang",""],["Ding","Xu",""],["Li","JiaJia",""],["Xiong","JianPing",""],["Cheng","Qiyuan",""],["Ji","KaiFan",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 06:47:22 GMT"}],"updateDate":"2024-08-12","timestamp":1723186042000,"abstract":"  With the continuous development of large optical surveys, a large number of\nlight curves of late-type contact binary systems (CBs) have been released.\nDeriving parameters for CBs using the the WD program and the PHOEBE program\nposes a challenge. Therefore, this study developed a method for rapidly\nderiving light curves based on the Neural Networks (NN) model combined with the\nHamiltonian Monte Carlo (HMC) algorithm (NNHMC). The neural network was\nemployed to establish the mapping relationship between the parameters and the\npregenerated light curves by the PHOEBE program, and the HMC algorithm was used\nto obtain the posterior distribution of the parameters. The NNHMC method was\napplied to a large contact binary sample from the Catalina Sky Survey, and a\ntotal of 19,104 late-type contact binary parameters were derived. Among them,\n5172 have an inclination greater than 70 deg and a temperature difference less\nthan 400 K. The obtained results were compared with the previous studies for 30\nCBs, and there was an essentially consistent goodness-of-fit (R2) distribution\nbetween them. The NNHMC method possesses the capability to simultaneously\nderive parameters for a vast number of targets. Furthermore, it can provide an\nextremely efficient tool for rapid derivation of parameters in future sky\nsurveys involving large samples of CBs.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}