{"id":"2408.11386","title":"Unlocking Sustainability Compliance: Characterizing the EU Taxonomy for\n  Business Process Management","authors":"Finn Klessascheck, Stephan A. Fahrenkrog-Petersen, Jan Mendling, Luise\n  Pufahl","authorsParsed":[["Klessascheck","Finn",""],["Fahrenkrog-Petersen","Stephan A.",""],["Mendling","Jan",""],["Pufahl","Luise",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 07:30:11 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 12:08:04 GMT"}],"updateDate":"2024-09-13","timestamp":1724225411000,"abstract":"  To promote sustainable business practices, and to achieve climate neutrality\nby 2050, the EU has developed the taxonomy of sustainable activities, which\ndescribes when exactly business practices can be considered sustainable. While\nthe taxonomy has only been recently established, progressively more companies\nwill have to report how much of their revenue was created via sustainably\nexecuted business processes. To help companies prepare to assess whether their\nbusiness processes comply with the constraints outlined in the taxonomy, we\ninvestigate in how far these criteria can be used for conformance checking,\nthat is, assessing in a data-driven manner, whether business process executions\nadhere to regulatory constraints. For this, we develop a few-shot learning\npipeline to characterize the constraints of the taxonomy with the help of an\nLLM as to the process dimensions they relate to. We find that many constraints\nof the taxonomy are useable for conformance checking, particularly in the\nsectors of energy, manufacturing, and transport. This will aid companies in\npreparing to monitor regulatory compliance with the taxonomy automatically, by\ncharacterizing what kind of information they need to extract, and by providing\na better understanding of sectors where such an assessment is feasible and\nwhere it is not.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_wFrahiIzgNnzYejtlI8eflRV2cfZWDn-9s8mzW8sOw","pdfSize":"2389556"}
