{"id":"2408.00834","title":"Variational wave-functions for correlated metals","authors":"Ankush Chaubey, Harsh Nigam, Subhro Bhattacharjee, and K. Sengupta","authorsParsed":[["Chaubey","Ankush",""],["Nigam","Harsh",""],["Bhattacharjee","Subhro",""],["Sengupta","K.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 18:00:02 GMT"}],"updateDate":"2024-08-05","timestamp":1722535202000,"abstract":"  We study a set of many-body wave-functions of Fermions that are naturally\nwritten using momentum space basis and allow for quantum superposition of\nFermion occupancy, $\\{n_{\\bf k}\\}$. This {enables} us to capture the\nfluctuations of the Fermi-surface {(FS)} -- the singularly most important\nsignature of a metal. We bench-mark our results in one spatial dimensions (1D)\nto show that these wave-functions allow for quantitative understanding of the\nTomonaga-Luttinger liquid (TLL); computations of certain correlators using them\ncan in fact be extended to larger systems sizes compared to conventional exact\ndiagonalization (ED) allowing for a more systematic comparison with\nbosonization techniques. Finally we show that this basis may be useful for\nobtaining fixed-point wave-function for strongly correlated metals {in\ndimensions greater that one}. In particular, we study the case of coherent\n(equal) superposition of elliptical FS {in continuum (2D) and on a} square\nlattice{. In case of the former, our variational wave-function systematically\ninterpolates between the phenomenology of the Fermi liquid ground state, i.e.,\nfinite single-Fermion residue at a sharp FS, to a non-Fermi liquid (NFL) with\nzero residue. In the NFL the jump in $\\langle n_{\\bf k}\\rangle$ at the FS is\nreplaced by a point of inflection (similar to a 1D TLL) whose contour is\nconsistent with the Luttinger Theorem. In case of the square lattice, we} find\nhighly anisotropic distribution of the quasi-particle residue, which, at finite\nresolution has an uncanny resemblance to the Fermi-arcs{, albeit at zero\ntemperature,} seen in the pseudo-gap state of the cuprates.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZdwuxhpmiAl71GGKMUNj6l1rhMDkUM4jTrjE1lRhoww","pdfSize":"9593705","txDigest":"CRoHP8qAHMqgYkAKWE7EnFSAFhJ3e6YZfkPgWUtzcqjJ","endEpoch":"1","status":"CERTIFIED"}
