{"id":"2408.11906","title":"Time-Evolution Images of the Hypergiant RW Cephei During the\n  Re-brightening Phase Following the Great Dimming","authors":"Narsireddy Anugu, Douglas R. Gies, Rachael M. Roettenbacher, John D.\n  Monnier, Miguel Montarg\\'es, Antoine M\\'erand, Fabien Baron, Gail H.\n  Schaefer, Katherine A. Shepard, Stefan Kraus, Matthew D. Anderson, Isabelle\n  Codron, Tyler Gardner, Mayra Gutierrez, Rainer K\\\"ohler, Karolina Kubiak,\n  Cyprien Lanthermann, Olli Majoinen, Nicholas J. Scott, Wolfgang Vollmann","authorsParsed":[["Anugu","Narsireddy",""],["Gies","Douglas R.",""],["Roettenbacher","Rachael M.",""],["Monnier","John D.",""],["Montargés","Miguel",""],["Mérand","Antoine",""],["Baron","Fabien",""],["Schaefer","Gail H.",""],["Shepard","Katherine A.",""],["Kraus","Stefan",""],["Anderson","Matthew D.",""],["Codron","Isabelle",""],["Gardner","Tyler",""],["Gutierrez","Mayra",""],["Köhler","Rainer",""],["Kubiak","Karolina",""],["Lanthermann","Cyprien",""],["Majoinen","Olli",""],["Scott","Nicholas J.",""],["Vollmann","Wolfgang",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 18:00:46 GMT"}],"updateDate":"2024-08-23","timestamp":1724263246000,"abstract":"  Stars with initial masses larger than 8 solar masses undergo substantial mass\nloss through mechanisms that remain elusive. Unraveling the origins of this\nmass loss is important for comprehending the evolutionary path of these stars,\nthe type of supernova explosion and whether they become neutron stars or black\nhole remnants. In 2022 December, RW Cep experienced the Great Dimming in its\nvisible brightness, presenting a unique opportunity to understand mass loss\nmechanisms. Our previous observations of RW Cep from the CHARA Array, taken\nduring the dimming phase, show a compelling asymmetry in the star images, with\na darker zone on the west side of the star indicating presence of dust in front\nof the star in our line of sight. Here, we present multi-epoch observations\nfrom CHARA while the star re-brightened in 2023. We created images using three\nimage reconstruction methods and an analytical model fit. Comparisons of images\nacquired during the dimming and re-brightening phases reveal remarkable\ndifferences. Specifically, the west side of RW Cep, initially obscured during\nthe dimming phase, reappeared during the subsequent re-brightening phase and\nthe measured angular diameter became larger by 8%. We also observed image\nchanges from epoch to epoch while the star is brightening indicating the time\nevolution of dust in front of the star. We suggest that the dimming of RW Cep\nwas a result from a recent surface mass ejection event, generating a dust cloud\nthat partially obstructed the stellar photosphere.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GuSvBEKfhfjrJPfmGSUUL6Y_-pAQFayuh6IbS3ZZk64","pdfSize":"12885446"}
