{"id":"2408.00722","title":"Pathway to Secure and Trustworthy 6G for LLMs: Attacks, Defense, and\n  Opportunities","authors":"Sunder Ali Khowaja, Parus Khuwaja, Kapal Dev, Hussam Al Hamadi, Engin\n  Zeydan","authorsParsed":[["Khowaja","Sunder Ali",""],["Khuwaja","Parus",""],["Dev","Kapal",""],["Hamadi","Hussam Al",""],["Zeydan","Engin",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 17:15:13 GMT"}],"updateDate":"2024-08-02","timestamp":1722532513000,"abstract":"  Recently, large language models (LLMs) have been gaining a lot of interest\ndue to their adaptability and extensibility in emerging applications, including\ncommunication networks. It is anticipated that 6G mobile edge computing\nnetworks will be able to support LLMs as a service, as they provide ultra\nreliable low-latency communications and closed loop massive connectivity.\nHowever, LLMs are vulnerable to data and model privacy issues that affect the\ntrustworthiness of LLMs to be deployed for user-based services. In this paper,\nwe explore the security vulnerabilities associated with fine-tuning LLMs in 6G\nnetworks, in particular the membership inference attack. We define the\ncharacteristics of an attack network that can perform a membership inference\nattack if the attacker has access to the fine-tuned model for the downstream\ntask. We show that the membership inference attacks are effective for any\ndownstream task, which can lead to a personal data breach when using LLM as a\nservice. The experimental results show that the attack success rate of maximum\n92% can be achieved on named entity recognition task. Based on the experimental\nanalysis, we discuss possible defense mechanisms and present possible research\ndirections to make the LLMs more trustworthy in the context of 6G networks.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"HuscwnfOChHTpgaXYhD-NplSsUFVjxwMyPG1W1DrhTY","pdfSize":"4061571","txDigest":"98xUzAcwUmMS3Chitk4vaDCU8oRiWkKGVPCFiajyKsB4","endEpoch":"1","status":"CERTIFIED"}
