{"id":"2408.16824","title":"Block encoding by signal processing","authors":"Christopher F. Kane, Siddharth Hariprakash, Neel S. Modi, Michael\n  Kreshchuk, Christian W Bauer","authorsParsed":[["Kane","Christopher F.",""],["Hariprakash","Siddharth",""],["Modi","Neel S.",""],["Kreshchuk","Michael",""],["Bauer","Christian W",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:00:02 GMT"}],"updateDate":"2024-09-02","timestamp":1724954402000,"abstract":"  Block Encoding (BE) is a crucial subroutine in many modern quantum\nalgorithms, including those with near-optimal scaling for simulating quantum\nmany-body systems, which often rely on Quantum Signal Processing (QSP).\nCurrently, the primary methods for constructing BEs are the Linear Combination\nof Unitaries (LCU) and the sparse oracle approach. In this work, we demonstrate\nthat QSP-based techniques, such as Quantum Singular Value Transformation (QSVT)\nand Quantum Eigenvalue Transformation for Unitary Matrices (QETU), can\nthemselves be efficiently utilized for BE implementation. Specifically, we\npresent several examples of using QSVT and QETU algorithms, along with their\ncombinations, to block encode Hamiltonians for lattice bosons, an essential\ningredient in simulations of high-energy physics. We also introduce a\nstraightforward approach to BE based on the exact implementation of Linear\nOperators Via Exponentiation and LCU (LOVE-LCU). We find that, while using QSVT\nfor BE results in the best asymptotic gate count scaling with the number of\nqubits per site, LOVE-LCU outperforms all other methods for operators acting on\nup to $\\lesssim11$ qubits, highlighting the importance of concrete circuit\nconstructions over mere comparisons of asymptotic scalings. Using LOVE-LCU to\nimplement the BE, we simulate the time evolution of single-site and two-site\nsystems in the lattice $\\varphi^4$ theory using the Generalized QSP algorithm\nand compare the gate counts to those required for Trotter simulation.\n","subjects":["Physics/Quantum Physics","Physics/High Energy Physics - Lattice"],"license":"http://creativecommons.org/licenses/by/4.0/"}