{"id":"2408.07668","title":"Towards large eddy simulations of premixed turbulent flames without a\n  combustion model","authors":"Andrei N. Lipatnikov","authorsParsed":[["Lipatnikov","Andrei N.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 17:04:13 GMT"}],"updateDate":"2024-08-15","timestamp":1723655053000,"abstract":"  The paper aims at assessing a hypothesis that resolution required to evaluate\nfuel consumption and heat release rates by directly (i.e., without a subgrid\nmodel of unresolved influence of small-scale turbulent eddies on the local\nflame) processing filtered fields of density, temperature, and species mass\nfractions should be significantly finer than resolution required to directly\ncompute flame surface density by processing the same filtered fields. For this\npurpose, box filters of various widths are applied to three-dimensional Direct\nNumerical Simulation data obtained earlier by Dave et al. (Combust. Flame 196\n(2018) 386-399) from a statistically one-dimensional and planar, moderately\nlean H2/air complex-chemistry flame propagating in a box under conditions of\nsufficiently intense small-scale turbulence (Karlovitz number is larger than\nunity and a ratio of laminar flame thickness to Kolmogorov length scale is\nabout 20). Results confirm this hypothesis and show that the mean flame surface\ndensity and area can be predicted with acceptable accuracy by processing\nfiltered combustion progress variable fields computed using a sufficiently wide\nfilter. Such an approach does not require a model of the influence of subgrid\nturbulent eddies on flame surface density provided that filter width and\nlaminar flame thickness are of the same order of magnitude. Good performance of\nthis approach is attributed to inability of small-scale (when compared to the\nthickness) turbulent eddies to substantially change the local flame structure,\nwhich, nevertheless, is significantly perturbed by larger turbulent eddies that\nstrain the local flame.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}