{"id":"2408.01171","title":"Algorithm, Expert, or Both? Evaluating the Role of Feature Selection\n  Methods on User Preferences and Reliance","authors":"Jaroslaw Kornowicz and Kirsten Thommes","authorsParsed":[["Kornowicz","Jaroslaw",""],["Thommes","Kirsten",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 10:44:34 GMT"}],"updateDate":"2024-08-05","timestamp":1722595474000,"abstract":"  The integration of users and experts in machine learning is a widely studied\ntopic in artificial intelligence literature. Similarly, human-computer\ninteraction research extensively explores the factors that influence the\nacceptance of AI as a decision support system. In this experimental study, we\ninvestigate users' preferences regarding the integration of experts in the\ndevelopment of such systems and how this affects their reliance on these\nsystems. Specifically, we focus on the process of feature selection -- an\nelement that is gaining importance due to the growing demand for transparency\nin machine learning models. We differentiate between three feature selection\nmethods: algorithm-based, expert-based, and a combined approach. In the first\ntreatment, we analyze users' preferences for these methods. In the second\ntreatment, we randomly assign users to one of the three methods and analyze\nwhether the method affects advice reliance. Users prefer the combined method,\nfollowed by the expert-based and algorithm-based methods. However, the users in\nthe second treatment rely equally on all methods. Thus, we find a remarkable\ndifference between stated preferences and actual usage. Moreover, allowing the\nusers to choose their preferred method had no effect, and the preferences and\nthe extent of reliance were domain-specific. The findings underscore the\nimportance of understanding cognitive processes in AI-supported decisions and\nthe need for behavioral experiments in human-AI interactions.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"D82bnLeDxD5P74eebBX-f0cXz7d1iPgWtuc04ybO_xo","pdfSize":"461212"}
