{"id":"2408.15511","title":"AeroVerse: UAV-Agent Benchmark Suite for Simulating, Pre-training,\n  Finetuning, and Evaluating Aerospace Embodied World Models","authors":"Fanglong Yao, Yuanchang Yue, Youzhi Liu, Xian Sun, Kun Fu","authorsParsed":[["Yao","Fanglong",""],["Yue","Yuanchang",""],["Liu","Youzhi",""],["Sun","Xian",""],["Fu","Kun",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 03:47:45 GMT"}],"updateDate":"2024-08-29","timestamp":1724816865000,"abstract":"  Aerospace embodied intelligence aims to empower unmanned aerial vehicles\n(UAVs) and other aerospace platforms to achieve autonomous perception,\ncognition, and action, as well as egocentric active interaction with humans and\nthe environment. The aerospace embodied world model serves as an effective\nmeans to realize the autonomous intelligence of UAVs and represents a necessary\npathway toward aerospace embodied intelligence. However, existing embodied\nworld models primarily focus on ground-level intelligent agents in indoor\nscenarios, while research on UAV intelligent agents remains unexplored. To\naddress this gap, we construct the first large-scale real-world image-text\npre-training dataset, AerialAgent-Ego10k, featuring urban drones from a\nfirst-person perspective. We also create a virtual image-text-pose alignment\ndataset, CyberAgent Ego500k, to facilitate the pre-training of the aerospace\nembodied world model. For the first time, we clearly define 5 downstream tasks,\ni.e., aerospace embodied scene awareness, spatial reasoning, navigational\nexploration, task planning, and motion decision, and construct corresponding\ninstruction datasets, i.e., SkyAgent-Scene3k, SkyAgent-Reason3k, SkyAgent-Nav3k\nand SkyAgent-Plan3k, and SkyAgent-Act3k, for fine-tuning the aerospace\nembodiment world model. Simultaneously, we develop SkyAgentEval, the downstream\ntask evaluation metrics based on GPT-4, to comprehensively, flexibly, and\nobjectively assess the results, revealing the potential and limitations of\n2D/3D visual language models in UAV-agent tasks. Furthermore, we integrate over\n10 2D/3D visual-language models, 2 pre-training datasets, 5 finetuning\ndatasets, more than 10 evaluation metrics, and a simulator into the benchmark\nsuite, i.e., AeroVerse, which will be released to the community to promote\nexploration and development of aerospace embodied intelligence.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}