{"id":"2408.14194","title":"High-Energy Insights from an Escaping Coronal Mass Ejection with Solar\n  Orbiter/STIX Observations","authors":"Laura A. Hayes, S\\\"am Krucker, Hannah Collier, Daniel Ryan","authorsParsed":[["Hayes","Laura A.",""],["Krucker","Säm",""],["Collier","Hannah",""],["Ryan","Daniel",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 11:45:55 GMT"}],"updateDate":"2024-08-27","timestamp":1724672755000,"abstract":"  Solar eruptive events, including solar flares and coronal mass ejections\n(CMEs), are typically characterised by energetically significant X-ray\nemissions from flare-accelerated electrons and hot thermal plasmas. Occulted\nevents, where the main flare is blocked by the solar limb, provide an\nopportunity to observe and analyse the X-ray emissions specifically associated\nwith CMEs. This study investigates the X-ray and extreme ultraviolet (EUV)\nemissions associated with a large filament eruption and CME that occurred on\nFebruary 15, 2022. This event was highly occulted from the three vantage points\nof Solar Orbiter, STEREO-A, and Earth. We utilised X-ray observations from the\nSpectrometer/Telescope for Imaging X-rays (STIX) and EUV observations from the\nFull Sun Imager (FSI) of the Extreme Ultraviolet Imager (EUI) on-board Solar\nOrbiter, supplemented by multi-viewpoint observations from STEREO-A/EUVI. This\nenabled a comprehensive analysis of the X-ray emissions in relation to the\nfilament structure observed in EUV. We used STIX's imaging and spectroscopy\ncapabilities to characterise the X-ray source associated with the eruption. Our\nanalysis reveals that the X-ray emissions associated with the occulted eruption\noriginated from an altitude exceeding 0.3Rsun above the main flare site. The\nX-ray time-profile showed a sharp increase and exponential decay, and consisted\nof both a hot thermal component at 17 MK and non-thermal emissions (>11.4 keV)\ncharacterised by an electron spectral index of 3.9. Imaging analysis showed an\nextended X-ray source that coincided with the EUV emission as observed from\nEUI, and was imaged until the source grew to a size larger than the imaging\nlimit of STIX (180 arcsec). The findings demonstrate that STIX combined with\nEUI provides a unique and powerful tool for examining the energetic properties\nof the CME component of solar energetic eruptions.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"InJjJq16Z5rOtJBNrEDcbrY1wI6pl6F7ar8-xa4WNuw","pdfSize":"10177804"}
