{"id":"2408.10981","title":"Local two-dimensional simulations of the ignition of a helium shell\n  detonation on a white dwarf by an impacting stream","authors":"Nethra Rajavel, Dean M. Townsley, Ken J. Shen","authorsParsed":[["Rajavel","Nethra",""],["Townsley","Dean M.",""],["Shen","Ken J.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 16:17:29 GMT"}],"updateDate":"2024-08-21","timestamp":1724170649000,"abstract":"  The double detonation model is one of the prevalent explosion mechanisms of\nType Ia Supernovae (SNe Ia) wherein an outer helium shell detonation triggers a\ncore detonation in the white dwarf (WD). The dynamically driven double\ndegenerate double detonation (D6) is the double detonation of the more massive\nWD in a binary WD system where the localized impact of the mass transfer stream\nfrom the companion sets off the initial helium shell detonation. To have high\nnumerical resolution and control over the stream parameters, we have\nimplemented a study of the local interaction of the stream with the WD surface\nin 2D. In cases with lower base density of the shell, the stream's impact can\ncause surface detonation soon after first impact. With higher base densities,\nafter the stream hits the surface, hot material flows around the star and\ninteracts with the incoming stream to produce a denser and narrower impact. Our\nresults therefore show that (1) a directly impacting stream for both a\nrelatively high resolution and for a range of stream parameters can produce a\nsurface detonation, (2) thinner helium shells ignite more promptly via impact,\ndoing so sooner, and (3) there are lower limits on ignition in both shell\ndensity and incoming stream speed with lower limits on density being well below\nthose shown by other work to be required for normal appearing SN Ia. This\nsupports stream ignition and therefore the D6 scenario, as a viable mechanism\nfor normal SNe Ia.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}