{"id":"2408.15888","title":"The ESO UVES/FEROS Large Programs of TESS OB pulsators. II. On the\n  physical origin of macroturbulence","authors":"Nadya Serebriakova, Andrew Tkachenko, and Conny Aerts","authorsParsed":[["Serebriakova","Nadya",""],["Tkachenko","Andrew",""],["Aerts","Conny",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 16:01:21 GMT"}],"updateDate":"2024-08-29","timestamp":1724860881000,"abstract":"  Spectral lines of hot massive stars are known to exhibit large excess\nbroadening in addition to rotational broadening. This excess broadening is\noften attributed to macroturbulence whose physical origin is a matter of active\ndebate in the stellar astrophysics community. By looking into the statistical\nproperties of a large sample of O- and B-type stars, both in the Galaxy and\nLMC, we aim to shed light on the physical origin of macroturbulent line\nbroadening. We deliver newly measured macroturbulent velocities for 86 stars\nfrom the Galaxy in a consistent manner with 126 stars from the LMC. A total\nsample of 594 O- and B-type stars with measured macroturbulent velocities was\ncomposed by complementing our sample with archival data. Furthermore, we\ncompute an extensive grid of MESA models to compare, in a statistical manner,\nthe predicted interior properties of stars (such as convection and wave\npropagation) with the inference of macroturbulent velocities from\nhigh-resolution spectroscopic observations. We find the presence of two\nprincipally different regimes where, depending on the initial stellar mass,\ndifferent mechanisms may be responsible for the observed excess line\nbroadening. Stars with initial masses above some 30$M_{\\odot}$ are found to\nhave macroturbulent velocities fully determined by subsurface convective zones\nformed in the iron opacity bump (FeCZ), while some other mechanism is required\nto explain observations for masses below 12$M_{\\odot}$. The latter finding\nleaves the potential for waves generated at the interface of the convective\ncore and radiative envelope of the star to be responsible for the observed\nmacroturbulent broadening. Both mechanisms may co-exist in the intermediate\nregime of stellar masses, between some 12 and 30$M_{\\odot}$.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LzzL3s4HKZO1b9afVx48qRzTDwgGsVtXrKEJh_QqWN4","pdfSize":"27208844"}
