{"id":"2408.16623","title":"Turbulence Strength $C_n^2$ Estimation from Video using Physics-based\n  Deep Learning","authors":"Ripon Kumar Saha, Esen Salcin, Jihoo Kim, Joseph Smith, Suren\n  Jayasuriya","authorsParsed":[["Saha","Ripon Kumar",""],["Salcin","Esen",""],["Kim","Jihoo",""],["Smith","Joseph",""],["Jayasuriya","Suren",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 15:31:51 GMT"}],"updateDate":"2024-08-30","timestamp":1724945511000,"abstract":"  Images captured from a long distance suffer from dynamic image distortion due\nto turbulent flow of air cells with random temperatures, and thus refractive\nindices. This phenomenon, known as image dancing, is commonly characterized by\nits refractive-index structure constant $C_n^2$ as a measure of the turbulence\nstrength. For many applications such as atmospheric forecast model,\nlong-range/astronomy imaging, and aviation safety, optical communication\ntechnology, $C_n^2$ estimation is critical for accurately sensing the turbulent\nenvironment. Previous methods for $C_n^2$ estimation include estimation from\nmeteorological data (temperature, relative humidity, wind shear, etc.) for\nsingle-point measurements, two-ended pathlength measurements from optical\nscintillometer for path-averaged $C_n^2$, and more recently estimating $C_n^2$\nfrom passive video cameras for low cost and hardware complexity. In this paper,\nwe present a comparative analysis of classical image gradient methods for\n$C_n^2$ estimation and modern deep learning-based methods leveraging\nconvolutional neural networks. To enable this, we collect a dataset of video\ncapture along with reference scintillometer measurements for ground truth, and\nwe release this unique dataset to the scientific community. We observe that\ndeep learning methods can achieve higher accuracy when trained on similar data,\nbut suffer from generalization errors to other, unseen imagery as compared to\nclassical methods. To overcome this trade-off, we present a novel physics-based\nnetwork architecture that combines learned convolutional layers with a\ndifferentiable image gradient method that maintains high accuracy while being\ngeneralizable across image datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wGMfqc0LUtZSNXIsgPYaf4xxCMtiN6K_wFDh9_cQukI","pdfSize":"3190487"}
