{"id":"2408.01553","title":"Multi-task SAR Image Processing via GAN-based Unsupervised Manipulation","authors":"Xuran Hu, Mingzhe Zhu, Ziqiang Xu, Zhenpeng Feng and Ljubisa Stankovic","authorsParsed":[["Hu","Xuran",""],["Zhu","Mingzhe",""],["Xu","Ziqiang",""],["Feng","Zhenpeng",""],["Stankovic","Ljubisa",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 19:49:30 GMT"}],"updateDate":"2024-08-06","timestamp":1722628170000,"abstract":"  Generative Adversarial Networks (GANs) have shown tremendous potential in\nsynthesizing a large number of realistic SAR images by learning patterns in the\ndata distribution. Some GANs can achieve image editing by introducing latent\ncodes, demonstrating significant promise in SAR image processing. Compared to\ntraditional SAR image processing methods, editing based on GAN latent space\ncontrol is entirely unsupervised, allowing image processing to be conducted\nwithout any labeled data. Additionally, the information extracted from the data\nis more interpretable. This paper proposes a novel SAR image processing\nframework called GAN-based Unsupervised Editing (GUE), aiming to address the\nfollowing two issues: (1) disentangling semantic directions in the GAN latent\nspace and finding meaningful directions; (2) establishing a comprehensive SAR\nimage processing framework while achieving multiple image processing functions.\nIn the implementation of GUE, we decompose the entangled semantic directions in\nthe GAN latent space by training a carefully designed network. Moreover, we can\naccomplish multiple SAR image processing tasks (including despeckling,\nlocalization, auxiliary identification, and rotation editing) in a single\ntraining process without any form of supervision. Extensive experiments\nvalidate the effectiveness of the proposed method.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}