{"id":"2408.12121","title":"Emotion-Agent: Unsupervised Deep Reinforcement Learning with\n  Distribution-Prototype Reward for Continuous Emotional EEG Analysis","authors":"Zhihao Zhou, Qile Liu, Jiyuan Wang, Zhen Liang","authorsParsed":[["Zhou","Zhihao",""],["Liu","Qile",""],["Wang","Jiyuan",""],["Liang","Zhen",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 04:29:25 GMT"}],"updateDate":"2024-08-23","timestamp":1724300965000,"abstract":"  Continuous electroencephalography (EEG) signals are widely used in affective\nbrain-computer interface (aBCI) applications. However, not all continuously\ncollected EEG signals are relevant or meaningful to the task at hand (e.g.,\nwondering thoughts). On the other hand, manually labeling the relevant parts is\nnearly impossible due to varying engagement patterns across different tasks and\nindividuals. Therefore, effectively and efficiently identifying the important\nparts from continuous EEG recordings is crucial for downstream BCI tasks, as it\ndirectly impacts the accuracy and reliability of the results. In this paper, we\npropose a novel unsupervised deep reinforcement learning framework, called\nEmotion-Agent, to automatically identify relevant and informative emotional\nmoments from continuous EEG signals. Specifically, Emotion-Agent involves\nunsupervised deep reinforcement learning combined with a heuristic algorithm.\nWe first use the heuristic algorithm to perform an initial global search and\nform prototype representations of the EEG signals, which facilitates the\nefficient exploration of the signal space and identify potential regions of\ninterest. Then, we design distribution-prototype reward functions to estimate\nthe interactions between samples and prototypes, ensuring that the identified\nparts are both relevant and representative of the underlying emotional states.\nEmotion-Agent is trained using Proximal Policy Optimization (PPO) to achieve\nstable and efficient convergence. Our experiments compare the performance with\nand without Emotion-Agent. The results demonstrate that selecting relevant and\ninformative emotional parts before inputting them into downstream tasks\nenhances the accuracy and reliability of aBCI applications.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}