{"id":"2408.01362","title":"Autoencoders in Function Space","authors":"Justin Bunker, Mark Girolami, Hefin Lambley, Andrew M. Stuart, T. J.\n  Sullivan","authorsParsed":[["Bunker","Justin",""],["Girolami","Mark",""],["Lambley","Hefin",""],["Stuart","Andrew M.",""],["Sullivan","T. J.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 16:13:51 GMT"}],"updateDate":"2024-08-05","timestamp":1722615231000,"abstract":"  Autoencoders have found widespread application, in both their original\ndeterministic form and in their variational formulation (VAEs). In scientific\napplications it is often of interest to consider data that are comprised of\nfunctions; the same perspective is useful in image processing. In practice,\ndiscretisation (of differential equations arising in the sciences) or\npixellation (of images) renders problems finite dimensional, but conceiving\nfirst of algorithms that operate on functions, and only then discretising or\npixellating, leads to better algorithms that smoothly operate between different\nlevels of discretisation or pixellation. In this paper function-space versions\nof the autoencoder (FAE) and variational autoencoder (FVAE) are introduced,\nanalysed, and deployed. Well-definedness of the objective function governing\nVAEs is a subtle issue, even in finite dimension, and more so on function\nspace. The FVAE objective is well defined whenever the data distribution is\ncompatible with the chosen generative model; this happens, for example, when\nthe data arise from a stochastic differential equation. The FAE objective is\nvalid much more broadly, and can be straightforwardly applied to data governed\nby differential equations. Pairing these objectives with neural operator\narchitectures, which can thus be evaluated on any mesh, enables new\napplications of autoencoders to inpainting, superresolution, and generative\nmodelling of scientific data.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zcItPcJBVaRxcFgXb-wUXnUBNJKFOwJc74OD1UgL1GI","pdfSize":"9196567"}
