{"id":"2408.08896","title":"LLMJudge: LLMs for Relevance Judgments","authors":"Hossein A. Rahmani, Emine Yilmaz, Nick Craswell, Bhaskar Mitra, Paul\n  Thomas, Charles L. A. Clarke, Mohammad Aliannejadi, Clemencia Siro, Guglielmo\n  Faggioli","authorsParsed":[["Rahmani","Hossein A.",""],["Yilmaz","Emine",""],["Craswell","Nick",""],["Mitra","Bhaskar",""],["Thomas","Paul",""],["Clarke","Charles L. A.",""],["Aliannejadi","Mohammad",""],["Siro","Clemencia",""],["Faggioli","Guglielmo",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 23:15:41 GMT"}],"updateDate":"2024-08-20","timestamp":1723245341000,"abstract":"  The LLMJudge challenge is organized as part of the LLM4Eval workshop at SIGIR\n2024. Test collections are essential for evaluating information retrieval (IR)\nsystems. The evaluation and tuning of a search system is largely based on\nrelevance labels, which indicate whether a document is useful for a specific\nsearch and user. However, collecting relevance judgments on a large scale is\ncostly and resource-intensive. Consequently, typical experiments rely on\nthird-party labelers who may not always produce accurate annotations. The\nLLMJudge challenge aims to explore an alternative approach by using LLMs to\ngenerate relevance judgments. Recent studies have shown that LLMs can generate\nreliable relevance judgments for search systems. However, it remains unclear\nwhich LLMs can match the accuracy of human labelers, which prompts are most\neffective, how fine-tuned open-source LLMs compare to closed-source LLMs like\nGPT-4, whether there are biases in synthetically generated data, and if data\nleakage affects the quality of generated labels. This challenge will\ninvestigate these questions, and the collected data will be released as a\npackage to support automatic relevance judgment research in information\nretrieval and search.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7OxJHo2T34jlGjQNI5p2dK7Ug4jCALiACbEQt2vqlDY","pdfSize":"710390"}
