{"id":"2408.13301","title":"Jet veto resummation for STXS $H+$1-jet bins at aNNLL$'$+NNLO","authors":"Pedro Cal, Matthew A. Lim, Darren J. Scott, Frank J. Tackmann and\n  Wouter J. Waalewijn","authorsParsed":[["Cal","Pedro",""],["Lim","Matthew A.",""],["Scott","Darren J.",""],["Tackmann","Frank J.",""],["Waalewijn","Wouter J.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 17:59:56 GMT"}],"updateDate":"2024-08-27","timestamp":1724435996000,"abstract":"  Measurements of Higgs boson processes by the ATLAS and CMS experiments at the\nLHC use Simplified Template Cross Sections (STXS) as a common framework for the\ncombination of measurements in different decay channels and their further\ninterpretation, e.g. to measure Higgs couplings. The different Higgs production\nprocesses are measured in predefined kinematic regions -- the STXS bins --\nrequiring precise theory predictions for each individual bin. In gluon-fusion\nHiggs production a main division is into 0-jet, 1-jet, and $\\geq 2$-jet bins,\nwhich are further subdivided in bins of the Higgs transverse momentum $p_T^H$.\nRequiring a fixed number of jets induces logarithms $\\ln p_T^{\\mathrm{cut}}/Q$\nin the cross section where $p_T^{\\mathrm{cut}}$ is the jet-$p_T$ threshold and\n$Q\\sim p_T^H\\sim m_H$ the hard-interaction scale. These jet-veto logarithms can\nbe resummed to all orders in perturbation theory to achieve the highest\npossible perturbative precision. We provide state-of-the art predictions for\nthe $p_T^H$ spectrum in exclusive $H+$1-jet production and the corresponding\n$H+$1-jet STXS bins in the kinematic regime $p_T^{\\mathrm{cut}} \\ll p_T^H\\sim\nm_H$. We carry out the resummation at NNLL$'$ accuracy, using theory nuisance\nparameters to account for the few unknown ingredients at this order, and match\nto full NNLO. We revisit the jet-veto factorization for this process and find\nthat it requires refactorizing the total soft function into a global and\nsoft-collinear contribution in order to fully account for logarithms of the\nsignal jet radius. The leading nonglobal logarithms are also included, though\nthey are numerically small for the region of phenomenological interest.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}