{"id":"2408.08814","title":"A Novel Quantum Algorithm for Efficient Attractor Search in Gene\n  Regulatory Networks","authors":"Mirko Rossini, Felix M. Weidner, Joachim Ankerhold, Hans A. Kestler","authorsParsed":[["Rossini","Mirko",""],["Weidner","Felix M.",""],["Ankerhold","Joachim",""],["Kestler","Hans A.",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 15:48:45 GMT"}],"updateDate":"2024-08-19","timestamp":1723823325000,"abstract":"  The description of gene interactions that constantly occur in the cellular\nenvironment is an extremely challenging task due to an immense number of\ndegrees of freedom and incomplete knowledge about microscopic details. Hence, a\ncoarse-grained and rather powerful modeling of such dynamics is provided by\nBoolean Networks (BNs). BNs are dynamical systems composed of Boolean agents\nand a record of their possible interactions over time. Stable states in these\nsystems are called attractors which are closely related to the cellular\nexpression of biological phenotypes. Identifying the full set of attractors is,\ntherefore, of substantial biological interest. However, for conventional\nhigh-performance computing, this problem is plagued by an exponential growth of\nthe dynamic state space. Here, we demonstrate a novel quantum search algorithm\ninspired by Grover's algorithm to be implemented on quantum computing\nplatforms. The algorithm performs an iterative suppression of states belonging\nto basins of previously discovered attractors from a uniform superposition,\nthus increasing the amplitudes of states in basins of yet unknown attractors.\nThis approach guarantees that a new attractor state is measured with each\niteration of the algorithm, an optimization not currently achieved by any other\nalgorithm in the literature. Tests of its resistance to noise have also shown\npromising performance on devices from the current Noise Intermediate Scale\nQuantum Computing (NISQ) era.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Data Structures and Algorithms","Quantitative Biology/Molecular Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"u9usL6raMSmliifQev9qzqvKW_M2_exBrszCnvHOTro","pdfSize":"1964440"}
