{"id":"2408.16705","title":"Experimental validation of a linear momentum and bluff-body model for\n  high-blockage cross-flow turbine arrays","authors":"Aidan Hunt, Ari Athair, Owen Williams, and Brian Polagye","authorsParsed":[["Hunt","Aidan",""],["Athair","Ari",""],["Williams","Owen",""],["Polagye","Brian",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 16:59:38 GMT"}],"updateDate":"2024-08-30","timestamp":1724950778000,"abstract":"  The performance and near-wake characteristics of a turbine in a confined flow\ndepend on the blockage ratio, defined as the ratio of the turbine projected\narea to the channel cross-sectional area. While blockage is understood to\nincrease the power coefficient for turbine \"fences\" spanning a channel, most\ninvestigations at the upper range of practically-achievable blockage ratios\nhave been theoretical or numerical in nature. Furthermore, while linear\nmomentum actuator disk theory is frequently used to model turbines in confined\nflows, as confinement increases, the ability of this idealized model to\ndescribe performance and flow fields has not been established. In this work,\nthe performance and near-wake flow field of a pair of cross-flow turbines are\nexperimentally evaluated at blockage ratios from 30% to 55%. The fluid velocity\nmeasured in the bypass region is found to be well-predicted by the open-channel\nlinear momentum model developed by Houlsby et al. (2008), while the wake\nvelocity is not. Additionally, self-similar power and thrust coefficients are\nidentified across this range of blockage ratios when array performance is\nscaled by the modeled bypass velocity following Whelan et al.'s (2009)\nadaptation of the bluff-body theory of Maskell (1963). This result demonstrates\nthat, despite multiple non-idealities, relatively simple models can\nquantitatively describe highly confined turbines. From this, an analytical\nmethod for predicting array performance as a function of blockage is presented.\nOverall, this work illustrates turbine performance at relatively high\nconfinement and demonstrates the suitability of analytical models to predict\nand interpret their hydrodynamics.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}