{"id":"2408.15950","title":"Atari-GPT: Investigating the Capabilities of Multimodal Large Language\n  Models as Low-Level Policies for Atari Games","authors":"Nicholas R. Waytowich, Devin White, MD Sunbeam and Vinicius G. Goecks","authorsParsed":[["Waytowich","Nicholas R.",""],["White","Devin",""],["Sunbeam","MD",""],["Goecks","Vinicius G.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 17:08:56 GMT"}],"updateDate":"2024-08-29","timestamp":1724864936000,"abstract":"  Recent advancements in large language models (LLMs) have expanded their\ncapabilities beyond traditional text-based tasks to multimodal domains,\nintegrating visual, auditory, and textual data. While multimodal LLMs have been\nextensively explored for high-level planning in domains like robotics and\ngames, their potential as low-level controllers remains largely untapped. This\npaper explores the application of multimodal LLMs as low-level controllers in\nthe domain of Atari video games, introducing Atari game performance as a new\nbenchmark for evaluating the ability of multimodal LLMs to perform low-level\ncontrol tasks. Unlike traditional reinforcement learning (RL) and imitation\nlearning (IL) methods that require extensive computational resources as well as\nreward function specification, these LLMs utilize pre-existing multimodal\nknowledge to directly engage with game environments. Our study assesses\nmultiple multimodal LLMs performance against traditional RL agents, human\nplayers, and random agents, focusing on their ability to understand and\ninteract with complex visual scenes and formulate strategic responses.\nAdditionally, we examine the impact of In-Context Learning (ICL) by\nincorporating human-demonstrated game-play trajectories to enhance the models\ncontextual understanding. Through this investigation, we aim to determine the\nextent to which multimodal LLMs can leverage their extensive training to\neffectively function as low-level controllers, thereby redefining potential\napplications in dynamic and visually complex environments. Additional results\nand videos are available at our project webpage:\nhttps://sites.google.com/view/atari-gpt/.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}