{"id":"2408.06955","title":"Crowdsourcing: A Framework for Usability Evaluation","authors":"Muhammad Nasir","authorsParsed":[["Nasir","Muhammad",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 15:14:14 GMT"}],"updateDate":"2024-08-14","timestamp":1723562054000,"abstract":"  Objective: This research explores using crowdsourcing for software usability\nevaluation.\n  Background: Usability studies are essential for designing user-friendly\nsoftware, but traditional methods are often costly and time-consuming.\nCrowdsourcing offers a quicker, cost-effective alternative for remote usability\nevaluation, though ensuring quality feedback remains a challenge.\n  Method: A systematic mapping study was conducted to review current usability\nevaluation research. Subsequently, multi-experiments were performed, comparing\nnovice crowd usability inspectors to experts using expert heuristic evaluation\nas a benchmark. These results were used to create and validate a framework for\ncrowd usability inspection through a case study.\n  Results: The mapping study identified expert heuristic evaluation as a\nprevalent method, especially for websites. Experimental findings showed that\nnovice crowd usability inspections, guided by expert heuristics, can match\nexperts in identifying usability issues in content, quality, severity, and time\nefficiency. The case study demonstrated that the framework allows effective\nusability inspections, leading to successful software redesigns. Iterations of\n3-5 novice inspections effectively resolved key usability issues within three\ncycles.\n  Conclusion: Crowdsourcing is an effective alternative to expert heuristic\nevaluation for usability assessment. The proposed framework for crowd usability\ninspection is a viable solution for budget-constrained software companies.\n  Keywords: crowdsourcing, crowd usability evaluation, expert heuristic\nevaluation, framework.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"DMR3qbWsOjmHDqDcnBK6WZ3Skvo-7PIGVOzglsaXcIU","pdfSize":"3106591"}
