{"id":"2408.08231","title":"DaRec: A Disentangled Alignment Framework for Large Language Model and\n  Recommender System","authors":"Xihong Yang, Heming Jing, Zixing Zhang, Jindong Wang, Huakang Niu,\n  Shuaiqiang Wang, Yu Lu, Junfeng Wang, Dawei Yin, Xinwang Liu, En Zhu, Defu\n  Lian, Erxue Min","authorsParsed":[["Yang","Xihong",""],["Jing","Heming",""],["Zhang","Zixing",""],["Wang","Jindong",""],["Niu","Huakang",""],["Wang","Shuaiqiang",""],["Lu","Yu",""],["Wang","Junfeng",""],["Yin","Dawei",""],["Liu","Xinwang",""],["Zhu","En",""],["Lian","Defu",""],["Min","Erxue",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 15:56:23 GMT"}],"updateDate":"2024-08-16","timestamp":1723737383000,"abstract":"  Benefiting from the strong reasoning capabilities, Large language models\n(LLMs) have demonstrated remarkable performance in recommender systems. Various\nefforts have been made to distill knowledge from LLMs to enhance collaborative\nmodels, employing techniques like contrastive learning for representation\nalignment. In this work, we prove that directly aligning the representations of\nLLMs and collaborative models is sub-optimal for enhancing downstream\nrecommendation tasks performance, based on the information theorem.\nConsequently, the challenge of effectively aligning semantic representations\nbetween collaborative models and LLMs remains unresolved. Inspired by this\nviewpoint, we propose a novel plug-and-play alignment framework for LLMs and\ncollaborative models. Specifically, we first disentangle the latent\nrepresentations of both LLMs and collaborative models into specific and shared\ncomponents via projection layers and representation regularization.\nSubsequently, we perform both global and local structure alignment on the\nshared representations to facilitate knowledge transfer. Additionally, we\ntheoretically prove that the specific and shared representations contain more\npertinent and less irrelevant information, which can enhance the effectiveness\nof downstream recommendation tasks. Extensive experimental results on benchmark\ndatasets demonstrate that our method is superior to existing state-of-the-art\nalgorithms.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}