{"id":"2408.03789","title":"Counterfactuals and Uncertainty-Based Explainable Paradigm for the\n  Automated Detection and Segmentation of Renal Cysts in Computed Tomography\n  Images: A Multi-Center Study","authors":"Zohaib Salahuddin, Abdalla Ibrahim, Sheng Kuang, Yousif Widaatalla,\n  Razvan L. Miclea, Oliver Morin, Spencer Behr, Marnix P.M. Kop, Tom\n  Marcelissen, Patricia Zondervan, Auke Jager, Philippe Lambin, Henry C\n  Woodruff","authorsParsed":[["Salahuddin","Zohaib",""],["Ibrahim","Abdalla",""],["Kuang","Sheng",""],["Widaatalla","Yousif",""],["Miclea","Razvan L.",""],["Morin","Oliver",""],["Behr","Spencer",""],["Kop","Marnix P. M.",""],["Marcelissen","Tom",""],["Zondervan","Patricia",""],["Jager","Auke",""],["Lambin","Philippe",""],["Woodruff","Henry C",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 14:14:05 GMT"}],"updateDate":"2024-08-08","timestamp":1723040045000,"abstract":"  Routine computed tomography (CT) scans often detect a wide range of renal\ncysts, some of which may be malignant. Early and precise localization of these\ncysts can significantly aid quantitative image analysis. Current segmentation\nmethods, however, do not offer sufficient interpretability at the feature and\npixel levels, emphasizing the necessity for an explainable framework that can\ndetect and rectify model inaccuracies. We developed an interpretable\nsegmentation framework and validated it on a multi-centric dataset. A\nVariational Autoencoder Generative Adversarial Network (VAE-GAN) was employed\nto learn the latent representation of 3D input patches and reconstruct input\nimages. Modifications in the latent representation using the gradient of the\nsegmentation model generated counterfactual explanations for varying dice\nsimilarity coefficients (DSC). Radiomics features extracted from these\ncounterfactual images, using a ground truth cyst mask, were analyzed to\ndetermine their correlation with segmentation performance. The DSCs for the\noriginal and VAE-GAN reconstructed images for counterfactual image generation\nshowed no significant differences. Counterfactual explanations highlighted how\nvariations in cyst image features influence segmentation outcomes and showed\nmodel discrepancies. Radiomics features correlating positively and negatively\nwith dice scores were identified. The uncertainty of the predicted segmentation\nmasks was estimated using posterior sampling of the weight space. The\ncombination of counterfactual explanations and uncertainty maps provided a\ndeeper understanding of the image features within the segmented renal cysts\nthat lead to high uncertainty. The proposed segmentation framework not only\nachieved high segmentation accuracy but also increased interpretability\nregarding how image features impact segmentation performance.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Vk5ai-llUmH0QggTn5mGhEAGHYClW_2dBXx2tkXm4Gc","pdfSize":"14882921"}
