{"id":"2408.17172","title":"First Solar Orbiter observation of a dark halo in the solar atmosphere","authors":"Serena Maria Lezzi, David M. Long, Vincenzo Andretta, Deborah Baker,\n  Antoine Dolliou, Mariarita Murabito, Susanna Parenti and Natalia Zambrana\n  Prado","authorsParsed":[["Lezzi","Serena Maria",""],["Long","David M.",""],["Andretta","Vincenzo",""],["Baker","Deborah",""],["Dolliou","Antoine",""],["Murabito","Mariarita",""],["Parenti","Susanna",""],["Prado","Natalia Zambrana",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 10:18:12 GMT"}],"updateDate":"2024-09-02","timestamp":1725013092000,"abstract":"  Solar active regions (ARs) are often surrounded by dark large areas of\nreduced emission compared to the quiet Sun, observed at various wavelengths\ncorresponding to chromosphere, transition region (TR) and corona, and known as\nDark Halos (DHs). DHs have been insufficiently studied, and the mechanisms\nbehind their darker emission remain unclear. This study aims to investigate for\nthe first time the fine structure of a DH observed by the EUV High Resolution\nImager (HRI$_{EUV}$) onboard the ESA's Solar Orbiter (SO) mission and its\nappearance in the TR. We utilized the extensive 1-hour dataset from SO on 19\nMarch 2022, which includes high-resolution observations of NOAA 12967 and part\nof the surrounding DH. We analyzed the dynamics of the HRI$_{EUV}$ DH fine\nstructure and its appearance in the HRI$_{Ly\\alpha}$ image and the Spectral\nImaging of the Coronal Environment (SPICE) Ly$\\beta$, C III, N VI, O VI and Ne\nVIII lines, which sample the TR in the logT (K) $\\sim$ 4.0 - 5.8 range. This\nanalysis was complemented with a simultaneous B$_{LOS}$ magnetogram taken by\nthe High Resolution Telescope (HRT). We report the presence of a peculiar fine\nstructure which is not observed in the quiet Sun, characterized by combined\nbright EUV bundles and dark regions, arranged and interconnected in such a way\nthat they cannot be clearly separated. They form a spatial continuum extending\napproximately radially from the AR core, suggesting a deep connection between\nthe DH and the AR. Additionally, we find that the bright EUV bundles are\nobserved in all the SPICE TR lines and the HRI$_{Ly\\alpha}$ band and present\nphotospheric B$_{LOS}$ footprints in the HRT magnetogram. This spatial\ncorrelation indicates that the origin of the 174 \\r{A} DH may lie in the low\natmosphere, i.e. photosphere/chromosphere.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TCZSNbhOHUcuIDAgdiHh1-pLUc-qtZPbCNeuEckP014","pdfSize":"35172647"}
