{"id":"2408.10784","title":"Framework for uncertainty quantification of wave-structure interaction\n  in a flume","authors":"Xiaoyuan Luo and Vijay Nandurdikar and Sangri-Yi and Alistair Revell\n  and Georgios Fourtakas and Ajay B. Harish","authorsParsed":[["Luo","Xiaoyuan",""],["Nandurdikar","Vijay",""],["Sangri-Yi","",""],["Revell","Alistair",""],["Fourtakas","Georgios",""],["Harish","Ajay B.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 12:21:38 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 06:39:04 GMT"}],"updateDate":"2024-08-22","timestamp":1724156498000,"abstract":"  In this paper we propose a numerical procedure for the quantification of\nuncertainties in wave-structure interaction. We utilise the smoothed particle\nhydrodynamics (SPH) scheme for modelling the wave mechanics, coupled one-way\nwith a finite element method (FEM) for the structural response. Physical wave\nflumes are extensively used in the study of hydrodynamics especially in\nwave-structure interaction (WSI) and prediction of forces to near-shore\nstructures in disaster mitigation and offshore structures in the oil and gas,\nand more recently renewable energy sector. Over the years, numerical wave\nflumes have been developed extensively to enable the modelling of complex\nwave-structure interaction. However, most of these studies are deterministic\nand limited to using either simple flexible beams or rigid monolithic\nstructures to model the structural part in the WSI. Additionally, uncertainties\nare commonly observed in both wave and structural parameters and need to be\naccounted for. This work presents a numerical framework to enable uncertainty\nquantification for wave-structure interaction problems in terms of the forces\nexperienced by the structure. A one-way coupling between SPH with the FEM and\nuncertainty quantification (UQ) is proposed. We employ the so-called Tokyo wave\nflume geometry, which has potential for future surrogate modelling in WSI. The\ndeveloped model is validated using numerical and experimental results from the\nliterature and is used to demonstrate the prediction of probabilistic responses\nof structures under breaking and non-breaking wave scenarios.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"gnDKQdg48oqMWyad0Vac_0v23Mo7eXMBtmR-yxeFr9U","pdfSize":"5588543"}
