{"id":"2408.01549","title":"Reducing COVID-19 Misinformation Spread by Introducing Information\n  Diffusion Delay Using Agent-based Modeling","authors":"Mustafa Alassad, Nitin Agarwal","authorsParsed":[["Alassad","Mustafa",""],["Agarwal","Nitin",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 19:31:30 GMT"}],"updateDate":"2024-08-06","timestamp":1722627090000,"abstract":"  With the explosive growth of the Coronavirus Pandemic (COVID-19),\nmisinformation on social media has developed into a global phenomenon with\nwidespread and detrimental societal effects. Despite recent progress and\nefforts in detecting COVID-19 misinformation on social media networks, this\ntask remains challenging due to the complexity, diversity, multi-modality, and\nhigh costs of fact-checking or annotation. In this research, we introduce a\nsystematic and multidisciplinary agent-based modeling approach to limit the\nspread of COVID-19 misinformation and interpret the dynamic actions of users\nand communities in evolutionary online (or offline) social media networks. Our\nmodel was applied to a Twitter network associated with an armed protest\ndemonstration against the COVID-19 lockdown in Michigan state in May, 2020. We\nimplemented a one-median problem to categorize the Twitter network into six key\ncommunities (nodes) and identified information exchange (links) within the\nnetwork. We measured the response time to COVID-19 misinformation spread in the\nnetwork and employed a cybernetic organizational method to monitor the Twitter\nnetwork. The overall misinformation mitigation strategy was evaluated, and\nagents were allocated to interact with the network based on the measured\nresponse time and feedback. The proposed model prioritized the communities\nbased on the agents response times at the operational level. It then optimized\nagent allocation to limit the spread of COVID19 related misinformation from\ndifferent communities, improved the information diffusion delay threshold to up\nto 3 minutes, and ultimately enhanced the mitigation process to reduce\nmisinformation spread across the entire network.\n","subjects":["Computing Research Repository/Social and Information Networks","Physics/Physics and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}