{"id":"2408.01780","title":"Symmetric black-to-white hole solutions with a cosmological constant","authors":"Zhong-Wen Feng, Qing-Quan Jiang, Yi Ling, Xiao-Ning Wu, Zhangping Yu","authorsParsed":[["Feng","Zhong-Wen",""],["Jiang","Qing-Quan",""],["Ling","Yi",""],["Wu","Xiao-Ning",""],["Yu","Zhangping",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 13:28:37 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 03:55:36 GMT"}],"updateDate":"2024-08-13","timestamp":1722691717000,"abstract":"  For a system with a Hamiltonian constraint, we demonstrate that its dynamics\npreserves invariant with respect to the choice of the lapse function,\nregardless of whether the Hamiltonian incorporates quantum corrections.\nApplying this observation to the interior of black-to-white holes, we analyze\nits dynamics with different choices of the lapse function. The results\nexplicitly show that the leading-order expansion of both metrics in Refs. [1,2]\nand Refs. [3,4] exhibits identical behavior near the transition\nsurface,therefore in this sense the black-to-white hole model proposed in Refs.\n[1,2] may be interpreted as a coarse-grained version of the solution within the\nframework of loop quantum gravity. The black-to-white hole solutions with exact\nsymmetry between the black hole and white hole regions are constructed by\nappropriately fixing the quantum parameters in the effective theory of loop\nquantum gravity. This approach circumvents the issue of amplification of mass,\nwhich could arise from a mass difference between the black hole and white hole.\nFinally, the black-to-white hole solutions with a cosmological constant are\nconstructed. The numerical solutions for the interior of black-to-white hole\nwith a cosmological constant are obtained, and their symmetric behavior is also\ndiscussed.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BVDoFrrmjTvMKb6j3LZfirXx5nKGiSAyFKJOz970JbQ","pdfSize":"1076254"}
