{"id":"2408.11768","title":"Embedding Ordinality to Binary Loss Function for Improving Solar Flare\n  Forecasting","authors":"Chetraj Pandey, Anli Ji, Jinsu Hong, Rafal A. Angryk, Berkay Aydin","authorsParsed":[["Pandey","Chetraj",""],["Ji","Anli",""],["Hong","Jinsu",""],["Angryk","Rafal A.",""],["Aydin","Berkay",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 16:42:58 GMT"}],"updateDate":"2024-08-22","timestamp":1724258578000,"abstract":"  In this paper, we propose a novel loss function aimed at optimizing the\nbinary flare prediction problem by embedding the intrinsic ordinal flare\ncharacteristics into the binary cross-entropy (BCE) loss function. This\nmodification is intended to provide the model with better guidance based on the\nordinal characteristics of the data and improve the overall performance of the\nmodels. For our experiments, we employ a ResNet34-based model with transfer\nlearning to predict $\\geq$M-class flares by utilizing the shape-based features\nof magnetograms of active region (AR) patches spanning from $-$90$^{\\circ}$ to\n$+$90$^{\\circ}$ of solar longitude as our input data. We use a composite skill\nscore (CSS) as our evaluation metric, which is calculated as the geometric mean\nof the True Skill Score (TSS) and the Heidke Skill Score (HSS) to rank and\ncompare our models' performance. The primary contributions of this work are as\nfollows: (i) We introduce a novel approach to encode ordinality into a binary\nloss function showing an application to solar flare prediction, (ii) We enhance\nsolar flare forecasting by enabling flare predictions for each AR across the\nentire solar disk, without any longitudinal restrictions, and evaluate and\ncompare performance. (iii) Our candidate model, optimized with the proposed\nloss function, shows an improvement of $\\sim$7%, $\\sim$4%, and $\\sim$3% for AR\npatches within $\\pm$30$^\\circ$, $\\pm$60$^\\circ$, and $\\pm$90$^\\circ$ of solar\nlongitude, respectively in terms of CSS, when compared with standard BCE.\nAdditionally, we demonstrate the ability to issue flare forecasts for ARs in\nnear-limb regions (regions between $\\pm$60$^{\\circ}$ to $\\pm$90$^{\\circ}$) with\na CSS=0.34 (TSS=0.50 and HSS=0.23), expanding the scope of AR-based models for\nsolar flare prediction. This advances the reliability of solar flare forecasts,\nleading to more effective prediction capabilities.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Solar and Stellar Astrophysics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}