{"id":"2408.04403","title":"Exploring Reasoning Biases in Large Language Models Through Syllogism:\n  Insights from the NeuBAROCO Dataset","authors":"Kentaro Ozeki, Risako Ando, Takanobu Morishita, Hirohiko Abe, Koji\n  Mineshima, Mitsuhiro Okada","authorsParsed":[["Ozeki","Kentaro",""],["Ando","Risako",""],["Morishita","Takanobu",""],["Abe","Hirohiko",""],["Mineshima","Koji",""],["Okada","Mitsuhiro",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 12:10:50 GMT"}],"updateDate":"2024-08-09","timestamp":1723119050000,"abstract":"  This paper explores the question of how accurately current large language\nmodels can perform logical reasoning in natural language, with an emphasis on\nwhether these models exhibit reasoning biases similar to humans. Specifically,\nour study focuses on syllogistic reasoning, a form of deductive reasoning\nextensively studied in cognitive science as a natural form of human reasoning.\nWe present a syllogism dataset called NeuBAROCO, which consists of syllogistic\nreasoning problems in English and Japanese. This dataset was originally\ndesigned for psychological experiments to assess human reasoning capabilities\nusing various forms of syllogisms. Our experiments with leading large language\nmodels indicate that these models exhibit reasoning biases similar to humans,\nalong with other error tendencies. Notably, there is significant room for\nimprovement in reasoning problems where the relationship between premises and\nhypotheses is neither entailment nor contradiction. We also present\nexperimental results and in-depth analysis using a new Chain-of-Thought\nprompting method, which asks LLMs to translate syllogisms into abstract logical\nexpressions and then explain their reasoning process. Our analysis using this\nmethod suggests that the primary limitations of LLMs lie in the reasoning\nprocess itself rather than the interpretation of syllogisms.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}