{"id":"2408.03731","title":"The R-Process Alliance: Fifth Data Release from the Search for\n  R-Process-Enhanced Metal-poor Stars in the Galactic Halo with the GTC","authors":"Avrajit Bandyopadhyay, Rana Ezzeddine, Carlos Allende Prieto, Nima\n  Aria, Shivani P. Shah, Timothy C. Beers, Anna Frebel, Terese T. Hansen, Erika\n  M. Holmbeck, Vinicius M. Placco, Ian U. Roederer, and Charli M. Sakari","authorsParsed":[["Bandyopadhyay","Avrajit",""],["Ezzeddine","Rana",""],["Prieto","Carlos Allende",""],["Aria","Nima",""],["Shah","Shivani P.",""],["Beers","Timothy C.",""],["Frebel","Anna",""],["Hansen","Terese T.",""],["Holmbeck","Erika M.",""],["Placco","Vinicius M.",""],["Roederer","Ian U.",""],["Sakari","Charli M.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 12:38:07 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 18:36:39 GMT"}],"updateDate":"2024-08-26","timestamp":1723034287000,"abstract":"  Understanding the abundance pattern of metal-poor stars and the production of\nheavy elements through various nucleosynthesis processes offers crucial\ninsights into the chemical evolution of the Milky Way, revealing primary sites\nand major sources of rapid neutron-capture process ($r$-process) material in\nthe Universe. In this fifth data release from the $R$-Process Alliance, we\npresent the detailed chemical abundances of 41 faint (down to V = 15.8) and\nextremely metal-poor (down to [Fe/H] = -3.3) halo stars selected from the\nR-Process Alliance (RPA). We obtained high-resolution spectra for these objects\nwith the HORuS spectrograph on the Gran Telescopio Canarias. We measure the\nabundances of light, alpha, Fe-peak, and neutron-capture elements. We report\nthe discovery of five CEMP, one limited-$r$, three $r$-I, and four $r$-II\nstars, and six Mg-poor stars. We also identify one star of a possible globular\ncluster origin at an extremely low metallicity at [Fe/H] = -3.0. This adds to\nthe growing evidence of a lower limit metallicity floor for globular cluster\nabundances. We use the abundances of Fe-peak elements and the alpha-elements to\ninvestigate the contributions from different nucleosynthesis channels in the\nprogenitor supernovae. We find the distribution of [Mg/Eu] as a function of\n[Fe/H] to have different enrichment levels, indicating different possible\npathways and sites of their production. We also reveal differences in the\ntrends of the neutron-capture element abundances of Sr, Ba, and Eu of various\n$r$-I and $r$-II stars from the RPA data releases, which provide constraints on\ntheir nucleosynthesis sites and subsequent evolution.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}