{"id":"2408.09892","title":"Magnetophotogalvanic Effects Driven by Terahertz Radiation in CdHgTe\n  Crystals with Kane Fermions","authors":"M. D. Moldavskaya, L. E. Golub, V. V. Bel'kov, S. N. Danilov, D. A.\n  Kozlov, J. Wunderlich, D. Weiss, N. N. Mikhailov, S. A. Dvoretsky, S. S.\n  Krishtopenko, B. Benhamou-Bui, F. Teppe, and S. D. Ganichev","authorsParsed":[["Moldavskaya","M. D.",""],["Golub","L. E.",""],["Bel'kov","V. V.",""],["Danilov","S. N.",""],["Kozlov","D. A.",""],["Wunderlich","J.",""],["Weiss","D.",""],["Mikhailov","N. N.",""],["Dvoretsky","S. A.",""],["Krishtopenko","S. S.",""],["Benhamou-Bui","B.",""],["Teppe","F.",""],["Ganichev","S. D.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 11:08:02 GMT"}],"updateDate":"2024-08-20","timestamp":1724065682000,"abstract":"  We report on the observation and comprehensive study of the terahertz\nradiation induced magneto-photogalvanic effect (MPGE) in bulk CdHgTe crystals\nhosting Kane fermions. The MPGE has been detected in Cd$_{x}$Hg$_{1-x}$Te films\nwith Cd contents $x = 0.15$ and $0.22$ subjected to an in-plane magnetic field.\nAt liquid helium temperature we observed multiple resonances in MPGE current\nupon variation of magnetic field. In the $x = 0.22$ with noninverted band\nstructure, the resonances are caused by cyclotron resonance (CR) and\nphotoionization of an impurity level. In the $x = 0.15$ films with an inverted\nband structure, they originate from the CR and interband optical transitions.\nBand structure calculated by the Kane model perfectly describes positions of\nall resonances. In particularly, the resonant MPGE caused by interband\ntransitions excited by THz radiation is caused by the gapless energy spectrum\nof Kane fermions realized in materials with certain Cd contents and temperature\nrange. In addition to the resonant MPGE current we detected a nonresonant one\ndue to indirect optical transitions (Drude-like). This contribution has a\nnonmonotonic magnetic field dependence increasing linearly at low magnetic\nfield $B$, approaching a maximum at moderate field and decreasing at high $B$.\nWhile the nonresonant MPGE decreases drastically with increasing temperature,\nit is well measurable up to room temperature. The developed theory demonstrates\nthat the MPGE current arises due to cubic in momentum spin-dependent terms in\nthe scattering probability. The asymmetry caused by these effects results in a\npure spin current which is converted into an electric current due to the Zeeman\neffect.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}