{"id":"2408.01028","title":"Harnessing Ferro-Valleytricity in Penta-Layer Rhombohedral Graphene for\n  Memory and Compute","authors":"Md Mazharul Islam, Shamiul Alam, Md Rahatul Islam Udoy, Md Shafayat\n  Hossain, Kathleen E Hamilton, and Ahmedullah Aziz","authorsParsed":[["Islam","Md Mazharul",""],["Alam","Shamiul",""],["Udoy","Md Rahatul Islam",""],["Hossain","Md Shafayat",""],["Hamilton","Kathleen E",""],["Aziz","Ahmedullah",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 05:58:52 GMT"}],"updateDate":"2024-08-05","timestamp":1722578332000,"abstract":"  Two-dimensional materials with multiple degrees of freedom, including spin,\nvalleys, and orbitals, open up an exciting avenue for engineering\nmultifunctional devices. Beyond spintronics, these degrees of freedom can lead\nto novel quantum effects such as valley-dependent Hall effects and orbital\nmagnetism, which could revolutionize next-generation electronics. However,\nachieving independent control over valley polarization and orbital magnetism\nhas been a challenge due to the need for large electric fields. A recent\nbreakthrough involving penta-layer rhombohedral graphene has demonstrated the\nability to individually manipulate anomalous Hall signals and orbital magnetic\nhysteresis, forming what is known as a valley-magnetic quartet. Here, we\nleverage the electrically tunable Ferro-valleytricity of penta-layer\nrhombohedral graphene to develop non-volatile memory and in-memory computation\napplications. We propose an architecture for a dense, scalable, and\nselector-less non-volatile memory array that harnesses the electrically tunable\nferro-valleytricity. In our designed array architecture, non-destructive read\nand write operations are conducted by sensing the valley state through two\ndifferent pairs of terminals, allowing for independent optimization of\nread/write peripheral circuits. The power consumption of our PRG-based array is\nremarkably low, with only ~ 6 nW required per write operation and ~ 2.3 nW per\nread operation per cell. This consumption is orders of magnitude lower than\nthat of the majority of state-of-the-art cryogenic memories. Additionally, we\nengineer in-memory computation by implementing majority logic operations within\nour proposed non-volatile memory array without modifying the peripheral\ncircuitry. Our framework presents a promising pathway toward achieving\nultra-dense cryogenic memory and in-memory computation capabilities.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/"}