{"id":"2408.15149","title":"LLOT: application of Laplacian Linear Optimal Transport in spatial\n  transcriptome reconstruction","authors":"Junhao Zhu, Kevin Zhang, Dehan Kong and Zhaolei Zhang","authorsParsed":[["Zhu","Junhao",""],["Zhang","Kevin",""],["Kong","Dehan",""],["Zhang","Zhaolei",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 15:41:58 GMT"}],"updateDate":"2024-08-28","timestamp":1724773318000,"abstract":"  Single-cell RNA sequencing (scRNA-seq) allows transcriptional profiling, and\ncell-type annotation of individual cells. However, sample preparation in\ntypical scRNA-seq experiments often homogenizes the samples, thus spatial\nlocations of individual cells are often lost. Although spatial transcriptomic\ntechniques, such as in situ hybridization (ISH) or Slide-seq, can be used to\nmeasure gene expression in specific locations in samples, it remains a\nchallenge to measure or infer expression level for every gene at a single-cell\nresolution in every location in tissues. Existing computational methods show\npromise in reconstructing these missing data by integrating scRNA-seq data with\nspatial expression data such as those obtained from spatial transcriptomics.\nHere we describe Laplacian Linear Optimal Transport (LLOT), an interpretable\nmethod to integrate single-cell and spatial transcriptomics data to reconstruct\nmissing information at a whole-genome and single-cell resolution. LLOT\niteratively corrects platform effects and employs Laplacian Optimal Transport\nto decompose each spot in spatial transcriptomics data into a spatially-smooth\nprobabilistic mixture of single cells. We benchmarked LLOT against several\nother methods on datasets of Drosophila embryo, mouse cerebellum and synthetic\ndatasets generated by scDesign3 in the paper, and another three datasets in the\nsupplementary. The results showed that LLOT consistently outperformed others in\nreconstructing spatial expressions.\n","subjects":["Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}