{"id":"2408.12563","title":"Climate Bistability at the Inner Edge of the Habitable Zone due to\n  Runaway Greenhouse and Cloud Feedbacks","authors":"Bowen Fan, Da Yang, Dorian S. Abbot","authorsParsed":[["Fan","Bowen",""],["Yang","Da",""],["Abbot","Dorian S.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 17:25:59 GMT"}],"updateDate":"2024-09-06","timestamp":1724347559000,"abstract":"  Understanding the climate dynamics at the inner edge of the habitable zone\n(HZ) is crucial for predicting the habitability of rocky exoplanets. Previous\nstudies using Global Climate Models (GCMs) have indicated that planets\nreceiving high stellar flux can exhibit climate bifurcations, leading to\nbistability between a cold (temperate) and a hot (runaway) climate. However,\nthe mechanism causing this bistability has not been fully explained, in part\ndue to the difficulty associated with inferring mechanisms from small numbers\nof expensive numerical simulations in GCMs. In this study, we employ a\ntwo-column (dayside and nightside), two-layer climate model to investigate the\nphysical mechanisms driving this bistability. Through mechanism-denial\nexperiments, we demonstrate that the runaway greenhouse effect, coupled with a\ncloud feedback on either the dayside or nightside, leads to climate\nbistability. We also map out the parameters that control the location of the\nbifurcations and size of the bistability. This work identifies which mechanisms\nand GCM parameters control the stellar flux at which rocky planets are likely\nto retain a hot, thick atmosphere if they experience a hot start. This is\ncritical for the prioritization of targets and interpretation of observations\nby the James Webb Space Telescope (JWST). Furthermore, our modeling framework\ncan be extended to planets with different condensable species and cloud types.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Rs_eGdv_ubncoTKv4ByAdPpdykvj_7_izgvSAXraRUw","pdfSize":"749991"}
