{"id":"2408.11859","title":"Gradient Reduction Convolutional Neural Network Policy for Financial\n  Deep Reinforcement Learning","authors":"Sina Montazeri, Haseebullah Jumakhan, Sonia Abrasiabian, Amir\n  Mirzaeinia","authorsParsed":[["Montazeri","Sina",""],["Jumakhan","Haseebullah",""],["Abrasiabian","Sonia",""],["Mirzaeinia","Amir",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 11:39:03 GMT"}],"updateDate":"2024-08-23","timestamp":1723808343000,"abstract":"  Building on our prior explorations of convolutional neural networks (CNNs)\nfor financial data processing, this paper introduces two significant\nenhancements to refine our CNN model's predictive performance and robustness\nfor financial tabular data. Firstly, we integrate a normalization layer at the\ninput stage to ensure consistent feature scaling, addressing the issue of\ndisparate feature magnitudes that can skew the learning process. This\nmodification is hypothesized to aid in stabilizing the training dynamics and\nimproving the model's generalization across diverse financial datasets.\nSecondly, we employ a Gradient Reduction Architecture, where earlier layers are\nwider and subsequent layers are progressively narrower. This enhancement is\ndesigned to enable the model to capture more complex and subtle patterns within\nthe data, a crucial factor in accurately predicting financial outcomes. These\nadvancements directly respond to the limitations identified in previous\nstudies, where simpler models struggled with the complexity and variability\ninherent in financial applications. Initial tests confirm that these changes\nimprove accuracy and model stability, suggesting that deeper and more nuanced\nnetwork architectures can significantly benefit financial predictive tasks.\nThis paper details the implementation of these enhancements and evaluates their\nimpact on the model's performance in a controlled experimental setting.\n","subjects":["Quantitative Finance/Computational Finance","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"UjYl11T68N3Nvnee_EQE2ywyaBQe0xTK0HO0J2D-K2A","pdfSize":"333391"}
