{"id":"2408.11595","title":"Systematic study of confinement induced effects on atomic electronic\n  structure","authors":"Hugo {\\AA}str\\\"om and Susi Lehtola","authorsParsed":[["Åström","Hugo",""],["Lehtola","Susi",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 13:05:21 GMT"}],"updateDate":"2024-08-22","timestamp":1724245521000,"abstract":"  We point out that although a litany of studies have been published on atoms\nin hard-wall confinement, they have either not been systematic, having only\nlooked at select atoms and/or select electronic configurations, or they have\nnot used robust numerical methods. To remedy the situation, we perform in this\nwork a methodical study of atoms in hard-wall confinement with the HelFEM\nprogram, which employs the finite element method (FEM) that trivially\nimplements the hard-wall potential, guarantees variational results, and allows\neasily finding the numerically exact solution.\n  We systematically examine low lying configurations of the H-Xe atoms and\ntheir monocations, and investigate how the states - especially the ground state\n- behave as a function of the position of the hard-wall boundary. Our fully\nnumerical calculations are based on non-relativistic density functional theory\n(DFT), employing the Perdew-Burke-Ernzerhof (PBE) exchange-correlation\nfunctional and spherically averaged densities. We consider calculations with\nboth spin-polarized as well as spin-restricted densities, and demonstrate that\nspin-polarization effects are significant in open shell configurations, even\nthough some previous studies have only considered the spin-restricted model.\n  We demonstrate the importance of considering ground state changes for\nconfined atoms by computing the ionization radii for the H-Xe atoms and observe\nsignificant differences to earlier studies. Confirming previous observations,\nwe identify electron shifts on the outermost shells for a majority of the\nelements: valence $s$ electrons are highly unfavored under strong confinement,\nand the high-lying $3d$ and $4f$ orbitals become occupied in atoms of periods\n2-3 and 4, respectively.\n","subjects":["Physics/Atomic Physics","Physics/Chemical Physics","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}