{"id":"2408.06042","title":"Understanding Byzantine Robustness in Federated Learning with A\n  Black-box Server","authors":"Fangyuan Zhao, Yuexiang Xie, Xuebin Ren, Bolin Ding, Shusen Yang,\n  Yaliang Li","authorsParsed":[["Zhao","Fangyuan",""],["Xie","Yuexiang",""],["Ren","Xuebin",""],["Ding","Bolin",""],["Yang","Shusen",""],["Li","Yaliang",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 10:18:24 GMT"}],"updateDate":"2024-08-13","timestamp":1723457904000,"abstract":"  Federated learning (FL) becomes vulnerable to Byzantine attacks where some of\nparticipators tend to damage the utility or discourage the convergence of the\nlearned model via sending their malicious model updates. Previous works propose\nto apply robust rules to aggregate updates from participators against different\ntypes of Byzantine attacks, while at the same time, attackers can further\ndesign advanced Byzantine attack algorithms targeting specific aggregation rule\nwhen it is known. In practice, FL systems can involve a black-box server that\nmakes the adopted aggregation rule inaccessible to participants, which can\nnaturally defend or weaken some Byzantine attacks. In this paper, we provide an\nin-depth understanding on the Byzantine robustness of the FL system with a\nblack-box server. Our investigation demonstrates the improved Byzantine\nrobustness of a black-box server employing a dynamic defense strategy. We\nprovide both empirical evidence and theoretical analysis to reveal that the\nblack-box server can mitigate the worst-case attack impact from a maximum level\nto an expectation level, which is attributed to the inherent inaccessibility\nand randomness offered by a black-box server.The source code is available at\nhttps://github.com/alibaba/FederatedScope/tree/Byzantine_attack_defense to\npromote further research in the community.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}