{"id":"2408.02387","title":"Dirichlet problem on perturbed conical domains via converging\n  generalized power series","authors":"Martin Costabel, Matteo Dalla Riva, Monique Dauge, Paolo Musolino","authorsParsed":[["Costabel","Martin",""],["Riva","Matteo Dalla",""],["Dauge","Monique",""],["Musolino","Paolo",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 11:24:01 GMT"}],"updateDate":"2024-08-06","timestamp":1722857041000,"abstract":"  We consider the Poisson equation with homogeneous Dirichlet conditions in a\nfamily of domains in $R^{n}$ indexed by a small parameter $\\epsilon$. The\ndomains depend on $\\epsilon$ only within a ball of radius proportional to\n$\\epsilon$ and, as $\\epsilon$ tends to zero, they converge in a self-similar\nway to a domain with a conical boundary singularity. We construct an expansion\nof the solution as a series of fractional powers of $\\epsilon$, and prove that\nit is not just an asymptotic expansion as $\\epsilon\\to0$, but that, for small\nvalues of $\\epsilon$, it converges normally in the Sobolev space $H^{1}$. The\nphenomenon that solutions to boundary value problems on singularly perturbed\ndomains may have convergent expansions is the subject of the Functional\nAnalytic Approach by Lanza de Cristoforis and his collaborators. This approach\nwas originally adopted to study small holes shrinking to interior points of a\nsmooth domain and heavily relies on integral representations obtained through\nlayer potentials. To relax all regularity assumptions, we forgo boundary layer\npotentials and instead exploit expansions in terms of eigenfunctions of the\nLaplace-Beltrami operator on the intersection of the cone with the unit sphere.\nOur analysis is based on a two-scale cross-cutoff ansatz for the solution.\nSpecifically, we write the solution as a sum of a function in the slow variable\nmultiplied by a cutoff function depending on the fast variable, plus a function\nin the fast variable multiplied by a cutoff function depending on the slow\nvariable. While the cutoffs are considered fixed, the two unknown functions are\nsolutions to a $2\\times2$ system of partial differential equations that depend\non $\\epsilon$ in a way that can be analyzed in the framework of generalized\npower series when the right-hand side of the Poisson equation vanishes in a\nneighborhood of the perturbation.\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9RmrEbfTW3mq3dI5W90I-sb3T3wfWWuznjADv8sbGyI","pdfSize":"620672","txDigest":"8QUSYipVuR71wXudJJUFUneyBPkJdrWC18jdrWNyb4Fa","endEpoch":"1","status":"CERTIFIED"}
