{"id":"2408.13074","title":"Hierarchical Spatio-Temporal State-Space Modeling for fMRI Analysis","authors":"Yuxiang Wei, Anees Abrol, Reihaneh Hassanzadeh, Vince Calhoun","authorsParsed":[["Wei","Yuxiang",""],["Abrol","Anees",""],["Hassanzadeh","Reihaneh",""],["Calhoun","Vince",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 13:58:14 GMT"}],"updateDate":"2024-08-26","timestamp":1724421494000,"abstract":"  Recent advances in deep learning structured state space models, especially\nthe Mamba architecture, have demonstrated remarkable performance improvements\nwhile maintaining linear complexity. In this study, we introduce functional\nspatiotemporal Mamba (FST-Mamba), a Mamba-based model designed for discovering\nneurological biomarkers using functional magnetic resonance imaging (fMRI). We\nfocus on dynamic functional network connectivity (dFNC) derived from fMRI and\npropose a hierarchical spatiotemporal Mamba-based network that processes\nspatial and temporal information separately using Mamba-based encoders.\nLeveraging the topological uniqueness of the FNC matrix, we introduce a\ncomponent-wise varied-scale aggregation (CVA) mechanism to aggregate\nconnectivity across individual components within brain networks, enabling the\nmodel to capture both inter-component and inter-network information. To better\nhandle the FNC data, we develop a new component-specific scanning order.\nAdditionally, we propose symmetric rotary position encoding (SymRope) to encode\nthe relative positions of each functional connection while considering the\nsymmetric nature of the FNC matrix. Experimental results demonstrate\nsignificant improvements in the proposed FST-Mamba model on various brain-based\nclassification and regression tasks. Our work reveals the substantial potential\nof attention-free sequence modeling in brain discovery.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"V2kVn4ZoVknOSxRCUvUmkJMauPBOq-YQYnDukbOHCAY","pdfSize":"802037"}
