{"id":"2408.15338","title":"Collapsar disk outflows II: Heavy element production","authors":"Coleman Dean, Rodrigo Fern\\'andez","authorsParsed":[["Dean","Coleman",""],["Fernández","Rodrigo",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 18:01:25 GMT"}],"updateDate":"2024-08-29","timestamp":1724781685000,"abstract":"  We investigate nucleosynthesis in the sub-relativistic outflows from black\nhole (BH) accretion disks formed in failed supernovae from rapidly-rotating\nWolf-Rayet stars. These disks reach the neutrino-cooled regime during a portion\nof their evolution, undergoing significant neutronization and thus having the\npotential to support the $r$-process. Here, we analyze the formation of heavy\nelements in the ejecta from global, axisymmetric, long-term, viscous\nhydrodynamic simulations of these systems that include neutrino emission and\nabsorption, Newtonian self-gravity, a pseudo-Newtonian potential for the BH\ngravity, and a 19-isotope nuclear network. Tracer particles are used for\npost-processing with a larger network. In addition to analyzing models from a\nprevious paper, we present new models in which we modify the rotation profile\nof the progenitor star, to maximize neutrino reprocessing of circularized mass\nshells. All of our models produce several $M_\\odot$ of O, followed by about a\nsolar mass of C, Ne, and Ni, with other alpha elements produced in smaller\nquantities. Only one of our models, with the lowest viscosity, yields\nsignificant amounts of first $r$-process peak elements, with negligible yields\nat higher nuclear masses. The rest of the set, including models with a modified\nrotation profile, produces very small or negligible quantities of elements\nbeyond the iron group. Models that produce the heaviest elements (up to\n$A\\sim200$) do so along the proton-rich side of the valley of stability at high\nentropy ($s/k_B\\sim80$), pointing to the $rp$-process as a mechanism that\noperates in collapsars. The absence of neutron-rich ejecta proves to be\ninsensitive to changes in the rotation profile of the star, suggesting that\nheavy $r$-process elements are difficult to produce in collapsars if no\nlarge-scale poloidal magnetic field is present in the disk to drive outflows\nduring neutronization.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}