{"id":"2408.05358","title":"GesturePrint: Enabling User Identification for mmWave-based Gesture\n  Recognition Systems","authors":"Lilin Xu, Keyi Wang, Chaojie Gu, Xiuzhen Guo, Shibo He, Jiming Chen","authorsParsed":[["Xu","Lilin",""],["Wang","Keyi",""],["Gu","Chaojie",""],["Guo","Xiuzhen",""],["He","Shibo",""],["Chen","Jiming",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 17:39:23 GMT"}],"updateDate":"2024-08-13","timestamp":1721929163000,"abstract":"  The millimeter-wave (mmWave) radar has been exploited for gesture\nrecognition. However, existing mmWave-based gesture recognition methods cannot\nidentify different users, which is important for ubiquitous gesture interaction\nin many applications. In this paper, we propose GesturePrint, which is the\nfirst to achieve gesture recognition and gesture-based user identification\nusing a commodity mmWave radar sensor. GesturePrint features an effective\npipeline that enables the gesture recognition system to identify users at a\nminor additional cost. By introducing an efficient signal preprocessing stage\nand a network architecture GesIDNet, which employs an attention-based\nmultilevel feature fusion mechanism, GesturePrint effectively extracts unique\ngesture features for gesture recognition and personalized motion pattern\nfeatures for user identification. We implement GesturePrint and collect data\nfrom 17 participants performing 15 gestures in a meeting room and an office,\nrespectively. GesturePrint achieves a gesture recognition accuracy (GRA) of\n98.87% with a user identification accuracy (UIA) of 99.78% in the meeting room,\nand 98.22% GRA with 99.26% UIA in the office. Extensive experiments on three\npublic datasets and a new gesture dataset show GesturePrint's superior\nperformance in enabling effective user identification for gesture recognition\nsystems.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}