{"id":"2408.09795","title":"Periodicity search in the timing of the 25 millisecond pulsars from the\n  second data release of the European Pulsar Timing Array","authors":"Iuliana Nitu, Michael Keith, David Champion, Ismael Cognard, Gregory\n  Desvignes, Lucas Guillemot, Yanjun Guo, Huanchen Hu, Jiwoong Jang, Jedrzej\n  Jawor, Ramesh Karuppusamy, Evan Keane, Michael Kramer, Kristen Lackeos, Kuo\n  Liu, Robert Main, Delphine Perrodin, Nataliya Porayko, Golam Shaifullah,\n  Gilles Theureau","authorsParsed":[["Nitu","Iuliana",""],["Keith","Michael",""],["Champion","David",""],["Cognard","Ismael",""],["Desvignes","Gregory",""],["Guillemot","Lucas",""],["Guo","Yanjun",""],["Hu","Huanchen",""],["Jang","Jiwoong",""],["Jawor","Jedrzej",""],["Karuppusamy","Ramesh",""],["Keane","Evan",""],["Kramer","Michael",""],["Lackeos","Kristen",""],["Liu","Kuo",""],["Main","Robert",""],["Perrodin","Delphine",""],["Porayko","Nataliya",""],["Shaifullah","Golam",""],["Theureau","Gilles",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 08:42:52 GMT"}],"updateDate":"2024-08-20","timestamp":1724056972000,"abstract":"  In this work, we investigated the presence of strictly periodic, as well as\nquasi-periodic signals, in the timing of the 25 millisecond pulsars from the\nEPTA DR2 dataset. This is especially interesting in the context of the recent\nhints of a gravitational wave background in these data, and the necessary\nfurther study of red-noise timing processes, which are known to behave\nquasi-periodically in some normal pulsars. We used Bayesian timing models\ndeveloped through the run_enterprise pipeline: a strict periodicity was\nmodelled as the influence of a planetary companion on the pulsar, while a\nquasi-periodicity was represented as a Fourier-domain Gaussian process. We\nfound that neither model would clearly improve the timing models of the 25\nmillisecond pulsars in this dataset. This implies that noise and parameter\nestimates are unlikely to be biased by the presence of a (quasi-)periodicity in\nthe timing data. Nevertheless, the results for PSRs J1744--1134 and J1012+5307\nsuggest that the standard noise models for these pulsars may not be sufficient.\nWe also measure upper limits for the projected masses of planetary companions\naround each of the 25 pulsars. The data of PSR J1909--3744 yielded the best\nmass limits, such that we constrained the 95-percentile to 2*10^{-4}\nEarth-masses (roughly the mass of the dwarf planet Ceres) for orbital periods\nbetween 5 d--17 yr. These are the best pulsar planet mass limits to date.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}