{"id":"2408.17257","title":"Likelihood estimation for stochastic differential equations with mixed\n  effects","authors":"Fernando Baltazar-Larios and Mogens Bladt and Michael S{\\o}rensen","authorsParsed":[["Baltazar-Larios","Fernando",""],["Bladt","Mogens",""],["Sørensen","Michael",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 12:56:16 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 20:58:17 GMT"}],"updateDate":"2024-09-06","timestamp":1725022576000,"abstract":"  Stochastic differential equations provide a powerful tool for modelling\ndynamic phenomena affected by random noise. In case of repeated observations of\ntime series for several experimental units, it is often the case that some of\nthe parameters vary between the individual experimental units, which has\nmotivated a considerable interest in stochastic differential equations with\nmixed effects, where a subset of the parameters are random. These models enable\nsimultaneous representation of randomness in the dynamics and variability\nbetween experimental units. When the data are observations at discrete time\npoints, the likelihood function is only rarely explicitly available, so for\nlikelihood-based inference to be feasible, numerical methods are needed. We\npresent Gibbs samplers and stochastic EM-algorithms based on augmented data\nobtained by the simple method for simulation of diffusion bridges in Bladt and\nS{\\o}rensen (2014). This method is easy to implement and has no tuning\nparameters. The method is, moreover, computationally efficient at low sampling\nfrequencies because the computing time increases linearly with the time between\nobservations. The algorithms can be extended to models with measurement errors.\nThe Gibbs sampler as well as the EM-algorithm are shown to simplify\nconsiderably for exponential families of diffusion processes, including many\nmodels used in practice. In a simulation study, the estimation methods are\nshown to work well for Ornstein-Uhlenbeck processes and t-diffusions with mixed\neffects. Finally, the Gibbs sampler is applied to neuronal data.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lDQHPkYwtUgiebT58mQWQ5S2eEgpWS9LR41fe_cC79M","pdfSize":"1021721"}
