{"id":"2408.00224","title":"Regular Kerr black holes: The fellowship of the string","authors":"Marcos L. W. Basso and Vilson T. Zanchin","authorsParsed":[["Basso","Marcos L. W.",""],["Zanchin","Vilson T.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 01:33:31 GMT"}],"updateDate":"2024-08-02","timestamp":1722476011000,"abstract":"  In their interesting article entitled \"Kerrr\" black hole: The lord of the\nstring [Phys. Lett. B bf 688, 82 (2010)], Smailagic and Spallucci report on a\nregular Kerr-like black hole spacetime with a string in the central region. The\nmetric is of the Kerr-Schild form with a particular mass function, that is\nchosen in order to avoid the ring singularity of the Kerr metric. However, as\nit is known, even for a class of well-behaved mass functions, the curvature\nscalars present a discontinuity in the equatorial plane at the ring. The\nauthors associate such a discontinuity with the presence of a string of matter\nand join the interior and exterior regions of the string by making a particular\nchoice of the orientations of the normal vectors at each side of the ring.\nDifferently from what was interpreted by the authors, we show here that the\nstring is not rotating in the scenario of that work. We also show that the\nchoice regarding the normal vector orientation leads to a geometry that is not\ncompatible with the center of a rotating black hole in an asymptotically flat\nspacetime. We then consider all the four possible combinations of the normal\nvector orientation at each side of the ring and, by using the Darmois-Israel\nformalism, interpret each resulting solution. We show that, out of the four\npossibilities, only one of the four models for the thin shell solution at the\nring yields the appropriate geometry. More importantly, this solution does not\ncorrespond to the one obtained by Smailagic and Spallucci. Finally, we also\ndiscuss a scenario where the string is indeed rotating.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}