{"id":"2408.14898","title":"Thermodynamics of mixtures containing a very strongly polar compound.\n  11. 1-Alkanol + alkanenitrile systems","authors":"Juan Antonio Gonz\\'alez, Fernando Hevia, Ana Cobos, Isa\\'ias Garc\\'ia\n  de la Fuente, Cristina Alonso Trist\\'an","authorsParsed":[["González","Juan Antonio",""],["Hevia","Fernando",""],["Cobos","Ana",""],["de la Fuente","Isaías García",""],["Tristán","Cristina Alonso",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 09:23:06 GMT"}],"updateDate":"2024-08-28","timestamp":1724750586000,"abstract":"  1-Alkanol + alkanenitrile systems have been studied by means of the DISQUAC,\nERAS and UNIFAC (Dortmund) models. DISQUAC and ERAS parameters for the\nalkanol/nitrile interactions are reported. DISQUAC describes a whole set of\nthermodynamic properties: phase equilibria, vapour-liquid (VLE), liquid-liquid\n(LLE) and solid-liquid (SLE) equilibria, molar excess functions, Gibbs\nenergies, $G_{\\text{m}}^{\\text{E}}$, and enthalpies, $H_{\\text{m}}^{\\text{E}}$,\nand partial excess molar enthalpies at infinite dilution,\n$H_{\\text{mi}}^{\\text{E,}\\infty }$ using the same set of interaction parameters\nfor each solution. The dependence on the molecular structure of the interaction\nparameters is similar to that observed in other previous applications to\nmixtures formed by 1-alkanols and a strongly polar compound, in such way that\nthe quasichemical interchange coefficients can be kept constant from\n1-propanol. However, methanol and ethanol solutions behave differently. From\nthe analysis of experimental data for $H_{\\text{m}}^{\\text{E}}$,\n$TS_{\\text{m}}^{\\text{E}}(=H_{\\text{m}}^{\\text{E}}-G_{\\text{m}}^{\\text{E}})$,\nand molar excess volumes, $V_{\\text{m}}^{\\text{E}}$, it is concluded that the\nstudied systems are characterized by dipolar interactions and strong structural\neffects. The former are more relevant in acetonitrile solutions. Association\neffects are more important in butanenitrile mixtures. DISQUAC improves\n$H_{\\text{m}}^{\\text{E}}$ results from the ERAS model. ERAS results on\n$H_{\\text{m}}^{\\text{E}}$ for systems containing acetonitrile are also improved\nby UNIFAC. This remarks the importance of dipolar interactions in the\ninvestigated mixtures. ERAS describes the variation of\n$V_{\\text{m}}^{\\text{E}}$(${{x}_{1}}$=0.5) with the 1-alkanol size for mixtures\nwith a given nitrile, but the concentration dependence of this excess function\nis poorly represented.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}