{"id":"2408.13430","title":"Analysis of the ICML 2023 Ranking Data: Can Authors' Opinions of Their\n  Own Papers Assist Peer Review in Machine Learning?","authors":"Buxin Su, Jiayao Zhang, Natalie Collina, Yuling Yan, Didong Li,\n  Kyunghyun Cho, Jianqing Fan, Aaron Roth, Weijie J. Su","authorsParsed":[["Su","Buxin",""],["Zhang","Jiayao",""],["Collina","Natalie",""],["Yan","Yuling",""],["Li","Didong",""],["Cho","Kyunghyun",""],["Fan","Jianqing",""],["Roth","Aaron",""],["Su","Weijie J.",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 01:51:23 GMT"}],"updateDate":"2024-08-27","timestamp":1724464283000,"abstract":"  We conducted an experiment during the review process of the 2023\nInternational Conference on Machine Learning (ICML) that requested authors with\nmultiple submissions to rank their own papers based on perceived quality. We\nreceived 1,342 rankings, each from a distinct author, pertaining to 2,592\nsubmissions. In this paper, we present an empirical analysis of how\nauthor-provided rankings could be leveraged to improve peer review processes at\nmachine learning conferences. We focus on the Isotonic Mechanism, which\ncalibrates raw review scores using author-provided rankings. Our analysis\ndemonstrates that the ranking-calibrated scores outperform raw scores in\nestimating the ground truth ``expected review scores'' in both squared and\nabsolute error metrics. Moreover, we propose several cautious, low-risk\napproaches to using the Isotonic Mechanism and author-provided rankings in peer\nreview processes, including assisting senior area chairs' oversight of area\nchairs' recommendations, supporting the selection of paper awards, and guiding\nthe recruitment of emergency reviewers. We conclude the paper by addressing the\nstudy's limitations and proposing future research directions.\n","subjects":["Statistics/Applications","Computing Research Repository/Digital Libraries","Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}