{"id":"2408.13526","title":"Learning a Factorized Orthogonal Latent Space using Encoder-only\n  Architecture for Fault Detection; An Alarm management perspective","authors":"Vahid MohammadZadeh Eivaghi, Mahdi Aliyari Shoorehdeli","authorsParsed":[["Eivaghi","Vahid MohammadZadeh",""],["Shoorehdeli","Mahdi Aliyari",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 09:00:45 GMT"}],"updateDate":"2024-08-27","timestamp":1724490045000,"abstract":"  False and nuisance alarms in industrial fault detection systems are often\ntriggered by uncertainty, causing normal process variable fluctuations to be\nerroneously identified as faults. This paper introduces a novel encoder-based\nresidual design that effectively decouples the stochastic and deterministic\ncomponents of process variables without imposing detection delay. The proposed\nmodel employs two distinct encoders to factorize the latent space into two\northogonal spaces: one for the deterministic part and the other for the\nstochastic part. To ensure the identifiability of the desired spaces,\nconstraints are applied during training. The deterministic space is constrained\nto be smooth to guarantee determinism, while the stochastic space is required\nto resemble standard Gaussian noise. Additionally, a decorrelation term\nenforces the independence of the learned representations. The efficacy of this\napproach is demonstrated through numerical examples and its application to the\nTennessee Eastman process, highlighting its potential for robust fault\ndetection. By focusing decision logic solely on deterministic factors, the\nproposed model significantly enhances prediction quality while achieving nearly\nzero false alarms and missed detections, paving the way for improved\noperational safety and integrity in industrial environments.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}