{"id":"2408.14874","title":"Inverse-Q*: Token Level Reinforcement Learning for Aligning Large\n  Language Models Without Preference Data","authors":"Han Xia, Songyang Gao, Qiming Ge, Zhiheng Xi, Qi Zhang, Xuanjing Huang","authorsParsed":[["Xia","Han",""],["Gao","Songyang",""],["Ge","Qiming",""],["Xi","Zhiheng",""],["Zhang","Qi",""],["Huang","Xuanjing",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 08:43:32 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 13:49:40 GMT"}],"updateDate":"2024-08-30","timestamp":1724748212000,"abstract":"  Reinforcement Learning from Human Feedback (RLHF) has proven effective in\naligning large language models with human intentions, yet it often relies on\ncomplex methodologies like Proximal Policy Optimization (PPO) that require\nextensive hyper-parameter tuning and present challenges in sample efficiency\nand stability. In this paper, we introduce Inverse-Q*, an innovative framework\nthat transcends traditional RL methods by optimizing token-level reinforcement\nlearning without the need for additional reward or value models. Inverse-Q*\nleverages direct preference optimization techniques but extends them by\nestimating the conditionally optimal policy directly from the model's\nresponses, facilitating more granular and flexible policy shaping. Our approach\nreduces reliance on human annotation and external supervision, making it\nespecially suitable for low-resource settings. We present extensive\nexperimental results demonstrating that Inverse-Q* not only matches but\npotentially exceeds the effectiveness of PPO in terms of convergence speed and\nthe alignment of model responses with human preferences. Our findings suggest\nthat Inverse-Q* offers a practical and robust alternative to conventional RLHF\napproaches, paving the way for more efficient and adaptable model training\napproaches.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}