{"id":"2408.17018","title":"A machine learning based material homogenization technique for in-plane\n  loaded masonry walls","authors":"Alejandro Cornejo, Philip Kalkbrenner, Riccardo Rossi, Luca Pel\\`a","authorsParsed":[["Cornejo","Alejandro",""],["Kalkbrenner","Philip",""],["Rossi","Riccardo",""],["Pelà","Luca",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 05:18:40 GMT"}],"updateDate":"2024-09-02","timestamp":1724995120000,"abstract":"  In recent years, significant advancements have been made in computational\nmethods for analyzing masonry structures. Within the Finite Element Method, two\nprimary approaches have gained traction: Micro and Macro Scale modeling, and\ntheir subsequent integration via Multi-scale methods based on homogenization\ntheory and the representative volume element concept. While Micro and\nMulti-scale approaches offer high fidelity, they often come with a substantial\ncomputational burden. On the other hand, calibrating homogenized material\nparameters in Macro-scale approaches presents challenges for practical\nengineering problems. Machine learning techniques have emerged as powerful\ntools for training models using vast datasets from various domains. In this\ncontext, we propose leveraging Machine Learning methods to develop a novel\nhomogenization strategy for the in-plane analysis of masonry structures. This\nstrategy involves automatically calibrating a continuum nonlinear damage\nconstitutive law and an appropriate yield criteria using relevant data derived\nfrom Micro-scale analysis. The optimization process not only enhances material\nparameters but also refines yield criteria and damage evolution laws to better\nalign with existing data. To achieve this, a virtual laboratory is created to\nconduct micro-model simulations that account for the individual behaviors of\nconstituent materials. Subsequently, a data isotropization process is employed\nto reconcile the results with typical isotropic constitutive models. Next, an\noptimization algorithm that minimizes the difference of internal dissipated\nwork between the micro and macro scales is executed. We apply this technique to\nthe in-plane homogenization of a Flemish bond masonry wall. Evaluation\nexamples, including simulations of shear and compression tests, demonstrate the\nmethod's accuracy compared to micro modeling of the entire structure.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pTJgdBilcNvPYlFo_0X6X5kFjVtGaOyT6lqJ8l9y-A0","pdfSize":"7888968"}
