{"id":"2408.16914","title":"Experimental measurement and a physical interpretation of quantum shadow\n  enumerators","authors":"Daniel Miller, Kyano Levi, Lukas Postler, Alex Steiner, Lennart\n  Bittel, Gregory A. L. White, Yifan Tang, Eric J. Kuehnke, Antonio A. Mele,\n  Sumeet Khatri, Lorenzo Leone, Jose Carrasco, Christian D. Marciniak, Ivan\n  Pogorelov, Milena Guevara-Bertsch, Robert Freund, Rainer Blatt, Philipp\n  Schindler, Thomas Monz, Martin Ringbauer, Jens Eisert","authorsParsed":[["Miller","Daniel",""],["Levi","Kyano",""],["Postler","Lukas",""],["Steiner","Alex",""],["Bittel","Lennart",""],["White","Gregory A. L.",""],["Tang","Yifan",""],["Kuehnke","Eric J.",""],["Mele","Antonio A.",""],["Khatri","Sumeet",""],["Leone","Lorenzo",""],["Carrasco","Jose",""],["Marciniak","Christian D.",""],["Pogorelov","Ivan",""],["Guevara-Bertsch","Milena",""],["Freund","Robert",""],["Blatt","Rainer",""],["Schindler","Philipp",""],["Monz","Thomas",""],["Ringbauer","Martin",""],["Eisert","Jens",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 21:25:56 GMT"}],"updateDate":"2024-09-02","timestamp":1724966756000,"abstract":"  Throughout its history, the theory of quantum error correction has heavily\nbenefited from translating classical concepts into the quantum setting. In\nparticular, classical notions of weight enumerators, which relate to the\nperformance of an error-correcting code, and MacWilliams' identity, which helps\nto compute enumerators, have been generalized to the quantum case. In this\nwork, we establish a distinct relationship between the theoretical machinery of\nquantum weight enumerators and a seemingly unrelated physics experiment: we\nprove that Rains' quantum shadow enumerators - a powerful mathematical tool -\narise as probabilities of observing fixed numbers of triplets in a Bell\nsampling experiment. This insight allows us to develop here a rigorous\nframework for the direct measurement of quantum weight enumerators, thus\nenabling experimental and theoretical studies of the entanglement structure of\nany quantum error-correcting code or state under investigation. On top of that,\nwe derive concrete sample complexity bounds and physically-motivated robustness\nguarantees against unavoidable experimental imperfections. Finally, we\nexperimentally demonstrate the possibility of directly measuring weight\nenumerators on a trapped-ion quantum computer. Our experimental findings are in\ngood agreement with theoretical predictions and illuminate how entanglement\ntheory and quantum error correction can cross-fertilize each other once Bell\nsampling experiments are combined with the theoretical machinery of quantum\nweight enumerators.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}