{"id":"2408.05479","title":"ReToMe-VA: Recursive Token Merging for Video Diffusion-based\n  Unrestricted Adversarial Attack","authors":"Ziyi Gao, Kai Chen, Zhipeng Wei, Tingshu Mou, Jingjing Chen, Zhiyu\n  Tan, Hao Li, Yu-Gang Jiang","authorsParsed":[["Gao","Ziyi",""],["Chen","Kai",""],["Wei","Zhipeng",""],["Mou","Tingshu",""],["Chen","Jingjing",""],["Tan","Zhiyu",""],["Li","Hao",""],["Jiang","Yu-Gang",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 08:10:30 GMT"}],"updateDate":"2024-08-13","timestamp":1723277430000,"abstract":"  Recent diffusion-based unrestricted attacks generate imperceptible\nadversarial examples with high transferability compared to previous\nunrestricted attacks and restricted attacks. However, existing works on\ndiffusion-based unrestricted attacks are mostly focused on images yet are\nseldom explored in videos. In this paper, we propose the Recursive Token\nMerging for Video Diffusion-based Unrestricted Adversarial Attack (ReToMe-VA),\nwhich is the first framework to generate imperceptible adversarial video clips\nwith higher transferability. Specifically, to achieve spatial imperceptibility,\nReToMe-VA adopts a Timestep-wise Adversarial Latent Optimization (TALO)\nstrategy that optimizes perturbations in diffusion models' latent space at each\ndenoising step. TALO offers iterative and accurate updates to generate more\npowerful adversarial frames. TALO can further reduce memory consumption in\ngradient computation. Moreover, to achieve temporal imperceptibility, ReToMe-VA\nintroduces a Recursive Token Merging (ReToMe) mechanism by matching and merging\ntokens across video frames in the self-attention module, resulting in\ntemporally consistent adversarial videos. ReToMe concurrently facilitates\ninter-frame interactions into the attack process, inducing more diverse and\nrobust gradients, thus leading to better adversarial transferability. Extensive\nexperiments demonstrate the efficacy of ReToMe-VA, particularly in surpassing\nstate-of-the-art attacks in adversarial transferability by more than 14.16% on\naverage.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}