{"id":"2408.01910","title":"An Overview of Integration of the Virtualization of Network Functions in\n  the Context of Information Centric Networks","authors":"Antonio Cort\\'es Castillo","authorsParsed":[["Castillo","Antonio Cortés",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 20:52:45 GMT"}],"updateDate":"2024-08-06","timestamp":1720471965000,"abstract":"  Nowadays, the new network architectures with respect to the traditional\nnetwork topologies must manage more data, which entails having increasingly\nrobust and scalable network structures. As there is a process of growth,\nadaptability, and change in traditional data networks, faced with the\nmanagement of large volumes of information, it is necessary to incorporate the\nvirtualization of network functions in the context of information content\nnetworks, in such a way that there is a balance between the user and the\nprovider at cost level and profit, the functions on the network. In turn, NFVs\n(Network Functions Virtualization) are considered network structures designed\nbased on IT virtualization technologies, which allow virtualizing of the\nfunctions that can be found in the network nodes, which are connected through\nrouting tables, which allows offering communication services for various types\nof customers. Therefore, information-centric networks (IC, unlike traditional\ndata networks which proceed to exchange information between hosts using data\npackets and TCP/IP communication protocols, use the content of the data for\nthis purpose where the data travels through the network is stored in a routing\ntable located in the CR (Content Router) of the router temporality to be reused\nlater, which allows for reducing operation costs and capital costs . The\npurpose of this work is to analyze how the virtualization of network functions\nis integrated into the field of information-centric networks. Also, the\nadvantages and disadvantages of both architectures are considered and presented\nas a critical analysis when considering the current difficulties and future\ntrends of both network topologies.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Wxgg5q3kOgA2SiHvBAqDOKox4CAgtHWHb3Prs0dfhvk","pdfSize":"804530","txDigest":"2ksAxDuhxoYHYP3Ff1aAQfYbEw5JLhNGUnLYLRtfii29","endEpoch":"1","status":"CERTIFIED"}
