{"id":"2408.09676","title":"Image-based Freeform Handwriting Authentication with Energy-oriented\n  Self-Supervised Learning","authors":"Jingyao Wang, Luntian Mou, Changwen Zheng, Wen Gao","authorsParsed":[["Wang","Jingyao",""],["Mou","Luntian",""],["Zheng","Changwen",""],["Gao","Wen",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 03:33:39 GMT"}],"updateDate":"2024-08-20","timestamp":1724038419000,"abstract":"  Freeform handwriting authentication verifies a person's identity from their\nwriting style and habits in messy handwriting data. This technique has gained\nwidespread attention in recent years as a valuable tool for various fields,\ne.g., fraud prevention and cultural heritage protection. However, it still\nremains a challenging task in reality due to three reasons: (i) severe damage,\n(ii) complex high-dimensional features, and (iii) lack of supervision. To\naddress these issues, we propose SherlockNet, an energy-oriented two-branch\ncontrastive self-supervised learning framework for robust and fast freeform\nhandwriting authentication. It consists of four stages: (i) pre-processing:\nconverting manuscripts into energy distributions using a novel plug-and-play\nenergy-oriented operator to eliminate the influence of noise; (ii) generalized\npre-training: learning general representation through two-branch momentum-based\nadaptive contrastive learning with the energy distributions, which handles the\nhigh-dimensional features and spatial dependencies of handwriting; (iii)\npersonalized fine-tuning: calibrating the learned knowledge using a small\namount of labeled data from downstream tasks; and (iv) practical application:\nidentifying individual handwriting from scrambled, missing, or forged data\nefficiently and conveniently. Considering the practicality, we construct EN-HA,\na novel dataset that simulates data forgery and severe damage in real\napplications. Finally, we conduct extensive experiments on six benchmark\ndatasets including our EN-HA, and the results prove the robustness and\nefficiency of SherlockNet.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}