{"id":"2408.13379","title":"N-DriverMotion: Driver motion learning and prediction using an\n  event-based camera and directly trained spiking neural networks","authors":"Hyo Jong Chung, Byungkon Kang, Yoonseok Yang","authorsParsed":[["Chung","Hyo Jong",""],["Kang","Byungkon",""],["Yang","Yoonseok",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 21:25:16 GMT"}],"updateDate":"2024-08-27","timestamp":1724448316000,"abstract":"  Driver motion recognition is a principal factor in ensuring the safety of\ndriving systems. This paper presents a novel system for learning and predicting\ndriver motions and an event-based high-resolution (1280x720) dataset,\nN-DriverMotion, newly collected to train on a neuromorphic vision system. The\nsystem comprises an event-based camera that generates the first high-resolution\ndriver motion dataset representing spike inputs and efficient spiking neural\nnetworks (SNNs) that are effective in training and predicting the driver's\ngestures. The event dataset consists of 13 driver motion categories classified\nby direction (front, side), illumination (bright, moderate, dark), and\nparticipant. A novel simplified four-layer convolutional spiking neural network\n(CSNN) that we proposed was directly trained using the high-resolution dataset\nwithout any time-consuming preprocessing. This enables efficient adaptation to\non-device SNNs for real-time inference on high-resolution event-based streams.\nCompared with recent gesture recognition systems adopting neural networks for\nvision processing, the proposed neuromorphic vision system achieves comparable\naccuracy, 94.04\\%, in recognizing driver motions with the CSNN architecture.\nOur proposed CSNN and the dataset can be used to develop safer and more\nefficient driver monitoring systems for autonomous vehicles or edge devices\nrequiring an efficient neural network architecture.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gxzLXoQS9Rq7TFKvQXISYYvMrEqz3QxZ8Yqwi1r94ik","pdfSize":"3558224"}
