{"id":"2408.01650","title":"Numerical Simulations of Magnetic Effects on Zonal Flows in Giant\n  Planets","authors":"Shanshan Xue, Yufeng Lin","authorsParsed":[["Xue","Shanshan",""],["Lin","Yufeng",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 03:30:56 GMT"}],"updateDate":"2024-08-06","timestamp":1722655856000,"abstract":"  Jupiter and Saturn exhibit alternating east-west jet streams as seen from\nsurface. The origin of these zonal flows has been debated for decades. The\nhigh-precision gravity measurements by Juno mission and the grand finale of\nCassini mission have revealed that the zonal flows observed at the surface may\nextend several thousand kilometres deep and stop around the transition region\nfrom molecular to metallic hydrogen, suggesting the magnetic braking effect on\nzonal flows. In this study, we perform a set of magnetohydrodynamic simulations\nin a spherical shell with radially variable electrical conductivity to\ninvestigate the interaction between magnetic fields and zonal flows. A key\nfeature of our numerical models is that we impose a background dipole magnetic\nfield on the anelastic rotating convection. By varying the strength of the\nimposed magnetic field and the vigor of convection, we investigate how the\nmagnetic field interacts with the convective motions and the convection-driven\nzonal flows. Our simulations reveal that the magnetic field tends to destroy\nzonal flows in the metallic hydrogen and suppress zonal flows in the molecular\nenvelope, while the magnetic field may enhance the radial convective motions.\nWe extract a quantitative relation between the magnetic field strength and the\namplitude of zonal flows at the surface through our simulations, which roughly\nmatches the observed magnetic field and zonal wind speed of Jupiter and Saturn.\nThis discovery provides support from a new perspective for the scenario of deep\nconvection-driven zonal winds which are confined to the molecular hydrogen\nlayers in giant planets.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yBrXQYcp4W8Xx850S3EsKmyldTbakkoWNbLakQYgTPo","pdfSize":"20683278"}
