{"id":"2408.07109","title":"Efficient Deep Model-Based Optoacoustic Image Reconstruction","authors":"Christoph Dehner, Guillaume Zahnd","authorsParsed":[["Dehner","Christoph",""],["Zahnd","Guillaume",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 13:05:30 GMT"}],"updateDate":"2024-08-15","timestamp":1723554330000,"abstract":"  Clinical adoption of multispectral optoacoustic tomography necessitates\nimprovements of the image quality available in real-time, as well as a\nreduction in the scanner financial cost. Deep learning approaches have recently\nunlocked the reconstruction of high-quality optoacoustic images in real-time.\nHowever, currently used deep neural network architectures require powerful\ngraphics processing units to infer images at sufficiently high frame-rates,\nconsequently greatly increasing the price tag. Herein we propose\nEfficientDeepMB, a relatively lightweight (17M parameters) network architecture\nachieving high frame-rates on medium-sized graphics cards with no noticeable\ndowngrade in image quality. EfficientDeepMB is built upon DeepMB, a previously\nestablished deep learning framework to reconstruct high-quality images in\nreal-time, and upon EfficientNet, a network architectures designed to operate\nof mobile devices. We demonstrate the performance of EfficientDeepMB in terms\nof reconstruction speed and accuracy using a large and diverse dataset of in\nvivo optoacoustic scans. EfficientDeepMB is about three to five times faster\nthan DeepMB: deployed on a medium-sized NVIDIA RTX A2000 Ada, EfficientDeepMB\nreconstructs images at speeds enabling live image feedback (59Hz) while DeepMB\nfails to meets the real-time inference threshold (14Hz). The quantitative\ndifference between the reconstruction accuracy of EfficientDeepMB and DeepMB is\nmarginal (data residual norms of 0.1560 vs. 0.1487, mean absolute error of\n0.642 vs. 0.745). There are no perceptible qualitative differences between\nimages inferred with the two reconstruction methods.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}