{"id":"2408.03627","title":"Weakly Contrastive Learning via Batch Instance Discrimination and\n  Feature Clustering for Small Sample SAR ATR","authors":"Yikui Zhai, Wenlve Zhou, Bing Sun, Jingwen Li, Qirui Ke, Zilu Ying,\n  Junying Gan, Chaoyun Mai, Ruggero Donida Labati, Vincenzo Piuri, Fabio Scotti","authorsParsed":[["Zhai","Yikui",""],["Zhou","Wenlve",""],["Sun","Bing",""],["Li","Jingwen",""],["Ke","Qirui",""],["Ying","Zilu",""],["Gan","Junying",""],["Mai","Chaoyun",""],["Labati","Ruggero Donida",""],["Piuri","Vincenzo",""],["Scotti","Fabio",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 08:39:33 GMT"}],"updateDate":"2024-08-08","timestamp":1723019973000,"abstract":"  In recent years, impressive performance of deep learning technology has been\nrecognized in Synthetic Aperture Radar (SAR) Automatic Target Recognition\n(ATR). Since a large amount of annotated data is required in this technique, it\nposes a trenchant challenge to the issue of obtaining a high recognition rate\nthrough less labeled data. To overcome this problem, inspired by the\ncontrastive learning, we proposed a novel framework named Batch Instance\nDiscrimination and Feature Clustering (BIDFC). In this framework, different\nfrom that of the objective of general contrastive learning methods, embedding\ndistance between samples should be moderate because of the high similarity\nbetween samples in the SAR images. Consequently, our flexible framework is\nequipped with adjustable distance between embedding, which we term as weakly\ncontrastive learning. Technically, instance labels are assigned to the\nunlabeled data in per batch and random augmentation and training are performed\nfew times on these augmented data. Meanwhile, a novel Dynamic-Weighted Variance\nloss (DWV loss) function is also posed to cluster the embedding of enhanced\nversions for each sample. Experimental results on the moving and stationary\ntarget acquisition and recognition (MSTAR) database indicate a 91.25%\nclassification accuracy of our method fine-tuned on only 3.13% training data.\nEven though a linear evaluation is performed on the same training data, the\naccuracy can still reach 90.13%. We also verified the effectiveness of BIDFC in\nOpenSarShip database, indicating that our method can be generalized to other\ndatasets. Our code is avaliable at:\nhttps://github.com/Wenlve-Zhou/BIDFC-master.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}