{"id":"2408.01422","title":"Linear response in planar Hall and thermal Hall setups for\n  Rarita-Schwinger-Weyl semimetals","authors":"Rahul Ghosh, Firdous Haidar, Ipsita Mandal","authorsParsed":[["Ghosh","Rahul",""],["Haidar","Firdous",""],["Mandal","Ipsita",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 17:59:09 GMT"}],"updateDate":"2024-08-05","timestamp":1722621549000,"abstract":"  We investigate the nature of the linear-response tensors in planar Hall and\nplanar thermal Hall setups, where we subject a Rarita-Schwinger-Weyl (RSW)\nsemimetal to the combined influence of an electric field $\\mathbf E $ (and/or\ntemperature gradient $\\nabla_{\\mathbf r } T$) and a weak (i.e., non-quantizing)\nmagnetic field $\\mathbf B $. For computing the in-plane transport components,\nwe have added an elastic deformation which gives rise to a chirality-dependent\neffective magnetic field $ \\mathbf B^{\\text{tot}} = \\mathbf B + \\chi \\, \\mathbf\nB_5 $, where $\\chi $ is the chirality of an RSW node. We have included the\neffects of orbital magnetic moment (OMM), in conjunction with the Berry\ncurvature (BC), both of which appear as a consequence of nontrivial topology of\nthe bandstructure. Due to the presence of four bands, RSW semimetals provide a\nricher structure for obtaining the linear-response coefficients, compared to\nthe Weyl semimetals. In particular, we have found that the OMM-contributed\nterms may oppose or add up to the BC-only parts, depending on which band we are\nconsidering. We have also considered the response arising from internode\nscatterings. Last, but not the least, we have determined the out-of-plane\nresponse comprising the intrinsic anomalous Hall and the\nLorentz-force-contributed currents, whose nature corroborates the findings of\nsome recent experimental results.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}