{"id":"2408.04627","title":"A Timeline of the M81 Group: Properties of the Extended Structures of\n  M82 and NGC 3077","authors":"Benjamin N. Velguth, Eric F. Bell, Adam Smercina, Paul Price, Katya\n  Gozman, Antonela Monachesi, Richard D'Souza, Jeremy Bailin, Roelof S. De\n  Jong, In Sung Jang, Colin T. Slater","authorsParsed":[["Velguth","Benjamin N.",""],["Bell","Eric F.",""],["Smercina","Adam",""],["Price","Paul",""],["Gozman","Katya",""],["Monachesi","Antonela",""],["D'Souza","Richard",""],["Bailin","Jeremy",""],["De Jong","Roelof S.",""],["Jang","In Sung",""],["Slater","Colin T.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 17:58:04 GMT"}],"updateDate":"2024-08-09","timestamp":1723139884000,"abstract":"  Mergers of and interactions between galaxies imprint a wide diversity of\nmorphological, dynamical, and chemical characteristics in stellar halos and\ntidal streams. Measuring these characteristics elucidates aspects of the\nprogenitors of the galaxies we observe today. The M81 group is the perfect\ngalaxy group to understand the past, present, and future of a group of galaxies\nin the process of merging. Here we measure the end of star formation (t$_{90}$)\nand metallicity ([M/H]) of the stellar halo of M82 and the eastern tidal stream\nof NGC 3077 to: 1) test the idea that M82 possesses a genuine stellar halo,\nformed before any interaction with M81, 2) determine if NGC 3077's tidal\ndisruption is related to the star formation history in its tails, and 3) create\na timeline of the assembly history of the central trio in the M81 group. We\nargue that M82 possesses a genuine, metal poor ([M/H] ~ -1.62 dex) stellar\nhalo, formed from the merger of a small satellite galaxy roughly 6.6 Gyr ago.\nWe also find that the stars present in NGC 3077's tails formed before tidal\ndisruption with M81, and possesses a roughly uniform metallicity as shown in\nOkamoto et. al. 2023 implying that NGC 3077's progenitor had significant\npopulation gradients. Finally, we present a timeline of the central trio's\nmerger/interaction history.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}