{"id":"2408.09511","title":"NAVERO: Unlocking Fine-Grained Semantics for Video-Language\n  Compositionality","authors":"Chaofan Tao, Gukyeong Kwon, Varad Gunjal, Hao Yang, Zhaowei Cai,\n  Yonatan Dukler, Ashwin Swaminathan, R. Manmatha, Colin Jon Taylor, Stefano\n  Soatto","authorsParsed":[["Tao","Chaofan",""],["Kwon","Gukyeong",""],["Gunjal","Varad",""],["Yang","Hao",""],["Cai","Zhaowei",""],["Dukler","Yonatan",""],["Swaminathan","Ashwin",""],["Manmatha","R.",""],["Taylor","Colin Jon",""],["Soatto","Stefano",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 15:27:06 GMT"}],"updateDate":"2024-08-20","timestamp":1723994826000,"abstract":"  We study the capability of Video-Language (VidL) models in understanding\ncompositions between objects, attributes, actions and their relations.\nComposition understanding becomes particularly challenging for video data since\nthe compositional relations rapidly change over time in videos. We first build\na benchmark named AARO to evaluate composition understanding related to actions\non top of spatial concepts. The benchmark is constructed by generating negative\ntexts with incorrect action descriptions for a given video and the model is\nexpected to pair a positive text with its corresponding video. Furthermore, we\npropose a training method called NAVERO which utilizes video-text data\naugmented with negative texts to enhance composition understanding. We also\ndevelop a negative-augmented visual-language matching loss which is used\nexplicitly to benefit from the generated negative text. We compare NAVERO with\nother state-of-the-art methods in terms of compositional understanding as well\nas video-text retrieval performance. NAVERO achieves significant improvement\nover other methods for both video-language and image-language composition\nunderstanding, while maintaining strong performance on traditional text-video\nretrieval tasks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"XhGSvKT-cl3TpOUqKIkbFtZ5GbHOYQiGF7x_mGURNT0","pdfSize":"2426871"}
