{"id":"2408.14578","title":"Multi-faceted Sensory Substitution for Curb Alerting: A Pilot\n  Investigation in Persons with Blindness and Low Vision","authors":"Ligao Ruan, Giles Hamilton-Fletcher, Mahya Beheshti, Todd E Hudson,\n  Maurizio Porfiri, JR Rizzo","authorsParsed":[["Ruan","Ligao",""],["Hamilton-Fletcher","Giles",""],["Beheshti","Mahya",""],["Hudson","Todd E",""],["Porfiri","Maurizio",""],["Rizzo","JR",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 18:52:45 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 14:22:22 GMT"}],"updateDate":"2024-08-29","timestamp":1724698365000,"abstract":"  Curbs -- the edge of a raised sidewalk at the point where it meets a street\n-- crucial in urban environments where they help delineate safe pedestrian\nzones, from dangerous vehicular lanes. However, curbs themselves are\nsignificant navigation hazards, particularly for people who are blind or have\nlow vision (pBLV). The challenges faced by pBLV in detecting and properly\norientating themselves for these abrupt elevation changes can lead to falls and\nserious injuries. Despite recent advancements in assistive technologies, the\ndetection and early warning of curbs remains a largely unsolved challenge. This\npaper aims to tackle this gap by introducing a novel, multi-faceted sensory\nsubstitution approach hosted on a smart wearable; the platform leverages an RGB\ncamera and an embedded system to capture and segment curbs in real time and\nprovide early warning and orientation information. The system utilizes YOLO\n(You Only Look Once) v8 segmentation model, trained on our custom curb dataset\nfor the camera input. The output of the system consists of adaptive auditory\nbeeps, abstract sonification, and speech, conveying information about the\nrelative distance and orientation of curbs. Through human-subjects\nexperimentation, we demonstrate the effectiveness of the system as compared to\nthe white cane. Results show that our system can provide advanced warning\nthrough a larger safety window than the cane, while offering nearly identical\ncurb orientation information.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"AEEG4HkV1H5T2iAF7s0xxRWbV8oPHqk9ZNCPo3z0M_E","pdfSize":"1608176"}
