{"id":"2408.07774","title":"Sum-of-Squares inspired Quantum Metaheuristic for Polynomial\n  Optimization with the Hadamard Test and Approximate Amplitude Constraints","authors":"Iria W. Wang, Robin Brown, Taylor L. Patti, Anima Anandkumar, Marco\n  Pavone, Susanne F. Yelin","authorsParsed":[["Wang","Iria W.",""],["Brown","Robin",""],["Patti","Taylor L.",""],["Anandkumar","Anima",""],["Pavone","Marco",""],["Yelin","Susanne F.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 19:04:13 GMT"}],"updateDate":"2024-08-16","timestamp":1723662253000,"abstract":"  Quantum computation shows promise for addressing numerous classically\nintractable problems, such as optimization tasks. Many optimization problems\nare NP-hard, meaning that they scale exponentially with problem size and thus\ncannot be addressed at scale by traditional computing paradigms. The recently\nproposed quantum algorithm arXiv:2206.14999 addresses this challenge for some\nNP-hard problems, and is based on classical semidefinite programming (SDP). In\nthis manuscript, we generalize the SDP-inspired quantum algorithm to\nsum-of-squares programming, which targets a broader problem set. Our proposed\nalgorithm addresses degree-$k$ polynomial optimization problems with $N \\leq\n2^n$ variables (which are representative of many NP-hard problems) using\n$O(nk)$ qubits, $O(k)$ quantum measurements, and $O(\\textrm{poly}(n))$\nclassical calculations. We apply the proposed algorithm to the prototypical\nMax-$k$SAT problem and compare its performance against classical\nsum-of-squares, state-of-the-art heuristic solvers, and random guessing.\nSimulations show that the performance of our algorithm surpasses that of\nclassical sum-of-squares after rounding. Our results further demonstrate that\nour algorithm is suitable for large problems and approximates the best known\nclassical heuristics, while also providing a more generalizable approach\ncompared to problem-specific heuristics.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8E-Xmf1QZSn12hRv0UHjqrrMz4kA1XBBNcvOSzhwXoI","pdfSize":"1285656"}
