{"id":"2408.12479","title":"Matrix-Free Higher-Order Finite Element Methods for Hyperelasticity","authors":"Richard Schussnig and Niklas Fehn and Peter Munch and Martin\n  Kronbichler","authorsParsed":[["Schussnig","Richard",""],["Fehn","Niklas",""],["Munch","Peter",""],["Kronbichler","Martin",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 15:14:43 GMT"}],"updateDate":"2024-08-23","timestamp":1724339683000,"abstract":"  This work presents a matrix-free finite element solver for finite-strain\nelasticity adopting an hp-multigrid preconditioner. Compared to classical\nalgorithms relying on a global sparse matrix, matrix-free solution strategies\nsignificantly reduce memory traffic by on-the-fly evaluation of the finite\nelement integrals. Following this approach in the context of finite-strain\nelasticity, the precise statement of the final weak form is crucial for\nperformance, and it is not clear a priori whether to choose problem\nformulations in the material or spatial domain. With a focus on hyperelastic\nsolids in biomechanics, the arithmetic costs to evaluate the material law at\neach quadrature point might favor an evaluation strategy where some quantities\nare precomputed in each Newton iteration and reused in the Krylov solver for\nthe linearized problem. Hence, we discuss storage strategies to balance the\ncompute load against memory access in compressible and incompressible\nneo-Hookean models and an anisotropic tissue model. Additionally, numerical\nstability becomes increasingly important using lower/mixed-precision\ningredients and approximate preconditioners to better utilize modern hardware\narchitectures. Application of the presented method to a patient-specific\ngeometry of an iliac bifurcation shows significant speed-ups, especially for\nhigher polynomial degrees, when compared to alternative approaches with\nmatrix-based geometric or black-box algebraic multigrid preconditioners.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ulXqHuiNbvStnrGOrCWqKZivI1loyQ0bRykUTASZOzg","pdfSize":"8956866"}
