{"id":"2408.02506","title":"Bidirectional classical communication cost of a bipartite quantum\n  channel assisted by non-signalling correlations","authors":"Chengkai Zhu, Xuanqiang Zhao, and Xin Wang","authorsParsed":[["Zhu","Chengkai",""],["Zhao","Xuanqiang",""],["Wang","Xin",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 14:30:50 GMT"}],"updateDate":"2024-08-06","timestamp":1722868250000,"abstract":"  Understanding the classical communication cost of simulating a quantum\nchannel is a fundamental problem in quantum information theory, which becomes\neven more intriguing when considering the role of non-locality in quantum\ninformation processing. This paper investigates the bidirectional classical\ncommunication cost of simulating a bipartite quantum channel assisted by\nnon-signalling correlations. Such non-signalling correlations are permitted not\nonly across spatial dimension between the two parties but also along the\ntemporal dimension of the channel simulation protocol. By introducing\nnon-signalling superchannels, we derive semidefinite programming (SDP)\nformulations for the one-shot exact bidirectional classical communication cost\nvia non-signalling bipartite superchannels. We further introduce a channel's\nbipartite conditional min-entropy as an efficiently computable lower bound on\nthe asymptotic cost of bidirectional classical communication. Our results in\nboth one-shot and asymptotic settings provide lower bounds on the\nentanglement-assisted simulation cost in scenarios where entanglement is\navailable to the two parties and can be utilized across the timeline of the\nprotocol. Numerical experiments demonstrate the effectiveness of our bounds in\nestimating communication costs for various quantum channels, showing that our\nbounds can be tight in different scenarios. Our results elucidate the role of\nnon-locality in quantum communication and pave the way for exploring quantum\nreverse Shannon theory in bipartite scenarios.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JM5NDQQNS6m3cOsZqIbjxT6QSuz0T-YuFem4AQ2yBsM","pdfSize":"829923","txDigest":"BRj7VyH5pR9q1RQBFDMEeEf6bqzffqHFahuGjcu7i61S","endEpoch":"1","status":"CERTIFIED"}
