{"id":"2408.15993","title":"ClimDetect: A Benchmark Dataset for Climate Change Detection and\n  Attribution","authors":"Sungduk Yu, Brian L. White, Anahita Bhiwandiwalla, Musashi Hinck,\n  Matthew Lyle Olson, Tung Nguyen, Vasudev Lal","authorsParsed":[["Yu","Sungduk",""],["White","Brian L.",""],["Bhiwandiwalla","Anahita",""],["Hinck","Musashi",""],["Olson","Matthew Lyle",""],["Nguyen","Tung",""],["Lal","Vasudev",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 17:58:53 GMT"}],"updateDate":"2024-08-29","timestamp":1724867933000,"abstract":"  Detecting and attributing temperature increases due to climate change is\ncrucial for understanding global warming and guiding adaptation strategies. The\ncomplexity of distinguishing human-induced climate signals from natural\nvariability has challenged traditional detection and attribution (D&A)\napproaches, which seek to identify specific \"fingerprints\" in climate response\nvariables. Deep learning offers potential for discerning these complex patterns\nin expansive spatial datasets. However, lack of standard protocols has hindered\nconsistent comparisons across studies. We introduce ClimDetect, a standardized\ndataset of over 816k daily climate snapshots, designed to enhance model\naccuracy in identifying climate change signals. ClimDetect integrates various\ninput and target variables used in past research, ensuring comparability and\nconsistency. We also explore the application of vision transformers (ViT) to\nclimate data, a novel and modernizing approach in this context. Our open-access\ndata and code serve as a benchmark for advancing climate science through\nimproved model evaluations. ClimDetect is publicly accessible via Huggingface\ndataet respository at: https://huggingface.co/datasets/ClimDetect/ClimDetect.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Physics/Atmospheric and Oceanic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}