{"id":"2408.01482","title":"AT2023vto: An Exceptionally Luminous Helium Tidal Disruption Event from\n  a Massive Star","authors":"Harsh Kumar, Edo Berger, Daichi Hiramatsu, Sebastian Gomez, Peter K.\n  Blanchard, Yvette Cendes, K. Azalee Bostroem, Joseph Farah, Estefania Padilla\n  Gonzalez, Andrew Howell, Curtis McCully, Megan Newsome, and Giacomo Terreran","authorsParsed":[["Kumar","Harsh",""],["Berger","Edo",""],["Hiramatsu","Daichi",""],["Gomez","Sebastian",""],["Blanchard","Peter K.",""],["Cendes","Yvette",""],["Bostroem","K. Azalee",""],["Farah","Joseph",""],["Gonzalez","Estefania Padilla",""],["Howell","Andrew",""],["McCully","Curtis",""],["Newsome","Megan",""],["Terreran","Giacomo",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-06","timestamp":1722621600000,"abstract":"  We present optical/UV observations and the spectroscopic classification of\nthe transient AT2023vto as a tidal disruption event (TDE) at z = 0.4846. The\nspectrum is dominated by a broad He II $\\lambda$4686 emission line, with a\nwidth of ~ $3.76 \\times 10^4$ km/s and a blueshift of ~ $1.05 \\times 10^4$\nkm/s, classifying it as a member of the TDE-He class. The light curve exhibits\na long rise and decline timescale, with a large peak absolute magnitude of\nM$_g$ ~ -23.6, making it the most luminous of the classical optical TDEs (H,\nH+He, He) discovered to date by about 2 mag (and ~ 4 mag compared to the mean\nof the population). The light curve exhibits a persistent blue color of g - r ~\n-0.4 mag throughout its evolution, similar to other TDEs, but distinct from\nsupernovae. We identify the host galaxy of AT2023vto in archival Pan-STARRS\nimages and find that the transient is located at the galaxy center, and that\nits inferred central black hole mass is ~ $10^7~M_{\\odot}$. Modeling the light\ncurves of AT2023vto, we find that it resulted from the disruption of a ~ 9\n$M_{\\odot}$ star by a ~$10^7~M_{\\odot}$ supermassive black hole. The star mass\nis about 5 times larger than the highest star masses previously inferred in\nTDEs, and the black hole mass is at the high end of the distribution. AT2023vto\nis comparable in luminosity and timescale to some putative TDEs (with a blue\nfeatureless continuum), as well as to the mean of the recently identified\npopulation of ambiguous nuclear transients (ANTs), although the latter are\nspectroscopically distinct and tend to have longer timescales. ANTs have been\nspeculated to arise from tidal disruptions of massive stars, perhaps in active\ngalactic nuclei, and AT2023vto may represent a similar case but in a dormant\nblack hole, thereby bridging the TDE and ANT populations. We anticipate that\nRubin Observatory / LSST will uncover similar luminous TDEs to z ~ 3.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}