{"id":"2408.12181","title":"Machine learning-based determination of magnetic parameters from\n  magnetic images with different imaging scales","authors":"Akito Watanabe, Yoshinobu Nakatani, Hiroyuki Awano, and Kenji Tanabe","authorsParsed":[["Watanabe","Akito",""],["Nakatani","Yoshinobu",""],["Awano","Hiroyuki",""],["Tanabe","Kenji",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 07:57:06 GMT"}],"updateDate":"2024-08-23","timestamp":1724313426000,"abstract":"  The determination of material parameters is significantly important in\nmaterial science, which is often a challenging task. Recently, advancements\nhave shown that magnetic parameters, such as the Dzyaloshinskii-Moriya\ninteraction (DMI), can be estimated from a magnetic domain image using machine\nlearning (ML). This development suggests a potential shift in how magnetic\nparameters are determined, moving away from traditional measurement techniques\nto more innovative methods involving image-based inputs processed by ML. In\nprevious studies, the test images used for estimation always matched the\ntraining images in size. However, since image size is contingent on the\nmicroscopy technique used, the ability to accurately estimate parameters from\nimages of varying sizes is essential. Here, we investigated the feasibility of\nestimating the DMI constant and saturation magnetization from magnetic domain\nimages of different sizes using ML. We successfully demonstrated that it is\npossible to estimate these parameters even when the imaging sizes differ\nbetween training and test datasets. Additionally, our comparison of the\nestimation accuracy for the DMI constant and saturation magnetization revealed\nthat the tolerance for differences in image size varies depending on the\nspecific parameter being estimated. These findings could have a significant\nimpact on the future methods of determining magnetic parameters.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}