{"id":"2408.16119","title":"Data Formulator 2: Iteratively Creating Rich Visualizations with AI","authors":"Chenglong Wang, Bongshin Lee, Steven Drucker, Dan Marshall, Jianfeng\n  Gao","authorsParsed":[["Wang","Chenglong",""],["Lee","Bongshin",""],["Drucker","Steven",""],["Marshall","Dan",""],["Gao","Jianfeng",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 20:12:17 GMT"}],"updateDate":"2024-08-30","timestamp":1724875937000,"abstract":"  To create rich visualizations, data analysts often need to iterate back and\nforth among data processing and chart specification to achieve their goals. To\nachieve this, analysts need not only proficiency in data transformation and\nvisualization tools but also efforts to manage the branching history consisting\nof many different versions of data and charts. Recent LLM-powered AI systems\nhave greatly improved visualization authoring experiences, for example by\nmitigating manual data transformation barriers via LLMs' code generation\nability. However, these systems do not work well for iterative visualization\nauthoring, because they often require analysts to provide, in a single turn, a\ntext-only prompt that fully describes the complex visualization task to be\nperformed, which is unrealistic to both users and models in many cases. In this\npaper, we present Data Formulator 2, an LLM-powered visualization system to\naddress these challenges. With Data Formulator 2, users describe their\nvisualization intent with blended UI and natural language inputs, and data\ntransformation are delegated to AI. To support iteration, Data Formulator 2\nlets users navigate their iteration history and reuse previous designs towards\nnew ones so that they don't need to start from scratch every time. In a user\nstudy with eight participants, we observed that Data Formulator 2 allows\nparticipants to develop their own iteration strategies to complete challenging\ndata exploration sessions.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}