{"id":"2408.06787","title":"Unlock the Power of Frozen LLMs in Knowledge Graph Completion","authors":"Bo Xue, Yi Xu, Yunchong Song, Yiming Pang, Yuyang Ren, Jiaxin Ding,\n  Luoyi Fu, Xinbing Wang","authorsParsed":[["Xue","Bo",""],["Xu","Yi",""],["Song","Yunchong",""],["Pang","Yiming",""],["Ren","Yuyang",""],["Ding","Jiaxin",""],["Fu","Luoyi",""],["Wang","Xinbing",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 10:15:55 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 07:12:28 GMT"}],"updateDate":"2024-09-19","timestamp":1723544155000,"abstract":"  Traditional knowledge graph completion (KGC) methods rely solely on\nstructural information, struggling with the inherent sparsity of knowledge\ngraphs (KGs). Large Language Models (LLMs) learn extensive knowledge from large\ncorpora with powerful context modeling, making them promising for mitigating\nthe limitations of previous methods. Directly fine-tuning LLMs offers great\ncapability but comes at the cost of huge time and memory consumption, while\nutilizing frozen LLMs yields suboptimal results.In this work, we aim to\nleverage LLMs for KGC effectively and efficiently. We capture the context-aware\nhidden states of knowledge triples by employing prompts to stimulate the\nintermediate layers of LLMs. We then train a data-efficient classifier on these\nhidden states to harness the inherent capabilities of frozen LLMs in KGC.\nAdditionally, to reduce ambiguity and enrich knowledge representation, we\ngenerate detailed entity descriptions through subgraph sampling on KGs.\nExtensive experiments on standard benchmarks demonstrate the efficiency and\neffectiveness of our approach. We outperform traditional KGC methods across\nmost datasets and, notably, achieve classification performance comparable to\nfine-tuned LLMs while enhancing GPU memory efficiency by $188\\times$ and\naccelerating training and inference by $13.48\\times$.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"94uIBzqH_ugXePIVuKDi3axab2-aLXvE0UAAaI8xHf8","pdfSize":"611619"}
