{"id":"2408.11118","title":"Loaded layer-cake model for cosmic ray interaction around exploding\n  super-giant stars making black holes","authors":"M. Allen, P.L. Biermann, A. Chieffi, D. Frekers, L. Gergely, B. Harms,\n  I. Jaroschewski, P.S. Joshi, P.P. Kronberg, E. Kun, A. Meli, E.-S. Seo and T.\n  Stanev","authorsParsed":[["Allen","M.",""],["Biermann","P. L.",""],["Chieffi","A.",""],["Frekers","D.",""],["Gergely","L.",""],["Harms","B.",""],["Jaroschewski","I.",""],["Joshi","P. S.",""],["Kronberg","P. P.",""],["Kun","E.",""],["Meli","A.",""],["Seo","E. -S.",""],["Stanev","T.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 18:21:44 GMT"}],"updateDate":"2024-08-22","timestamp":1724178104000,"abstract":"  The AMS experiment on the International Space Station has provided detailed\ncosmic ray spectra for various elements, revealing that interactions\nsignificantly reduce fluxes up to about 100 GV rigidity. This necessitates\nrevisiting current cosmic ray interaction models. A new model proposed here\ninvolves cosmic ray interactions first in the wind shock shell of supergiant\nstars and second in the OB-Superbubble around supernovae. These stars,\nincluding red and blue supergiants, produce black holes and drive electric\ncurrents in winds and jets. Variability in these winds creates temporary\nelectric fields that accelerate particles, resulting in steep spectra with\nsynchrotron losses, and analogous hadron spectra produce a flat magnetic\nirregularity spectrum. This model matches AMS data, explaining cosmic ray\nspectra below 100 GV. The model predicts a secondary/primary ratio slope of\n-1/3 and a primary flux reduction below 100 GV relative to a power-law spectrum\nwith slope +2. Key aspects are: a larger interaction column due to heavy\nelement enrichment and a minor secondary contribution even for elements like\nHe, C, and O, as indicated by the $^3$He/$^4$He ratio. This model also accounts\nfor cosmic ray anti-protons, gamma-ray spectra, and high-energy neutrinos,\nincluding contributions from ISM-SNe.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}