{"id":"2408.16813","title":"The MIRI Exoplanets Orbiting White Dwarfs (MEOW) Survey: Mid-Infrared\n  Excess Reveals a Giant Planet Candidate around a Nearby White Dwarf","authors":"Mary Anne Limbach, Andrew Vanderburg, Alexander Venner, Simon Blouin,\n  Kevin B. Stevenson, Ryan J. MacDonald, Sydney Jenkins, Rachel Bowens-Rubin,\n  Melinda Soares-Furtado, Caroline Morley, Markus Janson, John Debes, Siyi Xu,\n  Evangelia Kleisioti, Matthew Kenworthy, Paul Butler, Jeffrey D. Crane, Dave\n  Osip, Stephen Shectman and Johanna Teske","authorsParsed":[["Limbach","Mary Anne",""],["Vanderburg","Andrew",""],["Venner","Alexander",""],["Blouin","Simon",""],["Stevenson","Kevin B.",""],["MacDonald","Ryan J.",""],["Jenkins","Sydney",""],["Bowens-Rubin","Rachel",""],["Soares-Furtado","Melinda",""],["Morley","Caroline",""],["Janson","Markus",""],["Debes","John",""],["Xu","Siyi",""],["Kleisioti","Evangelia",""],["Kenworthy","Matthew",""],["Butler","Paul",""],["Crane","Jeffrey D.",""],["Osip","Dave",""],["Shectman","Stephen",""],["Teske","Johanna",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-09-02","timestamp":1724954400000,"abstract":"  The MIRI Exoplanets Orbiting White dwarfs (MEOW) Survey is a cycle 2 JWST\nprogram to search for exoplanets around dozens of nearby white dwarfs via\ninfrared excess and direct imaging. In this paper, we present the detection of\nmid-infrared excess at 18 and 21 microns towards the bright (V = 11.4)\nmetal-polluted white dwarf WD 0310-688. The source of the IR excess is almost\ncertainly within the system; the probability of background contamination is\n$<0.1\\%$. While the IR excess could be due to an unprecedentedly small and cold\ndebris disk, it is best explained by a $3.0^{+5.5}_{-1.9}$ M$_{\\rm Jup}$ cold\n(248$^{+84}_{-61}$ K) giant planet orbiting the white dwarf within the\nforbidden zone (the region where planets are expected to be destroyed during\nthe star's red giant phase). We constrain the source of the IR excess to an\norbital separation of 0.1-2 AU, marking the first discovery of a white dwarf\nplanet candidate within this range of separations. WD 0310-688 is a young\nremnant of an A or late B-type star, and at just 10.4 pc it is now the closest\nwhite dwarf with a known planet candidate. Future JWST observations could\ndistinguish the two scenarios by either detecting or ruling out spectral\nfeatures indicative of a planet atmosphere.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Kt-iVwptqXir89UWzeRUeBh-cUiIlED-k7T2BzN42Js","pdfSize":"4650508"}
