{"id":"2408.03566","title":"Look What You Made Me Glue: SEMGluTM Enabled Alternative Cryogenic\n  Sample Preparation Process for Cryogenic Atom Probe Tomography Studies","authors":"Neil Mulcahy, James O Douglas, Michele Conroy","authorsParsed":[["Mulcahy","Neil",""],["Douglas","James O",""],["Conroy","Michele",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 05:59:30 GMT"}],"updateDate":"2024-08-08","timestamp":1723010370000,"abstract":"  Extensive efforts over the past number of years have been applied to develop\nworkflows for sample preparation of specimens for atom probe tomography at\ncryogenic temperatures. This is primarily due to the difficulty involved in\npreparing site specific lift out samples at cryogenic temperatures without the\nassistance of the gas injection system (GIS) as using it under cryogenic\nconditions leads to nonuniform and difficult to control deposition. Building on\nthe efforts of previously developed GIS free workflows utilising redeposition\ntechniques, this work provides an alternative approach using SEMGluTM, which is\nan electron beam curing adhesive that remains usable at cryogenic temperatures,\nto both lift out cryogenically frozen samples, and mount these samples to Si\nmicroarray posts for subsequent redeposition welding. This approach is\napplicable for a full cryogenic workflow but is particularly useful for\nnon-fully cryogenic workflows such as beam sensitive samples, samples that mill\neasily, and samples with challenging geometries. We demonstrate atom probe\nanalysis of silicon samples in both laser pulsing and voltage mode prepared\nusing this workflow, with comparable analytical performance to a pre-sharpened\nmicrotip coupon. An application-based example which directly benefits from this\napproach, correlative Liquid Cell Transmission Electron Microscopy and\ncryogenic Atom Probe Tomography sample preparation, is also shown.\n","subjects":["Condensed Matter/Materials Science","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}