{"id":"2408.00711","title":"Investigating Brain Connectivity and Regional Statistics from EEG for\n  early stage Parkinson's Classification","authors":"Amarpal Sahota, Amber Roguski, Matthew W Jones, Zahraa S. Abdallah and\n  Raul Santos-Rodriguez","authorsParsed":[["Sahota","Amarpal",""],["Roguski","Amber",""],["Jones","Matthew W",""],["Abdallah","Zahraa S.",""],["Santos-Rodriguez","Raul",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 16:58:21 GMT"}],"updateDate":"2024-08-02","timestamp":1722531501000,"abstract":"  We evaluate the effectiveness of combining brain connectivity metrics with\nsignal statistics for early stage Parkinson's Disease (PD) classification using\nelectroencephalogram data (EEG). The data is from 5 arousal states - wakeful\nand four sleep stages (N1, N2, N3 and REM). Our pipeline uses an Ada Boost\nmodel for classification on a challenging early stage PD classification task\nwith with only 30 participants (11 PD , 19 Healthy Control). Evaluating 9 brain\nconnectivity metrics we find the best connectivity metric to be different for\neach arousal state with Phase Lag Index achieving the highest individual\nclassification accuracy of 86\\% on N1 data. Further to this our pipeline using\nregional signal statistics achieves an accuracy of 78\\%, using brain\nconnectivity only achieves an accuracy of 86\\% whereas combining the two\nachieves a best accuracy of 91\\%. This best performance is achieved on N1 data\nusing Phase Lag Index (PLI) combined with statistics derived from the frequency\ncharacteristics of the EEG signal. This model also achieves a recall of 80 \\%\nand precision of 96\\%. Furthermore we find that on data from each arousal\nstate, combining PLI with regional signal statistics improves classification\naccuracy versus using signal statistics or brain connectivity alone. Thus we\nconclude that combining brain connectivity statistics with regional EEG\nstatistics is optimal for classifier performance on early stage Parkinson's.\nAdditionally, we find outperformance of N1 EEG for classification of\nParkinson's and expect this could be due to disrupted N1 sleep in PD. This\nshould be explored in future work.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}