{"id":"2408.15143","title":"A Preliminary Exploration Towards General Image Restoration","authors":"Xiangtao Kong, Jinjin Gu, Yihao Liu, Wenlong Zhang, Xiangyu Chen, Yu\n  Qiao and Chao Dong","authorsParsed":[["Kong","Xiangtao",""],["Gu","Jinjin",""],["Liu","Yihao",""],["Zhang","Wenlong",""],["Chen","Xiangyu",""],["Qiao","Yu",""],["Dong","Chao",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 15:31:45 GMT"}],"updateDate":"2024-08-28","timestamp":1724772705000,"abstract":"  Despite the tremendous success of deep models in various individual image\nrestoration tasks, there are at least two major technical challenges preventing\nthese works from being applied to real-world usages: (1) the lack of\ngeneralization ability and (2) the complex and unknown degradations in\nreal-world scenarios. Existing deep models, tailored for specific individual\nimage restoration tasks, often fall short in effectively addressing these\nchallenges. In this paper, we present a new problem called general image\nrestoration (GIR) which aims to address these challenges within a unified\nmodel. GIR covers most individual image restoration tasks (\\eg, image\ndenoising, deblurring, deraining and super-resolution) and their combinations\nfor general purposes. This paper proceeds to delineate the essential aspects of\nGIR, including problem definition and the overarching significance of\ngeneralization performance. Moreover, the establishment of new datasets and a\nthorough evaluation framework for GIR models is discussed. We conduct a\ncomprehensive evaluation of existing approaches for tackling the GIR challenge,\nilluminating their strengths and pragmatic challenges. By analyzing these\napproaches, we not only underscore the effectiveness of GIR but also highlight\nthe difficulties in its practical implementation. At last, we also try to\nunderstand and interpret these models' behaviors to inspire the future\ndirection. Our work can open up new valuable research directions and contribute\nto the research of general vision.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}