{"id":"2408.03773","title":"Fundamental physical constants set the observability and operation of\n  phase and other transitions and increase entropy","authors":"K. Trachenko","authorsParsed":[["Trachenko","K.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 13:50:00 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 13:49:29 GMT"},{"version":"v3","created":"Tue, 27 Aug 2024 12:39:44 GMT"},{"version":"v4","created":"Mon, 16 Sep 2024 16:17:58 GMT"}],"updateDate":"2024-09-17","timestamp":1723038600000,"abstract":"  Approaching the problem of understanding fundamental physical constants\n(FPCs) started with discussing the role these constants play in high-energy\nnuclear physics and astrophysics. Condensed matter physics was relatively\nunexplored in this regard. More recently, it was realised that FPCs set lower\nor upper bounds on key condensed matter properties. In this Perspective, we\ndiscuss a wider role played by FPCs in condensed matter physics: at given\nenvironmental conditions, FPCs set the observability and operation of entire\nphysical effects and phenomena. We discuss second-order phase transitions\nincluding structural and superconducting transitions and first-order\ntransitions including melting and boiling. We also discuss metastable states,\ntransitions between them, chemical reactions and their products. An interesting\nbyproduct of this discussion is that the order of magnitude of the transition\ntemperature can be calculated from FPCs. We show that the new states emerging\nas a result of various transitions increase the phase space and entropy. Were\nFPCs to take different values, these transitions would become inoperative at\nour environmental conditions and the new states due to these transitions would\nnot emerge. This suggests that the current values of FPCs, by enabling various\ntransitions and reactions which give rise to new states, promote entropy\nincrease. We propose that this is a general effect that applies to different\nlevels of structure in the Universe.\n","subjects":["Condensed Matter/Statistical Mechanics","Physics/High Energy Physics - Theory","Physics/Nuclear Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}