{"id":"2408.07831","title":"CarbonClipper: Optimal Algorithms for Carbon-Aware Spatiotemporal\n  Workload Management","authors":"Adam Lechowicz, Nicolas Christianson, Bo Sun, Noman Bashir, Mohammad\n  Hajiesmaili, Adam Wierman, Prashant Shenoy","authorsParsed":[["Lechowicz","Adam",""],["Christianson","Nicolas",""],["Sun","Bo",""],["Bashir","Noman",""],["Hajiesmaili","Mohammad",""],["Wierman","Adam",""],["Shenoy","Prashant",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 22:08:06 GMT"}],"updateDate":"2024-08-16","timestamp":1723673286000,"abstract":"  We study carbon-aware spatiotemporal workload management, which seeks to\naddress the growing environmental impact of data centers. We formalize this as\nan online problem called spatiotemporal online allocation with deadline\nconstraints ($\\mathsf{SOAD}$), in which an online player completes a workload\n(e.g., a batch compute job) by moving and scheduling the workload across a\nnetwork subject to a deadline $T$. At each time step, a service cost function\nis revealed, representing, e.g., the carbon intensity of servicing a workload\nat each location, and the player must irrevocably decide the current\nallocation. Furthermore, whenever the player moves the allocation, it incurs a\nmovement cost defined by a metric space $(X,d)$ that captures, e.g., the\noverhead of migrating a compute job. $\\mathsf{SOAD}$ formalizes the open\nproblem of combining general metrics and deadline constraints in the online\nalgorithms literature, unifying problems such as metrical task systems and\nonline search. We propose a competitive algorithm for $\\mathsf{SOAD}$ along\nwith a matching lower bound that proves it is optimal. Our main algorithm,\n${\\rm C{\\scriptsize ARBON}C{\\scriptsize LIPPER}}$, is a learning-augmented\nalgorithm that takes advantage of predictions (e.g., carbon intensity\nforecasts) and achieves an optimal consistency-robustness trade-off. We\nevaluate our proposed algorithms for carbon-aware spatiotemporal workload\nmanagement on a simulated global data center network, showing that ${\\rm\nC{\\scriptsize ARBON}C{\\scriptsize LIPPER}}$ significantly improves performance\ncompared to baseline methods and delivers meaningful carbon reductions.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}