{"id":"2408.02153","title":"ARVO: Atlas of Reproducible Vulnerabilities for Open Source Software","authors":"Xiang Mei and Pulkit Singh Singaria and Jordi Del Castillo and Haoran\n  Xi and Abdelouahab (Habs) Benchikh and Tiffany Bao and Ruoyu Wang and Yan\n  Shoshitaishvili and Adam Doup\\'e and Hammond Pearce and Brendan Dolan-Gavitt","authorsParsed":[["Mei","Xiang","","Habs"],["Singaria","Pulkit Singh","","Habs"],["Del Castillo","Jordi","","Habs"],["Xi","Haoran","","Habs"],["Abdelouahab","","","Habs"],["Benchikh","",""],["Bao","Tiffany",""],["Wang","Ruoyu",""],["Shoshitaishvili","Yan",""],["Doupé","Adam",""],["Pearce","Hammond",""],["Dolan-Gavitt","Brendan",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 22:13:14 GMT"}],"updateDate":"2024-08-06","timestamp":1722809594000,"abstract":"  High-quality datasets of real-world vulnerabilities are enormously valuable\nfor downstream research in software security, but existing datasets are\ntypically small, require extensive manual effort to update, and are missing\ncrucial features that such research needs. In this paper, we introduce ARVO: an\nAtlas of Reproducible Vulnerabilities in Open-source software. By sourcing\nvulnerabilities from C/C++ projects that Google's OSS-Fuzz discovered and\nimplementing a reliable re-compilation system, we successfully reproduce more\nthan 5,000 memory vulnerabilities across over 250 projects, each with a\ntriggering input, the canonical developer-written patch for fixing the\nvulnerability, and the ability to automatically rebuild the project from source\nand run it at its vulnerable and patched revisions. Moreover, our dataset can\nbe automatically updated as OSS-Fuzz finds new vulnerabilities, allowing it to\ngrow over time. We provide a thorough characterization of the ARVO dataset,\nshow that it can locate fixes more accurately than Google's own OSV\nreproduction effort, and demonstrate its value for future research through two\ncase studies: firstly evaluating real-world LLM-based vulnerability repair, and\nsecondly identifying over 300 falsely patched (still-active) zero-day\nvulnerabilities from projects improperly labeled by OSS-Fuzz.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}