{"id":"2408.10236","title":"AID-DTI: Accelerating High-fidelity Diffusion Tensor Imaging with\n  Detail-preserving Model-based Deep Learning","authors":"Wenxin Fan, Jian Cheng, Cheng Li, Jing Yang, Ruoyou Wu, Juan Zou,\n  Shanshan Wang","authorsParsed":[["Fan","Wenxin",""],["Cheng","Jian",""],["Li","Cheng",""],["Yang","Jing",""],["Wu","Ruoyou",""],["Zou","Juan",""],["Wang","Shanshan",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 09:19:28 GMT"}],"updateDate":"2024-08-21","timestamp":1722763168000,"abstract":"  Deep learning has shown great potential in accelerating diffusion tensor\nimaging (DTI). Nevertheless, existing methods tend to suffer from Rician noise\nand eddy current, leading to detail loss in reconstructing the DTI-derived\nparametric maps especially when sparsely sampled q-space data are used. To\naddress this, this paper proposes a novel method, AID-DTI\n(\\textbf{A}ccelerating h\\textbf{I}gh fi\\textbf{D}elity \\textbf{D}iffusion\n\\textbf{T}ensor \\textbf{I}maging), to facilitate fast and accurate DTI with\nonly six measurements. AID-DTI is equipped with a newly designed Singular Value\nDecomposition-based regularizer, which can effectively capture fine details\nwhile suppressing noise during network training by exploiting the correlation\nacross DTI-derived parameters. Additionally, we introduce a Nesterov-based\nadaptive learning algorithm that optimizes the regularization parameter\ndynamically to enhance the performance. AID-DTI is an extendable framework\ncapable of incorporating flexible network architecture. Experimental results on\nHuman Connectome Project (HCP) data consistently demonstrate that the proposed\nmethod estimates DTI parameter maps with fine-grained details and outperforms\nother state-of-the-art methods both quantitatively and qualitatively.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}