{"id":"2408.16057","title":"Corner Charge Fluctuations and Many-Body Quantum Geometry","authors":"Xiao-Chuan Wu, Kang-Le Cai, Meng Cheng, Prashant Kumar","authorsParsed":[["Wu","Xiao-Chuan",""],["Cai","Kang-Le",""],["Cheng","Meng",""],["Kumar","Prashant",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:00:28 GMT"}],"updateDate":"2024-08-30","timestamp":1724868028000,"abstract":"  In many-body systems with U(1) global symmetry, the charge fluctuations in a\nsubregion reveal important insights into entanglement and other global\nproperties. For subregions with sharp corners, bipartite fluctuations have been\npredicted to exhibit a universal shape dependence on the corner angle in\ncertain quantum phases and transitions, characterized by a \"universal angle\nfunction\" and a \"universal coefficient.\" However, we demonstrate that this\nsimple formula is insufficient for charge insulators, including composite fermi\nliquids. In these systems, the corner contribution may depend on the corner\nangle, subregion orientation, and other microscopic details. We provide an\ninfinite series representation of the corner term, introducing\norientation-resolved universal angle functions with their non-universal\ncoefficients. In the small-angle limit or under orientation averaging, the\nremaining terms' coefficients are fully determined by the many-body quantum\nmetric, which, while not universal, adheres to both a universal topological\nlower bound and an energetic upper bound. We also clarify the conditions for\nbound saturation in (anisotropic) Landau levels, leveraging the generalized\nKohn theorem and holomorphic properties of many-body wavefunctions. We find\nthat a broad class of fractional quantum Hall wavefunctions, including\nunprojected parton states and composite-fermion Fermi sea wavefunctions,\nsaturates the bounds.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Statistical Mechanics","Physics/High Energy Physics - Theory","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}