{"id":"2408.08691","title":"Partitioned Surrogates and Thompson Sampling for Multidisciplinary\n  Bayesian Optimization","authors":"Susanna Baars, Jigar Parekh, Ihar Antonau, Philipp Bekemeyer, Ulrich\n  R\\\"omer","authorsParsed":[["Baars","Susanna",""],["Parekh","Jigar",""],["Antonau","Ihar",""],["Bekemeyer","Philipp",""],["Römer","Ulrich",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 12:06:20 GMT"}],"updateDate":"2024-08-19","timestamp":1723809980000,"abstract":"  The long runtime associated with simulating multidisciplinary systems\nchallenges the use of Bayesian optimization for multidisciplinary design\noptimization (MDO). This is particularly the case if the coupled system is\nmodeled in a partitioned manner and feedback loops, known as strong coupling,\nare present. This work introduces a method for Bayesian optimization in MDO\ncalled \"Multidisciplinary Design Optimization using Thompson Sampling\",\nabbreviated as MDO-TS. Instead of replacing the whole system with a surrogate,\nwe substitute each discipline with such a Gaussian process. Since an entire\nmultidisciplinary analysis is no longer required for enrichment, evaluations\ncan potentially be saved. However, the objective and associated uncertainty are\nno longer analytically estimated. Since most adaptive sampling strategies\nassume the availability of these estimates, they cannot be applied without\nmodification. Thompson sampling does not require this explicit availability.\nInstead, Thompson sampling balances exploration and exploitation by selecting\nactions based on optimizing random samples from the objective. We combine\nThompson sampling with an approximate sampling strategy that uses random\nFourier features. This approach produces continuous functions that can be\nevaluated iteratively. We study the application of this infill criterion to\nboth an analytical problem and the shape optimization of a simple\nfluid-structure interaction example.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GlIcUIVgOyFQ5pNZyjhaZhi4e4pNkojMIOfApk78xTU","pdfSize":"877873"}
