{"id":"2408.13622","title":"Advancing Enterprise Spatio-Temporal Forecasting Applications: Data\n  Mining Meets Instruction Tuning of Language Models For Multi-modal Time\n  Series Analysis in Low-Resource Settings","authors":"Sagar Srinivas Sakhinana, Geethan Sannidhi, Chidaksh Ravuru,\n  Venkataramana Runkana","authorsParsed":[["Sakhinana","Sagar Srinivas",""],["Sannidhi","Geethan",""],["Ravuru","Chidaksh",""],["Runkana","Venkataramana",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 16:32:58 GMT"}],"updateDate":"2024-08-27","timestamp":1724517178000,"abstract":"  Spatio-temporal forecasting is crucial in transportation, logistics, and\nsupply chain management. However, current methods struggle with large, complex\ndatasets. We propose a dynamic, multi-modal approach that integrates the\nstrengths of traditional forecasting methods and instruction tuning of small\nlanguage models for time series trend analysis. This approach utilizes a\nmixture of experts (MoE) architecture with parameter-efficient fine-tuning\n(PEFT) methods, tailored for consumer hardware to scale up AI solutions in low\nresource settings while balancing performance and latency tradeoffs.\nAdditionally, our approach leverages related past experiences for similar input\ntime series to efficiently handle both intra-series and inter-series\ndependencies of non-stationary data with a time-then-space modeling approach,\nusing grouped-query attention, while mitigating the limitations of traditional\nforecasting techniques in handling distributional shifts. Our approach models\npredictive uncertainty to improve decision-making. Our framework enables\non-premises customization with reduced computational and memory demands, while\nmaintaining inference speed and data privacy/security. Extensive experiments on\nvarious real-world datasets demonstrate that our framework provides robust and\naccurate forecasts, significantly outperforming existing methods.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Tf-S3YNtsD__emtr6rcaBuQLI6_un_dNREkVY2TIp8c","pdfSize":"1058968"}
