{"id":"2408.01797","title":"NuLite -- Lightweight and Fast Model for Nuclei Instance Segmentation\n  and Classification","authors":"Cristian Tommasino, Cristiano Russo, Antonio Maria Rinaldi","authorsParsed":[["Tommasino","Cristian",""],["Russo","Cristiano",""],["Rinaldi","Antonio Maria",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 14:48:34 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 10:57:09 GMT"}],"updateDate":"2024-08-12","timestamp":1722696514000,"abstract":"  In pathology, accurate and efficient analysis of Hematoxylin and Eosin (H\\&E)\nslides is crucial for timely and effective cancer diagnosis. Although many deep\nlearning solutions for nuclei instance segmentation and classification exist in\nthe literature, they often entail high computational costs and resource\nrequirements, thus limiting their practical usage in medical applications. To\naddress this issue, we introduce a novel convolutional neural network, NuLite,\na U-Net-like architecture designed explicitly on Fast-ViT, a state-of-the-art\n(SOTA) lightweight CNN. We obtained three versions of our model, NuLite-S,\nNuLite-M, and NuLite-H, trained on the PanNuke dataset. The experimental\nresults prove that our models equal CellViT (SOTA) in terms of panoptic quality\nand detection. However, our lightest model, NuLite-S, is 40 times smaller in\nterms of parameters and about 8 times smaller in terms of GFlops, while our\nheaviest model is 17 times smaller in terms of parameters and about 7 times\nsmaller in terms of GFlops. Moreover, our model is up to about 8 times faster\nthan CellViT. Lastly, to prove the effectiveness of our solution, we provide a\nrobust comparison of external datasets, namely CoNseP, MoNuSeg, and GlySAC. Our\nmodel is publicly available at https://github.com/CosmoIknosLab/NuLite\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}