{"id":"2408.00942","title":"Prelude to a Compositional Systems Biology","authors":"Eran Agmon","authorsParsed":[["Agmon","Eran",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 22:17:51 GMT"}],"updateDate":"2024-08-05","timestamp":1722550671000,"abstract":"  Composition is a powerful principle for systems biology, focused on the\ninterfaces, interconnections, and orchestration of distributed processes.\nWhereas most systems biology models focus on the structure or dynamics of\nspecific subsystems in controlled conditions, compositional systems biology\naims to connect such models into integrative multiscale simulations. This\nemphasizes the space between models--a compositional perspective asks what\nvariables should be exposed through a submodel's interface? How do coupled\nmodels connect and translate across scales? How can we connect domain-specific\nmodels across biological and physical research areas to drive the synthesis of\nnew knowledge? What is required of software that integrates diverse datasets\nand submodels into unified multiscale simulations? How can the resulting\nintegrative models be accessed, flexibly recombined into new forms, and\niteratively refined by a community of researchers? This essay offers a\nhigh-level overview of the key components for compositional systems biology,\nincluding: 1) a conceptual framework and corresponding graphical framework to\nrepresent interfaces, composition patterns, and orchestration patterns; 2)\nstandardized composition schemas that offer consistent formats for composable\ndata types and models, fostering robust infrastructure for a registry of\nsimulation modules that can be flexibly assembled; 3) a foundational set of\nbiological templates--schemas for cellular and molecular interfaces, which can\nbe filled with detailed submodels and datasets, and are designed to integrate\nknowledge that sheds light on the molecular emergence of cells; and 4)\nscientific collaboration facilitated by user-friendly interfaces for connecting\nresearchers with datasets and models, and which allows a community of\nresearchers to effectively build integrative multiscale models of cellular\nsystems.\n","subjects":["Quantitative Biology/Other Quantitative Biology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"U9I2vhzKiHySBdsSRnQLRf6uY3kPbFVLPei_KWA4Wz4","pdfSize":"3167480","txDigest":"C8BBVEQhFcfLJqGDtHJjzsZqCxgqt8ZddpSeYfLrXYc5","endEpoch":"1","status":"CERTIFIED"}
