{"id":"2408.09159","title":"Tuning the mechanical properties of organophilic clay dispersions:\n  particle composition and preshear history effects","authors":"Nikolaos A. Burger, Benoit Loppinet, Andrew Clarke and George\n  Petekidis","authorsParsed":[["Burger","Nikolaos A.",""],["Loppinet","Benoit",""],["Clarke","Andrew",""],["Petekidis","George",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 10:11:45 GMT"}],"updateDate":"2024-08-20","timestamp":1723889505000,"abstract":"  Clay minerals are abundant natural materials used widely in coatings,\nconstruction materials, ceramics, as well as being a component of drilling\nfluids. Here, we present the effect of steady and oscillatory preshear on\norganophilic modified clay gels in synthetic oil. Both platelet and needle-like\nparticles are used as viscosifiers in drilling fluid formulations. For both\nparticles the plateau modulus exhibits a similar concentration dependence, G_P\n~ c^3.9, whereas the yield strain is {\\gamma}_y ~ c^(-1) for the platelets and\n{\\gamma}_y ~ c^-1.7 for the needles. Mixtures of the two follow an intermediate\nbehavior: at low concentrations their elasticity and yield strain follows that\nof needle particles while at higher concentrations it exhibits a weaker power\nlaw dependence. Furthermore, upon varying the preshear history, the gel\nviscoelastic properties can be significantly tuned. At lower (higher) clay\nconcentrations, preshear at specific oscillatory strain amplitudes or steady\nshear rates, may induce a hardening (softening) of the dispersions and, at all\nconcentrations, a lowering of the shear strain. Hence, in needle dispersions\npreshear resulted in changes in the volume fraction dependence of the elastic\nmodulus from G_P ~ c^3.9 to G_P ~ c^2.5 and of the yield strain from {\\gamma}_y\n~ c^-1.7 to {\\gamma}_y ~ c^-1. However, small angle X-ray scattering showed not\nmuch structural changes, within the q-range covered. Our findings indicate ways\nto design colloidal organoclay dispersions with a mechanical response that can\nbe tuned at will.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"xhicsm-MJlH9kc6XSJXJ2Li09VslUS2WwZR3EFzwbpM","pdfSize":"1428224"}
