{"id":"2408.15020","title":"Hierarchical Graph Interaction Transformer with Dynamic Token Clustering\n  for Camouflaged Object Detection","authors":"Siyuan Yao, Hao Sun, Tian-Zhu Xiang, Xiao Wang and Xiaochun Cao","authorsParsed":[["Yao","Siyuan",""],["Sun","Hao",""],["Xiang","Tian-Zhu",""],["Wang","Xiao",""],["Cao","Xiaochun",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 12:53:25 GMT"}],"updateDate":"2024-08-28","timestamp":1724763205000,"abstract":"  Camouflaged object detection (COD) aims to identify the objects that\nseamlessly blend into the surrounding backgrounds. Due to the intrinsic\nsimilarity between the camouflaged objects and the background region, it is\nextremely challenging to precisely distinguish the camouflaged objects by\nexisting approaches. In this paper, we propose a hierarchical graph interaction\nnetwork termed HGINet for camouflaged object detection, which is capable of\ndiscovering imperceptible objects via effective graph interaction among the\nhierarchical tokenized features. Specifically, we first design a region-aware\ntoken focusing attention (RTFA) with dynamic token clustering to excavate the\npotentially distinguishable tokens in the local region. Afterwards, a\nhierarchical graph interaction transformer (HGIT) is proposed to construct\nbi-directional aligned communication between hierarchical features in the\nlatent interaction space for visual semantics enhancement. Furthermore, we\npropose a decoder network with confidence aggregated feature fusion (CAFF)\nmodules, which progressively fuses the hierarchical interacted features to\nrefine the local detail in ambiguous regions. Extensive experiments conducted\non the prevalent datasets, i.e. COD10K, CAMO, NC4K and CHAMELEON demonstrate\nthe superior performance of HGINet compared to existing state-of-the-art\nmethods. Our code is available at https://github.com/Garyson1204/HGINet.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}