{"id":"2408.11284","title":"Parametrized-Post-Newtonian Test of Black Hole Spacetime for Galactic\n  Center Massive Black Hole Sgr A*: Formulation and $\\chi^2$ Fitting","authors":"Hiromi Saida, Sena A. Matsui, Tsutomu T. Takeuchi, Shogo Nishiyama,\n  Rio Saitou, Yohsuke Takamori, and Masaaki Takahashi","authorsParsed":[["Saida","Hiromi",""],["Matsui","Sena A.",""],["Takeuchi","Tsutomu T.",""],["Nishiyama","Shogo",""],["Saitou","Rio",""],["Takamori","Yohsuke",""],["Takahashi","Masaaki",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 02:08:35 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 07:39:14 GMT"}],"updateDate":"2024-09-13","timestamp":1724206115000,"abstract":"  We have performed a parametrized post-Newtonian (PPN) test of a black hole\nspacetime using observational data of the star S0-2/S2 orbiting the massive\nblack hole at our galactic center Sgr A*. After introducing our PPN model of\nblack hole spacetime, we report the result of $\\chi^2$ fitting of the PPN model\nwith the observational data. A new finding through our PPN model is a\ndetectability of the gravitational lens effect on the null geodesics connecting\nS0-2 and observer under the present observational uncertainties, if a PPN\nparameter is about one order larger than the value for general relativity case.\nOn the other hand, the effect of black hole spin on the S0-2's motion is not\ndetectable. Thus our present PPN test is performed with spherically symmetric\nvacuum black hole spacetime. The resultant value of the PPN parameter, which\ncorresponds to the minimum $\\chi^2$, implies that the gravitational field of\nSgr A* is not of Schwarzschild metric or that there exists a sufficient amount\nof dark matters around Sgr A* to be detected by present telescopes. However,\nthe difference between the minimum $\\chi^2$ and the $\\chi^2$ of Schwarzschild\ncase is not large enough to ensure a statistical significance of\nnon-Schwarzschild result. A more precise statistical analysis than $\\chi^2$\nstatistics is necessary to extract a statistically significant information of\nthe gravitational field of Sgr A* from present observational data. We will\nreport a result by a Bayesian analysis in next paper.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}