{"id":"2408.09194","title":"DRL-Based Resource Allocation for Motion Blur Resistant Federated\n  Self-Supervised Learning in IoV","authors":"Xueying Gu, Qiong Wu, Pingyi Fan, Qiang Fan, Nan Cheng, Wen Chen, and\n  Khaled B. Letaief","authorsParsed":[["Gu","Xueying",""],["Wu","Qiong",""],["Fan","Pingyi",""],["Fan","Qiang",""],["Cheng","Nan",""],["Chen","Wen",""],["Letaief","Khaled B.",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 13:12:04 GMT"}],"updateDate":"2024-08-20","timestamp":1723900324000,"abstract":"  In the Internet of Vehicles (IoV), Federated Learning (FL) provides a\nprivacy-preserving solution by aggregating local models without sharing data.\nTraditional supervised learning requires image data with labels, but data\nlabeling involves significant manual effort. Federated Self-Supervised Learning\n(FSSL) utilizes Self-Supervised Learning (SSL) for local training in FL,\neliminating the need for labels while protecting privacy. Compared to other SSL\nmethods, Momentum Contrast (MoCo) reduces the demand for computing resources\nand storage space by creating a dictionary. However, using MoCo in FSSL\nrequires uploading the local dictionary from vehicles to Base Station (BS),\nwhich poses a risk of privacy leakage. Simplified Contrast (SimCo) addresses\nthe privacy leakage issue in MoCo-based FSSL by using dual temperature instead\nof a dictionary to control sample distribution. Additionally, considering the\nnegative impact of motion blur on model aggregation, and based on SimCo, we\npropose a motion blur-resistant FSSL method, referred to as BFSSL. Furthermore,\nwe address energy consumption and delay in the BFSSL process by proposing a\nDeep Reinforcement Learning (DRL)-based resource allocation scheme, called\nDRL-BFSSL. In this scheme, BS allocates the Central Processing Unit (CPU)\nfrequency and transmission power of vehicles to minimize energy consumption and\nlatency, while aggregating received models based on the motion blur level.\nSimulation results validate the effectiveness of our proposed aggregation and\nresource allocation methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}