{"id":"2408.00600","title":"Ground-to-UAV and RIS-assisted UAV-to-Ground Communication Under Channel\n  Aging: Statistical Characterization and Outage Performance","authors":"Thanh Luan Nguyen, Georges Kaddoum, Tri Nhu Do, Zygmunt J. Haas","authorsParsed":[["Nguyen","Thanh Luan",""],["Kaddoum","Georges",""],["Do","Tri Nhu",""],["Haas","Zygmunt J.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 14:31:13 GMT"}],"updateDate":"2024-08-02","timestamp":1722522673000,"abstract":"  This paper studies the statistical characterization of ground-to-air (G2A)\nand reconfigurable intelligent surface (RIS)-assisted air-to-ground (A2G)\ncommunications in RIS-assisted UAV networks under the impact of channel aging.\nA comprehensive channel model is presented, which incorporates the time-varying\nfading, three-dimensional (3D) mobility, Doppler shifts, and the effects of\nchannel aging on array antenna structures. We provide analytical expressions\nfor the G2A signal-to-noise ratio (SNR) probability density function (PDF) and\ncumulative distribution function (CDF), demonstrating that the G2A SNR follows\na mixture of noncentral $\\chi^2$ distributions. The A2G communication is\ncharacterized under RIS arbitrary phase-shift configurations, showing that the\nA2G SNR can be represented as the product of two correlated noncentral $\\chi^2$\nrandom variables (RVs). Additionally, we present the PDF and the CDF of the\nproduct of two independently distributed noncentral $\\chi^2$ RVs, which\naccurately characterize the A2G SNR's distribution. Our paper confirms the\neffectiveness of RISs in mitigating channel aging effects within the coherence\ntime. Finally, we propose an adaptive spectral efficiency method that ensures\nconsistent system performance and satisfactory outage levels when the UAV and\nthe ground user equipments are in motion.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6ww1mmCcyOID-xbutYEcQuRCGOXpYulKOk_z42J_RvY","pdfSize":"1614714","txDigest":"ErEExjWwXESk528R3A2jHCsj9QCmVstq8oMJVK1U9C7s","endEpoch":"1","status":"CERTIFIED"}
