{"id":"2408.07259","title":"GRIF-DM: Generation of Rich Impression Fonts using Diffusion Models","authors":"Lei Kang, Fei Yang, Kai Wang, Mohamed Ali Souibgui, Lluis Gomez,\n  Alicia Forn\\'es, Ernest Valveny, Dimosthenis Karatzas","authorsParsed":[["Kang","Lei",""],["Yang","Fei",""],["Wang","Kai",""],["Souibgui","Mohamed Ali",""],["Gomez","Lluis",""],["Fornés","Alicia",""],["Valveny","Ernest",""],["Karatzas","Dimosthenis",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 02:26:46 GMT"}],"updateDate":"2024-08-15","timestamp":1723602406000,"abstract":"  Fonts are integral to creative endeavors, design processes, and artistic\nproductions. The appropriate selection of a font can significantly enhance\nartwork and endow advertisements with a higher level of expressivity. Despite\nthe availability of numerous diverse font designs online, traditional\nretrieval-based methods for font selection are increasingly being supplanted by\ngeneration-based approaches. These newer methods offer enhanced flexibility,\ncatering to specific user preferences and capturing unique stylistic\nimpressions. However, current impression font techniques based on Generative\nAdversarial Networks (GANs) necessitate the utilization of multiple auxiliary\nlosses to provide guidance during generation. Furthermore, these methods\ncommonly employ weighted summation for the fusion of impression-related\nkeywords. This leads to generic vectors with the addition of more impression\nkeywords, ultimately lacking in detail generation capacity. In this paper, we\nintroduce a diffusion-based method, termed \\ourmethod, to generate fonts that\nvividly embody specific impressions, utilizing an input consisting of a single\nletter and a set of descriptive impression keywords. The core innovation of\n\\ourmethod lies in the development of dual cross-attention modules, which\nprocess the characteristics of the letters and impression keywords\nindependently but synergistically, ensuring effective integration of both types\nof information. Our experimental results, conducted on the MyFonts dataset,\naffirm that this method is capable of producing realistic, vibrant, and\nhigh-fidelity fonts that are closely aligned with user specifications. This\nconfirms the potential of our approach to revolutionize font generation by\naccommodating a broad spectrum of user-driven design requirements. Our code is\npublicly available at \\url{https://github.com/leitro/GRIF-DM}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"BpasVq23en1h25BYrD1E1TRfHfJIpp8bp2JEm92yo38","pdfSize":"1600809"}
