{"id":"2408.13485","title":"Accurate Performance Characterization, Reporting, and Benchmarking for\n  Indoor Photovoltaics","authors":"Javith Mohammed Jailani, Amanda Luu, Elizabeth Salvosa, Charlotte\n  Clegg, Vishnupriya P. Kamalon, Bahareh Nasrollahi, Irina Valitova, Sebastian\n  B. Meier, Andrew M. Shore, Behrang H. Hamadani, Vincenzo Pecunia","authorsParsed":[["Jailani","Javith Mohammed",""],["Luu","Amanda",""],["Salvosa","Elizabeth",""],["Clegg","Charlotte",""],["Kamalon","Vishnupriya P.",""],["Nasrollahi","Bahareh",""],["Valitova","Irina",""],["Meier","Sebastian B.",""],["Shore","Andrew M.",""],["Hamadani","Behrang H.",""],["Pecunia","Vincenzo",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 06:08:52 GMT"}],"updateDate":"2024-08-27","timestamp":1724479732000,"abstract":"  Indoor photovoltaics (IPVs) provide an increasingly promising solution for\npowering Internet-of-Things smart devices, which has led to a surge in IPV\nresearch and the development of new IPV technologies. However, the diverse\nlighting scenarios adopted in IPV research pose unique challenges in\ncharacterization, reporting, and benchmarking, which may obscure genuine\nperformance improvements and result in inaccurate conclusions due to\ncharacterization errors. Spectral variations among artificial light sources\nfurther complicate benchmarking. This study provides a comprehensive,\nquantitative analysis of these challenges, investigating them through\nexperimental characterization of IPVs covering a broad performance parameter\nspace, including c-Si, a-Si:H, perovskite, and organic devices. We reveal that\nmany of these challenges can lead to unacceptable error levels. A particularly\ncritical issue is the angular interplay among the light source, measuring\ndevice, and IPV device, which compromises accuracy under diffuse illumination.\nTo address these challenges, we evaluate practical protocols to overcome\nangular issues and enable benchmarking against standardized spectral\nconditions. To facilitate the implementation of our findings, we provide\ncomprehensive checklists for accurate IPV characterization, reporting, and\nbenchmarking. We anticipate that our analyses and guidelines will stimulate\nfurther advancements in IPV technologies by ensuring reliable performance\nevaluation, thereby facilitating the realization of IPVs' full potential.\n","subjects":["Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}