{"id":"2408.07907","title":"AIE: Auction Information Enhanced Framework for CTR Prediction in Online\n  Advertising","authors":"Yang Yang, Bo Chen, Chenxu Zhu, Menghui Zhu, Xinyi Dai, Huifeng Guo,\n  Muyu Zhang, Zhenhua Dong and Ruiming Tang","authorsParsed":[["Yang","Yang",""],["Chen","Bo",""],["Zhu","Chenxu",""],["Zhu","Menghui",""],["Dai","Xinyi",""],["Guo","Huifeng",""],["Zhang","Muyu",""],["Dong","Zhenhua",""],["Tang","Ruiming",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 03:25:56 GMT"}],"updateDate":"2024-08-16","timestamp":1723692356000,"abstract":"  Click-Through Rate (CTR) prediction is a fundamental technique for online\nadvertising recommendation and the complex online competitive auction process\nalso brings many difficulties to CTR optimization. Recent studies have shown\nthat introducing posterior auction information contributes to the performance\nof CTR prediction. However, existing work doesn't fully capitalize on the\nbenefits of auction information and overlooks the data bias brought by the\nauction, leading to biased and suboptimal results. To address these\nlimitations, we propose Auction Information Enhanced Framework (AIE) for CTR\nprediction in online advertising, which delves into the problem of insufficient\nutilization of auction signals and first reveals the auction bias.\nSpecifically, AIE introduces two pluggable modules, namely Adaptive\nMarket-price Auxiliary Module (AM2) and Bid Calibration Module (BCM), which\nwork collaboratively to excavate the posterior auction signals better and\nenhance the performance of CTR prediction. Furthermore, the two proposed\nmodules are lightweight, model-agnostic, and friendly to inference latency.\nExtensive experiments are conducted on a public dataset and an industrial\ndataset to demonstrate the effectiveness and compatibility of AIE. Besides, a\none-month online A/B test in a large-scale advertising platform shows that AIE\nimproves the base model by 5.76% and 2.44% in terms of eCPM and CTR,\nrespectively.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}