{"id":"2408.10581","title":"Multi-view Hand Reconstruction with a Point-Embedded Transformer","authors":"Lixin Yang, Licheng Zhong, Pengxiang Zhu, Xinyu Zhan, Junxiao Kong,\n  Jian Xu, Cewu Lu","authorsParsed":[["Yang","Lixin",""],["Zhong","Licheng",""],["Zhu","Pengxiang",""],["Zhan","Xinyu",""],["Kong","Junxiao",""],["Xu","Jian",""],["Lu","Cewu",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 06:42:17 GMT"}],"updateDate":"2024-08-21","timestamp":1724136137000,"abstract":"  This work introduces a novel and generalizable multi-view Hand Mesh\nReconstruction (HMR) model, named POEM, designed for practical use in\nreal-world hand motion capture scenarios. The advances of the POEM model\nconsist of two main aspects. First, concerning the modeling of the problem, we\npropose embedding a static basis point within the multi-view stereo space. A\npoint represents a natural form of 3D information and serves as an ideal medium\nfor fusing features across different views, given its varied projections across\nthese views. Consequently, our method harnesses a simple yet effective idea: a\ncomplex 3D hand mesh can be represented by a set of 3D basis points that 1) are\nembedded in the multi-view stereo, 2) carry features from the multi-view\nimages, and 3) encompass the hand in it. The second advance lies in the\ntraining strategy. We utilize a combination of five large-scale multi-view\ndatasets and employ randomization in the number, order, and poses of the\ncameras. By processing such a vast amount of data and a diverse array of camera\nconfigurations, our model demonstrates notable generalizability in the\nreal-world applications. As a result, POEM presents a highly practical,\nplug-and-play solution that enables user-friendly, cost-effective multi-view\nmotion capture for both left and right hands. The model and source codes are\navailable at https://github.com/JubSteven/POEM-v2.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}