{"id":"2408.05920","title":"Urban Region Pre-training and Prompting: A Graph-based Approach","authors":"Jiahui Jin, Yifan Song, Dong Kan, Haojia Zhu, Xiangguo Sun, Zhicheng\n  Li, Xigang Sun and Jinghui Zhang","authorsParsed":[["Jin","Jiahui",""],["Song","Yifan",""],["Kan","Dong",""],["Zhu","Haojia",""],["Sun","Xiangguo",""],["Li","Zhicheng",""],["Sun","Xigang",""],["Zhang","Jinghui",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 05:00:23 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 15:56:34 GMT"},{"version":"v3","created":"Mon, 26 Aug 2024 11:41:28 GMT"}],"updateDate":"2024-08-27","timestamp":1723438823000,"abstract":"  Urban region representation is crucial for various urban downstream tasks.\nHowever, despite the proliferation of methods and their success, acquiring\ngeneral urban region knowledge and adapting to different tasks remains\nchallenging. Previous work often neglects the spatial structures and functional\nlayouts between entities, limiting their ability to capture transferable\nknowledge across regions. Further, these methods struggle to adapt effectively\nto specific downstream tasks, as they do not adequately address the unique\nfeatures and relationships required for different downstream tasks. In this\npaper, we propose a $\\textbf{G}$raph-based $\\textbf{U}$rban $\\textbf{R}$egion\n$\\textbf{P}$re-training and $\\textbf{P}$rompting framework ($\\textbf{GURPP}$)\nfor region representation learning. Specifically, we first construct an urban\nregion graph that integrates detailed spatial entity data for more effective\nurban region representation. Then, we develop a subgraph-centric urban region\npre-training model to capture the heterogeneous and transferable patterns of\ninteractions among entities. To further enhance the adaptability of these\nembeddings to different tasks, we design two graph-based prompting methods to\nincorporate explicit/hidden task knowledge. Extensive experiments on various\nurban region prediction tasks and different cities demonstrate the superior\nperformance of our GURPP framework.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}