{"id":"2408.14743","title":"Personalized Video Summarization using Text-Based Queries and\n  Conditional Modeling","authors":"Jia-Hong Huang","authorsParsed":[["Huang","Jia-Hong",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 02:43:40 GMT"}],"updateDate":"2024-08-28","timestamp":1724726620000,"abstract":"  The proliferation of video content on platforms like YouTube and Vimeo\npresents significant challenges in efficiently locating relevant information.\nAutomatic video summarization aims to address this by extracting and presenting\nkey content in a condensed form. This thesis explores enhancing video\nsummarization by integrating text-based queries and conditional modeling to\ntailor summaries to user needs. Traditional methods often produce fixed\nsummaries that may not align with individual requirements. To overcome this, we\npropose a multi-modal deep learning approach that incorporates both textual\nqueries and visual information, fusing them at different levels of the model\narchitecture. Evaluation metrics such as accuracy and F1-score assess the\nquality of the generated summaries. The thesis also investigates improving\ntext-based query representations using contextualized word embeddings and\nspecialized attention networks. This enhances the semantic understanding of\nqueries, leading to better video summaries. To emulate human-like\nsummarization, which accounts for both visual coherence and abstract factors\nlike storyline consistency, we introduce a conditional modeling approach. This\nmethod uses multiple random variables and joint distributions to capture key\nsummarization components, resulting in more human-like and explainable\nsummaries. Addressing data scarcity in fully supervised learning, the thesis\nproposes a segment-level pseudo-labeling approach. This self-supervised method\ngenerates additional data, improving model performance even with limited\nhuman-labeled datasets. In summary, this research aims to enhance automatic\nvideo summarization by incorporating text-based queries, improving query\nrepresentations, introducing conditional modeling, and addressing data\nscarcity, thereby creating more effective and personalized video summaries.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/"}