{"id":"2408.15253","title":"A generative foundation model for five-class sleep staging with\n  arbitrary sensor input","authors":"Hans van Gorp, Merel M. van Gilst, Pedro Fonseca, Fokke B. van Meulen,\n  Johannes P. van Dijk, Sebastiaan Overeem, Ruud J. G. van Sloun","authorsParsed":[["van Gorp","Hans",""],["van Gilst","Merel M.",""],["Fonseca","Pedro",""],["van Meulen","Fokke B.",""],["van Dijk","Johannes P.",""],["Overeem","Sebastiaan",""],["van Sloun","Ruud J. G.",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 08:09:28 GMT"}],"updateDate":"2024-08-29","timestamp":1723190968000,"abstract":"  Gold-standard sleep scoring as performed by human technicians is based on a\nsubset of PSG signals, namely the EEG, EOG, and EMG. The PSG, however, consists\nof many more signal derivations that could potentially be used to perform sleep\nstaging, including cardiac and respiratory modalities. Leveraging this variety\nin signals would offer advantages, for example by increasing reliability,\nresilience to signal loss, and application to long-term non-obtrusive\nrecordings. This paper proposes a deep generative foundation model for fully\nautomatic sleep staging from a plurality of sensors and any combination\nthereof. We trained a score-based diffusion model with a transformer backbone\nusing a dataset of 1947 expert-labeled overnight sleep recordings with 36\ndifferent signals, including neurological, cardiac, and respiratory signals. We\nachieve zero-shot inference on any sensor set by using a novel Bayesian\nfactorization of the score function across the sensors, i.e., it does not\nrequire retraining on specific combinations of signals. On single-channel EEG,\nour method reaches the performance limit in terms of PSG inter-rater agreement\n(5-class accuracy 85.6%, kappa 0.791). At the same time, the method offers full\nflexibility to use any sensor set derived from other modalities, for example,\nas typically used in home recordings that include finger PPG, nasal cannula and\nthoracic belt (5-class accuracy 79.0%, kappa of 0.697), or by combining\nderivations not typically used for sleep staging such as the tibialis and\nsternocleidomastoid EMG (5-class accuracy 71.0%, kappa of 0.575). Additionally,\nwe propose a novel interpretability metric in terms of information gain per\nsensor and show that this is linearly correlated with classification\nperformance. Lastly, our foundation model allows for post-hoc addition of\nentirely new sensor modalities by merely training a score estimator on the\nnovel input.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}