{"id":"2408.14683","title":"Internal gravity waves in flow past a bluff body under different levels\n  of stratification","authors":"Divyanshu Gola, Sheel Nidhan, Sutanu Sarkar","authorsParsed":[["Gola","Divyanshu",""],["Nidhan","Sheel",""],["Sarkar","Sutanu",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 23:15:35 GMT"}],"updateDate":"2024-08-28","timestamp":1724714135000,"abstract":"  The flow field of a bluff body, a circular disk, that moves horizontally in a\nstratified environment is studied using large eddy simulations (LES). Five\nlevels of stratification (body Froude numbers of Fr = 0.5, 1, 1.5, 2 and 5) are\nsimulated at Reynolds number of Re = 5000 and Prandtl number of Pr = 1. A\nhigher Re = 50, 000 database at Fr = 2, 10 and Pr = 1 is also examined for\ncomparison. The wavelength and amplitude of steady lee waves are compared with\na linear-theory analysis. Excellent agreement is found over the entire range of\nFr if an equivalent body that includes the separation region is employed for\nthe linear theory. For asymptotically large distance, the velocity amplitude\nvaries theoretically as Fr raised to negative 1 but a correction owing to\ndependence of the separation zone on Fr is needed. The wake waves propagate in\na narrow band of angles with the vertical and have a wavelength that increases\nwith increasing Fr. The envelope of wake waves, demarcated using buoyancy\nvariance, exhibits self-similar behavior. The higher Re results are consistent\nwith the buoyancy effects exhibited at the lower Re. The wake wave energy is\nlarger at Re = 50000. Nevertheless, independent of Fr and Re, the ratio of the\nwake wave potential energy to the wake turbulent energy increases to\napproximately 0.6 to 0.7 in the nonequilibrium (NEQ) stage showing their\nenergetic importance besides suggesting universality in this statistic. There\nis a crossover of energetic dominance of lee waves at Fr less than 2 to\nwake-wave dominance at Fr approximately equal to 5.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}