{"id":"2408.13822","title":"Informativeness and Trust in Bayesian Persuasion","authors":"Reema Deori, Ankur A. Kulkarni","authorsParsed":[["Deori","Reema",""],["Kulkarni","Ankur A.",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 12:29:47 GMT"}],"updateDate":"2024-08-27","timestamp":1724588987000,"abstract":"  A persuasion policy successfully persuades an agent to pick a particular\naction only if the information is designed in a manner that convinces the agent\nthat it is in their best interest to pick that action. Thus, it is natural to\nask, what makes the agent trust the persuader's suggestion? We study a Bayesian\npersuasion interaction between a sender and a receiver where the sender has\naccess to private information and the receiver attempts to recover this\ninformation from messages sent by the sender. The sender crafts these messages\nin an attempt to maximize its utility which depends on the source symbol and\nthe symbol recovered by the receiver. Our goal is to characterize the\n\\textit{Stackelberg game value}, and the amount of true information revealed by\nthe sender during persuasion. We find that the SGV is given by the optimal\nvalue of a \\textit{linear program} on probability distributions constrained by\ncertain \\textit{trust constraints}. These constraints encode that any signal in\na persuasion strategy must contain more truth than untruth and thus impose a\nfundamental bound on the extent of obfuscation a sender can perform. We define\n\\textit{informativeness} of the sender as the minimum expected number of\nsymbols truthfully revealed by the sender in any accumulation point of a\nsequence of $\\varepsilon$-equilibrium persuasion strategies, and show that it\nis given by another linear program. Informativeness is a fundamental bound on\nthe amount of information the sender must reveal to persuade a receiver. Closed\nform expressions for the SGV and the informativeness are presented for\nstructured utility functions. This work generalizes our previous work where the\nsender and the receiver were constrained to play only deterministic strategies\nand a similar notion of informativeness was characterized. Comparisons between\nthe previous and current notions are discussed.\n","subjects":["Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Systems and Control","Economics/Theoretical Economics","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"r-1Vg0ygUYJqiaBy6EueH7e-qUXJ3HCZT39c40aQGwI","pdfSize":"259842"}
