{"id":"2408.16778","title":"Deep Complex-valued Radial Basis Function Neural Networks and Parameter\n  Selection","authors":"Jonathan A. Soares, Vin\\'icius H. Luiz, Dalton S. Arantes and Kayol S.\n  Mayer","authorsParsed":[["Soares","Jonathan A.",""],["Luiz","Vinícius H.",""],["Arantes","Dalton S.",""],["Mayer","Kayol S.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 14:22:57 GMT"}],"updateDate":"2024-09-04","timestamp":1723731777000,"abstract":"  In the ever-evolving field of artificial neural networks and learning\nsystems, complex-valued neural networks (CVNNs) have become a cornerstone,\nachieving exceptional performance in image processing and telecommunications.\nMore precisely, in digital communication systems, CVNNs have been delivering\nsignificant results in tasks like equalization, channel estimation,\nbeamforming, and decoding. Among the CVNN architectures, the complex-valued\nradial basis function neural network (C-RBF) stands out, especially when\noperating in noisy environments such as 5G multiple-input multiple-output\n(MIMO) systems. In such a context, this paper extends the classical shallow\nC-RBF to deep architectures, increasing its flexibility for a wider range of\napplications. Also, based on the parameter selection of the phase transmittance\nradial basis function (PT-RBF) neural network, we propose an initialization\nscheme for the deep C-RBF. Via rigorous simulations conforming to 3GPP TS 38\nstandards for digital communications, our method not only outperforms\nconventional initialization strategies like random, $K$-means, and\nconstellation-based methods but it also seems to be the only approach to\nachieve successful convergence for deep C-RBF architectures. These findings\npave the way to more robust and efficient neural network deployments in\ncomplex-valued digital communication systems.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}