{"id":"2408.08348","title":"A local diagnostic program for unitary evolution in general space-times","authors":"Ka Hei Choi and Stefan Hofmann and Marc Schneider","authorsParsed":[["Choi","Ka Hei",""],["Hofmann","Stefan",""],["Schneider","Marc",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-19","timestamp":1723744800000,"abstract":"  We present a local framework for investigating non-unitary evolution groups\npertinent to effective field theories in general semi-classical spacetimes. Our\napproach is based on a rigorous local stability analysis of the algebra of\nobservables and solely employs geometric concepts in the functional\nrepresentation of quantum field theory. In this representation, it is possible\nto construct infinitely many self-adjoint extensions of the canonical momentum\nfield at the kinematic level, and by the usual functional calculus arguments\nthis holds for the Hamiltonian, as well. However, these self-adjoint domains\nhave only the trivial wave functional in common with the solution space of the\nfunctional Schr\\\"odinger equation. This is related to the existence of\nboundaries in configuration field space which can be penetrated by the\nprobability flux, causing probability to leak into regions in configuration\nfield space that require a more fundamental description. As a consequence the\nevolution admits no unitary representation. Instead, in the absence of ghosts,\nthe evolution is represented by contractive semi-groups in the semiclassical\napproximation. This allows to quantify the unitarity loss and, in turn, to\nassess the quality of the semi-classical approximation. We perform numerical\nexperiments based on our formal investigations to determine regions in\ncosmological spacetimes where the semiclassical approximation breaks down for\nfree quantum fields.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}