{"id":"2408.16084","title":"Benchmarking with Supernovae: A Performance Study of the FLASH Code","authors":"Joshua Martin, Catherine Feldman, Eva Siegmann, Tony Curtis, David\n  Carlson, Firat Coskun, Daniel Wood, Raul Gonzalez, Robert J. Harrison, Alan\n  C. Calder","authorsParsed":[["Martin","Joshua",""],["Feldman","Catherine",""],["Siegmann","Eva",""],["Curtis","Tony",""],["Carlson","David",""],["Coskun","Firat",""],["Wood","Daniel",""],["Gonzalez","Raul",""],["Harrison","Robert J.",""],["Calder","Alan C.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:27:29 GMT"}],"updateDate":"2024-08-30","timestamp":1724869649000,"abstract":"  Astrophysical simulations are computation, memory, and thus energy intensive,\nthereby requiring new hardware advances for progress. Stony Brook University\nrecently expanded its computing cluster \"SeaWulf\" with an addition of 94 new\nnodes featuring Intel Sapphire Rapids Xeon Max series CPUs. We present a\nperformance and power efficiency study of this hardware performed with FLASH: a\nmulti-scale, multi-physics, adaptive mesh-based software instrument. We extend\nthis study to compare performance to that of Stony Brook's Ookami testbed which\nfeatures ARM-based A64FX-700 processors, and SeaWulf's AMD EPYC Milan and Intel\nSkylake nodes. Our application is a stellar explosion known as a thermonuclear\n(Type Ia) supernova and for this 3D problem, FLASH includes operators for\nhydrodynamics, gravity, and nuclear burning, in addition to routines for the\nmaterial equation of state. We perform a strong-scaling study with a 220 GB\nproblem size to explore both single- and multi-node performance. Our study\nexplores the performance of different MPI mappings and the distribution of\nprocessors across nodes. From these tests, we determined the optimal\nconfiguration to balance runtime and energy consumption for our application.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}