{"id":"2408.01303","title":"A Systematic Mapping Study on SDN Controllers for Enhancing Security in\n  IoT Networks","authors":"Charles Oredola, Adnan Ashraf","authorsParsed":[["Oredola","Charles",""],["Ashraf","Adnan",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 14:44:15 GMT"}],"updateDate":"2024-08-05","timestamp":1722609855000,"abstract":"  Context: The increase in Internet of Things (IoT) devices gives rise to an\nincrease in deceptive manipulations by malicious actors. These actors should be\nprevented from targeting the IoT networks. Cybersecurity threats have evolved\nand become dynamically sophisticated, such that they could exploit any\nvulnerability found in IoT networks. However, with the introduction of the\nSoftware Defined Network (SDN) in the IoT networks as the central monitoring\nunit, IoT networks are less vulnerable and less prone to threats. %Although,\nthe SDN itself is vulnerable to several threats.\n  Objective: To present a comprehensive and unbiased overview of the\nstate-of-the-art on IoT networks security enhancement using SDN controllers.\n  Method: We review the current body of knowledge on enhancing the security of\nIoT networks using SDN with a Systematic Mapping Study (SMS) following the\nestablished guidelines.\n  Results: The SMS result comprises 33 primary studies analyzed against four\nmajor research questions. The SMS highlights current research trends and\nidentifies gaps in the SDN-IoT network security.\n  Conclusion: We conclude that the SDN controller architecture commonly used\nfor securing IoT networks is the centralized controller architecture. However,\nthis architecture is not without its limitations. Additionally, the predominant\ntechnique utilized for risk mitigation is machine learning.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/"}