{"id":"2408.15317","title":"Aggressively-Dissipative Dark Dwarfs: The Effects of Atomic Dark Matter\n  on the Inner Densities of Isolated Dwarf Galaxies","authors":"Sandip Roy, Xuejian Shen, Jared Barron, Mariangela Lisanti, David\n  Curtin, Norman Murray, Philip F. Hopkins","authorsParsed":[["Roy","Sandip",""],["Shen","Xuejian",""],["Barron","Jared",""],["Lisanti","Mariangela",""],["Curtin","David",""],["Murray","Norman",""],["Hopkins","Philip F.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-29","timestamp":1724781600000,"abstract":"  We present the first suite of cosmological hydrodynamical zoom-in simulations\nof isolated dwarf galaxies for a dark sector that consists of Cold Dark Matter\nand a strongly-dissipative sub-component. The simulations are implemented in\nGIZMO and include standard baryons following the FIRE-2 galaxy formation\nphysics model. The dissipative dark matter is modeled as Atomic Dark Matter\n(aDM), which forms a dark hydrogen gas that cools in direct analogy to the\nStandard Model. Our suite includes seven different simulations of $\\sim 10^{10}\nM_{\\odot}$ systems that vary over the aDM microphysics and the dwarf's\nevolutionary history. We identify a region of aDM parameter space where the\ncooling rate is aggressive and the resulting halo density profile is universal.\nIn this regime, the aDM gas cools rapidly at high redshifts and only a small\nfraction survives in the form of a central dark gas disk; the majority\ncollapses centrally into collisionless dark \"clumps\", which are clusters of\nsub-resolution dark compact objects. These dark clumps rapidly equilibrate in\nthe inner galaxy, resulting in an approximately isothermal distribution that\ncan be modeled with a simple fitting function. Even when only a small fraction\n($\\sim 5\\%$) of the total dark matter is strongly dissipative, the central\ndensities of classical dwarf galaxies can be enhanced by over an order of\nmagnitude, providing a sharp prediction for observations.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_A19R6AXKOv3NjUC-Oy8aK7x1alBMAfMlb9225oZhvo","pdfSize":"10832966"}
