{"id":"2408.12355","title":"Class-balanced Open-set Semi-supervised Object Detection for Medical\n  Images","authors":"Zhanyun Lu, Renshu Gu, Huimin Cheng, Siyu Pang, Mingyu Xu, Peifang Xu,\n  Yaqi Wang, Yuichiro Kinoshita, Juan Ye, Gangyong Jia, Qing Wu","authorsParsed":[["Lu","Zhanyun",""],["Gu","Renshu",""],["Cheng","Huimin",""],["Pang","Siyu",""],["Xu","Mingyu",""],["Xu","Peifang",""],["Wang","Yaqi",""],["Kinoshita","Yuichiro",""],["Ye","Juan",""],["Jia","Gangyong",""],["Wu","Qing",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 12:54:15 GMT"}],"updateDate":"2024-08-23","timestamp":1724331255000,"abstract":"  Medical image datasets in the real world are often unlabeled and imbalanced,\nand Semi-Supervised Object Detection (SSOD) can utilize unlabeled data to\nimprove an object detector. However, existing approaches predominantly assumed\nthat the unlabeled data and test data do not contain out-of-distribution (OOD)\nclasses. The few open-set semi-supervised object detection methods have two\nweaknesses: first, the class imbalance is not considered; second, the OOD\ninstances are distinguished and simply discarded during pseudo-labeling. In\nthis paper, we consider the open-set semi-supervised object detection problem\nwhich leverages unlabeled data that contain OOD classes to improve object\ndetection for medical images. Our study incorporates two key innovations:\nCategory Control Embed (CCE) and out-of-distribution Detection Fusion\nClassifier (OODFC). CCE is designed to tackle dataset imbalance by constructing\na Foreground information Library, while OODFC tackles open-set challenges by\nintegrating the ``unknown'' information into basic pseudo-labels. Our method\noutperforms the state-of-the-art SSOD performance, achieving a 4.25 mAP\nimprovement on the public Parasite dataset.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}