{"id":"2408.14691","title":"Effects Among the Affected","authors":"Lina M. Montoya and Elvin H. Geng and Michael Valancius and Michael R.\n  Kosorok and Maya L. Petersen","authorsParsed":[["Montoya","Lina M.",""],["Geng","Elvin H.",""],["Valancius","Michael",""],["Kosorok","Michael R.",""],["Petersen","Maya L.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 23:37:13 GMT"}],"updateDate":"2024-08-28","timestamp":1724715433000,"abstract":"  Many interventions are both beneficial to initiate and harmful to stop.\nTraditionally, to determine whether to deploy that intervention in a\ntime-limited way depends on if, on average, the increase in the benefits of\nstarting it outweigh the increase in the harms of stopping it. We propose a\nnovel causal estimand that provides a more nuanced understanding of the effects\nof such treatments, particularly, how response to an earlier treatment (e.g.,\ntreatment initiation) modifies the effect of a later treatment (e.g., treatment\ndiscontinuation), thus learning if there are effects among the (un)affected.\nSpecifically, we consider a marginal structural working model summarizing how\nthe average effect of a later treatment varies as a function of the (estimated)\nconditional average effect of an earlier treatment. We allow for estimation of\nthis conditional average treatment effect using machine learning, such that the\ncausal estimand is a data-adaptive parameter. We show how a sequentially\nrandomized design can be used to identify this causal estimand, and we describe\na targeted maximum likelihood estimator for the resulting statistical estimand,\nwith influence curve-based inference. Throughout, we use the Adaptive\nStrategies for Preventing and Treating Lapses of Retention in HIV Care trial\n(NCT02338739) as an illustrative example, showing that discontinuation of\nconditional cash transfers for HIV care adherence was most harmful among those\nwho most had an increase in benefits from them initially.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/"}