{"id":"2408.00929","title":"Verification of Machine Unlearning is Fragile","authors":"Binchi Zhang, Zihan Chen, Cong Shen, Jundong Li","authorsParsed":[["Zhang","Binchi",""],["Chen","Zihan",""],["Shen","Cong",""],["Li","Jundong",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 21:37:10 GMT"}],"updateDate":"2024-08-05","timestamp":1722548230000,"abstract":"  As privacy concerns escalate in the realm of machine learning, data owners\nnow have the option to utilize machine unlearning to remove their data from\nmachine learning models, following recent legislation. To enhance transparency\nin machine unlearning and avoid potential dishonesty by model providers,\nvarious verification strategies have been proposed. These strategies enable\ndata owners to ascertain whether their target data has been effectively\nunlearned from the model. However, our understanding of the safety issues of\nmachine unlearning verification remains nascent. In this paper, we explore the\nnovel research question of whether model providers can circumvent verification\nstrategies while retaining the information of data supposedly unlearned. Our\ninvestigation leads to a pessimistic answer: \\textit{the verification of\nmachine unlearning is fragile}. Specifically, we categorize the current\nverification strategies regarding potential dishonesty among model providers\ninto two types. Subsequently, we introduce two novel adversarial unlearning\nprocesses capable of circumventing both types. We validate the efficacy of our\nmethods through theoretical analysis and empirical experiments using real-world\ndatasets. This study highlights the vulnerabilities and limitations in machine\nunlearning verification, paving the way for further research into the safety of\nmachine unlearning.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EJoG_gAZy19VSobAlxIKCTKAYQ-ZTqYru5lfJC3fCFw","pdfSize":"836662","txDigest":"EupM5EYSwfhSaLJhJknwJ4JVZHaGRYVtVq2oqrRWWpYS","endEpoch":"1","status":"CERTIFIED"}
