{"id":"2408.10299","title":"RV measurements of directly imaged brown dwarf GQ Lup B to search for\n  exo-satellites","authors":"Katelyn Horstman, Jean-Baptiste Ruffio, Konstantin Batygin, Dimitri\n  Mawet, Ashley Baker, Chih-Chun Hsu, Jason J. Wang, Ji Wang, Sarah Blunt,\n  Jerry W. Xuan, Yinzi Xin, Joshua Liberman, Shubh Agrawal, Quinn M. Konopacky,\n  Geoffrey A. Blake, Clarissa R. Do O, Randall Bartos, Charlotte Z. Bond,\n  Benjamin Calvin, Sylvain Cetre, Jacques-Robert Delorme, Greg Doppmann, Daniel\n  Echeverri, Luke Finnerty, Michael P. Fitzgerald, Nemanja Jovanovic, Ronald\n  Lopez, Emily C. Martin, Evan Morris, Jacklyn Pezzato, Garreth Ruane, Ben\n  Sappey, Tobias Schofield, Andrew Skemer, Taylor Venenciano, J. Kent Wallace,\n  Nicole L. Wallack, and Peter Wizinowich","authorsParsed":[["Horstman","Katelyn",""],["Ruffio","Jean-Baptiste",""],["Batygin","Konstantin",""],["Mawet","Dimitri",""],["Baker","Ashley",""],["Hsu","Chih-Chun",""],["Wang","Jason J.",""],["Wang","Ji",""],["Blunt","Sarah",""],["Xuan","Jerry W.",""],["Xin","Yinzi",""],["Liberman","Joshua",""],["Agrawal","Shubh",""],["Konopacky","Quinn M.",""],["Blake","Geoffrey A.",""],["O","Clarissa R. Do",""],["Bartos","Randall",""],["Bond","Charlotte Z.",""],["Calvin","Benjamin",""],["Cetre","Sylvain",""],["Delorme","Jacques-Robert",""],["Doppmann","Greg",""],["Echeverri","Daniel",""],["Finnerty","Luke",""],["Fitzgerald","Michael P.",""],["Jovanovic","Nemanja",""],["Lopez","Ronald",""],["Martin","Emily C.",""],["Morris","Evan",""],["Pezzato","Jacklyn",""],["Ruane","Garreth",""],["Sappey","Ben",""],["Schofield","Tobias",""],["Skemer","Andrew",""],["Venenciano","Taylor",""],["Wallace","J. Kent",""],["Wallack","Nicole L.",""],["Wizinowich","Peter",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-21","timestamp":1724090400000,"abstract":"  GQ Lup B is one of the few substellar companions with a detected\ncicumplanetary disk, or CPD. Observations of the CPD suggest the presence of a\ncavity, possibly formed by an exo-satellite. Using the Keck Planet Imager and\nCharacterizer (KPIC), a high contrast imaging suite that feeds a high\nresolution spectrograph (1.9-2.5 microns, R$\\sim$35,000), we present the first\ndedicated radial velocity (RV) observations around a high-contrast, directly\nimaged substellar companion, GQ Lup B, to search for exo-satellites. Over 11\nepochs, we find a best and median RV error of 400-1000 m/s, most likely limited\nby systematic fringing in the spectra due to transmissive optics within KPIC.\nWith this RV precision, KPIC is sensitive to exomoons 0.6-2.8% the mass of GQ\nLup B ($\\sim 30 M_{\\text{Jup}}$) at separations between the Roche limit and $65\nR_{\\text{Jup}}$, or the extent of the cavity inferred within the CPD detected\naround GQ Lup B. Using simulations of HISPEC, a high resolution infrared\nspectrograph planned to debut at W.M. Keck Observatory in 2026, we estimate\nfuture exomoon sensitivity to increase by over an order of magnitude, providing\nsensitivity to less massive satellites potentially formed within the CPD\nitself. Additionally, we run simulations to estimate the amount of material\nthat different masses of satellites could clear in a CPD to create the observed\ncavity. We find satellite-to-planet mass ratios of $q > 2 \\times 10^{-4}$ can\ncreate observable cavities and report a maximum cavity size of $\\sim 51 \\,\nR_{\\text{Jup}}$ carved from a satellite.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}