{"id":"2408.04096","title":"Asteroid Period Solutions from Combined Dense and Sparse Photometry","authors":"Michael Gowanlock, David E. Trilling, Andrew McNeill, Daniel Kramer,\n  Maria Chernyavskaya","authorsParsed":[["Gowanlock","Michael",""],["Trilling","David E.",""],["McNeill","Andrew",""],["Kramer","Daniel",""],["Chernyavskaya","Maria",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 21:25:40 GMT"}],"updateDate":"2024-08-09","timestamp":1723065940000,"abstract":"  Deriving high quality lightcuves for asteroids and other periodic sources\nfrom survey data is challenging due to many factors, including the sparsely\nsampled observational record and diurnal aliasing which is a signature imparted\ninto the periodic signal of a source that is a function of the observing\nschedule of ground-based telescopes. In this paper, we examine the utility of\ncombining asteroid observational records from the Zwicky Transient Facility\n(ZTF) and the Transiting Exoplanet Survey Satellite (TESS) which are the\nground- and space-based facilities, respectively, to determine to what degree\nthe data from the space-based facility can suppress diurnal aliases.\nFurthermore, we examine several optimizations that are used to derive the\nrotation periods of asteroids which we then compare to the reported rotation\nperiods in the literature. Through this analysis we find that we can reliably\nderive the rotation periods for ~85% of our sample of 222 objects that are also\nreported in the literature and that the remaining ~15% are difficult to\nreliably derive as many are asteroids that are insufficiently elongated which\nproduces a lightcurve with an insufficient amplitude and consequently, an\nincorrect rotation period. We also investigate a binary classification method\nthat biases against reporting incorrect rotation periods. We conclude the paper\nby assessing the utility of using other ground- or space-based facilities as\ncompanion telescopes to the forthcoming Rubin Observatory.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}