{"id":"2408.13818","title":"HER2 and FISH Status Prediction in Breast Biopsy H&E-Stained Images\n  Using Deep Learning","authors":"Ardhendu Sekhar, Vrinda Goel, Garima Jain, Abhijeet Patil, Ravi Kant\n  Gupta, Amit Sethi","authorsParsed":[["Sekhar","Ardhendu",""],["Goel","Vrinda",""],["Jain","Garima",""],["Patil","Abhijeet",""],["Gupta","Ravi Kant",""],["Sethi","Amit",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 12:22:50 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 17:19:34 GMT"}],"updateDate":"2024-08-29","timestamp":1724588570000,"abstract":"  The current standard for detecting human epidermal growth factor receptor 2\n(HER2) status in breast cancer patients relies on HER2 amplification,\nidentified through fluorescence in situ hybridization (FISH) or\nimmunohistochemistry (IHC). However, hematoxylin and eosin (H\\&E) tumor stains\nare more widely available, and accurately predicting HER2 status using H\\&E\ncould reduce costs and expedite treatment selection. Deep Learning algorithms\nfor H&E have shown effectiveness in predicting various cancer features and\nclinical outcomes, including moderate success in HER2 status prediction. In\nthis work, we employed a customized weak supervision classification technique\ncombined with MoCo-v2 contrastive learning to predict HER2 status. We trained\nour pipeline on 182 publicly available H&E Whole Slide Images (WSIs) from The\nCancer Genome Atlas (TCGA), for which annotations by the pathology team at Yale\nSchool of Medicine are publicly available. Our pipeline achieved an Area Under\nthe Curve (AUC) of 0.85 across four different test folds. Additionally, we\ntested our model on 44 H&E slides from the TCGA-BRCA dataset, which had an HER2\nscore of 2+ and included corresponding HER2 status and FISH test results. These\ncases are considered equivocal for IHC, requiring an expensive FISH test on\ntheir IHC slides for disambiguation. Our pipeline demonstrated an AUC of 0.81\non these challenging H&E slides. Reducing the need for FISH test can have\nsignificant implications in cancer treatment equity for underserved\npopulations.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rBQJ-cVD_mUOn_YZHctIrmCks5xqCEloM8CM79sOPrY","pdfSize":"1952977"}
