{"id":"2408.08900","title":"Towards Effective Authorship Attribution: Integrating Class-Incremental\n  Learning","authors":"Mostafa Rahgouy, Hamed Babaei Giglou, Mehnaz Tabassum, Dongji Feng,\n  Amit Das, Taher Rahgooy, Gerry Dozier, Cheryl D. Seals","authorsParsed":[["Rahgouy","Mostafa",""],["Giglou","Hamed Babaei",""],["Tabassum","Mehnaz",""],["Feng","Dongji",""],["Das","Amit",""],["Rahgooy","Taher",""],["Dozier","Gerry",""],["Seals","Cheryl D.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 04:40:09 GMT"}],"updateDate":"2024-08-20","timestamp":1723437609000,"abstract":"  AA is the process of attributing an unidentified document to its true author\nfrom a predefined group of known candidates, each possessing multiple samples.\nThe nature of AA necessitates accommodating emerging new authors, as each\nindividual must be considered unique. This uniqueness can be attributed to\nvarious factors, including their stylistic preferences, areas of expertise,\ngender, cultural background, and other personal characteristics that influence\ntheir writing. These diverse attributes contribute to the distinctiveness of\neach author, making it essential for AA systems to recognize and account for\nthese variations. However, current AA benchmarks commonly overlook this\nuniqueness and frame the problem as a closed-world classification, assuming a\nfixed number of authors throughout the system's lifespan and neglecting the\ninclusion of emerging new authors. This oversight renders the majority of\nexisting approaches ineffective for real-world applications of AA, where\ncontinuous learning is essential. These inefficiencies manifest as current\nmodels either resist learning new authors or experience catastrophic\nforgetting, where the introduction of new data causes the models to lose\npreviously acquired knowledge. To address these inefficiencies, we propose\nredefining AA as CIL, where new authors are introduced incrementally after the\ninitial training phase, allowing the system to adapt and learn continuously. To\nachieve this, we briefly examine subsequent CIL approaches introduced in other\ndomains. Moreover, we have adopted several well-known CIL methods, along with\nan examination of their strengths and weaknesses in the context of AA.\nAdditionally, we outline potential future directions for advancing CIL AA\nsystems. As a result, our paper can serve as a starting point for evolving AA\nsystems from closed-world models to continual learning through CIL paradigms.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Digital Libraries"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Q7nUhrlx0pYZ12GOTx7vh-3AekKHgc1JUBmcN-XlR-M","pdfSize":"1088052"}
