{"id":"2408.03780","title":"Feasibility of dark matter admixed neutron star based on recent\n  observational constraints","authors":"Prashant Thakur, Tuhin Malik, Arpan Das, T. K. Jha, B. K. Sharma and\n  Constan\\c{c}a Provid\\^encia","authorsParsed":[["Thakur","Prashant",""],["Malik","Tuhin",""],["Das","Arpan",""],["Jha","T. K.",""],["Sharma","B. K.",""],["Providência","Constança",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 14:07:44 GMT"}],"updateDate":"2024-08-08","timestamp":1723039664000,"abstract":"  The equation of state (EOS) for neutron stars is modeled using the\nRelativistic Mean Field (RMF) approach with a mesonic nonlinear (NL)\ninteraction, a modified sigma cut potential (NL-$\\sigma$ cut), and the\ninfluences of dark matter in the NL (NL DM). Using a Bayesian analysis\nframework, we evaluate the plausibility and impact of each scenario.\nExperimental constraints on the general properties of finite nuclei and heavy\nion collisions, along with astrophysical observational data on neutron star\nradii and tidal deformation, have been taken into account. It was shown that\nall models, including the PREX-II data, were less favored, indicating that this\nexperimental data seemed to be in tension with the other constraints included\nin the inference procedure, and were incompatible with chiral effective field\ntheoretical calculations of pure neutron matter. Considering the models with no\nPREX-II constraints, we find the model NL-$\\sigma$ cut with the largest Bayes\nevidence, indicating that the constraints considered favor the stiffening of\nthe EOS at large densities. Conversely, the neutron star with a dark matter\ncomponent is the least favorable case in light of recent observational\nconstraints, among different scenarios considered here. The $f$ and $p$ modes\nwere calculated within the Cowling approximation, and it can be seen that $f$\nmodes are sensitive to the EOS. An analysis of the slopes of the mass-radius\ncurves and $f$-mode mass curves has indicated that these quantities may help\ndistinguish the different scenarios.We also analyzed the impact of new PSR\nJ0437-4715 measurements on neutron star mass-radius estimates, noting a $\\sim$\n0.2 km reduction in the 90\\% CI upper boundary across all models and a\nsignificant Bayes evidence decrease, indicating potential conflicts with\nprevious data or the necessity for more adaptable models.\n","subjects":["Physics/Nuclear Theory","Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/"}