{"id":"2408.01337","title":"MuChoMusic: Evaluating Music Understanding in Multimodal Audio-Language\n  Models","authors":"Benno Weck, Ilaria Manco, Emmanouil Benetos, Elio Quinton, George\n  Fazekas and Dmitry Bogdanov","authorsParsed":[["Weck","Benno",""],["Manco","Ilaria",""],["Benetos","Emmanouil",""],["Quinton","Elio",""],["Fazekas","George",""],["Bogdanov","Dmitry",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 15:34:05 GMT"}],"updateDate":"2024-08-05","timestamp":1722612845000,"abstract":"  Multimodal models that jointly process audio and language hold great promise\nin audio understanding and are increasingly being adopted in the music domain.\nBy allowing users to query via text and obtain information about a given audio\ninput, these models have the potential to enable a variety of music\nunderstanding tasks via language-based interfaces. However, their evaluation\nposes considerable challenges, and it remains unclear how to effectively assess\ntheir ability to correctly interpret music-related inputs with current methods.\nMotivated by this, we introduce MuChoMusic, a benchmark for evaluating music\nunderstanding in multimodal language models focused on audio. MuChoMusic\ncomprises 1,187 multiple-choice questions, all validated by human annotators,\non 644 music tracks sourced from two publicly available music datasets, and\ncovering a wide variety of genres. Questions in the benchmark are crafted to\nassess knowledge and reasoning abilities across several dimensions that cover\nfundamental musical concepts and their relation to cultural and functional\ncontexts. Through the holistic analysis afforded by the benchmark, we evaluate\nfive open-source models and identify several pitfalls, including an\nover-reliance on the language modality, pointing to a need for better\nmultimodal integration. Data and code are open-sourced.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning","Computing Research Repository/Multimedia","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}