{"id":"2408.07594","title":"Crossover Designs in Software Engineering Experiments: Review of the\n  State of Analysis","authors":"Julian Frattini, Davide Fucci, Sira Vegas","authorsParsed":[["Frattini","Julian",""],["Fucci","Davide",""],["Vegas","Sira",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 14:49:25 GMT"}],"updateDate":"2024-08-15","timestamp":1723646965000,"abstract":"  Experimentation is an essential method for causal inference in any empirical\ndiscipline. Crossover-design experiments are common in Software Engineering\n(SE) research. In these, subjects apply more than one treatment in different\norders. This design increases the amount of obtained data and deals with\nsubject variability but introduces threats to internal validity like the\nlearning and carryover effect. Vegas et al. reviewed the state of practice for\ncrossover designs in SE research and provided guidelines on how to address its\nthreats during data analysis while still harnessing its benefits. In this\npaper, we reflect on the impact of these guidelines and review the state of\nanalysis of crossover design experiments in SE publications between 2015 and\nMarch 2024. To this end, by conducting a forward snowballing of the guidelines,\nwe survey 136 publications reporting 67 crossover-design experiments and\nevaluate their data analysis against the provided guidelines. The results show\nthat the validity of data analyses has improved compared to the original state\nof analysis. Still, despite the explicit guidelines, only 29.5% of all threats\nto validity were addressed properly. While the maturation and the optimal\nsequence threats are properly addressed in 35.8% and 38.8% of all studies in\nour sample respectively, the carryover threat is only modeled in about 3% of\nthe observed cases. The lack of adherence to the analysis guidelines threatens\nthe validity of the conclusions drawn from crossover design experiments\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oDqbdLwcvQQdThwZqF9lmLe3Yx9LY1w4h-ZfTghBEa4","pdfSize":"628711"}
