{"id":"2408.12832","title":"LIMP: Large Language Model Enhanced Intent-aware Mobility Prediction","authors":"Songwei Li, Jie Feng, Jiawei Chi, Xinyuan Hu, Xiaomeng Zhao, Fengli Xu","authorsParsed":[["Li","Songwei",""],["Feng","Jie",""],["Chi","Jiawei",""],["Hu","Xinyuan",""],["Zhao","Xiaomeng",""],["Xu","Fengli",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 04:28:56 GMT"}],"updateDate":"2024-08-26","timestamp":1724387336000,"abstract":"  Human mobility prediction is essential for applications like urban planning\nand transportation management, yet it remains challenging due to the complex,\noften implicit, intentions behind human behavior. Existing models predominantly\nfocus on spatiotemporal patterns, paying less attention to the underlying\nintentions that govern movements. Recent advancements in large language models\n(LLMs) offer a promising alternative research angle for integrating commonsense\nreasoning into mobility prediction. However, it is a non-trivial problem\nbecause LLMs are not natively built for mobility intention inference, and they\nalso face scalability issues and integration difficulties with spatiotemporal\nmodels. To address these challenges, we propose a novel LIMP (LLMs for\nIntent-ware Mobility Prediction) framework. Specifically, LIMP introduces an\n\"Analyze-Abstract-Infer\" (A2I) agentic workflow to unleash LLM's commonsense\nreasoning power for mobility intention inference. Besides, we design an\nefficient fine-tuning scheme to transfer reasoning power from commercial LLM to\nsmaller-scale, open-source language model, ensuring LIMP's scalability to\nmillions of mobility records. Moreover, we propose a transformer-based\nintention-aware mobility prediction model to effectively harness the intention\ninference ability of LLM. Evaluated on two real-world datasets, LIMP\nsignificantly outperforms baseline models, demonstrating improved accuracy in\nnext-location prediction and effective intention inference. The\ninterpretability of intention-aware mobility prediction highlights our LIMP\nframework's potential for real-world applications. Codes and data can be found\nin https://github.com/tsinghua-fib-lab/LIMP .\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}