{"id":"2408.16625","title":"MultiMediate'24: Multi-Domain Engagement Estimation","authors":"Philipp M\\\"uller, Michal Balazia, Tobias Baur, Michael Dietz,\n  Alexander Heimerl, Anna Penzkofer, Dominik Schiller, Fran\\c{c}ois Br\\'emond,\n  Jan Alexandersson, Elisabeth Andr\\'e, Andreas Bulling","authorsParsed":[["Müller","Philipp",""],["Balazia","Michal",""],["Baur","Tobias",""],["Dietz","Michael",""],["Heimerl","Alexander",""],["Penzkofer","Anna",""],["Schiller","Dominik",""],["Brémond","François",""],["Alexandersson","Jan",""],["André","Elisabeth",""],["Bulling","Andreas",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 15:34:25 GMT"}],"updateDate":"2024-08-30","timestamp":1724945665000,"abstract":"  Estimating the momentary level of participant's engagement is an important\nprerequisite for assistive systems that support human interactions. Previous\nwork has addressed this task in within-domain evaluation scenarios, i.e.\ntraining and testing on the same dataset. This is in contrast to real-life\nscenarios where domain shifts between training and testing data frequently\noccur. With MultiMediate'24, we present the first challenge addressing\nmulti-domain engagement estimation. As training data, we utilise the NOXI\ndatabase of dyadic novice-expert interactions. In addition to within-domain\ntest data, we add two new test domains. First, we introduce recordings\nfollowing the NOXI protocol but covering languages that are not present in the\nNOXI training data. Second, we collected novel engagement annotations on the\nMPIIGroupInteraction dataset which consists of group discussions between three\nto four people. In this way, MultiMediate'24 evaluates the ability of\napproaches to generalise across factors such as language and cultural\nbackground, group size, task, and screen-mediated vs. face-to-face interaction.\nThis paper describes the MultiMediate'24 challenge and presents baseline\nresults. In addition, we discuss selected challenge solutions.\n","subjects":["Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}