{"id":"2408.06442","title":"Lessons from Hubble and Spitzer: 1D Self-Consistent Model Grids for 19\n  Hot Jupiter Emission Spectra","authors":"Lindsey S. Wiser, Michael R. Line, Luis Welbanks, Megan Mansfield,\n  Vivien Parmentier, Jacob L. Bean, Jonathan J. Fortney","authorsParsed":[["Wiser","Lindsey S.",""],["Line","Michael R.",""],["Welbanks","Luis",""],["Mansfield","Megan",""],["Parmentier","Vivien",""],["Bean","Jacob L.",""],["Fortney","Jonathan J.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 18:44:47 GMT"}],"updateDate":"2024-08-14","timestamp":1723488287000,"abstract":"  We present a population-level analysis of the dayside thermal emission\nspectra of 19 planets observed with Hubble WFC3 and Spitzer IRAC 3.6 and 4.5\nmicrons, spanning equilibrium temperatures 1200-2700 K and 0.7-10.5 Jupiter\nmasses. We use grids of planet-specific 1D, cloud-free,\nradiative-convective-thermochemical equilibrium models (1D-RCTE) combined with\na Bayesian inference framework to estimate atmospheric metallicity, the\ncarbon-to-oxygen ratio, and day-to-night heat redistribution. In general, we\nfind that the secondary eclipse data cannot reject the physics encapsulated\nwithin the 1D-RCTE assumption parameterized with these three variables. We find\na large degree of scatter in atmospheric metallicities, with no apparent trend,\nand carbon-to-oxygen ratios that are mainly consistent with solar or subsolar\nvalues but do not exhibit population agreement. Together, these indicate either\n(1) formation pathways vary over the hot and ultra-hot Jupiter population\nand/or (2) more accurate composition measurements are needed to identify\ntrends. We also find a broad scatter in derived dayside temperatures that do\nnot demonstrate a trend with equilibrium temperature. Like with composition\nestimates, this suggests either significant variability in climate drivers over\nthe population and/or more precise dayside temperature measurements are needed\nto identify a trend. We anticipate that 1D-RCTE models will continue to provide\nvaluable insights into the nature of exoplanet atmospheres in the era of JWST.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QpebBpv0t_pvyZo35P6guEVIUOyVvjhCnE9FWAIydBA","pdfSize":"2081225"}
