{"id":"2408.15311","title":"Climate change denial and anti-science communities on brazilian\n  Telegram: climate disinformation as a gateway to broader conspiracy networks","authors":"Ergon Cugler de Moraes Silva","authorsParsed":[["Silva","Ergon Cugler de Moraes",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 17:14:27 GMT"},{"version":"v2","created":"Sat, 31 Aug 2024 02:12:19 GMT"}],"updateDate":"2024-09-04","timestamp":1724778867000,"abstract":"  Conspiracy theories related to climate change denial and anti-science have\nfound fertile ground on Telegram, particularly among Brazilian communities that\ndistrust scientific institutions and oppose global environmental policies. This\nstudy seeks to answer the research question: how are Brazilian conspiracy\ntheory communities on climate change and anti-science themes characterized and\narticulated on Telegram? It is worth noting that this study is part of a series\nof seven studies aimed at understanding and characterizing Brazilian conspiracy\ntheory communities on Telegram. This series of studies is openly and originally\navailable on arXiv from Cornell University, applying a mirrored method across\nall seven studies, changing only the thematic focus of analysis, and providing\nreplicable investigation methods, including custom-developed and proprietary\ncodes, contributing to the culture of open-source software. Regarding the main\nfindings of this study, the following observations were made: Climate change\ndenial and anti-science communities interact synergistically, creating a\ncomplex network that mutually reinforces disinformation narratives; Apocalyptic\nthemes, such as Apocalypse and Survivalism, act as gateways to climate denial,\nwith 5,057 links directed to these communities; Anti-science communities\nfunction as gatekeepers, distributing links evenly to theories such as the New\nWorld Order and Globalism, among others; During the COVID-19 pandemic,\nanti-science discussions experienced a significant peak, driven by vaccine\ndisinformation; The intersection between anti-science narratives and esoteric\nbeliefs reinforces the idea of a supposed alternative truth that challenges\nscience; Since 2022, discussions on climate change have evolved to align with\nglobal domination theories; Additionally, the UN's 2030 Agenda is portrayed as\npart of a global conspiracy.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KzRevzyST7PmsNCymEzAf_NkTLdfi-DmS6hy_9wlbB4","pdfSize":"9723692"}
