{"id":"2408.15023","title":"Understanding kinetic interactions between NOx and C2-C5 alkanes and\n  alkenes: The rate rules and influences of H-atom abstractions by NO2","authors":"Hongqing Wu, Ruoyue Tang, Xinrui Ren, Mingrui Wang, Guojie Liang,\n  Haolong Li, Song Cheng","authorsParsed":[["Wu","Hongqing",""],["Tang","Ruoyue",""],["Ren","Xinrui",""],["Wang","Mingrui",""],["Liang","Guojie",""],["Li","Haolong",""],["Cheng","Song",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 12:55:08 GMT"}],"updateDate":"2024-08-28","timestamp":1724763308000,"abstract":"  This study aims to reveal the important role and the respective rate rules of\nH atom abstractions by NO2 for better understanding NOX hydrocarbon\ninteractions. To this end, H atom abstractions from C2 to C5 alkanes and\nalkenes 15 species by NO2, leading to the formation of three HNO2 isomers\n(TRANS HONO, HNO2, and CIS HONO) and their respective products 45 reactions,\nare first characterized through high-level quantum chemistry computation, where\nelectronic structures, single point energies, C H bond dissociation energies\nand 1 D hindered rotor potentials are determined at DLPNO CCSD T cc pVDZ M06 2X\n6 311 plus plus g(d,p). The rate coefficients for all studied reactions, over a\ntemperature range from 298.15 to 2000 K, are computed using Transition State\nTheory with the Master Equation System Solver program. Comprehensive analysis\nof branching ratios elucidates the diversity and similarities between different\nspecies, HNO2 isomers, and abstraction site, from which accurate rate rules are\ndetermined. Incorporating the updated rate parameters into a detailed chemical\nkinetic model reveals the significant influences of this type of reaction on\nmodel prediction results, where the simulated ignition delay times are either\nprolonged or reduced, depending on the original rate parameters presented in\nthe selected model. Sensitivity and flux analysis further highlight the\ncritical role of this type of reaction in affecting system reactivity and\nreaction pathways, emphasizing the need for adequately representing these\nkinetics in existing chemistry models. This can now be sufficiently achieved\nfor alkanes and alkenes through the results from this study.\n","subjects":["Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}