{"id":"2408.08038","title":"PI-Att: Topology Attention for Segmentation Networks through Adaptive\n  Persistence Image Representation","authors":"Mehmet Bahadir Erden, Sinan Unver, Ilke Ali Gurses, Rustu Turkay,\n  Cigdem Gunduz-Demir","authorsParsed":[["Erden","Mehmet Bahadir",""],["Unver","Sinan",""],["Gurses","Ilke Ali",""],["Turkay","Rustu",""],["Gunduz-Demir","Cigdem",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 09:06:49 GMT"}],"updateDate":"2024-08-16","timestamp":1723712809000,"abstract":"  Segmenting multiple objects (e.g., organs) in medical images often requires\nan understanding of their topology, which simultaneously quantifies the shape\nof the objects and their positions relative to each other. This understanding\nis important for segmentation networks to generalize better with limited\ntraining data, which is common in medical image analysis. However, many popular\nnetworks were trained to optimize only pixel-wise performance, ignoring the\ntopological correctness of the segmentation. In this paper, we introduce a new\ntopology-aware loss function, which we call PI-Att, that explicitly forces the\nnetwork to minimize the topological dissimilarity between the ground truth and\nprediction maps. We quantify the topology of each map by the persistence image\nrepresentation, for the first time in the context of a segmentation network\nloss. Besides, we propose a new mechanism to adaptively calculate the\npersistence image at the end of each epoch based on the network's performance.\nThis adaptive calculation enables the network to learn topology outline in the\nfirst epochs, and then topology details towards the end of training. The\neffectiveness of the proposed PI-Att loss is demonstrated on two different\ndatasets for aorta and great vessel segmentation in computed tomography images.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}