{"id":"2408.07027","title":"Multi-soliton solutions and data-driven discovery of higher-order\n  Burgers' hierarchy equations with physics informed neural networks","authors":"D. A. Kaltsas, L. Magafas, P. Papadopoulou, G. N. Throumoulopoulos","authorsParsed":[["Kaltsas","D. A.",""],["Magafas","L.",""],["Papadopoulou","P.",""],["Throumoulopoulos","G. N.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 16:44:48 GMT"}],"updateDate":"2024-08-14","timestamp":1723567488000,"abstract":"  The Burgers hierarchy consists of nonlinear evolutionary PDEs with\nincreasingly higher-order dispersive and nonlinear terms, resulting in a rich\nvariety of soliton solutions. Notable members include the Burgers equation and\nthe Sharma-Tasso-Olver equation, which are applied in plasma physics, fluid\nmechanics, optics, and biophysics to describe nonlinear waves in inhomogeneous\nmedia. Various soliton and multi-soliton solutions have been identified, and\nthe fission and fusion of solitons have been explored through analytical and\nnumerical techniques. Recently, deep learning methods, particularly Physics\nInformed Neural Networks (PINNs), have emerged as powerful tools for solving\nPDEs. These methods use deep neural networks to minimize PDE residuals and\nsatisfy boundary and initial conditions while fitting relevant data. Although\nPINNs have been applied to equations like Burgers' and Korteweg-de Vries,\nhigher-order members of the Burgers hierarchy remain unexplored. In this study,\nwe employ a PINN algorithm to approximate multi-soliton solutions of linear\ncombinations of equations within the Burgers hierarchy. This semi-supervised\napproach encodes the PDE and relevant data, determining PDE parameters and\nresolving the linear combination to discover the PDE that best describes the\ndata. Additionally, we employ gradient-enhanced PINNs (gPINNs) and a\nconservation law specific to the generic Burgers' hierarchy to improve training\naccuracy. The results demonstrate the effectiveness of PINNs in describing\nmulti-soliton solutions within the generic Burgers' hierarchy. They also verify\nthe potential for training refinement and accuracy improvement using enhanced\napproaches in certain cases, while enabling the inference of the PDE model that\nbest describes the observed solitary structures.\n","subjects":["Physics/Computational Physics","Nonlinear Sciences/Pattern Formation and Solitons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}