{"id":"2408.03133","title":"Study of the high-mass star-forming region S255IR at various scales","authors":"I. I. Zinchenko (1), S.-Y. Liu (2), D. K. Ojha (3), Y.-N. Su (2), P.\n  M. Zemlyanukha (1)((1) Institute of Applied Physics of the Russian Academy of\n  Sciences, (2) Institute of Astronomy and Astrophysics, Academia Sinica,\n  Taiwan, (3) Tata Institute of Fundamental Research, Mumbai, India)","authorsParsed":[["Zinchenko","I. I.",""],["Liu","S. -Y.",""],["Ojha","D. K.",""],["Su","Y. -N.",""],["Zemlyanukha","P. M.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 12:20:34 GMT"}],"updateDate":"2024-08-07","timestamp":1722946834000,"abstract":"  The S255IR-SMA1 core contains the protostar NIRS3 with a mass of $\\sim$20\nM$_\\odot$. Several years ago, the first burst of luminosity for massive\nprotostars, caused by an episodic accretion event, was recorded here. We have\nbeen studying this object for a long time using various instruments, including\nALMA. The general morphology and kinematics of this area have been\ninvestigated. Disk-shaped structures, jets and outflows have been identified\nand studied in detail. We recently observed this object with ALMA with a\nresolution an order of magnitude higher than previously achieved - about 15\nmilliarcseconds, which corresponds to about 25 AU. This paper presents new\nresults from the analysis of these data together with observations in other\nbands. The new data show an inhomogeneous disk structure, an ionized region\naround the protostar, and the presence of a jet observed in the submillimeter\ncontinuum, consisting of individual knots, the orientation of which differs\nmarkedly from that on large scales. The submillimeter emission from the jet\nmost likely represents bremsstrahlung from ionized gas. Based on observations\nof the lines of some molecules, the kinematics and physical characteristics of\nthis region are discussed. Methanol maser emission associated with the jet is\nobserved.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}