{"id":"2408.09115","title":"GoodSAM++: Bridging Domain and Capacity Gaps via Segment Anything Model\n  for Panoramic Semantic Segmentation","authors":"Weiming Zhang, Yexin Liu, Xu Zheng, Lin Wang","authorsParsed":[["Zhang","Weiming",""],["Liu","Yexin",""],["Zheng","Xu",""],["Wang","Lin",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 06:53:10 GMT"}],"updateDate":"2024-08-20","timestamp":1723877590000,"abstract":"  This paper presents GoodSAM++, a novel framework utilizing the powerful\nzero-shot instance segmentation capability of SAM (i.e., teacher) to learn a\ncompact panoramic semantic segmentation model, i.e., student, without requiring\nany labeled data. GoodSAM++ addresses two critical challenges: 1) SAM's\ninability to provide semantic labels and inherent distortion problems of\npanoramic images; 2) the significant capacity disparity between SAM and the\nstudent. The `out-of-the-box' insight of GoodSAM++ is to introduce a teacher\nassistant (TA) to provide semantic information for SAM, integrated with SAM to\nobtain reliable pseudo semantic maps to bridge both domain and capacity gaps.\nTo make this possible, we first propose a Distortion-Aware Rectification\n(DARv2) module to address the domain gap. It effectively mitigates the object\ndeformation and distortion problem in panoramic images to obtain pseudo\nsemantic maps. We then introduce a Multi-level Knowledge Adaptation (MKA)\nmodule to efficiently transfer the semantic information from the TA and pseudo\nsemantic maps to our compact student model, addressing the significant capacity\ngap. We conduct extensive experiments on both outdoor and indoor benchmark\ndatasets, showing that our GoodSAM++ achieves a remarkable performance\nimprovement over the state-of-the-art (SOTA) domain adaptation methods.\nMoreover, diverse open-world scenarios demonstrate the generalization capacity\nof our GoodSAM++. Last but not least, our most lightweight student model\nachieves comparable performance to the SOTA models with only 3.7 million\nparameters.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}