{"id":"2408.09724","title":"Isotropic and Anisotropic Radiating Gravastars with Various Matter Types\n  of Thin Shell and Interior","authors":"Hasan Al-Asy'ari, Fiki Taufik Akbar, Bobby Eka Gunara","authorsParsed":[["Al-Asy'ari","Hasan",""],["Akbar","Fiki Taufik",""],["Gunara","Bobby Eka",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 06:24:15 GMT"}],"updateDate":"2024-08-20","timestamp":1724048655000,"abstract":"  In this paper, we investigate models of radiating gravastars with both\nisotropic and anisotropic interiors, incorporating various types of thin shell\nmatter. For the isotropic interior case, we consider a thin spherical shell\ncharacterized by an equation of state in which its pressure is proportional to\nits mass density, enclosing a de Sitter spacetime and surrounded by Vaidya\nexterior spacetime. Our analysis reveals that stable gravastars can form under\nspecific scenarios of radiative mechanisms and for certain thin shell matter\ntypes. In addition, we also show and discuss in brief the possibility of\nexistence of stable radiating anti-de Sitter gravastar formation. For the\nanisotropic interior, we use an anisotropic dark energy model with a\nTolman-Matese-Whitman (TMW) mass function. We explore several thin shell matter\ntypes: standard, dark energy, and repulsive phantom. Our findings indicate that\nstable gravastars can also emerge in this context, particularly with standard\nand repulsive phantom thin shells. Furthermore, our results suggest that the\ndensity of black holes is consistently higher than that of gravastars and\nnormal stars, regardless of the type of matter in the thin shell. This\nobservation supports the notion that gravastars and black holes are distinct\nentities, reinforcing the theoretical distinction between these two types of\ncompact objects.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TvDq1xQf0A5kiwnnmzIiT84jzTKyDUX3a45O__K4avE","pdfSize":"961237"}
