{"id":"2408.05002","title":"An Empirical Study on Challenges for LLM Developers","authors":"Xiang Chen, Chaoyang Gao, Chunyang Chen, Guangbei Zhang, Yong Liu","authorsParsed":[["Chen","Xiang",""],["Gao","Chaoyang",""],["Chen","Chunyang",""],["Zhang","Guangbei",""],["Liu","Yong",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 05:46:28 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 01:48:42 GMT"}],"updateDate":"2024-08-13","timestamp":1722923188000,"abstract":"  In recent years, large language models (LLMs) have seen rapid advancements,\nsignificantly impacting various fields such as natural language processing, and\nsoftware engineering. These LLMs, exemplified by OpenAI's ChatGPT, have\nrevolutionized the way we approach language understanding and generation tasks.\nHowever, in contrast to traditional software development practices, LLM\ndevelopment introduces new challenges for AI developers in design,\nimplementation, and deployment. These challenges span different areas (such as\nprompts, APIs, and plugins), requiring developers to navigate unique\nmethodologies and considerations specific to LLM development.\n  Despite the profound influence of LLMs, to the best of our knowledge, these\nchallenges have not been thoroughly investigated in previous empirical studies.\nTo fill this gap, we present the first comprehensive study on understanding the\nchallenges faced by LLM developers. Specifically, we crawl and analyze 29,057\nrelevant questions from a popular OpenAI developer forum. We first examine\ntheir popularity and difficulty. After manually analyzing 2,364 sampled\nquestions, we construct a taxonomy of challenges faced by LLM developers. Based\non this taxonomy, we summarize a set of findings and actionable implications\nfor LLM-related stakeholders, including developers and providers (especially\nthe OpenAI organization).\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}