{"id":"2408.01747","title":"Classical Machine Learning: Seventy Years of Algorithmic Learning\n  Evolution","authors":"Absalom E. Ezugwu, Yuh-Shan Ho, Ojonukpe S. Egwuche, Olufisayo S.\n  Ekundayo, Annette Van Der Merwe, Apu K. Saha, Jayanta Pal","authorsParsed":[["Ezugwu","Absalom E.",""],["Ho","Yuh-Shan",""],["Egwuche","Ojonukpe S.",""],["Ekundayo","Olufisayo S.",""],["Van Der Merwe","Annette",""],["Saha","Apu K.",""],["Pal","Jayanta",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 11:07:10 GMT"},{"version":"v2","created":"Mon, 19 Aug 2024 17:31:07 GMT"}],"updateDate":"2024-08-20","timestamp":1722683230000,"abstract":"  Machine learning (ML) has transformed numerous fields, but understanding its\nfoundational research is crucial for its continued progress. This paper\npresents an overview of the significant classical ML algorithms and examines\nthe state-of-the-art publications spanning twelve decades through an extensive\nbibliometric analysis study. We analyzed a dataset of highly cited papers from\nprominent ML conferences and journals, employing citation and keyword analyses\nto uncover critical insights. The study further identifies the most influential\npapers and authors, reveals the evolving collaborative networks within the ML\ncommunity, and pinpoints prevailing research themes and emerging focus areas.\nAdditionally, we examine the geographic distribution of highly cited\npublications, highlighting the leading countries in ML research. This study\nprovides a comprehensive overview of the evolution of traditional learning\nalgorithms and their impacts. It discusses challenges and opportunities for\nfuture development, focusing on the Global South. The findings from this paper\noffer valuable insights for both ML experts and the broader research community,\nenhancing understanding of the field's trajectory and its significant influence\non recent advances in learning algorithms.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Rl73FsadmU57l7AQ4WcFdA_S6gnAUhVcjDIHzpRjrmw","pdfSize":"1631065"}
