{"id":"2408.00195","title":"Engineering Rydberg-pair interactions in divalent atoms with\n  hyperfine-split ionization thresholds","authors":"Frederic Hummel and Sebastian Weber and Johannes Moegerle and Henri\n  Menke and Jonathan King and Benjamin Bloom and Sebastian Hofferberth and Ming\n  Li","authorsParsed":[["Hummel","Frederic",""],["Weber","Sebastian",""],["Moegerle","Johannes",""],["Menke","Henri",""],["King","Jonathan",""],["Bloom","Benjamin",""],["Hofferberth","Sebastian",""],["Li","Ming",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 23:24:58 GMT"}],"updateDate":"2024-08-02","timestamp":1722468298000,"abstract":"  Quantum information processing with neutral atoms relies on Rydberg\nexcitation for entanglement generation. While the use of heavy divalent or\nopen-shell elements, such as strontium or ytterbium, has benefits due to their\noptically active core and a variety of possible qubit encodings, their Rydberg\nstructure is generally complex. For some isotopes in particular, hyperfine\ninteractions are relevant even for highly excited electronic states. We employ\nmulti-channel quantum defect theory to infer the Rydberg structure of isotopes\nwith non-zero nuclear spin and perform non-perturbative Rydberg-pair\ninteraction calculations. We find that due to the high level density and\nsensitivities to external fields, experimental parameters must be precisely\ncontrolled. Specifically in ${}^{87}$Sr, we study an intrinsic F\\\"orster\nresonance, unique to divalent atoms with hyperfine-split thresholds, which\nsimultaneously provides line stability with respect to external field\nfluctuations and enhanced long-range interactions. Additionally, we provide\nparameters for pair states that can be effectively described by single-channel\nRydberg series. The explored pair states provide exciting opportunities for\napplications in the blockade regime as well as for more exotic long-range\ninteractions such as largely flat, distance-independent potentials.\n","subjects":["Physics/Atomic Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}