{"id":"2408.02649","title":"Analysis of the Stellar Occultations During the Unprecedented\n  Long-Duration Flare","authors":"Kamil Bicz, Robert Falewicz, Petr Heinzel, Ma{\\l}gorzata Pietras, and\n  Pawe{\\l} Pre\\'s","authorsParsed":[["Bicz","Kamil",""],["Falewicz","Robert",""],["Heinzel","Petr",""],["Pietras","Małgorzata",""],["Preś","Paweł",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 17:25:54 GMT"}],"updateDate":"2024-08-06","timestamp":1722878754000,"abstract":"  In strong stellar and solar flares flare loops typically appear during the\ndecay phase, providing an additional contribution to the flare emission and,\npossibly, obscuring the flare emission. Super-flares, common in active, cool\nstars, persist mostly from minutes to several hours and alter the star's\nluminosity across the electromagnetic spectrum. Recent observations of a young\nmain-sequence star reveal a distinctive cool loop arcade forming above the\nflaring region during a 27-hour superflare event, obscuring the region multiple\ntimes. Analysis of these occultations enables the estimation of the arcade's\ngeometry and physical properties. The arcade's size expanded from 0.213 to\n0.391 R$_*$ at a speed of approximately 3.5$\\,$km/s. The covering structure\nexhibited a thickness below 12$\\,$200$\\,$km, with electron densities ranging\nfrom 10$^{13}$ to 10$^{14}\\,$cm$^{-3}$ and temperatures below 7$\\,$600$\\,$K,\n6$\\,$400$\\,$K, and 5$\\,$077$\\,$K for successive occultations. Additionally, the\nflare's maximum emission temperature has to exceed 12$\\,$000$\\,$K for the\noccultations to appear. Comparing these parameters with known values from other\nstars and the Sun suggests the structure's nature as an arcade of cool flare\nloops. For the first time, we present the physical parameters and the\nreconstructed geometry of the cool flare loops that obscure the flaring region\nduring the gradual phase of a long-duration flare on a star other than the Sun.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}