{"id":"2408.04827","title":"Towards Intelligent Cooperative Robotics in Additive Manufacturing:\n  Past, Present and Future","authors":"Sean Rescsanski, Rainer Hebert, Azadeh Haghighi, Jiong Tang and Farhad\n  Imani","authorsParsed":[["Rescsanski","Sean",""],["Hebert","Rainer",""],["Haghighi","Azadeh",""],["Tang","Jiong",""],["Imani","Farhad",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 02:55:39 GMT"}],"updateDate":"2024-08-12","timestamp":1723172139000,"abstract":"  Additive manufacturing (AM) technologies have undergone significant\nadvancements through the integration of cooperative robotics additive\nmanufacturing (C-RAM) platforms. By deploying AM processes on the end effectors\nof multiple robotic arms, not only are traditional constraints such as limited\nbuild volumes circumvented, but systems also achieve accelerated fabrication\nspeeds, cooperative sensing capabilities, and in-situ multi-material\ndeposition. Despite advancements, challenges remain, particularly regarding\ndefect generation including voids, cracks, and residual stress. Various factors\ncontribute to these issues, including toolpath planning (i.e., slicing\nstrategies), part decomposition for cooperative printing, and motion planning\n(i.e., path and trajectory planning). This review first examines the critical\naspects of system control for C-RAM systems comprised of slicing and motion\nplanning. The methods for the mitigation of defects through the adjustment of\nthese aspects and the process parameters of AM methods are then described in\nthe context of how they modify the AM process: pre-process, inter-layer (i.e.,\nduring layer pauses), and mid-layer (i.e., during material deposition). The\napplication of advanced sensing technologies, including high-resolution\ncameras, laser scanners, and thermal imaging, to facilitate the capture of\nmicro, meso, and macro-scale defects is explored. The role of digital twins is\nanalyzed, emphasizing their capability to simulate and predict manufacturing\noutcomes, enabling preemptive adjustments to prevent defects. Finally, the\noutlook and future opportunities for developing next-generation C-RAM systems\nare outlined.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}