{"id":"2408.11060","title":"Dynamic Code Orchestration: Harnessing the Power of Large Language\n  Models for Adaptive Script Execution","authors":"Justin Del Vecchio, Andrew Perreault, Eliana Furmanek","authorsParsed":[["Del Vecchio","Justin",""],["Perreault","Andrew",""],["Furmanek","Eliana",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 17:11:31 GMT"}],"updateDate":"2024-08-22","timestamp":1723050691000,"abstract":"  Computer programming initially required humans to directly translate their\ngoals into machine code. These goals could have easily been expressed as a\nwritten (or human) language directive. Computers, however, had no capacity to\nsatisfactorily interpret written language. Large language model's provide\nexactly this capability; automatic generation of computer programs or even\nassembly code from written language directives. This research examines dynamic\ncode execution of written language directives within the context of a running\napplication. It implements a text editor whose business logic is purely backed\nby large language model prompts. That is, the program's execution uses prompts\nand written language directives to dynamically generate application logic at\nthe point in time it is needed. The research clearly shows how written language\ndirectives, backed by a large language model, offer radically new programming\nand operating system paradigms. For example, empowerment of users to directly\nimplement requirements via written language directives, thus supplanting the\nneed for a team ofprogrammers, a release schedule and the like. Or, new\nsecurity mechanisms where static executables, always a target for reverse\nengineering or fuzzing, no longer exist. They are replaced by ephemeral\nexecutables that may continually change, be completely removed, and are easily\nupdated.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NhEk2jLQTuJpxmhcxc-5EYwS6_s5lDbNum9Q2cZmo04","pdfSize":"555360"}
