{"id":"2408.06870","title":"Spectrum Prediction With Deep 3D Pyramid Vision Transformer Learning","authors":"Guangliang Pan, Qihui Wu, Bo Zhou, Jie Li, Wei Wang, Guoru Ding, David\n  K. Y. Yau","authorsParsed":[["Pan","Guangliang",""],["Wu","Qihui",""],["Zhou","Bo",""],["Li","Jie",""],["Wang","Wei",""],["Ding","Guoru",""],["Yau","David K. Y.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 13:09:11 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 06:02:59 GMT"},{"version":"v3","created":"Tue, 20 Aug 2024 08:07:40 GMT"}],"updateDate":"2024-08-21","timestamp":1723554551000,"abstract":"  In this paper, we propose a deep learning (DL)-based task-driven spectrum\nprediction framework, named DeepSPred. The DeepSPred comprises a feature\nencoder and a task predictor, where the encoder extracts spectrum usage pattern\nfeatures, and the predictor configures different networks according to the task\nrequirements to predict future spectrum. Based on the Deep- SPred, we first\npropose a novel 3D spectrum prediction method combining a flow processing\nstrategy with 3D vision Transformer (ViT, i.e., Swin) and a pyramid to serve\npossible applications such as spectrum monitoring task, named 3D-SwinSTB.\n3D-SwinSTB unique 3D Patch Merging ViT-to-3D ViT Patch Expanding and pyramid\ndesigns help the model accurately learn the potential correlation of the\nevolution of the spectrogram over time. Then, we propose a novel spectrum\noccupancy rate (SOR) method by redesigning a predictor consisting exclusively\nof 3D convolutional and linear layers to serve possible applications such as\ndynamic spectrum access (DSA) task, named 3D-SwinLinear. Unlike the 3D-SwinSTB\noutput spectrogram, 3D-SwinLinear projects the spectrogram directly as the SOR.\nFinally, we employ transfer learning (TL) to ensure the applicability of our\ntwo methods to diverse spectrum services. The results show that our 3D-SwinSTB\noutperforms recent benchmarks by more than 5%, while our 3D-SwinLinear achieves\na 90% accuracy, with a performance improvement exceeding 10%.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}