{"id":"2408.10966","title":"ISLES'24: Improving final infarct prediction in ischemic stroke using\n  multimodal imaging and clinical data","authors":"Ezequiel de la Rosa, Ruisheng Su, Mauricio Reyes, Roland Wiest,\n  Evamaria O. Riedel, Florian Kofler, Kaiyuan Yang, Hakim Baazaoui, David\n  Robben, Susanne Wegener, Jan S. Kirschke, Benedikt Wiestler, Bjoern Menze","authorsParsed":[["de la Rosa","Ezequiel",""],["Su","Ruisheng",""],["Reyes","Mauricio",""],["Wiest","Roland",""],["Riedel","Evamaria O.",""],["Kofler","Florian",""],["Yang","Kaiyuan",""],["Baazaoui","Hakim",""],["Robben","David",""],["Wegener","Susanne",""],["Kirschke","Jan S.",""],["Wiestler","Benedikt",""],["Menze","Bjoern",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 16:01:05 GMT"}],"updateDate":"2024-08-21","timestamp":1724169665000,"abstract":"  Accurate estimation of core (irreversibly damaged tissue) and penumbra\n(salvageable tissue) volumes is essential for ischemic stroke treatment\ndecisions. Perfusion CT, the clinical standard, estimates these volumes but is\naffected by variations in deconvolution algorithms, implementations, and\nthresholds. Core tissue expands over time, with growth rates influenced by\nthrombus location, collateral circulation, and inherent patient-specific\nfactors. Understanding this tissue growth is crucial for determining the need\nto transfer patients to comprehensive stroke centers, predicting the benefits\nof additional reperfusion attempts during mechanical thrombectomy, and\nforecasting final clinical outcomes. This work presents the ISLES'24 challenge,\nwhich addresses final post-treatment stroke infarct prediction from\npre-interventional acute stroke imaging and clinical data. ISLES'24 establishes\na unique 360-degree setting where all feasibly accessible clinical data are\navailable for participants, including full CT acute stroke imaging, sub-acute\nfollow-up MRI, and clinical tabular data. The contributions of this work are\ntwo-fold: first, we introduce a standardized benchmarking of final stroke\ninfarct segmentation algorithms through the ISLES'24 challenge; second, we\nprovide insights into infarct segmentation using multimodal imaging and\nclinical data strategies by identifying outperforming methods on a finely\ncurated dataset. The outputs of this challenge are anticipated to enhance\nclinical decision-making and improve patient outcome predictions. All ISLES'24\nmaterials, including data, performance evaluation scripts, and leading\nalgorithmic strategies, are available to the research community following\n\\url{https://isles-24.grand-challenge.org/}.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}