{"id":"2408.10358","title":"The All-Sky Impact of the LMC on the Milky Way Circumgalactic Medium","authors":"Christopher Carr, Greg L. Bryan, Nicol\\'as Garavito-Camargo, Gurtina\n  Besla, David J. Setton, Kathryn V. Johnston","authorsParsed":[["Carr","Christopher",""],["Bryan","Greg L.",""],["Garavito-Camargo","Nicolás",""],["Besla","Gurtina",""],["Setton","David J.",""],["Johnston","Kathryn V.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:56:15 GMT"}],"updateDate":"2024-08-21","timestamp":1724093775000,"abstract":"  The first infall of the LMC into the Milky Way (MW) represents a large and\nrecent disruption to the MW circumgalactic medium (CGM). In this work, we use\nidealized, hydrodynamical simulations of a MW-like CGM embedded in a live dark\nmatter halo with an infalling LMC-like satellite initialized with its own CGM\nto understand how the encounter is shaping the global physical and kinematic\nproperties of the MW CGM. First, we find that the LMC sources order-unity\nenhancements in MW CGM density, temperature, and pressure from a $\\mathcal{M}\n\\approx 2$ shock from the supersonic CGM-CGM collision, extending from the LMC\nto beyond $\\sim R_{\\rm 200, MW}$, enhancing column densities, X-ray brightness,\nthe thermal Sunyaev-Zeldovich (tSZ) distortion, and potentially synchrotron\nemission from cosmic rays over large angular scales across the Southern\nHemisphere. Second, the MW's reflex motion relative to its outer halo produces\na dipole in CGM radial velocities, with $v_{\\rm R} \\pm 30-50$ km/s at $R > 50$\nkpc in the Northern/Southern hemispheres respectively, consistent with\nmeasurements in the stellar halo. Finally, ram pressure strips most of the LMC\nCGM gas by the present day, leaving $\\sim 10^{8-9} M_{\\odot}$ of warm, ionized\ngas along the past orbit of the LMC moving at high radial and/or tangential\nvelocities $\\sim 50-100$ kpc from the MW. Massive satellites like the LMC leave\ntheir mark on the CGM structure of their host galaxies, and signatures from\nthis interaction may manifest in key all-sky observables of the CGM of the MW\nand other massive galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}