{"id":"2408.14460","title":"Cloud-Based Federation Framework and Prototype for Open, Scalable, and\n  Shared Access to NextG and IoT Testbeds","authors":"Maxwell McManus and Tenzin Rinchen and Annoy Dey and Sumanth Thota and\n  Zhaoxi Zhang and Jiangqi Hu and Xi Wang and Mingyue Ji and Nicholas\n  Mastronarde and Elizabeth Serena Bentley and Michael Medley and Zhangyu Guan","authorsParsed":[["McManus","Maxwell",""],["Rinchen","Tenzin",""],["Dey","Annoy",""],["Thota","Sumanth",""],["Zhang","Zhaoxi",""],["Hu","Jiangqi",""],["Wang","Xi",""],["Ji","Mingyue",""],["Mastronarde","Nicholas",""],["Bentley","Elizabeth Serena",""],["Medley","Michael",""],["Guan","Zhangyu",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 17:49:55 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 14:07:13 GMT"}],"updateDate":"2024-08-29","timestamp":1724694595000,"abstract":"  In this work, we present a new federation framework for UnionLabs, an\ninnovative cloud-based resource-sharing infrastructure designed for\nnext-generation (NextG) and Internet of Things (IoT) over-the-air (OTA)\nexperiments. The framework aims to reduce the federation complexity for\ntestbeds developers by automating tedious backend operations, thereby providing\nscalable federation and remote access to various wireless testbeds. We first\ndescribe the key components of the new federation framework, including the\nSystems Manager Integration Engine (SMIE), the Automated Script Generator\n(ASG), and the Database Context Manager (DCM). We then prototype and deploy the\nnew Federation Plane on the Amazon Web Services (AWS) public cloud,\ndemonstrating its effectiveness by federating two wireless testbeds: i) UB\nNeXT, a 5G-and-beyond (5G+) testbed at the University at Buffalo, and ii) UT\nIoT, an IoT testbed at the University of Utah. Through this work we aim to\ninitiate a grassroots campaign to democratize access to wireless research\ntestbeds with heterogeneous hardware resources and network environment, and\naccelerate the establishment of a mature, open experimental ecosystem for the\nwireless community. The API of the new Federation Plane will be released to the\ncommunity after internal testing is completed.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}