{"id":"2408.12227","title":"Hanle effect for lifetime determinations in the soft X-ray regime","authors":"Moto Togawa, Jan Richter, Chintan Shah, Marc Botz, Joshua Nenninger,\n  Jonas Danisch, Joschka Goes, Steffen K\\\"uhn, Pedro Amaro, Awad Mohamed, Yuki\n  Amano, Stefano Orlando, Roberta Totani, Monica de Simone, Stephan Fritzsche,\n  Thomas Pfeifer, Marcello Coreno, Andrey Surzhykov, Jos\\'e R. Crespo\n  L\\'opez-Urrutia","authorsParsed":[["Togawa","Moto",""],["Richter","Jan",""],["Shah","Chintan",""],["Botz","Marc",""],["Nenninger","Joshua",""],["Danisch","Jonas",""],["Goes","Joschka",""],["Kühn","Steffen",""],["Amaro","Pedro",""],["Mohamed","Awad",""],["Amano","Yuki",""],["Orlando","Stefano",""],["Totani","Roberta",""],["de Simone","Monica",""],["Fritzsche","Stephan",""],["Pfeifer","Thomas",""],["Coreno","Marcello",""],["Surzhykov","Andrey",""],["López-Urrutia","José R. Crespo",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 09:03:03 GMT"}],"updateDate":"2024-08-23","timestamp":1724317383000,"abstract":"  By exciting a series of $1\\mathrm{s}^{2}\\, ^{1}\\mathrm{S}_{0} \\to\n1\\mathrm{s}n\\mathrm{p}\\, ^{1}\\mathrm{P}_{1}$ transitions in helium-like\nnitrogen ions with linearly polarized monochromatic soft X-rays at the Elettra\nfacility, we found a change in the angular distribution of the fluorescence\nsensitive to the principal quantum number $n$. In particular it is observed\nthat the ratio of emission in directions parallel and perpendicular to the\npolarization of incident radiation increases with higher $n$. We find this\n$n$-dependence to be a manifestation of the Hanle effect, which served as a\npractical tool for lifetime determinations of optical transitions since its\ndiscovery in 1924. In contrast to traditional Hanle effect experiments, in\nwhich one varies the magnetic field and considers a particular excited state,\nwe demonstrate a 'soft X-ray Hanle effect' which arises in a static magnetic\nfield but for a series of excited states. By comparing experimental data with\ntheoretical predictions, we were able to determine lifetimes ranging from\nhundreds of femtoseconds to tens of picoseconds of the\n$1\\mathrm{s}n\\mathrm{p}\\, ^{1}\\mathrm{P}_{1}$ levels, which find excellent\nagreement with atomic-structure calculations. We argue that dedicated soft\nX-ray measurements could yield lifetime data that is beyond current\nexperimental reach and cannot yet be predicted with sufficient accuracy.\n","subjects":["Physics/Atomic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dKJ8vL7cieW2thPMw7J92lOwKSzkFclA873tok13EUE","pdfSize":"678272"}
