{"id":"2408.14640","title":"Effect of Adaptation Rate and Cost Display in a Human-AI Interaction\n  Game","authors":"Jason T. Isa, Bohan Wu, Qirui Wang, Yilin Zhang, Samuel A. Burden,\n  Lillian J. Ratliff, Benjamin J. Chasnov","authorsParsed":[["Isa","Jason T.",""],["Wu","Bohan",""],["Wang","Qirui",""],["Zhang","Yilin",""],["Burden","Samuel A.",""],["Ratliff","Lillian J.",""],["Chasnov","Benjamin J.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 21:08:21 GMT"}],"updateDate":"2024-08-28","timestamp":1724706501000,"abstract":"  As interactions between humans and AI become more prevalent, it is critical\nto have better predictors of human behavior in these interactions. We\ninvestigated how changes in the AI's adaptive algorithm impact behavior\npredictions in two-player continuous games. In our experiments, the AI adapted\nits actions using a gradient descent algorithm under different adaptation rates\nwhile human participants were provided cost feedback. The cost feedback was\nprovided by one of two types of visual displays: (a) cost at the current joint\naction vector, or (b) cost in a local neighborhood of the current joint action\nvector. Our results demonstrate that AI adaptation rate can significantly\naffect human behavior, having the ability to shift the outcome between two game\ntheoretic equilibrium. We observed that slow adaptation rates shift the outcome\ntowards the Nash equilibrium, while fast rates shift the outcome towards the\nhuman-led Stackelberg equilibrium. The addition of localized cost information\nhad the effect of shifting outcomes towards Nash, compared to the outcomes from\ncost information at only the current joint action vector. Future work will\ninvestigate other effects that influence the convergence of gradient descent\ngames.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}