{"id":"2408.00705","title":"Segment-Based Test Case Prioritization: A Multi-objective Approach","authors":"Hieu Huynh, Nhu Pham, Tien N. Nguyen, Vu Nguyen","authorsParsed":[["Huynh","Hieu",""],["Pham","Nhu",""],["Nguyen","Tien N.",""],["Nguyen","Vu",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 16:51:01 GMT"}],"updateDate":"2024-08-02","timestamp":1722531061000,"abstract":"  Regression testing of software is a crucial but time-consuming task,\nespecially in the context of user interface (UI) testing where multiple\nmicroservices must be validated simultaneously. Test case prioritization (TCP)\nis a cost-efficient solution to address this by scheduling test cases in an\nexecution order that maximizes an objective function, generally aimed at\nincreasing the fault detection rate. While several techniques have been\nproposed for TCP, most rely on source code information which is usually not\navailable for UI testing. In this paper, we introduce a multi-objective\noptimization approach to prioritize UI test cases, using evolutionary search\nalgorithms and four coverage criteria focusing on web page elements as\nobjectives for the optimization problem. Our method, which does not require\nsource code information, is evaluated using two evolutionary algorithms\n(AGE-MOEA and NSGA-II) and compared with other TCP methods on a self-collected\ndataset of 11 test suites. The results show that our approach significantly\noutperforms other methods in terms of Average Percentage of Faults Detected\n(APFD) and APFD with Cost (APFDc), achieving the highest scores of 87.8\\% and\n79.2\\%, respectively. We also introduce a new dataset and demonstrate the\nsignificant improvement of our approach over existing ones via empirical\nexperiments. The paper's contributions include the application of web page\nsegmentation in TCP, the construction of a new dataset for UI TCP, and\nempirical comparisons that demonstrate the improvement of our approach.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"QHNdqdXXkOk-4Wxg_h2eZlM-f1AfFpxjaSx4TYsfae0","pdfSize":"1553271","txDigest":"JDwANpH1QDgjb1vKMYGkYyHkuPhMzyvw4kCBYhsT1tBh","endEpoch":"1","status":"CERTIFIED"}
