{"id":"2408.12522","title":"Rate-adaptive Reconciliation for Experimental Continuous-variable\n  Quantum Key Distribution with Discrete Modulation over a Free-space Optical\n  Link","authors":"Kadir G\\\"um\\\"u\\c{s}, Jo\\~ao dos Reis Fraz\\~ao, Vincent van Vliet,\n  Sjoerd van der Heide, Menno van den Hout, Gabriele Liga, Yunus Can\n  G\\\"ultekin, Aaron Albores-Mejia, Thomas Bradley, Alex Alvarado, and Chigo\n  Okonkwo","authorsParsed":[["Gümüş","Kadir",""],["Frazão","João dos Reis",""],["van Vliet","Vincent",""],["van der Heide","Sjoerd",""],["Hout","Menno van den",""],["Liga","Gabriele",""],["Gültekin","Yunus Can",""],["Albores-Mejia","Aaron",""],["Bradley","Thomas",""],["Alvarado","Alex",""],["Okonkwo","Chigo",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 16:25:02 GMT"}],"updateDate":"2024-08-23","timestamp":1724343902000,"abstract":"  Continuous-variable quantum key distribution (CV-QKD) has been proposed as a\nmethod for securely exchanging keys to protect against the security concerns\ncaused by potential advancements in quantum computing. In addition to optical\nfiber transmission, free-space optical (FSO) channel is an interesting channel\nfor CV-QKD, as it is possible to share keys over this channel wirelessly. The\ninstability of the FSO channel caused by turbulence-induced fading, however,\ncan cause a degradation in the system's performance. One of the most important\naspects of CV-QKD is the reconciliation step, which significantly impacts the\nperformance of the CV-QKD system. Hence, rate-adaptive reconciliation is\nnecessary for CV-QKD over FSO to combat the fluctuations in the channel and\nimprove secret key rates (SKRs). Therefore, in this paper, we simulate the\nimpact of discrete modulation on the reconciliation efficiency and consider the\nuse of $d$-dimensional reconciliation with $d > 8$ to mitigate this impact,\nimproving reconciliation efficiencies by up to 3.4%. We validate our results by\nexperimentally demonstrating CV-QKD over a turbulent FSO link and demonstrate\nSKR gains by up to 165%. Furthermore, we optimise the reconciliation efficiency\nfor FSO links, achieving additional SKR gains of up to 7.6%.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"25mLFbMS0ZfH0DPm6o5ZZlFeE5MULB6uDwTQBYMk390","pdfSize":"519348"}
