{"id":"2408.08088","title":"KGV: Integrating Large Language Models with Knowledge Graphs for Cyber\n  Threat Intelligence Credibility Assessment","authors":"Zongzong Wu, Fengxiao Tang, Ming Zhao, Yufeng Li","authorsParsed":[["Wu","Zongzong",""],["Tang","Fengxiao",""],["Zhao","Ming",""],["Li","Yufeng",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 11:32:46 GMT"}],"updateDate":"2024-08-16","timestamp":1723721566000,"abstract":"  Cyber threat intelligence is a critical tool that many organizations and\nindividuals use to protect themselves from sophisticated, organized,\npersistent, and weaponized cyber attacks. However, few studies have focused on\nthe quality assessment of threat intelligence provided by intelligence\nplatforms, and this work still requires manual analysis by cybersecurity\nexperts. In this paper, we propose a knowledge graph-based verifier, a novel\nCyber Threat Intelligence (CTI) quality assessment framework that combines\nknowledge graphs and Large Language Models (LLMs). Our approach introduces LLMs\nto automatically extract OSCTI key claims to be verified and utilizes a\nknowledge graph consisting of paragraphs for fact-checking. This method differs\nfrom the traditional way of constructing complex knowledge graphs with entities\nas nodes. By constructing knowledge graphs with paragraphs as nodes and\nsemantic similarity as edges, it effectively enhances the semantic\nunderstanding ability of the model and simplifies labeling requirements.\nAdditionally, to fill the gap in the research field, we created and made public\nthe first dataset for threat intelligence assessment from heterogeneous\nsources. To the best of our knowledge, this work is the first to create a\ndataset on threat intelligence reliability verification, providing a reference\nfor future research. Experimental results show that KGV (Knowledge Graph\nVerifier) significantly improves the performance of LLMs in intelligence\nquality assessment. Compared with traditional methods, we reduce a large amount\nof data annotation while the model still exhibits strong reasoning\ncapabilities. Finally, our method can achieve XXX accuracy in network threat\nassessment.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}