{"id":"2408.14628","title":"Investigating Late-Time Dark Energy and Massive Neutrinos in Light of\n  DESI Y1 BAO","authors":"Jo\\~ao Rebou\\c{c}as, Diogo H. F. de Souza, Kunhao Zhong, Vivian\n  Miranda, Rogerio Rosenfeld","authorsParsed":[["Rebouças","João",""],["de Souza","Diogo H. F.",""],["Zhong","Kunhao",""],["Miranda","Vivian",""],["Rosenfeld","Rogerio",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 20:45:51 GMT"}],"updateDate":"2024-08-28","timestamp":1724705151000,"abstract":"  Baryonic Acoustic Oscillation (BAO) data from the Dark Energy Spectroscopic\nInstrument (DESI), in combination with Cosmic Microwave Background (CMB) data\nand Type Ia Supernovae (SN) luminosity distances, suggests a dynamical\nevolution of the dark energy equation of state with a phantom phase ($w < -1$)\nin the past when the so-called $w_0w_a$ parametrization $w(a) = w_0 + w_a(1-a)$\nis assumed. In this work, we investigate more general dark energy models that\nalso allow a phantom equation of state. We consider three cases: an equation of\nstate with a transition feature, a model-agnostic equation of state with\nconstant values in chosen redshift bins, and a k-essence model. Since the dark\nenergy equation of state is correlated with neutrino masses, we reassess\nconstraints on the neutrino mass sum focusing on the model-agnostic equation of\nstate. We find that the combination of DESI BAO with Planck 2018 CMB data and\nSN data from Pantheon, Pantheon+, or Union3 is consistent with an oscillatory\ndark energy equation of state, while a monotonic behavior is preferred by the\nDESY5 SN data. Performing model comparison techniques, we find that the\n$w_0w_a$ parametrization remains the simplest dark energy model that can\nprovide a better fit to DESI BAO, CMB, and all SN datasets than $\\Lambda$CDM.\nConstraints on the neutrino mass sum assuming dynamical dark energy are relaxed\ncompared to $\\Lambda$CDM and we show that these constraints are tighter in the\nmodel-agnostic case relative to $w_0w_a$ model by $70\\%-90\\%$.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}