{"id":"2408.04065","title":"Do Sharpness-based Optimizers Improve Generalization in Medical Image\n  Analysis?","authors":"Mohamed Hassan, Aleksandar Vakanski, Min Xian","authorsParsed":[["Hassan","Mohamed",""],["Vakanski","Aleksandar",""],["Xian","Min",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 20:07:25 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 18:31:03 GMT"}],"updateDate":"2024-08-13","timestamp":1723061245000,"abstract":"  Effective clinical deployment of deep learning models in healthcare demands\nhigh generalization performance to ensure accurate diagnosis and treatment\nplanning. In recent years, significant research has focused on improving the\ngeneralization of deep learning models by regularizing the sharpness of the\nloss landscape. Among the optimization approaches that explicitly minimize\nsharpness, Sharpness-Aware Minimization (SAM) has shown potential in enhancing\ngeneralization performance on general domain image datasets. This success has\nled to the development of several advanced sharpness-based algorithms aimed at\naddressing the limitations of SAM, such as Adaptive SAM, surrogate-Gap SAM,\nWeighted SAM, and Curvature Regularized SAM. These sharpness-based optimizers\nhave shown improvements in model generalization compared to conventional\nstochastic gradient descent optimizers and their variants on general domain\nimage datasets, but they have not been thoroughly evaluated on medical images.\nThis work provides a review of recent sharpness-based methods for improving the\ngeneralization of deep learning networks and evaluates the methods performance\non medical breast ultrasound images. Our findings indicate that the initial SAM\nmethod successfully enhances the generalization of various deep learning\nmodels. While Adaptive SAM improves generalization of convolutional neural\nnetworks, it fails to do so for vision transformers. Other sharpness-based\noptimizers, however, do not demonstrate consistent results. The results reveal\nthat, contrary to findings in the non-medical domain, SAM is the only\nrecommended sharpness-based optimizer that consistently improves generalization\nin medical image analysis, and further research is necessary to refine the\nvariants of SAM to enhance generalization performance in this field\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}