{"id":"2408.00431","title":"An Operational Scheduling Framework for Tanker-based Water Distribution\n  System under Uncertainty","authors":"Abhilasha Maheshwari, Shamik Misra, Ravindra Gudi, Senthilmurugan\n  Subbiah, Chrysi Laspidou","authorsParsed":[["Maheshwari","Abhilasha",""],["Misra","Shamik",""],["Gudi","Ravindra",""],["Subbiah","Senthilmurugan",""],["Laspidou","Chrysi",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 10:08:22 GMT"}],"updateDate":"2024-08-02","timestamp":1722506902000,"abstract":"  Tanker water systems play critical role in providing adequate service to meet\npotable water demands in the face of acute water crisis in many cities\nglobally. Managing tanker movements among the supply and demand sides requires\nan efficient scheduling framework that could promote economic feasibility,\nensure timely delivery, and avoid water wastage. However, to realize such a\nsustainable water supply operation, inherent uncertainties related to consumer\ndemand and tanker travel time need to accounted in the operational scheduling.\nHerein, a two-stage stochastic optimization model with a recourse approach is\ndeveloped for scheduling and optimization of tanker based water supply and\ntreatment facility operations under uncertainty. The uncertain water demands\nand tanker travel times are combinedly modelled in a computationally efficient\nmanner using a hybrid Monte Carlo simulation and scenario tree approach. The\nmaximum demand fulfillment, limited extraction of groundwater, and timely\ndelivery of quality water are enforced through a set of constraints to achieve\nsustainable operation. A representative urban case study is demonstrated,\nresults are discussed for two uncertainty cases (i) only demand, and (ii)\nintegrated demand-travel time. Value of stochastic solution over expected value\nand perfect information model solutions are analyzed and features of the\nframework for informed decision-making are discussed.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}