{"id":"2408.07469","title":"Predictions of the interfacial free energy along the coexistence line\n  from single-state calculations","authors":"Ignacio Sanchez-Burgos, Pablo Montero de Hijes, Eduardo Sanz, Carlos\n  Vega and Jorge R. Espinosa","authorsParsed":[["Sanchez-Burgos","Ignacio",""],["de Hijes","Pablo Montero",""],["Sanz","Eduardo",""],["Vega","Carlos",""],["Espinosa","Jorge R.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 11:28:26 GMT"}],"updateDate":"2024-08-15","timestamp":1723634906000,"abstract":"  The calculation of the interfacial free energy between two thermodynamic\nphases is crucial across different fields including materials science,\nchemistry, and condensed matter physics. This study delves into a thermodynamic\napproach to predict interfacial free energy along a coexistence line. For that\npurpose, we utilize Gibbs-Cahn integration method to accurately determine the\ninterfacial free energy along various coexistence conditions, relying solely on\ndata obtained from a single-state interfacial free energy calculation at given\nconditions of pressure and temperature. Unlike traditional methods that require\nindividual measurements at each thermodynamic state, this approach\nsignificantly reduces computational demand and enhances efficiency. The\nintegration scheme requires the computation of the excess interfacial energy\n(by means of unbiased NVT computer simulations in which the two phases involved\ncoexist) at different points along the coexistence line, for later use this\ninformation as an input in our calculations. We apply this method for the\nLennard-Jones and mW water model for the case of the liquid-solid interface, as\nwell as Lennard-Jones and TIP4P/2005 models for liquid-vapor interfaces. Our\nresults highlight the accuracy and effectiveness of this thermodynamic\nintegration route for estimating the interfacial free energy along a\ncoexistence line.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"dsKUdntvZ_ptGH_FUFgZo-GhwWz_fNIAUBosG-fV6ig","pdfSize":"1015219"}
