{"id":"2408.00808","title":"LightViz: Autonomous Light-field Surveying and Mapping for Distributed\n  Light Pollution Monitoring","authors":"Sheng-En Huang, Kazi Farha Farzana Suhi and Md Jahidul Islam","authorsParsed":[["Huang","Sheng-En",""],["Suhi","Kazi Farha Farzana",""],["Islam","Md Jahidul",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 20:46:27 GMT"}],"updateDate":"2024-08-05","timestamp":1722458787000,"abstract":"  Existing technologies for distributed light-field mapping and light pollution\nmonitoring (LPM) rely on either remote satellite imagery or manual light\nsurveying with single-point sensors such as SQMs (sky quality meters). These\nmodalities offer low-resolution data that are not informative for dense\nlight-field mapping, pollutant factor identification, or sustainable policy\nimplementation. In this work, we propose LightViz -- an interactive software\ninterface to survey, simulate, and visualize light pollution maps in real-time.\nAs opposed to manual error-prone methods, LightViz (i) automates the\nlight-field data collection and mapping processes; (ii) provides a platform to\nsimulate various light sources and intensity attenuation models; and (iii)\nfacilitates effective policy identification for conservation.\n  To validate the end-to-end computational pipeline, we design a distributed\nlight-field sensor suit, collect data on Florida coasts, and visualize the\ndistributed light-field maps. In particular, we perform a case study at St.\nJohns County in Florida, which has a two-decade conservation program for\nlighting ordinances. The experimental results demonstrate that LightViz can\noffer high-resolution light-field mapping and provide interactive features to\nsimulate and formulate community policies for light pollution mitigation. We\nalso propose a mathematical formulation for light footprint evaluation, which\nwe integrated into LightViz for targeted LPM in vulnerable communities.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vvrkRytxz1TbmDDV_z_hYwRllT-dAr1AtuOFds_mIGU","pdfSize":"28186766","txDigest":"DGvo54TntCTZX7LNq7JpWshTKrvS9Vsj5pmb3Cu1dYw9","endEpoch":"1","status":"CERTIFIED"}
