{"id":"2408.05974","title":"Unseen No More: Unlocking the Potential of CLIP for Generative Zero-shot\n  HOI Detection","authors":"Yixin Guo and Yu Liu and Jianghao Li and Weimin Wang and Qi Jia","authorsParsed":[["Guo","Yixin",""],["Liu","Yu",""],["Li","Jianghao",""],["Wang","Weimin",""],["Jia","Qi",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 08:02:37 GMT"}],"updateDate":"2024-08-13","timestamp":1723449757000,"abstract":"  Zero-shot human-object interaction (HOI) detector is capable of generalizing\nto HOI categories even not encountered during training. Inspired by the\nimpressive zero-shot capabilities offered by CLIP, latest methods strive to\nleverage CLIP embeddings for improving zero-shot HOI detection. However, these\nembedding-based methods train the classifier on seen classes only, inevitably\nresulting in seen-unseen confusion for the model during inference. Besides, we\nfind that using prompt-tuning and adapters further increases the gap between\nseen and unseen accuracy. To tackle this challenge, we present the first\ngeneration-based model using CLIP for zero-shot HOI detection, coined HOIGen.\nIt allows to unlock the potential of CLIP for feature generation instead of\nfeature extraction only. To achieve it, we develop a CLIP-injected feature\ngenerator in accordance with the generation of human, object and union\nfeatures. Then, we extract realistic features of seen samples and mix them with\nsynthetic features together, allowing the model to train seen and unseen\nclasses jointly. To enrich the HOI scores, we construct a generative prototype\nbank in a pairwise HOI recognition branch, and a multi-knowledge prototype bank\nin an image-wise HOI recognition branch, respectively. Extensive experiments on\nHICO-DET benchmark demonstrate our HOIGen achieves superior performance for\nboth seen and unseen classes under various zero-shot settings, compared with\nother top-performing methods. Code is available at:\nhttps://github.com/soberguo/HOIGen\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}