{"id":"2408.13832","title":"A Low-dose CT Reconstruction Network Based on TV-regularized OSEM\n  Algorithm","authors":"Ran An, Yinghui Zhang, Xi Chen, Lemeng Li, Ke Chen and Hongwei Li","authorsParsed":[["An","Ran",""],["Zhang","Yinghui",""],["Chen","Xi",""],["Li","Lemeng",""],["Chen","Ke",""],["Li","Hongwei",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 13:31:53 GMT"}],"updateDate":"2024-08-27","timestamp":1724592713000,"abstract":"  Low-dose computed tomography (LDCT) offers significant advantages in reducing\nthe potential harm to human bodies. However, reducing the X-ray dose in CT\nscanning often leads to severe noise and artifacts in the reconstructed images,\nwhich might adversely affect diagnosis. By utilizing the expectation\nmaximization (EM) algorithm, statistical priors could be combined with\nartificial priors to improve LDCT reconstruction quality. However, conventional\nEM-based regularization methods adopt an alternating solving strategy, i.e.\nfull reconstruction followed by image-regularization, resulting in\nover-smoothing and slow convergence. In this paper, we propose to integrate TV\nregularization into the ``M''-step of the EM algorithm, thus achieving\neffective and efficient regularization. Besides, by employing the\nChambolle-Pock (CP) algorithm and the ordered subset (OS) strategy, we propose\nthe OSEM-CP algorithm for LDCT reconstruction, in which both reconstruction and\nregularization are conducted view-by-view. Furthermore, by unrolling OSEM-CP,\nwe propose an end-to-end reconstruction neural network (NN), named OSEM-CPNN,\nwith remarkable performance and efficiency that achieves high-quality\nreconstructions in just one full-view iteration. Experiments on different\nmodels and datasets demonstrate our methods' outstanding performance compared\nto traditional and state-of-the-art deep-learning methods.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}