{"id":"2408.15330","title":"Ultralight dark matter detection with levitated ferromagnets","authors":"Saarik Kalia, Dmitry Budker, Derek F. Jackson Kimball, Wei Ji, Zhen\n  Liu, Alexander O. Sushkov, Chris Timberlake, Hendrik Ulbricht, Andrea\n  Vinante, Tao Wang","authorsParsed":[["Kalia","Saarik",""],["Budker","Dmitry",""],["Kimball","Derek F. Jackson",""],["Ji","Wei",""],["Liu","Zhen",""],["Sushkov","Alexander O.",""],["Timberlake","Chris",""],["Ulbricht","Hendrik",""],["Vinante","Andrea",""],["Wang","Tao",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 18:00:03 GMT"}],"updateDate":"2024-08-29","timestamp":1724781603000,"abstract":"  Levitated ferromagnets act as ultraprecise magnetometers, which can exhibit\nhigh quality factors due to their excellent isolation from the environment.\nThese instruments can be utilized in searches for ultralight dark matter\ncandidates, such as axionlike dark matter or dark-photon dark matter. In\naddition to being sensitive to an axion-photon coupling or kinetic mixing,\nwhich produce physical magnetic fields, ferromagnets are also sensitive to the\neffective magnetic field (or ``axion wind\") produced by an axion-electron\ncoupling. While the dynamics of a levitated ferromagnet in response to a DC\nmagnetic field have been well studied, all of these couplings would produce AC\nfields. In this work, we study the response of a ferromagnet to an applied AC\nmagnetic field and use these results to project their sensitivity to axion and\ndark-photon dark matter. We pay special attention to the direction of motion\ninduced by an applied AC field, in particular, whether it precesses around the\napplied field (similar to an electron spin) or librates in the plane of the\nfield (similar to a compass needle). We show that existing levitated\nferromagnet setups can already have comparable sensitivity to an axion-electron\ncoupling as comagnetometer or torsion balance experiments. In addition, future\nsetups can become sensitive probes of axion-electron coupling, dark-photon\nkinetic mixing, and axion-photon coupling, for ultralight dark matter masses\n$m_\\mathrm{DM}\\lesssim\\mathrm{feV}$.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"2EXaZoNsnw4owOUIlv41QHMKDN6KlWao6pLZr1NOhPQ","pdfSize":"1261664"}
