{"id":"2408.03081","title":"Considerations on free-surface detachment and bed entrainment of fluvial\n  plastics","authors":"Matthias Kramer","authorsParsed":[["Kramer","Matthias",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 10:19:48 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 06:18:47 GMT"},{"version":"v3","created":"Tue, 27 Aug 2024 05:33:11 GMT"}],"updateDate":"2024-08-28","timestamp":1722939588000,"abstract":"  Over the last decade, fluvial plastics have been identified as major threat\nto aquatic environments and human health. In order to develop adequate\nmitigation strategies for plastic pollution, a fundamental process\nunderstanding of riverine plastic transport is of significant importance. In\nthis context, the implementation of research findings into numerical simulation\nenvironments is anticipated to enhance modelling capabilities and to support a\nrigorous decision making. Recent experimental research has focused on the\nincipient motion of plastic particles, as well as on the effects of surface\ntension on plastic concentration profiles. While these investigations have\nadvanced the state-of-the-art knowledge, current literature still displays a\nlack of basic insights into layer-specific plastic transport physics. In this\nstudy, first principles are applied to advance knowledge on free-surface\ndetachment and bed entrainment of fluvial plastics. A novel relationship for\nthe critical surface detachment velocity is derived, followed by the\ndevelopment of a framework that allows to relate plastic Shields parameters to\nthose of natural sediments. Overall, it is anticipated that these developments\nwill trigger new research within the plastics community, and it is hoped that\npresent findings will be implemented into Lagrangian particle tracking\nsoftware.\n","subjects":["Physics/Fluid Dynamics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"fky4B6QcrBJRZNIozfy-HrlxdKLdmXS6j5-QFXnef6s","pdfSize":"1207839"}
