{"id":"2408.00645","title":"Token Interdependency Parsing (Tipping) -- Fast and Accurate Log Parsing","authors":"Shayan Hashemi and Mika M\\\"antyl\\\"a","authorsParsed":[["Hashemi","Shayan",""],["Mäntylä","Mika",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 15:37:22 GMT"}],"updateDate":"2024-08-02","timestamp":1722526642000,"abstract":"  In the last decade, an impressive increase in software adaptions has led to a\nsurge in log data production, making manual log analysis impractical and\nestablishing the necessity for automated methods. Conversely, most automated\nanalysis tools include a component designed to separate log templates from\ntheir parameters, commonly referred to as a \"log parser\". This paper aims to\nintroduce a new fast and accurate log parser, named \"Tipping\". Tipping combines\nrule-based tokenizers, interdependency token graphs, strongly connected\ncomponents, and various techniques to ensure rapid, scalable, and precise log\nparsing. Furthermore, Tipping is parallelized and capable of running on\nmultiple processing cores with close to linear efficiency. We evaluated Tipping\nagainst other state-of-the-art log parsers in terms of accuracy, performance,\nand the downstream task of anomaly detection. Accordingly, we found that\nTipping outperformed existing methods in accuracy and performance in our\nevaluations. More in-depth, Tipping can parse 11 million lines of logs in less\nthan 20 seconds on a laptop machine. Furthermore, we re-implemented a\nparallelized version of the past IpLom algorithm to demonstrate the effect of\nparallel processing, and it became the second-fastest parser. As logs keep\ngrowing in volume and complexity, the software engineering community needs to\nensure automated log analysis tools keep up with the demand, being capable of\nefficiently handling massive volumes of logs with high accuracy. Tipping's\nrobustness, versatility, efficiency, and scalability make it a viable tool for\nthe modern automated log analysis task.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/"}