{"id":"2408.10934","title":"SDI-Net: Toward Sufficient Dual-View Interaction for Low-light Stereo\n  Image Enhancement","authors":"Linlin Hu, Ao Sun, Shijie Hao, Richang Hong, Meng Wang","authorsParsed":[["Hu","Linlin",""],["Sun","Ao",""],["Hao","Shijie",""],["Hong","Richang",""],["Wang","Meng",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 15:17:11 GMT"}],"updateDate":"2024-08-21","timestamp":1724167031000,"abstract":"  Currently, most low-light image enhancement methods only consider information\nfrom a single view, neglecting the correlation between cross-view information.\nTherefore, the enhancement results produced by these methods are often\nunsatisfactory. In this context, there have been efforts to develop methods\nspecifically for low-light stereo image enhancement. These methods take into\naccount the cross-view disparities and enable interaction between the left and\nright views, leading to improved performance. However, these methods still do\nnot fully exploit the interaction between left and right view information. To\naddress this issue, we propose a model called Toward Sufficient Dual-View\nInteraction for Low-light Stereo Image Enhancement (SDI-Net). The backbone\nstructure of SDI-Net is two encoder-decoder pairs, which are used to learn the\nmapping function from low-light images to normal-light images. Among the\nencoders and the decoders, we design a module named Cross-View Sufficient\nInteraction Module (CSIM), aiming to fully exploit the correlations between the\nbinocular views via the attention mechanism. The quantitative and visual\nresults on public datasets validate the superiority of our method over other\nrelated methods. Ablation studies also demonstrate the effectiveness of the key\nelements in our model.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wsK_cXzWu0xyzQX4vJFZOP4DeEoIj1z-hw74jPH7RS0","pdfSize":"1904802"}
