{"id":"2408.00213","title":"Flare Accelerated Electrons in Kappa-Distribution from X-Ray Spectra\n  with Warm-Target Model","authors":"Yingjie Luo (1), Eduard P. Kontar (1) and Debesh Bhattacharjee (1)\n  ((1) School of Physics & Astronomy, University of Glasgow, G12 8QQ, Glasgow,\n  UK)","authorsParsed":[["Luo","Yingjie",""],["Kontar","Eduard P.",""],["Bhattacharjee","Debesh",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 00:49:46 GMT"}],"updateDate":"2024-08-02","timestamp":1722473386000,"abstract":"  X-ray observations provide essential and valuable insights into the\nacceleration and propagation of non-thermal electrons during solar flares.\nImproved X-ray spectral analysis requires a deeper understanding of the\ndynamics of energetic electrons. Previous studies have demonstrated that the\ndynamics of accelerated electrons of a few thermal speeds are more complex. To\nbetter describe the energetic electrons after injection, a model considering\nenergy diffusion and thermalization effects in flare conditions (warm-target\nmodel) has recently been developed for Hard X-ray spectral analysis. This model\nhas demonstrated how the low-energy cut-off, which can hardly be constrained in\ncold-target modeling, can be determined. However, the power-law form may not be\nthe most suitable representation of injected electrons. The kappa distribution,\nwhich is proposed as a physical consequence of electron acceleration, has shown\nsuccessful application in RHESSI spectral analysis. In this study, we employ\nthe kappa-form injected electrons in the warm-target model to analyze two\nM-class flares, observed by RHESSI and STIX, respectively. The best-fit results\nshow that the kappa-form energetic electron spectrum generates lower\nnon-thermal energy when producing a similar photon spectrum in the fit range\ncompared to the power-law form. We also demonstrated that the fit parameters\nassociated with kappa-form electron spectrum can be well determined with small\nfit uncertainty. Further, the kappa distribution, which covers the entire\nelectron energy range, enables the determination of key electron properties\nsuch as total electron number density and average energy in the flare site,\nproviding valuable information on electron acceleration processes.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"o4JAZ16c4_NuTEUzdT8DfVJ1B_v8AcFnuu_cUzwKh5g","pdfSize":"2444388"}
