{"id":"2408.10649","title":"Inferring Underwater Topography with FINN","authors":"Co\\c{s}ku Can Horuz, Matthias Karlbauer, Timothy Praditia, Sergey\n  Oladyshkin, Wolfgang Nowak, Sebastian Otte","authorsParsed":[["Horuz","Coşku Can",""],["Karlbauer","Matthias",""],["Praditia","Timothy",""],["Oladyshkin","Sergey",""],["Nowak","Wolfgang",""],["Otte","Sebastian",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 08:42:00 GMT"}],"updateDate":"2024-08-21","timestamp":1724143320000,"abstract":"  Spatiotemporal partial differential equations (PDEs) find extensive\napplication across various scientific and engineering fields. While numerous\nmodels have emerged from both physics and machine learning (ML) communities,\nthere is a growing trend towards integrating these approaches to develop hybrid\narchitectures known as physics-aware machine learning models. Among these, the\nfinite volume neural network (FINN) has emerged as a recent addition. FINN has\nproven to be particularly efficient in uncovering latent structures in data. In\nthis study, we explore the capabilities of FINN in tackling the shallow-water\nequations, which simulates wave dynamics in coastal regions. Specifically, we\ninvestigate FINN's efficacy to reconstruct underwater topography based on these\nparticular wave equations. Our findings reveal that FINN exhibits a remarkable\ncapacity to infer topography solely from wave dynamics, distinguishing itself\nfrom both conventional ML and physics-aware ML models. Our results underscore\nthe potential of FINN in advancing our understanding of spatiotemporal\nphenomena and enhancing parametrization capabilities in related domains.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Physics/Atmospheric and Oceanic Physics","Physics/Computational Physics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"p32RBysCk3iDRj1MyUhcxzOgPUEfcCJrg5tQw1zWPRo","pdfSize":"8473246"}
