{"id":"2408.13576","title":"The Streda Formula for Floquet Systems: Topological Invariants and\n  Quantized Anomalies from Cesaro Summation","authors":"Lucila Peralta Gavensky, Gonzalo Usaj and Nathan Goldman","authorsParsed":[["Gavensky","Lucila Peralta",""],["Usaj","Gonzalo",""],["Goldman","Nathan",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 12:58:23 GMT"},{"version":"v2","created":"Thu, 19 Sep 2024 17:04:45 GMT"}],"updateDate":"2024-09-20","timestamp":1724504303000,"abstract":"  This work introduces a general theoretical framework, which expresses the\ntopological invariants of two-dimensional Floquet systems in terms of tractable\nresponse functions: Building on the Sambe representation of periodically-driven\nsystems, and inspired by the St\\v{r}eda formula for static systems, we evaluate\nthe flow of the unbounded Floquet density of states in response to a magnetic\nperturbation. This Floquet-St\\v{r}eda response, which is a priori\nmathematically ill-defined, is regularized by means of a Ces\\`aro summation\nmethod. As a key outcome of this approach, we relate all relevant Floquet\nwinding numbers to simple band properties of the Floquet-Bloch Hamiltonian.\nThese general relations indicate how the topological characterization of\nFloquet systems can be entirely deduced from the stroboscopic time-evolution of\nthe driven system. Importantly, we identify two physically distinguishable\ncontributions to the Floquet-St\\v{r}eda response: a quantized flow of charge\nbetween the edge and the bulk of the system, and an 'anomalous' quantized flow\nof energy between the system and the driving field, which provides new insight\non the physical origin of the anomalous edge states. As byproducts, our theory\nprovides: a general relation between Floquet winding numbers and the orbital\nmagnetization of Floquet-Bloch bands; a local marker for Floquet winding\nnumbers, which allows to access Floquet topology in inhomogeneous samples; an\nexperimental protocol to extract these Floquet winding numbers from\ndensity-measurements in the presence of an engineered bath; as well as general\nexpressions for these topological invariants in terms of the magnetic response\nof the Floquet density of states, opening a route for the topological\ncharacterization of interacting Floquet systems.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Quantum Gases","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}