{"id":"2408.15469","title":"Biaxial strain tuning of excitons in monolayer MoSe$_2$ by\n  high-temperature physical vapor deposition","authors":"S. Patel, T. Faltermeier, S. Puri, R. Rodriguez, K. Reynolds, S.\n  Davari, H. O. H. Churchill, N. J. Borys, H. Nakamura","authorsParsed":[["Patel","S.",""],["Faltermeier","T.",""],["Puri","S.",""],["Rodriguez","R.",""],["Reynolds","K.",""],["Davari","S.",""],["Churchill","H. O. H.",""],["Borys","N. J.",""],["Nakamura","H.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 01:16:21 GMT"}],"updateDate":"2024-08-29","timestamp":1724807781000,"abstract":"  We present strain tuning of excitonic emission in monolayer MoSe$_2$ by using\na high-temperature physical vapor deposition (PVD). The use of two amorphous\nsubstrates, Si$_{3}$N$_{4}$ and SiO$_{2}$, provides two setpoints to induce\ndistinct amounts of \\textit{biaxial} tensile strain determined by a thermal\nexpansion mismatch between the monolayer and the substrate. The tuning rate of\nthe $A$-exciton transition energy is found to be 103 meV/\\% by\nphotoluminescence (PL), which represents the highest value realized by biaxial\nstrain in transition metal dichalcogenides. The biaxial nature of the tensile\nstrain is confirmed by polarization-resolved second harmonic generation, which\nreveals unperturbed in-plane three-fold symmetry of the monolayer. Furthermore,\na softening of $A_\\mathrm{1g}$ out-of-plane lattice vibration is identified in\nthe Raman spectroscopy, which is known to be insignificant for uniaxial strain.\nConcomitantly, PL mapping of our PVD monolayers demonstrates (i) larger strain\noccurs in the interior of the mono-domain islands compared to the edges and\n(ii) the absence of island-size dependence in the magnitude of induced strain.\nOur results demonstrate an effective path towards strain engineering of\nexcitons by using growth substrates, which holds great promise as a building\nblock for future optoelectronic applications.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}