{"id":"2408.07113","title":"A Theory-Based Explainable Deep Learning Architecture for Music Emotion","authors":"Hortense Fong, Vineet Kumar, K. Sudhir","authorsParsed":[["Fong","Hortense",""],["Kumar","Vineet",""],["Sudhir","K.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 16:01:27 GMT"}],"updateDate":"2024-08-15","timestamp":1723564887000,"abstract":"  This paper paper develops a theory-based, explainable deep learning\nconvolutional neural network (CNN) classifier to predict the time-varying\nemotional response to music. We design novel CNN filters that leverage the\nfrequency harmonics structure from acoustic physics known to impact the\nperception of musical features. Our theory-based model is more parsimonious,\nbut provides comparable predictive performance to atheoretical deep learning\nmodels, while performing better than models using handcrafted features. Our\nmodel can be complemented with handcrafted features, but the performance\nimprovement is marginal. Importantly, the harmonics-based structure placed on\nthe CNN filters provides better explainability for how the model predicts\nemotional response (valence and arousal), because emotion is closely related to\nconsonance--a perceptual feature defined by the alignment of harmonics.\nFinally, we illustrate the utility of our model with an application involving\ndigital advertising. Motivated by YouTube mid-roll ads, we conduct a lab\nexperiment in which we exogenously insert ads at different times within videos.\nWe find that ads placed in emotionally similar contexts increase ad engagement\n(lower skip rates, higher brand recall rates). Ad insertion based on emotional\nsimilarity metrics predicted by our theory-based, explainable model produces\ncomparable or better engagement relative to atheoretical models.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}