{"id":"2408.10300","title":"Shift and Polarization of Excitons from Quantum Geometry","authors":"Carolina Paiva, Tobias Holder and Roni Ilan","authorsParsed":[["Paiva","Carolina",""],["Holder","Tobias",""],["Ilan","Roni",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-21","timestamp":1724090400000,"abstract":"  Despite a long history, certain aspects of excitons - the bound inter-band\nstates which form when a valence band hole and a conduction band electron pair\n- have remained relatively unexplored. This holds particularly true for the\nwavefunction of an exciton, for which few properties have been explored\ntheoretically in various limiting cases. An intuitive language robustly\ncharacterizing the topology of bound electron-hole states is lacking, but\nneeded in order to address the global features of the charge distribution of\nthe excitonic state, to properly understand their transport theory, and to\nsupplement the numerical investigation of excitons in ab-initio approaches.\nHere, we address these gaps by developing a comprehensive framework for the\nquantum geometry and topology of two-dimensional exciton states in terms of the\nexact connections which describe the interaction-renormalized exciton bundle in\na periodic lattice. Based on this description, we derive two gauge-invariant\nquantities, which we identify as the exciton shift vector and the exciton\ndipole vector. Using the shift vector, we elucidate the topology of exciton\nbands compared to the topology of the parent electronic band structure,\npinpointing precisely how interactions can introduce nontrivial topology to the\nexciton bands beyond the topology which is contained in the single-particle\nbands. We further elucidate how shift and polarizations enter into the\nsemiclassical equations of motion for the exciton center of mass coordinates.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}