{"id":"2408.01575","title":"Deep Learning Framework for History Matching CO2 Storage with 4D Seismic\n  and Monitoring Well Data","authors":"Nanzhe Wang, Louis J. Durlofsky","authorsParsed":[["Wang","Nanzhe",""],["Durlofsky","Louis J.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 21:14:13 GMT"}],"updateDate":"2024-08-06","timestamp":1722633253000,"abstract":"  Geological carbon storage entails the injection of megatonnes of\nsupercritical CO2 into subsurface formations. The properties of these\nformations are usually highly uncertain, which makes design and optimization of\nlarge-scale storage operations challenging. In this paper we introduce a\nhistory matching strategy that enables the calibration of formation properties\nbased on early-time observations. Early-time assessments are essential to\nassure the operation is performing as planned. Our framework involves two\nfit-for-purpose deep learning surrogate models that provide predictions for\nin-situ monitoring well data and interpreted time-lapse (4D) seismic saturation\ndata. These two types of data are at very different scales of resolution, so it\nis appropriate to construct separate, specialized deep learning networks for\ntheir prediction. This approach results in a workflow that is more\nstraightforward to design and more efficient to train than a single surrogate\nthat provides global high-fidelity predictions. The deep learning models are\nintegrated into a hierarchical Markov chain Monte Carlo (MCMC) history matching\nprocedure. History matching is performed on a synthetic case with and without\n4D seismic data, which allows us to quantify the impact of 4D seismic on\nuncertainty reduction. The use of both data types is shown to provide\nsubstantial uncertainty reduction in key geomodel parameters and to enable\naccurate predictions of CO2 plume dynamics. The overall history matching\nframework developed in this study represents an efficient way to integrate\nmultiple data types and to assess the impact of each on uncertainty reduction\nand performance predictions.\n","subjects":["Computing Research Repository/Machine Learning","Physics/Geophysics","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"YGcNWYV2hxD9m8TmIoKoYM_FnqqkrN0EhNXO44wQIy4","pdfSize":"8728494"}
