{"id":"2408.13046","title":"CMA-ES for Discrete and Mixed-Variable Optimization on Sets of Points","authors":"Kento Uchida, Ryoki Hamano, Masahiro Nomura, Shota Saito, Shinichi\n  Shirakawa","authorsParsed":[["Uchida","Kento",""],["Hamano","Ryoki",""],["Nomura","Masahiro",""],["Saito","Shota",""],["Shirakawa","Shinichi",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 13:10:06 GMT"}],"updateDate":"2024-08-26","timestamp":1724418606000,"abstract":"  Discrete and mixed-variable optimization problems have appeared in several\nreal-world applications. Most of the research on mixed-variable optimization\nconsiders a mixture of integer and continuous variables, and several integer\nhandlings have been developed to inherit the optimization performance of the\ncontinuous optimization methods to mixed-integer optimization. In some\napplications, acceptable solutions are given by selecting possible points in\nthe disjoint subspaces. This paper focuses on the optimization on sets of\npoints and proposes an optimization method by extending the covariance matrix\nadaptation evolution strategy (CMA-ES), termed the CMA-ES on sets of points\n(CMA-ES-SoP). The CMA-ES-SoP incorporates margin correction that maintains the\ngeneration probability of neighboring points to prevent premature convergence\nto a specific non-optimal point, which is an effective integer-handling\ntechnique for CMA-ES. In addition, because margin correction with a fixed\nmargin value tends to increase the marginal probabilities for a portion of\nneighboring points more than necessary, the CMA-ES-SoP updates the target\nmargin value adaptively to make the average of the marginal probabilities close\nto a predefined target probability. Numerical simulations demonstrated that the\nCMA-ES-SoP successfully optimized the optimization problems on sets of points,\nwhereas the naive CMA-ES failed to optimize them due to premature convergence.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}