{"id":"2408.06268","title":"On differentiability and mass distributions of typical bivariate copulas","authors":"Nicolas Dietrich and Wolfgang Trutschnig","authorsParsed":[["Dietrich","Nicolas",""],["Trutschnig","Wolfgang",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 16:27:59 GMT"}],"updateDate":"2024-08-13","timestamp":1723480079000,"abstract":"  Despite the fact that copulas are commonly considered as analytically\nsmooth/regular objects, derivatives of copulas have to be handled with care.\nTriggered by a recently published result characterizing multivariate copulas\nvia $(d-1)$-increasingness of their partial derivative we study the bivariate\nsetting in detail and show that the set of non-differentiability points of a\ncopula may be quite large. We first construct examples of copulas $C$ whose\nfirst partial derivative $\\partial_1C(x,y)$ is pathological in the sense that\nfor almost every $x \\in (0,1)$ it does not exist on a dense subset of $y \\in\n(0,1)$, and then show that the family of these copulas is dense. Since in\ncommonly considered subfamilies more regularity might be typical, we then focus\non bivariate Extreme Value copulas (EVC) and show that a topologically typical\nEVC is not absolutely continuous but has degenerated discrete component,\nimplying that in this class typically $\\partial_1C(x,y)$ exists in full\n$(0,1)^2$. Considering that regularity of copulas is closely related to their\nmass distributions we then study mass distributions of topologically typical\ncopulas and prove the surprising fact that topologically typical bivariate\ncopulas are mutually completely dependent with full support. Furthermore, we\nuse the characterization of EVCs in terms of their associated Pickands\ndependence measures $\\vartheta$ on $[0,1]$, show that regularity of $\\vartheta$\ncarries over to the corresponding EVC and prove that the subfamily of all EVCs\nwhose absolutely continuous, discrete and singular component has full support\nis dense in the class of all EVCs.\n","subjects":["Mathematics/Statistics Theory","Mathematics/Probability","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"kxoyFQZ9KuM8hDgqAx2Kkiz0roIikgL0pk7Y4KC0_Dk","pdfSize":"2334472"}
