{"id":"2408.01722","title":"Polarization degree of magnetic field structure changes caused by random\n  magnetic field in Gamma-ray Burst","authors":"Jiang-Chuan Tuo, Hong-Bang Liu, Qian-Nan Mai, Qian Zhong, Zu-Ke Feng,\n  Kang-Fa Cheng, En-Wei Liang","authorsParsed":[["Tuo","Jiang-Chuan",""],["Liu","Hong-Bang",""],["Mai","Qian-Nan",""],["Zhong","Qian",""],["Feng","Zu-Ke",""],["Cheng","Kang-Fa",""],["Liang","En-Wei",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 09:26:34 GMT"}],"updateDate":"2024-08-06","timestamp":1722677194000,"abstract":"  In a Poynting-flux-dominated (PFD) jet that exhibits an ordered magnetic\nfield, a transition towards turbulence and magnetic disorder follows after\nmagnetic reconnection and energy dissipation during the prompt emission phase.\nIn this process, the configuration of the magnetic field evolves with time,\nrendering it impossible to entirely categorize the magnetic field as ordered.\nTherefore, we assumed a crude model that incorporates a random magnetic field\nand an ordered magnetic field, and takes into account the proportionality of\nthe random magnetic field strength to the ordered magnetic field, in order to\ncompute the polarization degree (PD) curve for an individual pulse. It has been\ndiscovered that the random magnetic field has a significant impact on the PD\nresults of the low-energy X-ray. In an ordered magnetic field, the X-ray\nsegment maintains a significant PD compared to those in the hundreds of keV and\nMeV ranges even after electron injection ceases, this making PD easier to\ndetect by polarimetry. However, when the random magnetic field is introduced,\nthe low-energy and high-energy PDs exhibit a similar trend, with the X-ray PD\nbeing lower than that of the high-energy segment. Of course, this is related to\nthe rate of disorder in the magnetic field. Additionally, there is two rotation\nof the polarization angles (PAs) that were not present previously, and the\nrotation of the PA in the high-energy segment occurs slightly earlier. These\nresults are unrelated to the structure of the ordered magnetic field.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AFCQWoi9PLtz92K8Buol3_cl8FrvhCJqKNEZLzq15M0","pdfSize":"1894060"}
