{"id":"2408.02355","title":"Quantile Regression using Random Forest Proximities","authors":"Mingshu Li, Bhaskarjit Sarmah, Dhruv Desai, Joshua Rosaler, Snigdha\n  Bhagat, Philip Sommer, Dhagash Mehta","authorsParsed":[["Li","Mingshu",""],["Sarmah","Bhaskarjit",""],["Desai","Dhruv",""],["Rosaler","Joshua",""],["Bhagat","Snigdha",""],["Sommer","Philip",""],["Mehta","Dhagash",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 10:02:33 GMT"}],"updateDate":"2024-08-06","timestamp":1722852153000,"abstract":"  Due to the dynamic nature of financial markets, maintaining models that\nproduce precise predictions over time is difficult. Often the goal isn't just\npoint prediction but determining uncertainty. Quantifying uncertainty,\nespecially the aleatoric uncertainty due to the unpredictable nature of market\ndrivers, helps investors understand varying risk levels. Recently, quantile\nregression forests (QRF) have emerged as a promising solution: Unlike most\nbasic quantile regression methods that need separate models for each quantile,\nquantile regression forests estimate the entire conditional distribution of the\ntarget variable with a single model, while retaining all the salient features\nof a typical random forest. We introduce a novel approach to compute quantile\nregressions from random forests that leverages the proximity (i.e., distance\nmetric) learned by the model and infers the conditional distribution of the\ntarget variable. We evaluate the proposed methodology using publicly available\ndatasets and then apply it towards the problem of forecasting the average daily\nvolume of corporate bonds. We show that using quantile regression using Random\nForest proximities demonstrates superior performance in approximating\nconditional target distributions and prediction intervals to the original\nversion of QRF. We also demonstrate that the proposed framework is\nsignificantly more computationally efficient than traditional approaches to\nquantile regressions.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning","Quantitative Finance/Statistical Finance","Quantitative Finance/Trading and Market Microstructure"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}