{"id":"2408.10426","title":"Random dynamics of solutions for three-dimensional stochastic globally\n  modified Navier-Stokes equations on unbounded Poincar\\'e domains","authors":"Kush Kinra and Manil T. Mohan","authorsParsed":[["Kinra","Kush",""],["Mohan","Manil T.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 21:28:45 GMT"}],"updateDate":"2024-08-21","timestamp":1724102925000,"abstract":"  In this article, we propose a novel version of three-dimensional (3D)\nglobally modified Navier-Stokes (GMNS) system introduced by [Caraballo et. al.,\nAdv. Nonlinear Stud. (2006), 6:411-436], which is very significant from the\nperspective of deterministic as well as stochastic partial differential\nequations. Our focus is on examining a stochastic version of the suggested 3D\nGMNS equations that are perturbed by an infinite-dimensional additive noise. We\ncan consider a rough additive noise (Lebesgue space valued) with this model,\nwhich is not appropriate to consider with the system presented in [Caraballo\net. al., Adv. Nonlinear Stud. (2006), 6:411-436]. One of the technical problems\nassociated with the rough noise is overcome by the use of the corresponding\nCameron-Martin (or reproducing kernel Hilbert) space. This article aims to\naccomplish three objectives. Firstly, we establish the existence and uniqueness\nof weak solutions (in the analytic sense) of the underlying stochastic system\nusing a Doss-Sussman transformation and a primary ingredient Minty-Browder\ntechnique. Secondly, we demonstrate the existence of random attractors for the\nunderlying stochastic system in the natural space of square integrable\ndivergence-free functions. Finally, we show the existence of an invariant\nmeasure for the underlying stochastic system for any viscosity coefficient $\n\\nu > 0 $ and uniqueness of invariant measure for sufficiently large $\\nu$ by\nusing the exponential stability of solutions. A validation of the proposed\nversion of 3D GMNS equations has also been discussed in the appendix by\nestablishing that the sequence of weak solutions of 3D GMNS equations converges\nto a weak solution of 3D Navier-Stokes equations as the modification parameter\ngoes to infinity.\n","subjects":["Mathematics/Probability","Mathematics/Analysis of PDEs"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}