{"id":"2408.06656","title":"MAPPO-PIS: A Multi-Agent Proximal Policy Optimization Method with Prior\n  Intent Sharing for CAVs' Cooperative Decision-Making","authors":"Yicheng Guo, Jiaqi Liu, Rongjie Yu, Peng Hang, Jian Sun","authorsParsed":[["Guo","Yicheng",""],["Liu","Jiaqi",""],["Yu","Rongjie",""],["Hang","Peng",""],["Sun","Jian",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 05:58:47 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 22:02:31 GMT"}],"updateDate":"2024-08-28","timestamp":1723528727000,"abstract":"  Vehicle-to-Vehicle (V2V) technologies have great potential for enhancing\ntraffic flow efficiency and safety. However, cooperative decision-making in\nmulti-agent systems, particularly in complex human-machine mixed merging areas,\nremains challenging for connected and autonomous vehicles (CAVs). Intent\nsharing, a key aspect of human coordination, may offer an effective solution to\nthese decision-making problems, but its application in CAVs is under-explored.\nThis paper presents an intent-sharing-based cooperative method, the Multi-Agent\nProximal Policy Optimization with Prior Intent Sharing (MAPPO-PIS), which\nmodels the CAV cooperative decision-making problem as a Multi-Agent\nReinforcement Learning (MARL) problem. It involves training and updating the\nagents' policies through the integration of two key modules: the Intention\nGenerator Module (IGM) and the Safety Enhanced Module (SEM). The IGM is\nspecifically crafted to generate and disseminate CAVs' intended trajectories\nspanning multiple future time-steps. On the other hand, the SEM serves a\ncrucial role in assessing the safety of the decisions made and rectifying them\nif necessary. Merging area with human-machine mixed traffic flow is selected to\nvalidate our method. Results show that MAPPO-PIS significantly improves\ndecision-making performance in multi-agent systems, surpassing state-of-the-art\nbaselines in safety, efficiency, and overall traffic system performance. The\ncode and video demo can be found at:\n\\url{https://github.com/CCCC1dhcgd/A-MAPPO-PIS}.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}