{"id":"2408.00883","title":"Strategic Coalitions in Networked Contest Games","authors":"Gilberto Diaz-Garcia, Francesco Bullo, Jason R. Marden","authorsParsed":[["Diaz-Garcia","Gilberto",""],["Bullo","Francesco",""],["Marden","Jason R.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 19:25:46 GMT"}],"updateDate":"2024-08-05","timestamp":1722540346000,"abstract":"  In competitive resource allocation formulations multiple agents compete over\ndifferent contests by committing their limited resources in them. For these\nsettings, contest games offer a game-theoretic foundation to analyze how\nplayers can efficiently invest their resources. In this class of games the\nresulting behavior can be affected by external interactions among the players.\nIn particular, players could be able to make coalitions that allow transferring\nresources among them, seeking to improve their outcomes. In this work, we study\nbilateral budgetary transfers in contest games played over networks.\nParticularly, we characterize the family of networks where there exist mutually\nbeneficial bilateral transfer for some set of systems parameters. With this in\nmind, we provide sufficient conditions for the existence of mutually beneficial\ntransfers. Moreover, we provide a constructive argument that guarantees that\nthe benefit of making coalitions only depends on mild connectivity conditions\nof the graph structure. Lastly, we provide a characterization of the\nimprovement of the utilities as a function of the transferred budget. Further,\nwe demonstrate how gradient-based dynamics can be utilized to find desirable\ncoalitional structures. Interestingly, our findings demonstrate that such\ncollaborative opportunities extend well beyond the typical \"enemy-of-my-enemy\"\nalliances.\n","subjects":["Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}