{"id":"2408.06486","title":"Implicit Neural Representation For Accurate CFD Flow Field Prediction","authors":"Laurent de Vito, Nils Pinnau, Simone Dey","authorsParsed":[["de Vito","Laurent",""],["Pinnau","Nils",""],["Dey","Simone",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 20:41:07 GMT"}],"updateDate":"2024-08-14","timestamp":1723495267000,"abstract":"  Despite the plethora of deep learning frameworks for flow field prediction,\nmost of them deal with flow fields on regular domains, and although the best\nones can cope with irregular domains, they mostly rely on graph networks, so\nthat real industrial applications remain currently elusive. We present a deep\nlearning framework for 3D flow field prediction applied to blades of aircraft\nengine turbines and compressors. Crucially, we view any 3D field as a function\nfrom coordinates that is modeled by a neural network we call the backbone-net.\nIt inherits the property of coordinate-based MLPs, namely the\ndiscretization-agnostic representation of flow fields in domains of arbitrary\ntopology at infinite resolution. First, we demonstrate the performance of the\nbackbone-net solo in regressing 3D steady simulations of single blade rows in\nvarious flow regimes: it can accurately render important flow characteristics\nsuch as boundary layers, wakes and shock waves. Second, we introduce a\nhyper-net that maps the surface mesh of a blade to the parameters of the\nbackbone-net. By doing so, the flow solution can be directly predicted from the\nblade geometry, irrespective of its parameterization. Together, backbone-net\nand hyper-net form a highly-accurate memory-efficient data-driven proxy to CFD\nsolvers with good generalization on unseen geometries.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"bnfJ3U7iINa7mH_8rKolpwFe-2TQ5jullCPobYgP_5s","pdfSize":"2513246"}
