{"id":"2408.09913","title":"Crystallite size and microstrain in the structure of SrTiO3 formed by\n  magnetron deposition with and without O2 flow through the deposition chambre","authors":"Zden\\v{e}k Jansa, \\v{S}t\\v{e}p\\'anka Jansov\\'a, Lucie Nedv\\v{e}dov\\'a,\n  J\\'an Min\\'ar","authorsParsed":[["Jansa","Zdeněk",""],["Jansová","Štěpánka",""],["Nedvědová","Lucie",""],["Minár","Ján",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 11:39:03 GMT"}],"updateDate":"2024-08-20","timestamp":1724067543000,"abstract":"  Transition metal oxides, which have a perovskite structure, have received\nmuch attention in recent decades. This is because of the very suitable\nproperties that can be used in various industries. One of the fields where the\nproperties of Perovskites can and have already been applied is in the power\nindustry. Experimental studies of the last few years have reliably demonstrated\nthat, using simple modifications, perovskite oxides can be used in applications\nutilizing direct sunlight and photocatalytic applications. The original\nstrontium titanate oxide SrTiO3 (abbreviated STO) is only able to use the UV\ncomponent of incident radiation and is inactive in visible light, remaining\ntransparent to visible light. The reason for this state is its wide band gap,\nwhich at room temperature has a value of 3.2 - 3.25 eV. Studies have shown that\ndoping the structure of these oxides with transition metals (TM) can cause a\nshift in the valence and/or conduction band. This is because of the 3d dopant\nbands that create new energy levels in the mentioned band gap, effectively\nreducing it. One of the elements of the TM group is nickel. According to some\nstudies, it is likely that the Ni ion occurs in the cubic structure of STO in\nthe form of Ni2+ and substitutes the Ti4+ sites. In the case of using this\ndopant, the shift of the absorption edge of STO:Nix relative to NiO was found\nto be 1.1 eV. The present work investigates the differences in the structure of\nSTO:Nix prepared by magnetron deposition method with different dopant amount\nsettings. At the same time, the difference in structure was observed when\nprepared under vacuum with Ar working gas and when O2 was flowed through the\ndeposition chamber. The premise of this experiment was to verify the formation\nof oxygen vacancies in the STO structure on which the photocatalytic phenomenon\ncould occur.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}