{"id":"2408.02310","title":"On the Robustness of Malware Detectors to Adversarial Samples","authors":"Muhammad Salman and Benjamin Zi Hao Zhao and Hassan Jameel Asghar and\n  Muhammad Ikram and Sidharth Kaushik and Mohamed Ali Kaafar","authorsParsed":[["Salman","Muhammad",""],["Zhao","Benjamin Zi Hao",""],["Asghar","Hassan Jameel",""],["Ikram","Muhammad",""],["Kaushik","Sidharth",""],["Kaafar","Mohamed Ali",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 08:41:07 GMT"}],"updateDate":"2024-08-06","timestamp":1722847267000,"abstract":"  Adversarial examples add imperceptible alterations to inputs with the\nobjective to induce misclassification in machine learning models. They have\nbeen demonstrated to pose significant challenges in domains like image\nclassification, with results showing that an adversarially perturbed image to\nevade detection against one classifier is most likely transferable to other\nclassifiers. Adversarial examples have also been studied in malware analysis.\nUnlike images, program binaries cannot be arbitrarily perturbed without\nrendering them non-functional. Due to the difficulty of crafting adversarial\nprogram binaries, there is no consensus on the transferability of adversarially\nperturbed programs to different detectors. In this work, we explore the\nrobustness of malware detectors against adversarially perturbed malware. We\ninvestigate the transferability of adversarial attacks developed against one\ndetector, against other machine learning-based malware detectors, and code\nsimilarity techniques, specifically, locality sensitive hashing-based\ndetectors. Our analysis reveals that adversarial program binaries crafted for\none detector are generally less effective against others. We also evaluate an\nensemble of detectors and show that they can potentially mitigate the impact of\nadversarial program binaries. Finally, we demonstrate that substantial program\nchanges made to evade detection may result in the transformation technique\nbeing identified, implying that the adversary must make minimal changes to the\nprogram binary.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nVHEcvtWgqKh2Z062X20dSoVah-C5OsNuhcwrj6WgAo","pdfSize":"569073"}
