{"id":"2408.02756","title":"CHARA Near-Infrared Imaging of the Yellow Hypergiant Star $\\rho$\n  Cassiopeiae: Convection Cells and Circumstellar Envelope","authors":"Narsireddy Anugu, Fabien Baron, John D. Monnier, Douglas R. Gies,\n  Rachael M. Roettenbacher, Gail H. Schaefer, Miguel Montarg\\`es, Stefan Kraus,\n  Jean-Baptiste Le Bouquin, Matthew D. Anderson, Theo ten Brummelaar, Isabelle\n  Codron, Christopher D. Farrington, Tyler Gardner, Mayra Gutierrez, Rainer\n  K\\\"ohler, Cyprien Lanthermann, Ryan Norris, Nicholas J. Scott, Benjamin R.\n  Setterholm, Norman L. Vargas","authorsParsed":[["Anugu","Narsireddy",""],["Baron","Fabien",""],["Monnier","John D.",""],["Gies","Douglas R.",""],["Roettenbacher","Rachael M.",""],["Schaefer","Gail H.",""],["Montargès","Miguel",""],["Kraus","Stefan",""],["Bouquin","Jean-Baptiste Le",""],["Anderson","Matthew D.",""],["Brummelaar","Theo ten",""],["Codron","Isabelle",""],["Farrington","Christopher D.",""],["Gardner","Tyler",""],["Gutierrez","Mayra",""],["Köhler","Rainer",""],["Lanthermann","Cyprien",""],["Norris","Ryan",""],["Scott","Nicholas J.",""],["Setterholm","Benjamin R.",""],["Vargas","Norman L.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 18:18:51 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 04:06:32 GMT"}],"updateDate":"2024-08-08","timestamp":1722881931000,"abstract":"  Massive evolved stars such as red supergiants and hypergiants are potential\nprogenitors of Type II supernovae, and they are known for ejecting substantial\namounts of matter, up to half their initial mass, during their final\nevolutionary phases. The rate and mechanism of this mass loss play a crucial\nrole in determining their ultimate fate and the likelihood of their progression\nto supernovae. However, the exact mechanisms driving this mass ejection have\nlong been a subject of research. Recent observations, such as the Great Dimming\nof Betelgeuse, have suggested that the activity of large convective cells,\ncombined with pulsation, could be a plausible explanation for such mass loss\nevents. In this context, we conducted interferometric observations of the\nfamous yellow hypergiant, $\\rho$ Cassiopeiae using the CHARA Array in H and\nK-band wavelengths. $\\rho$ Cas is well known for its recurrent eruptions,\ncharacterized by periods of visual dimming ($\\sim$1.5-2 mag) followed by\nrecovery. From our observations, we derived the diameter of the limb-darkened\ndisk and found that this star has a radius of $1.04\\pm0.01$ milliarcseconds\n(mas), or $564 - 700 R_\\odot$. We performed image reconstructions with three\ndifferent image reconstruction software packages, and they unveiled the\npresence of giant hot and cold spots on the stellar surface. We interpret these\nprominent hot spots as giant convection cells, suggesting a possible connection\nto mass ejections from the star's envelope. Furthermore, we detected spectral\nCO emission lines in the K-band ($\\lambda=2.31-2.38 \\mu$m), and the image\nreconstructions in these spectral lines revealed an extended circumstellar\nenvelope with a radius of $1.45\\pm0.10$ mas.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}