{"id":"2408.11739","title":"Network-based diversification of stock and cryptocurrency portfolios","authors":"Dimitar Kitanovski, Igor Mishkovski, Viktor Stojkoski, and Miroslav\n  Mirchev","authorsParsed":[["Kitanovski","Dimitar",""],["Mishkovski","Igor",""],["Stojkoski","Viktor",""],["Mirchev","Miroslav",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 16:04:06 GMT"}],"updateDate":"2024-08-22","timestamp":1724256246000,"abstract":"  Maintaining a balance between returns and volatility is a common strategy for\nportfolio diversification, whether investing in traditional equities or digital\nassets like cryptocurrencies. One approach for diversification is the\napplication of community detection or clustering, using a network representing\nthe relationships between assets. We examine two network representations, one\nbased on a standard distance matrix based on correlation, and another based on\nmutual information. The Louvain and Affinity propagation algorithms were\nemployed for finding the network communities (clusters) based on annual data.\nFurthermore, we examine building assets' co-occurrence networks, where\ncommunities are detected for each month throughout a whole year and then the\nlinks represent how often assets belong to the same community. Portfolios are\nthen constructed by selecting several assets from each community based on local\nproperties (degree centrality), global properties (closeness centrality), or\nexplained variance (Principal component analysis), with three value ranges\n(max, med, min), calculated on a maximal spanning tree or a fully connected\ncommunity sub-graph. We explored these various strategies on data from the S\\&P\n500 and the Top 203 cryptocurrencies with a market cap above 2M USD in the\nperiod from Jan 2019 to Sep 2022. Moreover, we study into more details the\nperiods of the beginning of the COVID-19 outbreak and the start of the war in\nUkraine. The results confirm some of the previous findings already known for\ntraditional stock markets and provide some further insights, while they reveal\nan opposing trend in the crypto-assets market.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics","Quantitative Finance/Portfolio Management"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}