{"id":"2408.12422","title":"Advancing Strategic Planning and Dynamic Control of Complex Projects","authors":"L. G. Teuber, H. J. van Heukelum, A. R. M. Wolfert","authorsParsed":[["Teuber","L. G.",""],["van Heukelum","H. J.",""],["Wolfert","A. R. M.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 14:16:14 GMT"}],"updateDate":"2024-08-23","timestamp":1724336174000,"abstract":"  Strategic project planning and dynamic control is essential for ensuring\ncomplex projects to be executed best-fit for common purpose. When\nbest-for-project strategies are no longer conceivable for humans, there is a\nneed for effective and efficient computer-aided decision support. To this end,\nstandard simulation-driven evaluation and a-posteriori decision-making is often\nused instead of a combined simulation and optimisation approach that a-priori\nintegrates the stakeholders goal orientation and risk management into a\nbest-fit design solution. However, recently developed state-of-the-art planning\nand control methodologies that do already incorporate this integration still\nlack a stochastic representation and/or an associative multi-objective\napproach. This paper presents a new project management methodology, called\nOdycon (Open design and dynamic control), which dissolves the aforementioned\nshortcomings. To enable this, a generic mathematical statement is first\nformulated for project planning and dynamic control uniting technical\nlogistical) capabilities, human goal-oriented behaviour, and stakeholders\ninterests. Then, both Monte-Carlo simulation (MCS) and the Integrative\nMaximisation of Aggregated Preferences (IMAP) optimisation method are combined,\nresulting in a best-fit strategic planning and dynamic control methodology.\nOdycons use and added value are demonstrated for two applications: (1) a pure\nstrategic planning of an offshore wind installation project, and (2) a pure\ndynamic control of a highway infrastructure construction project. Both\napplications demonstrate Odycons advances in concurrent and associative design\nand decision-making, offering best-fit for common purpose synthesis for\ndifferent complex project phases.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"U3xwZufe5e7-_d54My2jvqwoT6kNgAxdpJ7Xbytv8tI","pdfSize":"6578730"}
