{"id":"2408.13125","title":"A tour d'horizon of de Casteljau's work","authors":"Andreas M\\\"uller","authorsParsed":[["Müller","Andreas",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 11:18:20 GMT"}],"updateDate":"2024-08-26","timestamp":1724152700000,"abstract":"  Whilst Paul de Casteljau is now famous for his fundamental algorithm of curve\nand surface approximation, little is known about his other findings. This\narticle offers an insight into his results in geometry, algebra and number\ntheory.\n  Related to geometry, his classical algorithm is reviewed as an index\nreduction of a polar form. This idea is used to show de Casteljau's algebraic\nway of smoothing, which long went unnoticed. We will also see an analytic polar\nform and its use in finding the intersection of two curves. The article\nsummarises unpublished material on metric geometry. It includes theoretical\nadvances, e.g., the 14-point strophoid or a way to link Apollonian circles with\nconfocal conics, and also practical applications such as a recurrence for\nconjugate mirrors in geometric optics. A view on regular polygons leads to an\napproximation of their diagonals by golden matrices, a generalisation of the\ngolden ratio.\n  Relevant algebraic findings include matrix quaternions (and anti-quaternions)\nand their link with Lorentz' equations. De Casteljau generalised the Euclidean\nalgorithm and developed an automated method for approximating the roots of a\nclass of polynomial equations. His contributions to number theory not only\ninclude aspects on the sum of four squares as in quaternions, but also a view\non a particular sum of three cubes. After a review of a complete quadrilateral\nin a heptagon and its angles, the paper concludes with a summary of de\nCasteljau's key achievements.\n  The article contains a comprehensive bibliography of de Casteljau's works,\nincluding previously unpublished material.\n","subjects":["Mathematics/History and Overview","Computing Research Repository/Numerical Analysis","Mathematics/Algebraic Geometry","Mathematics/Metric Geometry","Mathematics/Numerical Analysis","Mathematics/Number Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}