{"id":"2408.10854","title":"MambaDS: Near-Surface Meteorological Field Downscaling with Topography\n  Constrained Selective State Space Modeling","authors":"Zili Liu and Hao Chen and Lei Bai and Wenyuan Li and Wanli Ouyang and\n  Zhengxia Zou and Zhenwei Shi","authorsParsed":[["Liu","Zili",""],["Chen","Hao",""],["Bai","Lei",""],["Li","Wenyuan",""],["Ouyang","Wanli",""],["Zou","Zhengxia",""],["Shi","Zhenwei",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 13:45:49 GMT"}],"updateDate":"2024-08-21","timestamp":1724161549000,"abstract":"  In an era of frequent extreme weather and global warming, obtaining precise,\nfine-grained near-surface weather forecasts is increasingly essential for human\nactivities. Downscaling (DS), a crucial task in meteorological forecasting,\nenables the reconstruction of high-resolution meteorological states for target\nregions from global-scale forecast results. Previous downscaling methods,\ninspired by CNN and Transformer-based super-resolution models, lacked tailored\ndesigns for meteorology and encountered structural limitations. Notably, they\nfailed to efficiently integrate topography, a crucial prior in the downscaling\nprocess. In this paper, we address these limitations by pioneering the\nselective state space model into the meteorological field downscaling and\npropose a novel model called MambaDS. This model enhances the utilization of\nmultivariable correlations and topography information, unique challenges in the\ndownscaling process while retaining the advantages of Mamba in long-range\ndependency modeling and linear computational complexity. Through extensive\nexperiments in both China mainland and the continental United States (CONUS),\nwe validated that our proposed MambaDS achieves state-of-the-art results in\nthree different types of meteorological field downscaling settings. We will\nrelease the code subsequently.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}