{"id":"2408.09117","title":"LOID: Lane Occlusion Inpainting and Detection for Enhanced Autonomous\n  Driving Systems","authors":"Aayush Agrawal, Ashmitha Jaysi Sivakumar, Ibrahim Kaif, Chayan\n  Banerjee","authorsParsed":[["Agrawal","Aayush",""],["Sivakumar","Ashmitha Jaysi",""],["Kaif","Ibrahim",""],["Banerjee","Chayan",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 06:55:40 GMT"}],"updateDate":"2024-08-20","timestamp":1723877740000,"abstract":"  Accurate lane detection is essential for effective path planning and lane\nfollowing in autonomous driving, especially in scenarios with significant\nocclusion from vehicles and pedestrians. Existing models often struggle under\nsuch conditions, leading to unreliable navigation and safety risks. We propose\ntwo innovative approaches to enhance lane detection in these challenging\nenvironments, each showing notable improvements over current methods.\n  The first approach aug-Segment improves conventional lane detection models by\naugmenting the training dataset of CULanes with simulated occlusions and\ntraining a segmentation model. This method achieves a 12% improvement over a\nnumber of SOTA models on the CULanes dataset, demonstrating that enriched\ntraining data can better handle occlusions, however, since this model lacked\nrobustness to certain settings, our main contribution is the second approach,\nLOID Lane Occlusion Inpainting and Detection. LOID introduces an advanced lane\ndetection network that uses an image processing pipeline to identify and mask\nocclusions. It then employs inpainting models to reconstruct the road\nenvironment in the occluded areas. The enhanced image is processed by a lane\ndetection algorithm, resulting in a 20% & 24% improvement over several SOTA\nmodels on the BDDK100 and CULanes datasets respectively, highlighting the\neffectiveness of this novel technique.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"v_6rsF6SVxRf7MocITAuCEZ8T8O8o4v3ydZ5y8MD_sM","pdfSize":"5242941"}
