{"id":"2408.13162","title":"A latent space model for multivariate count data time series analysis","authors":"Hardeep Kaur and Riccardo Rastelli","authorsParsed":[["Kaur","Hardeep",""],["Rastelli","Riccardo",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 15:35:37 GMT"}],"updateDate":"2024-08-26","timestamp":1724427337000,"abstract":"  Motivated by a dataset of burglaries in Chicago, USA, we introduce a novel\nframework to analyze time series of count data combining common multivariate\ntime series models with latent position network models. This novel methodology\nallows us to gain a new latent variable perspective on the crime dataset that\nwe consider, allowing us to disentangle and explain the complex patterns\nexhibited by the data, while providing a natural time series framework that can\nbe used to make future predictions. Our model is underpinned by two well known\nstatistical approaches: a log-linear vector autoregressive model, which is\nprominent in the literature on multivariate count time series, and a latent\nprojection model, which is a popular latent variable model for networks. The\nrole of the projection model is to characterize the interaction parameters of\nthe vector autoregressive model, thus uncovering the underlying network that is\nassociated with the pairwise relationships between the time series. Estimation\nand inferential procedures are performed using an optimization algorithm and a\nHamiltonian Monte Carlo procedure for efficient Bayesian inference. We also\ninclude a simulation study to illustrate the merits of our methodology in\nrecovering consistent parameter estimates, and in making accurate future\npredictions for the time series. As we demonstrate in our application to the\ncrime dataset, this new methodology can provide very meaningful model-based\ninterpretations of the data, and it can be generalized to other time series\ncontexts and applications.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}