{"id":"2408.08609","title":"Fast Network Recovery from Large-Scale Disasters: A Resilient and\n  Self-Organizing RAN Framework","authors":"M. Yaser Yagan, Sefa Kayraklik, Samed Kesir, Gizem Sumen, Ibrahim\n  Hokelek, Mehmet Basaran, George C. Alexandropoulos, Ertugrul Basar, Cicek\n  Cavdar, Huseyin Arslan, and Ali Gorcin","authorsParsed":[["Yagan","M. Yaser",""],["Kayraklik","Sefa",""],["Kesir","Samed",""],["Sumen","Gizem",""],["Hokelek","Ibrahim",""],["Basaran","Mehmet",""],["Alexandropoulos","George C.",""],["Basar","Ertugrul",""],["Cavdar","Cicek",""],["Arslan","Huseyin",""],["Gorcin","Ali",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 08:50:05 GMT"}],"updateDate":"2024-08-19","timestamp":1723798205000,"abstract":"  Extreme natural phenomena are occurring more frequently everyday in the\nworld, challenging, among others, the infrastructure of communication networks.\nFor instance, the devastating earthquakes in Turkiye in early 2023 showcased\nthat, although communications became an imminent priority, existing mobile\ncommunication systems fell short with the operational requirements of harsh\ndisaster environments. In this article, we present a novel framework for\nrobust, resilient, adaptive, and open source sixth generation (6G) radio access\nnetworks (Open6GRAN) that can provide uninterrupted communication services in\nthe face of natural disasters and other disruptions. Advanced 6G technologies,\nsuch as reconfigurable intelligent surfaces (RISs), cell-free\nmultiple-input-multiple-output, and joint communications and sensing with\nincreasingly heterogeneous deployment, consisting of terrestrial and\nnon-terrestrial nodes, are robustly integrated. We advocate that a key enabler\nto develop service and management orchestration with fast recovery capabilities\nwill rely on an artificial-intelligence-based radio access network (RAN)\ncontroller. To support the emergency use case spanning a larger area, the\nintegration of aerial and space segments with the terrestrial network promises\na rapid and reliable response in the case of any disaster. A proof-of-concept\nthat rapidly reconfigures an RIS for performance enhancement under an emergency\nscenario is presented and discussed.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"FXXo1Ao_Q_0j2WbC2kPDncG1uEpPpywVwqc6BCxHUOY","pdfSize":"1074082"}
