{"id":"2408.12037","title":"FUSELOC: Fusing Global and Local Descriptors to Disambiguate 2D-3D\n  Matching in Visual Localization","authors":"Son Tung Nguyen, Alejandro Fontan, Michael Milford, Tobias Fischer","authorsParsed":[["Nguyen","Son Tung",""],["Fontan","Alejandro",""],["Milford","Michael",""],["Fischer","Tobias",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 23:42:16 GMT"}],"updateDate":"2024-08-23","timestamp":1724283736000,"abstract":"  Hierarchical methods represent state-of-the-art visual localization,\noptimizing search efficiency by using global descriptors to focus on relevant\nmap regions. However, this state-of-the-art performance comes at the cost of\nsubstantial memory requirements, as all database images must be stored for\nfeature matching. In contrast, direct 2D-3D matching algorithms require\nsignificantly less memory but suffer from lower accuracy due to the larger and\nmore ambiguous search space. We address this ambiguity by fusing local and\nglobal descriptors using a weighted average operator within a 2D-3D search\nframework. This fusion rearranges the local descriptor space such that\ngeographically nearby local descriptors are closer in the feature space\naccording to the global descriptors. Therefore, the number of irrelevant\ncompeting descriptors decreases, specifically if they are geographically\ndistant, thereby increasing the likelihood of correctly matching a query\ndescriptor. We consistently improve the accuracy over local-only systems and\nachieve performance close to hierarchical methods while halving memory\nrequirements. Extensive experiments using various state-of-the-art local and\nglobal descriptors across four different datasets demonstrate the effectiveness\nof our approach. For the first time, our approach enables direct matching\nalgorithms to benefit from global descriptors while maintaining memory\nefficiency. The code for this paper will be published at\n\\href{https://github.com/sontung/descriptor-disambiguation}{github.com/sontung/descriptor-disambiguation}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/"}