{"id":"2408.03934","title":"From Words to Worth: Newborn Article Impact Prediction with LLM","authors":"Penghai Zhao, Qinghua Xing, Kairan Dou, Jinyu Tian, Ying Tai, Jian\n  Yang, Ming-Ming Cheng, Xiang Li","authorsParsed":[["Zhao","Penghai",""],["Xing","Qinghua",""],["Dou","Kairan",""],["Tian","Jinyu",""],["Tai","Ying",""],["Yang","Jian",""],["Cheng","Ming-Ming",""],["Li","Xiang",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 17:52:02 GMT"}],"updateDate":"2024-08-08","timestamp":1723053122000,"abstract":"  As the academic landscape expands, the challenge of efficiently identifying\npotentially high-impact articles among the vast number of newly published works\nbecomes critical. This paper introduces a promising approach, leveraging the\ncapabilities of fine-tuned LLMs to predict the future impact of newborn\narticles solely based on titles and abstracts. Moving beyond traditional\nmethods heavily reliant on external information, the proposed method discerns\nthe shared semantic features of highly impactful papers from a large collection\nof title-abstract and potential impact pairs. These semantic features are\nfurther utilized to regress an improved metric, TNCSI_SP, which has been\nendowed with value, field, and time normalization properties. Additionally, a\ncomprehensive dataset has been constructed and released for fine-tuning the\nLLM, containing over 12,000 entries with corresponding titles, abstracts, and\nTNCSI_SP. The quantitative results, with an NDCG@20 of 0.901, demonstrate that\nthe proposed approach achieves state-of-the-art performance in predicting the\nimpact of newborn articles when compared to competitive counterparts. Finally,\nwe demonstrate a real-world application for predicting the impact of newborn\njournal articles to demonstrate its noteworthy practical value. Overall, our\nfindings challenge existing paradigms and propose a shift towards a more\ncontent-focused prediction of academic impact, offering new insights for\nassessing newborn article impact.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6RmcfWyv_u_OIeVYzTDumsXgOA4bSsSWlGoSqYRii1Q","pdfSize":"614948"}
