{"id":"2408.01996","title":"Configuring Safe Spiking Neural Controllers for Cyber-Physical Systems\n  through Formal Verification","authors":"Arkaprava Gupta, Sumana Ghosh, Ansuman Banerjee and Swarup Kumar\n  Mohalik","authorsParsed":[["Gupta","Arkaprava",""],["Ghosh","Sumana",""],["Banerjee","Ansuman",""],["Mohalik","Swarup Kumar",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 11:46:20 GMT"}],"updateDate":"2024-08-06","timestamp":1722771980000,"abstract":"  Spiking Neural Networks (SNNs) are a subclass of neuromorphic models that\nhave great potential to be used as controllers in Cyber-Physical Systems (CPSs)\ndue to their energy efficiency. They can benefit from the prevalent approach of\nfirst training an Artificial Neural Network (ANN) and then translating to an\nSNN with subsequent hyperparameter tuning. The tuning is required to ensure\nthat the resulting SNN is accurate with respect to the ANN in terms of metrics\nlike Mean Squared Error (MSE). However, SNN controllers for safety-critical\nCPSs must also satisfy safety specifications, which are not guaranteed by the\nconversion approach. In this paper, we propose a solution which tunes the\n$temporal$ $window$ hyperparameter of the translated SNN to ensure both\naccuracy and compliance with the safe range specification that requires the SNN\noutputs to remain within a safe range. The core verification problem is\nmodelled using mixed-integer linear programming (MILP) and is solved with\nGurobi. When the controller fails to meet the range specification, we compute\ntight bounds on the SNN outputs as feedback for the CPS developer. To mitigate\nthe high computational cost of verification, we integrate data-driven steps to\nminimize verification calls. Our approach provides designers with the\nconfidence to safely integrate energy-efficient SNN controllers into modern\nCPSs. We demonstrate our approach with experimental results on five different\nbenchmark neural controllers.\n","subjects":["Computing Research Repository/Emerging Technologies","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}