{"id":"2408.10529","title":"Automated Detection of Algorithm Debt in Deep Learning Frameworks: An\n  Empirical Study","authors":"Emmanuel Iko-Ojo Simon, Chirath Hettiarachchi, Alex Potanin, Hanna\n  Suominen, Fatemeh Fard","authorsParsed":[["Simon","Emmanuel Iko-Ojo",""],["Hettiarachchi","Chirath",""],["Potanin","Alex",""],["Suominen","Hanna",""],["Fard","Fatemeh",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 04:06:58 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 07:12:27 GMT"},{"version":"v3","created":"Thu, 22 Aug 2024 03:40:50 GMT"}],"updateDate":"2024-08-23","timestamp":1724126818000,"abstract":"  Context: Previous studies demonstrate that Machine or Deep Learning (ML/DL)\nmodels can detect Technical Debt from source code comments called Self-Admitted\nTechnical Debt (SATD). Despite the importance of ML/DL in software development,\nlimited studies focus on automated detection for new SATD types: Algorithm Debt\n(AD). AD detection is important because it helps to identify TD early,\nfacilitating research, learning, and preventing the accumulation of issues\nrelated to model degradation and lack of scalability. Aim: Our goal is to\nimprove AD detection performance of various ML/DL models. Method: We will\nperform empirical studies using approaches: TF-IDF, Count Vectorizer, Hash\nVectorizer, and TD-indicative words to identify features that improve AD\ndetection, using ML/DL classifiers with different data featurisations. We will\nuse an existing dataset curated from seven DL frameworks where comments were\nmanually classified as AD, Compatibility, Defect, Design, Documentation,\nRequirement, and Test Debt. We will explore various word embedding methods to\nfurther enrich features for ML models. These embeddings will be from models\nfounded in DL such as ROBERTA, ALBERTv2, and large language models (LLMs):\nINSTRUCTOR and VOYAGE AI. We will enrich the dataset by incorporating\nAD-related terms, then train various ML/DL classifiers, Support Vector Machine,\nLogistic Regression, Random Forest, ROBERTA, and ALBERTv2.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/"}