{"id":"2408.13933","title":"MobileQuant: Mobile-friendly Quantization for On-device Language Models","authors":"Fuwen Tan, Royson Lee, {\\L}ukasz Dudziak, Shell Xu Hu, Sourav\n  Bhattacharya, Timothy Hospedales, Georgios Tzimiropoulos, Brais Martinez","authorsParsed":[["Tan","Fuwen",""],["Lee","Royson",""],["Dudziak","Łukasz",""],["Hu","Shell Xu",""],["Bhattacharya","Sourav",""],["Hospedales","Timothy",""],["Tzimiropoulos","Georgios",""],["Martinez","Brais",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 20:41:22 GMT"}],"updateDate":"2024-08-27","timestamp":1724618482000,"abstract":"  Large language models (LLMs) have revolutionized language processing,\ndelivering outstanding results across multiple applications. However, deploying\nLLMs on edge devices poses several challenges with respect to memory, energy,\nand compute costs, limiting their widespread use in devices such as mobile\nphones. A promising solution is to reduce the number of bits used to represent\nweights and activations. While existing works have found partial success at\nquantizing LLMs to lower bitwidths, e.g. 4-bit weights, quantizing activations\nbeyond 16 bits often leads to large computational overheads due to poor\non-device quantization support, or a considerable accuracy drop. Yet, 8-bit\nactivations are very attractive for on-device deployment as they would enable\nLLMs to fully exploit mobile-friendly hardware, e.g. Neural Processing Units\n(NPUs). In this work, we make a first attempt to facilitate the on-device\ndeployment of LLMs using integer-only quantization. We first investigate the\nlimitations of existing quantization methods for on-device deployment, with a\nspecial focus on activation quantization. We then address these limitations by\nintroducing a simple post-training quantization method, named MobileQuant, that\nextends previous weight equivalent transformation works by jointly optimizing\nthe weight transformation and activation range parameters in an end-to-end\nmanner. MobileQuant demonstrates superior capabilities over existing methods by\n1) achieving near-lossless quantization on a wide range of LLM benchmarks, 2)\nreducing latency and energy consumption by 20\\%-50\\% compared to current\non-device quantization strategies, 3) requiring limited compute budget, 4)\nbeing compatible with mobile-friendly compute units, e.g. NPU.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"67PsQsm6LCNFNOmMX5Oc3EjKzMIcw0i1WflpmOIUfAc","pdfSize":"437486"}
