{"id":"2408.06880","title":"Architecture Specific Generation of Large Scale Lattice Boltzmann\n  Methods for Sparse Complex Geometries","authors":"Philipp Suffa, Markus Holzer, Harald K\\\"ostler and Ulrich R\\\"ude","authorsParsed":[["Suffa","Philipp",""],["Holzer","Markus",""],["Köstler","Harald",""],["Rüde","Ulrich",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 13:26:38 GMT"}],"updateDate":"2024-08-14","timestamp":1723555598000,"abstract":"  We implement and analyse a sparse / indirect-addressing data structure for\nthe Lattice Boltzmann Method to support efficient compute kernels for fluid\ndynamics problems with a high number of non-fluid nodes in the domain, such as\nin porous media flows. The data structure is integrated into a code generation\npipeline to enable sparse Lattice Boltzmann Methods with a variety of stencils\nand collision operators and to generate efficient code for kernels for CPU as\nwell as for AMD and NVIDIA accelerator cards. We optimize these sparse kernels\nwith an in-place streaming pattern to save memory accesses and memory\nconsumption and we implement a communication hiding technique to prove\nscalability. We present single GPU performance results with up to 99% of\nmaximal bandwidth utilization. We integrate the optimized generated kernels in\nthe high performance framework WALBERLA and achieve a scaling efficiency of at\nleast 82% on up to 1024 NVIDIA A100 GPUs and up to 4096 AMD MI250X GPUs on\nmodern HPC systems. Further, we set up three different applications to test the\nsparse data structure for realistic demonstrator problems. We show performance\nresults for flow through porous media, free flow over a particle bed, and blood\nflow in a coronary artery. We achieve a maximal performance speed-up of 2 and a\nsignificantly reduced memory consumption by up to 75% with the sparse /\nindirect-addressing data structure compared to the direct-addressing data\nstructure for these applications.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Performance"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7sk0r6SC8nlJABZmZdfsd3-M5jMLrw0pJnZ0y4O0HEA","pdfSize":"4243537"}
