{"id":"2408.00666","title":"A closer look at dwarf galaxies exhibiting MIR variability: AGN\n  confirmation and comparison with non-variable dwarf galaxies","authors":"Archana Aravindan, Gabriela Canalizo, Nathan Secrest, Shobita\n  Satyapal, Thomas Bohn","authorsParsed":[["Aravindan","Archana",""],["Canalizo","Gabriela",""],["Secrest","Nathan",""],["Satyapal","Shobita",""],["Bohn","Thomas",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 16:03:18 GMT"}],"updateDate":"2024-08-02","timestamp":1722528198000,"abstract":"  Detecting active black holes in dwarf galaxies has proven to be a challenge\ndue to their small size and weak electromagnetic signatures. Mid-infrared\nvariability has emerged as a promising tool that can be used to detect active\nlow-mass black holes in dwarf galaxies. We analyzed 10.4 years of photometry\nfrom the ALL$WISE$/NEO$WISE$ multi-epoch catalogs, identifying 25 objects with\nAGN-like variability. Independent confirmation of AGN activity was found in 68%\nof these objects using optical and near-infrared diagnostics. Notably, we\ndiscovered a near-infrared coronal line [S IX] $\\lambda$ 1.252 $\\mu$m in J1205,\nthe galaxy with the lowest stellar mass (log M$_{*}$ = 7.5 M$_{\\odot}$) and low\nmetallicity (12 + log(O/H) = 7.46) in our sample. Additionally, we found broad\nPa$\\alpha$ potentially from the BLR in two targets, and their implied black\nhole masses are consistent with black hole-stellar mass relations. Comparing\nnon-variable galaxies with similar stellar masses and $WISE$ $W1-W2$ colors, we\nfound no clear trends between variability and large-scale galaxy properties.\nHowever, we found that AGN activity likely causes redder $W1-W2$ colors in\nvariable targets, while for the non-variable galaxies, the contribution stems\nfrom strong star formation activity. A high incidence of optical broad lines\nwas also observed in variable targets. Our results suggest that mid-infrared\nvariability is an effective method for detecting AGN activity in low-mass\ngalaxies and can help uncover a larger sample of active low-mass ($<$ 10$^{6}$\nM$_{\\odot}$) black holes in the universe.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}