{"id":"2408.14499","title":"SHEDAD: SNN-Enhanced District Heating Anomaly Detection for Urban\n  Substations","authors":"Jonne van Dreven, Abbas Cheddad, Sadi Alawadi, Ahmad Nauman Ghazi, Jad\n  Al Koussa and Dirk Vanhoudt","authorsParsed":[["van Dreven","Jonne",""],["Cheddad","Abbas",""],["Alawadi","Sadi",""],["Ghazi","Ahmad Nauman",""],["Koussa","Jad Al",""],["Vanhoudt","Dirk",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 19:25:41 GMT"}],"updateDate":"2024-08-28","timestamp":1724441141000,"abstract":"  District Heating (DH) systems are essential for energy-efficient urban\nheating. However, despite the advancements in automated fault detection and\ndiagnosis (FDD), DH still faces challenges in operational faults that impact\nefficiency. This study introduces the Shared Nearest Neighbor Enhanced District\nHeating Anomaly Detection (SHEDAD) approach, designed to approximate the DH\nnetwork topology and allow for local anomaly detection without disclosing\nsensitive information, such as substation locations. The approach leverages a\nmulti-adaptive k-Nearest Neighbor (k-NN) graph to improve the initial\nneighborhood creation. Moreover, it introduces a merging technique that reduces\nnoise and eliminates trivial edges. We use the Median Absolute Deviation (MAD)\nand modified z-scores to flag anomalous substations. The results reveal that\nSHEDAD outperforms traditional clustering methods, achieving significantly\nlower intra-cluster variance and distance. Additionally, SHEDAD effectively\nisolates and identifies two distinct categories of anomalies: supply\ntemperatures and substation performance. We identified 30 anomalous substations\nand reached a sensitivity of approximately 65\\% and specificity of\napproximately 97\\%. By focusing on this subset of poor-performing substations\nin the network, SHEDAD enables more targeted and effective maintenance\ninterventions, which can reduce energy usage while optimizing network\nperformance.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"099aJlZJZkNB6o4xPFM7CadJb_n1VMKu3DHDiDD-rTI","pdfSize":"2802511"}
