{"id":"2408.00804","title":"ChipExpert: The Open-Source Integrated-Circuit-Design-Specific Large\n  Language Model","authors":"Ning Xu, Zhaoyang Zhang, Lei Qi, Wensuo Wang, Chao Zhang, Zihao Ren,\n  Huaiyuan Zhang, Xin Cheng, Yanqi Zhang, Zhichao Liu, Qingwen Wei, Shiyang Wu,\n  Lanlan Yang, Qianfeng Lu, Yiqun Ma, Mengyao Zhao, Junbo Liu, Yufan Song, Xin\n  Geng, Jun Yang","authorsParsed":[["Xu","Ning",""],["Zhang","Zhaoyang",""],["Qi","Lei",""],["Wang","Wensuo",""],["Zhang","Chao",""],["Ren","Zihao",""],["Zhang","Huaiyuan",""],["Cheng","Xin",""],["Zhang","Yanqi",""],["Liu","Zhichao",""],["Wei","Qingwen",""],["Wu","Shiyang",""],["Yang","Lanlan",""],["Lu","Qianfeng",""],["Ma","Yiqun",""],["Zhao","Mengyao",""],["Liu","Junbo",""],["Song","Yufan",""],["Geng","Xin",""],["Yang","Jun",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 11:00:08 GMT"}],"updateDate":"2024-08-05","timestamp":1721991608000,"abstract":"  The field of integrated circuit (IC) design is highly specialized, presenting\nsignificant barriers to entry and research and development challenges. Although\nlarge language models (LLMs) have achieved remarkable success in various\ndomains, existing LLMs often fail to meet the specific needs of students,\nengineers, and researchers. Consequently, the potential of LLMs in the IC\ndesign domain remains largely unexplored. To address these issues, we introduce\nChipExpert, the first open-source, instructional LLM specifically tailored for\nthe IC design field. ChipExpert is trained on one of the current best\nopen-source base model (Llama-3 8B). The entire training process encompasses\nseveral key stages, including data preparation, continue pre-training,\ninstruction-guided supervised fine-tuning, preference alignment, and\nevaluation. In the data preparation stage, we construct multiple high-quality\ncustom datasets through manual selection and data synthesis techniques. In the\nsubsequent two stages, ChipExpert acquires a vast amount of IC design knowledge\nand learns how to respond to user queries professionally. ChipExpert also\nundergoes an alignment phase, using Direct Preference Optimization, to achieve\na high standard of ethical performance. Finally, to mitigate the hallucinations\nof ChipExpert, we have developed a Retrieval-Augmented Generation (RAG) system,\nbased on the IC design knowledge base. We also released the first IC design\nbenchmark ChipICD-Bench, to evaluate the capabilities of LLMs across multiple\nIC design sub-domains. Through comprehensive experiments conducted on this\nbenchmark, ChipExpert demonstrated a high level of expertise in IC design\nknowledge Question-and-Answer tasks.\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}