{"id":"2408.02187","title":"Noise Suppression for CRP Gathers Based on Self2Self with Dropout","authors":"Fei Li, Zhenbin Xia, Dawei Liu, Xiaokai Wang, Wenchao Chen, Juan Chen,\n  and Leiming Xu","authorsParsed":[["Li","Fei",""],["Xia","Zhenbin",""],["Liu","Dawei",""],["Wang","Xiaokai",""],["Chen","Wenchao",""],["Chen","Juan",""],["Xu","Leiming",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 02:20:02 GMT"}],"updateDate":"2024-08-06","timestamp":1722824402000,"abstract":"  Noise suppression in seismic data processing is a crucial research focus for\nenhancing subsequent imaging and reservoir prediction. Deep learning has shown\npromise in computer vision and holds significant potential for seismic data\nprocessing. However, supervised learning, which relies on clean labels to train\nnetwork prediction models, faces challenges due to the unavailability of clean\nlabels for seismic exploration data. In contrast, self-supervised learning\nsubstitutes traditional supervised learning with surrogate tasks by different\nauxiliary means, exploiting internal input data information. Inspired by\nSelf2Self with Dropout, this paper presents a self-supervised learning-based\nnoise suppression method called Self-Supervised Deep Convolutional Networks\n(SSDCN), specifically designed for Common Reflection Point (CRP) gathers. We\nutilize pairs of Bernoulli-sampled instances of the input noisy image as\nsurrogate tasks to leverage its inherent structure. Furthermore, SSDCN\nincorporates geological knowledge through the normal moveout correction\ntechnique, which capitalizes on the approximately horizontal behavior and\nstrong self-similarity observed in useful signal events within CRP gathers. By\nexploiting the discrepancy in self-similarity between the useful signals and\nnoise in CRP gathers, SSDCN effectively extracts self-similarity features\nduring training iterations, prioritizing the extraction of useful signals to\nachieve noise suppression. Experimental results on synthetic and actual CRP\ngathers demonstrate that SSDCN achieves high-fidelity noise suppression.\n","subjects":["Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}