{"id":"2408.02316","title":"Real-time Trajectory Optimization of Impaired Aircraft based on Steady\n  State Manoeuvres","authors":"Ramin Norouzi, Amirreza Kosari, Mark H. Lowenberg","authorsParsed":[["Norouzi","Ramin",""],["Kosari","Amirreza",""],["Lowenberg","Mark H.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 08:55:31 GMT"}],"updateDate":"2024-08-06","timestamp":1722848131000,"abstract":"  Aircraft failures alter dynamics, diminishing manoeuvrability. Such\nmanoeuvring flight envelope variations, governed by the aircraft's complex\nnonlinear dynamics, are unpredictable by pilots and existing flight management\nsystems. To prevent in-flight Loss of Control, post-failure trajectories must\nbe optimal, planned in real-time, avoid terrain, and adhere to the impaired\naircraft's reduced manoeuvrability and dynamic constraints. This paper presents\na novel real-time trajectory optimization method for impaired aircraft based on\na combination of differential flatness theory, the pseudospectral method,\nnonlinear programming, and inverse dynamics. In the proposed method, which\nutilizes a high-fidelity nonlinear six degree-of-freedom model, to conform to\naircraft's altered dynamics a sequence of trim points is selected from the\nimpaired aircraft's manoeuvring flight envelope based on the chosen\noptimization criteria, ensuring that the resulting three-dimensional trajectory\nobserves terrain avoidance. Then, the required control inputs are obtained for\neach manoeuvre in less than a second. The method is applied to the NASA Generic\nTransport Model with rudder failure near a complex mountainous terrain. Both an\noptimal one-piece trajectory and a near-optimal piecewise path consisting of\nseveral optimal trajectories, are generated in non-real-time and real-time,\nrespectively, and compared. Results show that the near-optimal real-time\ntrajectory retains up to 80% of the optimality.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}