{"id":"2408.14393","title":"CURE4Rec: A Benchmark for Recommendation Unlearning with Deeper\n  Influence","authors":"Chaochao Chen, Jiaming Zhang, Yizhao Zhang, Li Zhang, Lingjuan Lyu,\n  Yuyuan Li, Biao Gong, Chenggang Yan","authorsParsed":[["Chen","Chaochao",""],["Zhang","Jiaming",""],["Zhang","Yizhao",""],["Zhang","Li",""],["Lyu","Lingjuan",""],["Li","Yuyuan",""],["Gong","Biao",""],["Yan","Chenggang",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 16:21:50 GMT"}],"updateDate":"2024-08-27","timestamp":1724689310000,"abstract":"  With increasing privacy concerns in artificial intelligence, regulations have\nmandated the right to be forgotten, granting individuals the right to withdraw\ntheir data from models. Machine unlearning has emerged as a potential solution\nto enable selective forgetting in models, particularly in recommender systems\nwhere historical data contains sensitive user information. Despite recent\nadvances in recommendation unlearning, evaluating unlearning methods\ncomprehensively remains challenging due to the absence of a unified evaluation\nframework and overlooked aspects of deeper influence, e.g., fairness. To\naddress these gaps, we propose CURE4Rec, the first comprehensive benchmark for\nrecommendation unlearning evaluation. CURE4Rec covers four aspects, i.e.,\nunlearning Completeness, recommendation Utility, unleaRning efficiency, and\nrecommendation fairnEss, under three data selection strategies, i.e., core\ndata, edge data, and random data. Specifically, we consider the deeper\ninfluence of unlearning on recommendation fairness and robustness towards data\nwith varying impact levels. We construct multiple datasets with CURE4Rec\nevaluation and conduct extensive experiments on existing recommendation\nunlearning methods. Our code is released at\nhttps://github.com/xiye7lai/CURE4Rec.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}