{"id":"2408.00103","title":"ReLiK: Retrieve and LinK, Fast and Accurate Entity Linking and Relation\n  Extraction on an Academic Budget","authors":"Riccardo Orlando, Pere-Lluis Huguet-Cabot, Edoardo Barba, Roberto\n  Navigli","authorsParsed":[["Orlando","Riccardo",""],["Huguet-Cabot","Pere-Lluis",""],["Barba","Edoardo",""],["Navigli","Roberto",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:25:49 GMT"}],"updateDate":"2024-08-02","timestamp":1722450349000,"abstract":"  Entity Linking (EL) and Relation Extraction (RE) are fundamental tasks in\nNatural Language Processing, serving as critical components in a wide range of\napplications. In this paper, we propose ReLiK, a Retriever-Reader architecture\nfor both EL and RE, where, given an input text, the Retriever module undertakes\nthe identification of candidate entities or relations that could potentially\nappear within the text. Subsequently, the Reader module is tasked to discern\nthe pertinent retrieved entities or relations and establish their alignment\nwith the corresponding textual spans. Notably, we put forward an innovative\ninput representation that incorporates the candidate entities or relations\nalongside the text, making it possible to link entities or extract relations in\na single forward pass and to fully leverage pre-trained language models\ncontextualization capabilities, in contrast with previous\nRetriever-Reader-based methods, which require a forward pass for each\ncandidate. Our formulation of EL and RE achieves state-of-the-art performance\nin both in-domain and out-of-domain benchmarks while using academic budget\ntraining and with up to 40x inference speed compared to competitors. Finally,\nwe show how our architecture can be used seamlessly for Information Extraction\n(cIE), i.e. EL + RE, and setting a new state of the art by employing a shared\nReader that simultaneously extracts entities and relations.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}