{"id":"2408.00043","title":"Optimal control of levitated nanoparticles through finite-stiffness\n  confinement","authors":"Marco Baldovin, Ines Ben Yedder, Carlos A. Plata, Damien Raynal,\n  Lo\\\"ic Rondin, Emmanuel Trizac and Antonio Prados","authorsParsed":[["Baldovin","Marco",""],["Yedder","Ines Ben",""],["Plata","Carlos A.",""],["Raynal","Damien",""],["Rondin","Loïc",""],["Trizac","Emmanuel",""],["Prados","Antonio",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 14:33:57 GMT"}],"updateDate":"2024-08-02","timestamp":1722436437000,"abstract":"  Optimal control of levitated particles subject to thermal fluctuations is a\nchallenging problem, both from the theoretical and the experimental\nperspective. In this paper we compute the time-dependent harmonic confining\npotential that steers a Brownian particle between two assigned equilibrium\nstates, in a prescribed time, with the minimum energetic cost. In our analysis\nwe do not neglect inertial effects (thus addressing the general underdamped\ndynamics) and we assume, motivated by the experiments, that the stiffness of\nthe confining potential cannot exceed prescribed bounds. We report the results\nof an experiment realizing the described protocol for an optically confined\nnanoparticle. The system is shown to reach the target state within accuracy,\nwhile spending less energy than other protocols that require the same time. The\noptimal protocol is also compared to an abrupt change of the confining\nstiffness, the latter involving an exponential relaxation to the target\nequilibrium state. Not only does our optimal protocol reach the target state in\na finite time but it does so in a time significantly shorter than the\ncharacteristic timescale of the direct relaxation. The results presented in\nthis paper are expected to have relevant applications in the design of optimal\ndevices, e.g. engines at the nanoscale.\n","subjects":["Condensed Matter/Statistical Mechanics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}