{"id":"2408.04502","title":"Diffusive hydrodynamics from long-range correlations","authors":"Friedrich H\\\"ubner, Leonardo Biagetti, Jacopo De Nardis, Benjamin\n  Doyon","authorsParsed":[["Hübner","Friedrich",""],["Biagetti","Leonardo",""],["De Nardis","Jacopo",""],["Doyon","Benjamin",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 14:58:32 GMT"},{"version":"v2","created":"Tue, 17 Sep 2024 15:49:43 GMT"}],"updateDate":"2024-09-18","timestamp":1723129112000,"abstract":"  In the hydrodynamic theory, the non-equilibrium dynamics of a many-body\nsystem is approximated, at large scales of space and time, by irreversible\nrelaxation to local entropy maximisation. This results in a convective equation\ncorrected by viscous or diffusive terms in a gradient expansion, such as the\nNavier-Stokes equations. Diffusive terms are evaluated using the Kubo formula,\nand possibly arising from an emergent noise due to discarded microscopic\ndegrees of freedom. In one dimension of space, diffusive scaling is often\nbroken as noise leads to super-diffusion. But in linearly degenerate\nhydrodynamics, such as that of integrable models, diffusive behaviors are\nobserved, and it has long be thought that the standard diffusive picture\nremains valid. In this letter, we show that in such systems, the Navier-Stokes\nequation breaks down beyond linear response. We demonstrate that\ndiffusive-order corrections do not take the form of a gradient expansion.\nInstead, they are completely determined by ballistic transport of initial-state\nfluctuations, and obtained from the non-local two-point correlations recently\npredicted by the ballistic macroscopic fluctuation theory (BMFT); the resulting\nhydrodynamic equations are reversible. To do so, we establish a regularised\nfluctuation theory, putting on a firm basis the recent idea that ballistic\ntransport of initial-state fluctuations determines fluctuations and\ncorrelations beyond the Euler scale. This extends the idea of ``diffusion from\nconvection'' previously developed to explain the Kubo formula in integrable\nsystems, to generic non-equilibrium settings.\n","subjects":["Condensed Matter/Statistical Mechanics","Physics/High Energy Physics - Theory","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}