{"id":"2408.00074","title":"Loops, Recursions, and Soft Limits for Fermionic Correlators in (A)dS","authors":"Chandramouli Chowdhury, Pratyusha Chowdhury, Radu N. Moga and Kajal\n  Singh","authorsParsed":[["Chowdhury","Chandramouli",""],["Chowdhury","Pratyusha",""],["Moga","Radu N.",""],["Singh","Kajal",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:00:04 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 10:00:17 GMT"}],"updateDate":"2024-08-26","timestamp":1722448804000,"abstract":"  Study of correlation functions in AdS/CFT and in-in correlators in de Sitter\nspace often requires the computation of Witten diagrams. Due to the complexity\nof evaluating radial integrals for these correlators, several indirect\napproaches have been developed to simplify computations. However, in momentum\nspace, these methods have been limited to fields with integer spin. In this\npaper, we formulate tools for evaluating Witten diagrams with spin$-\\frac12$\nfields in momentum space and discuss where they differ from the corresponding\ninteger-spin analysis. We formulate our tools explicitly for massless fermions\nand present how appropriate Weight shifting operators with respect to the\nexternal kinematics can be used to obtain the generalization to fermions with\ninteger mass. We apply these tools to loop Witten diagrams and also discuss\ntheir use for evaluating in-in correlators in dS. In cases where we can\nevaluate the loop integrals, we find their transcendentality is lower than the\ncorresponding scalar field results. Further, we classify the nature of IR\ndivergences encountered for interacting massive scalars and fermions. We also\nprove a novel Weinberg-like soft theorem for gauge fields coupled to matter in\nAdS and show that the universal terms in the leading soft factor are sensitive\nto the spin of the matter field. These generalize the recently discovered soft\ntheorems for pure Yang-Mills to Yang-Mills with matter.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"naiP50mZ37l1795OyKkG4BNos8CmmYDSnVA0_wsdb-g","pdfSize":"796956","txDigest":"DhY4L9LqyS7JZh6rcaoP5cGWwAfPZCQurLRMiDToqNFh","endEpoch":"100","status":"CERTIFIED"}
