{"id":"2408.08879","title":"SHARP-Net: A Refined Pyramid Network for Deficiency Segmentation in\n  Culverts and Sewer Pipes","authors":"Rasha Alshawi, Md Meftahul Ferdaus, Md Tamjidul Hoque, Kendall Niles,\n  Ken Pathak, Steve Sloan, Mahdi Abdelguerfi","authorsParsed":[["Alshawi","Rasha",""],["Ferdaus","Md Meftahul",""],["Hoque","Md Tamjidul",""],["Niles","Kendall",""],["Pathak","Ken",""],["Sloan","Steve",""],["Abdelguerfi","Mahdi",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 23:55:04 GMT"}],"updateDate":"2024-08-20","timestamp":1722642904000,"abstract":"  This paper introduces Semantic Haar-Adaptive Refined Pyramid Network\n(SHARP-Net), a novel architecture for semantic segmentation. SHARP-Net\nintegrates a bottom-up pathway featuring Inception-like blocks with varying\nfilter sizes (3x3$ and 5x5), parallel max-pooling, and additional spatial\ndetection layers. This design captures multi-scale features and fine structural\ndetails. Throughout the network, depth-wise separable convolutions are used to\nreduce complexity. The top-down pathway of SHARP-Net focuses on generating\nhigh-resolution features through upsampling and information fusion using\n$1\\times1$ and $3\\times3$ depth-wise separable convolutions. We evaluated our\nmodel using our developed challenging Culvert-Sewer Defects dataset and the\nbenchmark DeepGlobe Land Cover dataset. Our experimental evaluation\ndemonstrated the base model's (excluding Haar-like features) effectiveness in\nhandling irregular defect shapes, occlusions, and class imbalances. It\noutperformed state-of-the-art methods, including U-Net, CBAM U-Net, ASCU-Net,\nFPN, and SegFormer, achieving average improvements of 14.4% and 12.1% on the\nCulvert-Sewer Defects and DeepGlobe Land Cover datasets, respectively, with IoU\nscores of 77.2% and 70.6%. Additionally, the training time was reduced.\nFurthermore, the integration of carefully selected and fine-tuned Haar-like\nfeatures enhanced the performance of deep learning models by at least 20%. The\nproposed SHARP-Net, incorporating Haar-like features, achieved an impressive\nIoU of 94.75%, representing a 22.74% improvement over the base model. These\nfeatures were also applied to other deep learning models, showing a 35.0%\nimprovement, proving their versatility and effectiveness. SHARP-Net thus\nprovides a powerful and efficient solution for accurate semantic segmentation\nin challenging real-world scenarios.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}