{"id":"2408.02235","title":"Constraining gravitational wave velocities using gravitational and\n  electromagnetic wave observations of white dwarf binaries","authors":"Tian-Yong Cao, Ankit Kumar, and Shu-Xu Yi","authorsParsed":[["Cao","Tian-Yong",""],["Kumar","Ankit",""],["Yi","Shu-Xu",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 04:56:20 GMT"}],"updateDate":"2024-08-06","timestamp":1722833780000,"abstract":"  Although the general theory of relativity (GR) predicts that gravitational\nwaves (GWs) have exactly the same propagation velocity as electromagnetic (EM)\nwaves, many theories of gravity beyond GR expect otherwise. Accurate\nmeasurement of the difference in their propagation speed, or a tight constraint\non it, could be crucial to validate or put limits on theories beyond GR. The\nproposed future space-borne GW detectors are poised to detect a substantial\nnumber of Galactic white dwarf binaries (GWDBs), which emit the GW as\nsemi-monochromatic signals. Concurrently, these GWDBs can also be identified as\noptical variable sources. Here we proposed that allocating a GWDB's optical\nlight curve and contemporaneous GW signal can be used to trace the difference\nbetween the velocity of GW and EM waves. Simulating GW and EM wave data from 14\nverification binaries (VBs), our method constrains propagation-originated phase\ndifferences, limiting the discrepancy between the speed of light ($c$) and GW\n($c_{GW}$). Through the utilization of LISA's design sensitivity and the\ncurrent precision in optical observation on GWDB, our study reveals that a\nfour-year observation of the 14 recognized VBs results in a joint constraint\nthat confines $\\Delta c/c$ ($\\Delta c = c_{\\mathrm{GW}} - c$) to the range of\n$-2.1\\times10^{-12}$ and $4.8\\times10^{-12}$. Additionally, by incorporating\nthis constraint on $c_{\\mathrm{GW}}$, we are able to establish boundaries for\nthe mass of the graviton, limiting it to\n$m_{\\mathrm{g}}\\le3\\times10^{-23}\\,e\\mathrm{V}/c^{2}$, and for the parameter\nassociated with local Lorentz violation, $\\bar{s}_{00}$, constrained within the\nrange of $-3.4\\times10^{-11}\\le\\bar{s}_{00}\\le1.5\\times10^{-11}$.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}