{"id":"2408.00316","title":"Recalculating Total Number of e-folds in Loop Quantum Cosmology in View\n  of Generalized Reheating","authors":"Yogesh, Mayukh R. Gangopadhyay, Anzhong Wang","authorsParsed":[["Yogesh","",""],["Gangopadhyay","Mayukh R.",""],["Wang","Anzhong",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 06:26:15 GMT"}],"updateDate":"2024-08-02","timestamp":1722493575000,"abstract":"  In loop quantum cosmology, the slow-roll inflation is generic, and when the\nkinetic energy of the scalar field dominates at the bounce, the evolution of\nthe Friedmann-Lema\\^itre-Robertson-Walker universe will go through three\ndistinguishable epochs, bouncing, transition, and finally slow-roll inflation,\nbefore the reheating commences. The bouncing dynamics are insensitive of the\npotential and initial conditions, so that the expansion factor and the scalar\nfield can be described uniquely by a universal solution during this epoch.\nAfter about $10^5$ Planck time, the epoch of transition starts and the universe\nrapidly turns over from the kinetic energy dominated state to the potential\nenergy dominated one, whereby the slow-roll inflationary phase begins. In this\npaper, we consider the power law plateau potential and study the\npre-inflationary cosmology for different sets of initial conditions, so that\nduring the slow-roll inflation epoch enough e-folds will be produced.\nConsidering the generalized reheating and comparing with the recent Planck 2018\ndata, we are able to constrain the total number of e-folds ($N_T$) from the\nbounce till today to be consistent with the current observable universe.\nDepending on the matter driving the reheating (subject to the different\ndominant equations of states), we report the observationally allowed $N_T$ and\nreheating temperature and find in particular $N_T \\simeq 127$, which is\nsignificantly different from the one $N_T \\gtrsim 141$ obtained previously\nwithout considering the reheating phase.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ZX7oGvIu7hzEbQiCoMKF9YRz7Wuib9dVnX2f_7Jiy2U","pdfSize":"5162731","txDigest":"HhN27AnMskmKiLXhebRxt55h4myahKPBo8LwGLFowe37","endEpoch":"1","status":"CERTIFIED"}
