{"id":"2408.14861","title":"Optimal Joint Radar and Communication User Association in Cell-Free\n  mMIMO Systems","authors":"Ahmed Naeem, El Mehdi Amhoud, H\\\"useyin Arslan","authorsParsed":[["Naeem","Ahmed",""],["Amhoud","El Mehdi",""],["Arslan","Hüseyin",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 08:29:32 GMT"}],"updateDate":"2024-08-28","timestamp":1724747372000,"abstract":"  The cell-free massive multiple-input multiple-output (CF-mMIMO) systems are\ncrucial for 6G development due to their high spectral efficiency and uniform\nuser-experienced data rates. A key aspect of CF-mMIMO is user association (UA)\nand optimal cluster formation. Traditional methods focusing solely on\ncommunication-related metrics fall short in this context, as sensing is\nbecoming integral to 6G. This study delves into a framework for joint radar and\ncommunication (JRC) in CF-mMIMO systems and investigates JRC-based UA\ntechniques. We propose a novel method to optimize UA, enhancing both\ncommunication spectral efficiency and sensing accuracy. Existing literature has\nnot explored this dual requirement integration for UA. Our proposed two-step\nscheme optimizes UA clusters for both communication and sensing. The first step\ninvolves selecting access points (APs) based on channel quality, followed by a\nsecond step that further refines the selection by choosing APs from the initial\ngroup that are also optimal for sensing. We utilize the signal-clutter plus\nnoise ratio to exclude APs with clutter in front of the user equipment (UE) and\nthe AP view angle, ensuring that radar echoes are received only from the\nspecific UE, not the surrounding clutter. Theoretical analysis and simulations\ndemonstrate that the same APs optimized for communication are not necessarily\noptimal for sensing, highlighting the need for schemes that incorporate sensing\nrequirements in UA. The results show the effectiveness of the proposed method,\nshowing its potential to improve CF-mMIMO system performance in JRC scenarios.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}