{"id":"2408.05384","title":"Nonlinear Propagation of Non-Gaussian Uncertainties: Theory and\n  Applications to Spacecraft Trajectory Design","authors":"Giacomo Acciarini, Nicola Baresi, David Lloyd, Dario Izzo","authorsParsed":[["Acciarini","Giacomo",""],["Baresi","Nicola",""],["Lloyd","David",""],["Izzo","Dario",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 23:46:01 GMT"}],"updateDate":"2024-08-13","timestamp":1723247161000,"abstract":"  This paper presents a novel approach for propagating uncertainties in\ndynamical systems building on high-order Taylor expansions of the flow and\nmoment-generating functions (MGFs). Unlike prior methods that focus on Gaussian\ndistributions, our approach leverages the relationship between MGFs and\ndistribution moments to extend high-order uncertainty propagation techniques to\nnon-Gaussian scenarios. This significantly broadens the applicability of these\nmethods to a wider range of problems and uncertainty types. High-order moment\ncomputations are performed one-off and symbolically, reducing the computational\nburden of the technique to the calculation of Taylor series coefficients around\na nominal trajectory, achieved by efficiently integrating the system's\nvariational equations. Furthermore, the use of the proposed approach in\ncombination with event transition tensors, allows for accurate propagation of\nuncertainties at specific events, such as the landing surface of a celestial\nbody, the crossing of a predefined Poincar\\'e section, or the trigger of an\narbitrary event during the propagation. Via numerical simulations we\ndemonstrate the effectiveness of our method in various astrodynamics\napplications, including the unperturbed and perturbed two-body problem, and the\ncircular restricted three-body problem, showing that it accurately propagates\nnon-Gaussian uncertainties both at future times and at event manifolds.\n","subjects":["Physics/Space Physics","Computing Research Repository/Symbolic Computation","Mathematics/Probability","Nonlinear Sciences/Chaotic Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}