{"id":"2408.14941","title":"BOX3D: Lightweight Camera-LiDAR Fusion for 3D Object Detection and\n  Localization","authors":"Mario A.V. Saucedo, Nikolaos Stathoulopoulos, Vidya Sumathy,\n  Christoforos Kanellakis and George Nikolakopoulos","authorsParsed":[["Saucedo","Mario A. V.",""],["Stathoulopoulos","Nikolaos",""],["Sumathy","Vidya",""],["Kanellakis","Christoforos",""],["Nikolakopoulos","George",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 10:26:05 GMT"}],"updateDate":"2024-08-28","timestamp":1724754365000,"abstract":"  Object detection and global localization play a crucial role in robotics,\nspanning across a great spectrum of applications from autonomous cars to\nmulti-layered 3D Scene Graphs for semantic scene understanding. This article\nproposes BOX3D, a novel multi-modal and lightweight scheme for localizing\nobjects of interest by fusing the information from RGB camera and 3D LiDAR.\nBOX3D is structured around a three-layered architecture, building up from the\nlocal perception of the incoming sequential sensor data to the global\nperception refinement that covers for outliers and the general consistency of\neach object's observation. More specifically, the first layer handles the\nlow-level fusion of camera and LiDAR data for initial 3D bounding box\nextraction. The second layer converts each LiDAR's scan 3D bounding boxes to\nthe world coordinate frame and applies a spatial pairing and merging mechanism\nto maintain the uniqueness of objects observed from different viewpoints.\nFinally, BOX3D integrates the third layer that supervises the consistency of\nthe results on the global map iteratively, using a point-to-voxel comparison\nfor identifying all points in the global map that belong to the object.\nBenchmarking results of the proposed novel architecture are showcased in\nmultiple experimental trials on public state-of-the-art large-scale dataset of\nurban environments.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}