{"id":"2408.02539","title":"Analog control of electrical conductivity in La0.5Sr0.5FeO3-{\\delta}\n  through oxygen deficiency induced magnetic transition","authors":"Paul Nizet, Francesco Chiabrera, Nicolau L\\'opez-Pint\\'o, Nerea Alayo,\n  Philipp Langner, Sergio Valencia, Arantxa Fraile-Rodr\\'iguez, Federico\n  Baiutti, Alevtina Smekhova, Alex Morata, Jordi Sort, Albert Taranc\\'on","authorsParsed":[["Nizet","Paul",""],["Chiabrera","Francesco",""],["López-Pintó","Nicolau",""],["Alayo","Nerea",""],["Langner","Philipp",""],["Valencia","Sergio",""],["Fraile-Rodríguez","Arantxa",""],["Baiutti","Federico",""],["Smekhova","Alevtina",""],["Morata","Alex",""],["Sort","Jordi",""],["Tarancón","Albert",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 15:12:42 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 08:05:15 GMT"}],"updateDate":"2024-08-07","timestamp":1722870762000,"abstract":"  Switchability of materials properties by applying controlled stimuli such as\nvoltage pulses is an emerging field of study with applicability in adaptive and\nprogrammable devices like neuromorphic transistors or non-emissive smart\ndisplays. One of the most exciting approaches to modulate materials performance\nis mobile ion/vacancy insertion for inducing changes in relevant electrical,\noptical, or magnetic properties, among others. Unveiling the interplay between\nchanges in the concentration of mobile defects (like oxygen vacancies) and\nfunctional properties in relevant materials represents a step forward for\nunderpinning the emerging oxide iontronics discipline. In this work,\nelectrochemical oxide-ion pumping cells were fabricated for an analog control\nof the oxygen stoichiometry in thin films of mixed ionic-electronic conductor\nLa0.5Sr0.5FeO3-{\\delta}. We demonstrate over more than 4 orders of magnitude\nelectronic conductivity control within the same crystallographic phase through\nthe precise and continuous voltage control of the oxygen stoichiometry. We show\nthat behind the modification of the transport properties of the material lays a\nparamagnetic-to-antiferromagnetic transition. We exploit such magnetoelectric\ncoupling to show control over the exchange interaction between\nLa0.5Sr0.5FeO3-{\\delta} and a ferromagnetic Co layer deposited on top.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}