{"id":"2408.10201","title":"LEAD: Towards Learning-Based Equity-Aware Decarbonization in Ridesharing\n  Platforms","authors":"Mahsa Sahebdel, Ali Zeynali, Noman Bashir, Prashant Shenoy, and\n  Mohammad Hajiesmaili","authorsParsed":[["Sahebdel","Mahsa",""],["Zeynali","Ali",""],["Bashir","Noman",""],["Shenoy","Prashant",""],["Hajiesmaili","Mohammad",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 17:57:16 GMT"}],"updateDate":"2024-08-20","timestamp":1724090236000,"abstract":"  Ridesharing platforms such as Uber, Lyft, and DiDi have grown in popularity\ndue to their on-demand availability, ease of use, and commute cost reductions,\namong other benefits. However, not all ridesharing promises have panned out.\nRecent studies demonstrate that the expected drop in traffic congestion and\nreduction in greenhouse gas (GHG) emissions have not materialized. This is\nprimarily due to the substantial distances traveled by the ridesharing vehicles\nwithout passengers between rides, known as deadhead miles. Recent work has\nfocused on reducing the impact of deadhead miles while considering additional\nmetrics such as rider waiting time, GHG emissions from deadhead miles, or\ndriver earnings. Unfortunately, prior studies consider these environmental and\nequity-based metrics individually despite them being interrelated.\n  In this paper, we propose a Learning-based Equity-Aware Decarabonization\napproach, LEAD, for ridesharing platforms. LEAD targets minimizing emissions\nwhile ensuring that the driver's utility, defined as the difference between the\ntrip distance and the deadhead miles, is fairly distributed. LEAD uses\nreinforcement learning to match riders to drivers based on the expected future\nutility of drivers and the expected carbon emissions of the platform without\nincreasing the rider waiting times. Extensive experiments based on a real-world\nride-sharing dataset show that LEAD improves fairness by 2$\\times$ when\ncompared to emission-aware ride-assignment and reduces emissions by 70% while\nensuring fairness within 66% of the fair baseline. It also reduces the rider\nwait time, by at least 40%, compared to various baselines. Additionally, LEAD\ncorrects the imbalance in previous emission-aware ride assignment algorithms\nthat overassigned rides to low-emission vehicles.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}