{"id":"2408.06906","title":"VNet: A GAN-based Multi-Tier Discriminator Network for Speech Synthesis\n  Vocoders","authors":"Yubing Cao and Yongming Li and Liejun Wang and Yinfeng Yu","authorsParsed":[["Cao","Yubing",""],["Li","Yongming",""],["Wang","Liejun",""],["Yu","Yinfeng",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 14:00:02 GMT"}],"updateDate":"2024-08-14","timestamp":1723557602000,"abstract":"  Since the introduction of Generative Adversarial Networks (GANs) in speech\nsynthesis, remarkable achievements have been attained. In a thorough\nexploration of vocoders, it has been discovered that audio waveforms can be\ngenerated at speeds exceeding real-time while maintaining high fidelity,\nachieved through the utilization of GAN-based models. Typically, the inputs to\nthe vocoder consist of band-limited spectral information, which inevitably\nsacrifices high-frequency details. To address this, we adopt the full-band Mel\nspectrogram information as input, aiming to provide the vocoder with the most\ncomprehensive information possible. However, previous studies have revealed\nthat the use of full-band spectral information as input can result in the issue\nof over-smoothing, compromising the naturalness of the synthesized speech. To\ntackle this challenge, we propose VNet, a GAN-based neural vocoder network that\nincorporates full-band spectral information and introduces a Multi-Tier\nDiscriminator (MTD) comprising multiple sub-discriminators to generate\nhigh-resolution signals. Additionally, we introduce an asymptotically\nconstrained method that modifies the adversarial loss of the generator and\ndiscriminator, enhancing the stability of the training process. Through\nrigorous experiments, we demonstrate that the VNet model is capable of\ngenerating high-fidelity speech and significantly improving the performance of\nthe vocoder.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"J5Srit600KDSZvVWWxXPr197pPQTxFremo-Q537TqRc","pdfSize":"2244742"}
