{"id":"2408.10020","title":"On the flux density spectral property of high linearly polarized signal\n  from Pulsar J0332+5434","authors":"Dipanjan Mitra, Rahul Basu, George I. Melikidze","authorsParsed":[["Mitra","Dipanjan",""],["Basu","Rahul",""],["Melikidze","George I.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 14:13:07 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 05:35:29 GMT"}],"updateDate":"2024-08-22","timestamp":1724076787000,"abstract":"  The polarization position angles (PPA) of time samples with high linear\npolarization often show two parallel tracks across the pulsar profile that\nfollow the rotating vector model (RVM). This feature support coherent curvature\nradiation (CCR) as the underlying mechanism of radio emission from pulsars,\nwhere the parallel tracks of the PPA represent the orthogonal extraordinary X\nand ordinary O eigen modes of strongly magnetized pair plasma. However, the\nfrequency evolution of these high linearly polarized signals remains\nunexplored. In this work we explore the flux density spectral nature of high\nlinearly polarized signals by studying the emission from PSR J0332+5434 over a\nfrequency range between 300 MHz and 750 MHz, using the Giant Metrewave Radio\nTelescope. The pulsar average profile comprises of a central core and a pair of\nconal components. We find the high linearly polarized time samples to be\nbroadband in nature and in many cases they resemble a narrow spiky feature in\nthe conal regions. These spiky features are localised within a narrow pulse\nlongitude, over the entire frequency range, and their spectral shapes sometimes\nresemble an inverted parabolic shape. In all such cases the PPA are exclusively\nalong one of the orthogonal RVM tracks, likely corresponding to the X-mode. The\ninverted spectral shape can in principle be explained if the high linearly\npolarized emission in these time samples are formed due to incoherent addition\nof CCR from a large number of charged solitons (charge bunches) exciting the\nX-mode.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}