{"id":"2408.01340","title":"On the origin of the light yield enhancement in polymeric composite\n  scintillators loaded with dense nanoparticles","authors":"Irene Villa, Angelo Monguzzi, Roberto Lorenzi, Matteo Orfano, Vladimir\n  Babin, Franti\\v{s}ek H\\'ajek, Karla Kuldov\\'a, Romana Ku\\v{c}erkov\\'a, Alena\n  Beitlerov\\'a, Ilaria Mattei, Hana Buresova, Radek Pjatkan, V\\'aclav \\v{C}uba,\n  Lenka Prouzov\\'a Proch\\'azkov\\'a, and Martin Nikl","authorsParsed":[["Villa","Irene",""],["Monguzzi","Angelo",""],["Lorenzi","Roberto",""],["Orfano","Matteo",""],["Babin","Vladimir",""],["Hájek","František",""],["Kuldová","Karla",""],["Kučerková","Romana",""],["Beitlerová","Alena",""],["Mattei","Ilaria",""],["Buresova","Hana",""],["Pjatkan","Radek",""],["Čuba","Václav",""],["Procházková","Lenka Prouzová",""],["Nikl","Martin",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 15:37:55 GMT"}],"updateDate":"2024-08-05","timestamp":1722613075000,"abstract":"  Fast emitting polymeric scintillators are requested in advanced applications\nwhere high-speed detectors with large signal-to-noise ratio are needed.\nHowever, their low density implies a weak stopping power of high energy\nradiations, thus a limited light output and sensitivity. To enhance their\nperformances, polymeric scintillators can be loaded with dense nanoparticles\n(NPs). We investigate the properties of a series of polymeric scintillators by\nmeans of photoluminescence and scintillation spectroscopy, comparing standard\nscintillators with a composite system loaded with dense hafnium dioxide (HfO2)\nNPs. The nanocomposite shows a scintillation yield enhancement of +100% with\nunchanged time response. We provide for the first time an interpretation of\nthis effect, pointing out the local effect of NPs in the generation of emissive\nstates upon interaction with the ionizing radiation. The obtained results\nindicate that coupling of fast conjugated emitters with optically inert dense\nNPs could allow to surpass the actual limits of pure polymeric scintillators.\n","subjects":["Physics/Instrumentation and Detectors","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}