{"id":"2408.16387","title":"Enhancing MOTION2NX for Efficient, Scalable and Secure Image Inference\n  using Convolutional Neural Networks","authors":"Haritha K and Ramya Burra and Srishti Mittal and Sarthak Sharma and\n  Abhilash Venkatesh and Anshoo Tandon","authorsParsed":[["K","Haritha",""],["Burra","Ramya",""],["Mittal","Srishti",""],["Sharma","Sarthak",""],["Venkatesh","Abhilash",""],["Tandon","Anshoo",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 09:50:21 GMT"}],"updateDate":"2024-08-30","timestamp":1724925021000,"abstract":"  This work contributes towards the development of an efficient and scalable\nopen-source Secure Multi-Party Computation (SMPC) protocol on machines with\nmoderate computational resources. We use the ABY2.0 SMPC protocol implemented\non the C++ based MOTION2NX framework for secure convolutional neural network\n(CNN) inference application with semi-honest security. Our list of\ncontributions are as follows. Firstly, we enhance MOTION2NX by providing a\ntensorized version of several primitive functions including the Hadamard\nproduct, indicator function and argmax function. Our design of secure indicator\nfunction based on a novel approach that uses secure Relu function available in\nthe baseline MOTION2NX implementation. The secure indicator function is used,\nin turn, as a building block for a novel implementation of secure argmax.\nSecondly, we also develop a novel splitting of the computations at each CNN\nlayer into multiple configurable chunks thereby resulting in significant\nreduction in RAM usage. Thirdly, we adapt an existing Helper node algorithm,\nworking in tandem with the ABY2.0 protocol, for efficient convolution\ncomputation. This algorithm not only reduces execution time but also reduces\nthe RAM usage required to execute CNN models, but comes at a cost of an\nadditional compute server. Moreover, the ideas presented in this paper can also\nbe applied to secure neural network training.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7iptC_6UTMmnISfAzu7dpoptg-2cJ5gGmfa8_esV6W8","pdfSize":"544779"}
