{"id":"2408.01411","title":"Spectroscopic survey of faint planetary-nebula nuclei VI. Seventeen\n  hydrogen-rich central stars","authors":"Nicole Reindl, Howard E. Bond, Klaus Werner, and Gregory R. Zeimann","authorsParsed":[["Reindl","Nicole",""],["Bond","Howard E.",""],["Werner","Klaus",""],["Zeimann","Gregory R.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 17:35:30 GMT"}],"updateDate":"2024-08-05","timestamp":1722620130000,"abstract":"  We present an analysis of 17 H-rich central stars of planetary nebulae (PNe)\nobserved in our spectroscopic survey of nuclei of faint Galactic PNe carried\nout at the 10-m Hobby-Eberly Telescope. Our sample includes ten O(H) stars,\nfour DAO white dwarfs (WDs), two DA WDs, and one sdOB star. The spectra were\nanalyzed by means of NLTE model atmospheres, allowing us to derive the\neffective temperatures, surface gravities, and He abundances of the central\nstars. Sixteen of them were analyzed for the first time, increasing the number\nof hot H-rich central stars with parameters obtained through NLTE atmospheric\nmodeling by approximately 20%. We highlight a rare hot DA WD central star,\nAbell 24, which has a $T_\\mathrm{eff}$ likely in excess of 100kK, as well as\nthe unusually high gravity mass of $0.70 \\pm 0.05 \\mathrm{M}_\\odot$ for the\nsdOB star Pa 3, which is significantly higher than the canonical extreme\nhorizontal-branch star mass of $\\approx 0.48\\,\\mathrm{M}_{\\odot}$. By\ninvestigating Zwicky Transient Facility light curves, which were available for\nour 15 northern objects, we found none of them show a periodic photometric\nvariability larger than a few hundredths of a magnitude. This could indicate\nthat our sample mainly represents the hottest phase during the canonical\nevolution of a single star when transitioning from an asymptotic giant branch\nstar into a WD. We also examined the spectral energy distributions, detecting\nan infrared excess in six of the objects, which could be due to a late-type\ncompanion or to hot ($\\approx 10^3$ K) and\\or cool ($\\approx 100$ K) dust. We\nconfirm previous findings that spectroscopic distances are generally higher\nthan found through Gaia astrometry, a discrepancy that deserves to be\ninvestigated systematically.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"a8sKbHW7yivXAtzzp5BZHs_kpF4Oy9kdKENPLb6TUEk","pdfSize":"9068376"}
