{"id":"2408.16382","title":"Realising efficient computation of individual frequencies for red-giant\n  models","authors":"Jens R. Larsen, J{\\o}rgen Christensen-Dalsgaard, Mia S. Lundkvist,\n  Jakob L. R{\\o}rsted, Mark L. Winther, Hans Kjeldsen","authorsParsed":[["Larsen","Jens R.",""],["Christensen-Dalsgaard","Jørgen",""],["Lundkvist","Mia S.",""],["Rørsted","Jakob L.",""],["Winther","Mark L.",""],["Kjeldsen","Hans",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 09:48:17 GMT"}],"updateDate":"2024-08-30","timestamp":1724924897000,"abstract":"  In order to improve the asteroseismic modelling efforts for red-giant stars,\nthe numerical computation of theoretical individual oscillation modes for\nevolved red-giant models has to be made feasible. We aim to derive a method for\ncircumventing the computational cost of computing oscillation spectra for\nmodels of red-giant stars with an average large frequency separation\n$\\Delta\\nu<15$ $\\mu$Hz, thereby allowing for asteroseismic investigations of\ngiants utilising individual frequencies. The proposed Truncated Scanning Method\nserves as a novel method detailing how the observable individual $l=0,1,2$\nfrequencies of red giants may be computed on realistic timescales through\nso-called model truncation. By carefully removing the innermost region of the\nstellar models, the g-mode influence on the oscillation spectra may be avoided,\nallowing estimation of the observable regions from the resulting pure p-mode\noscillations. The appropriate observable frequency regions are subsequently\nscanned for the complete and un-truncated stellar model. The observable regions\nare determined by considering the limitations on observability from the\ninternal mode coupling and damping, yielding consistent frequency spectra\nobtained at a much reduced computational cost. The Truncated Scanning Method\nproves the feasibility of obtaining the individual frequencies of red-giant\nmodels for a wide range of applications and research, demonstrating an improved\ncomputational efficiency by a factor of 10 or better. This means that the\ninclusion of $l=1,2$ individual frequencies is now a possibility in future\nasteroseismic modelling efforts of red-giant stars. Further potential avenues\nfor improvements to this method are outlined for future pursuits.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}