{"id":"2408.14477","title":"RISE-iEEG: Robust to Inter-Subject Electrodes Implantation Variability\n  iEEG Classifier","authors":"Maryam Ostadsharif Memar, Navid Ziaei, Behzad Nazari, Ali Yousefi","authorsParsed":[["Memar","Maryam Ostadsharif",""],["Ziaei","Navid",""],["Nazari","Behzad",""],["Yousefi","Ali",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 18:33:19 GMT"}],"updateDate":"2024-08-28","timestamp":1723487599000,"abstract":"  Utilization of intracranial electroencephalography (iEEG) is rapidly\nincreasing for clinical and brain-computer interface applications. iEEG\nfacilitates the recording of neural activity with high spatial and temporal\nresolution, making it a desirable neuroimaging modality for studying neural\ndynamics. Despite its benefits, iEEG faces challenges such as inter-subject\nvariability in electrode implantation, which makes the development of unified\nneural decoder models across different patients difficult. In this research, we\nintroduce a novel decoder model that is robust to inter-subject electrode\nimplantation variability. We call this model RISE-iEEG, which stands for Robust\nInter-Subject Electrode Implantation Variability iEEG Classifier. RISE-iEEG\nemploys a deep neural network structure preceded by a patient-specific\nprojection network. The projection network maps the neural data of individual\npatients onto a common low-dimensional space, compensating for the implantation\nvariability. In other words, we developed an iEEG decoder model that can be\napplied across multiple patients' data without requiring the coordinates of\nelectrode for each patient. The performance of RISE-iEEG across multiple\ndatasets, including the Audio-Visual dataset, Music Reconstruction dataset, and\nUpper-Limb Movement dataset, surpasses that of state-of-the-art iEEG decoder\nmodels such as HTNet and EEGNet. Our analysis shows that the performance of\nRISE-iEEG is 10\\% higher than that of HTNet and EEGNet in terms of F1 score,\nwith an average F1 score of 83\\%, which is the highest result among the\nevaluation methods defined. Furthermore, the analysis of projection network\nweights in the Music Reconstruction dataset across patients suggests that the\nSuperior Temporal lobe serves as the primary encoding neural node. This finding\naligns with the auditory processing physiology.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}