{"id":"2408.07404","title":"Efficient Edge AI: Deploying Convolutional Neural Networks on FPGA with\n  the Gemmini Accelerator","authors":"Federico Nicolas Peccia, Svetlana Pavlitska, Tobias Fleck, Oliver\n  Bringmann","authorsParsed":[["Peccia","Federico Nicolas",""],["Pavlitska","Svetlana",""],["Fleck","Tobias",""],["Bringmann","Oliver",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 09:24:00 GMT"}],"updateDate":"2024-08-15","timestamp":1723627440000,"abstract":"  The growing concerns regarding energy consumption and privacy have prompted\nthe development of AI solutions deployable on the edge, circumventing the\nsubstantial CO2 emissions associated with cloud servers and mitigating risks\nrelated to sharing sensitive data. But deploying Convolutional Neural Networks\n(CNNs) on non-off-the-shelf edge devices remains a complex and labor-intensive\ntask. In this paper, we present and end-to-end workflow for deployment of CNNs\non Field Programmable Gate Arrays (FPGAs) using the Gemmini accelerator, which\nwe modified for efficient implementation on FPGAs. We describe how we leverage\nthe use of open source software on each optimization step of the deployment\nprocess, the customizations we added to them and its impact on the final\nsystem's performance. We were able to achieve real-time performance by\ndeploying a YOLOv7 model on a Xilinx ZCU102 FPGA with an energy efficiency of\n36.5 GOP/s/W. Our FPGA-based solution demonstrates superior power efficiency\ncompared with other embedded hardware devices, and even outperforms other FPGA\nreference implementations. Finally, we present how this kind of solution can be\nintegrated into a wider system, by testing our proposed platform in a traffic\nmonitoring scenario.\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6p6w3KxC7ig4PfxG_Dw-f4alwMC-adPNmEtGyidDy2k","pdfSize":"4864449"}
