{"id":"2408.14636","title":"Relationships are Complicated! An Analysis of Relationships Between\n  Datasets on the Web","authors":"Kate Lin, Tarfah Alrashed, Natasha Noy","authorsParsed":[["Lin","Kate",""],["Alrashed","Tarfah",""],["Noy","Natasha",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 21:00:25 GMT"}],"updateDate":"2024-08-28","timestamp":1724706025000,"abstract":"  The Web today has millions of datasets, and the number of datasets continues\nto grow at a rapid pace. These datasets are not standalone entities; rather,\nthey are intricately connected through complex relationships. Semantic\nrelationships between datasets provide critical insights for research and\ndecision-making processes. In this paper, we study dataset relationships from\nthe perspective of users who discover, use, and share datasets on the Web: what\nrelationships are important for different tasks? What contextual information\nmight users want to know? We first present a comprehensive taxonomy of\nrelationships between datasets on the Web and map these relationships to user\ntasks performed during dataset discovery. We develop a series of methods to\nidentify these relationships and compare their performance on a large corpus of\ndatasets generated from Web pages with schema.org markup. We demonstrate that\nmachine-learning based methods that use dataset metadata achieve multi-class\nclassification accuracy of 90%. Finally, we highlight gaps in available\nsemantic markup for datasets and discuss how incorporating comprehensive\nsemantics can facilitate the identification of dataset relationships. By\nproviding a comprehensive overview of dataset relationships at scale, this\npaper sets a benchmark for future research.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Computation and Language","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}