{"id":"2408.11289","title":"HMT-UNet: A hybird Mamba-Transformer Vision UNet for Medical Image\n  Segmentation","authors":"Mingya Zhang, Zhihao Chen, Yiyuan Ge and Xianping Tao","authorsParsed":[["Zhang","Mingya",""],["Chen","Zhihao",""],["Ge","Yiyuan",""],["Tao","Xianping",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 02:25:14 GMT"},{"version":"v2","created":"Sat, 7 Sep 2024 02:30:06 GMT"}],"updateDate":"2024-09-10","timestamp":1724207114000,"abstract":"  In the field of medical image segmentation, models based on both CNN and\nTransformer have been thoroughly investigated. However, CNNs have limited\nmodeling capabilities for long-range dependencies, making it challenging to\nexploit the semantic information within images fully. On the other hand, the\nquadratic computational complexity poses a challenge for Transformers. State\nSpace Models (SSMs), such as Mamba, have been recognized as a promising method.\nThey not only demonstrate superior performance in modeling long-range\ninteractions, but also preserve a linear computational complexity. The hybrid\nmechanism of SSM (State Space Model) and Transformer, after meticulous design,\ncan enhance its capability for efficient modeling of visual features. Extensive\nexperiments have demonstrated that integrating the self-attention mechanism\ninto the hybrid part behind the layers of Mamba's architecture can greatly\nimprove the modeling capacity to capture long-range spatial dependencies. In\nthis paper, leveraging the hybrid mechanism of SSM, we propose a U-shape\narchitecture model for medical image segmentation, named Hybird Transformer\nvision Mamba UNet (HTM-UNet). We conduct comprehensive experiments on the\nISIC17, ISIC18, CVC-300, CVC-ClinicDB, Kvasir, CVC-ColonDB, ETIS-Larib PolypDB\npublic datasets and ZD-LCI-GIM private dataset. The results indicate that\nHTM-UNet exhibits competitive performance in medical image segmentation tasks.\nOur code is available at https://github.com/simzhangbest/HMT-Unet.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}