{"id":"2408.04762","title":"Novel adaptation of video segmentation to 3D MRI: efficient zero-shot\n  knee segmentation with SAM2","authors":"Andrew Seohwan Yu, Mohsen Hariri, Xuecen Zhang, Mingrui Yang, Vipin\n  Chaudhary, Xiaojuan Li","authorsParsed":[["Yu","Andrew Seohwan",""],["Hariri","Mohsen",""],["Zhang","Xuecen",""],["Yang","Mingrui",""],["Chaudhary","Vipin",""],["Li","Xiaojuan",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 21:39:15 GMT"}],"updateDate":"2024-08-12","timestamp":1723153155000,"abstract":"  Intelligent medical image segmentation methods are rapidly evolving and being\nincreasingly applied, yet they face the challenge of domain transfer, where\nalgorithm performance degrades due to different data distributions between\nsource and target domains. To address this, we introduce a method for\nzero-shot, single-prompt segmentation of 3D knee MRI by adapting Segment\nAnything Model 2 (SAM2), a general-purpose segmentation model designed to\naccept prompts and retain memory across frames of a video. By treating slices\nfrom 3D medical volumes as individual video frames, we leverage SAM2's advanced\ncapabilities to generate motion- and spatially-aware predictions. We\ndemonstrate that SAM2 can efficiently perform segmentation tasks in a zero-shot\nmanner with no additional training or fine-tuning, accurately delineating\nstructures in knee MRI scans using only a single prompt. Our experiments on the\nOsteoarthritis Initiative Zuse Institute Berlin (OAI-ZIB) dataset reveal that\nSAM2 achieves high accuracy on 3D knee bone segmentation, with a testing Dice\nsimilarity coefficient of 0.9643 on tibia. We also present results generated\nusing different SAM2 model sizes, different prompt schemes, as well as\ncomparative results from the SAM1 model deployed on the same dataset. This\nbreakthrough has the potential to revolutionize medical image analysis by\nproviding a scalable, cost-effective solution for automated segmentation,\npaving the way for broader clinical applications and streamlined workflows.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rmdY8CLxxXfJCjdGWguW5L92foiGkp16OFa7c8v9Qyg","pdfSize":"3354137"}
