{"id":"2408.13078","title":"AEMLO: AutoEncoder-Guided Multi-Label Oversampling","authors":"Ao Zhou, Bin Liu, Jin Wang, Kaiwei Sun, Kelin Liu","authorsParsed":[["Zhou","Ao",""],["Liu","Bin",""],["Wang","Jin",""],["Sun","Kaiwei",""],["Liu","Kelin",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 14:01:33 GMT"}],"updateDate":"2024-08-26","timestamp":1724421693000,"abstract":"  Class imbalance significantly impacts the performance of multi-label\nclassifiers. Oversampling is one of the most popular approaches, as it augments\ninstances associated with less frequent labels to balance the class\ndistribution. Existing oversampling methods generate feature vectors of\nsynthetic samples through replication or linear interpolation and assign labels\nthrough neighborhood information. Linear interpolation typically generates new\nsamples between existing data points, which may result in insufficient\ndiversity of synthesized samples and further lead to the overfitting issue.\nDeep learning-based methods, such as AutoEncoders, have been proposed to\ngenerate more diverse and complex synthetic samples, achieving excellent\nperformance on imbalanced binary or multi-class datasets. In this study, we\nintroduce AEMLO, an AutoEncoder-guided Oversampling technique specifically\ndesigned for tackling imbalanced multi-label data. AEMLO is built upon two\nfundamental components. The first is an encoder-decoder architecture that\nenables the model to encode input data into a low-dimensional feature space,\nlearn its latent representations, and then reconstruct it back to its original\ndimension, thus applying to the generation of new data. The second is an\nobjective function tailored to optimize the sampling task for multi-label\nscenarios. We show that AEMLO outperforms the existing state-of-the-art methods\nwith extensive empirical studies.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}