{"id":"2408.11985","title":"Flat Band Generation through Interlayer Geometric Frustration in\n  Intercalated Transition Metal Dichalcogenides","authors":"Yawen Peng, Ren He, Peng Li, Sergey Zhdanovich, Matteo Michiardi,\n  Sergey Gorovikov, Marta Zonno, Andrea Damascelli, Guo-Xing Miao","authorsParsed":[["Peng","Yawen",""],["He","Ren",""],["Li","Peng",""],["Zhdanovich","Sergey",""],["Michiardi","Matteo",""],["Gorovikov","Sergey",""],["Zonno","Marta",""],["Damascelli","Andrea",""],["Miao","Guo-Xing",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 20:41:01 GMT"}],"updateDate":"2024-08-23","timestamp":1724272861000,"abstract":"  Electronic flat bands can lead to rich many-body quantum phases by quenching\nthe electron's kinetic energy and enhancing many-body correlation. The reduced\nbandwidth can be realized by either destructive quantum interference in\nfrustrated lattices, or by generating heavy band folding with avoided band\ncrossing in Moire superlattices. Here we propose a general approach to\nintroduce flat bands into widely studied transition metal dichalcogenide (TMD)\nmaterials by dilute intercalation, featuring both destructive interference and\nband folding. A flat band with vanishing dispersion is observed by\nangle-resolved photoemission spectroscopy (ARPES) over the entire momentum\nspace in intercalated Mn1/4TaS2. Polarization dependent ARPES measurements\ncombined with symmetry analysis reveal the orbital characters of the flat\nbands. Supercell tight-binding simulations suggest that such flat bands arise\nfrom destructive interference between Mn and Ta wave functions on the S hopping\npathways and are ubiquitous in a range of TMD families as well as in different\nintercalation configurations. Our findings establish a new material platform to\nmanipulate flat band structures and explore their corresponding emergent\ncorrelated properties.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Qo-tiOWJDcIfBFPKNGcViS5SsIgJrInRd-IVwtFg_eo","pdfSize":"1665424"}
