{"id":"2408.05924","title":"Adapting a Foundation Model for Space-based Tasks","authors":"Matthew Foutter, Praneet Bhoj, Rohan Sinha, Amine Elhafsi, Somrita\n  Banerjee, Christopher Agia, Justin Kruger, Tommaso Guffanti, Daniele\n  Gammelli, Simone D'Amico and Marco Pavone","authorsParsed":[["Foutter","Matthew",""],["Bhoj","Praneet",""],["Sinha","Rohan",""],["Elhafsi","Amine",""],["Banerjee","Somrita",""],["Agia","Christopher",""],["Kruger","Justin",""],["Guffanti","Tommaso",""],["Gammelli","Daniele",""],["D'Amico","Simone",""],["Pavone","Marco",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 05:07:24 GMT"}],"updateDate":"2024-08-13","timestamp":1723439244000,"abstract":"  Foundation models, e.g., large language models, possess attributes of\nintelligence which offer promise to endow a robot with the contextual\nunderstanding necessary to navigate complex, unstructured tasks in the wild. In\nthe future of space robotics, we see three core challenges which motivate the\nuse of a foundation model adapted to space-based applications: 1) Scalability\nof ground-in-the-loop operations; 2) Generalizing prior knowledge to novel\nenvironments; and 3) Multi-modality in tasks and sensor data. Therefore, as a\nfirst-step towards building a foundation model for space-based applications, we\nautomatically label the AI4Mars dataset to curate a language annotated dataset\nof visual-question-answer tuples. We fine-tune a pretrained LLaVA checkpoint on\nthis dataset to endow a vision-language model with the ability to perform\nspatial reasoning and navigation on Mars' surface. In this work, we demonstrate\nthat 1) existing vision-language models are deficient visual reasoners in\nspace-based applications, and 2) fine-tuning a vision-language model on\nextraterrestrial data significantly improves the quality of responses even with\na limited training dataset of only a few thousand samples.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0WlV8LbXhX1APYYcj-Ni09Dhe_AEM5-h1Kl98zp-BYU","pdfSize":"5446143"}
