{"id":"2408.10099","title":"Neural Representation of Shape-Dependent Laplacian Eigenfunctions","authors":"Yue Chang, Otman Benchekroun, Maurizio M. Chiaramonte, Peter Yichen\n  Chen, Eitan Grinspun","authorsParsed":[["Chang","Yue",""],["Benchekroun","Otman",""],["Chiaramonte","Maurizio M.",""],["Chen","Peter Yichen",""],["Grinspun","Eitan",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 15:38:53 GMT"}],"updateDate":"2024-08-20","timestamp":1724081933000,"abstract":"  The eigenfunctions of the Laplace operator are essential in mathematical\nphysics, engineering, and geometry processing. Typically, these are computed by\ndiscretizing the domain and performing eigendecomposition, tying the results to\na specific mesh. However, this method is unsuitable for\ncontinuously-parameterized shapes.\n  We propose a novel representation for eigenfunctions in\ncontinuously-parameterized shape spaces, where eigenfunctions are spatial\nfields with continuous dependence on shape parameters, defined by minimal\nDirichlet energy, unit norm, and mutual orthogonality. We implement this with\nmultilayer perceptrons trained as neural fields, mapping shape parameters and\ndomain positions to eigenfunction values.\n  A unique challenge is enforcing mutual orthogonality with respect to\ncausality, where the causal ordering varies across the shape space. Our\ntraining method therefore requires three interwoven concepts: (1) learning $n$\neigenfunctions concurrently by minimizing Dirichlet energy with unit norm\nconstraints; (2) filtering gradients during backpropagation to enforce causal\northogonality, preventing earlier eigenfunctions from being influenced by later\nones; (3) dynamically sorting the causal ordering based on eigenvalues to track\neigenvalue curve crossovers.\n  We demonstrate our method on problems such as shape family analysis,\npredicting eigenfunctions for incomplete shapes, interactive shape\nmanipulation, and computing higher-dimensional eigenfunctions, on all of which\ntraditional methods fall short.\n","subjects":["Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by/4.0/"}