{"id":"2408.10070","title":"Non-planar corrections in ABJM theory from quantum M2 branes","authors":"Simone Giombi, Stefan A. Kurlyand and Arkady A. Tseytlin","authorsParsed":[["Giombi","Simone",""],["Kurlyand","Stefan A.",""],["Tseytlin","Arkady A.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 15:13:33 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 14:37:33 GMT"}],"updateDate":"2024-08-29","timestamp":1724080413000,"abstract":"  The quantization of semiclassical strings in AdS spacetimes yields\npredictions for the strong-coupling behaviour of the scaling dimensions of the\ncorresponding operators in the planar limit of the dual gauge theory. Finding\nnon-planar corrections requires computing string loops (corresponding to torus\nand higher genus surfaces), which is a challenging task. It turns out that in\nthe case of the $U_k(N) \\times U_{-k}(N)$ ABJM theory there is an alternative\napproach: one may semiclassically quantize M2 branes in AdS$_{4}\\times\nS^7/\\mathbb{Z}_{k}$ which are wrapped around the 11d circle of radius $1/k=\n\\lambda/N$. Such M2 branes are the M-theory generalization of the strings in\nAdS$_4\\times $CP$^3$. In this work, we show that by expanding in large M2 brane\ntension $ T_2 \\sim \\sqrt{kN} $ for fixed $k$, followed by an expansion in large\n$k$, we can predict the large $\\lambda$ asymptotics of the non-planar\ncorrections to the dimensions of the dual ABJM operators. As a specific\nexample, we consider the M2 brane configuration that generalizes the long\nfolded string with large spin in AdS$_4$, and compute the 1-loop correction to\nits energy. This calculation allows us to determine non-planar corrections to\nthe universal scaling function or cusp anomalous dimension. We extend our\nanalysis to the semiclassical M2 branes that generalize the \"short\" and \"long\"\ncircular strings with two equal angular momenta in CP$^3$. The \"short\" M2 brane\ncorresponds to a dual operator whose dimension at strong coupling scales as\n$\\Delta \\sim \\lambda^{1/4} + \\dots$, and we derive the leading non-planar\ncorrection to it.\n","subjects":["Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}