{"id":"2408.10855","title":"Influence of Medical Foreign Bodies on Dark-Field Chest Radiographs:\n  First experiences","authors":"Lennard Kaster and Henriette Klein and Alexander W. Marka and Theresa\n  Urban and Sandra Karl and Florian T. Gassert and Lisa Steinhelfer and Marcus\n  R. Makowski and Daniela Pfeiffer and Franz Pfeiffer","authorsParsed":[["Kaster","Lennard",""],["Klein","Henriette",""],["Marka","Alexander W.",""],["Urban","Theresa",""],["Karl","Sandra",""],["Gassert","Florian T.",""],["Steinhelfer","Lisa",""],["Makowski","Marcus R.",""],["Pfeiffer","Daniela",""],["Pfeiffer","Franz",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 13:47:10 GMT"}],"updateDate":"2024-08-21","timestamp":1724161630000,"abstract":"  Objectives: Evaluating the effects and artifacts introduced by medical\nforeign bodies in clinical dark-field chest radiographs and assessing their\ninfluence on the evaluation of pulmonary tissue, compared to conventional\nradiographs.\n  Material & Methods: This retrospective study analyzed data from subjects\nenrolled in clinical trials conducted between 2018 and 2021, focusing on\nchronic obstructive pulmonary disease (COPD) and COVID-19 patients. All\npatients obtained a radiograph using an in-house developed clinical prototype\nfor grating-based dark-field chest radiography. The prototype simultaneously\ndelivers a conventional and dark-field radiograph. Two radiologists\nindependently assessed the clinical studies to identify patients with foreign\nbodies. Subsequently, an analysis was conducted on the effects and artifacts\nattributed to distinct foreign bodies and their impact on the assessment of\npulmonary tissue.\n  Results: Overall, 30 subjects with foreign bodies were included in this study\n(mean age, 64 years +/- 11 [standard deviation]; 15 men). Foreign bodies\ncomposed of materials lacking microstructure exhibited a diminished dark-field\nsignal or no discernible signal. Foreign bodies with a microstructure, in our\ninvestigations the cementation of the kyphoplasty, produce a positive\ndark-field signal. Since most foreign bodies lack microstructural features,\ndark-field imaging revealed fewer signals and artifacts by foreign bodies\ncompared to conventional radiographs.\n  Conclusion: Dark-field radiography enhances the assessment of pulmonary\ntissue with overlaying foreign bodies compared to conventional radiography.\nReduced interfering signals result in fewer overlapping radiopaque artifacts\nwithin the investigated regions. This mitigates the impact on image quality and\ninterpretability of the radiographs and the projection-related limitations of\nradiography compared to CT.\n","subjects":["Physics/Medical Physics","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}