{"id":"2408.07910","title":"DM2RM: Dual-Mode Multimodal Ranking for Target Objects and Receptacles\n  Based on Open-Vocabulary Instructions","authors":"Ryosuke Korekata, Kanta Kaneda, Shunya Nagashima, Yuto Imai, Komei\n  Sugiura","authorsParsed":[["Korekata","Ryosuke",""],["Kaneda","Kanta",""],["Nagashima","Shunya",""],["Imai","Yuto",""],["Sugiura","Komei",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 03:34:02 GMT"}],"updateDate":"2024-08-16","timestamp":1723692842000,"abstract":"  In this study, we aim to develop a domestic service robot (DSR) that, guided\nby open-vocabulary instructions, can carry everyday objects to the specified\npieces of furniture. Few existing methods handle mobile manipulation tasks with\nopen-vocabulary instructions in the image retrieval setting, and most do not\nidentify both the target objects and the receptacles. We propose the Dual-Mode\nMultimodal Ranking model (DM2RM), which enables images of both the target\nobjects and receptacles to be retrieved using a single model based on\nmultimodal foundation models. We introduce a switching mechanism that leverages\na mode token and phrase identification via a large language model to switch the\nembedding space based on the prediction target. To evaluate the DM2RM, we\nconstruct a novel dataset including real-world images collected from hundreds\nof building-scale environments and crowd-sourced instructions with referring\nexpressions. The evaluation results show that the proposed DM2RM outperforms\nprevious approaches in terms of standard metrics in image retrieval settings.\nFurthermore, we demonstrate the application of the DM2RM on a standardized\nreal-world DSR platform including fetch-and-carry actions, where it achieves a\ntask success rate of 82% despite the zero-shot transfer setting. Demonstration\nvideos, code, and more materials are available at\nhttps://kkrr10.github.io/dm2rm/.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}