{"id":"2408.06841","title":"Dwellers in the Deep: Biological Consequences of Dark Oxygen","authors":"Manasvi Lingam, Amedeo Balbi and Madhur Tiwari","authorsParsed":[["Lingam","Manasvi",""],["Balbi","Amedeo",""],["Tiwari","Madhur",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 12:04:00 GMT"}],"updateDate":"2024-08-14","timestamp":1723550640000,"abstract":"  The striking recent putative detection of \"dark oxygen\" (dark O$_2$) sources\non the abyssal ocean floor in the Pacific at $\\sim 4$ km depth raises the\nintriguing scenario that complex (i.e., animal-like) life could exist in\nunderwater environments sans oxygenic photosynthesis. In this work, we thus\nexplore the possible (astro)biological implications of this discovery. From the\navailable data, we roughly estimate the concentration of dissolved O$_2$ and\nthe corresponding O$_2$ partial pressure, as well as the flux of O$_2$\nproduction, associated with dark oxygen sources. Based on these values, we\ninfer that organisms limited by internal diffusion may reach maximal sizes of\n$\\sim 0.1-1$ mm in habitats with dark O$_2$, while those with circulatory\nsystems might achieve sizes of $\\sim 0.1-10$ cm. Optimistically, the estimated\ndark oxygen flux can potentially support biomass densities up to $\\sim 3-30$ g\nm$^{-2}$, perhaps surpassing typical reported densities at similar depths in\nglobal deep-sea surveys. Finally, we outline how oceanic settings with dark\nO$_2$ may facilitate the origin(s) of life via the emergence of electrotrophy.\nOur findings indicate that complex life fueled by dark oxygen is plausibly\ncapable of inhabiting submarine environments devoid of photosynthesis on Earth,\nconceivably extending likewise to extraterrestrial locations such as icy worlds\nwith subsurface oceans (e.g., Enceladus and Europa), which are likely common\nthroughout the Universe.\n","subjects":["Physics/Biological Physics","Astrophysics/Earth and Planetary Astrophysics","Physics/Atmospheric and Oceanic Physics","Quantitative Biology/Populations and Evolution"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}