{"id":"2408.00223","title":"Age of Information Analysis for Multi-Priority Queue and NOMA Enabled\n  C-V2X in IoV","authors":"Zheng Zhang, Qiong Wu, Pingyi Fan, Ke Xiong","authorsParsed":[["Zhang","Zheng",""],["Wu","Qiong",""],["Fan","Pingyi",""],["Xiong","Ke",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 01:32:55 GMT"}],"updateDate":"2024-08-02","timestamp":1722475975000,"abstract":"  As development Internet-of-Vehicles (IoV) technology and demand for\nIntelligent Transportation Systems (ITS) increase, there is a growing need for\nreal-time data and communication by vehicle users. Traditional request-based\nmethods face challenges such as latency and bandwidth limitations. Mode 4 in\nConnected Vehicle-to-Everything (C-V2X) addresses latency and overhead issues\nthrough autonomous resource selection. However, Semi-Persistent Scheduling\n(SPS) based on distributed sensing may lead to increased collision.\nNon-Orthogonal Multiple Access (NOMA) can alleviate the problem of reduced\npacket reception probability due to collisions. Moreover, the concept of Age of\nInformation (AoI) is introduced as a comprehensive metric reflecting\nreliability and latency performance, analyzing the impact of NOMA on C-V2X\ncommunication system. AoI indicates the time a message spends in both local\nwaiting and transmission processes. In C-V2X, waiting process can be extended\nto queuing process, influenced by packet generation rate and Resource\nReservation Interval (RRI). The transmission process is mainly affected by\ntransmission delay and success rate. In C-V2X, a smaller selection window (SW)\nlimits the number of available resources for vehicles, resulting in higher\ncollision rates with increased number of vehicles. SW is generally equal to\nRRI, which not only affects AoI in queuing process but also AoI in the\ntransmission process. Therefore, this paper proposes an AoI estimation method\nbased on multi-priority data type queues and considers the influence of NOMA on\nthe AoI generated in both processes in C-V2X system under different RRI\nconditions. This work aims to gain a better performance of C-V2X system\ncomparing with some known algorithms.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Performance"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}