{"id":"2408.07193","title":"A comparison of methods for estimating the average treatment effect on\n  the treated for externally controlled trials","authors":"Huan Wang, Fei Wu, Yeh-Fong Chen","authorsParsed":[["Wang","Huan",""],["Wu","Fei",""],["Chen","Yeh-Fong",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 20:21:25 GMT"}],"updateDate":"2024-08-15","timestamp":1723580485000,"abstract":"  While randomized trials may be the gold standard for evaluating the\neffectiveness of the treatment intervention, in some special circumstances,\nsingle-arm clinical trials utilizing external control may be considered. The\ncausal treatment effect of interest for single-arm studies is usually the\naverage treatment effect on the treated (ATT) rather than the average treatment\neffect (ATE). Although methods have been developed to estimate the ATT, the\nselection and use of these methods require a thorough comparison and in-depth\nunderstanding of the advantages and disadvantages of these methods. In this\nstudy, we conducted simulations under different identifiability assumptions to\ncompare the performance metrics (e.g., bias, standard deviation (SD), mean\nsquared error (MSE), type I error rate) for a variety of methods, including the\nregression model, propensity score matching, Mahalanobis distance matching,\ncoarsened exact matching, inverse probability weighting, augmented inverse\nprobability weighting (AIPW), AIPW with SuperLearner, and targeted maximum\nlikelihood estimator (TMLE) with SuperLearner.\n  Our simulation results demonstrate that the doubly robust methods in general\nhave smaller biases than other methods. In terms of SD, nonmatching methods in\ngeneral have smaller SDs than matching-based methods. The performance of MSE is\na trade-off between the bias and SD, and no method consistently performs better\nin term of MSE. The identifiability assumptions are critical to the models'\nperformance: violation of the positivity assumption can lead to a significant\ninflation of type I errors in some methods; violation of the unconfoundedness\nassumption can lead to a large bias for all methods... (Further details are\navailable in the main body of the paper).\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}