{"id":"2408.02371","title":"X-ray Flux and Spectral Variability of the Blazar OJ 287 with Suzaku","authors":"Dongtao Zhou, Zhongli Zhang, Alok C. Gupta, Pankaj Kushwaha, Paul J.\n  Wiita, Minfeng Gu and Haiguang Xu","authorsParsed":[["Zhou","Dongtao",""],["Zhang","Zhongli",""],["Gupta","Alok C.",""],["Kushwaha","Pankaj",""],["Wiita","Paul J.",""],["Gu","Minfeng",""],["Xu","Haiguang",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 10:49:28 GMT"}],"updateDate":"2024-08-06","timestamp":1722854968000,"abstract":"  We present analyses of Suzaku XIS light curves and spectra of the BL Lac\nobject OJ 287 with observations positioned primarily around proposed recurrent\noptical outbursts. The first two observations were performed in 2007 April 10 -\n13 (epoch 1) and 2007 November 7 - 9 (epoch 2) that respectively correspond to\na low and a high optical state and which, within the binary supermassive black\nhole model for OJ 287, precede and follow the impact flare. The last three\nobservations, made consecutively during 2015 May 3 - 9 (epoch 3), were during\nthe post-impact state of the 2013 disc impact and are the longest continuous\nX-ray observation of OJ 287 taken before the optical outburst in 2015 December.\nIntraday variability is found in both the soft (0.5 - 2 keV) and hard (2 - 10\nkeV) bands. The discrete correction function analysis of the light curves in\nboth bands peaks at zero lag during epochs 2 and 3, indicating that the\nemission in both bands was cospatial and emitted from the same population of\nleptons. Power spectral densities of all three light curves are red noise\ndominated, with a rather wide range of power spectrum slopes. These X-ray\nspectra are overall consistent with power-laws but with significantly different\nspectral indices. In the 2015 observations the X-ray spectrum softens during\nthe flare, showing an obvious soft X-ray excess that was not evident in the\n2007 observations. We discuss the implications of these observations on the\njet, the possible accretion disc, and the binary supermassive black hole model\nproposed for the nearly periodic optical flaring of OJ 287.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}