{"id":"2408.07198","title":"Experimental tests of the full spin torque conductivity tensor in\n  epitaxial IrO2 thin films","authors":"Michael Patton, Daniel A. Pharis, Gautam Gurung, Xiaoxi Huang, Gahee\n  Noh, Evgeny Y. Tsymbal, Si-Young Choi, Daniel C. Ralph, Mark S. Rzchowski,\n  Chang-Beom Eom","authorsParsed":[["Patton","Michael",""],["Pharis","Daniel A.",""],["Gurung","Gautam",""],["Huang","Xiaoxi",""],["Noh","Gahee",""],["Tsymbal","Evgeny Y.",""],["Choi","Si-Young",""],["Ralph","Daniel C.",""],["Rzchowski","Mark S.",""],["Eom","Chang-Beom",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 20:48:40 GMT"}],"updateDate":"2024-08-15","timestamp":1723582120000,"abstract":"  Unconventional spin-orbit torques arising from electric-field-generated spin\ncurrents in anisotropic materials have promising potential for spintronic\napplications, including for perpendicular magnetic switching in high-density\nmemory applications. Here we determine all the independent elements of the spin\ntorque conductivity tensor allowed by bulk crystal symmetries for the\ntetragonal conductor IrO2, via measurements of conventional (in plane)\nantidamping torques for IrO2 thin films in the high-symmetry (001) and (100)\norientations. We then test that rotational transformations of this same tensor\ncan predict both the conventional and unconventional anti-damping torques for\nIrO2 thin films in the lower-symmetry (101), (110), and (111) orientations,\nfinding good agreement. The results confirm that spin-orbit torques from all\nthese orientations are consistent with the bulk symmetries of IrO2, and show\nhow simple measurements of conventional torques from high-symmetry orientations\nof anisotropic thin films can provide an accurate prediction of the\nunconventional torques from lower-symmetry orientations.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1ALGdPFinwvPW58DWGygGYpLVHAN_yaa2E7HeNiUIvA","pdfSize":"2264926"}
