{"id":"2408.16988","title":"Periodic Coronal Rain Driven by Self-consistent Heating Process in a\n  Radiative Magnetohydrodynamic Simulation","authors":"Zekun Lu, Feng Chen, J. H. Guo, M. D. Ding, Can Wang, Haocheng Yu, Y.\n  W. Ni, Chun Xia","authorsParsed":[["Lu","Zekun",""],["Chen","Feng",""],["Guo","J. H.",""],["Ding","M. D.",""],["Wang","Can",""],["Yu","Haocheng",""],["Ni","Y. W.",""],["Xia","Chun",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 03:24:37 GMT"}],"updateDate":"2024-09-02","timestamp":1724988277000,"abstract":"  The periodic coronal rain and in-phase radiative intensity pulsations have\nbeen observed in multiple wavelengths in recent years. However, due to the lack\nof three-dimensional coronal magnetic fields and thermodynamic data in\nobservations, it remains challenging to quantify the coronal heating rate that\ndrives the mass cycles. In this work, based on the MURaM code, we conduct a\nthree-dimensional radiative magnetohydrodynamic simulation spanning from the\nconvective zone to the corona, where the solar atmosphere is heated\nself-consistently through dissipation resulting from magneto-convection. For\nthe first time, we model the periodic coronal rain in an active region. With a\nhigh spatial resolution, the simulation well resembles the observational\nfeatures across different extreme ultraviolet wavelengths. These include the\nrealistic interweaving coronal loops, periodic coronal rain and periodic\nintensity pulsations, with two periods of 3.0~h and 3.7~h identified within one\nloop system. Moreover, the simulation allows for a detailed three-dimensional\ndepiction of coronal rain on small scales, revealing adjacent shower-like rain\nclumps $\\sim500$~km in width and showcasing their multi-thermal internal\nstructures. We further reveal that these periodic variations essentially\nreflect the cyclic energy evolution of the coronal loop under thermal\nnon-equilibrium state. Importantly, as the driver of the mass circulation, the\nself-consistent coronal heating rate is considerably complex in time and space,\nwith hour-level variations in one order of magnitude, minute-level bursts, and\nvarying asymmetry reaching ten times between footpoints. This provides an\ninstructive template for the ad hoc heating function, and further enhances our\nunderstanding of the coronal heating process.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}