{"id":"2408.08372","title":"On the Algebra of the Infrared with Twisted Masses","authors":"Ahsan Z. Khan, Gregory W. Moore","authorsParsed":[["Khan","Ahsan Z.",""],["Moore","Gregory W.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 18:32:45 GMT"}],"updateDate":"2024-08-19","timestamp":1723746765000,"abstract":"  The Algebra of the Infrared \\cite{Gaiotto:2015aoa} is a framework to\nconstruct local observables, interfaces, and categories of supersymmetric\nboundary conditions of massive $\\mathcal{N}=(2,2)$ theories in two dimensions\nby using information only about the BPS sector. The resulting framework is\nknown as the ``web-based formalism.'' In this paper we initiate the\ngeneralization of the web-based formalism to include a much wider class of\n$\\mathcal{N}=(2,2)$ quantum field theories than was discussed in\n\\cite{Gaiotto:2015aoa}: theories with non-trivial twisted masses. The essential\nnew ingredient is the presence of BPS particles within a fixed vacuum sector.\nIn this paper we work out the web-based formalism for the simplest class of\ntheories that allow for such BPS particles: theories with a single vacuum and a\nsingle twisted mass. We show that even in this simple setting there are\ninteresting new phenomenon including the emergence of Fock spaces of closed\nsolitons and a natural appearance of Koszul dual algebras. Mathematically,\nstudying theories with twisted masses includes studying the Fukaya-Seidel\ncategory of A-type boundary conditions for Landau-Ginzburg models defined by a\nclosed holomorphic one-form. This paper sketches a web-based construction for\nthe category of A-type boundary conditions for one-forms with a single Morse\nzero and a single non-trivial period. We demonstrate our formalism explicitly\nin a particularly instructive example.\n","subjects":["Physics/High Energy Physics - Theory","Mathematics/Quantum Algebra","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}