{"id":"2408.11507","title":"An Improved CovidConvLSTM model for pneumonia-COVID-19 detection and\n  classification","authors":"Imane Beghoura, Mustapha Benssalah and Fazia Sbargoud","authorsParsed":[["Beghoura","Imane",""],["Benssalah","Mustapha",""],["Sbargoud","Fazia",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 10:27:14 GMT"}],"updateDate":"2024-08-22","timestamp":1724236034000,"abstract":"  Recently, COVID-19 pandemic has rapidly evolved into a critical global health\ncrisis, profoundly impacting daily life. As a result, CAD systems have gained\nsignificant interest for its massive computational capabilities, which\nfacilitate the rapid analysis and interpretation of medical imaging. In\nparticular, Deep Learning (DL )techniques have emerged as critical tools to\nassist radiologists and pulmonologists in distinguishing COVID-19 patients from\nother pneumonia types and healthy cases. Unfortunately, existing DL techniques\nface several challenges such as overfitting, performance degradation, feature\nirrelevance and redundancy, vanishing gradient problem, and high computational\ncomplexity. In this paper we address these challenges by introducing an\nenhanced Convolutional Neural Network algorithm that combines a bottleneck\nbased model RegNetX002, ConvLstm layer, and Squeeze and Excitation block (SE).\nSpecifically, the RegNetx002 and the ConvLstm layer are used for features map\nextraction and feature quality enhancement, while the attention mechanism SE\nblock is employed to improve feature representation by highlighting important\nchannel features and suppressing unimportant features. More importantly, The\nbottleneck module facilitates the extraction of more abstract features while\nlowering computational costs. Additionally, it incorporates residual\nconnections that helps reducing the vanishing gradient problem. Balanced\nCPN-CXRPA and imbalanced CXRI-P/C-CXR datasets are used to assess the proposed\nmodel. Performance metrics such as accuracy and F1 score are used to evaluate\nthe model efficiency. Using the CPN-CXRPA dataset, our model achieved an\naccuracy of 98.22%. For the CXRI-P-C-CXR dataset, it achieved 98.78% of both\naccuracy and F1 score. The experimental results show that this framework\noutperforms existing models in terms of performance and computational\ncomplexity.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"opT5u7KKN7FPTP-_1Aha8PoV2Mm89bDXkBjrGDtBG18","pdfSize":"681648"}
