{"id":"2408.16866","title":"GameIR: A Large-Scale Synthesized Ground-Truth Dataset for Image\n  Restoration over Gaming Content","authors":"Lebin Zhou, Kun Han, Nam Ling, Wei Wang, Wei Jiang","authorsParsed":[["Zhou","Lebin",""],["Han","Kun",""],["Ling","Nam",""],["Wang","Wei",""],["Jiang","Wei",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 19:11:46 GMT"}],"updateDate":"2024-09-02","timestamp":1724958706000,"abstract":"  Image restoration methods like super-resolution and image synthesis have been\nsuccessfully used in commercial cloud gaming products like NVIDIA's DLSS.\nHowever, restoration over gaming content is not well studied by the general\npublic. The discrepancy is mainly caused by the lack of ground-truth gaming\ntraining data that match the test cases. Due to the unique characteristics of\ngaming content, the common approach of generating pseudo training data by\ndegrading the original HR images results in inferior restoration performance.\nIn this work, we develop GameIR, a large-scale high-quality\ncomputer-synthesized ground-truth dataset to fill in the blanks, targeting at\ntwo different applications. The first is super-resolution with deferred\nrendering, to support the gaming solution of rendering and transferring LR\nimages only and restoring HR images on the client side. We provide 19200 LR-HR\npaired ground-truth frames coming from 640 videos rendered at 720p and 1440p\nfor this task. The second is novel view synthesis (NVS), to support the\nmultiview gaming solution of rendering and transferring part of the multiview\nframes and generating the remaining frames on the client side. This task has\n57,600 HR frames from 960 videos of 160 scenes with 6 camera views. In addition\nto the RGB frames, the GBuffers during the deferred rendering stage are also\nprovided, which can be used to help restoration. Furthermore, we evaluate\nseveral SOTA super-resolution algorithms and NeRF-based NVS algorithms over our\ndataset, which demonstrates the effectiveness of our ground-truth GameIR data\nin improving restoration performance for gaming content. Also, we test the\nmethod of incorporating the GBuffers as additional input information for\nhelping super-resolution and NVS. We release our dataset and models to the\ngeneral public to facilitate research on restoration methods over gaming\ncontent.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}