{"id":"2408.13983","title":"Dual-Path Adversarial Lifting for Domain Shift Correction in Online\n  Test-time Adaptation","authors":"Yushun Tang, Shuoshuo Chen, Zhihe Lu, Xinchao Wang, Zhihai He","authorsParsed":[["Tang","Yushun",""],["Chen","Shuoshuo",""],["Lu","Zhihe",""],["Wang","Xinchao",""],["He","Zhihai",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 02:33:47 GMT"}],"updateDate":"2024-08-27","timestamp":1724639627000,"abstract":"  Transformer-based methods have achieved remarkable success in various machine\nlearning tasks. How to design efficient test-time adaptation methods for\ntransformer models becomes an important research task. In this work, motivated\nby the dual-subband wavelet lifting scheme developed in multi-scale signal\nprocessing which is able to efficiently separate the input signals into\nprincipal components and noise components, we introduce a dual-path token\nlifting for domain shift correction in test time adaptation. Specifically, we\nintroduce an extra token, referred to as \\textit{domain shift token}, at each\nlayer of the transformer network. We then perform dual-path lifting with\ninterleaved token prediction and update between the path of domain shift tokens\nand the path of class tokens at all network layers. The prediction and update\nnetworks are learned in an adversarial manner. Specifically, the task of the\nprediction network is to learn the residual noise of domain shift which should\nbe largely invariant across all classes and all samples in the target domain.\nIn other words, the predicted domain shift noise should be indistinguishable\nbetween all sample classes. On the other hand, the task of the update network\nis to update the class tokens by removing the domain shift from the input image\nsamples so that input samples become more discriminative between different\nclasses in the feature space. To effectively learn the prediction and update\nnetworks with two adversarial tasks, both theoretically and practically, we\ndemonstrate that it is necessary to use smooth optimization for the update\nnetwork but non-smooth optimization for the prediction network. Experimental\nresults on the benchmark datasets demonstrate that our proposed method\nsignificantly improves the online fully test-time domain adaptation\nperformance. Code is available at \\url{https://github.com/yushuntang/DPAL}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}