{"id":"2408.01562","title":"Welfare, sustainability, and equity evaluation of the New York City\n  Interborough Express using spatially heterogeneous mode choice models","authors":"Hai Yang, Hongying Wu, Lauren Whang, Xiyuan Ren, Joseph Y. J. Chow","authorsParsed":[["Yang","Hai",""],["Wu","Hongying",""],["Whang","Lauren",""],["Ren","Xiyuan",""],["Chow","Joseph Y. J.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 20:27:21 GMT"}],"updateDate":"2024-08-06","timestamp":1722630441000,"abstract":"  The Metropolitan Transit Authority (MTA) proposed building a new light rail\nroute called the Interborough Express (IBX) to provide a direct, fast transit\nlinkage between Queens and Brooklyn. An open-access synthetic citywide trip\nagenda dataset and a block-group-level mode choice model are used to assess the\npotential impact IBX could bring to New York City (NYC). IBX could save 28.1\nminutes to potential riders across the city. For travelers either going to or\ndeparting from areas close to IBX, the average time saving is projected to be\n29.7 minutes. IBX is projected to have more than 254 thousand daily ridership\nafter its completion (69% higher than reported in the official IBX proposal).\nAmong those riders, more than 78 thousand people (30.8%) would come from\nlow-income households while 165 thousand people (64.7%) would start or end\nalong the IBX corridor. The addition of IBX would attract more than 50 thousand\nadditional daily trips to transit mode, among which more than 16 thousand would\nbe switched from using private vehicles, reducing potential greenhouse gas\n(GHG) emissions by 29.28 metric tons per day. IBX can also bring significant\nconsumer surplus benefits to the communities, which are estimated to be $1.25\nUSD per trip, or as high as $1.64 per trip made by a low-income traveler. While\nbenefits are proportionately higher for lower-income users, the service does\nnot appear to significantly reduce the proportion of travelers whose consumer\nsurpluses fall below 10% of the population average (already quite low).\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}