{"id":"2408.06654","title":"Advancing Nonadiabatic Molecular Dynamics Simulations for Solids:\n  Achieving Supreme Accuracy and Efficiency with Machine Learning","authors":"Changwei Zhang, Yang Zhong, Zhi-Guo Tao, Xinming Qing, Honghui Shang,\n  Zhenggang Lan, Oleg V. Prezhdo, Xin-Gao Gong, Weibin Chu, Hongjun Xiang","authorsParsed":[["Zhang","Changwei",""],["Zhong","Yang",""],["Tao","Zhi-Guo",""],["Qing","Xinming",""],["Shang","Honghui",""],["Lan","Zhenggang",""],["Prezhdo","Oleg V.",""],["Gong","Xin-Gao",""],["Chu","Weibin",""],["Xiang","Hongjun",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 05:55:38 GMT"}],"updateDate":"2024-08-14","timestamp":1723528538000,"abstract":"  Non-adiabatic molecular dynamics (NAMD) simulations have become an\nindispensable tool for investigating excited-state dynamics in solids. In this\nwork, we propose a general framework, N$^2$AMD which employs an\nE(3)-equivariant deep neural Hamiltonian to boost the accuracy and efficiency\nof NAMD simulations. The preservation of Euclidean symmetry of Hamiltonian\nenables N$^2$AMD to achieve state-of-the-art performance. Distinct from\nconventional machine learning methods that predict key quantities in NAMD,\nN$^2$AMD computes these quantities directly with a deep neural Hamiltonian,\nensuring supreme accuracy, efficiency, and consistency. Furthermore, N$^2$AMD\ndemonstrates excellent generalizability and enables seamless integration with\nadvanced NAMD techniques and infrastructures. Taking several extensively\ninvestigated semiconductors as the prototypical system, we successfully\nsimulate carrier recombination in both pristine and defective systems at large\nscales where conventional NAMD often significantly underestimates or even\nqualitatively incorrectly predicts lifetimes. This framework not only boosts\nthe efficiency and precision of NAMD simulations but also opens new avenues to\nadvance materials research.\n","subjects":["Physics/Computational Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"AJJZqoB5mcdke7eSLgZkDe49Yh82LVnavpeSpqEetEQ","pdfSize":"5500423"}
