{"id":"2408.10459","title":"Distinct Numerical Solutions for Elliptic Cross-Interface Problems Using\n  Finite Element and Finite Difference Methods","authors":"Qiwei Feng","authorsParsed":[["Feng","Qiwei",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 00:05:16 GMT"},{"version":"v2","created":"Sat, 31 Aug 2024 14:50:34 GMT"}],"updateDate":"2024-09-04","timestamp":1724112316000,"abstract":"  In this paper, we discuss the second-order finite element method (FEM) and\nfinite difference method (FDM) for numerically solving elliptic cross-interface\nproblems characterized by vertical and horizontal straight lines, piecewise\nconstant coefficients, two homogeneous jump conditions, continuous source\nterms, and Dirichlet boundary conditions. For brevity, we consider a 2D\nsimplified version where the intersection points of the interface lines\ncoincide with grid points in uniform Cartesian grids. Our findings reveal\ninteresting and important results: (1) When the coefficient functions exhibit\neither high jumps with low-frequency oscillations or low jumps with\nhigh-frequency oscillations, the finite element method and finite difference\nmethod yield similar numerical solutions. (2) However, when the interface\nproblems involve high-contrast and high-frequency coefficient functions, the\nnumerical solutions obtained from the finite element and finite difference\nmethods differ significantly. Given that the widely studied SPE10 benchmark\nproblem (see https://www.spe.org/web/csp/datasets/set02.htm) typically involves\nhigh-contrast and high-frequency permeability due to varying geological layers\nin porous media, this phenomenon warrants attention. Furthermore, this\nobservation is particularly important for developing multiscale methods, as\nreference solutions for these methods are usually obtained using the standard\nsecond-order finite element method with a fine mesh, and analytical solutions\nare not available. We provide sufficient details to enable replication of our\nnumerical results, and the implementation is straightforward. This simplicity\nensures that readers can easily confirm the validity of our findings.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}