{"id":"2408.17270","title":"A Generic and Automated Methodology to Simulate Melting Point","authors":"Fu-Zhi Dai, Si-Hao Yuan, Yan-Bo Hao, Xin-Fu Gu, Shipeng Zhu, Jidong\n  Hu, Yifen Xu","authorsParsed":[["Dai","Fu-Zhi",""],["Yuan","Si-Hao",""],["Hao","Yan-Bo",""],["Gu","Xin-Fu",""],["Zhu","Shipeng",""],["Hu","Jidong",""],["Xu","Yifen",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 13:15:03 GMT"}],"updateDate":"2024-09-02","timestamp":1725023703000,"abstract":"  The melting point of a material constitutes a pivotal property with profound\nimplications across various disciplines of science, engineering, and\ntechnology. Recent advancements in machine learning potentials have\nrevolutionized the field, enabling ab initio predictions of materials' melting\npoints through atomic-scale simulations. However, a universal simulation\nmethodology that can be universally applied to any material remains elusive. In\nthis paper, we present a generic, fully automated workflow designed to predict\nthe melting points of materials utilizing molecular dynamics simulations. This\nworkflow incorporates two tailored simulation modalities, each addressing\nscenarios with and without elemental partitioning between solid and liquid\nphases. When the compositions of both phases remain unchanged upon melting or\nsolidification, signifying the absence of partitioning, the melting point is\nidentified as the temperature at which these phases coexist in equilibrium.\nConversely, in cases where elemental partitioning occurs, our workflow\nestimates both the nominal melting point, marking the initial transition from\nsolid to liquid, and the nominal solidification point, indicating the reverse\nprocess. To ensure precision in determining these critical temperatures, we\nemploy an innovative temperature-volume data fitting technique, suitable for a\ndiverse range of materials exhibiting notable volume disparities between their\nsolid and liquid states. This comprehensive approach offers a robust and\nversatile solution for predicting melting points, fostering advancements in\nmaterials science and technology.\n","subjects":["Condensed Matter/Materials Science","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}