{"id":"2408.02003","title":"Exact planetary waves and jet streams","authors":"Nick Pizzo and Rick Salmon","authorsParsed":[["Pizzo","Nick",""],["Salmon","Rick",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 11:59:36 GMT"}],"updateDate":"2024-08-06","timestamp":1722772776000,"abstract":"  We investigate exact nonlinear waves on surfaces locally approximating the\nrotating sphere for two-dimensional inviscid incompressible flow. Our first\nsystem corresponds to a beta-plane approximation at the equator and the second\nto a gamma approximation, with the latter describing flow near the poles. We\nfind exact wave solutions in the Lagrangian reference frame that cannot be\nwritten down in closed form in the Eulerian reference frame. The wave particle\ntrajectories, contours of potential vorticity and Lagrangian mean velocity take\nrelatively simple forms. The waves possess a non-trivial Lagrangian mean flow\nthat depends on the amplitude of the waves and on a particle label that\ncharacterizes values of constant potential vorticity. The mean flow arises due\nto potential vorticity conservation on fluid particles. Solutions over the\nentire space are generated by assuming that the flow far from the origin is\nzonal and there is a region of constant potential vorticity between this zonal\nflow and the waves. In the gamma approximation a class of waves are found\nwhich, based on analogous solutions on the plane, we call Ptolemaic vortex\nwaves. The mean flow of some of these waves resemble polar jet streams. Several\nillustrative solutions are used as initial conditions in the fully spherical\nrotating Navier-Stokes equations, where integration is performed via the\nnumerical scheme presented in Salmon and Pizzo (2023). The potential vorticity\ncontours found from these numerical experiments vary between stable permanent\nprogressive form and fully turbulent flows generated by wave breaking.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}