{"id":"2408.01296","title":"Towards UV Models of Kinetic Mixing and Portal Matter: A More Complex\n  Dark Matter Sector?","authors":"Thomas G. Rizzo","authorsParsed":[["Rizzo","Thomas G.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 14:36:22 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 23:52:01 GMT"},{"version":"v3","created":"Sun, 18 Aug 2024 14:14:49 GMT"}],"updateDate":"2024-08-20","timestamp":1722609382000,"abstract":"  Portal Matter, with both SM and dark charges, induces KM between the $U(1)_D$\ndark photon and the SM gauge fields offering an attractive mechanism by which\nlight thermal DM can obtain its observed relic density. If DM is fermionic, the\nCMB informs us that it must be Majorana/pseudo-Dirac in nature to avoid\ntemperature-independent $s$-wave annihilation to SM states. How does this fit\ninto a more complete picture with the SM? A first step along this path may not\nlie far away in energy due to the RGE running of the dark gauge coupling which\ncan becomes non-perturbative before the $\\sim 10$'s of TeV range. This implies\nthat $U(1)_D$ must become embedded in a non-Abelian group, $G_D$, before this\noccurs. The breaking of this group then produces the PM masses and the heavy\ngauge fields associated with $G_D$ lead to new interactions between the SM and\nthe dark sector. In the past we have examined a set of distinctive\nphenomenological features associated with this setup, based upon a number of\nsimplifying assumptions. It behooves us to explore the impact of these\nassumptions on the predictions for possible experimental tests of these models.\nIn past analyses we assumed that DM is a VL, complex singlet under $G_D$. If\nthis assumption is relaxed, the dark sector must be augmented by additional\nfermion(s) and the scalar fields needed to break the symmetries while\ngenerating the needed Majorana-like mass terms for the DM. Here we analyze the\nsimplest extension of this kind wherein the DM lies in a VL doublet of $G_D$,\nwhich we take to have the structure $SU(2)_I\\times U(1)_{Y_I}$, leading to new\nphenomenology. We find that given the current LHC search constraints on the\nmasses of heavy gauge bosons, the production of these new dark states with\nlarge rates is unlikely at colliders unless they are produced singly in\n$gg$-fusion or are resonantly enhanced.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}