{"id":"2408.13937","title":"Electronic correlations and long-range magnetic ordering in NiO tuned by\n  pressure","authors":"G. M. Gaifutdinov and I. V. Leonov","authorsParsed":[["Gaifutdinov","G. M.",""],["Leonov","I. V.",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 20:55:32 GMT"},{"version":"v2","created":"Sun, 8 Sep 2024 17:28:04 GMT"}],"updateDate":"2024-09-10","timestamp":1724619332000,"abstract":"  Using the DFT+dynamical mean-field theory method we revisit the\npressure-temperature phase diagram of the prototypical correlated insulator\nNiO. We study the pressure-induced evolution of the electronic structure,\nmagnetic state, and exchange couplings of the antiferromagnetic phase of NiO.\nWe calculate the ordered magnetic moments and uniform spin susceptibility of\nthe Ni $3d$ states of NiO, which allow us to determine the pressure-dependence\nof the N\\'eel temperature $T_N$. We note that the long-range magnetism has no\nsignificant effects on the valence band photoemission spectra of NiO under\nmoderate compressions, implying the importance of correlations effects to\nexplain the insulating state of NiO. The antiferromagnetic insulating state is\nfound to be stable up to the high compression value $\\sim$0.4 $V_0$ (assuming\nthe cubic $B1$ crystal structure of NiO), and is associated with a\n(correlated-assisted) Slater insulating state driven by the long-range magnetic\nordering. In fact, the paramagnetic phase of NiO at such high compression is\nfound to be metallic, implying delocalization of the Ni $3d$ states. The\ncalculated $T_N$ exhibits a non-monotonic behavior upon compression, with a\nmaximum associated with the crossover from Mott localized (strong coupling) to\nitinerant moment regimes, in qualitative agreement with the phase diagram of\nthe half-filled single-band Hubbard model. We point out the importance of the\nnon-local correlation effects to explain the magnetic properties of NiO.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}