{"id":"2408.00755","title":"Thermal Conductivity Predictions with Foundation Atomistic Models","authors":"Bal\\'azs P\\'ota, Paramvir Ahlawat, G\\'abor Cs\\'anyi, and Michele\n  Simoncelli","authorsParsed":[["P칩ta","Bal치zs",""],["Ahlawat","Paramvir",""],["Cs치nyi","G치bor",""],["Simoncelli","Michele",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 17:57:24 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 17:58:01 GMT"},{"version":"v3","created":"Thu, 29 Aug 2024 16:32:58 GMT"},{"version":"v4","created":"Thu, 12 Sep 2024 05:13:52 GMT"}],"updateDate":"2024-09-13","timestamp":1722535044000,"abstract":"  Advances in machine learning have led to the development of foundation models\nfor atomistic materials chemistry, enabling quantum-accurate descriptions of\ninteratomic forces across diverse compounds at reduced computational cost.\nHitherto, these models have been benchmarked relying on descriptors based on\natoms' interaction energies or harmonic vibrations; their accuracy and\nefficiency in predicting observable and technologically relevant\nheat-conduction properties remains unknown. Here, we introduce a framework that\nleverages foundation models and the Wigner formulation of heat transport to\novercome the major bottlenecks of current methods for designing heat-management\nmaterials: high cost, limited transferability, or lack of physics awareness. We\npresent the standards needed to achieve first-principles accuracy in\nconductivity predictions through model's fine-tuning, discussing benchmark\nmetrics and precision/cost trade-offs. We apply our framework to a database of\nsolids with diverse compositions and structures, demonstrating its potential to\ndiscover materials for next-gen technologies ranging from thermal insulation to\nneuromorphic computing.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tUqlUrKG_M7aBNkJF5tKtmWlDTUtUQuot2uEVnq7Svs","pdfSize":"4212109","txDigest":"3xgj4748xUUn4wmknwq7T9GYYXGYEFqiRDnFunUSwi11","endEpoch":"1","status":"CERTIFIED"}
