{"id":"2408.00320","title":"Discovery of a metallic room-temperature d-wave altermagnet KV2Se2O","authors":"Bei Jiang, Mingzhe Hu, Jianli Bai, Ziyin Song, Chao Mu, Gexing Qu, Wan\n  Li, Wenliang Zhu, Hanqi Pi, Zhongxu Wei, Yujie Sun, Yaobo Huang, Xiquan\n  Zheng, Yingying Peng, Lunhua He, Shiliang Li, Jianlin Luo, Zheng Li, Genfu\n  Chen, Hang Li, Hongming Weng, and Tian Qian","authorsParsed":[["Jiang","Bei",""],["Hu","Mingzhe",""],["Bai","Jianli",""],["Song","Ziyin",""],["Mu","Chao",""],["Qu","Gexing",""],["Li","Wan",""],["Zhu","Wenliang",""],["Pi","Hanqi",""],["Wei","Zhongxu",""],["Sun","Yujie",""],["Huang","Yaobo",""],["Zheng","Xiquan",""],["Peng","Yingying",""],["He","Lunhua",""],["Li","Shiliang",""],["Luo","Jianlin",""],["Li","Zheng",""],["Chen","Genfu",""],["Li","Hang",""],["Weng","Hongming",""],["Qian","Tian",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 06:42:49 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 22:35:59 GMT"}],"updateDate":"2024-08-15","timestamp":1722494569000,"abstract":"  Beyond conventional ferromagnetism and antiferromagnetism, altermagnetism is\na recently discovered unconventional magnetic phase characterized by\ntime-reversal symmetry breaking and spin-split band structures in materials\nwith zero net magnetization. This distinct magnetic phase not only enriches the\nunderstanding of fundamental physical concepts but also has profound impacts on\ncondense-matter physics research and practical device applications.\nSpin-polarized band structures have been recently observed in semiconductors\nMnTe and MnTe2 with vanishing net magnetization, confirming the existence of\nthis unconventional magnetic order. Metallic altermagnets have unique\nadvantages for exploring novel physical phenomena related to low-energy\nquasiparticle excitations and for applications in spintronics as electrical\nconductivity in metals allows the direct manipulation of spin current through\nelectric field. Here, through comprehensive characterization and analysis of\nthe magnetic and electronic structures of KV2Se2O, we have unambiguously\ndemonstrated a metallic room-temperature altermaget with d-wave spin-momentum\nlocking. The highly anisotropic spin-polarized Fermi surfaces and the\nspin-density-wave order emerging in the altermagnetic phase make it an\nextraordinary platform for designing high-performance spintronic devices and\nstudying many-body effects coupled with the unconventional magnetism.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"P5sG_s7wmdYocfMVAjv2XyiP6Cf_5vsFcNpk34msPkM","pdfSize":"2078312","txDigest":"12K8pWi5UX66A1kVVW9qoevGxYFTFXRuuXoS8ofFdXxi","endEpoch":"1","status":"CERTIFIED"}
