{"id":"2408.13474","title":"Ridge, lasso, and elastic-net estimations of the modified Poisson and\n  least-squares regressions for binary outcome data","authors":"Takahiro Kitano, Hisashi Noma","authorsParsed":[["Kitano","Takahiro",""],["Noma","Hisashi",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 05:18:50 GMT"}],"updateDate":"2024-08-27","timestamp":1724476730000,"abstract":"  Logistic regression is a standard method in multivariate analysis for binary\noutcome data in epidemiological and clinical studies; however, the resultant\nodds-ratio estimates fail to provide directly interpretable effect measures.\nThe modified Poisson and least-squares regressions are alternative standard\nmethods that can provide risk-ratio and risk difference estimates without\ncomputational problems. However, the bias and invalid inference problems of\nthese regression analyses under small or sparse data conditions (i.e.,the\n\"separation\" problem) have been insufficiently investigated. We show that the\nseparation problem can adversely affect the inferences of the modified Poisson\nand least squares regressions, and to address these issues, we apply the ridge,\nlasso, and elastic-net estimating approaches to the two regression methods. As\nthe methods are not founded on the maximum likelihood principle, we propose\nregularized quasi-likelihood approaches based on the estimating equations for\nthese generalized linear models. The methods provide stable shrinkage estimates\nof risk ratios and risk differences even under separation conditions, and the\nlasso and elastic-net approaches enable simultaneous variable selection. We\nprovide a bootstrap method to calculate the confidence intervals on the basis\nof the regularized quasi-likelihood estimation. The proposed methods are\napplied to a hematopoietic stem cell transplantation cohort study and the\nNational Child Development Survey. We also provide an R package, regconfint, to\nimplement these methods with simple commands.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}