{"id":"2408.13217","title":"HBIC: A Biclustering Algorithm for Heterogeneous Datasets","authors":"Ad\\'an Jos\\'e-Garc\\'ia, Julie Jacques, Cl\\'ement Chauvet, Vincent\n  Sobanski, Clarisse Dhaenens","authorsParsed":[["José-García","Adán",""],["Jacques","Julie",""],["Chauvet","Clément",""],["Sobanski","Vincent",""],["Dhaenens","Clarisse",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 16:48:10 GMT"}],"updateDate":"2024-08-26","timestamp":1724431690000,"abstract":"  Biclustering is an unsupervised machine-learning approach aiming to cluster\nrows and columns simultaneously in a data matrix. Several biclustering\nalgorithms have been proposed for handling numeric datasets. However,\nreal-world data mining problems often involve heterogeneous datasets with mixed\nattributes. To address this challenge, we introduce a biclustering approach\ncalled HBIC, capable of discovering meaningful biclusters in complex\nheterogeneous data, including numeric, binary, and categorical data. The\napproach comprises two stages: bicluster generation and bicluster model\nselection. In the initial stage, several candidate biclusters are generated\niteratively by adding and removing rows and columns based on the frequency of\nvalues in the original matrix. In the second stage, we introduce two approaches\nfor selecting the most suitable biclusters by considering their size and\nhomogeneity. Through a series of experiments, we investigated the suitability\nof our approach on a synthetic benchmark and in a biomedical application\ninvolving clinical data of systemic sclerosis patients. The evaluation\ncomparing our method to existing approaches demonstrates its ability to\ndiscover high-quality biclusters from heterogeneous data. Our biclustering\napproach is a starting point for heterogeneous bicluster discovery, leading to\na better understanding of complex underlying data structures.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kVjfrQFTOMFSk15dmkfSLt-OIlWSzfJBt5GqYDMTB6A","pdfSize":"2248203"}
