{"id":"2408.01452","title":"Building a Domain-specific Guardrail Model in Production","authors":"Mohammad Niknazar and Paul V Haley and Latha Ramanan and Sang T.\n  Truong and Yedendra Shrinivasan and Ayan Kumar Bhowmick and Prasenjit Dey and\n  Ashish Jagmohan and Hema Maheshwari and Shom Ponoth and Robert Smith and\n  Aditya Vempaty and Nick Haber and Sanmi Koyejo and Sharad Sundararajan","authorsParsed":[["Niknazar","Mohammad",""],["Haley","Paul V",""],["Ramanan","Latha",""],["Truong","Sang T.",""],["Shrinivasan","Yedendra",""],["Bhowmick","Ayan Kumar",""],["Dey","Prasenjit",""],["Jagmohan","Ashish",""],["Maheshwari","Hema",""],["Ponoth","Shom",""],["Smith","Robert",""],["Vempaty","Aditya",""],["Haber","Nick",""],["Koyejo","Sanmi",""],["Sundararajan","Sharad",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 15:53:29 GMT"}],"updateDate":"2024-08-06","timestamp":1721836409000,"abstract":"  Generative AI holds the promise of enabling a range of sought-after\ncapabilities and revolutionizing workflows in various consumer and enterprise\nverticals. However, putting a model in production involves much more than just\ngenerating an output. It involves ensuring the model is reliable, safe,\nperformant and also adheres to the policy of operation in a particular domain.\nGuardrails as a necessity for models has evolved around the need to enforce\nappropriate behavior of models, especially when they are in production. In this\npaper, we use education as a use case, given its stringent requirements of the\nappropriateness of content in the domain, to demonstrate how a guardrail model\ncan be trained and deployed in production. Specifically, we describe our\nexperience in building a production-grade guardrail model for a K-12\neducational platform. We begin by formulating the requirements for deployment\nto this sensitive domain. We then describe the training and benchmarking of our\ndomain-specific guardrail model, which outperforms competing open- and closed-\ninstruction-tuned models of similar and larger size, on proprietary\neducation-related benchmarks and public benchmarks related to general aspects\nof safety. Finally, we detail the choices we made on architecture and the\noptimizations for deploying this service in production; these range across the\nstack from the hardware infrastructure to the serving layer to language model\ninference optimizations. We hope this paper will be instructive to other\npractitioners looking to create production-grade domain-specific services based\non generative AI and large language models.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BW2mVjqCnNHutqgv8xAZ5-Hie53BS4KU70fJxpJXRtM","pdfSize":"812917"}
