{"id":"2408.14022","title":"An Efficient and Exact Algorithm for Locally h-Clique Densest Subgraph\n  Discovery","authors":"Xiaojia Xu, Haoyu Liu, Xiaowei Lv, Yongcai Wang, Deying Li","authorsParsed":[["Xu","Xiaojia",""],["Liu","Haoyu",""],["Lv","Xiaowei",""],["Wang","Yongcai",""],["Li","Deying",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 05:24:10 GMT"}],"updateDate":"2024-08-27","timestamp":1724649850000,"abstract":"  Detecting locally, non-overlapping, near-clique densest subgraphs is a\ncrucial problem for community search in social networks. As a vertex may be\ninvolved in multiple overlapped local cliques, detecting locally densest\nsub-structures considering h-clique density, i.e., locally h-clique densest\nsubgraph (LhCDS) attracts great interests. This paper investigates the LhCDS\ndetection problem and proposes an efficient and exact algorithm to list the\ntop-k non-overlapping, locally h-clique dense, and compact subgraphs. We in\nparticular jointly consider h-clique compact number and LhCDS and design a new\n\"Iterative Propose-Prune-and-Verify\" pipeline (IPPV) for top-k LhCDS detection.\n(1) In the proposal part, we derive initial bounds for h-clique compact\nnumbers; prove the validity, and extend a convex programming method to tighten\nthe bounds for proposing LhCDS candidates without missing any. (2) Then a\ntentative graph decomposition method is proposed to solve the challenging case\nwhere a clique spans multiple subgraphs in graph decomposition. (3) To deal\nwith the verification difficulty, both a basic and a fast verification method\nare proposed, where the fast method constructs a smaller-scale flow network to\nimprove efficiency while preserving the verification correctness. The verified\nLhCDSes are returned, while the candidates that remained unsure reenter the\nIPPV pipeline. (4) We further extend the proposed methods to locally more\ngeneral pattern densest subgraph detection problems. We prove the exactness and\nlow complexity of the proposed algorithm. Extensive experiments on real\ndatasets show the effectiveness and high efficiency of IPPV.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}