{"id":"2408.09881","title":"Uncertainty Quantification of Pre-Trained and Fine-Tuned Surrogate\n  Models using Conformal Prediction","authors":"Vignesh Gopakumar, Ander Gray, Joel Oskarsson, Lorenzo Zanisi,\n  Stanislas Pamela, Daniel Giles, Matt Kusner, Marc Peter Deisenroth","authorsParsed":[["Gopakumar","Vignesh",""],["Gray","Ander",""],["Oskarsson","Joel",""],["Zanisi","Lorenzo",""],["Pamela","Stanislas",""],["Giles","Daniel",""],["Kusner","Matt",""],["Deisenroth","Marc Peter",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 10:46:19 GMT"}],"updateDate":"2024-08-20","timestamp":1724064379000,"abstract":"  Data-driven surrogate models have shown immense potential as quick,\ninexpensive approximations to complex numerical and experimental modelling\ntasks. However, most surrogate models characterising physical systems do not\nquantify their uncertainty, rendering their predictions unreliable, and needing\nfurther validation. Though Bayesian approximations offer some solace in\nestimating the error associated with these models, they cannot provide they\ncannot provide guarantees, and the quality of their inferences depends on the\navailability of prior information and good approximations to posteriors for\ncomplex problems. This is particularly pertinent to multi-variable or\nspatio-temporal problems. Our work constructs and formalises a conformal\nprediction framework that satisfies marginal coverage for spatio-temporal\npredictions in a model-agnostic manner, requiring near-zero computational\ncosts. The paper provides an extensive empirical study of the application of\nthe framework to ascertain valid error bars that provide guaranteed coverage\nacross the surrogate model's domain of operation. The application scope of our\nwork extends across a large range of spatio-temporal models, ranging from\nsolving partial differential equations to weather forecasting. Through the\napplications, the paper looks at providing statistically valid error bars for\ndeterministic models, as well as crafting guarantees to the error bars of\nprobabilistic models. The paper concludes with a viable conformal prediction\nformalisation that provides guaranteed coverage of the surrogate model,\nregardless of model architecture, and its training regime and is unbothered by\nthe curse of dimensionality.\n","subjects":["Computing Research Repository/Artificial Intelligence","Physics/Atmospheric and Oceanic Physics","Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}