{"id":"2408.00140","title":"Structural properties of subgroups of stars associated with open\n  clusters","authors":"J. Gregorio-Hetem (1), A. Hetem (2) ((1) Universidade de S\\~ao Paulo,\n  (2) UFABC Federal University of ABC)","authorsParsed":[["Gregorio-Hetem","J.",""],["Hetem","A.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 19:52:51 GMT"}],"updateDate":"2024-08-02","timestamp":1722455571000,"abstract":"  Recent studies have identified star clusters with multiple components based\non accurate spatial distributions and/or proper motions from Gaia DR3,\nutilising diverse diagnostics to improve our understanding of subgroup\nevolution. These findings motivated us to search for subgroups among the\nobjects examined in our previous work, which employed fractal statistics. The\npresent study considers seven open clusters that exhibit significant dispersion\nin age and/or proper motion distributions, suggesting that they would not be\nsingle clusters. For characterizing the stellar groups, we calculate the\nmembership probability using Bayesian multi-dimensional analysis by fitting the\nobserved proper motion distribution of the candidates. A probability\ndistribution is also used to determine the distance of the cluster, which is\nobtained from the mean value of the distance modes. The photometry from Gaia\nDR3 is compared with evolutionary models to estimate the cluster age and total\nmass. In our sample, double components are found only for Markarian 38 and NGC\n2659. The other five clusters are confirmed as being single. The structural\nparameters, such as Q, Lambda_MSR and Sigma_LDR are compared with results from\nN-body simulations to investigate how the morphology of the stellar clustering\nevolves. The new results, for a more complete sample of cluster members,\nprovide a better definition of the distribution type (central concentration or\nsubstructured region) inferred from the m-s plot.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xovU0I13V7VkqfFk27gaFxqzu28_3DdreSpcBJmiAAo","pdfSize":"14164978","txDigest":"3mPWYVieLMFkSFKNeKew5VrP9TEbaFN2K3nCXzQAVDkA","endEpoch":"100","status":"CERTIFIED"}
