{"id":"2408.13618","title":"Influence of selection criteria on the interpretation of rotational\n  behaviour of wide-binary star systems","authors":"Stephen Cookson","authorsParsed":[["Cookson","Stephen",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 16:11:48 GMT"}],"updateDate":"2024-08-27","timestamp":1724515908000,"abstract":"  Binary star systems are expected to follow Newtonian dynamics similarly to\nplanetary systems. However, reports have been made of wide binary systems with\nseparations around 0.01 pc and larger, showing potential deviations from\nstandard Newtonian motion. This phenomenon, suggestive of the flattening of\ngalactic rotation curves, calls for closer inspection. This study presents an\nanalysis of wide binary stars using data from Gaia Data Release 3 (DR3), a\nspace-based astrometry mission funded by the European Space Agency. The study\ncompares different choices of selection criteria to examine the nature of these\napparent anomalous kinematics within the solar neighbourhood. The Gaia data set\nfurnishes detailed parameters, including radial velocity, mass, age, and binary\nprobability in addition to standard parameters. A custom Python tool named\nBYNARY facilitated both data processing and analysis. This report reveals that\nthe signs of any anomalous signals systematically diminish as the initial\nselection criteria are relaxed for degrouping while subsequent filtering\nremains stringent, leading to the complete elimination of any apparent\nnon-Newtonian motion for binary separations within 0.5 pc. The study shows that\nan y observ ed anomalous behaviour in solar neighbourhood wide binaries within\n130 pc must be produced either by faint companion stars orbiting primary or\nsecondary stars, or by flyby stars. The findings emphasize the importance of\nthe choice of selection criteria in disentangling genuine binary dynamics from\nexternal influences. The conclusions align with the predictions of Newtonian\nmechanics and general relativity, though they do not exclude other phenomena at\nlarger scales.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}