{"id":"2408.01594","title":"\"I don't see myself represented here at all\": User Experiences of Stable\n  Diffusion Outputs Containing Representational Harms across Gender Identities\n  and Nationalities","authors":"Sourojit Ghosh, Nina Lutz, and Aylin Caliskan","authorsParsed":[["Ghosh","Sourojit",""],["Lutz","Nina",""],["Caliskan","Aylin",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 22:37:50 GMT"}],"updateDate":"2024-08-06","timestamp":1722638270000,"abstract":"  Though research into text-to-image generators (T2Is) such as Stable Diffusion\nhas demonstrated their amplification of societal biases and potentials to cause\nharm, such research has primarily relied on computational methods instead of\nseeking information from real users who experience harm, which is a significant\nknowledge gap. In this paper, we conduct the largest human subjects study of\nStable Diffusion, with a combination of crowdsourced data from 133 crowdworkers\nand 14 semi-structured interviews across diverse countries and genders. Through\na mixed-methods approach of intra-set cosine similarity hierarchies (i.e.,\ncomparing multiple Stable Diffusion outputs for the same prompt with each other\nto examine which result is 'closest' to the prompt) and qualitative thematic\nanalysis, we first demonstrate a large disconnect between user expectations for\nStable Diffusion outputs with those generated, evidenced by a set of Stable\nDiffusion renditions of `a Person' providing images far away from such\nexpectations. We then extend this finding of general dissatisfaction into\nhighlighting representational harms caused by Stable Diffusion upon our\nsubjects, especially those with traditionally marginalized identities,\nsubjecting them to incorrect and often dehumanizing stereotypes about their\nidentities. We provide recommendations for a harm-aware approach to (re)design\nfuture versions of Stable Diffusion and other T2Is.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/"}