{"id":"2408.00490","title":"Graph Representation Learning via Causal Diffusion for\n  Out-of-Distribution Recommendation","authors":"Chu Zhao, Enneng Yang, Yuliang Liang, Pengxiang Lan, Yuting Liu,\n  Jianzhe Zhao, Guibing Guo, and Xingwei Wang","authorsParsed":[["Zhao","Chu",""],["Yang","Enneng",""],["Liang","Yuliang",""],["Lan","Pengxiang",""],["Liu","Yuting",""],["Zhao","Jianzhe",""],["Guo","Guibing",""],["Wang","Xingwei",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 11:51:52 GMT"}],"updateDate":"2024-08-02","timestamp":1722513112000,"abstract":"  Graph Neural Networks (GNNs)-based recommendation algorithms typically assume\nthat training and testing data are drawn from independent and identically\ndistributed (IID) spaces. However, this assumption often fails in the presence\nof out-of-distribution (OOD) data, resulting in significant performance\ndegradation. In this study, we construct a Structural Causal Model (SCM) to\nanalyze interaction data, revealing that environmental confounders (e.g., the\nCOVID-19 pandemic) lead to unstable correlations in GNN-based models, thus\nimpairing their generalization to OOD data. To address this issue, we propose a\nnovel approach, graph representation learning via causal diffusion\n(CausalDiffRec) for OOD recommendation. This method enhances the model's\ngeneralization on OOD data by eliminating environmental confounding factors and\nlearning invariant graph representations. Specifically, we use backdoor\nadjustment and variational inference to infer the real environmental\ndistribution, thereby eliminating the impact of environmental confounders. This\ninferred distribution is then used as prior knowledge to guide the\nrepresentation learning in the reverse phase of the diffusion process to learn\nthe invariant representation. In addition, we provide a theoretical derivation\nthat proves optimizing the objective function of CausalDiffRec can encourage\nthe model to learn environment-invariant graph representations, thereby\nachieving excellent generalization performance in recommendations under\ndistribution shifts. Our extensive experiments validate the effectiveness of\nCausalDiffRec in improving the generalization of OOD data, and the average\nimprovement is up to 10.69% on Food, 18.83% on KuaiRec, 22.41% on Yelp2018, and\n11.65% on Douban datasets.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Retrieval","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Egf3WFheTfxLkbCv8kvYCH273Q7AAdGt9t9eafvAZLY","pdfSize":"1330082"}
