{"id":"2408.03075","title":"Characterizing the current systems in the Martian ionosphere","authors":"Jiawei Gao, Shibang Li, Anna Mittelholz, Zhaojin Rong, Moa Persson,\n  Zhen Shi, Haoyu Lu, Chi Zhang, Xiaodong Wang, Chuanfei Dong, Lucy Klinger,\n  Jun Cui, Yong Wei, Yongxin Pan","authorsParsed":[["Gao","Jiawei",""],["Li","Shibang",""],["Mittelholz","Anna",""],["Rong","Zhaojin",""],["Persson","Moa",""],["Shi","Zhen",""],["Lu","Haoyu",""],["Zhang","Chi",""],["Wang","Xiaodong",""],["Dong","Chuanfei",""],["Klinger","Lucy",""],["Cui","Jun",""],["Wei","Yong",""],["Pan","Yongxin",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 10:04:14 GMT"}],"updateDate":"2024-08-07","timestamp":1722938654000,"abstract":"  When the solar wind interacts with the ionosphere of an unmagnetized planet,\nit induces currents that form an induced magnetosphere. These currents and\ntheir associated magnetic fields play a pivotal role in controlling the\nmovement of charged particles, which is essential for understanding the escape\nof planetary ions. Unlike the well-documented magnetospheric current systems,\nthe ionospheric current systems on unmagnetized planets remain less understood,\nwhich constrains the quantification of electrodynamic energy transfer from\nstars to these planets. Here, utilizing eight years of data from the Mars\nAtmosphere and Volatile EvolutioN (MAVEN) mission, we investigate the global\ndistribution of ionospheric currents on Mars. We have identified two distinct\ncurrent systems in the ionosphere: one aligns with the solar wind electric\nfield yet exhibits hemispheric asymmetry perpendicular to the electric field\ndirection; the other corresponds to the flow pattern of annually-averaged\nneutral winds. We propose that these two current systems are driven by the\nsolar wind and atmospheric neutral winds, respectively. Our findings reveal\nthat Martian ionospheric dynamics are influenced by the neutral winds from\nbelow and the solar wind from above, highlighting the complex and intriguing\nnature of current systems on unmagnetized planets.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Physics/Space Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}