{"id":"2408.01912","title":"Design and Fabrication of Nano-Particles with Customized Properties\n  using Self-Assembly of Block-Copolymers","authors":"Changhuang Huang, Kechun Bai, Yanyan Zhu, David Andelman, and Xingkun\n  Man","authorsParsed":[["Huang","Changhuang",""],["Bai","Kechun",""],["Zhu","Yanyan",""],["Andelman","David",""],["Man","Xingkun",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 03:25:17 GMT"}],"updateDate":"2024-08-06","timestamp":1722741917000,"abstract":"  Functional nanoparticles (NPs) have gained significant attention as a\npromising application in various fields, including sensor, smart coating, drug\ndelivery, and more. Here, we propose a novel mechanism assisted by\nmachine-learning workflow to accurately predict phase diagram of NPs, which\nelegantly achieves tunability of shapes and internal structures of NPs using\nself-assembly of block-copolymers (BCP). Unlike most of previous studies, we\nobtain onion-like and mesoporous NPs in neutral environment and hamburger-like\nNPs in selective environment. Such novel phenomenon is obtained only by\ntailoring the topology of a miktoarm star BCP chain architecture without the\nneed for any further treatment. Moreover, we demonstrate that the BCP chain\narchitecture can be used as a new strategy for tuning the lamellar asymmetry of\nNPs. We show that the asymmetry between A and B lamellae in striped ellipsoidal\nand onion-like particles increases as the volume fraction of the A-block\nincreases, beyond the level reached by linear BCPs. In addition, we find an\nextended region of onion-like structure in the phase diagram of A-selective\nenvironment, as well as the emergence of an inverse onion-like structure in the\nB-selective one. Our findings provide a valuable insight into the design and\nfabrication of nanoscale materials with customized properties, opening up new\npossibilities for advanced applications in sensing, materials science, and\nbeyond.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GxLAu9oOhZu_BrimARr-mUNaP0rwRRA5gutL4R1dduc","pdfSize":"1030444","txDigest":"DiB6jVwUJJFfs12VqtqUMi2Xtn3pmu6FHtvHK8FCV1G4","endEpoch":"1","status":"CERTIFIED"}
